[
  {
    "title": "Doi",
    "content": "10.1016/j.cej.2021.133867"
  },
  {
    "title": "Article_Title",
    "content": "Nitric acid-assisted growth of InVO4 nanobelts on protonated ultrathin C3N4 nanosheets as an S-scheme photocatalyst with tunable oxygen vacancies for boosting CO2 conversion"
  },
  {
    "title": "Abstract",
    "content": "Engineering bulk defects and surface modifications are effective strategies to facilitate carriers separation and achieve high-efficiency photocatalysis, but it is challenging to realize the integrated regulation of the two aspects.Herein, we report an S-scheme heterojunction with tunable oxygen vacancies (Vo) via in-situ growth of InVO 4 nanobelts on protonated ultrathin C 3 N 4 nanosheets (p-C 3 N 4 /InVO 4 ) assisted by nitric acid for efficient CO 2 photoreduction.The nitric acid plays three roles in the synthetic process: providing protonation sources for the p-C 3 N 4 , assisting the growth of InVO 4 nanobelts on p-C 3 N 4 , and facilitating the formation of Vo in InVO 4 .Intriguingly, the Vo content is tuned by varying the amount of C 3 N 4 which reduces free H concentration and increases the electron density around V in VO 4 3-, leading to a tade-off effect on Vo formation and thus a volcanoshaped evolution profile of Vo content.The introduction of Vo reduces the band gap of InVO 4 and enhances the n-type conductivity, expediting the interfacial charge transfer in terms of the S-scheme pathway.Besides, the protonation of C 3 N 4 improves electrical conductivity, promotes the adsorption and activation of CO 2 molecules, and thermodynamically favours the conversion to CO. Due to the composite effect of Vo and protonation in the Sscheme system, the optimized p-C 3 N 4 /InVO 4 hetero-nanosheet displays dramatically boosted photocatalytic CO 2 reduction activity with a CO production rate of 14.05 mol g -1 h -1 , 6.03 and 3.23 times higher than that of bare InVO 4 and p-C 3 N 4 , respectively.This work provides new platforms for the development of efficient photocatalysts by integrated refining of structure defects and surface modification in constructing heterostructures."
  },
  {
    "title": "Experimental",
    "content": "The precursor was synthesized via a modified hydrothermal method 40,41.500 mg of melamine and 320 L of phosphorous acid were dispersed in 50 mL of distilled water at C in a thermostatic water bath with vigorous magnetic stirring for h.The resulting solution was then transferred into a 50 mL Teflon-lined autoclave and kept at 180 C for 10 h.After cooled down to room temperature, the product was collected by centrifugation, washed with distilled water several times until the pH value of the solution reaches 7, and dried at 60 C in an oven.The mass of the obtained sample was mg. Synthesis of ultrathin C 3 N 4 nanosheets: The as-prepared C 3 N 4 precursor was first dispersed into a mixed solvent of glycerol (5 mL) and ethanol (15 mL), and then refluxed at 90 C for 3 h.After cooled down, the precipitate was collected by centrifugation and washed with ethanol for three times, and then dried at 60 C. Finally, the resultant was calcined at 500 C in the air for 2 h with a ramp rate of 2 and maintained at 180 C for 18 h.The product was collected by centrifugation and washed with water and ethanol three times, respectively, and dried at 60 C for overnight.The addition amount of C 3 N 4 was set as 0, 30, 50, and 70 mg, the obtained sample was named as InVO 4 (x 0) and p-C 3 N 4 /InVO 4 -x (x 3, 5, and 7, respectively).As a comparison, the g-C 3 N 4 /InVO 4 -5 is prepared without the presence of dilute nitric acid, and InVO 4 -o is prepared without the addition of C 3 N 4 nanosheets and dilute nitric acid, according to the same procedures.The mass of the obtained sample was 125 mg. Synthesis of protonated C 3 N 4 nanosheets: 50 mg of ultrathin C 3 N 4 nanosheets was added into 30 mL of distilled water under vigorous stirring for 30 min to form a homogeneous solution.Then, the pH value of the solution was adjusted to 1 2 by stepwise adding a certain amount of nitric acid (5.3 M).The mixture was transferred into a Teflonlined autoclave and maintained at 180 C for 18 h.The product was collected by centrifugation and washed with water and ethanol three times, respectively, and dried at 60 C for overnight.The obtained sample was denoted as p-C 3 N 4 (mass: 45 mg). Synthesis of the mechanically mixed composite of p-C 3 N 4 and InVO 4 nanosheets: 50 mg of as prepared ultrathin p-C 3 N 4 nanosheets and 100 mg bare InVO 4 were grinded together, and the as-obtained sample was labeled as p-C 3 N 4 InVO 4 -5 (mass: 150 mg). The bare InVO 4 (100 mg) was calcined in the air at 250 C for 4 h with a ramp rate of 2 C/min, the obtained sample was labeled as InVO 4 -c (mass: 95 mg). Synthesis of InVO 4 with abundant Vo: 100 mg of bare InVO 4 was immersed in 0.05 M NaBH 4 aqueous solution at room temperature for 1 h 42, the as-obtained sample is labeled as InVO 4 -r (mass: 95 mg). Synthesis of p-C 3 N 4 /InVO 4 -5 without Vo: The p-C 3 N 4 /InVO 4 -5 (100 mg) was calcined in the air at 250 C for 4 h, the obtained sample was labeled as p-C 3 N 4 /InVO 4 -5-c (mass: 95 mg). X-ray diffraction (XRD) patterns of samples were collected on a Philips PW3040/60 X-ray diffractometer using Cu K radiation with a scanning rate of 0.06 s -1 .Morphological information was acquired on a Hitachi S-4800 field emission scanning electron microscope (FESEM).Microstructures were analyzed by transmission electron microscopy (TEM; JEM-2100F), high-resolution transmission electron microscopy (HRTEM), and scanning transmission electron microscopy-energy dispersive X-ray spectra (STEM-EDS) elemental mapping.X-ray photoelectron spectra (XPS) were obtained on an ESCALab MKII X-ray photoelectron spectrometer, and all of the binding energies were referenced to the C 1s level at 284.8 eV.UV-visible diffuse reflectance spectra (UV-vis DRS) were collected on a Thermo Nicolet Evolution 500 UV-vis spectrophotometer.The photoluminescence (PL) and transient photoluminescence spectra (TRPL) were measured by using an excitation wavelength of 375 nm on an FLS 920 and FLS 980 fluorescence spectrophotometer, respectively.The surface photocurrent (SPC) measurements were carried out at room temperature on a surface photovoltage spectrometer (PL-SPV/IPCE1000, Beijing Perfectlight Technology Co., Ltd.) consisting of a source of monochromatic light with a mechanical chopper (SR 540, Stanford research, Inc.).Zeta potentials were assessed by dynamic light-scattering analysis using the Zetasizer Nano ZS90.A Bruker EMX-plus X-band spectrometer was used to acquire the electron paramagnetic resonance (EPR) signals of radical spin-trapped by spin trap reagent 5, 5-dimethyl-1-pyrroline-N-oxide (DMPO) (purchased from Sigma Chemical Co.).In-situ diffuse reflectance infrared Fourier transform spectra (DRIFTS) were acquired on a Bruker INVENIO Fourier-transform infrared spectrometer (Karlsruhe, Germany), equipped with a liquid nitrogen-cooled HgCdTe (MCT) detector.Before the adsorption/desorption process, the samples were purged with He (50 mL min -1 ) for 1 h at 120 C, then the mixed gas flow (25 mL min -1 of He and 5 mL min -1 of CO 2 with a trace of H 2 O vapor) was introduced into the reactor to record the dynamic Fourier transform infrared spectroscopy (FTIR) signals.After reaching the adsorption equilibrium (30 min), the background spectrum was collected.Then, turn on the light irradiation (300 W Xeon lamp, AM 1.5 filter) and record the FTIR spectra at an interval to investigate the conversion dynamics of reactants under irradiation.The nitrogen adsorption-desorption isotherms of samples were measured at 77 K with Quantachrome autosorb iQ, the USA.The CO 2 absorption isotherms were measured using a BSD-PS (M) apparatus at 298 K. Photocatalytic CO 2 RR was performed on an automatic photocatalytic reaction system (Labsolar-6A, Beijing Perfectlight) using a Xeon lamp (Microsolar 300, Beijing Perfectlight) with a 420 nm cut-on filter as the visible-light source.Before photocatalytic tests, the asprepared photocatalyst (15 mg) was dispersed in 2 mL of distilled water and ultrasound for several minutes to form a homogeneous mixture, which was then slowly dropped on a fiberglass paper with an area of 12.56 cm 2 and naturally dried at room temperature.Subsequently, the fiberglass paper was put in a glass vessel (a volume of mL) containing 5 mL of deionized water.After that, the vessel was sealed with a quartz glass top, degassed to remove air, and filled with highpurity CO 2 (99.999).The temperature of the entire reaction system was kept at 25 C by cyclic condensed water.The generated gas from the reactor was analyzed by an online gas chromatograph (Shimadzu Gas Chromatograph GC-2014, Ar carrier).Isotope-labeling experiments were conducted under identical test conditions except using 13 CO instead of 12 CO 2 .0.1 mL of the gas product was withdrawn using a gastight syringe for gas analysis.The Agilent Technologies 6890 N network GC system combined with an Agilent Technologies 5975B inert XL MSD model mass spectrometer (GC-MS) was employed to collect the mass spectrometry data.The apparent quantum efficiency (AQE) of S-scheme photocatalytic CO evolution was calculated using the following equation: the number of reacted electrons the number of incident photons Where n co represents the mole number of evolved CO; N A is the Avogadro constant; h is the Planck constant;, W, A, and t are the incident light frequency, intensity, irradiation area, and time, respectively. The Mott-Schottky experiment was conducted on Zennium electrochemical workstation (ZAHNER, Germany) with a standard threeelectrode system, where Hg/HgO (saturated NaOH) and Pt wire were utilized as reference and counter electrode, respectively.The photocatalyst-coated glassy carbon electrode was used as the working electrode with 0.5 M Na 2 SO 4 aqueous solution as electrolyte.Electrochemical impedance spectroscopy (EIS) measurement was carried out in the three-electrode system by applying an ac voltage of 10 mV with frequency ranging from 0.1 Hz to 100 KHz and the aqueous solutions of K 3 Fe(CN) 6 (5 mM) and KCl (1 M) as electrolyte.The photocurrent measurement was performed on an electrochemical station (CHI 660E, China), the procedure was similar to the EIS measurement except using photocatalyst-coated fluorine-doped tin oxide (FTO) glass as a working electrode.The working electrode was prepared by dropping 8 L of photocatalyst-containing suspension (5 mg of photocatalyst powders was dispersed in a mixture of ethylene glycol (30 L), ethanol (50 L), and Nafion (10 L)) on the surface of FTO with 1.5 1 cm 2 areas, and dried at 50 C in an oven. Periodic DFT-based method with Perdew-Burke-Ernzerh of functional was applied for all of the calculations in this study using the Vienna ab initio simulation package 4344454647.During the calculations the valence electrons for V, In, O, C, and N atoms were set to p 6 d 4 s 1 , s 2 p 1 , s 2 p 4 , s 2 p 2 , s 2 p 3 , respectively.The DFT calculations were performed for the crystals, with a cutoff energy of 500 eV.The k-point Monkhorst-Pack grid of 9 6 8 was applied for the calculation of the bulk, giving rise to lattice parameters of a 5.81, b 8.58, and c 6.68 A, in good agreement with experiments 38.Then, a supercell of 2 1 1 was applied for the calculations of the electronic properties of InVO 4 material.Two different Vo were considered for the InVO 4 to evaluate the effect of Vo on electronic structures.For the density of states (DOS) calculations, the k-point grid was set to 9 12 15.The optimization of the 2 2 unit cells for the buckled C 3 N 4 was performed using a k-point of 3 3 1, which was increased to 8 8 1 for the DOS calculations.The optimized lattice parameters for the buckled C 3 N 4 are a b 6.93 A, well agreement with the previous DFT calculations 48.The vacuum was set to 20 A for the C 3 N 4 calculations. To understand the effect of protonation of C 3 N 4 on CO 2 hydrogenation, two hydrogen atoms were added to the C 3 N 4 sheet and the most stable structure was denoted as pristine C 3 N 4 .Gibbs free energy was calculated for each state in the reaction pathways of CO 2 hydrogenation using pristine C 3 N 4 and p-C 3 N 4 models.The key elementary reaction steps for CO 2 hydrogenation on the two models are given by:"
  },
  {
    "title": "Results_and_Discussion",
    "content": "The synthetic process of the p-C 3 N 4 /InVO 4 photocatalysts is illustrated in Scheme 1. Firstly, ultrathin C 3 N 4 nanosheets are prepared according to an intercalation and calcination method 41.Then, In 3 1a, p-C 3 N 4 only represents a characteristic peak located at 27.7 , corresponding to the diffraction of (0 0 2) crystal planes 49,50.The deletion of a diffraction peak at 13.1 from (1 0 0) planes is ascribed to fewer layer number of as-prepared p-C 3 N 4 as well as lattice distortion resulting from porous structures in-plane units 51.For pure InVO 4 , all diffraction peaks are well consistent with the orthorhombic phase (JCPDS No. 71-1689) 39.A local enlargement of the XRD patterns in the range of 24-29 shows that all the p-C 3 N 4 /InVO 4 samples contain two sets of diffraction patterns from InVO 4 and p-C 3 N 4 , and no additional diffraction peaks are observed (Fig. 1b).As the amount of p-C 3 N increases, the diffraction intensity of the (0 0 2) plane in p-C 3 N 4 rises.That is, InVO 4 and p-C 3 N 4 with controllable relative ratios are wellcombined together, implying the successful fabrication of p-C 3 N 4 / InVO 4 heterojunctions. FESEM is employed to inspect the morphology and microstructure of samples.As seen from Fig. S1a andb, the as-prepared p-C 3 N 4 shows a representative sheet-like morphology with a smooth surface, and abundant hole structures were formed within nanosheets, which may result from gas releasing (CO 2 , H 2 O, and NH 3 ) during the pyrolysis process of C 3 N 4 precursors 52.In contrast, pure InVO 4 appears irregular aggregates with a large size of several micrometers (Fig. S1c andd). After being deposited on p-C 3 N 4 nanosheets, the formed InVO 4 emerges as cross-linking nano-bundles (Fig. S2a andb).As C 3 N 4 content increases, these nano-bundles become remarkable, wrapping on the p-C 3 N 4 nanosheets (Fig. 2a and Fig. S2c-f).Note that, such hybrids cannot be formed without the presence of dilute HNO 3 (Fig. S3), indicating that the HNO 3 participates in and assists the in-situ growth process of InVO nanobelts on p-C 3 N 4 nanosheets. Fig. 2b illustrates TEM images of the p-C 3 N 4 /InVO 4 -5 sample, which confirms the belt-like morphology of InVO 4 loaded on p-C 3 N 4 nanosheets.The enlarged TEM image further reveals that the length of nanobelts is above 1 m and the width of nanobelts is distributed in 32-45 nm with an average size of about 38 nm (Fig. S4).Such face-toface contact is very beneficial for the separation and transfer of photogenerated charge carriers 53,54.The SAED pattern verifies the existence of orthorhombic-phase InVO 4 (Fig. 2c).The HRTEM image, obtained at the interface, reveals close contact between p-C 3 N 4 and InVO 4 as well as good crystallinity of InVO 4 nanobelts, which is conducive to electronic interactions between two components (Fig. 2d).Moreover, one set of clear lattice fringe is observed with a space of 0.202 nm corresponding to the diffraction of (1 3 2) planes of orthorhombic InVO 4 , while p-C 3 N 4 appears an amorphous state with no lattice fringes detected 55.The STEM-EDS elemental mapping (Fig. S5af) further confirms the coexistence and uniform distribution of In, V, O, C, and N elements in the p-C 3 N 4 /InVO 4 hetero-nanosheets.These results together demonstrate the successful construction of p-C 3 N 4 /InVO 4 hetero-nanosheets. To inspect the specific surface area and pore structures of the p-C 3 N 4 /InVO 4 samples, the N 2 adsorption-desorption isotherms are measured and shown in Fig. S6a-e, and the corresponding pore structural data are listed in Table S1.It can be found that bare InVO 4 has a very low BET surface area of about 7 m 2 g -1 , while bare p-C 3 N 4 has the highest BET surface area of 34 m 2 g -1 due to abundant porous structures.After being loaded with InVO 4 , the BET surface area of various p-C 3 N 4 /InVO 4 samples is significantly reduced to a relatively narrow range of 12 18 m 2 g -1 , due to the covering of porous structures by InVO 4 , acting as a function of the p-C 3 N 4 content.Moreover, all the samples mainly contain mesoporous structures with a close average pole diameter of around 30 nm.These results indicate all the p-C 3 N 4 /InVO samples have no obvious difference in BET surface area and pore structures. Furthermore, the CO 2 adsorption tests are carried out for the bare p-C 3 N 4 , InVO 4 , and different p-C 3 N 4 /InVO 4 samples.The corresponding adsorption curves and absorbing amount are depicted in Fig. S6f and Table S1.Obviously, the p-C 3 N 4 shows better adsorption affinity toward CO 2 than pure InVO 4 .After being loaded with InVO 4 , the adsorption capacity is gradually promoted with increasing p-C 3 N 4 content.In particular, the p-C 3 N 4 /InVO 4 -5 and p-C 3 N 4 /InVO 4 -7 samples display a 3a) 56.The V 2p-binding energies show two doublets: One is located at 517.74 eV and 525.29 eV, corresponding to V 2p 3/2 and V 2p 1/2 of V 5 , while the other one at 517.05 and 523.79 eV are attributed to V 2p 3/2 and V 2p 1/2 of V 3 , respectively (Fig. 3b) 56.According to charge neutrality law, the presence of V 3 probably results from the formation of Vo in InVO 4 .As expected, in the O 1s spectrum, besides lattice oxygen (Lo) at 530.20 eV and chemisorbed oxygen (Ao ) at 532.60 eV, an evident XPS peak centered at about 531.10 eV is assigned to Vo (Fig. 3c) 57.The area percentages of Lo, Vo, and Ao are 70.29,18.79, and 10.92 , respectively, indicating that a large amount of Vo is formed in bare InVO 4 .The InVO 4 -c displays a silent EPR signal compared to that of the bare InVO 4 , indicating the successful removal of Vo (Fig. S8a).Accordingly, the XPS analysis reveals that no peaks can be fitted at a binding energy of 531.10 eV in the O 1s high-resolution of InVO 4 -c (Fig. S8b), which is in contrast with that of the bare InVO 4 and thus confirm that the peak at 531.10 eV belongs to Vo.For bare InVO 4 , the C 1s spectrum can be fitted into three peaks located at 284.8, 286.2, and 288.7 eV, corresponding to C-C, C-NH x , and N-C N, respectively (Fig. S9).Similarly, the fitted N 1s spectrum also contains three N species: C-N C, N-(C) 3, and C-NH at 398.7, 399.7, and 400.9 eV, respectively 41.Upon hybridization in the p-C 3 N 4 /InVO 4 heterostructure, the XPS peaks of In 3d, V 2p, and O 1s display apparent shifts to lower binding energy, while those of C 1s and N 1s move towards higher binding energy, suggesting electron transfer from p-C 3 N 4 to InVO 4 .Meanwhile, the area percentage of Vo relative to other oxygen species is significantly increased from 18.79 to 29.13 , indicating that the presence of p-C 3 N 4 is conducive to the formation of Vo in the hybrid process.It is notable that the Vo concentration cannot result in the collapse of InVO 4 since the presence of Vo causes a certain lattice shrinkage, which plays a positive role in the stability of the crystals 58. To confirm the presence of Vo and study the influence of p-C 3 N 4 content on the Vo content in hetero-nanosheets, EPR measurements were performed on bare InVO 4 and various p-C 3 N 4 /InVO 4 samples.As expected, bare InVO 4 shows an apparent EPR signal with a g value of 2.003 (Fig. 3d), demonstrating the existence of Vo 59.Interestingly, the EPR signal intensity in p-C 3 N 4 /InVO 4 varies with the C 3 N 4 content, displaying a volcano-type evolution profile and reaching the maximum on p-C 3 N 4 /InVO 4 -5.It means that the Vo content in p-C 3 N 4 /InVO 4 hetero-nanosheets can be tuned and is up to the highest value in the p-C 3 N 4 /InVO 4 -5 sample. In the synthetic process of p-C 3 N 4 /InVO 4 hetero-nanosheets, a certain amount of C 3 N 4 and HNO 3 is added.The H is easily adsorbed on the surface of C 3 N 4 through the hydrogen bonding between H and pone pair electrons of the nitrogen, leading to the protonation of C 3 N 4 and electron delocalization in p-C 3 N 4 (Fig. S10a) 60.The protonation of C 3 N 4 is confirmed by the zeta potential measurements.As shown in Fig. S10b, the zeta potential value of as-prepared C 3 N 4 is -10.3 mV.When treated using HNO 3 , the potential reverses its charge to a positive value (1.44 mV), indicating successful protonation in p-C 3 N 4 . The formation of Vo in p-C 3 N 4 /InVO 4 can be rationalized from three aspects: (1) Free H from HNO 3 has a strong affinity with lattice oxygen of VO 4 3- 61, which facilitate the escape of lattice oxygen and thus is beneficial for the Vo formation.(2) The introduction of C 3 N 4 into reaction systems decreases the free H concentration due to the protonation of C 3 N 4 (p-C 3 N 4 ), which is somewhat detrimental to the Vo formation. (3) VO 4 3-can be adsorbed to C 3 N 4 s surface through the coordination bonds between V 3d empty orbitals and pone pair electrons of nitrogen.The delocalized electrons in p-C 3 N 4 can transfer to the empty orbitals of V 5 , as evidenced by the XPS analysis (Fig. 3b), which increases the electron density around V 5 and thus accelerate the dissolution of Lo in an acidic medium.That is, the introduction of C 3 N 4 also has a positive role in the formation of Vo.In a word, the presence of C 3 N 4 in reaction systems gives rise to two opposite effects on the formation of Vo.Note that, for the synthesis of bare InVO 4 , the absence of HNO 3 results in a negligible Vo concentration in the InVO 4 -o sample (Fig. S11).The obtained Vo concentration in the bare InVO 4 with the presence of HNO 3 is higher than that of the g-C 3 N 4 /InVO 4 -5, indicating H has a more remarkable effect on Vo formation than C 3 N 4 . Based on the above result and analysis, a plausible mechanism of Vo evolution with the C 3 N 4 amount may be described as follows.The HNO concentration in the reaction systems is fixed (5.3 M), as the C 3 N 4 increases, the free H concentration is gradually reduced due to the protonation process but still enough high to create a lot of Vo on the surface of InVO 4 (the total additional amount of C 3 N 4 is still small).At this stage, the negative effect of C 3 N 4 on Vo formation can be neglected, and the positive effect emerges.As a result, the Vo concentration gradually increases with increasing C 3 N 4 (from p-C 3 N 4 /InVO 4 -3 to p-C 3 N 4 /InVO 4 -5), as shown in Fig. 3d.Whereas, when the amount of C 3 N 4 exceeds a critical value and more H ions are used to protonation, resulting in that the free H concentration is insufficient to the formation of Vo.Thus, a reduced Vo concentration can be observed for the p-C 3 N 4 /InVO 4 -7 sample. Taken together with the above analysis, the dilute HNO 3 is found to play three roles in the synthetic process of the p-C 3 N 4 /InVO 4 heteronanosheets as follows: (i) providing H for the protonation process of p-C 3 N 4 , (ii) assisting the in-situ growth of InVO 4 nanobelts on p-C 3 N nanosheets, (iii) facilitating the escape of Lo in VO 4 3-and thus the formation of V O in InVO 4 .Hence, the dilute HNO 3 is indispensable for the construction of p-C 3 N 4 /InVO 4 hetero-nanosheets with tunable Vo. Photocatalytic CO 2 RR performance of bare InVO 4 , C 3 N 4 , p-C 3 N 4 , and various p-C 3 N 4 /InVO 4 hetero-nanosheets is assessed using a gas-solid reaction model under visible-light irradiation ( 420 nm).As illustrated in Fig. 4a andb, Both CO and CH 4 can be steadily evolved on all the samples, and CO is the main product.The p-C 3 N 4 exhibits a significantly enhanced catalytic activity compared with C 3 N 4 (C 1 compound production rate: 5.43 vs. 4.29 mol g -1 h -1 ), demonstrating the positive effect of protonation on photocatalytic activity of C 3 N 4 .As expected, bare InVO 4 shows the lowest photocatalytic activity due to the fast recombination of photogenerated carriers and insufficient active sites.When loaded on p-C 3 N 4 , the photocatalytic activity is greatly enhanced on p-C 3 N 4 /InVO 4 hetero-nanosheets.The increase of C 3 N 4 content results in a volcano-like evolution profile of photocatalytic activity among p-C 3 N 4 /InVO 4 samples (Fig. 4c).The p-C 3 N 4 /InVO 4 -5 with the highest V O content yields the highest C 1 compound evolution rate of 15.93 (CO: 14.05 and CH 4 : 1.88) mol g -1 h -1 , 5.93-and 2.93-fold higher than that of bare InVO 4 and p-C 3 N 4 , respectively.In particular, the CO evolution rate is respectively increased by 6.03-and 3.23-times and the selectivity of CO reaches 88.For the p-C 3 N 4 /InVO 4 -5, the AQE is 0.1 at 420 nm (Fig. S12).The photocatalytic CO 2 RR activity of p-C 3 N 4 /InVO 4 -5 is comparable to those of most C 3 N 4 -based photocatalysts (Table S2).In addition, the excess C 3 N 4 is detrimental to the photocatalytic activity (p-C 3 N 4 /InVO 4 -7), since both Vo content and light absorption capability of InVO 4 would decline. Furthermore, the photocatalytic activity on p-C 3 N 4 /InVO 4 -5 is enough stable in five cycles of a total of 20 h (Fig. 4d).After cycle tests, there is no significant change in morphology and phase constitution observed for p-C 3 N 4 /InVO 4 -5 (Fig. S13).To determine the origins of CO photoreduction products, we have traced the carbon sources in the reaction using a 13 C isotopic label.As shown in Fig. S14, the major mass spectrum signals with m/z values of 29 ( 13 CO) and 17 ( 13 CH 4 ) are clearly observed, indicating that the detected CO and CH 4 indeed originate from the photocatalytic CO 2 RR. As compared, the photocatalytic activity of the mechanically mixed composite of p-C 3 N 4 and InVO 4 (denoted as p-C 3 N 4 InVO 4 -5) is also measured and shown in Fig. S15a andb.It can be found that both CO and CH 4 can also be evolved on the p-C 3 N 4 InVO 4 -5 sample.However, the production rate of the two products is obviously lower than that of the p-C 3 N 4 /InVO 4 -5 photocatalyst.These results indicate that the close contact and interfacial charge transfer in heterostructures are the key factors for enhanced photocatalysis. Additionally, the O 2 evolution is also detected in the reaction systems of photocatalytic CO 2 RR.A typical time course of O 2 evolution and corresponding O 2 production rate are displayed in Fig. S16.As it can be seen, O 2 can be evolved on all the bare and hybrid heterostructures.For the p-C 3 N 4 /InVO 4 , the O 2 production rate is 6.52 mol g -1 h -1 , which is about half of the C 1 compounds production rate (15.93 mol g -1 h -1 ). The ratio of C 1 and O 2 production rate is relatively close to the theoretical value of 2:1, which indicates that the photogenerated holes participate in the water oxidation reaction for O 2 evolution. To investigate the photocatalytic mechanism of p-C 3 N 4 /InVO 4 hetero-nanosheets, the band structures of bare p-C 3 N 4 and InVO 4 are studied by UV-vis DRS and Mott-Schottky plots.As shown in Fig. 5a, the as-prepared C 3 N 4 shows an absorption edge of about 415 nm due to intrinsic band-gap transition.After protonation, the absorption edge of p-C 3 N 4 is extended towards the visible region (about 450 nm), due to the activation of n- transition via protonation 62.Bare InVO 4 exhibits a further extended absorption edge of about 550 nm with a warped tail in the red-light region, which is an indicator of Vo contained in InVO 4 63.Accordingly, all the UV-vis DRSs of p-C 3 N 4 /InVO 4 hetero-nanosheets appear evidently red-shifted, displaying extended sunlight harvesting, which can be attributed to the hot electron injection caused by the local surface plasmon resonance effect of the rich Vo present on the surface of the hybrid heterojunctions 64.According to the Tauc equation, the E g of p-C 3 N 4 and InVO 4 is determined to be 2.74 and 2.17 eV, respectively (Fig. 5b andc).The Mott-Schottky measurement is performed at three different frequencies (800, 900, and 1000 Hz) to determine the flat band potential (E fb ) of samples, as shown in Fig. 5d ande.The positive slopes of Mott-Schottky plots indicate the n-type nature of both p-C 3 N 4 and InVO 4 .The E fb is derived to be -0.80 and -0.11 eV (vs.NHE, pH 7) for p-C 3 N 4 and InVO 4 , respectively.Since E fb is relatively close to CBM energy (E CB ) for n-type semiconductors, the E CB of p-C 3 N 4 and InVO 4 are determined accordingly 65.The valence band maximum energy (E VB ) is calculated from E CB E g and determined to be 1.94 eV for p-C 3 N 4 and 2.06 eV for InVO 4 . Taken together, the band configuration of p-C 3 N 4 /InVO 4 heteronanosheets is plotted in Fig. 5f.According to the band alignment, photoexcited electrons have two kinds of transfer routes accessible between two semiconductors, i.e., S-scheme and Type-II routes.When the S-scheme route is adopted, the photoelectrons excited to CB of InVO would be transferred to VB of p-C 3 N 4 to combine with holes, leaving high-energy electrons in CB of p-C 3 N 4 participating in CO 2 RR and holes in VB of InVO 4 for water oxidation reactions.In contrast, if a type-II route is employed, photoelectrons would transfer from CB of p-C 3 N to CB of InVO 4 with lower E CB and thus degenerate reduction capacity.Meanwhile, photogenerated holes migrate in the opposite direction between the VB of two semiconductors, also reducing the oxidation ability of holes.Considering that (i) CO is the main reduction product, and (ii) the reduction potential of CO 2 /CO is more negative (-0.53 V) than that of CO 2 /CH 4 (-0.24V vs. NHE, at pH 7), being remarkably lower than E CB of C 3 N 4 when compared to that of InVO 4 , photoelectrons ought to adopt S-scheme rather than type-II route to reduce CO more easily. To confirm the charge transfer route in p-C 3 N 4 /InVO 4 under irradiation, radical trapping experiments and EPR analyses were conducted under the assumption that O 2 -and OH species are generated only when S-scheme instead of type-II routes are adopted by photoelectrons 66,67.As depicted in Fig. 6a, the characteristic signals from DMPO/ O 2 -adducts are clearly observed in methanol suspension of p-C 3 N 4 and p-C 3 N 4 /InVO 4 -5, while no obvious EPR signal is detected in the case of bare InVO 4 , indicating that photoreduction half reaction mainly occurs on the surface of p-C 3 N 4 rather than InVO 4 .The signal intensity of DMPO/O 2 -for p-C 3 N 4 /InVO 4 -5 is much higher than that of bare p-C 3 N 4 , suggesting that hetero-nanosheets have higher separation efficiency of photogenerated carriers.On the other hand, the production of OH is detected in photocatalyst aqueous suspensions, as shown in Fig. 6b.The EPR signal with an intensity ratio of 1:2:2:1 is detected for InVO 4 and p-C 3 N 4 /InVO 4 -5, whereas no EPR signal is observed for p-C 3 N 4 .Also, the DMPO/OH signal of p-C 3 N 4 /InVO 4 -5 is higher than that Collectively, the S-scheme route is verified. To further confirm the S-scheme heterostructures, in-situ irradiated XPS measurements were performed on the p-C 3 N 4 /InVO 4 -5 sample.It can be seen that the binding energies of In 3d, V, 2p, and O 1s positively shift by about 0.1 eV under visible irradiation relative to those in dark (Fig. 3a-c).A positive shift of binding energy indicates a decreased electron density around InVO 4 , suggesting the photoelectron transfer direction from InVO 4 to p-C 3 N 4 under light irradiation.Taking the band configuration of the p-C 3 N 4 /InVO 4 -5 into consideration (Fig. 5f), the Sscheme charge transfer pathway is determined 68. One can see from Fig. 5f that the E CB of bare InVO 4 is lower than both reduction potentials of CO 2 /CO and CO 2 /CH 4 (0.53 V and 0.24 eV), the photocatalytic CO 2 RR should not be driven in theory.The slight evolution of C 1 compounds can be rationalized by the presence of Vo as follow.Compared with the perfect surfaces of oxide semiconductors, the Vo is an active site for adsorption and activation of substrate molecules via electron interactions.For the chemisorbed substrate molecule on the Vo of metal oxide semiconductors, the enriched photogenerated electrons around Vo can inject into the antibonding -orbitals of substrate molecules 69.Typically, a CO 2 molecule is fixed by Vo and forms a bond with the sideward transition metal V.Under this condition, CO 2 molecules donate electrons from their bonding orbitals and accept electrons to their antibonding -orbitals.Such injection of photogenerated electrons is enhanced by the electrons exchange, which further weakens the CO bonds and activates CO 2 molecules 70.As a result, the photocatalytic CO 2 RR still occurs on the surface of the single InVO 4 with Vo.However, the introduction of excessive Vo in InVO 4 (InVO 4 -r) is detrimental to the photocatalytic activity, as shown in Fig. S11.The possible reason is that the rich Vo evolves into the recombination centers of photogenerated carriers 71. The Vo is also expected to enhance the S-scheme photocatalytic efficiency.To this end, the Vo content of p-C 3 N 4 /InVO 4 -5 is significantly reduced via calcination in the air, evidenced by the EPR spectrum (Fig. S11a), which results in a significant decrement in photocatalytic activity towards CO 2 RR in Fig. S11b.This result indicates that Vo attributes to the high photocatalytic activity by enhancing interfacial charge transfer. To reveal the origin of Vo on enhanced photoactivity, the Vo in InVO 4 was removed as a comparison by calcining bare InVO 4 in the air for 4 h, the obtained sample is labeled as InVO 4 -c.The Mott-Schottky plots of InVO 4 -c are measured as a comparison with bare InVO 4 (Fig. S17).The corresponding charge carrier density (N D ) is calculated according to equation ( 4): 72 where e is the electron charge (1.6 10 -19 C), 0 is the permittivity of vacuum (8.85 10 -12 F m -1 ), is the dielectric constant of InVO 4 (50 F m -1 ), C represents the space charge capacitance of semiconductors, and E is the potential applied at the electrode.The N D of InVO 4 with and without Vo is 9.36 10 26 and 2.08 10 27 cm -3 , respectively.The great difference in N D indicates that the presence of Vo remarkably improves the n-type conductivity of InVO 4 , which benefits the separation of photogenerated carriers and the S-scheme charge transfer process.Accordingly, the photoelectrical conversion efficiency of the S-scheme system is promoted. Furthermore, the electronic DOS of InVO 4 with and without Vo is calculated and shown in Fig. 7.It is found that perfect InVO 4 without Vo has a well-defined band gap between VBM and CBM with a E g of 2.86 eV (Fig. 7a andb).When removing one oxygen atom from the perfect model, two kinds of oxygen atoms with different environments could be adopted.The corresponding crystal models are labeled as Vo-1 and Vo-2 (Fig. 7c ande).Note that, the two kinds of Vo-containing models have almost the same formation energy (-345.50 vs. -345.60eV), indicating they may co-exist in InVO 4 .The presence of whether Vo-1 or Vo-2 induces the appearance of a new defect state below the Fermi level (Fig. 7d andf), that's the defect state is electron-occupied.As a result, under irradiation, the electrons in defect states can be excited to the CB of InVO 4 , resulting in significantly reduced E g of InVO 4 and extended visible-light harvesting.Additionally, in the p-C 3 N 4 /InVO 4 the N atom is prone to preferentially adsorb at Vo sites, leading to the close contact of N and V atoms, i.e. the bridging of V-Vo-N.As seen from the DOS profiles of p-C 3 N 4 and InVO 4 , the CB of InVO 4 is mostly attributed to the V 3d orbitals (Fig. 7b), while the VB of p-C 3 N 4 is mainly composed of N sp orbitals (Fig. 8e).As such, the bridging of V-Vo-N would promote the combination of electrons in CB of InVO 4 and holes in VB of p-C 3 N 4 , thus facilitating the charge transfer process in terms of the S-scheme route.efficiency of CO 2 to CO.To our best knowledge, the effect of protonation on CO 2 conversion is reported for the first time. Some control experiments are carried out to support the protonation effects.The g-C 3 N 4 /InVO 4 composite is prepared by using identical synthetic procedures to the p-C 3 N 4 /InVO 4 sample except for the presence of dilute HNO 3 .As shown in Fig. S11a, the EPR measurements reveal that the Vo content of g-C 3 N 4 /InVO 4 is significantly lower than that of the p-C 3 N 4 /InVO 4 .Due to the absence of face-to-face interface contact and reduced Vo concentration as well as the non-protonation, the g-C 3 N 4 /InVO 4 shows a relatively low photocatalytic CO 2 RR activity compared with the p-C 3 N 4 /InVO 4 (Fig. S11b).These results indicate HNO 3 plays important roles in the construction of the p-C 3 N 4 /InVO 4 heterostructures for achieving efficient photocatalysis.Besides, HNO 3 is replaced with HCl, H 2 SO 4 , H 3 PO 4 , and HCOOH as protonation resources to synthesis various p-C 3 N 4 /InVO 4 samples.As shown in Fig. S18, there is no evident difference of photocatalytic CO 2 RR activity observed for these samples, indicating that the anions of proton resources have no effects on the photocatalytic activity and the proton plays a key role in constructing p-C 3 N 4 /InVO 4 heterostructure and efficient CO 2 photoreduction. Based on the above analyses, the origin of enhanced photocatalytic CO 2 RR activity over p-C 3 N 4 /InVO 4 -5 is summarized from three aspects as follows.(i) The S-scheme system makes the spatial separation of photogenerated carriers and surface redox sites with high redox potential.(ii) The presence of Vo reduces the E g of InVO 4 , improves the n-type conductivity, and enhances the interfacial coupling between InVO 4 and p-C 3 N 4 , thus facilitating the S-scheme photocatalytic efficiency.(iii) The pronation of p-C 3 N 4 not only increases the electrical conductivity but also promotes the adsorption and activation of CO 2 molecules as well as the conversion of CO 2 to CO. A series of (photo)electrochemical characterizations support the boosted photocatalytic activity by the composite effect of Vo and pronation in the S-scheme system.Fig. 10a Accordingly, the p-C 3 N 4 /InVO 4 -5 has the strongest SPC response than other samples in the irradiation range of 300-450 nm (Fig. 10b).In the wavenumber range, both components can be simultaneously excited to carry out the S-scheme transfer.With visible-light irradiation, the transient photocurrent response of p-C 3 N 4 /InVO 4 -5 is significantly higher than those of other samples, especially bare InVO 4 , demonstrating remarkably enhanced photoelectrical efficiency in heteronanosheets.Furthermore, the high photocurrent response can be reproduced with light on and declines with light off in each illumination period for five on-off cycles, indicating good stability of the S-scheme transfer process in hetero-nanosheets (Fig. 10c) 79 corresponding to the fastest charge transfer kinetics.These results are consistent with the photocatalytic activity of samples."
  },
  {
    "title": "Conclusions",
    "content": "In summary, we have successfully synthesized an S-scheme p-C 3 N 4 / InVO 4 hetero-nanosheet with tunable Vo via in-situ growth of InVO 4 nanobelts on p-C 3 N 4 nanosheets with the assistance of dilute HNO 3 for efficient CO 2 photoconversion.The HNO 3 not only provides H sources for p-C 3 N 4 , but also assists the growth of InVO 4 nanobelts on p-C 3 N 4 and the formation of Vo in InVO 4 .The Vo content is tuned by varying the C 3 N 4 amount, which reduces the free H concentration and increases the electron density around V in VO 4 3-, leading to a tade-off effect on Vo formation and thus a volcano-shaped evolution profile of Vo content.The optimized p-C 3 N 4 /InVO 4 -5 with abundant Vo possesses the highest photocatalytic CO 2 RR activity, delivering a CO production rate of 14.05 mol g -1 h -1 , which is 6.03 and 3.23 times higher than that of bare InVO 4 and p-C 3 N 4 , respectively.The boosted photocatalytic activity is ascribed to the composite effect of Vo and protonation of C 3 N 4 in the Sscheme system.Vo creates a defect state below the Fermi level, which reduces E g for broad visible-light harvesting, enhances the n-type conductivity of InVO 4 and the S-scheme charge transfer.Besides, the protonation of C 3 N 4 not only improves the electrical conductivity for charge transfer to adsorbed CO 2 molecules, but also reduces the formation energy barrier of reaction intermediates of CO 2 to CO.This work provides a new platform for the improvement of photocatalytic activity via integrated engineering of bulk defects and surface catalytic sites. Scheme 1.The synthetic process of the p-C 3 N 4 /InVO 4 hetero-nanosheets. ions are sequentially adsorbed on C 3 N 4 nanosheets with the presence of HNO 3 , forming p-C 3 N 4 /InVO 4 precursors.Finally, the precursors are hydrothermally treated to obtain the p-C 3 N 4 /InVO 4 heteronanosheets.3.1.Characteristics of the p-C 3 N 4 /InVO 4 hetero-nanosheets 3.1.1.Phase constitution Phase constitutions of the as-prepared p-C 3 N 4 , InVO 4 , and p-C 3 N 4 / InVO 4 with different p-C 3 N 4 content are analyzed by XRD.As shown in Fig. Fig. 1.(a) XRD patterns, and (b) a local enlargement of the XRD patterns in a range of 24-29 of the as-prepared bare p-C 3 N 4 , InVO 4 , and p-C 3 N 4 /InVO 4 with different C 3 N 4 contents. Composition and chemical states The composition and chemical state of samples are further investigated by XPS.The survey XPS spectrum of p-C 3 N 4 /InVO 4 -5 confirms the existence of In, V, O, C, and N elements without impurity elements detected (Fig. S7).To reveal electronic interactions in p-C 3 N 4 /InVO 4 , the comparison of high-resolution XPS spectra of In 3d, V 2p, and O 1s between bare InVO 4 and p-C 3 N 4 /InVO 4 -5 is made.For bare InVO 4 , the In 3d spectrum depicts two symmetry peaks located at 445.14 and 452.69 eV with splitting energy of 7.55 eV, corresponding to In 3d 5/2 and In 3d 3/2 of In 3 (Fig. Fig. 2. (a) FESEM, (b) TEM, (c) SAED, and (d) HRTEM images of the p-C 3 N 4 /InVO 4 -5 sample. Fig. 3. High-resolution XPS spectra of the bare InVO 4 and p-C 3 N 4 /InVO 4 -5 with and without irradiation: (a) In 3d, (b) V 2p, and (c) O 1s.(d) EPR spectra of the bare InVO 4 and different p-C 3 N 4 /InVO 4 samples. Fig. 4. Typical time course of (a) CO and (b) CH 4 production catalyzed by bare C 3 N 4 , p-C 3 N 4 , InVO 4 , and different p-C 3 N 4 /InVO 4 samples.(c) Photocatalytic CO and CH 4 evolution rates on these samples in the first 4 h.(d) Cyclic tests of photocatalytic CO and CH 4 production on the p-C 3 N 4 /InVO 4 -5 sample. Fig. 5. (a) UV-vis DRS of different samples.Tauc plots of the bare (b) p-C 3 N 4 and (c) InVO 4 .Mott-Schottky plots of the bare (d) p-C 3 N 4 and (e) InVO 4 .(f) Schematic illustration of the band configuration and favored charge transfer pathway in the p-C 3 N 4 /InVO 4 hetero-nanosheets. Fig. 6.Identification of dominated free radicals produced in (a) methanol and (b) aqueous suspension of the p-C 3 N 4 /InVO 4 -5, p-C 3 N 4 , and InVO 4 after 5 min of visible-light illumination.EPR results of (a) O 2 -and (b) OH trapped by DMPO. Fig. 7. Crystal structure models and calculated DOS of (a and b) perfect InVO 4 without Vo, (c and d) InVO 4 with Vo-1, and (e and f) InVO 4 with Vo-2.The yellow circles represent Vo. (For interpretation of the references to colour in this figure legend, the reader is referred to the web version of this article.) Fig. 8. Crystal structure models of protonated C 3 N 4 with different N sites: (a) N Aro (b) N Tet , and (c) N Cen .Calculated DOS of the (d) C 3 N 4 and (e) p-C 3 N 4 nanosheets.(f) Calculated Gibbs free energy for photocatalytic CO 2 reduction on the p-C 3 N 4 and C 3 N 4 nanosheets. Fig. 9. In-situ DRIFTS spectra of the p-C 3 N 4 /InVO 4 -5 in the mixture gas of He, CO 2 , and H 2 O with and without irradiation. illustrates the PL spectra of bare InVO 4 , C 3 N 4 , p-C 3 N 4 , and various p-C 3 N 4 /InVO 4 samples.The as-prepared C 3 N 4 shows a strong PL emission, after protonation, the emission is obviously reduced for p-C 3 N 4 , indicating improved separation of electron-hole pairs by protonation.By contrast, bare InVO 4 shows a lower PL emission than p-C 3 N 4 .When loaded on p-C 3 N 4 (p-C 3 N 4 / InVO 4 -3, -5, and -7), the emission intensity further decreases, suggesting efficient interfacial charge transfer between p-C 3 N 4 and InVO 4 .Moreover, p-C 3 N 4 /InVO 4 -5 with the highest Vo has the lowest PL emission, which is ascribed to the composite effects of Vo and protonation. Fig. 10.(a) PL spectra (inset corresponds to the enlarged region in a grey dashed square), (b) SPC in terms of light wavelength, and (c) transient photocurrent response under visible-light irradiation ( 420 nm) and (d) EIS plots of the bare C 3 N 4 , p-C 3 N 4 , InVO 4 , and different p-C 3 N 4 /InVO 4 samples. This work is financially supported by the Major Program of Zhejiang Provincial Natural Science Foundation of China (D22B033885), Zhejiang Provincial Ten Thousand Talent Program and the Independent Designing Scientific Research Project of Zhejiang Normal University (2020ZS03).C. Guo acknowledges the financial support from the National Natural Science Foundation of China (22102145). The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://doi.org/10.1016/j.cej.2021.133867."
  }
]