[
  {
    "title": "Doi",
    "content": "10.1016/j.chemosphere.2021.131765"
  },
  {
    "title": "Article_Title",
    "content": "Effect of nonmetals (B, O, P, and S) doped with porous g-C3N4 for improved electron transfer towards photocatalytic CO2 reduction with water into CH4"
  },
  {
    "title": "Abstract",
    "content": "Nonmetals B, O, P, and S doping with porous g-C 3 N 4 . Photocatalytic CO 2 reduction with water to highly needed methane (CH 4 ). The S-doped g-C 3 N 4 efficiency was 2.4fold high than bare g-C 3 N 4 under UV light. Effective separation of photo-generated charge carriers contributes to the excellent activity. The multiple e -and H transfer by the proton-coupled electron transfer mechanism."
  },
  {
    "title": "Experimental",
    "content": "Urea (99.5 , Sigma Aldrich), sodium dihydrogen phosphate (99 , Acros Organics), thiourea (99 , QReC Chemicals), boric acid (99.5 , Sigma Aldrich), and hydrogen peroxide (30 , Merck) were utilized in this research.Milli-Q double distilled water was used for all the reaction, and all testing agents were employed as obtained. The porous g-C 3 N 4 was fabricated through thermal polycondensation reaction using low-cost nitrogen-rich precursor urea.Typically, urea (10 g) was taken in an alumina combustion boat and was wrapped with aluminium foil to prevent the sublimation and then heated to 550 C for 5 h at a ramp rate of 5 C/min under N 2 ambience.After cooling to normal temperature, yellow-color product was obtained.The bulk material was ground to a fine particle and was named as g-C 3 N 4 . In a typical synthesis, the calculated amount of sodium dihydrogen phosphate (0.24 g), boric acid (0.09 g), and thiourea (0.12 g) were separately added into the separate beakers each containing 10 g of urea. Then water (20 mL) was added into each beaker and sonicated for min and evaporate the water at 80 C under constant stirring.Then the obtained white crystalline compound was separately taken in an alumina combustion boat and wrapped with aluminium foil to prevent sublimation of urea and then heated to 550 C for 5 h at a ramp rate of 5 C/min in N 2 ambience.Finally, the obtained outcomes were cleaned with water and ethanol before drying at 80 C for 12 h.The products obtained were named as P, B, and S doped g-C 3 N 4 .The O-doped g-C 3 N was fabricated using the similar method via adding hydrogen peroxide (20 mL) as an oxygen source instead of water.The schematic illustration for the synthesis of these materials has been demonstrated in Scheme 1. The crystalline structure of as-obtained photocatalysts were ascertained using X-ray diffraction (XRD; Bruker D8 advance, Germany) through a Cu K source ( 0.154 nm).The chemical bond properties of as-synthesized materials were accomplished by Fourier transform infrared (FTIR; Thermo Nicolet 6700).The surface features and elemental composition of materials were performed by scanning electron microscopy (SEM; Hitachi S-3400 N) attached with energy dispersive X-ray (EDX; Apollo SDD detectors) and transmission electron microscopy (TEM; JEOL-JEM 2100).The light absorption aspects of photocatalysts were analyzed by UV-vis DRS (Cary 5000) spectrophotometer.The recombination rate and defects in the samples were performed using a photoluminescence (PL; Horiba Scientific FluoroMax-4 Series) spectrofluorometer.The surface area and porosity of materials were determined by using a Micromeritics ASAP 2020 instrument.The elemental states were analyzed through the X-ray photoelectron spectroscopy (XPS; Shimadzu Scientific AMICUS). The photocatalytic CO 2 reduction test was performed using a batch process under UV-light (Philips Germicidal UV-lamp 616 W, 100-280 nm).In this experiment, the calculated amount of asprepared photocatalysts (50 mg) was ultrasonically dispersed in mL of deionized water using a 250 mL three-neck cylindrical quartz photo-reactor.Then the reactor was tightly closed with a silicone rubber septum and saturate the solution with CO 2 gas for 30 min before the light illumination.During illumination, 0.5 mL of gaseous sample was taken every 60 min of the interval using a 2.5 mL gas syringe.The gaseous product such as CH 4 was analyzed through gas chromatography (Shimadzu GC-14A) fitted with a flame ionization detector (FID), ShinCarbon ST packed column and He carrier gas.All the experiments were carried out in a photoreactor without providing an external heat source."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The purity and crystalline structure of bare g-C 3 N 4 , B, O, P, and S doped g-C 3 N 4 photocatalysts were identified through the powder XRD technique and their respective XRD patterns are displayed in Fig. 1.The two noticeable peaks with strong intensities located at 2 values of 12.7 and 27.6 are corresponding to the (100) and (002) diffraction planes of bare g-C 3 N 4 (JCPDS No. 87-1526) (Mishra et al., 2021).The high-intensity peak at 2 value of 27.6 with interlayer distance 0.323 nm was ascribed to interlayer stacking of conjugated aromatic motif.In contrast, the weak intensity peak at a 2 value of 12.7 with interlayer distance 0.696 nm was credited to in-plane structure packing of tri-s-triazine units.Moreover, the two distinctive peaks of g-C 3 N 4 are found in the XRD patterns of the B, O, P, and S doped g-C 3 N 4 samples, which demonstrates that the non-metal dopants did not affect the g-C 3 N matrix.The crystalline size of bare g-C 3 N 4 , B, O, P, and S doped g-C 3 N are estimated to 6.34, 0.33, 6.45, 4.28, and 6.57 nm using Scherrer's formula, respectively (Malathi et al., 2017a).Besides, there were no other peaks associated with impurity phases, and the sharp peaks inferred the purity and crystalline property of the as-prepared samples. The FT-IR spectroscopy further characterized the chemical bond properties of as-synthesized photocatalysts.Fig. 2a display the FT-IR spectral results of bare g-C 3 N 4 , B, O, P, and S doped g-C 3 N 4 samples.In the spectrum of bare g-C 3 N 4 , two absorption bands positioned at and 886 cm -1 are owing to the bending vibration of the triazine unit and deformation of N-H (Wang et al., 2015).The characteristic bands noticed from 1201 to 1625 cm -1 are allocated to the stretching vibration of heterocyclic modes of g-C 3 N 4 (Zhang et al., 2020a).Furthermore, the extensive absorption band in the range of 3032-3362 cm -1 can be related to the stretching vibrational modes of uncondensed amino groups (NH and -NH) attached to sp 2 hybridized carbon (Li et al., 2018b).Furthermore, there were no significant changes in the FT-IR spectra of g-C 3 N 4 after inserting different non-metal (B, O, P and S), but the bands at 802 and 1384 cm -1 are slight shifts when compared with that of bare g-C 3 N 4 (Fig. 2b).These findings imply that B, O, P and S were firmly embedded in the matrix of g-C 3 N 4 . The surface morphology of as-prepared photocatalysts was assessed by SEM investigation.Fig. 3 displays the SEM images of porous g-C 3 N 4 , B, O, P, and S doped g-C 3 N 4 samples.The morphology of bare g-C 3 N exhibits (Fig. 3a andb) irregular granular and layered structures comprise many pores.This porous structure can be attributed to the liberation of ammonia and CO 2 gases during the pyrolysis of urea as similarly reported in the literature (Tahir et al., 2021).The B-doped g-C 3 N 4 (Fig. 3c andd) sample morphology displayed irregular nanosheets with porous structures.In contrast, the morphologies of O (Fig. 3e andf) and P (Fig. 3g andh) doped g-C 3 N 4 show thinner sheets like structure with some porous on their surfaces.The morphology of S-doped g-C 3 N 4 (Fig. 3i andj) displayed irregular granular and nanosheets contains porous structures.Moreover, the morphology of bare g-C 3 N 4 is no more similar after doping with non-metals namely B, O, P, and S. The elemental composition of as-prepared photocatalysts was studied by the EDX technique.It can be noticed that bare g-C 3 N (Fig. 4a) contains only C and N elements, whereas B, O, P, and S doped g-C 3 N 4 (Fig. 4b-e obvious that there are no other elements present in the spectral results that endorsed the purity of the as-prepared photocatalysts. Furthermore, the morphology of bare g-C 3 N 4 and S-doped g-C 3 N 4 were examined by TEM assay.As illustrated in Fig. 5a andb, bare g-C 3 N 4 exhibits a thin-layered structure containing many irregular porous forms.The S-doped g-C 3 N 4 (Fig. 5c andd) shows the existence of dense and homogenous distribution of S atom on the matrix of g-C 3 N 4 thinner nanosheet with some mesoporous.This suggests that the S atom can serve an electron sink, thus restricting the recombination of charge carriers. The characteristic optical nature of as-synthesized samples was studied by UV-vis DRS analysis.As depicted in Fig. 6a, all photocatalysts absorb light starting UV to the visible region (460 nm), and the absorption limit of bare g-C 3 N 4 was located at 430 nm.The band gap energy of photocatalysts was evaluated by the Kubelka-Munk method (Malathi and Madhavan, 2017), and the results are presented in Fig. 6b.The band gap energies of bare g-C 3 N 4 , B, O, P, and S doped g-C 3 N 4 materials were evaluate to be 2.98, 2.92, 2.96, 2.84, and 2.99 eV, correspondingly.It can be noticed that the addition of non-metals like B, O, P, and S into g-C 3 N 4 did not alter its band gap.However, it was noticed that the P-doped g-C 3 N 4 photocatalyst has a somewhat lower band gap value than bare g-C 3 N 4 , which ascribed to the variations in the color of the samples.Mostly, dark color samples exhibit more absorption in the visible spectrum (Arumugam et al., 2021a(Arumugam et al., , 2021b)).However, this concept is not applicable for all samples because the light absorption properties of semiconductor photocatalysts are depended on their band gap energy (Park et al., 2020).This outcome inferred that the superior PCA of as-prepared photocatalysts was not entirely credited to their photon absorption properties. The effect of B, O, P, and S doping on the recombination rate and photo-generated charge carrier separation efficacy of g-C 3 N 4 was investigated by PL analysis.It is believed that the lower PL signal reveals the slow recombination rate and better separation of charge carriers and leads to enhanced PCA (Malathi et al., 2017b).The PL spectra of all samples were measured at an excitation wavelength of 320 nm, and the findings are depicted in Fig. 6c.The bare g-C 3 N 4 displays a high intense emission signal at 485 nm compared with B, O, P, and S doped g-C 3 N 4 samples according to rapid recombination of photo-produced charge carriers.These outcomes imply that incorporating non-metals into the g-C 3 N 4 can significantly expand the charge separation efficiency and existence of the carriers (Mishra et al., 2021).Among all the samples, the S-doped g-C 3 N 4 sample shows the lower PL signal, which the S can act as the trapping site photogenerated charge carriers, results in a lower recombination rate (Wang et al., 2015).So, the S-doped g-C 3 N 4 sample is the best for the photocatalytic CO 2 reduction into CH 4 . The pore-size distribution and surface area of bare g-C 3 N 4 and Sdoped g-C 3 N 4 samples were estimated from the N 2 adsorptiondesorption technique, and the isotherms are displayed in Fig. 7.The bare g-C 3 N 4 and S-doped g-C 3 N 4 showed type IV hysteresis loop at a relative pressure (P/P o ) range from 0.7 to 1.0, indicating the presence of mesoporous (2-50 nm) in the materials (Fu et al., 2017).The pore size distribution results of bare g-C 3 N 4 and S-doped g-C 3 N 4 (inset in Fig. 7) display an extensive pore size (2-100 nm) distribution, further confirming the existence of mesoporous features.The high-intensity peak of bare g-C 3 N 4 is located at 14.35 nm, which corresponds to mesoporous, whereas a small peak of S-doped g-C 3 N 4 is placed at 2.92 nm owing to the small mesoporous existing in the sample.The surface area of bare g-C 3 N 4 is 58.54 m 2 /g, which slightly decreased to 56.11 m 2 /g after doping with S, and the relative pore volume of bare g-C 3 N 4 (0.35 cm 3 /g) and S-doped g-C 3 N 4 (0.33 cm 3 /g) exhibited a similar volume.These outcomes imply that the doping of the S element had no apparent effect on the g-C 3 N 4 matrix.Therefore, an improvement in PCA was not owing to the variation of surface area. XPS examined the chemical composition and the interaction between the elements.The full survey spectra (Fig. 8a) of bare g-C 3 N 4 and Sdoped g-C 3 N 4 showed three peaks at 286.7/286.7 eV (C 1s), 400.3/ 401.8 eV (N 1s), and 534.9/534.9eV (O 1s), respectively.The peaks of O 1s in survey spectra were attributed to the adsorbed water or uncondensed intermediates containing oxygen group produced in the pyrolysis of urea (Li et al., 2018b).The absence of a S peak in the survey spectra of the S-doped g-C 3 N 4 sample was due to the amount of S was (Fu et al., 2017).The high-resolution N 1s spectra (Fig. 8c) of bare g-C 3 N 4 and S-doped g-C 3 N 4 were de-convoluted into four peaks, the strong bands at 398.3/397.8eV were allotted to the sp 2 -bonded nitrogen group (C-N--C).The peaks of bare g-C 3 N 4 (399.7 eV) and S-doped g-C 3 N 4 (399.4eV) belonged to the tertiary nitrogen attached to carbon atoms (N-(C) 3 ).The peaks of bare g-C 3 N 4 (400.7 eV) and S-doped g-C 3 N (400.3eV) corresponded to the amino groups (C-NH).Moreover, the weak peaks of bare g-C 3 N 4 (403.9eV) and S-doped g-C 3 N 4 (403.6 eV) was related to the excitations (Wang et al., 2015).Fig. 8d displays the high-resolution spectra of the S 2p peak of bare g-C 3 N 4 and S-doped g-C 3 N 4 materials.The S 2p peak in the S-doped g-C 3 N 4 photocatalyst was deconvoluted into two peaks at 162.7 and 165.1 eV were attributed to the C-S bond and N-S bonds come from swapping lattice C with S demonstrating that the S element was doped to the g-C 3 N 4 (Vu et al., 2018;Xu et al., 2015).All these finding signify that the successful chemical doping of non-metal (S) elements into the g-C 3 N 4 matrix. As prepared non-metal doped g-C 3 N 4 photocatalysts, the PCA was evaluated towards the CO 2 reduction to CH 4 under UV illumination.All the tests were conducted at normal temperature without adding any sacrificial substances.The PCA of bare g-C 3 N 4 , B, O, P, and S doped g-C 3 N 4 were evaluated for CO 2 photoreduction to CH 4 with various irradiation time, and the results are shown in Fig. 9a.Compared to bare g-C 3 N 4 , all non-metal doped g-C 3 N 4 photocatalysts enhance the CH production rate during the photo-induced CO 2 reduction process.However, the CH 4 production trends were entirely different.After 7 h of illumination, the CH 4 production rate over the bare g-C 3 N 4 , B, O, P, and S doped g-C 3 N 4 were determine to be 22.1, 28.5, 38.0, 31.8, and 55.1 nmol/(mL H2O .gcat ), respectively.Fig. 9b shows the maximum CH 4 formation rate over bare g-C 3 N 4 , B, O, P, and S doped g-C 3 N 4 with production rate were determined to be 3.1, 4.0, 5.4, 4.5, and 7.8 nmol/ (mL H2O .gcat .h).The S-doped g-C 3 N 4 sample exhibits more CH 4 production of 7.8 nmol/(mL H2O .gcat .h),which was 2.5-folds as greater as bare g-C 3 N 4 .This enhanced PCA of S-doped g-C 3 N 4 was credited due to the efficient photo-generated charge carriers separation towards CO reduction into CH 4 under UV light.These findings confirm that nonmetal doped g-C 3 N 4 photocatalysts would be favorable to promote CH 4 production under UV light illumination. Furthermore, the stability of S-doped g-C 3 N 4 was also performed to verify the photostability.As presented in Fig. 10, the yield of CH 4 was continuous without any significant deactivation even after three cycles which reveals the higher photostability of the S-doped g-C 3 N 4 sample for CH 4 production.In addition, the recovered sample was collected and tested for the elemental analysis to confirm the leaching of doped nonmetal during the reaction.As given in Fig. S1, no considerable nonmetal (S) leaching was observed over S-doped g-C 3 N 4 compared with the fresh sample.It has been reported in the literature that the metal (Rb) doped g-C 3 N 4 sample shows high stability towards photocatalytic CO 2 reduction to CO after three cycles run (Zhang et al., 2020b).In addition, the non-metal (B) doped g-C 3 N 4 sample shows good stability towards H 2 evolution even after four cycles of runs (Mishra et al., 2021).These findings reveal that metal or non-metal doped g-C 3 N 4 photocatalysts encourage high stability towards photocatalytic CO 2 reduction and H 2 evolution. Acquired from the experimental results, improved PCA was primarily due to proficient separation of charge carriers over non-metal doped g-C 3 N 4 samples.The possible reaction mechanism is discussed for photocatalytic CO 2 reduction with water into CH 4 over S-doped g-C 3 N 4 as depicted in Fig. 11.Generally, the photocatalytic CO 2 reduction reaction involves following three steps: (i) CO 2 adsorption and activation; (ii) photo-produced charge carriers excitation and migration to the catalyst surface; and (iii) photocatalytic CO 2 reduction reaction (Huang et al., 2020).Upon illumination with UV-light, the g-C 3 N 4 photocatalyst generated electrons (e -) in the CB and holes (h ) in the VB, as shown in Eq. ( 1).Further, the e -on the CB migrate to S dispersed on the g-C 3 N 4 , as displayed in Eq. ( 2).The doping of S on g-C 3 N 4 facilitated the carrier separation and served as trapping center to trap the photogenerated electrons participating in the CO 2 photoreduction (Wang et al., 2015).The e -are exploited to reduce CO 2 to its radical (CO -), as shown in Eq. (3) (Tahir and Tahir, 2020).The water (H 2 O) oxidation arises at VB of g-C 3 N 4 to produce the energetic protons (H ) and oxygen, as shown in Eq. ( 4).In the present investigation, CH 4 was developed as a selective hydrocarbon fuel, which involves an 8e -/8H reduction process, as shown in Eq. ( 5).In semiconductors, the numerous e -and H transfer by proton-coupled electron transfer (PCET) mechanism is feasible for multi e -reduction reaction (Rather et al., 2018).Thus, the non-metal elements doped g-C 3 N 4 with enhanced photoactivity would be a promising material for renewable fuel production in the coming days. g-C 3 N 4 (e - CB ) S S (e -) g-C 3 N 4 (2) CO 2 e - CO"
  },
  {
    "title": "Conclusions",
    "content": "In conclusion, we have investigated the effect of non-metals doping on the PCA of porous g-C 3 N 4 for CO 2 reduction with water into CH 4 .The porous g-C 3 N 4 , B, O, P and S doped g-C 3 N 4 were prepared via a simple polycondensation process using low-cost precursors like urea, boric acid, hydrogen peroxide, ammonium dihydrogen phosphate, and thiourea.The rate of CH 4 production was 7.87 nmol/(mL H2O .gcat .h),which was higher among all the samples.The addition of non-metal to the g-C 3 N 4 remarkably improved its efficiency for CO 2 reduction with water into CH 4 .The preeminent performance of S-doped g-C 3 N 4 could be credited to the addition of the S atom, which constrains the rapid recombination of carriers.This work demonstrates that non-metal doped g-C 3 N 4 can be employed as a low-cost material for energy applications. Fig. 1.XRD patterns of bare g-C 3 N 4 , B, O, P, and S doped g-C 3 N 4 photocatalysts. Fig. 3. SEM images of (a, b) bare g-C 3 N 4 , (c, d) B-doped g-C 3 N 4 , (e, f) O-doped g-C 3 N 4 , (g, h) P-doped g-C 3 N 4 , and (i, j) S-doped g-C 3 N 4 photocatalysts. Fig. 4. EDX spectra of (a) bare g-C 3 N 4 , (b-e) B, O, P and S doped g-C 3 N 4 photocatalysts. Fig. 5. TEM images of (a, b) bare g-C 3 N 4 and (c, d) S-doped g-C 3 N 4 photocatalysts. Fig. 6.UV-vis DRS (a), band gap energies (b), and PL spectra (c) of bare g-C 3 N 4 , B, O, P, and S doped g-C 3 N 4 photocatalysts. Fig. 7.The N 2 adsorption/desorption isotherm and BJH pore size distribution (inset) of bare g-C 3 N 4 and S-doped g-C 3 N 4 . Fig. 9. (a) Photocatalytic CO 2 reduction into CH 4 with various irradiation time and (b) the maximum formation rates of CH 4 over bare g-C 3 N 4 , B, O, P, and S doped g-C 3 N 4 photocatalysts. Fig. 10.The cycling test for the photo-reduction CO 2 to CH 4 over the S-doped g-C 3 N 4 sample. Fig. 11.A possible photocatalytic CO 2 reduction mechanism for CH 4 production over S-doped g-C 3 N 4 . The authors Dr. Malathi Arumugam and Prof. Piyasan Praserthdam acknowledge the financial supported by the Second Century Fund (C2F) and the Malaysia Thailand Joint Authority Research Cess Fund, Chulalongkorn University, Thailand. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://doi. org/10.1016/j.chemosphere.2021.131765. Malathi Arumugam: Conceptualization, Methodology, Investigation, Writingoriginal draft, Writingreview editing.Muhammad Tahir: Investigation, Writingreview editing, Supervision.Piyasan Praserthdam: Supervision, Resources, Project administration, Funding acquisition."
  }
]