[
  {
    "title": "Doi",
    "content": "10.1016/j.jcou.2018.09.008"
  },
  {
    "title": "Article_Title",
    "content": "Enhanced photocatalytic CO2 reduction activity of Z-scheme CdS/BiVO4 nanocomposite with thinner BiVO4 nanosheets"
  },
  {
    "title": "Abstract",
    "content": "Construction of Z-scheme photocatalysts has drawn much attention in the field of CO 2 reduction.However, research on photoreduction CO 2 for monoclinic bismuth vanadate (m-BiVO 4 ) is restricted due to its low conduction band potential and short electron diffusion lengths.To address the issues, we herein constructed a series of CdS/BiVO 4 nanocomposites by depositing CdS on the surface of BiVO 4 coupling with controlling the thickness of BiVO 4 nanosheets.The morphological, crystalline, band alignment and optical properties of the samples are investigated intensively.Photocatalytic performance is evaluated by measuring the ability of the photocatalysts to convert CO 2 into CO and hydrocarbon fuels, primarily CH 4 .The composites exhibit more efficient photocatalytic activity than CdS and BiVO 4 , and the yields of CH 4 and CO vary depending on the thickness of BiVO 4 substrate.The maximum yields of CH 4 and CO for CdS/BiVO 4 with 55-75 nm BiVO 4 are 2.98 and 1.31 mol g -1 after 5 h irradiation, while those for its counterpart with 15-30 nm BiVO 4 attain 8.73 and 1.95 mol g -1 , respectively.The enhanced photoactivity of the composites is attributed to the band structure and Z-scheme charge transfer mode.Besides, thinner BiVO 4 nanosheets are confirmed to be favorable for improving the photoreduction CO 2 efficiency due to shorter electron diffusion lengths."
  },
  {
    "title": "Experimental",
    "content": "All the reagents used, including bismuth nitrate pentahydrate (Bi (NO 3 ) 3 After 0.5 h, the pH value of the mixed solution was adjusted to 2.5 and 6.5, respectively, with NaOH solution (2 M).The resulting solutions were sealed in Teflon-lined stainless steel autoclave and transferred to the oven at 160 C for 2 h.The obtained products were washed by distilled water and absolute alcohol for several times, and then dried at 70 C overnight.The prepared powders are named on the basis of preparation condition as I-BV (pH 2.5) and II-BV (pH 6.5), respectively. In a typical experiment, CdS/BiVO 4 composites were synthesized by the modified method reported previously 36.Cd(CH 3 COO) 2 2H 2 O with different moles was dissolved in 50 mL of deionized water to form solution C. A fixed amount of the as-prepared BiVO 4 powders (0.25 mmol, 0.081 g) were added into the solution C, and the mixture was treated ultrasonically for 0.5 h.Then 10 mL thiourea solution with different concentration (Table S1) was dipped into the above mixture with vigorous stirring for 20 min.After the mixture was heated at 90 C for 2.5 h, the obtained products were washed with distilled water and absolute alcohol, and then dried at 70 C for 12 h.The scheme diagram of the preparation process of CdS/BiVO 4 composites and the description of the growth mechanism are presented in Fig. S1.The prepared powders were labeled as I-BC-x and II-BC-x, x represnts 3, 4, 5 and 6 according to the Cd/Bi molar ratio of synthesis materials.To verify the real CdS percentage in the final CdS/BiVO 4 composites, energy dispersive spectroscopy (EDS) accompanying elemental and chemical analysis was conducted and the results are shown in Table S2.From the results of EDS mapping analysis, the real weight percentage of CdS in the I-BC-x is 12.4, 23.7, 31.3, and 47.2, respectively, while that of II-BC-x is 10.6, 21.5, 30.7 and 45.4, respectively. The crystal phase of the samples was characterized on X-ray diffractometer (XRD, PANalytical X' pert PRO).The morphology and composition were recorded by Field emission scanning electron microscopy (FESEM, Sigma 500) equipped with an energy-dispersive Xray spectroscopy analyzer (EDS) and transmission electron microscopy (TEM, TECNAI G 2 F20-S-TWIN).Moreover, high-resolution transmission electron microscopy (HRTEM) was employed.UV-vis diffuse reflectance spectra (DRS) were determined by a scan UV-vis spectrometer (Cary 5000) with integrating sphere detector.Chemical components and valence states were analyzed using X-ray photoelectron spectroscopy (XPS, PerkinElmer PHI 5300).Brunauer-Emmet-Teller (BET) surface area was measured with a Quantachrome Autosorb-IQ2 instrument with nitrogen adsorption at 77 K using the Barrett-Joyner-Halenda (BJH) method.Photoluminescence (PL) spectra were carried out on a Hitachi F-4600 spectrometer equipped with an EPL488 laser diode. Photocatalytic CO 2 reduction activity of the as-obtained catalysts was performed in gaseous phase in a 180 mL stainless steel container.A 300 W xenon arc lamp with a UV cutoff filter ( 400 nm) was used as light source and the light intensity was modulated to 145.9 mW/cm 2 .A fixed amount of 20 mg catalyst powder was dispersed uniformly on a circular glass dish which was fixed at the center of the photochemical reactor.The reactor was equipped with a quartz window for passing light irradiation from the reflector lamp located above the vessel. Before entering the reaction gas, the reaction container was vacuum-treated and then slowly filled with high purity CO 2 gas (99.995).Such operation was repeated for three times.Then the container was filled with CO 2 gas until the system pressure was up to 0.3 MPa.Finally, the xenon lamp light was opened and catalyst powders were irradiated under visible light.At an interval of 1 h, the gaseous products from the reactor were taken into a 7820 A gas chromatograph (GC, Agilent Technologies) for the analysis of methane and carbon monoxide.The scheme diagram of the experimental setup is displayed in Fig. S2.Meanwhile, blank tests were performed under irradiation without any photocatalysts or in the presence of catalysts without any irradiation.No methane or carbon monoxide was detected in blank tests within the detection limit of the GC instrument. The radical trapping experiment was carried out in the photodegradation of Rhodamine B (RhB) which was evaluated under visible light irradiation from 300 W xenon arc lamp with a UV cutoff filter ( 400 nm).50 mg of sample was dispersed into 100 mL of RhB solution (10 mg L -1 ) in a cylindrical quartz vessel and a quantity of scavengers was introduced into the RhB solution prior to addition of the catalyst.The concentration of scavengers was controlled to be 0.01 M according to the previous studies 37.Before irradiation, the suspension was placed in the dark under constant stirring for 60 min to reach adsorption/desorption equilibrium.At an interval of 15 min, samples were withdrawn and centrifuged to separate solid particles for analysis.The concentration of aqueous RhB was determined using TU-1810PC UV-vis absorption spectrum measurement at 554 nm after centrifugation.And the curve of C/C 0 relative to reaction time is plotted to characterize the photodegradation activity where C 0 is the concentration of RhB after adsorption process, and C is the time-dependent concentration of RhB upon irradiation. The photoelectrochemical tests of the samples were recorded by a CHI 660E electrochemical workstation (Chenhua Instrument Co., Ltd, Shanghai, China) with a common three-electrode system using Pt wire as a counter electrode, Ag/AgCl (saturated KCl) as a reference electrode and as-prepared photocatalysts as a working electrode.0.5 M Na 2 SO 4 aqueous solution was used as the electrolyte.The visible light source was provided by a 300 W xenon arc lamp with a UV-cut off filter ( 400 nm).The working electrode was prepared as follows: 0.040 g of as-prepared photocatalyst was dispersed in 5 mL of distilled water, and then 200 L of perfluorinated resin solution was added into above solution.The mixture was then spread on a 2.0 cm 1.0 cm F-doped SnO 2 (FTO) glass substrate by the drop-coating method.Finally, the working electrode was dried at 70 C for 1 h.The transient photocurrent and electrochemical impedance spectroscopy (EIS) were measured under visible light irradiation at 1.0 V (vs.Ag/AgCl) and 0.6 V (vs.Ag/ AgCl) in Na 2 SO 4 aqueous solution, respectively."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The crystal structures of BiVO 4 , CdS and CdS/BiVO 4 composites were identified by XRD analysis.The 2 values of I-BV and II-BV (Fig. 1a andb) at 18.7, 28.9and 30.6can be ascribed to (110), (-121) and (040) crystal planes of standard monoclinic phase BiVO 4 (PDF No. 01-075-1866).Moreover, the diffraction peaks are sharp, indicating that I-BV and II-BV are well-crystallized.The 2 values of CdS (Fig. 1e) at 26.6, 43.7and 51.9correspond to (002), ( 110) and (112) crystal planes of hexagonal phase CdS (PDF No. 01-080-0006).The diffraction intensity of the monoclinic phase BiVO 4 becomes gradually weaker with the increase of loading content of CdS.Meanwhile, no additional impurity peaks were observed in the diffraction patterns (Fig. 1c andd), suggesting that I-BC-5 and II-BC-5 exhibit a coexistence of BiVO 4 and CdS phase. The morphologies of BiVO 4 and CdS/BiVO 4 composites were observed by SEM.Typical SEM images of BiVO 4 prepared at pH 2.5 and 6.5 are shown in Fig. 2a andb.In both cases, the prepared materials are composed of nanosheets.The thickness of I-BV is observed to be 15-30 nm, while that of II-BV increases to 55-75 nm.As a matter of fact, the thickness and even morphology of BiVO 4 are closely related to the pH value of the synthesized systems, as shown in Table S2.When comparing SEM images of I-BC-x and II-BC-x, we found that CdS loading amount on the surface of both I-BV and II-BV increases with increasing x form 3 to 6 (Figs.S3 andS4).Typically, the SEM images of the representative I-BC-5 and II-BC-5 (Fig. 2c andd) show that the CdS nanoparticles are almost sphere with an average size of 30 nm, which are dispersed uniformly on the surface of BiVO 4 .Moreover, the CdS particle sizes of II-BC-5 are roughly the same as that of I-BC-5, which may be due to the steric hindrance of side group -NH 2 of thiourea.Further investigation of the EDS elemental mappings for I-BC-5 and II-BC-5 indicates that the elements Cd and S are dispersed uniformly on the surface of BiVO 4 nanosheets, as shown in Fig. 3 and Fig. S5.Considering that CdS nanoparticles have almost identical morphology and uniform distribution, we believe that the difference of the following photocatalytic activity between I-BC-5 and II-BC-5 is originated from thickness difference of BiVO 4 substrates. The microstructures and morphologies of pure BiVO 4 and the composites were further investigated using TEM and HRTEM.For pure BiVO 4 , regular and smooth nanosheets are clearly observed, as displayed in Fig. 4a.When forming composites, uniform CdS nanoparticles with 30 nm size are observed to be deposited on the surface of BiVO 4 (Fig. 4b).A representative of HRTEM image of I-BC-5 is showed in Fig. 4c.The clear lattice fringes with spacing distance 0.254 nm may correspond to (002) lattice plane of monoclinic BiVO 4 , while the lattice fringes with 0.316 nm spacing can be assigned to (101) lattice plane of hexagonal CdS.Similar HRTEM images are also observed for II-BV and II-BC-5 (Fig. S6).HRTEM images further confirmed that CdS nanoparticles were tightly attached to the surface of BiVO 4 nanosheets and the heterojunctions are formed at the interfacial phase.The formation of the heterojunctions between BiVO 4 and CdS phases is beneficial to the transport of photo-generated charges, as demonstrated below. UV-vis diffuse reflectance spectra (DRS) were carried out to investigate the light-harvesting ability.Fig. 5a shows the optical properties of I-BV, CdS and I-BC-x.The absorption edge of I-BV is located at around 480 nm.The addition of CdS apparently expands the absorption edge of BiVO 4 because CdS could harvest more photons for its wider absorption edge (525 nm).It is clear that the composite I-BC-x show obvious absorption in the visible light region, implying that the composite is able to utilize the visible light for photocatalytic CO 2 reduction.Fig. 5b shows the corresponding Tauc plots 38 and the band gaps (E g ) were calculated by the plot of (h) 2 versus photo energy (h) in consideration of BiVO 4 and CdS as indirect band gap semiconductors 33,36.The estimated E g value of I-BV is 2.58 eV, which is in accordance with the reported E g value of pure BiVO 4 39, while the E g value of CdS is 2.36 eV, agreeing well with previously reported E g of CdS 32.The E g value of the composite I-BC-x is observed to fall in the middle of I-BV and CdS (Table S4). The valence band (VB) and conduction band (CB) potentials for BiVO 4 and CdS can be estimated by combining band gap (E g ) with valence-band XPS, according to literature methods 8,40.Fig. 6 shows the valence-band XPS spectra characteristic with the edge of the maximum energy (E VB ) for I-BV and CdS.According to the linear intersection method 41, E VB of I-BV and CdS is estimated to be 2. To identify the element composition and chemical state of as-prepared CdS/BiVO 4 composites, X-ray photoelectron spectroscopy (XPS) analyses were performed.The survey XPS spectrum of I-BC-5 is shown in Fig. S9.It confirms the presence of Bi, S, V, Cd, O and C elements, in which the C element probably comes from the adventitious carbon.In the high-resolution Bi 4f spectrum (Fig. 8a), two distinct peaks at binding energies of 158.4 eV for Bi 4f 7/2 and 163.7 eV for Bi 4f 5/2 are observed, demonstrating that the valence state of Bi is 3 43.And the other two peaks in Fig. 8a at around 161.2 eV and 162.3 eV are attributed to S 2p 1/2 and S 2p 3/2 , respectively 44.In Fig. 8b, the V 2p spectrum shows binding energies at 516.0 eV for V 2p 3/2 and 523.8 eV for V 2p 1/2 45.The XPS signals of O 1 s are observed at binding energies of 529.3 eV, 531.7 eV and 533.2 eV (Fig. 8c), which may be ascribed to the lattice oxygen of layer-structured Bi 2 O 2 2 , surface adsorbed H 2 O and CeO/CO, respectively 46.The binding energies of Bi, V, and O are in conformity with those of monoclinic BiVO 4 47.In addition, the high resolution spectra of Cd 3d, as shown in Fig. 8d, present two peaks at 404.7 eV (Cd 3d 3/2 ) and 411.5 eV (Cd 3d 5/2 ), indicating that the Cd species exist as 2 48.The XPS results further confirm the existence of CdS on the BiVO 4 surface, which is in consistent with those of EDS and HRTEM. To further characterize the features of the structure of the composites, N 2 adsorption-desorption analyses were performed and the isotherms of the representative samples are displayed in Fig. 9 and Fig. S10.The specific surface areas were determined by the Brunauer-Emmett-Teller (BET) method and the calculational BET surface areas of I-BV, I-BC-3, I-BC-4, I-BC-5 and I-BC-6 are 9.08, 10.20, 13.58, 15.56 and 20.07 m 2 /g, respectively, while II-BV and II-BC-5 are 8.28 and 13.67 m 2 /g, respectively.The specific surface areas increase with the loading content of CdS nanoparticles.However, their products yields have no linear relationship with the content of CdS, and the I-BC-6 sample with the highest surface area does not exhibit the highest photocatalytic activity, as shown below.This result indicates that the specific surface area is not the dominant factor affecting the photocatalytic activity of CdS/BiVO 4 composites. In addition, II-BV and II-BC-5 have a smaller specific surface area because of the thicker thickness of II-BV nanosheets, which is one of the reasons for its poor photocatalytic activity.Consequently, the enhancement of photocatalytic ability for the CdS/BiVO 4 composites could not be attributed to one single factor, but the synergistic effects of various factors interwined, such as the thickness of BiVO 4 , the formation of heterojunction and the appropriate molar ratio of hetero-units of composite. The photoreduction CO 2 activity of the as-prepared photocatalysts were evaluated in the presence of water vapor under visible light irradiation ( 400 nm).The yields of the products during batch photocatalytic tests are displayed in Figs. 10 and11 and Fig. S11.The results indicate that the photocatalytic activity of BiVO 4 can be greatly improved via loading CdS nanoparticles on its surfaces.As shown in Fig. 10a andb, the photocatalytic activity of I-BC-x and II-BC-x first increases and then decreases as x increases from 3 to 6.With the increase of CdS content, the efficient heterojunction interfaces increase in the photocatalysts, thus resulting in the photocatalytic activity.At x 5, the optimal photocatalytic activity is achieved and the yields of CH 4 and CO attain 5.56 and 1.45 mol g -1 , respectively, after 3 h irradiation for I-BC-5.By contrast, the yields of CH 4 and CO for II-BC-5 are only 1.91 and 1.01 mol g -1 , respectively, under the same experimental conditions.Further increasing CdS loading amount, the yields of CH 4 and CO for both I-BC and II-BC decrease instead.According to Jin et al. 32, excess of CdS nanoparticles hinder the absorption of the incident light by BiVO 4 , resulting in a reduction in photocatalytic activity. It is worth noting that the yields of CH 4 and CO for all the I-BC composites are much higher than those of the corresponding II-BC composites.The reason may be attributed to the different thickness of the substrate BiVO 4 (Fig. 2).According to Seabold et al. 21, the electron diffusion length in BiVO 4 is about 10 nm.When the thickness of BiVO 4 is getting thinner, the photo-generated electrons are more easily transported to its surface, leading to efficient separation of photogenerated electron-hole pairs.The thickness of BiVO 4 in I-BV-x composites is 15-30 nm, while that in II-BV is 55-75 nm.The difference between the product yields of I-BV and II-BV can thus be explained.CO after 5 h irradiation for I-BC-5 attain 8.73 and 1.95 mol g -1 , respectively.Under the same conditions, the yields of CH 4 and CO for II-BC-5 are only 2.98 and 1.31 mol g -1 , respectively.It is clear that the composite with thinner substrate BiVO 4 is more conducive to the formation of CH 4 .If we convert the yields of CH 4 and CO to electronic consumption number, the comparative effect is more obvious.It has been demonstrated that the formation of one molecule of CO and CH 4 requires 2e -and 8e -, respectively 49.The electronic consumption moles for producing CO and CH 4 for II-BC-5 are thus equal to 2.62 and 23.84 mol g -1 , respectively, while for I-BC-5, the electronic consumption moles of CO and CH 4 correspond to 3.9 and 69.84 mol g -1 , respectively.The ratio of the photogenerated electrons utilizing for producing CH 4 and CO for I-BC-5 is approximately equal to 18: 1, while that for II-BC-5 is about 9: 1.It can be seen that with the decrease of BiVO 4 nanosheets, more photogenerated electrons are involved in the synthesis of methane.The results indicate that the products yields for the CdS/BiVO 4 composites may be modulated by regulating the thickness of BiVO 4 substrate.Additional tests are underway to further verify the role of the thickness of BiVO 4 . Since the photostability is very important to a photocatalyst for its practical applications, we further investigated the photostability of samples by recycling photocatalytic CO 2 reduction tests.From the cyclic performance tests of CdS, the activity of photoreduction CO 2 for CdS is decreased quickly with recycle times, indicating poor cyclic stability of CdS (Fig. S12a).By contrast, the yields of CH 4 and CO (4.21 and 1.17 mol g -1 ) for I-BC-5 are decreased slowly (Fig. S12b).The reduction of the yields of CH 4 and CO after the forth cycle is 24.4 and 23.2, respectively, much less than that of CdS.The results indicate that compared with pure CdS, the photostability of the prepared CdS/ BiVO 4 composites is improved greatly.The reason may be attributed to the formation of heterojunctions and the Z-type charge transfer mode.Furthermore, no obvious crystalline structure changes could be observed from the XRD patterns for I-BC-5 before and after recycling (Fig. S13), implying the relatively good phase stability. It is widely accepted that the photocatalytic activity of catalysts is largely dominated by visible light absorption ability, charge separation efficiency and valence band structure.For CO 2 reduction of VLD photocatalysts, the CB edge position should be more negative than the (-0.53V vs. NHE).Accordingly, we consider that the CdS/BiVO 4 composite adopted Z-scheme transfer mode under our experiment conditions, i.e., the charge transfer mode directly quenches the reductive electrons of BiVO 4 and the oxidative holes of CdS. To give powerful supports to Z-scheme mode, different scavengers or quenchers were selected in the literatures to verify the existence of the main reactive species directly involved in the process of photocatalysis 36,37,51.In addition, various model organic pollutants, such as anionic dye MO, cationic dye RhB, pollutant phenol and/or antibiotic SD, were employed for the photocatalytic degradation reactions.Regretfully, it is very difficult for gas-phase reaction to detect the generation of the intermediate species.Therefore, we adopt an indirect method, in which a few reactive species are determined by radical trapping tests in the solution in the photodegradation of RhB over I-BC-5.Silver nitrate (AN), isopropyl alcohol (IPA), ammonium carbonate (AC), and benzoquinone (BQ) were added to the reaction solution as e -, OH, h and O 2-radical scavengers, respectively.Fig. 13 shows the photocatalytic activity of I-BC-5 in the presence of these scavengers.All the scavengers could partially suppress the photocatalytic activity of I-BC-5, and the photocatalytic process would be almost thoroughly suppressed with the presence of both AN and AC in the system simultaneously.The experimental results confirmed that the e -, OH, h and O 2-radicals are the main active species responsible for the degradation of RhB.Considering that the CB edge potential of BiVO 4 is positioned at 0.21 eV vs. NHE, more positive than E O2/O2-(-0.046 eV vs. NHE) 52, the electrons on BiVO 4 cannot reduce O 2 into O 2- species.As a result, the radical trapping experiments indicate that the photoexcited electrons in CdS/BiVO 4 composites accumulate on the CB of CdS.This result is in good agreement with the above inferred Zscheme mechanism. Based on the radical trapping tests and the photocatalytic activity tests, we confirm that the CdS/BiVO 4 composites adopt Z-scheme charge transfer mode under our experiment conditions.Similar charge transfer mode could be found out in other analogous CdS/BiVO 4 photocatalytic systems 36,53,54. With regard to the enhanced yield of CH 4 product for I-BC-5, more photogenerated electrons for thinner BiVO 4 nanosheets will be generated under visible-light irradiation due to shorter electron diffusion length of thinner BiVO 4 .Simultaneously, the photogenerated electrons on the CB of BiVO 4 would recombine with the holes of CdS nanoparticles at the interfacial phases, resulting in more efficient separation efficiency.As mentioned above, the generation of one molecule CH 4 and CO requires 8e -and 2e -, respectively.When the number of the photogenerated electrons is relatively small, it is favorable to the production of CO.With increasing reaction time, the increase of electron density on the CB of CdS is more beneficial to the generation of CH 4 55,56.As a result, the CH 4 yield of I-BC-5 with thinner BiVO 4 substrates are higher than II-BC-5 with thicker BiVO 4 substrates due to shorter electron diffusion lengths of thin BiVO 4 coupling with Z-scheme charge transfer. To further verify the separation and transfer efficiency of photogenerated electron-hole pairs in the CdS/BiVO 4 composites, the photoluminescence (PL) spectra, transient photocurrents and electrochemical impedance spectra (EIS) were performed 57,58.As shown in Fig. 14"
  },
  {
    "title": "Conclusions",
    "content": "Heterostructured CdS/BiVO 4 nanocomposites were prepared by depositing CdS on the surface of BiVO 4 nanosheets with the thickness of 15-30 nm and 55-75 nm, respectively.The composites are demonstrated to be fine VLD photocatalysts for CO 2 reduction and exhibit better catalytic activities than blank BiVO 4 and pure CdS under visiblelight irradiation ( 400 nm).The optimal yields of CH 4 and CO after 5 h irradiation for I-BC-5 attain 8.73 and 1.95 mol g -1 , respectively.In addition, the composites with the substrate 15-30 nm thickness have more efficient photocatalytic activity compared to those with 55-75 nm thickness BiVO 4 .The enhanced photoactivity of the composites is ascribed to Z-scheme charge transfer across the heterojunctions coupling with the effect of shorter electron diffusion lengths of thin BiVO 4 . Fig. 1.XRD patterns of I-BV (a), II-BV (b), I-BC-5 (c), II-BC-5 (d) and CdS (e).( represents the characteristic peak of BiVO 4 ; represents the characteristic peak of CdS.). Fig. 2. SEM images of I-BV (a), II-BV (b), I-BC-5 (c) and II-BC-5 (d). Fig. 3. Electronic image (a) and the corresponding EDS mappings for elements Bi (b), V(c), O (d), Cd (e), S (f) of I-BC-5. 79 and 1.76 eV, respectively.The conduction band (CB) can be calculated by the equation (E CB E VB -E g ), and thus, the CB values of I-BV and CdS are 0.21 and -0.60 eV, respectively.Similarly, the band gap structure of II-BV can be determined by DRS and valence-band XPS spectra, and the estimated E CB and E VB of II-BV are 0.13 and 2.75 eV, respectively (Figs.S7 and S8).It can be seen that the band positions of II-BV is very close to those of I-BV, implying that the difference of the following photocatalytic activities between I-BC-x and II-BC-x does not result from the band gap structure of BiVO 4 substrate.Combining the band gap structure with the redox potential of CH 4 /CO 2 , CO/CO 2 and O 2 / H 2 O (-0.24, -0.53 and 0.82 eV vs NHE, respectively, at pH 7) 42, a schematic diagram of the band gap positions of BiVO 4 and CdS can be sketched as Fig. 7. Fig. 4. TEM images of I-BV (a), I-BC-5 (b) and HRTEM image of I-BC-5 (c). Fig. 5. UV-vis diffuse reflectance spectra (DRS) of I-BV, I-BC-x, and CdS (a) and corresponding (h) 2 plots versus h (Tauc plots) (b). Fig. 6.Valence-band XPS spectrum of I-BV (a) and CdS (b). Fig. 7. Band gap positions of BiVO 4 and CdS. Fig. 8. High-resolution XPS spectra of Bi 4f/S 2p (a), V 2p (b), O 1 s (c) and Cd 3d (d) of I-BC-5. Fig. 9. N 2 adsorption-desorption isotherms of I-BV and I-BC-x. Fig. 10.Yields of products for different Cd/Bi molar ratio (x) of I-BC (a) and II-BC (b) after 3 h visible light irradiation. Fig. 11.CO and CH 4 yields of BiVO 4 , CdS, II-BC-5 and I-BC-5 under visible light irradiation for different time. Fig. 12. Illustration of photo-generated electron-hole pairs separation: doublecharge transfer mechanism (a) and Z-scheme mechanism (b). Fig. 13.Photodegradation of RhB over I-BC-5 in the presence of different scavengers.RhB dye concentration: 10 mg L -1 , pH 7. Photocatalyst suspended: 0.5 g L -1 . , the PL spectra of I-BV, I-BC-x and CdS samples were measured with an excitation wavelength of 360 nm.The spectra of I-BV and CdS show strong emission peak at about 520 and 570 nm, respectively.The order of the PL intensity of the measured samples is I-BV CdS I-BC-3 I-BC-4 I-BC-6 I-BC-5, indicating that the formation of CdS/ BiVO 4 heterojunctions can effectively hinder the recombination of photogenerated electrons and holes.When loading superfluous CdS nanoparticles on surface of BiVO 4 nanosheets, however, the PL peak intensity of I-BC-6 increases instead.The reason may be explained that the supernumerary CdS nanoparticles cannot contact with BiVO 4 to form heterojunctions but reduce light absorption efficiency.Furthermore, the PL intensity of I-BV and I-BC-5 is obviously weaker than that of II-BV and II-BC-5, respectively, as displayed in Fig. S14.The results confirm once more that thinner BiVO 4 nanosheets have more effective charge separation efficiency.Fig. 15 shows the photocurrents of the composites I-BC-5 and II-BC-5 as well as CdS, I-BV and II-BV.The CdS/BiVO 4 electrodes exhibit obviously enhanced photocurrents as compared to blank BiVO 4 and CdS, indicating more efficient separation of electron-hole pairs in the CdS/BiVO 4 composites.Notably, the photocurrent of I-BC-5 is also improved in comparison with II-BC-5, further confirming the role of thickness on the electrons transfer.Fig. 16 shows EIS spectra presented in Nyquist diagram at frequency range of 10 5 Hz-0.1 Hz.The Nyquist plots of the composite electrodes exhibit more depressed radius than single phase materials.Generally, a smaller radius corresponds to the faster interfacial electron transfer 59, i.e., more efficient transfer of charge carriers is achieved by forming the heterojunctions between BiVO 4 and CdS.The radius of I-BV and I-BC-5 is clearly smaller than that of II-BV and II-BC-5, respectively.The results support once again the conclusion about the effects of the thickness of BiVO 4 on the electron transfer. Fig. 14.PL spectra of I-BV, I-BC-x and CdS under the excitation wavelength of 360 nm. Fig. 15.Transient photocurrent of I-BV, II-BV, CdS, I-BC-5 and II-BC-5. Fig. 16.Electrochemical impedance spectroscopy (EIS) plots of I-BV, II-BV, CdS, I-BC-5 and II-BC-5. We would like to thank the financial supports of the National Natural Science Foundation of China (Nos.21671176, 21471133 and 21541011).We are also indebted to Center of Advanced Analysis Computational Science, Zhengzhou University for XPS measurements. Appendix A. Supplementary data Supplementary material related to this article can be found, in the online version, at doi:https://doi.org/10.1016/j.jcou.2018.09.008."
  }
]