[
  {
    "title": "Doi",
    "content": "10.1016/j.jallcom.2021.159400"
  },
  {
    "title": "Article_Title",
    "content": "Black single-crystal TiO2 nanosheet array films with oxygen vacancy on {001} facets for boosting photocatalytic CO2 reduction"
  },
  {
    "title": "Abstract",
    "content": "Black TiO 2 nanosheet array films with oxygen vacancy on 001 facets were prepared by solid phase reaction with a mild aluminothermic reduction method.The oxygen vacancies increase the absorption of visible light and the separation efficiency of photogenerated electron-hole pairs.For the black TiO 2 with oxygen vacancy prepared by annealing, only the oxygen vacancies on 001 facets boost the photocatalytic CO 2 reduction, while these on 101 facets in a small number increase the recombination of photogenerated electrons and holes and inhibit the photocatalytic CO 2 reduction performance.Meanwhile, the black TiO 2 nanosheet array films with oxygen vacancy on 001 facets have a good photocatalytic CO 2 reduction to CO with a reduction rate of 128.5 molg -1 h -1 under visible light irradiation, which is ascribed to the formation of oxygen vacancy and the synergistic effect of special unsaturated coordination Ti 5c atom improving the adsorption capacity of CO 2 and increasing the reduction rate of CO 2 to CO."
  },
  {
    "title": "Experimental",
    "content": "Tetrabutyl titanate (TBOT), urea, ammonium hexafluorotitanate, fine aluminum powder were purchased from Tianjin Beichen Fangzheng Reagent Factory, China.FTO conductive glass and hydrochloric acid were purchased from Sinopharma Chemical Reagent Co. LTD, China. TiO 2 nanosheet array films with exposed high activity 001 facets were grown on FTO through a facile hydrothermal method.The preparation process is shown in Fig. 1.In detail, 30 mL of deionized water and 30 mL of hydrochloric acid were poured into a 100 mL breaker with magnetic stirring for 5 min.Next, TBOT was slowly dropped into the mixture and continually stirred for another 15 min till the solution became clear.Then, 0.4 g of urea was added into the mixture.After magnetic stirring for 10 min, 0.4 g of ammonium hexafluorotitanate was added and magnetic stirring was kept for 5 min to form the reaction solution.Afterwards, the mixture was transferred into a 50 mL Teflon-lined stainless steel autoclave with FTO conductive glass, and allowed reaction at 160 C for 18 h.After hydrothermal reaction, the FTO conductive glass coated with TiO 2 nanosheet array films was took out from the Teflon-lined stainless steel autoclave and washed with DI water for several times before drying naturally.The prepared samples were annealed for 2 h at 500 C in air to remove F -ions and HCl from the surface, denoted as TiO 2 NS. The prepared white TiO 2 nanosheet array films were wrapped in aluminum powder in a crucible with a cover, placed in a tubular furnace, purged with an inert gas flow (Ar) for 0.5 h, and subsequently, annealed at 500 C for 2, 4, 6 h, separately, in Ar atmosphere, as shown in Fig. 1.The obtained samples are denoted as b-TiO 2 NS-2, -4, -6, respectively.After natural cooling, the samples were removed from the crucible with a cover, and the aluminum powder on the surface was washed by ultrasonic method. The crystal structure and phase composition of samples were detected by X-ray diffraction (XRD) on a diffractometer with Cu K radiation ( 1.5406A) operating at 40 kV and 40 mA in 2 range of 10-80.Raman spectra were recorded on a Renishaw in Via Qontor confocal microscope with a 457.9 nm laser.Scanning electron microscopy (SEM) images were received with a JSM-6700 microscope operating at 10 kV.High resolution transmission electron microscopy (HRTEM) images were collected by using a JEOL JEM-2100 F microscope with an accelerating voltage of 200 kV.X-ray photoelectron spectroscopy (XPS) analysis was conducted on an Amicus Budget spectrometer with an Al K X-ray source, and all binding energies were corrected with surface adventitious carbon of 284.6 eV.UV-vis diffused reflectance spectroscopy (DRS) results were collected on a PerkinElmer Lambda 950 spectrophotometer in wavelength range of 300-800 nm.Photoluminescence (PL) spectra were measured on an Edinburgh LFS-920 spectrometer with excitation wavelength of 315 nm. The electrochemical impedance spectroscopy (EIS) measurements and Mott-Schottky plots were obtained on an electrochemical workstation (CHI660E) coupled with a 500 W xenon lamp with a 420 nm cut-off filter.A three-electrode test method was used with the black TiO 2 nanosheet array films as the working electrode, platinum strips as the counter electrode, and saturated calomel electrode (SCE) as the reference electrode in 0.5 M NaSO 4 solution. Photocatalytic CO 2 reduction test was conducted on a gas chromatograph (Agilent 8890 GC system) after the prepared sample, which was placed in a quartz glass reactor containing 80 mL of deionized water without any cocatalyst and sacrificial reagent, was illuminated by a 300 W xenon lamp with a 420 nm cut-off filter for 5 h.In detail, the prepared sample (8 mg) was placed in the center of the quartz glass reactor directly facing the light source, and 80 mL of water was added to the quartz glass reactor and sealed.Then 60 mL of CO 2 gas was injected into the water in the quartz glass reactor after nitrogen bubbling for 30 min throughout magnetic stirring.The mixed gas from the quartz glass reactor after photocatalytic reduction was sampled with a syringe, and then injected into the gas chromatograph.The test conditions were adjusted to FID mode.The 13 C isotope trace experiment and reduction of product were performed on an Agilent 5977B gas chromatograph and mass spectrometer. Density functional theory (DFT) was adopted to elucidate the change of Fermi energy level of crystal structure when oxygen vacancy is formed on TiO 2 001 and 101 facets.DFT calculations were performed by a planewave pseudo-potential method implemented in CASTEP code of Materials Studio.The Perdew-Burke-Ernzerh of the generalized gradient approximation of exchange-correlation function was depicted through a plane wave with a cut-off energy of 400 eV to ensure the precision of the calculations.Using 3 3 anatase 001 surface supercell and 3 1 anatase 101 surface supercell as slab model, and removing one oxygen atom at the position of bridging oxygen constructed the surface oxygen defect model.The Reflex software of Materials Studio (MS) was used to simulate the XRD pattern of anatase with oxygen defect.A 2 2 1 supercell of anatase (16 Ti atoms and 32 O atoms) with one oxygen atom removed was used as the model of TiO 2 with oxygen vacancy."
  },
  {
    "title": "Results_and_Discussion",
    "content": "SEM and TEM are used to analyze the surface morphology and microstructure of TiO 2 nanosheet array films obtained with different annealing time.TiO 2 nanosheets with the length of about 2 m and the thickness of about 300-400 nm are evenly distributed on FTO, as shown in Fig. 2a-d.The micromorphology of TiO 2 nanosheet arrays with high activity 001 facets shows basically no change after the aluminothermic reduction for 2, 4, and 6 h at 500 C.Meantime, it can also be observed that b-TiO 2 NS-4 has a sharp nanoplate with a rectangular outline in Fig. 2e.Fig. 2f shows the SAED mode of b-TiO 2 NS-4, which is attributed to 001 crystal axis diffraction, revealing that its bottom and top are highly active 001 planes 28.Fig. 2f proves a single crystal material, but a disordered layer on the surface is observed in Fig. 2g.The reason for the occurrence of the disordered layer is that the formation of oxygen vacancies leads to lattice distortion, which is consistent with the results of previous studies 20,23,24,29.A clear lattice fringe of 0.190 nm can be observed in Fig. 2h, consisting with (200) lattice plane of anatase TiO 2 , which indirectly proves that the highly active 001 facets have been prepared 30. X-ray diffraction (XRD) was used to analyze the crystal structure of the black TiO 2 prepared with different annealing time.As shown in Fig. 3a, the diffraction peak including (101), (004), ( 200), ( 221), (204), (220), and (215) are consistent with the standard anatase TiO 2 phase (JCPDS 21-1272).The (101) and (004) diffraction peaks are the main ones, which indicates that 101 and 001 constitute the main crystal facets 31.The crystal structure keeps unchanged at different annealing time.But, the loss of oxygen atoms in the crystal lattice of b-TiO 2 NS leads to lattice distortion, and a new weak diffraction peak appears at 32.5, as shown in Fig. 3b, which is consistent with simulation of the XRD patterns of TiO 2 with oxygen vacancy in Fig. 3c.Meantime, by scrutinizing (004) and (101) diffraction peak positions, it can be found that these two diffraction peaks of b-TiO 2 NS shift to large angle after annealing for different time.According to Bragg's law, the loss of oxygen atoms causes the decrease in crystal plane spacing, thereby shifting the corresponding diffraction angle to a larger degree 32.In particular, the (004) diffraction peak of b-TiO 2 NS shifts to large angle for 2 h annealing, while the (101) diffraction peak of b-TiO 2 NS shifts to large angle for 6 h annealing.This phenomenon indicates that oxygen vacancies are formed more easily on the 001 facets than on 101 facets.This is because that the surface energy of 001 facets is higher than that of 101 facets 33.Oxygen atom on 001 facets escapes from crystal lattice more easily than that on 101 facets.And thus, the oxygen vacancies are formed on 001 facets firstly.With prolonged annealing time, the oxygen vacancies are formed on 101 facets.From Fig. 3d, the (004) diffraction peaks shift to large angle for 2 h annealing, which indicates the formation of oxygen vacancies on 001 facets for b-TiO 2 -NS-2 and b-TiO 2 -NS-4.As the annealing time increases to 6 h, the (004) and (101) diffraction peaks shift to large angle, demonstrating the formation of oxygen vacancies on 001 and 101 facets for b-TiO 2 -NS-6.To further understand the formation of oxygen vacancies in the compositions phase, Raman spectra of the samples with different annealing time were recorded, as shown in Fig. 3e.Five distinct characteristic bands (3E g 2B 1 g A 1 g ) located at about 143, 197, 396, 512, and 639 cm -1 are obvious for anatase structure of TiO 2 34.Clearly, black TiO 2 samples prepared by aluminothermic reduction with different annealing time show different degrees of blue shift at 143 cm -1 , which occurs as the major characteristic band of anatase 35.The blue shift and widening of peak position are attributed to the oxygen vacancies formed in the lattice of b-TiO 2 36. X-ray photoelectron spectroscopy was used to reveal the element state and electronic environment changes of Ti 2p and O 1 s on the material surface of TiO 2 NS and b-TiO 2 NS-4.Fig. 4a shows that the binding energies of Ti 4 2p 1/2 and Ti 4 2p 3/2 peaks of TiO 2 NS are 463.9 and 458.3 eV, respectively.No other peaks appear, indicating that Ti 4 -O bonds are dominant in TiO 2 NS 37,38.Fig. 4b shows the Ti 2p state of b-TiO 2 NS-4.The two clear binding energy peaks located at 461.1 and 456.7 eV are ascribed to Ti 3 2p 1/2 and Ti 3 2p 3/2 , respectively.This is due to the formation of oxygen vacancies on the surface of b-TiO 2 NS-4, which increases the density of surrounding electron cloud and reduces the binding energy between the ions, thus causing the appearance of shoulder Ti 3 peaks in Ti 4 binding energy peaks 39.Fig. 4c andd show the high-resolution O1s spectra of TiO 2 NS and b-TiO 2 NS-4.The O1s peaks can be fitted by a combination of the two peaks at 529.4 and 530.8 eV, which are attributed to the lattice oxygen species of TiO 2 and the surface -OH induced by oxygen vacancies 40, respectively.Meanwhile, by scrutinizing Fig. 4c andd, it can be found that the intensity of the fitted peaks at 530.8 eV increases significantly with the appearance of Ti 3 species on the surface, which indicates that the formation of oxygen vacancies increases the adsorption of -OH groups on the surface. In order to study the light absorption of black TiO 2 nanosheet array films, UV-vis diffused reflectance spectroscopy measurements were conducted, as shown in 6a.The photocatalytic reduction products are mainly CO, with a small amount of CH 4 , and the photocatalytic performance of black TiO 2 with oxygen vacancy is significantly higher than that of TiO 2 NS.In addition, the cycle experiment of photocatalytic CO 2 reduction further proves that b-TiO 2 NS-4 has a durable photocatalytic performance.After 5 cycles of experiment, the catalyzed reduction rate of CO 2 to CO is hardly decreased (Fig. 6b).In Fig. 6c, the peak of m/z 29 in the mass spectra for 13 CO indicates that the C in the reduced product CO is derived from the C in CO 2 .With the increase of the time of aluminothermic reaction, the photocatalytic CO 2 reduction rate gradually increases, and b-TiO 2 NS-4 shows the best photocatalytic reduction performance with the highest CO generation rate of 128.5 molg -1 h -1 .Meanwhile, black TiO 2 also yields 8e products (CH 4 ) in photocatalytic reduction of CO 2 .The formation of oxygen vacancy on 001 facets promotes the separation of photogenerated electron-hole pairs to form an electron-rich state on 001 facets.The increased electron density of the surface due to oxygen vacancy drives CO 2 reduction to 2e products (CO), and further to 8e products (CH 4 ) 42,43.However, the electron accumulation on the surface of TiO 2 is insufficient to reduce most of the CO 2 into multi-electron CH 4 products, so the reduction products are mainly CO as 2e products 44,45.When the aluminothermic reduction time reaches 6 h, the obtained sample shows a decreased photocatalytic CO 2 reduction performance.PL test was used to further explain this phenomenon, as it can reveal the behavior of the photogenerated electron and hole in the sample.The results demonstrate that all samples have broad emission peak at about 465 nm at excitation wavelength of 315 nm, as shown in 6f.It strongly proves that TiO 2 is a representative n-type semiconductor with positive slopes and the type of semiconductor is not changed after aluminothermic reduction treatment.The slope value represents carrier density, and a smaller slope indicates a higher carrier density.The sample b-TiO 2 NS-4 has a minimum slope among these samples, which indicates a maximum carrier density, as can be calculated by the following formula where N d , , 0 , e 0 , and d(1/C 2 )/dV represent donor density, dielectric constant of TiO 2 (31 for anatase) 46, permittivity of vacuum, electron charge, and straight slope, respectively.The calculated carrier density of TiO 2 NS, b-TiO 2 NS-2, b-TiO 2 NS-4, and b-TiO 2 NS-6 is 2.816 10 17 , 9.739 10 17 , 1.178 10 18 and 1.072 10 18 , respectively.The higher carrier density is due to the fact that the oxygen vacancy in TiO 2 lattice promotes the separation of photogenerated electronhole.This would be beneficial to photocatalytic CO 2 reduction.Furthermore, the reason that b-TiO 2 NS-4 has better photocatalytic performance than b-TiO 2 NS-6 can be thoroughly explained by DFT calculation.First, the work function of perfect 001 and 101 facets and the 001 and 101 facets with oxygen vacancies was calculated.The model structure and calculation results are shown in Fig. 7a-h, and the green arrow indicates the position of simulated oxygen vacancy.The corresponding position of the Fermi level can be calculated by the following formula 47,48. where E F , E VAC and WF are Fermi level, vacuum level, and work function, respectively.The Fermi level of 001 facet is 0.66 eV higher than that of 101 facet when the facets are perfect, but 0.19 eV lower than that of 101 when oxygen vacancies form on facets.The transformation of Fermi level has important influence on the formation of different types of homojunction 49.In b-TiO 2 NS-4 sample, the oxygen vacancies form only on 001 facets, not on 101 facets.The energy band structure and Fermi level position are shown in Fig. 7i.The Fermi level of 001 facet is 2.3 eV higher than that of 101 facet.The homojunction formed between 001 and 101 From the above comprehensive analysis, a plausible photocatalytic CO 2 reduction mechanism is proposed in Fig. 8.The photogenerated electrons jump from the valence band to the impurity level and conduction band when the energy of incident light is greater than the band gap.Then, photogenerated electrons migrate to the surface oxygen vacancies, which suppresses the recombination of photoelectron-hole pairs.First, CO 2 molecules are adsorbed on the 001 facets, where the oxygen atoms of CO 2 molecules combine with the unsaturated coordination Ti 5c on 001 facets to increase the adsorption capacity of CO 2 molecules.The unsaturated coordination Ti 5c atoms exposed on the 001 facets have higher Lewis basicity, which is conducive to the adsorption of acidic molecules CO 2 .The adsorption of CO 2 molecules on the surface is a prerequisite for the reduction reaction.The adsorbed CO 2 on the surface redistributes the electron cloud under the influence of the electrons in the oxygen vacancy, which bends the C-O bond of CO 2 in the original linear molecule to form activated CO 2 -species (Eq.3). The activated CO 2 -species react with the proton in water to form CO (Eq.4).Most of the CO dissociates from the surface and enters the gas phase.Only a small amount of CO forms CH 4 under the action of electrons and hydroxyl radicals (Eq.5).Since the reduction of CH 4 requires more electrons to participate in the reaction, and the electron density on the surface is not high enough to accumulate the electrons needed for the reduction of CH 4 , CO 2 is mainly reduced to CO 51,52.Ti 3 atoms donate electrons to CO 2 to form Ti 4 (Eq.6), and then the electrons in the oxygen vacancy transfer Ti 4 to Ti 3 .Iteratively, CO 2 is continuously reduced to CO.The holes that migrate to the surface are consumed by the hydroxy radical to form O 2 (Eq.7)."
  },
  {
    "title": "Conclusions",
    "content": "In summary, black single crystal TiO 2 nanosheet array films with oxygen vacancy on 001 facets were prepared by a mild aluminothermic reduction method.Oxygen vacancies tend to form on 001 facets owing to their higher surface energy than that of 101 facets.The absorption wavelength extends to the visible wavelength range owing to the defect energy level generated by the formation of oxygen vacancies in black TiO 2 nanosheet array films.The samples with oxygen vacancies on 001 facets have higher photogenerated carrier concentration and higher electron-hole separation efficiency.b-TiO 2 NS-4 shows the best photocatalytic ability towards CO 2 reduction to CO with a rate of 128.5 molg -1 h -1 because the optimized charge space region increases the separation and transportation of photo-induced carriers.Therefore, the defect engineering for oxygen vacancy on 001 facets of TiO 2 provides a novel strategy for the conversion of CO 2 in atmosphere into fuels. Fig. 1.Schematic diagram of synthesis of black TiO 2 nanosheet array films. Fig. 5a.Compared with TiO 2 NS, which only shows intense absorption in ultraviolet region, b-TiO 2 NS samples show significant absorption in visible light.Meanwhile, the absorption of visible light increases with the extension of aluminothermic reduction time.The possible reason is that oxygen vacancies induce additional electron level just below the conduction band, which broadens the range of light absorption to visible light 41.Fig. 5b is a series of band gap energy spectra of TiO 2 with different aluminothermic reduction time.The band gaps of b-TiO 2 NS-2, b-TiO 2 NS-4, and b-TiO 2 NS-6 are narrowed from 3.18 for TiO 2 NS to 3.01, 2.83, and 2.92 eV, respectively.Therefore, the formation of oxygen vacancies on 001 and 101 facets can significantly narrow the band gap and increase the utilization of visible light.Photocatalytic CO 2 reduction tests under visible light illumination were conducted to evaluate the photocatalytic properties of TiO 2 with aluminothermic reduction time.The test results are shown in Fig. Fig. 2. SEM of TiO 2 NS (a) and b-TiO 2 NS annealed with different time (b, c, d), TEM (e) images of b-TiO 2 NS-4, corresponding SAED pattern (f), and HRTEM images (g, h). Fig. 6d.TiO 2 NS has the highest fluorescence intensity, indicating strong photoelectron-hole recombination.Meanwhile, b-TiO 2 NS-4 exhibits the smallest fluorescence intensity, suggesting that the sample has the highest photogenerated electrons and holes separation efficiency, perfectly consistent with the results above.In order to investigate the separation efficiency of photogenerated electrons and holes, the electrochemical impedance spectra under visible light illumination were collected, as shown in Fig. 6e.Compared with TiO 2 NS, b-TiO 2 NS samples show a smaller impedance arc radius in the Nyquist plot, which indicates that b-TiO 2 NS samples have a smaller interfacial resistance.Particularly, b-TiO 2 NS-4 sample shows a minimum impedance radius, indicating that the formation of oxygen vacancies on 001 facets is conducive to the separation of photogenerated electron-hole pairs.The carrier density of black TiO 2 nanosheet array films is revealed by Mott--Schottky (M-S) plots, as shown in Fig. Fig. 3. XRD patterns of TiO 2 NS and b-TiO 2 NS annealed with different time (a, b, d), XRD simulation peak and structural model of TiO 2 supercell with oxygen vacancy (c) and Raman spectra of TiO 2 NS and b-TiO 2 NS annealed with different time (e). Fig. 4. Ti 2p XPS spectra of (a) TiO 2 NS and (b) b-TiO 2 NS-4; O 1s XPS spectra of (c) TiO 2 NS and (d) b-TiO 2 NS-4. Fig. 5. UV-vis diffuse reflectance absorption spectra (a) and corresponding optical bandgaps (b) of TiO 2 NS and b-TiO 2 NS annealed with different time. Fig. 6.(a) Photocatalytic CO 2 reduction performance test of TiO 2 NS and b-TiO 2 NS annealed with different time under visible light illumination; (b) Recyclability of b-TiO 2 NS-4 for photocatalytic CO 2 reduction; (c) Isotope labeled mass spectrometry of b-TiO 2 NS-4; (d) PL spectra; (e) EIS plots; and (f) Mott-Schottky plots for TiO 2 NS and b-TiO 2 NS with different annealing time. Fig. 7. Atom models for perfect 001 and 101 facets (a, b); atom models for 001 and 101 facets with oxygen vacancies (c, d); average potential profile along c axis of perfect 001 and 101 facets (e, f) and 001 and 101 facets, with oxygen vacancies (g, h); and the charge separation and transfer process in b-TiO 2 NS-4 (i, j) and b-TiO 2 NS-6 (k, m) under visible light illumination. This study was funded by the National Natural Science Foundation of China (62004137, 21878257, 21978196), Natural Science Foundation of Shanxi Province (201701D221083), Shanxi Provincial Key Research and Development Project (201803D421079, 201803D31042), Scientific and Technological Innovation Programs of Higher Education Institutions in Shanxi (2019L0156), Shanxi Provincial Key Innovative Research Team in Science and Technology (201605D131045-10), and Research Project Supported by Shanxi Scholarship Council of China (2020-050). The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper."
  }
]