[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2018.01.005"
  },
  {
    "title": "Article_Title",
    "content": "Selective photocatalytic CO2 reduction to CH4 over Pt/In2O3: Significant role of hydrogen adatom"
  },
  {
    "title": "Abstract",
    "content": "H adatoms derived from H2 or H2O dissociation on Pt play a key role for the formation of CH4.Weak H-Pt bond facilitate the bonding of C in CO2 with H, thus restraining CO production. Highlights Highly-dispersed-Pt decorated In2O3 nanorods were prepared for photocatalytic CO2 reduction. The metallic Pt acts as atomic hydrogen reservoir that supplies sufficient and readily available protons for CH4 production. The present work deepens the understanding of mechanism for the Pt-promoted CH4 formation over Pt-semiconductor photocatalysts."
  },
  {
    "title": "Experimental",
    "content": "In(OH)3 nanorods were prepared by following a previously reported protocol. 7,25ecifically, 50 g of urea and 6 g of InCl3 were dissolved in 200 mL of deionized water.The aqueous solution was then heated at 80 C in a water bath under magnetic stirring for 4 h. After being cooled to room temperature, the white product was collected though centrifugation and washed with water to remove unreacted residues.The sample was dried at 80 C for 4 h to obtain In(OH)3 powder.Following that, 0.5 g of In(OH)3 powders were dispersed into 200 mL of distilled water containing a desired amount of H2PtCl6 and 5 mL of methanol.The mixtures were irradiated under UV-light with the wavelength ranging from 200 to 400 nm (a light intensity of 0.120 W cm -2 ) for 5 h, and the obtained products were collected through centrifugation and washed with water.Finally, the sample materials were annealed at 250 0 C for 2 h.As-prepared photocatalysts with Pt loadings 0, 0.5, 1.3 and 2.3 wt were denoted as In2O3, 0.5Pt/In2O3, 1.0Pt/In2O3 and 2.0Pt/In2O3, respectively.For comparison, a 1.0Pt/In2O3-W was prepared using the method of the photodeposition of H2PtCl6 on In2O3 derived form the calcination of In(OH)3 nanorods at 250 C, and a 1.0Ag/In2O3 with Ag loading of 1.2 wt was prepared by using the reduction of AgNO3 with NaBH4 onto In2O3. The chemical compositions of the prepared photocatalysts were analyzed by an ARL-9800 X-ray fluorescence spectrometer (XRF).The surface area and pore size were determined using an Autosorb-IQ-MP autosorption analyzer (Quantachrome), carried out at 77.3 K using N2 as an adsorbate.The samples were degassed at 473 K for 2 h before measurements.Pore size distribution curves were derived from the branch of adsorption isotherms.X-ray diffraction (XRD) patterns of the samples were collected under ambient atmosphere by a Bruker D8 powder diffractometer with Cu K radiation ( 1.5408 A) generated at 40 kV and 30 mA.Transmission electron microscopy (TEM) characterization was performed on a JEOL-JEM 2100 electron microscope. UV-vis diffuse reflectance spectra (DRS) over a range of 200-800 nm were recorded on a UV-vis spectrophotometer (ShimadzuSolidSpec-3700DUV) with an integration sphere diffuse reflectance attachment.The energy band gaps of the as-prepared samples were calculated using (h) n (h-Eg), where is the absorption coefficient, is the parameter related to the effective masses associated with the valence and conduction bands, n is 1/2 for the indirect transition, h is the absorption energy, and Eg is the band gap energy.Plotting (h) 1/2 versus h based on the spectral response gives the extrapolated intercept corresponding to the Eg value.X-ray photoelectron spectroscopy (XPS) study was performed using a VG Microtech MT500 with an Mg-KX-ray source.All binding energies were referenced to carbon (1s) at 285.6 eV.Time resolved luminescence intensity decays at 395 nm were recorded on a HORIBA Fluorolog-3 molecule fluorometer (France).Those samples were excited by a 300 nm laser light. IR spectra for the coadsorption of CO2 and H2O were recorded with a Nicolet (IS50) spectrophotometer (MCT detector) in the range 4000-1000 cm -1 with a resolution of 4 cm -1 . The self-supporting wafers (15-20 mg) were annealed in an IR cell at 473 K in Ar for 2 h Adsorptions of H2 were carried out in a home-made volumetric adsorption system at room temperature.The catalysts were evacuated at 473 K for 2 h before the measurements. After cooling the catalysts to room temperature, doses of H2 were admitted sequentially and the coverage of H2 was measured until the equilibrium pressure reached at about 14 kPa.The uptake of H2 for the saturation coverage on a photo-catalyst surface was determined by extrapolating the coverage of isotherm to P(H2) 0. Photocatalytic reductions were carried out in a reactor system connected to a vacuum pump, and a 500 W Hg lamp was used as the light source with a light intensity of 0.120 W cm -2 .For each test, 20 mg of a sample catalyst powder was evenly deposited on a circular quartz plate with a diameter of 50 cm and then placed inside the photo-reactor perpendicular to the light beam.10 mL of gaseous-or 10 L of liquid-reactant was injected into the vacuum reactor system, and the photocatalytic activities were determined at 298 K for 6 h in each run. The reaction products were monitored at a 60 min interval by an online gas chromatograph (Agilent Technology 7890A GC) equipped with a thermal conductivity detector (TCD) for product analysis of O2, CO and CH4 and flame ionization detector (FID) for analyzing products of methanol, formaldehyde, C2-C5 hydrocarbons, and so on."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Fig. 1A shows N2 adsorption-desorption isotherms of the In2O3, 0.5Pt/In2O3, 1.0Pt/In2O3, and 2.0Pt/In2O3 photocatalysts.All of the photocatalysts exhibit type-IV adsorption with a hysteresis loop of type H1, indicating the existence of mesopore structures. 26The isotherms obviously rise up at a relatively high pressure range of 0.96-1, implying some macropores exist in the photocatalysts. 27Table 1 summaries BET surface area, pore volume and pore size of the photocatalysts.The surface area irregularly changes as Pt loadings increase, which was measured to be 153.8,162.1, 153.5 and 143.0 m 2 g -1 for In2O3, 0.5Pt/In2O3, 1.0Pt/In2O3 and 2.0Pt/In2O3, respectively.Unlike the surface area, the average pore size is slightly increased as the Pt loadings increase, and corresponding pore size distribution curves shift to the large pore size side (Fig. 1B).Powder X-ray diffraction (PXRD) patterns for the photocatalysts indicate a single crystalline phase (Fig. 1C), assigned to the face-centered cubic In2O3 (space group 167, Ia-3). 25Their intensities are not influenced by the addition of Pt.Scherrer analysis of peak broadening shows crystallite sizes of 89 nm for In2O3 in the photocatalysts.The characteristic peaks of crystalline Pt were not observed for the 0.5Pt/In2O3, 1.0Pt/In2O3 and 2.0Pt/In2O3 photocatalysts, implying Pt particles might be highly dispersed onto In2O3.Fig. 2A andB show scanning electron microscopy (SEM) images of the representative photocatalysts In2O3 and 1.0Pt/In2O3.A nanorod morphology was observed with lengths ranging from a few hundred nanometers to greater than 1 m (Fig. 2A).The addition of Pt does not change the morphology of In2O3 (Fig. 2B).Transmission electron microscopy (TEM) image of the 1.0Pt/In2O3 shows that the nanorods are assembled by small nanoparticles rather than a single crystal (Fig. 2C), which is in line with the character of the larger specific surface area.The crystalline fringes with an interplanar spacing of 0. To illustrate the surface nature of metallic Pt, CO was used as a probe molecule for IR spectroscopy.As shown in Fig. 1D, a CO adsorption band at 2060 cm -1 was observed, which can be assigned to CO adsorption in linear configuration. 28The frequency of the linearly bonded CO is lower than those observed for CO adsorbed over on-top sites of metallic Pt single-crystal surface or metallic Pt nanoparticles supported on some conventional oxide carriers, 29,30 indicating a stronger electron donor capacity of metallic Pt in the 28,313233 It is suggested that metallic Pt atoms bear high electron density because of support acting as an electron donor or high unsaturated degree of Pt particles.In addition, the peaks at 2190 and 2121 cm -1 correspond to the stretching vibration of gaseous CO molecules.No clear evidence shows the existence of bridged/threefold bonded CO whose bands locate at the frequency region of 1800-2000 cm -1 . 31ffuse reflectance spectroscopy measurements show that the In2O3 absorbs light with wavelength below 450 nm (Fig. 3A).The optical bandgap energy of In2O3 was estimated to be 3.4 eV (Fig. S1 in supporting information). 7,34The visible-light absorption of the Pt/In2O3 samples was slightly improved (the inset of Fig. 3A), which is ascribed to the presence of Pt 2 species that will be indicated by the following XPS analysis.Static-state fluorescence (PL) spectroscopic measurements show a peak centered at 395 nm with a marked shoulder around 410 nm for the In2O3 and Pt/In2O3 photocatalysts (Fig. 3B).The peak and its shoulder can be assigned to the near-band-edge emission and shallow-defect-level emission of In2O3, respectively. 35The static-state PL intensity of In2O3 declines with increasing Pt loadings. This was attributed to an increase in recombination centers, which was reported to be detrimental for light emission. 36The PL decay kinetics for the samples at 395 nm after 300 nm excitation were used to examine the recombination rate of the photoinduced electron and hole in photocatalysts.As shown in Fig. 3C, PL decay rate is accelerated with the presence of Pt.In general, the metallic Pt defers the recombination of the photoinduced charge carriers because of the presence of Schottky barriers at Pt-semiconductor interfaces, 37 while Pt 2 is known as a recombination center of charge carriers. 23Therefore, the accelerated recombination of photoinduced electron and hole in the Pt/In2O3 photocatalysts can be also ascribed to the presence of Pt 2 .Note that the lifetime of charge carriers at In2O3-metallic Pt interface should be extended. The performances of photocatalysts were evaluated for CO2 reduction with H2O vapor under simulated sunlight irradiation.Besides oxygen, CO and CH4 were found to be the main products for CO2 photoreduction, which is in agreement with previous reports. 5,7,38,39Some possible intermediate products such as HCOOH, CH2O, and CH3O were not detected in gas phase, likely due to low abundance of these products, with concentrations below the detection limit of GC instrumentation.As shown in Fig. 4, the yields of CO and CH4 increase with irradiation time.At 6 h, the CO yield was measured to be about 39.6, 11.5, 8.6 and 15.6 mol g -1 , and the yield of CH4 was 2.1, 5.6, 21.0 and 18.5 mol g -1 for In2O3, 0.5Pt/In2O3, 1.0Pt/In2O3 and 2.0Pt/In2O3, respectively.For comparison, the activities of a commercial TiO2 and the Pt-decorated TiO2 with Pt loading of 1 (1.0Pt/TiO2) were explored and the results are shown in Fig. 4S of the supporting information.At 6 h, the CO yield was monitored to be 24.2 and 20.6 mol g -1 and the CH4 yield was 2.7 and 48.8 mol g -1 for TiO2 and 1.0Pt/TiO2, respectively.It is evident that CO yield decreases while CH4 increases after the addition of Pt to either In2O3 or TiO2.At the same time, according to the amount of CO and CH4, it can be estimated that CO2 conversion is decreased for 1.0Pt/In2O3 and is increased for 1.0Pt/TiO2.The latter case is in agreement with previous reports. 21,23ditionally, two control experiments were performed: (1) simulated sunlight irradiation in the absence of catalyst, and (2) irradiation of catalyst and H2O vapor with simulated sunlight in the absence of CO2.CO and CH4 products were not monitored by gas phase analysis in the two experiments, showing the photocatalytic conversion of CO2. The enhanced CH4 yield are commonly attributed to the enhanced photoinduced electron lifetime, due to a Schottky junction formed at the Pt-semiconductor interface. 40412 Nevertheless, it is difficult to explain the decrease of CO yield only in terms of the prolonged photoinduced-electron lifetime.In dynamics, the reduction of CO2 to CO requires two electrons, while eight electrons are needed for CH4 production.As such, the amount of CO should also be increased with the photoinduced electrons lifetime.Moreover, there is no evidence indicating that the decreased CO yield is attributed to the fast conversion of producing CO to CH4 under light irradiation.Fig. 5S shows the results of photocatalytic reductions of CO2, and CO with H2 over the 1.0Pt/In2O3, where H2 instead of H2O was used as reductant, aiming to suppress the possible oxidation of CO by H2O-derived oxygen.The CH4 yield derived from the CO conversion is only 16.4 mol g -1 at 6 h of simulated sunlight irradiation, lower than that of 35.6 mol g -1 for CO2 photoreduction.Based on the carbon balance, the practical CO yield was estimated to be about 47.7 mol g -1 (16.4 plus 31.3 mol ) at 6 h over the 1.0Pt/In2O3, which is still lower than that of 58.4 mol g -1 over the In2O3. On the other hand, In2O3 is an n-type semiconductor with the conduction band minimum level of -0.62 V versus NHE. 43,44After being decorated with metallic Pt, an upward band bending would occur at the Pt-In2O3 interface due to an apparently higher Fermi level of In2O3 than that of Pt. 43,45 Thus, the reduction of CO2 to CO over Pt/In2O3, requiring the reduction potential of -0.48 V vs. NHE, 46,47 is thermodynamically feasible.At the same time, it is found that low CO yields can be obtained over Pt-decorated semiconductors with different conduction band potentials such as Zn2GeO4, CeO2, LaPO4, C3N4, and so on, 3,12,48,49 which also implies that the decreased CO yield cannot be ascribed to thermodynamic factor.Therefore, we speculated that there is another reason that jointly support the high selectivity to CH4 production and low CO yield over Pt-semiconductor catalysts. Fig. 5 shows XPS spectra of the In2O3 and 1.0Pt/In2O3 photocatalysts.No impurities other than a very limited amount of contaminants carbon and chlorine were detected (Fig. 5A).The chlorine comes from the raw materials (InCl3 and H2PtCl6) in the photocatalyst preparation.Two peaks centered at 444.2 and 451.8 eV can be assigned to the spin-orbit coupling of In 3d5/2 and 3d3/2 for In2O3. 50Corresponding peaks for 1.0Pt/In2O3 shift to the high binding energy side by 0.2 eV (Fig. 5B).For O 1s core level XPS, the peak assigned to lattice oxygen of cubic In2O3 was observed with a shoulder, shifting from a binding energy of 529.6 for the In2O3 to 529.9 eV for the1.0Pt/In2O3photocatalyst.The shoulder at about 532.4 eV is due to the surface hydroxyl.Pt 4f core level XPS measurement indicates that Pt 2 and Pt 0 are present with Pt 0 atomic ratio of 29 relative to total Pt on the surface of 1.0Pt/In2O3 (Fig. 5D). 51Pt 2 comes from the partial reduction product (PtCl2) of H2PtCl6. These results indicate that the electron densities of In and O on the surface of 1.0Pt/In2O3 is slightly decreased relative to those on In2O3, leading to the higher binding energies, which can be explained in terms of a higher electronegativity of Pt (2.28) than that of In (1.78). When Pt species contacts with the surface of In2O3, the valance electrons of O are attracted by Pt species.Meanwhile, the bonding electrons in In-O will further depart from In atoms via inductive effect. To illustrate the effect of Pt species on the co-adsorption of CO2 with H2O, the FTIR measurements were carried out.As shown in Fig. 6A, the peaks at 1645, 1549, 1510, 1429, 1394, 1338 and 1219 cm -1 are observed for In2O3, which can be assigned to bicarbonates (HCO3 -), bidentated carbonate (b-CO3 2-) and monodentated carbonate (m-CO3 2-) species. 52- 55 owever, these peaks are not observed for the 1.0 Pt/In2O3, and 2.0 Pt/In2O3 (Fig. S3). When the Pt loadings is decreased to 0.5, these peaks with weak intensity reappear (Fig. 6S).Because bicarbonate-and carbonate-like species are active under light irradiation, 26 a loss of them might cause a decrease in CO2 conversion, which explains the aforementioned observation about CO2 reduction with H2O over the Pt/In2O3 photocatalysts.On the other hand, the molecularly adsorbed CO2 were all observed on the In2O3 and 1.0 Pt/In2O3.It is well known that when CO2 molecule is bonded to the surface oxygen atom of In2O3 through its carbon atom, surface m-CO3 2-species is formed (Fig. 6B).If CO2 is simultaneously bonded to the oxygen and In sites of In2O3 through its carbon and oxygen, surface b-CO3 2- species will be formed, and the surface HCO3 -species is derived from a reaction of CO2 with surface hydroxyl.CO2 molecule is bound with In atom of In2O3 through its oxygen atom, yielding molecularly adsorbed CO2 (Fig. 6B).As such, a loss of HCO3 -, b-CO3 2-and m-CO3 2- on the Pt/In2O3 photocatalysts indicates that the oxygen atoms on the surface of In2O3 might be covered by Pt species, which is also implied by the XPS analysis.It should be noted that the HCO3 -, b-CO3 2-and m-CO3 2-species weren't suppressed for the adsorption of CO2 on Pt-decorated TiO2. 21,56,57For example, Xiong et al. and Mao et al. reported that the effect of Pt on the CO2 chemisorption was not obvious over TiO2. 21,56Also, Long et al reported that CuPd alloy similar to Pt did not prevent the formation of HCO3 -and carbonate-like species on TiO2. 57More importantly, the high CH4 production selectivity and low CO yield were also obtained over these reported photocatalysts.Therefore, the lack of HCO3 -, b-CO3 2-and m-CO3 2-species over Pt decorated In2O3 should not be directly related with the high CH4 selectivity and low CO yield in the work. To probe whether some intermediate products of CO2 reduction are influenced by Pt species in photocatalytic CO2 reduction, leading to the higher CH4 production selectivity, we evaluated the photocatalytic reduction of intermediate products to CH4 such as CO, HCOOH, CH2O, and CH3O over the In2O3 and 1.0Pt/In2O3 under simulated sunlight irradiation.In this study, H2 instead of H2O was used as reductant, aiming to block the oxidation of these intermediate products by H2O-derived oxygen.As can be seen from Fig. 7, more CH4 was produced for photocatalytic CO2 reduction with H2 than with H2O over In2O3 and 1.0Pt/In2O3.CH4 was also produced in the reduction of CO, HCOOH, CH2O, and CH3O over 1.0Pt/In2O3, and its yield was measured to be about 16.4, 7.6, 16.7 and 6.7 mol g -1 under simulatedsunlight irradiation of 6 h, respectively.Unexpectedly, the CH4 yields derived from intermediate products reduction are obviously lower that of 35.6 mol g -1 for CO2 reduction, although the reduction of intermediate products requires less photoinduced electrons relative to CO2 reduction.So far, two pathways for photocatalytic CO2 reduction were proposed according to whether the hydrogenation or the deoxygenation process is faster. 1,47,58In the fast-hydrogenation pathway, CO2 is reduced along the path CO2HCOOHCH2OCH3OHCH4; while in the fast-deoxygenation pathway, it follows the path CO2COCCH2CH3CH4. 59 Some intermediates in both pathways have been detected. 1,58For example, carbon radicals signals were detected by ESR spectroscopy. 1Recent theoretical calculation by Ji et al. shows that photocatalytic CO2 reduction follows both the fast-hydrogenation and fast deoxygenation pathways. 59mbining theoretical calculation with the results obtained in the present work, it is plausible that photocatalytic CO2 reduction indeed proceeds via multiple pathways.In contrast, the reduction of intermediate products might only follow a specific pathway.As a result, more active species for CH4 formation were produced in CO2 reduction, leading to the higher CH4 production yield.On the other hand, the CH4 yield over the 1.0Pt/In2O3 is obviously higher than that over the In2O3, regardless of which intermediate product is served as oxidant, implying that the factor of enhancing the CH4 selectivity might relate with the reductant (H2 or H2O).Theoretical calculations indicate that H2 and H2O can be dissociatively adsorbed on Pt and In2O3. 54,60616263 For H2O molecule, H adatom and surface hydroxyl are formed on Pt, and H2O-derived H and OH are bound to O and In on the surface of In2O3, thus forming two hydroxyls.For H2, homolytic dissociation produces two hydroxyls on In2O3, 54,59,6364 and heterolytic dissociation results in H-In and O-H species on the surface of In2O3.Homolytic dissociation is highly energetically favorable.Moreover, the adsorption energies for H2 and H2O is higher on In2O3 than on Pt, owing to a higher bonding energy of O-H bond than that of Pt-H bond. 54,65As such, it can be speculated that the transfer of H in Pt-H to CO2 will overcome a less barrier than that in O-H bond.Therefore, it is suggested that H adatoms play a key role in enhancing CH4 selectivity over Pt-decorated semiconductors. To further evidence the significant role of H adatoms to CH4 selectivity, we evaluated the performance of a set of photocatalysts with different H2 uptakes for CO2 reduction to CH4.Fig. 8A shows coverage vs. pressure of H2 on the In2O3, 1.0Pt/In2O3, 1.0Pt/In2O3-W and 1.0Ag/In2O3 photocatalysts.The ratio of metallic Pt relative to total Pt in the 1.0Pt/In2O3-W is about 35, as indicated by XPS results (Fig. 7S).The uptakes of H2 increase with pressure on photocatalysts.The saturation coverage of H2, obtained by extrapolating the coverage of isotherm to P(H2)0, is 2.7, 34.2, 46.1 and 12.6 mol/g for In2O3, 1.0Pt/In2O3, 1.0Pt/In2O3-W and 1.0Ag/In2O3, respectively.Obviously, the H2 uptake for In2O3 is the least. The addition of Pt and Ag promotes the adsorption of H2.Among the three hybrid photocatalysts, the 1.0Pt/In2O3-W shows the highest H2 uptake.These results indicate that the H2 dissociative barrier on Pt (or Ag) is significantly lower than that on In2O3, which is further evidenced by the following experimental results for the reduction of the In2O3 and 1.0 Pt/In2O3 photocatalysts (Fig. 8B).The 1.0Pt/In2O3 was fully reduced to metallic In in H2 at 723 K for 2 h.However, the In2O3 was not reduced to form In under the same condition.Only a change occurs in color from light gray to dark gray, which is ascribed to In2O3 surface reduction.It is well known that H2 molecule was firstly dissociated to form H atoms before redox reactions.Thus, metallic Pt promoted the dissociation of H2 molecule to more active H atoms. Fig. 8C andD shows the yields of CO and CH4 and the selectivity to CH4 over the photocatalysts for the reduction of CO2 with H2.The mean CO yield was measured to be about 58.3, 31.3,2.7 and 27.4 mol/g, the mean CH4 yield was 4.7, 33.6, 51.0 and 12.5 mol/g for In2O3, 1.0Pt/In2O3, 1.0Pt/In2O3-W and 1.0Ag/In2O3, respectively.According to the amount of CO and CH4, the conversion of CO2 was calculated to be about 63.0, 64.9, 53.7 and 39.9 mol/g for In2O3, 1.0Pt/In2O3, 1.0Pt/In2O3-W and 1.0Ag/In2O3, respectively. Clearly, the presence of Pt (or Ag) does not promote the conversion of CO2, only changing the product selectivity.The selectivity to CH4 was calculated to be 7.4, 51.9, 93.3 and 31.3 for In2O3, 1.0Pt/In2O3, 1.0Pt/In2O3-W and 1.0Ag/In2O3, respectively (Fig. 8D).This is positively correlated to the H2 uptakes by the photocatalysts.Besides, Ag and Pt has a common property of strong dissociation ability to H2, and high CH4 selectivities were simultaneously achieved over Ag-and Pt-decorated In2O3.The result also indicates the key role of H adatoms in CH4 formation.It should be noted that the particle size of metallic Pt is another key factor to the selectivity of CO2 reduction.Wang and coworkers have investigated the correlation between the Pt particle size and the selectivity of CO2 reduction over TiO2 single crystals.It was found that high CO2 photoreduction efficiency with selective formation of methane was achieved when the Pt particle size is 0.52 nm, and the optimal size was found to be around 1 nm.Pt particles on this nanoscale have a suitable Fermi level due to quantum effect, thereby effectively promoting the photoinduced electron transfer. 24cording to the TEM images shown in Fig 2S, the sizes of Pt particles of the 1.0Pt/In2O3 and 1.0Pt/In2O3-W samples were estimated to be 35 nm, and there is no observable difference in the Pt particle size between 1.0Pt/In2O3 and 1.0Pt/In2O3-W (Figs.S2 andS3.). Note that on the nanoscale of 35 nm quantum effect is not so obvious.Therefore, possible effect of the size of Pt particles on the selectivity to CH4 was not be considered in the work. The bonding of CO2 with H can be seen as thermal chemical process following the photo-activation of CO2.As such, the selectivity to CH4 should be influenced by H2 partial pressure.Therefore, the CH4 selectivity in different partial pressure ratios of CO2 to H2 was evaluated over the 1.0Pt/In2O3 sample.As shown in Fig 8, the CH4 selectivity decreases with decreasing H2 partial pressures, further confirming the critical role of H supply in CH4 formation.In photocatalytic CO2 reduction, H2 molecule is oxidated to produce two protons being bound to coordinatively unsaturated oxygens on the surface of In2O3.When the protons transfer to the O in CO2, CO and H2O will be formed, which is so-called deoxygenation process; If the protons transfer to C in CO2, the probability of CH4 formation will be obviously increased, as indicated in Scheme 1.To produce CH4, the C in CO2 needs to fight for the protons with the oxygen on the surface of In2O3.Notably, the C of CO2 is at a disadvantage, owing to its electronegativity lower than that of oxygen.However, the presence of metallic Pt cocatalyst will change the unfavorable case.H2 is first dissociated to form Pt-H bonds on Pt surface.As such, it becomes easy to the capture of protons by the C in CO2 from Pt-H species, since the electronegativity of C (2.55) is higher than that of Pt.In dynamics, the sufficient and fast proton supply is a prerequisites for CH4 production, since the formation of CH4 from CO2 requires eight protons and multiple steps. 66The metallic Pt can supply a plenty of H adatoms, and the H adatoms on metallic Pt can be more quickly bound with CO2 than that on In2O3, owing to a relatively weaker bonding of Pt-H.Therefore, the metallic Pt acts as atomic hydrogen reservoir that supplies sufficient and readily available protons for CH4 production. In addition, although the CO2 conversion is not increased over Pt-decorated In2O3 photocatalysts in the work, the number of the photoinduced electrons involved in the reduction is actually increased because the number of required electrons for CH4 production is three times more than that for CO.Thus, the extended lifetime of photoinduced electrons is still an indispensable factor for the enhanced selectivity to CH4 production, which has been verified in previous studies. 21,24"
  },
  {
    "title": "Conclusions",
    "content": "In summary, highly-dispersed-Pt decorated In2O3 nanorods (Pt/In2O3) were prepared using a precipitation method in conjunction with photodeposition, where acidic H2PtCl6 and basic In(OH)3 were selected as precursors for enhancing Pt dispersion.The presence of Pt does not change the intrinsic structure of In2O3, but modulates the surface property of In2O3 due to electronic and steric effect, which results in a loss of HCO3 -, b-CO3 2-and m-CO3 with H, thus restraining CO production.Combining with previous reports, 24 it can be electrons and eight protons, involving multiple reaction steps with reduction level of -0.24 and evacuated at the same temperature for 1 h.After the IR cell was cooled, CO2 and H2O vapor were introduced into the cell. 29 nm can been observed, corresponding to the (222) plane of cubic In2O3 crystal, and a Pt particle with a size of about 4 nm is observed in Fig. 2D.As shown Figure 2S (B), Pt particles are well dispersed on In2O3, probably due to the synthetic method for Pt/In2O3, where H2PtCl6 and In(OH)3 were used as precursors and two hydroxyls on the surface of In(OH)3 would bind a H2PtCl6 through a neutralization reaction.Overall, the intrinsic structure of In2O3 is barely affected by the addition of Pt. photocatalysts, offering a new window to explore non-noble metals or their alloys with stability in air and high dissociation ability to H2O or H2 as a replacement of Pt for CO2 photoreduction to CH4. Figure 2. (A, B) SEM images of the In2O3 and 1.0Pt/In2O3 photocatalysts, respectively.(C) TEM and (D) HRTEM images of the 1.0Pt/In2O3. Figure 3. (A) UV-vis absorption spectra of the In2O3, 0.5Pt/In2O3, 1.0Pt/In2O3 and 2.0Pt/In2O3 photocatalysts.(B) Static-state fluorescence spectra of the photocatalysts.(C) The PL decay kinetics for the samples at 395 nm after 300 nm excitation. Figure 4. Yields of CO (A) and CH4 (B) products for CO2 photoreduction with H2O (g) as a function of irradiation time over the In2O3, 0.5Pt/In2O3, 1.0Pt/ In2O3 and 2.0Pt/In2O3 photocatalysts under simulated light irradiation. Figure 5. (A) Survey, (B) In 3d, (C) O 1s, and (D) Pt 4f core level XPS spectra of the 1.0Pt/In2O3 and In2O3 photocatalysts. Figure 6.(A) The FTIR spectra for the coadsorption of CO2 and H2O (g) on the 1.0Pt/In2O3 and In2O3 photocatalysts.(B) Schematic surface species for the coadsorption of CO2 and H2O (g) on the photocatalysts. Figure 7. CH4 yields for the C1 molecules photoreduction over 1.0Pt/In2O3 and In2O3 photocatalysts at 6 h of simulated light irradiation. Figure 8. (A) Coverage vs. pressure of H2 on the In2O3, 1.0Pt/In2O3, 1.0Pt/In2O3-W and 1.0Ag/In2O3.(B) The photograph of the In2O3 and 1.0Pt/In2O3 photocatalysts before and after reduction in H2 flow at 723 K for 2 h.(C) Yields of CO and CH4 products and (D) the selectivity to CH4 for the photoreduction of CO2 with H2 on In2O3, 1.0Pt/In2O3, 1.0Pt/In2O3-W and 1.0Ag/In2O3.The error bars represent the standard deviations of three independent Figure 2. (A, B) SEM images of the In2O3 and 1.0Pt/In2O3 photocatalysts, respectively.(C) TEM and (D) HRTEM images of the 1.0Pt/In2O3. Figure 3. (A) UV-vis absorption spectra of the In2O3, 0.5Pt/In2O3, 1.0Pt/In2O3 and 2.0Pt/In2O3 photocatalysts.(B) Static-state fluorescence spectra of the photocatalysts.(C) The PL decay kinetics for the samples at 395 nm after 300 nm excitation. Figure 6.(A) The FTIR spectra for the coadsorption of CO2 and H2O (g) on the 1.0Pt/In2O3 and In2O3 photocatalysts.(B) Schematic surface species for the coadsorption of CO2 and H2O (g) on the photocatalysts. Figure 7. CH4 yields for the C1 molecules photoreduction over 1.0Pt/In2O3 and In2O3 photocatalysts at 6 h of simulated light irradiation. Figure 8. (A) Coverage vs. pressure of H2 on the In2O3, 1.0Pt/In2O3, 1.0Pt/In2O3-W and 1.0Ag/In2O3.(B) The photograph of the In2O3 and 1.0Pt/In2O3 photocatalysts before and after Scheme 1.The probable transfer paths of H adatoms derived form H2 or H2O to adsorbed CO2 over Pt/In2O3. Composition, specific surface area, pore volume and average pore size of as-prepared photocatalysts. Financial support by the National Nature Science Foundation of China (Grant No. 21473248), the CAS/SAFEA International Partnership Program for Creative Research Teams, and the Youth Talent Support Program of Shaanxi University of Science Technology is gratefully appreciated."
  }
]