[
  {
    "title": "Doi",
    "content": "10.1007/s12274-017-1552-0"
  },
  {
    "title": "Article_Title",
    "content": "Hydriding Pd cocatalysts: An approach to giant enhancement on photocatalytic CO2 reduction into CH4"
  },
  {
    "title": "Abstract",
    "content": "Photocatalytic reduction of CO 2 into high value-added CH 4 is a promising solution for energy and environmental crises.Integrating semiconductors with cocatalysts can improve the activities for photocatalytic CO 2 reduction; however, most metal cocatalysts mainly produce CO and H 2 .Herein, we report a cocatalyst hydridation approach for significantly enhancing the photocatalytic reduction of CO 2 into CH 4 .Hydriding Pd cocatalysts into PdH 0.43 played a dual role in performance enhancement.As revealed by our isotopic labeling experiments, the PdH 0.43 hydride cocatalysts reduced H 2 evolution, which suppressed the H 2 production and facilitated the conversion of the CO intermediate into the final product: CH 4 .Meanwhile, hydridation promoted the electron trapping on the cocatalysts, improving the charge separation.This approach increased the photocatalytic selectivity in CH 4 production from 3.2 to 63.6 on Pd100 and from 15.6 to 73.4 on Pd111.The results provide insights into photocatalytic mechanism studies and introduce new opportunities for designing materials towards photocatalytic CO 2 conversion."
  },
  {
    "title": "Experimental",
    "content": "K 2 PdCl 4 (Aladdin, P106044) and poly(vinyl pyrrolidone) (PVP, molecular weight (M W ) 55,000, Sigma-Aldrich, 856568; M W 29,000, Sigma-Aldrich, 234257) were used in the synthesis.All the other chemicals were of analytical grade and purchased from Sinopharm Chemical Reagent Co., Ltd.The water used in all the experiments was deionized.All chemicals were used as received, without further purification. The TiO 2 nanosheets were synthesized by modifying a method reported in the literature using hydrofluoric acid as a capping agent 22.Hydrofluoric acid is extremely corrosive and toxic and should be handled with extreme care. In a typical synthesis of TiO 2 -Pd NCs, PVP (M W 55,000, 105 mg), ascorbic acid (60 mg), and KBr (300 mg) were dissolved in 8 mL of water containing 200 mg of TiO 2 nanosheets.The reaction mixture was added to a 50-mL three-neck flask, which was then pre-heated under magnetic stirring at 80 C for 10 min.Subsequently, a 3.0-mL aqueous solution containing K 2 PdCl 4 (32 mg) was added to the flask, and the reaction was allowed to proceed at 80 C for 3 h.The product was collected via centrifugation and washed with acetone and water three times.In the transformation of TiO 2 -Pd NCs to TiO 2 -PdH 0.43 NCs, 40 mg of the TiO 2 -Pd NCs was re-dispersed in 20 mL of N,N-dimethylformamide (DMF) in a 50-mL Teflon-lined stainless-steel autoclave, which was then heated at 160 C for 16 h.The product was separated via centrifugation, washed with water three times, and dried at 45 C in vacuum. of a formaldehyde solution.The pH of the solution was adjusted to 4 by adding droplets of a 1-M HCl solution.Subsequently, the total volume of the solution was diluted to 7.5 mL using water.The solution was then transferred to a 10-mL Teflon-lined stainless-steel autoclave and heated at 150 C for 2 h.After the autoclave had cooled to room temperature, the product was separated via centrifugation and washed with acetone once and water three times.In the transformation of TiO 2 -Pd NTs to TiO 2 -PdH 0.43 NTs, 40 mg of TiO 2 -Pd NTs was re-dispersed in 20 mL of DMF in a 50-mL Teflon-lined stainless-steel autoclave, which was then heated at 160 C for 16 h.The product was separated via centrifugation, washed with water three times, and dried at 45 C in vacuum. Prior to electron-microscopy characterizations, a drop of the aqueous suspension of particles was placed on a piece of a C-coated copper grid and dried under ambient conditions.Transmission electron microscopy (TEM) and high-resolution TEM (HRTEM) images were obtained using a JEOL JEM-2100F field-emission high-resolution transmission electron microscope operated at 200 kV.Powder X-ray diffraction (XRD) patterns were recorded using a Philips X'Pert Pro Super X-ray diffractometer with Cu-K radiation ( 1.5418A).X-ray photoelectron spectra were collected using an ESCALab 250 X-ray photoelectron spectrometer, with nonmonochromatized Al-K X-ray as the excitation source.Ultraviolet (UV)-vis-near-infrared diffuse reflectance data were recorded in the spectral region of 240-800 nm using a Shimadzu SolidSpec-3700 spectrophotometer.Photoluminescence (PL) spectra were recorded using a HITACHI F-7000 Spectrofluorometer.The weight ratios of Pd to TiO 2 were measured as follows.The TiO 2 -Pd samples were dissolved in a mixture of HCl and HNO 3 (3:1, volume ratio), which was then diluted with 1 HNO 3 .The concentrations of Pd were measured using inductively coupled plasma mass spectrometry (ICP-MS, Thermo Scientific PlasmaQuad 3).Prior to the dissolution of Pd in the ICP-MS measurements, the weight ratios of TiO 2 to Pd were determined by sample weighing. Pd K-edge XAFS measurements were performed at the beamline 14W1 in Shanghai Synchrotron Radiation Facility (SSRF), China.The X-ray was monochromatized by a double-crystal Si(311) monochromator.The storage ring of SSRF was operated at 3.5 GeV with a current of 300 mA.The acquired XAFS data were processed according to the standard procedures using the WinXAS3.1 program 23.Theoretical amplitudes and phase-shift functions were calculated using the FEFF8.2code with the crystal structural parameters of the Pd foil 24. We dispersed 3.0 mg of samples in a mixture containing 10 L of ethanol and 10 L of Nafion dispersed in water (0.025).The resulting mixture was then uniformly spin-dropped onto a 1 cm 1 cm indium tin oxide (ITO)-coated glass using a spin coater (SC-1B, China).Subsequently, the ITO-coated glass was heated at 80 C in a vacuum oven for 1 h.The photocurrents were measured using a CHI 660D electrochemical station (Shanghai Chenhua, China) in ambient conditions under irradiation from a 300-W Xe lamp (Solaredge 700, China).UV light was used as the illumination source, which was realized by using a 400-nm cutoff filter (short-wave-pass).The power density of the UV light was measured to be 2.7 mWcm -2 .A standard three-electrode setup was used, with the ITO-coated glass as the photoelectrode, the Pt foil as the counter electrode, and a Ag/AgCl electrode as the reference electrode.The three electrodes were inserted into a quartz cell filled with a 0.5-M Na 2 SO 4 electrolyte.The Na 2 SO 4 electrolyte was purged with Ar for 30 min prior to the measurements.The photoresponse of the prepared photoelectrodes (i.e., photocurrent vs. time (I-t)) was investigated by measuring the photocurrent densities under chopped light irradiation (light on/off cycles: 60 s) at a bias potential of 0.4 V vs. Ag/AgCl for 400 s.Electrochemical impedance spectroscopy (EIS) was performed in the frequency range of 10 -1 to 10 5 Hz with an alternatingcurrent voltage amplitude of 10 mV at a bias potential of 0.4 V vs. Ag/AgCl.The transient open-circuit voltage Nano Res.decay (OCVD) was measured for a total of 600 s, and the light was switched on and off 100 and 300 s from the start, respectively.The average lifetime of the photogenerated carriers ( n ) was obtained according to the OCVD using the following equation where k B is the Boltzmann constant, T is the temperature (in Kelvin), and q is the unsigned charge of an electron. Photocatalytic CO 2 reduction was conducted in a 100-mL reactor purchased from Perfect Light (Beijing, China).To remove possible trace organic contaminants, all the samples were treated at 160 C for 3 h in air. In a typical process, 15 mg of the photocatalyst was dispersed on a flat glass plate on the bottom of the reactor.Then, 1 mL of H 2 O was added to surround the glass plate.The reactor loaded with catalysts was first purged with high-purity CO 2 for 30 min.The pressure of the CO 2 was regulated to 0.15 MPa.Then, a light-irradiation experiment was performed using a 300-W Xe lamp with UV light as the illumination source.The power density of the UV light ( 400 nm) was measured to be 2.7 mWcm -2 .The photocatalytic reaction was typically performed for 4 h.During the irradiation, 1 mL of gas was sampled from the glass chamber for each time interval (1 h).The amount of products evolved was determined using gas chromatography (GC-2014, Ar carrier, Shimadzu).The H 2 and O 2 were measured using a thermal conductivity detector.The CH 4 was measured using a flame ionization detector (FID).The CO was converted to CH 4 by a methanation reactor and then analyzed using the FID.During durability tests, the photocatalysts were collected and treated at 160 C for 3 h after each run and then re-used for the photocatalytic reduction of CO 2 .The isotope-labeled experiments were performed using 13 CO 2 and D 2 O instead of 12 CO 2 and H 2 O, respectively, and the products were analyzed using gas chromatography-mass spectrometry (7890A and 5975C, Agilent).Upon the formation of the TiO 2 -Pd hybrid structure, the Pd NCs supported on the TiO 2 nanosheets were transformed into palladium hydride through a solvothermal process in DMF, as the decomposition of DMF can produce H 2 to hydride Pd NCs 25.As revealed by TEM (Fig. 1(c) and Fig. S3 in the ESM), the cubic shape of the nanocrystals was well maintained after the treatment.No NCs fell off the TiO 2 nanosheets.This is confirmed by the ICP-MS measurement, which indicates no obvious change in the Pd : TiO 2 weight ratios during the hydride formation."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Although there was no change in the crystal symmetry or exposed facets during the hydride formation (see the HRTEM image in Fig. 1(d)), the lattice spacing of the (200) planes increased from 1.95 to 1.99 A, indicating a 2.1 lattice expansion.Such a lattice expansion is confirmed by the XRD analysis.As shown in Fig. 1(e), all the diffraction peaks for the TiO 2 -Pd NCs are assigned to anatase TiO 2 (JCPDS 21-1272) and fcc Pd (JCPDS 65-2867).After the hydride formation, the diffraction peaks of Pd shifted towards lower angles, indicating the lattice expansion.Specifically, the lattice constant increased by 2.1: from approximately 0.389 nm (Pd) to approximately 0.397 nm.This suggests the formation of -palladium hydride (PdH 0.43 ) with Nano Res. a H : Pd ratio of 0.43, given the relationship between the H concentrations and Pd-Pd distance 262728.The DMF decomposition did not cause the hydridation of the TiO 2 nanosheets, as revealed by XRD (Fig. 1(e)).We call this sample TiO 2 -PdH 0.43 NCs. Given the subtle lattice expansion, it is imperative to precisely resolve the local structural information for Pd atoms.The samples were characterized via synchrotron radiation-based XAFS spectroscopy.Figure 1(f) shows the Pd K-edge extended XAFS (EXAFS) spectra processed through a Fourier transform, with standard Pd foil as a reference.The Pd-Pd bond length of the Pd NCs extracted from the EXAFS curve fitting shown in Fig. S4 in the ESM (2.75 A) is very comparable to that of standard Pd foil and increased by 2.1 (to 2.81 A) after the hydride formation, which agrees with the HRTEM and XRD results. Upon the completion of the designed synthesis, we investigated the effect of the cocatalyst hydridation on photocatalytic CO 2 reduction.In the assessment, the photocatalysts were irradiated under UV light ( 400 nm), corresponding to the bandgap of anatase TiO 2 , in the presence of CO 2 and H 2 O in a reaction cell, and the products in the gas phase were taken from the cell at specific intervals (1 h) for quantitative analysis.Figures 2(a S1 in the ESM). Palladium hydride is a stable compound; thus, the TiO 2 -PdH 0.43 NCs maintained excellent photocatalytic durability in successive cycles (Fig. 2(d)).After four 4-h cycles, the average CH 4 production rate remained The next question concerns which factor improves the CH 4 selectivity.To gain insight into the reaction mechanisms, we traced the C and H sources in the reactions using isotopic labels.Figures 3(a) and 3(b) show the mass spectra of the CO and CH 4 products, using 13 CO 2 as substrate, under identical photocatalytic reaction conditions.The peaks at m/z 29 and m/z 17 are assigned to 13 CO and 13 CH 4 , indicating that the C source of CO and CH 4 was the used CO 2 .Because CO 2 was indeed the C source, the selectivity was directly related to the CO 2 hydrogenation.In addition to the protons from water, the lattice H on the surface of PdH 0.43 NCs may participate in the hydrogenation of CO 2 into CH 4 29.Figures 3(c This argument is supported by a control experiment in a H 2 environment (Fig. 3(f)).The H 2 induced the formation of a hydride with the Pd cocatalyst in the TiO 2 -Pd NCs, promoting the production of CH 4 vs.CO (see the comparison with Table S2 in the ESM), similar to the mechanism for TiO 2 -PdH 0.43 NCs.However, in the case of the TiO 2 -PdH 0.43 NCs, the H 2 that could be dissociated and diffuse into the Pd lattice only contributed to the maintenance of the PdH 0.43 phase during the photocatalytic CO 2 reduction, because a hydride had been performed in the PdH 0.43 cocatalyst.As a result, the addition of H 2 only slightly altered the products of CO 2 reduction. The foregoing information indicates that the lattice H in PdH 0.43 cocatalysts is the key to high CH 4 selectivity 30.CO is an important intermediate in the reduction of CO 2 to CH 4 (CO 6H 6e - CH 4 H 2 O) 1.Our results suggest that the lattice H plays multiple roles in the photocatalytic reduction of the CO intermediate to the CH 4 product.First, the numerous M-H bonds in PdH 0.43 slow the proton reduction and the H 2 evolution, as indicated by the low H 2 production rate, preserving sufficient photoexcited electrons for CO reduction.Second, the direct participation of the lattice H more easily triggers the CO reduction through CO adsorption to the Pd sites, as suggested by the D isotopic labeling.Third, only a very small portion of newly reduced H atoms may diffuse into the Pd lattice for a complement to the lattice H consumption, while most of them should be supplied to the reduction of CO to CH 4 , as revealed by the significantly increased ratio of CH 4 to CO products. In addition to reaction kinetics, charge separation is another factor that improves the conversion of CO into CH 4 2,31,32.As TiO 2 -Pd NCs and TiO 2 -PdH 0.43 NCs exhibit comparable UV light absorption (Fig. S6 in the ESM), the efficiency of charge separation greatly determines the electron density of the cocatalyst for photocatalytic reduction.To examine the efficiency of charge separation, we measured the PL emission spectra of the samples (Fig. 4 photogenerated carriers ( n ) were estimated as the electron-hole recombination gradually occurred when the light illumination was turned off. Figure 4(d) shows that the TiO 2 -PdH 0.43 NCs had a longer average carrier lifetime than the TiO 2 -Pd NCs. Overall, the altered reaction kinetics together with the improved charge separation should be responsible for the enhanced photocatalytic reduction of CO 2 to CH 4 (Fig. 4 Nano Res. because of the stronger capabilities of the Pd111 facets for CO 2 adsorption and activation 14."
  },
  {
    "title": "Conclusions",
    "content": "We employed palladium hydride as a model system to investigate the role of the H 2 evolution kinetics in photocatalytic CO 2 reduction.Hydridation significantly improved the charge separation, extending the photoexcited carrier lifetimes and reducing the H 2 evolution, which suppressed the H 2 production.The altered charge and reaction kinetics preserved sufficient photoexcited electrons and newly reduced H atoms for the successive conversion of the CO intermediate into the final product: CH 4 .The selectivity for the photocatalytic reduction of CO 2 into CH 4 was dramatically enhanced from 3.2 to 63.6 for Pd100 and from 15.6 to 73.4 for Pd111.This work offers an alternative approach for catalyst design and provides information for reaction kinetics towards the application of photocatalytic CO 2 conversion. Synthesis of TiO 2 -Pd and TiO 2 -PdH 0.43 nanotetrahedrons (NTs) In a typical synthesis of TiO 2 -Pd NTs, K 2 PdCl 4 (4.9 mg), Na 2 C 2 O 4 (50.3 mg), and PVP (M W 29,000, 8.3 mg) were dissolved in 5 mL of water containing 30 mg of TiO 2 nanosheets, followed by the addition of 200 L 3 Nano Res. FigureS1in the Electronic Supplementary Material (ESM) shows the synthesis process for our hybrid structures comprising TiO 2 nanosheets and PdH 0.43 cocatalysts.In our investigation, the TiO 2 nanosheets, which were in the anatase phase (JCPDS 21-1272) and had flat (001) surfaces (Fig.S2in the ESM), were selected as a semiconductor model to examine the effect of the cocatalyst hydridation on the photocatalytic CO 2 reduction.The large flat surfaces of the TiO 2 nanosheets facilitated the deposition of cocatalyst nanocrystals, while the small thickness reduced the distance of the charge transfer from bulk semiconductor to the cocatalyst and thus reduced the electron loss during the charge transfer.Pd NCs were grown in situ on the TiO 2 nanosheets, forming a hybrid structure (i.e., TiO 2 -Pd NCs), in which K 2 PdCl 4 was reduced by ascorbic acid with KBr as a 100 facet-selective capping agent.As revealed by TEM (Fig.1(a)), the Pd nanocrystals had a well-defined cubic profile with edge lengths of 10-12 nm and were uniformly distributed over the flat surface of the TiO 2 nanosheets.The HRTEM image in Fig.1(b)shows continuous lattice fringes with a spacing of 1.95 A, which are assigned to the (200) planes of face-centered cubic (fcc) Pd.This indicates that the Pd NCs were single crystals enclosed by 100 facets.Thus, the TiO 2 (001)-Pd(100) interfaces were formed through intimate facet-to-facet contact (Fig.S3in the ESM).As determined by ICP-MS, the weight ratio of Pd to TiO 2 in the TiO 2 -Pd NCs was 4.6 : 100 (TableS1in the ESM).Upon the formation of the TiO 2 -Pd hybrid structure, the Pd NCs supported on the TiO 2 nanosheets were transformed into palladium hydride through a solvothermal process in DMF, as the decomposition of DMF can produce H 2 to hydride Pd NCs25.As revealed by TEM (Fig.1(c) and Fig.S3in the ESM), the cubic shape of the nanocrystals was well maintained after the treatment.No NCs fell off the TiO 2 nanosheets.This is confirmed by the ICP-MS measurement, which indicates no obvious change in the Pd : TiO 2 weight ratios during the hydride formation. Figure 1 (a) TEM and (b) HRTEM images of TiO 2 -Pd NCs.(c) TEM and (d) HRTEM images of TiO 2 -PdH 0.43 NCs.The insets of (b) and (c) show magnified images, indicating the lattice fringes.(e) XRD patterns of TiO 2 nanosheets, TiO 2 -Pd NCs, and TiO 2 -PdH 0.43 NCs compared with standard patterns for anatase TiO 2 (black, JCPDS 21-1272) and fcc Pd (red, JCPDS 65-2867).(f) k 3 -weighted Fourier-transform Pd K-edge EXAFS spectra of TiO 2 -Pd NCs and TiO 2 -PdH 0.43 NCs compared with the spectrum of Pd foil.The lengths of the Pd-Pd bonds extracted from the curve-fitting of the Pd K-edge EXAFS data are listed in the inset. )-2(c) show the evolution of H 2 , CO, and CH 4 for the TiO 2 -based samples with respect to the irradiation time.The TiO 2 -PdH 0.43 NCs and TiO 2 -Pd NCs exhibited significantly higher photocatalytic activity than bare TiO 2 in the production of total products, demonstrating the role of Pd and PdH 0.43 NCs as cocatalysts.Compared with the TiO 2 -Pd NCs, the TiO 2 -PdH 0.43 NCs exhibited a higher CH 4 yield but less H 2 and CO production.Specifically, TiO 2 -PdH 0.43 NCs yielded 82.40 molg -1 CH 4 in 4 h, which is approximately 11 times larger than the value for the TiO 2 -Pd NCs.Thus, the selectivity of the CH 4 production was increased from 3.2 to 63.6 by hydriding the cubic Pd cocatalysts (see Table Figure 2 Time-dependent production of (a) H 2 , (b) CO, and (c) CH 4 in photocatalytic CO 2 reduction with bare TiO 2 , TiO 2 -Pd NCs, and TiO 2 -PdH 0.43 NCs under UV ( 400 nm) irradiation.(d) Cycling CH 4 evolution with TiO 2 -PdH 0.43 NCs in photocatalytic CO 2 reduction. Figure 3Mass spectra of (a)13 CO (m/z 29) and (b)13 CH 4 (m/z 17) produced with TiO 2 -PdH 0.43 NCs in the photocatalytic reduction of 13 CO 2 .Mass spectra of CH x D 4-x produced with (c) TiO 2 -PdH 0.43 NCs and (d) TiO 2 -Pd NCs in photocatalytic CO 2 reduction using D 2 O.The isotopic labeling experiments were performed under identical photocatalytic reaction conditions to those for Fig. 2. (e) Time-dependent CH 4 production in the photocatalytic CO 2 reduction for bare TiO 2 , TiO 2 -Pd NCs and TiO 2 -PdH 0.43 NCs in the absence of H 2 O. (f) CH 4 production rates in photocatalytic CO 2 reduction forTiO 2 -Pd NCs and TiO 2 -PdH 0.43 NCs in an H 2 environment. Nano Res.corresponding to CH x D 4-x (x 0-3), the fragments with lower m/Z values are more abundant for the TiO 2 -PdH 0.43 NCs.This indicates that the hydridation altered the reaction process.Most likely, a small portion of H atoms in the CH 4 product generated by the TiO 2 -PdH 0.43 NCs originated from the lattice H in PdH 0.43 .To further identify the role of the lattice H in the CH 4 production, we performed photocatalytic CO 2 reduction in the absence of H 2 O.As shown in Fig. 3(e), the TiO 2 -PdH 0.43 NCs generated a small amount of CH 4 , suggesting that the lattice H participated in the CO 2 hydrogenation.The participation of the lattice H in the CO 2 hydrogenation should have formed a cycle involving the photocatalytic reduction of protons and the diffusion of H into the Pd lattice, maintaining the phase of the PdH 0.43 cocatalysts for long-term use (Fig. S5 in the ESM). (a)), which may provide insight into the electron-hole recombination.The TiO 2 -PdH 0.43 NCs exhibited the lowest PL intensity, suggesting that the charge recombination was substantially suppressed.This is supported by the photocurrent responses collected during the light on/off cycles using a three-electrode PEC cell.As shown in Fig. 4(b), the photocurrent responses under UV light irradiation increased in the following order: bare TiO 2 TiO 2 -Pd NCs TiO 2 -PdH 0.43 NCs.Compared with the TiO 2 -Pd NCs, the larger photocurrents for the TiO 2 -PdH 0.43 NCs indicate the improved electron transfer from the conduction band of TiO 2 to the PdH 0.43 cocatalysts.This is supported by the EIS results (Fig. 4(c)), in which the TiO 2 -PdH 0.43 NCs exhibit the lowest resistance associated with the facilitated interfacial charge transfer.The improvement of the electron trapping should have been caused by the lattice H, which had more electronegativity than the Pd in the PdH 0.43 and formed new H-induced energy states below the bottom of the Pd-derived d-bands, thus improving the ability to accept electrons 31.The improved charge separation led to prolonged carrier lifetimes, as indicated by the transient OCVD measurements.As shown in Fig. S7 in the ESM, the amplitudes of the open-circuit voltage (V oc ) follow the same sequence as the photocurrents in Fig. 4(b)-bare TiO 2 TiO 2 -Pd NCs TiO 2 -PdH 0.43 NCs-confirming that the PdH 0.43 NCs promoted the charge separation.According to the V oc decay in the dark, the average lifetimes of the Nano Res. (e)), where the lattice H in the PdH 0.43 cocatalysts is the key, regardless of the other factors.To prove this concept, we employed Pd NTs with 111 facets as a model to perform the same investigation.The Pd NTs were grown in situ on TiO 2 nanosheets using formaldehyde and Na 2 C 2 O 4 as facet-selective capping agents (Figs.S8-S10 in the ESM).Using this platform, we observed the same enhancement of the charge separation and CH 4 production (see Figs. S11-S13 in the ESM).Specifically, the selectivity of the CH 4 production was increased from 15.6 to 73.4 by hydriding the tetrahedral Pd cocatalysts.This indicates that the proposed photocatalytic mechanism is independent of the shape and the exposed facets of the Pd cocatalysts.The selectivity of NTs in the CH 4 production is slightly higher than that of NCs, mainly Figure 4 (a) PL spectra of bare TiO 2 , TiO 2 -Pd NCs, and TiO 2 -PdH 0.43 NCs excited at 315 nm.(b) I-t curves and (c) EIS Nyquist plots at a bias potential of 0.4 V vs. Ag/AgCl under UV ( 400 nm) irradiation.(d) Average lifetimes of the photogenerated carriers ( n ) obtained from transient OCVD measurements (see raw data in Fig. S7 in the ESM).(e) Schematics illustrating the photocatalytic reactions between CO 2 and H 2 O for the TiO 2 -Pd NCs and TiO 2 -PdH 0.43 NCs. www.theNanoResearch.comwww.Springer.com/journal/12274 Nano Research This work was financially supported in part by the National Natural Science Foundation of China (Nos.21471141, U1532135, and 21603191), CAS Key Research Program of Frontier Sciences (No. QYZDB-SSW-SLH018), Zhejiang Provincial Natural Science Foundation (No. LQ16B010001), Recruitment Program of Global Experts, and CAS Hundred Talent Program.XAFS measurements were performed at the beamline BL14W1 in the Shanghai Synchrotron Radiation Facility (SSRF), China. Electronic Supplementary Material: Supplementary material (schematic illustration for material synthesis, TEM images, XAFS spectra, XRD patterns, UV-vis-IR reflectance spectra, OCVD curves and photocatalytic data) is available in the online version of this article at https://doi.org/10.1007/s12274-017-1552-0."
  }
]