[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2014.06.037"
  },
  {
    "title": "Article_Title",
    "content": "Indium-doped TiO 2 nanoparticles for photocatalytic CO 2 reduction with H 2 O vapors to CH 4"
  },
  {
    "title": "Abstract",
    "content": "Indium (In)-doped titanium dioxide (TiO 2 ) nanoparticles were synthesized using a controlled sol-gel method.The structures and properties of the catalysts were characterized by XRD, FE-SEM, TEM, XPS, BET, UV-vis and PL spectroscopy.Indium, present over the TiO 2 in metal state, inhibited crystal growth and produced anatase phase of mesoporous TiO 2 nanoparticles.Doping In in TiO 2 also increased the surface area and enlarged the band gap.The photocatalytic activities of In-doped TiO 2 nanoparticles were considerably improved for CO 2 reduction with H 2 O vapors in a cell type photoreactor.CO was observed as the main product over TiO 2 , but doping In in TiO 2 remarkably increased the CH 4 yield.CH 4 production rate over 10 wt. In-doped TiO 2 was 7.9-fold higher than the bare TiO 2 at 100 C and CO 2 /H 2 O ratio of 1.43.In addition, C 1 -3 higher hydrocarbons namely C 2 H 4 , C 2 H 6 , C 3 H 6 and C 3 H 8 were detected in the product mixture.The enhanced photoactivity in mesoporous In-doped TiO 2 nanoparticles can be attributed to interfacial transfer of photogenerated charges, which led to effective charge separation and inhibited recombination of photogenerated electron-hole (e -/h ) pairs.Langmuir-Hinshelwood model, developed to investigate reaction rate parameters, fitted well with the experimental data."
  },
  {
    "title": "Experimental",
    "content": "Fig. 1 describes the schematic procedure for synthesis of In-doped TiO 2 nanoparticles.In-doped TiO 2 nanoparticles were prepared using a controlled sol-gel single step method using titanium (IV) iso-propoxide (Merck) and indium (III) nitrate (Merck). The precursory of titanium solution was prepared with molar ratios: Ti(C 4 H 9 O) 4 :15C 2 H 5 OH:2CH 3 COOH (1 M).Typically, 10 mL of titanium tetra iso-propoxide was mixed in 30 mL of isopropanol and was stirred for 30 min in a 250 mL round bottom flask (sample A).In parallel, 6.37 mL of 1 M acetic acid was dissolved in 10 mL of isopropanol by stirring for 30 min (sample B).Hydrolysis process was conducted by adding drop wise sample B into sample A and vigorously stirring the mixture for 24 h at 30 C. Next, an appropriate amount of indium nitrate was dissolved in isopropanol under constant stirring for 30 min.Both indium and titanium solution were stirred for 12 h until clear sol was produced.The sol was dried in the oven at 80 C for 12h under airflow.The dried sol was grinded to fine powder.Finally, the samples were calcined in a muffle furnace at a rate of 5 C min -1 up to 500 C and held at this temperature for 5 h.The bare TiO 2 nanoparticles were also prepared using the same procedure. In order to determine the structure and crystallinity of the samples, powder X-ray diffraction (XRD) was performed on Bruker D8 advance diffractometer (Cu-K radiation, 1.54060A, operated at 40 kV and 40 mA).The scanning rate was 1.2 min -1 from 10 to 70 .Field emission scanning electron microscopy (FE-SEM) was performed using JEOL JSM-6701F with EDX detector for calculating elements composition in photocatalysts.The particle size and lattice structure of the individual crystals were visualized by high-resolution transmission electron microscope (HR-TEM) with FEI-Tecni G2 Transmission Electron Microscope (TEM).Textural characterization of the samples was analyzed with a Micromeritics ASAP 2020.The N 2 adsorption-desorption properties were examined at 77 K. Specific surface area (S BET ) of monolayer coverage was determined using Brunauer-Emmett-Teller (BET) method.The pore size distribution was measured from the adsorption branch of the isotherm by means of Barrett-Joyner-Halenda (BJH) method.The XPS measurement was performed using Omicron DAR analyser.The photocatalyst was fixed to the sample holder using carbon tape.The pass energy used was 20 eV, while the instrument was operated at 15 kV.The survey spectra were recorded in the range of 0-1400 eV.The binding energies were calibrated against the C1s signal (284.6 eV) as the internal standard.UV-vis absorption spectra of the samples were obtained from Shimadzu UV pc UV-Vis-NIR spectrophotometer.Finally, the recombination rate of the photogenerated electron-hole pairs (e -/h ) was estimated using Perkin Elmer LS 55 Luminescence spectrophotometer. The schematic presentation of the cell type photoreactor is illustrated in Fig. 2. The reactor consisted of a rectangular cell with 3 cm 4 cm 9 cm dimensions, and a total volume of 108 cm 3 .Photocatalytic activity was conducted over 0.25 g of powdered catalyst distributed uniformly at the bottom of the reactor chamber.A 10 mm thick quartz glass window covered the top of the reactor to enable effective transfer of irradiation from the 500 W mercury (Hg) flash lamp to the catalyst surface.The UV-light source, inserted inside the cold trap, have maximum irradiations intensity of 40 mW/cm 2 at wavelength 365 nm.The light intensity was measured with an optical process monitor, ILT OPM-1D, and XRD-340A sensor that was placed inside the reactor prior to the experiment.The lamp, connected to a high voltage power supply, was ignited through an igniter and a stabilizer.The reactor chamber and the lamp was covered with aluminum foil to ensure all the irradiations participating in the reaction came through the quartz window only. The reactor, checked for leakage at 2 bar pressure for several hours, was purged using helium (He) carrier gas.Compressed CO 2 (99.99) regulated by mass flow controller (MFC) was bubbled through water saturator to carry moisture.The CO 2 concentration was controlled using He (99.99) as the diluent.The pressure inside the photoreactor was maintained at 0.20 bars above atmospheric pressure.The reactor was purged for an hour using a mixture of CO 2 and He prior to starting the experiment. During photocatalysis process, the product mixture was analyzed using an on-line gas chromatograph (GC-Agilent Technologies 6890 N, USA) equipped with a thermal conductivity detector (TCD) and a flame-ionized detector (FID).Similarly, for offline analysis, gaseous products from the reactor were also taken using a gastight syringe (Agilent, 1000 L) having the same volume.The FID detector was connected with a HP-PLOT Q capillary column (Agilent, length 30 m ID 0.53 mm, film 40 m) for separation of C 1 -C 6 paraffin and olefin hydrocarbons, alcohols and oxygenated compounds.The TCD detector was connected to UCW-982, DC-200, Porapak Q and Mol Sieve 13X columns.The UCW-982 was used for back flush and reversed flow to ensure C 6 and higher compounds could be detected earlier in the chromatogram.Meanwhile, C 1 -C 2 , C 3 -C 5 compounds and light gasses (H 2 , O 2 , N 2 and CO) were separated using Porapak Q, DC-200, and MS-13X columns, respectively. The yield rate and selectivity of carbon containing products are calculated using Eqs.( 1) and (2). Selectivity of product where C i is the mole of carbon species (CO, CH 4 , C 2 H 4 , C 2 H 6 , C 3 H 6 and C 3 H 8 ) in the product mixture and C is the moles of total carbon compounds produced."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The XRD spectra of TiO 2 and In-doped TiO 2 samples are shown in Fig. 3. XRD peaks of the bare TiO 2 revealed pure crystalline and anatase phase calcined at 500 C for 5 h.Similarly, all the peaks of the In-doped TiO 2 samples confirming the formation of anatase and crystalline TiO 2 nanoparticles.However, all the peaks attributable to In in metal or oxide phase were not observed, even for the sample with 20 wt. In-content.Furthermore, the TiO 2 anatase peaks become wider, while the intensities also increased with In doping, but no shifting in the TiO 2 peaks was observed.The wider anatase In-doped TiO 2 peaks indicate reduced TiO 2 crystallite size in presence of In.Furthermore, the ionic radius of In ion (0.081 nm) is larger than that of the lattice titanium ion (0.068 nm) 19.Therefore, the possibility of In entering into the TiO 2 crystal cell was least.Thus, it is reasonable to deduce all the In was deposited over the TiO 2 surface as nanosized particles, which were not detectable by XRD.Similar observations have been reported in the literature for In-doped TiO 2 samples 20.In order to confirm the crystallite shape of each sample, all the peaks were compared with the JCPDS-ICSD standards for anatase (89-4921).The diffraction peaks for TiO 2 appeared at 25.59 , which are also consistent with (101), (0 0 4), (2 0 0), (1 0 5), (2 1 1) and (2 0 4) planes, matching to tetragonal anatase TiO 2 .The size of the crystallites in Table 1 was estimated using Scherrer equation based on XRD (1 0 1) peaks.At higher In content, smaller crystallites are obtained possibly due to In controlling TiO 2 crystal growth.The calculated crystallite sizes were 19, 14, 11, 10, and 9 nm for TiO 2 , 5, 10, 15 and 20 wt.In doped TiO 2 samples, respectively.Obviously, at higher In content, the decrease in crystallite size is significant.Similar observations have been reported in the literature 21.Furthermore, cell parameters and cell volumes of TiO 2 and In-doped TiO 2 crystallites are summarized in Table 1.The cell parameters and cell volumes are comparable to those reported in JCPDS-ICSD (89-4921) standards for anatase TiO 2 , i.e. a b 3.777 A, c 9.501, and v 135.54A3 .These observations confirmed fully developed tetragonal crystal shape of anatase TiO 2 , while In-incorporation into TiO 2 lattice did not alter the cell structure. Fig. 4 portrays the field emission scanning electron micrographs (FE-SEM) recorded in order to measure the morphology and particle size of TiO 2 and In-doped TiO 2 nanoparticles.All the nanoparticles of TiO 2 are reasonably similar, thus minimizing the possibility of any unusual large particles as shown in Fig. 4(a).The uniform shape of the mesoporous spherical particles can be attributed to the TiO 2 crystal growth due to controlled hydrolysis process.Fig. 4(b) portrays micrograph of In-doped TiO 2 nanoparticles.The agglomeration is obvious, possibly due to the interaction of small crystallites.Similarly, particle size distribution and mesoporosity are presented in Fig. 4(c).The average In-doped TiO 2 particle size is in the range of 28-31 nm, which are larger compared to crystal size measured with XRD, reiterating possible agglomeration formations.EDX analysis also confirmed the presence of In-metal in In-doped TiO 2 sample as illustrated in Fig. 4(d).EDX spectra showed the appearance of peaks of O, In and Ti, indicating carbon was not detected in all the samples.The results of EDX elemental analysis of all the catalysts are presented in Table 1.5(a andb), with the average particle size having diameter less than 13 nm, closer to the crystallite size estimated by Scherrer equation.The nanoparticles have interparticle mesoporous structure, possibly due to the growth and aggregations of small particles.The HR-TEM images in Fig. 5(c andd) corroborated with the XRD morphology of TiO 2 nanoparticles, where 0.35 nm aligned anatase phase are grown along 101 directions.All the characterization results are in good agreement with previous reports 14,22. Fig. 6 exhibits the N 2 adsorption-desorption isotherms of TiO 2 and In-doped TiO 2 nanoparticles.All the isotherms are similar to type IV curve of the hysteresis loops, conforming to mesoporous materials 23.The mesoporous structure of TiO 2 and In-doped TiO 2 samples without surface directing agents were evidently due to the controlled hydrolysis process.Furthermore, the initial part of the isotherms (at low P/P o ) is related to the monolayer-multilayer adsorption on the internal surface.However, at higher P/P o , the steep increment in the adsorption volume is attributed to the capillary condensation as the pores were saturated with liquid.The monolayer-multilayer was more dominant in TiO 2 samples in which capillary action started at P/P o 0.60.Both the capillary and condensation processes are prominent in In-doped TiO 2 samples at P/P o 0.55. The surface area, pore volume and pore size of all samples are summarized in Table 2.The BET surface area of TiO 2 was 42.98 m 2 /g, increased to 61, 84, 98 and 123 m 2 /g with 5, 10, 15 and 20 wt.In doping respectively.The, t-plot external surface area increased, while t-plot micropore surface area reduced significantly with In doping.Larger surface area can also be attributed to the suppression of TiO 2 crystal growth by In.Furthermore, the mesoporous structure of TiO 2 and In-doped TiO 2 catalysts without the addition of surface directing agents is supposedly due to the controlled hydrolysis process using diluted acetic acid.Similarly, BJH adsorption pore volume increased while pore diameter decreased with In doping.Thus, the increase in pore volume with reduced pore diameter was possibly due to the controlled crystal growth in the In-doped TiO 2 samples.All these results are consistent with previous reports 24. The chemical state of Ti, In, O, and C in In-doped TiO 2 was determined by X-ray photoelectron spectroscopy (XPS).The Ti 2p The UV-vis absorbance spectra of TiO 2 and In-doped TiO 2 samples are depicted in Fig. 8.The absorption band edge of TiO 2 was located at 398 nm, which indicates an obvious red shift in the wavelength of TiO 2 compared to the standard anatase TiO 2 ( 380 nm) catalyst .However, the TiO 2 absorption edge slightly shifted toward the longer wavelengths by incorporating In into the TiO 2 structure.The band gap energy (eV) of the samples was calculated using Tauc equation.The E bg values of all the samples were measured from a plot of ( hv) 2 versus (hv) using direct method as shown in Fig. 9.The E bg estimated from the intercept of the tangents to the plots is 3.12 eV for TiO 2 , but shifted to higher values with In doping as tabulated in 21,27.Therefore, incorporation of In in the crystalline and mesoporous TiO 2 allows the formation of a UV semiconductor, which could also inhibited the recombination of photogenerated charges.Fig. 10 compares the photoluminescence (PL) spectra for TiO 2 nanoparticles and In-doped TiO 2 samples with different In-content.In doped TiO 2 nanoparticles exhibited PL signal with similar curve shape, demonstrating In presence did not result into a new PL phenomenon.In-doped TiO 2 nanoparticles exhibited a wide and strong PL signals in the range of 450-550 nm with the excited wavelength of 350 nm.The spectral peak located at 458 nm corresponds to anatase TiO 2 while two peaks at 483 and 527 nm are attributed to the transition from the oxygen vacancies with two and one trapped electron to the TiO 2 valance band, respectively.Due to oxygen vacancies, the photogenerated electrons in the conduction band initially reached the vacant space and then recombined with the photogenerated holes in the valance band to produce fluorescence emission 19,20.However, TiO 2 band is more intense while the In-doped TiO 2 band intensities gradually weakened.The reduced PL intensity for In-doped TiO 2 catalysts is possibly due to the In incorporated into TiO 2 , hindering electron-hole pairs recombination rate on the In-doped TiO 2 surface.In other words, the recombination of photogenerated carriers via transition from the oxygen vacancies to TiO 2 valance band was suppressed efficiently upon doping with In-ions 20,21. Prior to CO 2 photoreduction activity test, a series of preliminary tests were conducted in the absence of CO 2 and H 2 O under UV light irradiations for a period of 2 h at 100 C for the following cases; (1) empty reactor and He, (2) reactor with TiO 2 nanoparticles and He and (3) reactor with In-doped TiO 2 photocatalysts and He.In all cases, reaction products were not detected, confirming no organic residues photodecomposition in the catalyst, if any.Additional preliminary tests were conducted using H 2 O vapors and He in presence of photocatalyst under UV irradiations.Again, in either case no carbon-containing compounds were observed.These results confirmed photoreduction products were obtained from CO 2 source only.Therefore, it is reiterated that the photocatalytic reduction processes require all three components, i.e. catalyst, feed (CO 2 , H 2 O), light source and any carbon containing compounds should be produced from CO 2 through photocatalytic reactions.All the photocatalytic CO 2 reduction experiments were repeated at least in triplets and aggregated results are reported. The effects of In-doping into TiO 2 for photocatalytic CO 2 reduction with H 2 O vapors are exhibited in Fig. 11.The doping of In-ions over TiO 2 surface led to higher photoactivity for CO 2 photoreduction.CH 4 yield was low over pure TiO 2 , but gradually increased up to 10 wt. In-content, before decreasing with more In-contents.The maximum CH 4 yield produced was 1156 mole g-catal. - over 10 wt. In-doped TiO 2 catalyst compared to 73 mole g-catal. - using bare-TiO 2 when irradiated for 2 h.Thus, the optimum amount of In-content doped into TiO 2 was 10 wt., revealing effect of In was more extensive.The significant increments in CH 4 yield over In-doped TiO 2 was possibly due to the ability of In to trap electrons and/or holes and alter their recombination rates through the processes explained in Eqs. ( 3) and (4). Therefore, In-doping can promote the charge pair separation of TiO 2 photocatalyst for higher CO 2 reduction efficiency.Photoexcited electrons in the TiO 2 conductance band can be accepted and transferred efficiently to CO 2 , functioning as an efficient reducing agent.The electrons can also be scavenged by O 2 which in turn produces superoxide O 2-.The positive holes in the valance band can be trapped by OH -or H 2 O species adsorbed over TiO 2 surface.These processes promote the separation of photogenerated electron-hole pairs (e -/h ) to accelerate CO 2 reduction process, enhancing In-doped TiO 2 catalytic performance.In general, doping In into TiO 2 helps to trap photogenerated electrons and hindered photogenerated charges recombination, which is one of the limiting factors in TiO 2 photoactivity 28,29.However, excess In-content reduced TiO 2 photoactivity, possibly due to establishing charge recombination centers inside the TiO 2 structure.Furthermore, excess In-dispersion over the TiO 2 surface probably masked its surface resulting in less light exposure for production of electron-hole pairs 30.Higher concentration of In-ions leads to the recombination of photogenerated electrons and holes according to Eqs. ( 5) and ( 6): Fig. 12 depicts the relationship between CH 4 and CO yields and feed ratio of CO 2 /H 2 O in the initial feed stream.The yield of CH 4 increased with relatively larger concentration of CO 2 adsorbed over the In-doped TiO 2 surface at higher CO 2 /H 2 O feed ratios.However, after CO 2 /H 2 O feed ratio of 1.43, a significant reduction in the CH 4 yield was observed, possibly due to lower concentration of H 2 O molecules adsorbed at the catalyst surface to react with CO 2 .Similarly, the decrease in the yield of CO at higher CO 2 /H 2 O feed ratio was observed.This phenomenon implied a competitive adsorption of both the reactants, i.e.CO 2 and H 2 O vapors on the active sites of the photocatalyst.At lower feed ratios (lower CO 2 concentration), H 2 O molecules would cover most of the catalyst surface, thus CO 2 would compete with H 2 O molecules.Conversely, at much higher feed ratio (higher CO 2 concentration), reaction rate was reduced possibly due to H 2 O molecules having to compete with adsorbed CO 2 to react.Therefore, an optimum concentration of CO 2 and H 2 O feed ratios could enhance CO 2 photoreduction process to obtain maximum yield rates 23,31. The amount of CH 4 produced during photocatalytic CO 2 reduction over 10 wt. In-doped TiO 2 at different reaction temperatures (80, 100 and 120 C) is presented in Fig. 13.Obviously, a significant increase in CH 4 yield could be seen at higher temperature, demonstrating higher CO 2 photoreduction rate.The enhanced CO 2 photoreduction process at elevated temperature could be explained on the basis of efficient reactant adsorption and product desorption over the catalyst surface.At higher temperature, more photoactive sites of catalysts are available to capture CO 2 , possibly due to efficient desorption of products.Therefore, higher temperature gave positive effects on photocatalytic reactions particularly in gas phase reactions and can accelerate the reaction rate.Higher temperature also reduces activation energy as similarly observed previously 32,33.Fig. 14 demonstrates the effect of reaction time on the yield of CO and CH 4 over TiO 2 and In-doped TiO 2 catalysts.CO and CH 4 concentrations gradually reached to steady state in the entire irradiation period.Over TiO 2 , CO was observed as the main product, while the yield of CH 4 was enhanced significantly over the In-doped TiO 2 catalyst, possibly due to efficient production and trapping of electrons by In.This can also be explained based on the semiconductor conductance band potentials.The conductance band (CB) of TiO 2 is 0.50 eV at pH 7 while the reduction potential of CO 2 /CH 4 is -0.24 eV.Since the conductance band potential is more negative than CO 2 /CH 4 reduction potential, the reaction is theoretically feasible.In addition, CH 4 needs 8 electrons compared to 2 electrons for CO production.Higher CH 4 production over the In-doped TiO 2 was probably due to a more negative conductance band and higher production of electrons being trapped by In-metal.Similar observations have been reported in the literatures for the photocatalytic CO 2 reduction with H 2 O over montmorillonite modified TiO 2 catalysts 23,34.Initially, the hydrocarbons yield increased markedly, but then gradually reduced with prolonged time attributable to hydrocarbons undergoing photoreduction with CO 2 or reverse oxidation reactions.Among the hydrocarbons, C 2 H 6 yield was appreciable over the entire irradiation time confirming In-doped TiO 2 catalyst was suitable for production of higher hydrocarbons especially ethane.This could also be explained based on reaction mechanism as intermediate species CH 3 - CH 3 could combine to produce C 2 H 6 instead of CH 4 .The yields of all the products were in the order of CH 4 CO C 2 H 6 C 2 H 4 .The yield rates of all products are summarized in Table 3.The operating parameters employed during photocatalytic CO 2 reduction with H 2 O vapors in cell type photoreactor are presented in Table 4.The yield rate of CH 4 over In-doped TiO 2 catalysts is 244 mole g-catal. - h -1 , 7.9-fold higher than CH 4 yield rate over bare TiO 2 .In addition, CO yield rate over the Indoped TiO 2 is 81 mole g-catal. - h -1 , 2 times higher than CO yield rate over TiO 2 .Therefore, In-doped TiO 2 catalyst is efficient for the production of CH 4 and CO.The observed selectivity was 69 and 29, for CH 4 and CO, respectively.An appreciable amount of C 2 -C 3 Summary of product yield rates during photocatalytic CO2 reduction using different catalysts. Yield rates (mole g-catal.In photocatalysis process, when photons having energy equal or higher than the band gap energy are adsorbed by the semiconductor, then electrons (e cb -) and holes (h vb ) are produced.Due to their short life time, they can recombine in bulk or on the surface within nanoseconds or can be trapped on surface state, where they react with acceptor or donors.During photocatalytic CO 2 reduction with H 2 O vapors over TiO 2 catalyst under UV light irradiations, electrons (e -) are transferred from the TiO 2 conduction band for the photoreduction of CO 2 , yielding CO - 2 radicals.On the other hand, holes (h ) are transferred to H 2 O initiating its photooxidation, yielding hydrogen ions (H ) and hydroxyal radical ( OH).The hydroxyl radicals further oxidized with H 2 O for the production of O 2 and H 35.The H radicals originated during reduction of proton reacted with carbon radicals on the catalyst surface to produce intermediates CH 2 and CH 3 radicals and finally CH 4 and higher hydrocarbons.All possible reaction steps during photocatalytic CO 2 reduction with H 2 O are explained by Eqs. ( 7)-( 24) 18,36,37. Generation and separation of charges over Indoped TiO 2 TiO 2 hv e - cb (TiO 2 ) h vb (TiO 2 ) heat ( 9) Oxidation and reduction process O Mechanism of hydrocarbon production CO - H e - C OH - C H e - CH (17) CH H e - CH 2 (18) CH 3 H e - CH 4 (20) During TiO 2 photocatalysis, large number of electrons and holes are produced over mesoporous and anatase TiO 2 nanoparticles, shifting TiO 2 in highly excited state Ti 3 -O - as explained in Eq. ( 7) and (8).The photogenerated electron could trap to produce unproductive heat as illustrated in Eq. ( 9).However, the excited electrons can be efficiently transferred over nanosized TiO 2 , possibly trapped by In-metal if any, thus resulting in efficient transfer of electrons and holes for oxidation and reduction processes as explained in Eq. (10).The photogenerated electron undergoes CO 2 reduction to produce excited CO 2 molecules, while holes react with adsorbed H 2 O molecules to precede oxidation process, as illustrated in Eqs. ( 11)- (14).The intermediate photogenerated species undergoes through different reactions, thus producing CO, CH 4 and hydrocarbons, as explained in Eqs. ( 15)- (24). Since all of the above products were detected experimentally, CH 4 was confirmed to be produced from methyl radicals ( CH 3 ).These radicals were directly dependent on the formation of the intermediate product, CO.The production of higher CH 4 yield rate and other higher hydrocarbons also confirmed efficient H 2 O oxidation and CO 2 reduction process over In-doped TiO 2 catalysts, obviously due to significant production of electron-holes being trapped by In-metal.Similar observations were reported by Saladin et al. 32 during gas phase reduction of CO 2 with H 2 O over TiO 2 surface.From the reaction summary and in view of the above observations, there is ample probability to produce hydrocarbons using metal-doped TiO 2 having good reduction potentials.However, further investigations are required to postulate feasible reaction mechanisms and predict possible reaction products. The schematic presentation of photocatalytic CO 2 reduction with H 2 O over 10 wt. In-doped TiO 2 catalyst is presented in Fig. 16(a andb).Under light irraditions, there was efficient production and absoprtion of electrons over both catalysts.Subsequently, electrons were transferred from TiO 2 conductance band to Inmetal, trapped by CO 2 molecules, leading to CO 2 reduction process.A series of reactions take place over 10 wt. In-doped TiO 2 for possible higher yield rates of C 1 to C 3 paraffins and olefins. In heterogeneous catalysis, surface reaction rates are supposed to depend on the fraction of active sites covered by different species.For an irreversible bimolecular reaction between the molecules that are competitively adsorbed on the same type of active sites, the reaction rate depends on the probability that molecules are on the adjacent sites.Furthermore, this probability may also be proportional to the product fractional coverage.The bimolecular photocatalytic reaction for CO 2 reduction can be explained using Eq. ( 25). The surface reactions are usually assumed to be the slowest step and eventually the rate controlling step.If the reactants are competitively adsorbed on the same adsorption sites with different rate constants, then such reactions can be postulated by a Langmuir-Hinshelwood (L-H) mechanism.For photocatalytic type reactions, when CO 2 and H 2 O were assumed to be adsorbed on the same active sites on the catalyst surface, the rate of Eq. ( 25) could be obtained using L-H model as described in Eq. (26).where k is the rate constant of any particular product, I is UV flux intensity in which kinetic constants are evaluated.In general, the photocatalytic reaction rate is proportional to I , where is the reaction order of light intensity, having value one or less, depending on the light intensity.K H 2 O , K CO 2 , K CO K O 2 and K CH 4 are the ratios of rate constants for adsorption and desorption of H 2 O, CO 2 , CO, O 2 and CH 4 , respectively.Eq. ( 26) can be simplified assuming only reactants are adsorbed on the catalyst surface, while all the products are desorbed immediately after chemical reaction.Thus, CO 2 and H 2 O were adsorbed on the surface of the catalyst and the modified form of L-H model becomes Eq. ( 27). The constants of the L-H model were determined by correlating with the experimental data.As shown in Fig. 17, the model and the experimental data fitted well confirming adsorption of CO 2 and H 2 O over the catalyst surface were without dissociations.It has been observed that the reaction rate is proportional to P CO 2 at a lower partial pressure, when only a small fraction of the sites are occupied.However, as P CO 2 increases, the rate becomes less dependent on it, gradually slows down possibly due to adsorption of CO 2 over the entire catalyst surface.Under such circumstances, H 2 O molecules have to compete with CO 2 molecules for chemical reactions, resulting in lower rate of reaction.The light intensity used to simulate the L-H model, Eq. ( 27) is 40 mW/cm 2 , while intensity factor ( ) value obtained is 0.75.The CO 2 adsorption constant K CO 2 over In-doped TiO 2 catalyst is 60 bar -1 , slightly higher than the adsorption equilibrium constant of H 2 O (K H 2 O 50 bar -1 ).These results reveal effective adsorption of CO 2 and H 2 O vapors over the larger mesoporous In-doped TiO 2 catalyst surface area.The reaction rate constant for CO production is 3.2 times lower than for CH 4 .Thus, the production of CO is more efficient than CH 4 at lower activation energy as discussed in the reaction mechanism when initially CO is produced, and then later converted to CH 4 ."
  },
  {
    "title": "Conclusions",
    "content": "Indium (In) doped TiO 2 nanoparticles were synthesized by sol-gel single step method for photocatalytic CO 2 reduction with H 2 O vapors in a cell type photoreactor.By doping TiO 2 with In, pure anatase phase of TiO 2 was produced with smaller particle size, larger surface area and mesoporous structure.UV-vis results revealed red shift in TiO 2 band gap, while the band for In-doped TiO 2 samples was slightly enlarged.The presence of In-metal in TiO 2 also increased active surface area and suppressed recombination of photogenerated electron-hole (e -/h ) pairs.XPS analysis showed that In was distributed over TiO 2 in metal state.Yield rates of CH 4 and CO as the main products over 10 wt. In-doped TiO 2 catalyst were 243.75 and 81.25 mole g-catal. - h -1 , respectively under UV-light irradiation at 0.20 bars reactor pressure, 373 K reaction temperature and CO 2 /H 2 O feed ratio 1.43.The other products in significant amount were C 2 H 4 and C 2 H 6 with traces of C 3 H 6 and C 3 H 8 .The selectivity of CH 4 production over TiO 2 was 40, and increased to 70 over In-doped TiO 2 nanoparticles.The yields of CH 4 and CO over In-doped TiO 2 catalysts were 7.9 and 2-folds higher than TiO 2 , respectively.The higher yield rates over In-doped TiO 2 catalyst were possibly due to higher active surface area, efficient production and inhibited recombination of electron-hole (e -/h ) pairs.The plausible pathways and reaction mechanisms were also suggested.Langmuir-Hinshelwood model fitted well with experimental data. Fig. 1.Schematic of sol-gel method for preparation of In-doped TiO2 nanoparticles. Fig. 2. Schematic of experiment setup for photocatalytic CO2 reduction with H2O vapors. Fig. 3. XRD patterns of anatase TiO2 and In-doped TiO2 catalysts; (a) TiO2, (b) 5 wt.In/TiO2, (c) 10 wt. In/TiO2, (d) 15 wt.In/TiO2 and (e) 20 wt. In/TiO2. Fig. 4. FE-SEM micrographs of TiO2 and 10 wt. In-doped TiO2 nanoparticles with EDX analysis: (a) TiO2 nanoparticles, (b) FE-SEM image of In-doped TiO2 at 1 m,(c) FE-SEM image of In-doped TiO2 at 100 nm, and (d) EDX spectrum of In-doped TiO2 sample. Fig. 5. TEM and HR-TEM images of 10 wt. In-doped TiO2 nanoparticles. Fig.5exhibits the TEM micrographs of the In-doped TiO 2 nanoparticles.Mesoporous and uniform sized TiO 2 nanoparticles are obvious as depicted in Fig.5(a and b), with the average particle size having diameter less than 13 nm, closer to the crystallite size estimated by Scherrer equation.The nanoparticles have interparticle mesoporous structure, possibly due to the growth and aggregations of small particles.The HR-TEM images in Fig.5(c and d) corroborated with the XRD morphology of TiO 2 nanoparticles, where 0.35 nm aligned anatase phase are grown along 101 directions.All the characterization results are in good agreement with previous reports14,22. Fig. 6.N2 adsorption-desorption isotherms of TiO2 and In-doped TiO2 samples. Fig. 7. XPS spectra of 10 wt. In-doped TiO2 sample: (a) spectra of Ti 2p, (b) In 3d, (c) O 1s, and (d) C 1s. Fig. 9. Band gap energy calculations from absorption spectra of TiO2 and In-doped TiO2 catalysts. Fig. 11.Effect of In-contents on TiO2 activity for the production of CO and CH4 (irradiation time 2 h, T 100 C, PH 2 O 0.042 bars and PCO 2 0.02 bars). Fig. 13.Effect of reaction temperature on the yield of CH4 production over 10 wt. In-doped TiO2 catalyst at CO2/H2O feed ratio 1.43. Fig. 14.Effect of irradiation time on CO2 reduction to CO and CH4 using TiO2 and 10 wt. In-doped TiO2 catalyst (reaction temperature 100 C, CO2/H2O feed ratio 1.43). Fig. 15.Effect of irradiation time on photocatalytic CO2 reduction to hydrocarbons over 10 wt. In-doped TiO2 catalyst (reaction temperature 100 C, CO2/H2O feed ratio 1.43). Fig. 15 exhibits the amount of C 2 H 4 , C 2 H 6 , C 3 H 6 and C 3 H 8 hydrocarbons in the product mixture produced during CO 2 reduction with H 2 O over the 10 wt. In-doped TiO 2 catalyst.Initially, the hydrocarbons yield increased markedly, but then gradually reduced with prolonged time attributable to hydrocarbons undergoing photoreduction with CO 2 or reverse oxidation reactions.Among the hydrocarbons, C 2 H 6 yield was appreciable over the entire irradiation time confirming In-doped TiO 2 catalyst was suitable for production of higher hydrocarbons especially ethane.This could also be explained based on reaction mechanism as intermediate species CH 3 - CH 3 could combine to produce C 2 H 6 instead of CH 4 .The yields of all the products were in the order of CH 4 CO C 2 H 6 C 2 H 4 .The yield rates of all products are summarized in Table3.The operating parameters employed during photocatalytic CO 2 reduction with H 2 O vapors in cell type photoreactor are presented in Table4.The yield rate of CH 4 over In-doped TiO 2 catalysts is 244 mole g-catal. - h -1 , 7.9-fold higher than CH 4 yield rate over bare TiO 2 .In addition, CO yield rate over the Indoped TiO 2 is 81 mole g-catal. - h -1 , 2 times higher than CO yield rate over TiO 2 .Therefore, In-doped TiO 2 catalyst is efficient for the production of CH 4 and CO.The observed selectivity was 69 and 29, for CH 4 and CO, respectively.An appreciable amount of C 2 -C 3 Fig. 16.Schematic of plausible reaction mechanism for photocatalytic reduction of CO2 with H2O: photocatalytic CO2 reduction process: (a) oxidation and reduction process over In-doped TiO2, and (b) recombination and separation of charges. Fig. 17.Profile of Langmuir-Hinshelwood model for photocatalytic CO2 reduction over 10 wt. In-doped TiO2 catalyst. Cell parameters, crystallite sizes and EDX analysis of bare TiO2 and In-doped TiO2 samples. a Crystallite sizes calculated using Scherrer equation.b Surface elemental contents calculated using EDX. 16ary of physiochemical characteristics of TiO2 and In-doped TiO2 samples.In 3d 5/2 and In 3d 3/2 with BE region centered at 443.80 and 451.30eV, respectively, characteristics of In in metal state.The spectrum of O 1s shown in Fig.7(c), reveal two peaks centered at 528.30 and 531.20 eV.The BE value of 528.30 eV is assigned to the lattice oxygen O 2-bound to anatase Ti and is in agreement with the reported values16.The oxygen peak at around 531.20 eV are possibly due to the free hydroxyl group (OH -).The C 1s spectrum of all the carbon peaks is shown in Fig.7(d).The peak with binding energy located at 284.60 eV is assigned to elemental carbon (C C) while, the one at 586.64 eV corresponds to C O. The other peak at 282.30 eV is possibly due to substitution of oxygen by carbon in TiO 2 .The presence of carbon may be recognized as the carbon from carbon tap used for analysis of sample, since in EDX carbon containing compound was not observed. 25,26rease in the band gap energy was probably due to the higher In 2 O 3 band gap energy (E bg 3.7 eV)25,26.The shift in TiO 2 band gap energy toward ultraviolet regions has been reported in literatures for In-doped TiO 2 nanoparticles -1 h -1 ) a Yield rates calculated at 8 h irradiation basis, PCO 2 /PH 2 O 1.43 bars.Summary of operating parameters employed in cell type reactor.PCO 2 /PH 2 O 1.43 bars.hydrocarbons namely C 2 H 4 , C 2 H 6 , C 3 H 6 and C 3 H 8 are produced over In-doped TiO 2 catalyst.Significantly higher CH 4 production rate with appreciable amounts of hydrocarbons reveals efficient production of electrons and their utilizations during photocatalytic CO 2 reduction process over mesoporous In-doped TiO 2 nanoparticles. a a Yield rates calculated at 8 h irradiation basis, (kI KH 2 O K CO 2 ) P H 2 O P CO 2 (1 K H 2 O P H 2 O K CO 2 P CO 2 ) 2 The authors would like to extend their deepest appreciation to the Ministry of Higher Education (MOHE) and Universiti Teknologi Malaysia for financial support of this research under LRGS (Long-term Research Grant Scheme) (Vot 4L800), RUG (Research University Grant) (Vot 00H49) and FRGS (Fundamental Research Grant Scheme) (Vot 4F404).The authors are also thankful to School of Engineering, Monash University Sunway campus for UV-vis spectrophotometer characterization."
  }
]