[
  {
    "title": "Doi",
    "content": "10.1016/j.nanoen.2021.106809"
  },
  {
    "title": "Article_Title",
    "content": "Boosting photocatalytic CO2 reduction in a ZnS/ZnIn2S4 heterostructure through strain-induced direct Z-scheme and a mechanistic study of molecular CO2 interaction thereon"
  },
  {
    "title": "Abstract",
    "content": "Employing direct Z-scheme semiconductor heterostructures in photocatalysis offers efficient charge carrier separation and isolation of both redox reactions, thus beneficial to reduce CO 2 into solar fuels.Here, a ZnS/ ZnIn 2 S 4 heterostructure, comprising cubic ZnS nanocrystals on hexagonal ZnIn 2 S 4 (ZIS) nanosheets, is successfully fabricated in a single-pot hydrothermal approach.The composite ZnS/ZnIn 2 S 4 exhibits microstrain at its interface with an electric field favorable for Z-scheme.At an optimum ratio of Zn:In ( 1:0.5), an excellent photochemical quantum efficiency of around 0.8 is reached, nearly 200-fold boost compared with pristine ZnS.Electronic levels and band alignments are deduced from ultraviolet photoemission spectroscopy and UV-Vis.Evidence of the direct Z-scheme and carrier dynamics is verified by photo-reduction experiment, along with photoluminescence (PL) and time-resolved PL.Finally, diffuse-reflectance infrared Fourier transformed spectroscopy explores the CO 2 and related intermediate species adsorbed on the catalyst during the photocatalytic reaction.This microstrain-induced direct Z-scheme approach opens a new pathway for developing nextgeneration photocatalysts for CO 2 reduction."
  },
  {
    "title": "Experimental",
    "content": "Zinc nitrate hexahydrate (Zn(NO 3 ) 2 , 6H 2 O, thioacetamide (TAA), and high-purity (99.9) indium nitrate hydrate (In(NO 3 ) 3 xH 2 O were from Sigma; ethylene glycol (EG) was from ACROS chemicals.All chemicals and reagents were of analytical grade and used without further purification. The hydrothermal synthesis of ZnS used 0.5 mmol Zn(NO 3 ) 2 and 1.5 mmol TAA.They were dissolved in 60 ml mixed solvent of water and EG (1:1), under vigorous stirring, followed by 30 min sonication.The resulting homogeneous solution was transferred into a Teflon-lined stainless-steel autoclave, which was sealed and heated at 150 C for 12 h.After cooling to room temperature, and the resulting white ZnS powder was separated by centrifugation.It was then washed several times with distilled water and finally dried in a vacuum oven for 48 h at 60 C. A similar reaction scheme using 0.5 mmol Zn(NO 3 ) 2 , 1.0 mmol In (NO 3 ) 3 , and 4.5 mmol thioacetamide (TAA) gave ZnIn 2 S 4 (ZIS) as a yellow powder. In a similar ZIS hydrothermal procedure, nanocomposites of ZnS and ZIS were prepared by adding different molar ratios (1:0.1, 1:0.25, 1:0.5, and 1:1) of Zn(NO 3 ) 2 and In(NO 3 ) 3 to 4.5 mmol TAA at 150 C for 12 h.The products were denoted as ZnS/ZIS-1, ZnS/ZIS-2, ZnS/ZIS-3, and ZnS/ZIS-4, respectively. The continuous flow gas-phase photocatalytic CO 2 reduction experiment was performed at temperature around (40 5 C caused by incident photons of the solar simulator), in a laboratory-made stainlesssteel reactor (300 ml) covered with a quartz window.The as-prepared catalyst powder was uniformly dispersed on a quartz disk and placed inside the reactor.The reactor's quartz window was positioned vertically under a commercial solar simulator (AM1.5).To avoid gaseous contamination, the reactor was initially cleaned by standard degassing at 50 C under a nitrogen flow for 1 h.After cleaning, catalyst powder was placed inside the reactor and purged with N 2 gas for 1 h.It was then purged with CO 2 for a further 1 h at a constant flow rate (4 sccm).For the photocatalytic process to maintain the preferred humidity level, CO 2 gas was constantly purged through water.After 1 h of CO 2 purging, the solar simulator was turned on to initiate the photochemical reaction, while CO 2 molecules and the photocatalyst reached adsorption-desorption equilibrium.In continuous gas-phase photochemical reaction, the hydrocarbon products (solar fuels) were analyzed every 30 min by gas chromatography.Photocatalytic stability was tested by repeated testing of the same sample every 3 h for three cycles.The overall apparent quantum efficiency (AQE) and absorbed photon quantum efficiency (APQE) were calculated as follows by calculating the ratio of the number of reacted electrons to the number of incident photons and actually absorbed photons, respectively.Note that the thickness of the packed powder is around 250 m, which is much larger than the typical absorption depth of the material.The incident photons will be absorbed completely, if the photon wavelength is shorter than that of the bandgap of material. where and g are the wavelength of the light and band edge of the sample, respectively.The reduction of CO 2 to form methanol and acetaldehyde respectively involved 6 and 10 electrons: In a typical experiment, 10 mg ZnS/ZIS-3 was dispersed in 100 ml 0.5 wt Pt (H 2 PtCl 6 ) solution containing 10 vol methanol as a sacrificial agent.The suspension was irradiated with a 300 W halogen lamp for 2 h, and the reaction temperature was controlled using cooling water circulation outside the reaction vessel.Finally, the suspension was filtered, washed with deionized water three times, and dried in a vacuum oven for 24 h at 60 C. The dried ZnS/ZIS-3 catalyst was analyzed by TEM. The carrier transfer pathways were further examined by photodeposition of PbO 2 .In a typical experiment, 50 mg Pb(NO 3 ) 2 was dissolved in 30 ml DI water with stirring for 30 min.Then 10 mg ZnS/ZIS-3 was added into the solution and irradiated with a 300 W halogen lamp for 0.5 h.Finally, the obtained sample was washed and dried in a vacuum oven for further characterization by TEM. To determine the crystal structure, X-ray diffraction (XRD) patterns were collected using CuK radiation (Bruker, D2 PHASER with XFlash).The morphology and crystal phase of the samples were characterized using field emission scanning electron microscopy (FESEM, JEOL, 6700 F) and high-resolution transmission electron microscopy (HRTEM, JEOL-2100) with selected area electron diffraction (SAED).The elemental composition of all samples was investigated by high-angle annular dark-field (HAADF) imaging and energy-dispersive X-ray spectroscopy (EDX).Samples' ultraviolet-visible reflectance spectra (UV-vis) were measured with a Jasco V-670 spectrophotometer using an integrated sphere, and collected data was converted from reflection to absorbance using the Kubelka-Munk function.X-ray photoelectron spectroscopy (XPS) data were recorded using a PHI 5000 VersaProbe III spectrometer and a monochromatic Al K source (1486.6 eV) operated at 50 W under a vacuum of 10 -8 Pa in the analyzer chamber.Highresolution spectra of powdered samples were recorded at a takeoff angle of 45 with a constant pass energy of 93.9 eV using a 100-mdiameter analysis area.The XPS peak positions were calibrated with Au 3d peaks, and all XPS spectra were fitted by Gaussian-Lorentzian peak shape.Ultraviolet photoelectron spectroscopy (UPS) measurements were performed using Perkin-Elmer phi 5400 system under vacuum.Photoluminescence (PL) measurements were performed using a spectrofluorometer (Horiba Jobin Yvon FluoroMax-4).Time-resolved PL (TRPL) was measured using time-correlated single-photon counting (TCSPC).A pulsed laser with a wavelength of 260 nm, duration of fs, and repetition frequency of 20 MHz was used as the excitation source for the steady-state PL and TRPL studies.The Brunauer-Emmett-Teller (BET) surface area was obtained by recording nitrogen adsorption-desorption isotherms using a Micromeritics ASAP 2010 Accelerated Surface Area device.All samples were initially degassed at 373 K for 12 h under a 1 10 -2 mmHg vacuum by a Micromeritics Smart VacPrep degasser.CO 2 sorption measurements were conducted at 298 K while saturated pressure of CO 2 was 48,237 mmHg and the single point pore volume was recorded at P/Po 0.0186.The diffuse reflectance infrared Fourier transform spectroscopy (DRIFTS) study measured CO adsorption behavior using a Thermo Nicolet 6700 FTIR spectrometer equipped with a HgCdTe detector and a three-window DRIFTS cell.The DRIFTS study collected spectra with a spectral resolution of 4 cm -1 and a time resolution of 30 s.Before the measurements, catalyst samples were degassed at 298 K for 12 h under vacuum.For the DRIFT measurement, 4 mg catalyst was mixed with dry KBr to form a 200 mg composite (2 catalyst/KBr).Before collecting a background spectrum of the 2 catalyst composite, the sample in the DRIFT cell was purged by argon gas for 60 min to remove residual gas from the DRIFT cell; then CO 2 was purged into the DRIFT cell for 60 min during the measurement.GC analysis recorded the photocatalytic CO 2 reduction products using a GC-FID-CHINA CHROMATOGRAPHY 9800 system with a glass column (Porapak Q; 80-100 mesh) at an injection temperature of 120 C, FID temperature of 150 C, and oven temperature of 105 C. For confirmation about the source of hydrocarbon formation, the isotope-labeling experiment was performed by using 13 CO 2 .Note that the isotopelabeling experiments were conducted in a batch-type closed system, while the usual photocatalytic CO 2 reduction experiments were performed under continuous flow reactor.The products were analyzed using gas chromatography/mass spectrometry (GC-MS, Brand: Thermo, Model: Trace 1300 GC ISQ MS). The ZnS-ZIS (nanoparticle-nanosheet) heterostructures were synthesized in a typical single-step, controlled, hydrothermal process using excess Zn 2 with respect to In 3 ions in a reaction mixture of ethylene glycol (EG) and water (H 2 O).EG, containing hydroxyl groups, played a key role in controlling growth and providing protection during the hydrothermal process.In the hydrothermal reaction, hydrolysis of thioacetamide (TAA) provided S 2-ions under weakly acidic conditions.The Zn 2 and In 3 ions each adopted tetrahedral four-fold coordination with S 2-ions in the EG aqueous mixture of Zn(NO 3 ) 2 , 6 H 2 O, and In (NO 3 ) 3 xH 2 O.In the mixture of cations (Zn 2 /In 3 ), the more positively charged In 3 dominated the coordination structure formation, as doing so increased the entropy in the reaction medium.Moreover, the solubility product constant K sp of ZnS (2.93 10 -25 ) was much higher than that of In 2 S 3 (5.7 10 -74 ) 43.Therefore, tetrahedral (In-S 4 ) 2 and (Zn-S 4 ) 2 combined together and formed a stable hexagonal ZIS crystal.Although this is a single-step reaction, after the ternary stable ZIS nanosheets formed, the excess Zn 2 ions led to the single-step, hydrothermal formation of cubic ZnS nanoparticles, which then decorated the ZIS to form a 0D-2D (ZnS-ZIS) hybrid structure.The formation mechanism of this heterostructure is depicted in Fig. 1a.The ratio of Zn:In atoms in the composites was set as 1:0.1, 1:0.25, 1:0.5, and 1:1.The resulting composites were labeled ZnS/ZIS-1, ZnS/ZIS-2, ZnS/ZIS-3, and ZnS/ZIS-4, respectively.The inductively coupled plasma mass spectrometry (ICP-MS) was employed to measure the Zn:In ratios as 1:0.12, 1:0.26, 1:0.46, and 1:0.99, respectively (Supplementary Table S1).The complete processes for synthesizing ZnS, ZIS, and ZnS/ZIS are described in the Experimental Section. The crystallographic structure, composition, and optical properties Lattice mismatch in the composites generated due to heterostructuring of cubic ZnS and hexagonal ZIS induced structural strain at their interface.Supplementary Table S2 summarizes the crystallite sizes and micro-strains in ZnS, ZIS, the as prepared different composites, and the physical mixture of pristine ZnS and ZIS.Interestingly, the ZnS crystallites were smaller in the composites than in pristine ZnS.The corresponding microstrains based on the ZnS have been calculated from Rietveld analysis using TOPAS software 44.The microstrain values of ZnS/ZIS-1, ZnS/ZIS-2, ZnS/ZIS-3, and ZnS/ZIS-4 were significantly increased by 0.22, 0.62, 0.84, and 1.06 times, respectively, relative to that in pristine ZnS.The ZIS microstrain unchanged in the different composites with regard to the pristine ZIS.Microstrain analysis revealed that the interfaces of the composites were under tensile strains in comparison to pristine ZnS and different composites.The Strain at the ZnS-ZIS interface can be attributed to the lattice mismatch which could alter the interfacial electronic properties.The modified strain between ZnS and ZIS facilitated interfacial charge manipulation 45, which affected the photocatalysis of CO 2 reduction by improving the charge separation mechanism.The light-harvesting abilities of ZnS, ZnS/ZIS-3, and ZIS photocatalysts were characterized by UV-vis diffusive reflectance spectroscopy, as shown in Fig. 1c.The absorption edge of ZIS was around 520-550 nm, while that of ZnS was around 350 nm.As the amount of ZnS in the composites increased, the optical response blueshifted with respect to that of pristine ZIS.Supplementary Fig. S2a shows the absorption spectra of the four composites together with those of ZnS and ZIS.The composites' UV-vis spectra clearly showed a broad absorption edge over the entire visible region.Consequently, the color of ZIS changed from yellow to light yellow in the composites, suggesting that visible-light absorption was remarkably improved by the low percentage of ZIS in the composites.The Tauc plot in the inset of Fig. 1c shows approximate direct bandgaps of 3.51, 2.69, and 2.43 eV for ZnS, ZnS/ZIS-3, and ZIS respectively, indicating that the corresponding colors changed from white to light yellow and deep yellow.Notably, the UV-Vis spectrum shows a tail from 500 to 350 nm for ZnS.The exponential behavior of this tail as shown in Supplementary Fig. S2b implies the presence of defect states in the electronic structure as suggested by Urbach 46.Moreover, ZnS/ZIS-3 heterojunction illustrates broadened tail which is assigned to the presence of strain-induced mid-gap states. Fig. 2(a-c) displays the transmission electron microscopy (TEM) images of ZnS, ZIS, and ZnS/ZIS-3.Figs.2a and2b show the morphologies of the ZnS nanoparticles (particle sizes around 25-35 nm) and the ZIS nanosheets (lateral sheet dimensions around 40-50 nm).Fig. 2c shows that the ZnS/ZIS-3 composite was composed of homogeneously distributed ZnS nanoparticles on the ZIS nanosheets.Interestingly, the ZnS particles in the composite were a little smaller than the pristine ZnS particles.Nanosheets thickness of ZIS are typically around 1.5 nm (See Supplementary Fig. S3).Several reports clearly indicated that 2D materials with nano-range width are favorable for photogenerated carrier diffusion process 47.Therefore, we believe that the observed thickness of the ZIS nanosheet is favorable path for the photogenerated carriers' diffusion with improved charge separation from the Zn/ZIS interface.Insets showing the corresponding SAED patterns reveal the samples' polycrystalline nature, and the observed dominant diffraction planes match the corresponding XRD analysis results.The SAED pattern of the ZnS/ZIS-3 composite clearly shows the ring patterns of the (111), ( 220), (311), and (400) diffraction planes of ZnS and the (102) plane of ZIS.The HRTEM images in Figs.2d and2e show that ZnS/ZIS-3 had lattice spacings of around 0.33 and 0.31 nm, which respectively match the separations between the (102) lattice planes of hexagonal ZIS nanosheets and the (111) planes of cubic ZnS nanoparticles.The composite formed a heterojunction with an interlaced interface between the ZnS nanoparticles and ZIS nanosheets.Interestingly, we have observed in several HRTEM images that the angle between the normal vectors of the (111) plane of ZnS and (102) plane of ZIS is in the range of 70-74 as shown in Supplementary Fig. S4.So, we constructed a model of cubic ZnS and hexagonal ZIS lattices and rotated them with an angle of as described in Supplementary Fig. S5.We observed that the atoms in these lattices can be matched if 73.9 which is consistent with our observations.Moreover, the 73.9 and 16. 8 are not complementary angles (i.e. 90 ).It implies that there should be a distortion between the two crystals as shown in Fig. 2f and the FFT patterns in the Supplementary Fig. S5.Our model suggests that there are small mismatches between two lattices due to the interatomic distances and different crystal symmetries.Calculations display that 1 0.02 and 2 0.01.Crystal structure, at the ZnS-ZIS interface rearranges to compensate these non-zero lattice mismatches resulted in lattice mismatch strain as discussed in the previous section.This interfacial mismatch strain can induce mid-gap states 45,48,49 at the interface that facilitate electron from ZnS and hole in ZIS recombination forming a Z-scheme configuration. The HAADF-STEM image and EDX elemental maps of the ZnS/ZIS-3 composite in Fig. 2g show evenly distributed Zn, In, and S with an excess of Zn element related to the small nanoparticles over ZIS nanosheet as clearly seen in the STEM image.Supplementary Fig. S6(a,b) shows the STEM image and EDX spectrum with chemical composition for the ZnS/ ZIS-3 composite.The EDX elemental analysis supports the ICP-MS result. X-ray photoemission spectroscopy (XPS) determined the elemental compositions and chemical states of the samples.Supplementary Fig. S7 compares the XPS spectra for In 3d, Zn 2p, and S 2p of the as-prepared ZnS, ZIS, and ZnS/ZIS-3.The measured In 3 binding energies of the composite, corresponding to 3d 3/2 and 3d 5/2 , are 452.16 and 444.57eV respectively, which clearly show a blue shift to higher binding energies in comparison to In 3 binding energies of ZIS (444.38 and 451.97 eV).This observed shift might be due to the work function difference at the interface.The observed splitting in binding energy ( 7.6 eV) of the indium 3d peak to 3d 3/2 and 3d 5/2 reveals the characteristic of trivalent 3d states of indium.Zn 2p band of ZnS shows two components of the Zn 2p 1/2 and Zn 2p 3/2 at 1044.94 and 1021.94eV, typically indicating the Zn 2 oxidation state of Zn.The Zn 2p binding energy of ZIS shows down shift ( 0.35 eV) as compared to that of pristine ZnS due to the formation of the ternary ZIS phase.Notably, the Zn 2p XPS spectrum of ZnS/ ZIS-3 shows two de-convoluted peaks for Zn 2p 1/2 (1044.48/1042.64)and Zn 2p 3/2 (1021.48/1019.64)respectively, which can be attributed to the two components of ZnS and ZIS.It should also be mentioned that the peaks observed from the composite are shifted slightly downward in comparison to those of pristine ZnS and ZIS, suggesting interfacial charge transfer once a composite is formed.Furthermore, the composite's high-resolution S 2p core-level spectra shows two de-convoluted peaks at 162.66 and 161.51 eV corresponding to 2p 1/2 and 2p 3/2 .The detailed binding energies of Zn 2p, In 3d, and S 2p in ZnS, ZIS, and ZnS/ ZIS-3 are summarized in Supplementary Table S3.Interestingly, the ZnS/ZIS-3 composite shows little upshift in S 2p 1/2 and 2p 3/2 binding energies compared with pristine ZnS and ZIS.The broad peak reveals that S 2-was present as both ZnS and ZIS in the composite.Additionally, the chemical composition estimated from XPS (see Supplementary Fig. S8) in the ZnS/ZIS-3 composite is consistent with the results obtained from ICP-MS (Supplementary Table S1).We observed some sulfur deficiency in the composite catalyst, which could facilitate the key environment as active sites for CO 2 adsorption 50.Note that the composite's binding energy shift could be attributed to charge transfer at the heterojunction interface.Theoretically, an increasing electron concentration decreases the binding energy due to the promoted electron screening effect 51. The composites' photocatalytic activity was tested in photocatalytic CO 2 reduction experiments in the presence of water vapor under visible light.The resulting hydrocarbon products (mainly acetaldehyde with a very small amount of methanol) were detected by gas chromatography (GC) with flame ionization detection (FID).To verify the obtained hydrocarbon products and exclude the possibility of carbon contamination during photo irradiation, a control photocatalytic experiment was conducted without CO 2 under an inert atmosphere in presence of visiblelight irradiation as shown in Supplementary Table S4.In the control experiment using helium (He) as an inert gas instead of CO 2 , we observed that a negligible amount of CH 3 CHO appeared at the initial three hours but completely vanished thereafter.This observation might be attributed to a minute contaminant adsorbed or trapped on the photocatalyst surface during the experimental procedure.Although in oxide-based photocatalysts several ways have been reported to avoid this kind of background products, however, the sulfide materials hardly undergo any cleaning process because of their possible degradation upon exposure to excessive heating.Therefore, to exclude the contamination effect, we subtracted the background amount of CH 3 CHO from the observed amount to ensure the accuracy of reported values.Fig. 3a compares the fuel formation yields of ZnS, ZIS, and ZIS/ZIS composites. Pristine ZnS generated very little acetaldehyde (around 1.47 mol g -1 ), indicating that it alone is not an active visible-light photocatalyst because of its wide band-gap.However, pure ZIS showed moderate photocatalytic CO 2 reduction ability, forming 55.85 mol g -1 acetaldehyde and 0.94 mol g -1 methanol.It showed a high absorption coefficient under visible light, but due to poor charge separation and carrier transport, it did not achieve high photocatalytic activity.Interestingly, acetaldehyde yield gradually increased as the composites' content of ZIS increased up to 25 wt, and ZnS/ZIS-3 exhibited the highest production of both acetaldehyde and methanol (367.63, and 1.37 mol g -1 , respectively; representing 99.6 selectivity towards acetaldehyde), achieving nearly 7 times that of pristine ZIS.However, further increasing the ZIS content decreased yield, likely because excessive ZIS disrupted the charge balance between ZnS and ZIS in the composite.Note that at low ZIS contents (5 and 12.5 wt) the composites formed acetaldehyde exclusively; methanol emerged only at higher ZIS contents.Fig. 3b plots the acetaldehyde formation rates for ZnS/ZIS-3.It peaked at around 1.5 h, and then remained stable up to 4.5 h, after which it dropped slightly, possibly owing to adsorption of acetaldehyde on the catalyst's surface.In addition to the catalytic behavior of the as-prepared heterostructure photocatalysts, we have performed photocatalytic CO 2 reduction for a physically mixed pristine ZnS with pristine ZIS as a model of the strain-free sample.The observed catalytic activity was found to be 24 times lower than that of ZnS/ZIS-3, providing strong evidence for the role of strain between the two heterostructure on enhancing the photocatalytic activity. To examine the stability of ZnS/ZIS-3, we performed six sets of consecutive photocatalytic CO 2 reduction cycles for 3 h each.After each reaction cycle, the reactor was cleaned and the catalyst degassed.The results in Fig. 3b (inset) reveal that the composite maintained its catalytic activity with a minute deterioration after 4th cycle due to that metal sulfide commonly shows photocorrosive behavior.The calculated solar fuel photochemical quantum efficiency for the composite was around AQE overall 0.8 under 1 sun.However, if we considered the photon absorbed by the material, which is around I( g )/I(overall) 13.3 based on the band gap g 461 nm, the calculated APQE 6.0.To understand more about catalytic evolution, we have conducted the photocatalytic activity at different light intensities of 0.3, 0.5, 0.75, 1, 1.2 Sun as shown in Supplementary Fig. S9.The linear behavior up to 1 sun can be explained as the electron/holes generation is ratedetermining step 52,53.In contrast, it shows that the CO 2 reduction reaction is the rate-determining step above 1 sun. Finally, to verify the origin of the hydrocarbon formation in the photocatalytic CO 2 reduction, we have performed an isotope labeling experiment using 13 CO 2 and confirmed the obtained results by GC-MS analysis as shown in Supplementary Fig. S10.It revealed that the reaction products to be 13 CH 3 13 CHO (m/z 46, 45, 30 and 16), and 13 CH 3 OH (m/z 33, 30, and 16), confirming that acetaldehyde and methanol were produced from the photocatalytic reduction of 13 CO 2 (m/ z 45) in addition to 12 CO 2 (m/z 44) peaks in the qualitative analysis due to the aforementioned possible reasons of contamination from batch type reactor which is hardly avoided.Additionally, we have performed GC-MS for qualitative detection of the oxidative products from the photocatalytic CO 2 reduction as shown in Supplementary Fig. S11.The observed peak at (m/z 32 after subtracting the value of air oxygen from the blank test measurement) correspond to O 2 evolution as a product confirming that the water oxidation reaction occurred during CO 2 photoreduction.54. A photocatalyst's electronic structure and energy levels such as work function, Fermi energy, valance band maximum (VBM), and conduction band minimum (CBM) are important characteristics for charge carrier generation and separation.Therefore, we studied the energy band alignments and electronic states of ZnS and ZIS in the ZnS/ZIS-3 heterostructure by combined ultraviolet photoemission spectroscopy (UPS) and UV-vis spectroscopy, as shown in Supplementary Fig. S12(a-c).The work functions and VBMs were calculated using the higher and lower binding energies of the UPS spectra.The complete electronic levels and energies are summarized in Supplementary Table S5.Supplementary Fig. S12d shows electronic band diagrams derived from these data.For additional confirmation of improved charge transfer and band alignment, electrochemical impedance study and Mott-Schottky analysis were performed for ZnS, ZIS and ZnS/ZIS-3, as shown in Supplementary Fig. S13. Figure S13a shows the Nyquist plots for the ZnS, ZIS, and ZnS/ ZIS-3 on FTO electrodes at an applied potential of 0 V (vs Ag/AgCl) with an amplitude of 10 mV and a frequency ranging from 20 kHz to 20 Hz in 0.5 M Na 2 SO 4 .We found that the charge transfer resistance (R ct ) of ZnS/ ZIS-3 heterostructure is lower than that of pristine ZnS and ZIS, suggesting an improved carrier transport characteristic in heterostructure.Supplementary Fig. S13 b shows the Mott-Schottky curve of the as prepared samples, all depicting an n-type behavior with a positive slope for C -2 versus V.The fitted lines showed the flat-band potentials of ZnS, ZIS, and ZnS/ZIS-3 to be -0.09,0.00, and -0.03 V (vs.NHE), respectively.The observed flat-band potential of ZIS is larger than that of ZnS, which is well matched with the observed UPS results.The composite's CBM and VBM cover the reduction potential of CO 2 and the oxidation potential of water.Note that both flat-band potentials of both ZnS and ZIS are near the CBM, suggesting n-type characteristics.The composite has a direct band gap of 2.69 eV, and its CBM and VBM are between the individual band structures of ZnS and ZIS.It is worth noting that when ZnS and ZIS are in contact with a staggered heterostructure and work function difference is the prerequisite for inducing charge redistribution and the formation of an internal electric field, the charge transfer should follow the Z-scheme mechanism according to previous reports 555657.To further confirm the direct Z scheme heterostructure mechanism, a metal nanoparticle photodeposition experiment has been conducted 58.The reaction involved using light irradiation to induce the reduction of Pt 4 from aqueous hexachloroplatinic acid (H 2 PtCl 6 ) to Pt 0 , which then deposited as nanoparticles on the composite's surface 59.The HRTEM image of the composite after Pt photodeposition experiment Supplementary Fig. S14 a show different lattice spacings of around 2.6, 3.1, and 3.3 A, which match the lattice fringes of Pt (111), ZnS (111), and ZIS (311), respectively.The lattice fringes of Pt, ZIS, and ZnS reveal that the Pt nanoparticles deposited on the ZIS sheets rather than the ZnS particles, indicating that the reduction occurred at the ZIS conduction band.For additional confirmation, we have conducted another photodeposition experiment, in which the PbO 2 nanoparticles were deposited on the catalyst surface via photo-oxidation process as shown in Supplementary Fig. S14 b.HRTEM image of the ZnS/ZIS-3 composite after PbO 2 nanoparticles deposition shows different d-spacings of around 3.4, 3.1, and 3.3 A, which are well-matched with the lattice fringes of PbO 2 (110), ZnS (111), and ZIS (102), respectively.The lattice fringes of PbO 2 , ZIS, and ZnS reveal that the PbO 2 nanoparticles deposited on the highly hole-rich ZnS surface.Therefore, photo-excited electrons in the conduction band of ZnS transfer to the ZIS valence band, driven by the potential drop at the interface.This favorable inter-structural carrier recombination suggests that the CBM of ZIS and the VBM of ZnS facilitate reduction and oxidation with excess electrons and holes. X-ray crystallography of ZnS/ZIS-3 identified induced crystal strain due to the reduced size of crystal and lattice mismatch between ZnS and ZIS crystals (Supplementary Table S2), and the difference between the constituent components is favorable for interfacial electron transfer from ZnS to ZIS.Overall, the photocatalytic CO 2 reduction mechanism of ZnS/ZIS-3 has been confirmed to be a direct Z-scheme heterostructure, as shown in Fig. 4(a,b).During photocatalysis, the composite's ZnS and ZIS are excited by visible light to generate charge carriers (electrons and holes).Photogenerated electrons on the conduction band of ZnS recombine with holes near the valence band maxima (VBM) of ZIS, drastically reducing the photogenerated charge carrier recombination within the constituent component.Therefore, the CBM of ZIS is enriched with photogenerated electrons for CO 2 reduction, while the holes remaining on the ZnS valence band are involved in water oxidation and possible oxidation of intermediates resulting during hydrocarbon formation.We assume that these synergistic effects significantly improve the composite's photocatalytic efficiency.The major photochemical reaction steps in the Z scheme process under visible-light irradiation are summarized in the following reactions. ZnS(e - h )/ZIS(e - h ) (Charge carrier generation) ZnS(e - h )/ZIS(e - h ) Z-scheme ZnS(h )/ZIS(e -) (Charge carrier separation) To understand the electronic properties and to unravel the dynamics of photo-excited electrons in the composite, we carried out photoluminescence (PL) and time-resolved PL (TRPL) measurements.The PL spectra in Fig. 4c show two characteristic peaks around 460 and 600 nm corresponding to ZnS and ZIS emissions, respectively.Compared with those of the individual ZnS and ZIS samples, the PL intensity of both peaks decreased in the ZnS/ZIS-3 composite after heterostructure coupling, indicating that radiative recombination was suppressed due to enhanced charge separation between the two semiconductors.The measured TRPL spectra (Supplementary Fig. S15) showed emissions at 590 and 460 nm corresponding to the lifetimes of photogenerated electron-hole pairs for ZIS, ZnS, and ZnS/ZIS-3.The fast decay time 1 and slow decay time 2 were calculated by biexponential fitting the emission decay data, and are summarized in the inset of Supplementary Fig. S15.The observed lifetime of ZnS/ZIS-3 is less than that of ZIS and ZnS at 590 and 460 nm, indicating the emergence of a nonradiative pathway or the delocalization of electrons at the interface between ZIS and ZnS.Therefore, it demonstrates effective charge carrier separation that allows the heterostructure to enhance photoreduction. Additionally, to support the proposed photocatalytic CO 2 reduction, we measured several on-off transient photocurrent response cycles of pristine ZnS, ZIS, and ZnS/ZIS-3 under visible light (AM1.5)illumination.Fig. 4d compares photocurrent (I) with respect to time (t) during several on-off cycles at a potential of 0 V (vs Ag/AgCl), and clearly shows that the photocurrent reaches an equilibrium value as the light is turned on, and eventually decreases to zero as the light is turned off.The observed photocurrents for ZnS were around 5 times and 60 times lower than those of ZIS and ZnS/ZIS-3, respectively, indicating lower absorption of visible light due to ZnS having a wide-band gap.Conversely, the enhanced photocurrent response of ZnS/ZIS-3 indicated a lower recombination rate and more efficient separation of photogenerated charge carriers (electrons and holes). To understand the physical adsorption behavior of gas molecules on a solid catalyst surface, we performed surface area measurements based on Brunauer-Emmett-Teller (BET) theory and CO 2 adsorption analysis.Fig. 5a shows N 2 adsorption-desorption isotherms for ZnS, ZIS, and ZnS/ZIS-3.ZnS possesses a type II isotherm associated with H3 Fig. 5. Surface area and CO 2 adsorption analyses.(a) BET specific surface area measurements and (b) CO 2 adsorption measurements at 25 C and 1 atm for ZnS, ZIS, and ZnS/ZIS-3.(c-e) In-situ DRIFTS spectra of ZnS/ZIS-3 after purging with CO 2 in the presence of residual water, after stopping purging and before light irradiation, and after light irradiation for 60 min (Spectra were collected every 10 min after the sample in the DRIFTS cell was purged by argon gas for 60 min).hysteresis loop however, ZIS shows the type IV(a) physisorption isotherm curve associated with H2 hysteresis loop, revealing significant adsorption on the surface of mesoporous layer structure.Additionally, in ZnS/ZIS-3 composite when ZnS nanoparticles decorated the ZIS nanosheets, we observed type II isotherm associated with H3 hysteresis loop.This porous surface feature of the as-prepared catalyst was further analyzed using the corresponding pore size distribution curve in Supplementary Fig. S16, which indicated a broad range of pore sizes from micropores to mesopores.The measured specific BET surface areas of the ZnS, ZIS, and ZnS/ZIS-3 were 34.6, 184.7, and 158 m 2 g -1 , respectively.The lower specific surface area of ZnS/ZIS-3 in comparison to ZIS was attributed to the formation of ZnS nanoparticles on the ZIS layers during the synthesis of the composite, which decreased the specific surface area.A heterostructure photocatalyst with a large specific surface area offers many active sites and facilitates photogenerated carrier transport for redox reactions, making it favorable for enhanced photocatalytic performance 60.The BET surface area of our hydrothermally prepared ZIS can be considered high compared with other reported template-free ZIS samples 61,62.To understand the CO 2 adsorption behavior on the solid photocatalyst surface, we performed CO 2 adsorption at room temperature (25 C; Fig. 5b), which revealed that ZnS/ZIS-3 adsorbed around 1.7 times as much CO 2 as pristine ZnS, suggesting that the layer structure ZIS possesses a higher affinity than ZnS for physically adsorbing CO 2 .The overall adsorption results are comparable to the BET surface area analysis; therefore, ZIS appears to offer more active sites than ZnS in the ZnS/ZIS-3 heterostructure and different surface energies for CO 2 adsorption.Overall, the photocatalytic reduction of CO 2 should occur on the ZIS surface due to the better affinity, further validating the proposed direct Z-scheme for CO 2 reduction on the ZnS/ZIS-3 heterostructure. In order to understand the reaction mechanism and explore the interaction of CO 2 with catalyst active sites, we monitored the evolution of surface species during catalytic reaction using in-situ diffuse reflectance infrared (IR) Fourier transformed (FT) spectroscopy (DRIFTS) as shown in Fig. 5(c-e).This was performed in a specific reaction chamber enhanced with a DRIFTS accessory, as previously reported 63.Supplementary Fig. S17 shows the in-situ FT-IR spectra for ZnS, ZIS, and ZnS/ZIS-3 after purging with CO 2 for 60 min in the presence of residual water.The background spectrum was collected after placing the sample in the DRIFTS cell and purging with argon gas for 60 min.The observed FTIR peaks in the range of 1264-1660 cm -1 are mainly associated with hydrated CO 2 speciation, including chemisorbed CO 2 (CO 2 e - CO 2 -, at around 1260 and 1660 cm -1 ) 64, bicarbonate (HCO 3 -at around 1430-1440 cm -1 ), and bidentate carbonate (CO 3 2-at around 1300-1324 cm -1 ) 656667.We observed that the peak intensity for hydrated CO 2 speciation obtained in pristine ZnS during CO 2 adsorption was much less than those for ZIS and ZnS/ZIS-3.Moreover, the composite showed clear peaks at 1260, 1324, and 1440 cm -1 , indicating adsorbed CO 2 -, bidentate carbonate, and bicarbonate species, respectively.In contrast to ZIS and ZnS/ZIS-3, ZnS showed very weak adsorption of CO 2 .These observations suggest that the indium element provides favorable surface energy for CO 2 adsorption and is the origin of active sites for CO 2 activation on the catalyst surface.To understand the role of H 2 O in CO 2 adsorption and overall photocatalytic reaction, we monitored in-situ FT-IR spectra during DRIFTS study for ZnS/ZIS-3 after purging with CO 2 for 60 min in the presence and absence of residual water as shown in Supplementary Fig. S18a.The observed enhancement of the FTIR peaks clearly indicates that the water molecule played a crucial role to facilitate the adsorptivity of CO 2 on the catalyst surface.Beside this enhancement of the adsorptivity of CO 2 on the catalyst surface, the observed photocatalytic performance in Supplementary Fig. S18b also reflects the importance of water on the catalytic performance.Therefore, it clearly proved the proton-assisted photocatalysis in presence of water as a proton source.More details of CO 2 adsorption and conversion in the presence of light on the surface of ZnS/ZIS-3, came from in-situ time-dependent DRIFTS analysis.Fig. 5(c andd) shows changing peak intensity for the adsorbed species after purging with CO 2 with residual water, after reaching equilibrium, and after light irradiation.The FTIR peaks in the range of 1000-1660 cm -1 increased as hydrated CO 2 purging time increased.Thereafter, to reach adsorption equilibrium, we ceased purging with hydrated CO 2 .All peaks were clearly observed after 60 min, although the peak intensities slightly decreased (Fig. 5d), indicating that the adsorbed species (CO 2 -, HCO 3 -, and CO 3 2-) were chemically adsorbed at the catalyst's surface-active sites.After 1 h of visible light irradiation, the peak intensities of the adsorbed species drastically decreased, and new peaks were detected at different positions, revealing the formation of intermediate surface species during photocatalytic CO 2 conversion.Specifically, the pair of peaks at and 1058 cm -1 and the individual peaks at 1128, and 1224 cm -1 were assigned to bidentate H 3 CO 68,69, monodentate H 3 CO 69, and HCOO 64 intermediate species, respectively.Among these, monodentate H 3 CO showed the lowest peak intensity.There was no carbon monoxide peak at 1879 cm -1 .We expect that the dioxycarbon anion, HCOO , and CH 3 O species observed during light-illuminated, in-situ, DRIFT analysis were likely intermediates of the photoreduction of CO to hydrocarbons.The peak position of all CO 2 species and related intermediates from DRIFTS are supported by the literature and summarized in Supplementary Table S6.The DRIFTS analysis suggests that the photocatalyst surface adsorbed CO 2 -species together with bending H 2 O -, converted them into HCOO intermediate, and progressively formed mono-dentate and bi-dentate H 3 CO .The bi-dentate and mono-dentate H 3 CO intermediates favorably formed C2 acetaldehyde and C1 methanol as major and minor products, respectively.The low concentration of methanol was due to its side reaction at holes on the catalyst's surface that formed formate ions, which could be an intermediate for additional acetaldehyde formation.The overall formation mechanism for photocatalytic CO 2 reduction is illustrated in Scheme 1. The direct Z-scheme ZnS/ZIS-3 heterostructure photocatalyst showed nearly 200-and 7-times higher gas-phase CO 2 reduction activity than pristine ZnS and ZIS, respectively, under visible light.This was due to the improved separation of photogenerated charge carriers.Microstrain at the interface between its ZnS and ZIS components induced electron transfer from the ZnS conduction band to the ZIS valance band, thus promoting their surfaces for selective redox processes, while the composite's indium active sites enhanced photochemical CO 2 reduction to acetaldehyde as a major hydrocarbon product via bi-dentate H 3 CO reactive intermediates.The role of water in CO 2 adsorption on the catalyst surface and overall photocatalytic activity has been illustrated and confirmed by the in-situ DRIFTS study.This study offers a Scheme 1. Mechanistic reaction pathway of hydrocarbon formation.Photocatalytic reaction pathway for acetaldehyde and methanol formation over ZnS/ ZIS-3 composite catalyst. AQE overall Mole of electron to convert hydrocarbons(HC)fuels Photons incident onto catalyst Number of electrons x Number of HC molecuels Number of photons incident onto catalyst x Area And, of the prepared photocatalysts were characterized by X-ray diffraction (XRD) and UV-vis spectroscopy.The powder XRD patterns of the synthesized ZnS, ZIS, and ZnS/ZIS-3 composite samples are shown in Fig. 1b.The pristine ZnS indicates a cubic crystal phase, with characteristic diffraction peaks at 2 28.56 , 33.10 , 47.50 , 56.37 , 59.18 , and 69.52 respectively assigned to the (111), (200), (220), (311), (222), and (400) planes of cubic ZnS (JCPDS-01-065-9585).The diffraction pattern of pristine ZIS matched the (006), (102), (104), (108), (110), (116), and (022) planes of the hexagonal structure of ZnIn 2 S 4 (JCPDS-03-065-2023)34.The main peaks of the composite ZnS/ZIS-3 were broadened, notably, (111), (220) and (311) peaks of cubic ZnS, along with (102) and (110) peaks of hexagonal ZIS.The (111) peak broadening with decreasing intensity in the composite was attributed to the formation of smaller ZnS nanoparticles.Supplementary Fig.S1shows XRD patterns of all ZnS/ZIS heterostructure samples (1-4) together with those of ZnS and ZIS and the physical mixture of the pristine ZnS and pristine ZIS, as strain-free sample.All composites showed the cubic structure of ZnS.Composite ZnS/ZIS-1 showed no noticeable ZIS diffraction peak due to the low amount and relatively low diffraction intensity of ZIS.As the concentration of ZIS increased due to the increased In content, short and broad diffraction peaks assigned to hexagonal ZIS became increasingly prominent around 2 28.5 and 47.5 .However, apart from the peak broadening, no specific peak shift was observed, confirming the coexistence of ZnS and ZIS in the heterostructure composite.The narrow and sharp (111) diffraction peak of ZnS in the samples with high Zn contents indicated higher crystallinity, which was attributed to the formation of larger ZnS particles. Fig. 1.Formation mechanism, crystal structure, and optical properties of (0D-2D) ZnS-ZIS composite.(a) Formation process.(b) XRD patterns and (c) UV-vis diffuse reflectance spectra and (inset) Tauc plots with direct fitting for cubic ZnS, hexagonal ZIS, and ZnS/ZIS-3 composite. Fig. 2. Morphology and structure of ZnS/ZIS-3.TEM images of (a) ZnS nanoparticles (0D), (b) ZIS nanosheets (2D), and (c) ZnS/ZIS-3 nanoparticle-nanosheet (0D-2D) composite.Insets show respective SAED patterns.scale bars are 50 nm.(d) HR-TEM image of the composite interface.(e) Magnification of the lattice fringes of the ZnS (111) and ZIS (102) at the interface.(f) inset of d shows the relative intensity of atoms of ZnS in (111) plane (g) HAADF-STEM image and EDX elemental mapping of S, Zn, and In from the selected area of the composite. Fig. 3. Photocatalytic CO 2 reduction activity.(a) Total yield after 6 h for ZnS, ZIS, and ZnS/ZIS composites under visible light.(b) Acetaldehyde formation rate; inset shows the stability test of ZnS/ZIS-3. Fig. 4. Electronic band diagram and charge carrier mechanism.(a) Schematic illustration of lattice mismatch and strain effect between cubic ZnS and hexagonal ZIS phases in ZnS/ZIS-3.(b) Direct Z-scheme of ZnS/ZIS (n-n ) heterojunction in ZnS/ZIS-3.(c) Photoluminescence spectra (laser 260 nm) and (d) comparative transient on-off photocurrent responses at 0 V (vs Ag/AgCl) of ZnS, ZIS, and ZnS/ZIS-3 in aqueous 0.5 M Na 2 SO 4 under AM1.5 visible light illumination. This study was financially supported by the Ministry of Science and Technology (MOST) in Taiwan under the Academic Summit Project (107-2745-M-002-001-ASP) and the Science Vanguard Project (108-2119-M-002-030 and 109-2123-M-002-004), and MOST (106-2112-M-008-003-MY3).Financial support provided by the i-MATE program (AS-iMATE-108-31) and Sustainability Science Project (AS-SS-106-02-3) of Academia Sinica, the Center of Atomic Initiative for New Materials (AI-Mat), National Taiwan University (108L9008 and 109 L9008), and the Featured Areas Research Center Program within the framework of the Higher Education Sprout Project by the Ministry of Education (MOE) in Taiwan is also acknowledged.Technical support from Nano-Core, the Core Facilities for Nanoscience and Nanotechnology at Academia Sinica in Taiwan, is acknowledged.I.S thanks the Science and Engineering Research Board (SERB) core research grant (CRG/2021/003355), New Delhi, India for financial support. novel and effective strategy to construct a Z-scheme heterojunction in a high-efficiency catalyst for photocatalytic CO 2 reduction in the gas phase. The authors declare no competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data associated with this article can be found in the online version at doi:10.1016/j.nanoen.2021.106809."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The ZnS-ZIS (nanoparticle-nanosheet) heterostructures were synthesized in a typical single-step, controlled, hydrothermal process using excess Zn 2 with respect to In 3 ions in a reaction mixture of ethylene glycol (EG) and water (H 2 O).EG, containing hydroxyl groups, played a key role in controlling growth and providing protection during the hydrothermal process.In the hydrothermal reaction, hydrolysis of thioacetamide (TAA) provided S 2-ions under weakly acidic conditions.The Zn 2 and In 3 ions each adopted tetrahedral four-fold coordination with S 2-ions in the EG aqueous mixture of Zn(NO 3 ) 2 , 6 H 2 O, and In (NO 3 ) 3 xH 2 O.In the mixture of cations (Zn 2 /In 3 ), the more positively charged In 3 dominated the coordination structure formation, as doing so increased the entropy in the reaction medium.Moreover, the solubility product constant K sp of ZnS (2.93 10 -25 ) was much higher than that of In 2 S 3 (5.7 10 -74 ) 43.Therefore, tetrahedral (In-S 4 ) 2 and (Zn-S 4 ) 2 combined together and formed a stable hexagonal ZIS crystal.Although this is a single-step reaction, after the ternary stable ZIS nanosheets formed, the excess Zn 2 ions led to the single-step, hydrothermal formation of cubic ZnS nanoparticles, which then decorated the ZIS to form a 0D-2D (ZnS-ZIS) hybrid structure.The formation mechanism of this heterostructure is depicted in Fig. 1a.The ratio of Zn:In atoms in the composites was set as 1:0.1, 1:0.25, 1:0.5, and 1:1.The resulting composites were labeled ZnS/ZIS-1, ZnS/ZIS-2, ZnS/ZIS-3, and ZnS/ZIS-4, respectively.The inductively coupled plasma mass spectrometry (ICP-MS) was employed to measure the Zn:In ratios as 1:0.12, 1:0.26, 1:0.46, and 1:0.99, respectively (Supplementary Table S1).The complete processes for synthesizing ZnS, ZIS, and ZnS/ZIS are described in the Experimental Section. The crystallographic structure, composition, and optical properties Lattice mismatch in the composites generated due to heterostructuring of cubic ZnS and hexagonal ZIS induced structural strain at their interface.Supplementary Table S2 summarizes the crystallite sizes and micro-strains in ZnS, ZIS, the as prepared different composites, and the physical mixture of pristine ZnS and ZIS.Interestingly, the ZnS crystallites were smaller in the composites than in pristine ZnS.The corresponding microstrains based on the ZnS have been calculated from Rietveld analysis using TOPAS software 44.The microstrain values of ZnS/ZIS-1, ZnS/ZIS-2, ZnS/ZIS-3, and ZnS/ZIS-4 were significantly increased by 0.22, 0.62, 0.84, and 1.06 times, respectively, relative to that in pristine ZnS.The ZIS microstrain unchanged in the different composites with regard to the pristine ZIS.Microstrain analysis revealed that the interfaces of the composites were under tensile strains in comparison to pristine ZnS and different composites.The Strain at the ZnS-ZIS interface can be attributed to the lattice mismatch which could alter the interfacial electronic properties.The modified strain between ZnS and ZIS facilitated interfacial charge manipulation 45, which affected the photocatalysis of CO 2 reduction by improving the charge separation mechanism.The light-harvesting abilities of ZnS, ZnS/ZIS-3, and ZIS photocatalysts were characterized by UV-vis diffusive reflectance spectroscopy, as shown in Fig. 1c.The absorption edge of ZIS was around 520-550 nm, while that of ZnS was around 350 nm.As the amount of ZnS in the composites increased, the optical response blueshifted with respect to that of pristine ZIS.Supplementary Fig. S2a shows the absorption spectra of the four composites together with those of ZnS and ZIS.The composites' UV-vis spectra clearly showed a broad absorption edge over the entire visible region.Consequently, the color of ZIS changed from yellow to light yellow in the composites, suggesting that visible-light absorption was remarkably improved by the low percentage of ZIS in the composites.The Tauc plot in the inset of Fig. 1c shows approximate direct bandgaps of 3.51, 2.69, and 2.43 eV for ZnS, ZnS/ZIS-3, and ZIS respectively, indicating that the corresponding colors changed from white to light yellow and deep yellow.Notably, the UV-Vis spectrum shows a tail from 500 to 350 nm for ZnS.The exponential behavior of this tail as shown in Supplementary Fig. S2b implies the presence of defect states in the electronic structure as suggested by Urbach 46.Moreover, ZnS/ZIS-3 heterojunction illustrates broadened tail which is assigned to the presence of strain-induced mid-gap states. Fig. 2(a-c) displays the transmission electron microscopy (TEM) images of ZnS, ZIS, and ZnS/ZIS-3.Figs.2a and2b show the morphologies of the ZnS nanoparticles (particle sizes around 25-35 nm) and the ZIS nanosheets (lateral sheet dimensions around 40-50 nm).Fig. 2c shows that the ZnS/ZIS-3 composite was composed of homogeneously distributed ZnS nanoparticles on the ZIS nanosheets.Interestingly, the ZnS particles in the composite were a little smaller than the pristine ZnS particles.Nanosheets thickness of ZIS are typically around 1.5 nm (See Supplementary Fig. S3).Several reports clearly indicated that 2D materials with nano-range width are favorable for photogenerated carrier diffusion process 47.Therefore, we believe that the observed thickness of the ZIS nanosheet is favorable path for the photogenerated carriers' diffusion with improved charge separation from the Zn/ZIS interface.Insets showing the corresponding SAED patterns reveal the samples' polycrystalline nature, and the observed dominant diffraction planes match the corresponding XRD analysis results.The SAED pattern of the ZnS/ZIS-3 composite clearly shows the ring patterns of the (111), ( 220), (311), and (400) diffraction planes of ZnS and the (102) plane of ZIS.The HRTEM images in Figs.2d and2e show that ZnS/ZIS-3 had lattice spacings of around 0.33 and 0.31 nm, which respectively match the separations between the (102) lattice planes of hexagonal ZIS nanosheets and the (111) planes of cubic ZnS nanoparticles.The composite formed a heterojunction with an interlaced interface between the ZnS nanoparticles and ZIS nanosheets.Interestingly, we have observed in several HRTEM images that the angle between the normal vectors of the (111) plane of ZnS and (102) plane of ZIS is in the range of 70-74 as shown in Supplementary Fig. S4.So, we constructed a model of cubic ZnS and hexagonal ZIS lattices and rotated them with an angle of as described in Supplementary Fig. S5.We observed that the atoms in these lattices can be matched if 73.9 which is consistent with our observations.Moreover, the 73.9 and 16. 8 are not complementary angles (i.e. 90 ).It implies that there should be a distortion between the two crystals as shown in Fig. 2f and the FFT patterns in the Supplementary Fig. S5.Our model suggests that there are small mismatches between two lattices due to the interatomic distances and different crystal symmetries.Calculations display that 1 0.02 and 2 0.01.Crystal structure, at the ZnS-ZIS interface rearranges to compensate these non-zero lattice mismatches resulted in lattice mismatch strain as discussed in the previous section.This interfacial mismatch strain can induce mid-gap states 45,48,49 at the interface that facilitate electron from ZnS and hole in ZIS recombination forming a Z-scheme configuration. The HAADF-STEM image and EDX elemental maps of the ZnS/ZIS-3 composite in Fig. 2g show evenly distributed Zn, In, and S with an excess of Zn element related to the small nanoparticles over ZIS nanosheet as clearly seen in the STEM image.Supplementary Fig. S6(a,b) shows the STEM image and EDX spectrum with chemical composition for the ZnS/ ZIS-3 composite.The EDX elemental analysis supports the ICP-MS result. X-ray photoemission spectroscopy (XPS) determined the elemental compositions and chemical states of the samples.Supplementary Fig. S7 compares the XPS spectra for In 3d, Zn 2p, and S 2p of the as-prepared ZnS, ZIS, and ZnS/ZIS-3.The measured In 3 binding energies of the composite, corresponding to 3d 3/2 and 3d 5/2 , are 452.16 and 444.57eV respectively, which clearly show a blue shift to higher binding energies in comparison to In 3 binding energies of ZIS (444.38 and 451.97 eV).This observed shift might be due to the work function difference at the interface.The observed splitting in binding energy ( 7.6 eV) of the indium 3d peak to 3d 3/2 and 3d 5/2 reveals the characteristic of trivalent 3d states of indium.Zn 2p band of ZnS shows two components of the Zn 2p 1/2 and Zn 2p 3/2 at 1044.94 and 1021.94eV, typically indicating the Zn 2 oxidation state of Zn.The Zn 2p binding energy of ZIS shows down shift ( 0.35 eV) as compared to that of pristine ZnS due to the formation of the ternary ZIS phase.Notably, the Zn 2p XPS spectrum of ZnS/ ZIS-3 shows two de-convoluted peaks for Zn 2p 1/2 (1044.48/1042.64)and Zn 2p 3/2 (1021.48/1019.64)respectively, which can be attributed to the two components of ZnS and ZIS.It should also be mentioned that the peaks observed from the composite are shifted slightly downward in comparison to those of pristine ZnS and ZIS, suggesting interfacial charge transfer once a composite is formed.Furthermore, the composite's high-resolution S 2p core-level spectra shows two de-convoluted peaks at 162.66 and 161.51 eV corresponding to 2p 1/2 and 2p 3/2 .The detailed binding energies of Zn 2p, In 3d, and S 2p in ZnS, ZIS, and ZnS/ ZIS-3 are summarized in Supplementary Table S3.Interestingly, the ZnS/ZIS-3 composite shows little upshift in S 2p 1/2 and 2p 3/2 binding energies compared with pristine ZnS and ZIS.The broad peak reveals that S 2-was present as both ZnS and ZIS in the composite.Additionally, the chemical composition estimated from XPS (see Supplementary Fig. S8) in the ZnS/ZIS-3 composite is consistent with the results obtained from ICP-MS (Supplementary Table S1).We observed some sulfur deficiency in the composite catalyst, which could facilitate the key environment as active sites for CO 2 adsorption 50.Note that the composite's binding energy shift could be attributed to charge transfer at the heterojunction interface.Theoretically, an increasing electron concentration decreases the binding energy due to the promoted electron screening effect 51. The composites' photocatalytic activity was tested in photocatalytic CO 2 reduction experiments in the presence of water vapor under visible light.The resulting hydrocarbon products (mainly acetaldehyde with a very small amount of methanol) were detected by gas chromatography (GC) with flame ionization detection (FID).To verify the obtained hydrocarbon products and exclude the possibility of carbon contamination during photo irradiation, a control photocatalytic experiment was conducted without CO 2 under an inert atmosphere in presence of visiblelight irradiation as shown in Supplementary Table S4.In the control experiment using helium (He) as an inert gas instead of CO 2 , we observed that a negligible amount of CH 3 CHO appeared at the initial three hours but completely vanished thereafter.This observation might be attributed to a minute contaminant adsorbed or trapped on the photocatalyst surface during the experimental procedure.Although in oxide-based photocatalysts several ways have been reported to avoid this kind of background products, however, the sulfide materials hardly undergo any cleaning process because of their possible degradation upon exposure to excessive heating.Therefore, to exclude the contamination effect, we subtracted the background amount of CH 3 CHO from the observed amount to ensure the accuracy of reported values.Fig. 3a compares the fuel formation yields of ZnS, ZIS, and ZIS/ZIS composites. Pristine ZnS generated very little acetaldehyde (around 1.47 mol g -1 ), indicating that it alone is not an active visible-light photocatalyst because of its wide band-gap.However, pure ZIS showed moderate photocatalytic CO 2 reduction ability, forming 55.85 mol g -1 acetaldehyde and 0.94 mol g -1 methanol.It showed a high absorption coefficient under visible light, but due to poor charge separation and carrier transport, it did not achieve high photocatalytic activity.Interestingly, acetaldehyde yield gradually increased as the composites' content of ZIS increased up to 25 wt, and ZnS/ZIS-3 exhibited the highest production of both acetaldehyde and methanol (367.63, and 1.37 mol g -1 , respectively; representing 99.6 selectivity towards acetaldehyde), achieving nearly 7 times that of pristine ZIS.However, further increasing the ZIS content decreased yield, likely because excessive ZIS disrupted the charge balance between ZnS and ZIS in the composite.Note that at low ZIS contents (5 and 12.5 wt) the composites formed acetaldehyde exclusively; methanol emerged only at higher ZIS contents.Fig. 3b plots the acetaldehyde formation rates for ZnS/ZIS-3.It peaked at around 1.5 h, and then remained stable up to 4.5 h, after which it dropped slightly, possibly owing to adsorption of acetaldehyde on the catalyst's surface.In addition to the catalytic behavior of the as-prepared heterostructure photocatalysts, we have performed photocatalytic CO 2 reduction for a physically mixed pristine ZnS with pristine ZIS as a model of the strain-free sample.The observed catalytic activity was found to be 24 times lower than that of ZnS/ZIS-3, providing strong evidence for the role of strain between the two heterostructure on enhancing the photocatalytic activity. To examine the stability of ZnS/ZIS-3, we performed six sets of consecutive photocatalytic CO 2 reduction cycles for 3 h each.After each reaction cycle, the reactor was cleaned and the catalyst degassed.The results in Fig. 3b (inset) reveal that the composite maintained its catalytic activity with a minute deterioration after 4th cycle due to that metal sulfide commonly shows photocorrosive behavior.The calculated solar fuel photochemical quantum efficiency for the composite was around AQE overall 0.8 under 1 sun.However, if we considered the photon absorbed by the material, which is around I( g )/I(overall) 13.3 based on the band gap g 461 nm, the calculated APQE 6.0.To understand more about catalytic evolution, we have conducted the photocatalytic activity at different light intensities of 0.3, 0.5, 0.75, 1, 1.2 Sun as shown in Supplementary Fig. S9.The linear behavior up to 1 sun can be explained as the electron/holes generation is ratedetermining step 52,53.In contrast, it shows that the CO 2 reduction reaction is the rate-determining step above 1 sun. Finally, to verify the origin of the hydrocarbon formation in the photocatalytic CO 2 reduction, we have performed an isotope labeling experiment using 13 CO 2 and confirmed the obtained results by GC-MS analysis as shown in Supplementary Fig. S10.It revealed that the reaction products to be 13 CH 3 13 CHO (m/z 46, 45, 30 and 16), and 13 CH 3 OH (m/z 33, 30, and 16), confirming that acetaldehyde and methanol were produced from the photocatalytic reduction of 13 CO 2 (m/ z 45) in addition to 12 CO 2 (m/z 44) peaks in the qualitative analysis due to the aforementioned possible reasons of contamination from batch type reactor which is hardly avoided.Additionally, we have performed GC-MS for qualitative detection of the oxidative products from the photocatalytic CO 2 reduction as shown in Supplementary Fig. S11.The observed peak at (m/z 32 after subtracting the value of air oxygen from the blank test measurement) correspond to O 2 evolution as a product confirming that the water oxidation reaction occurred during CO 2 photoreduction.54. A photocatalyst's electronic structure and energy levels such as work function, Fermi energy, valance band maximum (VBM), and conduction band minimum (CBM) are important characteristics for charge carrier generation and separation.Therefore, we studied the energy band alignments and electronic states of ZnS and ZIS in the ZnS/ZIS-3 heterostructure by combined ultraviolet photoemission spectroscopy (UPS) and UV-vis spectroscopy, as shown in Supplementary Fig. S12(a-c).The work functions and VBMs were calculated using the higher and lower binding energies of the UPS spectra.The complete electronic levels and energies are summarized in Supplementary Table S5.Supplementary Fig. S12d shows electronic band diagrams derived from these data.For additional confirmation of improved charge transfer and band alignment, electrochemical impedance study and Mott-Schottky analysis were performed for ZnS, ZIS and ZnS/ZIS-3, as shown in Supplementary Fig. S13. Figure S13a shows the Nyquist plots for the ZnS, ZIS, and ZnS/ ZIS-3 on FTO electrodes at an applied potential of 0 V (vs Ag/AgCl) with an amplitude of 10 mV and a frequency ranging from 20 kHz to 20 Hz in 0.5 M Na 2 SO 4 .We found that the charge transfer resistance (R ct ) of ZnS/ ZIS-3 heterostructure is lower than that of pristine ZnS and ZIS, suggesting an improved carrier transport characteristic in heterostructure.Supplementary Fig. S13 b shows the Mott-Schottky curve of the as prepared samples, all depicting an n-type behavior with a positive slope for C -2 versus V.The fitted lines showed the flat-band potentials of ZnS, ZIS, and ZnS/ZIS-3 to be -0.09,0.00, and -0.03 V (vs.NHE), respectively.The observed flat-band potential of ZIS is larger than that of ZnS, which is well matched with the observed UPS results.The composite's CBM and VBM cover the reduction potential of CO 2 and the oxidation potential of water.Note that both flat-band potentials of both ZnS and ZIS are near the CBM, suggesting n-type characteristics.The composite has a direct band gap of 2.69 eV, and its CBM and VBM are between the individual band structures of ZnS and ZIS.It is worth noting that when ZnS and ZIS are in contact with a staggered heterostructure and work function difference is the prerequisite for inducing charge redistribution and the formation of an internal electric field, the charge transfer should follow the Z-scheme mechanism according to previous reports 555657.To further confirm the direct Z scheme heterostructure mechanism, a metal nanoparticle photodeposition experiment has been conducted 58.The reaction involved using light irradiation to induce the reduction of Pt 4 from aqueous hexachloroplatinic acid (H 2 PtCl 6 ) to Pt 0 , which then deposited as nanoparticles on the composite's surface 59.The HRTEM image of the composite after Pt photodeposition experiment Supplementary Fig. S14 a show different lattice spacings of around 2.6, 3.1, and 3.3 A, which match the lattice fringes of Pt (111), ZnS (111), and ZIS (311), respectively.The lattice fringes of Pt, ZIS, and ZnS reveal that the Pt nanoparticles deposited on the ZIS sheets rather than the ZnS particles, indicating that the reduction occurred at the ZIS conduction band.For additional confirmation, we have conducted another photodeposition experiment, in which the PbO 2 nanoparticles were deposited on the catalyst surface via photo-oxidation process as shown in Supplementary Fig. S14 b.HRTEM image of the ZnS/ZIS-3 composite after PbO 2 nanoparticles deposition shows different d-spacings of around 3.4, 3.1, and 3.3 A, which are well-matched with the lattice fringes of PbO 2 (110), ZnS (111), and ZIS (102), respectively.The lattice fringes of PbO 2 , ZIS, and ZnS reveal that the PbO 2 nanoparticles deposited on the highly hole-rich ZnS surface.Therefore, photo-excited electrons in the conduction band of ZnS transfer to the ZIS valence band, driven by the potential drop at the interface.This favorable inter-structural carrier recombination suggests that the CBM of ZIS and the VBM of ZnS facilitate reduction and oxidation with excess electrons and holes. X-ray crystallography of ZnS/ZIS-3 identified induced crystal strain due to the reduced size of crystal and lattice mismatch between ZnS and ZIS crystals (Supplementary Table S2), and the difference between the constituent components is favorable for interfacial electron transfer from ZnS to ZIS.Overall, the photocatalytic CO 2 reduction mechanism of ZnS/ZIS-3 has been confirmed to be a direct Z-scheme heterostructure, as shown in Fig. 4(a,b).During photocatalysis, the composite's ZnS and ZIS are excited by visible light to generate charge carriers (electrons and holes).Photogenerated electrons on the conduction band of ZnS recombine with holes near the valence band maxima (VBM) of ZIS, drastically reducing the photogenerated charge carrier recombination within the constituent component.Therefore, the CBM of ZIS is enriched with photogenerated electrons for CO 2 reduction, while the holes remaining on the ZnS valence band are involved in water oxidation and possible oxidation of intermediates resulting during hydrocarbon formation.We assume that these synergistic effects significantly improve the composite's photocatalytic efficiency.The major photochemical reaction steps in the Z scheme process under visible-light irradiation are summarized in the following reactions. ZnS(e - h )/ZIS(e - h ) (Charge carrier generation) ZnS(e - h )/ZIS(e - h ) Z-scheme ZnS(h )/ZIS(e -) (Charge carrier separation) To understand the electronic properties and to unravel the dynamics of photo-excited electrons in the composite, we carried out photoluminescence (PL) and time-resolved PL (TRPL) measurements.The PL spectra in Fig. 4c show two characteristic peaks around 460 and 600 nm corresponding to ZnS and ZIS emissions, respectively.Compared with those of the individual ZnS and ZIS samples, the PL intensity of both peaks decreased in the ZnS/ZIS-3 composite after heterostructure coupling, indicating that radiative recombination was suppressed due to enhanced charge separation between the two semiconductors.The measured TRPL spectra (Supplementary Fig. S15) showed emissions at 590 and 460 nm corresponding to the lifetimes of photogenerated electron-hole pairs for ZIS, ZnS, and ZnS/ZIS-3.The fast decay time 1 and slow decay time 2 were calculated by biexponential fitting the emission decay data, and are summarized in the inset of Supplementary Fig. S15.The observed lifetime of ZnS/ZIS-3 is less than that of ZIS and ZnS at 590 and 460 nm, indicating the emergence of a nonradiative pathway or the delocalization of electrons at the interface between ZIS and ZnS.Therefore, it demonstrates effective charge carrier separation that allows the heterostructure to enhance photoreduction. Additionally, to support the proposed photocatalytic CO 2 reduction, we measured several on-off transient photocurrent response cycles of pristine ZnS, ZIS, and ZnS/ZIS-3 under visible light (AM1.5)illumination.Fig. 4d compares photocurrent (I) with respect to time (t) during several on-off cycles at a potential of 0 V (vs Ag/AgCl), and clearly shows that the photocurrent reaches an equilibrium value as the light is turned on, and eventually decreases to zero as the light is turned off.The observed photocurrents for ZnS were around 5 times and 60 times lower than those of ZIS and ZnS/ZIS-3, respectively, indicating lower absorption of visible light due to ZnS having a wide-band gap.Conversely, the enhanced photocurrent response of ZnS/ZIS-3 indicated a lower recombination rate and more efficient separation of photogenerated charge carriers (electrons and holes). To understand the physical adsorption behavior of gas molecules on a solid catalyst surface, we performed surface area measurements based on Brunauer-Emmett-Teller (BET) theory and CO 2 adsorption analysis.Fig. 5a shows N 2 adsorption-desorption isotherms for ZnS, ZIS, and ZnS/ZIS-3.ZnS possesses a type II isotherm associated with H3 Fig. 5. Surface area and CO 2 adsorption analyses.(a) BET specific surface area measurements and (b) CO 2 adsorption measurements at 25 C and 1 atm for ZnS, ZIS, and ZnS/ZIS-3.(c-e) In-situ DRIFTS spectra of ZnS/ZIS-3 after purging with CO 2 in the presence of residual water, after stopping purging and before light irradiation, and after light irradiation for 60 min (Spectra were collected every 10 min after the sample in the DRIFTS cell was purged by argon gas for 60 min).hysteresis loop however, ZIS shows the type IV(a) physisorption isotherm curve associated with H2 hysteresis loop, revealing significant adsorption on the surface of mesoporous layer structure.Additionally, in ZnS/ZIS-3 composite when ZnS nanoparticles decorated the ZIS nanosheets, we observed type II isotherm associated with H3 hysteresis loop.This porous surface feature of the as-prepared catalyst was further analyzed using the corresponding pore size distribution curve in Supplementary Fig. S16, which indicated a broad range of pore sizes from micropores to mesopores.The measured specific BET surface areas of the ZnS, ZIS, and ZnS/ZIS-3 were 34.6, 184.7, and 158 m 2 g -1 , respectively.The lower specific surface area of ZnS/ZIS-3 in comparison to ZIS was attributed to the formation of ZnS nanoparticles on the ZIS layers during the synthesis of the composite, which decreased the specific surface area.A heterostructure photocatalyst with a large specific surface area offers many active sites and facilitates photogenerated carrier transport for redox reactions, making it favorable for enhanced photocatalytic performance 60.The BET surface area of our hydrothermally prepared ZIS can be considered high compared with other reported template-free ZIS samples 61,62.To understand the CO 2 adsorption behavior on the solid photocatalyst surface, we performed CO 2 adsorption at room temperature (25 C; Fig. 5b), which revealed that ZnS/ZIS-3 adsorbed around 1.7 times as much CO 2 as pristine ZnS, suggesting that the layer structure ZIS possesses a higher affinity than ZnS for physically adsorbing CO 2 .The overall adsorption results are comparable to the BET surface area analysis; therefore, ZIS appears to offer more active sites than ZnS in the ZnS/ZIS-3 heterostructure and different surface energies for CO 2 adsorption.Overall, the photocatalytic reduction of CO 2 should occur on the ZIS surface due to the better affinity, further validating the proposed direct Z-scheme for CO 2 reduction on the ZnS/ZIS-3 heterostructure. In order to understand the reaction mechanism and explore the interaction of CO 2 with catalyst active sites, we monitored the evolution of surface species during catalytic reaction using in-situ diffuse reflectance infrared (IR) Fourier transformed (FT) spectroscopy (DRIFTS) as shown in Fig. 5(c-e).This was performed in a specific reaction chamber enhanced with a DRIFTS accessory, as previously reported 63.Supplementary Fig. S17 shows the in-situ FT-IR spectra for ZnS, ZIS, and ZnS/ZIS-3 after purging with CO 2 for 60 min in the presence of residual water.The background spectrum was collected after placing the sample in the DRIFTS cell and purging with argon gas for 60 min.The observed FTIR peaks in the range of 1264-1660 cm -1 are mainly associated with hydrated CO 2 speciation, including chemisorbed CO 2 (CO 2 e - CO 2 -, at around 1260 and 1660 cm -1 ) 64, bicarbonate (HCO 3 -at around 1430-1440 cm -1 ), and bidentate carbonate (CO 3 2-at around 1300-1324 cm -1 ) 656667.We observed that the peak intensity for hydrated CO 2 speciation obtained in pristine ZnS during CO 2 adsorption was much less than those for ZIS and ZnS/ZIS-3.Moreover, the composite showed clear peaks at 1260, 1324, and 1440 cm -1 , indicating adsorbed CO 2 -, bidentate carbonate, and bicarbonate species, respectively.In contrast to ZIS and ZnS/ZIS-3, ZnS showed very weak adsorption of CO 2 .These observations suggest that the indium element provides favorable surface energy for CO 2 adsorption and is the origin of active sites for CO 2 activation on the catalyst surface.To understand the role of H 2 O in CO 2 adsorption and overall photocatalytic reaction, we monitored in-situ FT-IR spectra during DRIFTS study for ZnS/ZIS-3 after purging with CO 2 for 60 min in the presence and absence of residual water as shown in Supplementary Fig. S18a.The observed enhancement of the FTIR peaks clearly indicates that the water molecule played a crucial role to facilitate the adsorptivity of CO 2 on the catalyst surface.Beside this enhancement of the adsorptivity of CO 2 on the catalyst surface, the observed photocatalytic performance in Supplementary Fig. S18b also reflects the importance of water on the catalytic performance.Therefore, it clearly proved the proton-assisted photocatalysis in presence of water as a proton source.More details of CO 2 adsorption and conversion in the presence of light on the surface of ZnS/ZIS-3, came from in-situ time-dependent DRIFTS analysis.Fig. 5(c andd) shows changing peak intensity for the adsorbed species after purging with CO 2 with residual water, after reaching equilibrium, and after light irradiation.The FTIR peaks in the range of 1000-1660 cm -1 increased as hydrated CO 2 purging time increased.Thereafter, to reach adsorption equilibrium, we ceased purging with hydrated CO 2 .All peaks were clearly observed after 60 min, although the peak intensities slightly decreased (Fig. 5d), indicating that the adsorbed species (CO 2 -, HCO 3 -, and CO 3 2-) were chemically adsorbed at the catalyst's surface-active sites.After 1 h of visible light irradiation, the peak intensities of the adsorbed species drastically decreased, and new peaks were detected at different positions, revealing the formation of intermediate surface species during photocatalytic CO 2 conversion.Specifically, the pair of peaks at and 1058 cm -1 and the individual peaks at 1128, and 1224 cm -1 were assigned to bidentate H 3 CO 68,69, monodentate H 3 CO 69, and HCOO 64 intermediate species, respectively.Among these, monodentate H 3 CO showed the lowest peak intensity.There was no carbon monoxide peak at 1879 cm -1 .We expect that the dioxycarbon anion, HCOO , and CH 3 O species observed during light-illuminated, in-situ, DRIFT analysis were likely intermediates of the photoreduction of CO to hydrocarbons.The peak position of all CO 2 species and related intermediates from DRIFTS are supported by the literature and summarized in Supplementary Table S6.The DRIFTS analysis suggests that the photocatalyst surface adsorbed CO 2 -species together with bending H 2 O -, converted them into HCOO intermediate, and progressively formed mono-dentate and bi-dentate H 3 CO .The bi-dentate and mono-dentate H 3 CO intermediates favorably formed C2 acetaldehyde and C1 methanol as major and minor products, respectively.The low concentration of methanol was due to its side reaction at holes on the catalyst's surface that formed formate ions, which could be an intermediate for additional acetaldehyde formation.The overall formation mechanism for photocatalytic CO 2 reduction is illustrated in Scheme 1."
  },
  {
    "title": "Conclusions",
    "content": "The direct Z-scheme ZnS/ZIS-3 heterostructure photocatalyst showed nearly 200-and 7-times higher gas-phase CO 2 reduction activity than pristine ZnS and ZIS, respectively, under visible light.This was due to the improved separation of photogenerated charge carriers.Microstrain at the interface between its ZnS and ZIS components induced electron transfer from the ZnS conduction band to the ZIS valance band, thus promoting their surfaces for selective redox processes, while the composite's indium active sites enhanced photochemical CO 2 reduction to acetaldehyde as a major hydrocarbon product via bi-dentate H 3 CO reactive intermediates.The role of water in CO 2 adsorption on the catalyst surface and overall photocatalytic activity has been illustrated and confirmed by the in-situ DRIFTS study.This study offers a Scheme 1. Mechanistic reaction pathway of hydrocarbon formation.Photocatalytic reaction pathway for acetaldehyde and methanol formation over ZnS/ ZIS-3 composite catalyst. AQE overall Mole of electron to convert hydrocarbons(HC)fuels Photons incident onto catalyst Number of electrons x Number of HC molecuels Number of photons incident onto catalyst x Area And, of the prepared photocatalysts were characterized by X-ray diffraction (XRD) and UV-vis spectroscopy.The powder XRD patterns of the synthesized ZnS, ZIS, and ZnS/ZIS-3 composite samples are shown in Fig. 1b.The pristine ZnS indicates a cubic crystal phase, with characteristic diffraction peaks at 2 28.56 , 33.10 , 47.50 , 56.37 , 59.18 , and 69.52 respectively assigned to the (111), (200), (220), (311), (222), and (400) planes of cubic ZnS (JCPDS-01-065-9585).The diffraction pattern of pristine ZIS matched the (006), (102), (104), (108), (110), (116), and (022) planes of the hexagonal structure of ZnIn 2 S 4 (JCPDS-03-065-2023)34.The main peaks of the composite ZnS/ZIS-3 were broadened, notably, (111), (220) and (311) peaks of cubic ZnS, along with (102) and (110) peaks of hexagonal ZIS.The (111) peak broadening with decreasing intensity in the composite was attributed to the formation of smaller ZnS nanoparticles.Supplementary Fig.S1shows XRD patterns of all ZnS/ZIS heterostructure samples (1-4) together with those of ZnS and ZIS and the physical mixture of the pristine ZnS and pristine ZIS, as strain-free sample.All composites showed the cubic structure of ZnS.Composite ZnS/ZIS-1 showed no noticeable ZIS diffraction peak due to the low amount and relatively low diffraction intensity of ZIS.As the concentration of ZIS increased due to the increased In content, short and broad diffraction peaks assigned to hexagonal ZIS became increasingly prominent around 2 28.5 and 47.5 .However, apart from the peak broadening, no specific peak shift was observed, confirming the coexistence of ZnS and ZIS in the heterostructure composite.The narrow and sharp (111) diffraction peak of ZnS in the samples with high Zn contents indicated higher crystallinity, which was attributed to the formation of larger ZnS particles. Fig. 1.Formation mechanism, crystal structure, and optical properties of (0D-2D) ZnS-ZIS composite.(a) Formation process.(b) XRD patterns and (c) UV-vis diffuse reflectance spectra and (inset) Tauc plots with direct fitting for cubic ZnS, hexagonal ZIS, and ZnS/ZIS-3 composite. Fig. 2. Morphology and structure of ZnS/ZIS-3.TEM images of (a) ZnS nanoparticles (0D), (b) ZIS nanosheets (2D), and (c) ZnS/ZIS-3 nanoparticle-nanosheet (0D-2D) composite.Insets show respective SAED patterns.scale bars are 50 nm.(d) HR-TEM image of the composite interface.(e) Magnification of the lattice fringes of the ZnS (111) and ZIS (102) at the interface.(f) inset of d shows the relative intensity of atoms of ZnS in (111) plane (g) HAADF-STEM image and EDX elemental mapping of S, Zn, and In from the selected area of the composite. Fig. 3. Photocatalytic CO 2 reduction activity.(a) Total yield after 6 h for ZnS, ZIS, and ZnS/ZIS composites under visible light.(b) Acetaldehyde formation rate; inset shows the stability test of ZnS/ZIS-3. Fig. 4. Electronic band diagram and charge carrier mechanism.(a) Schematic illustration of lattice mismatch and strain effect between cubic ZnS and hexagonal ZIS phases in ZnS/ZIS-3.(b) Direct Z-scheme of ZnS/ZIS (n-n ) heterojunction in ZnS/ZIS-3.(c) Photoluminescence spectra (laser 260 nm) and (d) comparative transient on-off photocurrent responses at 0 V (vs Ag/AgCl) of ZnS, ZIS, and ZnS/ZIS-3 in aqueous 0.5 M Na 2 SO 4 under AM1.5 visible light illumination. This study was financially supported by the Ministry of Science and Technology (MOST) in Taiwan under the Academic Summit Project (107-2745-M-002-001-ASP) and the Science Vanguard Project (108-2119-M-002-030 and 109-2123-M-002-004), and MOST (106-2112-M-008-003-MY3).Financial support provided by the i-MATE program (AS-iMATE-108-31) and Sustainability Science Project (AS-SS-106-02-3) of Academia Sinica, the Center of Atomic Initiative for New Materials (AI-Mat), National Taiwan University (108L9008 and 109 L9008), and the Featured Areas Research Center Program within the framework of the Higher Education Sprout Project by the Ministry of Education (MOE) in Taiwan is also acknowledged.Technical support from Nano-Core, the Core Facilities for Nanoscience and Nanotechnology at Academia Sinica in Taiwan, is acknowledged.I.S thanks the Science and Engineering Research Board (SERB) core research grant (CRG/2021/003355), New Delhi, India for financial support. novel and effective strategy to construct a Z-scheme heterojunction in a high-efficiency catalyst for photocatalytic CO 2 reduction in the gas phase. The authors declare no competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data associated with this article can be found in the online version at doi:10.1016/j.nanoen.2021.106809."
  }
]