[
  {
    "title": "Doi",
    "content": "10.1016/j.seppur.2021.119431"
  },
  {
    "title": "Article_Title",
    "content": "Efficient photocatalytic reduction of CO2 by a rhenium-doped TiO2-x/SnO2 inverse opal S-scheme heterostructure assisted by the slow-phonon effect"
  },
  {
    "title": "Abstract",
    "content": "Light harvesting and carrier separation play significant roles in determining the efficiency of photocatalytic reduction reactions.In this work, rhenium was doped into inverse opal TiO 2-x /SnO 2 to construct heterojunction catalysts in which Ti 3 is combined with oxygen vacancies (OVs).The slow-photon-effect of the inverse opal (IO) structure and the oxygen deficiency enable the catalysts to have high light-harvesting efficiency.SnO 2 was selected to construct the heterojunction, and its excellent electron migration rate was highly beneficial for boosting the separation efficacy of the photogenerated carriers.As a result, the yield of CO in photocatalytic reduction of CO 2 using the final obtained catalyst was 16.59 molg -1 h -1 , which is approximately 1.21, 2.14 and 7.44 times of the yields obtained using IO-TiO 2-x /SnO 2 , IO-TiO 2-x and SnO 2 , respectively.This strategy, which integrates the slow-photon-effect, oxygen vacancies, and element doping, affords a new avenue for preparing highly active heterojunction photocatalysts and improving photocatalytic performance."
  },
  {
    "title": "Experimental",
    "content": "Sodium hydroxide (NaOH) and styrene (St) were purchased from Tianjin Institute of Chemical Agents.Glacial acetic acid (CH 3 COOH) and polyvinylpyrrolidone (PVP) were purchased from Tianjin Fengchuan Chemical Co.Tetrabutyl titanate (TBOT) was obtained from Guoyao Chemical Reagents Co. Potassium persulfate (K 2 S 2 O 8 ) was purchased from Tianjin Fengchuan Chemical Co.Ammonium perrhenate (NH 4 ReO 4 ) was obtained from Sigma-Aldrich.A microporous membrane (50 mm, 0.25 m) was purchased from JinTeng Chemical Co.Sodium sulfate (Na 2 SO 4 ) and Tin chlorides (SnCl 4 ) were acquired from Tianjin Fengchuan Chemical Co.The polymerization inhibitor was removed from the styrene by treatment with sodium hydroxide (10 wt ) and distilled water three times before use. The monodisperse PS microspheres were obtained by emulsion polymerization of St according to a previously reported method.St (75 mL) and PVP (2.5 g) were added to water (500 mL) with stirring, and the mixture was heated to 75 C under nitrogen.An aqueous solution (50 mL) containing K 2 S 2 O 8 (1 g) was then added.After stirring for 24 h at 75 C, the polymerization was stopped, and the final product was washed several times with ethanol. The PS colloidal crystal template was prepared using a previously described method.Typically, the water dispersion of the PS microspheres was placed in a Brinell funnel with a microporous membrane until the dispersion was completely deposited on the substrate, and then the template was heated at 105 C for 5 min.The preparation of the PS template is shown in Fig. S1. IO-TiO 2-x was synthesized using the sol-gel method.TBOT (5 mL) and glacial acetic acid (5 mL) were added to 20 mL of ethanol and stirred for 2 h.The PS colloidal crystal template was immersed in this solution for 2 h in vacuum and heated at 50 C for 30 min.Then, the sample was calcined in a muffle furnace at 400 C for 5 h at a heating rate of 5 C/ min to obtain TiO 2-x .Finally, the obtained sample was calcined in a H 2 atmosphere at 400 C for 2 h at a heating rate of 5 C/min. The IO-SnO 2 structure was synthesized by the sol-gel method.SnCl 4 was added to ethanol (20 mL) and stirred for 2 h.Then, the PS colloidal crystal template was immersed in this solution for 2 h in vacuum and heated at 50 C for 30 min.Finally, the sample was calcined in a muffle furnace at 400 C for 5 h at a heating rate of 5 C/min to obtain IO-SnO 2 . The IO-TiO 2-x /SnO 2 heterostructure was synthesized using the sol--gel method.TBOT (5 mL), SnCl 4 (0.28 g), and glacial acetic acid (5 mL) were added to 20 mL of ethanol and stirred for 2 h.Then, the PS colloidal crystal template was immersed in this solution for 2 h in vacuum and heated at 50 C for 30 min.The sample was then calcined in a muffle furnace at 400 C for 5 h at a heating rate of 5 C/min to obtain IO-TiO 2- x /SnO 2 .Finally, the obtained sample was calcined in a H 2 atmosphere at 400 C for 2 h at a heating rate of 5 C/min. The IO-Re-TiO 2-x /SnO 2 heterostructure was synthesized using the same procedure as that for IO-TiO 2-x /SnO 2 .NH 4 ReO 4 (50 mg), TBOT (5 mL), SnCl 4 (0.28 g), and glacial acetic acid (5 mL) were added to 20 mL of ethanol and stirred for 2 h.Then, the PS colloidal crystal template was immersed in the solution for 2 h in vacuum and heated at 50 C for 30 min.The sample was then calcined in a muffle furnace at 400 C for 5 h at a heating rate of 5 C/min to obtain Re-IO-TiO 2-x /SnO 2 .Finally, the obtained sample was calcined in a H 2 atmosphere at 400 C for 2 h at a heating rate of 5 C/min. The Re-TiO 2-x /SnO 2 nanoparticle heterostructure was synthesized without the PS colloidal crystal template.Briefly, NH 4 ReO 4 (50 mg), TBOT (5 mL), SnCl 4 (0.28 g), and glacial acetic acid (5 mL) were added to 20 mL of ethanol and stirred for 2 h.Then, the samples were calcined in a muffle furnace at 400 C for 5 h at a heating rate of 5 C/min to obtain the Re-TiO 2-x /SnO 2 nanoparticles.Similarly, the obtained sample was calcined in a H 2 atmosphere at 400 C for 2 h at a heating rate of 5 C/min."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The morphology of all samples and the elemental distribution in Re-IO-TiO 2-x /SnO 2 were examined by SEM, TEM, and energy dispersive spectroscopy (EDS) mapping.As illustrated in Fig. 1a and1b, the PS spheres were monodisperse with a size of approximately 230 nm.It is evident that the PS template exhibits a highly ordered arrangement with a face-centered cubic structure.The self-assembled template of PS (Fig. S1) showed color changes because of Bragg diffraction from a different perspective, which indicates an orderly assembly 45.After self-assembly of the PS template, the tetrabutyltitanate precursor in ethanol containing some glacial acetic acid was added.In addition, IO-TiO 2-x (Fig. 1c), obtained by removing the PS template during calcination, was found to be have good connection between neighboring pores, which implied that the spheres in IO-TiO 2-x were mainly in a threedimensionally ordered structure.Furthermore, this ordered structure can be beneficial for transport of the reactants and solar-light harvesting 46.Fig. 1d,1e, and 1f show the SEM images of IO-SnO 2 , IO-TiO 2-x / SnO 2 and IO-Re-TiO 2-x /SnO 2 , respectively.The EDS mapping of IO-TiO 2-x /SnO 2 is shown in Fig. S2.After the introduction of SnCl 4 5H 2 O in ethanol solution and doping with Re, IO-TiO 2-x /SnO 2 and Re-IO-TiO 2-x / SnO 2 still have the original three-dimensionally ordered structure.The elemental distribution in the Re-IO-TiO 2-x /SnO 2 catalyst, determined by EDS mapping, is shown in Fig. 1g, which indicates that the elements Ti, Re, O, and Sn are almost homogeneously distributed.The percentages of Ti (28.83 wt), Re (2.52 wt), O (64.98 wt), and Sn (3.67 wt) obtained from the measurements (Fig. S3) are in agreement with the ICP-OES results.Fig. 1h and Fig. S4 display the TEM image of Re-IO-TiO 2-x /SnO 2 , and the calculated lattice spacings of 0.35 and 0.33 nm are respectively ascribed to the (1 0 1) planes of TiO 2 and the (1 1 0) planes of SnO 2 .The disordered layer on the outer surface of TiO 2-x was due to the generation of Ti 3 , which is consistent with previous reports 15. The crystal structures of IO-TiO 2-x , IO-SnO 2 , IO-TiO 2-x /SnO 2 , and Re-IO-TiO 2-x /SnO 2 are shown in Fig. 2. In the XRD pattern of IO-TiO 2-x , the diffraction peaks at 25.3, 37.8, 48.05 and 53.89 were ascribed to the crystal planes (1 0 1), (0 0 4), (2 0 0), and (1 0 5) (JCPDS card 21-1272), respectively 47.Fig. S5a shows a structural model of TiO 2 .After hydrogenation, some of the oxygen atoms are lost and become oxygen vacancies (OVs) corresponding to oxygen deficiency (Fig. S5b).The XRD results indicated that IO-TiO 2-x has the anatase crystal structure.For SnO 2 , the peaks at 26.6 , 33.9 , 37.9 , 38.9 , 51.8 , and 54.8 are ascribed to the (1 1 0), (1 0 1), (2 0 0), (1 1 1), (2 1 1), and (2 2 0) crystal planes (JCPDS card 41-1445) belonging to the pure tetragonal phase 48.A structural model of SnO 2 is shown in Fig. S5c.After the introduction of SnCl 4 5H 2 O in ethanol solution to form IO-TiO 2-x /SnO 2 , no notable change in the XRD pattern compared with IO-TiO 2-x was observed because of the small amount of SnO 2 and the good dispersibility.Furthermore, the IO-TiO 2-x /SnO 2 sample doped with Re showed diffraction peaks similar to those of IO-TiO 2-x /SnO 2 . UV-vis diffuse reflectance measurements were employed to investigate the light absorption properties of the catalysts and slow photon effect of photonic crystals.The absorption spectra of the samples and the band gap (E g ) are shown in Fig. 3a and3b.The values of pure IO-TiO 2-x and IO-SnO 2 were calculated using the Kubelka-Munk equation (1), where , h, v and k are the diffuse absorption coefficient, plank constant, light frequency and a constant, respectively.The value of n for a semiconductor is determined by the type of optical transition.For the direct band gap of TiO 2 and SnO 2 , the values of n (theoretically 4) 49 were calculated to be approximately 3.08 and 3.62 eV, respectively.From the relationship g 1240/E g , the absorption wavelengths g corresponding to the edges of the band gaps for the samples were estimated to be 402 and 342 nm, respectively 50.In the UV region, IO-SnO 2 has the strongest absorption.IO-TiO 2-x has a broader range of light absorption, including UV and visible light, compared to IO-SnO 2 .After the introduction of IO-SnO 2 and Re, the Re-IO-TiO 2-x /SnO 2 composite has the widest absorption region owing to the synergistic effects of the heterostructure and the doping.As shown in Fig. S6, we can clearly see that the obvious reflection peak of photonic crystal due to the ordered periodic structure, which is beneficial for boosting light absorption and photocatalytic activity.The Mott-Schottky plots of IO-TiO 2-x and IO-SnO 2 under different frequency were shown in Fig. 3c and Fig. 3d, which verify that IO-TiO 2-x and IO-SnO 2 belong to the semiconductor type.It can be seen that the Mott-Schottky plot has a positive slope, which indicates that both IO-TiO 2-x and IO-SnO 2 are n-type semiconductors.Generally speaking, for an n-type semiconductor, the position of the CB is 0.1 V more negative than the flat potential 51.The flat band potentials of IO-TiO 2-x and IO-SnO 2 could be estimated to be -0.91 and -0.82 eV (vs.Ag/AgCl at pH 7), which can be converted to -0.81 and -0.72 eV, respectively, vs. the Normal Hydrogen Electrode (NHE) according to equation (2) 52. The photoelectric properties of the prepared materials were investigated by electrochemical impedance spectroscopy (EIS), photoluminescence (PL) spectroscopy, and photocurrent transient responses (Fig. 4).The most effective measurement of electron-hole recombination probability in semiconductors is by PL emission spectrometry, in which a higher fluorescence intensity corresponds to a higher efficiency of electron-hole (e -/h ) recombination 25,53.The PL data for the prepared catalysts, obtained with an excitation wavelength of 325 nm, are shown in Fig. 4a.IO-TiO 2-x has a dramatically higher intensity in its PL spectrum owing to the recombination of highly photogenerated electrons and holes.When SnO 2 is integrated with IO-TiO 2-x to form the hybrid inverse opal material IO-TiO 2-x /SnO 2 , the fluorescence intensity of the PL spectrum for the IO-TiO 2-x /SnO 2 composites is remarkably lower than that of pure IO-TiO 2-x or IO-SnO 2 , which implies that the charge carriers can efficiently transfer and separate.Thus, the IO-TiO 2-x /SnO 2 composites can reduce electron-hole recombination and boost the photocatalytic activity.Furthermore, it is clearly observed that Re-IO-TiO 2-x /SnO 2 displays the weakest fluorescence intensity of all samples, which implies that Re-IO-TiO 2-x /SnO 2 has a high separation and transfer efficiency to boost the photocatalytic activity.Fig. 4b shows the EIS results for all the samples.In general, a larger arc radius keeps pace with a greater resistance.In contrast, Re-IO-TiO 2-x /SnO 2 with channel heterojunctions improves charge transfer and decreases the recombination of electrons and holes, which can result in lower charge transfer resistance and greater charge transfer and separation efficiency than are found in IO-TiO 2-x and IO-SnO 2 .It can be seen that Re-IO-TiO 2- x /SnO 2 possesses the lowest arc radius of all the prepared catalysts because of the rapid transfer of electrons, which indicates that Re-IO-TiO 2-x /SnO 2 has the smallest charge-transfer resistance, fastest migration, and most efficient charge separation.In addition, the photocurrent transient responses of all the samples were recorded using an electrochemical workstation (Zahner Zennium).Transient photocurrent responses can also reveal the charge transfer and separation efficiency of the semiconductor (Fig. 4c).A stronger signal is consistent with higher separation efficiency and a larger number of photogenerated electrons.It can be seen from the photocurrent transient responses that IO-TiO 2-x / SnO 2 produces a higher photocurrent (approximately 7.36 A) than those of IO-TiO 2-x (4.15 A) or IO-SnO 2 (1.92 A), which indicates that a large number of photogenerated carriers can be produced as a result of the formation of a heterostructure from TiO 2 and SnO 2 and the slowphoton effect of the IO structure.After doping Re into IO-TiO 2-x /SnO 2 , it is evident that Re-IO-TiO 2-x /SnO 2 has the highest photocurrent of in all samples, approximately 11.0 A, which is 1.5, 2.65, and 5.73 times higher than the photocurrents of IO-TiO 2-x /SnO 2 , IO-TiO 2-x , and IO-SnO 2 , respectively.Therefore, the Re-IO-TiO 2-x /SnO 2 composite should afford good separation and high transfer efficiency of the charge carriers, a conclusion that is consistent with the EIS and PL results.Constructing inverse-opal heterostructures from TiO 2 and SnO 2 , together with metal doping, is therefore an effective method for enhancing photocatalytic ability. The evaluation of photocatalytic activity for CO 2 reduction was completed using an all-glass automatic online trace-gas analysis system (Fig. S7, Labsolar 6A) using Na 2 SO 3 as a hole scavenger to boost the separation of photogenerated carriers.The experimental data are shown in Fig. 4d and Table 1.Corresponding to Fig. 4d, Fig. 4e demonstrates that IO-SnO 2 has the lowest formation rate for CO.However, it is evident that IO-TiO 2-x has higher photocatalytic activity than IO-SnO 2 .Compared with pure IO-SnO 2 and IO-TiO 2-x , the much higher formation rate for CO over IO-TiO 2-x /SnO 2 resulted from its heterostructure, which could significantly enhance light-harvesting efficiency and diminish the rate of electron-hole recombination 40.It is dramatic that Re-IO-TiO 2- x /SnO 2 has the highest formation rate of CO in all samples, resulting from the synergistic effect of the existence of Ti 3 (with OVs), the heterostructure between TiO 2 and SnO 2 , doping with mixed-valence Re, and the slow-photon effect.The formation rate of CO from CO 2 conversion with the IO-TiO 2-x /SnO 2 sample (13.75 molg -1 h -1 ) was calculated to be approximately 6.16 and 1.77 times those of IO-SnO 2 and IO-TiO 2-x , respectively.Following the doping of IO-TiO 2-x /SnO 2 with Re, the formation rate of CO from CO 2 conversion over Re-IO-TiO 2-x /SnO 2 was significantly enhanced, from 13.75 to 16.59 molg -1 h -1 , which is approximately 1.21, 2.14 and 7.44 times the rates over IO-TiO 2-x /SnO 2, IO-TiO 2-x , and SnO 2 , respectively.For IO-SnO 2 , although evolution of H 2 produced from water reduction (2H 2e - H 2 ) was observed (Fig. S8), the selectivity for CO production was as high as 61.For Re-IO-TiO 2-x /SnO 2 , the selectivity for CO production was almost 90, which indicates that this catalyst could possess the highest ability to reduce CO 2 while effectively preventing the side reaction of water reduction. Meanwhile, Re-TiO 2-x /SnO 2 without an inverse opal structure was synthesized and compared to Re-IO-TiO 2-x /SnO 2 in the evolution of CO production for the photocatalytic conversion of CO 2 .The formation rate of CO from CO 2 conversion was evaluated to be approximately 14.67 molg -1 h -1 (Fig. S9), which indicates that the inverse opal structure can lead to significantly enhanced light harvesting and promote charge separation efficiency via the slow-photon effect.Fig. S10 exhibits the evolutions of CO production for photocatalytic conversion of CO 2 over various samples under different wavelength irradiations.Obviously, all the samples possessed higher CO evolution rates upon 420 nm irradiation than 550 nm.Furthermore, the apparent quantum efficiency of Re-IO-TiO 2-x /SnO 2 under monochromatic light irradiation was 0.58 at 350 nm, 0.48 at 380 nm, 0.44 at 420 nm, 0.31 at 440 nm, 0.28 at 480 nm, and 0.25 at 500 nm (Fig. S11).Re-IO-TiO 2-x /SnO 2 was compared with other composite materials for TiO 2 -based photocatalysts (Table S2).The stability of Re-IO-TiO 2-x /SnO 2 was investigated by five circulation experiments of CO 2 reduction (Fig. 4f).As demonstrated, the prepared Re-IO-TiO 2-x /SnO 2 catalyst poses high cycling stability.To further evaluate the stability of the Re-IO-TiO 2-x /SnO 2 catalyst, the tests of XRD (Fig. S12), SEM (Fig. S13a), TEM (Fig. S13b), XPS (Fig. S14a-14e) and FTIR (Fig. S14f) for Re-IO-TiO 2-x /SnO 2 sample before and/or after recycling were conducted, these testing results verify that Re-IO-TiO 2-x /SnO 2 catalyst possessing no obvious changes in phase, structure, morphology, element valence and surface functional groups. In short, the developed Re-IO-TiO 2-x /SnO 2 catalyst possesses good stability in the photocatalytic experiments. To probe the chemical compositions and environment of IO-TiO 2-x , IO-TiO 2-x /SnO 2 , and Re-IO-TiO 2-x /SnO 2 , X-ray photoelectron spectroscopy (XPS) was carried out, and the results are shown in Fig. 5. Initially, only the elements C, Ti, and O were detected in the survey spectra of IO-TiO 2-x , which implies that IO-TiO 2-x was successfully prepared.Furthermore, compared to IO-TiO 2-x , the survey spectra of IO-TiO 2-x / SnO 2 showed that C, Ti, Sn, and O were present after the introduction of SnO 2 .Additionally, the survey spectra of Re-IO-TiO 2-x /SnO 2 demonstrated the presence of C, Ti, O, Sn, and Re (Fig. 5a).There is no doubt that Re-IO-TiO 2-x /SnO 2 was successfully prepared because no other elements were detected in the survey spectra.The high-resolution XPS profiles of the Ti 2p level in IO-TiO 2-x , IO-TiO 2-x /SnO 2 , and Re-IO-TiO 2- x /SnO 2 are shown in Fig. 5b.For pure IO-TiO 2-x , the peaks of Ti 2p located at 458.9 and 464.2 eV were assigned, respectively, to Ti 2p 3/2 and 2p 1/2 of Ti 4 in TiO 2 .Another two peaks at 458.4 and 463.7 eV are attributed to Ti 2p 3/2 and 2p 1/2 of Ti 3 in TiO 2 54.During the process of hydrogen reduction, Ti 3 species (with OVs) were generated from the reduction of Ti 4 , which could promote light harvesting and enhance the charge separation efficiency.Similar results for the disordered surface layer were also observed by TEM (Fig. 1h).For IO-TiO 2-x /SnO 2 , the two main peaks located at 459.3 and 464.6 eV were attributed to Ti 2p 3/ 2 and 2p 1/2 of Ti 4 in TiO 2 , respectively.It is worth noting that the binding energy of Ti 2p in IO-TiO 2-x /SnO 2 shifts by 0.4 eV toward higher value than in pure IO-TiO 2-x , which may also suggest the presence of electron migration between IO-TiO 2-x and IO-SnO 2 .Moreover, the highresolution Ti 2p spectrum of Re-IO-TiO 2-x /SnO 2 can also verify the existence of Ti 3 due to the generation of oxygen vacancies.Meanwhile, O 1 s peaks were located at 529.6 and 531.6 eV, which were assigned to lattice and non-lattice O in TiO 2 , implying oxygen vacancies accompanying the reduction of Ti 4 (Fig. 5c).However, the peaks of O 1 s for IO-TiO 2-x /SnO 2 could be divided into three typical peaks located at 530.0, 531.2 and 533.1 eV, which can be assigned to lattice O in TiO 2 55, oxygen vacancies resulting from the reduction of Ti 4 56, and lattice O in SnO 2 57, respectively. Similar to IO-TiO 2-x /SnO 2 , Re-IO-TiO 2-x /SnO 2 possesses three O 1 s peaks located at 530.3, 531.3, and 532.3 eV.In addition, Fig. 5d displays high-resolution XPS profiles of the Sn 3d level for IO-TiO 2-x /SnO 2 and Re-IO-TiO 2-x /SnO 2 .The peaks of Sn 3d located at 486.8 and 495.3 eV are assigned to 3d 5/2 and 3d 3/2 , which corresponds to the binding energy of Sn 4 in SnO 2 due to the difference in energy separation of different orbits (E 8.5 eV).There is no shoulder peak in the Sn 3d spectrum, which indicates that the Sn ions are present in the valence state 4. The positions of the peaks for IO-TiO 2-x /SnO 2 are close to those of Re-IO-TiO 2-x /SnO 2 .As shown in Fig. 5e, the Re 4f XPS profile was divided into 4f 7/2 and 4f 5/2 sublevels with an energy difference of 2.4 eV, which was in accordance with the splitting peak of Re.As shown in the Re spectrum, the peaks situated at 46.3 and 43.9 eV correspond to 4f 5/2 and 4f 7/ 2 of Re 4 , respectively, while peaks at 51.2 and 48.8 eV are ascribed to 4f 5/2 and 4f 7/2 of Re 7 .This indicates that the Re-IO-TiO 2-x /SnO 2 catalyst contains mixed-valence Re, which could promote the efficient transfer of electrons and holes 58,59.Moreover, the survey spectra of pure SnO 2 , exhibited in Fig. S16, indicate that the sample was successfully synthesized.Fig. 5f shows the ESR spectrum of IO-TiO 2-x and Re-IO-TiO 2-x /SnO 2 , which provides powerful evidence to verify the presence of oxygen vacancies, and is consistent with the XPS results.Furthermore, this result can imply that the oxygen vacancies in Re-IO-TiO 2-x /SnO 2 are derived from IO-TiO 2-x . To better understand the photocatalytic mechanism, isotope labelling experiments using 13 CO 2 were carried out, and the detection results are displayed in Fig. S14.The signals of CO can be clearly observed in the mass spectrum of Re-IO-TiO 2-x /SnO 2 after 6 h of photocatalytic reaction.Furthermore, the observed m/z of CO is 29 rather than 28, which indicates that the CO is derived from the labelled 13 With regard to the photocatalytic reduction of CO 2 , the energy bands of the semiconductor, including the conduction band (CB) and valence band (VB), must match the potential of CO 2 reduction to other products.The oxidation half-reaction is known to play an important role in the photocatalytic reaction process.As shown in Equations ( 3)-( 8), we can see that different potentials correspond to different reduction products 60. CO 2 2e - 2H HCOOH E -0.61eV (4) (Equation ( 3)-( 8), redox potential versus NHE at pH 7; E (pH) E (pH 0)-0.0592pH). The photogenerated electrons in the reaction system can be consumed only if the potential of the CB of the catalyst is more negative than the reduction potentials E (CO 2 /CH 4 ) -0.24eV and E (CO 2 / CO) -0.53eV 3,61.According to the results of the UV-vis diffuse absorbance spectra and the XPS valence spectra, the CB potentials (E CB ) of TiO 2 and SnO 2 are -0.81eV and -0.72 eV (vs.Normal Hydrogen Electrode, pH 7).Therefore, the E CB values of TiO 2 and SnO 2 are more negative than the potentials E (CO 2 /CO) -0.53eV and E (CO 2 /CH 4 ) -0.24eV, which indicates that it is theoretically feasible to generate CO and CH 4 from CO 2 .The formation of CH 4 or CO is thus dependent on charge transfer and reaction thermodynamics.It is evident that the values of E (CO 2 /CH 4 ) and E (CO 2 /CO) satisfy the thermodynamic conditions.In addition, the charges also play an important role in the photoreduction process and should be taken into consideration: the production of CH 4 requires eight electrons, whereas that of CO requires only two electrons, which implies that the major product of the photoreduction of CO 2 will be CO because of the lack of excited electrons. To understand the charge transfer processes in the Re-IO-TiO 2-x / SnO 2 binary photocatalytic system, the band edge positions of TiO 2-x and SnO 2 are presented in Scheme 2. From the UV-vis diffuse absorbance spectra, the XPS valence spectra (Fig. S15), and the Mott-Schottky plots of IO-TiO 2-x and IO-SnO 2 , the CB potentials (E CB ) of IO-TiO 2-x and IO-SnO 2 are -0.81 and -0.72 eV, and the VB potentials (E VB ) of IO-TiO 2-x and IO-SnO 2 are 2.27 and 2.90 eV, respectively, based on Equation (9). Note first that, under light irradiation ( 380 nm), the self-doping with Ti 3 can introduce impurity levels below the CB of IO-TiO 2 , leading to a narrower band gap width in black TiO 2 , which can broaden the light response and significantly enhance the light-harvesting efficiency 62.After the introduction of SnO 2 into TiO 2 to construct IO-TiO 2-x /SnO 2 , the absorbance for visible light is slightly reduced, but IO-TiO 2-x /SnO 2 can significantly improve the efficiency of photo-generated carriers.When mixed-valence Re is introduced into IO-TiO 2-x /SnO 2 , Re-IO-TiO 2-x /SnO 2 shows a broad absorption spectrum, which can increase the response range for light and significantly boost the light-harvesting efficiency. Density functional theory (DFT) calculations can further reveal the electronic structure for as-prepared catalysts.According to the calculated average potential profile along the c axis of SnO 2 and TiO 2-x , their work functions are calculated to be 6.33 eV and 5.75 eV, respectively (Fig. 6a and6b).These results indicated that SnO 2 with a larger work function is an oxidation-type photocatalyst.Conversely, TiO 2-x with a smaller work function is a reduction-type photocatalyst.Generally speaking, the work function of a material is negatively related to its Fermi level 63.As a result, both the Fermi levels are calculated to be -2.96eV and -3.37 eV, respectively.So, electrons in CB of TiO 2-x could easily transfer to CB of SnO 2 .Moreover, the electronic density of state of the SnO 2 and TiO 2-x was simulated, respectively (Fig. 6c and6d).Meanwhile, the electron distribution at interface between SnO 2 and TiO 2-x (Fig. 6e) is also simulated.As can be directly seen, the surface of SnO 2 is in the state of accumulating electrons at the interface.The results visually indicate that electrons would migrate from TiO 2-x to SnO 2. In order to understand the roles of the main active species in photocatalytic process, the radical trapping experiments were carried out.As shown in Fig. S17, upon the addition of tert-butanol (t-BuOH) and benzoquinone (BQ), the degradation efficiency of MB was dramatically dropped, indicating that generated OH radicals and O 2 -could play the important roles in the degradation process.As CB potential of IO-TiO 2-x (-0.81 eV) is more negative than that of IO-SnO 2 (-0.72 eV), electrons in CB of IO-TiO 2-x could easily transfer to CB of IO-SnO 2 .On the contrary, VB potential of IO-SnO 2 (2.90 eV) is more positive than that of IO-TiO 2- x (2.27 eV), and the holes could transfer from the VB of IO-SnO 2 to the VB of IO-TiO 2-x .Therefore, once the two materials were contacted together, the electrons spontaneously immigrated from TiO 2-x to SnO 2 across their interface until their Fermi levels achieved equilibrium due to the more negative Fermi level of TiO 2-x .The first separation type of photogenerated electron-hole pairs was that photogenerated electrons could transfer from the CB of IO-TiO 2-x to the CB of IO-SnO 2 , and the holes could transfer from the VB of IO-SnO 2 to the VB of IO-TiO 2-x , which belongs to typical type-II heterojunction (Scheme 2a).However, the VB potential (2.27 eV) of IO-TiO 2-x is more negative than that of E (OH/OH -) (2.4 eV) 64,65, the active species (OH) could not be generated, which is inconsistent with the radical trapping experiments (Fig. S17).As a result, the transfer and separation mode of photogenerated carriers cannot be explained by the traditional type II heterojunction system.Nevertheless, another type was accepted that the heterojunction between IO-TiO 2-x and IO-SnO 2 was constructed a typical S-scheme photocatalyst.Obviously, the VB potential (2.9 eV) of IO-SnO 2 is more positive than that of E (OH/OH -) (2.4 eV), and the active species (OH) can be generated.Furthermore, an internal electric field can be established on the heterojunction interface to prevent electrons further migrate from IO-TiO 2-x to SnO 2 after their Fermi levels achieved equilibrium.Then, the electrons generated in the CB of IO-TiO 2-x can be transferred to Re 7 , and the electrons of the resulting Re 4 will then be captured by CO 2 during the illumination process.Meanwhile, the electrons in the CB of SnO 2 and the holes in the VB of TiO 2-x could fastly combine, which can boost separation efficiency of photogenerated carriers.In this way, electrons of in the CB of IO-TiO 2-x will reduce CO 2 to CO, and the holes in the VB of SnO 2 will be consumed by Na 2 SO 3 (-Na 2 SO 3 2OH - 2 h Na 2 SO 4 H 2 O).This S-scheme heterojunction mechanism will eliminate the relatively recognized useless electrons from CB of SnO 2 and holes from VB of TiO 2-x , while preserve the useful electrons from CB of TiO 2-x and holes from VB of SnO 2 .Such charge transfer process is beneficial to the generation of free radicals.The Re-IO-TiO 2-x /SnO 2 sample is favourable for broadening the absorption of light and improving the separation efficiency of photogenerated carriers, and can thus be regarded as an excellent photocatalyst.The proposed mechanism for the photoreduction of CO 2 over Re-IO-TiO 2-x /SnO 2 catalysts is shown in Scheme 2b.As depicted, the developed photocatalyst belongs to S-scheme heterojunction 12.Consequently, S-scheme charge transfer process endows the Re-IO-TiO 2- x /SnO 2 heterojunctions with extremely high REDOX capability, thus significantly improving the photocatalytic activity."
  },
  {
    "title": "Conclusions",
    "content": "A series of inverse-opal catalysts has been prepared by employing polystyrene (PS) microspheres as colloidal crystal templates.The Re-IO-TiO 2-x /SnO 2 catalyst exhibited high light-harvesting efficiency, high Scheme 2. The charge separation process in the typical II heterojunction (a), the S-scheme system (b) and mechanism of Re-IO-TiO 2-x /SnO 2 heterojunction for photocatalytic reduction of CO 2 .carrier-separation efficiency, and outstanding catalytic ability, owing to the slow-photon-effect of the IO structure, the heterojunction, oxygen vacancies in the disordered layer on the surface, and the mixed valences of Re.After doping with Re, the generation rate of CO was improved from 13.75 to 16.59 molg -1 h -1 , which was approximately 1.21, 2.14 and 7.44 times the rate with IO-TiO 2-x /SnO 2, IO-TiO 2-x and IO-SnO 2 , respectively.Moreover, the selectivity of Re-IO-TiO 2-x /SnO 2 for CO generation was as high as 90, which is significantly higher than that for H 2 production.Furthermore, isotope labelling experiments using 13 CO 2 verified that the CO generated was derived from the labelled 13 CO 2 .This work proposes a strategy to construct novel S-scheme heterojunction structure in visible-light photocatalysts, which could offer an ideal method to boost photocatalytic activity for dealing with organic pollutants and the production of renewable energy sources. Fig. 1.SEM images of PS template (a and b), IO-TiO 2-x (c), IO-SnO 2 (d), IO-TiO 2-x /SnO 2 (e), Re-IO-TiO 2-x /SnO 2 (f and g) and corresponding EDS mapping, TEM image of Re-IO-TiO 2-x /SnO 2 (h). Fig. 2. XRD spectra of IO-TiO 2-x (a), IO-SnO 2 (b), IO-TiO 2-x /SnO 2 (c), Re-IO-TiO 2-x /SnO 2 (d). Fig. 3. UV-vis diffuse absorbance spectra (a), the corresponding plots of (h) 2 (b) of pure IO-TiO 2-x , IO-SnO 2 , IO-TiO 2-x /SnO 2 , Re-IO-TiO 2-x /SnO 2 and Mott-Schottky plots of IO-TiO 2-x (c) and IO-SnO 2 (d) under different frequencies. Fig. 4. PL spectra of pure IO-TiO 2-x , IO-SnO 2 , IO-TiO 2-x /SnO 2 and Re-IO-TiO 2-x /SnO 2 (a).EIS of pure IO-TiO 2-x , IO-SnO 2 , IO-TiO 2-x /SnO 2 and Re-IO-TiO 2-x /SnO 2 (b).Photocurrent transient responses of IO-SnO 2 , IO-TiO 2-x , IO-TiO 2-x /SnO 2 , and Re-IO-TiO 2-x /SnO 2 (c).Evolutions of CO production for photocatalytic conversion of CO 2 of IO-TiO 2-x , IO-SnO 2 , IO-TiO 2-x /SnO 2 and Re-IO-TiO 2-x /SnO 2 (d, e).Stability study on the evolutions of CO production over Re-IO-TiO 2-x /SnO 2 catalysts for five test cycles (f). Fig. 5.The survey spectra (a), and high-resolution XPS spectra of Ti (b), O (c), Sn (d) and Re (e) for IO-TiO 2-x , IO-TiO 2-x /SnO 2 and Re-IO-TiO 2-x /SnO 2 and ESR spectra of IO-TiO 2-x and Re-IO-TiO 2-x /SnO 2 (f). CO 2 . Fig. 6.Calculated average potential profile along the c-axis of SnO 2 (a) and TiO 2-x (b) (The insert crystal structures in (a) and (b) are SnO 2 and TiO 2-x , respectively), and density of states of SnO 2 (c) and TiO 2-x (d), and simulated electron density distribution at the interface between TiO 2-x and SnO 2 (e) (yellow and blue areas in (e) represent the accumulation and loss of electron, respectively). Results of the photocatalytic reduction of CO 2. Financial support from the 111 Project (B20088), the China Postdoctoral Science Foundation, the Natural Science Foundation of Heilongjiang Province (LH2020B001), the Postdoctoral Special Funding of Heilongjiang Provincial Government (LBH-TZ2002), and the Heilongjiang Touyan Innovation Team Program (Tree Genetics and Breeding Innovation Team) are greatly acknowledged.The authors want to thank Shiyanjia Lab (www.shiyanjia.com) for the support of highresolution TEM (HRTEM) and XPS valence spectra tests. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://doi. org/10.1016/j.seppur.2021.119431."
  }
]