[
  {
    "title": "Doi",
    "content": "10.1039/x0xx00000x"
  },
  {
    "title": "Article_Title",
    "content": "Green synthetic approach for self-doped TiO 2 with exposed highreactive facets with efficient CO 2 photoreduction under simulated solar light †"
  },
  {
    "title": "Abstract",
    "content": "Doping with oxygen vacancies and Ti 3 and engineering of the crystal morphology for exposing high-reactive facets have been demonstrated as important approaches to decrease the band gap of TiO2 and establish surface heterojunctions to enhance the photocatalytic performance of TiO2 under simulated solar light.The high-reactive facets can impact not only the CO2 reduction but also the TiO2 modification.Herein, atmospheric pressure dielectric barrier discharge (DBD) cold plasma, a green method with no environmentally hazardous reducing agents, was developed to achieve the self-doping of TiO2 single crystal film with exposed high-reactive facets.This method combines the advantages of the special facets and crystal defects.The characterization results indicate that the DBD cold plasma method achieves the modification of TiO2 film.The samples show remarkable improvement in reducing CO2 and H2O to CO and CH4 under simulated solar light, with yields reaching 0.075 micromol/m 2 and 0.015 micromol/m 2 respectively.The formation mechanisms of the method for TiO2 modification and CO2 reduction are also discussed."
  },
  {
    "title": "Experimental",
    "content": "Commercial Ti-foil which was of 99.9 purity was purchased from XinXin Metal Material Company, China.isopropyl alcohol (C 3 H 8 O), Acetone (C 3 H 6 O), sodium fluoride (NaF), hydrochloric acid (HCl, 36), sulfuric acid (H 2 SO 4 , 98), ethanol (C 2 H 6 O), hydrofluoric acid (HF, 40), nitric acid (HNO 3 , 68), hydrogen peroxide (H 2 O 2 , 30) and tetrabutyltitanate (TBT) were purchased from China Experiment Reagent Co., Ltd.(analytical grade) and were used without further purification.Sandpaper was supplied by Shanghai Diamond Brand Company.Commercial P25 (99) was from Degussa. A piece of Ti-foil (550.03cm 3 ) was first polished with 600 and 2000 sandpapers consecutively.The foil was then ultrasonically washed in an aqueous solution consisting of 1:1:1 (volume ratio) of C 3 H 8 O, C 3 H 6 O and deionized water for 60 min.The Ti-foil was then soaked in an aqueous solution of 1:4:5 (volume ratio) of HF, HNO 3 and deionized water for 30 s and dried in ambient conditions.The dried Ti-foil (52.5 cm 2 ) was immersed into a solution containing H 2 O 2 (96mL), HNO 3 (4mL) and NaF (0.42g) in a 150mL plastic beaker.The beaker was then placed in a water bath at 95 C for 2 h (Scheme 1a, b).After that, the Ti-foil was cleaned by deionized water and dried in ambient conditions.It was then trimmed into 2 smaller pieces and calcinated at 450 C for 1 h in ambient air conditions.The Ti-foil was then immersed in a solution (47 mL) containing H 2 O, HF, H 2 O 2 , H 2 SO 4 and tetrabutyltitanate (TBT) (volume ratio 30:0.2:1:6:1) that was placed in a 50 mL PTFE-lined stainless autoclave.The Ti-foil was kept at an angle against the wall of the PTFE-liner. The autoclave was then placed in an oven at 150 C for 6 h.The Ti-foil was lastly cleaned by deionized water.This sample was labelled as \"1 \" (Scheme 1c). After hydrothermal reaction a Ti-foil sample was covered by TiO 2 film.The Ti-foil was subsequently reduced using dielectric barrier discharge (DBD) cold plasma.Schematic 1 (d) presents the process of the DBD cold plasma device.A mixture of argon and hydrogen gases (volume ratio 1:1) was pumped into the reactor at a flow rate of 50 mL/min.The DBD plasma treatment lasted for 48min.The sample turned to be blue and was labelled as \"2 \" (Schematic 1 e). The morphologies of the fabricated samples were examined using scanning electron microscopy (SEM, Hitachi S4800) and transmission electron microscopy (TEM, JEM 2100F).The crystal phases of all as-prepared samples were determined using X-ray diffraction (XRD), which was performed on an X' Pert PRO X-ray diffractometer equipped with Cu K radiation ( 0.1541 nm).X-ray photoelectron spectroscopy (XPS) was performed on VG ESCALAB Mark II instrument using Mg-K (photon energy1253.6eV) as the excitation source, and its energy analyser working at 50 eV with the overall resolution of 0.2 eV.Due to relative surface charging, the binding energy displayed a shift which was rectified using the C 1s binding energy of 284.6 eV as an internal standard.UV-Vis diffuse reflectance spectra of the samples were obtained using a UV-Vis spectrophotometer (Shimadzu UV-3600, Japan).BaSO 4 was used as a reflectance standard in the UV-Vis diffuse reflectance experiments.Electron paramagnetic resonance (EPR) spectra were recorded on Bruker A300 EPR spectrometer equipped with a cylindrical quartz tube operating at 100 kHz field modulation at room temperature.Raman spectra were obtained on a LabRam HRUV at room temperature. Please do not adjust margins Please do not adjust margins The CO 2 photoreduction experiments with H 2 O vapour were carried out in a self-assembled reactor (capacity 380 mL) as reported in our previous study. 45The as-prepared samples were placed at the centre of the reactor under the illumination of two 300 Watt xenon lamp simulated solar light sources.A 350 W ultraviolet lamp was used as the ultraviolet source with the wavelength shorter than 420nm.Before illumination, ultrapure CO 2 (Air Products, 99.995) was pumped into the reactor at a flow rate of 300 mL/min for 1 h to purge residual air.After purging, illumination commenced and a circulating pump which pumped the CO 2 at the rate of 50 mL/min in the reactor through a flask filled with deionised water to add the H 2 O vapour into the reactor commenced operating.The gaseous products in the reactor were periodically analysed by gas chromatography (GC/FID, Thermo-Fisher, Trace GC).The room temperature remained at 25C during the testing.The P25 powders were put into a groove (52.5 cm 2 ) on a glass plate and compacted.The flat surface was faced with the illumination in the test.The recycle tests are conducted under the same conditions for five times."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The in situ growth of anatase TiO 2 film on Ti-foil was fabricated using a two-step method (Scheme 1).In the first step, Ti-foil was etched and calcined (Scheme 1a, b).This method can introduce a nanofilm, which consists of TiO 2 nanowires (Figure S1).These nanowires become a seed layer and subsequently a protection in the hydrothermal reaction.They act as heterogeneous nucleation centres to promote the TiO 2 crystal growth and protect the Ti-foil from being corroded by the hydrothermal reaction fluid (Scheme 1c).Finally, DBD cold plasma provides an environmentally friendly method for reducing the TiO 2 film (Scheme 1d).After being treated with plasma, the TiO 2 film turns a blue colour (Scheme 1e, Figure S2). The crystal structures of the two samples were investigated by their corresponding XRD patterns (Figure 1).Please do not adjust margins Please do not adjust margins The morphologies of the films were observed by SEM (Figure 2a,b), which consisted of some square-like plates.These square-like plates stand up on the substrate and interpenetrate each other leading to the rough surface of the film.According to the previous reports, anatase TiO 2 under equilibrium conditions tends to be a slightly truncated tetragonal bi-pyramid (Scheme 2a) with most of the (101) surfaces and a fraction of the (001) surfaces exposed based on the Wulff construction and thermodynamically stable conditions.However, these square-like plates expose most of the (001) surfaces, which are protected by F -throughout the crystal growth process.In the crystal growth process, TiO 2 crystals cannot grow along the 001 direction because F -is attached to the (001) surface, leading to the steric effect. 35In this case, the crystals mainly grow along the 100 and 010 directions, resulting in the square-like plates, which is proven by the SEM observations.In this experiment the (101) surfaces of the square-like plates are not formed and there are rough surfaces, which substitute for the (101) surfaces (Scheme 2b, c, d). As the HRTEM observations show (Figure 3a, b), the crystal lattice distance is 0.35 nm, which is attributed to the (101) face of anatase.The corresponding electron diffraction (SAED) patterns indicate that the square-like plates are single crystal, and the zone axis was indexed to be 111 (inset in Figure 3).We can confirm that the exposed surfaces are (111) faces, which are also the high-reactive facets.The exposure of the (111) facet may be attributed to two reasons.Firstly, from the previous report, F -acts as a capping reagent that can attach not only to the (001) surfaces but also to the (111) surfaces. 6he second reason is that the process of the crystal growth is both etching and growth of the TiO 2 at the same time.The (101) surfaces are etched; Therefore, (101) faces are not formed in this experiment.However, the attachment of the F on the (001) faces renders them free from being etched by the strong acidic fluid. 34,37 ue to the selective corrosion, we can observe the step-like structure on the edges of the plates from the SEM and HRTEM images (yellow dotted line in Figure 2a, b and Figure 3 a,b). Comparison between the two samples indicates that their SEM and TEM images are nearly the same, which also verifies that the DBD plasma did not change the morphology and microstructure of the film.The exposed high-reactive facets may affect the self-doping process, which was investigated in detail as described in the supporting information (Figure S3).The UV-vis spectra of the samples 1 and 2 are shown in Figure 4a.The sample 1 is characterized by strong absorption in the UV region (220350 nm), which is a typical anatase TiO 2 absorption, and without response in the visible light region (above 420 nm wavelength).This explains why the sample 1 is white in colour. 17However, the sample 2 exhibits broader absorption in the full spectrum.It has a similar absorption profile to that of a in the UV region, but shows remarkable absorption in the visible light region, even extending to the near-infrared region. Please do not adjust margins Please do not adjust margins Compared with sample 1 , sample 2 has a red shift absorption edge.All of these observations are consistent with the colour changing of the samples.Similarly, the band gap values, estimated from the Tauc plots (Figure 4b), also exhibit differences between the two samples.For sample 2 , the band gap value decreases noticeably (2.94eV), which is because Ti 3 and oxygen vacancies are introduced into the film. 7,8 he band gap value of sample 1 (3.14eV) is a little lower than the corresponding theoretical value (3.2eV). 19,20The oxygen vacancies, the intrinsic defects of the TiO 2 , which are revealed by the EPR and XPS spectra, are related to the decrease of the band gap value. XPS was employed to investigate the surface chemical bonding and the existence of the Ti 3 of the samples (Figure 5).Figures 5a andb show XPS spectra of O 1s and Ti 2p of sample 1 , respectively.Sample 1 shows an O 1s state with a binding energy of 529.49eV consistent with the standard binding energy for O in anatase.This peak has two shoulders at 530.79 and 531.99 eV attributed to the O atoms in the Ti 2 O 3 crystal lattice and surface hydroxyl band, respectively. 12,30,46 Tere were oxygen vacancies found in sample 1 .According to the previous reports, 36 the numerous un-coordinated O atoms existing on the high-reactive surface of the anatase can facilitate the formation of oxygen vacancies.The spectrum in Figure 5b shows Ti 2p states with binding energies of 458.22 and 463.85 eV well-consistent with the standard 2p 3/2 and 2p 1/2 binding energies for Ti 4 in anatase.The XPS spectra of sample 2 are different from those of sample 1 .However, it is apparent that the shoulder peak attributed to the O atoms in the Ti 2 O 3 crystal lattice (Figure 5c) accounts for a greater proportion in sample 2 , which illustrates that the DBD plasma can introduce Ti 3 in anatase.Additionally, there is a shoulder peak in the O 1s spectrum of sample 2 at 532.74 eV (Figure 5c) attributed to CO . 47According to previous reports, this is due to the adsorption of the CO 2 on sample 2 whose surface has affluent oxygen vacancies which act as CO 2 adsorption sites.The spectrum in Figure 5d shows not only the peak of the Ti 4 2p states but also the binding energies of 457.59 and 462.83 eV which are consistent with the standard 2p 3/2 and 2p 1/2 binding energies respectively for Ti 3 . 12,30,46,48 Thre are no impurity elements in the photocatalysts that is revealed by the full XPS spectra (Figure S4).Please do not adjust margins Please do not adjust margins Electron paramagnetic resonance spectra and Raman spectra were used to gain more information about the defects in the two samples (Figure 6).As shown in Figure 6a, samples 1 and 2 both exhibit an isotropic EPR signal at g2.002, which is the characteristic feature of the oxygen vacancy ( ). 6, 36 It is accepted that the intrinsic defect of the TiO 2 is an oxygevacancy, which is the reason that there is signal observed at g2.002 in sample 1 .The strong signal at g1.94 in sample 2 is attributed to Ti 3 , 46 which further illustrates that DBD plasma is an effective way to introduce Ti 3 into TiO 2 film. These results are in good accordance with those from the UVvis spectra.In order to obtain better confirmation on the presence of Ti 3 and , Raman spectra of the samples (Figure 6b) were also obtained.As for TiO 7c) and simulated solar light (Figure 7d) respectively.Every test was lasted for four hours and the sample 2 performs good stability in the photocatalytic test. The reason for the higher photocatalytic efficiency of sample 2 is probably due to the extended light response region.The surface will act as the reaction sites.And the reaction from CO 2 and H 2 O to CO and CH 4 is probably processing as the Figure 8.During the photocatalytic process, the photo-excited electron flow injects into the conduction band (CB) of TiO 2 , causing separation between electrons and holes.At the same time, the CO 2 molecules adsorbed on the surface of the TiO 2 film accept the separated electrons to produce CO (Figure 8).And the H 2 O molecules react with the photoholes and generate active groups, namely H and OH.These active groups react as the routes in Figure 8 to generate the products.The different possible products obtained are a result of the consuming of different numbers of electrons.As shown in Figure 8, one CH 4 obtained consumes more electrons (8e -) than the generation of CO (2e -). 41The CO is not only a product but also the reactant of the CH 4 .As a result, the yield of the CO is generally much higher than that of the CH 4 . 2,49 n the reaction routes the CO molecule can accept one photoelectron and generate Then, reacting with H and six other photoelectrons, the will transfer into CH 4 . 49"
  },
  {
    "title": "Conclusions",
    "content": "In conclusion, a TiO 2 film with exposed high-reactive facets was obtained by a facile method and DBD cold plasma was used as the reducing agent to gain the self-doped film.The film had exposed (001) and ( 111 It is the dielectric barrier discharge cold plasma that is developed to realize the self-doped of TiO 2 single crystal film. J. Name., 2012, 00, 1-3 This journal is The Royal Society of Chemistry 20xx an anatase phase (JCPDS card No. 21-1272).The reflections appearing at 225.3, 36.9,37.8, 38.6, 48.0, 53.9, 55.0 are attributed to the (101), (103), (004), (112), (200), (105), (211) lattice planes of the anatase phase, respectively.In addition, the reflections at 255.4, 69.6 are attributed to the (200) and (211) lattice planes of the Ti metal (JCPDS card No.44-1288), respectively.The sharp reflections of the XRD patterns reveal that the TiO 2 films have good crystallinity.The perfect match of the XRD patterns of the two samples suggests that the process of the DBD plasma did not significantly affect the crystalline structures of the TiO 2 film (Figure 1).J. Name., 2012, 00, 1-3 This journal is The Royal Society of Chemistry 20xx J. Name., 2012, 00, 1-3 This journal is The Royal Society of Chemistry 20xx Figure 7 shows the CO 2 photoreduction activity of different samples in the presence of H 2 O vapour under the influence of ultraviolet light and simulated solar light.Before the ) faces and affluent Ti 3 ions and oxygen vacancies, which together enhanced the photocatalysis performance of the film for reduction of CO 2 to CO and CH 4 under simulated solar light and ultraviolet light.The highest yields of CO and CH 4 were about 0.25 micromol/solar light), respectively.The introduced Ti 3 and oxygen vacancies change the band gap of the photocatalyst which broadens the absorption of the film in the visible light and the near-infrared regions, thereby achieving the photocatalysis activity.These results indicate 2 , five typical Raman bands at 142, 197, 398, 515, 639 cm -1 are observed which are attributed to anatase.The results of the phase composition revealed from the Raman spectra also corroborate with the XRD patterns.Compared with the Raman spectrum of sample 1 , it is readily observed that the Raman spectrum of sample 2 shows a clear blueshift.It is reported that the blueshift of the Raman peak is attributed to the generation of Ti 3 and in the TiO 2 crystal lattice.12,30, 46, 48 Published on 26 March 2018.Downloaded by Fudan University on 27/03/2018 05:53:57.View Article Online The authors thank Professor Li in Zhejiang University for helping us with the EPR. This journal is The Royal Society of Chemistry 20xx J. Name., 2013, 00, 1-3 7 Please do not adjust margins Please do not adjust margins that the TiO 2 film with exposed high-reactive facets may be a way to more easily realize self-doping and that DBD cold plasma is a promising method in the preparation of doped metal oxide films.We hold the opinion that the crystal styles may be also have an effect on the modification of the TiO 2 , which is an edification for researchers who are interested in TiO 2 self-doping. There are no conflicts to declare."
  }
]