[
  {
    "title": "Doi",
    "content": "10.1016/j.cej.2021.128501"
  },
  {
    "title": "Article_Title",
    "content": "In-situ growth of few-layer graphene on ZnO with intimate interfacial contact for enhanced photocatalytic CO2 reduction activity"
  },
  {
    "title": "Abstract",
    "content": "Intimate interfacial contact between semiconductor photocatalysts and cocatalysts is important for the transfer and separation of photogenerated charge carriers.Herein, few-layer graphene, as an efficient cocatalyst, was insitu deposited on the surface of ZnO.The composite demonstrated improved photocatalytic CO 2 reduction performance than pristine ZnO, ascribing to the intimate interfacial contact and Schottky junction between ZnO and graphene.Meanwhile, photothermal effect of graphene and - conjugation interaction between graphene and CO 2 molecules also contributed to the performance enhancement.This work not only provides a feasible approach for the in-situ growth of graphene, but also develops an efficient photocatalyst for CO 2 reduction."
  },
  {
    "title": "Experimental",
    "content": "ZnO/graphene nanocomposite was synthesized by CVD method with benzene as the precursor in a tubular furnace (OTF-1200X).In a typical procedure, commercial ZnO nanoparticles (0.5 g) (99, AR, Sinopharm Chemical Reagent Co., Ltd.) were placed into a porcelain boat, which was then put into quartz tube in a tubular furnace.The quartz tube was heated from room temperature to 700 C at a heating rate of 10 C per minute under high purity nitrogen protection (gas flow rate was 400 sccm).At 700 C, benzene (0.5 mL) (99.5, AR, Sinopharm Chemical Reagent Co., Ltd.) was introduced into the furnace by a syringe pump.Then the reaction temperature was maintained at 700 C for 30 mins.Subsequently, the system was naturally cooled in high purity nitrogen. Finally, ZnO/0.5graphenenanocomposite was obtained.In addition, the same quantity of commercial ZnO nanoparticles was subjected to the same treatment procedure (except that benzene was absent) for comparison.Besides, by varying the volume of benzene to be 0.25, 0.8 and 1 mL, samples of ZnO/0.25graphene,ZnO/0.8graphene and ZnO/1graphene can be obtained, respectively.Typically, the material used for characterization was the ZnO/0.5graphenesample (ZnO/graphene for clarity) unless otherwise stated.Thus, the following discussion will mainly focus on this sample. Physical and chemical properties of samples were characterized.For further details, please refer to Supporting Information (SI). The photocatalytic reduction of CO 2 in a 200 mL home-made reactor was evaluated.For further details, please refer to SI."
  },
  {
    "title": "Results_and_Discussion",
    "content": "ZnO/graphene was fabricated through in-situ CVD method using benzene as the graphene precursor.The possible formation process is speculated (Fig. 2).There are four main steps: (i) The oxygen vacancies or unsaturated metal atoms on ZnO surface are generated at 700 C. (ii) A number of active dehydrogenated benzene ring radical species are generated from benzene at 700 C 64.(iii) Initial graphene nucleus through electrophilic addition are formed, and they are captured by the oxygen vacancies or unsaturated metal atoms of ZnO surface (Fig. S1) 65.(iv) These nucleus grow when the dehydrogenated benzene ring radicals are bonded into the edges of graphene nucleus on ZnO surface.Because of the excellent diffusion properties of gas molecules, the surface of ZnO nanoparticles (NPs) gains full access to the dehydrogenated benzene ring radicals, facilitating the in-situ growth of graphene on ZnO surface with intimate interfacial contact. To investigate the phase structures of samples, the X-ray powder diffraction (XRD) patterns were obtained.As shown in Fig. 3a, all the diffraction peaks can be indexed to hexagonal wurtzite ZnO (JCPDS No. 36-1451) 66,67, respectively.Similarly, ZnO/graphene shows identical XRD pattern to ZnO, indicating that the crystal structures are intact after CVD treatment.The absence of graphene peaks is attributed to low loading amounts of graphene on ZnO.To determine the content of graphene, thermogravimetric (TG) measurement was performed.As shown in Fig. S2, the mass ratio of graphene is calculated to be 0.4 relative to ZnO.To further investigate the microstructures of samples, transmission electron microscope (TEM) and high-resolution transmission electron microscope (HRTEM) images were acquired.As shown in Fig. 3c and3d, clearly, few-layer graphene (2 5 layers) 51 is grown on the surface of ZnO with intimate contact.In addition, the spacing of lattice fringe is measured to be 0.26 nm (Fig. 3c and3d), corresponding to the distance between the (0 0 2) crystal planes of ZnO.This result is consistent with the previous XRD results. To distinguish amorphous carbon and graphene, Raman spectra of samples were collected.As shown in Fig. 4, the peaks at 380, 408, 438 and 584 cm -1 are mainly attributed to the transverse optical A 1 (A 1 (TO)), transverse optical E 1 (E 1 (TO)), high frequency E 2 (E 2 high ) and longitudinal optical E 1 (E 1 (LO)) modes, which are characteristic of firstorder optical phonon modes in hexagonal wurtzite ZnO NPs, respectively 68697071.In addition, the peaks at 332, 666 and 1072 cm -1 are assigned to the E 2 high -E 2 low (E 2 low is the low frequency E 2 mode), TA LO (TA is the transverse optical A mode and LO is the longitudinal optical mode) and TO LO (TO is the transverse optical mode), which are the second-order optical phonon modes caused by the multiple-phonon scattering processes of ZnO, respectively 68697071.The peaks at 536 and 1158 cm -1 are attributed to the 2B 1 low (B 1 low is the low frequency B 1 mode) and 2LO, respectively, typical of hexagonal wurtzite ZnO NPs due to the multiple-phonon scattering processes 68697071.As displayed in Fig. 4a, the peaks observed at 1342 (D band) and 1580 cm -1 (G band) are attributed to the disorder and planner vibration of sp 2 bonded carbon structure in graphene, respectively 727374.Apart from this, the presence of an intense peak at 2800 cm -1 is assigned to the 2D band of graphene, distinguishing graphene from amorphous carbon 727374.Furthermore, compared with ZnO, the Raman peaks intensity of ZnO in the composite becomes weak, ascribing to the shielding graphene layer on ZnO.Meanwhile, the slight red shift of the peak (E 2 high ) at 430 cm -1 of ZnO/graphene compared with ZnO (Fig. 4b) indicates their strong interaction.To this point, the successful anchoring of graphene is evident. To further demonstrate the surface chemical composition and electronic states of samples, X-ray photoelectron spectroscopy (XPS) measurements were performed.As shown in Fig. S3, the survey XPS spectra reveals that ZnO/graphene NPs are mainly composed of Zn, O and C elements without any other impurities.From Fig. 5a, the highresolution O 1s can be deconvoluted into two peaks centered at 530.3 and 531.8 eV, assigning to the lattice Zn-O band and surface hydroxyl group (-OH) of ZnO, respectively 66,67.Moreover, compared with ZnO, the binding energy of O 1s and Zn 2p in ZnO/graphene slightly shifts towards higher energy level under ex-situ XPS measurements (Fig. 5a and5b), confirming the chemical interaction and charge transfer between ZnO and graphene 66,67.To further investigate the charge transfer, in-situ XPS measurements were conducted 75.As shown in Fig. 5a andb, the binding energies of O 1s and Zn 2p in the nanocomposite under light irradiation significantly shift to higher energy levels than those in the dark.This result indicates further migration of electrons from ZnO under light irradiation 28,50,75. In addition, Fourier transform infrared (FT-IR) spectra were collected to investigate the surface functional groups of samples, and relevant results are shown in Fig. 6a.Peaks at 3400 and 1639 cm -1 are attributed to the stretching vibration peak of -OH groups 69, due to adsorbed water molecules of samples in air.An intense peak centered at 450 cm -1 is assigned to the stretching vibration of Zn-O bond 69.The peak of ZnO/graphene at 1596 cm -1 is characteristic skeleton vibration of the C C bond in graphene lattice 69,76.Therefore, the result of FT-IR spectra also proves the successful loading of graphene.Obviously, as shown in Fig. S4, the number of oxygen-containing functional groups obtained by CVD is far less than those in graphene oxide synthesized by modified Hummers' method.The presence of excessive oxygencontaining functional groups is detrimental to the photogenerated charge transfer from semiconductor to graphene during photocatalytic reaction 585960.Therefore, the graphene prepared by CVD method shows its superiority over others by favoring the interfacial transport of photogenerated carriers. To investigate the optical properties and light absorption capability of samples, UV-visible diffuse reflection spectroscopy (UV-vis DRS) were measured.As shown in Fig. 6b, the absorption band edge of ZnO locates at 387 nm, corresponding to bandgap energy (E g ) of 3.2 eV based to the Tauc plots (Fig. 6b inset).Analogously, the adsorption band edge of the nanocomposite is similar to that of ZnO, suggesting modification with graphene does not alter the bandgap of ZnO.Noticeably, enhanced absorption in the visible light region is realized by the nanocomposite.The enhancement is testified by the color change, from white to grayblack (Fig. S5).Meanwhile, graphene is reported to own photothermal effect 777879.To investigate the photothermal conversion abilities of ZnO and ZnO/graphene nanocomposite, the infrared thermograms were collected using a thermos-imager ( 760 nm), respectively.As shown in Fig. 7a andb, the average surface temperature of ZnO and ZnO/ graphene are 25.2 and 31.5 C, respectively.Moreover, maximum surface temperature of ZnO/graphene is 13.1 C higher than that of ZnO.The results confirm the photothermal effect contributed by graphene, which is expected to improve the photocatalytic reaction activity. In addition, surface area and CO 2 adsorption capacity are vital factors in PCR activity.Therefore, the nitrogen adsorption-desorption isotherms and CO 2 adsorption isotherms experiments are analyzed.As shown in Fig. S6 and Table S1, Brunauer-Emmett-Teller (BET) surface areas and pore structure distribution of both samples do not vary much. Whereas, the uptake of CO 2 by ZnO/graphene (0.021 mmol/g) is higher than that in ZnO (0.015 mmol/g) (Fig. 8).The boosted CO 2 adsorption capacity originates from the - conjugation interaction between graphene and CO 2 molecules 37,45. The PCR activities of samples were investigated under simulated solar light irradiation.As shown in Fig. 9a, CO, CH 3 OH and CH 4 are the major reduction products.Hereinto, for ZnO, the evolution rates of CO and CH 3 OH are 1.26 and 0.31 mol g -1 h -1 , respectively.And trace amount of CH 4 can be detected.Obviously, when the loading amounts of graphene is 0.4 (0.5 mL of benzene, ZnO/graphene), the evolution rates of these three reduction products reaches quite high values, up to 3.38, 0.59 and 0.09 mol g -1 h -1 , respectively.However, with the increase of graphene content, the PCR performance of samples (ZnO/ 0.8graphene and ZnO/1graphene) become worse, which can be attributed to the shielding effect of excessive graphene.Significantly, the evolution rate of each product obtained over ZnO/graphene, regardless of the loading content graphene, is higher than that over ZnO.Besides, O 2 as the major oxidation product can be detected.And the O 2 yielding rate for ZnO/graphene is higher than that for ZnO.Therefore, these results lead us to conclude that the graphene plays a crucial role in enhancing PCR reaction performance.Besides, the temperature of the reaction system under dark and light condition has been monitored (Fig. S7).The result indicates that the increase of system temperature can improve the PCR performance of ZnO/graphene.However, no reduction product was detected in the absence of light, indicating that light rather than heat is responsible for promoting the CO 2 conversion in this work.Meanwhile, clearly, the PCR performance of ZnO/graphene is still better than that of ZnO with the reaction system at the same temperature.Furthermore, a series of control experiments were designed in the absence of introduced CO 2 gas, and no product was detected either in the dark or under light irradiation.This result indicates that CO, CH 3 OH and CH 4 originate from PCR rather than the decomposition of graphene on the surface of ZnO/graphene nanocomposite.To further identify the carbon origins, 13 C-labeled NaH 13 CO 3 was employed for the reaction under argon atmosphere.As shown in Fig. S8, the 13 CH 4 (m/z 17) and 13 CO (m/z 29) are detected by gas chromatography-mass spectrometry (GC-MS).Distinctively, when NaH 12 CO 3 is adopted as reference, 12 CH 4 (m/z 16) and 12 CO (m/z 28) are detected under the same conditions.Beyond all doubt, the isotope 13 C-labeling experiment discloses the products come from the PCR reaction instead of impurity or decomposition of ZnO/graphene.Furthermore, the stability of ZnO/ graphene is assessed by repetitive PCR experiments for five times.As shown in Fig. 9b, after five cycles, the PCR performance of ZnO/graphene nearly retains.Meanwhile, the Raman spectra of ZnO/graphene before and after PCR reaction do not change significantly (Fig. S9).Both of these results infer good stability of ZnO/graphene during PCR reaction. To elucidate the reaction process of PCR on ZnO/graphene, in-situ diffuse reflectance infrared Fourier transform spectroscopy (in-situ DRIFTS) were performed 80,81.The in-situ DRIFTS spectra of ZnO/ graphene nanocomposite were collected in dark (Fig. 10b-d) and under light irradiation (Fig. 10e-f ) are recorded at the beginning of in-situ DRIFTS spectra measurement without light irradiation (0-60 mins), which are assigned to the modes of surface adsorbed CO 2 molecules on ZnO/graphene 15,18,22,50,81.Besides, the peak at 1595 cm -1 is attributed to adsorbed H 2 O molecules.Furthermore, under light irradiation, most peaks display minor enhancement without apparent position change.Of note, some new peaks emerge under light irradiation.The peaks at 1352 and 1515 cm -1 are attributed to the stretching vibration peaks of COO - species, and the peaks at 1498 and 1782 cm -1 are ascribed to the vibration of formaldehyde species (HCHO -).Besides, the peaks at 1690, 1705 and 1737 cm -1 are assigned to the stretching vibration of methoxy groups (CH 3 O -) 15,18,22,50,81.It can be deduced that COO -, HCHO -and CH 3 O -act as the essential intermediate species during PCR reaction on ZnO/graphene.In addition, according to the types of intermediate species (COO -, HCHO -and CH 3 O -) and previous reports 4,15,18,22,50,81, a possible CO 2 reduction pathway was proposed in To evaluate the dynamic behavior of photo-induced charge carriers for ZnO and ZnO/graphene, photoelectrochemical measurements were carried out.As shown in Fig. 12a, the photocurrent density of ZnO/ graphene is obviously higher than that of ZnO, confirming that ZnO/ graphene has a more effective separation of photo-induced charge carriers than ZnO 15,42,81.Besides, to further analyze the charge transfer resistance of samples, the electrochemical impedance spectroscopy (EIS) plots were fitted to the equivalent circuit model (Fig. 12b inset), where R s is the electrode solution resistance, R ct is the interfacial charge transfer resistance, and CPE is the constant phase element 82. The R ct values are calculated to be 2498 and 8211 ohm for ZnO/graphene and ZnO, respectively.Meanwhile, as shown in Fig. 12b, clearly, the semicircular radius of ZnO/graphene is smaller than that of ZnO, indicating that the resistance of charge transfer in ZnO/graphene is lower than that in ZnO.These results state that graphene could effectively improve the separation efficiency of photo-induced charge carriers.For comparison, we also prepared graphene and graphene oxide on ZnO nanoparticles (named as Graphene-ZnO and GO-ZnO, respectively) with the same loading of 0.4 wt by simple mixing.As shown in Fig. S10a, PCR rates of Graphene-ZnO and GO-ZnO are lower than that of ZnO/graphene.Meanwhile, clearly, the smallest semicircle is observed for ZnO/graphene in EIS spectra (Fig. S10b).The comparison results indicate that the intimate interfacial contact in ZnO/graphene promotes the photocatalytic reaction. Besides, to explore the lifetime of charge carriers, photoluminescence (PL) and time-resolved PL measurements were performed.As shown in Fig. 13a, the first PL emission peak at around 375 nm is attributed to the bandgap transition of ZnO; while the second PL emission peak at 510 nm is categorized as the band edge free excitons 83,84.In addition, as we all know that a lower PL peak intensity means a lower recombination rate of the photo-induced electron-hole pairs 83,84.Significantly, the PL peak intensity of ZnO is higher than that of ZnO/graphene (Fig. 13a), implying the positive role of graphene in suppressing photogenerated electron-hole pairs recombination.The result is consistent with the results of photocurrent density and EIS spectra.Meanwhile, it can be seen that the blue shift in second PL emission peak of ZnO/graphene in comparison with ZnO, which also further suggests the strong chemical interaction between graphene and ZnO and thus boosts photogenerated charge carrier separation.From the time-resolved PL spectra in Fig. 13b, the average photoluminescence lifetime ( ave ) of ZnO/graphene is calculated to be 1.78 ns, which is more than 3.6 times shorter than that of ZnO (6.44 ns).The decreased ave implies that the photogenerated electrons of ZnO are rapidly captured by graphene due to its excellent electrical conductivity and large work function.Therefore, the number of recombined electrons and holes are reduced 858687.Besides, in order to analyze whether oxygen defects of ZnO are helpful for PCR reaction in our work, CA-ZnO (oxygen defects free) and ZnO (oxygen defects rich) (Fig. S1) are used for comparison.CA-ZnO was obtained by directly annealing commercial ZnO at 700 C in air for 30 mins.As shown in Fig. S10a, the PCR performance of CA-ZnO is higher than that of ZnO.Moreover, the PL peak intensity of CA-ZnO is lower than that of ZnO (Fig. S11).These results indicate that the existence of oxygen defects is not conducive to the improvement of PCR performance in our work.Most notably, the PCR performance of ZnO/graphene is obviously higher that of ZnO and CA-ZnO (Fig. S10a), suggesting that graphene rather than oxygen defect plays a crucial role in enhancing PCR reaction performance for this work. To further understand the mechanism of PCR reaction, the conduction band (CB) and valence band (VB) positions of ZnO and ZnO/graphene were analyzed.As shown in Fig. S12, Mott-Schottky (M-S) measurement of ZnO and ZnO/graphene were performed.It can be seen that the flat-band potentials of ZnO and ZnO/graphene are similar and estimated to be -0.58V (vs.Normal Hydrogen Electrode (NHE) at pH 7), due to a low loading amount of graphene on the surface of ZnO.In general, the flat band potential is close to the CB of n-type semiconductor 888990.Therefore, based on the results of M-S plots and UV-vis DRS spectra, we can conclude that the CB and VB potentials of ZnO and ZnO/graphene are -0.58 and 2.62 V (vs.NHE at pH 7), respectively.The reduction potentials of CO, CH 3 OH and CH 4 are -0.53,-0.38 and -0.24 V (vs.NHE at pH 7) (Table S2) 1,4,5, respectively, which are significantly positive than that of the CB potentials of ZnO and ZnO/graphene.Besides, the oxidation potential of O 2 and protons produced by H 2 O molecules was 0.82 V (vs.NHE at pH 7) (Table S2), which is obviously negative than those of the VB potentials of ZnO and ZnO/graphene.Hence, the driving force offered by ZnO and ZnO/ graphene easily reduces CO 2 molecules into CO, CH 3 OH and CH 4 .Moreover, the M-S curve slope of ZnO/graphene is obviously smaller than that of ZnO (Fig. S12), demonstrating that the charge carrier density of ZnO/graphene nanocomposite (3.94 10 19 cm -3 ) is higher than that of ZnO (1.79 10 19 cm -3 ) 91.This result suggests that introduced graphene on the surface of ZnO for enhanced the charge carrier density.Besides, the PCR reaction is a multi-electron reduction process.As shown in Table S2, evolution of CH 4 (8-electron reaction process) and CH 3 OH (6-electron reaction process) require more photogenerated electrons than that of CO (2-electron reaction process).Therefore, the yield rates of CO, CH 3 OH and CH 4 are different, and the good selectivity of CO is reasonable by considering the reaction dynamics.In addition, the work function of ZnO and graphene were measured by Kevin probe on the basis of contact potential differences (CPD) 35,61.Furthermore, based on the previous report 61, there is a positive proportional relationship between the change of the CPD values and the concentration of photogenerated charge carriers for samples before and after illumination.As shown in Fig. 14 and Table 1, the difference of CPD values for ZnO/graphene (459 mV) is significantly higher than that of ZnO (381 mV), indicating the better separation efficiency of photogenerated charge carriers for ZnO/graphene nanocomposite than that of ZnO. Based on the above results and discussions, we illustrate the PCR reaction mechanism of ZnO/graphene in Fig. 15.The work functions of ZnO and graphene are 4.28 and 5.27 eV, respectively (Table 1 and Fig. 15a.).When direct contact between ZnO and graphene is established, the free electrons will transfer from ZnO with higher Fermi level to graphene with lower Fermi level until equilibrium is built.Concurrently, ZnO exhibits upward interface band bending owing to its loss of electrons.Meanwhile, graphene, as the cocatalyst and electron sink, accepts the electrons from ZnO.After that, Schottky junction is formed at the interface and ZnO has the appropriate band bending (Fig. 15b) 92,93.When the ZnO/graphene nanocomposite is exposed to light (Fig. 15c), the electrons are excited from VB to CB in ZnO, raising the Fermi level of ZnO from -4.28 to -3.90 eV (Table 1).While Fermi level of graphene is almost unaltered before and after illumination and kept at -5.07 eV (Table 1).This provides enough driving force for photogenerated electrons of ZnO to surmount the Schottky barrier and transfer to graphene rapidly.Simultaneously, the photogenerated holes, located at the VB of ZnO, react with H 2 O to produce O 2 and protons.Besides, the photogenerated electrons trapped by graphene cannot flow back to ZnO due to the existence of Schottky junction, which can effectively suppress the recombination of photogenerated electron-hole pairs 93.Meanwhile, owing to the short transport distance, intimate contact and good electronic conductivity of graphene, the photogenerated electrons on the graphene side can migrate to the surface swiftly, and readily participate in the reduction of CO 2 .Hence, improved PCR performance can be achieved."
  },
  {
    "title": "Conclusions",
    "content": "In summary, ZnO/graphene nanocomposite photocatalyst was successfully prepared via in-situ CVD method.The results of experiments indicate that the PCR performance of ZnO/graphene is obviously higher than that of ZnO.The reasons are enumerated as follows: (1) Intimate interfacial contact and Schottky junction from in-situ growth of fewlayer graphene on ZnO surface by CVD method.(2) Photothermal effect attributed to graphene.(3) Promoted CO 2 adsorption deriving from - conjugation interaction between graphene and CO 2 molecules.This work will establish a new avenue for in-situ designing graphene cocatalyst and provide an accessible approach to boost the activity of PCR reaction. Fig. 1.Semiconductor-graphene photocatalysts prepared by different methods.(a) traditional top-down and (b) in-situ CVD. Fig. 2. Reaction process of graphene formation with benzene on ZnO surface. Fig. 3. (a) XRD patterns and (b) TEM image of samples.(c) and (d) HRTEM images of ZnO/graphene, corresponding to the red dotted circles of c and d in Fig. 3(b), respectively.(For interpretation of the references to color in this figure legend, the reader is referred to the web version of this article.) Fig. 5. In-situ and ex-situ high-resolution XPS spectra of (a) O 1s and (b) Zn 2p of ZnO and ZnO/graphene.In-situ XPS spectra were recorded under 365 nm LED irradiation. Fig. 6.(a) FT-IR spectra and (b) UV-vis DRS spectra of samples.Inset is the estimated energy band gap of samples by Tauc plots. Fig. 7. Infrared thermograms of (a) ZnO along with (b) ZnO/graphene. Fig. 8. CO 2 adsorption isotherms of samples. ) conditions.Bicarbonate species (HCO 3 - Fig. 9. (a) Yield of products for PCR of samples.(b) PCR stability of ZnO/graphene. Fig. 10.In-situ DRIFT spectra of ZnO/graphene.(a) Background line was obtained without introducing CO 2 /H 2 O gas in dark.(b), (c) and (d) were collected after adsorbing CO 2 /H 2 O gas for 20, 40 and 60 mins under dark, respectively.(e), (f) and (g) were collected after adsorbing CO 2 /H 2 O gas for 20, 40 and 60 mins under light irradiation, respectively. Fig. 11.First, CO 2 is adsorbed on the surface of ZnO/graphene nanocomposite.Subsequently, the CO 2 molecules obtain photogenerated electrons and form COO -.Afterwards, COO -reacts with protons (produced by the reaction between photogenerated holes and water) to form COOH. Then the COOH gains photogenerated electrons and protons to form CO intermediate.At the meantime, some of CO molecules are prone to release, and the rest undergo further reaction with photogenerated electrons and protons in the system to form intermediate species of HCHO -and CH 3 O -. Finally, CH 3 O -is hydrogenated to form CH 3 OH or CH 4 in different ways.Therefore, it can be concluded the speculated pathway can be briefly expressed as CO 2 COO - CO HCHO - CH 3 O - CH 4 or CH 3 OH.To evaluate the dynamic behavior of photo-induced charge carriers for ZnO and ZnO/graphene, photoelectrochemical measurements were carried out.As shown in Fig.12a, the photocurrent density of ZnO/ graphene is obviously higher than that of ZnO, confirming that ZnO/ graphene has a more effective separation of photo-induced charge carriers than ZnO15,42,81.Besides, to further analyze the charge transfer resistance of samples, the electrochemical impedance spectroscopy (EIS) plots were fitted to the equivalent circuit model (Fig.12binset), where R s is the electrode solution resistance, R ct is the interfacial charge transfer resistance, and CPE is the constant phase element82. Fig. 11.Possible formation pathways for the evolution of CO, CH 3 OH and CH 4 on the surface of ZnO/graphene during PCR reaction. Fig. 12.(a) Photocurrent density curves and (b) EIS spectra of samples.Inset is the equivalent circuit model. Fig. 13.(a) PL spectra and (b) time-resolved PL spectra of samples. Fig. 14.CPD spectra of samples. SPV is the surface photovoltage of samples, where, SPV CPD light -CPD dark .E f is the Fermi energy of samples, which equals to inverse number of work function W. Fig. 15.Schematic illustration of the PCR mechanism of ZnO/graphene.: work function; E F : Fermi level; E vac : vacuum energy; E c : conduction band; E v : valence band.(a) Before contact, (b) after contact and (c) under light irradiation. The CPD, SPV, work function and Fermi level values of samples. Samples CPD dark (mV) CPD light (mV) SPV(mV) W dark (eV) W light (eV) E f(dark) (eV) E f(light) (eV) This work was supported by National Natural Science Foundation of China (NSFC) (Nos.51872220, 51932007, 51961135303, 21871217, U1905215 and U1705251), National Key Research and Development Program of China (No. 2018YFB1502001) and Fundamental Research Funds for the Central Universities (No. WUT: 2020III027). The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://doi. org/10.1016/j.cej.2021.128501."
  }
]