[
  {
    "title": "Doi",
    "content": "10.1016/j.apsusc.2021.150805"
  },
  {
    "title": "Article_Title",
    "content": "Fabrication of flower spherical-like Z-scheme FeWO4/NiAl-LDH photocatalysts with excellent activity for CO2 photoreduction under visible light"
  },
  {
    "title": "Abstract",
    "content": "In recent years, photocatalytic reduction of carbon dioxide technology has been considered as an effective approach to moderate the energy crisis.In order to achieve efficient reduction of CO 2 , direct Z-scheme heterostructure composed of NiAl-LDH flower-like sphere and FeWO 4 nanoflakes (FWLDH) were obtained through a facile hydrothermal strategy.The prepared FWLDH photocatalysts revealed outstanding performance for CO 2 photoreduction to CO under the irradiation of visible light.The 10FWLDH possessed the optimal photocatalytic CO yield (5 mol g -1 h -1 ), reaching up to 2.4 folds higher than that of pristine LDH (2.1 molg -1 h -1 ).In addition, the CO selectivity was more than 93 over hydrogen evolution from the side reaction of water reduction.Finally, EPR characterization indicated that the electron transfer mechanism of FWLDH catalyst conformed to the Z-scheme pattern.The effective separation of the light-induced electron-hole pairs and the enhancement of the photoelectron reduction ability at the NiAl-LDH conduction band were the reasons for the prominent improvement of the photocatalytic performance of NiAl-LDH.This research could provide a novel perspective for designing photocatalyst with high efficiency for CO 2 photoreduction."
  },
  {
    "title": "Experimental",
    "content": "The synthesis process of direct Z-scheme NiAl-LDH/FeWO 4 heterostructure is demonstrated in Scheme 1. First, FeWO 4 ultrathin nanoflakes were fabricated.Then, FeWO 4 ultrathin nanoflakes were added to the solution containing the precursor of NiAl-LDH to obtain NiAl-LDH/ FeWO 4 follow-like spherical Z-scheme heterostructure. The pristine FeWO 4 nanopartiles was fabricated by adopting the strategy mentioned in previous report 34.The complex was constructed by hydrothermal strategy.In a typical process, a certain mass of as-fabricated FeWO 4 nanoparticles were dispersed in 100 mL of water and subjected to ultrasonication for 30 min.Then, 1.7447 g Ni (NO 3 ) 2 6H 2 O and 0.7503 g Al (NO 3 ) 3 9H 2 O were added into the above FeWO 4 suspension and ultrasonicated for another 15 min.Subsequently, 2.4024 g urea and 0.592 g NH 4 F were dissolved into the mixed solution and stirred for 30 min.The acquired suspension was thermally treated in a 100 mL sealed Teflon-lined autoclave at 120 C for 24 h.The resulting precipitate was washed with water several times until the pH reached and dried in an oven at 60 C overnight.FeWO 4 /LDH photocatalysts with different mass ratios were obtained by changing the dosage of FeWO 4 , which were marked as 5 FeWO 4 /LDH, 10 FeWO 4 /LDH, 15 FeWO 4 /LDH, respectively.Furthermore, the original LDH was constructed by the same procedure without adding FeWO 4 . The X-ray diffraction (XRD) pattern was determined on a Bruker D8 powder diffractometer using Cu K radiation ( 0.154 nm) to analyze the crystalline structures of catalyst samples with scanning velocity of 0.02 /min.The scanning electron microscopy (SEM, S-4800) and transmission electron microscopy (TEM, Phillips Model, CM200) were used for analyzing the morphology of FeWO 4 /NiAl-LDH.The element distribution was determined by energy dispersive X-ray spectroscopy (EDX, Hitachi, S-4800).The N 2 adsorption-desorption, specific surface area, and pore structure of catalysts were detected by utilizing a Quantachrome device (Autosorb-iQ-AG).The optical properties were determined using UV-vis Diffuse Reflectance spectrum (UV-vis DRS, Shimadzu, UV3600), as well as photoluminescence spectrum on fluorescence spectrophotometer (PL, Hitachi, F-4600). The photoelectrochemical test of the photocatalysts was completed with reference to our previous work 35,36.The activity for CO photoreduction was measured at Labsolar-6A system (Perfect Light Co., China) using a 300 W Xenon-arc lamp with a 3 AM 1.5 G filter to simulate sunlight irradiation.50 mg of samples was added into the reactor in each experimental run.The acquired solution was vacuumtreated for 30 min under constantly stirring.Afterwards, the suspension was filled with CO 2 (99.999) at 100 kPa for 30 min to reach the equilibrium of adsorption-desorption. Apparent quantum yield (AQY) of the photocatalyst was calculated using the following equation 28."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The crystalline structure of FeWO 4 , LDH and their nanocomposites were detected by XRD, as displayed in Fig. 1.For the original LDH, the characteristic peaks observed at 1.58 correspond to (0 0 3), (0 0 6), (0 1 2), (0 1 5), (0 1 8), (1 1 0) and (1 1 3) crystal planes, separately, which belong to the hexagonal structure of LDH (JCPDF No. 22-0452).Similarly, for FeWO 4 , the positions of all diffraction peaks are in good agreement with JCPDF-0712390, which confirms that the wolframite group with a monoclinic crystal structure.Also, the sharp characteristic peaks, the stable baseline and no impurity phases manifest that FeWO 4 and LDH own good crystallinity.Besides, the peaks of FeWO 4 in as-prepared 5 FWLDH are extremely unapparent due to its low level.As the mass ratio of FeWO 4 increases, the peak strength in the binary composite FWLDH becomes stronger, demonstrating that more FeWO 4 coupling with LDH.It is a remarkable fact that two parts of diffraction peaks corresponding to FeWO 4 and LDH are observed in the case of binary composites FWLDH, which indicates that the direct Z-scheme FWLDH heterostructure has been triumphantly constructed. SEM and TEM were adopted to appraise the morphology and structure of the as-fabricated photocatalysts.As expected, the SEM images of pure LDH (Fig. 2a) exhibit flower-like sphere appearance composed of abundant ultrathin nanoflakes.According to Fig. 2b, the original FeWO 4 exhibits nanoparticle structure.Interestingly, in FWLDH nanocomposites, plenty of FeWO 4 nanoparticles grow well on the surface of LDH (Fig. 2c andd), which proves that the preparation of FWLDH by hydrothermal method is successful.TEM was applied to further study the micromorphology of the as-constructed catalysts.In Fig. 2e, it can be obviously seen that FeWO 4 nanoparticles are randomly decentralized on the surface of LDH flower-like sphere and faultlessly combine with LDH to constitute a heterostructure.It is important to note that the FWLDH heterostructure is not easily destroyed under experimental conditions, which is in favor of the interfacial charge transport in photocatalytic CO 2 reduction.High-resolution TEM (HR-TEM) was used to research the detailed crystal structure of the as-constructed materials.Fig. 2f exhibits that lattice fringes of 0.26 and 0.37 nm match to the (0 1 2) plane of NiAl-LDH and (0 1 1) plane of FeWO 4 , severally.The results mentioned above tally with the outcomes of XRD.These discoveries further certified that the direct Z-scheme FWLDH heterostructure has been triumphantly constructed. The chemical states of as-manufactured photocatalysts were analyzed by XPS spectra.The bias of peak positions was corrected by using the binding energy of C 1s at 284.8 eV before data processing.As can be observed from Fig. 3a, the peaks corresponding to Ni, Al, Fe, W and O elements appear in the survey XPS spectrum of the 10FWLDH material, manifesting the existence of FeWO 4 and LDH in the complex.For the original LDH, the Ni 2p spectrum (Fig. 3b) contains two peaks at the binding energies of 855.6 and 873.3 eV, matching to Ni 2p 3/2 and Ni 2p 1/2 , separately 26,28.This is in accordance with the Ni 2 oxidation state.Also, the attached satellite peaks manifest the existence of a highspin divalent state of Ni in the material 37,38.Moreover, the highresolution Al 2p spectrum (Fig. 3c) validates the presence of trivalent Al in the oxidized state in the pristine LDH.In the Fe 2p spectra (Fig. 3c), two primary peaks of 2p 3/2 and 2p 1/2 are observed, but there is no satellite peak, demonstrating that only Fe 2 exists 39.Likewise, in the W 4f spectrum (Fig. 3d), 4f 5/2 and 4f 7/2 present two characteristic peaks, illustrating the W is positive hexavalent 29,40,41.Fig. 3f exhibits that the peaks for O 1s situating at 531.2 eV match to the O 2-anion.For the FWLDH compound, the binding energies of Ni 2p 3/2 and Ni 2p 1/2 were prominently declined in comparison to pristine samples, while that of Fe 2p was slightly augmented.Nevertheless, the binding energies of W 4f and Al 2p in the materials do not change as described above.The variational binding energies of Ni 2p and Fe 2p indicate that a heterojunction has taken shape between FeWO 4 and LDH, suggesting that the formation of complex is not a simple physical mixing. The N 2 adsorption/desorption curves was performed to study the specific surface areas and porosity of the as-constructed materials.Fig. 4 reveals the typical N 2 adsorption/desorption isotherm of LDH, FeWO 4 and FWLDH composites.As demonstrated in Fig. 4, the N 2 sorption curves of the photocatalysts possess the typical feature of type IV with an obvious hysteresis loop, illustrating their mesoporous structure 424344. Furthermore, the insets in Fig. 4 manifest the pore size distribution of the as-synthesized samples.It is not difficult to find that the pores are primarily distributed within the scope of 10-40 nm, which tally with the mesoporous properties.The specific surface areas, pore diameter and pore volume are listed in Table 1.The specific surface area of pristine LDH and FeWO 4 are only 32.81 m 2 /g and 21.75 m 2 /g severally.The specific surface area of FWLDH photocatalysts first increases and then decreases with the increase of FeWO 4 content.When the proportion of FeWO 4 accounts for 10, the maximum value reaches up to 53.35 m 2 /g for that of FWLDH composites.This may be because part of the pores of the LDH are blocked, which is also consistent with the activity test results.The result shows that a close combination between LDH flowerlike spheres and FeWO 4 nanoflakes and the augmented specific surface area are auspicious for providing more active sites, thus heightening the photocatalytic performance for CO 2 reduction.The mesoporous properties also prompt the rapid dispersion of reactants and photocatalysts, sequentially, improving the reaction rate. The light response property and energy band structure of the fabricated materials were studied by UV-vis DRS.Pure FeWO 4 displays a strong absorption edge located at 700 nm (Fig. 5).Interestingly, primitive LDH mainly possesses three absorption peaks in the ultraviolet and visible regions, which are situated from 200 to 300 nm, 300 to 500 nm, and 550 to 800 nm, severally.The intrinsic absorption band in the ultraviolet region (200 to 300 nm) is caused by ligand-to-metal charge transfer (LMCT) from the O 2p orbit to the Ni 3d t 2g orbit, however, dd transitions are responsible for the bands from 300 to 800 nm, well matching to the feature of Ni 2 ions in an octahedron 45,46.The absorption bands situating at 380 and 740 nm are derived from d8 configuration of Ni 2 ions in an octahedral field, bringing about the spin-allowed transitions 3 A 2g (F) 3 T 1g (P) and 3 A 2g (F) 3 T 1g (F), severally.The other peaks situated at 420 and 645 nm belong to spinforbidden transitions 3 A 2g (F) 1 T 2g (D) and 3 A 2g (F) 1 E g (D), separately 28,47.When FeWO 4 is introduced into LDH, the absorption edge presents a slight red shift.As the proportion of FeWO 4 increasing, the absorption edge moves towards the longer wavelength, which is in keeping with the changing tendency of color (from light blue to dark gray).Peculiarly, the trend of all bands over FWLDH are akin to LDH and obvious strengthened absorption can be observed within the visible range, which may be caused by the strong reciprocity between FeWO 4 and LDH.Hence, boosting the visible light absorption capacity can supply more photogenerated carriers for photocatalytic reaction, thereby heightening the photocatalytic performance of CO 2 reduction.Furthermore, the band gap of FeWO 4 , LDH and 10FWLDH are calculated by Kubelka-Munk (KM) formula and the plots of (h) 1/n versus (h) 35.In this case, both LDH and FeWO 4 are indirect bandgap semiconductors, thus, the n value is 1/2.Thus, they are determined to be 1.95 eV, 2.67 eV and 2.07 eV, respectively.Besides, the AQY value obtained in this study is 0.17 at 420 nm. The PL technique can be employed to verify the carrier separation and transfer efficiency of light-induced e -and h over the FWLDH heterojunctions.As demonstrated in Fig. 6a, original LDH ownes three emission peaks.The peak at 400-450 nm has something to do with the band-to-band absorption peak of LDH and the peak at approximately 470 nm could be ascribed to the capture of charge in the form of excitons.However, the peak locating at 540 nm arises from the defect forming in the preparation process of LDH 25,48.Compared with the pristine LDH, the peak of FWLDH photocatalysts is not obvious at 470 nm, but the other two peaks show the characteristic absorption band similar to the prisitine LDH.However, the peak strengths of the complex are more feeble than the original LDH, manifesting the triumphant separation of e -and h .Apparently, the 10FWLDH material reveals the weakest PL emission strength, which is in accordance with its optimal photocatalytic performance. Moreover, the charge separation kinetics of the as-fabricated materials were studied by the time-resolved fluoresence decay spectra.The attenuation curves of original LDH and 10FWLDH nanomaterial are fitted with a double exponential attenuation function (Fig. 6b).The life () can be worked out through the coming equation 49: where, B1 and B2 represent the constants acquired after fitting the attenuation curve, 1 and 2 represent attenuation time, separately.The lifetime () of LDH is 4.58 ns, while that of 10FWLDH comples decreases to 1.70 ns, suggesting the photogenerated carriers are quickly trapped by the active sites over the 10FWLDH materials, which leads to the remarkable photocatalytic activities for CO 2 reduction.The results demonstrate the rapid separation and transfer of the carriers, which provides a strong support for the confirmation of the outstanding photocatalytic properties of the 10FWLDH complex. In order to further demonstrate that this system was effective for the separation of light-induced carriers, photoelectrochemical measurements were conducted.Fig. 7a displays regular photocurrent responses to the switching period.It should be noted that 10FWLDH nanocomposite exhibits the strongest photocurrent response compared with those of the pristine LDH because of the strong interaction between LDH and FeWO 4 , accordingly, the photogenerated carriers can be separated effectively at the interface.This is also confirmed by the electrochemical impedance spectra (EIS) experiment (Fig. 7b).The smaller the arc radius is, the smaller the resistance is, and correspondingly, the faster transfer rate of the light-generated e -and h will be 4,36,50.To all appearances, the 10FWLDH photocatalyst owns the smallest arc radius, which agrees with the consequences of above characterization. The photocatalytic properties of the fabricated FWLDH materials for CO 2 reduction were then investigated under visible light illumination.CO is confirmed as the sole product in the process of photocatalytic CO 2 reduction without any co-catalyst or sacrificial reagent (Fig. 8a).Nevertheless, owing to the water decomposition reaction, H 2 can also be detected.Besides, O 2 as the oxidation product is also detected (Fig. S1). A comparative experiment (Fig. S2) was carried out under the circumstance of no photocatalyst or light or CO 2 .It is confirmed that the acquired CO only derives from photocatalytic CO 2 reduction, and the above three factors are fundamental to CO 2 photoreduction.Fig. 8a compares the total CO yield over LDH, FeWO 4 and FWLDH photocatalysts.There is no evident CO generating on the pristine FeWO 4 , mainly because its CB position is lower than the reduction potential of CO 2 /CO (-0.53 V vs NHE).The yield of the original LDH only reaches up to 2.1 molg -1 h -1 , which is probably put down to the rapid recombination of e -and h .However, the production rate of CO over FWLDH photocatalysts is remarkably enhanced, indicating that the interaction between FeWO 4 nanoparticles and the surface of LDH flower-like sphere is conductive to boosting the CO 2 reduction activity.Meanwhile, the close contact also provides plenty of active sites for CO 2 photoreduction and accelerate the separation and transport of carriers.As the FeWO 4 content augments, the yield of CO presents a tendency of increasing first and then decreasing.The optimum value over 10 FWLDH photocatalyst exhibits about 2.4-fold enhancement in the yield of CO, reaching up to 5 molg -1 h -1 .When the proportion of FeWO 4 is further increased, the yield of CO will decrease, which may be attributed to the phenomenon of FeWO 4 agglomeration on the surface of LDH. As is known to all, the reusability of photocatalyst has always been a pivotal issue in practical application.In order to determine the stability of the FWLDH materials, three cycles of experiments were carried out under the same circumstances.The yield of CO over 10FWLDH photocatalyst is almost remained unchanged after continuous illumination for 21 h.After three cycles (Fig. 8b), there is a slight decrease, keeping almost 97 original activity.To further determine the real carbon source of the photocatalytic products, isotope tracer test involving photo-reduction of 13 CO 2 was carried out and detected by GC-MS.During the process of 13 CO 2 photoreduction (m/z 45) over 10 FWLDH for 7 h, 13 CO (m/z 29) product was detected by mass spectrometry analyisis (Fig. 8c).These consequences further confirm that the CO product indeed originates from CO 2 photoreduction. In order to understand the photocatalytic mechanism of CO 2 reduction over FWLDH materials, we analyzed its energy band structure with the values obtained from UV-vis DRS (Fig. 5b) and Mott-Schottky plots (Fig. S3).It can be clearly seen from the schematic diagram derived in Fig. 9 that the CB position of LDH is more negative than the reduction potential of CO (-0.53 V vs NHE), while that of FeWO 4 is more positive than the reduction potential of CO.Hence, LDH possesses more advantageous energy levels than FeWO 4 , as a suitable choice for the construction of heterostructure, which is favorable to the improvement of photocatalytic performance. Given the position of energy bands in LDH and FeWO 4 , there are two probable charge transfer modes: type-II heterostructure and direct Zscheme heterostructure.The traditional type-II heterostructure possesses a mode of band-to-band charge transfer, namely the electrons from the CB of LDH must be transported to the CB of FeWO 4 , whereas the holes are transferred from in the opposite direction, which is in contradiction with the results of CO yield and the band position of FeWO 4 .Moreover, Z-scheme mechanism may be also reasonable owing to the matched band structure.This pattern of effective charge separation can make the composite maintain a strong redox ability, so as to strengthen photocatalytic performance. According to the Fermi levels of the two kinds of catalysts (Fig. 10a), the situation of charge migration and separation happening in FWLDH can be put forward as follows.At the FWLDH interface, because the Fermi level of LDH is higher than that of FeWO 4 , electrons in the CB of LDH are inclined to move to FeWO 4 until the Fermi levels of the two components reach equilibrium (Fig. 10b).In consequence, band edges of LDH are constantly curved upward towards the interface, while those of FeWO 4 are curved downward towards the interface (Fig. 10c).Under the circumstances, the e -in the CB of FeWO 4 and h in the VB of LDH can easily move to the interface and recombine with each other, whereas the CB electrons of LDH and VB holes of FeWO 4 stay on the original position.Hence, the charge migration between LDH and FeWO 4 is a typical Zscheme mode. In order to further notarize the direct Z-scheme pattern, O 2 -and OH V vs NHE), and thus no O 2 -could be generated.However, O 2 -species are detected in the suspension of the 10FWLDH photocatalyst.These consequences are inconsistent with the type-II migration mechanism.On the contrary, on the basis of the direct Z-scheme mechanism, light-excited electrons at the CB of FeWO 4 easily move to the interface through the internal electric field and recombine with holes at the VB of LDH, thus efficiently separating the photogenerated carriers.What's more, photogenerated electrons and holes would accumulate on the more negative CB position of LDH and more positive VB position of FeWO 4 , severally.Therefore, the FWLDH photocatalyst possesses strong redox capacity in comparison to the single component.The consequences manifest that the signal of O 2 -and OH of the as-constructed 10FWLDH material is the strongest.Based on the EPR results and the energy band structures of 10FWLDH photocatalyst, a direct Zscheme mechanism can be proposed, as displayed in Fig. 9.The probable reaction progress during the photocatalytic CO 2 reduction over 10 FWLDH composite could be expressed by the following formula 515253: CO 2 2H 2e -CO H 2 O (6) The corresponding charge balance details are listed in Table S2."
  },
  {
    "title": "Conclusions",
    "content": "On the whole, direct Z-scheme FWLDH photocatalysts were manufactured by a simple hydrothermal process.The complex composites manifested satisfactory photocatalytic properties to selective reduction of CO 2 to CO in the absence of the sacrifice agent and co-catalyst.The photocatalytic performance for CO 2 reduction could be strengthened through combining FeWO 4 with LDH, among which, the optimum activity (10 FWLDH) exhibited the CO yield of 5 molg -1 h -1 , reaching 2.4 folds than original LDH, which could be ascribed to the introduced FeWO 4 that meliorate the structure of LDH flower-like sphere to form the homogeneous and compact interfacial contact.The dramatically facilitated photocatalytic properties of FWLDH composite was attributed to the direct Z-scheme charge transfer mode, which could be Fig. 10.The Z-scheme heterojunction of FWLDH.illuminated through radical trapping test.Direct Z-scheme heterostructure could be instrumental in separating photoinduced electrons and holes, in the meantime, retaining the reducibility of photoelectrons in the CB of LDH.The research provided a feasible strategy to ameliorate the catalytic properties of CO 2 photoreduction through constructing direct Z-scheme with visible-light response. Scheme 1. Flow chart for the preparation of NiAl-LDH/FeWO 4 (FWLDH). Fig. 1.XRD patterns of synthesized FeWO 4 , LDH and x-FeWO 4 /LDH (x 5, 10 and 20) photocatalysts. Fig. 2. SEM images of pristine LDH (a, b) and pristine FeWO 4 (c, d); TEM (e) and HR-TEM (f) images of 10 FeWO 4 /LDH. Fig. 3. XPS images of survey spectra (a), Ni (b), Al (c), Fe (d), W (e), O (f). Z.-d.Lin et al. Fig. 4. Nitrogen adsorption/desorption isotherms of the synthesized photocatalysts. Fig. 5. UV-vis DRS (a), curves of (h) 2 versus h of FeWO 4 , LDH and 10FWLDH (b). Fig. 6.PL spectra (a); time-resolved PL decay spectra of pure LDH and 10FWLDH photocatalysts (b). Fig. 7. Spectra of TPR (a); EIS (b). Fig. 8. CO evolution of pure LDH, pure FeWO 4 and FWLDH photocatalysts (a); Cycling experiments of photocatalytic CO 2 reduction over 10FWLDH (b); The GC-MS patterns of the produced CO over 10FWLDH using 13 CO 2 as the carbon source (c). Fig. 9. CO 2 reduction mechanism on FWLDH composites. Z.-d.Lin et al. generated in photocatalyst suspensions by using 5,5-dimethyl-1-pyrroline N-oxide (DMPO) were applied as a spin-trapping agent.The characteristic signals corresponding to the DMPO/O 2 -adduct can be visibly seen in methanol suspension of LDH and 10FWLDH (Fig. 11a), and the signals of DMPO/O 2 -for 10FWLDH is much stronger than that of original LDH.However, there is no significant DMPO/O 2 -signal under the situation of pure FeWO 4 .The signal of OH is also detected (Fig. 11b), whose relative intensities of 1:2:2:1 indicate that OH are available on FeWO 4 and 10FWLDH, while no EPR signal is detected on original LDH.Assuming that the conventional type-II heterostructure is reasonable, e -and h would accumulate at the CB position of FeWO 4 and the VB position of LDH, separately.Nevertheless, the CB edge of FeWO 4 (0.82 V vs NHE) is lower than the reduction potential of CO 2 /CO (-0.53 Fig. 11.EPR spectra of radical adducts trapped by DMPO (O 2 -and OH) in pure LDH and 10FWLDH composite in the dark and under visible light irradiation: in methanol dispersion for DMPO-O 2 -(a); in aqueous dispersion for DMPO-OH (b). , 23.18 , 35.01 , 39.41 , 46.70 , 60.94 and 62.26 Structural properties of the pure LDH, FeWO 4 and FWLDH composites. The study was financially supported by the National Key RD Program of China (2018YFB0605002) and the National Natural Science Foundation of China (21546014, 50616114). Zhi-dong Lin: Conceptualization, Methodology, Investigation.Ruitang Guo: Resources, Investigation, Validation, Data curation.Ye Yuan: Data curation.Xiang-yin Ji: Software, Formal analysis.Long-fei Hong: Validation, Formal analysis.Wei-guo Pan: Methodology, Supervision. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://doi. org/10.1016/j.apsusc.2021.150805."
  }
]