[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2018.12.028"
  },
  {
    "title": "Article_Title",
    "content": "Synergetic promotional effect of oxygen vacancy-rich ultrathin TiO2 and photochemical induced highly dispersed Pt for photoreduction of CO2 with H2O"
  },
  {
    "title": "Abstract",
    "content": "The ultrathin TiO 2 nanosheets (TiO 2 -U) with abundant defects were successfully fabricated as substrates to support well-dispersed Pt nanoparticles with low metal loading by photochemical route (P), with impregnated Pt/TiO 2 -U, Pt/TiO 2 -bulk and photoreduced Pt/TiO 2 -bulk as control samples, to focus on studying the inductive effect of oxygen vacancy-rich ultrathin TiO 2 on highly dispersed Pt nanoparticles, and their synergetic promotional effect for CO 2 photoreduction.As expected, P-Pt/TiO 2 -U exhibited excellent photocatalytic efficiency for the selective conversion of CO 2 into CH 4 and CO.The ultrathin TiO 2 nanosheets with a large number of low coordinative sites and ultralarge surface area promoted the rate of electron-transfer.The ultrafine Pt nanoparticles induced by photochemical strategy facilitated the efficient separation of electron-hole pairs.Furthermore, the synergy of metal and support improved the adsorption ability of CO 2 .These three factors were considered to drive jointly the enhancement of catalytic performance in this system.This work offers deep insights for the design of highly efficient catalysts with coordinatively unsaturated sites for CO 2 photoconversion in the presence of H 2 O."
  },
  {
    "title": "Experimental",
    "content": "Hydrochloroplatinic acid (H 2 PtCI 6 6H 2 O), sodium hydroxide (NaOH), hydrochloric acid, ethanol and commercial titanium dioxide (TiO 2 -B) were purchased from Aladdin.Titanium tetrachloride (TiCl 4 ), ethylene glycol (EG) were bought from Alfa Aesar.The water used in all experiments was deionized.All chemicals were used without further purification. The preparation of ultrathin TiO 2 was similar with the previous report by Wang et al. 36.In detail, 0.05 mmoL TiCl 4 and 30 mL EG were mixed and stirred until HCl disappears.Then, 1 mL water was added to the mixed solution, followed by aging at 150 C for 24 h in the stainless steel autoclave of 100 mL.The obtained white products were washed by ethanol, and dried at room temperature in vacuum oven.The obtained samples were denoted as TiO 2 -U. 2.3.Preparation of Pt/TiO 2 50 mg of the dried ultrathin TiO 2 or commercial TiO 2 (TiO 2 -B) was dispersed in 10 mL of aqueous solution containing 75 L H 2 PtCl 4 solution (18 mmol/L) under stirring for 30 min, and further treated with UV light for 10 min 35.The grey product was washed by water and dried in vacuum oven.The samples were denoted as P-Pt/TiO 2 -U and P-Pt/ TiO 2 -B, respectively.For comparison, TiO 2 -U and TiO 2 -B supported Pt catalysts with the same Pt content were prepared by the impregnation method followed by successive reduction at 450 C and denoted as I-Pt/ TiO 2 -U and I-Pt/TiO 2 -B. The patterns of X-ray diffraction (XRD) were collected using a Shimadzu XRD-600 X-ray powder diffractometer with Cu K ( 0.154 nm) as radiation source.Sample morphologies and particle sizes were measured using a JEOL-2100 F high-resolution transmission electron microscope (HRTEM).The thickness of samples were examined using a Digital Instruments Version 6.12 atomic force microscope (AFM).Brunauer-Emmett-Teller (BET) method was employed to calculate the surface area of the samples using a Micromertics Gemini VII2990 instrument with N 2 as the adsorbate at 77 K.The loading of active metal was detected by a Shimadzu ICPS-7500 inductively coupled plasma emission spectrometer (ICP-AES).The ultraviolet-visible diffuse reflection absorption spectra (UV-vis) were collected by an UV-vis spectrometer (PGENER-AL TU-1901, Beijing) with BaSO 4 as a reference.To investigate the concentration/type of oxygen vacancies, positron annihilation spectroscopy (PAS) using a fast-slow coincidence ORTEC system (a time resolution of 187 ps for the full width at half maximum) and Raman measurements excited at 532 nm laser were conducted.The photo-luminescence (PL) spectra were identified on a fluorescence spectrometer (Shimadzu; UV-3600).The electronic structure of the compositions on the surface of catalysts was tested by a Thermo VG ESCALAB 250 spectrometer (Al K anode) with C1s (284.6 eV) as calibration peak.Electron spin resonance spectra (ESR) were collected on a JEOL JES-FA200 spectrometer at 90 K.In situ Fourier Transform Infrared (FTIR) spectroscopy of CO and CO 2 were recorded on a Bruker Tensor 27 instrument.Prior to experiments, the samples were pre-treated in He at 100 C for 60 min, followed by recording a background with a resolution of 4 cm -1 .For in situ FTIR of CO, the catalysts were exposed to CO flow for 30 min and collected the spectra under the different pressure.For in situ FTIR of CO 2 , CO 2 was first purged under dark.Then, the catalysts were irradiated under UV-vis light (380-800 nm) for 30 min and recorded the spectra.In the term of FT-IR for CO 2 reacted with H 2 O, CO 2 flow with H 2 O vapor were inlet under dark, followed by recording a background with a resolution of 4 cm -1 .Then, the sample was irradiated with UV-vis light, and the spectrum was recorded. The reaction was conducted in a custom-made gas phase reactor (50 cm 3 of chamber volume; quartz window on the top of chamber) in Fig. S1. 10 mg of samples were spread in the chamber with 0.08 MPa CO 2 (Beijing Beiwen Gas Comp.99.999).Water vapor was added to the chamber through CO 2 bubbling.Light was irradiated using a 300 W Xe lamp as the light source.The isotope-labeled experiments were carried out using 13 CO 2 , the amount of products (CH 4 , CO and H 2 ) was analyzed using gas chromatograph (Shimadzu; GC-2014C) equipped with thermal conductivity detector (TCD) and flame ionization detector (FID)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Ultrathin TiO 2 nanosheets were fabricated with the commercial TiO 2 as reference.As shown in XRD patterns (Fig. 1), the main reflections detected in commercial TiO 2 are indexed as (101), ( 004), ( 200), ( 105) and (204) planes, showing a typical anatase TiO 2 phase in line with JCPDS 21-1272.Different from the anatase, the peaks of the TiO 2 nanosheets correspond to (110), ( 002) and (020), which are consistent with the ultrathin materials in reference 36 (space group C2/m, JCPDS 74-1940).It is worth noting that much intense diffraction peak of (020) is observed relative to that of (110), suggesting that this facet is preferentially exposed 35.Additionally, no other peaks are observed, indicating that this material is highly pure.The lattice parameters are further calculated using Rietveld refinement, and the values of lattice parameters are listed in Table 1.To better understand the morphology of ultrathin nanosheets, electron microscopy (SEM and HRTEM) was employed.From the images in Fig. 1 and Fig. S2, the structure of ultrathin TiO 2 is observed to be in sheet-like and the lateral size is 30-50 nm, while the commercial samples exhibit hexagonal particle shape with a larger particle size (50-200 nm).Considering that the thickness of samples can not be accurately measured by electron microscopy, we further used AFM analysis to obtain the relative information in several different zones.For the TiO 2 nanosheets, the platelet thickness is ca.0.8 nm roughly equal to the thickness of two atomic layers, while the bulk TiO 2 shows a larger value of 6.8 nm in thickness.Combined with the above characterization, this data affirm the successful synthesis of two-atom-thick ultrathin TiO 2 .The curves of N 2 adsorption/desorption in Fig. S2 for both of materials are consistent with the type IV isotherm, depicting the adsorption of micropores and mesopores with pore size of 3-20 nm.Surprisingly, the specific surface area of ultrathin TiO 2 is estimated to be 473 m 2 g -1 , 26-fold larger than that of bulk TiO 2 (18 m 2 g -1 ).The higher surface area is expected to favor the dispersion of active metal and the adsorption of reactant molecules, benefiting the enhanced photocatalytic activity 37. It is well documented that ultrathin nanosheets possess different properties such as atom arrangements and surface defects 38,39, which are investigated using XPS analysis.The peaks at 458.2 and 464.0 eV are ascribed to Ti 4 , whereas the peaks at 457.2 and 463.0 eV are assigned to Ti 3 .As shown in the Ti 2p XPS spectra (Fig. 2A), the main valence of Ti element in the bulk is 4, while the ultrathin TiO 2 exhibits higher content of Ti 3 , the formation of which is in proportion to the oxygen vacancies.This indicates a larger number of defects in the ultrathin TiO 2 .After introducing UV light for 10 min, the ratio of Ti 3 / Fig. 1.SEM image of (A) ultrathin TiO 2 nanosheets and (B) bulk TiO 2 ; (C) XRD patterns; HRTEM image of (D, E) ultrathin TiO 2 nanosheets and (G, H) bulk TiO 2 ; AFM images of (F) ultrathin TiO 2 nanosheets and (I) bulk TiO 2 .Ti 4 (Table 1) obviously rise for both ultrathin and bulk TiO 2 , suggesting that more electrons are generated under light and trapped in Ti 3d orbitals to form Ti 3 sites 40, but the ratio of Ti 3 /Ti 4 in former is always larger than latter. ESR analysis is a powerful technique to detect and study the materials with unpaired electrons.The surface oxygen vacancies have two electrons (Vo) or no electron (Vo), which don't show any signals in ESR analysis.Under the certain conditions, the oxygen atoms were removed, leaving two electrons in per oxygen vacancy, some of which were captured by Ti-3d orbitals of the neighboring Ti atoms to form Ti 3 species 41.As a result, the existence of Ti 3 can verify the formation of surface oxygen vacancies indirectly.Fig. 2B shows the spectra of ESR over the four materials.It can be seen that the dominated peak at g 1.996 in all the samples matches perfectly with the Ti 3 specie 42.In accordance with above results, the intensity of the peak in ultrathin TiO 2 is much higher than that of bulk TiO 2 , suggesting the ultrathin material possesses the abundant surface vacancies.After UV-vis irradiation ( 400 nm), the signal intensity of both TiO 2 materials significantly increase, indicating the improved concentration of vacancies.The other small peaks in the ultrathin TiO 2 are assigned to EG radicals (HOCH 2 CHOH), appearing after UV-vis irradiation, which originates from that the holes generated on TiO 2 nanosheets broke the bonds between glycolate and TiO 2 43.This observation was also found by Wang et al. 36 who fabricated the ultrathin TiO 2 using EG, further confirmed the stability of EG radicals by TG measurement.A similar stability is also confirmed to exist in our system (Fig. S3). To further quantitatively achieve the size, type ( 1 , 2 and 3 ) and relative density (I 1 , I 2 and I 3 ) of various unsaturated sites, namely defects, PAS as a powerful tool to study defects in solids was carried out, and the values for the pure TiO 2 are listed in Table 2.The shortest-lived one ( 1 ) arises from smaller monovacancies in the bulk section (such as oxygen vacancy) 44,45.The intermediate components is ascribed to positrons captured by the larger vacancy-type defects such as the Ti 3 -oxygen vacancy associates on the surface.Such defect type can serve as the center for trapping positron, and the low electron density The parameters of lattice, surface area and pore structure of TiO 2 supports.reduces the positrons annihilation rate, leading to increase of the lifetime relative to the 1 46,47.The longest component ( 3 ) is attributed to the annihilation of ortho-positronium atoms in the large voids in nanoscale 48,49. Well-know that surface defects not only serve as the sites for adsorbing charge, but also as the traps for capturing carrier, which migrate to the adsorbed species, and consequently limit the electrons and holes recombination 50, while defects in the bulk only act as capture centers for the photogenerated carriers where electrons and holes recombine 51.Consequently, increasing the surface defects is helpful to enhance the efficiency for photocatalysis.The relative intensities of the positron lifetimes determine the information about the concentration of these defects.In our study, the ratio of I 2 (surface defects)/I 1 (bulk defects) of TiO 2 -U (1.77) is higher than that of TiO 2 -B (1.65), reflecting the higher proportion of the surface Ti 3 -oxygen vacancy in the ultrathin TiO 2 , which appears to be favor to the electron-transfer rate.A possible structure of coordinatively unsaturated ultrathin TiO 2 nanosheets is shown in Fig. 2C. TiO 2 with thicknesses approaching atomic scales play a determinant role in the dispersion and stabilization of active metal nanoparticles as it possesses the abundant defects and large surface area.Once exposed to UV, electron-hole pairs were generated, in which electrons were captured in Ti-3d orbitals to generate Ti 3 species, and holes contributed to the eOCH 2 CHOH formation, confirmed by XPS and ESR.Herein, we employed the ultrathin TiO 2 covered by deprotonated EG as support, and intelligently combined with photoreduction as preparation method to fabricate the ultrafine Pt nanoparticles.As shown in Fig. 3 and Fig. S4, the morphology for the ultrathin TiO 2 nanosheets is well preserved after the incorporation of active species.200 particles in different regions (Fig. 3 insets) are randomly selected to measure the mean size and distribution.For photoreduced Pt/TiO 2 -U, the average size is found to be 1.1 nm, which is smaller than those of photoreduced Pt/TiO 2 -B (3.9 nm), impregnated Pt/TiO 2 -U (3.0 nm) and Pt/TiO 2 -B (5.6 nm).Additionally, the metal dispersion of all catalysts was surveyed by CO-chemisorption, although the adsorption of CO on Pt atoms is complicate and controversial.But the dispersion trend of all catalysts (Table S1) in the sequence of P-Pt/TiO 2 -U I-Pt/TiO 2 -U P-Pt/ TiO 2 -B I-Pt/TiO 2 -B is consistent with HRTEM analysis, demonstrating the Pt nanoparticles on the ultrathin TiO 2 is well-dispersed induced by photochemical strategy.Two drives should be responsible for the ultrafine particle size.In the process of preparation (Fig. 3G), UV light-induced EG radicals on TiO 2 nanosheets facilitates to remove the Cl -on Pt precursor and form the Pt-O bonds, and thus highly stable dispersed Pt nanoparticles are achieved.Besides, the ultralarge surface area of TiO 2 is also a critical factor for preparing ultrafine Pt catalysts 52. The IR spectra were determined with CO as adsorbed molecule to , corresponding to the bridged bound CO and linearly coordinated CO on the Pt surface 53.The decrease in the particle size of I-Pt/TiO 2 -U and P-Pt/TiO 2 -U lead to the increase of band intensity originated from the linear adsorbed CO at the expense of the bridged CO band, accompanied with the appearance of band at 2090 cm -1 assigned to CO adsorbed on Pt terrace atoms.Summarizing the above results, it is concluded that the introduction of ultrathin TiO 2 and photochemical strategy facilitate to generate the largest number of Pt terrace atoms in the P-Pt/TiO 2 -U catalyst.To investigate qualitatively and quantitatively the defects contained in Pt catalysts, PAS was also carried out over the catalysts, and the values are listed in the Table 2. The intensity ratio of I 2 /I 1 for P-Pt/TiO 2 -U catalyst is 2.10, higher than that of others, illustrating the predominance of large size defects (such as terrace-like defect and boundary-like defects) in the ultrathin TiO 2 supported Pt catalysts 27,45, in agreement with the IR data.It is wellknown the low-coordinative sites are easier to activate the reactants, and act as trap centres for electrons, facilitating the photocatalytic CO 2 reduction. The photocatalytic CO 2 reduction under UV light irradiation was employed to evaluate the catalytic behavior of ultrathin TiO 2 supported Pt catalysts derived by photochemical strategy, with I-Pt/TiO 2 -U, P-Pt/ TiO 2 -B and I-Pt/TiO 2 -B as control samples.The Pt contents of catalysts derived from ICP measurement (Table S1) are lower than theoretical value (0.5 wt.) but in the error range.Fig. 5A and B illustrate the plot of CO and CH 4 moles over six samples versus reaction time.The amounts for both products linearly increase as the function of the time, confirming that this formation process of products proceeds in a steady-state manner rather than a transient manner.This similar phenomenon is reported by Wang et al. 7.At the reaction time of 10 h, pure bulk and ultrathin TiO 2 supports produce CO as the major product with amounts of 1.5 and 4.4 mol, respectively.Upon introducing Pt nanoparticles on the bulk TiO 2 , the product distributions of samples exhibit the differences.The amount of CH 4 improves from 0.3 mol (TiO 2 -B) to ca. 5.0 mol (I-Pt/TiO 2 -B and P-Pt/TiO 2 -B).When the ultrathin TiO 2 is used to support active metal, the amount of CH 4 further dramatically increases to 47.0 mol over P-Pt/TiO 2 -U.The formation rate of CH 4 (Fig. 5D) is as follows: P-Pt/TiO 2 -U (66.4 mol g -1 h -1 ) I-Pt/TiO 2 -U (10.0 mol g -1 h -1 ) P-Pt/TiO 2 -B (5.5 mol g -1 h -1 ) I-Pt/TiO 2 -B (5.0 mol g -1 h -1 ), in pace with the decrease of Pt particle size, which may contribute to the efficient electron-hole separation.Except for the formation of CH 4 , CO with 54.2 mol g -1 h -1 of the formation rate is also observed over the P-Pt/TiO 2 -U.To track the carbon sources of products including CH 4 and CO, we further performed 13 C isotopic label experiment.Fig. 5C displays the mass spectra of CH 4 and CO using 13 CO 2 in place of 12 CO 2 over P-Pt/TiO 2 -U under same reaction conditions.The peaks at m/z 29 and m/z 17 associated with 13 CO and 13 CH 4 suggest that the origins of CH 4 and CO are indeed produced from the reactant CO 2 54.Moreover, we also observed the peaks at m/z 16 and 15, which may be related to the fragment ions from 13 CH 4 55 or 12 CH 4 (EG) and its corresponding fragment ions.To rule out the contribution of ethylene glycol on the formation CO or CH 4 in the reaction, the thermogravimetric analysis was performed over both fresh and used P-Pt/TiO 2 -U catalysts (Fig. S3).As expected, the loss weight of used catalyst (15) is basically consistent with that of fresh catalyst (14), suggesting that EG on the surface of TiO 2 -U is stable in the reaction, and thus confirm the detected CO or CH 4 formation through CO 2 reactant, instead of the ethylene glycol.According to the definition of the selectivity for CO 2 reduction in the previous references 7 (Selectivity for CO 2 reduction () 2 r (CO) 8 (CH 4 ) / 2 r (CO) 8 (CH 4 ) 2 (H 2 ) 100), 95.9 of selectivity is obtained for P-Pt/TiO 2 -U, indicating only a small amount of by-product hydrogen exists.Such low hydrogen content suggests the H 2 evolution from H 2 O reduction has been inhibited in a great extent, which is because that the most of active hydrogen are directly utilized to generate the CH 4 or CO owing to a high degree of separation of electrons and protons to avoid the H 2 production.To further analyze the efficiency of reduction, the total electronic yield described by Y e is calculated involving all reductive products as following: Y e 2 r (CO) 8 r (CH 4 ) 2(H 2 ), where r is the formation rate of the corresponding products.666.6 mol g -1 h -1 of total electronic yield over P-Pt/TiO 2 -U is more than 4 times higher than that of other catalysts (Table 3).The excellent efficiency of CO 2 reduction compares well with the activities of some widely used semiconductors for the photoreduction of CO 2 (Table S2).Furthermore, the reusability of P-Pt/TiO 2 -U catalyst is performed.After 10 h time on stream, the reaction gases in the system was exhausted, and reactants was inlet again (Fig. 5E).No prominent change of the activity is observed in the second and third runs. To give an insight into the nature of the excellent photocatalytic activity of ultrathin TiO 2 supported highly dispersed Pt nanoparticles, UV-vis diffuse reflectance spectra was exploited as a powerful technique to investigate the abilities of light absorption.As displayed in Fig. 6, the bare bulk TiO 2 exhibits the absorption edge at 380 nm with band gap energy of 3.2 eV, implying that the only absorption is in UV region 56,57, while an effective shift of the absorption range to the visible light of 400 nm is noticed for the ultrathin TiO 2 .After supporting active Pt metal, the absorptions of catalysts are estimated to be in the range of 400-520 nm, in which Pt/TiO 2 -U prepared by photoreduction possesses the maximum value (ca.513 nm) of absorption edge, indicating the large capability of photoexcited charges 58. Furthermore, the electronic structure of Pt nanoparticles was analysed by XPS measurement.The collected Pt 4f XPS spectra shown in Fig. 7A contains two peaks at 70.7 eV (Pt 4f 7/2 ) and 74.1 eV (4f 5/2 ) attributed to the Pt 59.For the I-Pt/TiO 2 -B, the peaks of Ptslightly shift to lower binding energy (BE) by approximately 0.3 eV compared to the monometallic Pt catalyst in the literatures 60, suggesting the electron transfer from TiO 2 to Pt nanoparticle.When the ultrathin TiO 2 is used to support Pt atoms, a further shift towards lower energy is noticed due to more Ti 3 species detected in the ultrathin TiO 2 61.Additionally, the change in electronic environment is also related to the size effect 62.In terms of size effect, the Pt4f 7/2 peak in the case of P- Pt/TiO 2 -U catalyst with smallest metal particle size should be positively shifted.However, it shifts to lower BE by about 0.4 eV compared to the P-Pt/TiO 2 -B catalyst resulting from the stronger interaction between the TiO 2 and Pt nanoparticles which offsets the size effect.Along with the shift in Ti 2p XPS (Fig. 7B), we conclude that the electron indeed transfer from TiO 2 to the metals centres, which further affect the efficiency of photoreduction. To confirm the claim, the ability of electron-hole recombination in the samples was also revealed by the photoluminescence (PL) emission spectra.A band at 470 nm for all the samples is observed, associated with the surface oxygen vacancies.Relative to the bulk TiO 2 , the intensity of band over ultrathin TiO 2 slightly decrease (Fig. 7C).Upon Pt nanoparticles are deposited on the supports, the further reduction is obtained.These observations reveal a recombination rate of charge carrier 63, explained by the transfer of photogenerated electrons to the metals centres.It is worth noting that the Pt/TiO 2 -U catalysts reduced by photochemical strategy with ultrafine Pt nanoparticles are more efficient to separate the electrons from holes compared with other 65.Additionally, due to the electron transfer between Pt nanoparticles and TiO 2 , a fast decay in the short-live lifetime scale is observed in the Pt catalysts (Table S3), which corresponds well to XPS result. Except for the separation of electron-hole pairs, the adsorption and activation of the stable CO 2 molecules are also a vital issue for enhancing CO 2 reduction efficiency 66.By analysing the results of CO 2 chemisorption (Table 3), it is noted that the amount of chemisorbed CO 2 on ultrathin TiO 2 is higher than bulk TiO 2 and the corresponding supported Pt catalysts, indicating that the ultralarge surface area, abundant defects and the EG-functionalized surface can markedly improve the adsorption of CO 2 on the surfaces of samples.The maximum adsorption capability over P-Pt/TiO 2 -U is estimated to be 52.2 mol g -1 , higher in comparison of the others, illustrating the Pt catalysts with low-coordinative sites give a further enhancement of adsorption ability. To verify the role of the sites in Pt catalysts on the adsorption and activation of CO 2 , in situ FTIR of CO 2 photoreduction were conducted on defect-poor TiO ) at 1423 and 1221 cm -1 67.Moreover, the CO 2 -intermediates at 1681 cm -1 bonded with Ti 4 of supports is also noticed, demonstrating that CO 2 can be trapped at Ti 3 sites 68.Similar CO 2 adsorption species are also observed at the catalysts.However, the band locations of HCO Summarizing the above results, a possible mechanism of ultrathin TiO 2 and highly dispersed Pt nanoparticles for accelerating the efficiency of photoreduction of CO 2 is proposed in Fig. 10.CO 2 is chemisorbed on the Pt catalysts in the manner of bent CO 2 -, bicarbonate and carbonates, the reactivity of which is considered to be higher than that of the linear adsorbed CO 2 .The generated electrons by UV irradiation on ultrathin TiO 2 are easily trapped by the highly dispersed Pt nanoparticles with the terrace owing to the low level of Fermi energy.This electron-rich Pt nanoparticles allow the reduction of CO 2 to produce CH 4 .On the other hand, considering the abundant defects (Ti 3 -V o ) of ultrathin TiO 2 are formed, which are favourable to adsorb the reactants and inhibit the photoinduced charge recombination, the ultrathin TiO 2 may be also considered as the reactive sites to produce CO."
  },
  {
    "title": "Conclusions",
    "content": "Overall, ultrathin TiO 2 nanosheets with thicknesses of the two atomic layers supported the highly stable dispersed Pt catalysts have been synthesized using facile photochemical routes, with I-Pt/TiO 2 -U, P-Pt/TiO 2 -B and I-Pt/TiO 2 -B as control samples, to develop the efficient photocatalysts for the reduction of CO 2 with H 2 O.The two-atoms-thick TiO 2 nanosheets were firstly confirmed by HRTEM and AFM.The results of XPS, PAS and ESR further provided the evidence that as the thickness of TiO 2 decreasing defects were created, facilitating the high dispersion of active metal.As expected, the ultrathin TiO 2 supported well-dispersed Pt nanoparticles exhibited excellent photocatalytic activity for the conversion of CO 2 into CH 4 and CO with 666.6 mol g -1 h - 1 of total electronic yield in the presence of water vapour.More importantly, after three cycling tests, this sample also showed superior operational stability.This enhanced performance was attributed to the following factors: (1) the ultrathin TiO 2 nanosheets with abundant defects and ultralarge surface area promoted the rate of electrontransfer; (2) the ultrafine Pt nanoparticles facilitated to the separation of photogenerated electrons-holes, and thus improved the light-harvesting capacity and quantum efficiency based on the analysis of XPS, PAS, CO-IR, UV-vis DRS and PL spectroscopy; (3) the synergy of metal and support improved the adsorption ability of CO 2 .This work offers deep insights for the design of highly efficient catalysts with coordinatively unsaturated sites for CO 2 photoconversion in the presence of H 2 O. Fig. 2. (A) XPS spectra (B) ESR spectra of the ultrathin TiO 2 nanosheets and bulk TiO 2 before and after UV irradiation; (C) Scheme of coordinatively unsaturated ultrathin TiO 2 nanosheets. Fig. 3. (A-C) HRTEM images and STEM-HAADF-mapping of P-Pt/TiO 2 -U; HRTEM images of (D) I-Pt/TiO 2 -U, (E) P-Pt/TiO 2 -B, (F) I-Pt/TiO 2 -B.The insets show histograms of the particle size frequency distribution.(G) The mechanism of the dispersion of Pt nanoparticles induced by EG radicals. Fig. 4. CO-FTIR spectra of Pt catalysts under the decreasing pressure. Fig. 5. Plots of (A) CO (B) CH 4 amount versus reaction time over (a) TiO 2 -B, (b) TiO 2 -U, (c) P-Pt/TiO 2 -B, (d) P-Pt/TiO 2 -U, (e) I-Pt/TiO 2 -B and (f) I-Pt/TiO 2 -U in the photocatalytic conversion of CO 2 in the presence of water vapor under UV light; (C) Mass spectra of 13 CH 4 (m/z 17, 16 and 15) and 13 CO (m/z 29) produced over P-Pt/TiO 2 -U in photocatalytic reduction of 13 CO 2 ; (D) photocatalytic CO and CH 4 evolution rates over (a) TiO 2 -B, (b) TiO 2 -U, (c) P-Pt/TiO 2 -B, (d) P-Pt/TiO 2 -U, (e) I-Pt/TiO 2 -B and (f) I-Pt/TiO 2 -U; (E) reusability of P-Pt/TiO 2 -U. Fig. 6. (A) UV-vis DRS analysis; (B) Plot of (ahv) 1/2 versus photon energy (eV) of absorbed light for the calculation of band gap energy of all the samples. Fig. 7. (A) XPS Pt 4f spectra and (B) XPS Ti 2p spectra of Pt catalysts; (C) PL spectra under 365 nm excitation; (D) Fluorescence lifetime of all the photocatalysts. Fig. 8.In situ FTIR spectra of CO 2 under dark and UV irradiation over (A) I-Pt/U-TiO 2 -B, (B) P-Pt/U-TiO 2 -B, (C) I-Pt/U-TiO 2 -U and (D) P-Pt/U-TiO 2 -U. Fig. 9.In situ FTIR spectra of CO 2 with H 2 O under dark and UV irradiation over (A) I-Pt/U-TiO 2 -B, (B) P-Pt/U-TiO 2 -B, (C) I-Pt/U-TiO 2 -U and (D) P-Pt/U-TiO 2 -U. 2 -B supported Pt catalysts and defect-rich TiO 2 -U supported Pt catalysts.As shown in the Fig. 8, in the dark, the exposure of CO 2 on the surface of I-Pt/TiO 2 -B results in the generation of bidentate carbonate (b-CO 3 2-) at 1602-1643 and 1343 cm -1 , monodentate carbonate (m-CO 3 2-) at 1558 and 1454 cm -1 , and bicarbonate (HCO 3 - The exposure of four Pt catalysts to CO 2 with H 2 O vapour in the dark contributes to the dominant features of strongly adsorbed H 2 O at 1640 cm -1 with relative weak bicarbonate (HCO 3 -) at 1425 cm -1 , bidentate carbonates (b-CO 3 2-) at 1626 and 1320-1360 cm -1 as well as monodentate carbonates (m-CO 3 2-) at 1500 -1570 cm -1 .This depicts that the adsorption of H 2 O competes with CO 2 on the surface of catalysts.When the UV irradiation is introduced, no obvious change for the features of CO 2 intermediates and H 2 O-related species is seen on the I-Pt/U-TiO 2 -B and P-Pt/U-TiO 2 -B in comparison with those in the dark, even prolong the time of illumination to 30 min, accounting for the low reaction rate.As expected, significantly different results are observed on the I-Pt/TiO 2 -U and P-Pt/TiO 2 -U, in which CO 2 -species are formed and the intensity of CO 2 intermediates including the carbonates and bicarbonate decreases, indicating the effective activation of CO 2 and H 2 O on the ultrathin TiO 2 supported Pt catalysts. Fig. 10.Possible mechanisms of the ultrathin TiO 2 supported highly dispersed Pt nanoparticles for photoreduction of CO 2 with H 2 O vapour. Positron lifetime and relative intensities of samples. Catalytic performances of TiO 2 supports and the corresponding Pt catalysts in the photoreduction of CO 2 with H 2 O. 69vation and dissociation of CO 2 on catalysts under UV light69.Furthermore, in situ DRIFTS spectra of CO 2 with H 2 O were shown in 3-are slightly different.Relative to the impregnated Pt/TiO 2 -B and Pt/TiO 2 -U as well as photoreduced Pt/TiO 2 -B, the normalized peak area of CO 2 intermediates is much larger on P-Pt/TiO 2 -U, revealing that CO 2 can be easily adsorbed and activated.Upon subsequent photoillumination, an increase of peak associated with CO 2 intermediates suggests that photoillumination significantly enhances the ability of This work was supported by National Natural Science Foundation, National Key Research and Development Program of China (2016YFB0301601), and the Fundamental Research Funds for the Central Universities (BHYC1701B, JD1816) Appendix A. Supplementary data Supplementary material related to this article can be found, in the online version, at doi:https://doi.org/10.1016/j.apcatb.2018.12.028."
  }
]