[
  {
    "title": "Doi",
    "content": "10.1039/x0xx00000x."
  },
  {
    "title": "Article_Title",
    "content": "Interface engineering on Janus Pd-Au heterojunction co-catalysts for selective photocatalytic reduction of CO 2 to CH 4 †"
  },
  {
    "title": "Abstract",
    "content": "Photocatalytic reduction of CO 2 to renewable fuels offers opportunities for long-term energy storage and environmental protection.However, the lack of highly active and selective catalysts impedes the applications of this reaction.Here, Janus Pd-Au heterojunctions are proposed as advanced co-catalysts for the conversion of CO 2 to CH 4 , which achieve an unprecedented average CH 4 production rate of 48.2 mol g cat -1 h -1 with a high selectivity of 91.4.The experimental results indicate that the interfaces between Pd and Au play multiple roles in the enhancement of CO 2 -to-CH 4 conversion:(1) Au atoms around the interface provide the sites for the reduction of CO 2 to CO intermediates and then to CH 4 ; (2) H intermediates are produced on adjacent Pd atoms on the other side of the interface, which further accelerate the ratelimiting process in conversion of CO to CH 4 ; (3) charge re-distribution through the Pd-Au interface leads to substantial suppression of H 2 and CO evolution on electron-deficient Pd and electron-rich Au, respectively.This work provides fresh insights into the rational interface design of high-performance bimetallic co-catalysts for selective CO 2 photoreduction."
  },
  {
    "title": "Experimental",
    "content": "In a typical synthesis of TiO 2 -Pd, PVP (MW 55,000, 105 mg), ascorbic acid (60 mg) and KBr (300 mg) were dissolved in 8 mL of water containing 160 mg of TiO 2 nanosheets.The reaction mixture was transferred into a 50-mL three-neck flask, which was then preheated under magnetic stirring at 80 C for 10 min.Subsequently, a 3.0 mL of aqueous solution containing K 2 PdCl 4 (32.0 mg) was added into the flask, and the reaction was allowed to proceed at 80 C for 3 h.The product was collected via centrifugation, washed with water for four times, and dried at 45 C in a vacuum. In a typical synthesis, 20 mg of TiO 2 -Pd (containing 1.25 mg of Pd) was dissolved in a mixed solution of 40 mL of H 2 O/ethanol mixture (1 : 1 volume ratio).Then 1200 L of aqueous solution of HAuCl 4 (10 mM in water) was added and the mixture was further sonicated for 10 min.The mixture was left undisturbed at 25 C for 12 h in the dark, the resultant product was separated by centrifugation, washed with water for four times, and dried at 45 C in a vacuum.The asobtained sample was named as TiO 2 -Pd-Au.TiO 2 -Pd-Au samples with lower and higher loading amounts of Au were synthesized under the same experimental condition as TiO 2 -Pd-Au except that different amounts of HAuCl 4 were used, including 400 L of HAuCl 4 aqueous solution for the TiO 2 -Pd-Au-L with a lower loading amount of Au and 3600 L of HAuCl 4 aqueous solution for the TiO 2 -Pd-Au-H with a higher loading amount of Au, respectively. To investigate the photocatalytic activities of TiO 2 -based photocatalysts for CO 2 reduction, the photocatalysts were first baked in a vacuum oven at 180 C for 2 h to remove possible carbonaceous residues prior to tests.Then, 15 mg of photocatalyst was dispersed on the flat glass plate at the bottom of a 100 mL photocatalytic reactor (Beijing Perfectlight, China).And 5 mL H 2 O was added and surrounded the plate.Prior to the test, the reactor loaded with catalyst was first purged with high purity CO 2 (0.15 MPa) for 20 min.Then the light-irradiation experiment was performed by using a 300 W Xe lamp (PLS-SXE 300, Beijing Perfectlight, China) with UV light as the illumination source.The power density of UV light ( 420 nm) was measured to be 2.7 mW cm -2 .The photocatalytic reaction was performed under UV light irradiation with stirring at 300 rpm for 4 h.After completion of the reaction, the gaseous mixture was analyzed using a gas chromatograph (GC-2014, Shimadzu) with Ar as the carrier gas.The amounts of H 2 and O 2 were determined using a thermal conductivity detector (TCD).The amount of CH 4 was measured by using a flame ionization detector (FID).And the amount of CO was converted to CH 4 by using a methanation reactor and then analyzed by using the FID.After the reaction was completed, the sample was collected via the centrifugation at 8000 rpm for 5 min.During the stability test, the photocatalysts were collected and heat-treated at 160 C for 3 h after each run and then reused for CO 2 photoreduction.The samples were also tested in 0.15 MPa fresh Ar in the absence of CO 2 but in the presence of H 2 O, which showed no activity to generate carbon products and thus confirmed that our measurements were free of any carbon contaminants. The isotope-labeled experiments were performed using 13 CO 2 instead of 12 CO 2 , and the products were analyzed using gas chromatography-mass spectrometry (7890B/5977A, Agilent)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "As a proof-of-concept demonstration, TiO 2 , the most frequently and thoroughly studied photoactive material, is used as a UV-excitable semiconductor model to support Pd-Au co-catalysts (Fig. 1a).TiO 2 nanosheets with an edge length larger than 100 nm and a thickness below 10 nm are firstly prepared according to previous report (Fig. S1a,b), 34 which are in anatase phase (JCPDS No. 21-1272) and exposed with dominant (001) facet according to the XRD pattern and HRTEM image results, respectively (Fig. 2 and Fig. S1c,d).The large surface area of TiO 2 nanosheets facilitates the loading of cocatalysts, while the low thickness shortens the average distance of photogenerated electrons to co-catalysts in reducing the chance of electron-hole recombination. Pd nanocrystals in cubic profile are then in situ grown on TiO 2 through reducing K 2 PdCl 4 by ascorbic acid (AA) with KBr as a facet-selective capping agent (Fig. 1a). 35As shown in Fig. 1b andc (also in Fig. S2a), Pd nanocubes with an average edge length of 10.6 nm are uniformly deposited on the surface of TiO 2 to form the TiO 2 -Pd.XRD peaks in Fig. 2 suggest the face-centered cubic (fcc) Pd (JCPDS No. 65-2867) in addition to anatase TiO 2 , while continuous lattice fringes with a spacing of 1.95 A in the HRTEM image indicate the monocrystalline Pd cubes enclosed by six (100) facets (Fig. 1d).As a result, facet-to-facet contact between TiO 2 and Pd contributes to the formation of TiO 2 (001)-Pd(100) interfaces, which can be further revealed by the TEM image with a standing-up TiO 2 nanosheet (Fig. S2b).The cubic Pd has advantages in fabricating TiO 2 -Pd interface with large area to guarantee the stability of supported structure and effective inferfacial charge transfer. In the third step, a seed-mediated growth of Au on the cubic Pd Please do not adjust margins 2), while the continuous lattice spacing of 2.04 A in the HRTEM image shows that the deposited Au nanocrystals are also pieces of single crystal, which are in close contact with Pd through the formation of Pd(100)-Au(100) interfaces (Fig. 1g).Though it is challenging for us to quantitatively determine the actual length of the interface between Pd and Au, the average length of exposed interface observed in the TEM images (perpendicular to the direction of electron beam) is estimated to be 8.5 nm per Pd-Au particle with a Pd : Au molar ratio of 0.57 : 0.43 (Fig. S3b).Owing to the lack of facet-selective capping agent, Au nanocrystals are covered by curved surface with high percentage of (111) facets to minimize the surface energy.TEM image with a standing-up TiO 2 nanosheet also reveals the contact between the deposited Au nanocrystals with TiO 2 to form TiO 2 -Au interface (Fig. S3c).The scanning TEM (STEM) image (Fig. 1h) as well as corresponding energy-dispersive spectroscopy (EDS) mapping profiles (Fig. 1i-l) further suggests the elemental distributions of Ti, O, Pd and Au, giving a direct solid evidence for the contruction of a nanosheet supported heterojunction structure.Upon achieving the controllable synthesis, we are in a position to investigate why Au can be selectively deposited on Pd nanocubes to form heterojunctions.To elucidate the underlying mechanism, we perform a control experiment using bare Pd instead of TiO 2 -Pd as precursors.It turns out that Au can also grow on Pd nanocubes to form Pd-Au heterojunctions but in irregular morphology mainly owing to the aggregation of Pd nanocubes, implying that TiO 2 plays no role in the reduction of Au on Pd (Fig. S4).On the other hand, it is found that the reaction can not occur in pure H 2 O system, suggesting the key role of ethanol in the reduction of HAuCl 4 to Au. 36 Owing to the weak reduction ability of ethanol, the reduction process is much slow at room temperature, and 12 h is taken to complete the reaction.The slow reduction of HAuCl 4 to Au only produces a small quantity of Au atoms in the solution at the beginning of the reaction.The scare supply of Au atoms promotes the collision of Au atoms with only a few faces of Pd cubes to form active growth sites. 37,38Once the growth sites are formed, the subsequently formed Au atoms prefer to deposit on these sites, rather than form new sites on other faces due to the lattice mismatch between Pd and Au.As a result, Janus Pd-Au heterojunctions are formed on TiO 2 nanosheets.Moreover, there are two possible reasons explaining the selective growth of Au on Pd rather than TiO 2 : (i) given the reduction potential AuCl 4 -/Au (0.99 eV) is higher than that of PdCl 2 2-/Pd (0.59 eV), the reduction reaction may be promoted by the redox potential difference as follows: 39,40 3Pd 2AuCl 4 - 4Cl - 3PdCl 4 2- 2Au (1); (ii) considering the lattice mismatch between Pd and TiO 2 is larger than that between Pd and Au, Au would prefer to wet the surface of Pd to minimize the interfacial energy. 41s reference samples, TiO 2 -Au, TiO 2 -Pd/Au, TiO 2 -PdAu, TiO 2 -AuPd and TiO 2 -PdAu with fcc metal or alloy components are also synthesized for comparison (Fig. 3).TiO 2 -Au is constructed by the deposition of monocrystalline Au nanospheres on TiO 2 nanosheets, in which the average size and surface atomic configuration of spherical Au are much similar to those in TiO 2 -Pd-Au (Fig. 3a-d and Fig. S5a).Simiarly, TiO 2 -Pd/Au consisting of both Pd nanocubes and Au nanospheres on the TiO 2 nanosheets is obtained through the assembly of Au with TiO 2 -Pd (Fig. 3e-i and Fig. S5b).TiO 2 -PdAu is fabricated through selectively coating the Pd nanocubes supported by TiO 2 with Au shells via the reduction of HAuCl 4 with AA.The strong reductant of AA generates a large number of Au atoms in a short time to interact with the five planes of Pd nanocubes to form core-shell structure given that one face of Pd is in close contact with TiO 2 .The as-obtained TiO 2 -PdAu nanostructure can be distinguished by the inner grey black Pd cubes and exterior deep black Au spheres in the TEM images (Fig. 3j-l and Fig. S5c), while the stack structure with five faces of Pd cube covered by Au and one face in contact with TiO 2 is verified by the TEM image with a standing-up TiO 2 nanosheet (Fig. S6a).The single crystal Au shell not only forms an intimate Pd(100)-Au(100) interface with Pd, but also comes in direct contact with TiO 2 in the ternary stack (Fig. 3m and Fig. S6a).On the contrary, with cetyltrimethylammomium bromide (CTAB) as a capping agent to promote the formation of Pd(100) planes, the reduction of K 2 PdCl 4 with AA allows for the selective growth of monocrystalline Pd shells on Au nanospheres to build TiO 2 -AuPd stack structure. 42As shown in Fig. 3n-q (also in Fig. S5d andS6b), deep black Au spheres are encapsulated by grey black Pd cubes and TiO 2 nanosheets with the formation of both TiO 2 -Pd and TiO 2 -Au interfaces.Besides the above architectures, PdAu alloy nanocrystals with a random arrangement of Au and Pd atoms are also fabricated on TiO 2 nanosheets (TiO 2 -PdAu, Fig. 3r-u).The alloying between Au and Pd atoms is confirmed by the XRD peaks between the standard peaks of Pd and Au (Fig. 2).In facilitating the following comparison of photocatalytic performance, as confirmed by inductively coupled plasma mass spectrometry (ICP-MS), approximate TiO 2 : Pd : Au molar ratios are maintained in most of the TiO 2 based samples (Table S1).The exceptions are the TiO 2 -PdAu and TiO 2 -AuPd with lower and higher Pd : Au molar ratios, respectively, in which more metal are used in the shell to fabricate the core-shell structures. To explore the potential of as-obtained metal nanostructures as cocatalysts in photocatalytic CO 2 reduction, the above TiO 2 -based samples are used as photocatalysts in the mixed vapor of CO 2 and H 2 O under UV light irradiation ( 420 nm), and the products are subsequently measured by gas chromatography.As shown in Fig. 4a, H 2 , CO and CH 4 are analyzed as the reduction products, while O 2 is detected as the product of oxidation half reaction (H 2 O 2h 1/2O 2 2H ).The loading of metal nanostructures significantly improve the average H 2 , CO and CH 4 production rates of TiO 2 , confirming the co-catalyst roles of them.More importantly, distinct photocatalytic activities and product selectivities are the observed for the above metal nanostructures.Pd produces a large amount of H 2 and trace amounts of CO and CH 4 .In contrast, CO is the major product for Au.As a result, the selectivities of TiO 2 -Pd and TiO 2 -Au for CH 4 production are 15.8 and 38.2, respectively, which are calculated according to the average evolution rates of the reduction products as well as the required electrons to generate products using the following equation: (2) With the integration of Pd with Au to form heterojunctions, the average production rates of H 2 and CO decrease significantly, while the average CH 4 production rate increases to 48.2 mol g cat -1 h -1 , 7.0 and 17.7 times higher than those of TiO 2 -Pd (6.9 mol g cat -1 h -1 ) and TiO 2 -Au (2.7 mol g cat -1 h -1 ), respectively, which affords a dramatic rise of CH 4 selectivity to 91.4, implying a change in the catalytic nature.Compared with TiO 2 -Pd-Au, TiO 2 -Pd/Au, TiO 2 -PdAu, TiO 2 -AuPd and TiO 2 -PdAu exhibit relatively lower activity of 11.9, 9.0, 7.9 and 19.8 mol g cat -1 h -1 and selectivities of 21.8, 38.6, 33.0 and 53.3 for CO 2 -to-CH 4 transformation, Please do not adjust margins Au, (e-i) TiO 2 -Pd/Au, (j-m) TiO 2 -PdAu, (n-q) TiO 2 -AuPd and (r-u) TiO 2 -PdAu. respectively.This result reveals that the catalytic activity and selectivity are greatly dependent on the architectures made of Pd and Au atoms.In addition, the average O 2 evolution rate of TiO 2 -Pd-Au is measured to be 73.1 mol g cat -1 h -1 .The ratio between the average production rates of reductive products and oxidative product v(H 2 ) v(CO) 4v(CH 4 )/v(O 2 ) is 2.9, larger than the stoichiometric value of 2, which may be attributed to the lack of oxidation cocatalysts to balance the reduction and oxidation half reactions. The highest activity and selectivity of TiO 2 -Pd-Au demonstrate that Pd-Au heterojunction can be a highly efficient co-catalyst in CO 2 -to-CH 4 conversion.The apparent quantum efficiency of the TiO 2 -Pd-Au was measured to be 1.2 at 365 nm.The photocatalytic peformance is even superior to those of reported state-of-the-art metal and bimetal co-catalysts supported by TiO 2 under similar experimental conditions (Table S2). 20,24,28,4344445 More importantly, high stability of TiO 2 -Pd-Au is observed in the long-term photocatalysis.93.5 of CH 4 production rate is maintained after five 4-h cycles with negligible decay in the selectivity (Fig. 4b).TEM, XRD and XPS analyses (Fig. S7 andS8) indicate that there is no obvious variation in the structure and composition of TiO 2 -Pd-Au This journal is The Royal Society of Chemistry 20xx Please do not adjust margins Please do not adjust margins after the cycle test, certifying its favorable photostability.It should be noted that the formation of CO and CH 4 is negligible in the control experiments in dark, without photocatalysts or in Ar, confirming that CO and CH 4 actually originate from CO 2 under light irradiation.To further confirm this, 13 C isotope labeling experiment was performed over TiO 2 -Pd-Au using 13 CO 2 as substrate to explore the source of carbon.As shown in Fig. 4c, the peak at m/z 17 in the mass spectra can be assigned to 13 CH 4 , suggesting that the carbon source of CH 4 is derived from the used CO 2 . To gain insight into the driving force of the photocatalytic reactions, the light absorption abilities of TiO 2 based samples are firstly revealed by UV-vis-NIR diffuse reflectance spectra.As shown in Fig. 5a, all the TiO 2 based samples exhibit comparable light absorption in UV region with the same absorption edge at around 400 nm, corresponding to the intrinsic band gap (3.1 eV) of TiO 2 , while the plasmonic absorption of Au and interband absorption of nonplasmonic Pd contribute to the different light absorption behaviors in the visible region. 46,47The comparable light absorption in the UV region ensures the same photo-induced charge carrier generation abilities during the UV light induced photocatalytic reactions. Then photocurrent measurements are further employed to illucidate the charge migration and separation in the samples.As shown in Fig. 5b, the couple of metal co-catalysts significantly enhance the photocurrent response of pristine TiO 2 under UV light irradiation, suggesting the improved charge separation efficiencies resulted from the electron trapping of co-catalysts.Given the smaller work function of anatase TiO 2 (4.9 eV) than those of Pd (5.1 eV) and Au (5.1 eV), the photogenerated electrons in TiO 2 can be transferred to metal co-catalysts through Schottky junctions. 48he photocurrent responses of the samples are in the order: TiO 2 -Pd TiO 2 -Au TiO 2 -Pd/Au TiO 2 -PdAu TiO 2 -AuPd TiO 2 -Pd-Au TiO 2 -PdAu, indicating the different electron capture abilities of the metal architectures.This statement is further confirmed by the reduced radii of electrochemical impedance spectroscopy (EIS) Nyquist plots and increased photoluminescence (PL) quenching degree of TiO 2 in the same sequence (Fig. 5c andd).Generally, a small arc radius of Nyquist plot suggests a lower interfacial charge transfer resistance, while a higher PL quenching degree indicates that the electron-hole recombination through radiative pathways is prevented more effectively. To further analyze the origin of above experimental results, the architectures of metal co-catalysts are firstly taken into consideration.Given the comparable light absorption, the different photocatalytic activities can only be ascribed to varied charge kinetics or surface reaction processes.It has been widely accepted that charge separation efficiencies are greatly determined by the interfacial structures, while surface atomic configurations of co-catalysts affect the catalytic reduction reactivity.According to the architectures of co-catalysts, the samples can be classified into four kinds of supported structures.For single-phase co-catalysts, including Pd, Au and PdAu alloy, only one kind of TiO 2 -metal interface and metal We then try to establish the relationship between charge kinetics and interfacial structures of co-catalysts.The enhanced charge separation efficiency in TiO 2 -Pd-Au compared with those of TiO 2 -Pd and TiO 2 -Au can be explained by the electron transfer through both TiO 2 -Pd and TiO 2 -Au interfaces.Nevertheless, the charge separation effciency of TiO 2 -Pd-Au also outperforms that of TiO 2 -Pd/Au.It is reasonable to infer that Pd-Au interface makes a contribution to charge separation in addition to TiO 2 -Pd and TiO 2 -Au interface.Owing to the larger electronegativity of Au (2.4) than that of Pd (2.2), electron could be transferred from Pd to Au through Pd-Au interface, leading to the formation of electron-deficient Pdand electron-rich Au, which thus improves the electron accept ability of Pd and optimizes the charge separation efficiency. 49,50he electronegativity difference also explains the higher electron trapping ability of Au in comparison with Pd.As shown in the XPS spectra (Fig. 6), Pd3d peaks of TiO 2 -Pd-Au shift to higher binding energy and Au4f peaks to lower binding energy as compared with those of TiO 2 -Pd, TiO 2 -Au and TiO 2 -Pd/Au though no obvious change in the position of Ti2p and O1s peaks (Fig. S10), confirmed that Pd is electron-deficient while Au becomes more electron-rich.A similar phenomenon can also be observed for the Au4f signal of TiO 2 -PdAu and Pd3d signal of TiO 2 -AuPd with larger Au-Pd interfaces (the signals of Pd and Au cores are much weaker due to the limited detection depth of XPS, Fig. S9).Of course, electrons accumulated in Au core do not facilitate charge separation compared to those in Au shell.As a result, better and poorer charge separation relative to TiO 2 -Pd-Au are exhibited by TiO 2 -PdAu and TiO 2 -AuPd, respectively.In contrast, electron re-distribution in PdAu alloy is relatively weaker owing to the lack of Pd and Au poles for charge polarization, 35,51 corresponding to the inferior charge separation in TiO 2 -PdAu. Apart from charge separation, the contribution of surface reaction kinetics in improving the CO 2 -to-CH 4 conversion is studied through analyzing the structure-activity relationship between photocatalytic performance and surface configuration of co-catalysts.It is found that for TiO 2 -Pd and TiO 2 -AuPd with only Pd exposed, dominant H 2 O reduction occurs on the Pd(100) planes, which is in agreement with previous reports. 19,50n the contrary, the photocatalytic results of TiO 2 -Au and TiO 2 -PdAu underline the preferential occurrence of CO production on Au surface. 52onsequently, both H 2 and CO are the primary products for TiO 2 -Pd/Au with co-exposed Pd and Au surfaces. Nevertheless, compared to TiO 2 -Pd/Au, distinct product selectivities is displayed by TiO 2 -Pd-Au regardless of the same surface of co-catalyst between them, suggesting the interplay between Pd and Au atoms in suppressing H 2 and CO evolution and improving CH 4 production.The synergy effects are less prominent in PdAu alloy considering the lower CH 4 yield and selectivity of TiO 2 -PdAu. Based on the different catalytic nature between TiO 2 -Pd-Au and TiO 2 -Pd/Au, it is proposed that the exposed interface between Au and Pd act as highly active catalytic sites in conversion of CO 2 to CH 4 .To confirm this, the average interfacial length between Pd and Au in the TiO 2 -Pd-Au is facilely tuned by adjusting the loading amounts of Au.As shown in Fig. 7a-g (also in Fig. S11 and Table S1), when the Pd : Au molar ratio increases to 0.82 : 0.18, only a smaller portion of Pd nanocubes is deposited by Au, and the average length of exposed Pd-Au interface is reduced to 5.2 nm per Pd-Au particle in the as-synthesized TiO 2 -Pd-Au-L.In contrast, when the Pd : Au molar ratio in TiO 2 -Pd-Au-H decreases to 0.28 : 0.72, most planes of Pd nanocubes are covered by Au with only a small part of Pd surface exposed, and then the interfacial length also decreases to 6.9 nm per Pd-Au particle.As shown in Fig. 7h, both the activity and selectivity for CO 2 -to-CH 4 transformation are in the sequence of TiO 2 -Pd-Au TiO 2 -Pd-Au-H TiO 2 -Pd-Au-L, illustrating the positive correlation between Pd-Au interfacial length and CH 4 production. The information gleaned above has identified the importance of Pd-Au interface to the CH 4 evolution.Now we are in a position to elucidate the underlying mechanism.Previous studies suggest that the metal-metal interface plays an essential role in determining the activity and selectivity of heterogeneous catalysts in CO 2 reduction. 53,54As reported by Meyer research group, the reduction of CO intermediate with H is the rate-limiting procedure in the conversion of CO 2 into CH 4 . 55Given the H and CO are also the intermediates for H 2 and CO evolution, the primary products generated on Pd and Au surface, respectively, the superior performance of TiO 2 -Pd-Au should be originated from the unique synergy between Pd and Au atoms around the Pd-Au interface, in which Au atoms act as catalytic sites in reduction of CO 2 to Aubound CO intermediate, while Pd atoms drive the reduction of H and adsorption of as-produced H to form paired Pd-H sites.Then the neighboring Pd-H sites participate in the rate-limiting reduction of CO to CH 4 on the Au side.Namely, the synergistic interplay between Au-CO sites and neighboring Pd-H sites on the Pd-Au interface contributes to the high-efficient CH 4 production.To confirm the proposed mechanism, Pd-Au heterojunctions are further transformed to PdH 0.43 -Au through selectively incorporating more H atoms into the lattice of Pd. 56 The further enhanced CH 4 rate of TiO 2 -PdH 0.43 -Au confirms the participation of Pd-H sites in the CH 4 evolution process (Fig. S12). Then the question is why H 2 and CO production on the Pd and Au surface can be suppressed in the Pd-Au heterojunctions, respectively, which can be explained by the charge transfer through Pd-Au interface driven by electronegativity difference.Resulted from the electron re-distribution between Pd and Au, electrondeficient Pd in the Pd-Au heterojunctions inhibits the H 2 production in large scale, while electron-rich Au promotes the 8-electron reduction of CO 2 to CH 4 in relative to the 2-electron reduction of CO 2 to CO.This statement is also verified by the superior CH 4 production of TiO 2 -PdAu in comparison with that of TiO 2 -Au as well as the inferior H 2 evolution of TiO 2 -AuPd than that of TiO 2 -Pd in virtue of the electron-rich Au shell and electron-deficient Pd shell in PdAu and AuPd structures, respectively."
  },
  {
    "title": "Conclusions",
    "content": "In conclusion, we report a high-performance CO 2 reduction photocatalysts with Janus Pd-Au heterojunction as co-catalysts.Our Fig. 1 (a) Schematic illustrating the synthesis of TiO 2 -Pd-Au; (b-d) TEM and HRTEM images of TiO 2 -Pd; (e-g) TEM and HRTEM images of TiO 2 -Pd-Au; (h) STEM image and (i-l) EDS mapping profiles of TiO 2 -Pd-Au showing the element: (i) Ti, (j) O, (k) Pd and (l) Au.is performed through the addition of HAuCl 4 into the H 2 O/ethanol mixed suspension of TiO 2 -Pd.As shown in Fig.1e and f(also in Fig.S3a and b), Au is deposited on one or more faces of cubic Pd nanocrystals to yield nonconcentric Pd-Au heterojunctions through an epitaxial growth mode.Particularly, the image contrast between grey black Pd and deep black Au, resulting from the different electron densities between Pd and Au, can be clearly observed in the TEM images.The XRD pattern of the as-obtained TiO 2 -Pd-Au implys the fcc phase of the deposited Au (JCPDS No. 65-2870) (Fig.2), while the continuous lattice spacing of 2.04 A in the HRTEM image shows that the deposited Au nanocrystals are also pieces of single crystal, which are in close contact with Pd through the formation of Pd(100)-Au(100) interfaces (Fig.1g).Though it is challenging for us to quantitatively determine the actual length of the interface between Pd and Au, the average length of exposed interface observed in the TEM images (perpendicular to the direction of electron beam) is estimated to be 8.5 nm per Pd-Au particle with a Pd : Au molar ratio of 0.57 : 0.43 (Fig.S3b).Owing to the lack of facet-selective capping agent, Au nanocrystals are covered by curved surface with high percentage of (111) facets to minimize the surface Fig. 2 XRD patterns of TiO 2 , TiO 2 -Pd, TiO 2 -Au, TiO 2 -Pd-Au, TiO 2 -Pd/Au, TiO 2 -PdAu, TiO 2 -AuPd and TiO 2 -PdAu.The bottom corresponds to the standard XRD patterns for TiO 2 (black, JCPDS No. 21-1272), Pd (red, JCPDS No. 65-2867) and Au (blue, JCPDS No. 65-2870). Fig. 3 Schematic illustration, TEM and HRTEM images of (a-d) TiO 2 -Au, (e-i) TiO 2 -Pd/Au, (j-m) TiO 2 -PdAu, (n-q) TiO 2 -AuPd and (r-u) TiO 2 -PdAu. Fig. 4 (a) Average H 2 , CO, and CH 4 evolution rates with TiO 2 based samples as photocatalysts as well as their selectivities in CH 4 production under UV light ( 420 nm) irradiation; (b) Average CH 4 evolution rates with TiO 2 -Pd-Au as photocatalyst in five successive cycles under UV light irradiation; (c) Mass spectra of 13 CH 4 (m/z 17) produced over TiO 2 -Pd-Au under UV light irradiation. Fig. 5 (a) UV-vis-NIR diffuse reflectance spectra of TiO 2 based samples; (b) Photocurrent vs. time (I-t) curves at 0.4 V vs. Ag/AgCl under UV light ( 420 nm) irradiation; (c) PL spectra excited at 315 nm; (d) EIS Nyquist plots at 0.4 V vs. Ag/AgCl under UV light irradiation.co-catalyst surface are involved.While TiO 2 -Pd-Au includes three kinds of interfaces (TiO 2 -Pd, TiO 2 -Au and Pd-Au interfaces) and two kinds of exposed surface (Pd and Au).TiO 2 -Pd/Au exhibits the same surface and interfacial structures as TiO 2 -Pd-Au except the absence of Pd-Au interface.Comparing with TiO 2 -Pd-Au, TiO 2 -PdAu and TiO 2 -AuPd have the same interfacial structures, while the surface configurations of co-catalyst are similar to TiO 2 -Au and TiO 2 -Pd with only Au and Pd atoms exposed, respectively.According to the above discussion, it can be concluded that the above TiO 2 based samples are differentiated by interface and surface of co-catalysts, which may be the reason for the different photocatalytic performance.We then try to establish the relationship between charge kinetics and interfacial structures of co-catalysts.The enhanced charge separation efficiency in TiO 2 -Pd-Au compared with those of TiO 2 -Pd and TiO 2 -Au can be explained by the electron transfer through both TiO 2 -Pd and TiO 2 -Au interfaces.Nevertheless, the charge separation effciency of TiO 2 -Pd-Au also outperforms that of TiO 2 -Pd/Au.It is reasonable to infer that Pd-Au interface makes a contribution to charge separation in addition to TiO 2 -Pd and TiO 2 -Au interface.Owing to the larger electronegativity of Au (2.4) than that of Pd (2.2), electron could be transferred from Pd to Au through Pd-Au interface, leading to the formation of electron-deficient Pdand electron-rich Au, which thus improves the electron accept ability of Fig. 6 (a) Pd3d XPS spectra over TiO 2 -Pd, TiO 2 -Pd-Au, TiO 2 -Pd/Au, TiO 2 -AuPd and TiO 2 -PdAu; (b) Au4f XPS spectra over TiO 2 -Au, TiO 2 -Pd-Au, TiO 2 -Pd/Au, TiO 2 -PdAu and TiO 2 -PdAu. This work was financially supported by National Natural Science Foundation of China (No. 21603191, 21775138), Zhejiang Provincial Natural Science Foundation of China (No. LQ16B010001) and Public Welfare Technology Application Research Plan Project of Zhejiang Province (Analysis Test Item, No. 2017C37024). This journal is The Royal Society of Chemistry 20xx J. Name., 2013, 00, 1-3 9 Please do not adjust margins Please do not adjust margins Meanwhile, resulted from the electronegativity difference between Au and Pd, electron-deficient Pd suppresses the competitive H 2 production in large scale and enhances the electronhole separation, while electron-rich Au promotes the 8-electron reduction of CO 2 to CH 4 on the Pd-Au interface.As a result, the studied Pd-Au co-catalysts reach an unprecedented activity of 48.2 mol g cat -1 h -1 and selectivity of 91.4 for CH 4 evolution as well as high stability over a 20 h period, much better than other architectures consisting of Pd and Au atoms.This work highlights a promising approach to boost solar-driven CO 2 conversion through interface engineering on co-catalysts. Interfacial reaction on Janus metal heterojunction co-catalysts is found to promote the activity and selectivity in photocatalytic conversion of CO 2 to CH 4 ."
  }
]