[
  {
    "title": "Doi",
    "content": "10.1016/j.nanoen.2021.106532"
  },
  {
    "title": "Article_Title",
    "content": "In-situ annealed “M-scheme” MXene-based photocatalyst for enhanced photoelectric performance and highly selective CO2 photoreduction"
  },
  {
    "title": "Abstract",
    "content": "Methane (CH 4 ) has superior economic value and application prospect compared with CO, and is an ideal product for photoreduction of CO 2 .However, low CO 2 conversion efficiency and poor selectivity on production are both obstacles to its practical application.Herein, we develop a \"M-scheme\" photocatalyst CeO 2 /Ti 3 C 2 /TiO 2 (CTT) for superior CO 2 reduction and selective CH 4 generation.This dual heterojunction is constructed by annealing precursor CeO 2 /Ti 3 C 2 to form anatase TiO 2 in situ.CTT composed by CeO 2 /Ti 3 C 2 and TiO 2 /Ti 3 C 2 significantly promotes the charge carrier transfer, improving its photoelectric performance.Ti 3 C 2 exhibits a metallicity in the composite, which not only plays the role of a platform to receive transferred electrons, but also resembles the behavior of precious metals to assist in the decomposition of H 2 molecules to H .The reaction between H and CO on Ti 3 C 2 contributes to the decreased by-products and decent CH 4 selectivity.This work provides a facile and up-and-coming model to construct \"M-scheme\" heterojunction, realizing the megamerger between optimized photoelectric performance and selective CO 2 photoreduction."
  },
  {
    "title": "Experimental",
    "content": "Ti 3 AlC 2 ( 99) powder was purchased from Feynman Nano Technology Co., Ltd.Lithium Fluoride (LiF, 99.9 metals basis), Hydrochloric acid (HCl, 36.5-38.0wt), Sodium hydroxide (NaOH, ACS, 97), anatase Titanium oxide (anatase TiO 2 , 99.8 metal basis, 5-10 nm), Chloroplatinic acid hexahydrate (H 2 PtCl 6 6H 2 O, AR, Pt 37.5) and Cerium nitrate hexahydrate (Ce(NO 3 ) 3 6H 2 O, 99.95 metal basis) were purchased from Alfa Aesar Chemicals Co. Ltd.Commercial TiO 2 powder (P25) was supplied from Evonik Degussa GmbH.All the chemical reagents were directly used without further purification. Ti 3 C 2 was fabricated from Ti 3 AlC 2 by LiF HCl chemical exfoliation.CeO 2 /Ti 3 C 2 junctions with the mass percent of 21.6, 32.4 and 43.2 Ti 3 C 2 (labeled as CT-1, CT-2, and CT-3, respectively.CT represents the combination of CeO 2 and Ti 3 C 2 .)were prepared by coprecipitation and hydrothermal method.CeO 2 /Ti 3 C 2 /TiO 2 junctions were synthesized by annealing in Argon atmosphere, labeled as CTT-1, CTT-2, and CTT-3.CTT represents the combination of CeO 2 , Ti 3 C 2 , and TiO 2 .Pt/TiO 2 was manufactured by photodeposition method, using H 2 PtCl 6 6H 2 O as the metal source.Detailed synthetic procedures could be acquired in Supplementary experimental section. Materials were charactered by X-ray diffraction (XRD), X-ray photoelectron spectroscopy (XPS), Raman spectra, Transmission Electron Microscope (TEM), Scanning Electron Microscope (SEM), Electrochemical Impedance Spectroscopy (EIS), Ultraviolet Photoelectron Spectroscopy (UPS), Solid-state Nuclear Magnetic Resonance Spectroscopy (SSNMR), Gas chromatography mass spectrometry (GC-MS), Transient photocurrent, Specific surface area, In-situ diffuse reflectance infrared Fourier transform spectroscopy (DRIFTS), Extended X-ray absorption near edge (EXAFS) and Density Functional Theory (DFT) calculations.Detailed process please see the Supplementary experimental section. 50 mg of samples were added to 5 mL of water for 30 min ultrasonic treatment, then add it to a quartz reactor.The reactor was purged with nitrogen for 60 min to remove air.Afterwards, the samples were put in a multi-channel photocatalytic reaction device under irradiation with 300 W Xe lamp for 4 h.0.6 mL of gas was pumped and tested with a gas chromatograph (PGC-80, PANNA instrument, Changzhou, China)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "We first demonstrate the construction of heterojunctions on the basis of density functional theory (DFT) calculations.The crystal structures of Ti 3 C 2 , CeO 2 and TiO 2 are shown in Fig. 1a-c, respectively.Ti 3 C 2 is a layered material formed by alternately stacking three Ti layers and two C layers.Both the Ti layer and the C layer are closely packed in the plane.CeO 2 is a fluorite structure, Ce atoms are stacked in face-centered cubic, and O atoms occupy eight tetrahedral interstitial sites.In anatase TiO 2 , the O atoms are located at angulus parietalis of the octahedron, while the Ti atoms are located in the octahedral vacancies.The octahedrons are connected by two pairs of facing edges.We calculated their electronic structure in order to investigate the contact mode of the heterostructure interface.The density of states (DOS) of Ti 3 C 2 is shown in Fig. 1d.The valence band is occupied by Ti and C electrons, while the conduction band is mainly occupied by Ti electrons.The Fermi level passes through the conduction band, indicating that Ti 3 C 2 is metallic.Furthermore, the electrostatic potential (Fig. 1d) of Ti 3 C 2 along the direction perpendicular to the surface (z-axis) gives its work function of 4.71 eV.According to the definition of Fermi level (Eq.( 1)): where E vac and are vacuum levels (usually assumed to be 0) and work function, respectively.From this, it can be calculated that the Fermi level of Ti 3 C 2 is 4.71 eV below vacuum level (-0.21 eV vs. normal hydrogen electrode (NHE)).For CeO 2 and TiO 2 , the energy band calculations show that they are both semiconductors, with band gaps of 3.63 eV and 3.40 eV, respectively (Fig. 1e andf).To estimate the position of the band edge, we use the following Eqs.( 2) and ( 3): where E e is energy of free electron on the hydrogen scale (4.50 eV), is the absolute electronegativity of the semiconductor (5.60 eV for CeO 2 and 5.81 eV for TiO 2 ), and E g , E CB and E VB are corresponding to the band gap, conduction band and valence band edge position, respectively.Based on the above equation, conduction band edge position of CeO 2 is -0.71 eV vs. NHE, and the conduction band edge position of TiO 2 is -0.39 eV vs. NHE, both of which are slightly negative than the Fermi level of Ti 3 C 2 (-0.21 eV vs. NHE) (Fig. 1g).When Ti 3 C 2 is in contact with CeO 2 (TiO 2 ), according to the relative position of the Fermi level, the contact mode can be divided into the following two situations: i) When the Fermi level of Ti 3 C 2 is slightly negative than that of CeO 2 (TiO 2 ), electrons will migrate from Ti 3 C 2 to CeO 2 (TiO 2 ), forming a negative space charge layer on the surface of CeO 2 (TiO 2 ), which is a high-conductivity anti-blocking layer.When heterostructure is exposed to light, the anti-blocking layer helps the photogenerated electrons to quickly pass through the interface and enter Ti 3 C 2 ; ii) When the Fermi level of Ti 3 C 2 is more positive than that of CeO 2 (TiO 2 ), electrons will migrate from CeO We first prepared the precursor, CeO 2 Ti 3 C 2 (CT), by chemical deposition and hydrothermal method with varied Ti 3 C 2 concentrations to substantiate our design, as Fig. 2a shown.The typical layered accordion structure of MXene can be observed in the vertical plane in scanning electron microscope (SEM, Figs.2b andS1a) pattern of CT.The flocs on the MXene's surface are considered to be CeO 2 , assigned that the irregular morphology is in line with the typical characteristics of hydrothermally grown CeO 2 27.We also exhibit its surface morphology after annealing CT.The annealed CT still retains the layered structure of MXene (Fig. 2c).The particulate growing densely in the layered epitaxy can be observed in in-situ amplified region (Figs.2d andS1b).It has been pointed out in other works 28,29 that there are a large number of oxidative active vacancies at the edge of the MXene layered structure, as well these vacancies are easily oxidized to form corresponding metal oxides, deposited on its boundaries 30.Therefore, we preliminarily speculated that these particles with significantly different morphologies belong to TiO 2 formed in situ after annealing.Corresponding Energy Dispersive Spectrometer (EDS, Fig. 2e) shows distinct distribution of Ce M and Ti K, which can demonstrate that the particles are TiO 2 .Hence, we named annealed CT as \"CTT\" to highlight the TiO 2 generated after oxidation.In addition, EDS also suggests that there is less direct contact between TiO 2 and CeO 2 , although both of them are anchored on the surface of Ti 3 C 2 .It can be attributed that if CeO 2 has already covered an oxidative active vacancy on Ti 3 C 2 , it is impossible for this site to be oxidized to form TiO 2 during annealing.In terms of experiments, CeO 2 is more likely to be deposited on the surface of Ti 3 C 2 , while TiO 2 is more likely to be generated on the side edges.It suggests that the layered section in Ti 3 C 2 possesses more oxidation active sites that will not been occupied by CeO 2 .This distribution makes the interface interaction between TiO 2 and CeO 2 is significantly weakened, reducing the possibility of reverse migration of carriers among multiple heterojunctions 31.The above experimental results are consistent with the previous reports.Michel et al. 32 found that the negative Au NPs preferred the edges of Ti 3 C 2 , whereas the positive Au NPs preferred the surfaces.The charge differences between the edges and faces promote Ce 4 precursor to anchor on the surface of Ti 3 C 2 to develop CeO 2 in CTT.As to the formation of TiO 2 , Liang et al. 33 prepared anatase TiO 2 /SnO 2 heterojunctions with oxygen vacancy scramble effect.Anatase TiO 2 grows on the edge of Ti 3 C 2 in the form of 0D quantum dots, as same as CTT.Meanwhile, Liu et al. 34 synthesized CdSTi 3 C 2 TiO 2 composites, illustrating that the compound CdS nanoparticles exhibit distinct boundaries with generated anatase TiO 2 .These phenomena strongly support that there is relatively little direct contact between CeO 2 and TiO 2 .The fact also inspires us to pay more attention to the effects between Ti 3 C 2 and CeO 2 or TiO 2 in the subsequent studies, instead of on CeO 2 and TiO 2 .In addition, it is worth mentioning that direct contact between CeO 2 and TiO 2 exists objectively in the experiment, but is not the majority.Transmission electron microscope (TEM, Fig. 2f) has been utilized to further verify our inference.The layered structure of Ti 3 C 2 is clearly shown.The lattice fringes (Fig. 2g) in the orange and yellow regions correspond to the (200) plane of CeO 2 35 and the (101) plane of anatase TiO 2 36, respectively, proving that particles in the SEM pattern are indeed TiO 2 formed after annealing.Meanwhile, the interval of each lattice boundary can be clearly observed, implying again that there is little direct contact between CeO 2 and TiO 2 , which vividly describes the characteristics of the \"M-scheme\" heterojunction as the two separated vertical lines in \"M\", as Scheme S1 shown. The internal structure and bonding situation of CTT are investigated by comparison with CT after possessing a preliminary understanding on its external morphology.Fig. 3a patterns of CT and CTT with varied concentrations.The basal (002) peak belongs to interlamellar distance shifts to 6.12 , confirming the conversion from MAX phase (JCPDS card no.52-0875, Fig. S2) to MXene phase by LiF exfoliation 37.The intensity of (002) is intensified with increasing of Ti 3 C 2 content.This peak disappears, while two new diffraction peaks located at 26.46 and 48.45 simultaneously appear in CTT, which are assigned to anatase TiO 2 observed in CTT (although the peak intensity of TiO 2 is lower than that of CeO 2 ).It indicates the partial transformation of Ti 3 C 2 into TiO 2 after annealing.Meanwhile, it can be obtained from the above SEM images that the CTT still retains the layered structure of Ti 3 C 2 , confirming that not all Ti 3 C 2 is converted to TiO 2 in CTT and still a part of Ti 3 C 2 is retained, acting as carrier transfer platforms. The solid-state Nuclear Magnetic Resonance Spectroscopy (SSNMR, Fig. 3b) has been adopted to present the difference of 13 C-labeled system, offering an internal structural view for the heterojunction.Two peaks with equal integral intensity at 132.4 and 150.9 ppm are assigned to C-Ti and C-Al 38, while the elemental Al is the impurity in remaining MAX phase (SSNNMR is relatively sensitive to detect metal elements.).Whereas, the peak located at 160.1 ppm and the region from 377.8 to 468.5 ppm can be attributed to C-Ti 3 C 2 OH x and C-Ti 3 C 2 F x , respectively 39.The -F, --O, -OH are the suspension parts on the surface of MXene phase after MAX phase exfoliated by LiF or HF.Interestingly, both of them appear merely in CT, while these peaks disappear after annealing in CTT.Meanwhile, the intensity of C-Ti is obviously enhanced.In view of this, a structural change can be obtained from CT to CTT, that is, the suspension parts ( -F, --O, -OH) on the CT surface fall off during annealing, leaving a large number of oxidative active vacancies 40, and then TiO 2 particles are formed in situ on these vacancies. Raman spectrum (Fig. 3c) exhibits the details on the difference between CT and CTT in bond formation and lattice vibration changes.MXene-phase Ti 3 C 2 and pristine CeO 2 emerge together with CT and CTT for the convenience of labeling and comparison.Raman spectrum reflects the antagonistic relationship between in situ annealed TiO 2 and CeO 2 .In detail, the peak located at 150 cm -1 , assigned to E g oscillation of Ti 3 C 2 , shows a frequency shift from 150 in CT to 153 cm -1 41, then goes back to where it was.It may be assigned that generated TiO 2 by annealing limits the in-plane vibration of Ti 3 C 2 .The synergistic effect of F 2g oscillation in CeO 2 42 and B 1g oscillation in Ti 3 C 2 endows CT an intermediate peak located between two peaks, revealing a significant enhance in intensity compared to B 1g .This phenomenon implies that there is an interfacial interaction in CT between CeO 2 and Ti 3 C 2 , or carrier transport, which affects the lattice vibration of each component.This peak also exhibits decreasing intensity and a low-frequency shift in CTT, verifying that in situ TiO 2 restricts the in-plane vibration of Ti 3 C 2 .Whereas, the peak at 623 cm -1 represented an out-of-plane stretching vibration shows a blue shift, owing that the generated TiO 2 after annealing provides CTT with additional integral lattice vibrations.Furthermore, Raman spectrum of CTT shows four distinct characteristic peaks of anatase TiO 2 at 156 cm -1 , 307 cm -1 , 396 cm -1 , and 513 cm -1 , demonstrating that the major annealing product is anatase TiO 2 once again 43. X-ray photoelectron spectroscopy (XPS, Fig. S3) is conducted to analyze the crosslinking and bond information in CT and CTT.Fig. 3d-f show the high-resolution C 1s, O 1s, and Ti 2p XPS spectra of CT and CTT, respectively.CTT reveals a peak of C-C at 284.9 eV similar with CT, which means that CT and CTT both reserve the carbon skeleton of Ti 3 C 2 44.CTT has undergone high-temperature annealing, contributing that Ti 3 C 2 was partly oxidized to TiO 2 , reflecting on the decreasing full width at half maximum (FWHM) of C-C peak.C -Ti bond shows a shift to high binding energy compared with that of CT.We infer that the Ti atoms of TiO 2 in CTT have an interaction force with the C atoms in Ti 3 C 2 , which has assistance for boosting the binding energy of C-Ti.In addition, the peak of C-F and/or C-OH is obviously decreased in CTT 45, verifying that thermal treatment can eliminate the suspension parts on the surface of Ti 3 C 2 and leave more oxidative active vacancies to form TiO 2 .The peak of lattice oxygen in CTT distinctly moves to the lower binding energy, as Fig. 3e shown.Antagonistic growth between CeO 2 and TiO plays a key role in it.In simple words, it is impossible for one oxidized vacancy site firstly covered by CeO 2 , then be oxidized to form TiO during annealing.This antagonistic action is also reflected in the red shift for C-Ti-O x in CTT 46, while the FWHM of this peak is clearly enhanced in CTT compared with CT, owing that the generated TiO provides extra Ti-O bonds.The peak of C-Ti-OH disappears in CTT, similar with C-O and C-F, owing to the annealing treatment.Moreover, CTT exhibits two brand-new peaks of Ti-O, which are not existing in CT, as Fig. 3f illustrated.The Ti Auger electron spectroscopy (AES, Fig. S5) of CTT also indicates a powerful evidence for the formation of TiO 2 in CTT 47.The position and FWHM of Ti -C bond representing the basic structure of Ti 3 C 2 did not change significantly whether in CT or CTT, while Ti-OH represented the surface suspension parts of Ti 3 C 2 disappears in CTT.Therefore, following three conclusions can be acquired from above results: (i) Carbon skeleton structure of partial Ti 3 C 2 is preserved during annealing without being destroyed; (ii) There is an antagonistic relationship on competing for active oxygen vacancies between CeO 2 and TiO 2 ; and (iii) The suspension parts (-F, -OH and --O) on the surface of Ti 3 C 2 falls off, leaving oxygen vacancies for TiO generation during the annealing process. We have indeed synthesized CTT as initial expected based on theoretical calculations and characterizations of the morphology and structure.Hence, it is anticipated to further verify the optimization of CTT on photoelectric performance and the efficiency of CO 2 photoreduction.The bandgaps of the as-obtained CT(s) and CTT(s) are illustrated in the UV-Vis diffuse reflectance spectra (UV-Vis DRS, Fig. 4a) compared with that of pristine Ti 3 C 2 and CeO 2 .Apparently, Ti 3 C 2 exhibits no absorption edge due to its metallicity, while pristine CeO 2 indicates an absorption edge centered at 440 nm.The absorption edge of CeO 2 reflects a drawback commonly on most semiconductor oxides, an excessive semiconductor bandgap, which is detrimental to the transport of charge carriers 48.Fortunately, the gap of CeO 2 can be effectively adjusted by cation doping and heterojunction construction 49.Frankly, it is the pristine plan of this work to adjust the band of CeO 2 through Ti 3 C composition in order to acquire better CO 2 photoreduction efficiency.However, fewer Ti 3 C 2 composite cannot achieve a significant improvement in photocatalytic activity, while the addition of superabundant Ti 3 C 2 makes its metallicity dominated in CT, endowing the whole an excessively narrow band gap as CT(s) shown in Fig. 3a.It would reduce the lifetime of carriers and accelerate the recombination of photogenerated electron-hole pairs.In addition, adjusting the band by means such as ion doping based on CT(s) will make the entire material structure more complicated.It is difficult to make an objective and clear analysis of the synergistic photocatalytic mechanism, as well it may not necessarily achieve a better photocatalytic effect.Therefore, we make full use of the large number of active vacancies formed by exfoliated suspensions on the surface to generate anatase TiO 2 in situ to control the metallicity, harvesting the ideal bandgaps in CTT(s).The bandgaps of CT and CTT are calculated by the transformation of Kubelka-Munk function (Fig. 4b).The estimated bandgaps all present a gradually narrow with the increase of Ti 3 C 2 dosage.The detailed band positions are further measured by ultraviolet photoelectron spectroscopy (UPS).Fig. 4c illustrates the low kinetic energy (E L ) and high kinetic energy (E H ) in CT, CTT and Ti 3 C 2 , which can be utilized to determine the E F , valence band maximum (E VBM ) and conduction band minimum (E CBM ), followed as the Eqs.( 4)-( 6) below: (hv: incident photon energy of UPS with normalized bias correction, 21.2 eV). The tangent lines in each region determine the E H and E L in CT and CTT.E VBM and E CBM of CT (E F 0) are estimated to 1.23 eV and -0.59 eV, respectively, combined with bandgaps (E g ).These two parameters (E F 0) are 1.62 eV and -0.54 eV in CTT.The obtained results are summarized in Table S1.It is worth mentioning that the UPS curve of CTT shows two tangent lines in the region for work function, in which one of the tangents coincides with that of CT.The overlap can be assigned to CeO 2 .And another tangent line possesses the position intersected with 0 eV, which has exceeded the normalized correction energy, attributing to the indirect band gap of anatase TiO 2 50.This phenomenon not only indicates the generation of anatase TiO 2 after annealing, but also manifests that CeO 2 dominates the positions of Fermi level both in CT and CTT.The composited Ti 3 C 2 and in-situ generated TiO 2 have more influence on the positions of conductive band (E CB ) and valence band (E VB ) compared with CeO 2 , as Fig. S5 illustrated.Meanwhile, the E CB and E VB in pristine anatase TiO 2 and CeO 2 are individually obtained combined with UV-Vis DRS (Fig. S6) and Mott-Schottky (M-S) plot (Fig. S7).The M-S experiments were carried out in Na 2 SO 4 solution and the flat band energy (E FB ) was prepared on the Eq. ( 7) below: (in which C is capacitance per unit area of space charge layers F/ m 2 , e is electron charge, is relative permittivity, 0 permittivity of the vacuum and N d is carrier density 1/m 3 ).The flat band potential of n-type semiconductor (The slopes of the tangent lines in MS plot are both positive.) is more negative about 0.1-0.3eV than the conduction band bottom, while the potential gap here is chosen to be 0.3 eV upon consideration of the active electrons 51.E CB can be calculated to -0.30 eV and -0.12 eV in CeO 2 and anatase TiO 2 , respectively.Scheme S2 shows the band structure of CTT combined with the respective E g and the work function of Ti 3 C 2 . Electrochemical impedance spectroscopy (EIS, Figs.4d andS8) and transient photocurrent responses (Figs.4e andS9) were conducted to characterize the efficiency of charge carriers transfer and electron-hole pair separation.CT(s) show significantly better photocurrent than pristine CeO 2 .However, the impedances of CTT-1, CTT-2 and CTT-3 all present approximately one order of magnitude smaller than CT(s).The radius of curvature is inversely proportional to the interface charge transfer efficiency and the separation efficiency of photo-generated electron holes.Similarly, CTT reveals an enhanced photocurrent intensity than CT and CeO 2 .It implies that interfacial dual heterojunction has superior carriers transfer and improved photocatalytic activity than that of CT(s).Additionally, it is undeniable that a small amount of TiO and CeO 2 are directly contacted during the synthesis process, following the Z-scheme 52,53, in which the electrons emitted from the CB of CeO 2 are transferred to the VB of TiO 2 by Ti 3 C 2 bridging.It also improves the photoelectric performance in CTT.The nitrogen adsorption/desorption isotherms and pore size distribution curves of above samples are shown in Figs.4f andS10.All isotherm curves except CeO exhibit an obvious uptake of N 2 as a result of capillary condensation in a wide relative pressure (P/P 0 ) range of 0.55-0.95,implying the existence of multiform pore distributions 54.The specific surface areas are increased with the decrease proportion of CeO 2 content both in CT and CTT, indicating that the interlayer pores of Ti 3 C 2 play a decisive role in the CO 2 adsorption process, which can be ascribed that the layered accordion structure in MXenes supplies abundant unfilled spaces.And the expanded slit layers in CTT provide more pores and cavities to accelerate the transfer of the reaction.The superior photoelectric properties of CTT verify the aforementioned DFT results that the interface heterojunctions prefer to playing a role in accelerating the electrons transport, nor in inhibiting the recombination of electrons and holes. Besides photoelectric performance, the efficiency of CO 2 photoreduction is another intuitive index to evaluate CO 2 photocatalysts.Fig. 5a and Table S2 show the results of photo-induced conversion from CO 2 to CO, H 2 and CH 4 by CT and CTT photocatalysts with varied concentrations.Corresponding CH 4 selectivity has been listed in the figure to facilitate a comparison.It can be observed that the main products of CT (s) are CO and H 2 , accompanied with little CH 4 .The existence of interfacial heterojunction constructed by CeO 2 and Ti 3 C 2 assists CT in harvesting better photocatalytic activity compared with pristine CeO 2 and P25 (Commercial TiO 2 ), but there is still a mass of by-product H 2 , as well the selectivity of CH 4 in CT is also below 25, which can be expressed as Eq. ( 8): (in which ERR represents electron reaction rate 2r (H 2 ) 8r (CH 4 ) 2r (CO), r is an empirical rate constant.)55. By contrast, the yield of CH 4 induced by the selective CO 2 photoreduction monotonically increases with the increase of Ti 3 C 2 , reaching a maximum of 70.68 upon CTT-3 at room temperature, together with by-products H 2 and CO decrease.CTT also maintains superior photocatalytic activity.The amount of CH 4 generated in CTT-3 is 3.40 times that of CT-3, which is closely related to the reinforced transport of carriers brought about by the dual interfacial heterojunction.The source of the C element in the hydrocarbons produced by the photocatalytic reduction of CO 2 is confirmed by isotope tracer analysis (Fig. 5b), which involves the photocatalytic reduction of different C-labeled CO 2 .Gas chromatography mass spectrometry (GC-MS) spectra are adopted to labeling the photocatalytic reduction of 12 C CO 2 and 13 C CO 2 .Obviously, the characteristic peaks dominated at m/z 16.1 ( 12 CH 4 ) and m/ z 17.1 ( 13 CH 4 ) are assigned to the photocatalytic reduction of 12 Clabeled CO 2 and 13 C-labeled CO 2 , respectively 56.This result verifies that the obtained CH 4 label is consistent with the CO 2 label, confirming that CO 2 is the source of the hydrocarbon compounds.The stability of CH 4 production rate and corresponding CH 4 selectivity is investigated using CTT-3 (Fig. 5c).The photocatalytic CH 4 yield and selectivity of CTT-3 shows no significant change, illustrating the excellent photostability.Furthermore, photothermal-assisted CO 2 reduction can sometimes achieve higher reduction efficiency.Therefore, we evaluated the photoreduction ability of CTT-3 using the same irradiation conditions at varied reaction temperatures (273 K, room temperature and 323 K, Fig. 5d and Table S3).It is amazing that the ability of CTT-3 to reduce CO 2 seems to be frozen at 273 K, almost no reduction products are generated, and the selectivity of CH 4 is vastly decreased.Only the yield of H 2 seems not to be affected much.In our previous work 57,58, we have calculated that Ti 3 C 2 possesses an excellent extinction coefficient (19.93 L g -1 cm -1 ), which is superior to other traditional 2D materials, such as Au NRs (3.9 L g -1 cm -1 ) 59, GO NSs (3.6 L g -1 cm -1 ) 60 and BP QDs (14.8 L g -1 cm -1 ) 61.Meanwhile, Ti 3 C 2 shows a photo-thermal conversion efficiency (PTCE) at 23.1 combined with the plot of natural logarithm upon the temperature driving force (Detailed calculation could be referred to the Supplementary material).This means that Ti 3 C 2 is quite sensitive to thermal treatment.Low-temperature environment will limit the catalytic activity of Ti 3 C 2 .The CH 4 selectivity and yield of CTT-3 at 323 K are both improved, as well the ratio of CH 4 yield to CO H 2 co-yield is obviously increased from 0.60 at room temperature to 0.86.Therefore, it is possibility to harvest a superior reduction yield and selectivity in CTT, which points out our work direction to further boost the selectivity and photoelectric performance under the condition of thermal assistance. It can be concluded that Ti 3 C 2 plays a key role in the dual interfacial heterojunction from thermal assistance results above, especially in carrier transfer.In this view, DFT calculation has been adopted again to investigate the details on interfacial behavior between Ti 3 C 2 and generated TiO 2 (The electron transport between CeO 2 and Ti 3 C 2 is relatively common, as well have already been discussed at the beginning).The models of Ti 3 C 2 and Ti 3 C 2 /TiO 2 (labeled as TT) are shown in Fig. 6a.We did not construct TT as a heterojunction considering that composited TiO 2 is generated from Ti 3 C 2 in situ after annealing.Instead, we removed the suspension (-OH, -F, --O) on the surface of Ti 3 C 2 and directly replaced suspensions with TiO 2 .The lattice parameters after geometric optimization are exhibited in Table S4.The competition of the interaction between TiO 2 and Ti 3 C 2 at the boundary of vacancies caused a certain tilt of the lattice in order to keep the energy of the system as low as possible, which is also reflected in the density of states (DOS, Fig. 6b) of Ti 3 C 2 and TT models.The partial DOS above Fermi surface are moved towards the Fermi surface as a whole due to the involvement of Ti atoms in TiO 2 (green lines), suggesting the transfer of electrons during the interaction from TiO 2 to Ti 3 C 2 surface.We suppose that the distortion of It can be seen that oxygen atoms in TT play a vital role, not only connecting Ti 3 C 2 and TiO 2 , but also participating in the transfer of electrons.Therefore, we further compared the projected density of states (PDOS, Fig. 6d) of O orbit in TT and Ti 3 C 2 .Two curves assigned to p x and p y orbitals in Ti 3 C 2 show almost coincident, owing that p x and p y orbitals interact with Ti atoms to form p-d hybrids with excellent system symmetry.However, p x and p y orbitals reveal obvious differences in intensity and peak position in TT.This phenomenon is also reflected in the PDOS of Ti through the comparison between TT (Fig. S11) and Ti 3 C 2 (Fig. S12), which the p x and p y of Ti in Ti 3 C 2 coincides, but not in TT.This may be caused by lattice distortion and symmetry breaking of p-d hybridization, which promotes the releasing of electron activity on TiO 2 to accelerate carrier transport.Considering the abovementioned results of thermal-assisted photoreduction at different temperatures, the catalytic activity and selectivity of CTT at 273 K with significantly lower than those of room temperature and 323 K can be explained that the lattice vibration caused by symmetry breaking of p-d hybridization slows down at low temperature, making the carrier migration inactive.And p z of Ti in TT is the principal orbital angular momentum of PDOS, whether it is in Ti 3 C 2 (Fig. S13) or generated TiO 2 (Fig. S14).The changes in p z of Ti would affect the overall Ti PDOS, including the s orbital.The abundant electrons are transferred from p-d orbitals to p z orbitals due to the breaking of the symmetry of p-d orbitals caused by generated TiO 2 , distinctly enhancing the intensity of p z in TT (Fig. 6e), which breaks the localization of electrons and accelerates electron migration.Therefore, CTT indicates a superior photoelectric performance, combined with the dual interfacial junction and optimized interfacial carrier migration. The mechanism of high-efficient photoreduction CH 4 selectivity in CTT is further investigated.The intermediate products for CO 2 reduction are confirmed by in-situ diffuse reflectance infrared Fourier transform spectroscopy (DRIFTS) upon CT-3 and CTT-3.Carbonate species (m-CO 3 2-) can be observed in the DRIFTS spectra of both CT (Fig. 7a) and CTT (Fig. 7b) under the initial adsorption condition 62, suggesting the adsorption capacity of the samples for CO is correct.However, m-CO 3 2-also possesses a peak around this region, and the peak position almost overlaps with the H peak 65.It is difficult to absolutely confirm this deduction from DRIFT patterns alone.Therefore, a facile H 2 decomposition (Fig. 7d) in CO 2 absence has been adopted to simulate the phenomenon that H 2 production gradually decreases with the increase of Ti The Ti K-edge X-ray absorption near edge (XANES, Fig. 7e) of CT and CTT are examined to further identify the local structural properties of Ti 3 C 2 .Both CT and CTT reveal the pre-and post-edge peak.The pre-edge peaks in CT and CTT recorded at approximately 4971 eV can be assigned to the transition of 1s electrons to the hybridized orbitals of t 2g (Ti 3d C 2p) and e g (Ti 3d C 2p) orbitals 66.Whereas, CTT possesses a unique peak located at 4968 eV, representing the transfer of carriers from Ti to metallic Ti 3 C 2 .Similarly, Ti foil (4968 eV) and Pt/TiO 2 (4969 eV) both occur the same typical peak, which can also be attributed to a dipole transition from the 1s orbital of the Ti atom to the p-component of the p-d hybridized orbital of the complex 67.However, CT not shows this identical peak to CTT.We speculate that the only generated TiO 2 in TT caused the symmetry breaking of p-d orbit hybridization, activating the p z orbital of Ti atoms, not in CT, as DFT results aforementioned.In addition, the post-strong main absorption occurs at approximately 4984-4985 eV, corresponding to the transition of the dipole allowed 1s electrons to unoccupied Ti 4p 68.The Ti oxidation state (Fig. S15a andb) in CT-3 and CTT-3 can be calculated to 3.66 and 3.19, respectively, referred by the first order derivative of XANES spectra and another titanium oxides (i.e.,Ti foil 0 and TiO 2).Extended X-ray absorption fine structure (EXAFS, Fig. 7f) spectra describes the bonding conditions in Ti 3 C 2 , CT-3, CTT-3 and Pt-TiO 2 .The peaks ranged from 1.5 to 1.6 A can be assigned to Ti-C and/or Ti-O.Pristine Ti 3 C 2 merely exists Ti-C, while Pt-TiO 2 only exists Ti-O.The annealed TiO 2 has a great influence on the lattice parameters, especially for the bond of Ti -Ti framework, which causes the overall lattice distortion as DFT calculation demonstrated.The XANES spectra exhibits that the catalytic activity of metallic Ti 3 C 2 promotes the rapid decomposition of H 2 molecules into monoatomic H .The evolution of CO molecules is further improved based on the dual interfacial heterojunction, endowing CTT superior electron hole pair separation efficiency and charge carrier mobility.The reaction between CO and H is subsequently facilitated by Ti 3 C 2 to induce the conversion of CO to CH 4 , achieving both superior photoelectric performance and high selectivity of CH 4 in CTT, compared with other Ti-based, MXene-based or Metal-based photoreduction catalysts listed in Table 1."
  },
  {
    "title": "Conclusions",
    "content": "In summary, the design concept is to make full use of abundant oxidative active vacancies presented on the surface of exfoliated Ti 3 C 2 to generate TiO 2 particles in situ by annealing CeO 2 /Ti 3 C 2 heterojunction.TiO 2 constructs another interfacial heterojunction anchored on Ti 3 C 2 nanosheets.Simultaneously, CeO 2 and TiO 2 reveal an antagonistic relationship, assigned that TiO 2 only generates at the vacancies not occupied by CeO 2 , reducing the possibility of direct contact between CeO 2 and TiO 2 .The various characteristics of CTT define the \"M-scheme\" photocatalysts.Moreover, the intimate relationship between TiO 2 and Ti 3 C 2 benefiting from in situ growth breaks the symmetry of p-d hybridization and releasing of electron activity on TiO 2 , accelerating the photogenerated electrons transfer from TiO 2 to Ti 3 C 2 .CTT harvest a superior photoelectric performance than that of CT.Meanwhile, byproduct H 2 molecules are rapidly decomposed into H upon metallic Ti 3 C 2 .It not only reduces the generation of by-products, but also improves the CH 4 selective of CO 2 photoreduction.In conclusion, CTT achieves both superior photoelectric performance and high selectivity of CH 4 with assistance of Ti 3 C 2 and generated TiO 2 in situ.We hope this work can exploit new horizons on MXene-based composites for photoconversion, especially developing the metallicity of MXene in depth. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. photogenerated holes in CeO 2 (TiO 2 ), achieving high electron-hole separation efficiency.In summary, no matter what kind of contact mode, electron transport from CeO 2 (TiO 2 ) to Ti 3 C 2 will occur under laser irradiation.The interface either plays a role in accelerating the electrons transport, or in inhibiting the recombination of electrons and holes.To summarized, the results of theoretical calculation show that Ti 3 C 2 possesses metallicity.Meanwhile, the compound of Ti 3 C 2 and TiO 2 (CeO 2 ) takes the possibility of improving the photoelectric performance. Fig. 1.Structural model of (a) Ti 3 C 2 , (b) CeO 2 and (c) TiO 2 .(d) Density of states (DOS) plots for Ti 3 C 2 , where red, blue and gray represent partial DOS of Ti, C and total DOS, respectively.The inset shows the planar average potential along z-axis and work function of Ti 3 C 2 .Band structure and calculated excitation energy of (e) CeO 2 and (f) TiO 2 .Fermi level was set to zero.(g) Schematic illustration for charge carrier migration on TiO 2 /Ti 3 C 2 /CeO 2 composite. Fig. 2. Synthesis, morphology and composition of as-prepared samples.(a) Schematic illustration for the synthetic procedure of CTT with hydrothermal and annealing.(b) Sectional SEM image of CT powder.(c) SEM image of CTT powder.Highlighted region is partial enlarged in (d) The corresponding cross-section profile and irregular polygon surrounding of CTT.Scale bar is 100 nm.(e) Energy-dispersive spectroscopic element mapping.From left to right: the integrated spectrum, Ce M spectrum and Ti K spectrum.(f) TEM image of CTT on the 200 nm and 50 nm scale bar.(g) Partial HRTEM of CTT showing lattice fringes. Fig. 3. Comprehensive characterizations of structural properties in CTT compared with CT.(a) XRD patterns of as-composited samples, angle from 5 to 50 .(b) Solid state NMR spectra of 13 C, represent the spinning side bands in the 13 C spectra.The intensity has been normalized.(c) Raman spectra of pristine Ti 3 C 2 , CeO 2 , CT and CTT at room temperature under 532 nm irradiation. Represent the characteristic peaks of anatase TiO 2 in CTT.Attached figures below amplify the detailed variation on vibration modes in regions of 100-200 cm -1 , 300-500 cm -1 and 550-700 cm -1 .(d) Aggregated C 1s and (e) O 1s XPS spectra of CTT and CT with fitted curves.All elements are calibrated with C 1s at the binding energy of 284.6 eV.(f) Aggregated Ti 2p XPS spectra.Insets reveal the corresponding bond positions of Ti-O, Ti-C and Ti-OH, respectively. Fig. 4. Photoelectric performance of as-synthesized samples.(a) UV-vis diffuse reflection spectra ranged from 300 nm to 800 nm.(b) The corresponding transformed Kubelka-Munk function curves.(c) UPS spectra for CT, CTT and pristine, respectively.(d) Impedance spectra with the corresponding equivalent circuit models under visible light irradiation.(e) Transient photocurrent responses in 0.5 M Na 2 SO 4 aqueous solution under UV-vis light irradiation at 0.1 V vs Ag/AgCl.(f) Nitrogen adsorption-desorption isotherms and specific surface area (inset) of the prepared samples. Fig. 5. Photocatalytic CO 2 reduction performance of CT and CTT.(a) Average yields of CH 4 , CO and H 2 on the comparison of CT and CTT samples with varied Ti 3 C 2 proportions in three hours.(b) GC-MS spectra of the photocatalytic 12 CO 2 and 13 CO 2 reduction over CTT, where m stands for mass and z stands for charge number of ions.(c) Photocatalytic CO 2 reduction cycling stability (left) and selectivity (right) test of CTT.(d) Comparison of the photocatalytic CO 2 reduction performance and CH 4 selectivity of CTT-3 and CT-3 under the temperature of 273 K, room temperature and 323 K. .Wu et al. Fig. 6.The distinction of Ti 3 C 2 and TT based on DFT calculation.(a) The model of TT and Ti 3 C 2 after structural relaxation.The blue, brown, red and gray spheres represent the Ti, C, O and H atoms, respectively.(b) The density of states (DOS) spectra of TT and Ti 3 C 2 .(c) The comparison of the differential charge density (CDD) and Electron localization function (ELF) in Ti 3 C 2 (left) and TT (right).Blue represents electron dissipation, and yellow represents electron aggregation in CDD patterns.And in ELF patterns, ELF 0 represents complete electron delocalization, which corresponds to the iconicity, while ELF 1 represents complete electron localization, which corresponds to the covalence.Projected density of states (PDOS) in O atoms of Ti 3 C 2 and TT.(d) P x and P y orbitals.(e) P z orbitals.For interpretation of the references to color in this figure legend, the reader is referred to the web version of this article. Fig. 7.The process and mechanism of photocatalytic CO 2 reduction in CTT.In situ DRIFTS spectra of photocatalytic CO 2 reduction on the comparison of (a) CT and (b) CTT under dark conditions (0-60 min) and light irradiation (1-90 min).(c) The detailed DRIFTS spectra of CTT with and without irradiation in region from 1450 to 1700 cm -1 .(d) Remaining H 2 obtained with respect to H 2 decomposition time using CT and CTT under different temperature conditions (273 K, room temperature and 323 K).(e) XANES of Ti K-edge for the Pt/TiO 2 , Ti foil, CT and CTT.Vertical lines mean the peak locations.Inset: detailed pattern ranged from 4963 eV to 4973 eV.(f) Fourier transforms of the Ti K-edge k 3 -weighted EXAFS of the Ti 3 C 2 , CT-3, CTT-3 and Pt-TiO 2 in R-space. Conceptualization, Methodology, Formal analysis, Writingoriginal draft.Wei Xu: Methodology, Software, Writingoriginal draft.Wenchao Tang: Methodology, Software, Formal analysis.Zhaokun Wang: Visualization.Yong Wang: Writingreview editing, Resources, Supervision, Funding acquisition.Zhengxing Lv: Resources, Validation, Methodology, Writingreview editing.Yu Zhang: Investigation, Formal analysis.Wei Zhong: Resources, Supervision.Hong-Ling Cai: Resources, Supervision, Project administration, Funding acquisition, Writingreview editing.Rusen Yang: Resources, Supervision.X.S. Wu: Resources, Supervision. 3 C 2 ratio both in CT and CTT.Both CT and CTT have the ability to decompose H 2 under visible-light irradiation.The H 2 decomposition rate shows a positive correlation with the increase in temperature.This may explain why CTT has superior CH 4 selectivity at high temperatures.Meanwhile, CTT shows a higher decomposition rate of H 2 than that of CT at room temperature and 323 K, which can be attributed to the superior carrier mobility of CTT than CT.We believe that Ti 3 C 2 plays a vital role in the process of decomposing H 2 to form monoatomic H , combined with its metallicity and thermal-sensitive properties.Afterwards, the monoatomic H and CO molecules formed from CTT work together on the Ti 3 C 2 platform to selectively generate CH 4 . The comparison of photocatalytic performance with other Ti-based, MXenebased or metal-based photoreduction catalysts. Y.Wu et al. This work was supported by the National Natural Science Foundation of China (11874200, 12104352), the Top-Notch Young Talents Program of China, Dengfeng Project B of Nanjing University.This research used Beamline BL11B of the Shanghai Synchrotron Radiation Facility (SSRF).We sincerely appreciate the engineer Dr. Zhengxing Lv and Dr. Jiong Li for the guidance on the EXAFS experiment. Supplementary data associated with this article can be found in the online version at doi:10.1016/j.nanoen.2021.106532."
  }
]