[
  {
    "title": "Doi",
    "content": "10.1016/j.powtec.2021.11.024"
  },
  {
    "title": "Article_Title",
    "content": "Full solar spectrum driven CO2 conversion over S-Scheme natural mineral nanocomposite enhanced by LSPR effect"
  },
  {
    "title": "Abstract",
    "content": "Using natural mineral to realize photocatalytic reduction of CO 2 is promising but remains a great challenge.Herein MoO 3-x quantum dots (QDs) immobilized on acid modified palygorskite (H-Pal) nanocomposite was prepared as powder photocatalyst for CO 2 conversion.The effect of various mass fractions of MoO 3-x on CO 2 reduction was investigated.Results reveal that the 30 MoO 3-x /H-Pal demonstrates remarkable CO 2 photoreduction property with a CH 3 OH yield rate of about 6.2 molg -1 h -1 under full spectrum irradiation.The MoO 3-x QDs possess high localized surface plasmon resonance (LSPR) effect induced by oxygen vacancy (Ov) not only enables the efficient capture of NIR photons, but also build S-scheme heterostructure with H-Pal mediated by Ov enhancing the separation of charge carriers as well as preserving high redox potential.In addition Ov act as active sites promoting the adsorption and activation of CO 2 .This work may provide a cost-effective strategy for the practical application of artificial photosynthesis."
  },
  {
    "title": "Experimental",
    "content": "Ammonium molybdate, thiourea and hydrochloric acid were purchased from Sinopharm Chemical Reagent Co., Ltd., China.Pal powder was obtained from Xuyi, China.Its composition contained 50-62 SiO 2 , 6-13 MgO, 8-14 Al 2 O 3 , and 6-9 Fe 2 O 3 . First, 1.0 g Pal was added to 100 mL 2 mol/L hydrochloric acid solution.Then, the above solution was placed in a water bath at 80 C for 16 h.After washing by pure water and drying at 80 C for 15 h, H-Pal was prepared. QDs/H-Pal 0.1 mol ammonium molybdate, 0.25 mol thiourea and 1 g H-Pal were mixed into 50 mL deionized water under vigorous stirring.The above solution was transferred into a 100 mL microwave hydrothermal reactor autoclave and hydrothermal treatment at 140 C for 1.5 h.Then, the samples were collected by centrifugation and washed with pure water and absolute ethanol.Finally, the MoO 3-x /H-Pal was prepared by drying at 60 C for 8 h.A series of composite materials were prepared by adjusting the mass fraction of MoO 3-x from 10 to 50.Pure MoO 3-x QDs photocatalyst were synthesized in the same way without adding H-Pal. The X-ray diffraction (XRD) of samples were measured on Rigaku D/ max 2500 PC diffractometer.The size and nanostructure were examined on transmission electron microscopy (TEM, JEOL-2100).X-ray photoelectron spectroscopy (XPS) was examined by an Al K was measured on a Quantum 2000 Scanning ESCA Microprobe instrument.In addition, Fourier transform infrared (FT-IR) spectra were conducted by a Nicolet IS5 using the KBr disk method.The optical properties were carried out by UV-vis-NIR diffuse reflectance (DRS) spectroscopy (UV-3600, DRS) equipped with an integrating sphere.Photoluminescence (PL) spectroscopy was measured on a photoluminescence detector (LS45).The time-resolved fluorescence decay spectrum was tested on FLS1000 series fluorescence spectrometer.Oxygen vacancies were tested at electron paramagnetic resonance (EPR) (Bruker EMXplus) spectrometer.The adsorption performance of the catalysts was performed by CO 2 -TPD on a AutoChem1 II 2920.The photocurrent response, Mott-Schottky graph and EIS Nyquist graph were tested on an electrochemical workstation (Auto Lab 302 N) equipped with standard three electrodes and a 300 W Xe lamp. The photocatalytic reduction of CO 2 was measured by a closed photochemical reactor at 25 C.The device is equipped with a condensate system, and the reaction is carried out in a sealed quartz glass bottle.0.1 g photocatalyst and 100 mL deionized water were added into the quartz glass bottle.Then, it was bubbled by CO 2 gas for 60 min to remove the impurity gases.The 300 W Xe lamp was used as the photocatalytic reaction light source while two optical filters were added to filter out visible and UV light.After every 0.5 h, the liquid products were collected by syringe and centrifugation, while gas products were taken from the photochemical reactor for subsequent analysis, and the products were detected by the gas chromatography (GC-7860 Plus) mounted with capillary column of dimension 30 m 0.25 mm and flame ionization detector (FID) detector.re attributed to the (110), ( 040) and (400) crystal planes of Pal, respectively 20.The diffraction peak of H-Pal is obviously lower than that of Pal, suggesting that the Mg 2 and Al 3 cations in the octahedral framework of Pal are replaced by H 21.The XRD pattern in Fig. 1 reveals sharp peaks attributed to the orthorhombic structure of MoO 3 (JCPDS NO. 05-0508) 22.Compared with standard PDF Card, the positions of the diffraction peaks of MoO 3-x shift to lower angle, which can be attributed to the expansion of inter-lamellar spacing in oxygendeficient MoO 3-x QDs 23.It is worth noting that compared with Pal and H-Pal, MoO 3-x /H-Pal nanocomposite has weaker peak intensity at 8.3corresponding to the Pal (110) crystal plane, while the peak position slightly shifts to the higher Bragg angle, which may be due to the binding of MoO 3-x QDs to the basal surface of Pal suggestive of close interaction.The mean crystallite size of MoO 3-x is calculated to be 4.8 nm from its (110) plane through Scherrer equation 24, justifying that the MoO 3-x species are in quantum dot scale.In addition, the characteristic peak of MoO 3-x QDs also shifts to higher angle, because certain cations in Pal, such as Mg 2 and Al 3 owning smaller ion radius than Mo ions may diffuse into the MoO 3-x QDs lattice, resulting in the lattice shrinkage of MoO 3-x QDs, which further confirms that the MoO 3-x QDs are fixed on the Pal surface 19."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The Fig. S1 shows the N 2 adsorption-desorption isotherms and pore size distribution curves of Pal, H-Pal, MoO 3-x QDs and MoO 3-x QDs/H-Pal.In Fig. S2(a), three samples show typical IV isotherm (the IUPAC classification) and the H 1 hysteresis loop, suggesting the presence of a mesoporous structure in the catalyst 18.Fig. S2(b) presents the corresponding pore size distribution curves centering ca.20 nm.Table S1 shows the specific surface area, pore volume and pore size distribution of the catalyst.It can be concluded from the table that the specific surface area and pore volume of Pal increase significantly after hydrochloric acid treatment, which can be attributed to the dissolution of the surface and interlayer adsorption impurities by hydrogen ions.However, when MoO 3-x QDs is loaded on the surface of H-Pal, its surface area is greatly reduced, which may be due to the fact that the partial pores of Pal is blocked by loaded MoO 3-x QDs. The FT-IR results of Pal, H-Pal, MoO 3-x QDs and MoO 3-x QDs/H-Pal are displayed in Fig. 3.The typical characteristic peaks of Pal at 3546 cm -1 , 3420 cm -1 and 1651 cm -1 correspond to the -OH stretching vibration of the adsorbed water, and the peaks at 469 cm -1 , 798 cm -1 and 1041 cm -1 are assigned to the bending vibration of Fe-OH, Mg-O and Al-O groups, respectively 20.The peak at 1193 cm -1 ascribed to the tensile vibration of Si-O in the tetrahedron, while the peak at 987 cm -1 indicate the existence of Si-O-Si bonds 26.The peak around 981 cm -1 from pure MoO 3-x QDs correspond to stretching vibration mode of the terminal oxygen atom (Mo O), and the peak around 1637 cm -1 are attributed to the adsorption of water in the sample 22.The hydroxyl groups on the surface of MoO 3-x QDs/H-Pal are weaker than H-Pal, indicating that MoO 3-x QDs is successfully loaded on H-Pal, consistent with the XRD analysis.Fig. S2 shows the Raman plots of MoO 3-x and MoO 3-x /H-Pal.Strong Raman peaks at 279.3, 335.5, 375.0, 659.7, 820.4 and 990.2 cm -1 are observed.Among them, the 279.3 cm -1 band is assigned to the wagging mode of the double bond O Mo O, the peaks at 335.5 and 375.0 cm -1 can be attributed to the bending vibration modes of Mo 3 -O and MoO, the peaks at 659.7 and 820.4 cm -1 are attributed to the stretching mode of the triply coordinated oxygen (Mo 3 -O) and doubly coordinated oxygen (Mo 2 -O).The intense peak at 990.2 cm -1 corresponds to the stretching mode of the terminal oxygen (Mo 6 -O), respectively, suggesting the strong interaction between MoO 3-x QDs and H-Pal, which is consistent with the TEM analysis. The surface chemical states were further investigated by XPS.All binding energies were calibrated by C 1 s binding energy at 284.8 eV.27,28.It should be noted that after the composite material is formed, the peak shifts to low binding energy owing to the increase in the intensity of the electron cloud around the Mo species 16.shows double peaks of MoO 3-x QDs derived from the oxygen vacancies (533.16eV) and lattice oxygen (530.58 eV).Compared with MoO 3-x QDs, the characteristic peak of O 1 s in the MoO 3-x QDs/H-Pal composite shows obvious move to low binding energy, which is attributed to the increased intensity of the electron cloud around O 23.As displayed in Fig. 4d, the typical peak of H-Pal in the Si spectrum at 101.25 eV is ascribed to Si 2p 3/2 , and the binding energy of Si 2p in MoO 3-x QDs/H-Pal is higher than that of H-Pal, which may be caused by the formation of Si-O-Mo bonds on the surface of the composite material 29.The binding energy shift of the characteristic peak suggests that an electron transfer process may occur at the MoO 3-x QDs/H-Pal interface 30. Fig. 5 exhibits the CO 2 -TPD plots of Pal, H-Pal and MoO 3-x QDs/H-Pal samples.H-Pal has a strong peak at about 95 C, while the CO 2 desorption peak of MoO 3-x QDs appear near 115 C.Furthermore, H-Pal exhibits bigger peak area and larger CO 2 desorption intensity than Pal, implying the enhanced adsorption of CO 2 .According to the TEM and FT-IR results, the H-Pal probably produces more abundant surface hydroxyl groups and acidic sites 31.Compared with H-Pal and MoO 3-x QDs, the peaks in the MoO 3-x QDs/H-Pal are higher implying that the CO 2 molecules interact more strongly with MoO 3-x QDs/H-Pal.The 30 MoO 3-x QDs/H-Pal own the highest peak intensity, and the 50 MoO 3-x QDs/H-Pal decreases, due to the fact that excessive MoO 3- x QDs agglomeration may reduce the adsorption performance 8. The UV-Vis-NIR DRS was used to evaluate the optical properties of the photocatalysts and the spectra pattern are shown in Fig. 6(a).Compared with Pal, the absorption edge of H-Pal has a red shift, which indicates that the H-Pal can enhance the absorption of solar light and adjust its energy band gap.And MoO 3-x QDs shows a broad absorption band centered at 950 nm in the NIR light regions.The absorption is related to LSPR due to the existence of substantial free carrier 12.After loading MoO 3-x QDs on the surface of H-Pal, the absorption ability of MoO 3-x QDs/H-Pal is expanded to the NIR light region, which increases the solar light utilization range due to the LSPR effect of MoO 3-x QDs.Fig. 6(b) exhibits the Tauc curve of the materials, and the band gap energies (Eg) are calculated according to the Tauc plots (h) n/2 A (h -Eg), where , h and A are absorption coefficient, photon energy and material constant, respectively.And n 1 or n 4 represent indirect and direct bandgap semiconductor respectively.The band gaps of H-Pal and MoO 3-x QDs are about 3.24 eV and 2.87 eV, respectively.Fig. 6(c) shows the Mott-Schottky (M-S) curves of H-Pal and MoO 3-x QDs, indicating typical n-type semiconductor characteristic.The curves exhibit that the flat-band potentials (V fb ) of H-Pal and MoO 3- x are 0.02 V and -0.55 V (vs.Ag/AgCl), corresponding to the Fermi level (E F ) of 0.24 V and -0.33 V (vs NHE), respectively 32.According to Fig. 6(d), the Fermi level MoO 3-x QDs/H-Pal is determined to be -0.25 V (vs NHE).The VB-XPS is employed to investigate the distance between valence band (VB) and Fermi level (E f ),according to the VB-XPS displayed in Fig. 6(e), the VB positions of the H-Pal and MoO 3-x QDs are converted to be 3.41 V and 2.32 V, respectively.According to E CB E VB -Eg, the corresponding conduction band (CB) positions for the H-Pal and MoO 3-x QDs can be calculated as 0.17 V and -0.55 V. The EPR spectra were measured to evaluate the oxygen defects in H-Pal, MoO 3-x QDs and MoO 3-x QDs/H-Pal, since the existence of oxygen vacancies leaves unpaired electrons in the crystal lattice.As shown in Fig. 7, no signal is detected for H-Pal, whereas the MoO 3-x QDs and MoO 3-x QDs/H-Pal both exhibit EPR signal at g 2.003, which can be attributed to the electrons trapped in O vacancies 33.Obviously, MoO 3-x QDs/H-Pal shows higher intensity than MoO 3-x QDs, indicating that H-Pal substrate indeed give rise to more O vacancies 34, which is consistent with the XPS result.The presence of oxygen vacancies may serve as initial charge carrier acceptor to inhibit the recombination of photoexcited electrons/holes and accelerate interfacial charge transfer from MoO 3-x QDs/H-Pal so as to pre-activate CO 2 .The introduction of oxygen vacancy and induced coordinately unsaturated metal atoms sites could strengthen the electron capture from CO 2 to CO 2 -, thereby promoting the photocatalytic CO 2 reduction. PL spectra were measured with an excitation wavelength of 325 nm to investigate the charge separation and migration behavior of the samples.The PL intensity can characterize the recombination rate of photogenerated electron-hole pairs 35.Generally, the higher PL intensity is, the faster electron-hole recombination rate is.The peak intensity of H-Pal is much stronger than MoO 3-x QDs and MoO 3-x QDs/H-Pal, which means high recombination rate of electron-hole pairs.In particular, 30 MoO 3-x QDs/H-Pal exhibits much lower intensity, revealing the low recombination rate of photogenerated electron-hole pairs.It should be pointed out that the MoO 3-x QDs displays the lowest PL intensity, which does not suggest that MoO 3-x has best charge separation rate, because different semiconductors have different PL responses and cannot simply be compared based on the charge separation rate 12,19.Transient photocurrent density response and electrochemical impedance spectroscopy (EIS) was carried out to evaluate the photogenerated charge separation and transfer of H-Pal, MoO 3-x QDs and MoO 3-x QDs/H-Pal.Fig. 8(b) exhibits the transient photocurrent density response plots under the dark and solar light.In general, the higher transient photocurrent density means the higher photogenerated charge separation and transfer efficiency.The transient photo current density of 30 MoO 3-x QDs/H-Pal is higher than other samples, indicating that 30 MoO 3-x QDs/H-Pal has higher photogenerated charge separation and transfer ability.The EIS Nyquist curves can be further implemented to explore the photogenerated charge separation of as-prepared samples.Smaller arc radius generally suggests higher photogenerated charge separation ability.In Fig. 8(c), the arc radius in the EIS Nyquist plots of 30 MoO 3-x QDs/H-Pal is smaller than other samples, also indicating that 30 MoO 3-x QDs/H-Pal owns higher photogenerated charge separation and transfer ability.The time-resolved fluorescence decay spectra were used to study the charge separation dynamics of the photocatalyst.The decay profiles of samples are fitted by a double exponential decay S2.The lifetime () of MoO 3-x is 7.66 ns, and the lifetime of 10, 30 and 50 MoO 3-x QDs/ H-Pal is 5.78 ns, 3.86 ns, 4.87 ns, respectively, revealing that the photogenerated carriers of 30 MoO 3-x QDs/H-Pal are more rapidly captured by active sites on the photocatalyst surface. 3.9.Photocatalytic reduction of CO 2 CO 2 photoreduction experiments were performed and the main product detected in this reaction system was CH 3 OH with trace amounts of CH 4 .Each data point was measured three times with error bars representing standard deviations less than 5.Under simulated solar light irradiation, the photocatalytic reaction rates of CH 3 OH over H-Pal, MoO 3-x QDs and MoO 3-x QDs/H-Pal samples with various mass ratio are shown in Fig. 9(a).Unfortunately, H-Pal has almost no photocatalytic ability to convert CO 2 .For MoO 3-x /H-Pal samples, the photocatalytic reaction rate increases with the rising amount of MoO 3-x until an optimal value.However, excessive MoO 3-x QDs seems to retard the photocatalytic reduction activity.30 MoO 3-x QDs/H-Pal exhibits the best photocatalytic reaction rate of CH 3 OH and CH 4 , which is about 6.2 molg -1 h -1 and 2.5 molg -1 h -1 , respectively, and CH 3 OH production is higher than recent literature reports 2,8.More owing to the LSPR effect of MoO 3-x QDs which can absorb NIR light and generate hot electrons.To verify that the product was mainly from the photocatalytic reduction of CO 2 rather than from the photodecomposition of organic residues on the of catalyst surface, three control experiments were performed, which were conducted under the conditions of (i) without light irradiation, (ii) absence of photocatalysts, (iii) under air and H 2 O in the presence of photocatalyst and light irradiation.Fig. S3 indicates that CH 3 OH yield is very low (0.95 molg -1 h -1 ) during these control tests, implying that the reduction of CO 2 happened mainly in the presence of photocatalyst, light irradiation and reactants 24.The photocatalytic CO 2 reduction stability of the 30 MoO 3-x QDs/H-Pal sample is revealed in Fig. 9(c).After 4 h solar light irradiation for each time, the photocatalyst was washed using pure water for the next photocatalytic CO 2 reduction test, which can maintain appreciable performance after five photocatalytic CO 2 reduction tests. DFT calculations were adopted to gain insight of the band structure.Fig. 10(a) show that the band gap of Pal is 3.73 eV, despite that the above experimental result obtained by UV-Vis is somewhat wider than the theoretical band gap value, possibly due the limitation of generalized gradient approximation in simulation 21.In Fig. 10(b), the The possible mechanism for photocatalytic reduction of CO 2 over MoO 3-x /H-Pal composites is proposed in Fig. 12(a) as follows.Both MoO 3-x QDs and H-Pal can be excited by solar light to produce electrons and holes.The e -in the CB of modified Pal and the h in the VB of MoO 3-x can easily recombine at the capture center Ov driven by the built-in electric field, thus establishing a S-scheme proces 34.The electrons in the CB of MoO 3-x QDs are remained and reduce CO 2 to form CH 3 OH due to more negative E CB of MoO 3-x QDs than the potential of CO 2 /CH 3 OH (-0.38 V) 37.Meanwhile, MoO 3-x can generate \"hot electrons\" due to the LSPR effect, then the \"hot electrons\" transfer from the Fermi level to CB, which increase the photogenerated electron density and largely enhance the photocatalytic CO 2 reduction ability 17.Under NIR light irradiation, only MoO 3-x QDs can be excited to generate electrons and holes.At this time, Pal has no light response and only serves as a carrier.The \"hot electrons\" may be generated by the LSPR effect.Since the E CB of MoO 3-x QDs is more negative than the CO 2 / CH 3 OH potential, the \"hot electrons\" are directly involved in the reduction reaction to produce CH 3 OH.This phenomenon contributes to the photocatalytic performance of the MoO 3-x QDs/H-Pal composites under NIR light irradiation.Therefore, the LSPR effect enable the harvesting of NIR light which enhance the utilization of solar light, and the S-scheme heterojunction accelerate the separation of photogenerated carriers, both leading to the remarkable CO 2 photoconversion ability.The photocatalytic CO 2 reduction process is put forward as follows:"
  },
  {
    "title": "Conclusions",
    "content": "In summary, novel S-scheme MoO 3-x QDs/H-Pal composites were successfully prepared by microwave hydrothermal method.Benefited from the high surface area and functional -OH groups of H-Pal, the MoO 3-x QDs grow in-situ on the surface of H-Pal to form MoO 3-x QDs/ H-Pal heterostructure, which demonstrates excellent photocatalytic CO 2 reduction under both solar and NIR light irradiation.The enhanced photocatalytic activity of the composites is originated from the LSPR effect and plasmon-induced \"hot electrons\" injection.Meanwhile, the migration of photogenerated charge carriers follows the S-scheme mechanism mediated by Ov, effectively accelerating the separation of photogenerated electron-holes to retain strong redox ability.Moreover, the Ov play an important role in the adsorption and activation of CO 2 .Under solar light irradiation, the CH 3 OH production can achieve the highest of 6.2 molg -1 h -1 , while the CH 3 OH production can achieve 2.1 molg -1 h -1 under NIR light irradiation.The catalyst demonstrates good stability during five recycle times.This work may pave a way for the CO 2 conversion to high value-added product. Fig. 1 demonstrates the XRD patterns of Pal, H-Pal, MoO 3-x and MoO 3-x QDs/H-Pal.The main diffraction peaks at 8.3, 19.7and 27.3are attributed to the (110), (040) and (400) crystal planes of Pal, respectively20.The diffraction peak of H-Pal is obviously lower than that of Pal, suggesting that the Mg 2 and Al 3 cations in the octahedral framework of Pal are replaced by H 21.The XRD pattern in Fig.1reveals sharp peaks attributed to the orthorhombic structure of MoO 3 (JCPDS NO. 05-0508)22.Compared with standard PDF Card, the positions of the diffraction peaks of MoO 3-x shift to lower angle, which can be attributed to the expansion of inter-lamellar spacing in oxygendeficient MoO 3-x QDs23.It is worth noting that compared with Pal and H-Pal, MoO 3-x /H-Pal nanocomposite has weaker peak intensity at 8.3corresponding to the Pal (110) crystal plane, while the peak position slightly shifts to the higher Bragg angle, which may be due to the Fig. 1.XRD patterns of Pal, H-Pal, MoO 3-x QDs and MoO 3-x QDs/H-Pal. morphologies of Pal, H-Pal, MoO 3-x QDs and MoO 3-x QDs/H-Pal were characterized by TEM as shown in Fig. 2. In Fig. 2(a), the Pal demonstrates a one-dimensional rod structure with a diameter of about 30-40 nm.After modified with hydrochloric acid, the 1D rod structure is maintained as shown in Fig. 2(b), but the surface of H-Pal becomes rough, possibly indicative of abundant active sites 25.It can be seen in Fig. 2(c) that MoO 3-x QDs are fixed on the surface of H-Pal to form intimate contact.Fig. 2(d) shows the HRTEM of MoO 3-x QDs/H-Pal where the lattice fringe distanced is 0.34 nm assigned to the crystallographic plane (110) of MoO 3-x QDs.And the QDs are tightly attached with the H-Pal surface to form a distinct heterojunction.Fig. 2(e) exhibits the selected area electron diffraction (SAED) pattern of MoO 3-x QDs/H-Pal, where the diffraction rings from inside to outside correspond to (110), (040) and (021) faces of MoO 3-x QDs.Fig. 2(f) displays the EDS result of MoO 3-x QDs/H-Pal, where Mo and O are from MoO 3-x QDs, Si, Mg, Al and Fe are from Pal and Cu, C are mainly from the copper grid. Fig. 2. TEM images of Pal (a), H-Pal (b), MoO 3-x QDs/H-Pal (c), HRTEM (d), SAED (e) and EDS (f) of MoO 3-x QDs/H-Pal. Fig. 4a exhibits the survey scan spectrum of MoO 3-x QDs/H-Pal and MoO 3-x QDs where Mo, O and Si peaks are present consistent with the spectrum of EDS.Fig. 4b exhibits the Mo 3d spectrum of MoO 3-x QDs/ H-Pal and MoO 3-x QDs.The peaks at 235.90 and 232.70 eV are attributed to Mo 5 3d 3/2 and Mo 5 3d 5/2 respectively, suggesting the existence of valence state Mo 5 in the composites, whereas the peaks at 234.22 and 231.35 eV correspond to Mo 6 3d 3/2 and Mo 6 3d 5/2 Fig.4c Fig. 3. FI-IR spectra of Pal, H-Pal, MoO 3-x QDs and MoO 3-x QDs/H-Pal. Fig. 5. CO 2 -TPD profiles of Pal, H-Pal, MoO 3-x QDs and MoO 3-x QDs/H-Pal. Fig. 6.UV-Vis-NIR spectra of Pal, H-Pal, MoO 3-x QDs and MoO 3-x QDs/H-Pal (a), corresponding Tauc plots of Pal, H-Pal and MoO 3-x QDs (b), M-S plots of H-Pal, MoO 3-x QDs (c)and MoO 3-x QDs/H-Pal (d), VB-XPS spectra of H-Pal(e) and MoO 3-x QDs (f). Fig. 7. EPR spectra of H-Pal, MoO 3-x QDs and MoO 3-x QDs/H-Pal. Fig. 8. PL spectra (a), photocurrent transient response(b), EIS Nyquist plots (c), and (d) time-resolved transient photoluminescence spectra (TRPL) of samples H-Pal, MoO 3-x QDs and MoO 3-x QDs/H-Pal. Fig. 9. Photocatalytic CO 2 reduction performance of sample under solar light (a) and NIR light irradiation (b), Stability of 30 MoO 3-x QDs/H-Pal after 5 cycles of CO 2 photoreduction to CH 3 OH under solar light (c). Fig. 10.Band structure of (a) Pal and (b) MoO 3-x ; Density of states (DOS) of (c) Pal and (d) MoO 3-x . This work was supported by the National Natural Science Foundation of China (51674043), Jiangsu High Institutions Key Basic Research Projects of Natural Science (21KJA430002), Foundation of Key Laboratory of Clay Mineral Applied Research of Gansu Province, Lanzhou Institute of Chemical Physics, Chinese Academy of Sciences (CMAR-2020-2), and China Scholarship Council (201708120050).We thank Analysis and Testing Center of Changzhou University for the characterization. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://doi.org/10.1016/j.powtec.2021.11.024."
  }
]