[
  {
    "title": "Doi",
    "content": "10.1016/j.jcat.2017.06.016"
  },
  {
    "title": "Article_Title",
    "content": "Is water more reactive than H2 in photocatalytic CO2 conversion into fuels using semiconductor catalysts under high reaction pressures?"
  },
  {
    "title": "Abstract",
    "content": "The reaction pressure in the photocatalytic conversion of CO 2 into fuels is optimized between 0 and 0.80 MPa under CO 2 and moisture.The higher reactivity of water than H 2 was observed at higher pressure and the reason was clarified using several 10-lm-thick semiconductor-based photocatalysts.The best Pd/TiO 2 photocatalyst produces methane with a reaction order of 0.39.The sum of independent total formation rates of C-containing compounds under UV and visible light does not account for that under UV-visible light, demonstrating synergetic reaction mechanism on Pd for CO 2 reduction by excited electrons via surface plasmon resonance and on TiO 2 for water oxidation.Active metallic Pd and O vacancy sites due to O 2 formation from H 2 O are confirmed by in situ monitoring of EXAFS N(Pd-Pd) 5.9-6.2;N (Ti-O) 5.2-3.5 and the decrease of the H-bound and bi/tri-coordinated OH peaks in FTIR.Effective redox-site separation explains the higher reactivity of water than H 2 ."
  },
  {
    "title": "Experimental",
    "content": "The synthesis/preparation procedure of catalysts used in this study (Table 1) was described in our preceding paper 16.Sup-ported Pd catalyst on TiO 2 was prepared via liquid-phase reduction starting from 1.0 mM of Na tetrachloropalladate (98, Sigma Aldrich) and TiO 2 (P25, Degussa; anatase:rutile phase 4:1, specific surface area 60 m 2 g A1 ) stirred at 290 K for 24 h.Then, 40 mM of NaBH 4 aqueous solution was added in a molar ratio of Pd: NaBH 4 1:8 and the suspension was stirred at 290 K for 1 h, filtered, and the obtained gray precipitate was washed with deionized water before drying under vacuum at 290 K for 24 h.The obtained catalyst was denoted as Pd/TiO 2 and the Pd content was 0.5 wt (Table 1). Cross-sectional scanning electron microscopy (SEM) images were obtained using a model JSM-6510 (JEOL).A tungsten filament was used in the electron gun, and the electron accelerating voltage was 20 kV.The photocatalyst film formed on a Pyrex glass plate was cut and mounted on the Al sample holder using an adhesive.The incident angle of electrons with a reference to the normal line of the sample surface was between 75and 85.The magnification was between 200 and 3000 times.High-resolution transmission electron microscopy (HR-TEM) images were observed using a Model H-7650 transmission electron microscope (Hitachi) at an accelerating voltage of 100 kV.A tungsten filament was used in the electron gun and the samples were mounted on conducting carbon with a Cu grid mesh (150 mesh per inch).The magnification was between 60,000 and 200,000 times. X-ray diffraction (XRD) patterns were measured using a model Mini Flex (Rigaku) at a Bragg angle (h B ) of 2h B 20-60with a scan step of 0.02and a scan rate of 0.3 s per step.The data scan was performed at 30 kV and 15 mA using Cu Ka emission (wavelength k 0.15419 nm) 27 and a nickel filter.Crystallite sizes (t) were estimated using the Scherrer equation Palladium K-edge XAFS spectra were measured at 290 K in the transmission mode in the Photon Factory Advanced Ring at the High Energy Accelerator Research Organization (KEK, Tsukuba) on beamline NW10A 28,29.The storage ring energy was 6.5 GeV, and the ring current was 52.1-20.7 mA.A Si (3 1 1) double-crystal monochromator and a Pt-coated focusing cylindrical mirror were inserted into the X-ray beam path.The X-ray intensity was maintained at 67 of the maximum flux using a piezo-translator applied to the crystal to suppress higher harmonics.The slit in front of the I 0 ionization chamber had an opening size of 1 mm (vertical) A 2 mm (horizontal).Separately, during the photoconversion tests, the samples (10 mg) on the Pyrex glass plates were placed under 0.40 MPa CO 2 and 2.3 kPa of moisture, and measurements took place at 290 K in the fluorescence mode using a Lytle detector, placing 3-lm-thick RuO 2 filter between the sample and the I f ion chamber 30.The Pd K-edge absorption energy was calibrated to 24,348 eV using the spectrum of a 12.5-lm-thick Pd foil 27. Titanium K-edge XAFS spectra were measured in the KEK Photon Factory on beamline 9A, 9C, and 12C 31.The storage ring energy was 2.5 GeV, and the ring current was 449.3-324.4mA.A Si (1 1 1) double-crystal monochromator and a pair of bent conical/cylinder mirrors and/or double flat mirrors were inserted into the X-ray beam path.Spectra for the Pd/TiO 2 sample (10 mg) diluted by boron nitride were measured in the presence/absence of ultraviolet (UV)-visible irradiation provided by a 500-W Xe arc lamp (model OPM2-502, Ushio) at the beamline 32.The Ti K-edge absorption energy was calibrated to 4964.5 eV using the spectrum of the 5-lm-thick Ti foil 27.XAFS data were analyzed using the XDAP software package 33.The pre-edge background was approximated by a modified Victoreen function C 2 /E 2 C 1 /E C 0 .The background of the postedge oscillation was approximated by a smoothing spline function and was calculated using Eq. ( 12) for the particular number of data points i, where k was the angular wavenumber of photoelectrons, l was the X-ray absorption coefficient, t was the thickness of sample, and the typical values for smoothing factor were between 0.1 and 3. Data Points Multiple-shell curve fitting was performed 16,31 for the Fourier-filtered k 3 -weighted extended XAFS (EXAFS) data in k-and interatomic distance (R)-space using empirical amplitudes extracted from the EXAFS data for Pd foil, PdO powder, and rutile-type TiO 2 powder.The R and its associated coordination number (N) for the Pd-Pd, Pd-O, Ti-O, and Ti(-O-)Ti pairs were set to 0.275 09 nm with an N value of 12 34, 0.2026 nm with an N value of 4 35, 0.1959 nm with an N value of 6, and 0.3058 nm with an N value of 12 31,36,37, respectively.The many-body reduction factor S 0 2 was assumed to be equal for both the sample and the reference.The number of independent data points (m) in the fit range was calculated based on the Nyquist theorem modified for EXAFS by Stern based on the ranges of k and R 33. Based on the fitting and error analysis presented in our previous paper 16, two shell fits (four variables in each shell) were chosen for both Pd and Ti K-edge EXAFS analyses.The adsorption of O 2 was monitored for 100 mg Pd/TiO 2 fine powder that was previously irradiated using UV-visible light for 5 h in a quartz glass reactor connected to a Pyrex glass system under vacuum connected to rotary and diffusion pumps (10 A6 Pa) 2.Then, 2.3 kPa of O 2 was introduced to the glass system and the pressure change was monitored using a capacitance manometer (models CCMT-100A and GM-2001, ULVAC) under the irradiation of UV-visible light for 1 h and then in the absence of light for 5 h.The temperature was 295 K and the total volume of the glass system was 167.4 mL. FTIR spectra were measured using a model FT/IR-4200 spectrophotometer equipped with a mercury-cadmium-tellurium-M detector (JASCO) in the wavenumber region between 4000 and 650 cm A1 .100 mg of the photocatalyst disk was set on a holder in a quartz cell equipped with two NaCl windows on both sides and connected to a glass system that could be evacuated using rotary and diffusion pumps (10 A6 Pa) 32. Separately, the quartz cell was connected to the glass system, but 100 mg of the Pd/TiO 2 powder was placed in quartz glass reactor connected to the glass system.The photocatalyst was irradiated by UV-visible light from Xe arc lamp and the changes of reaction gases CO 2 and moisture, 13 CO 2 (purity 99.5, 13 C 99, Cambridge Isotope Laboratories) and moisture was monitored by FTIR. The synthesized/prepared catalysts (Table 1) were immersed in deionized water and agitated by ultrasound (430 W, 38 kHz) for 3 min.The suspension was mounted on a Pyrex glass plate (25 mm A 25 mm A 1 mm) and dried at 373 K for 12 h.The area of the obtained film was 20 mm A 20 mm.The films on the plates or the as-synthesized fine powder samples in Pyrex dishes (U internal 37 mm) were introduced into a homemade high-pressure stainless steel reactor equipped with quartz double windows, a pressure gauge, and Swagelok valves 16,17.The effective internal volume of the reactor was 98.4 mL.CO 2 gas (0.12-0.80 MPa) was introduced through a stainless water bubbler (Taiatsu Glass Kogyo, inner volume 120 mL; model TVS-N2-120) at 293 K.The photocatalyst in the stainless steel reactor was irradiated with UV-visible light provided by a 500-W Xe arc lamp (model OPM2-502, Ushio) through the quartz windows for 5 h.The distance between the light exit and the photocatalyst surface was 82.7 mm, and the light intensity at the center of the photocatalyst was 81.6 mW cm A2 16.The quartz window of the high-pressure reactor absorbed/reflected 9.5 of the light, and 100 mg of Pd/TiO 2 powder on Pyrex dish and 10 mg Pd/TiO 2 film on Pyrex glass plate absorbed/reflected/scattered 40 and 49 of the light, respectively 16.Densely mounted films were advantageous for light absorption efficiency compared with fine Pd/TiO 2 powders based on the difference of their mean area densities of 2.5 mg cm A2 and 9.3 mg cm A2 , respectively, and the exposed ratio of particles.Fine powders should reflect/scatter more light at exposed faces, and less light reach the lower part of the layers compared to densely mounted films. For comparison, photocatalytic tests were also performed using L37, L38, L39, L42, Y48, and Y52 filters (2.5 mm-thick, Kenko) that removes light less than k 370, 380, 390, 420, 480, and 520 nm, respectively 38, or a U-330 filter (2.5 mm-thick, Kenko) that removes light less than k 250 nm and between k 390 nm and 695 nm 39, which were set between the light exit and highpressure reactor. After irradiation for five hours, the reaction gas was analyzed using packed columns of 13X-S molecular sieves and polyethylene glycol (PEG-6000) supported on a Flusin P (GL Sciences) set in a gas chromatograph (GC) equipped with a thermal conductivity detector (model GC-8A, Shimadzu) 19,20.Helium (99.99995) was used as a carrier gas for all analytes except H 2 , for which argon (99.998) was used instead.The amount of methanol and moisture was double-checked by concentrating them using a trap made of a mixture of diethyl ether and dry ice (192 K) 17 in order to separate them from H 2 and most of CO 2 . Blank tests were also performed by eliminating one of the four control factors or adding an alternative control factor: (i) reactants, (ii) catalyst, (iii) UV-visible light, and (iv) temperature, i.e., in 0.40 MPa of CO 2 only, in 2.3 kPa moisture only, or 0.4 MPa He or Ar (in the absence of any reactants), in the absence of catalyst (or in the absence of Pd or O V sites), in the absence of any light at 299 K or 353 K, in the absence of UV light at 296 K, and in the absence of (most of) visible light at 296 K. The surface of the fresh Pd/TiO 2 film (Fig. 1a1,a2) 16 and the one used for photoconversion test under CO 2 (0.40 MPa) and moisture (2.3 kPa) for 5 h (Fig. 1b1,b2) both on Pyrex glass are flat and smooth within the variance of 5 lm, based on cross-sectional SEM images.In the close-ups (Fig. 1a2,b2), the mean film thickness is 14 lm 3 lm.In the comparison between fresh and used samples, the homogeneous light gray contrast in the fresh sample (Fig. 1a1, a2) changes to more densely packed dark gray from the surface (b1) until the upper approximately 5 lm of the film (b2).Such change is observed in more than the half of the cross-sectional views for used samples, suggesting partial reduction of the upper TiO 2 layer to include more O V sites (Eqs.( 5) and ( 50 )).To confirm the crystalline phase, the XRD pattern is measured for these samples.The peak intensity and the width for anatase 1 0 1, 1 0 3, 1 1 2, 2 0 0, 1 0 5, and 2 1 1 and rutile 1 1 0, 1 0 1, and 0 0 4 diffraction does not change significantly (by 4-10 and 13-19, respectively, except for very weak peaks) after the photoconversion test (Supplementary material, Fig. S1 and Table S1).The mean particle size is evaluated at 25 8 nm based on Eq. ( 11) for eight peaks 16 (Table 1).The anatase 1 0 1 peak of low surface energy is relatively weaker for the films compared to that for fine powder, suggesting higher surface energy in the exposed crystalline face of the films 16.The mean particle size was in accordance with the distribution obtained based on HR-TEM (30-50 nm, Table 1) if lower detection limit for TEM (0.2 nm) is taken into account. The Pd states are monitored by Pd K-edge X-ray absorption near-edge structure (XANES).The post-edge pattern for fresh Pd/TiO 2 sample (Fig. 2c) is not the same as that for PdO or Pd foil (a, b) but mostly resembles that for the mixture of spectra for Pd foil and PdO with the mixing ratio 3:2 (f; see also the comparison in Fig. 2, right, top). Then, 100 mg of Pd/TiO 2 is placed under CO 2 (3.4 kPa) and moisture (1.2 kPa) and UV-visible light for 5 h (Table 3A-a).The XANES post-edge pattern (Fig. 2d) resembles more that of the mixture of spectra for Pd foil and PdO with the mixing ratio 3:1 (Fig. 2g; see also the comparison in Fig. 2, right, bottom).Conversely, the post-edge pattern for 10 mg Pd/TiO 2 under higher CO 2 pressure (0.40 MPa) and moisture (2.3 kPa) and UV-visible light for 5 h (Table 3A-d) resembles more that of fresh Pd/TiO 2 (Fig. 2c,e).Following, the sample of Fig. 2e is irradiated under UV-visible light during XANES measurement (Fig. 2e 0 ).The intensity of the first post-edge peak at 24,370 eV becomes weaker, suggesting a decrease in the O-coordination around the Pd site. As a complement to XANES, under CO 2 (3.4 kPa) and moisture (1.2 kPa) and UV-visible light for 5 h (Table 3A-a), the N value for the Pd-Pd interatomic pair based on EXAFS analysis is 9.2 (Table 2A-d), corresponding to a mean particle size of 2.6(0.3)nm (Table 1) 40.Accordingly, the Pd-Pd interatomic pair is more pronounced in the Fourier transform (Fig. S2A-d), in consistency with the XANES pattern with greater Pd 0 contribution (Pd 0 : Pd II 3:1; Fig. 2d).Conversely, the N(Pd-Pd) value changes negligibly from fresh Pd/TiO 2 (5.9) to that after 0.40 MPa of photoconversion test for 5 h (6.2;Table 2A-c, e), demonstrating Best-fit results of (A) Pd K-edge and (B) Ti K-edge EXAFS spectra for TiO 2 and Pd/TiO 2 photocatalysts.that the Pd valence state and the mean particle size change only slightly under these conditions.In contrast, the N(Pd-O) value decreases from 1.9 for fresh to 1.0 after the test at 0.40 MPa, suggesting an increase of the O V sites at the interface between the Pd and TiO 2 surfaces. To complement the Pd K-edge results, Ti K-edge EXAFS is studied for Pd/TiO 2 (10 mg) as prepared (Table 2B-c and Fig. S2B-c) and after testing under 0.40 MPa CO 2 , moisture, and UV-visible light irradiation for 5 h (Table 2B-e and Fig. S2B-e Under CO 2 (100 kPa), moisture (2.2 kPa), and UV-visible light, the change in N(Ti-O) values was monitored (Fig. 3A,C).In comparison to the initial value (6.0) under CO 2 , moisture, and dark, the value significantly decreased to 4.9-5.7 (mean value 5.3) during light irradiation for 3.5 h.At 30 min after the light was off, the N(Ti-O) value increased to the original value (6.0).N(Ti(-O-) Ti) values followed a similar trend: decrease from initial 11.3 to 9.7-10.6 during the irradiation of UV-visible light and increase to 10.9 at 30 min after the light was off (Fig. 3B).Taking the experimental and fit errors into account (Fig. 3A,B), the N(Ti-O) and N(Ti (-O-)Ti) values would evaluate the concentration of O V sites in/on TiO 2 semi-quantitatively. Corresponding to the time course of Ti K-edge EXAFS, that of Ti K pre-edge region was also plotted (Fig. 3D-F).In comparison to data for fresh sample under CO 2 (100 kPa), moisture (2.2 kPa), and dark (Fig. 3D: 0 min), the peak pattern changed after the UV-visible light was irradiated, especially in the region between 4968 and 4971 eV (Fig. 3D: 5, 30 min).This trend is in good agreement with the increase of pre-edge peak at 4967.6 eV owing to 5 coordination Ti sites 424344 or 4 coordination Ti sites 43,44 in comparison to that at 4968.8 eV owing to 6 coordination Ti sites 42.Please note that there is minor energy calibration difference between reference 42 and this study. While the peak pattern negligibly changed during the UV-visible irradiation (Fig. 3E: 60, 100, 130, 150 min; Fig, 3F: 180 min), the pattern clearly changed after the light was off (Fig. 3F: light off 0, 30 min).The last two peak patterns were very similar to that of fresh sample before light irradiation (Fig. 3D: 0 min), in consistent with the reversible change of the N(Ti-O) and N(Ti(-O-)Ti) values based on EXAFS analyses (Fig. 3A,B). 2 and moisture at 0.12-0.80MPa First, photoconversion tests at 0.40 MPa CO 2 and moisture are performed by changing the amount of Pd/TiO 2 photocatalyst between 100 mg and 10 mg.This is the most active photocatalyst among the catalysts in Eq. ( 3) under the reaction conditions from CO 2 and H 2 in reference 16; under CO 2 and moisture, it is methane-selective among C-containing compounds (99-82 mol; Table 3A-b, d).The total formation rate of C-containing products using 10 mg Pd/TiO 2 (23 lmol h A1 g cat A1 ) is higher by 16 times than that using 100 mg, probably due to the smaller reflectance/scattering by 10 mg of film.Thus, light absorption of 10 mg of film is more effective, in comparison to 100 mg powder.The peak due to low-energy anatase 1 0 1 plane is less intense by 26 for film in comparison to that in powder while high-energy anatase 1 0 3, 1 1 2, and ritile 1 0 1 planes are slightly favored relatively 16.The energetically unstable 1 1 2 plane is preferred for a TiO 2 film formed via aerosol chemical vapor deposition of titanium iso-propoxide on to the substrate at 773 K, and it enhances its electron mobility 13.The difference of preferred planes of film between this study (mean thickness 14 lm 3 lm, Fig. 1) and reference 13 (mean thickness 1.5 lm) would be due to the preparation procedure of film rather than the film thickness. The total formation rates of C-containing compounds using moisture (Table 3B-i) are compared to the corresponding ones at the same total pressure using H 2 (Table 3B-ii) for Pd/TiO 2 .Using Pd/TiO 2 at 0.40 MPa, the rate of 23 lmol-C h A1 g cat A1 using moisture (Table 3A-d) is lower by 0.61 times than that using H 2 (Table 3B-d-i, ii) 16. Based on the results of the photoconversion tests, we examine the mass balance under CO 2 and moisture using the following equations.r is the molar formation rate of the product. The conversion of CO 2 into C-containing products via Eqs.( 16)-( 18) and a competing side reaction (SR) of water splitting (Eq.( 19)) are considered.The reverse reaction of Eq. ( 19) is also taken into account to include the effect of a secondary reaction of formed H 2 with CO 2 to produce C-containing products and water 16. Based on Eq. ( 14), the theoretical O 2 amounts formed using Pd/ TiO 2 , in the tests at 0. 2B-c, e, e 0 and Fig. 3).The pressure dependence of the photoformation rates on CO 2 and moisture is investigated using Pd/TiO 2 (see also Supplementary material, Section S3).Major methane formation is preserved (Fig. 4A).At 0.12-0.80MPa using 10 mg catalyst, the reaction order of methane, CO, and H 2 is 0.39, 0.62, and 0.89, respectively (Table 3A-c, d, and g and Fig. 4A).H 2 formation through Eq. ( 19) is accelerated by the increase of the CO 2 pressure P(CO 2 ), suggesting that it is correlated with the paths toward C-containing products via Eqs.( 16)- (19).Using Pd/TiO 2 at 0.80 MPa, the total C-containing product formation rate using moisture was 37 lmol h A1 g cat A1 (Table 3A-g and Fig. 4A) that was higher by 4.3 times than that using H 2 (Table 3B-g-i, ii). The dependence of photoformation rates on Pd/TiO 2 film thickness was also investigated (Fig. 4B).On the basis of rates in the unit of lmol h A1 g cat A1 , formation rates for methane and CO gradually increased as the mean thickness of Pd/TiO 2 decreased from 26 lm to 16 lm.In contrast, formation rates especially for methane dramatically boosted to 66 lmol-CH 4 h A1 g cat A1 when the mean thickness further decreased from 16 lm to 4.6 lm, suggesting that upper layer of Pd/TiO 2 film was more effectively utilized for the photocatalysis as suggested in the color change of top 5 lm by cross-sectional SEM for sample after photocatalytic test (Fig. 1b2).H 2 photoproduction increased linearly as the catalyst thickness gradually decreased from 26 lm to 4.6 lm.The dependence for O 2 formation rates on film thickness was not clear (Fig. 4B). As a control, 0.10 MPa CO 2 and 2.3 kPa moisture is input, and then photocatalytic testing is performed only in 0.40 MPa CO 2 (Table 3A-e).In comparison to the corresponding standard test under 0.40 MPa CO 2 and 2.3 kPa moisture (Table 3A-d), the C-containing product selectivity of 82 mol for methane, 18 mol for CO, and 0.21 mol for methanol (Table 3A-e) remains essentially the same at 82, 18, and 0.27 mol, respectively (Table 3A-d).However, the total formation rates of C-containing products increase by 1.32 times to 31 lmol-C h A1 g cat A1 in the absence of moisture (Table 3A-e).This result suggests that water, which is stored as adsorbed or in the form of the hydroxy group during pretreatment, photoconverts CO 2 more efficiently.The theoretical O 2 amount formed is 6.0 lmol based on Eqs. ( 14) and ( 15) and accounts for only 4.6 of the experimental O 2 evolution (5.5 lmol h A1 g cat A1 to 0.28 lmol, Tables 3A-e and 4e), similar to the theoretical/experimental ratio of 4.2 for standard testing under 0.40 MPa CO 2 and moisture (Table 3A-d).30 lmol h A1 g cat A1 water formation results due to the non-catalytic desorption of adsorbed water. The hydroxy group population on TiO 2 is 7 nm A2 based on the specific surface area, the dependence of stretching vibration peak intensity of hydroxy (m OH ) in FTIR on calcination temperature, desorbed water amount based on GC as a function of calcination ) and ( 5) (14 lmol-e A oxidation) accounts for 98 of the reduction to the C-containing products and H 2 (total 15 lmol-e A ; Table 4e).surface O species and/or adsorbed water are expected to participate in the oxidation via Eqs.(5 0 ) and ( 4), respectively, as implied by the increase of the O V sites in/on TiO 2 based on Ti K-edge EXAFS (Table 2B-e 0 and Fig. 3).The absence of moisture during irradiation testing would alleviate the blocking of the O V sites for the activation of CO 2 -derived species. The other control tests are performed by controlling four factors (see the Experimental) in order to compare the results with those of the test at 0.40 MPa using 10 mg Pd/TiO 2 (Table 3A-d).In the absence of reactants or in the absence of a catalyst (Table 3A-d 00 000 , i), no C-containing products, H 2 , nor O 2 are detected after 5 h of UV-visible light irradiation.Water formation at the rate of 8.2 lmol h A1 g cat A1 in the absence of reactants results merely due to desorption from the catalyst.Using TiO 2 , no C-containing products are detected, but H 2 is formed at a 3.7 rate of that using Pd/ TiO 2 (Table 3A-d, h), demonstrating that Pd is indispensable for converting CO 2 using moisture.O V sites are artificially created in vacuum irradiated under UV-visible light (Fig. 5b).However, no C-containing products are detected and H 2 formation rate remains low under the reaction conditions (Table 3A-h 0 ), demonstrating that the rate of Eq. ( 2) on Pd is by far higher than those of Eqs. ( 6)-( 8) on the O V sites 567823,24.The theoretical O 2 amount formed is 0.17 lmol versus an experimental O 2 evolution less than the detection limit of GC-TCD (0.004 lmol), reconfirming that the O 2 and/or O species are readsorbed/remain on TiO 2 . A control test in the absence of CO 2 produces no C-containing products (Table 3A-f), demonstrating that the C source in the photoconversion tests is exclusively CO 2 in this study.This result is consistent with 13 CH 4 formation using 13 CO 2 and moisture monitored by FTIR (Fig. 7C-b).H 2 is effectively formed at the rate of 106 lmol h A1 g cat A1 in the presence of moisture only.The rate decreases by 0.59 times compared to that under 0.40 MPa CO 2 and moisture (Table 3A-d, f), demonstrating that reduction reaction paths to C-containing products and H 2 (Eqs.( 16)-( 19)) are correlated. Furthermore, we perform a control test by filtering out UV light of k 420 nm.In this case, no methane, CO, nor H 2 is formed above the detection limit (Table 3A-d 0 ).A small amount of methanol is detected, but the total formation rate of C-containing compounds is only 1.0 of that irradiated under UV-visible light (Table 3Ad).The theoretical O 2 amount formed is 0.018 lmol versus no O 2 evolution above the detection limit (0.004 lmol; Table 4d 0 ).In the other blank test conducted by removing UV light with k 250 nm and most of the visible light (390 k 695 nm), methane is formed predominantly, but the rate is lower by 0.39 times in comparison to that under UV-visible light (Table 3A-d 00 , d).The theoretical O 2 amount formed is 1.8 lmol against an experimental O 2 evolution of 0.060 lmol (Table 4d 00 ).Only 3.3 of the stoichiometric O 2 is detected, similar to 4.2 in the test under full light.The H 2 evolution rate is lower by 0.23 times compared to that in the test under full light.Thus, in both control tests, O 2 adsorbs again after irradiation, and the visible light contributes to producing C-containing products as well as H 2 via SPR 16 on Pd. In the absence of UV-visible light at 299 K (Table 3A-d 000 , d), no C-containing products, H 2 , nor O 2 are detected.The photoreduction of CO 2 using moisture and water photosplitting via Eqs.( 16)-( 19) are endothermal, in contrast that the photoreduction of CO 2 into methane using H 2 that is exothermal 16.In this context, to verify the thermal effects, blank tests in the absence of UV-visible light are also carried out at 353 K (Table 3A-d 0000 ).No products are detected above the detection limit, demonstrating that the CO 2 conversion from CO 2 and moisture shown in Table 3A proceeds entirely photocatalytically. The O 2 formation in typical reaction conditions (0.40 MPa CO 2 and moisture, 10 mg photocatalyst) was only 4.2 compared to the stoichiometry of Eqs. ( 14) and ( 15) to form methane, CO, methanol, and H 2 (Tables 3A-d and4d).The Pd/TiO 2 photocatalyst was previously irradiated under UV-visible light in vacuum for 5 h.O 2 pressure decreased starting from 2.298 kPa to 2.287 kPa (Fig. 6, left), corresponding to 0.75 lmol of O 2 uptake (Table 4a). Next, the monitoring of O 2 pressure was continued under dark conditions (Fig. 6, right).The pressure quickly decreased in the first 30 min by more than 0.02 kPa and converged to 2.258 kPa after 5 h.Therefore, 1.98 lmol of O 2 adsorbed on Pd/TiO 2 under dark (Table 4a).The theoretical O 2 amount formed using 100 mg Pd/ TiO 2 in the photoconversion test at 4.6 kPa for 5 h was 2.6 lmol based on Eqs. ( 14) and ( 15) and the rate in Table 3A-a, versus the experimental formation of 0.13 lmol based on Eqs. ( 14) and ( 15) and Table 3A-a (Table 4a).The difference (2.5 lmol) can be rationalized by the adsorption on TiO 2 , 0.75 1.98 2.73 lmol (Fig. 6 and Table 4a). The difference between the theoretical O 2 amount formed (6.6 lmol) and the O 2 amount detected (0.28 lmol) in the CO 2 photoconversion test at 0.40 MPa using 10 mg Pd/TiO 2 (Table 4d) was greater (6.3 lmol) than that at 4.6 kPa using 100 mg of Pd/ TiO 2 (Table 4a), mostly due to the difference in the reaction pressure and the thickness of the photocatalyst.The oxygen balance was summarized in Table 4. Stoichiometric O 2 following Eqs.( 16)- (19) was not detected for all the catalysts, however, the unbalance would be consistently explained by the participation of surface hydroxy groups via Eqs.( 40 ) and ( 5) and/ or readsorption of O 2 after photocatalytic tests (Fig. 6).Thus, the evidences of O V sites were the decrease of N(Ti-O) values based on Ti K-edge EXAFS (Table 2B and Fig. S2B), the decrease and increase of both N(Ti-O) and N(Ti(-O-)Ti) values during the irradiation of UV-visible light and under dark, respectively (Fig. 3A,B), color change at surface 5 lm layer in cross-sectional SEM (Fig. 1b2), color change of photocatalyst (Fig. 5b,c), and the O 2 adsorption tests under UV-visible irradiation and under dark (Fig. 6).These evidences strongly suggest the occurrence of Eq. (1) via Eqs.( 4) and ( 5) and/or Eqs. ( 4) and ( 50 ), however, the partial O 2 readsorption even under light (Fig. 6) means that the turnover of Eq. ( 1) was not completed and an O 2 -removing reagent would be needed to proceed true catalysis following Eq.(1). The intermediate species during the efficient conversion of CO 2 into major methane and H 2 on Pd/TiO 2 is monitored using FTIR.In the spectrum for fresh Pd/TiO 2 in vacuum at 293 K for 2 h, two sharp peaks at 3673 and 3634 cm A1 , a very broad peak between 3500 and 3000 cm A1 , a sharp peak at 1624 cm A1 , and weaker peaks at 1553, 1438, and 1358 cm A1 are observed (Fig. 7A-a).These peaks can be assigned to m OH of H-bound hydroxy, bi or tricoordinated hydroxy, and H-bound water 46, antisymmetric stretching vibration (m as ) of hydrogencarbonate (HO-CO 2 Ti), m as of bidentate carbonate (O-CO 2 Ti), symmetric stretching vibration (m s ) of hydrogencarbonate, and m s of bidentate carbonate 47, respectively.When 3.4 kPa CO 2 and 1.2 kPa moisture are introduced into the photocatalyst (Fig. 7A-b), the peak intensity for both pairs of hydrogen carbonate and bidentate carbonate increase, while a part of the two hydroxy peaks at 3673 and 3634 cm A1 switches to a broad peak due to H-bound water (3550 cm A1 ).These changes are more evident if spectrum A-b is subtracted from spectrum A-a, and further subtracted from the spectra of CO 2 (3.4 kPa) and moisture (1.2 kPa) (Fig. 7B-b and 7B 0 -b; decrease of two OH peaks versus increase of broad water peak). Then, the Pd/TiO 2 sample under CO 2 and moisture is irradiated with UV-visible light for 15 min (Fig. 7A-c) and 16 h (Fig. 7A-d). The extent of the change can be checked when the spectra under light is subtracted from spectrum A-a and further subtracted from the spectra of CO 2 (3.4 kPa) and moisture (1.2 kPa) (Fig. 7B-c, d).The expanded views are shown for O-H region (Fig. 7B 0 -c, d) and O-C-O region (B 00 -c, d).The hydrogen carbonate and bidentate carbonate species are inert, and the peaks due to these species negligibly change starting from spectrum b to c then d (Fig. 7B 00 ), whereas peaks due to H-bound and di/tri-coordinated hydroxy groups decrease in Fig. 7B-d Finally, the UV-visible light is turned off, and the Pd/TiO 2 photocatalyst is evacuated at 293 K for 20 min (Fig. 7A-e).The change is more evident, if the difference between spectra B-e and B-d is compared in order to extract the change of the surface species compared to the original spectrum a (Fig. 7B-e).The expanded views are also shown in Fig. 7B 0 -e and B 00 -e.The decrease of both the H-bound and the bi/tri-coordinated hydroxy group during the photoconversion test is canceled via the reaction The amount of hydrogen carbonate and bidentate carbonate species decreases to the level before the photoconversion test by the evacuation of ambient CO 2 (Fig. 7B 00 -e).We assume that the surface concentration of hydroxy is 7 nm A2 for Pd/TiO 2 evacuated at 290 K (Fig. 7A-a) 45, and the peak area of total m OH in Fig. 7A-a decreases by 0.66 times after the 16 h of the CO 2 photoconversion test (Fig. 7A-d).Thus, 0.10 A 60 A 10 18 A 7 A 0.34/ for O 2 formation proceed. The reactants and products were also monitored using CO 2 (59 kPa), moisture (2.3 kPa), Pd/TiO 2 photocatalyst, and UV-visible light.When natural CO 2 ( 12 C 98.93, 13 C 1.07) and moisture was employed, a peak at 1306 cm A1 appeared that was assigned to bending vibration mode (m 4 ) of 12 CH 4 whereas a peak at 1297 cm A1 appeared that was assigned to m 4 of 13 CH 4 using 13 CO 2 and moisture (Fig. 7C).The isotope shift was in consistent with values in literature 484950 taking the low concentrations of methane due to kinetic tests using low pressure of 13 CO 2 (59 kPa) into account.This result was in accordance with the blank test under moisture (2.3 kPa) and UV-visible light in which no C-containing products were detected (Table 3A-f). The performance of photocatalysts is compared at nearly optimized conditions: using 10 mg photocatalyst film under 0.40 MPa CO 2 and moisture (Table 3A-d).The photocatalytic activity to form total C-containing compounds from CO 2 and H 2 was not correlated to the E g values of the metal oxide (3.1-3.2 eV for Pd/TiO 2 ) or the conduction band (CB) minimum voltage for the semiconductors (A0.1 at pH 0, Scheme 1A) 16.The work functions (WFs) for Pd are 5.22-5.6 eV versus the vacuum level 34, corresponding to potentials of 0.78-1.16V versus SHE (pH 0), which are slightly positive compared to the CB of TiO 2 (A0.1 V).Namely, the potential for achieving electron trapping levels are a little more positive than the reduction potentials of methane (0.17 V pH 0) or CO (0.30 or A0.12 V pH 0) (Scheme 1A) 9,51, and it is difficult to reduce CO 2 . In UV-visible absorption spectra 16, the absorption extended over the range between 400 and 800 nm of visible light for Pd/TiO 2 . Localized SPR is a collective vibration of electrons near surface in the resonant condition that natural frequency of the electrons forced by the positive charge of nucleus coincides with the frequency of light.SPR results in elevated electric fields at the surface of the Pd nanoparticles (Scheme 1A).The elevated fields yield a greater number of electron-hole pairs 18,52.It is also known that the resonance frequency of SPR increases as the metal nanoparticles size decrease 52.In HR-TEM images for Pd/TiO 2 photocatalyst, 1.0-6.5 nm of Pd nanoparticles were observed on TiO 2 surface 16.Hence, hot electrons due to SPR at Pd nanoparticles, especially relatively smaller ones, would gain sufficient energy relative to the reaction potential of CO 2 /CH 4 and transfer to CO 2derived surface species (Scheme 1A). If the positive charge that remains at the Pd nanoparticles is combined with excited electrons trapped from the CB of TiO 2 , the Z-scheme-like redox combination is completed.In this context, the electron trapping at metal nanoparticles excited from the semiconductors must be followed by the transfer of hot/excited electrons produced due to SPR on metal nanoparticles to CO 2 -derived species 16,21.This proposed electron flow diagram (Scheme 1A) is well in accord with the wavelength dependence of irradiation for Pd/TiO 2 (Table 3A As the d-band positions at 2.4-4 eV below the Fermi energy (E F ) level 18, the hot electrons in Pd/TiO 2 catalyst would be mostly due to intraband excitation within conduction band (visible light region) 18,52 of 1.0-6.5 nm of Pd nanoparticles rather than due to interband transition between d-band and conduction band (UV light region) 18,53. Similar photoconversion rates in CO 2 and moisture into methane and CO are reported by the addition of metal to TiO 2 in the same order, Pt Pd Au Rh Ag, as that of WF 6.Very small Scheme 1. (A) Energetic diagram of CO 2 photoconversion using moisture (pH 0), (B) proposed reaction mechanism of CO 2 photoconversion using moisture, and (B 0 ) that of side reaction to form H 2 .metal nanoparticles are preferred, because the E F level rises, but still remains below the CB minimum due to the quantum confinement for CO 2 reduction 13.The effects of quantum confinement should be minimal for Pd particles with a mean size of 1.1-3.1 nm (Table 1) in this study.4.2.Cause of higher reactivity of moisture than H 2 in CO 2 photoconversion at 0.80 MPa At 0.40 MPa, the total photoformation rates of C-containing products in CO 2 and moisture are lower by 0.61 times than those in CO 2 and H 2 using Pd/TiO 2 (Table 3B-d).Furthermore, using Pd/ TiO 2 at 0.80 MPa, the total C-containing product formation rate using moisture becomes higher by 4.3 times than that using H 2 (Table 3B-g).Thus, at the optimized reaction pressure, moisture is more reactive than H 2 for pressurized CO 2 photoconversion.In our preliminary photocatalytic tests under 0.40 MPa of CO 2 and moisture using several semiconductor-based photocatalysts, i.e. similar conditions to those in Table 3A-d, the total C-containing product formation rates were higher than those in tests under corresponding reactant pressure of CO 2 and H 2 (Supplementary material, Section S4 and Table S2) 16.The experimental O 2 formation was 40-3.2 of corresponding theoretical values based on Eqs. ( 14) and ( 15) (Table S3) in comparison to 4.2 for Pd/TiO 2 (Table 3).In contrast, quite fast photo-assisted methane formation was reported under CO 2 , H 2 , visible light (k 450 nm), and Ni/SiO 2 AAl 2 -O 3 .Thermal effect nearly at 423 K was suggested due to heat of reaction for methane formation from CO 2 and H 2 54.In this context, the comparison of reactivity between moisture and H 2 depends on reaction temperature.No thermal effects were found using Pd/TiO 2 at 299-353 K in this study (Table 3A-d 00 0 , d 00 00 ).The contribution of the secondary reaction of CO 2 with formed H 2 from moisture is negligible (Supplementary material, Section S6). Following, we consider the oxidation reaction using moisture or H 2 on semiconductors combined with Pd nanoparticles.Water is activated by a hole to form the AOH radical (Eq.( 4)) 7.The subsequent reaction of AOH with a surface hydroxy group/O atom is fast 41, e.g., to form O 2 , an O V site, and a proton(s) (Eqs.( 5) or ( 50 ) and Scheme 1B, left) due to the nature of the radical reaction.In fact, the concentration of O V sites dramatically increases on/in TiO 2 as monitored by the decrease of the N(Ti-O) value from 5.4 for fresh sample to as low as 3.5 under UV-visible light irradiation at beamline (Table 2B-c, e 0 and Fig. S2B-c, e 0 ).This change was supported by the monitoring of N(Ti-O) and N(Ti(-O-)Ti) values during the irradiation of UV-visible light (3.5 h) and darkness (0.5 h) (Fig. 3).The protons formed near the interface between the metal nanoparticle and the TiO 2 surface (Eq.( 4)) are transferred to the metal nanoparticle to form C-containing products or H 2 , whether they encounter CO 2 -derived species and hot/excited electrons, or such electrons only (Scheme 1B, right).In clear contrast, O V sites are observed only at the interface between Pd and the TiO 2 surface under CO 2 and H 2 and UV-visible light 16, denying the radical oxidation mechanism from H 2 .Effectively separated redox sites are nicely conjugated to transport protons between them (Scheme 1B), similar to photosystems 4. In contrast, both CO 2 reduction and H 2 oxidation may proceed on Pd using Pd/TiO 2 16.Due to the competitive adsorption of CO 2 and H on Pd, the exclusive methane formation rates produce a volcano-like maximum at P(CO 2 ) of 0.12 MPa and at P(H 2 ) of 0.28 MPa in the contour diagram.Thus, effective redox-site separation between TiO 2 surface for H 2 O oxidation and Pd nanoparticles for CO 2 reduction is the reason of the observed higher reactivity of moisture than H 2 using Pd/TiO 2 .Redox-site separation is also deduced from the reaction order of methane and CO formation on P(CO 2 ) (0.39 and 0.62, respectively; Fig. 4A), in clear contrast to the volcano-like pressure dependence peaking at P(H 2 ) 0.28 MPa and P(CO 2 ) 0.12 MPa using CO 2 and H 2 16. The best CO 2 photoformation rate of C-containing compounds in this study is 37 lmol h A1 g cat A1 using Pd/TiO 2 .The photo inprofile (action) spectrum for Pd/TiO 2 photocatalyst peaked at 385 nm, but the action also increased in the UV light region based on the tests using seven kinds of cut filters (Fig. 4C), suggesting the needs of both UV light for BG excitation for TiO 2 and UV/visible light for SPR for Pd nanoparticles for the photoconversion (Scheme 1A).Please note that the peak centered at 385 nm was drawn based on tests under the conditions of the presence of UV light of k 370 nm.Thus, if we simplify the quantum efficiency as the ratio of total electrons needed to form C-containing products from CO 2 in the photo in-profile spectrum between 358 nm and 412 nm (7.6 A 10 A4 lmol-e A s A1 ) versus the photon number of absorbed/scattered/reflected UV-visible light between 358 nm and 412 nm (2.9 A 10 15 photons s A1 A 0.49) based on the data that 51 of incident UV-visible light transmits the film (see Section 2.3), quantum efficiency for Table 3A-g was 16.This is the upper limit of true quantum efficiency because the proposed mechanism in Scheme 1A requiring light for both BG excitation and SPR cannot be plotted in simple two-dimensional action spectrum as in Fig. 4C.In the evaluation above, the photon number of UV light is not included. The best rate in this study is lower compared to 1400-2200 lmol-CH 4 h A1 g cat A1 using Pt-TiO 2 (mean thickness 1.5 lm) 13 or Au-Cu-TiO 2 films (0.48 mg cm A2 ) 5.In the crosssectional SEM image, 5 lm of TiO 2 layer including more O V sites are detected at the upper part of the 15 lm 3 lm-thick Pd-TiO 2 layer (Fig. 1b2).The upper 5 lm of the TiO 2 layer absorbs more photons to proceed reactions 4, 4 0 , 5, and/or 5 0 .In fact, the rate of major methane formation dramatically boosted when the mean thickness of Pd/TiO 2 film decreased from 16 lm to 4.6 lm (Fig. 4B).Thus, even a thinner catalyst film is needed to improve the photoconversion rate of CO 2 in this study.Liu et al. suggested that CO 2 activation on an O V site forms CO via Eqs.(6) and/or (7) (8) 7.O V sites should be distributed in the upper 5 lm of the TiO 2 layer (Fig. 1b2) during UV-visible light exposure under 0.40 MPa CO 2 and moisture (Fig. 1b2 and Table 2Ae, B-e 0 ).In contrast, O V sites are detected only at the interface between Pd nanoparticles and the TiO 2 surface for Pd/TiO 2 under 0.40 MPa CO 2 and H 2 16.Based on the test using artificially created O V sites on TiO 2 (Table 3A-h 0 and Fig. 5b), direct CO 2 activation on O V sites is negligible in comparison to that over Pd or the other reduction sites in this study. Stoichiometric O 2 formation is not detected during CO 2 photoconversion according to Eqs. ( 14) and ( 15), but only 4.2 O 2 is experimentally detected for Pd/TiO 2 (Table 3A).The possibility of H 2 O 2 formation is investigated using Ti sulfate, but it is not detected above the detection limit of 0.20 lmol (Supplementary material, Section S5) in comparison to the theoretical (stoichiometric) O 2 amount formed: 6.6 lmol using Pd/TiO 2 at 0.40 MPa (Tables 3A-d and 4d).Thus, the possibility of H 2 O 2 formation is low, but, instead, the formed O 2 may be readsorbed by the photocatalysts after the photoconversion test but before the GC-TCD analysis, as shown in Fig. 6. Photoconversion of CO 2 was optimized using moisture at 4.6 kPa-0.80MPa.The result was successfully explained based on the levels of hot electrons due to SPR or BG-excited electrons. At 0.80 MPa, moisture was found to be more reactive than H 2 for CO 2 photoconversion.This finding was attributed to the effective site separation between CO 2 reduction on Pd nanoparticles and water oxidation on the semiconductor surface, as confirmed using in situ monitoring of Ti K-edge EXAFS and cross-sectional SEM.The redox sites were conjugated in order to transport protons effectively, in a way similar to photosystems.The mass balance of O is explained by the readsorption of the formed O 2 after the photoconversion test, because O 2 adsorption on the O V sites was quicker under dark rather than under UV-visible light.CO 2 photoconversion rates increased up to 0.80 MPa CO 2 and moisture in a reaction order of 0.39-0.62 using Pd/TiO 2 , whereas the volcanolike maxima were at P(CO 2 ) of 0.12 MPa and P(H 2 ) of 0.28 MPa in the contour plot. Fig. 1.Cross-sectional SEM images of Pd/TiO 2 , fresh (a1, a2) 16 and after CO 2 photoreduction testing, under CO 2 (0.40 MPa) and moisture (2.3 kPa) for 5 h (b1, b2).(a1, b1) show wide views, and (a2, b2) show close-ups. Fig. 2. Pd K-edge XANES for PdO (a), Pd foil (b), Pd/TiO 2 photocatalyst (100 mg; fresh) (c), under CO 2 (3.4 kPa) and moisture (1.2 kPa) for 5 h irradiated by UV-visible light (d), under CO 2 (0.40 MPa) and moisture (2.3 kPa) for 5 h irradiated by UV-visible light (e), Pd/TiO 2 (10 mg) after the condition of spectrum e was irradiated by UV-visible light during XAFS measurement (e 0 ), and the mixture of spectra a and b with the mixing ratio of 3:2 (f) and 3:1 (g).The spectra were obtained in the transmission mode, except for Pd K-edge for samples e 0 , which were taken in the fluorescence mode.(Right two panels) Good agreements between spectra c and f (Top) and between spectra d and g (Bottom). ).The N(Ti-O) values are 5.4 and 5.2, respectively, smaller compared to 6 for untreated TiO 2 (Table 2B-c-supp), or 6.1 for the sample under 0.40 MPa CO 2 and H 2 , and UV-visible light irradiation for 5 h 16, suggesting minor O V site formation during liquid-phase reduction to prepare Pd/TiO 2 catalyst.Conversely, the decrease (0.2) under CO 2 and moisture and UV-visible light is insignificant, taking the fit errors (0.1 to 0.3) into account.Pd/TiO 2 after the test at 0.40 MPa for 5 h is irradiated by UV-visible light during the Ti K-edge EXAFS measurement at beamline (Table 2B-e 0 and Fig. S2B-e 0 ).The N(Ti-O) value decreases to 3.5, suggesting a dramatic increase of the number of O V sites during UV-visible light irradiation.The O V sites are reversibly filled by O species after the light is turned off, because the N(Ti-O) value increases to 5.2 in the absence of UV-visible light irradiation (Table 2B-c, e).During the irradiation of UV-visible light, the N (Ti-O) and D(r 2 ) values may be difficult to determine exactly due to the fast reaction with the AOH radical to form O V sites on an ns or ls time scale 41.Similar uncertainty of metal-O coordination is reported for BiOCl N(Bi-O) 4 ?1.9 28. Fig. 3. Time course of Ti K-edge (A-C) EXAFS and (D-F) pre-edge region for Pd/TiO 2 photocatalyst (10 mg) under CO 2 (100 kPa) and moisture (2.2 kPa) for 3.5 h irradiated by UV-visible light and subsequently for 0.5 h under dark.The changes of (A) N(Ti-O) values, (B) N(Ti(-O-)Ti) values, and (C) Fourier transform of k 3 -weighted EXAFS v function. photogenerated h 's via Eqs.(4 Fig. 4. (A) The dependence of formation rates for CH 4 , CO, methanol, O 2 , and H 2 on total reactant pressure and (B) on thickness of Pd/TiO 2 photocatalyst film both under the irradiation of UV-visible light from 500-W Xe arc lamp.(C) The dependence of total formation rates for C-containing products on the wavelength of irradiated light plotted with UV-visible absorption spectrum 16.(A) Pd/TiO 2 10 mg, CO 2 0.12-0.80MPa, and moisture 2.3 kPa.(B) Pd/TiO 2 4.6-26 lm-thick (namely 2.9-16 mg), CO 2 0.40 MPa, and moisture: 2.3 kPa.(C) Pd/TiO 2 10 mg, CO 2 0.40 MPa, and moisture 2.3 kPa. Fig. 5.The color changes of TiO 2 (P25) film as fresh (a), under vacuum and UVvisible light for 4 h (b), under 0.40 MPa CO 2 and moisture for 3 h (c), and after the test and exposed to air (d). Fig. 6.Monitoring of O 2 uptake (2.3 kPa at 0 min) on Pd/TiO 2 photocatalyst after UV-visible light irradiation in vacuum for 5 h.Under UV-visible light for 1 h followed by 5 h under dark. compared to Fig.7B-b and cvia the reactions of Eqs.(40 ) and (5). Fig. 7. (A) FTIR spectra for Pd/TiO 2 photocatalyst in vacuum for 2 h (a), CO 2 (3.4 kPa) and moisture (1.2 kPa) added (b), under irradiation of UV-visible light for 15 min (c) and for 16 h (d), and light is turned off after 16 h of the reaction and evacuated for 20 min (e).(B) Difference spectra: A-b-A-a -the spectrum of CO 2 (3.4 kPa) -the spectrum of moisture (1.2 kPa) (b), A-c-A-a -the spectrum of CO 2 (3.4 kPa) -the spectrum of moisture (1.2 kPa) (c), A-d-A-a -the spectrum of CO 2 (3.4 kPa) -the spectrum of moisture (1.2 kPa) (d), and A-e -A-a (e).(B 0 ), (B 00 ) Expanded views of B in the regions of stretching vibrations of O-H (B 0 ) and O-C-O (B 00 ).(C) FTIR monitoring of reactants and products using Pd/TiO 2 , UV-visible light, CO 2 (59 kPa), and moisture (2.3 kPa).Natural CO 2 for (a) versus 13 CO 2 ( 13 C 99) for (b). 02 A 10 23 ) 24 lmol of the hydroxy group on 100 mg of the Pd/ TiO 2 disk are consumed during the FTIR measurements under 4.6 kPa CO 2 and moisture and UV-visible light for 16 h (Table 4a).Thus, 24 and 12 lmol O 2 are formed via Eqs.(4) and (5) and Eqs.(4 0 ) and (5), respectively.The O 2 amount assuming the route of Eqs.(4 0 ) and (5) agrees more with the theoretical (stoichiometric) O 2 formation (5.3 lmol h A1 g cat A1 A 0.100 A 16 8.4 lmol; Basic physicochemical properties of Pd/TiO 2 photocatalyst used for tests under CO 2 and moisture in this study. 1.1( 0.1) 2.6( 0.3) 1 30-50 16 25( 8) 16 1 After photocatalytic tests under CO 2 (3.4 kPa) moisture (1.2 kPa) for 5 h.H. Zhang et al. / Journal of Catalysis 352 (2017) 452-465 16ndence of CO 2 photoconversion using moisture on the amount of photocatalysts and reactant pressure and control test results in the absence of UV and/or visible light, catalyst, or reactant (A) and the comparisons to CO 2 photoconversion using H 216at the same total pressure of reactants (CO 2 and moisture versus CO 2 and H 2 ) (B). 2,3 Using L42 filter 2 and U330 filter 3 at the light exit.Temperature 296 K.4,5In the absence of UV-visible light at 299 K 4 and at 353 K.5,6In 0.40 MPa of helium or argon.Mixed gas of 0.10 MPa of CO 2 and 2.3 kPa of H 2 O was flowed prior to the introduction of 0.40 MPa of CO 2 .8CatalystwasirradiatedunderUV-visiblelight for 4 h and vacuum prior to the test.9In the unit of lmol h A1 .10Resultsusing CO 2 and H 2 were reported in Ref.16. 1 Total molar amount of products comprising C. 7 H. Zhang et al. / Journal of Catalysis 352 (2017) 452-465 40MPa is6.6lmol in comparison to the detected O 2 amounts of 0.28 lmol (Tables 3A-d and 4d).Thus, only 4.2 O 2 is experimentally detected, suggesting that the formed O 2 is readsorbed and/or intermediate O species remain on the photocatalyst surface after the tests.The ratios of consumed holes versus consumed electrons is also listed in Table4d, however, are not exactly the same as the ratios of experimentally detected O 2 versus theoretical one described above due to the contribution of side reaction in Eq. (14).Using Pd/TiO 2 , O species are accumulated on TiO 2 after the photoconversion test, because some of the O sites are lost on/in TiO 2 during the photoconversion test but are restored after the test, as confirmed by the Ti K-edge XAFS analysis (Table The balance of oxygen in the CO 2Photoconversion tests (5 h) and FTIR monitoring (16 h) under various reaction conditions.2 . Table 4a) in the photoconversion test at 4.6 kPa CO 2 and moisture based on the total formation of methane and H 2 (Table 3A-a) and Eqs.(14) and (15).The observed O 2 formation (0.25 lmol h A1 g cat A1 corresponding to 0.40 lmol-O 2 ) suggests readsorption of O 2 on the TiO 2 surface.In summary, the intensity of the hydrogen carbonate and bidentate carbonate peaks on the TiO 2 surface partially increases in the presence of CO 2 and moisture, but changes slightly due to UV-visible irradiation.The peak intensity due to the H-bound and the di/tri-coordinated hydroxy group for fresh Pd/TiO 2 decreases by 0.66 times after the 16 h of CO 2 photoconversion, demonstrating that the reactions of Eqs.(4 0 ) and (5) -d, d 0 , d 00 ).The sum of C-containing product formation rates under visible light (0.23 lmol h A1 g cat A1 ) and under UV light (7.4 lmol h A1 g cat H. Zhang et al. / Journal of Catalysis 352 (2017) 452-465 The authors are grateful for the financial supports from the Grant-in-Aid for Scientific Research C (26410204) from Japan Society for the Promotion of Science and Leading Research Promotion Program (2015-) from the Institute for Global Prominent Research, Chiba University.X-ray absorption experiments were conducted under the approval of the Photon Factory Proposal Review Committee (2016G577, 2015G586, 2014G631).The authors thank Masaya Miyano for the support of data analysis.In addition, the authors would like to thank Enago (www.enago.jp)for the English language review. Supplementary data associated with this article can be found, in the online version, at http://dx.doi.org/10.1016/j.jcat.2017.06.016."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The surface of the fresh Pd/TiO 2 film (Fig. 1a1,a2) 16 and the one used for photoconversion test under CO 2 (0.40 MPa) and moisture (2.3 kPa) for 5 h (Fig. 1b1,b2) both on Pyrex glass are flat and smooth within the variance of 5 lm, based on cross-sectional SEM images.In the close-ups (Fig. 1a2,b2), the mean film thickness is 14 lm 3 lm.In the comparison between fresh and used samples, the homogeneous light gray contrast in the fresh sample (Fig. 1a1, a2) changes to more densely packed dark gray from the surface (b1) until the upper approximately 5 lm of the film (b2).Such change is observed in more than the half of the cross-sectional views for used samples, suggesting partial reduction of the upper TiO 2 layer to include more O V sites (Eqs.( 5) and ( 50 )).To confirm the crystalline phase, the XRD pattern is measured for these samples.The peak intensity and the width for anatase 1 0 1, 1 0 3, 1 1 2, 2 0 0, 1 0 5, and 2 1 1 and rutile 1 1 0, 1 0 1, and 0 0 4 diffraction does not change significantly (by 4-10 and 13-19, respectively, except for very weak peaks) after the photoconversion test (Supplementary material, Fig. S1 and Table S1).The mean particle size is evaluated at 25 8 nm based on Eq. ( 11) for eight peaks 16 (Table 1).The anatase 1 0 1 peak of low surface energy is relatively weaker for the films compared to that for fine powder, suggesting higher surface energy in the exposed crystalline face of the films 16.The mean particle size was in accordance with the distribution obtained based on HR-TEM (30-50 nm, Table 1) if lower detection limit for TEM (0.2 nm) is taken into account. The Pd states are monitored by Pd K-edge X-ray absorption near-edge structure (XANES).The post-edge pattern for fresh Pd/TiO 2 sample (Fig. 2c) is not the same as that for PdO or Pd foil (a, b) but mostly resembles that for the mixture of spectra for Pd foil and PdO with the mixing ratio 3:2 (f; see also the comparison in Fig. 2, right, top). Then, 100 mg of Pd/TiO 2 is placed under CO 2 (3.4 kPa) and moisture (1.2 kPa) and UV-visible light for 5 h (Table 3A-a).The XANES post-edge pattern (Fig. 2d) resembles more that of the mixture of spectra for Pd foil and PdO with the mixing ratio 3:1 (Fig. 2g; see also the comparison in Fig. 2, right, bottom).Conversely, the post-edge pattern for 10 mg Pd/TiO 2 under higher CO 2 pressure (0.40 MPa) and moisture (2.3 kPa) and UV-visible light for 5 h (Table 3A-d) resembles more that of fresh Pd/TiO 2 (Fig. 2c,e).Following, the sample of Fig. 2e is irradiated under UV-visible light during XANES measurement (Fig. 2e 0 ).The intensity of the first post-edge peak at 24,370 eV becomes weaker, suggesting a decrease in the O-coordination around the Pd site. As a complement to XANES, under CO 2 (3.4 kPa) and moisture (1.2 kPa) and UV-visible light for 5 h (Table 3A-a), the N value for the Pd-Pd interatomic pair based on EXAFS analysis is 9.2 (Table 2A-d), corresponding to a mean particle size of 2.6(0.3)nm (Table 1) 40.Accordingly, the Pd-Pd interatomic pair is more pronounced in the Fourier transform (Fig. S2A-d), in consistency with the XANES pattern with greater Pd 0 contribution (Pd 0 : Pd II 3:1; Fig. 2d).Conversely, the N(Pd-Pd) value changes negligibly from fresh Pd/TiO 2 (5.9) to that after 0.40 MPa of photoconversion test for 5 h (6.2;Table 2A-c, e), demonstrating Best-fit results of (A) Pd K-edge and (B) Ti K-edge EXAFS spectra for TiO 2 and Pd/TiO 2 photocatalysts.that the Pd valence state and the mean particle size change only slightly under these conditions.In contrast, the N(Pd-O) value decreases from 1.9 for fresh to 1.0 after the test at 0.40 MPa, suggesting an increase of the O V sites at the interface between the Pd and TiO 2 surfaces. To complement the Pd K-edge results, Ti K-edge EXAFS is studied for Pd/TiO 2 (10 mg) as prepared (Table 2B-c and Fig. S2B-c) and after testing under 0.40 MPa CO 2 , moisture, and UV-visible light irradiation for 5 h (Table 2B-e and Fig. S2B-e Under CO 2 (100 kPa), moisture (2.2 kPa), and UV-visible light, the change in N(Ti-O) values was monitored (Fig. 3A,C).In comparison to the initial value (6.0) under CO 2 , moisture, and dark, the value significantly decreased to 4.9-5.7 (mean value 5.3) during light irradiation for 3.5 h.At 30 min after the light was off, the N(Ti-O) value increased to the original value (6.0).N(Ti(-O-) Ti) values followed a similar trend: decrease from initial 11.3 to 9.7-10.6 during the irradiation of UV-visible light and increase to 10.9 at 30 min after the light was off (Fig. 3B).Taking the experimental and fit errors into account (Fig. 3A,B), the N(Ti-O) and N(Ti (-O-)Ti) values would evaluate the concentration of O V sites in/on TiO 2 semi-quantitatively. Corresponding to the time course of Ti K-edge EXAFS, that of Ti K pre-edge region was also plotted (Fig. 3D-F).In comparison to data for fresh sample under CO 2 (100 kPa), moisture (2.2 kPa), and dark (Fig. 3D: 0 min), the peak pattern changed after the UV-visible light was irradiated, especially in the region between 4968 and 4971 eV (Fig. 3D: 5, 30 min).This trend is in good agreement with the increase of pre-edge peak at 4967.6 eV owing to 5 coordination Ti sites 424344 or 4 coordination Ti sites 43,44 in comparison to that at 4968.8 eV owing to 6 coordination Ti sites 42.Please note that there is minor energy calibration difference between reference 42 and this study. While the peak pattern negligibly changed during the UV-visible irradiation (Fig. 3E: 60, 100, 130, 150 min; Fig, 3F: 180 min), the pattern clearly changed after the light was off (Fig. 3F: light off 0, 30 min).The last two peak patterns were very similar to that of fresh sample before light irradiation (Fig. 3D: 0 min), in consistent with the reversible change of the N(Ti-O) and N(Ti(-O-)Ti) values based on EXAFS analyses (Fig. 3A,B). 2 and moisture at 0.12-0.80MPa First, photoconversion tests at 0.40 MPa CO 2 and moisture are performed by changing the amount of Pd/TiO 2 photocatalyst between 100 mg and 10 mg.This is the most active photocatalyst among the catalysts in Eq. ( 3) under the reaction conditions from CO 2 and H 2 in reference 16; under CO 2 and moisture, it is methane-selective among C-containing compounds (99-82 mol; Table 3A-b, d).The total formation rate of C-containing products using 10 mg Pd/TiO 2 (23 lmol h A1 g cat A1 ) is higher by 16 times than that using 100 mg, probably due to the smaller reflectance/scattering by 10 mg of film.Thus, light absorption of 10 mg of film is more effective, in comparison to 100 mg powder.The peak due to low-energy anatase 1 0 1 plane is less intense by 26 for film in comparison to that in powder while high-energy anatase 1 0 3, 1 1 2, and ritile 1 0 1 planes are slightly favored relatively 16.The energetically unstable 1 1 2 plane is preferred for a TiO 2 film formed via aerosol chemical vapor deposition of titanium iso-propoxide on to the substrate at 773 K, and it enhances its electron mobility 13.The difference of preferred planes of film between this study (mean thickness 14 lm 3 lm, Fig. 1) and reference 13 (mean thickness 1.5 lm) would be due to the preparation procedure of film rather than the film thickness. The total formation rates of C-containing compounds using moisture (Table 3B-i) are compared to the corresponding ones at the same total pressure using H 2 (Table 3B-ii) for Pd/TiO 2 .Using Pd/TiO 2 at 0.40 MPa, the rate of 23 lmol-C h A1 g cat A1 using moisture (Table 3A-d) is lower by 0.61 times than that using H 2 (Table 3B-d-i, ii) 16. Based on the results of the photoconversion tests, we examine the mass balance under CO 2 and moisture using the following equations.r is the molar formation rate of the product. The conversion of CO 2 into C-containing products via Eqs.( 16)-( 18) and a competing side reaction (SR) of water splitting (Eq.( 19)) are considered.The reverse reaction of Eq. ( 19) is also taken into account to include the effect of a secondary reaction of formed H 2 with CO 2 to produce C-containing products and water 16. Based on Eq. ( 14), the theoretical O 2 amounts formed using Pd/ TiO 2 , in the tests at 0. 2B-c, e, e 0 and Fig. 3).The pressure dependence of the photoformation rates on CO 2 and moisture is investigated using Pd/TiO 2 (see also Supplementary material, Section S3).Major methane formation is preserved (Fig. 4A).At 0.12-0.80MPa using 10 mg catalyst, the reaction order of methane, CO, and H 2 is 0.39, 0.62, and 0.89, respectively (Table 3A-c, d, and g and Fig. 4A).H 2 formation through Eq. ( 19) is accelerated by the increase of the CO 2 pressure P(CO 2 ), suggesting that it is correlated with the paths toward C-containing products via Eqs.( 16)- (19).Using Pd/TiO 2 at 0.80 MPa, the total C-containing product formation rate using moisture was 37 lmol h A1 g cat A1 (Table 3A-g and Fig. 4A) that was higher by 4.3 times than that using H 2 (Table 3B-g-i, ii). The dependence of photoformation rates on Pd/TiO 2 film thickness was also investigated (Fig. 4B).On the basis of rates in the unit of lmol h A1 g cat A1 , formation rates for methane and CO gradually increased as the mean thickness of Pd/TiO 2 decreased from 26 lm to 16 lm.In contrast, formation rates especially for methane dramatically boosted to 66 lmol-CH 4 h A1 g cat A1 when the mean thickness further decreased from 16 lm to 4.6 lm, suggesting that upper layer of Pd/TiO 2 film was more effectively utilized for the photocatalysis as suggested in the color change of top 5 lm by cross-sectional SEM for sample after photocatalytic test (Fig. 1b2).H 2 photoproduction increased linearly as the catalyst thickness gradually decreased from 26 lm to 4.6 lm.The dependence for O 2 formation rates on film thickness was not clear (Fig. 4B). As a control, 0.10 MPa CO 2 and 2.3 kPa moisture is input, and then photocatalytic testing is performed only in 0.40 MPa CO 2 (Table 3A-e).In comparison to the corresponding standard test under 0.40 MPa CO 2 and 2.3 kPa moisture (Table 3A-d), the C-containing product selectivity of 82 mol for methane, 18 mol for CO, and 0.21 mol for methanol (Table 3A-e) remains essentially the same at 82, 18, and 0.27 mol, respectively (Table 3A-d).However, the total formation rates of C-containing products increase by 1.32 times to 31 lmol-C h A1 g cat A1 in the absence of moisture (Table 3A-e).This result suggests that water, which is stored as adsorbed or in the form of the hydroxy group during pretreatment, photoconverts CO 2 more efficiently.The theoretical O 2 amount formed is 6.0 lmol based on Eqs. ( 14) and ( 15) and accounts for only 4.6 of the experimental O 2 evolution (5.5 lmol h A1 g cat A1 to 0.28 lmol, Tables 3A-e and 4e), similar to the theoretical/experimental ratio of 4.2 for standard testing under 0.40 MPa CO 2 and moisture (Table 3A-d).30 lmol h A1 g cat A1 water formation results due to the non-catalytic desorption of adsorbed water. The hydroxy group population on TiO 2 is 7 nm A2 based on the specific surface area, the dependence of stretching vibration peak intensity of hydroxy (m OH ) in FTIR on calcination temperature, desorbed water amount based on GC as a function of calcination ) and ( 5) (14 lmol-e A oxidation) accounts for 98 of the reduction to the C-containing products and H 2 (total 15 lmol-e A ; Table 4e).surface O species and/or adsorbed water are expected to participate in the oxidation via Eqs.(5 0 ) and ( 4), respectively, as implied by the increase of the O V sites in/on TiO 2 based on Ti K-edge EXAFS (Table 2B-e 0 and Fig. 3).The absence of moisture during irradiation testing would alleviate the blocking of the O V sites for the activation of CO 2 -derived species. The other control tests are performed by controlling four factors (see the Experimental) in order to compare the results with those of the test at 0.40 MPa using 10 mg Pd/TiO 2 (Table 3A-d).In the absence of reactants or in the absence of a catalyst (Table 3A-d 00 000 , i), no C-containing products, H 2 , nor O 2 are detected after 5 h of UV-visible light irradiation.Water formation at the rate of 8.2 lmol h A1 g cat A1 in the absence of reactants results merely due to desorption from the catalyst.Using TiO 2 , no C-containing products are detected, but H 2 is formed at a 3.7 rate of that using Pd/ TiO 2 (Table 3A-d, h), demonstrating that Pd is indispensable for converting CO 2 using moisture.O V sites are artificially created in vacuum irradiated under UV-visible light (Fig. 5b).However, no C-containing products are detected and H 2 formation rate remains low under the reaction conditions (Table 3A-h 0 ), demonstrating that the rate of Eq. ( 2) on Pd is by far higher than those of Eqs. ( 6)-( 8) on the O V sites 567823,24.The theoretical O 2 amount formed is 0.17 lmol versus an experimental O 2 evolution less than the detection limit of GC-TCD (0.004 lmol), reconfirming that the O 2 and/or O species are readsorbed/remain on TiO 2 . A control test in the absence of CO 2 produces no C-containing products (Table 3A-f), demonstrating that the C source in the photoconversion tests is exclusively CO 2 in this study.This result is consistent with 13 CH 4 formation using 13 CO 2 and moisture monitored by FTIR (Fig. 7C-b).H 2 is effectively formed at the rate of 106 lmol h A1 g cat A1 in the presence of moisture only.The rate decreases by 0.59 times compared to that under 0.40 MPa CO 2 and moisture (Table 3A-d, f), demonstrating that reduction reaction paths to C-containing products and H 2 (Eqs.( 16)-( 19)) are correlated. Furthermore, we perform a control test by filtering out UV light of k 420 nm.In this case, no methane, CO, nor H 2 is formed above the detection limit (Table 3A-d 0 ).A small amount of methanol is detected, but the total formation rate of C-containing compounds is only 1.0 of that irradiated under UV-visible light (Table 3Ad).The theoretical O 2 amount formed is 0.018 lmol versus no O 2 evolution above the detection limit (0.004 lmol; Table 4d 0 ).In the other blank test conducted by removing UV light with k 250 nm and most of the visible light (390 k 695 nm), methane is formed predominantly, but the rate is lower by 0.39 times in comparison to that under UV-visible light (Table 3A-d 00 , d).The theoretical O 2 amount formed is 1.8 lmol against an experimental O 2 evolution of 0.060 lmol (Table 4d 00 ).Only 3.3 of the stoichiometric O 2 is detected, similar to 4.2 in the test under full light.The H 2 evolution rate is lower by 0.23 times compared to that in the test under full light.Thus, in both control tests, O 2 adsorbs again after irradiation, and the visible light contributes to producing C-containing products as well as H 2 via SPR 16 on Pd. In the absence of UV-visible light at 299 K (Table 3A-d 000 , d), no C-containing products, H 2 , nor O 2 are detected.The photoreduction of CO 2 using moisture and water photosplitting via Eqs.( 16)-( 19) are endothermal, in contrast that the photoreduction of CO 2 into methane using H 2 that is exothermal 16.In this context, to verify the thermal effects, blank tests in the absence of UV-visible light are also carried out at 353 K (Table 3A-d 0000 ).No products are detected above the detection limit, demonstrating that the CO 2 conversion from CO 2 and moisture shown in Table 3A proceeds entirely photocatalytically. The O 2 formation in typical reaction conditions (0.40 MPa CO 2 and moisture, 10 mg photocatalyst) was only 4.2 compared to the stoichiometry of Eqs. ( 14) and ( 15) to form methane, CO, methanol, and H 2 (Tables 3A-d and4d).The Pd/TiO 2 photocatalyst was previously irradiated under UV-visible light in vacuum for 5 h.O 2 pressure decreased starting from 2.298 kPa to 2.287 kPa (Fig. 6, left), corresponding to 0.75 lmol of O 2 uptake (Table 4a). Next, the monitoring of O 2 pressure was continued under dark conditions (Fig. 6, right).The pressure quickly decreased in the first 30 min by more than 0.02 kPa and converged to 2.258 kPa after 5 h.Therefore, 1.98 lmol of O 2 adsorbed on Pd/TiO 2 under dark (Table 4a).The theoretical O 2 amount formed using 100 mg Pd/ TiO 2 in the photoconversion test at 4.6 kPa for 5 h was 2.6 lmol based on Eqs. ( 14) and ( 15) and the rate in Table 3A-a, versus the experimental formation of 0.13 lmol based on Eqs. ( 14) and ( 15) and Table 3A-a (Table 4a).The difference (2.5 lmol) can be rationalized by the adsorption on TiO 2 , 0.75 1.98 2.73 lmol (Fig. 6 and Table 4a). The difference between the theoretical O 2 amount formed (6.6 lmol) and the O 2 amount detected (0.28 lmol) in the CO 2 photoconversion test at 0.40 MPa using 10 mg Pd/TiO 2 (Table 4d) was greater (6.3 lmol) than that at 4.6 kPa using 100 mg of Pd/ TiO 2 (Table 4a), mostly due to the difference in the reaction pressure and the thickness of the photocatalyst.The oxygen balance was summarized in Table 4. Stoichiometric O 2 following Eqs.( 16)- (19) was not detected for all the catalysts, however, the unbalance would be consistently explained by the participation of surface hydroxy groups via Eqs.( 40 ) and ( 5) and/ or readsorption of O 2 after photocatalytic tests (Fig. 6).Thus, the evidences of O V sites were the decrease of N(Ti-O) values based on Ti K-edge EXAFS (Table 2B and Fig. S2B), the decrease and increase of both N(Ti-O) and N(Ti(-O-)Ti) values during the irradiation of UV-visible light and under dark, respectively (Fig. 3A,B), color change at surface 5 lm layer in cross-sectional SEM (Fig. 1b2), color change of photocatalyst (Fig. 5b,c), and the O 2 adsorption tests under UV-visible irradiation and under dark (Fig. 6).These evidences strongly suggest the occurrence of Eq. (1) via Eqs.( 4) and ( 5) and/or Eqs. ( 4) and ( 50 ), however, the partial O 2 readsorption even under light (Fig. 6) means that the turnover of Eq. ( 1) was not completed and an O 2 -removing reagent would be needed to proceed true catalysis following Eq.(1). The intermediate species during the efficient conversion of CO 2 into major methane and H 2 on Pd/TiO 2 is monitored using FTIR.In the spectrum for fresh Pd/TiO 2 in vacuum at 293 K for 2 h, two sharp peaks at 3673 and 3634 cm A1 , a very broad peak between 3500 and 3000 cm A1 , a sharp peak at 1624 cm A1 , and weaker peaks at 1553, 1438, and 1358 cm A1 are observed (Fig. 7A-a).These peaks can be assigned to m OH of H-bound hydroxy, bi or tricoordinated hydroxy, and H-bound water 46, antisymmetric stretching vibration (m as ) of hydrogencarbonate (HO-CO 2 Ti), m as of bidentate carbonate (O-CO 2 Ti), symmetric stretching vibration (m s ) of hydrogencarbonate, and m s of bidentate carbonate 47, respectively.When 3.4 kPa CO 2 and 1.2 kPa moisture are introduced into the photocatalyst (Fig. 7A-b), the peak intensity for both pairs of hydrogen carbonate and bidentate carbonate increase, while a part of the two hydroxy peaks at 3673 and 3634 cm A1 switches to a broad peak due to H-bound water (3550 cm A1 ).These changes are more evident if spectrum A-b is subtracted from spectrum A-a, and further subtracted from the spectra of CO 2 (3.4 kPa) and moisture (1.2 kPa) (Fig. 7B-b and 7B 0 -b; decrease of two OH peaks versus increase of broad water peak). Then, the Pd/TiO 2 sample under CO 2 and moisture is irradiated with UV-visible light for 15 min (Fig. 7A-c) and 16 h (Fig. 7A-d). The extent of the change can be checked when the spectra under light is subtracted from spectrum A-a and further subtracted from the spectra of CO 2 (3.4 kPa) and moisture (1.2 kPa) (Fig. 7B-c, d).The expanded views are shown for O-H region (Fig. 7B 0 -c, d) and O-C-O region (B 00 -c, d).The hydrogen carbonate and bidentate carbonate species are inert, and the peaks due to these species negligibly change starting from spectrum b to c then d (Fig. 7B 00 ), whereas peaks due to H-bound and di/tri-coordinated hydroxy groups decrease in Fig. 7B-d Finally, the UV-visible light is turned off, and the Pd/TiO 2 photocatalyst is evacuated at 293 K for 20 min (Fig. 7A-e).The change is more evident, if the difference between spectra B-e and B-d is compared in order to extract the change of the surface species compared to the original spectrum a (Fig. 7B-e).The expanded views are also shown in Fig. 7B 0 -e and B 00 -e.The decrease of both the H-bound and the bi/tri-coordinated hydroxy group during the photoconversion test is canceled via the reaction The amount of hydrogen carbonate and bidentate carbonate species decreases to the level before the photoconversion test by the evacuation of ambient CO 2 (Fig. 7B 00 -e).We assume that the surface concentration of hydroxy is 7 nm A2 for Pd/TiO 2 evacuated at 290 K (Fig. 7A-a) 45, and the peak area of total m OH in Fig. 7A-a decreases by 0.66 times after the 16 h of the CO 2 photoconversion test (Fig. 7A-d).Thus, 0.10 A 60 A 10 18 A 7 A 0.34/ for O 2 formation proceed. The reactants and products were also monitored using CO 2 (59 kPa), moisture (2.3 kPa), Pd/TiO 2 photocatalyst, and UV-visible light.When natural CO 2 ( 12 C 98.93, 13 C 1.07) and moisture was employed, a peak at 1306 cm A1 appeared that was assigned to bending vibration mode (m 4 ) of 12 CH 4 whereas a peak at 1297 cm A1 appeared that was assigned to m 4 of 13 CH 4 using 13 CO 2 and moisture (Fig. 7C).The isotope shift was in consistent with values in literature 484950 taking the low concentrations of methane due to kinetic tests using low pressure of 13 CO 2 (59 kPa) into account.This result was in accordance with the blank test under moisture (2.3 kPa) and UV-visible light in which no C-containing products were detected (Table 3A-f). The performance of photocatalysts is compared at nearly optimized conditions: using 10 mg photocatalyst film under 0.40 MPa CO 2 and moisture (Table 3A-d).The photocatalytic activity to form total C-containing compounds from CO 2 and H 2 was not correlated to the E g values of the metal oxide (3.1-3.2 eV for Pd/TiO 2 ) or the conduction band (CB) minimum voltage for the semiconductors (A0.1 at pH 0, Scheme 1A) 16.The work functions (WFs) for Pd are 5.22-5.6 eV versus the vacuum level 34, corresponding to potentials of 0.78-1.16V versus SHE (pH 0), which are slightly positive compared to the CB of TiO 2 (A0.1 V).Namely, the potential for achieving electron trapping levels are a little more positive than the reduction potentials of methane (0.17 V pH 0) or CO (0.30 or A0.12 V pH 0) (Scheme 1A) 9,51, and it is difficult to reduce CO 2 . In UV-visible absorption spectra 16, the absorption extended over the range between 400 and 800 nm of visible light for Pd/TiO 2 . Localized SPR is a collective vibration of electrons near surface in the resonant condition that natural frequency of the electrons forced by the positive charge of nucleus coincides with the frequency of light.SPR results in elevated electric fields at the surface of the Pd nanoparticles (Scheme 1A).The elevated fields yield a greater number of electron-hole pairs 18,52.It is also known that the resonance frequency of SPR increases as the metal nanoparticles size decrease 52.In HR-TEM images for Pd/TiO 2 photocatalyst, 1.0-6.5 nm of Pd nanoparticles were observed on TiO 2 surface 16.Hence, hot electrons due to SPR at Pd nanoparticles, especially relatively smaller ones, would gain sufficient energy relative to the reaction potential of CO 2 /CH 4 and transfer to CO 2derived surface species (Scheme 1A). If the positive charge that remains at the Pd nanoparticles is combined with excited electrons trapped from the CB of TiO 2 , the Z-scheme-like redox combination is completed.In this context, the electron trapping at metal nanoparticles excited from the semiconductors must be followed by the transfer of hot/excited electrons produced due to SPR on metal nanoparticles to CO 2 -derived species 16,21.This proposed electron flow diagram (Scheme 1A) is well in accord with the wavelength dependence of irradiation for Pd/TiO 2 (Table 3A As the d-band positions at 2.4-4 eV below the Fermi energy (E F ) level 18, the hot electrons in Pd/TiO 2 catalyst would be mostly due to intraband excitation within conduction band (visible light region) 18,52 of 1.0-6.5 nm of Pd nanoparticles rather than due to interband transition between d-band and conduction band (UV light region) 18,53. Similar photoconversion rates in CO 2 and moisture into methane and CO are reported by the addition of metal to TiO 2 in the same order, Pt Pd Au Rh Ag, as that of WF 6.Very small Scheme 1. (A) Energetic diagram of CO 2 photoconversion using moisture (pH 0), (B) proposed reaction mechanism of CO 2 photoconversion using moisture, and (B 0 ) that of side reaction to form H 2 .metal nanoparticles are preferred, because the E F level rises, but still remains below the CB minimum due to the quantum confinement for CO 2 reduction 13.The effects of quantum confinement should be minimal for Pd particles with a mean size of 1.1-3.1 nm (Table 1) in this study.4.2.Cause of higher reactivity of moisture than H 2 in CO 2 photoconversion at 0.80 MPa At 0.40 MPa, the total photoformation rates of C-containing products in CO 2 and moisture are lower by 0.61 times than those in CO 2 and H 2 using Pd/TiO 2 (Table 3B-d).Furthermore, using Pd/ TiO 2 at 0.80 MPa, the total C-containing product formation rate using moisture becomes higher by 4.3 times than that using H 2 (Table 3B-g).Thus, at the optimized reaction pressure, moisture is more reactive than H 2 for pressurized CO 2 photoconversion.In our preliminary photocatalytic tests under 0.40 MPa of CO 2 and moisture using several semiconductor-based photocatalysts, i.e. similar conditions to those in Table 3A-d, the total C-containing product formation rates were higher than those in tests under corresponding reactant pressure of CO 2 and H 2 (Supplementary material, Section S4 and Table S2) 16.The experimental O 2 formation was 40-3.2 of corresponding theoretical values based on Eqs. ( 14) and ( 15) (Table S3) in comparison to 4.2 for Pd/TiO 2 (Table 3).In contrast, quite fast photo-assisted methane formation was reported under CO 2 , H 2 , visible light (k 450 nm), and Ni/SiO 2 AAl 2 -O 3 .Thermal effect nearly at 423 K was suggested due to heat of reaction for methane formation from CO 2 and H 2 54.In this context, the comparison of reactivity between moisture and H 2 depends on reaction temperature.No thermal effects were found using Pd/TiO 2 at 299-353 K in this study (Table 3A-d 00 0 , d 00 00 ).The contribution of the secondary reaction of CO 2 with formed H 2 from moisture is negligible (Supplementary material, Section S6). Following, we consider the oxidation reaction using moisture or H 2 on semiconductors combined with Pd nanoparticles.Water is activated by a hole to form the AOH radical (Eq.( 4)) 7.The subsequent reaction of AOH with a surface hydroxy group/O atom is fast 41, e.g., to form O 2 , an O V site, and a proton(s) (Eqs.( 5) or ( 50 ) and Scheme 1B, left) due to the nature of the radical reaction.In fact, the concentration of O V sites dramatically increases on/in TiO 2 as monitored by the decrease of the N(Ti-O) value from 5.4 for fresh sample to as low as 3.5 under UV-visible light irradiation at beamline (Table 2B-c, e 0 and Fig. S2B-c, e 0 ).This change was supported by the monitoring of N(Ti-O) and N(Ti(-O-)Ti) values during the irradiation of UV-visible light (3.5 h) and darkness (0.5 h) (Fig. 3).The protons formed near the interface between the metal nanoparticle and the TiO 2 surface (Eq.( 4)) are transferred to the metal nanoparticle to form C-containing products or H 2 , whether they encounter CO 2 -derived species and hot/excited electrons, or such electrons only (Scheme 1B, right).In clear contrast, O V sites are observed only at the interface between Pd and the TiO 2 surface under CO 2 and H 2 and UV-visible light 16, denying the radical oxidation mechanism from H 2 .Effectively separated redox sites are nicely conjugated to transport protons between them (Scheme 1B), similar to photosystems 4. In contrast, both CO 2 reduction and H 2 oxidation may proceed on Pd using Pd/TiO 2 16.Due to the competitive adsorption of CO 2 and H on Pd, the exclusive methane formation rates produce a volcano-like maximum at P(CO 2 ) of 0.12 MPa and at P(H 2 ) of 0.28 MPa in the contour diagram.Thus, effective redox-site separation between TiO 2 surface for H 2 O oxidation and Pd nanoparticles for CO 2 reduction is the reason of the observed higher reactivity of moisture than H 2 using Pd/TiO 2 .Redox-site separation is also deduced from the reaction order of methane and CO formation on P(CO 2 ) (0.39 and 0.62, respectively; Fig. 4A), in clear contrast to the volcano-like pressure dependence peaking at P(H 2 ) 0.28 MPa and P(CO 2 ) 0.12 MPa using CO 2 and H 2 16. The best CO 2 photoformation rate of C-containing compounds in this study is 37 lmol h A1 g cat A1 using Pd/TiO 2 .The photo inprofile (action) spectrum for Pd/TiO 2 photocatalyst peaked at 385 nm, but the action also increased in the UV light region based on the tests using seven kinds of cut filters (Fig. 4C), suggesting the needs of both UV light for BG excitation for TiO 2 and UV/visible light for SPR for Pd nanoparticles for the photoconversion (Scheme 1A).Please note that the peak centered at 385 nm was drawn based on tests under the conditions of the presence of UV light of k 370 nm.Thus, if we simplify the quantum efficiency as the ratio of total electrons needed to form C-containing products from CO 2 in the photo in-profile spectrum between 358 nm and 412 nm (7.6 A 10 A4 lmol-e A s A1 ) versus the photon number of absorbed/scattered/reflected UV-visible light between 358 nm and 412 nm (2.9 A 10 15 photons s A1 A 0.49) based on the data that 51 of incident UV-visible light transmits the film (see Section 2.3), quantum efficiency for Table 3A-g was 16.This is the upper limit of true quantum efficiency because the proposed mechanism in Scheme 1A requiring light for both BG excitation and SPR cannot be plotted in simple two-dimensional action spectrum as in Fig. 4C.In the evaluation above, the photon number of UV light is not included. The best rate in this study is lower compared to 1400-2200 lmol-CH 4 h A1 g cat A1 using Pt-TiO 2 (mean thickness 1.5 lm) 13 or Au-Cu-TiO 2 films (0.48 mg cm A2 ) 5.In the crosssectional SEM image, 5 lm of TiO 2 layer including more O V sites are detected at the upper part of the 15 lm 3 lm-thick Pd-TiO 2 layer (Fig. 1b2).The upper 5 lm of the TiO 2 layer absorbs more photons to proceed reactions 4, 4 0 , 5, and/or 5 0 .In fact, the rate of major methane formation dramatically boosted when the mean thickness of Pd/TiO 2 film decreased from 16 lm to 4.6 lm (Fig. 4B).Thus, even a thinner catalyst film is needed to improve the photoconversion rate of CO 2 in this study.Liu et al. suggested that CO 2 activation on an O V site forms CO via Eqs.(6) and/or (7) (8) 7.O V sites should be distributed in the upper 5 lm of the TiO 2 layer (Fig. 1b2) during UV-visible light exposure under 0.40 MPa CO 2 and moisture (Fig. 1b2 and Table 2Ae, B-e 0 ).In contrast, O V sites are detected only at the interface between Pd nanoparticles and the TiO 2 surface for Pd/TiO 2 under 0.40 MPa CO 2 and H 2 16.Based on the test using artificially created O V sites on TiO 2 (Table 3A-h 0 and Fig. 5b), direct CO 2 activation on O V sites is negligible in comparison to that over Pd or the other reduction sites in this study. Stoichiometric O 2 formation is not detected during CO 2 photoconversion according to Eqs. ( 14) and ( 15), but only 4.2 O 2 is experimentally detected for Pd/TiO 2 (Table 3A).The possibility of H 2 O 2 formation is investigated using Ti sulfate, but it is not detected above the detection limit of 0.20 lmol (Supplementary material, Section S5) in comparison to the theoretical (stoichiometric) O 2 amount formed: 6.6 lmol using Pd/TiO 2 at 0.40 MPa (Tables 3A-d and 4d).Thus, the possibility of H 2 O 2 formation is low, but, instead, the formed O 2 may be readsorbed by the photocatalysts after the photoconversion test but before the GC-TCD analysis, as shown in Fig. 6."
  },
  {
    "title": "Conclusions",
    "content": "Photoconversion of CO 2 was optimized using moisture at 4.6 kPa-0.80MPa.The result was successfully explained based on the levels of hot electrons due to SPR or BG-excited electrons. At 0.80 MPa, moisture was found to be more reactive than H 2 for CO 2 photoconversion.This finding was attributed to the effective site separation between CO 2 reduction on Pd nanoparticles and water oxidation on the semiconductor surface, as confirmed using in situ monitoring of Ti K-edge EXAFS and cross-sectional SEM.The redox sites were conjugated in order to transport protons effectively, in a way similar to photosystems.The mass balance of O is explained by the readsorption of the formed O 2 after the photoconversion test, because O 2 adsorption on the O V sites was quicker under dark rather than under UV-visible light.CO 2 photoconversion rates increased up to 0.80 MPa CO 2 and moisture in a reaction order of 0.39-0.62 using Pd/TiO 2 , whereas the volcanolike maxima were at P(CO 2 ) of 0.12 MPa and P(H 2 ) of 0.28 MPa in the contour plot. Fig. 1.Cross-sectional SEM images of Pd/TiO 2 , fresh (a1, a2) 16 and after CO 2 photoreduction testing, under CO 2 (0.40 MPa) and moisture (2.3 kPa) for 5 h (b1, b2).(a1, b1) show wide views, and (a2, b2) show close-ups. Fig. 2. Pd K-edge XANES for PdO (a), Pd foil (b), Pd/TiO 2 photocatalyst (100 mg; fresh) (c), under CO 2 (3.4 kPa) and moisture (1.2 kPa) for 5 h irradiated by UV-visible light (d), under CO 2 (0.40 MPa) and moisture (2.3 kPa) for 5 h irradiated by UV-visible light (e), Pd/TiO 2 (10 mg) after the condition of spectrum e was irradiated by UV-visible light during XAFS measurement (e 0 ), and the mixture of spectra a and b with the mixing ratio of 3:2 (f) and 3:1 (g).The spectra were obtained in the transmission mode, except for Pd K-edge for samples e 0 , which were taken in the fluorescence mode.(Right two panels) Good agreements between spectra c and f (Top) and between spectra d and g (Bottom). ).The N(Ti-O) values are 5.4 and 5.2, respectively, smaller compared to 6 for untreated TiO 2 (Table 2B-c-supp), or 6.1 for the sample under 0.40 MPa CO 2 and H 2 , and UV-visible light irradiation for 5 h 16, suggesting minor O V site formation during liquid-phase reduction to prepare Pd/TiO 2 catalyst.Conversely, the decrease (0.2) under CO 2 and moisture and UV-visible light is insignificant, taking the fit errors (0.1 to 0.3) into account.Pd/TiO 2 after the test at 0.40 MPa for 5 h is irradiated by UV-visible light during the Ti K-edge EXAFS measurement at beamline (Table 2B-e 0 and Fig. S2B-e 0 ).The N(Ti-O) value decreases to 3.5, suggesting a dramatic increase of the number of O V sites during UV-visible light irradiation.The O V sites are reversibly filled by O species after the light is turned off, because the N(Ti-O) value increases to 5.2 in the absence of UV-visible light irradiation (Table 2B-c, e).During the irradiation of UV-visible light, the N (Ti-O) and D(r 2 ) values may be difficult to determine exactly due to the fast reaction with the AOH radical to form O V sites on an ns or ls time scale 41.Similar uncertainty of metal-O coordination is reported for BiOCl N(Bi-O) 4 ?1.9 28. Fig. 3. Time course of Ti K-edge (A-C) EXAFS and (D-F) pre-edge region for Pd/TiO 2 photocatalyst (10 mg) under CO 2 (100 kPa) and moisture (2.2 kPa) for 3.5 h irradiated by UV-visible light and subsequently for 0.5 h under dark.The changes of (A) N(Ti-O) values, (B) N(Ti(-O-)Ti) values, and (C) Fourier transform of k 3 -weighted EXAFS v function. photogenerated h 's via Eqs.(4 Fig. 4. (A) The dependence of formation rates for CH 4 , CO, methanol, O 2 , and H 2 on total reactant pressure and (B) on thickness of Pd/TiO 2 photocatalyst film both under the irradiation of UV-visible light from 500-W Xe arc lamp.(C) The dependence of total formation rates for C-containing products on the wavelength of irradiated light plotted with UV-visible absorption spectrum 16.(A) Pd/TiO 2 10 mg, CO 2 0.12-0.80MPa, and moisture 2.3 kPa.(B) Pd/TiO 2 4.6-26 lm-thick (namely 2.9-16 mg), CO 2 0.40 MPa, and moisture: 2.3 kPa.(C) Pd/TiO 2 10 mg, CO 2 0.40 MPa, and moisture 2.3 kPa. Fig. 5.The color changes of TiO 2 (P25) film as fresh (a), under vacuum and UVvisible light for 4 h (b), under 0.40 MPa CO 2 and moisture for 3 h (c), and after the test and exposed to air (d). Fig. 6.Monitoring of O 2 uptake (2.3 kPa at 0 min) on Pd/TiO 2 photocatalyst after UV-visible light irradiation in vacuum for 5 h.Under UV-visible light for 1 h followed by 5 h under dark. compared to Fig.7B-b and cvia the reactions of Eqs.(40 ) and (5). Fig. 7. (A) FTIR spectra for Pd/TiO 2 photocatalyst in vacuum for 2 h (a), CO 2 (3.4 kPa) and moisture (1.2 kPa) added (b), under irradiation of UV-visible light for 15 min (c) and for 16 h (d), and light is turned off after 16 h of the reaction and evacuated for 20 min (e).(B) Difference spectra: A-b-A-a -the spectrum of CO 2 (3.4 kPa) -the spectrum of moisture (1.2 kPa) (b), A-c-A-a -the spectrum of CO 2 (3.4 kPa) -the spectrum of moisture (1.2 kPa) (c), A-d-A-a -the spectrum of CO 2 (3.4 kPa) -the spectrum of moisture (1.2 kPa) (d), and A-e -A-a (e).(B 0 ), (B 00 ) Expanded views of B in the regions of stretching vibrations of O-H (B 0 ) and O-C-O (B 00 ).(C) FTIR monitoring of reactants and products using Pd/TiO 2 , UV-visible light, CO 2 (59 kPa), and moisture (2.3 kPa).Natural CO 2 for (a) versus 13 CO 2 ( 13 C 99) for (b). 02 A 10 23 ) 24 lmol of the hydroxy group on 100 mg of the Pd/ TiO 2 disk are consumed during the FTIR measurements under 4.6 kPa CO 2 and moisture and UV-visible light for 16 h (Table 4a).Thus, 24 and 12 lmol O 2 are formed via Eqs.(4) and (5) and Eqs.(4 0 ) and (5), respectively.The O 2 amount assuming the route of Eqs.(4 0 ) and (5) agrees more with the theoretical (stoichiometric) O 2 formation (5.3 lmol h A1 g cat A1 A 0.100 A 16 8.4 lmol; Basic physicochemical properties of Pd/TiO 2 photocatalyst used for tests under CO 2 and moisture in this study. 1.1( 0.1) 2.6( 0.3) 1 30-50 16 25( 8) 16 1 After photocatalytic tests under CO 2 (3.4 kPa) moisture (1.2 kPa) for 5 h.H. Zhang et al. / Journal of Catalysis 352 (2017) 452-465 16ndence of CO 2 photoconversion using moisture on the amount of photocatalysts and reactant pressure and control test results in the absence of UV and/or visible light, catalyst, or reactant (A) and the comparisons to CO 2 photoconversion using H 216at the same total pressure of reactants (CO 2 and moisture versus CO 2 and H 2 ) (B). 2,3 Using L42 filter 2 and U330 filter 3 at the light exit.Temperature 296 K.4,5In the absence of UV-visible light at 299 K 4 and at 353 K.5,6In 0.40 MPa of helium or argon.Mixed gas of 0.10 MPa of CO 2 and 2.3 kPa of H 2 O was flowed prior to the introduction of 0.40 MPa of CO 2 .8CatalystwasirradiatedunderUV-visiblelight for 4 h and vacuum prior to the test.9In the unit of lmol h A1 .10Resultsusing CO 2 and H 2 were reported in Ref.16. 1 Total molar amount of products comprising C. 7 H. Zhang et al. / Journal of Catalysis 352 (2017) 452-465 40MPa is6.6lmol in comparison to the detected O 2 amounts of 0.28 lmol (Tables 3A-d and 4d).Thus, only 4.2 O 2 is experimentally detected, suggesting that the formed O 2 is readsorbed and/or intermediate O species remain on the photocatalyst surface after the tests.The ratios of consumed holes versus consumed electrons is also listed in Table4d, however, are not exactly the same as the ratios of experimentally detected O 2 versus theoretical one described above due to the contribution of side reaction in Eq. (14).Using Pd/TiO 2 , O species are accumulated on TiO 2 after the photoconversion test, because some of the O sites are lost on/in TiO 2 during the photoconversion test but are restored after the test, as confirmed by the Ti K-edge XAFS analysis (Table The balance of oxygen in the CO 2Photoconversion tests (5 h) and FTIR monitoring (16 h) under various reaction conditions.2 . Table 4a) in the photoconversion test at 4.6 kPa CO 2 and moisture based on the total formation of methane and H 2 (Table 3A-a) and Eqs.(14) and (15).The observed O 2 formation (0.25 lmol h A1 g cat A1 corresponding to 0.40 lmol-O 2 ) suggests readsorption of O 2 on the TiO 2 surface.In summary, the intensity of the hydrogen carbonate and bidentate carbonate peaks on the TiO 2 surface partially increases in the presence of CO 2 and moisture, but changes slightly due to UV-visible irradiation.The peak intensity due to the H-bound and the di/tri-coordinated hydroxy group for fresh Pd/TiO 2 decreases by 0.66 times after the 16 h of CO 2 photoconversion, demonstrating that the reactions of Eqs.(4 0 ) and (5) -d, d 0 , d 00 ).The sum of C-containing product formation rates under visible light (0.23 lmol h A1 g cat A1 ) and under UV light (7.4 lmol h A1 g cat H. Zhang et al. / Journal of Catalysis 352 (2017) 452-465 The authors are grateful for the financial supports from the Grant-in-Aid for Scientific Research C (26410204) from Japan Society for the Promotion of Science and Leading Research Promotion Program (2015-) from the Institute for Global Prominent Research, Chiba University.X-ray absorption experiments were conducted under the approval of the Photon Factory Proposal Review Committee (2016G577, 2015G586, 2014G631).The authors thank Masaya Miyano for the support of data analysis.In addition, the authors would like to thank Enago (www.enago.jp)for the English language review. Supplementary data associated with this article can be found, in the online version, at http://dx.doi.org/10.1016/j.jcat.2017.06.016."
  }
]