[
  {
    "title": "Doi",
    "content": "10.1039/c4ra06565d"
  },
  {
    "title": "Article_Title",
    "content": "Formation of 3D interconnectively macro/mesoporous TiO<sub>2</sub> sponges through gelation of lotus root starch toward CO<sub>2</sub> photoreduction into hydrocarbon fuels"
  },
  {
    "title": "Abstract",
    "content": "A particular TiO 2 sponge, consisting of macroporous framework with interconnected mesoporous channels, was fabricated through a co-gelation of lotus root starch (LRS) with TiO 2 precursor, followed by lyophilization and subsequent calcination.This strategy advantageously inherits both the traditional hard-templating technique for well-defined 3D predesigned macroporous architecture and softtemplating techniques for interpore connectivity.The resulting TiO 2 sponge exhibits about a 2.60 fold improvement in CO 2 photoconversion rate (CH 4 : 5.13 ppm h A1 ) compared to the referred TiO 2 (1.97 ppm h A1 ) formed in the absence of the LRS.The generation rate of CH 4 over macro/mesoporous TiO 2 sponge could be further significantly enhanced to 11.95 ppm h A1 by co-loading Pt (0.9 wt) and Cu (1.7 wt) as co-catalysts by improvement of the separations of the photogenerated electron-hole pairs.The higher photocatalytic activity of the macro/mesoporous TiO 2 sponge can be attributed to the following three reasons: (1) macroporous architecture favors gas diffusion of the reactants and the products; (2) macroporous architecture also promotes the multiple-reflection effect occurring inside the interior macrocavities, which enables trapping (or harvest) the incident light in the photocatalyst for a longer duration and bring forth more opportunities for light absorption; and (3) the mesoporous structure enhances gas capture/adsorption of the reactants and provides more reaction sites."
  },
  {
    "title": "Experimental",
    "content": "Preparation of 3D hierarchically macro/mesoporous TiO 2 sponge and referred TiO 2 The typical synthesis procedure of 3D hierarchically macro/ mesoporous TiO 2 sponge was as follows: 1 g of LRS granules and 0.9 g of TALD were mixed with 8.1 g of distilled water in a beaker with stirring to form a lump-free suspension.The suspension was then heated on a water bath at 95 C, and the stirring was continued until the starch gelatinized.The viscous starch paste was maintained at 95 C for additional 10 min without further stirring.The starch paste was then removed from the water bath, naturally cooled to room temperature, and fully dried by lyophilization.The resulting LRS-TALD hybrid monolith was calcined at 550 C for 5 h to get rid of the LRS and generate the macro/mesporous TiO 2 sponge.Moreover, TiO 2 samples formed in the absence of LRS gelatin (hereaer called \"referred TiO 2 \") were synthesized by direct calcinations of freeze-dried TALD and compared with TiO 2 sponges. Thermogravimetric analysis (TGA) was carried out (Pyris 1 DSC, PerkinElmer USA) at a heating rate of 20 C min A1 from 25 C to 700 C in air.The crystallographic phase of the as-prepared products was determined by powder X-ray diffraction (XRD) (Rigaku Ultima III, Japan) using Cu-Ka radiation (l 14 0.154178 nm) with scan rate of 10 min A1 at 40 kV and 40 mA.The samples were analyzed with X-ray photoelectron spectroscopy (XPS) (K-Alpha, THERMO FISHER SCIENTIFIC).The XPS spectrum was calibrated with respect to the binding energy of the adventitious C1s peak at 284.8 eV.The morphology of the samples was observed by the eld emission scanning electron microscopy (FE-SEM) (FEI NOVA NanoSEM230, USA) and transmission electron microscopy (TEM) (JEOL 3010, Japan).The specic surface area of the samples was measured by nitrogen sorption at 77 K on a surface area and porosity analyzer (Micromeritics TriStar, USA) and calculated by the BET method.The CO 2 absorption on the surface of the samples was evaluated by the above-mentioned adsorption apparatus under ambient pressure and 0 C. Fourier transform infrared (FTIR) spectroscopy was conducted using a Nicolet NEXUS870 (USA) spectrometer. In the photocatalytic reduction of CO 2 , 0.1 g of sample was uniformly dispersed on the glass reactor with an area of 4.2 cm 2 .A 300 W xenon arc lamp was used as the light source of photocatalytic reaction.The volume of the reaction system was about 230 mL.The reaction setup was vacuum-treated several times, and then the high purity CO 2 gas was added into the reaction setup until ambient pressure was reached.0.4 mL of deionized water was injected into the reaction system as reducer.The as-prepared photocatalysts were allowed to equilibrate in the CO 2 /H 2 O atmosphere for several hours to ensure that the adsorption of gas molecules was complete.During the irradiation, about 1 mL of gas was continually taken from the reaction cell at given time intervals for subsequent CH 4 concentration analysis using a gas chromatograph (GC-2014, Shimadzu Corp, Japan).concentrations ranging from 0.5 wt to 20 wt.It was found that the self-assembling architecture of the starch sponge strongly depends on the initial starch concentration.The starch concentrations at 0.5 wt and 1 wt produce networks of interwoven nanobers with diameters of tens and hundreds of nanometer, respectively (Fig. S1a andS1b ).With the concentration at 2 wt, the sheet-like pieces begin to appear and coexist with interwoven bers (Fig. S1c ).5-20 wt starch concentrations were found to be proper to construct 3D porous sponges with continuous walls (Fig. 1a-d, Fig. S1d and S1e ).Fig. 1 shows different magnication FE-SEM images of the LRS sponge typically formed at 10 wt.The large-scale, well-dened, and macroporous network was clearly observed.The pore size ranges from 1 to 2 mm and the thickness of the pore wall is measured about 60-70 nm.The pore size and porosity of the sponge decrease with the increase of the starch concentration.Furthermore, increase in the concentration to 40 wt leads to near disappearance of the porous structure."
  },
  {
    "title": "Results_and_Discussion",
    "content": "10 wt LRS was typically selected for generation of TiO 2 sponge.The TALD was mixed with an aqueous dispersion of 10 wt LRS granules, followed by heating, gelation, and subsequent lyophilization, which affords the formation of LRS-TALD hybrids.It was found that incorporation of TALD has no obvious inuence on the gelatin morphology of the LRS, although TALD may partially hydrolyze during the gelation process (Fig. 2).The FTIR spectra show that native LRS granule exhibits several discernible absorbances at 1000-1100 cm A1 and about 1700 cm A1 (Fig. 3), which may be assigned to C-O and CO stretching vibrations, respectively.The band assigned to C-O at around 1000 cm A1 displays obvious blue shi for lyophilized LRS sponge and TALD-LRS hybrid sponge compared with native starch granule, which is attributed to the breaking of hydrogen bonding during gelatinization. 23As for the band assigned to CO at around 1700 cm A1 , the lyophilized LRS sponge shows no signicant differences relative to the native starch granule.However, for the TALD-LRS hybrid sponge, there is an obvious red shi, indicating the interaction between TALD and starch species owing to the facile incorporation of the TALD into polysaccharides. 24This demonstrates that the components of the LRS-TALD hybrid are intermingled with each other at a molecular level. Calcination at 550 C enables removal of the starch moieties, during which the TALD was in situ simultaneously decomposed into TiO 2 .The thermo-gravimetric analysis (TGA) and differential thermal analysis (DTA) show that with the temperature rising, three weight loss regions were observed in the pure starch sponge (Fig. 4a).Based on the quantitative calculation of the weight loss in each region, the thermal decomposition processes were distinguished as follows.The weight loss region from 25 to 125 C represents the evaporation of water previously adsorbed by the starch sponge.A notable weight loss region from 240 to 400 C was attributed to the decomposition of the starch.A small peak appears at about 478 C, which results from the further decomposition of the starch.This indicates that the LRS can be completely eliminated with calcination at 550 C. Two new DTA peaks at 244 C and 279 C were observed in the TALD/starch sponge (Fig. 4b), which may be attributed to the step by step decomposition of TALD into TiO 2 . Fig. 5 shows that the resulting TiO 2 sponge aer calcinations easily retains the 3D hierarchically macroporous framework of the LRS.The TiO 2 sponge possesses smooth and continuous walls with thickness of 30 nm.The macropore size is about 1.5-2.5 mm, slightly bigger than that of the LRS template due to shrinkage of the framework aer calcinations.The TEM image reveals that the TiO 2 wall was comprised of small nanoparticles with size ranging from 10 to 20 nm (Fig. 6).The wall network contains a considerable number of mesopores of generally 5-10 nm in pore size, which are absolutely penetrated through the wall and primarily originate from the removal of the LRS.The high-resolution TEM image further reveals well-dened lattice fringes of the TiO 2 nanoparticle and the presence of the mesopores.The X-ray diffraction (XRD) pattern of the TiO 2 sponge shows that all of the diffraction peaks can be indexed to anatase phase TiO 2 (JCPDS no.21-1272), and no characteristic peaks of other impurities were observed, indicating that anatase was the only crystal phase present in the product (See ESI, Fig. S2 ).The corresponding XPS spectrum demonstrates the presence of Ti 2p 3/2 and Ti 2p 1/2 at around 459.1 eV and 464.7 eV, respectively (Fig. S3 ).Fig. 7 shows a typical N 2 gas adsorption-desorption isotherm of the resulting macro/mesoporous TiO 2 sponge.The isotherm displays the typical IV curve, which is ascribed to a predominantly mesoporous structure and is absent in the referred TiO 2 formed in the absence of the LRS.The presence of a pronounced hysteresis loop in the isotherm curve is indicative of a 3D intersection network of the TiO 2 sponge. 25The measured mesopore size was centered on 2-10 nm, in good agreement with the HRTEM image.The TiO 2 sponge exhibits 31.4 m 2 g A1 of surface area, ten times higher than the referred TiO 2 of 3.3 m 2 g A1 .The quantity of CO 2 adsorption of the TiO 2 sponge is 6.77 mg g A1 , which is also obviously higher than that of the referred TiO 2 of 1.67 mg g A1 .This indicates that the mesoporous architecture of the TiO 2 sponge can promote the photocatalytic conversion of CO 2 through the favored absorption of CO 2 . Photocatalytic conversion of CO 2 to renewable hydrocarbons using solar energy is one of the best solutions to both the global warming and the energy shortage problems.Generally, in the presence of water vapor, CO 2 could be photoreduced into CH 4 using the wide band gap semiconductor as a photocatalyst through water oxidation of 2H 2 O / O 2 4H 4e A CB (E o redox 14 0.82 V vs. NHE) and CO 2 reduction of CO 2 8e A 8H / CH 4 2H 2 O (E o redox 14 A0.24 V vs. NHE).As a classic photocatalyst, the macro/mesoporous TiO 2 sponge was investigated for CO 2 photoreduction.Gas chromatographic analysis demonstrates that CH 4 was exclusively obtained as the reduction product without detectable CO, H 2 , or C 2 H 6 as secondary products.A control experiment with identical condition and in the absence of CO 2 shows no appearance of CH 4 , proving that the carbon source was completely derived from the input CO 2 .Fig. 8 shows that the gross yield in CH 4 increases with the photoreduction evolution time.The TiO 2 sponge (CH 4 : 5.13 ppm h A1 ) exhibits about a 2.60 fold improvement in conversion efficiency than the referred TiO 2 (1.97 ppm h A1 ).The higher photocatalytic activity of the macro/mesoporous TiO 2 sponge can be attributed to the following three reasons: (1) macroporous architecture favors gas diffusion of the reactants and the products; (2) macroporous architecture also promotes the multiple-reection effect, occurring inside the interior macrocavities, which enables trapping (or harvest) of the incident light in the photocatalyst for a longer duration and bring forth more opportunities for light absorption; (3) the mesoporous structure enhances gas capture/adsorption of the reactants and provides more reaction sites.It is noteworthy that the generation rate of CH 4 over macro/mesoporous TiO 2 sponge could be signicantly enhanced to 11.95 ppm h A1 by co-loading Pt (0.9 wt) and Cu (1.7 wt) as co-catalysts to improve the separations of the photogenerated electron-hole pairs. 26It is expected that loading specic light-absorbing metal nanocatalysts into the present porous TiO 2 sponge may be further improved CO 2 conversion efficiency through photothermal reaction. 27"
  },
  {
    "title": "Conclusions",
    "content": "The 3D interconnectively macro/mesoporous TiO 2 sponges were synthesized using a facile, low cost, and environmental approach through the gelation process of LRS.This route to macro/mesoporous TiO 2 monoliths advantageously inherits both the traditional hard-templating technique for well-dened 3D predesigned macroporous architecture and so-templating techniques for interpore connectivity.The hierarchically macro/ mesoporous TiO 2 monolith exhibits a higher photocatalytic activity for the reduction of CO 2 into CH 4 in the presence of water than the referred TiO 2 , beneting from the favorable gas diffusion of the reactants and the products, more opportunities for light absorption, and more reaction sites. Fig. 1 and Fig. S1 showed the FE-SEM images of a series of the lyophilized pure LRS sponges obtained at various Fig. 1 FE-SEM images of pure LRS sponges prepared from 10 wt at different magnifications. Fig. 2 FE-SEM images of as-prepared LRS-TALD hybrid sponge prepared from 10 wt starch at different magnifications. Fig. 3 FTIR spectra for (a) native LRS granules, (b) as-synthesized LRS sponge and (c) LRS-TALD hybrid sponge. Fig. 5 FE-SEM images of as-prepared 3D interconnectively macro/ mesoporous TiO 2 sponges templated by 10 wt LRS at different magnifications. Fig. 6 (a) TEM and (b) HRTEM images of as-prepared 3D interconnectively macro/mesoporous TiO 2 sponges templated by 10 wt LRS. Fig. 7 N 2 adsorption-desorption isotherms and Barrett-Joyner-Halenda (BJH) pore size distribution plot (inset picture) of (a) asprepared 3D interconnectively macro/mesoporous TiO 2 sponges and (b) referred TiO 2 formed in the absence of the LRS. Fig. 4 The TGA (DTG) spectras of as-synthesized (a) LRS sponge and (b) LRS-TALD hybrid sponge. Fig. 8 CH 4 generation over (a) as-prepared 3D interconnectively macro/mesoporous TiO 2 sponges, (b) referred TiO 2 formed in the absence of the LRS and (c) 0.9 wt Pt 1.7 wt Cu-coloaded 3D interconnectively macro/mesoporous TiO 2 sponges as a function of light irradiation time. Published on 20 August 2014.Downloaded by Universidad Autonoma de Madrid on 09/09/2015 19:58:01.View Article Online This journal is The Royal Society of Chemistry 2014 This work was supported by the 973 Program (no.2014CB239302, 2011CB933303, and 2013CB632404), the National Science Foundation of Jiangsu Province (no.BK2012015 and BK 20130053), the National Natural Science Foundation of China (no.2147309, 51272101, 51202005), the College Postgraduate Research and Innovation Project of Jiangsu Province (no.CXZZ130033), the Provincial Science Key Foundation of Higher Education Institutions of Anhui (no.KJ2011A053), and the China Postdoctoral Science Foundation (no.2012M521037)."
  }
]