[
  {
    "title": "Doi",
    "content": "10.1016/j.jlumin.2014.04.040"
  },
  {
    "title": "Article_Title",
    "content": "CeF3/TiO2 composite as a novel visible-light-driven photocatalyst based on upconversion emission and its application for photocatalytic reduction of CO2"
  },
  {
    "title": "Abstract",
    "content": "Novel upconversion luminescent material CeF 3 and visible-light-driven photocatalyst CeF 3 /TiO 2 composite were synthesized by microwave-hydrothermal method and microwave-alcohothermal method respectively.The prepared samples were characterized by XRD, TEM, SEM, EBSD, EDS and PL.The CeF 3 / TiO 2 composite was applied on the photocatalytic reduction of CO 2 with H 2 O under visible light irradiation ( 4515 nm).XRD and TEM images showed that the as-prepared CeF 3 sample was hexagonal phase and hollow sphere-like or rod-like nanocrystal.The study of fluorescent spectrum indicated that CeF 3 could convert visible light (420-600 nm) into ultraviolet light (285-380 nm), and two emission peaks at 304 nm and 324 nm were observed under the excitation of 524 nm and 554 nm at room temperature.XRD, SEM, EBSD and EDS images indicated that CeF 3 particles were well wrapped or intermixed with TiO 2 particles in the CeF 3 /TiO 2 composite.The results showed that CeF 3 /TiO 2 was an effective photocatalyst for CO 2 reduction under visible light than pure TiO 2 due to the upconversion emission; the corresponding average energy efficiencies were about 0.2 and 0, and methanol yields were 162.2 and 0 mol/g-cat under the same conditions.Additionally, the mechanism of photocatalytic reduction of CO 2 on CeF 3 /TiO 2 composite was proposed."
  },
  {
    "title": "Experimental",
    "content": "The CeF 3 sample was prepared by a microwave-hydrothermal method.NH 4 F aqueous solution (0.067 M) was dripped into the Ce (NO 3 ) 3 aqueous solution (0.6 M) under stirring.After stirring for 30 min, the suspension was transferred into a Teflon-lined vessel and experienced a microwave treatment.Finally, the product was collected by centrifugation and washed with distilled water and ethanol for several times, and dried at 60 1C. A microwave-alcohothermal method was employed to synthesize the CeF 3 /TiO 2 composite.0.4 g CeF 3 was dispersed in ethanol and injected with 7.8 mL acetic acid.Then, 6.6 mL butyl titanate dispersed in ethanol was added to the suspension with a controlling speed upon stirring.After stirring for 30 min, the above precursor suspension experienced a microwave treatment (180 1C, 600 W, 30 min), centrifugation, washing and drying.The dry powder was annealed to obtain the CeF 3 /TiO 2 composite.In addition, pure TiO 2 was fabricated by the same method without addition of CeF 3 to be a reference. X-ray diffraction patterns (XRD) of the samples were obtained on a Bruker D8 Advance Diffractometer with high intensity Cu K 1 ( 140.15406 nm).Field-emission scanning electron microscope (SEM) images were taken on a JSM-6390A electron microscope with electron backscattered diffraction (EBSD) and energydispersive X-ray (EDS).Transmission electron microscope (TEM) images were recorded on a JEM-100SX electron microscope.Room temperature upconversion luminescence properties were observed using a fluorescence spectrophotometer (Hitachi F-7000). Visible light photocatalytic tests were evaluated by photocatalytic reduction of CO 2 with H 2 O in a circulated quartz photoreactor.A spherical xenon lamp (500 W) with sun-like radiation spectrum equipped with a 515-nm cutoff optical filter was employed as the visible light source of the self-made reactor.The system was shielded by a black box during the reaction to prevent the reactor from being interfered with outside light.In a typical experiment, 0.4 g of photocatalyst was suspended in 400 mL of distilled water.Prior to irradiation, CO 2 (99.995) was bubbled through the reactor for at least 30 min to eliminate dissolved oxygen and saturate the solution.The concentrations of reduction product of CH 3 OH were monitored using a GC9790 gas chromatography.The methanol yield and energy efficiency were calculated based on Eqs. ( 1) and ( 2) below. where Y CH 3 OH is the methanol yield, in micromoles per gram of catalyst, C CH 3 OH is the methanol concentration, in micromoles per liter, V rea is the volume of react ion solution, in liter, M cat is the mass of the photocatalyst, in gram, E e is the energy efficiency, H CH 3 OH is the combustion heat of methanol, in joules per mole, E a is the energy of photons absorbed by photocatalyst, in joule"
  },
  {
    "title": "Results_and_Discussion",
    "content": "Fig. 1 shows the XRD patterns of the as-synthesized CeF 3 , TiO 2 and CeF 3 /TiO 2 composite.The high and sharp peaks in the patterns indicate that all of the samples are well crystallized.The characteristic diffraction peaks of the hexagonal phase CeF 3 and anatase TiO 2 can be observed in the XRD patterns of CeF 3 and TiO 2 samples, which are in good agreement with those in the standard JCPDS file nos.08-0045 and 21-1272 respectively.The pattern of CeF 3 /TiO 2 composite includes both characteristic diffraction peaks of the hexagonal phase CeF 3 and anatase TiO 2 without other impurity peaks, which indicates that the composite process does not change the crystalline phase and chemical properties of TiO 2 and CeF 3 . The sizes and morphology of the as-prepared CeF 3, TiO 2 and CeF 3 /TiO 2 composite are investigated in Fig. 2. As shown in Fig. 2 (a), the CeF 3 samples are nano hollow sphere-like or rod-like particles.The sphere-like nanoparticles have a diameter of about 15-35 nm, while the rod-like nanoparticles have a length of about 20-30 nm and a diameter of about 15 nm.It is apparent that the CeF 3 samples consist of a large number of nanoparticles with a relatively uniform size which tends to adhere to each other (Fig. 2 (b)).However, in the SEM and EBSD images of CeF 3 /TiO 2 composite (Fig. 2(c) and (d)), very few CeF 3 nanoparticles are found on the surface of the TiO 2 particles or between the TiO 2 particles, which indicates that CeF 3 particles are well wrapped or intermixed with TiO 2 particles.The EDS image of CeF 3 /TiO 2 composite is used to The three-dimensional upconversion luminescence scan spectrum of CeF 3 was measured (seen in Fig. 4).It can be seen clearly that the visible light (420-600 nm) can be effectively converted into ultraviolet (UV) light (285-380 nm) by CeF 3 .Fig. 5 shows the upconversion luminescence emission and excitation spectra of CeF 3 .Using the monitoring wavelengths at 524 nm and 554 nm respectively, two UV emission peaks at 304 nm and 324 nm are detected in the emission spectrum of CeF 3 (Fig. 5(a) and (b)).Using the monitoring wavelength at 324 nm, two visible light excitation peaks at 524 nm and 554 nm are found in the excitation spectrum of CeF 3 (Fig. 5(c)). Further investigations revealed that CeF 3 can also emit two emission peaks at 304 nm and 324 nm when it is excited by 260 nm and 280 nm (seen in Fig. S1 in Supporting information).This downconversion luminescence is probably assigned to Ce 3 electrons' transfer between the different sub-levels of 5d excited states split by the crystal field 26 and the 4f ground state ( 2 F 5/2 and 2 F 7/2 ).The phenomenon demonstrates obvious properties of broad-band absorption and emission, which is in consistence with most references 272829.It is apparent that the emission peaks of upconversion luminescence are similar to that of the downconversion luminescence in shapes and positions, which indicates that they undergo a similar emission process.The excitation energy of 260 nm is almost twice as much as the excitation energy of 524 nm.Meanwhile, the excitation energy of 280 nm is almost twice as much as the excitation energy 554 nm.Therefore, the upconversion of visible light is dominated by a two-photon excitation process.However, because there are no intermediate energy levels between 5d and 4f levels of Ce 3 , it may be deduced to a multi-photon simultaneous absorption.This mechanism could be considered that more than one photon are absorbed at the same time, which results in direct electron excitation from an initial state to a final state. The possible luminescence process of CeF 3 is showed Fig. S2 in supporting information.First, an electron located on the ground state ( 2 F 5/2 ) absorbs one 260 nm photon (4.77 eV) or simultaneously absorbs two 524 nm photons (2.37 eV) and transfer to the excited 5d state (4.77 eV); it absorbs one 280 nm photon (4.43 eV) or simultaneously absorbs two 554 nm photons (2.24 eV) and transfer to the excited 5d state (4.43 eV).Then, the electron nonradiatively relaxes to the lowest 5d state (4.08 eV).Finally, the transitions from the lowest 5d state to the ground state ( 2 F 5/2 ) or the state ( 2 F 7/2 ) result in the emission peaks at 304 nm and 324 nm. The visible light photocatalytic properties of CeF 3 /TiO 2 composite were measured by photocatalytic reduction of CO 2 with H 2 O with the irradiation of visible light ( 4515 nm).Fig. 6 shows that CeF 3 /TiO 2 composite has obviously effective activity, and the corresponding methanol yield fleetly increases at the beginning and reaches its maximum (162.2 mol/g-cat) at 3.0 h.Meanwhile, the average energy efficiency was about 0.2 on the CeF 3 /TiO 2 composite in 3.0 h.However, pure TiO 2 and CeF 3 do not show any photocatalytic activity when used separately under the same conditions.The result illustrates that the visible light ( 4 515 nm) catalytic activity of TiO 2 can be initiated under the existence of CeF 3 , which is because TiO 2 can absorb the UV light converted from visible light by CeF 3 . The visible-light-driven photocatalysis based on upconversion emission depends on the energy transfer from CeF 3 to TiO 2 .The requirement for an efficient energy transfer is to make the donor (CeF 3 ) emission band overlap with the absorption band of the acceptor (TiO 2 ).The upconversion emission spectrum of CeF 3 and the absorption spectrum of TiO 2 are presented in Fig. 7.It is very clear that the absorption band of TiO 2 (Fig. 7(a)) overlaps very well with the UV emission of CeF 3 particles (Fig. 7(b)).To examine this energy transfer process, the upconversion emission spectra of CeF 3 /TiO 2 was recorded under the excitation of 524 nm (Fig. 7 (c)).The intensities of UV emission peaks are immensely reduced after the combination of TiO 2 , which indicates effective energy transfer between CeF 3 and TiO 2 .The comparison of the visible light photocatalytic activities between the donor and acceptor and the donor-acceptor pairs could provide direct evidences for the energy transfer (refer Section 3.3). The mechanism 30 of photocatalytic reduction of CO 2 on TiO 2 / CeF 3 is shown in Fig. 8. Firstly, the incident visible light was absorbed by CeF 3 .Secondly, the visible light was converted into UV light by CeF 3 .Subsequently, the UV light is absorbed by TiO 2 particles, and electron (e A )-hole (h ) pairs are formed and located in the conduction band and valence band of TiO 2 .Finally, redox reactions are initiated by e A and h on the surface of TiO"
  },
  {
    "title": "Conclusions",
    "content": "CeF 3 hollow nanostructures with upconversion luminescence properties was synthesized by a microwave-hydrothermal method, and TiO 2 /CeF 3 composite was prepared as a visible-light-driven photocatalyst based on upconversion emission by a microwavealcohothermal method.The microstructures, properties and mechanism of upconversion luminescence of the resulting samples were investigated.The energy transfer from CeF 3 to TiO 2 under visible light irradiation was confirmed.The visible light driven photocatalysis was realized by photocatalytic reduction of CO 2 with H 2 O.This study suggested a promising method to develop the visible light driven photocatalyst, which may have a profound implication on the future utilization of solar energy and recycling CO 2 . Fig. 1.XRD patterns of CeF 3 , TiO 2 and CeF 3 /TiO 2 composite. Fig. 2. TEM image of (a) CeF 3 , SEM images of (b) CeF 3 and (c) CeF 3 /TiO 2 , EBSD image of (d) CeF 3 /TiO 2 . Fig. 3. EDS image of CeF 3 /TiO 2 composite. Fig. 4. The three-dimensional upconversion luminescence scan spectrum of CeF 3 . Fig. 7. Absorption spectrum of TiO 2 (a), upconversion emission spectrum of CeF 3 (b), and upconversion emission spectrum of CeF 3 /TiO 2 (c). Fig. 8. Mechanism of photocatalytic reduction of CO 2 on TiO 2 /CeF 3 . 2 .The active h can oxidize H 2 O to form hydroxyl radicals (OH) which could release O 2 and H .H and high active e A will facilitate CO 2 reduction and produce methanol or other hydrocarbons.It indicates that six electrons are required to convert CO 2 into CH 3 OH.It is apparent that CeF 3 plays a crucial role in the above process.2hv 524 nm 2hv 554 nm -CeF 3 hv 304 nm hv 324 nm Acknowledgments This work was supported by the National Natural Science Foundation of China (Nos.21306150, 21176199 and 51372201), the Specialized Research Fund for the Doctoral Program of Higher Education of China (No. 20136101110009), the Shaanxi Provincial Research Foundation for Basic Research, China (No. 2013JQ2003), the Scientific Research and Industrialization Cultivation Foundations of Education Department of Shaanxi Provincial Government, China (Nos.2013JK0693 and 2011JG05), the Scientific Research Foundation of Northwest University (No. 12NW19), and the Scientific Research Staring Foundation of Northwest University (No. PR12216). Supplementary data associated with this article can be found in the online version at http://dx.doi.org/10.1016/j.jlumin.2014.04.040."
  }
]