[
  {
    "title": "Doi",
    "content": "10.1016/j.materresbull.2017.08.036"
  },
  {
    "title": "Article_Title",
    "content": "In-situ and phase controllable synthesis of nanocrystalline TiO 2 on flexible cellulose fabrics via a simple hydrothermal method"
  },
  {
    "title": "Abstract",
    "content": "The highlights of the manuscript are as follows: We present a facile hydrothermal method at low temperature (90 C) to in situ fabricate TiO2 finished cellulose fabric nanocomposites with different anatase, rutile and brookite compositions. The cellulose fabrics are well preserved and the TiO2 nanoparticles form a homogeneous thin film which is firmly anchored on the fabric surface even after 30 minutes of strong ultrasonic processing, greatly enhance its practical application. The TiO2 finished cellulose fabric nanocomposites are ideal for the photoreduction of CO2 and other applications such as self-cleaning, antibacterial and water or air purification. This work provides a reference for the preparation of the novel functional fabric materials."
  },
  {
    "title": "Experimental",
    "content": "Tetrabutyl titanate (Ti(OBu)4, CP), hydrochloric acid (HCl, AR, 36 38wt), ethanol (AR) and acetone (AR) were supplied by Sinopharm Chemical Reagent Co., Ltd..All of the chemical reagents were used without further purification.The cellulose fabrics (10 15 m in diameter) used as substrates were ordinary commercial plant cellulose fabrics composed essentially of pure cellulose (100). The plant cellulose fabrics were cut into pieces of appropriate size (5 cm 24 cm) and rinsed completely with deionized water and ethanol to remove impurities. Hydrochloric acid solution was prepared to reach a total volume of 40 mL and with varying volume ratios of H2O and HCl, as shown in Table 1. 4 mL tetrabutyl titanate (TBT) was then added dropwise into the prepared solution and stirred vigorously for 1 h.Afterward, the cellulose fabrics were placed into stainless steel autoclaves and immersed in the precursor solutions.Subsequently, the autoclaves were sealed and maintained at 90 C for 9 h.After synthesis, the autoclaves were cooled to room temperature naturally and the resulting TiO2/CFs were rinsed repeatedly with deionized water to remove the unattached TiO2 particles and finally dried in air.The as-prepared products were designated as samples 1, 2, 3 and 4 for the volume ratios of H2O to HCl of 37:3, 36:4, 35:5 and 30:10, respectively.In order to research the effects of hydrochloric acid concentration on titanium dioxide growth and the supporting fabrics, we continued to increase the concentration of hydrochloric acid for the volume ratios of H2O to HCl of 25:15, 20:20, and 15:20 (denoted as samples 5, 6, and 7, respectively, refer to Table 1), and kept other experimental conditions unchanged. For comparative studies, blank cellulose fabrics (designated as sample 0) were rinsed in the same conditions, but without being subjected to the hydrothermal process. Field emission scanning electron microscopy (FESEM, Hitachi S4800) equipped with X-ray energy dispersive spectroscopy (EDS) was used to characterize the microstructures of the film and TiO2 particles.X-ray diffraction (XRD) patterns of the films were recorded at room temperature using a Bruker X' Pert PRO X-ray diffractometer with Cu K radiation and 2 scan rate of 4 min -1 .Diffraction patterns were taken over the 2 range of 10 -80.Transmission Electron Microscope (TEM) images were obtained by a JEM 2100F transmission electron microscope with an acceleration voltage of 200 kV. Photoreduction of CO2 was carried out in a homemade vitric reactor (20 cm 20 cm 15 cm, respectively) with the as-prepared TiO2/CFs placed at the center of the reactor.Four UVA lamps (8 watt for each lamp) with a main wavelength of 365 nm (average intensity: 1 mWcm -2 , measured by UVX radiometer, UVP) were placed on two opposite sides of the sample.Before the tests, ultra-pure gaseous CO2 (99.995) was introduced into the reactor at 300 mLmin -1 for 1 h to purge the reactor, and this step was performed in the dark.The CO2 flow was then stopped and the UV lamps were turned on.A homemade evaporation device was used to supply water vapor during the whole 6 h reaction time.Ultra-pure gaseous CO2 (99.995) was flowed into the container at 30 mLmin -1 to degas the air from the reactor and the concentration of effluent gas as a function of irradiation time was recorded by gas chromatography (GC/FID, Thermo-Fisher, Trace GC) once an hour during the whole reaction time."
  },
  {
    "title": "Results_and_Discussion",
    "content": "To determine which crystalline phases of TiO2 were present in the elaborated TiO2/CFs membranes, the corresponding XRD patterns were obtained, as shown in which will be further supported by the TEM results (Figure 3). The microstructures of the TiO2/CFs were studied by FESEM and HRTEM.The FESEM images show that the surface of the original cellulose fabric substrate (sample 0) is relatively smooth (Figures 2a ande).For sample 1, as shown in Figures 2b andf, the TiO2 nanocrystals were attracted by the OH bonds of the cellulose fabrics and started to agglomerate on the cellulose fabrics, forming a thin film layer.The HRTEM of the TiO2 nanoparticles of sample 1 exhibited lattice fringes of that were assigned to anatase (0.239 nm and 0.353 nm) and brookite (0.293 nm) (Figure 3a) 46,50.The content of rutile phase is very limited (4.4, as shown in Table 1) so that is absent in the same field of vision.The average TiO2 grain size of sample 1 statistically calculated by the HRTEM image of Figure 3a is 4 nm.Obviously, the enlarged versions of the selected areas in Figures 2f, g andh show a relatively rougher surface than that of Figure 2e, which also corresponds to the presence of the TiO2 thin layer. Additionally, the TiO2 thin layer of sample 1 is much denser than those of samples 2 and 3. In sample 2 (Figures 2c andg), there are many uneven and shapeless micron grade particles on the surface of the cellulose fabrics, which is due to the aggregation of nano TiO2 particles to lower their surface energy.The aggregation of primary anatase nanocrystals finally sustained the rutile formation.Barbe et al. showed that by preventing the aggregation of anatase particles during the hydrothermal step, the formation of rutile was prevented 54. For sample 3, the micron spheres show a noncompact and waxberry-like structure (Figures 2d andh) which is self-assembled by the anatase TiO2 and the anisotropic growth of rutile TiO2 on the thin layer of TiO2 nanoparticles.The insert TEM image of sample 3 in Figure 3c presents a loose dandelion-like micron TiO2 sphere with diameter of about 190 nm; the corresponding HRTEM image of the circled area reveals its composition of numerous loose nanorods with an average diameter of 9 nm.The high HCl concentration and selective adsorption of Cl -on the rutile (110) plane promote the anisotropic growth into nanorods along the 001 orientation, parallel to the c-axis, as indicated by the rutile lattice fringes of 0.324 nm, which is evident in the sharp and narrow (001) peak at about 27.3 in the XRD pattern ( as shown in Figure 1) 9,55.The anatase TiO2 nanoparticles are also observed in Figure 3c, for which the lattice fringes were sized 0.353 nm and well-indexed to the (101) plane of anatase.From Figures 2a-h, it is evident that the cellulose fabrics are still intact, illustrating that the acidity of the preparation solution is compatible with the cellulose fabrics, and the TiO2 particles are tightly adsorbed on the surface of the fabrics.Further strong ultrasonic processing was adopted to quantify these observations.As shown in Table 2, after 10 minutes of strong ultrasonic processing (JP-020, 40 kHz, 120 W, Skymen Cleaning Equipment Co., Ltd.), the three samples of 1, 2 and 3 show different but slight TiO2 mass loss (8.5, 11.6 and 7.3, respectively).After 20 minutes of ultrasonic processing, the mass losses of TiO2 particles of the three samples are almost the same (17.4,17.5 and 17.3, respectively).However, when the ultrasonic processing lasts for 30 minutes, sample 2 shows the serious mass loss of 22.4, which may due to the exfoliation of the agglomerated TiO2 bulky grains (Figure 4b).Due to the long time of the strong ultrasonic wear, the surface of the fabrics became rough and a slightly rolled up (Figures 4a, b andc), but a remarkable amount of titania is still present on the cellulose fabrics.This was also proved by the EDS analysis, as shown in Figure 4d. The results showed that the TiO2/CFs (sample 2) before ultrasonic processing consists of three major elements including Ti, O, and C.After 30 minutes of strong ultrasonic processing, the Ti element peak is slightly abridged but still obvious.This means that most of the TiO2 particles of samples 1-3 were firmly anchored on the surface of the fabrics by the formation of chemical bonds, as mentioned above 23.This study demonstrated that the bonding between the TiO2 particles with the cellulose fabrics of samples 1-3 is strong enough to enable the photocatalytic membrane to be used for several cycles without a serious decrease in performance, and this will be further proved.When the growth of the TiO2 nanoparticles was promoted further with the reduction in the H2O : HCl ratio of the hydrothermal solutions, as for samples 4, 5 and 6, the TiO2 grew into more tightly packed and larger particles which were about 3 m in diameter as shown in Figures 5a-e.The particles are much larger than samples 1-3, and a problem that cannot be overlooked is that due to the effect of gravity on the particles themselves, some of the microspheres spill from the surface of the cellulose fabrics, and show different levels of spilling even after the hydrothermal reaction without the following ultrasonic processing.The amount of TiO2 decreased gradually not only because of the separation of the TiO2 particles but also because the high acidity dissolves the TiO2 nanocrystal nucleus, hence hindering the growth of TiO2 particles, until eventually almost no TiO2 existed in sample 7 (Figure 5f). Unfortunately, the fabrics of samples 6 and 7 (Figures 5e andf) were also etched by the very high HCl concentration. The photoreduction of CO2 was carried out to test the activity of the catalysts in the presence of H2O vapour under UV light irradiation.In order to simplify the discussion of this work, herein the photoreduction of CO2 will focus on three representative samples of 1, 2 and 3, as shown in Figure 6a.It is apparent that the outputs of CH4 and CO in 6 hours for sample 2 (194.0 ppm/g for CO and 50.8 ppm/g for CH4) and sample 3 (191.8ppm/g for CO and 50.1 ppm/g for CH4) are similar but much higher than those of sample 1 (91.1 ppm/g for CO and 25.0 ppm/g for CH4). The cumulative yields of CH4 and CO increase with the extension of time and ultimately the yields leveled off, which is coincident with other results 56.The small crystal size (4 nm) of sample 1 is beneficial to the transfer of photon-generated charge carriers to the surface of the catalyst, therefore reducing the recombination of the electron-hole pairs in the interior of the crystal.However, in reality, sample 1 possesses an almost pure anatase phase and the smallest crystal size but gave the lowest yields of CO and CH4 compared with sample 2 and sample 3.In this case, it is believed that the effects of crystal phase composition, crystallinity and morphology all play a significant role in determining the photoreduction activity.Much experimental evidence supports the existence of a synergistic effect between anatase and rutile mixed phases in enhancing the photocatalytic activity compared to either of the pure phases alone 46,57,58.The original hypothesis of the enhanced activity of a mixed phase relative to pure phases is that the transfer of electrons from anatase to a lower energy rutile electron trapping site in the mixed-phase TiO2 catalysts serves to reduce the recombination rate of anatase, leading to more efficient electron-hole separation and greater catalytic reactivity 59.However, a new study has demonstrated that electrons flow from rutile into anatase, with holes moving in the opposite direction, which is contrary to the original opinion 60.The dense TiO2 thin layer in sample 1 reduces the chance of directly contacting with carbon dioxide, while the noncompact and waxberry-like structure of TiO2 and the TiO2 thin layer are more accessible to the adsorbed CO2, consequently leading to the higher photocatalytic activity to some extent.The small, controlled changes in TiO2 phases and morphologies on the cellulose fabrics produced photocatalytic membranes with different photocatalytic activities, indicating the influence that these factors have on the photoreduction results. Production of carbon monoxide by the three samples was obviously higher than that of the methane yield, which suggests that the formation of CO is more favourable than that of CH4 61.In the 5 total recycle times, the average outputs of CO and CH4 for the reduction of CO2 are 186.4ppm/g and 48.4 ppm/g, respectively, as shown in Figure 6b.The mean production yield for the whole reaction process did not appear to undergo any obvious decrease.Thus, we can speculate that the as-prepared samples possess stable performance and can be recyclable during the photoreduction of CO2."
  },
  {
    "title": "Conclusions",
    "content": "Flexible photocatalytic membranes of adjustable, mixed TiO2 phases on TiO2/CFs were in situ elaborated using a hydrothermal method under low temperature (90 C).The phase composition of anatase, brookite and rutile was finely tuned by subtly manipulating the HCl concentration.When the proportions of H2O and HCl were 37:3, 36:4 and 35:5, the cellulose fabrics were all well preserved in the hydrothermal process and the TiO2 nanoparticles formed a homogeneous thin film which was firmly anchored on the fabric surface even after 30 minutes of strong ultrasonic processing.When the proportion of H2O to HCl was 36:4 (sample 2), the sample showed the most severe TiO2 mass loss of 22.4 after 30 minutes of strong ultrasonic processing.However, it also presented the highest yield for photoreduction of CO2 (194.0 ppm/g for CO and 50.8 ppm/g for CH4 in 6 hours under UV irradiation). The facile and economic method described herein is suitable for the in situ and phase controllable synthesis of nanocrystalline TiO2 on cellulose fabrics and provides a reference for the preparation of the flexible and novel functionalized fabric materials. Figure 1.The characteristic diffraction peaks at 2 25.2,37.7 and 48.0 which correspond to the (101), (004) and (200) plane indices of anatase TiO2 (JCPDS 21-1272), respectively, progressively weakened and finally disappeared in samples 4, 5 and 6 49.On the other hand, the plane indices of (110), (101), (111), (210), (211), (220), and (002) of rutile TiO2 (JCPDS 21-1276) with peak positions located at 2 27.3,35.9, 41.1 44.0, 54.2, 56.7 and 62.7, respectively, appeared successively and progressively sharpened.It is apparent that the samples 1, 2 and 3 were biphasicor triphasic TiO2, but with the increasing HCl content, the anatase phase content decreased while the rutile phase gradually increased and the crystallinity was enhanced.The characteristic diffraction peak at 2 30.8corresponds to the (121) index of brookite TiO250.However, in every case, brookite was always a minor fraction of the total phases.The concentration of hydrochloric acid in the reaction medium therefore has a significant effect on the resulting phases of the as-prepared TiO2.Thus the TiO2 phase composition in the TiO2/CFs membranes can be finely tuned by adjusting the HCl concentration in the hydrothermal solution.The overall trend of the TiO2 phases showed that the anatase fraction of the membranes decreased while rutile became the predominant phase and eventually only the rutile phase was obtained, as evident in samples 4 -6, due to the high acidity of the hydrothermal solutions favouring the growth of rutile.In addition, the high HCl concentration alignment of rutile and anatase TiO2, Nature Materials, 12 (2013) 798-801.61Q. Wang, P. Dong, Z. Huang, X. Zhang, Synthesis of Ag or Pt nanoparticle-deposited TiO2 nanorods for the highly efficient photoreduction of CO2 to CH4, Chemical Physics Letters, 639 (2015)11-16. Figure captions Figure 2. FESEM images and their enlarged FESEM images of sample 0 (a,e), sample 1(b,f), sample 2 (c,g), and sample 3 (d,h) without ultrasonic processing. Figure 3. HRTEM images of sample 1 (a), sample 2 (b) and (c) the corresponding HRTEM image of the circled area of the insert TEM image of sample 3 labeled with the lattice fringes of anatase (A), brookite (B) and rutile (R). Figure 4. FESEM images of sample 1 (a), sample 2 (b), and (c) sample 3 after 30 minutes of ultrasonic processing, and (d) EDS spectra of pure cellulose fabric, and TiO2/CFs before and after 30 minutes of ultrasonic processing. Reagent compositions of the hydrothermal solutions used in the preparation of the TiO2/CFs membranes and the crystal phase compositions of the prepared TiO2/CFs membranes. TiO2 particles mass loss of samples 1-3 after ultrasonic processing. This work was supported by the National Natural Science Foundation of China No. 50772098."
  }
]