[
  {
    "title": "Doi",
    "content": "10.1016/j.apsusc.2019.144059"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic reduction of CO2 into CO over nanostructure Bi2S3 quantum dots/g-C3N4 composites with Z-scheme mechanism"
  },
  {
    "title": "Abstract",
    "content": "Bi 2 S 3 quantum dots (QDs) /g-C 3 N 4 composites with various Bi 2 S 3 QDs contents were synthesized by hydrothermal reaction method and used in CO 2 photocatalytic reduction, which demonstrated much higher photocatalytic activity than pristine g-C 3 N 4 .Experimental results indicated that the 20 wt Bi 2 S 3 QDs/g-C 3 N 4 showed a remarkable photocatalytic activity, which was 4 times the CO yield of that pure g-C 3 N 4 .The SEM and TEM results indicated that Bi 2 S 3 QDs had uniformly covered the catalysts surface, which could effectively increase the absorption of visible-light and promote the separation of photogenerated carriers, thereby decrease the recombination rate of photogenerated electron-hole pairs and enhance the performance of photocatalytic reduction."
  },
  {
    "title": "Experimental",
    "content": "Urea (H 2 NCONH 3 ), acetone (CH 3 COCH 3 ), sodium thiosulfate pentahydrate (Na 2 S 2 O 3 5H 2 O) and bismuth nitrate pentahydrate (Bi (NO 3 ) 3 5H 2 O) were obtained from Sinopharm Chemical Reagent Corp, P. R. China.All reagents are of analytical grade and applied without any further purification. Suitable urea was heated in air at 520 C for 4 h to obtain pure g-C 3 N 4 .The Bi 2 S 3 QDs/g-C 3 N 4 composites with different Bi 2 S 3 QDs mass ratio (0, 10, 20 and 30 wt) were obtained by the following steps: 0.081 g (0.167 mmol) Bi(NO 3 ) 3 5H 2 O was dissolved in 35 mL acetone with intense stirring for 30 min, then a certain amount (0.429, 0.215 and 0.143 g, 4.66, 2.34 and 1.55 mmol) of g-C 3 N 4 and Na 2 S 2 O 3 5H 2 O (0.062 g, 0.25 mmol) were mixed in the prepared solution and vigorously stirred for 30 min to obtain a uniform solution.The obtained mixture solution was then hydrothermally treated in a 100 mL Teflonlined autoclave at 180 C for 24 h.The resulted product was washed with absolute ethanol and deionized water for several times, then dried at 80 C overnight.Pure Bi 2 S 3 QDs was synthesized by the identical method without the existence of g-C 3 N 4 . The crystal phase of the catalysts were determined by X-ray diffraction (XRD) measurement (Bruker D8 Advance powder diffractometer, CuK radiation, 0.154056 nm).The morphology of photocatalysts were observed by the scanning electron microscope (SEM, Phillips XL-30 FEG/NEW) and transmission electron microscope (TEM, Phillips Model CM200).X-ray photoelectron spectroscopy (XPS, ESCALAB 250xi, USA) with Al K radiation sources were used to validate the compositions of the chemical elements.The Brunauer-Emmett-Teller (BET) surface area and pore structure were estimated by N 2 adsorption-desorption at -196 C on a Quantachrome Autosorb-iQ-AG instrument.For the analysis of optical absorption properties, BaSO 4 was used as a reflection standard material, and a UV-vis diffuse reflection spectrum was recorded on a spectrophotometer (SHIMADZU UV-3600, Japan) in the range of 250-800 nm.Reduction of CO 2 was characterized by attenuated total internal reflectance Fourier transform infrared spectroscopy (ATR-FTIR, Nicolet iS50).Photoluminescence (PL) characteristics were analyzed by a 325 nm excitation wavelength fluorescence spectrophotometer (Hitachi F-4600). Photoelectrochemical measurements including electrochemical impedance spectroscopy (EIS) and transient photocurrent responses analysis were measured on an electrochemical system (CHI 660E, Shanghai Chenhua Instrument Co., Ltd.China).A typical three-electrode was immersed in a 0.5 mol/L Na 2 SO 4 electrolyte solution.Fluorine-doped tin oxide (FTO) conductive glass covered by the prepared sample was employed as the working electrode, while Pt and Ag/AgCl electrodes were employed as the counter and reference electrodes, respectively.The working electrode was obtained by the following steps: the prepared sample (10 mg) was dispersed into a mixed solution of ethanol (1 mL) and nafion (20 L, 5), then the mixture was ultrasonically dispersed for 2 h.After that, 0.1 mL slurry was dropped on the surface of FTO glass (1 1 cm).After evaporation of ethanol, the photocatalyst was uniformly attached to the FTO glass.EIS and photocurrent measurements were taken with a 300 W Xenon lamp. A typical photocatalytic CO 2 reduction experiment was conducted in a gas-enclosed circulation system with a 500 mL reactor purchased from Perfect Light Company (Beijing, China).A 300 W Xenon arc lamp was used as the light source during the operation.In a standard experimental procedure, 50 mg photocatalyst was mixed with 100 mL deionized water under appropriate magnetic stirring to achieve the uniform dispersion.Before light irradiation, the suspension was firstly subjected to a vacuum treatment, then pure CO 2 (99.999) was introduced into the reaction vessel under the control of a mass flow meter, and the pressure were maintained at 100 kPa for 30 min to achieve the balance of adsorption-desorption.The temperature was controlled at 25C during the entire experiment.During the reaction process, 0.15 mL of gas was collected from the glass chamber every hour, and the carbon-based evaporation product was specifically identified by a gas chromatography (GC-2010 Plus, SHIMADZU, Japan)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "XRD patterns of all synthesized photocatalysts are showed in Fig. 1.In terms of g-C 3 N 4 , the apparent diffraction peak at 27.3represents the (0 0 2) plane of g-C 3 N 4 (JCPDS 87-1526), and another diffraction peak at 12.7represents the (1 0 0) plane of g-C 3 N 4 , which could be owing to the in-plane structure filling motif of the tris-s-triazine units 41.The diffraction peaks in the spectrum of Bi 2 S 3 QDs are in consistent with the Powder Diffraction Standards data (JCPDS 17-0320).Compared with the pure g-C 3 N 4 and pure Bi 2 S 3 , the diffraction peaks in the spectra of Bi 2 S 3 QDs /g-C 3 N 4 composites become broader and weaker, which suggests the intensive interaction between Bi 2 S 3 QDs and g-C 3 N 4 . The SEM images of Bi 2 S 3 , g-C 3 N 4 and 20 wt Bi 2 S 3 QDs/g-C 3 N 4 are exhibited in Fig. 2. Pure g-C 3 N 4 shows a two-dimensional (2D) curled layered structure (Fig. 2a and Fig. 2b), while the pure Bi 2 S 3 QDs presents spherical structure with a distinctly minimal size (Fig. 2c and Moreover, the actual mass percent of Bi 2 S 3 QDs in the 20 wt Bi 2 S 3 QDs/g-C 3 N 4 composite is calculated to be 18.12 wt based on the mass percentage of C, N, Bi, S elements in Fig. 2g. The TEM images of Bi 2 S 3 QDs, g-C 3 N 4 and 20 wt Bi 2 S 3 QDs/g-C 3 N 4 samples are exhibited in Fig. 3.As shown in Fig. 3a and Fig. 3b, the microscopic morphology of pristine g-C 3 N 4 and Bi 2 S 3 QDs are characterized with a curled edge and a spherical structure, respectively, which is in keeping with the SEM images.Besides, the TEM image of 20 wt Bi 2 S 3 QDS/g-C 3 N 4 sample presents that Bi 2 S 3 QDs and g-C 3 N 4 are combined together and Bi 2 S 3 QDs disperse uniformly on the surface of g-C 3 N 4 (Fig. 3c).In addition, the 0.5 nm interplanar spacing corresponding to the (1 2 0) crystal plane of Bi 2 S 3 QDs could be noticed in the HRTEM image of 20 wt Bi 2 S 3 QDs/g-C 3 N 4 (Fig. 3d) 42. The chemical element composition of pure g-C 3 N 4 , pure Bi 2 S 3 QDs and 20 wt Bi 2 S 3 QDs/g-C 3 N 4 were studied in detail by XPS.As presented in Fig. 4a, the signals excited by the N 1s and C 1s are observed in g-C 3 N 4 , Bi 2 S 3 QDs and 20 wt Bi 2 S 3 QDs/g-C 3 N 4 , while the peaks of Bi 4f and S 2p are detected in Bi 2 S 3 QDs and 20 wt Bi 2 S 3 QDs/g-C 3 N 4 43,44.The C, N, O signals detected in the spectrum of pure Bi 2 S 3 QDs may be caused by the air in the environment.In addition, high resolution spectra of N 1s, C 1s, S 2p and Bi 4f were also available by XPS analysis.From C 1s XPS spectra (Fig. 4b), two main peaks of pure g-C 3 N 4 are observed at about 288.3 eV and 284.8 eV, which is in good accordance with C-C bond and NeCN group, respectively 45.In Fig. 4c, N 1s peaks of 20 wt Bi 2 S 3 QDs/g-C 3 N 4 could be resolved into three main peaks.The peak at 398.9 eV should be attributed to the sp 2 hybrid N on the triazine ring and the peak at 400.7 eV is attributed to the bridged N atom connecting the three triazine rings N-(C) 3 46,47, while the peak at 404.6 eV is derived from the positive charge localization or charging effect in the heterocycle 33.The high-resolution Bi 4f spectrum of Bi 2 S 3 QDs in Fig. 4d contains two main peaks at 159.1 eV and 164.5 eV, which indicates the existence of Bi 3 .In addition, The S 2p peak located at 161.7 eV in Fig. 4d also confirms the presence of sulfur species 484950.These results illustrate that the existence of Bi 2 S 3 QDs has not alter the basic chemical structure of g-C 3 N 4 after the formation of the 20 wt Bi 2 S 3 QDs/g-C 3 N 4 sample. For the purpose of analyzing the structural characteristics of the g-C 3 N 4 , Bi 2 S 3 QDs and 20 wt Bi 2 S 3 QDs/g-C 3 N 4 composite, nitrogen adsorption-desorption tests were carried out at -196 C.All samples show the type IV isotherms with a hysteresis loop (Fig. 5), confirming the existence of the mesoporous structure.Average pore diameter and specific surface area of synthetic photocatalysts are listed in Table 1.It can be observed that the specific surface areas of pristine g-C 3 N 4 and Bi 2 S 3 QDs are 52.7 m 2 /g and 29.6 m 2 /g respectively, while the 20 wt Bi 2 S 3 QDs/ g-C 3 N 4 composite has bigger specific surface area (73.8 m 2 / g), which means more active sites could be obtained on the 20 wt Bi 2 S 3 QDs/ g-C 3 N 4 composite to improve its photocatalytic activity. The optical characteristics of g-C 3 N 4 , Bi 2 S 3 QDs and Bi 2 S 3 QDs/g-C 3 N 4 composites are shown in Fig. 6, which could be calculated from the diffuse reflectance spectroscopy calculation according to the Kubelka-Munk function.It can be seen from Fig. 6a that the Bi 2 S 3 QDs/g-C 3 N 4 composites could absorb more light in the range of visible light than pure g-C 3 N 4 .As clearly presented in Fig. 6a, the adsorption verge of pure g-C 3 N 4 could be seen at about 450 nm.The 20 wt Bi 2 S 3 QDs/ g-C 3 N 4 possesses the best light absorption capability in the range of visible light, which could improve the utilization of the sunlight.Furthermore, absorbing more photoexcitons could produce more electronhole pairs, which will facilitate the photocatalytic reduction of CO 2 .The band gap energy of Bi 2 S 3 QDs and g-C 3 N 4 could be measured by the equation , where , h, , A and E g are absorption coefficient, Planck constant, light frequency, band gap energy, and a constant related to the sample and the corresponding band gap energy, respectively.Among them, n is dependent on the optical transition type of semiconductor (n 1 for direct transition and n 4 for indirect transition).For g-C 3 N 4 and Bi 2 S 3 QDs, the values of n are 4 and 1, respectively 5152535455.As shown in Fig. 6b, the calculated E g values for Bi 2 S 3 QDs and g-C 3 N 4 are about 1.88 eV and 2.71 eV, respectively. The ATR-FTIR spectrum was used to further confirm that whether the CO 2 in the photocatalytic reaction was reduced.As shown in Fig. 7, the curve changed significantly due to the asymmetric stretching peak of CO 2 at 2349 cm -1 after CO 2 and a certain amount of argon was passed into the reaction tank, then the peak observed at 2349 cm -1 was disappeared after the reaction cell was irradiated with an analog light source for 6 h.Therefore, ATR-FTIR spectroscopy proves that CO 2 was actually consumed in the photocatalytic reaction. Photocatalytic activity of CO 2 reduction under the irradiation of visible-light was investigated on all samples.After detailed measurement, the main product of the reduction reaction is CO accompanied by a certain amount of CH 4 .Control experiments show that there is no formation of corresponding hydrocarbon product without light source or photocatalysts, which indicates that the above factors are indispensable in CO 2 reduction experiment.Fig. 8a is a schematic representation of the total production of CO and CH 4 in 8 h.The doped samples have a significant activity increase regardless of CO or CH 4 .Meanwhile, the pristine Bi 2 S 3 QDs does not produce any CO or CH 4 , suggesting that pure Bi 2 S 3 QDs cannot reduce CO 2 to CO under illumination conditions.Fig. 8b depicts the CO evolution with time.Obviously, 20 wt Bi 2 S 3 QDs/g-C 3 N 4 exhibits unparalleled catalytic activity, which is 4 times the CO yield of pristine g-C 3 N 4 .Thus it may be speculated that the presence of Bi 2 S 3 QDs could reduce the recombination rate of electron-hole pairs.However, further increase the content of Bi 2 S 3 QDs in the composite would lead to an activity decrease, as observed over 30 wt Bi 2 S 3 QDs/g-C 3 N 4 (Fig. 8b) .The above phenomenon could be probably attributed to the decrease of surface area, and immoderate Bi 2 S 3 QDs might conduct as the recombination centers of photogenerated carriers during the process of CO 2 reduction.The photocatalytic stability of all Bi 2 S 3 QDs/g-C 3 N 4 composites are shown in Fig. 8c, the yield of CO keeps stable during three experimental runs, revealing that the performance of synthesized Bi 2 S 3 QDs/g-C 3 N 4 composites are stable during the reaction.To further confirm the authenticity of the above inferences, PL was used to detect the separation efficiency of photogenerated electron-hole pairs over each sample.As presented in Fig. 8d, the emission peak of Bi 2 S 3 QDs is almost invisible in the 450-500 nm range, which may be due to a trace of surface defects or surface oxygen vacancies of Bi 2 S 3 QDs.The peak intensity of g-C 3 N 4 is the highest, indicating that the electron-hole recombination rate in g-C 3 N 4 is very fast 56,57.Different from g-C 3 N 4 , the Bi 2 S 3 QDs/g-C 3 N 4 composites exhibit lower PL peak intensities, while 20 wt Bi 2 S 3 QDs/g-C 3 N 4 demonstrates the weakest peak intensity among them, which means that the recombination of electron-hole pairs over it is strongly depressed.Furthermore, the apparent quantum efficiency (AQE) of 20 wt Bi 2 S 3 QDs/g-C 3 N 4 at 420 nm wavelength is 2.31, which could be calculated via the following equation: , where the number of incident photons at specific wavelength could be determined by spectrometer. Electrochemical measurements were used to analyze the excitation and transfer processes of photogenerated charges in g-C 3 N 4 , Bi 2 S 3 QDs and 20 wt Bi 2 S 3 QDs/g-C 3 N 4 .Fig. 9a shows the photocurrent excitation pattern of photocatalysts under the illumination of the simulated solar light.Transient photocurrent measurements show that rapid electron transfer occurs on the surface of photocatalyst.In the lighting and shading tests, it could be observed from the spectrum that all photocatalysts demonstrate a fast and intense photocurrent response.When the light source directly illuminates the sample, the graph shows a rapidly increasing current, and when the light is off, it exhibits a sharp fall of current signal.This transient response might be attributed to the rapid excitation behavior of photons hitting the surface of the sample.In addition, the photocurrent intensity of 20 wt Bi 2 S 3 QDs/g-C 3 N 4 is higher than that of pure Bi 2 S 3 QDs and g-C 3 N 4 , which indicates that 20 wt Bi 2 S 3 QDs/g-C 3 N 4 has better charge separation efficiency, hence possessing better photocatalytic performance.To further confirm this inference, impedance experiment of the corresponding samples was also performed.The semicircular Nynquist plot in Fig. 9b shows that the 20 wt Bi 2 S 3 QDs/g-C 3 N 4 exhibits a smaller semicircle diameter than pure Bi 2 S 3 QDs and pure g-C 3 N 4 .The semicircle diameter of Nynquist plot is corresponding to the overall charge transfer resistance at the contact interface between the electrode and the electrolyte solution.Generally, a smaller semicircle diameter means a lower charge transfer resistance.Therefore, the electron transfer rate in 20 wt Bi 2 S 3 QDs/g-C 3 N 4 is faster 58, which is in accordance with the consequents of their photocatalytic activities described above.Mott-Schottky was used to explore the actual conduction band (CB) and valence band (VB) positions of pure Bi 2 S 3 QDs and g-C 3 N 4 (Fig. 9c and Fig. 9d).The flatband potentials of pure Bi 2 S 3 QDs and g-C 3 N 4 could be confirmed by extrapolating to C -2 0 at 500 Hz and 1000 Hz.The C -2 in vertical coordinates is an electrochemical potentials function, where the capacitance C could be gained from the impedance test.The flat potentials Based on the characterization results and the photocatalytic activities of all prepared samples, the possible reaction mechanism of Bi 2 S 3 QDs/g-C 3 N 4 composites was deduced.As presented in Fig. 10, the band gap of pure g-C 3 N 4 is relatively large, so the photogenerated electrons and holes are easy to recombine, resulting in the inefficient separation of electron-hole pairs.The charge transfer in the interface can follow a double-transfer mode or a Z-scheme transfer mechanism.Doubletransfer mode means that the CO 2 reduction reaction would happen on the CB of Bi 2 S 3 QDs, and the H 2 O oxidation reaction would occur on the VB of g-C 3 N 4 .In fact, the CB of Bi 2 S 3 QDs is lower than the reduction potential level of CO 2 /CO (-0.52 V vs NHE), thus the reduction of CO 2 would not proceed and CO would not be generated, which means that double-transfer mechanism is not suitable here to explain.Z-scheme transfer mechanism is different from the above one, and the specific reaction steps are as follows: Eqs. ( 1) and ( 2) demonstrate that an oxidation reaction occurs on the VB of Bi 2 S 3 QDs due to the excitation of electrons, revealing that H 2 O is decomposed into H and O 2 .Then the reduction reaction happens on the CB of g-C 3 N 4 owing to the migration and accumulation of electrons, which is embodied in the combination of H and CO 2 to produce CO (Eq.( 3)).The formation mechanism of CH 4 is similar to that of CO (Eqs.( 4)-( 6)), and the related charge balance data is given in Table 2.In addition, the quantum size effect caused by quantum dots could effectively enhance the internal electronic transition 24, which inhibits the recombination of the electron-hole pairs on Bi 2 S 3 QDs and g-C 3 N 4 , thus improving the photocatalytic activities of Bi 2 S 3 QDs/g-C 3 N 4 composites."
  },
  {
    "title": "Conclusions",
    "content": "To summarize, the Bi 2 S 3 QDs/g-C 3 N 4 composites were successfully synthesized and the experimental results stated that the Bi 2 S 3 QDs/g-C 3 N 4 composites could effectively reduce CO 2 to CO with a maximum The production rate of reduction and oxidation products for g-C 3 N 4 and 20 wt Bi 2 S 3 QDs/g-C 3 N 4 . Fig. 1.XRD patterns of g-C 3 N 4 , Bi 2 S 3 QDs and Bi 2 S 3 QDs /g-C 3 N 4 photocatalysts. Fig.2d).However, the 0D structure could be barely observed in the SEM images of 20 wt Bi 2 S 3 QDs/g-C 3 N 4 sample (Fig.2eand Fig.2f), which means that Bi 2 S 3 QDs had been dispersed into g-C 3 N 4 uniformly.In addition, the elemental distributions and Energy Dispersive Fig. 2. SEM image of g-C 3 N 4 (a and b), Bi 2 S 3 QDs (c and d), 20 wt Bi 2 S 3 QDs/g-C 3 N 4 sample (e and f), elemental mapping and EDS spectrum of 20 wt Bi 2 S 3 QDs/g-C 3 N 4 composite (g). Fig. 3. TEM image of (a) g-C 3 N 4 , (b) Bi 2 S 3 QDs and (c) 20 wt Bi 2 S 3 QDs/g-C 3 N 4 ; (d) HRTEM of 20 wt Bi 2 S 3 QDs/g-C 3 N 4 . Fig. 4. XPS survey spectra of g-C 3 N 4 , Bi 2 S 3 QDs and 20 wt Bi 2 S 3 QDs/g-C 3 N 4 (a); high-resolution C 1s (b) and N 1s (c) spectra of g-C 3 N 4 and 20 wt Bi 2 S 3 QDs/g-C 3 N 4 composite; high-resolution Bi 4f and S 2p spectra (d) of Bi 2 S 3 QDs and 20 wt Bi 2 S 3 QDs/g-C 3 N 4 . Fig. 5. N 2 adsorption-desorption isotherms of g-C 3 N 4 , Bi 2 S 3 QDs and 20 wt Bi 2 S 3 QDs/g-C 3 N 4 composite. Fig. 6.(a) UV-Vis DRS for g-C 3 N 4 , Bi 2 S 3 QDs and Bi 2 S 3 QDs/g-C 3 N 4 composites.(b) The plots of (h) 1/2 and (h) 2 versus energy (h) for the band gap energies of g-C 3 N 4 , Bi 2 S 3 QDs and Bi 2 S 3 QDs/g-C 3 N 4 composites. Fig. 7.The ATR-FTIR spectra of 20 wt Bi 2 S 3 QDs/g-C 3 N 4 with different reaction factors. Fig. 8. (a) CO and CH 4 yield spectra for g-C 3 N 4 , Bi 2 S 3 QDs and Bi 2 S 3 QDs/g-C 3 N 4 composites; (b) CO evaluation amount in the unit time; (c) Cycle characteristic diagram for g-C 3 N 4 and Bi 2 S 3 QDs/g-C 3 N 4 composites; (d) PL spectra of g-C 3 N 4 , Bi 2 S 3 QDs and Bi 2 S 3 QDs/g-C 3 N 4 composites. Fig. 10.Band positions and band gap energy of Bi 2 S 3 QDs and g-C 3 N 4 at pH 7 and schematics of CO 2 photoreduction process on Bi 2 S 3 QDs/g-C 3 N 4 composites. Fig. 9. (a) Transient photocurrent density and (b) electrochemical impedance spectra of Bi 2 S 3 QDs, g-C 3 N 4 and 20 wt Bi 2 S 3 QDs/g-C 3 N 4 composite; Mott-Schottky plots collected for Bi 2 S 3 QDs (c) and g-C 3 N 4 (d). Textural properties of the g-C 3 N 4 , Bi 2 S 3 QDs and Bi 2 S 3 QDs/g-C 3 N 4 composites. R.-t.Guo, et al.Applied Surface Science 500 (2020) 144059 This work was financially supported by the National Key RD Program of China (2018YFB0605002) and the National Natural Science Foundation of China (21546014, 50616114)."
  }
]