[
  {
    "title": "Doi",
    "content": "10.1039/C5GC02308D."
  },
  {
    "title": "Article_Title",
    "content": "Green Chemistry"
  },
  {
    "title": "Abstract",
    "content": "Monolayer SnNb2O6 two-dimensional (2D) nanosheets with high crystallinity are prepared by one-pot and eco-friendly hydrothermal method without any organic additive.For the first time, these SnNb2O6 nanosheets are applied into the photocatalytic reduction of CO2 with H2O to CH4 in the absence of co-catalysts and sacrificial agents under visible light irradiation.The structure features, morphology, photoabsorption performance, and photoelectric response have been investigated in detail.Results show the as-prepared SnNb2O6 samples with typical 2D nanosheet in the thickness of about 1 nm.Owing to the unique features of the nanosheets, the surface area, photoelectrical property and the surface basicity of SnNb2O6 are greatly improved compared with the counterpart prepared by traditional solid state reaction.Furthermore, the adsorption capacity of CO2 on SnNb2O6 nanosheets is much higher than that of layered SnNb2O6.Thus, the photocatalytic activity of SnNb2O6 nanosheets for the reduction of CO2 is about 45 and 4 times higher than those of the references (layered SnNb2O6 and common N-doped TiO2), respectively.To understand the interaction between the CO2 molecule and the surface of photocatalyst, and the reactive species in the reduction process, the intermediates have also been detected by in situ FTIR with and without visible light irradiation.Finally, a possible mechanism for the photocatalytic reduction of CO2 with H2O to CH4 on SnNb2O6 nanosheet is proposed.We believe this work will provide new opportunities for enlarging the family of visible-light driven photocatalysts for the reduction of CO2."
  },
  {
    "title": "Experimental",
    "content": "The SnNb 2 O 6 (SN) was prepared by a facile hydrothermal (HT) reaction following a simple procedure we reported previously. 37Briefly, the mixture of the self-prepared The X-ray diffraction (XRD) measurements were performed on a Bruker D8 Advance X-ray diffractometer using Cu K 1 radiation ( 1.5406A).Thermogravimetric (TG) analysis was performed on TG209 (NETZSCH Co.).Transmission electron microscopy (TEM) images were recorded using a JEOL model JEM 2010 EX microscope at an accelerating voltage of 200 kV.A tapping-mode atomic force microscopy (AFM, Nanoscope Multimode IIIa, Veeco Instruments) with Si-tip cantilever was used to evaluate the morphology and the thickness of the obtained samples on the mica substrate.The Brunauer-Emmett-Teller (BET) surface area and the CO 2 adsorption were measured with an ASAP2020M apparatus (Micromeritics Instrument Corp., USA).The nitrogen adsorption and desorption isotherms were measured at 77 K, and CO 2 adsorption isotherms were measured at 273 K. UV-vis diffuse reflection spectra (UV-vis DRS) of the samples were recorded on a Varian Cary-500 spectrophotometer.CO 2 temperature-programmed desorption (CO 2 TPD) were carried out using a Micromeritics AutoChem II 2920 instrument.In-situ CO-adsorbed fourier transform infrared (FTIR) spectra were performed in a home-made IR cell in conjunction with a vacuum system on a Nicolet 670 FTIR spectrometer at a resolution of 4 cm -1 and 32 scans. The fluorine-doped tin oxide (FTO) glasses, as working electrode, were cleaned by sonication in cleanout fluid, acetone and ethanol for 10 min, respectively.5 mg photocatalyt powder was dispersed into 0.5 ml dimethylformamide under sonication for 6 h to get slurry.The as-prepared slurry spread onto the conductive surface of FTO glass to form a photocatalyst film with the area of 0.25 cm 2 . Subsequently, uncoated parts of the FTO glass were isolated with epoxy resin.Photocurrent was measured by the conventional threeelectrode electrochemical cell with a working electrode, a platinum foil counter electrode and a saturated Ag/AgCl electrode as reference electrode.The working electrode was immersed in a sodium sulfate electrolyte solution (0.2 M) and irradiated by a 300 W Xe lamp ( 420-780 nm).The light/dark short circuit photocurrent response was recorded with a BAS Epsilon workstation.For current polarity, the cathodic current was set as positive current. The photocatalytic reduction of CO 2 was performed in a 40 mL Schlenk flask at ambient temperature and atmospheric pressure.The reactor was sealed with a silicone rubber Please do not adjust margins Please do not adjust margins septum.The light source was a 300 W Xe lamp with a cut-off filter to occlude light below 420 nm.The photocatalytic reaction was performed in a gas-solid heterogeneous reaction mode.In a typical photocatalytic experiment, 20 mg solid photocatalyst was placed in the reactor.This system was subjected to vacuum degassing and then backfilling with pure CO 2 gas.This process was repeated three times, and after the last cycle, the flask was backfilled with CO 2 (1 bar).6 L of liquid water was introduced into the flack with a syringe via the septum.Then liquid water was turned in gaseous water, in order to ensure that the catalyst was surrounded by H 2 O vapor and CO 2 .The temperature of the reactor was kept at 298 K.The photocatalytic reaction was typically carried out for 4 h.0.5 mL of gas was taken from the reactor to analyze the gas concentration of the product using a gas chromatography (GC-7890A, Agilent) equipped with a flame ionized detector (FID).Product gases were calibrated with the standard gas mixtures and their identity determined using the retention time."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The crystallinity and crystal phase for the as-prepared products were confirmed by XRD measurements, as shown in Fig. 1.It is clear that the diffraction peaks can be exactly indexed to the standard SnNb 2 O 6 phase (JCPDS: 84-1810; Monoclinic phase; Space group: C2/c).No impurity peaks from other phases can be detected over the SN-48-2 and SN-48-4 samples.However, some unreacted SnO 2 were found on the SN-12-2, SN-24-2 and SN-48-6 samples.Notably, as the reaction time is prolonged, the sample's crystallinity increases.Furthermore, the crystallinities of the samples are also sensitive to the pH value of the reaction system.With increasing the pH values, the crystallinity of the sample is decreased.That is, the optimal conditions of SnNb 2 O 6 are prepared at 473 K for 48 h under pH 2. The average crystallite size is estimated based on the peak at 2 24.8o using the Scherrer equation.As shown in Table 1, the calculated crystal sizes of the samples prepared by hydrothermal reaction are about 10 nm, while the crystal size of the sample prepared by traditional solid state reaction is over 80 nm.As the instability of Sn 2 , the pure SnNb 2 O 6 is difficult to be prepared.To further confirm the compositions of the asprepared samples, thermogravimetric analyses were carried out in air and high-pure He atmospheres to judge whether Sn 2 in SnNb 2 O 6 was oxidized to Sn 4 in the preparation process. When pure SnNb 2 O 6 was oxidized by oxygen into SnO 2 and Nb 2 O 5 , the weight of the product would increase 5 according to the equation: Sn As shown in Fig. 2, when the SN-48-2 sample was calcined under high-pure He atmosphere, the weight of SN-48-2 was decreased gradually with increasing the temperature.This could be ascribed to the loss of adsorbed H 2 O.However, when the SN-48-2 sample was calcined under air atmosphere, its weight was gained and then reduced.This is due to the fact that the oxidation of Sn 2 to Sn 4 .The difference of the loss weight of the samples annealed under air and He is about 5, which well matches with the theoretical value.That is, SN-48-2 sample would be a pure SnNb 2 O 6 sample.Please do not adjust margins Please do not adjust margins The morphologies and microstructures of the samples were investigated by TEM and AFM.As shown in Fig. 3a andb, both SN-48-2 and SN-48-4 are composed of numberous irregular nanosheets (NSs).The lateral scales of the nanosheets range from several hundred nanometers to several micrometers.It should be pointed out that the SN-48-2 NSs exhibit nearly transparent feature, indicating the ultrathin thickness (Fig. 3a).In contrast, SN-48-4 NSs are thicker than SN-48-2 (Fig. 3e and Fig. S1).This may be ascribed to the low pH value of reaction system facilitating the dissolutionrecrystallization of SnNb 2 O 6 in the preparation process. 36As a result, the thickness of the nanosheets would definitely reduce.Due to the features of 2D nanosheet, the BET surface areas of the SnNb 2 O 6 nanosheets are estimated over 45 m 2 g -1 , which is about 35 times larger than that of layered SnNb 2 O 6 (1.3 m 2 g -1 ), as shown in Table 1.The large surface area could provide more reactive sites and adsorb more reactants.Fig. 3c shows the typical high-resolution TEM image of SN-48-2.Clear lattice fringes can be observed.The interplanar spacing is consistent with the d-spacing of the corresponding lattice plane.The fringes of d 0.28 nm and d 0.37 nm match well with that of the (002) and (310) crystallographic plane of monoclinic SnNb 2 O 6 , respectively.A typical selected area electron diffraction (SAED) pattern of the SN-48-2 NSs reveals that the sample has single-crystalline character and high crystallinity (Fig. 3d).The superb crystal quality excludes the possibility of any grain boundaries and/or other interfaces (which usually act as recombination sites in polycrystalline materials).This should favor improved separation of the photogenerated electron and hole and decrease the electronhole recombination rate.The thickness of the SN-48-2 NSs is further confirmed by AFM analysis that reveals a thickness of approximately 1 nm (Fig. 3e).This thickness is in agreement with the theoretical value of monolayer SnNb 2 O 6 (0.8 nm). 36, 37Please do not adjust margins Please do not adjust margins The photocatalytic activities of the as-prepared samples have been evaluated by the reduction of CO 2 in the gaseous phase at 298 K under visible light irradiation.Since the minimum conduction band potential of SnNb 2 O 6 (-1.0 V vs NHE) 37 is more negative than the reduction potential of CO 2 /CH 4 (-0.24V vs NHE), 14 and the maximum valence band of Moreover, the SN-48-2 sample exhibits a high stability of the photocatalytic activity.There is no obvious decrease in activity during the recycling experiments (Fig. S2).To further find out the main factors accounting for different photocatalytic activities, we normalized the CH 4 production rates with the surface areas to rule out the effect of surface areas on their photocatalytic activities (Table 1).After comparing the reduction rates of CO 2 before and after normalizing with the surface areas, we find that the order of the normalized rates of the SnNb 2 O 6 nanosheet samples is similar with that of the original ones.The high crystallinity and purity of SnNb 2 O 6 should be another important factor to improve photocatalytic efficiency.Considering that CO, H 2 , and O 2 may be formed during the photocatalytic reduction of CO 2 , we measured the amount of these products through a gas chromatography equipped with thermal conductivity detector (TCD).As shown in Table S1, these products are found on all the samples.Only few CO 2 was reduced into CO.Among the as-prepared samples, pure SnNb 2 O 6 nanosheets facilitate the formation of CH 4 and the formation of H 2 has been suppressed.This may be due to the unique features and the open structure of 2D nanosheet.However, the existence of SnO 2 may enhance the formation rate of H 2 .This may be because some of photogenerated electrons transfer from SnNb 2 O 6 to SnO Please do not adjust margins Please do not adjust margins as-prepared samples, although the molar ratio of 2O 2 /(CO 4CH 4 H 2 ) is lower than the stoichiometric ratio (1: 1).This may be attributed to the formation of other oxidation products over the surface of the samples.We will deeply investigate them in our further work.Furthermore, a set of control experiments were carried out to confirm the photocatalytic process in the photoreduction of CO 2 .As shown in Fig. 5, the reduction of CO 2 could be negligible in the absence of either photocatalysts or visible light.Additionally, to rule out the possibilities of residual carbon for CH 4 yield during reaction process, the SN-48-2 nanosheets were illuminated with N 2 as the carrier gas without input of CO 2 .It can be clearly found that there is an inactivation in N 2 atmosphere, indicating that the generated CH 4 indeed originates from photoreduction of CO 2 .For reference, a SnNb 2 O 6 sample prepared by a solid state reaction (SN-SSR) and a common N-doped TiO 2 (N-TiO 2 ) photocatalyst were also tested for the photoreduction of CO 2 under the same conditions.Notably, the CH 4 evolution rates over SN-SSR and N-TiO 2 are only 9.408 and 28 L h -1 g -1 , respectively, which are much lower than that over SN-48-2.Considering that the surface area of SN-48-2 is higher than SN-SSR, the higher activity of SN-48-2 may be ascribed to the strong CO 2 gas adsorption ability and more reaction sites arising from high specific surface area offered by the nanosheets.In addition, ultrathin geometry of the nanosheet is also favorable for charge carriers for fast mobility from the interior onto the surface to participate in the photoreduction reaction. To verify CH 4 formation resulting from CO 2 reduction, isotope tracer analyses involving 13 CO 2 were conducted for SN-48-2 sample.Fig. S3 shows the mass chromatography spectra for visible light-irradiated SnNb As the photoabsorption property plays a crucial role in determining the photocatalytic activity, the UV-vis diffuse reflectance spectra of the samples were recorded (Fig. 6).Obviously, the samples have a strong absorption in the visible light region.The wavelength at the absorption edge, , is determined as the intercept on the wavelength axis for a tangent line drawn on the absorption spectra.The samples have a similar photoabsorption edge, which locates at about 477 nm.The optical band gaps of the samples estimated from the Kubelka-Munk function are approximately 2.6 eV.The photoabsorption in the wavelength range of 477-560 nm may be caused by the surface defects (Fig. S4).Notably, the SN-48-2 sample exhibits a less pronounced background level of the absorption at the same position among the as-prepared samples, indicating SN-48-2 with lower surface defect sites.Furthermore, in the UV region, the samples with the impurity of SnO 2 show two absorption peaks.One is contributed by the absorption of SnO 2 and the other is attributed to the absorption of SnNb 2 O 6 .However, the SN-48-2 and SN-48-4 samples just exhibit one absorption peak.The existence of the impurity may enhance the photoabsorption performance in the UV region.These results confirm that the difference in photocatalytic activities of the samples do not derive from the difference of photoabsorption performance. Photon energy (eV) Fig. 6 UV-vis DRS of the as-prepared samples We further utilized the transient photocurrent responses experiments at a bias potential of 0 V to investigate the electron generation and the charge carrier transport characteristics of the as-prepared samples (Fig. 7).Initially, steady currents are observed without illumination.Once the light was turned on, the current rapidly increases and immediately reaches the steady state.As the Xe lamp is switched off, the current returns to the initial value, showing good reversibility of the process.It is clear that the increased photoresponse current is considerably larger on SN-48-2 than on other samples, suggesting that many more electrons could be photogenerated by SN-48-2.According to Fig. 7, the steady Please do not adjust margins Please do not adjust margins photocurrent densities of SN-12-2, SN-24-2, SN-48-2, SN-48-4, and SN-48-6 are about 26.3, 35.2, 72.0, 50.1, and 10.7, respectively.The order of photocurrent density is consistent with that of the photocatalytic activity.Thus, we can also ascribe the enhancement of photocatalytic performance over SN-48-2 to the increased concentration of photogenerated electrons and a better electron transfer rate. It is considered that the mass transfer of CO 2 on the photocatalyst is a preceding step in its photoreduction and the surface adsorption state of CO 2 plays a key role in affecting the activation of CO 2 . 41Firstly, the CO 2 adsorption isotherms of the SN-SSR and the SnNb 2 O 6 nanaosheet samples were tested to study CO 2 adsorption ability, as shown in Table 1.Due to their high specific surface areas, it is expected that the CO 2 adsorption capacities of SnNb 2 O 6 nanosheet samples are much higher than that of SN-SSR sample.Such an increased CO 2 concentration on the nanosheets' surface is beneficial for enhancing the mass transfer efficiency of CO 2 and then increasing the photocatalytic activity.The maximum CO 2 uptake for SN-48-2 is about 13.5 cm 3 g -1 at the pressure of 1 bar, which is 45 times of that over SN-SSR.By normalizing with respect to surface area, we can see that the CO 2 adsorption capacities over the SnNb 2 O 6 samples are similar.The temperature-programmed desorption of CO 2 (CO 2 -TPD) was further carried out to investigate the interaction of CO 2 and the catalysts, and the curves are given in Fig. 8.In the TPD profile of CO 2 adsorbed on SN-48-2, the strong desorption peaks of CO 2 at temperatures between 50 and 600 o C are observed.The TPD signal peak of CO 2 at about 100 o C may be attributed to the interaction between CO 2 and the weak basic sites presented in SN-48-2. 42The desorption peaks occurring at about 400 o C were due to the presence of moderate basic sites. 43Moreover, the desorption peaks present at above 500 o C may be corresponded to strong basic sites. 42In contrast, the TPD result for SN-SSR sample shows only two weak desorption peaks at 400 and 500 o C, respectively.The concentration of alkaline sites could be estimated by the total area under the curve for all the desorption peaks.It is clear that the total basicity of SN-48-2 is much larger than SN-SSR.The higher concentration of basic sites and CO 2 absorption ability in the SN-48-2 sample may be related to its high surface area and ultrathin nanosheet structure.The result could also explain the enhanced photocatalytic activity of SN-48-2. For the gaseous phase CO 2 photoreaction, the interaction between the CO 2 molecule and the surface of photocatalyst is the important and initial step. 44 )) were considered as the primary intermediates on the surfaces during the CO 2 photoreduction process.Based on the above experimental results and analysis, a possible mechanism for the photocatalytic reduction of CO 2 to CH 4 over SnNb 2 O 6 nanosheets under visible light irradiation is proposed, and is illustrated in Fig. 10.Firstly, CO 2 and H 2 O molecules are strongly adsorbed onto the surface of SnNb 2 O 6 nanosheets due to the unique 2D nanosheet structure feature and the basicity of surface.The chemisorbed CO 2 molecule becomes destabilized to form \"Sn-CO 2 \" surface complex species and its reactivity is believed to be higher than that of the free CO 2 molecule.Under visible light irradiation, a bandto-band charge transfer on SnNb 2 O 6 nanosheets would take place and the charge carrier would separate and migrate rapidly from the interior to the surface to participate in the photoreduction reaction due to the ultrathin geometry of the nanosheet.The photoexcited electrons promote the reduction of adsorbed hydroxyl species to form atomic hydrogen on the surface of the nanosheet.At the same time, the photogenerated holes (h ) may be quenched by the oxidation of another adsorbed hydroxyl species.Notably, the adsorbed CO 2 molecules may also be activated by photogenerated electrons.Finally, the activated CO 2 species would transform into CH 4 through reacting with the formed atomic hydrogen on the surface of SnNb 2 O 6 nanosheets via a photogenerated electron-induced multistep reduction process involving electron and proton transfer, C-O bond breaking, and C-H bond formation.Because the formed CH 4 has a poor interaction with the photocatalyst, CH 4 could be desorbed fast without degrading."
  },
  {
    "title": "Conclusions",
    "content": "In summary, ultrathin SnNb 2 O 6 2D nanosheets have been successfully prepared by a simple hydrothermal method without any organic additives.These ultrathin SnNb 2 O 6 nanosheets are applied into photocatalytic reduction of CO 2 with H 2 O to CH 4 for the first time and show efficient activity under visible light irradiation.The photocatalytic activity of SnNb 2 O 6 nanosheets is significantly influenced by the crystallinity, the purity, the surface area, the photoelectric performance and the basicity of the surface.By optimizing these effects, the as-preapred SN-48-2 samples exhibits the highest CH 4 evolution rate (110.9L h -1 g -1 ).We believe that the present study will widen the application of the 2D nanosheet and stimulate intensive research in the utilization of the 2D nanosheet for the photocatalytic conversion of CO 2 to valuable hydrocarbons using solar energy. Fig.1XRD patterns of the as-prepared samples Fig. 2 TG analysis of the SN-48-2 sample under air and He atmospheres (heating rate of 5 C per minute) Fig. 3 TEM (a, b), HRTEM images (c), SAED pattern (d), and AFM image (e) of SN-48-2 (a, c-e) and SN-48-4 (b) Fig. 4 Photocatalytic activities of the as-prepared SnNb2O6 nanosheet samples 2 and SnO 2 benefits to the formation of H 2 compared with SnNb 2 O 6 .For O 2 , we find that the amount of O 2 increased with reaction time over the ARTICLE Journal Name 6 J. Name., 2012, 00, 1-3 This journal is The Royal Society of Chemistry 20xx Fig.5 Controlled experiments on the reduction of CO2 over SN-48-2 and the photocatalytic activities of the reference (layered SnNb2O6 and N-doped TiO2) Fig. 7 Short-circuit photocurrent response of SnNb2O6 prepared at different conditions in a 0.2 M Na2SO4 aqueous electrolyte under visible light irradiation Fig. 8 CO2-TPD for the SN-48-2 and SN-SSR samples Fig.9 In situ FTIR spectra of CO2 and H2O interaction with SN-48-2 in the darkness and subsequently irradiated by visible light Fig. 10 Schematic of photocatalytic reduction of CO2 on SnNb2O6 2D nanosheets 14 II ions with rich electron have been considered as a strong Lewis basic, which could serve as the sites to chemically adsorb CO 2 (Lewis acid) by an acid-basic interaction.And then, the inert CO 2 molecules would be activated.This is a very important step in the reduction of CO 2 .14Notably,metal ions in SnNb 2 O 6 are eco-friendly and earth abundant.Therefore, it seems that SnNb 2 O 6 would be a potential photocatalyst for efficient reduction of CO 2 .However, the study on the reduction of CO 2 over SnNb 2 O 6 has not been reported.It may be due to the fact that the high charge density of the inner sheets in layer and small interlamellar spacing result in difficulty associated with the intercalation of reactant molecules.So the layered SnNb 2 O 6 exhibited the poor activities due to the lack of active site on the external surface of the catalyst.In the previous work, we have prepared monolayer SnNb 2 O 6 nanosheet photocatalyst by hydrothermal reaction and microwave-assist hydrothermal reaction.36, 37 It 2 J. Name., 2012, 00, 1-3 This journal is The Royal Society of Chemistry 20xx Please do not adjust margins Please do not adjust margins exposed Average crystallite size, surface area, CO2 adsorption capability and CH4 production rate of the samples ABET surface area; b Adsorbed capacity of CO2 at a pressure of 1 bar; c CO2 adsorbed capacity normalized with surface area; d Production rate of CH4; e Production rate of CH4 normalized with surface area. a The work is financially supported by National Natural Science Foundation of China (Grants No. 21303019, 21177024, U1305242), the Natural Science Foundation of Fujian Province (Grants No. 2014J05016), China Postdoctoral Science Foundation (Grants No. 2015M571964) and Hong Kong Scholars Program (XJ2014050)."
  }
]