[
  {
    "title": "Doi",
    "content": "10.1039/c7ra07310k"
  },
  {
    "title": "Article_Title",
    "content": "CuO/Cu<sub>2</sub>O nanowire arrays grafted by reduced graphene oxide: synthesis, characterization, and application in photocatalytic reduction of CO<sub>2</sub>"
  },
  {
    "title": "Abstract",
    "content": "CuO/Cu 2 O nanowire arrays (NWAs) were prepared on a Cu foil substrate through a simple thermal process.The NWAs were then grafted with reduced graphene oxide (rGO) nanosheets via self-assembly.The combination of various characterization techniques including SEM, TEM, XRD, and XPS revealed the unique integration between CuO/Cu 2 O NWAs and umbrella-like rGO nanosheets.The CuO/Cu 2 O NWAsrGO sample was found to be more active than bare CuO/Cu 2 O NWAs for the photocatalytic reduction of CO 2 under simulated solar light.The improved photocatalytic activity was attributed to the slow recombination of charge carriers and the efficient transfer of photo-generated electrons through rGO nanosheets."
  },
  {
    "title": "Experimental",
    "content": "Hydrochloric acid (36.0-38.0),ethanol (99.7) and methanol (99.5) were purchased from Shanghai Chemical Corp.All chemicals involved here were of analytical grade and used without further purication.Copper foil (99.9, 1 mm thickness) were purchased from Shengjili Metals Sales Company.Partially reduced graphene oxide (rGO) was purchased from Hengqiu Technique Company. CuO/Cu 2 O NWAs were fabricated by a simple thermal oxidation method.Copper foil (2 A 2 cm 2 ) was carefully cleaned with a 6.0 M HCl solution in an ultrasound bath for 30 min to remove the CuO layer from the surface, then rinsed with deionized water and absolute ethanol for several times, and nally dried in air naturally.The bare Cu foil was calcinated at 600 C in air for 4 h with a speed of 10 C min A1 to obtain CuO/Cu 2 O NWAs. CuO/Cu 2 O NWAsrGO was fabricated via a two-step selfassembly procedure.In that procedure, 30 mg reduced graphene oxide (rGO) was added into 300 mL of methanol, and aer being ultrasonically treated for 3 h, rGO was exfoliated into thin sheets and disintegrated into a homogeneous suspension.CuO/Cu 2 O NWAs grown on the Cu foil were then put on a platform which was hung in the suspension and the suspension was stirred at room temperature for 24 h.Finally, the obtained sample was collected and dried in a vacuum oven at 60 C. X-ray diffraction (XRD) experiments were conducted on a Bruker D8 Advance X-ray diffractometer (Bruker Optics, Ettlingen, Germany) with Cu-Ka radiation, operated at 40 kV and 40 mA (scanning step: 0.02 s A1 ) in 2q 14 10-80 .Scanning electron microscopy (TEM) and transmission electron microscopy (TEM) experiments were conducted on a Tescan Vega3 scanning electron microscope (TESCAN Ltd., Czech) and a JEM-2010 transmission electron microscope (JEOL Ltd., Japan) at an acceleration voltage of 200 kV.X-ray photoelectron spectra (XPS) were recorded on an ESCALAB 250 XPS meter (Thermo Scien-tic) with monochromized Al Ka irradiation at 250 W. Raman spectra were obtained with a Dilor LabRam-1B microscopic Raman Spectrum.Electrochemical impedance spectroscopy (EIS) experiments were conducted on a VSP three-electrode electrochemical analysis system (Bio-logic Science Instruments, France) in 6 M KOH aqueous solutions and obtained at the frequency from 0.01 Hz to 100 kHz with amplitude of 5 mV.The products supported on copper foil (2 A 2 cm 2 ) were directly used as the working electrode without any binder or conductive additive.A Pt plate (2 A 2 cm 2 ) and an Ag/AgCl electrode were used as the counter electrode and reference electrode, respectively. The photocatalytic experiments for CO 2 and H 2 O reduction were carried out using CuO/Cu 2 O NWAs and CuO/Cu 2 O NWAsrGO as the photocatalysts in a gas-closed circulation system with the volume of 2700 mL.For each test, 4 A 4 cm 2 catalyst was placed onto the stainless-steel lm which was xed in the center of reactor.A Xe arc lamp (500 W) with sunlike radiation spectrum was put at the top of quartz window with the distance of 8 cm.The circulated cooling water was used to keep the photoreactor at ambient temperature during the reaction.Before the illumination, the reactor was vacuumed and purged with the CO 2 and H 2 O mixture at about 20 mL min A1 for 2 h to establish an adsorption-desorption equilibrium.During the irradiation, the gas phase products were taken at a given time interval (1 h) for subsequent quantitative analysis of product by using an on-line gas chromatograph."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Fig. 1a shows the XRD patterns of CuO/Cu 2 O NWAs, CuO/Cu 2 O NWAsrGO and rGO composites.Both CuO/Cu 2 O NWAs and CuO/Cu 2 O NWAsrGO present almost the same proles and all the peaks are in good agreement with the cubic Cu 2 O phase (JCPDS no.99-0041) and monoclinic CuO phase (JCPDS no.89-7896), indicating the existence of CuO and Cu 2 O. rGO exhibits a very broad peak at 2q 14 26 , corresponding to very few lamellae within the rGO nanosheets along with their corrugated structure. 5Compared to CuO/Cu 2 O NWAs, no conventional stacking peak of rGO is detected because of the strong peaks of CuO and Cu 2 O and low concentration and thus the relatively low peak intensity of rGO nanosheets. 23PS data were used to investigate chemical composition and the surface chemical states of CuO/Cu 2 O NWAsrGO.Fig. 1b reveals the chemical states of carbon.The C 1s spectrum could be tted into four peaks at 284.6, 285.4,286.6, 288.4 eV, associated with graphitic sp 2 carbon (CC/C-C), C-O of hydroxyl or epoxy groups, and OC-O, respectively. 24,25The much stronger peaks related to graphitic sp 2 carbon emerging from rGO skeleton suggests considerable content of graphitic carbon.The peak component at 286.6 eV was originated from the residual oxygen functionalities of rGO.The high energy peak component with low intensity at 288.4 eV was due to the environmental contamination to the sample.The O 1s spectrum in Fig. 1c consists of three oxygen contributions at 530.0, 531.4,and 533.4 eV, corresponding to oxygen bonded to Cu, carbonyl oxygen and oxygen atoms in hydroxyl groups, and oxygen atoms in carboxyl groups. 26Fig. 1d presents the Cu 2p XPS spectrum.Two Cu peaks at 932.2 and 952.0 eV, corresponding to the Cu 2p 3/2 and Cu 2p 1/2 peaks of Cu , respectively, conrm the existence of Cu 2 O. 27 The peaks at 933.5 and 953.5 eV with two extra shake-up satellites are assigned to the Cu 2p 3/2 and Cu 2p 1/2 peaks of Cu 2 , respectively. 28,29he samples were further characterized by Raman spectroscopy (Fig. 1e).Compared to the smooth spectrum of CuO/ Cu 2 O NWAs, two strikingly similar peaks of rGO and CuO/Cu 2 O NWAsrGO (centered at 1580 cm A1 which represents the G-line and 1350 cm A1 representing the D-line) indicate the presence of rGO in CuO/Cu 2 O NWAsrGO. The surface morphologies of CuO/Cu 2 O NWAs and CuO/ Cu 2 O NWAsrGO were characterized by SEM (Fig. 2).The Cu foil shown in Fig. 2a has a smooth surface with unidirectional nicks.Fig. 2b andc report SEM images of nanowires grown with high density, as obtained by the oxidation of a Cu foil for 4 h at 600 C. Aer heating the Cu foil in air for 4 h, the large-scale, dense, and directional CuO/Cu 2 O NWAs were directly grown in situ on the copper foil.The growth of the nanowires was preceded by a deformation of the substrate due to a straining force, with the formation of a hill and valley structure, in accordance with the literature. 30SEM analysis in cross-view reveals the absolutely straight nanowires, which allows us to determine that the average length of the nanowires is 25-35 mm (Fig. 2d).SEM images of CuO/Cu 2 O NWAsrGO at different magnications are shown in Fig. 2e-h.Plenty of ultrathin rGO nanosheets ock together and accumulate on the top of CuO/Cu 2 O NWAs like umbrellas (Fig. 2e).Furthermore, long and uniform CuO/Cu 2 O NWAs are coated with well-spread rGO nanosheets (Fig. 2f-h).Numerous tips of CuO/Cu 2 O NWAs stretch directionally and were closely wrapped by the rGO nanosheets, suggesting that the two materials are well combined through self-assembly procedure. The structure of the sample obtained by annealing the copper foil at 600 C in air for 4 h and CuO/Cu 2 O NWAsrGO were further studied by TEM.Typical TEM images of a single CuO/Cu 2 O NWAs as synthesized are shown in Fig. 3a-c.The products have wire-like shapes and the nanowires are solid and straight with smooth surfaces and uniform diameters of 115.8 nm (Fig. 3a andb).The interlayer fringe of the selected area is 0.23 nm, which agrees well with the (111) plane of CuO (Fig. 3c), 17,28 whereas there is no interlayer fringe associated with Cu 2 O. Thus, these nanowires are composed of CuO phase and the underlying lm is Cu 2 O. 31 As seen from Fig. 3d, wrinkled and little aggregated rGO nanosheets were observed.The thickness of the ultrathin rGO nanosheets is about 40 nm. Electrochemical impedance spectroscopy (EIS) was further used to investigate the photogenerated charge separation process.Fig. 4a shows the EIS Nyquist plots of CuO/Cu 2 O NWAs and CuO/Cu 2 O NWAsrGO.A smaller arc radius of the EIS Nyquist plot suggests an effective separation of photogenerated electron-hole pairs and fast interfacial charge transfer. 32,33vidently, the diameters of the arc radius of CuO/Cu 2 O NWAsrGO is smaller than that of CuO/Cu 2 O NWAs, further conrming that the ultrathin layer of rGO with good conductivity facilitates the electron migration to the reaction sites on the surface of the composite. 34uO/Cu 2 O NWAs and CuO/Cu 2 O NWAsrGO were tested for the photocatalytic reduction CO 2 with H 2 O under simulated solar irradiation.Fig. 4a shows the evolution of the main product (CO) as function of irradiation time.No CO is observed in the absence of photocatalyst, whereas CuO/Cu 2 O NWAs and CuO/Cu 2 O NWAsrGO exhibits photocatalytic activity.The yields of CO over these two samples increase with the irradiation time.Signicantly, CuO/Cu 2 O NWAsrGO demonstrates a higher photocatalytic performance compared to CuO/Cu 2 O NWAs, and these two materials reach a CO yield of 0.31 and 0.20 mmol cm A2 , respectively, aer 24 h of visible light irradiation. CuO nanomaterials absorb visible light of solar spectrum very efficiently and generate electron-hole pairs.However, the fast recombination of electron-hole pairs (which is crucial for the electron-dominated reduction reaction) owing to the narrow band gap makes them unavailable for photocatalytic reaction. 5herefore, CuO/Cu 2 O NWAs showed lower photocatalytic conversion.CuO/Cu 2 O NWAsrGO revealed improved photocatalytic activity, most likely ascribed to the improvement of the conductivity of CuO/Cu 2 O NWAsrGO by introducing rGO and the nearly equal position of conduction band of CuO (4.1 eV) and LUMO of graphene (4.4 eV). 35,36rGO platelets with high conductivity provide a direct pathway for efficient separation and transfer of photoexcited electrons, which means that the photo-generated electron in the conduction band of CuO/Cu 2 O NWAs can easily transfer to the rGO nanosheets, thus inhibiting the recombination of electron-hole pairs and facilitating the electron transport to the catalytic sites for the reduction of CO 2 to CO. Photo-generated holes can oxidize the water molecules to give protons (H ). 11Furthermore, the existence of mixture of Cu /Cu 2 oxidation states on the surface of catalysts according to XPS analysis.Cu may also can interact with holes and suppress the combination of photogenerated electrons and holes."
  },
  {
    "title": "Conclusions",
    "content": "In conclusion, the large-scale, dense, and directional CuO/Cu 2 O nanowires on Cu foil were graed by ultrathin rGO nanosheets.CuO/Cu 2 O NWAsrGO was used for the photocatalytic reduction of CO 2 to CO under visible light irradiation.XRD and XPS analysis conrm that tCuO/Cu 2 O NWAsrGO has a heterojunction structure of Cu /Cu 2 .Meanwhile, SEM and TEM results show that the ultrathin rGO nanosheets are like umbrellas coated on the CuO/Cu 2 O nanowires, which can enhance the conductivity of CuO/Cu 2 O NWAsrGO.CuO/Cu 2 O NWAsrGO exhibited enhanced photocatalytic performance compare to CuO/Cu 2 O NWAs in the reduction of CO 2 with H 2 O to CO under simulated solar irradiation. Fig. 1 (a) XRD patterns of CuO/Cu 2 O NWAs; XPS spectra of (b) C 1s, (c) O 1s and (d) Cu 2p of CuO/Cu 2 O NWAsrGO, (e) Raman spectra of rGO, CuO/Cu 2 O NWAsrGO and CuO/Cu 2 O NWAs. Fig. 2 SEM images of (a) Cu foil, and (b-d) CuO/Cu 2 O NWAs at different magnifications; (e-h) CuO/Cu 2 O NWAsrGO at different magnifications. Fig. 3 Low-and high-magnification TEM images of (a-c) CuO/Cu 2 O NWAs; (d) CuO/Cu 2 O NWAsrGO. Fig. 4 (a) EIS of CuO/Cu 2 O NWAs and CuO/Cu 2 O NWAsrGO electrodes; (b) CO yield by photocatalysis of CuO/Cu 2 O NWAs and CuO/Cu 2 O NWAsrGO. This journal is The Royal Society of Chemistry 2017 This work was nancially supported by China National Natural Science Foundation (51772051, 51528202 and 51671136), Natural Science Foundation of Guangdong Province (2016A030310127), and \"Shu Guang\" project (13SG46) supported by Shanghai Municipal Education Commission and Shanghai Education Development Foundation. There are no conicts to declare."
  }
]