[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2015.05.024"
  },
  {
    "title": "Article_Title",
    "content": "Visible-light-active oxygen-rich TiO2 decorated 2D graphene oxide with enhanced photocatalytic activity toward carbon dioxide reduction"
  },
  {
    "title": "Abstract",
    "content": "Herein, we present the successful synthesis of a new graphene oxide-doped-oxygen-rich TiO 2 (GO-OTiO 2 ) hybrid heterostructure through a facile wet chemical impregnation technique.The photocatalytic performances of all samples were evaluated through the photoreduction of CO 2 under the irradiation of low-power energy-saving daylight bulbs.Pure oxygen-rich TiO 2 (O 2 -TiO 2 ) was first prepared via a simple aqueous peroxo-titanate route.The as-prepared photocatalyst was shown to exhibit reduced band gap energy and visible-light-active characteristics.However, the photoactivity of bare O 2 -TiO 2 was found to gradually deteriorate over time.Hence, by exploiting its unique properties, graphene oxide (GO) was subsequently incorporated with the O 2 -TiO 2 photocatalyst.It was observed that the photostability of the resulting GO-OTiO 2 composite was significantly enhanced, where it maintained a reactivity of 95.8 even after 6 h of light irradiation.This observation firmly established the role of GO as an effective catalyst mat for O 2 -TiO 2 nanoparticles where it accepted photoinduced electrons and reduced the probability of charge recombination.In the CO 2 photoreduction experiments, 5GO-OTiO 2 with an optimum GO loading of 5 wt., exhibited the highest photoactivity, achieving a total CH 4 yield of 1.718 mol/g cat after 6 h of reaction.The total product yield obtained over 5GO-OTiO 2 was found to be 14.0 folds higher in comparison to commercial Degussa P25.In overall, we systematically demonstrated an unprecedented proof-of-concept study on enhancing the photoactivity of GO-OTiO 2 via a combined strategy of fabricating visible-light-responsive O 2 -TiO 2 and increasing its photostability by incorporating GO sheets."
  },
  {
    "title": "Experimental",
    "content": "Graphite powder (45 micron, 99.99), phosphorus pentoxide, P 2 O 5 (98.0),potassium persulfate, K 2 S 2 O 8 (99.0),potassium permanganate, KMnO 4 (99.0),titanium (IV) butoxide, TBOT (97.0), ethylene glycol, EG (99.0),acetic acid, HAc (99.7),Degussa P25 (21 nm particle size, 99.5) and anatase TiO 2 (25 nm particle size, 99.7) were supplied by Sigma-Aldrich.Hydrogen peroxide, H 2 O 2 (30.0) and concentrated sulfuric acid, H 2 SO 4 (95-97) were supplied by Chemolab.Hydrochloric acid, HCl (37 diluted to 10) was supplied by Merck.All chemicals were of analytical reagent grade and were used as received without further purification.Deionized water (DI-H 2 O) was used in all experiments. Using graphite powder as the starting material, graphite oxide was prepared using the modified Hummers' Method 373839.In detail, 3 g of graphite powder was added into a mixture consisting of 12 mL H 2 SO 4 , 2.5 g P 2 O 5 and 2.5 g K 2 S 2 O 8 , heated at 80 C. The mixture was kept under continuous magnetic stirring for 4.5 h at the same temperature, and was subsequently allowed to cool to ambient temperature.After diluting with 500 mL of DI-H 2 O, the mixture was filtered and washed repeatedly with DI-H 2 O until the pH of the filtrate became neutral.The product was then dried in an air oven overnight.Next, the pre-oxidized graphite was dispersed into 120 mL of H 2 SO 4 in an ice bath.15 g of KMnO 4 was slowly added under continuous magnetic stirring while maintaining the temperature below 20 C.After stirring for 2 h, the mixture was gradually diluted with 250 mL of DI-H 2 O in an ice bath to keep the temperature below 50 C.After an additional 2 h of stirring, the solution was further diluted with 700 mL of DI-H 2 O, followed by introducing 20 mL of H 2 O 2 .The mixture was filtered and washed with 1 L of HCl and 1 L of DI-H 2 O. Finally, the precipitate was dried in an air oven at 60 C for 24 h, producing graphite oxide. The fabrication of O 2 -TiO 2 have been reported in our previous work 18.In brief, TBOT was added into DI-H 2 O chilled to 0 C, resulting in an immediate precipitation of hydrolyzed titanium species.After filtration and washing with 1 L of DI-H 2 O, the precipitate was added into a mixture containing 100 mL DI-H 2 O and 80 mL H 2 O 2 , forming an orange colored peroxo-titanate complex.The solution was subsequently heated at 50 C for 3 h and dried in an air oven at 100 C overnight.The yellowish solid material was then calcined in air at 300 C for 2 h with a temperature ramping rate of 10 C/min.Control TiO 2 was prepared using a similar procedure without the addition of H 2 O 2 as oxygen precursor. The binary composite of GO-OTiO 2 was synthesized through a simple wet impregnation method.To attain GO sheets, a precalculated amount of graphite oxide was dispersed into 80 mL of DI-H 2 O and ultrasonicated for 1.5 h to exfoliate and separate the graphitic layers.Next, 0.5 g of O 2 -TiO 2 was introduced into the GO aqueous solution.After stirring for 1 h, the solution was heated to 80 C for 2 h, and then dried in an air oven overnight before characterization.The synthesis procedure is illustrated in Fig. 1.The GO content studied was 0, 1, 2, 5, 10, 15 and 20 wt. with respect to O 2 -TiO 2 .GO-control TiO 2 (GO-TiO 2 ) was also prepared using a similar approach. The structural features and elemental composition of all photocatalysts were investigated using a field emission scanning electron microscopy (FESEM) (Hitachi SU8010) equipped with an Oxford-Horiba Inca XMax50 energy dispersive X-ray (EDX).The specimen for FESEM analysis was prepared by depositing a drop of diluted suspension in ethanol on a silicon wafer.High resolution transmission electron microscopy (HRTEM) images were taken with a JEOL JEM-2100F microscope operating at 200 kV.Transmission electron microscopy (TEM) samples were prepared by depositing a drop of diluted suspension in ethanol on a lacey-film-coated copper grid.X-ray diffraction (XRD) patterns were attained on a Bruker D8 Discover X-ray diffractometer using Ni-filtered Cu-K radiation ( 0.154056 nm) at a scan rate of 0.02 s -1 .The accelerating voltage and applied current were 40 kV and 40 mA, respectively.The X-ray photoelectron spectroscopy (XPS) wide and narrow scan spectra were acquired using PHI Quantera II, equipped with an Al K X-ray source (1486.6 eV) at 10 mA, 15 kV, analyzing under 2.4 10 -6 Pa ultra-vacuum environment.The spectra were obtained using vision software which included vision manager and vision processing.All spectra were charge corrected by means of adventitious carbon signal (C 1s) at 284.8 eV.High resolution peaks were deconvoluted using Gaussian-Lorentzian functions with identical full width at half maximum (FWHM) after a Shirley background subtraction.Ultraviolet-visible (UV-vis) absorbance spectra were acquired using a UV-vis spectrophotometer (Agilent, Cary 100) equipped with an integrated sphere.The absorbance spectra were analyzed under ambient temperature in the wavelength ranging from 200-800 nm.The band gap energies of the photocatalysts were estimated from the Kubelka-Munk (KM) function, F(R) and the extrapolation of the Tauc plot F(R)hv 1/2 to the abscissa of photon energy, hv.Photoluminescence (PL) measurements were carried out at room temperature by a 325 nm He-Cd laser as the excitation light source using Renishaw inVia Raman Microscope.The emission spectra were recorded from 400-800 nm. The photocatalytic activities of the developed GO-OTiO 2 binary nanocomposites were studied in a CO 2 photoreduction system at ambient condition in a continuous gas flow reactor as reported in our previous work 5,18.The CO 2 photoreduction process was performed under visible light irradiation with a maximum light intensity of 15 W using energy-saving daylight bulbs (Philips, TOR-NADO 15W WW E27 220-240 V 1CT).The as-prepared samples were coated onto glass rods using double-sided tape and fixed into quartz tubes, which were then placed under the irradiation of visible light.The amount of photocatalyst used was held constant in all runs.After loading the photocatalyst-coated glass rods, highly pure CO 2 (99.99) was bubbled through water to produce a mixture of CO 2 and water vapor into the photoreactor at atmospheric pressure.Before switching on the light source, wet CO 2 was permitted to flow through the photoreactor at 30 mL/min for 30 min to eliminate any excess air and to ensure the complete adsorption of gas molecules.After purging the reactor with wet CO 2 , the visible light source was switched on and the CO 2 photoreduction process was conducted at 5 mL/min using a mass flow controller.The average intensity of the light source was measured to be 8.5 mW cm -2 by using a pyranometer (Kipp and Zonen type CMP 6).The distance between the light source and the photoreactor was measured to be about 5 cm.The product gas generated from the CO 2 photoreduction process was collected at 1-h intervals and was analysed by a GC (Agilent 7890A) equipped with a flame ionized detector (FID) and a thermal conductivity detector (TCD).The entire photoreaction system was enclosed within a black box to avoid any interference of light source from the surrounding.The total yield of CH 4 gas was calculated using Eq. ( 1). Total CH 4 yield total amount of CH 4 produced ( mol) amount of photocatalyst used (gcatalyst) (1)"
  },
  {
    "title": "Results_and_Discussion",
    "content": "The production of peroxo-titanate complex is essential for yielding O 2 -TiO 2 18.FTIR spectroscopy was used to confirm the successful formation of the intermediate complex (see Supplementary material).In comparison to the control TiO 2 intermediate, the titanium precursor modified with H 2 O 2 showed two additional peaks at 690 cm -1 and 905 cm -1 , which can be assigned to the characteristic Ti O O bond and O O stretching vibration of peroxo groups, respectively 40. The structural features and surface morphology of 5GO-OTiO 2 nanocomposites were elucidated by FESEM, TEM and HRTEM (Fig. 2A-C).From Fig. 2A,B, it can be observed that O 2 -TiO 2 nanoparticles were homogeneously dispersed on GO, where the latter could be easily distinguished by its translucent paper-like appearance.Fig. 2C shows the corresponding HRTEM image of the binary nanocomposite, in which the lattice fringes of multi-layered GO sheets were parallel to the edges of O 2 -TiO 2 .The lattice spacing of O 2 -TiO 2 was measured to be ca.0.35 nm, which correlated to the (1 0 1) plane of pure anatase TiO 2 (ATiO 2 ) (JCPDS 21-1272).In addition, EDX was used to analyze the elemental composition of 5GO-OTiO 2 , as shown in Fig. 2D.Ti, O and C were detected in the as-synthesized composite.The strong peak at 1.8 keV corresponded to Si, which stemmed from the silicon wafer substrate used in the analysis process.In overall, the C element originated from the GO sheets, while the presence of Ti were related to the O 2 -TiO 2 nanoparticles.The O element corroborated the oxygen-functional groups on GO as well as O 2 -TiO 2 .The successful crystallization of O 2 -TiO 2 nanoparticles could prevent the restacking and agglomeration of GO sheets into graphite oxide.Furthermore, the intimate contact between both components would enable the electrons to migrate easily from O 2 -TiO 2 into GO during the photoexcitation process, ultimately hindering the charge recombination process and enhancing the photocatalytic activity. Fig. 3 shows the XRD patterns of the as-developed GO-OTiO 2 binary composites with GO content ranging from 0 to 20 wt..The peaks located at 25.3, 37.8, 48.1, 53.9, 55.1, 62.7, 70.3 and 75.1 could be indexed to the (1 0 1), (0 0 4), (2 0 0), (1 0 5), (2 1 1), (2 0 4), (2 2 0) and (2 1 5) crystal planes of a pure tetragonal anatase phase TiO 2 41,42.The lattice parameters of anatase TiO 2 particles are reported to be a 3.7748 A and c 9.3736 A 18.Interestingly, the O 2 -TiO 2 nanoparticles in all GO-OTiO 2 samples displayed an increase in lattice parameters a and c, which were calculated to be 3.7921 A and 9.3792 A, respectively.The variation in lattice parameters can be explained on the basis of oxygen excess defects 43.Thermal decomposition of the peroxo-titanate intermediate resulted in an in situ generation of oxygen, which formed an interstitial oxygen.Isolated interstitial oxygen is unstable as it exhibits high formation energy.Hence, it is proposed that the interstitial oxygen interacted with an oxygen on the lattice site, which in turn produced a substitutional O 2 molecule, (O 2 ) O .Consequently, such formation caused a marginal outward movement of the neighboring Ti atoms, thereby increasing the lattice parameters of the O 2 -TiO 2 particle 18,44.Despite the low calcination temperature employed, the formation of rutile phase was also observed in all samples, showing peaks at 27.4 (1 1 0), 36.0 (1 0 1), 39.2 (2 0 0) and 69.0 (3 0 1) (JCPDS 72-1148) 45.By applying the Spurr Equation, all GO-OTiO 2 composites were calculated to have a rutile content of 17.5.A small broad peak was observed at 2A ranging from 10-12 in the GO-OTiO 2 samples, which corresponded to the 0 0 1 reflections of GO 27,46.A distinct peak of GO was not observed because the regular stacking of GO could have been destroyed by the intercalation of O 2 -TiO 2 29,47. The molecular structural changes relating to the formation of GO-OTiO 2 were investigated using FTIR spectroscopy.Fig. 4 shows the FTIR spectra of GO, O 2 -TiO 2 and 1, 2, 5, 10, 15 and 20GO-OTiO 2 nanocomposites.A strong and broad peak at ca. 3435 cm -1 was observed in all samples, indicating the existence of a surface O H stretching vibration.From the FTIR spectrum of GO, all characteristic peaks of GO including C O stretching at 1720 cm -1 , skeletal vibration of unoxidized graphitic domains at 1625 cm -1 , C O carboxy stretching at 1382 cm -1 , C O epoxy stretching at 1221 cm -1 and C O alkoxy stretching vibration at 1055 cm -1 were observed 48,49.This confirmed that graphite was sufficiently oxidized into hydrophilic GO via the modified Hummers' method.When O 2 -TiO 2 was incorporated onto the GO sheets, the aforementioned absorption bands as well as an additional peak at 1150 cm -1 relating to C O ether stretching 50 were observed.The broad band at ca. 450 cm -1 originated from the characteristic vibrations of inorganic Ti O Ti network 51.It should be noted that in comparison to GO, there were no prominent reduction in peak intensities for the oxygen-functional groups in the GO-OTiO 2 samples.This implied that no chemical reduction took place when preparing the binary composites, thus confirming the successful synthesis of GO OTiO 2 . Fig. 5A displays the XPS survey spectrum of the 5GO-OTiO 2 binary composite, demonstrating that the composite consisted of C, O and Ti.Fig. 5B shows the C 1s XPS spectrum of 5GO-OTiO 2 , where it can be fitted into three peaks at 284.8, 286.7 and 289.1 eV, respectively.The primary peak located at 284.8 eV could be assigned to adventitious carbon and graphitic carbon from GO, i.e., C C. C C and C H bonds 52,53.The absence of Ti C (281 eV) signal suggested that carbon was not doped into the O 2 -TiO 2 lattice 54,55.The peaks located at 286.7 and 289.1 eV were correlated to the C O and O C OH oxygenated carbonaceous bands, respectively 53,56.The existence of such surface functional groups indicated that the OH groups on the surface of O 2 -TiO 2 could interact with the COOH groups on GO through esterification to form O C O Ti bonds 57.This was further verified by the O 1s XPS spectrum as shown in Fig. 5C, whereby the main peak at 530.6 eV could be well-assigned to O in the Ti O C bonds 58.The representative Ti core level XPS spectrum depicted in Fig. 5D showed two peaks centered at 459.3 and 465.0 eV, which were indexed to the Ti 2p 3/2 and Ti 2p 1/2 spin-orbital splitting photoelectrons in the Ti 4 chemical state, respectively 18,43.The splitting between these two bands was 5.7 eV, thus confirming that in the composite Ti existed mainly in the Ti 4 state 59.These results implied the successful integration between O 2 -TiO 2 and GO, and the compact interaction among Ti, O and C from the synthesis procedure.In addition, XPS was also used to verify the oxygen-rich nature of O 2 -TiO 2 .Quantification reports generated revealed an increase in the oxygen content for O 2 -TiO 2 as compared to control TiO 2 18, whereby the O 2 :Ti ratio increased from 2.315 to 2.519 (see Supplementary material).This firmly established the generation of oxygen-rich TiO 2 nanoparticles as a result of precursor modification with H 2 O 2 . Fig. 6 presents the UV-vis diffuse reflectance spectra (DRS) of O 2 -TiO 2 and GO-OTiO 2 with different GO content.The studied photocatalysts showed a typical absorption with an intense tran-sition in the ultraviolet (UV) region, which could be ascribed to the intrinsic band gap absorption of O 2 -TiO 2 , resulting from the transitions of electrons from the valence band (VB) to the conduction band (CB) (O 2p Ti 3d) 60.From our previous work, we showed that oxygen-modified TiO 2 had an obvious red shift to ca. 420 nm when compared to the unmodified control sample 18.The reduction in band gap energy of O 2 -TiO 2 was ascribed to the variation in cell parameters, which stemmed from the oxygen excess defects introduced by H 2 O 2 18.It was suggested that the surface disorderliness led to an upshift of VB while the CB remained unchanged.The lowering of band gap energy in O 2 -TiO 2 rendered it responsive toward visible light absorption.From Fig. 6A, the introduction of GO into O 2 -TiO 2 caused further red shifts to high wavelengths at the absorption edge.Furthermore, all GO-OTiO 2 samples displayed broad background absorption in the visible range (400-800 nm).The absorption intensity of GO-OTiO 2 was shown to increase with GO content, which was well in agreement with the gradual color change from white to dark gray (inset of Fig. 6A).The optical band gap energies of 1, 2, 5, 10, 15 and 20GO-OTiO 2 were estimated through a Tauc plot of the modified KM function with linear extrapolations (Fig. 6B).As shown in the inset of Fig. 6B, the band gap energies decreased from 2.95 to 2.81 eV, with the gradual increase in GO content.This supported the qualitative observation of red shifts in the absorption edges of the binary composites.The successful reduction in band gap energies could be attributed to the chemical bonding between the GO support and the O 2 -TiO 2 nanoparticles.Such observation is analogous to the case of reduced graphene oxide (rGO)-TiO 2 , as reported in our previous work 5.Therefore, the synergistic contributions from visible-light-responsive O 2 -TiO 2 and GO sheets resulted in GO-OTiO 2 binary composites with improved optical properties, which would be beneficial in photocatalytic experiments.The hypothesis was verified by studying its application in the photocatalytic reduction of CO 2 under visible light irradiation. The photocatalytic reduction of CO 2 was conducted in gaseous phase over the as-developed GO-OTiO 2 binary nanocomposites under ambient temperature and pressure.A low-power 15 W energy-saving daylight bulb was employed as the source for visible light.Prior to that, a series of preliminary control tests were performed under the following conditions: (1) without light irradiation; (2) in the absence of photocatalyst; (3) without H 2 O and (4) under N 2 / H 2 O flow.In all cases, no reaction products could be detected, confirming that there were no decomposition of organic residues on the photocatalyst.It can therefore be reiterated that the photoreduction of CO 2 requires all three components, i.e., the light source, photocatalyst, CO 2 / H 2 O feed, and any carbon-containing products in the outlet gas stemmed from photocatalytic reactions. CH 4 was detected as the major hydrocarbon product from the photoreduction of CO 2 over the as-synthesized GO-OTiO 2 photocatalysts.The total yield of CH 4 (mol/g cat ) attained after 6 h of light irradiation was calculated and tabulated in Fig. 7A.The photoactivity was found to follow the order: In comparison to pure ATiO 2 and commercial Degussa P25 photocatalysts, the activity and rate of CH 4 production over bare O 2 -TiO 2 was significantly higher (Fig. 7B) due to its visible-light-responsiveness from the reduced band gap energy (Fig. 6B).The high photoactivity of O 2 -TiO 2 photocatalysts had been reported in our previous work 18.However, it could be observed that CH 4 evolution over pure O 2 -TiO 2 progressively decreased after reaching a value of 0.280 mol/g cat h.This observation is not uncommon and similar trends of results have been reported by Liu et al. 61 and Wang et al. 62, where the yields of CO 2 photoreduction products decreased after reaching a maximum value.It is well documented that the slight deterioration in photocatalytic activity could be attributed to the diminishment of adsorption power and saturation of the adsorption sites with intermediate products 636465 as well as the rapid recombination of electron-hole pairs upon light irradiation.Hence, the addition of GO as a scaffold played an imperative role in lengthening the lifetime of charge carriers for the photocatalytic enhancement of O 2 -TiO 2 . To increase the stability of the photocatalyst, GO sheets were incorporated into O 2 -TiO 2 as a support for immobilization.Fig. 7A shows the effect of GO content in the GO-OTiO 2 binary composite on the photocatalytic reduction of CO 2 with H 2 O.The addition of GO resulted in an increase in photoactivity over bare O 2 -TiO 2 .The optimum content of GO was found to be at 5 wt. with respect to O 2 -TiO 2 (5GO-OTiO 2 ), where it achieved a total CH 4 yield of 1.718 mol/g cat after 6 h of reaction.Further addition of GO into the binary composite was found to result in a gradual decrease in photocatalytic performance.As shown in Fig. 7B, 5GO-OTiO 2 retained good catalytic stability, maintaining a reactivity of 95.8 after 6 h of light irradiation.This observation established the role of GO as a catalyst mat for O 2 -TiO 2 nanoparticles where it accepted photoinduced electrons and reduced the probability of charge recombination.The photoreduction of CO 2 over 5GO-TiO 2 was also conducted to elucidate the significance of oxygen-rich TiO 2 as a visible-light-responsive photocatalyst.In comparison to 5GO-OTiO 2 , the 5GO-TiO 2 composite displayed significantly lower photocatalytic performance, achieving a total CH 4 yield of only 0.628 mol/g cat after 6 h of reaction.This observation could be attributed to the wider band gap of unmodified TiO 2 (see Supplementary material) which rendered the resulting 5GO-TiO 2 less visible-light-active as compared to the 5GO-OTiO 2 sample. The enhancement in photocatalytic activity of the GO-OTiO 2 binary composite could be ascribed to the combined effect of several contributing factors.Firstly, GO-OTiO 2 possessed improved optical properties compared to that of bare O 2 -TiO 2 , as evidenced by UV-vis DRS.When combined with GO, the hybrid nanocomposite displayed an obvious red shift at the absorption edge as well as an increased absorption intensity in the visible region (Fig. 6A).In addition, the improved activity could also be due to the formation of GO-OTiO 2 nanocomposites with close interface and uniform dispersion of O 2 -TiO 2 (Fig. 2) .The close interaction between the d-orbital of O 2 -TiO 2 and the -orbital of GO formed a d-electron orbital overlap, which led to a compact chemical bond interaction 6.Such connection between the two components is anticipated to be favorable for promoting interfacial charge carrier migration in the binary heterostructures.This would in turn facilitate electron-hole separation to hinder the charge recombination process, ultimately giving rise to efficient production of CH 4 .Furthermore, the unique 2D planar -conjugation structure of GO would endow it with excellent conductivity of electrons.Hence, in the GO-OTiO 2 binary composite, GO acted as an acceptor and transporter of electrons to effectively separate the photoinduced electron-hole pairs and lengthen the lifetime of charges to take part in the photoreduction of CO 2 .The role of GO in maintaining photocatalytic stability of O 2 -TiO 2 was clearly justified in the time dependence study on CH 4 production (Fig. 7B).However, similar to other types of dopants (e.g., non-metal, metal oxide, metal hydroxide etc.) 66, there exists an optimum loading of carbonaceous material to achieve most efficient photocatalytic performances.As shown in Fig. 7A, excess GO content (5 wt.) was observed to have decreased the photoactivity of the composite.This was due to the generation of charge recombination centers inside GO-OTiO 2 .The excessive carbon content could also have blocked the light absorption centers of O 2 -TiO 2 , leading to poor light exposure for inducing the photoexcitation of electron-hole pairs. The PL quenching effect is a useful technique to investigate the emission mechanism and charge transfer within a specific material.The PL intensity provides a direct measurement of the recombination rate of charge carriers.Lower peak intensities imply that a larger amount of photogenerated electrons are trapped and efficiently transferred across the Schottky barrier; while high peak intensities indicate the occurrence of rapid charge recombination.Hence, PL analysis was used to elucidate the role of GO in the photocatalytic enhancement of GO-OTiO 2 binary composites.Fig. 8 shows the PL spectra of bare O 2 -TiO 2 and GO-OTiO 2 with varying GO content.It can be observed that all GO-modified samples displayed lower emission peak intensities, indicating efficient trapping of photogenerated electrons by GO.Apart from 20GO-OTiO 2 , the remaining GO-OTiO 2 samples displayed close emission inten-sities.As discussed earlier, excessive content of dopant would degrade the photocatalytic performance of the material.Excessive GO content (20 wt. GO) in this case could have increased the probability of collision between electrons and holes, thus promoting recombination of photogenerated electron-hole pairs.As overly high GO content exhibits strong light absorption, a lightharvesting competition between GO and O 2 -TiO 2 might have occurred, thereby leading to reduced photocatalytic performance.Similar observations have also been reported in literature 9,24,67. On the basis of the aforementioned results, a plausible mechanism for charge transfer and separation in the fabricated GO-OTiO 2 nanocomposite was proposed in Fig. 9. Pure TiO 2 photocatalyst has been widely reported to exhibit a large band gap energy of 3.2 eV and is therefore unable to absorb light in the visible range.By simply modifying the titanium precursor with H 2 O 2 , the as-developed O 2 -TiO 2 photocatalyst was found to exhibit a reduced band gap of 2.95 eV, rendering it responsive toward visible light irradiation.The band gap narrowing phenomenon was assigned to the variation in lattice parameter from the introduction of oxygen excess defects, where an upshift of VB occurred from surface disorderli- ness 18,43.In the mechanism proposed, electron-hole pairs were first generated by the photoexcitation of O 2 -TiO 2 under visible light.Owing to favorable equilibrium Fermi level positions, photoinduced electrons would migrate and transfer across the interface into the GO sheet, where they would move freely along the conducting network of GO.Hence, the separation of charge carriers effectively hindered the charge recombination process, ultimately leading to enhanced photocatalytic activities.In general, the overall mechanism underlying the CO 2 transformation process involved a sequential combination of H 2 O oxidation and CO 2 reduction.The photoinduced holes on the O 2 -TiO 2 VB could absorb water molecules to form hydroxyl radicals ( OH), which in turn produced protons (H ) and oxygen.The former would then interact with photogenerated electrons on the binary composite to form H rad-icals.At the same time, very negative and metastable superoxide radicals ( CO 2 -) could be formed through the reaction between adsorbed CO 2 and electrons.The interaction between CO 2 -and H then led to the formation of a series of radicals, eventually producing CH 4 as the final product.It should be noted that molecular H 2 was not detected by gas chromatography (GC).It is suggested that both H radicals and H 2 were rapidly consumed by CO 2 during the photocatalytic process 68.Similar observations have also been reported by Li et al. 68 and in our previous communications 6,18,19.The generation of O 2 and N 2 gases were monitored using GC-TCD.Prior to the photocatalytic reaction, the photoreactor was purged with a CO 2 -H 2 O mixture to eliminate the air inside the reactor.However, even after purging for 30 min, background O 2 together with N 2 were still detected in the effluent gas.Hence, a better indicator of O 2 production by the catalyst is the flow ratio of O 2 /N 2 in the effluent gas, which is also suggested in literature 69.Fig. S7 shows the result on O 2 /N 2 ratio before (t 0) and after light irradiation.Interestingly, immediately upon illumination, the O 2 /N 2 ratio dramatically decreased in the first 4 h and then increased.Similar trends have been reported in literature 69.The sharp decrease was possibly due to the consumption of residual O 2 in the reactor through the reaction with photogenerated electrons (O 2 e - O 2 -) and consecutive reactions.In the meantime upon photo-illumination, the production of CH 4 occurred simultaneously.This indicated that although O 2 competed with CO 2 for photogenerated electrons, it could not completely restrict the electron transfer to CO 2 , since the concentration of CO 2 was several orders of magnitude higher than O 2 in the reactor.The increase in the O 2 /N 2 ratio after 4 h photo-irradiation indicated the generation of O 2 through oxidation of H 2 O with photogenerated holes.The O 2 generation process overweighed the concurrent O 2 consumption process, thus resulting in the gradual increase in O 2 /N 2 ratio with time."
  },
  {
    "title": "Conclusions",
    "content": "In summary, we have successfully coupled visible-light-active O 2 -TiO 2 with GO through a simple wet chemical impregnation method to form GO-OTiO 2 hybrid heterostructures with enhanced photoactivity and photostability.HRTEM and XPS characterizations revealed an intimate contact and chemical bond interaction between both components of O 2 -TiO 2 and GO, respectively.In the CO 2 photoreduction experiments, 5GO-OTiO 2 (5 wt. of GO) demonstrated the highest photocatalytic performance, achieving a total CH 4 yield of 1.718 mol/g cat after 6 h of reaction time.The photoactivity achieved was approximately 1.6 and 14.0 folds higher than that of bare O 2 -TiO 2 and the commercial Degussa P25, respectively.The main highlight of this work was that the photostability of O 2 -TiO 2 was significantly enhanced by the addition of GO, at which the resulting hybrid composite retained a reactivity of 95.8 even after 6 h of reaction.Generally, the high photocatalytic performance of 5GO-OTiO 2 was ascribed to the synergistic effect of (i) the visible-light-responsiveness of O 2 -TiO 2 (from oxygen excess defects) and (ii) an improved separation and transfer of photogenerated charge carriers at the intimate interface of GO-OTiO 2 heterojunctions.The present work opens up new possibilities in the development of novel, next generation heterojunction photocatalysts for energy-and environmental-related applications. Fig. 1.Synthesis procedure of GO-OTiO2 binary nanocomposites. Fig. 2. Electron microscopy images of 5GO-OTiO2: (A) FESEM image, (B) TEM image and (C) HRTEM image of a selected 5GO-OTiO2 heterojunction, (D) EDX analysis of 5GO-OTiO2. Fig. 3. XRD patterns of GO-OTiO2 binary composites with different GO content: (A-G) 0, 1, 2, 5, 10, 15 and 20 wt. of GO (square and triangle symbols represent the reflections of anatase and rutile phases of O2-TiO2, respectively). Fig. 4. FTIR spectra of GO, O2-TiO2 and GO-OTiO2 binary nanocomposites. Fig. 5. (A) Survey XPS spectrum of 5GO-OTiO2, core level XPS spectra of (B) C 1s, (C) O 1s and (D) Ti 2p of 5GO-OTiO2. Fig. 6. (A) UV-vis DRS and (B) corresponding plot of transformed KM function F(R).hv 1/2 vs. hv for O2-TiO2 and GO-OTiO2 composites.(Inset of A) Color change of photocatalysts with GO content; (Inset of B) Estimated band gap energies of O2-TiO2 and GO-OTiO2 composites. Fig. 7. (A) Total yield of CH4 attained after 6 h over GO-OTiO2 binary composites with different GO content, (B) Time dependence on the CH4 production rate over 5GO-OTiO2, 5GO-TiO2, O2-TiO2, ATiO2 and P25 photocatalysts.The values for CH4 production are the average of three repeated experiments with percentage errors of less than 10. Fig. 8. PL spectra of O2-TiO2 and GO-OTiO2 binary composites with different GO content. Fig. 9. Schematic illustrating the proposed charge transfer and separation processes in GO-OTiO2 binary nanocomposite for the photoreduction of CO2 under visible light irradiation. This work was funded by the Ministry of Science, Technology and Innovation (MOSTI) Malaysia under e-Science Fund (Ref.no.03-02-10-SF0244). Supplementary data associated with this article can be found, in the online version, at http://dx.doi.org/10.1016/j.apcatb.2015.05.024"
  }
]