[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2016.01.002"
  },
  {
    "title": "Article_Title",
    "content": "Ultrathin nanosheets of molecular sieve SAPO-5: A new photocatalyst for efficient photocatalytic reduction of CO 2 with H 2 O to methane"
  },
  {
    "title": "Abstract",
    "content": "Highlights 2D SAPO-5 nanosheets with a thickness of about 3.0 nm are successfully prepared. SAPO-5 nanosheets show superior activities for the photoreduction of CO2 into CH4. The high activity is ascribed to ultrathin geometry and more surface active sites. The surface CO2 -is an active intermediate of CO2 reduction on SAPO-5 nanosheets."
  },
  {
    "title": "Experimental",
    "content": "Pseudoboehmite, orthophosphoric acid and tetraethyl orthosilicate (TEOS) were used as the source of aluminium, phosphorus and silicon, respectively.The optimized molar ratio of raw materials is triethylamine: Al2O3: P2O5: SiO2: H2O 1.2: 1: 1: 0.4: 60 for SAPO.The optimum amount of pseudoboehmite was dissolved in a mixture of orthophosphoric acid and water.Prior to adding the silicon source (TEOS), the solution was stirred for 30 min until the slurry becomes homogenous.Finally, the templates triethylamine (TEA) were added to the homogenous gels followed by stirring for 3 day.The mixture was transferred into a Teflon-lined stainless steel autoclave, sealed and heated to 200 oC for 24 h.The as-synthesized product was washed with water several times followed by drying at 60 oC overnight.Finally, the resulted samples were calcined in air at 600 C for 6 h in order to remove the surfactant. SAPO-5 rods were synthesized as per the aforementioned procedure where a molar gel composition is triethylamine: Al2O3: P2O5: SiO2: H2O 1: 1: 1: 0.2: 40.In a typical synthesis operation, a known quantity of aluminium isopropoxide (2.325 g) was dissolved in distilled water (3.1 mL) and was allowed to age overnight.The gel was stirred for an hour followed by adding dropwise a dilute orthophosphoric acid (1.31 g of 85 wt ortho-phosphoric acid in 2.5 mL distilled water) to the gel.The solution was stirred for 1 h until it became transparent.The required quantity (0.575 g) of structure directing agent, TEA, was added to this mixture, followed by stirring for 1 h.Finally, TEOS (0.238 g) was added to the mixture and then stirring was continued for another 1 h.The resultant final gel was subjected to crystallization at 180 o C for 24 h in a Teflon-lined stainless steel autoclave.The as-synthesized product was washed with water several times followed by drying at 60 oC overnight.Finally, the resulted samples were calcined in air at 600 C for 6 h in order to remove the surfactant. Transmission electron microscopy (TEM) images were recorded using a JEOL model JEM 2010 EX microscope at an accelerating voltage of 200 kV.The X-ray diffraction (XRD) measurements were performed on a Bruker D8 Advance X-ray diffractometer using Cu K1 radiation ( 1.5406A).The amounts of Al in the products were measured by an inductively coupled plasma optical emission spectrometer (ICP-OES) (Ultima2, Jobin Yvon Co., France).The Brunauer-Emmett-Teller (BET) surface area and the CO2 adsorption were measured with an ASAP2020M apparatus (Micromeritics Instrument Corp., USA).The nitrogen adsorption and desorption isotherms were measured at -196 C, and CO2 adsorption isotherms were measured at 0 C.Diffuse reflection spectra (DRS) of the samples were recorded on a Varian Cary-500 spectrophotometer.In situ CO2-adsorbed FT-IR experiments were carried out on a Nicolet 670 FT-IR spectrometer at a resolution of 4 cm -1 and 32 scans.The light/dark short circuit photocurrent response was recorded with a BAS Epsilon workstation.X-ray photoelectron spectroscopy (XPS) measurements were conducted on a PHI Quantum 2000 XPS system equipped with an Al X-ray source (1486.6 eV).The time-resolved photoluminescence decay was investigated on an Edinburgh FLS 980 photoluminescence spectrometer (Edinburgh, UK).A tapping-mode atomic force microscopy (AFM, Nanoscope Multimode IIIa, Veeco Instruments) with Si-tip cantilever was used to evaluate the morphology of the obtained nanosheets on the mica substrate. The photocatalytic reduction of CO2 was performed in a 40 mL Schlenk quartz glass flask reactor at ambient temperature under atmospheric pressure.The top of the reactor was sealed with a silicone rubber septum.Sampling was made intermittently through the septum during experiments.In a typical photocatalytic experiment, 10 mg solid photocatalyst was loaded in the reactor.This system was subjected to vacuum degassing and then backfilling with pure CO2 gas.This process was repeated three times, and after the last cycle the flask was backfilled with CO2 (1 bar).6 L of liquid water was introduced into the flack with a syringe via the septum.Then liquid water was gasified by heating with a hair dryer.The photocatalytic reaction was typically carried out for 4 h under two 4 W 254 nm (Philips Co., TUV 4W/G4 T5) light irradiation.The temperature of the reaction system was kept at 298 K. 0.5 ml of gas was taken from the reactor for subsequent gas concentration analysis using a gas chromatography (GC-7890A, Shimadzu) equipped with a flame ionized detector (FID).Product gases were calibrated with a standard gas mixture and their identity determined using the retention time."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The XRD pattern of the as-prepared SAPO-5 nanosheets and SAPO-5 microrods are shown in Fig. 1.The XRD profiles of the two SAPO-5 samples can be well indexed to the pure SAPO-5 with AFI-type 14,27.Obviously, the SAPO-5 nanosheet exhibits better crystallinity than the SAPO-5 microrod.No diffraction peaks from impurities and/or other phases can be detected. The transmission electron microscopy (TEM) images of the as-synthesized SAPO-5 ultrathin nanosheets were shown in Fig. 2a andb.It can be clearly seen that the SAPO-5 sample shows morphology of ultrathin nanosheets, which is similar to graphene with a large area of wrinkled and nearly transparent nanosheets.These ultrathin nanosheets are irregular, which made of the aggregates of numerous randomly arranged nanosheets.In order to observe the nanosheets clearly, the thickness of nanosheets was evaluated by a tapping-mode atomic force microscopy (AFM) to be as thin as 3 nm (Fig. 2c).These results suggest a good quality of the as-synthesized molecular sieve ultrathin nanosheets.The SAPO-5 sample can be observed as morphology of microrods, as shown in Figure 1S.Many irregular microrods assemble together to the formation of larger particles.In comparison to microrods, the 2D scaffolding configuration can offer an extremely high percentage of active sites for the photocatalytic reaction 26, which are beneficial for photocatalytic performance. Fig. 3 shows the N2 adsorption-desorption isotherms and the corresponding pore-size distribution curves of SAPO-5 nanosheets and SAPO-5 microrods.It is seen from Table 1 that the BET surface area of SAPO-5 nanosheets is slightly lower than that of the SAPO-5 microrods.And both the SAPO-5 samples show typical type IV isotherm with a hysteresis loop according to the IUPAC classification 28,29.The feature of isotherm is usually considered to relate with the slit-like mesopores formed by sheet-like particles 30,31.The corresponding BJH pore size distribution curve was calculated from the adsorption branch (insert in Fig. 3).The relatively narrow pore size distribution at 45-50 nm suggests the uniform size of nanosheets. The UV-vis absorption spectra of two samples are shown in Fig. 4. A broad absorption band occurs in the range of 200-380 nm, indicating that SAPO-5 adsorbs only UV light.The photoabsorption feature is usually ascribed to the ligand-to-metal charge transfer (LMCT) involving an electron transfer from O 2-to Al 3 in the framework Al-O unit 32.Thus, the framework Al-O units are considered to absorb UV light to induce photoreduction reaction, which have been reported by Yuko Kato 32.It can also be seen that the SAPO-5 nanosheets show stronger photoabsorption than the SAPO-5 microrods, which could be attributed to large fraction of exposed Al-O unit on the 2D structure.It can be anticipated that the nanosheets have more active framework Al-O units and therefore is favorable for the photocatalytic reaction. The surface compositions and elemental valences of the SAPO-5 microrods and the SAPO-5 nanosheets were analyzed by XPS.Fig. 5a is the high-resolution XPS spectra of Al 2p.The nanosheets show a peak located at 74.7 eV, which is belonged to Al 2p 33,34.But the microrods show an Al 2p peak at the binding energy of 75.1 eV. The decrease of chemical state of Al 2p from 75.1 to 74.7 eV indicates clearly that the electron density of Al atoms on nanosheet surface is higher than that of SAPO-5 microrods.In addition, the O1s peak of both samples could be deconvolved into two peaks assigned to the lattice oxygen and surface oxygen (including -OH) 35,36, respectively, as shown in Fig. 5b Photocatalytic reduction of CO2 with H2O was performed in a gas-solid system.Fig. 6 shows photocatalytic CH4-production performance of the SAPO-5 microrods and SAPO-5 nanosheets by 254 nm light illumination.CH4 is observed to be an only detectable reaction product for the reaction.Two control experiments were also made with catalyst in dark or without the photocatalyst under UV irradiation, respectively. No CH4 was detected under these conditions.This means that both light and photocatalysts are necessary for the reduction of CO2 to CH4.The SAPO-5 microrods show a low activity for photoreduction CO2, and CH4 production rate is at 0.07 mol h -1 g -1 .In sharp contrast, the production rate of CH4 over SAPO-5 nanosheets reaches at 0.4 mol h -1 g -1 , which is nearly 6 times higher than that of SAPO-5 microrods.This demonstrates that the ultrathin SAPO-5 nanosheets are much more active than the microrods for the photocatalytic reduction of CO2.The structure or physico-chemical properties of the catalyst after photocatalytic reaction have been investigated.As showed by XRD and XPS (Fig. S2 andS3), no obvious change in the crystal structure and chemical state was observed for the SAPO-5 nanosheets after CO2 reduction reaction.Thus, SAPO-5 nanosheets are highly stable for photocatalytic CO2 conversion. In order to gain insight into the effect of the texture on the photocatalytic activities, we normalized the photocatalytic reduction rates with the surface areas (Table 1).It can be seen that the surface area is not responsible for the difference in photocatalytic activity of samples, because the nanosheets with lower surface area show higher normalized reaction rates.Therefore, the increased activity on the nanosheets may be related to changes in other physicochemical properties, such as the enhancement of alkalinity, high mass transfer efficiency of CO2, and exposure of active sites.Moreover, no CH4 is observed to evolve when N2 instead of CO2 was filled in the reaction system, which indicates that the evolved CH4 indeed originates from photoreduction of CO2. The Al contents of the samples were determined by ICP, as shown in Table 1. The Al content is comparable for two samples.For comparison, we normalize the photocatalytic reduction rates with Al content (Table 1).It can be seen that the normalized rates on the nanosheets is much higher than that on the microrods.This means that the photocatalytic activity of samples is dependent on the chemical states of Al atoms.The Al atoms located at the 2D structure are more active than those at rods.Since SAPO-5 consists of elements Si, Al and P, control experiments with SiO2, AlPO4 and Al2O3 as photocatalysts are needful in the same condition.As shown in Fig. 7, except for the SAPO5 nanosheets, the other samples show poor yields of CH4.This implies that the photocatalytic activity of SAPO-5 is due to tetrahedral coordination states of Al atoms in the AFI structure.Fig. 8 is the comparison of the photocatalytic activity among four zeolite molecular sieves including ZSM-5, Y-type zeolite, mordenite and the SAPO-5 nanosheets.It can be seen that the SAPO-5 nanosheets show the highest yield of CH4 in all samples.The difference suggests that the photocatalytic activity is decided not only by the tetrahedral coordination state of Al atoms, but also related to the properties of the ligands of Al atoms. It has been revealed that for metal oxides, the oxygen vacancies can behave as adsorptive and catalytic sites in heterogeneous catalysis 373839.In order to explore surface defects of SAPO-5, EPR spectra of the SAPO-5 microrods and nanosheets were determined at 77 k, as shown in Fig. 9a.The nanosheets show a strong EPR signal at g-values of around 2.003, which are attributed to the oxygen vacancies 40,41.But for SAPO-5 microrod sample, no signal of oxygen vacancy is observed.This result suggests that abundant oxygen defects are present on the SAPO-5 nanosheets. The high catalytic activity of nanosheets may be attributed to the affluent surface defects, which act as active sites 40,42.Fig. 9b shows the EPR spectra of SAPO-5 nanosheet sample in air and CO2 atmospheres, respectively.The lower intensity of Vo signal in CO2 atmosphere than in air can be attributed to more efficient CO2 adsorption over the oxygen vacancies 40,43,44.This indicates that SAPO-5 nanosheets have a higher CO2 adsorption capacity, which promotes CO2 mass transfer and finally improves the photocatalytic activity. CO2 adsorption isotherms on the SAPO-5 nanosheets and SAPO-5 microrods are measured at 273 K under 1 atm, as shown in Fig. 10.It can be seen that the nanosheets exhibit higher CO2 adsorption capabilities than the microrods.For the SAPO-5 nanosheets, the adsorption amount of CO2 reaches up to 12.9 g cm -3 , while the adsorption amount is only 4.04 g cm -3 for the SAPO-5 microrods.To rule out the effect of surface areas on their CO2 adsorption capabilities, we normalized the CO2 adsorption capabilities with the surface areas (Table 1).It can be seen that the order of the normalized CO2 adsorption capacities is unchanged.This is, the increased adsorption amount of CO2 is not contributed by the specific surface area.For SAPO-5 nanosheets, the surface oxygen vacancies and electron-rich Al atoms may be responsible for its high CO2 adsorption. Photocurrent response of SAPO-5 microrods and SAPO-5 nanosheets on ITO-coated glass electrodes are determined by 254 nm light irradiation, as shown in Fig. 11.The SAPO-5 nanosheet electrode shows higher cathodic photocurrent than SAPO-5 rod electrode.This indicates that the excited state electrons over SAPO-5 nanosheet electrode can be captured more quickly, which agrees well with the high photocatalytic activity of SAPO-5 nanosheet.Thus, we can also ascribe the enhancement of photocatalytic performance over SAPO-5 nanosheets to the increased concentration of excited state electrons and a better electron transfer rate over 2D nanosheet. To gain a further insight into the higher photoactivity of the nanosheets, the excited state transfer dynamics were investigated by the transient absorption spectroscopy.The photoluminescence decay profiles of the SAPO-5 nanosheets and microrods are shown in Fig. 12. Obviously, the SAPO-5 nanosheet shows slower decay kinetics than the SAPO-5 microrods.In other word, the life time of the excited state over nanosheets was longer than that of the SAPO-5 microrods.According to the fitting calculation of the decay spectrum, it is estimated that the excited state lifetime of the SAPO-5 nanosheets and the SAPO-5 microrods are 4.8 ns and 3.6 ns, respectively.Longer lifetime of the excited state over SAPO-5 nanosheet makes a contribution for it higher photocatalytic activity. In order to better understand the effect of the adsorption and mass-transfer of CO2 on the photocatalytic process, in situ FT-IR characterizations have also been done. As shown in Fig. 13, both the nanosheets and microrods show a CO2 adsorption peak at 1261 cm -1 , which is ascribed to CO2 -bonded to the surface 24,454647.For the SAPO-5 microrods, the IR absorption band after and before UV irradiation is almost unchanged.But for the SAPO-5 nanosheets, the intensity is visibly decreased upon the irradiation.This can be indicative of fast mass-transfer of CO2 on the sample, or the surface CO2 -as active intermediate of CO2 reduction on the SAPO-5 nanosheets. For SAPO-5, the 2D configuration of nanosheets can provide an extremely high percentage of exposed Al atoms as an alkaline site for more efficient adsorption of acidic CO2 molecules.The nanosheet structure enables the excited state electrons to be captured and transferred more quickly, as verified by the enhanced photocurrent response on SAPO-5 nanosheets.Moreover, the EPR results observed the presence of abundant oxygen defects (Vo) on the SAPO-5 nanosheets.The CO2 introduction can lower the intensity of Vo signal, indicating the interaction between CO2 and Vo to promotes CO2 mass transfer.All these induce longer lifetime of the excited state over SAPO-5 nanosheet, and therefore higher photocatalytic activity.However, its photocatalytic mechanism is an issue, which cannot be dodged.According to the DRS spectrum, the SAPO-5 can be regarded as a UV-light-active material.For such materials, the photocatalytic mechanism has been explained by the ligand-to-metal charge-transfer excitation.The M-O species may be excited by UV or visible light to produce a charge-transfer excited state M (n-1) -O -, which leads to photocatalytic reactions 48.Based on the above experimental results and the analysis, it is suggested that the photocatalytic reduction of CO2 over SAPO-5 nanosheets may occur though the possible mechanism illustrated in Fig. 14"
  },
  {
    "title": "Conclusions",
    "content": "In summary, the two-dimensional SAPO-5 nanosheet with 3.0 nm size was successfully fabricated for the first time by the one-pot hydrothermal method.The SAPO-5 nanosheets exhibited greatly enhanced photocatalytic activity compared with SAPO-5 microrods for CO2 fixation under 254 nm light irradiation.The photocatalytic mechanism on SAPO-5 could be explained by Al 2 -O - units as photoactive sites.The remarkable enhancement in the photocatalytic activity of nanosheets is attributed to synergetic effect of two factors as follow, (1) higher adsorption amount of CO2 molecules, and (2) more abundant surface active sites.The present work affirmed that phosphate molecular sieve ultrathin nanosheets may be potential photocatalysts for the reduction of CO2 to CH4, and modifying nanosheets for enhancing activity is undergoing.) Pore size (nm) . It can be seen that the O 1s binding energies of SAPO-5 microrods are 0.22 eV lower than those of nanosheets.This result shows clearly that the oxygen atoms of SAPO-5 nanosheets have lower electron density than that of the SAPO-5 microrods.Combination of the O 1s analysis with Al 2p result suggest more electrons transferring from O to Al for the nanosheets, which supports the results of DRS.It is concluded that SAPO-5 nanosheets can offer more adsorption and active sites for CO2 photoreduction. photogenerated electron-induced multistep reduction process.Higher activity of SAPO-5 nanosheets than SAPO-5 microrods can be explained by the following reasons.(1) XPS results suggested that electron density of the Al atoms on the nanosheet surface is higher than that of SAPO-5 microrods, which indicates basicity increase of the exposed Al atom on nanosheets.The basicity increase is more efficient for adsorption of acidic CO2 molecules.(2) The nanosheet structure facilitates the photogenerated electrons to separate and transfer to CO2 for reduction reaction.(3) Abundant oxygen defects present on the SAPO-5 nanosheets as an active site can enhance adsorption and mass transfer of CO2. Figure 1 XRD patterns of SAPO-5 microrods and SAPO-5 nanosheets. Figure 2 TEM image (a, b) and AFM image (c) of the SAPO-5 nanosheets. Figure 3 Nitrogen adsorption desorption isotherms and the corresponding pore-size distribution curves (inset) for SAPO-5 microrods (a) and SAPO-5 nanosheets (b). Figure 4 UV-vis DRS of the SAPO-5 microrods and the SAPO-5 nanosheets. Figure 5 High-resolution XPS spectra of the Al 2p (A) and O1s (B) of SAPO-5 nanosheets (a) and microrods (b). Figure 6 Comparison of the average formation rates of CH4 during 4 hours between SAPO-5 microrods and SAPO-5 nanosheets. Figure7CH4 evolution rates on the AlPO4, Al2O3, SiO2, and SAPO-5 nanosheet samples. Figure8CH4 evolution rates on the ZSM-5, Y-type zeolite, mordenite and SAPO-5 nanosheet samples. Figure9EPR spectra of the SAPO-5 microrods and SAPO-5 nanosheets under dark condition (A), and in air and CO2 atmosphere for SAPO-5 nanosheets (B). Figure 10 CO2 adsorption isotherms of the SAPO-5 microrods (a) and SAPO-5 nanosheets (b) at 273 K in 1 atm pressure. Figure 11 Periodic on/off photocurrent response of the SAPO-5 microrod and SAPO-5 nanosheet electrodes in 0.2 M Na2SO4 electrolyte with zero bias versus Ag/AgCl. Figure 12 Time-resolved fluorescence decay spectra of the SAPO-5 microrods and SAPO-5 nanosheets. Figure 13 In-situ FT-IR spectra of the SAPO-5 microrods and nanosheets upon adsorption of CO2 and H2O in dark and under irradiation with 254 nm light. Figure 14 Possible mechanism for the photoreduction CO2 over the SAPO-5 nanosheets. Figure 1 Figure 3 Figure 4 Figure 5 Figure 6 Figure 7 Figure 8 Figure 13 Table 1 Comparison of the physical properties and photocatalytic activity of SAPO-5 microrods and SAPO-5 nanosheets.Adsorbed capacity of CO2; c CO2 adsorbed capacity normalized with surface area; d Production rate of CH4; e Production rate of CH4 normalized with surface area; f Production rate of CH4 normalized with Al content; a BET surface area; b The work is financially supported by the National Natural Science Foundation of China (Grants No. 21173044, 21303019, U1305242), the Natural Science Foundation of Fujian Province (2014J05016), the Technology Project of Education Office of Fujian Province of PR China (JA12036 and JA14030) and National Basic Research Program of China (973 Program, No. 2014CB260410)."
  }
]