[
  {
    "title": "Doi",
    "content": "10.1016/j.cej.2014.09.022"
  },
  {
    "title": "Article_Title",
    "content": "One-pot synthesis of Ag-MWCNT@TiO2 core–shell nanocomposites for photocatalytic reduction of CO2 with water under visible light irradiation"
  },
  {
    "title": "Abstract",
    "content": "h i g h l i g h t sAg-MWCNTTiO 2 nanocomposites were prepared using one-pot synthesis.2 wt Ag-doped nanocomposites showed the best performance in CO 2 reduction.Highest methane formation rate obtained was 0.90 lmol/g-catalyst/h.Maximum methane formation for 7.5 h reaction was 6.34 lmol/gcatalyst.Maximum ethylene formation for 7.5 h reaction was 0.68 lmol/gcatalyst."
  },
  {
    "title": "Experimental",
    "content": "The MWCNTs used in this study were produced from methane decomposition over Co-Mo/MgO catalysts in a rotary reactor with the measured carbon purity of ca.70.Titanium (IV) butoxide (Reagent grade of 97, Sigma Aldrich), sulfuric acid (95-97, Friendemann Schmidt Chemical), nitric acid (69, Friendemann Schmidt Chemical), ethanol (Grade AR 96, Friendemann Schmidt Chemical) and silver acetate (For synthesis, Merck Millipore) were used as received for the synthesis of the ternary nanocomposites. In the first step, MWCNTs were acid-treated with a mixture of nitric acid and sulfuric acid to remove metal catalyst impurities and to introduce hydrophilic characteristics on the nanotube surface.Detailed acid-treatment procedures can be obtained from 8,10.In the next step, 0.24 g of acid-treated MWCNTs along with 20 mL of ethanol and 1 mL of distilled water were stirred and sonicated for 10 min.In the meantime, a pre-calculated amount of silver acetate (CH 3 COOAg) to yield the desired Ag loading (wt) was stirred and sonicated with 10 ml of ethanol.MWCNT solution and silver acetate solution were then mixed with 3.4 mL of titanium butoxide (TBOT) pre-dissolved in 10 mL of ethanol.The mixture was stirred in ice bath for the hydrolysis of TBOT with water to form TiO 2 shell layers.The solid samples were recovered from the solution mixture through vacuum filtration.The samples were subsequently washed with ethanol to remove excess TBOT, followed by drying overnight in oven at 70 C to remove ethanol residue.The final products were obtained after calcination in nitrogen environment at 400 C for 2 h. Field-emission scanning electron microscopy (FE-SEM, Hitachi SU8010) was employed to observe the surface morphology of the ternary nanocomposites.The presence of Ag dopants on the MWCNTTiO 2 core-shell was confirmed with energy-dispersive X-ray spectroscopy (EDS).The structures of the Ag-MWCNTTiO 2 obtained were observed using high-resolution transmission electron microscopy (HR-TEM, JEM2100) operated at 200 kV.X-ray Diffraction (XRD) (Bruker D8 Discover) with Cu K radiation wavelength of 1.54056 nm was used to determine the crystallographic properties of the nanocomposites.Crystallite sizes of the TiO 2 were estimated based on Scherrer's equation at FWHM (full-width at half maximum): where B is the crystallite size of the XRD maximum peak (nm), k is the wavelength of the radiation used, h is the angle of the selected peak (radians) and b is the full width of the selected peak at half maximum intensity (radians).K factor of 0.90 for cubic structure was used.Diffuse-reflectance UV-Vis spectroscopy analysis (Agilent Cary 100) was performed to determine the light absorption and the absorption band-edge position of these prepared samples.Fluorescence spectra of the nanocomposites were collected in Fluorescence spectrometer (Perkin Elmer, LS55-230V) which carried out at the excitation wavelength equivalent to the emission wavelength of the light source used in the CO 2 photoreduction system, i.e., 435 nm using excitation and emission slit widths of 3.0 nm. The photocatalytic performance of the Ag-MWCNTTiO 2 nanocomposites in the reduction of CO 2 with water under visible light irradiation was investigated in a continuous gas-phase system operated at atmospheric pressure.The photocatalysts were firstly coated on glass rods with transparent double-sided tapes (Fig. S1, electronic supplementary information) and then packed into the quartz tubes with the dimensions of 10 mm A 20 mm (OD A length) which function as the photoreactors.The quartz tubes were then placed in a black box equipped with 15 W (energy saving light, Philips) visible light source.Prior to the reaction, the photoreactors were purged with CO 2 gas at a flowrate of 55 mL/min for 30 min to remove air contaminants that trapped inside the quartz tubes.The CO 2 photocatalytic reaction was performed at a CO 2 flowrate of 5 mL/min.The water vapor was introduced into the reactor via bubbling of CO 2 in a water bath at a temperature of 60 C.A detailed schematic of the experimental set-up was shown in Fig. S2 (electronic supporting information) 8.Gas chromatograph (Agilent 7820A) equipped with flame ionization detector (FID) and thermal conductivity detector (TCD) was used to analyze the composition of product gases obtained from the reaction.The formation rate of methane (CH 4 ) and ethylene (C 2 H 4 ) was calculated from Eqs. ( 2) and (3), respectively: Methane formation rate Ethylene formation rate where C initial and C final are the initial and final concentration of methane and ethylene in the product gas, V is the volumetric flow rate of the product gas collected at the reactor outlet, m is the amount of photocatalysts used for the reaction."
  },
  {
    "title": "Results_and_Discussion",
    "content": "3.1.Characterization of Ag-MWCNTTiO 2 nanocomposites The XRD spectra of all the Ag-MWCNTTiO 2 nanocomposites (Fig. 1a) showed nearly similar diffraction patterns.The peaks observed at 2h values of 25.2, 37.9, 48.0, 53.9, 55.0, 62.7, 70.0and 75.4are indexed as anatase phase of hexagonal TiO 2 (JCPDS data file: 21-1272) (Fig. S3, electronic supporting information), implying the presence of anatase TiO 2 in all the samples.The anatase (1 0 1) facet has the highest intensity indicating that (1 0 1) facet is the dominant crystal phase of the core-shell nanocomposites.Distinctive diffraction peak for MWCNT was not assigned to any of the peaks in the XRD patterns due to the close diffraction peaks of MWCNTs and anatase TiO 2 (1 0 1), i.e., 25.2a nd 26.0, respectively 4,11.In addition, no significant diffraction peaks of Ag were noticeable, which is a result of the small Ag content and highly dispersion of Ag dopants over the MWCNTTiO 2 core-shell nanocomposites 12. The Ag-doped MWCNTTiO 2 nanocomposites (spectra II-VI) were found to possess similar diffraction patterns as the undoped-MWCNTTiO 2 (spectra I) indicating that the doping process did not alter the crystal phase of the TiO 2 shell layer.Diffraction peaks of anatase (1 0 1) were observed to be slightly right-shifted to higher 2h values with the increase in Ag dopant content (Fig. 1b).The small shifting of less than 0.1suggesting that one-pot synthesis allows Ag to be doped into TiO 2 lattice with minimal crystal distortion.Similar finding was also reported in 12.The crystallite size of the TiO 2 was estimated based on Scherrer's equation.It shows that the TiO 2 crystallite size increased by at least 2 folds ranging from ca. 21-31 nm after Ag doping.The introduction of Ag into the lattice of TiO 2 could cause the formation of larger TiO 2 particles due to reconstruction of the lattice defects by the lattice placement of Ag 13. Fig. 2 shows the UV-vis spectra of the samples over the wavelength range of 200-800 nm.From Fig. 2, the UV-vis spectra showed the formation of absorption shoulder peak with increasing absorbance reading in the range between 360 and 500 nm.These absorption shoulders are resulted from the post-broadening SPR peak 14.The presence of a localized surface plasmon resonance (LSPR) enables the ternary nanocomposites to exhibit strong and broad absorption in the visible region of the solar spectrum 15,16.The absorption tail of these samples in the range of 500-800 nm remained at high and consistent absorbance reading from the initial point of absorption tail without much deviation.This indicates that the MWCNT core remained active and played its crucial part in capturing photoexcited electrons after incorporation with TiO 2 and Ag.The similar characteristic of the absorption tail was also reported in other MWCNT-based photocatalysts 17. The evaluation of the photocatalytic reduction of CO 2 clearly demonstrated that the ternary nanocomposites were active in converting CO 2 into methane (CH 4 ) under the visible light irradiation.Fig. 3 exhibits the evolution of CH 4 over time during the reduction reaction for the samples loaded with different Ag loadings.The reaction product gas contains CH 4 as the main product with trace amounts of ethylene (C 2 H 4 ) detected.In the photoreduction reaction, the interaction of CO 2 and H 2 O with the excited state of photoinduced (Ti 3 -O A ) species leads to the formation of H atoms, A OH radicals and intermediate carbon species.A CH 3 radicals are the main species of the intermediates that further reduced to form CH 4 18192021. CH 4 can be detected from the product gas as early as 0.5 h of reaction time with the CH 4 formation rate gradually increased over time and remained nearly constant after 2 h of irradiation.The highest CH 4 formation rate of ca.0.91 lmol/g-catalyst/h was recorded for the Ag-MWCNTTiO 2 sample prepared with 2 wt of Ag.The total CH 4 and C 2 H 4 formation was calculated and plotted in Fig. 4. The photocatalytic activity of the nanocomposites could be rated based on their individual total CH 4 formation following the order of 2 wt Ag 1 wt Ag 2.5 wt Ag 3 wt Ag 0 wt Ag 4 wt Ag.All the Ag-doped core-shell nanocomposites demonstrated better photocatalytic activity as compared to undoped-MWCNTTiO 2 except for 4 wt Ag-MWCNTTiO 2 .As shown in Fig. 4, the total CH 4 formation increased with an increase in the Ag loading from 0 to 2 wt, i.e., from ca. 3.97 lmol/g-catalyst of the undoped-MWCNTTiO 2 to ca. 6.02 lmol/g-catalyst and ca. 6.34 lmol/g-catalyst for the samples with 1 and 2 wt Ag loading, respectively.The total CH 4 formation and CH 4 formation rates decreased with further increasing the Ag loading up to 4 wt.Despite showing superior optical properties in UV-vis analysis, the 4 wt Ag-doped sample exhibited the lowest methane formation rate at ca. 3.57 lmol/g-catalyst.Higher loading of Ag could cause shading effect that blocked the quantity of light reaching to the TiO 2 surface, hence resulting in a decrease in its photoactivity 22,18.On the other hand, the highest formation of C 2 H 4 of ca. 0.68 lmol/g-catalyst was obtained over 2 wt Ag-MWCNTTiO 2 , further confirming that 2 wt of Ag is the optimum loading for this ternary nanocomposites. Core-shell coating is a facile approach that requires precise control over the synthesis conditions, such as dispersion of the MWCNTs in the solvent, ratio of TBOT to MWCNTs and TBOT hydrolysis conditions.In this work, Ag-MWCNTTiO 2 nanocomposites were prepared using the concept of one-pot synthesis modified from the core-shell coating approach as reported earlier.Therefore, understanding the characteristics of Ag-MWCNTTiO 2 synthesized from the modified one-pot synthesis approach as compared to the undoped-MWCNTTiO 2 is necessary.For this purpose, 2 wt Ag-MWCNTTiO 2 that exhibited superior photoreactivity performance among all the tested samples was further characterized.Fig. 5a andb show the FE-SEM images of the 2 wt Ag-MWCNTTiO 2 as compared to undoped-MWCNTTiO 2 .Under the FE-SEM observation, the surface morphology of 2 wt Ag-MWCNTTiO 2 appeared to be nearly identical to that of undoped-MWCNTTiO 2 of which the TiO 2 shell was visualized to be homogeneous with the observation of TiO 2 nanoparticles arranged in a closely packed tube structure instead of random scattered on the nanotube surfaces.This finding also implies that Ag dopants at 2 wt did not cause significant disturbance in the formation of the MWCNTTiO 2 core-shell structure in the one-pot synthesis.EDS mapping analysis (Fig. 5d) confirmed the presence of Ag elements in the Ag-MWCNTTiO 2 core-shell structure and visualized that the Ag dopants were dispersed over the entire surface of the nanocomposites.The HR-TEM images shown in Fig. 5c and e reveal the structure of the Ag-MWCNTTiO 2 .One can observe that the samples constituted of TiO 2 wrapped around the MWCNT.Heterojunction of Ag-TiO 2 can be observed from the HR-TEM image obtained at high magnification scan (highlighted in red dash lines).Fig. 6 compares the UV and visible light absorption of the 2 wt Ag-MWCNTTiO 2 with the undoped-MWCNTTiO 2 .One can easily observe that the 2 wt Ag-MWCNTTiO 2 exhibited improved optical absorption, especially in the visible light range of 400-800 nm and red shifting of the absorption edge position towards longer wavelength from ca. 430 to ca. 510 nm.This observation suggests that modification of MWCNTTiO 2 coreshell with Ag could provide efficient visible-light-driven plasmonic photocatalytic activity, thus enhancing the electron-hole pairs generation under visible light irradiation, further contributing to enhanced photoreduction of CO 2 1,23. Fluorescence spectroscopy was employed to investigate the photorecombination rate of the core-shell nanocomposites upon light irradiation.Fig. 7 compares the fluorescence spectra of 2 wt Ag-MWCNTTiO 2 with the undoped-MWCNTTiO 2 .The intensity of the fluorescence of the nanocomposites was observed to reduce significantly in the 2 wt Ag-MWCNTTiO 2 , indicating the inhibition of the electron-hole pair recombination after the addition of Ag dopants.The inhibition of the photorecombination rate enables the electron-hole pairs to remain active on the photocatalysts surface for redox reactions.This result again explains better performance of Ag-MWCNTTiO 2 nanocomposites in CO 2 photoreduction as compared to the undoped-MWCNTTiO 2 as reported in the Section 3.2 of which increasing the loading of Ag dopants improves the photoreduction activity of the nanocomposites due to the presence of more electron trapping sites. When irradiated with light source, the visible-light-responsive Ag-MWCNTTiO 2 nanocomposites underwent electron-charge separation, generating electrons (e A ) to the conduction band (CB) leaving behind positively-charged holes (h vb ) in the valence band (VB).For the case of pure TiO 2 nanoparticles without the presence of any dopants, the photoexcited electrons tends to recombine with the holes in VB in nanoseconds if it is not consumed by the electron scavenger during the photoreduction reaction 24.Photorecombination of the electron-hole pairs plays an important role in determining the photocatalytic performance of a photocatalyst due to the fact that the recombination rate is 2-3 times greater than that of the photooxidation-photoreduction redox reactions 2.With the presence of MWCNTs and Ag dopants in the Ag-MWCNTTiO 2 nanocomposites, the photoexcited electrons are believed to be transported in a few possible pathways: (i) consumed by the electron scavengers, resulting in photoreduction of CO 2 and reaction intermediates; (ii) transported to the neighboring MWCNT core and Ag dopants; and (iii) unreacted electrons recombined with the holes in the VB.Following the lower photorecombination rates as shown in the fluorescence spectra, it is obvious that the Ag dopants could act as additional electron sinks by transporting photoexcited electrons through the Ag-TiO 2 Schottky barrier, which could then lead to the inhibition of the electron-hole pair recombination, thus enhancing the photoreactivity of the TiO 2 .The proposed electron charge transfer mechanism is illustrated in Fig. 8. Photoreduction of CO 2 is a series of redox reactions involving the photo-oxidation water by the h vb to form reactive hydroxyl groups A OH and H ions, and photo-reduction of CO 2 by electrons to form superoxide radicals A CO 2 . The redox reactions were proposed in Table 1.The overall reaction path for the formation of CH 4 and C 2 H 4 over Ag-MWCNTTiO 2 in this study can be summarized into Eqs.( 4) and (5).A total of 8 mol and 12 mol of electrons were required to produce one mol of CH 4 and C 2 H 4 , respectively."
  },
  {
    "title": "Conclusions",
    "content": "Ag-MWCNTTiO 2 core-shell ternary nanocomposites were successfully developed using a facile one-pot synthesis.The effect of Ag loadings on the photoreactivity of the core-shell samples in photoreduction of CO 2 was evaluated.Among the Ag loadings studied, 2 wt was found to be the optimum loading of Ag that gave the highest CH 4 and C 2 H 4 formation of ca.6.34 lmol/g-catalyst and 0.68 lmol/g-catalyst, respectively, from CO 2 photoreduction.The highest rate of methane formation of ca.0.91 lmol/g-catalyst/h was also recorded at 2 wt of Ag.These values were 1.60 folds and 2.06 folds higher than those obtained from the undoped-MWCNTTiO 2 core-shell nanocomposites, greatly contributed by the Ag dopants in inhibiting the recombination rate of the electron-hole pairs which is one of the most important factors in the photocatalytic reaction. Fig. 1.(a) XRD spectra of (I) undoped-MWCNTTiO 2 compared to Ag-MWCNTTiO 2 for various Ag loadings (II) 1 wt (III) 2 wt, (IV) 2.5 wt, (V) 3 wt, (VI) 4 wt and; (b) diffraction peak of anatase (1 0 1). A denotes as anatase TiO 2 . Fig. 4. Total CH 4 and C 2 H 4 formation for a reaction duration of 7.5 h over Ag-MWCNTTiO 2 of various Ag loadings. Fig.5.FE-SEM images of (a) 2 wt Ag-MWCNTTiO 2 and (b) undoped-MWCNTTiO 2 ; with (d) EDS mapping for Ag dopants (yellow dots) (Inset: image of the EDS mapping area); while (c and e) shows the HR-TEM of the 2 wt Ag-MWCNTTiO 2 at low and high magnification scan, respectively.(For interpretation of the references to color in this figure legend, the reader is referred to the web version of this article.) Fig. 7. Fluorescence spectra of undoped-and 2 wt Ag-MWCNTTiO 2 core-shell nanocomposites. Fig. 8. Proposed schematic of charge transfer and reactants transformation using Ag-MWCNTTiO 2 . Fig.2.UV-Vis spectra of undoped-MWCNTTiO 2 and Ag-MWCNTTiO 2 prepared from various Ag loadings. Redox reactions for the photoreduction of CO 2 into CH 4 and C 2 H 4 .Photoactivation of TiO 2 : TiO 2 h v ?TiO 2 (e A cb ) TiO 2 (h 3H O 2 CO 2 ?CO 1/2O 2 CO ?A C 1/2O 2 A C H e A ?A CH A CH H e A ?A CH 2 A CH 2 H e A ?A CH 3 A CH 3 H e A ?CH 4 A CH 2 A CH 2 ?C 2 H 4 2 A C 4H 4e A ?C 2 H 4 vb )Oxidation reactions:Reduction reactions:H 2 O h v ?H A OH 2H 2e A ?H 2 A OH H 2 O 3h v ? M.M. Gui et al. / Chemical Engineering Journal 278 (2015) 272-278 The authors would like to thank the Ministry of Higher Education of Malaysia (LRGS, 2110226-113-00) and Monash University Malaysia for the financial support given. Supplementary data associated with this article can be found, in the online version, at http://dx.doi.org/10.1016/j.cej.2014.09.022."
  }
]