[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2018.07.018"
  },
  {
    "title": "Article_Title",
    "content": "Systematic study of sol-gel parameters on TiO2 coating for CO2 photoreduction"
  },
  {
    "title": "Abstract",
    "content": "Highlights Systematic investigation of TiO 2 sol-gel parameters for CO 2 photoreduction Machine vision to estimate coverage of sol-gel coatings Optimisation of sol-gel procedure and benchmarking against P25 TiO 2"
  },
  {
    "title": "Experimental",
    "content": "Calcination conditions The effect of the parameters were investigated on the responses: band gap, coverage, crystallinity and phase ratio of anatase:rutile (Table 2).The models presented were compared to the literature and consolidated to yield a single experimental point using a single coating procedure that yielded a desirable response for band gap, crystallinity, ratio of anatase:rutile and coating coverage.The best design point was further optimized by adjusting the PPG volume equivalents.The use of lower cost lower molecular weights PPG were investigated. The optimized procedure was used to coat stainless steel mesh supports and benchmarked with P25 TiO2. Isopropanol (IPA, 99.96) and glacial acetic acid (99.7) were purchased from Fisher Chemical.Titanium (IV) n-butoxide (99, Acros), 400, 1000 and 3000 g.mol -1 polypropylene glycol (PPG, Alfa Aesar) were purchased from the commercial suppliers shown in brackets.The deionized water used was from a Merck Direct-q deionizer. Sol-gel mixtures were prepared using different amounts of chemicals as listed in Table 1.0.6 ml of titanium (IV) n-butoxide was used for all of the experiments.IPA, titanium butoxide and glacial acetic acid were transferred and agitated together in a sealed sample vial.Deionized water was added in a single step and the vial sealed. To ensure homogeneity, of at times a viscous mixture, the mixture was agitated for eighty minutes.The mixture was stored in a sealed vial to age overnight.PPG was then added in a single step before being agitated for 40 minutes.Samples were stored in a fridge set at 4 C for a maximum period of one month, to prevent excessive ageing, before being used to coat a glass strip support.Additional experiments were carried out using the same procedure described above for WT2 (Table 1.) towards testing the effect of molecular weight (400, 1000 and 3000 g.mol -1 ) and volume equivalents of PPG on the sol-gel. Glass strips (15 of 0.5 mm 25 mm) were cleaned with dilute sulphuric acid in water (10), rinsed with deionized water washes (3 25 ml) and one IPA wash (25 ml).The glass strips were then dried overnight in an oven at 70 C.Approximately 2.5 ml of the sol-gel prepared was transferred to a HPLC sample vial.The glass strips were immersed into the sol-gel for one minute before being withdrawn using a dip coater motor set at 50 Hz (Te-Sun Industry Works, Taiwan).The coated glass strips and an aliquot of the sol-gel prepared were calcined as shown in Table 1.For CO2 photoreduction tests, stainless steal gauge 20 mesh was coated using a similar procedure described above for the glass strips without a dilute sulphuric acid wash. The light absorption and electronic band were characterized using a UV-vis spectrometer (Perkin Elmer lamda 950) equipped with a 150 mm integration sphere (Perkin Elmer).The band gap was determined using a direct intercept method (Fig 2) to estimate the adsorption maxima which was then used in Eq. 4.37, 38 Eq. 4 where: h is Planck's constant (6.626 10 -34 m 2 kg s -1 ) c is the speed of light (3.0010 8 m s -1 ) is the conversion factor (1.6 10 -19 J) The coated slides and coverage were analyzed by scanning electron microscopy (SEM) and Energy-dispersive X-ray spectroscopy (EDX).A Quanta FEG 650 SEM equipped with Oxford Instruments X-max N 150 EDX detector and a XL30 LaB 6 ESEM equipped with Oxford Instruments X-max 80 EDX detector operated under low vacuum (Typically 0.8 Torr) were used. Powder X-ray diffraction to determine crystallinity and anatase:rutile phase ratio was performed using a Bruker D8 Advance powder diffractometer, operating with Ge-monochromated Cu K-alpha radiation Eq. 5 where: d is the crystallite size (nm) K is the dimensionless shape factor is the full width at half maximum (FWHM) intensity of the (1 0 1) peak (rad) The ratio between anatase and rutile phases was calculated using XRD peak intensity values for anatase and rutile with the Spurr and Myers equation Eq. 6. 40 Eq. 6 where: is the fraction of anatase phase in the powder and are the X-ray intensities of the anatase (101) and rutile (110) diffraction peaks, respectively Samples were degassed under a constant purge of N2 at 200 C for 10 h.The surface area of the optimised samples were estimated by N2 adsorption isotherms measured at 77 K over forty equidistant points from 0 -0.95 P/P0 (Gemini VII 2390).The Brunauer, Emmett and Teller (BET) method was used to estimate the surface area from the N2 adsorption isotherms by fitting a straight line to the data collected between 0.05 -0.3 P/P0.41 The pore volume was measured at the single point of 0.95 P/P0.41 CO2 adsorption capacities were estimated by the maximum value found from the CO2 adsorption isotherm measured at 273 K over forty equidistant points from 0 to 0.95 P/P0 (Gemini VII 2390).two factor full factorial design and an interaction effect between calcination temperature and holding time was found (Fig. 3c).Increasing the calcination temperature resulted in higher band gap values (Fig. 3b).An increase in the holding time decreased the band gap recorded and had less of an effect relative to calcination temperature (Fig. 3a,b).The interaction main effects plot shown in Fig. 3c showed that at high calcination temperatures, an interaction effect with holding time, where at calcination temperature 650 C, both 10 and 120 minute hold times yielded the same mean band gap.Whilst at calcination temperature 250 C, 10 and 120 minute hold times yielded a larger and smaller band gap, respectively.This shows that the dominating effect is that of calcination temperature at high settings, where holding time has little effect as the temperature increases.It is proposed that the change in band gap is from the kinetics of TiO2 phase change being dependent on temperature at higher calcination temperatures.Momeni et al also observed an increase in band gap recorded for N doped TiO2 films with increasing calcination temperature.9,10 The design reported here started with experimental points at 250 C which Machine vision provides a powerful tool for analysing images.42 SEM images were taken of the coated glass slides and a Python script was written to perform manual global, Otsu global and adaptive thresholding -see supplementary info for the script used. The PB design yielded a variety of coatings ranging from poor clumped coatings (Fig. 4a,b) to a thin uniform film, using WT2 settings, with high surface coverage of 98.94 using adaptive thresholding (Fig. 4f).The Otsu method worked the best out of the three Python methods employed as it showed the greatest variation (Otsu2 432.67,Adaptive2 227.91 and Manual2 35.15)and showed the best estimation of coverage when compared by eye with the original images (Table 2).The Python script yielded satisfactory thresholding results, although it must be noted that confirmation of the thresholding still required confirmation by eye. The amount of water showed the greatest effect on the percentage coverage with an increase in water decreasing the percentage coverage (Fig. 5a,b).Rezaee et al found that for the preparation of yttria-doped zirconia sol-gels, the coating showed more cracking by SEM when excess water was used.43 Using more water for the preparation of the sol-gels may have caused agglomeration, as water was added in one portion that may have resulted in very fast and complete hydrolysis and polycondensation producing agglomerates. Moemeni et al reported increased cracking with higher calcination temperature and proposed this was due to differences in expansion co-efficients between the coating and support used.9,10 Fig. 5d shows that an increase in annealing temperature also increased the crystallinity, as high temperatures could have overcome the surface tension of the coating leading to the formation of cracks.The opposite relationship was found for the amount of PPG used, where the percentage coverage increased with an increase in amount PPG used.Calderon-Morenoa et al showed that using high molecular weight polyethylene glycol (PEG) resulted in homogenous films prepared by TiO2 sol-gels.44 The presence of high molecular weight PEG may have bound the coatings better on calcination as the polycondensed chains were converted to TiO2 crystals. The PB design could be converted to a two factor full factorial design for the crystallinity of the anatase phase response as only one factor, calcination temperature, was found to have a statistically significant effect on the The PB design showed that the amount of IPA and water used for the preparation for the sol-gel along with the calcination temperature and heating rate were statistically significant effects on the ratio of anatase to rutile phase (Fig. 6a).The results presented use the amount of anatase as a response, if rutile was used the same factors would have been statistically significant and the main effects plots would have been the inverse of that shown in Fig. 6b.It can be seen that an increase in the amount of IPA, calcination temperature and heating rate favored a lower ratio of anatase, whilst the opposite was true for the amount of water used (Fig. 6b).The effect of temperature on the phase change from anatase to rutile is well documented.9,10,171819202122 It is also worth noting that according to Hanoar et al, the transformation of the anatase to rutile phase is a complex process that could include the following factors: particle size, particle shape (aspect ratio), surface area, atmosphere, volume of sample, nature of sample container, heating rate, and inclusion of impurities.21 The inclusion of organic crystallization impurities in this work may have resulted from the inclusion of IPA in the crystals formed.Ocana et al showed that the inclusion of organic impurities encouraged the formation of the rutile phase on the catalyst's surface.46 3.2 Optimisation of best design point Due to the nature of the wide design space explored for a PB design, there is a high probability that one of the points will yield a useful response.For this PB design, WT2 showed a favorable percentage coverage (98), band gap (3.35 eV), crystallinity anatase phase (28.01 nm) and anatase : rutile ratio (25:75).WT2's properties would be of interest to benchmark against the commercially available P25 TiO2 photocatalyst. Using this point's settings (WT2, Table 1), the effects of PPG molecular weight and volume equivalents were investigated and are presented in the next section. Building on the PB design's results and using the best design point WT2, the coating process was further investigated for the effect of the molecular weight and amount of the PPG used.PPG with molecular weights: 400, 1000 and 3000 were tested.High molecular weight PPG costs more, and therefore, lower molecular weights were investigated to reduce the cost of the sol-gel preparation.Five volume equivalents PPG relative to the starting volume of titanium (IV) n-butoxide (0.6 ml) was used for the preparation of WT2.To optimise the amount of PPG used, 0.83, 1.66 and 2.50 volume equivalents PPG relative to the starting reagent titanium (IV) n-butoxide were investigated for the preparation of TiO2 sol-gel.When the molecular weight of PPG increased from 400 to 3000, using five volume equivalents PPG, the rutile:anatase ratio increases (Fig. 7).The biggest increase in rutile phase observed for PPG 3000.Some rutile was observed for PPG 1000 and this does warrant further investigation in the future.The anatase crystalline size increased with higher molecular weight (Fig. 7).The mean values recorded for band gap, fraction phase and crystallinity of the anatase phase using 0.83, 1.66 and 2.50 volume equivalents of PPG is shown in Fig. 8.Although a small increase was observed for band gap when increasing volume equivalents of PPG, a one way analysis of variance (ANOVA) indicated that there was no statistically significant difference in means for band gap, anatase phase, rutile phase and crystallinity of anatase phase.The p-value (p) is the probability that the F-statistic (F) is larger than the computed test-statistic value.A p-value that is more than the significance level (), in this case 0.05, indicates that the means are not significantly different (Fig. 8).This supports the output from the PB model, where the volume of PPG had no statistically significant effect on these responses.Type IV N2 adsorption isotherms were observed for the TiO2 samples prepared using 0.83, 1.66 and 2.50 volume equivalents of PPG, whilst P25 TiO2 exhibited a Type II adsorption isotherm (Fig. 9a).The type IV adsorption isotherms of the 0.83, 166 and 2.50 volume equivalent PPG samples indicated the solids were mesoporous.47 Type I CO2 adsorption isotherms were observed for the TiO2 samples prepared using 0.83, 1.66 and 2.50 volume equivalents PPG and for P25 TiO2 (Fig. 9b).The samples prepared using 0.83, 1.66 and 2.50 volume equivalents PPG increased N2 and CO2 adsorption compared to P25 TiO2 could be explained by the mesoporous solids yielding a higher surface area versus the microporous P25 TiO2.The surface area and maximum CO2 adsorbed increased with volume equivalents of PPG used (Table 3).CO2 adsorption capacity increased with increasing pressure with a maximum found at 0.95 P/P0 for the TiO2 samples prepared using 0.83, 1.66 and 2.50 volume equivalents PPG, whilst the CO2 adsorption capacity decreased with increasing pressure for P25 TiO2 with a maximum capacity at 0.30 P/P0.For the 0.83, 1.66 and 2.50 volume equivalent PPG samples, an increase in CO2 adsorption capacity correlated with an increase in photocatalytic activity for both CO and CH4 production (Fig. 11).).This is likely because a higher CO2 adsorption capacity would increase the probability of CO2 photoreduction as CO2 would be in closer proximity to active sites, especially the (001) anatase facets, on the catalyst's surface. The reaction was attempted twice as Run 1 and Run 2 using 1.66 equivalents of PPG (Fig. 10).For Run 1 and 2 using 1.66 volume equivalents PPG, similar trends were observed for the production of CO and CH4, with Run 1 producing more CO initially and later matching Run 2's CO production.This was confirmed with paired two sample t-tests, where if the calculated t-statistic is greater than the critical value (cv) of the student's tdistribution table, using the degrees of freedom (df) and significance level (), the means are significantly different.Run 1 and 2 yielded statistically equal CH4 production over the entire time range ( 0.05, df 142, t-statistic -0.5735,cv 2.576).Run 1 and 2 yielded statistically equal CO production from 204 minutes ( 0.05, df 40, t-statistic 0.9016, cv 2.704).The coated meshes prepared by the sol-gel method were compared to a mesh coated with reference P25 TiO2.For both CO and CH4 production, P25 TiO2 coated mesh performed better (Fig. 11).The difference in performance could be due to the differences in crystallinity and band gap (Table 4).Increase in band gap has been reported with decreasing crystal size, where the rutile bigger anatase crystallite sizes compared to P25. 5,49 The larger band gap and resulting increase in the number of photons generated by P25 would favor CO2 photoreduction.3 The difference in production could also be due to the difference in coating methods used where the P25 TiO2 was applied to the stainless steel mesh using a slurry coating method versus a dip coating method for the optimised samples.There are examples in the literature that report the influence of carbon impurities introduced during the catalyst's preparation and/or from the coating procedure on the production of both CH4 and CO. 50515253 Future work would include investigating the effects of the coating procedure on the potential false positive production of CH4 and CO.It is also important to note that this was a benchmarking exercise where the sol-gel process was developed to yield catalyst properties that were benchmarked against P25 TiO2.In addition, although not as efficient as P25, the advantage this sol-gel procedure is its coating flexibility, where it could be potentially applied to different supports on a large scale using a spray paint process.Mesh coated with 1.66 volume equivalents PPG produced more CO and CH4 compared to the mesh coated with 0.83 volume equivalents PPG.This is most likely due to the synergistic effects of rutile and anatase where an increase in rutile phase exhibits improved photocatalytic activity.6 The 1.66 volume equivalents PPG sample had 18.1 rutile phase and the 0.83 volume equivalents PPG sample had less with 11.8 rutile phase.In addition, the 1.66 volume equivalents sample had a higher CO2 adsorption capacity (0.36 mmol/g) compared to the 0.83 volume equivalents sample (0.22 mmol/g) where a higher probability exists for the reaction to occur if CO2 is adsorbed onto the catalyst's surface (Table 3). A systematic approach using a PB design was used to efficiently screen seven sol-gel parameters towards a catalyst coating with a high coverage and useful properties for CO2 photoreduction.It was possible using a DOE methodology to develop a sol-gel procedure that could tune band gap, coverage, crystallinity and anatase:rutile ratio for CO2 photoreduction.Moreover, the PB design yielded similar observations made in several publications in as few as fifteen experiments.The best design point (WT2) was further optimized to use less PPG.The lower activity of the sol-gel prepared catalyst coatings to P25 was likely due to larger crystallite size, lower band gap values and the potential effects of false positives from the different coating procedures used.This PB design and protocols developed could be employed towards a variety of catalyst coatings with a wide range of properties. The authors thank the financial support provided by the Engineering and Physical Sciences Research Council (EP/K021796/1), the Research Centre for Carbon Solutions (RCCS) and the James Watt Scholarship properties for CO2 photoreduction is implausible, due to the variation in reagents, catalysts, experimental settings and setups used. wavelength 1.5406 A) and a LynxEye linear detector in reflectance mode.Data were collected over the angular range 5-85 degrees in two-theta in one hour.The Debye-Scherrer equation was used to approximate the crystallite size using the half width maximum height of the most intense peak for the anatase and or rutile phase from the XRD pattern and Eq.5.39 cos () tests CO2 photoreduction tests using coated stainless steel gauge 20 mesh were analyzed by an online gas chromatography (GC).A GC (Agilent, Model 7890B series) with a Hayesep Q column (1.5 m), 1/16 inch od, 1 mm id), MolSieve 13X (1.2 m), 1/16 inch od, 1 mm id), thermal conductivity detector, nickel catalyzed methaniser and flame-ionization detector was used to analyze the samples every four minutes.The experimental rig used is shown in Fig 1.A flow rate of 0.063 ml.min -1 CO2 was sent through a bubbler 20 2.0 C to the reactor overnight to purge the system and saturate the catalyst surface with the reagent gases.The reaction was performed at 36 0.1 C.A UV lamp was used as the light source, light intensity was set at 75 mW.cm - with a wavelength of 365 nm.For comparison to P25 TiO2, stainless steel gauge 20 mesh was coated with P25 via a slurry deposition of P25 and IPA in an ultrasound bath.The coated mesh was then dried at 150 C for 2 hours.Pareto charts of standardized effects, main effects and interaction plots are powerful visualization tools that show visually the results of the PB design.Pareto charts of standardized effects indicate the statistically significant parameters as those that are above the red reference line.The weight of the parameters is also indicated by the length of the plotted bar.The main effects plot indicates the parameters effect between high and low settings.The blue circles (Corner point type) on either side of the line is the mean of the values recorded for the high and low settings.The blue line connects these two points.A line with a steep slope indicates the parameter has a strong effect on the response.The red square indicates the mean of the center points (Center point type) -for this study, three replicate points were performed.The grey dotted line indicates the mean for all of the experiments.An interaction plot has similar features to a main effects plot, but includes the presence of an interaction by two intersecting non-parallel lines.The blue solid and green dotted line show the low and high settings effect respectively on the selected parameter shown on the x-axis of the graph.The two lines show how at high and low settings, how the setting of the interacting parameter changes its effect on the given response. Fig. 1 Experimental rig used for CO2 photoreduction tests Fig. 2 Representative UV-vis absorption plots for the PB samples that yielded bandgaps between 3.13 -3.35 eV.The boxed figure is an example of the direct intercept method used to estimate the band gap for WT2.The UV-vis absorption raw data for all fifteen PB experiments can be accessed in the supplementary section. Fig. 3 (a) Pareto chart of effects showing significance of calcination temperature, holding time and their interaction on the band gap response.(b) Main effects plot showing effect of calcination temperature and holding time.(c) Interaction effect between calcination temperature and holding time Fig. 4 A variety of coating quality and coverage were observed as a result of the parameter settings shown in Table 1.Adaptive or Otsu global thresholding was chosen by eye by comparing the threshold image with the SEM image.The SEM images are shown on the left and the threshold images on the right.The threshold images include x and y axis in pixel units (a) WT10 (b) WT10 -Otsu global thresholding (c) WT5 (d) WT5 -Otsu global thresholding (e) WT2 (f) WT2 -Adaptive thresholding Fig. 6 (a) Pareto chart of effects showing significance of amount IPA, water and the calcination temperature and heating ramp on the ratio anatase:rutile response.(b) Main effects plot showing effects of IPA, water and the calcination temperature and heating ramp on the ratio anatase:rutile response. Fig. 7 Effect molecular weight PPG on: (a) phase fraction (b) crystallinity of anatase phase.A C C E P T E D M A N U S C R I P T Fig. 9 N2 (a) and CO2 (b) adsorbtion isotherms for the samples prepared with different volume equivalents of PPG and reference P25 TiO2 crystallite size for the 1.66 and 0.83 volume equivalents PPG samples having much larger rutile and slightly Fig. 10 CO2 photoreduction reaction repeat tests using 1.66 volume equivalents PPG for production of (a) CO and (b) CH4 A C C E P T E D M A N U S C R I P T 17 Statistical Software (2010).Computer software.State College, PA: Minitab, Inc. Experimental results using a PB design for band gap, catalyst on support coverage, crystallinity of anatase and ratio of anatase and rutile phases. Otsu global thresholding, Adaptive thresholding and ND Amorphous material, no data collected by XRD. BET specific surface area (SSA), pore volume (VTot) and maximum CO2 adsorption recorded for reference P25 TiO2 and TiO2 catalysts prepared using 0.83, 1.66 and 2.50 volume equivalents PPG. Comparison of band gap, crystallinity anatase and rutile between reference P25 TiO2, TiO2 catalyst prepared using 1.66 and 0.83 volume equivalents PPG. Programme at Heriot-Watt University.We are also grateful for the support provided by the Buchan Chair in Sustainable Energy Engineering."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The reaction was attempted twice as Run 1 and Run 2 using 1.66 equivalents of PPG (Fig. 10).For Run 1 and 2 using 1.66 volume equivalents PPG, similar trends were observed for the production of CO and CH4, with Run 1 producing more CO initially and later matching Run 2's CO production.This was confirmed with paired two sample t-tests, where if the calculated t-statistic is greater than the critical value (cv) of the student's tdistribution table, using the degrees of freedom (df) and significance level (), the means are significantly different.Run 1 and 2 yielded statistically equal CH4 production over the entire time range ( 0.05, df 142, t-statistic -0.5735,cv 2.576).Run 1 and 2 yielded statistically equal CO production from 204 minutes ( 0.05, df 40, t-statistic 0.9016, cv 2.704).The coated meshes prepared by the sol-gel method were compared to a mesh coated with reference P25 TiO2.For both CO and CH4 production, P25 TiO2 coated mesh performed better (Fig. 11).The difference in performance could be due to the differences in crystallinity and band gap (Table 4).Increase in band gap has been reported with decreasing crystal size, where the rutile bigger anatase crystallite sizes compared to P25. 5,49 The larger band gap and resulting increase in the number of photons generated by P25 would favor CO2 photoreduction.3 The difference in production could also be due to the difference in coating methods used where the P25 TiO2 was applied to the stainless steel mesh using a slurry coating method versus a dip coating method for the optimised samples.There are examples in the literature that report the influence of carbon impurities introduced during the catalyst's preparation and/or from the coating procedure on the production of both CH4 and CO. 50515253 Future work would include investigating the effects of the coating procedure on the potential false positive production of CH4 and CO.It is also important to note that this was a benchmarking exercise where the sol-gel process was developed to yield catalyst properties that were benchmarked against P25 TiO2.In addition, although not as efficient as P25, the advantage this sol-gel procedure is its coating flexibility, where it could be potentially applied to different supports on a large scale using a spray paint process.Mesh coated with 1.66 volume equivalents PPG produced more CO and CH4 compared to the mesh coated with 0.83 volume equivalents PPG.This is most likely due to the synergistic effects of rutile and anatase where an increase in rutile phase exhibits improved photocatalytic activity.6 The 1.66 volume equivalents PPG sample had 18.1 rutile phase and the 0.83 volume equivalents PPG sample had less with 11.8 rutile phase.In addition, the 1.66 volume equivalents sample had a higher CO2 adsorption capacity (0.36 mmol/g) compared to the 0.83 volume equivalents sample (0.22 mmol/g) where a higher probability exists for the reaction to occur if CO2 is adsorbed onto the catalyst's surface (Table 3)."
  },
  {
    "title": "Conclusions",
    "content": "A systematic approach using a PB design was used to efficiently screen seven sol-gel parameters towards a catalyst coating with a high coverage and useful properties for CO2 photoreduction.It was possible using a DOE methodology to develop a sol-gel procedure that could tune band gap, coverage, crystallinity and anatase:rutile ratio for CO2 photoreduction.Moreover, the PB design yielded similar observations made in several publications in as few as fifteen experiments.The best design point (WT2) was further optimized to use less PPG.The lower activity of the sol-gel prepared catalyst coatings to P25 was likely due to larger crystallite size, lower band gap values and the potential effects of false positives from the different coating procedures used.This PB design and protocols developed could be employed towards a variety of catalyst coatings with a wide range of properties. The authors thank the financial support provided by the Engineering and Physical Sciences Research Council (EP/K021796/1), the Research Centre for Carbon Solutions (RCCS) and the James Watt Scholarship properties for CO2 photoreduction is implausible, due to the variation in reagents, catalysts, experimental settings and setups used. wavelength 1.5406 A) and a LynxEye linear detector in reflectance mode.Data were collected over the angular range 5-85 degrees in two-theta in one hour.The Debye-Scherrer equation was used to approximate the crystallite size using the half width maximum height of the most intense peak for the anatase and or rutile phase from the XRD pattern and Eq.5.39 cos () tests CO2 photoreduction tests using coated stainless steel gauge 20 mesh were analyzed by an online gas chromatography (GC).A GC (Agilent, Model 7890B series) with a Hayesep Q column (1.5 m), 1/16 inch od, 1 mm id), MolSieve 13X (1.2 m), 1/16 inch od, 1 mm id), thermal conductivity detector, nickel catalyzed methaniser and flame-ionization detector was used to analyze the samples every four minutes.The experimental rig used is shown in Fig 1.A flow rate of 0.063 ml.min -1 CO2 was sent through a bubbler 20 2.0 C to the reactor overnight to purge the system and saturate the catalyst surface with the reagent gases.The reaction was performed at 36 0.1 C.A UV lamp was used as the light source, light intensity was set at 75 mW.cm - with a wavelength of 365 nm.For comparison to P25 TiO2, stainless steel gauge 20 mesh was coated with P25 via a slurry deposition of P25 and IPA in an ultrasound bath.The coated mesh was then dried at 150 C for 2 hours.Pareto charts of standardized effects, main effects and interaction plots are powerful visualization tools that show visually the results of the PB design.Pareto charts of standardized effects indicate the statistically significant parameters as those that are above the red reference line.The weight of the parameters is also indicated by the length of the plotted bar.The main effects plot indicates the parameters effect between high and low settings.The blue circles (Corner point type) on either side of the line is the mean of the values recorded for the high and low settings.The blue line connects these two points.A line with a steep slope indicates the parameter has a strong effect on the response.The red square indicates the mean of the center points (Center point type) -for this study, three replicate points were performed.The grey dotted line indicates the mean for all of the experiments.An interaction plot has similar features to a main effects plot, but includes the presence of an interaction by two intersecting non-parallel lines.The blue solid and green dotted line show the low and high settings effect respectively on the selected parameter shown on the x-axis of the graph.The two lines show how at high and low settings, how the setting of the interacting parameter changes its effect on the given response. Fig. 1 Experimental rig used for CO2 photoreduction tests Fig. 2 Representative UV-vis absorption plots for the PB samples that yielded bandgaps between 3.13 -3.35 eV.The boxed figure is an example of the direct intercept method used to estimate the band gap for WT2.The UV-vis absorption raw data for all fifteen PB experiments can be accessed in the supplementary section. Fig. 3 (a) Pareto chart of effects showing significance of calcination temperature, holding time and their interaction on the band gap response.(b) Main effects plot showing effect of calcination temperature and holding time.(c) Interaction effect between calcination temperature and holding time Fig. 4 A variety of coating quality and coverage were observed as a result of the parameter settings shown in Table 1.Adaptive or Otsu global thresholding was chosen by eye by comparing the threshold image with the SEM image.The SEM images are shown on the left and the threshold images on the right.The threshold images include x and y axis in pixel units (a) WT10 (b) WT10 -Otsu global thresholding (c) WT5 (d) WT5 -Otsu global thresholding (e) WT2 (f) WT2 -Adaptive thresholding Fig. 6 (a) Pareto chart of effects showing significance of amount IPA, water and the calcination temperature and heating ramp on the ratio anatase:rutile response.(b) Main effects plot showing effects of IPA, water and the calcination temperature and heating ramp on the ratio anatase:rutile response. Fig. 7 Effect molecular weight PPG on: (a) phase fraction (b) crystallinity of anatase phase.A C C E P T E D M A N U S C R I P T Fig. 9 N2 (a) and CO2 (b) adsorbtion isotherms for the samples prepared with different volume equivalents of PPG and reference P25 TiO2 crystallite size for the 1.66 and 0.83 volume equivalents PPG samples having much larger rutile and slightly Fig. 10 CO2 photoreduction reaction repeat tests using 1.66 volume equivalents PPG for production of (a) CO and (b) CH4 A C C E P T E D M A N U S C R I P T 17 Statistical Software (2010).Computer software.State College, PA: Minitab, Inc. Experimental results using a PB design for band gap, catalyst on support coverage, crystallinity of anatase and ratio of anatase and rutile phases. Otsu global thresholding, Adaptive thresholding and ND Amorphous material, no data collected by XRD. BET specific surface area (SSA), pore volume (VTot) and maximum CO2 adsorption recorded for reference P25 TiO2 and TiO2 catalysts prepared using 0.83, 1.66 and 2.50 volume equivalents PPG. Comparison of band gap, crystallinity anatase and rutile between reference P25 TiO2, TiO2 catalyst prepared using 1.66 and 0.83 volume equivalents PPG. Programme at Heriot-Watt University.We are also grateful for the support provided by the Buchan Chair in Sustainable Energy Engineering."
  }
]