[
  {
    "title": "Doi",
    "content": "10.1016/j.cej.2020.125347"
  },
  {
    "title": "Article_Title",
    "content": "Multifunctional 2D porous g-C3N4 nanosheets hybridized with 3D hierarchical TiO2 microflowers for selective dye adsorption, antibiotic degradation and CO2 reduction"
  },
  {
    "title": "Abstract",
    "content": "2D p-g-C 3 N 4 NSs were hybridized with 3D hierarchical TiO 2 MFs via hydrothermal route. 2D p-g-C 3 N 4 exhibits extraordinarily selective adsorption towards anionic dye. TiO 2 /p-g-C 3 N 4 HAs show enhanced photocatalytic TC degradation and CO 2 reduction. Porous nanostructure, heterojunction and C vacancy cause the boosted photoactivity."
  },
  {
    "title": "Experimental",
    "content": "Melamine, K 2 CO 3 , KCl, NaOH, methyl orange (MO), methylene blue (MB), Rhodamine B (RhB), Tetracycline (TC) and HNO 3 (65 -68) were purchased from Sinopharm Chemical Reagent Co., Ltd.TiO 2 was obtained from Xiya Reagent.Anhydrous methanol, 5,5-dimethyl-1pyrroline-N-oxide (DMPO) and terephthalic acid (TA) were purchased from Adamas-beta Reagent.The above chemical reagents were of analytical grade and used without further purification.Deionized (DI) water was utilized throughout the experiments. Bulk g-C 3 N 4 sample (named as BCN) was synthesized by direct thermal polymerization of melamine and K 2 Ti 6 O 13 sample (named as KTO) was obtained by a facile KCl molten salt method using K 2 CO 3 and TiO 2 as precursors, as described in our previous reports 10,36,40.The 3D/2D TiO 2 /p-g-C 3 N 4 micro-nano HAs were fabricated via a facile acid hydrothermal method.Firstly, a certain amount of the as-prepared KTO and BCN powders were homogeneously dispersed in HNO 3 aqueous solution (6.0 M, 75 mL) by ultrasonication and magnetic stirring at room temperature.Then, the obtained suspension was transferred to a Teflon-lined stainless steel autoclave (100 mL) and subsequently heated in a oven at 140 C for 18 h.After that, the resultant products were filtered and washed with DI water repeatedly to completely remove residual acid.Finally, the obtained sample was dried at 80 C for 12 h.According to the mass ratio of KTO to BCN (1/100, 1/80, 1/50, 1/20), the as-prepared samples were named as TOCN-100, TOCN-80, TOCN-50, TOCN-20, respectively.Pure BCN and KTO samples subjected to the same hydrothermal process were named as HCN and HTO, respectively. Powder X-ray diffraction (XRD) was performed using a Rigaku D/ max-2550 VB/PC diffractometer with Cu-K radiation ( 1.5406A).Thermogravimetric analysis (TGA) was recorded on a Perkin-Elmer (Pyris Diamond) thermal analyzer at a heating rate of 10 C min -1 from 50 to 800 C in air.Scanning electron microscopy (SEM) images and energy dispersive X-ray spectra (EDS) were obtained using Hitachi S-3400, Philips XL30 FEG and NOVANano SEM450 electron microscopes equipped with an EDAX Genesis XM2 detector.Transmission electron microscopy (TEM) images were collected on JEOL JEM-2100 and JEM-2100F electron microscopes operated at 200 kV.Fourier transform infrared spectroscopy (FTIR) was measured on a Nicolet 6700 spectrometer using KBr pellets.Electron paramagnetic resonance (EPR) spectra were recorded on a JEOL FA200 spectrometer at room temperature.Nitrogen adsorption-desorption analysis was measured on a Micromeritics ASAP 2010 surface area and porosity analyzer at 77 K. UV-vis diffuse reflectance spectroscopy (DRS) was performed on a Perkin-Elmer Lambda 950 spectrophotometer equipped with an integrating sphere.X-ray photoelectron spectroscopy (XPS) analysis was conducted on a Thermo ESCALAB 250 photoelectron spectrometer.Photoluminescence (PL) spectra were performed on a Perkin-Elmer LS-55 spectrofluorometer under the excitation at 325 nm.DMPO in methanol was used to detect superoxide (O 2 -) radicals formed during the photocatalytic reactions, and the corresponding ESR spectra were recorded on a Bruker EMX-8/2.7 spectrometer.To capture the formed hydroxyl radicals (OH) in the photocatalytic systems, PL spectra were measured by Shimadzu RF-5301PC spectrofluorophotometer using TA as a probe molecule under the excitation at 315 nm.CO 2 temperature programmed desorption (CO 2 -TPD) was performed using a Micrometrics AutoChem II 2920 instrument. As a typical anionic dye, MO was used to evaluate the adsorption properties of the as-synthesized samples at room temperature.Typically, 10 mg of catalyst was ultrasonically dispersed into 50 mL of MO aqueous solution (10 mg L -1 ) at netural pH and then the suspension was stirred continuously.At a given time interval, ca. 4 mL of suspension was withdrawn and centrifuged, followed by further filtration with a 0.22 m syringe filter (pretreated by MO dye).The concentration of the residual MO was determined using a Lambda 950 spectrophotometer at the maximum wavelength ( max ) of 464 nm, according to the calibration curve between the max absorbance and concentration of MO.The dye removal percentage ( dye , ) and adsorption capacity (q t , mg g -1 ) were calculated by the following equations: where m (g) is the mass of adsorbent; V (L) is the volume of dye aqueous solution; C 0 and C t (mg L -1 ) are the initial concentration of dye solution and dye concentration at contact time t (min), respectively. Photocatalytic tests for TC degradation were performed using a PLS-SXE300 Xe lamp (Beijing Perfectlight Technology Co., Ltd.) equipped with a UV cut-off filter as the visible light source ( 420 nm).Typically, 40 mg of sample was put into 80 mL of TC aqueous solution (C 0 20 mg L -1 ) and then the suspension was magnetically stirred for 1 h in the dark to establish an adsorption-desorption equilibrium between catalysts and TC molecules.The photocatalytic tests were conducted in a customized quartz reactor that was kept at 25C by a flow of cooling water and covered by aluminum foil to enhance light absorption of the reaction sysytem.At a specific time interval, clear TC solution was collected by centrifugation and filtration.The concentrations of TC solutions were measured on the Lambda 950 instrument to calculate the degradation efficiency ( TC , ) based on the equation: where C e and C are the equilibrium and time-dependent concentrations of TC solutions, respectively. The photocatalytic tests for CO 2 reduction were performed in a customized airtight reactor (135 mL) with an optical quartz window at the top.In a typical test, 30 mg of catalyst was uniformly coated on a square quartz plate (2.5 2.5 cm 2 ) and placed at the bottom of the reactor.Prior to light irradiation, the reaction system was flushed by N 2 gas, and then high-purity CO 2 (99.99) was bubbled through DI water for 30 min to fill the reactor with gaseous CO 2 and H 2 O.After that, such a reaction system was allowed to stand for the adsorption-desorption equilibrium between catalyst and CO 2 /H 2 O.A CEL-HXF300 Xe lamp (Beijing China Education Aulight Co., Ltd.) equipped with a 420 nm cutoff filter was employed to provide the visible light irradiation with an average light intensity of 210 mW cm -2 at the upper position of catalyst film (CEL-NP2000 optical power meter, Beijing China Education Aulight Co., Ltd.).The reaction temperature was kept at 15 C using a DC-0506 low-temperature thermostat bath.At each time interval, 1 mL of gas was extracted from the reactor and quantified by a Shimadzu GC-2014 gas chromatography equipped with a flame ionization detector (FID).The reduction products was quantified by the external standard with a calibration curve. The PEC tests were performed by an electrochemical workstation (Solartron 1260/1287) in a standard three-electrode quartz cell using a saturated Ag/AgCl electrode, a Pt plate and the catalyst film deposited on an ITO substrate as reference electrode, counter electrode and working electrode, respectively.Before each test, the working electrode was immersed in the electrolyte (1.0 M NaOH, pH 13.6) until the open-circuit potential (V oc ) reached a steady state.The Electrochemical impedance spectroscopy (EIS) was recorded with AC amplitude of 10 mV at a frequency range of 100 kHz 0.1 Hz under light irradiation.The V oc , linear sweep voltammagrams (LSV), transient photocurrent responses and EIS were measured with the working electrodes irradiated from their back sides to decrease the thickness effect of catalyst films.A 300 W Xe lamp equipped with a 400 nm cutoff filter was used as the visible light source for PEC measurements.The measured potentials vs. Ag/AgCl electrode (E Ag/AgCl ) were converted to the reversible hydrogen electrode (RHE) scale according to the Nernst equation: E RHE E Ag/AgCl 0.059 pH E 0 Ag/AgCl , where E RHE is the converted potential vs. RHE, E 0 Ag/AgCl is 0.1976 V for the Ag/AgCl electrode (saturated KCl) at 25 C."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The lattice structure and phase compositions of the samples were characterized by XRD patterns, as shown in Fig. 1.Evidently, BCN exhibits two typical diffraction peaks at around 12.90and 27.54, indexed to the (1 0 0) and (0 0 2) crystal planes of hexagonal g-C 3 N 4 (JCPDS 87-1526), respectively.After the HNO 3 -assisted hydrothermal treatment, the two diffraction peaks still remain but their intensities decrease to certain extents, suggesting that the basic crystalline structure of BCN has been well maintained in the composites.Noticeably, the weakening of the peak at ca. 12.90(corresponding to the in-plane structural packing motif of aromatic segments) could be ascribed to the slight destruction of conjugated aromatic units by the intense acid-involved hydrothermal reaction.Whereas, the (0 0 2) peak corresponding to the interlayer stacking of g-C 3 N 4 shows a weak shift to a higher 2 value (27.67), suggesting a slight reduction of the interplanar distance from 3.24 to 3.22 A, further indicating the more flattened g-C 3 N 4 layers and narrower interlayer spacing in HCN due to the acidification process.41 Moreover, the decreased intensity of (0 0 2) peak also confirms the exfoliation of the layered structure of BCN.Meanwhile, several relatively weak diffraction peaks at 36.08, 41.22, 54.32, 56.63c an be found for TOCN-100, revealing the existence of tetragonal rutile TiO 2 phase (JCPDS 21-1276).With the increase of KTO dosage, typical diffraction peaks of TiO 2 appear and intensify gradually, which demonstrates the transformation of K 2 Ti 6 O 13 to rutile TiO 2 via the acid hydrothermal reaction, in accordance with our previous studies.6,42 Besides, it is worthy to mention that the by-products with needle-like morphology (Fig. S1) were obtained and mostly adhered onto the surface of Teflon-lined reactor, which could be indexed to cyanuric acid (JCPDS PDF No. 23-1637) according to XRD analysis.This suggests the structural destruction and bond breaking of g-C 3 N 4 frameworks, thereby resulting in the formation of defective and porous structures in the 2D layered g-C 3 N 4 NSs (as illustrated in Fig. 2), as directly proved by SEM and TEM (vide infra). TG analysis was performed to determine the actual TiO 2 contents and the thermal stability of the g-C 3 N 4 -based samples.As shown in Fig. S2, HTO has a slight weight loss of ca.8.34 when the heating temperature increases to 800 C, mainly attributed to the surface adsorbed water, while BCN loses its whole weight rapidly from ca. 560 to 700C by sublimation and/or decomposition.HCN exhibits faster weight loss from ca. 300 to 690C in comparison with pristine BCN, suggesting the weakened thermal stability of HCN due to the formation of porous structures and defects during the exfoliation and etching processes.The composites present the similar TG curves to HCN, while the weight loss of the composites is accelerated at increased TiO 2 contents, probably due to the oxidation of weakened cross-linked g-C 3 N 4 rings by TiO 2activated oxygen in air at the lower temperature, i.e., the intensive interaction between TiO 2 and g-C 3 N 4 .Similar results have been observed on other metal oxide/g-C 3 N 4 heterostructure composites (e.g.CeO 2 /g-C 3 N 4 , 43 Fe 2 O 3 /g-C 3 N 4 , 44 In 2 O 3 /g-C 3 N 4 45).According to the weight remainder, the concentrations of TiO 2 in TOCN-100, TOCN-80, TOCN-50 and TOCN-20 are estimated to be ca.1.07, 2.69, 4.63 and 8.66, respectively. The morphology and microstructures of the as-synthesized samples were observed by SEM, as shown in Fig. 3. KTO has a characteristic 1D noodle-like nanostructure with a length-to-diameter ratio higher than 20.(Fig. 3a) and HTO shows a unique 3D microflower architecture Fig. 2. Structural evolution of g-C 3 N 4 bulks during the acid hydrothermal process.assembled by 1D NBs (Fig. S3), consistent with our previous studies.6,10,42 As shown in Fig. 3b, BCN displays typical packed layered structures with a rather large planar particle size of up to 5 m.While g-C 3 N 4 bulks are corroded and exfoliated after the acid hydrothermal treatment, leading to the formation of porous architectures (including NSs and nanotubes) with hierarchical morphology in the resultant HCN (Fig. 3c andd).Moreover, the wrinkled NSs with an average thickness below 100 nm demonstrates a remarkable decrease in particle size.The above observations could signify the increased specific surface area and pore volume of HCN.From Fig. 3e, it can be seen that TOCN-100 exhibits a typical 2D sheet-like morphology and several fragmentary TiO 2 MFs are present on the surface of g-C 3 N 4 sheets.Meanwhile, as shown in Fig. 3f andg, flower-like TiO 2 particles are closely embedded into g-C 3 N 4 nanoarchitectures those are composed of numerous compact nanotubes and ultrathin NSs, implying intimate contact interfaces are formed.Compared with TOCN-100, more characteristic and intact TiO 2 MFs can be observed in TOCN-80 and numbers of flower-like TiO 2 particles assemble together into larger hierarchical clusters (Fig. 3h-j), due to the increased dosage of KTO precursors.More importantly, the formed 3D TiO 2 microstructures are tightly integrated on the surface of 2D g-C 3 N 4 NSs, implying an intimate contact interface.In the case of TOCN-50 (Fig. 3k) and TOCN-20 (Fig. 3l), there are 1D nanostructures (i.e., KTO nanobelt residues) in the TiO 2 /p-g-C 3 N 4 composites, suggesting that the adding amount of K 2 Ti 6 O 13 NBs is too high to obtain typical and uniform TiO 2 MFs under current experimental conditions.Noticeably, the g-C 3 N 4 products in TOCN-20 still possess typical porous characteristics, indicating that the introduction of KTO doesn't destroy the transformation of g-C 3 N 4 from bulks to 2D porous NSs.Whereas, the presence of BCN in hydrothermal environment suppressed the nanobelt-to-microflower morphology evolution since pure TiO 2 MFs could be obtained in the absence of BCN under current conditions.6,42 Even so, the residual 1D nanobelt-like structures in the composites could be assigned to TiO 2 phase since no K 2 Ti 6 O 13 signals were detected by XRD (Fig. 1) and EDS (Fig. S4).Additionally, the elemental mapping images (Fig. 3m) clearly reveal that the flower-like microstructures adhered to the surface of g-C 3 N 4 matrix are TiO 2 products, further revealing the formation of closely combined TiO 2 /g-C 3 N 4 composite structures. To further investigate the formation of 3D TiO 2 /2D p-g-C 3 N 4 HAs, the samples before and after the hydrothermal treatment were characterized by TEM.Fig. 4a andb clearly show the morphological evolution from 1D K 2 Ti 6 O 13 NBs to 3D TiO 2 MFs along with the increase in particle size, which suggests that the NBs most probably aggregate together with each other during the phase transformation from K 2 Ti 6 O 13 to TiO 2 .As for HCN, Fig. 4c displays the characteristic 2D g-C 3 N 4 NSs with ultrathin layered structures and numerous surface pores (average diameter 20 nm), which can be attributed to the chemical oxidization and etching effects in acid hydrothermal environment.As compared to the typical p-g-C 3 N 4 NSs (Fig. 5c), the g-C 3 N 4 products shown in Fig. 4d (and Fig. S5) have a thicker and more aggregated 2D layered structure with rough surface and abundant irregular pores.Fig. 4c and4d show the two kinds of representative morphology of the hydrothermally prepared g-C 3 N 4 nanomaterials with 2D sheet-like structure and surface porous characteristics.As shown in Fig. 4e, thick flowerlike TiO 2 clusters are decorated and bounded with light p-g-C 3 N 4 NSs.Importantly, TiO 2 MFs and p-g-C 3 N 4 NSs are intimately connected with each other at the interfaces, which offers direct channels for efficient transfer and separation of charge carriers, thus expectedly enhancing the photocatalytic activity. N 2 sorption analysis was also conducted to determine the textural properties of the as-prepared samples.As displayed in Fig. 5, all the samples present type IV isotherms with H3 hysteresis loops at a relative pressure range between 0.5 and 1.0, which is indicative of mesoporous structures.And also, the BJH pore-size distribution plots (inset) can further prove the mesoporous characteristics with a main pore size of ca.2-80 nm.As shown in Table S1, according to the Brunauer-Emmett-Teller method, the specific surface area (S BET ) of HCN is determined to be 54.65 m 2 g -1 , nearly 5.0 times that of BCN (11.26 m 2 g -1 ), which can be attributed to the formation of nanoarchitectures assembled by NSs and nanotubes with abundant pores through the acid hydrothermal process.However, after the incorporation of 3D TiO 2 MFs, S BET of the composites decreases, which is likely associated with the blocking of the porous structures of g-C 3 N 4 nanoarchitectures by certain TiO 2 particles.Even so, the composites have a much higher S BET and pore volume than BCN.The elevated surface area and the pore-rich structures will promote the reactant adsorption and photocatalytic performance via providing more surface active sites and accelerating diffusion and mass transportation of reactants. The above morphological and structural evaluations of KTO and BCN indicate that such a one-pot acid hydrothermal route is an alternative and effective strategy to fabricate metal oxide/p-g-C 3 N 4 HAs.Correspondingly, the formation mechanism for the 3D TiO 2 microflower/2D p-g-C 3 N 4 nanosheet hybrids was proposed and illustrated in Fig. 6.Firstly, K 2 Ti 6 O 13 NBs were mixed homogenously with g-C 3 N 4 bulks via ultrasonic treatment under vigorous stirring.Then, a series of phase transformation and crystal growth processes from K 2 Ti 6 O 13 NBs to TiO 2 MFs was initiated in the acid hydrothermal environment 42.Simultaneously, the exfoliation and etching of g-C 3 N 4 bulks took place, resulting in the production of smaller 2D particles with pores and defects.Ultimately, the grown 3D TiO 2 MFs were closely deposited on the surface of 2D p-g-C 3 N 4 NSs, leading to the formation of micro-nano TiO 2 /p-g-C 3 N 4 HAs with intensive and well-connected interfaces.Of note, the observed tubular g-C 3 N 4 nanostructures (in SEM images) during the morphological evolution process could originate from the agglomeration and rolling of g-C 3 N 4 NSs. The chemical bonding features of the samples were determined by FT-IR (Fig. 7a andb).All the samples show three bands at ca. 810 cm -1 , 1200-1700 cm -1 and 2900-3500 cm -1 , corresponding to the breathing mode of tri-s-triazine units, stretching vibrations of carbon nitride heterocycles and the typical vibrations of N-H and O-H bonds from the uncondensed amino groups and absorbed H 2 O molecules, respectively 15,20,28,32,36,37,41,45, suggesting that g-C 3 N 4 is the main component and its primary framework has been well maintained after the acid hydrothermal treatment and incorporation of TiO 2 MFs.However, the sharp band of g-C 3 N 4 at ca. 808 cm -1 exhibits a slight red-shift to 810 cm -1 , suggesting certain chemical changes in the tri-s-triazine ring structures, most likely associated with the formation of C vacancies.Meanwhile, compared with BCN, HCN and the composites (such as TOCN-100) show stronger and sharper band at 2900-3500 cm -1 , indicating the increase of amino group amount and the possible generation of C vacancies in g-C 3 N 4 frameworks since the unsaturated N atoms would be compensated by H atoms and thereby generate N-H groups 32.According to SEM and TEM results, large numbers of ultrathin p-g-C 3 N 4 NSs and other smaller fragments were generated after the acid hydrothermal treatment, implying the generation of additional surface defects compared to their original bulk counterparts 31.This hypothesis was further proved by EPR analysis.As shown in Fig. 7c, BCN has a Lorentzian line centered at g 2.003, corresponding to the unpaired electrons originating from the C atoms of the triazine rings.Compared to BCN, HCN exhibits a much weaker ESR signal, suggesting the decrease of unpaired electrons due to the loss of C atoms, i.e. the formation of C vacancies 31,32,46,47.In general, C vacancies are preferentially formed in acid solution instead of N vacancies, because C atoms are lighter than N atoms and heptazine units (C 6 N 7 ) are more stable than s-trizaine units (C 3 N 3 ) 19. Additionally, the surface elemental composition and chemical states of the materials were also determined by XPS.As shown in Fig. 7d, the XPS survey spectra reveal that all the samples contain C, N and O elements.The O 1 s peak of BCN centered at ca. 532.3 eV corresponds to the surface adsorbed H 2 O/CO 2 .Notably, the O1s peak of HCN at ca. 532.0 eV is much stronger than that of BCN (in Fig. S6), suggesting that 19,21222348.To a certain extent, the improved surface adsorption of CO 2 and H 2 O (or hydroxyls) would be beneficial for photocatalytic CO 2 reduction and the production of reactive radical species for pollutant degradation.Besides, a relatively weak Ti 2p peak was detected for TOCN-80 (inset of Fig. 7d), which could be deconvoluted into two sub-peaks at 458.42 eV (Ti 2p 3/2 ) and 463.44 eV (Ti 2p 1/2 ), confirming the existence of Ti 4 ions 36,49 of rutile TiO 2 phase in TOCN-80.High-resolution C1s spectra of BCN and HCN in Fig. 7e could be fitted into two components at ca. 284.8 eV and 288.3 eV, assigned to adventitious carbon (C-C, usually used as standard reference carbon for XPS analysis) and the sp 2 -bonded carbon in the N-C N coordination 41.After acid hydrothermal treatment, the area ratio of the C 1 s peak at 288.3 eV to that at 284.8 eV decreased from ca. 2.55 (BCN) to 2.04 (HCN).Such a decrease in area ratio was indicative of the reduction of tertiary carbon atoms, suggesting the formation of C vacancies in g-C 3 N 4 frameworks.31,46 High-resolution N 1 s spectra of BCN display four peaks, as shown in Fig. 7f.The main peak centered at 398.7 eV can be ascribed to sp 2 hybridized nitrogen (C-N C) in triazine rings, while the peak at 399.8 eV is assigned to the tertiary nitrogen bonded to carbon atoms, i.e., N-(C) 3 50.The peak centered at 401.3 eV corresponds to amino groups (-NH 2 ) 31, and the peak located at 404.5 eV is associated with the charging effects or positive charge localization in heterocycles 41,50.The area ratio of two N 1 s peaks in amino groups to the sp 2 -bonded N increases from 0.15 (BCN) to 0.29 (HCN), suggesting a substantial increase in the number of -NH 2 due to the loss of tertiary carbon, which further supports the existence of C vacancies in p-g-C 3 N 4 .Moreover, the aminorelated N peak of HCN is centered at a lower binding energy in comparison with that of BCN, likely associated with the formation of C vacancies and terminal amino groups.The generation of surface defective sites could enhance the visible-light absorption and charge separation efficiency, 31,46 thus significantly benefiting the improvement of photocatalytic performance. To investigate the optical absorption, electronic structure and photoelectric properties, UV-vis DRS, PL and XPS valence band (VB) spectra were carried out.As shown in Fig. 8a, BCN exhibits typical absorption from UV to visible range ( 500 nm) and the absorption edge onset at ca. 465 nm corresponds to the intrinsic band gap of pure g-C 3 N 4 .HCN shows a similar profile to BCN due to their same phase composition.Whereas, as compared with BCN, the absorption edge of HCN shows a slight blue-shift in the range of ca.400 450 nm, because of the quantum confinement effect derived from the nano-particle sizes and decreased conjugation length caused by the acid etching and exfoliation.23 Particularly, the absorbance of BCN at UV and visible light region is enhanced after acid hydrothermal treatment, which can be attributed to the reduced light scattering due to the porous microtexture of HCN 51 and the formation of C vacancies 31,46, respectively.HTO shows light absorption mainly in the UV range with an energy band gap (E g ) of 2.99 eV (Fig. S7), very close to the values in our previous report.6 Interestingly, the introduction of TiO 2 leads to an increased visible light absorption with an apparent tail from 450 nm to 600 nm of the composite, which could be mainly ascribed to the interaction between 3D TiO 2 MFs and 2D p-g-C 3 N 4 NSs, 52 further signifying the construction of interfacial TiO 2 /p-g-C 3 N 4 heterostructures.Noticeably, a weak peak at around 560 nm appears for the hydrothermally treated g-C 3 N 4 -based samples, which could be mainly attributed to the existence of feeble C-vacancy defects in 2D p-g-C 3 N 4 frameworks since the possible by-products (cyanuric acid) have no light absorption in this region (Fig. S8).According to Tauc plots (inset of Fig. 8a), the E g of BCN and HCN can be determined to be 2.77 eV and 2.79 eV, respectively.XPS VB spectra were measured to further determine the electronic band structure of BCN and HCN.As shown in Obviously, the band-edge positions of HCN could trigger various redox reductions including water splitting, CO 2 reduction and the generation of reactive radicals for pollutant degradation.Notably, the small difference in CB between BCN and HCN could be ascribed to the formation of feeble C vacancies since the CB of CN is predominated by C 2p orbitals.Thus, the more negative CB of HCN (in relative to that of BCN) could endow it with stronger reduction ability for the generation of reactive radicals towards pollutant degradation and the conversion of CO 2 gas into hydrocarbon fuels.In addition, PL spectra (shown in Fig. 8d) were employed to evaluate the recombination/separation behaviors and lifetime of charge carriers in the light-excited catalyst samples.55 Firstly, it can be seen that the emission peak of HCN has blue-shifted from ca. 465 to 460 nm in comparison with BCN, mainly due to the formation of smaller particles with porous nanoarchitectures in HCN, which is consistent with UV-vis DRS results.In general, the lower PL emission peak the higher separation efficiency of photogenerated electron-hole pairs.Evidently, HCN and its composites exhibit the weaker emission intensity than BCN, which is characteristic of the remarkable increased charge separation efficiency in g-C 3 N 4 materials after the acid hydrothermal treatment.Thus, TOCN-80 with the lowest PL emission peak implies the possibly highest photocatalytic performance.From the above results, it can be concluded that, not only the morphological features but the electronic band structures of g-C 3 N 4 have been successfully tailored via the acid hydrothermal process, which would naturally promote the surface adsorption, photocatalytic and photoelectrochemical performances. Organic dyes including MO, MB and RhB were employed as model pollutants to evaluate the adsorption performance.As displayed in Fig. 9a andb, pristine BCN shows no significant adsorption for MO in aqueous solution (q t 1.0 mg/g).Interestingly, after the acid hydrothermal process, HCN and the composites exhibit excellent adsorption capacity towards anionic MO dye.Taking HCN for example, the dye removal percentage quickly increases within the first 15 min, and then rises slowly to a nearly saturation point (43.66 mg g -1 ) at 60 min (the maximum adsorption capacity q e of MO on HCN is 46.75 mg g -1 at 6 h).Noticeably, the adsorption capacity of the composites decreases gradually with the increase of TiO 2 content, highlighting that p-g-C 3 N 4 is the dominant component for the dye adsorption.In addition, the effects of initial MO concentration and catalyst dosage on the adsorption process were also investigated, as shown in Fig. S9.Obviously, the removal efficiency of MO increases at elevated amounts of catalyst and decreased MO concentration, which can be attributed to the increased surface area and more available surface adsorption sites (amino groups and defect sites).26,27 As displayed in Fig. 9c, UV-vis spectra of MO solutions decline without any peak shift ( max 464 nm) and the color of TOCN-80 powders changes from light yellow to orange due to the surface captured MO dyes, suggesting that MO adsorption should be a physical process without the generation of new molecular products.Fig. 9d and e display the UV-vis spectra of MO/MB and MO/RhB mixtures before and after adsorption treatment by HCN, which clearly reveals the superior selective MO adsorption performance of the hydrothermally treated p-g-C 3 N 4 catalysts.Thus, it could be inferred that the electrostatic attraction between HCN and anionic dyes is the main driving force for MO adsorption, which has been further confirmed by zeta potential measurements.As shown in Fig. 9f, the HNO 3 -involved hydrothermal treatment has changed the surface charge of BCN from negative (-17.6 mV) to positive (41.2 mV), thus resulting in the excellent selective adsorption towards MO.In comparison with HCN, the lower adsorption capacity of composites could be attributed to their more positive zeta potentials as well as the reduced surface areas and pore volumes.Overall, the stronger adsorption ability of p-g-C 3 N 4based samples than BCN could be derived from the synergistic effects of surface positive charges and more abundant porous structures.The comparison of adsorption capacity of MO dye is shown in Table S2, which suggests that the as-designed 2D p-g-C 3 N 4 nanomaterials (HCN) have higher adsorption capacity than most of the adsorbents reported in recent literature.Therefore, the high adsorption capacity with unique anionic dye selectivity will make HCN as a promising adsorbent and photocatalyst for efficient wastewater purification. The potential application of the designed photocatalysts in wastewater treatment was evaluated by TC degradation under visible light irradiation ( 420 nm).As shown in Fig. 10a, HCN and its composites exhibit higher adsorption capacity than BCN towards TC antibiotic in dark, mainly ascribed to their improved porous texture and more exposed adsorptive sites due to their increased S BET and pore volumes.Moreover, the photocatalytic performance of BCN is also significantly enhanced after the acid hydrothermal process and TOCN-80 shows the highest photocatalytic performance for TC degradation.The visible-light photocatalytic activity of TOCN-50 and TOCN-20 is inferior to that of HCN, largely due to the reduced light adsorption and impeded construction of heterostructures by excessive TiO 2 .Even though, their photoactivities are still much higher than that of BCN.To quantitatively determine the reaction kinetics for TC degradation, the results in Fig. 10a were fitted by the equation: -ln (C/C e ) kt, in which k and t represent apparent reaction rate constant (min -1 ) and light irradiation time (min), respectively.As shown in Fig. 10b, the k values of the p-g-C 3 N 4 -based samples are much higher than that of BCN, and especially TOCN-80 with optimal TiO 2 content has the highest k value (0.0317 min -1 ), around 6.9 and 1.3 times that of BCN (0.0046 min -1 ) and HCN (0.0248 min -1 ), respectively, which can be mainly attributed to the boosted adsorption/diffusion of reactants, enhanced light absorption and elevated charge separation efficiency.The UV-vis spectra of TC solutions shown in Fig. 10c reveal that the characteristic peak intensity of TC at 357 nm decreases quickly with prolonging irradiation time (within 1 h), indicating the decomposition of TC molecules into a series of intermediate products (small organic and inorganic molecules or ions) via photocatalytic oxidation reactions.6 To evaluate the stability and reusability of the TiO 2 /g-C 3 N 4 composites, the cycling runs of photocatalytic tests using TOCN-80 were performed.As shown in Fig. 10d, no significant decrease in TC can be found in the second run (82) and the TC still remain at a relatively high value (68) in fourth run.We suppose that the mass loss during the sample collection and the reaction residues on the surface of photocatalysts could be mainly responsible for the reduced performance.Furthermore, the typical HAs built by 2D p-g-C 3 N 4 NSs and 3D TiO 2 MFs are still preserved in the used TOCN-80 sample and meanwhile no obvious difference can be found between the XRD patterns of TOCN-80 before and after photodegradation tests, as shown in Fig. S10.The above results are consistent with our previous studies, 36,38,39,56 suggesting that p-g-C 3 N 4 -based composites are a kind of stable photocatalysts for wide applications and particularly the 3D/2D micro-nano TiO 2 /p-g-C 3 N 4 HAs possess excellent visible-light photocatalytic performance for antibiotic degradation. In general, the photocatalytic degradation of organic pollutants over the g-C 3 N 4 -based photocatalysts was strongly dependent on the generation of reactive radicals (such as relative to HCN, mainly originating from the promoted charge separation via TiO 2 /p-g-C 3 N 4 heterojunctions.Additionally, the PL emission intensity of TA solutions in the presence of the catalyst samples follows the sequence of TOCN-80 HCN BCN (Fig. S11b), highlighting the contributions of semiconductor heterostructures, porous nanoarchitectures and C vacancies to the production of OH radicals and thus the enhanced photocatalytic performance. Apart from the oxidative decomposition of TC antibiotic, the photocatalytic performance was also evaluated by CO 2 reduction.Firstly, the controlled blank experiments suggest that the co-presence of light irradiation and catalyst samples are necessary for photocatalytic CO 2 reduction and the carbon source of CO and CH 4 is CO 2 rather than g-C 3 N 4 .Fig. 11a shows the evolution of CO over the as-synthesized samples under visible light irradiation ( 420 nm) in 4 h, and the corresponding CO production rate was fitted for photoactivity comparison.As shown in Fig. 11b, the average CO production rate of BCN and HCN are 0.417 and 0.698 mol g -1 h -1 , respectively, suggesting a remarkably increased CO 2 -to-CO conversion efficiency after acid hydrothermal treatment.HTO exhibits the lowest CO yield rate (0.209 mol g -1 h -1 ) due to its wide E g , while its weak visible-light photoactivity for CO 2 reduction could be related to the structural defects formed in the acid hydrothermal environment (inset of Fig. S7).After a hybridization process, the TiO 2 /p-g-C 3 N 4 samples exhibit stronger photocatalytic performance for CO generation than HCN and HTO, highlighting the synergistic effects between p-g-C 3 N 4 nanostructures and TiO 2 MFs.For instance, the CO production rate of TOCN-80 is 0.974 mol g -1 h -1 , which is nearly 1.4-and 4.7-fold that of HCN and HTO, respectively.However, the photocatalytic CO 2 -to-CO conversion reaction over TiO 2 /p-g-C 3 N 4 composites will be markedly inhibited by excessive TiO 2 , in accord with the photocatalytic reactions for TC degradation.Especially, TOCN-20 exhibits the lowest photocatalytic performance among the composite samples, which is even inferior to the original BCN.According to the detection results by GC, the main carbonaceous products under current experimental conditions are CO and CH 4 .Moreover, the yield of CH 4 is much lower than that of CO, especially for the p-g-C 3 N 4 -based catalysts (Fig. 11c).The total CH 4 yields within 4 h of light irradiation over the samples following the order of TOCN-100 HTO TOCN-80 HCN TOCN-50 TOCN-20 BCN.Obviously, HTO has a relatively high photocatalytic activity for CH 4 generation, which can be responsible for the higher CH 4 yield over the composites than BCN.In addition to the extraordinarily high photocatalytic performance for CO 2 reduction, TOCN-80 also possesses an excellent selectivity towards CO production (beyond 95).Considering that the photocatalytic reaction for CO 2 reduction is highly dependent on the adsorption and activation of CO 2 over the photocatalysts, CO 2 -TPD measurements were also carried out.As shown in Fig. 11d, the TPD profiles contain two major desorption peaks.The peak at lower temperature of around 100 C can be assigned to CO 2 physical adsorption, probably derives from the weakly adsorbed CO 2 by surface OH groups on catalysts 58.Meanwhile, it can be seen that the desorption temperature of BCN (89 C) is lower than that of HCN (107 C), indicating that CO 2 molecules are more powerfully adsorbed on 2D p-g-C 3 N 4 nanomaterials in relative to pristine g-C 3 N 4 bulks 47,50.The other peak centred at 300 C can be attributed to the chemisorption of CO 2 , and HCN exhibits a much higher desorption peak than BCN, meaning a remarkably increased CO 2 adsorption capacity on g-C 3 N 4 with stronger interactions after the hydrothermal treatment 59,60.The higher CO 2 adsorption ability on HCN can be mainly explained by two facts: the improved porous microtexture with larger surface area; the increased basic sites due to the new-formed N-H groups in HCN with surface C vacancies 47.Therefore, it can be inferred that the significantly enhanced CO 2 adsorption and activation will play an indispensable role in improving the photocatalytic performance for CO 2 reduction. As a key factor of influencing the photocatalytic activity, the separation efficiency of photogenerated electron-hole pairs in light-illuminated photocatalysts was evaluated in detail by PEC measurements 10,55.Fig. 12a dsiplays the V oc plots of the as-prepared photoelectrode samples recorded under chopped visible-light irradiation.In the dark, it is evident that the V oc values are relatively stable, indicating an electronic equilibrium between semiconductor film and the electrolyte.Once exposed to the visible-light irradiation, V oc immediately exhibit a negative and steep increase, originating from the accumulation of photogenerated electrons.Moreover, V oc nearly reaches a steady state in 20 s as a result of the competition between the electron accumulation and charge recombination within the catalyst film, leading to the formation of a photovoltage (V oc ).Generally speaking, the larger V oc (98, 120 and 136 mV for BCN, HCN and TOCN-80, respectively) is, the more efficient charge transfer and separation, i.e., the stronger PEC perforamnce.Thus, it could be inferred that the charge separation efficiency and PEC activity of the samples should follow the sequence of TOCN-80 HCN BCN.The transient photocurrent responses of the three photoelectrodes at 1.23 V vs. RHE under intermittent light irradiation are shown in Fig. 12b, revealing the highest photocurrent value of TOCN-80 electrode in comparison with HCN and BCN, further supporting the above inference for V oc results.As shown in Fig. 12c, the EIS Nyquist arc radius of TOCN-80 is obviously smaller than that of HCN and BCN, indicating the higher charge separation efficiency of TOCN-80.The above results can clearly demonstrate the remarkably boosted charge separation in TiO 2 /p-g-C 3 N 4 (TOCN-80) compared with individual p-g-C 3 N 4 nanostructures (HCN) and g-C 3 N 4 bulks (BCN), which is in good agreement with their photocatalytic performance.Furthermore, the PEC performance of the representative TOCN-80 photoelectrode was also evaluated by LSV curves in Fig. 12d, which suggests the highly sensitive PEC responses of the designed TiO 2 /p-g-C 3 N 4 micro-nano HAs under visible light irradiation and their application prospects in solar-driven PEC water splitting. Based on the above textural, optical, electronic energy band and PEC results, the enhanced photocatalytic properties of the TiO 2 /p-g-C 3 N 4 micro-nano HAs could be mainly attributed to the synergy between 3D hierarchical TiO 2 MFs and 2D TiO 2 /p-g-C 3 N 4 NSs, including promoted surface adsorption and mass transfer/diffusion, increased light absorption and utilization efficiency, and especially the higher charge transfer and separation rate, based on the formation of TiO 2 /pg-C 3 N 4 heterostructures with porous structures and C-vacancy defects. Possible mechanism for the improved photocatalytic perforamnce and the charge transfer behaviors across the heterojunction interfaces are illustrated in Fig. 13. Firstly, the CB and VB positions of TiO 2 MFs have been determined to be -0.97 and 2.02 V (vs.NHE, pH 7) based on the UV-vis DRS (Fig. S5) and XPS VB results (Fig. S12).The energy band alignment of TiO 2 MFs and p-g-C 3 N 4 NSs suggests a typical type-II heterostructure and thus the difference of chemical potential will result in the formation of a built-in field at the junction interface.Under the light irradiation ( 420 nm), TiO 2 MFs can hardly be excited due to their wide E g (here its weak visible-light absorption is tentatively neglected), while large numbers of photo-induced electrons and holes can be generated in the CB and VB of HCN, respectively.Under the interfacial built-in field, the electrons transferred to CB of TiO 2 MFs, leading to the spatial separation of electron-hole pairs before recombination.As a result, more charge carriers are available to drive the series of redox reactions.According to the analysis of the band structures and redox potentials in Fig. 8c, the production of CO, CH 4 and other important radicals (including O 2 -, OH, H 2 O 2 ) over the light-excited TiO 2 /p-g-C 3 N 4 photocatalysts is thermodynamically feasible.The above heterojunctionpromoted charge separation could be the dominating factor responsible for the elevated photocatalytic performance towards TC degradation and CO 2 reduction.In addition, the number of photogenerated charge carriers increases due to the enhanced light absorption of p-g-C 3 N 4 nanostructures and particularly the surface C vacancies can serve as charge traps to promote the separation of electron-hole pairs, which is also highly significant in clarifying the underlying mechanisms for the enhanced photocatalytic activities."
  },
  {
    "title": "Conclusions",
    "content": "In summary, 2D p-g-C 3 N 4 NSs hybridized with 3D hierarchical TiO 2 MFs were successfully fabricated through a one-pot hydrothermal method using K 2 Ti 6 O 13 NBs and g-C 3 N 4 bulks as precursors.Abundant porous structures, surface C vacancies and interfacial heterojunctions are constructed in the micro-nano TiO 2 /p-g-C 3 N 4 HAs.Interestingly, the hydrothermally produced p-g-C 3 N 4 NSs show excellent selective MO adsorption while the introduction of TiO 2 MFs exhibits a negative effect on their adsorption capability.Importantly, TiO 2 /p-g-C 3 N 4 composites show remarkably enhanced visible-light photocatalytic performances towards both antibiotic degradation and CO 2 reduction.The excellent adsorption and photocatalytic properties of multifunctional 3D/2D TiO 2 /p-g-C 3 N 4 HAs are mainly attributed to the positively charged surface, enlarged surface area and pore volume (more adsorption/active sites), improved light absorption and especially the enhanced charge separation efficiency based on interfacial heterojunctions and surface C vacancies.This work may provide an attractive pathway to design multifunctional g-C 3 N 4 -based composites via the synergy of composition, structure and defect engineering for highly efficient environmental remediation and solar-to-fuel conversion. Fig. 1.XRD patterns of the as-prepared samples in the 2 range of 10-70(a), 11-15(b) and 25.5-29(c). Fig. 3. SEM images of KTO (a), BCN (b), HCN(c, d), TOCN-100(e-g), TOCN-80(h-j), TOCN-50(k) and TOCN-20(l).(m) EDS elemental mapping images of the typical TOCN-80 composites. Fig. 4. TEM images of KTO (a), HTO (b), HCN (c,d) and TOCN-80 (e, f). Fig. 5. N 2 adsorption-desorption isotherms and BJH pore size distribution curves (inset) of the as-prepared samples. Fig. 6.Schematic illustration of the formation mechanism for 3D/2D TiO 2 /p-g-C 3 N 4 micro-nano HAs. Fig. 7. (a, b) FT-IR spectra, (c) EPR spectra, (d) XPS survey spectra and Ti 2p (inset), (e) High-resolution XPS spectra of C 1 s (e) and N 1 s (f) of the as-synthesized samples. Fig. 8. (a) UV-vis DRS and estimated band gaps (inset); (b) XPS VB spectra, (c) Schematic of energy band alignments; (d) PL spectra of the as-prepared samples.Note: E 0 (pH 7) E 0 (pH 0) -0.0597 (V vs. NHE).1 Fig.8b, the VB of both BCN and HCN are ca.2.26 eV, suggesting that the acid hydrothermal treatment has no contribution to engineering the VB of g-C 3 N 4 .The measured VB positions were converted to the normal hydrogen electrode (NHE) scale at pH 7,53,54 and the detailed band structure alignments of BCN and HCN are illustrated in Fig.8c.Obviously, the band-edge positions of HCN could trigger various redox reductions including water splitting, CO 2 reduction and the generation of reactive radicals for pollutant degradation.Notably, the small difference in CB between BCN and HCN could be ascribed to the formation of feeble C vacancies since the CB of CN is predominated by C 2p orbitals.Thus, the more negative CB of HCN (in relative to that of BCN) could endow it with stronger reduction ability for the generation of reactive radicals towards pollutant degradation and the conversion of CO 2 gas into hydrocarbon fuels.In addition, PL spectra (shown in Fig.8d) were employed to evaluate the recombination/separation behaviors and lifetime of charge carriers in the light-excited catalyst samples.55Firstly, it can be seen that the emission peak of HCN has blue-shifted from ca. 465 to 460 nm in comparison with BCN, mainly due to the formation of smaller particles with porous nanoarchitectures in HCN, which is consistent with UV-vis DRS results.In general, the lower PL emission peak the higher separation efficiency of photogenerated electron-hole pairs.Evidently, HCN and its composites exhibit the weaker emission intensity than BCN, which is characteristic of the remarkable increased charge separation efficiency in g-C 3 N 4 materials after the acid hydrothermal treatment.Thus, TOCN-80 with the lowest PL emission peak implies the possibly highest photocatalytic performance.From the above results, it can be concluded that, not only the morphological features but the electronic band structures of g-C 3 N 4 have been successfully tailored via the acid hydrothermal process, which would naturally promote the surface adsorption, photocatalytic and photoelectrochemical performances. Fig. 10.(a) Photocatalytic degradation of TC under visible-light irradiation ( 420 nm) and (b) corresponding first-order kinetic plots.(c) Time-dependent UV-vis spectra of TC solution and (d) stability test for TC degradation in the presence of TOCN-80. Fig. 11.(a) Time-dependent evolution of CO and (b) the average production rate over the as-synthesized samples; (c) Total CH 4 yield after 4 h of light irradiation over the samples.(d) CO 2 -TPD curves of the BCN and HCN samples. Fig. 12.(a) V oc , (b) transient photocurrent responses, and (c) EIS Nyquist plots of BCN, HCN and TOCN-80.(d) LSV curves of TOCN-80. Fig. 13.Schematic illustration of the possible mechanism for enhanced photocatalytic TC degradation and CO 2 reduction over the TiO 2 microflower/p-g-C 3 N 4 nanosheet HAs. The authors gratefully acknowledge the financial support provided by the National Key RD Program of China (2017YFE0127400), National Natural Science Foundation of China (No. 51774145, 51872317 and 21835007) and China Postdoctoral Science Foundation (No. 2019M661644). The authors declare no conflict of interest. Supplementary data to this article can be found online at https:// doi.org/10.1016/j.cej.2020.125347."
  }
]