[
  {
    "title": "Doi",
    "content": "10.1016/j.jphotochem.2016.04.017"
  },
  {
    "title": "Article_Title",
    "content": "Carbon microfiber layer as noble metal-catalyst support for selective CO2 photoconversion in phosphate solution: Toward artificial photosynthesis in a single-compartment reactor"
  },
  {
    "title": "Abstract",
    "content": "Metal catalysts are known to exhibit high selectivity for electrochemical CO 2 reduction reactions only in a bicarbonate solution.Here, high selectivity was realized even in a phosphate solution using a carbon microfiber support for Au and Ag catalysts, and accordingly high selectivity in CO 2 photoconversion was demonstrated in a single-compartment reactor filled with a phosphate solution."
  },
  {
    "title": "Experimental",
    "content": "Dipotassium hydrogen phosphate (Wako Pure Chemical Industries, Ltd.), potassium dihydrogen phosphate (Kanto Chemical Co., Inc.), sodium hydrogen carbonate (Kanto Chemical Co., Inc.), carbon dioxide gas (Taiyo Nippon Sanso), formic acid (88, Kanto), Au, Ag and Pt metal plates (99.9,Kojundo Chemical Laboratory Co., Ltd.), and SUS304 foil (0.06 A 100 A 300 mm, Nilako Co., Inc.) were purchased from the indicated supplier and used as received.Pure water (18 MV cm resistivity) was provided by Direct-Q (EMD Millipore).Triple-junction amorphous silicon (SiGe-jn) on a stainless steel substrate and carbon cloth (CC: EC-CC1-060, Toyo Corp.) were obtained from Xunlight Corp. and Toyo Corp., respectively. CC/metal catalysts were prepared by the sputtering method.Au, Ag and Pt (nominally 10 nm thick) were sputter-deposited on a carbon microfiber cloth.A CC/metal cathode such as SUS/CC/metal was connected to the stainless steel using silver paste (Fig. S1). Electrochemical measurements were performed using an electrochemical analyzer (CHI-620, ALS Co., Ltd.).A CC/metal cathode, silver-silver chloride electrode (Ag/AgCl) and platinum wire were used as working, reference and counter electrodes, respectively.A Pyrex glass cell was used as a reactor, and electrolyte aqueous solutions such as 0.1 M of sodium hydrogen carbonate (NaHCO 3 ) and potassium phosphate buffer (dipotassium hydrogen phosphate potassium dihydrogen phosphate) were used as the reaction solutions.65 mL of electrolyte solution was introduced into the reactor and bubbled with Ar gas for 20 min to remove dissolved air, and then the solution was bubbled with CO 2 gas for 20 min before the experiment.Gaseous reaction products such as CO and H 2 were analyzed using a GC-TCD instrument (Shimadzu GC-14A) with an active carbon column, and the products in the solution were analyzed using an IC instrument (Dionex ICS-2100) with IonPacAS15 and IonPacAG15 columns.The column temperature was maintained at 308 K.A solution of 10 mM KOH was used as the first eluent up to 10 min, and then the eluent was changed gradually to 60 mM KOH over 10 min, followed by a change to 10 mM KOH solution over 3 min.All of the analyses were conducted with possible experimental errors of about AE10. Photochemical measurements were performed using a flow reactor combined with a gas chromatograph (Shimadzu GC-14A).A quartz cell was used as the reactor and 0.1 M potassium phosphate buffer solution was used as an electrolyte.The tablet-shaped IrOx/ SiGe-jn/CC/Au or IrOx/SiGe-jn/Au/CC device was immersed in the solution and CO 2 gas was bubbled into the reactor for 20 min before measurement and allowed to flow at 20 mL min A1 during the measurement.A solar simulator (HAL-320, Asahi Spectra Co., Ltd.) was used as the light source for irradiation from the IrOx side.The intensity was adjusted to 1.5 SUN (AM 1.5) on the surface of the device using a light intensity checker (CS-20, Asahi Spectra Co., Ltd.)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Carbon materials are known to exhibit an excellent ability for CO 2 capture in the gas phase due to their lack of polarity 8,9.Although capturing CO 2 with the aid of triethanolamine and porous coordination polymer-based catalysts is one of the hot topics in photochemical or electrochemical CO 2 reduction, these studies have only been conducted in organic solvents 10,11.Cathodes for electrochemical CO 2 reduction in an aqueous solution were fabricated using carbon and metal catalysts (Fig. S1).Au and Pt (nominally 10 nm thick) were sputter-deposited on carbon microfiber cloth (CC; EC-CC1-060, Toyo Corp.), and attached to stainless steel plates for stabilization.The CC consists of textured fibers (7 mm diameter) with a total thickness of 0.17 mm, and has been previously studied for proton exchange membrane fuel cells (PEMFCs).The back side of the stainless steel (SUS) foil was insulated using a glass substrate.The edges of the cathode were covered with silicone rubber for insulation.Scanning electron microscopy (SEM) observations (Fig. 2) revealed that the Au was concentrated on one side of the CC (Fig. 2a), while no Au was observed at the opposite side (Fig. 2b).Thus, two configurations were adopted for the electrodes: one with the stainless steel attached to the Au side (SUS/Au/CC), and one with the stainless steel attached to the CC side (SUS/CC/Au).Table 1 summarizes the results for the electrochemical CO 2 reduction reaction over these electrodes, which was measured potentiostatically in 0.1 M phosphate buffer bubbled with CO 2 at electrical biases of A1.2 to 1.4 V vs. Ag/AgCl for 1 h.As references, a sputtered 200 nm thick Au film was measured under the same conditions with 0.1 M phosphate buffer (pH 6.4, saturated with CO 2 ) or 0.1 M sodium bicarbonate bubbled with CO 2 (pH 7.3, saturated with CO 2 ) at A1.3 V vs. Ag/AgCl.Here, A1.3 V was applied to the sodium bicarbonate solution because an unstable current was generated at A1.2 V.No carboxylic acids or alcohols were detected after the reaction.The current density through the phosphate system was more than 4 times larger than that in sodium bicarbonate, which is advantageous for achieving higher electrochemical activity. Accordingly, the total amount of products (14.5 and 61.0 mmol of CO and H 2 , respectively) was larger by more than one order of magnitude.However, the CO selectivity was very low compared to that in the sodium bicarbonate solution.The current efficiency for CO was 19.8 in the phosphate buffer, while it was 57.0 in the sodium bicarbonate solution.This is consistent with previous results for electrochemical CO 2 reduction, where bicarbonate solution is highly preferred 12345612.The main reason for the higher CO 2 selectivity in the bicarbonate solution is considered to be the high concentration of carbon species in the aqueous solution, which compete with hydrogen generation by proton reduction, in the form of not only CO 2 , but also as carbonate and bicarbonate, depending on the pH. The CC has the effect of improving the selectivity for CO formation on Au, even in the phosphate buffer solution.The selectivity for CO over an Au catalyst was improved from 19.8 to 39.4 by deposition on CC (SUS/CC/Au) at A1.2 V (vs.Ag/AgCl).The SUS/Au/CC in which Au is covered with CC further improved the CO selectivity in the phosphate buffer from 39.4 to 57.9 at A1.2 V (vs.Ag/AgCl).The highly enhanced CO selectivity over SUS/Au/CC is considered to be due to the suppression of proton diffusion to the Au catalyst by the porous CC.To clarify this, Au was replaced with Pt, a well-known catalyst for hydrogen generation by proton reduction in aqueous solution.The total charge observed and the amount of hydrogen generated over SUS/Pt/CC (5.1C and 23.21 mmol, respectively) were found to be less than those for SUS/CC/Pt (10.1C and 57.42 mmol).This suggests that the porous CC layer suppresses proton diffusion to the underlying metal catalyst, which could explain the high selectivity for the reaction with CO 2 over the Au catalyst.The CC regulates proton diffusion in an aqueous solution, which facilitates the CO 2 reduction reaction at the metal catalyst. We have already reported a highly efficient photocathode for CO 2 reduction to formate that was composed of an amorphous silicon-germanium junction (SiGe-jn) and a Ru-complex catalyst coupled with the CC, which exhibited CO 2 reduction to formate in an aqueous solution under solar irradiation 12.Here, the SiGe-jn was coupled with the Au/CC and Ag/CC to conduct visible lightinduced CO 2 reduction in a phosphate solution (Fig. S2).To fabricate the SiGe-jn photocathode (18 mm A 20 mm), the upper side of the ITO surface on SiGe-jn (wider bandgap side) was attached to a copper wire using copper tape, which was covered with a glass substrate for insulation.The stainless steel side (lower bandgap side) was partially covered with silicone rubber and CC/ metal or metal/CC was connected to the stainless steel using silver paste.All edges of the electrodes were sealed with silicone rubber. The conduction band minimum for the SiGe-jn was evaluated to be A0.52 V (vs.RHE) 12.The photocathodes were immersed in a 0.1 M phosphate buffer solution and an external electrical bias of 0.6 V vs. Ag/AgCl was applied in a 3-electrode configuration.The glass side was irradiated with light from a xenon lamp (MAX-302, Asahi Spectra Co., Ltd., 420 nm filter, intensity ca. 100 mW/cm 2 ) for 1 h.As shown in Table 2, for both Ag and Au, the selectivity for CO formation when the metal catalyst was buried inside the CC was higher than that when the metal catalyst was set outside the CC.The selectivity was improved from 26.1 to 74.9 and from 21.7 to 43.5 for SiGe-jn/Au/CC and SiGe-jn/Ag/CC, respectively.These results indicate that the CC enhances the efficiency of the photoelectrochemical CO 2 reduction reaction in the phosphate buffer. To perform solar CO 2 reduction in a phosphate buffer solution using water as an electron donor without any external electrical bias, a monolithic tablet-shaped device was fabricated with an Au/ CC layer as a CO 2 reduction catalyst, iridium oxide (IrOx) as a water oxidation catalyst, and SiGe-jn as a light absorber.The Au catalyst was sputter-deposited on a porous carbon microfiber cloth (see Fig. S1) and connected to the stainless steel side (lower bandgap side) of the SiGe-jn.An IrOx nanocolloid containing no organic substances was synthesized according to a previously reported method 7 and coated on the ITO surface of the SiGe-jn as shown in Fig. 3.The solar CO 2 reduction reaction was performed using H 2 O as an electron donor and proton source in a singlecompartment reactor filled with a phosphate buffer solution.Fig. 4 shows the time course for the evolution of products under simulated solar light (150 mW/cm 2 , AM 1.5) for (a) IrOx/SiGe-jn/ Au/CC and (b) IrOx/SiGe-jn/CC/Au configurations.In both cases, stoichiometric reactions were indicated because the total amount of reduced products (CO H 2 ) was almost double the amount of O 2 evolved from the oxidation of water.Furthermore, for verification of the CO carbon source, isotope tracer analyses with 13 CO 2 were conducted (Fig. 5), which confirmed that CO was generated from CO 2 using electrons extracted from H 2 O during the oxidation process to produce O 2 . It should be noted that the selectivity for CO evolution is dependent on the position of the Au catalyst.In the IrOx/SiGe-jn/ Au/CC device, in which Au was mounted inside the CC, the amount of CO evolved (33.1 mmol) was greater than that of H 2 evolved (20.8 mmol).The solar-to-chemical energy conversion efficiency for CO evaluated by the change in the Gibbs free energy change was 0.71.In contrast, with the IrOx/SiGe-jn/CC/Au device, in which Au was mounted outside of the CC, the amount of CO (17.2 mmol) was less than that of evolved H 2 (46.1 mmol).These results suggest that the coverage of Au by the CC improved the selectivity for CO 2 reduction, even in the phosphate buffer solution.The CC provides an advantageous reaction environment for metallic CO 2 reduction catalysts, which is probably due to the surface chemistry of the CC where CO 2 molecules are preferentially absorbed, even in an aqueous solution.Another beneficial effect was that the CC prevented the scavenging of conduction band electrons by the O 2 molecules generated in solution, which is clarified in Fig. 4 (no quenching by generated oxygen molecules) and in a previous report 12.Therefore, the CC could be applicable to many metal and complex catalysts for CO 2 reduction.Modification of the CC surface chemistry could further enhance the selectivity for the CO 2 reduction reaction in a phosphate solution.A detailed mechanism at the carbon surface should be elucidated for future construction of more valuable systems for CO 2 reduction."
  },
  {
    "title": "Conclusions",
    "content": "A method for enhancing the selectivity of electrochemical or photoinduced CO 2 reduction in a phosphate buffer rather than a conventional bicarbonate solution was demonstrated.The carbon microfiber layer as a support for the Au or Ag catalyst was the key factor in achieving high selectivity for CO 2 even in a phosphate solution.The selectivity for CO 2 reduction to CO was improved by covering the metal catalysts with the carbon fiber.The carbon acts to suppress the migration of protons to the active sites of the Au catalyst.Solar CO 2 conversion to CO over a monolithic system was realized in a single-compartment reactor in a phosphate buffer solution (pH 6.4, saturated with CO 2 ) with a solar-to-chemical conversion efficiency of 0.71. Fig. 1.Current-potential characteristics of Au catalyst (200 nm) in a NaHCO 3 solution (dash line) and in a phosphate buffer solution (solid line) under CO 2 atmosphere. Fig. 3. Monolithic photodevices for non-assisted solar CO 2 reduction.(a) Au catalyst covered with CC and (b) Au catalyst coated on outer surface of CC. Fig. 4. Time courses of product amounts for CO 2 reduction reaction over monolithic photodevices immersed in phosphate buffer solution containing CO 2 .(a) IrOx/Si/Au/CC and (b) IrOx/Si/CC/Au devices were operated in a one-compartment reactor under illumination with AM 1.5 light.These reactions are nearly stoichiometric. Fig. 5. GC-MS spectra of isotope tracer analyses utilizing (a) 12 CO 2 and (b) 13 CO 2 . Electrochemical CO 2 reduction over various metal-based electrodes measured at A1.2, A1.3 and A1.4 V vs. Ag/AgCl.Aqueous solutions with potassium phosphate buffer (PB) or NaHCO 3 (SHC) were used.In SHC, the electrical bias was A1.3 V. Photoelectrochemical CO 2 reduction in phosphate buffer solution over visible-light irradiated SiGe-jn/metal/CC and SiGe-jn/CC/metal.Applied potential is 0.6 V vs. Ag/AgCl. This work was supported in part by a Grant-in-Aid for Scientific Research on Innovative Areas Artificial photosynthesis (AnApple) from the Japan Society for the Promotion of Science (JSPS).The authors thank Dr. T. M. Suzuki, H. Uchiyama and Y. Matsuoka for fruitful discussions and technical assistance. Supplementary data associated with this article can be found, in the online version, at http://dx.doi.org/10.1016/j. jphotochem.2016.04.017."
  }
]