[
  {
    "title": "Doi",
    "content": "10.1016/j.jcis.2021.12.108"
  },
  {
    "title": "Article_Title",
    "content": "Understanding rich oxygen vacant hollow CeO2@MoSe2 heterojunction for accelerating photocatalytic CO2 reduction"
  },
  {
    "title": "Abstract",
    "content": "h i g h l i g h t sRich O vacant CeO 2 MoSe 2 hollow heterojunction is successful designed.O vacancies trap surface charge carriers effectively.The H-CeO 2 49.7 wt MoSe 2 exhibits much better CO 2 RR performance than CeO 2 and MoSe 2 .The active reduction pathways are investigated by DFT calculation and in-situ infrared technology. g r a p h i c a l a b s t r a c tRich oxygen vacant hollow CeO 2 MoSe 2 heterojunction has been successfully prepared and for accelerating photocatalytic CO 2 reduction.It exhibits excellent photocatalytic activity and high rate performance."
  },
  {
    "title": "Experimental",
    "content": "The preparation of hollow CeO 2 , characterization and photocatalytic experiment are shown in Supporting Information. Se was dissolved in 10 mL hydrazine hydrate solution and stirred for 5 h at room temperature.Then, the aqueous solution of NaMoO 4 (0.2 mmol, 50 mL) was added into the above solution to ultrasound and stir.Subsequently, the prepared H-CeO 2 was poured into the above mixed aqueous solution and stirred for 2 h.And, they were put into the reaction kettle at 200 C for 4 h.The product was centrifuged, washed several times and dried in vacuum at 60 C.The hollow CeO 2 MoSe 2 composite material was obtained.Then, it was placed in a rapid heating furnace and heated at 550 C for 40 min under the condition of H 2 in order to obtain CeO 2 MoSe 2 with rich Vo and hollow structure (H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "DFT calculations are firstly conducted to explore the intrinsic information of the as-obtained products including the possible CO 2 conversion species intermediate and pathways.Compare the structure and Gibbs free energy of H-CeO 2 , MoSe 2 and H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction 30.From the point of view of the reaction path, the COOH group can be formed by H-CeO 2 , MoSe 2 and H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction (Fig. 1a,b,c).But, this step of the H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction (Fig. 1c) requires much less formation energy than that of H-CeO 2 , MoSe 2 (Fig. 1a andb).H-CeO 2 and MoSe 2 need 0.47 eV and 0.36 eV from CO 2 to COOH respectively.However, H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction only takes 0.17 eV, which reduces about half as much Gibbs free energy as the previous two.And thus H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction leads to relatively high activity.The reason may be that the introduction of Vo leads to carrier enrichment.As for the H-CeO 2 and MoSe 2 , the desorption of CO needs 0.06 eV and 0.11 eV, while the hydrogenation of CO needs 0.41 eV and 0.43 eV of energy expenditure, indicating CO 2 is more probably reduced to CO by Pathway I rather than Pathway II.It is noteworthy that H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction.Preliminary evidence shows that the introduction of Vo causes a significant change in the free energy of the reaction pathway.Compared with non-vacant samples, it is easier to generate CH 4 while generating CO.Therefore, this process is of great significance for exploring the mechanism of the selectivity and activity.Once CHO comes into being, it's going to go through the process of hydrogenation, and eventually it's going to form CH 4 .The conversion of CHO to CH 4 on H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction is more thermodynamically favorable than that on H-CeO 2 and MoSe 2 based on the corresponding energy expenditure in each step 31.Meanwhile, the desorption energy of the CH 4 molecules (DE DG (O) A DG (CH 3 O)) on the H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction is much more negative than that on the H-CeO 2 and MoSe 2 .This shows that the CO and CH 4 desorption process is more spontaneous and easier with the exis-tence of abundant Vo 32.All the above results can be concluded, the introduction of Vo might be a suitable strategy for activity CO 2 conversion, since Vo can favor the CO 2 absorption. As shown in Fig. S1, we can see the difference in charge density figure, yellow represents the charge accumulation, blue for charge consumption, after the formation of the interface, the charge of arrangement, charge MoSe 2 surface to surface of H-CeO 2 .In the meantime, in the MoSe 2 , charge accumulation at the Mo atoms, Se atoms to the surface of the adsorbed molecules' adsorption ability, enhances the catalytic activity 33.conductivity of the material.At the same time, the small peak at the (A0.25 eV) position in the band gap is the defect level caused by the vacancies, which plays a role in the charge transfer to reduce the transition energy barrier from the valence band to the conduction band, and further enhances the conductivity 31. Motivated by theoretical calculation results above, we design CeO 2 MoSe 2 of heterojunction with hollow structure and Vo.The phase purity and crystallographic structure of the H-CeO 2 , MoSe 2 and H-Vo-CeO 2 MoSe 2 composite photocatalytic materials in different proportions are studied by the powder X-ray diffraction (PXRD).Fig. 2a shows the PXRD patterns of experimental results.The diffraction pattern has several broad peaks, which appeared at 57.6, 39.3and 33.2, corresponding to the (1 1 0), (1 0 3) and (1 0 0) planes of MoSe 2 (JCPDS No. 29-0914), respectively 34.These peaks indicate that the MoSe 2 material has been successfully synthesized.Besides, the diffraction peaks are relatively sharp and intense, and no impurity peaks, confirming the high purity and crystalline nature of the products.As for H-CeO 2 , the experimental pattern displays several peaks at 2h 28.5,47.3and 56.1, corresponding to (1 1 1), (2 2 0) and (3 1 1) planes of H-CeO 2 (JCPDS No. 34-0394) 33,35.It shows that the method designed for the synthesis of H-CeO 2 is feasible.As can be seen from the PXRD pattern of the composite material H-Vo-CeO 2 MoSe 2 , with the increases of the content of MoSe 2 , the intensity of the diffraction peaks on the corresponding (1 0 0), (1 0 3) and (1 1 0) crystal planes gradually increase, while the intensity of the diffraction peak on the corresponding (2 2 0) crystal plane of CeO 2 gradually decreases 33343529,37.It is also noted that the angles of H-Vo-CeO 2 MoSe 2 composites corresponding to H-CeO 2 and MoSe 2 are shifted to the left, it may be due to H 2 reduction that there are more Vo in the product.According to XPS spectrum, the Ce 4 becomes Ce 3 due to the introduction of oxygen vacancies.In order to keep it electrically neutral, the higher the vacancies concentration results in the greater the number of Ce 3 .The radius of Ce 3 is greater than the radius of Ce 4 .So, the cell of the samples will expand, resulting in lattice distortion and increase of crystal plane spacing (d).Through XRD principle (2d sinh nk), when the crystal plane spacing increases, the h becomes smaller and shifts to the left 35,37383940.Moreover, the PXRD pattern of H-Vo-CeO 2 MoSe 2 shows broad amorphous features no peaks of crystalline phases, which can be ascribed to its lower loading content and the crystallinity of the composite sample becomes worse after calcination.However, these also implying the good dispersion on the H-Vo-CeO 2 MoSe 2 surface. In order to study the vacancies changes of H-CeO 2 49.7 wt MoSe 2 composite photocatalyst before and after H 2 reduction, electron paramagnetic resonance spectroscopy (EPR) is performed on the bit (49.7 wt MoSe 2 ) before and after reduction, and the results are shown in Fig. 2b.They show samples that have not been reduced without a signal where the g value is 1.98.While, the product after H 2 reduction, the signal is significantly enhanced at a g value of 1.98 (Fig. S2).It is proved that the H 2 reduction treatment of H-CeO 2 49.7 wt MoSe 2 , more enriched generation of Vo on the Se surface are obtained, these vacancies should be responsible for this change, which indicating that the vacancies are successfully created 41. The microporosity of H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction is confirmed by N 2 adsorption isotherm at 77 K with a Brunauer-Emmett-Teller (BET) calculate specific surface area (SSAs) of 226.2 m 2 g A1 (Fig. 2c).More active sites will be generated by larger SSAs, which is conducive to the adsorption of CO 2 by the catalyst and improve the contact area to CO 2 , thus the performance of CO 2 reduction is improved.The BET surface area and pore diameter data of other samples are provided in the Fig. 2c.The specific surface area of H-Vo-CeO 2 49.7 wt MoSe 2 significantly greater than H-CeO 2 and MoSe 2 , which further illustrates the design of the hollow type core-shell heterostructure nanomaterial can increase the specific surface area of the material, which is benefit to the improvement of the photocatalytic activity.The N 2 adsorption-desorption curve of H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction (Fig. 2c) is a typical type IV curve with H 3 hysteretic cycle, this is the characteristic of mesoporous materials, which indicates that there are a large number of mesoporous structures in the samples 31,42.A number of pores less than 10 nm are in the samples are seen by the pore-size distribution obtained from the isotherm.Meanwhile, using the BJH method and the desorption branch of the nitrogenisotherm, the calculated pore-size distribution indicates that the H-Vo-CeO 2 MoSe 2 heterojunction contains an average pore size of 9.6 nm (Fig. S3), which proves that it is a mesoporous material, the mesoporous structure of the photocatalyst is not only beneficial to the absorption and utilization of light, but also increases the contact between the photocatalyst and CO 2 43. To investigate the O vacant state, the surface composition and elemental states of H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction, H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction is further investigated by high-resolution X-ray photoelectron spectroscopic (XPS) analysis.The fully scanned spectrum of H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction suggests that the sample consists of Ce, Se, Mo, O and C, this further shows that the target product was successfully synthesized by the SiO 2 template synthesis method.And O 1s is the main peak of O element with the largest intensity, the smallest peak width and the best symmetry, and this peak represents the electron layer to which the electron filling the initial hole belongs, as shown in Fig. S4.O 1s diagram of samples were remade and as shown in Fig. S5.As illustrated in the O 1s XPS spectrum of H-Vo-CeO 2 49.7 wt MoSe 2 , three peaks are observed.The peak located at 527.76 eV (marked as O a ), corresponds to the CeAO bond of H-Vo-CeO 2 49.7 wt MoSe 2 , it was much weaker than that in CeO 2 49.7 wt MoSe 2 , implying the partial loss of O atoms connected with Ce atoms under the solvothermal condition 30,44,45.In addition, the peak at 534.02 eV corresponds to the adsorbed water.Additionally, the peak at a binding energy of 529.23 eV is ascribed to the surface adsorbed oxygen (marked as O b , such O-oxygen vacancies) 464748.It is obvious that the peak centered at 529.23 eV from the XPS spectrum of H-Vo-CeO 2 49.7 wt MoSe 2 is stronger than that in pristine CeO 2 49.7-wtMoSe 2 because of the contribution of rich oxygen vacancies in H-Vo-CeO 2 49.7 wt MoSe 2 .Furthermore, the O 1s peaks in the spectrum of H-Vo-CeO 2 49.7 wt MoSe 2 also shift to lower energies.The area ratio of CeAO in H-Vo-CeO 2 49.7 wt MoSe 2 is smaller than that of pristine CeO 2 49.7 wt MoSe 2 , while the oxygen vacancies in H-Vo-CeO 2 49.7 wt MoSe 2 show an increased area ratio in contrast to those in pristine CeO 2 49.7 wt MoSe 2 .The Ob/Oa value of H-Vo-CeO 2 49.7 wt MoSe 2 is higher than that of CeO 2 49.7 wt MoSe 2 , revealing an increase in surface oxygen vacancies 464748.The enhanced oxygen vacancy concentration in H-Vo-CeO 2 49.7 wt MoSe 2 is ascribed to the reduction of oxygen atoms connected to Ce atoms in H-Vo-CeO 2 49.7 wt MoSe 2 .The peak for C 1 s at 284.8 eV is ascribed to adventitious carbon from the XPS instrument 31.The XPS spectrum (Fig. 2d) for Se 3d shows two peaks in 54.2 eV and 55.1 eV that are assigned to Se 3d 5/2 and Se 3d 3/2 respectively.In Fig. 2e, the peak positions of Mo 3d 3/2 and Mo 3d 5/2 are located at 232.8 eV and 228.3 eV, which is indicative of the reduction of Mo 6 to Mo 4 and the formation of MoSe 2 .As depicted in Fig. 2f, the XPS spectra of Ce 3d measured from H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction, the ten peaks of H-CeO 2 49.7 wt MoSe 2 before H 2 reduction in 880.0 eV88 2.4 eV884.1 eV886.2eV888.7 eV898.4eV900.8eV90 2.9 eV907.1 eV and 912.5 eV.The six peaks in 882.4 eV886.2eV888.7 eV900.8eV907.1 eV and 912.5 eV corresponded to the Ce 3 , other peaks are corresponded Ce 4 , respectively.Before H 2 reduction, the main peaks of the binding energies of Ce 3 3d 3/2 and Ce 3 3d 5/2 appear in 900.8 eV and 882.4 eV, and the main peaks of the binding energies of Ce 4 3d 3/2 and Ce 4 3d 5/2 appear in 907.1 eV and 888.7 eV.Since part of Ce 4 is reduced to Ce 3 , the peak area of Ce 3 increases and the peak is shifted to a larger value 424344454647484950.Considering that the Vo are related to the state of Ce ion, the higher the concentration of Ce 3 , the more Vo exist, and more Vo are introduced into the CeO 2 crystal to compensate for the effective negative charge. The microstructure and compositional distribution of the nanocrystals are further investigated by scanning electron microscopy (SEM), transmission electron microscopy (TEM), highresolution transmission electron microscopy (HRTEM), and energy-dispersive X-ray spectroscopy (EDX).As displayed in Fig. 3a andc, the prepared SiO 2 template and SiO 2 CeO 2 present a sphere-like morphology with a diameter of roughly 200 nm, and the surface of the SiO 2 template sphere is smooth, while the surface of the composite structure is rough.Interestingly, the fractured hollow structure shows that the SiO 2 template has been etched away, the shell is left with a thickness of 15 nm.The surface of the sample also shows the lattice spacing of 0.33 nm and 0.27 nm corresponding to the (1 1 1) and (2 0 0) plane spacing of CeO 2 , the successful recombination of CeO 2 is proved (Fig. S5).The unique hollow shape of the final product H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction is also studied according to Fig. 3b, the surface of CeO 2 is obviously coated with MoSe 2 sheets.At the same time, the morphology of hollow structure CeO 2 does not change significantly, indicating that solvothermal process would not have a damaging effect on the morphology of hollow structure CeO 2 .Fig. 3d exhibits uniformly hollow CeO 2 nanospheres with an average size of 200 nm.Fig. 3e is the TEM image of the H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction.It can be clearly seen that the hollow CeO 2 is covered with laminated MoSe 2 , and the hollow structure has not changed with uniform size distribution.Fig. 3f shows the HR-TEM diagram of the H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction, from which the layered structure and lattice fringes of MoSe 2 can be clearly seen.The product displays a multi-layer crystal strip of no more than four layers.Interestingly, the layer spacing of MoSe 2 is determined to be 1.56 nm, much greater than its inherent (0 0 2) plain face value of 0.64 nm.It is also obvious from region A that heterostructures are formed at the interface between CeO 2 and MoSe 2 .Furthermore, EDX maps exhibit an overlay of element O, Ce, Se and Mo with a clear separation (Fig. 3g,h,i,j,k,i), confirming the core-shell structure.In addition, as can be seen from the above figures, Ce, O, Mo and Se atoms are uniformly dispersed in H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction hollow nanospheres. The active photocatalytic reduction performance of CO 2 over H-CeO 2 , MoSe 2 and H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction is thus evaluated and compared through liquid-gas interface reaction in a system of acetonitrile and triethanolamine without any other electron sacrificial agents under visible light irradiation.As shown in Fig. 4d, the main products of the reaction are two carbon-containing products, CO and CH 4 .It is noteworthy that the CO 2 photoreduction with H-CeO 2 and MoSe 2 as the photocatalysts generated CO as the only product, and the yields of CO are 15.3 and 7.5 lmol g A1 .But for the H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction with the introduced Vo serving as the natural active sites, remarkable CH 4 was generated as the main product besides CO.The composites show significantly enhanced photocatalytic CO 2 reduction activity.With the increase of MoSe 2 content, the reduction performance of CO 2 increases and then decreases.The yield of CH 4 (10.2 mmol) and CO (33.2 mmol) in H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction is the highest.Besides, the yield of H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction is 2.2 times higher than that of the H-CeO 2 and 4.4 times higher than that of MoSe 2 .Meanwhile, this is consistent with the previous characterization results.In order to analyze the generation rates of CO and CH 4 in the process of photocatalytic reduction of CO 2 detailing, the output of CO and CH 4 is graphed with the unit of 0.5 h.The results are shown in Fig. 4(a-c).The yields of CO and CH 4 generated by H-CeO 2 , MoSe 2 and H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction composites are stable, showing a steady increase, and there is no obvious phenomenon of steep increase and sharp decrease in the reaction of 4 h.It can be intuitively seen from Fig. 4(a-c) that CO increases with the growth of time.We know that the reduction products of CH 4 involve more electron transfer and relative energy and are therefore more difficult to produce.However, the CH 4 production of H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction composites increased with time.It can be concluded that the combination of H-CeO 2 and MoSe 2 has an extremely significant effect on improving the photocatalytic reduction of CO 2 performance of H-CeO 2 and the activity of CH 4 . The charge transfer dynamics and the charge separation efficiency of the prepared samples are explored by the steady-state photoluminescence (PL) emission spectra, time-resolved PL decay spectra and the surface photovoltage (SPV) spectra were performed to explore.Fig. 5a is the fluorescence spectra of H-CeO 2 , MoSe 2 and H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction under excitation light at 395 nm.A forced PL emission peak centered at 466 nm could be seen from the spectrum, which is put down to the recombination of self-trapped excitons.And it also can be observed from the spectrum that the fluorescence peaks of H-CeO 2 and MoSe 2 are stronger than other composite photocatalytic materials, indicating that the more electrons that leave the conduction band and recombine with holes, the more photon energy is generated.With the increase of MoSe 2 , the H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction samples exhibit a dramatic change in their optical properties.This may be because H-CeO 2 and MoSe 2 compound to form a heterojunction, which effectively improves the separation rate of photogenerated electron holes 51.Meanwhile, the time-resolved PL decay spectra show that the H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction has a longer average lifetime (s) of charge carriers with respect to the H-CeO 2 and MoSe 2 (Fig. 5b), meaning that there is efficient charge transfer in H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction 43,52.This can be further confirmed by the surface photovoltage (SPV) spectrum (Fig. 5c).One can find a significant positive SPV response for the wavelength range of 300-450 nm, indicating that photogenerated holes are transferred to the semiconductor surface under light, which is a typical characteristic of an n-type semiconductor.Generally, the strong SPV response coincided with the high separation efficiency of the photoinduced carriers based on the SPV technology.The SPV response of H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction enhances obviously compared with H-CeO 2 and MoSe 2 , thus, the formed H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction is essentially beneficial to enhance the separation of photo-generated carriers 34,43.The electrochemical impedance spectroscopy (EIS) of H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction demonstrates that it possesses the smallest electrochemical impedance among all prepared materials (Fig. 5d).This indicates that there is a better charge transfer in H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction.Based on the above analyses, more electrons and holes may participate in the catalytic reaction and improve the photocatalytic performance of H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction 53.As shown in Fig. 5e, H-CeO 2 presents a weak visible absorbance in the range of the UV-visible region.In all bands, the light response of MoSe 2 is the highest.When MoSe 2 is combined with H-CeO 2 , the light absorption capacity of H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction is improved, which is stronger than H-CeO 2 .The visible light response of H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction composite is gradually improved with the increase of the MoSe 2 load, such an enhancement of light absorption is beneficial to the increase of the photo-generated electrons and holes.And, the enhanced light absorption capacity is partly applied to generate photogenerated electron-hole pairs, while the other part generate thermal effect to promote photo-carriers migration to a certain extent 34,35,29,36,414243495051.Besides, the highest visible light response is achieved when the MoSe 2 load reaches 49.7 wt.A slight redshift in the absorption edge could be observed in picture.The slight redshift in optical absorption indicates the uniform distribution of vacancies in the formed samples 53. The hv curves of H-CeO 2 and MoSe 2 (Fig. 5e) are plotted using the Tauc Plot formula ahv (hv A Eg) 1/2 .By calculation, the band gap widths of MoSe the VB positions of MoSe 2 and H-CeO 2 are 0.47 eV and 1.68 eV, respectively, as measured by VB-XPS.According to calculate, their CB positions are determined to be A0.98 eV (vs NHE) and A0.52 eV (vs NHE).This value is more negative than the reduction potential formed by CH 4 and CO.These results confirm CO 2 reduction is thermodynamically permissible.When there is oxygen vacancy on the surface, the Fermi level of oxide moves upward and the defect level appears in the band gap (near the bottom of the conduction band), which reduces the band width 54.As consequence, photogenerated electrons can rapidly transfer to catalytic active sites for CO 2 reduction 34,35,29,36,41424349,50. 3.6.CO 2 methanation over H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction For the sake of describing the adsorption/activation process of CO 2 , the active site of reaction on H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction is determined.The presence of oxygen vacancies can promote the activation of reactant molecules on the catalyst surface, and oxygen vacancies can act as the activation sites of reactant molecules 55,56.In-situ DRIFTS patterns are collected to further explore the photocatalytic CO 2 reduction process as exhibited in Fig. 6.COOH and HCO 3 are produced on the surface of the sample after fully absorbing and saturated CO 2 .As shown in Fig. 6a,c, and e, different items and vacancies cause different peaks.The COOH and HCO 3 are centered at 1680 cm A1 and 1540 cm A1 , which two intermediates are generally considered to be the first important step in the conversion of CH 4 and CO, and can reversely prove the existence of CO 2 adsorption.Generally, the enhanced intensity of the presence signals of COOH and HCO 3 means CO 2 activation become easier 33.Therefore, H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction is more conducive to the adsorption and activation of CO 2 reactants, which is in line with the previous calculation. According to the following possible mechanisms for the photoreduction of CO 2 using water as the electron source: CO 2 ?CO ?CHO ?CH 2 O ?CH 3 O ?CH 4 32.CHO is the key intermediate product for CH 4 generation, which peak is be explored when CeO 2 and MoSe 2 reacting.While, H-Vo-CeO 2 49.7 wt MoSe 2 shows a strong signal peak of CHO (Fig. 6e), and thus CH 4 can be further generated, which result is consistent with the yield (Fig. 4).It can be noticed that another significant difference of the CO absorption near 2070 cm A1 for the three different samples, declaring that a great many CO intermediates produced from the teeth outwards of the catalyst.Among them, H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction changes most obviously, indicating that CO intermediates are rapidly protonated to produce CHO, and more CO molecules were desorbed from the surface of the catalyst, which enhanced the photocatalytic activity 30,43.Therefore, vacancies can not only change the photochemical properties of H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction, but also facilitate the absorption of CO 2 ."
  },
  {
    "title": "Conclusions",
    "content": "In summary, a feasible strategy has been successfully constructed, which is via morphology controllable strategy and rapid calcination treatment to fabricate the hollow heterostructure and obtain the vacancies.So, we get a series of different composites of MoSe 2 loads.The hollow geometry increases the surface area, and the introduction of Vo is conducive to the capture of electrons by CO 2 , thus promoting the CO 2 photocatalytic reduction process.By introducing the narrow band gap semiconductor MoSe 2 , the H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction is formed, which increases the absorption range of visible light and the separation efficiency of photogenerated carriers.The above factors greatly improve the photocatalytic reduction of CO 2 activity of CeO 2 .The DFT calculation further a confirmed possible reaction pathway during the reaction process.This work highlights the astonishing potential for hollow structure and Vo supports to achieve the conversion of CO 2 into CH 4 and CO and raise the efficiency of artificial photosynthesis. Jingwen Jiang: Writing -original draft.Xiaoxiao Zou: Methodology.Zhiyuan Mei: .Sheng Cai: Investigation.Qi An: Supervision.Yao Fu: Data curation.Han Wang: Conceptualization.Tingting Liu: .Hong Guo: . e-g) shows DOS diagrams of H-CeO 2 , MoSe 2 and H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction respectively.By comparing the DOS diagram of the three, it can be seen that in the DOS diagram of the composite structure, the valence band density on the left side of the Fermi level increases compared with the pure H-CeO 2 charge density, the valence band position of the MoSe 2 structure shifts to the Fermi level, and the conduction band position on the right side of the Fermi level shifts to the left, and the band gap width of the composite material, the reduction of band gap (CBM-VBM) promotes the transmission of electrons and enhances the electrical Fig. 1.Free energy diagrams of CO 2 photoreduction to CO/CH 4 for the H-CeO 2 , MoSe 2 , and H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction (a, b and c); and calculated density of states (DOS) for H-CeO 2 , MoSe 2 , and H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction (d, e, and f). Fig. 2. PXRD patterns of the MoSe 2 , H-CeO 2 and H-Vo-CeO 2 MoSe 2 heterojunction with different contents of MoSe 2 (a); EPR spectra of the H-CeO 2 MoSe 2 with before H 2 reduction and after H 2 reduction (b and f); Nitrogen adsorption/desorption isotherms for MoSe 2 , H-CeO 2 and H-Vo-CeO 2 MoSe 2 heterojunction (c); XPS spectrum of Se 3d, Mo 3d in H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction (d and e) and Ce 3d in H-CeO 2 MoSe 2 with before H 2 reduction and after H 2 reduction (f). Fig. 3. SEM image for template SiO 2 sphere (a), H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction (b) and H-SiO 2 CeO 2 (c); TEM image for H-CeO 2 (d) and H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction (e); high resolution TEM image of H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction (f); EDS mappings of Ce, O, Mo and Se (g-i). Fig. 4. typical time course of the amount of CO/CH 4 generated over H-CeO 2 , MoSe 2 and H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction during 4 h visible-light irradiation (a, b, and c); Photocatalytic products generation rates over H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction under visible light irradiation for 4 h (d). Fig. 5. PL spectra and time-resolved PL decay spectra of MoSe 2 , H-CeO 2 and H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction (a and b), SPS and EIS Nyquist plots curves of MoSe 2 , H-CeO 2 and H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction (c and d); UV-visable DRS of MoSe 2 , H-CeO 2 and H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction (e); Energy-level diagram of MoSe 2 , H-CeO 2 and H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction (f).Inset:band gap energies of MoSe 2 , H-CeO 2 . Fig. 6.In-situ DRIFTS tests of CO 2 interaction with H-CeO 2 (a), MoSe 2 (b) and H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction (c) subsequently irradiated by visible light and amplifications of the areas from 1900 to 2200 cm A1 of H-CeO 2 (d), MoSe 2 (e) and H-Vo-CeO 2 49.7 wt MoSe 2 heterojunction (f), in which the peak at about 2100 cm A1 corresponds to the adsorbed CO molecule. J. Jiang, X. Zou, Z. Mei et al.Journal of Colloid and Interface Science 611 (2022) 644-653 The authors acknowledge financial support provided by the National Natural Science Foundation of China (52064049, 21467030 and 51764048), the Key National Natural Science Foundation of Yunnan Province (2018FA028 and 2019FY003023), International Joint Research Center for Advanced Energy Materials of Yunnan Province (202003AE140001), Key Laboratory of Solid State Ions for Green Energy of Yunnan University (2019), the Analysis and Measurements Center of Yunnan University for the sample testing service, Labsolar-IIIAG on-line photocatalytic analysis system (Beijing Perfectlight). The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. The experimental section, characterization, computational details, electrochemical tests, measurement of photocatalytic activity, in-situ DRIFTS analyses for CO 2 photoreduction, tables, and other materials are described in the Supporting Information.Supplementary data to this article can be found online at https://doi.org/10.1016/j.jcis.2021.12.108."
  }
]