[
  {
    "title": "Doi",
    "content": "10.3390/ma11020307"
  },
  {
    "title": "Article_Title",
    "content": "TiO2@PEI-Grafted-MWCNTs Hybrids Nanocomposites Catalysts for CO2 Photoreduction"
  },
  {
    "title": "Abstract",
    "content": "Anatase (TiO 2 ) and multiwalled carbon nanotubes bearing polyethylenimine (PEI) anchored on their surface were hybridized in different proportions according to a sol-gel method.The resulting nanocomposites (TiO 2 PEI-MWCNTs), characterized by BET, XRD, XPS, SEM, and UV techniques, were found efficient catalysts for CO 2 photoreduction into formic and acetic acids in water suspension and under visible light irradiation.PEI-grafted nanotubes co-catalysts are believed to act as CO 2 activators by forming a carbamate intermediate allowing to accomplish the first example in the literature of polyamines/nanotubes/TiO 2 mediated CO 2 photoreduction to carboxylic acids."
  },
  {
    "title": "Experimental",
    "content": "Common commercial solvents and reagents of high purity were employed.Commercial Caroat (Pullach, Germany) triple salt (2KHSO 5 KHSO 4 K 2 SO 4 ), a gift from Peroxid-Chemie (Degussa, Germany), was the source of potassium monoperoxysulfate (caroate) for the synthesis of TFDO 39,40.MWCNTs (purity 90 wt., diameter between 0.7 and 1.4 nm) are commercially available from Sigma-Aldrich (Milan, Italy) in form of powder. Carbon dioxide, O 2 , Argon and Helium were with purity of 99.99, a gas burette (Figure S1) was used to measure gas volume in adsorption/desorption experiments.Formic and acetic acid analyses were performed with an Ion Chromatograph Dionex DX120 (Ion Pac ICE-AS6 Analytical Column, Monza, Italy); 0.8 mM heptafluorobutyric acid (Sigma-Aldrich) was used as eluent (flow 1.00 mL/min) and 5.0 mM tetrabutylammonium hydrate (Sigma-Aldrich) as regenerating eluent (flow 4.5 mL/min). Formic acid 99 and acetic acid (Sigma Aldrich) were employed as standard for building IC calibration curves.Analyses were carried out by using a sample loop of 25 L, with a column pressure less than 640 PSI and a background of 35-40 S. GC analyses for liquid and gas phase were performed with a GC Tracera Shimadzu 2010 (Milan, Italy) with a Detector BID-2010 (Shimadzu, Milan, Italy) plus and a Micropacked ST column (temperature program isotherm at 40 C 30 min).Infrared analyses were performed in the range 400-4000 cm -1 (64 scans), using a PerkinElmer 2000 FT-IR spectrometer (Milan, Italy). Thermogravimetric analyses were recorded on a TGA Q500 (TA Instruments, New Castle, GA, USA) using a flowing nitrogen atmosphere.The samples (about 1 mg per sample) were equilibrated at 100 C for 20 min and then heated at a rate of 10 C min -1 up to 800 C. Elemental analyses were performed on a Thermo Flash EA 1112 series CHNS-O elemental analyzer (Monza, Italy) with an accepted tolerance of 0.4 units. TEM (Transmission electron microscopy) analyses were performed with a TEM Philips EM208 instrument (Vienna, Austria) using an accelerating voltage of 100 kV.The samples were prepared by dropping aliquots of the DMF dispersions onto TEM grids (200 mesh, Nichel, carbon only, Ted Pella, Milan, Italy). BET (Brunauer-Emmett-Teller) specific surface area was obtained by N 2 adsorption-desorption method on powder samples using a Micromeritics TriStar II 3020 (Micromeritics, Norcross, U.S.A.).The samples (500 mg) were pre-treated at 80 C for 2 h before N 2 adsorption.FE-SEM investigations were performed by a Zeiss Sigma (Milan, Italy) microscope operating in the range 0.5-20 kV and equipped with an in-lens secondary electron detector.FE-SEM samples were prepared by sticking the powder on double sided carbon tape.Samples were mounted onto stainless-steel sample holders by using and grounded by silver paste. UV-Vis diffuse reflectance spectra were recorded with a UV-vis-NIR Cary 5 (Varian, Palo Alto, CA, USA) spectrophotometer equipped with an integrating sphere (BaSO 4 ). X-Ray powder diffraction data were collected at room temperature by using an automated Rigaku RINT2500 laboratory diffractometer (50 KV, 200 mA, Neu-Isenburg, Germany) equipped with the silicon strip Rigaku D/teX Ultra detector.Detailed XRD analyses of hybrids nanocomposites are showed in Figure S2. X-ray photoelectron spectroscopy (XPS) analyses were performed on a PHI VersaProbe II spectrometer (Phisical Electronics, Kanagawa, Japan) equipped with a monochromatic Al K X-ray source (1486.6 eV) operating at a spot size of 100 m, corresponding to a power of 24.4 W. Survey (0-1400 eV) and high resolution (C 1s, O 1s, N 1s, Ti 2p, Cl 2p, F 1s) spectra were recorded in FAT (fixed analyzer transmission) mode at pass energy of 117.4 eV and 46.95 eV, respectively.All spectra were acquired at a take-off angle of 45 with respect to the sample normal.Dual-beam charge neutralization was constantly applied during analysis.Charge correction of the spectra was performed by taking the sp2 graphitic component of the C 1s spectrum as internal reference (binding energy, BE 284.6 eV). XPS analysis was repeated on three different spots for each sample.During analyses, special care was devoted to verifying that no change in the samples was induced by exposure to the X-ray beam and the charge neutralization dual-beam.Detailed spectra processing was performed by commercial MultiPak software (Version 9.5.0.8, 30-10-2013, Ulvac-PHI, Inc., Kanagawa, Japan).The high-resolution spectra were fitted with mixed Gaussian-Lorentzian peaks after a Shirley background subtraction. The DO 9721 quantum photo-radiometer (Delta Ohm, Pordenone, Italy) and thermometer data logger were used for measuring illuminance, irradiance, luminance and temperature. Preparation was accomplished according to our previous method 41,42.MWCNTs (600-1000 mg) were placed in CH 2 Cl 2 (50-100 mL) and the mixture was sonicated for 30 min.An aliquot (35 mmol) of the standardized cold solution of methyl(trifluoromethyl)dioxirane (TFDO, 70 mL, 0.5 M) in 1,1,1-trifluoropropanone (TFP), was then added in one portion to the mixture, which was stirred and kept at 0 C.After 24 h the reaction was complete, the mixture was filtered, and ox-CNTs 2 were washed several times with CH 2 Cl 2 followed by MeOH, with recovery of 700-1300 mg. This procedure was used for preparation of amine grafted-MWCNTs 3 and 4 41,42.Oxidized nanotubes 2 (1 g) were dispersed in 1,6-hexamethylenediamine (3.7 g) or branched polyethylenimine (5 g PEI MW 600, 99 of purity) and the mixture was heated at reflux at 140 C under N 2 for 12 h.Next, the reaction mixture was diluted with methanol (20 mL) and filtered through a PTFE membrane filter paper (0.2 m).The solid was washed several times with CH 2 Cl 2 followed by MeOH to remove any excess of amine leading to HMDA-MWCNTs (3, 1.20 g) or PEI -MWCNTs (4, 1.25 g).Elemental analyses for 3: C (95.45), H (3.24), O (0.30), N (1.01); for 4: C (91.59), H (5.61), O (0.17), N (2.63). Preparation of hybrids nanocomposites was accomplished to previous method 14, titanium tetrachloride (98 TiCl 4 ), hydrochloric acid (38 HCl) and distilled water with a molar ratio of TiCl 4 :HCl:H 2 O 0.1:1:200 were homogenized under magnetic stirring for 30 min.The thus obtained transparent mother solution was then used as the raw material for preparing nanocomposites for photocatalytic experiments.Proper amounts of both p-MWCNTs (1) and functionalized PEI-MWCNTs (4) were separately dispersed into the proper volume of mother solution according to Table 1.After suspension, mixture was sonicated and then ammonia was slowly added (until neutrality) under vigorous stirring, thus inducing TiO 2 precipitation and formation of random agglomerates by inclusion of CNTs 14.After filtration, nanocomposites 1A, 1C and 4A-C were washed with distilled water and dried at 80 C for 24 h. The photocatalytic activities of samples 1A-C, 4A-C were evaluated by the reduction of CO 2 in H 2 O 9,43 (see Section 3.3).The apparatus used for the photocatalytic experiments consists of a three necked Pyrex batch photoreactor of cylindrical shape containing 20 mL of aqueous suspension.The photoreactor was provided with a jacket for cooling water circulation and ports in its upper section for the inlet and outlet of gases, for sampling and for pH and temperature measurements.A HRC UV-VIS lamp 300 W (Sanolux, Milan, Italy) and Xe-Halogen lamp 400 W (Radium, Milan, Italy) were placed in proximity (5-6 cm) of the reactor.Argon was bubbled for 30 min, to avoid the presence of air, and then CO 2 for approximately 60 min before switching on the lamps.The amounts of catalyst used were 150 and 500 mg in 20 mL of solution (loading of 7.5 and 25 mg/mL).The initial pH was 4.58.The temperature inside the reactor was held at approximately 25 C by a continuous circulation of water in the jacket around the photoreactor.The photoreactivity runs lasted in 5.0 h and the products were detected by Ion Cromatography and GC-BID. Experiments were performed following a protocol previously reported in literature 18,44,45.The proper amount of the TiO 2 /MWCNTs powder was dispersed in a mixture of chloroform (61) hexane (27) and ethanol (12), obtaining a concentration of 5000 ppm.Finally, the required volume of a stock solution of UBA in EtOH (2.5 10 -3 M) was added to reach the desired CHCl 3 :Hexane: EtOH ratio, and fix the final UBA concentration at 10 -5 M. Such a reaction mixture was poured in a quartz cuvette, sealed by a Teflon-faced rubber cap and purged under N 2 flow for 20 min, under stirring.Such a procedure has a twofold role: (i) to remove oxygen from the reaction environment and (ii) to promote the absorption-desorption equilibria between the photocatalyst and the UBA.Next, the mixture, was irradiated under continuous stirring with UV light using a medium pressure 200 W mercury lamp ( 250 nm), equipped with neutral density filters in order to achieve a light flux of 5 mW/cm 2 .At scheduled time intervals, the cuvette was removed from the light source and the reaction mixture was transferred in a centrifuge tube under inert atmosphere.The UBA/photocatalyst suspension was separated by centrifugation, and the liquid phase analyzed by absorption spectroscopy.The reaction was monitored by recording difference absorption spectra of the irradiated reaction mixtures.Any change in the absorption line-shape was then clearly identified for each sample, by considering as reference the respective unphotolyzed solution."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Grafting of amines onto the carbon nanotubes were performed with a recent approach based on epoxidation of CNTs followed by nucleophilic oxirane ring opening 41,42.This strategy is a greener alternative to the most used method via chemical oxidation with strong acids (H 2 SO 4 /HNO 3 ), that tends to damage the graphite-like structure of nanotubes 31,46. The milder functionalization was accomplished by treatment of pristine nanotubes 1 (p-MWCNTs) with methyl (trifluoromethyl) dioxirane (TFDO), a well-known oxidant suitable for efficient and selective epoxidations of alkenes under mild and neutral conditions.Next, epoxidized nanotubes 2 (ox-MWCNTs) were subjected to the oxirane ring opening reaction with two different polyamines, namely 1,6-hexamethylendiamine (HMDA) and branched polyethylenimine (PEI), affording the corresponding amine-grafted MWCNTs 3-4 (Figure 1). 5 mW/cm 2 .At scheduled time intervals, the cuvette was removed from the light source and the reaction mixture was transferred in a centrifuge tube under inert atmosphere.The UBA/photocatalyst suspension was separated by centrifugation, and the liquid phase analyzed by absorption spectroscopy.The reaction was monitored by recording difference absorption spectra of the irradiated reaction mixtures.Any change in the absorption line-shape was then clearly identified for each sample, by considering as reference the respective unphotolyzed solution. Grafting of amines onto the carbon nanotubes were performed with a recent approach based on epoxidation of CNTs followed by nucleophilic oxirane ring opening 41,42.This strategy is a greener alternative to the most used method via chemical oxidation with strong acids (H 2 SO 4 /HNO 3 ), that tends to damage the graphite-like structure of nanotubes 31,46. The milder functionalization was accomplished by treatment of pristine nanotubes 1 (p-MWCNTs) with methyl (trifluoromethyl) dioxirane (TFDO), a well-known oxidant suitable for efficient and selective epoxidations of alkenes under mild and neutral conditions.Next, epoxidized nanotubes 2 (ox-MWCNTs) were subjected to the oxirane ring opening reaction with two different polyamines, namely 1,6-hexamethylendiamine (HMDA) and branched polyethylenimine (PEI), affording the corresponding amine-grafted MWCNTs 3-4 (Figure 1).Evidences for the CNTs functionalization were provided by FT-IR.Epoxide ring-opening and post-functionalization of grafted nanotubes PEI-MWCNTs (4) were spectroscopically confirmed by NH 2 band appeared at 3400 and 3350 cm -1 , due to the NH 2 symmetric stretch.Further evidence was given by signals at 1461 and 1380 cm -1 , due to the bending of CH 2 groups, while bands at 1068 and 1050 cm -1 were attributed to C-N and C-O bending (Figure 2).Evidences for the CNTs functionalization were provided by FT-IR.Epoxide ring-opening and post-functionalization of grafted nanotubes PEI-MWCNTs (4) were spectroscopically confirmed by NH 2 band appeared at 3400 and 3350 cm -1 , due to the NH 2 symmetric stretch.Further evidence was given by signals at 1461 and 1380 cm -1 , due to the bending of CH 2 groups, while bands at 1068 and 1050 cm -1 were attributed to C-N and C-O bending (Figure 2). 5 mW/cm 2 .At scheduled time intervals, the cuvette was removed from the light source and the reaction mixture was transferred in a centrifuge tube under inert atmosphere.The UBA/photocatalyst suspension was separated by centrifugation, and the liquid phase analyzed by absorption spectroscopy.The reaction was monitored by recording difference absorption spectra of the irradiated reaction mixtures.Any change in the absorption line-shape was then clearly identified for each sample, by considering as reference the respective unphotolyzed solution. Grafting of amines onto the carbon nanotubes were performed with a recent approach based on epoxidation of CNTs followed by nucleophilic oxirane ring opening 41,42.This strategy is a greener alternative to the most used method via chemical oxidation with strong acids (H 2 SO 4 /HNO 3 ), that tends to damage the graphite-like structure of nanotubes 31,46. The milder functionalization was accomplished by treatment of pristine nanotubes 1 (p-MWCNTs) with methyl (trifluoromethyl) dioxirane (TFDO), a well-known oxidant suitable for efficient and selective epoxidations of alkenes under mild and neutral conditions.Next, epoxidized nanotubes 2 (ox-MWCNTs) were subjected to the oxirane ring opening reaction with two different polyamines, namely 1,6-hexamethylendiamine (HMDA) and branched polyethylenimine (PEI), affording the corresponding amine-grafted MWCNTs 3-4 (Figure 1).Evidences for the CNTs functionalization were provided by FT-IR.Epoxide ring-opening and post-functionalization of grafted nanotubes PEI-MWCNTs (4) were spectroscopically confirmed by NH 2 band appeared at 3400 and 3350 cm -1 , due to the NH 2 symmetric stretch.Further evidence was given by signals at 1461 and 1380 cm -1 , due to the bending of CH 2 groups, while bands at 1068 and 1050 cm -1 were attributed to C-N and C-O bending (Figure 2).TGA analyses (Figure 3a) of amine-grafted nanotubes 3 and 4 revealed similar weight loss percentages of 14.4 and 14.0, respectively, thus indicating a quite similar amine loading on the nanotubes surface.As control experiments, both p-MWCNTs 1 and grafted PEI-MWCNTs 4' obtained after an adsorption/desorption cycle (namely des-PEI-MWCNTs) were subjected to the same analysis. TGA analyses (Figure 3a) of amine-grafted nanotubes 3 and 4 revealed similar weight loss percentages of 14.4 and 14.0, respectively, thus indicating a quite similar amine loading on the nanotubes surface.As control experiments, both p-MWCNTs 1 and grafted PEI-MWCNTs 4' obtained after an adsorption/desorption cycle (namely des-PEI-MWCNTs) were subjected to the same analysis.The weight loss of 12.3 for desorbed PEI-MWCNTs (4') accounted for a substantial stability of grafted amines-CNTs under the CO2 capture conditions.Moreover, comparison of TEM images of PEI-MWCNTs 4 (Figure 3b) and p-MWCNTs 1 (Figure 3c) revealed no substantial change in morphology upon surface functionalization of p-MWCNTs. Loading of CO 2 -philic amine groups of modified MWCNTs 3-4 was evaluated by means of total N-content (), whereas their sorbent capacity was estimated in a series of adsorption/desorption experiments and compared with that of pristine p-MWCNTs (1) (Table 2).As expected, grafting of amine moieties onto the surface of MWCNTs increased their sorbent capacity by conjugating physical adsorption of nanotubes and chemical absorption of CO 2 -philic functionalities. Additionally, results in Table 2 confirmed that the CO 2 capture process proved to be perfectly reversible for amine-grafted-MWCNTs 3-4, for which CO 2 could be quantitatively released at 80 C.On these bases, also taking into account the recent literature 47 highligting polyethylenimine as one of the greatest candidates for CO 2 sequestration processes, PEI-grafted MWCNTs 4 showing the best capture performance was selected as co-catalysts of titania in the CO 2 photoreduction.The weight loss of 12.3 for desorbed PEI-MWCNTs (4') accounted for a substantial stability of grafted amines-CNTs under the CO 2 capture conditions.Moreover, comparison of TEM images of PEI-MWCNTs 4 (Figure 3b) and p-MWCNTs 1 (Figure 3c) revealed no substantial change in morphology upon surface functionalization of p-MWCNTs. Loading of CO 2 -philic amine groups of modified MWCNTs 3-4 was evaluated by means of total N-content (), whereas their sorbent capacity was estimated in a series of adsorption/desorption experiments and compared with that of pristine p-MWCNTs (1) (Table 2).As expected, grafting of amine moieties onto the surface of MWCNTs increased their sorbent capacity by conjugating physical adsorption of nanotubes and chemical absorption of CO 2 -philic functionalities.Additionally, results in Table 2 confirmed that the CO 2 capture process proved to be perfectly reversible for amine-grafted-MWCNTs 3-4, for which CO 2 could be quantitatively released at 80 C. On these bases, also taking into account the recent literature 47 highligting polyethylenimine as one of the greatest candidates for CO 2 sequestration processes, PEI-grafted MWCNTs 4 showing the best capture performance was selected as co-catalysts of titania in the CO 2 photoreduction. Hybrid nanocomposites photocatalysts were prepared according to a sol-gel method 14.At this end, functionalized nanotubes 4 were suspended in a aqueous HCl solution of TiCl 4 from which TiO 2 was precipitated by addition of ammonia, thus forming random agglomerates by inclusion of CNTs (Scheme 1) 13.The ensuing TiO 2 PEI-MWCNTs composites were collected by filtration, washed with distilled H 2 O and dried at 80 C for 24 h.For the photocatalytic experiments, a number of hybrid nanocomposites were selected (1A, 1C, 4A-C) using different amounts of pristine nanotubes 1 and PEI-modified-MWCNTs 4, as listed in Table 3. TiO 2 was precipitated by addition of ammonia, thus forming random agglomerates by inclusion of CNTs (scheme 1) 13.The ensuing TiO 2 PEI-MWCNTs composites were collected by filtration, washed with distilled H 2 O and dried at 80 C for 24 h.For the photocatalytic experiments, a number of hybrid nanocomposites were selected (1A, 1C, 4A-C) using different amounts of pristine nanotubes 1 and PEI-modified-MWCNTs 4, as listed in Table 3. Hybridized materials were characterized by BET, XRD, XPS, FE-SEM, and UV techniques (see supplementary materials for details).BET analyses displayed an expected trend in which the presence of carbon nanotubes remarkably increased the surface area of composites with respect to titania (Table 3). XRD spectra were reported in Figure 4.The diffraction pattern of PEI-grafted MWCNTs 4 showed a very low degree of crystallinity (Figure 4a).The diffraction patterns of the two hybrid composites 1A and 4A, consisting of TiO 2 with minimal amounts (2) of carbon nanotubes, exhibited similar features of anatase phase (Figure 4b).As expected, on increasing the PEI-MWCNTs content up to 10 (composite 4B), the anatase polymorphic form did not persist anymore (Figure 4c), most likely because the increase of the almost amorphous nanotubes hinders the agglomeration of TiO 2 particles 14 -18 (see supplementary materials for details). Scheme 1. Procedure for hybrid nanocomposites preparation.Hybridized materials were characterized by BET, XRD, XPS, FE-SEM, and UV techniques (see Supplementary Materials for details).BET analyses displayed an expected trend in which the presence of carbon nanotubes remarkably increased the surface area of composites with respect to titania (Table 3). XRD spectra were reported in Figure 4.The diffraction pattern of PEI-grafted MWCNTs 4 showed a very low degree of crystallinity (Figure 4a).The diffraction patterns of the two hybrid composites 1A and 4A, consisting of TiO 2 with minimal amounts (2) of carbon nanotubes, exhibited similar features of anatase phase (Figure 4b).As expected, on increasing the PEI-MWCNTs content up to 10 (composite 4B), the anatase polymorphic form did not persist anymore (Figure 4c), most likely because the increase of the almost amorphous nanotubes hinders the agglomeration of TiO 2 particles 14 -18 (see Supplementary Materials for details). this end, functionalized nanotubes 4 were suspended in a aqueous HCl solution of TiCl 4 from which TiO 2 was precipitated by addition of ammonia, thus forming random agglomerates by inclusion of CNTs (scheme 1) 13.The ensuing TiO 2 PEI-MWCNTs composites were collected by filtration, washed with distilled H 2 O and dried at 80 C for 24 h.For the photocatalytic experiments, a number of hybrid nanocomposites were selected (1A, 1C, 4A-C) using different amounts of pristine nanotubes 1 and PEI-modified-MWCNTs 4, as listed in Table 3. Hybridized materials were characterized by BET, XRD, XPS, FE-SEM, and UV techniques (see supplementary materials for details).BET analyses displayed an expected trend in which the presence of carbon nanotubes remarkably increased the surface area of composites with respect to titania (Table 3). XRD spectra were reported in Figure 4.The diffraction pattern of PEI-grafted MWCNTs 4 showed a very low degree of crystallinity (Figure 4a).The diffraction patterns of the two hybrid composites 1A and 4A, consisting of TiO 2 with minimal amounts (2) of carbon nanotubes, exhibited similar features of anatase phase (Figure 4b).As expected, on increasing the PEI-MWCNTs content up to 10 (composite 4B), the anatase polymorphic form did not persist anymore (Figure 4c), most likely because the increase of the almost amorphous nanotubes hinders the agglomeration of TiO 2 particles 14 -18 (see supplementary materials for details).XPS analyses showed the expected surface atomic concentration of composites (Table 4).Notably, from both atomic percentages and high-resolution N1s signals (Figure S3) emerged that PEI-MWCNTs-TiO 2 composite did not undergo to a sensible variations of its surface composition after catalytic reaction.The N1s signal could be curve fitted with two components: a dominant component at 400.5 0.2 eV ascribed to amino groups and a minor component centred at 402.2 0.2 eV that could be due to protonated amino groups or to amino groups involved in hydrogen bonding.This is a clear evidence of photocatalyst stability under the reaction conditions.SEM images of samples 1A and 4C (Figure S4) showed heterogeneous samples consisting of MWCNTs randomly dispersed into TiO 2 agglomerates.A high level of magnification (Figure S4(D)) highlights the close interfacial contact between nanotubes and TiO 2 which is crucial for narrowing of titania bandgap and consequently for the enhancement of catalytic activity 48. UV-Vis reflectance spectra of TiO 2 , TiO 2 MWCNTs (1C) and TiO 2 PEI-MWCNTs (4C) recorded in absorption mode are presented in Figure 5.As expeted, all hybrid materials showed a higher light absorption capability in the UV region below 400 nm, due to the characteristic absorption of TiO 2 .Remarkably, spectra of 1C and 4C appear to be quite similar, displaying the same red shift effect caused by the incorporation of both nanotubes alone and PEI-modified-CNTs into TiO 2 495051.This means that the formation of covalent bonds between MWCNTs and PEI in 4C does not introduce significant modifications of graphite-like structure of nanotubes.However, the composite 4C showed a more intense absorption underneath 350 nm, maybe due to the auxochrome effect (mainly n electronic transitions) of amino and hydroxyl groups linked on nanotubes surface.This effect could explain the enhanced photoreducing power displayed by composite 4C in the photoreductionof the organic dye UBA in the UV range (see mechanistic insights paragraph).XPS analyses showed the expected surface atomic concentration of composites (Table 4).Notably, from both atomic percentages and high-resolution N1s signals (Figure S3) emerged that PEI-MWCNTs-TiO 2 composite did not undergo to a sensible variations of its surface composition after catalytic reaction.The N1s signal could be curve fitted with two components: a dominant component at 400.5 0.2 eV ascribed to amino groups and a minor component centred at 402.2 0.2 eV that could be due to protonated amino groups or to amino groups involved in hydrogen bonding.This is a clear evidence of photocatalyst stability under the reaction conditions.SEM images of samples 1A and 4C (Figure S4) showed heterogeneous samples consisting of MWCNTs randomly dispersed into TiO 2 agglomerates.A high level of magnification (Figure S4(D)) highlights the close interfacial contact between nanotubes and TiO 2 which is crucial for narrowing of titania bandgap and consequently for the enhancement of catalytic activity 48. UV-Vis reflectance spectra of TiO 2 , TiO 2 MWCNTs (1C) and TiO 2 PEI-MWCNTs (4C) recorded in absorption mode are presented in Figure 5.As expeted, all hybrid materials showed a higher light absorption capability in the UV region below 400 nm, due to the characteristic absorption of TiO 2 .Remarkably, spectra of 1C and 4C appear to be quite similar, displaying the same red shift effect caused by the incorporation of both nanotubes alone and PEI-modified-CNTs into TiO 2 495051.This means that the formation of covalent bonds between MWCNTs and PEI in 4C does not introduce significant modifications of graphite-like structure of nanotubes.However, the composite 4C showed a more intense absorption underneath 350 nm, maybe due to the auxochrome effect (mainly n electronic transitions) of amino and hydroxyl groups linked on nanotubes surface.This effect could explain the enhanced photoreducing power displayed by composite 4C in the photoreductionof the organic dye UBA in the UV range (see mechanistic insights paragraph). Photocatalytic conditions were chosen according to the goal of this study: the development of a metal free catalyst system that mimics the natural photosynthetic process, i.e., ambient temperature, sunlight radiation and water as the hydrogen source. As a further aim of this work, we attempted to investigate the influence of radiation source on photocatalysis using two different emitting lamps: i) the SANOLUX lamp, displaying a higher radiance in the near UV (315-400 nm) and the Xe-Halogen lamp, possessing the major emission power in the visible range (400-700 nm, see Figure S6 in supplemetary materials). Photoreduction was performed in a water phase suspension (20 mL) of the solid catalyst (with the loading in the range of 7.5-30 mg solid.cat./mL), and monitoring reaction parameters and species produced in both the liquid solution and in the gas phase of the reactor head space 43 (see Figure S5). Argon was initially bubbled for 30 min, to avoid the presence of air, then CO 2 for approximately 60 min, to saturate the reaction mixture, upon which suspension was irradiated for 5 h under vigorous stirring at room temperature.Initial pH value of solution after bubbling was found to be equal to 4.78, and raised to 5.80 after reaction. Under the chosen conditions, nanocomposites proved to be active in converting CO 2 into formic and acetic acids (Scheme 2), while neither simple PEI-grafted nanotubes nor bare TiO 2 displayed appreciable activity (Table 5, runs 1-2). The optimal irradiaton time of 5 h was ascertained by monitoring photoreduction in the first 7 h of reaction (Figure 6).Results showed that prolonged reaction times ( 5 h) led to the decrease of yield in formic acid with the corresponding increment of acetic acid.A plausible explanation could be related to the partial transformation of HCOOH into CH 3 COOH by reaction with methyl radicals (CH 3 ), according to the general mechanism proposed by S. Sharifnia et al. 52. Composites 1A and 1C beharing unmodified MWCNTs gave formic acid as the major product (Table 5, runs 3-4).In addition, photoreducing power, especially the one leading to formic acid, increased with increasing the percentage of PEI-grafted nanotubes in the composite reaching the maximum level at about 30 (sample 4C, Table 5, runs 5-7). Photocatalytic conditions were chosen according to the goal of this study: the development of a metal free catalyst system that mimics the natural photosynthetic process, i.e., ambient temperature, sunlight radiation and water as the hydrogen source. As a further aim of this work, we attempted to investigate the influence of radiation source on photocatalysis using two different emitting lamps: (i) the SANOLUX lamp, displaying a higher radiance in the near UV (315-400 nm) and the Xe-Halogen lamp, possessing the major emission power in the visible range (400-700 nm, see Figure S6 in Supplemetary Materials). Photoreduction was performed in a water phase suspension (20 mL) of the solid catalyst (with the loading in the range of 7.5-30 mg solid.cat./mL), and monitoring reaction parameters and species produced in both the liquid solution and in the gas phase of the reactor head space 43 (see Figure S5). Argon was initially bubbled for 30 min, to avoid the presence of air, then CO 2 for approximately 60 min, to saturate the reaction mixture, upon which suspension was irradiated for 5 h under vigorous stirring at room temperature.Initial pH value of solution after bubbling was found to be equal to 4.78, and raised to 5.80 after reaction. Under the chosen conditions, nanocomposites proved to be active in converting CO 2 into formic and acetic acids (Scheme 2), while neither simple PEI-grafted nanotubes nor bare TiO 2 displayed appreciable activity (Table 5, runs 1-2). The optimal irradiaton time of 5 h was ascertained by monitoring photoreduction in the first 7 h of reaction (Figure 6).Results showed that prolonged reaction times(5 h) led to the decrease of yield in formic acid with the corresponding increment of acetic acid.A plausible explanation could be related to the partial transformation of HCOOH into CH 3 COOH by reaction with methyl radicals (CH 3 ), according to the general mechanism proposed by S. Sharifnia et al. Photocatalytic conditions were chosen according to the goal of this study: the development of a metal free catalyst system that mimics the natural photosynthetic process, i.e., ambient temperature, sunlight radiation and water as the hydrogen source. As a further aim of this work, we attempted to investigate the influence of radiation source on photocatalysis using two different emitting lamps: i) the SANOLUX lamp, displaying a higher radiance in the near UV (315-400 nm) and the Xe-Halogen lamp, possessing the major emission power in the visible range (400-700 nm, see Figure S6 in supplemetary materials). Photoreduction was performed in a water phase suspension (20 mL) of the solid catalyst (with the loading in the range of 7.5-30 mg solid.cat./mL), and monitoring reaction parameters and species produced in both the liquid solution and in the gas phase of the reactor head space 43 (see Figure S5). Argon was initially bubbled for 30 min, to avoid the presence of air, then CO 2 for approximately 60 min, to saturate the reaction mixture, upon which suspension was irradiated for 5 h under vigorous stirring at room temperature.Initial pH value of solution after bubbling was found to be equal to 4.78, and raised to 5.80 after reaction. Under the chosen conditions, nanocomposites proved to be active in converting CO 2 into formic and acetic acids (scheme 2), while neither simple PEI-grafted nanotubes nor bare TiO 2 displayed appreciable activity (Table 5, runs 1-2). The optimal irradiaton time of 5 h was ascertained by monitoring photoreduction in the first 7 h of reaction (Figure 6).Results showed that prolonged reaction times( 5 h) led to the decrease of yield in formic acid with the corresponding increment of acetic acid.A plausible explanation could be related to the partial transformation of HCOOH into CH 3 COOH by reaction with methyl radicals (CH 3 ), according to the general mechanism proposed by S. Sharifnia et al. 52. Composites 1A and 1C beharing unmodified MWCNTs gave formic acid as the major product (Table 5, runs 3-4).In addition, photoreducing power, especially the one leading to formic acid, increased with increasing the percentage of PEI-grafted nanotubes in the composite reaching the maximum level at about 30 (sample 4C, Table 5, runs 5-7).5). Sampling of the gaseous phase above the reaction solution at different time intervals showed a constant composition consisting essentially of O 2 (2), Argon (5) and CO 2 (93).Neither CO, nor H 2 or other gaseous by-products (methane, ethane etc.) were detected during reaction.Notably, the light source proved to have a profound influence on the reaction selectivity: Xe-Halogen lamp (emitting primarily into the visible region) privileged the formation of formic acid, while SANOLUX lamp (with a main radiance in the near UV) favoured the formation of acetic acid (Table 5, runs 8-9). Catalyst loading affected reaction in a predictable manner.Its increment increased the light scattering, thus limiting photoreducing process.As a consequence, despite the use of a threefold amount of solid catalyst, yields remained almost unchanged (Table 5, runs 11-14).5). Composites 1A and 1C beharing unmodified MWCNTs gave formic acid as the major product (Table 5, runs 3-4).In addition, photoreducing power, especially the one leading to formic acid, increased with increasing the percentage of PEI-grafted nanotubes in the composite reaching the maximum level at about 30 (sample 4C, Table 5, runs 5-7). The head space gas phase was monitored during reaction by means of GC analyses using a specific Barrier Ionization Discharge (BID) detector for revealing the reaction by-products. Sampling of the gaseous phase above the reaction solution at different time intervals showed a constant composition consisting essentially of O 2 (2), Argon (5) and CO 2 (93).Neither CO, nor H 2 or other gaseous by-products (methane, ethane etc.) were detected during reaction.Notably, the light source proved to have a profound influence on the reaction selectivity: Xe-Halogen lamp (emitting primarily into the visible region) privileged the formation of formic acid, while SANOLUX lamp (with a main radiance in the near UV) favoured the formation of acetic acid (Table 5, runs 8-9). Catalyst loading affected reaction in a predictable manner.Its increment increased the light scattering, thus limiting photoreducing process.As a consequence, despite the use of a threefold amount of solid catalyst, yields remained almost unchanged (Table 5, runs 11-14). Stability and robustnes of our nanocatalysts were evaluated by means of recycling experiments (Figure 7).After each run the catalyst powder was recovered by filtration, washed with distilled methanol and water, and then dried under vacuum.Results evidenced a fair to good catalyst stability, with only a little loss of efficiency observed after the first cycle. Stability and robustnes of our nanocatalysts were evaluated by means of recycling experiments (Figure 7).After each run the catalyst powder was recovered by filtration, washed with distilled methanol and water, and then dried under vacuum.Results evidenced a fair to good catalyst stability, with only a little loss of efficiency observed after the first cycle . The photocatalytic process of CO 2 reduction follows a relative unknown and complex mechanism leading to different products at the same time.Among them, CO, CH 3 OH, HCOOH, CH 4 , HCHO, CH 3 COOH and other light hydrocarbons are mainly observed, with a selectivity affected by a great number of factors 52. We do not have elements to propose specific mechanisms, but can rationalize in the following points our experimental results attempting also to explain the remarkable enhancement of activity that polyamine modification of TiO 2 /MWCNTs nanocomposites can lead in CO 2 photoreduction: i) Firstly, the detection of O 2 into the head space of photoreactor can be considered a clear evidence that water is the sacrificial reductant for CO 2 . ii) Secondly, the high chemisorption capacity of TiO 2 PEI-MWCNTs (4C) (18 mL CO2 /g) is most probably the key reason for the its enhanced photoreducing ability, due to kinetic effects.Indeed, reaction of CO 2 with NH 2 groups forms carbamate, thus leading to the activation of carbon dioxide, because carbamate is believed to have a higher reactivity than the linear CO 2 molecule (Figure 8) 24.This assumption is corroborated by FT-IR analyses (Figure 9) of (4C) under photocatalytic conditions before and after CO 2 bubbling, in which the peak at 1489 cm -1 appeared that can be attributed to the carbamate COO -stretching 53,54. The photocatalytic process of CO 2 reduction follows a relative unknown and complex mechanism leading to different products at the same time.Among them, CO, CH 3 OH, HCOOH, CH 4 , HCHO, CH 3 COOH and other light hydrocarbons are mainly observed, with a selectivity affected by a great number of factors 52. We do not have elements to propose specific mechanisms, but can rationalize in the following points our experimental results attempting also to explain the remarkable enhancement of activity that polyamine modification of TiO 2 /MWCNTs nanocomposites can lead in CO 2 photoreduction: (i) Firstly, the detection of O 2 into the head space of photoreactor can be considered a clear evidence that water is the sacrificial reductant for CO 2 . (ii) Secondly, the high chemisorption capacity of TiO 2 PEI-MWCNTs (4C) (18 mL CO 2 /g) is most probably the key reason for the its enhanced photoreducing ability, due to kinetic effects.Indeed, reaction of CO 2 with NH 2 groups forms carbamate, thus leading to the activation of carbon dioxide, because carbamate is believed to have a higher reactivity than the linear CO 2 molecule (Figure 8) 24.This assumption is corroborated by FT-IR analyses (Figure 9) of (4C) under photocatalytic conditions before and after CO 2 bubbling, in which the peak at 1489 cm -1 appeared that can be attributed to the carbamate COO -stretching 53,54. (iii) Thirdly, an electronic effect of PEI could also be invoked in the UV range.It has been extensively approved that MWCNTs can narrow the band gap of TiO 2 extending light absorption to longer wavelength region.The red shift observed in Figure 5 confirms such a hypothesis.In addition, due their graphite-like structure, MWCNTs are considered as a channel for electron storage, functioning as electron acceptors from higher conduction band of TiO 2 , thus inhibiting the recombination rate of electron-hole pairs through the transfer of electrons 24.This is extremely crucial as the slower recombination rate leaves more holes in TiO 2 , promoting higher oxidation rate of water and thus enhancing reduction of CO 2 (Figure 10). In this context, it can be assumed that PEI-grafting, from one hand, does not modificate the graphite-like structure of CNTs thus allowing them to continue their action of narrowing the band gap of titania, while, form the other hand, can enhance the photocatalytic activity of TiO 2 into the UV range due to the auxochrome effect. Notably, lowering of crystallinity experienced by TiO 2 as a consequence of hybridization (Figure 4c) does not influence catalytic performance, as this detrimental effect is counterbalanced by the enhancement of both the electron scavenging and CO 2 capture capacity of nanocomposite by virtue of PEI-CNTs conjugation. (iv) Searching for further confirmations on the effect on photocatalytic activity of PEI-conjugation with TiO 2 /MWCNTs composites, we investigated the photoreductionof the organic dye UBA, (Scheme 3) a model substrate commonly used to investigate electron transfer reactions 18,44,45.Irradiation was performed with UV light using a mercury lamp ( 250 nm) and photoreduction was checked monitoring the colour change from blue (the colour of UBA anthraquinonic structure) to yellow (due to UBA reduced form).iii) Thirdly, an electronic effect of PEI could also be invoked in the UV range.It has been extensively approved that MWCNTs can narrow the band gap of TiO 2 extending light absorption to longer wavelength region.The red shift observed in Figure 5 confirms such a hypothesis.In addition, due their graphite-like structure, MWCNTs are considered as a channel for electron storage, functioning as electron acceptors from higher conduction band of TiO 2 , thus inhibiting the recombination rate of electron-hole pairs through the transfer of electrons 24.This is extremely crucial as the slower recombination rate leaves more holes in TiO 2 , promoting higher oxidation rate of water and thus enhancing reduction of CO 2 (Figure 10). In this context, it can be assumed that PEI-grafting, from one hand, does not modificate the graphite-like structure of CNTs thus allowing them to continue their action of narrowing the band gap of titania, while, form the other hand, can enhance the photocatalytic activity of TiO 2 into the UV range due to the auxochrome effect. Notably, lowering of crystallinity experienced by TiO 2 as a consequence of hybridization (Figure 4c) does not influence catalytic performance, as this detrimental effect is counterbalanced by the enhancement of both the electron scavenging and CO 2 capture capacity of nanocomposite by virtue of PEI-CNTs conjugation.iii) Thirdly, an electronic effect of PEI could also be invoked in the UV range.It has been extensively approved that MWCNTs can narrow the band gap of TiO 2 extending light absorption to longer wavelength region.The red shift observed in Figure 5 confirms such a hypothesis.In addition, due their graphite-like structure, MWCNTs are considered as a channel for electron storage, functioning as electron acceptors from higher conduction band of TiO 2 , thus inhibiting the recombination rate of electron-hole pairs through the transfer of electrons 24.This is extremely crucial as the slower recombination rate leaves more holes in TiO 2 , promoting higher oxidation rate of water and thus enhancing reduction of CO 2 (Figure 10). In this context, it can be assumed that PEI-grafting, from one hand, does not modificate the graphite-like structure of CNTs thus allowing them to continue their action of narrowing the band gap of titania, while, form the other hand, can enhance the photocatalytic activity of TiO 2 into the UV range due to the auxochrome effect. Notably, lowering of crystallinity experienced by TiO 2 as a consequence of hybridization (Figure 4c) does not influence catalytic performance, as this detrimental effect is counterbalanced by the enhancement of both the electron scavenging and CO 2 capture capacity of nanocomposite by virtue of PEI-CNTs conjugation.iv) Searching for further confirmations on the effect on photocatalytic activity of PEI-conjugation with TiO 2 /MWCNTs composites, we investigated the photoreductionof the organic dye UBA, (Scheme 3) a model substrate commonly used to investigate electron transfer reactions 18,44,45.Irradiation was performed with UV light using a mercury lamp ( 250 nm) and photoreduction was checked monitoring the colour change from blue (the colour of UBA anthraquinonic structure) to yellow (due to UBA reduced form).Differences in absorbance (Abs) acquired at 587 nm as a function of irradiation time were reported (Figure 11) 44,45.Results clearly evidenced a higher reducing capability of the TiO 2 PEI-MWCNTs (4C) compared to the bare TiO 2 .Indeed, with 4C as catalyst, an almost complete photoreduction of UBA was observed in the first 30 min of reaction, with the Abs value of 0.98.After that, the Abs value reached a plateau.iv) Searching for further confirmations on the effect on photocatalytic activity of PEI-conjugation with TiO2/MWCNTs composites, we investigated the photoreductionof the organic dye UBA, (scheme 3) a model substrate commonly used to investigate electron transfer reactions 18,44,45.Irradiation was performed with UV light using a mercury lamp ( 250 nm) and photoreduction was checked monitoring the colour change from blue (the colour of UBA anthraquinonic structure) to yellow (due to UBA reduced form).Scheme 3: photoreduction of UBA Differences in absorbance (Abs) acquired at 587 nm as a function of irradiation time were reported (Figure 11) 44,45.Results clearly evidenced a higher reducing capability of the TiO2PEI-MWCNTs (4C) compared to the bare TiO2.Indeed, with 4C as catalyst, an almost complete photoreduction of UBA was observed in the first 30 min of reaction, with the Abs value of 0.98.After that, the Abs value reached a plateau.Differences in absorbance (Abs) acquired at 587 nm as a function of irradiation time were reported (Figure 11) 44,45.Results clearly evidenced a higher reducing capability of the TiO 2 PEI-MWCNTs (4C) compared to the bare TiO 2 .Indeed, with 4C as catalyst, an almost complete photoreduction of UBA was observed in the first 30 min of reaction, with the Abs value of 0.98.After that, the Abs value reached a plateau.iv) Searching for further confirmations on the effect on photocatalytic activity of PEI-conjugation with TiO 2 /MWCNTs composites, we investigated the photoreductionof the organic dye UBA, (Scheme 3) a model substrate commonly used to investigate electron transfer reactions 18,44,45.Irradiation was performed with UV light using a mercury lamp ( 250 nm) and photoreduction was checked monitoring the colour change from blue (the colour of UBA anthraquinonic structure) to yellow (due to UBA reduced form).Differences in absorbance (Abs) acquired at 587 nm as a function of irradiation time were reported (Figure 11) 44,45.Results clearly evidenced a higher reducing capability of the TiO 2 PEI-MWCNTs (4C) compared to the bare TiO 2 .Indeed, with 4C as catalyst, an almost complete photoreduction of UBA was observed in the first 30 min of reaction, with the Abs value of 0.98.After that, the Abs value reached a plateau.Conversely, with bare TiO 2 , the Abs was detected to be 0.6 indicating that titania alone can promote UBA photoreduction up to the 60 in the first 30 min of irradiation.Next, despite prolonged irradiation the Abs remained constant. Two further control experiments were performed using PEI-MWCNTs (4) and TiO 2 MWCNTs (1C) sample as catalysts, respectively.The former resulted in a 30 photoreduction of UBA during the first 30 min of irradiation, while the latter gave rise to 56 of UBA photoreduction, displaying a reduction capacity comparable with that of bare TiO 2 and lower than that observed for TiO 2 PEI-MWCNTs (4C).This beneficial role played by the functionalization with PEI could be explained with the auxochrome effect in the UV region exerted by amino and hydroxyl groups of PEI-modified composites (clearly visible in the UV spectrum of Figure 5), and is in accordance with the accepted principles \"the higher the light absorption, the more the photoexcited electron-hole pairs\" or also \"the higher the reflectance the higher the activity\" 55. In addition, the disappointing results of UBA reduction assisted by PEI-MWCNTs (4), pointed out that an efficient UBA photoreductionis promoted only in the presence of TiO 2 , especially upon its interaction with MWCNTs efficiently mediated by PEI.Remarkably, the sample TiO 2 -MWCNTs (1C) showed a lower photocatalytic efficiency respect to the TiO 2 PEI-MWCNTs (4C), despite they have a comparable specific surface area (Table 3: 299.2 m 2 /g and 304.2 m 2 /g, respectively).Such a behaviour further highlights the beneficial role played by the functionalization of MWCNTs with the PEI in the achievement of a highly photoactive nanocomposite. (v) Finally, a special attention deserves the photoreduction selectivity towards the two main photoreduction products HCOOH/CH 3 COOH.Results in Table 5 clearly show that formation of HCOOH increases with increasing of PEI-grafted MWCNTs percentage in the nanocomposite, with the best yields reached with 30 ca. of carbon dopants (catalyst 4C, Table 5,14).This trend is in line with the above mentioned assumptions. More difficult is the rationale for the formation of CH 3 COOH.This product is more rarely observed, even if is the major product in water suspension 56, like in our case, or using TiO 2 doped with metals like Cu, Rh and Ru 565758.From results in Table 5 emerged that acetic acid formation depends on the nature of light source, with highest value reached using SANOLUX UV lamp (Table 5, run 9).This result indicates that formation of acetic acid is favoured by the UV-component of radiation and seems to be in accordance with the auxochrome effect of PEI into the UV region (Figure 5). We do not have other elements explaining this phenomenon, and further efforts are needed to unravel the complex mechanistic aspects underlying the photocatalytic activity of these new materials."
  },
  {
    "title": "Conclusions",
    "content": "In summary, we have found that polyethylenimine (PEI) anchored onto multiwalled carbon nanotubes can strongly enhance photocatalytic performances of TiO 2 /MWCNTs composites, rendering these materials efficient photocatalysts for CO 2 conversion into formic and acetic acids.The simultaneous presence of PEI and CNTs is essential for catalysis, as demonstrated by the high sorbent capacity of TiO 2 PEI-MWCNTs (4C) (18 mL/g) that enables both CO 2 capture and activation, most probably via carbamate formation.Bleaching experiments corroborate in part the beneficial role of PEI in enhancing the photoreducing power of TiO 2 /MWCNTs composites in the UV range by means of a plausible auxochrome effect. To the best of our knowledge, this is the first example in the literature in which amines-grafted CNTs materials can function as TiO 2 co-catalysts for converting CO 2 into carboxylic acids.We hope this work opens new avenues for carbon recycling using renewable sources. Figure 1.Synthesis of amine-grafted carbon nanotubes 3-4. Figure 1.Synthesis of amine-grafted carbon nanotubes 3-4. Figure 1.Synthesis of amine-grafted carbon nanotubes 3-4. Figure 2. FT IR spectra mixing spectroscopic grade KBr of PEI-MWCNTs (4). Figure 3. (a) TGA profiles of MWCNTs 1-4'; TEM images of (b) PEI-MWCNTs (4) and (c) p-MWCNTs (1). Figure 3. (a) TGA profiles of MWCNTs 1-4'; TEM images of (b) PEI-MWCNTs (4) and (c) p-MWCNTs (1). Scheme 1: Procedure for hybrid nanocomposites preparation. Scheme 1: Procedure for hybrid nanocomposites preparation. Figure 4. Cont. Figure 4. XRD patterns of samples (a) 4; (b) 1A; (c) 4A-B. Figure 4. XRD patterns of samples (a) 4; (b) 1A; (c) 4A-B. Figure 5. Absorbance spectra in Kubelka-Munk units of photocatalytic materials Scheme 2: Photoreduction of carbon dioxide. Figure 5. Absorbance spectra in Kubelka-Munk units of photocatalytic materials. Photocatalytic conditions were chosen according to the goal of this study: the development of a metal free catalyst system that mimics the natural photosynthetic process, i.e., ambient temperature, sunlight radiation and water as the hydrogen source.As a further aim of this work, we attempted to investigate the influence of radiation source on photocatalysis using two different emitting lamps: (i) the SANOLUX lamp, displaying a higher radiance in the near UV (315-400 nm) and the Xe-Halogen lamp, possessing the major emission power in the visible range (400-700 nm, see FigureS6in Supplemetary Materials).Photoreduction was performed in a water phase suspension (20 mL) of the solid catalyst (with the loading in the range of 7.5-30 mg solid.cat./mL), and monitoring reaction parameters and species produced in both the liquid solution and in the gas phase of the reactor head space43 (see FigureS5).Argon was initially bubbled for 30 min, to avoid the presence of air, then CO 2 for approximately 60 min, to saturate the reaction mixture, upon which suspension was irradiated for 5 h under vigorous stirring at room temperature.Initial pH value of solution after bubbling was found to be equal to 4.78, and raised to 5.80 after reaction.Under the chosen conditions, nanocomposites proved to be active in converting CO 2 into formic and acetic acids (Scheme 2), while neither simple PEI-grafted nanotubes nor bare TiO 2 displayed appreciable activity (Table5, runs 1-2).The optimal irradiaton time of 5 h was ascertained by monitoring photoreduction in the first 7 h of reaction (Figure6).Results showed that prolonged reaction times(5 h) led to the decrease of yield in formic acid with the corresponding increment of acetic acid.A plausible explanation could be related to the partial transformation of HCOOH into CH 3 COOH by reaction with methyl radicals (CH 3 ), according to the general mechanism proposed by S. Sharifnia et al.52. Figure 5. Absorbance spectra in Kubelka-Munk units of photocatalytic materials Scheme 2: Photoreduction of carbon dioxide. Scheme 2. Photoreduction of carbon dioxide. Catalyst loading is 150 mg or 500 mg dispersed in 20 mL of water solution.b S SANOLUX HRC UV-VIS lamp 300 W; H RADIUM Xe-Halogen lamp 400 W. Irradiation time 5 h.c Estimated by ionic chromatography.HCOOH and CH3COOH formation was neither detected in the dark conditions nor without photocatalyst.d Unmodified MWCNTs were hybridized as control composites.e Without CO 2 . Figure 6.Monitoring of yields versus time in photocatalysis with composite 4C (experimental conditions of run 7, Table5). Figure 6.Monitoring of yields versus time in photocatalysis with composite 4C (experimental conditions of run 7, Table5). Figure 7. Recycling of photocatalyst nanocomposite 4C. Figure 7. Recycling of photocatalyst nanocomposite 4C. Figure 8. Activation of CO 2 in photoreduction by PEI through carbamate formation. Figure 8. Activation of CO 2 in photoreduction by PEI through carbamate formation. Figure 9. FT-IR images of TiO 2 PEI-MWCNTs (4C) under photocatalytic conditions (a) before and (b) after CO 2 bubbling. Figure 10.Effect of PEI conjugation on separation of photogenerated electron-hole pairs for TiO 2 PEI-MWCNTs nanocomposite. Scheme 3: Photoreduction of UBA. Figure 10.Effect of PEI conjugation on separation of photogenerated electron-hole pairs for TiO 2 PEI-MWCNTs nanocomposite. Figure 10.Effect of PEI conjugation on separation of photogenerated electron-hole pairs for TiO 2 PEI-MWCNTs nanocomposite. Figure 11.Time course of UBA bleaching monitored at 587 nm.Data are reported as mean value of three replicates standard deviation. Scheme 3. photoreduction of UBA. Figure 10.Effect of PEI conjugation on separation of photogenerated electron-hole pairs for TiO 2 PEI-MWCNTs nanocomposite. Scheme 3: Photoreduction of UBA. Figure 11.Time course of UBA bleaching monitored at 587 nm.Data are reported as mean value of three replicates standard deviation. Preparation of nanocomposites 1A, 1C and 4A-C. a Evaluated based on the weights of suspended MWCNTs and recovered nanocomposites. CO 2 adsorption/desorption ability of amine-grafted MWCNTs. a Adsorption time 6 h.b Desorption time 3 h (see Supplementary Materials for details). CO 2 adsorption/desorption ability of amine-grafted MWCNTs. a Adsorption time 6 h.b Desorption time 3 h (see Supplementary Materials for details). Hybrid nanocomposites preparation. a See Table1for details. b Unmodified MWCNTs were hybridized as control composites. Hybrid nanocomposites preparation. a See Table1for details. b Unmodified MWCNTs were hybridized as control composites. Hybrid nanocomposites preparation. a See Table1for details. b Unmodified MWCNTs were hybridized as control composites. XPS analyses of hybrid nanocomposites. After reaction. XPS analyses of hybrid nanocomposites. After reaction. Catalytic performance of TiO 2 PEI-MWCNT hybrids in the photoreduction of CO 2 .Catalyst loading is 150 mg or 500 mg dispersed in 20 mL of water solution.b S SANOLUX HRC UV-VIS lamp 300 W; H RADIUM Xe-Halogen lamp 400 W. Irradiation time 5 h.c Estimated by ionic chromatography.HCOOH and CH 3 COOH formation was neither detected in the dark conditions nor without photocatalyst. a d Unmodified MWCNTs were hybridized as control composites.e Without CO 2 . Catalytic performance of TiO 2 PEI-MWCNT hybrids in the photoreduction of CO 2 . Materials 2018, 11, 307; doi:10.3390/ma11020307www.mdpi.com/journal/materials Acknowledgments: This research was supported by: Regione Puglia MIUR PON Ricerca e Competitivita 20072013 Avviso 254/Ric.del 18/05/2011, Project PONa3 00369 \"Laboratorio SISTEMA\", the Regione Puglia Project 3Z3VZ46 \"RESTAUREO\", Apulia Region funded NanoApulia (MDI6SR) and Project RELA-VALBIOR, Network of Laboratories for Scientific Research (Italy).Project PON03PE000041, \"MAIND\" MAteriali eco-innovativi e tecnologie avanzate per l'INDustria Manifatturiera e delle costruzioni.The authors wish to thank Ms Annarita Armenise for skilful assistance. The following are available online at http://www.mdpi.com/1996-1944/11/2/307/s1.Detailed XRD, XPS, SEM analyses, CO 2 photoreduction apparatus, Spectra of emission lamps (Figures S1-S6). The authors declare no conflict of interest."
  }
]