[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2020.118876"
  },
  {
    "title": "Article_Title",
    "content": "BiVO4 /Bi4Ti3O12 heterojunction enabling efficient photocatalytic reduction of CO2 with H2O to CH3OH and CO"
  },
  {
    "title": "Abstract",
    "content": "Construction of composite semiconductors is an effective solution to elevate the efficiency of photocatalysis by prolonging lifetime of photogenerated hole and electrons.Herein, a heterojunction structure composite BiVO 4 / Bi 4 Ti 3 O 12 was synthesized via a facile in situ hydrothermal condition.The novel composite photocatalyst has excellent photocatalytic ability to reduce CO 2 with H 2 O into CH 3 OH and CO.The BiVO 4 /10 Bi 4 Ti 3 O 12 sample shows the highest yields of CH 3 OH and CO up to 16.6 and 13.29 mol g -1 h -1 , which was 12.39 and 5.68 times higher than that of pure BiVO 4 , and 9.88 and 2.80 times higher than that of pure Bi 4 Ti 3 O 12 , respectively.Such a high activity is attributed to the type II heterojunction structure which significantly enhances separation of photogenerated carriers and promotes collaboration between the water oxidation on the Bi 4 Ti 3 O 12 and the CO 2 reduction on BiVO 4 .The photocatalytic reaction mechanism of CO 2 on the composite was proposed according to experiment results."
  },
  {
    "title": "Experimental",
    "content": "All the chemical reagents were of analytical grade and purchased from Aladdin Industrial Corporation and used without further purification.Deionized water was used throughout the work. The molten salt synthesis method was used to prepare Bi 4 Ti 3 O 12 , where Bi 2 O 3 and TiO 2 (anatase) were used as raw materials.Since mole ratio of Bi 2 O 3 to TiO 2 is 2:3 in Bi 4 Ti 3 O 12 , Bi 2 O 3 and TiO 2 were mixed by the stoichiometric amounts.Then, NaCl, KCl and Bi 4 Ti 3 O 12 were mixed at a mole ratio of 60:60:1 and continuously grinded for over 30 min with an agate mortar and pestle.The resulting mixture was then calcined at 800 C for 2 h in Muffle furnace.The mixed NaCl and KCl can be totally melted at 800 C according to the eutectic point, which is the vital steps for the generation of Bi 4 Ti 3 O 12 .The resulting white product was washed with deionized water until the ion concentration gets close to zero, followed by overnight drying in an electric oven at 333 K. BiVO 4 nanomaterial was prepared by a simple in situ hydrothermal method.First, 1 mmol bismuth nitrate pentahydrate (Bi(NO 3 ) 3 5H 2 O) and 0.1 g sodium dodecyl benzene sulfonate (SDBS) were separately dissolved in 6 mL and 5 mL of 2 M nitric acid solution under vigorous stirring to obtain the transparency liquid A. 1 mmol NH 4 VO 3 was dissolved in 6 mL of 2 M nitric acid to obtained the solution B. Then, the solution B was poured quickly into the solution A. A clear orange solution was formed after vigorous stirring, and then to which different molar ratios of Bi 4 Ti 3 O 12 was added.In order to adjust the acid concentration to 1 M, the prepared solution was diluted by a certain amount of de-ionized water.The final resulting 35 mL solution was transferred into a 50 ml Teflon-lined autoclave and maintained at 423 K for 12 h, followed by naturally cooling to room temperature.The final product was gathered by centrifugation, rinsed thoroughly with deionized water, followed by desiccation at 60 C in air overnight for further characterization.By the in situ hydrothermal method, BiVO 4 / Bi 4 Ti 3 O 12 samples with different mole ratios (20 mol, 10 mol, and 5 mol ) of Bi 4 Ti 3 O 12 were prepared for comparison.In addition, the nude BiVO 4 as a reference sample was prepared also by the hydrothermal method similar to the above procedure but no adding Bi 4 Ti 3 O 12 .For simplicity, Bi 4 Ti 3 O 12 will be abbreviated as BTO and BiVO 4 done as BVO hereinafter. Bruker D8 Advance X-ray diffractometer (XRD) with Cu K1 radiation ( 1.5406A) was used to analyze the crystalline phases of the samples.Scanning electron microscopy (SEM) images were taken on a field emission scanning electron microscope (Nova Nano SEM 230) was used to observe the morphology.The transmission electron microscopy (TEM) images were obtained via a JEOL model JEM 2010 EX instrument at an accelerating voltage of 200 kV.The chemical compositions of the samples were analyzed by X-ray photoelectron spectroscopy (XPS) spectra by a VG ESCALAB 250 XPS System with a monochromatized Al K X-ray source (15 kV, 200 W, 500 m, pass energy 20 eV).All binding energies (BEs) of the spectra were corrected to the C 1s peak at 284.8 eV of the surficial deposited carbon.UV-vis diffuse reflection spectra (DRS) of the samples were performed with a Cary-500 spectrophotometer, and barium sulfate was used as the reflectance standard.Photoluminescence spectra (PL) were detected at room temperature on a fluorescence spectrophotometer (FLS 980, excitation wavelength 280 nm).In situ CO 2 -adsorbed FT-IR experiments were implemented on a Nicolet 670 FT-IR spectrometer at a resolution of 4 cm -1 and 32 scans.The Brunauer-Emmett-Teller (BET) specific surface area was calculated from the N 2 adsorption isothermal that was determined by a Quantachrome Autosorb IQ-C nitrogen adsorption apparatus.The photoelectrochemical measurements were carried on a conventional three-electrode electrochemical cell consisting of a working electrode (sample), counter electrode (platinum foil) and reference electrode (Ag/AgCl electrode (3.0 M KCl)).The photocurrent with light/dark short-circuit response was recorded by a BAS Epsilon workstation.Sodium sulfate electrolyte solution (0.2 M) was used as the electrolyte solution.The UV-vis irradiation source was a 300 W Xe lamp.The work functions of BiVO 4 and Bi 4 Ti 3 O 12 were determined by Kelvin probe system (SKP5050, KPTechnology Ltd.) with a single-point measurement.Also, the contact potential difference (CPD) between the sample and the tip (gold, 5.1 eV) was measured in the dark.The work function of the tip was initially corrected using a gold disk.The work function of the sample was calculated by the following formula: WF of sample WF of tip CPD The photocatalytic reduction of CO 2 with H 2 O vapor was carried out in a 270 mL Schlenk flask reactor under atmospheric pressure at ambient temperature (298 K).The reactor was equipped with two venting valves and a sampling port sealed with a silicone rubber septum.The light source, a 300 W commercial Xe lamp with a focus intensity of 0.2 W cm -2 (300D, Perfectlight, China), was vertically placed outside the reactor.10 mg photocatalyst powder was dispersed in the bottom of reactor.Subsequently, the reactor was evacuated by a mechanical pump and filled with pure CO 2 gas at atmospheric pressure.This evacuation-filling operation was repeated several times to remove residual air. 10 L of pure water was injected into the reactor from the silicone rubber septum by a microsyringe and then the photosource was turned on.After 3 h irradiation, 0.5 mL reaction gas was sampled from the reactor and analyzed by a gas chromatograph (GC-7890B, Agilent) equipped with a flame ionization detector (FID), and a thermal conductivity detector (TCD) and a chromatographic column (TDX-01).which could be seen clearly from the XRD peaks at 2 28 31(Fig.1b).It's worth noting that a new diffraction peak appears at 2 11.9withincreasing BTO content (Fig. 1b).These show that both BiVO 4 and Bi 4 Ti 3 O 12 keep their respective crystal phase in their composite, and there is interaction occurring at the interface between them."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The photocatalytic CO 2 reduction with H 2 O on the as-prepared photocatalysts was investigated under a 300 W Xe lamp irradiation without using any sacrificial reagent, as shown in Fig. 2. Two carboncontaining products CO and CH 3 OH were detected as main products for the reactions 42,43.However, evolution rates of products were different for BiVO S3), and its amount is close to the stoichiometric value estimated from the practical evolution amount of CO and CH 3 OH and reaction equations (CO 2 CO 1/2O 2 , and CO 2 2H 2 O CH 3 OH 3/2O 2 ).In addition, the stability test, as showed in Fig. 2b, indicates that the BiVO 4 /10 Bi 4 Ti 3 O 12 sample maintains stable activity after 4 cycles in total 12 h.And in the cycle process, the phase structure of the photocatalyst has not noticeable change before and after the cycle reaction (Figure S4).The photocatalytic activity level of BiVO 4 /10 Bi 4 Ti 3 O 12 is higher than that of many photocatalyst for the reduction of CO 2 with H 2 O to CH 3 OH and/or CO in the comparable conditions 42,44,2.3c andd).In addition, the BiVO 4 particles are uniformly distributed without significant agglomeration on the surface of Bi 4 Ti 3 O 12 and the size of BiVO 4 is obviously smaller than that in the nude state.Figure S6 shows the UV-vis diffuse reflection spectra of BiVO 4 , BiVO 4 /10 Bi 4 Ti 3 O 12 and Bi 4 Ti 3 O 12 .The nude BiVO 4 shows a bandedge absorption at ca. 545 nm, corresponding to a band gap energy of 2.45 eV (Figure S6a).Bi 4 Ti 3 O 12 exhibits an obvious band-edge absorption with wavelength at ca. 405 nm, corresponding to a band gap energy of 3.19 eV (Figure S6a), which has no difference with that reported for Bi 4 Ti 3 O 12 in the literature 38.The band-edge absorption of BiVO 4 /10 Bi 4 Ti 3 O 12 slightly shifts towards shorter wavelengths with increasing content of Bi 4 Ti 3 O 12 .The valence band potentials of BiVO 4 and Bi 4 Ti 3 O 12 , which were estimated by the valence band spectrum method 30,45 are 1.65 and 1.30 eV (vs.NHE), respectively (Figure S6b).Combined with the band gaps, we could estimate that the conduction band potentials of BiVO 4 and Bi 4 Ti 3 O 12 are -0.80V and -1.89 V, respectively.The conduction band potential of BiVO 4 is more negative than the reported (-0.45 -0.2 V) 30,40.On this account, the conduction band positions of BiVO 4 was verified further by the Mott-Schottky (MS) plot method (Figure S7) to be -0.78V vs NHE), which is almost identical with that estimated by valence band spectrum.The difference of conduction band potentials of BiVO 4 from the some literature values could result from the changes in structure factors, including the morphology, size, crystal and surface defect, etc. induced by different preparation method. Kelvin probe technology with single-point measurements over 600 points was applied to determine work functions of the two semiconductor materials, as shown in Fig. 6.Since CPD for Bi 4 Ti 3 O 12 is higher than that for BiVO 4 , therefore the work function (WF) of Bi 4 Ti 3 O 12 (5.78eV) is higher than that of BiVO 4 (5.5 eV).Further combined with electron affinity data (EA) of Bi 4 Ti 3 O 12 (5.868The charge transfer direction in the BiVO 4 /Bi 4 Ti 3 O 12 sample was confirmed by a photoinduced redox probe reactions, Pt 4 e - Pt, and Mn 2 h OH - MnO x 7.shows some weak IR bands in the range of 1000 -1600 cm -1 on the BiVO 4 /10 Bi 4 Ti 3 O 12 , which belongs to different adsorption states of CO 2 32,46.However, after light irradiation, besides the surface adsorption species CO 2 observed before illumination, other some bicarbonate species were found, such as the formate (HCOO -) species at 1340 cm -1 , monodentate carbonate at 1539 cm -1 , bidentate carbonate at 1238 cm -1 and 1160 cm -1 , and methoxy at 1029 and 1078 cm -1 47,48.This suggests that CO 2 undergoes these complex intermediate states and is finally reduced to CH 3 OH and CO on the photocatalyst. The possible reduction mechanism of CO 2 over the BiVO 4 /Bi 4 Ti 3 O 12 heterojunction composites is proposed in Fig. 11, based on the above results and the previous reports 49,50.Products CO and CH 3 OH may be produced from two parallel photocatalytic routes.First, CO 2 molecule is adsorbed on the surface of BiVO H into one carboxyl radical and then further reduced by another photogenerated electron and H to CO and H 2 O.The whole process can be expressed as CO 2 H 2 O CO 1/2O 2 H 2 O (where H 2 O takes part in the reaction, but it was eventually released).This mechanism is similar to that on BiOBr we suggested previously 2.(ii) It is reduced by the two photogenerated electron and 2H into -CH 2 O 2 species, and then undergoes the subsequent series processes, including the hole-oxidizing lattice oxygen, the oxygen vacancy despoiling O 2-in H 2 O, the reaction with photogenerated electrons and H ions, etc., finally to CH 3 OH step by step.The whole process can be expressed with chemical equation CO 2 2H 2 O CH 3 OH 3/2O 2 .Because the two routes involve similar intermediate species, in theory there should be near product selectivity.But in fact, selectivity of CH 3 OH is slightly higher than that of CO, which can be related with the dosage of reactant H 2 O (this result will be published in separated paper)."
  },
  {
    "title": "Conclusions",
    "content": "A novel BiVO 4 /Bi 4 Ti 3 O 12 heterojunction composite was successfully designed and synthesized via a facile in situ hydrothermal approach.The composite photocatalyst showed superior activity for photocatalytic CO 2 reduction with pure H 2 O. Thereinto, the BiVO 4 /10 Bi 4 Ti 3 O 12 composite showed much higher photocatalytic activity than the composites with other content of Bi 4 Ti 3 O 12 as well as the nude BiVO 4 or the nude Bi 4 Ti 3 O 12 .The reaction products are methanol and carbon monoxide, the yield of them are up to 16.6 and 13.29 mol g -1 h -1 respectively, which are 12.39 and 5.68 times higher than that of pure BiVO 4 , and 9.88 and 2.80 times higher than that of pure Bi 4 Ti 3 O 12 .Such a high activity was ascribed to the type-II heterojunction formed between BiVO Fig. 1a shows XRD pattern of samples at 2 5 80.The diffraction peaks of the nude Bi 4 Ti 3 O 12 sample match with that of tetrahedron phase (JCPDS No. 72-1019).Diffraction peaks of the nude BiVO 4 sample could be indexed to the monoclinic scheelite phase (JCPDS No. 75-1867), and no impurity peaks were observed.These indicate that both the as-prepared Bi 4 Ti 3 O 12 and BiVO 4 are highly pure and high-crystallized.When Bi 4 Ti 3 O 12 was composited with BiVO 4 , the resulting composites show the diffraction peaks of both Bi 4 Ti 3 O 12 and BiVO 4 , and the diffractions of Bi 4 Ti 3 O 12 become strong and the diffractions of BiVO 4 become weak with increasing content of Bi 4 Ti 3 O 12 ,which could be seen clearly from the XRD peaks at 2 28 31(Fig.1b).It's worth noting that a new diffraction peak appears at 2 11.9withincreasing BTO content (Fig.1b).These show that both BiVO 4 and Bi 4 Ti 3 O 12 keep their respective crystal phase in their composite, and there is interaction occurring at the interface between them. 4 , BiVO 4 /Bi 4 Ti 3 O 12 and Bi 4 Ti 3 O 12 photocatalysts.All the BiVO 4 /Bi 4 Ti 3 O 12 heterojunction samples are much better than both the pure BiVO 4 and the pure Bi 4 Ti 3 O 12 in the photocatalytic activity.Thereinto, BiVO 4 /Bi 4 Ti 3 O 12 with 10 mole of Bi 4 Ti 3 O 12 exhibits the highest activity (CH 3 OH yield 16.6 mol g -1 h -1 , CO yield 13.29 mol g -1 h -1 ), which are 12.39 and 5.68 times that on pure BiVO 4 , or 9.88 and 2.80 times that on pure Bi 4 Ti 3 O 12 .The two requisite controlling experiments were performed in order to confirm the photocatalytic reaction of samples (Figure S1).For samples BiVO 4 /10 Bi 4 Ti 3 O 12 , only a trace amount of CO and CH 3 OH was detected under illumination without CO 2 , or without illumination in presence of CO 2 .Importantly, the evolution amount of CO and CH 3 OH are much lower than those in the presence of both illumination and CO 2 , indicating that CO and CH 3 OH products are originated from the photocatalytic reaction of the introduced CO 2 with H 2 O.A BiVO 4 /10 Bi 4 Ti 3 O 12 sample was prepared by mechanical mixture of 10 Bi 4 Ti 3 O 12 with BiVO 4 for comparison.As expected, the photocatalytic activity of the mechanically mixed sample is much lower than that of the hydrothermal samples BiVO 4 /10 Bi 4 Ti 3 O 12 (Figure S2).These experimental results indicate that the hydrothermal loading of Bi 4 Ti 3 O 12 markedly improves the photocatalytic activity of BiVO 4 for the reduction of CO 2 with H 2 O to CH 3 OH and CO.More importantly, O 2 was detected meanwhile by gas phase chromatography (Figure Fig. 3 shows SEM images of samples BiVO 4 , BiVO 4 /10 Bi 4 Ti 3 O 12 , Fig. 2. (a) CH 3 OH and CO evolutions on the BiVO 4 /Bi 4 Ti 3 O 12 with different Bi 4 Ti 3 O 12 content under a 300 W Xe lamp, (b) photocatalytic activity stability of the BiVO 4 /10 Bi 4 Ti 3 O 12 sample during 12 h by 3 h per circulation. shows TEM images of the BiVO 4 /10 Bi 4 Ti 3 O 12 sample.Fig. 4a demonstrates the contact relationship of two components.The lattice fringes of BiVO 4 and Bi 4 Ti 3 O 12 are observed together, which belong to the (103) plane of BiVO 4 (PDF75-1687, 0.315 nm) and the (113) plane of Bi 4 Ti 3 O 12 (PDF72-1019, 0.464 nm), respectively.This implies that both BiVO 4 and Bi 4 Ti 3 O 12 keep their well-defined crystal phase,but they are in intimate contact each other and the former is located on the outside of the latter (Fig.4b).Element mapping profiles of a single granule of BiVO 4 /10 Bi 4 Ti 3 O 12 are showed in Fig.4c, which is further proof that the BiVO 4 particles grow on the surface of Bi 4 Ti 3 O 12 nanosheets, since the element Bi has the same distribution profile as the element V and is denser than the element Ti, and element O has the biggest distribution scope. Electron structure of BiVO 4 /Bi 4 Ti 3 O 12 Chemical states of the elements in the BiVO 4 , Bi 4 Ti 3 O 12 , and BiVO 4 / 10 Bi 4 Ti 3 O 12 samples were analyzed by XPS, as shown in Fig. 5.All spectra were regulated to the C 1s peak at 284.8 eV of surficial deposited carbon.According to the fully scanned spectra (Figure S5), element Bi, Ti, V, O, and C indeed co-exist in BiVO 4 /10 Bi 4 Ti 3 O 12 .From Fig. 5a, the binding energy (BE) of Bi 4f 7/2 and Bi 4f 5/2 is respectively 159.00 eV and 164.28 eV for the nude BiVO 4 , while it is 158.79 eV and 164.09 eV for the nude Bi 4 Ti 3 O 12 , respectively.For the BiVO 4 /10 Bi 4 Ti 3 O 12 sample, the binding energy of Bi 4f 7/2 and Bi 4f 5/2 is in between that of Bi 4 Ti 3 O 12 and that of BiVO 4 but close to that of BiVO 4 .This shows the electron transfer occurring from BiVO 4 to Bi 4 Ti 3 O 12 , which is an indication of heterojunction formation.The asymmetric O 1s XPS peak could be deconvoluted into two peaks at 529.76 eV and 531.64 eV that are assigned to the surface lattice oxygen and adsorbed oxygen, respectively (Fig. 5b).For both Bi 4 Ti 3 O 12 and BiVO 4 /10 Bi 4 Ti 3 O 12, the Ti 2p peaks have partial overlap with that of Bi 4d 3/2, but the BEs of Ti 2p in the later are lower than that in Bi 4 Ti 3 O 12 (Fig. 5c), which are consistent with previous reports 36.This further verifies the electron transfer from BiVO 4 to Bi 4 Ti 3 O 12 .According to Fig. 5d, the BEs of V 2p 3/2 and V 2p 1/2 (516.76 and 524.27 eV) in the BiVO 4 /10 Bi 4 Ti 3 O 12 are slightly higher than that (516.69 and 524.14 eV) in BiVO 4 , which also indicates electron transfer from BiVO 4 to Bi 4 Ti 3 O 12 .All the above results suggest that the electrons migrate from BiVO 4 to Bi 4 Ti 3 O 12 in BiVO 4 /Bi 4 Ti 3 O 12 , which leads to formation of a heterojunction with built-in electric field direction between BiVO 4 and Bi 4 Ti 3 O 12 . Fig. 3. SEM image of (a) BiVO 4 , (b) Bi 4 Ti 3 O 12 , (c-d) BiVO 4 /10 Bi 4 Ti 3 O 12 . ) and BiVO 4 (6.04),Fermi-level of Bi 4 Ti 3 O 12 is lower than that of BiVO 4 (E f WF-EA).Based on the above results, band alignment of the heterojunction composite Bi 4 Ti 3 O 12 /BiVO 4 with electron structure parameters is show in Fig. 7.The CB and VB positions are staggered between Bi 4 Ti 3 O 12 and BiVO 4 .Upon formation of heterojunction, electrons thermally migrate from BiVO 4 towards Bi 4 Ti 3 O 12 until reaching Fermi energy equality and forming the stable built-in electric field along with band bending.Under Xe lamp illumination, both Bi 4 Ti 3 O 12 and BiVO 4 are excited to generate electrons and holes, the built-in electric field with direction from BiVO 4 to Bi 4 Ti 3 O 12 would induce transfer of the photogenerated electrons from Bi 4 Ti 3 O 12 to BiVO 4 21, 22, 30.As a result, the photoelectrons on the conduction band of Bi 4 Ti 3 O 12 transfer to that of BiVO 4 where the adsorbed CO 2 is reduced into CH 3 OH and CO.The photogenerated holes transfer from the valance band of BiVO 4 to that of Bi 4 Ti 3 O 12 where H 2 O is oxidized into O 2 .Although the effective band gap of the composite BiVO 4 /Bi 4 Ti 3 O 12 become narrow or its reduction ability lowers compared to Bi 4 Ti 3 O 12 and its oxidation ability lowers compared to BiVO 4 , the redox potential of composite remain meet requirement of both reducing CO 2 and oxidizing H 2 O.More importantly, the heterojunction can effectively increase the separation rate and the lifetime of photogenerated electrons and holes by accelerating the directed migrations of the photogenerated electrons from Bi 4 Ti 3 O 12 to BiVO 4 and of the photogenerated holes from BiVO 4 to Bi 4 Ti 3 O 12 . Fig. 8a is SEM images of the BiVO 4 /Bi 4 Ti 3 O 12 sample after only photodeposition of Pt by UV irradiating the suspension solution with the sample and chloroplatinic acid (H 2 PtCl 6 6H 2 O).Fig. 8b is SEM images of BiVO 4 /10 Bi 4 Ti 3 O 12 , after co-photodeposition of Pt and MnOx by UV irradiating the suspension with BiVO 4 /10 Bi 4 Ti 3 O 12 , H 2 PtCl 6 6H 2 O and MnCl 2 .By comparison of the deposited species images on the two images, we could distinguish clearly that Pt particles (bright specks) and MnO x particles (dark Fig. 4. (a) TEM and (b) HRTEM images of 10 BiVO 4 /Bi 4 Ti 3 O 12 , (c) EDX mapping images of Bi, O, Ti and V, respectively. Fig. 9a shows the PL spectra of the two single semiconductors and the composite BiVO 4 /Bi 4 Ti 3 O 12 upon 280 nm light excitation.The lowest PL intensity of the BiVO 4 /10 Bi 4 Ti 3 O 12 sample indicates the lowest recombination of photogenerated charge carriers, which indicates the inhibiting effect of the heterojunction on the photogenerated electron-hole combination.The periodic on/off photocurrent responses of the BiVO 4 , Bi 4 Ti 3 O 12 , and BiVO 4 /10 Bi 4 Ti 3 O 12 samples under visible light are displayed in Fig. 9b.The BiVO 4 /10 Bi 4 Ti 3 O 12 sample shows stronger photocurrent than both the nude Bi 4 Ti 3 O 12 and the nude BiVO 4 , which indicates higher separation efficiency of the photogenerated carriers on the BiVO 4 /10 Bi 4 Ti 3 O 12 sample than on the two individual semiconductor components. Fig. 5.The Bi 4f (a) O 1s (b) Ti 2p (C) and V 2p (d) spectra of BiVO 4 , BiVO 4 /10 Bi 4 Ti 3 O 12 and Bi 4 Ti 3 O 12 . Fig. 6.CPD of the BiVO 4 and Bi 4 Ti 3 O 12 surfaces relative to an Au reference at single-point measurements over 600 points. Possible mechanism of photocatalytic reduction of CO 2 with H 2 O In situ FTIR technology was used to characterize the adsorption states of CO 2 on the sample surface in order to make clear the photocatalytic mechanism.Fig. 10 is the FTIR spectra of BiVO 4 , Bi 4 Ti 3 O 12 and BiVO 4 /10 Bi 4 Ti 3 O 12 before and after the illumination.It can be seen that there is different interaction between CO 2 and the surface of photocatalysts so as to form different surface species before and after illumination.Most notably, BiVO 4 shows much stronger interaction with CO 2 than Bi 4 Ti 3 O 12 , while the sample BiVO 4 /10 Bi 4 Ti 3 O 12 shows stronger interaction with CO 2 than both the nude BiVO 4 and the nude Bi 4 Ti 3 O 12 , which can be observed from the IR spectra in the carbonyl region.It is concluded from the IR subtraction spectra that BiVO 4 mainly serves as active sites of photocatalytic reduction of CO 2 , since CO 2 adsorption bands on BiVO 4 /10 Bi 4 Ti 3 O 12 are more like that on the nude BiVO 4 .Before illumination, CO 2 Fig. 8. SEM image of the BiVO 4 /10 Bi 4 Ti 3 O 12 after loading Pt (a) and simultaneously co-loading Pt and MnO x particles (b) by a photodeposition under UV-light. Fig. 9. (a) PL spectra and (b) light/dark photocurrent response of BiVO 4 , BiVO 4 /10 Bi 4 Ti 3 O 12 and Bi 4 Ti 3 O 12 . Fig.10.In situ FTIR subtraction spectra of CO 2 on the photocatalysts before illumination and after illumination for 30 min. 4 and Bi 4 Ti 3 O 12 , which could boost highly efficient separation and directed transfer of photogenerated charge carriers.The physicochemical characterization results suggest that CO 2 was reduced through two parallel routes involving different intermediate states to CH 3 OH and CO.This work shows that the heterojunction combination of BiVO 4 with Bi 4 Ti 3 O 12 could synchronously realize efficient photocatalytic reduction of CO 2 and photocatalytic oxidation of H 2 O without adding any sacrificial reagents and co-catalyst.Credit author statement Yingshu Wang, Huaxiang Lin and Meichao Gao conceived the idea and designed this study.Xianying, Wang, Yingshu Wang and Meichao Gao contributed equally to this work, and synthesized the samples and conducted characterizations.Xianying Wang performed photocatalytic reactions.Xipeng Pu tested and analyzed the SEM tests.Xianying Wang, Yingshu Wang, Meichao Gao, Zizhong Zhang, Jinni Shen and Xuxu Wang wrote the paper.All authors discussed the results and edited the paper. Fig. 11.Suggested possible mechanism of photocatalytic reduction of CO 2 with H 2 O. This work is financially supported by the National Natural Science Foundation of China (Grants No. 21673043, 51702053, 21673042), the Natural Science Foundation of Fujian Province of PR China (2017J01411), and the Technology Project of Education Office of Fujian Province of PR China (JAT160045). The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary material related to this article can be found, in the online version, at doi:https://doi.org/10.1016/j.apcatb.2020.118876."
  }
]