[
  {
    "title": "Doi",
    "content": "10.1016/j.jcou.2013.12.002"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic conversion of CO2 to hydrocarbons by light-harvesting complex assisted Rh-doped TiO2 photocatalyst"
  },
  {
    "title": "Abstract",
    "content": "Global warming is caused by greenhouse gases, such as CO 2 , N 2 O, CH 4 , PFCs and CFCs, the concentration of which has increased rapidly in the atmosphere due to the wide use of fossil fuels.According to NOAA reports, the daily mean concentration measurements of atmospheric CO 2 reached the 400 ppm milestone in May 2013 and the global average is following rapidly, with measurements at the oldest continuous carbon dioxide measurement station in the world (Mauna Loa, Hawaii), showing a 2.1 ppm increase per year 1.In the meantime, the global average temperature is increasing at a rate of 0.65 8C per century 2.Because of the serious problems caused by increasing atmospheric concentrations of CO 2 , strategies are being developed to transform it to other useful organic compounds, such as methane, methanol, ethanol etc.Unfortunately, CO 2 is a thermodynamically stable compound that requires additional energy in order to be reduced, for instance thermal energy, high pressure or a forced voltage.However, providing additional energy to reduce CO 2 may itself consume fossil fuels resulting in no net decrease in atmospheric CO 2 .Therefore, the use of solar energy to drive the photocatalytic reaction is an attractive option 345678910111213.Solar energy is a clean and sustainable energy source capable of exciting the photocatalyst and leading to the separation of electron-hole pairs to reduce CO 2 .TiO 2 is a photocatalyst that has been commonly used in degrading toxic organic compounds for many years, as it is nontoxic and chemically stable.However, its large band gap means it can only absorb ultraviolet (UV) light, which is approximately 4 of sunlight.Many research groups have tried to dope some materials into TiO 2 to extend its absorption range towards the visible region 9,10,13.For example, Zhang et al. 13 doped I into TiO 2 and their UV-vis data showed that this narrowed the band gap from 3.13 eV to 3 eV, thus enhancing the absorption in the visible light region.They found that under visible light, the yield of CO reached 2.4 mmol g A1 h A1 .Another group then doped anatase TiO 2 with Ru on SiO 2 , and applied the photocatalyst to reduce CO 2 using 2-propanol as a hole scavenger 9.To compare the effect of Ru loading, the authors calculated the yields of CH 4 and CH 3 OH at doping concentrations from 0.1 wt to 1 wt.The results indicated"
  },
  {
    "title": "Experimental",
    "content": "LHCII was extracted from spinach leaves by isoelectric focusing (IEF) of unstacked thylakoids as described in Ruban et al. 19.For the preparation of the Rh-doped TiO 2 , Rh-acetate was used as the precursor 20.As shown in Fig. 1(a), the pre-determined amounts of n-butanol, the Rh precursor, Ti-butoxide and glacial acetic acid were mixed and stirred for 6 h to form a sol.Then the resulting sol was transferred to a Carbolite CWF 1100 chamber furnace and dried at 150 8C for 2 h followed by calcination at 500 8C for 1.5 h to form TiO 2 :Rh.The solid TiO 2 :Rh was then manually crushed into powder for 20 min by mortar and pestle.The resulting TiO 2 :Rh is anatase TiO 2 with a Rh doping ratio of 0.02 wt.This doping ratio was selected because it showed high yields using UV light in Liu et al. 21.Optimisation with respect to doping ratio is expected to give different results for visible light but this was not tested in the scope of this paper. For the preparation of the TiO 2 :Rh-LHCII photocatalyst, powder TiO 2 :Rh was mixed in a dilute LHCII solution for 2 h at pH 5.3, as shown in Fig. 1(b).The mixture consisted of 20 mg TiO 2 :Rh/mL, 25 mM 4-(2-hydroxyethyl) piperazine-1-ethanesulfonic acid (HEPES), 0.1 mg n-dodecyl b-D-maltoside (b-DM)/mL and LHCII with chlorophyll concentration of 2.11 mg/mL.Finally, the mixture was centrifuged to form a pellet of the catalyst.The supernatant liquid was removed, and the catalyst was left to dry at room temperature.A control catalyst, TiO 2 :Rh-b-DM Hepes, was prepared similarly to TiO 2 :Rh-LHCII but without the addition of LHCII in the HEPES-b-DM solution. The morphology and elemental composition of the prepared samples were characterised by scanning electron microscopyenergy dispersive spectroscopy (SEM-EDX, LEO 1530 Field Emission).The particle size was estimated by transmission electron microscopy (TEM, Hitachi H-7100).The band gap, threshold wavelength and the absorbance of UV light were measured using the UV/vis spectrophotometer (UV/vis, CARY).The thermal stability of the catalyst was analysed by a thermogravimetric analyser (TGA, Perkin Elmer PYRIS 1), which was operated with a temperature programmed from 30 8C to 800 8C.Approximately 0.5 g catalyst was placed on the platinum cup, and the temperature was raised to 800 8C to observe the temperature of LHCII degradation.X-ray photoelectron spectroscopy (XPS) was performed using Thermo Scientific, Theta Probe with an aluminium anode, typically operated at 3 mA emission current and 12 kV anode potential.The binding energy of high-resolution scans was corrected to the C 1s peak at 285 eV.The XPS peak intensity was quantified to the amounts of each element present.The crystalline phases of the catalysts were identified by powder X-ray diffraction (XRD) patterns using a Rigaku X-ray powder diffractometer.The crystal size of particles was calculated from the XRD peak broadening using Scherrer's equation.The specific surface area and pore size distribution of the catalysts were obtained from N 2 adsorption by using a Micromeritics ASAP 2020.The performance of TiO 2 :Rh and TiO 2 :Rh-LHCII was compared by the photocatalytic reduction of CO 2 in aqueous solution.A 300 W xenon lamp was the light source.As shown in Fig. 2, the spectrum of the xenon lamp ranges from 300 nm to 1000 nm and contains most of the visible and infrared light as well as a small amount of UV.The catalyst was dispersed in a quartz reactor to perform CO 2 photoreduction.The distance between the light source and the reactor was 30 cm so that the heat of the xenon lamp would not raise the temperature of the reactor.The light intensity was 362 mW/cm 2 in front of the reactor. Before the photoreaction, 0.2 g catalyst was dispersed in 180 mL DI water in the reactor and helium was used to purge the reactor for 1 h, to remove residual air and organic compounds dissolved in the solution.After confirming by GC that no organic compounds remained in the reactor, the purge gas was switched to CO 2 for 30 min to saturate the solution before turning on the light.To increase the solubility of CO 2 in water, the CO 2 pressure was adjusted to 1.1 bar by a back-pressure regulator.A 3 mL liquid sample was collected by syringe for GC analysis every hour.After the reaction, the catalyst was collected and analysed by UV-vis and TGA to detect any changes to its surface. Reaction products were analysed by gas chromatography (GC) with a flame ionisation detector (FID).A 2 m Parapak Q was chosen as the separation column.To further sensitise the detection of CO, the GC was also connected to a methaniser which selectively transforms CO to CH 4 with H 2 at 360 8C using a Ni catalyst.The injected sample was separated by the GC column first, and then carried by helium into the methaniser.After the CO signal appeared on the GC spectrum, the sample stream was switched to another exit to avoid high concentration CO 2 being carried into the methaniser.Then the sample stream was switched back to analyse other products after purging out CO 2 .Thus CO can be quantitatively measured indirectly by the FID in the GC.To prevent the catalyst powder from entering and blocking the column, the sample was centrifuged before injecting into the GC. Additional experiments were run to confirm that the detected products resulted from the reduction of CO 2 instead of the degradation of LHCII.The variables for these experiments were the type of material used as the catalyst, the gas in the reactor and the light conditions.Table 1 shows the conditions of each of these control experiments as well as the conditions of the original photoreduction experiments for comparison. Control 1 was performed to test whether LHCII is degraded by the light and produces small organic compounds.Therefore LHCII solution, without TiO 2 :Rh, was illuminated in the reactor.He gas was used to purge the reactor as in the original experiment, but no CO 2 was added, to ensure that LHCII would be the only source of any organics if these were detected. Control 2 tested if LHCII alone can function as a catalyst to produce organics from CO 2 .In this case also no TiO 2 :Rh was added but, in contrast to Control 1, the reactor was filled with CO 2 after purging with He. It was suspected that TiO 2 :Rh might actively degrade the LHCII during the reaction.To test this, Control 3 was designed and performed.In this experiment TiO 2 :Rh-LHCII was suspended in DI water, as in the original, but the reactor was not filled with CO 2 following the He purging.Consequently, if the source of any products was the LHCII treatment solution, meaning the LHCII or the HEPES and b-DM, these would also be detected in this experiment.Control 4 was performed to ensure the latter were not the source of the organic compounds.TiO 2 :Rh-HEPES b-DM was used as the catalyst and no CO 2 was added to the reactor. Finally, a dark control (Control 5) with TiO 2 :Rh-LHCII and CO 2 was performed, where the reactor was not illuminated by the light source, to confirm that the process producing the hydrocarbons is photoreduction, meaning that light is necessary. Fourier transform infrared spectroscopy (FT-IR) was performed with an OmniCure light source, the light wavelength of which ranges between 400 and 500 nm, in order to corroborate the result from the GC analysis and to reveal the mechanism of the photoreaction.A semi-dome reactor was purchased from Harrick, USA.The top cover of the reactor had three circular windows, one for UV and visible light irradiation and the other two for IR beams.The catalyst was placed at the bottom of the reactor which was then purged with He for 1 h at 40 8C to remove the H 2 O moisture and organic compounds in the atmosphere.Following that, a mixture of CO 2 , H 2 and Ar flowed into the reactor for 40 min and was then turned off by two valves to seal the reactor and perform a batch reaction.The ratio of CO 2 :H 2 :Ar was 2:1:1.Finally the light irradiated the catalyst to perform in situ FT-IR analysis and the spectrum was recorded."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Fig. 3 shows the UV-vis spectra of LHCII and the photocatalysts.As shown in Fig. 3(a), the absorption peaks at 400-500 nm and 650-700 nm are characteristic of the LHCII.Commercial TiO 2 (Degussa P25) absorbed UV irradiation at 200-400 nm, while the TiO 2 doped with Rh extended the absorption edge to 400-500 nm in the visible light region as shown in Fig. 3(b).The band gap of photocatalyst can be estimated by extrapolating the absorption edge of UV-vis spectrum to the abscissa of zero absorption.The band gap of the TiO 2 :Rh is estimated to be 2.95 eV, which is lower than that of commercial TiO 2 (3.18 eV).After loading LHCII on TiO 2 :Rh, there was only a slight enhancement in absorbance from 400 to 500 nm.An additional peak also appeared near 670 nm which is a known adsorption peak of LHCII, as shown in Fig. 3(a).The TiO 2 :Rh-LHCII catalyst was analysed by UV-vis again after it was used in the reactor.In that case, the LHCII peaks are decreased or lost. The catalysts were analysed by TGA to check the stability of LHCII on TiO 2 :Rh and to estimate the amount of protein complex loaded.Fig. 4 shows that the weight of TiO 2 :Rh decreased with temperature.Water loss from the catalyst surface led to the weight loss of the catalyst in the range of 30-100 8C.The weight loss at 200-500 8C might be attributed to the decomposition of organic compounds.As the temperature rose between 300 8C and 400 8C, there was a significant weight loss in TiO 2 :Rh-LHCII compared to TiO 2 :Rh which was caused by degradation of the LHCII.The LHCII was estimated to be 0.9 wt on the surface of TiO 2 :Rh.In order to study the changes to LHCII on the catalyst after reaction, the used catalyst was also analysed by TGA.The weight loss of the used catalyst was less than that of the fresh catalyst, indicating that some components of LHCII may have been lost or leached during the photoreaction in aqueous solution. Combined, the UV-vis and TGA analyses indicate that the LHCII material was lost after the photoreaction, which may suggest that it was degraded during the reaction and was the source of organic products.However, the control photoreaction experiments as well as the timeline of compound production confirm that this was not the case, as will be discussed in Sections 3.2 and 3.3. Fig. 5 shows the binding energies of Ti 2p 3/2 of TiO 2 :Rh, TiO 2 :Rh-LHCII and pure TiO 2 .Compared to Ti 2p 3/2 binding energies of pure TiO 2 which was at 455.9 eV, a red shift was observed for TiO 2 :Rh and TiO 2 :Rh-LHCII catalysts at 455.4 eV.According to the study of Niishiro et al., Rh will be oxidised when substituting Ti in the crystal structure of TiO 2 22 and so it will be in ion form.Therefore, to satisfy the charge balance, part of the Ti 4 ions near the Rh will be reduced to Ti 3 , which causes the red shift. Fig. 6 shows the XRD patterns of TiO 2 (P25), TiO 2 :Rh and TiO 2 :Rh-LHCII.After calcination at 500 8C, all diffraction peaks for the TiO 2 :Rh catalyst can be indexed to the tetragonal anatase phase TiO 2 which was confirmed by comparison with the Joint Committee on Powder Diffraction Standards (JCPDS) Card File No. 21-1272.Compared with the XRD pattern of TiO 2 , no rutile phase appeared on TiO 2 :Rh and TiO 2 :Rh-LHCII.The catalyst particle size was calculated by Scherrer's equation to be near 12 nm, which was consistent with Liu's work 21.Fig. 7 shows two catalysts by SEM.The SEM image of TiO 2 :Rh shows sharp edges and corners.However, from the SEM photo of the TiO 2 :Rh-LHCII several layers can be observed stacked on top of each other.The concentration of the elements in the catalysts was measured by EDX and the data is summarised in Table 2.The atomic ratio of Ti to O is near 1:2 for the TiO 2 :Rh catalyst, while for TiO 2 :Rh-LHCII it is approximately 1:1.Due to the adsorption of LHCII on TiO 2 :Rh, part of the O atoms near the surface may be covered and thus less O may be detected.Also the C content increased due to the addition of LHCII.C could also be detected on TiO 2 :Rh so we postulate that the source of the C in this case is the organics from the atmosphere.Fig. 8 shows the TEM image of TiO 2 :Rh.TiO 2 :Rh-LHCII was also analysed by this method producing a similar image and so this is not shown.It confirmed that the catalyst is not structurally affected by the LHCII adsorption.The particle sizes of both catalysts were in the range of 20-30 nm.Compared to the crystal size estimated from XRD peak broadening, TEM shows a larger size for the particles, potentially due to aggregation during sample preparation. The N 2 adsorption by BET (Brunauer, Emmett and Teller) analysis showed that the surface area of TiO 2 :Rh and TiO 2 :Rh-LHCII was 47.5 and 46.2 m 2 /g, respectively, while the pore size for both samples was between 4 and 6 nm.TiO 2 :Rh-LHCII had a slightly smaller surface area than TiO 2 :Rh due to the covering of LHCII material on the surface. The efficiency of the catalysts in reducing CO 2 was investigated in an aqueous-phase reaction.Fig. 9 shows the yields of products when using TiO 2 :Rh or TiO 2 :Rh-LHCII.CO could be detected after the first hour of the reaction with both catalysts.In addition to CO, acetaldehyde and a small amount of methyl formate were also produced when using either of the two catalysts.The yield of acetaldehyde when using TiO 2 :Rh-LHCII was about ten times higher than that of TiO 2 :Rh catalyst after 6 h of reaction.The yield of methyl formate with TiO 2 :Rh-LHCII also increased four times compared to that of TiO 2 :Rh. The reaction happened in water which will dissociate and produce OH A and H .OH A can act as a hole scavenger by reaction 2OH A 4h !O 2 2H , where h is a hole.At the same time, hydrogen can be produced by reaction 2H 2e A !H 2 and provide the H source for hydrocarbon production (acetaldehyde and others) from CO 2 reduction. Formic acid and methanol were the source of methyl formate by esterification.However, formic acid and methanol were not detected by GC.The reason was that the methoxy and formate groups anchored on the surface of the catalyst as intermediates, and the two compounds reacted to form the methyl formate before desorption.Therefore the yield of desorbed methanol and formic acid was below the GC detection limit.Fig. 9 shows that the CO is produced first in the case of the TiO 2 :Rh-LHCII catalyst, followed by the larger molecules.This supports the hypothesis of CO 2 photoreduction as opposed to the LHCII being a carbon source.Moreover, the fact that the same products are detected when using TiO 2 :Rh catalyst further supports this hypothesis as LHCII is not present in these experiments.The amounts of products decreased after 4-5 h of photoreaction.This may be because the backward reaction occurs and some products are oxidised back to CO 2 by the catalyst 10,11. Control experiments were performed to confirm the source of the organic compounds produced during the photoreaction (Fig. 9), as described in method Section 2.3.2 and Table 1.All control photoreactions found no organic compounds within the detection limit of our GC. The UV-vis spectra of the catalysts (Fig. 3 (b)) indicated that the absorption at 670 nm diminished after the photoreaction.The same phenomenon could be observed from the TGA (Fig. 4), where the weight loss of LHCII on the catalyst decreased after the photoreaction.One explanation is that the LHCII was degraded by TiO 2 :Rh during the photoreaction.Another is that part of the LHCII desorbed from the catalyst surface because of the weak adhesion.If the first explanation is correct, it could be hypothesised that some products detected by the GC might originate from LHCII degradation instead of CO 2 reduction.The results of the control experiments presented in Section 2.3.2 show that this is not the case, since no products could be detected when CO 2 was not added to the reactor.This means that the yields shown in Fig. 9 were the result of CO 2 reduction and not due to the degradation of LHCII due to illumination (Control 1), due to the presence of CO 2 (Control 2) or by the catalyst (Control 3).Control 2 further showed that LHCII alone cannot catalyse the photoreduction of CO 2 .The HEPES b-DM catalyst also produced no detectable organic compounds (Control 4), confirming that these are not the source of the products.Finally, (Control 5) showed that light is necessary for CO 2 reduction.The above confirm that CO 2 photoreduction is indeed occurring in the reactor and it is the only source of detectable products. Fig. 10 shows the full IR spectra of TiO 2 :Rh and TiO 2 :Rh-LHCII catalysts, indicating that two additional peaks at 2924 cm A1 and 2852 cm A1 were observed for the TiO 2 :Rh-LHCII compared with TiO 2 :Rh.These two absorption peaks are associated with CH 2 stretching of proteins 23,24.The peak at 2355 cm A1 is assigned to CO 2 in the atmosphere 25 and the peaks in the range 1618-1627 cm A1 are unassociated H 2 O on the catalyst surface 25.Before the photoreaction, a mixture gas of CO 2 :H 2 :Ar (ratio of 2:1:1) purged the reactor for 40 min to allow gas adsorption on the surface of the catalyst.As shown in Fig. 11 at 1554 cm A1 is assigned to CO stretching of CO 3 group 26,27, while the one at 1430 cm A1 corresponds to the stretching of n s (HCO 3 ) 26,28.After the light irradiation, the spectra were recorded in time sequence.Some characteristic absorption bands confirm the presence of acetaldehyde (1716 cm A1 ) 293031, CO 3 , formate species (1593 cm A1 ) 32 and methoxy group doubly bridged (1048 cm A1 ) 33 adsorbed on the TiO 2 . According to the above results, the major products were CO, acetaldehyde and methyl formate.As shown in Fig. 9 in the reaction using TiO 2 :Rh-LHCII, CO was produced before the other two, suggesting it is produced in the initial steps, instead of the final product, in the reaction, which supports the CO 2 reduction hypothesis and not the degradation of LHCII.The in situ FT-IR analysis indicated that the selectivity for acetaldehyde was much higher than that for methyl formate.From the thermodynamic viewpoint 34, the Gibbs free energy of methanol was higher than that of acetaldehyde so that less methanol was generated resulting in less methyl formate being produced. A mechanism for the whole photoreaction was developed from the combined GC and FT-IR analysis results.First, CO 2 is adsorbed on the surface of the catalyst, where it reacts with H-OH and is reduced to -COOH (acid group).After that, -COOH reacts with H-OH again, and is reduced to H-C5 5O (aldehyde group).H-C5 5O can be further reduced to -COH (alcohol group) which is used in the formation of the methyl formate.Finally -COH can also be reduced to -CH 3 , which can react with H-C5 5O when it is desorbed from the surface of the catalyst and leads to the formation of acetaldehyde. Table 3 compares the experimental conditions and results of this study to those previously published 121314.From the view of mass balance, the amount of the products might be the same in a long time experiment, regardless of the catalyst used, since the CO 2 dissolved in the water is fixed.The quantum efficiency of the photoreduction was calculated for this comparison, using a fixed time interval.The results presented here show a better efficiency in reducing CO 2 compared to those of other groups.Furthermore CO, acetaldehyde and methyl formate could be detected, meaning that not only did the current system produce a larger amount of compounds but also different kinds of organic molecules were made from CO 2 . From the enhanced photoreduction of TiO 2 :Rh-LHCII, it is evident that there is a functional relationship between the catalyst and the LHCII adsorbed on its surface.This is supported by the results of (Control 2) where it was shown that LHCII cannot function as a catalyst without TiO 2 to photoreduce CO 2 , showing that both parts are needed.This functional relationship raised the question of how LHCII functions as a light antenna in the artificial system to assist photocatalysis, namely whether energy transfer or charge transfer occur. There have been accounts of charge transfer through the pigment matrix in dried chloroplasts, as mentioned in Lawlor 35.In fact, it was initially thought that the chloroplast may function as a semiconductor 36 but this idea was later abandoned.This could support the charge transfer hypothesis, especially since the preparation of TiO 2 :Rh-LHCII involves a drying step. On the other hand, it has been shown, using reaction-centreless mutants, that in vivo charge separation occurs in the reaction centres and not the LHCII 37, supporting the energy transfer hypothesis.Resonance transfer works by radiationless excitation transfer between chromophores with overlapping absorption and emission bands.This means that upconversion must occur in order to have emission in the UV, where TiO 2 absorbs.Visible to UV light upconversion has been reported using organic chromophores by Singh-Rachford and Castellano 38.Additionally, resonance transfer only works at distances of 1-10 nm.Further work is needed to confirm if this is possible in the system described here. The mechanism of the functional relationship cannot be deciphered from the work presented in this paper.In nature LHCII performs energy transfer to the photocatalytic enzymes of plants.However, it is unknown still how the interaction with the catalyst surface affects the properties of LHCII and this could potentially make charge transfer possible. The products of reducing CO 2 by different groups. Zhang 13 Varghese 12 Ozcan 14 This"
  },
  {
    "title": "Conclusions",
    "content": "This study investigated the novel TiO 2 :Rh-LHCII catalyst and its application in CO 2 photoreduction.From UV-vis analysis, it was confirmed that the absorption edge extended to visible light absorption due to the doping with Rh and the adsorption of LHCII on the TiO 2 surface, which allowed the catalyst to utilise visible light.XPS data showed that a red shift of Ti occurred due to Rh doping into TiO 2 .Comparing the efficiency of TiO 2 :Rh and TiO 2 :Rh-LHCII catalysts in reducing CO 2 confirmed that the LHCII material enhanced photoreduction.The results showed an increase of ten times for acetaldehyde and four times for methyl formate when comparing TiO 2 :Rh-LHCII to TiO 2 :Rh.The efficiency of the catalyst was also compared to that of other groups, showing that LHCII adsorption results in an improved catalyst that outperforms those in the literature. Fig. 1.The preparation method for the catalysts (a)TiO 2 :Rh and (b)TiO 2 :Rh-LHCII. Photocatalytic reduction of CO 2 2.3.1.Experimental setup Fig. 2. Wavelength distribution of 300 W xenon lamp, including wavelength from 300 nm to 1000 nm. Fig. 3. UV-vis absorption spectra (a) LHC and (b) TiO 2 series catalysts. Fig. 6.XRD of TiO 2 (black line, P25), TiO 2 :Rh (blue line) and TiO 2 :Rh-LHCII (green line).(For interpretation of references to color in this figure legend, the reader is referred to the web version of this article.)Fig. 8. TEM figure of TiO 2 :Rh. Fig. 7. SEM of (a) TiO 2 :Rh and (b) TiO 2 :Rh-LHC. Fig.10shows the full IR spectra of TiO 2 :Rh and TiO 2 :Rh-LHCII catalysts, indicating that two additional peaks at 2924 cm A1 and 2852 cm A1 were observed for the TiO 2 :Rh-LHCII compared with TiO 2 :Rh.These two absorption peaks are associated with CH 2 stretching of proteins23,24.The peak at 2355 cm A1 is assigned to CO 2 in the atmosphere25 and the peaks in the range 1618-1627 cm A1 are unassociated H 2 O on the catalyst surface25.Before the photoreaction, a mixture gas of CO 2 :H 2 :Ar (ratio of 2:1:1) purged the reactor for 40 min to allow gas adsorption on the surface of the catalyst.As shown in Fig.11, the peak which appears Fig. 11.In situ FT-IR analysis of photoreaction on TiO 2 :Rh-LHCII in time sequence. Control tests of CO 2 photoreduction. Elemental analysis of TiO 2 :Rh and TiO 2 :Rh-LHCII catalysts. It was estimated that the light exposed area in Zhang's group was 2.84 cm 2 which was the same as in this study. a CO. b CH 4 .c Acetaldehyde.d Methyl formate. C.-W. Lee et al. / Journal of CO 2 Utilization 5 (2014)3334353637383940 We thank the financial support of Taiwan National Science Council under project no.NSC 99-2911-I-002-106.The work was also supported by the Centre for Innovation in Carbon Capture and Storage (Engineering and Physical Sciences Research Council grant EP/F012098/1).We are grateful to the support from the Leverhulme Trust (Philip Leverhulme Prize).Rea Antoniou Kourounioti was supported by a studentship from the IDTC (Nottingham) and the Company of Biologists Travel Grant awarded by the Society for Experimental Biology. The calculation of quantum efficiency Intensity of the light source was 362 mW/cm 2 , the area exposed to light was 2.84 cm 2 .TiO 2 :Rh-LHCII light absorbance: 1.028 J/S.The energy of the photon: Excited photons per second: 1.028/3.58T 10 S19 2.87 T 10 18 .Quantum efficiency calculation: Quantum efficiency 14 mole of electron to convert HC mole of photon absorbed by catalyst CO: 2 T 114 T 10 S9 /((2.87T 10 18 T 3600)/6 T 10 23 ) T 100 0.0013. Acetaldehyde: 10 T 640 T 10 S9 /((2.87T 10 18 T 3600)/6 T 10 23 ) T 100 0.0374. Methyl formate: 8 T 52 T 10 S9 /(2.87 T 10 18 T 3600)/6 T 10 23 ) T 100 0.0024. Total quantum efficiency: 0.0013 0.0374 0.0024 0.0411. Here we neglect the reflect, penetrate and scattering fluxes. The conditions of the photoreaction are the same except for the catalyst in this work."
  }
]