[
  {
    "title": "Doi",
    "content": "10.1021/acsami.1c12800"
  },
  {
    "title": "Article_Title",
    "content": "Converting Organic Wastewater into CO Using MOFs-Derived Co/In<sub>2</sub>O<sub>3</sub> Double-Shell Photocatalyst"
  },
  {
    "title": "Abstract",
    "content": "The photocatalytic conversion of organic wastewater into value-added chemicals is a promising strategy to solve the environmental issue and energy crisis.Herein, Co/In 2 O 3 nanotubes with a double-shell structure, as a highly efficient photocatalyst, are synthesized by a one-step calcination method.The Co/In 2 O 3 heterostructure shows an outstanding photocatalytic CO 2 reduction performance of 4902 mol h -1 g -1 .Notably, these Co/In 2 O 3 photocatalysts also achieve CO 2 self-generation and in situ reduction conversion in acid organic wastewater (phenol solution), in which the high CO 2 (47.5 mol h -1 g -1 ) and CO (0.9 mol h -1 g -1 ) evolution rates are demonstrated under solar irradiation.Transient photovoltage (TPV) tests demonstrate that Co nanoparticles on Co/ In 2 O 3 double-shell heterostructure serve as the CO 2 reduction sites for the effective capture and stabilization of the photogenerated electrons."
  },
  {
    "title": "Experimental",
    "content": "Preparation of MIL-68(In).In a typical synthesis, 500 mg of In(NO 3 ) 3 nH 2 O and 500 mg of 1,4-benzenedicarboxylic acid were added in 150 mL of DMF under vigorous stirring for 1 h.After reaction at 120 C in an oil bath for another 4 h, the white precipitates were collected by centrifugation and thoroughly washed with ethanol many times, followed by drying at 60 C in a vacuum overnight. Preparation of ZIF-67/MIL-68(In).One gram of MIL-68(In) was added to 50 mL of methanol under vigorous stirring for 30 min.Co(NO 3 ) 2 6H 2 O (714 mg) was dissolved in the above mixture under vigorous stirring for another 1 h.2-Methylimidazole (1.63 g) was dissolved in 50 mL of methanol, and then, the mixed solution was slowly added into the above mixture.The mixture was stirred for 24 h at room temperature, and the precipitates were collected by centrifugation and washed with methanol many times, followed by drying at 60 C in a vacuum overnight.ZIF-67 was prepared via a similar method. Preparation of MOF-Derived Co/In 2 O 3 Nanotubes.MOFderived Co/In 2 O 3 nanotubes were prepared via a one-step calcination in a N 2 atmosphere as displayed in Figure 1a.The as-synthesized ZIF-67/MIL-68(In) templates were maintained at 120 C for 2 h with a heating rate of 5 C min -1 and further heated at different calcination temperatures with the same heating rate.The Co/In 2 O 3 nanotubes with different calcination temperatures (500, 550, and 600 C) were labeled as Co/In 2 O 3 -x (x 500, 550, 600).Due to the In 2 O 3 nanotube with demanding requirements for temperature, calcination temperature should be precisely controlled in a narrow range.ZIF-67 and MIL-68(In) were heated at 550 C under the same conditions, respectively, and the resulting samples were denoted as CoC-N and In 2 O 3 ."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Structural Characteristics of Co/In 2 O 3 .The crystal structures of ZIF-67, MIL-68(In), ZIF-67/MIL-68(In), and MOFs-derivative (In 2 O 3 , CoC-N, and Co/In 2 O 3 ) were confirmed by X-ray diffraction (XRD) patterns.The diffraction peaks of bare ZIF-67 at 7.3, 10.4, 12.6, 14.6, 16.3, 17.8, 22.1, 24.4, 25.6, and 26.6belong to (211), (002), (112), (022), (013), (222), (114), (233), (224), and (134) lattices (CCDC-671073), 27 respectively, as shown in Figure 1b.The observed characteristic peaks of MIL-68(In) are identical with the simulated date, 28 verifying the as-prepared MIL-68(In) with high crystallinity and purity.Notably, the diffraction peaks of parental ZIF-67 and MIL-68(In) both emerge at the XRD patterns of ZIF-67/MIL-68(In) heterostructure, revealing that the dual MOFs are well-maintained in the in situ self-assembly process.ZIF-67-derived Co displays that the peaks at 44.2a nd 51.4are indexed to (111) and (200) crystal planes for Co (PDF 15-0806), suggesting the typical peaks of metallic cobalt nanoparticles (Figure 1c). 26The XRD pattern of In 2 O 3 after calcination presents sharp peaks corresponding to the (211), ( 222), (400), (411) (332), (431), (440), (611), and (622) crystal plane of cubic In 2 O 3 (PDF 71-2195). 29The XRD patterns of MOFs-derivative at different calcination temperatures indicate the diffraction peaks of Co nanoparticles and In 2 O 3 , confirming the successful formation of Co/In 2 O 3 .The thermogravimetric analysis (TGA) curves of ZIF-67 and ZIF-67/MIL-68(In) in a N 2 atmosphere are displayed in Figure S4.The TGA analysis exhibits that the decomposition temperatures of ZIF-67 and MIL-68(In) are 500 and 550 C, respectively. The morphology of MOFs-derived CoC-N, In 2 O 3 , and Co/In 2 O 3 was investigated by scanning electron microscopy (SEM) and transmission electron microscopy (TEM) images.As present in Figure 2a, it can be seen that the In 2 O 3 nanotube with a hexahedral structure is derived from the decomposition of MIL-68(In).ZIF-67-derived CoC-N presents the original polyhedral shape with an average diameter of 430 nm, but the surface becomes sunken and rough (Figure 2b).For the MOFs-derived Co/In 2 O 3 sample, the In 2 O 3 maintains the well-defined nanotube, and there are numerous CoC-N nanocages on the surface, which can be attributed to the effect of porous MIL-68(In) on the size of ZIF-67 during the in situ growth process (Figure 2c).Besides, a few grown CoC-N nanocages were distributed on the surface of In 2 O 3 with a diameter of 250 nm, which is much smaller than that of single ZIF-67-derived CoC-N.The TEM image of In 2 O 3 in Figure 2d exhibits a hollow structure, whose walls is composed of packed nanoparticles.High-resolution TEM (HRTEM) as shown in Figure 2g displays the lattice spacing of 0.29 nm attributed to the In 2 O 3 (222) plane. 30In Figure 2e, metallic Co dots are embedded in the translucent cages composed of carbon and nitrogen that originated from imidazole ligands.The HRTEM image of CoC-N in Figure 2h of oxygen. 33It should be noted that all the MOF-derivatives exhibit the typical D (1336 cm -1 ) and G bands (1580 cm -1 ) as shown in Figure S3, which are attributed to sp 3 carbon atom and graphitized carbon, respectively, demonstrating the formation of a MOF-derived graphite structure, which can accelerate the charge transfer in the CO 2 reduction process. 34V-vis DRS spectra were measured to investigate the light absorption capacities of MOF-derived In 2 O 3 , CoC-N, and Co/In 2 O 3 samples, as shown in Figure 3c.Different from In 2 O 3 after calcination in an air atmosphere, In 2 O 3 (N 2 ) shows the visible-light as well as weak near IR absorption. 35CoC-N exhibits the strong full-spectrum absorption from the visiblelight region to the near-infrared region. 36Co/In 2 O 3 -550 shows strong absorption especially in the near-IR region, attributable to the characteristics of CoC-N.When the calcination temperature is relatively low, the absorption edge of the composite is similar to that of bare In ), which can be attributed to the In 2 O 3 nanoparticle aggregation.ZIF-67-derived CoC-N indicates a higher surface area of 235 m 2 g -1 , and its isotherm belongs to a typical type IV isotherm with fast N 2 gas uptake at low pressure, suggesting the presence of micropores structure. 37he BET surface area values of Co/In 2 O 3 -x (500, 550 and 600) are 158, 119, and 84 m 2 g -1 , respectively, indicating that the composites have a higher specific surface area compared with that of pure In 2 O 3 , and with the increase of calcination temperature, the surface area of composite is decreased due to the severe condition. XPS was employed to testify the chemical composition and status of MOF-derived In 41 Additionally, since the incorporation of CoC-N in Co/In 2 O 3 can cause the enhanced disorder, the composite presents a broader full width at halfmaximum.The dominant Co 2p peaks of CoC-N are deconvoluted into five peaks at 779.7, 780.9, 794.9, 796.6, and 804.2 eV, which are ascribed to Co 0 2p 3/2 , Co 2 2p 3/2 , Co 0 2p 1/2 , Co 2 2p 1/2 , and satellite respectively (Figure S5b). 42,43ue to the surface oxidation of metallic Co, the characteristic peaks of Co 2 are clearly observed, corresponding to the previous work. 44The broad peaks of O 1s over In 2 O 3 are deconvoluted into three peaks at 530.2, 531.4,and 532.4 eV, which correspond to lattice oxygen (O L ), oxygen vacancies (O V ), and adsorbed oxygen (O abs ), respectively (Figure 4b). 45or Co/In 2 O 3 , the characteristic peaks at 530.0, 531.5, and 532.4 are attributed to O L , O V , and O abs , respectively.The ratio of O V /(O V O L O abs ) is significantly enhanced after adding CoN-C, showing that Co/In 2 O 3 possesses a high concentration of O V due to the formation of heterostructures, which is consistent with the Raman result. 46The C 1s peaks of pristine In 2 O 3 observed at 284.8 and 286.3 eV are ascribed to sp 2 CC bonds and CN species, respectively (Figure 4c). 47n 2 O 3 , CoC-N, and Co/In 2 O 3 exhibit not only the CC and CN groups but also the NCO group at 288.6 eV, which is originated from the imidazole group of ZIF-67.The N 1s spectrum of Co consists of three peaks at 398.8, 400.0, and 401.3 eV, corresponding to pyridinic N, pyrrolic N, and graphite N, respectively (Figure 4d).48 The binding energies of Co/In 2 O 3 (398.6,399.8, and 401.1 eV) are lower than those of CoC-N, demonstrating that CoC-N can capture the photogenerated electrons.Besides, the content of pyrrolic N in the composite is increased, which could enhance the electronic structures of CoC-N and further promote the photocatalytic activity.Photocatalytic Activity.The standard photocatalytic reduction of the CO 2 experiment was carried out on the mixed solvent of MeCN/TEOA/H 2 O under simulated solar irradiation with Ru(bpy) 3 Cl 2 as the photosensitizer (Figure 6a).As is clear from the results, CO is the main reduction product and meanwhile a small amount of H 2 is detected.MIL-68-derived In 2 O 3 is inactive to convert CO 2 under light irradiation, and CoC-N also indicates poor CO 2 conversion.Especially, the combination of In 2 O 3 with Co significantly improves the photocatalytic CO 2 conversion performance due to the formed heterojunction between In 2 O 3 and CoC-N, which can accelerate the separation and migration of charge carriers.The CO generation rate of Co/In 2 O 3 -550 reaches an optimal value of 4902 mol h -1 g -1 , which is almost 36 times higher than that of pristine In 2 O 3 (136 mol h -1 g -1 ) and exceeds the performances of many other similar semiconductors (Table S1).Besides, the selectivity of CO over Co/In 2 O 3 -550 is up to 76.It is also apparent that the calcination temperature of MOFs affects the CO 2 reduction performance.The decreased CO yield of Co/In 2 O 3 -500 under the relative low calcination temperature is attributed to the absence of metallic Co property, corresponding to the UV-vis results.With the increase of calcination temperature, metallic Co generates agglomeration, thereby reducing the photocatalytic performance.Thus, the calcination temperature plays an important role in the CO production.As indicated by GC- MS analysis (Figure S6), the peak at m/z 29 can be ascribed to 13 CO, confirming that the CO indeed originates from photocatalytic CO 2 reduction. To investigate the relationship between reaction conditions and photoreduction activity, control experiments were measured as shown in Figure 6b.When Ar is used to replace saturated CO 2 , no obvious CO product is detected, confirming that generated CO is originated from photocatalytic CO 2 reduction instead of other organic matters.When there is the presence of Ru without Co/In 2 O 3 catalyst, a small amount of CO product can be detected.Without the Ru complex or TEOA, the generated CO almost disappears, suggesting that the photosensitizer and sacrificial agent are indispensable to the effective CO 2 -to-CO conversion.Besides, there is no CO production in the dark environment, indicating the specificity of photocatalytic reaction.The photostability of Co/In 2 O 3 was estimated in cycle experiments as shown in Figure 6c.The CO production remains almost unchanged, and there is ca.4.6 deactivation of CO yield (4674 mol h -1 g -1 ) after five continuous cycles, indicating the excellent stability of Co/ In 2 O 3 .Furthermore, the recycled Co/In 2 O 3 photocatalyst was characterized by XRD to investigate the stability (Figure 6d).No perceptible change of the crystal structure can be detected after photocatalytic reaction from XRD results, exhibiting the good stability of Co/In 2 O 3 in CO 2 conversion reaction. The standard photocatalytic degradation of phenol over MOF-derived In 2 O 3 , CoC/N, and Co/In 2 O 3 composites was evaluated under simulated solar irradiation (Figure S7).It can be seen that the degradation curves of all the samples are slowly decreased, demonstrating that CO 2 generation is uniform and a continuous process, which probably promotes the CO 2 conversion.Co/In 2 O 3 -550 exhibits the higher degradation efficiency of phenol (30) within 8 h.Furthermore, the active species in phenol degradation can be determined by trapping and electron-spin resonance (ESR) experiments over Co/In 2 O 3 -550.Due to the open environment in a degradation experiment, oxygen can be observed in the system, and the addition of EDTA causes the decline of photocatalytic activity, demonstrating that the h plays a crucial role in AOW degradation. The outstanding photocatalytic CO 2 reduction performance and moderate degradation rate of phenol over Co/In 2 O 3 provide excellent opportunities to achieve the conversion of AOW into fuels.Without an additional CO 2 source, the photocatalytic reaction of Co/In 2 O 3 coupled with Ru(bpy) 3 -Cl 2 was performed in phenol (20 mg/L) under simulated solar irradiation in the absence of any sacrificial agents.It can be seen that CO 2 and CO are main products, and no H 2 or liquid products can be detected (Figure 7a).Actually, there is a small amount of CH 4 , and the pity is that the peak area is too small to obtain the numerical results, which is different from the result of aforementioned normal CO 2 reduction reaction.The phenol degradation provides the CO 2 source, and meanwhile, phenol instead of a sacrificial agent offers lone pair electrons and Co/In 2 O 3 -550 composite exhibits the maximum CO 2 (47.5 mol h -1 g -1 ) and CO (0.9 mol h -1 g -1 ) production rates, which are much higher than those of pristine CoC-N and In 2 O 3 under the same conditions. To explore the trend of CO 2 and CO generation rates over Co/In 2 O 3 -550 in such a closed system, four successive runs over 32 h were examined under a N 2 atmosphere (Figure 7c).The CO 2 generation rate appears as linear growth, and after four cycles, the CO 2 production rates shows a slight decline, demonstrating that the phenol degradation process is continuous and stable within 32 h.Interestingly, the CO evolution rate is stable at an early stage, but the obvious decrease can be observed after two cycles, indicating that generated CO is originated from reduction reaction instead of the decomposition of phenol because the tendency of generation rate between CO 2 and CO is different.Due to the small quantities of phenol (20 mg/L) in photocatalytic reaction, when the phenol content is decreased to a certain level, competitive reactions between CO 2 generation and conversion occur. Photocatalytic Mechanism.The formed Co/In 2 O 3 nanotube can effectively inhibit the charge recombination, probed by the photoluminescence (PL) results as shown in Figure 8a.Co/In 2 O 3 indicates the significant PL quenching compared with pure In 2 O 3 and CoC-N, demonstrating that the recombination of charge carriers is sufficiently restrained. 49500515253 Furthermore, the electrons transfer efficiency from In 2 O 3 to CoC-N is considerably enhanced, which can be ascribed to the heterostructures.In order to further analyze the charge transfer dynamics as well as lifetime, the timeresolved PL spectra of In 2 O 3 and Co/In 2 O 3 were performed as present in Figure 8b.The decaying curves of as-prepared samples were well-fitted to the double-exponential modes, and the average lifetime of In 2 O 3 in the absence of a cocoatalyst is 5.13 ns.The introduction of CoC-N to In 2 O 3 causes a significant PL decay (4.33 ns), suggesting that the photoexcited charge of Co/In 2 O 3 can be captured by reactive substrates and the recombination of charge carriers can be suppressed. 545556 Electrochemical measurements were used to further analyze the charge transfer of Co/In 2 O 3 heterostructure toward the photocatalytic conversion of AOW.As shown in Figure 8c, Co/In 2 O 3 indicates a much higher photocurrent density than that of pristine In 2 O 3 , exhibiting that the introduction of Co C-N can significantly accelerate the interfacial charge transfer. 57Furthermore, Co/In 2 O 3 shows the smaller semicircle compared to bare In 2 O 3 as present in the Nyquist diagram (Figure 8d), revealing that the formation of heterostructure can reduce the charge transfer resistance and suppress the recombination of photoinduced charge. 5859960 The flat band potential (E fb ) of In 2 O 3 was determined by Mott-Schottky (M-S) plots (Figure S9).It can be seen that In 2 O 3 with a positive slope belongs to a typical n-type semiconductor, and the corresponding E fb of In 2 O 3 is approximately -0.93 V (vs Ag/AgCl).The conduction band (E CB ) of In 2 O 3 is ca.-0.73 V (vs NHE), and coupled with UV-vis results, the valence band (E VB ) is located at 1.59 V (vs NHE). To study the photocatalytic reaction over the catalysts deeply, in situ TPV measurements were carried out.As shown in Figure 9a-c The photocatalytic mechanism is proposed to reveal the synergistic effect of CoC-N and In 2 O 3 nanotube for the conversion of AOW into CO, as shown in Figure 10.Generally, the LUMO and HOMO potentials of Ru(bpy) 3 -Cl 2 can be evaluated to be -1.25 and 1.24 V (vs NHE), 61 respectively, and the CoC-N cocatalyst with a unique metallic property shows a lower Fermi level. 62On the basis of the above TPV results, the Co species are the CO 2 reduction active site, and meanwhile, the potential well can be established around the CoC-N nanocage, demonstrating that the photoexcited electrons are transferred to Co, which can quickly reduce CO 2 to generate CO.Besides, the enriched holes on the HOMO of Ru(bpy) 3 Cl 2 are consumed by phenol.On the one hand, phenol is decomposed to release CO 2 by holes (active species) during the degradation process.On the other hand, phenol with lone pairs of electrons can quench the holes to improve the conversion efficiency of CO 2 .Thus, directly converting the phenol into CO can be attributed to the delicate design of Co/In 2 O 3 photocatalyst as the following reasons.The constructed double-shell nanotube not only exposes more active sites but also provides a high surface to volume ratio, which can reduce the transfer distance of photoexcited electrons and further improve the separation efficiency of charge carriers.Besides, as a reductive active site, Co dots embedded into the C-N nanocage possess the quantum effect and prefer to capture and stabilize the electrons, facilitating the activation and conversion of CO 2 ."
  },
  {
    "title": "Conclusions",
    "content": "In conclusion, a novel strategy was developed to directly convert AOW into CO over MOFs-derived Co/In 2 O 3 catalyst under simulated solar irradiation.The Co/In 2 O 3 nanotube exhibits a high CO evolution rate (4902 mol h -1 g -1 ) with Ru(bpy) 3 Cl 2 as a photosensitizer and TEOA as a sacrificial agent.In a wastewater conversion system, the optimal Co/ In 2 O 3 -550 shows the CO 2 (47.5 mol h -1 g -1 ) and CO (0.9 mol h -1 g -1 ) evolution rates, where generated CO 2 and CO are derived from phenol degradation and CO 2 reduction, respectively.The TPV and in situ TPV experiments indicate that CoC-N as the reduction active site can establish a potential well to capture and stabilize the electrons accumulated at the Co nanoparticles.Meanwhile, holes are consumed by phenol under two models (degradation and reduction), improving spatial charge separation.Accordingly, we anticipate that this work presented here can provide new insights to convert and utilize wastewater into sustainable fuel. s Supporting Information The Supporting Information is available free of charge at https://pubs.acs.org/doi/10.1021/acsami.1c12800.Discussions of characterization, photocatalytic CO 2 generation-conversion in AOW, standard photocatalytic CO 2 reduction, standard photocatalytic degradation of AOW, photoelectrochemical performance measurements, and experimental method of TPV, figures of SEM and TEM images, Raman spectra, TGA spectra, Tauc plots, XPS spectra, mass spectra, photocatalytic degradation efficiencies, ESR spectra, XRD patterns, standard photoreduction CO 2 performance, and photocatalytic CO 2 generation and conversion integration processes, Mott-Schottky plots, and comparison of the attenuation const, and table of comparison of the CO 2 photoreduction performances, (PDF) Corresponding Authors Figure 1.(a) Schematic illustration of the synthetic process of MOF-derived Co/In 2 O 3 .(b) XRD patterns of MIL-68(In), ZIF-67, and ZIF-67/ MIL-68(In).(c) XRD patterns of MOF-derived In 2 O 3 , CoC-N, and Co/In 2 O 3 composites. indicates that the Co dots are wrapped by a carbon layer, and thus, it is difficult to observe the lattice fringe of Co. From Figure2f, the Co/In 2 O 3 -550 sample exhibits that CoC-N with a regular nanocage is embedded in the In 2 O 3 nanotube, and it is clear that the CoC-N coating layer well-wraps the In 2 O 3 shell to construct the distinct double-shell structure, suggesting that the outer layer is composed of abundant CoC-N nanocages.When the calcination temperature is up to 600 C, the Co dots grow up rapidly and severe aggregation occurs, as shown in FigureS1.The chemical composition of Co/In 2 O 3 -550 was confirmed by the EDS characterization (Figure2i), indicating the main elements including In, Co, C, O, and a small amount of N. In addition, the elemental mapping of Co/In 2 O 3 -550 illustrates that the C, N, and Co elements are uniformly dispersed in the outer layer without agglomeration, indicating the formation of the CoC-N layer (Figure2j).31Figure3adisplays the FT-IR spectra of MOF-derived In 2 O 3 and Co/In 2 O 3 samples.The peaks of all the as-prepared samples at 472, 561, and 606 cm -1 correspond to vibrations of In-O bonds, while the peaks at 1398 and 1621 cm -1 are ascribed to adsorbed H 2 O molecules.Due to the metallic property of ZIF-67-derived Co, there are no obvious characteristic peaks that belong to CoC-N, and Co/In 2 O 3 composites that exhibit the similar FT-IR spectra compared with In 2 O 3 .The oxygen vacancy of the Co/In 2 O 3 sample can be evaluated by Raman characterization, as shown in Figure 3b.The Raman signals at 126, 298, 366, 490, and 615 cm -1 are consistent with the characteristic peaks of cubic-phase In 2 O 3 .The Raman peaks at 126, 298, and 366 cm -1 correspond to the Figure 2. SEM images of (a) MOF-derived In 2 O 3 , (b) CoC-N, and (c) Co/In 2 O 3 -550.TEM images of (d) In 2 O 3 , (e) CoC-N, and (f) Co/ In 2 O 3 -550.HRTEM images of (g) In 2 O 3 and (h) CoC-N.(i) EDS pattern of Co/In 2 O 3 .(j) HAADF-STEM images of Co/In 2 O 3 -550. Figure 3. (a) FT-IR spectra of In 2 O 3 and Co/In 2 O 3 composites.(b) Raman spectra of In 2 O 3 , CoC-N, and Co/In 2 O 3 -550.(c) UV-vis spectra of In 2 O 3 , CoC-N, and Co/In 2 O 3 composites.(d) N 2 adsorption-desorption isotherms of In 2 O 3 , CoC-N, and Co/In 2 O 3 composites. Figure 4. XPS (a) In 3d, (b) O 1s, (c) C 1s, and (d) N 1s spectra of MOF-derived In 2 O 3 , CoC-N, and Co/In 2 O 3 -550. 2 O 3 probably due to a lack of metallic Co property.The corresponding Tauc plots of In 2 O 3 and Co/In 2 O 3 are present in Figure S4, from which the bandgap energies can be calculated as 2.32 and 2.10 eV for In 2 O 3 and Co/In 2 O 3 -550, respectively.The N 2 adsorption/ desorption isotherms of Co/In 2 O 3 annealed at different temperatures are exhibited in Figure 3d.The isotherm of MIL-68(In)-derived In 2 O 3 shows a low BET surface area (62 m 2 g -1 2 O 3 , CoC-N, and Co/In 2 O 3 .The XPS full spectrum of Co/In 2 O 3 illustrates the expected In, Co, O, C, and N elements, and it should be noted that the C and N elements coexist in both CoC-N and Co/In 2 O 3 , confirming that the formed Co is embedded in the C-N nanocage (Figure S5a).In the In 3d XPS spectra as shown in Figure 4a, the bare In 2 O 3 illustrates two peaks at 444.4 and 452.0 eV, which are attributed to In 3d 5/2 and In 3d 3/2 , indicative of In 3 in In 2 O 3 . 38-40Notably, the characteristic peaks of In 3d in Co/ In 2 O 3 at 444.8 and 452.4 eV are shifted toward higher energies compared with pure In 2 O 3 , revealing that the electrons are transferred from In 2 O 3 to CoC-N, which leads to the lower electron density of In 2 O 3 . Figure 5. (a) Comparison of the TPV of In 2 O 3 (black line), CoC-N (red line), and Co/In 2 O 3 (blue line).(b) Charge extraction rate (t max ) of In 2 O 3 , CoC-N, and Co/In 2 O 3 .(c) Attenuation constants () of the charge recombination process.(d) Maximum electron extraction of In 2 O 3 , CoC-N, and Co/In 2 O 3 . Next, transient photovoltage (TPV) measurements were performed to study the photocatalytic properties of In 2 O 3 , Co, and Co/In 2 O 3 composite shown in Figure 5a.During the decent part of the Co TPV curve (red line), there is a sunken part, suggesting that the electron potential well effect takes place on Co particles.In Figure 5b, the charge extraction process of Co/In 2 O 3 (t max3 ) is the fastest compared with pristine Co and In 2 O 3 , proving that Co/In 2 O 3 interfaces are beneficial for charge transfer.As is depicted in Figure 5c, the attenuation constants () are used to estimate the charge recombination rate of the catalysts.The attenuation constants of In 2 O 3 , Co, and Co/In 2 O 3 are 0.12225, 0.06763, and 0.08797 ms, respectively.The recombination rate of Co/In 2 O 3 is between Co and In 2 O 3 , indicating that Co accelerates the process of recombination, and the Co/In 2 O 3 interfaces can make charge transfer easier.According to Figure 5d, the area of the shadow part (A) corresponds to the maximum number of extracted electrons of In 2 O 3 , Co, and CoIn 2 O 3 , which are A 1 0.0328, A 2 0.0353, and A 3 0.0349, respectively.In order to further understand the effect of t max , , and A, effective electron concentrations can be calculated by (A)/t max .The effective electron concentrations of In 2 O 3 , Co, and Co/In 2 O 3 are 0.01919, 0.01181, and 0.01583, respectively.All these results suggest that the Co nanoparticles in this catalyst system play a key role for the capture and stabilization of the photogenerated electrons. Figure 6.(a) Photoreduction performance of MOF-derived In 2 O 3 , CoC/N and Co/In 2 O 3 composites.(b) Production rates of CO and H 2 under various reaction conditions.(c) Formation of CO and H 2 in stability tests.(d) XRD patterns of Co/In 2 O 3 -550 composite before and after CO 2 photoreduction. Figure 7. (a) Photocatalytic CO 2 generation and conversion integration processes over In 2 O 3 , CoC/N, and Co/In 2 O 3 composites in AOW.(b) Time-yield plots of Co/In 2 O 3 -550.(c) Photocatalytic cycle test of Co/In 2 O 3 -550 at a nitrogen-sealed system within 32 h.(d) TOC removal of phenol over Co/In 2 O 3 -550. Figure 8.(a) PL spectra, (b) TRPL spectra, (c) transient photocurrent responses, and (d) EIS Nyquist plots of In 2 O 3 and Co/In 2 O 3 -550. Figure 9. (a-d) Comparison of the in situ TPV of In 2 O 3 , Co, and Co/In 2 O 3 samples under N 2 -saturated and CO 2 -saturated acetonitrile. , it is obvious that the TPV intensities of In 2 O 3 , Co, and Co/In 2 O 3 under CO 2 -saturated acetonitrile decrease sharply compared to those under N 2 -saturated acetonitrile, which decrease by about 50, 90, and 70, respectively.Moreover, the electron potential well effect of Co and Co/ In 2 O 3 under CO 2 -saturated acetonitrile disappears, suggesting that CO 2 consumes this part of electrons.A further detailed analysis of the attenuation constants () on the basis of the above in situ curves is shown in Figure S10 and Figure 9d.For In 2 O 3 and Co/In 2 O 3 samples, the attenuation constants () are similar under N 2 -saturated and CO 2 -saturated acetonitrile, while the attenuation constant () of Co under CO 2 -saturated acetonitrile is about 2.2 times to that under N 2 -saturated acetonitrile, indicating that Co has a strong absorption interface for CO 2 reduction.All the above results indicate that Co nanoparticles are the main active sites of the CO 2 reduction. Figure 10.Proposed charge separation and transfer pathways of Co/In 2 O 3 under the simulated sunlight irradiation. https://doi.org/10.1021/acsami.1c12800ACS Appl.Mater.Interfaces 2021, 13, 40754-40765 Downloaded via UNIV REY JUAN CARLOS on September 20, 2022 at 07:37:14 (UTC).See https://pubs.acs.org/sharingguidelines for options on how to legitimately share published articles. https://doi.org/10.1021/acsami.1c12800ACS Appl.Mater.Interfaces 2021, 13, 40754-40765 https://doi.org/10.1021/acsami.1c12800 Qian Liang -Jiangsu Key Laboratory of Advanced Catalytic Materials and Technology, School of Petrochemical Engineering, Changzhou University, Changzhou 213164, China; orcid.org/0000-0002-8348-0833;Email: qianliangcczu.edu.cnZhenhui Kang -Institute of Functional Nano and Soft Materials Laboratory (FUNSOM), Jiangsu Key Laboratory for Carbon-Based Functional Materials Devices, Soochow University, Suzhou 215123, China; Macao Institute of Materials Science and Engineering, Macau University of Science and Technology, Taipa 999078 Macau SAR, China; Institute of Advanced Materials, Northeast Normal University, Changchun 130024, China; orcid.org/0000-0001-6989-5840;Email: zhkangsuda.edu.cn,zhkang must.edu.mo,kangzhnenu.edu.cn ACKNOWLEDGMENTS This work was supported by National Key Basic Research Program of China (2020YFA0406104, 2020YFA0406101), National MCF Energy RD Program (2018YFE0306105), Innovative Research Group Project of the National Natural Science Foundation of China (51821002), National Natural Science Foundation of China (51725204, 21771132, 51972216, 52041202), Natural Science Foundation of Jiangsu Province (BK20190041), Natural Science Foundation of Jiangsu Province-Excellent Youth Foundation (BK20190102), Key-Area Research and Development Program of GuangDong Province (2019B010933001), Collaborative Innovation Center of Suzhou Nano Science Technology, and the 111 Project. REFERENCES"
  }
]