[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2014.09.032"
  },
  {
    "title": "Article_Title",
    "content": "Effect of Au surface plasmon nanoparticles on the selective CO2 photoreduction to CH4"
  },
  {
    "title": "Abstract",
    "content": "Various gold-supported TiO 2 catalysts (0.5-3.0 wt.) were prepared by a deposition-precipitation method, and their photocatalytic activity towards CO 2 reduction was tested in the gas phase while using H 2 O as electron donor and UV and visible light as energy sources.CO and H 2 are detected as major products in bare TiO 2 .However, the deposition of small Au nanoparticles (NPs) onto TiO 2 was found to quantitatively enhance the reduction of CO 2 mainly to methane and C 2 hydrocarbons.Transient absorption spectroscopy was used to correlate the improved CH 4 production with an increased charge separation due to the electron transfer between the TiO 2 and Au NPs.The amount of Au loaded onto TiO 2 was optimized, with 1.0 wt. showing the highest photocatalytic activity under UV light.Under visible irradiation, H 2 and CH 4 were identified as the main products, although showing significantly lower productions."
  },
  {
    "title": "Experimental",
    "content": "Commercial anatase-type titanium dioxide (TiO 2 , PC500) was supplied by CrystalACTIV TM .Prior to use, TiO 2 was stabilized with a thermal treatment at 400 C for 4 h.Au/TiO 2 catalysts containing different gold percentages were prepared by a deposition-precipitation method, initially developed by Haruta and co-workers 33.In this procedure, a solution of HAuCl 4 3H 2 O (Strem Chemicals) was used as precursor.Four aqueous solutions were prepared, containing 0.5, 1.0, 1.5 and 3.0 wt. of Au in 300 mL of Milli-Q water.The solutions were adjusted to pH 9 by addition of a 0.1 M solution of NaOH.Once the pH value was stable, 200 mg of TiO 2 were added under vigorous stirring.The deposition-precipitation procedure was done at 70 C, maintaining the pH constant during 2 h, and then the slurry was stirred overnight.The catalysts were recovered, filtered, washed with Milli-Q water and dried at 100 C overnight.Finally, Au/TiO 2 catalysts were calcined in air at 200 C during 4 h using a ramp of temperatures with a rate of 5 C/min.Samples were labelled as xAu/TiO 2 , where x indicates the nominal gold loading (0.5-3.0 wt.). For spectroscopic measurements, analogous nanocrystalline Au/TiO 2 films were employed.Firstly, anatase TiO 2 films were prepared from a colloidal paste by the Doctor Blade technique as reported previously 34.The films were dried for 10 min before being calcined in air at 450 C during 30 min, and cut in small pieces of approximately 1 cm 1.5 cm.The thickness of the films was found to be 4 m by profilometry (Tencor Instruments).Au/TiO 2 films were prepared by coating Au nanoparticles over the TiO 2 films by photodeposition of an aqueous HAuCl 4 xH 2 O solution (0.1 M), when irradiating the nanoparticulate suspension with a xenon lamp (75 W) during 5 s.To ensure that all Au 3 was reduced to Au, the films were irradiated for 1 h under a N 2 atmosphere with a Nd-YAG laser with a wavelength of 355 nm (350 J/cm 2 , 10 Hz). Crystal structures of Au/TiO 2 samples were characterized by using a X-ray diffractometer (Philips PW 3040/00 X'Pert MPD/MRD) with Cu K radiation (k 1.54178A) at a scanning rate of 0.2 s -1 .Specific surface areas were calculated from N 2 adsorption-desorption isotherms at 77 K measured on a QUADRA-SORB instrument.The sample was degassed at 105 C for 20 h in N 2 before the measurement.The pore size distribution of mesopores in the samples was analyzed by BJH method.The gold content was measured by ICP-OES analyses with a Perkin Elmer Optima 3300 DV instrument by digesting the solid in a mixture of HF and HNO 3 .The morphology of particles was observed by using a Philips Technai 20 Transmission Electron Microscope, operating with a tungsten filament working at 200 kV.Ultraviolet-visible diffuse reflectance spectra (UV-Vis DRS) of powdered samples were obtained by a Perkin Elmer Lambda 1050 UV/Vis/NIR spectrometer.Photoluminescence experiments were carried out with a Fluorescence Spectrometer Perkin Elmer LS 55, using an excitation wavelength of 300 nm and a cut-off filter at 350 nm. The microsecond-second transient absorption decays were recorded using an experimental set up described previously 15.The third harmonic of an Nd:YAG laser (355 nm), at a frequency of 1 Hz and an intensity of 350 J/cm 2 , was used as excitation source.The kinetics of charge separation were studied by monitoring the photogenerated charge carriers in the TiO 2 , with no signals from the Au nanoparticles being apparent in the spectral range studied (460-900 nm).The decays corresponding to photogenerated holes in TiO 2 were monitored at 460 nm, and electrons at 900 nm.The decays observed are the average of 500 laser pulses. CO 2 photoreduction experiments were conducted in a homemade reaction system in continuous-flow mode.The gas-phase photoreactor, with an effective volume of 280 mL, was made of steel and provided with a borosilicate window for irradiation.The powdered catalyst (0.1 g) was deposited on a glass microfiber filter and fitted inside the reactor.UV illumination was carried out using four 6 W lamps with a maximum wavelength at 365 nm and an average intensity of 71.7 W m -2 (measured by a Blue-Wave spectrometer in the range 330-400 nm), while a 30 W white light LED with cut-off filters at 400 nm and 455 nm was used for visible light illumination.Pure CO 2 (99.9999,Praxair) and water (Milli-Q), were passed through a Controller Evaporator Mixer (CEM) maintaining a molar ratio of 7.25 (CO 2 :H 2 O) to generate a reaction feed of CO 2 and water vapour.The reaction conditions were set at 2 bars and 50 C. Continuous gas chromatography analyses were performed to detect the reaction products.GC (Bruker 450-GC) was equipped with two separation branches and two sampling loops.The first separation branch was equipped with two semicapillary columns (BR-Q Plot and BR-Molesieve 5A).This branch was also equipped with a Thermal Conductivity Detector (TCD), a Flame Ionization Detector (FID) and a methanizer.The second separation branch consisted on a capillary column (CP-Sil 5B) and a second Flame Ionization Detector (FID). Before starting the experiments, the catalysts were first pretreated using the following method: the reactor was firstly degassed at 80 C under vacuum and then purged with Ar (100 mL/min) for 1 h in order to remove any residual organic compounds weakly adsorbed to the surface of the catalyst.Then, the reactor was flushed with the CO 2 and H 2 O mixture for 1 h to establish an adsorption-desorption balance at the reaction temperature.Prior to illumination, the reactor was pressurized with the mixture and kept at a reduced flow rate for another 1 h. No products were found after performing blank experiments under dark conditions or without any catalyst under UV or visible illumination.Further, experiments with high purity Ar (99.999,Praxair) were also performed to control the carbon contamination on the surface of the catalysts.GC analyses detected small amounts of CO 2 (ca.less than 200 ppm from air) in the feed composition before starting the illumination, indicating a small carbon contribution due to impurities of the reagents, which may result in the appearance of adsorbed species such as carbonates/bicarbonates that could participate in the photocatalytic reaction or affect its selectivity 35,36.All photocatalytic tests were investigated over a period of 0-15 h of irradiation time and repeated at least twice to assure the accuracy of the reaction results. The Formal Quantum Efficiency (FQE) was calculated using Eq. ( 1), considering the incident light intensity in the wavelength range of 325-400 nm: FQE rate of reaction (molecules/s) incident light intensity (photons/s) (1)"
  },
  {
    "title": "Results_and_Discussion",
    "content": "To determine the effect of Au nanoparticles to the physicochemical properties and the photocatalytic behaviour of TiO 2 , four samples with different Au nominal loadings (0.5, 1.0, 1.5 and 3.0 wt.) were prepared by a deposition-precipitation method.The metal content, determined by ICP analysis (Table 1), indicates that the total nominal gold content present in the synthesis solution is not completely deposited on the surface of the semiconductor.This behaviour was previously observed by Haruta's group 33 and was mainly attributed to the high pH value of the solution (i.e.pH 9), which compared to the point of zero charge of the TiO 2 (PZC TiO 2 6), limits the number of adsorption sites and restricts the gold content.These studies also show that the efficiency of the metal deposition diminishes as increasing the Au content. The structural properties of the photocatalysts were evaluated by X-ray diffraction (Fig. 1) and all profiles can be indexed to the TiO 2 anatase phase (ICDD No. 21-1272, space group: I41/amd).For metal loaded TiO 2 samples, no reflection peaks from Au are observed due to the low concentration or the small crystallite size of Au NPs.The average crystal sizes of TiO 2 were estimated, before and after Au deposition, using the Scherrer's equation on the anatase (1 0 1) diffraction peak at ca. 2A 25.3 (Table 1).All the samples have almost the same crystallite size, indicating that the deposition of Au did not evidently alter the crystalline phase or structural properties of TiO 2 .In addition, the morphology of TiO 2 as well as the presence and size of Au NPs is studied by TEM imaging (Fig. 2).Commercial anatase exhibits nanosized particles (10-15 nm) with small and well dispersed Au NPs of diameter ranging between 1.9 and 3.0 nm.Gold particle size enlarged when increasing the gold content. The textural properties of the catalysts were analyzed by N 2 adsorption-desorption isotherms (Fig. 3).All samples exhibit type II isotherms with a hysteresis loop (type H3) at relative high pressure (ca.p/p 0 0.4), which indicates the presence of meso-and macropores usually originated from the agglomeration of primary crystallites 37.Table 1 summarizes the quantitative data of BET surface area, pore volume and average pore size in order to detect variations between samples before and after gold loading.After the deposition of Au NPs onto TiO 2 , the surface area and pore volume decreased due to a partial blocking of TiO 2 pores by Au NPs, which was more noticeable when increasing the gold content 38. In addition, the possible appearance of hot spots in the metal NPs surroundings during the second calcination treatment, may cause the sintering of TiO 2 nanoparticles, and consequently contribute to the decrease in the surface area and in the pore volume. The diffuse reflectance spectra (DRS) of the bare TiO 2 and Au/TiO 2 catalysts are shown in Fig. 4A.The broad absorption band observed at wavelengths shorter than 400 nm is attributed to the excitation of electrons from the valence band to the conduction band of TiO 2 .For all samples, the band gap values (E g 3.3 eV) almost remained unchanged even after Au loading.In addition, Au/TiO 2 samples exhibit significantly enhanced light absorption in the visible region showing a broad band located between 450 and 600 nm, typical of the SPR of Au NPs.The lower intensity of this band in 0.5Au/TiO 2 catalyst is correlated to its minor gold content. Fig. 4B depicts the photoluminescence (PL) spectra of TiO 2 anatase and Au/TiO 2 catalysts in the wavelength range of 300-650 nm.A broad band from 350 to 600 nm (3.5-2.1 eV) composed by multiple emission contributions is observed for all catalysts.The UV emission peak located at 396 nm is attributed to the band to band radiative recombination process with the energy of light close to the band gap energy of anatase (E g 3.2 eV; 387 nm) 37,39.PL bands appearing in the visible region (400-600 nm) are mostly associated with excitons, which mainly result from surface oxygen vacancies and defects 39404142.Fig. 4B shows a significantly smaller band to band PL amplitude for Au/TiO 2 compared to TiO 2 catalysts, suggesting a decrease in the rate of electron/hole recombination when the semiconductor is functionalized with Au NPs 22.The quenching of the luminescence of Au/TiO 2 samples increases with the loading of Au NPs, reaching a saturation point when the amount of Au is greater than 1 wt..This behaviour is in good agreement with the absorption intensities corresponding to the SPR, which shows smaller signal amplitude for 0.5Au/TiO 2 (Fig. 4A). The effect of Au NPs to the CO 2 photoreduction activity of Au/TiO 2 catalysts was investigated under UV and visible light illumination.Variations in the product distribution were studied for TiO 2 loaded with different metal contents (0.5-3 wt. Au).Previous CO 2 photoreduction studies performed with anatase-type TiO 2 showed high selectivities towards the formation of CO and H 2 for the bare semiconductor 22.We show herein that, the deposition of Au metal nanoparticles onto TiO 2 results in an improved hydrocarbon formation (high electron demanding products) mainly attributed to the enhanced charge separation and improved multielectron transfer processes. Fig. 5 shows the kinetics of the product distribution of 0.5Au/TiO 2 catalyst under UV irradiation.The two main reaction products detected were H 2 and CH 4 , which evolved at a similar trend reaching the maximum reaction rate after 4 h of UV irradiation (18.9 mol g cat -1 h -1 and 8.0 mol g cat -1 h -1 for H 2 and CH 4 , respectively).CO, CH 3 OH and C 2 H 6 were also observed, although showing much lower reaction rates. In order to further investigate the influence of Au loading to the efficiency of CO 2 photoreduction, the selectivity of the photogenerated products by bare TiO 2 and Au/TiO 2 catalysts is compared (Fig. 6).In agreement with previous observations, CO, H 2 and minor amounts of CH 3 OH were produced with bare TiO 2 .On the contrary, the selectivity of Au/TiO 2 samples completely shifted towards the production of C1 and C2 hydrocarbons, being CH 4 the main component, due to the aforementioned improved electron transfer processes.This better charge separation influences also a higher selectivity to H 2 due to an increased water decomposition rate.This behaviour also agrees with the enhanced hydrocarbon formation (high electron demanded products) and the decrease in the CO evolution, which was almost 10 times lower with respect to that of TiO 2 . The effect of the metal loading to the CO 2 reduction photocatalytic activity is evaluated by comparing the kinetics and accumulated production of CH 4 (Fig. 7).The kinetic profiles of all samples show a similar trend, with productions reaching maximum values after 4-6 h of irradiation (Fig. 7A).Prolonged exposure of the catalysts to light led to a progress decrease in the reaction rates for all products.The highest CH 4 production was obtained with 1.0Au/TiO 2 sample at a maximum rate of ca.8.86 mol g cat -1 h -1 Fig. 6.Product selectivity over TiO2 and Au/TiO2 photocatalysts (0.5-3.0 wt. Au) after 15 h of UV irradiation. reached before 5 h of illumination.Lower and higher Au contents lead to a decrease in the CO 2 reduction kinetic profiles, being the lowest rate for 3.0Au/TiO 2 sample.In addition, it can be observed that an increase of the metal loading leads to a larger deactivation.Fig. 7B represents a comparison of the cumulative production of CH 4 over selected Au catalyst and bare TiO 2 semiconductor, also including formal quantum efficiency (FQE) values.In this case, the deposition of Au NPs results in a quantitatively improved CH 4 formation, which is more than 12 times higher than that obtained with bare TiO 2 .The highest CH 4 production at 15 h is obtained with 1.0Au/TiO 2 photocatalyst (74.1 mol g cat -1 and a FQE of 0.068).The enhanced CH 4 production of Au/TiO 2 photocatalysts can be explained from different approaches.From the optoelectronic point of view, the decrease in the emission intensity of Au/TiO 2 samples observed in the PL studies (Fig. 4B) was ascribed to a possible decrease in the e -/h recombination rate that favours the CO 2 photoreduction.To confirm this hypothesis we studied the kinetics of charge separation and charge recombination in TiO 2 and Au/TiO 2 catalysts by transient absorption spectroscopy (TAS) (Fig. 8A).The signal corresponding to photoexcited holes in the TiO 2 is monitored at 460 nm, while electrons are probed at 900 nm.The decays of photogenerated electrons and holes in bare TiO 2 show identical kinetics with t 50 50 s due to bimolecular recombination 15,43.The deposition of Au NPs onto TiO 2 affects both the dynamics of photogenerated electrons and holes: On one hand, the transient absorption signal corresponding to photoexcited electrons in TiO 2 shows a smaller amplitude for Au/TiO 2 films when compared to that of bare TiO 2 (Fig. 8B).This observation is indicative of a fast (10 s) electron transfer from the semiconductor to the Au NPs.Secondly, the transient absorption signal amplitude assigned to photoexcited holes when the TiO 2 is loaded with Au NPs exhibits a 3-fold increase when compared to that of bare TiO 2 .This increase in the signal amplitude is assigned to the accumulation of holes in the TiO 2 after the fast electron transfer from the semiconductor to the metal nanoparticles. The decay dynamics of the charge carriers can provide an indication of the lifetime of the charge separated state.While the transient absorption decay of photoholes in bare TiO 2 exhibit a t 50 50 s due to bimolecular electron/hole recombination, the lifetime of the holes accumulated at the TiO 2 valence band in Au/TiO 2 catalysts is t 50 350 s.Thus, our results indicate that the deposition of Au NPs on TiO 2 results in a 7-fold increased lifetime of the charge separated state when compared to bare TiO 2 .Our results demonstrate that Au NPs can efficiently store the electrons photogenerated in the semiconductor, which become readily available to drive the multielectron CO 2 reduction process.Fig. 8C schematizes this enhanced UV-light driven mechanism observed in Au/TiO 2 catalysts.Here, the presence of Au NPs, in direct contact with TiO 2 favours the transfer of photogenerated electrons from the semiconductor to the metal.This charge transfer and the subsequent accumulation of electrons in the Au NPs involve the equilibration of the apparent Fermi level in the Au/TiO 2 composite 44,45.This level is expected to shift to more negative potentials in small Au NPs, thus leading to more reductive catalysts 46.On the other hand, the different photocatalytic performance due to the Au loading can be explained from the structural point of view.The highest yields are obtained with low loaded Au/TiO 2 catalysts which exhibit the smallest Au NPs size (Table 1).This behaviour agrees with the studies performed by Kamat et al.They reported the size-dependency of Au NPs in the photocatalytic performance, demonstrating that catalysts with small metal NPs are more active than those composed of larger particles due to the more reductive character of the composite 46.Based on the observations stated above, 1.0Au/TiO 2 was selected as the catalyst with the optimum metal content in our experimental conditions. The activity of 1.0Au/TiO 2 towards CO 2 photoreduction was also evaluated under visible light irradiation (Fig. 9).Under wavelengths above 400 nm, the gold photocatalyst was active towards CO, CH 4 and H 2 formation, although the productions were significantly lower than under UV irradiation.Since TiO 2 light absorption is below to 400 nm, different models have been reported in the literature to explain the photoactivity under visible irradiation.On one hand, this behaviour is attributed to the excitation of sub-band gap electrons from surface defects.In the case of Au/TiO 2 photocatalysts the formation of these electron/hole pairs near the surface of the TiO 2 is promoted due to the strong electric field created by the surface plasmons of Au NPs 27,47,48.Additionally, other studies have reported photoactivities mediated by a direct transfer of excited electrons from Au NPs to the conduction band (CB) of TiO 2 27,49,50.This electron injection, only allowed across an energy barrier of 1.0 eV 51525354, can be achieved by the excitation of electrons in the filled d-band of gold to electronic states above the Fermi level (E F ) 50,48. In order to clarify the photoelectron transfer behaviour additional photocatalytic experiments were performed using a 455 nm cut-off filter.As shown in Fig. 9, 1.0Au/TiO 2 still shows photoactivity towards CH 4 and CO, suggesting that gold NPs participate in the visible light induced performance.The decreasing in H 2 formation under these conditions might suggest that hydrogen evolution proceeds via the excitation of sub-band gap states of TiO 2 , rather from the direct excitation of Au NPs.Further experiments are necessary to elucidate the specific mechanism of the enhanced photocatalytic activity facilitated by the SPR of Au NPs."
  },
  {
    "title": "Conclusions",
    "content": "The results shown herein demonstrate that the functionalization of TiO 2 with Au nanoparticles is effective at increasing the lifetime of charge separated states through interfacial electron transfer.Under UV irradiation, Au/TiO 2 catalysts are found to be more active than bare TiO 2 for the production of high electrondemanding products.Low loadings of Au onto the TiO 2 resulted in an enhancement of the hydrocarbon production, especially CH 4 .This behaviour is explained in terms of a decrease of the charge recombination rates due to the electron scavenging ability of Au NPs.The physical separation of charge carriers results in a 7-fold longer lived state compared to bare TiO 2 films, which is crucial in order to perform the slow and multi-electron demanding CO 2 reduction reaction. On the other hand, Au/TiO 2 catalysts show photoactivity towards the visible light driven CO 2 photoreduction, although yields are significantly lower than under UV irradiation.This slight photoactivity is attributed to two possible mechanisms: the weak sub-band gap absorption created due to the presence of impurity states located below the TiO 2 conduction band, and on the other hand, the interaction of the strong electric field created by the surface plasmons of Au NPs with TiO 2. This effect may allow the formation of electron/hole pairs in the near surface region of TiO 2 , enhancing the CH 4 yields. Fig. 1.XRD patterns of TiO2 and Au/TiO2 samples. Fig. 2. TEM micrographs of TiO2 (A); 0.5Au/TiO2 (B); 1.0Au/TiO2 (C); 1.5Au/TiO2 (D); 3.0Au/TiO2 (E). Fig. 3. N2 adsorption/desorption isotherms of TiO2 and Au/TiO2 samples. Fig. 4. Diffuse reflectance UV-vis (A) and emission spectra of TiO2 and Au/TiO2 (B) photocatalysts. Fig. 5. Temporal evolution of the photoreduction products using a 0.5Au/TiO2 photocatalyst under UV irradiation. Fig. 7. Effect of the gold loading on the CH4 production in terms of evolution rates (A) and cumulative production (B) under UV irradiation. Fig. 8. Transient absorption decays of holes (A) and photogenerated electrons (B) in TiO2 and Au/TiO2 after excitation at 355 nm, and schematic of the reaction mechanism for UV-light driven CO2 photoreduction over Au/TiO2 catalysts, showing the equilibrated Fermi level of TiO2 once Au NPs are in contact with the semiconductor (C). Fig. 9. Comparison of the cumulative production for 1.0Au/TiO2 catalyst after 15 h of visible light irradiation, using a LED lamp with 400 and 455 nm cut-off filters. Physicochemical properties of bare TiO2 and Au/TiO2 catalysts (0.5-3.0 wt. Au). a Au content (wt.) measured by ICP-OES.b Crystal size calculated by XRD.c Au particle size determined by TEM. Financial support from the Spanish Ministry of Economy and Competitiveness (project ENE2009-09432) and the ERC (project Intersolar 291482, to J.D.) is gratefully acknowledged.V.A.P.O. and L.C. thank funding provided by the grants Ramon y Cajal (RYC-2008-02069) and FPI (BES-2010-032400), respectively.A.R. thanks the European Commission Marie Curie (PCIG10-GA-2011-303650)."
  }
]