[
  {
    "title": "Doi",
    "content": "10.1016/j.mssp.2021.106011"
  },
  {
    "title": "Article_Title",
    "content": "Visible-light assisted photoreduction of CO2 using CdS-decorated Bi24O31Br10"
  },
  {
    "title": "Abstract",
    "content": "CdS-based heterojunctions are highly active for the production of hydrocarbon fuels from the photoreduction of CO 2 .In the present study, we have synthesized CdS decorated bismuth oxyhalide (Bi 24 O 31 Br 10 ) heterojunction as an efficient nanocomposite material for producing methanol from CO 2 using water and TEA as the proton source and sacrificial donor, respectively, under visible-light irradiation.The nanocomposite material exhibited the highest 1739 mol-g -1 yield of methanol in 24 h than the CdS and Bi 24 O 31 Br 10 with significant recyclability.The improved yield of methanol was observed due to the confinement of CdS nanoparticles into the bulk of Bi 24 O 31 Br 10 , making a Z-scheme heterojunction.Also, the charge separation was improved with the doping of CdS on Bi 24 O 31 Br 10 semiconductor support.The synthesized semiconductors and nanocomposite materials have been characterized using XRD, FTIR, HR-TEM, XPS, PL, TGA-DTA, PEC analysis, N 2 adsorption-desorption analysis, UV-vis, and Raman spectroscopy."
  },
  {
    "title": "Experimental",
    "content": "Bismuth nitrate pentahydrate (Sigma Aldrich), nitric acid (Fischer Scientific), cetyltrimethylammonium bromide (CTAB) (Sigma Aldrich), sodium hydroxide (Fischer Scientific), cadmium acetate dihydrate (Sigma Aldrich), thiourea (Fischer Scientific), absolute alcohol (Fischer Scientific), N, N-dimethylformamide (DMF) (Fischer Scientific), triethylamine (TEA) (Fischer Scientific), and acetonitrile (Fischer Scientific) were purchased. Bismuth oxyhalide has been fabricated following the literature reported 33.In the typical synthesis, 4.9 g of Bi(NO 3 ) 3 5H 2 O and 100 mL of 1.6 M dilute HNO 3 were mixed in a beaker.In another beaker, 1.52 g of CTAB and 400 mL of 0.14 M NaOH solution were stirred till the clear solution.CTAB and NaOH solution was slowly added to the acidic solution instantly formed the white precipitates under vigorous stirring.These precipitates were washed with distilled water several times, followed by ethanol, and dried at 60 C in a vacuum oven for 24 h.The dried solid material was then annealed at 600 C for 4 h.The as-synthesized Bi 24 O 31 Br 10 was used for further doping of other materials. In this synthesis, 1 g of as-synthesized Bi 24 O 31 Br 10 was dispersed in ethanol and stirred for 1 h.0.1 g of Cd(CH 3 COO) 2 2H 2 O and thiourea were added to this solution and stirred vigorously for another 2 h.This synthesis mixture was transferred to the Teflon-lined stainless-steel autoclave at 160 C for 12 h.The hot autoclave was cooled at room temperature and washed with water three times, followed by absolute ethanol.The wet content was dried in a vacuum oven at 60 C for 24 h.The CdS nanoparticles were also fabricated for comparison without the addition of Bi 24 O 31 Br 10 semiconductor support. For the photocatalytic reduction of CO 2 , acetonitrile as a solvent, water as a proton source, and TEA as a sacrificial donor were used in a Pyrex glass cell.The cell was charged with 50 mg of the catalytic material for a reaction of acetonitrile (12 mL), TEA (4 mL), and water (4 mL) in a 3:1:1 ratio.Before the light irradiation, the reaction mixture was degassed thoroughly with N 2 gas to evacuate the adsorbed air and then degassed with CO 2 gas to the saturation under continuous stirring. Then, the 300 W Xenon arc lamp (PLS-SXE300) equipped with a cut-off filter of wavelength 420 nm was switched on to irradiate the reaction mixture.The photoreduction temperature was maintained at 27 C. The aliquots of 0.1 mL of the reaction mixture were continuously injected into an Agilent Technologies 7890 A gas chromatography (FID detector, DB-WAX column) for quantification of methanol compared with the standard methanol under the reaction condition.There would be a possibility of the formation of few gaseous products, such as CO, H 2 , and O 2 ; therefore, an Agilent 7890 B gas chromatogram fitted with a TCD detector using different columns; Molecular sieves (for analyzing H 2 ) and Porapack Q (for analyzing CH 4 and CO) was used."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The CdSBi 24 O 31 Br 10 heterojunctions were synthesized from Bi (NO 3 ) 3 5H 2 O and Cd(CH 3 COO) 2 2H 2 O precursors using a solvothermal approach.The nanocomposite materials were characterized using various spectroscopic techniques.A detailed description of the characterization has been discussed in the following section. X-ray photoelectron spectroscopy (XPS) determined the surface chemical properties and binding energies of CdSBi 24 O 31 Br 10 (Fig. 1).The XPS spectra of Cd-3d represented two signals of 3d 3/2 and 3d 5/2 at 413.0 eV and 406.4 eV, respectively, for CdS semiconductor while in CdBOB nanocomposite, 3d 3/2 and 3d 5/2 signals were found at 412.7 eV and 406.1 eV, respectively, corresponds to Cd 2 in the nanocomposite 34 The powder X-ray diffraction determined the crystal structure and the lattice planes of the synthesized nanomaterials (Fig. 2).The diffraction patterns of BOB and CdS exhibited the characteristic crystal planes at the corresponding angles.The diffraction peaks of CdS were due to the hexagonal crystal lattice and matched well with the JCPDS card 41-1049 37.Among all the diffraction planes, (002) and (101) at 26.5 and 28.2 , respectively, are the most exposed planes for hexagonal crystal lattice of CdS NPs responsible for photocatalytic activity.The diffraction peaks of BOB correspond to the monoclinic crystal lattice with JCPDS card 75-0888 38.The most exposed planes (213) and (117) at 29.8 and 31.8 , respectively, are mainly responsible for the activity.The hydrothermal methodology was adequate for the deposition of CdS NPs onto or in the bulk of BOB and observed in the diffraction pattern of CdBOB.It was found that CdS doped BOB nanocomposite has few diffraction peaks of CdS but with a small intensity, indicating that the nanocomposite material was successfully fabricated.The low intense CdS diffraction signals in the nanocomposite indicates the low loading of CdS but successful binding with each other. The electronic properties of the fabricated nanomaterials have been determined with Raman spectroscopy (Fig. 3).The CdS NPs have two Raman bands due to the longitudinal optical (LO) phonon mode progression.The strong Raman band at 308 cm -1 corresponds to the A 1 longitudinal optical (1LO) mode while the weaker Raman band at 602 cm -1 for overtone of longitudinal optical (2LO) mode 39.Raman spectra of BOB have four Raman bands due to the electronic structure.The Raman band at 77 cm -1 , 93 cm -1 , and 134 cm -1 were due to the external A 1g , internal A 1g , and E 1g internal Bi-Br stretching modes, respectively 40.The Raman band at 157 cm -1 was due to Eg mode's internal Bi-Br stretching 41.These four Raman bands confirm the electronic structure of BOB semiconductors.After the deposition of CdS on BOB, the Raman bands of CdS were shifted from 308 cm -1 and cm -1 to 301 cm -1 and 599 cm -1 , respectively, in CdBOB nanocomposite, while the A 1g , E 1g , and E g Raman bands were shifted to the lower stretching frequencies.The shifting in the Raman stretching frequencies confirms the formation of CdBOB nanocomposite material. Furrier-transform infrared (FTIR) spectroscopy determined the stretching and bending vibrational modes of the fabricated nanomaterials (Fig. 4).In the vibrational spectra of CdS, the vibrational peaks at 623 cm -1 , 1102 cm -1 , and 1352 cm -1 were attributed to the Cd-S stretching vibrations 42.The last two vibrational peaks at 1626 cm - and 3423 cm -1 were due to the adsorbed water and -O-H stretching.The vibrational peaks at 590 cm -1 and 1460 cm -1 were due to the Bi-O bonding in IR spectra of BOB confirmed the formation of Bi 24 O 31 Br 43.There was no adsorbed water, and hydroxyl stretching vibration indicates the minimum presence of -OH groups at BOB.After doping of CdS on BOB, the vibrational peaks at1102 cm -1 and 1626 cm -1 of CdS were shifted to 1123 cm -1 and 1655 cm -1 , respectively, in the CdBOB nanocomposite while the vibrational signals of BOB at 590 cm -1 , cm -1 , and 1460 cm -1 were shifted to 593 cm -1 , 898 cm -1 , and cm -1 , respectively.The nanocomposite material has a broad signal at 3447 cm -1 indicated that the CdS deposited BOB nanocomposite absorbs some moisture content. The high-resolution transmission electron microscopy (HR-TEM) elucidated the morphology and planes of the fringes.Fig. 5a andb exhibited the rectangular nanosheet structure of the BOB semiconductor.Also, the dark spots at the BOB nanosheets were due to the deposition of CdS nanoparticles.These CdS nanoparticles were observed in Fig. 5c.Also, the d-spacing of 0.313 nm for the (101) plane was confirmed for CdS nanoparticles and matched well with the XRD pattern of CdS (Fig. 5d).The BOB support materials also showed a d-spacing of 0.287 nm for the (117) plane, the most exposed plane in the BOB material.The selected area electron diffraction (SAED) pattern indicates the high crystallinity of CdBOB nanocomposite. Additional information on the formation of the nanocomposite material was done Scanning transmission electron microscopy (STEM) (Fig. 6).STEM image of CdBOB nanocomposite showed a sheet structure which related to the HR-TEM images 44.Also, the STEM-EDX line analysis exhibited elements as colored lines for an element.Bismuth was found as the largest concentration in the nanocomposite.Br and Cd were found relative concentration while O was least in the nanocomposite due to the low atomic mass.These exhibited that all the elements were present in CdBOB nanocomposite material and confirmed the formation of nanocomposite material.Ultra-violet visible (UV-vis) spectroscopy determined the absorption spectra, which helped calculate the synthesized nanomaterial's bandgap (Fig. 7).CdS showed strong absorption in the visible region indicates its higher activity in visible light 45.The bandgap estimated was 2.15 eV, which is suitable for high photocatalytic activity.Also, the BOB semiconductor has a narrow absorption band at 473 nm in the visible region, indicating the semiconductor's visible light sensitivity 46.The associated bandgap of BOB was 2.60 eV.CdS doped BOB nanocomposite has a strong absorption band at 491 nm with an improved visible light-responsive enhanced absorption due to the doping of CdS.This referred to managing a combined band gap of 2.52 eV for CdBOB nanocomposite and favorable for higher absorption of visible light than BOB.The improved visible light response for CdBOB was due to creating the BOB surface defects by the doping of CdS NPs. The photoluminescence (PL) spectroscopy analyses the charge separation efficiencies of the nanomaterials synthesized (Fig. 8).The smaller lower PL intensity corresponds to the minimum probability of the recombination of photogenerated electron-hole pairs.The PL spectra were obtained at the excitation wavelength of 325 nm.In BOB's PL plot, the most intense signal observed at 460 nm indicates the highest recombination of electron-hole pairs and minimum visible light activity.CdS show absorption of wavelength at 526 nm with a relatively lower intensity than BOB reveals moderate visible light activity.However, the CdBOB nanocomposite exhibited the minimum intense PL signal at 455 nm amongst all the synthesized materials and corresponded to the least recombination of electron-hole pairs.Therefore, the minimum intensity of the PL signal of CdBOB nanocomposite exhibited the highest separation of the charge carriers and the highest visible light activity. The electron impedance spectroscopy (EIS) determined the arc radius of fabricated nanomaterials, which measures the separation of the charge carriers (Fig. 9).The EIS analysis of all the materials was carried out in visible light.BOB has the largest arc radius with the highest resistance, referring to the restricting movement of electron-hole pairs transfer 47.The electron-hole pair's movement restriction reflects that the electrons excited to the next higher energy level get back to the ground state and do not participate in the photoreduction reaction.This concludes that the restricted movement of electron-hole pairs in a semiconductor is directly associated with its low photoactivity.CdS has a bit smaller arc radius with a slightly lower resistance indicates the moderate restriction of electron-hole pair's movement and moderate visible light activity 48.The CdBOB nanocomposite has the lowest arc radius with the lowest resistance amongst all nanomaterials, corresponding to the lowest recombination of the electron-hole pairs with the highest visible light activity.This represents that the individual CdS and BOB semiconductors have visible light activity, but the photogenerated charge carrier's recombination and resistance in the transfer of electrons limit their use.However, the combination of CdS with BOB improves the charge separation and minimizes the nanocomposite resistance exhibited the highest visible light activity. The fabricated nanomaterial's bulk properties have been determined by the Brunauer-Emmett-Teller multilayer adsorption analysis in liquid nitrogen (Fig. 10).The N 2 adsorption-desorption isotherm of all the fabricated nanomaterials exhibited the type II isotherm with H3 hysteresis.The CdS have 13.27 m 2 -g -1 with an average pore diameter of 3.9 nm, while BOB has a surface area of 7.62 m 2 -g -1 with an average pore diameter of 9.7 nm.After the deposition of CdS on BOB, the nanocomposite's surface area increased to 11.49 m 2 -g -1 with an improved average pore diameter of 6.3 nm.The increased surface was due to the deposition of CdS on BOB's external surface, while the decrease in average pore diameter was due to the deposition of CdS into the pores of the BOB semiconductor. The nanomaterial's thermal stability was estimated using thermogravimetric analysis (TGA) and derivative thermal analysis (DTA) (Fig. 11).The TGA of CdS showed the weight loss at 473 C, and the maximum weight loss was 20.5 wt up to 800 C. BOB semiconductor showed a weight loss of 1.7 wt at 559 C and remained steady up to 800 C.This steady thermogram indicates that the BOB semiconductor was highly stable at high temperatures.The CdBOB nanocomposite The desired photocatalytic reduction of CO 2 experiments was performed in the Pyrex glass cell using the solvent (acetonitrile or N, Ndimethylformamide), a sacrificial donor (TEA or triethanolamine), and proton source (water) in a 3:1:1 ratio under a CO 2 environment in the presence of visible light.Initially, a mixture of acetonitrile, TEA, and water was used for the photocatalytic CO 2 reduction experiment without the catalytic material under visible light.No product formation was observed, indicating that the reaction did not proceed with no catalytic amount of the photocatalyst with CO 2 .In another, no C 1 products detected without CO 2 suggested that CO 2 is necessary for hydrocarbon formation (CH 3 OH and CO).The controlled experiments were also done without water and TEA.Similar results were obtained, indicates that CO 2 was unreacted without water and TEA.When using the catalytic amount of CdS, methanol could be found along with CO and H 2 under similar reaction conditions.Using BOB as the catalytic material, selectively afforded methanol in 179 mol-g -1 as the final product in 24 h.Unlike CdS, there was no CO detected with BOB, which indicates the utility of BOB semiconductor.However, the yield of methanol was low under the reaction condition. The doped CdBOB nanocomposite significantly improved the yield of methanol and CO, and H 2 in 24 h under similar reaction conditions (Fig. 12).This improvement in the product yield indicates that the individual components were not active enough to achieve the appropriate results.Further, the CdS content on the BOB semiconductor was optimized with product yield.The lower loading, 5, 10, and 15 wt of CdS on BOB denoted as CdBOB-5, CdBOB-10, and CdBOB-15 could result in the 716, 1335, and 1597 mol-g -1 of methanol, respectively, under the identical reaction conditions.However, 20 wt of CdS on BOB denoted as CdBOB-20 afforded a maximum of 1739 mol-g -1 yield of methanol under similar reaction conditions.Also, the yield of CO and H 2 were improved to 139.4 mol-g -1 and 48.1 mol-g -1 .Further increased the loading of CdS on BOB to 25 and 30 wt did not improve the methanol yield; instead, the yield of methanol decreased to some extent 1721 mol-g -1 and 1693 mol-g -1 , respectively.The photocatalytic experiments were screened after regular intervals to check the progress of the reduced product formation. The effect of solvent has also been determined using two different solvents, DMF and acetonitrile.The reaction was proceeded using DMF under similar reaction conditions and photocatalyst.The maximum yield of methanol was 1357 mol-g -1 in 24 h, while yields of CO and H 2 were 94.2 mol-g -1 and 37.9 mol-g -1 using CdBOB-20 photocatalyst. Therefore, acetonitrile was found the optimum solvent for the photocatalytic reduction of CO 2 under the reaction conditions.Besides, the use of a sacrificial donor is a crucial approach to get the highest product yields.Here, we have used two sacrificial donors, TEA and TEOA.When selected TEOA as a sacrificial donor with CdBOB-20 photocatalyst, the yield of methanol was significantly different.The yield of methanol was 1163 mol-g -1 using TEOA as the sacrificial donor under reaction conditions.TEOA has three hydroxyl groups at the ethyl chain, where the hydroxyl group's oxygen atoms with strong electron-withdrawing properties restrict the donor tendency of TEOA.As a result of this, the yield of the products reduced.In place of TEOA, TEA does not bear any group at the ethyl chain and retains the electron donor tendency in photocatalytic experiments.Therefore, TEA afforded better results than TEOA under similar reaction conditions.Also, the proton source was identified under identical conditions.There was no methanol formation in the photocatalytic reduction of CO 2 when water was not used.However, a small amount of CO was the only product formed under the photocatalytic experiment.This suggested that water was the only proton source in the photocatalytic experiments.This also ruled out the possibility that TEA might be a proton source. Although the photocatalytic reduction of CO 2 into methanol as a major product occurred using CdBOB-20 nanocomposite, there is a possibility that TEA sacrificial donor degrades and forms CO 2 as one of the degraded products.The CO 2 produced from the degradation of TEA can also be used to produce methanol under visible light conditions.Therefore, the isotopic labeling experiment was performed to check which carbon source was used to produce methanol.For this, a 13 CO 2 gas cylinder (Chemical purity: 99.8, Reference: CLM-185-PK, Unlabeled CAS number: 124-38-9, Labeled CAS number: 1111-72-4) was used under similar experimental conditions.After 24 h, the collected sample was analyzed by GC-MS, which revealed the formation of 13 CH 3 OH with the corresponding fragmentation pattern (Fig. 13).This confirms that TEA did not degrade into the reaction mixture, and externally provided CO 2 could be used to produce methanol under visible light irradiation.The GC-MS of 12 CH 3 OH was also added for the comparison.The gaseous samples were also analyzed with GC-MS and confirmed the formation of 13 CO under similar reaction conditions.The deuterated water was used to confirm the proton source in the reaction 49.This suggested that TEA acted as the sacrificial donor only in the photocatalytic reduction experiments. Further, the stability of catalytic materials is crucial for individuals.After completing the photoreduction experiment, the reaction mixture was centrifuged to separate the catalytic material and washed several times with ethanol, followed by drying the wet content at 50 C overnight.The dried recovered photocatalyst was reused for the subsequent cycles.The recovered photocatalyst was used up to seventh runs without a significant drop in the photoreduction activity.After seven runs, the photocatalyst remained intact with minute leaching of the CdS content, which exhibited the nanocomposite material's excellent performance under the experimental conditions. CdSBi 24 O 31 Br 10 heterojunction photocatalyst exhibited excellent photocatalytic activity for CO 2 photoreduction into methanol.The superiority of the nanocomposite photocatalyst was further investigated by comparing the results obtained with the existing literature on CdS and Bi 24 O 31 Br 10 based heterojunction photocatalysts.It was found that CdSBi 24 O 31 Br 10 heterojunction photocatalyst effectively reduced CO into methanol in visible light among the discussed literature in the Table 1. The photoreduction of CO 2 into corresponding C 1 products is established well in the earlier literature.The photoreduction of CO occurred at the reduction potential of the NHE scale from -0.24 V to -0.65 V and varied with C 1 product formation.The photocatalytic reduction of CO 2 into methanol occurs at -0.38 V (CO 2 /CH 3 OH) at the NHE scale, while the production of CO occurs at -0.53 V (CO 2 /CO) 54,55.CdS have a narrow bandgap of 2.15 eV and having the band edge potential of CB near about -0.7 eV, suitable for the photocatalytic reduction of CO 2 into methanol and CO 56.The BOB semiconductor has a bandgap of 2.60 eV with a low band edge potential of CB (-0.53 eV) 57.Both the semiconductors, CdS, and BOB are active for the production of methanol from the photoreduction of CO 2 , in which BOB has the suitable band edge potential of CB and afforded higher yield of methanol than CdS; however, the individual components did not afford significant results of CO 2 reduction under visible light. The heterojunction of CdS and BOB demonstrated the synergistic effect on the photoreduction of CO 2 into C 1 products.The work function of the semiconducting materials is crucial for photocatalytic activity, which causes the movement of free electrons in the heterojunction 58.The free electrons move from the small work function to the larger one, which stores the electron density at the larger work function semiconductor.The work function of the BOB semiconductor is higher than CdS semiconductor 59,60.Therefore, the movement of free electrons toward the BOB semiconductor from CdS semiconductor induced an internal electric field from CdS to BOB semiconductor.This makes BOB and CdS semiconductors highly electronegative and electropositive, respectively.When the nanocomposite of CdS and BOB irradiated in visible light, the excited electron at CB of highly electronegative BOB semiconductor migrated to the VB of highly electropositive CdS where the present holes recombine with these electrons and inhibits the recombination of electron-hole pairs in CB and VB of BOB and CdS, respectively.This led to VB's strong oxidizing ability and strong reducing ability of CB of CdS. In CdBOB-20 heterojunction, the electrons of CdS and BOB semiconductors get excited from VB to higher energy CB and leaves the holes at VB (Scheme 1).Simultaneously, the holes at VB of BOB split water molecules into H , O 2 , and six electrons.Some of the excited electrons at CB of BOB are utilized to reduce CO 2 into methanol and CO.The rest are transferred to the lower energy VB of CdS, where the present hole is satisfied by these electrons and does not recombine with the electrons at CB of CdS.At this stage, the photogenerated electron-hole pair's recombination minimized and exhibited the excellent separation of charge carriers.The effective separation of charge carriers in the CdBOB-20 nanocomposite was demonstrated in the PL and EIS spectra, showing that the CdBOB-20 nanocomposite has the lowest recombination photogenerated electron-hole pairs and lowest resistance to transfer the electrons, respectively.The excited electrons at CB of CdS in the CdBOB-20 nanocomposite reduced the adsorbed CO 2 into methanol and CO.Also, the remaining protons were reduced to hydrogen molecules along with the small extent of oxygen molecules."
  },
  {
    "title": "Conclusions",
    "content": "In this work, we have fabricated chalcogenide and p-block elements based on CdS doped Bi 24 O 31 Br 10 nanocomposite materials.The nanocomposite material has good to excellent photocatalytic activity to reduce CO 2 into C 1 products, such as methanol and carbon monoxide, and H 2 and O 2 .Bi 24 O 31 Br 10 semiconductor demonstrated the photoreduction activity; however, the incorporation of CdS improved the photocatalytic activity for CO 2 reduction and afforded excellent yields of 1739 mol-g -1 of CH 3 OH and 139.4 mol-g -1 of CO as major products under experimental conditions.Also, molecular hydrogen and oxygen were produced under similar reaction conditions.The improved yields of CH 3 OH and CO were due to the semiconducting material's synergistic effect, facilitating the effective separation of electron-hole pairs in the nanocomposite material.The nanocomposite material was active The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Fig. 1.X-ray photoelectron spectra of a) Cd-3d, b) S-2p, c) Bi-4f, d) O-1s, and e) survey scan of CdS, BOB, and CdBOBr nanocomposite. . The shift in the binding energy of Cd-2p signals indicates the facile excitation of electrons at the surface of the semiconductor.The two XPS signals in the XPS spectra of S-2p at 182.1 eV and 175.5 eV of 2p 1/2 and 2p 3/2 correspond to the S oxidized form of sulfur in CdS while 2p 1/2 and Fig. 2. Powder X-ray diffraction pattern of CdS, BOB, and CdBOB nanocomposite material. 2p 3/2 XPS signals were found at 181.7 eV and 175.1 eV, respectively, in CdSBi 24 O 31 Br 10 nanocomposite material 35.Bismuth showed two characteristic XPS peaks 4f 5/2 and 4f 7/2 at 165.9 eV and 160.5 eV in Bi 24 O 31 Br 10 semiconductor, correspond to Bi 3 .In CdBOB nanocomposite, bismuth exhibited two XPS peaks at 165.4 eV and 160.1 eV of 4f 5/2 and 4f 7/2 , respectively, for the presence of 3-oxidation state of Bi 36.O-1s exhibited two XPS signals at 532.1 eV and 531.0 eV due to the O-Bi 5 and O-Bi 3 , respectively, in Bi 24 O 31 Br 10 semiconductor.In the nanocomposite, O-1s represented three XPS signals; the first XPS signal at 530.9 eV was due to the O-Bi 3 bonding, and the XPS signal at 532.0 eV was due to the O-Bi 5 bonding, which indicated that after the confinement with CdS, the oxygen bound with few Bi 5 and confirmative of few 5-oxidation states.The third XPS peak at 533.6 eV was observed due to the nanocomposite material's -OH functionalities.The survey scan of CdS, Bi 24 O 31 Br 10 , and CdBOB nanocomposite photocatalyst confirms the presence of elements. Fig. 3. Raman spectra of CdS, BOB, and CdBOB nanocomposite.Fig.4. Furrier-transform infrared spectra of CdS, BOB, and CdBOB nanocomposite. Fig. 3. Raman spectra of CdS, BOB, and CdBOB nanocomposite.Fig.4. Furrier-transform infrared spectra of CdS, BOB, and CdBOB nanocomposite. Fig. 5. High-resolution transmission electron microscope images and selected area electron diffraction pattern of CdBOB nanocomposite. Fig. 6.STEM and STEM-EDX line analysis of CdBOB nanocomposite. Fig. 7. Ultra-violet-visible spectra and tauc plots of CdS, BOB, and CdBOB nanocomposite. Fig. 8. Photoluminescence spectra of CdS, BOB, and CdBOB nanocomposite. Fig. 9. Electron-impedance spectra of CdS, BOB, and CdBOB nanocomposite. Fig. 10.N 2 adsorption-desorption isotherms and pore diameters of CdS, BOB, and CdBOB nanocomposite. Fig. 11.Thermogravimetric analysis and derivative thermal analysis of CdS, BOB, and CdBOB nanocomposite. Fig. 12. Methanol yield obtained in time, catalysts, solvents, and cyclic runs of photoreduction experiments. Fig. 13.GC-MS spectra of isotopic CO 2 photoreduction experiments. enough and stabled up to the sixth run of the photocatalytic reduction experiment.CRediT authorship contribution statement Qingping Mou: Supervision, Funding acquisition, Writingoriginal draft, Writingreview editing.Zhenlian Guo: Methodology, Data curation, Formal analysis.Yongming Chai: Visualization, Investigation.Bin Liu: Formal analysis, Data curation.Chenguang Liu: Writing -review editing. Comparing present work with the existing literature. Q.Mou et al. Authors acknowledge director, China University of Petroleum, Qingdao, China.The authors are thankful to the central analytical facilities for analysis."
  }
]