[
  {
    "title": "Doi",
    "content": "10.1007/s11051-020-05019-x"
  },
  {
    "title": "Article_Title",
    "content": "Highly efficient photocatalytic reduction of CO2 on amine-functionalized Ti-MCM-41 zeolite"
  },
  {
    "title": "Abstract",
    "content": "Efficient adsorption and utilization of carbon dioxide play an important role in mitigating the greenhouse effect and developing clean energy.Surface functionalization of photocatalyst is an efficient method to promote the adsorption of CO 2 and convert it into hydrocarbon fuels.In this work, tetraethylenepentamine (TEPA) is used to functionalize Ti-MCM-41 molecular sieve photocatalyst to enhance the adsorption and activation of CO 2 .Ti-MCM-41 molecular sieve was modified without any precious metal additives.When the content of TEPA was 1, the yield of CH 4 was 232 ppm g -1 h -1 .Furthermore, the results indicate that high impregnation amount of TEPA causes strong and higher adsorption of CO 2 but inefficient for its conversion.This is probably due to the blockage of the channel when the impregnation amount of TEPA exceeds the threshold value, which hinders the further conversion of CO 2 molecules.Functionalization Ti-MCM-41 zeolite photocatalyst with amino group is the prime reason for its excellent CO 2 adsorption followed by activation capacity.In the future, this proposed composite might come up as a perspective photocatalyst in the field of photocatalysis for the purpose of environment remediation."
  },
  {
    "title": "Experimental",
    "content": "Ti-MCM-41 zeolites with the molar ratio of Si/Ti 10 were prepared according to our previous work (Jia et al. 2019).Mass fraction (1-40) of tetraethylenepentamine (TEPA) was added to 10 mL ethanol solution dispersed with 0.1 g Ti-MCM-41 zeolite.The obtained slurry was continuously stirred at room temperature until the solvent was evenly stayed at room temperature for 12 h, and then, the sample was dried at 80 C.The obtained samples were denoted as Ti-xTEPA, where x represents the weight percent of TEPA to Ti-MCM-41 zeolite.For comparison, other kinds of organic amines were also selected, such as ethylenediamine (EDA), triethylenetetramine (TETA), and ethylenediamine (PEI-600). The X-ray diffraction (XRD) pattern of the samples was measured by the X'Pert Philips diffractometer (Bruker D8 Advance).FTIR experiments were carried out on a VERTEX 70 IR spectrometer with the standard KBr pellet method.The specific surface area of the sample was calculated according to the Brunauer-Emmett-Teller (BET) method by Quadrasorb SI-4.The surface acid-basic property of the photocatalyst was conducted by CO 2 temperature-programmed desorption (CO 2 -TPD), and 0.1 g sample was placed in the U glass tube and preheated 1 h at 773 K in He flow and then cooled to room temperature.CO 2 was introduced into the glass tube at room temperature for 30 min and evacuated at 313 K for 30 min in He flow.Finally, the TPD measurements were carried out at the heating rate of 10 K min -1 from 313 to 773 K. The photocatalytic reduction of CO 2 was conducted in a 200-mL quartz reactor.Photocatalyst (0.1 g) and 125 mL H 2 O were put into the reactor, and then, the catalyst was ultrasonic dispersed uniformly.The high purity CO 2 gas was introduced to the solution for 1 h under magnetic stirring to obtain the CO 2 saturated solution.The photocatalytic reaction was performed at room temperature for 6 h under the irradiation of a high-pressure Hg lamp with 300 W. At the same time, the temperature of the reaction was controlled at 10 C using a condensing pump of ethanol to prevent decomposition of TEPA at high temperature.In addition, we irradiated the catalyst for 6 h in N 2 atmosphere to eliminate the interference of the photolysis of organic amines on the reaction activity.The products were analyzed by a gas chromatography GC-2018 (SHIMADZU, Japan), which was equipped with a flame ionization detector (FID) and a methanation reactor."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The low-angle XRD pattern of the sample shown in Fig. 1 illustrated that the diffraction peaks of the ( 100), (110), and (200) planes of the Ti-MCM-41 molecular sieve appeared at 2.3, 3.9, and 4.5, indicating that the sample has longrange order hexagonal mesoporous structure (Sophie and Mario 1998).The effect of TEPA impregnation is observed in form of peak broadening which gradually increases with increase in the amount of TEPA support effective functionalization through disordering in the crystal structure.The broadening increased to such an extent that the peak belongs to ( 110) and ( 200) planes that almost disappeared when the TEPA amount reaches 40 probably because of multiple molecular layers of TEPA which plug the pore and cover the surface of Ti-MCM-41 molecular sieve. An infrared spectrum of Ti-MCM-41 and aminefunctionalized samples are shown in Fig. 2. The line a is for Ti-MCM-41 without amino modification.The peaks at 460, 801, and 1088 cm -1 represent a bending, symmetrical, and asymmetric vibration of Si-O-Si, respectively.The peak at 3462 cm -1 belongs to hydroxy group Si-OH as well as adsorbed water.As the increase of the amount of TEPA, the intensity of the peak about the amine groups increased gradually.From line e, we can see the main peak of TEPA clearly, in which the peaks at 1313, 1480, and 1570 cm -1 belong to C-N, C-H, and N-H (secondary amine) vibrations (Khatri et al. 2005(Khatri et al. , 2006;;Yue et al. 2008).By comparing line a and e, we can conclude that TEPA was successfully modified on the surface of Ti-MCM-41 zeolite. Figure 3 is the TEM images of Ti-1TEPA and Ti-40TEPA samples.It is observed that Ti-1TEPA sample had a well-organized pore structure as the morphology of the molecular sieves is very similar to pristine Ti-MCM-41 (Fig. 3a).This indicates that 1TEPA does not affect the structure of the molecular sieve and also maintained a clear pore structure.When the impregnation amount increased to 40, the pore structure is not as clear as that of the pristine Ti-MCM-41 (Fig. 3c).The TEM result further supports XRD results in a way that the surplus TEPA (40 and above) filled the pore of the molecular sieve and distort its structure gradually. The specific surface area and pore size distribution of the samples are shown in Table 1.The specific surface area of Ti-MCM-41 molecular sieve was 793 m 2 g -1 .After functionalization, the specific surface area and When the TEPA impregnation amount reached to 40, the specific surface area and pore volume of the sample were significantly reduced; however, pore diameter sharply increased to 16.6 nm.This may be due to the fact that the high molecular pressure induces amino group (TEPA) and the silane (molecular sieve) intertwining in the pores results in over filling the pore up to the extent that pore get interconnected.This situation is not good for CO 2 conversion as it does not provide enough space for molecular interaction and their recycling. Table 2 shows the N element content of the TEPAmodified molecular sieve sample measured by elemental analysis for the calculated loading of the TEPA.TEPA mainly combined with Ti-MCM-41 molecular sieve through hydrogen bonding as it having hydroxyl group in the skeleton.From the value, it can be estimated that with the increase of TEPA content, the N element and organic amine loading increase non-linearly due to the saturation effect of the surface.For instance, when the TEPA impregnation amount was 1, the actual loading reached to 0.8 while for the 40 TEPA, the loading is 21.9.This supports that there is a limit of the impregnation of TEPA for a specific surface area of Ti-MCM-41 and after that limit, no further impregnation is possible.Hence, an optimum concentration of TEPA is expected to work efficiently for the photocatalytic conversion. CO 2 temperature-programmed desorption analysis of catalyst CO 2 temperature-programmed desorption (TPD) curves for different TEPA impregnated molecular sieve samples are illustrated in Fig. 5.According to the analysis, it is identified that the unmodified Ti-MCM-41 sample showed a desorption peak at 110 C due to the weak adsorption of CO 2 molecules on the surface of the molecular sieve.After the amino modification, the desorption temperature of CO 2 increased and the desorption peak area is slightly larger than that of unmodified Ti-MCM-41, indicating that the adsorption capacity for CO 2 is enhanced after functionalization.There is big transition in the desorption temperature from 145 to 170 C observed when the TEPA concentration changes from 1 to 5.This inferred that the surface of Ti-MCM-41 homogeneously covered when the composition is 1 and beyond this, interaction between CO 2 and amine is stronger.It is anticipated that more than one amino group interact with one CO 2 especially inside the pore when the composition is above 1 wt.Interestingly, Ti-40TEPA sample has two distinct desorption peaks, one is located at 150 C and another is around 338 C with wide range distribution.In accordance with the BET (Table 1) and desorption result, when the TEPA impregnation amount was 40, the pores of the molecular sieve get block up due to the accumulation of excess TEPA inside the channel/pore.The exposed TEPA preferentially desorbs the adsorbed CO 2 at lower desorption temperature, and the TEPA inside the channel requires a higher desorption temperature for the adsorbed CO 2 . Thermogravimetric analysis (TGA) is another tool which not only confirms the surface functionalization but also justifies the interaction between two components.Figure 6 is the TGA plot of Ti-MCM-41, Ti-1 TEPA and Ti-40 TEPA samples to understand the composition both qualitatively and quantitatively.The weight loss occurs mainly by two steps for both the sample while the step temperature is different.The first step is at 25-70 C, 25-125 C, and 25-170 C for Ti-MCM-41,Ti-1 TEPA, and Ti-40 TEPA sample, respectively.This step is mainly because of water and CO 2 desorption; in this step, the mass loss of Ti-MCM-41, Ti-1 TEPA, and Ti-40 TEPA is 5.3, 14.5, and 7, respectively.These water and CO 2 molecules are physically adsorbed on the surface area of the molecular sieve, or are closed in the pores.In line to the previous experimental data, Ti-40 TEPA sample is inhomogeneously functionalized with amino group and TEPA inside the pore does not allow easy desorption of gaseous product.First step decomposition at higher temperature with lesser degree of mass loss indicates that the Ti-40 TEPA sample had a stronger adsorption for water and CO 2. The second little weight loss occurred between 150 and 600 C due to the removal of residual organic templates (CTAB).The second step mass loss occurs at 125-600 C and 175-600 C that belong to the decomposition of organic species, i.e., TEPA.The amounts of mass loss at this step are nearly 1 and 25 for Ti-1 TEPA and Ti-40 TEPA samples that also justify amine loading amount which is consistent with the results of elemental analysis. Photocatalytic activity for CO 2 reduction Figure 7 and Table 3 show the photocatalytic activity profiles of Ti-MCM-41 contain different amounts of TEPA, and other kinds of organic mine molecules were also selected to compare with TEPA.The mainly reduction products of CO 2 on the TEPA-modified Ti-MCM-41 zeolites are CH 4 and CO.From Fig. 7a, we can clearly see that the highest production rates of CH 4 and CO were 232 and 2537 ppm g -1 h -1 , which were obtained on the samples of Ti-1TEPA and Ti-30TEPA.In comparison with the photoactivity of Ti-MCM-41 and TEPA-modified samples, we can clearly see the photo-generated rate of CH 4 and CO increased a lot after the sample modified by TEPA, indicating that TEPA indeed increased the adsorption and activation of CO 2 molecules, thereby promoting the photoreduction efficiency.When the impregnation amount of TEPA reached 40, the activity decreased sharply.Although the adsorption amount of CO 2 increased in accordance with the other characterization result, the over saturated impregnation of TEPA hampers the photocatalytic conversion of CO 2 probably because of steric hindrance and/or inefficient light absorption.Moreover, as illustrated in Table 3, when the pumped gas of CO 2 was replaced by the inert gas of N 2 , a certain amount of CH 4 and CO was also detected, indicating that TEPA will decompose under the irradiation of mercury lamp.Therefore, to eliminate the influence of TEPA decomposition, the real activity was calculated by the subtracting the product amount with N 2 pumping, which is 0 CH 4 and 0 CO in Table 3. To defend the superiority and versatility of TEPA, other different kinds of organic amines such as ethylenediamine (EDA), triethylenetetramine (TETA), tetraethylenepentamine (TEPA), and polyethyleneimine (PEI600) were selected to modify Ti-MCM-41 molecular sieves, and the photoactivities under the amount of the organic amines of 1 are shown in Fig. 7b.The yield of CH 4 (232 ppm g -1 h -1 ) as well as CO Fig. 6 Thermogravimetric curve of Ti-MCM-41, Ti-1 TEPA, and Ti-40 TEPA samples outstanding molecules for this purpose.After optimization, 1TEPA proposed as an excellent photocatalyst for the purpose of CH 4 evolution while CO generation required further loading of TEPA up to 30.Since amino group is the site for CO 2 adsorption as well as CO 2 conversion, thus, in fine distribution of TEPA on the surface of Ti-MCM-41 is a primary criterion for the efficiency of the catalyst for a specific purpose.The result of this study will add a foot forward in the direction of suppressing the problem of green house gases for the betterment of planet. Figure 4 shows the SEM and EDS element distribution images of Ti-1TEPA sample.It can be seen from the figure that the sample mainly contained Si, O, Ti, C, and N elements; those are basic components of TEPA and Ti-MCM-41.The domination of Si and O over Ti, C, and N elements supports the success of functionalization in a uniform dispersion when the amount of TEPA is 1.This result is in coherent to the observation obtained through FTIR. Fig. 1 Low-angle XRD of Ti-MCM-41 containing different amounts of TEPA Fig. 3 TEM images of the sample.a Ti-MCM-41.b Ti-1 TEPA.c Ti-40TEPA Fig. 5 CO 2 -TPD curve of TEPA functionalized molecular sieve samples Specific surface and pore size of different TEPAmodified Ti-MCM-41 zeolites Funding This study was funded by the National Natural Science Foundation of China (Nos.21673066, 21703054, 51702087). (2194 ppm g -1 h -1 ) is highest when TEPA was used as the organic amine source.It is believed that the molecular weight and number of amine group per molecules is the influencing factor on resultant photocatalytic result.Since, EDA and TETA contain smaller number of amino groups and the PEI600 chain which is not sufficient to fully utilize the pore structure of the molecular sieve; therefore, TEPA emerged as a best candidate for modification for the purpose of efficient photocatalytic activity. The photocatalytic mechanism of CO 2 reduction on organic amine modified Ti-MCM-41 zeolite is proposed in Fig. 8.The large BET surface areas and regularly ordered porous structure of Ti-MCM-41 zeolite are favorable for the adsorption of CO 2 , and the CO 2 molecules can be confined in the pores of the molecular sieve as a micro-reactor.In addition, the interaction between organic amine and CO 2 plays a crucial role in CO 2 adsorption of amine functionalized Ti-MCM-41 zeolite.In the process of CO 2 diffusion into the pores, CO 2 molecular contacts with TEPA to complete adsorption.Figure 8 illustrates the reaction of CO 2 and the TEPA which was dominated by the formation of an intramolecular carbamate salt, which is then reduced to CH 4 and CO by electrons in the molecular sieve."
  },
  {
    "title": "Conclusions",
    "content": "In summary, amino functionalization modification of Ti-MCM-41 zeolite by impregnation method significantly improved the photocatalytic reduction of CO 2 .Among various amine, TEPA was found to be"
  }
]