[
  {
    "title": "Doi",
    "content": "10.1016/j.apsusc.2013.08.111"
  },
  {
    "title": "Article_Title",
    "content": "On sol–gel derived Au-enriched TiO2 and TiO2-ZrO2 photocatalysts and their investigation in photocatalytic reduction of carbon dioxide"
  },
  {
    "title": "Abstract",
    "content": "Gold-enriched TiO 2 and TiO 2 -ZrO 2 and their parent counterparts were prepared by using the sol-gel process controlled within the reverse micelles environment, followed by impregnation in AuCl 3 solution.Catalysts were characterized by organic elementary analysis (OEA), inductively coupled plasma mass spectrometry (ICP MS), N 2 physisorption, powder X-ray diffraction (XRD), transmission electron microscopy (TEM) combined with electron diffraction, UV-vis spectroscopy, and tested in CO 2 photocatalytic reduction.The performance of photocatalysts iluminated by UV-lamp with the wavelenght maximum at 254 nm was decreasing in the order TiO 2 -ZrO 2 Au/TiO 2 -ZrO 2 TiO 2 Au/TiO 2 TiO 2 Evonic P25.The photocatalytic performance decrease over Au/TiO 2 -ZrO 2 and Au/TiO 2 , compared to their parent counterparts, can be explained by the presence of too large Au particles, which block the oxide surface and either reduce the light absorption capability of the catalysts, or serve as the recombination centres.Higher photocatalytic performance of the amorphous TiO 2 -ZrO 2 than of the nanocrystalline TiO 2 can be ascribed to the enlarged surface area and higher photoactivity of titania-zirconia oxide mixture under the UV lamp with the wavelenght maximum at 254 nm.With regard to crystalline materials the appropriate anatase crystallite-size plays a key role in performance of CO 2 photocatalytic reduction.Moreover, correlation between the adsorption edge and the anatase crystallite-size was revealed."
  },
  {
    "title": "Experimental",
    "content": "Parent TiO 2 photocatalyst and TiO 2 -ZrO 2 photocatalyst (in molar ratio of 50:50) were prepared by the sol-gel method controlled in reverse micelar solution of nonionic surfactant Triton X-114 in cyclohexane in combination with the calcination 44,45.Titanium (IV) isopropoxide and 70 wt.solution of zirconium (IV) propoxide in propan-2-ol were used as metal sources.For synthesis of TiO 2 the molar ratio of cyclohexane:Triton X-114:water:Ti(isop) 4 was kept 11:1:1:1 44.For synthesis of TiO 2 -ZrO 2 the molar ratio of cyclohexane:Triton X-114:water:Ti(isop) 4 :Zr(prop) 4 was set to be 11:1:1:0.5:0.5 45.The prepared sols were poured in thin layer on Petri dishes and left for 48 h on air at ambient temperature and pressure.The sols converted into rigid gels.The titania and titania-zirconia gels were thermally treated at 400 C for 4 h and then up to 450 C for 20 min with heating rate 1 C/min with the aim to produce the powdery form of photocatalysts.Both parent photocatalysts were grained to particle size 0.160mm and a part of each was impregnated by 0.4 wt. of Au. AuCl 3 was used like noble metal precursor.The appropriate amount of AuCl 3 was dissolved in distilled water under short-term ultrasonication (approximately 2 min).The Au-enriched solution was mixed with the parent photocatalyst in the ratio of 6 ml H 2 O per 1.5 g of the catalyst.The as-prepared mixture was slowly rotary evaporated at 30 C under vacuum 10 Torr.After impregnation the Au-enriched photocatalysts were left on air for 1 h, then dried in the oven at 105 C for 1 h followed by calcination up to 450 C.After re-calcination 0.4 wt. Au/TiO 2 and 0.4 wt. Au/TiO 2 -ZrO 2 photocatalysts were grained to particle size 0.160mm. Commercial TiO 2 Evonic P25 was supplied by Sigma-Aldrich, Prague, Czech Republic. Photocatalysts were characterized by organic elementary analysis (OEA), inductively coupled plasma mass spectrometry (ICP MS), N 2 physisorption, powder X-ray diffraction (XRD), transmission electron microscopy combined with electron diffraction (TEM/SEAD) and UV-vis spectroscopy. The purity (elementary carbon in weight ) of photocatalysts was specified on the Vario EL III apparatus from Elementar.5 mg of photocatalyst was burned in oxygen atmosphere at temperature up to 1200 C. Gaseous products (N 2 , CO 2 , H 2 O and SO 2 ) were purified, separated to individual components and analyzed on TCD detector.For each photocatalyst the analysis was triplicated.The detection limit of the apparatus was 0.1 abs.. Gold in Au-enriched photocatalysts was quantified on the ICP MS instrument Element II.Samples were leached in aqua regia solution, standing at room temperature for 1 h, then refluxing in order to remove nitrogen oxides.Operating conditions of the instruments were set up according to the manufacturer recommendation.The mass calibration was performed using commercial mas-cal solution (Merck).Quantification was done using the isotope 197Au with 115 In internal standard. N 2 physisorption was performed on the ASAP 2020 Micromeritics after sample degassing at 105 C for 24 h under less than 1 Pa vacuum.The adsorption-desorption isotherms were measured by nitrogen at -196 C. The specific surface area, S BET , was calculated according to the classical Brunauer-Emmett-Teller (BET) theory for the p/p 0 range 0.05-0.25 46.The mesopore surface area, S meso , and the micropore volume, V micro , were evaluated by t-plot method using Lecloux-Pirard standard isotherm with C constant 47,48.The total pore volume, V total , was determined from nitrogen adsorption isotherm at maximum p/p 0 (0.995).Pore size distribution (PSD) was evaluated from adsorption branch of nitrogen adsorption-desorption isotherm using the BJH method 49 via the Roberts algorithm 50, the empirical Lecloux-Pirard standard isotherm and the assumption of the cylindrical pore geometry. The crystalline phases in the photocatalysts were determined by X-ray powder diffraction using Bruker D8 Advance 90 diffractometer in the Bragg-Brentano geometry, equipped with a V ANTEC 1 position-sensitive detector and using Ni-filtered CoK radiation.The crystallite-size was calculated using the Scherrer's equation.The NIST lanthanum 92 hexaboride (LaB 6 ) line profile standard was measured in the same experimental arrangement as investigated samples to characterize instrumental effects.The morphology of photocatalysts was studied by transmission electron microscopy in combination with electron diffraction using EM-201 transmission electron microscope from Philips. UV-vis diffuse reflectance spectra of examined photocatalysts were measured by using GBS CINTRA 303 spectrometer equipped with a Spectralon-coated integrating sphere using a Spectralon coated discs as a standard.The spectra were recorded in the range of the wavelength 190-850 nm (lamps switched at 350 nm).The reflectances were re-calculated to the absorption using the Schuster-Kubelka-Munk equation, where R is the diffuse reflectance from a semi-infinite layer.Obtained spectra were transformed to the dependencies (F(R )h ) 2 against h and assuming that the Tauc's law 51 can be expressed as: , where the 0 -the energy of absorption edge values were determined from obtained plots, h is the Planck constant and is a frequency.The absorption edge was estimated by extrapolating the decreasing portion of the spectrum to the abscissa at zero absorption as it was shown in our other studies 41,43. The photocatalytic reduction of carbon dioxide was carried out in an apparatus composed of a stirred batch annular reactor with a suspended catalyst illuminated by UV 8 W Hg lamps (254 nm and 365 nm wavelength).The spectra profiles of used lamps are shown in Fig. 1.The gas chromatograph, equipped with flame ionization and thermal conductivity detectors, was used for the analysis of gaseous reaction products. The details of the CO 2 photocatalytic reduction experiment and analytical methods were described in our previous publication 41.As published recently a suitable volume of the liquid phase was set in our annular photoreactor at 100 ml to fullfil the requirement of perfect mixing 40.The 0.2 mol l -1 NaOH was used as the reduction medium. The accuracy of measurements was verified by the series of repeated measurements.Average values mentioned in this article were calculated minimally from 3 times repeated photocatalytic measurement for each catalyst.The maximum relative error was 10.The relative error of the photocatalytic measurement covers the error of analyzing system itself (GC/FID/TCD, commonly acceptable relative error of 5), the error caused by handle taking of gas sample from the reactor by using gastight syringe, handle sampling to the gas chromatograph and the catalyst inhomogeneity (especially in the case of Au supported catalysts)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The purity (i.e.content of elementary carbon in wt.) of prepared photocatalysts was investigated by using organic elementary analysis in order to exclude the presence of some remaining organic contaminants from sol-gel synthesis which could affect 1).However, in spite of this practically comparable Au loading the textural properties of 0.4Au/TiO 2 and 0.4Au/TiO 2 -ZrO 2 photocatalysts are significantly different. Textural properties of all tested photocatalysts are summarized in Table 1.Nitrogen adsorption-desorption isotherms and pore-size distributions are depicted in Fig. 2a-d.It can be seen from Fig. 2a-c that nitrogen adsorption-desorption isotherms of all tested photocatalysts correspond to the combination of I and IV isotherm types according to IUPAC classification, however, for each type of photocatalyst with significantly different ratio of mesopores/macropores and micropores.The isotherm of commercial TiO 2 Evonic P25 (Fig. 2a) is typical for the material with large mesopores/macropores and small portion of micropores (Table 1).The isotherms of prepared TiO 2 based photocatalysts (parent TiO 2 and 0.4Au/TiO 2 ) (Fig. 2b) correspond to the material with small mesopores and bigger contribution of micropores than in commercial TiO 2 Evonic P25.These features agree with evaluated textural parameters of photocatalysts shown in Table 1.Contrary to TiO 2 Evonic P25, in which the micropores represent only 5 of total pore volume, for TiO 2 based photocatalysts the micropores constitute 16-18 (Table 1).From Fig. 2d it is also visible that TiO 2 Evonic 25 shows polydisperse pore size-distribution with two main maxima in mesoporous/macroporous region, corresponding with two sizes of large pores; with radii 12 nm and 40 nm.Parent TiO 2 and the 0.4Au/TiO 2 photocatalysts show the similar small mesopores with radius 2.9 nm and 2.4 nm, respectively (Table 1).The shape of isotherms of TiO 2 -ZrO 2 based photocatalysts (TiO 2 -ZrO 2 and 0.4Au/TiO 2 -ZrO 2 ) (Fig. 2c) indicates the presence of quite high portion of micropores in mesoporous material.Here the micropores represent up 40-44 of the total pore volume.Parent TiO 2 -ZrO 2 and the 0.4Au/TiO 2 -ZrO 2 photocatalyst show the same small mesopores with radius 1.3 nm (Fig. 2d, Table 1).The mesopore surface area, S meso , of investigated photocatalysts decreases in the order TiO 2 -ZrO 2 0.4Au/TiO 2 -ZrO 2 0.4Au/TiO 2 TiO 2 Evonic P25 TiO 2 . Structural properties as the crystallinity, the phase composition and the crystallite-size of identified crystalline phases in investigated photocatalysts were examined using powder X-ray diffraction (using CoK radiation).XRD patterns of all laboratorysynthesized photocatalysts are shown in Fig. 3 The anatase diffraction lines of pristine TiO 2 and 0.4Au/TiO 2 as well are broaden significantly due to small crystallite-size and the effect is different for both TiO 2 based photocatalysts.The pristine TiO 2 shows narrower (1 0 1) reflection (FWHM f 0.79) than 0.4Au/TiO 2 (FWHM f 1.01).This feature corresponds to larger anatase nanocrystallites in pristine TiO 2 (12 nm) than in 0.4Au/TiO 2 photocatalyst (9.3 nm) (Table 2).Besides anatase diffraction lines, in 0.4Au/TiO 2 the weak broad diffraction line at 52.1 can be attributed to crystalline Au (2 0 0) reflection.Another main Au reflection at 2 44.7 cannot be proved because it is overlapped by the anatase (0 0 4) reflection.The Au crystallite-size in 0.4Au/TiO 2 photocatalyst estimated from a weak broad diffraction line at 2 52.1 Further, from XRD patterns it is evident that in both TiO 2 -ZrO 2 based photocatalysts, TiO 2 -ZrO 2 and 0.4Au/TiO 2 -ZrO 2 , the TiO 2 -ZrO 2 support is amorphous.The only crystalline phase is gold supported in the 0.4Au/TiO 2 -ZrO 2 photocatalyst.Due to the amorphousness of the TiO 2 -ZrO 2 support the diffraction lines at 2 44.8 and 52.2 , corresponding to the hkl (1 1 1) and (2 0 0) Au reflections, respectively, can be nicely distinguished.Besides that, both Au diffraction lines are more intense and narrower than in 0.4Au/TiO 2 , indicating the presence of significantly larger Au crystallites than in 0.4Au/TiO 2 (Table 2).The Au (1 1 1) and (2 0 0) peaks widths (FWHM f 0.03 and 0.07, respectively) correspond to the estimation of the Au crystallite-size 100 nm. It should be noted that this is only rough mean estimate of the Au crystallite size.When using the Scherrer equation for evaluation of the crystallite size from XRD patterns, several important aspects are omitted within this theory, e.g. the existence of the crystallite size distribution.In the case that there would be present several large and houndreds of small gold crystallites, the estimated crystallite size from the FWHM of the main reflection of such gold crystallites by using Scherrer equation would correspond to larger crystallite size.Thus, the crystallite sizes evaluated from the Scherrer equation should be taken only as the rough estimates which indicate some trend.It would not be surprising at all, if the real Au crystallite size was even smaller. The interesting feature of the synthesized TiO 2 support is the fact that some of its part is amorphous.This feature of the TiO 2 synthesis by reverse micelles in the combination with the calcination was firstly indicated in the previous study 44, and even proved and quantified after the normalization to the fully crystalline materials in the case of preparation of various TiO 2 -CeO 2 molar mixtures 52.The present amorphous part can be attributed to TiO 2 .Based on this feature the big difference in the surface areas ( S meso 28 m 2 /g, S BET 43 m 2 /g) and also in the TiO 2 crystallitesizes ( d p 3 nm) between parent TiO 2 and 0.4Au/TiO 2 can be explained.The higher surface areas (both, S meso and S BET ) and total pore volume, V total , of 0.4Au/TiO 2 than of parent TiO 2 can be ascribed to higher crystallinity of 0.4Au/TiO 2 achieved in a consequence of the re-calcination of the photocatalysts after the gold deposition.During the re-calcination up to 450 C the TiO 2 amorphous part in 0.4Au/TiO 2 undergoes the longer heat exposure and thus some part of it can crystallize, resulting finally to higher degree of crystallinity.The mixture of larger and smaller TiO 2 crystallites is formed which leads to determined smaller average anatase crystallite size.Moreover, the defects in crystallites deduced from the broadening of diffraction lines can contribute to the difference in anatase crystallite size.The higher degree of crystallinity and the existence of smaller TiO 2 crystallites in 0.4Au/TiO 2 than in parent TiO 2 correspond to higher measured surface area and total pore volume and even the smaller pore radius (2.4 nm for 0.4Au/TiO 2 contrary to 2.9 nm for TiO 2 ).In contrast to that 450 C is not sufficient temperature for the crystallization of TiO 2 -ZrO 2 in molar ratio of 50:50 and thus the re-calcination after deposition of gold on this type of support does not have any noticeable effect on the crystallinity and leads only to the slight decrease in the specific surface area (from 157 m 2 /g to 147 m 2 /g for TiO 2 -ZrO 2 and 0.4Au/TiO 2 -ZrO 2 , respectively).The reason why TiO 2 -ZrO 2 stays amorphous after calcination and even re-calcination at 450 C is that this oxide mixture due to the used type of synthesis crystallizes at higher temperatures (above 700 C), forming the titania-zirconia solid solution (i.e.Ti 0.5 Zr 0.5 O 2 ) with srilankite (Pbcn) crystal structure.Formation of this crystal structure was reported by Troitzsch et al. 535455.Based on the comparable mesopore surface area of both TiO 2 -ZrO 2 based photocatalysts (97 m 2 /g), the decrease of specific surface area of 0.4Au/TiO 2 -ZrO 2 compared to TiO 2 -ZrO 2 can be assigned mainly to the decrease of volume of micropores (from 37 to 32 mm 3 liq /g for TiO 2 -ZrO 2 and 0.4Au/TiO 2 -ZrO 2 , respectively) in a consequence of the presence of large Au crystallites on the surface of amorphous TiO 2 -ZrO 2 , which block these small pores.Besides that is worth to note that the bidisperse pore-size distribution of commercial TiO 2 Evonic P25 photocatalyst nicely corresponds to the existence of titania crystallites of two different sizes (Table 2).The transmission electron microscopy in combination with the electron diffraction (TEM/SEAD) was used as a complementary method to XRD in order to corroborate the crystallinity or the amorphousness of TiO 2 and TiO 2 -ZrO 2 photocatalysts.From Fig. 4a andb the different morphology of photocatalysts can be proved.The TiO 2 photocatalyst is nanocrystalline which is nicely evidenced by measured electron diffraction rings (Fig. 4a-inset).The TiO 2 crystallites can be seen mainly on the periphery of the shown piece of matter (Fig. 4a).Contrary to that the TiO 2 -ZrO 2 photocatalyst is amorphous (no diffraction rings are observed, Fig. 4b-inset).These observations are in accordance with XRD results for both photocatalysts (Fig. 3).At higher magnification (Fig. 4c) the morphology of amorphous TiO 2 -ZrO 2 matter can be also recognized.It can be suuggested that the amorphous matter looks crumpled waved foil-like with some portion of small pores. Table 2 also gives the absorption edge of all investigated photocatalysts.The absorption edge decreases in the ranking TiO 2 Evonic P25 TiO 2 -ZrO 2 Au/TiO 2 -ZrO 2 TiO 2 Au/TiO 2 .Higher absorption edge of TiO 2 -ZrO 2 based photocatalysts in comparison to TiO 2 based photocatalysts is in agreement with our previous study dealing with TiO 2 and ZrO 2 materials with various TiO 2 : ZrO 2 molar ratio in the range 0-1 45. The effect of irradiation time on the product formation of CO 2 photocatalytic reduction was investigated over a period of 0-24 h over all catalysts.Fig. 5 shows the evolution of all reaction products as functions of irradiation time for pure TiO 2 -ZrO 2 catalyst in sodium hydroxide.Methane was determined as the main product of CO 2 photocatalytic reduction in the gas phase.Hydrogen and low amounts of carbon monoxide were also detected.Oxygen was also produced during the reaction, however, its amount was not determined.The reason is that the reactor was not directly connected to GC, thus the oxygen analysis does not have to be correct. More details concerning the reaction mechanism and products formation were discussed in previous studies 40,42.The observed order of yields (mol/g of catalyst) of individual products was: H 2 CH 4 CO. Comparison of CH 4 yields over all examined photocatalysts is plotted as a function of time in Fig. 6.As assumed, the yields of CH 4 increased with illumination time.The yields of methane were negligible during the first 8 h of irradiation in all cases with the exception of parent catalysts TiO 2 and TiO 2 -ZrO 2 .A substantial increase of methane yield was observed after 8 h of irradiation.The highest yield of methane was observed for the TiO 2 -ZrO 2 catalyst. Comparison of H 2 yields over all examined photocatalysts is plotted as a function of time in Fig.Yields of methane ( ( mol/g-cat.) Au/TiO2-ZrO2 Fig. 6.Dependence of methane yields on time over different catalysts (lamp 254 nm). determinableness limit during the first 8 h of irradiation in all cases. A rapid increase of hydrogen amount came after 8 h for TiO 2 -ZrO 2 , after 12 h for Au/TiO 2 -ZrO 2 and after 16 h for TiO 2 and Au/TiO 2 catalysts, the deceleration of hydrogen formation was observed after 20 h.The data from the longest reaction time period were chosen for the photoactivity comparison because in this time the yields of all products were the highest and their GC analysis was the most accurate.Overall amounts of methane and hydrogen yields over each catalyst are plotted in Fig. 8.The activity of photocatalysts was decreasing in the order TiO 2 -ZrO 2 Au/TiO 2 -ZrO 2 TiO 2 Au/TiO 2 TiO 2 Evonic P25. The catalytic activity of TiO 2 and TiO 2 -ZrO 2 photocatalysts can be affected by doping of noble metals, nature of the support, crystallite size, specific surface area, size of micro/mesopores, energy gap etc.In our study, the catalytic activity of parent TiO 2 and TiO 2 -ZrO 2 was higher than the activity of corresponding Au counterparts (Fig. 8).This phenomenon can be explained by several reasons.Firstly, the activity of Au-catalysts generally depends on the concentration of Au species and the size/shape of Au crystallites.The Au optimum loading was established to be approximately 0.2 wt. 21.Above this gold loading the formation of gold particles of larger size has been reported.Thus, the formation of such Au species could result in lower activity of Au-catalysts compared to their parent catalysts 1,56.The excess of Au particles could also mask the TiO 2 surface and reduce the light absorption capability of the catalyst and/or would serve as the recombination centres that decrease the photocatalytic activity of Au-catalysts 21. Secondly, Au doping led to the change of some material property, such as the energy gap (Table 2), the TiO 2 crystallite-size (Table 2) and textural properties (Table 1).Vice versa, the nature of support influenced the size of supported Au particles.The Au presence led to the decrease in energy gap from 3.15 eV to 2.87 eV and from 3.34 to 3.29 eV for TiO 2 and TiO 2 -ZrO 2 , respectively (Table 2).Fig. 9a shows the dependence of the yields of methane and hydrogen on the absorption edge.The data for TiO 2 Evonic P25 were not included in Fig. 9a because of principially different phase composition, comprising both anatase and rutile.From Fig. 9a it can be seen that the products yields increase with increasing absorption edge. The effect of TiO 2 crystallite-size was possible to determine only in the case of TiO 2 , Au/TiO 2 and TiO 2 Evonic P25, i.e. for crystalline materials (Table 2).It can be seen in Fig. 9b that the yields of methane and hydrogen increase with increasing anatase crystallite-size from 9.3 to 12 nm and decrease with increasing anatase crystallite-size from 12 to 25 nm.Previously, we have already published that the CO 2 photocatalytic reduction strongly depends on the anatase crystallite-size.The maximum products yields were observed for anatase crystallite size of 14 nm 42.In this study the crystallite size effect can be also proved.Moreover, from above mentioned results follows the pretty correlation that the absorption edge raises with increasing anatase crystallite-size (Fig. 9b).This feature was also observed by Lin et al. 57.Low activity of TiO 2 Evonic P25 can be attributed to both, too large anatase crystallite-size and the presence of rutile phase.Fig. 10 shows the dependence of the yields of methane and hydrogen on the textural property such as the mesopore radius.With decreasing mesopore-size the yields of methane and hydrogen clearly increase.Thus, the fact that the light can penetrate to small pores, can be dispersed on their surface and as a consequence the photocatalytic reaction can take part on their surface could be confirmed.However, it may be speculated that this phenomenon will strongly depend on the porous structure morphology (i.e. on the length and the tortuosity of small pores).Corresponding to this fact the positive effect of increased mesopore surface area of TiO 2 -ZrO 2 based photocatalysts, compared to TiO 2 based phocatalysts, on the photocatalytic activity can be proved (Table 1).TiO 2 -ZrO 2 and TiO 2 differ not only in the value of absorption edge, but also in the profile of its UV-vis spectra (Fig. 11-inset).Thus, it could be suggested that higher activity of TiO 2 -ZrO 2 could be connected with higher intersection between the UV-vis spectrum of TiO 2 -ZrO 2 and the spectrum profile of used lamp with 254 nm wavelenght maximum (Fig. 1).In order to confirm or disprove this speculation, the photocatalytic activity of TiO 2 -ZrO 2 iluminated by UV-vis lamps with different profiles (asigned as 254 nm and 365 nm) was tested.When the yields over TiO 2 and TiO 2 -ZrO 2 iluminated by lamps with 254 nm and 365 nm wavelength maximum are compared (Fig. 11), it can be seen that the yields were higher under 254 nm UV in both cases.The reason is that the electron hole generation rate increased with increasing energy of irradiation (decreasing wavelength) 58.Comparison of yields over both photocatalysts iluminated by lamp with maximum at 365 nm shows that TiO 2 was more active.This can be explained by the fact that the maximum of the 365 nm lamp is more overlapping with the UV-vis spectrum of TiO 2 which is more intensive at higher wavelengths.It supports the role of absorption edge and the intersection between the UV-vis spectra of the material and the lamp profile.Finally, it can be said that amorphous TiO 2 -ZrO 2 possesses higher photocatalytic performance than nanocrystalline TiO 2 due to the synergism between higher photoactivity of titaniazirconia oxide mixture under the UV lamp with the wavelenght maximum at 254 nm and the enlarged surface area which determines the available active surface for the reaction."
  },
  {
    "title": "Conclusions",
    "content": "Prepared Au supported TiO 2 and TiO 2 -ZrO 2 and their parent counterparts were tested for the CO 2 photocatalytic reduction.Au/TiO 2 -ZrO 2 photocatalyst was investigated for this type of reaction for the first time.For preparation of examined photocatalysts the sol-gel process controlled within reverse micelles of non-ionic surfactant Triton X-114 and the impregnation under vacuum were used. Based on the results of CO 2 photocatalytic reduction, shown through total amount of all products over each catalyst after 24 h, can be charged that mixed oxide TiO 2 -ZrO 2 exhibited higher photocatalytic activity than pure TiO 2 under the 254 nm UV-lamp.The photoactivity of investigated catalysts was decreasing in the ranking TiO 2 -ZrO 2 Au/TiO 2 -ZrO 2 TiO 2 Au/TiO 2 TiO 2 Evonic P25.Higher photocatalytic performance of amorphous TiO 2 -ZrO 2 based catalysts in comparison with nanocrystalline TiO 2 based catalysts can be ascribed to the synergism between enlarged surface area and higher photoactivity of titania-zirconia oxide mixture due to the intersection of its UV-vis spectrum and the profile of used UV lamp (254 nm). The decreased photocatalytic activity of Au/TiO 2 -ZrO 2 and Au/TiO 2 can be explained by the presence of large Au crystallites which block the TiO 2 and TiO 2 -ZrO 2 surface and either reduce the light absorption capability of the catalysts, or serve as the recombination centres. Concerning crystalline materials, the correlation between the absorption edge and the anatase crystallite-size was revealed.Further the strong dependence of CO 2 photocatalytic reduction on the anatase crystallite-size was also observed. The fact that the photocatalytic reduction of CO 2 can take place inside porous structure, even in small pores, can be proved, however, it strongly depends on the morphology of pores. It is worth a mention that despite the fact that gold doping of both parent photocatalysts did not result in enhancement of their photocatalytic activity in CO 2 reduction, the novel findings in relation to photocatalysts physicochemical and optical prosperties were found. Fig. 1.Spectra of lamps used for photocatalytic tests; with maximum at (a) 254 nm and (b) 365 nm. . Synthesized TiO 2 and 0.4Au/TiO 2 are crystalline, however, with the part of amorphous TiO 2 phase.The diffraction lines in both photocatalysts at 2 29.5 , 44.4 and 56.4 correspond to main TiO 2 anatase hkl reflections (1 0 1), (0 0 4) and (2 0 0), respectively. Fig. 2. (a,b,c) Nitrogen adsorption-desorption isotherms of investigated commercial TiO2 Evonic P25, TiO2 and TiO2-ZrO2 based photocatalysts and (d) their pore-size distributions. Fig. 3. XRD patterns of investigated laboratory-prepared photocatalysts. Fig. 4. TEM microphotographs with electron diffraction rings of (a) TiO2 and (b) TiO2-ZrO2.(c) TEM microphotograph of TiO2-ZrO2 at higher magnification, indicating the porous structure morphology. Fig.5.Yields of all products of photocatalytic reduction of CO2 in 0.2 mol l -1 NaOH over TiO2-ZrO2 (lamp 254 nm). Fig. 7. Dependence of hydrogen yields on time over different catalysts (lamp 254 nm). Fig. 8. Methane and hydrogen yields (after 22 h irradiation) over different catalysts (lamp 254 nm). Yields of hydrogen ( mol/g-cat.)Yields of methane ( mol/g-cat.)eV) Yields of product ( mol/g-cat.)TiO 2 anata se cry stal lite-siz e ( Fig. 9. (a) Dependence of the product yields (after 22 h of irradiation) on the absorption edge, (b) dependence of the product yields (after 22 h of irradiation) and the absorption edge on the anatase crystallite-size. Fig. 10.Dependence of (a) methane yields (after 22 h of irradiation) and (b) hydrogen yields (after 22 h of irradiation) on the mesopore radius. Fig. 11.CH4 yields (after 22 h of irradiation) over parent catalysts irradiated by lamps with various wavelengths.Inset -UV-vis spectra of TiO2 and TiO2-ZrO2. Chemical composition and textural properties of investigated photocatalysts.The real Au content in Au-enriched photocatalysts determined by ICP MS was close to expected value, 0.4 and 0.3 wt. for TiO 2 and TiO 2 -ZrO 2 supports, respectively (Table the photocatalytic results.Organic elementary analysis confirmed the absence of such carbon in the photocatalysts.Any elementary carbon was not detected. Structural and optical properties of investigated photocatalysts. The phase composition stated by producer. The average primary crystallite-size stated by producer. This work was supported by the EU project No. CZ.1.05/2.1.00/03.0069, the project 'Opportunity for young researchers' reg.no.CZ.1.07/2.3.00/30.0016supported by Operational Programme Education for Competitiveness and co-financed by the European Social Fund and the state budget of the Czech Republic and the projects SP2013/77 and SP2013/41 supported by the Ministry of Education of Czech Republic.Within commercial co-operation authors thank to Jaroslav Kupcik from CIT, Institute of Inorganic Chemistry of the ASCR, v. v. i. for TEM images and Dr. Jan Rohovec from Institute of Geology of the ASCR, v. v. i. for ICP MS analysis."
  }
]