[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2013.09.036"
  },
  {
    "title": "Article_Title",
    "content": "Enhanced photocatalytic performance of ordered mesoporous Fe-doped CeO2 catalysts for the reduction of CO2 with H2O under simulated solar irradiation"
  },
  {
    "title": "Abstract",
    "content": "Ordered mesoporous Fe-doped CeO 2 catalysts with different Fe doping concentrations have been synthesized through a nanocasting route using ordered mesoporous SBA-15 as the template.The samples, prepared by filling mesopores in silica template with a Fe-Ce complex precursor followed by calcination and silica removal, were characterized by Raman spectroscopy, X-ray diffraction, nitrogen adsorption-desorption, transmission electron microscopy and UV-vis diffuse reflectance spectra techniques, and their catalytic activity was tested for the photocatalytic reduction of CO 2 with H 2 O under simulated solar irradiation.It is observed that the doped Fe species can enter the lattice structure of CeO 2 with a suitable doping concentration, and the obtained Fe-doped CeO 2 catalysts have ordered 2D hexagonal mesostructures with high specific surface area and hierarchical porosity.Meanwhile, the introduction of Fe species can effectively extend the spectral response from UV to visible area for the catalysts which exhibited an enhanced photocatalytic performance in the reduction of CO 2 with H 2 O when compared with non-doped mesoporous CeO 2 catalyst.Further analysis by means of XPS measurement showed that the existence of mixture of Ce 3 /Ce 4 oxidation states and high content of the surface chemisorbed oxygen species also contributed to the high photocatalytic activity."
  },
  {
    "title": "Experimental",
    "content": "Pluronic P123 (M w 5800, EO 20 PO 70 EO 20 ) was purchased from Aldrich.Tetraethoxysilane (TEOS), hydrochloric acid, glycerol, sodium hydroxide, acetone, cerium nitrate hexahydrate (Ce(NO 3 ) 3 6H 2 O), and ferric nitrate nonahydrate (Fe(NO 3 ) 3 9H 2 O) were purchased from Shanghai Chemical Corp.All chemicals were used as received without further purification. Ordered mesoporous silica SBA-15 template with rod-like morphology was synthesized as the reported procedure except enlarging the amount by ten times 34.Ordered mesoporous Fedoped CeO 2 catalysts were synthesized using the hard template method with the help of acetone.In a typical preparation process, a total 12 mmol of Fe(NO 3 ) 3 9H 2 O and Ce(NO 3 ) 3 6H 2 O with different Fe/(Fe Ce) molar percentages (0, 5, 10, 20, and 30) in sequence was dissolved into 15 mL of acetone.After the solution became clear, 2 g of the hard template was added and the mixture was stirred for 2 h in a 100 mL beaker, then the mixture was transferred to a clean flat Petri dish (diameter: 8 cm) and the solvent was evaporated.In order to achieve higher loadings, the above dried hybrid powder was calcined at 200 C for 6 h to decompose the metal precursors, and then the impregnation step was repeated, but the amount of precursors was reduced to 2/3 compared to the first step.The resulting samples were calcined in air at 500 C for 4 h with a heating ramp of 1 K/min to completely decompose the inorganic precursor.Finally, the silica template was removed using a 2 M NaOH aqueous solution at room temperature and this etching process was repeated three times.The obtained Fe-doped CeO 2 catalysts with different initial Fe/(Fe Ce) molar percentages (0, 5, 10, 20, and 30) are denoted as Mes-CeO 2 , Mes-FeCe-5, Mes-FeCe-10, Mes-FeCe-20, and Mes-FeCe-30, respectively. Low-angle X-ray diffraction patterns were collected in A -2A mode using Rigaku D/MAX-2550VB/PC diffractometer (Cu K 1 radiation, 1.5406A), operated at 40 kV and 200 mA (scanning step: 0.02 /s).Wide-angle XRD patterns were collected in the same mode, but operated at 100 mA.Raman spectra were obtained with a Dilor LabRam-1B microscopic Raman Spectrum, using the He-Ne laser with the excitation wavelength of 632.8 nm.Transmission electron microscope (TEM) images were done using a JEOL JEM-2010 electron microscope with an acceleration voltage of 200 kV.Nitrogen sorption isotherms were measured at -196 C on a Micromeritics ASAP 2000 apparatus.The diffuse reflectance spectra of the samples over a range of 200-800 nm were recorded by a Varian Cary 500 Scan UV-vis system.X-ray photoelectron spectroscopy (XPS) measurement was carried out on a RBO upgraded PHI-5000C ESCA system (Pekin Elmer) using monochromated Al K X-rays (h 1486.6eV) as a radiation at 250 W. All binding energies were calibrated by using the contaminant carbon (C 1S 284.6 eV) as a reference. Photocatalytic activity tests for the reduction of CO 2 with H 2 O were carried out in a stainless steel reactor with the volume of 1500 mL (as shown in Fig. 1).Catalyst powder (0.10 g) was dispersed on the stainless steel omentum which was fixed in the center of reactor.The bottom of glass wool support was moisturized with 5.0 g of deionized water to maintain saturated water vapor in the reactor, and a Xe arc lamp (300 W) with sunlike radiation spectrum was put at the top of quartz window with the distance of 8 cm, which can irradiate the whole catalyst powder.In order to control the reaction temperature, the Xe lamp was placed in a cold trap and the whole reactor system is in the air circulation.Prior to illumination, the reactor was first purged with the CO 2 H 2 O mixture at 100 mL/min for 2 h and then reduced to 20 mL/min for another 1 h to establish an adsorption-desorption balance, and the gas phase volume concentrations of CO 2 and H 2 O were controlled at about 95.5 and 4.5, respectively.After that, the reactor was tightly closed and the Xe lamp was then switched on to start the experiment.The reaction temperature and pressure were maintained at 30 C and 110 kPa, respectively.The gas phase products were taken at various time during the irradiation and analyzed by gas chromatography."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Fig. 2a shows Raman spectra of the synthesized Fe-doped CeO 2 catalysts with different Fe doping concentrations, it can be observed that except the sample Mes-FeCe-30 with the highest Fe doping concentration, the other four samples (Mes-CeO 2 , Mes-FeCe-5, Mes-FeCe-10, and Mes-FeCe-20) only present two characteristic peaks at around 461 and 590 cm -1 , which match well with the typical F 2g Raman active mode and LO mode of fluorite-structured ceria materials 35,36, indicating that the doped Fe species can completely incorporate into the CeO 2 lattice if the initial Fe-dopant molar concentration is less than 20.When its value reaches 30 for Mes-FeCe-30, additional four obvious peaks observed at 217, 283, 397 cm -1 should be related to typical A 1g and 2E g Raman modes for hematite while the peak appeared at 1290 cm -1 is attributable to a hematite two-magnon scattering 37, suggesting that some excessive Fe species which are not entered into the CeO 2 lattice will form -Fe 2 O 3 phase.The photos of the Fe-doped CeO 2 catalysts are shown in Fig. 2b, the bright yellow color of fluorite-structured CeO 2 became light brown after Fe doping, and this color deepened with the increase of Fe doping concentration.Therefore, it can be concluded that the optical and surface chemical properties of the mesoporous CeO 2 catalysts will be altered with the Fe doping. Fig. 3 gives the XRD patterns of the Mes-CeO 2 , Mes-FeCe-5, Mes-FeCe-10, Mes-FeCe-20, and Mes-FeCe-30.The low-angle XRD patterns in Fig. 3a show that a moderate diffraction corresponding to (1 0 0) reflection of the 2D hexagonal (p6mm) symmetry can be observed for all samples, indicating the synthesized Fe-doped CeO 2 catalysts have retained some regular mesostructures although the higher angle two diffractions indexed to (1 1 0) and (2 0 0) are too weak to be detected, as confirmed by their TEM images (see below).Fig. 3b shows the wide-angle XRD patterns, it can be seen that the diffraction peaks of all the samples could be assigned to a cubic fluorite structure of CeO 2 with PDF number of 34-0394, and no significant diffraction peaks indicative of Fe 2 O 3 phase were observed in the Fe-doped CeO 2 samples, suggesting that almost all the doped Fe species have entered the lattice structure of CeO 2 , which was in good accordance with the conclusion form aforementioned Raman spectra.Here we can also conclude the amounts of -Fe 2 O 3 detected by Raman spectroscopy in the Mes-FeCe-30 are very little according to its wide-angle XRD pattern.Furthermore, the peaks corresponding to cubic fluorite phase of samples are shifted towards higher angle with increasing Fe doping concentration because of the smaller ionic radius of Fe 3 (0.64 A) than Ce 4 (0.97 A), which further confirmed the incorporation of Fe 3 into the CeO 2 lattice.However, the crystallization degree of Fe-doped CeO 2 decreased slightly with the increase of Fe 3 concentration, since the doped foreign ion alleviated the crystallization process during calcination 38. The nitrogen adsorption/desorption isotherms and pore size distribution curves of above samples are shown in Fig. 4. All isotherm curves show an obvious uptake of N 2 as a result of capillary condensation in a wide relative pressure (P/P 0 ) range of 0.45-0.95,which indicates the existence of multiform pore distributions.The pore size distribution obtained from an analysis of desorption branch of the isotherms is shown in Fig. 4b.It can be seen that all samples possess bimodal pore size distributions centered at about 3.5 and 4.7 nm which are respectively ascribed to the dissolution of the silica walls and the coalescence of unfilled spaces of the template SBA-15 or/and the voids between the small particles 24.The corresponding textural properties are summarized in Table 1.These ordered mesoporous catalysts generally have high BET surface areas (154.2-176.7 m 2 /g) and relative large pore volumes (0.368-0.471 cm 3 /g), and the specific surface area of these catalysts is slightly increasing with the Fe doping. The detailed structure of the Fe-doped CeO 2 catalysts was provided by TEM images.From the low-magnification TEM images (Fig. 5 left), it can be seen that besides the rodlike morphology, ordered 2D hexagonal mesostructure can be clearly observed for all samples, suggesting thus-prepared materials are well reversereplica of the template, which is consistent with low-angle XRD results.The high resolution TEM (HRTEM) images in Fig. 5 right show the detail structure of the mesopores, and the pore walls are well constituted by metal oxide nanocrystals with a diameter of several nanometers.The selected area electron diffraction (SAED) patterns are given in the inset of Fig. 5 right.All shows the diffraction rings, indicating that the metal oxide nanocrystals, as building units of the pore walls, are polycrystalline. To investigate the optical absorption properties of the catalysts, UV-vis diffuse reflectance spectra (DRS) of the mesoporous CeO 2 and Fe-doped CeO 2 in the range of 220-850 nm was examined and the results were shown in Fig. 6.It is apparent that the UV-vis spectra of all the Fe-doped samples have extended a red shift and significant absorption between 400 and 700 nm, both increased with the increase of Fe doping concentration.The red shift of the absorption edge of Fe-doped ceria has been attributed to the charge-transfer transition between the iron ion d-electrons and the CeO 2 conduction or valence band 39.It has been reported that metal doping could form a dopant energy level within the band gap of CeO 2 , the electronic transitions from the valence band to the dopant level or from the dopant level to the conduction band can effectively red shift the band edge absorption threshold 40,41.The band energy gap of above samples could be calculated by using ( h , where is the absorption coefficient, k is the parameter that related to the effective masses associated with the valence and conduction bands, n is 1/2 for a direct transition, h is the absorption energy, and E g is the band gap energy 42.Plotting ( h ) 1/2 versus h based on the spectral response in Fig. 6a give the extrapolated intercept corresponding to the E g value (Fig. 6b).As shown in Table 1, the optical band gap energies of the Mes-FeCe-5, Mes-FeCe-10, Mes-FeCe-20, and Mes-FeCe-30 (2.48, 2.06, 1.54, and 1.50 eV, respectively) display obvious red-shifts with respect to that of Mes-CeO 2 (2.73 eV), which are consistent with the DRS result. The results of this study therefore indicate that the enhanced ability to absorb visible-light of these ordered mesoporous Fe-doped CeO 2 makes them a promising photocatalyst for solar-driven applications. In the present study, the ordered mesoporous Fe-doped CeO 2 catalysts with different Fe doping concentrations were tested in the photocatalytic reduction of CO 2 with H 2 O under simulated solar irradiation.Fig. 7 shows the evolution of main products (CO and CH 4 ) as functions of irradiation time over all catalysts.From the curves, it is found that the yields of both CO and CH 4 are Textural properties and the energy of band gap (Eg) of Mes-CeO2, Mes-FeCe-5, Mes-FeCe-10, Mes-FeCe-20, and Mes-FeCe-30.increased with the irradiation time for all catalysts, and the ordered mesoporous Fe-doped CeO 2 catalysts exhibit much higher activity than pure Mes-CeO 2 , the excellent photocatalytic efficiency of the Fe-doped CeO 2 samples may be attributed to their lower band energy that can absorb more light in the visible region.It can also be found that the photocatalytic activity of Fe-doped CeO 2 catalysts increases with the increase of Fe doping concentration and reaches to the best for the sample Mes-FeCe-20 (initial Fedopant molar concentration of 20) with CO and CH 4 yield of 74.3 and 17.3 mol/g cat., respectively, after 6 h of simulated solar irradiation.The yields of CO and CH 4 are not further increased when the concentration of Fe-dopant increases from 20 to 30.That is to say, the amount of Fe(III) species in the mesoporous CeO 2 plays an important role in the photocatalytic performance, which has an optimum Fe 3 doping concentration. In order to further investigate the relationship between structural characteristic and photocatalytic performance of the ordered mesoporous Fe-doped CeO 2 catalysts, the surface chemical state of Ce, Fe, and O for all catalysts were analyzed by XPS measurement.Fig. 8a gives the Ce 3d spectra of the mesoporous CeO 2 and four Fe-doped CeO 2 catalysts.The labels used in identifying Ce 3d XPS peaks were established by Burroughs et al. 43, where and u indicate the spin-orbit coupling 3d 5/2 and 3d 3/2 , respectively.The peaks denoted as , , and are contributed by CeO 2 , which can be respectively assigned to a mixture of Ce IV (3d 9 4f 2 ) O (2p 4 ), Ce IV (3d 9 4f 1 ) O (2p 5 ) and Ce IV (3d 9 4f 0 ) O (2p 6 ).The same peak assignment is applied to u structures.The /u doublet is ascribed to photoemission from Ce 3 cations 44.Therefore, a mixture of Ce 3 /Ce 4 oxidation states exists on the surface of all samples, which was in good agreement with the studies of Fang et al. 45 and Gao et al. 46.The surface concentrations of Ce 3 for the Mes-CeO 2 and four ordered mesoporous Fe-doped CeO 2 evaluated by deconvolution of the XPS spectra are summarized in Table 2, it is worthy to note that Ce 3 concentrations in Fe-doped CeO 2 catalysts are higher than that of Mes-CeO 2 , suggesting that the introduction of trivalent Fe 3 species into CeO 2 causes the partial reduction of Ce tetravalent cation 47. The Fe 2p XPS spectra of the ordered mesoporous Fe-doped CeO 2 catalysts are presented in Fig. 8b.It can be seen that the Fe 2p XPS peaks of all the samples are weak, especially for the Mes-FeCe-5 48.The surface Fe/(Fe Ce) molar percentages derived from XPS for these ordered mesoporous Fe-doped CeO 2 catalysts are listed in Table 1, it can be seen that the results are in good agreement with the ratios in initial mixture.Fig. 8c shows the O1s XPS spectra and the deconvolution results of all catalysts.The O1s XPS spectra appear broad, which can be deconvoluted into three distinct peaks: the one with lower binding energy is assigned to lattice oxygen in the metal oxides, the next is ascribed to chemisorbed oxygen or/and weakly bonded oxygen species, and the third peak at the highest binding energy is due to surface oxygen by hydroxyl species and/or adsorbed water species on the surface 46,49.Based on the area integral of the three peaks respectively corresponding to lattice oxygen (OL), chemisorbed oxygen (OC) and surface oxygen (OS) of O 1s photoemissions, the ratio of OC to OT (OT OL OC OS) for all samples was calculated as shown in Table 2.It can be noticed that the introduction of Fe species can effectively enhance the chemisorbed oxygen on the surface of the mesoporous CeO 2 catalyst, and the highest ratio of OC/OT was observed for the sample Mes-FeCe-20.Therefore, the enhanced photocatalytic performance for these Fe-doped CeO 2 catalysts can be ascribed to their unique structure with a variety of favorable properties.Firstly, ordered mesoporous architecture with large surface area and 2D open-pore system makes facile the reactant diffusion into the bulk of catalysts and hence provide fast intraparticle molecular transfer.Secondly, the introduction of Fe species into mesoporous CeO 2 can effectively extend the spectral response from UV to visible area owing to the appeared new dopant energy band which leads to the narrowing of band gap of mesoporous CeO 2 .When the visible-light was illuminated on the Fe-doped catalysts, the electrons excited from the valence band to forbidden band leaving holes in the valence band of CeO 2 .The excited electrons in the forbidden band is transferred to Fe 3 resulting the reduction of Fe 3 to Fe 2 , it is more helpful for the separation of photogenerated electron-hole pairs in CeO 2 , resulting in the improvement of photocatalytic activity under solar irradiation (as shown in Fig. 9).Finally, XPS analysis confirms that the Fe 3 addition can greatly enhance the surface chemisorbed oxygen species of the ordered mesoporous Fe-doped CeO 2 catalysts, these oxygen species can easily capture electrons and yield surface oxygen radicals with excellent reduction capability 24,50.Also, the existence of mixture of Ce 3 /Ce 4 oxidation states on the surface of catalysts denote that the partial metal in composites is not fully oxidized, so that Ce 3 can interact with holes and prevent the combination of photogenerated electrons and holes, resulting in a higher quantum efficiency of photocatalytic reaction."
  },
  {
    "title": "Conclusions",
    "content": "In conclusion, we have demonstrated that ordered mesoporous Fe-doped CeO 2 catalysts with different Fe doping concentrations were synthesized via a simple nanocasting route.XRD, Raman spectra, nitrogen sorption, and TEM results reveal that the obtained Fe-doped CeO 2 catalysts have ordered 2D hexagonal mesostructures with high specific surface area and hierarchical porosity.Introduction of Fe species to CeO 2 can effectively extend the spectral response from UV to visible area and enhance the surface Ce 3 concentrations as well as chemisorbed oxygen species of the ordered mesoporous CeO 2 catalysts, which are confirmed by UV-vis and XPS analysis.Because of these characteristics, the ordered mesoporous Fe-doped CeO 2 catalysts exhibited an enhanced photocatalytic performance in the reduction of CO 2 with H 2 O under simulated solar irradiation. Fig. 1.Schematic of experimental setup for the photocatalytic reduction of CO2 with H2O. Fig. 2. Raman spectra (a) and photos (b) of the synthesized Fe-doped CeO2 catalysts with different Fe doping concentrations.(For interpretation of the references to color in this figure legend, the reader is referred to the web version of this article.) Fig. 3. Low-angle (a) and wide-angle (b) XRD patterns of Mes-CeO2, Mes-FeCe-5, Mes-FeCe-10, Mes-FeCe-20, and Mes-FeCe-30. Fig. 4. N2 adsorption/desorption isotherms (a) and corresponding pore size distribution curves (b) of Mes-CeO2, Mes-FeCe-5, Mes-FeCe-10, Mes-FeCe-20, and Mes-FeCe-30. Fig. 5. TEM (left) and HRTEM (right) images of ((a) and (b)) Mes-CeO2, ((c) and (d)) Mes-FeCe-5, ((e) and (f)) Mes-FeCe-10, ((g) and (h)) Mes-FeCe-20, ((i) and (j)) Mes-FeCe-30.The inset in (right) is the SAED pattern. Fig. 6.(a) UV-vis diffuse reflectance spectra (DRS) and (b) the optical absorption edges of the Mes-CeO2, Mes-FeCe-5, Mes-FeCe-10, Mes-FeCe-20, and Mes-FeCe-30. Fig. 7. Yields of CH4 (a) and CO (b) as functions of irradiation time over all catalysts. Fig. 8. (a) Ce 3d, (b) Fe 2p, and (c) O 1s XPS spectra of the Mes-CeO2, Mes-FeCe-5, Mes-FeCe-10, Mes-FeCe-20, and Mes-FeCe-30. Fig. 9. Plausible mechanism for the photoreduction of CO2 with H2O over the ordered mesoporous Fe-doped CeO2. Summary of the XPS data for Mes-CeO2, Mes-FeCe-5, Mes-FeCe-10, Mes-FeCe-20, and Mes-FeCe-30.FeCe-10 with low Fe doping concentrations, the binding energies of Fe 2p 3/2 and Fe 2p 1/2 for the samples locate about 711.3 and 724.8 eV, respectively.The peak position and energy difference between Fe 2p 3/2 and Fe 2p 1/2 (13.5 eV) are typical of Fe(III) species in Fe 2 O 3 This work was supported by National Natural Science Foundation of China (Grant No. 21103024, 61171008), China Postdoctoral Science Foundation Funded Project (Grant No. 20100480534), China Postdoctoral Science Foundation Special Funded Project (Grant No. 201104236), Capacity-Building of Local University Project by Science and Technology Commission of Shanghai Municipality (Grant No. 12160502400), and Special Research Fund in Shanghai Colleges and Universities to Select and Train Outstanding Young Teachers (Grant No. slg12020)."
  }
]