[
  {
    "title": "Doi",
    "content": "10.1016/j.cej.2021.130863"
  },
  {
    "title": "Article_Title",
    "content": "Insight into mechanism of divalent metal cations with different d-bands classification in layered double hydroxides for light-driven CO2 reduction"
  },
  {
    "title": "Abstract",
    "content": "By varying divalent-metal cations (M Mg 2 , Ni 2 , Cu 2 , Zn 2 ) with different d-bands classification, MAl-LDHs were prepared and inspected for solar-driven CO 2 conversion.The CO and CH 4 yields over these LDHs followed an order of: NiAl-LDHs CuAl-LDHs ZnAl-LDHs MgAl-LDHs.Coupled with multiple characterizations, the activity distinction was revealed from three crucial perspectives: (i) light harvesting, (ii) charge separation and transfer, (iii) surface reactions.The results affirmed that when d orbital was partially occupied with active electrons, both activation of CO 2 and excitation of electrons were much easier to achieve.In-situ DRIFTS manifested that NiAl-LDHs and CuAl-LDHs exhibited more active reaction with CO 2 , which may be related to the upward shifts of the d-band center determined by Valence-band XPS.Particularly, these LDHs exhibited various catalytic stabilities, which was explained by Pearsons hard and soft acid-base (HSAB) principle for the first time"
  },
  {
    "title": "Experimental",
    "content": "MAl-LDHs (M Mg, Ni, Cu and Zn) were fabricated via a coprecipitation method coupled with a hydrothermal aging step.Materials and detailed procedures were provided in Supporting Information. The structure of as-prepared samples was identified by Fouriertransform infrared (FTIR, Nicolet IZ10) and X-ray diffraction (XRD, Bruker D2 PHASER).The morphology of these samples was characterized using scanning electron microscopy (SEM, Hitachi S4700) and high- resolution transmission electron microscope (HRTEM, Tecnai G2 F30).The UV-vis diffuse reflectance spectra (DRS, Shimadzu UV-2600) were measured using BaSO 4 as a reference.X-ray photoelectron spectroscopy (XPS) were calculated on a Thermo ESCALAB 250 spectrometer.Elemental analysis of samples was analyzed by a Perkin Elmer inductive coupled plasma emission spectrometer (ICP-OES).The texture structure of catalysts was determined by N 2 adsorption-desorption apparatus (Micromeritics ASAP 2460).The surface areas of the samples were calculated by Brunauer-Emmett-Teller (BET) methods.In-situ DRIFT experiments were performed on a Nicolet IZ10 spectrometer equipped with a Harrick Scientific DRIFT cell and a NICOLET iZ10 detector.Prior to test, photocatalysts were pretreated at 100 C under N 2 flow (40 mL/ min) for 1 h and then cooled to 20 C to get the background spectrum.After N 2 flow stopping, CO 2 (40 mL/min) with bubbled H 2 O was introduced into the chamber at 20 C and reacted at dark for 30 min.Then, the light source was turned on to monitor the produced intermediates for another 30 min. Electrochemistry impedance spectroscopy (EIS), photocurrent measurements (i-t curve) and Mott-Schottky (MS) were performed on a CHI 760E electrochemical workstation with a three-electrode system.Pt plate and Ag/AgCl electrode were served as the counter electrode and the reference electrode, respectively.A 0.5 mol L -1 Na 2 SO 4 solution was used as the electrolyte.The working electrode was prepared as follows: 5 mg catalyst was dissolved in solution containing 30 L Nafion and 1 mL ethyl alcohol.After ultrasonically scattering for 1 h, the slurry was dip-coated onto a FTO glass (1 cm 1 cm) and dried at 80 C for 5 h under a vacuum atmosphere.All the experiments were conducted under a 300 W Xe irradiation. The photoreduction test was conducted in an autoclave with a quartz window at the top (Anhui Kemi Machinery Technology Co., Ltd., China).Prior to the test, photocatalyst (20 mg) and H 2 O (20 mL) were added into the autoclave, and high-purity CO 2 gas was evacuated and refilled several times to get rid of the air.Then, the CO 2 was refilled into the autoclave to reach a pressure of 0.6 MPa and the temperature was controlled at 80 C. A 300 W Xe light with full spectrum irradiation was used as the light source.After irradiation for 10 h, the produced gas was detected and quantified by a gas chromatography (GC 9860) equipped with FID detectors.The computational process of CO and CH 4 production rates were shown in the Supporting Information."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Fig. 1 (A) showed the FT-IR patterns of the serial MAl-LDHs (M Mg, Ni, Cu, Zn).For all samples, a strong band from 3700 cm -1 to 3200 cm -1 and a weak peak at 1485-1647 cm -1 were observed, which could be assigned to the stretching and bending vibrations of -OH, respectively, derived from hydroxide layer and interlayer water 30,31.The bands below 1200 cm -1 could be ascribed to the translational modes of metal oxygen (M-O and Al-O) and metaloxygenmetal (M -O -Al) bands 32.The bands occurred at 1380 cm -1 were ascribed to the antisymmetric stretching mode of the nitrate anions intercalated in the lamellar structure 33.It should be noted that the FT-IR spectra of MgAl-LDHs and ZnAl-LDHs were consisted of characteristic bands at 1426 cm -1 , which could be attributed to the C-O antisymmetric stretching vibration of carbonate 34.Thus, NiAl-LDHs and CuAl-LDHs were intercalated with NO 3 -, while MgAl-LDHs and ZnAl-LDHs used both CO 3 2-and NO 3 -as the interlayer anions. The crystalline structure of the as-prepared samples was investigated by XRD, and the results were given in Fig. 1 (B).The diffraction patterns for all samples were well fitted to the typical reflections of layered double hydroxides (JCPDS No. 15-0087).The Bragg reflections at 2 of approximately 11 S1) were assigned to the (0 0 3), (0 0 6), (0 1 2), (0 1 5), (0 1 8), (1 1 0) and (1 1 3) planes, respectively, which could be indexed in a hexagonal lattice with R-3 m rhombohedral symmetry 35.Based on the diffractograms, the structural parameters of the four LDHs were calculated and given in Table 1.The d 003 value and the unit cell parameters (\"a\" and \"c\") of MgAl-LDHs were well consistent with the previous report 36.Substitution of Mg 2 by Ni 2 , Cu 2 or Zn 2 ions lead to slight variation in these parameters.Many reports have asserted that a larger ionic radius of metal cation usually led to a larger d 003 value 35,37.However, MgAl-LDHs and ZnAl-LDHs exhibited smaller d 003 values than NiAl-LDHs, even though the ionic radius of Mg 2 and Zn 2 were larger than that of Ni 2 .Considering the results achieved in FTIR, NiAl-LDHs was intercalated by NO 3 -, while MgAl-LDHs and ZnAl-LDHs were intercalated by both NO 3 -and CO 3 2-in the interlayer.To balance the positive charge of the laminate, more NO 3 -in the interlayer was needed for NiAl-LDHs, which could lead to the increase of d 003 and c parameter.It should be noted that CuAl-LDHs showed significant larger d 003 and unit cell parameters than the other LDHs, which could be explained by Jahn-Teller effect of Cu 2 with d 9 configuration.According to the Scherrer calculation, the crystallite sizes of these LDHs were calculated.It could be observed that D (0 0 3) was similar with D (1 1 0) , meaning the similar crystallite size in the a and c direction in an unit cell.The crystallite sizes in c direction of the different MAl-LDHs followed the order of CuAl-LDHs (11.43 nm) NiAl-LDHs (18.88 nm) ZnAl-LDHs (23.30 nm) MgAl-LDHs (40.12 nm).A smaller crystallite size might be in favour of the exposure of active sites and better for heterogeneous catalytic reaction.XPS technique were performed to determine the valence state of the metal cations and the M/Al atom ratios in the different MAl-LDHs.From XPS technique, the M/Al atom ratios in the different MAl-LDHs photocatalysts were all close to 3, in good accord with ICP results (Table S2). The corresponding XPS spectra of metal cation with peak fitting deconvolutions was shown in Fig. 1(C).The peaks at the binding energies of 1304.0 eV, 856.0 eV, 934.6 eV and 1021.2 eV can correspond to the Mg 2 , Ni 2 , Cu 2 and Zn 2 respectively.As shown in Fig. 1 (D), all LDHs illustrated a broad peak, which can be resolved into two individual peaks.The peaks at binding energies of 531.5-532.4eV can be correspond to the M-OH (M Mg, Ni, Cu, Zn and Al).The binding energies of O 1 s exhibited obvious shift with varying of M. As we all know, a higher binding energy indicates a decreased electron cloud density and a weakened shielding effect.Thus, the increased electron numbers in d orbitals might explain the gradually negative shift of O 1 s binding energies from MgAl-LDHs to ZnAl-LDHs. The morphology of these catalysts was determined by SEM, TEM and HRTEM.As demonstrated in Fig. 2 (A) and Fig. 2 (D), the MgAl-LDHs and ZnAl-LDHs presented the typical hexagonal sheets with an average lateral size of 2 m and 0.3 m, respectively.From Fig. 2 (B 1 ) and Fig. 2 (B 2 ), NiAl-LDHs demonstrated the flower-like structure composing of thin sheets.However, there were no distinct lamellar structure for CuAl-LDHs as presented in Fig. 2 (C 1 ) and Fig. 2(C 2 ).This Note: d 003 /2sin; a 2d 110 ; c 3d 003 ; D (0 0 3) crystallite size in the c direction; D (1 1 0) crystallite size in the a direction. may also be attributed to the Jahn-Teller effect of Cu 2 , resulting in a distorted octahedral configuration.TEM was also performed to prove the exact structure and morphology of LDHs.As shown in Fig. 2 (A 3 )- The photocatalytic performance of CO 2 conversion towards CO and CH 4 was investigated over the different MAl-LDHs under full spectrum ). NiAl-LDHs was considered as a potential photocatalyst in light-driven CO 2 reduction without any sacrificial agent and noble metals after comparing with the other works in Table S3.The time-dependent photoconversion of CO 2 to CO and CH 4 were showed in Fig. 3(B) and Fig. S2, respectively.The yields of CO were always beyond that of CH 4 during the 10 h of irradiation for all the samples.This can be explained by that CO 2 reduced to CO through a two-electron process, which was much easier than that reduced to CH 4 or other product with multielectron transfer process. In order to verify the carbon source of the main products, a control experiment was carried out under N 2 atmosphere.As shown in Fig. S3, all samples exhibited small amount of CO evolution.This should be due to the presence of CO 3 2-in interlamination or the adsorbed CO 2 on LDHs. Apparently, the CO evolution rates over MgAl-LDHs and ZnAl-LDHs were much higher than that of CuAl-LDHs and NiAl-LDHs.This should be due to more CO 3 2-presented in interlamination of MgAl-LDHs and ZnAl-LDHs, which were in line with the results of FTIR and XRD.Besides, other control experiments were also carried out under the conditions of no H 2 O, no light, and no catalysts respectively.The results showed that there was very little CO or CH 4 produced, which confirmed that the H 2 O (Fig. S4), light and catalysts were the essential factors for photoreaction CO 2 on LDHs.Five-run recycling experiments were carried out and the results were presented in Fig. 3 (C-F).MgAl-LDHs, NiAl-LDHs and ZnAl-LDHs had no significant decrease in the yields of CO and CH 4 , confirming their favourable photostability.However, CO evolution rates of CuAl-LDHs were decreased dramatically from 3.1 mol g -1 h -1 to 1.5 mol g -1 h -1 .In order to get insight into the difference of catalytic stability, the structure and morphology of these catalysts before and after photoreduction tests were inspected in Fig. S5 and Fig. S6.The crystal structure of MgAl-LDHs and NiAl-LDHs remained basically unchanged after photochemical irradiation, manifesting their structural stability and durability for practical applications.The typical LDHs structure of ZnAl-LDHs was also remained, signifying that the structure of ZnAl-LDHs was relatively stable.However, the structure of the CuAl-LDHs was heavily destroyed, which should be the reason of the decrease in the photocatalytic activity. Pearsons hard and soft acid-base (HSAB) principle can be used to explain the unstable activity of CuAl-LDHs.According to HSAB, hard and soft acids prefer to bind to hard and soft bases respectively while borderline acids can bind to all kinds of bases 38.In CuAl-LDHs, Cu 2 was hexa-coordinated with -OH, in which -OH was hard base and Cu 2 was borderline acid, thus the CuAl-LDHs can be existed relatively stalely.However, when it employed in photocatalytic reaction, half reactions that photo-induced hole oxidize H 2 O may occurred, accompanying by the possible reaction of Cu 2 transforming into Cu (Reaction 3 in in-situ DRIFTS analysis).XPS of CuAl-LDHs after photocatalytic reaction was conducted and the results were exhibited in Fig. S7, which confirmed the existence of Cu after reaction.Cu was soft acid and can't coordinate with -OH firmly, thereby it seemed reasonable that laminate collapses gradually. The effect of catalyst dosage and initial pressure on photocatalytic performance were inspected and the corresponding results were showed in Fig. S8 and Fig. S9, respectively.The photocatalytic tests were also performed under 40 C, 60 C and 90 C to investigate the effect of reaction temperature on light-driven CO 2 reduction.NiAl-LDHs was used as the model catalyst and the other reaction conditions were consistent with that in Fig. 3(A).As can be observed in Fig. S10, the reaction temperature had a significant effect on the photocatalytic activity, and the higher the temperature, the more the CO and CH 4 produced. As analysed in FTIR and XRD, the interlayer anions were different over the various MAl-LDHs.Then, some experiments were set up to investigate the influence of interlayer anions on CO 2 photoreduction.Firstly, NiAl-LDHs was calcinated at 350 C for 4 h.In this process, the interlamellar water molecules and the charge compensating anions progressively loosed, leading to the collapse of the layered structure and the formation of mixed metal oxides (LDO).Then, this layer was reconstructed in the sodium carbonate aqueous solution due to their \"memory effect\" and achieved the NiAl-LDHs intercalated with CO ).The XRD and FTIR confirmed the successful preparation of NiAl-LDO and NiAl-LDHs-CO 3 2-as presented in Fig. S11 and Fig. S12.The photocatalytic activity of NiAl-LDHs-CO 3 2-was tested and compared with the original NiAl-LDHs intercalated with NO 3 -, and the results were exhibited in Fig. S13.It can be seen that interlayer anions had a slight influence on the photocatalytic performance.NiAl-LDHs-CO 3 2-had a slightly higher activity than that intercalated with NO 3 -. UV-vis DRS was performed to determine the photoabsorption behaviours of the prepared photocatalysts.As demonstrated in Fig. 4(A), MgAl-LDHs and ZnAl-LDHs showed poorer light harvesting capacity and had lower absorption intensity only in the ultraviolet region below 300 nm, which could be attributed to d 0 or d 10 configuration of Al 3 , Mg 2 and Zn 2 .NiAl-LDHs and CuAl-LDHs showed apparent improved absorptions in both UV and visible light region compared with MgAl-LDHs and ZnAl-LDHs.The absorption bands around 200 and 255 nm for NiAl-LDHs and CuAl-LDHs, respectively could be corresponded to ligand-tometal charge transfer (LMCT) from the 2p orbital of O to the 3d orbital of M, while the bands from 300 to 800 nm were assigned to dd transitions, which were characteristics of M 2 ions in an octahedral geometry (M Ni, Cu) 39,40.Besides absorption among region below 300 nm, NiAl-LDHs showed apparent absorptions in the region of 330-500 nm and 550-800 nm.The absorption peaks at 380 and 740 nm can be ascribed to spin-allowed transitions 3 A 2g (F) 3 T 1g (P) and 3 A 2g (F) 3 T 1g (F), respectively.Additionally, the bands positioned at 420 and 650 nm were corresponded to spin-forbidden transitions 3 A 2g (F) 1 E g (D) and 3 A 2g (F) 1 T 2g (D), respectively, deriving from d 8 configuration of Ni 2 ions in octahedral coordination 41.In the case of CuAl-LDHs, the typical absorption in above 680 nm can be observed, which could be attributed to the presence of Cu 2 possessing d 9 configuration in octahedral coordination.A stronger absorption means a better light harvesting capacity.Based on the mentioned above, it can be concluded that d-band configuration had significant influence on light harvesting capacity, which should be crucial to photocatalytic performance of CO 2 reduction. The capacity of photocatalysts to drive CO 2 conversion largely depended on three crucial factors: (i) light harvesting; (ii) charge separation and transfer; (iii) surface reactions.29 Light harvesting had been confirmed by UV-vis DRS.The separation and transfer properties of carriers in the LDHs were studied by photoelectrochemical measurements. Transient photocurrent responses for MgAl-LDHs, NiAl-LDHs, CuAl-LDHs and ZnAl-LDHs were shown Fig. 4(B).It's worth noting that a spike emerged in the photocurrent curve of NiAl-LDHs once the light was turned on, which can be attributed to the vast recombination of photogenerated e -/h pairs 42.Then, the photocurrent intensity decreased and remained almost constant, which was resulted from the equilibration between the separation and recombination of e -/h pairs.The photocurrent intensity after equilibration was an important indicator for evaluating charge migration efficiency.Apparently, NiAl-LDHs exhibited the highest photocurrent intensity of almost 2.5 Acm -2 even though an overt decrease was occurred at the initial time of irradiation.Correspondingly, NiAl-LDHs presented the best photocatalytic activity.CuAl-LDHs afforded a relatively higher photocurrent intensity of 1.5 Acm -2 relative to MgAl-LDHs (0.9 Acm -2 ) and ZnAl-LDHs (1.1 Acm -2 ), which was also well agreement with the activity results.The electrochemical impedance spectra (EIS) measurement was also carried out to further demonstrate the charge transfer efficiency.The Nyquist impedance spectra of these LDHs were shown in Fig. 4(C).NiAl-LDHs and CuAl-LDHs showed smaller arc radius of EIS Nyquist curves than MgAl-LDHs and ZnAl-LDHs samples, hinting lower charge transfer resistance across the surface of NiAl-LDHs and CuAl-LDHs.These results could further affirm more effective separation of photo-induced e -/h pairs for NiAl-LDHs and CuAl-LDHs than MgAl-LDHs and ZnAl-LDHs, conceding with the results achieved in transient photocurrent analysis. The different separation and transfer properties of MAl-LDHs were influenced by multi-factors, among which band structure of the semiconductor was considered as one of the most important ones.Currently, there were three methods widely adopted to determine band structure as follows: the valence band (VB) potential determined by XPS, flat-band potential (relevant to conduction band potentials) determined by Mott-Schottky measurement and band gap energy (Eg) determined by UV-DRS.The conduction band potential was more important in the band structure, which represented the reducing capacity of samples.Thus, two methods were employed to confirm the conduction band potentials of these LDHs.Firstly, flat band potentials (vs.Ag/AgCl, PH 7) of MAl-LDHs were obtained by Mott-Schottky measurement as shown in Fig. 5 (A), therewith deriving into the conduction band potentials (E CB1 , calculation process was shown in Supporting Information) presented in Table 2.Then, band gap energies (Eg) and the valence band potentials (E VB ) were determined by UV-DRS and XPS, shown in Fig. 5(B) and Fig. 5(C), respectively.Another conduction band potential (E CB2 ) was obtained according to the following formula: The average values of E NHE and E CB' were as the final E CB listed in Table 2.The absolute CB levels of all the MAl-LDHs were located above the redox potentials of the CO/CO 2 and CH 4 /CO 2 couples shown in Fig. 4(D).Thus, from a thermodynamic viewpoint, MgAl-LDHs, NiAl-LDHs, CuAl-LDHs and ZnAl-LDHs can be photoexcited and then convert CO 2 into CO and CH 4 .The band gap energies were also various for these LDHs and follow the order of NiAl-LDHs (2.67 eV) CuAl-LDHs (3.47 eV) ZnAl-LDHs (3.68 eV) MgAl-LDHs (3.97 eV).Electrons in semiconductors with relatively narrow band gaps were relatively easy to get excited, which maybe explain the results achieved in photoelectrochemical measurements. The light harvesting and charge separation properties have been studied by UV-vis DRS and photoelectrochemical measurements, respectively.To further insight into the adsorption and activation abilities of CO 2 onto LDHs, in-situ DRIFTS measurements were conducted on the serial MAl-LDHs to explore the adsorbed states of CO 2 .Prior to the measurement, the LDHs were pretreated in N 2 for 1 h to remove the impurities and the spectrum of which was as the background.Then, CO 2 and H 2 O were introduced into IR cell in dark for 30 min, followed by light irradiation for another 30 min.Fig. 6(A-H) exhibited the in-situ FTIR spectra for coadsorption of CO 2 and H 2 O vapor on the MAl-LDHs and the Fig. 7(A-B) presented the corresponding 3D colormap surface with projections.It can be observed that exposure of LDHs in CO 2 /H 2 O vapor resulted in the formation of CO 2 and H 2 O adsorbed species. Carbonate species including bidentate carbonate (b-CO 3 2-, 1580-1592 cm -1 and 1337-1340 cm -1 ) and monodentate carbonate (m-CO 3 2-, 1503-1545 cm -1 and 1371 cm -1 ) were detected, indicating the chemisorption of CO 2 on these LDHs 12,434445.From Scheme 1, CO 2 bonding to the O atom of LDHs can lead to the production of m-CO 3 2species 46.If CO 2 was simultaneously bonded to the O and M, b-CO 3 2will be generated (Reactions 1).The bands ranging from 1618 to 1655 cm -1 , 1442-1457 cm -1 and 1221-1222 cm -1 were resulted from bicarbonate (HCO 3 -) 47.As reported, HCO 3 -was produced through the reaction between CO 2 with hydroxyls, which was obtained from the dissociative adsorption of H 2 O on catalysts (Reactions 4) 484950.As shown in Fig. 7 (E-H), distinguishable bands can be observed at 3596 cm -1 , 3626 cm -1 , 3702 cm -1 and 3725 cm -1 , which confirmed the existent of hydroxyl groups from H 2 O dissociation (Reactions 3) 3.Since basic surfaces was beneficial for the dissociative adsorption of H 2 O, HCO 3 -was readily produced on LDHs 39.Bands around 1660 cm -1 and 1250 cm -1 were assigned to the asymmetric vibration of bicarbonate (CO 2 -) 51.The possible configuration of CO (Reaction 5 and 7) All above sorbent species belonged to chemisorption of CO 2 , which was the direct proof for an activated process of CO 2 molecules onto LDHs.Compared with the normal molecule, CO 2 in the chemisorption state had a bent O -C -O bond angle and a decreased LUMO, which will decrease the bond energy and favor the charge transfer from the photoexcited semiconductors to the surface-adsorbed CO 2 molecules 57.Consequently, the presence of these intermediates played an important role for proving the interaction between CO 2 and catalysts. Among these chemisorbed species, the CO which may be account for the low production rates of CH 4 , with concentrations below the detection limit of FTIR instrumentation.52,59 Combined with the above analysis and inspired by many reports Compared with NiAl-LDHs, CuAl-LDHs and ZnAl-LDHs, MgAl-LDHs showed much lower adsorption intensity than the others.This phenomenon can be explained as below.The CO 2 molecule accepted electrons from the surface of LDHs and translated to the chemisorbed intermediates.The accepted electrons mainly occupy the lowest unoccupied molecular orbital (LUMO) of CO 2 molecules with anti-bonding characteristics 62.Thus, the more transferred electrons, the weaker O -C -O stretches and the stronger adsorption bond.The increase of electrons in d orbitals of divalent metal cations could enhance the electron density of the LDHs surfaces, thereby weakening O -C -O stretching vibration but strengthening interaction between CO 2 and catalyst surfaces 62.Thus, it seemed reasonable that MgAl-LDHs exhibited the weakest interaction with CO 2 because of its lower electron density. The NiAl-LDHs, CuAl-LDHs and ZnAl-LDHs illustrated the similar CO 2 adsorbed species (c-CO 3 -and CO 2 -).However, the intensity of these CO 2 adsorbed species developed on the different LDHs presented a significant distinction as presented in Fig. 8 (A-B).It was worth noting that NiAl-LDHs had more CO 2 -species on the surface (1000-1400 cm -1 ), which suggested a better interaction between NiAl-LDH and CO 2 .Correspondingly, it was reasonable that NiAl-LDHs presented the best photocatalytic performance. As mentioned above, the M 2 in MAl-LDHs had significant influence on light harvesting, charge separation and surface reactions, thereby resulting in the various photocatalytic performance.Mg 2 with empty d orbital possessed a lower electron cloud density and poorer adsorption and activation capacity for CO 2 .The electron in Zn 2 with full d orbital was so stable and relatively hard to get excited.When d orbital was partially occupied with active electrons, both activation of CO 2 and excitation of electrons were much easier to achieve. In order to insight how the individual M 2 exerted such strong control over CO 2 photocatalytic conversion, we applied d-band center theory.Based on the d-band center theory, the adsorbate on surface of catalysts could lead to the formation of fully filled bonding states and anti-bonding states, the filling degree of which was relevant to the position of d-band center, determining the bond strength between reactants and catalysts 12,27,61.The valence band spectra (VBS) of the various MAl-LDHs were measured and showed in Fig. 8(A), which was used to justify the d-band electron structure of these samples.The approximate d-band center ( d ) can be further gained derived from the VBS, which was exhibited in Fig. 8(A) and indicated by the colored lines.Table S5 listed the various d-band center and CO yields over these LDHs.It was interesting that there was a good linear relationship between the activity and the d-band center position as shown in Fig. 8(B).NiAl-LDHs and CuAl-LDHs showed upward shifts of the d-band center compared with ZnAl-LDHs and MgAl-LDHs, which could induce anti-bonding states above the Fermi level, conducting to a higher energy and a less filling, thereby resulted in a stronger interaction with CO 2 molecules.Hence, the M 2 (Mg, Ni, Cu and Zn) modulate the electronic structure in MAl-LDHs and the d-band center position of the M 2 can serve as a feasible descriptor of photocatalytic CO 2 reduction.Further investigation of the more complicated d-band center theory employing photocatalytic CO 2 reduction will be in the scope of our future study."
  },
  {
    "title": "Conclusions",
    "content": "A series of MAl-LDHs with various the divalent metal cations (M Mg 2 , Ni 2 , Cu 2 , Zn 2 ) were prepared and applied in solar-driven reduction of CO 2 .The results affirmed that the divalent metal cations types have great influence on CO yield as follows: NiAl-LDHs (3.5 mol g -1 h -1 ) CuAl-LDHs (3.1 mol g -1 h -1 ) ZnAl-LDHs (2.1 mol g -1 h -1 ) MgAl-LDHs (1.6 mol g -1 h -1 ).NiAl-LDHs and CuAl-LDHs have stronger light harvesting capacity, better charge separation properties and more active surface reactivity with CO 2 relative to MgAl-LDHs and ZnAl-LDHs.According to the in-situ FTIR and valence band XPS measurements, the surface reaction mechanism in LDHs has been proposed.This work clarifies the role of divalent metal cations in LDHs photocatalysts for CO 2 reduction, paving new ways for the development of improved LDHs photocatalyst with high efficiency. Fig. 1.Structural characterizations of MAl-LDHs.(A) FTIR spectra; (B) XRD patterns; XPS spectra of (C) M 1 s or M 2p; (D) O 1 s in the MAl-LDHs and (E) Scheme of LDHs. D 3 ), MgAl-LDHs, NiAl-LDHs and ZnAl-LDHs exhibited thin lamellar structure whilst CuAl-LDHs presented no apparent lamellar structure in accordance with the results in SEM images.All HRTEM showed clear lattice fringes of approximately 0.26 nm, corresponding to (0 1 2) crystal plane of LDHs.The structure characteristic of these samples further confirmed the successful preparation of LDHs, and confirmed that the microstructures of MAl-LDHs were greatly affected by the type of M. Fig. 2. SEM, TEM and HRTEM images of the MAl-LDHs, (A 1 )-(A 4 ) MgAl-LDHs; (B 1 )-(B 4 ) NiAl-LDHs; (C 1 )-(C 4 ) CuAl-LDHs; (D 1 )-(D 4 ) ZnAl-LDHs. Fig. 3. Photocatalytic performance of LDHs.(A) Photocatalytic activity; (B) Time-yield plots; (C) Recycle experiments of MgAl-LDHs; (D) Recycle experiments of NiAl-LDHs; (E) Recycle experiments of CuAl-LDHs; (F) Recycle experiments of ZnAl-LDHs.(Reaction conditions: 80 C, 0.6 MPa, 300 W Xe irradiating for 10 h). Fig. 4. (A) UV-vis DRS spectra; (B) Photocurrent density profiles; (C) EIS Nyquist plots and (D) Measured CB and VB potentials of MAl-LDHs. Fig. 5. (A) Mott-Schottky plots; (B) The pots of (hv) 2 versus energy (hv) and (C) XPS valence band spectra of MAl-LDHs. Fig. 6.In situ FTIR spectra on catalysts (A, E) MgAl-LDHs, (B, F) NiAl-LDHs, (C, G) CuAl-LDHs, and (D, H) ZnAl-LDHs. 60,61, a tentative mechanism for CO and CH 4 formation from CO 2 photoreduction on LDHs was proposed on the basis of in-situ DRIFTS observations, as expressed in reactions (1)-(7) and Fig. 7(C).CO 2 M-O CO 3 2- M-O 2 (1) Fig.7.The 3D colormap surface with projections derived from in situ FTIR spectra for coadsorption of CO 2 and H 2 O vapor on catalysts (A) NiAl-LDHs and (B) CuAl-LDHs; (C) The proposed mechanism of CO 2 conversion on LDHs. Fig. 8. (A) D-band center of the LDHs; (B) Relationships between activity versus the d-band center position for LDHs. , 22 , 34 , 39 , 46 , 60 and 61 (the detail 2 values were showed in Table Physical properties of the as-synthesized LDHs. 2 -was considered as a key intermediate in the photoreduction of CO 2 .Based on theoretical analysis, when one of the C-O bonds in CO 2 -was cleaved to generate C-M bonds, CO was then produced 58.(Reaction 8) If CO 2 -was bonded to H, HCOOH was formed 58.Obviously, our work followed the first mechanism and translated to CO on LDHs surface.CH 4 was another product in this work, requiring multistep reduction.Unfortunately, no obvious stretching vibration of C -H was observed during the 60 min, Band structures for the MAl-LDHs derived from XPS to VB analysis, Mott-Schottky plots and UV-vis DRS measurements. Acknowledgement This work was financially supported by National Natural Science Foundation of China (21908108), Jiangsu Province Scientific and Technological Project (BK20180449), Fundamental Research Funds for the Central Universities (30920041108), Top-notch Academic Programs Project of Jiangsu Higher Education Institutions, Open Fund for Large Instruments and Equipments of Nanjing University of Science and Technology, A Project by the Priority Academic Program Development of Jiangsu Higher Education Institutions. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://doi. org/10.1016/j.cej.2021.130863."
  }
]