[
  {
    "title": "Doi",
    "content": "10.1007/s10562-020-03182-3"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic Reduction of CO2 to CO over 3D Bi2MoO6 Microspheres: Simple Synthesis, High Efficiency and Selectivity, Reaction Mechanism"
  },
  {
    "title": "Abstract",
    "content": "It has been a promising approach for directly utilizing solar energy to convert CO 2 into clean renewable chemical fuels over photocatalysts with excellent photoreactivity, CO 2 adsorption capacity and reasonable redox potentials.In this work, as-synthesized 3D Bi 2 MoO 6 microspheres with cross-stacking nanosheets via a simple hydrothermal method have been investigated for photocatalytic CO 2 reduction, and characterized by XRD, UV-Vis DRS, SEM, HRTEM and BET.It was found that as-prepared samples exhibited high Bi 2 MoO 6 purity, large specific surface area, excellent light response and CO 2 adsorption capacity, achieving superior photocatalytic CO 2 reduction activity and selectivity of CO yield (41.5 mol g -1 h -1 ).Moreover, the photocatalytic reaction mechanism for CO 2 reduction to CO over 3D Bi 2 MoO 6 microspheres was investigated and proposed.Finally, COOH was verified to be a key intermediate for photocatalytic CO 2 reduction to CO by the analysis of in-situ FTIR.Our findings should provide excellent foundation and guidance for boosting photocatalytic CO 2 conversion to CO with enhanced effective and selective ability."
  },
  {
    "title": "Experimental",
    "content": "In a typical procedure, 1.6866 g Bi(NO 3 ) 3 5H 2 O and 0.4210 g Na 2 MoO 4 2H 2 O were initially dissolved in 5 mL of ethylene glycol (EG) to get transparent solutions A and B, respectively.The two solutions were mixed together, then 20 mL EG was slowly added into the above solution to get solution C, stirring approximately 30 min.Whereafter, the solution C was transferred into a 50 mL Teflonlined autoclave, sealed and heated at 160 C for 24 h.The system was cooled down to room temperature naturally.Eventually, the precursors precipitate prepared by filtering, washing and desiccation annealed at 400 C for 3 h. X-ray diffraction (XRD) patterns were obtained on DX-2700 diffractometer (Japan) with Cu K radiation ( 1.5418A) at the scanning range from 10 to 80 and a scanning rate of 8 min -1 .The structural morphologies of as-prepared samples were performed by using a Nanosem 430 field emission scanning electron microscopy (FE-SEM) with an acceleration voltage of 10 kV.Transmission electron microscopy (TEM) and high-resolution TEM images were carried out on a JEOL JEM-2100 (RH) field emission.SEM and TEM coupled with an Energy dispersive X-ray spectroscopy (EDS) used for elemental analysis, respectively.UV-Vis diffused reflectance spectra (DRS) were recorded on the dry-pressed film samples using UV-Vis spectrophotometer (UV-3600, Shimadzu, Japan).The surface chemical compositions and states were obtained by X-ray photoelectron spectroscopy (Thermo Fisher ESCALAB 250 xi, England) with Al K radiation (hv 1486.6eV) as the excitation source.The BET specific surface area (S BET ) was measured by a JW-BK122W type physical adsorption instrument. Photocatalytic CO 2 reduction test was carried out in CEL-SPH2N-D9 gas-closed circulation system (Beijing China Education Au-Light Co., Ltd.) under 300 W Xe-lamp irradiation.In the first place, 0.0345 g sample was uniformly dispersed in water (50 mL) with magnetic stirring in a quartz glass reactor up to the formation of suspensions.Furthermore, the reaction temperature was controlled strictly 3 C by recirculating cooling water system.In the second place, the whole photoreactor system was vacuumtreated before the introduction of CO 2 gas with high purity.Ultimately, during the reaction process under Xe-lamp irradiation time of 6 h, the quantification of products was identified by on-line gas chromatography (GC-7920, Beijing China Education Au-Light Co., Ltd.) equipped with a flame ionization detector (FID) and thermal conductivity detector (TCD) via comparing and analyzing a calibration curve based on external standard method."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Figure 1 gives the XRD pattern of as-prepared sample.There exist four main peaks at 28.2, 32.6, 46.7 and 55.5, corresponding to (131), (002), ( 202) and (331)/(133), respectively, which are exactly consistent with pure orthorhombic structure of Bi 2 MoO 6 (JCPDS card No. 76-2388, lattice constants a 5.50 A, b 16.24A and c 5.49 A) 20.Besides, there is no other impurity peaks observed in this pattern, indicating the formation of high Bi 2 MoO 6 purity via a simple hydrothermal treatment method.The calculated average crystallite size of Bi 2 MoO 6 sample is approximately 38.4 nm using (131) plane on the basis of the Scherer equation: D Scherrer K/cos, where D Scherreris is the average crystallite size, is the X-ray wavelength ( 0.1541 nm), K is the Scherrer constant of the particle (K 0.89), is the full widths at half maximum, and is the diffraction angle. To analyze the elemental compositions and chemical states of Bi 2 MoO 6 sample, the XPS spectra for Bi 2 MoO 6 sample, Bi, Mo and O elements are provided, as displayed in Fig. 2a-d.It can be seen from Fig. 2a that there are Bi, Mo, O peaks in the survey XPS spectrum.The high-resolution Bi 4f XPS spectrum (Fig. 1b) exhibits that the two main peaks of Bi 4f 7/2 and Bi 4f 5/2 are located at 159. 3 of Mo 6 (Fig. 2c) 22.Moreover, the high-resolution signal O 1s XPS spectrum can be deconvoluted into three peaks at 529.8, 530.8 and 531.8 eV (Fig. 2d), which should be attributed to the presence of Bi-O, Mo-O and surface -OH groups, respectively 23. Tailoring the structural morphology of samples used to improve the CO 2 conversion efficiency to certain extent 24.Figure 3a, b present the SEM images of sample.It can be found that as-synthesized Bi 2 MoO 6 samples are composed of a large number of microspheres with the average diameter range from 1 to 2 m, and no other morphologies can be formed, illustrating as-prepared sample with a high spherical structure, matching well up with the observed structural morphology (Fig. 3c), which are mainly assembled by relatively regular nanosheets (Fig. 3b) with a size of 30-40 nm approximately closed to the XRD analysis data.More importantly, these nanosheets accumulate and intercross to generate microspheres with high specific surface area to enhance the utilization of light harvesting by generating multiple refractions and reflections on the surface 25.Figure 3d depicts the crystalline interplanar spacing of 0.317 nm, indexing to the 131 facets 17 that qualitatively coincides with the result of XRD image.The EDS images (Fig. 3f) of Bi 2 MoO 6 indicate the existence of Bi, Mo, O elements, in good accordance with the data of XPS spectra for Bi 2 MoO 6 (Fig. 2a), and the homologous atomic ratios are 30.8,16.95, 18.55, respectively, further verifying the perfect generation of pure Bi 2 MoO 6 . Figure 4 shows the UV-Vis diffuse reflectance spectra of Bi 2 MoO 6 , and the calculated optical absorption band edge is 478 nm, corresponding to 2.67 eV by absolute electronegativity follow the empirical formulas: ( hv) 1n hv -E g (n 1/2 for an direct transition) 26, implying the excellent optical response capacity.Furthermore, based on the Mulliken electronegativity theory by the following empirical equations 27: and more negative than E 0 CO 2 CO (CO 2 2e - 2H CO 2H 2 O, E 0 redox -0.53Vvs NHE) 29, respectively.Therefore, the photogenerated electrons for as-prepared Bi 2 MoO 6 can react effectively with the adsorbed CO 2 to generate CO in aqueous solution. The N 2 adsorption-desorption isotherm curves and BJH pore distribution curve of 3D Bi 2 MoO 6 microspheres are provided in Fig. 5a.It can be inferred that the isotherm is approximates type II isotherm in the IUPAC classification, which is manifested in the case of macroporous adsorption.In addition, Hysteresis loop (type H3) indicates that the material is in the aggregation of flaky particles or in form of slit pore 30.The pore structure distribution of Bi 2 MoO 6 sample is mainly located in the range of 2-30 nm.What's more, the BET specific surface area of sample is 32.995 m 2 g -1 , obviously higher than the previously reported data of 2.2 m 2 g -1 31 and 22.545 m 2 g -1 32, further verifying that there is large specific surface area consisting of nanosheets at random described in SEM for as-prepared Bi 2 MoO 6 microsphere structure.Photocatalytic CO 2 reduction test is carried out in pure water phase under simulated sunlight irradiation.34.5 mg Bi 2 MoO 6 is dispersed evenly in 50 mL deionized water under magnetic stirring, and subsequently enough amounts of high-purity CO 2 gas (99.999) are filled into the above system.Photocatalytic experiments indicate that CO is one unique reaction product with high selectivity, and the production amount of CO (Fig. 5b) exhibits a rising trend as the time elapsed, up to 249 mol g -1 after 6 h irradiation.At the same time, the presence of H 2 (as a competitive reaction with CO 2 reduction) or CH 4 is not detected by gas chromatography (GC), which remarkably indicates that Bi 2 MoO 6 sample possesses an excellent selectivity of reduced products.Besides, there is no determinable C-related products in the absence of photocatalysts or illumination, meaning that CO generation is indispensably driven by the photocatalyst and light energy.Furthermore, there is no CO detected when the reaction system in the presence of catalyst or light irradiation is filled with N 2 instead of CO 2 or without the introduction of CO 2 , which clearly confirms that CO is produced by CO 2 conversion in the reaction system rather than the adsorbate or impurity.After four cycles for photocatalytic CO 2 reduction test (Fig. 5c), the photocatalytic activity of Bi 2 MoO 6 still maintains 98, verifying that as-synthesized Bi 2 MoO 6 should exhibit preeminent and stable photocatalytic performance. In-situ Fourier transform infrared spectroscopy (FT-IR) is one of the most effective methods to study the reaction intermediates and action mechanism.The in-situ FT-IR measurement of sample has been carried out, and the relative results are provided in Fig. 5d.The characteristic peaks, at 1506 and 1412 cm -1 , 1337 and 1604 cm -1 , 1636 cm -1 , gradually appear, corresponding to the vibrations of m-CO 3 2-, b-CO 3 2-, b-HCO 3 -, respectively, which should be the main species for CO 2 adsorption on the surface of Bi 2 MoO 6 in the presence of water.Moreover, the characteristic peaks of CO 2 -absorption peaks appear at 1689 and 1242 cm -1 .The bands at 1369 and 1550 cm -1 are ascribed to -OCO symmetrical vibration frequencies and CO stretching vibration frequencies, demonstrating the presence of COOH 9,33,34, and especially, the COOH peak intensity gradually increases with the extension of illumination time, suggesting that the formation and increase of CO should be mainly attributed to the occurrence of COOH intermediate in the photocatalytic CO 2 reduction process. Generally, CO 2 photoreduction efficiency depends primarily on the photoreactivity, CO 2 adsorption capacity and redox potentials of photocatalyst.Based on the above experimental and characterization results, a feasible photocatalytic CO 2 reduction mechanism for as-prepared Bi 2 MoO 6 is proposed in Fig. 6.Firstly, CO 2 is adsorbed onto the Bi -and b-CO 3 2-can be readily transformed to CO 2 under simulated sunlight irradiation due to the lower energy barrier of CO 2 35.Subsequently, owing to good affinity between CO 2 and H , the COOH intermediate will be generated when the CO 2 accepts electrons and binding hydrogen ions.Finally, COOH intermediate is further protonated to achieve the gradual formation of CO molecules, and the presence of COOH intermediate will significantly reduce the activation energy of CO 2 and increase the CO yield 9."
  },
  {
    "title": "Conclusions",
    "content": "As-synthesized 3D Bi 2 MoO 6 microspheres by simple hydrothermal method possess large surface area and suitable band gap matching well with the requirements of redox, and display efficient photocatalytic CO 2 reduction to CO with the conversion rate of 41.5 molg -1 h -1 under simulated sunlight irradiation in water phase without any accessory ingredient.The photocatalytic efficiency of Bi 2 MoO 6 remains be about 98 after four cycles, indicating that Bi 2 MoO 6 has excellent stability and anti-photocorrosion.Moreover, insitu FTIR measurement analysis results reveal that the presence of COOH intermediate can significantly reduce the activation energy of CO 2 and increase the CO yield, and the significative mechanism of photocatalytic CO 2 reduction to CO is proposed.Our findings demonstrate that 3D Bi 2 MoO 6 microspheres should considered as one low-cost photocatalyst and new candidate for achieving outstanding-efficiency and -selectivity for solar-driven CO 2 to hydrocarbon fuels. Fig. 2 Survey XPS spectrum (a) and high-resolution spectra of Bi 2 MoO 6 : Bi 4f (b), Mo 3d (c) and O 1s (d) Fig. 3 SEM images of Bi 2 MoO 6 (a, b) and EDS (f) images and the corresponding spectrum (g); TEM (c), HRTEM (d), EDX images of Bi 2 MoO 6 and the corresponding elemental mapping (e) of Mo (h), Bi (i), O (j) Fig. 4 UV-Vis diffuse reflectance spectra of Bi 2 MoO 6 b-HCO 3 -species in the pressure of H 2 O (H 2 O H ads O ads ), and then, b-HCO 3 21164.6 eV, respectively, belonging to Bi 3 in Bi 2 MoO 621.The higher binding energies of Mo 3d 5/2 and Mo 3d 3/2 are 232.1 eV and 235.3 eV, corresponding to the oxidation states This work is supported by the National Natural Science Foundation of China (Grant Nos.21978196, 21676178, 21706179) and Shanxi Province Science Foundation for Excellent Fig. 6 Photocatalytic mechanism for CO 2 reduction over Bi 2 MoO 6 under simulated sunlight irradiation Youths (Grant No. 201801D211008), Scientific and Technological Innovation Project of Higher Education Institutions in Shanxi (Grant No. 201802051). Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations."
  }
]