[
  {
    "title": "Doi",
    "content": "10.1016/j.apcata.2016.04.003"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic and electrocatalytic reduction of CO2 to methanol by the homogeneous pyridine-based systems"
  },
  {
    "title": "Abstract",
    "content": "The visible light driven pyridine catalytic reduction of CO 2 was performed in aid of ruthenium phenanthroline complex photosensitizer.The light absorbance and utilization of the catalytic system was identified using UV-vis absorption and emission spectroscopic techniques.Under the dark conditions, electrochemical properties of the catalytic system were evaluated by compared the redox properties under N 2 and CO 2 pressure, respectively.Then, the photocatalytic CO 2 reduction with this catalytic system was studied under the visible light ( 420 nm) irradiation.The gaseous and liquid products of the CO 2 reduction were analyzed using gas chromatography and liquid chromatography.Methanol was the main product and there were no other products determined in the present system.The photocatalytic system showed a high product selectivity and efficient productivity with 60 mol/L of methanol as solo product under the optimized conditions."
  },
  {
    "title": "Experimental",
    "content": "Ru(phen) 3 (PF 6 ) 2 was prepared with slight modifications to a literature method 43.RuCl 3 (0.42 g, 2 mmol) and 1,10phenanthroline (1.09 g, 6 mmol) were added in an ethanol solution and heated to reflux with stirring under an atmosphere of N 2 for 8 h.Then the solution was cooled down to room temperature.Subsequently NH 4 PF 6 (3.26 g, 20 mmol) saturated solution was added to the solution to form a red precipitate.The solid was filtered and dried under vacuum overnight. 1 H NMR spectra was recorded at 25 C at Bruker AV500 500 MHz Nuclear Magnetic Resonance spectrometer.The chemical shift was adjusted to zero with tetramethylsilane as a reference substance. UV-vis absorption spectra was acquired on UV-2600 spectrometer (Shimadzu, Japan) using screw cap quartz cuvettes of 1 cm pathlength.All absorption spectra were recorded at room temperature and all samples were prepared in acetonitrile: water 1:1.Concentration of the solution was 0.02 mmol/L and scan wavelength range was 200-800 nm. The photoluminescence (PL) spectra was measured by the F-7000 (Hitachi, Japan) using screw cap quartz cuvettes of 1 cm pathlength.All absorption spectra were recorded at room temperature and all samples were prepared in acetonitrile: water 1:1.Concentration of the solution was 0.02 mmol/L and scan wavelength range was 500-800 nm. Electrochemical measurements of the complex are performed on a CHI660D electrochemical workstation (Chenhua, China) using a standard three-electrode cell with a platinum wire as working electrode, a standard Ag/AgCl in saturated KCl as reference electrode, and a platinum wire as counter electrode.Tetrabutylammonium hexafluorophosphate (0.1 mol/L) and potassium chloride (0.5 mol/L) were used as electrolyte reagents.CV measurement of pyridine (5.24 mmol/L) with different scanning speeds, pH and different electrolyte concentration were performed.Prior to measurement, the solutions were sparged with N 2 and CO 2 gas for 40 min, respectively. Ru(phen) 3 (PF 6 ) 2 (0.020 mmol/L), pyridine (50 mmol/L), KCl (0.1 mmol/L) and ascorbic acid (0.2 mmol/L) were mixed in 25 mL of acetonitrile solution and added in a 50 mL glass tube reactor.The pH of solution was adjusted to 4, 5, and 6 respectively with hydrochloric acid and sodium hydroxide.The samples were charged with a stir bar and the system was sealed with a rubber septum which was tightened with a copper wire.The sample solution and reactor headspace was saturated with CO 2 .The samples were irradiated by a 500 W Xe arc lamp.The wavelength of light was controlled by a long pass filter ( 420 nm) that was immersed in water.Light was focused onto the stirred sample and irradiated for 1-6 h.After irradiation, aliquots were analyzed by CP-3800 gas chromatography (Varian, USA) coupled with a flame ionization detector (GC-FID).The reaction apparatus is shown in Fig. 1."
  },
  {
    "title": "Results_and_Discussion",
    "content": "NMR spectrum of Ru(phen) 3 (PF 6 ) 2 complex is shown in Fig. 2. 1 H NMR (500 MHz, CDC1 3 ): 8.76 (dd, 6H), 8.22 (dd, 6H), 7.92 (dd, 6H) which were in accord with refer data 44. Absorption spectra and emission spectra of ruthenium complex photosensitizer are shown in Fig. 3. As shown in the UV-vis absorption spectrum of ruthenium complex (Fig. 3(a)), the dominant feature in the visible region was a broad metal to ligand charge transfer (MLCT) absorption band centered at 451 nm that presume the complex had a certain of absorption and response in the visible region.In the UV region, the intense bands were assigned to the ligand-based - transition ( 1 IL) of phenanthroline ligand 45.As shown in Fig. 3(b), the excited ruthenium complex photosensitizer gave a strong emission centered at 600 nm.CV and DPV of ruthenium complex are shown in Fig. 4. As shown in Fig. 4(a), the first oxidation potential was occurred at 1.20 V corresponding to the peak of DPV at 1.20 V, which represented the oxidation potential of Ru II (phen) 2 losing one electron shown in Eq. ( 1).Subsequent, reduction potential occurred at -1.38 V, -1.64 V, -1.85 V corresponding to the peaks of DPV at -1.38 V, -1.64 V, -1.85 V, which can be speculated by the reduction process of Eqs. ( 2)-( 4) 43. It indicated that Ru II (phen -) 3 -was of vital importance for photoinduced electron transfer, which certified why the complex was good at photocatalysis.In order to investigate the effect of the sacrificial agent on the photocatalytic reduction of CO 2 , ascorbic acid was chosen respectively as a quencher to test fluorescence quenching experiment of ruthenium complex.The effect of different concentration of ascorbic acid in the quenching experiment is shown in Fig. 5. As shown in Fig. 5(a), the emission intensity of the ruthenium complex photosensitizer decreased with the increase of the concentration of ascorbic acid as the quenching agent.Fig. 5(b) shows that relationship between emission peak intensity/initial intensity and concentration of ascorbic acid was linear with R 2 , 0.9914 which proved that ascorbic acid was the appropriate sacrificial agent in experiment of photocatalytic reduction of CO 2 .The results indicated that ascorbic acid could efficiently quench the excited ruthenium complex photosensitizer to form reduced species which could transfer electrons to the CO 2 reduction reaction. CV of pyridine is performed under N 2 and CO 2 pressure in Fig. 6.As shown in Fig. 6, the reduction peak under CO 2 pressure was significantly greater than that under N 2 , which proved that it occurred redox reaction between pyridine catalyst and CO 2 .In these processes, pyridine was protonated to form pyridinium PyH .PyH was reduced to form PyH after accept an electron under the reduction potential.Then PyH could react with CO 2 to form PyCOOH in the homogeneous phase which becomes further reduced into CH 3 OH through a series of subsequent reduction steps 42. To investigate the rate determined step in these processes, CV spectra were repeated with different scanning speeds which are shown in Fig. 7. As shown in Fig. 7(a), the reduction current became bigger with the increase of the scan rate.In order to study whether the electrode was affected by adsorption and diffusion controlled, peak current was plotted with scan speed and the square root of the scanning rate, respectively.Fig. 7 same as the square root of the scanning rate following R 2 , 0.9962.All the result indicated that the electrode was affected by adsorption and diffusion controlled 43,46474849.This means that the reaction rate is not controlled by the number of active sites on the electrode surface, but rather the spread of CO 2 in the solution.At the reduction potential of pyridine, the reaction of CO 2 and pyridine was diffusion-limited controlled.Upon addition of CO 2 , the diffusion limited current increased remarkably, while the potential shifted catholically, and the reversibility in the return oxidation wave was lost due to the chemical reaction between CO 2 and the electrocatalyst 43. To study the effect of pH on the reduction current, the results are shown in Fig. 8. at approximately -0.6 V that increases with decreasing pH (hence increasing PyH ).The large observable reductive feature at approximately -0.6 V was assigned to PyH reduction to pyridine.The catalytic potentials decreased when the solution pH changed from 2 to 4 and kept stable during the pH of 4-5.3.After that, the catalytic potentials increased with the increase of solution pH.Therefore, the solution pH was set as 5 to keep the catalytic potential low 47. In the process of photocatalysis, the electrolyte concentration plays an important role.Fig. 9 shows the effect of the concentration of pyridine on the reduction current.The difference of reduction peaks current between CO 2 and N 2 mapping with the concentration of pyridine are shown in Fig. 9(b). As shown in Fig. 9(a), the intensity of reduction peak increased significantly with the increase of pyridine during the low pyridine concentration from 2.24 mmol/L to 5.24 mmol/L.In order to make it clear that effect of the concentration of pyridine, the difference of reduction peak currents under CO 2 and N 2 pressure mapping with the concentration of pyridine was studied and shown in Fig. 9(b).With the increase of pyridine concentration, the catalytic current difference increased till to a platform.It can be speculated that the redox reaction CO 2 may be limited by the high concentration of pyridine 50.The photogenerated electron from the photosensitizer by the visible light irradiation should be transferred to a reaction center before the recombination of the photoinduced electron and holes.When the active sites on the surface of the catalyst matched the photoinduced electrons, the CO 2 reduction will perform smoothly.If the catalyst concentration was much high than photoinduced electrons could be generated by the photosensitizer, it would have a negative impact on the rate of electron transfer and catalytic effect.When pyridine concentration was higher than 6.35 mmol/L, there was another redox reaction which was not the conversion of CO 2 to methanol that need to be further studied.The experiment results showed that the best appropriate concentration of pyridine was 2-6 mmol/L which could be prepared with different conditions. The pH value of the solution was the most important factor for the catalytic current.Hence, in the photocatlytic reaction of the CO 2 conversion, the solution pH was chosen as an effect parameter for the product yield.The yield of methanol with different pH and time are shown in Fig. 10. As shown in Fig. 10, with the increase of reaction time, the yield of methanol increased.And the system in pH 5 showed highest catalytic efficiency than that in pH 4 and 6.When the pH was 5 and the reaction time was 6 h, the yield of methanol reached 60 mol/L.However, the yield of methanol was negligible when pH was 6, because H was the vital to the process of photocatalycal reaction and a certain amount of H can enhance the activity of catalyst 34.The product methanol could not be determined when the ascorbic acid or pyridine were absent in the system. Pyridine and Pyridinium (pyrH ) were the species of interest in this work due to its proposed role in the CO 2 catalytic reduction.It could be inferred that at pH 5, pyrH participated in one of the several irreversible reactions: pyridinyl radical formation, dihydropyridine formation, and reduction of the weak acid protons to dihydrogen. Although the CO 2 photoreduction mechanism is complex, it is well known that pyridine (Py) catalyzed the CO 2 reduction through the PyCOOH formation.There were consequential steps in this reaction.Protonated pyridine (PyH ) could be reduced to pyridyl radical (PyH ) after getting an electron from one electron reduced photosensitizer.Then, the PyH species reacted with CO 2 to generate a PyCOOH through a proton transfer process.Finally, methanol was formed from PyCOOH through a series of proton-coupled electron transfer 42."
  },
  {
    "title": "Conclusions",
    "content": "The photocatalytic reduction of CO 2 to methanol was performed in the present pyridine catalysis system under visible light irradiation.Ru(phen) 3 (PF 6 ) 2 was prepared as a photosensitizer and showed excellent visible light utilization activity and electron transfer properties.And in electrochemical experiments, pyridine showed clear catalytic reaction under CO 2 pressure compared that under N 2 pressure.The solution pH had important effect on the catalytic properties.By controlling variable methods for pyridine electrochemical tests, the optimize conditions of photocatalytic reduction of CO 2 was achieved: exposure to the light of 420 nm in the home-made light reaction; pH 5; 0.020 mmol/L of Ru(phen) 3 (PF 6 ) 2 as the chromophore; 5.24 mmol/L pyridine as catalyst degradation CO 2 ; 0.1 mol/L KCl and 0.2 mol/L ascorbic acid as a sacrificial reductant; the reaction time was 6 h, the concentration of the reduced product methanol at this time was 60 mol/L, which proved that the selected ruthenium complexes had a valid photocatalytic reduction effect, and was qualified as the effective photocatalytic material. Fig. 1.Scheme of the photocatalytic reaction device. Fig. 2. NMR spectrum of Ru(phen)3(PF6)2 complexes. Fig. 4. CV (a) and DPV (b) of complexes with tetrabutylammonium hexafluorophosphate (0.1 mol/L) and Ru(phen)3(PF6)2 (5 mmol/L) in acetonitrile solution; scan rate, 100 mV/s; All potentials were in volts vs. the Fc /Fc couple. Fig. 5. Different concentrations of ascorbic acid quenching (a) and linear dependence of emission intensity versus different concentration of ascorbic acid in degassed acetonitrile: water (1:1) excited at 551 nm (top) and 600 nm (bottom) at room temperature; 0.02 mmol/L Ru complex (b). Fig. 7. CV of different scan rate (a) and linear dependence of peak current versus the scan rate (b) linear dependence of peak current versus the square root of the scan rate from 5 to 1000 mV/s (c). Fig. 8. CV under CO2 with different pH (a) and linear of pH with peak current and potential (b). Fig. 9. CV and current difference with pyridine concentration diagram (a) and relation between peak currents deviation through N2 and CO2 and concentration of pyridine (b). Fig. 10.Methanol concentration versus pH and reaction time. (b)and (c) show that relationship between peak current and scan rate was linear with R 2 , 0.9316 which were This work was supported by the Beijing Higher Education Young Elite Teacher Project (No. YETP0773), the National Natural Science Foundation of China (No.51278053 and 21373032), and grant-inaid from Kochi University of Technology."
  }
]