[
  {
    "title": "Doi",
    "content": "10.1007/s10562-017-2175-5"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic Reduction of CO2 Using Titanium-Substituted and Fluorine-Doped Titanium-Substituted Hydroxyapatite as Photocatalysts"
  },
  {
    "title": "Abstract",
    "content": "P25-TiO 2 , TiHAP provided enhanced photocatalytic reduction of CO 2 into carbon monoxide (CO) and methane (CH 4 ), due to its higher conduction band position.Fluorine doping further facilitated the reaction activity of TiFHAP, with 5.6 wt fluorine providing the optimal results.The relative humidity of the reaction system had a substantial effect on the CO 2 reduction process.Higher relative humidity ensured greater participation of protons, which was confirmed by the increasing formation rates of CO and CH 4 .Furthermore, a high CO formation rate always accompanied high CH 4 formation selectivity, indicating that deep CO 2 reduction can proceed rapidly over TiFHAP samples.This study supports the idea that TiHAP may be a novel and efficient photocatalyst for the reduction of CO 2 ."
  },
  {
    "title": "Experimental",
    "content": "TiHAP powder was synthesized using a hydrothermal method 26.First, 2.12 g Ca(NO 3 ) 2 4H 2 O (9 mmol) and 0.40 g Ti(SO 4 ) 2 (1 mmol) were added to 100 mL deionized H 2 O.Then, 420 L concentrated phosphoric acid (6 mmol) was added under continuous stirring, and strong ammonia solution was added dropwise until the pH of the whole solution was 9.0.The solution was held in a hydrothermal synthesis reactor at 100 C for 6 h before cooling to room temperature.The obtained precipitate was washed with deionized H 2 O several times, dried at 70 C for 24 h, and ground into a powder. TiFHAP powder was prepared in a similar manner by adding specified amounts of NH 4 F (0.037, 0.074, 0.111, 0.148, and 0.185 g).The weight percentages of F -were 1.9, 3.7, 5.6, 7.5, and 9.4 in the resulting five TiFHAP powders, respectively (wt(F) 1.9, 3.7, 5.6, 7.5, or 9.4).P25-TiO 2 powder (Degussa Co., Germany) was used for comparison. The surface morphology of the powders was characterized via transmission electron microscopy (TEM; JEM-2100, JEOL, Japan) with a stripe solution ratio of 2.04, point resolution ratio of 0.24 nm, and acceleration voltage of 200 kV.The crystal structure of the powders was identified via X-ray diffraction (XRD; DMAX-2400, Rigaku, Japan) using Cu-K radiation ( 0.154 nm, 40 kV, 300 mA), a scan range of 20-80, and a scan speed of 4(2)/min.The UV-Vis diffuse reflection spectra of the samples were determined via UV-Vis spectrophotometry (UV3600PLUS, Shimadzu, Japan) using wavelengths ranging from 200 to 800 nm.The photoluminescence (PL) spectra were obtained via fluorescence spectrometry (FL; F7000, Hitachi) using an excitation wavelength of 320 nm and emission wavelength range of 450-550 nm.The surface elements of the powders were analyzed via X-ray photoelectron spectroscopy (XPS; AXIS Ultra, Kratos Analytical, UK). The photocatalytic reduction of CO 2 by TiHAP, TiFHAP, and P25-TiO 2 powders was carried out in 300 mL quartz tube reactors with a gas inlet and outlet on both ends (Beijing Daxing Kete Quartz Glass Factory, China) at room temperature.For each test, 300 mg catalyst was dispersed uniformly at the bottom of the reactor and lamps were placed 7.5 cm above the powder.Before illumination, the reactor was first purged with dry N 2 (99.999,Beijing Huake Gas Company, China) at 500 mL/min for 1 h to eliminate air, and then 10 vol CO 2 (90 vol of N 2 , Beijing Huake Gas Company) was continuously passed through the tube at a rate of 50 mL/min for 1 h.A water bubbler was used to carry H 2 O vapor into the reactor, and the RH was controlled using a mass flow controller.Two 8 W UV lamps (Hangyun Electronic Technology Co., Ltd, China) of wavelength 254 nm and light intensity 3.0 mW/cm 2 were used as the UV source. To verify that the catalyst and UV light were indispensable to CO 2 reduction, three control experiments were carried out: an experiment with TiHAP powder, CO 2 , and H 2 O but without any irradiation; an experiment with CO 2 , H 2 O, and UV light but without a catalyst; and an experiment with TiHAP powder, CO 2 , and H 2 O but under irradiation from a 500 W Xe lamp with a 450 nm cutoff filter (Beijing Changtuo Technology Company, China). Every hour during the 6 h irradiation, 1 mL gaseous sample was injected into a gas chromatography system equipped with a flame ionization detector (SP-3420; Beijing-Ruili Analytical Instrument Co. Ltd., China) to measure the concentration of the gaseous products, CO and CH 4 .The column, injector, auxiliary, and detector temperatures were 60, 60, 360, and 150 C, respectively.The attenuation was 12. CO and CH 4 concentrations were quantified using CO (9.94 ppm) and CH 4 (4.97 ppm) standard gases (Beijing Huake Gas Company, China).The formation of CO and CH 4 fit a zero-order kinetics model.The rate of photocatalytic reaction was quantitatively expressed with a zero-order reaction rate constant of CO formation."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Figure 1 shows TEM images of TiHAP and TiFHAP (wt(F) 5.6) powders.Both samples exhibited an aggregated structure made of irregularly sized rod-like particles. Figure 2 shows the XRD spectra of the TiHAP and TiF-HAP powders.The characteristic diffraction peaks of TiHAP were in accordance with those of HAP (JCPDS 9-432), with feature peaks of 25.88, 31.82,39.84, 46.72, 49.44, 53.22, and 64.18, suggesting a hexagonal apatite structure 25.There was no characteristic peak of TiO 2 in TiHAP, indicating that Ti 4 was completely incorporated into the crystal lattice of HAP.Moreover, TiFHAP with different F contents showed structures similar to TiHAP, indicating that F doping did not destroy the basic structure of TiHAP.The crystal sizes of TiHAP and TiFHAP (wt(F) 1.9, 3.7, 5.6, 7.5, and 9.4), calculated using the Scherrer equation with the (002) plane, were 31.0,23.7, 23.7, 21.2, 22.4, and 23.7 nm, respectively.The size of the crystals decreased after F doping, with an F content of 5.6 wt yielding the smallest crystals.The OH group in TiHAP was substituted by F, with stronger electronegativity and a smaller size, resulting in an overall tighter crystal structure 27. Figure 3 shows the UV-Vis diffuse reflection spectra of TiHAP, TiFHAP (wt(F) 5.6), and P25-TiO 2 powders after Kubelka-Munk treatment.The TiHAP and TiFHAP powders absorbed UV light mainly below 320 nm, while P25-TiO 2 powder absorbed UV light below 340 nm, indicating that TiHAP and TiFHAP have a broader energy band gap (E g ) than P25-TiO 2 .The E g values of TiFHAP (wt(F) 5.6), TiHAP, and P25-TiO 2 , obtained by the intersection between the linear fit and the photon energy axis, were 3.57, 3.55, and 3.20 eV, respectively (see Fig. 3).TiHAP and TiFHAP had larger E g values and showed stronger absorption towards UV light than TiO 2 , indicating that both of these exhibited better photocatalytic activity in the near-UV region. Figure 4 shows a comparison of the PL spectra between TiHAP and TiFHAP (wt(F) 5.6).A strong emission at about 480 nm for TiHAP is attributed to the recombination of photoinduced electron-hole pairs 28,29.However, for TiFHAP (wt(F) 5.6), there was no obvious emission at this wavelength, indicative of a more efficient electron-hole separation.This suggests that more photoinduced electrons participate in reducing CO 2 , thereby enhancing the photocatalytic efficiency of TiFHAP. Figure 5a shows the XPS spectra of TiHAP and TiFHAP (wt(F) 5.6) powders.Both had a high concentration of Ti, Ca, P, and O and traces of S. The binding energy of C1s was 284.8 eV.The ratio of Ti/Ca in both powders was approximately 0.1, consistent with the addition of Ti(SO 4 ) 2 and Ca(NO 3 ) 2 4H 2 O. F was observed in TiFHAP (wt(F) 5.6) powder, confirming that the TiHAP powder was doped with F. The ratio of F/Ca in TiFHAP (wt(F) 5.6) powder was lower (approximately 0.2), probably due to the loss of F during synthesis.Figure 5b shows the spectra of O1s, Ti2p, and F1s of TiFHAP (wt(F) 5.6) powder.The O1s peaks at 530.5, 531.3, 532.1, and 533.3 eV were attributed to O-Ti, O-P, O-Ca, and O-H species, respectively, indicating that Ti ions were successfully incorporated into the HAP lattice structure, replacing some Ca 2 .No peak related to O-F species (535 eV) was observed.For Ti2p, besides the peaks of 464.6 and 458.8 eV for Ti(IV) 2p1/2 and Ti(IV) 2p3/2 , there was also a peak at 459.6 eV, possibly attributable to Ti-F species. For F1s, two peaks at 684.4 and 686.0 eV were ascribed to F-Ca and F-Ti species 30.These results show that the dopant F bonded with Ti and Ca and behaved as a substitute for OH groups in the TiHAP structure, as expected 27. and TiFHAP Powders In the control experiments, no reduction in CO 2 was observed in cases without illumination or in cases without catalysts but with UV illumination below 254 nm.In addition, the TiHAP and TiFHAP samples showed no photocatalytic activity under visible light.CO and CH 4 were the main gaseous products of the photocatalytic reduction of CO 2 . Other C-containing products such as methanol, formaldehyde, and formic acid were not detected.Figure 6 displays the amounts of CO generated during the photocatalytic reduction of CO 2 across P25-TiO 2 , TiHAP, and TiFHAP (wt(F) 5.6) samples during the 6 h photoirradiation.The concentrations of CO increased linearly over time, indicating that the reactions represent zero-order kinetics model.The CO production rates were 0.102, 0.149, and 0.189 mol L -1 h -1 for the P25-TiO 2 , TiHAP, and TiF-HAP (wt(F) 5.6) samples, respectively.The TiFHAP (wt(F) 5.6) sample showed the highest activity, followed by TiHAP and P25-TiO 2 , suggesting that both have good photocatalytic reduction capability. We prepared TiFHAP samples with different concentrations of F to explore the effects of doping.Figure 7 shows the CO formation rate constants of the TiHAP (wt(F) 0) and TiFHAP (wt(F) 1.9, 3.7, 5.6, 7.5, and 9.4) samples.Generally, F doping improved photocatalytic activity compared to the TiHAP sample.With increasing concentration of F, the photocatalytic activity of TiFHAP increased, with a wt(F) 5.6 yielding the best results (0.19 mol L -1 h -1 ).Thereafter, the photocatalytic activity began to decrease, but remained higher than that of TiHAP up to the maximum tested wt(F) of 9.4.CO was the main gaseous product in the reaction system, and CH 4 also formed.Table 1 shows the yields of CO, CH 4 , and CH 4 CO, as well as the CH 4 /(CH 4 CO) ratios across different samples.The analyses of all four parameters yielded the sequence TiFHAP TiHAP P25-TiO 2 , with F doping of 5.6 wt showing the best results.After 6 h of illumination, the total yield (CH 4 CO) for P25-TiO 2 was 0.102 mol g-cat -1 h -1 , of which only 3.9 was CH 4 .For Fig. 4 PL spectra of TiHAP and TiFHAP (wt(F) 5.6) samples both the TiFHAP and TiHAP samples, the ratios of CH 4 / (CH 4 CO) were higher than that of P25-TiO 2 .For example, when the F mass fraction was 5.6, more than a three-fold enhancement (14.8) of CH 4 /(CH 4 CO) was achieved.Therefore, along with higher reaction rates (in the case of CO production), the TiFHAP and TiHAP samples showed better CH 4 selectivity compared to P25-TiO 2 .Because CH 4 is the end-product of CO 2 photoreduction, our study shows that TiHAP and TiFHAP samples have the capability for deep CO 2 reduction. H 2 O is a necessary component (reductant) in the photocatalytic reduction of CO 2 .In this study, using TiFHAP (wt(F) 5.6) as the photocatalyst, we explored the effects of RH on the reaction rate.Within a range of 5-95 RH, the production of CO and CH 4 gradually increased (Fig. 8).The continuous increase in CO and CH 4 production was ascribed to the adsorption of H 2 O, which is an important source of H .Furthermore, the relative content of CH 4 i.e., the CH 4 /(CO CH 4 ) ratio increased substantially with increasing RH.At RHs of 5, 35, 65, and 95, the CH 4 /(CO CH 4 ) ratios were 11.2, 14.8, 21.9, and 30.2, respectively, implying that higher RHs resulted in greater CH 4 selectivity of CO 2 photoreduction for TiFHAP (wt(F) 5.6).In other words, deep reduction can be achieved under high H 2 O conditions in the system. The proposed mechanism for photocatalytic CO 2 reduction of TiHAP and TiFHAP (Ti(F)HAP for short) powders with H 2 O as a reductant is shown in Fig. 9. First, Ti(F)HAP is excited by UV illumination to generate electron-hole pairs (Eq.1), which leads to the photocatalytic H 2 O splitting reaction yielding protons (Eq.2).Photogenerated electrons with strong oxidizability take part in CO 2 reduction (Eqs.3 and 4) with adsorbed CO 2 and H . Although the band gaps of both TiO 2 and TiHAP meet the potentials required for Eq. 3 (E vs. NHE -0.53V) and Eq. 4 (E vs. NHE -0.24V) 31, the conduction band position of TiHAP is higher than that of TiO 2 25, yielding a greater driving force for CO 2 reduction for the TiHAP sample.Another important factor affecting photocatalytic performance is the adsorption capacity of CO 2 and H 2 O on the catalysts.The larger adsorption capacity of TiHAP compared to TiO 2 22 indicates that more CO 2 and H 2 O can participate in the reduction reaction.Because the formation of CH 4 requires more H (Eq.4), more adsorbed H 2 O facilitates a deep reduction of CO 2 into CH 4 .A wide band gap (according to Fig. 3) and good adsorption capacity enhance the photocatalytic reduction capacity and CH 4 selectivity of TiHAP. F doping improves the performance of photocatalytic reduction by TiFHAP compared to TiHAP.As a substitute of the OH group, doped F -slightly elevates the conduction band position of TiFHAP (according to Fig. 3), probably attributed to its stronger electronegativity and limited free electrons.Moreover, F doping improves the charge transfer and inhibition of charge recombination to enhance the photogenerated charge 32, supported by the PL results in this study (see Fig. 4). RH has an important effect on the CO 2 conversion rate and product selectivity.With increasing RH, more H 2 O molecules adsorb onto the surface of the catalyst and take part in the reaction (Eq.2), thereby improving the total CO 2 conversion rate.Notably, this also improves CH 4 selectivity.Presumably, higher RHs result in higher protons-to-CH 4 formation.However, the reaction pathway and product distribution depend greatly on the experimental design 333435.Furthermore, the process of CO 2 photoreduction requires further investigation to clarify the mechanism."
  },
  {
    "title": "Conclusions",
    "content": "TiHAP photocatalysts with a wide band gap showed higher reactivity and greater capacity for deep reduction of CO 2 compared to commercial P25-TiO 2 .Moreover, F doping (wt F 1.9-9.4) of TiHAP showed enhanced photoactivity, with 5.6 wt fluorine being the optimal.The reaction rate and CH 4 selectivity can be enhanced by increasing RH.These results suggest an innovative method to develop new photocatalysts for recycling CO 2 into sustainable energy. Fig. 1 TEM images of a TiHAP and b TiFHAP (wt(F) 5.6) powders Ti(F)HAP hv Ti(F)HAP e cb- Ti(F)HAP h vb Fig. 5 a XPS profile spectra of TiHAP and TiFHAP (wt(F) 5.6) powders.b O1s, Ti2p, and F1s XPS spectra of TiFHAP (wt(F) 5.6) Fig. 6 CO formation over time across P25-TiO 2 , TiHAP, and TiF-HAP (wt(F) 5.6) powders during illumination.Reaction conditions: 300 mg catalyst, 10 vol CO 2 (4.16 mmol L -1 ), 35 RH, 293 K Fig. 8 CO and CH 4 generation rate constants of TiFHAP (wt(F) 5.6) under different RHs.Reaction conditions: 300 mg catalyst, 10 vol CO 2 (4.16 mmol L -1 ), 293 K Yields of CO and CH 4 , and the CH 4 /(CO CH 4 ) ratio during CO 2 photocatalytic reduction across different samples after 6 h of irradiation Reaction conditions: 300 mg catalyst, 10 vol CO 2 (4.16 mmol L -1 ), 35 RH, 293 K Acknowledgements The authors are grateful to the financial support provided by National Natural Science Foundation of China (21577003, 21277004, 41421064), the National Key Research and Development Program of China (2016YFC0202200), Beijing Natural Science Foundation (8132035) and the Special Funds for State Key Joint Laboratory of Environmental Simulation and Pollution Control, Peking University, China."
  }
]