[
  {
    "title": "Doi",
    "content": "10.1016/j.fuel.2014.09.079"
  },
  {
    "title": "Article_Title",
    "content": "Novel nanostructured-TiO2 materials for the photocatalytic reduction of CO2 greenhouse gas to hydrocarbons and syngas"
  },
  {
    "title": "Abstract",
    "content": "h i g h l i g h t sNovel nanostructured-TiO 2 s were used for CO 2 reduction to hydrocarbons and syngas.Meso.TiO 2 showed a higher production and better reaction kinetics and stability.There was competitive adsorption of CO 2 and H 2 O vapors on surface of the catalyst.UV light, H 2 O/CO 2 ratios and catalyst shapes were optimized to improve products.Partial saturation of active adsorption sites and O 2 produced caused deactivation."
  },
  {
    "title": "Experimental",
    "content": "The TNPs was synthesized in the laboratory using a vortex reactor (VR; the VR is a passive mixer characterized by a small volume of about 0.5 mL, whose mixing time can be tuned by changing the flow rates of the inlet solutions) using the sol-gel method as reported in our previous work 24.The mesoporous silica material (KIT-6) was obtained according to the procedure that has been shown in a recent work 20.After a hydrothermal treatment, the obtained solid product was filtered, dried and/or calcined at 550 C for 5 h, and then utilized as a template to prepare Meso.TiO 2 .The Meso.TiO 2 (using KIT-6 replication) was obtained according to the procedure reported in 25, but KIT-6 was used instead of SBA-15 as the silica template, and Titanium (IV) isopropoxide (TTIP, Sigma Aldrich, 98) was used as the TiO 2 precursor.The commercial Aeroxide P25 TiO 2 was purchased from Avonik industries and was used for reference purposes in this work. The Brunauer-Emmett-Teller (BET) specific surface area (S BET ), pore volume (PV) and average pore diameter (APD) were measured on the powder materials, which had previously been outgassed at 150 C using a Micromeritics FlowPrep 060, USA (sample degas system), by means of N 2 sorption at 77 K on a Micromeritics Tristar II, USA (surface area and porosity) instrument. The X-ray diffraction (XRD) patterns were recorded in order to determine the different polymorphs, on an X'Pert Phillips diffractometer using Cu Ka radiation, under the following conditions: 2h 10-90; 2h step size 0.02.The small-angle X-ray diffraction (SAX) patterns of the materials were recorded on a Phillips instrument at 2h 0.2-3.5.The morphology and mesoporous structure of the samples were observed by means of a Leo Supra 55 field emission scanning electron microscope (FE-SEM, Zeiss Merlin).The ultraviolet-visible (UV-Vis) spectroscopy diffuse reflectance spectra were recorded using a Varian model Cary 500 spectrophotometer with a suitable quartz cell for measuring powders. The total UV light intensity was measured by Field Master Power Meter Head from Coherent (Auburn, CA, USA) with a sensor of 3 cm inner diameter and capacity to measure from 10 mW to 100 W. In order to have a viable application, the TiO 2 photocatalyst cannot be used in powder form but needs to be shaped into a structured reactor.Different alternatives to powder are possible, and the following have been examined in this work: -Fine 500 lm pellets uniformly dispersed in the reactor; this provides the maximum available geometrical surface area exposed to light and for reactant adsorption. -A thin catalyst layer laid over an illuminated surface; this maximizes the geometrical surface area exposed by the photocatalyst and UV light. A 0.5 g sample of bare catalyst powder, which was dispersed over the same surface using a spatula, was prepared for comparison purposes. The basic experimental set-up is shown in Fig. 1.This set-up includes a Pyrex glass reactor, connectors, mass flow controllers (Bronkhorst, High-Tech), a water bubbler and a UV lamp (Newport/Oriel Instrument USA 200 W with focusing lens assembly or Osram Ultra-Vitalux 300 W).The set-up also includes a CO 2 gas cylinder (99.99), a gas chromatograph (GC, Varian CP-3800) equipped with a capillary column (CP7381), a flame ionization detector (FID) and a thermal conductivity detector (TCD).A photocatalytic reaction was performed in the reactor, which contained 0.5 g of photocatalyst.The reactor and lines were purged with a He flow to remove the trapped air and the impurities.After dilution (20) with He, CO 2 gas was introduced into the reactor after having passed through the water bubbler and ensuring it was adsorptiondesorption balanced in order to saturate the catalysts with CO 2 and H 2 O.When equilibrium was reached, the UV light was turned on and the reaction products were analyzed by means of the GC. Blank tests were also conducted to ensure that the product was due to the photocatalytic reaction.The blank tests consisted of a UV-illumination without the photocatalyst and a reaction in the dark with the catalyst."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Recent analyses have shown that modern catalysts are usually made of materials with high surface areas with nanometric particle sizes of below 100 nm and usually around 10 nm 26.In-depth studies on TiO 2 have shown that the morphological parameters that affect photoactivity are the primary and secondary particle size, the particle shape and porosity.Moreover, it has been shown that a decrease in the primary particle size increases the surface area and generally has a beneficial effect on photoactivity 19.Therefore, the main aim of this study was to obtain nano-TiO 2 with a high surface area/or porosity in order to obtain a further CO 2 photocatalytic reduction.Table 1 shows the physical and textural properties of the three different TiO 2 materials that were obtained by means of N 2 sorption.TNPs has a three-fold higher surface area than Aeroxide P25 TiO 2 , as the TNPs has a smaller nano particle morphology than the Aeroxide TiO 2 ; this aspect is discussed in more detail in the FE-SEM section.However, Meso.TiO 2 showed an even higher surface area than TNPs and it was approximately 4 times higher than that of Aeroxide P25.The higher surface area could be due to its mesoporosity as Meso.TiO 2 contains mesopores with an average 4.7 nm diameter.An EDX analysis of Meso.TiO 2 (Table 1) has confirmed that the silica template (KIT-6) had been removed and the resultant material was pure TiO 2 . Fig. 2 shows the phase composition obtained from the XRD patterns of the TNPs, Meso.TiO 2 , Aeroxide P25 TiO 2 and 100 anatase TiO 2 by Aldrich which was used as a reference for comparison purposes.It has been noticed that Aeroxide P25 TiO 2 is a mixture of anatase and rutile (70:30).It has been observed, by means of X'Pert analysis, that TNPs shows a similar anatase and rutile mixture (80:20).Meso.TiO 2 also shows an anatase-rutile mixture but with more anatase and less rutile (90:10).It is generally accepted that anatase shows more activity than rutile, in most photocatalytic reaction systems 27.This enhancement in photoactivity has been ascribed to the fact that the Fermi level of anatase is higher than that of rutile, while rutile is usually less active, due to the fast e A and h recombination 28.Aeroxide P25 TiO 2 , which is a non-porous 70:30 (anatase to rutile) material, has been established as the standard for photoreactivity in various applications 29.Despite the presence of the rutile phase, this material has proved to be even more reactive than single-phase anatase 27.A mixed anatase-rutile phase therefore seems to be preferable in order to obtain some synergistic effects for photocatalytic reactions, since the conduction band electron of anatase partly jumps to the less positive rutile part, thus reducing the recombination rate of the electrons and the positive holes in the anatase part.The synthesized TNPs and Meso.TiO 2 are actually characterized by a similar anatase-rutile mixture.Moreover, as can be seen from the SAX results shown in Fig. 2c, Meso.TiO 2 is a replica of KIT-6, and it therefore retains the same characteristics as the parent template.Fig. 3 shows the high resolution FE-SEM images of the three TiO 2 materials being studied.As can be seen in Fig. 3a, Aeroxide P25 contains 55-76 nm nanoparticle agglomerates with an average particle size of 70 nm.However, as can be seen in Fig. 3b, TNPs has a combination of 9-15 nm nanoparticles, with an average particle size of 11 nm, which is much smaller than the size of particles in Aeroxide P25 TiO 2 .Meso.TiO 2 same as to KIT-6 silica template, is a porous material and 4 nm mesopores have been observed, as can be seen in Fig. 3c. Fig. 4 shows the UV-Vis absorption spectra of the three TiO 2 materials and their corresponding band gap energies (Table 1).UV-Vis spectroscopy usually provides important information on the interactions of semiconducting materials, for instance TiO 2 , with photon energies 30.The band gap energies of the three TiO 2 samples were calculated using the onset of the UV-Vis spectra of the absorption values with equation, E(eV) hc/k 1239.95/k27,30, where E is the band gap energy (eV), h is Planck's constant, c is the velocity of light (m/s) and k is the wavelength in nm.The average band gap energies of anatase and rutile TiO 2 reported in literature are 3.2 and 3.0 eV, respectively 31, which demonstrates that the band gap energies of the three TiO 2 obtained in this study, i-e, Aeroxide P25 (3.25 eV), TNPs (3.12 eV) and Meso.TiO 2 (3.22 eV) are in agreement with those found in the literature. The blank activity tests conducted without photocatalysts and the reactions in the dark with catalysts showed no product formation, which indicates that the products obtained during the reaction were purely photocatalyst based.During the pretreatment of the reaction, the reactor and lines were flushed with a He flow, and this also removed any trapped O 2 /N 2 as well as any other impurities within the reactor. The photocatalytic activity results for all three TiO 2 materials pertaining to the conversion of CO 2 , with H 2 O vapors, into various energy-bearing products are shown in Fig. 5.The main products obtained after the reaction were hydrocarbons (CH 4 , CH 3 OH in vapor form) and syngas (CO and H 2 ), both of which are very useful energy-bearing products 32, that can either be used directly as energy or to make other more valuable energy products.Fig. 5a-c show a comparison of the three TiO 2 materials, in terms of the reaction kinetics.Aeroxide P25 TiO 2 has comparatively slower reaction kinetics than TNPs or Meso.TiO 2 .The other important difference is that P25 TiO 2 does not form H 2 , whereas TNPs forms a significant amount of H 2 , and a reasonable amount of H 2 was also produced by Meso.TiO 2 .However, in the latter case, it gradually decreased as the irradiation reaction time increased.The CO and CH 4 production rates of Aeroxide P25 TiO 2 rapidly decreased, as is clearly shown in Fig. 5a.However, TNPs had a higher and more stable CH 4 and CO production rate than Aeroxide P25.Meso.TiO 2 showed higher production rates than the other two TiO 2 s (TNPs, P25).These differences are even more obvious when the total production was compared after 5 h of reaction, as can be seen in Fig. 5d-f.This clearly indicates that TNPs and Meso.TiO 2 are much better than Aeroxide P25 TiO 2 , because of the higher surface area of TNPs and Meso.TiO 2 than Aeroxide P25 TiO 2 .The higher surface areas of these materials, lead to a better adsorption of H 2 O and CO 2 , which in turn, leads to increased fuel products 33.In spite of the basic difference in surface areas, the difference in activity could also be due to different TiO 2 surface effects, due to their different morphologies, as observed by means of FE-SEM.It has been found in the literature that CO 2 adsorption varies according to the surface and structure 34, and this could significantly affect the overall reaction, because of the difference in adsorption.Therefore, owing to the mesoporosity of Meso.TiO 2 , the adsorption of gaseous reactants, particularly CO 2 , was considered better than the other TiO 2 , and product desorption was also better, due to the easy transportation by the mesopores.The higher surface area of Meso.TiO 2 showed a synergistic effect with this adsorption effect and hence overall showed higher activity.However, more H 2 formation by TNPs also indicates that TNPs favors more H 2 O adsorption, due to its hydrophilic surface 24,27.Competitive adsorption also takes place between H 2 O and CO 2 , which results in significantly different products.This aspect is discussed in more detail in the next section. Various mechanistic reaction schemes have been reported in the literature for CO 2 reduction with H 2 O using TiO 2 photocatalysts 6,17,19,33.The conversion reaction pathways are not specific and mainly depend on the reaction conditions.This is therefore a complex mechanism that proceeds through branching pathways and produces different products simultaneously.However, knowledge on this mechanism is still limited, and many aspects are still unclear; more detailed studies are therefore still needed.It has been observed that CO 2 is a thermodynamically stable and chemically inert compound and it is difficult to oxidize or to reduce it to other useful compounds under normal operating conditions. A single electron reduction of CO 2 to an anion radical A CO 2 A therefore has a very strong negative electrochemical potential of A1.90 V 6.It is thermodynamically impossible for any semiconductor to provide a single photogenerated electron to a CO 2 molecule.However, the standard potential of H The best way of activating the inert CO 2 molecule for reduction purposes, is to adsorb it on the surface of any semiconducting material, and this lowers its energy barrier 36.In this work, the adsorption of CO 2 and H 2 O has therefore been focused.Fig. 6 shows the reaction mechanism with the detailed steps and pathways necessary to achieve the required energy products.The CO 2 and H 2 O vapors were adsorbed, before the reaction, to obtain a good adsorption of these reactants on the catalyst surface.However, as can be seen in Fig. 6, H 2 O, being a polar (1.85D) molecule, has a greater tendency to adsorb than CO 2 , which has a lower dipole moment (0D); this means that H 2 O and CO 2 compete for adsorption.In this context, the difference in surface areas of the three TiO 2 materials is a further contributing factor to the difference in adsorption of the reactants.After the adsorption, electrons and holes are produced through UV irradiation and the reaction initiates.Electrons reach the adsorbed CO 2 and reduce it to an anion radical A CO 2 A , while H 2 O oxidation proceeds through the holes, and this leads to H , A OH or O 2 , which is desorbed or further participated in the reaction (as discussed later on the deactivation part).H takes electrons and forms A H, which then reacts with A CO 2 A and forms CO and OH A .This CO formation is an easy step, as mentioned earlier on this section, which either desorbs as a product or it is further reduced to A C, and then forms a chain reaction with A H to form A CH, A CH 2 , or A CH 3 .Alternatively, two A Hs combines together to make H 2 , which has been found when TNPs and Meso.TiO 2 are used, and might be due to a greater adsorption of H 2 O than Aeroxide P25.A CH 3 further reacts with A H to form CH 4 .The A OH obtained from H 2 O oxidation either combines together to make O 2 , or is directly utilized by A CH 3 to form CH 3 OH as a product, which however seems difficult and complex.If the activity (Fig. 5) and mechanism (Fig. 6) are compared under normal operating conditions, the more hydrophilic nature of TNPs favors a water oxidation pathway to generate H 2 .However, under the same operating conditions, Meso.TiO 2 shows a greater CO 2 reduction pathway and produces comparatively more CO and CH 4 . Light, whether UV or solar, is the main factor that directly affects the initiation of a photocatalytic reaction.UV lights are common sources of illumination for photocatalytic reactions, and usually have light wave lengths in the 100-400 nm range.However, the minimum threshold wave length required to promote an excited state, for anatase TiO 2 , is 387.5 nm 37.Irradiation, using a light with a shorter wavelength, is more effective but not economic, therefore, the selection of the optimum light for a specific semiconductor is of key interest.Two different UV lamps with similar UVA and UVB ranges but with different intensities and temperatures and with powers of 200 (Intensity: 119 mW/cm 2 ) and 300 W (Intensity: 154 mW/cm 2 ) have been used in this work to establish the effect of light on the catalytic activity.Fig. 7 shows the difference in the production rates and a comparison of the average production rates of the products obtained from TNPs and Meso.TiO 2 .It has been observed that the UV 200 W lamp is better for H 2 production for both TiO 2 s (TNPs, Meso.TiO 2 ), due to the lower temperature that is produced when it is used, which favors more H 2 O adsorption.However, the 300 W lamp has more photon power, more UVB intensity and produces a higher temperature, which suppressed H 2 O adsorption and boosts the CO 2 reduction path.Therefore, more CH 4 , CO and CH 3 OH are produced when the 300 W lamp is used.Meso TiO 2 has again shown a better catalytic performance than TNPs under the same operating conditions, due to its aforementioned superior characteristics. Light intensity is another factor that affects this reaction.As the light intensity increases, the number of generated photons increases, and this leads to more electron-hole pairs being excited with high energy 33.Fig. 8 shows the effect of light intensity on the production rate of the products using TNPs and Meso.TiO 2 .Three different distances (30, 20 and 5 cm) have been used between the lamp and the catalyst in the reactor to obtain different light intensities (75, 119 and 269 mW/cm 2 ).Product formation is lower at a distance of 30 cm, as shown in Fig. 8a, and the reaction kinetics is slower, due to the low light intensity ((75 mW/cm 2 ).However, when the distance is reduced to 20 cm, the light intensity increases (119 mW/cm 2 ), as can be seen in Fig. 8b, and the product rate increases significantly with faster reaction kinetics and longterm product formation stability.However, when the distance is further decreased to 5 cm, as shown in Fig. 8c, the product formation increases and very fast reaction kinetics occurs at the beginning of the reaction process, due to the increased light intensity (269 mW/cm 2 ).However, in this case, after 3 h of illumination, the reaction shows deactivation, which could be caused by the rapid saturation of the active sites, due to the fast reaction kinetics and increased temperature from the light.A similar trend has also been observed for Meso.TiO 2 , as can be observed in Fig. 8d-f. In a recent research, TiO 2 and H 2 O vapors (without any sacrificial hole scavenger) have shown a green chemistry approach toward CO 2 reduction to fuels 38.However, the reaction depends to a great extent on the H 2 O/CO 2 molar ratio 38,39.Fig. 9 shows the effect of different H 2 O/CO 2 ratios on the activity of TNPs and Meso.TiO 2 .Different ratios were considered to find the best ratio to maximize the fuel products.It can be seen, in Fig. 9a-c, that CO 2 conversion increases as the H 2 O/CO 2 ratio increases from 0.1 to 0.2, whereas, an excessive amount of H 2 O (H 2 O/CO 2 0.3) suppresses the overall reaction, a result that is consistent with the literature 40,41.A similar trend to that of the TNPs has also been observed for Meso TiO 2 , as can be seen in Fig. 9d-f.However, the overall activity of Meso.TiO 2 is better than that of TNPs, due to the better structure characteristics. The shape of a catalyst is another key parameter that affects product formation as is the potential use of the catalyst for commercial applications 424344.The form of the catalyst powder has been compared with that of pellets (500 lm) and thin film, as can be seen in Fig. 10a-f.The pellets and thin film showed higher activity than the powder, a result that is in line with the literature 43,44.This is due to the better exploitation of the surface that is available for the adsorption of CO 2 and H 2 O, and the better penetration of the UV light, which is necessary to initiate a photocatalytic reaction.Better reaction kinetics and better long-term photocatalytic stability have also been observed for the pellets and thin film than for the powder. The color of the photocatalysts changed after 5 h of reaction (Fig. 11), and a slight photocatalytic deactivation was observed.The deactivation mechanism is not clear, but it can be supposed that it is due to the partial saturation of the active sites for adsorption, on the photocatalyst surface, with intermediate product/by-product/ mixture formation, and the CH 3 OH formation.The CH 3 OH produced was absorbed by the powder catalyst, which might be re-oxidized back into CO 2 through the O 2 produced in the reaction 45.After the reaction, the used catalysts were placed in an oven at 30 C (equivalent to room temperature) and relative humidity of approximately 40 for 12 h to evaporate the adsorbed species.More than 90 of the catalyst was recovered (Fig. 11b andd), which shows that most of the adsorbed species were only adsorbed physically.However, a more detailed study is necessary to establish the exact nature and causes of these deactivating species, which are important to have a clear understanding of the reaction mechanism."
  },
  {
    "title": "Conclusions",
    "content": "TNPs with an enhanced adsorption capability, due to its high surface area and smaller nano-sized particle morphology, has shown a higher syngas production than commercial Aeroxide P25 TiO 2 .However, novel Meso.TiO 2 has shown more hydrocarbons as well as a better syngas production, better reaction kinetics and better stability, due to its superior characteristics than those of the commercial TiO 2 and TNPs.The reaction mechanism indicates that the reaction proceeds mainly by competitive adsorption of CO 2 and H 2 O on the catalyst surface.The UV light source, UV intensity, H 2 O/CO 2 ratios and catalyst shapes are the main factors that influence the performance of the catalysts, and these parameters have here been optimized to increase the fuel products.Partial saturation of the active adsorption sites by means of the product/ by-product/mixture formation are the possible causes of the deactivation.The O 2 produced in the reaction is also believed to promote the deactivation by means of oxidation of the product back to CO 2 .The catalysts can be regenerated quickly through a simple evaporation technique.The results indicate that these photocatalysts are promising for future research and further applications. The financial support from the Eco 2 CO 2 European Project (309701-2 Eco 2 CO 2 CP-FP FP7-NMP-2012-SMALL-6) is gratefully acknowledged. Fig. 1.Schematic photocatalytic reaction set up for the CO 2 conversion to fuels. Fig. 2. XRD patterns of different TiO 2 materials: (a) Aeroxide P25 and 100 anatase TiO 2 by Aldrich, (b) TNPs, (c) SAX analysis of KIT-6 template and the replicated Meso.TiO 2 , (d) Meso.TiO 2 . Fig. 5. Photocatalytic activity comparison of the fuel production rate and production over 5 h: (a and d) Aeroxide P25 TiO 2 , (b and e) TNPs, (c and f) Meso.TiO 2 , at standard operating conditions with 0.5 g of photocatalyst, 50 mL/min flow rate, H 2 O/CO 2 0.1, 200 W UV lamp. Fig. 6.Mechanism and pathways of the photocatalytic reduction of CO 2 with H 2 O vapor to fuels. Fig. 7. Effect of the UV source on the activity: (a and b) 200 W UV lamp/TNPs, (c and d) 300 W UV lamp/TNPs, (e and f) 200 W UV lamp/Meso.TiO 2 , (g and h) 300 W UV lamp/ Meso.TiO 2 , at standard operating conditions with 0.5 g of photocatalyst, 50 mL/min flow rate, H 2 O/CO 2 0.1. Fig. 9. Effect of different H 2 O/CO 2 ratios on the activity: (a) 0.1/TNPs, (b) 0.2/TNPs, (c) 0.3/TNPs, (d) 0.1/Meso.TiO 2 , (e) 0.2/Meso.TiO 2 , (f) 0.3/Meso.TiO 2 , at standard operating conditions with 0.5 g of photocatalyst, 50 mL/min flow, 200 W UV lamp. Fig. 10.Effect of different catalyst shapes on the activity: (a) powder/TNPs, (b) pellets/TNPs, (c) thin film/TNPs (d) powder/Meso.TiO 2 , (e) pellets/Meso.TiO 2 (f), thin film/ Meso.TiO 2 , at standard operating conditions with 0.5 g of photocatalyst, 50 mL/min flow rate, H 2 O/CO 2 0.1, 200 W UV lamp. Fig. 11.Catalyst deactivation/regeneration: (a and b) TNPs, (c and d) Meso.TiO 2 . Characteristics of the synthesized photocatalysts. BET (BET specific surface area in m 2 /g); PV (pore volume in cm 3 /g); APD (average pore diameter in nm); band gap energy (eV); n.d.(not determined). 2 O to generate H 2 is much lower and as a result, it is feasible.Even though it is impossible to transfer a single photogenerated electron to a CO 2 mole- 35, it is easier to conduct the proton-assisted transfer of multiple electrons.In this context, H 2 and CO formation is favorable as they need a lower number of electrons and protons35, while CH 4 and CH 3 OH require more electrons and protons and are difficult to form.Two electrons, 2 protons and a A0.41 V electrochemical reduction potential are needed to generate H 2 , while CO 2 requires 2 electrons and 2 protons, with A0.53 V electrochemical reduction potential to generate CO.CH 4 formation instead needs 8 protons and 8 elections, with A0.24 V, and CH 3 OH requires 6 protons and 6 electrons with a A0.38 V electrochemical reduction potential. P. Akhter et al. / Fuel 149 (2015) 55-65 P. Akhter et al. / Fuel 149 (2015) 55-65"
  }
]