[
  {
    "title": "Doi",
    "content": "10.1016/j.electacta.2018.03.171"
  },
  {
    "title": "Article_Title",
    "content": "Interfacial charge kinetics of ZnO/ZnTe heterostructured nanorod arrays for CO 2 photoreduction"
  },
  {
    "title": "Abstract",
    "content": "Iqbal conducted the experiments and data analysis.Y. Wang performed the data analysis and article writing."
  },
  {
    "title": "Experimental",
    "content": "The chemicals including zinc nitrate hexahydrate Zn(NO 3 ) 2 6H 2 O, 99.9), potassium chloride (KCl, 99.9), tellurium chloride (TeCl 4 , 99.9), sodium hydroxide (NaOH, 99.9) and zinc chloride (ZnCl 2 , 99.9) were bought from Sinopharm Chemical Reagent Co., Ltd, which were of analytical grade and used without further purification.Potassium bicarbonate (KHCO 3 , AR) was purchased from Xilong Scientific, China.Sodium sulfite (Na 2 SO 3 , AR) was bought from Beijing Chemical Works, China.Fluorine-doped tin oxide (FTO) glass (14 /sq) was obtained from Wuhan Jinge Solar Energy Technology Co., Ltd, China.Milli-Q pure water was used in all the experiments. Electrochemical method was used to synthesize the ZnO nanorods on the FTO substrate.An aqueous solution with 1.0 mmol/ L Zn(NO 3 ) 2 and 0.1 mol/L KCl was employed as the precursor.A three-electrode cell was utilized for the electrodeposition with FTO as the work electrode, platinum as the counter electrode, and saturated calomel electrode (SCE) as the reference electrode.The electrodeposition was kept under a bias of -1.0 V at 70 oC for 2 h.Then the obtained ZnO nanorod electrode was washed with pure water to remove the residuals. ZnTe was deposited onto the as-prepared ZnO nanorod electrode by a one-step electrochemical deposition method.First, 50 mmol/L TeCl 4 aqueous solution with pH adjusted to 0.33 by H 2 SO 4 was prepared, followed by continuous stirring at 80 oC for 4 h.Then, 50 mmol/L ZnCl 2 was added into the above solution and the pH was maintained at 4 by adding 4 mol/L NaOH.The electrodeposition was also carried out under -0.739V at 80 oC in a three electrode configuration with the as-prepared ZnO as the work electrode.Finally, the as-prepared film was thoroughly washed with pure water and dried at 70 oC.The deposition time for ZnTe was respectively controlled at 1 min, 2 min and 3 min, which is denoted as ZnO/ZnTe-1min, ZnO/ZnTe-2min, ZnO/ZnTe-3min, respectively. Pure ZnTe was also prepared on FTO substrate via electrochemical deposition.Firstly, 0.38 mol/L ZnSO 4 aqueous solution was prepared.Then 5 mmol/L Te 4 aqueous solution was obtained with 0.368 mol/L H 2 SO 4 and TeO 2 and was heated to 80 oC under stirring for 30 min.The above two solutions were mixed afterwards and the pH was adjusted to 4 by NaOH.The ZnTe film was deposited on the FTO glass by applying a constant potential of -0.739 V (vs.SCE) at 80 oC for 1 h.After deposition, the ZnTe electrode was cleaned with pure water and dried at 70 oC in vacuum. X-ray diffraction (XRD, D8 Focus, Bruker, Germany) measurements were performed with Cu K radiation to determine the crystal structure.The morphology of the as-prepared samples was analyzed by using a field-emission scanning electron microscopy (SEM, S4800, Hitachi, Japan).The energy dispersive X-ray spectroscopy (EDX) was performed to determine the elemental composition using the EDX attachment with the SEM.Transmission electron microscopy (TEM, Tecnai G2 F20 U-TWIN, FEI, USA) and scanning transmission electron microscopy (STEM-HAADF, MODEL 3000, Fischione Instruments, USA) were conducted to study the structure and elemental distribution of the as-prepared samples.UV-vis absorption spectra were recorded using a UV/Vis/NIR spectrophotometer (Lambda 750, Perkin Elmer, USA). The PEC response of the pristine ZnO and ZnO/ZnTe heterostructures was studied in KHCO 3 aqueous solution saturated by CO 2 (0.1 mol/L, pH 6.8) under open circuit potential.A conventional three-electrode configuration was used with a SCE reference and Pt counter electrode.Unless otherwise stated, the measured potential vs SCE is converted to the reversible hydrogen electrode (RHE) scale according to the Nernst equation (Equation 1), where E RHE is the converted potential vs RHE, E SCE is the measured potential vs SCE, and 0.244 V. The transient photocurrent was collected by using a CHI 660D electrochemical workstation (Chenhua, China) with an Xe lamp providing the irradiation under both full spectrum and visible-light illumination ( 420 nm).The other PEC measurements were all carried out on IM6 electrochemical workstation (Zahner, Germany).IPCE was obtained under monochromatic illumination (TLS 03, Zahner).EIS was tested with an AC amplitude of 5 mV under full spectrum illumination (100 mW/cm 2 , WLC02, Zahner).IMPS was performed under a sine modulated light (100 mW/cm 2 , WLC02, Zahner) with an AC amplitude of 10 mV.Capacitance measurements were carried out under the frequency of 1 kHz to obtain the Mott-Schottky plots. The photocatalytic property of the obtained samples was evaluated by testing the performance of CO 2 reduction under visible-light illumination ( 420 nm).An aqueous solution with 0.25 mol/L Na 2 SO 3 and 1 mol/L NaOH was used as the electrolyte, which was purged with Ar for 30 min, followed by CO 2 saturation for 90 min before the reaction.Then, the electrodes were illuminated with an Xe lamp equipped with a cut-off filter ( 420 nm).The pressure was maintained at 30 kPa and temperature at 15 oC throughout the whole experiments.A gas chromatograph (GC, 7890A, Agilent, USA) was used to analyze the gas product of the photocatalytic reduction of CO 2 , which was connected with the reactor system.The product was determined as a function of irradiation time for 8 h."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The formation of as-prepared samples is confirmed by the XRD patterns, as shown in Fig. 1.The pure ZnO nanorods can be well indexed to a Wurtzite structure The surface of ZnO nanorods becomes apparently rough after the deposition of ZnTe, which is more clearly observed in the inset of Fig. 2b.EDX was carried out to determine the ZnTe amount in the ZnTe/ZnO heterostructure synthesized under different deposition time (Fig. S1) and the analyzed results are summarized in Table S1, which further confirms that the ZnTe amount increases with the increase of the deposition time. TEM was further used to study the microstructure of the samples.As shown in Fig. 3a, the ZnO sample exhibits rod-like morphology.In Fig. 3b, the high resolution TEM (HRTEM) and selected area electron diffraction (SEAD) for the ZnO nanorod edge manifest its high crystallinity.The fringe spacing of 0.26 nm corresponds to the inter-planar distance of (0002) plane in Wurtzite ZnO, indicating the 0001 preferential growth direction of the nanorods, which agrees well with the above XRD analysis.Fig. 3c displays the Zn and O elemental distribution on the nanorod.The ZnO/ZnTe heterostructure maintains the rod-like shape with the edge getting rougher than ZnO (Fig. 3d).The ZnO/ZnTe heterojunction interface is obvious in the HRTEM image of its edge region.Similarly, the lattice distance of 0.26 nm is attributed to the (0002) plane of ZnO and the plane with the spacing of 0.35 nm can be indexed as (111) in ZnTe, which confirms the successful deposition of ZnTe on the ZnO nanorod surface (Fig. 3e).To further investigate the distribution sites of the as-deposited ZnTe, STEM was carried out as shown in Fig. 3f.The Te element signal is distributed homogeneously over the nanorod, indicating the uniform modification of ZnTe on the ZnO nanorods. Accordingly, the growth process of ZnTe on the ZnO nanorods is illustrated in Fig. 4. It has been proposed that a value of pH 4 is the most appropriate condition for the electrodeposition of crystalline ZnTe with stoichiometric composition 37, which is also adopted in this work.Based on the thermodynamic values (E 0 (Te 4 /Te 0 ) 0.53 V and E 0 (Te 0 /Te 2-) -0.36V), a possible reaction mechanism is thus put forward for the formation of ZnTe.After the ZnO nanorods are immersed into the electrolyte, the reaction is initiated with the reduction of Te 4 upon the applied bias, followed by the adsorption of produced Te 0 on the surface of the ZnO nanorods (Equation 2).Then, the reduction reaction continues with HTe as the product (Equation 3), as HTe - dominates in the solution at pH above 2, rather than H 2 Te or Te 38.Finally, ZnTe can be easily formed in the presence of Zn 2 due to its low K sp 6.3 10 -27 (Equation 4).Consequently, the ZnTe/ZnO heterostructure is obtained. Since several processes take place in the photocatalyst upon illumination, charge generation upon light absorption, charge separation and recombination, charge transfer, and chemical reactions between the surface species and charge carriers, the formation of a heterojunction will affect the system activity in utilizing incident light by influencing the behavior of photoinduced charge carriers mentioned above.The PEC measurements were thus carried out to evaluate the performance of as-prepared samples and analyze the dynamics of charge generation, separation and transfer for the pristine ZnO and ZnO/ZnTe heterostructures, respectively. The charge generation of a sample can be reflected to some degree by the light absorption performance, as shown in Fig. 5a.The pristine ZnO only responses to the UV-light illumination ( 400 nm), and ZnTe is active in the visible-light region ( 550 nm).Accordingly, the bandgap can be determined from the corresponding (h) 2 Meanwhile, the photocurrent under monochromatic light irradiation is measured to determine the charge behavior under consecutive single wavelength.The IPCE is calculated by using Equation 5, where J is photocurrent density, P is light power density at , and is wavelength of the incident light.The IPCE value is greatly enhanced at wavelength below 400 nm for the ZnO/ZnTe heterostructures than the pristine ZnO (Fig. 5d), though the difference in charge generation in this region is not obvious (Fig. 5a).This phenomenon indicates that the formation of the p-ZnTe/n-ZnO junction can facilitate the charge separation in the system.The IPCE value of ZnO dramatically drops to zero in the visible-light region ( 400 nm); while that of the ZnO/ZnTe heterostructures shows an extended photoresponse, which decays slowly ACCEPTED MANUSCRIPT 14 until it reaches 560 nm, approximately corresponding to the bandgap of ZnTe. Moreover, the ZnO/ZnTe-3min sample displays superior IPCE performance to the others, as it has the largest content of ZnTe. The kinetics of the interfacial charge transfer in the photoelectrode is studied by EIS.Fig. 5e illustrates the Nyquist plots for the ZnO and ZnO/ZnTe heterostructures, which display a semicircle at high frequency (Inset of Fig. 5e).Normally, the diameter of this semicircle represents the charge transfer resistance (R ct ), which influences the electron transfer kinetics at the electrode/electrolyte interface.The Nyquist plot is fitted using the equivalent circuit shown in the inset of Fig. 5e, where R s represents the serial resistance due to the electrode and electrolyte, and CPE stands for constant phase element of the capacitance of double layer in the electrode/electrolyte interface. A lower value of R ct implies more efficient charge transfer and, thus, suppressed recombination possibility of electron-hole pairs at the electrode/electrolyte interface. The fitting results show that the value of R ct is 316.8 (2.9), 18.2 (2.6), 5.9 ( 1.4) and 4.0 (1.9)K for pristine ZnO, ZnO/ZnTe-1min, ZnO/ZnTe-2min and ZnO/ZnTe-3min, respectively.So the deposition of ZnTe on the ZnO nanorods is an efficient way to improve the charge transfer at the electrode/electrolyte interface. Obviously, the ZnO/ZnTe-3min sample possesses the most enhanced interfacial charge separation performance. As a non-destructive method, in addition, IMPS is usually used to determine charge transfer time 39,40.Since the charge transfer time can provide information sample shows more than three-fold faster than that of ZnO. The mechanism of photoinduced charge behavior at the interface, at which the space charge region locates, is further analyzed so as to elucidate the aforementioned PEC performance.It is known that in a heterostructure the photocurrent is generated when the photoinduced electron-hole pairs are separated along the gradient potential in the formed p-n junction.Accompanied by the band bending, a space charge region is necessary for the photocurrent generation.Thus, the study on this space charge region is critical to explain the PEC performance.Since the capacitance is useful in the determination of electronic structure and can reflect the charge distribution when a semiconductor is exposed to the electrolyte, capacitance measurements are carried out to provide useful information, especially on the space charge region. As discussed above, the ZnO/ZnTe heterostructure is a duplex semiconductor layer, composed of n-ZnO and p-ZnTe.Two interfaces are formed when the electrode is exposed to the electrolyte, i.e., ZnO/ZnTe and ZnTe/electrolyte.Three space charge regions are thus developed, corresponding to three capacitors connected in series, i.e., Helmholtz layer, semiconductor/electrolyte interface and the ZnO/ZnTe p-n junction. The overall capacitance can be described by Equation 6, where C H and C sc are the Helmholtz and space charge capacitance, respectively.The latter can be regarded as the capacitance at the p-n junction (C np ) and the one at the semiconductor/electrolyte interface (C p ) in series (Equation 7).When made into the Mott-Schottky expression, Equation 6 becomes Equation 8. The smallest value in the capacitance will determine the ultimate C. Since the C sc is very small compared to the C H , the capacitance of the semiconductor film in the depletion state follows the Mott-Schottky equation (Equation 9) 41, where N D stands for the carrier density, represents the dielectric constant of the semiconductor, 0 is the vacuum permittivity, e is the elementary charge, k is the Boltzman constant, T is the temperature, E FB is the flat band potential, E is the applied bias.The kT/e can be ignored since it is very small.Fig. 6a illustrates the Mott-Schottky plot (i.e., C -2 vs applied potential) for the pure ZnTe.The negative slope of the curve indicates its p-type semiconductor nature and its E FB is calculated to be 1.14 V (vs RHE).Fig. 6b shows the Mott-Schottky plots for the ZnO and ZnO/ZnTe heterostructures, indicating a positive slope of the Mott-Schottky linear region, i.e., an n-type behavior.Thus, here the ZnO is an n-type semiconductor with an E FB of 0.53 V.Moreover, the n-type behavior observed for the ZnO/ZnTe heterostructures indicates that their property is mainly dependent on the ZnO nanorods.Thus, the contribution of ZnTe layer is negligible and the depletion region can extend throughout the whole ZnO and ZnTe due to the nanoscale in size. Thus, a schematic diagram of the alignment of energy levels based on the above analysis is presented in Fig. 7a, showing the photocurrent generation in the space charge region at the interface.Parameters for all the samples including E FB and N D can be obtained from the Mott-Schottky plots (Table 1).All these results indicate that the N D decreases and the E FB shifts positively with more ZnTe deposited on the ZnO nanorod surface, which is in favor of the anodic reaction on the ZnTe.Thus, it explains the higher PEC performance with more ZnTe amount. Furthermore, the width (W D ) of space charge region at 0 V can be calculated based on the E FB and N D using Equation 10.As shown in Table 1, the value of W D is larger than the nanorod diameter, which confirms the aforementioned conclusion that depletion region can extend throughout the whole ZnO and ZnTe.Moreover, the increases with the increase of the ZnTe amount.Considering the limited size of nanorods, this may suggest a stronger built-in electric field with increasing ZnTe, leading to larger photocurrent (Figs.5b,5c).So a thicker ZnTe thin film corresponds to a stronger built-in electric field, which is beneficial for charge separation, and this is the reason that ZnO/ZnTe-3min displays the highest performance among all the heterostructures. Furthermore, the correlation between the space charge region and charge behavior is discussed in detail.Small spikes in the photocurrent curves upon illumination can be observed (Figs.5b,5c).The photogenerated electron-hole pairs will remodel the band structure upon illumination and, thereby, influence the photocurrent behavior.Upon illumination, the photoinduced holes transfer to the ZnTe surface and electrons to the ZnO under the built-in electric field (Fig. 7b).Then the holes accumulate at the film/electrolyte interface, which will result in the decreased built-in electric field and, thus, the decreased photocurrent.It is pointed out that the increase in the initial transient photocurrent is related to the charge separation or bulk recombination 42,43.Since the serious charge recombination will consume plenty of electron-hole pairs, the spike in the photocurrent is not noticeable for ZnO. However, the spikes become more evident for the ZnO/ZnTe heterostructures than ZnO (Figs. 5b, 5c), demonstrating their superior charge separation ability to ZnO. The as-prepared samples are used for the photocatalytic reduction of CO 2 into hydrocarbon fuels under visible-light irradiation ( 420 nm), for which the redox thicker ZnTe film prepared via longer growth time may lead to higher photocurrent and photocatalytic activity, some of the ZnTe can fall off from the ZnO nanorods during both synthesis and CO 2 reduction since such a film is not mechanically stable. Thus, in this work no longer time than 3 min was used for ZnTe deposition. In addition, it is found that the activity for CO 2 photoreduction decreased to some degree when the catalyst was used for the second time (Fig. S3), indicating the system is not very stable, which can also be confirmed by the decay observed in the photocurrent density shown in Fig. 5b and5c.As the changes in the XRD patterns upon CO 2 reduction can hardly be noticed (Fig. S4), the oxidation amount of ZnTe did occur.Other reason may be the obscission of some ZnTe from the ZnO nanorods and/or the changes in surface states upon CO 2 reduction, while all these need further investigation."
  },
  {
    "title": "Conclusions",
    "content": "In ZnO nanorod arrays and ZnTe was prepared by one-step electrodeposition and different amount of ZnTe was coated on the surface of the ZnO nanorods.The charge dynamics including generation, separation and transfer was studied by various electrochemical techniques, which confirmed the effectiveness of the ZnO/ZnTe heterojunction.Furthermore, a band structure model was put forward in terms of the capacitance results to interpret the charge dynamics.It is pointed out that ZnTe lies in M A N U S C R I P T A C C E P T E D ACCEPTED MANUSCRIPT 6 PDF36-1451).The strong hexagonal diffraction peak at 2 34.42corresponds to the (0002) plane, implying the c-axis growth orientation of the ZnO nanorods.For the ZnO/ZnTe heterostructures, other than the diffraction peaks from the Wurtzite ZnO, the peak at 2 25.26 is attributed to the diffraction from (111) plane of the cubic ZnTe (PDF15-0746).Moreover, the intensity of ZnTe (111) increases with the raise of the ZnTe deposition time, demonstrating the increase of the ZnTe amount. Fig.2shows SEM images of the ZnO nanorods before and after ZnTe deposition. Fig. 2a displays nearly perpendicular growth of ZnO nanorod arrays on the FTO vs h plots, which is 3.21 eV for ZnO and 2.23 eV for ZnTe (Insets of Fig. 5a).It is noted that the ZnO/ZnTe heterostructures exhibit greatly enhanced light absorption due to the modification of the narrow bandgap ZnTe, as compared to the pristine ZnO in the visible-light region.In addtition, the charge generation increases with the increasing amount of ZnTe on the ZnO nanorods, with ZnO/ZnTe-3min reaches the maximum.Charge separation The heterojunction induced charge separation can be reflected by photocurrent results.Figs.5b and 5c display the transient photocurrent under both full spectrum and visible light illumination.There is no signal for ZnO under visible light since it is only UV light responsive.The heterostructured samples exhibit considerable anodic response to the light in both illumination cases due to the n-ZnO/p-ZnTe junction with the built-in electric field from n-ZnO to p-ZnTe.It is noted that the ZnO/ZnTe heterostructures have shown greatly enhanced photocurrent in both cases than the pristine ZnO, indicating better performance in the charge separation.The photocurrent increases with the increase of the ZnTe amount, thereby, demonstrating enhanced charge separation behavior with more ZnTe. separation or recombination possibility, IMPS at short circuit state is further employed to evaluate the PEC performance.The charge transfer time ( d ) can thus be reached by the average time for the photogenerated charge carriers taking to reach the back contact, i.e., d (2 f min (IMPS)) -1 , where f min is the frequency at the minimal value in the IMPS plot.Fig.5fdisplays the IMPS characteristics for ZnO and ZnO/ZnTe heterostructures.The minimal value of frequency is marked in each plot, and the corresponding d is determined to be 10.9, 8.4, 5.1 and 4.0 ms for ZnO, ZnO/ZnTe-1min, ZnO/ZnTe-2min and ZnO/ZnTe-3min, respectively.The less transfer time for ZnO/ZnTe than pristine ZnO indicates that the construction of heterojunction can facilitate the charge transfer to counter electrode and, thereby, the separation of electron-hole pairs is enhanced.Moreover, it is noted that the charge transfer rate becomes much faster with more ZnTe in the heterostructure.The ZnO/ZnTe-3min by the photoexcitation and utilization of photogenerated electrons and holes is utmost important.Fig.S2illustrates the GC curve of CO 2 reduction over different samples at the 8th hour.Only one product is observed with the retention time at 6.6 min, which is ascribed to methane (CH 4 ).Fig.8shows the resultant CH 4 production over time.No product can be detected for pristine ZnO because it is visible-light unresponsive.The samples can show the production of CH 4 when ZnTe is deposited onto ZnO, while the yield over the ZnO/ZnTe-1min sample is too low to reach the detection limit of the GC instrument due to its little amount of ZnTe.ZnO/ZnTe-2min demonstrates considerable CH 4 production yield, which grows over illumination time.The CH 4 evolution yield increases when the amount of ZnTe further increases in the ZnO/ZnTe heterostructure.Here the ZnO/ZnTe-3min sample reaches the maximum yield of 0.04 mol/cm 2 upon 8 h illumination, which is consistent with the aforementioned trend in PEC performance.Although ideally a low to be detected by the XRD, if the superficial oxidation of Te 2-to Te 4 Figure captions Fig. 2. SEM images of (a) ZnO nanorods and (b) ZnO/ZnTe-3min.Insets on the right Fig. 3. TEM images of (a) ZnO nanorod and (d) ZnO/ZnTe-3min heterostructure, Fig. 4. Schematic illustration of cathodic deposition of ZnTe on the ZnO nanorods Fig. 6.Mott-schottky plots for (a) ZnTe, and (b) ZnO and ZnO/ZnTe heterostructures Fig. 7. Schematic presentation of (a) electronic band structure of ZnO/ZnTe in the Fig. 8.Yields of CH 4 for CO 2 photoreduction as a function of reaction time over ZnO Parameters (N D , E FB and W D ) calculated from the Mott-Schottky plots shown in Fig. 6b for the ZnO and ZnO/ZnTe heterostructures (1min, 2min and 3min). Fig. 1. summary, ZnO nanorod/ZnTe heterostructures are successfully prepared by electrodeposition method.UV-vis absorption and photoelectrochemical measurements are performed to investigate the dynamics of photoinduced charge carriers, including charge generation, separation and transfer.The results indicate superior performance of ZnO/ZnTe to pure ZnO because the construction of the ZnO/ZnTe heterojunction is in favor of charge generation, separation and transfer.The more ZnTe content, the This work was supported by the Ministry of Science and Technology of China (2015DFG62610). Supplementary data associated with this article can be found in the online"
  }
]