[
  {
    "title": "Doi",
    "content": "10.1021/acssuschemeng.0c04042"
  },
  {
    "title": "Article_Title",
    "content": "Construction of Nano-Fe<sub>2</sub>O<sub>3</sub>-Decorated Flower-Like MoS<sub>2</sub> with Fe–S Bonds for Efficient Photoreduction of CO<sub>2</sub> under Visible-Light Irradiation"
  },
  {
    "title": "Abstract",
    "content": "A p-n hetero-structured -Fe2O3/MoS2 composite via Fe-S bonds was developed as a highly efficient CO2 photoreduction catalyst driven by visible light.The -Fe2O3 nanoparticles were embedded between the flower-like MoS2 layers, benefitting for the uniformly dispersion of themselves and meanwhile, promoting the formation of 1T-MoS2.The construction of p-n heterostructure caused by Fe-S bonds led to the close contact between -Fe2O3 and MoS2, in which -Fe2O3 was capped with few MoS2 layers, and enhanced the segregation and transportation of photo-induced electrons and holes.As a result, 5FM photocatalyst (5 wt. -Fe2O3 loading on MoS2) exhibited an"
  },
  {
    "title": "Experimental",
    "content": "Chemical and materials.Sodium molybdate dihydrate (Na2MoO42H2O), thioacetamide (C2H5NS), citric acid monohydrate (C6H8O7H2O), iron trichloride hexahydrate (FeCl36H2O) and sodium acetate anhydrous (C2H3O2Na) chemicals were provided from Shanghai Sinopharm Group in analytical grade without further purification.Deionized water (H2O) after Milipore system purified was used throughout the experiments. Synthesis of -Fe2O3.Pure -Fe2O3 was synthesized by the hydrothermal method as reported. 19Typically, 0.6825 g FeCl36H2O was dissolved in the mixed solution contained 25 mL H2O and 5 mL CH3CH2OH under magnetic stirring.Then, 2 g CH3COONa was added into the solution and stirred for another 0.5 h.The suspension was sealed in a 50 mL Teflon autoclave and reacted at 180 o C for 24 h.After cooling down naturally, the product was obtained under the centrifugation whilst washing with distilled water and ethanol for several times.The obtained catalyst was named as FeO. Synthesis of flower-like MoS2.First, 1 g of Na2MoO42H2O and 1.4 g of C2H5NS were dissolved in 70 mL H2O to obtain a clear solution.Then, 0.94 g of citric acid monohydrate was dispersed in the above solution.Subsequently, the mixed solution was transferred into 100 mL sealed Teflon containers and hydrothermally reacted at 200 C for 24 h.After the reactor was cooled to room temperature, the as-prepared catalyst was centrifuged, washed with ethanol and H2O for several times.The catalyst was obtained after drying at 60 C in a vacuum oven overnight, which was labelled as MS. Synthesis of -Fe2O3/MoS2.The composites of -Fe2O3/MoS2 was prepared via an in-situ hydrothermal preparation, similar to the synthesis of MoS2.The as-prepared -Fe2O3 was added into the mixed solution together with Na2MoO42H2O and 1.4 g of C2H5NS, and the rest of the process was same as the above statement.The adding amount of -Fe2O3 was set as 1, 5 and 10 mass ratios to the prepared MoS2, which were named as 1FM, 5FM and 10FM, respectively."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Morphology and crystal structure analysis.The morphologies of all samples were observed via SEM characterization, as shown in Figure 1.Sole MoS2 displays the apparent flower-like shape while sole -Fe2O3 exhibits the obvious morphology with nanoparticles.The other -Fe2O3/MoS2 composites mainly displays the flower-like shape, similar to the sole MoS2.However, according to the morphology of each component, some nanoparticles corresponded to -Fe2O3 can be observed between the layers of MoS2, especially in 5FM and 10FM catalysts.Moreover, the appeared number of nanoparticles augments with the increase of -Fe2O3 loading amount on MoS2.The crystal structures of all samples were investigated via the wide angle XRD characterization, as shown in Figure 2(a).For MoS2-contained catalysts, the peaks at 32.7 o and 58.3 o are respectively indexed to (1 0 0) and (1 1 0) planes of MoS2 according to JPCDS No. 37-1492.For sole MoS2, the peak at 14.4 o is ascribed to the (0 0 2) plane of its 2H phase.For -Fe2O3/MoS2 composites, the peak at 14.4 o disappeared and two new peaks can be observed at 9.1 o and 18.5 o .Previous studies revealed that the peaks at 9.1 o and 18.5 o can be attributed to (0 0 2) and (0 0 4) plane of 1T-MoS2, respectively, which is caused by the expansion of interplanar distance. 20Compared with sole MoS2, the addition of -Fe2O3 promoted the change of the crystal structure of MoS2 from 2H to 1T.Previous work 21 confirmed that the 1T (metallic) phase displayed higher mobility for charge transport and more stable photocatalysis performance.For sole -Fe2O3, the observed peaks are well matched with the hexagonal iron oxide structure (JCPDS No. 33-0664).Seen from the XRD patterns, the peaks attributed to -Fe2O3 in 1FM are hard to see.They are a little more obvious in 5FM.The main reason of this phenomenon is the low content of -Fe2O3 and the resulting weak characteristic peaks.In addition, it is due to the high dispersion of -Fe2O3 on the composites 1FM and 5FM.As the loading amount of Fe2O3 increases, the intensity of peaks assigned to -Fe2O3 increases. They are apparent over 10FM sample, which indicates that the high -Fe2O3 loading amount do not benefit for the dispersion of -Fe2O3 on MoS2.Energy dispersive spectroscopy (EDS) and elemental mapping were applied to confirm the existence and the dispersion of -Fe2O3 on MoS2, as shown in Figure 2(b c).The results demonstrated that -Fe2O3 exists on MoS2 with appropriate content and uniform distribution in 5FM sample.Thus, the obtained mapping results are in accord with XRD analysis.The phenomenon of the close interface contact between -Fe2O3 and MoS2 can be observed intuitively from HR-TEM images, as displayed in Figure 3.The morphology of -Fe2O3/MoS2 composites in nanoscale mainly exhibits the shape of nanoparticle, and the average size is around 53 nm.In Figure 3(b c), it can be seen that -Fe2O3 nanoparticles are capped with MoS2 layers, which confirms the intimate contact between -Fe2O3 and MoS2 directly.The close interface contact may benefit for the fast separation and transport of carriers, 5 thus enhancing the photocatalytic performance. The crystal lattice fringes corresponding to -Fe2O3 and MoS2 can be seen from HR-TEM in Figure 3(c).The layered MoS2 displays the interlayer distance of 0.92 nm, which is assigned to (0 0 2) crystal planes of 1T-MoS2. 22While the -Fe2O3 nanoparticle exhibits the interplanar distance of 0.25 nm, which is indexed to the (1 1 0) plane.From Figure 3 rings attributed to MoS2 are found, which is consistent with its weak crystal diffraction peaks resulted from the low crystalline quality, as observed on XRD patterns.In summary from all the above analysis, it can be concluded that the heterostructure between -Fe2O3 and MoS2 was formed.Band structure analysis.It is well known that the optical absorption capacity and the band structure of the catalysts exhibits the significant role during the photocatalysis reaction, thus UV-vis DRS characterizations over all samples were applied on the investigation of optical absorption capacity, as shown in Figure S1.Sole -Fe2O3 displays effective light absorption in the region smaller than 550 nm. 5,18Sole MoS2 and -Fe2O3/MoS2 composites exhibit similar absorption spectra with strong absorption intensities in the whole range, which are consistent with the results of MoS2 reported in these literatures. 23,24In the visible light region, the absorption intensity of -Fe2O3 is lower than that of MoS2.When compared to sole MoS2, the light absorption intensities of -Fe2O3/MoS2 composites are all slightly lower owing to the loading of -Fe2O3. Moreover, as the amount of -Fe2O3 increases, the light absorption intensity decreases slightly in the visible light range.As shown in Figure S2, the addition of -Fe2O3 increases the band gap of -Fe2O3/MoS2 composites according to the Tauc plots converted from the UV-Vis spectra.However, even for 10FM, it still has very effective light absorption capacity. The specific band structures of sole MoS2 and -Fe2O3 were explored, as displayed in Figure 4.The valence band positions (EVB) of sole MoS2 and -Fe2O3 were investigated via VB-XPS profiles, which were obtained as 0.54 eV and 1.55 eV, respectively.The band gap (Eg) of sole MoS2 and -Fe2O3 were obtained based on eq 1, 25 exhibiting the values of 1.13 eV and 2.01 eV separately.Hence, the conduction band positions (ECB) of MoS2 and -Fe2O3 could be calculated according to eq 2, which were -0.59 eV and -0.46 eV, respectively.More information such as Fermi level (Ef) was obtained from Mott-Schottky measurements, as shown in Figure 4 MoO3 or MoO4 2-. 28The peak around 226 eV is attributed to S 2s of MoS2. 29The additional peak around 233 eV appeared in sole MoS2 could be assigned to 2H-MoS2. 30nerally, the peaks corresponding to Mo 3d5/2 and Mo 3d3/2 could also be fitted into two separate peaks, in which the peak at high binding energy (BE) is ascribed to 2H MoS2 whilst the peak at low BE (about 1 eV) is ascribed to 1T MoS2 30 and this could be concluded that, 1T-MoS2 and 2H-MoS2 co-existed for MoS2, but 1T-MoS2 is the main phase after the loading of -Fe2O3, which is in accord with XRD analysis. Moreover, the peak corresponding to MoO3 or MoO4 2-becomes weak and all peaks shift to low BE after -Fe2O3 was loaded on MoS2.The above phenomenon further confirms the close contact between -Fe2O3 and MoS2.The S 2p spectra are fitted into three peaks, in which the peaks at about 162 eV and 163 eV are indexed to S 2p3/2 and S 2p1/2 of S2 -.The peak around 169 eV is ascribed to S2 2-, indicating that S-rich MoS2 has been prepared successfully. 31For the Fe 2p spectra, two distinct peaks at about 711 eV and 724 eV are attributed to Fe 2p3/2 and Fe 2p1/2 of -Fe2O3. 32Two main peaks are found in O 1s spectra, in which the peak at low BE is ascribed to lattice oxygen and the peak at high BE is attributed to chemisorbed oxygen. 25Combined with S 2p, Fe 2p and O 1s spectra, after the loading of -Fe2O3, the peaks in both Fe 2p and S 2p spectra shift to lower BE value while the peaks in O 1s spectra shift to higher BE value.Since the S element is enriched in MoS2, it can be concluded that the Fe-S bonds are formed in -Fe2O3/MoS2 composite.The formation of Fe-S bonds could convert the iron ions from Fe 3 to Fe 2 , thus causing the decrease of BE on 5FM.The electrons, which make the conversion, come from the O atoms.Therefore, the peaks in the O 1s spectrum of 5FM show great shifting to high BE as observed.The S elements to generate Fe-S bonds come from S2 2-, appeared in MoS2, which means that S2 2-is converted into S2 -.Hence, the intensity of the peak corresponding to S2 2-becomes weak after -Fe2O3 is loaded and leads to the phenomenon that the peak shift to low BE.While, Yang et al. 23 have proposed an explanation that at the process of hydrothermal synthesis, anion exchange reaction occurred; small amount of S 2-replaced the O 2-in Fe2O3.The conclusion of the formation of Fe-S bonds deeply demonstrated the construction of heterostructure between -Fe2O3 and MoS2 and their close contact. The electrochemical impedance spectroscopy (EIS) and photocurrent (PC) test were adopted to explore the transfer and segregation efficiency of charges.As shown in Figure 7(a), the sole MoS2 and sole -Fe2O3 display large radius of the curves, indicating the strong resistance, which is not beneficial for the transfer of carriers. 33wever, after the combination of MoS2 and -Fe2O3, the resistance of the catalysts is weakened, indicating that the formation of hetero-structured -Fe2O3/MoS2 composites promote the transfer of carriers.Among all catalysts, 5FM exhibits the weakest resistance, meaning the strongest carriers transfer ability.The intensity of PC can reflect the segregation of electrons and holes directly, and generally the strongest intensity, the most efficient separation. 34Therefore, the -Fe2O3/MoS2 composites display more efficient segregation of photoinduced electrons and holes than two separate sole materials, and among the composites, 5FM is the optimal one for possessing the strong ability to separate the carriers.As referred in the literatures 23,35 , the improved photocatalytic activity is mainly due to the staggered alignment of band edges of Fe2O3/MoS2 heterojunction and the efficient interfaces between these two constituents, which are propitious to the facile charge transfer pathway and the reduced carrier recombination.VLPCR improvement mechanism.The enhanced CO2 photoreduction mechanism was investigated via in-situ DRIFTS, as shown in Figure 8(a).Five peaks can be found over the test on 5FM sample, in which the peaks at 1685 cm -1 , 1654 cm -1 , 1559 cm -1 , 1507 cm -1 and 1435 cm -1 are assigned to the adsorbed CO2 -species, adsorbed H2O, bidentate carbonates (b-CO3 2-), monodentate carbonates (m-CO3 2-) and bicarbonate (HCO3 -), respectively. 36It could be seen that the peaks corresponding to CO2 -and b- Regarding the photocatalytic reduction of CO2 with H2O, two main pathways for hydrogenation and deoxygenation were speculated. 37Based on the above phenomenon from in-situ DRIFTS, the VLPCR mechanism was much closer to the deoxygenation pathway as described below.CO2 was adsorbed on the surface and reacted with the photoinduced electrons to generate CO2 -.In addition, the b-CO3 2-was also formed by the adsorption of CO2 on surface.Meanwhile, the adsorbed H2O was decomposed into H and OH by the photoinduced holes.In addition, among the VB positions of -Fe2O3 and MoS2, only the former is more positive than the potential for the splitting of H2O.Therefore, the adsorbed H2O was mainly dissociated on the active sites of -Fe2O3 and also the generation of CO2 -and HCO3 -intermediates there.Then CO2 -could react with OH to generate HCO3 -, and b-CO3 2-was converted into m-CO3 2-.The generated HCO3 -could be also originated from the reaction between m-CO3 2-and H.Then the formed HCO3 -was reduced by the photo-induced electrons to form the carbon free radicals (C(ads)).Then CH4 could generate via the interaction between C(ads) and H. 36,37During the hydrogenation process, the formed CH3 was reacted with OH to generate CH3OH. 36,37From the above deduction, it could be found that -Fe2O3 species were the main active sites during the generation of CH4 and CH3OH. Moreover, the construction of p-n heterostructure between MoS2 and -Fe2O3 via the Fe-S bonds could make the photo-induced carriers to be much more activated and move easily.Hence the enhanced VLPCR performance was displayed.The above reaction mechanism is illustrated in Figure 8"
  },
  {
    "title": "Conclusions",
    "content": "In a word, a p-n hetero-structured -Fe2O3/MoS2 composite has been synthesized successfully via a simple in-situ hydrothermal method, which was adopted as an efficient photoreduction of CO2 catalyst under visible-light illumination.Kinds of characterizations confirm that -Fe2O3 nanoparticles are uniformly dispersed between the MoS2 layers in the condition of appropriate loading amount, and in the nanoscale, -Fe2O3 is capped with few MoS2 layers.Moreover, the loading of -Fe2O3 promotes the phase of MoS2 converted from 2H to 1T.The above phenomenon is ascribed to the close contact between -Fe2O3 and MoS2 via the Fe-S bonds.The construction of p-n heterostructure between -Fe2O3 and MoS2 could make the generation of CH3OH during the VLPCR test, but also enhance the yield amount of CH4.The enhancement of VLPCR performance is attributed to the segregation and the transportation of the photo-induced electrons and holes being promoted.Among the -Fe2O3/MoS2 composites, 5FM sample displays the highest VLPCR result, which obtains 121 molh -1 g -1 of CH4 and 41 molh -1 g -1 of CH3OH.In addition, the VLPCR mechanism was investigated by in-situ DRIFTS, and it could be concluded that -Fe2O3 species are the main active sites during the generation of CH4 and CH3OH. Figure 1.SEM images of -Fe2O3/MoS2 composites with different -Fe2O3 loading amount. Figure 2. (a) XRD patterns of -Fe2O3/MoS2 composites with different -Fe2O3 loading amount. (d), two polycrystalline diffraction continuous rings can be observed, which are both corresponding to the -Fe2O3 nanoparticles.No diffraction Page 8 of 27 ACS Paragon Plus Environment ACS Sustainable Chemistry Engineering Figure 3. TEM, HRTEM and selected-area electron diffraction (SAED) images of 5FM sample. Figure 4. (a) Valence band (VB)-XPS data, (b) The plot of (Ahv) 2 vs. photon energy Figure 5. Photocatalytic CH4 and CH3OH evolution performance (a) and the selectivity (b) over Figure 6.XPS spectra of sole SrZrO3, sole MoS2 and 5FM.(a) Mo 3d; (b) S 2p; (c) Fe 2p; (d) O Figure 7. EIS (a) and photocurrent potential curves (b) of -Fe2O3/MoS2 composites with appear on the surface when only pure CO2 is added.The emergence of adsorbed H2O peak is caused by the H2O in atmosphere.After the reactant H2O is added, the additional peaks corresponding to m-CO3 2-and HCO3 -emerge whilst the intensities of the CO2 -and b-CO3 2-peaks decrease, which indicates that the addition of H2O could convert CO2 -and b-CO3 2-species into m-CO3 2-and HCO3 -.When the visible light is illuminated, the peak assigned to m-CO3 2-disappears suddenly and the CO2 -peak emerges again.After illumination for enough time, the m-CO3 2-appeared again, and the intensity of b-CO3 2-and H2O peaks become intense. Figure 8. In-situ DRIFTS spectra over 5FM (a) and Schematic diagram of the VLPCR test (b).Obviously, CH3 and OH radicals are two important intermediates of this reaction pathway.To gain more insight into the possible mechanism, the ESR spectra of 5FM powders under CO2/H2O coexisting conditions with different irradiation time were obtained as shown in Figure S3.Six characteristic peaks with similar intensity for CH3 and four characteristic peaks with the intensity ratio of 1:2:2:1 for OH were both detected under light for 30 min or 1 h in the 5FM sample. 38However, no obvious signals were detected without light irradiation.Furthermore, the intensities of CH3 and OH became higher with the increase of irradiation time, which indicates the amount of CH3 and OH species accumulated in the photocatalytic CO2 reduction process.The coexistence of CH3 and OH provides a direct experimental evidence for the generation of CH4 and CH3OH as well as the possible reaction pathway suggested in Figure 8(b). This work was financially supported by the National Natural Science Foundation of China (51808296 and 51802160), the Natural Science Foundation of Jiangsu Province of China (BK20170938), the 63rd Chinese Postdoctoral Science Foundation (2018M630487), the Startup Foundation for Introducing Talent of NUIST (2243141601034 and S8113082001), and College Students' Enterprise and Entreprenuership Education Program of NUIST (201910300216)."
  }
]