[
  {
    "title": "Doi",
    "content": "10.1039/c6ra02763f"
  },
  {
    "title": "Article_Title",
    "content": "Hybrid mesoporous Cu<sub>2</sub>ZnSnS<sub>4</sub> (CZTS)–TiO<sub>2</sub> photocatalyst for efficient photocatalytic conversion of CO<sub>2</sub> into CH<sub>4</sub> under solar irradiation"
  },
  {
    "title": "Abstract",
    "content": "A major concern facing global society is the ongoing, excessive release of CO 2 into the atmosphere where it acts as a heat-trapping greenhouse gas.One approach to helping control atmospheric CO 2 concentrations is to use solar energy to convert CO 2 into useful products, namely hydrocarbons, by use of specifically designed photocatalytic materials.While numerous photocatalysts have been investigated for use in CO 2 reduction, the field remains in it's infancy with, overall, relatively poor photoconversion efficiencies and product selectivity.This study reports the synthesis and design of a mesoporous noble metal free p-type Cu 2 ZnSnS 4 (CZTS)/ntype TiO 2 heterojunction photocatalyst for broad spectrum light absorption, enhanced charge separation and transfer that, in turn, enhances photocatalytic CO 2 conversion.A maximum methane production rate of 118.75 ppmg -1 h -1 is observed, which represents a methane evolution rate approximately 12 times greater than that of pure TiO 2 .The key factors contributing to the enhanced photocatalytic performance seen in the mesoporous CZTS-TiO 2 samples include improved light absorption, high surface area, and effective charge separation."
  },
  {
    "title": "Experimental",
    "content": "Copper (II) acetylacetonate (99.99),Zinc acetate (99.99),Tin (IV) acetate (99), Oleylamine (OLA, 70), Trioctylphosphine oxide (TOPO, 99) and Titanium (IV) chloride (99.99), and all chemicals, were purchased from Sigma Aldrich and used without further purification. CZTS nanocrystals were synthesized by the hot-injection method. 23All reaction conditions were kept under inert atmosphere to prevent the formation of oxides.In a typical synthesis, a mixture of 0.5 mmol Cu(acac) 2 , 0.25 mmol Zn(OAc) 2 , 0.25 mmol Sn(OAc) 4 , and 4.0 mL OLA was prepared in a 25.0 mL 3-neck round-bottom reaction flask and heated under vacuum to 150C for 30 minutes.A change in the color of the metals solution was observed from blue to brown-green. The temperature was lowered to 125C and the mixture remained at this temperature under vacuum until injection.In a 5.0 ml scintillating vial, 1.0 mM sulfur powder was sonicated for 30 minutes with 1.0 mL OLA to achieve its complete dissolution resulting in an orange-red solution. In a 50.0 mL 3-neck round-bottom reaction flask, 10mM TOPO was heated to 300C on an argon Schlenk line.When the temperature of the TOPO reaction flask reached 100C, the flask was pumped and purged three times in order to remove any adsorbed water vapors and impurities, then flushed with Ar and kept under argon for the remainder of the experiment.When the TOPO reaction temperature reached 300C, the S and metal precursors were rapidly injected simultaneously via two gas-tight Luer-Lock syringes.The reaction solution immediately changed from clear and colorless to a clear dark brown solution.All the aliquots were taken out using a syringe.18.0 mL methanol was added to the aliquots to precipitate the nanocrystals, followed by 10 minutes of centrifugation at 3500 rpm.The supernatant, containing unreacted material was discarded, while the remaining precipitate was then redispersed in 8.0 mL toluene to which 10.0 mL methanol was again added and the solution centrifuged for 10 minutes.This process was repeated for a total of three washes.The final precipitate was re-suspended in toluene and then centrifuged for 10 minutes to remove any agglomerated or bulk constituents. As synthesized CZTS nanocrystals were oven dried at 80C overnight to remove toluene and obtain a powder of CZTS nanocrystals.CZTS-TiO 2 samples were prepared by mixing various amounts of CZTS powder in fixed volume i.e. 0.1 ml of TiCl 4 under argon atmosphere for 1 h. The samples were named as CT1, CT2, CT3 and CT4 standing for 1.9 mg, 3.8 mg, 5.7 mg and 7.6 mg of CZTS in 0.1 ml of TiCl 4 respectively.The various obtained samples were dried at 50C in order to remove toluene and then were annealed at 350C (rate time: 5C/min, holding time 1h under argon gas flow of 30 cm 3 /min). The crystalline structure of the materials are analyzed by powder X-ray diffractometry (XRD, Panalytical, Empyrean; operating at 40 kV and 30 mA with Cu K radiation, 1.54A, as an Xray source, scanned with a rate of 1/min in the range of 2 10-70).High resolution images are obtained using field emission transmission electron microscopy (FE-TEM, Hitachi HF-3300) operating at 300 kV.For FE-TEM analysis, the samples are prepared by dispersing in ethanol followed by mild sonication.The dilute suspension is dropped on a TEM Cu mesh grid and allowed to dry overnight.The pore volume is determined from the amount of N 2 adsorbed at the highest relative pressure of (P/P0) 0.99.The BJH pore diameter is obtained by applying the Barrett-Joyner-Halenda (BJH) equation to the desorption isotherm.The surface composition and oxidation states are determined by X-ray photoelectron spectroscopy (XPS, Thermo VG, K-alpha) using the Al K line (148606 eV) as the X-ray source. Photocatalytic CO 2 conversion experiments are performed in a gas phase reactor as reported earlier 24 .In short, the photoreactor (stainless steel with quartz window, volume 15.4 cm 3 ) is loaded with a photocatalyst material (50 mg) and then purged with CO 2 gas (1000 ppm in He) and vacuum simultaneously to remove any air or other impurities.CO 2 gas (1000 ppm in He) is passed through a water bubbler, forming a mixture of CO To examine photocatalyst stability, under otherwise identical experimental conditions sample CT4 was illuminated for 5 h and 10 h durations."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Fig. 2 shows a transmission electron microscopy (TEM) image of as-synthesized CZTS nanoparticles; one sees anisotropic shapes with an average size of 13 nm.High resolution transmission electron microscopy (HRTEM) indicates an interplanar spacing of 3.1 A corresponding to d 112 of CZTS (Fig. 2b). 20The selected area electron diffraction (SAED) pattern supports the polycrystalline nature of CZTS by displaying rings indexed to d 112 , d 220 and d 312 of CZTS, respectively (Fig. 2c). 25The TEM image of representative hybrid CZTS-TiO 2 , sample CT4, synthesized from 7.6 mg CZTS in 0.1 ml TiCl 4 , clearly demonstrate the post-annealing mesoporous nature (Fig. 2d).The obtained mesoporosity of the hybrid system can be attributed to the removal of the capping ligands during annealing, imparting both the mesoporous nature and hybridization of TiO 2 with CZTS.Fig. 2e is a HRTEM image of a hybrid CZTS-TiO 2 sample, showing a lattice spacing of 3.1A and 3.5A, corresponding to d 112 plane of CZTS and d 101 plane of TiO 2 respectively. 20,26The selected area electron diffraction (SAED) pattern show rings which can be indexed to d 112 plane of CZTS, 20 and d 101 plane of anatase TiO 2 25,27 further assuring the formation of hybrid CZTS-TiO 2 structure (Fig. 2f).The mesoporous nature of all annealed CZTS-TiO 2 samples is confirmed by TEM (Fig. S2).The atomic composition of sample CT4, obtained using FESEM-EDS, is shown in Fig. S3; the rectangular region scan shows strong peaks associated with Cu, Zn, Sn, S, Ti and O. However, the atomic ratios of Sn and S in CZTS are less than anticipated, which we suggest can be attributed to diffusion of SnS/S 2 gases due to in-situ annealing while being FESEM-EDS imaged, 28 or while sample-annealing under argon atmosphere for CT4 synthesis.We are not the only investigators to encounter this; a loss of Sn and S is reported to be one of the critical problems encountered during CZTS synthesis. 29,30 he UV-Vis diffuse reflectance spectra (DRS) of bare TiO 2 annealed under air and argon atmosphere is shown in Fig. S4 and it exhibits a steep absorption edge in the range of 380-420 nm, corresponding to the fundamental bandgap of 3.2 eV. 27That the as-prepared TiO 2 nanoparticles absorb in the visible region can be attributed to the Urbach band tail, arising from the momentary localization of excitons due to phonon interaction. 34,35g. 5a shows the absorption spectrum of pure CZTS nanoparticles, showing broad absorption in the visible light range.The bandgap of the CZTS nanoparticles is estimated using the Tauc relationship, resulting in a band gap of 1.5 eV, a value consistent with reported literature values (1.45-1.6 eV). 23In case of hybrid CZTS-TiO 2 , a prominent enhancement in light absorption is observed in the visible light range (400-700 nm) with the increase in CZTS (Fig. 5b); the degree of CZTS content strongly affects the visible light absorption of TiO 2 leading to a red shift in the absorption spectrum.Further evidence indicating a hybrid CZTS-TiO 2 material comes from X-ray photoelectron spectroscopy (XPS) data of sample CT4 (Fig. 6).The Ti 2p region shows two main peaks located at 463.9 eV and 458.3 eV corresponding to the Ti 2p 1/2 and Ti 2p 3/2 states respectively (Fig. 6a), while the O 1s region exhibits peak around 530.9 eV attributed to Ti(IV) ion bound oxygen, in TiO 2 (Fig. 6b). 32Cu 2p region with the main characteristic peaks located at 931.2 eV and 951 eV, attributed to Cu 2p 1/2 and Cu 2p 3/2 electronic states respectively with the peak separation of 19.8 eV, assuring the presence of Cu (I) (Fig. 6c). 33The XPS spectrum of Zn 2p splitting into two peaks appearing at 1020.9 eV and 1043.9 eV, can be assigned to Zn 2p 1/2 and Zn 2p 3/2 respectively (Fig. 6d).These two peaks display a peak separation of 23 eV, indicating presence of Zn (II). 34The XPS spectrum of Sn 3d with the peaks at 486.1 eV and 494.5 eV are attributed to Sn 3d 3/2 and Sn 2d 5/2 of Sn (IV), Fig. 6e. 36The S 2p region exhibits two main peaks appearing at 162.38 eV and 163.53 eV (Fig. 6f); these peaks can be assigned to S 2p 1/2 and S 2p 3/2 with a peak separation of 1.15 eV confirming the presence of S. 37 XPS spectra for the as-prepared TiO 2 nanoparticles and pure CZTS nanoparticles were investigated to confirm the presence of all the respective elements in their expected oxidation states (Fig S5 The Brunauer-Emmett-Teller (BET) surface areas are also measured for all hybrid CZTS-TiO 2 samples (Fig. S7 Table S1).The N 2 -sorption isotherms of all samples, shown in Fig. S5, are found to be of type IV according to IUPAC classification. 38The samples initially exhibit a monolayer adsorption, which is followed by a steep rise indicating the multilayer adsorption phenomenon.The multilayer adsorption is then followed by condensation within the mesoporous material at high relative pressures.Due to difference in pressure of capillary evaporation and condensation, the isotherm exhibits H3 hysteresis loops revealing the presence of plate like particles with slit-like pores. 38Among all samples, sample CT4 shows the highest surface area of 92.71 m 2 /g.Further, the surface area of the hybrid CZTS-TiO 2 samples increase with the addition of CZTS nanoparticles, indicating the CZTS nanoparticles are largely responsible for inducing the mesoporous nature of the hybrid samples. Photocatalytic activities of all hybrid CZTS-TiO 2 samples, TiO 2 , and CZTS samples are investigated by examining their ability to drive the photocatalytic conversion of CO 2 and water vapor into hydrocarbon fuels, under simulated AM1.5G solar light, with TiO 2 (synthesized from TiCl 4 precursor) and pure CZTS nanoparticles used as baseline reference samples (Fig. 7).Gas chromatography (GC) analysis of the products showed predominantly methane as a main hydrocarbon product.The rate of methane production from each sample is obtained after 1 h of solar illumination. It is obvious that all hybrid mesoporous CZTS-TiO 2 samples show an increase in CH 4 yield.On increasing the amount of CZTS in the hybrid samples CZTS-TiO 2 the CH 4 evolution increases, with highest value of methane evolution found for sample CT4 (118.75 ppm.g -1 .h -1 ), respectively 11.97 times and 9.7 times higher than TiO 2 (9.92 ppm.g -1 .h -1 ) and CZTS (12.29 ppm.g -1 .h -1 ). Illumination of sample CT4 in an Ar/H 2 O (g) atmosphere under similar conditions served as a control test, in which one can see a negligible amount of CH 4 , suggesting any organic impurities adsorbed on the surface of hybrid CZTS-TiO 2 composites having negligible involvement in the photocatalytic CH 4 evolution.Turnover numbers (TON) and turnover frequencies (TOF) for the hybrid CZTS-TiO 2 photocatalysts are obtained and presented in Table S2.Amongst hybrid photocatalyts, for 1 h illumination sample CT4 yielded a TON of 1.48 and TOF of 1.48 h -1 .Under extended illumination it is observed that the TON slightly increases after 5 h, reaching a value of 1.67, then decreases to 0.90 for 10 h of continuous illumination.It can be inferred from the control experiments that the CH 4 evolved during our normal experiments is mainly due to photoreduction of CO 2 and not a product of organic oxidation or surface bound organic species.The improved photocatalytic performance of our hybrid CZTS-TiO 2 samples can be inferred to: (1) improve light absorption; (2) enhance the surface area; and (3) improved charge separation via electric-field induced drift per formation of a p-n junction at the interface of p-type CZTS and n-type TiO 2 . Based upon these factors, an illustration of energy levels and suggested process for conversion of CO 2 and water vapor into methane is shown in Fig. 8.As revealed by XPS, hybrid samples contain both CZTS and TiO 2 ; the conduction band edge of CZTS is higher than the TiO 2 conduction band edge, while the TiO 2 valence band edge is more positive than the valence band edge of CZTS and the O 2 /H 2 O redox potential. 39Upon illumination, the photo-generated electrons in CZTS can easily flow to the conduction band of TiO 2 , and can reduce the adsorbed CO 2 whereas the holes migrate in the opposite direction to oxidize adsorbed H 2 O. Photoreduction of CO 2 is a multi-electron process, requiring reaction of 8 holes (h ) with adsorbed H 2 O, producing O 2 and H ions and reducing the CO 2 adsorbed on photocatalyst surface via reaction of 8 electrons (e -) and 8 protons (H ions), evolving CH 4 as the dominant product. 40mple stability is investigated by testing sample CT4 under up to 10 h of continuous illumination for CO 2 photoreduction (Fig. S8).It is observed that the methane production rate after 5 h illumination slightly increases from the 1 h value, whereas a 40 decrease in the methane production rate is observed after 10 h of continuous illumination.We are unsure of the origin of such behavior, but such behavior is not unusual in the realm of photocatalysts."
  },
  {
    "title": "Conclusions",
    "content": "We have successfully synthesized a hybrid mesoporous CZTS-TiO 2 photocatalyst using a simple two-step process.The hybrid CZTS-TiO 2 samples exhibit improved light absorption and mesoporosity mainly induced by CZTS content.The as-prepared samples are characterized by various analytical techniques such as XRD, TEM, UV-Vis DRS spectra, BET and XPS.A considerable enhancement in CO 2 conversion into methane under AM1.5G illumination is observed for the mesoporous CZTS-TiO 2 samples, which we attribute to improved light absorption, large surface areas which in turn promote higher interfacial reactions, and intrinsic formation of a p-n junction between the CZTS and TiO 2 regions with formation with suitable bandgap edge positions for improved charge separation.Our material synthesis strategy, and coupling of favorable semiconductors suggests an effective approach for design of high performance noble metal free photocatalyst materials. Fig. 1 Schematic showing the experimental strategy for synthesis of hybrid mesoporous CZTS- photoreactor.The photoreactor is exposed to simulated solar light irradiated by Xenon solar Fig. 2 TEM, HRTEM and SAED patterns of: (a-c) as synthesized CZTS nanoparticles; and (d-f) Fig. 3 EDX-STEM elemental mapping image of CT4 sample showing composition of: (a) Fig. 4 XRD pattern for as-synthesized CZTS, TiO 2 and hybrid CZTS-TiO 2 samples (CT1, CT2, Fig. 5 UV-Vis DRS spectra for: (a) as-synthesized CZTS nanoparticles, with the inset showing Fig S6);it is observed that all the corresponding peaks appearing for sample CT4, our representative sample, are in good agreement with the peaks of as-synthesized CZTS and TiO 2, thus assuring no significant change in the electronic states of the respective materials. Fig. 6 X-ray photoelectron spectroscopy (XPS) of CT4 sample with regions of: (a) titanium, (b) Fig. 7 Methane production rate for 1 h illumination from pure CZTS, TiO 2 and hybrid CZTS- Fig. 8 Schematic illustration for photocatalytic CO 2 conversion into methane by hybrid Published on 05 April 2016.Downloaded by University of Prince Edward Island on 05/04/2016 16:18:31.View Article Online DOI: 10.1039/C6RA02763F on 05 April 2016.Downloaded by University of Prince Edward Island on 05/04/2016 16:18:31. The elemental composition of sample CT4 is measured using the energy dispersive spectroscopy (EDS) attachment of the Hitachi S-4800 FE-SEM; the electron energy was 15 keV for the EDS measurement.UV-visible diffuse reflectance spectroscopy (DRS) of the materials is measured using a Cary series UV-visible near IR spectrophotometer with a diffuse reflection accessory.The N 2 sorption isotherms are measured at -196 oC on a Micromeritics ASAP 2000 apparatus, with the samples extensively degassed at 200 C prior to the experiments.Surface areas are calculated by the Brunauer-Emmett-Teller (BET) equation. on 05 April 2016.Downloaded by University of Prince Edward Island on 05/04/2016 16:18:31. Published on 05 April 2016.Downloaded by University of Prince Edward Island on 05/04/2016 16:18:31.View Article Online DOI: 10.1039/C6RA02763F The authors gratefully acknowledges the support by the DGIST RD Program of the Ministry of Education, Science and Technology of Korea (15-BD-0404) and by Basic Science research program through the National Research Foundation of Korea funded by the Ministry of Science, ICT Future Planning (2013R1A1A008678)."
  }
]