[
  {
    "title": "Doi",
    "content": "10.1016/j.jcou.2021.101561"
  },
  {
    "title": "Article_Title",
    "content": "Combination of Co2+-immobilized covalent triazine framework and TiO2 by covalent bonds to enhance photoreduction of CO2 to CO with H2O"
  },
  {
    "title": "Abstract",
    "content": "linking the inorganic semiconductor to the nitrogen-rich porous, conjugated and coordinating organic functionality.Co 2 -modified TiO 2 CTF-Py was an efficient photocatalyst for the reduction of CO 2 to CO with high selectivity using water as the electron donor and without exogenous photosensitizers or a sacrificial agent.The covalent connection between the semiconductors and NNN coordination group were important for this photocatalytic activity and selectivity."
  },
  {
    "title": "Experimental",
    "content": "Photocatalytic CO 2 reduction measurements were conducted under UV-vis irradiation (320 nm, 300 W Xe lamp, AuLight Co., China, CEL-HXF300).The temperature of the reaction system was maintained at 25 C with circulating water.In a typical experiment, 15 mg of TiO 2 CTF-Py and CoCl 2 (1.5 mM) were suspended in 30 mL H 2 O by sonication for 30 min and the resulting suspension purged with high-purity CO 2 for 30 min to remove air.The reaction vessel was then linked to a trace gas analysis system (Labsolar-6A, Beijing Perfect Light Technology Co., Ltd, China) and the mixture stirred in darkness for 4 h, allowing the interaction of M 2 with available nitrogen sites on TiO 2 CTF-Py.Subsequently, the above reaction solution was stirred for 4 h and irradiated.The gas products in the headspace of the reactor were measured using gas chromatography (GC7900, Tianmei, China) with an FID detector to quantify CO/CO 2 and a TCD detector to quantify H 2 . Other experiments and characterization techniques are described in the supplementary material."
  },
  {
    "title": "Results_and_Discussion",
    "content": "TiO 2 nanoparticles were prepared via a solvothermal treatment of tetrabutyl titanate with hydrofluoric acid following a literature method 44.These nanoparticles were modified by surface grafting of 3-aminopropyltriethoxysilane (APTES) to give amino-functionalized TiO (NH 2 -TiO 2 ).A series of covalently integrated TiO 2 CTF-Py hybrid materials were prepared in two steps (Scheme 1).Initially, one fifth of the PDDA (2,6-pyridinedimethanol, 0.5 mmol in total) and TPDH (terephthalamidine,1.0 mmol) was added into NH 2 -TiO 2 with stirring at C for 12 h to form prepolymer. Next, the remaining PDDA and TPDH was added into the seed mixture, and stirred at 120 C for 12 h and then at 160 C for 48 h to obtain x-TiO 2 CTF-Py (x 20, 40, 60, 80 or mg of added TiO 2 ).To investigate the importance of a covalent connection between the TiO 2 and CTF-Py, and of a NNN chelating group, blended hybrid material TiO 2 CTF-Py-f and NNN-group-free composite TiO 2 CTF-Ph were synthesized in a similar manner using unfunctionalized TiO 2 instead of NH 2 -TiO 2 or 1,3-benzenedimethanol (instead of PDDA, see the Supporting Information).TiO 2 /CTF-Py-m (\"m\" designates mixed) was obtained by grinding TiO 2 (60 mg) and CTF-Py (160 mg) at room temperature.Pure CTF-Py was synthesized by the oxidative polycondensation reaction 23 of 2,6-pyridinedimethanol (PDDA) with terephthalamidine (TPDH).Solid-state 13 C NMR spectroscopy (Fig. S1a, black line), indicated that the carbon signals of CTF-Py were in good agreement with those of model compound 2,4-di-phenyl-6-(pyridin-2-yl)-1,3,5-triazine (Fig. S1a, red line).The peak at 170.1 ppm is ascribed to the triazinyl carbon, confirming the formation of triazine units 37,39,46. The powder X-ray diffraction (PXRD) revealed that CTF-Py was amorphous (Fig. 1a, black line and Fig. S2).Four broad peaks at approximately 2 6.0 , 9.2 , 15.4 and 26.1 suggested the possibility of at least a partially layered structure.The PXRD patterns of TiO 2 and NH 2 -TiO 2 (Fig. 1a, red line and Fig. S3) exhibited reflections at 2 25.6 004), ( 200), ( 105), ( 211), ( 204), ( 116), ( 220) and ( 215) lattices (PDF-21-1272), of anatase TiO 2 47.A weak, broad diffraction peak at 2 26.1 for TiO 2 CTF-Py was attributed to CTF-Py.Compared with that of pure TiO 2 nanoparticles, the peak at 2 25.6 in TiO 2 CTF-Py was slightly shifted to a lower angle, suggesting a close interaction between CTF-Py and TiO 2 (Fig. 1a) 48. The FT-IR spectra of TiO 2 and NH 2 -TiO 2 (Fig. S4) contained strong peaks at 683 and 3400-3500 cm -1 originating from Ti-O bonds and surface hydroxyl groups, respectively 19,43.Compared with raw TiO 2 , the appearance of new peaks at 978 cm -1 (Ti-O-Si), 1529 cm - (-NH 2 ), and 2927 cm -1 (-CH 2 ) in the spectrum of NH 2 -TiO 2 indicated the successful grafting of APTES group on to the surface of the TiO nanoparticles 49.The FT-IR spectrum of CTF-Py has distinctive triazine absorptions at 1523 and 1367 cm -1 and the pyridine absorptions at 1407 and 1013 cm -1 (Fig. 2b, black line and Fig. S5a) 50.The presence of characteristic TiO 2 and CTF-Py peaks in TiO 2 CTF-Py confirmed the successful synthesis of hybrid materials (Fig. 2b). The specific surface area and porosity of as-synthesized samples were evaluated using N 2 adsorptiondesorption measurements at 77 K (Fig. 1c).The absorption isotherms of CTF-Py and TiO 2 CTF-Py Scheme 1. Synthesis of CTF-Py and TiO 2 CTF-Py. Z. Xu et al. exhibited reversible type-IV isotherms, indicating the micropore and mesopore structures.The Brunauer -Emmett -Teller (BET) surface area of 60-TiO 2 CTF-Py with 332 m 2 g -1 was smaller than that of CTF-Py (422 m 2 g -1 , presumably due to the presence of TiO 2 with low surface area (23 m 2 g -1 ) 51.The pore size of 60-TiO 2 CTF-Py was between ca 0.5 nm and ca 0.8 nm, which is consistent with that of CTF-Py (Fig. S6).The thermogravimetric analysis (TGA) curves (Fig. 1d) for TiO 2 CTF-Py and CTF-Py indicated thermal stability up to 600 C. The morphologies and microstructures of as-prepared samples were characterized by scanning electron microscopy (SEM) and transmission electron microscopy (TEM).The unfunctionalized TiO 2 exhibited nanomorphology with particle sizes below 200 nm in length (Fig. 2a).After APTES modification, NH 2 -TiO 2 nanoparticles appeared thicker than pure TiO 2 (Fig. S7).The SEM image of CTF-Py reflected its lamellar morphology (Fig. 2b).The dimension of each layer became smaller in 60-TiO 2 CTF-Py (Fig. 2c).TEM and high-resolution transmission electron microscopy (HRTEM) images of TiO 2 CTF-Py indicated that the TiO 2 nanoparticles were intimately in contact with the CTF-Py layers (Fig. 2d ande).The (001) and (101) lattice planes of anatase TiO 2 (d 0.235 and 0.351 nm, respectively) are clearly seen (Fig. 2e).The highangle annular dark field scanning TEM (HAADF-STEM) dark-field images (Fig. 2f) indicated Ti and O distributed inside the particles and N densely and evenly distributed on the outside.The energy-dispersive Xray spectroscopy (EDS) of 60-TiO 2 CTF-Py showed the Ti content to be 23.5 wt (Fig. S8a), which is comparable to the expected value from the proportion of reagents.The EDS element mapping indicated uniform distribution of C, N, Ti, Si and O in TiO 2 CTF-Py (Fig. S8b). The presence of Ti, Si, O, C and N in TiO 2 CTF-Py was confirmed by X-ray photoelectron spectroscopy (XPS) (Fig. S9, black line).The Ti 2p peak of NH 2 -TiO 2 can be deconvoluted into two peaks at 458.5 and 464.2 eV, ascribed to Ti 2p 3/2 and Ti 2p 1/2 spin-orbital splitting photoelectrons, respectively (Fig. 3a).The corresponding signals in TiO 2 CTF-Py shifted to higher binding energies of 458.39.The peaks in the N 1s region of his composite can be deconvoluted into two peaks at 398.9 and 399.8 eV (Fig. 3d), belonging to triazine/pyridinic N (C--N -C) and pyrrolic N, respectively 50,55.It is worth noting that the -NH 2 peak at 401.3 eV in the spectrum of NH 2 -TiO 2 disappeared in the spectrum of TiO 2 CTF-Py indicating complete reaction with 2,6-pyridinedimethanol.Furthermore, the Si 2p XPS peaks at 102.0 and 101.3 eV corresponding to Si-O and Si-C bonds, respectively, indicate the presence of the aminopropylsilane groups on the surface of the functionalized TiO 2 nanoparticles (Fig. S10) 56. The adsorption of CO 2 by TiO 2 CTF-Py (29.3 cm 3 g -1 ) at 298 K, was less than that by CTF-Py (37.8 cm 3 g -1 ) under the same conditions due to the mass contribution of TiO 2 particles, which hardly adsorb CO 2 (Fig. 4a).High CO 2 adsorption capability is favorable for photocatalytic conversion 57,58.The solid-state UV-vis diffuse reflectance spectrum of TiO 2 possessed an absorption edge at 400 nm and CTF-Py exhibited a broad absorption in the UV/Vis region with an absorption edge at approximately 550 nm (Fig. 4b).The absorption of light by TiO 2 CTF-Py was similar to that of CTF-Py.The band gap of TiO 2 and CTF-Py was calculated to be 3.26 and 2.52 eV using the Kubelka-Munk method.Mott-Schottky (MS) measurements determined the conduction-bands for CTF-Py and TiO 2 to be at -1.37 and -0.55 eV vs. NHE (Normal Hydrogen Electrode, Fig. S11).Combined with the band gap measurements for CTF-Py and TiO 2 obtained from UV/Vis absorption data, the valence-band position of these materials can be determined as 1.15 and 2.71 eV vs. NHE, respectively.Upon excitation at 365 nm, solid state CTF-Py exhibits an efficient emission at max 470 nm (Fig. 4c) 50.The photoluminescent intensity of emulsions of TiO 2 CTF-Py, TiO 2 CTF-Py-f and TiO 2 /CTF-Py-m were reduced to varying degrees compared with that of CTF-Py, indicating photoexcited-electron-transfer between CTF-Py and TiO 2 , with TiO 2 CTF-Py displaying the greatest quenching.The emission of TiO 2 CTF-Py dispersed in DMF was quenched by the addition of CoCl 2 with a quenching constant K sv of 122.46 M -1 , calculated from the linear region of I 0 /I vs. CoCl 2 (Fig. 4d and Fig. S12).Furthermore, the cyclic voltammetry (CV) of TiO 2 CTF-Py/CoCl 2 showed similar irreversible reduction waves under both N 2 and CO 2 atmospheres (Fig. S13), which can be assigned to the reduction of Co ions from Co II to Co I .The current increased under a CO 2 atmosphere after the Co II to Co I reduction wave, verifying the reaction of Co I with CO 2 in the electrochemical process 59.Electrochemical impedance spectroscopy (EIS) measurements indicated that TiO 2 CTF-Py possessed a Nyquist curve with the smallest semicircular diameter (Fig. 4e) (TiO 2 CTF-Py TiO 2 /CTF-Py-m TiO 2 CTF-Py-f TiO 2 CTF-Py), reflecting the smallest interfacial charge-transfer resistance, which is again consistent with the quenching of the fluorophore in this covalently bonded composite.Likewise, the order of photocurrent density was TiO 2 CTF-Py TiO 2 CTF-Py-f TiO 2 /CTF-Py-m CTF-Py TiO 2 (Fig. 4f).Taken together, these results illustrate that the covalently linked heterojunction in these composites effectively enhances electron-hole separation and inhibits electron-hole recombination, which can be attributed to an efficient electron transfer through the covalent bonds. The as-obtained hybrid materials were investigated as photocatalysts for CO 2 reduction in water under mild reaction conditions (25 C and atmospheric pressure of CO 2 ) and in the absence of a sacrificial reducing agent or added photosensitizer.TiO 2 , CTF-Py, x-TiO 2 CTF-Py (x 20, 40, 60, 80, 100) and TiO 2 CTF-Py-f were compared in this respect.Each sample (15.0 mg) was mixed with CoCl 2 (5.8 mg) and water (30 mL) and stirred for 4 h in darkness to obtain CoCl 2 -decorated photocatalysts.The resulting mixture was irradiated under UV-vis light ( 320 nm) under a high-purity CO 2 atmosphere and the resulting gas was quantified by gas chromatography (Fig. 5a).TiO 2 (26.0 mol g -1 ) and CTF-Py (33.2 mol g -1 ) produced very small quantities of CO.However, the TiO 2 CTF-Py composites efficiently reduced CO 2 to CO, dependent on the ratio of TiO 2 to CTF-Py.The rate of CO production increased from 15.76 mol g -1 h -1 to 26.3 and 43.34 mol g -1 h -1 when the proportion of TiO 2 increased from 20 mg to 40-60 mg.However, a further increase of TiO 2 to 80 and 100 mg caused a reduction in photocatalytic activity.This is presumably due to decreased CO 2 adsorption by these less porous hybrid materials.The 60-TiO 2 CTF-Py composite displayed the highest activity of 43.34 mol g -1 h -1 CO and selectivity of 98.3 (Fig. 5b, Sel CO n CO /(n CO n CH4 ) 100).The yield of CO product was 6.67 and 5.22 times higher than that produced by pure TiO 2 or CTF-Py, respectively.This CO production rate was also superior to many reported heterogeneous CO evolution photocatalysts, such as Co-ZIF-9/TiO 2 (17.58 mol g -1 h -1 ) 60, C-TiO 2 -xg-C 3 N 4 (27.2 mol g -1 h -1 ) 61, TiO 2 /CZnCo-ZIF-L (28.6 mol g -1 h -1 ) 62, TiO 2 /NH 2 -UiO-66 (4.25 mol g -1 h -1 ) 63 and others (see Table S1). In order to demonstrate the importance of the covalent bond between the two components of these hybrid materials, we investigated the photocatalytic performance of TiO 2 CTF-Py-f and TiO 2 /CTF-Py-m (Fig. 5c).The photocatalytic activity of TiO 2 CTF-Py was approximately 1.74 and 2.18 times higher than that of TiO 2 CTF-Py-f and TiO 2 /CTF-Py-m, respectively.Increasing amounts of Co 2 from 0 to 1.5 mM resulted in CO production increases to a maximum value of 173.37 mol g -1 (Fig. S14).However, excessive Co 2 (2.0 mM) led to decreased photocatalytic activity, presumably due to over-lapping light absorption by the Co 2 .When the photochemical reaction was conducted under a nitrogen atmosphere instead of CO 2 , there was no CO detected, confirming that CO was the product arising from CO 2 reduction (Table S2, entry 2).No CO 2 reduction was observed when this reaction was performed in the dark (Table S2, entry 3).Likewise, no CO was detected in the absence of TiO 2 CTF-Py (Table S2, entry 4).These control experiments indicated that the photocatalysts and visible light were indispensable for photocatalytic CO 2 reduction.The choice of metal cation also affected the photocatalytic CO 2 reduction activity (Fig. S15).Transition metals at active catalytic sites with a greater number of delectrons tend to lower the adsorption energy 64,65.Cobalt modified-CTF exhibits efficient CO 2 photocatalytic reduction, whereas the corresponding catalytic activity of nickel (Ni) and copper (Cu) modified-CTF photocatalysts are low 66,67.More importantly, TiO 2 CTF-Ph hybrid material showed similar low catalytic activity before and after adding CoCl 2 (Fig. S15), which indicates that the binding of metal is essential to photocatalytic CO 2 reduction. The stability of TiO 2 CTF-Py was investigated by recycling used samples under a refreshed reaction atmosphere every 4 h of continuous photocatalytic reaction (Fig. 5d).The recovered catalyst was withdrawn each time by centrifugation and washed sequentially with H 2 O, EtOH and Et 2 O.The catalytic activity of the second cycle was enhanced, relative to the first, which may be due to the further binding by Co 2 during the first photocatalytic cycle.After cycling 5 times, no obvious loss of catalytic activity was observed.After the fifth time, the recovered catalyst was characterized by XPS (Fig. S9, red line).The peaks at 796.3 and 781.2 eV were assigned to Co II 2p 1/2 and Co II 2p 3/2 , respectively (Fig. S16) 68.The N 1s XPS core level binding energy shifted to a higher value (398.79-398.91 eV) upon Co loading (Fig. S17a), suggesting that Co and N atoms in the TiO 2 CTF-Py hybrid materials have a relatively strong interaction 69.Correspondingly, the N 1s XPS spectra of TiO 2 CTF-Ph did not show any shift before and after reaction (Fig. S17b).No Co nanoparticles were detected in the TEM image (Fig. S18).SEM, PXRD and FT-IR analyses (Fig. S19-21) indicated that the framework structure and crystallinity was fully retained after photocatalysis. The above results suggest the following mechanism for photocatalytic CO 2 reduction facilitated by TiO 2 CTF-Py (Fig. 6).UV-vis light irradiation excites both the electrons of nano TiO 2 and CTF-Py from their respective valence bands (VB) to the conduction bands (CB), separating photogenerated electrons and holes.The excited electrons of TiO 2 transfer to CTF-Py and, finally, accumulate at the metal sites for CO 2 reduction, while the positively charged holes accumulate in the VB of TiO 2 for H 2 O oxidation.The high activity of TiO 2 CTF-Py for CO 2 photoreduction is largely due to (i) the porous structure of TiO 2 CTF-Py that facilitates CO 2 adsorption and diffusion, (ii) the Z-Scheme heterojunction structure 70 and (iii) the covalent bond connection of TiO 2 CTF-Py that enables the efficient charge separation and migration of photogenerated electrons."
  },
  {
    "title": "Conclusions",
    "content": "We have linked porous, organic CTF and inorganic semiconductor TiO 2 by covalent bonds to construct a hybrid photocatalyst for CO 2 reduction.Intimate integration of CTF-Py and TiO 2 greatly improved photocatalytic CO 2 reduction activity.Control experiments and mechanistic investigations established that covalent bonding between the organic and inorganic components facilitated the separation of electron hole pairs and the transfer of photogenerated electrons for CO reduction.The NNN coordination sites in these CTF-based materials uniformly chelated metal ions as catalytic active sites to improve catalytic activity and selectivity.This strategy effectively integrates CO reduction and H 2 O oxidation reaction into one photosynthetic system. Ze Xu: Investigation, Formal analysis, Methodology.Writing -original draft.Yao Cui: Formal analysis, Methodology.David J. Young: Reviewing.Jixian Wang: Data curation, Methodology.Hai-Yan Li: 8 and 464.6 eV, respectively, due to the change of coordination environment of Ti 2p 52.The O 1s peaks at 531.6, 530.3, 529.8 and 529.3 eV in the XPS spectrum of NH 2 -TiO 2 can be assigned to O-Si, O-Ti 3 , O-Ti 4 and O-C bonds, respectively (Fig. 3b).These signals shifted to higher binding energies of 533.4,532.4,531.7 and 530.8 eV in the XPS spectra of TiO 2 CTF-Py.The C 1s region of NH 2 -TiO 2 possessed four peaks at 286.5, 285.3 and 284.6 eV, which correspond to C-N, C-C, and C-Si bonds, respectively 53,54.Compared with NH 2 -TiO 2 , the XPS spectrum of TiO 2 CTF-Py has two additional C 1s signals at 287.1 and 284.9 eV which are assigned to C--N and C--C bonds, consistent with the presence of CTF-Py Fig. 1.(a) PXRD patterns and (b) FT-IR spectra of TiO 2 , CTF-Py and x-TiO 2 CTF-Py.(c) N 2 adsorption isotherms of TiO 2 , CTF-Py and 60-TiO 2 CTF-Py.(d) TGA curves of TiO 2 , CTF-Py and TiO 2 CTF-Py in a N 2 atmosphere. Fig. 2. (a-c) SEM images of TiO 2 , CTF-Py and 60-TiO 2 CTF-Py.(d) TEM images of 60-TiO 2 CTF-Py.(e) HRTEM image and (001) and (101) lattice planes (d 0.235 and 0.351 nm) of TiO 2 .(f) HAADF-STEM and EDS maps of 60-TiO 2 CTF-Py. Fig. 3. XPS spectra of (a) Ti 2p, (b) O 1s in TiO 2 , NH 2 -TiO 2 and 60-TiO 2 CTF-Py and (c) C 1s, (d) N 1s in NH 2 -TiO 2 , CTF-Py and TiO 2 CTF-Py, respectively. Fig. 4. (a) CO 2 adsorption curves of CTF-Py, TiO 2 , and TiO 2 CTF-Py measured at 298 K. (b) Solid-state UV/Vis absorption spectra of CTF-Py, TiO 2 , and TiO 2 CTF-Py (Inset: Tauc plot).(c) PL of CTF-Py, TiO 2 CTF-Py, TiO 2 CTF-Py-f and TiO 2 /CTF-Py-m ( ex 365 nm).(d) Emission quenching TiO 2 CTF-Py by CoCl 2 in DMF.(e) EIS Nyquist plots and (f) Transient photocurrent response of TiO 2 , CTF-Py, TiO 2 CTF-Py, TiO 2 CTF-Py-f and TiO 2 /CTF-Py-m, respectively. We thank the National Natural Science Foundation of China (21971182 and 21771131), the \"Priority Academic Program Development\" of Jiangsu Higher Education Institutions. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary material related to this article can be found, in the online version, at doi:https://doi.org/10.1016/j.jcou.2021.101561.Z. Xu et al."
  }
]