[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2021.119879"
  },
  {
    "title": "Article_Title",
    "content": "Designing charge transfer route at the interface between WP nanoparticle and g-C3N4 for highly enhanced photocatalytic CO2 reduction reaction"
  },
  {
    "title": "Abstract",
    "content": "Developing metallic co-catalysts is an effective way to enhance the photocatalytic activity of semiconductor by forming the Schottky junction, but it remains challenging to unveil the design principle.Herein, a novel nanocomposite is prepared by coupling ultra-small WP nanoparticles embedded on N-doped carbon (WP -NC) with 2D graphitic C 3 N 4 (g-C 3 N 4 ).The WP -NC and g-C 3 N 4 form an intimate interface via PNchemical bonds at atomic level, which facilitates the flow of photoexcited electrons from g-C 3 N 4 to WP-NC.Moreover, the Schottky junction formed at the interface can prevent the charge-carrier recombination in the WP -NC/g-C 3 N 4 composite and thus significantly enhance the photocatalytic CO production rate from 29 (bare g-C 3 N 4 ) to 376 mol g -1 h -1 .As the first example of WP applied on the photocatalytic CO 2 reduction, this work demonstrates the potential of metallic WP as a co-catalyst in photocatalysis and provides a useful guide on the phosphide-based material designing."
  },
  {
    "title": "Experimental",
    "content": "Sodium tungstate dihydrate (Na 2 WO 4 2H 2 O, 98 ), sodium hypophosphite monohydrate (NaH 2 PO 2 H 2 O, 95 ), and melamine (99 ) were purchased from Sigma Aldrich.Ethanol (99.5 , ACS reagent) was purchased from Acros Organics.All chemicals were used without further treatment. The ultra-small nanoparticles embedded in N-doped carbon (WP-NC) were synthesized following the literature procedure with slight modifications 26.In a typical procedure, Na 2 WO 4 2H 2 O (0.55 g) and NaH 2 PO 2 H 2 O (0.6 g) were ground together using a mortar.To this mixture, melamine (0.5 g) was added and ground until a homogeneous powder resulted.This mixed powder was then transferred to a combustion boat and annealed at 800 C for 2 h with a ramping rate of 10 C min -1 under the Ar protection.The product was washed with deionized (DI) water for three times to yield WPNC nanoparticles as black powder.N-doped carbon (NC) was prepared using a similar procedure where only melamine (0.5 g) was annealed at 800 C for 2 h with a ramping rate of 10 C min -1 under the Ar protection.For comparison, bare WP nanoparticles without N-doped carbon layer were synthesized using the same procedure in the absence of melamine. The 2D g-C 3 N 4 was synthesized in a muffle furnace using melamine as precursor.Briefly, melamine (2 g) was calcined at 550 C for 4 h at a heating rate of 2 C min -1 .The as-synthesized bulk g-C 3 N 4 (0.5 g) was further calcined at 550 C for 1 h with a ramping rate of 5 C min -1 .After cooling to room temperature, the sample was re-heated at 550 C for another 1 h with a ramping rate of 2 C min -1 to yield 2D g-C 3 N 4 as white powders. A pre-determined amount (4, 8, 12, and 16 mg) of as-synthesized WP-NC nanoparticles was dispersed in 10 mL DI water by sonicating for 30 min.The as-prepared 2D g-C 3 N 4 (40 mg) was also dispersed in mL DI water separately by sonicating for 30 min and added to the WP suspension, followed by sonication for another 60 min.The WP -NC/g-C 3 N 4 composites were obtained after centrifugation at 9000 rpm for min followed by drying under vacuum overnight.The collected samples were named as WP10/CN, WP20/CN, WP30/CN, and WP40/CN based on the loading wt. of WP nanoparticles relative to the amount of 2D g-C 3 N 4 .N-doped carbon/g-C 3 N 4 composite (NC/CN) was prepared as a control sample by using NC (0.6 mg) instead of WP -NC in the first step of the same procedure.Another control sample was prepared by physically mixing the powder of WP -NC (30 wt.) and g-C 3 N 4 , which was denoted as p-WP30/CN. Powder X-ray diffraction (XRD) patterns were obtained using a Rigaku SmartLab X-ray diffractometer with Cu K radiation.The spectra were collected at 2 from 20 to 70 with a step size of 0.02 .Transmission electron microscopy (TEM) was conducted using a JEOL JEM-2100 F TEM operated at 200 kV.Scanning transmission electron microscopy (STEM) was performed on a JEM-ARM200 F STEM with an ac3celeration voltage of 60 kV.Samples for TEM and STEM analysis were prepared by drop-casting the samples dispersed in chloroform onto a holey carbon-coated 400 mesh Ni TEM grid.The elemental compositions and distribution were determined by an energy dispersive spectrometer (EDS).UV-vis diffuse reflectance spectra were collected with a Cary 4000 UV-vis Spectrophotometer.X-ray photoelectron spectroscopy (XPS) was carried out using an X-ray Photoelectron Spectrometer (ESCALAB 250Xi, Thermo Fisher) with a monochromic Al K X-ray source and a pass energy of 1,486.6 eV.The photoluminescence (PL) spectra were measured on a FLS1000 fluorescence spectrophotometer with an excitation wavelength of 325 nm.Time-resolved PL decay curves were recorded on the same spectrophotometer with a 375 nm pulsed laser.The obtained decay curves were fitted based on the biexponential kinetic function: where A 1 and A 2 are the corresponding amplitudes and 1 and 2 are the emission lifetimes.The Chi-square, 2 , was kept close to unity to ensure the fitting level.Scheme 1. Synthetic route of WP -NC/g-C 3 N 4 composite. As-prepared catalyst (5 mg) was dispersed in the solvent containing acetonitrile (20 mL) and DI water (500 L).After degassed with CO 2 for 30 min, the suspended solution was then irradiated with a solar simulator (Ceaulight, 300 W Xe lamp, 1 Sun).The reaction product in the headspace was periodically sampled with a gastight syringe and analyzed by an Agilent 7890B gas chromatograph equipped with a thermal conductivity detector (TCD) and a flame ionization detector (FID).For the stability test, five consecutive two-hour catalytic reactions were carried out and the catalytic system was purged with CO 2 for 30 min before starting the next photocatalytic reaction, without adding more catalysts."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The tungsten phosphide nanoparticles embedded in N-doped carbon (WP -NC) were prepared via a solid-state method 26 in which a mixture of sodium tungstate, sodium hypophosphite, and melamine was annealed at 800 C (Scheme 1).The as-synthesized WP -NC were loaded onto the two-dimensional graphitic carbon nitride (2D g-C 3 N 4 ) nanosheet by sonication to form a 2D composite (WP -NC/g-C 3 N 4 ) of various The morphology of as-prepared samples was first investigated using transmission electron microscopy (TEM) and scanning TEM (STEM).Fig. 1a is the TEM image of WP -NC that shows the ultra-small WP nanoparticles (average d 6.5 nm) distributed over the carbon matrix.The heat treatment of melamine provides a convenient way to in situ fabricate the N-doped carbon materials 26.The amount of C and N were determined to be 4.93 and 0.71 by elemental analysis (CHNS).The presence of melamine during the synthesis of WP also constrains the size of WP nanoparticles to sub-10 nm by interfering the fast growth of WP crystals that are eventually embedded on the thin N-doped carbon layers.The lattice fringe observed in the high-resolution TEM (HR-TEM, inset in Fig. 1a) measures 3.15 A, which can be ascribed to the (002) plane of the orthorhombic WP 27.The WP -NC has been further combined with 2D g-C 3 N 4 by a simple sonication for 1 h.The TEM image of g-C 3 N 4 given in Figure S1 exhibits its typical 2D nanosheet morphology with a large lateral surface area.The STEM and TEM images of a WP -NC/g-C 3 N 4 composite, WP30/CN, display a similar distribution of WP nanoparticle as in WP-NC in which the WP nanoparticles appear to be anchored mostly on the edge of g-C 3 N 4 nanosheet without much aggregation (Fig. 1b andc).The lattice fringes with a d-spacing of 4.23 A are evident in the HR-TEM image of WP30/CN (inset in Fig. 1c), which corresponds to the (101) facet of WP 27, indicating that the crystal structure of WP nanoparticle is still retained after the composite formation.The energy dispersive spectroscopic (EDS) elemental mappings of WP30/CN exhibit the evenly distributed W and P signals from the WP nanoparticles, as well as the C and N signals over the entire g-C 3 N 4 matrix (Fig. 1d). The unaltered crystal structure of WP in WP -NC/g-C 3 N 4 composites is confirmed by the X-ray diffraction (XRD) patterns shown in Fig. 1e planes, respectively 28,29.All WP-NC/g-C 3 N 4 composites exhibit the same diffraction pattern while the peak intensity gradually increases with the WP-NC loading.There are two additional peaks identified at 13.1 and 27.8 and assigned to the (110) and (002) lattice planes of g-C 3 N 4 , respectively, which confirms the coexistence of g-C 3 N 4 30. The interface between two discrete materials often dictates the physicochemical properties of the resulting composite.It is thus important to understand how the WP -NC and g-C 3 N 4 interact to form a composite in order to have a better insight into their photocatalytic properties.The surface of g-C 3 N 4 is known to possess abundant functional groups, such as NH x and OH, which allow the chemical interaction with other materials 24.It was also reported that N-doped carbon is strongly attracted to g-C 3 N 4 through van der Waals forces, due to their similarity in two-dimensional structure and property, which would facilitate the composite formation of WP-NC with g-C 3 N 4 31.To identify the interaction between WP -NC and g-C 3 N 4 in the composites, Raman and Fourier transform infrared (FTIR) spectroscopies are employed.The Raman spectra in Fig. 2a exhibit the characteristic peak pattern of g-C 3 N 4 for all the samples, including in-plane twisting vibrations of heptazine heterocycle at 470 cm -1 , breathing mode of s-triazine ring at 707 and 978 cm -1 , bending vibrations of C (sp 2 ) at 1230 cm -1 , and CNvibration of aromatic secondary amines at 1310 cm -1 32.Notably, the CN-vibration peak shows a negative shift in WP30/CN and WP20/CN (right panel of Fig. 2a), suggesting the possible interaction of WP-NC and g-C 3 N 4 via the secondary amines on the edge of g-C 3 N 4 .The FTIR spectra of g-C 3 N 4 and WP -NC/g-C 3 N 4 composites display the typical stretching and bending vibrations of g-C 3 N 4 (Fig. 2b), featuring a peak from triazine ring (807 cm -1 ), multiple peaks from aromatic C -N and CN bonds (1200 1650 cm ---1 ) 20,24, and the broad absorption band from -NH x functional groups (3,000-3,500 cm -1 ) 33,34.From the WP -NC/g-C 3 N 4 composites, a new signal associated with the PN-breathing motion appears at 955 cm -1 (right panel of Fig. 2b), which confirms the successful coupling of WP -NC with g-C 3 N 4 20.This peak for PN breating motion is not observed from pristine WP -NC and WP, ruling out the possiblity that P-N bonding may originate from the interaction between WP and NC (Figure S2).To further verify the chemical interaction between WP-NC and g-C 3 N 4 , X-ray photoelectron spectroscopy (XPS) was conducted on WP30/ CN and compared with WP-NC, g-C 3 N 4 , and a control sample NC/CN that is made of N-doped carbon and g-C 3 N 4 (see Experimental for details, Fig. 2c-f).The survey spectra of WP-NC/g-C 3 N 4 composite identify the existence of C, N, W, and P elements, as well as a small amount of O due to surface oxidation (Figure S3).The high-resolution XPS C 1s spectrum of WP -NC (Figure S4a) reveals the deconvoluted peaks at 284.8, 286.2, and 289.2 eV, corresponding to the C-C species, CNspecies from N doped C matrix, and OC - O from surface oxide, respectively 26,35.On the other hand, the N 1s spectrum exhibits the typical features of pyridinic N (398.5 eV), pyrrolic N (399.6 eV), and graphitic N (401.1 eV) from N-doped carbon (Figure S4b).The high-resolution XPS C 1s spectra of g-C 3 N 4 , NC/CN, and WP30/CN are fitted to three peaks at 284.8, 286.2, and 288.1 eV, which are attributed to the CCspecies from impurities, C-NH 2 on the edge of heptazine units, and NC- N coordination in triazine rings of g-C 3 N 4 , respectively (Fig. 2c) 24.These features of g-C 3 N 4 almost completely overlap with those of N-doped carbon in WP-NC, masking the relatively weaker N-doped carbon peaks in WP30/CN due to small content (N: 0.21 and C: 1.5 from N-doped carbon).In the XPS N 1s spectrum of g-C 3 N 4 , four peaks are evident at 398.5, 399.2, 401.1, and 404.2 eV, which correspond to the CN - C from sp 2 -hybridized nitrogen in triazine rings, N-(C) 3 from tertiary nitrogen, NH x from the amine groups at the edge of g-C 3 N 4 , and positive charge localization in heterocycles (C -NH -), respectively (Fig. 2d) 24,36.The N 1s spectrum of NC/CN is similar to that observed from g-C 3 N 4 , due to relatively small fraction of N-doped carbon in NC/CN (1.5 wt of g-C 3 N 4 ) and its structural similarity to g-C 3 N 4 .However, it is worth to note that the NH x peak is negatively shifted by 0.2 eV upon the hybridization with WP-NC, which indicates that WP -NC chemically interacts with NH x -C on g-C 3 N 4 to form PN-bonds in WP30/CN 24,37.As a result of such chemical interactions, N atoms in g-C 3 N 4 becomes electron rich while P atoms in WP becomes electron deficient, which is well supported by the positive shift of the binding energy of P 3-peaks in WP30/CN (Fig. 2e).The pristine WP-NC exhibits three peaks corresponding to the P 3- species of WPbond (129.4 and 130.4 eV) and the PO 4 3-due to surface oxidation (133.8 eV) 26,38.The hybridization with g-C 3 N 4 shifts both P 3-peaks of WP -NC towards higher binding energies by 0.4 eV to balance the electron redistribution in the composite.Such concomitant peak shifts in N 1s and P 2p regions strongly indicate the coordination between P and N atoms that renders chemically linked interface between WP -NC and g-C 3 N 4 37,39, which is consistent with the observation from the Raman analyses.The deconvoluted peaks in W 4f spectra of pristine WP -NC and WP30/CN appear at the identical binding energies (Fig. 2f), indicating the electronic interaction in WP30/CN only involves P and N atoms, i.e., PNchemical bonds.Two peaks observed at 32.2 and 34.1 eV are assigned to the W 3 in WP-bonds 27, while the other two peaks at 35.7 and 37.0 eV are attributed to the surface W 6 species (WO 3 ) 26. Coupling with ultra-small WP -NC nanoparticles would lead to the change of catalytic property of g-C 3 N 4 .To confirm and evaluate the influence of PN bond on catalysis, the WP -NC/g-C 3 N 4 composites of various WP loadings were tested for the photocatalytic CO 2 reduction reaction under the simulated sunlight, and the results are summarized in Fig. 3a.For g-C 3 N 4 , NC/CN, and WP -NC/g-C 3 N 4 composites, CO is the only traceable product and no H 2 was detected.The CO generation rate of g-C 3 N 4 is low to record merely 29 mol g -1 h -1 , which is consistent with the previous reports 40, while the WP -NC alone generates no catalytic product due to its metallic property, thus incapable of absorbing light for photocatalysis 38.The CO production rate has been slightly increased to 38 mol g -1 h -1 with the NC/CN, which can be reasoned with the enhanced visible light harvesting of N-doped carbon coupled with g-C 3 N 4 41.The CO 2 reduction rate is remarkably enhanced to 177 mol g -1 h -1 when 10 wt. of WP-NC is loaded onto the g-C 3 N 4 .The catalytic activity of WP -NC/g-C 3 N 4 composite is further promoted with the increased wt. of WP-NC loading.Particularly, WP30/CN reaches the maximum CO generation rate of 376 mol g -1 h -1 , nearly a thirteen-fold increase compared to the pristine g-C 3 N 4 , which is an impressive enhancement compared with other recently reported g-C 3 N 4 -based systems (Table S1).Further increasing the WP-NC loading results in a drop of CO production rate to 157 mol g -1 h -1 .The excess amount of WP-NC is believed to hinder the light absorption and block the active sites of the g-C 3 N 4 9.The WP30/CN also delivers a steady CO production rate in five consecutive 2 h-runs, without apparent loss in the photocatalytic activity (Fig. 3b), demonstrating its stability.The XRD pattern and TEM image of WP30/CN collected after the catalysis show that its crystal structure and morphology are well maintained (Figs.3c andS5), confirming its resistivity against the photocorrosion.A series of control experiments were also designed to ensure that the highly enhanced photocatalytic activity of WP -NC/g-C 3 N 4 (Fig. 3d).A physical mixture of 30 wt. of WP -NC and g-C 3 N 4 (denoted as p-WP30/CN) shows a much lower CO production rate of 21 mol g -1 h -1 .Unlike the WP30/CN, the XPS analyses of p-WP30/CN reveal that the peaks in C 1s and N 1s regions are identical to those of g-C 3 N 4 , while the peak positions in W 4f and P 2p regions are the same as those of WP-NC (Figure S6), indicating no significant chemical cooperation between WP -NC and g-C 3 N 4 .Two other control experiments conducted under dark conditions or without CO 2 saturation (purged with Ar) show no CO production activity, assuring that CO is photocatalytically generated by the reduction of CO 2 .Another control reaction conducted at an elevated temperature of 40 C in the dark produced no CO or any other CRR-related products, ruling out the photothermal effect. Apparently, the PNbonding has formed an intimate interface that effectively promotes the photocatalytic CO 2 reduction efficiency of WP -NC/g-C 3 N 4 composite.To unveil the underlying mechanism of enhancement, the optical property of WP-NC/g-C 3 N 4 composite was investigated using UV-vis diffuse reflectance spectroscopy (DRS).The UV-vis DRS spectrum of pristine g-C 3 N 4 exhibits an absorption edge at ca. 430 nm (Fig. 4a) and the corresponding Tauc plot indicates a band gap energy of 2.85 eV (Fig. 4b), which is compatible to the reported values 33.The band edge of NC/CN composite appears unaltered at ca. 430 nm, but the absorption in the visible region (450-700 nm) was increased 41, supporting the slight promotion of CO production rate in NC/CN.The band edge at ca. 430 nm was also found in WP30/CN with further enhanced light absorption in the visible region, caused by the inherent absorption from WP 22,42.The corresponding Tauc plot of WP30/CN yields the same band gap energy as the g-C 3 N 4 (Fig. 4b).The valence band XPS (VB-XPS) was employed to further determine the electronic structure of WP -NC/g-C 3 N 4 composite, as shown in Fig. 4c.The position of VB maximum (VBM) is evaluated by linearly extrapolating the onset of VB-XPS spectra to the baseline, which reflects a band edge position with respect to the Fermi level (E F ).The VBM of WP-NC is located below the E F , as expected for its metallic character 37, while the VBM positions of g-C 3 N 4 , NC/CN, and WP30/CN are determined at the same level of 1.70 V 43 against normal hydrogen electrode (NHE) at pH 7 based on the equation, E NHE 1.79-4.44(E NHE : potential of normal hydrogen electrode; of 4.35 eV: the electron work function of the analyzer; 1.79 eV is the distance between VBM and E F which was obtained from VB-XPS spectrum.)444546.Thus, the conduction band (CB) positions of g-C 3 N 4 and WP30/CN composite can be calculated as -1.15 V, according to E CB E VB -E g 43.Based on these results, the band structure of WP30/CN is proposed as the illustration in Fig. 4d. Usually, metals or metallic materials have the lower E F values compared with semiconductors 9,10.In a metal/semiconductor hybrid composite, the photo-generated electrons in semiconductor flows to the metallic co-catalyst until the E F of both reaches equilibrium and thus forms the Schottky barrier, which serves as an effective electron trap to prevent the recombination of the electron-hole pairs 9,47.Recently, it was predicted that the formation of interfacial chemical bonds in a composite would facilitate the charge carrier transfer and thus prevent their recombination 25,39.These theoretical calculations, together with the proposed band structure, can explain the enhanced photocatalytic CO 2 reduction performance of WP-NC/g-C 3 N 4 .Upon the formation of Schottky junction between WP -NC and g-C 3 N 4 , the PNbond acts as the interfacial pathway for the photo-excited electrons which accelerates the electron transfer from g-C 3 N 4 to WP -NC, minimizing the recombination. To evaluate the proposed mechanism and further confirm the effect of PNchemical bonds, the photoluminescence (PL) spectra, and timeresolved transient fluorescence lifetimes (decay time) of g-C 3 N 4 , NC/CN, WP30/CN, and p-WP30/CN were measured.In the PL spectra (Fig. 5a).The g-C 3 N 4 , NC/CN, and p-WP30/CN show the similar PL spectra with a peak at ca. 460 nm, whereas the intensity of this emission peak is largely suppressed with the formation of PNbonds in WP30/CN, which clearly indicates an enhanced charge-carrier separation in WP30/CN 48.In the TRPL spectra (Fig. 5b), the decay curves of all the samples can be fitted with a bi-exponential function as summarized in Table S2.The curves of g-C 3 N 4 and p-WP30/CN almost overlap, suggesting similar photocatalytic kinetics.However, the values of short lifetime ( 1 ) and the corresponding fractional contribution (f 1 ) for WP30/CN (1.45 ns, 48.77 ) are much smaller than those of g-C 3 N 4 (1.78 ns, 52.65 ).This parameter is related to the direct carrier recombination and thus the reduced values suggest successful prevention of electron-hole pair recombination in Schottky junction 49.In addition, the long lifetime ( 2 ) that reflects the non-radiation energy transfer processes of WP30/CN (6.59 ns) are slightly shorter than the g-C 3 N 4 (7.65 ns), while the fractional contribution f 2 in WP30/CN is increased from 47.4-51.2,revealing a higher electron transfer rate and possibility of photogenerated electrons engaged in catalytic reactions with PN bonds 50.Based on the above discussion, the P -N bond in WP -NC/g-C 3 N 4 serves as a fast pathway for electron transfer across Schottky junction, providing an optimized kinetics of photocatalytic process."
  },
  {
    "title": "Conclusions",
    "content": "In summary, we have successfully prepared a series of WP -NC/g-C 3 N 4 composites via a facile sonication method.An atomic-level interface between WP -NC and g-C 3 N 4 is formed through van der Waals forces and strong chemical bonding of PN-, which acts as a pathway for photo-excited charge-carriers, leading to a faster migration.The Schottky junction formed at this intimate contact also aids the charge separation.Through this unique interface design in the WP -NC/g-C 3 N 4 composite, a photocatalytic CO generation rate of 376 mol g -1 h -1 is achieved, which brings a nearly thirteen-fold enhancement compared with bare g-C 3 N 4 .This work provides a useful insight on designing a photocatalytic and electrocatalytic systems using WP as co-catalyst. Fig. 1.(a) TEM image of pristine WP -NC.Inset is the HR-TEM image.(b) STEM and (c) TEM images of WP30/CN.Inset is the HR-TEM image.(d) Dark-field TEM image of WP30/CN and the corresponding W, P, C, and N elemental mappings.(e) XRD patterns of g-C 3 N 4 , WP, and WP-NC/g-C 3 N 4 composites. Fig. 2. (a) Raman and (b) FT-IR spectra of g-C 3 N 4 and WP -NC/g-C 3 N 4 composites, and high resolution XPS spectra in the region of (c) C 1s and (d) N 1s of g-C 3 N 4 , NC/CN, and WP30/CN, and (e) P 2p and (f) W 4f of WP-NC and WP30/CN. . The pristine WP -NC shows the typical diffraction peaks of orthorhombic WP at 2 21.1 , 28.7 , 31.0 , 43.2 , 44.6 , 46.5 , 49.9 , 52.3 , and 56.7 (JCPDS no.29-1364), corresponding to the characteristic (101), (002), (011), (112), (211), (103), (301), (013), and (020) Fig. 3. (a) Photocatalytic CO production rates of g-C 3 N 4 , WP -NC, NC/CN, and WP -NC/g-C 3 N 4 composites.(b) Stability test of WP30/CN (5 mg) over five consecutive 2 -h photocatalytic reactions.(c) XRD patterns of WP30/CN composite before (red) and after (black) the photocatalytic CO 2 reduction reaction.(d) Photocatalytic CO production rates under various conditions. Fig. 4. (a) UV-vis DRS spectra of WP -NC, g-C 3 N 4 , NC/CN, and WP30/CN.(b) The corresponding Tauc plots of g-C 3 N 4 and WP30/CN.(c) VB-XPS spectra of WPNC, g-C 3 N 4 , and WP30/CN.(d) Schematic diagram of the band structure of WPNC/g-C 3 N 4 composite. Fig. 5. (a) PL spectra and (b) time-resolved transient fluorescence decay plots of WP-NC, g-C 3 N 4 , NC/CN, p-WP30/CN, and WP30/CN. This work was supported by Shenzhen Science, Technology and Innovation Commission (SZTIC, Grant No. JCYJ20170818105046904) and The Hong Kong Polytechnic University (Grant No. 1-BE0Y). Xiandi Zhang: Conceptualization, Data curation, Formal analysis, Writing -original draft.Jia Yan: Data curation, Formal analysis.Fangyuan Zheng: Data curation, Formal analysis.Jiong Zhao: Supervision, Writing -review editing.Lawrence Yoon Suk Lee: Conceptualization, Funding acquisition, Supervision, Writing -review editing. The authors report no declarations of interest. Supplementary material related to this article can be found, in the online version, at doi:https://doi.org/10.1016/j.apcatb.2021.119879."
  }
]