[
  {
    "title": "Doi",
    "content": "10.1016/j.apsusc.2021.151848"
  },
  {
    "title": "Article_Title",
    "content": "Inherent Facet-Dominant effect for cobalt oxide nanosheets to enhance photocatalytic CO2 reduction"
  },
  {
    "title": "Abstract",
    "content": "Highly specific exposed to different crystal facets remarkably affect the CO 2 reduction photoreactivity.Thereby, we give examples of well-interpretated Co 3 O 4 nanosheets, which dominating with respective facets, 1 1 2 and 1 1 1, to explore the reactivity of the photocatalysis's special exposed crystal facets in the photocatalytic CO 2 reduction.The true photoreactivity of Co 3 O 4 -1 1 2 were testified to be remarkably higher than Co 3 O 4 -1 1 1 for both CO evolution and CH 4 production reactions.Further photoelectrochemical detection studies have confirmed that the different reactivity is not only due to the different morphologies of the calcined materials under different temperature conditions, but controlled by the different exposing facets, giving rise to the photogenerated carriers and effective space separation.Under the calcination condition of 673 K, CO and CH 4 evolution rates of Co 3 O 4 -1 1 2 reached 96.4 and 18.94 molg -1 h -1 .The mechanism of the reaction was further confirmed by in-situ fourier transform infrared spectroscopy and DFT calculation.Effective separation of photogenerated carriers and specific flaky shapes, crystal facets, and surface atomic arrangement all contribute to the high activity of the carefully designed Co 3 O 4 photocatalysis."
  },
  {
    "title": "Experimental",
    "content": "In this article, we prepared -Co(OH) 2 by solvent hydrothermal method and explored the crystal facets exposed by different morphologies of Co 3 O 4 nanosheets (Scheme 1).Usually, a certain amount of cobalt nitrate hexahydrate (Co(NO 3 ) 2 H 2 O) and polyvinylpyrrolidone (PVP, MW55000) are dissolved in a certain amount of absolute ethanol and deionized water, and the mixture is used in a stirrer.Stirring for 1 h, and then add the solution all at once to a 25 mL autoclave lined with Teflon.Subsequently, the autoclave was placed in an oven and heated at 473 K for 12 h, and then cooled to room temperature.The prepared pink solid insoluble precipitate was washed with distilled water and absolute ethanol until the pH of the filtrate became neutral, and then vacuum dried for 14 h. Subsequently, -Co(OH) 2 was calcined in a tube furnace with air atmosphere for 2 h at a heating rate of 5 C/min, and calcined in air atmosphere at 673 and 873 K to obtain nanosheet Co 3 O 4 -1 1 2 and Co 3 O 4 -1 1 1 photocatalytic materials. The photocatalytic CO 2 reduction reaction was carried out in a mL pyrex reactor based on an online system (Labsolar-6A, PerfectLight, Beijing).The reaction system containing catalysts (10 mg) and solvent (6 mL acetonitrile, 4 mL H 2 O, and 2 mL TEOA) was stirred with a magnetic stirrer and irradiated at 283 K by cooling water circulation system under a 300 W Xenon lamp (PLS-SXE 300C (BF), Perfectlight, Beijing) with the light intensity is 21.3 W/cm 2 .High purity CO 2 was first purged into the reactor and the pressure of CO 2 was stabled to 0.75 MPa.Gaseous products analysis was performed with a Shanghai KeChuang Chromatograph Instruments Co., Ltd."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The magnified scanning electron microscope (SEM) images show the microstructure and structural morphology of two series of Co 3 O nanosheets.As shown in Fig. 1a, Co 3 O 4 -1 1 2 catalyst present a regular and orderly hexagonal nanosheet structure, but as shown in Fig. 1b, the Co 3 O 4 -1 1 1 catalyst show an approximate circular structure.Fig. 1c and 1d respectively show the TEM images of a single hexagonal Co 3 O nanosheet with a width of about 100 nm and a single approximately circular Co 3 O 4 nanosheet with a width of about 80 nm, which respectively indicate the hexagonal shape and circular shape.It can be observed that in an air environment of 673 K, with a width of about 100-200 nm and a regular and uniform appearance.The high-resolution regional spectra of Co 2p of as-prepared catalyst, (f) The high-resolution regional spectra of O 1 s of as-prepared catalyst.The C 1 s XPS peaks located at 284.8 eV was ascribed to carbon contamination, which was used as a calibration element. Co 2 from Co 3 O 4 .By observing the high-resolution O 1 s in the spectrum (Fig. 2f), the O1 peak represents the O 2-in the crystal lattice of Co 3 O 4 and O2 peak can be associated with the adsorbed oxygen.Almost no change is observed in the O 1 s spectra, which indicated temperature treatment introduce no defect on the surface of Co 3 O 4 .The results certificated the improvement of activity is not due to the modification of material interface decoration. To prove that the Co 3 O 4 -1 1 2 catalyst has a better stacking interaction, the photocurrent response of the sample was analyzed.As shown in Fig. 3a, the Co 3 O 4 -1 1 2 catalyst exhibits a higher photocurrent response under visible light irradiation than the Co 3 O 4 -1 1 1 catalyst, which means that the photoexcited electron-hole pairs separation and transport capabilities are very effective.The result is that the specific dominant exposed facets can delocalize the charge and help the mobility of the carriers along the surface of the material, which is conducive to the ability of light to reduce CO 2 .Also, as shown in Fig. 3b, the Co 3 O 4 -1 1 2 catalyst also has the smallest electrochemical impedance spectroscopy (EIS) Nyquist arc radius, to further confirm that the Co 3 O 4 -1 1 2 catalyst has a higher separation efficiency of photogenerated carriers.Both the enhanced photocurrent response and the reduced charge transfer resistance prove that the photogenerated electron-hole pairs in the Co 3 O 4 -1 1 2 catalyst can effectively promote the separation.In Fig. 3c, the photoluminescence (PL) spectrum revealed the fluorescence intensity of Co 3 O 4 -1 1 1 catalyst after light excitation was significantly higher than Co 3 O 4 -1 1 2 catalyst, which indicates that the recombination rate of photogenerated electrons and holes on Co 3 O 4 -1 1 1 catalyst is higher.62 To further study the electronic structure of Co According to the summary of previous work, the Co 3 O 4 with specific dominant exposed facets produces a higher electron density, and the 1 1 2 crystal facet is well exposed, giving it a narrower bandgap.63 The CB and VB of Co 3 O 4 are composed of the chemical states of Co and O. Therefore, the different chemical states of Co and O from different crystal facets produced by different calcination temperatures can lead to different energy band structures.On this basis, based on UV-vis DRS, XPS valence band spectroscopy (XPS VB), and ultraviolet emission spectroscopy (UPS), the relative energy band structure of the sample was established.As shown in Fig. 4c andd 1 1 2 catalyst are calculated to be 3.9 and 4.02 eV, respectively.As shown in Fig. 4e andf, through the linear extrapolation from the corresponding XPSVB spectrum front to the extended baseline, it can be estimated that the Fermi level (E F ) positions of Co 3 O 4 -1 1 1 catalyst generated at 873 K and Co 3 O 4 -1 1 2 catalyst generated at 673 K are 0.29 and 0.26 eV higher than their VBs, respectively.Therefore, relative to Evac, the VB potentials of Co 3 O 4 -1 1 1 catalyst and Co 3 O 4 -1 1 2 catalyst are estimated to be -4.19 and -4.28 eV, and the CB potentials are estimated to be -1.98 and -2.31 eV.Since the minimum CB of Co 3 O 4 -1 1 2 catalyst is lower than the LUMO of Co 3 O 4 -1 1 1 catalyst, electrons in the photocatalytic reaction system are more easily transferred to the CB of Co 3 O 4 -1 1 2 catalyst, which can reduce the desorption of CO 2 .The corresponding energy band structure scheme is shown in Fig. 5, The bandgap of Co 3 O 4 can be clearly shown to be expanded by the strategy of precisely regulating the calcination temperature of the precursor, which clearly shows the electrostatic potential of Co 3 O 4 -1 1 2 catalyst higher than Co 3 O 4 -1 1 1 catalyst, illustrating that the electrons on the 1 1 2 facet are easier to gather than the 1 1 1 facet.64 Triethanolamine (TEOA) was used as a hole sacrificial agent for capturing the photogenerated holes to evaluate the photocatalytic CO 2 reduction performance of the prepared samples.We first measured the carbon monoxide acquisition rate of Co 3 O 4 -1 1 1 catalyst and Co 3 O 4 -1 1 2 catalyst under visible light (420 nm, 300 W Xe lamp), and the carbon monoxide generation rate of Co 3 O 4 -1 1 1 catalyst was 26.1 molg -1 h -1 .The carbon monoxide generation rate of Co 3 O 4 -1 1 2 catalyst is 96.4 molg -1 h -1 , which indicates that the special exposed crystal facets generated by the specific calcination temperature can effectively accelerate the charge transfer to increase the release rate of carbon monoxide.As shown in Fig. 6a, due to the rapid recombination of photogenerated carriers, Co 3 O 4 -1 1 1 catalyst showed poor photocatalytic performance.At the same time, it can be found that changing the calcination temperature can significantly affect the photocatalytic performance of the Co 3 O 4 sample.The higher photocatalytic activity for CO emission indicates that the Co 3 O 4 with highly specific exposed facets to occur onto synergistic effect of recrystallization under the calcination condition at 673 K. Therefore, the conversion conditions of calcination at 673 K help to improve the photocatalytic efficiency of the catalyst under visible light.The main reason for the enhanced activity is due to the increased possibility of recrystallization to expose highly active crystal facets.The special exposed crystal facets are easy to absorb and accumulate electrons to excite the Co redox sites located in three coordination and two coordination.This leads to effective charge separation and the generation of long-lived electrons and holes, thereby triggering the photocatalytic CO 2 reduction reaction.65 Fig. 6b shows the effects of various conditions of the photoreaction on photocatalytic activity.As the reaction proceeds under dark conditions.For Co 3 O 4 -1 1 2 catalyst, the highest CO release rate observed is only 0 molg -1 h -1 .Also, when the gas in the reaction atmosphere is changed to pure argon (Ar), it can be observed that CO is not generated.There is no acquisition of CO in reactions without catalyst participation.In this photoreduction experiment, a cyclic test of photocatalytic CO different exposed facets for Co 3 O 4 -1 1 1 catalyst and Co 3 O 4 -1 1 2 catalyst are further analyzed, observing that 1 1 2 facet is higher than 1 1 1 facet, which helps to intensify electrons transport via CO 2 reduction pathway (Figure S3, Supporting Information).The partial density of states (PDOS) of contact catalytic site related atoms (Figure S5, Supporting Information), indicating that the change of occupied PDOS with 1 1 2 relatively predominant exposed facets could promote the formation of COOH and the liberating of CO.In addition, the corresponding band structure shows that the position of the VB and CB on the 1 1 2 facet is higher than the position of those on the 1 1 1 facet (Figure S4, Supporting Information), which as illustrated in Fig. 5.The electrostatic potential corresponding to the 1 1 1 and 1 1 2 facets are 5.3781 eV and 5.006 eV individually (Supporting Information, Figure S6), expounding that electrons are easier to transite from the interior of the photocatalysis to 1 1 2 facet than 1 1 1 facet.74 The above experimental results coincide good agreement with the results of theoretical calculation.The photoactivity feedback from different crystal facets is closely related to the arrangement of atoms on different facet surfaces, which reflects photogenerated carrier transfer properties and the energy band structures of photocatalytic materials (Figure S7, Supporting Information).These results also manifest a potential intensive effect of 1 1 2 exposed relatively predominant facet on Co 3 O 4 for photocatalytic CO 2 reduction.Hence it could be attributed the high effect active in CO 2 reduction to CO to the principal influence of the 1 1 2 exposed relatively predominant facet on Co 3 O 4 -1 1 2 surface.75"
  },
  {
    "title": "Conclusions",
    "content": "In summary, Co 3 O 4 -1 1 2 calcined at 673 K was successfully synthesized as the optimal catalyst and proved to be an efficient catalyst for CO 2 reduction reactions.The Co 3 O 4 -1 1 2 exhibits quite high photocatalytic CO 2 reduction performance.The CO release performance of Co 3 O 4 -1 1 2 is 3. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Scheme 1. Illustration of the synthetic process of Co 3 O 4 -1 1 2 catalyst and Co 3 O 4 -1 1 1 catalyst. Fig. 1.SEM images of (a) Co 3 O 4 -1 1 2 catalyst; (b) Co 3 O 4 -1 1 1 catalyst; TEM images of (c) Co 3 O 4 -1 1 2 catalyst; (d) Co 3 O 4 -1 1 1 catalyst; HRTEM and corresponding FFT images of (e, g) Co 3 O 4 -1 1 2 catalyst; (f, h) Co 3 O 4 -1 1 1 catalyst. Fig. 2. (a, b) XRD patterns and the corresponding ratios of angel-dispersive peak intensity for Co 3 O 4 -1 1 2 catalyst and Co 3 O 4 -1 1 1 catalyst, (c) FTIR spectra of Co 3 O 4 catalyst, (d) XPS survey spectra of Co 3 O 4 catalyst, (e)The high-resolution regional spectra of Co 2p of as-prepared catalyst, (f) The high-resolution regional spectra of O 1 s of as-prepared catalyst.The C 1 s XPS peaks located at 284.8 eV was ascribed to carbon contamination, which was used as a calibration element. 1 1 1 catalyst and Co 3 O 4 -1 1 2 catalyst, ultraviolet diffuse reflectance spectroscopy (UV-vis DRS) was analyzed.As shown in Fig. 4a, the DRS spectra of Co 3 O 4 -1 1 1 catalyst and Co 3 O 4 -1 1 2 catalyst both show intrinsic absorption, indicating that both the single-layer Co 3 O 4 with specific dominant exposed facets and the Co 3 O 4 formed by directional growth have a band-like electronic structure, which has a certain conduction band (CB) and valence band (VB).Analyzed with corresponding Tauc diagrams (Fig. 4b), the bandgap of Co 3 O 4 -1 1 2 catalyst is estimated to be 1.97 eV, which is narrower than Co 3 O 4 -1 1 1 catalyst (2.21 eV). , the binding energy of the cut-off edge (E C ) of Co 3 O 4 -1 1 1 catalyst and Co 3 O 4 -1 1 2 catalyst is 17.32 and 17.2 eV, respectively.The value of wavelength of ultraviolet light is 58.13 nm, and the value of kinetic energy (h) is 21.22 eV.The estimated work function () is based on the following formula: 21.22-EC .The work functions () of Co 3 O 4 -1 1 1 catalyst and Co 3 O 4 - Fig. 3.The mechanism of photoelectric degradation of Co 3 O 4 -1 1 2 catalyst; and Co 3 O 4 -1 1 1 catalyst; (a) Photocurrent under visible light, (b) Electrochemical impedance spectra, (c) Photoluminescence spectra. release was carried out to further evaluate the activity stability of the Co 3 O 4 -1 1 2 photocatalyst.As shown in Fig.6c, it can be observed that after the first reaction, the activity is reduced.The reason may be due to the slight light corrosion of the sample in water.However, after the first run, the stability of the catalyst did not show significant deactivation.After four consecutive cycles, the photocatalytic activity remained constant, indicating the high durability and endurance of the photocatalyst under visible light.To further study the adsorption and chemical activation of CO 2 molecules on Co 3 O 4 -1 1 2 catalyst, and to explore the key reaction intermediates to determine possible reaction pathways, in-situ DRIFTS was used to photoreduction of CO 2 .As shown in Fig.6d, Co 3 O 4 -1 1 2 catalyst exposed to H 2 O/CO 2 system under sunlight induced strong adsorption of H 2 O at 1655 cm -1 , carbonate or bicarbonate species (bidentate (b-CO 3 2-) at 1351 cm -1 , monodentate (m-CO 3 2-) at 1287 cm -1 , and bicarbonate (HCO 3 -) at 1206 cm -1 and 1404 cm -1 ).The key intermediate of CO 2 -species was observed at 1453 and 1613 cm -1 .These findings indicate that the special exposed crystal surface of Co 3 O 4 -1 1 2 can capture photogenerated electrons, and then effectively promote the injection of electrons from Co 3 O 4 into the adsorbed CO 2 molecules.The formation of CO 2 -species shows that it is easy to reduce CO 2 single electron to CO 2 -on the 1 1 2 facet of Co 3 O 4 .66-69VASP was implemented to calculate density functional theory (DFT) and the computational relaxed clean slab model applied for calculating to analyze the free energy diagram were carried out to explore the further mechanism of adsorption and desorption of CO 2 for the reduction progress from CO 2 to CO on 1 1 2 and 1 1 1 facet surfaces of Co 3 O 4 , respectively.70-72The calculations revealed that the adsorption of CO 2 is thermodynamically beneficial on both the 1 1 1 and 1 1 2 facets, although the adsorption on 1 1 2 is much more beneficial (energy of adsorption, E ad -1.41 eV) than that on 1 1 1 (E ad -1.33 eV).Fig. 7b shows the calculation of free energy profiles for CO 2 reduction on 1 1 1 facet exposed for Co 3 O 4 -1 1 1 catalyst and 1 1 2 facet exposed for Co 3 O 4 -1 1 2 catalyst with optimized geometries.The CO 2 molecule adsorbs on 1 1 1 facet surface of three-coordinated Co 3 catalytic site for Co 3 O 4 -1 1 1 catalyst, nevertheless on 1 1 2 facet surface of two-coordinated Co 2 catalytic site for Co 3 O 4 -1 1 2 catalyst with highly efficient to coordinate the transfer of electrons and protons, giving rise to form COOH (Fig.7a).After forming the COOH intermediate, it can be further subjected to proton and electron transfer reduction to generate a CO intermediate and release a H 2 O molecular product.The subject product CO is finally produced by the separation of weakly bonded CO adducts.We found that the potentially limiting process is the formation of (CO) species through hydrogenation.Therefore, the formation of CO with an energy barrier of 1.342 eV can be considered as a potential limiting step for this reduction pathway on Co 3 O 4 -1 1 1 catalyst, which is higher than the surveyed overpotential value of 1.074 eV on the Co 3 O 4 -1 1 2 catalyst.Moreover, different exposed crystal facets on a Spinel phase Co 3 O 4 had been shown to have synergistic functions that can accelerate certain catalytic pathways.Therefore, two free energy diagrams with different exposed crystal facets are considered, as illustrated in Fig. 7b and Figure S2 (supporting information), we find that 1 1 2 exposed relatively predominant facet on Co 3 O 4 improves the catalytic activity of Co 3 O 4 -1 1 2 catalyst by reducing the energy barrier of COOH formation, meanwhile the CO desorption step is promoted according to the free energy diagram.The activation energy barrier of COOH is from -0.026 eV (Co 3 O 4 -1 1 1) to -0.404 eV (Co 3 O 4 -1 1 2), which is corresponding to our experimental data, thus the 1 1 2 facet could reduce the temperature for the CO 2 reduction reaction.Moreover, since the CO desorption energy lessened from 1.342 eV to 1.074 eV, 1 1 2 facet will have a proclivity for liberating more stable gaseous product CO rather than 1 1 1 facet.73 Through total density of states (TDOS) corresponding with two Fig. 4. (a) UV-Vis diffuse reflectance spectra of Co 3 O 4 catalyst, (b) Tauc plot spectra of Co 3 O 4 catalyst, (c, d) UPS spectra and, (e, f) XPSVB spectra of Co 3 O 4 -1 1 2 catalyst and Co 3 O 4 -1 1 1 catalyst. Fig. 5. Schematic illustration for the electronic band structures of Co 3 O 4 -1 1 2 catalyst and Co 3 O 4 -1 1 1 catalyst. Fig. 6.(a) Photocatalytic CO 2 reduction rate of Co 3 O 4 -1 1 2 catalyst and Co 3 O 4 -1 1 1 catalyst, for CO 2 reduction of (b) Photocatalytic activity of Co 3 O 4 -1 1 2 catalyst in different conditions.(c) Photocatalytic CO 2 cycle stability, (d) In-situ DRIFTS spectra of Co 3 O 4 -1 1 2 catalyst. Fig. 7. Theoretical calculations and proposed mechanism on the 1 1 1 and 1 1 2 facet of Co 3 O 4 -1 1 1 catalyst and Co 3 O 4 -1 1 2 catalyst.(a) DFT calculation of adsorption and desorption of corrsponding intermediate on Co 3 O 4 surfaces.(b) Free energy diagram describing the COOH intermediate from CO 2 reduction to CO on 1 1 1 and 1 1 2 surfaces of Co 3 O 4 . 7 times higher than Co 3 O 4 -1 1 1.The optimized Co 3 O 4 -1 1 2 catalyst shows the highest activity for CO precipitation.The lattice fringe and electron diffraction characterized by HRTEM and the corresponding FFT exhibited Co 3 O 4 -1 1 2 and Co 3 O 4 -1 1 1 with different dominating 1 1 2 and 1 1 1 facets.Integrated the combined photoluminescence, transient photocurrent and electrochemical impedance spectroscopy, Co 3 O 4 -1 1 2 was found to achieve higher photoactivity than Co 3 O 4 -1 1 1 through the rapid transport of photogenerated carriers.The synergy between the effective charge transfer of Co 3 O 4 and the exposure of 1 1 2 crystal facets is vital for enhance photocatalytic performance enhancement.It is the effective spatial carrier separation on different crystal facets that makes the surface reactions on given catalytic active sites separately occur onto the dominant facet accounting for different reaction rates, which determines the real destiny photocatalysis for Co 3 O 4 nanosheets.DFT shows the photoactivity is intrinsically the result of the arrangement of surface atoms with different facets.The operation unravels the inherent facetdominant photoactivity of semiconductors, which will be conducive to understand the mechanisms of photoreactivity solar energy transition systems.CRediT authorship contribution statement Ziyi Feng: Methodology, Conceptualization, Investigation, Data curation, Writingoriginal draft.Xingwang Zhu: Writingreview editing, Investigation.Jinman Yang: Writingreview editing, Investigation.Kang Zhong: Writingreview editing, Investigation.Zhifeng Jiang: Writingreview editing, Investigation.Qing Yu: Resources.Yanhua Song: Resources.Yingjie Hua: Resources, Methodology.Huaming Li: Resources, Funding acquisition.Hui Xu: Supervision, Resources, Methodology, Writingreview editing, Funding acquisition, Conceptualization. We thank Prof. Ziran Chen at Sichuan Vocational and Technical College generously for providing us with access to the Vienna ab-initio simulation package.This study was supported by National Natural Science Foundation of China (21676128, 51902138, 22178149, 22178152), Jiangsu Fund for Distinguished Young Scientists (BK20190045), Natural Science Foundation of Jiangsu Province (BK20180870, BK20190981, BK20190835), China Postdoctoral Science Foundation (2019M661765, 2019M661740), High-tech Research Key laboratory of Zhenjiang (SS2018002), Jiangsu Government Scholarship for Overseas Studies (JS-2020-203), Jiangsu University Study-abroad Scholarship for oversea study (UJS-2020-001) and A Project Funded by the Priority Academic Program Development of Jiangsu Higher Education Institutions.This study was financially supported by the High-Performance Computing Platform of Jiangsu University. Supplementary data to this article can be found online at https://doi.org/10.1016/j.apsusc.2021.151848."
  }
]