[
  {
    "title": "Doi",
    "content": "10.1246/bcsj.20190366"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic Activity of Metal Oxide Supported Gallium Oxide for CO2 Reduction with Water"
  },
  {
    "title": "Abstract",
    "content": "Her research interests include CO 2 reduction using semiconductor photocatalysts and establishment of a new structural and electronic state analysis using synchrotron radiation spectroscopy."
  },
  {
    "title": "Experimental",
    "content": "2.1 Preparation of Ga 2 O 3 /Metal Oxide Photocatalyst Samples. Ga 2 O 3 supported by metal oxides (referred as Ga 2 O 3 /metal oxide) were prepared by an impregnation method. 18In brief, Ga(NO 3 ) 3 8H 2 O (Kishida Chemical Co. Ltd. purity 99.0) and one of the supporting oxides listed in Table 1 were put in 200 mL of distilled water and stirred with a magnetic stirrer in air and dried, followed by calcination at 823 K for 4 h.The amount of Ga 2 O 3 supported on a metal oxide was set to be 40 wt.Unsupported Ga 2 O 3 samples having single phase either -Ga 2 O 3 or -Ga 2 O 3 were also prepared for comparison.-Ga 2 O 3 was obtained by calcining Ga 2 O 3 nH 2 O (Mitsuwa Chemicals Co., Lid Ga 2 O 3 78.8) at 823 K for 5 h. 19or the preparation of -Ga 2 O 3 , Ga(NO 3 ) 3 8H 2 O was dissolved in ethanol (approximately 3 g of the reagent in 50 mL of the solvent), and then an ethanol solution of 28 vol aqueous ammonia (volume ratio of ethanol/aqueous ammonia 1) was added slowly under continuous stirring at room temperature until no further precipitates were formed.The resultant precipitates were filtered, rinsed in ethanol, and vacuum-dried in a desiccator.Finally, the obtained solid was calcined at 773 K for 5 h to obtain -Ga 2 O 3 . 20.2 Characterization.UVvis diffuse reflectance spectra were recorded at room temperature using a spectrometer (JASCO V-670).The spectrum of Ba 2 SO 4 was used as reference. The potential position of the conduction band of the supporting oxides was determined by the Mott-Schottky-plot from the flat band potential measured with a three-electrode chemical cell (VersaSTAT4 (AMETEK)). 2123The following three electrodes were used.(1) a metal oxide dispersed on a fluorinedoped tin oxide substrate followed by calcination at 823 K, (2) a Pt wire counter electrode, and (3) an Ag/AgCl reference electrode, and an aqueous Na 2 SO 4 solution (0.5 M, pH 7.4).The flat band potential (E 0 ) of the oxide at pH 0 vs SHE (standard hydrogen electrode) was extrapolated from the observed potential (E) using the relation of E E 0 -0.059pH and the electrode potential of Ag/AgCl was set to be 0.199V (vs.SHE, 25 C). Crystalline structures of all Ga 2 O 3 /metal oxide samples were examined by X-ray diffraction (XRD) analysis.XRD patterns of the samples were recorded on a MiniFlex600 (Rigaku) using Cu K as a radiation source with an operating voltage of 40 kV and current of 15 mA.The XRD patterns were collected at 2 angles of 2070.The 2 step width was 0.02, and the scanning rate was 2/min.Ga K-edge EXAFS was measured with the beam line BL5S1 at Aichi Synchrotron Radiation Center.Ga K-edge EXAFS was obtained by a transmission mode.Morphology of the samples was observed by a field emission scanning electron microscope (FE-SEM, JSM-6500F, JEOL Ltd.) with a backscattered electron mode under an acceleration voltage of 15 kV. 2.3 Photocatalytic CO 2 Reduction and Water Splitting Tests.Photocatalytic CO 2 reduction with H 2 O under UV light irradiation was tested for 0.1 g of each of the Ga 2 O 3 /metal oxide samples set in a fixed-bed flow reactor cell under CO 2 gas flow.The UV light intensity was 40 mW/cm 2 in the range of 254 10 nm.Before the test, the sample was irradiated with a 300 W Xe lamp for 1 h under CO 2 gas flow with the flow rate of 20.0 mL/min.The reduction test was conducted as follows.First, a 10.0 mL NaHCO 3 aqueous solution 24 (1.0 M) with a sample was prepared.The pH of the solution was 8.7.Then, CO 2 gas was introduced with a flow rate of 3.0 mL/min under the UV light irradiation.This made the pH a little lower being 7.8, which was maintained during the reaction tests.After stopping the UV light and CO 2 gas flow, pH increased a little to 8.4.The reaction products (CO, H 2 , and O 2 ) were analyzed by a gas chromatograph equipped with a thermal conductivity detector."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Oxides. Figure 1 and 2 respectively show the production rates of CO and H 2 observed in the photocatalytic CO 2 reduction and water splitting tests for all samples after 5 h of the test.The Ga O /La O 1.9 10.1 4.4 4.8 17.6 6.9 6.9 22.9 9.9 7.4 25. 6 Ga O /Nd O 1.6 10.9 2.8 0.9 9.0 4.7 1.9 13.8 5.6 2.0 13.7 6.2 2.1 14.0 5.9 1.03 Ga O 1.0 10.0 4.5 1.5 11.5 6.0 1.7 11.6 6.3 1.9 12.5 6.8 1.6 13.0 6.9 1.06 Ga O /ZSM-5 0. results for -Ga 2 O 3 and -Ga 2 O 3 are not shown because the single phase of either -Ga 2 O 3 or -Ga 2 O 3 hardly shows photocatalytic activity. 18In the figure, supporting oxides are ordered from left to right corresponding to the CO production rates from higher to lower.Production rates of all products (CO, H 2 and O 2 ) and selectivity toward CO evolution are shown in Figures S1 andS2, corresponding to the results for higher active and lower active oxides shown in Figures 1 and2 respectively.And the time courses of the production rates of CO, H 2 and O 2 and stoichiometric ratio for those oxide producing O 2 are shown in Table 1. Figure 3 is an example of the time courses of the production rates for Ga 2 O 3 /Al 2 O 3 . In addition, we have conducted reduction tests under He flow instead of CO 2 for samples giving higher activity (Ga 2 O 3 / La 2 O 3 and Ga 2 O 3 /Al 2 O 3 ) to confirm that CO originates from CO 2 .The results are shown in Figure S3.Under the He flow, CO production was hardly seen.Thus, we can conclude that CO and H 2 were produced with the photocatalytic CO 2 reduction with water. As depicted in Figures 1 and2, the production rates of both CO and H 2 separate the samples roughly into two groups, one showing higher production rates than that of non-supported Ga 2 O 3 and the other lower production rates which were magni-fied in the inset of the figures.Hereafter, Ga 2 O 3 /metal oxides showing higher CO production rates are referred as higher active samples and the others as lower active samples.Never- theless, the order of the oxides showing higher H 2 production rates in Figure 2 are totally different from that of Figure 1.In Table 2, observed production rates of CO and H 2 for all samples are also given together with characteristics of the supporting oxides.The separation is also seen Table 2. 3.2 Diffuse Reflectance UVVis Spectra.Diffuse reflectance UVvis spectra of all supporting oxides are given in Figures 4 and5 with separation of higher and lower active samples when used as the supporting oxide.One can clearly see that those oxides showing absorption edge at shorter wavelength than that of Ga 2 O 3 result in higher CO production rates. In contrast, those oxides showing optical absorption in longer wavelength region reduced the CO production rate.The band gap value calculated from these spectra is shown in Table 2.As additional information, diffuse reflectance UVvis spectra of metal oxide supported Ga 2 O 3 are shown in Figure S4 andS5.Samples that showed water splitting and/or CO 2 reduction show similar spectra to that of Ga 2 O 3 . 3.3 Mott-Schottky-Plot. From the flat band potential obtained by Mott-Schottky-plot, the potential position of the conduction band was determined as given in Table 2.All supporting oxides having their conduction band at potential negative to that of Ga 2 O 3 except MgO gave higher production rates, while those supporting oxides having the conduction band at a more positive position reduced the production rate. 3.4 XRD Measurements.Results of XRD analysis of all samples are also given in Table 2.In terms of crystalline structure, the supporting oxides are separated into three groups; (1) supporting oxides miscible with Ga 2 O 3 or coexisting with Ga 2 O 3 , (2) those dissolving some Ga 2 O 3 and vice versa, and (3) those forming composite oxides with Ga 2 O 3 or forming GaOOH, which hardly showed photocatalytic activity.In most of the samples showing higher CO and H 2 production rates, Ga 2 O 3 on the supporting oxides exhibited single or mixed phases of and phases of Ga 2 O 3 . 20,25The XRD analysis of -Ga 2 O 3 and -Ga 2 O 3 prepared as the references showed that the former was well crystalized while the latter was defective, which is quite consistent with previous work. 26,27.5 XAFS Measurements.Figure 6 shows radial structure functions (RSFs) obtained from Fourier transformation of EXAFS spectra in the range from 3 to 12 11 with separation of the oxides showing higher CO production rates together with those of -Ga 2 O 3 and -Ga 2 O 3 , (Figure 6(a)) and lower ones (Figure 6(b)). EXAFS spectra of -Ga 2 O 3 and -Ga 2 O 3 prepared as the reference are quite similar to those previously observed for well crystalized -Ga 2 O 3 phase and defective -Ga 2 O 3 phase, respectively. 18This is consistent with the results of XRD analysis. As indicated in the figures, RSFs of all samples show two dominant peaks characteristic to Ga 2 O 3 .The first peak appearing at around 1.5 is assigned to the backscattering from an adjacent oxygen atom to a Ga atom (Ga-O bond), and the second peak around 2.7 indicates the presence of the secondneighboring gallium atoms (Ga-(O)-Ga bond). 2830It should be noted in Figure 6(a) that -Ga 2 O 3 and -Ga 2 O 3 show two characteristic shoulders around 3.5 and 4.5 , and 0.9 and 2.1 , respectively, which are indicated as white arrows and black arrows, respectively.Referring to them, higher active samples given in Figure 6 specific surface area of Ga 2 O 3 /La 2 O 3 .All other higher active samples also showed the columnar shaped Ga 2 O 3 particles.(not shown here).On MgO (Figure 7(c)), no columnar shaped particles were observed because MgO and Ga 2 O 3 reacted to form a composite oxide.Although on ZrO 2 (Figure 7(d)) are seen the columnar shaped Ga 2 O 3 particles, they seem aggregated and less dispersed.As discussed later, the columnar shaped Ga 2 O 3 particles are very likely playing a key role in the photocatalysis.In this respect, crystal structures of the supporting oxides seem to play an important role.And, a valency of cations in the supporting oxides of three is a critical factor to increase the CO production rates as shown in Table 2.The corresponding oxides show layered structure like perovskite or its modified type as Ga 2 O 3 , while most of the other oxides showing lower CO 2 production rates are cubic or tetragonal.This suggests that on the latter oxides, Ga 2 O 3 is rather free to aggregate as larger particles, while on the former oxides, their lattice similarity to Ga 2 O 3 would inhibit free growth of Ga 2 O 3 or dissolution of their cations into Ga 2 O 3 .The cation dissolution could introduce lattice distortion that appeared as defective -phase and inhibits the growth of Ga 2 O 3 particles. As seen in Figures 1 and2 and Table 2, the supporting oxides can be roughly divided into two groups, one giving higher activity and the other giving lower activity than the activity of non-supported mixed phased Ga 2 O 3 . Although the band gap energies of those supporting oxides resulting in higher production rates both for CO and H 2 are larger than 4 eV, no correlation appears between the production rates of CO and H 2 , suggesting both reactions proceeded separately as already observed in our previous work on Ga 2 O 3 / Al 2 O 3 . 18Furthermore, only the CO production rates can be correlated to various characteristics of the supporting oxides as discussed in the following.Therefore, the following discussion is focused to correlate the CO production rate to (1) material properties of the supporting oxide, (2) modifications of chemical nature and (3) microstructure or crystalline structure of Ga 2 O 3 . 4.1 Material Properties.There are two properties of the supporting oxides differentiating the changes of the CO production rate: (1) Those supporting oxides having wider band gap than that of Ga 2 O 3 showed higher CO production rates than that of nonsupported Ga 2 O 3 .This indicates that there is some threshold in energy of photo-excited electrons for the CO 2 reduction which is very near the bottom of the conduction band of Ga 2 O 3 .Excited photoelectrons in the wider band gap oxides could be transferred to the conduction band of Ga 2 O 3 and accordingly enhance the reduction. (2) Those oxides having their conduction band more positive than that of Ga 2 O 3 reduced the CO production rate.This clearly correlates to the band gap, because photoexcited electrons in the conduction band of Ga 2 O 3 would easily lose their energy through transition to the conduction band of supporting oxides more positive than Ga 2 O 3 and are not used for CO 2 reduction.Therefore, those oxides of which the conduction band position is lower than 11.03 eV (that of Ga 2 O 3 ) resulted in the higher CO production rate without losing electron energy as clearly seen in Table 2. 4.2 Modification of the Chemical Nature of Ga 2 O 3 .As depicted in Table 2, in all supporting oxides resulting in higher CO production rate, the valency of their cation is either 2 or 4, different from that of Ga (3).The different coordination number would cause instability in Ga 2 O 3 and also make the boundary between Ga 2 O 3 and the support oxide unstable resulting in insufficient electric junction.MgO and ZnO reacted with Ga 2 O 3 to form composite oxides.On ZSM-5, TiO 2 and CeO 2 Ga 2 O 3 turned to GaOOH.Such changes in surface chemical nature caused the lower CO production rate. It should be mentioned that without Ga 2 O 3 , both La 2 O 3 and Al 2 O 3 , which showed high activity when they were used as a support, hardly showed catalytic activity, as shown in Figure S6 in supporting information.This clearly indicates that the active site of CO 2 reduction is on Ga 2 O 3 particles but not supporting oxides or other newly formed compounds. 4.3 Microstructure of Ga 2 O 3 .As depicted in Table 2, the crystalline structure of Ga 2 O 3 in all samples showing higher CO production rate consisted of either and phase or their mixture making columnar shaped small particles.This is consistent with our previous finding 15 that on photocatalytic reduction using Ga 2 O 3 without support oxides, the mixture of two different phases such as and phases or defective phase of Ga 2 O 3 shows high activity.Considering that without a supporting oxide defective -Ga 2 O 3 alone did not show high activity, 18 defective -Ga 2 O 3 on supporting oxides would be further modified.Possible modifications are distortion of crystalline structure caused by mismatch to that of the supporting oxide, dissolution of cations of the supporting oxide, appearance of boundaries between the Ga 2 O 3 particles and the supporting oxides including the formation of a heterojunction.Another important factor is dispersion of Ga 2 O 3 without segregation as seen in Figure 6. In summary, the present research clearly shows following, (1) The active sites for the photocatalytic CO 2 reduction with water on Ga 2 O 3 supported by metal oxides are on columnar shaped Ga 2 O 3 particles which are well dispersed on the supporting oxide and exhibited mixed phase of and or defective phase. (2) Any changes of chemical nature in Ga 2 O 3 given by the supporting oxides reduced the CO production rate. (3) In order to promote the photocatalytic activity on CO 2 reduction with water, there seems to be a threshold in energy of photoexcited electrons, which is near the bottom of the conduction band of Ga 2 O 3 or a band position of supporting oxides more negative than that of Ga 2 O 3 ."
  },
  {
    "title": "Conclusions",
    "content": "We have examined photocatalytic activities of Ga Both water splitting and CO production proceeded simultaneously but independently at different active sites with each other.CO production rates for all Ga 2 O 3 /metal oxides are well correlated to various properties of supporting oxide as there are four main factors increasing the CO production rate: (1) wider band gap than Ga 2 O 3 (2) more negative conduction band position than Ga 2 O 3 (3) columnar shaped Ga 2 O 3 particles consisting of mixed phases of and or defective phase well dispersed on supporting oxide.(4) the valency is three for the cation of supporting oxides. From all results, we can conclude that: (i) The active sites for the CO production are on columnar shaped Ga 2 O 3 particles, which are well dispersed on the supporting oxide and consist of mixed phases of and or defective phase.Although the boundary between the Ga 2 O 3 particles and the supporting oxides could be the possible active sites, their area would not be large enough.(ii) To allow the formation of the nano to sub-micrometer sized Ga 2 O 3 particles with the columnar shape on the supporting oxides, crystalline structure and valency of the cation in the supporting oxides are quite important.(iii) There is a threshold in energy of photoexcited electrons to promote CO 2 reduction with water which is close to the band gap energy of Ga 2 O 3 . Diffuse reflectance UVvis spectra of metal oxide supported Ga 2 O 3 samples and results of their photocatalytic reduction of CO 2 or He with H 2 O are given in supporting information.This material is available on https://dx.doi.org/10.1246/bcsj. 20190366. Figure 1.Production rates of CO in the photocatalytic reduction of CO 2 with H 2 O for Ga 2 O 3 supported by various metal oxides indicated in the figure after 5 h of reaction.The inset is magnified with about 40 times the production rates. Figure 2. Production rates of H 2 in the photocatalytic reduction of CO 2 with H 2 O for Ga 2 O 3 supported by various metal oxides indicated in the figure after 5 h of reaction.The inset is magnified with about 4 times the production rates. Figure 3.Time course of CO (black circle), H 2 (gray circle) and O 2 (white circle) production rates for the sample (Ga 2 O 3 /Al 2 O 3 ). Figure 4. Diffuse reflectance UVvis spectra of oxides used as a support for Ga 2 O 3 catalysts showing higher activity, (a) Nd 2 O 3 , (b) Yb 2 O 3 , (c) Gd 2 O 3 , (d) La 2 O 3 , (e) Y 2 O 3 , and (f ) Al 2 O 3 . Figure 5. Diffuse reflectance UVvis spectra of oxides used as a support for Ga 2 O 3 catalysts showing lower activity, (a) MnO 2 , (b) Fe 2 O 3 , (c) Cr 2 O 3 , (d) In 2 O 3 , (e) CeO 2 (f ) ZnO, (g) TiO 2 , (h) ZrO 2 , (i) MgO and (j) ZSM-5. (a) show either or both of these small peaks, i.e.Ga 2 O 3 /Nd 2 O 3 and Ga 2 O 3 /Gd 2 O 3 (b, c) have peaks like -Ga 2 O 3 , and Ga 2 O 3 /Al 2 O 3 and Ga 2 O 3 /La 2 O 3 (d, e) have peaks like defective -Ga 2 O 3 .In Figure 6(b), the peaks derived from Ga 2 O 3 in Ga 2 O 3 /MgO (f ) and Ga 2 O 3 /ZnO (k) are significantly shifted, which well corresponds to the formation of composite oxides observed by the XRD analysis.In the other samples of Figure 6(b), characteristic peaks of and were not appreciable.3.6 FE-SEM Observation. shows images of selected samples taken with a field emission scanning electron microscope (FE-SEM) in a backscattered electron mode, of which contrast well corresponds to the mass of constituent atoms of the samples.On Ga 2 O 3 /La 2 O 3 (a) and Ga 2 O 3 /Al 2 O 3 (b), Ga 2 O 3 particles showing columnar shape with their length of around 200 500 nm and diameter of a few nanometer are clearly distinguished from supporting metal oxides of La 2 O 3 and Al 2 O 3 with micrometer sizes.In addition, Ga 2 O 3 particles were well dispersed.The particle sizes of Ga 2 O 3 on La 2 O 3 were a little larger than those on Al 2 O 3 , which would be the cause of lower Figure 7. FE-SEM images of (a) Ga 2 O 3 /La 2 O 3 (b) Ga 2 O 3 / Al 2 O 3 (c) Ga 2 O 3 /MgO (d) Ga 2 O 3 /ZrO 2 . Figure 6.Fourier transforms of EXAFS spectra for metal oxide supported Ga 2 O 3 , -Ga 2 O 3 , -Ga 2 O 3 , (a) Ga 2 O 3 / Y 2 O 3 (b) Ga 2 O 3 /Nd 2 O 3 (c) Ga 2 O 3 /Gd 2 O 3 (d) Ga 2 O 3 / Al 2 O 3 (e) Ga 2 O 3 /La 2 O 3 (f ) Ga 2 O 3 /MgO (g) Ga 2 O 3 /CeO 2 (h) Ga 2 O 3 /ZrO 2 (i) Ga 2 O 3 /TiO 2 (j) Ga 2 O 3 /ZSM-5 (k) Ga 2 O 3 /ZnO.White arrow indicated the characteristic peak of -Ga 2 O 3 and black arrows indicated those of -Ga 2 O 3 . 2 O 3 supported by various metal oxides (MgO, Al 2 O 3 , TiO 2 , Cr 2 O 3 , MnO 2 , Fe 2 O 3 , ZnO, Y 2 O 3 , ZrO 2 , La 2 O 3 , CeO 2 , Nd 2 O 3 , Gd 2 O 3 , Yb 2 O 3 , ZSM-5) for CO 2 reduction with water under UV light irradiation without a noble metal cocatalyst and compared their catalytic activities in terms of band gap widths, crystalline structures and other characteristics of the supporting oxides. The time courses of CO, H 2 and O 2 production rates for all samples showing O 2 evolution.Samples CO H 2 O 2 CO H 2 O 2 CO H 2 O 2 CO H 2 O 2 CO H 2 O 2 Bull.Chem.Soc.Jpn.2020, 93, 694-700 doi:10.1246/bcsj.20190366 2020 The Chemical Society of Japan 695 Bull.Chem.Soc.Jpn.2020, 93, 694-700 doi:10.1246/bcsj.20190366 2020 The Chemical Society of Japan Bull.Chem.Soc.Jpn.2020, 93, 694-700 doi:10.1246/bcsj.20190366 2020 The Chemical Society of Japan 697 Bull.Chem.Soc.Jpn.2020, 93, 694-700 doi:10.1246/bcsj.20190366 2020 The Chemical Society of Japan Bull.Chem.Soc.Jpn.2020, 93, 694-700 doi:10.1246/bcsj.20190366 2020 The Chemical Society of Japan 699 Bull.Chem.Soc.Jpn.2020, 93, 694-700 doi:10.1246/bcsj.20190366 2020 The Chemical Society of Japan"
  }
]