[
  {
    "title": "Doi",
    "content": "10.1016/j.jcis.2017.05.045"
  },
  {
    "title": "Article_Title",
    "content": "Rutile TiO2 nanocrystals with exposed {3 3 1} facets for enhanced photocatalytic CO2 reduction activity"
  },
  {
    "title": "Abstract",
    "content": "Rutile TiO 2 nanocrystals with exposed high-index facets has been investigated in detail by high-resolution transmission electron microscopy (HR-TEM) and selected-area electron diffraction (SAED).It was found that the each branched nanocrystals are bound by 4 facets of high-index 331.Additionally, rutile 101 twinned structures are formed in the boundary of branches during the growth of multi branches in a hierarchical flower-like nanostructures.Notably, the synthesized nanostructures showed significantly higher photocatalytic activities than that of rod particles with exposed 110 facets in photocatalytic CO 2 reduction.Correlating the presence of high-energy surface on rutile nanocrystals with the photocatalytic activity clearly shows the significant role of surface steps in enhancing intrinsic activity for CO 2 reduction to methanol."
  },
  {
    "title": "Experimental",
    "content": "TiO 2 was synthesized using a water-soluble titanium-glycolate complex of a precursor 14,15.Chemicals were purchased from Kanto Chemicals Co., Inc.Briefly, peroxo-titanic acid solution was prepared by the addition of NH 3 solution and a H 2 O 2 solution to Ti metal powder. Then, glycolic acid was added to the yellow solution of peroxo-titanic acid.Excess amounts of ammonia and hydrogen peroxide were removed by heat treatment at 353 K. Finally, stable titanium-glycolate complex solution was obtained.After that, picolinic acid was added to the complex solution as an additive.20 mL solution was adjusted using distilled water and sealed in a Teflon-lined stainless steel autoclave; the autoclave was heated at 473 K for 24h.After the autoclave was cool down, the resultant powders were collected by centrifugation and washed with distilled water.Finally, the obtained specimen was dried at 353 K for 1 day.The morphology of particles was observed using a field-emission scanning electron microscope (FE-SEM, Hitachi S-4800) at an accelerating voltage of 5 kV.Transmission electron microscopy (TEM Hitachi H-7650, 100kV), high resolution TEM and selected-area electron diffraction (HR-TEM and SAED, TOPCOM EM-002B, 200 kV) were conducted. The photocatalytic reduction of CO 2 was carried out in an aqueous solution of CO 2 under UV-Vis light irradiation according to our previous report 16.Briefly, 0.05 g catalyst was dispersed in 30 ml distilled water containing sodium bicarbonate (NaHCO 3 , 0.08 M).The solution was prepared in a 30 cm x 15 cm x 5 cm reactor.Fixed catalyst concentration was used in all experiments, aiming to eliminate uncertainties associated with light reflection and reactor geometry.The ultrahigh purity CO 2 (99.99) was pursed continuously into the reactor at a rate of 0.1 L min -1 for 0.5 h to remove oxygen in the water, and saturate carbon dioxide in the solution. The solution temperature was kept constant by a water bath.UV-Vis light irradiation was provided by a 500 W high-pressure Xe lamp placed above the reactor.A Pyrex glass was placed on top of the reactor to cut off light with wavelengths 300 nm.The photocatalytic reaction was continued up to 9 h and in every 1 h interval, the solution in the reactor was sampled.The sample solution was centrifuged and analyzed CH 3 OH by GC-FID with a 2 m Porapak Q column.The rate of CH 3 OH evolution was defined as the total amount of evolved CH 3 OH divided by the reaction time. The photoreduction of CO 2 by various catalysts has been extensively studied 171819.The following reaction was proposed for the selective production of CH 3 OH: Prior to the photocatalytic reaction, the TiO 2 catalyst was dispersed in distilled water and irradiated by UV light from a high-pressure mercury lamp for 5 h, aiming to remove any organic residues on TiO 2 surface.We carried out control experiments in dark first and no CH where I is light intensity (2.5 mW cm -2 and 0.12 mW cm -2 for UV and visible light, respectively); S is the irradiated area of the reactor (30 x 15 cm 2 ); E is the photon energy, (6.63 x 10 -19 J at 300 nm and 4.97 x 10 -19 J at 400 nm); N A is the Avogadro number (6.022 x 10 23 mol -1 )."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Typically, rutile nanocrystals with exposed high-index facets were obtained by hydrothermal treatment of titanium-glycolate complex in the presence of picolinic acid as a structure-directing and shape-controlling agent 15.The X-ray diffraction pattern of the particles can be assigned to the tetragonal rutile TiO Combined SAED, HR-TEM analyses and structural illustration enables to assign the exposed crystal facets of tetrahedral TiO 2 .In previous report, we observed the crystal in 110 zone axis that the side planes with an interfacial angle, of approximately 19 -20.5, can be assigned to high-index 331 facets 15.The 331 planes is periodically constituted in two (110) terraces and one (111) step (Fig. 3b).To obtain HR-TEM image in Fig. 2, we tilted electron beam direction to observe the particle in 010 zone axis.In this direction, the edge region of tetrahedral crystal is very thin, allow us to observe structure in atomic-scale resolution.Thus, the atomic stepped edge can be observed in HR-TEM image taken from a side edge as shown in Fig. 2e.The angle of the vertical edge of the tetrahedral crystal with 110 plane was determined of 272, which matchs with the value corresponding to the 331 facets in Table 1 (27.38).Furthermore, in Fig. 2e, the d spacing between adjacent lattice planes of 0.23 nm coresponds to the 200 planes and the atomic steps can be clearly observed, matching well with atomic model of crystal having 331 facets viewed from 010 direction in Fig. 2f.The observed angle at 37.1 and 57.2, located on the top apex of pyramidal branch, correspond to the 221 and 111 facets respectively (Table 1).The (221) surface, periodically constituted in one (110) terraces and one (111) step, have been observed in rutile SnO 2 3.On the basic of this HR-TEM analysis and SAED patterns from two electron beam directions, we conclude that the rutile crystals appear with mainly exposed 331 facets.From on SEM and TEM images, we noted that the interfacial angles of the branches are not the same, but vary from branch to branch.The exposed facets of the rutile structures are different in the branches and they might be one of the theoretical surfaces presented in Table 1.The photocatalytic generation of methanol from CO 2 reduction of the synthesized particles was shown in Fig. 5 and Table 1.The photocatalytic activity of flower-like particles prepared using titanium-glycolate with picolinic acid additive was evaluated and rutile rod-like particles with exposed 110 facets, which were synthesized by the same method using glycolic acid additive, were used as reference.The rod-like rutile with SEM image shown in inset of Fig. 5 was synthesized by the hydrothermal treatment of titanium-glycolate (5 mmol) with glycolic acid additive (15 mmol) at 473 K for 100 h which has been found to be highly active photocatalyst 24.Prior to the photocatalytic evaluation reaction, all catalyst samples dispersed in distilled water were irradiated by UV light from high-pressure mercury lamp for 10 h to eliminate organic residues on the TiO 2 surface, if any.The as-prepared samples could act as catalyst for reduction of CO 2 and methanol amount is proportional to the light irradiation time.As expected, the methanol yield of the flower-like particles (0.569 mol g -1 h -1 ) was much higher than that of the rod-like particles (0.388 mol g -1 h -1 ) despite the lower specific surface area of the former one (17 m 2 g -1 compared to 21 m 2 g -1 ).The higher catalytic activity of the flower-like particles may be attributed to several factors.Firstly, their rich of stepped surface is of particular benefit to improve the catalytic activity.Secondly, the presence of both 110 and 111 facets could lead the efficient separation of photogenerated charges among the co-exposed crystal facets 25.For instance, Ohno et al. have demonstrated that the (110) face provides reductive sites and that the (111) face provides oxidative sites based on the photodeposition of Pt and PbO 2 26.Thus, the efficient separation of photo-excited electrons and positive holes to different crystal faces appears to be major factor affecting the photocatalytic activity in the present case (Fig. 6).A similar tendency has been observed in the photocatalytic CO 2 reduction over anatase nanocrystals which showed that TiO 2 nanocrystals with coexposed 101 and 001 facets exhibited a more effective photocatalytic performance than those with a single 101 or 001 planes 27,28.This is primarily because a \"surface heterojunction\" is formed between 001 and 101, where photogenerated electrons favorably transfer from 001 to 101, while holes migrate from 101 to 001, resulting in the enhanced separation of e --h 28.In rutile crystals, the \"surface heterojunction\" between 110 and 111 could also induce spatial separation of redox sites and the phenomena has also been found in shape-controlled brookite nanocrystals 29,30."
  },
  {
    "title": "Conclusions",
    "content": "In conclusion, rutile nanocrystals with exposed high-index facets have been synthesized and its high-energy surface structure and twinned boundary were investigated by advanced electron microscopy.On the basic of this HR-TEM analysis and SAED patterns from two electron beam directions, it proves firmly the presence of high-index 331 facets on the crystals. The tetragonal pyramidal nanocrystals show sixfold twinning structure bound together by 101 twinned planes.With their rich edges and corner atoms structure, the synthesized rutile nanostructures are highly efficient for photocatalytic reduction of CO 2 the concepts of shape-controlled nanocrystals for enhanced reactivity should be extended for other important technological applications such as sensing, electronic, energy storage and conversion. Fig. 1.(a) XRD pattern, (b) SEM image and (c, d) TEM images of rutile nanostructures. Fig. 2 shows the HR-TEM images (TOPCOM EM-002B, 200 kV) of a typical branch and Fig. 2. (a) TEM image of a rutile flower-like particle; (b) HR-TEM image of top apex of a Fig. 3. Schematic illustrations of rutile nanocrystal having high-index 331 facets: (a) Three Fig. 4. (a) SAED pattern of a two interconnected pyramidal branches of a flower-like particle; (b) Fig. 5.The CH 3 OH yield in the photocatalytic reduction of CO 2 by rod-like (dark) and flower-like Fig. 6.The schematic illustrations of reduction of CO 2 on 110 surface and the movement of 3 OH was detected for all tested catalysts.Similarly, no CH 3 OH was detected for control experiments under light irradiation but without catalyst.Preliminarily results from these control experiments indicate that both light irradiation and catalysts are indispensible for CO 2 photoreduction to CH 3 OH.The reaction quantum yield (QE) is estimated using CH 3 OH yield noting that six electrons are required to reduce CO 2 to CH 3 OH 20.The equation is as follows: Methanol () 100 x 6 x mole of CH 3 OH yield/mole of photon absorbed by catalyst(2) Photocatalytic performance and BET specific areas of the TiO 2 catalysts a Kojundo Chemical Laboratory Co., Ltd. This work was partly supported by Grant-in-Aid for Basic Research from the National Foundation for Science and Technology Development (NAFOSTED) and Vietnam National University. Rutile TiO 2 nanocrystals are exposed high-index 331 facets.The rutile 101 twinned structures are formed at the boundary of the tetragonal pyramidal branches which are highly active for photocatalytic reduction of CO 2 ."
  }
]