[
  {
    "title": "Doi",
    "content": "10.1016/j.jmst.2021.08.019"
  },
  {
    "title": "Article_Title",
    "content": "Constructing S-scheme 2D/0D g-C3N4/TiO2 NPs/MPs heterojunction with 2D-Ti3AlC2 MAX cocatalyst for photocatalytic CO2 reduction to CO/CH4 in fixed-bed and monolith photoreactors"
  },
  {
    "title": "Abstract",
    "content": "Exfoliated 2D MAX Ti 3 AlC 2 conductive cocatalyst anchored with g-C 3 N 4 /TiO 2 to construct 2D/0D/2D heterojunction has been explored for enhanced CO 2 photoreduction in a fixed-bed and monolith photoreactor.The TiO 2 particle sizes (NPs and MPs) were systematically investigated to determine effective metalsupport interaction with faster charge carrier separation among the composite materials.When TiO 2 NPs were anchored with 2D Ti 3 AlC 2 MAX structure, 10.44 folds higher CH 4 production was observed compared to anchoring TiO 2 MPs.Maximum CH 4 yield rate of 2103.5 mol g -1 h -1 achieved at selectivity 96.59 using ternary g-C 3 N 4 /TiO 2 /Ti 3 AlC 2 2D/0D/2D composite which is 2.73 and 7.45 folds higher than using binary g-C 3 N 4 /Ti 3 AlC 2 MAX and TiO 2 NPs/Ti 3 AlC 2 samples, respectively.A step-scheme (S-scheme) photocatalytic mechanism operates in this composite, suppressed the recombination of useful electron and holes and provides higher reduction potential for efficient CO 2 conversion to CO and CH 4 .More importantly, when light intensity was increased by 5 folds, CH 4 production rate was increased by 3.59 folds under visible light.The performance of composite catalyst was further investigated in a fixed-bed and monolith photoreactor and found monolithic support increased CO production by 2.64 folds, whereas, 53.99 times lower CH 4 production was noticed.The lower photocatalytic activity in a monolith photoreactor was due to lower visible light penetration into the microchannels.Thus, 2D MAX Ti 3 AlC 2 composite catalyst can be constructed for selective photocatalytic CO 2 methanation under visible light in a fixed-bed photoreactor."
  },
  {
    "title": "Experimental",
    "content": "The chemicals used for the preparations of catalysts were melamine (C 3 H 6 N 6 , MW 126.12g/mol, purity 99, Sigma-Aldrich), titanium (IV) isopropoxide (TTIP, tetraisopropyl orthotitanate, C 12 H 28 O 4 Ti, purity 97, MW 284.22g/mol), acetic acid (CH 3 COOH, MW 60.05 g/mol, 99.8), 2-propanol (MW 60.1 g/mol and CH 2 CH(OH)CH 3 , Merck).Besides, titanium aluminum carbide (Ti 3 AlC 2 ) was purchased from China (Famous Chemical) and monoliths of 100 channels per square inch (CPSI 100) were purchased from Pingxiang Meitao, China. The g-C 3 N 4 was synthesized using a simple heating method, in which, melamine was heated in a furnace at 550 C for 2 h under air atmosphere 41 .The ceramic vessel was covered with a lid, where, furnace heating rate of 10 C min -1 was adjusted to achieve temperature of 550 C.After grinding bulky material, it was dispersed in acetic acid for surface modification and finally washed with DI water and centrifuged to get graphitic carbon nitride (g-C 3 N 4 ). The TiO 2 MPs/Ti 3 AlC 2 composite samples were synthesized using a simple impregnation method.TiO 2 MPs (Sigma-Aldrich, anatase) were dispersed in a methanol solution and were stirred well for their uniform suspension 32 .Afterwards, specific amount of exfoliated Ti 3 AlC 2 was added into above suspension and stirred for 24 h to get their good interaction.Finally, suspension was oven dried for 24 h at 100 C to get TiO 2 MPs/Ti 3 AlC 2 composite. Sol-gel method was used for fabricating Ti 3 AlC 2 /TiO 2 NPs composite using TTIP as the precursor.Typically, TTIP of 10 mL dis-persed in 2-propanol was hydrolyzed using acetic acid (1M) to get titanium sol according to our previous work 42 .In parallel, Ti 3 AlC 2 was dispersed in a methanol solution under stirring for 24 h to get exfoliated Ti 3 AlC 2 multi-layers.The specific amount of Ti 3 AlC 2 were added to above titanium sol under stirring and this process was continued for another 12 h to get thick titanium sol.The sol obtained was oven dried at 100 C overnight and finally calcined for 2 h at 500 C to get Ti 3 AlC 2 anchored TiO 2 NPs composite.The pristine TiO 2 NPs were synthesized using the same method, but without the addition of Ti 3 AlC 2 . The g-C 3 N 4 coupled TiO 2 and Ti 3 AlC 2 composite samples were synthesized using sol-gel method.As discussed above, g-C 3 N 4 were obtained through heating of melamine, whereas, exfoliated Ti 3 AlC 2 was employed for the preparation of composite samples.Specifically, titanium sol was prepared as discussed above and specific amount of g-C 3 N 4 and Ti 3 AlC 2 were added into it and was stirred for 24 h to get homogeneous thick sol.The suspension was dried for 24 h at 100 C and finally calcined for 2 h at 500 C and named as TiO 2 NPs/Ti 3 AlC 2 /g-C 3 N 4 composite.Similar to composite catalyst, TiO 2 coupled g-C 3 N 4 composite was synthesized using sol-gel method without adding Ti 3 AlC 2 material. Monolithic TiO 2 -loaded Ti 3 AlC 2 and g-C 3 N 4 composite was synthesized using modified sol-gel dip-coating approach.Before loading the catalysts over the monolithic surface, monoliths preparation was conducted.The specific sizes monoliths (thickness 2 cm and radius 3 cm) were washed before being loaded with catalyst.The composite sol obtained as discussed above, before drying was placed in a beaker for dip-coating.Before coating, initial weights of the monoliths were calculated and after dip-coating, the final monolith weight was noted.After coating, loaded catalyst was controlled by repeating the same coating procedure.After dip-coating, excess amount of catalyst was removed using hot compressed air with the help of air dryer.Finally, monoliths, after drying at 100 C for 24 h were calcined for 2 h at 500 C.The composite obtained was named as monolithic TiO 2 /Ti 3 AlC 2 /g-C 3 N 4 .The amount of catalyst loaded over the monolithic channels was calculated by subtracting the final weight of monolith from the initial ones.The estimated amount of catalyst loaded was 250 mg and schematic illustration of composite catalyst preparation is shown in Fig. 1. All the catalyst samples were characterized using several analytical techniques.The purity and crystal phases structures were analyzed using XRD (X-ray powder diffraction) with the help of Bruker Advance D8 diffractometer.The Raman analysis was further conducted with the help of HORIBA Scientific Spectrophotometer (laser 532 nm) to confirm the interaction among the composite materials.The structure and morphology were obtained suing FE-SEM (Scanning electron microscopy, Hitachi SU8020) and HRTEM (High resolution transmission electron microscopy, JEOL JEM-ARM 200F).The chemical composition and elemental states were measured through XPS (X-ray photoelectron Spectroscopy) using Axis Ultra DLD Shimadzu spectrometer.The optical response of the materials was measured through UV-visible diffuse reflectance spectrometer (DRS), using spheres for loading powder samples with (UV-3600 Plus Spectrometer).The PL (photoluminescence) analysis were conducted with HORIBA Scientific spectrometer, laser 325 nm). The experimental set-up for investigating the performance of synthesized photocatalysts for CO 2 reduction in a fixed bed and a monolith photoreactor is shown in Fig. S1.Fig. S1(a) shows the schematic illustration of fixed bed reactor equipped with a glass window, mass flow controllers and online products analysis.A 35 W HID car lamp with intensity 20 mW cm -2 was located at the top of quartz glass window and water saturator was connected with the reactor to carry moisture during the CO 2 entering into the reactor.The powder photocatalyst (150 mg) was uniformly dispersed inside the reactor chamber at the bottom surface and the interaction between the reactants, light source and catalyst was only at the external exposed surface area.Before that, reactor was purged before starting CO 2 reduction experiments for 30 min.Afterwards, CO 2 (10 mL min -1 , purity 99.99 ), was saturated with water vapors by passing through the water.Feed mixture (CO 2 and H 2 O) was constantly flowing for 30 min through the reactor to saturate the catalyst surface before starting the experiment.Before truing on the lamp reactor outlet and inlet valves were closed for batch mode experiments.The schematic of monolith photoreactor experimental set-up has been demonstrated in Fig. S1(b).The reactor chamber was the same as like the fixed bed reactor, however, the catalyst was immobilized over the monolithic channels before inserting into the reactor.All the experimental parameters and operating procedure was similar to fixed bed reactor as discussed above.Two types of light sources i.e., 35 and 300 W having intensities 20 and 100 mW cm -2 , respectively, were used.The products were analyzed using GC-TCD/FID connected with capillary column (Carboxen-1010 PLOT). In photocatalytic CO 2 reduction applications, the performance of catalysts is greatly altered using different types of light sources and illuminated surface area.This performance is also dependent on the types of photoreactor employed.As the number of electrons used for different products varied based on the types of products such as 2 and 8 electrons would be consumed for the production of one mole of CO and CH 4 , respectively.Thus, quantum efficiency analysis is very important to evaluate photocatalytic CO 2 reduction system under different operating conditions.In general, quantum yield (QY) is a measure of production rate of a specific product per unit time to the amount of photon flux consumed in a unit time.This also reflects the efficient production and utilization of electrons and holes during photocatalysis process.The QY for CO and CH 4 was calculated according to Eqs. ( 1) and ( 2) 26 , 43 .The photon flux was estimated using the Eq. ( 3) , which involves the light intensity and wavelength of light irradiation. where, is wavelength of light, h is planks constant (6.62 10 -34 J) and v is photon density (3.0 10 8 ).Finally, electron selectivity towards specific products was calculated based on number of electrons consumed and amount of specific product obtained as demonstrated in Eqs. ( 4) and ( 5) 44 . where 2 and 8 are the electrons that would be consumed for CO and CH 4 production, respectively, and RCO and RCH 4 are the production rates of CO and CH 4 during photocatalytic CO 2 reduction with H 2 O under visible light irradiation."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The crystal structure of the pure and modified samples was determined using XRD analysis as presented in Fig. 2 .XRD analysis of TiO 2 NPs, TiO 2 MPs, Ti 3 AlC 2 MAX and their composite samples is shown in Fig. 2 (a).In both TiO 2 NPs and MPs samples, pure anatase phase was achieved, which confirms their successful fabrication.Similarly, all the peaks of Ti 3 AlC 2 are assigned to MAX structure and similarly reported in Ref. 40 .When Ti 3 AlC 2 was anchored with TiO 2 MPs through physical mixing method, there was no effect on the crystalline structure.However, crystal size of TiO 2 was further reduced when anchored with Ti 3 AlC 2 through sol-gel method.This confirms that sol-gel method is an effective approach to construct well-designed heterojunction with controlled growth of TiO 2 NPs and would be beneficial for promoting charge carrier separation 32 . The lattice structure and phase composition of g-C 3 N 4 , g-C 3 N 4 loadedTiO 2 NPs and 2D MAX Ti 3 AlC 2 based photocatalysts were further investigated by XRD patterns and their results are demonstrated in Fig. 2 (b).Pure g-C 3 N 4 presents two peaks at 2 of 13.07 and 37.39 , attributed to the (100) and (002) facets of g-C 3 N 4 . When g-C 3 N 4 was loaded with TiO 2 through sol-gel method, TiO 2 crystalline size was reduced, whereas, g-C 3 N 4 peaks were not obvious due to its lower crystallinity compared to TiO 2 NPs.A similar trend in reduced crystal size of TiO 2 was obtained with Ti 3 AlC 2 , which confirms their good interaction.When g-C 3 N 4 was anchored with Ti 3 AlC 2 , all the peaks of both the materials were observed, which confirmed successful synthesis of this composite without any alternation in their structure and phase change.Finally, XRD patterns of g-C 3 N 4 /TiO 2 /Ti 3 AlC 2 MAX composite confirms the presence of all the peaks without any alternation in their peak position, which further confirms a successful synthesis of the ternary composite catalyst. The Raman analysis was performed to estimate the interaction among the materials and their successful fabrication through different methods.Fig. 3 (a) shows Raman results of TiO 2 of different sizes and their interaction with Ti 3 AlC 2 2D MAX structure.Exfoliated Ti 3 AlC 2 reflects vibrational modes at 151.4, 204.56, 265.23, 411.16 and 605.28 cm -1 , corresponding to 1 , 2 , 3 , 4 , and 5 characteristics modes of Ti 3 AlC 2 MAX phase, confirming the presence of Ti and Al 37 .For TiO 2 NPs, characteristics modes were appeared at 142.03, 19.49, 394.24, 511.80 and 635.01 cm -1 , corresponds to E g1 , E g2 , B 1g , A 1g B 1g and A g3 modes, confirming successful fabrication of single phase TiO 2 NPs 26 .When TiO 2 NPs and TiO 2 MPs were loaded over the Ti 3 AlC 2 surface, band positions were shifted towards higher values, which confirm, successful fabrication of composite. The structural and vibrational modes of g-C 3 N 4 , g-C 3 N 4 /Ti 3 AlC 2 MAX and g-C 3 N 4 based composites were further analyzed using Raman spectroscopy and the results are presented in Fig. 3 (b).Raman modes of pristine g-C 3 N 4 confirm successful synthesis of graphitic structure of carbon nitride as similarly observed by XRD analysis 45 .When Ti 3 AlC 2 was anchored with Ti 3 AlC 2 , all the Raman modes were appeared, which confirms their successful fabrication.Comparatively, when TiO 2 was loaded with g-C 3 N 4 /Ti 3 AlC 2 MAX, bands positions were shifted towards higher values, which confirm their good interaction, synthesized through sol-gel method 37 .All these results have good agreement with XRD data and confirm successful fabrication of composite samples without alternation in their phase structure. The morphology of pristine TiO 2 NPs, pristine TiO 2 MPs and NPs/MPs loaded Ti 3 AlC 2 MAX was further investigated using FE-SEM and TEM characterization techniques as shown in Fig. 4 .Fig. 4 (a) shows large size TiO 2 particles with particle size distribution of 60 to 200 nm with mean 130 nm.Similarly, pristine TiO 2 NPs were obtained using sol-gel method as presented in Fig. 4 (b).Obviously smaller sized TiO 2 NPs with size distribution of 12 to 40 nm and mean of 20 nm was observed.The morphology of exfoliated Ti 3 AlC 2 multilayers has been illustrated in Fig. 4 (c).Evidently, using ultrasonic approach, Ti 3 AlC 2 sticky sheets can be exfoliated to get larger exposed surface area.Fig. 4 (d) shows the interaction of TiO 2 MPs with 2D Ti 3 AlC 2 MAX nanosheets, in which, TiO 2 MPs were distributed over the Ti 3 AlC 2 sheets, but their interaction was not very good due to using large size TiO 2 particles.However, a good dispersion with uniform distribution of TiO 2 NPs over the entire surface of 2D Ti 3 AlC 2 multilayers was achieved using solgel method as demonstrated in Fig. 4 (e).All these findings confirm that good distribution and interaction of TiO 2 with Ti 3 AlC 2 could be achieved using sol-gel method. The morphology of TiO 2 NPs loaded 2D Ti 3 AlC 2 sheets were further examined using TEM as shown in Fig. 4 (f).Obviously, TiO 2 NPs are evenly distributed over the 2D layers of Ti 3 AlC 3 with their good interaction.Furthermore, HRTEM images in Fig. 4 (g) presents a good interaction with heterojunction formation between the ma-terials, which would be beneficial for promoting photocatalytic activity.The d-spacing in Fig. 4 (h-i) of 0.214 and 0.36 nm were obtained for Ti 3 AlC 2 and anatase phase TiO 2 NPs.Thus, successful fabrication of 0D TiO 2 NPs/2D Ti 3 AlC 2 heterojunction can be developed using ultrasonic assisted sol-gel approach.5 (d,e), confirming good interaction among the three materials. The interaction among the TiO 2 /g-C 3 N 4 dispersed Ti 3 AlC 2 was further confirmed using TEM analysis as presented in Fig. 5 (f).Evidently, 2D/2D g-C 3 N 4 /Ti 3 AlC 2 MAX heterojunction was successfully synthesized with their good interaction.Fig. 5 (g) presents HRTEM image of the composite, demonstrating good interaction.The d-spacing results in Fig. 5 (h-j) further confirms lattice fringes of 0.467, 0.36 and 0.322 nm for Ti 3 AlC 2 , TiO 2 NPs and g-C 3 N 4 , respectively.Thus, g-C 3 N 4 /Ti 3 AlC 2 MAX 2D/2D heterojunction dispersed with TiO 2 NPs were successfully fabricated using modified sol-gel method.It could be seen that there was a positive shift in peaks of Ti, N, C and Al in the composite samples, which confirms good interaction among the component samples, which would be beneficial for efficient charges separation. The light harvesting efficiency of TiO 2 NPs, g-C 3 N 4 , g-C 3 N 4 /TiO 2 and composite was determined by UV-visible DRS as demonstrated in Fig. 7 (a).Using TiO 2 , light absorption in the UV region was ob-served, whereas, g-C 3 N 4 presents light absorption in the visible region.However, Ti 3 AlC 2 did not reflect any peak in UV or the visible region, thus presents light absorption in the entire UV-visible spectrum.The g-C 3 N 4 and Ti 3 AlC 2 composites also shows light absorption in the visible region and similar observation could be seen in the ternary composite photocatalyst.A band gap energy of 3.14 and 2.69 eV was obtained for pristine TiO 2 and g-C 3 N 4 .However, when 2D Ti 3 AlC 2 MAX was dispersed with TiO 2 NPs, 3.22 eV band gap energy was calculated, whereas, TiO 2 /g-C 3 N 4 composite shows a 3.09 eV band gap energy.When Ti 3 AlC 2 was coupled with TiO 2 and g-C 3 N 4 , a band gap of 2.99 eV was estimated.It could be observed that the band gap energy was increased for the composite samples, probably due to introducing intra band gap states, which reflect in the absorption spectrum.In composite samples, inapplicability of Tauc plot for the calculation of band gap energy may results in an inaccurate estimation of E g 46 , 47 .Previously an increased in band gap of Ru/TiO 2 was observed using Tauc plot (based on Kubelka- Munk model) 48 .Similarly, an increased in band gap energy of g-C 3 N 4 /Bt/Ti 3 C 2 heterojunction has been reported by estimating through Tauc plot method 49 .In another work, an increased in band gap of WO 3 /g-C 3 N 4 composite has been reported compared to pristine WO 3 and g-C 3 N 4 samples 50 .All these findings show that Tauc plot can be effectively em ployed for calculating band gap of pure semiconductors.However, it would give inaccurate values of band gap for modified and composite samples. The PL analysis was further performed to understand the charges separation efficiency of pristine and composite samples as shown in Fig. 7 (b,c).Fig. 7 (b) shows PL spectra of TiO 2 NPs, Ti 3 AlC 2 and TiO 2 NPs/MPs loaded Ti 3 AlC 2 samples.It is obvious that highest PL intensity was observed in pristine TiO 2 due to higher charges recombination rate.A much lower PL intensity was observed when TiO 2 was loaded over 2D Ti 3 AlC 2 structure, obviously, due to higher electron conductive ability of MAX phase.Comparing to TiO 2 MPs, much lower PL intensity was achieved with TiO 2 NPs anchored with Ti 3 AlC 2 , due to good interaction and faster electron separation.Fig. 7 (c) shows PL analysis of g-C 3 N 4 and g-C 3 N 4 loaded TiO 2 and Ti 3 AlC 2 composite samples.Using pristine g-C 3 N 4 , highest PL intensity was observed, which was obviously decreased when TiO 2 was coupled with g-C 3 N 4 due to their heterojunction formation.Similarly, g-C 3 N 4 PL intensity was significantly reduced by coupling with Ti 3 AlC 2 due to efficient charges separation through conduc-tive MAX cocatalyst.The lowest PL intensity was achieved using g-C 3 N 4 /TiO 2 /Ti 3 AlC 2 MAX composite photocatalyst.Previously, reduced PL intensity was observed when g-C 3 N 4 was coupled with Ti 3 C 2 due to faster charge carrier separation 34 .In another development, reduced PL intensity in g-C 3 N 4 /Ti 3 C 2 composite was observed due to faster charges separation 44 . The activity of various photocatalysts for CO 2 photoreduction has been evaluated under visible light irradiation.Initially, performance of Ti 3 AlC 2 MAX was tested using TiO 2 NPs and MPs and the best catalyst was further combined with g-C 3 N 4 to construct 2D/0D/2D heterojunction.The performance of composite catalyst was tested in a fixed bed and the monolith photoreactor under visible light irradiation.The performance of photocatalysts was quantified with the incremental production of either CO or CH 4 , which were the major CO 2 reduction products.In order to verify the source of CO and CH 4 production and to confirm that the reaction is really induced by light irradiation during CO 2 photocatalysis, different sets of quality control runs were conducted using the followings: (a) using only photocatalyst under light source with inert gas, (b) Using only CO 2 and H 2 O feed mixture under light flux but without loading photocatalyst.In all types of these experiments, production of either CO or CH 4 was not detected, which elucidates the source of carbon originated from CO 2 during photocatalysis process. The effect of TiO 2 support size on the performance of 2D Ti 3 AlC 2 MAX for photocatalytic CO 2 reduction with H 2 O under UVvisible light has been demonstrated in Fig. 8 .Fig. 8 (a) shows the production of CO over TiO 2 NPs and TiO 2 MPs dispersed over 2D Ti 3 AlC 2 multilayers.Using TiO 2 MPs, very small amount of CO was produced, which was increased by 1.585 folds higher using TiO 2 NPs.This was possibly due to faster charges separation in smaller size TiO 2 particles compared to microparticles, in which, there would be more volume recombination of charge carriers.By incorporating TiO 2 MPs with 2D Ti 3 AlC 2 sheets, TiO 2 MPs efficiency was increased by 2.527 folds, indicating hindered charges recombination with their good separation through highly conductive 2D MAX material.In order to compare the performance with MPs, TiO 2 NPs were also loaded over 2D MAX structure and observed increased CO production rate with CO production efficiency of 1.70 times higher with TiO 2 NPs/Ti 3 AlC 2 MAX composite, compared to pristine TiO 2 NPs, due to faster charge carrier separation.Compared with pure TiO 2 MPs, TiO 2 or TiO 2 MPs/Ti 3 Al 2 MAX, the CO production rate was obviously enhanced, which is 1.06, 1.70, 2.69 folds more than employing TiO 2 MPs/Ti 3 AlC 2 MAX, TiO 2 NPs and TiO 2 MPs photocatalysts, respectively.This confirms that TiO 2 NPs allows more transportation of charge carrier over the 2D MAX structure due to good dispersion and less recombing probability. As displayed in Fig. 8 (b), the continuous production of CH 4 over the entire reaction time and in the presence of pristine and modified photocatalysts was obtained.Using TiO 2 MPs, CH 4 production was very small, which was increased by 2.55 folds higher using small size TiO 2 NPs.This would probably be due to less charge's recombination in TiO 2 NPs compared to large sizes TiO 2 particles, enabling more production of methane during CO 2 photoreduction process.When TiO 2 MPs were loaded over the 2D Ti 3 AlC 2 sheets, efficiency towards CH 4 production was increased by 3.57 folds.However, 10.16 folds higher photoactivity towards CH 4 production was achieved with TiO 2 NPs loaded over Ti 3 AlC 2 nanosheets.This was evidently due to good interaction among the TiO 2 NPs and Ti 3 AlC 2 , compared to TiO 2 MPs, resulting in significantly enhanced photoactivity.All these findings confirm that TiO 2 NPs are more efficient for continuous production of CO and CH 4 during photocatalytic CO 2 reduction by H 2 O in a fixed bed photoreactor. In the current developments, different reports are available on the use of g-C 3 N 4 and TiO 2 based photocatalysts materials for pho-tocatalytic CO 2 reduction to CO and CH 4 under UV and visible light irradiations.In this regards, 2D/2D g-C 3 N 4 /Ti 3 C 2 heterojunction composite was constructed and reported enhanced CO 2 conversion with appreciable production of CO and CH 4 34 .Similarly, ultrathin 2D Ti 3 C 2 cocatalyst with g-C 3 N 4 were investigated and enhanced photocatalytic activity for CO 2 and CH 4 was identified as the main reduction products 40 .Monolithic Pd NPs loaded g-C 3 N 4 /reduced graphene oxide composite has been reported and found efficient CO 2 photoreduction with the production of both CO and CH 4 due to faster charge carrier separation 51 .By comparing all these findings with the current work, 2D Ti 3 AlC 3 MAX dispersed TiO 2 NPs would be a promising heterojunction composite for maximizing photocatalytic activity for selective reduction of CO 2 to CO and CH 4 under visible light in a fixed bed photoreactor. The performance of different sizes TiO 2 particles with their interaction with 2D Ti 3 AlC 2 were further illustrated through schematic as demonstrated in Fig. 9 .Under light irradiation, photogenerated electrons in TiO 2 MPs would be travelling a longer distance to reach the catalyst surface to takes part in CO 2 reduction process as shown in Fig. 9 (a).During this travelling, they have more potential to recombine with the holes with in the surface, resulting in higher charge carrier recombination instead of being consumed during CO 2 reduction process.The lower photocatalytic activity over TiO 2 MPs would also be due to lower production of electrons and limited mass transfer rate within the internal surface, resulting in internal mass transfer limitations.Comparatively, using nanosized TiO 2 particles, they have shorter distance for the electrons to reach the external surface to react with CO 2 for its reduction as displayed in Fig. 9 (b).Using TiO 2 NPs, there is less charges recombination rate compared to large sizes TiO 2 , enabling higher photocatalytic performance under the same reaction conditions.More importantly, when TiO 2 MPs were attached with 2D Ti 3 AlC 2 surface, they have only point contact with each other, providing less interfacial interaction for the transfer of electrons from TiO 2 MPs towards Ti 3 AlC 2 surface ( Fig. 9 (c)).Fig. 9 (d) depicts TiO 2 NPs interactions with 2D Ti 3 AlC 2 surface with their good interaction, thus, providing more channels for electrons to reach the MAX surface.Comparatively, there would be more distribution of TiO 2 NPs with 2D Ti 3 AlC 2 surface, thus, increasing their interaction, resulting in faster charge carrier separation with higher photocatalytic activity. The photocatalytic performance of Ti 3 AlC 2 2D MAX based composite catalyst for photoinduced CO 2 conversion to CO/CH 4 under visible light is shown in Fig. 10 .As shown in Fig. 10 (a), CO 2 can be reduced to CO over all types of photocatalysts with time on stream.The pure TiO 2 and g-C 3 N 4 photocatalysts show poor CO production, which is ascribed to faster charge carrier recombination rate in a single semiconductor.When TiO 2 NPs were dispersed over 2D MAX Ti 3 AlC 2 , a 1.70 folds higher photocatalytic CO production than using only pristine TiO 2 , demonstrating superior charges separation by conductive 2D MAX cocatalyst.Similarly, a 3.38 folds higher CO production efficiency was observed over the 2D/2D heterojunction of g-C 3 N 4 anchored Ti 3 AlC 2 MAX composite, significantly higher compared to pristine g-C 3 N 4 , and this increment was due to hindered charges recombination rate by Ti 3 AlC 2 cocatalyst.The CO evolution reached highest over g-C 3 N 4 /TiO 2 /Ti 3 AlC 2 MAX composite, which is about 1.16, 1.23, 1.97 and 3.93 times more than applying g-C 3 N 4 /Ti 3 AlC 2 MAX, TiO 2 NPs/Ti 3 AlC 2 , TiO 2 and g-C 3 N 4 samples, respectively.This promotion affirms that reduction efficiency was greatly promoted by 2D MAX Ti 3 AlC 2 mediator as cocatalyst to trap and transport electrons during CO 2 photoreduction process over g-C 3 N 4 /TiO 2 2D/0D composite under visible light.The enhanced photocatalytic CO 2 reduction to CO and CH 4 has been reported over 2D/2D Ti 3 C 2 /g-C 3 N 4 heterojunction due to spatial charge carriers separation in the presence of conductive Ti 3 C 3 as cocatalyst 34 . The further investigation of pure and composite photocatalysts were explored towards CO 2 reduction to CH 4 as shown Fig. 10 (b).Similar to photocatalytic CO production, during CO 2 reduction pro-cess over pristine TiO 2 and g-C 3 N 4 , poor photocatalytic activity with very small amount of CH 4 was attained, which was also much lower than CO production.This was evidently due to faster charges recombination rate, and the availability of electrons was not enough to generate CH 4 molecules.However, when Ti 3 AlC 2 was attached to TiO 2 NPs and g-C 3 N 4 , a CH 4 production of 13.11 and 27.99 folds higher was produced than using TiO 2 and g-C 3 N 4 samples, respectively.Highest CH 4 evolution was observed when 2D Ti 3 AlC 2 was attached to g-C 3 N 4 /TiO 2 heterojunction, which is 2.73, 7.45, 46.40 and 97.71 times more than employing g-C 3 N 4 /Ti 3 AlC 2 MAX, TiO 2 NPs/Ti 3 AlC 2 MAX, pristine g-C 3 N 4 and TiO 2 photocatalysts, respectively.This confirms that composite photocatalyst is very promising pertaining to efficient CO 2 reduction to CH 4 .This affirms that 2D MAX is a promising cocatalyst and mediator in stimulating photocatalytic CO 2 methanation under visible light. Previously, several reports present photocatalytic CO 2 reduction to CO and CH 4 over various types of semiconductors photocatalysts.Enhanced production of CO/CH 4 during photocatalytic reduction of CO 2 over TiO 2 -Cu 2 ZnSnS 4 hybrid heterojunction has been reported 43 .In another work, porous 3D Cu-doped g-C 3 N 4 was synthesized for the conversion of CO 2 to CO as the major product 52 .Using visible light, CO 2 reduction to CH 4 plasmonic Au-Pd modified TiO 2 has been reported 7 .We reported dynamic production of CH 4 during CO 2 conversion by H 2 over Mt/g-C 3 N 4 composite 53 .Recently, 2D ultrathin Ti 3 C 2 MXene anchored on porous g-C 3 N 4 as a cocatalyst has been investigated for CO 2 to CH 4 reduction under visible-light 40 .All these results and developments further confirm good photoactivity and productivity during CO 2 photocatalysis with CH 4 production in a single step CO 2 photoreduction process, however, methane formation efficiency is entirely dependent on the use of cocatalyst or heterojunction formation for efficient charge carrier separation.In the current work, 2D MAX Ti 3 AlC 2 found very promising for trapping and transporting photogenerated electrons towards CO 2 for its activation for CH 4 production. In order to further explore the photocatalytic performance of g-C 3 N 4 /TiO 2 /Ti 3 AlC 2 , it was investigated in different photocatalytic systems.It is well established that activity of photocatalyst is greatly dependent on light intensity which is directly related with the production of electrons.Besides, geometry and design of photoreactors also promote to maximize photon flux distribution, enabling to provide active surface area with efficient mass transfer rate and minimum light diffusion effects.The photocatalytic activity of g-C 3 N 4 /TiO 2 /Ti 3 AlC 2 2D MAX composite under light intensity of 20 and 100 mW cm -2 was further elucidated using monolith and fixed bed photoreactor and the results are depicted in Fig. 11 .As shown in Fig. 11 (a), different evolution rate of CH 4 was detected by varying light intensity in a fixed-bed photoreactor.Evidently, production of CH 4 was continuous over the irradiation time, while employing different light intensities.Using fixed bed reactor with light intensity 20 mW cm -2 , CH 4 production was not efficient due to less light intensity being consumed for the production of electrons.However, 3.587 folds higher CH 4 production was obtained under 100 mW cm -2 light intensity in a fixed bed reactor, while keeping operating conditions constant.This was evidently due to more production of electrons and their efficient utilization for the conversion of CO 2 to CH 4 .Comparatively, performance of monolith photoreactor was not efficient for CH 4 production and CH 4 production was declined by 53.99 folds than it was produced in a fixed bed reactor under 100 mW cm -2 light intensity.The less electrons production in a monolith photoreactor under visible light irradia-tion was probably due to lower penetration power of visible light inside microchannels. Fig. 11 (b) shows the production of CO during photocatalytic CO 2 reduction with different light intensities in a monolith and fixed bed photoreactor.Using lower power lamp (20 mW cm -2 ), the yield rate of CO was not much efficient, but it was increased by 1.924 folds when 100 mW cm -2 light intensity was employed through fixed-bed photoreactor.A 2.64 folds increased in evolution rate of CO was obtained through monolith photoreactor compared with fixed bed photoreactor.These findings revel that monolith can promote CO production, whereas, fixed bed photoreactor was favorable for methane formation. The performance of fixed bed and monolith photoreactor is further compared with the similar work reported in the literature.Previously, we investigated the performance of fixed bed and monolith photoreactor for photocatalytic CO 2 reduction under UVlight irradiation.It was observed that the performance of Ni and MMT modified TiO 2 was obviously increased using monolith photoreactor compared to fixed bed.This was due to higher penetration of UV-light inside the monolith channels, enabling larger illuminated volume for CO 2 reduction process and main products observed were CO and H 2 54 .Similarly, performance of fixed bed and monolith photoreactor was investigated for photocatalytic CO 2 reduction over Ag-La/g-C 3 N 4 composite under UV and visible light irradiation.Higher efficiency of fixed bed reactor under visible light irradiation was observed, while monolith photoreactor found more efficient under UV-light irradiation 41 .Liou et al., investigated the performance of monolith photoreactor under visible light irradiation.Lower CO 2 reduction efficiency of monolith was observed using NiO/InTaO 4 composite photocatalyst under visible light irradiation.This was due to less penetration power of visible light inside the microchannels.However, monolith performance was significantly enhanced using PMMA optical fibers to increase illumination inside the channels.All these findings confirm that monolith photoreactor is less efficient compared to fixed bed photoreactor under visible light irradiation due to less penetration power of visible light. Comparatively, performance of monolith was lower compared to fixed bed photoreactor and this declined in photocatalytic activity was further illustrated based on light penetration limitations and mass transfer affects as depicted in Fig. 12 .The schematic illustration of photocatalytic CO 2 reduction with H 2 O in a fixed bed photoreactor has been demonstrated in Fig. 12 (a).Obviously, using fixed bed photoreactor, catalyst is uniformly distributed at the reactor surface, in which, only top surface of catalyst would be available for photocatalytic CO 2 reduction process.In this case, all the light irradiations and reactants have potential to be absorbed over the photocatalyst surface under light irradiation.Thus, photocatalytic CO 2 reduction process with proficient evolution rate of CO/CH 4 during photo-induced CO 2 reduction process.By increasing light intensity 20 to 100 mW cm -2 , methane evolution was further improved due to higher photon flux strikes at the catalyst surface, enabling efficient CO 2 conversion to CH 4 due to more production of electrons. The schematic illustration for the conversion of CO 2 with H 2 O in a monolith photoreactor has been depicted in Fig. 12 (b).Compared to fixed bed reactor, monolithic support has multiple channels loaded with thin film of photocatalyst.The reaction occurs over the catalyst surface in all the channels which has larger exposed surface area for the adsorption of reactants.As the visible light has been used in this work, thus, penetration power of light inside the microchannels was not efficient and most of the light was reflected back from the top surface of the monolith.Due to less penetration power of light inside the channels, it has less interaction with the catalyst and only the reactants attached over the photocatalyst surface without photocatalysis process.Thus, lower The possible performance mechanism in a monolith and fixed bed photoreactor can be further demonstrated based on mass transfer process and light diffusion process as shown in Fig. 12 (c).In heterogenous photocatalysts, reactants have to reach the catalyst surface through external and internal boundaries, which limits mass transfer process.In a fixed bed photoreactor, a major challenge is the transfer of reactants to reach the catalyst surface and also lower adsorption-desorption process.Comparatively, monolithic support has no external or internal mass transfer limitations due to catalyst loaded over the channels surface as a thin film.However, photocatalytic activity in a fixed bed photoreactor was higher due to efficient light distribution over the catalyst surface compared to using monolithic support with microchannels.This shows newly fabricated structured photocatalyst and photoreactor performance is greatly dependent on the interaction of three components i.e., reactants, catalyst and light.If any process is not efficient, the photocatalytic activity would be declined. The CO and CH 4 production rate, selectivity and quantum yield over different types of photocatalysts in a fixed bed and monolith photoreactor are further summarized in a Table 1 .Using TiO 2 MPs, 97.61 and 7.78 mole g -1 h -1 of CO and CH 4 yield rates, respectively, were produced and increased to 150.71 and 21.53 mole g -1 h -1 for CO and CH 4 production with TiO 2 NPs.Similarly, pristine g-C 3 N 4 producing CO and CH 4 of 75.64 and 27.54 mole g -1 h -1 under visible light while using fixed bed photoreactor.The CO and CH 4 yield rates were increased to 240.09 and 282.39 mole g -1 h -1 , respectively, when TiO 2 NPs were dispersed over the 2D Ti 3 AlC 2 multilayers, which was much higher than using TiO 2 MPs attached to 2D MAX structure.This was evidently due to superior separation of charges in the presence of conductive characteristics of MAX structure.As the TiO 2 MPs were well-dispersed with MAX structure, thus, proficient separation of charge carrier was achieved.Using g-C 3 N 4 /Ti 3 AlC 2 MAX 2D/2D heterojunction, yield rate of CO and CH 4 of 255.81 and 770.74 mole g -1 h -1 , respectively, which confirms g-C 3 N 4 is favorable to promote CH 4 production compared to TiO 2 NPs with selectivity 7.66 and 92.34 for CO and CH 4 , respectively.The highest CO and CH 4 production of 297.26 and 2103.50 mole g -1 h -1 achieved comparing to over g-C 3 N 4 /TiO 2 /Ti 3 AlC 2 MAX at selectivity 3.41 and 69.58, in a fixed bed photoreactor, by employing 20 mW cm -2 light intensity. Furthermore, by increasing light intensity to 100 mW cm -2 , CO and CH 4 yield rate of 571.99 and 7546.83mole g -1 h -1 , respectively at selectivity 1.86 and 98.14 were achieved.This confirms that light intensity is favorable to promote both photoactivity and selectivity, while employing fixed-bed photocatalytic reactor system.In the case of photocatalytic activity of composite photocatalyst in a monolith reactor with 100 mW cm -2 , CO and CH 4 yield rate of 1510.44 and 139.77mole g -1 h -1 at selectivity 72.99 and 2.133, respectively, were obtained.This reveals that monolith photoreactor is less selective for methane formation by comparing with fixed bed photoreactor due to higher utilization of photon flux compared to monolith photoreactor. The quantum yield (QY) was further calculated to elucidate the CO and CH 4 production performance in a monolith and fixed bed photoreactor and their results are summarized in Table 1 .It is obvious that g-C 3 N 4 /TiO 2 /Ti 3 AlC 2 composite catalyst gave highest QY due to more utilization of higher photon flux through using fixed bed photoreactor during photoinduced CO 2 reduction to CH 4 .A QY of 35.642 for CH 4 attained using g-C 3 N 4 /TiO 2 /Ti 3 AlC 2 MAX composite at intensity 20 mW cm -2 in a fixed bed photocatalytic reactor, which is 2.73, 4.47 and 232.95 folds higher than using g-C 3 N 4 /Ti 3 AlC 2 MAX, TiO 2 NPs/Ti 3 AlC 2 and TiO 2 MPs/Ti 3 AlC 2 composite samples, respectively.By increasing photon flux from 20 to 100 mW cm -2 , a QY of 25.575 for CH 4 production was calculated, which is 1.394 folds lower than using lower power lamp in a fixed bed photoreactor.This reveals that all the photon flux strikes over the catalyst surface was not fully utilized for the production of charge carrier.This further confirms that fixed bed photoreactor become less efficient with increasing photon flux due to the availability of external surface of photocatalyst for photocatalytic reaction. Furthermore, a QY of 2.133 and 0.789 was achieved in a monolith photoreactor for the production of CO and CH 4 under light intensity 100 mW cm -2 .This QY for CO production was 4.39 folds higher and 32.41 folds lower for CH 4 by comparing photocatalytic activity in a fixed bed photoreactor under the same operating condition.All above discussion further confirm that fixed bed photoreactor is proficient under visible light irradiation compared to monolith photoreactor for photocatalytic CO 2 reduction. During photoinduced CO 2 reduction by H 2 O, it involves the utilization of electrons and holes photoinduced over the composite photocatalyst surface for CO and CH 4 production.The band structure of TiO 2 and g-C 3 N 4 were estimated to understand the reaction mechanism.As discussed previously, band gap energies of 3.14 eV and 2.69 eV were estimated for TiO 2 and g-C 3 N 4 samples, based on their UV-visible spectra, respectively.Similarly, based on XPS wide spectra, valance band (VB) positions of 1.46 and 2.63 eV were estimated for g-C 3 N 4 and TiO 2 , respectively.Giving this analysis, conduction band (CB) values for g-C 3 N 4 and TiO 2 of -1.23 eV and -0.52 eV, respectively, were obtained.According to experimental results, photoactivity of pristine TiO 2 was much higher compared to pristine g-C 3 N 4 , which reveals that oxidation potential of g-C 3 N 4 is not strong enough to efficiently oxidize water.More importantly, in the presence of TiO 2 and g-C 3 N 4 with MAX as the cocatalyst, a significantly enhanced photocatalytic activity was achieved.This significantly improved CO 2 reduction to CO and CH 4 reveals that the charge separation between both the semiconductors did not comply with type II heterojunction.Recently, He and coworkers reported that TiO 2 has strong oxidation potential compared to g-C 3 N 4 , whereas, VB of g-C 3 N 4 could not directly oxidize water into hydroxyl ions.The S-scheme mechanism has been proposed in their work to explain photocatalytic CO 2 reduction efficiency of TiO 2 and g-C 3 N 4 with TiC as the cocatalyst to trap the electrons 55 .In another work, S-scheme heterojunction for photocatalytic hydrogen production over 2D/2D WO 3 /g-CN 4 has been reported 56 .Similarly, S-scheme heterojunction of Bi 2 O 3 /TiO 2 with higher photocatalytic activity has been reported 57 . Therefore, in the current study, when TiO 2 is coupled with g-C 3 N 4 and MAX, a significantly enhanced CO 2 reduction with higher CO/CH 4 evolution was observed due to S-scheme charge transfer mechanism and similarly reported in the literature 58 .A schematic presentation of possible photocatalytic CO 2 reduction with H 2 O through S-scheme heterojunction mechanism has been demonstrated in Fig. 13 .As the fermi level of g-C 3 N 4 is higher than the fermi level of TiO 2 , and this difference derives the charge transfer from g-C 3 N 4 to TiO 2 until their Fermi level reached to equilibrium.At equilibrium, at the interface of both the semiconductors, an internal electric field, could be formed, which favored the transfer and separation of charges.The internal electric field minimized their recombination 55 , 59 .The presence of conductive Ti 3 AlC 2 MAX further promoted the separation of electrons.Thus, useful electrons in the CB of g-C 3 N 4 were prone to migrating to conductive TiAlC for the multielectron reduction process of CO 2 .Similarly, useful holes in the VB of TiO 2 are preserved for the oxidation of water.Recently, Au loaded 2D/2D Bi 2 MoO 6 /g-C 3 N 4 Sscheme heterojunction has been proposed in which significant enhanced charges separation has been reported due to interface field with Au as cocatalyst to trap electrons 60 .In another work, significantly enhanced photocatalytic hydrogen production has been reported over WO 3 /TiO 2 /GO step-scheme heterojunction.The enhanced photoactivity was proposed due to S-scheme heterojunction formation between WO 3 /TiO 2 and efficient electron separation from TiO 2 to GO 61 . In summary, powerful photogenerated electron and holes are in the CB of g-C 3 N 4 and VB of TiO 2 participated in different photocatalytic reactions The electrons photogenerated during photocatalysis are consumed by CO 2 for its reduction, whereas, holes are consumed during water oxidation process as illustrated in Eqs. ( 6) and (7) .Finally, CO and CH 4 were produced by consuming 2 and 8 electrons as presented in Eqs. ( 8) and ( 9 According to thermodynamics, photocatalytic CO 2 reduction to CO/CH 4 depends on the conduction bands of semiconductors and products reduction potential.The conduction band of TiO 2 (-0.52 eV) is obviously more negative than CO (-0.48 eV) and CH 4 (-0.24eV) reduction potential, which is enough to drive this reduction reaction.Similarly, VB of g-C 3 N 4 (1.46 eV) is more positive than the oxidation potential of O 2 (1.23 eV vs NHE) during water oxidation process 34 .As discussed previously, CH 4 production over 2D MAX dispersed g-C 3 N 4 /TiO 2 composite was much higher compared to CO evolution rate.As 2 electrons are required for CO formation compared to 8 electrons consumed during the formation of CH 4 .Thus, the main reason for improved photocatalytic activity towards CH 4 formation would be due to more production and separation of electrons over g-C 3 N 4 and TiO 2 S-scheme heterojunction with efficient electrons separation by 2D MAX Ti 3 AlC 2 structure.Therefore, well designed 2D MAX Ti 3 AlC 2 dispersed g-C 3 N 4 /TiO 2 can be used as an efficient composite catalyst for selective production of fuels through photocatalytic CO 2 methanation under visible light irradiation."
  },
  {
    "title": "Conclusions",
    "content": "In conclusion, 2D MAX dispersed g-C 3 N 4 /TiO 2 composite was successfully developed and tested for photocatalytic CO 2 reduction under visible light.The main products identified were CO and CH 4 , whereas, their selectivity was greatly affected by using different sizes TiO 2 particles and constructing 2D MAX based composites.Using TiO 2 MPs, lower CO 2 reduction efficiency was observed, which was obviously increased through employing TiO 2 NPs.The highest CO and CH 4 production g-C 3 N 4 /TiO 2 /Ti 3 AlC 2 MAX of 297.26 and 2103.50 mole g -1 h -1 were achieved at selectivity 3.41 and 69.58, respectively in a fixed bed photoreactor with 20 mW cm -2 light intensity.More importantly, when light intensity was increased by 5 folds, CH 4 production rate was increased by 3.59 folds under visible light.The performance of composite catalyst was further investigated in a fixed bed and monolith photoreactor.It was noticed that monolithic support increased CO production by 2.64 folds, whereas, 53.99 times lower CH 4 production was obtained as comparing with fixed bed photoreactor.Using monolith microchannel photoreactor, QY for CO production was 4.39 folds higher and 32.41 folds lower for CH 4 production than using fixed bed photoreactor.The lower performance of a monolith photoreactor was due to less visible light penetration into the microchannels.Therefore, well designed 2D MAX Ti 3 AlC 2 dispersed g-C 3 N 4 /TiO 2 can be used as an efficient structured composite photocatalyst for selective photocatalytic CO 2 methanation under visible light in a fixed bed photoreactor. Fig. 1.Schematic illustration for the synthesis of TiO 2 /Ti 3 AlC 2 /g-C 3 N 4 and monolithic TiO 2 /Ti 3 AlC 2 /g-C 3 N 4 composite samples. Fig. 2. (a) XRD patterns of TiO 2 NPs, TiO 2 MPs, Ti 3 AlC 2 MAX, TiO 2 MPs/Ti 3 AlC 2 TiO 2 NPs/Ti 3 AlC 2 samples; (b) XRD patterns of g-C 3 N 4 , g-C 3 N 4 /TiO 2 NPs, g-C 3 N 4 /Ti 3 AlC 2 MAX and g-C 3 N 4 /TiO 2 /Ti 3 AlC 2 composite samples. Fig. 3. (a) Raman analysis 2D Ti 3 AlC 2 MAX, pristine TiO 2 NPs, Ti 3 AlC 2 anchored TiO 2 MPs and Ti 3 AlC 2 /TiO 2 NPs; (b) Raman patterns of pristine g-C 3 N 4 , pristine TiO 2 NPs, 2D Ti 3 AlC 2 MAX/TiO 2 NPs and g-C 3 N 4 /TiO 2 NPs/Ti 3 AlC 2 MAX composite. shows morphology of g-C 3 N 4 , TiO 2 NPs/g-C 3 N 4 and TiO 2 NPs/g-C 3 N 4 dispersed 2D Ti 3 AlC 2 composite samples.SEM image in Fig. 5 (a) shows 2D sheets of g-C 3 N 4 with wrinkled structure.Fig. 5 (b) presents SEM image of TiO 2 NPs/g-C 3 N 4 composite synthesized through sol-gel method.Obviously, TiO 2 NPs were uniformly dispersed with 2D g-C 3 N 4 sheets, thus, constructing 0D/2D heterojunction.SEM in Fig. 5 (c) further shows interaction of 2D g-C 3 N 4 with 2D Ti 3 AlC 2 to construct 2D/2D heterojunction with good interaction among the two materials.The SEM images for ternary TiO 2 NPs, g -C 3 N 4 and Ti 3 lAC 2 are shown in Fig. Fig. 4. FESEM analysis of (a) TiO 2 MPs, (b) TiO 2 NPs, (c) exfoliated Ti 3 AlC 2 , (d, e) TiO 2 MPs/Ti 3 AlC 2 , (f, g) TiO 2 NPs/Ti 3 AlC 2 , (h-i) TEM images of TiO 2 NPs/Ti 3 AlC 2 , (k) HRTEM images of TiO 2 NPs/Ti 3 AlC 2 with d-spacing analysis. Fig. 5. (a) FESEM images of pristine g-C 3 N 4 , (b) g-C 3 N 4 /TiO 2 , (c) g-C 3 N 4 /Ti 3 AlC 2 MAX, (d, e) FESEM images of g-C 3 N 4 /TiO 2 NPs/Ti 3 AlC 2 , (f) TEM images of g-C 3 N 4 /TiO 2 NPs/Ti 3 AlC 2 , (g) HRTEM image of composite, (h-j) d-spacing of g-C 3 N 4 /TiO 2 NPs anchored Ti 3 AlC 2 MAX composite. peaks appeared at 399.18 and 400.75 eV belonging to C and N as C-N C and N-C 3 , respectively, in the g-C 3 N 4 /TiO 2 anchoredTi 3 AlC 2 photocatalyst sample 15 .Fig. 6 (c) shows high resolution spectra of C 1s of pristine TiO 2 , 2D Ti 3 AlC 2 MAX, TiO 2 NPs dispersedTi 3 AlC 2 , g-C 3 N 4 /TiO 2 loaded 2D Ti 3 AlC 2 samples.All the binding energies were calibrated with adventurous carbon peak at 284.60 eV.For TiO 2 , two peaks positioned at 284.60 and 288.85 eV can be ascribed to C-C and C-O bonds, respectively.Similarly, Ti 3 AlC 2 sample displays three peaks with 284.60, 286.39 and 288.58 eV binding energies, be- Fig. 6.XPS analysis of TiO 2 , g-C 3 N 4 , Ti 3 AlC 2 and their g-C 3 N 4 /TiO 2 loaded 2D Ti 3 AlC 2 MAX composite samples: (a) Ti2p; (b) N 1s; (c); C 1s; (d) Al 2p. Fig. 7. (a) UV-Vis analysis of TiO 2 , g-C 3 N 4 , Ti 3 AlC 2 , and Ti 3 AlC 2 based composites, (b) PL spectra of TiO 2 , Ti 3 AlC 2 and their composite samples, (c) PL spectra of g-C 3 N 4 , Ti 3 AlC 2 loaded TiO 2 and g-C 3 N 4 /TiO 2 /Ti 3 AlC 2 MAX composite samples. Fig. 8. Effect of different photocatalysts on photocatalytic reduction of CO 2 with H 2 O to CO and CH 4 under visible light in a fixed bed photoreactor: (a) Yield of CO production, (b) Yield of CH 4 evolution. Fig. 9. Schematic of TiO 2 NPs and MPs with their interaction over Ti 3 AlC 2 2D MAX structure: (a) Charges separation in TiO 2 MPs, (b) Charges separation in TiO 2 NPs, (c) Interaction of TiO 2 MPs with Ti 3 AlC 2 2D MAX, (d) Interaction of 2D Ti 3 AlC 2 with TiO 2 NPs. Fig. 10.Effect of 2D MAX Ti 3 AlC 2 support structure on the performance of pristine TiO 2 NPs, g-C 3 N 4 and their Ti 3 AlC 2 /TiO 2 NPs and Ti 3 AlC 2 /g-C 3 N 4 /TiO 2 NPs composite for CO and CH 4 under visible light: (a) Yield of CO production; (b) Yield of CH 4 production. Fig. 11.Performance analysis of fixed bed and monolith photoreactor under visible light of different light intensities (20 and 100 mW cm -2 ) for the production CO/ CH 4 ; (a) CH 4 evolution; (b) CO evolution. Fig. 13.Schematic illustration of S-scheme heterojunction for photocatalytic CO 2 reduction with H 2 O over 2D MAX Ti 3 AlC 2 dispersed g-C 3 N 4 /TiO 2 composite . Evaluation of production rate, selectivity, QY and TON for CO and CH 4 production over g-C 3 N 4 and modified g-C 3 N 4 samples. ) , respectively.C O 2 e - CO - 2 e - CO H 2 O ( -0 . 48eV vs NHE ) 8 H 8 e - C H 4 2 H 2 O ( -0 . 24eV vs NHE ) 2 2 H ( 1 . 23eV vs NHE ) (7) C O 2 2 H Journal of Materials Science Technology 106 (2022) 195-210 The authors would like to extend their deepest appreciation to Ministry of Higher Education (MOHE), Malaysia, for financial support of this work under Fundamental Research Grant Scheme (No. R.J130 0 0 0.7851.5F384). Supplementary material associated with this article can be found, in the online version, at doi:10.1016/j.jmst.2021.08.019 ."
  }
]