[
  {
    "title": "Doi",
    "content": "10.1016/j.cej.2020.125944"
  },
  {
    "title": "Article_Title",
    "content": "One-step synthesis and Gd3+ decoration of BiOBr microspheres consisting of nanosheets toward improving photocatalytic reduction of CO2 into hydrocarbon fuel"
  },
  {
    "title": "Abstract",
    "content": "A novel Gd 3 doped nanosheet-as- sembled BiOBr nanospheres was synthesized. The Gd 3 doped BiOBr exhibited an enhanced photocatalytic activity for CO 2 reduction. The holes were acted as the main ac- tive species in photocatalytic CO 2 reduction."
  },
  {
    "title": "Experimental",
    "content": "The samples are prepared with some changes according to previous work 28.Firstly, BiOBr/Gd is synthesized by dissolving CTAB (1.4551 g) and Bi (NO 3 ) 3 5H 2 O (1.9414 g) into the boiling ethylene glycol (EG, 18 mL).The solution is stirred for 30 min at room temperature and denoted as solution A. Meantime, the amount of Gd (NO 3 ) 3 5H 2 O (the molar ratio of Gd atoms to Bi atoms is 0.02:1, 0.05:1, 0.1:1) and 12 mL of isopropanol are added into Teflon-lined stainlesssteel autoclave (50 mL).Then, the solution A is slowly added to the above isopropanol solution.Subsequently, the autoclave is transferred to an oven and heated to 160 C for 12 h.The obtained samples are dished by deionized water and absolute ethanol, respectively.Finally, the samples are dried in vacuum drying oven all night and grinded for further use.The molar ratio of Gd atoms to Bi is adjusted to 0, 0.02, 0.05, and 0.10. The crystal structure was characterized by D8ADVANCE X-ray diffractometer (Cu K, BRUKER) at 40 kV and 40 mA with the scanning angle about 5-85.The morphology was characterized by SU1510 scanning electron microscope (Hitachi Limited) with the resolution of secondary electron 3.0 nm (30 kV).The lattice was characterized by PIPS691 transmission electron microscope (Gatan).The elemental composition and states on the verge of catalysts were characterized by X-ray photoelectron spectroscopy.The recombination rate of photogenerated electrons and holes was recorded on the photoluminescence (PL) spectra (F-4500, Hitachi Limited).The bandgap energy of catalysts was measured by UV-visible diffuse reflectance spectrometer (LambdaBio40, PERKINELMER).The electrochemical impedance spectroscopy (EIS) was used to analyze the charge transfer between catalyst interfaces with parstat 2273 advanced electrochemical system.The FT-IR spectra were used to characterize the chemical covalent bond in the catalysts and KBr as reference sample with TENSOR27 infrared spectrometer (50)(51)(52)(53)(54)(55)(56)(57)(58)(59)(60).The BET surface area and pore volume were measured by N 2 adsorption-desorption experiment via ASAP 2020 HD88 Specific Surface and Porosity Analyzer. The schematic diagram of the reactor set-up is shown in Fig. 1.For the measurement of catalytic activities of the photocatalysts towards CO 2 reduction, 100 mg of photocatalyst and 60 mL of deionized water was added into the glass flask (100 mL volume) with a quartz window.The catalyst/water suspension was ultrasonicated for 20 min.Then, the flask was coupled to an air-tight and closed glass system (CEL-PAEM-D8, China Education Light).The system was firstly evacuated by a vacuum pump, and then CO 2 gas (99.999) was purged into the system to replace air.The reaction flask (containing catalyst/water suspension) was vigorously stirred at 20 C, which was maintained in a jacket cooling system with circulating water/ethanol mixture.The reaction suspension was subjected to the irradiation of a 300 W Xe lamp.And, a cut off optical filter was coupled to the Xe lamp to realize visible light irradiation ( 420 nm).To test the cycle stability of photocatalysts, the gas system was evacuated for every 5 h interval and then be charged with fresh CO 2 gas.The catalytic reduction products of CO 2 were monitored and analyzed by an on-line gas chromatography system (GC 7920), which was equipped with two flame ionization detectors (for CO, CH 4 , and methanol analysis) and one thermal conductivity detector (for hydrogen gas analysis).The resultant methanol yield is measured using the following equation. CH 3 OH yield (molg -1 ) (C methanol volumetric flow rate of product gas) /mass of photocatalyst used (g) The apparent quantum efficiency (AQY) is measured under the similar CO 2 reduction condition.The reaction suspension is irradiated by a 300 W lamp for 3 h.A 420 ( 15) nm bandpass filter is coupled to the Xe lamp to provide light intensity at specific wavelength.The light intensity and radiation area are measured via the spectroradiometer (Perfect Light, PLMW2000) and ruler, respectively.The result demonstrates that the intensity of light is 6 mW cm -2 and the radiation area is 9 cm 2 .The AQY is calculated by following equation 29. (AQY, ) (number of reacted electrons)/(number of incident photons) 100 (6 methanol(moles) Na h c)/( S P t ) 100"
  },
  {
    "title": "Results_and_Discussion",
    "content": "3.1.Crystal phrase and morphology analysis X-ray diffraction (XRD) patterns are used to analyze the crystal structure of as-prepared samples.All diffraction peaks of BiOBr are observed in Fig. 2, and no other impurity peaks are observed.In addition, the sharp peak demonstrates that the BiOBr materials with high crystallinity are successfully synthesized.The diffraction peak of Gd 2 O 3 cannot be observed, which may be due to the low doping amount.And the sharp peaks of 2 at about 25.6, 31.7and32.4are ascribed to the (1 0 1), (1 0 2) and (1 1 0) crystal facets, which are well in agreement with tetragonal BiOBr (PDF85-0862) 30.As shown in Fig. 2, as compared to pure BiOBr, the peak position of BiOBr/Gd-0.05 is shifted to the higher diffraction angle, and it relates to the decrease in interplanar spacing, indicating that the Gd 3 ions (0.938 A) may replace Bi 3 ions (1.03 A) into the lattice of BiOBr 23,31,32.To prove this postulation, the cell constants of BiOBr/Gd-0.05 (a b 3.9052, c 8.232, 90) are compared with that of pure BiOBr (a b 3.9137, c 8.5072, 90).The interplanar spacing of (1 0 1) crystal phases for BiOBr/Gd-0.05 and BiOBr are calculated to 0.351 nm and 0.352 nm, respectively.Moreover, it can be seen that BiOBr/Gd-0.05 shows an apparently decreased crystallinity compared to the other investigated samples, which indicates that proper doping of rare earth ion is beneficial for introduction of Gd into the lattice of BiOBr, and contributes to a defect appearing, which suppress the growth of BiOBr crystal.The crystallite size (D) is calculated via Scherrer's equation: D K/ ( cos ), where K is constant (0.89), is the wavelength of X-Ray (0.154056 nm), is FWHM of (1 1 0) peak and is diffraction angle.The BiOBr/Gd-0.05 exhibits the lowest crystallite size compared to the other samples (Table S1). The morphology and lattice are observed in the images of scanning electron microscope (SEM) and transmission electron microscope (TEM).Fig. 3a andb show the typical SEM images of pure BiOBr and BiOBr/Gd-0.05.It is clearly observed that BiOBr microsphere is formed by self-assembly of BiOBr nanosheets.Furthermore, the radius of BiOBr microsphere is estimated to be 200-400 nm according to these images.In comparison, the modification of Gd 3 ions causes the agglomerations of BiOBr nanosheets. Fig. 4a andb show the TEM images of BiOBr/Gd-0.05, and it is further proved that the microspheres are assembled by BiOBr nanosheets.The result of EDS mapping analysis indicates that the O, Gd, Br, and Bi elements are uniformly dispersed on the surface of BiOBr/Gd-0.05.Fig. 4c andd display the HRTEM images of BiOBr/Gd-0.05.Obviously, the lattice fringes with interplanar spacing of about 0.350 nm and 0.282 nm are attributed to (1 0 1) and (1 0 2) crystal planes of BiOBr/Gd-0.05.Especially, the lattice fringe with interplanar spacing of about 0.278 nm is attributed to the (1 1 0) crystal, which is consistent well with previous reports 3334353637.Likewise, the Gd or Gd 2 O 3 nanoparticles are not observed in the HRTEM images, which could be ascribed to the low amount of Gd 3 doping. Elemental composition and chemical state of as-prepared samples are investigated via XPS spectra.The XPS full spectrum in Fig. 5a exhibits the presence of Bi, O, Br, and Gd elements in BiOBr/Gd-0.05 sample.For high revolution XPS Bi 4f spectrum in Fig. 5b, the pure BiOBr peaks located at 159.1 eV and 164.4 eV belong to the Bi 4f 7/2 and Bi 4f 5/2 , indicating the existence of Bi 3 38.Moreover, the peaks in BiOBr/Gd-0.05 are shifted to the lower banding energies at 158.8 eV and 164.1 eV, respectively.The high revolution XPS O 1 s peaks of BiOBr/Gd-0.05 located at 529.9 eV and 531.2 eV are separately attributed to the lattice oxygen in Bi-O of BiOBr (Fig. 5c), and hydroxyl groups adsorbed on the surface of catalysts 39,40.Two distinguishing Br Peaks located at 68.4 eV and 68.9 eV are ascribed to the Br - 41 (Fig. 5d).The peaks of Gd 4d 5/2 and Gd 4d 3/2 in the BiOBr/Gd-0.05 are observed at 142.3 eV and 147.9 eV, and the spin orbital spitting of the two peaks is 5.6 eV, indicating a low amount of Gd 3 existing on the surface of BiOBr in the form of Gd 2 O 3 42 (Fig. 5e).In short, as compared with pure BiOBr, the peaks of Bi 4f and Br 3d in BiOBr/Gd-0.05 are shifted towards the lower binding energy, indicating the formation of interaction between the prepared components 43.Fig. 5f exhibits the valence band (VB) spectra of BiOBr/Gd-0.05, and the BiOBr/Gd-0.05displays a VB edge of 1.66 eV.In order to further investigate the influence of oxygen vacancy on photoactivity, electron paramagnetic resonance (EPR) test is carried out.The EPR signal of oxygen vacancy can be found at g 2.004 for BiOBr and BiOBr/Gd-0.05 samples.The BiOBr/Gd-0.05 exhibits stronger EPR signal than BiOBr, indicating the BiOBr with Gd doping promoting the formation of oxygen vacancy.The defect level will be introduced into the band gap because of the oxygen vacancy, promoting the light absorption in visible-light region and benefiting the photoactivity (Figure S1) 44. The FT-IR spectra of as-prepared samples are shown in Fig. 6.The absorption peaks at 3527 and 1620 cm -1 are ascribed to the stretching and bending vibrations of O-H bonds which belong to the water molecules or hydroxyl groups absorbed on the surface of catalyst 45.The infrared absorption region of 500-800 cm -1 is the contribution of both Bi-O and Gd-O bonds 46,47.Among them, the peak at about 511 cm -1 belongs to the Bi-O stretching vibrations, especially, the peaks located at 626 and 794 cm -1 are ascribed to Bi-O asymmetric tensile vibrations 45,46.Moreover, the peaks located at 1057 and 2367 cm -1 are attributed to C-O stretching vibration and asymmetry stretching vibration of CO 2 46,48, respectively.The absorption peaks from 2840 to 2940 cm -1 are ascribed to C-H bonds which may be ascribed to adsorbed ethanol on the surface of catalysts.In short, the formation of Gd-O bonds indicates that the Gd ions replace partial Bi ions and are introduced into the BiOBr lattice. The SEM images and XRD patterns are collected to further investigate the morphology and structure of BiOBr/Gd-0.05 on different reaction stages.The sample \"0h\" means that the CTAB and Bi (NO 3 ) 3 5H 2 O were added into the boiled ethylene glycol (EG) and stirred for 30 min before hydrothermal reaction.It can be seen that with the prolongation of hydrothermal process (Fig. 7a), the position of (1 0 1) peak is shifted to the higher diffraction angle, indicating that the interplanar spacing of (1 0 1) crystal phase is gradually narrowed.This may be due to the introduction of Gd 3 in the lattice of BiOBr.Obviously, the structure of nanospheres cannot be observed (Fig. 7b).The BiOBr/Gd nanosheets begin to grow and the nanosphere structure selfassembles in the center of BiOBr crystal nucleus via the style of nanosheet inlaying (Fig. 7c).The BiOBr/Gd nanosheets continue to grow and gradually agglomerate (Fig. 7d) until the spherical structure is destroyed (Fig. 7e). As shown in Fig. 8, UV-Vis diffuse reflectance spectroscopy is used to measure the absorption edge of the photocatalysts.The absorption edges of pure BiOBr, BiOBr/Gd-0.02,BiOBr/Gd-0.05, and BiOBr/Gd-0.1 are calculated to be 415 nm, 409 nm, 430 nm, and 427 nm, respectively.Compared with pure BiOBr, the Gd 3 dopant significantly expands the visible light adsorption range of BiOBr/Gd.It can be seen that an obvious absorption tail is observed for BiOBr/Gd-0.05.The enhanced absorption and red-shift indicate a narrowing of the bandgap value because of the presence of defect energy level below the conduction 49.Also, this tail contributes to its improved photocatalytic performance.Further, the bandgap of samples is calculated by the following equation: h A(h-E g ) n/2 , where , h, , and E g represent absorption constant, Planck constant, photon frequency, and band gap of semiconductor 50.The band gaps of pure BiOBr, BiOBr/Gd-0.02,BiOBr/Gd-0.05, and BiOBr/Gd-0.1 catalysts are about 2.98 eV, 3.05 eV, 2.90 eV, and 2.91 eV, respectively.The E g value of BiOBr/Gd-0.05 is much lower than that of pure BiOBr, implying an increased photogenerated charge carriers on a wider spectrum and ultimately enhanced CO 2 photoactivity.The BiOBr/Gd-0.02 exhibits a slight blue shift, which is due to the tint and specular reflection of the light yellow powder, having an influence on getting the accurate bandgap value 51.In addition, the bandgap edge of samples is calculated according to the following equation: where the \"X\" and E 0 represent electronegativity of semiconductor (6.18 eV) and the energy of free electrons on the hydrogen scale (4.5 eV), respectively.The E CB and E VB in the BiOBr are separately calculated to be 0.19 eV and 3.17 eV, respectively.Photoluminescence (PL) spectrum is used to prove that the doping of Gd ions inhibits the recombination of photogenerated charge carries.To the best of our knowledge, the stronger intensity of PL peak indicates the higher recombination rate of photogenerated charge carries.Herein, as shown in Fig. 9a, the PL peak intensity of BiOBr/Gd composites is much lower than that of pure BiOBr.This phenomenon demonstrates that the Gd 3 dopants inhibits the recombination of photogenerated charge carries, in which the electrons of CB in the BiOBr are transferred to the Gd 3 and extend the lifetime of photogenerated carries 52.The half-full 4f electronic orbits obtain the excited electrons of BiOBr, and then the electrons could hardly be back to the VB in BiOBr, thanks to the interference of filled 5 s 2 and 5p 6 outer orbits 21.In addition, two peaks are obviously observed at the positions of 458 nm and 468 nm, which correspond to the band free exciton compound emission and bound exciton compound emission 30.Fig. 9b exhibits the EIS Nyquist plots of BiOBr and BiOBr/Gd composites.The EIS Nyquist plots are performed as a basis of characterizing the charge separation and transfer efficiency.The smaller radius of the curve indicate the lower the electrons-transfer resistance 45.The radius values are in the following order: BiOBr/Gd-0.05 BiOBr/Gd-0.1 BiOBr BiOBr/Gd-0.2.Compared to pure BiOBr and other BiOBr/Gd composites, the radius of BiOBr/Gd-0.05 was obviously decreased, indicating that the doping of Gd 3 promotes the separation of photogenerated electrons-holes pairs.The TGA curves in Fig. 9c exhibit the thermal stability of pure BiOBr and BiOBr/Gd-0.05 composites.The weight loss at temperature range from about 45 C to 550 C is ascribed to absorbed water 53.The catalysts exhibit a slight decrease and the structure cannot be destroyed below the temperature of 550 C.The weight loss at the temperature from 550 C to 750 C is ascribed to the formation of Bi-O bonds and Br 2 30.Moreover, for the BiOBr/Gd-0.05,74.4 of weight ratio remained, which is 2 higher than that of pure BiOBr.This phenomenon can be attributed to the doping of Gd 3 .The BET specific surface area and pore size of BiOBr and BiOBr/Gd composites are measured by N 2 adsorption-desorption isotherms and pore distribution curves on the base of the BJH method.Fig. 10 exhibits type IV curves at the relative pressure of 0.4-1.0,which reflect the mesoporous structure of BiOBr 54.Meantime, the macropores are observed in pure BiOBr, which may be ascribed to the stacking of nanosheets.The BET specific surface area increases in the order: BiOBr/ Gd-0.10 (16.98 m 2 g -1 ) BiOBr/Gd-0.05 (17.75 m 2 g -1 ) BiOBr/ Gd-0.02(23.04m 2 g -1 ) BiOBr (69.21 m 2 g -1 ).Furthermore, the BET specific surface area is gradually decreased with the increase of content of Gd 3 doping, possibly due to the intimate integration of BiOBr nanosheets due to the adding Gd ions (Table 1).The result further implies that the improved separation rate of photogenerated electron-hole pairs enhance the photocatalytic performance. In the past few years, Bi-based photocatalysts (such as BiOBr 12, Bi 2 O 3 61, Bi 2 WO 6 62, BiMoO 6 23) have been investigated for photocatalytic reduction of CO 2 .To our surprise, the doping of Gd 3 ions greatly improved the performance of CO 2 photoreduction.The performance was evaluated by reducing CO 2 under visible light irradiation ( 420 nm).Fig. 11a shows the CO 2 conversion efficiency.Methanol is the ultimate product of CO 2 reduction.No any evidence demonstrates the generating of other side products, such as HCOOH and CO (Figure S2).Otherwise, the gaseous product is analyzed via GC-TCD under the same photocatalytic condition.It can be seen that the hydrogen peak at 1.48 min is not detected (Figure S3). The BiOBr, BiOBr/Gd-0.02,BiOBr/Gd-0.05, and BiOBr/Gd-0.1 exhibit the photocatalytic CO 2 conversion rate of 24.097 mol g -1 , 6.917 mol g -1 , 123.711 mol g -1 , and 49.997 mol g -1 in 3 h, respectively.The improvement of photocatalytic efficiency can be attributed to the introduction of Gd 3 ions.The cycling durability of BiOBr/Gd-0.05 is tested for CO 2 photoreduction (Fig. 11b).The experiment of three cycles lasted 12 h.For the first cycle, 134.53 mol g -1 of CH 3 OH is generated after 4 h.After three times of cycling experiment, 113.16 mol g -1 of CH 3 OH still could be generated.Thus, the BiOBr/Gd-0.05exhibits excellent cycling durability.Compared with some previous literature in Table 2, the BiOBr/Gd-0.05exhibits the efficient performance of CO 2 photoreduction. To the best of our knowledge, active species including holes (h ), superoxide free radical (O 2 -), and hydroxyl radicals (OH) play a key role in the photoreduction process.To further study the mechanism of CO 2 photoreduction, active radical capture experiments are carried out.Ethylenediaminetetraacetic acid disodium salt (0.336 g), tert-butanol (1.0 mL), and L-ascorbic acid (0.176 g) are employed as capturing reagents of hole, OH, and O 2 -in photoreduction reaction, respectively 63.As shown in Fig. 12, the CO 2 reduction efficiency is slightly decreased with the addition of EDTA-2Na reagent, indicating that photogenerated hole is the main active species.Therefore, a possible mechanism was proposed.The VB edge of BiOBr/Gd-0.05 is 1.66 eV, and the CB edge of BiOBr/Gd-0.05 is -1.24 eV.The standard redox potential of E 0 (CO 2 /CH 3 OH) is -0.60 eV.These electrons have enough potential to reduce CO 2 to CH 3 OH.The free radical CO 2 -can be generated by capturing an electron (Eq (8)), and the CO 2 -is transformed to HCOOH (Eq (10)), followed by reducing to CH 3 OH (Eq (11)). The result is consistent with previous report 64.Fig.13."
  },
  {
    "title": "Conclusions",
    "content": "In summary, a novel Gd 3 modified BiOBr nanospheres is successfully synthesized by one-step hydrothermal method.The morphology, structure, and synthesis mechanism of BiOBr/Gd composite are investigated.Compared with other as-prepared samples, the BiOBr/Gd-0.05exhibits the maximum CH 3 OH yield of 123.711 molg -1 within 3 h, which is 5.2 times higher than that over BiOBr (24.097 mol g -1 ).The Gd 3 decoration greatly enhanced the performance of CO 2 photoreduction, which is ascribed to the extension of visible light absorption and appropriate band-gap structure.In addition, the Gd 3 ions is introduced into the lattice of BiOBr as a substitute for Bi 3 , resulting in a slight decrease in the interplanar spacing.The photoreduction efficiency is obviously suppressed with the addition of EDTA-2Na, indicating that the photogenerated holes are the main active species in CO 2 photoreduction. Fig. 1.Schematic diagram of the reactor set-up. Fig. 2. XRD patterns of pure BiOBr and BiOBr/Gd with different molar ratios of Gd to Bi. Fig. 3. SEM images of pure BiOBr (a) and BiOBr/Gd-0.05 composite (b). Fig. 4. TEM images of BiOBr/Gd-0.05 (a, b), HRTEM images (c, d) of BiOBr/Gd-0.05.EDS elements mapping of Bi (e), Br (f), Gd (g), and O (h). Fig. 5. XPS spectra of pure BiOBr and BiOBr/Gd-0.05:(a) survey spectra, (b) Bi4f, (c) O1s, (d) Br3d and (e) Gd4d, (f) valence band XPS spectra. Fig. 6.FT-IR spectra of pure BiOBr and BiOBr/Gd composites. Fig. 8. UV-Vis diffuse reflectance spectra of (a-b) pure BiOBr and BiOBr/Gd composites. Fig. 9. PL spectra (a), EIS spectra (b) of pure BiOBr and BiOBr/Gd.(c) TGA curves of BiOBr and BiOBr/Gd-0.05 composites. Fig. 11.(a) CO 2 photoreduction for pure BiOBr and BiOBr/Gd composites and (b) cycling performance of CO 2 photoreduction for BiOBr/Gd-0.05. Fig. 12. Free radical capture experiment of CO 2 reduction. Fig. 13.The possible photocatalytic mechanism and transfer pathway of generated charges in BiOBr/Gd composite. Parameters obtained from the N 2 adsorption/desorption of composites.Pore volume /cm 3 g -1 Band gap /eV SampleBET surface /m 2 g -1 Photocatalytic CO 2 reduction efficiency over different catalysts. Acknowledgements This work was financially supported by the National Natural Science Foundation of China (No. 21667019), the Key Project of Natural Science Foundation of Jiangxi Province (No. 20171ACB20016), the Jiangxi Province Major Academic and Technical Leaders Cultivating Object Program (No. 20172BCB22014), the Science and Technology Department of Jiangxi Province (No. 20181BCB18003 and 20181ACG70025), the Key Laboratory of Photochemical Conversion Fig. 10.N 2 adsorption-desorption isotherms curves and pore size distributions (inset) of BiOBr and BiOBr/Gd composites.and Optoelectronic Materials, TIPC, CSA (No. PCOM201906), the Key Project of Science and Technology Research of the Jiangxi Provincial Department of Education (No. DA201602063), the Aviation Science Foundation of China (No. 2017ZF56020), and Fujian Key Laboratory of Measurement and Control System for of Shore Environment (No. S1-KF1703).Y.H. acknowledges great support of the National Natural Science Foundation of China (21922811, 51702284, 21878270, and 21961160742), Zhejiang Provincial Natural Science Foundation of China (LR19B060002), the Fundamental Research Funds for the Central Universities, and the Startup Foundation for Hundred-Talent Program of Zhejiang University. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https:// doi.org/10.1016/j.cej.2020.125944."
  }
]