[
  {
    "title": "Doi",
    "content": "10.1016/j.catcom.2013.03.002"
  },
  {
    "title": "Article_Title",
    "content": "Novel Ti-KIT-6 material for the photocatalytic reduction of carbon dioxide to methane"
  },
  {
    "title": "Abstract",
    "content": "Novel Ti-KIT-6 materials with different Si/Ti ratios (200, 100 and 50) have been synthesized, characterized and applied for the photocatalytic reduction of carbon dioxide to methane.An intermediate amount of Ti(Si/Ti 100) was found to be isolated and uniformly distributed, without collapsing the KIT-6 structure.TiO 2 formation was observed due to a higher amount of Ti(Si/Ti 50).Overall, the Ti-KIT-6 (calcined) materials were superior in activity than the Ti-KIT-6 (dried) materials.Owing to the greater number of OH groups, the Si/Ti ratio of 100 showed a higher methane production rate and was found to be more reactive than commercial Degussa P25 TiO 2 ."
  },
  {
    "title": "Experimental",
    "content": "KIT-6 mesoporous silica material was synthesized following the procedure reported in 10,11.The solid product obtained after the hydrothermal treatment was filtered, dried and/or calcined at 550 C for 5 h and was then utilized to prepare Ti-KIT-6 (dried or calcined).The dried and calcined KIT-6 materials were then treated with Titanium(IV) isopropoxide (98) at different Si/Ti ratios (200, 100 and 50) and finally calcined to achieve Ti-KIT-6 following the procedure recently reported 12. The BET specific surface area (S BET ), pore volume (PV) and average pore diameter (APD) were measured on the powder materials which had previously been outgassed at 150 C using Micromeritics FlowPrep 060, USA (sample degas system), by means of N 2 sorption at 77 K on a Micromeritics Tristar II, USA (surface area and porosity) instrument.TEM images were collected from the thin edges of the sample particles using a TEM Philips CM12, with an LaB6 filament, double tilt holder, operating at 120 kV. FT-IR spectra were collected at a resolution of 2 cm -1 on a Perkin Elmer FT-IR spectrophotometer equipped with an MCT detector.The XPS spectra were recorded using a PHI 5000 Versa Probe (USA), with a scanning ESCA microscope fitted with an Al monochromatic X-ray source (1486.6 eV, 25.6 W), a beam diameter of 100 m, a neutralizer at 1.4 eV 20 mA, and a FAT analyzer mode. CO 2 photocatalytic reduction tests were performed in a Pyrex glass reactor.The basic experimental set-up can be found in our previous work 13.The set-up includes a Pyrex glass reactor, connectors, mass flow controllers, water bubbler, and a UV lamp (Osram Uulta-Vitalux 300 W).It also has a CO 2 gas cylinder (99.99), a gas chromatograph (Varian CP-3800) equipped with a capillary column (CP7381) and a flame ionization detector (FID).A photocatalytic reaction was performed in the reactor which contained 0.5 g of photocatalyst.CO 2 gas was introduced into the reactor at 50 mL/min for 30 min after passing it through the water bubbler and have an adsorption-desorption balance and to saturate the catalysts with CO 2 and H 2 O. 0.1 g of glass wool moist with 0.5 mL of H 2 O was also placed in the reactor at the entrance of the CO 2 and H 2 O, to balance the water deficiency in the reactor.After 30 min, the CO 2 flow rate was reduced to 10 mL/min.When equilibrium was reached, the UV light was turned on and the reaction products were analyzed by means of the GC.Blank tests were also conducted to ensure that the product was due to the photocatalytic reaction.The blank tests were a UVillumination without the photocatalyst and a reaction in the dark with the catalyst."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The physical and textural properties obtained by means of N 2 sorption of the KIT-6 and Ti-KIT-6 materials are shown in Table 1.A noticeable decrease was observed in the surface area and pore volume of KIT-6 after Ti incorporation with different Si/Ti ratios in both dried and calcined samples.The surface area and pore volume of the Ti-KIT-6 (dried) materials were slightly higher than those of Ti-KIT-6 (calcined), which might be due to the easy incorporation of Ti in the dried weak structure of KIT-6.However, Ti can be trapped in the bulk of the KIT-6 (dried) material but not in that of the rigid structure of KIT-6 (calcined).The average pore diameter did not change significantly and remained uniform, which might be due to the three-dimensional (3-D) pore structure of KIT-6, which is able to accommodate the Ti dispersion. TEM was performed in order to analyze the mesoporous structure of KIT-6 and dispersion of Ti on the KIT-6 support material.An ordered array of mesopores, which corresponds to the formation of the KIT-6 material, can be observed in Fig. 1(a).Moreover, the centers of two adjacent pores are about 10 nm apart and the pore diameter is about 6 nm which is in agreement with the APD obtained from the nitrogen sorption analysis shown in Table 1 and also reported in literature 11.Fig. 1(b,c,d) shows the TEM images of Ti-KIT-6 with Si/Ti ratios of 200,100 and 50, respectively.The Ti-KIT-6(Si/Ti 200) depicted in Fig. 1(b) shows a good dispersion of Ti and does not show any agglomeration of the Ti particles; it has preserved the structure of the support as can be confirmed by the KIT-6 mesopore channels.A similar trend can be seen in the case of Ti-KIT-6(Si/Ti 100), which shows a good Ti dispersion and mesopore structure preservation, as can be observed in Fig. 1(c).However, in the case of Ti-KIT-6(Si/Ti 50), the mesopore structure of KIT-6 is partially collapsed/damaged, as can be seen on the right side of Fig. 1(d); this is due to the higher Ti content than the other two ratios of 200 and 100.This effect can be more clearly observed in Fig. 2, which shows the Ti dispersion and partial collapse of the mesopores of KIT-6 after Ti anchoring (Si/Ti 50).However, despite the Ti isolated species being dispersed on the KIT-6 support material, some agglomerates were also detected, that is, Ti-O-Ti or TiO 2 .These agglomerates were not observed in Ti-KIT-6(Si/Ti 200,100), but only in Ti-KIT-6(Si/Ti 50), this being due to the increased Ti content. Fig. 3 shows the FT-IR spectra of the KIT-6 and Ti-KIT-6(Si/Ti 200, 100 and 50) materials.The IR spectra of the KIT-6 mesoporous silica showed bands at 498 and 1268 cm -1 , which correspond to SiOSi 14.The band at 1631 cm -1 is due to the OH from the water occluded in the KIT-6 pores, whereas at 961 cm -1 , it is from SiOH.The region from 3100 to 3600 cm -1 , which centered in these spectra at 3342 cm -1 , should be attributed to hydroxyl groups from silanols as well as OH of adsorbed water, whereas stretching at 3742 cm -1 is due to the free OH groups 14,15.The Ti-KIT-6 sample showed an additional stretching at 961 cm -1 , which corresponds to TiOSi 14, where Ti was attached through the OH groups of the KIT-6 silica.An increase in the intensity of the peak has been found for an increase in the Ti content for Si/Ti ratios of 200 to 50, which is generally considered as proof of Ti incorporation in the framework of KIT-6.However, an additional stretching of TiOTi has been observed at 435 cm -1 , due to the increased Ti content in Si/Ti 50.The OH groups that correspond to the adsorption power of the material were also increased in the Ti-KIT-6 samples from Si/Ti ratios of 200 to 100 and then slightly decreased in the 50 ratio.This increase in OH groups might be associated with the good dispersion of isolated Ti species on KIT-6 with Si/Ti 100 than other ratios, which might increase the adsorption capacity of water or hydrophilicity of the material. Fig. 4(a) shows the Ti(2p) XPS spectra for Ti-KIT-6 with different Ti contents, and shows a Ti(2p 3/2 ) and Ti(2p 1/2 ) doublet with a separation of 5.75 eV 16.It has been observed that the Ti(2p 3/2 ) line was shifted towards a lower binding energy for an increased Ti content for Si/Ti ratios 200 to 50.As can be seen in the deconvoluted XPS spectra in Fig. 4(b,c), the Ti(2p 3/2 ) line shifted even further to 458.0 eV, which is close to the binding energy of Ti(2p 3/2 ) of pure TiO 2 for an increased Ti loading at Si/Ti 50.A similar trend has been found in the O1s spectra of the Ti-KIT-6 materials, as shown in Fig. 4(d,e,f), where the O1s line at 533 eV was gradually shifted to lower binding energies for the increased Ti content.The deconvoluted XPS spectra of Ti-KIT-6 at Si/Ti ratios of 100 and 50 showed two peaks at 533 eV for SiOSi and 530.8 eV corresponding to TiOTi, which indicate that there is more free TiO 2 phase formation in Ti-KIT-6(Si/Ti 50) than in Ti-KIT-6(Si/Ti 100), as can be seen from the TEM analysis. Blank tests conducted in the absence of photocatalysts as well as the reaction in the dark with catalysts, showed no product formation.CH 4 was the main product detected in all the reaction experiments.Fig. 5(a,b) shows the production rate of the CH 4 formation that originated because of the unique properties of the charge transfer excited state, i.e., (Ti 3 -O -) of the tetrahedrally-coordinated titanium oxide species within the silica frameworks 17.It can be seen that Ti-KIT-6 (calcined or dried)(Si/Ti 100) shows higher activity than the Si/Ti ratios of 200 or 50.This is due to the combined contribution of the high dispersion state of the Ti-oxide species, which is caused by the large pore size with a 3D channel structure and the lower formation of TiOTi or TiO 2 agglomerates, as was confirmed by TEM and XPS analysis.In addition, Fig. 4(c) shows a high CH 4 production for Ti-KIT-6 (Si/Ti 100) with more concentrations of OH groups than the other ratios obtained from the FT-IR of the materials, which actually affect the adsorption properties of the water on the catalyst surface 17.The ratio between H 2 O and CO 2 is another parameter that determines the selectivity of CH 4 or CH 3 OH.When H 2 O/CO 2 is high, the selectivity for CH 4 formation becomes higher 3.On the basis of the Ti shown in Fig. 5(d), it can be stated that the above mentioned optimized photocatalysts showed better activity than the best commercial TiO 2 (Degussa P25).Moreover, the results are comparable with other results reported in literature for TiO 2 as a photocatalyst 18, Ti-zeolites or Ti-MCM-41 17 for this application.The optimized Ti-KIT-6 (Si/Ti 100) showed relatively better CH 4 production than the conventional materials which indicates its importance in the future research and applications."
  },
  {
    "title": "Conclusions",
    "content": "Novel synthesized Ti-KIT-6 materials with different Si/Ti ratios (200, 100 and 50) have revealed that Ti-KIT-6 (Si/Ti 100) showed higher CH 4 formation than Ti-KIT-6(Si/Ti 200, 50).The high activity of the optimized photocatalyst was found to be due to the lower number of Ti-O-Ti or TiO 2 agglomerates and the more isolated Ti species that were uniformly dispersed on the KIT-6 mesoporous silica support without damaging the mesopore structure.The increase in OH groups found in Ti-KIT-6 also favored higher activity.The activity of the optimized Ti-KIT-6(Si/Ti 100) was also much higher than the commercial Degussa P25 TiO 2 .The current results suggest that novel KIT-6 containing highly dispersed Ti-oxide species is a promising and effective photocatalyst candidate for the reduction of CO 2 to CH 4 and indicate that it is suitable for further optimization.Further optimization of the conditions and detailed mechanism are currently in progress. Fig. 1.TEM images of (a) KIT-6, (b) Ti-KIT-6(Si/Ti 200), (c) Ti-KIT-6(Si/Ti 100) and (d) Ti-KIT-6(Si/Ti 50), showing the KIT-6 material structure preservation/damage due to Ti distribution. Fig. 2. TEM image of Ti-KIT-6(Si/Ti 50) with overall view of Ti distribution on support and TiO 2 formation. Fig. 3. FT-IR analysis spectra of KIT-6 and Ti-KIT-6 (Si/Ti 200, 100, 50 ratios) materials. Fig. 5. Methane formation comparison by photocatalytic reduction of carbon dioxide and water (a) Ti-KIT-6(dried)(Si/Ti 200, 100, 50 ratios), (b) Ti-KIT-6(calcined)(Si/Ti 200, 100, 50 ratios), (c) effect of OH groups on activity and (d) activity comparison on Ti basis with commercial Degussa P25. Physical properties of synthesized Ti-KIT-6 materials. M. Hussain et al. / Catalysis Communications 36 (2013) 58-62 Financial support by the Eco 2 CO 2 European Project (309701-2 Eco 2 CO 2 CP-FP FP7-NMP-2012-SMALL-6) is gratefully acknowledged."
  }
]