[
  {
    "title": "Doi",
    "content": "10.1039/c0ee00609b"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic CO2 reduction using an internally illuminated monolith photoreactor"
  },
  {
    "title": "Abstract",
    "content": "One of the promising solutions to both global climate warming and increasing energy demands is artificial photosynthesis, which can be implemented via the photoreduction of CO 2 to produce fuel.A monolith photoreactor was used to increase the amount of catalyst loading due to its multiple channels.The photocatalyst was dip coated using NiO/InTaO 4 sol and then calcined at 1100 C. A uniform NiO/ InTaO 4 layer was obtained on the top of pre-coated SiO 2 sublayer on the internal channels of the monolith.The polymethylmethacrylate (PMMA) optical fibers, after being carved on their surface, could transmit and scatter light to effectively illuminate the catalyst inside the channels of the monolith.Vapor-phase CO 2 with H 2 O was photocatalytically reduced to hydrocarbons by UV or visible-light in a steady-state flow mode.The maximum methanol conversion rate achieved was 0.16 mmol g A1 h A1 with visible-light of 290 klx at 25 C.The highest rate of acetaldehyde was 0.3 mmol g A1 h A1 which was obtained with a loading of 2.6 NiO by simulated sunlight AM1.5G at 70 C.More importantly, the quantum efficiency was significantly improved indicating that photon energy was effectively utilized in the monolith reactor, compared with previous optical-fiber reactor."
  },
  {
    "title": "Experimental",
    "content": "Fig. 1 shows the procedure of monolith coating.The aqueous sol-gel method was used to prepare the photocatalysts. 14As shown in Fig. 1(a), a silica sol-gel was prepared by stirring 30 ml of ethanol with 60 ml of tetraethyl silicate and then adding a mixture of 30 ml of ethanol and 30 ml of H 2 O.The pH value was decreased to pH 3 by adding some drops of 0.1 M HCl.The solution was stirred for 12 h.After that, 25 ml of PEG (polyethylene glycol) were added and stirred for additional 6 h.The solution was put into a cylindrical glass container for coating of the monolith.The monoliths used were from the Chauger honeycomb ceramics company, Taiwan.Each monolith is 4 cm in diameter and has 170 channels with 2 A 2 mm aperture within the structure.The dry weight of the monolith was noted, and then the monolith was immersed into the solution and soaked for 30 minutes.The monolith was raised from the solution and the excess solution was blown out using compressed air.The monolith was then put into the furnace and calcined by heating at a rate of 0.5 C min A1 to 700 C and held at that temperature for 3 h.This same procedure was repeated for a second coating. As shown in Fig. 1(b), the catalyst, InTaO 4 was prepared by mixing equimolar amounts of In(NO 3 ) 3 H 2 O and Ta(OC 4 H 9 ) 5 .First, 2.4 mmol (0.9182 g) of In(NO 3 ) 3 H 2 O was completely dissolved in 50 ml of methanol.0.2 ml of conc.HNO 3 was added to maintain the solution at pH 14 0.2, and then 2.4 mmol (1 ml) of Ta(OC 4 H 9 ) 5 was added.The solution was stirred for 10 min, then 3 ml of acetic acid was added and the mixture was continuously stirred slowly in a glove box maintained at 40 humidity at 25 C for 36 h.A known amount of Ni(NO 3 ) 2 6H 2 O was added for 1 wt and 2.6 wt NiO loading and the PEG solution was added into the above InTaO 4 sol to increase viscosity and to prevent cracking during drying.The NiO/InTaO 4 sol was stirred for an additional 6 h.Once the catalyst had been prepared, the monolith was coated and then calcined.Calcination occurred after the monolith was heated to 1100 C at a rate of 3 C min A1 for 12 h.The impregnation method was also applied to NiO loaded on InTaO 4 for comparison.The monolith was coated with InTaO 4 sol first, then impregnated by Ni(NO 3 ) 2 solution.The amount of Ni was measured by atomic absorption from the solution concentration before and after impregnation.Various NiO loaded catalysts, 0.8, 1.9, 2.6, 8.5 wt NiO/InTaO 4 , were prepared at 350 C calcination.The catalysts prepared by sol-gel and impregnation were assigned 'sg' and 'imp', respectively. The specific surface area of catalysts was measured by the N 2 adsorption using Micromeritics ASAP 2020.Powder X-ray diffraction (XRD) analysis of the photocatalysts was performed on an OXFORD instrument X-max.The X-ray (wavelength l 14 1.5405 A) tube was equipped with a copper target operated at 40 kV and 40 mA.The scanning rate was 50 min A1 from 20 to 80 .The crystal size was calculated using Scherrer's equation.A diffusive reflectance UV-vis spectrophotometer (Varian Cary 100) was used to measure the UV-vis reflection and to estimate the band gap of the photocatalysts.X-Ray photoelectron spectroscopy (XPS) was carried out on a Thermo Theta Probe instrument.The piece of monolith was stuck to the sample holder using carbon tape.Carbon (1s, 284.5 eV) was used as an internal standard for binding energy correction.Field-emission scanning electron microscopy (FE SEM) was carried out on a NOVA NANO SEM230 instrument.The photocatalyst was sputtered with platinum to prevent surface charging and to protect the surface material from thermal damage by the electron beam.Mercury intrusion porosimetry (Micromeritics Autopore 9520) was used to measure the porosity changes before and after coating on monolith.A sample of 2-3 g was placed in the cell, and the Hg pressure ranged up to 60 000 psi. The monolith was threaded with optical fibers, as shown in Fig. 2. The optical fibers were obtained from the Hongyi Technology Company of Taiwan and are commercial communication fibers with pure PMMA core and F-doped PMMA cladding, which can withstand temperatures up to 350 C. The diameter of optical fiber was 1 mm.The fibers were first put into an oven at 80 C for 5 minutes and straightened, then cut to a length of 1 cm longer than the length of the monolith (5 cm) before they were inserted into the channels of the monolith.Fig. 3 shows the internally illuminated monolith reactor (IIMR).Experiments were carried out using bare fibers and fibers with caves to compare the illumination effect.The monolith with fibers was placed into a circular Pyrex glass reactor (216 cm 3 ), which had a quartz window for conduction of light irradiation from the right-hand side.The light source used to activate the photocatalytic reactions was either a 200 W mercury lamp or the sun Fig. 3 The internally illuminated monolith reactor. simulator.The sun simulator (Newport, USA) equipped with 300 W xenon lamp can provide AM1.5G artificial sunlight, whose influx was measured to be 100 mW cm A2 .In addition, 400 nm and 700 nm filters were applied in front of the sun simulator to make a visible light, whose intensity was measured to be 290 klx.The reactor was covered with an aluminium foil ensuring that the only light source participating in the reaction was from the quartz window in the right-hand side as shown in Fig. 3.The reactor was checked for leakages and purged overnight using a flow of He.The flow was switched to pure CO 2 with saturated water vapor for 1 h before starting the reaction.The products were analyzed by a gas chromatograph (China Chromatograph, Taiwan) with an on-line sampling loop (5 ml) after the one-hour reaction following every hour during the reaction.The GC was equipped with an FID and 2 m long Porapak QS column.Major products were found to be methanol and acetaldehyde.Other minor products, such as formic acid, formaldehyde, ethanol and methyl formate, were detected but their concentrations were too low to be quantitatively measured accurately. In order to optimise the light transmission along the optical fibers, sidelight emission was measured on blank fibers and fibers with different types of caves along the fiber (see Fig. 2).A set of fibers was pushed into a glass tube that was placed in a cardboard box with holes along the side of the box.Light irradiated at one end of the fibers, and the light intensity was measured at each hole as sidelight emission, and at the tip of the fibers.The sidelight emission was measured at side holes of the cardboard box.The total amount of the luminance (lm) emitted from the side of each fiber bundle was calculated by the area under the curve of the side-emission profile.Three types of carved fiber were tested: caves of fixed depth along the fiber; caves of increasing depth along the fiber; and caves of increasing depth from the centre of the fiber to the end.It was found that the last type of carved fiber gave the highest sidelight emission so these were used in the reactor.Furthermore, the exit tips of the fibers were coated with metal aluminium by sputtering to increase light backward reflection.In this way, the light can be utilized efficiently in the monolith reactor."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The specific surface areas of InTaO 4 , 1 wt NiO/InTaO 4 (imp) and 1 wt NiO/InTaO 4 (sg) catalysts were 3.30, 3.58 and 2.31 m 2 g A1 , respectively, calculated from N 2 adsorption.Fig. 4 shows the XRD patterns of InTaO 4 , 1 wt NiO/InTiO 4 , Ta 2 O 5 , In 2 O 5 , and NiO, respectively.The diffraction peaks of Ta 2 O 5 and In 2 O 5 were not found in InTaO 4 and 1 wt NiO/InTiO 4 .In addition, the standard InTaO 4 diffraction peaks were observed in InTaO 4 and 1 wt NiO/InTiO 4 indicating that pure InTaO 4 was successfully synthesized.No NiO peaks were observed due to either their small particle size or high dispersion onto the InTaO 4 surface. Fig. 5 shows the UV-vis spectra of SiO 2 , InTaO 4 , 1 NiO/ InTaO 4 (sg), 1 NiO/InTaO 4 (imp), and NiO.The absorption of 1 NiO/InTaO 4 (imp) was higher than that of 1 NiO/InTaO 4 (sg) at 320 nm probably because most of the NiO was on the surface due to the impregnation process used.The band gaps of InTaO 4 and 1 NiO/InTaO 4 (sg) were calculated to be 2.7 and 2.2 eV, respectively, based on the UV-vis spectra.These values were within the typical range of values reported for InTaO 4 in the literature. 15The absorption edge was beyond 400 nm indicating the ability to absorb visible light. Fig. 6 shows SEM micrographs of coating layers on the monolith.Fig. 6(A) shows the pore morphology on the bare monolith.Most of the small pores were filled with SiO 2 as shown in Fig. 6(B).Fig. 6(C) shows 1 wt NiO/InTaO 4 (sg) on the monolith by the impregnation method with high magnification.Catalyst particles were uniformly dispersed on the top layer. The porosity changes before and after coating are presented in Table 1.After two layers of SiO 2 coating, the porosity decreased from 37.3 to 28.5, indicating that the holes were filled.This can also be observed from the SEM photos (Fig. 6(A) and (B)).By this way, we can coat the catalyst on the top of SiO 2 layer and prevent the catalyst falling in the deep holes of the monolith.Therefore, the catalyst can be fully exposed to light. Fig. 8 shows the sidelight emission variation using different types of fibers.The sidelight intensity of bare fibers decreases from near 30 to 6 lx along 6 to 35 cm of fibers.For type 1, it is clear that front caves result in sidelight intensity increase.At the front section of the fiber bundle, the sidelight intensity increases from 30 lx up to nearly 68 lx.However, the sidelight intensity decreases rapidly to 20 lx in the last 10 cm section of fibers, which results in a more uneven-distributed sidelight-intensity profile.For type 2, different-depth caves were designed for the purpose of increasing the sidelight intensity of the rear part of fiber bundle.However, as shown in Fig. 8, there is a slight increase of sidelight, around 3 lx on average, compared with the first 20 cm section of type 1. Sidelight intensity also decreases even down to 2 lx, which is the lowest among all types.For type 3, caves started from the middle and extended from 22.5 cm to 32.5 cm along the fibers.Sidelight intensity increases at the middle of fibers up to 35 lx, which is much higher than the former 2 types at the same position.From the position of 24.5 cm to the end, caves contribute nearly extra 25 lx in comparison with type 2 fibers.Thus type 3 fibers provide a more desirable sidelight-intensity profile to illuminate the deepinside channels of the monolith.Fig. 9 shows the sidelight emission variation of the fibers coated with metal aluminium at one end to act as a reflection mirror.There is no significant increase in the sidelight intensity compared with bare fibers.However, the sidelight intensity at the rear part of fibers with tip-reflection and caves emitted nearly 50 lx, which was much higher than that in type 3 (only 30 lx on average at the rear part as shown in Fig. 8).It can be concluded that the Al reflection tip attributed to the increase of sidelight intensity at the rear part of fibers. The total sidelight intensity of the different types of fibers is listed in Table 2.The fibers with tip-reflection and mid-carves (type 3) gave the highest side-emission percentage amongst the three configurations.Thus, the CO 2 photoreaction in the monolith was performed using the fibers with tip-reflection and mid-carves of type 3. Fig. 10 and 11 show the methanol and acetaldehyde rates produced by the monoliths containing no fibers, bare fibers and fibers with tip-reflection and mid-carves, under visible light and UV-A light irradiation, respectively.The photoreduction of CO 2 to form acetaldehyde requires 10 photoelectrons, which is higher than that to form methanol (6 photoelectrons required).UV-A can produce more electron-hole pairs on the catalysts than visible light because the UV-A (short wavelength) has higher photon energy than that of visible-light.Therefore, acetaldehyde was found to be the major product with UV-A irradiation.The steady-state methanol rates were obtained after 3 h due to largevolume of reactor and the long residence time (Fig. 10).The highest steady-state methanol rate, 0.16 mmol g A1 h A1 was found over the entire reaction time by using the fibers with tipreflection and mid-carves.Acetaldehyde was found to be the major product when the light was changed to UV, as shown in Fig. 11.Once again, the highest acetaldehyde rate was obtained by using the fibers with tip-reflection and mid-carves.The steadystate rate reached 0.32 mmol g A1 h A1 in near 2 h due to the high activity under UV light irradiation.However, the deactivation of catalyst was found after 3 h reaction as shown in Fig. 11.Table 3 lists the acetaldehyde production rates for various NiO loadings under AM1.5G irradiation.The simulated sunlight AM1.5G contains the same spectra of real sunlight, which has near 3 UV.The rates increased with NiO due to the increase of active sites as well as electron-trapping sites by higher loading of NiO up to 2.6 wt.However, further raising the amount of NiO loading to 8.5 wt inhibited the rate.This may be due to the light masking effect, where large amounts of NiO covered the InTaO 4 surface and thus reduced the light absorption.The aggregation of NiO particles could also decrease the active sites with high NiO loading.A maximum rate of 0.21 mmol g A1 h A1 was achieved by a NiO loading of 2.6 wt. In addition, the results by different preparations to load NiO on InTaO 4 were compared.2.6 wt NiO/InTaO 4 (imp) prepared by impregnation represented higher activity than 2.6 wt NiO/ InTaO 4 (sg).This may be due to the mixing of the Ni precursor directly into the InTaO 4 sol, resulting in part of the NiO being buried inside the InTaO 4 and losing exposure to reactants. Table 4 lists the acetaldehyde production rate at various reaction temperatures under AM1.5G irradiation.In general, increasing temperature gave positive effects on photoreaction.The highest rate was 0.3 mmol g A1 h A1 which was obtained with a loading of 2.6 NiO at 70 C.An elevated temperature can accelerate the reaction rate, but also decrease the adsorption of reactants on the catalyst.Therefore, there is an optimal temperature to achieve the highest rate. Table 5 compares the performance of optical-fiber reactors (OFRs) and IIMR.Although these two reactors had significant different configurations, light irradiation and reaction conditions, these two reactors are compared here in terms of specific rate and throughput.The specific rate represents the photoactivity of a catalyst under a given light intensity.The throughput represents the production capacity of a given reactor.The same volume was used for both OFR and IIMR.The specific rate (mmol g A1 h A1 ) of OFR was higher than that of IIMR, however, the throughput (nmol h A1 ) of IIMR was higher than that of OFR.The OFR gave a high specific rate because all catalysts can be exposed to light on the surface of optical fibers. The IIMR gave a high throughput due to high catalyst loading on the monolith.More importantly, the quantum efficiencies of IIMR were near one order of magnitude higher that those of OFR, indicating that photon energy was more effectively utilized in the IIMR compared to the OFR."
  },
  {
    "title": "Conclusions",
    "content": "The photocatalytic reduction of CO 2 is one of the best promising routes to address both our fuel crisis and our greenhouse gas emissions.It is similar to photosynthesis to utilize solar energy.However, photo-to-chemical energy conversion must be greatly improved before this technology becomes a viable solution to use solar energy.A highly active photocatalyst is one way to achieve this goal.On the other hand, the design of a high-efficient photoreactor is also crucial to commercialization in the future.The structure of monolith can significantly increase the amount of catalyst loading due to its multiple channels.Optical fibers can effectively deliver light to illuminate the catalyst inside the channels.By using mid-carve fibers, the deep-channel catalyst in the monolith was evenly illuminated.We demonstrated that the combination of optical fiber and monolith successfully enhanced a photoreaction, that is, the CO 2 photoreduction into fuel.So far InTaO 4 can only absorb light up to 460 nm.Once a wide-range visible-light catalyst is available, the internally illuminated monolith reactor can further improve its performance. Fig. 1 Preparation of SiO 2 and InTaO 4 series of photocatalysts on a monolith. Fig. 4 XRD pattern of NiO, In 2 O 3 , Ta 2 O 5 , 1 NiO/InTaO 4 , and InTaO 4 . Fig.5UV-vis spectra of catalysts. Fig. 6 SEM of coatings of SiO 2 , InTaO 4 and 1.9 NiO/InTaO 4 (imp) on the monolith.(A) Bare monolith, (B) SiO 2 /monolith, (C) NiO/InTaO 4 (imp) on SiO 2 /monolith. Fig. 7 XPS of Ni 2p on NiO/InTaO 4 . Fig. 9 Sidelight emission lx (lm m A2 ) along the distance from the head of the fibers with tip reflection by Al deposition. Fig. 10 Methanol rates of different fibers with visible-light irradiation using 1 wt NiO/InTaO 4 (sg) catalyst on the monolith reactor (light intensity: 290 klx). Fig. 11 Acetaldehyde rates of different fibers with UVA irradiation using 1 wt NiO/InTaO 4 (sg) catalyst on the monolith reactor (light intensity: 42.46 mW cm A2 ). Total light input is the summation of the sidelight and the tip-light out flux.b Summation of sidelight out flux measured along the fiber.c Sidelight output/total light input A100.d Nearly 500 nm thickness of Al on fiber tip by sputtering. Mercury porosimetry of the monolith and coated monolith Total sidelight emissions of different fibers Steady-state acetaldehyde specific rate on different NiO/ InTaO 4 a Light source: sunlight simulator AM1.5G, imp: impregnation method, sg: sol-gel method. Steady-state acetaldehyde specific rate on 2.6 wt NiO/InTaO 4 at different temperatures a Light intensity was measured in front of the reactor.(Distance between measuring probe and light source was 6 cm.) c Light intensity was measured from backside of the quartz window.(Distance between the measuring probe and quartz window was 1 cm.) d Light intensity was measured in front of the fibers.e A mole of hydrocarbon production rate/mole of photon absorbed rate by catalyst A 100); number of electrons: 6 for methanol and 10 for acetaldehyde. a Light source: sunlight simulator AM1.5G. a Catalyst was coated on optical fibers.b This work was financially supported by the National Science Council under the project of NSC 98-2911-I-002-061.The authors would also like to acknowledge the support received from The Royal Society International Project (JP090075)."
  }
]