[
  {
    "title": "Doi",
    "content": "10.1016/j.solmat.2020.110890"
  },
  {
    "title": "Article_Title",
    "content": "CO2 selectivity of flower-like MoS2 grown on TiO2 nanofibers coated with acetic acid-treated graphitic carbon nitride"
  },
  {
    "title": "Abstract",
    "content": "Activated CO 2 adsorption sites are crucial for improving selectivity in photocatalytic CO 2 reduction.Co-catalysts incorporating rare or noble metals have previously been required to achieve high CO 2 selectivity (S CO2 ); thus, noble-metal-free catalysts with high S CO2 are desirable but challenging to realize.We introduced S-scheme heterojunction using noble-metal-free TiO 2 /MoS 2 /graphitic carbon nitride (g-C 3 N 4 ) with a strong redox ability showing S CO2 90.This heterostructure improved CO 2 conversion, to levels 3.1 times higher than that of the g-C 3 N 4 alone and exhibited sufficient kinetic overpotential (0.18 eV) to produce significant amounts of CH 4 .When the proportion of g-C 3 N 4 was optimized, the specified TiO 2 /MoS 2 /g-C 3 N 4 achieved high S CO2 (90) due to its improved CO 2 adsorption, in turn due to the improved specific surface area and pore size distribution attributable to amino (-NH 2 ) groups of g-C 3 N 4. We introduced, a novel, noble-metal-free TiO 2 /MoS 2 /g-C 3 N 4 heterostructure that maximizes the number of CO 2 adsorption sites and charge carriers separation through interconnected components, and thus increases S CO2 ."
  },
  {
    "title": "Experimental",
    "content": "To produce TiO 2 NFs, titanium butoxide, polyvinylpyrrolidone (PVP; MW 360,000), ethanol, and acetylacetone were purchased from Sigma-Aldrich (Germany), Wako (Japan), Dae-Jung (Republic of Korea), and Sigma-Aldrich, respectively.For bulk g-C 3 N 4 and exfoliation treatment, melamine precursor and AA were purchased from Junsei (Japan) and Dae-Jung (Republic of Korea), respectively.Sodium sulfate (Na 2 SO 4 ) and triethanolamine were purchased from SAM-CHUN (Republic of Korea) to evaluate the photoresponse properties of the transient photocurrent and photocatalytic CO 2 reduction, respectively.Conductive fluorine-doped tin oxide (FTO) glass (15 m) was used as a substrate to fabricate the films.All chemicals were used directly, without any further purification. To prepare the TiO 2 NFs, sintering was performed followed by electrospinning.First, 1.18 M of titanium butoxide was stirred in ethanol solution for 30 min.Then, 0.7 g of PVP was added and stirred until it had dissolved completely (12 h).Finally, 0.6 mL of acetylacetone was added and stirred for 1 h until the solution turned yellow.The viscosity of the as-prepared solution was measured as 243.7 2.5 cP using a viscometer (DV2TLVCJ0; Brookfield).Then the solution was transferred into a 10 mL syringe with a stainless-steel needle (25 G) for electrospinning.A high DC voltage (20 kV) was applied and the solution (10 L/min) was ejected onto a flat collector having distance of 110 mm from the needle.The atmospheric conditions were humidity 15 and temperature 25 C. The electrospun NFs were collected every 3 h and dried in an oven at 60 C for 2 h.The NFs were sintered at 600 C for 4 h using a box furnace under an air atmosphere.For subsequent characterization, the TiO 2 NFs were used without further treatment. To synthesize MoS 2 nanosheets grown on the surface of the TiO 2 NFs, 0.1 g of NFs were sonicated in distilled water using an ultrasonic horn for 10 min.After that, 0.1 g of Na 2 MoO 4 and 0.2 g of thiourea were added and stirred until completely dissolved.The solution was transferred to a Teflon mold at 200 C for 24 h to grow the flower-like MoS 2 nanosheets by the hydrothermal method.After cooling, the TiO 2 NFs with MoS 2 were centrifuged several times with distilled water and ethanol to remove any salt and residue, until a pH of 7 was reached.Finally, the obtained catalyst, which has a dark grey color, was dried in an oven.We denote this material TiO 2 /MoS 2 .For subsequent characterization, the TiO 2 /MoS 2 was used without further treatment. g-C 3 N 4 nanosheets were synthesized by exfoliating g-C 3 N 4 through AA treatment 36.First, 20 g of melamine precursor was sintered at 550 C for 4 h (3 C/min).The obtained bulk g-C 3 N 4 was ground using a mortar and the required amount of g-C 3 N 4 was added into distilled water.Then, 1 mL of AA was added, and the solution was sonicated for 30 min.The sonicated solution was washed several times with distilled water and ethanol until it reached a pH of 7. The washed, AA-treated g-C 3 N 4 nanosheets were dried at 60 C for 2 h in an oven.We denote these nanosheets g-C 3 N 4 .For subsequent characterization, the g-C 3 N 4 was used without further treatment. We used a solvothermal method to uniformly coat the g-C 3 N 4 on the TiO 2 /MoS 2 .First, 100 mg of TiO 2 /MoS 2 was stirred in 25 mL of ethanol for 1 h.Simultaneously, certain amounts of AA-treated g-C 3 N 4 was sonicated to ensure good dispersion in 25 mL of ethanol for 1 h.Then, the g-C 3 N 4 solution was transferred into the TiO 2 /MoS 2 solution and stirred for 1 h.This solution was again transferred into the Teflon mold at 150 C for 4 h (10 C/min) for the application of the solvothermal method.After cooling, the obtained powders were dried using a rotary evaporator.The successfully synthesized heterostructures, which have a light grey color, are denoted as TiO 2 /MoS 2 /g-C 3 N 4 -1, TiO 2 /MoS 2 / g-C 3 N 4 -2, and TiO 2 /MoS 2 /g-C 3 N 4 -3 depending on whether the amount of g-C 3 N 4 (50, 75, or 100 mg, respectively); each was produced with the same mass (100 mg) of TiO 2 /MoS 2 .Furthermore, photoresponsive films were fabricated by spin-coating.First, 200 mg of the fabricated catalysts were prepared separately in 1.5 mL of ethanol.After dissolving completely, the solution was spin-coated on FTO (11 cm 2 ) at 2500 rpm for 60 s and then dried in the oven for 2 h.The dried films were sintered at 150 C for 1 h to remove the remaining ethanol solution; in this way, the photoresponsive films were fabricated so that their photoelectrochemical properties and capacity for photocatalytic CO 2 reduction could be evaluated. The transient photocurrent density and electrochemical impedance spectra (EIS) were measured using a three-electrode quartz cell in 0.5 M Na 2 SO 4 and a potentiostat (VersaSTAT 4; Princeton Applied Research, Princeton, USA).As-prepared photoresponsive film, Pt wire, and Ag/ AgCl were used as the working, counter, and reference electrodes, respectively.The transient photocurrent was measured while 1 V of bias potential was applied via the reference electrode.The EIS were measured at frequencies of 10 5 -0.1 Hz with an AC amplitude of 10 mV (biased at 1 V).Mott-Schottky plots were obtained at different frequencies.All photoelectrochemical properties were measured under UV-visible (UV-Vis) irradiation (12 mW/cm 2 ) using a 300-W Xe-arc lamp (66,984; Newport, USA). To study the photocatalytic CO 2 reduction of the as-prepared samples, we used a homemade stainless steel reactor with a volume of 260 mL.First, 22 vol of triethanolamine in 125 mL of the aqueous solution was added as a hole scavenger.Approximately 20 mg of the catalyst was coated on the FTO.Prior to reaction, the reactor was tightly sealed with a connector and CO 2 gas was then added up to 0.2 MPa to saturate the aqueous solution, adsorbing CO 2 molecules into the catalyst.The gases thus produced were detected by a fused-silica capillary column with a pulsed discharge detector (6500 GC; YL Instruments, Republic of Korea) and helium was employed as a carrier gas.To ensure the reliability of the measurements, all prepared films were tested for photocatalytic CO 2 reduction up to three times, with new samples used each time under the same conditions.Moreover, we performed a recycling test to assess the stability of the TiO 2 /MoS 2 /g-C 3 N 4 heterostructure under the same conditions: after one cycle, used films were washed with deionized water overnight for the next run. The TiO 2 NFs with TiO 2 /MoS 2 , TiO 2 /MoS 2 /g-C 3 N 4 , and g-C 3 N 4 were analyzed using a field-emission scanning electron microscope operating at 15 kV (FE-SEM; S4800; Hitachi, Japan) and a scanning transmission electron microscope operating at 200 kV (TEM; JEM2100F; JEOL, Japan).High-angle annular dark-field scanning transmission electron microscopy (HAADF-STEM) and energy-dispersive X-ray spectroscopy were used for elemental mapping of the TiO 2 /MoS 2 /g-C 3 N 4 heterostructure.X-ray diffraction (D/Max-2500/PC Cu K source, 1.5418A; Rigaku, Japan) was used to detect the TiO 2 , MoS 2 , and g-C 3 N crystalline phases.We used X-ray photoelectron spectroscopy (XPS; K-Alpha Al K source; Thermo Fisher Scientific, UK) to measure the chemical binding energies of the TiO 2 NFs with TiO 2 /MoS 2 , TiO 2 /MoS 2 / g-C 3 N 4 , and g-C 3 N 4 after calibrating its peak of C1s at 284.8 eV.Fouriertransform infrared spectroscopy (FTIR; iS10; Thermo Fisher Scientific) confirmed the presence of specific g-C 3 N 4 peaks.We used UV-Vis spectroscopy (V650; JASCO, Japan) to measure the optical absorbance, which relates to the bandgap energy.We carried out photoluminescence (PL) and time-resolved PL (FL920; Edinburgh Instruments, UK) studies to observe the recombination and carrier lifetimes, respectively, of the as-prepared samples under 325 nm laser excitation.We analyzed the CO 2 adsorption, specific surface area and pore size distribution of TiO 2 / MoS 2 /g-C 3 N 4 -1, -2, and -3 based on the N 2 adsorption/desorption isoforms using a Brunauer-Emmett-Teller (BET) analyzer (TriStar II 3020; Micromeritics, USA), after pretreating at 100 C for 24 h."
  },
  {
    "title": "Results_and_Discussion",
    "content": "We observed the microstructures of the as-prepared TiO 2 NFs, TiO 2 / MoS 2 , TiO 2 /MoS 2 /g-C 3 N 4 , and g-C 3 N 4 using the FE-SEM with higher magnification, as shown in Fig. S1.The electrospun TiO 2 NFs sintered in the air had a diameter of 254 17 nm.Fig. S1(a) shows the smooth surface of the TiO 2 NFs, which was due to the removal of PVP during sintering.Fig. S1(b) shows the flower-like structure of the MoS 2 , with a diameter of 1 m, grown using the hydrothermal method on top of the TiO 2 NFs.When the g-C 3 N 4 was coated on the TiO 2 /MoS 2 structures, it was found to coat the entire surface uniformly.Along with the uniform coating on the NFs, a few separate bulky structures of g-C 3 N 4 were also observed under high magnification as shown in Fig. S1(c).For the comparison, AA-treated g-C 3 N 4 is shown in Fig. S1(d). We used high-resolution TEM for detailed morphological analysis of the TiO 2 /MoS 2 /g-C 3 N 4 heterostructure, as shown in Fig. 1(a-c). .The peak at 887.2 cm -1 is attributed to the deformation of amine (N-H) 40.We attributed the broad peaks observed at 3400-3000 cm -1 to N-H from the residual amino (-NH 2 ) groups and hydroxyl (O-H) stretching modes 41. We used XPS analysis to characterize the chemical bonds of TiO 2 / MoS 2 /g-C 3 N 4 and analyze its binding energy, as shown in Fig. 2. In the Ti 2p spectrum of the heterostructure, the peaks at 458.6 and 464.2 eV were fitted to Ti 2p 3/2 and Ti 2p 1/2 , respectively.To compare the Ti 2p spectra of the TiO 2 NFs and TiO 2 /MoS 2 , they were fitted on one graph, as shown in Fig. S3(a).When MoS 2 was grown on the TiO 2 NFs, the binding energy decreased, allowing easier electron transfer from the conduction band of the TiO 2 NFs to that of the MoS 2 .Similarly, when g-C 3 N 4 was coated on the TiO 2 /MoS 2 structure, the binding energy again decreased; the energy of the conduction band of the TiO 2 /MoS 2 was lower than that of the MoS 2 .In the O 1s spectrum (Fig. 2(b)), the three peaks were deconvoluted at 529.8, 531.6, and 533.1 eV which we assigned to the Ti and O bonds of Ti-O-Ti, Ti-O-C, and Ti-O-H, respectively 42.When the g-C 3 N 4 was coated on the TiO 2 /MoS 2 structures, the Ti-O-C peak showed higher intensity compared to that of the bare TiO 2 NFs and TiO 2 /MoS 2 structures, suggesting a high binding energy due to the interaction between the g-C 3 N 4 and TiO 2 /MoS 2 structures, as shown in Fig. S3(b) 43.The main peaks of Mo 4 3d 5/2 and Mo 4 3d 3/2 were detected at 228.8 and 232.1 eV, respectively, while the peak at 225.8 eV was assigned to S 2s, as shown in Fig. 2(c) 44.The Mo 3d spectrum of TiO 2 /MoS 2 shown in Fig. S3(c) indicates that the peaks at 235.1 and 235.9 eV correspond to Mo 6 3d 5/2 and Mo 6 3d 3/2 , respectively, due to slight oxidation of the MoS 2 surface after applying the hydrothermal synthesis method 45.Similarly, for TiO 2 /MoS 2 /g-C 3 N 4 , we detected weak oxidation peaks for Mo 6 3d 5/2 (234.8 eV) and Mo 6 3d 3/2 (235.6 eV).Additionally, the S 2p spectrum of the heterostructure exhibited two main peaks at 162.2 and 168.9 eV, corresponding to S 2p 3/2 and S 2p 1/2 , respectively, as shown in Fig. 2(d).To confirm the presence of g-C 3 N 4 in the TiO 2 /MoS 2 heterostructure, we analyzed the C 1s and N 1s spectra (Fig. 2(e-f)).The three main peaks, at 284.8, 286.4,and 288.2 eV, were assigned to C-C graphitic carbon bonding, C-NH x for three-coordinated C atoms, and N-C--N for sp 2 -hybridized carbon in the triazine group, respectively 46,47.The peak intensity of N-C--N was lower in the TiO 2 /MoS 2 /g-C 3 N 4 heterostructure compared to that of g-C 3 N 4 , possibly due to the low amount of g-C 3 N 4 coating on the TiO 2 /MoS 2 structures, as indicated in Fig. S3(e).Furthermore, the peaks in the N 1s spectrum of the heterostructure were assigned to C--N-C for sp 2 -hybridized nitrogen, N-(C) 3 for tertiary nitrogen, C-N-H bonding, and -excitations at 398.6, 399.4,401.0, and 404.2 eV, respectively (Fig. 2(f)) 46.Particularly, TiO 2 /MoS 2 /g-C 3 N 4 showed significant evidence of N-Mo bonding at 394.4 eV, suggesting a strong interaction between the MoS 2 and g-C 3 N 4 , while the bare g-C 3 N 4 did not exhibit an N 1s spectrum, as shown in Fig. S3(f) 48,49.Therefore, FTIR and XPS analysis of TiO 2 /MoS 2 /g-C 3 N 4 indicated that this heterostructure has been created successfully due to the strong bonding between the g-C 3 N 4 and TiO 2 /MoS 2 . Along with the morphological and chemical characterization of the as-prepared samples, we evaluated their photoresponses to assess their optical properties.First, the optical absorbance was measured within the UV-Vis range of 300-900 nm, as shown in Fig. 3(a), to calculate the bandgap.In the inset, we can see that the TiO 2 NFs showed the lowest absorbance in the visible range; bare g-C 3 N 4 showed a band edge, with a wavelength of 475 nm.However, when the flower-like MoS 2 was grown on the TiO 2 NFs, the band edge of the TiO 2 NFs shifted from 400 to 450 nm.Moreover, when the g-C 3 N 4 was coated on the TiO 2 /MoS 2 structures, the band edge shifted slightly, with lower absorbance compared to that of the TiO 2 /MoS 2 structures.Based on the band edge absorbance results, the bandgap energy was 2.86, 2.33, 2.27, and 2.50 eV for the TiO 2 NFs, TiO 2 /MoS 2 , TiO 2 /MoS 2 /g-C 3 N 4 , and g-C 3 N 4 , respectively, based on tauc plots.As expected, the TiO 2 /MoS 2 /g-C 3 N showed the lowest bandgap.We conducted PL measurements to observe the recombination of the as-prepared samples.As shown in Fig. 3(b), the g-C 3 N 4 had the strongest PL emission, with a broad range around nm, while a slightly shifted PL spectrum of the TiO 2 /MoS 2 /g-C 3 N 4 was observed at 470 nm, suggesting an effective separation of photoexcited electron and hole pairs under 325 nm laser excitation.However, the TiO 2 NFs and TiO 2 /MoS 2 exhibited no photoemission under the same conditions, as shown in Fig. S4.Therefore, PL analysis indicated that the TiO 2 /MoS 2 /g-C 3 N 4 heterostructure effectively reduced the recombination of charge carriers.Fig. 3(c) shows the photocurrent density measured while switching the light on and off every 60 s, which was done to determine the photoresponse of the as-prepared samples.The transient photocurrent density of the TiO 2 NFs and g-C 3 N 4 showed the lowest values, of 1.8 and 1.6 A/cm 2 respectively, while the TiO 2 /MoS 2 structure showed a lower photocurrent density, of 2.8 A/cm 2 , than that of the TiO 2 /MoS 2 /g-C 3 N 4 heterostructure.In the case of TiO 2 /MoS 2 /g-C 3 N 4 , the photocurrent density (3.7 A/cm 2 ) was 2.3 times higher than that of g-C 3 N 4 .Moreover, even while the light was off, both the TiO 2 /MoS 2 and TiO 2 /MoS 2 / g-C 3 N 4 structures showed slower decay of photogenerated electron-hole pairs than the bare TiO 2 or g-C 3 N 4 , as indicated by the green circle in Fig. 3(c).The slowest decay and highest photocurrent density of TiO 2 / MoS 2 /g-C 3 N 4 confirmed an effective photogenerated electron channel and an excellent photoresponse 50.Nyquist plots of the EIS were used to determine the kinetics of the charge movements, as shown in Fig. 3 (d).Regarding the photocurrent density, the impedance values were divided by the exposed area, of 8 cm 2 .As shown in the figure, the resistance value for charge transfer between electrolytes and catalysts is denoted R ct .Under light irradiation, semicircles formed on the plots of the TiO 2 NFs, TiO 2 /MoS 2 , and g-C 3 N 4 , with radii of 73, 93, and 94 k/cm 2 , respectively.As expected, the radius was smaller for TiO 2 /-MoS 2 /g-C 3 N 4 (53 k/cm 2 ), due to the fast transport of photogenerated electrons through well-connected interfaces, than for TiO 2 NFs, TiO 2 /-MoS 2, and g-C 3 N 4 . Finally, time-resolved photoluminescence (TRPL) analysis was performed to determine the photoinduced charge carrier lifetime using the following equation 51,52: The average carrier lifetime of the TiO 2 /MoS 2 /g-C 3 N 4 was 5.28 ns, which was longer than that of the g-C 3 N 4 only (4.41 ns), as shown in Fig. 3(e); the lifetimes of these structures are summarized in Fig. 3(f). Generally, TRPL analysis revealed that excellent photocatalytic reaction performance is usually due to a long carrier lifetime, the separation of charge carriers, and a low recombination rate under light irradiation 53.As mentioned above, TiO 2 /MoS 2 showed no photoemission response under the same condition.Based on the photoresponse parameters, including the optical absorbance, recombination rate, photocurrent density, charge transfer, and carrier lifetime, the TiO 2 /MoS 2 /g-C 3 N 4 heterostructure clearly exhibited an effective electron pathway through interconnections among its TiO 2 , MoS 2 , and g-C 3 N 4 components, with outstanding transportation of the photo-induced electrons and a longer charge carrier lifetime than the g-C 3 N 4 . We explored the as-prepared catalysts in terms of photocatalytic CO reduction (specifically, their photoreaction activity under UV-Vis irradiation).H 2 , CO, and CH 4 were the main products of TiO 2 NFs, TiO 2 / MoS 2 , TiO 2 /MoS 2 /g-C 3 N 4 , and g-C 3 N 4 , as shown in Fig. S5.To ensure reliability, Photocatalytic CO 2 reduction was tested three times under the same conditions, results are summarized in Fig. 4(a).The amounts of CO from TiO 2 NFs, TiO 2 /MoS 2 , TiO 2 /MoS 2 /g-C 3 N 4 , and g-C 3 N 4 were 22.81, 38.69, 42.52, and 12.80 mol/g, respectively, while the respective amounts of CH 4 were 10.36, 17.19, 21.78, and 6.13 mol/g.The TiO 2 NFs and g-C 3 N 4 alone showed exceptionally low yields of both CO and CH 4 , with the g-C 3 N 4 giving the lowest yields, possibly due to its high recombination rate for photoinduced electron and hole pairs.However, after the flower-like MoS 2 grown on the TiO 2 NFs, the CO and CH 4 yields were 1.7 and 1.6 times higher, respectively, than those of the TiO 2 NFs alone.Furthermore, after the g-C 3 N 4 has been uniformly coated on the TiO 2 /MoS 2 , the CO and CH 4 yields dramatically increased to 3.3 and 3.6 times those of g-C 3 N 4 alone, respectively.These high yields confirmed that the interconnected interfaces in these materials enhance the electron transport and thus, a high oxidation and reduction capability.To investigate the stability of the TiO 2 /MoS 2 /g-C 3 N heterostructure, a recycling test was performed three times, up to 5 h for each cycle; the results are shown in Fig. 4(b).The yields of CO and CH 4 were reasonably stable.The CO 2 conversion, given by the sum of the CO and CH 4 yields, is shown in Fig. 4(c).The TiO 2 /MoS 2 /g-C 3 N 4 exhibited a high CO 2 conversion rate of 67.41 mol/g; for the TiO 2 NFs, TiO 2 /MoS 2 , and g-C 3 N 4 , the respective values were 36.16,52.80, and 21.68 mol/g, respectively. The band diagrams of TiO 2 /MoS 2 /g-C 3 N 4 heterostructures are used to interpret the photocatalytic CO 2 reduction mechanism based on the measured bandgaps, as well as the Mott-Schottky plots and the valence bands measured via XPS.Details of the band diagram equations and calculations are provided in Figs.S6(a-f).According to the calculation, the conduction band level of g-C 3 N 4 is located a bit higher than that of the TiO 2 or MoS 2 conduction band as shown in Fig. 4(d).Moreover, according to the band diagrams for TiO 2 /MoS 2 /g-C 3 N 4 , the CH 4 kinetic overpotential (E a,CH4 ) values were calculated to be 0.18 eV E a,CH4 is typically used to determine the distance from the conduction band of a catalyst to the reduction potential of CH 4 /CO 2 (-0.24V) 9,54.Based on the calculated values, TiO 2 /MoS 2 /g-C 3 N 4 has sufficient E a,CH4 for superior electron transport, and hence CO 2 conversion, compared to the other materials.Conventionally, the desorption of CO or CH 4 molecules from a catalyst is equally important as that of adsorption of CO 2 on the catalyst during photocatalytic CO 2 reduction.Based on DFT calculation in literature, adsorption energies of H 2 O, CO 2 , H 2 , CO, and CH 4 on g-C 3 N 4 were -0.513, -0.226, -0.078, -0.155, and -0.163 eV, respectively 55.Here, H 2 O and CO 2 were reported to have more negative adsorption energies than those of H 2 , CO, and CH 4 gases.Thus, it explains why we have strong adsorption of CO 2 molecules on the fabricated heterostructure of TiO 2 /MoS 2 /g-C 3 N 4 , resulting in effective photocatalytic CO 2 reduction with easy desorption of productive gases. Depending on its electronic band diagram of TiO 2 /MoS 2 /g-C 3 N 4 heterostructure, the S-scheme with charge transfer is suggested as a possible mechanism.Prior to the formation of the heterostructure, Fig. 5 (a) showed band diagrams of each TiO 2 , MoS 2 , and g-C 3 N 4 with its Fermi level (E f ), estimated from the work function Fig. S5, equation 4.As TiO 2 /MoS 2 /g-C 3 N 4 heterostructure was formed, the electrons from g-C 3 N 4 will transfer to both TiO 2 and MoS 2 , reaching an equilibrium E f level.This causes band bending and depletion layer along with an internal electric field at the interfaces between g-C 3 N 4 /TiO 2 and g-C 3 N 4 /MoS 2 (Fig. 5(b)).When the light was irradiated into the catalysts, electron and hole pairs were photogenerated at TiO 2 , MoS 2 , and g-C 3 N 4 separately.The excited electrons from the CB of TiO 2 are transferred to VB of g-C 3 N 4 and these photogenerated electrons and hole pairs will recombine easily due to its Coulombic attraction at the interface between TiO 2 and g-C 3 N 4 .Afterwards, the powerful electrons from the CB of g-C 3 N 4 will move into the CB of MoS 2 , reacting with absorbed CO 2 molecules through the surfaces and reducing hydrocarbons mainly to CO and CH 4 while the holes in the VB of TiO 2 and MoS 2 have reacted with TEOA, to oxidize TEOA into TEOA .Therefore, the designed S-scheme heterostructure offers the fast electron transportation of one-dimensional TiO 2 NFs, interfacing with active sites of flower-like MoS 2 as well as g-C 3 N 4 nanosheets.Therefore, the recombination of charge carriers due to Coulombic attraction at the interfaces of TiO 2 /g-C 3 N 4, leads to effective movements of useful charge carriers to CB of MoS 2 as well as VBs of MoS 2 and TiO 2. Overall, this S-scheme heterojunction shows a strong redox on each surface to result in superior photocatalytic CO 2 reduction. Photocatalytic CO 2 reduction was considered in terms of the effect of g-C 3 N 4 loaded onto the TiO 2 /MoS 2 structures.For reliability, TiO 2 / MoS 2 /g-C 3 N 4 -2 and TiO 2 /MoS 2 /g-C 3 N 4 -3 each were tested three times under the same conditions, as shown in Fig. S7(b-c).The results regarding the amounts of the evolved gases (CO and CH 4 ) up to 5 h of collection time are shown in Fig. 6 6(b) S CO2 can be calculated using the following equation 56: where n is the evolved yield of S1.The CO 2 adsorption amounts for the TiO 2 /MoS 2 /g-C 3 N 4 -1, TiO 2 /MoS 2 /g-C 3 N 4 -2, and TiO 2 /MoS 2 /g-C 3 N 4 -3 were 0.55, 1.05, and 1.28 cm 3 /g STP, respectively.The porous structure of the TiO 2 /MoS 2 / g-C 3 N 4 -3 provided more active sites for CO 2 diffusion and adsorption, as well as efficient electron transfer through its interfaces 57.Moreover, the increased porosity with additional g-C 3 N 4 probably expanded the adsorption of CO 2 on photocatalysts due to Lewis basic functions of the -NH 2 in g-C 3 N 4 to capture CO 2 molecules by forming H 2 bonds with CO 2 58,59.Here, the presence of -NH 2 has expanded CO 2 adsorption as well as CO 2 activation 60.According to these CO 2 adsorption results, TiO 2 /MoS 2 /g-C 3 N 4 -3 exhibited much higher CO 2 adsorption capacity than TiO 2 /MoS 2 /g-C 3 N 4 -1 or TiO 2 /MoS 2 /g-C 3 N 4 -2, due to the higher porosity of the g-C 3 N 4 , as shown in Fig. 6(d).Furthermore, we summarized preliminary studies comparing TiO 2 , MoS 2 , or g-C 3 N 4 based materials for photocatalytic CO 2 reduction as shown in Table S2.The S CO2 value 90 observed for this noble metal-free TiO 2 /MoS 2 /g-C 3 N 4 heterostructure, is attributed to the maximization of CO 2 adsorption due to its specific surface area and porous g-C 3 N 4 structure, along with the interconnections among the TiO 2 , MoS 2 , and g-C 3 N 4 components, which promoted efficient electron transfer."
  },
  {
    "title": "Conclusions",
    "content": "A noble-metal-free TiO 2 /MoS 2 /g-C 3 N 4 heterostructure with S CO2 90 was successfully produced using hydro-and solvothermal methods followed by electrospinning.Flower-like MoS 2 nanosheets were grown on TiO 2 NFs and then acetic-acid treated g-C 3 N 4 was uniformly coated.Chemical binding energy and morphological analyses revealed strong interactions among the TiO 2 , MoS 2 , and g-C 3 N 4 components of the heterostructure.Photoresponse analysis showed that the heterostructure showed the smallest bandgap and lowest PL intensity (470 nm), as well as the highest photocurrent density and lowest charge transfer resistance, suggesting an effective separation of photoinduced charge carriers.Moreover, TRPL analysis revealed a longer carrier lifetime for the heterostructure than for the g-C 3 N 4 .Regarding photocatalytic CO reduction, the heterostructure showed 1.9 and 3.1 times higher CO conversion than the TiO 2 NFs and g-C 3 N 4 , respectively.Electronic band diagrams based on the measured bandgaps, valence bands obtained by XPS, and flat band potentials indicated that the TiO 2 /MoS 2 /g-C 3 N showed sufficient E a,CH4 (0.18 eV) to produce CH 4 during CO 2 reduction.We found that it follows S-scheme mechanism where n-type semiconductors tend to migrate the electrons from the CB of TiO 2 to VB of g-C 3 N 4 due to its formation of internal electric field, inducing recombination of pointless charge carriers, so that strong photocatalytic CO 2 reduction redox ability in the CB of MoS 2 as well as VB of TiO 2 and MoS 2, was obtained eventually.To optimize the heterostructure, the amount of g-C 3 N 4 was increased; TiO 2 /MoS 2 /g-C 3 N 4 -3, with 100 mg of g-C 3 N 4 , showed the highest S CO2, of 90.Due to the larger surface area and smaller pore size provided by the amino (-NH 2 ) groups of g-C 3 N structure, along with well-connected interfaces, the TiO 2 /MoS 2 / g-C 3 N 4 -3 has significantly more CO 2 adsorption sites and allows for easier electron movement, resulting in high S CO2 under light irradiation without the need to incorporate any noble metal. Suhee Kang: Conceptualization, Data curation, Formal analysis, Fig. (a) shows the flower-like shape of the MoS 2 on the TiO 2 NFs, which are uniformly covered with g-C 3 N 4 nanosheets; the areas labeled 1 and were analyzed in detail to confirm the presence of TiO 2 and MoS phases.Fig. 1(b) shows that the d-spacing of the flower-like MoS 2 was d (100) 0.642 nm on the TiO 2 NFs which had both rutile (d (110) 0.319 nm) and anatase (d (101) 0.349 nm) phases.The uniformly coated g-C 3 N 4 was observed on the MoS 2 ; amorphous structures under the yellow dotted line can be seen in Fig. 1(c).Furthermore, the TiO 2 /MoS 2 /g-C 3 N 4 heterostructure was scanned via HAADF-STEM for elemental mapping, to confirm the uniform growth and coating status of the as-prepared materials (Fig. 1(d)).The presence of the g-C 3 N 4 coating on the TiO 2 / MoS 2 was confirmed by comparison with the TEM images of the uncoated TiO 2 /MoS 2 structures, as shown by the HAADF-STEM elemental map in Fig. S2.After magnifying the pink dotted circle in Fig. S2(a), we measured the d-spacing of the rutile (d (110) 0.315 nm) and anatase (d (101) 0.341 nm) phases in the TiO 2 NFs, and the d-spacing of the MoS 2 (d (110) 0.643 nm) on the TiO 2 NFs, as shown in Fig. S2(b).As shown in Fig. S2(c), in the TiO 2 /MoS 2 structure, we only detected the elements O, S, Ti, and Mo.Therefore, MoS 2 was grown successfully on the TiO 2 NFs, while g-C 3 N 4 was uniformly coated on the TiO 2 /MoS 2 structures (indicated by the presence of C, O, S, Ti, Mo, and N).X-ray diffraction was used to evaluate the crystalline phases of all prepared samples; the results are shown in Fig. 1(e).Peaks for crystalline TiO 2 appeared at 25.22, 38.22, 47.96, 53.81, 54.98, 62.03, and 70.21 , which correspond to index planes of the anatase phase (No. 72-7058) of (101), (004), (200), (105), (211), (204), and (220) respectively.The peaks at 27.39, 36.02,39.10, 41.24, 44.02, 54.32, 56.52, 62.72, 68.96, 69.76, and 76.42 of the rutile phase (No. 75-1748) correspond to the (110), (101), (200), (111), (210), (211), (220), (002), (301), (112), and (202) planes, respectively.The peaks for MoS 2 at 14.23, 33.02, 39.62, 49.53, and 58.87 correspond to the (002), (100), (103), (105), and (110) planes (No. 75-1539), respectively.Moreover, we ascribed the peaks detected for g-C 3 N 4 at 12.87 and 27.85 to the (100) plane for the tri-s-triazine structural packing, and the (002) plane for the inter-planar spacing, of g-C 3 N 4 , respectively37.However, the TiO 2 /MoS 2 and TiO 2 /MoS 2 /g-C 3 N 4 structures showed low-intensity MoS 2 phases compared to their TiO 2 phases, due to the small amounts of their MoS precursors.In the TiO 2 /MoS 2 /g-C 3 N 4 heterostructure, no significant peaks for g-C 3 N 4 were observed due to overlapping with the rutile (101) plane.To investigate the presence of g-C 3 N 4 , FTIR analysis of g-C 3 N 4 peaks was performed, as shown in Fig.1(f).The TiO 2 NFs showed peaks at 691.6 and 510.1 cm -1 , which were related to Ti-O bonds38.After the MoS 2 had been grown on the TiO 2 NFs, and g-C 3 N 4 coated on the TiO 2 /MoS 2 structures, the Ti-O bond peak at 691.6 cm -1 was broader compared to that of the bare TiO 2 NFs, indicating successful MoS coating of the NFs.The bare g-C 3 N 4 showed peaks corresponding to C-N heterocycles at 1644.5, 1558.7,1453.5, 1415.5, 1327.4,and 1243.8 cm -1 , and breathing vibration of tri-s-triazine at 805.1 cm -1 39.As expected, g-C 3 N 4 peaks were detected for the TiO 2 /MoS 2 /g-C 3 N 4 heterostructure.Heterocycle rings were observed with TiO 2 /MoS 2 /g-C 3 N at 1634.0, 1557.4,1455.6,1408.8,1320.3, and 1243.7 cm -1 , attributed to aromatic C--N and the C-N stretching mode.Graphite-like sp bonding for tri-s-triazine was observed at 807.7 cm -1 Fig. 1.TEM images of TiO 2 /MoS 2 /g-C 3 N 4 (a) at low magnification and (b) high magnification, showing the TiO 2 and MoS 2 d-spacings and (c) the interfaces between MoS 2 and g-C 3 N 4 .(d) HADDF-STEM with EDS mappings.(e) XRD analysis and (f) FT-IR analysis of TiO 2 nanofibers of TiO 2 /MoS 2 , TiO 2 /MoS 2 /g-C 3 N 4 , and g-C 3 N 4 . Fig. 2. XPS data of TiO 2 /MoS 2 /g-C 3 N 4 showing the spectra for (a) Ti 2p, (b) O 1s, (c) Mo 3d, (d) S 2p, (e) C 1s, and (f) N 1s. Fig. 3. Optical properties of the (a) bandgap energy absorbance (inset), (b) photoluminescence analysis, (c) transient photocurrent density (green circles indicated residual photocurrent density during the light-off state), (d) electrochemical impedance spectra on a Nyquist plot (open solid dots represent impedance values under dark light conditions), (e) time-resolved photoluminescence analysis, and (f) summary of the time-resolved photoluminescence data for TiO 2 nanofibers, TiO 2 /MoS 2 , TiO 2 /MoS 2 /g-C 3 N 4 , and g-C 3 N 4 .(For interpretation of the references to color in this figure legend, the reader is referred to the Web version of this article.) Fig. 4. (a) CO and CH 4 yields of TiO 2 nanofibers, TiO 2 /MoS 2 , TiO 2 /MoS 2 /g-C 3 N 4 , and g-C 3 N 4 (for each run, CO 2 reduction was performed three times to ensure repeatability), (b) reusability of TiO 2 /MoS 2 /g-C 3 N 4 , (c) CO 2 conversion with CO and CH 4 yields, and (d) electronic band diagrams for TiO 2 nanofibers, MoS 2 , and g-C 3 N 4 of TiO 2 /MoS 2 /g-C 3 N 4 . Fig. 5.The step-scheme (s-scheme) heterojunction mechanism of TiO 2 /MoS 2 /g-C 3 N 4 for photocatalytic CO 2 reduction (a) before contact, (b) after contact, and (c) light irradiation after contact.Here, purple arrows indicate movement of electrons.(For interpretation of the references to color in this figure legend, the reader is referred to the Web version of this article.) Fig. 6.(a) CO and CH 4 yields of TiO 2 /MoS 2 /g-C 3 N 4 -1, TiO 2 /MoS 2 /g-C 3 N 4 -2, and TiO 2 /MoS 2 /g-C 3 N 4 -3, (b) H 2 , CO, CH 4 yields with CO 2 selectivity of TiO nanofibers, TiO 2 /MoS 2 , TiO 2 /MoS 2 /g-C 3 N 4 -1, TiO 2 /MoS 2 /g-C 3 N 4 -2, and TiO 2 /MoS 2 /g-C 3 N 4 -3, g-C 3 N 4 , (c) N 2 adsorption/desorption with pore distribution (average pore size shown in the inset), and (d) CO 2 adsorption of TiO 2 /MoS 2 /g-C 3 N 4 -1, TiO 2 /MoS 2 /g-C 3 N 4 -2, and TiO 2 /MoS 2 /g-C 3 N 4 -3. (a).The amounts of CO collected for TiO 2 /MoS 2 /g-C 3 N 4 -1, TiO 2 /MoS 2 /g-C 3 N 4 -2, and TiO 2 /MoS 2 / g-C 3 N 4 -3 were 42.52, 40.75, and 35.65 mol/g, respectively, while the respective amounts of CH 4 were 21.78, 16.29, and 14.39 mol/g.As the amount of g-C 3 N 4 coated on the TiO 2 /MoS 2 structures increased, the sum of CO and CH 4 decreased.The yields of H 2 , CO, and CH 4 , and the CO 2 selectivity, for all of the prepared photocatalysts (TiO 2 NFs, TiO 2 / MoS 2 , TiO 2 /MoS 2 /g-C 3 N 4 -1, TiO 2 /MoS 2 /g-C 3 N 4 -2, and TiO 2 /MoS 2 / g-C 3 N 4 -3, and g-C 3 N 4 ) are summarized in Fig. This work is funded by the NRF Korea from Ministry of Education (2019R1F1A1060586 and 2016R1D1A1A02936936) and funded by KEIT (No.20012211). The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://doi. org/10.1016/j.solmat.2020.110890."
  }
]