[
  {
    "title": "Doi",
    "content": "10.1016/j.ijhydene.2017.01.126"
  },
  {
    "title": "Article_Title",
    "content": "Copper-decorated TiO2 nanorod thin films in optofluidic planar reactors for efficient photocatalytic reduction of CO2"
  },
  {
    "title": "Abstract",
    "content": "As the global warming which is mainly caused by atmospheric CO 2 and the depletion of fossil fuels becomes more and more serious, the method for reducing CO 2 with high efficiency and low energy consumption is urgently needed.In this letter, an effective photocatalytic reduction of CO 2 by using Cu 2 eTiO 2 nanorod thin films photocatalyst in optofluidic planar reactors under UV light was studied.Cu 2 -deposited TiO 2 nanorod thin films were fabricated by using the combination of hydrothermal method and ultrasonicassisted sequential cation adsorption method.The samples were characterized by X-ray diffraction (XRD), UVevis diffuse reflectance spectra (DRS), scanning electron microscope (SEM), energy dispersive spectroscopy (EDS) and transmission electron microscope (TEM).Their photocatalytic activities were evaluated by reduction of gas-phase CO 2 , and the main products were methanol and ethanol.The experiment results showed that when the doped concentration of Cu 2 was 0.02 M, the reaction product yield reached the maximum, and the methanol and ethanol yields were 36.18mmol/g-cat h and 79.13 mmol/g-cat h at a flow rate of 2 mL/min and under the reaction system temperature of 80 C. The highly efficient photocatalytic activities of Cu 2 eTiO 2 nanorod thin films in the reduction process of CO 2 were attributed to the incorporation of Cu 2 ions and one-dimensional (1D) nanostructure which improved the limitations of photon transfer.In addition, the photocatalytic mechanism was discussed to understand the experimental results over the Cu 2 modified TiO 2 nanorod thin films."
  },
  {
    "title": "Experimental",
    "content": "The growth of oriented TiO 2 nanorod thin films was prepared using a simple hydrothermal method based on the previously reported literature 19,22.However, the synthesis parameters were also improved in this letter.Firstly, fluorine-doped tin oxide (FTO) pieces (F:SnO 2 , 10U/sq, Lixinda Glass China, 25 mm A 30 mm A 1.1 mm) which were ultrasonically washed for 30 min in a mixed solution of ethanol (Chengdu Kelong, China), acetone (SigmaeAldrich) and 2-propanol (Chengdu Kelong, China) with volume ratios of 1:1:1, and 30 min in deionized water respectively.Then the clean FTO pieces were employed as substrates for the growth of TiO 2 nanorods.The substrates were then dried at 100 C at ambient conditions.The reaction solution was prepared by dissolving 40 mL hydrocholoric acid (HCl 36, Chengdu Kelong, China) in 40 mL deionized water.After 30 min magnetic stirring, 1.33 mL of titanium butoxide (97, SigmaeAldrich) was added to the solution based on a method published previously 22.The mixed solution was stirred at ambient conditions until it became transparent.Total reaction solution was taken into a Teflon-lined stainless steel autoclave (100 mL).The FTO substrates were placed at an angle against the wall of the Teflonliner with the conducting side facing down.The hydrothermal synthesis was conducted at 150 C for 6 h in a vacuum drying oven.The FTO substrates were taken out and rinsed extensively with deionized water, and they were allowed to dry in ambient air and followed by annealing in air at 550 C for an additional 3 h with a heating rate of 10 C/min.Thus, the TiO 2 nanorod thin films were prepared. Ultrasonic-assisted sequential cation adsorption method was used for modifying the TiO 2 nanorod thin films 14.Five different concentrations (such as 0.01 M, 0.02 M, 0.03 M, 0.04 M, 0.05 M) of aqueous Cu(NO 3 ) 2 3H 2 O (Chengdu Kelong, China) solutions were prepared.TiO 2 nanorod thin films were immersed into these solutions for 2 min under ultrasonic concussion, and 2 min in deionised water without ultrasonic concussion.This cycle was repeated 10 times for each sample.After drying at 100 C, the samples were calcined at 400 C in the pipe furnace for 1 h with a heating rate of 10 C/min.The TiO 2 nanorod thin films were named as 0.01 M Cu 2 eTiO 2 , 0.02 M Cu 2 eTiO 2 , 0.03 M Cu 2 eTiO 2 , 0.04 M Cu 2 eTiO 2 and 0.05 M Cu 2 eTiO 2 according to the Cu 2 concentration of the modification solution. The OPMR was fabricated by replica molding method and standard photolithography process 28.The detailed preparation methods of chamber template are as follows.Firstly, the cover plate with branch shaped microchannels was fabricated on silicon wafer (76 mm A 76 mm).Photoresist (SU-8, Microchem Corp.) was spin-coated on the silicon wafer in the coater 7.Before transferring to the photoetching machine, the silicon wafer with photoresist was baked on the heating plate.Then the prepared silicon which was covered with a printed mask was exposed to the UV light followed by a soft-bake process 7.Finally, the silicon wafer was placed in a beaker which was full of developer solvent, and the unexposed photoresist was cleaned out.After post-baking, the terminal silicon substrate with SU-8 of chamber template (26 mm A 30 mm A 0.15 mm) was accomplished.The application of Polydimethylsiloxane (PDMS) used as the cover plate material of the OPMR was described in this paper.Because it has the characteristics of chemical inertness, optical transparence and rapid fabrication which meet all the characteristics to fabricate OPMR. The assembly of the reactor included the following steps.At the first step, polymer base (Sylgard 184 A, Dow Coming) and curingagent (Sylgard 184 B, Dow Coming) were mixed and degassed at a ratio of 10:1.Then the mixture was cast onto the patterned wafer and rectangular mold (3.0 cm A 2.5 cm A 1.1 cm) and all baked at 95 C for 30 min.After that, the PDMS was released from the patterned wafer and rectangular mold.Next, the prepared TiO 2 nanorod thin film was placed on the glass substrate and surrounded by the rectangular PDMS mold.At the last step, the PDMS chamber template was covered on the rectangular PDMS mold.In the center of this chamber, the reaction microchamber volume was totally 117 mL.Fig. 1a shows the design of the OPMR. The connections of FTO to glass substrate and syringe needles to the PDMS plates were enhanced by using UV light adhesive curing under 365 nm UV irradiation to avoid leakage.At both the inlet and outlet, four-branch shaped microchannels were adopted to ensure a uniform filling over the entire microreactor.The image of the fabricated OPMR is given in Fig. 1b. The schematic diagram of the photocatalytic reduction process of CO 2 and water vapor in the OPMR is shown in Fig. 2. The photocatalytic activity was evaluated under UV-light irradiation of a UV-LED with the wavelength of 365 nm (Shanghai Maixin, China).The UV light intensity was controlled by adjusting the distance between the light source and catalyst surface, and the UV light intensity was measured by a UV radiometer (UV-A, Photoelectric Instrument Factory of Beijing Normal University, China).The whole reaction equipment was wrapped by screen paper to prevent the interference of the outside light.Compressed CO 2 (99.999) which was controlled by a mass flow controller (Omega, America) was passed through a boiling flask-3-neck to generate the mixture of CO 2 and water vapor.The ratio of H 2 O/CO 2 was adjusted by controlling the temperature in the boiling flask-3neck which was equipped with armored thermocouple A. The temperature of the gaseous mixture in the boiling flask-3-neck was controlled by the oilbath device, and the temperature was kept at 60 C in this paper, hence the ratio of H 2 O/CO 2 was kept at 1:10.The gaseous mixture was then introduced to the OPMR and operated in a continuous-flow mold.Thereinto, the flow rate of the gaseous mixture was achieved by controlling the flow of CO 2 .The gaseous mixture was flowed through the OPMR for at least 1 h before illumination to ensure that there was only water vapor and CO 2 in the OPMR.The function of the heating tape was to ensure that water vapor did not appear condensation in the process from the boiling flask-3neck to OPMR as shown in Fig. 2. The temperature in the OPMR was controlled by the constant temperature heating system.Each experiment was carried out for 6 h.The collection vessel was equipped with 1 mL deionized water, which acted as solvent to collect the products from the OPMR.Then the methanol concentration and ethanol concentration at the collection vessel were measured by gas chromatograph (GC-2010 Plus, Shimadzu, Japan).The gas chromatograph was equipped with a SH-Rtx-Wax, 30 m length, 0.25 mm inside diameter and a 0.25 mm film capillary column.All experiments were repeated three times."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The crystalline phase of TiO 2 nanorod samples were characterized by X-ray diffraction (XRD) using Ultima IV diffractometer (Glancing incidence) with CuKa radiation operated at 40 kV, 190 mA.Samples were scanned from 20 to 80 at a rate of 2 /min (in 2q).As shown in Fig. 3, the XRD patterns of unmodified TiO 2 nanorod sample and modified TiO 2 nanorod samples with different initial concentrations of Cu 2 aqueous No diffraction peaks of Cu 2 elements were detected because of low concentration in the photocatalysts, and it also indicates that small Cu 2 clusters were highly dispersed on the surface of TiO 2 nanorods. Scanning electron microscope (SEM) analysis was conducted on a JSM-7800F electron microscope (JEOL, Japan) equipped for energy dispersive spectroscopy (EDS) measurement.As shown in Fig. 4a andb, uniform nanorods at two different magnifications were found to be grown on the FTO substrates.The cross section shape of TiO 2 nanorods was about rectangle.The nanorods were 4.0 mm in length and 120 nm in side length on average.However, the deposition of Cu 2 did not affect the crystalline structure of TiO 2 nanorods.EDS analysis showed that the deposition of Cu 2 in the samples were 1.2wt.,1.5wt.,1.8wt.,2.0wt. and 2.2 wt. with doped Cu 2 concentration of 0.01 M, 0.02 M, 0.03 M, 0.04 M and 0.05 M, respectively.The EDS results are in agreement with XRD results that the diffraction peaks of Cu 2 element did not appear when the amount of Cu 2 loading was less than 3 wt.25,29,30. To further characterize the microstructure of the obtained TiO 2 nanorods with different growth conditions, transmission electron microscope (TEM) and high resolution electron microscope (HR-TEM) analyses which were conducted on a JEM 1200EX electron microscope (JEOL, Japan) are shown in Fig. 5.The average side length of a single TiO 2 nanorod which is shown in Fig. 5a andb was about 120 nm.It agrees with the observed view by SEM in Fig. 4b.And each nanorod consisted of a bundle of smaller nanorods which was marked by the red box in Fig. 5a.The High-resolution TEM (HR-TEM) image of a single small nanorod is clearly shown in Fig. 5c.The lattice fringers with a spacing of 0.29 nm and 0.32 nm were found, which are in agreement with the spacing of 001 plane and 110 plane of the rutile phase 19,22, respectively.TEM images of 0.02 M Cu 2 eTiO 2 nanorods are clearly observed in Fig. 5d ande.Cu 2 modified TiO 2 nanorods were in the form of clusters that were mainly covered the surface of the nanorods.However, the Cu 2 clusters did not affect the shape of nanorods which are consistent with the SEM results as shown in The optical properties of all the TiO 2 nanorod thin films were measured by using UVevis diffuse reflectance spectroscopy (Shimadzu, UV-2100, UVeVis spectrophotometer) with BaSO 4 as the reference standard.As depicted in Fig. 6, the UVevis spectra of the pure TiO 2 nanorod thin film showed the lowest absorption among the thin films, The absorption spectrum of pure TiO 2 nanorod thin film appeared around 411 nm, which had red shift compared with intrinsic anatase TiO 2 (387 nm).Moreover, visible light absorption has increased with the increase of concentration of Cu(NO 3 ) 2 3H 2 O solution. Red shift observed for the increasing amount of Cu 2 of the thin film samples shows that the band gap energy of the samples is decreased gradually.The direct band gap energy of the samples is calculated by using equation shown in Eq. ( 1) 33. where a, h, n, hv, Eg and A are the absorption coefficient, Planck's constant, frequency of vibration, photon energy, band gap energy and a proporyional constant, respectively.The absorbance or KubelkaeMunk function of the reflectance f(R) is proportional to the absorption coefficient a 34,35.The coefficient 'n' characterizes the electronic transition during absorption process.The 'n' value is determined by the type of optical transition of a semiconductor especially having values 1/2, 3/2, 2, and 3 for direct allowed, direct forbidden, indirect allowed and indirect forbidden transitions, respectively 36.In this experiment, n 14 1/2 namely the direct allowed transition was used for the samples 37.The Eg values for all samples were calculated from a plot of (f(R)hv) 1/2 versus hv using direct method as shown in Fig. 7.The Eg estimated from the intercept of the tangents to the plots were 3.01ev, 2.99ev, 2.97ev, 2.95ev, 2.85ev and 2.75ev for TiO 2 , 0.01 M Cu 2 eTiO 2 , As we can see from the above description, the TiO 2 nanorods were orderly arranged on the FTO surface, and each nanorod was composed of a lot of nano clusters.When the TiO 2 nanorods were doped by Cu 2 , Cu 2 clusters were uniformly covered on the surface of the nanorods.The band gap energy of the TiO 2 nanorods decreased with the increase of the concentration of doped Cu 2 .It means that the absorption spectra of the doped TiO 2 nanorods were extended to the visible light. Before the photocatalytic reduction of CO 2 experiments, a series of blank tests were carried out in the absence of catalyst and the gaseous mixture under UV irradiation for 6 h at 60 C in the following experiments: (1) without catalyst, (2) with water vapor and helium, (3) only CO 2 .In these circumstances, methanol and ethanol were not detected.In addition, blank tests were also conducted using CO 2 and water vapors and without illumination.No organic compounds were found.These results confirmed that catalyst, feed (CO 2 and water vapor) and light source were essential in the photocatalytic reduction experiment. This part mainly studied the photocatalytic mechanism and the performance of TiO 2 nanorod thin films with different doped concentration of Cu 2 .The main reaction products of our experiments were methanol and ethanol.The possible reaction mechanism of photocatalytic reduction of CO 2 with water vapor on the catalysts can be proposed in the following ways (Eqs.(2e10)). In the complex process of photocatalytic reduction of CO 2 , electronehole pairs are generated firstly under illumination when the absorbed light energy is greater than or equal to the band gap energy of the semiconductor.The electronehole pairs then are transferred to the surface of the reactant to carry out the redox reaction.Subsequently the electrons (e A ) are transferred from the TiO 2 conduction band for reacting with CO 2 to form,CO A 2 .Meanwhile, holes (h ) react with absorbed H 2 O molecules on the surface of catalysts to form hydroxyal radicals ( OH) and hydrogen ions (H ) and further oxidize with the excited electrons led to,H radicals 36.It has been found that CO A 2 is metastable and could change the electron affinity of CO 2 38.In this case, the CO A 2 anion radicals are further formed in water with high dielectric constant and can be greatly stabilized by the solvent that results in weakening the interaction of the radical with the catalyst surface 39.Then the CO A 2 radicals react with,H radicals to generate CO.At the same time, carbon radicals C come into being by consecutive reactions, and then,CH 3 radicals are formed.The CH 3 radicals react with OH to produce methanol, and CO A 2 radicals are further oxidized to ethanol under the action of holes (h ). Fig. 8 shows the methanol and ethanol yields of photocatalytic reduction of CO 2 with different amounts of doped Cu 2 in TiO 2 nanorod thin films.The average methanol and ethanol yields were 6.69 mmol/g-cat h and 6.31 mmol/g-cat h respectively without doped Cu 2 .The methanol and ethanol yields increased with Cu 2 loading, but then decreased when the Cu 2 concentration exceeded 0.02 M, namely Cu 2 loading exceeded 1.5 wt..Meanwhile, the average yields of methanol and ethanol reached the highest values of 24.42 mmol/g-cat h and 47.25 mmol/g-cat h at the flow rate of 2 mL/min when the doping concentration of Cu 2 was 0.02 M. On the one hand, doped Cu 2 can effectively increase spectral response of TiO 2 nanorods by narrowing electronic properties and increasing the amount of active sites.The addition of CuO whose band gap is about 1.4 eV has changed the whole catalytic mechanism.The CuO is more easily excited under visible irradiation, and the conduction band of CuO which is located at c.a. A1.03 eV versus NHE is more cathodic than the conduction band of TiO 2 (A0.5 eV) 40.Therefore, the electrons generated on the CuO conduction band can injected into the inactivated TiO 2 easily.On the other hand, Cu 2 which acts as free ions can also serve as electron traps to reduce the recombination rate of electronehole pairs during photo excitation of photocatalyst 7.Surface hydroxyls (,OH) of TiO 2 can also promote the adsorption of the reactant as shown in the Formula (5), so that the photo reaction is further enhanced.However, excess Cu 2 clusters covered the surface of TiO 2 resulting in less light that reached to catalyst, and it blocked the sensitization of TiO 2 nanorods.So there exists an optimum amount of Cu 2 loading around 1.5 wt. under the experimental conditions of this work. The flow rate can influence the transmission process of reactive material, and further affect the reaction efficiency.So this part mainly studied the effect of different flow rates on the photocatalytic reduction of CO 2 .The flow rate of CO 2 ranged from 1 mL/min to 5 mL/min, and the 0.02 M Cu 2 eTiO 2 nanorod thin films were used as the research objects in this part experiments.As shown in Fig. 9, both methanol and ethanol yields were increased first and then decreased with the increase of the flow rate of CO 2 , and the optimal yield was appeared at 2 mL/min.On one hand, it is easy to understand that the driving force of reactants which makes the gaseous mixture diffuse to reaction interface is small at a relative low flow rate.So the reactants diffusion process consume much more time which led to reduce the update speed of the gaseous mixture on the surface of catalyst layer.Therefore, the reaction rate is relatively slow at a lower flow rate of CO 2 .On the other hand, the residence time of reactants in the reactor is short at relatively higher flow rate.The reactants are driven out of the reactor chamber before they diffuse to the surface of catalyst layer.Therefore, the reactants on the surface of catalyst layer can not be updated duly.Similarly, it is not conducive to the catalytic reaction when flow rate is too high.Consequently, the average yields of methanol and ethanol reached the highest values of 24.42 mmol/g-cat h and 47.25 mmol/g-cat h at the flow rate of 2 mL/min in our work.In summary, too slow or too fast flow velocity of the gaseous mixture is not favorable for the increase of product yield.There exists an optimal flow rate of reactants for the photocatalytic reduction process of CO 2 . Effect of different reaction temperatures on the photocatalytic conversion process of CO 2 Fig. 10 shows the relationships between the methanol and ethanol yields under different reaction temperatures.It is obvious that the average methanol and ethanol yields were enhanced basically as the increase of the reaction temperature.Higher temperature gives positive effects on photocatalytic reactions for following reasons. Firstly, Photocatalytic reduction of CO 2 and water vapor is an endothermic process 13, higher temperature can accelerate the reaction rate naturally.Secondly, the increase of temperature is beneficial to the desorption process of products from the catalyst surface.Thirdly, the photocatalytic reduction of CO 2 and water vapor occurs on the surface of the catalyst layer, reaction rates are usually determined by the value of reactant concentration on the catalyst surface.Increasing the temperature celebrates the diffusion velocity of CO 2 to the surface of the catalyst layer, and it increases the number of catalytic sites which results in higher reaction rates.Finally, the increase of temperature can decrease the activation energy of the photocatalyst so as to enormously promote the reaction rate 36.As shown in Fig. 10, the average methanol and ethanol yields reached 36.18 mmol/g-cat h and 79.13 mmol/ g-cat h under the reaction temperature of 80 C respectively. In order to further clarify the excellent characteristics of 1D nanostructure with doped Cu 2 in the photocatalytic reduction of CO 2, we also compared our experimental results with the previous experimental results 16,25e27,41e46.As shown in Table 1, the catalytic performances of the doped catalysts are obviously improved compared with the undoped catalysts.At the same time, the doped catalysts were beneficial to the production of the multi carbon compounds.In comparison, our results are much better in both liquid phase or gas phase reactions.In addition to the doping effect of Cu 2 , the application of the 1D TiO 2 nanorod thin films which increased the catalytic areas and catalytic active sites promoted the catalytic efficiency.Moreover, the TiO 2 nanorod thin film in the microreactor fabricated in this work is a continuous catalytic reaction process, which can be widely used in industrial production in the future."
  },
  {
    "title": "Conclusions",
    "content": "In this study, the 1D TiO 2 nanostructure array thin films with doped Cu 2 in OPMR were used for photocatalytic reduction of CO 2 with water vapor.The photocatalytic activities of TiO 2 nanorod thin films photocatalyst were evaluated by the reduction yield in the presence of CO 2 and water vapor under UV irradiation.Methanol and ethanol were found to be the major products.The maximum methanol and ethanol yields were 36.18mmol/g-cat h and 79.13 mmol/g-cat h at a flow rate of 2 mL/min which was under the reaction temperature of 80 C and under the light intensity of 15 mW/cm 2 by using the 0.02 M Cu 2 eTiO 2 nanorod thin films.Effects of different Cu 2 doping concentrations, CO 2 flow rates and reaction temperatures were investigated.The optimal Cu 2 loading on the TiO 2 nanorods was found to be 1.5 wt. in our experiments.It was conceived that Cu 2 ions were served as active sites of electron traps and could suppress the electronehole recombination.At the same time, the band gap energy of the TiO 2 nanorods decreased with the increase of the concentration of doped Cu 2 .The absorption spectra of the doped TiO 2 nanorods were extended to the visible light.The reaction could not only promote the diffusion of reactants to the catalyst surface, but also promote the desorption of the reaction products at the optimal flow rate.And the increasing of temperature could promote the adsorption of CO 2 and accelerate photogenerated species.Experiments results showed that the yields of Table 1 e Comparison of the methanol and ethanol yields with existing works.methanol and ethanol in this study were much higher than the previous studies.The reason of this significantly enhanced CO 2 photoreduction rates was due to the synergistic combination of Cu 2 deposition, high surface area of TiO 2 nanorods and enhanced mass transfer of OPMR.Combination of 1D TiO 2 nanostructure array thin films and OPMR is found to be feasible, industrial scale-up and attractive for use in further investigation of CO 2 photoreduction for solving environmental problems. Fig. 1 e (a) Design and (b) Image of the optofluidic planar microreactor. i n t e r n a t i o n a l j o u r n a l o f h y d r o g e n e n e r g y x x x ( 2 0 1 7 ) 1 e1 1 solutions are listed successively.All the samples showed one main peak at 36.2 which corresponded to the crystal plane of 101 of rutile phase structure (JCPDS No: 34-0180).The result indicates that the ultrasonic-assisted sequential cation adsorption method did not affect the phase of TiO 2 nanorods. Fig. 3 e XRD pattern of Cu 2 modified TiO 2 nanorod thin film samples. Fig. 4d.The High-resolution TEM (HR-TEM) image of the 0.02 M Cu 2 eTiO 2 nanorod is clearly shown in Fig. 5f.The d spacing was measured to be 0.25 nm which correspond to 002 plane of the monoclinic CuO31,32.The optical properties of all the TiO 2 nanorod thin films were measured by using UVevis diffuse reflectance spectroscopy (Shimadzu, UV-2100, UVeVis spectrophotometer) with BaSO 4 as the reference standard.As depicted in Fig.6, the UVevis spectra of the pure TiO 2 nanorod thin film showed the lowest absorption among the thin films, The absorption spectrum of pure TiO 2 nanorod thin film appeared around 411 nm, which had red shift compared with intrinsic anatase TiO 2 (387 nm).Moreover, visible light absorption has increased with the increase of concentration of Cu(NO 3 ) 2 3H 2 O solution.Red shift observed for the increasing amount of Cu 2 of the thin film samples shows that the band gap energy of the samples is decreased gradually.The direct band gap energy of the samples is calculated by using equation shown in Eq. (1)33. Fig. 5 e TEM images of a single TiO 2 nanorod (a, b) and 0.02 M Cu 2 eTiO 2 nanorods (d, e), HR-TEM images of small TiO 2 nanorods (c) and 0.02 M Cu 2 eTiO 2 nanorods (f). Fig.6e UVevis absorption spectra of the photocatalyst film samples. Fig. 7 e Band gap energy calculation graphs of the photocatalyst film samples. Fig. 9 e Effect of the CO 2 flow rate on the methanol and ethanol yields.0.02 M Cu 2 eTiO 2 nanorod thin films, reaction temperature: 60 C. Fig. 10 e Methanol and ethanol yields of the photocatalytic reduction of CO 2 of 0.02 M Cu 2 eTiO 2 nanorod thin films at different reaction temperatures.Flow rate: 2 mL/min. Fig. 8 e Effect of doped Cu 2 concentration in Cu 2 eTiO 2 catalysts for photocatalytic reduction of CO 2 .CO 2 flow rate: 2 mL/min, reaction temperature: 60 C. lamp (254 nm) e r n a t i o n a l j o u r n a l o f h y d r o g e n e n e r g y x x x ( 2 0 1 7 ) 1 e1 1 i n t e r n a t i o n a l j o u r n a l o f h y d r o g e n e n e r g y x x x ( 2 0 1 7 ) 1 e1 1 Please cite this article in press as: Cheng M, et al., Copper-decorated TiO 2 nanorod thin films in optofluidic planar reactors for efficient photocatalytic reduction of CO 2 , International Journal of Hydrogen Energy (2017), http://dx.doi.org/10.1016/j.ijhydene.2017.01.126 The authors gratefully acknowledge the financial support of the National Science Foundation for Young Scientists of China (No. 51606019), the National Natural Science Funds for Distinguished Young Scholar (No. 51325602), and the National Natural Science Foundation of China (No. 51576021).r e f e r e n c e s"
  }
]