[
  {
    "title": "Doi",
    "content": "10.1039/c3ta14493c"
  },
  {
    "title": "Article_Title",
    "content": "A noble metal-free reduced graphene oxide–CdS nanorod composite for the enhanced visible-light photocatalytic reduction of CO2 to solar fuel"
  },
  {
    "title": "Abstract",
    "content": "Solar-fuel production has attracted considerable attention because of the current demand to find alternative transportation fuels with particular emphasis on those fuels obtained photocatalytically from water and CO 2 .In this work, reduced graphene oxide (RGO)-CdS nanorod composites were successfully prepared by a one-step microwave-hydrothermal method in an ethanolamine-water solution.These composite samples exhibited a high activity for the photocatalytic reduction of CO 2 to CH 4 , even without a noble metal Pt co-catalyst.The optimized RGO-CdS nanorod composite photocatalyst exhibited a high CH 4 -production rate of 2.51 mmol h A1 g A1 at an RGO content of 0.5 wt.This rate exceeded that observed for the pure CdS nanorods by more than 10 times and was better than that observed for an optimized Pt-CdS nanorod composite photocatalyst under the same reaction conditions.This high photocatalytic activity was ascribed to the deposition of CdS nanorods onto the RGO sheets, which act as an electron acceptor and transporter, thus efficiently separating the photogenerated charge carriers.Furthermore, the introduction of RGO can enhance the adsorption and activation of CO 2 molecules, which speeds up the photocatalytic reduction of CO 2 to CH 4 .The proposed mechanism for the observed photocatalytic reaction with the RGO-CdS nanorod composite was further confirmed using transient photocurrent response and electrochemical impedance spectra.This work not only demonstrates a facile microwave-assisted hydrothermal method for fabricating highly active RGO-CdS nanorod composite photocatalysts, but also demonstrates the possibility of utilizing of an inexpensive carbon material as a substitute for noble metals in the photocatalytic reduction of CO 2 ."
  },
  {
    "title": "Experimental",
    "content": "The RGO-CdS nanorod composites were prepared using a microwave-assisted hydrothermal method.All reagents were analytical grade and used without further purication.Deionized (DI) water was used in all experiments.Graphene oxide (GO) was prepared from natural graphite powder (99.8,Alfa Aesar) by a modied version of Hummers' method, 38 and all other reagents were obtained from Sinopharm Chemical Reagent Co., Ltd.(Shanghai, China).In a typical synthesis, a suspension of GO in water (0.5 mg mL A1 ) was obtained aer sonication for 12 h.A specic amount of the prepared GO suspension, 0.27 g of Cd(Ac) 2 2H 2 O and 0.24 g of L-cysteine were dissolved in 30 mL of ethanolamine-water solution (volume ratio 14 1 : 1) under magnetic stirring for 1 h.The solution was then transferred into a Teon-lined autoclave, which was placed in a microwave-hydrothermal synthesis system (MDS-6, Sineo, Shanghai, China) and kept at 180 C for 1 h.Aer the reaction, the autoclave was cooled to room temperature, and the resulting precipitate was collected by centrifugation, alternately rinsed several times with distilled water and ethanol.The nal product was dried in a vacuum oven at 80 C over 12 h.In order to investigate the effect of the RGO content on the photocatalytic reduction rates of CO 2 on the RGO-CdS composites, the weight percentage of RGO was varied from 0 to 2 (0, 0.1, 0.25, 0.5, 1.0, 2.0 wt) (see Table 1).The samples are labeled as Gx, where x 14 0, 0.1, 0.25, 0.5, 1.0 and 2.0.For the purpose of comparison, a 0.5 wt RGO-CdS nanoparticle composite (N0.5) was prepared by the same method using CdS nanoparticles obtained in pure water without ethanolamine.A Pt-CdS nanorod composite (with an optimized Pt content of 0.5 wt) was also prepared by photochemical reduction deposition of Pt onto the surface of a sample of G0.The resulting sample is denoted as P0.5. X-ray diffraction (XRD) patterns were obtained using a D/Max-RB X-ray diffractometer (Rigaku, Japan) with Cu Ka irradiation at a scan rate of 0.05 2q s A1 .Transmission electron microscopy (TEM) and high-resolution transmission electron microscopy (HRTEM) analyses were conducted with a JEM-2100F electron microscope (JEOL, Japan) using a 200 kV accelerating voltage.The Brunauer-Emmett-Teller (BET) surface area (S BET ) of the samples was measured by nitrogen adsorption using a Micromeritics ASAP 2020 nitrogen adsorption apparatus (USA).All of the powdered samples were degassed under vacuum at 150 C prior to the nitrogen adsorption measurements.The BET surface area was calculated with a multipoint BET method using adsorption data in the relative pressure (P/P 0 ) range of 0.05-0.3.The desorption branch of each adsorption-desorption isotherm was used to determine the pore size distribution via a Barret-Joyner-Halender (BJH) method, assuming a cylindrical pore model.The volume of adsorbed nitrogen at the relative pressure (P/P 0 ) of 0.99 was used to determine the pore volume and the average pore size.CO 2 adsorption was measured using a Micromeritics ASAP 3020 carbon dioxide adsorption apparatus (USA).UV-vis diffuse reectance spectra of the samples were obtained on a UV-vis spectrophotometer (UV-2550, Shimadzu, Japan).A ne BaSO 4 powder was used as a reectance standard in a UV-vis diffuse reectance experiments.Raman spectra were recorded at room temperature using a micro-Raman spectrometer (Renishaw InVia) in a backscattering conguration with a 633 nm Ar laser as an excitation source.X-ray photoelectron spectroscopy (XPS) measurements were carried out using a VG ESCALAB210 XPS system with a Mg Ka source and a charge neutralizer.All of the binding energies were referenced to the C1s peak at 285.0 eV of the surface adventitious carbon. The photocatalytic reduction of CO 2 was performed in a 200 mL home-made Pyrex reactor at ambient temperature and atmospheric pressure.The reactor was sealed with a silicone rubber septum.A 300 W Xe arc lamp with a UV-cutoff lter (l 420 nm) was used as a light source and positioned 10 cm above the photocatalytic reactor.The focused intensity on the ask, measured using a visible-light radiometer (Model: FZ-A, China), was ca. 150 mW cm A2 .In a typical photocatalytic experiment, 100 mg of catalyst was added into the distilled water (10 mL) in the glass reactor.The mixed solution was sonicated for 30 min in order to form a suspension, and then dried at 80 C over 2 h.The catalyst was deposited onto the bottom of the reactor in the form of a thin lm.Before irradiation, the reactor was sealed and degassed with nitrogen for 30 min in order to remove air and ensure that the reaction system was under anaerobic conditions.CO 2 and H 2 O vapor were produced from the reaction of NaHCO 3 (0.12 g, introduced into the reactor before being sealed) and an aqueous HCl solution (0.25 mL, 4 M), which was introduced into the reactor via a syringe.During irradiation, 1 mL of gas was taken from the reactor at regular intervals (1 h) for subsequent gas concentration analysis using a gas chromatograph (GC-2014C, Shimadzu) equipped with a ame ionized detector (FID) and methanizer.Product gases were calibrated with a standard gas mixture and their identity determined using the retention time.The apparent quantum efficiency (QE) of CH 4 production was tested under similar photocatalytic reaction conditions.Four low-power 420 nm-LEDs (3 W) (Shenzhen LAMPLIC Science Co., Ltd.China) positioned 4 cm above the reactor were used as a light source to trigger the photocatalytic reaction.The light intensity and focused areas in the reactor for each 420 nm-LED were ca.6.0 mW cm A2 and 1 cm 2 , respectively.The QE values were calculated according to eqn (1): The photocurrent and electrochemical impedance were measured using an electrochemical analyzer (CHI660C Instruments) in a standard three-electrode system with the asprepared samples as the working electrodes having an active area of ca.0.5 cm 2 , a platinum wire as the counter electrode, and Ag/AgCl (saturated KCl) as a reference electrode.A low power LED (3 W, 420 nm) (Shenzhen LAMPLIC Science Co., Ltd., China) was utilized as the visible-light source.The focused intensity was ca.6.0 mW cm A2 .A 0.4 M Na 2 SO 4 aqueous solution was used as the electrolyte.For the preparation of the working electrodes, 0.2 g of photocatalyst (the G0 and G0.5 samples) was ground with 0.06 g polyethylene glycol (PEG, molecular weight 20 000) and 1.0 mL water to make a slurry.Aerward, the slurry was coated onto a 2 cm A 1.2 cm F-doped SnO 2 -coated glass (FTO glass) electrode by the doctor blade method.Upon drying in an oven, the electrodes were calcined at 450 C for 30 min under a N 2 atmosphere.All of the electrodes used had a similar thickness (15 mm)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "A series of RGO-CdS composite samples denoted as Gx, where x stands for the weight percentage of RGO, was studied by powder XRD in order to identify their phase structures.Fig. 1 shows the XRD patterns of the Gx samples (x 14 0, 0.1, 0.25, 0.5, 1.0, and 2.0).As can be seen in this gure, all of the diffraction peaks match well to the pure hexagonal phase of CdS with lattice parameters of a 14 4.1 A and c 14 6.7 A (JCPDS no.41-1049).No diffraction peaks for carbon species were observed due to the low content and relatively low diffraction intensity of RGO. 38urther observation indicates that the intensity of the XRD peaks is correspondingly enhanced with the increasing content of RGO.This can be ascribed to the fact that the layered structure of RGO provides an ideal platform for the nucleation and growth of CdS, and thus RGO can improve the crystallization of the CdS nanorods. 13he morphology and microstructure of the RGO-CdS nanorod composites and GO were investigated using TEM.Fig. 2a shows a TEM image of GO.As can be seen in this gure, GO has a two-dimensional structure consisting of sheets with micrometer long wrinkles.Fig. 2b shows a TEM image of the pure CdS nanorods (the G0 sample).The length and diameter of the nanorods are ca.50-100 nm and 15-30 nm, respectively.A TEM image of the G0.5 sample (Fig. 2c) shows that CdS nanorods are well dispersed on the surface of the RGO sheets.Moreover, the presence of RGO in the composite indicates no obvious inuence on the morphology of the CdS nanorods. 31A HRTEM image of the G0.5 sample (Fig. 2d) further demonstrate the intimate contact between the CdS nanorods and RGO.This contact facilitates electron transfer from the CdS nanorods to the RGO sheets during the photoexcitation process.The HRTEM image (Fig. 2d) also reveals that the lattice fringes are perpendicular to the nanorod growth direction.The lattice spacing was measured to be 0.336 nm, which agrees well with the distance between the (002) lattice planes of hexagonal CdS, indicating that the CdS nanorods grow along the c-axis 001 direction.The corresponding fast Fourier transform spectrum (inset in Fig. 2d) of the CdS nanorod matrix demonstrates that the nanorod matrix is a single crystal. The BET surface area and pore structure of the RGO-CdS nanorod composites and pure CdS nanorod sample were investigated using nitrogen adsorption-desorption measurements (see Table 1).Fig. 3 shows the nitrogen adsorption-desorption isotherms and the corresponding pore size distribution curves (inset in Fig. 3) for the G0 and G0.5 samples.The nitrogen adsorption-desorption isotherms for the aforementioned two samples are type IV (Brunauer-Deming-Deming-Teller (BDDT) classication), 39 indicating the presence of mesopores.These isotherms exhibit H3 hysteresis loops reecting mesopores formed due to the aggregation of the nanorods. 14,39,40The above results are consistent with the TEM analysis (Fig. 2).The isotherms for the two samples above show high adsorption at relative pressures (P/P 0 ) approaching 1.0, suggesting the formation of large mesopores and macropores.The pore size distributions (inset in Fig. 3) indicate that the G0 and G0.5 samples exhibit wide pore size distributions from 2 to over 100 nm, further conrming the existence of mesopores and macropores.Such organized porous structures might be extremely useful in photocatalysis because they provide efficient transport pathways for reactant and product molecules. 24Table 1 shows that all of the RGO-CdS nanorod composite samples have larger specic surface areas than that of the pure CdS nanorod sample.This is due to the presence of RGO in the composites; note that RGO alone can possess a high surface area (theoretical value of 2600 m 2 g A1 ).It is reasonable to deduce that the BET surface area increases with increasing content of RGO. 21,25A photocatalyst with a larger specic surface area can accommodate more surface active sites and facilitate the transport of charge carriers, which is benecial for enhancing the photocatalytic performance. 133 UV-vis diffuse reectance spectra UV-vis diffuse reectance spectra of the CdS nanorod and RGO-CdS nanorod composite samples are shown in Fig. 4. For these samples, a signicant increase in the absorption at wavelengths around 520 nm can be attributed to the intrinsic band gap absorption of CdS (2.4 eV).Compared to the pure CdS nanorod sample, the absorption spectra of the RGO-CdS nanorod composite samples show an enhanced absorption in the visiblelight region ranging from 400 to 800 nm, which is in accordance with the color change of the samples from yellow to dark green, as shown in the insets of Fig. 4.These results show that the introduction of RGO extends the broad background absorption into the visible-light region and enhances the utilization of solar energy.13,20,21,25,30 Therefore, it can be inferred that the RGO-CdS nanorod composites might exhibit higher photocatalytic activity than pure CdS nanorods under visible-light irradiation.It should be noted that an enhanced visible light absorption (520 nm) can not directly induce CH 4 -producing reactions, but the photons accumulated on graphene may induce a local heating effect to form a heat eld around CdS. Thus, the formation and transfer efficiency of photogenerated charge carriers should be enhanced to a certain extent.This would result in an enhancement of photocatalytic activity. Raman spectroscopy is a powerful tool that can be used to characterize the crystallinity of carbon materials.In this work, it was utilized to monitor the structural changes that occurred during the microwave-assisted hydrothermal transformation of GO to RGO.Fig. 5 shows a comparison of the Raman spectra of GO and a RGO-CdS nanorod composite (the G0.5 sample).The Raman spectrum of GO shows two typical bands at 1345 and 1591 cm A1 .The band at about 1345 cm A1 is commonly ascribed to disordered sp 2 carbon and has been named the D band.The other band at about 1591 cm A1 approaches that observed for well ordered graphite carbon and is denoted as the G band. 21,25,41,42 For the RGO-CdS nanorod composite, two characteristic peaks at around 1343 cm A1 (D band) and 1587 cm A1 (G band) are observed.Moreover, compared to GO, the D band is shied to 1343 cm A1 and the G band is shied to 1587 cm A1 , which indicates the reduction of GO.Furthermore, the RGO-CdS nanorod composite shows an increased D/G intensity ratio (1.2) compared to that (0.9) of pure GO, which indicates a decrease in the average size of the sp 2 domains of the exfoliated GO upon reduction, 21,25,41,42 and also conrms the existence of the RGO sheets in the RGO-CdS nanorod composite. To further conrm the reduction of GO during the microwaveassisted hydrothermal process, high-resolution XPS spectra of C1s were collected for the GO and G0.5 samples (Fig. 6).The XPS spectrum of C1s for GO (Fig. 6a) can be tted into four smaller peaks.The four typical peaks of GO are located at 284.8, 287.0, 287.8 and 289.1 eV, which can usually be assigned to the following functional groups: sp 2 bonded carbon (C-C), epoxy/ hydroxyl (C-O), carbonyl (CO), and carboxyl (O-CO). 13,31,41y contrast, the XPS spectrum of C1s from the G0.5 sample (Fig. 6b) shows that the peak relating to O-CO has almost disappeared, and the peaks of C-O and CO have much lower intensities than those observed in GO.This indicates that the percentage of oxygen-containing functional groups has signicantly decreased, and thus, the introduced GO has been efficiently reduced into RGO during the microwave-assisted hydrothermal process.This result is also in good agreement with the aforementioned Raman spectra analysis. The photocatalytic activity for the reduction of CO 2 of various samples was evaluated under visible-light irradiation (l 420 nm).During the photocatalytic reduction reactions, CO 2 was mainly reduced to methane (CH 4 ) in the presence of water vapor under visible-light irradiation.The generation of products over time is shown in Fig. 7.In this study, CH 4 was observed as the major product, with a small amount of CH 3 OH, while HCOOH and HCHO were not detected using the GC FID method. Control experiments indicated that no appreciable amount of hydrocarbon compound was detected in the absence of either photocatalyst or irradiation, suggesting that CH 4 was produced via a photocatalytic reaction on the photocatalyst.Fig. 8 shows a comparison of the visible-light photocatalytic CH 4 -production This journal is The Royal Society of Chemistry 2014 rates of the CdS nanorods, RGO-CdS nanorod composites, RGO-CdS nanoparticle composite, 0.5 wt Pt-CdS nanorod composite (P0.5) and pure RGO.As can be seen in this gure, the RGO content has a signicant inuence on the photocatalytic activity of the CdS nanorods.In the absence of RGO, the G0 sample exhibited a low photocatalytic CH 4 -production rate (0.21 mmol h A1 g A1 ) due to the rapid recombination of photogenerated electrons and holes in the pure CdS nanorods.The activity of the G0.1 sample was obviously enhanced by the presence of a small amount of RGO.The photocatalytic CH 4production rate of the RGO-CdS nanorod composites shows a tendency to increase with increasing RGO content, achieving a maximum of 2.51 mmol h A1 g A1 at an RGO content of 0.5 wt (which corresponds to an apparent quantum efficiency of about 0.8 at 420 nm).This value is over 10 times that obtained for the pure CdS nanorods (the G0 sample).When the RGO content is higher than 0.5 wt, a further increase in the content of RGO leads to a reduction in the photocatalytic CH 4 -production rate.In the case of G2.0, in particular, the activity of CH 4 -production exhibits a drastic decrease.This can probably be ascribed to a large percentage loading of black RGO that shields the CdS nanorods from absorbing visible light and the active sites on the photocatalyst surface, resulting in a drastic decrease in the number of photo-generated electrons on the CdS nanorods and photocatalytic reaction sites, respectively. 12,13,21,25Thus, a suitable content of RGO is crucial for optimizing the photocatalytic activity of RGO-CdS nanorod composites, which is a similar observation to previous studies on photocatalytic hydrogen production, reduction of organics or metal ions, and pollutant degradation. 12,13,20,2930031 In addition, Fig. 8 also indicates that no hydrocarbon compounds (CH 4 ) were detected when RGO alone was used as a photocatalyst, suggesting that bare RGO is not active for the conversion of CO 2 to CH 4 under the experimental conditions employed.Furthermore, Fig. 8 shows that the RGO-CdS nanoparticle composite exhibited a much lower photocatalytic CH 4 -production rate than the RGO-CdS nanorod composite, implying that the 1D morphology of the CdS in the composite is essential for enhancing its photocatalytic activity for CH 4 production. It is commonly accepted that noble metals, especially Pt, can function as efficient co-catalysts for photocatalytic hydrogen production and CO 2 reduction.For the comparison purposes, the photocatalytic CH 4 -production activity of the optimal 0.5 wt Pt-CdS nanorod composite (the P0.5 sample) was also tested and analyzed.As can be seen in Fig. 8, the P0.5 sample shows a relatively low activity (1.52 mmol h A1 g A1 ) compared to the RGO-CdS nanorod composite (the G0.5 sample), implying that RGO is a good co-catalyst for the photocatalytic reduction of CO 2 to CH 4 . The high CH 4 -production performance of the RGO-CdS nanorod composite samples under visible-light irradiation can be understood as illustrated in Fig. 9.Under visible-light irradiation, the valence band (VB) electrons (e A ) of the CdS nanorods are excited to the conduction band (CB), creating holes (h ) in the VB.In general, these charge carriers quickly recombine and only a very small fraction of the electrons and holes are involved in the photocatalytic reaction process. 13,40However, when the CdS nanorods are modied by RGO sheets, the photogenerated electrons in the CB of the CdS nanorods tend to transfer to the surface of RGO, leading to effective spatial separation of the electron-hole pairs. 12Numerous researchers have conrmed that the two-dimensional (2D) p-conjugated structure of RGO sheets can facilitate the transfer of photogenerated electrons and RGO performs as an excellent electron collector and transporter, prolonging the lifetime of the charge carriers and, thereby, improving charge separation and photocatalytic activity. 12,43,44urthermore, as can be seen in Table 1, the RGO-CdS nanorod composite samples exhibit higher CO 2 adsorption capacities (0.08 mmol g A1 for the G0.5 sample) than that (0.04 mmol g A1 ) of a pure CdS nanorod sample due to the existence of a small amount of RGO.In addition, the CO 2 adsorption capacity of the composite samples linearly increases with increasing RGO content.Though the specic surface areas also slightly increases with increasing RGO content, the increase rate for the specic surface area is much lower than that of the CO 2 adsorption capacity.This implies that the increased CO 2 adsorption capacity of the composite samples is not caused by the increase in the specic surface area, but by the presence of RGO, and that the extra CO 2 is mainly adsorbed onto the surface of the small amount of RGO. 454664748 Therefore, it is reasonable to assume that the 2D p-conjugated structure of the RGO sheets enhance the adsorption of CO 2 .This is not surprising because CO 2 molecules also contain delocalized p-conjugated binding II 3 , 4 and the p-p conjugation interaction between CO 2 and graphene results in the enhancement of CO 2 adsorption onto the RGO-CdS nanorod composite samples.Such an increased CO 2 concentration on the RGO surface is benecial for enhancing the photocatalytic reduction efficiency of CO 2 because the photocatalytic reduction of CO 2 mainly occurs on the RGO surface.Furthermore, the strong p-p conjugation interaction between CO 2 and graphene can result in the destabilization and activation of CO 2 molecules.CO 2 is a highly stable molecule and its activation is one of the most challenging issues in modern chemistry. 5n the basis of the above results and discussion, we proposed the enhancement mechanism of photocatalytic reduction activity of CO 2 to CH 4 shown in Fig. 9. CO 2 molecules are strongly adsorbed onto the RGO surface due to p-p conjugation interactions.The adsorbed CO 2 molecules become destabilized and their reactivity is believed to be higher than that of un-adsorbed CO 2 molecules or those adsorbed onto the CdS surface. 5Meanwhile, photogenerated electrons on the CdS nanorods can be easily transferred to the surface of RGO because of the lower Fermi energy level of RGO compared to CdS. 12 It is well known that the formation of CH 4 requires eight electrons.The enriched electron density on RGO would favor the reduction of CO 2 molecules and the formation of CH 4 .Fig. 8 clearly shows that a small amount of RGO can enhance the photocatalytic reduction of CO 2 to CH 4 .This is because RGO, not only enhances the number of destabilized CO 2 molecules, but also makes the surface more electron enriched, thus accelerating the reduction of CO 2 to CH 4 .Clearly, RGO plays a unique and key role in the photocatalytic reduction of CO 2 to CH 4 .Consequently, a high photocatalytic reduction activity is achieved using the RGO-CdS samples as a result of modication with RGO.The major reaction steps in this mechanism under visible-light irradiation are summarized in the following equations: Usually, proton reduction is highly competitive with CO 2 reduction.CO 2 to CH 4 is an 8-electron process while reduction of a proton to H 2 is a 2-electron process, thus the former should be much more difficult than the latter kinetically.However, in our experiment, no H 2 was detected by GC.The produced H 2 was probably used in a hydrogenation reaction with CO 2 . 49,50ther possible explanations are: (1) hydrogen production using a metal sulde usually requires the presence of noble metals (such as Pt, Au or Ag).The noble metal is catalytically active for hydrogen production and can reduce the overpotential in the production of H 2 .However, our experiment is a noble metal-free system.(2) Hydrogen production usually requires the addition of sacricial reagents and liquid phase conditions.However, our experiment did not involve sacricial reagents and the catalytic process occurred at a gas-solid interface. 50any previous investigations have widely agreed that CO is a important intermediate for the conversion of CO 2 to other C-based molecules. 4950051 In order to conrm the presence of CO in the photoreduction products, the products were further analyzed by a thermal conductivity detector (TCD) method using a gas chromatograph (GC-14C, Shimadzu, Japan, TCD, nitrogen as a carrier gas and 5 A molecular sieve column).A low concentration of CO was indeed produced and detected in our experiment.In addition, the CO concentration decreased with increasing RGO content in our reaction system, probably due to the preferential adsorption of CO onto the surface of RGO.Furthermore, the production of CH 4 is thermodynamically easier than the formation of CO because the reduction potential for CH 4 /CO 2 (A0.24V vs. NHE) is less negative than that for CO/CO 2 (A0.52 V vs. NHE). 49,52The selective formation of CH 4 rather than CO is obviously due to the combined effect of both the adsorption of CO onto RGO and the thermodynamics. In order to further understand the photocatalytic reduction mechanism of CO 2 to CH 4 and to exclude the possibility of contamination from other carbon sources (for example, contamination due to incomplete removal of the ethanolamine solvent during fabrication of the RGO-CdS nanorod composite samples or RGO itself) a control experiment was performed.The RGO-CdS composite samples and RGO by itself were illuminated without introducing CO 2 as the carbon source, where N 2 was used as the carrier gas.If there was any reactive residual carbon in the prepared samples, this would react with protons (H ) or H 2 generated from competitive water splitting and form CH 4 .However, neither CH 4 nor any other carbon compounds were detected, indicating that there was no residual carbon or other carbon contamination in our samples.This is in good agreement with other previously reported results. 49 In order to provide evidence for the photocatalytic reduction mechanism of CO 2 proposed above, transient photocurrent responses of pure CdS nanorod (the G0 sample) and RGO-CdS nanorod composite (the G0.5 sample) electrodes were recorded over several on-off irradiation cycles.Fig. 10 shows a comparison of the I-t curves for the two aforementioned samples over several on-off cycles of intermittent irradiation at a bias potential of 0.5 V.As can be seen in this gure, the photocurrent value of the G0 sample rapidly decreases to zero when the visible-light irradiation is turned off, and the photocurrent returns to a constant value when the light is turned on again, exhibiting good reproducibility.However, the photocurrent value of the G0.5 sample gradually increases to a constant value when the light is turned on, while the photocurrent value gradually decreases to zero when the light is off.This is because the CdS nanorods were modied with RGO sheets, so the photogenerated electrons in the conduction band of the CdS nanorods tend to be transferred to the RGO sheets. 25,29,42Therefore, the photocurrent is generated by stored electrons from the RGO sheets rather than electrons transferred from the conduction band of CdS directly, resulting in a gradual increase of the photocurrent.On the other hand, when the light is turned off, due to the electron storage capacity of RGO, electrons are gradually released from the RGO sheets and then transferred to the working electrode, leading to a gradual decrease of the photocurrent to zero. 12,42urther observation shows that the photocurrent value of the G0.5 sample is 4 times higher than that of G0.This obvious enhancement of the photocurrent indicates a smaller recombination and more efficient separation of photogenerated electron-hole pairs at the RGO-CdS interface: holes diffuse towards the surface of the CdS nanorods, where they are trapped or captured by reduced species in the electrolyte, meanwhile the electrons are effectively transported to RGO sheets for the CO 2 reduction. To give further support to the photocatalytic reduction mechanism of CO 2 suggested above, electrochemical impedance spectroscopy (EIS) analysis was performed in order to study the charge transfer process occurring in the threeelectrode system.EIS Nyquist plots of the G0 and G0.5 samples are shown in Fig. 11.The semicircle related to the charge transfer resistance (R p ) is connected in parallel with a double layer capacitance (CPE1).The experimental data were modeled using non-linear-least-squares (NLLS) t analysis soware (Zview soware) and the electrical equivalent circuit is presented in the inset of Fig. 11, where R s is the solution resistance and CPE1 is a constant phase element corresponding to the double-layer capacitance of the electrodes.8b, 53,54 As can be seen from this gure, the G0.5 sample exhibits a smaller semicircle than the G0 sample, which is an indication of faster interfacial electron transfer.This is not difficult to understand because the introduction of the excellent conductivity of RGO can benet charge transfer in the RGO-CdS system and thus lower the resistance and charge recombination. 12,55Therefore, it is not surprising that the photocatalytic reduction activity of RGO-CdS nanorod composite samples is signicantly enhanced."
  },
  {
    "title": "Conclusions",
    "content": "In summary, we have successfully developed a one-step microwave-assisted hydrothermal process to fabricate highly active RGO-CdS nanorod composite photocatalysts for the photocatalytic reduction of CO 2 to CH 4 .RGO was rst shown to be an effective co-catalyst for enhancing the photocatalytic reduction of CO 2 to CH 4 , and its content level has a signicant inuence on the activity.The optimal RGO content was determined to be 0.5 wt and the corresponding CH 4 -production rate was 2.51 mmol h A1 g A1 , which exceeds that of pure CdS nanorods by more than 10 times.This is because RGO can not only enhance the adsorption and destabilization of CO 2 molecules, but can also generate a larger number of photo-generated electrons on its surface, thus resulting in an enhancement of the CO 2 reduction performance of the RGO-CdS composite photocatalyst.The photocurrent response and EIS analysis results further support the suggested mechanism of CO 2 photocatalytic reduction.This work not only demonstrates a facile microwave-assisted hydrothermal method for fabricating highly active RGO-CdS nanorod composite photocatalysts, but also the possibility of utilizing an inexpensive carbon material as a substitute for noble metals in the photocatalytic reduction of CO 2 . Fig. 1 XRD patterns of the G0, G0.1, G0.25, G0.5, G1.0 and G2.0 samples. Fig. 2 TEM images of the GO (a) and G0 (b) samples, and TEM (c) and HRTEM (d) images of the G0.5 sample. Fig.3Nitrogen adsorption-desorption isotherms and the corresponding pore-size distribution curves (inset) for the G0 and G0.5 samples. Fig.4UV-vis diffuse reflection spectra of the G0, G0.1, G0.25, G0.5, G1.0 and G2.0 samples.The insets show the colors of the G0, G0.5 and G2.0 samples. Fig.5Raman spectra of the GO and G0.5 samples. Fig. 6 High-resolution XPS spectra of C1s for the GO (a) and G0.5 (b) samples. Fig. 7 GC spectra for the reduction of CO 2 on the G0.5 sample with different irradiation time. Fig. 8 Comparison of the photocatalytic CH 4 -production rate of the G0, G0.1, G0.25, G0.5, G1.0, G2.0, N0.5, P0.5 and RGO samples under visible-light irradiation. Fig. 10 Transient photocurrent responses of the G0 and G0.5 samples in 0.4 M Na 2 SO 4 aqueous solution under visible-light (l 14 420 nm) irradiation. Experimental conditions for the preparation of the samples and their physical properties This journal is The Royal Society of Chemistry 2014 This work was partially supported by the 973 program (2013CB632402), 863 Program (2012AA062701), NSFC (51320105001, 51072154, 21177100 and 51272199), Fundamental Research Funds for the Central Universities (WUT: 2013-VII-030) and Self-determined and Innovative Research Funds of SKLWUT (2013-ZD-1)."
  }
]