[
  {
    "title": "Doi",
    "content": "10.1016/j.apt.2021.03.022"
  },
  {
    "title": "Article_Title",
    "content": "Improved visible-light driven photocatalysis by loading Au onto C3N4 nanorods for degradation of RhB and reduction of CO2"
  },
  {
    "title": "Abstract",
    "content": "In this work, a solution-assembly technique was adopted to compose the g-C 3 N 4 (CN) nanorods (CN1, CN2 and CN3) with a desired microstructure.Subsequently, different amounts of Au nanoparticles (NPs) with sizes 10 nm were loaded on CN2 nanorods by an in-site reduction approach, thereby a series of plasmonic photocatalyst (CN2-A1, CN2-A2 and CN2-A3) were fabricated.The activities were investigated by photodegrading Rhodamine B (RhB) and photoreducing CO 2 into CO with the irradiation of visible light, respectively.And the degradation rates of RhB over CN2-A2 photocatalyst were 97.28 in 80 min, which was 1.45 times higher than that of pure CN2 (66.90).Moreover, without any sacrificial agents, the reduction yields of CO 2 into CO by CN2-A2 photocatalyst was 3.11 lmol/g in 4 h, that was 2.46 times higher than that of CN2 (1.26 lmol/g).The improved photocatalytic performance was owning to the stronger localized surface plasmon resonance (LSPR) effect, which not only increased the utilization efficiency of visible light, but also sped up the formation and separation of photo-induced carriers.In addition, a potential charge transfer mechanism was tentatively proposed on account of as-obtained test dates."
  },
  {
    "title": "Experimental",
    "content": "In this research, all chemical reagents were of analytically pure and were used directly without further treatment before we conducted the experiment.Deionized water (resistivity 18.0 MX cm) was used throughout the experiments. In a typical synthesis, 1,3,5-trichlorotriazine (2.766 g) and melamine powders (0.946 g) were added to a beaker including acetonitrile (60 mL) 20.The obtained mixture was stirred for 12 h before being transferred into a 100 mL Teflon-lined stainlesssteel autoclave.Subsequently, the autoclave was sealed and maintained at 180 C for several hours (12, 24 and 48 h), and then cooled to room temperature naturally.The obtained precipitates were washed for several times with ethanol and distilled water to remove residual impurities and then dried at 60 C for 6 h.The obtained g-C 3 N 4 samples heated at 180 C for 12, 24 and 48 h thus were named as CN1, CN2 and CN3 for simplicity, respectively. As a reference sample, 5 g of melamine was put into an aluminum oxide crucible with a cover and calcined at 550 C for 4 h in air (5 C/min).This product synthesized by bulk polymerization was named as B-CN for simplicity. The deposition of Au NPs onto CN2 nanorods was executed as follows 21.The obtained CN2 powder (0.5 g) was immersed in a certain amount (5, 15 and 25 mL) of HAuCl 4 A4H 2 O aqueous solution (34 wt).After mechanically stirring for 12 h, the supernatant was poured out and the solid powder was collected by centrifugation.Next, the collected solid powder was dispersed in NaBH 4 aqueous solution (15 wt, 50 mL) and kept stirring for 10 min.Finally, the products were separated, and repeatedly washed with deionized water, and then dried at 60 C.For simplicity, when three kind of amounts of HAuCl 4 A4H 2 O solution (5, 15 and 25 mL) were employed, the CN2-Au products with different Au NPs contents were denoted as CN2-A1, CN2-A2 and CN2-A3, respectively.And the mass percentages of Au in CN2-A1, CN2-A2 and CN2-A3 samples were about 1.6, 4.8 and 8.1 by calculating in theory, respectively A Rigaku (Japan) D/max 2500 X-ray diffractometer (XRD, Cu-Ka radiation, k 0.15418 nm) was applied to analyze the crystalline phase structures of photocatalysts.A Fourier transform infrared spectrometer (Thermoscientific Nicolet 4700) was used to record the Fourier transform infrared (FTIR) spectra of photocatalysts.The morphological characteristics of photocatalysts were investigated with a field emission scanning electron microscopy (FESEM, JEOL 7800F) and a transmission electron microscopy (TEM, FEI Tenai G 2 F20).The UV-vis diffuse reflectance spectra (DRS) of photocatalysts were surveyed using a scan UV-2550 spectrophotometer.The photoluminescence (PL) spectra were measured by using a Renishaw inVia micro-PL spectrometer (He-Cd laser).A Horiba Jobin Yvon Fluorolog-3 spectrometer was employed to acquire the time-resolved fluorescence (TRF) spectra of photocatalysts under the 325 nm laser excitation.In a standard threecompartment cell, the photocurrent, electrochemical impedance spectroscopy (EIS) and the Mott-Schott curves were performed by an electrochemical work-station (CHI-660C Instruments, China).The elemental compositions of composite photocatalysts were measured through the X-ray photoelectron spectroscopy (XPS, ESCALAB250XI, VG Scientific, America).Raman spectroscopy was measured by using Renishaw inVia Raman system under a 514.5 nm (or 2.41 eV) Ar ion laser (20 mW) excitation.To study the changes of hydroxyl and superoxide radical intensity in the materials, the electron spin resonance (ESR) signals of radical spin-trapped by spin-trap reagent 5,5-dimethyl-1-pyrroline Noxide (DMPO) were recorded at room temperature with an ESR spectrometer (Bruker EPR A300-10/12) under the irradiation of a 300 W Xe lamp with a 420 nm cutoff filter and dark conditions. The photocatalytic properties were evaluated based on the removal rates of RhB in aqueous solution (7 mg/L) under the irradiation of visible light.A Xe lamp (300 W, 5 WAcm A2 ) with a 420 nm cutoff filter was used as a visible light source, which was placed at 10 cm above a reactor.Firstly, 30 mg of photocatalyst was scattered in RhB aqueous solution (100 mL).In order to achieve the adsorption-desorption equilibrium between substances, this system was agitated in the absence of light for 30 min.During irradiation, a 3 mL of reaction suspension was taken every 20 min.And the RhB liquid supernatant was obtained by centrifugation, which was determined by an UV-vis spectrophotometer (UV-5800PC, Shanghai Metash Instruments Co., Ltd).Under the same condition, the control-experiment was performed in the absence of photocatalyst.Subsequently, the photocatalytic degradation property could be obtained by C/C 0 A/A 0 equation, where C 0 and C represented the primary and real time concentrations of RhB solution, and A 0 and A were the original and actual time absorbance of RhB solution, respectively. The CO 2 photoreduction performance of catalyst was investigated as the following process: firstly, 30 mg of photocatalyst was dispersed into a 300 mL of quartz reactor including deionized water.To dislodge the other gases in the reactor, high purity gaseous CO 2 was bubbled through the solution for 30 min.And a 300 W Xe lamp with a 420 nm cut-off filter was used as a source of visible light, which was positioned 10 cm above the reactor.Then, the CO 2 photoreduction reactions were performed with the help of energetically stirring under the pressure of 1.4 atm.At intervals of 1 h, the gas products (1 mL) were automatically collected and detected using a gas phase chromatography (GC-7920, China) FID-II detector."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Fig. 1a presented the XRD spectra of B-CN, CN1, CN2, CN3 and CN2-A2 samples.The XRD data of B-CN sample showed two diffraction peaks at 13.3and 27.6, which vested in the (0 0 1) and (0 0 2) lattice planes of g-C 3 N 4 as the previous reports 22.The XRD spectra of CN1, CN2 and CN3 samples possessed the similar diffraction peaks with B-CN sample.Significantly, the position of (0 0 2) peak (which was attributed to the stacking of the conjugated aromatic structure of g-C 3 N 4 ) for CN1, CN2 and CN3 samples left shifted compared to B-CN sample.And the (0 0 2) peak was slightly shifted to lower 2h value indicating increase in gallery distance and a sparser stacking 23.Moreover, the (0 0 2) peak grew with increased reaction time, which indicated that the crystallinity of CN serial samples was becoming better with increasing reaction time.With regard to CN2-A2 sample, several new character peaks emerged at 2h of 38.2, 44.3, 64.6and 77.6, which can be ascribed to the (1 1 1), (2 0 0), (2 2 0) and (3 1 1) diffraction faces of crystallized Au species (JCPDS card No. 04-0781), respectively 24.Meanwhile, there was no impurity peaks was detected, indicating that the obtained CN2-A2 product was the compound of Au and g-C 3 N 4 . Fig. 1b displayed the FTIR spectra of B-CN, CN2 and CN2-A2 samples.Three tested samples appeared almost the identical IR characteristics in the full spectra.The strong peak at approximately 807 cm A1 can be attributed to the typical respiratory pattern of triazine rings in g-C 3 N 4 .The peaks located at 1200-1700 cm A1 corresponded to the characteristic stretching vibration signals for tri-s-triazine heterocyclicrings 25.The peak at 3300 cm A1 was caused by the symmetric and antisymmetric stretching modes of -NH 2 20.Evidently, it could be considered that the core molecular structure of g-C 3 N 4 obtained by bulk polymerization or liquid phase method was maintained.And the load of Au NPs on CN2 had no difference to the structure of CN2 material.and it lacked a relatively regular morphological structure.In comparison with bulk polymerization, a primary peculiarity of CN series samples obtained in solution at low temperatures was the relatively simple control to morphology.When CN series samples maintained at 180 C and the reaction time was increased from 12 to 24 and 48 h, a nanorod-like structure was acquired as displayed in Fig. 2b-2d.It can be attributed to the heat flow annealing process, which provided ample thermodynamic force for covalently linking and assembling the molecular to the hierarchical nanostructure 20.From the overview image in Fig. 2b1 and 2b2, CN1 nanorods presented a rough surface with uniform widths of 65 nm.As shown in Fig. 2c1 and c2, the surface of CN2 nanorods became smooth as the reaction time increases, and the average widths and lengths of CN2 nanorods were around 40 nm and 500 nm, respectively.Noticeably, when the reaction time further increased, the obtained CN3 sample (Fig. 2d1 andd2) exhibited an anomalous nanorod-like structure with some branches. The typical TEM and HRTEM images of as-prepared CN2-A2 sample were shown in Fig. 3. Fig. 3a clearly indicated that the small-sized Au NPs (10 nm) as black dots were uniformly scattered on CN2 nanorods.A lattice spacing of 0.232 nm in Fig. 3b was ascribed to the (1 1 1) plane of the Au NPs (JCPDS card No. 04-0781), which signified the crystalline character of the sample 26.Besides, this revealed that the g-C 3 N 4 -Au heterojunction was formed.Furthermore, the interfacial region between CN2 nanorods and Au NPs was highly beneficial for electron migration process 13.Above all, the morphology studies revealed that CN2 nanorods could serve as a support to bound Au NPs, in which the interfaces formed between g-C 3 N 4 and Au materials.The element mapping images of CN2-A2 sample (the starboard of Fig. S2) further confirmed that elements including Au, C and N exist in the prepared CN2-A2 sample. Fig. 4 presented the N 2 adsorption-desorption isotherms of B-CN, CN2 and CN2-A2 samples.The isotherms of three samples could be geared to the type IV with H3 hysteresis loops, indicating B-CN, CN2 and CN2-A2 samples possessed mesoporous structure 27.Accordingly, the pore diameter distribution plots of B-CN, CN2 and CN2-A2 samples calculated by BJH (Barrett-Joyner-Halenda) models were showed in insert of Fig. 4.And Table 1 displayed the BET surface area, total pore volume, and average pore diameter of photocatalyst.The average pore sizes for individual samples further proved that all as-obtained samples had mesoporous structure.The specific surface area of pure B-CN and CN2 samples were 23.00 and 43.77 m 2 /g, respectively.In comparision with pure CN2 sample, the mass density of CN2-A composite samples was higher.Anecdotally, the specific surface area of the initial CN2-A composite samples changed with the amount of Au NPs, and CN2-A2 sample possessed the highest specific surface area (83.41 m 2 /g) among all as-prepared samples, which mainly was affected by the nanorods structure of g-C 3 N 4 linked with Au NPs.For CN2-A3 samples (49.05 m 2 /g), a decrease of the surface area compared to CN2-A2 sample may be attributed to stacking between overfull Au NPs, which may block a part of surface.Ordinarily, the specific surface areas of materials was mostly positively correlated with their pore volume 28.Furthermore, the larger specific surface area of photocatalysts was beneficial to the photocatalytic reaction in kinetics 29. The optical absorption properties were shown in Fig. 5a.The optical absorption edge of B-CN simple was situated at about 456 nm, corresponding to the typical g-C 3 N 4 characteristic absorption peaks reported in the literature 11.Compared to B-CN sample, the absorption edges of CN1, CN2 and CN3 samples exhibited a remarkable red-shift, which promoted the harvest toward visible light.It can be attributed to the liquid phase method at low temperatures, which improved the p-electron delocalization in the g-C 3 N 4 conjugated system 20.Remarkably, among CN1, CN2 and CN3 samples, the red-shift in the UV-vis DRS of CN2 sample was the most obvious.When Au grew on CN2 surface, the light absorption intensity of CN2-A series samples was evidently improved in the vis-light region, owing to the LSPR effect of Au NPs as the previous report 30.The electronic band gaps of B-CN, CN2 and CN2-A2 samples were determined from the Tauc plot, as shown in Fig. 5b.The band gap of B-CN sample was about 2.71 eV.While the energy gap of CN2 as well as CN2-A2 were 2.22 eV and 1.58 eV, respectively.In general, on account of the narrow band gap, it was anticipated that CN2-A2 sample can make more efficient use of visible light and thus showed stronger photocatalytic performance. The valence band edge position and conductive band edge position of the pure CN2 nanorods calculated by E VB X -E 0 0.5Eg and E CB E VB -Eg 31, where E VB , E CB , E 0 and X stood for the valence potential, conductive potential, the free electron energy on the hygrogen scale (4.5 eV) and the absolute electronegativity of semiconductor, respectively.Moreover, the X value of g-C 3 N 4 materials was 4.73 eV 20.Therefore, the E VB and E CB of CN2 were calculated to be 1.34 eV and A0.88 eV, respectively.The E VB and E CB of pure CN2 samples were further calculated based on the Mott-Shott curves in Fig. S3.And the E CB and E VB of CN2 were at about A0.89 eV and 1.33 eV, which was basically agree with the values that was estimated by the empirical formula. Fig. 6a revealed the PL emission spectra of all as-prepared samples.The B-CN sample showed a wide PL emission signal within range of 425-625 nm and the center of peak located at about 475 nm, ascribing by the band-to-band recombination of electrons and holes 25.Significantly, the emission peak of CN series samples experienced a red-shift compared to B-CN sample.As shown in Fig. 6a, the band-to-band emission peak centered at approximately 600 nm for CN series samples, which was consistent with the extension of the absorption edge in Fig. 5a.Moreover, among three CN samples, the PL peak intensity of CN2 sample was the weakest, which meant that the band-to-band recombination rate of e -and h was the least.The PL peak intensity of CN2-A1, CN2-A2 and CN2-A3 samples was lower than that of pure CN2 sample, implying that the synergistic action between Au and CN2 accounted for a high-performance separation and transfer of e -and h 10.In particular, the CN2-A2 sample revealed the weakest PL peak intensity within all as-tested samples, indicating a moderate loading of Au NPs can maximize the synergies between Au and CN2 heterojunction, which was advantageous to polish up photocatalytic activity.The average lifetimes of the CN and CN2-A series samples was further investigated through the multi-exponential fitting (Fig. 6b).It can be found that the PL decay lifetimes of samples decreased according to the sequence: CN2-A2 (24.02 ns) CN2-A3 (20.80 ns) CN2-A1 (18.72 ns) CN2 (14.83 ns) CN3 (12.62 ns) CN1 (7.67 ns).In general, the smaller decay time was related to the radiation recombination of e -and h , but the larger decay time was ascribed to the trap emission 17.When Au NPs grew onto CN2 surface, the elongated PL lifetime for CN2-A2 indicated the charge separation rate was improved.Furthermore, in the case of CN2-A2, the value of decay time increased obviously and was about 24.02 ns.Usually, the prolonged lifetime relating to the recombination process of photo-generated charge carriers was beneficial for the photocatalytic reactions 25. Fig. 7a displayed the transient photocurrent responses of various samples.The photocurrent of all tested samples sharply increased once visible-light irradiation was initiated.Moreover, the photocurrent of different samples stayed at the saturation level respond to the visible light.There was no large attenuation after 220 s of testing, which meant the tested samples electrodes had stable photoelectrochemical properties.The photocurrent intensity of as-tested samples increased by the sequence: B-CN (4.68 lA) CN1 (5.51 lA) CN3 (8.20 lA) CN2 (10.88 lA) CN2-A1 (13.23 lA) CN2-A3 (15.89 lA) CN2-A2 (17.97 lA).Obviously, the CN2-A series samples exhibited a higher photocurrent, which further suggested that the heterojunction between Au and CN2 facilitated the abruption of photo-generated carriers.Furthermore, the photocurrent value of CN2-A2 sample reached 17.97 lA, meaning that the photo-inducted e -and h was parted more availably in comparison with other samples.This would promote the photocatalytic reaction of CN2-A2 sample under visible light irradiation.Moreover, the EIS measurement results were shown in Fig. 7b. the EIS Nyquist plot of CN2-A2 presented a smaller radius of the impedance in comparison with other samples, indicating a lower interfacial charge-transfer resistance in CN2-A2 sample 32.And the results of EIS measurements were in good agreement with the photocurrent test.In short, the above results indicated the synergistic effect existed in the two components in CN2-A2 was favorable to the separation and transfer of charge carriers. Fig. 8a displayed the broken line graphs of photocatalytic degradation of RhB versus the exposure time for each sample.And the blank experiments without photocatalyst was carried out at the same condition, which indicated that the self-photolysis of RhB nearly can be neglected.When the time of visible light irradiation reached 80 min, the photodegradation efficiency followed an order of CN2-A2 (97.28) CN2-A3 (87.31) CN2-A1 (82.16) CN2 (66.90) CN3 (54.95) CN1 (41.14) B-CN3 (34.46).Notably, the photocatalytic activities of CN series samples were stronger compared to B-CN sample.The intensive photocatalytic activities of CN series samples were attributed to the emergence of a desired size and microstructure, which had larger surface area and more active sites 29.In addition, when Au NPs grew on CN2 nanorods surface, the photocatalytic activities were improved, especially CN2-A2 sample.Fig. 8b given the characteristic absorption spectra of RhB at different irradiation time over CN2-A2 sample as photocatalysts.The intensity of RhB peak appearing at about 555 nm weakened rapidly and vanished absolutely during 80 min, meaning the totally purge of RhB by CN2-A2 photocatalyst. The pseudo-first-order kinetics, k Aln(C t /C 0 ) (k was the kinetic rate constant) was used to further evaluate the photodegradation performance of B-CN, CN2 and CN2-A2 sample.The k values of B-CN, CN2 and CN2-A2 samples were presented in Fig. 9a.Obviously, CN2 photocatalyst (0.00190 min A1 ) presented higher kinetic rate constant than B-CN (0.0075 min A1 ).And the moderate introduction of Au NPs on CN2 nanorods leaded to the augment of k for CN2-A2 sample (0.00380 min A1 ), which was about twice as much as the k value of pure CN2 photocatalyst.In addition, in order to clear and definite the primary reactive species during the RhB photodegradation process with CN2-A2 photocatalyst, the scavenging experiments were carried out by adding ethylenediaminetetraacetate (EDTA), tert-butyl alcohol (t-BuOH), and 1,4-benzoquinone (BQ) trapping agent.These three reagents can capture h , OH and O 2 A , respectively.Fig. 9b showed the results of scavenging experiment.Obviously, the addition of EDTA, t-BuOH and BQ trapping agents resulted in an apparent decrease in photocatalytic activity, indicating that h , OH and O 2 A were master reactive substrate in RhB photodegradation with CN2-A2 photocatalyst.Furthermore, the photodegradation ratio of RhB diminished from 97.28 (no scavenger) to 53.07(h ), 48.90 (OH), and 36.76(O 2 A ), respectively.Moreover, the ESR spectra of active species of CN2-A2 sample were provided for further investigating the photocatalytic mechanism.As shown in Fig. S4a and S4b, it can be further confirmed that OH and O 2 A played a major role in the photocatalytic processes of RhB for CN2-A2 photocatalysts.And this result agreed well with those of the scavenging tests of CN2-A2 sample.Fig. 10 showed the performance of CO 2 photoreduction over various as-prepared samples within 4 h of visible light irradiation.Obviously, the CO yields with CN series photocatalysts were larger compare to B-CN sample, which may be related to the larger On account of the results described above, a possible photocatalytic mechanism of CN2-A system was proposed.As illustrated in Fig. 11, when CN2-A binary photocatalytic system was subjected to visible light irradiation, the CN2 nanorods was excited and generated the holes and electrons.Meanwhile, the localized surface plasmon resonance-excited Au NPs can generate high-energy electrons and holes.The high-energy electrons occupied empty states above the Fermi level (0.6 eV) in Au and transfer toward the conduct band of CN2 nanorods 10.While the holes generated by the LSPR of Au NPs would reserve at Fermi level for subsequent reactions.According to the above illustration, the photo-induced carriers availably parted through the heterogeneous interface within CN2-A system.Because of the LSPR effect of Au NPs, the light utilization efficiency for CN2-A series samples was improved, and the production rate of e -and h was accelerated by a strong local electromagnetic fields from Au NPs 34.The photocatalytic mechanisms of CN2-A in RhB photodegradation and CO 2 photoreduction reactions were illustrated in detail as below: For RhB photodegradation (Fig. 11), the conduct band potential (A0.88 eV) of CN2 and the high-energy electrons potential of Au NPs were more negative compared to the reduction potential of O 2 AOH radicals were the primary high-energy active substances, which can photodegrade RhB molecules well.In the meantime, the holes in the valence band of CN2 and Fermi level of Au can directly oxidize RhB molecules 21.For the photocatalytic CO 2 reduction process, as shown in Fig. 11, both the conduct band positions of CN2 and Au NPs were more negative compared to the potential (A0.53 eV vs. NHE) for CO 2 reduction to CO 7.So, when the photo-generated electrons in CN2-A photocatalyst migrated to surface, CO 2 adsorbed on the active sites of CN2-A photocatalyst can be reduced immediately to CO by obtaining two electrons. The recycling photocatalytic tests by repeated degradation reactions was performed to survey the stabilization of CN2-A2 photocatalyst, which was an important factor for practical application.And the performed results were given in Fig. 12a.It showed that the removal efficiencies of RhB by CN2-A2 photocatalyst maintained at more than 80 even after five consecutive cycles.This result indicated the binary CN2-A2 photocatalyst possessed excellent photochemical stability.Furthermore, the used and fresh CN2-A2 photocatalyst was measured by XPS analyses.Fig. 12b, 12c and 12d displayed the XPS patterns of C 1s, N 1s and Au 4f on CN2-A2 sample before and after RhB discoloration, respectively.The XPS spectrum of C 1s showed that, there were three kinds of carbon species in CN2-A2 sample.And the peaks at 282.83, 284.58 and 286.40 eV can be attributed to CAC, CAO, NACN in graphitic carbon species, respectively 11.For the XPS spectra of N 1s, the core levels at 396.98 eV was from CNAC, around 397.80 eV was ascribed to CA(N) 3 , and 398.61 eV was for CANAH originating from the defective condensation of heptazine structures 10.Thus it can be seen, the XPS of C 1s and N 1s for CN2-A2 samples exhibited no obvious change before and after five cycles of photocatalystic test, showing that chemical structure of C 3 N 4 component in CN2-A2 sample was stable and not influenced by multiple photocatalytic process.In addition, the peaks located at 81.72 and 85.57eV in Fig. 12d belonged to Au 4f 7/2 and 4f 5/2 , respectively 35.And the interval between Au 4f 7/2 and Au 4f 5/2 peaks was a typical value of 3.85 eV, which showed that gold existed in the form of Au 0 21.This result demonstrated that Au NPs still existed on CN2-A2 surface after repeated photocatalytic experiments, which further indicated that the CN2-A2 photocatalyst had good chemically stability.In addition, the XRD patterns of CN2-A2 photocatalyst before and after the five cycles were exhibited in Fig. S5, the peaks' intensity and position remained almost unchanged in contrast with fresh photocatalyst, indicating that CN2-A2 has excellent chemical stability."
  },
  {
    "title": "Conclusions",
    "content": "In conclusion, we depicted the preparation and characterization of 1D g-C 3 N 4 nanorods (CN1, CN2 and CN3) with a narrower energy gap of 2.22 eV and g-C 3 N 4 /Au plasmonic photocatalyst with different Au NPs contents (CN2-A1, CN2-A2 and CN2-A3).The fabrication process combined solution-processed approach at low temperature and an in-site reduction method.Under irradiation with visible light, the photocatalysts were used to degrade RhB and reduce CO 2 .The CN2-A2 photocatalyst exhibited an uncommon bi-functionality of photocatalytic performance.The enhanced photocatalytic activity was in well agreement with plasmonenhanced respond to visible light, low e -and h recombination efficiency as well as long lifetimes of photo-generated electrons, which was related to the LSPR effect of Au NPs.This research demonstrated that g-C 3 N 4 /Au plasmonic photocatalyst with potential applications in water purification and mitigation of energy shortages. Fig. 2 presented the SEM and TEM images of B-CN, CN1, CN2 as well as CN3 samples.As given in Fig. 2a1 and 2a2, the B-CN sample was solid agglomerates about several micrometers in size thick Fig. 2. Typical SEM and TEM images of B-CN (a1-a2), CN1 (b1-b2), CN2 (c1-c2) and CN3 (d1-d2) samples. Fig. 3. TEM (a) and HRTEM (b) images of CN2-A2 sample. Fig. 4. Nitrogen adsorption-desorption isotherms for B-CN, CN2 and CN2-A2 samples (Insert: the corresponding pore diameter distribution plots of B-CN, CN2 and CN2-A2 samples). Fig. 5. UV-vis DRS of all as-prepared samples (a) and the bandgap determination of B-CN, CN2 and CN2-A2 samples form the Tauc plots (b). Fig. 6.PL emission spectra (a) and time-resolved fluorescence spectra (b) of all asprepared samples. Fig. 7. Amperometric i-t curves (a) and EIS (b) for various samples. Fig. 8. Photocatalytic activities of various as-prepared samples (a) and UV-visible absorption spectra of RhB over time with CN2-A2 sample (b). Fig. 9.The kinetic constants for the photocatalytic degradation processes of RhB over B-CN, CN2 and CN2-A2 samples (a) and Effect of active species scavengers on percentage photodegradation of RhB using CN2-A2 sample (b). Fig. 10.Time courses of photocatalytic CO evolutions by all as-prepared samples under visible light irradiation. Fig. 11.Photocatalytic mechanism of CN2-A system under visible-light irradiation. The surface structure properties of B-CN, CN1, CN2, CN3 and different CN2-A photocatalyst. This work is supported by the National Natural Science Foundation (No. 21576112, 21902060, 21906062, 61705079), the Natural Science Foundation Project of Jilin Province (20180623042TC, 20180101181JC, 20170520147JH, 2020122273JC), the Project of Human Resources and Social Security Department of Jilin Province (2017956), the Project of Development and Reform Commission of Jilin Province (2019C044-2), and the Project of Education Department of Jilin Province (JJKH20191015KJ) The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://doi.org/10.1016/j.apt.2021.03.022."
  }
]