[
  {
    "title": "Doi",
    "content": "10.1016/j.jcat.2020.03.005"
  },
  {
    "title": "Article_Title",
    "content": "Ultra stable multinuclear metal complexes as homogeneous catalysts for visible-light driven syngas production from pure and diluted CO2"
  },
  {
    "title": "Abstract",
    "content": "For high reactivity but poor stability of homogeneous metal complexes in CO 2 photoreduction, development of durable systems is still a big challenge.Herein, pentanuclear Co(II) complex Co 5 (btz) 6 (NO 3 ) 4 (H 2 O) 4 (1, btz benzotriazolate) is explored for converting CO 2 to syngas which shows high stability and reactivity in both pure and diluted CO 2 .Compared with mononuclear structure, multinuclear complex exhibits 212-fold enhancement in reactivity, up to 2748 TONs, with wide adjustability of H 2 /CO ratio from 16:1 to 2:1.This reactivity could be maintained over 200 h which is an order of magnitude higher than the durability of mononuclear complex and exceeds most reported homogeneous molecular catalysts.High reactivity is also achieved in extreme low CO 2 content (5).Structural analysis and density functional theory (DFT) calculations support that multinuclear structure and the low energy barrier for photocatalytic intermediate may account for the durable and efficient performance of complex 1.The multinuclear strategy is also adopted to nickel complex.This work probes origin of metal-nodedependent performance for CO 2 photoreduction, providing new insights in design of durable and efficient metal complexes for photocatalysis and other applications."
  },
  {
    "title": "Experimental",
    "content": "Co(NO 3 ) 2 A6H 2 O, Ni(NO 3 ) 2 A6H 2 O and btz were used for the synthesis.All other chemicals of analytical grade were purchased from Alfa and used as received.Single-crystal X-ray diffraction data for complexes 1-4 were recorded by using a Bruker Apex-II CCD diffractometer with graphite-monochromated Mo Ka radiation (k 0.71069 A) at 293 K.The C, H and N elemental analyses were tested on a PerkinElmer 2400 CHN elemental analyzer.Powder Xray diffraction (PXRD) patterns were collected by using a Siemens D5005 diffractometer with Cu Ka (k 1.5418A) radiation in the range of 5-30at a rate of 5 /min.X-ray photoelectron spectroscopy (XPS) was recorded through a Multilab 2000 (Thermo) spectrometer.The UV-vis absorption spectrum was measured on a Shimadzu UV-2550 spectrophotometer in the wavelength range of 200-800 nm.Complex 1 was synthesized according to a reported study 46.Co(NO 3 ) 2 A6H 2 O (0.4 mmol, 0.117 g) and btz (0.2 mmol, 0.030 g) were added into 8 mL acetone solution.Then, the mixture was stirred for 30 min under ambient condition.Sequentially, the solution was filtered and the red filtrate was left for slow evaporation.Red block crystals were collected after 12 h and dried in air.Yield: Complex 2 was synthesized according to a reported study 47.Co(NO 3 ) 2 A6H 2 O (0.5 mmol, 0.146 g), btz (1.0 mmol, 0.136 g) and NaOH (1.0 mmol, 0.04 g) were added into 10 mL H 2 O.The resultant solution was heated at 160 C for ten days.The autoclave was then allowed to cool naturally to room temperature and pale-yellow crystals were obtained.Yield: 68 (based on Co).Calcd for C 8 H 28 -N 6 O 10 Co (found): C, 22.49 (22.46);H, 6.61 (6.63); N, 19.67 (19.68). Photocatalytic CO 2 reduction was carried out in a quartz tube (total volume of 50.0 mL) sealed with a cap containing metal com-plex (0.08 lmol of complex 1 or 0.4 lmol of complex 2), Ru(bpy) 3 Cl 2 (0.01 mmol), MeCN (5 mL) and TEOA (1 mL).After bubbling CO 2 gas for 15 min in dark, the reaction tube was fixed in a water bath at 20 C and beamed by a 300 W xenon lamp at k !420 nm under continuous stirring.The detection of CO was used a GC with a FID detector and the detection of H 2 was used a GC with a TCD detector, together with argon as the carrier gas and reference gas. The isotopic labelling experiment was carried out under the same experimental condition except using 13 CO 2 (99 purity, 1 bar) to replace CO 2 as the carbon source.The CO product was detected by Agilent 8860GC-5977BMSD gas chromatographymass spectrometer (GC-MS), equipped with DB-624 Columns."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Complex 1 was synthesized by btz and Co(NO 3 ) 2 A6H 2 O in acetone solution.In complex 1, four six-coordinate Co 2 ions together with the fifth central one construct a pentanuclear cluster and six btz ligands linking to five Co 2 ions develop a tetrahedral structure (Fig. 1a).Each vertex Co 2 ion, which connects with the other three Co 2 ions via the 1,3-bridge pattern of the btz ligands, is coordinated by the three nitrogen atoms of three btz ligands as well as two oxygen atoms of the chelating nitrate group; the remaining position is taken up by a water molecule.The central Co 2 ion is completely coordinated by six nitrogen atoms of six btz ligands.Complex 1 possesses the advantage of excellent solubility in most common organic solvents, such as acetonitrile, acetone, methanol and ethanol.This property makes complex 1 be homogeneous catalysts for CO 2 reduction.Moreover, the sites of water molecules in the structure could be possible the centers for CO 2 adsorption. The purity of complex 1 was investigated by powder X-ray diffraction (PXRD) patterns.The experimental PXRD pattern is extremely similar to the simulated one, demonstrating the satisfying purity of complex 1 (Fig. 1b).The UV-vis absorption of complex 1 displays absorption in the visible light region and the maximum molar absorption coefficient (e 1614 M A1 cm A1 ) at 420 nm (Fig. 1c).XPS survey spectra suggest that there are C, N, O, Co elements in complex 1 (Fig. 1d).The C 1s spectrum (Fig. S2ay) displays two distinct peaks at 284.7 eV and 288.7 eV.The former peak can be ascribed to the sp 2 hybridized CAC bonds in benzoic ring of btz.The later peak is consistent with the CANH species on the triazole of btz.For N 1s (Fig. S2by), the peak located at 399.6 eV is assigned to CoAN and the peak located at 400.2 eV is corresponded to pyrrolic-N.The third peak at 401.3 eV is attributed to the nitrogen atoms from the triazole structure.The peak at 532.4 eV is ascribed to an OH group which can be assigned to the absorbed H 2 O (Fig. S2cy).The deconvolution of XPS spectrum gives two main peaks at 796.9 eV and 781.4 eV with concomitant broad satellite structures (Fig. S2dy), related to Co 2p 1/2 and Co 2p 3/2 , respectively 484950.Under CO 2 , the cyclic voltammogram (CV) of Ru(bpy) 3 Cl 2 shows three reduction peaks at E 1/2 -1.42,A1.61 and A1.79 V vs. Fc /Fc, respectively, all of which are more negative than that of complex 1 (A1.14V) (Fig. S3y).Therefore, visible-light driven CO 2 reduction is thermodynamically feasible with complex 1 as the catalyst and Ru(bpy) 3 Cl 2 as the photosensitizer 41,5152. CO and H 2 were detected as the main gas products in the system containing complex 1, Ru(bpy) 3 Cl 2 and TEOA.Time-course curve of this system in pure CO 2 after visible-light irradiation showed that in the first 10 h, more than 1000 and 300 TONs of H 2 and CO were produced, corresponding to 103 and 32 h A1 turnover frequency (TOF) (Fig. 2a).Such reactivity outperforms most of complexes based on metal-oxygen clusters under similar condition 53.The decrease of catalytic reactivity might be ascribed to the photo-degradation of Ru(bpy) 3 Cl 2 41.Owing to the different generation speed of H 2 and CO within 70 h catalysis, the H 2 /CO ratio was changed from 3:1 to 1.5:1 (Fig. 2b).In addition, the H 2 /CO ratio had close relationship with solvent component (Fig. 2c andS4y), the amount of TEOA (Fig. 2d andS5y) but was hardly affected by the amount of catalyst (Fig. S6y).The apparent quantum yields (AQY) at 480 nm for H 2 and CO are shown in Table S1y.Control experiment without complex 1 exhibited negligible CO and H 2 (entry 2, Table 1), which may come from the decomposed species of Ru(bpy) 3 Cl 2 and also indicates the important role of complex 1 51,54.Using Ar to replace CO 2 , only H 2 was detected, implying the generated CO is not from any other organic species in this system (entry 7, Table 1).The isotope labelling experiment using 13 CO 2 was also confirmed the source of CO (Fig. S7y).When conducting the experiment in dark, no gas product was generated, suggesting the reaction is photo-induced (entry 3 and 5, Table 1).In the absence of TEOA, no product was recorded, declaring TEOA is the important proton source and electron donors (entry 4, Table 1). Directly performing the conversion under low CO 2 content without concentration from gas mixtures, such as flue gas from coal-fired power stations (5-20 CO 2 ), is significant from the energy-saving viewpoint 7,8.The reductive reactivity of complex 1 toward diluted CO 2 was investigated.In CO 2 content of 20, the TONs of H 2 and CO was 525 and 254, corresponding to 8 and 4 h A1 TOF (entry 8, Table 1, Fig. 3a).Compared with the yield in pure CO 2 , this reactivity only declined 2.5 fold.More significantly, in extremely low content of 5, the catalytic activity is nearly the same as that in the concentration of 20 (entry 9, Table 1 and Fig. 3b).The attractive performance of complex 1 may result from its multi-potential CO 2 adsorption sites.This reactivity of complex 1 in 5 CO 2 outperforms most of reported homogeneous systems in similar condition (Table S2y).In order to demonstrate the catalytic persistence of catalyst, recycling experiments were performed.Owing to the instability of Ru(bpy) 3 Cl 2 , during the recycle, equal amount of Ru II complex was added.The nearly 200 h (Fig. 4), illustrates the super stability of complex 1.Such durability is hard to achieve by reported metal complexes (Table S3y).To get a clear understanding of the reason about the high activity and stability of this complex, control experiment was performed using a mononuclear isostructural Co-based complex, Co(btz) 2 (H 2 O) 4 6H 2 O (2), to replace complex 1.In complex 2, the only central Co 2 ion is sixcoordinated by two nitrogen atoms of two disparate btz ligands and four oxygen atoms of four water molecules, constructing a bit distorted octahedral structure (Fig. S8y).Under similar catalytic condition in pure CO 2 , except the dosage, the photocatalytic efficiency of complex 2 was rather lower than that of complex 1, with total TONs just of 9 (Fig. S9y).Moreover, complex 2 could only be active within 10 h (Fig. S10y), even with the addition of fresh Ru (bpy) 3 Cl 2 , the reduction activity still cannot recover.We conjecture the super stability of complex 1 may root in the fastened structure of five Co 2 ions linking to btz ligands, whereas the enhanced reactivity may be relative to multiple catalytic sites. DFT calculations are perfermed to illuminate the mechanism.Following the generally accepted viewpoint, CO generation principally occurs during the carboxyl process in the following steps: (i) the activation of CO 2 (CO 2 H e A ?COOH); (ii) the cleavage of AOH (COOH H e A ?CO H 2 O) and (iii) the desorption of CO (CO ?CO) 555657, where stands for the related adsorption state on the catalyst, the catalytic route and energy barrier were studied by DFT calculations (Fig. 5).To simulate a photo-catalysis process, the catalyst models are firstly negatively charged with one electron.For complex 1, the reduced Co centers do not incline to form Co-C bond with CO 2 with adsorption energy of A0.50 eV (Fig. 5a).The first proton-coupled electron transfer (PCET) that forming COOH, which consumes energy of 0.40 eV, serves as the potential determining step for the whole CO 2 reduction reaction process.The second protonation process requires a slight energy barrier of 0.08 eV, leading to CO and H 2 O.For complex 2, the planner structure in a neutral state can be largely distorted by an elec-tron injection, two coordinated water molecules deviate from the Co center in the meantime (Fig. 5b andc), indicating the instability of complex 2 during photocatalytic reactions.With a decreased coordination number, the reduced Co center with large spin density (Fig. S12y) attract CO 2 molecule effectively forming a carbonate-bridged structure.The strong interaction between Co and CO 2 induces an energy decrease for the first protonation step, while the second protonation process with energy barrier of 0.27 eV turns into the potential determining step (Fig. S13y).In addition, the competitive reaction, i.e.H 2 production, readily occurs for both complex 1 and 2 with free energy of 0.28 eV and 0.17 eV, respectively (Fig. S14y). The universality of the preponderance in stability and activity of multinuclear complex is further extended to Ni(II) complex (Fig. S15ay).TONs of H 2 and CO are up to 1195 and 629 with Ni 5 (btz) 6 (NO 3 ) 4 (H 2 O) 4 (3) as catalyst within 70 h visible-light irradiation (Fig. S17ay), corresponding to 17 and 9 h A1 TOF.The ratio of H 2 /CO could be tuned from 2.5:1 to 1.9:1 via regulating the reaction time (Fig. S17by).Control experiments, including without catalyst, Ru(bpy) 3 Cl 2 or CO 2 , light irradiation, demonstrated that the produced CO originated from CO 2 reduction (Table S4y).Recycling experiments demonstrated the catalytic activity could be maintained up to four cycles of 200 h (Fig. S20y).Whereas the yield of the mononuclear Ni 2 complex, Ni(btz) 2 (H 2 O) 4 6H 2 O (4) is just 5 TONs keeping only dozens of hours, which support the structural advantages of multinuclear transition-metal complexes as catalysts for CO 2 photo-reduction (Fig. S21y)."
  },
  {
    "title": "Conclusions",
    "content": "In summary, a strategy of constructing multinuclear transitionmetal complex to promote the durability and activity in CO 2 reduction is put forward.Compared with the stability and reactivity of the mononuclear cobalt complex (2), those of multinuclear complex (1) shows 1 and 2 orders of magnitude improvement in pure CO 2 .The yield of syngas generation achieved by complex 1 is up to 219.8 lmol (2748 TONs) with wide adjustability of H 2 /CO ratio from 16:1 to 2:1.This reactivity could be maintained more than 200 h, outperforming the stability of most reported homogeneous molecular catalysts.High reactivity is also achieved in diluted CO 2 with 20 and 5 content, both up to 60 lmol.Structural analysis and DFT studies support that multinuclear structure and the low energy barrier for photocatalytic intermediate may account for the durable and efficient performance of complex 1.Moreover, this strategy is also adopted to nickel complex.This work sheds light on the rational construction of high efficient homogeneous metal complexes catalysts for robust solar-driven CO 2 conversion performances. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Fig. 1.(a) The molecular structure of complex 1. Color code: C, gray; O, red; N, blue; Co, pink.(b) PXRD patterns of simulated and as-synthesized complex 1. (c) UV-vis spectrum of complex 1 in MeCN (0.05 mM) from 200 nm to 800 nm at 25 C.(d) XPS spectrum of complex 1. Fig. 2. Time-dependent generation plots of (a) CO and H 2 (lmol and TON), and (b) H 2 /CO ratio under the CO 2 -saturated MeCN solution (5 mL) containing complex 1 (0.08 lmol), Ru(bpy) 3 Cl 2 (0.01 mmol) and TEOA (1 mL) at 20 C and irradiated by k !420 nm.(c) Plots of H 2 /CO generation with the tuning of H 2 O/MeCN ratio under similar condition for 70 h reaction.(d) Plots of H 2 /CO generation with different TEOA amounts under similar condition for 70 h reaction. Fig. 3. Time-dependent generation plots of CO and H 2 (lmol and TON) under the CO 2 -saturated MeCN solution (5 mL) containing complex 1 (0.08 lmol), Ru(bpy) 3 Cl 2 (0.01 mmol) and TEOA (1 mL) at 20 C and irradiated by k !420 nm with (a) 20 CO 2 and 80 Ar, (b) 5 CO 2 and 95 Ar. Fig. 4. Generation of CO and H 2 for complex 1 with 4 cycles under the CO 2saturated MeCN solution (5 mL) containing complex 1 (0.08 lmol), Ru(bpy) 3 Cl 2 (0.01 mmol) and TEOA (1 mL) at 20 C and irradiated by k !420 nm. 25 mg (57 based on btz).Calcd for C 36 H 32 N 22 O 16 Co 5 (found): C, 32.67 (32.69);H, 2.44 (2.46); N, 23.28 (23.25). The control experiments of complex 1 for visible-driven CO 2 reduction.Ru(bpy) 3 Cl 2 (0.01 mmol), complex 1 (0.08 mmol), MeCN (5 mL), TEOA (1 mL), CO 2 (1 atm), k !420 nm, 20 C, 70 h.Using btz, and Co(NO 3 ) 2 A6H 2 O to replace complex 1. a Reaction conditions: b Without complex 1. c Without Ru(bpy) 3 Cl 2 .d Without TEOA.e In dark.f g 100 Ar. h 20 CO 2 (CO 2 /Ar 20/80).i 5 CO 2 (CO 2 /Ar 5/95).j The H 2 /CO ratio: (mol amount of H 2 )/(mol amount of CO).k Turnover number based on amount of catalyst: (mol amount of CO and H 2 )/(mol amount of complex 1).l Turnover number based on amount of photosensitizer: (mol amount of CO and H 2 )/(mol amount of Ru(bpy) 3 Cl 2 ). Fig. 5. (a) Schematic of the calculated energy profile for complex 1 during the CO 2 reduction process towards to CO production, insert presents the partial structures of three intermediates and all the full structures are shown in Fig. S11 in supporting information.Optimized structures of complex 2 in a neutral state (b) and in a charged state (c), the units for the bond lengths are in A. M. Sun et al. / Journal of Catalysis 385 (2020) 70-75 This work was supported by NSFC of China (grant numbers 21971032, 21801038, 21771035, 21671034); Jilin Provincial Department of Science and Technology (grant number 20190103018JH); Foundation of Jilin Educational Committee (grant number JJKH20190278KJ). Supplementary data to this article can be found online at https://doi.org/10.1016/j.jcat.2020.03.005."
  }
]