[
  {
    "title": "Doi",
    "content": "10.1016/j.cej.2021.129968"
  },
  {
    "title": "Article_Title",
    "content": "Sulfur doped In2O3-CeO2 hollow hexagonal prisms with carbon coating for efficient photocatalytic CO2 reduction"
  },
  {
    "title": "Abstract",
    "content": "Developing integrated photocatalysts with advanced structures and desired components is an effective strategy for promoting solar-to-chemical energy conversion.Herein, a novel sulfur-doped In 2 O 3 -CeO 2 hollow hexagonal prism with a thin carbon coating (S-C/In 2 O 3 -CeO 2 HHP) is synthesized by directly pyrolyzing Ce-doped In-Materials of Institute Lavoisier-68 (In-MIL-68) hexagonal prism metal-organic frameworks under N 2 atmosphere in the presence of sulfur powder, showing excellent photocatalytic carbon dioxide (CO 2 ) reduction efficiency.This synthetic strategy realizes the regulation of structure, components, and surface defects of the final products.The synergistic effects of hollow porous hexagonal prism structure, In 2 O 3 -CeO 2 heterojunction, and surface defects exhibit advantageous features for CO 2 photoreactions with accelerated transfer and separation of charge carriers, enhanced visible-light utilization and CO 2 chemisorption ability, and enlarged catalytic active sites.Benefiting from these advantages, the obtained optimized S-C/In 2 O 3 -CeO 2 HHP exhibits superior gas phase photocatalytic performance for the conversion of CO 2 into CH 4 and CO, yielding a CH 4 yield of 60.6 mol g -1 h -1 and a selectivity of 92.4 under AM1.5 irradiation without noble metal and organic photosensitizer.This work presents a strategy for the rational design and fabrication of efficient photocatalysts with advanced hollow architectures."
  },
  {
    "title": "Experimental",
    "content": "The Ce-doped In-MIL-68 precursors with various Ce/In ratios (the molar ratios of the Ce and In are 1:20, 1:10, and 1:5) were synthesized using the modified method 44.Typically, 60 mg of In(NO 3 ) 3 4.5H 2 O, certain amounts of Ce(NO 3 ) 3 6H 2 O (e.g., 3.5, 7, and 14 mg), 60 mg of 1,4-benzenedicarboxylic acid, and 40 mL of N, N-Dimethylformamide were added in a three-necked bottle, followed by stirring for 2 min.Then, the three-necked bottle was kept at 120 C for 30 min in an oil bath.After the reaction, the product was washed with ethanol several times. To synthesize sulfur(S)-doped In 2 O 3 -CeO 2 hollow hexagonal prisms with a carbon coating, the prepared Ce-doped In-MIL-68 hexagonal prism precursors and sulfur powder (mass ratio of 1:2) were thoroughly blended in a porcelain boat and heated to 500 C for 2 h with a heating rate of 5 C min -1 under an N 2 atmosphere.The products prepared from 3.5, 7, and 14 mg of Ce(NO 3 ) 3 6H 2 O were designated as S-C/In 2 O 3 -CeO 2 -1/2 HHP, S-C/In 2 O 3 -CeO 2 HHP, and S-C/In 2 O 3 -CeO 2 -2 HHP.For comparison, some control samples were also prepared as follows: In 2 O 3 hollow hexagonal prisms were prepared via the following route: In-MIL-68 hexagonal prisms precursor was heated to 500 C and kept for 2 h with a heating rate of 5 C min -1 in air atmosphere.The obtained product was designated as In 2 O 3 HHP. Carbon-coated In 2 O 3 hexagonal prisms were prepared under the same reaction conditions without the introduction of Ce 3 and sulfur powder.The obtained product was designated as C/In 2 O 3 HP. Sulfur(S)-doped In 2 O 3 hollow hexagonal prisms with carbon coating were also prepared under the same reaction conditions without the introduction of Ce 3 .The product obtained was designated as S-C/In 2 O HHP. Carbon-coated In 2 O 3 -CeO 2 hexagonal prisms were prepared using the same synthetic condition without the introduction of sulfur powder.The product obtained was designated as C/In 2 O 3 -CeO 2 HP. In 2 O 3 -CeO 2 hollow hexagonal prisms were prepared by annealing Ce-doped In-MIL-68 hexagonal prisms precursor in an air atmosphere at the same pyrolysis temperature.The product obtained was designated as In 2 O 3 -CeO 2 HHP. S-In 2 O 3 -CeO 2 hollow hexagonal prisms were also prepared under the same reaction conditions of S-C/In 2 O 3 -CeO 2 HHP using In 2 O 3 -CeO hollow hexagonal prisms to replace Ce-doped In-MIL-68 precursors. CeO 2 was also prepared via the following steps: First, Ce-based metal-organic framework precursor was prepared.70 mg Ce (NO 3 ) 3 6H 2 O, 60 mg of 1,4-benzenedicarboxylic acid, and 40 mL of N, N-Dimethylformamide were added in a three-necked bottle, followed by stirring for 2 min.Then, the three-necked bottle was kept at 120 C for min in an oil bath.After the reaction, the product was washed with ethanol several times.Finally, the Ce-based metal-organic framework precursor was heated to 500 C and kept for 2 h with a heating rate of 5 C min -1 in air atmosphere. S-C/CeO 2 was also prepared by annealing the Ce-based metal--organic framework precursor at 500 C for 2 h an N 2 atmosphere in the presence of Sulfur powder. The morphology and structurs were examined by Sigma 500 scanning electron microscope (SEM), JEM-F200 transmission electron microscopy (TEM), and SmartLab X-ray diffractometer (XRD, 9 KW, CuKa radiation).X-ray photoelectron spectroscopy (XPS) was implemented on a Kratos-AXISUL TRA DLD spectroscopy.UV-vis diffuse reflectance spectra were acquired on an Lambda 950 UV-vis spectrophotometer (Perkin-Elmer).The photoluminescence (PL) spectra were obtained on a FLS920P fluorescence system (Edinburgh).The N 2 adsorption-desorption isotherms were acquired on an ASAP 2420 adsorption apparatus micrometer.CO 2 adsorption curves were acquired on a micromeritics instrument (Autosorb-iQ, Quantachrome) at 273 K.In situ Fourier-transform infrared (FTIR) spectra were acquired from infrared spectrometer (Nicolet IS-50) with an in situ Harrick IR cell.CO temperature-programmed desorption tests were performed on an automated chemisorption analyzer (ChemBET Pulsar Quantachrome) with a thermal conductivity detector (TCD). Photocurrent response, electrochemical impedance, and Mott-Schottky plots were obtained on a BAS100B electrochemical workstation in the 0.1 M Na 2 SO 4 electrolyte solution under illumination of a 300 W Xe lamp with an AM 1.5 filter.Saturated calomel electrode and Platinum wire were used as the reference electrode and counter electrode, respectively. In a typical CO 2 photoreduction system, a gas-solid reactor (80 mL, PLS-SXE300, Perfect light, China) was used.5 mg photocatalyst powder was evenly spread on a glass sheet (1.5 cm 2.5 cm).Then the reactor was purged with CO 2 gas (99.999) for 60 min through deionized water under ambient pressure.Then the reactor was exposed to the Xe lamp (300 W) with an AM1.5 filter, and the light intensity of the light source was adjusted to 100 mW cm -2 using a NREL-calibrated Si solar cell.Cooling water circulation was applied to keep the reactor at 25 C.After every 1 h of reaction, 1 mL gas was sampled from reactor and quantified with GC7900 gas chromatograph. 13CO 2 (Beijing Gaisi Chemical Gases Company) was used to detect carbon source on the Agilent 6890 N/ 5973 N GC-MS analyzer."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The hexagonal prism shape of the Ce-doped In-MIL-68 precursor was confirmed by the SEM image (Fig. S1a).The Ce-doped In-MIL-68 hexagonal prisms show a smooth surface with an average length and diameter of about 6 and 1 m, respectively.The morphology of Cedoped In-MIL-68 is similar to pure In-MIL-68 (Fig. S1b).The diffraction peaks in the XRD pattern of Ce-doped In-MIL-68 agree with those of the phase-pure In-MIL-68 (Fig. S2).The results indicate that the shape and crystal structure of the In-MIL-68 did not change after proper cerium doping.The SEM images in Fig. 1a,b show that the obtained sulfur (S)doped In 2 O 3 -CeO 2 hollow hexagonal prisms with carbon coating (S-C/ In 2 O 3 -CeO 2 HHP) well preserve the hexagonal prism morphology of the Ce-doped In-MIL-68 precursor (Fig. S1a).The enlarged SEM image (Fig. 1c) shows the surface of S-C/In 2 O 3 -CeO 2 HHP is composed of randomly assembled nanoparticles of about 6 nm.The TEM images (Fig. 1d,e) exhibit the well-defined hollow prism-shaped structures of the S-C/In 2 O 3 -CeO 2 HHP hexagonal prisms.In the HRTEM image (Fig. 1f), the lattice fringes of 0.292 and 0.271 nm correspond to the (2 2 2) plane of In 2 O 3 and (2 0 0) plane of CeO 2 , respectively 45,46.Elemental mappings of an individual S-C/In 2 O 3 -CeO 2 HHP hexagonal prism show that In, Ce, O, S, and C elements are evenly distributed in the whole hexagonal prism (Fig. 1g).For comparison, the morphology and structure of S-doped In 2 O 3 hollow hexagonal prisms with carbon coating (S-C/In 2 O 3 HHP) are also revealed (Fig. S3).One can see S-C/In 2 O 3 HHP also possesses a hollow hexagonal prism-shaped structure.It indicates that the addition of suitable amount of CeO 2 cannot change the inherent morphology and structure of S-C/In 2 O 3 HHP.But high content of CeO 2 lead to the precipitation and aggregation behavior of surface nanoparticles (Fig. S4). The preparation process of sulfur-doped In 2 O 3 -CeO 2 hollow hexagonal prisms with carbon coating (S-C/In 2 O 3 -CeO 2 HHP) is illustrated in Fig. 2. Firstly, 1,4-benzenedicarboxylic acid reacts with In 3 and Ce 2 ions to form Ce-doped In-MIL-68 with the hexagonal prisms morphology (step I).The length-diameter ratio of Ce-doped In-MIL-68 hexagonal prisms can be adjusted by using different amounts of 1,4-benzenedicarboxylic acid.Upon increasing the amount of 1,4-benzenedicarboxylic acid, the length-width ratio of Ce-doped In-MIL-68 hexagonal prisms gradually increases (Fig. S5).Then the precursors were pyrolyzed in the presence of sulfur powder under an N 2 atmosphere.During the annealing process, the oxygen ions released from the decomposition of ligands (1,4-benzenedicarboxylic acid) react with the outward diffusing In and Ce ions within the In-MIL-68, resulting the formation of In 2 O 3 and CeO 2 nanoparticles.These nanoparticles are interconnected to form porous hollow nanowall while keeping the hexagonal prism morphology of the initial Ce-doped In-MIL-68 precursor (step II).Simultaneously, the reaction between organic ligands and sulfur powder promote organic ligands to decompose into H 2 O, CO 2 , and SO 2 gases, leading to the formation of sulfur-doped In 2 O 3 -CeO 2 hollow hexagonal prisms.The produced SO 2 gas was confirmed by the potassium permanganate method (Fig. S6).Meanwhile, some of formed anionic S 2- S1), which might be caused by its defect-related surface states.The defined mesoporosity (5-9 nm) of S-C/In 2 O 3 -CeO 2 HHP was generated from the decomposition of organic ligands in the precursor.The hollow porous hexagonal prism-shaped heterostructure with a large surface area provides more active sites and fast mass/charge transfer ability.Moreover, the hollow porous structure with large surface area and defect-related surface states can improve gas uptake capacity.As expected, the results of the CO 2 adsorption isotherms (Fig. 3d) showed that S-C/In 2 O 3 -CeO 2 HHP possessed significantly increased CO 2 adsorption capacity than the other samples, The higher affinity of S-C/ In the UV/Vis diffuse reflectance spectra, both In 2 O 3 HHP and CeO exhibit relatively poor photoabsorption in the visible-light region.But after carbon coating and S doping, the obtained samples exhibit significant absorption in the whole visible light region.Meanwhile, their optical absorption edges have obvious red-shift (Fig. S9a).The results showed that the sulfur doping and carbon coating could reduce the band gap due to the formation of additional intermediate electronic states produced by mixing O 2p orbital with S 2p orbital 53. The surface chemical states of elements in the S-C/In 2 O 3 -CeO 2 HHP were further detected by XPS technique.In the wide-scan XPS spectrum (Fig. 4a), In, Ce, O, S, and C elements were found in the S-C/In 2 O 3 -CeO HHP, and no other impurities were detected.In In 3d XPS spectrum (Fig. 4b), two peaks at 444.2 and 451.8 eV are assigned to the In 3d 5/2 and 3d 3/2 of In 2 O 3 HHP, respectively 54.The two peaks also exist in the In 3d XPS spectrum of S-C/In 2 O 3 -CeO 2 HHP, but these two peaks slightly shifted toward the lower binding energy side by 0.2 eV (Fig. 4b).The shift of the In 3d XPS peaks could originate from the strong interaction between In 2 O 3 and CeO 2 , which is conducive to improve the interfacial charge transfer behavior.In Fig. 4c, for CeO 2 , the two peaks at 897.2 and 915.25 eV are assigned to Ce 4 3d 5/2 and Ce 4 3d 3/2 , respectively.At the same time, the peaks appear at 883.91 and 902.34 eV correspond to the Ce 3 3d 5/2 and Ce 3 3d 3/2 respectively 55.The peaks at 888.51 and 906.74 eV correspond to the Ce 4 3d 5/2 and Ce 4 3d 3/2 , respectively.In the case of S-C/In 2 O 3 -CeO 2 HHP, these peaks exhibit a positive shift.Meanwhile more Ce 3 ions exist in S-C/In 2 O 3 -CeO 2 HHP, implying that oxygen vacancies are formed 42.The presence of oxygen vacancies in the S-C/In 2 O 3 -CeO 2 HHP was also confirmed by O 1 s core-level XPS (Fig. 4d).O 1 s was deconvoluted into three peaks corresponding to lattice oxygen (O L, 529.5 eV), oxygen vacancy (O v , 530.26 eV), and chemisorbed oxygen (531.8 eV) 56.The presence of O v indicates the existence of oxygen vacancies 56.Obviously, S-C/In 2 O 3 -CeO 2 HHP owns more oxygen vacancies than In 2 O 3 HHP 57.These results are in agreement with the Raman and EPR tests.The S 2p spectrum (Fig. 4e) can be deconvoluted two peaks at 161.7 and 163.1 eV belonging to S 2p 3/2 and S 2p 1/2 spin orbits, respectively, indicating that S 2-is the dominant species.The C 1 s XPS spectrum (Fig. 4f The above results demonstrate that S-doped heterostructured hollow hexagonal prisms with carbon coating contribute to improving the structure, optical and CO 2 adsorption properties of S-C/In 2 O 3 -CeO 2 HHP.Thus the enhanced photocatalytic performance towards CO 2 reduction reaction is expected.A gas-solid model was used in CO photoreduction reactions under ambient pressure.No photosensitizers and sacrificial reagents were introduced in the reaction system.Fig. 5a andb show the time-yield plots of CH 4 and CO generated from different catalysts under AM1.5 irradiation, respectively.The average evolution rates of CH 4 and CO were shown in Fig. 5c.In 2 O 3 HHP produced CO and CH 4 with a yield rate of 16.2 and 17.0 mol g -1 h -1 , respectively.The yield rates of CO and CH 4 over CeO 2 are 17.9 and 8.3 mol g -1 h -1 , respectively.Though the yield rates of CO and CH selectivity due to the small surface area.Strikingly, the optimized S-C/ In 2 O 3 -CeO 2 HHP sample exhibits the highest CH 4 evolving rate of 60.6 mol g -1 h -1 , which is far superior to that of other samples.Compared with S-C/In 2 O 3 HHP, the S-C/In 2 O 3 -CeO 2 HHP showed an improved CH 4 selectivity from 53.2 to 92.4.The results reveal that the sulfurdoped In 2 O 3 -CeO 2 heterostructured hollow hexagonal prisms with carbon coating can realize CO 2 deep photoreduction and selectively promote the conversion of CO 2 into CH 4 .The amount of oxygen generated in the process of CO 2 photoreduction with H 2 O was investigated according to the reported method 34.The results were shown in Table S3.For S-C/In 2 O 3 -CeO 2 HHP catalyst, the average yield of O 2 is 130.6 mol g -1 h -1 , which is close to the theoretical evolution rate of O 2 according to the redox reaction mechanism.The results confirm that the electrons for the CO 2 reduction come from the oxidation of water. The remarkable CO 2 reduction performance of S-C/In 2 O 3 -CeO 2 HHP might be related to the well-defined hollow hexagonal prism-shaped composite features with some favorable properties.First, hollow porous hexagonal prism architecture with a large surface area offers abundant active sites and promotes fast mass transport of reactants/ products.Second, the In 2 O 3 -CeO 2 heterojunction and surface oxygen vacancy defects favor the quick separation/ transfer of photoinduced charge carriers.Third, the sulfur-doping and carbon coating significantly enhance the visible light absorption ability of hybrids.Furthermore, the high affinity of S-C/In 2 O 3 -CeO 2 HHP toward CO 2 molecules can increase the chance of CO 2 capture and photoreduction.These significant factors contribute to the enhancement of photocatalytic performance and selectivity of CO 2 photoreduction over S-C/In 2 O 3 -CeO 2 HHP 58596061.As far as we know, these CO 2 photoreduction results exceed most of the reported photocatalysts without nobel metal cocatalysts and sacrificial reagent under similar gas-solid reaction models (Table S4).Notably, the S-C/In 2 O 3 -CeO 2 HHP shows durable activity for photocatalytic CO 2 reduction (Fig. 5d).The SEM image and XRD pattern of the S-C/In 2 O 3 -CeO 2 HHP after four cycles of CO 2 photoreduction testing demonstrate its intact morphology and structure stability (Fig. S10). To verify CH 4 and CO gas product come from CO 2 conversion over S-C/In 2 O 3 -CeO 2 HHP catalyst, several controlled experiments were conducted (Fig. 5e).No CH 4 and CO were detected without photocatalyst or under dark, further confirming that the CH 4 and CO generation was indeed driven by photocatalyst under light irradiation.When N 2 gas was used to replace CO 2 gas, no CH 4 and CO were detected under identical reaction conditions.Moreover, the physical mixture of S-C/ In surface defects in C/In 2 O 3 -CeO 2 act as photogenerated electron-hole recombination centers to increase the recombination chance of electrons and holes, resulting in an increased PL intensity compared with S-C/In 2 O 3 -CeO 2 HHP.Meanwhile, the strongest fluorescence quenching was observed for S-C/In 2 O 3 -CeO 2 HHP due to its moderate surface defects, indicating the fastest charge transfer and separation rate.Moreover, the charge separation was also monitored using TRPL spectroscopy (Fig. 6b).The average fluorescence lifetime of S-C/In 2 O 3 -CeO 2 HHP (8.31 ns) is longer than that of In 2 O 3 HHP (4.58 ns), In 2 O 3 -CeO 2 HHP (5.66 ns), and C/In 2 O 3 -CeO 2 (7.34 ns), which indicates the hollow hexagonal prism-shaped heterostructure and proper surface oxygen vacancy related defects can efficiently promote the charge separation and extend the lifetime of photoinduced charge carriers.So more photoinduced electrons can participate in the CO 2 photoreduction reaction (Table S5). In S6) of different components in S-C/In 2 O 3 -CeO 2 HHP were first determined combining with the bandgap energies calculated from the corresponding Tauc plots (Fig. S9b) of the DRS spectra, XPS valence band spectra (Fig. S14), and Fermi levels determined from Mott -Schottky plots (Fig. S15) 63.As shown in Fig. 7 which was confirmed by in situ DRIFT spectra (Fig. S17).Some peaks in the range of 1200-2000 cm -1 (e.g., 1727, 1578, 1390, and 1295 cm -1 ) can be assigned to some stretching vibrations of carboxy group, carboxylic acid and hydroxyl group 64.All these peaks can be belonged to COOH intermediates.The intermediates can be reduced to CH 4 with a small amount of CO.Meanwhile, photogenerated holes oxidate H 2 O to produce O 2 .Thus, the whole photoredox process is finished.In the CO 2 photoreduction process, the structure and surface state properties of S-C/In 2 O 3 -CeO 2 HHP also significantly affect the CO 2 photoreduction performance.In the hollow porous hexagonal prism-shape hybrid, the hollow porous hexagonal prism morphology can achieve enhanced light-harvesting by multiple incident light reflections within the interior hollow cavity.Suitable surface oxygen vacancy defects produced from the pyrolysis in the presence of sulfur powder accelerate transfer and separation of charge carriers, enhance visible-light utilization and CO 2 chemisorption, and expose more catalytic active sites.The formation of a thin amorphous carbon layer further enhance visible light absorption ability, increase the affinity toward CO 2 molecules and photoreduction ability.The synergistic effects of sulfur-doping, carbon coating, and unique hollow porous hexagonal prism morphology make the optimized hybrid sample exhibit outstanding gas phase CO 2 photoreduction performance with a high CH 4 yield rate (60.6 mol g -1 h -1 ) and selectivity (92.4) without noble metal and organic photosensitizer, which are superior to that of other control samples including In 2 O 3 -CeO 2 , C/In 2 O 3 -CeO 2 , and other single-component catalysts."
  },
  {
    "title": "Conclusions",
    "content": "In summary, we have rationally designed and prepared sulfur doped In 2 O 3 -CeO 2 hollow hexagonal prism-shaped photocatalyst with a thin carbon coating through the synthesis of Ce-doped In-MIL-68 hexagonal prisms and subsequent pyrolysis process in the presence of sulfur powder.The carbon-coated hollow porous hexagonal prism composites hold unique structural and component features with various favorable properties.The introduction of CeO 2 nanoparticles and carbon layer facilitate the charge transfer and separation, and therefore improve the gas-phase photocatalytic CO 2 reduction activity.The multiple reflections in the hollow porous hexagonal prisms provide more active sites, high light utilization, and fast mass transport of reactants/products.Meanwhile, the oxygen vacancy related surface defects can further improve these advantages.Consequently, the synergetic catalytic effect of these benefits enable the optimized hybird catalyst to exhibit remarkable CH 4 yield rate (60.6 mol g -1 h -1 ) and high selectivity (92.4) with outstanding stability.This work provides rational guidelines for architecture design and compositional control of hybrid catalysts to improve solar energy utilization and conversion efficiencies. Fig.2.Firstly, 1,4-benzenedicarboxylic acid reacts with In 3 and Ce 2 ions to form Ce-doped In-MIL-68 with the hexagonal prisms morphology (step I).The length-diameter ratio of Ce-doped In-MIL-68 hexagonal prisms can be adjusted by using different amounts of 1,4-benzenedicarboxylic acid.Upon increasing the amount of 1,4-benzenedicarboxylic acid, the length-width ratio of Ce-doped In-MIL-68 hexagonal prisms gradually increases (Fig.S5).Then the precursors were pyrolyzed in the presence of sulfur powder under an N 2 atmosphere.During the annealing process, the oxygen ions released from the decomposition of ligands (1,4-benzenedicarboxylic acid) react with the outward diffusing In and Ce ions within the In-MIL-68, resulting the formation of In 2 O 3 and CeO 2 nanoparticles.These nanoparticles are interconnected to form porous hollow nanowall while keeping the hexagonal prism morphology of the initial Ce-doped In-MIL-68 precursor (step II).Simultaneously, the reaction between organic ligands and sulfur powder promote organic ligands to decompose into H 2 O, CO 2 , and SO 2 gases, leading to the formation of sulfur-doped In 2 O 3 -CeO 2 hollow hexagonal prisms.The produced SO 2 gas was confirmed by the potassium permanganate method (Fig.S6).Meanwhile, some of formed anionic S2-are localized in the In 2 O 3 -CeO 2 lattice in the form of In-O-S and Ce-O-S bond-linkages.Moreover, the pyrolysis of organic ligands leads to the formation of a thin amorphous carbon layer around the In 2 O 3 and CeO 2 nanoparticles, which can be seen from the HRTEM image (Fig. 1f), leading to the formation of sulfur-doped In 2 O 3 -CeO 2 hollow hexagonal prisms with Fig. 2. Schematic illustration of the synthetic procedure of S-C/In 2 O 3 -CeO 2 HHP: (I) Formation of Ce-doped In-MIL-68 hexagonal prisms and (II) thermal annealing in the presence of sulfur powder under N 2 atmosphere. Fig. 3. (a) XRD patterns of a) CeO 2 , b) In 2 O 3 , c) S-C/In 2 O 3 HHP, and d) S-C/ In 2 O 3 -CeO 2 HHP.(b) Raman spectra.(c) Nitrogen adsorption and desorption isotherms (inset: pore size distribution).(d) Volumetric CO 2 adsorption isotherms at 273.15 K. (e) Temperature-programmed desorption (TPD) spectra.(f) Electron paramagnetic resonance (EPR) spectra. Fig. 4. Wide-scan XPS spectra (a), high-resolution XPS spectra of In 3d (b), Ce 3d (c), O 1 s (d), S 2p (e), and C 1 s (f) of different samples. ) can be fitted by four peaks related to C-S bond (284.2eV), C C bond (284.8 eV), C-O bond (285.8 eV), and C O bond (288.9 eV). Fig. 5. Time-yield plots of CH 4 (a) and CO (b) generated from photocatalytic CO 2 reduction over different catalysts under AM1.5 irradiation, (c) the average CO and CH 4 yields of photocatalytic CO 2 conversion, (d) cycling production of CH 4 and CO generated from S-C/In 2 O 3 -CeO 2 HHP catalyst, (e) the average CO and CH 4 yields under different conditions, (f) the gas chromatography-mass spectrometry analysis over S-C/In 2 O 3 -CeO 2 HHP in the photoreduction of 13 CO 2 . Fig. 6.(a) Fluorescence spectra, (b) time-resolved fluorescence (TRPL) spectra, (c) transient photocurrent responses, and (d) EIS Nyquist plots of the samples. photoelectrochemical tests, transient photocurrent density (57.8 A cm -2 ) of S-C/In 2 O 3 -CeO 2 HHP is superior to that of In 2 O 3 (20.5 A cm -2 ), In 2 O 3 -CeO 2 (31.6 A cm -2 ), and C/In 2 O 3 -CeO 2 (37.6 A cm -2 ) under AM1.5 irradiation (Fig. 6c), indicating the improved charge separation efficiency in S-C/In 2 O 3 -CeO 2 HHP, which is consistent with the result of steady-state PL spectra.Moreover, the chronoamperometry current-time response of S-C/In 2 O 3 -CeO 2 HHP is stable.The enhanced charge transport kinetics in S-C/In 2 O 3 -CeO 2 HHP is also confirmed by the results of the electrochemical impedance spectra (EIS).The EIS Nyquist spectra in Fig. 6d show that S-C/In 2 O 3 -CeO 2 HHP possesses a smaller semicircle than the other samples, demonstrating its extremely low charge transfer resistance, which leads to accelerated separation/ transfer of photoinduced charge carriers.According to the above demonstration, the underlying mechanism for the enhanced CO 2 photoreduction performance of S-C/In 2 O 3 -CeO 2 HHP is expected to understand.The energy band positions (Table and Fig. S16, the proper redox potentials of S-C/In 2 O 3 and S-C/CeO 2 can realize the photoreduction of CO 2 to CO and CH 4 .Compared with pure In 2 O 3 and CeO 2 , sulfur doping and carbon coating could introduce new impurity levels between the conduction band (CB) and valence band (VB), thus more photoinduced electrons and holes can be excited and transfer to the CB and VB to participate in redox reactions, respectively.Under AM1.5 irradiation, photoinduced carriers are excited in S-C/In 2 O 3 -CeO 2 HHP, the photoinduced electrons in the CB of S-C/CeO 2 will migrate to that of S-C/ In 2 O 3 HHP driven by the inner electric field.While the holes in the VB of S-C/In 2 O 3 transfer to that of S-C/CeO 2 .The accumulated electrons (e -) on S-C/In 2 O 3 reduce CO 2 to form intermediate product (e.g., CO 2 -), The authors acknowledge the financial supports from the National Natural Science Foundation of China (No. 22072037, 51772079) and the Natural Science Foundation of Heilongjiang Province of China (LH2020B018). The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://doi. org/10.1016/j.cej.2021.129968."
  }
]