[
  {
    "title": "Doi",
    "content": "10.1016/j.cej.2021.132456"
  },
  {
    "title": "Article_Title",
    "content": "Formation of hierarchical Bi2MoO6/ln2S3 S-scheme heterojunction with rich oxygen vacancies for boosting photocatalytic CO2 reduction"
  },
  {
    "title": "Abstract",
    "content": "Employing photocatalytic technology to promote CO 2 photoreduction into carbon fuels is of great significance to the field of renewable energy.Herein, the hierarchical Bi 2 MoO 6 In 2 S 3 heterostructured nanotubes rich in surface oxygen vacancies (SOVs) are synthesized by a multi-step control strategy for visible-light-driven CO 2 reduction.The combination of density functional theory (DFT) calculations and in-situ X-ray photoelectron spectroscopy (ISI-XPS) confirms the existence of the S-scheme charge transfer mechanism and SOVs, which will accelerate the separation of charges and ameliorate the redox capability.Additionally, the unique hierarchical hollow architectures also effectively promote the efficiency of light utilization and provide abundant reactive sites.Consequently, the optimized Bi 2 MoO 6 -SOVsIn 2 S 3 heterogeneous nanotubes display remarkable activity under visible light irradiation, with the yield rate and selectivity for CO-generation are 28.54 mol g -1 h -1 and 94.1, respectively.This work provides new opportunities for the design of hierarchical hollow heterojunctions with an S-scheme charge transfer mechanism for effective photocatalytic CO 2 reduction."
  },
  {
    "title": "Experimental",
    "content": "All reagents and chemicals were commercially available and used without further treatment.Indium nitrate hydrate (In (NO 3 ) 3 xH 2 O, 99.9), N, N-Dimethylformamide (DMF, 99.5), Bismuth nitrate pentahydrate (Bi (NO 3 ) 3 5H 2 O, 99.0), Thiourea (CH 4 N 2 S, 99.0) and N, N, N , N -tetramethylethylenediamine (TMEDA, 99.0) were all obtained from Aladdin Reagent Co., Ltd. In a typical procedure, 420 mg of In (NO 3 ) 3 xH 2 O and 200 mg of H 2 BDC were co-dissolved in 5 mL of DMF and stirred rapidly for 30 min.Afterward, the resultant solution was transferred into a 50 mL Teflonlined autoclave maintaining at 100 C for 24 h.After being completely cooled to room temperature, the obtained product was collected by high-speed centrifugation at 8000 rpm for 10 min, and washed several times with DMF.Finally, the product was immersed in anhydrous methanol to remove impurities for further use. To further synthesize In 2 S 3 nanotubes, 100 mg of obtained MIL-68 (In) hexagonal prisms were dispersed in 25 mL of ethanol solution containing 500 mg of thiourea and ultrasonicated for 15 min.Subsequently, the above solution was put into a 50 mL Teflon-lined stainlesssteel autoclave maintaining at 180 C for 24 h.After being cooled to room temperature, the reddish-brown precipitate was separated by high-speed centrifugation at 8000 rpm for 10 min, and washed several times with ethanol and deionized water.Finally, the obtained product was transferred to anhydrous methanol to eliminate excess thiourea, and dried in a vacuum at 60 C.And for ease of description, the obtained product was named IS. Typically, 1.3 mmol of Bi (NO 3 ) 3 5H 2 O and 0.65 mmol of Na 2 MoO 4 2H 2 O were thoroughly dissolved in 5 mL of ethylene glycol under vigorous stirring.Then, the obtained X mmol of In 2 S 3 nanotubes (X 0.6, 0.8, 1, 1.2) were dispersed into the above solution, followed by 30 mL of absolute ethanol was added and stirred for 60 min.After that, 0.5 mL of TMEDA was added dropwise to the above solution.After vigorously stirring for 30 min, the above mixed solution was poured into a 50 mL Teflon-lined stainless-steel autoclave and kept at 160 C for 24 h.After being completely cooled to room temperature, the obtained product was washed with ethanol and deionized water, and dried in a vacuum at 60 C.And by changing the content of In 2 S 3 nanotubes, the obtained samples were labeled as BMO, BMO/IS-0.6,BMO/IS-0.8,BMO/IS-1, and BMO/IS-1.2. And under the same experimental conditions, Bi 2 MoO 6 In 2 S 3 and pure-phase Bi 2 MoO 6 were also obtained for comparison without adding TMEDA or In 2 S 3 nanotubes, and labeled as BM/IS and BM, respectively. Microscopic morphology and elemental distribution images of the synthesized samples were captured using Hitachi S-4800 field emission SEM (scanning electron microscope) and X-ray EDS (energy dispersive spectrometer).The morphological characteristics of the samples were further recorded by performing the JEM-2100 TEM (transmission electron microscope) at an acceleration voltage of 200 kV.The crystallography was investigated by performing PXRD (powder X-ray diffraction) tests on a MAC M18XHF Diffractometer using Cu K radiation (1.54 A).The resonance Raman spectrum was measured on an inVia-Reflex spectrometer system with a laser wavelength of 532 nm.Room-temperature EPR (electron paramagnetic resonance) spectra of sample powder was recorded on the Bruker EMXplus EPR spectrometer to detect oxygen vacancies, with microwave power and modulation frequency were 6.325 mW and 100 kHz, respectively.The temperature programmed oxidation (TPO) measurement was performed on an AutoChem 2920 automatic chemical adsorption analyzer equipped with a TCD detector, and the samples were heated from 40 C to 600 C at a rate of 10 C min -1 under a mixed gas of 5 vol O 2 /He (50 mL min -1 ).N 2 adsorption and desorption measurements were implemented on an ASAP 2020 V3.00H system at 77 K to evaluate the specific surface area of the obtained samples.Pore volume and pore size distribution were further recorded via using the Barrett-Joyner-Halenda (BJH) method.XPS (X-ray photoelectron spectroscopy) and UPS (ultraviolet photoelectron spectroscopy) on the Thermo ESCAB250 XPS system were executed to reveal element composition and energy level status.The insitu X-ray photoelectron spectroscopy (ISI-XPS) was recorded by an ultra-high vacuum ESCALAB 250 spectrometer equipped with LED lights ( 365 nm).The optical characteristics of the samples were monitored via UV-Vis DRS spectra recorded on a U-4100 spectrophotometer with BaSO 4 as a reference.The PL (photoluminescence) and transient fluorescence decay spectra of the synthesized samples were characterized on Hitachi F-4500 and FLUORMAX-4P spectrometers.Electrochemical impedance spectroscopy (EIS) and transient photocurrent response tests were performed on the CHI660D electrochemical workstation (Shanghai Chenhua Co., Ltd.) with a conventional three-electrode mode. The photocatalytic CO 2 reduction activity of the obtained samples was evaluated in a 100 mL Pyrex reactor.The 30 mg sample was dispersed in 50 mL ultrapure water.After the reactor was degassed for 30 min, high-purity CO 2 gas (99.999) was pumped into the system to reach 1 atmosphere pressure.Simultaneously, circulating water was used to maintain the reaction temperature at 25 C. The reaction mixture was continuously stirred magnetically and irradiated under a 300 W Xe lamp ( 420 nm) to initiate a photocatalytic reaction.After 4 h of reaction, the products were analyzed through an Agilent 7890B GC equipped with a thermal conductivity detector (TCD) and a flame ionization detector (FID).The isotope labeling experiment was performed by using 13 CO 2 to replace the 12 CO 2 atmosphere, and the product was detected by GC-MS method. To evaluate the stability, five consecutive catalytic reactions were carried out, and the catalytic system was purged with CO 2 for 30 min without adding more catalyst before the next photocatalytic reaction started.In addition, the apparent quantum efficiency (AQE) of the BMO/ IS-1 sample was evaluated under the same photocatalytic reaction conditions.The monochromatic light source was designated as radiation source, where the light intensity was 21 mW/cm 2 and the light area was 28.274 cm 2 .After 4 h of light irradiation, the CO produced was collected.And the AQE of CO evolution was calculated by the following formula: the number of reacted electrons the number of incident photons 100 the number of evolved CO molecules 2 the number of incident photos 100 DFT calculations provide a detailed understanding of the electronic state of the photocatalysts, understanding their structure and electronic properties will lead to significant photocatalytic efficiency, which is important for the design and manufacture of efficient photocatalysts.More calculation details were described in the Support information."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The overall synthesis route for the construction of hierarchical Bi 2 MoO 6 -SOVIn 2 S 3 heterojunction nanotubes is schematically displayed in Fig. 1.First, the MIL-68 (In) hexagonal prisms were obtained through the self-assembly method.Then, hollow In 2 S 3 nanotubes were reasonably constructed by a liquid-phase sulfidation treatment with MIL-68 (In) hexagonal prisms as the precursor.Subsequently, the hierarchical Bi 2 MoO 6 In 2 S 3 heterostructure was formed by growing Bi 2 MoO 6 NSs layers on the surface of the hollow In 2 S 3 nanotubes via the solvothermal method.Finally, by adding an appropriate amount of TMEDA, oxygen vacancies were introduced into the surface of the ultrathin Bi 2 MoO 6 NSs subunits to create hierarchical Bi 2 MoO 6 -SOVsIn 2 S heterojunction nanotubes. The typical surface morphologies and structures of the resultant samples were characterized using field-emission scanning electron microscopy (FESEM) and transmission electron microscopy (TEM).As displayed in Fig. 2a, the synthesized In 2 S 3 sample well inherits the onedimensional (1D) morphology from the In-MIL-68 precursor (Figure S1), and is further transformed into a hollow nanotube shape with a rough surface.The magnified FESEM image distinctly presents that the opening contour of the In 2 S 3 nanotube, with a diameter of about 2 m (Fig. 2b).Afterward, ultrathin Bi 2 MoO 6 NSs are grown uniformly and densely on the surface of In 2 S 3 nanotubes to form hierarchical Bi 2 MoO 6 ln 2 S 3 tubular heterostructures (Fig. 2c).Interestingly, with the introduction of SOVs, the surface Bi 2 MoO 6 NSs gradually evolved into irregular nanoparticles (Fig. 2d), which is consistent with previous reports 45,46.And SEM images of pure Bi 2 MoO 6 nanoparticles were also obtained for comparison (Figure S2).Moreover, these structural features were further revealed through TEM and HRTEM images.Fig. 2e displays a representative TEM image of the BMO/IS-1 sample to confirm the successful construction of the hierarchical hollow core-shell configuration.As shown in Fig. 2f and2 g, the close heterogeneous interface between In 2 S 3 and Bi 2 MoO 6 can be observed, and the lattice fringes with a lattice spacing of 0.32 nm and 0.275 nm correspond to the (3 1 1) crystal plane of In 2 S 3 and the (2 0 0) crystal plane of Bi 2 MoO 6 , respectively 17,23.Importantly, some disordered fringe spacing can be observed on the surface of Bi 2 MoO 6 NSs, which is attributed to the surface structure damage caused by SOVs 44,45.The selected area of electron diffraction (SAED) emphasizes this crystal defect and polycrystalline characteristics (inset in Fig. 2g).The elemental mappings distinctly reveal that the homogeneous distribution of Bi, Mo, O, In and S elements in the selected area (Fig. 2h andFig S3), which confirms that uniform longitudinal interface junctions is formed between In 2 S 3 shell and Bi 2 MoO 6 -SOVs layers. The crystal structures and phase compositions of as-synthesized catalysts were elucidated by conducting powder X-ray diffraction (PXRD).As disclosed in Figure S4, for MOF-derived In 2 S 3 nanotubes, all diffraction signals can be well-indexed to cubic In 2 S 3 (JCPDS no.65-0459) 47.Additionally, no diffraction signal belonging to the MIL-68 (In) hexagonal prisms is detected, demonstrating that the conversion process has been fully implemented (Figure S5).With the introduction of ultrathin Bi 2 MoO 6 NSs, identifiable diffraction signals from orthorhombic Bi 2 MoO 6 can be captured in the hybrid photocatalysts (Fig. 3a).The characteristic diffraction peaks at 28.3 , 32.6 , 47.2 , 55.4 , and 58.6 can be well coincided with the (1 3 1), (2 0 0), (2 0 2), (3 3 1) and (2 6 2) crystal planes of Bi 2 MoO 6 (JCPDS no.76-2388), respectively 17,18.Remarkably, no obvious diffraction signals belonging to In 2 S are observed in the hybrid photocatalysts, which is attributed to the lower crystallinity and partial signal overlap.And the diffraction signals of BMO and BMO/IS composite catalysts are almost identical and no other impurities can be detected, reflecting that the formation process of SOVs has no significant effect on the crystal structure 48,49. The surface defect states and structure characteristics of the asprepared samples were further surveyed through Raman spectroscopy (Fig. 3b).For all the as-prepared samples, the well-defined phonon modes can be well matched to the stretching vibration and bending modes of the Bi 2 MoO 6 vibration mode 19.Nevertheless, for BMO/IS composite catalysts and BMO, the Raman mode intensities 2 change significantly at 138 cm -1 and 193 cm -1 , which may be ascribed to the partial oxygen loss of Bi-O bonds caused by a high concentration of SOVs 50.Furthermore, due to the Bi 2 MoO 6 surface damage caused by the high concentration of oxygen vacancies, the intensity of all peaks in the BMO/IS composite catalyst and BMO are significantly attenuated.The state and concentration of oxygen vacancies in the as-prepared samples are also confirmed by performing EPR analysis.As shown in Fig. 3c, all samples display significant EPR signals at g 2.004, which is consistent with the typical signals of oxygen vacancies 50.Obviously, the EPR signal peaks of the BMO/IS composite catalysts and BMO are significantly higher than that of BM/IS, indicating that the presence of higher SOVs concentration.Moreover, the oxygen vacancy concentrations of all samples obtained quantitatively are shown in Figure S6a.Interestingly, the oxygen vacancy concentration of BMO/IS composite catalysts is almost the same as that of BMO, reflecting the introduction of IS has a negligible effect on the oxygen vacancy concentration.And the results of temperature-programmed oxidation (TPO) also show that all BMO/IS composite samples have a higher oxygen vacancy concentration to provide stable carrier transport and promote the adsorption of gas molecules (Figure S6b). The N 2 adsorption-desorption isotherms of BM, BMO, BM/IS, and BMO/IS-1 are illustrated in Fig. 3d, all of which reveal typical IV isotherm accompanied by an H3 hysteresis loop in the relative pressure range of P/P o 0.4-1.0,implying that the mesoporous structures have been successfully constructed.The pore size distribution curves determined by Barrett-Joyner-Halenda (BJH) analysis display their average pore-size distribution of 38.4,23.9, 20.1, and 21.3 nm, respectively (inset of Fig. 3d), aligned with the contours of the isotherms 51.And the Brunauer-Emmett-Teller (BET) specific surface region of BM, BMO, BM/IS and BMO/IS-1 reach 18.17, 17.14, 74.98, and 41.82 m 2 /g, with a total pore volume of 0.174, 0.108, 0.375, and 0.222 cm 3 /g, respectively (Table S1).Obviously, compared with BM and BMO, BM/IS and BMO/ IS-1 retain larger specific surface area and pore volume, implying that the agglomeration of Bi 2 MoO 6 NSs is effectively ameliorated.Simultaneously, BMO/IS-1 will provide more contact area and target active sites between the electrolyte/catalyst, and accelerate the transfer of reactants to promote the heterogeneous catalysis in the energy conversion devices 52. The chemical compositions and surface electronic states of the resultant samples were further explored by implementing the XPS strategy.In the survey spectrum of BMO/IS-1 (Figure S7), the presence of Bi, Mo, O, In and S elements can all be clearly detected, accompanied by strong characteristic peaks.The Bi 4f spectrum of BMO is revealed in Fig. 4a, and the two main peaks at 159.1 and 164.4 eV can be indexed to Bi 4f 7/2 and Bi 4f 5/2 of Bi 3 , respectively 53.And compared with BMO, these signal peaks in BMO/IS-1 shifted towards lower binding energies to 158.9 and 164.2 eV.For the scanned spectrum of Mo 3d (Fig. 4b), the signals at 232.2 and 235.4 eV could be assigned to Mo 3d 5/2 and Mo 3d 3/ 2 of Mo 6 , respectively, being 0.3 eV higher than those of BMO/IS-1 19,54.And the deconvoluted high-resolution O 1 s spectrum of BMO contains three peaks (Fig. 4c), of which the peaks at 529.9 and 530.8 eV are attributed to the Bi-O and Mo-O bonds, while the peak at 531.9 eV is assigned to the presence of oxygen vacancies 41,55.For BMO/IS-1, the peak of the Bi-O bond is lower than that of BMO, which means that more O atoms are removed.As revealed in Fig. 4d, the high-resolution In 3d spectrum of IS displays two significant photoelectron peaks at 444.6 and 452.2 eV, which are dominated by In 3d 5/2 and In 3d 3/2 , respectively.As shown in Figure S8, the high-resolution XPS spectra of S 2p is deconvolved into two main photoelectron peaks at 161.4 and 163.2 eV assigned to the S 2p 3/2 and S 2p 1/2 states 23,56.Moreover, these characteristic peaks in BMO/IS-1 have slight shifts towards higher binding energies.Interestingly and prominently, the binding energies of Bi 4f, Mo 3d, and O 1 s in BMO/IS-1 have become more negative as compared with those of BMO, while the binding energies of In 3d and S 2p display slight positive shifts in comparison with those of IS.As we know, the migration shifts in the binding energies can be attributed to the changed electronic density caused by electron migration 57.Therefore, it can be inferred that the interface electrons are transferred from In 2 S 3 to Bi 2 MoO 6 -SOVs upon hybridization, which facilitates the formation of S-scheme heterojunctions and accelerates the separation of electron-hole pairs. With the purpose of revealing the interface charge redistribution within duplicate semiconductor heterostructures, the work function () was evaluated by comparing the energy difference between the vacuum and the Fermi level based on the electrostatic potential of a material 25.As displayed in Fig. 4e and4f, the work functions of the Bi 2 MoO 6 -SOVs (0 0 4) and In 2 S 3 (2 2 0) are 5.22 and 4.67 eV (vs.Vacuum), respectively, demonstrating that the work function of In 2 S 3 is lower than that of Bi 2 MoO 6 -SOVs.When they are in close contact, electrons will spontaneously flow from In 2 S 3 into Bi 2 MoO 6 -SOVs to enable their phases at the same Fermi level.Eventually, the In 2 S 3 side is positively charged, while the Bi 2 MoO 6 -SOVs side is negatively charged.Such electron transfer will cause the band edge of Bi 2 MoO 6 -SOVs or In 2 S 3 to bend downward or upward, respectively, and establish an internal electric field (IEF) from In 2 S 3 to Bi 2 MoO 6 -SOVs at the heterogeneous interface 26.These results are highly consistent with those obtained by XPS and are beneficial to improve the CO 2 photoreduction activity. The UVvis diffuse reflectance spectra (DRS) were employed to identify the light absorption properties of the synthesized samples in different wavelength regions, and the results are shown in Fig. 5a.The pristine BM exhibits poor visible-light absorption, and its absorption edge is about 470 nm.For MOF-derived In 2 S 3 nanotubes (IS), the light absorption boundary is about 580 nm, which is in accordance with previous reports 37.Evidently, the absorption edge of BMO shows a slight red-shift compared to that of BM, signifying that the presence of SOVs could be in favor of the light-harvesting.More importantly, after combining with IS, BM/IS and BMO/IS composite catalysts exhibit stronger light absorption extending to most of the visible-light region.And as the IS content increases, the optical absorption window of the BMO/IS composite catalyst is enlarged.It can be concluded that the construction of SOVs and heterostructure both help to ameliorate the visible-light harvesting of the samples, which will effectively increase the potential yields of electron-hole pairs to boost photocatalytic redox reaction.From the Tauc plots (Fig. 5b), the bandgap energies (Eg) of BM, BMO, and IS are estimated to be 2.74, 2.68 and 2.16 eV, respectively.To investigate the redox potentials of BMO/IS-1, UV photoelectron spectroscopy (UPS) tests were also performed (Fig. 5c).According to the linear intersection method, the maximum valence band values (E VB ) of BMO and IS are estimated to be 2.32 and 1.42 eV (vs.NHE), respectively.Furthermore, the conduction band values (E CB ) of BMO and IS can be determined to be -0.36 and -0.74 eV (vs.NHE) according to the formula: E VB Eg E CB 58.Consequently, the band structures of BMO and IS can be derived, as shown in Fig. 5d.Perceptibly, the energy band of BMO can be well matched with that of IS, while satisfying the thermodynamic conditions of photocatalytic CO 2 reduction reaction. The photoactivity of the resultant samples were evaluated by conducting photoreduction experiments of CO 2 under continuous visible-light irradiation ( 420 nm) without the presence of any cocatalysts, sacrificial agents or photosensitizers.During the photoreduction process, the main reduction products in the system are CO and H 2 , while the main oxidation product is O 2 , with no detectable CH 4 or liquid products, which is consistent with previous reports in similar systems 37,44.This may be due to the fact that the two-electron reduction pathways have more favorable reaction kinetics than the multi-electron reduction process.As shown in Fig. 6a, due to the rapid charge recombination, the pristine BM and IS both displays relatively lower photocatalytic CO 2 reduction activity, with the CO-evolution rates of 1.64 and 4.31 mol g -1 h -1 , respectively.Nevertheless, BMO displays enhanced CO 2 -to-CO conversion activity (CO-evolving rates: 3.67 mol g -1 h -1 ) compared with pristine BM, signifying that the formation of SOVs helps to improve photoactivity.In sharp contrast, the CO 2 reduction rates of the BMO/IS-X (X 0.6, 0.8, 1, 1.2) catalysts are significantly increased when after combining with IS.Particularly, the BMO/IS-1 manifests the highest CO-production rate of 28.54 mol g -1 h -1 , which is nearly 7.78 times and 6.62 times that of BMO and IS, respectively.This CO evolution rate compares favorably to the previously reported values achieved for Bi-based homogeneous catalysts and some other similar systems (Table S3).Simultaneously, BMO/IS-1 also has a high selectivity for CO generation (94.1), and the BMO/IS-1 catalyst delivers a high apparent quantum efficiency (AQE) of 2.11 under 420 nm monochromatic light irradiation.The outstanding CO 2 -to-CO conversion performance of the BMO/IS-1 catalyst can be attributed to the hierarchical hollow structure, the high-efficiency carrier separation, and the strong redox ability of electrons and holes brought by the S-scheme heterojunction 59,60.As presented in Fig. 6b, the variation tendency of CO/H 2 generation qualitatively follows the characteristic absorption spectrum of the BMO/IS-1 material, powerfully supporting that the CO 2 photoreduction is driven by the inter-band transition electrons of the BMO/IS-1 catalyst. The control experiments of the BMO/IS-1 sample were performed by changing experimental parameters, and the results are depicted in Fig. 6c.The physical mixture of BMO and IS shows inferior CO 2 conversion performance compared with the BMO/IS-1, reflecting the importance of close interface contact and strong interaction in the heterojunction.In the absence of a light source or catalyst, no obvious product was observed in the reactor, implying that the CO 2 reduction reaction is triggered by photocatalysis.When high-purity N 2 atmosphere was used instead of CO 2 as the reaction gas, only trace amounts of H 2 were detected, indicating that CO product is the result of decomposition of the CO 2 raw materials.To further trace the source of CO product, 13 Clabelled isotope experiments were also implemented (Fig. 6d), and the obtained products were detected by gas chromatography-mass spectrometry (GC-MS).The results obtained from the GC-MS analysis display that only CO with an m/z value of 29 was detected, signifying that the evolved CO is indeed originated from the CO 2 photoreduction process over the BMO/IS-1 catalyst.Besides, the long-term performance evaluation displays that the products almost continuously increase with the reaction time, and the reaction rate of the BMO/IS-1 catalyst is not significantly lost after photoreaction for 12 h, reflecting that the construction of the core-shell structure effectively inhibits the photocorrosion of sulfides (Fig. 6e).To further evaluate stability, the BMO/IS-1 catalyst was repeatedly used to perform the CO 2 reduction reaction, and the results show that the BMO/IS-1 still retains outstanding photoreduction activity and high selectivity after five cycles (Fig. 6f).More importantly, the XRD and TEM results obtained after the cycle tests also support the structural stability of the catalyst (Figure S9 andS10).Based on the above results, it is concluded that the optimized BMO/IS-1 is a promising photocatalyst that can effectively and continuously initiate the CO 2 reduction reaction. To explicate the intrinsic mechanism of high performance of BMO/ IS-1, the room-temperature steady-state photoluminescence (PL) analysis and time-resolved photoluminescence (TRPL) spectra of the asprepared samples were resolved.As illustrated in Fig. 7a, the intensity of the emission peak of BMO at about 420 nm is lower than that of BM, which is due to the effective charge transfer caused by the electron trapping effect of SOVs 31.Additionally, the PL intensity of BMO/IS composite samples display obvious quenching compared with BMO and BM/IS, reflecting that the synergistic effect of IEF and SOVs further promotes the separation of photogenerated electron-hole pairs and restrains their recombination rates.And BMO/IS-1 shows the weakest PL intensity, which demonstrates that BMO/IS-1 possesses the optimal BMO/IS combination ratio to achieve rapid charge transfer at the heterogeneous interface.To gain some insights into the dynamic charge migration of the samples, the time-resolved photoluminescence (TRPL) spectra were also recorded as portrayed in Fig. 7b.All the obtained analysis results can be well fitted by the exponential decay model, and the average fluorescence lifetime of the samples decreases in the following order: BMO/IS-1 (0.396 ns) BM/IS (0.127 ns) BMO (0.039 ns) BM (0.018 ns).The significantly prolonged fluorescence lifetime of BMO/IS-1 demonstrates that the high-speed charge transport channels constructed on the heterogeneous interface are beneficial to the rapid migration of carriers.Theoretically, the improved carrier separation and prolonged carrier lifetimes in BMO/IS-1 will promote the process of heterogeneous photocatalysis. To further validate our perception, photoelectrochemical characterizations were performed to investigate the migration of photoinduced charges.Fig. 7c displays the transient photocurrent density curves of the as-prepared catalysts under chopping light irradiation (illumination-off period: 400 s).All samples possess rapid and steady photocurrent responses when switching the light source on and off.Apparently, BMO/ IS-1 exhibits the strongest photocurrent response density, signifying the promoted generation and transfer of photogenerated charges in BMO/IS-1 61,62.And this conclusion is also supported by the EIS Nyquist curves, as exhibited in Fig. 7d.The diameter of the highfrequency semicircle of BMO/IS-1 is significantly reduced in the case of irradiation, implying that a lower charge-transfer resistance in BMO/ IS-1 that permits more efficient separation and transport of photogenerated carriers.The above photoelectrochemical characterization results display good consistency, which collectively supports that the construction of the IEF at the heterogeneous interface enables advance the photogenerated charge separation of BMO/IS-1, and it is further enhanced by SOVs modification. First-principles calculations at the spin-polarized density functional theory (DFT) level were also utilized to explore the electronic structure and electron flow manner in BMO/IS-1.The energy band structures and partial density of states (PDOS) of Bi 2 MoO 6 -SOVs and In 2 S 3 were further determined.Fig. 8a and 8b evidently reveal that both Bi 2 MoO 6 -SOVs and In 2 S 3 are direct bandgap semiconductors according to the positions of the valence band maximum (VBM) and conduction band minimum (CBM) at the same K points 63,64.The band gaps of Bi 2 MoO 6 -SOVs and In 2 S 3 are shown to be 2.44 eV and 2.08 eV, respectively, which are basically consistent with the experimental results of the DRS above (Fig. 8c and8d).Furthermore, as seen in the PDOS curves, the VB of In 2 S 3 is mainly contributed by the S 2p orbital, while the CB is determined by the hybridization of the In 3d and S 2p orbitals.Similarly, for Bi 2 MoO 6 -SOVs, VB and CB are mainly contributed by Bi 4f and O 1 s orbitals, respectively.Therefore, in accordance with the charge changes of the elements in XPS, it can be further confirmed that the S-scheme charge transfer mechanism exists in the hybrid photocatalysts 25,26.This reasonable charge transfer will promote the consumption of ineffective electrons and holes, while endowing BMO/IS-1 with better photocatalytic redox capability.Moreover, the influence of oxygen vacancies on the electronic structure of Bi 2 MoO 6 was also investigated by the comparison with the pristine Bi 2 MoO 6 , and the related structure diagrams are revealed to illustrate the location of oxygen vacancies removed in the calculation (Figure S11).As shown in Figure S12, for pristine Bi 2 MoO 6 , VB is mainly contributed by the O 1 s orbitals, while CB is mainly determined by the hybridization of Bi 4f, Mo 3d, and O 1 s orbitals.Besides, it can be observed that the new defect levels in Bi 2 MoO 6 -SOVs lead to the reduction of VBM from 2.51 eV to 2.44 eV, consistent with the results obtained by DRS.Simultaneously, these defect levels will also act as an effective electronic pedal to retard the charge accumulation on the CB of Bi 2 MoO 6 38,39.Generally, the work function () represents the minimum energy required for charge transfer from the surface layer to the vacuum layer, which helps to further evaluate the generation and transfer of photogenerated electrons in semiconductors 65,66.As shown in Fig. 4e andS13, the work functions of Bi 2 MoO 6 -SOVs and Bi 2 MoO 6 are determined to be 5.22 eV and 5.41 eV (vs.Vacuum), respectively, signifying that the generation of oxygen vacancies increases the transmission efficiency of photogenerated electrons and improves the activity of the photocatalyst.Furthermore, the influence of the solvation effect on the theoretical calculation results is also considered in Table S2.Obviously, the solvation effect will slightly reduce the work function, but will not affect the tendency of charge transfer in the composite catalyst. With the intention of visually confirming the transmission and Consequently, the above results undoubtedly support that the generated electrons can be rapidly transferred from Bi 2 MoO 6 -SOVs to In 2 S 3 to participate in the CO 2 photoreduction reaction at the surface, which confirms the existence of the S-scheme charge transfer. In terms of the above analyses, the charge transfer mechanism of the S-scheme heterojunction in BMO/IS-1 is further displayed in Fig. 9.As shown above, the work function of In 2 S 3 is lower than that of Bi 2 MoO 6 -SOVs before contact (Fig. 9d).When they are in close contact, electrons tend to transfer from In 2 S 3 to Bi 2 MoO 6 -SOVs until their Fermi levels reach equilibrium (Fig. 9e).In this process, the energy band edge of In 2 S 3 will bend upward due to the loss of electrons, while the energy band edge of Bi 2 MoO 6 -SOVs enriched in electrons will bend downward.Correspondingly, as a result of the interface potential difference, an IEF from In 2 S 3 to Bi 2 MoO 6 -SOVs will be generated on the heterogeneous interface, which is beneficial to accelerate the separation and transfer of photogenerated charges.Besides, band edge bending and Coulomb interaction will also prevent electrons from sliding from the CB of In 2 S 3 to the CB of Bi 2 MoO 6 -SOVs 67.When irradiated by visible light, the VB electrons of Bi 2 MoO 6 -SOVs and In 2 S 3 are all activated to jump to their CBs (Fig. 9f).Driven by the interface IEF, the electrons accumulated on the CB of Bi 2 MoO 6 -SOVs spontaneously flow to In 2 S 3 , and combine with the holes on the VB of In 2 S 3 .Therefore, strong reductive electrons (from CB of In 2 S 3 ) and strong oxidative holes (from VB of Bi 2 MoO 6 -SOVs) are effectively retained, and the elimination of relatively ineffective electrons (from CB of Bi 2 MoO 6 -SOVs) and holes (from VB of In 2 S 3 ) is promoted.More importantly, the presence of SOVs further induces the partial transfer of electrons on the CB of Bi 2 MoO 6 to the defect levels to alleviate charge accumulation, and improves light absorption.Simultaneously, the highly-hybrid hollow composite shell and ultra-thin hierarchical substructure enhance effective contact between different catalysts, and provide sufficient catalytic active sites.Benefiting from unique structural features and optimized charge transfer mechanism, BMO/IS-1 is endowed with superb redox capacity, therefore supplying a steady stream of powerful power for photocatalytic CO 2 reduction."
  },
  {
    "title": "Conclusions",
    "content": "In summary, the hierarchical Bi 2 MoO 6 -SOVsIn 2 S 3 heterostructure nanotubes are reasonably and meticulously constructed through a multistep control strategy for efficient photocatalytic CO 2 reduction.Systematic characterization and theoretical calculation confirm the existence of SOVs and S-scheme charge transfer mechanisms, and further support their role in promoting carrier separation and improving light absorption.Simultaneously, the highly-hybrid hollow nanostructure with ultra-thin 2D nanosheet subunits also possesses prominent advantages in the nano-scale contact interface, reduced carrier diffusion distance, larger specific area for CO 2 adsorption, and abundant catalytic active sites.Therefore, the optimized Bi 2 MoO 6 -SOVsIn 2 S 3 heterostructure shows impressive performance in photocatalytic CO 2 reduction and excellent stability under continuous visible light irradiation.This study will provide novel perspectives for the exploration and construction of high-performance photosynthesis components for solarenergy-driven conversion. .Yu et al. corresponding to the lattice motion of Bi 2 O 2 Fig. 1.The schematic illustration of the synthetic process of the hierarchical Bi 2 MoO 6 -SOVsIn 2 S 3 heterostructured nanotubes. Fig. 2. SEM images of (a, b) IS, (c) BM/IS and (d) BMO/IS-1; (e) TEM, (f, g) HRTEM image, SAED pattern (inset) and (h) surface element mappings of BMO/IS-1 sample. Fig. 3. (a) XRD patterns; (b) Raman spectra and (c) EPR spectra of the as-synthesized samples; (d) N 2 adsorption/desorption isotherms of BM, BMO, BM/IS and BMO/IS-1 samples and pore-size distributions (inset). Fig. 4. XPS spectra of the BMO/IS-1 samples: (a) Bi 2p, (b) Mo 1 s, (c) O 2p and (d) In 2p; The electrostatic potentials of (e) Bi 2 MoO 6 -SOVs (0 0 4) and (f) In 2 S 3 (2 2 0) facets. Fig. 5. (a) UV-vis diffuse reflectance spectra of the as-synthesized samples; (b) (hv) 2 versus energy curves of IS, BM and BMO samples; (c) UV photoelectron spectroscopy (UPS) and (d) schematic energy level diagrams of BMO and IS samples. .Yu et al. Fig. 6.(a) Photocatalytic CO 2 reduction activities of different samples; (b) CO/H 2 production under light irradiation of different wavelengths; (c) CO 2 reduction activity of BMO/IS-1 under various conditions; (d) Results of GC-MS analysis for CO produced from 13 CO 2 isotope experiment; (e) The time-yield plots of CO/H 2 over the BMO/IS-1 sample; (f) Stability tests of BMO/IS-1 for consecutive five cycles. Fig. 7. (a) The steady-state photoluminescence (PL) spectra; (b) time-resolved photoluminescence (TRPL) spectra; (c) transient photocurrent responses and (d) EIS Nyquist plots under visible light irradiation of the as-synthesized samples. Fig. 8. DFT calculated band structures and corresponding PDOS for (a, c) Bi 2 MoO 6 -SOVs (0 0 4) and (b, d) In 2 S 3 (2 2 0) facets. Fig. 9. ISI-XPS spectra of (a) Bi 4f, (b) Mo 3d and (c) In 3d for BMO/IS-1 in dark and under UV-light irradiation; Schematic illustration for photocatalytic CO 2 reduction over the Bi 2 MoO 6 -SOVsIn 2 S 3 heterojunction: (d) Work function comparison before contact; S-scheme charge transfer mechanism (e) after contact and (f) under visible-light radiation. 1,4-Benzenedicarboxylic acid (H 2 BDC, 99.0), Sodium molybdate dihydrate (Na 2 MoO 4 2H 2 O, 99.0) and Ethylene glycol (C 2 H 6 O 2 , 99.5) were supplied by Sinopharm Chemical Reagent Co., Ltd.(P.R. China).Deionized water (18.2M) obtained from the ultrapure purification system was used for all the experiments. This work was supported by the Anhui Provincial Natural Science Foundation of China (1508085SME219). The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://doi. org/10.1016/j.cej.2021.132456."
  }
]