[
  {
    "title": "Doi",
    "content": "10.1039/c4ta02192d"
  },
  {
    "title": "Article_Title",
    "content": "Slightly hydrogenated TiO<sub>2</sub> with enhanced photocatalytic performance"
  },
  {
    "title": "Abstract",
    "content": "Hydrogenated TiO 2 (H-TiO 2 ) has triggered intense research interest in photocatalysis due to its substantially improved solar absorption and superior activity.However, the main factors that induce the enhanced photocatalytic performance of H-TiO 2 are still under debate.In order to clarify this issue, the structural properties of H-TiO 2 , and their effects on photo-generated charges are comprehensively investigated in this study.H-TiO 2 nanoparticles with different hydrogenation degrees are rapidly synthesized through H 2 plasma treatment in several minutes; and their photocatalytic activities are evaluated by methylene blue (MB) degradation and CO 2 reduction in aqueous and gaseous media, respectively.The slightly hydrogenated TiO 2 (s-H-TiO 2 ) nanoparticles with the original white color exhibit enhanced photoactivity compared with the pristine TiO 2 (pristine-TiO 2 ) nanoparticles especially for CO 2 reduction; while the gray or black H-TiO 2 nanoparticles with higher hydrogenation degrees (h-H-TiO 2 ) display much worse catalytic performances.Further investigations reveal that the higher ratio of trapped holes (O A centers) and a lower recombination rate induced by the increase of surface defects might be the critical factors for the high activity of s-H-TiO 2 ; in contrast, h-H-TiO 2 nanoparticles possess high concentration of bulk defects, leading to a significantly decreased amount of O A centers and enhanced non-radiative recombination, which strongly inhibit their photoactivity.These results might provide new insights into the photoactivity of H-TiO 2 , and pave the way for further studies of other hydrogenated metal oxides for photocatalytic applications."
  },
  {
    "title": "Experimental",
    "content": "Commercial TiO 2 nanoparticles (Degussa P25) were purchased from Sigma-Aldrich Co. and used as precursors without purication.0.10 g TiO 2 nanoparticles were dispersed in 50 mL ethanol under ultrasonic conditions for 10 min, and then dropcast onto a 6-inch Si wafer.The drop casting process was repeated several times to achieve a TiO 2 mass loading of 0.5-0.6 mg cm A2 (100-150 mg on the whole wafer).Then, this wafer was transferred into a chamber for plasma-enhanced hydrogenation treatment, where an inductively coupled plasma (Plasmalab 100 ICP-CVD, Oxford Instruments) instrument was used.The H 2 plasma treatment was performed at 150 C for 30 s, 1 min, 3 min, 5 min, and 20 min for the synthesis of H-TiO 2 -30 s, H-TiO 2 -1 min, H-TiO 2 -3 min, H-TiO 2 -5 min, and H-TiO 2 -20 min, respectively.The ICP power was 3000 W, the chamber pressure was 25.8-27.1 mTorr, and the H 2 ow rate was 50 sccm.Aer this treatment, H-TiO 2 was obtained and scratched from the Si wafer for further investigations. The photocatalytic activities of the samples in aqueous media were tested by investigating the degradation of methylene blue (MB) at room temperature.Each sample containing 10 mg of TiO 2 was suspended in 40 mL MB solution (0.03 mM), and the suspension was placed into a closed container.In each experiment, the container was kept in the dark for 0.5 h to achieve adsorption and desorption equilibra under stirring.About 9.1, 7.7, 7.4, 8.3, 7.1, and 5.4 of MB was adsorbed by pristine-TiO 2 , H-TiO 2 -30 s, -1 min, -3 min, -5 min, and -20 min, respectively.Subsequently, the solution was irradiated using a 300 W Xe-lamp (full-spectrum, PLS-SXE300CUV, Perfect light, China), and at given time intervals (every 2 min), 2 mL of the suspension was collected and centrifuged (12 000 rpm for 20 min) to obtain a clear solution of the dye.Then, the residual concentration of MB was measured by UV-vis absorption analysis.The peak absorbance of MB (at 666 nm) was used to determine its concentration.In the control experiment without TiO 2 catalyst, less than 5 of MB was degraded under fullspectrum irradiation for 30 min. The photocatalytic activities of the samples in gaseous media were tested by investigating CO 2 reduction at room temperature.Each sample (90 mg) was dispersed in water and deposited over three glass substrates (conventional glass slides used for optical microscopy).The total area covered is around 60 cm 2 .They were evaporated at room temperature overnight, and further dried at 100 C.Then, the samples were introduced into a stainless steel reactor with an internal volume of around 200 mL, provided with an optical window made of Borooat 33 glass.The chamber was purged for 1 h with humid CO 2 (CO 2 bubbled through water) at a ux of 200 mL min A1 .Then, the valves were closed, and it was illuminated for 3 h.The radiation source was a 550 W Xe-lamp with an AM 1.5G lter (solar simulator ABET Technologies, SUN2000) with a uniform illumination area of 10 A 10 cm 2 , providing 100 mW cm A2 in the work plane measured with a thermopile detector.Aer this time, the amounts of CO and CH 4 evolved were quantied using a MicroGC, with two consecutives analyses. X-ray diffraction (XRD) patterns of the samples were recorded on a SIEMENS/BRUKER D5000 X-ray diffractometer using Cu-Ka radiation at 40 kV and 40 mA, with the samples being scanned from 2q 14 10 to 90 at a rate of 0.02 s A1 in Bragg-Brentano geometry.Raman spectra analysis was performed with a Renishaw In-Via System utilizing 514.5 nm incident radiation and a 50A aperture (N.A. 14 0.75), resulting in an 2 mm diameter sampling cross-section.Transmission electron microscopy (TEM) images were taken using a Tecnai F20 microscope on powder samples deposited onto a copper microgrid coated with carbon at an accelerating voltage of 200 kV.Optical absorption in the UV to visible wavelength range was measured using a diffuse reectance accessory of a UV-vis spectrometer (Cary 5000 UV-Vis-NIR).The X-ray photoelectron spectroscopy (XPS) analysis was performed using a spectrometer (Kratos Axis Ultra XPS) with monochromatized Al-Ka radiation and an energy resolution of 0.48 eV.Electron paramagnetic resonance (EPR) spectra were recorded at a temperature of 77 K using a Bruker BioSpin CW X-band (9.5 GHz) spectrometer ELEXYS E500.Light irradiation was provided by two lasers (50 mW power) operating at 405 nm and 532 nm using an optical transmission resonator (ER 4104OR, Bruker BioSpin).The nanocrystals were charged in quartz glass tubes connected to N 2 gas.The hyperne structure (hfs) lines (m I 14 A3/2, A1/2, 1/2, 3/2) of the Cu 2 (DTC) 2 complex (\"Cu 2 L 2 \" in Fig. S6 ) in benzene solution have been used for the correct g factors of studied paramagnetic centre determination (low eld maximum amplitude of the m I 14 A1/2 hfs line attributed to g 14 2.025).In the following text, the different spectra are presented as: \"EPR spectra\" (spectra recorded without light irradiation), \"light-excited EPR spectra\" (spectra recorded under irradiation) and \"light-induced EPR spectra\" (\"light-excited EPR spectra\" -\"EPR spectra\").Time resolved photoluminescence (PL) spectroscopy was performed using a universal streak camera (Hamamatsu C10910 using a slow single sweep unit M10913) in combination with a Czerny-Turner spectrograph (Princeton Instruments Acton SP2300, focal length 300 mm) at room temperature.Steady-state PL spectroscopy was performed using a Czerny-Turner spectrograph (Jobin Yvon SPEX 1000M) with a focal length of 1000 mm.The excitation wavelength of 266 nm was generated using a femtosecond laser (Coherent MIRA 900-F) followed by a pulse picker (Coherent Pulse Picker) and a 3 rd harmonic generator (APE HarmoniXX THG)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Hydrogenated TiO 2 (H-TiO 2 ) nanoparticles were obtained by a high-power density H 2 plasma treatment of purchased TiO 2 nanoparticles (Degussa P25) at 150 C with different reaction times (detailed parameters are given in the Experimental section).The TiO 2 powder maintained the original white color aer 30 s (H-TiO 2 -30 s); then, TiO 2 with slightly yellow color was observed aer 1 min (H-TiO 2 -1 min); and then the color changed to gray aer 3-5 min (H-TiO 2 -3 min and H-TiO 2 -5 min); and with 20 min H 2 plasma treatment, black TiO 2 was obtained (H-TiO 2 -20 min).Fig. 1 shows the UV-vis absorption spectra of pristine-and H-TiO 2 .The absorption of H-TiO 2 in the region of visible light gradually increased to a high level with the extension of the hydrogenation time, which claries the color change process from white to black.More interestingly, the slightly hydrogenated TiO 2 prepared by 30 s-1 min H 2 plasma treatment (s-H-TiO 2 ) demonstrated an obviously improved absorption in the UV region, and this improvement almost not observed in the gray or black H-TiO 2 nanoparticles with higher hydrogenation degrees (h-H-TiO 2 , 3-20 min H 2 plasma treatment).It is suggested that the enhanced UV absorption might be induced by the formation of surface defects in s-H-TiO 2 , similar results have also been observed in other materials, however, the mechanism of this phenomenon still remains unclear. 29,30ig. S1 shows the XRD patterns of the pristine-TiO 2 and H-TiO 2 with different times of hydrogenation.The purchased pristine-TiO 2 nanoparticles demonstrated a major anatase phase coexisting with a small amount of rutile phase.Aer H 2 plasma treatment for 30 s to 5 min, the obtained H-TiO 2 displayed almost the same XRD patterns, indicating that no phase transformation occurred in the process.However, the peak intensity of TiO 2 signicantly decreased aer 20 min, and the calculated average crystallite size (using the Scherrer equation) of this sample in the 101 direction is 17.6 nm, which is smaller than that of pristine-TiO 2 (19.3 nm).This change might be induced by the high concentration of defects in TiO 2 nanoparticles. 15ig. 2 shows the HR-TEM images of pristine-TiO 2 and H-TiO 2 with different times of hydrogenation.The pristine-TiO 2 and s-H-TiO 2 were highly crystallized, as seen from the well-resolved lattice features shown in Fig. 2a-c.Aer 3 min, a disordered layer (0.5-0.9 nm) was formed on the surface of TiO 2 nanoparticles (Fig. 2d).Further prolonging the reaction time, the thickness of the disordered layer increased to 1.0-1.6 and 1.5-2.2nm aer 5 and 20 min, respectively.As Raman spectra are more sensitive to the disordered phase, this method was used to further investigate the structural changes of TiO 2 aer different times of hydrogenation.Pristine-TiO 2 demonstrated typical anatase Raman bands at 149 cm A1 (E g ), 195 cm A1 (E g ), 397 cm A1 (B 1g ), 516 cm A1 (A 1g B 1g ), and 638 cm A1 (E g ). 31 s-H-TiO 2 showed similar patterns to pristine-TiO 2 ; and the peak intensity of H-TiO 2 obviously decreased with hydrogenation time up to 3 min; aer 20 min, H-TiO 2 had only a broad peak at 149 cm A1 with the disappearance of the other peaks, which were the characteristics of the existence of the disordered phase (Fig. 3). 32,33These results are consistent with the observation in HR-TEM images. XPS analysis was used to investigate the change of surface chemical bonds of the TiO 2 nanoparticles induced by hydrogenation.The Ti 2p core level spectrum of pristine-TiO 2 showed two peaks at 458.6 and 464.7 eV, corresponding to the Ti 2p 1/2 and Ti 2p 3/2 peaks of Ti 4 species; 12,34 for H-TiO 2 -30 s, these peaks negative shied to 458.3 and 464.5 eV, indicating a different bonding environment (upper panel in Fig. 4a).By subtracting the Ti 2p spectrum of pristine-TiO 2 from that of H-TiO 2 -30 s, two extra peaks were observed at 457.9 and 463.6 eV, which can be attributed to the Ti 2p 1/2 and Ti 2p 3/2 peaks of Ti 3 species (lower panel in Fig. 4a), indicating the presence of Ti 3 species on the surface of TiO 2 nanoparticles aer 30 s of H 2 plasma treatment. 34,35Surprisingly, the Ti 2p peaks of H-TiO 2 re-shied to higher values with the extension of hydrogenation time, and were even close to those of pristine-TiO 2 aer 20 min (Fig. 4b).All difference spectra obtained by subtracting the Ti 2p spectra of these H-TiO 2 with those of pristine-TiO 2 showed the Ti 2p 1/2 and Ti 2p 3/2 peaks of Ti 3 species, but the intensity of these peaks signicantly decreased with the increase of hydrogenation time (Fig. 4c).It is suggested that oxygen vacancies (Ti 3 sites) initially formed on the surface of TiO 2 nanoparticles under H 2 plasma treatment, and preferentially diffused into the bulk with further hydrogenation. 28,36The O 1s spectra are almost identical for the pristine-TiO 2 and all H-TiO 2 (Fig. S2 ).Two oxygen features were obtained by peak-tting of this spectrum: the intense peak located at 529.7 eV is the characteristic peak of Ti-O in anatase TiO 2 ; the broad peak centered at around 531.3 eV can be assigned to Ti-O-H. 37The content of the Ti-O-H signal in O 1s spectra remained at 10.0 before and aer different times of H 2 plasma treatment, implying that the hydrogenation process has a negligible effect on the density of hydroxyl groups of the TiO 2 surface.The VB maxima were estimated by linear extrapolation of the peaks to the baselines, the pristine-TiO 2 and all H-TiO 2 displayed the band edge at 2.4 eV (Fig. S3 ).This result has also been observed in other studies, 15,31 which demonstrated that oxygen vacancies (or Ti 3 species) created by the hydrogenation process could induce the formation of additional electronic states below the conduction band (CB) of TiO 2 . 15,171819192038 In this case, the gray or black color of H-TiO 2 with the substantial enhancement of visible light absorption might be attributed to the transitions from the TiO 2 VB to these additional electronic states or from these additional electronic states to the TiO 2 CB. 15 Electron paramagnetic resonance (EPR) was measured to further investigate the concentration and distribution of defects in H-TiO 2 , because it is highly sensitive to detect paramagnetic species containing unpaired electrons, and has been widely used to characterize the existence of Ti 3 species and oxygen vacancies.As indicated in Fig. 5, pristine-TiO 2 presented a weak response at a g-value of 1.978, which might be ascribed to the original surface or interstitial defects in TiO 2 (Ti 3 species). 39,40er 30 s of H 2 plasma treatment, the H-TiO 2 exhibited a stronger peak with the same g-value, which indicated an increase of surface defects.Aer 1 min, the intensity of the surface defect signal further increased; and a broad signal at an average g-value of 1.93 was also observed, which might result from the Ti 3 species existing in the subsurface of TiO 2 . 41,42Aer 3 min, the H-TiO 2 sample showed a much stronger signal at an average g-value of 1.957 (g x 14 1.965, g y 14 1.960, g z 14 1.945), the intensity of this signal is about 2 orders of magnitude higher than that of the surface Ti 3 species in s-H-TiO 2 (30 s-1 min), implying the presence of a large amount of Ti 3 species in the bulk; 17,43,44 prolonging the hydrogenation time to 20 min, the signal at an average g-value of 1.957 with higher intensity was observed, revealing that the amount of Ti 3 species in the bulk further increased (40 times of H-TiO 2 -1 min, Fig. S4 ).These results demonstrated that the H 2 plasma treatment induced the formation of Ti 3 species on the surface of TiO 2 at an early stage (30 s-1 min), and a large amount of bulk Ti 3 species was formed with longer times of hydrogenation (3-20 min). The photocatalytic activities of H-TiO 2 were evaluated by methylene blue (MB) degradation and CO 2 reduction in aqueous and gaseous media, respectively.For MB degradation, s-H-TiO 2 exhibited better photocatalytic activities than pristine-TiO 2 (Fig. 6): H-TiO 2 -30 s completed the decomposition of MO in 12 min; and H-TiO 2 -1 min needed 14 min; while the pristine-TiO 2 took 16 min.In contrast, h-H-TiO 2 showed much worse performance.About 8, 13, and 21 of MB remained aer 16 min for H-TiO 2 -3 min, -5 min, and A20 min, respectively.The kinetics of the degradation reaction were tted to a pseudo rstorder reaction: ln(C 0 /C) 14 kt, where k is the rate constant.The average value of k for pristine-TiO 2 , H-TiO 2 -30 s, -1 min, -3 min, -5 min, and A20 min was 0.217, 0.291, 0.255, 0.167, 0.136, and 0.101 min A1 , respectively (Fig. S5 ).For CO 2 reduction, CH 4 and CO were found to be the two main products, and a similar trend to MB degradation, in which the photoactivity of H-TiO 2 decreased with the increase of hydrogenation degree, was also observed.As shown in Fig. 7, s-H enhanced conversion efficiency: the production rate of CH 4 and CO for H-TiO 2 -30 s was 14.65 and 19.44 nmol h A1 , respectively, which was about 2 times higher than that for pristine-TiO 2 in the total productivity (7.37 nmol h A1 CO and 11.59 nmol h A1 CH 4 ); for H-TiO 2 -1 min, the rate of CH 4 slightly decreased to 14.03 nmol h A1 , but the rate of CO increased to 21.67 nmol h A1 .The explanation might be that CO 2 is favourably bonded on the surface of H-TiO 2 -30 s due to its higher density of surface Ti 3 sites (Fig. 4c), which enhances the immobilization of CO 2 at the surface of the catalyst, allowing a later hydrogenation to form CH 4 instead of CO. 45 For H-TiO 2 -3 min, the production rate of CH 4 and CO signicantly decreased to 9.29 and 13.39 nmol h A1 , respectively.Nevertheless, these rates are still slightly higher than that of pristine-TiO 2 , which is different from the worse performance of H-TiO 2 -3 min in MB degradation.This change might be induced by the different charge transfer rate at the aqueous/and gaseous/TiO 2 interface, and reaction kinetics of MB degradation and CO 2 reduction. 6The catalytic performance of H-TiO 2 further decreased with the extension of hydrogenation time.Especially in CH 4 production, the rate is only 4.37 nmol h A1 for H-TiO 2 -5 min; and almost no CH 4 signal was observed for H-TiO 2 -20 min.The mechanism of CO 2 photoreduction with H 2 O to form CH 4 and CO can be simply described by the following three steps of reaction: 45,46 According to the above mentioned results, it is suggested that the formation of a high concentration of bulk Ti 3 is counterproductive to the photocatalytic activity of H-TiO 2 .As it will be further discussed later, bulk Ti 3 species strongly weakened the photooxidative efficacy of h-H-TiO 2 (step 2), which reduced both the productivity as well as the selectivity CH 4 /CO ratio. 45 order to study the effect of hydrogenation processes on the charge-trapping centers of TiO 2 formed upon solar light irradiation, and in turn to understand the photoactivity of H-TiO 2 , light-induced EPR measurements were performed under 405 or 532 nm light irradiation (Fig. 8).For comparison, these spectra of pristine-TiO 2 and H-TiO 2 have been subtracted by those spectra obtained without light irradiation (Fig. S6 ).As shown in UV-vis spectra (Fig. 1), the pristine-TiO 2 and s-H-TiO 2 display a steep increase in absorption at a wavelength of 420 nm, hence, the irradiation with an excitation wavelength of 405 nm can be used as a UV light source; on the other hand, the irradiation with a wavelength of 532 nm was used as a visible light source.Under 405 nm light irradiation, the pristine-TiO 2 and s-H-TiO 2 showed two well-separated sets of resonance lines.The higher eld small peaks with an average g value of 1.960 (g x 14 1.970, g y 14 1.965, g z 14 1.947) can be assigned to electrons trapped on Ti 3 centers; 39,47 the lower eld sharp features with an average g value of 2.013 (g x 14 2.022, g y 14 2.015, g z 14 2.003) correspond to the holes trapped on O A sites, 39,47 and their intensity is greater than that of Ti 3 peaks.Both O A and Ti 3 signals in s-H-TiO 2 showed lower intensity compared with pristine-TiO 2 , indicating that a small part of photo-generated charges is trapped by the increased surface defects. 48 from the combination of the photo-generated holes and the localized bulk Ti 3 species (induced by hydrogenation).Aer 20 min, the O A signals almost disappeared, and the intensity of the inverted broad resonances further increased.This result suggested that bulk Ti 3 species tend to act as charge carrier traps where most of the photo-generated holes were consumed through recombination with electrons. 23,27,40According to the literature, the trapped holes (O A ) and electrons (Ti 3 ) were considered as the major oxidative and reductive sites in catalytic reactions, respectively; 47 therefore, the ratio of O A /Ti 3 might have an important impact on the competition between the photo-oxidation and -reduction process, and thus strongly affect the efficiency of photocatalysis. 46,47It is observed that the ratio of O A /Ti 3 is 1.71 for pristine-TiO 2 (the relative amount of Ti 3 and O A can be appraised through the double integration of the resonance lines as shown in Fig. S7 ); and this ratio increased to 2.02 and 1.84 for s-H-TiO 2 with 30 s and 1 min H 2 plasma treatment, respectively; in contrast, the ratio of O A /Ti 3 dramatically decreased to less than 0.1 for h-H-TiO 2 .These results indicated that s-H-TiO 2 with a higher ratio of O A centers might have enhanced photooxidative efficacy, leading to the improved photocatalytic performance; on the other hand, the worse photoactivity of h-H-TiO 2 might be attributed to the signicant reduction of O A centers, due to the formation of a large amount of bulk Ti 3 species with relatively long time hydrogenation.Under 532 nm light irradiation, no O A signals were observed for the pristine-and H-TiO 2 , and these samples also showed very poor visible-light photocatalytic performance in degradation of MB, revealing that the contribution of the dramatically improved visible-light absorbance of H-TiO 2 to its photoactivity is limited.This result is similar to previous reports. 15,23he photoluminescence (PL) spectra of pristine-and H-TiO 2 in the wavelength range of 420-680 nm with excitation at 266 nm are shown in Fig. 9a.All samples exhibited a broad signal centered around 505 nm, which resulted from radiative transitions involving mobile electrons recombining with hole-trapped states (located 0.7-1.4eV above the valence band edge), associated with oxygen vacancies in anatase TiO 2 . 49,50H-TiO 2 -30 s showed a more intense and broad signal compared with pristine-TiO 2 , due to its higher density of surface Ti 3 centers. 51For H-TiO 2 -1 min, the intensity of the signal decreased to close to that of pristine-TiO 2 , which might be induced by the existence of subsurface Ti 3 species.For h-H-TiO 2 (3-20 min), the signal intensity signicantly decreased with the increase in hydrogenation time.This trend is consistent with other reports, and has been assigned to the lower recombination rate of electrons and holes in H-TiO 2 that favors its high photocatalytic activity. 16,18,20,21Actually, in addition to radiative recombination that releases photons (detected by PL spectra), non-radiative recombination that releases phonons is a major pathway for the photo-generated charge annihilation in TiO 2 (as in indirect band-gap semiconductors).In this process, the energy is exchanged in the form of lattice vibration, and the thermal energy in materials is increased. 52,53Hence, the temperature changes of the pristine-and H-TiO 2 suspensions (25 mg TiO 2 in 50 mL water) were measured aer 90 min of full-spectrum irradiation (Fig. 9b).For pristine-TiO 2 , the temperature rise was (4.5 AE 0.8) C, which was obviously higher than that of s-H-TiO 2 ((1.2 AE 0.2) and (1.3 AE 0.2) C for H-TiO 2 -30 s and H-TiO 2 -1 min, respectively).The temperature rise increased to (5.7 AE 0.9), (5.9 AE 1.0), and (10.3 AE 2.2) C for H-TiO 2 with 3, 5, and 20 min H 2 plasma treatment, respectively.These results demonstrated that s-H-TiO 2 might have a lower non-radiative recombination rate compared with pristine-TiO 2 due to its limited thermal effect, but gray or black h-H-TiO 2 nanoparticles can more efficiently convert light energy into thermal energy, corresponding to their signicantly enhanced non-radiative recombination.PL signal decay curves were used to compare the lifetime of photogenerated charges in pristine-and H-TiO 2 .As shown in Fig. 9c, the lifetime of electrons and holes in H-TiO 2 generally decreased with the increase of hydrogenation time.H-TiO 2 -30 s displayed a slightly longer lifetime than that of pristine-TiO 2 , and the lifetime of H-TiO 2 -1 min was almost the same as pristine-TiO 2 .With further hydrogenation (3-20 min), the lifetime of gray or black H-TiO 2 was shortened compared with pristine-TiO 2 .Combined with light-induced EPR analysis, it is demonstrated that the surface defects in s-H-TiO 2 improve the hole trapping, and thus facilitate the separation of photo-generated charge pairs, which results in the lower recombination rate and longer lifetime of them; in contrast, highly concentrated bulk defects in h-H-TiO 2 act as charge annihilation centers, leading to the enhanced non-radiative recombination and shorter lifetime of electrons and holes."
  },
  {
    "title": "Conclusions",
    "content": "Hydrogenated TiO 2 (H-TiO 2 ) nanoparticles with different hydrogenation degrees are efficiently synthesized through H 2 plasma treatment in several minutes.The slightly hydrogenated TiO 2 nanoparticles with the original white color (s-H-TiO 2 ) exhibit enhanced photoactivity compared to pristine TiO 2 (pristine-TiO 2 ) nanoparticles especially in CO 2 reduction.In contrast, the gray or black H-TiO 2 nanoparticles with higher hydrogenation degrees (h-H-TiO 2 ) display much worse catalytic performances.Further investigations toward the structure and photo-generated charges of H-TiO 2 demonstrate that the improved photocatalytic performance of s-H-TiO 2 can be attributed to the higher ratio of trapped holes (O A centers) and a lower recombination rate induced by the increase of surface defects; while the highly concentrated bulk defects in h-H-TiO 2 act as charge annihilation centers, most of the photo-generated holes are consumed through signicantly enhanced non-radiative recombination, which strongly inhibits the activity of h-H-TiO 2 . Fig. 1 UV-vis absorption spectra and related photographs of the pristine-TiO 2 and H-TiO 2 prepared by H 2 plasma treatment after different times of 30 s, 1 min, 3 min, 5 min, and 20 min.(Pristine-TiO 2 represents pristine TiO 2 ; H-TiO 2 -30 s, H-TiO 2 -1 min, H-TiO 2 -3 min, H-TiO 2 -5 min, and H-TiO 2 -20 min represent hydrogenated TiO 2 with 30 s, 1 min, 3 min, 5 min, and 20 min H 2 plasma treatment, respectively.) Fig. 2 HR-TEM images of the pristine-TiO 2 and H-TiO 2 prepared by H 2 plasma treatment after different times: (a) pristine-TiO 2 ; (b) H-TiO 2 -30 s; (c) H-TiO 2 -1 min; (d) H-TiO 2 -3 min; (e) H-TiO 2 -5 min; (f) H-TiO 2 -20 min. Fig. 3 Raman spectra of the pristine-TiO 2 and H-TiO 2 prepared by H 2 plasma treatment after different times of 30 s, 1 min, 3 min, 5 min, and 20 min. Fig. 4 (a) XPS Ti 2p core level spectra of the pristine-TiO 2 and H-TiO 2 -30 s (upper panel), and the difference spectrum obtained by subtracting the spectrum of the pristine-TiO 2 from that of the H-TiO 2 -30 s (lower panel).(b) XPS Ti 2p core level spectra of the pristine-TiO 2 and H-TiO 2 prepared by H 2 plasma treatment after different times of 30 s, 1 min, 3 min, 5 min, and 20 min.(c) The difference spectra obtained by subtracting the spectrum of the pristine-TiO 2 from those of H-TiO 2 -30 s, H-TiO 2 -1 min, H-TiO 2 -3 min, H-TiO 2 -5 min, and H-TiO 2 -20 min. Fig. 5 EPR spectra of the pristine-TiO 2 and H-TiO 2 prepared by H 2 plasma treatment after different times of 30 s, 1 min, 3 min, 5 min, and 20 min recorded at 77 K without light irradiation.(Orange line represents the simulated signal at an average g-value of 1.93.)Fig. 6 Degradation of methylene blue (MB) over pristine-TiO 2 and H-TiO 2 prepared by H 2 plasma treatment after different times of 30 s, 1 min, 3 min, 5 min, and 20 min.(Pristine-TiO 2 , H-TiO 2 -30 s, H-TiO 2 -1 min, H-TiO 2 -3 min, H-TiO 2 -5 min, and H-TiO 2 -20 min). Aer 3-5 min of H 2 plasma treatment, the intensity of O A signals signicantly decreased; and inverted broad resonances were observed at an average g value of 1.957, implying the decreased amount of Ti 3 species in H-TiO 2 , which might derive Fig. 7 The formation rates of CH 4 and CO in the photocatalytic reduction of CO 2 with H 2 O over pristine-TiO 2 and H-TiO 2 prepared by H 2 plasma treatment after different times of 30 s, 1 min, 3 min, 5 min, and 20 min. Fig. 8 Light-induced EPR spectra of the pristine-TiO 2 and H-TiO 2 prepared by H 2 plasma treatment after different times of 30 s, 1 min, 3 min, 5 min, and 20 min recorded at 77 K under 405 or 532 nm light irradiation. Fig. 9 (a) PL spectra of the pristine-TiO 2 and H-TiO 2 prepared by H 2 plasma treatment after different times of 30 s, 1 min, 3 min, 5 min, and 20 min.(b) Temperature rise of the pristine-TiO 2 , H-TiO 2 -30 s, H-TiO 2 -1 min, H-TiO 2 -3 min, H-TiO 2 -5 min, and H-TiO 2 -20 min suspensions (25 mg TiO 2 in 50 mL water) after 90 min of full-spectrum irradiation.(c) PL decay measured for the pristine-TiO 2 and H-TiO 2 prepared by H 2 plasma treatment after different times of 30 s, 1 min, 3 min, 5 min, and 20 min. This journal is The Royal Society of Chemistry 2014 This work was supported by the state of Thuringia (Germany) and by the European Funds for Regional Development (Nano-Batt TNA VII-1/2012), Ministerio de Economia y Competitividad of Spain (CSD2009-00050 and ENE2012-3651), the National Natural Science Foundation of China (NSFC 21001012), and the Beijing Nova Program (2009B06).The authors are grateful to Mr Stefan Hanitsch from the Ilmenau University of Technology for his help with sample preparation.Mr Yong Yan is supported by means of a doctoral scholarship from the Carl Zeiss Stiung (Germany)."
  }
]