[
  {
    "title": "Doi",
    "content": "10.1016/j.cattod.2019.03.012"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic CO2 reduction on porous TiO2 synergistically promoted by atomic layer deposited MgO overcoating and photodeposited silver nanoparticles"
  },
  {
    "title": "Abstract",
    "content": "In this work, a porous TiO 2 photocatalyst derived from metal-organic framework MIL-125 was synthesized and tested for photocatalytic CO 2 reduction with water.To improve the photocatalytic performance, innovative materials modifications were employed by decorating TiO 2 with atomic layer deposited (ALD) MgO overcoating and photodeposited silver (Ag) nanoparticles at different orders: MgO deposition followed by Ag (i.e.Ag/MgO/ TiO 2 ), or Ag deposition followed by MgO (i.e.MgO/Ag/TiO 2 ).The addition of Ag promoted transfer of photoinduced electrons, while the coating of an ultrathin MgO layer inhibited surface charge recombination and enhanced CO 2 adsorption.The combination of MgO and Ag resulted in synergistic promotion on CO 2 photoreduction greater than the sum of individual promotional effects.The Ag/MgO/TiO 2 catalyst with 7 ALD-layers of MgO and 5 Ag was 14 times more active than the pristine TiO 2 in terms of CO and CH 4 production.In addition, the sequence of MgO/Ag decoration influenced the catalytic activity.The Ag/MgO/TiO 2 catalysts were in general more active than the MgO/Ag/TiO 2 counterparts, likely due to the different electron mobility and Ag nanoparticle distribution on the surface.This work for the first time reports the novel materials structure of ALD coated MgO and photodeposited Ag nanoparticles on TiO 2 , and it reveals the importance of optimizing materials morphology and structure to promote the catalytic activity."
  },
  {
    "title": "Experimental",
    "content": "Pristine porous TiO 2 preparation procedure can be found in the Supporting information.In a typical preparation of Ag modified porous TiO 2 , 50 mg of pristine TiO 2 was dispersed in 40 ml of aqueous solution where a predetermined amount of AgNO 3 was dissolved.The suspension was treated under a 100 W UV lamp (365 nm, UV irradiation intensity 8 mW/cm 2 ) for 1 h.The photocatalyst was collected by centrifugation and rinsed with water for three times and then dried in a vacuum oven overnight at 80 C.The samples were then calcined in air at 450 C for 30 min.The obtained Ag/TiO 2 samples were denoted as \"xAg\", where x represents the weight percentage of Ag relative to TiO 2 in the precursor solution.In this work, the value of x was designed to be 1, 2, 5, or 10 wt., corresponding to 0.74, 1.48, 3.70 or 7.40 at.. An Ultratech Savannah S200 ALD system was used to coat an ultrathin MgO layer on pristine TiO 2 .A homemade powder holder loaded with 100 mg of pristine TiO 2 powder was placed in the center of the ALD chamber, which was maintained at 200 C during the ALD process.Bis(ethylcyclopentadienyl) magnesium Mg(C 5 H 4 C 2 H 5 ) 2 , min.98, Strem Chemicals Inc. was used as the Mg precursor.In each ALD cycle, \"expo\" mode was used for coating porous materials, and the pulse time of water and Mg precursor was set to 2 s each to introduce an adequate amount of reactants to the reaction chamber and ensure an even ALD coating on pristine TiO 2 .A predetermined number of cycles was applied on pristine TiO 2 powder.After the ALD process, a grey powder was obtained and calcined at 450 C for 30 min to remove any potential organic residues from the ALD process.The obtained MgO/TiO 2 sample was denoted as \"yMg\", where y was the number of ALD cycles and was chosen to be 1, 3, 5, 7, or 10.In our previous work, the optimum ALD coating to promote photocatalytic performance was found to be less than 10 cycles or in the sub-nanometer range, as too \"thick\" a coating can inhibit charge migration to the catalyst surface 18,26,33,44. The pristine TiO 2 was co-modified by both ALD-coated MgO and photodeposited Ag at different orders: (1) MgO deposition followed by Ag (i.e.Ag/MgO/TiO 2 ), or (2) Ag deposition followed by MgO (i.e.MgO/Ag/TiO 2 ).For the co-modified TiO 2 samples, Ag content was kept constant at 5 wt. (as identified to be the optimum from preliminary tests presented later in the paper), while the thickness of MgO (number of ALD cycles) varied.A schematic of the preparation procedure and proposed materials morphology is illustrated in Fig. 1. In a typical procedure of preparing Ag/MgO/TiO 2 samples, 50 mg of yMg (MgO/TiO 2 ) powder was dispersed in 40 ml of water where 3.92 mg of AgNO 3 was dissolved, and the weight of Ag in the solution was 5 relative to the yMg powder.The suspension was treated under a 100 W UV lamp for 1 h.After UV treatment, the photocatalyst was centrifugated and rinsed with water for three times and then dried overnight in a vacuum oven at 80 C.The collected sample powder was then calcined in air at 450 C for 30 min.The obtained Ag/MgO/TiO 2 samples were denoted as 5AgyMg. In a typical procedure of preparing MgO/Ag/TiO 2 samples, 100 mg of 5Ag (Ag/TiO 2 ) powder was treated by the ALD process described previously.After the ALD process, the obtained powder was calcined at 450 C for 30 min to remove any potential organic residues from the ALD process, and then a grey powder was obtained.The obtained MgO/ Ag/TiO 2 samples were denoted as yMg5Ag. X-ray diffraction (XRD) analysis was performed on a Bruker-AXS D8 Advance diffractometer using Cu K1 irradiation ( 1.54059A) at 40 kV and 40 mA at room temperature.The step increment was set at 2 0.05and the counting time per step was 1 s.The morphology was analyzed with a JEOL JSM7500F field-emission scanning electron microscope (FE-SEM) and a FEI Tecnai G2 F20 ST transmission electron microscope (TEM).X-ray photoelectron spectroscopy (XPS) analysis was performed on an Omicron XPS system.The UV-vis diffuse reflectance spectra were measured on a Hitachi U4100 UV-vis-NIR Spectrophotometer with the Praying Mantis accessory.Photoluminescence spectra (PTI QuantaMaster series Spectrofluorometer) were obtained to investigate the charge recombination emission using 200 nm incident light, scanning from 300 to 450 nm with scan rate 0.1 nm/s. The experimental setup for CO 2 photoreduction was similar to that in our previous reports 26,33.A piece of glass fiber filter paper (Pall Corporation) was used as the support for the powder photocatalyst.Prior to catalyst loading, the glass fiber paper was calcined in air at 450 C to remove any possible organics residues on the surface.Then 10 mg of photocatalyst was dispersed in 2 ml of de-ionized water and sonicated for 10 min.The obtained suspension was dripped onto the glass fiber paper, which was later dried in vacuum oven at 80 C for 30 min.The catalyst-loaded glass fiber paper was then placed into a tubular quartz reactor with its photocatalyst side facing the light source.Ultra-high purity CO 2 (99.999,Airgas) was bubbled into a water reservoir to generate a CO 2 /H 2 O gas mixture (water vapor concentration 2.3 by volume) before being purged into the tube reactor.Before turning the light on, the system was flushed with CO 2 at a flow rate of 300 standard cubic centimeter per minute (sccm) for 1 h and then maintained at 4.4 sccm.The light source used in this study was a 450 W Xe lamp (Newport, Inc.) equipped with a water filter to diminish infrared irradiation, and the distance between the Xe lamp and the photocatalyst was 30 cm.The light spectrum of the lamp measured 30 cm away from the lamp is shown in Fig. S1 (Supporting information).The intensities of UV, visible, IR light of the Xe lamp measured outside and inside the quartz tube are listed in Table S1 (Supporting information).Each photocatalytic experiment lasted for 4 h, during which the effluent gas composition was measured by a Shimadzu GC-2014ATF gas chromatograph (GC), which was equipped with an automated gas sampling valve, a thermal conductivity detector (TCD), and a flame ionization detector (FID) coupled with a methanizer. Transient photocurrent density and electrochemical impedance spectroscopy (EIS) of prepared samples were measured with a Gamry Reference 3000 potentiostat.In a typical transient photocurrent density measurement, 1.2 mg of photocatalyst was loaded on the conductive surface of a piece of ITO glass, and a 0.05 M Na 2 SO 4 solution was used as the electrolyte.A 450 W Xe-lamp was used as the light source, a 3 M Ag/AgCl electrode was used as reference, and a Pt slice was used as the counter electrode.EIS measurements were conducted with the same experimental setup.The EIS measurements were measured under Xelamp irradiation, over a frequency range of 0.2 Hz to 100 kHz, and under a perturbation of 10 mV."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The XRD patterns of as-prepared photocatalyst are shown in Fig. 2. It was found that all samples consisted of both anatase and rutile TiO 2 .However, fingerpirint peaks for MgO or Ag were not detected, likely because the amount of surface MgO and Ag was low or they were in amorphous form.The TiO 2 phase composition and crystallite size of anatase and rutile in the samples are listed in Table 1.The anatase/ rutile ratio was calculated by the Rietveld refinement method 45.It can be seen from Table 1 that the percentage of rutile slightly increases with the complexity of materials preparation (e.g.rutile content in prisine TiO 2 Ag or MgO individually modified TiO 2 Ag and MgO co-modified TiO 2 ).It is likely the extended calcination treatement of comodified samples promoted the transformation of anatase into rutile.Nevertheless, there were no significant variations in terms of phase composition and crystallite size for all the samples. SEM images of pristine TiO 2 , 7Mg5Ag and 5Ag7Mg samples are shown in Fig. 3.All samples exhibited similar morphology and cubic shape of particles at an average size of 270 nm.High resolution TEM analysis was performed on 7Mg5Ag and 5Ag7Mg to investigate the differences in nanostructure resulted from different preparation procedures.As shown in Fig. 4a andc, 7Mg5Ag and 5Ag7Mg demonstrate the assembly of primary ultrafine particles ( 20 nm) into a larger cubic shape, porous particle at a size of 270 nm, which is consistent to the particle size observed from the SEM images and to the morphology of porous TiO 2 reported from the literature 26.As displayed in Fig. 4b andd, anatase 101 (d 0.352 nm), rutile 110 (d 0.323 nm) and rutile 111 (d 0.218 nm) were found on the two samples.Existence of MgO phase was not observed in TEM images, this is likely due to small amount of addition.In Fig. 4b, as indicated by the yellow arrows, there seems to be some Ag nanoparticles on 7Mg5Ag.But due to heavy overlapping with TiO 2 crystallites, the characteristic lattice of neither Ag nor Ag 2 O could be clearly identified in the TEM image.For 5Ag7Mg as displayed in Fig. 4d, Ag nanoparticles with well-defined shape was not observed.It is possible that the size of the Ag nanoparticles or clusters on this sample was too small to be detected. In order to investigate the surface chemical states and compositions of the prepared samples, XPS analyses were performed.The XPS survey spectra of all prepared samples are shown in Fig. S2.The presence of Ti and O elements was confirmed on the pristine TiO 2 , and no Ag elements was found on the 7Mg sample.It has to be made clear that the C 1s peak observed in the survey spectrum is the result of double-sided tape used in the XPS analyses.The existence of MgO on 7Mg, 7Mg5Ag and 5Ag7Mg was also confirmed by XPS spectra on Mg 2s orbitals in Fig. S3.XPS spectra on Ti 2p peaks of pristine TiO 2 , 7Mg, 5Ag, 7Mg5Ag and 7Mg5Ag are shown in Fig. 5a.It was found that the Ti 2p 3/2 peak of 5Ag, 7Mg5Ag and 5Ag7Mg shifted from 458.5 eV (pristine TiO 2 and 7Mg) to 458.2 eV (after Ag addition), suggesting the formation of surface Ti 3 species 46.In the XPS spectra of O 1s (Fig. 5b).A slight negative shift of binding energy was observed on 5Ag, 5Ag7Mg and 7Mg5Ag compared with pristine TiO 2 and 7Mg, which might be ascribed to the formation of surface oxygen vacancies. The generation of oxygen vacancies and Ti 3 under aerobic calcination condition on MgO and/or Ag surface modifications was also reported previously 26,31.According to Manzanares et al. 31, the generation of oxygen vacancy on MgO modified TiO 2 may result from Ti 4 substituted by Mg 2 , expressed as follows, where Mg Ti indicates Mg 2 in a Ti 4 site, V O and O L indicate oxygen vacancy and lattice oxygen, respectively.The generated oxygen vacancies are not stable, and they might be neutralized either by chemically absorbed water to form surface hydroxyl 47 or by crystalline structure reorganization to create Ti 3 48.Similar results were observed on Ag modified TiO 2 by Gannoruwa et al. 49, where Ti 3 may also be generated on Ag/TiO 2 through the following reactions, The photoexcited electrons and holes are generated by Ag 2 O by absorbing diffuse light from the surroundings and consequently transfer from Ag 2 O to TiO 2 to generate Ti 3 . To better understand the chemical state of oxygen on the MgO/Ag co-modified samples, deconvolution of O 1 s was conducted according to a previous report 50, where O 1s was deconvoluted into lattice oxygen (O 2-, 529.0 eV), hydroxyl (eOH, 531.6 eV), and adsorbed water ( 533.2eV).As shown in Fig. S4, O 2-and eOH were present on both 7Mg5Ag and 5Ag7Mg samples, and absorbed water was not found, likely due to the evaporation of water under ultra-high vacuum condition in the XPS chamber.By comparing the oxygen chemical state on both 7Mg5Ag and 5Ag7Mg samples, it was found that 5Ag7Mg shows more concentrated surface eOH (5Ag7Mg 23.8 eOH vs. 7Mg5Ag 9.9 eOH, which can be generated by partial neutralization of oxygen vacancies in the presence of water 26. On the XPS spectra of 5Ag, 7Mg5Ag and 5Ag7Mg, strong Ag 3d doublet peaks were found (Fig. 5c), confirming the successful Ag surface modification.The Ag 3d peaks on both 7Mg5Ag and 5Ag7Mg were found to be located at 367.7 eV and 373.3 eV, which correspond to the binding energy of Ag 2 O 51.Since all of the prepared samples were calcined at 450 C after Ag photodeposition, it is reasonable that silver oxide was formed.The XPS results reveals that the Ag concentration on the surface of 7Mg5Ag and 5Ag7Mg were 2.25 and 4.92 at., respectively, while the nominal Ag atomic concentration was 3.70 at. (or 5 wt.) for both samples assuming that Ag in the precursor solution was completely deposited on TiO 2 .Because XPS is a surface analysis technique, it is reasonable that the surface Ag concentration measured by XPS is greater than the nominal concentration in the bulk.To obtain accurate silver deposition concentration on both of the two samples, inductively coupled plasmamass spectroscopy (ICP-MS) analysis has been conducted on 7Mg5Ag and 5Ag7Mg.The ICP-MS results show that the silver concentrations on both of 7Mg5Ag and 5Ag7Mg are 1.92 wt. and 2.66 wt..Both XPS and ICP-MS results indicate that more Ag was deposited on the surface of the 5Ag7Mg sample than on 7Mg5Ag. The UV-vis diffuse reflectance spectra and calculated band gap energy of the samples are presented in Fig. S5.All of the Ag modified samples showed an increased capability in visible light absorption ( 400 nm) compared with pristine TiO 2 .However, neither Ag nor MgO modification significantly altered the band gap energies.All the samples had a band gap in a small range of 2.98-3.08eV with no particular correlation to the materials structure.This band gap energy well matches that of TiO 2 with a significant phase content of rutile.The surface electron-hole recombination characteristic of pristine TiO 2 , 7Mg, 5Ag, 7Mg5Ag and 5Ag7Mg were investigated with a photoluminescence (PL) test.The PL spectra record the light emission generated by electron-hole recombination, and thus lower PL intensity suggests hindered recombination.As shown in Fig. 6, pristine TiO 2 displayed the highest light emission among the tested samples.With 7 layers of ALD added MgO coating (7Mg sample), the PL intensity decreased significantly, and his observation is consistent with our previous work where an ALD overlayer passivates surface states and hinders surface charge recombination 26,44.The 5Ag sample shows an even lower PL intensity, demonstrating the promoted electron-hole separation after adding Ag NPs.The 7Mg5Ag and 5Ag7Mg samples, which are co-modified with MgO and Ag, show comparable and lowest level of PL intensity.This clearly reveals the synergy of MgO and Ag comodification that facilitates the charge separation on the TiO 2 surface.The comparison of photoactivity of xAg and pristine TiO 2 is demonstrated in Fig. 7.Under UV-vis irradiation, CO was found to be the only product of pristine TiO 2 , at a production amount of 12.2 mol/g in 4 h.For all the xAg photocatalysts, the CO production was higher than pristine TiO 2 and a small amount of CH 4 was also produced.This change in photoactivity and selectivity agreed with our previous work when precious metals such as Au or Ag was added to TiO 2 33,40,41.The CO 2 photoreduction activity increased with the Ag amount and reached the highest for the 5Ag sample, which was 4.6 times higher CO production than that of pristine TiO 2 , respectively.Further increasing the Ag content to 10, however, decreased the CO production but the activity of 10Ag was still higher than that of pristine TiO 2 .It is likely that too many Ag NPs on the surface acted as recombination centers and thus lowered the photoactivity.Since 5Ag outperformed other xAg samples, for the follow-up studies on Ag/MgO co-modified samples, the Ag content was fixed at 5 wt., while the number of MgO coating layers and the modification sequence were varied. Fig. 8 compares the CO 2 photoreduction performance of pristine TiO 2 , single-modified TiO 2 (7Mg and 5Ag) and co-modified TiO 2 (yMg5Ag and 5AgyMg) samples.Compared to pristine TiO 2 , the single-modified TiO 2 , i.e. either 7Mg or 5Ag samples showed much higher CO 2 conversion performance.The 7Mg sample did not produce CH 4 despite the higher production in CO than pristine TiO 2 , while the 5Ag sample had a higher CO production than 7Mg and a small production of CH 4 .All co-modified samples (yMg5Ag and 5AgyMg, where y 1-10) showed higher CO and CH 4 production than single-modified samples.In the range of y 1-7, the CO and CH 4 production increased with the thickness of MgO coating, and 7 layers of ALD coating was the optimum thickness for both yMg5Ag and 5AgyMg samples.When the thickness of MgO increased to 10 layers (10Mg5Ag and 5Ag10Mg), both CO and CH 4 production decreased compared to those with 7 layers.This trend agrees with our previous findings that an ultrathin layer of ALD coating increases photoactivity by passivating surface states while a \"thick\" layer prohibits charge transfer, and an optimum layer thickness exists determined by the trade-off between the positive and negative effects of the ALD layer 26,33,44. In order to better compare the overall photoactivity and investigate the synergy of co-modification, the total number of photoinduced electrons was calculated for each sample and listed in Table 2.Note that it takes 2 electrons to produce one molecule of CO and 8 electrons to produce one molecule of CH 4 .Thus, the total number of electrons generated in the reaction is a better indicator of the overall activity of the sample.The promotion factor in Table 2 is defined as the ratio of the total number of electrons generated on a sample to that generated on the pristine TiO 2 .By comparing the total number of electrons or the promotion factor, one can tell that the co-modified samples significantly outperformed the pristine TiO 2 and single-modified TiO 2 .The best sample among yMg5Ag is 7Mg5Ag, which has a promotion factor of 13; while the best sample among 5AgyMg is 5Ag7Mg, which has a promotion factor of 15. It is also noticed that 5AgyMg samples always outperformed yMg5Ag samples at the same y value, demonstrating the structural advantage of Ag NPs deposited on the outermost layer of MgO/TiO 2 over Ag NPs sandwiched between MgO and TiO 2 .One possible reason is the difference of Ag concentration and distribution on the catalyst surface.According to the XPS analysis result, the Ag concentration on the surface of 5Ag7Mg was 4.92 at., twice as much as that on the surface of 7Mg5Ag (2.25 at.).However, from the HRTEM analysis (Fig. 4), there is no discernable Ag NPs on 5Ag7Mg, whereas noticeable Ag NPs are observed on 7Mg5Ag despite a lower Ag surface concentration.This suggests that Ag was more uniformly distributed on the 5Ag7Mg sample and their sizes were probably too small to be detected by TEM.Note that in the materials preparation Ag is photodeposited on the catalyst surface through photoreduction of Ag ions to elemental Ag on photoactive sites.As MgO coated TiO 2 (e.g.7Mg) is demonstrated to be more active than pristine TiO 2 (Fig. 8), the 7Mg sample had more active sites than pristine TiO 2 and thus more uniform and larger number of Ag deposition on the catalyst surface (to form 5Ag7Mg) than on the less active pristine TiO 2 (to from 5Ag).For the 7Mg5Ag sample, the final ALD coating process would not change the Ag concentration.Hence, it is reasonable that 5Ag7Mg had a higher concentration but smaller size of Ag than 7Mg5Ag, contributing to its higher photocatalytic activity as observed in Fig. 8. The synergy effect of MgO and Ag co-modification can be demonstrated by promotion factor and the CH 4 /CO ratio, as listed in Table 2.The promotion factors for 7Mg and 5Ag are 3.4 and 5.3, respectively, while the promotion factors of 7Mg5Ag and 5Ag7Mg were 13.0 and 15.0, respectively.Clearly, the promotion factor of a co-modified sample (13 or 15) is larger than the sum of those of 7Mg and 5Ag (3.4 5.3 8.7), confirming the synergy of co-modification.The synergy of co-modification can also be observed from the product selectivity or the CH 4 /CO molar ratio.The CH 4 /CO ratio on pristine TiO 2 and 7Mg is zero as no CH 4 production was produced.With Ag modification, a small amount of CH 4 was produced on 5Ag and resulted in a CH 4 /CO ratio of 0.05.With MgO and Ag co-modification, the selectivity of CH 4 was significantly increased to the range of 0.13-0.24,a few times higher than that by 5Ag. As mentioned earlier, surface Ag concentrations on 7Mg5Ag and 5Ag7Mg determined by XPS were 2.25 at. and 4.92 at., respectively.To rule out the possibility that the better catalytic performance of 5Ag7Mg than 7Mg5Ag is not merely due to the higher Ag concentration, we have tried to synthesize a 7MgyAg sample that would have a similar Ag content as that in 5Ag7Mg.To achieve that, we have increased the amount of Ag in the precursor solution and synthesized 7Mg7Ag and 7Mg10Ag samples.The 7Mg10Ag is anticipated to have twice as much silver as on 7Mg5Ag, but the XPS analysis reveals 3.60 at.Ag, just 50 more than that on 7Mg5Ag.Nevertheless, their CO 2 photoreduction performances were tested and compared with 7Mg5Ag, and the result is shown in Fig. 9.There is a clear trend that the CO 2 photoreduction performance deteriorated with increased surface silver concentration.This result agrees with the literature that too much silver modification may act as recombination center that hinder the performance of photocatalysts 41.It is expected that with even higher surface silver concentration, the photocatalytic reduction performant might be even worse; thus no attempt was made to synthesize a 7MgyAg sample that has close to 4.92 at. silver to match that of 5Ag7Mg.It can be concluded that the higher CO 2 photoreduction performance of 5Ag7Mg than 7Mg5Ag and was not directly related to the surface silver concentration, but rather, to the finer and better distributed silver nanoparticles and more concentrated surface hydroxyls on the surface. To further understand the charge transfer characteristic of the photocatalysts, transient photocurrent tests were conducted on pristine TiO 2 , 7Mg5Ag and 5Ag7Mg samples and the results are presented in Fig. 10.The measurement was taken with the same Xe-lamp used in the CO 2 photoreduction experiments.The average photocurrent density (J as illustrated in Fig. 10) was calculated based on five measurements of J as shown in Fig. 10.Under Xe-lamp irradiation, the average photocurrent density of pristine TiO 2 was 2.0 A/cm 2 .The photocurrent densities of 7Mg5Ag and 5Ag7Mg were 9.8 A/cm 2 and 12.4 A/cm 2 , respectively, which are 4.9 times and 6.2 times as much as that of pristine TiO 2 .The promotion by Ag and MgO co-modification on boosting TiO 2 photocurrent density is very clear.The photocurrent density of 5Ag7Mg was 27 higher than that of 7Mg5Ag, matching the results from CO 2 photoreduction experiments.The higher charge transfer capability of 5Ag7Mg may be attributed to a higher Ag content and smaller Ag NP size on the catalyst surface that lead to increased contact area and shorter travel path for electron transfer to initialize CO 2 photoreduction process 33,52. To understand charge transfer properties of the prepared samples, electrochemical impedance spectroscopy tests were conducted.The EIS Nyquist plots of pristine TiO 2 , 7Mg5Ag and 5Ag7Mg under UV-vis irradiation are shown in Fig. 11.The radius of the arc of EIS reflect the charge transfer resistance 5,535455.Generally, a greater diameter indicates a larger charge transfer resistance and thus a lower reaction rate.The charge transfer resistance is in the order of 5Ag7Mg (43 ) 7Mg5Ag (58 ) pristine porous TiO 2 (92 ).This result correlates well with the catalytic activity and the photocurrent data of the three samples, further validating the benefit of co-modification of Ag and MgO and the importance of Ag content and distribution on the surface."
  },
  {
    "title": "Conclusions",
    "content": "Novel structured nanocomposite photocatalysts were prepared by modifying porous TiO 2 with ALD overcoating of MgO and surface deposition of Ag NPs to promote CO 2 photoreduction activity.The MgO and Ag co-modified TiO 2 showed significantly higher photocatalytic activity than pristine TiO 2 and single-modified TiO 2 .With 7 ALD layers of MgO coating and 5 wt.Ag loading on TiO 2 , the overall activity of CO 2 reduction to CO and CH 4 was enhanced by 14 times compared with pristine TiO 2 .The synergy of co-modification was also manifested by the higher CH 4 selectivity in the products.The optimum number of overcoating, i.e. 7 ALD layers, was determined by the trade-off between the positive surface passivation effect to mitigate charge recombination and the negative insulation effect to hinder charge transfer to the surface.The sequence of MgO/Ag modification and thus the different surface materials structures was found to have clear impact on the materials property and photocatalytic performance.Catalysts with Ag NPs being at the outermost layer of MgO coated TiO 2 was always more active than those with Ag NPs sandwiched between MgO and TiO 2 at the same thickness of MgO coating.The higher activity may result from more uniform distribution of Ag and larger number of Ag NPs or clusters on the surface.Findings from this work have provided insights on advancing materials design to achieve efficient photocatalysis. Fig. 1.Schematic of Ag and MgO co-modified TiO 2 samples prepared in two different ways by varying the modification sequence. Fig. 2. XRD pattern of prepared samples, (a) pristine TiO 2 , (b) 7Mg, (c) 5Ag, (d) 1Mg5Ag, (e) 3Mg5Ag, (f) 5Mg5Ag, (g) 7Mg5Ag, (h) 10Mg5Ag, (i) 5Ag1Mg, (j) 5Ag3Mg, (k) 5Ag5Mg, (l) 5Ag7Mg, (m) 5Ag10Mg. Fig. 3. SEM image of (a) pristine TiO 2 , (b) 7Mg5Ag, (c) 5Ag7Mg. Fig. 5. XPS spectra of (a) Ti 2p spectra, (c) O 1s spectra, (c) Ag 3d spectra of asprepared samples. photoreduction tests were conducted with continuous flow of CO 2 and water vapor under UV-vis irradiation.Several control experiments have been conducted: (a) CO 2 H 2 O without photocatalysts under UV-vis irradiation; (b) CO 2 H 2 O with photocatalysts in the dark; (c) Ar H 2 O with photocatalysts under UV-vis irradiation.No carbon containing products were observed in those control experiments, indicating that CO and/or CH 4 produced in CO 2 photoreduction process were indeed derived from CO 2 in the feed gas. Fig. 6.Photoluminescence spectra of as-prepared samples. Fig. 7. Activity of CO 2 photoreduction with water vapor by pristine TiO 2 and xAg samples under UV-vis irradiation for 4 h. Fig. 8. CO 2 photoreduction performance of as-prepared samples under UV-vis irradiation for 4 h with presence of water vapor. Fig. 9. CO 2 photoreduction performance on 7MgyAg with varied y value. Fig. 10.Transient photocurrent density curves for pristine TiO 2 , 7Mg5Ag, and 5Ag7Mg. Fig. 11.EIS Nyquist plot of pristine TiO 2 , 7Mg5Ag and 5Ag7Mg. Phase composition and crystallite size of prepared samples. Summary of CO 2 photoreduction performance, including the production and ratio of CO and CH 4 , number of photoinduced electrons, and promotion factor. This work is supported by U.S. National Science Foundation CAREER Award (CBET 1538404).Use of Texas AM University Materials Characterization Facility is acknowledged. Supplementary data associated with this article can be found, in the online version, at https://doi.org/10.1016/j.cattod.2019.03.012."
  }
]