[
  {
    "title": "Doi",
    "content": "10.1016/j.jtice.2013.09.013"
  },
  {
    "title": "Article_Title",
    "content": "Process modeling and optimization of simultaneous direct conversion of CO2 and CH4 greenhouse gas mixture over TiO2/webnet photocatalyst"
  },
  {
    "title": "Abstract",
    "content": "In this study, simultaneous direct conversion of CO 2 and CH 4 greenhouse gas mixture over the TiO 2 / webnet photocatalyst was studied.SEM, XRD and UV-visible spectra analyses were carried out for characterization of prepared catalysts.The experiments were done under UV irradiation in an appropriate gas-phase batch reactor.Effects of mesh size of webnet, TiO 2 /webnet dosage, calcination temperature, reactor's initial pressure, feed composition and UV light intensity were investigated and conversion of CO 2 and CH 4 were determined as process responses.Preliminary results showed that the most significant variables on the CO 2 and CH 4 conversion are TiO 2 /webnet dosage, calcination temperature and reactor's initial pressure.Thus, further experiments and optimization were performed with these three variables to evaluate process conditions using response surface methodology based on three-level central composite design.Maximum reduction of CO 2 (26.32) and CH 4 (31.63) were achieved at the optimum conditions: mesh size of 120, TiO 2 /webnet dosage of 1.15 g/cm 2 , calcination temperature of 400 8C, reactor's initial pressure of 60 psig, feed composition of 45 CO 2 :45 CH 4 :10 He and UV light intensity of 125 W."
  },
  {
    "title": "Experimental",
    "content": "Titanium dioxide P-25 (Anatase/Rutile: 80/20, particle size around: 25 nm, surface area: 55 AE 15 m 2 /g) was supplied by Degussa company, and used to coat on stainless steel webnet at different mesh sizes (60, 120 and 200 mesh).The stainless steel webnets were obtained from Haidian Hardware Store of Beijing in China.Also, the ultra-high purity CO 2 , CH 4 and He gases were used as a feed and neutral medium.Ethanol (96), nitric acid (65), hydrochloric acid (37) and acetone were obtained from Merck. A simple and efficient method was used in this study for immobilization of TiO 2 nano particles, which is ideal for industrialization, originally developed by scientists at ECN (Netherlands Energy Research Foundation) for deposition of TiO 2 on quartz slides to prepare solar cells 15.The same technique was applied with minor changes for preparing coatings of TiO 2 on stainless steel webnet to use them as photocatalysts.The details of immobilization technique for the photocatalyst preparation have been reported elsewhere 16. Each experiment was performed at about 60 8C in a batch photoreactor that was designed and built in the laboratory.The photoreactor was constructed from stainless steel with an effective volume of about 1.0 L. The photoreactor, comprised of coated titanium dioxide over the webnet, was assembled to transmit and spread light uniformly.Fig. 1(a andb) present photographs of the actual photoreactor system.For each experiment, in the first step, the TiO 2 powder was coated on cylindrical stainless steel webnet.Fig. 1(c) illustrates the difference between uncoated and coated cylindrical webnet.Then, coated TiO 2 over the cylindrical webnet was put into the reactor (Fig. 1(a)).The cap of photoreactor was sealed using O-rings and passed the leakage test (Fig. 1(b)).At the next step, reactor was vacuumed and then the photoreactor was filled by gaseous feed (CO 2 , CH 4 and He).Before illumination, feed was analyzed to quantify the initial concentration of feed components through using an on-line commercial gas chromatograph GC-CGCA-1 apparatus equipped with a thermal conductivity detector (TCD).These analyses were done isothermally at 50 8C using a parallel setup of two packed columns (Molecular sieve and Porapak Q).Then reactor continuously illuminated by UV lamp for 8 h.The UV lamp was vertically placed at the central part of the reactor.Each experiment was performed at about 60 8C.In this study, the reactor volume and UV power intensity were selected similar to some investigations in CO 2 photocatalytic reduction 17181920. The changes of CO 2 and CH 4 concentrations with irradiation time were measured at 1 h interval by an on-line commercial gas chromatograph GC-CGCA-1 apparatus.Decreasing (conversion ()) of CO 2 and CH 4 were used for evaluation the efficiency of photocatalytic degradation.Also, Fourier-transform infrared spectroscopy (FTIR) was recorded using MB160 FTIR spectrometer (ABB Bomem Inc., Canada) with special designed cell to characterize photoreduction products in gas phase.For analysis of the products, after certain time, the designed cell was jointed to output of photoreactor, filled with converted gases, and located in spectrometer. A Hewlett-Packard 8453 diode-array UV-vis spectrophotometer equipped with a 1.0 mm path length quartz micro-cell and controlled by a computer was applied for ultraviolet spectra acquisition.Also, X-ray diffraction (XRD) patterns of samples were recorded using EQUINOX diffractometer (Inel Company) operating with a Cu anode and a sealed X-ray tube.The 2u scans were recorded at several resolutions using CuKa radiation of wavelength 1.548A in the range 20-80 with 0.05 step size.Scanning electron microscopy (SEM) micrographs of the samples were prepared with a Leo 1455VP scanning electron microscope (Cambridge, England) operated at 10 kV. RSM along with the design of experiments remove systematic errors with an estimate of the experimental error and also reduces the number of experiments to obtain the optimum operating conditions.The DESIGN EXPERT 6.07 (Stat-Ease Inc., Minneapolis, MN, USA) software was used for regression and graphical analysis of the obtained data.There are many classes of response surface designs that are occasionally useful in practice such as Central Composite design, Box-Behnken design, Hybrid design and Threelevel Factorial design.Among these methods, the Central Composite Design (CCD) is the most frequently used under RSM design.The RSM employed in the current study was a central composite design (CCD) involving three different factors, TiO 2 / webnet dosage (A), calcination temperature (B) and reactor's initial pressure (C).The region of exploration for the process was taken as the area enclosed by TiO 2 /webnet dosage (0.3-2 g/cm 2 ), calcination temperature (200-600 8C) and reactor's initial pressure (30-90 psig) boundaries.The CO 2 and CH 4 conversion were evaluated based on the CCD experimental plan.The design consisted of 2k factorial points augmented by 2k axial points and a center point where k is the number of variables.The levels of three operating variables vary from a low to high value which are numerically expressed or coded as A1 and 1. Intermediate level is coded as ''0''.These three levels were assessed based on the full face-centered CCD experimental plan.Accordingly, a total of 20 experiments were employed in this work, including 15 experiments designed in a factorial design (including 7 factorial points, 7 axial points and 1 center point), and 5 replications at the center point to get good estimate of experimental error.Repetition experiments were conducted after other experiments followed by order of runs designed by central composite design (CCD) as indicated in Table 1. Application of RSM involves several phases which are screening of variables, alternative of the experimental design, codification of the levels of the variables, mathematical-statistical treatment of data, evaluation of the fitted model and determination of the optimal conditions.The relationship between the response, input and the quadratic equation model for predicting the optimal variables were identified using the following: where, Y, i, j, , X are process response, linear coefficient, quadratic coefficient, regression coefficient and coded independent variables, respectively.Model terms are selected or neglected based on the probability of error (P) value with 95 confidence level.The results obtained from CCD were entirely examined by means of analysis of variance (ANOVA) by Design Expert software.Threedimensional (3D) plots and their respective contour plots were obtained based on the effect of the levels of the two factors while other factors can be changed by default.Consequently, the results of CCD can be obtained as 3D presentations for visualization and also as contours to appreciate the simultaneous interaction of the three variables on the responses.The experimental conditions and results are depicted in Table 1.The average percent errors for CO 2 and CH 4 conversion were approximately A5.8 and A9.1, respectively."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The surface morphologies of the three different mesh sizes of stainless steel webnets coated with TiO 2 before the photocatalytic reaction are shown in Fig. 2. SEM observation revealed that the coatings were bonded well to the webnets and with increasing mesh webnets from 60 to 200 mesh, the surface area of photocatalyst increase but the size of webnets holes decrease (compare the Fig. 2(a, b, andc) with together).The surface of 60 mesh webnet specimen (Fig. 2(a)) consists of deeper crevasses than surface of the 120 and 200 mesh webnet specimens (Fig. 2(b andc)).Also, no major cracks were observed for the TiO 2 coated on 200 mesh webnet specimen in the SEM micrographs (Fig. 2(c)).It can be seen that the surface of 60 mesh webnet is irregular in comparison to other sizes.With respect to surface property of webnets, the wires used in the structure of webnets have relatively smooth surface.Therefore, the TiO 2 particles are located in the pores and the wires are approximately bare.It can be expected that in the three different mesh sizes of webnets, the photocatalytic layer thickness is relatively constant. In the case of TiO 2 /webnet dosages, SEM observation (Fig. 3) revealed that with increasing TiO 2 dosage from 0.3 g/cm 2 (Fig. 3(a)) to 2.0 g/cm 2 (Fig. 3(b andc)), the surface area of photocatalyst increase but the size of webnets holes decrease.Also, for suitable immobilization and increasing durability of TiO 2 on the support, particles were calcinated after coating on the webnet surface (Fig. 4).In the case of calcination temperatures, SEM observation revealed that the TiO 2 had not enough mechanical stability at 600 8C and it lead to decrease of surface area (compare the Fig. 4(a, c, ande) with together).The calcination at the optimum calcination temperature (Fig. 4(d)) leads to decrease of agglomeration and uniform distribution of particles and therefore, increases the activation of catalysts (compare the Fig. 4(b, d, andf)) with together).Also, the calcination at the optimum calcination temperature (Fig. 4(d)) leads to increasing of surface area due to decreasing mean crystallite dimension (compare the Fig. 4(b, d, andf) with together).Fig. 5 shows the UV-vis absorption spectra of the TiO 2 .The results show two effects include improvement of absorption intensity, and shift of absorption peak to visible area.The maximum absorption peak was found at 330 nm for TiO 2 .However, the commercial TiO 2 showed weaker absorption in the whole region.Also, on the basis of the maximum absorption wave, the band gap of the prepared calcinated TiO 2 photocatalyst can be estimated to be 3.76 eV 21. For investigation the quality of coatings from the structural aspect, i.e. whether or not TiO 2 crystals have found obvious changes in structural properties and crystallite size during the calcination process, the XRD patterns of the coated samples were assessed (Fig. 6).The XRD results of coated TiO 2 before and after calcination did not show any significant changes in the structure of photocatalysts as a consequence of the coating and calcination processes. CO 2 and CH 4 conversion in a photocatalitic reactor with TiO 2 / webnet catalyst depends on a multitude of variables.Among these, six main factors which affect the process are mesh size of webnet, TiO 2 dosage, calcination temperature, reactor's initial pressure, feed composition, and UV light intensity.Thus, a first set of experiments was performed to access the effect of each factor and also determine most critical operating factors on the CO 2 and CH 4 conversion.A total of 15 experiments including 6 variables were generated.Parameters ranges were adjusted based on primary investigations on a single factor.The results of preliminary experiments are summarized in Table 2.In the first set of experiments (Table 2: runs 1-3), evaluation of the photocatalytic activities of TiO 2 coated on three different mesh webnets in the photodegradation of CO 2 and CH 4 demonstrated the TiO 2 on 120 mesh with yields significantly higher than that of TiO 2 on 60 and 200 meshes.This performance can be attributed to two opposing factors.With increasing mesh size, the surface area of catalyst increase, but the amount of UV light passing through the holes and consequently using of TiO 2 photocatalyst in the behind surface of webnet due to decreasing the size of holes, decrease (compare the Fig. 2(a, b, andc) with together).So there existed an optimum mesh size used as a support under our experimental conditions. Also, the performance results show that the photocatalytic conversions of primary reactants are reached to stable amounts (after 2 h of the reaction).It seems that the stability in the conversion of CH 4 and CO 2 can be due to adsorption of gaseous reactants and products on the photocatalyst surface.Similar results have been reported on the performance of Cu/CdS-TiO 2 / SiO 2 photocatalyst by Shi et al. 8.They showed that the conversion of CO 2 and CH 4 reduces to zero in about 2 h.In the other set of experiments, the influence of initial ratios of feed compositions (CO 2 :CH 4 :He), varying from (0:90:10) to (90:0:10) on the degradation rate of CO 2 and CH 4 was investigated (Table 2: runs 2, 10-13).The TiO 2 film on 120 mesh webnet, after 8 h of UV illumination showed the highest activity when exposed to (45:45:10) of initial ratios of feed compositions. In the set of UV light intensity experiments (Table 2: runs 2, 14-15), the influence of UV light intensity varying from 80 to 250 W, on the degradation rate of CO 2 and CH 4 was investigated.The results obtained in this study indicated that an increase in this variable from 80 to 125 W caused an increase in the response while, further increment in the variable from 125 to 250 W decreased the response.The rate of photon of energy increased linearly as the UV intensity increased.It means that electron-hole generation process was positively affected by rate of photon irradiation.Consequently, the rate of reaction closer to semiconductor surface improves; thus with increasing of light intensity from 80 to 125 W, CO 2 and CH 4 conversion increased.On the other hand when the light intensity increased from 125 to 250 W, the CO 2 and CH 4 conversion decreased due to the photon absorption on the TiO 2 may be saturated, thus input photons are over supplied, when UV irradiation is very high under our experimental condition.That is, light energy could be wasted if photon flux is higher than the absorption capacity of a photocatalyst.Furthermore, the conversion of CO 2 and CH 4 decreased dramatically with increasing of reaction temperature in the presence of 250 W of light intensity, because of desorption of CO 2 and CH 4 .So, there existed an optimum UV light intensity.UV light intensity 125 W was found to be having the highest efficiency under our experimental conditions. From the results of preliminary experiments except TiO 2 dosage, calcination temperature and reactor's initial pressure, other variables did not have the significant effect on the process.Thus, modeling and optimization of the process were performed with these variables and other variable were kept in the optimal condition that obtained from the preliminary study.The effects of these three variables will discuss completely in the following section. RSM has been applied to optimize the maximum CO 2 and CH 4 conversion based on three operating variables, TiO 2 dosage (g/ cm 2 ), calcination temperature (8C) and initial pressure (psig) of the process.The low and high ranges of those operating variables were chosen according to preliminary analyses (Table 2).The central composite design (CCD) allows the development of mathematical equations where predicted result Y (CO 2 or CH 4 conversion ()) were assessed as a function of A (TiO 2 dosage (g/cm 2 )), B (calcination temperature (8C)) and C (initial pressure (psig)) and calculated as the sum of a constant, three first-order effects (terms in A, B, and C), three second-order effects (A 2 , B 2 and C 2 ) and three interaction effects (AB, AC and BC).In RSM, adequacy and significance of results were analyzed and viewed in ANOVA.Fitting of the data to various models (linear, two-factor interaction, quadratic and cubic) are shown in Table 3. Their subsequent ANOVA showed that CO 2 and CH 4 conversion were most suitably described with quadratic models.The predicted values, for the responses obtained from the model were sufficiently correlated to the observed values (Table 1).The average percent errors for CO 2 and CH 4 conversion were approximately A5.8 and A9.1, respectively. Multiple regression coefficients of quadratic and cubic models describing the CO 2 and CH 4 conversion are summarized in Tables 4 and5.F-value and P-value were computed to determine the significance of each coefficient.Values of ''Prob F'' less than 0.05 indicate model terms are significant.Based on the P-values, A, B, A 2 , B 2 , C 2 were significant model terms for each of responses.Other model terms (C, AB, AC, BC) are not significant (with a probability value larger than 0.05) and were eliminated.As observed in Table 4, the first order effects of TiO 2 dosage (g/cm 2 ) and initial pressure (psig) and second order effect of all of variables produce the main effects on the CO 2 and CH 4 conversion.The analysis of variance (ANOVA) was employed to examination the significance of the fit of the models under an extensive range of operating conditions.The results are depicted in Table 6.The ANOVA results revealed that the quadratic models were significant at the 5 confidence level since P-values (0.0001) were less than 0.05 for both models.On the basis of computed Fisher Ftest value that explains the distribution of the actual data around the fitted model and corresponding probability value, 29.6 and 0.0001 for CO 2 conversion and 33.7 and 0.0001 for CH 4 conversion (Table 6), we concluded that this model can be characterized as highly significant in predicting the CO 2 and CH 4 conversion.The fitting of models to the empirical data was tested by calculating determination coefficient (R 2 ).The high value of R 2 (0.96 for CO 2 conversion and 0.94 for CH 4 conversion) designates the capability of developed models to satisfactorily describe the system behavior within the investigated range of operating parameters. Adequate precision (AP) compares the range of the predicted values at the design points to the average prediction error.Ratios greater than 4 indicate adequate model discrimination and can be used to navigate the design space defined by the CCD.In this study, the ratios of AP value were found to be 14.6 and 15.9 for CO 2 and CH 4 conversion respectively, which are greater than 4 and considered a satisfied result. Other important information about fitting, correlation between observed and predicted data, on the models performance can be attained in the diagnostic plots (Fig. 7).These figure giving an obvious sight in any deficiency of model fitting to the experimental data.The R 2 values of 0.96 and 0.94 is in reasonable agreement with the ''Adj-R 2 '' values of 0.93 and 0.91 for CO 2 and CH 4 conversion respectively, showing a very good agreement between the predicted and actual data.Also, it can be seen that all points of experimental runs are randomly distributed and all values lie within the range of A3 and 3.These findings indicated that the models proposed by RSM are satisfactory and that the constant variance assumptions were confirmed 22,23. In order to investigate the effects of the variables studied on CO 2 removal efficiency, dependency of this response to the variables was analyzed and modeled.From the analysis carried out (Table 4), a reduced quadratic model was selected to describe the variation of the response (Eq.( 2)). CO 2 conversion 14 25:13 5:13A A 2:07B A 7:55A 2 It is clear that the most significant factor among the three factors on the response is TiO 2 dosage (g/cm 2 ).So that, the CO 2 conversion increased remarkably with increasing TiO 2 dosage from 0.3 to 1.15 (g/cm 2 ).On the contrary, CO 2 conversion decreased gradually with the increase of TiO 2 dosage from 1.15 to 2 (g/cm 2 ).These results (Table 2: runs 2, 4-5), indicated the amount of TiO 2 used in photo catalytic studies plays a crucial role in getting efficient changes in the reaction-product yield.Therefore, higher amount of catalyst may not be useful due to possible aggregation resulting in a loss of surface area available for light-harvesting.The obtained results in this study indicated, that the increase in catalyst dosage leads to the two opposite effects.The total active sites increase with increasing catalyst dosage but the amount of UV light passing through the holes and consequently activation of TiO 2 in the behind surface of webnet due to decreasing the size of holes.So, there existed an optimum coated TiO 2 mass.The TiO 2 dosage by 1.15 g/cm 2 value was found to be having the highest efficiency under our experimental conditions. Also, the increase in calcination temperature leads to the two opposite effects.An increase in this variable from 200 to 400 8C caused an increase in the response while, further increment in the variable from 400 to 600 8C decreased the response.This was due to this fact that calcination temperature can lead to changes in the crystal size, surface area, and TiO 2 structure.The catalyst photoactivity may change with all these factors.In this study (Table 2: runs 2, 6-7), the influence of calcination temperature varying from 200 to 600 8C, on the degradation rate of CO 2 and CH 4 was investigated.The maximum calcination temperature used for samples preparation in this study was 600 8C, and at this temperature the conversion of CO 2 decreased due to: a) Decreasing of anatase/rutile ratio in TiO 2 (The anatase form of titanium dioxide has the desirable properties of being chemically stable, readily available, and active as a catalyst for the photocatalytic process.Enhanced photocatalytic activity of anatase compared to rutile is in accordance with literature reports stating that anatase has usually a better photocatalytic activity than rutile 24.The band gap of anatase form TiO 2 is 3.2 eV, making it a perfect candidate for UV illumination.Also according to the literature 25, the anatase/rutile ratio begins to decrease as a result of treatment at temperature between 600 and 800 8C).b) In addition, Fe 3 ions have been reported to be present in TiO 2 coated steel plates heated at 600 8C and more, but not at lower temperatures 26.Iron impurities resulting from heating the steel webnet could have a negative effect on the photocatalytic efficiency of the catalyst.c) Also, we obviously see that TiO 2 had not enough mechanical stability at 600 8C and it lead to decrease of surface area (compare Fig. 4(a, b, andc) with together).On the other hand, due to low mechanical strength of TiO 2 coated stainless steel webnet, the catalysts must be calcinated at high temperature.So there existed an optimum calcination temperature.It is clearly shown that the TiO 2 film treated at 400 8C exhibits the highest photo-activity for CO 2 and CH 4 degradation. The maximum values of the response were obtained respectively to be 19.6,26.3 and 17.6 at initial pressures of 30, 60 and 90 psig.Two opposite impacts of the pressure on CO 2 conversion was observed as the variable increased.It was found that, CO 2 conversion is improved with increasing of initial pressure from 30 to 60 psig, while further increment in the variable from 60 to 90 psig decreased the response.The decrease in CO 2 conversion at high initial pressure occurred due to various reasons without much conviction or quantification (Table 2: runs: 2, 8-9).A possible explanation is that, the tendency toward accumulation of reaction products on the TiO 2 surface at high initial pressure resulted into catalyst deactivation.On the other hand, according to the Le Chatelier's principle, with the extraordinary increasing of the initial pressure of system, the reaction favors in the reverse order and conversion of products to reactants.Also, the conversion of CO 2 and CH 4 rates should be gradually less dependent on CO 2 and CH 4 at very high concentrations due to the depletion of unoccupied surface active sites.So there existed an optimum reactor's initial pressure.Reactor's initial pressure 60 psig was found to be having the highest efficiency under our experimental conditions.ANOVA results for CH 4 conversion percentage are shown in Table 6.As it is noted in the table, a quadratic model was fitted with the experimental data.The modified quadratic model shows that the first order effects of TiO 2 dosage (g/cm 2 ) (A) and initial pressure (C) and second order effects of the all variables (A 2 , B 2 , and C 2 ) are significant model terms on CH 4 conversion.Other model terms such as B, AB, AC and BC are not significant (with a probability value larger than 0.05).Therefore, these model terms were excluded from the study to improve the model.The following regression equations are the empirical models in terms of coded factors for CH 4 conversion percentage (Eq.( 3)): CH 4 conversion 14 30:37 6:02A A 1:80C A 7:23A 2 A 7:63B 2 A 7:83C 2 (3) The effect of TiO 2 dosage (g/cm 2 ) and calcination temperature (8C) at the initial pressures 60 psig is shown in Figs. 8 and9.An increase in the TiO 2 dosage (from 0.3 to 1.15 g/cm 2 ) and calcination temperature (from 200 to 400 8C) increases the CO 2 conversion, while further increment in the variables from 1.15 to 2.0 and 400 to 600 8C, for TiO 2 dosage and calcination temperature respectively, decreased the response (Fig. 8).Also, the highest CH 4 conversion can be achieved with a middle value of all variables (Fig. 9).The maximum value of the CH 4 conversion efficiency was obtained to be 31.7at TiO 2 dosage (g/cm 2 ), calcination temperature (8C) and initial pressures, respectively, 1.15 g/cm 2 , 400 8C and 60 psig, whereas, the minimum values of the response were found to be 1.7 at TiO 2 dosage of 0.3 g/cm 2 , calcination temperature of 600 8C and initial pressures of 90 psig.The reasons of these results of CH 4 conversion are similar to the reasons of findings of CO 2 conversion."
  },
  {
    "title": "Conclusions",
    "content": "The efficiency of photodegradiation of CO 2 and CH 4 on TiO 2 / webnet catalyst was investigated with changing various experimental parameters.On analysis of the results from the experimental studies, optimum experimental conditions were found to be mesh size of 120, TiO 2 /webnet dosage of 1.15 g/cm 2 , calcination temperature of 400 8C, reactor's initial pressure of 60 psig, feed composition of 45 CO 2 :45 CH 4 :10 He and UV light intensity of 125 W. The result showed 26.32 and 31.68conversion of Carbon Dioxide and Methane, respectively, under the optimum experimental conditions.Also, during photo degradation of CO 2 and CH 4 at optimum conditions, formate and acetate derivatives and ethane were detected as products.Also, the XRD results did not show any significant changes in the structure of photocatalysts as a consequence of the coating and calcination processes.It was concluded that the calcination process has not significant influence on crystalline morphologies of photocatalyst particles. Fig. 1.The present of (a) open photocatalytic reactor with its cap and UV lamp situation, (b) the assemble photoreactor, and (c) coated and uncoated cylindrical stainless steel webnets with titania particles. Fig. 2. The SEM images of TiO 2 film coated on (a) 60 (b) 120, and (c) 200 mesh webnet (calcination at 400 8C, TiO 2 dosage: 1.15 g/cm 2 ). Fig. 3.The SEM images of TiO 2 film coated on 120 mesh webnet with TiO 2 dosage; (a) 0.3 g/cm 2 , (b) 1.15 g/cm 2 and (c) 2.0 g/cm 2 (TiO 2 film coated on 120 mesh webnet and calcination at 400 8C). Fig. 4. The SEM images of TiO 2 film coated on 120 mesh webnet; at different calcination temperature (a and b) 200 8C, (c and d) 400 8C and (e and f) 600 8C (TiO 2 dosage: 1.15 g/ cm 2 ). Fig.5.The UV-vis spectra of TiO 2 /webnet photocatalyst, before and after calcination at 400 8C.Fig.6.The XRD patterns of TiO 2 /webnet photocatalyst, before and after calcination at 400 8C. Fig. 7. Predicted vs. actual values plot for (a) CO 2 conversion (), (b) CH 4 conversion (). Fig. 8. Response surface plot for CO 2 conversion () with respect to TiO 2 dosage (g/cm 2 ) and calcination temperature (8C) at constant value of reactor's initial pressure of 60 psig. Fig. 9. Response surface plot for CH 4 conversion () with respect to TiO 2 dosage (g/cm 2 ) and calcination temperature (8C) at constant value of reactor's initial pressure of 60 psig. Experimental conditions and results of central composite design. Preliminary experiments conducted to access the effect of each factor and determine most critical operating factors on the CO 2 and CH 4 conversion. A: mesh size of webnet; B: TiO 2 /webnet dosage; C: calcination temperature; D: reactor's initial pressure; E: feed composition; and F: UV light intensity. Analysis of variance (ANOVA) for fit of CO 2 and CH 4 conversion () to various models. Estimated regression coefficients and corresponding to ANOVA results from the data of central composite design experiments before elimination of insignificant model terms. Estimated regression coefficients and corresponding to ANOVA results for cubic models before elimination of insignificant model terms. Analysis of variance (ANOVA) for fit of CO 2 and CH 4 conversion () from central composite design after elimination of insignificant model terms.Adj.R 2 : adjusted R 2 ; SD: standard deviation; CV: coefficient of variation; PRESS: predicted residual error sum of squares; AP: adequate permission; PLF: probability for lack of fit. Insig.Insig.Sig.Insig.Sig.Insig.Insig.Insig.Insig.Insig.Insig.Insig.CH 4 Sig.Insig Insig.Sig.Sig.Sig.Insig.Insig.Insig.Insig.Insig.Insig.Insig."
  }
]