[
  {
    "title": "Doi",
    "content": "10.1016/j.carbon.2021.06.040"
  },
  {
    "title": "Article_Title",
    "content": "CsPbBr3 perovskite quantum dots anchored on multiwalled carbon nanotube for efficient CO2 photoreduction"
  },
  {
    "title": "Abstract",
    "content": "Converting CO 2 into valuable fossil fuels through artificial photosynthesis is regarded as an appealing approach to address the problems of global warming and energy crisis, which primarily depends on the development of robust and effective photocatalysts.Herein, we illustrate the construction and fabrication of a multiwalled carbon nanotube (MWCNT)/CsPbBr 3 perovskite quantum dots (QDs) nanocomposite with efficient CO 2 photoreduction activity.In this photocatalytic system, the highly conductive MWCNT acts as an electron acceptor to inhibit the carrier recombination in the CsPbBr 3 QDs.When the content of MWCNT was 4.0 wt, the resultant CsPbBr 3 /MWCNT exhibited the optimum photocatalytic performance, with the yields of CO and CH 4 3.14 and 2.13 times that of pristine CsPbBr 3 QDs, respectively.The rapid electron extraction and transfer from CsPbBr 3 QDs to MWCNT, as well as the enhanced visible light harvesting ability accounted for the remarkable photocatalytic performance.This work is anticipated to provide new pathway for designing efficient perovskite-based photocatalyst in energy conversion applications."
  },
  {
    "title": "Experimental",
    "content": "Oleic acid (OA, 90), oleylamine (OAm, 90), 1-octadecene (ODE, 90), cesium carbonate (Cs 2 CO 3 , 99.9), and PbBr 2 (99.9) were purchased from Adamas.Acetone (99.5), hydrochloric acid (HCl, 36e38), and toluene (99.5) were purchased from Greagent. Multiwalled carbon nanotubes (MWCNT, 98, 0.5e2 mm in length, 5e10 nm in diameter) can be purchased from Aladdin. Pre-acid treatment is the necessary process to purify the aspurchased MWCNT.A certain amount of MWCNTs was added into dilute hydrochloric acid solution (2 M) under stirring for 6 h, which was further sonicated at room temperature.Subsequently, it was centrifuged and washed for several times to eliminate metal impurities.Finally, the acid-treated MWCNTs were dried under vacuum and then ground for further use. CsPbBr 3 QDs were prepared according to Protesescu's method with some modifications 42: Firstly, Cs-OA solution was prepared by adding 100 mg of Cs 2 CO 3 along with 4 mL of ODE and 0.6 mL of OA into a 50 mL three-neck flask.After being dried at 120 C for 0.5 h under Ar flow, the mixture was heated at 150 C until all the Cs 2 CO 3 was dissolved.Then the mixture of PbBr 2 (0.188 mmol), ODE (5 mL), OA (0.5 mL) and OAm (0.5 mL) were loaded into another three-neck flask and held at 130 C under Ar for the complete solubilisation of PbBr 2 .Subsequently, the temperature was increased to 150 C, followed by swift injection of 0.5 mL Cs-OA solution.Five seconds later, the mixture was cooled immediately with ice-water bath.The final product was separated by centrifugation and washed with ethyl acetate for several times, followed by drying at 60 C under vacuum for 10 h. The synthesis method of the MWCNT/CsPbBr 3 nanocomposite was displayed in Fig. 1: Firstly, the acid-treated MWCNT powders were added into 10 mL of toluene and treated by ultrasonic wave for more than 30 min to ensure the dood dispersion of MWCNT.Then, 100 mg of CsPbBr 3 QDs were added into the above mixture with constant stirring overnight.After centrifugation of the above mixture, the precipitate was collected and dried for 12 h, which was then ground into powder for the following characterization.The mass percentage of MWCNT in the MWCNT/CsPbBr 3 nanocomposites were 1.0 wt, 4.0 wt, and 7.0 wt, respectively. X-ray diffraction (XRD, Rigaku MiniFlex X-ray Diffractometer) was tested to observe the structure and phase of the samples.Transmission electron microscopy (TEM, JEOL JEM-2100F) was performed to exhibit the morphology of CsPbBr 3 QDs, MWCNT, and the MWCNT/CsPbBr 3 nanocomposites.Element mapping of the nanocomposites was also obtained from the same instrument equipped with energy dispersive X-ray spectroscopy (EDX).To investigate the chemical composition of the as-prepared samples, a photoelectron spectrometer (PerkinElmer) was used to obtain the data of X-ray photoelectron spectroscopy (XPS).Fourier-transform infrared (FT-IR) spectra was conducted on a spectrometer (Nicolet iN10, Frontier) in KBr pellet.Raman spectra were recorded on a Horiba Scientific Raman spectrometer using a 633 nm laser light.The UVevis absorption behaviors were investigated using a UVevis spectrometer (PE Lambda 900).Photoluminescence (PL) spectra were obtained from an fluorescence spectrometer (Edinburgh FLS 9800) with 365 nm excitation.The time-resolved photoluminescence (TRPL) were recorded on the same instrument, and a triexponential decay kinetic was used to calculate the average PL lifetimes (t average ): . Photoelectrochemical characterizations were performed on a CHI 650E three electrode cell with a reference electrode of Ag/AgCl, a counter electrode of Pt mesh, and a working electrode of CsPbBr 3 QDs or MWCNT/CsPbBr 3 composites on FTO glass.Tetrabutylammonium hexafluorophosphate (TBAPF 6 ) dissolved in ethyl acetate (0.1 M) was used as the electrolyte.Photoelectrochemical measurements were tested under a 300 W Xenon lamp with a 420 nm filter to eliminate the ultraviolet light. The CO 2 photoreduction tests were performed in a 50 mL sealed Pyrex bottle, which was filled with 8 mg of photocatalyst, 100 mL of deionized water and 30 mL of acetonitrile.In this experiment, acetonitrile was chosen as the solvent on account of its mild polarity for stabilization of CsPbBr 3 and high solvability of CO 2 .After the reaction system was evacuated completely, it was refilled with high purity CO 2 .A 300 W Xenon lamp (420 nm UV-cut filter) was equipped to provide visible light.The.CO 2 -reduction products were analyzed using gas chromatograph (GC9700, Fuli Analytical Instrument Co., Ltd.)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The CsPbBr 3 QDs were anchored on MWCNT by a self-assembly method.It is worth noting that as in the case of pristine CsPbBr 3 QDs, the MWCNT/CsPbBr 3 composites also have an excellent dispersion in toluene (Fig. S1(a)).Moreover, with the increase of MWCNT contents, the color of the MWCNT/CsPbBr 3 composites in toluene turned darker from green to olive-black.As displayed in Fig. S1(b), all the colloidal solutions of CsPbBr 3 and MWCNT/ CsPbBr 3 composites became fluorescent green under UV light.The morphologies of MWCNT, CsPbBr 3 , and MWCNT/CsPbBr 3 composites were determined by TEM and high resolution TEM (HRTEM).As exhibited in Fig. 2a-c and Figs.S2aed, MWCNT was composed of hollow tubular structure with an average diameter of ca. 10 nm.The TEM image in Fig. 2(d) indicated that pristine CsPbBr 3 QDs were cubic-shaped nanocrystals with high crystallinity.The characteristic interplanar spacing of 0.58 nm (Fig. 2(e)) was consistent with the (110) planes of orthorhombic CsPbBr 3 .The size distribution statistics (Fig. 2(f)) showed that the as-prepared CsPbBr 3 QDs had an average size of ca. 10 2 nm with good monodispersity.The TEM image of the MWCNT/CsPbBr 3 composite (Fig. 2(g)) confirmed that most MWCNT were decorated with CsPbBr 3 QDs, and the nanocrystals distributed on the surface of MWCNT uniformly without detectable local aggregation.Moreover, the HRTEM image in Fig. 2(h) revealed that highly crystalline CsPbBr 3 QDs were anchored on MWCNT.The lattice parameter of 0.58 nm confirmed that CsPbBr 3 retained the original orthorhombic phase during the self-assembly process.In addition, The EDX spectrum of the MWCNT/CsPbBr 3 composite (Fig. 2(i)) revealed the existence of C, Br, Pb and Cs elements, and the corresponding EDX elemental mapping indicated a homogeneous distribution of the Br, Pb and Cs elements on the surface of the nanotubes (Fig. 3). Then, the crystal structures of the MWCNT/CsPbBr 3 composites with different contents of MWCNT were studied using XRD, as presented in Fig. 4(a).For all the samples, the XRD patterns showed typical diffraction peaks of orthorhombic CsPbBr 3 , which accorded well with the standard pattern (JCPDS 18e0364).This result was consistent with that of the TEM observations.In addition, no diffraction peaks from MWCNT could be detected in the MWCNT/ CsPbBr 3 composites, which was owing to the low content of MWCNT.Moreover, the optical properties of the products were analyzed using UVevis absorption spectra, which was depicted in Fig. 4(b).For pristine CsPbBr 3 QDs, a notable visible absorption with an edge of ca.545 nm could be observed, corresponding to a band gap of 2.3 eV.The absorption for visible light increased substantially after the introduction of MWCNT, indicating superior visiblelight harvesting capability of the composite for the creation of more photo-generated electron-hole pairs.Furthermore, the visible absorption intensity increased with the increase of the MWCNT content.This phenomenon was in accordance with the color change of the samples, as displayed in the inset of Fig. 4(b).The remarkable optical properties implied the potential ability of the MWCNT/CsPbBr 3 composites for visible-light-induced CO 2 photoreduction. The chemical structure and interaction in CsPbBr 3 , MWCNT, and MWCNT/CsPbBr 3 composites were researched by FTIR and Raman measurements.Fig. 5 showed the FTIR spectra of the prepared samples.For pristine CsPbBr 3 QDs, the signals at 1536 and 1629 cm A1 were assigned to the -CO stretching, and the signals at 2847 and 2919 cm A1 were characteristic of the -CH 3 vibration modes.In the FTIR spectrum of MWCNT, two characteristic peaks were observed, with the one at 1634 cm A1 attributed to C-H stretching modes, and the one at 3460 cm A1 assigned to -OH stretching of hydroxyl group 43.As demonstrated in the FTIR spectrum of the MWCNT/CsPbBr 3 composite, the composite integrated all the above peaks of CsPbBr 3 and MWCNT, suggesting the successful integration of the two components.Raman spectroscopy was further conducted to confirm the presence of carbon in the composite (Fig. S3).MWCNT exhibited two strong signals in the 1000e2000 cm A1 range.One peak is related to the D band (1346 cm A1 ), which is associated with the amorphous/disordered carbon.The other peak at 1578 cm A1 is related to the G band, which can be attributed to the graphitic carbon (sp 2 ) in MWCNT.Both the two characteristic peaks of MWCNT are prensent in the Raman spectrum of the MWCNT/CsPbBr 3 composite, along with a weaker signal at 117 cm A1 , which was assigned to the motion of Cs ions in relation to PbBr 6 octahedra 44.The above results further affirmed the successful combination of MWCNT and CsPbBr 3 QDs. Subsequently, XPS was conducted to study the elemental composition and surface valence state of the as-fabricated samples.The full spectrum confirmed the presence of Cs, Pb, Br and C elements in the MWCNT/CsPbBr 3 composite (Fig. S4).As shown in Fig. 6(a), the Cs 3d spectra of CsPbBr 3 QDs showed two peaks, which were located at 723.8 eV (Cs 3d 5/2 ) and 737.7 eV (Cs 3d 3/2 ), respectively.Compared with CsPbBr 3 , the Cs 3d spectra of MWCNT/ CsPbBr 3 composite were shifted positively to 723.9 and 737.8 eV.Similar phenomenon could be observed for the binding energies of Pb 4f in the MWCNT/CsPbBr 3 composite (Fig. 6(b)), with a slight shift of 0.2 eV to the higher value.This observation indicated an electron transfer from CsPbBr 3 QDs to MWCNT occurred upon hybridization.Consistently, the peaks of Br 3d spectrum of the MWCNT/CsPbBr 3 composite (Fig. 6(c)) shifted to lower values of 67.7 and 68.7 eV, respectively, to balance the electron redistribution in the composite.Generally, for the hybrid materials, the shift of binding energies could be attributed to the interfacial interactions between the components 45,46.Hence, the shifts of binding energies of the constituent elements implied an intimate electronic interaction between MWCNT and CsPbBr 3 QDs.In addition, The C 1s spectra have been divided into three peaks (Fig. 6(d)).The main peak at 284.4 eV was ascribed to CC, which arised from the graphitic structure of MWCNT in the form of sp 2 hybridization.The peak at 284.9 eV was assigned to C-C (sp 3 hybridized carbons), which represented the defect structure of MWCNT.The weakest peak at 287.9 eV was attributed to CO, which revealed that MWCNT underwent an acid oxidation process. Photoluminescence (PL) spectra was an extensively employed technique to investigate the interfacial charge transfer in heterostructure semiconductors directly 47.Hence, steady-state PL spectra of CsPbBr 3 and MWCNT/CsPbBr 3 composites were probed with 365 nm excitation.As illustrated in Fig. 7, pristine CsPbBr 3 QDs showed a prominent PL emission centered at 521 nm.However, after being anchored on MWCNT, the PL intensity was severely reduced, and the PL intensity weakened monotonically with increasing the MWCNT content.This phenomenon agreed well with the photographs in the inset of Fig. 7, which showed that the PL emission gradually decreased in the order of CsPbBr 3 MWCNT/ CsPbBr 3 (1 wt) MWCNT/CsPbBr 3 (4 wt) MWCNT/CsPbBr 3 (7 wt).This observation arised from the introduction of MWCNT, which brought about an additional electron transfer channel besides intrinsic radiative pathway of excited-state charge carriers. Moreover, an apparent blue shift of the emission peak from 521 nm to 516 nm was observed, possibly on account of the BursteinAMoss effect 30.The quenched PL intensity, along with the blue shift, indicated an efficient photo-excited electron transfer from CsPbBr 3 to MWCNT. The as-synthesized CsPbBr 3 QDs and MWCNT/CsPbBr 3 composites were applied as catalysts for artificial CO 2 photoreduction under visible light.As shown in Fig. 8(a), CH 4 and CO were the main reduction products for all the samples, with no H 2 or other species detected, suggesting a high selectivity of CO 2 reduction.The CO 2 reduction activity of pristine CsPbBr 3 was quite poor, with the yields of CH 4 and CO as low as 15.7 and 31.1 mmol g A1 after 4 h of reaction, respectively.As expected, all the MWCNT/CsPbBr 3 When the content of MWCNT further increased to 7.0 wt, the photocatalytic activity of the composite decreased, which could be due to the reason that excess amount of MWCNT could compete for light harvesting and shield the light absorption of CsPbBr 3 .Fig. 8(b) depicted the electron consumption rate (R electron ) of the as-prepared samples, derived from the equation of R electron 14 2R(CO)8R(CH 4 ), where R(CO) and R(CH 4 ) were the production rates of CO and CH 4 , respectively.For the MWCNT/ CsPbBr 3 composite (4 wt), an R electron of 116.2 mmol g A1 h A1 was achieved, which was about 2.5 times that of the corresponding CsPbBr 3 counterpart.Moreover, the photocatalytic performances of different perovskite-based photocatalysts are compared, as listed in Table S2.The MWCNT/CsPbBr 3 composite shows higher CO 2 photoreduction performance than most of the reported perovskite-based photocatalysts, which implies the great potential of MWCNT/CsPbBr 3 composite in artificial photosynthesis. In addition, the reusability of the photocatalyst was of great importance for its practical applications, so the catalytic stability of the MWCNT/CsPbBr 3 composite was evaluated by cyclic experiments.As shown in Fig. 8(c), the MWCNT/CsPbBr 3 composite (4 wt ) could maintain reproducible photocatalytic performance after three successive cycling runs.Meanwhile, the recycled MWCNT/ CsPbBr 3 composite could preserve the phase, morphology and valence states after photocatalytic CO 2 reduction, as comfirmed by XRD, TEM and XPS characterizations (Figs.S5e7).The experimental results manifested the high stability of the MWCNT/CsPbBr 3 composite as a photocatalyst for CO 2 reduction. As indicated by the PL spectra, anchoring the CsPbBr 3 QDs on MWCNT can facilitate the charge transfer.In order to further investigate the charge separation dynamics, time-resolved photoluminescence (TRPL) spectra were measured.As shown in Fig. 8(d) and Table S1, MWCNT/CsPbBr 3 composite had a faster decay rate than CsPbBr 3 QDs, and the average PL decay times (t average ) of CsPbBr 3 decreased from 15.80 to 7.23 ns after being anchored on MWCNT.Along with the quenched PL intensity, the shorter t average confirmed again that a charge transfer channel existed in the MWCNT/CsPbBr 3 composite, through which the photo-generated carriers were transferred swiftly. Besides PL and TRPL techniques, photoelectrochemical tests can also reflect the charge separation efficiency intuitively.As shown in Fig. 9(a), the amperometric i-t curves exhibited highly repeatable photocurrent density upon light on/off cycles.The MWCNT/CsPbBr 3 composite showed a 50 enhancement of photocurrent responses compared with the pristine CsPbBr 3 QDs, profitting from the excellent electrical conductivity of MWCNT.Additionally, the charge transport behavior of the MWCNT/CsPbBr 3 composite was further evaluated by electrochemical impedance spectroscopy (EIS) spectra.The semicircle arc of the MWCNT/CsPbBr 3 composite was much smaller than that of CsPbBr 3 QDs, as evidenced by the Nyquist plots in Fig. 9(b).The smaller arc diameter implied lower Moreover, external quantum efficiencies (EQE) of MWCNT/ CsPbBr 3 and CsPbBr 3 were conducted at visible wavelengths of 420 and 450 nm.As displayed in Fig. S8, the MWCNT/CsPbBr 3 composite exhibited a higher EQE than pristine CsPbBr 3 QDs under both visible wavelengths.Combined with the results of optical and photoelectrochemical characterizations, the increased EQE could be attributed to the better light harvesting ability and enhanced charge-separation and charge-injection efficiencies of the MWCNT/ CsPbBr 3 composite. All the above results and analysis have validated the crucial roles of MWCNT in enhancing the charge transfer and photocatalytic performance of CsPbBr 3 QDs.Based on the above-mentioned investigations, the possible mechanism for electron transfer behavior and photocatalytic CO 2 reduction of the MWCNT/CsPbBr 3 composite was proposed, which was depicted in Fig. 10.Under visible light illumination, the valence band electrons of CsPbBr 3 were excited to the conduction band, producing photo-generated electronehole pairs.CsPbBr 3 is well known for its outstanding luminescent property, on account of the high radiative recombination of the electronehole pairs.On the other hand, MWCNT with good conductivity could function act as electron sinks, thus retarding the recombination of photo-generated carriers 48.In the MWCNT/CsPbBr 3 composite, MWCNT was believed to play a similar role to the previous studies.It can not only accept the photogenerated electrons from CsPbBr 3 QDs, but also provide an electron transfer channel due to its special conductive network, which facilitated the charge separation and migration rate, thus leading to enhanced photocatalytic performance of the MWCNT/CsPbBr 3 composite in CO 2 reduction."
  },
  {
    "title": "Conclusions",
    "content": "In summary, CsPbBr 3 QDs were successfully anchored on MWCNT through a simple self-assembly method.The resultant MWCNT/CsPbBr 3 composite showed efficient photocatalytic performance for CO 2 reduction, with 2.13 and 3.14-fold enhancements by the optimal MWCNT/CsPbBr 3 composite (4 wt) for the yields of CH 4 and CO, respectively.The extraordinary CO 2 photoreduction performance could be attributed to the rapid charge separation and transfer in the MWCNT/CsPbBr 3 composite.Since MWCNT could work as the electron transfer channel, the photo-excited electrons from CsPbBr 3 could transfer to MWCNT rapidly, which was affirmed by photoluminescence and photoelectrochemical measurements.Moreover, the MWCNT/CsPbBr 3 composite exhibited desirable recyclability in CO 2 photoreduction under visible light.These remarkable features render the MWCNT/CsPbBr 3 composite a promising candidate for the applications in artificial photosynthesis. Fig. 1.Schematic synthesis procedure of the MWCNT/CsPbBr 3 composite.(A colour version of this figure can be viewed online.) Fig. 2. (a) TEM image of MWCNT; (b) and (c) HRTEM images of MWCNT; (d) TEM and (e) HRTEM images of CsPbBr 3 QDs; (f) Size distribution of CsPbBr 3 QDs; (g) TEM and (h) HRTEM images of the MWCNT/CsPbBr 3 composite; (i) EDX spectrum of the MWCNT/CsPbBr 3 composite.(A colour version of this figure can be viewed online.) Fig. 5. FTIR spectra of MWCNT, CsPbBr 3 and the MWCNT/CsPbBr 3 composite (4 wt).(A colour version of this figure can be viewed online.) Fig. 7. Steady-state PL spectra of CsPbBr 3 and the MWCNT/CsPbBr 3 composite with different content of MWCNT.Inset: photographs of CsPbBr 3 and the MWCNT/CsPbBr 3 composite excited by 365 nm UV light.(A colour version of this figure can be viewed online.) Data curation, Formal analysis, Writing e original draft.Zhijie Zhang: Conceptualization, Methodology, Writing e review editing.Zhongliang Dong: Investigation, Formal analysis, Validation.Jiayue Xu: Resources, Funding acquisition, Supervision. Fig. 9. (a) transient photocurrent responses and (b) electrochemical impedance spectra (EIS) of CsPbBr 3 and MWCNT/CsPbBr 3 composite (4 wt).(A colour version of this figure can be viewed online.) This work was financially supported by the National Natural Science Foundation of China (51972213) and Shanghai Institute of Technology (39120K199048-ZQ2019-19, 1021GN203006008-B20). The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://doi.org/10.1016/j.carbon.2021.06.040."
  }
]