[
  {
    "title": "Doi",
    "content": "10.1016/j.apsusc.2021.149111"
  },
  {
    "title": "Article_Title",
    "content": "Mesoporous g-C3N4/MXene (Ti3C2Tx) heterojunction as a 2D electronic charge transfer for efficient photocatalytic CO2 reduction"
  },
  {
    "title": "Abstract",
    "content": "Photocatalytic CO 2 reduction reactions (CO 2 RRs) are of significant interest for its application prospects in energy field and CO 2 removal in air.Herein we report mesoporous g-C 3 N 4 /Ti 3 C 2 T x (MCT) as a highly active photocatalyst in CO 2 reduction reactions.We have found that mesoporous structures are compatible with high speed electronic transmission systems and demonstrate that MCT enables the excellent separation of electrons and holes.Mesoporous g-C 3 N 4 /Ti 3 C 2 T x (MCT) shows a production of CH 4 (2.117 molg -1 h -1 ), which is 2.4 times than that of mesoporous g-C 3 N 4 (MC).Large contact area of the catalyst has numerous adsorption sites for CO 2 as a result of the catalysts' mesoporous structures.The MCT catalyst also possess an efficient separation of the charge carriers due to the high speed electronic transmission system of MXene."
  },
  {
    "title": "Experimental",
    "content": "All chemicals were purchased from Chron Chemicals (Chengdu, China).Mesoporous g-C 3 N 4 (MC) was synthesized as described previously 252627.Typically, 1 g of melamine and 3 g of urea was added into 30 mL of ethanol in a beaker.The suspension was then filtered and the collected material was dried at 60 C to yield a white powder.An alumina crucible with a cover was then heated to 500 C at a rate of 2 Cmin -1 in a muffle oven.After 2 h, the crucible was heated at 520 C for another 2 h and then cooled to room temperature with an annealing rate of 2 C min -1 , yellow powder of g-C 3 N 4 with mesoporous structures was obtained. To obtain g-C 3 N 4 with nanosheet structures: 0.45 g of yellow powder above was dispersed into an alumina ark to enable the high exposure of g-C 3 N 4 to air.The crucible was then heated to 500 C at a rate of 2 Cmin -1 and maintained at this temperature for 3 h in a muffle furnace to furnish g-C 3 N 4 with a nanosheet structure. Ti 3 AlC 2 MAX phase was purchased from Forsman. 2 g of Ti 3 AlC 2 was slowly added into 30 mL of a 40 HF solution, followed by magnetic stirring at 60 C for 24hr.The acidic suspension was centrifuged and washed several times until the pH of the supernatant was less than 6.The pellet was then collected and dried to obtain a black powder. MCT, as a gray powder, was obtained by directly heating the mixture of mesoporous g-C 3 N 4 and Ti 3 C 2 T x in a mass ratio of 10:3, respectively, at 250 C for 2 h under an atmosphere of nitrogen (heating rate and annealing rate are both 2 C min -1 ). XRD spectra were recorded on a X' Pert PRO MPD instrument, with Cu K as the radiation source.TEM images of the MC and MXene samples were observed on a Tecnai G2 20 instrument, while the morphology of the MCT samples were observed on a Jeol 2100F instrument.(This is because of the difficulty in locating the appropriate lattice fringe for the MCT samples on a Tecnai G2 20 instrument).X-ray photoelectron spectra (XPS) were recorded on a Thermo Scientific ESCALAB 250Xi Xray photoelectron spectrometer with a pass energy of 20.00 eV and an Al K excitation source (1486.6 eV).UV-Vis diffuse reflectance spectra (DRS) were recorded on a HITACHI UH-4150 instrument with BaSO 4 as a reference.Photoluminescence (PL) spectra and time-resolved fluorescence decay spectra were recorded at room temperature on a FLS 980 instrument with an excitation wavelength of 417 nm (MC) or 429 nm (MCT).The Brunauere Emmette Teller (BET) surface areas of the materials were measured using a Autosorb (IQ) instrument at 77.3 K.The pore size distributions were obtained using the Barrett Joyner-Halenda (BJH) method. EIS and photocurrents were obtained on a CHI 1030B electrochemical workstation in a three-electrode cell filled with 0.5 M Na 2 SO 4 , in which the Ag/AgCl electrode and Pt wire were used as the reference and counter electrodes, respectively.Typically, 10 mg of the sample was dispersed into 1 mL ultrapure water/ethanol (1:1), and then 20L of a 0.5 Nafion ethanol solution was added into above turbid liquid followed by sonication for 30 min.30 Lof the resultant solution was then added dropwise onto 0.7 cm 0.7 cm conductive ITO glass, and dried 28. Photocatalytic CO 2 reduction was performed using an off-line Labsolar-AG closed gas circulation system (350 mL; Beijing Perfect light Technology Co., Ltd China).A 300 W high-pressure xenon lamp was used to irradiate the reaction cell (Pyrex glass) containing 5 mL of distilled water and 50 mg of the photocatalyst which was uniformly dispersed on a 28.26 cm 2 glass sheet.The glass with the photocatalyst was installed above the water instead of submerged into water and the reactor was carefully sealed with vacuum grease.Prior to irradiation, the above system was evacuated with Ar for 5 min to completely remove any air inside the reactor. 1 mL of CO 2 gas was then injected into the reaction cell.The temperature was maintained at 20 C with a DC-0506 low-temperature thermostat bath system (Cryostat Instrument Co., Ltd., China).At given time intervals, the produced CO was analyzed on a GC9790II gas chromatograph equipped with a GDX-502 flame-ionization detector and a TDX-01 thermal conductivity detector.The amount of product was determined from the calibration curve 29, whilst GC-MS was used to determine the carbon source of the CH 4 produced."
  },
  {
    "title": "Results_and_Discussion",
    "content": "As Fig. 1 (f) shows, When HF seeps into the layers of the MAX phase, the Al layers were etched slowly until complete separation.This results in the layers becoming closer to each other due to electrostatic attraction 22.This process leads to the formation of relatively large interlayer spaces in the MXene phase, which provides the perfect transfer space for free electrons. Scanning electron microscopy (SEM) was used to determine the surface morphology.An obvious accordion-shape layered structure is apparent in Fig. 1 (a) and (b), indicating that the Al layers in Ti 3 AlC (Fig. 1 (a)) have been removed after treatment with HF 1.Fig. 1 (c) reveals that MC has a mesoporous surface morphology which has a large surface area to enable the adsorption of gas molecules at numerous sites.Fig. 1 (d) and (e) indicate that Ti 3 C 2 T x (MXene) get an intense contact with MC.After illumination to excite the electrons of the semiconductor into the excitation state, Ti 3 C 2 T x (MXene) acts as a capacitor to coordinate the heterojunction effect 39,40.This results in the rapid transfer of electrons, and increases the separation between the electrons and holes. The TEM images provide more details about the structures.In contrast with Fig. 2 (a), Ti 3 C 2 T x (MXene) exists in the recesses of g-C 3 N as shown in Fig. 2 (b) and (e).Accordingly, the specific surface area shows a slight drop for MCT than that of MC in the BET spectrum.Fig. S2 shows the TEM images of Ti 3 C 2 T x (MXene), and the electron selective diffraction pattern (Fig. 2 (d)) which reveals that d 0.26nm, calculated from Bragg's formula: In which, d, , n, I represent the interplanar spacing, diffraction half-width, diffraction series, and wavelength, respectively. Fig. 3 (a) shows the X-ray irradiation (XRD) patterns for MCT, MC and Ti 3 C 2 T x .The spectra of MCT has characteristics similar to that of MC and Ti 3 C 2 T x , which confirms the successful combination between these two components.The predominant peaks at 2 27.5 and 2 13.1 are characteristic of g-C 3 N 4 .The other peaks are characteristic of Ti 3 C 2 T x .It is important to note that the peak at 39 is not apparent for the MCT sample, indicating that the Al layer has been removed from the MAX phase 30. The x-ray photoelectron spectra illustrate the binding conditions of The surface areas of MCT were analyzed by the N 2 adsorption-desorption isotherms.Fig. 4 (a) and (b) shows, the surface area of MCT in the adsorption and desorption isotherms to be 43.2 and 64.8 m 2 / g, respectively.This is in contrast to that of bulk g-C 3 N 4 as 61.9 and 80.5 m 2 /g in the adsorption and desorption isotherms, respectively.This slight decrease in the surface area for MCT relative to bulk g-C 3 N 4 is attributed to the successful loading of Ti 3 C 2 T X which has a low surface area (5.7 and 12.8 m 2 /g in the adsorption and desorption isotherms, respectively).In conclusion, MCT has a superior surface area after loading with Ti 3 C 2 T X , such that it can still provide abundant adsorption sites for gas molecules. PL spectra was used to show the photoabsorption properties of MCT and MC.As shown in Fig. 4 (c), MCT shows a lower peak value than that of MC, indicating lower electron-hole recombination rates for MCT than MC.Additionally, it indicates the successful loading of Ti 3 C 2 T x (MXene) onto the mesoporous surface of g-C 3 N 4 . The band gap energy was calculated (Fig. S3) by the follow formula: In which, a, A, h, v, and E g represent the absorption coefficiency, absorbance in the UV-Visible Diffuse, Planck's constant, light frequency and band gap energy, respectively.In this equation, the value of \"K\" has no effect on the computing results of the band gap, so we take the square of \"Ahv\" as the vertical coordinate and the \"hv\" as the transverse coordinate, and transverse coordinates of the intersection between the fitted line and the \"hv\" axis is the band gap 32. In the time-resolved photoluminescence (TRPL) spectra (Fig. 4 (d)), MCT shows a remarkable increase in the fluorescence lifetime.The average fluorescence lifetime for MCT is 3.9004 ns ( 1 1.3920 ns (34.53); 2 4.3261 ns (65.47)), while that of MC is 3.6803 ns ( 1 1.0383 ns (50.62); 2 4.3298 ns (49.38)), which is also consistent with the result that the successful loading of Ti 3 C 2 T x (MXene) on the mesoporous surface of g-C 3 N 4 decreases electron-hole recombination.When the electrons and holes are in the excited state and are within in the plane of the crystal Ti 3 C 2 T x (MXene), the free electrons are rapidly caught and this promotes the separation of charge carriers and leads to the coordination with the heterojunction, ultimately decreasing the recombination of electrons and holes. The UV-Vis DRS spectrum, in Fig. 4 (e), shows a sharp increase in the visible light absorption.Ti 3 C 2 T x , on the surface of MC, is responsive to visible light as shown in Fig. S4.MXene is a conductor (as opposed to a semiconductors) 33 and lacks photocatalytic activities in contrast to MCT or MC. Photocurrent (Fig. 4 (f)) and EIS (Fig. S4) spectra reveal a significant difference between MCT and MC in the photocatalytic charge carriers intensity.The Fermi level of Ti 3 C 2 T x (MXene) is about -0.53 eV and is more positive than the conduction band (CB) of g-C 3 N 4 (of about -0.96 eV) 34.This permits the electrons transfer within Ti 3 C 2 T x (MXene), which further promotes the separation of charge carriers.Accordingly, after the exposure of MCT to light, electrons and holes appear, and Ti 3 C 2 T x (MXene) catches the free electrons while the holes cannot enter the MXenes.In this process, the separation of electrons and holes is more efficient, and the intensity of photocurrent is promoted, as well. As shown in Fig. 5, MCT shows an obvious enhancement in the production of CO and CH 4. In general, the production rates obey a rule of MCT MC g-C 3 N 4 (C).To be specific, MC and MCT show a CO yield of 3.10 and 3.98molg -1 h -1 , respectively, while that of CH 4 is 0.879 and 2.117molg -1 h -1 .This obvious enhancement is predominantly due to the large specific surface area, which increases the possible adsorption sites for gas molecules and the ability of Ti 3 C 2 T x (MXene) to rapidly transfer free electrons.; 1264 cm -1 ), polydentate carbonate (b-CO 3 -2 ; 1398 cm -1 ), bicarbonate (HCO 3 -; 1422 cm -1 , 1650 cm -1 ), formate (1741 cm -1 ) and surface formic acid (HCOOH; 1698 cm -1 ) appeared successively.All these peaks got stronger as the extended illumination time.It demonstrated that CO 2 molecules was first adsorbed on the surface of MCT, and then light translate them into various intermediate products. To verify that both CO and CH 4 were formed from the photocatalytic reaction, the solution after irradiation was analysed by GC-MS.The GC/ MS traces are shown in Fig. S5 (a) and (b), the m/z signals at 17 and 29 correspond to 13 CO and 13 CH 4 , respectively.Furthermore, the intensities of the signals corresponding to 13 CH 4 and 13 CO increased with increased irradiation times, which indicate that CO and CH 4 were formed in the photocatalytic reaction. Mesoporous structures possess abundant absorption sites for CO 2 molecules.As shown in Fig. 6, when MCT is illuminated, the electrons cross the forbidden band into the excited state, and then travel within MCT from the inside to the outside.Once the electrons arrive at the plane of crystal, they are able to move onto the surface of Ti 3 C 2 T x (MXene), whilst the holes cannot.Once the electrons move to the surface, MXene becomes an efficient capacitor and the concentration of the stored electrons nearby Ti 3 C 2 T x (MXene) decreases, further promoting the high-speed transfer of free electrons inside the crystal 35,36.Furthermore, mesoporous structures assist in the concentration of CO 2 molecules at the surface, while MXene acts as an effective capacitor to enable the high-speed transfer of electrons to reduce the combination of electrons and holes.These processes act together to significantly promote photocatalytic CO 2 reduction."
  },
  {
    "title": "Conclusions",
    "content": "In summary, mesoporous g-C 3 N 4 /Ti 3 C 2 T X (MCT) was successfully prepared and has an excellent performance in photocatalytic CO 2 reductions.This is attributed to: (i) the relatively large specific surface area and the large number of defects that provide abundant adsorption sites for CO 2 molecules; (ii) \"capacitors\" Ti 3 C 2 T X (MXene) which promotes the transfer process of free electrons; (iii) the mesoporous structure which reduces the recombination of electrons and holes in coordination with Ti 3 C 2 T X \"capacitors\" (MXene).These findings demonstrate a new approach for the synthesis of efficient photocatalysts in CO 2 RR, but also show that highly active capacitors, such as Ti 3 C 2 T X (MXene) can be used for the synthesis of photocatalysts. Xing Li: Data curation; Writing -original draft; Writingreview; Yang Bai: Funding acquisition; Project administration; Xian Shi: Conceptualization; Jinde Huang: Methodology; Kai Zhang: Investigation; Wang Ren: Supervision; Liqun Ye: Editing; supervision. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Fig. 1.SEM images of (a, b) Ti 3 C 2 T x (MXene), (c) MC, (d, e) MCT and (f) illumination of etching process. Fig. 3. XRD patterns (a), and high-resolution X-ray photoelectron spectra of MCT: C 1s (b), Ti 2p (c) and N 1s (d). Fig. 4. (a) N 2 adsorption-desorption isotherms, (b) the corresponding pore size distribution curves (c) PL, (d) TRPL spectra, (e) photocurrent density, and (f) UV-Vis DRS spectrum. Fig. 5. CH 4 production (a), CO production (b), total production rate of MCT (c), and in-situ FT-IR spectra of the reaction of CO 2 and H 2 O on MCT (d). Fig. 6.Photocatalytic process in MCT. This work was supported by the National Natural Science Foundation of China (No. 51872147, 51702270), the 111 Project (D20015), the Program for Innovative Research Team of Science and Technology in the Universities of Henan Province (19IRTSTHN025), Open Fund (PLN201905) of State Key Laboratory of Oil and Gas Reservoir Geology and Exploitation (Southwest Petroleum University), Petro China Innovation Foundation (NO:2018D-5007-0604), Sichuan Science and Technology Program (No.2020JDJQ0057), and Science and Technology Cooperation Project of the CNPC-SWPU Innovation Alliance (No.2020CX0401022020CX040201). Supplementary data to this article can be found online at https://doi. org/10.1016/j.apsusc.2021.149111."
  }
]