[
  {
    "title": "Doi",
    "content": "10.1016/j.ces.2020.116049"
  },
  {
    "title": "Article_Title",
    "content": "Localized surface plasmonic resonance role of silver nanoparticles in the enhancement of long-chain hydrocarbons of the CO2 reduction over Ag-gC3N4/ZnO nanorods photocatalysts"
  },
  {
    "title": "Abstract",
    "content": "h i g h l i g h t sAg NPs are loaded gC 3 N 4 /ZnO NRs by simple photoreduction route at room temperature.Ag-gC 3 N 4 /ZnO NRs extended photoactive range and enhanced specific surface area.Ag-gC 3 N 4 /ZnO NRs enhanced photocatalytic CO 2 reduction to form the acetone product.LSPR effect of Ag NPs contributed the formation of long-chain hydrocarbon products."
  },
  {
    "title": "Experimental",
    "content": "Zinc acetate dihydrate (Zn(CH 3 COO) 2 A2H 2 O, 99.6), melamine, silver nitrate (AgNO 3 , 99.8), sodium hydroxide (NaOH, !99.99), polyethylene glycol 400 (PEG400), concentrated sulfuric acid (H 2 SO 4 , 99.9), absolute ethanol (C 2 H 5 OH), deionized water (DI). ZnO NRs were prepared by the solvothermal method as follows: Firstly, 2.99 g Zn(CH 3 COO) 2 A2H 2 O was dissolved into 78 mL C 2 H 5 OH and 13 mL PEG400 for 30 min.Secondly, 3 g NaOH was added into the above solution and stirred further until complete dissolution.The resultant mixture was poured into a Teflon-lined autoclave and kept at 120 C for 12 h. Bulk gC 3 N 4 was prepared by directly heating melamine in a muffle furnace.Detailly, 3 g of melamine was put into a ceramic crucible with a cover, then calcined at 550 C for 2 h with a heating rate of 2 C min A1 .For exfoliated gC 3 N 4 , it was synthesized by a chemical exfoliation as follows: 1.0 g bulk gC 3 N 4 was added into 10 mL concentrated H 2 SO 4 and stirred for 60 min.After that, this mixture was poured into 100 mL DI, further stirred for 15 min, washed, and dried 80 C for 2 h. To load 2 wt. of Ag NPs onto the 10 gC 3 N 4 /ZnO NRs that was demonstrated the best sample for the photocatalysis of the composite (Moussa et al., 2018), the photoreduction method is conducted as follows: 0.1 g g-C 3 N 4 and 0.9 g ZnO NRs were added into the solution composed of 20 mL C 2 H 5 OH and 80 mL DI, and was stirred for 180 min for self-assembling.Then, 0.0321 g AgNO 3 was added into the above mixture, and stirred under UV lamp type C (k 254 nm, power 32 W) irradiation for 24 h.Finally, the product was centrifuged, washed with DI, and dried at 60 C. The crystal structure of photocatalysts were analyzed by an Xray diffractometer using CuKa radiation of a wavelength of 1.5406 A (Bruker, D2 PHASER with XFlash).Raman spectra were performed by using Jobin-Yvon LabRAM KHR800 with a laser source of 532 nm.The chemical structure of samples was observed by JASCO-4700 FTIR spectrometer in a KBr pellet, scanning from 4000 to 400 cm A1 at the room temperature.The lattice spacing, crystal phase and elemental compositions of photocatalysts is examined by TEM (JEOL JEM-2100) equipped with an EDX detector.The UV-vis DRS characterization of powder samples was recorded using a Jasco V-670 spectrometer using an integrated sphere method.The specific surface area was determined from Brunauer-Emmett-Teller (BET) nitrogen adsorption-desorption isotherms using (BELSORP-max II, BEL, Japan), and Barrett-Joy ner-Halenda (BJH) desorption analysis was measured in order to determine the pore size distribution of the prepared samples. The photocatalytic CO 2 reduction experiment was performed in a stainless-steel cylindrical reaction chamber with a quartz window on the top of the reactor (as seen in Fig. 1).An AM 1.5 simulation solar lamp with a photon flux of 4.54 A 10 17 cm A2 As A1 is employed as a light source.This lamp is positioned perpendicularly to the quartz window of the reactor and above the sample dish.A ground glass dish containing the sample that is placed in the middle of the reactor.For the CO 2 reduction process, firstly, the photocatalyst was uniformly spread onto the glass dish and put into the reaction chamber.Then, the reactor was purged by nitrogen gas for 1 h to eliminate the air.Secondly, CO 2 gas was purged into the reactor for another 1 h for adsorption-desorption equilibrium with a controlled flow rate of 4 sccm.After that the lamp was turned on.The hydrocarbon product contents were analyzed by gas chromatography (GC), a GC-FID-China Chromatography 9800 system with glass column Porapak Q (80-100 mesh), at an injection temperature of 120 C, FID temperature of 150 C, an oven temperature of 105 C.For the whole experiment, the CO 2 gas was flowed through the water to maintain the desired humidity level. The photochemical quantum efficiency (PCQE) and the selectivity for acetone was calculated from Eqs. ( 1) and ( 2), respectively: where N e is the number of electrons participating in the reduction reactions; N hydrocarbon is the number of generated hydrocarbon molecules; N p is the number of photons absorbed by the catalyst; and A is an area of the light-exposed sample. where R is the rate of (acetone, acetaldehyde, and methanol) hydrocarbon products generation (mmolAg A1 Ah A1 ). In order to examine the separation and transportation ability of photogenerated charge carriers through the interface, the photoelectrochemical measurements were conducted with a BioLogic SP-200 potentiostat and used a three-electrode cell with Pt wire as the counter electrode, an Ag/AgCl/3.0M KCl as reference electrode and FTO glasses were coated with exfoliated gC 3 N 4 , ZnO NRs, gC 3 N 4 /ZnO NRs or Ag-gC 3 N 4 /ZnO NRs with a surface area of 1 cm 2 as the working electrodes.A 0.1 M Na 2 SO 4 (pH 7) aqueous solution was used as an electrolyte.The photocurrent transient response of the samples was evaluated by gauging the current at a constant potential of 0.35 V (vs.Ag/AgCl) with and without 100 mW/cm 2 light illumination (a Xe arc lamp) with a cut-off filter (k 420 nm).Electrochemical impedance spectroscopy (EIS) measurements were conducted with a frequency range from 100 kHz to 0.1 Hz.In addition, Mott-Schottky measurements were carried out with a potential range from A1.0 V to 1.0 V (vs.Ag/AgCl) at a frequency of 1.0 kHz."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Fig. 2 exhibits that there are two diffraction peaks in the XRD pattern of the exfoliated gC 3 N 4 located at 2h 13and 27, corresponding to the (1 0 0) and (0 0 2) crystal planes of gC 3 N 4 , respectively.Therein, the diffraction peak at around 2h 13is attributed to the in-plane structural packing mode and another peak at 2h 27is assigned to the interlayer stacking of the conjugated aromatic ring systems.These peaks are in good accordance with the previous report (Yuan et al., 2016).In the XRD pattern of ZnO NRs, the diffraction peaks at 2h 31.8,34.5, 36.3,47.6, 56.7, 62.9, 66.5, 68, 69.2, 72.7, and 77.1characterize for the hexagonal wurtzite structure of ZnO (JCPDS 36-1451).In addition, there is a low-intensity peak located around 2h 22in the enlarged XRD pattern of ZnO, which originates from the presence of a very small amount of Zn(OH) 2 after hydrothermal growth (Demoisson et al., 2014;Nicholas et al., 2012).In the XRD pattern of gC 3 N 4 /ZnO NRs, there are all characteristic peaks of ZnO and gC 3 N 4 existing simultaneously, which proves that ZnO NRs were successfully incorporated with exfoliated gC 3 N 4 through the selfassembly process.For Ag-gC 3 N 4 /ZnO NRs, an extra small peak observed at 2h 27.8corresponding to the crystal plane (1 1 1) of silver (Ag) (JCPDS 04-0783).No by-products were detected in XRD patterns of gC 3 N 4 /ZnO NRs, Ag-gC 3 N 4 /ZnO NRs, which indicates the high purity of the prepared composites. Fig. 3 displays the FTIR spectra of exfoliated gC 3 N 4 , ZnO NRs, gC 3 N 4 /ZnO NRs, and Ag-gC 3 N 4 /ZnO NRs, respectively.For exfoliated gC 3 N 4 , the broad peak at 3000-3600 cm A1 band corresponds to the stretching vibration of N-H in uncondensed amine groups on the edge of gC 3 N 4 sheets and adsorbed water molecules on the surface of the material.These uncondensed amine groups also have a partial contribution to the chemical bonds formed between ZnO NRs and exfoliated gC 3 N 4 .The peaks at 1340-1465 cm A1 are associated with the typical vibration of aromatic rings and the peak at 1635 cm A1 characterizes for the presence of CN bond (Bojdys et al., 2008;Yan et al., 2009).In addition, the band at 810 cm A1 corresponds to the breathing vibration mode of triazine units.For ZnO NRs, the broad peak located at around 492 cm A1 which is attributed to the Zn-O stretching vibration mode (Di et al., 2017).Besides, based on the FTIR spectrum of ZnO NRs, it found that ZnO NRs were prepared well by the solvothermal method with less residual organics.When Ag NPs, exfoliated gC 3 N 4 , and ZnO are combined together, there was a slight shift of CN, CAN, and NAH vibration modes to the lower wavenumbers in the FTIR spectra of gC 3 N 4 /ZnO NRs and Ag-gC 3 N 4 /ZnO NRs (Moussa et al., 2018).This proved that there was an intense chemical bond formation between these pure materials instead of the weak physical bonds.This is beneficial for the transportation of charge carriers through the interface of gC 3 N 4 /ZnO NRs.These FTIR results further consolidated the successful synthesis of the composite and the structure of materials was almost unchanged after the synthesis processes.Based on Brunauer-Deming-Deming-Teller (BDDT) classification, the isotherms belong to type IV, which indicates the mesoporous structure of the samples.Furthermore, the shapes of hysteresis loops reflect that all of the isotherms can be ascribed to the type H3, indicating the presence of silt-like pores.The calculated parameters including specific surface area, pore volume, and pore diameter are displayed in Table 1.The exfoliated gC 3 N 4 have the largest specific surface area (53.4 m 2 Ag A1 ) due to their lamellar structure.The lowest specific surface area of ZnO NRs are attributed to the formation of ZnO microcrystal with high crystallinity.The gC 3 N 4 /ZnO NRs (16.3 m 2 Ag A1 ) has a larger specific surface area than ZnO NRs (8.1 m 2 Ag A1 ), which is due to the contribution of exfoliated gC 3 N 4 .The specific surface area Ag-gC 3 N 4 /ZnO NRs (42.3 m 2 Ag A1 ) is substantially increased when Ag NPs are loaded onto gC 3 N 4 /ZnO NRs.This result is higher 5.2 and 2.6 times than ZnO NRs, gC 3 N 4 /ZnO NRs, respectively.In addition, the pore volume of Ag-gC 3 N 4 /ZnO NRs is larger than gC 3 N 4 /ZnO NRs, this is due to an appropriate amount of silver nanoparticles (Ag NPs) were embedded in the interlayer of ZnO NRs or exfoliated gC 3 N 4 , leading to highly porous (Feng et al., 2018). Fig. 6(a) shows that the absorption edge of ZnO NRs located at about 390 nm, which is almost active in the UV light region.DRS spectrum of the pure exfoliated gC 3 N 4 has the photo-absorption range from UV to visible light, with an absorption edge of 440 nm.In comparison with pure ZnO NRs, the absorption edge of gC 3 N 4 /ZnO NRs is extended to the visible light range due to the incorporation of ZnO with another gC 3 N 4 that is strongly activated in visible light due to its narrow band gap.Besides, there was an obvious broad peak that appeared in the range of 400-500 nm that exists in the DRS spectrum of Ag-gC 3 N 4 /ZnO NRs.It demonstrated the existence of Ag NPs on gC 3 N 4 /ZnO via the photoreduction path.Moreover, the presence of the LSPR effect is also confirmed by Raman results (Fig. S1).The energy band gap values of the materials are calculated by Kubelka-Munk (K-M) function according to Eq. (3). where a, h, t, E g , A are the absorption coefficient, the Plank constant, the light frequency, the band gap, and a constant, respectively.For direct band gap semiconductors like ZnO or gC 3 N 4 , n get the value of 1. The plots of (ahm) 2 versus energy (eV) for calculating band gap have been illustrated in Fig. 6(b).The E g values of materials were calculated to be 3.2, 2.85, 3.13, and 2.9 eV for pure ZnO NRs, exfoliated gC 3 N 4 , gC 3 N 4 /ZnO NRs, and Ag-gC 3 N 4 /ZnO NRs, respectively.These results of band gap values indicate that the poor light utilization ability of pure ZnO NRs can be tackled through the incorporation of exfoliated gC 3 N 4 and ZnO NRs.Also, the stronger visible light response of Ag-gC 3 N 4 /ZnO NRs indicates an important role of Ag NPs in light-harvesting, the energy band matching, and the synergetic effect between Ag NPs, exfoliated gC 3 N 4 and ZnO NRs. The spatial charge transfer and separation of materials was examined by EIS and transient photocurrent response.As shown in Fig. 7(a), the semicircle diameters of the EIS Nyquist plots are involved in the interface contact layer resistance.The fitted values of charge transfer resistance (R ct ) are 3789.2,3033.4,2557.9, and 1886.9X for exfoliated gC 3 N 4 , ZnO NRs, gC 3 N 4 /ZnO NRs, and Ag-gC 3 N 4 /ZnO NRs, respectively.These R ct values indicate faster carrier's transportation and more efficient photogenerated electron/hole pairs separation in Ag-gC 3 N 4 /ZnO NRs.Along with EIS, separation of charge carrier pairs and the response of catalyst against light were further verified by transient photocurrent responses of photocatalysts.The photo-responses of gC 3 N 4 , ZnO NRs, gC 3 N 4 /ZnO NRs, and Ag-gC 3 N 4 /ZnO NRs were detected during on/off switching cycles under visible light irradiation that express in Fig. 7b.Results show that gC 3 N 4 possesses the good ability of visible light utilization while its photo-response is very weak (1.3 A 10 A4 mA) due to its fast recombination of photoinduced carriers.The photocurrent density characteristic of ZnO NRs (2.3 A 10 A3 mA) is higher than that of gC 3 N 4 its high light sensitivity, better carriers' separation in one-dimension structure, and the existence of oxygen vacancies (Kumar and Rao, 2015;Moussa et al., 2016).As expected, the Ag-gC 3 N 4 /ZnO NRs show the best photocurrent response (2.1 A 10 A2 mA) because of the matching of the band structure of gC 3 N 4 and ZnO.Furthermore, Ag NPs act as trap centers of carriers that decrease the recombination of photogenerated carriers.Besides, the repetition of transient photocurrent of Ag-gC 3 N 4 /ZnO NRs with on-off several times did not cause any significant photocurrent diminishing, which implies the prolonged life span of photogenerated carriers.These photo electrochemical results supported and supplement to each other, they further confirmed the good interaction between Ag NPs, exfoliated gC 3 N 4 , and ZnO NRs in the composite.This would bring the more efficient transfer and separation of photogenerated carriers and be beneficial for the visible-light-driven photocatalytic activity. The photocatalytic CO 2 conversion activities of materials are evaluated by photocatalytic CO 2 reduction reactions at ambient temperature.Fig. 8(a) demonstrates the hydrocarbon formation yields of exfoliated gC 3 N 4 , ZnO NRs, gC 3 N 4 /ZnO NRs, and Ag-gC 3 N 4 /ZnO NRs.We found that the amount of hydrocarbon fuel products over ZnO NRs under visible light get values of 0.97, 0.003, and 0.14 mmolAg A1 for acetaldehyde, methanol, and acetone, respectively.In contrast, there is only the presence of acetaldehyde for exfoliated gC 3 N 4 with a yield of 1.84 mmolAg A1 at the same condition compare to ZnO NRs.Furthermore, the hydrocarbon formation yields of gC 3 N 4 /ZnO NRs exhibit a significantly higher photocatalytic activity than every single component, 4.57, 0.12, and 0.16 mmolAg A1 for acetaldehyde, methanol, and acetone, respectively.This is attributed to the energetic effect between gC 3 N 4 and ZnO and the increased specific surface area of gC 3 N 4 / ZnO NRs, which is favorable for the spatially charge separation of photogenerated electron-hole pairs, more efficient light utilization and larger adsorption ability.Besides, CO 2 is an acidic molecule and it tends to have a strong affinity to the basic surface.Therefore, ZnO and gC 3 N 4 will electrostatically interact with CO 2 to form a surface-bound CO 2 initiating the subsequent reactions (Karamian and Sharifnia, 2016).The photocatalytic performance of Ag-gC 3 N 4 /ZnO NRs demonstrated that the loading of Ag NPs with a LSPR effect leads to considerably enhance the generation of C 3 product (acetone) (Wang et al., 2018).In this regard, the combination of Ag NPs and gC 3 N 4 /ZnO NRs significantly enhanced photocatalytic CO 2 reduction to form the acetone product.Detail, the acetone production efficiency of Ag-gC 3 N 4 /ZnO NRs is 8.4 and 7.5 times higher than pure ZnO NRs and gC 3 N 4 /ZnO NRs at the same condition, respectively.This indicates that the direct conversion of CO 2 into acetone or the selectivity for acetone formation has been improved substantially as seen in Fig. 8(b). Theoretically, in order to participate in the CO 2 reduction reactions, the conduction band (CB) energy potential of semiconductors have to be more negative than the standard potential of CO 2 /hydrocarbon redox couple while the valence band (VB) energy potential of these semiconductors is more positive than the standard potential of the O 2 /H 2 O redox couple (0.82 V vs. NHE) (Li and Wu, 2015).As expected, the Mott-Schottky results (Fig. S2) show that ZnO and exfoliated gC 3 N 4 have the CB potential of A0.44 and A1.09 V vs. NHE, respectively.Therefore, both ZnO and gC 3 N 4 are able to reduce CO 2 into hydrocarbon fuels.Based on the photocatalytic experimental results and the above discus- sions, the detailed processes of the photocatalytic CO 2 reduction mechanism were proposed and illustrated in Fig. 9.When exfoliated gC 3 N 4 was coupled with ZnO NRs, two possible mechanisms for the charge transfer and photocatalytic CO 2 reduction process in Ag-gC 3 N 4 /ZnO NRs were proposed, including the type II heterojunction and the Z-scheme mechanisms.For the type II heterojunction, although ZnO NRs have a bandgap of about 3.2 eV, it can be still partly active in visible light due to the abundant presence of oxygen vacancies that demonstrated in our previous publication (Nguyen et al., 2019).Upon visible light exposure, photocarriers will be generated in both exfoliated gC 3 N 4 and ZnO NRs contemporaneously as illustrated in Eq. ( 4).The CB of exfoliated gC 3 N 4 is more negative than that of ZnO NRs, photoinduced electrons will migrate from CB of exfoliated gC 3 N 4 to CB of ZnO NRs and the holes will transfer in the opposite direction due to the VB of exfoliated gC 3 N 4 is less positive than that of ZnO NRs.For the Z-scheme system (Fig. 9b), the photoinduced electrons in CB of ZnO NRs will recombine with the photoinduced holes in VB of exfoliated gC 3 N 4 at the heterojunction interface (Xu et al., 2020), leading to the accumulation of photoinduced electrons and holes in the CB of exfoliated gC 3 N 4 and VB of ZnO NRs, respectively.Both these mechanisms are beneficial for the high spatially charge carriers separation efficiency and therefore prolong the lifespan of them.In the photocatalytic CO 2 reduction reactions take place in gC 3 N 4 /ZnO NRs, the water vapor acts as a sacrificial electron donor that gets oxidized to release oxygens (O 2 ) and protons (H ) as described in Eq. ( 5).Subsequently, CO 2 , H , and a commensurate number of electrons will interact toghether and produce hydrocarbon products as illustrated in Eqs. ( 6)-( 8).According to the above two photocatalytic mechanisms, the accumulated electrons in the CB of ZnO NRs or exfoliated gC 3 N 4 are able to participate in the reduction reactions of CO 2 , and the accumulated holes in the VB of exfoliated gC 3 N 4 or ZnO NRs are favorable for the oxidation of water vapor.Based on the photocatalytic CO 2 reduction results, gC 3 N 4 /ZnO NRs show three types of products (methanol (CH 3 OH), acetaldehyde (CH 3 CHO), and acetone (CH 3 COCH 3 )) were observed.This is owing to the fact that the accumulative electrons in CB of ZnO NRs or exfoliated gC 3 N 4 have sufficient potential enough to participate in these photocatalytic CO 2 reduction reactions.In addition, the Fermi level of Ag locates below the CB of ZnO and exfoliated gC 3 N 4 leading to Ag NPs act as strong photoinduced electron acceptors for both type II heterojunction and Z-scheme system (Jakob et al., 2003).When Ag NPs were loaded on gC 3 N 4 / ZnO NRs, the selectivity for acetone generation is promoted significantly (44.03).This could be attributed to (1) the electrons in the CB of Ag NPs are excited to the LSPR state under visible light irradiation, simultaneously Ag NPs also serves as an electron sink and captures charge carriers from ZnO NRs (for type II heterojunction) or exfoliated gC 3 N 4 (for Z-scheme system) due to large carrier capacity (Collado et al., 2013;Hou et al., 2011), (2) the presence of Ag NPs helps reduce activation barrier for the dissociation of CO 2 to form intermediate radicals (Wang et al., 2018), and (3) enhance the accumulation of intermediate radicals onto the surface of the catalyst which will participate in subsequent C-C coupling to form long-chain products (Tu et al., 2015).All of these are favorable for multi-electron reactions or the selectivity for acetone product is enhanced.The photocatalytic production of CH 3 OH, CH 3 CHO, and CH 3 COCH 3 described in the following Eqs.( 4)-(8). Additionally, the probable formation pathway of acetone from the photocatalytic CO 2 reduction is also illustrated in Fig. 9.In order to explain more detail about the above-mentioned role of plasmonic Ag NPs for enhanced acetone hydrocarbon production, the possible formation pathway of acetone is illustrated in Fig. 10.The overall process of acetone formation involves the contribution of 16 electrons as mentioned in Eq. ( 8) and require the coupling process of three carbon atoms.The contribution of Ag NPs as an electron sink and stabilizing intermediate radicals onto the surface of the catalyst favor this multi-electron reaction (Collado et al., 2013;Hou et al., 2011;Tu et al., 2015;Wang et al., 2018).Firstly, the adsorbed formyl radicals (HCO ads ) are formed on the surface of the material by the interaction of CO 2 (ads) , H , and 3e A (Kortlever et al., 2015).These formyl radical species act as C 1 building blocks to form C 2 species through the CAC coupling.The acetaldehyde product could be generated in this step.In order to create a C 3 adsorbed intermediate, a C 2 adsorbed intermediate could undergo intermolecular CAC coupling with another proximate CHO ads , and followed by proton/electron transfer steps to form acetone (Hori et al., 1997)."
  },
  {
    "title": "Conclusions",
    "content": "In conclusion, the visible light active Ag-gC 3 N 4 /ZnO NRs photocatalyst was successfully prepared by simple methods, specifically self-assembly and photoreduction.It was found that the loading of Ag NPs onto gC 3 N 4 /ZnO NRs favors for the multi-electron reduction reactions, reduces the activation barrier for the dissociation of CO 2 to form intermediate radicals, and enhances the accumulation of intermediate radicals onto the surface of the catalyst leading to create more C 3 product (acetone) with the selectivity of 44.03.In addition, this work demonstrates the possible formation path of acetone and photocatalytic mechanism for CO 2 reduction.It is expected that Ag-gC 3 N 4 /ZnO NRs will be employed as an efficient photocatalyst for added-value fuels and chemicals generation under visible light. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Fig. 1.Schematic diagram of photocatalytic CO 2 reduction experimental setup. Fig. 4(a) shows the layered structure of exfoliated gC 3 N 4 which is formed by the chemical exfoliation process using concentrated sulfuric acid, while ZnO NRs with the lattice spacing of 0.52 nm are exhibited in Fig. 4(b) representing the (0 0 2) plane of the wurtzite structure of ZnO that was confirmed from JCPDS card No. 36-1451.For gC 3 N 4 /ZnO NRs (Fig. 4(c)), it is clearly found that ZnO NRs are anchored onto gC 3 N 4 layers to form the intimate heterojunction contact.Similarly, the formation of interface contacts between Ag NPs, exfoliated gC 3 N 4 , and ZnO NRs in Ag-gC 3 N 4 /ZnO NRs also confirmed by HRTEM image in Fig. 4(d).The formation of this interface that could improve the photocatalytic activity of this composite through the separation of photogenerated carriers in the composite.Moreover, Fig. 4(d) also shows the lattice spacing of Ag NPs (0.23 nm), which matches well with (1 1 1) plane (JCPDS card No. 04-0783).Fig. 4(e) presents the SAED pattern of Ag-gC 3 N 4 / ZnO NRs that is indexed for lattice planes of ZnO NRs.The distribution and elemental composition in Ag-gC 3 N 4 /ZnO NRs are presented in Fig. 4(f-j).TEM-EDS mapping images show the simultaneous presence of Ag, C, N, Zn, and O elements in Ag-gC 3 N 4 /ZnO NRs.These HRTEM and EDS results solidify for the above results and give additional evidence for the formation of Ag-gC 3 N 4 /ZnO NRs composite. Fig. 2. XRD patterns of exfoliated gC 3 N 4 , ZnO NRs, gC 3 N 4 /ZnO NRs and Ag-gC 3 N 4 /ZnO NRs. Fig. 3. FTIR spectra of exfoliated gC 3 N 4 , ZnO NRs, gC3N4/ZnO NRs and Ag-gC 3 N 4 / ZnO NRs, respectively. Fig.5shows nitrogen adsorption-desorption isotherms of exfoliated gC 3 N 4 , ZnO NRs, gC 3 N 4 /ZnO NRs, and Ag-gC 3 N 4 /ZnO NRs.Based on Brunauer-Deming-Deming-Teller (BDDT) classification, the isotherms belong to type IV, which indicates the mesoporous structure of the samples.Furthermore, the shapes of hysteresis loops reflect that all of the isotherms can be ascribed to the type H3, indicating the presence of silt-like pores.The calculated parameters including specific surface area, pore volume, and pore diameter are displayed in Table1.The exfoliated gC 3 N 4 have the largest specific surface area (53.4 m 2 Ag A1 ) due to their lamellar Fig. 4. HRTEM images of (a) exfoliated gC 3 N 4 , (b) ZnO NRs, (c) gC 3 N 4 /ZnO NRs, (d) Ag-gC 3 N 4 /ZnO NRs, (e) SAED pattern of Ag-gC 3 N 4 /ZnO NRs, (f-l) TEM-EDS elemental mapping images of Ag-gC 3 N 4 /ZnO NRs. Fig. 5. Nitrogen adsorption-desorption isotherms of exfoliated gC 3 N 4 , ZnO NRs, gC 3 N 4 /ZnO NRs, and Ag-gC 3 N 4 /ZnO NRs. Fig. 6.(a) UV-Visible absorption spectra and (b) Tauc plots of exfoliated gC 3 N 4 , ZnO NRs, gC 3 N 4 /ZnO NRs and Ag-gC 3 N 4 /ZnO NRs. Fig. 7. (a) Electrochemical impedance spectroscopy (EIS) Nyquist plots and (b) Transient photocurrent responses of exfoliated gC 3 N 4 , ZnO NRs, gC 3 N 4 /ZnO NRs and Ag-gC 3 N 4 / ZnO NRs. Fig. 8. (a) Photocatalytic CO 2 reduction activity comparision of ZnO NRs, exfoliated gC 3 N 4 , gC 3 N 4 /ZnO NRs and Ag-gC 3 N 4 /ZnO NRs and (b) Photochemical quantum efficiency and selectivity for acetone production. Fig. 9. Schematic diagram of two possible photocatalytic CO 2 reduction mechanism of Ag-gC 3 N 4 /ZnO NRs under visible light, i.e. type II heterojunction (a), and Z-scheme system (b). Fig. 10.The formation pathway of acetone through the photocatalytic CO 2 reduction process. Specific surface area, pore volume, and pore diameter for exfoliated gC 3 N 4 , ZnO NRs, gC 3 N 4 /ZnO NRs, and Ag-gC 3 N 4 /ZnO NRs. N.Q.Thang et al. / Chemical Engineering Science 229 (2021) 116049 Mr. Nguyen Quoc Thang would like to thank the TIGP Scholarship for the internship program.Dr. Pham Van Viet sincerely thanks the CM Thi Laboratory and the Vietnam National Foundation for Science and Technology Development.This research is funded by Vietnam National Foundation for Science and Technology Development (NAFOSTED) under grant number 103.02-2019.343. Supplementary data to this article can be found online at https://doi.org/10.1016/j.ces.2020.116049."
  }
]