[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2020.119600"
  },
  {
    "title": "Article_Title",
    "content": "Construction of highly efficient Z-scheme ZnxCd1-xS/Au@g-C3N4 ternary heterojunction composite for visible-light-driven photocatalytic reduction of CO2 to solar fuel"
  },
  {
    "title": "Abstract",
    "content": "Converting CO 2 into renewable solar fuel using photocatalysts is one of the most ideal solutions for environmental challenges and energy crises.Here, the solid-solid Z-scheme Zn 0.5 Cd 0.5 S/Aug-C 3 N 4 (ZCS/AuCN) heterojunction showed improved photocatalytic reduction of CO 2 due to the enhanced visible light consumption, fast dissolution of photogenerated electron-hole pairs, quick interfacial transfer process of electrons, and enlarged surface area.Under visible-light irradiation, methanol (CH 3 OH) was produced at a rate of 1.31 mol h -1 g -1 over ZCS/AuCN, roughly 43.6 and 32.7 folds higher than those observed over pure ZCS and CN samples.The analytical characterization results verified the role of AuNPs as an electron mediator, which improved the rapid extraction of photoinduced electrons and enhanced the reduction ability of CO 2 .This work not only demonstrates a facile photodeposition assisted hydrothermal method for fabrication of Zn x Cd 1-x S/ AuC 3 N 4 heterojunction composite photocatalysts but also demonstrates the possibility of utilizing ternary composites for enhanced photocatalytic reduction of CO 2 ."
  },
  {
    "title": "Experimental",
    "content": "All chemical reagents were purchased from Shanghai Chemical Reagent Co. (China) and used as received.Zinc acetate (0.9 mmol) and cadmium acetate (0.9 mmol) were dispersed in 60 mL of distilled water and stirred for 30 min, followed by the addition of thiourea (45 mmol) and stirred for additional 30 min.Finally, the resultant solution was transferred to a 100 m L-Teflon-lined stainless-steel autoclave and maintained at 150 C for 5 h.After the reaction, the obtained yellow powder was centrifuged, washed with ethanol and distilled water several times, and then dried under vacuum at 70 C for 8 h. The g-C 3 N 4 sample was prepared by a modified copolymerization technique reported previously 32.In a typical preparation process, 6.0 g dicyandiamide and 0.3 g barbituric acid were grounded together and dispersed in 30 mL of water and heated at 90 C until the water was removed.The as-prepared solid powder was heated up to 550 C for 4 h at a heating rate of 5 C min -1 to obtain bulk g-C 3 N 4 .Finally, the obtained g-C 3 N 4 was crushed into fine particles for further use. In a typical synthesis process, 0.2 g of ZCS catalyst was dispersed in 50 mL water and ultrasonicated for 10 min.Then, HAuCl 4 .4H 2 O solution containing 1 wt Au was dropped into ZCS solution and, after adjusting the pH level to about 7 with 1 mmol NaOH, the mixture was placed under light irradiation (300 W Xe lamp) for 1 h to obtain metallic gold nanoparticles (AuNPs) deposited over ZCS nanospheres.After this stage, the solution was cleaned with ethanol and subsequently with distilled water, then dried under vacuum at 60 C for 6 h.The obtained sample was labeled as ZCS/Au nanospheres. The ZCS/AuCN catalysts were obtained via a dual-plot self-assembly method.In a typical synthesis, 5 wt g-C 3 N 4 powder was mixed with 30 mL methanol and ultrasonicated for 1 h, the resultant exfoliated g-C 3 N 4 thin sheets solution was mixed with 0.2 g of the above synthesized AuNPs loaded ZCS nanospheres (ZCS/Au) dispersion and stirred at room temperature for 24 h.The remaining methanol was eliminated by the nitrogen stream.The zeta potential of CN at pH 7 was characterized as -33.1 mV, and for ZCS as 8.7 mV, while the zeta potential of ZCS/Au sampled was 0.57 mV and thus, the negative charged CN could easily wrap over the surface of positively charged ZCS/Au nanospheres to form a core-shell heterojunction by simple continuous stirring.The obtained brownish red solid was collected and dried under vacuum at 70 C for 6 h.Another ZCSCN sample was fabricated using a similar procedure as above except the photodepostion of AuNPs was performed over the surface of ZCS nanospheres.Further, a CN/Au sample was prepared by dispersing bulk CN into 30 mL methanol and ultrasonically treated for 1 h, the exfoliated thin sheets solution of CN was washed several times with ethanol and water, then dried under vacuum at 60 C for 6 h.The as-prepared exfoliated thin sheets of CN catalyst were redispersed in 30 mL water and HAuCl 4 .4H 2 O solution containing 1 wt Au.The pH level was adjusted to about 7 using 1 mmol NaOH, then, the mixture was placed under Xe lamp (300 W) light irradiation for 1 h to obtain metallic AuNPs deposited CN nanosheets.After this stage, the solution was collected and washed with ethanol and distilled water several times, then dried in a vacuum oven at 60 C for 6 h.The prepared sample was marked as CN/Au nanosheets.For comparative photocatalytic study, ZCS was physically mixed with CN and labeled as ZCN.Also, the above prepared ZCS/Au nanospheres were physically mixed with CN and labeled as ZNA. The X-ray diffraction (XRD) was obtained using a Rigaku D/max-2500 X-ray diffractometer.The surface morphology was observed using a Field emission scanning electron microscope (FESEM, JSM-7500 F, JEOL, Japan) equipped with an energy-dispersive X-ray spectrometer.Transmission electron microscopy (TEM) and high-resolution TEM (HRTEM) were conducted using a FEI Talos F200X electron microscope equipped with an energy-dispersive X-ray spectrometer (EDX).The molar ration of Zn and Cd in Zn x Cd 1-x S were determined using inductively coupled plasma mass spectroscopy (ICP-MS), (Optima 4300 DV spectrometer, Perkin Elmer) and the values are present in results and discussion section.The electron spin resonance (ESR) technique was adopted to determine the reactive species signals by Bruker EMX premium X instrument (USA) using 5-dimethly-1 pyrroline N-oxide (DMPO) as spin trapping agent.The reactive species were detected using a spectrometer following visible light irradiation to obtain the DMPO-O 2 and DMPO- OH electro paramagnetic resonance (EPR) signals.The BET specific surface areas of the powder samples were tested using Micromeritics ASAP 2020 nitrogen adsorption apparatus (USA).X-ray photoelectron spectroscopy (XPS) was tested by an ultrahigh vacuum VG ESCALAB 210 electron spectrometer.Fourier transform infrared (FTIR) spectra were conducted using an IR Affinity-1 FTIR spectrometer (Shimadzu, Japan).UV-vis absorbance spectra of prepared photocatalysts were acquired from a Shimadzu UV-2550 UV-vis spectrophotometer (Japan) using BaSO 4 as the standard for reflectance spectra. The photocatalytic CO 2 reduction property was examined in a 200 mL-Pyrex reactor under the ambient temperature and pressure.The photocatalyst preparation and testing conditions followed the same procedure according to literature 33.In detail, 50 mg of catalyst sample was uniformly dispersed into 15 mL deionized water by ultrasonication in 200 mL homemade Pyrex reactor and dried at 80 C for 2 h to evaporate water and deposition of sample on the bottom of the reactor forming a smooth thin film.The openings of the reactor were sealed with rubber stoppers, and N 2 gas was passed through the reactor (30 min) to ensure complete anaerobic condition within the reactor system before light irradiation.The mixture of CO 2 and H 2 O vapor were in situ generated by the reaction of NaHCO 3 (0.084 g added into the reactor before seal) and H 2 SO 4 aqueous solution (0.3 mL, 0.2 M) which was introduced into the reactor using a syringe before light irradiation.A 300 W Xe lamp with a UV-cutoff filter ( 420 nm) was used as a light source and placed at a distance of 15 cm over the photocatalytic reactor.After one hour of light irradiation, the CO 2 reduced products were analyzed by a Shimadzu GC-2014C gas chromatograph (Japan) equipped with a flame ionized detector and methanizer. Photocurrents were calculated by a CHI CHI660C electrochemical analyzer (China) in a standard three-electrode arrangement.The apparatus and method used for these measurements have been described in detail elsewhere 33."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The structure and phase purity of as-prepared samples were characterized by XRD (Fig. 1a).The diffraction peak of CN shows two distinct diffraction peaks; the peak at 2 27.6isrelated to interlayer packing of g-C 3 N 4 with (002) diffraction plane.Another diffraction peak at 2 12.7of (100) plane is attributed to in-plane repeated units of tri-s-triazine.It is interesting to observe that the (002) diffraction peak corresponded to the conjugated aromatic system is enhanced compared with that of the previously reported bulk g-C 3 N 4 .This is indicated that the addition of barbituric acid drastically improves the crystallinity of as-prepared CN 32.The increase in crystallinity can accelerate the transfer of electrons in the crystal plane and promote the photocatalytic activity 34.The diffraction patterns of ZCS solid solution samples show typical hexagonal and cubic structures with prominent peaks indexing (100), (002), (101), (110), ( 103), ( 112) and (202) planes of ZCS wurtzite phase, while (111), (200), and (311) crystal planes match with ZCS cubic phase.Besides, the diffraction peaks are salient and sharp, representing exceptionally crystalline nature of the as-prepared ZCS nanospheres 21.There are no additional impurities, suggesting a high phase purity of the as-prepared samples.The diffraction peaks of ZCS/Au and ZCS/AuCN composites show similar diffraction peaks as of pure ZCS and CN.From the results, it is clear that the phase structure of ZCS or either CN is not altered during the AuNPs photodeposition.Further, as shown in Fig. 1b, the XRD patterns of AuNPs deposited samples show only a small peak allocated to the (111) reflection of fcc AuNPs, which is in well-agreement with their ultra-small size and low loading content on either ZCS or ZCS/CN samples 35.The diffraction intensity of CN is relatively low in ZCS/AuCN sample due to its low content (5 wt) in the composite.The clear presence of AuNPs and CN in the as-prepared samples can be revealed by further HRTEM, XPS analyses and UV-vis band shifting. FESEM and TEM were used to explore the morphology and structure of as-prepared samples.Fig. S1a shows well-dispersed ZCS nanospheres with a standard width of ca.100-120 nm.The surface of hierarchical ZCS nanospheres was formed by the self-assembly of many tiny nanoparticles with a thickness of tens of nanometers.The pure CN shows the two-dimensional (2D) aggregation with a nanosheet-like mesoporous structure (Fig. S1b).ZCS/AuCN sample was firstly checked by SEM as shown in Fig. 2a, in which ZCS/Au nanospheres are aggregated and wrapped with a thin layer of CN nanosheets, different from well-dispersive morphology as shown in Fig. S1a.Further, the heterojunction of ZCS/AuCN is observed through HRTEM results.Fig. 2b shows that ZCS is composed of hollow nanospheres of 100-120 nm size surrounded with thin curly, 2D nanosheet-like structure of CN (Fig. S2), which is in line with the SEM observation in Fig. 2a.The interplanar spacing of 0.32 nm corresponds to (002) plane of ZCS while the lattice spacing of ca.0.23 nm is assigned to (111) facets of AuNPs which are sparsely distributed over the surface of ZCS (Fig. 2c andd).These results can be also seen in the supporting information Fig. S2 36,37.The close solid-solid contact interface between ZCS/Au nanospheres and CN can facilitate the mobility of photo-generated charge carriers and thus, intensifying the charge segregation and photocatalytic activity of the resultant Z-scheme composites. Energy-dispersive X-ray spectrometer mapping data shows that elements Cd, Zn, S, Au, C and N are uniformly distributed all over the nanospheres structure, while the elements C and N are mainly present in the outer surface of the nanospheres, supporting the formation of ZCS/AuCN heterostructure (Fig. 2c).The EDX results indicate that the as-prepared sample is primarily comprised of Al, Cd, Zn, S, Au, C and N elements and no other elements were detectable, this signifies pure phase formation of ZCS/AuCN composite (Fig. S3).Besides, the Al peak is emerged due to the sample gridding used for the EDX analysis and not from a foreign object 18. The molar ration between Zn and Cd elements in Zn 0.5 Cd 0.5 S catalysts was analyzed using ICP-MS instrument and it was found to be Zn 0.515 Cd 0.485 S. To gain further insight into the surface chemical composition of as-prepared ZCS/AuCN heterojunctions, XPS analysis was conducted and the results are presented in Fig. S4.The XPS spectrum clearly shows the existence of Cd, Zn, S, Au, C, and N elements (Fig. S4).The high-resolution spectra of Zn 2p can be indexed with two strong spin-orbital peaks at 1022.9 and 1045.9 eV, confirming the presence of Zn 2p 3/2 and Zn 2p 1/2 , respectively (Fig. S5a).Fig. S5b exhibits two active peaks at 405.7 and 412.3 eV related to binding energy of Cd 3d 3/2 and Cd 3d 5/2 , respectively.The above mentioned two peaks of Cd 3d exhibit cadmium ion in Cd 2 state 38.Compared with the peak of ZCS, the Zn 2p and Cd 3d peaks of ZCS/AuCN sample shifts to lower binding energies indicating chemical interaction between ZCS and CN 39.The peaks at 161.4 and 162.4 eV are assigned to S 2p 1/2 and S 2p 3/2 , respectively, suggesting -2 oxidation state of S in the as-prepared composite (Fig. S5c).The XPS spectrum of C1 s is split into three minor peaks located at 284.7, 286.5 and 289.1 eV (Fig. S5d).The peak at 289.1 is assigned to tertiary carbon C-N 3 , whereas the peak at 284.7 eV corresponds to CeC bond 40.The peak centered at 286.5 eV is assigned to sp 2 -bonded carbon (N-CN).The graphitic carbon CeC bond at 284.7 eV can be generally observed in carbon nitrides.As seen in Fig. S5e, N 1s spectrum and three peaks fittings are at 398.3, 399, and 400.1 eV 41, which typically are assigned to sp 2 hybridized aromatic nitrogen bonded to carbon atoms (C NeC), the tertiary nitrogen bonded carbon atoms in the assembly of N-(C) 3 , and amino groups, respectively 42.The peaks of XPS spectrum for carbon and nitrogen are persistent with FTIR results and further verifies the presence of C 3 N 4 in ZCS/AuCN.Besides, the high-resolution XPS spectrum of Au 4f and the characteristic peaks at 84.6 and 88.2 eV confirm the presence of Auin the composite (Fig. S5f) 43.The above XRD and XPS results verify the successful fabrication of high-purity ZCS/AuCN heterojunction photocatalysts. To explore the light-harvesting property and CO 2 reduction over the as-prepared photocatalysts, we recorded the UV-vis DRS spectra of all as-prepared samples.As shown in Fig. 3, the ZCS nanospheres sample has an absorption edge at 523 nm, while CN shows an absorption edge at 494 nm, demonstrating that both samples can be excited under visible-light irradiation 23.The absorption intensity of ZCSCN did not change considerably even after the deposition of CN over the surface of ZCS.It only showed a minor red shift in the absorption towards the visible range and a small decrease in the UV absorption.However, both ZCS and ZCSCN showed strong absorption at a wavelength shorter than 523 nm.This result designated that CN was accumulated over the surface and not integrated within the lattice of ZCS nanospheres.When AuNPs are introduced to CN/Au sample, the photoabsorption is improved in the visible region in comparison with bare CN.The absorption of ZCS/Au and ZCS/AuCN samples shows intense light-adsorption property in the visible light region, especially at 500-800 nm, as compared with that of pure ZCS; this fact reflects the strong interactions between AuNPs and ZCS phase.The growing absorption in the visible light region could be attributed to the color change from yellow to brownish red color, when composited with AuNPs.Such shifting of absorption towards the longer wavelength is related to the direct interfacial charge mobility from the valence band of ZCS to the surface deposited AuNPs.This observation shows that the as-prepared composite samples can be excited under the complete visible range, similarly, as confirmed by other researchers 23. The bandgap energy (E g ) of all samples was retrieved from the Tauc plot (Fig. S6).As expected, ZCS/AuCN showed higher absorption intensities than all other samples in the visible region.The wavelengths of pure ZCS and CN catalysts were 523 and 494 nm from which the bang-gap was determined as 2.37 and 2.51 eV, respectively.Besides, the bandgaps of ZCS/Au, CN/Au, ZCSCN, and ZCS/AuCN were calculated to be 2.32, 2.48, 2.36 and 2.19 eV, respectively 23.The results revealed that after combining AuNPs and CN, the light adsorption property of composites was considerably improved; thus, the photocatalytic CO 2 reduction activity of composites enhanced.To better understand the effect of band structures on the charge separation efficiency and photocatalytic activity, Mott-Schottky (MS) plots of ZCS and CN products were measured in 0.5 M Na 2 SO 4 aqueous solution at frequencies of 1000, 2000, and 3000 Hz (Fig. S7).The flat band potential for ZCS and CN (vs Ag/AgCl, pH 7) was measured using the following MS equation 44. where C is the capacitance of the charge layer, e is the electron charge, is the dielectric constant of the semiconductor, 0 is the vacuum permittivity, N denotes the donor density, E is the applied potential, E fb denotes the flat band potential, K is the Boltzmann constant, and T is the absolute temperature.As revealed in Fig. S7, the positive tangent slopes in the Mott-Schottky plot designate that both ZCS and CN are ntype semiconductors 45,46.Thus, the x-intercepts of the linear region, the flat-band potentials (E CB ) of ZCS and CN are calculated as -0.35 and -1.52 V vs Ag/AgCl, respectively; these values agree with the values mentioned in literature 47.By taking the results of UV-vis DRS absorption, the E g values for ZCS and CN are determined as 2.37 and 2.51 eV, respectively.Further, the valence band potential (E VB ) of ZCS and CN are calculated using Eq. 2 as 2.02 and 0.99 eV, respectively. The FTIR was performed to understand the surface chemical relationship between the functional groups of CN, ZCSCN, and ZCS/ AuCN photocatalysts and their corresponding spectra are shown in Fig. S8.In pure CN, the peak at 1639 cm -1 corresponds to C-N stretching vibration modes, whereas the peak at 1420 cm -1 represents aromatic CN stretching.Moreover, the absorption peaks at 1325 and 1245 cm -1 are attributed to the out-of-plane bending vibration of striazine ring.Further, the attribute peak at 808 cm -1 is assigned to the breathing modes of tris-triazine units and the peak at 3175 cm -1 corresponds to the observed water molecule 48,49.In the infrared spectrum of ZCSCN, the peak at 3321 cm -1 are attributed to the stretching vibration mode of OeH, and the peak at 2304 cm -1 is Fig. 3. UV-vis diffuse reflectance spectra of as-prepared samples.generally associated to the observed CO 2 from the atmosphere, the peak at 2030 cm -1 is mainly due to the presence of CC triple bond.The minor peak at 1772 cm -1 attributes to H-O stretching vibration mode, the peaks at 1531 and 1410 cm -1 are due to C-O stretching whereas the peak at 1250 cm -1 is credited to the existence of C-O-C out of plane stretching 50.The peak at 675 cm -1 indicates the presence of Cd-S bond and the spectrum at 565 cm -1 is indexed to CS 2 out of phase stretching 51.In the FT-IR spectrum of ZCS/AuCN, all the peaks of CN and ZCS are observed, but a major shift in peak position is seen in CS 2 and C-N stretching modes.Similarly, the redshift is observed in the vibrational modes of tris-s-triazine units in CN.Such an impulsive peak shift implies a strong interaction between the CN and ZCS interface. The nitrogen sorption-desorption isotherms of ZCS, CN and ZCS/ AuCN samples are shown in Fig. S9.The nitrogen adsorption-desorption isotherms for all samples show type IV (Brunauer-Deming-Deming-Teller classification) isotherms with H3 hysteresis loop indicating slit-like mesopores (2-50 nm) generated by the aggregation of nanoparticles or sheet-like materials.The high adsorption in the relatively high pressure (approaching 1.0) range specifies the existence of large mesopores and macropores 52.The BET surface areas, pore volumes, and average pore diameter of as-prepared samples are shown in Table S1.The results specify higher surface area, pore-volume, and lower average pore size for ZCS/AuCN heterostructures.This phenomenon eventually leads to a high degree of interfacial contact between ZCS and CN, which is presumed to be advantageous for the photocatalytic reduction of CO 2 53. The photocatalytic reduction of CO 2 was investigated where the subsequent formation of methanol was tested under the irradiation of simulated visible light ( 420 nm) at ambient pressure.To determine the carbon products formed during the photocatalytic process, the gas chromatogram and mass spectra (GCeMS) analysis for ZCS/AuCN sample was conducted and the results are shown in Fig. S10a, the peaks assigned to 13 CH 4 (m/z 17), 13 CH 3 OH (m/z 33), and 13 HCHO (m/ z 46) were only observed and no other peaks were observed in the gas chromatograph.This result verifies that the detected photo-reduced products over the as-prepared materials originated from the CO 2 source rather than any residual/contaminant carbon species.Besides, the original chromatogram for the photocatalytic reduction of CO 2 over the ZCS/AuCN sample is shown in Fig. S10b.Methanol was observed as the major gaseous phase, in addition to which, formaldehyde and methane could be observed as minor products at ambient temperature and pressure conditions.The blank experiments without photocatalyst showed no CO 2 reduction to hydrocarbons, in contrast, without light irradiation no CO 2 reductions were seen 54.Furthermore, the controlled experiments without the introduction of CO 2 and N 2 as the carrier gases did not show any hydrocarbons generation, indicating that the above-obtained hydrocarbon compounds were from the photocatalytic contraction of CO 2 into hydrocarbon over catalysts rather than any organic impurity.Fig. 4a shows the photocatalytic methanol generation from the as-prepared samples under visible-light illumination for 1 h.Pure ZCS and CN exhibit low photocatalytic activity, which may be resulted from the fast recombination of photogenerated carriers 23.On the contrary, all the composited samples exhibited higher photocatalytic activity than pristine ZCS and CN.After the fabrication of Z-scheme ternary of all-solid solid ZCS/AuCN catalysts, the photocatalytic activities for CO 2 reduction reached the maximum methanol yield of 1.31 mol h -1 g -1 , this is roughly 43.6 and 32.7 fold higher than those of ZCS (0.03 mol h -1 g -1 ) and CN (0.04 mol h -1 g -1 ) samples, respectively.This result indicated that the loading AuNPs between ZCS and CN photocatalysts rapidly promoted the separation of charge carriers and enhanced the photocatalytic CO 2 reduction activity.Moreover, the photocatalytic CO 2 reduction activity of physically mixed catalysts (ZCN and ZNA) was much lower than the ZCS/AuCN catalyst, indicating that the chemical bonding between the three components is very crucial for an enhanced photocatalytic activity for CO 2 reduction 55.The higher photocatalytic activity of ZCS/AuCN was originated from the combined effects of the following factors: (i) the deposition of Au nanoparticles on ZCS and wrapped CN nanosheets led to an increased specific surface area; (ii) the AuNPs between ZCS/Au and CN induced plasmon resonance effect and promoted hot-electron injection, which intensified the energy transfer and electromagnetic field amplification; and (iii) the multi-electron reduction by electron capture on semiconductor nanoparticles resulted in an enhancement of photocatalytic activity and promoted the methanol production 56. Besides, the photocatalytic activity and stability of the catalyst are significant aspects which need to be examined during the CO 2 conversion with H 2 O.It is very well known that ZCS is susceptible to photocorrosion causing the decomposition that worsens the photocatalytic H 2 evolution performance 33.In this regard, a great deal of effort has been devoted to tackle the photo-corrosion issues of ZCS by means of the surface protection, heterostructure with other catalysts, co-catalyst doping, etc. 21.In the present study, the time course photostability of ZCS, CN and ZCS/AuCN samples were tested after three cycles with the period of each cycle as four hours.As shown in Fig. S11a, the methanol production activity over ZCS/AuCN sample did not change significantly even after three cycles.Based on these results, it can be concluded that in Z-scheme, the photoinduced electrons can be more effectively accumulated in ZCS/AuCN heterojunction with outstanding cyclic stability rather than in pure ZCS or CN.And, by comparing the XRD patterns (Fig. S11b) of ZCS/AuCN before and after CO 2 reduction activity, there was no appreciable change, which verifies the high photostability of as-prepared catalyst. To understand the underlying mechanism responsible for the enhanced photocatalytic activity of as-prepared ternary heterojunction photocatalysts, the room temperature photoluminescence (PL) spectra under excitation wavelength of 325 nm were performed by using terephthalic acid (TA) as a prove molecule to form 2-hydroxy-terephthalic acid (HTA) 18.The hydroxyl-radical trapping test is considered one of the most appreciable methods to confirm the formation of direct Zscheme photocatalyst, where the OH radical can be produced by the reaction of OH -/H 2 O with the photogenerated hole on the semiconductor 55.The PL spectra changes of ZCS/AuCN photocatalyst with different illumination times are shown in Fig. S12a.The increase in PL intensity of the HTA in the sample increased against light irradiation time.This effect specifies that the photogenerated holes on the CN do not have sufficient oxidation potential to react with OH -/H 2 O to generate OH radicals, which suggest that the photogenerated holes accumulate on the ZCS surface Fig. S12b. It is well known that CO 2 reduction over semiconductor photocatalyst is a more complex and challenging reaction process than hydrogen or oxygen evolution reaction processes because CO 2 reduction needs a large overpotential to run the reaction at an adequate rate 57.Besides, the catalyst preference for CO 2 reduction is tricky stage due to the comparatively complex reaction pathways 58.To form CH 3 OH, CH 4 and HCHO before CO 2 reduction, the electrons in the catalyst are requisite to have more negative chemical potential.On the contrary, for the water oxidation, holes need to lie on a more positive potential level 59.Upon visible light ( 420 nm) irradiation, both ZCS and CN can be excited and react with the mixture of CO 2 and H 2 O vapor in situ generated before the photocatalytic process; Eqs.(3)-( 13) express the electrochemical pathways from CO 2 photoreduction to solar fuels on the surface of catalyst. CN h e - CB h VB ( 4) H e - H (7) CN e - CN -e - ( 9) The reduction reaction of CO 2 by H 2 O leads to simultaneous water splitting to form hydrogen, which is considered as essential source for carbon based chemical products 60,61.In comparison to the CO 2 reduction by other process, reducing H 2 O to H 2 (Eqs.6-8) is more favorable in terms of kinetics and thermodynamics 62,63.Where, H 2 is provided from either reverse water-gas-shift reaction or photocatalytic water splitting 64. H is expected to be the main reactive radical in the photocatalytic conversion of CO 2 H 2 with different yield rates and pathways 656667.During the photocatalytic process, charge carrier separation and transmission in semiconductors occurred followed by rapid recombination between electrons in CB of CN and the holes in VB of ZCS.The photoexcited holes in ZCS oxidize with H 2 O to form O 2 and H while the photoexcited electrons in CB of CN reduce CO 2 to form CH 3 OH and other carbon fuels.and H slowly combine the adsorbed CO to form alkoxy structure.Finally, the alkoxy desorb and protonate to form methanol 68,69. To investigate the radicals generated during the photocatalytic process, electron spin resonance spectra were performed.O 2 is generated by the electron injection to dissolved O 2 in methanol, while OH is generated based on the electron extraction from OH in water.The nature of hydroxyl radicals generated from the ZCS, CN, and ZCS/ AuCN samples after 5 min visible light irradiation are illustrated in Fig. S13a.No signals were detected without sample or in dark, which means light irradiation and catalyst is essential for generation of radicals and reactive oxygen species.The four characteristic peaks for DMPO-OH adducts are observed for both ZCS and ZCS/AuCN heterojunction upon 5 min of light irradiation, where no obvious signal could be detected in the case of pristine CN 70.Besides, ZCS/AuCN exhibited strong signal attributed to DMPO-OH which is much higher than pristine ZCS.The characteristic peaks of DMPO-O 2 for all three samples is illustrated in Fig. S13b.No signal is observed for the pure ZCS, which agrees with potential of its CB.In contrast, ZCS/AuCN showed higher peak intensity of DMPO-O 2 signal than pristine CN. According to the ESR results, ZCS/AuCN is more favorable to produce O 2 and OH radicals than its corresponding pristine constituents. As seen in Fig. 4b, the conduction band (CB) of ZCS and CN are calculated to be -0.35 and -1.52 eV which are more negative than the standard potential of the CO 2 /CH 3 OH redox potential (0.03 V vs. NHE), while the valence band (VB) potential of ZCS and CN are 2.02 and 0.99 eV which is more positive than the standard potential of the O 2 / H 2 O redox potential (1.23 V vs. NHE).Thus, from the thermodynamic viewpoint, under visible-light illumination, both ZCS and CN are capable to photoexcite and reduce CO 2 to CH 3 OH or CH 4 .Nevertheless, as shown in Fig. 4a, neither ZCS nor CN can generate adequate CH 3 OH even after light irradiation for 1 h.This fact suggests that the infeasibility of efficient collection and separation of photoinduced electrons in pure ZCS and CN, which is probably due to the rapid reconsolidation of charges in the photocatalysts 31.In detail, there are two possible mechanisms offered for the photocatalytic CO 2 reduction enhancement activity driven by spatial separation of photogenerated charge carriers in ternary system: (1) conventional type -II heterojunction and (2) direct Z-scheme.In the first type of generic charge transfer system upon exposure to photons irradiation, the photoexcited electrons in the CB of CN migrate to the CB of ZCS, and holes in the VB of ZCS migrate to the VB of CN.In this process electron-hole pairs are spatial separated.However, the electrons and holes accumulated in the CB of ZCS and the VB of CN possess low reduction and oxidation potentials 71.In this regard, the redox ability of the overall photocatalyst is largely reduced (See Fig. S14).In contrast, in second system the open visible-light irradiation both the catalysts are photoexcited to generate electrons and holes.The equilibrium of Fermi levels was developed at the interfaces of ZCS, Au and CN before light irradiation, and electrons on the CB of ZCS is rapidly relocated to AuNPs after light irradiation.In contrast, the strong SPR of Au nanoparticles results in an enhanced limited electric field around the interfaces, which can drive the electrons of Au to inject into the VB of CN and recombine with holes via direct electron transfer or plasmon-induced resonant photogenerated charge transfer process 72.Thus, the accumulated electrons in the CB of CN with the high potential energy can reduce CO 2 to produce CH 3 OH and the holes left behind in the VB of ZCS can achieve the photooxidation process to produce H and O 2 radical species.It is significant to mention that this type of charge transfer pathway preserves the photogenerated holes on the more positive VB of ZCS and electrons on the more negative CB of CN, which might not only significantly enhance the separation of charge carriers and their recombination is inhibited 59,73.Based on the above band structure analysis, ESR result, enhanced CO 2 reduction activity, increased separation efficiency and enhanced oxidizing and reduction capacity, the formation of the direct Z-scheme mechanism is more favorable instead of the type-II heterojunction between ZCS and CN photocatalysts. To better understand the crucial role of ZCS/AuCN catalyst in boosting the photocatalytic CO 2 reduction performance of the as-prepared composite photocatalysts, the room temperature photoluminescence (PL) emission spectra were recorded at an excitation wavelength of 325 nm (Fig. 4c).Generally, the PL emission intensity represents the recombination rate of photogenerated electron-hole pairs; lower PL emission intensity implies a suppressed recombination of electron-hole pairs 74.As reported in Fig. 4c, the PL emission intensity of pure CN and CN/Au has a strong and broad PL emission at about 498 nm; similar emission trends can be observed in previous reports 75.ZCS is an indirect bandgap semiconductor with a lot of stacking defects or surface states formed during the ZCS preparation process, so, very weak emission intensity of ZCS compared to CN or CN/ Au led to a low emission strength 76.Interestingly, the PL peak intensity of ZCS/AuCN was strongly quenched compared to other samples.This result demonstrated that the deposition of AuNPs on the ZCS could significantly inhibit the recombination of charge carriers between the contact interfaces of ZCS/Au and CN, and thus improving the photocatalytic CO 2 reduction capability.Further, the green emission with a maximum wavelength of 525 nm was used as a probe to monitor the charge transfer between ZCS, CN, and the associated AuNPs throughout the surface of composite 77.As shown in the enlarged section of Fig. 4c, the position of PL intensity is almost unchanged after the combination with AuNPs when compared to CN or ZCS, but it decreases remarkably in intensity which indicates the considerable inhibition applied on the recombination of photoexcited holes and electrons 59.In contrast, the emission of ZCS/AuCN is extremely low suggesting the interaction of photodeposited AuNPs with ZCS and CN, and as a result, a significant decrease occurs in the emission yield of ca 450 in ZCS/AuCN compared with pure CN.It is noteworthy to specify that coupling ZCS and AuNPs with CN results in an evident green emission quenching, while ZCSCN presents a much lower green emission compared to CN/Au.This result reveals the lower recombination rate of electron-hole pairs, which can be one of the main reasons that ZCS/AuCN exhibits a better photocatalytic CO 2 reduction performance than other composite counterparts 23,32. Here, the excitation state electron decay lifetime photoluminescence spectroscopy was employed to elaborate the specific charge carrier dynamics in ZCS, CN and ZCS/AuCN (Fig. 4d).The average emission lifetime of ZCS and CN were 2.3 and 3.5 ns, respectively.For the ZCS/AuCN heterostructure, a prolonged (6.7 ns) PL lifetime component was recorded, to show the several excited electrons experienced the rapid relocation from ZCS nanospheres to AuNPs and later to CN.The longer lifetime of materials normally means a better prospect of contributing more excited electrons to the semiconductor.The finding here evidenced fast electron-injection from the AuNPs to CN surface.So, the formation of ZCS/AuCN heterojunction remarkably promoted the charge transfer and encouraged the photocatalytic reactions among all as-prepared samples 78. On the grounds of the above empirical outcomes, it is presumed that the enhanced photocatalytic activity of ZCS/AuCN core-shell heterostructures is associated with the superficial mobility of photogenerated electrons and holes in ZCS and CN, that manages the competent charge segregation in both catalysts 55,59.To further prove the enhanced efficiency of separation and transfer of photogenerated carriers, we measured the transient photocurrent feedback for CN, ZCS, and ZCS/AuCN samples under several on-off cycles of visible-light irradiation from 300 W Xe lamp equipped with 420 nm cutoff filter.As seen in Fig. 4e, ZCS/AuCN catalyst showed the highest photocurrent intensity among the three samples.In fact, the anchored AuNPs between the ZCS and CN acted as the electron relocation mediator and thus contributed to efficient segregation of photogenerated electron-hole pairs as compared to bare ZCS and CN 79,80.To further explain the high catalytic activity of as-prepared samples, the electrochemical impedance spectroscopy (EIS) was recorded for the pure ZCS, CN, and ZCS/AuCN samples.As shown in Fig. 4f, the arc radius on the EIS Nyquist of pure ZCS and CN samples was bigger than that of ZCS/ AuCN composite sample.This signified that the existence of AuNPs could considerably reduce the charge recombination during photocatalysis, alongside with the above photocatalytic CO 2 reduction finding 81,82."
  },
  {
    "title": "Conclusions",
    "content": "A novel all-solid-solid Z-scheme hierarchical ZCS/AuCN heterojunction was prepared as a highly efficient catalyst for visible-lightinduced CO 2 reduction to solar fuel.AuNPs were photodeposited onto the ZCS surface followed by wrapping thin 2D g-C 3 N 4 nanosheets over ZCS surface.These unique geometrical architectural and compositional features of the photocatalytic system contained several advantages, such as reducing diffusion length and improved electrical conductivity for charge separation and transportation, large surface area, and effective sites for photoredox catalysis.Consequently, the close contact interface of AuNPs with ZCS and CN substantially improved the photocatalytic reduction of CO 2 with a high CH 3 OH evolution rate (1.31 mol h -1 g -1 ), which is roughly 43.6 and 32.7 times more than those of pure ZCS and CN samples.The addition of AuNPs not only assisted the charge separation in both ZCS and CN but also advanced the reduction ability of photoinduced electrons in the conduction band of CN.Our findings demonstrate that the synthesis of all solid-solid Zscheme ZCS/AuCN heterojunctions can be a competent frontier to attain extremely active materials for CO 2 photo-reduction; such strategy can be further extended to other solar-energy related applications. Fig. 1.(a) XRD patterns of as-prepared heterostructure composite samples, (b) enlarged section of (a) showing presence of Au nanoparticles. Fig. 2. (a) FESEM image of ZCS/AuCN sample, (b) TEM image, (c) HRTEM magnified image of the white circle in (b), (d) HRTEM magnified images of the white rectangles in (c) showing lattice parameters of ZCS and AuNPs, and (e) STEM elemental distribution of ZCS/AuCN sample. Fig. 4. (a) Generation rate of CH 3 OH for various as-prepared samples, (b) Schematic Z-scheme mechanism of charge-transfer processes for photocatalytic CO 2 reduction over ZCS/AuCN heterojunction sample under visible light irradiation, (c) Steady-state PL spectra for as-prepared samples and enlarged view of the selected part, (d) Time-resolved transient PL decay curves for ZCS, CN, and ZCS/AuCN, (e) Transient photocurrent responses under visible-light irradiation (420 nm LED) in 0.5 M aqueous solution of Na 2 SO 4 , and (f) Electrochemical impedance spectra of ZCS, CN, and ZCS/AuCN samples. Conceptualization, Data curation, Formal analysis, Investigation, Methodology, Software, Visualization, Writing -original draft.Run Shi: Data curation, Formal analysis, Resources, Software.Shengling Xiang: Data curation, Formal analysis, Investigation.Mengtian Jin: Investigation, Resources.Bananakere Nanjegowda Chandrashekar: Formal analysis, Resources.Jingwei Wang: Formal analysis.Weijun Wang: Formal analysis.Ouwen Peng: Formal analysis.Abbas Amini: Writing -review editing.Chun Cheng: Funding acquisition, Project administration, Resources, Supervision, Validation, Writing -review editing. This work was supported by Guangdong High-level Personnel of Special Support Program-Outstanding Young Scholar in Science and Technology Innovation (2015TQ01C543), the National Natural Science Foundation of China (Grant Nos.51776094 and 91963129), Guangdong Provincial Key Laboratory of Energy Materials for Electric Power (Grant No. 2018B030322001), and Basic Research Project of Science and Technology Plan of Shenzhen (Grant No. JCYJ20180504165655180).This work was also supported by SUSTech Core Research Facilities.We also thank Southern University of Science and Technology for providing undergraduate students' grants (Grant No. 2019X33, 2019S11, and 2019G03). The authors declare no competing financial interests or personal relationships with the editorial board that could have appeared to influence the work reported in this paper. Supplementary material related to this article can be found, in the online version, at doi:https://doi.org/10.1016/j.apcatb.2020.119600."
  }
]