[
  {
    "title": "Doi",
    "content": "10.1039/c3cy20822b"
  },
  {
    "title": "Article_Title",
    "content": "Effect of graphitic carbon nitride microstructures on the activity and selectivity of photocatalytic CO2 reduction under visible light"
  },
  {
    "title": "Abstract",
    "content": "Two kinds of graphitic carbon nitride (g-C 3 N 4 ) were synthesized through a pyrolysis process of urea or melamine.It is found that the obtained g-C 3 N 4 , as photocatalysts, can reduce CO 2 to organic fuels under visible light, and exhibit different photoactivity and selectivity on the formation of CH 3 OH and C 2 H 5 OH.The product derived from the urea (denoted as u-g-C 3 N 4 ) shows a mesoporous flake-like structure with a larger surface area and higher photoactivity for the CO 2 reduction than the non-porous flaky product obtained from melamine (denoted as m-g-C 3 N 4 ).Moreover, using u-g-C 3 N 4 as a photocatalyst can result in the formation of a mixture containing CH 3 OH and C 2 H 5 OH, while m-g-C 3 N 4 only leads to the selective formation of C 2 H 5 OH.The present interesting findings could shed light on the design of efficient, eco-friendly and convenient photocatalysts and the tuning of their photoreactivity in the field of sustainable light-to-energy conversion."
  },
  {
    "title": "Experimental",
    "content": "Graphitic carbon nitrides (g-C 3 N 4 ) were synthesized by heat treatment of urea or melamine (5 g, AR, Sinopharm Chemical Reagent Co. Ltd) in a crucible with a cover. 8,19Typically, the precursor dried at 70 1C was heated to 580 1C for 3 h at a heating rate of 10 1C min A1 .The yellow-colored product was washed with nitric acid (0.1 M) and distilled water to remove any residual alkaline species (e.g.ammonia) adsorbed on the sample, and then dried at 70 1C for 12 h.The product derived from urea and melamine is named as u-g-C 3 N 4 and m-g-C 3 N 4 , respectively. The crystal phases of the sample were analyzed by Bruker D8 Advance X-ray diffractometer (XRD) with Cu Ka radiation at 40 kV and 40 mA, and a scan rate of 0.11 s A1 was applied to record the powder patterns in the range of 2y 10-701.The morphology and microstructure of the sample were examined by using high-resolution transmission electron microscope (HRTEM, JEM-2100, Japan) working at 200 kV.X-Ray photoelectron spectroscopy (XPS) measurement was performed on a Kratos XSAM 800 X-ray photoelectron spectroscope equipped with a non-monochromatic source (Mg Ka) operated at 200 W.The UV-vis diffuse reflection absorption spectra (DRS) were obtained for the dry-pressed disk samples using a Scan UV-vis spectrophotometer (Varian Cary 500 UV-vis-NIR, America) equipped with an integrating sphere assembly by using BaSO 4 as a reflectance sample.N 2 adsorption-desorption measurement was performed on a Micrometrics ASAP2020 at 77 K after the sample was degassed at 120 1C.Shimadzu GCMS-QP2010 Plus was used to obtain a GC-MS spectrum of the products derived from the CO 2 photoreduction system containing a g-C 3 N 4 suspension under visible-light (l Z 420 nm) irradiation.Data acquisition and analysis were performed using the software of GCMS Real Time Analysis and GCMS Postrun Analysis, respectively.The column was a capillary column (VF-5, 30 m A 0.25 mm i.d.0.25 mm, Varian, USA).Helium (purity 499.999) was used as a carrier gas at a flow rate of 1.0 mL min A1 .The injection temperature was 250 1C.The temperature program for the GC oven was as follows: initial temperature 50 1C (held for 2 min); increased to 100 1C at 25 1C min A1 ; and followed by an increase at 5 1C min A1 to 260 1C (held for 25 min).The EI source temperature was maintained at 220 1C, and the electron energy was 70 eV.The solvent delay was set to 5 min.A selected ion monitoring mode was set to each compound. For obtaining the photocurrent, a working electrode (Pt wire) was immersed in a 50 mL aqueous suspension containing catalyst (25 mg), NaOH (1.9 g) and methyl viologen (6 mg), and a saturated Ag-AgCl electrode and a Pt gauze electrode were used as a reference and a counter electrode, respectively.Before irradiation, the suspension was continuously purged by N 2 to remove O 2 , and then illuminated by visible light (l Z 420 nm) from a 300 W Xe-lamp equipped with a 420 nm cutoff filter.The working electrode was held at 0.4 V vs. Ag-AgCl by using a CHI618 workstation to collect the photocurrent-time curves. The photocatalytic CO 2 reduction was carried out in a homemade closed gas-circulation system.A 300 W Xe-lamp (PLS-SXE 300, Beijing Trusttech Co. Ltd) was used as a light source and a cutoff filter (Kenko L-42) was employed for the visible-light (l Z 420 nm) irradiation.Supercritical fluid-grade CO 2 was used as the reactant (Minghui technical gases, Wuhan, China) to avoid any hydrocarbon contamination.The photochemical reaction was performed in a reaction cell (Pyrex glass) containing photocatalyst (0.2 g) and 1.0 M NaOH solution (100 mL).A magnetic stirrer agitated the aqueous suspension to prevent sedimentation of the photocatalyst.Prior to the light irradiation, the above suspension was thoroughly degassed to remove air.CO 2 was then introduced into the reactor, which was then maintained for 30 min to establish an adsorption-desorption balance and saturate the solution with CO 2 . The reactor was tightly closed during the reaction with internal pressure maintained at B1.0 atm, and the reactor was irradiated from the top by a 300 W Xe-lamp (l Z 420 nm) for 3 h, and the photoreaction temperature was kept at 20 1C.After each cycle of photocatalytic reduction, the product in the solution was qualitatively identified by using SP 6800A gas chromatography (GC) equipped with GDX-502 columns and a flame ionization detector (FID) by observing the chromatographic peaks related to the elution of carbohydrates such as CH 3 OH or C 2 H 5 OH.The outlet gases were sampled through a sampling value and analyzed by SP 6800A GC equipped with TDX-01 columns and a thermal conductivity detector (TCD).By considering that the release of O 2 may exist in outlet gases and dissolve in the aqueous suspension, the yield of O 2 in the outlet gases was quantified by GC-TCD, and a dissolved O 2 detector (RSS 5100, INESA Scientific Instrument Co. Ltd, China) was used to monitor the dissolved O 2 concentration in suspension during the photoreduction.The needle-type probe was inserted into oxygen-free Na 2 SO 3 solution to fix the zero point before detecting, and then inserted into O 2 -saturated solution to attune the maximum measured value. Blank experiments were conducted to ensure that the product formed was due to the photoreduction of CO 2 .The apparent quantum efficiency (AQE) was calculated by measuring the CH 3 OH or C 2 H 5 OH production amount under the same photocatalytic reaction conditions.The energy flux (mW cm A2 ) was measured with a calibrated Si-photodiode (SRC-1000-TC-QZ-N, Oriel, USA).Photon flux absorbed by the photocatalyst suspension was obtained by dividing the energy flux by the energy of a photon with a wavelength of 420 nm, and the AQE value was calculated using eqn (1). 5,9,20E 14"
  },
  {
    "title": "Results_and_Discussion",
    "content": "The XRD patterns (Fig. 1) for the two kinds of g-C 3 N 4 show their graphite stacking structures.The two diffraction peaks at 2y 13.11 and 27.41 match well with the (100) and (002) crystal planes of the layered g-C 3 N 4 . 6The strong diffraction peak at 2y 27.41 is a characteristic indicator of layered stacking with a distance of 0.326 nm, and the in-planar repeating tri-s-triazine unit with a period of 0.675 nm can be clearly observed from the diffraction peak at 2y 13.11, which is consistent with the reported results on g-C 3 N 4 . 7oreover, the higher intensity and narrower width of the diffraction peaks for the m-g-C 3 N 4 derived from melamine indicates its crystallinity is higher than that of the u-g-C 3 N 4 derived from urea.The average crystal sizes can be calculated by using Scherrer's formula to be 4.8 and 8.8 nm for u-g-C 3 N 4 and m-g-C 3 N 4 , respectively, according to the broadening of the (002) peaks in the XRD patterns.The product microstructures can be observed from Fig. 2. The two kinds of g-C 3 N 4 products show flake-like structures, and u-g-C 3 N 4 (Fig. 2a) comprises a very thin flake structure, in which abundant mesopores exist with pore sizes of B40 nm, while m-g-C 3 N 4 (Fig. 2b) only shows flaky morphology without obvious porous structures.This result may be due to a large number of gases such as NH 3 and CO 2 releasing during the thermal treatment of urea, which might lead to the porous structures in the flakes of the formed u-g-C 3 N 4 , because it has been confirmed that urea can be pyrolyzed even at 350 1C and releases a mixture of gases. 8In addition, only 0.8 g of u-g-C 3 N 4 is obtained from 5 g of urea, while a much higher amount (3 g) of m-g-C 3 N 4 is produced from the same amount of melamine during the pyrolysis process.This result also indicates that urea can generate more abundant gaseous products than melamine, which contribute to the formation of the porous structure of u-g-C 3 N 4 . Fig. 3 shows the liquid N 2 adsorption-desorption isotherms and the corresponding Barrett-Joyner-Halenda (BJH) pore size distribution curves of the obtained products.As can be seen, both u-g-C 3 N 4 and m-g-C 3 N 4 show type IV isotherms with H3 hysteresis loops, which are associated with slit-shaped porous structures existing in the aggregates of flake-like particles.As compared to the m-g-C 3 N 4 , the larger hysteresis loop of u-g-C 3 N 4 can be attributed to the contribution of the mesoporous structures in the thin flakes of u-g-C 3 N 4 (Fig. 2a) since there is one broad peak centered at B40 nm in the BJH pore size distribution curve (inset in Fig. 3), whereas m-g-C 3 N 4 shows a narrower BJH pore size distribution with much lower porosity.The BET specific surface area of u-g-C 3 N 4 is calculated to be 39.5 m 2 g A1 , which is ten times higher than that (B3.7 m 2 g A1 ) of the m-g-C 3 N 4 derived from melamine.This higher surface area of u-g-C 3 N 4 can be ascribed to the mesoporous structure in the thin flakes, which would lead to more efficient surface adsorption and faster photogenerated carrier separation, and then to the improvement of photoactivity. The survey XPS spectra (Fig. 4a) show the compositions of the obtained g-C 3 N 4 products are mainly composed of carbon and nitrogen elements, as a result of the two strong peaks of C 1s and N 1s.According to the data of those XPS spectra (Table S1, ESI ), the ratios of C : N : O can be calculated to be 0.744 : 1 : 0.047 for u-g-C 3 N 4 and 0.745 : 1 : 0.069 for m-g-C 3 N 4 , respectively.A weak O1s energy peak at 532.6 eV is also detected in u-g-C 3 N 4 , and could be ascribable to the adsorbed H 2 O or CO 2 and C-O stemming from the incompletely reacted oxygen-containing intermediates during the synthetic process. 8he high resolution XPS spectra (Fig. 4b) of C1s can be roughly deconvoluted into three peaks at 288.4 eV, 286.4 eV and 284.8 eV, corresponding to sp 2 -bonded carbon (N-CQN), C-O and graphitic carbon (C-C), respectively.The graphitic carbon C-C at 284.8 eV can be usually observed in carbon nitrides. 8As shown in Fig. 4c, the high resolution XPS spectra of N1s could be fitted with three peaks.The main N1s peaks at 398.7 eV and 399.6 eV correspond to sp 2 hybridized aromatic N bonded to carbon atoms (CQN-C) and the tertiary N bonded to carbon atoms in the form of N-(C) 3 , while the weaker peak at 401.2 eV can be ascribed to N-H side groups, and the very weak peak at 404.2 eV to the p-excitations, which is consistent with the reported results on N1s XPS spectra. 7,8,21222324 UV-vis diffuse reflectance absorption spectra (DRS) of the obtained g-C 3 N 4 products are presented in Fig. 5.As can be seen, u-g-C 3 N 4 and m-g-C 3 N 4 show typical absorption edges at B445 and B458 nm, indicating that these products can absorb solar energy in the blue light region.According to the equation of E g 1240/l g , where l g is the optical absorption edge of the semiconductor, the bandgap (E g ) of u-g-C 3 N 4 and m-g-C 3 N 4 can be estimated to be 2.78 and 2.70 eV, respectively.The slightly enlarged bandgap of u-g-C 3 N 4 may be due to the quantum size effect of the smaller sizes as compared to the m-g-C 3 N 4 as observed from the HRTEM image (Fig. 2). Control experiments showed that no appreciable amount of reduced C1 or C2 product could be detected in the absence of either the photocatalyst or visible-light irradiation, illustrating that both the photocatalyst and visible-light irradiation are necessary for the present photocatalytic CO 2 reduction.In addition, neither CH 3 OH or C 2 H 5 OH, nor other carbon compounds, can be detected by introducing N 2 instead of CO 2 into the photocatalyst suspension under visible-light irradiation.This demonstrates that g-C 3 N 4 or its residual intermediates can not contribute the organic products in the present photoreduction system without CO 2 .Therefore, the photocatalytic reaction was performed in a CO 2 /g-C 3 N 4 suspension containing 1.0 M NaOH solution under visible-light (l Z 420 nm) irradiation.The NaOH solution could play two important roles in the present CO 2 reduction system.Firstly, CO 2 solubility is a key influencing factor of the photoreactivity, because a NaOH solution can dissolve more CO 2 than water.The pH value decreased from approximately , which might accelerate the photocatalytic CO 2 reduction. 25,26Secondly, the OH A ions in the aqueous suspension could act as hole-scavengers, which could retard the photogenerated carrier recombination. 27t was found that the main products of the photocatalytic CO 2 reduction over u-g-C 3 N 4 were a mixture containing CH 3 OH and C 2 H 5 OH, and no obvious other hydrocarbon compounds such as HCOOH were detectable.To further assign the peaks shown in the GC spectrum to CH 3 OH and C 2 H 5 OH, GC-MS spectra of the products derived from the CO 2 photoreduction system containing the g-C 3 N 4 suspension under visible-light (l Z 420 nm) irradiation were obtained (Fig. S1,ESI ).As can be seen, the GC-MS spectrum of the products is consistent with the standard GC-MS spectrum of methanol and ethanol, indicating that the products were methanol and ethanol rather than dimethyl ether and other C1 compounds. For m-g-C 3 N 4 , C 2 H 5 OH is the main product under the same photocatalytic reduction conditions, and the concomitant traces of CH 3 OH are too small to be quantified.Moreover, the outlet gases were determined to be CO 2 and O 2 , with no obvious H 2 , CH 4 or CO, which is inconsistent with the previous reports that g-C 3 N 4 can lead to the photoreduction of CO 2 to CO in the presence of water vapour under visible-light irradiation. 9The above specific photocatalytic activity and selectivity during the reduction of CO 2 are shown in Fig. 6a.As can be seen, the CH 3 OH and C 2 H 5 OH yields over both of the g-C 3 N 4 products is markedly enhanced with a prolonged irradiation time of 9 h, and then a slight decrease in the production rate occurs upon further prolonging the irradiation time, indicating that oxidation of the formed carbon compounds is possibly occurring on the photocatalyst surface, or there is a coverage of intermediates on the active sites. 27Moreover, u-g-C 3 N 4 possesses higher photoactivity than m-g-C 3 N 4 .For example, C 2 6a andb, the ratio (B0.95) of photogenerated electrons to holes used in the photoreactions is nearly 1, the small deviation may be due to the adsorption of a few free O 2 formed on the photocatalyst surface in the presence of water. 27Therefore, it can be concluded that a whole reaction, consisting of photocatalytic CO 2 reduction and water oxidization, has been performed in the present suspension. Quantum efficiency is an essential factor to evaluate a photoexcited reaction, especially in solar energy utilization.Eqn ( 2)-( 4) can describe the overall and the relative semireaction for the formation of CH 3 OH and C 2 H 5 OH over g-C 3 N 4 under visible-light irradiation.The amount of H ions usually controls the direction and the product selectivity of the CO 2 reduction.(2) The apparent quantum efficiency (AQE) of the present photocatalytic CO 2 reduction system can be calculated according to eqn (1), after measuring the CH 3 OH and C 2 H 5 OH production amount under the same photoreaction conditions and 12 h of visible-light irradiation.Table 1 lists the calculated AQE values for CH 3 OH and C 2 H 5 OH production over different photocatalysts.The total number of moles of photons is calculated from the photon flux of 12 h of visible-light irradiation.The measured AQE values for u-g-C 3 N 4 and m-g-C 3 N 4 are 0.18 and 0.08, respectively.The above results demonstrate that the obtained g-C 3 N 4 , as photocatalysts, exhibit interesting microstructure dependent photoactivity and selectivity on the formation of CH 3 OH and C 2 H 5 OH under visible-light irradiation, which will be further discussed in the following section. The photocatalytic CO 2 reduction process can be considered as the direct photon absorption by the bandgap of the semiconductors and the generation of electron-hole pairs.Therefore, the locations of the frontier orbitals of CO 2 with respect to the valence band (VB) and conduction band (CB) of g-C 3 N 4 would determine the feasibility and direction of charge transfer.According to previous reports, 6,7 the bandgap of g-C 3 N 4 is B2.7 eV, and the top of E cb of g-C 3 N 4 (A1.23 V vs. NHE at pH 7.00) can be calculated to be more negative than the potential of CO 2 changed into CH 3 OH (A0.38 V vs. NHE at pH 7.00) and that of CO 2 changed into C 2 H 5 OH (A0.33 V vs. NHE at pH 7.00). 2829930 Namely, g-C 3 N 4 has sufficient driving force to promote the photocatalytic CO 2 reduction. Usually, a material with a smaller bandgap and higher crystallinity may display superior photoactivity for the CO 2 reduction in the presence of water vapour because this is beneficial for the generation of electron-hole pairs and the retardation of the carrier recombination. 9However, the photoactivity of m-g-C 3 N 4 is worse than that of u-g-C 3 N 4 , though the m-g-C 3 N 4 possesses a smaller bandgap and higher crystallinity than u-g-C 3 N 4 , as mentioned above.This reveals that the limited differences in bandgap and crystallinity of photocatalysts may not be the principal factor affecting the photoactivity in the present aqueous suspension.On the contrary, u-g-C 3 N 4 possesses a mesoporous structure and surface area larger than the nonporous m-g-C 3 N 4 , which would lead to more efficient surface adsorption of reactants and faster photogenerated carrier separation, and then to a photoactivity higher than m-g-C 3 N 4 . In order to further validate the above assumption, the photocurrents generated in the m-g-C 3 N 4 and u-g-C 3 N 4 suspension containing NaOH solution were measured under visiblelight irradiation.As can be seen from Fig. 7, the photocurrent for the u-g-C 3 N 4 suspension is significantly higher than that of the m-g-C 3 N 4 , indicating that u-g-C 3 N 4 can lead to more efficient photogenerated carrier separation as compared to m-g-C 3 N 4 .Moreover, it is confirmed that the pH value is 7.50 after bubbling CO 2 in the suspension, implying that the bubbled CO 2 mainly transformed into HCO 3 A .Therefore, NaHCO 3 solution was selected to further investigate the adsorption ability of HCO 3 A on photocatalyst surfaces. Usually, eqn (5) can be used to represent the dissociation equilibrium of the NaHCO 3 solution, and based on this the pH values of the NaHCO 3 solution before and after 1 h of adsorption on m-g-C 3 N 4 and u-g-C 3 N 4 (40 mg) are measured and listed in Table 2.As can be seen, the pH value of the saturated NaHCO 3 is 8.53, and it changes to 7.78 or 7.83 after addition of 40 mg of u-g-C 3 N 4 or m-g-C 3 N 4 , respectively.This result indicates the dissociation equilibrium is shifted toward the left side after addition of the photocatalyst, and u-g-C 3 N 4 can adsorb more HCO 3 A than m-g-C 3 N 4 .Even after adsorption for 12 h, a similar changing trend in pH value can still be observed from both of the g-C 3 N 4 photcatalysts.Therefore, it can be concluded that the better photoactivity of u-g-C 3 N 4 for CO 2 photoreduction is due to its thinner mesoporous flake-like structure, smaller mean crystal size and higher surface area, which are beneficial for more efficient adsorption of HCO 3 A and faster carrier separation as compared to m-g-C 3 N 4 . On the other hand, the photocatalytic selectivity generally depends on the structure properties of the photocatalyst and the reaction conditions. 10,11For example, Yamashita and coworkers confirmed the highly selective formation of CH 3 OH over a highly dispersed titanium oxide species in the CO 2 reduction, while if it involved the aggregated octahedrally coordinated titanium oxide species as the catalyst the reaction showed a highly selective formation of CH 4 . 10Guan and coworkers also demonstrated that CH 4 , HCOOH, and HCHO were formed together with H 2 when Pt/K 2 Ti 6 O 13 was used as the photocatalyst, while CH over TiO 2 , and found the formation of H atoms (reduction product) and OH radicals (oxidation product) from water, and methoxyl ( OCH 3 ) and methyl ( CH 3 ) radicals were identified as reaction intermediates. 31Moreover, Paul and Hoffmann suggested that the lowered work function of an alkali facilitated a high probability of surface electron transfer to impact neutral CO 2 molecules, and the dimerization (to form C 2 H 5 OH) occurred via a radical-substrate reaction mechanism in an H deficient system. 25ased on the above results and discussion, a photocatalytic mechanism for the CO 2 reduction in the present system is proposed and illustrated in Fig. 8.Under visible-light irradiation, the photogenerated electrons and holes are produced and transferred on the g-C 3 N 4 surfaces.O 2 is produced from H 2 O or OH A by scavenging holes on the photocatalyst. 3,27The absence of H 2 in the outlet gases suggests that the proton may fail to capture the photogenerated electrons.Another possible reason is that the generated H from H 2 O may react with the carbon species.Considering that the potential can be lowered by nearly 0.7 V when CO 2 was changed to CO 3 2A or HCO 3 A , 26 it is reasonable to think that those HCO 3 A (or CO 3 2A ) can anchor to the photocatalyst surfaces so that they can efficiently receive the electrons to form CO 2 A radical anions, and then combine with the formed H to give rise to methoxyl ( OCH 3 ) radicals and then to CH 3 OH after protonation. 18Moreover, under the present H deficient system, a large number of C1 intermediate species, derived from CO 2 accepting the photogenerated electrons, can anchor on the g-C 3 N 4 surface, which may cause the dimerization to form C 2 H 5 OH. 20Of course, the detailed mechanism for the selective formation of CH 3 OH and C 2 H 5 OH in the present system needs further to be clarified, which is under progress."
  },
  {
    "title": "Conclusions",
    "content": "Two kinds of graphitic carbon nitride (g-C 3 N 4 ) were synthesized by the pyrolyses of urea and melamine, respectively.The product derived from the urea shows thinner mesoporous flake-like structures and larger surface area than the nonporous product from melamine.Both of these products can act as efficient photocatalysts for CO 2 reduction in an aqueous suspension containing CO 2 -NaOH solution under visible-light irradiation, and exhibit different photoactivity and selectivity on the formation of CH 3 OH and C 2 H 5 OH. Compared with m-g-C 3 N 4 , the u-g-C 3 N 4 , with a larger surface area and higher photocurrent in suspension, shows a better performance in the present photocatalytic CO 2 reduction system.The OH A in the aqueous solution can act as a hole scavenger, and this results in enhanced photocatalytic activity.Moreover, using the u-g-C 3 N 4 results in the formation of a mixture containing CH 3 OH and C 2 H 5 OH, while using m-g-C 3 N 4 only leads to the selective formation of C 2 H 5 OH.The above different photocatalytic activity and selectivity for the formation of organic fuels during the photoreduction of CO 2 over the different products is possibly due to the differences in the crystallinity and microstructure of u-g-C 3 N 4 and m-g-C 3 N 4 .Although the detailed reaction mechanisms need to be further investigated, the present interesting findings could shed light on the design of efficient visible-light-responsive photocatalysts and provide important information and an alternative sustainable strategy required for the photocatalytic CO 2 reduction for liquid fuel production. Table 2 The pH values of NaHCO 3 solution before and after adsorption on u-g- Fig. 1 XRD patterns of the obtained u-g-C 3 N 4 and m-g-C 3 N 4 .Fig. 2 TEM images of the obtained (a) u-g-C 3 N 4 and (b) m-g-C 3 N 4 . Fig. 3 N 2 adsorption-desorption isotherms and Barrett-Joyner-Halenda (BJH) pore size distribution plots (inset) of u-g-C 3 N 4 and m-g-C 3 N 4 . Fig. 4 XPS spectra of the obtained u-g-C 3 N 4 and m-g-C 3 N 4 ; (a) survey spectra, (b) C1s, (c) N1s and (d) O1s high resolution spectra. H 5 OH yield over m-g-C 3 N 4 is only 8.7 mmol for 12 h visible-light irradiation, while the CH 3 OH and C 2 H 5 OH yields over u-g-C 3 N 4 are calculated to be 15.1 mmol and 10.8 mmol, respectively.The ratio of CH 3 OH to C 2 H 5 OH is a near constant of B1.44, indicating u-g-C 3 N 4 is a stable photocatalyst for producing CH 3 OH and C 2 H 5 OH from the present CO 2 reduction system.From a thermodynamic perspective, six electrons or twelve electrons are required to convert one CO 2 molecule to form CH 3 OH or C 2 H 5 OH, 10,20 whereas the remaining holes can oxidize water to form O 2 , in which the formation of one O 2 molecule needs four holes.In other words, the amount of electrons generated from the photocatalysts under visiblelight irradiation must be consistent with that of holes consumed by the formation of O 2 .Therefore, O 2 is expected as a product of the present CO 2 reduction systems.As can be seen in Fig. 6b, the O 2 yields of u-g-C 3 N 4 and m-g-C 3 N 4 are 51.2 mmol and 24.6 mmol, respectively, for 12 h of visible-light irradiation.Also, the O 2 production rate increases slowly once the light irradiation has been longer than 9 h, implying that the re-oxidation of the formed CH 3 OH and C 2 H 5 OH may occur over the photocatalyst.By computation according to the yields of CH 3 OH, C 2 H 5 OH and O 2 shown in Fig. Fig. 5 UV-vis diffuse reflection (DRS) spectra of the obtained of u-g-C 3 N 4 and m-g-C 3 N 4 . Fig. 6 Time courses of photocatalytic (a) CH 3 OH/C 2 H 5 OH and (b) O 2 production over u-g-C 3 N 4 or m-g-C 3 N 4 under visible-light irradiation.Conditions: 1.0 M NaOH solution (100 mL), 0.2 g of catalyst, and l Z 420 nm. CH 3 OH, C 2 H 5 OH and O 2 production rate and apparent quantum efficiency (AQE) of u-g-C 3 N 4 and m-g-C 3 N 4 under visible light a Sample CH 3 OH (mmol g A1 h A1 ) C 2 H 5 OH (mmol g A1 h A1 ) O 2 (mmol g A1 h A1 ) AQE () u-g-C 3 N 4 Conditions: 0.2 g catalyst, 1.0 M NaOH solution (100 mL), and visiblelight (l Z 420 nm) irradiation for 12 h.Photon flux absorbed by the photocatalyst 267 mW cm A2 (for visible light); Each photon energy hc/l 4.73 A 10 A19 J; incident light area 15.1 cm 2 .Total photons absorbed by photocatalyst (photon flux (mW cm A2 ) A incident light area (cm 2 ) A radiation time (s))/(each photon energy (J) A N A ) 50972 mmol (for visible light). Fig. 7 Current-time curve of u-g-C 3 N 4 and m-g-C 3 N 4 in NaOH aqueous solution under visible light (l Z 420 nm, 300 W Xe-lamp). 3 OH and C 2 H 5 OH were produced in addition to the above products by using a hybrid catalyst containing Fe-Cu-K/DAY and Pt/K 2 Ti 6 O 13 .11From the above XRD, HRTEM and N 2 adsorption measurements of the two g-C 3 N 4 products, u-g-C 3 N 4 shows a mesoporous flake-like structure with a larger surface area, smaller mean crystal size and lower crystallinity than the non-porous flaky m-g-C 3 N 4 .The above differences in the crystal size, crystallinity and microstructure may be the reason for the selective formation of CH 3 OH and C 2 H 5 OH in the present system.The non-porous structure of m-g-C 3 N 4 may be not beneficial for the fast exchange of the formed OCH 3 or CH 3 OH, which may facilitate the dimerization to form C 2 H 5 OH, which occurred in the present CO 2 -NaOH system.Dimitrijevic and coworkers have studied the role of water and CO 3 2A in the photocatalytic transformation of CO 2 to CH 4 Conditions for 1: 40 mg of catalyst, NaHCO 3 saturated solution (20 mL), and adsorption for 1 h at room temperature (24 1C).Conditions for 2: 40 mg of catalyst, NaHCO 3 solution (1.2 g NaHCO 3 20 mL of water), and adsorption for 1 h at room temperature (24 1C). Fig. 8 Proposed mechanism of CH 3 OH and C 2 H 5 OH production from the photocatalytic CO 2 reduction system containing g-C 3 N 4 . This work was supported by the Natural Science Foundation of China (20973128, 21271146), the National High-Tech Research"
  }
]