[
  {
    "title": "Doi",
    "content": "10.1016/j.apsusc.2014.07.019"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic reduction of CO 2 on MgO/TiO 2 nanotube films"
  },
  {
    "title": "Abstract",
    "content": "A facile development of highly efficient MgO/TiO 2 nanotubes network (MgO/TNTs) films is described.These MgO/TNTs films have a unique one-dimensional (1D) network nanotubular structure, and the different contents of MgO existed as amorphous thin layers located on the surfaces of TiO 2 nanotubes.They exhibited excellent photoreduction efficiency of CO 2 to methane compared with the bare TiO 2 film.MgO plays a critical role in CO 2 methanation, because it has the strong adsorption ability of CO 2 and initiates the reaction by binding a CO 2 molecule, forming a magnesium carbonate species on the surface.For further improve the photocatalytic activity, Pt nanoparticles were loaded on MgO/TNTs films by the photo-reduction method.It was found that the loading of Pt notably improved the transformation efficiency of CO 2 to methane, and the highest evolution rate of methane reached 100.22 ppm/h cm 2 .The fast electron-transfer rate in MgO/TNTs film and the efficient electron-hole separation by the Pt nanoparticals were the main reasons for the enhancement of the photoreduction activity.The synergy effect of Pt nanoparticles and MgO in the nanocomposites played an important role in CO 2 photoreduction."
  },
  {
    "title": "Experimental",
    "content": "2.1.The preparation of MgO/TiO 2 network nanotube film Ti foil with a size of 2 cm 4 cm was put into an autoclave containing a concentrated 10 M NaOH aqueous solution, and then reacted at 120 C for 24 h.After cooling down, the obtained sodium titanate nanotube films were washed with distilled water several times, and then immersed in a 0.1 M HCl aqueous solution for 12 h to obtain the titanic acid nanotubes film (TAN).After that, the TAN film was immersed in 30 mL of 0.001 M, 0.005 M, 0.01 M, 0.05 M, or 0.1 M Mg(NO 3 ) 2 aqueous solution for 6 h, respectively.Finally, the immersed TAN film was calcined at 500 C in air for 4 h to get MgO/TiO 2 porous network nanotube films, and the sample was denoted as 0.001-MgO/TNTs, 0.005-MgO/TNTs, 0.01-MgO/TNTs, 0.05-MgO/TNTs, and 0.1-MgO/TNTs, correspondingly.As a reference, the bare TiO 2 nanotube film was prepared by calcining the as-prepared TAN at 500 C in air for 4 h directly.Pt was loaded on MgO/TiO 2 films by the in situ photo-deposition method.Briefly, the film was immersed in an aqueous solution of hexachloroplatinic acid (H 2 PtCl 6 ) ethanol solution, and irradiated with a mercury lamp for 1 h. X-ray diffraction (XRD) patterns were measured on an X'Pert Philips diffractometer (Cu K radiation; 2A range 5-90 , step size 0.08 , accelerating voltage 40 kV, applied current 40 mA).Transmission electron microscopic (TEM) images were taken on a JEM-2010 electron microscope.X-ray photoelectron spectra (XPS) were recorded with a Kratos AXIS ultraspectrometer using monochromatized Al K (h 1486.6eV) radiation as the excitation source (power 150 W, 15 kV and 10 mA).The C1s of hydrocarbon at 284.8 eV was used as the standard for the correction of charging shift.The atomic percentage of Mg, Ti, and O of different MgO/TNTs films was measured by energy dispersive spectrometer (EDS) technique. The photocatalytic reduction of CO 2 was conducted in a flat closed reactor with the inner capacity of 358 mL containing 20 mL 0.1 mol/L KHCO 3 solution.The prepared MgO/TiO 2 porous network film was located in the center of the reactor, and then the ultrapure gaseous CO 2 and water vapor was flowed through the reactor for 2 h to achieve the adsorption-desorption equilibrium.The light source was the high pressure Hg lamp with 300 W. The photocatalytic reaction was typically performed at room temperature for 6 h.The products were analyzed by a gas-chromatography (GC)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The phase structure of the nanotube films was analyzed by the XRD technique.As shown in Fig. 1a, the TiO 2 nanotubes film belongs to a characteristic anatase phase, indicating that the orthorhombic titanic acid nanotubes have transformed to TiO 2 nanotubes completely, which is consistent with our previous work 27.There still exist some characteristic peaks of metallic Ti at 38.5 , 40.2 , 63.1 , 70.7 , indicating that only the surface of the metallic Ti foil reacted with NaOH, and the interior still remained as Ti metal.After calcination of TAN immersed in a series of Mg(NO 3 ) 2 aqueous solution and calcined at 500 C for 4 h, Mg(NO 3 ) 2 and TAN transformed to amorphous MgO and anatase TiO 2 respectively.Although all samples did not appear new peaks, it is obvious that the width of the (1 0 1) plane diffraction peak of anatase (2A 25.5 ) became narrower firstly, and then gradually broader with the increase of concentration of Mg(NO 3 ) 2 .These facts suggested that the crystalline size of the TiO 2 nanotubes increased when being covered with the little content of MgO.Namely, the MgO/TNTs nanotubular structure was more perfect than pure TiO 2 owing to the presence of the covered MgO thin layer.When the concentration of Mg(NO 3 ) 2 is relatively high, broader phenomenon could be ascribed to the high content of MgO formed a large number of particles on the surface of the TiO 2 nanotubes.The characteristic peak of 39.8 , and 46.2 in Fig. 1b is ascribed to the (1 1 1) and (2 0 0) plane of the metallic Pt, respectively 28.That confirms the successful formation of metallic Pt nanoparticles on the surface of MgO/TNTs film, which are consistent with the results from TEM analysis (see Fig. 2e).The morphologies and structure of the series of MgO/TNTs films were shown in Figs. 2 and3.As can be seen from Fig. 2a, the surface of the titanic acid nanotube (TAN) film showed a porous network structure.After calcination, the nanotubular morphology of TiO 2 was destroyed, and the surface was consisted by many thin nanosheets (shown in Fig. 2b).However, the sample obtained after calcination of TAN immersed in the Mg(NO 3 ) 2 solution have the similar nanotubular structure with the pure TAN (Fig. 2c).And the thickness of the MgO/TNTs was measured to be about 2.1-2.2m (Fig. 2d).To further observe the morphology of TiO 2 film, some powders were peeled off from the TNTs film, and their TEM images are presented in Fig. 3. Our previous work reported that TAN transformed to anatase TiO 2 nanoparticles completely after calcination at the temperature higher than 400 C 27.Observation on the TEM images of MgO modified TiO 2 , we found that the nanotubular structure was kept very well.This indicated that MgO played an essential role to keep the nanotubular structure in the dehydration of TAN.Fig. 3a showed that TiO 2 displayed the uniform nanotube morphology, but a little part of nanotubes destroyed.The actual atomic percentage of Ti, Mg, O elements estimated by EDS analysis was shown in Table 1.The content of MgO increased with the increase of the concentration of Mg(NO 3 ) 2 .As the increase of the amount of MgO, the TiO 2 nanotubular structure was kept better gradually (Fig. 3b).And when the concentration of Mg(NO 3 ) 2 exceeded 0.1 M, MgO nanoparticles began to agglomerate on the surface of the TiO 2 nanotubules (Fig. 3c).Of particular interest is to note that the 0.01-MgO/TNTs sample kept better nanotubular morphology and some MgO existed as thin layer form on the nanotubes as seen in Fig. 3b.The high resolution TEM (HRTEM) images in Fig. 3d clearly show that MgO existed as amorphous thin layers apparently located on the surfaces of TiO 2 nanotubes.The finger spacing of 0.344 nm was indexed to the (1 0 1) lattice plane of anatase TiO 2 29, which is in agreement with the results obtained from XRD.Moreover, we also found that the layer spacing of the nanotubes decreased to 0.550 nm, this may be due to the shrink of TAN in the processing of high-temperature calcination 30.As we all known, MgO thin layer plays a critical role in CO 2 methanation, Mg can strongly bind a CO 2 molecule and form a carbonate on the less-stable MgO surfaces and the carbonate that formed on the MgO surface is an important reaction intermediate 31.Moreover, the coverage of TiO 2 surfaces with MgO might hinder the direct contact of CO or CH 4 with TiO 2 surfaces, reducing the re-oxidization possibilities for CO and CH 4 . Pt nanoparticles are often used as the efficient foreign traps to separate the photogenerated charge carriers of a semiconductor, so Pt was loaded on MgO/TNT films to improve the photocatalytic activity.As shown in Fig. 3e, the finger spacing of 0.227 nm can be indexed to the (1 1 1) plane of Pt metal 32, and the particle size was only 5-6 nm.From the HRTEM images, we also found that an intimate contact formed between Pt, MgO and TiO 2 nanotubes, which would facilitate the charge separation, and further improve the photoactivity.Fig. 4 shows the XPS data from the MgO/TNTs films.Only one peak appeared at the binding energy of 50.78 eV, it should be indexed to Mg 2 compared with the binding energy of metallic Mg-2p and Mg 2 -2p core level spectra 333435.This indicated the existence of MgO phase.Two characteristic peaks of Ti2p appeared at 458.8 eV and 464.6 eV as shown in Fig. 4b, that were indexed to Ti2p 1/2 and Ti2p 3/2 respectively.At the same time, the peak position didn't change when MgO was loaded, indicating that the loaded MgO didn't incorporate into the lattice of TiO 2 , which consisted with the TEM results. The effect of the content of MgO in MgO/TiO 2 porous films on the photoreduction performance of CO 2 was shown in Fig. 5.The comparison tests consisted of a reaction under light without the catalysts, and a reaction in dark with the catalysts.A very trace amount of CH 4 and CO was detected in the two comparison tests, which could be negligible compared with that of others' output.The bare TiO 2 nanotubes films provided CO and CH 4 with the generation rate of 3.79 and 11.31 ppm/h cm 2 , respectively.This activity was much higher than that of the TiO 2 film obtained by the sol-gel method.It should be attributed to the strong adsorption influence of large surface area derived from the porous network structure.In our previous work, we have already reported that the titanic acid nanotube network film still kept the porous network structure after being calcined 22.All of the MgO/TNTs films showed higher photoreduction efficiency than the bare TiO 2 film, which indicated that MgO played a very important role in the enhancement of the photocatalytic performance.On one hand, it is possible that the amount of chemisorbed CO 2 increases monotonically with the content of MgO 25.On the other hand, the most fundamental reason for this phenomenon is that MgO thin layer initiates the reaction by binding a CO 2 molecule chemisorbed on it, forming a magnesium carbonate species on the surface, its reactivity is supposed to be higher than that of the linear CO 2 molecule, and then reacted with atomic H supplied from H 2 O for further hydrogenation of magnesium carbonate to methane 32.Besides the role of basicity, MgO layers on TiO 2 surfaces might also capture the holes and facilitate the separation of photogenerated charge carriers 25.Moreover, as can be seen from Fig. 5, there is an optimum content of MgO for CO and CH 4 formation, their generation rate firstly increased and then decreased with the increasing of MgO.The highest yield of CO and CH 4 occurred on 0.01-MgO/TNTs film is 6.3 and 25.1 ppm/h cm 2 .When the content of MgO is lower, the film has relatively lower ability for the adsorption of carbon dioxide.While the content of MgO is higher, MgO existed in the form of particles, its insulation property have an dominant role in the reaction, it will may decrease the light adsorption further result in the decrease of the photocatalytic activity.After loading of Pt nanoparticles, the photocatalytic activity increased significantly.The generation rate of CO and CH 4 on Pt-0.01-MgO/TNTs film reached 10.4 and 100.22 ppm/h cm 2 .Pt nanoparticles were loaded on the surface of the TiO 2 nanotubes as an electron trap for improving the separation efficiency of the photo-generated electron-hole pairs.At the same conditions, the generation rate of CH 4 on Pt/TNTs was only 17.02 ppm/h cm 2 .The photoreduction efficiency of Pt-0.01-MgO/TNTs film was much higher than that of Pt/TNTs and MgO/TNTs.To our knowledge, the aggregated electrons on Pt nanoparticles would be benefit for the formation of CH 4 .And the CO 2 molecules activated by MgO were easy to form a magnesium carbonate species on the surface, which is easy to be methanation than the liner CO 2 molecules 26.Therefore, the synergy effect of Pt and MgO should be responsible for the enhancement of the photoreduction efficiency of TNT films."
  },
  {
    "title": "Conclusions",
    "content": "In summary, a series of MgO/TNTs films were fabricated by using a simple and effective dip-calcination method, they exhibited excellent activity for photoreduction of CO 2 to methane compared with the bare TiO 2 .SEM and TEM confirmed that MgO played an important role in the keeping the nanotubular morphology.The basic MgO is prone to adsorption of CO 2 molecules, and form the magnesium carbonate species, its reactivity is higher than that of the linear CO 2 molecule.After that, the further hydrogenation of magnesium carbonates to methane proceeded by reacting with atomic H supplied from H 2 O.As the increase of the loading amount of MgO, the photoreduction activity increased first, and then decrease.The highest generation rate of CH 4 was obtained on the 0.01-MgO/TNTs films.When Pt nanoparticles were loaded, the photocatalytic activity increased remarkably, and the generation rate of CH 4 reached 100.22 ppm/h cm 2 . Fig. 1.XRD patterns of the photocatalysts, (a) TiO2, (b) 0.001-MgO/TNTs, (c) 0.005-MgO/TNTs, (d) 0.01-MgO/TNTs, (e) 0.05-MgO/TNTs, (f) 0.1-MgO/TNTs and (g) Pt-0.01-MgO/TNTs. Fig. 2. SEM images of (a) TAN, (b) TiO2, and (c,d) 0.01-MgO/TNTs. Fig. 3. TEM images of (a) 0.001-MgO/TNTs, (b) 0.01-MgO/TNTs, (c) 0.1-MgO/TNTs, and HRTEM images of (d) 0.01-MgO/TNTs and (e) Pt-0.01-MgO/TNTs. Fig. 4. XPS spectra of Ti2p and Mg2p in the sample of 0.01-MgO/TNTs. Fig. 5. Photoreduction yield of CO2 to methane and CO on the different films. The atomic percent of Ti, O and Mg of different MgO/TNTs films. The authors gratefully acknowledge the support of the National Natural Science Foundation of China (no.21103042), Program for Changjiang Scholars and Innovation Research Team in University (no.PCS IRT1126), and the Specialized Research Fund for the Doctoral Program of Higher Education (no.20114103120001)."
  }
]