[
  {
    "title": "Doi",
    "content": "10.1039/c7ra06324e"
  },
  {
    "title": "Article_Title",
    "content": "Enhanced photocatalytic CO<sub>2</sub> reduction over Co-doped NH<sub>2</sub>-MIL-125(Ti) under visible light"
  },
  {
    "title": "Abstract",
    "content": "Co-doped NH 2 -MIL-125(Ti) catalysts Co/NH 2 -MIL-125(Ti) are developed for the photocatalytic reduction of CO 2 upon visible-light irradiation.Compared with NH 2 -MIL-125(Ti), Co/NH 2 -MIL-125(Ti) exhibits a significantly enhanced activity in CO 2 reduction, due to the fact that the doping of Co nanoparticles onto NH 2 -MIL-125(Ti) can promote the visible-light harvesting and electron transfer.In addition, when benzylic alcohols as electron donors, instead of triethanolamine (TEOA) which is often used as a sacrificial agent, are added into the reaction system, Co/NH 2 -MIL-125(Ti) can simultaneously catalyze CO 2 reduction to formic acid (HCOOH) and the selective oxidation of the benzylic alcohols to the corresponding aldehydes, making the proposed process more economical and environment-friendly."
  },
  {
    "title": "Experimental",
    "content": "X-ray powder diffraction (XRD) patterns were collected on a Philips PW3040/60 diffractometer using Cu Ka radiation (l 14 0.1541 nm) in a scanning range of 5-50 at 1 min A1 .Aer digestion of Co/NH 2 -MIL-101(Ti) (0.05 g) in a solution of 2 mL HF (40 wt) and 8 mL H 2 SO 4 (98 wt) diluted to 100 mL with deionized water, the Co loadings of the prepared catalysts were determined by an IRIS Intrepid IIXSP inductively coupling plasma-atomic emission spectrometer (ICP-AES).The Brunauer-Emmett-Teller (BET) surface areas of the prepared samples were determined by N 2 adsorption/desorption at A196 C using a Micromeritics ASAP 2020 instrument.The samples were degassed in vacuum at 150 C for 12 h before the adsorption measurement.The UV-vis diffuse reectance spectra (UV-vis DRS) of the samples were recorded on a Shimadzu UV-3600 spectrophotometer from 200 nm to 800 nm.The scanning electron microscope (SEM) was carried out on a Hitachi S-4800 apparatus equipped with a eld emission gun.The high resolution transmission electron microscopy (HR-TEM) was conducted on a JEOL JEM-1200 working at 200 kV.The X-ray photoelectron spectroscopy (XPS) was carried out on Thermo Scientic EscaLab 250Xi using Al Ka radiation.The 13 C nuclear magnetic resonance (NMR) was carried out on a Bruker AVANCE III 500M system (500 MHz).The isotopic 13 CO 2 reduction was performed in an NMR tube lled with photocatalyst in a CD 3 CN/TEOA (5 : 1 v/v) solution.The spectrum was recorded under the following conditions: acquisition time 1.0 s, 20 000 times integration.The electron spin resonance (ESR) spectra were obtained over Bruker ESP 300 E electron paramagnetic resonance spectrometer at room temperature.The photoluminescence (PL) spectra were recorded on a Hitachi F-7000 spectrometer.The photocurrent (PC) analysis was carried out with a CHI440A workstation (Shanghai Chenhua Instruments Co.) in a conventional three-electrode cell using a Pt plate and an Ag/AgCl electrode as the counter electrode and reference electrode, respectively.The photocatalyst powder deposited on the uoride tin oxide (FTO) substrate was employed as the working electrode and a quartz cell lled with 100 mL 0.2 M Na 2 SO 4 electrolyte was used as the reaction system.A 300 W xenon lamp (Beijing Perfectlight, PLS-SXE 300c) system was applied as the excitation light source equipped with a UV cutoff lter, which was the same light source for the photocatalytic tests.The Mott-Schottky curves were measured using a ZENNIUM electrochemical analyzer (Zahner, Germany) in a three-electrode cell.Pt plate and Ag/AgCl electrode (3 M KCl) were used as the counter and reference electrode, respectively.The electrolyte was a 0.2 M aqueous solution of Na 2 SO 4 without additive and was purged with N 2 gas for 2 h prior to the measurements.The potential ranged from A0.3 V to 0.8 V (vs.Ag/AgCl), and the perturbation signal was 20 mV with the frequency from 500 Hz to 1500 Hz.The working electrodes were immersed in the electrolyte for 60 s before any measurement was taken. Prior to photocatalytic reactions, the catalysts were treated under vacuum at 150 C to remove any adsorbed impurities.50 mg of the photocatalyst was degassed and purged with CO 2 .A mixture of MeCN and TEOA with a volume ratio of 5 to 1 and a total volume of 60 mL, degassed by CO 2 to remove dissolved O 2 , was injected into the reaction ask.The photocatalytic reaction was carried out under the irradiation of a 300 W Xe lamp with a UV-cut lter and an IR-cut lter (800 nm l 420 nm).The formed HCOOH was detected by ion chromatography (930 Compact IC pro, Metrosep) with a Metrosep A Supp 5 250/4.0column.A mixture of 3.2 mM Na 2 CO 3 and 1.0 mM NaHCO 3 was used as eluent.The gaseous reaction products were also analyzed using a GC-FID (Agilent 6890A) with a HP-5 capillary column. When benzylic alcohols instead of TEOA were used as electron donors, KHCO 3 (50 mg) was added to provide a basic environment for facilitating photocatalytic CO 2 reduction.The volume ratio of MeCN to the benzylic alcohol was 10 to 1 with a total volume of 110 mL. For the reusability test, the photocatalyst was separated from the reaction medium aer the rst run, repeatedly washed with MeOH three times, and then dried overnight in a vacuum oven at 150 C.Then, the dried catalyst was used in the next run.to conrm the results from HR-TEM, the X-ray photoelectron spectroscopy was used to characterize the Co oxidation state (Fig. 4).The coexistence of the metallic and oxidized Co in Co/NH 2 -MIL-125(Ti) is evidenced by two peaks of Co 2p 3/2 located at 778.7 and 780.4 eV, which are assigned to Co 0 and Co 2 . 35The oxidized Co could be ascribed to the partial oxidation when the Co NPs in Co/NH 2 -MIL-125(Ti) are exposed to the atmosphere since they are very active to be oxidized.It's generally accepted that their activity tends to increase with declining their particle size. 36As can be seen from Fig. 5 , and HCOOH, respectively. 24This indicates that the produced HCOOH originates from CO 2 .In addition, the control experiments using cobalt(II) salt or CoO mixed with NH 2 -MIL-125(Ti) as the photocatalyst were carried out in order to verify which Co species (metallic or Co 2 ) would play a role in the reaction, see Table S1 shows an enhanced photocatalytic activity in the selective oxidation of benzylic alcohols to the corresponding aldehydes. 33erein, the aerobic oxidation of benzylic alcohols over Co/NH 2 -MIL-125(Ti) was also investigated, and these results are summarized in Table 2. Remarkably, compared with NH 2 -MIL-125(Ti), Co/NH 2 -MIL-125(Ti) shows an enhanced activity for the oxidation of benzyl alcohol and 4-methoxybenzyl alcohol with high selectivity (99).The conversions of the benzylic alcohols over Co/NH 2 -MIL-125(Ti) are even higher than those over Ni/NH 2 -MIL-125(Ti), implying that the electron transfer is more effective for the doping of the Co NPs into NH 2 -MIL-125(Ti)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "3.2.3.Photocatalytic CO 2 reduction coupled with oxidation of benzylic alcohols.Because TEOA as the sacricial electron donor is not economical and environment-friendly while benzylic alcohols can be used as electron donors, we therefore carried out photocatalytic CO 2 reduction with the oxidation of benzylic alcohols.These results are summarized in Table 3. KHCO 3 was added into the reaction medium in order to provide a basic environment for facilitating the photocatalytic reduction.When benzyl alcohol was used as the electron donor, no product was detected over NH 2 -MIL-125(Ti) upon visible-light irradiation for 10 h.On the contrary, the yields of benzaldehyde and HCOOH over 1.0 wt Co/NH 2 -MIL-125(Ti) under the same conditions were 2.2 and 2.4 mmol g cat A1 h A1 (entries 1 and 3), respectively.In case of 4-methoxybenzyl alcohol, 4-methoxybenzaldehyde and HCOOH were formed over both NH 2 -MIL-125(Ti) and 1.0 wt Co/NH 2 -MIL-125(Ti) catalysts (entries 2 and 4), and the yields of 4-methoxybenzaldehyde and HCOOH over 1.0 wt Co/NH 2 -MIL-125(Ti) were up to 5.8 and 6.0 mmol g cat A1 h A1 .It is undoubted that the electron donating substituent on the phenyl ring is favorable for the photocatalytic reaction.It has been reported that the photocatalytic activity can be enhanced if the catalyst is made more electron conductive. 37,38Although there is still the lack of thorough understanding on the photocatalytically active sites, it is proposed that the enhanced catalytic activity might come from the electronic interactions between the Co NPs and NH 2 -MIL-125(Ti). 3.2.4.Reusability.A six-run experiment of photocatalytic CO 2 reduction with TEOA as the sacricial agent was carried out to check the reusability of 1 wt Co/NH 2 -MIL-125(Ti) as an illustrative example, as shown in Fig. S2 in the ESI. Obviously, the recycling use of the photocatalyst for six runs shows no obvious decrease of the photocatalytic activity.In addition, the XRD, FT-IR, N 2 adsorption-desorption, and XPS characterization results for the photocatalyst aer the 6 th -run reaction are almost identical to those for the fresh one (Fig. S3 in the ESI ), suggesting that the prepared catalyst is stable during the photocatalytic reaction.In addition, the photocatalytic reduction of CO 2 upon UV irradiation was carried out to further check the stability of 1 wt Co/NH 2 -MIL-125(Ti), and the corresponding results are shown in Fig. S4 in the ESI, in which there is no obvious decrease in the photocatalytic activity for six runs.Moreover, the results from the XRD, N 2 adsorption-desorption, and FT-IR characterizations of the photocatalyst aer the 6 thrun reaction are almost the same as those for the fresh one (Fig. S5 in the ESI ), indicating that the photocatalyst is stable upon UV-light irradiation. To elucidate the semiconducting properties of NH 2 -MIL-101(Ti) upon light excitation, the Mott-Schottky method was applied to estimate the at band positions of the photocatalysts, because it is a generally accepted method in the determination of the at band positions of semiconductors. 39,40The at band positions for NH 2 -MIL-125(Ti) and 1.0 wt Co/NH 2 -MIL-125(Ti) were determined to be A0.40 V and A0.43 V vs. NHE, respectively (Fig. S6 34 When CO 2 is introduced into the reaction system, the signal in the ESR spectrum corresponding to Ti 3 species disappears, indicating the reoxidation of generated Ti 3 species to Ti 4 species.Herein, a mechanism for the enhancement of the photocatalytic reduction over Co/NH 2 -MIL-125(Ti) was proposed, see Scheme 1.The excited ligands can transfer electrons to Ti oxoclusters to form Ti 3 moieties upon visible-light irradiation, as termed linker-to-cluster charge-transfer (LCCT).The as-formed Ti 3 can reduce CO 2 into HCOOH in the presence of TEOA or benzylic alcohols acting as electron and hydrogen donors to achieve a complete photocatalytic cycle.When Co NPs are introduced into NH 2 -MIL-125(Ti), they can also accept the electrons from the excited ligands, because Co NPs are usually good at electron traps.Meanwhile, the as-produced H atoms from TEOA or benzylic alcohols can spill over from the Co NPs to the bridging oxygen next to the Ti-O oxo-clusters and donate electrons to reduce Ti 4 to form Ti 3 .TEOA or the benzylic alcohols would be converted into TEOA or the aldehydes by a de-protonation process during CO 2 reduction.Thus, the more efficient light-harvesting and charge-transfer of Co/NH 2 -MIL-125(Ti) lead to a higher photocatalytic activity.provides a novel way to convert CO 2 into valuable chemicals coupled with other organic transformations.Additionally, the elucidation of the mechanism on photocatalytic CO 2 reduction over Co/NH 2 -MIL-125(Ti) provides some guidance in the development of high-efficient and visible-light-responsive photocatalysts based on MOF materials."
  },
  {
    "title": "Conclusions",
    "content": "MaterialsAll reagents with analytical reagent grade were used as received without further purication.Tetrabutyl titanate Ti(OC 4 H 9 ) 4 , potassium bicarbonate (KHCO 3 ), triethanolamine (TEOA), acetonitrile (MeCN), acetonitrile-D3 (CD 3 CN) and cobalt(II) nitrate hexahydrate Co(NO 3 ) 2 6H 2 O were purchased from Shanghai Chemical Reagent Co. 2-Amino-benzenedicarboxylic acid (H 2 BDC-NH 2 ), methanol (MeOH) and dimethylformamide (DMF) were purchased from Sigma Aldrich Co. Sodium borohydride (NaBH 4 ), sodium carbonate (Na 2 CO 3 ), sodium bicarbonate (NaHCO 3 ), benzotriuoride (BTF), benzyl alcohol, 4-methoxybenzyl alcohol, benzaldehyde, and 4-methoxybenzaldehyde were purchased from Aladdin Industrial Co. Synthesis 2.2.1.NH 2 -MIL-125(Ti).Based on the recipe reported in the literature, 30 NH 2 -MIL-125(Ti) was prepared via a hydrothermal treatment of H 2 BDC-NH 2 (0.54 g, 3 mmol) and Ti(OC 4 H 9 ) 4 (0.26 mL, 0.75 mmol) in the solvent of DMF (9 mL) and dry MeOH (1 mL) at 150 C for 3 days.Aer hydrothermal treatment, the resultant suspension was ltered, washed with DMF and MeOH, extracted by a Soxhlet extractor with MeOH, and nally vacuum-dried to obtain the product.2.2.2.Co/NH 2 -MIL-125(Ti).The Co-doped NH 2 -MIL-125(Ti) samples were prepared through solution inltration of activated NH 2 -MIL-125(Ti) with MeOH solution (0.5 mL) containing Co(NO 3 ) 2 6H 2 O.The mixture was stirred for 12 h, then ltered and dried at 150 C for 3 h, followed by treatment with a NaBH 4 solution (20 mL, 0.05 M).The resulting solid powder was washed with MeOH and deionized water for several times and dried under N 2 atmosphere at 60 C for 10 h to get Co/NH 2 -MIL-125(Ti).The nominal doped amounts of Co in NH 2 -MIL-125(Ti) were 1.0, 2.0, and 3.0 wt, denoted as 1.0 wt Co/NH 2 -MIL-125(Ti), 2.0 wt Co/NH 2 -MIL-125(Ti), and 3.0 wt Co/NH 2 -MIL-125(Ti), respectively. 3.1.Characterization Co/NH 2 -MIL-125(Ti) samples were prepared by an impregnation of the activated NH 2 -MIL-125(Ti) with Co(NO 3 ) 2 6H 2 O solution, reduced by an aqueous NaBH 4 solution.The physiochemical properties of the prepared catalysts are summarized in Table 1.The doped amounts of Co NPs on NH 2 -MIL-125(Ti) determined by the ICP-AES analysis were 0.91, 1.97, and 2.91 wt, respectively, well corresponding to their nominal values in the synthesis.In comparison with NH 2 -MIL-125(Ti), the BET surface areas and the pore volumes of Co/NH 2 -MIL-125(Ti) tend to decrease gradually with increasing Co doping in the matrix of NH 2 -MIL-125(Ti), due to the fact that the cages of NH 2 -MIL-125(Ti) are occupied by the dispersed Co NPs and/or blocked by the Co NPs that could partially be deposited at the pore entrances of the MOF.Fig. 1 shows that the XRD patterns of Co/NH 2 -MIL-125(Ti) are almost the same as that of NH 2 -MIL-125(Ti), indicating that the doping of Co on NH 2 -MIL-125(Ti) does not inuence its crystallinity.Additionally, no characteristic peak of Co species can be observed due to the low loading amount and high dispersion of Co on the MOF.The SEM images (Fig. 2) display that the morphologies of the Co-doped samples are the same as that of NH 2 -MIL-125, indicating that the structure of NH 2 -MIL-125 is well preserved.The sizes of the Co NPs doped on NH 2 -MIL-125(Ti) have a mean diameter of 5 nm from the TEM observation, as shown in Fig. 3.The HR-TEM images of Co/NH 2 -MIL-125(Ti) samples show the characteristic spacings of 0.177 and 0.205 nm for the (2 0 0) and the (1 1 1) lattice planes of cubic Co (JCPDS, no.15-0806), and the characteristic spacings of 0.213 and 0.246 nm for the (2 0 0) and (1 1 1) lattice planes of CoO (JCPDS, no.48-1719), respectively.In order The doped amounts of Co in NH 2 -MIL-125(Ti) were determined by the ICP-AES analysis. Fig. 1 XRD patterns of NH 2 -MIL-125(Ti) (a), 1.0 wt Co/NH 2 -MIL-125(Ti) (b), 2.0 wt Co/NH 2 -MIL-125(Ti) (c), and 3.0 wt Co/NH 2 -MIL-125(Ti) (d). Fig. 2 SEM images of NH 2 -MIL-125(Ti) (a), 1.0 wt Co/NH 2 -MIL-125(Ti) (b), 2.0 wt Co/NH 2 -MIL-125(Ti) (c), and 3.0 wt Co/NH 2 -MIL-125(Ti) (d). Fig. 3 HR-TEM images of NH 2 -MIL-125(Ti) (a), 1.0 wt Co/NH 2 -MIL-125(Ti) (b), 2.0 wt Co/NH 2 -MIL-125(Ti) (c), and 3.0 wt Co/NH 2 -MIL-125(Ti) (d). , the UV-vis spectra of both NH 2 -MIL-125(Ti) and Co/NH 2 -MIL-125(Ti) show a similar absorption onset (ca.505 nm), thereby suggesting an optical band gap of 2.5 eV as determined by the Kubelka-Munk function.However, the UV-vis spectra of Co/NH 2 -MIL-125(Ti) show an extra absorption band in the visible-light region ranging from 500 to 800 nm, compared with NH 2 -MIL-125(Ti), in accordance with their dark green color changed from yellow.The enhanced visible-light harvesting would be of great importance in photocatalysis and thus Co/NH 2 -MIL-125(Ti) catalysts are expected to possess better photocatalytic activities toward target reactions.3.2.Photocatalytic performance 3.2.1.Photocatalytic CO 2 reduction using TEOA as the sacricial agent.To investigate the effects of the doped Co NPs on the photocatalytic performance, photocatalytic CO 2 reduction was carried out using TEOA as the sacricial agent upon visible-light irradiation.No reaction took place in dark or without catalyst.Both NH 2 -MIL-125(Ti) and Co/NH 2 -MIL-125(Ti) can catalyze the reduction of CO 2 into HCOOH upon visible-light irradiation.A concentration change of HCOOH with irradiation time over the prepared photocatalysts is shown in Fig. 6.Compared to the photocatalytic activity of NH 2 -MIL-125(Ti), Co/NH 2 -MIL-125(Ti) catalysts are more active in CO 2 reduction.The effects of the Co content in the MOF on the photocatalytic performance were also examined.One can see that the optimum content of Co in NH 2 -MIL-125(Ti) is about 1.0 wt for photocatalytic CO 2 reduction with about 38.4 mmol g cat A1 h A1 of the HCOOH produced in 10 h irradiation, since the excessive Co in the MOF may cause the blocking of the MOF pores to reduce the photoexciting capacity of NH 2 -MIL-125(Ti).The isotopic 13 CO 2 reaction was used to conrm that the produced HCOOH originated from CO 2 .The 13 C NMR spectrum (Fig. S1 in the ESI ) shows three peaks at 125.76, 159.56, and 165.29 ppm, which can be assigned to dissolved CO 2 , HCO 3 A Fig. 4 High-resolution XPS spectra for Co 2p of NH 2 -MIL-125(Ti) (a), 1.0 wt Co/NH 2 -MIL-125(Ti) (b), 2.0 wt Co/NH 2 -MIL-125(Ti) (c), and 3.0 wt Co/NH 2 -MIL-125(Ti) (d). Fig. 5 UV-vis diffuse reflectance spectra of NH 2 -MIL-125(Ti) (a), 1.0 wt Co/NH 2 -MIL-125(Ti) (b), 2.0 wt Co/NH 2 -MIL-125(Ti) (c), and 3.0 wt Co/NH 2 -MIL-125(Ti) (d). Fig. 6 Amount of the produced HCOOH as a function of irradiation time over NH 2 -MIL-125(Ti), 1.0 wt Co/NH 2 -MIL-125(Ti), 2.0 wt Co/ NH 2 -MIL-125(Ti), and 3.0 wt Co/NH 2 -MIL-125(Ti).The solutions were irradiated with a Xe lamp and filters producing light in a range of 420-800 nm.Photocatalyst: 50 mg, MeCN/TEOA volume ratio: 5/1, total solution volume: 60 mL. in the ESI ).As observed from the Mott-Schottky measurements, both NH 2 -MIL-125(Ti) and 1.0 wt Co/NH 2 -MIL-125(Ti) have characteristics of n-type semiconductors, therefore their conduction band (CB) positions should be close to their at band ones.A comparable position observed for the conduction bands of NH 2 -MIL-125(Ti) and Co/NH 2 -MIL-125(Ti) indicates that the introduction of Co NPs does not inuence the conduction band, implying that the photo-generated electrons could be located at the metal centers in these MOFs.The CB position is more negative than the reduction potential of CO 2 to form HCOOH (A0.28 V vs. NHE),41 indicating that Co/NH 2 -MIL-101(Ti) can reduce CO 2 to form HCOOH (Fig.S7in the ESI ).Although the doping of Co NPs into NH 2 -MIL-125(Ti) could not affect its energy band structure, it could promote the photogenerated charge separation efficiency, which is conrmed by the PL and PC experiments.Fig. 7 shows the PL spectra of NH 2 -MIL-125(Ti) and Co/NH 2 -MIL-125(Ti) excited at 303 nm.NH 2 -MIL-125(Ti) exhibits a PL peak at around 449 nm, and such a peak is greatly weakened upon being doped with Co NPs, indicating that Co/NH 2 -MIL-125(Ti) can signicantly prohibit the photo-generated charge recombination.The interactions between Co NPs and NH 2 -MIL-125(Ti) can create a new way to extend the service life of photo-generated charge carriers via facilitating the electron transfer through Co NPs. 42Electron cannot return from the excited state to the ground state, thus directly weakens the PL intensity of NH 2 -MIL-125(Ti).The transient photocurrent density responses of the catalysts in an on-off cycle mode are shown in Fig. 8. Upon visible-light irradiation, all Co/NH 2 -MIL-125(Ti) catalysts show much higher photoelectric currents in comparison with NH 2 -MIL-125(Ti), among which 1.0 wt Co/NH 2 -MIL-125(Ti) exhibits the best photocurrent response.Based on these results, it can be inferred that the doping of Co NPs into NH 2 -MIL-125(Ti) could facilitate photo-induced charge transfer and restrain the recombination of photo-generated charge efficiently, resulting in the higher photocatalytic activity in CO 2 reduction.The in situ ESR experiment was also carried out to detect the active species involved in the photocatalytic reaction, as shown in Fig. S8 in the ESI. A signal assignable to Ti 3 species is observed in the ESR spectrum of Co/NH 2 -MIL-101(Ti) aer visible-light irradiation. The photocatalytic reduction of CO 2 over Co/NH 2 -MIL-125(Ti) upon visible-light irradiation has been fully investigated.Compared with NH 2 -MIL-125(Ti), Co/NH 2 -MIL-125(Ti) catalysts exhibit signicantly enhanced activities for the photocatalytic reduction.In addition, the benzylic alcohols instead of TEOA used as elector donors can be oxidized to the corresponding aldehydes during the photocatalytic reduction of CO 2 over Co/ NH 2 -MIL-125(Ti), making the proposed process more economical and environment-friendly.Although the photocatalytic activity for CO 2 reduction coupled with the oxidation of benzylic alcohols over Co/NH 2 -MIL-125(Ti) is still low, the current study Fig. 7 Photoluminescence spectra of NH 2 -MIL-125(Ti) (a), 3.0 wt Co/NH 2 -MIL-125(Ti) (b), 2.0 wt Co/NH 2 -MIL-125(Ti) (c), and 1.0 wt Co/NH 2 -MIL-125(Ti) (d) excited at 303 nm. Fig. 8 Transient photocurrent responses of NH 2 -MIL-125(Ti) (a), 1.0 wt Co/NH 2 -MIL-125(Ti) (b), 2.0 wt Co/NH 2 -MIL-125(Ti) (c), and 3.0 wt Co/NH 2 -MIL-125(Ti) (d) in 0.2 M Na 2 SO 4 aqueous solution without bias versus Ag/AgCl upon visible-light irradiation (800 nm l 420 nm). Scheme 1 Proposed mechanism for photocatalytic CO 2 reduction over Co/NH 2 -MIL-125(Ti) upon visible-light irradiation. Physiochemical properties of the prepared catalysts Aerobic photocatalytic oxidation of benzylic alcohols to the corresponding aldehydes over 1 wt Co/NH 2 -MIL-125(Ti) upon visible-light irradiation a Photocatalytic reduction of CO 2 coupled with oxidation of different benzylic alcohols a Reaction conditions: 50 mg of photocatalyst, a MeCN/benzylic alcohol volume ratio of 10 to 1, a total solution volume of 110 mL upon visible-light irradiation (800 nm l 420 nm) for 10 h. a b n.d.: not detect. This journal is The Royal Society of Chemistry 2017 We are grateful for the nancial support by the National Natural Science Foundation of China (21303166, 21476214, and 21576243). There are no conicts to declare."
  }
]