[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2018.02.018"
  },
  {
    "title": "Article_Title",
    "content": "ZnO1−x/carbon dots composite hollow spheres: Facile aerosol synthesis and superior CO2 photoreduction under UV, visible and near-infrared irradiation"
  },
  {
    "title": "Abstract",
    "content": "ZnO1-x/carbon dot exhibits superior activity in both Vis-NIR and NIR only regions. Both the quantities of oxygen defect and carbon are crucial for CO2 photoreduction."
  },
  {
    "title": "Experimental",
    "content": "All materials were of analytical grade and used as received without further purification.Zinc nitrate hexahydrate and citric acid were obtained from Sigma-Aldrich (St. Louis, MO).CHO (CCL 61TM) (Chinese hamster ovary) cells were purchased from American Type Culture Collection (Manassas, VA).SlowFade TM gold antifade mountant with DAPI (4',6-diamidino-2-phenylindole) nuclear stain was Alumina micropolish powder (0.05 m) was obtained from Buehler (Lake Bluff, IL). The ZnO1-x/C composites were synthesized in a lab-built FuAR depicted in Fig. S1a. The precursor solution contained 0.5 M of zinc nitrate hexahydrate and various concentrations of citric acid (CA) in deionized (DI) water.The solution mixture was stirred for 1 h before using it.Then, the precursor solution was nebulized into aerosol droplets using a Collison nebulizer (BGI Incorporated), and the droplets were carried by nitrogen gas (12 psi) through a quartz tube (1 mm X 25 mm ID) heated to various temperatures.The products were collected downstream of the reactor on a glass fiber membrane filter.The synthesized samples were denoted ZnO1-x/C(Y), where Y corresponds to the molar ratio of CA/Zn in the precursor solution. For comparison, a pure ZnO sample was prepared by annealing the ZnO1-x/C(0.6)sample at 600 C in air for 3 h, followed by allowing it to cool to room temperature. Additionally, we also prepared the ZnO1-x/C with a fixed CA/Zn ratio of 0.6 at different FuAR temperatures (500, 550, 600, and 650 o C) to investigate the temperature effect on the photocatalytic activity of the composites. The morphology and elemental distribution of zinc, oxygen, and carbon of the synthesized materials were examined by high-resolution transmission electron microscopy -EDAX (HR-TEM, JEOL J2100F).The HR-TEM was operated at 200 kV accelerating voltage.The crystal phase of the material was determined by X-ray Diffraction (XRD) (D8 Advance, Bruker, USA) with Cu K radiation ( 1.548A). The optical properties of the materials were measured using a UV-Vis spectrophotometer (UV-2600, Shimadzu, USA).The surface chemical properties were analyzed by laser Raman spectrometry (Renishaw InVia Reflex confocal Raman spectrometer, with a 514 nm laser) and X-ray photoelectron spectroscopy (XPS) (PHI 5000 VersaProbe II) equipped with a monochromatic Al K (1486.6 eV) X-ray source. The surface area and pore size distribution were analyzed using the nitrogen physisorption method.In total, 79 adsorption and desorption points were analyzed using the nitrogen physisorption method (Autosorb-1, Quantachrome Instruments, Boynton Beach, FL).The surface area was calculated using the Brunauer-Emmett-Teller (BET) method and the pore size distribution was evaluated by non-local density functional theory (NLDFT). The thermal behavior of the as-synthesized materials was analyzed by thermal spectra of all the samples were recorded via a Nicolette Nexus 470 FTIR spectrometer. To examine the photo-excitability of ZnO and ZnO1-x/C(0.6)samples, confocal microscopy was performed.Chinese hamster ovary (CHO) cells were seeded in CELLview TM plates at 5 10 4 cells/well and allowed to grow for 24 h.After another 24 h of exposure to the synthesized materials, the cells were fixed and washed with phosphate buffer saline (PBS) three times before imaging.All cells were fixed by immersion in 4 paraformaldehyde (PFA) as the cross-linking solution for 10 min at room temperature.The cells were then washed three times with ice-cold 1x PBS for 3 min each time.The fixed cells were incubated in ice-cold 1x PBS buffer containing 0.1 Triton (permeabilization agent) for 10 min at room temperature, then washed three times with ice-cold 1x PBS for 5 min each time.The CELLview TM plates were nm for materials detection.A negative control sample (untreated cells) was prepared with cells in the absence of hollow spheres. Photoelectrochemical measurements were performed using a lab-built three-electrode cell setup with a Pt wire as the counter electrode and an Ag/AgCl bar as the reference electrode.For the working electrode, 5 mg of the material powder was dispersed in 0.75 ml of DI water, followed by the addition of 20 l of Nafion solution (0.05, Sigma-Aldrich).After approximately 40 min of ultrasonication, the above suspension was dropped onto the surface of an indium tin oxide (ITO) conductor glass slide, whose the contact side had previously been protected using Teflon tape.The working electrode was then dried at 60 C for 4 h.The photocurrent was measured using a CHI 760 Bipotentiostat in 0.1 M Na2SO4 solution. Gas-phase photocatalytic reduction of CO2 by H2O vapor was performed using a labbuilt stainless steel reactor operating in continuous flow mode, as shown in Fig. S1b. For each test, 15 mg of catalyst was uniformly dispersed onto a membrane filter and placed in the photoreactor.High purity CO2 (99.999,Praxair) was continuously passed through a water bubbler to obtain a gas mixture of CO2 H2O, which then flowed into the photoreactor.Prior to each reaction test, a high gas flow rate (16.0 ml min -1 ) of CO2 was used to purge air from the reactor for 35 min, and then a flow rate of 3.0 ml min -1 was maintained during the whole 5 h photoreaction.A 400 W Xe Arc in the reactor effluent were continuously analyzed using a gas chromatograph (GC, 6895N, Agilent Technologies, Inc.) equipped with a thermal conductivity detector (TCD).Helium was used as the carrier gas.Since this study emphasized photocatalytic reduction of CO2 on a gas-solid interface, possible products such as methanol, formaldehyde, and formic acid were not measured, which are more likely produced in CO2 photoreduction in aqueous solutions. Isotope experiments were performed in the same reactor under the whole UV-Vis-NIR spectrum. 13CO2 (Sigma-Aldrich) was used as the source gas.The products in the reactor after 3 h light irradiation were analyzed by a GC (7890A, Agilent Technologies, Inc.), equipped with an Agilent JW GS-CarbonPLOT capillary column (0.32 mm ID, 3 m film thickness, and 60 m length), and a mass spectrometer (5975C, Agilent Technologies, Inc.)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Scheme 1 illustrates the formation route of the ZnO1-x/C composite hollow sphere. The formation of ZnO1-x/C through the FuAR process is based on a \"droplet-toparticle\" mechanism 28.First, the precursor solution was atomized to form small aerosol droplets.The droplets were carried through the high temperature (600 o C) furnace by nitrogen carrier gas.During the flight, CA/Zn(NO3)2 precipitates were formed after the complete drying of aerosol droplets.Afterward, the ZnO/C composites were formed as the result of the decomposition of Zn(NO3)2 and the carbonization of citric acid.Under the nitrogen atmosphere, the pyrolysis of citric acid produced solid carbon and a large amount of reducing gasses (e.g., CH4, CO, and H2) , which then created an outward \"blowing force,\" leading to the formation of a hollow sphere.Both the deposited carbon and the reducing gases participated in the reduction reactions of ZnO to ZnO1-x particles.It should be mentioned that no carbonaceous products were formed when only citric acid was used as the precursor under the same conditions, implying that transition metal Zn served as a nucleation site for carbonization of citric acid to form carbon materials.Also, the hollow structures were formed only in the presence of both zinc nitrate and citric acid precursors.Thus, citric acid not only serves as a reducing agent and carbon source but also supports the formation of hollow structure.Given the roles of zinc nitrate and citric acid, the number of oxygen vacancies and deposited carbon in the ZnO1-x/C composite could be easily controlled by altering the CA/Zn ratio and the FuAR temperature. In past years, several strategies have been reported for developing oxygendeficient metal oxide semiconductors, such as hydrogen thermal treatment 30 and metal reduction using Mg and Al under a hydrogen/argon atmosphere 31,32. Nevertheless, the need to carefully control the hydrogenation treatment procedures and the high-pressure conditions make the manufacturing process rather difficult, expensive, and time-consuming.Besides, solvent-intensive washing processes are also required to remove the reactive metals from the synthesized materials thoroughly. In contrast, the continuous and scalable FuAR process synthesizes ZnO1-x/C composites in a very short residence time of only a few seconds, without involving extra hydrogen gas or any post thermal or washing treatment. The morphology of the ZnO1-x/C(0.6)composite was characterized using HR-TEM technique.As displayed in Fig. 1a, the ZnO1-x/C(0.6)composite particles retain the spherical morphology of the atomized precursor droplets, and the hollow structure is verified by the bright contour at the center of the spheres.An HR-TEM image (Fig. 1b) also shows a well-crystallized ZnO structure, and the selected area electron diffraction (SAED) pattern (Fig. 1c) further confirms a high crystallinity of ZnO1-x/C(0.6) composite with a hexagonal wurtzite structure, in which six diffraction rings perfectly correspond to the same positions as those from bulk ZnO 33,34.The EDS elemental mapping images (Fig. 1d-g) of an individual ZnO1-x/C(0.6)composite further indicate that the zinc, oxygen, and carbon are uniformly distributed throughout the whole particle.To confirm the size of the deposited carbon, the ZnO1-x/C(0.6)sample was soaked in 3.0 M HCl solution under stirring for 2 h to remove the ZnO1-x.After treated with acid, the residual carbons are apparently free of zinc elements (Fig. S3).1h shows the HR-TEM image of the Zn-free C(0.6), in which well-dispersed nanoparticles with sizes around 2 nm are clearly observed.Moreover, the in-plane spacing in a single carbon dot was estimated to be 0.21 nm (Fig. 1i), which corresponds to the (100) diffraction plane spacing of graphitic carbon 35. The phase composition and crystallinity of the samples were investigated by XRD (Fig. 2).The powders prepared using zinc nitrate precursor only are identified as mixed phases of wurtzite ZnO structure and zinc nitrate hydroxide hydrate 36. Similar diffraction reflections are also found on the ZnO1-x/C(0.25).In spite of the high heating experienced by the droplets in the FuAR (600 o C), the low residence time of 9 s in the heated zone was too short for complete decomposition of zinc nitrate.On the contrary, the high phase purity of a typical wurtzite ZnO structure is observed on the ZnO1-x/C samples prepared with higher molar ratios of CA/Zn (0.5-0.75).The results show that adding citric acid in the precursor solution promotes the decomposition of zinc nitrate, and thus improves the crystallinity of the final ZnO1-x/C composites.On the other hand, the diffraction reflections from the wurtzite ZnO structure are more intense and sharper on the pure ZnO sample.This result suggests that post thermal treatment can further enhance the crystallinity of the sample. The nature of the carbon present in the ZnO1-x/C samples was investigated by Raman spectroscopy (Fig. 3a).All samples possess two peaks at around 1360 and S1), indicating an improved graphitization degree of ZnO1-x/C with increased concentration of citric acid.The high graphitization degree improves the electrical conductivity, facilitates favorable electron transport, and therefore enhances photocatalytic performance 38. Raman spectroscopy was also used to identify the oxygen-deficient nature of the ZnO1-x/C samples, and pure ZnO was studied as a reference.As illustrated in Fig. 3b, all the samples demonstrate an intense peak at 435 cm -1 , corresponding to the wurtzite phase of ZnO 13.Compared to the ZnO1-x/C samples, the reference ZnO sample shows a sharper peak, suggesting its stronger crystallinity, supporting the XRD results. Another intense peak at 580 cm -1 is observed for the ZnO1-x/C samples, ascribed to the presence of defect-induced oxygen vacancies 13.The intensity of this peak increases with an increase in the CA/Zn ratio, suggesting an increase in the number of oxygen vacancies as well.The maximum intense peak at 580 cm -1 was obtained for the ZnO1-x/C(0.75),indicating the highest number of oxygen vacancy defects among all samples.eV can be assigned to the CC bond in the graphitic-phase carbon, originating from the carbonization of citric acid 39.Fig. 3d displays the O 1s spectra of the ZnO, ZnO1-x/C(0.6), and ZnO1-x/C(0.75)samples.The peak centered at the band energies of about 528.2 eV originates from the lattice oxygen anions (OI), whereas the peak at 529.6 eV is ascribed to oxygen vacancy defect (OII).The ratios of the areas of OII and OI were calculated to be 15, 44.6 and 53.2 for ZnO, ZnO1-x/C(0.6), and ZnO1- x/C(0.75).The result indicates that ZnO1-x/C(0.75) had the highest number of surface oxygen vacancies.Both the Raman and XPS results confirmed the presence of a higher number of oxygen vacancy defects for the ZnO1-x/C composites than for pure ZnO.Oxygen vacancies act as a donor and supply electron to the conduction band, hence improving photocatalytic performance 32. The carbon content of the ZnO1-x/C composites was determined by thermogravimetric analysis in air.As seen in Fig. S6a Contrarily, the decomposition of the ZnO1-x/C samples, with a high citric acid concentration, occurs in a single sharp weight loss between 300 to 500 o C, with a pronounced primary weight loss at 400-410 o C (Fig. S6b).This weight loss is due to the complete combustion of deposited carbons in the samples.The total carbon is calculated from the weight difference over the temperature range of 300 to 500 o C (Table S1).Obviously, the higher the concentration of citric acid in the precursor solutions, the larger the amount of carbon present in the final ZnO1-x/C products.A slight increase in the mass between 500 to 700 o C is observed for all the ZnO1-x/C composites, except for ZnO1-x/C(0.25).This increase could be due to the oxidation of ZnO1-x to ZnO under air flow.In particular, ZnO1-x/C(0.75) had the largest mass increase (1.07), followed by ZnO1-x/C(0.6) (0.28), and ZnO1-x/C(0.5)(0.1). As a result, these findings clearly confirm the presence of oxygen vacancies in the ZnO1-x/C composites.S1.The SBET and Vp of the ZnO1-x/C samples are significantly larger than that of the pure ZnO.Besides, for the ZnO1-x/C samples, the specific surface area of the samples increases slightly with an increased molar ratio of CA/Zn.Generally, a photocatalyst with the high surface area and high adsorption ability toward target reactants contributes to higher photocatalytic activity by allowing more reactant molecules to be adsorbed onto the catalyst surface 5.In this sense, we expect that this unique ZnO1-x/C hollow composite with a large surface area will provide more active sites for CO2 adsorption, thus enhancing CO2 photoreduction. Photoreduction of CO2 with H2O on the ZnO1-x/C composites was conducted in a continuous flow reactor at ambient temperature and atmospheric pressure.Prior to that, three preliminary control tests were performed under the following conditions: (1) in the absence of a catalyst, (2) in the absence of light illumination, and (3) in the absence of CO2.As displayed in Fig. S8, no carbonaceous product was detected in all cases, confirming the absence of CO2 photoreduction on the ZnO1-x/C composites. However, in the presence of all the three necessary components (catalyst, light source, and CO2 H2O), only CO was detected.This result shows that CO was formed from the photoreduction of CO2, and rules out the possibility of photolysis and decomposition of surface carbons on the ZnO1-x/C composites 41.Also, isotope tracer analyses using 13 CO2 were conducted for the ZnO1-x/C(0.6)sample.Fig. S9 shows the gas and mass chromatography spectra of the gas samples in the reactor, with the ZnO1-x/C(0.6)sample under irradiation by the whole UV-Vis-NIR spectrum for 3 h.To exclude the effect of nitrogen gas (remaining in the column) in the mass chromatography analysis, which has a similar retention time and m/z value of CO, selected ion monitoring of compositions with m/z value as 12 and 13 were conducted. A significant peak corresponding to 13 C at a retention time of 4.13 min (the retention time of CO) was detected, which verified that the CO originated from CO2, not from the decomposition of the catalysts. It is well known that the photoreduction of CO2 is a proton-assisted multielectron transfer process 16.In this process, even though the production of hydrocarbons (e.g., methanol, formaldehyde, and ethanol) is thermodynamically favorable, it requires more electrons and protons, thus encountering kinetic limitations. Furthermore, these products are more likely produced in CO2 photoreduction in aqueous solutions 42.Since this study focused on the CO2 reduction on a gas-solid interface, CO was found as the main product in our flow reactor system because it needs a minimum number of electrons and protons and appears to be kinetically favorable.The absence of CH4 in this study could reflect the fact that more electrons and protons are required to reduce CO2 to CH4, making it more difficult to generate than CO.For producing CH4, an eight-electron reduction and available H atoms from the oxidation of water on the same catalyst surface are required 3.If the CO desorbs from the surface before it can be fully reduced, then the formation of CH4 is significantly affected. To understand the light-harvesting behaviors of the photocatalysts, we performed photocatalytic tests under different wavelength ranges, including UV-Vis-NIR (250-950 nm), Vis-NIR (400-950 nm), and NIR (715-950 nm).Fig. 4a compares the average CO production rate of various photocatalysts for 5 h.For each catalyst, experiments were repeated twice using fresh catalysts, and the production rates were averaged and standard deviations reported.Commercial ZnO and FuAR-synthesized ZnO show CO production rates of 0.61 and 1.11 mol g -1 h -1 , respectively, under UV-Vis-NIR irradiation.Compared to the ZnO samples, the CO production rate of the ZnO1-x/C composites were considerably larger.The highest CO production rate was observed on ZnO1-x/C(0.6), with an average value of 60.77 mol g -1 h -1 , which is a more than 54-fold enhancement in CO production over that of pristine ZnO.TiO2 (Degussa-P25) is a well-known benchmark photocatalyst and has been extensively 43,44.For comparison, we measured the photocatalytic activity of Degussa-P25 for CO2 photoreduction in identical conditions under the UV-Vis-NIR irradiation.The average CO production rate of Degussa-P25 is 5.30 mol g -1 h -1 , 11.5 times lower than that of ZnO1-x/C(0.6). Furthermore, we investigated that catalytic performance in the Vis-NIR and NIR regions.Both ZnO and Degussa-P25 are photocatalytically inactive.On the contrary, all the ZnO1-x/C composite are active for CO2 photoreduction under Vis-NIR irradiation, in the order of ZnO1-x/C(0.6) ZnO1-x/C(0.5) ZnO1-x/C(0.25) ZnO1- x/C(0.75) (Fig. 4a).More significantly, only the ZnO1-x/C(0.5) and ZnO1-x/C(0.6) are active in only NIR region.Again, the ZnO1-x/C(0.6)outperforms other samples in both Vis-NIR (400-950 nm) and NIR (715-950 nm) photocatalytic activity, with average CO production yields of 34.17 and 15.98 mol g -1 h -1 , respectively, which was achieved without involving any noble metals.These results clearly suggest the superiority of ZnO1-x/C(0.6) composite in harnessing low-energy NIR photons to reduce highly stable CO2 to CO.Moreover, CO yield was further optimized by varying the FuAR temperature from 500 -650 o C (Fig. 4b).ZnO1-x/C(0.6) composite synthesized at 550 and 600 o C showed higher photocatalytic activity than composites synthesized at 500 and 650 o C. Based on the above results, we conclude that both the precursor component ratio and FuAR temperature had strong impacts on the In Table S2, the photocatalytic performance of ZnO1-x/C(0.6) is compared with previously reported results under similar conditions.Our CO productivities are considerably higher than the reported values for diverse inorganic heterostructure photocatalysts.The quantum efficiency based on CO production over ZnO1-x/C(0.6) was calculated to be 0.13 under UV-Vis light (see Supporting information for detailed calculations), which is 3, 37, 9, 18, and 13 times higher than reported for V-W-TiO2 (QY 0.039), ZnO-CuO (QY 0.0035), reduced TiO2-x (QY 0.0141), NrGO-TiO2 (QY 0.0072) and EDA-rGO-TiO2 (QY 0.0094), respectively.It is worth mentioning that our engineered material did not employ any noble metal cocatalyst or doping of foreign elements.It is therefore anticipated that heterointegration or doping in our future work may result in an even more promising photocatalyst for visible-and NIR-driven CO2 reduction.in the XRD results between fresh and used ZnO1-x/C(0.6)samples.Moreover, the oxygen vacancy defect of the used ZnO1-x/C(0.6) was also investigated and compared with the fresh one, with the results presented in Fig. S10.The obtained O1s spectrum of the used ZnO1-x/C(0.6) was deconvoluted into three peaks.Different from the fresh ZnO1-x/C(0.6), the used one shows an additional peak, which can be assigned to the adsorbed H2O on the catalyst.This observation reflects the adsorption of a large amount of water vapor on the catalyst surface during the photoreaction.Nevertheless, the ratio of the areas of OII (oxygen vacancy defect) and OI (lattice oxygen) was calculated to be 43.0,which is almost identical to that of the fresh sample (44.6). The above results clearly indicate high structural and chemical stability of the ZnO1- x/C(0.6).The declined photocatalytic activity has been commonly reported in gasphase photoreduction of CO2 operated in a continuous mode 3,43,45.It is believed that the deterioration was ascribed to the coverage and saturation of the active sites with less reactive intermediates on the surface of the photocatalysts, and hindered the photocatalytic reactions 16.cannot be explained by the increased surface area alone, but probably is also associated with the amounts of deposited carbon and oxygen vacancy. A recent work suggested that an oxygen vacancy-rich surface is more thermodynamically favorable for CO2 capture than a defect-free surface 47.Xie et al. 48 showed that, compared with stoichiometric SrTiO3, the chemical adsorption of CO2 was improved by increasing the oxygen deficiency in SrTiO3, thus leading to enhanced CO2 photoreduction.Therefore, the presence of oxygen vacancy defects could significantly enhance the adsorption of CO2, leading to increasing the photoreduction CO2.In this regard, the highest activity of ZnO1-x/C(0.6) could also be related to its high CO2 adsorption capacity, demonstrating the important role of the CO2 adsorption process in the current reaction scheme.Nevertheless, it is noteworthy that the high CO2 uptake of ZnO1-x/C(0.75) did not guarantee high photocatalytic activity; rather, it showed the poorest activity among all samples.These results indicated that the CO2 adsorption ability is not the only parameter affecting photocatalytic performance in these catalysts. The light response range is an important evaluation factor in photocatalysis 49.has been reported that carbon dots show excitation dependent photoluminescence behavior 52.They are excitable at multiple wavelengths and emit light at different wavelengths.As shown in Fig. S13, the Zn-free C(0.6) sample possess very strong fluorescence emissions when excited at 488, 532, and 635 nm.This information lends to the credibility that ZnO1-x/C(0.6) have carbon dots on their surface, as also evidenced by HR-TEM images (Fig. 1). To further explore the optical properties of the C(0.6) sample, PL measurements were performed by using different excitation wavelengths.As displayed in Fig. 5d, with excitation wavelengths at 350 and 400 nm, the PL spectra of C(0.6) sample show down-converted light emissions in the range of 400-600 nm, resulting from irradiative recombination of excitions at the surface of C(0.6).In addition to the strong down conversion PL property, the C(0.6) sample also exhibits a remarkable up-conversion behavior, which has been reported to be related to a two-photon absorption process 53.The up-converted PL spectra of the C(0.6) sample with excitation wavelengths at 700, 750 and 800 nm (Fig. 5e) further verify its key role as a light harvester and converter, with the emission wavelength in the range of 410-560 nm.Hence, it is reasonable to suggest that the excellent photocatalytic response of ZnO1-x/C(0.6) in the NIR region arises from the up-converted emission energy of carbon dots to ZnO1-x. A N U S C R I P T After the CO2 adsorption and photogeneration of the charge carriers, their separation and transport are important parameters in the CO2 reduction process 54.Steady-state PL analyses were conducted to study the defects and the state of photogenerated charge carriers in the photocatalysts, with results depicted in Fig. 6a.The PL spectrum of ZnO exhibits a near-band-edge emission (NBE) at 388 nm (3.2 eV), originating from the direct recombination of the free excitons 13.However, the characteristic UV emission was not clearly distinguished in the ZnO1-x/C(0.6).It is noted that ZnO1-x/C(0.6) has additional three visible peaks at 460, 566 and 600 nm, respectively, which were ascribed to the neutral oxygen vacancy (Vo), singly charged oxygen vacancy (Vo ) and doubly charged oxygen vacancy (Vo ) 14.The above findings indicate that a high concentration of oxygen defects was introduced into the ZnO1-x/C(0.6)sample.One should also mention that ZnO1-x/C(0.6) exhibits a weak emission at around 360 nm, which is attributed to the emission from the C(0.6) carbon dots.As displayed in Fig. S14, C(0.6) carbon dots show a strong emission peak at around 360 nm (3.5 eV), which is ascribed to the - transition of aromatic domains in the carbon dots 55. The lifetime of charge carriers is an important parameter in the efficacy of the transfer and separation of photoexcited carriers in the photocatalytic system 34. Hence, the lifetimes of the charge carriers of ZnO and ZnO1-x/C(0.6) were measured by time-resolved PL (Fig. 6b).The carrier lifetime of ZnO1-x/C(0.6) was estimated to be 8.25 ns, which was at least 27 times longer than that of ZnO, 0.307 ns (instrument response function is 0.2 ns), suggesting a drastically enhanced separation efficiency of photoexcited carriers on the ZnO1-x/C(0.6). To support the above observation, the transient photocurrent responses of the samples were recorded with consecutive five switch-on/off cycles to understand the separation efficiency of the photogenerated charge carriers.As illustrated in Fig. 6c, all samples exhibit a steady photocurrent generation at each switch-on/off event, implying good stability.Additionally, the photocurrent response of ZnO disappears immediately right after the light is switched off, while a delayed decay of photocurrent is observed for ZnO1-x/C(0.6).This observation may result from trapped charge carriers with extended lifetimes 56.The above results suggest that the separation efficiency of the charge carriers was efficiently elevated and the recombination of electron-hole pairs was greatly hindered. We consider that this enhanced photocurrent response should be attributed to the efficient charge carrier transfer offered by oxygen vacancy defects, and to the superior conductivity contributed by the deposited carbons.Additionally, high concentration electron in the oxygen vacancy defect band can absorb photons and transit to the showed no photoactivity for CO2 reduction in our study, we deduce that the simultaneous reduction of CO2 and oxidation of H2O occurred on the ZnO1-x surface, whereas the carbon dots function as light harvester and energy converter 61,62.The carbon dot can absorb the high energetic photons in the UV light, followed by light emission located in the range of 400-500 nm (Fig. 5d), which further increase the light utilization of UV/visible light. In the case of NIR light only (Fig. 7b), the carbon dots can absorb low energetic photons in the NIR, and then emit higher energy photons in the visible light region (410-560 nm) due to its up-converted fluorescence emissions (Fig. 5e), which in turn further excites ZnO1-x to form electron-hole pairs.These photo-excited electrons and holes within the ZnO1-x can either participate in photo-reactions at the surface or recombine.The recombination process has faster kinetics than the redox reactions and hence controls the efficiency of the photocatalytic process 63, which was also verified by our transient photocurrent response results.Furthermore, the hollow structure can enhance the light harvesting through multiple internal reflections, which can make better use of the light source and lead to improve the photocatalytic activity.Therefore, the overall photocatalytic activity of ZnO1-x/C(0.6) is enhanced during the process."
  },
  {
    "title": "Conclusions",
    "content": "In summary, NIR-light-driven CO2 reduction over a novel ZnO1-x/carbon dots composite was reported for the first time.The high NIR excitation of ZnO1-x/carbon dots can attribute to the presence of moderate amounts of oxygen vacancies and carbon dots.The ZnO1-x/carbon dots heterostructures synthesized through a fast, continuous and scalable FuAR approach possessed the enhanced UV, visible and NIR photocatalytic activity.This result is of significance in the utilization of a broad range of the solar spectrum, considerably broadening potential applications in sustainable energy sources and environmental cleanup.Future work will include the investigation purchased from Thermo Fisher Scientific (Waltham, MA).LIQUIONTM NafionTM containing solution was purchased from Ion Power NafionTM Store (Newcastle, DE). gravimetric and differential thermal analyses (TGA/DTA) (TA Instruments, New Castle, DE).The CO2 adsorption tests were conducted by the same TGA analyzer.Typically, the powder samples were loaded on the TGA sample holder and purged with nitrogen gas at 120 o C with a flow rate of 25 cm 3 /min for 30 min, by which time the weight remained unchanged, which strongly implied that the evaporation of water from the samples was complete.The mass change of the samples during CO2 adsorption was then recorded under an isothermal condition of 30 o C. The inlet CO2 concentration was 99.999 (v/v in N 2 ), which was obtained from a certified gas cylinder and introduced at a flow rate of 25 cm 3 /min for 15 min of adsorption, after which the weight remained unchanged, ensuring that the adsorbents were completely saturated.The fluorescence spectra of synthesized materials were recorded using a Vis-NIR spectrofluorometer (Horiba Jobin Yvon Inc).Samples were diluted until clear and sonicated for at least 5 minutes before the measurements.At least three measurements per sample were taken.Fluorescence lifetime was measured using time-correlated single-photon counting (TCSPC) method on .Data Station software (Horiba) was used for data acquisition.Samples were diluted in MilliQ water and sonicated.Lifetime measurements were conducted at 295 nm excitation NanoLED light sources at MHz frequency and slit width of 8 nm.Ultraviolet photoemission spectroscopy (UPS) measurements, using Physical Electronics 5000 VersaProbe II Scanning ESCA Microprobe, were performed to determine the valence band, conduction band and Fermi level position.He I (21.2 eV) ultraviolet source was used, and 5 V bias was applied to the sample to observe a clear secondary electron edge.The samples were prepared on Si wafer coated with 15 nm gold film.Fourier transform infrared (FTIR) then incubated with blocking buffer for 30 min.To stain the nuclei, SlowFade TM gold antifade mountant with DAPI (diluted 1:100 in 1x PBS) was used.The cells were incubated overnight at 4 o C.During confocal microscopy analysis, the laser wavelengths were 405 nm for DAPI (nucleus staining), and 405, 488, 532, and 635 lamp (Oriel 66021, Newport Co.) equipped with different cut-off filters was employed to provide radiation in different wavelength regions, including UV-Vis-NIR (250-950 nm), Vis-NIR (400-950 nm), and NIR (715-950 nm).The light spectra with different cut-off filters are shown in Fig. S2.The gaseous products (CH4, CO2, CO, O2, and N2) 1585 cm-1 , corresponding to the defect-induced feature (D band) and the sp 2hybridized carbon within the hexagonal graphitic structure (G band), respectively37.The density of defects in graphite materials is commonly expressed by the I D /I G (the intensity of the D-band divided by the intensity of the G-band).The value of I D /I G decreases from 0.75 (ZnO1-x/C(0.25))to 0.55 (ZnO1-x/C(0.75))(Table Fig.3cshows the C 1s peak of the XPS spectrum of ZnO1-x/C(0.6), which can be , the ZnO1-x/C(0.25)sample showed weight losses over a broad temperature range (100-400 o C).It is noted in the DTA profile (Fig. S6b) that, compared with other ZnO1-x/C samples, ZnO1-x/C(0.25) undergoes a significant weight change at 155 o C.This weight loss is related to the A C C E P T E D M A N U S C R I P T thermal decomposition of zinc nitrate hydroxide hydrate, which was reported to thermally decompose over a temperature range of 65-240 o C 40. Fig.S7ashows the nitrogen physisorption isotherms of the pristine ZnO and photocatalytic performance of ZnO1-x/C composites for CO2 reduction. Fig.4cshows the production rates of CO on Degussa-P25 and ZnO1-x/C(0.6) as Adsorption of CO2 on the surface of the catalyst is the first step in the photocatalytic reaction.Hence it is an important parameter for evaluating the performance of the catalyst46.Fig.5arepresents the time-dependent CO2 uptake of ZnO and ZnO1-x/C samples, evaluated by the TGA measurement.The ZnO shows a low adsorption uptake of 0.0095 mmol-CO2/g-sample, whereas all the ZnO1-x/C samples have considerably improved CO2 uptakes, in the order of ZnO1-x/C(0.75) (0.32 mmol-CO2/g) ZnO1-x/C(0.6) (0.31 mmol-CO2/g) ZnO1-x/C(0.5) (0.27 mmol-CO2/g) ZnO1-x/C(0.25) (0.08 mmol-CO2/g).The increased CO2 adsorption could result from the large surface area of the ZnO1-x/C samples.Interestingly, after normalization by their surface area, the adsorption abilities of the ZnO1-x/C samples are still 3.ZnO1-x/C(0.75)),3.34 (ZnO1-x/C(0.6)),3.15 (ZnO1-x/C(0.5)),and 1.51 (ZnO1x/C(0.25))times that of ZnO.Therefore, the improved CO2 adsorption of the ZnO1-x/C photogeneration of charge carriers, improving the photocatalytic activity of the ZnO1- photocurrent responses among all the samples was perfectly consistent with the trend Figure Captions. Fig. 1. (a-b) HR-TEM images, (c) SAED pattern, (d-g) EDS elemental mapping Fig. 2. XRD patterns of ZnO and ZnO1-x/C composites. Fig. 4. (a) Average production rate of CO (5 h) on ZnO1-x/C samples synthesized with different concentration of citric acid, FuAR temperature: 600 o C, (b) Average Fig. 5. (a) TGA isotherms for CO2 adsorption, (b) Diffuse reflectance UV-Vis spectra, Fig. 6.(a) Steady-state PL measurements of the ZnO and ZnO1-x/C(0.6)under 295 nm Fig.7.Proposed mechanism for CO2 photoreduction on ZnO1-x/C(0.6) under (a) Fig. 1. (a-b) HRTEM images, (c) SAED pattern, (d-g) EDS elemental mapping images of the ZnO1-x/C(0.6) and (h-i) HR-TEM images of Zn-free C(0.6). Fig. 2. XRD patterns of ZnO and ZnO1-x/C composites.A C C E P T E D M A N U S C R I P T Fig. 4. (a) Average production rate of CO (5 h) on ZnO1-x/C samples synthesized with different concentration of citric acid, FuAR temperature: 600 o C, (b) Average production rate of CO (5 h) on ZnO1-x/C(0.6) synthesized at different FuAR temperatures, (c) Time-dependent production rate of CO on the Degussa-P25 and ZnO1-x/C(0.6)composite under different wavelength ranges, and (d) XRD patterns of the fresh and used ZnO1-x/C(0.6)composite. Fig. 5. (a) TGA isotherms for CO2 adsorption, (b) Diffuse reflectance UV-Vis spectra, Fig. 6.(a) Steady-state PL measurement of ZnO and ZnO1-x/C(0.6)under 295 nm excitation, (b) Time-resolved PL decay and its fitting curves (on the x axis, each channel is equivalent to 50 ps), (c) Time-dependent current density response for the ZnO and ZnO1-x/C samples under intermittent irradiation at a bias potential of 0.5 V vs. Ag/AgCl, and (d) UPS valence band spectrum of ZnO and C extracted from ZnO1-x/C(0.6), and Inset of the figure represents the lower energy region of ZnO and C spectrum.Red dot corresponds to secondary electron edge, and black vertical tick mark represents the onset of the density of states. Fig.7 (a) Partial support from the National Science Foundation Grant CBET 1705864 and Department of Energy Grant DEFE0029161 are gratefully acknowledged.We appreciate Dr. Huafang Li's guidance for HR-TEM imaging."
  }
]