[
  {
    "title": "Doi",
    "content": "10.1016/j.apsusc.2021.150369"
  },
  {
    "title": "Article_Title",
    "content": "Synergistic effects of surface Lewis Base/Acid and nitrogen defect in MgAl layered double Oxides/Carbon nitride heterojunction for efficient photoreduction of carbon dioxide"
  },
  {
    "title": "Abstract",
    "content": "Conversion of CO 2 to CO from solar energy on semiconductors is a promising route to renewable energy, but their practicality is limited by the poor adsorption and activation of CO 2 on the semiconductor surface and the low utilization of photovoltaic carriers.Here, we construct a MgAl layered double oxide/nitrogen-deficient carbon nitride (MgAl LDO/N v -CN) nanosheets hybrid by in situ deposition of MgAl layered double hydroxide (MgAl LDH) on N v -CN nanosheets followed by subsequent calcination.The MgAl LDO serves as the surface-rich Lewis basic sites to effectively enhance adsorption of CO 2 and H 2 O, while the nitrogen defects can enhance the optical absorption of g-C 3 N 4 and improve the charge carrier separation.The optimal MgAl LDO/N v -CN has high photocatalytic activity for CO 2 reduction with a CO generation rate of 20.47 molg -1 h -1 under visible light illumination, which is 6 times higher than that of bulk g-C 3 N 4 .Our work highlights the significance of synergy of MgAl LDO Lewis base/acid sites and nitrogen vacancy defects in the design of efficient photocatalysts for CO 2 reduction."
  },
  {
    "title": "Experimental",
    "content": "In this study, dicyandiamide (DCDA), Magnesium nitrate hexahydrate (Mg(NO 3 ) 2 6H 2 O), Aluminum nitrate nonahydrate (Al (NO 3 ) 3 9H 2 O), Glycine (C 2 H 5 NO 2 ), Sodium hydroxide (NaOH) and Hydrochloric acid (HCl, 36-38) were purchased from Sinopharm Chemical Reagent Co. Ltd (Shanghai, China).Ammonium chloride (NH 4 Cl) was purchased from Nanjing No. 1 Chemical Reagent Factory.All chemicals used were of analytical grade and used as received without further purification.Deionized water was used throughtout all experiments. N v -CN was prepared by calcining a freeze-dried mixture of DCDA and NH 4 Cl.Typically, 1 g DCDA and 5 g NH 4 Cl were added to 50 mL of water and stirred evenly.Then, the mixed solution was frozen at -4 C overnight, and dried in the vacuum freeze drier to obtain mixed white crystals.Finally, the white mixed crystal was heated to 550 C for 4 h at a rate of 3C/min under N 2 flow.In order to control the defect concentration, N v -CN with DCDA and NH 4 Cl ratios of 1:4 and 1:6 was prepared under the same conditions, and the corresponding samples were labeled N v -CN (1:4) and N v -CN (1:6).Further, for comparison, the block g-C 3 N (CN) was directly polymerized by DCDA under N 2 flow. MgAl-LDH was prepared by using glycine intercalation.First, prepare 60 mL aqueous solution containing Mg(NO 3 ) 2 6H 2 O and Al (NO 3 ) 3 9H 2 O (where Mg 2 Al 3 0.5 molL -1 , Mg/Al 3:1).Under the protection of the Ar atmosphere, 100 mL of glycine (0.5 molL -1 ) was added dropwise to the above solution, while the pH of the solution was maintained at about 10 with NaOH (2 molL -1 ).The mixed solution was aged for 12 h after being continuously stirred for 6 h.The aging solution was centrifuged at 12000 rpm to obtain a white precipitate.Then, the precipitate was washed with water and dried at 60 C overnight.Finally, the MgAl-LDH solution was obtained by exfoliation of glycine intercalated MgAl-LDH (Gly-MgAl LDH).Generally, 0.5 g of MgAl LDH intercalated with glycine was dispersed in 100 mL of water, and the pH was adjusted to 4 with HCl (0.1 mol/L).Subsequently, the MgAl LDH solution was obtained by stirring at room temperature for 24 h and centrifuging at 5000 rpm to remove the residue.The MgAl LDH solution was dried in a certain volume, and the concentration of MgAl LDH solution was calculated to be about 5 g/L by weighing the dried product. MgAl-LDO/N v -CN was prepared by in-situ deposition and topological calcination transformation method.Typically, 0.1 g of N v -CN was dispersed into 10 mL of water and sonicated for 30 min.Then, a certain amount (5, 10, 15 wt) of MgAl-LDH solution was added dropwise to the above solution.The mixture was continuously stirred at 80 C until it was dry, and the N v -CN in-situ deposition of MgAl LDH was realized.Finally, the dried product was heated to 400 C for 3 h at a rate of 5 C/ min in air, and the topological transformation from MgAl LDH to MgAl LDO was completed.The prepared product is labeled x MgAl LDO/N v -CN, where 5, 10, 15, corresponding to the mass ratio of MgAl LDO to N v -CN.Without the addition of MgAl LDH, N v -CN was calcined in air at 400 C for 3 h to obtain the re-calcined N v -CN (C-N v -CN). In order to compare the activity of photocatalytic reduction of CO 2 , MgO/N v -CN, Al2O 3 /N v -CN and MgO-Al 2 O 3 /N v -CN were prepared.Typically, 0.1 g N v -CN was ultrasonically dispersed in a quantitative Mg (NO 3 ) 2 solution for 30 min, and then stirred and dried at 80 C. Finally, MgO/N v -CN was obtained by calcining the sample at 400 C for 3 h in air.Instead of Mg(NO 3 ) 2 solution, with Al(NO 3 ) 3 solution or Al(NO 3 ) 3 and Mg(NO 3 ) 2 mixed solution, Al 2 O 3 /N v -CN and MgO-Al 2 O 3 /N v -CN samples were prepared.In addition, physically mixed 10 MgAl LDO/ N v -CN (M-MgAl LDO/N v -CN) was prepared by mixing MgAl LDO with N v -CN in a mass ratio of 1:10. In order to analyze the structure of the prepared sample, the Bruker D8 Advance X-ray diffractometer was used for XRD characterization with CuKa gamma rays ( 1.5406A) at 40 KV, and the CuKa ray scanning range was 10 to 80 .The Tecnai 12 transmission electron microscope (TEM) was used to study the microstructure of the sample.The X-ray photoelectron spectroscopy (XPS) of the prepared sample was measured by ESCA PHI500 spectrometer.The FT-IR spectra were performed on a Nicolet FT-IR spectrometer (Nexus), and the scanning range was selected to be 4000-400 cm -1 .Diffuse reflectance spectra were recorded using a UV-3600 Plus (Shimadzu) spectrophotometer with BaSO 4 as the background.The specific surface area and porosity analyzer (Micromeritics ASAP 2010 adsorber) was used to study the specific surface area and porosity of different samples.The TriStar II 3020 specific surface area and porosity analyzer (Micromeritics Instrument Corporation) was used to study the specific surface area and porosity of different samples.Photoluminescence (PL) spectra were performed on a Varian Cary Eclipse spectrometer with an excitation wavelength of 337 nm.Time-resolved photoluminescence spectra were obtained on Edinburgh FLSP920 fluorescence spectrometer. The Transient photocurrent analysis, Nyquist plots and Mott-Schotty plots were obtained on an electrochemical workstation (CHI 660B) with a standard three-electrode configuration.The typical working electrode preparation was as follows: 10 mg of powder sample and 5 mg of PVP are dispersed into a mixed solution of 1 mL of ethanol and 20 L of oleic acid, and then was ultrasonicated for 20 min to obtain a uniform suspension.Then, 40 L of suspension was deposited on the FTO glass substrate, and the coated area was 11 cm 2 .Finally, the coated FTO glass was dried at 80 C. The counter and the reference electrodes were Pt wire and Ag/AgCl, respectively.With 300 W Xe arc lamp ( 400 nm) as the light source, the photocurrent response was performed in 0.5 M Na 2 SO 4 solution.The Mott-Schottky plots was obtained in Impedance-Potential mode at fixed frequencies of 500, 800 and 1000 Hz.The potential range was from -1.6 to -0.6 V (vs Ag/AgCl), and the scan rate was 50 mV/s.Electrochemical impedance spectroscopy (EIS) was measured in 0.1 M KCl solution containing 5 mM Fe(CN) 6 3-/Fe(CN) 6 4-.EIS was measured in frequency range between 10 -2 and 10 -6 Hz at 0.3 V. The photocatalytic performance of the prepared catalyst was evaluated through a self-made photocatalytic reduction CO 2 system.The photocatalytic experiment of CO 2 reduction by H 2 O was carried out in a 280 mL double-necked Pyrex top-irradiation reactor.Typically, 30 mg of catalyst was suspended in 5 mL of deionized water by ultrasonic dispersion in the reactor, and then the reactor was placed in a vacuum oven at 80 C for drying.The catalyst was deposited on the bottom of the reactor to form a smooth film.Add 0.1 g of NaHCO 3 to the reactor tank, and then seal the two openings of the reactor with two rubber septums to form a closed reaction system.It was purged with nitrogen for 15 min, to ensure that in the anaerobic environment within the reactor.Before illumination, CO 2 and H 2 O vapor were generated by 0.1 mL H 2 SO 4 (2 molL -1 ) reacts with NaHCO 3 (injected before sealing) in the rector.A 300 W Xe arc lamp (NBeT Group Corp, China) and a 400 nm cut-off filter were used to simulate a visible light source.The reactor was positioned 10 cm below the simulated light source to participate in the photocatalytic reaction.In the photocatalysis process, gas products were extracted every hour.The gas products were detected by a gas chromatograph (CEAULIGHT GC-7920) equipped with a thermal conductivity detector (TCD) and a flame ionization detector (FID)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The 2D/2D MgAl LDO/N v -CN nanosheets were synthesized through a facile two-step strategy as depicted schematically in Fig. 1.Firstly, the nitrogen-deficient g-C 3 N 4 was obtained via the calcination of freezeddried mixture of DCDA and NH 4 Cl.In this process, g-C 3 N 4 nanosheets with different nitrogen defect concentrations were prepared through changing the adding amount of NH 4 Cl.For the synthesis of MgAl LDH nanosheet, Gly-MgAl LDH bulk was synthesized by co-precipitation reaction of Mg(NO 3 ) 2 6H 2 O and Al(NO 3 ) 3 9H 2 O precursor in the presence of NaOH and glycine.As shown in Figure S1, Gly-MgAl LDH shows peaks at 2 of 11.8 , 23.6 , 35.9 , 60.6 , and 62.4 , corresponding to (0 0 3), (0 0 6), (0 1 2), (1 1 0) and (1 1 3) planes of hexagonal MgAl LDH, respectively (JCPDS 35-0964) 60,61, indicating that MgAl-LDH with glycine interlayer was successfully prepared.Then, the resulting Gly-MgAl LDH bulk material was exfoliated into MgAl LDH nansheet with the assistance of hydrochloric acid.Secondly, the MgAl LDH nanosheets were deposited on the surface of N v -CN to form MgAl LDH/N v -CN 2D/ 2D heterojunction.Finally, the MgAl LDH/N v -CN was further calcined to form MgAl LDO/N v -CN.During the heating process, a portion of the Al 3 ions in MgAl LDO diffuses into the lattice of MgO, causing the neighbouring O 2-to become ligand-unsaturated Lewis basic sites, while the coordinately unsaturated Al 3 ions (Al 3 -O 2-pairs) are present as Lewis acid sites.In more detail, the H 2 O on the surface of the MgAl LDH is first released and then the LDH lamellar structure begin to collapse as the temperature continues to rise 62,63.In the collapse process, a portion of the Al 3 ions in MgAl LDH diffuses into the lattice of MgO, and replace the Mg 2 ions in MgO.However, since the Al ion is 3 valence ion, in order to maintain the equilibrium charge distribution, the O 2-adjacent to Al 3 becomes coordinatively unsaturated Lewis base sites, while the ligand-unsaturated Al 3 ion (Al 3 -O 2-pair) are present as Lewis acid sites 43,64.Meanwhile, as the ionic radius of Mg 2 is bigger than that of Al 3 , the MgO lattice containing substituted Al 3 ions will be larger, and this result suggests that the introduction of Al 3 into the amorphous magnesium oxide lattice will also produce active Mg-O species for CO 2 adsorption 65,66.According to literature analysis, the order of intensity of basic sites on the surface of MgAl LDO: low-coordination O 2-O in Mg 2 -O 2-pairs OH groups 67.Moreover, some Al ions will diffuse out of the octahedral brucite layer in the small amount of Gly-MgAl LDH that has not been completely stripped; this part of Al is located in the middle interlayer and will be coordinated to the three oxygen atoms of this layer and one top oxygen of this layer 68,69.It has been proposed that such a change would result in the previously occupied position of Al becoming vacant, inducing the production of three different Mg-O active species around it 70.These are the possible reasons for the formation and variation of LDO surface sites.The abundance of Lewis bases and acid sites on the surface of MgAl LDO/N v -CN nanosheets facilitates the activation of CO 2 adsorption and the adsorption/dissociation of H 2 O, thereby improving the performance of MgAl LDO/N v -CN photocatalytic CO 2 reduction. The microstructure of MgAl LDH, N v -CN, MgAl LDH/N v -CN and MgAl LDO/N v -CN was analyzed by TEM and high-resolution TEM (HR-TEM) measurements (Fig. 2).As depicted in Fig. 2a, MgAl LDHs exhibited a quasi-hexagonal sheet-like morphology with a lateral size of around 50 nm.From Fig. 2b, it can be seen that the surface of N v -CN is relatively smooth and has a typical amorphous two-dimensional nanosheet structure.The MgAl LDHs were deposited on N v -CN nanosheets to obtain MgAl LDH/N v -CN heterojunctions (Fig. 2c).After calcination of the MgAl LDH/N v -CN nanosheets, MgAl LDO/N v -CN consisting of irregularly shaped 2D nanosheets was formed (Fig. 2d).The MgAl LDO does not inherit the quasi-hexagonal morphology of MgAl LDH owing to the structural collapse during the calcination process (Figure S5j).The detailed microstructure of the MgAl LDO/N v -CN heterojunction can be further revealed by the HRTEM.As shown in Fig. 2e and Fig. 2f, the lattice fringes with an lattice spacing of 0.21 nm is assigned to the (2 2 0) crystal plane of the Mg(Al)O cubic phase 71, while the amorphous domain can be ascribed to the N v -CN due to its low crystallinity nature, indicating the formation of MgAl LDO/N v -CN heterojunction.This 2D/ 2D heterojunction with intact interface facilitates the transfer and separation of photogenerated charge carriers.In addition, the elemental composition and distribution of MgAl LDO can be further determined using HAADF-STEM and EDS elemental mapping (Fig. 2g).It can be observed that the C, N, Mg, Al and O elements are uniformly distributed, which indirectly indicates the successful combination of N v -CN and MgAl LDO. The crystal structures of different samples were analyzed by XRD.The XRD pattern of CN, N v -CN and x MgAl LDO/N v -CN were shown in Fig. 3a.All samples were observed with two characteristic peaks centered at about 13.1 and 27.3 .The broad peak centered at around 13.1 assigned to the (1 0 0) crystal planes of g-C 3 N 4 and was related to the repeating structure of the triazine unit in the plane of g-C 3 N 4 .The characteristic peak centered at 27.3 assigned to the (0 0 2) lattice plane of g-C 3 N 4 , which corresponds to the interlayer stacked structure in the g-C 3 N 4 conjugated aromatic system.Compared with CN, the (0 0 2) crystalline diffraction peaks of N v -CN and x MgAl LDO/N v -CN were broad and weak, and shifted towards small angles, which indicates the decrease in the number of layers and larger layer spacing.Interestingly, no diffraction peaks of MgAl LDO were detected in the x MgAl LDO/ N v -CN material, which might be attributed to the high dispersion of MgAl LDO.To further identify the elemental composition and surface chemical states of the samples, XPS analyses of the 10 MgAl LDO/N v -CN were shown in Fig. 3b-c.The survey XPS measurement spectrum (Figure S2a) reveals the existence of C, N, Mg, Al, and O elements, further indicating that successful introduction of MgAl LDO.As observed in C 1 s spectra of CN (Fig. 3b), the intensity of peak located at 288.1 eV, 286.2 eV and 284.9 eV were assigned to sp 2 -hybridized carbon (N-C N), sp 2 -bonded C atoms in the aromatic ring attached to the -NH x (x 1, 2) on the edges of tri-s-triazine units and sp 2 C-C aromatic bonds of graphitic carbon, respectively 49,72.Compared with CN, N v -CN exhibits a significant migration and an enhancement of peak intensity at 284.9 eV owing to the loss of lattice nitrogen and the formation of nitrogen vacancies in N v -CN 55.As the nitrogen defect produces a partial cyano group, which has a C1s binding energy similar to that of C-NH x , and there is also a significant migration and enhancement of the peak intensity at 286.2 eV in N v -CN 59.As shown in Fig. 3c, the N 1 s spectrum of CN can be fitted into four main peaks appearing at the binding energy of 404.4 eV, 401.2 eV, 399.9 eV and 398.9 eV, which are assigned to N atoms bonded with positive charge localization in heterocyclic amino groups (C -NH x ), charging effects or positive charge localization in heptazine rings, tertiary nitrogen (N-(C) 3 ) and sp 2 -hybridized nitrogen of aromatic triazine rings (C-N C), respectively 39,45.Compared with CN, a clear chemical shift of the N-(C) 3 bond can be observed in the N v -CN spectrum, indicating that the nitrogen defect is mainly located at the N-(C) 3 site 53.As compared with N v -CN, the 10 MgAl LDO/N v -CN binding showed a negative shift in the C 1 s and N 1 s spectra, which suggests a strong electronic interaction between N v -CN and MgAl LDO, contributing to charge separation during photocatalysis.Moreover, the XPS spectra of Mg, Al and O are shown in Figure S2.Among them, Figure S2b shows a stronger peak at 1303.7 eV, which corresponds to the Mg 1 s of MgO in MgAl LDO.As shown in Figure S2d, the O 1 s spectrum of MgAl LDO could be well deconvoluted into three peaks at 533.2 eV, 532 eV and 531.4 eV, which could be attributed to the Mg-O, lattice oxygen and oxygen-deficient/low coordination surface oxygen species of MgAl LDO, respectively 35,52.The above results further demonstrate that MgAl LDO/N v -CN was formed and the introduction of MgAl LDO had not destroyed the structure of N v -CN. The room temperature electron paramagnetic resonance (EPR) spectroscopy was used to further verify the presence of nitrogen defects.The EPR spectra of different samples all showed a single Lorentz line with g of 2.0021, indicating the presence of unpaired electrons on the aromatic ring carbon atoms within the nitrogen vacancy and -bonded nanoclusters in g-C 3 N 4 (Fig. 3d) 53,54.Normally, the bulk g-C 3 N 4 always has some structural disorder during thermal polymerization, causing unavoidable defects and leading to a weak signal in the EPR spectrum for bulk g-C 3 N 4 7273747576.Compared to CN, the EPR signal intensity of N v -CN is significantly enhanced with increase of NH 4 Cl feeding amount, indicative of the formation of abundant N v .These results may be due to the introduction of NH 4 Cl that acts as a sacrificial agent in the synthesis and inhibits the formation of the intact tri-striazine structure, resulting in a nitrogen defect in N v -CN 53,59.However, excessive nitrogen defects can become the main recombination center of excited electrons and holes in g-C 3 N 4 , which leads to deterioration of the photocatalytic activity.Furthermore, the signal intensity of the EPR spectrum of 10 MgAl LDO/N v -CN (1:5) was similar to that of the EPR spectrum of N v -CN (1:5), indicating that the introduction of MgAl LDO did not affect the nitrogen defect in N v -CN.Therefore, based on XPS and EPR results, it was confirmed that calcination of mixed crystals of NH 4 Cl and DCDA under N 2 resulted in the formation of more nitrogen defect in g-C 3 N 4 . One of the most important factors that determine photocatalytic activity is the light absorption and the transfer of photoexcited electrons capacity of the semiconductor.The optical properties of the samples were observed by measuring the UV-vis diffuse-refectance spectra (DRS) of the samples.As shown in Fig. 4a, the absorption band of CN appears in the visible light region, with the absorption band edge of CN is at around 450 nm.Furthermore, the absorption band edge of N v -CN was significantly redshifted compared to CN, with absorption band edge around 470 nm, which can be attributed to the relatively high nitrogen defect concentration 77.After the introduction of MgAl LDO on N v -CN, there was a slight blue-shift in the absorption edge of N v -CN.The Kubelka-Munk method was applied to derive the bandgap energy of the sample, and the results are shown in Fig. 4b.Compared with the band gap energy of CN (2.53 eV), the band gap energies of N v -CN and 10 MgAl LDO/N v -CN are 2.38 eV and 2.42 eV, respectively.The energy band positions of the samples were measured using Mott-Schottky plots.The N v -CN and 10 MgAl LDO/N v -CN showed positive slopes consistent with an N-type semiconductor (Figure S8) 55,56.In general, the conduction potential of an N-type semiconductor is approximated as equal to the flat-band potential, based on which the energy band structures of N v -CN and 10 MgAl LDO/N v -CN are analyzed in Figure S8.The flat band positions of N v -CN and 10 MgAl LDO/N v -CN were determined to be -0.81 and -0.84 eV vs RNE (Figure S8).It can be seen that 10 MgAl LDO/N v -CN (-0.84 eV) exhibits a larger negative conduction band than N v -CN (-0.81 eV), which implies that 10 MgAl LDO/N v -CN has a stronger CO 2 reduction capability. The separation of photogenerated electron-hole and transport rate of photogenerated carriers are among the important factors that determine the photocatalytic performance of semiconductors.Typically, photoluminescence (PL) spectroscopy was used to characterize the separation and migration efficiency of photogenerated electron-holes, due to the fact that PL emission arises from the recombination of electron-hole in the photocatalyst 57.As shown in Fig. 4c, CN has a strong emission peak around 470 nm, indicating that the bulk g-C 3 N 4 itself has the higher probability of electron-hole recombination 787980.However, N v -CN exhibits a lower PL intensity than CN due to the nitrogen defects will lead to the N v -CN formation of a midgap states that can trap photogenerated electrons and thus accelerate electron migration.Furthermore, the addition of MgAl LDO leads to a decrease in the PL intensity of N v -CN probably due to the effective charge transfer between MgAl LDO and N v -CN.The PL lifetime of photoexcited carriers in the sample was further investigated by time-resolved PL spectroscopy (Fig. 4d).The average PL lifetimes of photoexcited carriers for CN was 15.28 ns, while that of N v -CN was significantly shorter with a PL lifetime of 9.47 ns, which could be attributed to the transfer of excited electrons to adjacent nitrogen defects.The average PL lifetimes of photoexcited carriers of 10 MgAl LDO/N v -CN is 5.55 ns, which is shorter relative to the average PL lifetime of N v -CN, owing to the electron transfer from the excited N v -CN to the adjacent MgAl LDO interface.The shorter average lifetime of photoexcited carriers that indicates more electron and hole recombination is suppressed in N v -CN 76,77, which is favorable to improve the photocatalytic CO 2 reduction performance.The electron migration and transfer characteristics of MgAl LDO/N v -CN were further evaluated by electrochemical impedance spectroscopy (EIS) and transient photocurrent.Form the transient photocurrent diagram in Fig. 4e, the photocurrent intensity of N v -CN was significantly improved compared with CN, implying that introduction of nitrogen defects could promote the generation of photoinduced charge carrier.Meanwhile, the introduction of MgAl LDO in N v -CN nanosheets also enhanced the photocurrent intensity of N v -CN, which was attributed to the improved separation of electron-hole pairs by the interface interaction between MgAl LDO and N v -CN.Moreover, the EIS tests for CN, N v -CN and 10 MgAl LDO/N v -CN were performed as shown in Fig. 4f.A smaller arc radius means that the material has excellent electrical conductivity 81828384858687.The 10 MgAl LDO/N v -CN possesses the smallest charge transfer resistance than CN and N v -CN.In other words, this demonstrates the advantage of 10 MgAl LDO/N v -CN in promoting charge separation and transfer, while the charge being rapidly transferred to the surface can be involved in redox reactions, which is beneficial to improve the photocatalytic activity 57,88.In conclusion, the introduction of surface nitrogen defects and the interfacial structure between MgAl LDO and N v -CN facilitate rapid carrier transfer and inhibit the recombination of photogenerated electron-holes, thus improving the photocatalytic activity of the catalyst. The photocatalytic CO 2 reduction performance of the prepared samples was measured in a gas-solid phase photocatalytic CO 2 reduction system using H 2 O as a reducing agent without sacrificial agents.As shown in the Fig. 5, the main products of the sample photocatalytic CO reduction were CO.The time evolution curves for the conversion of CO to CO for different samples are shown in Fig. 5a, where the 10 MgAl LDO/N v -CN catalyst showed the best photocatalytic CO 2 reduction activity after 5 h photocatalytic reaction, with the yields of CO reaching 102.35 molg -1 .Interestingly, no products were found in the photocatalytic CO 2 reduction of MgAl LDO, due to the wide band gap of MgAl LDO.However, the CO 2 reduction activity of MgAl LDO/N v -CN decreased as increased of MgAl LDO feeding amount, perhaps attributed to the excess MgAl LDO hindering the migration of photogenerated electrons, resulting in a decrease in the CO 2 reduction performance of the samples.As shown in Fig. 5b, the rate of CO evolution was also increased with the increasing content of MgAl LDO in MgAl LDO/N v -CN, with the 10 MgAl LDO/N v -CN sample reaching the highest (20.47 molg -1 h -1 ), which was 6 times higher than that of CN (3.38 molg -1 h -1 ) and 3 times higher than that of N v -CN (5.71 molg -1 h -1 ).In contrast to CN and N v -CN, MgAl LDO/N v -CN produced some amount of CH 4 in addition to CO (Figure S9b).This may be related to the Lewis acidic sites on the surface of MgAl LDO, which were coordination unsaturated Al 3 cations and Al 3 -O 2-pairs formed by the diffusion of some Al 3 into the MgO lattice during the calcination of MgAl LDH.This Lewis acid sites were used as an adsorption and activation sites for H 2 O, as H 2 O can coordinate with it, thus promoting the oxidation half-reaction of H 2 O and providing sufficient protons for the reduction of CO 2 .The stability of the MgAl LDO/N v -CN heterojunction catalyst was evaluated by subjecting the catalyst to repeated tests under the same test conditions.As shown in Fig. 5c, the 10 MgAl LDO/N v -CN sample maintained good CO 2 conversion efficiency after four cycles, which indicated that MgAl LDO/N v -CN is a stable and efficient photocatalyst.Meanwhile, the XRD (Figure S4) and TEM images (Figure S5l) of the 10 MgAl LDO/N v -CN samples did not change significantly after four cycles, which also indicates that the 10 MgAl LDO/N v -CN has good stability.Furthermore, controlled experiments were carried out in the absence of catalyst or light, and no products were found in the controlled experiments, proving that light and a photocatalyst are necessary for the H 2 O photocatalytic reduction of CO 2 systems (Figure S9a).Meanwhile, no products were found in controlled experiments in the absence of CO 2 , H 2 O or the absence of both CO 2 and H 2 O, which proves that CO originate from the reduction of CO 2 and not from the type of carbon in the catalyst. To further investigate the origin of synergistic effects for Lewis acid and base sites on the surface MgAl LDO in CO 2 RR, the photocatalytic activity of MgO/ Based on thorough analysis of the above results, a possible reaction mechanism of the MgAl LDO/N v -CN photocatalytic CO 2 reduction was proposed and practically described in Fig. 6.In the photocatalytic system, CO 2 molecules first diffused onto the surface of MgAl LDO/N v -CN, and then, CO 2 molecules are adsorbed by Lewis base sites on the MgAl LDO surface in the form of chemisorption (Fig. 6).Simultaneously, the H 2 O molecules were adsorbed and activated to H 2 O (ad.) at the Lewis acidic sites of MgAl LDO.The N v -CN absorbs visible light and was excited to produce electron-hole pairs, and subsequently nitrogen defects on the surface capture excited-state electrons in the conduction band as a separation center, thereby accelerating the separation of photogenerated electron holes.Finally, photogenerated electrons were transferred from the nitrogen defect to the adsorbed CO 2 , (2) That is to say, the enhanced photocatalytic CO 2 reduction activity of MgAl LDO/N v -CN can be ascribed to the synergistic effect of the nitrogen defect of g-C 3 N 4 and the Lewis basic and acidic sites of MgAl LDO."
  },
  {
    "title": "Conclusions",
    "content": "In summary, we have prepared 2D/2D MgAl LDO/N v -CN heterojunction photocatalysts with abundant Lewis base/acid sites and nitrogen defects through in-situ deposition and subsequent calcination.The MgAl LDO surface has abundant Lewis acid-base sites such as O 2-, Mg 2 -O 2-pairs, OH -, Al 3 and Al 3 -O 2-pairs, of which the Lewis base sites (O 2-, Mg 2 -O 2-pairs, OH -) effectively enhance the adsorption of CO 2 by the catalyst, while the Lewis acid sites (Al 3 and Al 3 -O 2-pairs) enhance the adsorption/dissociation of H 2 O.Moreover, the presence of the nitrogen defect helps to expand the light absorption range of g-C 3 N 4 and promotes carrier separation to raise enough electrons for the reduction reaction.The 10 MgAl LDO/N v -CN sample has a CO evolution rate high up to 20.47 molg -1 h -1 , which was 6 times higher than that of CN (3.38 molg -1 h -1 ), and higher than that reported for the photocatalytic reduction of CO 2 most g-C 3 N 4 -based catalysts.It is proposed that defect engineering and surface modification of Lewis basic and acidic sites working in concert is an effective strategy to enhance photocatalytic activity of CO 2 reduction. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Fig. 1.Schematic illustration for preparation of MgAl LDO/N v -CN heterojunction. Fig. 2. TEM images of (a) MgAl LDH, (b) N v -CN, (c) MgAl LDH/N v -CN, and (d) 10 MgAl LDO/N v -CN; (e) and (f) HRTEM image of 10 MgAl LDO/N v -CN; (g) HAADF-STEM images and corresponding elemental mapping of 10 MgAl LDO/N v -CN photocatalyst. Fig. 3. (a) XRD patterns of the synthesized CN, N v -CN and x MgAl LDO/N v -CN; XPS survey spectra of as-prepared 10 MgAl LDO/N v -CN sample: (b) C 1 s spectrum, (c) N 1 s spectrum, (d) EPR spectra of CN, N v -CN (1:4), N v -CN (1:5), N v -CN (1:6) and 10 MgAl LDO/N v -CN (1:5). Fig. 4. (a) UV-Vis DRS spectra of the as-prepared samples; (b) UV-Vis DRS spectra corresponding Taus plots; (c) PL spectra and (d) Time-resolved transient PL decay of CN, N v -CN and 10 MgAl LDO/N v -CN; (e) Transient photocurrent response and (f) Electrochemical impedance spectra of CN, N v -CN and 10 MgAl LDO/N v -CN. LDH/N v -CN, M-MgAl LDO/N v -CN, 10 MgAl LDO/CN and C-N v -CN for CO 2 reduction was investigated under the same conditions (Fig.5d).The morphologies of MgO/N v -CN, Al 2 O 3 /N v -CN, MgO-Al 2 O 3 /N v -CN, 10 MgAl LDH/N v -CN, M-MgAl LDO/N v -CN, 10 MgAl LDO/CN and C-N v -CN were shown in FigureS2, similar to N v -CN nanosheets, which may be attributed to the low oxide loading.As shown in Fig.5d, the CO 2 reduction activity of Al 2 O 3 /N v -CN was significantly lower than that of N v -CN, indicating that Al-O bond were not the adsorption and activation sites for CO 2 .In contrast, MgO/N v -CN showed a high photocatalytic CO 2 reduction activity, demonstrating that MgO was the active sites for the CO 2 adsorption and activation.Meanwhile, the activity of MgO-Al 2 O 3 / N v -CN was slightly lower than that of MgO/N v -CN, further demonstrating that Al-O bond was unfavorable for photocatalytic CO 2 reduction.The activity of MgAl LDO/N v -CN was much higher than that of MgO/N v -CN, which may be related to the synergistic effect of MgO and Al 2 O 3 in MgAl LDO.In particular, the low-coordinated O 2-in Mg-O can promote the adsorption and activation of CO 2 , and the coordinated unsaturated AI 3 can promote the adsorption and dissociation of H 2 O, while this effect is only present in MgAl LDO and not in the mixed oxides of MgO and Al 2 O 3 .To understand the relationship between MgAl LDO and N v -CN, the CO 2 reduction activities of 10 MgAl LDH/N v -CN, 10 MgAl LDO/CN and physically mixed MgAl LDO and N v -CN (M-MgAl LDO/N v -CN) were compared under the same conditions.The MgAl LDH/N v -CN exhibited a higher activity than N v -CN, which may be due to the formation of a heterojunction structure between MgAl LDH and N v -CN.The M-MgAl LDO/N v -CN was much less active than N v -CN, suggesting that a tight contact between MgAl LDO and N v -CN must exist to achieve efficient CO 2 reduction.Compared with CN, the CO 2 reduction activity of 10 MgAl LDO/CN was increased, which was caused by the enhanced CO 2 adsorption from the surface Lewis base of MgAl LDO.However, the CO 2 reduction activity of 10 MgAl LDO/CN was much lower than that of 10 MgAl LDO/N v -CN, probably because MgAl LDO is an adsorption site rather than a catalytic site for the CO 2 reduction reaction.Therefore, it is hypothesized that the enhanced MgAl LDO/N v -CN activity should result from the multiple synergistic effects of the nitrogen defect and MgAl LDO.Furthermore, C-N v -CN was obtained without the addition of MgAl LDH during the synthesis of MgAl LDO/N v -CN, and the activity of C-N v -CN for the reduction of CO 2 did not change significantly compared to that of N v -CN, indicating that the synergistic effect of MgAl LDO and nitrogen defects in MgAl LDO/N v -CN is the main factor causing the increased activity of N v -CN. Fig. 5. (a) Evolution of CO over MgAl LDO, N v -CN, and x MgAl LDO/N v -CN photocatalysts; (b) Photocatalytic CO production rate over MgAl LDO, CN, N v -CN, and x MgAl LDO/N v -CN photocatalysts under visible-light irradiation for 5 h; (c) Stability tests of CO production rate over 10 MgAl LDO/N v -CN photocatalysts; (d) Comparison of CO production rate of different samples. Song: Methodology, Investigation, Visualization, Writing -original draft.Yimeng Zhou: Methodology, Investigation, Data curation.Jiahui Hu: Methodology, Investigation, Formal analysis.Changjian Zhou: Resources, Methodology.Xiangli Shi: Resources, Investigation.Di Li: Investigation, Supervision.Deli Jiang: Conceptualization, Validation, Funding acquisition, Writing -review editing, Supervision. Fig. 6.A possible mechanism of 10 MgAl LDO/N v -CN for photocatalytic CO 2 reduction. This work was supported by the financial supports of National Natural Science Foundation of China (21878130), China Postdoctoral Science Foundation (2018 M642180). Supplementary data to this article can be found online at https://doi. org/10.1016/j.apsusc.2021.150369."
  }
]