[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2020.118810"
  },
  {
    "title": "Article_Title",
    "content": "Ultra-fast construction of plaque-like Li2TiO3/TiO2 heterostructure for efficient gas-solid phase CO2 photoreduction"
  },
  {
    "title": "Abstract",
    "content": "Exploring a facile and universal strategy to fabricate an efficient heterostructure is a big challenge for achieving highly active and selective CO 2 photoreduction.Herein, a plaque-like Li 2 TiO 3 /TiO 2 heterostructure was in-situ constructed by the gradual intercalation of Li ions into the lattice of TiO 2 from the outside and eventually formed the Li 2 TiO 3 phase on the surface of TiO 2 in an ultra-high temperature about 2000 K within several milliseconds.This novel structure has a significant improvement in the adsorption capacity of CO 2 and reduction of the oxygen defect trap by introduction of Li species.Furthermore, owing to the built-in electric field directed from Li 2 TiO 3 to TiO 2 , electrons are forced to move to the oxygen atom sites in Li 2 TiO 3 , which helps the plaque-like Li 2 TiO 3 /TiO 2 heterostructure photocatalyst achieve nearly 3 times performance improvement with about 100 selectivity towards CO.Theoretically and experimentally, we proposed a possible catalytic behavior and mechanism that Li 2 TiO 3 /TiO 2 heterostructure will choose a shorter pathway through intermediate formate conversion to CO, as the free energy reduce by 26.53 from 0.98 eV to 0.72 eV.This work gives a new insight for constructing heterostructure in an ultra-fast reaction process, and provides a rational reference for developing highly efficient photocatalysts towards CO 2 reduction."
  },
  {
    "title": "Experimental",
    "content": "The catalysts in this work were prepared by flame spray pyrolysis (FSP) method.Briefly, the tetrabutyl titanate (TBT) and the lithium acetate (1.5 wt Li species) was dissolved in 100 mL of ethanol to obtain a uniform precursor solution at a concentration of 0.5 M. With the aid of the syringe pump, the precursor solution reached the tip of the nozzle at a flow rate of 5 mL min -1 , and then, the precursor solution was rapidly dissipated into a micron-sized mist droplet cutting by a high-speed O 2 airflow.Meanwhile, the atomized precursor droplets were ignited with the circular H 2 /O 2 diff ;usion flame, wherein the flow rates of H 2 and auxiliary air were controlled at 380 L h -1 and 1.0 m 3 h -1 , respectively.The resulting powder was collected by glass fiber, and the remaining conditions were consistent with the above experiments. The Li 2 TiO 3 /TiO 2 heterostructure was directly observed by the transmission electron microscopy (TEM, JEM-2100) and high-resolution transmission electron microscopy (HR-TEM, Tecnai G2 F20 S-Twin (FEI)).The lattice structure and the change in phase ratio were characterized by X-ray diff ;raction (XRD, Bruker D8 Avance) with Cu-K filament that X-ray wavelength of 1.5406 A.The chemical state of Titanium (Ti 2p), Oxygen (O 1s) and Lithium (Li 1s) were further confirmed by the X-ray photoelectron spectroscopy (XPS, Thermo ESCALAB 250 X-ray photoelectron spectrometer, equipped with an Al K source (1486.6 eV)).The binding energies were calibrated at the C 1s peak of 284.8 eV.Electron paramagnetic resonance (EPR, Bruker EMX-8/2.7 spectrometer operating at about 9.8 GHz.) test was carried out at 25 C to obtain the information of the low-valent Ti species on catalyst surface.The UV-vis diffuse reflectance spectra (UV-vis DRS, U-3900H Spectrophotometer) of the samples were acquired within the wavelength range of 200-800 nm.Raman spectroscopy (LabRAM HR Evolution) was used to analyze the effects of the optical properties, and ensure that there are no residual carbon species on the sample surface.The adsorption capacity of CO 2 of the samples were obtained by CO 2 adsorption-desorption isotherms at room temperature (RT) with a Micromeritics TriStar II 3flex system.Prior to the measurements, the samples were degassed at 120 C for 12 h.The temperature-programmed CO 2 desorption (CO 2 -TPD) was performed at Micromeritics AutoChem II 2920 system.The catalyst (100 mg) was firstly washed with Ar at 350 C for 2 h, then cooled to RT, following that the CO 2 (10 vol CO 2 /Ar) gas was introduced for adsorption at a flow rate of 30 mL min -1 for 2 h and then flushed with Ar at a flow rate of 30 mL min -1 for 30 min to remove weakly adsorbed CO 2 , and then it was heated from RT to 650 C at a rate of 10 C min -1 .The TPD spectra were recorded by the response of thermal conductivity detector.The insitu diffuse reflectance infrared Fourier transform spectroscopy (in-situ DRIFTS) was obtained on the spectrometer (Tensor II FT-IR, Bruker) equipped with a reaction chamber."
  },
  {
    "title": "Results_and_Discussion",
    "content": "3.1.Synthesis and characterizations of plaque-like Li 2 TiO 3 /TiO 2 heterostructure Fig. 1a and b correspond to TEM and HR-TEM images of plaque-like Li 2 TiO 3 /TiO 2 heterostructure catalyst, respectively.TEM image shows that the particle distribution of the nanoparticles is uniform with the size of about 20-30 nm.Moreover, HR-TEM image shows that the single nanoparticle is composed of the main body of TiO 2 and some plaque-like protrusions, which is circled with the pink dotted line.Furthermore, we zoom in on the dotted square part in military blue, and the locally enlarged HR-TEM of heterostructure region is located in Fig. 1c.As can be seen from the image, two separated phases are clearly circle in yellow and in pink, respectively.Particularly, the lattice fringe spacing of 0.207 nm in region 1 is ascribed to the (202) crystal plane of Li 2 TiO 3 .While the lattice fringe spacing of 0.351 nm in region 3 is ascribed to the (101) crystal plane of TiO 2 .Notably, an 1-2 nm heterojunction is figured out between those two phases, which is the direct evidence for forming Li 2 TiO 3 /TiO 2 heterostructure.This result can be supported by the selected area FFT pattern in region 2 showing an amorphous structure.Besides, the enrichment of the Li element on the surface of nanoparticles by the ICP results in Table S1, the lattice distortion of the heterojunction cross section in Fig. S1 and the mismatched lattice spacing in Fig. S2 also prove the successful construction of the plaque-like heterostructure.As a contrast, the pure TiO 2 and overdosed Li species are shown in Fig. S3.In the previous work of our group, the dynamic process of nanoparticle formation in the flame field was deeply researched by Hu et al. 23 According to this guidance, it can be inferred that the TiO 2 particles will preferentially nucleate due to the difference in decomposition temperature, followed by the intercalation of Li ions into the lattice of the TiO 2 nanoparticles and finally formed the Li 2 TiO 3 phase on the surface of the TiO 2 .The entire reaction process just takes place within milliseconds.This growth behavior of plaque-like Li 2 TiO 3 /TiO 2 nanoparticles by FSP is clearly illustrated in Fig. 1d, which can be divided into 5 stages: (1) hydrolysis of TBT; (2) nucleation of TiO 2 ; (3) thermal decomposition of lithium acetate; (4) intercalation of Li ions; and (5) formation plaque-like Li 2 TiO 3 /TiO 2 heterostructure. In order to further determine the lattice structure of the as-prepared sample, the results of XRD are shown in Fig. 2. Obviously, the strongest peaks of anatase (JCPDS: 04-0477) and rutile (JCPDS: 04-0551) located at 25.35and 27.46correspond to the respective (101) and (110) crystal planes.Those characteristic peaks are observed in all as-prepared samples, indicating that the TiO 2 prepared by FSP possesses a mixed phase structure.Importantly, as the content of Li species increase from 0 to 5 wt, the composition of the anatase and rutile phases change significantly.The detailed variation data are listed in Table S2.Furthermore, the locally enlarged patterns indicate that the peak at 18.47in region I is ascribed to the (002) crystal plane of Li 2 TiO 3 , and the peak at 43.58in region II is ascribed to the (-133) crystal plane of Li 2 TiO 3. Besides, a slight increase of diffraction angle 0.08can be observed, which indicates the Li species do reduce the lattice spacing of TiO 2 .Moreover, those two peaks are gradually obvious with the increase of Li species content shown in Fig. S4.The results of XRD patterns show that the introduction of Li species not only promote the crystal phase transfer from anatase phase to rutile phase, but also form a coating layer of Li 2 TiO 3 on the surface of TiO 2 in combination with TEM images.Notably, the state of the coating, plaque-like shape or complete cover, is related to the introduction content of Li species. The XPS characterization was used to obtain information on the surface of the sample to clarify the compositional results of the element species in the sample as shown in Fig. 3. Fig. 3a shows the deconvolution of the Ti 2p XPS spectra for the pure TiO 2 and plaque-like Li 2 TiO 3 /TiO 2 heterostructure.For the pure TiO 2 , the binding energy at the position of 458.8 eV corresponds to Ti 4 2p 3/2 , and the binding energy at the position of 464.6 eV corresponds to Ti 4 2p 1/2 24.However, the Ti 2p 3/2 and Ti 2p 1/2 peaks in Li 2 TiO 3 /TiO 2 exhibit attractive negative shift of 0.2 eV with respect to that of the TiO 2 , which indicates that after the introduction of Li species, the original state of the electron cloud for Ti 2p orbit is changed, and the electron tends to flow around the Ti species, which is apparently reduced in binding energy 25.In addition, it is observed in both sets of samples that a smaller shoulder peak belonging to Ti 2p 3/2 appears at a binding energy of 460.2 eV, which corresponds to a non-stoichiometric TiO x 26.And the relative ratio of peak integral area in Li 2 TiO 3 /TiO 2 increased slightly compared with TiO 2 , indicating that Li species can also affect the valence state ratio of Ti species.The enlarged TiO x area is shown in Fig. S5 and the detailed peak parameters are listed in Table S3.Fig. 3b shows the deconvolution of the O 1s XPS spectra, from which similar changes in Ti 2p spectra can be observed.The peak at 530.2 eV corresponds to the TieO bond in the lattice structure.It can be found that Li species is resulting in the binding energy moving towards the low energy for about 0.15 eV, indicating that the lattice O atoms in the TiO 2 will get electrons from nearby.In addition, there is a shoulder peak near the main peak at around 531.6 eV, which corresponds to the oxygen interaction with Li 25 and the adsorbed oxygen hydroxyl species 27,28 on the surface of TiO 2 .Comparatively, it is not difficult to find that the peak integral area of Li 2 TiO 3 /TiO 2 is much larger, which is mainly the result of the synergistic effect of Li species on the catalyst surface, that is, the signal of oxygen interaction with Li will occupy part of the peak area.On the other hand, the modification of the surface of the catalyst by Li species can induce more adsorption sites of oxygen hydroxyl species, which together show a stronger signal peak.Intuitively, Li 1 s XPS spectra is shown in Fig. 3c.Clearly, the Li 2 TiO 3 / TiO 2 sample shows a broad peak at a binding energy of 54.9 eV, which is a characteristic peak of Li species 29, indicating that Li was successfully introduced into the surface of TiO 2 , and the characterization results are consistent to the TEM and XRD analysis mentioned above.Notably, information about Ti 3 s can also be observed in the spectrum.Literature indicates that the peak in the 51.5 eV-61.0eV interval represents the presence of Ti 3 , while the peak around 62.1 eV represents the presence of Ti 4 24.It can be seen from the spectra that the peak shape of Li 2 TiO 3 /TiO 2 is wider than that of TiO 2 as well as closer to the low energy region, indicating that the Li 2 TiO 3 /TiO 2 possesses a higher ratio of Ti 3 .This conclusion is consistent with the TiO x content analysis in Fig. 3a.More specifically, the content of low-valent Ti species in xLi-TiO 2 samples was explored by means of EPR.The results are shown in Fig. 3d.The position of g 1.98 can provide information on the content of Ti 3 ions 30.Both the samples have a fluctuating signal peak, indicating that there are Ti 3 ions in both, but the signal peak of Li 2 TiO 3 /TiO 2 is more intense to a certain extent.Again, this demonstrates that Li species can induce the formation of low-valent Ti 3 species.The formation of Ti 3 species will help the electrons avoid falling into the trap states or electronic defects that originate from oxygen vacancies (V o ) within the TiO 2 lattice 31.Accordingly, one of the reasons for the improved performance of the Li 2 TiO 3 /TiO 2 catalyst is that the new structure facilitates the passivation of the electron trap, thereby increasing the mean free path of the semiconductor carriers.The overall element information can be obtained from full spectra of XPS in Fig. S5. In order to further clarify the influence of Li species on the photochemical process of Li 2 TiO 3 /TiO 2 photocatalyst, this research work carried out various photochemical measurements by means of electrochemical workstation, and the characterization results are shown in Fig. 4. Fig. 4a shows UV-vis DRS for the as-prepared TiO 2 and Li 2 TiO 3 / TiO 2 samples.The Li 2 TiO 3 /TiO 2 sample has a broader spectral absorption range, and apparently the absorption in the 400 nm-800 nm band has a macroscopic improvement, indicating that Li species can improve the visible light capturing ability on the surface of TiO 2 , that is, it is more efficient for the utility of the full spectrum of sunlight.According to the references 32, the two curves can be respectively tangent-treated.As shown in the figure, the intersection of the two tangent lines with the x-axis is 403.7 nm and 431.73 nm, respectively.Combined with the photoelectric effect equation, the band gap energy of TiO 2 can be approximately calculated to be 2.87 eV, while the band gap energy of Li 2 TiO 3 /TiO 2 is 2.74 eV.The reduction of the band gap energy will facilitate the efficient separation and transfer of electrons and holes in the intrinsic TiO 2 .Fig. 4b shows the transient photocurrent responses.The Li 2 TiO 3 /TiO 2 has a fast and variable photocurrent response relative to TiO 2 , indicating that the Li 2 TiO 3 /TiO 2 heterostructure has a more efficient electron-hole pairs separation and resistance to recombination.This result is attributed to the excellent electrical conductivity of the plaque-like Li 2 TiO 3 formed on the surface, which is favorable for electron transport and enrichment.Similar test results can also be observed in the Nyquist plots of electrochemical impedance spectra (EIS) shown in Fig. 4c.As can be seen from the comparison, Li 2 TiO 3 /TiO 2 , the material pictured by the red dot has a smaller fitting radius, which indicate that it has a smaller internal resistance.Specifically, the approximate resistance value inside the material can be derived by simulating the circuit diagram.The optimized circuit diagram model and the calculation result have been embedded as part of the main diagram.The results show that the internal resistance of the original material is reduced by 39.89 after Li modification.In the foregoing, the optical method has been used to determine the band gap energy of the catalyst shown in Fig. 4a.To further understand the type of semiconductor catalyst and the band structure characteristics, this work characterizes the Mott-Schottky plots of the TiO 2 and the Li 2 TiO 3 /TiO 2 samples at different frequencies, as shown in Fig. 4d.The results show that both have positive slopes, indicating that they are all typical n-type semiconductors 33.The flat band potential can be estimated by the Mott-Schottky curve, that is, the intersection of the tangent of the curve obtained under the three test frequencies and the x-axis, -0.495 and -0.896 V versus the saturated Ag/AgCl reference electrode for the TiO 2 and the Li 2 TiO 3 /TiO 2 , respectively.Nevertheless, it is well recognized that the conduction band potential (CB) for n-type semiconductors is more negative by 0.2 V than that of the flat band potential 34,35.Thus, the CB potentials of samples TiO 2 and the Li 2 TiO 3 /TiO 2 were referred to be -0.695 and -1.096 V vs. Ag/AgCl, respectively.According to the equation E NHE E Ag/AgCl 0.212 (where E NHE is the potential vs. NHE and E Ag/AgCl is the measured potential vs. Ag/AgCl.),the obtained potentials could be converted to the normal hydrogen electrode (NHE) scale, -0.483 and -0.884 V for the TiO 2 and the Li 2 TiO 3 /TiO 2 vs. NHE, respectively 36.Combined with the band gap energy obtained in Fig. 4a, the valence band (VB) of the TiO 2 can be calculated to be 2.387 V and the VB of the Li 2 TiO 3 /TiO 2 was 1.856 V. Fig. 5a exhibits the CO generation rates for the pure TiO 2 and Li 2 TiO 3 /TiO 2 samples.As shown, the lowest photocatalytic activity is attributed to the pure TiO 2 , and the average conversion efficiency is only 0.6157 mol g -1 h -1 .With the increasing amount of Li introduction, the average conversion efficiency gradually increased from 0.9388 mol g -1 h -1 to the optimal 1.7358 mol g -1 h -1 , and the CO 2 photoreduction performance of Li 2 TiO 3 /TiO 2 increased nearly three times.Then, the performance begins to decrease as the introduction of Li further increases.Eventually, the entire histogram exhibits a volcanic change trend of catalytic performance.Li 2 TiO 3 /TiO 2 possesses a narrower band gap, which means that the electrons will be more easily separated from the holes and transition to a higher energy, the activated valence band.Furthermore, the more negative potential makes it more excellent in reducing, which also clarify why such a Li 2 TiO 3 /TiO 2 heterostructure can generally improve the performance of CO 2 photoreduction.Notably, from 0.5 wt to 1.0 wt Li species introduction, the catalytic performance did not increase but decrease.We speculate that this is because the part of CO produced by 1.0 wt Li species will continue to be converted into CH 4 , and this rate will exceed the CO generation rate in a short time, which is illustrated in Fig. S6.Similarly, this can also be the reason to illustrate why the photocatalytic performance of the catalysts 2.0 wt and 5.0 wt Li species are not decreased greatly.What is more, Fig. 5b shows the optimal catalyst obtained in this work has achieved a high selectivity compared with other recently reported highly selective literatures.On the one hand, the selectivity of the plaque-like Li 2 TiO 3 /TiO 2 heterostructure for CO 2 reduction is about 100 that means the photogenerated electrons almost all obtained by CO 2 , and the reduction of H ions in water is suppressed.On the other hand, the methane content was barely monitored, indicating that the selectivity of CO is close to 100 .The specific calculation process and selectivity values are listed in detail in Table S4. In the previous discussion, the work concluded that the formation of Ti 3 passivated the electron trap is one of the reasons for the performance improvement of plaque-like Li 2 TiO 3 /TiO 2 catalyst.Besides, CO 2 is one of the key factors to improve the catalytic activity.In this paper, the adsorption capacity of different kinds of catalyst surfaces for CO 2 molecules was carried out by CO 2 adsorption-desorption isotherms at RT.The experimental results in Fig. 6a clearly reveal that Li 2 TiO 3 /TiO 2 has a better CO 2 adsorption capacity than pure TiO 2 , and this is consistent with common sense.The results of CO 2 -TPD experiments shown in Fig. 6b show that the adsorption capacity of Li 2 TiO 3 /TiO 2 catalyst for CO 2 is generally improved, which can be judged from the comparison of peak area.On the other hand, the increase in CO 2 adsorption capacity of Li 2 TiO 3 /TiO 2 material by Li species is mainly reflected in the weak alkaline site and the moderately basic site , and almost no change is observed in the strong basic site 37,38.Fig. S7 shows the establish model 1 (M1) by using the (101) crystal plane of the main part of the anatase phase as the entry point.When the system reaches the final stable state, the CO 2 adsorption energy is -0.27 eV in M1.On the other hand, Li 2 TiO 3 has a much higher CO 2 adsorption energy -1.29 eV shown in the Fig. S8, the model 2 (M2) of Li 2 TiO 3 structure obtained from the results of DFT calculation.Hence, both theoretical calculations and experimental results have proved that the increase in CO 2 adsorption capacity of Li 2 TiO 3 /TiO 2 heterostructure is another important factor affecting the performance improvement of apparent photoreduction CO 2 . Fig. 7 shows a deep explanation on the structure formation mechanism based on computationally simulated Li 2 TiO 3 /TiO 2 heterostructures.Fig. 7a shows a heterojunction model consisting the (101) crystal plane of TiO 2 and the (-112) crystal plane of Li 2 TiO 3 .Fig. 7b shows the total density of states (TDOS) of Li 2 TiO 3 /TiO 2 heterostructure and the pure TiO 2 .The results show that the valence band position of pure TiO 2 is -0.66 eV, and the conduction band is at 1.24 eV, so the band gap is 1.90 eV.After the introduction of Li 2 TiO 3 , the valence band and the conduction band positions are shifted to the right, at 1.03 eV and 1.47 eV, respectively, as well as the band gap is reduced to 0.44 eV.This result is in good agreement with the trend of the results obtained from Fig. 4a andd In order to explore the reaction mechanism, the diffuse reflectance infrared Fourier transform spectroscopy (DRIFTS) technique was adopted as a research tool.Firstly, in the adsorption stage shown in Fig. 8a-b, the absorption peak of water (1640 cm -1 ) starts to decrease in the process of adsorbing and activating water molecules by the pure TiO 2 for about 1 h, while the Li 2 TiO 3 /TiO 2 sample had a significant downward absorption peak at 10 min, which indicates the Li 2 TiO 3 /TiO 2 TiO 2 is more conducive to the activation and conversion of the reactant water molecules.As the adsorption time increases, pure TiO 2 exhibits the chelated bicarbonate (HCO 3 -, 1435 cm -1 ) and the monodentate carbonate (m-CO 3 2-, 1310 cm -1 ), while the Li 2 TiO 3 /TiO 2 sample, the obvious blue shift of the chelated bicarbonate (HCO 3 -, 1452 cm -1 ) and the monodentate carbonate (m-CO 3 2-, 1336 cm -1 ) occurred and showed a stronger peak signal, indicating that the stable combination of the intermediate species on the surface of Li 2 TiO 3 /TiO 2 .In addition, the formation of the formate species (HCOO-, 1537 cm -1 ) is also detected 3940414243.These results all indicate that the introduction of Li 2 TiO 3 is attributed to increase in the conversion of reactant water molecules as well as the intermediate formate, bicarbonates, and carbonates species on the catalyst surface to a more stable state.From the analysis in the adsorption stage, it can be preliminarily judged that the Li 2 TiO 3 /TiO 2 heterostructure had better CO 2 conversion efficiency.Secondly, during radiation, minor changes were observed in the amidst the peak positions.It is not difficult to find that under the condition of illumination shown in Fig. 8c-d, obvious peaks of CO 2 -(1287 cm -1 and 1300 cm -1 ) start to appear in both TiO 2 and Li 2 TiO 3 /TiO 2 and the difference is that the signal in the latter is stronger 40, which indicates that CO 2 can acquire electrons more rapidly on the surface of plaque-like Li 2 TiO 3 structure.Notably, the formation of CO 2 -is a critical step in determining whether a subsequent reaction can proceed quickly.In general, the Li 2 TiO 3 /TiO 2 is blue-shifted from the peak position of pure TiO 2 , indicating the efficient conversion and accumulation of different intermediates such as the formate, bicarbonate and carbonate on the surface.In addition, it is known that water plays an important role in the CO 2 photoreduction process.During the experiment, with the increase of illumination time, the H 2 O (1665 cm -1 ) produced by the Finally, CO 3 2-combines two H with two e-and simultaneously desorbs two OH-to produce CO.Intuitively, the conversion process of the first pathway is relatively easy to happen.Comparing the peak position and the curve shape of the two groups of catalysts after illumination, the Li 2 TiO 3 /TiO 2 sample will experience both pathways at the same time.However, in combination with the strong HCOO-signals appearing at 1548 cm -1 in Fig. 8d, it is speculated that the catalyst is more prone to experience path (I).On the other hand, from the comparation of the 1622 cm -1 peak attributed to the bidentate carbonate (b-CO 3 2-), it can be seen that the pure TiO 2 is more inclined to experience the longer pathway of the path (II).The results of comprehensive analysis show In order to verify whether the energy barrier of path (I) can be lower and quantitatively understand the reason for doubling the performance of the Li 2 TiO 3 /TiO 2 heterostructure catalyst.We calculated the free energy of the transition state based on the assumption of the catalytic mechanism proposed in in-situ DRIFT.The results are shown in Fig. 9 and the optimized supercell are shown in Fig. S9.From the calculation results of the free energy of intermediates, the energy converted to formate is much lower than that conversion to bicarbonate, and the energy is reduced by 26.53 from 0.98 eV to 0.72 eV, indicating path (I) has a lower energy barrier compared with path (II).The lower necessity of energy input and the simple reaction process endow the Li 2 TiO 3 /TiO 2 heterostructure a doubling performance enhancement in CO 2 photoreduction.The theoretical simulation verifies the correctness of the conjecture obtained from the experimental results.Hence, the catalyst behavior and mechanism of the novel plaque-like Li 2 TiO 3 /TiO 2 heterostructure catalyst have been scientifically verified from both perspectives of experiment and theoretical simulation."
  },
  {
    "title": "Conclusions",
    "content": "In summary, a novel Li 2 TiO 3 /TiO 2 heterostructure was prepared in an ultra-fast reaction process by the gradual intercalation of Li ions into the lattice of TiO 2 from the outside and eventually formed the Li 2 TiO 3 phase on the surface of TiO 2 in an ultra-high temperature about 2000 K Fig. 1.(a) TEM images, (b) HR-TEM images of plaque-like Li 2 TiO 3 /TiO 2 heterostructure, and (c) locally enlarged HR-TEM of heterostructure regions.Schematic illustration of (d) the synthesis process and the growth behavior of plaque-like Li 2 TiO 3 /TiO 2 heterostructure by FSP. Fig. 2. XRD patterns of plaque-like Li 2 TiO 3 /TiO 2 heterostructure compared with pure TiO 2 samples. Fig. 3. XPS spectra of (a) Ti 2p, (b) O 1s and (c) Li 1s for the pure TiO 2 and the plaque-like Li 2 TiO 3 /TiO 2 heterostructure samples.(d) EPR spectra of the pure TiO 2 and plaque-like Li 2 TiO 3 /TiO 2 heterostructure catalysts. Fig. 4. (a) UV-vis diff ;use reflectance spectra with Tauc plots, (b) the transient photocurrent responses, (c) the Nyquist plots of electrochemical impedance spectra (EIS) spectra and the inset exhibits results from equivalent circuit fitting the Nyquist plots.(d) the Mott-Schottky curves for estimating CB potentials of the pure TiO 2 and the plaque-like Li 2 TiO 3 /TiO 2 catalysts. . Fig. 7c shows the electron localization function (ELF) of the Li 2 TiO 3 /TiO 2 heterostructure.It can be seen from the figure that the inner Li atoms in the Li 2 TiO 3 phase will enter the lattice of TiO 2 , and the color change between Li atoms and Ti atoms indicates that Li may form a strong chemical bond with Ti atoms of TiO 2 in the heterojunction region.In addition, Fig. 7d shows a charge density diff ;erence of the Li 2 TiO 3 /TiO 2 heterostructure, where the blue electron cloud represents electrons accumulation and the yellow electron cloud represents electron depletion.It is not difficult to find from the figure that when Li 2 TiO 3 and TiO 2 form a heterostructure, the O atoms in Li 2 TiO 3 and Ti atoms in TiO 2 have strong chemical action, and the effect is derived from the Ti atoms in TiO 2 to give electrons to the O Fig. 5. (a) Comparison of the CO generation rates for the pure TiO 2 and plaque-like Li 2 TiO 3 /TiO 2 heterostructure samples during 4 h CO 2 photoreduction with water vapor under full spectrum light irradiation, and (b) the selectivity of the catalyst obtained in this work compared with the recently reported highly selective literatures. Fig. 6.(a) CO 2 adsorption curves and (b) CO 2 -TPD of the pure TiO 2 and the plaque-like Li 2 TiO 3 /TiO 2 heterostructure catalysts at RT. TiO 2 sample weakens, indicating that Li 2 TiO 3 /TiO 2 is more favorable for the conversion of reactant water into active radicals and thus enhances photocatalytic activity.Combined with the above in-situ DRFITS and related characterization analysis, the possible reaction pathways for this work are listed in Fig.8e.Briefly, the approximate pathway is divided into two categories: (I) CO 2 -is combined with one H and e-to be converted into a formate intermediate, and then one molecule of water is removed to convert to CO; (II) CO 2 -is combined with one OH and converted into HCO 3 -, and then converted to CO 3 2-. Fig. 7. (a) Calculation model of Li 2 TiO 3 /TiO 2 heterostructure.The pink ball represents the Li atom; the blue ball represents the Ti atom; and the red ball represents the O atom.(b) Calculated total density of states (TDOS) for Li 2 TiO 3 /TiO 2 heterostructure and pure TiO 2 .(c) Electron localization function (ELF) of Li 2 TiO 3 constructed on the TiO 2 and (d) charge density diff ;erence of Li 2 TiO 3 /TiO 2 heterostructure.Electrons accumulation is in blue and depletion in yellow, respectively.The isosurfaces are set to 0.005eVA -3 (To explain the colors in this figure legend, the reader is referred to the web version.). Fig. 8. In-situ DRIFT spectra of surface adsorbed species and photocatalytic CO 2 reduction intermediates over the pure TiO 2 and plaque-like Li 2 TiO 3 /TiO 2 heterostructure samples during (a) and (b) the adsorption stage and (c) and (d) the reaction process.(e) The possible reaction pathway for photoreduction of CO 2 with H 2 O by using Li 2 TiO 3 /TiO 2 catalyst. This work was supported by the National Natural Science Foundation of China (21978088, 91534202, 51673063), Sponsored by the Shanghai Pujiang Program (18PJ1402100), the Program for Professor of Special Appointment (Eastern Scholar) at Shanghai Institutes of High Learning, the Basic Research Program of Shanghai (17JC1402300), the Social Development Program of Shanghai (17DZ1200900), the Shanghai City Board of education research and innovation project, and the Fundamental Research Funds for the Central Universities (222201718002). within several milliseconds.The introduction of Li species not only improve the adsorption capacity of CO 2 , but also reduce the oxygen defect trap to reduce the resistivity.The built-in electric field directed from Li 2 TiO 3 to TiO 2 will be attributed to promote the separation of electron-hole pairs and forces electrons move to the oxygen atom sites in Li 2 TiO 3 .The optimized Li 2 TiO 3 /TiO 2 catalyst exhibits a narrower band gap energy, a more negative conduction band position of -0.884 V and better reductive ability, eventually achieving nearly a 3 times performance enhancement with about 100 selectivity towards CO.Notably, based on the in-situ DRFITS combined with transition state calculations by DFT simulation, we proposed an possible catalytic mechanism that the Li 2 TiO 3 /TiO 2 catalyst will choose an easier pathway through the intermediate formate conversion to CO, of which free energy is reduced by 26.53 from 0.98 eV to 0.72 eV.This work will provide a new insight into facile production of highly efficient CO 2 photoreduction catalysts by constructing heterostructure in an ultrafast reaction process. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary material related to this article can be found, in the online version, at doi:https://doi.org/10.1016/j.apcatb.2020.118810."
  }
]