[
  {
    "title": "Doi",
    "content": "Doi not found"
  },
  {
    "title": "Article_Title",
    "content": "Selective photocatalytic CO 2 reduction in water through anchoring of a molecular Ni catalyst on CdS nanocrystals"
  },
  {
    "title": "Abstract",
    "content": "Photocatalytic conversion of CO 2 into carbonaceous feedstock chemicals is a promising strategy to mitigate greenhouse gas emissions and simultaneously store solar energy in chemical form.Photocatalysts for this transformation are typically based on precious metals and operate in non-aqueous solvents to suppress competing H 2 generation.In this work, we demonstrate the first example of selective visible-light driven CO 2 reduction in water using a synthetic photocatalyst system that is entirely free of precious metals.We present a series of self-assembled nickel terpyridine complexes as electrocatalysts for the reduction of CO 2 to CO in organic media.Immobilization on CdS quantum dots allows these catalysts to be active in purely aqueous solution and photocatalytically reduce CO 2 with 90 selectivity under UV-filtered simulated solar light irradiation (AM 1.5G, 100 mW cm -2 , 400 nm, pH 6.7).Correlation between catalyst immobilization efficiency and product selectivity shows that anchoring the molecular catalyst on the semiconductor surface is key in controlling the selectivity for CO 2 reduction over H 2 evolution in aqueous phase."
  },
  {
    "title": "Experimental",
    "content": "Materials.All chemicals were obtained from commercial sources in the highest available purities and used as received.Ni(BF 4 ) 2 6H 2 O (99) was purchased from Acros Organics, and 2,2':6',2''-terpyridine (terpy, 97) was purchased from Alfa Aesar.2,2':6',2''-terpyridine-4'-carboxylic acid (terpyC, 98), 2,2':6',2''-terpyridine-4'-phosphonic acid (terpyP, 98) and 2,2':6',2''-terpyridine-4'-thiol (terpyS, 98) were purchased form HetCat, Switzerland.Zn(BF 4 ) 2 H 2 O (18 Zn min) was purchased from Alfa Aesar.Ligand-free CdS QDs (QD-BF 4 ) were prepared according to a literature procedure (see Supporting Information for details). 26ssembly of catalysts, Ni(terpyX) 2 2 .An acetonitrile solution of Ni(BF 4 ) 2 6H 2 O (500 L, 20 mM) was added to a glass vial containing terpyX (20 mol).The mixture was diluted to 1 mL with acetonitrile (500 L; terpy, terpyS) or wa-ter (terpyC, terpyP) and sonicated for 10 min to give a clear yellow-orange stock solution (See Figures S1,S3-S5 for characterization).Analogous Zn(terpyX) 2 2 complexes were assembled in a similar fashion, using Zn(BF 4 ) 2 H 2 O. Electrochemical procedures.Cyclic voltammetry (CV) was performed at room temperature under an atmosphere of Ar or CO 2 using a PalmSens EmStat potentiostat.A standard three-electrode cell was used for all measurements with a platinum mesh counter and a Ag/AgCl reference electrode (BASi), separated from the bulk solution by a porous Vyvor frit.In anhydrous DMF or ACN solution (0.1 M Bu 4 NBF 4 , electrochemistry grade, Sigma Aldrich), a glassy carbon disc (3 mm diameter, BASi) or polycrystalline boron-doped diamond (BDD, purchased from Element Six and prepared into 1 mm glass-sealed disc electrodes using the facilities at the Warwick Electrochemistry and Interfaces Group) was used as working electrode; in aqueous solution (0.1 M TEOA, 0.1 M KCl, pH 6.7), a BDD electrode was used.Working electrodes were cleaned before experiments by mechanically polishing in alumina (Buehler, Micropolish, 1 m) on a polishing cloth (Buehler, Microcloth).CVs were recorded at 0.1 V s -1 scan rate and 1.0 mM analyte concentration unless otherwise stated, solvents were purged for 10 min with the chosen gas saturated with solvent vapor prior to measurements (pH was measured after purging).The Fc/Fc couple was used as an internal reference in organic media.Where necessary, literature potentials were converted from the normal hydrogen electrode (NHE) or Ag/AgCl electrode using published values. 27pectro-electrochemistry was performed in an optically transparent thin-layer electrochemical cell with Pt mesh working and counter electrodes and a Ag wire quasi reference electrode, 28 filled with a solution of Ni(BF 4 ) 2 6H 2 O (0.1 mM for UV-vis, 3.0 mM for IR), terpy (0.2 mM for UV-vis, 6.0 mM for IR), Bu 4 NBF 4 (0.01 M for UV-vis, 0.3 M for IR) in dry MeCN purged with Ar or CO 2 .The potential was stepped in 50 mV intervals, held for 120 s before UV-vis or FTIR spectra were collected. Controlled-potential electrolysis (CPE) was performed on a PalmSens Multistat using three parallel electrochemical cells of known volume under a CO 2 (2 CH 4 ) atmosphere using a glassy carbon rod working electrode; the counter electrode was separated from the working electrode by a coarse glass frit.Gaseous reaction products were quantified by gas chromatography, formic acid and oxalic acid in solution were quantified by ion chromatography at the end of the experiment. Photocatalytic CO 2 reduction.In a typical experiment, QD-BF 4 stock solution in DMF (135 M, 14.8 L) was added to a pyrex photoreactor (Chromacol 10-SV, Fisher Scientific) containing a magnetic stirrer bar and the DMF was removed in vacuo.The particles were suspended in an aqueous solution of triethanolamine (TEOA, 0.1 M, 1.98 mL) and a stock solution of the self-assembled electrocatalyst (10 mM in acetonitrile or acetonitrile/water 1:1, 20 L) was added.The photoreactor was sealed with a rubber septum and purged with CO 2 (containing 2 CH 4 as internal standard) for 10 min in the dark; the solution pH decreased from 10.1 to 6.7 after purging due to saturation with CO 2 .The photoreactor was then placed in a water bath maintained at 25C, stirred and irradiated by a solar light simulator (Newport Oriel, 100 mW cm -2 ) equipped with an air mass 1.5 global filter (AM1.5G).IR irradiation was filtered with a water filter (10 cm path length) and UV irradiation with a 400 nm cut-off filter (UQG Optics) unless other-wise stated.Product distribution was quantified through periodic headspace gas analysis (50 L) by gas chromatography.Formic acid and oxalic acid in solution were quantified by ion chromatography at the end of the experiment. Isotopic labeling.Photocatalysis experiments were performed as described above, but using 13 CO 2 as the headspace gas.After 8 h, the photoreactor headspace was transferred to an evacuated gas IR cell (SpecAc, 10 cm path length, equipped with KBr windows) and a high-resolution transmission spectrum was collected."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Synthesis of the Ni(terpy) 2 2 complexes was achieved by a simple self-assembly procedure, which allowed screening of electrochemical properties without time-consuming isolation of the complexes. 29Cyclic voltammetry (CV) of the complex formed by self-assembly of Ni(BF 4 ) 2 6H 2 O with 2 equivalents of terpy showed comparable redox features to those of the isolated Ni(terpy) 2 2 complex 24b (1 mM Ni 2 , 0.1 M Bu 4 NBF 4 in Ar or CO 2 -saturated DMF, Figure 2A).Monitoring the growth of the characteristic reduction waves of Ni(terpy) 2 2 upon successive addition of terpy equivalents to a Ni(BF 4 ) 2 6H 2 O solution indicates that the self-assembly process is rapid (Figure 2B).The catalyst identity was further corroborated by mass spectrometry and UV-vis spectroscopy (Figure S1). CV of Ni(terpy) 2 2 shows two reversible reduction waves at E 1/2 -1.58V and -1.76 V vs. Fc/Fc (Figure S1B), with the first reduction showing considerable current enhancement under CO 2 .Comparison with the corresponding Zn(terpy) 2 2 complex (Figure S2A) confirms both reductions to be ligandbased, in agreement with previous literature assignments.24b,30 UV-visible spectro-electrochemical measurements of Ni(terpy) 2 2 (a) under Ar show the disappearance of the peak at 320 nm upon the first reduction followed by growing in of the peak at 235 nm upon further reduction (Figure 3A).Under CO 2 , the second reduced species (at 235 nm) is no longer visible (Figure 3B), suggesting the first reduced species (b, Figure 3D) reacts with CO 2 . This was confirmed by FTIR spectro-electrochemistry under CO 2 (Figure 3C), which showed two bands at 1684 and 1642 cm -1 consistent with formation of a Ni-CO 2 -or Ni-CO 2 H complex (c or d, Figure 3D). 31Two additional peaks were detected at 1978 and 1899 cm -1 (Figure 3C), which we assign to carbonyl stretches of a Ni-CO complex (e, Figure 3D).In accordance with previous reports, 24b we propose a reaction mechanism (Figure 3D,3E) in which the singly reduced Ni(terpy) 2 -complex (b) loses a terpy ligand upon reaction with CO 2 to give the Ni-CO 2 complex (c).A second ligandbased reduction to (d) is followed by reaction with CO 2 to give the Ni-CO complex (e).Since the electrocatalytic performance of Ni(terpy) 2 2 is solvent-dependent (see below), we propose that vacant sites on the catalytically active Ni species are coordinated by solvent molecules. With the catalytic activity of Ni(terpy) 2 2 established, anchoring group-functionalized complexes Ni(terpyX) 2 2 (X C, P, S; Figure 1) were self-assembled using 2,2':6',2''terpyridine-4'-phosphonic acid (terpyP), 2,2':6',2''-terpyridine-4'-thiol (terpyS), and 2,2':6',2''-terpyridine-4'-carboxylic acid (terpyC, see Figures S3-S5 for full characterization).The elec-trochemistry of the complexes was studied in 3:1 CH 3 CN:H 2 O solution to investigate their water tolerance.CV of Ni(terpyP) 2 2 shows an electrochemical response comparable to the parent Ni(terpy) 2 2 complex but shifted to more positive potentials (Figure S3B) as expected from substitution with an electron-withdrawing phosphonic acid group.The first cathodic wave is irreversible, indicative of structural rearrangements upon reduction.Comparison with the analogous Zn(terpyP) 2 2 complex was not possible due to its low solubility in this solvent system. Ni(terpyC) 2 2 undergoes two irreversible reductions which are more anodically shifted then in Ni(terpyP) 2 2 , presumably due to the strong electron-withdrawing nature of the carboxyl functionality on the ligand.A third, partly reversible reduction wave is observed at approximately -1.7 V (Figure S4B), which is also displayed by the analogous Zn(terpyC) 2 2 complex and can therefore be assigned to another ligand based reduction (Figure S2B).CV of Ni(terpyS) 2 2 shows a number of poorly resolved irreversible redox events (Figure S5B), which are similarly observed with Zn(terpyS) 2 2 .This again suggests ligand-based reductions (Figure S2C).CV of Ni(terpyS) 2 2 is further complicated by the low solubility of the reduced complex, as indicated by a decrease in electrochemical response upon repeated cycling. 2 all exhibit modest current enhancements, indicative of electrocatalytic activity towards CO 2 .CO 2 reduction was confirmed by controlled-potential electrolysis (CPE, E appl -1.83V vs. Fc/Fc ; Figure 2C).In line with previous reports, 24b CO was detected as the sole CO 2 reduction product with all catalysts, as formation of formic acid and oxalate was excluded using ion chromatography.The selectivity for CO 2 reduction over proton reduction varied with the employed ligand, with over 95 selectivity being achieved in the first hour for both Ni(terpy) 2 2 and Ni(terpyS) 2 2 (Figure 2D).Up to 8.5 turnovers (with respect to Ni) were achieved over 12 h CPE with Ni(terpyC) 2 2 and all catalysts significantly exceeded the performance of previous reports in dry DMF (TON 0.1; Table S1).24b We ascribe this difference in performance to variation of the solvent, as electrolysis in DMF and DMF/H 2 O mixtures gave a much lower catalytic activity.This finding is consistent with a solvent-coordinated catalytically active species (Figure 3D). The electrochemical behavior of the Ni(terpyX) 2 2 complexes was further investigated in purely aqueous solution to evaluate their potential use in hybrid photocatalysis in the absence of organic solvents.The electrochemical response in water was markedly different from that in organic media ( ).Formation of small amounts of CO was observed with all complexes (Table S2), but the catalytic activity decayed rapidly, accompanied by the formation of a deposit on the working electrode. The hybrid photocatalyst system was assembled by combining the Ni(terpyX) 2 2 catalysts with CdS quantum dots (QDs, D 5.3 nm, max 451 nm, Figure S6A).CdS is an inexpensive semiconductor with a tunable visible light absorption.Previous work in our laboratory has shown that ligand-free, charge-stabilized CdS QDs (QD-BF 4 ) show excellent photocatalytic activity for H 2 evolution in pH-neutral aqueous solution. 26,32CV of CdS-BF 4 immobilized on a glassy carbon electrode were used to electrochemically determine 33 the conduction band (CB) edge potential in aqueous solution (0.1 M triethanolamine, TEOA, pH 6.7; Figure S6B).A measured value of E CB -0.84V vs. NHE suggests enough driving force to enable efficient CO 2 reduction at Ni(terpyS) 2 2 , which shows an onset of catalysis at -0.75 V vs. NHE under the same conditions. .Catalyst attachment was confirmed by UV-vis spectroscopy with the catalyst loading dependent on the anchoring group (Figure 4A).The highest loading (50.52.9 nmol cat.per nmol QD) was achieved with the thiol derivative, Ni(terpyS) 2 2 , with significantly lower affinity measured for the other anchors (Figure 4B).The appearance of characteristic catalyst peaks in the UV-vis and ATR-IR spectra of Ni(terpyS) 2 2 -modified CdS QDs immobilized on a mesoporous SnO 2 electrode confirmed that the catalyst remained structurally intact on the QD surface (Figures 4C andS7).CV showed that the anchored catalyst retained its electrochemical response, further corroborating functional integrity on the QD surface (Figure 4D).Transmission electron microscopy showed that anchoring of the catalyst does not affect the particle morphology or dispersibility (Figure S8). The photocatalytic activity of the assembled CdS-Ni(terpyX) 2 2 hybrids was assessed in CO 2 -saturated water under simulated solar light irradiation in the presence of TEOA as a sacrificial electron donor (0.1 M, pH 6.7, 100 mW cm -2 AM1.5G, 400 nm, 25C; Table S3).Whereas the parent CdS-Ni(terpy) 2 2 catalyst without an anchoring group generated mainly H 2 and only traces of CO, the functionalized derivatives showed considerably higher activities towards CO 2 reduction (Figure 5A, Table S3).Ni(terpyS) 2 2 exhibited both the highest CO 2 reduction activity and product selectivity of this series (92.2 after 4 h compared to 10.2 and 3.9 for Ni(terpyP) 2 2 and Ni(terpyC) 2 2 , respectively).Strikingly, the observed selectivity does not reflect the electrocatalytic activity in homogeneous phase (Figure 3C-D, Table S2), but correlates with the adsorption efficiency of each complex to CdS (Figure 5B).This trend confirms that interfacing the molecular catalyst with the nanoparticle is key to overall photocatalytic activity in aqueous solution.Since CdS QDs alone only produced trace amounts of CO and addition of a Ni salt only enhanced the production of H 2 (Figure S8, Table S3), it can be concluded that the active species for CO production is the molecular catalyst.X-ray photoelectron spectroscopy of CdS-Ni(terpyS) 2 2 after 1 h irradiation was performed to characterize the Ni species present when the hybrid photocatalyst shows its peak performance (Figure S10).The observed Ni(2p 3/2 ) binding energy of 856.6 eV is consistent with a molecular Ni II species, ruling out potential formation of elemental Ni and NiS which would be expected at close to 853 eV. 34O 2 was unambiguously confirmed as the sole origin of the formed CO through gas-phase IR spectroscopy using 13 CO 2 to give 13 CO exclusively (Figure S11).Other CO 2 reduction products such as formic acid and oxalate could not be detected in the reaction solution by ion chromatography.Photocatalysis experiments performed without a UV cut-off filter resulted in little difference in TON CO compared to visible-light only, indicating that the catalytic reaction rate is limiting rather than light absorption (Table S3).Using acetonitrile/water mixtures as reaction medium analogous to those used in electrochemical analysis only led to a small increase in activity accompanied by a lower product selectivity (Figure S12, Table S3). Under optimized conditions, up to 20 Ni-based turnovers were achieved with CdS-Ni(terpyS) 2 2 during 24 h visiblelight illumination (Figure 5C, Table S3).CO selectivity remains above 90 for the first 8 hours, before it gradually decreases to produce predominantly H 2 after 24 h.Ion-coupled plasma optical emission spectroscopy (ICP-OES) of QDs isolated from the reaction medium confirms that the decreasing selectivity coincides with a gradual loss of Ni(terpyS) 2 2 from the QD surface (Figure 5D, Table S4), whereas the CdS-BF 4 particles remain intact.UV-vis spectra show a slight redshift of the first excitonic absorption, indicative of limited particle aggregation without significant photocorrosion (Figure S13A).Addition of fresh catalyst after 20 h recovers the CO generation activity and suppresses H 2 evolution (Figure 5C), while adding Ni(BF 4 ) 2 only promotes H 2 evolution (Figure S14).Conversely, lowering the initial catalyst:QD ratio lowered the CO selectivity but did not significantly affect the maximum TON CO (with respect to Ni(terpyS) 2 2 , Figure S15), from which it can be inferred that a TON CO of 20 represents a limit of stability of the catalyst. Stirring CdS-Ni(terpyS) 2 2 in the dark had no effect on the photocatalytic activity, therefore catalyst deactivation is dependent only on catalyst turnover (Figure S16).Release of a terpyS ligand during catalytic turnover was monitored by trapping the intact ligand with Fe 2 ions.UV-vis quantification of the formed Fe(terpyS) 2 2 complex (based on the absorption at 578 nm; Figure S13B-D) showed that approximately 30 of the initial ligand loading was recovered.Loss of the remaining 70, suggests that the ligand itself degrades during catalyst turnover (Figure S13D).It has been proposed that Ni(terpy) 2 2 deactivates during catalysis due to Ncarboxylation of the ligand.24b,35 It is notable that the Ni loading of the CdS QDs after CO production ceases (24 h for initial loading of 100:1 Ni:QD) is comparable to that measured for systems that only produced H 2 (QDs with Ni(terpy) 2 2 and Ni(BF 4 ) 2 , Table S4).We conclude that highly selective CO production occurs by electron transfer from the QDs to the molecular catalyst while the catalyst remains attached to the surface.As the catalyst is lost from the QDs, H 2 production can occur at the exposed CdS surface, presumably promoted by Ni ions released upon decomposition of Ni(terpyS) 2 2 .Ni is a known co-catalyst for photocatalytic H 2 evolution from Cd-based QDs. 36Control experiments with CdS-Ni(terpyX) 2 2 in the absence of CO 2 further corroborated the role of the surface-functionalization in controlling H 2 evolution (Figure S17, Table S5).In the presence of the freely diffusing co-catalyst Ni(terpy) 2 2 , QD-BF 4 steadily evolved H 2 under illumination.In contrast, in the presence of Ni(terpyS) 2 2 which binds strongly to the QD surface, H 2 evolution was significantly suppressed during the first 2 h.Under prolonged irradiation, the rate of H 2 generation from CdS-Ni(terpyS) 2 2 increased and was comparable to that observed under CO 2 .Co-catalyst re-addition after 17 h reduced H 2 evolution, further demonstrating that surfaceattached Ni(terpyS) 2 2 prevents H 2 formation, even in the presence of decomposition-derived Ni in solution.The use of mercaptopropionic acid-capped QDs (QD-MPA) to deliberately block the QD surface 32 did not result in higher selectivity, but lowered the overall activity (Figure S18, Table S3), presumably due to inhibited access of the catalyst to the surface. For CdS-Ni(terpyS) 2 2 , the average external quantum efficiency (EQE) for CO production under 400 nm monochromatic light (1.5 mW cm -2 ) was 0.28 0.04 (highest 0.31, average taken for linear activity between 4 and 8 h; Table S6).Comparable EQE was previously reported for CO 2 to formate conversion with a precious-metal containing Ru-Ag-TaON hybrid catalyst at similar pH (EQE HCOOH 0.23, pH 7.0, 0.1 M Na 2 CO 3 ). 15In this system, higher efficiency was obtained at lower pH (EQE HCOOH 0.47, pH 4.3, no Na 2 CO 3 ) but bulk product selectivity was reduced (37 c.f. 85). 15igher efficiencies have been achieved by homogeneous precious-metal based photocatalysts, 37 with a Ru-Re photocatalyst achieving 13 EQE and TON 130 in water (81 CO selectivity).37a"
  },
  {
    "title": "Conclusions",
    "content": "In summary, we have demonstrated that self-assembled nickel bis(terpyridine) complexes are tolerant to water in electrocatalytic reduction of CO 2 in organic solution.Anchoring these catalysts on CdS quantum dots transfers this activity into pure water to achieve visible-light driven reduction of aqueous CO 2 .The performance of this hybrid system was found to crucially depend on the interface between the nanoparticulate photosensitizer and the molecular catalyst, demonstrating that catalyst immobilization is key to achieve selective CO 2 reduction in water.More than 90 selectivity for CO generation was achieved with the catalyst with the highest affinity for the QDs, Ni(terpyS) 2 2 .To the best of our knowledge, this is the first example of a precious-metal free synthetic photocatalyst system capable of selective CO 2 reduction in an aqueous medium under visible-light irradiation. Electronic Supplementary Information (ESI) available free of charge on the ACS Publications website: Experimental procedures, electrochemical and spectroscopic data (PDF). Figure 1.Schematic representation of the hybrid photocatalyst system developed in this work: A molecular nickel bis(terpyridine) catalyst anchored on a CdS quantum dot photosensitizer; different anchoring groups were studied for their performance. Figure 2. Self-assembled Ni(terpy) 2 2 as selective electrocatalyst for CO 2 reduction.(A) Comparison of self-assembled vs. isolated complex under Ar and CO 2 (1.0 mM complex, 0.1 M Bu 4 NBF 4 in DMF, 100 mV s -1 , rt); (B) Self-assembly of Ni(terpy) 2 2 by consecutive addition of terpy ligand to Ni(BF 4 ) 2 6H 2 O under a CO 2 atmosphere followed by linear sweep voltammetry (1.0 mM Ni(BF 4 ) 2 6H 2 O, 0.1 M Bu 4 NBF 4 in DMF, 100 mV s -1 ); (C) Electrocatalytic CO formation during CPE in the presence of self-assembled Ni(terpyX) 2 2 ; (D) CO vs. H 2 electrolysis product selectivity after 1 h CPE.CPE conditions: E appl -1.83V vs. Fc/Fc , 0.25 mM Ni(terpyX) 2 2 , 0.1 M Bu 4 NBF 4 in acetonitrile/water 3:1 under CO 2 , glassy carbon working, Ag/AgCl reference and Pt mesh counter electrodes, rt; XC: CO 2 H, P: PO 3 H 2 , S: SH (see Figure 1). Figure 3. Mechanism of electrocatalytic CO 2 reduction with Ni(terpy) 2 2 .(A, B) UV-visible spectro-electrochemistry under Ar (A) and CO 2 (B) atmosphere; (C) FTIR spectro-electrochemistry under CO 2 ; (D) proposed mechanism of electrocatalytic CO 2 reduction; (E) cyclic voltammogram of Ni(terpy) 2 2 with indicated reaction steps under Ar and CO 2 .All experiments were performed in dry acetonitrile electrolyte solution. Figures S1D, S3D, S4D, S5D).All observed redox events were irreversible presumably due to structural changes during reduction, e.g.loss of a ligand, which is insoluble in water.In addition, Ni(terpy) 2 2 and Ni(terpyP) 2 2 showed anodic stripping peaks on the return scan, suggesting a low solubility of the reduced species and/or catalyst decomposition.Under CO 2 , Ni(terpyC) 2 2 and Ni(terpyS) 2 2 both showed a current enhancements indicative of electrocatalytic activity for CO 2 reduction (E onset -0.85V and -0.75 V vs. NHE, respectively), whereas Ni(terpy) 2 2 and Ni(terpyP) 2 2 showed changes in their electrochemical response, indicative of reactivity towards CO 2 but with no clear catalytic wave.Electrocatalytic activity of Ni(terpyX) 2 2 towards CO 2 was confirmed by performing CPE in aqueous solution under CO 2 (E appl -0.84V vs. NHE, 0.5 mM catalyst, 0.1 M KHCO 3 , pH 6.7 Figure 4. Hybrid photocatalyst assembly from CdS QDs and Ni(terpyX) 2 2 .A) Difference in UV-vis absorption of a Ni(terpyS) 2 2 solution (100 M, 0.1 M aq.TEOA, pH 6.7) before and after stirring with CdS QDs (1 M QD-BF 4 ); B) Adsorption efficiency of different Ni(terpyX) 2 2 complexes (addition of 1 M QD-BF4 to 100 M Ni(terpyX) 2 2 in 0.1 M aq.TEOA, pH 6.7); C) UV-vis spectra of CdS-Ni(terpyS) 2 2 hybrid photocatalyst immobilized on a mesoporous SnO 2 electrode and comparison with CdS-BF 4 and Ni(terpyS) 2 2 in solution (spectra scaled and stacked for clarity); D) Cyclic voltammetry of CdS-Ni(terpyS) 2 2 photocatalyst immobilized on a SnO 2 electrode (0.1 M Bu 4 NBF 4 in acetonitrile under Ar, Ag/AgCl reference and Pt mesh counter electrodes, rt).Modification of QD-BF 4 was carried out in situ by adding a stock solution of a self-assembled Ni complex to a suspension of QDs in aqueous TEOA solution (0.1 M).The final solution composition of H 2 O:CH 3 CN was 99:1 for Ni(terpy) 2 2 and Ni(terpyS) 2 2 , and 99.5:1 for Ni(terpyC) 2 2 and Ni(terpyP) 2 2.Catalyst attachment was confirmed by UV-vis spectroscopy with the catalyst loading dependent on the anchoring group (Figure4A).The highest loading (50.52.9 nmol cat.per nmol QD) was achieved with the thiol derivative, Ni(terpyS) 2 2 , with significantly lower affinity measured for the other anchors (Figure4B).The appearance of characteristic catalyst peaks in the UV-vis and ATR-IR spectra of Ni(terpyS) 2 2 -modified CdS QDs immobilized on a mesoporous SnO 2 electrode confirmed that the catalyst remained structurally intact on the QD surface (Figures4C and S7).CV showed that the anchored catalyst retained its electrochemical response, further corroborating functional integrity on the QD surface (Figure4D).Transmission electron microscopy showed that anchoring of the catalyst does not affect the particle morphology or dispersibility (FigureS8).The photocatalytic activity of the assembled CdS-Ni(terpyX) 2 2 hybrids was assessed in CO 2 -saturated water under simulated solar light irradiation in the presence of TEOA as a sacrificial electron donor (0.1 M, pH 6.7, 100 mW cm -2 AM1.5G, 400 nm, 25C; TableS3).Whereas the parent CdS-Ni(terpy) 2 2 catalyst without an anchoring group generated mainly H 2 and only traces of CO, the functionalized derivatives showed considerably higher activities towards CO 2 reduction (Figure5A, TableS3).Ni(terpyS) 2 2 exhibited both the highest CO 2 reduction activity and product selectivity of this series (92.2 after 4 h compared to 10.2 Figure 5. Photocatalytic reduction of aqueous CO 2 in the presence of CdS-Ni(terpyX) 2 2 hybrid catalysts.A) Effect of different anchoring groups on the product selectivity (4 h irradiation; see Figure S9 for control experiments); B) Correlation of product selectivity with catalyst attachment (4 h irradiation); C) Longterm activity of CdS-Ni(terpyS) 2 2 (solid lines) and effect of adding more catalyst after 20 h (dashed lines); D) Changes in product selectivity and catalyst loading over time for CdS-Ni(terpyS) 2 2 .Photocatalysis conditions: 100 mW cm -2 , AM1.5G, 400 nm, 1 M QD, 100 M Ni(terpyX) 2 2 , 25C. Figure 2 198x164mm (300 x 300 DPI) Figure 3 343x214mm (300 x 300 DPI) Figure 4 188x162mm (300 x 300 DPI) Figure 5 199x167mm (300 x 300 DPI) 2 Contents artwork: ACS Paragon Plus Environment ACS Paragon Plus EnvironmentJournal of the American Chemical Society Paragon Plus Environment Journal of the American Chemical Society ACKNOWLEDGMENT This work was supported by the Christian Doppler Research Association (Austrian Federal Ministry of Science, Research and Economy and the National Foundation for Research, Technology and Development), the OMV Group, the Isaac Newton Trust (12.38/k), the German Research Foundation (KU 3077/2-1 to MFK), and the World Premier International Research Center Initiative (WPI), MEXT, Japan (KLO).We thank Dr. David Wakerley, Ms. Christina Chang and Dr. Timothy Rosser for helpful discussions.We thank the Electrochemistry and Interfaces Group at The University of Warwick for kindly providing access to their facilities to assemble the BDD electrode.ACS Paragon Plus Environment Journal of the American Chemical Society ACS Paragon Plus Environment Journal of the American Chemical Society reisnerch.cam.ac.uk. Moritz F. Kuehnel: 0000-0001-8678-3779 Katherine Orchard: 0000-0002-6349-1316 Erwin Reisner: 0000-0002-7781-1616 Author Contributions These authors contributed equally. Notes TON was calculated by dividing the moles of formed CO (2.5 mol) by the moles of catalyst used (10 mL, 2 mM 20 mol Ni(terpy) 2 2 )."
  }
]