[
  {
    "title": "Doi",
    "content": "10.1016/j.apsusc.2016.03.141"
  },
  {
    "title": "Article_Title",
    "content": "Dynamic photocatalytic reduction of CO 2 to CO in a honeycomb monolith reactor loaded with Cu and N doped TiO 2 nanocatalysts"
  },
  {
    "title": "Abstract",
    "content": "Cordierite honeycomb monoliths loaded with N/TiO 2 and Cu/TiO 2 nanocatalysts for dynamic photocatalytic CO 2 reduction with H 2 to CO in a continuous photoreactor illuminated with UV-light irradiations have been investigated.The nanocatalysts, loaded over the monoliths channels using sol-gel dip-coating method, were characterized by X-ray diffraction (XRD), field emission scanning electron microscopy (FESEM), N 2 adsorption-desorption, X-ray photoelectron spectroscopy (XPS), UV-vis diffuse reflectance and photoluminescence (PL) analysis.Crystalline and anatase TiO 2 structure with nanoparticles evenly supported over the cordierite monolith channels were observed.Cu and N presented over TiO 2 , shifted band gap energy towards visible region and hindered charges recombination rate.Loading Cu and N greatly improved TiO 2 photoactivity for dynamic CO 2 reduction to CO. Due to high photoactivity and selectivity, Cu/TiO 2 assisted system yielded 14 times higher CO than the N/TiO 2 and 64 times the amount of copper observed over pure TiO 2 in a continuous operation of photoreactor.This significant improvement in Cu/TiO 2 activity was noticeable due to efficient trapping and transport of electrons by Cu-metal.With unique properties, N/TiO 2 showed good activity for continuous CO 2 reduction to CH 4 .In addition, a photocatalytic reaction mechanism is proposed to understand the experimental results over Cu and N modified TiO 2 catalysts in a continuous operation of photoreactor."
  },
  {
    "title": "Experimental",
    "content": "Cordierite honeycomb monoliths (100 cells per square inch, cylindrical in shape) measuring 20 mm in length and 60 mm diameter purchased from China were used.The nanocatalysts were prepared and supported over the monolith channels using modified sol-gel method as reported previously 3.In a typical procedure, 15 mL acetic acid (1 M) was added dropwise to an aqueous solution of 20 mL titanium tetra isopropoxide (Ti(C 3 H 7 O) 4 ) in 60 mL isopropanol (C 3 H 7 O).The obtained mixture was stirred at ambient temperature for 12 h to get titanium sol.Next, an adequate amount of copper nitrate or urea dissolved in deionized water was added to titanium sol and then aged for another 6 h to get clear sol.The sol obtained was poured into a glass container for coating over the monolith channels. Before catalyst loading, monoliths were washed with acetone and isopropanol to remove any organic material, dried at 80 C for 12 h and then cooled to room temperature.The initial weight of the dried monolith was noted and then dipped into the titanium sol to a specific time for the catalyst coating.The excess sol was blown off using hot compressed air.The coating procedure was repeated to reach an expected catalyst loading.The honeycomb monoliths were finally calcined at 500 C for 5 h (5 C min -1 ).The amount of catalyst loaded was calculated by subtracting the final weight of catalyst coated monolith from the initial weight of bare monolith.For every coating, three readings were noted and their average values are reported. The crystalline phase was investigated using powder x-ray diffraction (XRD).The XRD patterns were collected between 10-80 of 2 with a step size 0.05 and a step time of 1 s using a Bruker D8 advance diffractometer equipped with Cu-K incident radiation ( 1.54 A , 40 kV and 40 mA).The morphology of the samples was examined by field emission scanning electron microscopy (FESEM, Hitachi SU8020).The elemental states were analyzed using X-ray photoelectron spectroscopy (XPS, Axis Ultra DLD Shimadzu).The XPS spectrum was calibrated with respect to the binding energy of the C1s signal at 284.60 eV as the internal standard.The surface area measurements (BET) of the photocatalyst powders were carried out using N 2 adsorption-desorption isotherms with Surfer- Thermo-Scientific after degassing at 250 C for 4 h.UV-vis diffuse reflectance absorbance spectra were determined in the wavelength range of 200-800 nm using UV-vis spectrophotometer (Agilent, Cary 100) equipped with an integrated sphere.The charges recombination rate was analyzed using PerkinElmer LS 55 Luminescence Spectrometer. The design of continuous monolith photoreactor used in this work was described in detail in our previous work 29.The reactor was consisted of a stainless steel cylindrical vessel with a total volume 150 cm 3 , equipped with a quartz window and a reflector lamp located above the reactor.The catalyst coated cordierite honeycomb monoliths (100CPSI, L 20 mm, d 60 mm) were inserted inside the reactor chamber.200 W Hg reflector lamp was used as a source of light with a maximum light intensity of 150 mW cm -2 and wavelength 254 nm.An optical process monitor ILT OPM-1D and a SED008/W sensor was used to measure the light intensity.The reactor was purged using helium (He) flow before gas mixtures (CO 2 and H 2 , purity 99.99) was continuously passed through the reactor at a flow rate of 20 mL/min.The operating conditions used were CO 2 /H 2 feed ratio 1.0, temperature 100 C and pressure 1 atm.All the experiments were carried out in a continuous mode of operation and products were analyzed after regular intervals. The CO 2 reduction products were analyzed using an on-line gas chromatograph (GC-Agilent Technologies 6890 N, USA) equipped with TCD and FID detectors."
  },
  {
    "title": "Results_and_Discussion",
    "content": "XRD patterns of TiO 2 , Cu/TiO 2 and N/TiO 2 samples are presented in Fig. 1.Pure crystalline and anatase phase TiO 2 could be seen in all the TiO 2 samples.All the peaks of TiO 2 and Cu/N loaded TiO 2 samples were identical, thus shift in peaks were not observed.The peaks attributable to Cu or N in metal or oxide states were not detected, possibly due to the low amount, or they were uniformly distributed inside the TiO 2 structure 32,33.The crystallite sizes were estimated from the XRD patterns using Scherer equation and the data is presented in Table 1.The TiO 2 crystallite size was gradually reduced with Cu and N loading.This was probably Cu and N presented over the TiO 2 structure prohibited crystal growth, resulting in reduced crystallite sizes 4,32. The morphology of cordierite support, catalyst particles, and metals distribution is presented in Fig. 2. SEM micrographs in Fig. 2(a-c) depict catalyst deposited evenly over the cordierite surface with no broken layer.The sol-gel dip-coating method used to support catalyst over the monolith channels resulted in a good dispersion of catalysts over the cordierite surface.The mesoporous and uniform nanoparticles of TiO 2 , N/TiO 2 and Cu/TiO 2 could be seen in Fig. 2(d-f), respectively.Fig. 2(g-i) shows the elemental mapping images of pure TiO 2 , N/TiO 2 and Cu/TiO 2 samples.Noticeably, N and Cu metals, evenly distributed over the TiO 2 surface, can provide more active sites for the reactants.The EDX plots in Fig. 2(k-l) further confirmed the presence of N and Cu metals in TiO 2 . The N 2 adsorption-desorption tests were performed to determine the surface area, pore volume and pore width of the catalysts.The isotherms of TiO 2 , N/TiO 2 and Cu/TiO 2 samples are illustrated in Fig. 3 with an increase in the volume of gas uptake.The hysteresis loops observed in all the samples, indicating mesoporous pore structure of TiO 2 .Suggestively, capillary and condensation reflections were observed in the TiO 2 sample, while the similar trends appeared in the N and Cu doped TiO 2 samples.BET surface area was measured from N 2 adsorption-desorption isotherms and the results are listed in Table 1.The BET surface area of TiO 2 was 42 increased to 47 and 50 m 2 /g in N/TiO 2 and Cu/TiO 2 samples, respectively.It is noticeable to see there is no significant effect on TiO 2 surface area by loading Cu and N metals.However, pore volume gradually increased with Cu and N loading. X-ray photoelectron spectroscopy (XPS) was used to determine the oxidation state of Ti, and chemical states of the component elements in 3 wt.N/TiO 2 and 3 wt.Cu/TiO 2 samples as presented in Fig. 4. The Ti 2p 3/2 and Ti 2p 1/2 binding energies (BE) in Fig. 4(a) attributed to the presence of titanium as Ti 4 oxidation state in both N/TiO 2 and Cu/TiO 2 samples.Fig. 4(b) shows spectra of O1s for the N/TiO 2 and Cu/TiO 2 samples.The XPS spectrum of O1s in N/TiO 2 reveals a peak with main components, one at 529.37 eV, characteristics of lattice oxygen (O 2-) and a high bending energy component at 531.57 and 533.11 eV related to metal-OH bond or free hydroxyl group (OH) on the surface.The same kind of analysis fitting can be determined for Cu/TiO 2 sample.The C1s peaks for N/TiO 2 and Cu/TiO 2 samples are presented in Fig. 4(c).The main peak at 284.60 eV is assigned to C C and C H hydrocarbon bonds.The peak at 288.31 eV can be attributed to carbon atoms bound to oxygen with double bond C O. The relative concentration of peak at 284.60 eV was much more and may be recognized as the carbon from carbon tap used for sample analysis.Fig. 4(d) shows the spectra of Cu 2p peaks for Cu/TiO 2 with BE regions centered at 931.41 eV (2p 3/2 and 947.48 eV (2p 1/2 ), respectively, indicating copper as Cu 2 or copper oxide (CuO) 34.Fig. 4(e) shows spectrum of N/TiO 2 contains N 1s peak at approximately 400 eV, which reflects a chemical structure like O-Ti-N 2. Fig. 5 shows UV-vis diffuse reflectance absorbance spectra of pure TiO 2 , N/TiO 2 and Cu/TiO 2 catalysts.The addition of N and Cu can obviously enhance the absorbance of TiO 2 under visible light irradiations.The band gap energy was measured from a plot of ( hv) 2 versus (hv) using the direct method and the results are presented in Table 1.The band gap energy of TiO 2 shifted towards the visible region by doping with Cu and N which is in good agreement with previous reports 23,35. The photoluminescence (PL) spectra of TiO 2 , N/TiO 2 and Cu/TiO 2 samples are displayed in Fig. 6.The fluorescence peaks of TiO 2 and doped TiO 2 samples were in the range of 450-550 nm excited at wavelength 350 nm.The pure TiO 2 and doped TiO 2 peaks exhibited wide and strong PL signals in the identical regions.The existence of PL attributed to the recombination of e -/h pairs.In N/TiO 2 , lower PL intensities compare to pure TiO 2 , confirming hindered charges recombination rates by N.However, a significant decrease in PL intensity detected in Cu/TiO 2 sample probably Cu traps more electrons, thus prevents efficient charges recombination rate compared to N/TiO 2 and pure TiO 2 samples.Thus, it is anticipated that Cu would be more efficient than N to enhance TiO 2 photoactivity. The control experiments were conducted for CO 2 reduction with H 2 under UV light irradiation at 100 C, CO 2 /H 2 ratio 1.0 and feed flow rate 20 mL/min.In all the experiments carbon containing compounds were not detected in the reaction system when the lamp was off as shown in Fig. 7.However, a continuous CO and CH 4 production could be seen under light irradiation.This confirmed that the catalysts and monoliths were cleaned while carbon containing compounds were produced from CO 2 reduction only. The effect of N-doping into TiO 2 photoactivity for CO 2 photoreduction with H 2 to CO and CH 4 under UV-light irradiation in a continuous monolith photoreactor is depicted in Fig. 8(a).CO was detected as the major CO 2 reduction product with a smaller amount of CH 4 over both un-doped TiO 2 and N/TiO 2 samples.Pure TiO 2 scarcely reduced CO 2 and showed very poor activity for CO formation, but loading N enhanced CO production rate.The CO evolution increased remarkably with increasing N-doping up to an optimum and then gradually decreased.The large quantity of N-doping would result in more defect sites resulting in decreased photocatalytic activity 23.Owing to the overall effects of defect sites, 3 wt.N is an optimum amount to achieve the best photocatalytic activity in the present system.Fig. 8(b) shows the effect of different amounts of Cu-loading (1 wt., 3 wt.and 5 wt.Cu contents) on the TiO 2 photoactivity for dynamic CO 2 conversion with H 2 under UV light irradiation.In all the cases, CO was the main product during CO 2 photoreduction with the smaller amount of CH 4 .Noticeably, Cu-loading can increase CO 2 reduction efficiency for both CO and CH 4 production.In the presence of a small amount of Cu-content (1 wt.), the photoactivity of TiO 2 was obviously enhanced.The activity of TiO 2 sample was further improved with increasing Cu-loading to 3 wt.and the amount of CO detected was 1981 mole g-catal. - .This yield of CO production was higher than that of pure TiO 2 by more than 99 times.When Cu-loading was more than 5 wt., a reduction of photoactivity was observed.This was probably due to loading of excess Cu over the TiO 2 surface (shielding effect), causing a decrease of TiO 2 surface active sites or perhaps due to recombination centers over the TiO 2 surface 4,32.Therefore, 3 wt.Cu/TiO 2 has the highest activity over which maximum CO yield observed, considerably more than the amount of CO produced over N/TiO 2 and TiO 2 catalysts.This enhancement in the Cu/TiO 2 activity for CO production was probably due to the higher mobility of charges with hindered recombination rate by Cu-metal in monolith microchannels.Hence, Cu-metal has more ability to trap electrons as evidenced by PL analysis and due to the reduction potential difference of Cu/TiO 2 system, resulting in enhanced productivity 3. Further investigations were carried out to study the effect of irradiation time on dynamic photocatalytic CO 2 reduction in a continuous photoreactor operation.Fig. 9 presents a dynamic CH 4 production over Cu/TiO 2 and N/TiO 2 catalysts at different irradiation time.Noticeably, Cu and N metals have different effects on CH 4 production.Increasing formation of CH 4 was observed over the N/TiO 2 catalyst during the entire irradiation time.CH 4 formation over Cu/TiO 2 presented a different behavior, initially reaching maximum concentration, and then gradually decreased.The decreased in CH 4 production over the irradiation time was possibly due to oxidation of CH 4 with O 2 to CO 2 in the presence of an efficient Cu/TiO 2 monolithic catalyst 36.On the other hand, N enables trapping holes, resulting in a continual increase in the yield rate of CH 4 .This also revealed prolonged stability and efficiency of N/TiO 2 catalyst for dynamic CH 4 production in a continuous operation of photoreactor 23. Previously, it has been reported that both Cu and N doped TiO 2 photocatalysts could enhance CH 4 photo-generation over the irradiation time.We investigated continuous CH 4 and hydrocarbon production over a Cu-In/TiO 2 catalyst in a batch mode operation of monolith photoreactor under UV-light irradiation 4.Liu et al. 37 reported increased in CH 4 yield rate with the irradiation time using Cu/TiO 2 catalysts in a slurry type photoreactor system.However, in the current study, different trends in CH 4 production over the cordierite honeycombs were perhaps due to gas phase reaction in a continuous monolith photoreactor operation.Similarly, Li et al. 23 observed CH 4 evolution rate increased with the irradiation time over N/TiO 2 during gas phase CO 2 reduction in a batch photoreactor under visible light irradiation.In this case CH 4 production trends are similar to current results, confirming N loading helps to produce CH 4 both in the gas phase and continuous operation of photoreactor.This also confirms higher stability and activity of N/TiO 2 for dynamic CH 4 production. The yield of CO production during CO 2 reduction over TiO 2 and doped TiO 2 samples at different irradiation times is presented in Fig. 10.Initially, the yield of CO production is much faster, but gradually decreased after 4 h of irradiation time.However, the amount of CO over a Cu/TiO 2 monolithic catalyst was significantly higher than N/TiO 2 and pure TiO 2 .The much higher photoactivity for CO production confirms the potential of CO 2 reduction with H 2 in a continuous operation of photoreactor loaded with Cu/TiO 2 nanoparticles.However, the CO production rate was gradually decreased at a prolonged irradiation time due to oxidation of CO to CO 2 in the presence of O 2 or perhaps due to deteriorating catalysts photoactivity in the course of continuous CO 2 reduction over the irradiation time 31,36. Table 1 summarizes yield rates and selectivity of different products over TiO 2 and doped TiO 2 catalysts.The main products observed were CO and CH 4 over TiO 2 and doped TiO 2 monolithic catalysts.However, in the case of Cu/TiO 2 , smaller amount of hydrocarbons namely C 2 H 4 , C 2 H 6 , C 3 H 6 and C 3 H 8 were also detected in the gas mixture.The performance of Cu/TiO 2 was found to be the highest, giving a dynamic CO yield rate of 763 mole g-catal. - h -1 a 14 fold more efficient than N/TiO 2 and 64 times more CO production over copper than un-doped TiO 2 catalyst.The selectivity of CO production over TiO 2 and N/TiO 2 were much closer (96) but increased to 99 in Cu/TiO 2 catalyst.However, the production of CO as the main product over Cu/TiO 2 and N/TiO 2 was due to thermodynamic reduction potential difference between TiO 2 (-0.5 eV) and CO 2 /CO (-0.48 eV) 2. Photocatalytic CO 2 reduction by H 2 via reverse water gas shift (RWGS) reaction also contributed to CO production.Recently, it has been reported that CO 2 was firstly converted to CO and then transformed to CH 4 over TiO 2 based photocatalysts 38,39.However, in the present study, due to continuous operation of photoreactor and efficient adsorption-desorption process inside monolith microchannels, CO was dynamically removed from the reactor over the irradiation time.Previously, we have investigated photocatalytic CO 2 reduction to CO over different co-doped TiO 2 nanocatalysts in a batch mode of monolith photoreactor.4,30,31,394041.Therefore, it can be established that CO would be a major CO 2 reduction product via RWGS reaction in a monolith photoreactor operated in a batch or continuous mode of operation. From Table 1, it is obvious that surface area, crystal size and band gap energy of Cu/TiO 2 and N/TiO 2 are much closer to each other.The higher Cu/TiO 2 photoactivity could not be linked to surface area or band gap energy.Therefore, enhanced Cu/TiO 2 photoactivity could be due to higher mobility of electrons in Cu-doped TiO 2 samples as illustrated in Eqs. ( 1)-(3) 4,42. Cu /Cu 2 e -/2e - Cu h /2h The generation of Cu ions takes place through the oxidation of Cu metal by photo-generated holes (Eq.( 1)).Due to rapid transfer of excited electrons to the Cu particles, e -/h pair's separation is enhanced as illustrated in Eqs. ( 2) and (3).Therefore, role of Cu in CO 2 reduction over Cu/TiO 2 is noticeable.As a consequence, higher photoactivity could be seen over Cu/TiO 2 monolithic photocatalyst for CO production.Recently, similar observations have been reported for photocatalytic CO 2 reduction to CO and CH 4 over Cu/TiO 2 photocatalyst in a gas phase system 43. In order to investigate the performance of CO 2 photoreduction with H 2 over Cu and N doped TiO 2 photocatalysts in a continuous monolith photoreactor, the results are compared with the work reported by various researchers.N/TiO 2 catalyst was used for CH 3 OH production and yield rate of 23 mole g-catal. - h -1 was measured using a batch mode photoreactor 22.CO 2 reduction with H 2 O to CO was reported over g-C 3 N 4 -N-TiO 2 in batch mode operation with a maximum yield of 14.73 mole after 12 h irradiation time 44.Over I/TiO 2 and Cu-I/TiO 2 , a CO yield rate of 3.9 and 12 mole g-catal. -1 was reported after 3.5 h during gas phase CO 2 reduction in a batch mode operation 20.Similarly, photocatalytic CO 2 reduction with H 2 O to CH 4 over different photocatalysts such as CH 4 yield of 100.22 ppm cm -2 h -1 over MgO/TNTs 45, 17 mole g-catal. - of CH 4 yield after 7 h over Ca 1.0 Ti 1.0 O 3 46, rGO-Pt/TNTs with CH 4 yield rate of 10.96 mole m -2 15, CH 4 yield rate of 23.10 mole g-catal. - after 480 min over 3-D Au/TiO 2 nanoparticles 47 and a CH 4 production of 184 mole gcatal. -1 after 24 h over Zn-Cu promoted TiO 2 has been reported by various researchers 38.A comparison study between previous reports and current study revealed that monolith geometry facilitated in improving the photoactivity and selectivity of photocatalysts.Therefore, the role of cordierite honeycomb monolith loaded with Cu and N is obvious for dynamic CO production in continuous photoreactor operation.This is perceptibly due to a larger illuminated surface area with higher photon energy consumption inside the monolith channels 39. The performance of cordierite honeycomb support loaded with Cu and N metals was further examined based on the quantum yield, calculated for each experiment, as the ratio of the product rate (mole per s) with photonic flux (mole per s).The quantum yield of CO 2 photoreduction to CO can be defined as the ratio of production rate (mole per s) with photonic flux (mole per s) as shown in Eq. ( 4) 48. 2 moles of CO production rate (mol/sec) moles of photon flux (mol/sec) 100 (4) The quantum yield was calculated based on the CO production rate and moles of photon input energy over the catalyst surface as presented in Table 1.The quantum yield for dynamic CO production over cordierite honeycomb monoliths loaded with Cu/TiO 2 was greatly enhanced (0.083) than N/TiO 2 and TiO 2 samples.Liou et al. 26 reported quantum efficiency of 0.012 and 0.057 for methanol and acetaldehyde, respectively, during photocatalytic CO 2 reduction with H 2 O over NiO/InTaO 2 catalysts in an internally illuminated continuous monolith photoreactor.Obviously, higher quantum yield in the current study was due to a larger illuminated surface area because of monolith microchannels and using H 2 as a reductant.5)-( 10) 42,43,49. As the photocatalytic activity is closely related to the band structure of photocatalysts, separation and transportation of photogenerated carriers (i.e., electrons and holes) as well as the redox potential, the enhanced photocatalytic mechanism can be explained by the scheme presented in Fig. 11 43,50.Under the light irradiations, VB electrons of TiO 2 excited to CB creating holes in VB.Without metals-loading, these charges recombine back and only a fraction of electrons and holes participate in reduction and oxidation process, thus, TiO 2 shows a quite low photocatalytic activity.When Cu metal was loaded on TiO 2 surface, the CB electron of TiO 2 can transfer to these metals which cause electron-hole pair separation (Eq.( 6)).Furthermore, more electrons could be trapped if the metal reduction potential is more positive than the CB of TiO 2 .As the redox value of Cu is lower (0.35)than the CB of TiO 2 (-0.50 V), thus electron can effectively be transferred to copper to prolong their lifetime 4,51,52.H 2 molecules were dissociated to H ions while CO 2 reduced to CO and hydrocarbons by accepting the trapped electrons and H ions as explained in Eqs. ( 7)- (10).Some previous works have reported that all of the N/TiO 2 contributed to the visible light absorption by creating a new N 2p state slightly above the valence band of TiO 2 23.As to the current N/TiO 2 photocatalyst, upon UV-light irradiation, holes may be trapped by N to react with CO to produce CH 4 . The expressively enhanced in CO yield rate over Cu/TiO 2 was clearly due to higher trapping and mobility of electrons by Cu metal for CO 2 reduction inside monolith channels.On the other hand, continuous production of CH 4 over N/TiO 2 was perhaps due to adsorbed CO converted to CH 4 over N/TiO 2 in the presence of holes.In general, dynamic CO 2 conversion to CO and CH 4 at a higher yield rate was due to using cordierite honeycomb monolith support loaded with doped TiO 2 nanoparticles."
  },
  {
    "title": "Conclusions",
    "content": "In this study, cordierite honeycombs loaded Cu/TiO 2 and N/TiO 2 nanocatalysts were developed for dynamic photocatalytic CO 2 conversion with H 2 under UV-light irradiation in a continuous operation monolith photoreactor.CO was the major CO 2 reduction product with a smaller amount of CH 4 over Cu and N/TiO 2 catalysts.Cu could improve TiO 2 photocatalytic activity by trapping electrons while N prolonged the lifetime of photo-generated charges by trapping holes.N-loading also promoted the formation of CH 4 during dynamic CO 2 reduction.The performance of Cu/TiO 2 was found to be the highest, giving a CO yield rate of 763 mole g-catal. - h -1 a 14 fold more efficient than N/TiO 2 and 64 times more than un-doped TiO 2 catalyst.The photoactivity of Cu and N/TiO 2 samples gradually reduced after 4 h of irradiation time.However, N/TiO 2 found very stable for CH 4 production over the entire irradiation time.In summary, by means of Cu and N doping, highest efficiency for dynamic CO 2 conversion was obtained due to a larger illuminated surface area, higher photon energy and better charges separation inside monolith microchannels.Both Cu and N are equally important to exert a substantial impact on the enhancement of CO and CH 4 production.This development confirmed a high performance of cordierite honeycomb monolith loaded with Cu/TiO 2 than N/TiO 2 for dynamic CO 2 conversion to fuels. Fig. 1.XRD patterns of pure TiO2, Cu/TiO2 and N/TiO2 samples. Fig. 2. SEM and FESEM images of cordierite honeycomb substrate loaded with catalysts nanoparticles; (a-c) SEM images of top and side view of catalyst loaded cordierite honeycomb channels, (d-f) FESEM images of TiO2, N/TiO2 and Cu/TiO2 nanoparticles, (g-i) elemental mapping of TiO2, N/TiO2 and Cu/TiO2 samples, (j-l) EDX plots of TiO2, N/TiO2 and Cu/TiO2 nanoparticles. FID detector was connected with a HP-PLOT Q capillary column (Agilent, length 30 m. ID 0.53 mm, film 40 m) for separation of C 1 C 6 paraffin and olefins hydrocarbons, alcohols and oxygenated compounds.The TCD detector was connected to UCW982, DC-200, Porapak Q and Mol Sieve 13X columns.Porapak Q and DC-200 columns were used for separation of C 1 C 5 compounds and light gasses (H 2 , O 2 , N 2 , CO) were separated using MS-13X columns. Fig. 3. N2 adsorption-desorption isotherms of TiO2, N/TiO2 and Cu/TiO2 samples. Fig. 4. XPS spectra of 3 N/TiO2 and 3 Cu/TiO2 samples: (a) Ti2p spectra of N/TiO2 and Cu/TiO2, (b-c) O1s and C1s spectra of N/TiO2 and Cu/TiO2 samples, (d) Cu2p spectra of Cu/TiO2 and (e) N1s spectra of N/TiO2. Fig. 6.Photoluminescence (PL) emission spectra of TiO2 and Cu/N doped TiO2 samples under the excitation wavelength of 350 nm. Fig. 8. Effect of N and Cu loading on TiO2 photoactivity for dynamic CO2 reduction to CO and CH4 in a continuous operation photoreactor at CO2/H2 ratio 1.0 and feed flow rate 20 mL/min; (a) effect of N-loading, (b) effect of Cu-loading. Fig. 9. Effect of irradiation time on CO2 photoreduction with H2 to CH4 over TiO2 and doped TiO2 catalysts in continuous monolith photoreactor at CO2/H2 ratio 1.0 and the feed flow rate 20 mL/min. Fig. 10.Production of CO during CO2 reduction with H2 over TiO2 and modified TiO2 samples in continuous monolith photoreactor at CO2/H2 ratio 1.0 and the feed flow rate 20 mL/min. Fig. 11.Schematic of photocatalytic CO2 reduction with H2 over cordierite honeycomb loaded Cu/TiO2 and N/TiO2 catalysts. Reaction mechanism In the photocatalytic CO 2 reduction process, photo-generated electrons (e -) and holes (h ) involve in breaking O C O and H H bonds with the formation of C O and C H bonds.The reaction mechanism was studied to get insight of CO 2 photoreduction over Cu/TiO 2 and N/TiO 2 catalysts.The electron-hole pairs separation and production of CO and CH 4 are illustrated in Eqs. ( Summary of physicochemical characteristics and products analysis over various catalysts. . Evidently, all the samples exhibited typical type IV isotherms The authors would like to extend their deepest appreciation to Universiti Teknologi Malaysia (UTM), Malaysia, for financial support of this research project under PAS RUG (Potential Academic Staff Research University Grant, Vot 02k24)."
  }
]