[
  {
    "title": "Doi",
    "content": "10.1016/j.apsusc.2019.144931"
  },
  {
    "title": "Article_Title",
    "content": "Fabricated g-C3N4/Ag/m-CeO2 composite photocatalyst for enhanced photoconversion of CO2"
  },
  {
    "title": "Abstract",
    "content": "In this work, the ordered mesoporous CeO 2 (m-CeO 2 ) was successfully fabricated via the nanocasting pathway, through using SBA-15 as a hard template.Besides, g-C 3 N 4 /Ag/m-CeO 2 composite was successfully constructed by calcination method.Meanwhile, the obtained samples were investigated by series of test techniques.The XRD, SEM and TEM results show that the m-CeO 2 and Ag/m-CeO 2 with the ordered mesoporous trait.Besides, the EPR, Raman and XPS results suggest that the oxygen vacancies (O v ) and Ce 3 and Ce 4 are in g-C 3 N 4 /Ag/m-CeO 2 .In addition, the ordered mesostructure is favorable for the CO 2 molecular movement and adsorption/ desorption reaction.The g-C 3 N 4 nanosheets, a promising material possessing suitable conductor band, large specific area, non-toxicity, and outstanding chemical stability, is a candidate semiconductor for CO 2 conversion.The introduction of g-C 3 N 4 nanosheets to Ag/m-CeO 2 overcomes the photocorrosion of Ag nanoparticles and Ag facilitate the transfer of photogenerated electrons.The photocatalytic activity results show that when the loading of Ag is 7 wt, the g-C 3 N 4 /7Ag/m-CeO 2 composite exhibits the superiority activity for CO 2 photoconversion to CO (13.94 mol/g) and CH 4 (7.39 mol/g) under UV-irradiation in 10 h."
  },
  {
    "title": "Experimental",
    "content": "2.3.Synthesis of mesoporous CeO 2 (m-CeO 2 ) photocatalyst 0.8017 g of Ce(NO 3 ) 3 6H 2 O and 0.5 g of SBA-15 were dispersed into 30 mL water and stirred 48 h under ambient temperature.After stirring, the suspension was died at 60 C overnight.The powder was grinded and calcined at 500 C in the muffle furnace for 2 h with a rate of 2.5 C/ min.The binary composite of CeO 2 /SBA-15 was obtained.The mesoporous CeO 2 was synthesized by removing the SBA-15 template with a hot alkali solution. 2.4.Synthesis of Ag/m-CeO 2 composite photocatalysts 0.5 g of m-CeO 2 and 50 mg of PVP were placed in 50 mL of deionized water, and ultrasonic dispersion 1 h.394 L of AgNO 3 solution (20 mg/mL) were added into above suspension solution and stirred 30 min.Subsequently, 5 mL of vitamin C (0.5 M) solution was added to the mixture.The solution turned brown and black, and was stirred for 24 h.After stirring, the obtain sample was filtered, washed, dried in a vacuum drying oven, and collected to obtain the 1 wtAg/m-CeO 2 composite, denoted as 1Ag/m-CeO 2 .Same synthetic way, the 3Ag/m-CeO 2 , 5Ag/m-CeO 2 , 7Ag/m-CeO 2 and 9Ag/m-CeO 2 were synthesized via adding different AgNO 3 solution. 2.5.Synthesis of g-C 3 N 4 /Ag/m-CeO 2 composite photocatalysts 2.0 g of urea and 0.5 g optimized Ag/m-CeO 2 binary composite photocatalysts were mixed and ground for 1 h.The ground mixture powder was transferred into a porcelain boat and placed in the tube furnace calcined in 500 C for 2 h, with a heating step of 5 C/min.The whole process was carried out in a nitrogen atmosphere.After calcination, the obtained sample was washed for several times with deionized water and absolute ethanol, vacuum drying to obtain the g-C 3 N 4 / Ag/m-CeO 2 composite photocatalyst. The X-ray diffraction patterns were performance on XRD-diffractometer (XRD, AXS D8 Germany).The content of element was tested on ICP spectrometer (ICP-OES, VISTA-MPX, Varian USA).The morphologies, particles size, nanostructure were examined on field emission scanning electron microscopy (FE-SEM, 7800F Japan) and transmission electron microscopy (TEM, JEOL JEM-2100).The lattice distribution of obtained samples were investigated by FEI Tenai G2 F30 S-Twin.The surface chemical states and different valence states of samples were analyzed on X-ray photoelectron spectroscopy spectrometer using Mg K radiation (XPS, Escalab 250Xi Thermo Fisher Scientific USA).The specific surface area of samples were detected by N 2 adsorption/desorption isotherms, which were performed on Nova 2020 (BET, Micromertics USA).The optical properties of as-prepared samples were measured by UV-vis diffuse reflectance spectroscopy (DRS, UV-2450 Shimazu Japan) and the BaSO 4 as the reference.The oxygen vacancies was examined on electron paramagnetic resonance spectrometer at 297 K (EPR, Bruker A300-10/12 Germany). The transient photocurrent, linear sweep voltammetry (LSV) and electrochemical impedance spectroscopy (EIS) plot were tested by a standard three-electrode system.0.5 M Na 2 SO 4 solution, Pt sheet, and Ag/AgCl electrode were served as electrolyte solution, counter electrode, and reference electrode, respectively.The obtained different samples were served as working electrode.0.03 g of as-synthesized samples, 0.01 g of PVP (k 5800) and 30 L of oleic acid were put into 3 mL of ethanol to mixture uniform.Then, the suspension was spincoated on FTO conducting glass (1 cm 1 cm).300 W ( 420 nm) xenon lamp was used as the light source during the process of transient photocurrent test.The time intervals of light on and light off was about 35 s. The CO 2 photoreduction was performed using a closed photochemical reactor with a volume of 300 mL at 0.4 MPa pressure and room temperature.0.1 g photocatalyst, 100 mL NaOH (0.1 M) solution and a certain amount of triethanolamine (TEOA) were added into the photochemical reactor.Subsequently, it was bubbled by CO 2 gas for 30 min to remove the impurities gases.Turn off air inlet and air outlet until the inner pressure was 0.4 MPa.The 8 W UV-light lamp was used as the light source.After every 1 h, the gas products were detected by the gas chromatography (GC-7920, China) FID-II detector."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The phase structures and components of as-synthesized photocatalysts were characterized by XRD patterns.Fig. 1(a) shows the lowangle XRD patterns of as-synthesized SBA-15, m-CeO 2 and Ag/m-CeO 2 .The characteristic diffraction peaks at 1.07, 1.74and 1.99correspond to the (1 0 0), (1 1 0) and (2 0 0) crystal planes of SBA-15 respectively, indicating the ordered two-dimensional hexagonal symmetric (P6mm) mesoporous material has been successfully prepared 42.The as-synthesized m-CeO 2 and Ag/m-CeO 2 show similar XRD patterns to SBA-15, while their intensity is lower than that of the SBA-15, which indicates that the m-CeO 2 and Ag/m-CeO 2 with an ordered two-dimensional hexagonal symmetric structure are successfully synthesized.In addition, the introduction of Ag particles does not change the XRD pattern of m-CeO 2 , implying that Ag nanoparticles not entered lattice structure.The Fig. 1(b) displays the m-CeO 2 , Ag/m-CeO 2 , g-C 3 N 4 /7Ag/m-CeO 2 and g-C 3 N 4 wide-angle XRD patterns.The characterized peaks at 28.6a nd 33.1and 47.5and 56.4belongs to the (1 1 1), (2 0 0), (2 2 0) and (3 1 1) crystal planes of m-CeO 2 (Fm3m, JCPDS No. 34-0394), which is in consistence with the previous literature reports 43,44.Compared with the XRD pattern of m-CeO 2 , the composite photocatalysts exhibit the characteristic peaks of Ag.The diffraction peak at 38.0belongs to (1 1 1) crystal plane of Ag 45, implying that the Ag particles are successfully deposited on the surface of m-CeO 2 .For XRD pattern of g-C 3 N 4 , two diffraction peaks around at 12.9(1 0 0) and 27.3(0 0 2) (JCPDS No 87-1526) 46, which correspond to the in-plane structural packing motif and interlayer stacking of aromatic segments of graphitelike materials 474849, respectively.The characteristic peak of g-C 3 N 4 is not clearly observed in the XRD spectrum of the g-C 3 N 4 /7Ag/m-CeO 2 composite photocatalyst, but the characteristic peak of the (1 1 1) crystal plane of m-CeO 2 is broadened, which may be because of the existence of g-C 3 N 4 .According to XRD analysis, we successfully prepared the 7Ag/m-CeO 2 and g-C 3 N 4 /7Ag/m-CeO 2 composite photocatalysts. The SEM images of as-synthesized photocatalysts materials are shown in Fig. 2. The mesoporous silicon material presents a morphology of \"cashew shape\" with a length of about 1.5 m-2 m (Fig. 2a).Fig. 2(b) shows the SEM image of the m-CeO 2 photocatalyst after removing template.Compared with the SBA-15, the length of m-CeO 2 is less than that of SBA-15, the reason may be due to that the Ce (NO 3 ) 3 6H 2 O does not fully fill the template.Besides, the as-synthesized m-CeO 2 has a rough surface than that of SBA-15.Fig. 2(c) is the SEM image of 7Ag/m-CeO 2 binary photocatalysts, the small round shiny particles are Ag nanoparticles, indicating the binary composite is successfully prepared.Fig. 2(d,e) are the SEM images of the g-C 3 N 4 /7Ag/ m-CeO 2 composite photocatalysts.g-C 3 N 4 nanosheets and Ag particles are observed in g-C 3 N 4 /7Ag/m-CeO 2 composites, implying that the ternary composite are successfully fabricated.Fig. 2(f) shows the SEM-EDS spectrum, it can be clearly seen that the Ag, C, N, O and Ce elements are contained in g-C 3 N 4 /7Ag/m-CeO 2 photocatalyst, the exact content of Ag in the g-C 3 N 4 /7Ag/m-CeO 2 photocatalyst was investigated by ICP-OES, and the examined result follows Table S1.According to the ICP-OES results, the exact loading of Ag (5.49) in the samples is lower than that of the theoretical calculate value (7), which may be due to parts of samples are not uniformly dispersed each other during the synthesis process resulting in different contents.Based on above discussion, Ag particles attach on the surface of m-CeO 2 and the g-C 3 N 4 nanosheets coat the 7Ag/m-CeO 2 and the binary composite photocatalysts are obtained.In order to confirm this, the atomic force microscope (AFM) test (shows in the Fig. S1) was used to further characterize the g-C 3 N 4 /7Ag/m-CeO 2 and 7Ag/m-CeO 2 .Comparing the thickness of 7Ag/m-CeO 2 , it can be found that the thickness of g-C 3 N 4 / 7Ag/m-CeO 2 clearly increases, it is mean that the g- Fig. 3(a) shows the TEM image of g-C 3 N 4 /7Ag/m-CeO 2 .From Fig. 3(a), the Ag particles with a size of 10-20 nm are successfully deposited between the surface of m-CeO 2 and g-C 3 N 4 nanosheets.The small size of Ag particles produced may be attributed to the surfactant PVP reducing the surface free energy of Ag.Besides, it is remarkably seen that the g-C 3 N 4 nanosheets successfully coat on the surface of 7Ag/ m-CeO 2 , which corresponds to the SEM results (Fig. 2d,e).As can be seen from HRTEM image in Fig. 3(b), where the spacing of lattice fringes at d 0.32 nm corresponds to the (1 1 1) crystal fate of m-CeO 2 44,50, and the lattice fringes at d 0.24 nm belongs to the (1 1 1) crystal fate of Ag nanoparticles 44.Fig. 3(c) and(d-n) are TEM image and element mapping of g-C 3 N 4 /7Ag/m-CeO 2 , respectively.It can be seen that the C, N, O, Ce and Ag elements are uniformly distributed on the surface of photocatalyst, and the Ag nanoparticles (Fig. 3h) are dispersed on the surface of m-CeO 2 .Based above discussion, the formation of heterostructure g-C 3 N 4 /7Ag/m-CeO 2 composite photocatalyst is further confirmed to fabricate. To illustrate the surface chemical states and different valence states of Ce ions in synthesized photocatalysts, XPS test was carried out in this work, the results display in Fig. 4. The Fig. 4 51,52, respectively.Correspondingly, the deconvoluted peaks of C 1s spectrum of g-C 3 N 4 /7Ag/m-CeO 2 shift to 284.87 eV, 286.38 eV and 288.18 eV, respectively.Which the binding energies of Ce(N) 3 and NeCN shift to high positions, it indicates that there are strong interaction between g-C 3 N 4 and m-CeO 2 .The N 1s spectrum of g-C 3 N 4 (Fig. 4c), binding energies located at 398.52 eV, 399.82 eV and 400.99 eV, can be attributed to the sp 2 -hybridized nitrogen, tertiary nitrogen and terminal amino groups 53,54, respectively.Compared to the g-C 3 N 4 /7Ag/m-CeO 2 , the binding energies shift to positions of 398.73 eV, 400.28 eV and 401.18 eV, respectively.It is clearly seen that the shift transfers to higher binding energies.The O 1s spectrum of m-CeO 2 (Fig. 4d) exhibits three fitted peaks at 529.41 eV, 530.52 eV and 530.66 eV, which can be assigned to the surface-adsorbed oxygen species, lattice oxygen (Ce-O), and surface hydroxyl 50, respectively.Compared to the g-C 3 N 4 /7Ag/m-CeO 2 , the peaks of lattice oxygen (Ce-O) and surface hydroxyl shift to higher binding energies of 530.66 eV and 531.90 eV, respectively.Indicating that strong interaction is formed with g-C 3 N 4 and m-CeO 2 55.The Ce 3d peaks can be fitted into nine peaks at binding energies shown in Fig. 4(e).Among them, the binding energies of 881.57eV, 884.53 eV, 888.37 eV and 897.41 eV can be assigned to Ce 3d 5/2 .In addition, at the binding energies of 899.83 eV, 901.83 eV, 906.52 eV and 915.95 eV can be attributed to Ce 3d 3/2 28,44.Furthermore, the binding energies at 881.57eV, 888.37 eV, 901.83 eV and 906.52 eV are ascribed to Ce 3 44,50, revealing that the Ce element exists Ce 3 and Ce 4 in the asprepared photocatalysts.Compared the pure m-CeO 2 , the binding energies show decrease, the reason can be attributed that the heterostructure has formed between g-C 3 N 4 and m-CeO 2 .As can be seen from Fig. 4(f), there are two XPS peaks at 367.6 eV and 373.5 eV, which correspond to Ag 3d 5/2 and Ag 3d 3/2 peaks of Ag 3d 56,57.This means that metal Ag particles are successfully attached on the surface of m-CeO 2 by photodeposition, further confirmed that we have successfully prepared g-C 3 N 4 /7Ag/m-CeO 2 composite photocatalyst.Compared g-C 3 N 4 /7Ag/m-CeO 2 with pure material (g-C 3 N 4 and m-CeO 2 ), the binding energies position of C 1s, N1s, O 1s and Ce 3d in pristine materials (g-C 3 N 4 and m-CeO 2 ) is changed, it is effectively reflecting the interfacial interaction between g-C 3 N 4 and m-CeO 2 , also suggesting that the heterostructure is obtained 58.In order to further confirm the heterostructure of composite photocatalyst, the LSV test was applied to evaluate the change separation performance, the result shows in Fig. S2.It can be clearly found that the photocurrent density is gradually improved with the increasing the applied potential.Compared the photocurrent density change, the g-C 3 N 4 /7Ag/m-CeO 2 shows small photocurrent density at the same applied potential.The reason can be attributed to the low separation of photogenerated photoelcetrons and holes in the interior electric field of space charge layer, and the phenomenon is effectively identified that the hetrostructure is formed in the composite photocatalyst 59,60. Raman spectroscopy of m-CeO 2 , 7Ag/m-CeO 2 and g-C 3 N 4 /7Ag/m-CeO 2 were performed to analyze the chemical bonds and surface defect states of the prepared photocatalyst.The results are shown in Fig. 5.According to the Raman spectrum of m-CeO 2 , the peak at 460 cm -1 belongs to the Ce-O bond stretching vibration mode in m-CeO 2 , and the weaker peak at 600 cm -1 is caused by the oxygen vacancies in m-CeO 2 44.In addition, the strong diffraction peaks at 1562 cm -1 , 1320 cm -1 in 7Ag/m-CeO 2 is attributed to Ag 61.Moreover, it can be clearly seen that the sharp peaks of the Ce-O bond in m-CeO 2 occur simultaneously in the Raman spectra of 7Ag/CeO 2 and g-C 3 N 4 /7Ag/m-CeO 2 .While, the weaker peak of CeO 2 at 600 cm -1 is not obvious in the composite photocatalysts, which may be due to the g-C 3 N 4 covering the surface of 7Ag/m-CeO 2 , resulting in the weak peak strength here. EPR is the magnetic resonance produced by the magnetic moment of the electron spin and the magnetic moment of the electron orbit.Therefore, if materials containing unpaired electrons are placed in a magnetic field, they will be deflected under the action of the magnetic field and generate signals.To further identify the oxygen vacancies in m-CeO 2 and g-C 3 N 4 /7Ag/m-CeO 2 , EPR technology is a way to determine the presence of oxygen vacancies in m-CeO 2 and g-C 3 N 4 /7Ag/ m-CeO 2 .In Fig. 6, there is a signal at 3515 G.According to the following equation calculate the free electron value (g e ). e where, stands for Bohr magneton (9.27410 10 -21 erg/H), r is resonance field strength, h is Planck's constant (6.26620 10 -27 erg/s), v is microwave frequency 62.The g e of m-CeO 2 and g-C 3 N 4 /7Ag/m-CeO 2 is 2.002 calculated by the g Hr hv / e , confirmed that m-CeO 2 and g-C 3 N 4 /7Ag/m-CeO 2 both contained oxygen vacancies. Larger specific surface area of photocatalysts is beneficial to the reaction.Therefore, N 2 adsorption/desorption isotherm curves to explore the specific surface area and the BJH curves to investigate the pore size distribution trait over prepared samples.The results are shown in Fig. 7.According to the international association of purification and applied chemistry 63, all samples showed a typical type IV isotherm with a H3 hysteresis loop at a relative pressure of 0.4-1.0(P/P 0 ), which indicates that the prepared photocatalysts have mesoporous structure.In addition, the specific surface area of m-CeO 2 , 7Ag/ m-CeO 2 and g-C 3 N 4 /7Ag/m-CeO 2 photocatalysts are 150.79m 2 /g 147.81 m 2 /g and 162.13 m 2 /g, respectively.Compared with m-CeO 2 and 7Ag/m-CeO 2 , g-C 3 N 4 /7Ag/m-CeO 2 has a larger specific surface area that can be absorb more CO 2 , and can provide more reaction sites for CO 2 photocatalytic, promoting efficient reaction.Fig. 7(b) is the pore size distribution of m-CeO 2 , 7Ag/m-CeO 2 and g-C 3 N 4 /7Ag/m-CeO 2 .It can be seen that the m-CeO 2 and 7Ag/m-CeO 2 have similar pore size distribution features, which are centered around at 3.25 nm and 3.49 nm, respectively.It shows that the introduction of Ag nanoparticles does not change the m-CeO 2 characteristic.When g-C 3 N 4 is introduced into 7Ag/m-CeO 2 system, the pore size distribution is centered about at 3.64 nm, indicating that the existence of g-C 3 N 4 not change the mesoporous properties of the 7Ag/m-CeO 2 composite photocatalyst.Based above discussion, the mesostructured m-CeO 2 , 7Ag/ CeO 2 , and g-C 3 N 4 /7Ag/m-CeO 2 samples are successfully constructed. Optical absorption properties of m-CeO 2 , 7Ag/m-CeO 2 and g-C 3 N 4 / 7Ag/m-CeO 2 photocatalysts were characterized by solid ultraviolet diffuse reflectance spectra.The results are shown in Fig. 8(a).It is can be acknowledged that the adsorption edge of m-CeO 2 is about 412 nm and the adsorption edge of g-C 3 N 4 is about 450 nm.Compared with the property of m-CeO 2 and 7Ag/m-CeO 2 , the light absorption of the ternary composite photocatalyst coated by g-C 3 N 4 is slightly enhanced.Notability, the introduction of Ag to m-CeO 2 , the 7Ag/m-CeO 2 and g-C 3 N 4 /7Ag/m-CeO 2 exhibits a broad absorbance region approximately in 470 nm, which is attributable to the SPR of Ag nanoparticles.The band gap energy of semiconductor photocatalysts is calculated by Kubelka-Munk equation: 64.Where is the absorption coefficient, A is constants, hv is the energy of the phonon, E g is the band gap energy of semiconductor, n 4 when the type of semiconductor is direct semiconductor.Since m-CeO 2 and g-C 3 N 4 are direct bandgap semiconductors.The band energy gap (E g ) of m-CeO 2 , 7Ag/m-CeO 2 and g-C 3 N 4 /7Ag/m-CeO 2 are 3.01 eV, 2.75 eV and 2.54 eV, respectively, shown in Fig. 8(b). Fig. 9 shows the transient photocurrent and electrochemical impedance of photocatalyst m-CeO 2 , 7Ag/m-CeO 2 and g-C 3 N 4 /7Ag/m-CeO 2 .As can be seen from Fig. 9(a), compared with m-CeO 2 and 7Ag/ m-CeO 2 photocatalysts, the g-C 3 N 4 /7Ag/m-CeO 2 composite photocatalyst possesses the strongest photocurrent signal, which is ascribed to that Ag has a good conductivity 61, which can promote the electron transfer between m-CeO 2 and g-C 3 N 4 , reducing the photogenerated electrons and holes of composite photocatalyst.Fig. 9(b) is the EIS impedance spectra of m-CeO 2 , 7Ag/m-CeO 2 and g-C 3 N 4 /7Ag/m-CeO 2 photocatalysts.In all EIS curves, the g-C 3 N 4 /7Ag/m-CeO 2 has the smallest arc radius, which indicates that g g-C 3 N 4 /7Ag/m-CeO 2 composite photocatalyst can rapidly transfer photogenerated carriers, producing high photocatalytic activity.Ag, as a connector between m-CeO 2 and g-C 3 N 4 , shuttled electrons between the two semiconductors, which is conducive to the transfer and separation of photogenerated carriers and prolongs their life, thereby improving photocatalytic activity of obtained photocatalyst.More importantly, the binding capacity between Ag and CO is weaker than other materials, which is conducive to desorption of CO from the surface of Ag 65.Overloaded Ag particles on the surface of m-CeO 2 , which is not conducive to electron separation and transfer, decreasing photocatalytic activity.At the last, the liquid products were detected by (GC-7920, China) FID-II detector, the results are shown in Fig. S3, it indicates that CH 3 OH is the liquid product. Stability and durability are vital issues to evaluate the performance of photocatalysts.To study the durability of g-C 3 N 4 /7Ag/m-CeO 2 , we conducted five-run cycling experiments of g-C 3 N 4 /7Ag/m-CeO 2 , shown in Fig. 10(a).Fig. 11(a) shows the yield of photocatalytic conversion of CO 2 by g-C 3 N 4 /7Ag/m-CeO 2 composite photocatalyst for five consecutive times under UV-light irradiation.In Fig. 11(a), the yield of CO is 13.96 mol/g (photocatalytic efficiency is 90.9), and the yield of CH 4 is 7.38 mol/g (photocatalytic efficiency is 92.1) after five cycles of experiments.Compared with the yield of the first time, the fifth photocatalytic performance does not change significantly, which indicates that g-C 3 N 4 /7Ag/m-CeO 2 still has the ability of photocatalytic conversion of CO 2 after five cycles.Fig. 11(b) presents the XRD patterns of the g-C 3 N 4 /7Ag/m-CeO 2 composite photocatalyst before and after the five-cycle times.It can be clearly seen that the characteristic peaks of the composite photocatalyst before and after the reaction do not change significantly, indicating that the synthesized composite photocatalyst has good performance of CO 2 photoconversion. To better demonstrate the process of photocatalytic CO 2 conversion, we proposed the possible mechanism, the schematic illustration as displayed in Fig. 12.The E g of m-CeO 2 and g-C 3 N 4 is 3.01 eV and 2.75 eV, respectively.The 2.56 eV and 1.45 eV belong to the VB position of m-CeO 2 and g-C 3 N 4 shown in Fig. S4, respectively.Based on the equation of g , the CB position of m-CeO 2 and g-C 3 N 4 are -0.45eV and -1.30 eV, respectively, which are negative than the reduction potentials of the formation of CH 4 , CH 3 OH and CO.There will generate the electron-hole pairs in m-CeO 2 and g-C 3 N 4 under the UV-irradiation.Under reducing conditions, O vacancies start to form on the surface, which accompanies the reduction of neighboring Ce 4 ions to Ce 3 .This reduction is believed to facilitate oxygen vacancy formation 66.Moreover, Ce 3 and O vacancies can behave as the active sites for many catalytic reactions 676869.As well known that the reduction potential of Ce 3 /Ce 4 is 1.44 eV (NHE, at PH 7) 70.Besides, many researchers also reported that Ce 4 can trap photo-excited electrons on the interface, and Ce 3 can react with gas-phase CO 2 to generate CO 2 ,which can be further reduced to CO, CH 707172.TEOA was used as electrons sacrificial agent to reduce the recombination probability of photoexcited electrons and holes.Ag nanoparticles deposited between the surface of g-C 3 N 4 and m-CeO 2 can accelerate electrons transfer due to its better resistivity.Partial e - transferred from g-C 3 N 4 conduction band were transferred to the m-CeO 2 conduction band through Ag to participated in the CO 2 reduction, and the remaining electrons directly participated in the photocatalytic reaction of CO 2 .Ag nanoparticles deposited on the surface of m-CeO 2 serve as the terminal receptors of photoexcited electrons, extending the life of photogenerated electrons and promoting charge separation in composite materials.Photocatalytic reduction of CO 2 is a multi-electron process, and the formation of one molecule of CO and one molecule of CH 4 requires two and eight electrons 73, respectively.Based on the above discussion and analysis, the possible processes can be followed the reactions of 4.1 to 4.11:"
  },
  {
    "title": "Conclusions",
    "content": "The g-C 3 N 4 /7Ag/m-CeO 2 composite photocatalyst was successfully prepared by photodeposition and calcination pathway.SEM, TEM and HRTEM images show that Ag nanoparticles are randomly distributed on the surface of m-CeO 2 , and g-C 3 N 4 successfully coated onto Ag/m-CeO 2 composite photocatalyst.When the loading of Ag is 7 wt, the photocatalytic activity of the binary composite photocatalyst is the best, and the yield of CO and CH 4 are 13.94 mol/g and 7.39 mol/g, respectively.Ag acts as the bridge for g-C 3 N 4 and m-CeO 2 electron transport during the reaction, increasing the migration rate and electron utilization of photogenerated carriers, enhancing photocatalytic activity.In addition, the coating of g-C 3 N 4 nanosheets can inhibit the photocorrosion of Ag to some extent, and the photoconversion of g-C 3 N 4 / 7Ag/m-CeO 2 shows higher than that of bare m-CeO 2 .In this work, m-CeO 2 combined with g-C 3 N 4 and Ag, which may offer an alternative way to develop high-efficient and low-cost CO 2 photoreduction photocatalysts. Huiqin Wang and Pengwei Huo: Relationship among the structural, textural, optical, electrochemical properties; Jingru Guan: XPS, Preparation of photocatalyst and the photocatalytic activity; Jinze Li and Xin Li: AFM and Photoelectrochemical measurement; Changchang Ma: Raman spectroscopy and DRS; Yongsheng Yan: Discussion the photocatalytic processes.All authors participated on the preparation of manuscript. The authors declared that there is no conflict of interest. Fig. 1.(a) Low-angle XRD paterns and (b) wide-angle XRD paterns of as-synthesized different samples. Fig. 2. SEM images of (a) SBA-15, (b) m-CeO 2 , (c) 7Ag/m-CeO 2 , (d, e) g-C 3 N 4 /7Ag/m-CeO 2 .The SEM-EDS of g-C 3 N 4 /7Ag/m-CeO 2 . (a) is the survey spectra of g-C 3 N 4 /7Ag/m-CeO 2 , g-C 3 N 4 and m-CeO 2 .It is clearly seen that C, N, O, Ce and Ag elements are contained in g-C 3 N 4 /7Ag/m-CeO 2 composite; C and N elements, O and Ce belong g-C 3 N 4 and m-CeO 2 , respectively.The C 1s spectrum of g-C 3 N 4 can be deconvoluted into three main peaks at 284.64 eV, 286.28 eV and 288.23 eV corresponding to g-C 3 N 4 typical C-NH 2 , CeN) 3 and NeCN groups Fig. 4. XPS spectra of as-synthesized photocatalyst samples (a) survey, (b) C 1s, (c) N 1s, (d) O 1s, (e) Ce 3d and (f) Ag 3d. Fig.10shows the yield of CO and CH 4 converted from CO 2 by different photocatalysts under UV-light irradiation for 10 h.It is obviously seen that composite photocatalysts present excellent photocatalytic activity than that of m-CeO 2 .The result shows that the yields of CO and CH 4 are up to 15.36 mol/g and 8.02 mol/g for g-C 3 N 4 /7Ag/CeO 2 , respectively.For bare m-CeO 2 , the generation of CO and CH 4 reach to Fig.7.The N 2 adsorption/desorption isotherm curves of m-CeO 2 , 7Ag/m-CeO 2 and g-C 3 N 4 /7Ag/m-CeO 2 photocatalysts (a) and corresponding pore size distribution curves (b). Photocurrent (A/cm2 ) Fig. 9. (a) The transient photocurrent spectra and (b) corresponding EIS Nyquist plots of m-CeO 2 , 7Ag/m-CeO 2 and g-C 3 N 4 /7Ag/m-CeO 2 photocatalyst, respectively. Fig. 11.g-C 3 N 4 /7Ag/m-CeO 2 composite photocatalyst five-cycle experimental diagram (a) and XRD patterns before and after the fifth cycle. Fig. 12. Schematic illustration of g-C 3 N 4 /7Ag/m-CeO 2 composite photocatalyst for CO 2 photoconversion under UV-light irradiation. EO 20PO 70EO 20, 5800) and TEOS were purchased from Sigma-Aldrich Reagent Co., Ltd.HCl (36-38), vitamin C, sodium hydroxide (NaOH, AR), triethanolamine (TEOA, AR) and urea (CON 2 H 4 , CR) were get from Sinopharm Chemical Reagent Co., Ltd.Cerium nitrate hexahydrate (Ce(NO 3 ) 3 6H 2 O, AR), polyvinylpyrrolidone (PVP, k30, AR) and silver nitrate (AgNO 3 , AR) were purchased from Aladdin Chemical Reagent Co. Ltd. 1.04 mol/g and 0.64 mol/g, respectively.The yields of other photocatalysts of CO can reach 6.95 mol/g, 9.13 mol/g, 11.00 mol/g, 13.44 mol/g and 11.44 mol/g for 1Ag/m-CeO 2 , 3Ag/m-CeO 2 , 5Ag/ m-CeO 2 , 7Ag/m-CeO 2 and 9Ag/m-CeO 2 , respectively.Besides, 2.63 mol/g, 5.01 mol/g, 5.31 mol/g, 6.90 mol/g and 6.11 mol/g of CH 4 are generated after irradiation for 10 h.The results demonstrate that as the Ag load increases, the photocatalytic activity of binary composite photocatalysts gradually increases and then decreases.When the loading of Ag is 7 wt, the binary photocatalyst has superior photocatalytic activity.The reason can be ascribed to Ag particles are formed on the surface of m-CeO 2 . We gratefully acknowledge the financial support of the National Natural Science Foundation of China (Grant No. 21776117), China Postdoctoral Science Foundation (2017M611734), Six talent peaks project in Jiangsu Province (Grant No. XCL-014). Supplementary data to this article can be found online at https:// doi.org/10.1016/j.apsusc.2019.144931."
  }
]