[
  {
    "title": "Doi",
    "content": "10.1039/c1jm12717a"
  },
  {
    "title": "Article_Title",
    "content": "Synthesis and deposition of ultrafine Pt nanoparticles within high aspect ratio TiO2 nanotube arrays: application to the photocatalytic reduction of carbon dioxide"
  },
  {
    "title": "Abstract",
    "content": "Using a rapid microwave-assisted solvothermal approach ultrafine Pt nanoparticles are synthesized and deposited in situ within high aspect ratio nanotube arrays.Adjusting the initial concentration of metal ion precursor inside the nanotube support controls the resulting Pt nanoparticle sizes.The Ptnanoparticle/TiO 2 nanotube composite is shown to greatly promote the photocatalytic conversion of carbon dioxide and water vapor into methane, a behavior attributed to the homogeneous distribution of metal co-catalyst nanoparticles over the TiO 2 nanotube array surface providing a large number of active reduction sites.The novelty and flexibility of the technique, described herein, could prove useful for the deposition of metal, metal alloy, or metal oxide nanoparticles within a variety of nanotubular or nanoporous material systems with the resulting nanocomposites useful in catalysis, photocatalysis, photovoltaic, and photoelectrochemical applications."
  },
  {
    "title": "Experimental",
    "content": "TiO 2 nanotube arrays were prepared by anodic oxidation of titanium foil in an electrolyte consisting of 0.3 (wt) ammonium fluoride in 3 vol water containing ethylene glycol electrolyte at 55 V. 20 Nanotube array samples of 30 mm in length were prepared by 7 h anodization.The average inner pore diameter of the nanotube arrays, estimated from FE-SEM images, was about 70 nm with a wall thickness of about 20 nm.Debris formed during the anodization process was removed by ultrasonic agitation.The as-prepared amorphous samples were crystallized by annealing at 540 C for 3 h in an oxygen atmosphere.Pt nanoparticle loading was performed via a microwave assisted solvothermal method by using a MARS-5 microwave digestion system operated at a frequency of 2.45 GHz with a power of 300 W. Pt/TiO 2 composites or bare TiO 2 nanotubes of 2 cm A 1 cm size were loaded into a stainless steel reaction chamber having a quartz window through which the sample can be exposed to light.After a sample was loaded into the reaction chamber, the 7.56 cm 3 chamber was evacuated to 10 A3 Torr, after which carbon dioxide (99.99), ultra-high purity Helium (how many 99.999), or Argon (99.99) with a flow rate of 500 sccm (standard cubic centimetres per minute) were passed though a bubbler containing deionized water before entering the reaction chamber.After the chamber was flushed for 10 min both inlet and outlet valves were closed maintaining a nominal excess pressure of less than 1.0 psi.Under test, the samples within the reaction chambers were exposed to AM 1.5G sunlight (100 mW cm A2 ) for one hour; the equilibrium temperature of the chamber under test was about 43 AE 3 C. Reaction products were analyzed using a Shimadzu gas chromatograph (GC-17A) equipped with flame ionization and thermal conductivity detectors."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The strategy used to uniformly load Pt nanoparticles along the nanotubes walls is depicted in Fig. 1a.Crystallized nanotube arrays were first loaded into the H 2 PtCl 6 precursor methanol solution; the nanotube array sample was loaded upside down (within a Teflon reaction vessel) in order to avoid physical deposition of metal particles formed during the following microwave process.The samples were left inside the reaction chamber with solution overnight.The reaction chamber temperature was then raised to 120 C within 5 min, and kept at this temperature for 20 min.After the chamber was cooled down to room temperature, the samples were removed, washed with DI water several times, and dried under nitrogen flow. Fig. 1b is a field emission scanning electron microscope (FESEM) image of a typical nanotube array sample in crosssection.Fig. 1c is a FESEM top surface image of the nanotube array sample loaded with Pt metal nanoparticles from a 0.15 mM Pt 4 precursor solution (Sample 2).As can be observed in Fig. 1c, the morphology of the TiO 2 nanotubular arrays remains unaltered after the nanoparticle deposition.The microwave assisted solvothermal process used for the synthesis results in uniformly distributed and well separated Pt nanoparticles.X-Ray diffraction spectra of the bare TiO 2 and Pt/TiO 2 nanotube arrays are shown in Fig. 1d.The diffraction peaks can be clearly recognized at about 39 and 46 corresponding to Pt (111) and Pt (200), respectively, characteristic of face-centered cubic crystalline Pt.Transmission electron microscopy (TEM) measurements were carried out to obtain size and spatial distribution of the Pt nanoparticles throughout the TiO 2 nanotube array surface.Fig. 2a is a TEM image of a Pt/TiO 2 nanotube array sample at low magnification; the typical tubular nanostructure can be clearly distinguished.To determine whether the metal nanoparticles are distributed along the nanotube length, TEM images at higher magnification were taken from the middle of a 15mm long fragment of the nanotube array as indicated by the circled area in Fig. 2a.As can be observed from Fig. 2b (dark field STEM) and Fig. 2c (bright field TEM), the Pt nanoparticles are deposited along the TiO 2 nanotube wall at least 15 mm from the surface.A histogram of the Pt nanoparticle diameters determined from TEM images is shown in Fig. 2d, indicating a diameter range of 1.8 to 4.9 nm and an average of 3.4 nm.To the best of our knowledge these findings indicate, for the first time, a uniform dispersion of ultrafine nanoparticles inside and throughout a TiO 2 nanotube array support. Various polyols, such as ethylene glycol, diethylene glycol or a mixture of both have been used as solvents and reducing agents during solvothermal and microwave assisted solvothermal processes. 383994041 However these solvents, due to their high boiling points and viscosity, are difficult to remove from the nanotube arrays after the experiment.Consequently we used methanol 42 as both a solvent and a reducing agent.The possible mechanism by which polyols reduce metal ions has been described by Fievet as nucleation and growth, 41 and a similar mechanism may be operative in this methanol based technique.Methanol can easily access the nanotube wall where it can reduce individual Pt 4 ions.Each reduced atom then likely acts as a nucleus for other reduced atoms to grow around it, coalescing to form metal clusters and from there nanoparticles.Continued growth of the metal nanoparticles is restricted due to the limited amount of metal ion precursor inside the nanotube.We note that in a comparable experiment using a plain glass substrate (no nanotubes), metal clusters or nuclei were formed on the glass freely growing to diameters of several microns. Adjusting the metal ion precursor concentration controls nanoparticle size.When the nanotube array samples were processed in a Pt 4 ion concentration solution of 0.3 mM the resulting Pt particle size increased to an average value of 4.5 nm (Sample 3) as determined by TEM analysis as shown in Fig. 3a and3b.When the Pt 4 ion precursor concentration was reduced to 0.075 mM, the Pt particle size decreased to an average value of 2.19 nm (Sample 1), see TEM image Fig. 4a and size distribution histogram Fig. 4b.This size controllable in situ uniform growth of nanoparticles onto the nanotube walls provides a direct charge transport path between Pt and TiO 2 , facilitating their practical photoelectrochemical application.To that end, the Pt/TiO 2 nanocomposite was used to photocatalytically convert CO 2 and water vapor into methane.A Pt/TiO 2 nanotube composite, (Sample 2) of 2 cm A 1 cm size was loaded into a stainless steel reaction chamber having a quartz window through which the sample was exposed to AM 1.5 sunlight (100 mW cm A2 ).A control experiment was designed to demonstrate that the measured methane is a result of photoconversion of CO 2 and not due to hydrocarbon out-gassing attributable to methanol processing; a Pt/TiO 2 nanotube composite (Sample 2) was loaded into a reaction chamber containing only argon (99.99) and water vapor.In order to assess the importance of the Pt co-catalyst, a bare TiO 2 nanotube array was also tested in a CO 2 /H 2 O environment.Fig. 5 shows the methane generation rates of bare TiO 2 nanotubes in carbon dioxide/water vapor, and the Pt/TiO 2 nanocomposite in carbon dioxide/water vapor as well as Pt/TiO 2 nanocomposite in argon/water vapor environment.In the case of Pt loaded TiO 2 , it is generally believed that electron and hole pairs will be generated upon light irradiation.The photo-generated hole inside TiO 2 diffuses to the surface and oxidizes adsorbed water molecules forming hydrogen ions, while the photoexcited electron is trapped by the Pt particles where the reduction reaction of surface absorbed species takes place. 43For photocatalytic reduction of carbon dioxide, a likely process is: CO 2 is first reduced to CO at the Pt sites, 44 while at the same time hydrogen ions obtained via water oxidation are reduced to atomic hydrogen.Then the as-formed CO reacts with atomic hydrogen to form methane and other hydrocarbons.In our experiment only methane and trace amounts of ethane were found as the reaction products as determined by gas chromatography.Without Pt loading, the reaction produced no significant amounts of hydrocarbons, 3 ppm of methane, a level within the noise level of our measurements with small amounts of hydrocarbons arising from the residual air in the syringe used for extraction in the gas sample analysis.Bare TiO 2 cannot effectively convert carbon dioxide into hydrocarbons without an appropriate co-catalyst.After Pt loading, a photocatalytic methane production rate from the CO 2 /water vapor atmosphere of about 25 AE 4 ppm/(cm 2 h), or (36 AE 6 mL g A1 h), was obtained.To confirm that the observed methane comes from CO 2 , an identical Pt sensitized sample (2 cm A 1 cm) was measured in an argon/water vapor environment; after one hour of solar light exposure only 4 ppm methane was obtained.The methane production can be ascribed to: (1) the homogeneous distribution of Pt co-catalyst nanoparticles over the nanotube array surface that provides maximum number of active reduction sites, and (2) the thin tube half wall thickness (10 nm) that enables efficient diffusion of photoexcited holes to the surface."
  },
  {
    "title": "Conclusions",
    "content": "In summary, for the first time a uniform dispersion of ultrafine Pt nanoparticles along the length of a long, i.e. several tens of microns, TiO 2 nanotube support is realized via a rapid microwave-assisted solvothermal approach.Nanoparticle size is controlled by adjusting the concentration of the metal ion precursor.The described technique should prove effective for deposition upon a variety of semiconductor nanoporous or nanotube compositions, with different metal, metal alloy or metal oxide nanoparticles, the resulting materials of which should have great use in catalysis and photoelectric conversion applications.Pt is known to be more effective at reducing water for hydrogen generation, whereas Cu is likely to be more active in reducing CO 2 .Hence, an appropriate dispersion (side by side) of Cu and Pt co-catalysts on the nanotube array surface is expected to carry out the partial reactions and subsequent hydrocarbon formation at much higher rates. Fig. 1 (a) Depiction of in situ deposition of ultra-fine Pt nanoparticles inside the nanotubes.(b) FESEM image of self-organized TiO 2 nanotube arrays, perpendicularly oriented from the substrate, with a length of z 30 mm.The insert is a FESEM image at a higher magnification.(c) Top view image of Pt loaded TiO 2 nanotube arrays.(d) XRD patterns of TiO 2 nanotube and Pt-nanoparticle/TiO 2 nanotube composite. Fig. 2 (a) Bright field TEM image and (b) dark field STEM image of Pt nanoparticle loaded (Pt 4 0.15 mM) TiO 2 nanotube arrays (c) bright field TEM image of the region circled in (a), and (d) size histogram of Pt nanoparticles determined from TEM images. Fig. 3 (a) A typical TEM image of Pt nanoparticle loaded TiO 2 nanotube arrays (Pt 4 0.3 mM); (b) size histogram of Pt nanoparticles analyzed from TEM images. Fig. 4 (a) A typical TEM image of Sample 1, when the Pt 4 ion precursor concentration is 0.075 mM; (b) histogram of the diameter of Pt nanoparticles determined from TEM measurement. Fig. 5 Methane production rates from bare TiO 2 nanotube and Pt-TiO 2 nanotube composite (Sample 2, Pt 4 0.15 mM) in carbon dioxide/water vapor and argon/water vapor environments. Published on 01 August 2011.Downloaded by University of Illinois -Urbana on 16/06/2013 04:39:14.View Article Online Partial support of this work through the Department of Energy, Grant No. DE-SC0001087, is gratefully acknowledged."
  }
]