[
  {
    "title": "Doi",
    "content": "10.1016/j.materresbull.2020.110926"
  },
  {
    "title": "Article_Title",
    "content": "Synthesis of nanosized Ag-modified 2D/2D hydroxylated g-C3N4/TS-1 Z-scheme nanocomposites for efficient photocatalytic CO2 reduction"
  },
  {
    "title": "Abstract",
    "content": "It is significant to enhance the charge separation and extend the visible-light range for the TS-1 molecular sievebased photocatalysts to improve the photocatalytic performance for CO 2 reduction reaction (CO 2 RR).Here, dimension-matched 2D/2D hydroxylated g-C 3 N 4 /TS-1 (hCN/TS-1) nanocomposites have been successfully fabricated and further modified by nanosized Ag by the photoreduction method.The optimum Ag-modified hCN/TS-1 exhibits 7-time CO 2 conversion than that of 2D TS-1.Based on the surface photovoltage responses, monochromatic photocurrent action spectra and electrochemical reduction curves, it is confirmed that the exceptional photoactivity is attributed to the greatly-enhanced charge separation via the Z-scheme mode between hCN and TS-1 at intimately-connected interfaces, extended visible-light absorption endowed by hCN, and Ag nanoparticles as the effective electron capturers with favorable catalytic function for activating CO 2 molecules.This work showcases an effective and feasible design strategy to fabricate highly effective TS-1 molecular sievebased photocatalysts for practical application."
  },
  {
    "title": "Experimental",
    "content": "All chemicals and reagents used in this work were of analytical grade and used as received without further purification.Deionized (DI) water was used throughout for all types of experiments. The synthetic procedures for TS-1 nanosheets mainly refer to the previously reported work in our group 24. Firstly, melamine (10 g) and cyanuric acid (4 g) were dispersed in 500 mL DI water.The mixed suspension of cyanuric acid and melamine was stirred for 3 h at 80 C, then cooled to room temperature, centrifuged at 4000 rpm for 15 min, washed with DI water/ethanol for several times, and dried overnight at 80 C.The obtained dried powder was transferred into a closed quartz boat and heated from room temperature to 550 C with a heating rate of 5 C min -1 under air atmosphere.The primary porous CN sample was obtained after calcination for 4 h.The secondly-calcined porous CN sample was obtained by heating primary porous CN sample in semiclosed porcelain boat at 500 C for 2 h under air atmosphere.After natural cooling, the obtained fluffy CN was treated by 150 mL of 2 M HNO 3 .Then the solid was obtained after centrifuging, washing to neutral and drying processes to result in CN nanosheets.The surface hydroxylation of CN nanosheets was performed by ultrasonically treating 0.2 g of the synthesized pristine CN with 30 mL of aqueous H 2 O 2 solution (10 wt) under ultrasonic (FS20, Fisher Scientific) for 1 h.Furthermore, the sample was filtered and washed thoroughly with DI H 2 O and then dried at 60 C for 24 h. To fabricate CN/TS-1 nanocomposites, for each sample, 1 g of TS-1 was dispersed in a mixture of 20 mL of ethanol and 5 mL of DI water. Then different mass ratio percentage (i.e., 2, 5, 10, and 15) of CN nanosheets were also dispersed separately as that of TS-1 then added to each sample and kept under vigorous stirring and sonication separately for 2 h.After that, each sample was dried in oven at 80 C under continuous stirring and finally calcined at 500 C for 2 h with a heating rate of 2 C min -1 .As-obtained samples are noted as XCN/TS-1, (X indicates the loading amount by weight).Besides, 10hCN/TS-1 was synthesized as the same procedure only replacing CN with hCN. Metallic Ag with different mass ratio (i.e., 1, 1.5, and 2) was deposited onto 10hCN/TS-1 by the photoreduction method.In the first step, the desired amount of AgNO 3 and 1 g 10hCN/TS-1 were dispersed in a mixed solution of 50 mL methanol and 100 mL DI water in a 250 mL beaker covered with a sealing film.Then the samples were treated separately by sonication and stirring for 10 min.Furthermore, nitrogen gas was bubbled through the samples for 1 h to generate an inert atmosphere for the photodeposition of Ag nanoparticles.Then irradiated under a 300 W xenon lamp with a 420 nm cut-off filter for 3 h, under vigorous stirring.Finally, the samples were centrifuged and washed for three times with DI water followed by absolute ethanol, dried in air at 80 C, and finally samples were calcined for 40 min at 350 C.As-obtained samples are denoted as YAg/10hCN/TS-1 (Y indicates the loading amount by weight) The Powder XRD on an X-ray diffractometer (XRD) accomplished on a (Bruker D8, Germany) Advance diffractometer using Cu K radiation ( 0.15418 nm), at an accelerating voltage of 30 kV while the emission current of 20 mA was employed.The UV-vis diffuse reflectance spectra (UV-vis DRS) spectra were measured with a Shimadzu UV-2550 spectrometer using BaSO 4 as a standard.The morphology and structure of the samples were examined by Electron micrographs were taken on a JEOL JEM-2100 TEM operated at 200 kV while scanning electron microscopy (SEM) was performed on a Hitachi S-4800 microscope.The Brunauer-Emmett-Teller (BET) surface areas and average pore sizes of the samples were obtained by the Micromeritics Tristar II 3020 system (Atlanta, GA, USA).The samples had been degassed in the flow of N 2 at 180 C for 3 h prior to measurements.For the evaluation of the BET surface area ST-2000 constant volume adsorption apparatus was utilized.UV Raman spectra were recorded on a homemade UV-Raman spectrometer using a Jobin-Yvon T64000 triple-stage spectrograph with a spectral resolution of 2 cm -1 .The 290 nm line from a Coherent Innova 300 Fred laser was used as an excitation source.The power of the 290 nm line at samples was below 1.0 mW.Fourier transformed infrared (FT-IR) spectra of the samples were recorded on an FT-IR spectrometer (Nicolet Nexus 870) with a resolution of 4 cm -1 and 64 scans in the region of 4000-400 cm -1 .The steady-state surface photovoltage spectroscopy atmosphere-controlled (SPS) measurements of the samples were carried out with a home-built apparatus, equipped with a lock-in amplifier (SR830) synchronized with a light chopper (SR540, USA).The powder sample was sandwiched between two indium-tin-oxide (ITO) glass electrodes and the electrodes were kept in atmosphere-controlled sealed container.A monochromatic radiation was obtained from 500 W Xenon lamps (CHF XQ500W, Global Xenon lamp power) were passed through a double prism monochromator (SBP300) to get a monochromatic radiation. The transient-state surface photovoltage (TPV) response measurements were performed with a self-assembled device in air at room temperature, in which the sample chamber was connected to an ITO glass as the top electrode and to a steel substrate as the bottom electrode, and about 10 mm thick mica spacer was placed between the ITO glass and the sample to decrease the space charge region at the ITO sample interface.The samples were excited by a 355 nm laser radiation with 10 ns pulse width from a second harmonic Nd:YAG laser (Lab-130-10H, Newport, Co.).The laser intensity was modulated with an optical neutral filter and measured by a high energy pyroelectric sensor (PE50BF-DIFC, Ophir Photonics Group).The signals were registered by a 1 GHz digital phosphor oscilloscope (DPO 4104B, Tektronix) with an amplifier at the aid of a computer.The compositions and elemental states of the samples were confirmed through X-ray photoelectron spectroscopy (XPS) using a Kratos-Axis Ultra DLD apparatus with an Al (mono) X-ray source.During the measurement, process the binding energies of the samples were calibrated with respect to the signal for adventitious carbon with binding energy equal to 284.55 eV. The sample (0.05 g) was dispersed in 50 mL coumarin aqueous solution (0.001 M) in a beaker.Prior to irradiation, the reactor was magnetically stirred for 10 min to attain an adsorption-desorption equilibrium in dark.After irradiation for 1 h with a 150 W Xenon lamp (GYZ220 made in China), the sample was centrifuged, and then a certain volume of solution was transferred into a Pyrex glass cell for the fluorescence measurement of 7-hydroxycoumarin at 332 nm excitation wavelength with an emission peak wavelength at 460 nm through the above mentioned spectrofluorometer. PEC and EC measurements were performed in a traditional 3-electrode system.Prepared sample was used as the working electrode, a plate of platinum (99.9) was utilized as the counter electrode, a saturated KCl Ag/AgCl electrode was employed as the reference electrode, and 0.5 M Na 2 SO 4 solution as the electrolyte.Highly pure nitrogen gas (99.999) was bubbled through the electrolyte before and during the whole experimental procedure.PEC experiments were accomplished in a quartz cell using a 500 W xenon lamp as an enlightenment source.An IVIUM V13806 electrochemical workstation was employed to test photoelectrochemical and electrochemical performance of a series of catalysts.Electrochemical impedance spectroscopy (EIS) measurement was performed using a three-electrode configuration and carried out over the frequency range from 10 -2 to 10 5 Hz with amplitude of 10 mV (RMS) at the bias of 0.4 V.All the experiments were accomplished at room temperature (about 25 C). The CO 2 -TPD for desorption of CO 2 were performed by apparatus monitored Chemisorption Analyzer, TP 5080 Chemisorb which were equipped with a thermal conductivity detector.For each typical performance, about 50 mg of the sample was preheated at 300 C for 60 min to remove adsorbed gases including H 2 O molecules and then cooled down to 30 C under the ultrapure He with the flow rate of 30 mL min -1 .Subsequently highly pure O 2 gas was introduced at a 30 C with the O 2 flow rate of 40 mL min -1 for 6 min.The excess weakly physically adsorbed O 2 was then removed by exposure in the ultrapure He flow with the flow rate of 30 mL min -1 at 30 C for 60 min.Then the temperature was increased to 700 C with the heating rate of 10 C min -1 under the He flow rate of 30 mL min -1 . The sample (0.1 g) was dispersed in H 2 O (5 mL) with continuous magnetic agitation in a cylindrical steel lined reactor with volume of 100 mL and of 3.5 cm 2 area.A 300 W Xenon arc lamp was utilized as the illuminating source.Highly pure CO 2 gas was allowed to pass through water and then entered into the reaction assembly arrangement for the attainment of ambient pressure.The photocatalyst was allowed to equilibrate in the CO 2 /H 2 O system for 1 h and followed by irradiation for 4 h.During irradiation, about 0.25 mL of gas produced was taken from the reaction chamber at various time intervals for CO and CH 4 concentration analysis using a gas chromatograph (GC-7920 with TCD, Au Light, Beijing)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Firstly, TS-1 nanosheets, as called TS-1 for short in the subsequent text, were successfully synthesized by the low-temperature hydrothermal method with the assistance of structure-directing agent.For TS-1, the XRD diffraction peaks at 7.9, 8.9, 23.2, and 24.1, are allocated to the (101), ( 200), (501), and (303) planes, respectively (Fig. S1a), as consistent with the reference 25.The major diffraction peaks of CN locates at 13.2 and 27.3, respectively.With CN loaded, no additional diffraction peaks appear for the CN/TS-1 samples, which might be due to the low content of CN.The light absorption of TS-1 is in the range of 390 nm (Fig. 1a and Fig. S1b) 26, while which is obviously enlarged as increasing CN amount to 420 nm.The 2D morphology of TS-1 nanosheets was verified by the SEM and TEM images.The SEM image of TS-1 demonstrates that it takes on a disordered assembly of thin platelets (Fig. S2a).In the TEM image, it's found that TS-1 nanosheets possess the laminar structure and the thickness of each nanosheet is about 2 nm (Fig. S2b).Moreover, the Intersheet mesopores are observable between neighboring nanosheets.The TEM image in (Fig. S2c) indicates that CN has been successfully synthesized with a silky transparent 2D morphology.For 10CN/TS-1 as representative, in the TEM image as show in (Fig. 1b), besides TS-1 semitransparent CN is observed, indicating the formation of 2D/2D heterojunction between CN and TS-1.The BET results of TS-1 have shown the specific surface area of 863.5m 2 /g with the average pore size of 5 nm (Fig. 1c).By contrast for 10CN/TS-1, with maintained hysteresis loop the BET area decreases to 778.5 m 2 /g due to the coverage of CN.Moreover, the average pore size is nearly unchanged, which is reasonable since large CN nanosheets could not enter the mesopores of TS-1.Furthermore, UV-Raman as a typical tool to analyze the framework of TS-1 is utilized to clarify the interfacial interaction of 10hCN/TS-1.27,28.As depicted in (Fig. 1d), the characteristic band of TS-1 at 1126 cm -1 is attributed to the asymmetric stretching vibration of the framework Ti-O-Si, which has strong intensity because this vibration is sensitive to the charge-transfer transition of Ti-O-Si 29.Residue bands such as the ones at 1001 and 1062 cm -1 are due to the silicate 30.For the Raman spectrum of CN in the selected wavelength range, the bands at 382, 659 and 750 cm -1 are observed.When CN was loaded on TS-1 through a dehydration process, the band of framework Ti species shows negligible shift while the silicate bands shift to 995 and 1052 cm -1 , respectively, implying the interfacial interaction between CN and TS-1.Especially, additional bands at 382, 631 and 731 cm -1 are ascribed to CN 31.By contrast, it could be inferred the interaction between CN and TS-1 leads to the band shifts of CN.Based above, 2D/2D CN/TS-1 heterojunctions have been successfully constructed.Considering the synthesis of CN/TS-1 undergoes a dehydration process and the fact that the surface hydroxyl groups of as-fabricated CN are limited, it's reasonable to hydroxylated CN to further strengthen the interfacial interaction of the heterojunctions on the basis of matched dimension.Therefore, the treatment of CN with aqueous H 2 O 2 solution (10) was performed to obtain hydroxylated CN noted as hCN 32. In the FT-IR spectra, the majority of the peaks in the range from 3000 to 3600 cm -1 for CN and hCN are derived from surficial hydroxyl groups (Fig. S3a) 33.It's obviously demonstrated that the surficial hydroxyl groups of CN were greatly enriched by the treatment of H 2 O 2 by comparison.Furthermore, the XRD patterns and DRS spectra of CN and hCN indicate except for the increase of surficial hydroxyl groups, the crystalline structure and light absorption properties of CN are well preserved (Fig. S3b andc). The photogenerated charge separation of as-fabricated nanocomposites as the main factor affecting the photoactivity was explored by the SPS technique.Generally, according to the fundamental principle of SPS method, stronger intensity response indicates better charge separation 17.As shown in (Fig. 2a), one can notice that as increasing loaded amount of CN the SPS response becomes stronger than pristine TS-1 till 10CN/TS-1 reaches the maximum.Noteworthily, after the treatment of H 2 O 2 , the response of 10hCN/TS-1 further increases, indicative of the best charge separation among tested samples due to strengthened interfacial interaction benefiting charge transfer.Moreover, to further study the charge separation, FS spectra were collected and shown in (Fig. 2a) inset.In specific, formed hydroxyl radicals ( OH) via photochemistry would react with coumarin reacts to create luminescent 7-hydroxycoumarin, which could be tested and reflected by FS.Or rather, larger response in FS indicates more produced OH radicals as commonly attributed to be proportional to the charge separation 18.Apparently, 10hCN/TS-1 shows the strongest fluorescent response, in accordance with the SPS results.Subsequently, the photocatalytic performances of all samples were evaluated for CO 2 RR under UV-vis light irradiation.As shown in (Fig. 2b), the main products are CO and CH 4 for all samples, among which 10hCN/TS-1 provides the largest product amounts.It's noted that compared with reported TiO 2 for photocatalytic CO 2 RR, the selectivity towards CH 4 for TS-1 based photocatalysts is obviously higher 34.According to above results, asconstructed 2D/2D CN/TS-1 heterojunctions, especially the ones containing hydroxylated CN, have successfully realized greatly enhanced photocatalytic CO 2 RR. As our strategy, to introduce extra catalytic centers for CO 2 RR based on the optimum 10hCN/TS-1 heterojunction might further facilitate the photocatalytic efficiency.Considering the photogenerated electrons of CN are dominantly utilized to induce the reduction of CO 2 , it's rational to locate the catalytic centers on CN instead of TS-1.Thus, the photoreduction method is adopted to load Ag nanoparticles (NPs) on 10hCN/ TS-1.In principle, under UV-light irradiation the Ag species would be mainly reduced by the photogenerated electrons of CN to form Ag NPs.With increasing the Ag amount, the diffraction peaks at 38.4 and 44.7a ppear (Fig. S4a), as assigned to the metallic Ag (JCPDS 87-0597) 35.Meanwhile, the visible light adsorption is slightly extended by introducing Ag NPs, which might be due to the surface plasmon resonance (SPR) effect to some extent (Fig. S4b) 36.In the TEM images of 1.5Ag/10hCN/TS-1 and, it's found that most observed Ag NPs locate on CN (Fig. 3a and Fig. S5) and selected Ag NP with the diameter of 10 nm is identified by the distance of 0.236 nm between the adjacent lattices corresponding to the (111) plane of Ag (Fig. 3a) 37.The XPS Ag 3d spectrum in (Fig. 3b) further verified the successful introduction of metallic Ag as indicated by the peaks at the bind energy of 367.5 and 373.5 eV 38,42.By comparing the Ti 2p, O 1s, C 1s and N 1s spectra of 1.5Ag/10hCN/TS-1 and 10hCN/TS-1, it's observed that the introduction of Ag only leads to the relatively obvious shift of N 1s peak from 398.2-397.9eV, implying the interaction between Ag and hCN in agreement with the synthetic method of loading Ag NPs (Fig. S6). The charge separation of Ag-modified samples were examined and compared with 10hCN/TS-1 as the contrast.As shown in (Fig. 4a), the SPS response of 10hCN/TS-1 is strengthened after decorating Ag NPs.By adding the introduced amount of Ag from 1 to 2 by weight, the SPS response increases and 1.5Ag/10hCN/TS-1 demonstrates the most enhanced charge separation.The FS depicted as (Fig. 4a) inset have reflected coincident results with SPS.Therefore, it's proved that the introduction of Ag NPs onto 10hCN/TS-1 do improve the charge separation, where Ag NPs on CN function as the electron capturers resulting in inhibited charge recombination.The photoactivities of Agmodified samples towards CO 2 RR were evaluated and shown in (Fig. 4b).It's found that the photoactivity is in proportion to the charge separation and 1.5Ag/10hCN/TS-1 has demonstrated the highest produced amount of CO and CH 4 .Impressively, by constructing the 2D/2D hCN/TS-1 heterojunctions with further introduction of Ag NPs the CO 2 conversion is about 7-time of that for TS-1, which affirms the effectiveness of the design strategy.Moreover, the stability of the heterogeneous photocatalysts is a vital index to evaluate their potential of application.As shown in (Fig. S7), after five runs under identical reaction conditions, the photoactivity of 1.5Ag/10hCN/TS-1 has been well maintained. Next the photocatalytic mechanism of Ag-modified 2D/2D specifically referring to the photogenerated charge kinetics and subsequent catalytic process with Ag NPs are elaborately investigated.The TPV 5a).Apparently, the intensity sequence of signals is TS-1 10hCN/TS-1 1.5Ag/10hCN/TS-1, which is in accordance with the SPS and FS results.As supplementary the Nyquist plots for EIS and I-V curves of three typical samples as shown in (Fig. S8), indicate consistent information on charge separation.The initial intention of constructing 2D/2D CN/TS-1 heterojunctions is improve the charge separation through Z-scheme.To verify this proposed charge transfer mode, the monochromatic photocurrent action spectra (MPAS) were demonstrated in (Fig. 5b), where the detected signal of current density could indicate the charge separation.It's observed that under the irradiation of 460 nm light, all three components TS-1, hCN or Ag could not be excited hence for three tested samples negligible current densities were detected.To decrease the single wavelength to 440, 420 and 400 nm, only hCN could be excited.Except for TS-1, the samples 10hCN/TS-1 and 1.5Ag/10hCN/TS-1 both exhibit minor current densities as increase as the decrease of light wavelength.In this situation, the photogenerated electrons of hCN would transfer to TS-1 and Ag NPs.Under the irradiation of 390, 380 and 360 nm, both hCN and TS-1 would be excited.For each wavelength, the sequence of current density is TS-1 10hCN/TS-1 1.5Ag/10hCN/TS-1.More importantly, the increase amplitude of current density for 10hCN/TS-1 or 1.5Ag/10hCN/TS-1 both increase with the current density of TS-1 as the benchmark when decreasing the single wavelength.For the 360 nm light, all three samples have achieved the largest current densities and 1.5Ag/10hCN/TS-1 has shown the most obvious superiority.Based on above results, it is found when hCN and TS-1 are both excited, the best charge separation is achieved instead of sole component is excited, strongly indicating Z-scheme charge transfer for the 2D/2D hCN/TS-1 heterojunctions.Additionally, under the light wavelength in the range of 440-460 nm, only hCN is excited instead of TS-1, another charge transfer mode that from CN to TS-1 also exist.Subsequent catalytic process is another key step to determine the photoactivity besides the light absorption and charge separation.It's evidenced that with the introduction of Ag NPs the charge separation of 10hCN/TS-1 could be improved where Ag NPs function as the electron capturers.Actually Ag NPs are also expected to provide the catalytic centers then to facilitate the CO 2 activation.The CO 2 adsorption capabilities of the as-fabricated samples were examined by collecting the CO 2 -TPD curves.Normally the peaks appearing in the temperature range from 100 to 300 C are ascribed to the physical adsorption of CO 2 on the solid surface while the ones from 400 to 700 C are due to the chemical adsorption 394041.As shown in (Fig. 5c), after introducing hCN the physical adsorption of CO 2 is obviously strengthened while in chemical adsorption range a distinct curve shape is shown without obvious adsorption promotion compared with that for TS-1.Notably, after Ag NPs introduced, the chemical adsorption of CO 2 has been greatly promoted, indicating promoted catalytic ability of the photocatalyst.Moreover, the EC measurements were carried out in different gas-bubbled systems.In the N 2 -bubbled system (Fig. S9), the H 2 O reduction is more favorable on 10hCN/TS-1 than TS-1 and 1.5Ag/10hCN/ TS-1 exhibits the largest onset potential.While in the CO 2 -bubbled system (Fig. 5d), 1.5Ag/10hCN/TS-1 has exhibited significantly enlarged onset potential compared with that in N 2 -bubbled system, indicating the good catalytic ability of as-introduced Ag particles, which significantly facilitate the photocatalytic activation and reduction of CO 2 . On the basis of the analysis on the charge separation and subsequent catalytic process, the photocatalytic process mechanism has been proposed and illustrated in Scheme 1, By constructing the Ag-modified 2D/ 2D hCN/TS-1 heterojunctions, the charge transfer mainly obeys the Zscheme under the UV-vis light irradiation.In specific, both hCN and TS-1 would be excited with the photogenerated electrons of TS-1 combining with the holes of CN to prolong the life time of the Fig. 1.(a) DRS spectra of TS-1, CN and 10CN/TS-1, respectively.(b) TEM image of 10CN/TS-1.(c) N 2 adsorption-desorption isotherms and corresponding pore size distribution curves (inset) of TS-1 and 10CN/TS-1 heterojunction, respectively.(d) UV-Raman spectra of TS-1, CN and 10CN/TS-1 heterojunction, respectively. Fig. 2. (a) SPS responses and FS related to the amounts of hydroxyl radical formed (inset) of different samples and (b) photocatalytic activities for CO 2 RR of different samples. Fig. 3. (a) TEM image of 1.5Ag/10hCN/TS-1 heterojunction.(b) XPS spectra for Ag 3d of 1.5Ag/10hCN/TS-1 heterojunction. Fig. 4. (a) SPS responses and FS related to the amounts of hydroxyl radical formed (inset) of different samples and (b) photocatalytic activities for CO 2 RR of different samples. Fig. 5. (a) TPV responses, (b) monochromatic photocurrent action spectra, (c) CO 2 -TPD curves and (d) electrochemical reduction curves with CO 2 bubbled of TS-1, 10CN/TS-1, and 1.5Ag/10hCN/TS-1 heterojunctions, respectively. This work was supported by the NSFC project (U1805255, 21706044), the Fundamental Research Foundation for Universities of Heilongjiang Province (LGYC2018JC008), Postdoctoral Foundation of China (2017M621316), Natural Science Foundation of Heilongjiang Province (B2017006), Postdoctoral Foundation of Heilongjiang Province (LBH-Z17187). photoelectrons of CN, which transfer to the Ag NPs functioning as electron capturers and the catalytic centers to induce highly effective CO 2 RR.In addition, it's noted that in the light range that only CN instead of TS-1 is excited, the photoelectrons of CN would transfer to TS-1 and Ag NPs, respectively, then to induce the reduction of CO 2 Scheme S1."
  },
  {
    "title": "Conclusions",
    "content": "In this work, Ag modified 2D/2D hydroxylated CN/TS-1 heterojunctions have been successfully designed and constructed by modulating photoelectrons.Compared with TS-1, the photoactivity of asfabricated heterojunctions for CO 2 RR has been greatly enhanced to produce CO and CH 4 as the main products.The photocatalytic process mechanism has been investigated in detail.The exceptional photoactivity is mainly due to the greatly improved charge separation obeying Z-scheme, the extended visible-light absorption, and the catalytic ability of Ag NPs for CO 2 .This work showcases an effective and feasible design strategy from the view of modulating photocharges to fabricate highly effective TS-1 molecular sieve-based photocatalysts for practical application. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary material related to this article can be found, in the online version, at doi:https://doi.org/10.1016/j.materresbull.2020. 110926."
  }
]