[
  {
    "title": "Doi",
    "content": "10.1039/c1jm14122h"
  },
  {
    "title": "Article_Title",
    "content": "Zn<sub>2</sub>GeO<sub>4</sub>crystal splitting toward sheaf-like, hyperbranched nanostructures and photocatalytic reduction of CO<sub>2</sub>into CH<sub>4</sub>under visible light after nitridation"
  },
  {
    "title": "Abstract",
    "content": "Sheaf-like, hyperbranched Zn 2 GeO 4 nanoarchitectures were successfully synthesized in a binary ethylenediamine (En)/water solvent system using a solvothermal route.These structures may be assigned to the splitting crystal growth mechanism, resembling some minerals observed in nature.Addition of increasing amounts of En was found to enhance the degree of crystal splitting.Nitridation of the resulting Zn 2 GeO 4 superstructures under NH 3 flow produced yellow Zn 1.7 GeN 1.8 O solid solution, which allows photocatalytically converse CO 2 into hydrocarbon fuel (CH 4 ) in the presence of H 2 O at ambient conditions under visible light irradiation. Experimental Preparation of Zn 2 GeO 4 bundlesAll chemicals were of analytical grade and used as received without further purification.The Zn 2 GeO 4 particles were"
  },
  {
    "title": "Experimental",
    "content": "All chemicals were of analytical grade and used as received without further purification.The Zn 2 GeO 4 particles were Design of two-dimensional (2D) or three-dimensional (3D) ordered complex architectures based on one-dimensional (1D) nanoscale building blocks is now increasingly attracting attention as those new superstructures or complex functional architectures may achieve novel properties arising from hierarchical structures. 1223 Extensive efforts have been devoted to developing ordered self-assembly of anisotropic nanorods into more complex 2D and 3D functional nanostructures induced by external fields, 456 nanorods interactions, 789 rod solubility in a binary solvent/non-solvent liquid mixture, 9,10 and independent autonomous growth etc. 11 Comparing with binary nanostructures, study of ternary ones is relatively more meaningful because not only do they exhibit more complex functions but their properties are also readily tunable by changing the ratio of the component elements. Germanate compounds have attracted attention in the areas of catalysis, adsorption, ion exchange, porous materials for humidity sensors and in germanate glass as a window for high energy laser systems.Zinc germanate (Zn 2 GeO 4 ) is ceramic-like with optical properties 121314 and is well known as a stable photocatalyst for decomposition of water or organic pollutants. 15161718 Zn 2 GeO 4 nanorods and nanowires have been synthesized by solution routes and gas-phase evaporation techniques. 17181920212223 The greenhouse gas carbon dioxide (CO 2 ) can be converted into useful fuels by artificial photosynthesis, which allows the direct conversion of CO 2 and water vapor on semiconductor photocatalysts into valuable hydrocarbon fuels utilizing ultraviolet (UV) and/or visible light as the excitation source at room temperature and ambient pressure. 242552627 This synthetic conversion can reduce atmospheric CO 2 concentrations on the one hand, and also provides a good solution to the energy shortage problem.While TiO 2 -based semiconductor catalysts have been the most popular photocatalysts for this conversion, 28,29 interest in the exploration of novel photocatalysts with visible-light activity is increasing.Recently, we successfully prepared ultralong and ultrathin Zn 2 GeO 4 nanoribbons and found an unique 1D morphology, which greatly promotes the photocatalytic activity of the CO 2 reduction. 30n this paper, we synthesized, sheaf-like, hyperbranched Zn 2 GeO 4 nanoarchitectures in a binary ethylenediamine (En)/ water solvent system using a solvothermal route.These structures can be assigned to the splitting crystal growth mechanism, resembling some minerals observed in nature.Control of the reaction time, precursor concentration, and solvent component enable us to tune splitting degrees to obtain a variety of crystal morphologies.Nitridation of the resulting Zn 2 GeO 4 superstructures under NH 3 flow produced a yellow Zn 1.7 GeN 1.8 O solid solution, which allows photocatalytical conversion of CO 2 into hydrocarbon fuel (CH 4 ) in the presence of H 2 O under visible light irradition in ambient conditions.synthesized using a solvothermal method.In a typical synthesis, 0.26 g of GeO 2 (2.5 mmol) and 1.10 g of Zn(CH 3 COO) 2 2H 2 O (5 mmol) were added to 15 mL of solvents which includes H 2 O and ethylenediamine (En).The mixture was stirred for 40 min and then transferred to a stainless Teflon-lined autoclave of 25 mL inner volume.The solvothermal synthesis was performed under an auto-generated pressure at 180 C for 12 h in an electric oven, followed by cooling naturally to room temperature.The product was collected by centrifugation, washed thoroughly with deionized water and alcohol several times, and then dried at 60 C for 12h.A white Zn 2 GeO 4 powder was finally obtained. Zinc germanium oxynitride solid solutions were obtained by nitriding Zn 2 GeO 4 powder at 700 C under NH 3 flow (200 mL min A1 ) for 6 h.After nitridation, the sample was cooled to room temperature under a NH 3 flow. The crystal structures of the powder samples were investigated by an X-ray diffractometer (XRD) (Rigaku Ultima III, Japan) using Cu-Ka radiation (l 14 0.154178 nm) at 40 kV and 40 mA.The XRD patterns were obtained over the scanning range of 10 -80 at room temperature with a scan rate of 10 min A1 .The morphology of the powders was examined by field emission scanning electron microscopy (FESEM, FEI NOVA NANO-SEM 230).Transmission electron microscopy (TEM) and highresolution transmission electron microscopy (HRTEM) images were obtained on a JEOL JEM-2100 microscope with a LaB 6 filament and an accelerating voltage of 200 kV.The chemical compositions were analyzed with X-ray photoelectron spectroscopy (XPS, K-Alpha, THERMO FISHERSCIENTIFIC).The XPS spectrum was calibrated with respect to the binding energy of the adventitious C1s peak at 284.8 eV.The UV-visible diffuse reflectance spectra of the samples were obtained by using an ultraviolet-visible spectrophotometer (UV-vis, Shimadzu UV-2550, Japan).The specific surface area of the samples was measured by nitrogen sorption at 77 K on surface area and porosity analyzer (Micromeritics TriStar-3000 USA) and calculated by the BET method. The photocatalytic reduction of CO 2 was carried out with 0.1 g zinc germanium oxynitride photocatalyst, which was uniformly placed at the bottom of a pyrex glass reactor with an area of 4.2 cm 2 .The reaction was in a gas-tight system, which was vacuum-treated several times, and followed by injection of high purity CO 2 gas into reaction system until ambient pressure was reached.0.4 mL of distilled water was injected into the system, which was filled with CO 2 to generate a water vapour.After adsorption of CO 2 equilibrium was reached in the dark, light photoirradiation was performed using a 300 W Xe arc lamp equipped with a UV cut-off filter (l 420 nm).A gas pump was used to accelerate gas diffusion.The volume of reaction system was 230 ml.The product was withdrawn with a gas-tight syringe (0.5 mL gas at one time) and detected by gas chromatography (Shimadzu, GC-14B with FID detector, Japan) during irradiation.Quantification of the CH 4 yield was based on the external standard and the use of a calibration curve.The quantum yield was measured by inserting 420 nm band-pass filters in front of the reaction cell to supply irradiated light of wavelength of 420 AE 15 nm.No impure phases such as ZnO and GeO 2 were detected, although they appear in other solution methods. 15No diffraction peak were detected at low angle range, which indicates a pure inorganic phase of the resulting Zn 2 GeO 4 , rather than inorganic-En hybrids."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The FE-SEM images taken at different magnification show that Zn 2 GeO 4 is entirely composed of uniform, monodispersed straw-like sheaves (Fig. 2).The individual sheaf measures 3-4 mm in length and has a middle diameter of 500-700 nm.The symmetric straw-sheaves are assembled from well-aligned nanowires with two fantails oriented to the center and radically projecting out at both ends.The obvious splitting on the sheaf not only occurs on the stem, but also branches into fine nanofilaments, which leads to a highly hierarchical architecture (Fig. 2d). The TEM images further reveal that the bundles are composed of numerous uniform nanowires, which show splitting at both tips of the shuttles (Fig. 3a).Individual constituent bristles of each bundle possess an average diameter of 20 nm.Wellresolved lattice fringes suggest that the nanoscale bristles are structurally uniform single crystals with a preferential growth direction of 001 (Fig. 3b).This indicates that splitting occurred mainly along the c-axis. The time-resolved high-resolution FE-SEM imaging enables the formation and evolution of the hyperbranched nanoarchitecture to be traced.Very small protofibrils with poor crystallinity are obtained first, which aggregate into small bundles after a solvothermal reaction time of 2 h (Fig. 4a).With an increase of the reaction time to 3 h, the bundles become thick with improved crystallinity, and splitting begins to appear (Fig. 4b).Elongation of the reaction to 8 h generates sheaf-like structures with simple splitting assembled from partially-aligned nanorods with no radiating fantails (Fig. 4c andinset).With a further increase in reaction time to 12 h, the bundles fan out at the both ends as described above.When the reaction time is increased to 24 h, shuttle-like fusiform bundles form (Fig. 3c and Fig. 4d,4e).The high-magnification TEM image shows that the nanowires are closely compact in a fusiform bundle and orientated parallel to each other along the direction of the longitudinal axis of the bundle, as arrow-marked in Fig. 3d.These fusiform bundles cross each other frequently in the product to generate an X-shaped configuration (Fig. 3e, 3g and 3h and Fig. 4f).Multi-petal architectures made up of three to ten more fusiform bundles in a highly symmetric fashion were frequently observed, and likened to asterisk and flower-like architectures (Fig. 3f and Fig. 4g 1-5 ).This seemingly unusual sheaf structure of Zn 2 GeO 4 and materials of analogical nanostructures 3132333435 resemble the features observed in penetration twins typical of various minerals, including staurolite and stibnite, which are believed to form via a crystal splitting growth mechanism. 36everal factors synergistically determine the crystal splitting grades to generate a number of subindividuals, a sheaf-like structure, or in its final form, a spherulitic structure: (1) Crystal splitting often occurs in a crystal possessing a with 1D structural anisotropy and small lateral adhesion energy.The Zn 2 GeO 4 structural feature is infinite chains parallel to the c-axis (Fig. 5, blue arrow) formed of alternative corner-sharing two ZnO 4 tetrahedra and one GeO 4 tetrahedra.Zn 2 GeO 4 has been reported to form 1D nanostructures preferentially growing along the 001 direction, including nanorods, nanowires, and nanoribbions, or more complex structures made up of the ZnO 4 tetrahedra and GeO 4 tetrahedra basic units, 1718192021 including this work.(2) Crystal splitting is associated with fast crystal growth, which is caused when oversaturation exceeds a certain critical level, a level that is unique to each material. 37Fast growth promotes a high density of crystal defects, which may arise from metal atom misplacement during the fast growth.These defects always act on nuclei sites to gradually develop branches on the stem, leading to splitting.In the present case, we dilute the reactant concentration by 10 times while other conditions are kept the same.Multipods were obtained which consisted of relatively thick rods with very slight splitting (Fig. 6), which proves that low concentration decreases oversaturation and subsequently reduces the splitting extent.In other words, Zn 2 GeO 4 sheaflike structures can be selectively prepared by rationally tuning the supersaturation process.(3) Crystal splitting is also favored in a situation where the organic surfactant is a very potent surface stabilizer.The degree of crystal splitting strongly depends on the adherence ability of the surfactant to crystal surface, and the total amount and distribution of surfactants.En not only acts as solvent but also as a complexing agent to determine the Zn 2 GeO 4 splitting architectures.En can selectively binds to some specific panels to control the velocity and direction of crystal growth, this is termed as the solvent-coordination molecular-template (SCMT) mechanism. 38399404142 Pure water as a solvent leads to individual Zn 2 GeO 4 nanorods with 60 nm diameter and irregular length but no splitting. 23When the volume ratio En) : H 2 O reaches 2 : 1, whole (100) and (010) facets may be almost fully covered by En, growth on the 100 and 010 faces is terminated, and ultrathin and ultralong nanoribbons growing along the 001 axis are generated, as reported previously. 30While the volume ratio of En) : H 2 O is in excess at 4 : 1, En can quickly cover the entire embryonic crystals and provide more nuclei in a shorter time.A larger number of nuclei leads to straw-sheaflike structures in combination with splitting growth. Although Zn 2 GeO 4 proves to possess high photocatalytic activity for CO 2 reduction and decomposition of water or organic pollutants under UV light irradiation, its band gap is too large and only ultraviolet light of the solar spectrum can be utilized.To extend the spectrum into the visible light range, we nitrified white Zn 2 GeO 4 fusiform bundles (Fig. 9a 0 ) at 700 C under NH 3 flow for 6 h to obtain yellow zinc germanium oxynitride (Zn 1.7 GeN 1.8 O) (Fig. 9b 0 ) with a wurtzite structure with lattice constants of a 14 b 14 3.2 A and c 14 5.19 A, as indexed with XRD pattern (JCPDS card 11-0687) (Fig. 1c).The diffraction peaks corresponding to (100), ( 002), ( 101), ( 102), ( 110), (103), and (112) are similar to ZnGeN 2 and ZnO, and locate between those of ZnGeN 2 and ZnO, which proves that Zn 1.7 GeN 1.8 O is a solid solution between ZnO and ZnGeN 2 . 43The N1s peak of the XPS spectrum for Zn 1.7 GeN 1.8 O is observed at 397.63 eV, compare Zn 2 GeO 4 (Fig. 7). The resulting Zn 1.7 GeN 1.8 O inherits the bundle shape of Zn 2 GeO 4 length 3-8 mm and diameter 0.5-2 mm (Fig. 8).The high-temperature nitridation process causes the constituent nanowire to slightly fuse into rough tetrahedral or octahedral nanoparticle chains.The rough surface offers Zn 1.7 GeN 1.8 O a high specific surface area, 32.33 m 2 g A1 , A2 the as-used Zn 2 GeO 4 bundles (15.81 m 2 g A1 ). The spectrum absorption edge of Zn 1.7 GeN 1.8 O is located at around 600 nm, which is red-shifted relative to 310 nm of the Zn 2 GeO 4 fusiform bundles (Fig. 9).The band gap of Zn 1.7 GeN 1.8 O estimated as 2.6 eV, is substantially smaller than that of the Zn 2 GeO 4 precursor (4.65 eV), based on (1)ahn 14 A(hn A E g ) n/2 , in which a, n, A, and E g signify the absorption coefficient, light frequency, proportionality constant, and band gap, respectively.Here n is equal to 1 as the material is a directgap semiconductor. 44The bottom of the conduction band of this The activity can be greatly enhanced with loading 1 wt Pt (curve b) and RuO 2 (curve c).Pt and RuO 2 can trap the electrons and holes, respectively, hence inhibiting the recombination of electrons and holes, as demonstrated in photocatalytic water splitting.Co-loading with 1 wt Pt and 1 wt RuO 2 further enhances the photocatalytic activity (curve d), even higher than the sum of the two individual co-catalysts.The yield of CH 4 reached a peak value at around 6 h, which may be due to absorption of the intermediate products on the photocatalyst surface to cover the active sites, these may then be reactivated with thermal treatment under vacuum.The quantum yield was calculated according to following equation: 45 in which N(CH 4 ) and N(Photons) signify the molecular number of generated CH 4 in unit time and the number of incident photons in unit time, respectively.The apparent quantum yield of CH 4 evolution of this catalyst at wavelength of 420 AE 15 nm was measured to be 0.024.While zinc germanium oxynitride is a stable and active catalyst for overall water splitting under visible irradiation with different co-catalysts, to the best of our knowledge, this is the first time that such a catalyst has been used for the photocatalytic reduction of CO 2 with visible light."
  },
  {
    "title": "Conclusions",
    "content": "Higher-order, sheaf-like, hyperbranched Zn 2 GeO 4 nanoarchitectures were successfully synthesized in a binary En/water solvent system using a solvothermal route.These Zn 2 GeO 4 superstructures are composed of numerous closely packed nanorods and may form by a split crystal growth mechanism.Nitridation of the resulting Zn 2 GeO 4 superstructures under NH 3 flow produce a yellow Zn 1.7 GeN 1.8 O solid solution that inherits the bundle shape.When loaded with co-catalysts, Zn 1.7 GeN 1.8 O gives high conversion rates of CO 2 into renewable hydrocarbon fuel (CH 4 ).Our synthetic approach may be employed to fabricate 3D hierarchical architectures of other materials under appropriate conditions. Fig. 1a shows XRD patterns of Zn 2 GeO 4 solvothermally synthesized with a volume ratio of En to H 2 O of 4 : 1 at 180 C for 12 h.All the diffraction peaks could be readily indexed to the rhombohedral Zn 2 GeO 4 (JCPDS card 11-0687) with lattice constants of a 14 b 14 14.231A and c 14 9.53 A, a 14 b 14 90 , g 14 120 .No impure phases such as ZnO and GeO 2 were detected, although they appear in other solution methods.15No diffraction peak were detected at low angle range, which indicates a pure inorganic phase of the resulting Zn 2 GeO 4 , rather than inorganic-En hybrids.The FE-SEM images taken at different magnification show that Zn 2 GeO 4 is entirely composed of uniform, monodispersed straw-like sheaves (Fig.2).The individual sheaf measures 3-4 mm in length and has a middle diameter of 500-700 nm.The symmetric straw-sheaves are assembled from well-aligned nanowires with two fantails oriented to the center and radically projecting out at both ends.The obvious splitting on the sheaf not only occurs on the stem, but also branches into fine nanofilaments, which leads to a highly hierarchical architecture (Fig.2d).The TEM images further reveal that the bundles are composed of numerous uniform nanowires, which show splitting at both tips of the shuttles (Fig.3a).Individual constituent bristles of each bundle possess an average diameter of 20 nm.Wellresolved lattice fringes suggest that the nanoscale bristles are structurally uniform single crystals with a preferential growth direction of 001 (Fig.3b).This indicates that splitting occurred mainly along the c-axis.The time-resolved high-resolution FE-SEM imaging enables the formation and evolution of the hyperbranched nanoarchitecture to be traced.Very small protofibrils with poor Fig. 1 XRD patterns of (a) Zn 2 GeO 4 bundles solvothermally synthesized with a volume ratio of En to H 2 O of 4 : 1 at 180 C for 12 h; (b) standard JCPDS card for the Zn 2 GeO 4 ; (c) Zn 1.7 GeN 1.8 O by nitridation of Zn 2 GeO 4 for 6 h at 700 C; (d) standard JCPDS cards of (d1) Zn 1.7 GeN 1.8 O, (d2) ZnO, and (d3) ZnGeN 2 . Fig. 2 FE-SEM images at different magnification of the sheaflike Zn 2 GeO 4 superstructure. Fig.3(a) TEM and (b) HRTEM images of the sheaflike Zn 2 GeO 4 superstructure.TEM images of (c) and (d) the fusiform bundles, (e) X-shape of the fusiform bundles and (f) flower-like architectures consisting of multipod-fusiform bundles, (g) and (h) show the crystalline grain boundaries of the splitting junctions under different magnification. Fig. 4 Time-resolved high-resolution FE-SEM images for the formation and evolution of hyperbranched nanoarchitecture: (a) for 2 h; (b) 3 h; (c) 8 h; (d) 24 h; (e) fusiform bundles; (f) X-shaped configuration of fusiform bundles; (g 1-5 ) multi-petal architectures comprising three to ten or more fusiform bundles (Fig. 4g 1-5 ). Fig. 5 Molecular structure model of Zn 2 GeO 4 . Fig. 10 CH 4 generation over (a) Zn 1.7 GeN 1.8 O, (b) 1 wt Pt-loaded Zn 1.7 GeN 1.8 O, (c) 1 wt RuO 2 -loaded Zn 1.7 GeN 1.8 O, and (d) 1 wt RuO 2 and 1 wt Pt co-loaded Zn 1.7 GeN 1.8 O as a function of visible light irradiation times. Fig. 8 FE-SEM images of Zn 1.7 GeN 1.8 O obtained by nitrifying white Zn 2 GeO 4 fusiform bundles at 700 C under NH 3 flow for 6 h. Fig. 9 UV-vis absorption spectrum of (a) Zn 2 GeO 4 and (b) Zn 1.7 GeN 1.8 O, and corresponding photo images of the powder (a 0 ) for Zn 2 GeO 4 and (b 0 ) for Zn 1.7 GeN 1.8 O. Acknowledgements This work was supported by 973 Programs (No. 2011CB933303 and 2007CB613305), JST-MOST (No. 2009DFA61090), JSPS-NSFC (No. 20811140087), NSFC (No. 20971048 and 50732004), Fundamental Research Funds for the Central Universities (No.1113020401 and 1115020405), and Open Research Fund of State Key Laboratory of Bioelectronics, Southeast University."
  }
]