[
  {
    "title": "Doi",
    "content": "10.1007/s12274-014-0564-2"
  },
  {
    "title": "Article_Title",
    "content": "Photoreduction of CO2 on BiOCl nanoplates with the assistance of photoinduced oxygen vacancies"
  },
  {
    "title": "Abstract",
    "content": "CO 2 photoreduction by semiconductors is of growing interest.Fabrication of oxygen-deficient surfaces is an important strategy for enhancing CO 2 photoreduction activity.However, regeneration of the oxygen vacancies in photocatalysts is still a problem since an oxygen vacancy will be filled up by the O atom from CO 2 after the dissociation process.Herein, we have fabricated highly efficient BiOCl nanoplates with photoinduced oxygen vacancies.Oxygen vacancies were easily regenerated by light irradiation due to the high oxygen atom density and low Bi-O bond energy even when the oxygen vacancies had been filled up by the O atom in the photocatalytic reactions.These oxygen vacancies not only enhanced the trapping capability for CO 2 , but also enhanced the efficiency of separation of electron-hole pairs, which resulted in the photocatalytic CO 2 reduction under simulated solar light.Furthermore, the generation and recovery of the defects in the BiOCl could be realized during the photocatalytic reduction of CO 2 in water.The existence of photoinduced defects in thin BiOCl nanoplates undoubtedly leads to new possibilities for the design of solar-driven bismuth based photocatalysts."
  },
  {
    "title": "Experimental",
    "content": "The chemical reagents were purchased from Shanghai Reagent Co., Ltd.(China).All the chemicals were used as received without further purification.In a typical experiment, 4 mmol of hexadecyltrimethylammonium chloride (CTAC), was dissolved in a mixed solution of 2-methoxyethanol (96 mL) and H 2 O (4 mL). 4 mmol of Bi(NO 3 ) 3 5H 2 O was added to 10 mL of ethylene glycol (EG) with stirring at room temperature.After Bi(NO 3 ) 3 was dissolved completely, it was added to the mixed solution with stirring.All the reactants Nano Res.2015, 8(3): 821-831 were sealed in a flask and maintained at 120 C for 5 h.After the reaction was complete, a white solid (BiOCl) was obtained.The precipitate was washed with hot deionized water and ethanol, and then dried at 60 C for 12 h. In order to investigate oxygen vacancies formed in the BiOCl sample after the light irradiation, a special sample denoted as BiOCl-LT was prepared as follows: The above prepared BiOCl powder was added to a quartz tube and illuminated for 5 h by a Xe lamp (500 W, Langsheng Co., Ltd.Shanghai).The resulting grey powder was collected and washed thoroughly with deionized water and dried at 60 C in air. The BiOCl sample used in the CO 2 photocatalytic reduction was collected and thoroughly washed with deionized water and dried at 60 C in air.The above sample was irradiated under the Xe-lamp for 5 h.The white sample turned to grey and black as for the BiOCl-LT sample. Samples were characterized by X-ray powder diffraction (XRD) on a Rigaku powder diffractometer.Each sample was scanned using Cu K radiation with an operating voltage of 30 kV and an operating current of 100 mA.A scan rate of 4/min was employed to record the patterns in the range of 10-70 at a step size of 0.01.UV-visible diffuse reflectance spectra (DRS) were recorded on an UV-visible spectrophotometer (Hitachi 3010) equipped with an integrating sphere.The photoluminescence (PL) spectra were measured with a Hitachi F4600 fluorescence spectrophotometer at room temperature (excitation wavelength 280 nm).Chemical compositions of the derived products were analyzed using X-ray photoelectron spectroscopy (XPS) analysis (Thermo Scientific ESCALAB 250).All binding energies were referenced to the C 1s peak (285 eV) arising from adventitious carbon.The morphologies and microstructures of the as-prepared samples were investigated by transmission electron microscopy (TEM, JEOL JEM-2100F).IR spectra presented in this work were recorded on a Bruker Tensor 27 spectrometer. The experiments of CO 2 photoreduction with CO 2 / H 2 O solution on BiOCl were carried out in a closed evacuated system.The reaction mixture was prepared by the introduction of the BiOCl powder (0.1 g) to 100 mL of deionized water in a quartz reactor equipped with a cooling system.The reactants were mixed well and deaerated by nitrogen gas.Finally, pure CO 2 gas (400 ppm) was injected into the closed reactor.A 500 W Xe lamp was used as the excitation source.The light intensity of the solar simulator was 100 mW/cm 2 in the range 200-1,000 nm.The gaseous products of CO and CH 4 in the reactor effluent were analyzed over 8 h using a gas chromatograph (GC, Tianmei 7890) equipped with a flame ionization detector (FID).The O 2 produced in the reactor was analyzed by a GC (Tianmei 7890II) equipped with a thermal conductivity detector (TCD)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Blank reaction was first conducted with the BiOCl aqueous solution under photoillumination.Photoreduction products of CO and CH 4 were not observed in the absence of CO 2 , confirming that CO 2 was indeed the carbon source.Another experiment was done by introducing CO 2 but without irradiation.Neither CH 4 nor CO was formed showing that light irradiation is the key for the reduction reaction.Representative CO and CH 4 yields over the BiOCl nanoplates as a function of irradiation time are plotted in Fig. 1(a).The BiOCl nanoplates demonstrated high selectivity to CO formation.The CO yield increased with irradiation time and reached an overall value of 8.1 molg -1 in 8 h, which is comparable to those reported in the literature using TiO 2 with oxygen vacancy for CO 2 photoreduction (see Table S1 in the Electronic Supplementary Material (ESM)).CH 4 formation was also observed but with a lower yield (1.2 molg -1 in 8 h).CH 4 was not detected until after 2 h of irradiation due to the preferential formation of CO.Hydrogen (H 2 ) could not be detected, indicating that the amount evolved in this work was not significant and probably all reacted with the intermediate.The evolution of O 2 from water, which is another important indicator of proton generation, is shown in Fig. 1(b) as a function of irradiation time.The plot shows the concentration of O 2 in the reactor before, during and after the photoreaction.Before the photoillumination (in the dark), the concentration of O 2 was steady.Upon photoillumination, the O 2 concentration gradually increased.When the light was turned off (the second dark period), the O 2 concentration remained essentially unchanged, but the O 2 concentration increased again when the light was turned on.The concentration of O 2 is much higher than that of CO, which means that the O 2 generation process is much faster than the CO generation process. We tested the CO 2 photoreduction activity of the recycled BiOCl sample.Figure 2 shows that the recycled BiOCl sample did not exhibit any significant loss of photocatalytic activity after the third cycle of repeated testing for photocatalytic reduction of CO 2 .An interesting phenomenon was observed in the process of CO 2 reduction in aqueous solution: The white BiOCl sample in the solution gradually became grey and then grey-black during the light irradiation.However, it became white again in aqueous solution after 2 days.Thus, we propose that a disproportionation reaction of Bi 3 to Bi 0 and Bi 3x occurred under UV-visible light irradiation.This may be responsible for the recovery of the BiOCl nanoplates: The Bi 0 (grey), Bi 3x and oxygen vacancies were produced by light irradiation, but the Bi 0 (grey) became reoxidized to Bi 3 (white) by the Bi 3x and O 2 (since Bi 3x is unstable in aqueous solution).In order to confirm both this assumption and the role of oxygen vacancies in the photoreduction of CO 2 , the as-prepared BiOCl nanoplates and BiOCl-LT sample were characterized carefully.system of BiOCl, while the HRTEM (Fig. 3(d)) shows a lattice spacing of 0.735 nm that agrees well with the spacing of the (001) planes of tetragonal BiOCl.The SAED pattern in the inset of Fig. 3(c) was taken on a typical individual nanoplate (Fig. 3(b)), and shows that the nanoplate is single crystalline in nature.The angle between adjacent spots labeled in the SAED pattern is 45, which is identical to the theoretical value of the angle between the (110) and (200) planes of tetragonal BiOCl 24.According to the above results and the symmetry of tetragonal BiOCl, it is confirmed that the 001 facets are the preferentially exposed facets of the as-prepared BiOCl nanoplates. The HRTEM images of BiOCl-LT show that the surfaces of BiOCl became disordered after light irradiation, where the disordered outer layer is 1 nm in thickness, but on the inside there is good crystallinity (see Fig. S2, in the ESM).The crystal structures of the as-prepared samples were confirmed by XRD.As shown in Fig. 4(b), the XRD pattern could be well indexed to the tetragonal phase of BiOCl with the lattice parameters of a b 0.3891 nm and c 0.7369 nm (JCPDS No. 06-249) and reveals that all the samples are well crystallized.After light irradiation, the white BiOCl sample became grey and black.A new peak (at 27.78) appeared in the XRD pattern, which is characteristic of BiO 1.8 0.04H 2 O (JCPDS No. 540344).It is suggested that the Bi 3 may be oxidized to Bi 3x by the photogenerated holes formed under irradiation by light.Other defects such as oxygen vacancies and bismuth vacancies may be produced at the same time, but they were not observed in the XRD pattern (since the levels of newly-formed substances may be below the detection limit of XRD (5 at.)). Raman and XPS analysis were carried out to identify the photoinduced defects in the BiOCl-LT nanoplates.Photoinduced Bi vacancies on BiOCl-LT nanoplates were observed in Raman spectra (Fig. 5(a)).Compared with BiOCl nanoplates, there are two new bands at 69 and 98 cm -1 .These two new bands can be assigned to first-order vibration modes Eg and A 1g of Bi metal 252627, confirming the presence of a very small which can be attributed to the presence of oxygen vacancies 25.There are also peaks with higher binding energies at 162.5 and 165.6 eV which can be attributed to Bi 3x ions 28,29.These results suggest that BiOCl-LT contains Bi 0 , Bi 3 and Bi 3x .The highresolution O 1s XPS spectra of the as-prepared BiOCl and BiOCl-LT samples are presented in Fig. 5(c), respectively.Both profiles are asymmetric and can be fitted to two Gaussian features, which are normally assigned as the low binding energy component (LBEC) and the high binding energy component (HBEC), indicating the presence of two different kinds of O species in the sample.The LBEC and HBEC can be attributed to the lattice oxygen and chemisorbed oxygen caused by the surface chemisorbed species such as hydroxyl and H 2 O, respectively 30.It has been previously reported that the HBEC component increases with the increase in the number of oxygen vacancies, and can lead to the asymmetry of the main peak 30,31.The high-resolution O 1s XPS spectra indicate that the peak area of HBEC is obviously larger in the BiOCl-LT sample as compared to the BiOCl sample.Moreover, the calculated ratios of the adsorbed oxygen to the lattice oxygen are 0.91 and 2.11 for the as-prepared BiOCl and BiOCl-LT, respectively, which strongly suggests the presence of a significant amount of oxygen deficiencies in the light-treated sample. Oxygen vacancies can form an oxygen vacancy state lying close to the conduction band of the photocatalyst, which results in the absorption of visible light 32,33.Figure 6(a) shows the DRS spectra of the as-prepared BiOCl and BiOCl-LT samples.The BiOCl nanoplates do not have any absorption in the visible light range.After light irradiation to give BiOCl-LT, absorption in the visible light range increased.This reveals that oxygen vacancies (V O ) emerged after light irradiation.Furthermore, Fig. 6(b) shows the difference between the PL spectra of BiOCl and BiOCl-LT.For BiOCl, there is a main band at 365 nm (3.34 eV).Because the energy of this photoluminescence is nearly equal to the band gap (3.5 eV) of bulk BiOCl, this emission is attributed to the recombination of free electrons from the bottom of the conduction band to the recombination center in the ground state.It is worth noting that, different from the reported spectrum of pure BiOCl 34, there are several additional absorption bands at 450, 468 and 483 nm.These bands may relate to the V O , isolated V Bi ''' defects and triple vacancy associates '''V Bi V O V Bi ''' formed in situ.It was observed that the thin BiOCl nanoplates were \"damaged\" (became to grey and black) by the light (280 nm) in the photoluminescence spectrometer (see the inset of Fig. 6(b)).The photoinduced electrons in defects states recombine with photoinduced holes in the ground state and cause the new photoluminescence bands.For the BiOCl-LT sample, all the absorption bands became weaker.A weaker PL intensity implies a lower recombination rate of the electrons and holes under light irradiation 34,35. The mechanism of formation of the oxygen vacancies and bismuth vacancies is closely related to the crystal structure of BiOCl and is schematically illustrated in Scheme 1.According to the results in Fig. 3 and the symmetry of BiOCl, the bottom and top surfaces of the BiOCl nanoplates are terminated 001 facets, while the side surfaces are 110 facets.The atomic structures of the 001 facets are shown in Fig. 4(a).Under photochemical conditions, the surface atoms can escape from the lattice more easily than the inner atoms 25,36.In the crystal structure of BiOCl, the Bi atoms in the Bi 2 O 2 2 layers are exposed on the outside while the O atoms are buried inside (as seen in Fig. 4(a)), which means that the Bi atoms should escape from the lattice more easily than the inner atoms and results in the predominant defects in the BiOCl nanoplates being isolated Bi V .This hypothesis was verified by the XPS and Raman analysis.On the other hand, BiOCl with exposed 001 facets has a high density of surface O atoms and a small formation energy 37.This means that the VO could easily be formed on these facets to balance the electron charge in the crystal.These defects in the BiOCl nanoplates supplied the active sites for the photoreduction of the CO 2 .It has been reported that an oxygen vacancy on the surface can preferentially trap CO 2 molecules 4.The FTIR spectra in Fig. 7 provide information about interaction between CO 2 and the BiOCl nanoplates.As shown in Figs.7(a) and 7(b), IR bands at 3,100-3,600 and 1,637 cm -1 can be assigned to the stretching vibrations of OH groups and physically adsorbed H 2 O, respectively 38.The weak IR bands at 1,410-1,490 and 1,500-1,590 cm -1 may assigned to the bicarbonate (HCO 3 -) features and mono-and bidentate carbonates (b-CO 3 2-, m-CO 3 2-), respectively 4.By contrast, after light irradiation, the IR bands at 3,100-3,600 cm -1 disappeared or became significantly weakened, probably because the H 2 O molecules were consumed or replaced by other molecules.The significantly reduced intensities of the bands at 1,400-1,700 cm -1 can be attributed to the reduction of Bi 3 to Bi 0 and the weak interactions between the reduced bismuth atoms and the carbonyl oxygen atoms.Meanwhile, new bands appeared at 2,351 cm -1 (as shown in Fig. 7(c)), which were assigned to CO adsorbed on Bi 0 surface 39.The results are in good agreement with earlier FTIR results obtained by Martins et al. 40 and Koper et al. 39, in particular in evidencing the formation of surface-adsorbed CO species on Bi.This provides evidence that the photoexcited electrons trapped in the defect sites can be transferred to the CO 2 adsorbed on the surface of BiOCl nanoplates, although the literature indicates that the one-electron reduction of CO 2 is very difficult or impossible 41,42.Recently, Zhang et al. reported that the (001) surface of BiOCl preferentially reduces O 2 to O 2- through a one-electron transfer assisted by the situ-generated oxygen vacancy 26.This suggests that the oxygen vacancy promotes the one-electron transfer reaction.Thus, the activated CO 2 gained the photogenerated electron and released a carbon monoxide molecule, consuming a surface oxygen vacancy (the oxygen atom filled the site of the oxygen vacancy).However, these O atoms will easily escape from the lattice again under light irradiation and the oxygen vacancy formed again (see the Experimental section).In addition, the photogenerated holes will On the other hand, we propose that the CH 4 formed may come from the carbon-containing intermediates such as CO, surface HCO 3 -and HCOOH which are converted to CH4 via a multi-electron transfer process Nano Res.2015, 8(3): 821-831 using the available protons (in water) 5.It is also possible for CH 4 to decompose through reaction with photogenerated OH radicals to form CO. In Fig. 1(a), an obvious decrease in the amount of CH 4 at 6 h suggested that it was consumed in the process of CO formation.These two factors may contribute to the low yield of CH 4 observed in this work."
  },
  {
    "title": "Conclusions",
    "content": "This work presents a novel approach to fabricate regenerable oxygen vacancies on a BiOCl nanoplate photocatalyst for the reduction of CO 2 to CO and CH 4 .Oxygen vacancies are readily formed since the surface O atoms are exposed, and CO 2 molecules can be trapped on these oxygen vacancies on the surface of BiOCl nanoplates.The reduction process is to a large extent associated with the reversible formation of surface oxygen vacancies, which provide not only the sites for the adsorption of oxygen atoms from CO 2 but also effectively separate the photoinduced electron-hole pairs.The regeneration of oxygen vacancies is realized during the CO 2 photocatalytic reduction in water irradiated by a Xe lamp.Our results provide some new insights into an in-depth understanding of defect-dependent photocatalytic properties.This work may open up a new avenue for the design of photocatalysts with high solar-driven photocatalytic performance by engineering the intrinsic defects on the surface. Figure 1 (a) Photocatalytic evolution of products from the BiOCl nanoplates for a period of 8 h photoillumination: (--) Without the CO 2 , (--) yield of CO, (--) yield of CH 4 .(b) Photocatalytic evolution of O 2 from the BiOCl nanoplates. Figure 2 Cycling curve of photocatalytic production of CO on the BiOCl nanoplates. Figure 3 (a) TEM images for as-prepared BiOCl nanostructures; (b) HRTEM images for as-prepared BiOCl nanoplate; (c) SAED pattern of the BiOCl nanoplates (shown in (b)) and (d) HRTEM image of an as-prepared BiOCl nanoplate. Figure 4 (a) Schematic illustration of the BiOCl structure.Perspective view of BiOCl; red balls: O, green balls: Cl, purple balls: Bi.(b) XRD patterns of as-prepared BiOCl nanoplates and BiOCl-LT nanoplates. Figure 6 (a) UV-visible diffuse reflectance spectra of BiOCl and BiOCl-LT nanoplates.Inset: The bandgap value, estimated from a plot of (h) 1/2 versus photon energy.(b) PL spectra of BiOCl and BiOCl-LT nanoplates. Scheme 1 Possible reaction pathways for the formation of CO, CH 4 and O 2 from CO 2 photoreduction with H 2 O on BiOCl nanoplates. Figure 7 FTIR spectra after interaction of CO 2 and H 2 O with BiOCl nanoplates: (a) 3,000-3,800 cm -1 ; (b) 1,500-1,800 cm -1 ; (c) 2,250-2,450 cm -1 .The light was turned on after the samples sat in the dark for 30 min to undergo adsorption. to produce O 2 .This process results in a very high ratio of O 2 /CO, in agreement with the experimental observations. This work was supported by the National Basic Research Program of China (No. 2013CB933203) and the National Natural Science Foundation of China (Nos.51272303 and 50972155). Electronic Supplementary Material: Supplementary material (further details of TEM images of BiOCl-LT sample, band structure information, photocatalytic reduction of CO 2 under different conditions) is available in the online version of this article at http://dx.doi.org/10.1007/s12274-014-0564-2."
  }
]