[
  {
    "title": "Doi",
    "content": "10.1016/j.jhazmat.2016.03.052"
  },
  {
    "title": "Article_Title",
    "content": "Novel and facile synthesis of Ba-doped BiFeO3 nanoparticles and enhancement of their magnetic and photocatalytic activities for complete degradation of benzene in aqueous solution"
  },
  {
    "title": "Abstract",
    "content": "Highlight:o An efficient novel visible light photocatalyst was synthesized.o Ba doped BFO showed enhanced surface area, oxygen vacancies, magnetic and photocatalytic activities.o Ba doped BFO can be an economic photocatalyst for benzene degradation.o Complete degradation and high mineralization of benzene were achieved with 60 min irradiation."
  },
  {
    "title": "Experimental",
    "content": "Bismuth nitrate (Bi(NO3)3.5H2O), iron nitrate (Fe(NO3)39H2O), barium nitrate (Ba(NO3)2), hydrogen peroxide (H2O2) from Fluka, and ethylene glycol (EG) from Merck were used without further purification.Benzene from Aldrich (purity 98) was used as received.Ethanol was also used without further purification and deionized water was used for sample preparation. For synthesis of pure BFO nanoparticles, 16 mmol of Bi(NO3)35H2O and Fe(NO3)39H2O were dissolved in 36 ml EG.The mixture was stirred for 30 min at room temperature to yield a dark red sol.The sol was incubated at 90C until a dried gel had formed.Then, the gel powder was calcined at 450C for 0.5 h at a heating rate of 6C/min.Finally, the powder was washed with distilled water and absolute alcohol several times and dried at 70C.For the doped samples, 0.05, 0.1 and 0.2 mol of Ba(NO3)2 were added, while the other experimental conditions were unchanged. Structural analysis of the nanocrystalline powder was carried out using XRD (BrukerD8Advance) with monochromatic Cu K radiation (1.5406A) in the 2 range of 10-80 at room temperature (RT).RT Raman spectra were measured using a labRam HR micro-Raman spectrophotometer (Bruker, model: Senteraa 2009, Germany) with a 785 nm laser line as an excitation source.The magnetic properties of MNPs were measured using a vibrating sample magnetometer (VSM, Lake shore 7300) at RT. Sample morphology was investigated by fieldemission scanning electron microscopy (FESEM), using a Model Quanta 250 FEG (Field Emission Gun), and transmission electron microscopy (TEM, JEOL TEM Model 2100).The UV-vis diffuse reflectance spectrum (UV-vis DRS) of the powder was measured using a Perkin-Elmer Lambda UVvis spectrophotometer.The chemical states of elements in the samples were analyzed based on X-ray photoelectron spectroscopy (XPS) data recorded on a Thermo Scientific Sigma Probe spectrometer with a monochromatic AlK source (photon energy 1486.6 eV), spot size 400 m, pass energy of 200 eV and energy step size of 1.0 eV.The specific Brunauer-Emmett-Teller (BET) surface area and pore size measurements of the samples were conducted on a Micromeritics ASAP 2020 apparatus under nitrogen air.A Genesis 10S UV-Vis spectrophotometer was used to evaluate the absorbance of benzene. Total organic carbon (TOC, Shimadzu) content was determined using a TOC 500 A (Shimazu, Japan).A chemical oxygen demand (COD) test was used for determination of COD.Carbon Dioxide (CO2) analysis was determined using a CO2 9510 analyzer (Alpha Omega Instruments). Finally, gas chromatography/mass spectrometry (GC/MS, Bruker -GC and 320MS) analysis was carried out for clarification of the temporal photodegradation reaction pathway. As in a typical photocatalysis experiment, an aqueous suspension (100 ml) containing 50 mg of Ba-doped BFO, 0.3 mM H2O2 and 100 mg/L of benzene was added to a 250 ml conical flask with a suitable cap, and was used as the reactor for the photocatalytic degradation of benzene under visible light irradiation.The reaction mixture was illuminated using a 55 W fluorescent lamp with an emission peak at 550 nm at a distance of 20 cm under continuous magnetic stirring.The temperature of the solution was fixed at 25C.Before visible light irradiation, the solution was magnetically stirred in a dark place for 1 h, and then exposed to visible light irradiation.Following irradiation for the indicated times, the reaction mixture was separated using an external magnetic field.The removal efficiency of benzene was determined based on the absorption in the wavelength range 190-212 nm using a UV-vis spectrophotometer.The conversion and mineralization efficiency of benzene were defined as follows: where Co is the initial concentration of benzene and C is the concentration of benzene after photocatalytic reaction at 195 nm. After photodegradation, the mixture was subjected to various quality tests.To identify intermediates during the reaction process, the liquid phase was separated from the catalyst using an external magnetic field.The remaining organic phase was then extracted for analyses. A blank solution (without the photocatalyst) was used in all experiments to evaluate the amount of evaporation.The results show that, when a cap was used benzene evaporation during the photodegradation process was negligible.The pure BFO MNPs showed a perovskite rhombohedral structure as reported previously 16, and no secondary phase was detected by XRD analysis. Furthermore, all XRD patterns of Ba-doped BFO showed the typical peaks of a rhombohedral structure, indicating the presence of highly crystalline BFO MNPs.In the enlarged (XRD) pattern around 2 22 (Fig. 2), the (012) peak for Bi1-xBaxFeO3 was shifted to a lower angle with an increase in Ba content, likely due to the larger ionic radius of Ba 2 (1.36 A) than that of Bi 3 (1.17 A).The inset to Fig. 2 exhibits another enlarged XRD pattern at 2 of 32.It is clear that the (104) and (110) peaks split for Bi1-xBaxFeO3 of x0, 0.05 and 0.1 mol , was merged into a single (110) peak with an increase in the Ba content to 0.2 mol .Thus lattice distortion of rhombohedral BFO MNPs appeared with increasing Ba content 17.Furthermore, the average full width at half maxima (FWHM) value increased as the doping level increased from 0.05 mol to 0.2 mol . Maximum distortion in the system was observed at Ba doping of 0.2 mol 18,19.The crystallite decreased with an increase in Ba loading, possibly due to separation from the spiral spin structure and reduction of the leaky behavior of the Ba-doped BFO system 9. The UV-vis DRS of the pure BFO and Ba-doped BFO MNPs are shown in Fig. 3. Ba-doped BFO MNPs showed a greater absorption band with a steeper edge in the visible region than that of the pure form.As shown in Fig. 3, there was a marked shift to a long wavelength for the Ba-BFO samples containing x 0.05, 0.1 and 0.2 mol Ba, as compared to that of pure BFO MNPs.This indicates that the Bi1-xBaxFeO3 crystallites exhibited stronger absorption in the visible light region ( 420 nm) than undoped BFO MNPs.The band-gap energy of whole nanoparticles was calculated using Tauc's equation 20, as shown in the inset to Fig. 3.The band-gap energy for pure BFO MNPs was estimated to be 2.1 eV, which is comparable with previous findings 5.The calculated band-gap energies of Bi 1-x Ba xFeO3 for x0.05, 0.1, and 0.2 mol were 2.00, 1.90 and 1.79 eV, respectively, which are lower than that for pure BFO MNPs.The lower band-gap values of doping BFO MNPs indicate that, for benzene removal from aqueous solution, Ba-doped BFO MNPs shows greater optical activity under visible light when compared with the pure form. The electrochemical properties of nanoparticles are highly dependent on their structural properties (surface area and pore characteristics).Therefore, the specific surface areas and pore size distributions of the as-prepared Ba-doped BFO MNPs with different Ba loadings were measured using the BET method.The indicated BET surface area of 0.2 mol Ba-doped BFO (34.95 m 2 /g) was more than twofold higher than that of 0.05 mol Ba-doped BFO (13.95 m 2 /g).The high surface area and high mesopore volume of Ba-doped BFO nanoparticles with 0.2 mol Ba loading is beneficial due to the effective contact between adsorption sites and adsorbate molecules, which is necessary for the adsorption and subsequent destruction of benzene in aqueous solution.Ba-doped BFO MNP confirmed that the Ba-doped BFO MNPs samples exhibited greater magnetization than the pure form.Furthermore, the magnetization of Ba-doped BFO MNPs increased with increasing Ba concentration.For example, 0.05, 0.1 and 0.2 mol Ba-doped BFO samples showed saturation magnetization (Ms) of 2.4, 2.6 and 3.0 emu /g, respectively.The increase in magnetization with increasing Ba content may be due to the distortion created in the rhombohedral structure 21,22, which was confirmed by the XRD pattern (Figs. 1 and2).In addition, addition of of Ba 2 ions to pure BFO MNPs requires charge compensation, which may be achieved by the formation of Fe 4 or oxygen vacancies.If Fe 4 exists, the statistical distribution of Fe 3 and Fe 4 ions may also lead to net magnetization and ferromagnetism 23. Enhanced magnetization in small particles has recently been reported and attributed to surface-induced magnetization 24 and ferromagnetism caused by apparent oxygen deficiency 25.As shown in Fig. 5, the magnetization results of Ba-doped BFO MNPs are in good agreement with those of surface area as discussed in section 3.1.3.The enhanced weak ferromagnetism of Ba-doped BFO MNPs over pure BFO is indicative of the ease of separation of nanoparticles from aqueous solution during the process of benzene removal. Raman spectroscopy enables information regarding local structures within materials to be obtained.The Raman spectra of pure BFO and Ba-doped BFO MNPs are shown in Fig. 6.To determine the effect of Ba-doping on BFO structure, the observed Raman modes of Ba-doped BFO MNPs were compared with that of pure BFO MNPs.BFO belongs to the R3c space group and the C3v point group.The irreducible representations obtained from group theory are as follows: 4A 1 (z, x 2 y 2 , z 2 ) 5A2 (-) 9E (x, y, x 2 -y 2 , xy, xz, yz) 26.The A1 and E modes are both IR-and Raman-active, whereas the A2 modes are IR-active only.Four A1 modes pervade along the c-axis while nine E modes (double-degenerated) pervade in the x-y plane 27.These involve A1-1, A1-2 and A1-3 modes with strong scattering intensity, A1-4 mode with very weak scattering intensity and nine E modes with medium scattering intensity 28.However, the resonance frequency is different from that previously reported in various studies due to the different sample characteristics and measurement methods 293031.In this research, as shown in Fig. 6, we observed three strong peaks near 136, 168, and 220 cm -1 , a weak peak at 439 cm -1 relative to A1 modes and 9E Raman modes with the strongest intensity at about 95 cm -1 for pure BFO MNPs in the frequency range below 700 cm -1 .With substitution concentration of 0.05 mol , the first two A1 modes at 136 and 168 cm -1 would be merged together and some of Raman peaks below 250 cm -1 shifted to higher frequency.For example, the E1 mode at 99 cm -1 moved toward a higher frequency of 104 cm -1 .A new strong peak around 313 cm -1 seemed to be created because of the shifting of the two modes of E-3 and E-4 centered at 270 cm -1 to the higher frequency, 313 cm -1 . This behavior may be related to the structural distortion from rhombohedral to tetragonal, as reported previously 32.This study also identified the structural disorder which was confirmed by the evidence observed at a high peak intensity of 313 cm -1 at x 0.05 mol .As shown in Fig. 6, increasing the doping to x0.1 and 0.2 mol resulted in structural disorder, however, with reduced peak intensity at 313 cm -1 . Further evidence for the quality and composition of the nanoparticles was obtained from XPS studies.The survey spectra from 0 to 1000 eV of pure and Ba-doped BFO MNPs are shown in Fig. 7.The XPS spectra of pure and Ba-doped BFO MNPs confirm the presence of Bi, Fe, O and minor quantities of Ba for Bi1-xBaxFeO3 (x0.05,0.2 mol ), without traces of any other impurities, with the exception of a small amount of adsorbed carbon peak C 1s at 285 eV; this was used to calibrate the system.The insert of Fig. 7 shows that magnified positions of Ba in Ba doped BFO MNPs. This therefore confirms the high purity of the Ba-doped BFO MNPs samples. The two main photo-emission peaks positioned at 711.The ratio of Fe 3 : Fe 2 was calculated at 1.31: 1 (x 0), 1.35 : 1 (x 0.05) and 3.92: 1 (x 0.2) for Bi1-xBaxO3. The peak positions at 529.2 eV corresponding to the O 1s core spectrum of the BFO MNPs 35 shifted to lower binding energy ranges with the addition of Ba loading (Fig. 8) .In Fig. 8(d), 8(e) and 8 (f), the asymmetric O1s spectra were fitted with sub-peaks and the left peak (red line) in the binding energy located at about 529.5 eV was attributed to the intrinsic O 2-ions in the samples; while the right peak (blue line) located at about 531.6 eV was attributed to the O 2-ions located in the oxygen vacancy-deficient regions.BFO MNPs behaves as an n-type semiconductor for its excess O2 vacancy defects.The appearance of defects at the surface trap free electrons, which result in a space charge region and band bending of the surface 36. With the increase in Ba 2 ion content at the Bi site, the Fe 3 content increased and the amount of oxygen vacancies decreased.The maximum ratio of Fe 3 : Fe 2 and the lowest content of oxygen vacancies can be observed in the 0.2 mol Ba-doped sample from Figs. 8 (a-f). Therefore, with the increase in Ba 2 ion content, the decrease in leakage current density is attributed to the increase in Fe 3 and the decrease in oxygen vacancies. Fig. 9 (a) shows that pure Bi 4f doublet consists of two peaks at 157. 57 and 162.80 eV, which are mainly identified as a signal from Bi-O bonds 37.As compared to the pure Bi 4f doublet (Fig. 9 (a)), Bi 4f7/2 peaks of the Bi1-xBaxFeO3 (x0.05,0.2 mol ) shifted towards higher binding energy regions after Ba substitution.Further, the degree of shift towards the higher binding energy for doping at x0.05 mol is higher than that for doping at x0.Finally, as can be seen from Fig. 9 (b), the peaks at 779.8 eV and 795.1 eV in the Badoped BFO MNPs (x0.05,0.2 mol ) can be attributed to Ba 3d5/2and Ba 3d3/2, respectively. Fig. 10 shows SEM photographs of Bi1xBaxFeO3 MNPs (x0, 0.05 and 0.2 mol ) samples.In these images, uniform pure BFO nanoparticles are evident.However, after the doping process the nanoparticles had irregular shapes, which suggest the formation of impurity phases.Fig. 9 shows that some particles formed agglomerates due to magnetic attraction and electrostatic potential between the grains resulting from abnormal/discontinuous grain growth, known as exaggerated grain growth 40,41. In the pure BFO nanoparticles, the quantitative EDS analysis results indicate that the molar ratio of bismuth, iron and oxygen was about 1:1:3.In the doped samples, EDS composition analysis demonstrated successful doping of Ba (Fig. 11).The amount of Ba detected by EDS analysis was slightly less than that actually added during synthesis.Only 0.048 and 0.17 Ba was detected for 0.05 and 0.2 mol Ba-doped BFO MNPs, respectively. TEM images of Bi1xBaxFeO3 MNPs (x0, 0.05 and 0.2 mol ) are presented in Fig. 12. The nanoparticles had an average particle size of 25-30 nm, and not all of the particles were spherical; some were irregular and agglomerated.As the amount of Ba doping increased to 0.2 mol , the size of the nanoparticles decreased slightly.This substantial reduction of particle size in Badoped BFO MNPs has been reported previously 16, and may be a result of restricted crystal growth of nanoparticles due to substitution of divalent Ba 2 for trivalent Bi 3 ions and breaking of the spiral spin structure of the Ba-doped BFO MNPs 9. The photocatalytic performance of pure and Ba-doped BFO in photodegradation of benzene in the presence of H2O2 is shown in Fig. 13.The Ba-doped BFO MNPs exhibited higher photocatalytic activity than the pure form.The benzene removal efficiency increased with increases in the doping level up to 0.2 mol . Generally, the photocatalytic activity of photocatalysts depends on several parameters, such as band-gap energy, phase structure, specific surface area and crystalline size 42.In our study, increased doping of Ba 2 up to 0.2 mol into pure BFO MNPs caused a greater change in the specific surface area and band-gap energy of the samples, leading to an increase in their photocatalytic activities.BFO MNPs doped with 0.2 mol Ba, which had the lowest band-gap energy and the highest specific surface area, exhibited the highest benzene removal efficiency. Thus, the investigation of benzene removal using Bi1-xBaxFeO3 indicated x0.2 mol . The successful separation of photoinduced electron-hole pairs is necessary for photocatalytic reactions 43.In addition, a reduction in particle size, which leads to larger surface area, provides a benefit in terms of increasing the available surface active sites.With a decrease in particle size, the photoinduced electrons (or holes) are easily transmitted onto the surface of Ba-doped BFO MNPs to react with Ba ions or adsorbed benzene compounds rather than recombining with each other.Such efficient migration of electrons or holes to the surface of Badoped BFO MNPs improves the charge separation process and inhibits the recombination of electron-hole pairs.Therefore, the photocatalytic activity of Ba-doped BFO MNPs can be increased. The photocatalytic activity of Bi 1-x Bax FeO3 (x0.2 mol ) in the photodegradation of benzene according to irradiation duration in the presence and absence of H2O2 was examined (Fig. 14).The photodegradation of benzene proceeded slowly in the absence of H2O2; maximum removal was 29 after 60 min of irradiation.In the presence of H2O2, benzene was completely degraded after 60 min of visible light irradiation.This behavior can be attributed to the combination of photo -Fenton and photocatalytic reactions occurring on the surface of catalyst to generate more active radicals in aqueous medium.It is assumed that Fe 3 species on the surface of the catalysts are transformed to Fe 2 species under visible light irradiation (Eq.3), after which the Fe 2 species generate OH by the decomposition of H2O2 44,45, according to Eq. 4. Thus, OH produced from photo-Fenton catalysis with radical species, generated by photocatalysis, can attack and completely degrade benzene molecules. - ( -) 3 2 - (3) In these equations, represents the sites on the solid surface of the Ba-doped BFO MNPs. Therefore, the enhanced photocatalytic activity of benzene removal is due to both mechanisms, photocatalytic degradation and photo-Fenton catalytic degradation, which includes the formation of new reaction sites for conversion of Fe 3 into Fe 2 on the solid surface and allow H2O2 to generate OH.Before irradiation, the benzene solution was magnetically stirred in the dark for 1 h to attain adsorption-desorption equilibrium between benzene and the photocatalyst.The solution was then placed in the presence of visible light irradiation for various times (Fig. 15).The photocatalytic results indicated disappearance of the benzene peak with opening of the aromatic ring after 10 min of irradiation, and the newly obtained peak decreased markedly with increasing irradiation duration, until it disappeared after 1 h. Fig. 16 shows the variations in benzene removal efficiency in terms of TOC and COD according to irradiation duration using Ba-doped BFO as a photocatalyst.Around 97 benzene degradation efficiency was achieved after 60 min of irradiation, whereas the maximum TOC and COD reduction after 60 min of irradiation was 93 and 82 , respectively.These results indicated highly efficient mineralization of benzene during photodegradation. Mineralization efficiency was then evaluated by detremining CO2 formation during photocatalytic degradation of benzene.Fig. 17 shows the CO2 yields as a function of irradiation duration.CO2 concentrations first increased steadily with increasing irradiation time to the maximum but then decreased slowly, indicating that the reaction rates decreased, which can be easily ascribed to the decrease in the available amounts of benzene in the medium. To clarify the benzene photodegradation pathways, benzene solution was subjected to GC/MS determination after visible irradiation for various durations (MS spectra not shown).Although there are many organic chemicals, there are two basic degradation pathways.A common feature of both degradation pathways is addition of an OH group.The first step in the breakdown of organic chemicals is addition of a OH.The steps that follow the addition of the hydroxyl depend upon whether the molecule is a straight-chain hydrocarbon or an aromatic molecule (i.e., contains a benzene ring).The probable mechanism of benzene photodegradation under the experimental conditions is depicted in scheme 1. According to the GC results, when benzene was attacked by the OH produced by photocatalysis and photo-Fenton catalytic mechanism, high concentrations of catechol and hydroquinone were formed at the beginning of illumination; these were converted to other compounds, including 2-methyl-2-cyclopemtenone, 2-furyl methyl ketone, 5-methyl-2furaldehyde and corylon (scheme 1).Benzene photodegradation was followed by cleavage of the aromatic rings to produce aliphatic acids, which were further broken down by photocatalysis to some other small aliphatic molecules, which continued until they were removed completely through conversion of CO2 and H2O. In addition, the effect of Ba-doped BFO MNPs on production of OH species during photodegradation was investigated in the presence and absence of isopropanol (IP) as an OH quencher 46.Addition of IP (20 mM) inhibited benzene degradation (not shown).This result suggests that OH plays a major role in benzene photodegradation. Ba-doped BFO MNPs with various Ba contents were successfully prepared using an easy sol-gel method at low temperature and a short reaction time; these were used to remove benzene from Wavelength (nm) Fig. 1 shows the XRD patterns of various Bi1-xBaxFeO3 (x0, 0.05, 0.1, and 0.2 mol ) MNPs. a) and (b) shows the N2 adsorption-desorption isotherms and pore size distributions of Ba-doped BFO MNPs (x0.05,0.2 mol ), respectively.The isotherms of both samples were type IV adsorption isotherms with hysteresis loops in the relative range of 0.5-1.0 for x0.05 mol and 0.7-1.0 for x 0.2 mol of Ba in Ba-doped BFO MNPs (Fig. 4 a), which is indicative of mesoporous structures.The isotherm of Ba-doped BFO MNPs with 0.05 mol Ba loading showed an H2-type hysteresis loop, which is explained as a consequence of the interconnectivity of pores, whereas the isotherm of the Ba-doped BFO with 0.2 mol Ba loading displayed an H3-type hysteresis loop, indicating that the mesopores have cylindrical pore geometries. Fig.5shows the magnetization hysteresis (M-H) loops of pure BFO and Bi1xBaxFeO3 4 and 723.7 eV are the spin orbit doublet 2p3/2 and 2p1/2 of the Fe 3 oxidation state 33.As shown in Fig. 8 (a), 8(b) and 8(c), the fitting results of the peaks for the valence states of Fe ions revealed that the Fe 3 oxidation state coexists with the Fe 2 oxidation state in all samples and that the binding energy peak position of Fe 2p3/2 is placed at about 709.5 eV for Fe 2 (red line) and 711.4 eV for Fe 3 (green line) 34. Fig.15shows the UV-vis absorbance values of benzene during photocatalytic degradation.The Fig.18shows a GC chromatogram of the byproducts of benzene photodegradation according to photocatalytic activity of the nanomaterials.BFO MNPs doped with 0.2 mol Ba had the lowest Fig. 1.XRD patterns of Bi1-xBaxFeO3 crystallites for x0, 0.05, 0.1 and 0.2 mol . Fig. 3. UV-vis DRS spectrum of Bi1-xBaxFeO3 crystallites for x0, 0.05, 0.1, and 0.2 mol ; inset Fig. 4. (a): Nitrogen adsorption-desorption isotherms, (b): pore size distribution of Bi1xBaxFeO3 Fig. 5. Magnetic hysteresis loops of Bi1xBaxFeO3 MNPs for x0, 0.05, 0.1, and 0.2 mol at room Fig. 6.Raman spectra of Bi1xBaxFeO3 MNPs for x0, 0.05, 0.1, and 0.2 mol at room Fig. 9. XPS signals of (a): Bi 4f and (b): Ba 3d for Bi1xBaxFeO3 MNPs for x0, 0.05, and 0.2 Fig. 10.SEM images of Bi1xBaxFeO3 nanoparticles, (a): x0.0 mol , (b), x0.05 mol and (c): Fig. 11.EDS images of Bi1xBaxFeO3 nanoparticles, (a): x0.0 mol , (b), x0.05 mol and Fig. 13.Effect of the type of Bi1xBaxFeO3 nanoparticle with x0, 0.05, 0.1, and 0.2 mol on the Fig. 14.Removal efficiency of benzene in the presence and absence of H2O2.(t 25C, C0 Fig.15.UV-vis absorption spectra of benzene solutions according to duration of contact with Ba- Fig. 16.Variations in TOC, COD and benzene removal efficiency according to duration of irradiation Fig. 17.CO2 yield as a function of irradiation time with Ba-doped BFO MNPs.(t 25C, C0 Fig.18.GC spectra of the photodegradation products of benzene with Ba-doped BFO MNPs Figures: Fig. 3. Fig.10. Fig.13. This study was financially supported by 2016 Research Funds of the University of Ulsan, Ulsan, Korea. 44"
  },
  {
    "title": "Results_and_Discussion",
    "content": "Furthermore, all XRD patterns of Ba-doped BFO showed the typical peaks of a rhombohedral structure, indicating the presence of highly crystalline BFO MNPs.In the enlarged (XRD) pattern around 2 22 (Fig. 2), the (012) peak for Bi1-xBaxFeO3 was shifted to a lower angle with an increase in Ba content, likely due to the larger ionic radius of Ba 2 (1.36 A) than that of Bi 3 (1.17 A).The inset to Fig. 2 exhibits another enlarged XRD pattern at 2 of 32.It is clear that the (104) and (110) peaks split for Bi1-xBaxFeO3 of x0, 0.05 and 0.1 mol , was merged into a single (110) peak with an increase in the Ba content to 0.2 mol .Thus lattice distortion of rhombohedral BFO MNPs appeared with increasing Ba content 17.Furthermore, the average full width at half maxima (FWHM) value increased as the doping level increased from 0.05 mol to 0.2 mol . Maximum distortion in the system was observed at Ba doping of 0.2 mol 18,19.The crystallite decreased with an increase in Ba loading, possibly due to separation from the spiral spin structure and reduction of the leaky behavior of the Ba-doped BFO system 9. The UV-vis DRS of the pure BFO and Ba-doped BFO MNPs are shown in Fig. 3. Ba-doped BFO MNPs showed a greater absorption band with a steeper edge in the visible region than that of the pure form.As shown in Fig. 3, there was a marked shift to a long wavelength for the Ba-BFO samples containing x 0.05, 0.1 and 0.2 mol Ba, as compared to that of pure BFO MNPs.This indicates that the Bi1-xBaxFeO3 crystallites exhibited stronger absorption in the visible light region ( 420 nm) than undoped BFO MNPs.The band-gap energy of whole nanoparticles was calculated using Tauc's equation 20, as shown in the inset to Fig. 3.The band-gap energy for pure BFO MNPs was estimated to be 2.1 eV, which is comparable with previous findings 5.The calculated band-gap energies of Bi 1-x Ba xFeO3 for x0.05, 0.1, and 0.2 mol were 2.00, 1.90 and 1.79 eV, respectively, which are lower than that for pure BFO MNPs.The lower band-gap values of doping BFO MNPs indicate that, for benzene removal from aqueous solution, Ba-doped BFO MNPs shows greater optical activity under visible light when compared with the pure form. The electrochemical properties of nanoparticles are highly dependent on their structural properties (surface area and pore characteristics).Therefore, the specific surface areas and pore size distributions of the as-prepared Ba-doped BFO MNPs with different Ba loadings were measured using the BET method.The indicated BET surface area of 0.2 mol Ba-doped BFO (34.95 m 2 /g) was more than twofold higher than that of 0.05 mol Ba-doped BFO (13.95 m 2 /g).The high surface area and high mesopore volume of Ba-doped BFO nanoparticles with 0.2 mol Ba loading is beneficial due to the effective contact between adsorption sites and adsorbate molecules, which is necessary for the adsorption and subsequent destruction of benzene in aqueous solution.Ba-doped BFO MNP confirmed that the Ba-doped BFO MNPs samples exhibited greater magnetization than the pure form.Furthermore, the magnetization of Ba-doped BFO MNPs increased with increasing Ba concentration.For example, 0.05, 0.1 and 0.2 mol Ba-doped BFO samples showed saturation magnetization (Ms) of 2.4, 2.6 and 3.0 emu /g, respectively.The increase in magnetization with increasing Ba content may be due to the distortion created in the rhombohedral structure 21,22, which was confirmed by the XRD pattern (Figs. 1 and2).In addition, addition of of Ba 2 ions to pure BFO MNPs requires charge compensation, which may be achieved by the formation of Fe 4 or oxygen vacancies.If Fe 4 exists, the statistical distribution of Fe 3 and Fe 4 ions may also lead to net magnetization and ferromagnetism 23. Enhanced magnetization in small particles has recently been reported and attributed to surface-induced magnetization 24 and ferromagnetism caused by apparent oxygen deficiency 25.As shown in Fig. 5, the magnetization results of Ba-doped BFO MNPs are in good agreement with those of surface area as discussed in section 3.1.3.The enhanced weak ferromagnetism of Ba-doped BFO MNPs over pure BFO is indicative of the ease of separation of nanoparticles from aqueous solution during the process of benzene removal. Raman spectroscopy enables information regarding local structures within materials to be obtained.The Raman spectra of pure BFO and Ba-doped BFO MNPs are shown in Fig. 6.To determine the effect of Ba-doping on BFO structure, the observed Raman modes of Ba-doped BFO MNPs were compared with that of pure BFO MNPs.BFO belongs to the R3c space group and the C3v point group.The irreducible representations obtained from group theory are as follows: 4A 1 (z, x 2 y 2 , z 2 ) 5A2 (-) 9E (x, y, x 2 -y 2 , xy, xz, yz) 26.The A1 and E modes are both IR-and Raman-active, whereas the A2 modes are IR-active only.Four A1 modes pervade along the c-axis while nine E modes (double-degenerated) pervade in the x-y plane 27.These involve A1-1, A1-2 and A1-3 modes with strong scattering intensity, A1-4 mode with very weak scattering intensity and nine E modes with medium scattering intensity 28.However, the resonance frequency is different from that previously reported in various studies due to the different sample characteristics and measurement methods 293031.In this research, as shown in Fig. 6, we observed three strong peaks near 136, 168, and 220 cm -1 , a weak peak at 439 cm -1 relative to A1 modes and 9E Raman modes with the strongest intensity at about 95 cm -1 for pure BFO MNPs in the frequency range below 700 cm -1 .With substitution concentration of 0.05 mol , the first two A1 modes at 136 and 168 cm -1 would be merged together and some of Raman peaks below 250 cm -1 shifted to higher frequency.For example, the E1 mode at 99 cm -1 moved toward a higher frequency of 104 cm -1 .A new strong peak around 313 cm -1 seemed to be created because of the shifting of the two modes of E-3 and E-4 centered at 270 cm -1 to the higher frequency, 313 cm -1 . This behavior may be related to the structural distortion from rhombohedral to tetragonal, as reported previously 32.This study also identified the structural disorder which was confirmed by the evidence observed at a high peak intensity of 313 cm -1 at x 0.05 mol .As shown in Fig. 6, increasing the doping to x0.1 and 0.2 mol resulted in structural disorder, however, with reduced peak intensity at 313 cm -1 . Further evidence for the quality and composition of the nanoparticles was obtained from XPS studies.The survey spectra from 0 to 1000 eV of pure and Ba-doped BFO MNPs are shown in Fig. 7.The XPS spectra of pure and Ba-doped BFO MNPs confirm the presence of Bi, Fe, O and minor quantities of Ba for Bi1-xBaxFeO3 (x0.05,0.2 mol ), without traces of any other impurities, with the exception of a small amount of adsorbed carbon peak C 1s at 285 eV; this was used to calibrate the system.The insert of Fig. 7 shows that magnified positions of Ba in Ba doped BFO MNPs. This therefore confirms the high purity of the Ba-doped BFO MNPs samples. The two main photo-emission peaks positioned at 711.The ratio of Fe 3 : Fe 2 was calculated at 1.31: 1 (x 0), 1.35 : 1 (x 0.05) and 3.92: 1 (x 0.2) for Bi1-xBaxO3. The peak positions at 529.2 eV corresponding to the O 1s core spectrum of the BFO MNPs 35 shifted to lower binding energy ranges with the addition of Ba loading (Fig. 8) .In Fig. 8(d), 8(e) and 8 (f), the asymmetric O1s spectra were fitted with sub-peaks and the left peak (red line) in the binding energy located at about 529.5 eV was attributed to the intrinsic O 2-ions in the samples; while the right peak (blue line) located at about 531.6 eV was attributed to the O 2-ions located in the oxygen vacancy-deficient regions.BFO MNPs behaves as an n-type semiconductor for its excess O2 vacancy defects.The appearance of defects at the surface trap free electrons, which result in a space charge region and band bending of the surface 36. With the increase in Ba 2 ion content at the Bi site, the Fe 3 content increased and the amount of oxygen vacancies decreased.The maximum ratio of Fe 3 : Fe 2 and the lowest content of oxygen vacancies can be observed in the 0.2 mol Ba-doped sample from Figs. 8 (a-f). Therefore, with the increase in Ba 2 ion content, the decrease in leakage current density is attributed to the increase in Fe 3 and the decrease in oxygen vacancies. Fig. 9 (a) shows that pure Bi 4f doublet consists of two peaks at 157. 57 and 162.80 eV, which are mainly identified as a signal from Bi-O bonds 37.As compared to the pure Bi 4f doublet (Fig. 9 (a)), Bi 4f7/2 peaks of the Bi1-xBaxFeO3 (x0.05,0.2 mol ) shifted towards higher binding energy regions after Ba substitution.Further, the degree of shift towards the higher binding energy for doping at x0.05 mol is higher than that for doping at x0.Finally, as can be seen from Fig. 9 (b), the peaks at 779.8 eV and 795.1 eV in the Badoped BFO MNPs (x0.05,0.2 mol ) can be attributed to Ba 3d5/2and Ba 3d3/2, respectively. Fig. 10 shows SEM photographs of Bi1xBaxFeO3 MNPs (x0, 0.05 and 0.2 mol ) samples.In these images, uniform pure BFO nanoparticles are evident.However, after the doping process the nanoparticles had irregular shapes, which suggest the formation of impurity phases.Fig. 9 shows that some particles formed agglomerates due to magnetic attraction and electrostatic potential between the grains resulting from abnormal/discontinuous grain growth, known as exaggerated grain growth 40,41. In the pure BFO nanoparticles, the quantitative EDS analysis results indicate that the molar ratio of bismuth, iron and oxygen was about 1:1:3.In the doped samples, EDS composition analysis demonstrated successful doping of Ba (Fig. 11).The amount of Ba detected by EDS analysis was slightly less than that actually added during synthesis.Only 0.048 and 0.17 Ba was detected for 0.05 and 0.2 mol Ba-doped BFO MNPs, respectively. TEM images of Bi1xBaxFeO3 MNPs (x0, 0.05 and 0.2 mol ) are presented in Fig. 12. The nanoparticles had an average particle size of 25-30 nm, and not all of the particles were spherical; some were irregular and agglomerated.As the amount of Ba doping increased to 0.2 mol , the size of the nanoparticles decreased slightly.This substantial reduction of particle size in Badoped BFO MNPs has been reported previously 16, and may be a result of restricted crystal growth of nanoparticles due to substitution of divalent Ba 2 for trivalent Bi 3 ions and breaking of the spiral spin structure of the Ba-doped BFO MNPs 9. The photocatalytic performance of pure and Ba-doped BFO in photodegradation of benzene in the presence of H2O2 is shown in Fig. 13.The Ba-doped BFO MNPs exhibited higher photocatalytic activity than the pure form.The benzene removal efficiency increased with increases in the doping level up to 0.2 mol . Generally, the photocatalytic activity of photocatalysts depends on several parameters, such as band-gap energy, phase structure, specific surface area and crystalline size 42.In our study, increased doping of Ba 2 up to 0.2 mol into pure BFO MNPs caused a greater change in the specific surface area and band-gap energy of the samples, leading to an increase in their photocatalytic activities.BFO MNPs doped with 0.2 mol Ba, which had the lowest band-gap energy and the highest specific surface area, exhibited the highest benzene removal efficiency. Thus, the investigation of benzene removal using Bi1-xBaxFeO3 indicated x0.2 mol . The successful separation of photoinduced electron-hole pairs is necessary for photocatalytic reactions 43.In addition, a reduction in particle size, which leads to larger surface area, provides a benefit in terms of increasing the available surface active sites.With a decrease in particle size, the photoinduced electrons (or holes) are easily transmitted onto the surface of Ba-doped BFO MNPs to react with Ba ions or adsorbed benzene compounds rather than recombining with each other.Such efficient migration of electrons or holes to the surface of Badoped BFO MNPs improves the charge separation process and inhibits the recombination of electron-hole pairs.Therefore, the photocatalytic activity of Ba-doped BFO MNPs can be increased. The photocatalytic activity of Bi 1-x Bax FeO3 (x0.2 mol ) in the photodegradation of benzene according to irradiation duration in the presence and absence of H2O2 was examined (Fig. 14).The photodegradation of benzene proceeded slowly in the absence of H2O2; maximum removal was 29 after 60 min of irradiation.In the presence of H2O2, benzene was completely degraded after 60 min of visible light irradiation.This behavior can be attributed to the combination of photo -Fenton and photocatalytic reactions occurring on the surface of catalyst to generate more active radicals in aqueous medium.It is assumed that Fe 3 species on the surface of the catalysts are transformed to Fe 2 species under visible light irradiation (Eq.3), after which the Fe 2 species generate OH by the decomposition of H2O2 44,45, according to Eq. 4. Thus, OH produced from photo-Fenton catalysis with radical species, generated by photocatalysis, can attack and completely degrade benzene molecules. - ( -) 3 2 - (3) In these equations, represents the sites on the solid surface of the Ba-doped BFO MNPs. Therefore, the enhanced photocatalytic activity of benzene removal is due to both mechanisms, photocatalytic degradation and photo-Fenton catalytic degradation, which includes the formation of new reaction sites for conversion of Fe 3 into Fe 2 on the solid surface and allow H2O2 to generate OH.Before irradiation, the benzene solution was magnetically stirred in the dark for 1 h to attain adsorption-desorption equilibrium between benzene and the photocatalyst.The solution was then placed in the presence of visible light irradiation for various times (Fig. 15).The photocatalytic results indicated disappearance of the benzene peak with opening of the aromatic ring after 10 min of irradiation, and the newly obtained peak decreased markedly with increasing irradiation duration, until it disappeared after 1 h. Fig. 16 shows the variations in benzene removal efficiency in terms of TOC and COD according to irradiation duration using Ba-doped BFO as a photocatalyst.Around 97 benzene degradation efficiency was achieved after 60 min of irradiation, whereas the maximum TOC and COD reduction after 60 min of irradiation was 93 and 82 , respectively.These results indicated highly efficient mineralization of benzene during photodegradation. Mineralization efficiency was then evaluated by detremining CO2 formation during photocatalytic degradation of benzene.Fig. 17 shows the CO2 yields as a function of irradiation duration.CO2 concentrations first increased steadily with increasing irradiation time to the maximum but then decreased slowly, indicating that the reaction rates decreased, which can be easily ascribed to the decrease in the available amounts of benzene in the medium. To clarify the benzene photodegradation pathways, benzene solution was subjected to GC/MS determination after visible irradiation for various durations (MS spectra not shown).Although there are many organic chemicals, there are two basic degradation pathways.A common feature of both degradation pathways is addition of an OH group.The first step in the breakdown of organic chemicals is addition of a OH.The steps that follow the addition of the hydroxyl depend upon whether the molecule is a straight-chain hydrocarbon or an aromatic molecule (i.e., contains a benzene ring).The probable mechanism of benzene photodegradation under the experimental conditions is depicted in scheme 1. According to the GC results, when benzene was attacked by the OH produced by photocatalysis and photo-Fenton catalytic mechanism, high concentrations of catechol and hydroquinone were formed at the beginning of illumination; these were converted to other compounds, including 2-methyl-2-cyclopemtenone, 2-furyl methyl ketone, 5-methyl-2furaldehyde and corylon (scheme 1).Benzene photodegradation was followed by cleavage of the aromatic rings to produce aliphatic acids, which were further broken down by photocatalysis to some other small aliphatic molecules, which continued until they were removed completely through conversion of CO2 and H2O. In addition, the effect of Ba-doped BFO MNPs on production of OH species during photodegradation was investigated in the presence and absence of isopropanol (IP) as an OH quencher 46.Addition of IP (20 mM) inhibited benzene degradation (not shown).This result suggests that OH plays a major role in benzene photodegradation."
  },
  {
    "title": "Conclusions",
    "content": "Ba-doped BFO MNPs with various Ba contents were successfully prepared using an easy sol-gel method at low temperature and a short reaction time; these were used to remove benzene from Wavelength (nm) Fig. 1 shows the XRD patterns of various Bi1-xBaxFeO3 (x0, 0.05, 0.1, and 0.2 mol ) MNPs. a) and (b) shows the N2 adsorption-desorption isotherms and pore size distributions of Ba-doped BFO MNPs (x0.05,0.2 mol ), respectively.The isotherms of both samples were type IV adsorption isotherms with hysteresis loops in the relative range of 0.5-1.0 for x0.05 mol and 0.7-1.0 for x 0.2 mol of Ba in Ba-doped BFO MNPs (Fig. 4 a), which is indicative of mesoporous structures.The isotherm of Ba-doped BFO MNPs with 0.05 mol Ba loading showed an H2-type hysteresis loop, which is explained as a consequence of the interconnectivity of pores, whereas the isotherm of the Ba-doped BFO with 0.2 mol Ba loading displayed an H3-type hysteresis loop, indicating that the mesopores have cylindrical pore geometries. Fig.5shows the magnetization hysteresis (M-H) loops of pure BFO and Bi1xBaxFeO3 4 and 723.7 eV are the spin orbit doublet 2p3/2 and 2p1/2 of the Fe 3 oxidation state 33.As shown in Fig. 8 (a), 8(b) and 8(c), the fitting results of the peaks for the valence states of Fe ions revealed that the Fe 3 oxidation state coexists with the Fe 2 oxidation state in all samples and that the binding energy peak position of Fe 2p3/2 is placed at about 709.5 eV for Fe 2 (red line) and 711.4 eV for Fe 3 (green line) 34. Fig.15shows the UV-vis absorbance values of benzene during photocatalytic degradation.The Fig.18shows a GC chromatogram of the byproducts of benzene photodegradation according to photocatalytic activity of the nanomaterials.BFO MNPs doped with 0.2 mol Ba had the lowest Fig. 1.XRD patterns of Bi1-xBaxFeO3 crystallites for x0, 0.05, 0.1 and 0.2 mol . Fig. 3. UV-vis DRS spectrum of Bi1-xBaxFeO3 crystallites for x0, 0.05, 0.1, and 0.2 mol ; inset Fig. 4. (a): Nitrogen adsorption-desorption isotherms, (b): pore size distribution of Bi1xBaxFeO3 Fig. 5. Magnetic hysteresis loops of Bi1xBaxFeO3 MNPs for x0, 0.05, 0.1, and 0.2 mol at room Fig. 6.Raman spectra of Bi1xBaxFeO3 MNPs for x0, 0.05, 0.1, and 0.2 mol at room Fig. 9. XPS signals of (a): Bi 4f and (b): Ba 3d for Bi1xBaxFeO3 MNPs for x0, 0.05, and 0.2 Fig. 10.SEM images of Bi1xBaxFeO3 nanoparticles, (a): x0.0 mol , (b), x0.05 mol and (c): Fig. 11.EDS images of Bi1xBaxFeO3 nanoparticles, (a): x0.0 mol , (b), x0.05 mol and Fig. 13.Effect of the type of Bi1xBaxFeO3 nanoparticle with x0, 0.05, 0.1, and 0.2 mol on the Fig. 14.Removal efficiency of benzene in the presence and absence of H2O2.(t 25C, C0 Fig.15.UV-vis absorption spectra of benzene solutions according to duration of contact with Ba- Fig. 16.Variations in TOC, COD and benzene removal efficiency according to duration of irradiation Fig. 17.CO2 yield as a function of irradiation time with Ba-doped BFO MNPs.(t 25C, C0 Fig.18.GC spectra of the photodegradation products of benzene with Ba-doped BFO MNPs Figures: Fig. 3. Fig.10. Fig.13. This study was financially supported by 2016 Research Funds of the University of Ulsan, Ulsan, Korea. 44"
  }
]