[
  {
    "title": "Doi",
    "content": "10.1016/j.jallcom.2020.154723"
  },
  {
    "title": "Article_Title",
    "content": "Constructing NiFe-LDH wrapped Cu2O nanocube heterostructure photocatalysts for enhanced photocatalytic dye degradation and CO2 reduction via Z-scheme mechanism"
  },
  {
    "title": "Abstract",
    "content": "Considering the flexible chemical composition, tunable electronic properties and unique twodimensional structure of layered double hydroxides (LDHs), we constructed NiFe-LDH/Cu 2 O heterostructure photocatalysts.The photocatalytic performance of NiFe-LDH/Cu 2 O heterostructure photocatalysts was evaluated by methyl blue (MB) degradation and CO 2 reduction under visible-light illumination.The removal efficiency of MB was improved from 20 for Cu 2 O and 45 for NiFe-LDH to 93 for NiFe-LDH/Cu 2 O after 30 min adsorption and 240 min visible-light irradiation.Moreover, CH 4 yield from CO 2 reduction over NiFe-LDH/Cu 2 O is about 5.6 and 6.9 times that of NiFe-LDH and Cu 2 O, respectively.Based on a detailed study of structural, electronic, optical and electrochemical properties, Zscheme photocatalytic mechanism was proposed to explain the enhanced photocatalytic performance of NiFe-LDH/Cu 2 O.This work presents an inexpensive and flexible strategy for manufacturing heterostructure photocatalysts using earth-abundant elements."
  },
  {
    "title": "Experimental",
    "content": "Fig. 1 illustrated schematically the preparation process of NFC.Cu 2 O nanocubes were synthesized by a typical co-precipiatio method using cupric chloride, sodium hydroxide and ascorbic acid (see ESI for details).To prepare NFC-1, 100 mg Cu 2 O nanocubes were re-dispersed in 100 mL DI water in a glass flask.Then, 0.4 mmol NiCl 2 6H 2 O and 0.2 mmol FeCl 3 6H 2 O were added to the suspension under continuous stirring.After that, 20 mL Na 2 SO 3 solution (1 M) was added to the mixture and the flask was transferred to a thermostat water bath tank to be kept at 65 C for 1 h.Finally, the precipitates were collected by centrifugation, washed thoroughly by water and ethanol and dried in vacuum at 60 C. NFC-2 and NFC-4 were prepared under similar conditions except being aged at 65 C for 2 h and 4 h, respectively.For comparison, pure NiFe-LDH with the same molar ratio of Ni/Fe was prepared by a hydrothermal method at 120 C for 10 h, referred to as NFC-0. MB was used as a reprehensive organic pollutant for evaluating the photocatalytic performance of NFC.50 mg catalyst was dispersed in 50 mL MB solution (C 0, fresh 14 6 mg/L) in a quartz reaction tube with a diameter of 2.4 cm.A long xenon light bulb was positioned vertically in a double-wall jacketed quartz tube with circulated cooling water to eliminate the IR-induced heating effect on the photocatalytic reaction.The distance between the xenon bulb and the reaction tube is 8 cm and 400 nm cut-off filters were inserted in the middle.The light intensity measured at the photocatalytic reaction tube is 15 mW/cm 2 .To minimize the influence of dye adsorption, the catalyst suspension was first magnetically stirred in dark for 30 min, and the MB concentration is labeled as C 0 .After switch on the light, 4 mL of suspension was withdrawn at given time intervals t and the residual MB concentration is referred to as C t .The changes of MB concentrations were evaluated by monitoring variation of the absorbance peak at 664 nm.The reusability and stability of photocatalysts were tested by repeating the above-mentioned procedure for three consecutive cycles.After each run, photocatalysts were collected, washed with DI water and dried, and fresh MB solution was injected.For trapping experiments, BQ (0.3 mM), IPA (1 mM), TEOA and AgNO 3 were used as scavengers of superoxide radicals (,O A 2 ), hydroxide radicals (,OH), holes (h ) and electrons (e A ). The photocatalytic reduction of CO 2 was carried out using Lab PLS-SXE300/300UV solar system (Perfect Light, China) under visible-light irradiation from a 300 W xenon lamp coupled with nm cut-off filter. 1 g NaHCO 3 was placed on the bottom of a mL quartz reactor.Moreover, a sample tray containing 100 mg catalyst was suspended 3 cm above the NaHCO 3 powder.After being vacuumed for about 30 min, 4 mL H 2 SO 4 was injected to react with NaHCO 3 to produce CO 2 .The gaseous products were quantifiably identified on-line on a gas chromatograph (GC-2014C, Shimada, Japan) using a flame ionization detector (FID). The morphologies of the as-prepared samples were analyzed by SEM, TEM and HRTEM.SEM images demonstrated that pure NiFe-LDH has a flower-like structure made up of interconnected 2D nanosheets (Fig. 2a andb).Similar results have been reported previously and attributed to the tendency of LDHs to form aggregates due to strong particle-particle interaction 60.Moreover, well-distributed nanocubes with smooth surfaces and sharp edges can be seen clearly in the SEM images of pristine Cu 2 O (Fig. 2c andd).Upon the deposition of NiFe-LDH layers, the well-separated Cu 2 O nanocubes became aggregated and the smooth surfaces and sharp edges disappeared (Fig. 2e andf).It can be noted that the surface of NFC-4 is not as rough as that of NFC-1.The reason is not fully understood yet and might be related to the tendency of LDH to be oriented with the brucite-like OHOHOH 2 x layers parallel to the substrate surface 60. 15 phonon modes of Cu 2 O crystals 61,62.For NFC-0, the observed 143 cm A1 peak can be ascribed to the typical OMO bending mode of bruite-like layers while the complex band in the spectral region of 365e562 cm A1 were contributions from M A O and M A OH vibrations 63,64.Moreover, the 311 cm A1 band was likely related to the hydrogen bonds formed between OH units and the interlayer anions while the Raman feature at 725 cm A1 might be attributed to the interlayer CO 3 2A anions introduced during the hydrothermal synthesis of the reference NiFe-LDH 65.NFC-4 had similar Raman features to that of NFC-0, indicating the successful deposition of NiFe-LDH layers.XPS technique was used to investigate the chemical composition and oxidation states of Cu, Ni and Fe of the samples.As shown in the survey spectra, Cu and O were detected in Cu 2 O and Ni, Fe and O are found in NiFe-LDH (Fig. S3).In comparison, all these elements including Cu, Ni, Fe and O were observed in the spectra of NiFe-LDH/Cu 2 O heterostructure photocatalysts.Fig. 5a presented the Cu 2p spectra of pure Cu 2 O and NFC-4.For Cu 2 O, the two dominant peaks at binding energies (BE) of 932.7 eV and 952.5 eV can be ascribed to Cu 2p 3/2 and Cu 2p 1/2 for Cu or Cu 0 states, respectively 66,67.To further clarify these two oxidation states, Cu LMM Auger spectrum was recorded (Fig. 5b).The observed main peak at 570 eV is in good agreement with the reported BE value of Cu state 67, confirming that Cu is presented in Cu state in pristine Cu 2 O.In the spectrum of NiFe-LDH/Cu 2 O, shoulder peaks appeared at higher energy side of Cu 2p 3/2 and the Cu 2p 3/2 peak was positively shifted to 933.0 eV.Moreover, signal associated with CueS bonding was observed in the S 2p spectrum of NFC-4 (Fig. S4).Thus, it is likely that during the co-precipitation process of NiFe-LDH on Cu 2 O nanocubes, (S 2 O 3 ) 2-anions enter the interlayer space of the brucite-like layers (OHOHOH 2 x ) to balance their positive charges and some of the anions can react with Cu 2 O, forming CueS bonds at the interface between NiFe-LDH and Cu 2 O 68,69.The partial replacement of CueO bonds by CueS bonds results in strong interface interaction which can facilitate transfer of photo-excited charge carriers between Cu 2 O and NiFe-LDH.In addition, the extra Cu 2 signal observed for NFC-4 might be due to partial oxidation of Cu 2 O to CuO by Na 2 SO 3 70.Fig. 5c displayed the Ni 2p spectra of NFC-4 and NFC-0.For pure NiFe-LDH, the BE peaks at 856.3 eV and 874.1 eV can be ascribed to the Ni 2p 3/2 and Ni 2p 1/2 of Ni 2 state while peaks at 862.3 eV and 880.1 eV are associated with Ni 3 state 71,72.Upon formation of NiFe-LDH/ Cu 2 O heterostructure, The Ni 2p 3/2 peaks of NFC-4 are positively shifted to 856.6 eV (Ni 2 ) and 862.7 eV (Ni 3 ), suggesting charge transfer across the interface.Fig. 5d showed the Fe 2p spectra of NFC-4 and NFC-0.It can be found that pure NiFe-LDH has two main peaks at 712.8 eV and 724.8 eV, corresponding to the Fe 2p 3/2 and Fe 2p 1/2 of Fe 3 state 72,73.In the spectrum of NFC-4, main peaks at 713.0 eV and 726.3 eV along with their satellite peaks at 719.8 eV and 733.5 eV could be assigned to Fe 3 .Therefore, results of SEM, HRTEM, XRD, Raman and XPS measurements confirmed the successful fabrication of NiFe-LDH/Cu 2 O heterostructure photocatalysts with strong interface interaction. Fig. 6 showed the N 2 adsorption-desorption isotherms of Cu 2 O, NFC-0, NFC-2 and NFC-4, and the calculated surface areas are 15.798, 32.353, 16.249. and 25.191 m 2 /g, respectively, (Table S2).In addition, pure NiFe-LDH exhibits sheet-like adsorption behavior. Fig. 7 displayed the optical absorption spectra of all the samples.It can found that both NiFe-LDH and Cu 2 O showed optical absorption edges in the visible-light regime and the extracted band gap energies from the Tauc plots equaled to 2.14 eV and 2.05 eV, respectively, (Fig. S5).Compared to NiFe-LDH and Cu 2 O, heterostructure photocatalysts exhibited higher absorbance above 600 nm and the enhancement became more pronounced with increasing growth time.This would be helpful for the photocatalyst to make better use of solar energy and beneficial to improve photocatalytic activity.Moreover, band structure and partial density of states (PDOS) were calculated based on density functional theory (DFT) and presented in Fig. 8.The calculated band gap values are 2.29 eV and 2.32 eV for NiFe-LDH and Cu 2 O, respectively, which are in reasonably good agreement with the experimental results.From PDOS of NiFe-LDH, impurity levels associated with Fe d orbitals were found, which might give rise to the observed optical absorption band. Next, influence of constructing heterostructure structure on the separation and transfer behaviors of photo-excited charge carriers were investigated by photocurrent responses and EIS measurements.As shown in Fig. 9a andb, photocurrents rised rapidly upon switching on the light and then decreased and became nearly constant with increasing irradiation time.The superior photocurrent density of NiFe-LDH/Cu 2 O over that of pristine NiFe-LDH indicates better harvesting ability of light and promoted separation of electron-hole pairs, which plays crucial role on the enhancement of photocatalytic activity.Moreover, NFC-0, NFC-1, NFC-2 and NFC-4 samples showed spikes at the initial time of light illumination.Similar behaviors have been reported for other LDH-containing catalysts such as CoZnAl-LDH/RGO/g-C 3 N 4 44 and NiCo-LDH/ BiVO 4 15.Based on the previous works on transient photocurrent and physical model 70,74, the appearance of spikes indicates accumulation of photo-excited holes in NiFe-LDH at the semiconductor/electrolyte interface and reduced bulk recombination.Since NiFe-LDH is composed of 2D nanosheets of Ni(OH) 2 with Ni 2 being partially replaced by Fe 3 ions and interlayer chargebalancing anions, photo-generated charge carriers only needs to travel a short distance to reach the semiconductor/electrolyte junction.Fig. 9c showed Nyquist plots of all the samples.Since the semicircle at high frequency side is associated with the charge transfer resistance, the smaller diameters of NFC-1, NFC-2 and NFC-4 suggested that they had lower charge transfer barriers than that of pristine Cu 2 O and NiFe-LDH 75,76.The Nyquist plots were fitted using the equivalent circuit presented as the inset, and the extracted R p equaled to 3303, 2396, 1849, 1457 and 1278 U for NiFe-LDH, Cu 2 O, NFC-1, NFC-2 and NFC-4, respectively.The results of transient photocurrent and EIS measurements demonstrated that the fabrication of NiFe-LDH/Cu 2 O heterostructure can effectively facilitate separation and transfer of photo-generated charge carriers and thus promote photocatalytic activity. The influence of preparing NiFe-LDH/Cu 2 O heterostructure photocatalysts on the catalytic activity was investigated by MB degradation and CO 2 reduction under visible-light illumination.Fig. 10a plotted time-resolved absorption spectra of MB solutions collected during the photodegradation process over NiFe-LDH/ Cu 2 O.The clear drop of the 664 nm-absorption peak suggested decreasing of MB concentration.Fig. 10b showed C 0, fresh /C 0 as a function of time for Cu 2 O, NiFe-LDH, NFC-1, NFC-2 and NFC-4.The change of MB concentration without catalysts was also plotted and only negligible decrease was observed.Compared to pure Cu 2 O and NiFe-LDH, NiFe-LDH/Cu 2 O heterostructure photocatalysts exhibited enhanced catalytic activity and the MB removal efficiency increased from 20 (Cu 2 O) and 45 (NiFe-LDH) to 67, 88 and 93 for NFC-1, NFC-2 and NFC-4, respectively.Fig. S6 presented photodegradation efficiencies (C/C 0 ) of all the samples, which followed the order NFC-2 NFC-4 NFC-1 NFC-0 Cu 2 O. NFC-2 exhibits the highest photodegradation efficiency of 78, which is about 2.3 times of bare NiFe-LDH and 6 times of Cu 2 O. Fig. 10c plotted -ln (C/ C 0 ) as a function of irradiation time and the estimated reaction rate constants (k) are 0.0017, 0.0005, 0.0027, 0.0060 and 0.0041 min A1 for Cu 2 O, NiFe-LDH, NFC-1, NFC-2 and NFC-4, respectively.In addition, half-life value (t 1/2 ) was calculated 77 and equals to 408, 1386, 257, 116 and 169 min for Cu 2 O, NiFe-LDH, NFC-1, NFC-2 and NFC-4, respectively.The improved photocatalytic activity of NiFe-LDH/Cu 2 O can be attributed to the enhanced visible-light absorption and promoted charge carrier separation and transfer.Regarding to NFC-2 and NFC-4, it can be noted that the NFC-4 exhibits more pronounced effect of MB adsorption than NFC-2.Since both NFC-2 and NFC-4 have negative zeta potentials when pH is no more than 11 (Fig. S7) and thus tend to adsorb MB molecules.The more pronounced dye adsorption ability is likely due to the larger specific surface area of NFC-4 than that of NFC-2.The excess accumulation of organic contaminants on the catalyst surface could block active sites and attenuate incident light.Thus, the adsorption and photodegradation efficiency of NFC-4 is higher than NFC-2 whereas the photodegradation efficiency of NFC-2 is better than NFC-4. We also investigate the photo-stability of NiFe-LDH/Cu 2 O catalysts, crucial factor to practical application.As presented in Fig. 10d and Fig. S8, catalytic activity of NFC-2 and NFC-4 barely decreased after three consecutive cycles, suggesting reasonably stability and reusability.Fig. S9 showed SEM images and XRD patterns of freshly prepared NFC-4 and the sample collected after three cycles.There is only insignificantly change of morphology. To further investigate the photocatalytic mechanism of NiFe-LDH/Cu 2 O heterostructure catalysts, we tested the CH 4 yield from photoreduction of CO 2 under visible-light irradiation without any co-catalyst.As shown in Fig. 11, all the three heterostructure photocatalysts have higher efficiency than pure NiFe-LDH and Cu 2 O. NFC-4 has the highest CH 4 yield (3.33 mmol/g for 4 h), which is about 6.9 times of Cu 2 O and 5.6 times of NiFe-LDH.We note that no CH 4 was detected when there was no CO 2 or the reaction system was kept in dark, indicating that CH 4 was generated from photocatalytic reduction of CO 2 . Since the knowledge of band alignment is crucial to gain insight to the photocatalytic mechanism of heterostructure catalyst, we analyzed the CB and VB energy positions of pure NiFe-LDH and Cu 2 O.The VB edge (E VB ) position was estimated using an empirical equations 78: where c is electronegativity of semiconductor, E e 14 4.5 eV is free electron energy on the hydrogen scale and E g is band gap energy. The calculated c values are 6.60 and 5.12 and pure NiFe-LDH and Cu 2 O, respectively.Since E g 14 2.14 eV for NiFe-LDH and E g 14 2.05 eV for Cu 2 O, the CB and VB edges (E CB , E VB ) are estimated to be (1.03 eV, 3.17 separation process (Fig. 12a), the electrons will transfer from the CB of Cu 2 O to NiFe-LDH while holes move from the VB of NiFe-LDH to Cu 2 O.In this case, it is expected that neither In summary, we have successfully synthesized Z-scheme NiFe-LDH/Cu 2 O heterostructure photocatalysts, which exhibit enhanced photocatalytic performance on degradation of MB and reduction of CO 2 under visible-light illumination.Photocatalytic mechanism was investigated by combing UVeVis DRS, transient photocurrent response, EIS, ESR measurements and theoretical calculations.A plausible Z-scheme mechanism is proposed, which can achieve enhanced charge separation and transfer while maintain high redox potentials.This work may present a feasible strategy for designing low-cost and easy-synthesis heterostructure photocatalyst. Fig. 1.Schematic illustration of synthesis process of NiFe-LDH/Cu 2 O heterostructure photocatalysts. Fig. 2. SEM images of (a, b) NiFe-LDH, (c, d) Cu 2 O, (e) NFC-1, and (f) NFC-4. Fig. 3. (a, b) TEM images of NiFe-LDH; (c, d) TEM and HRTEM images of NFC-1; (e, f) TEM images of NFC-2 and NFC-4, respectively. Fig. 4. (a) XRD and (b) Raman spectra of as-prepared Cu 2 O, NFC-0 and NFC-4. Fig. S1 displayed the EDS spectra of Cu 2 O, NFC-1 and NFC-4.Pristine Cu 2 O is mainly composed of Cu and O with negligible amounts of impurities.The presence of Ni, Fe and Srelated peaks in the spectra of NFC-1 and NFC-4 suggested the successful growth of NiFe-LDH/Cu 2 O.The presence of S element is originated from the addition of Na 2 SO 3 during the synthesis process, which can react with Cu 2 O and simultaneously enter interlayer region of NiFe-LDH laminates.Fig. S2 showed the EDS mapping results of NFC-1, which indicated uniform distribution of that Ni, Fe, Cu, O and S in NiFe-LDH/Cu 2 O.The formation of NiFe-LDH/Cu 2 O heterostructure was further confirmed by results of TEM and HRTEM observations shown in Fig. 3.In the HRTEM image of NFC-1, lattice planes of NiFe-LDH and Cu 2 O were observed.The structure of NiFe-LDH/Cu 2 O was characterized by XRD and Raman measurements.Fig. 4a presented XRD diffraction patterns of NFC-4, NFC-0 and Cu 2 O.A set of strong and sharp Bragg diffraction peaks at 29.6 , 36.5 , 42.4 , 61.4 , 73.5 and 77.4 were observed for Fig. 5. (a) high-resolution XPS spectra of Cu 2p and (b) Auger spectra of Cu 2 O and NFC-4; (c) Ni 2p spectra and (d) Fe 2p spectra of NFC-0 and NFC-4. Fig. 6.N 2 adsorption-desorption isotherms of Cu 2 O, NFC-0 and NFC-4. Fig. 8.The band structures (a, c) and (b, d) the PDOS of Cu 2 O and NiFe-LDH. eV) and (A0.41 eV, 1.64eV) vs NHE for pure NiFe-LDH and Cu 2 O, respectively.Apparently, Cu 2 O and NiFe-LDH have staggered band alignment, i.e. both the CB and VB edges of Cu 2 O are more negative than the counterparts of NiFe-LDH.Both Cu 2 O and NiFe-LDH can be excited by visible-light irradiations, and free electrons and holes can generated in CB and VB, respectively.There are two plausible ways for the transportation of photo-excited charge carriers: type-II and Z-scheme.Assuming NiFe-LDH/Cu 2 O follows a conventional type-II charge carrier Fig. 9. Transient photocurrents of (a) NFC-0, NFC-1, NFC-2 and NFC-4, and (b) Cu 2 O under visible-light illumination; (c) Nyquist plots of all the samples (Inset is the equivalent circuit for fitting). 13 and 14.It can been seen clearly that the photocatalytic activity of NiFe-LDH/Cu 2 O heterostructure was suppressed in the presence of TEOA,BQ,AgNO 3 and IPA, quenchers for h , ,O A 2 , e A and ,OH, respectively.The generation of reactive oxygen species were further investigated by ESR experiments, where characteristic peaks of the DMPO- O 2 A and DMPO- OH were observed for NFC-4 dispersion under visible-light illumination.Moreover, no signal is detected under dark condition and the signal intensity increases with increasing of irradiation time.Thus, both O 2 A and OH radicals were generated under visible-light illumination, suggesting NiFe-LDH/Cu 2 O follows Z-scheme charge transfer mechanism.Under visible-light excitations, electrons in Fig. 10.(a) Time-resolved MB absorption spectra over NFC-2, in which A30 min corresponds freshly prepared MB solution (6 mg/L, C 0, fresh ); (b) adsorption and visible-light photodegradation efficiency the samples, and curves a-f corresponds to MB solution without catalyst, Cu 2 O, NiFe-LDH, NFC-1, NFC-2 and NFC-4, respectively; (c)eln (C/C 0 ) versus time; (d) photodegradation efficiency of NFC-4 for three consecutive runs. Fig. 11.(a) Photocatalytic reduction of CO 2 over Cu 2 O, NiFe-LDH, and heterostructure photocatalysts NFC-1, NFC-2 and NFC-4 under visible-light irradiation. Fig. 12. Schematic diagrams of (a) type-II and (b) Z-scheme charge transfer mechanism during photocatalytic MB degradation and CO 2 reduction. Fig. 13.Trapping experiments of NFC-4.IPA, AgNO3, BQ and TEOA were injected as quenchers for ,OH, e A ,,O A 2 and h , respectively. Fig. 14.ESR spectra of NFC-4 dispersed in MB solution under dark and visible-light illumination conditions for DMPO- O 2 A (a), and DMPO- OH (b). 79f Cu 2 O is less positive than the redox potential of H 2 O/ OH (1.99 V vs. NHE)79.Another choice would be Z-scheme mechanism 5e7, i.e. electrons in the CB of NiFe-LDH recombine with holes in the VB of Cu 2 O (Fig.12b).In this situation, electrons accumulated in the CB of Cu 2 O are able to reduce the absorbed O 2 to O 2 A radicals and holes accumulated in the VB of NiFe-LDH can oxidize H 2 O to OH radicals.To identify the main active species involved in the photocatalytic degradation process and interpret charge transfer mechanism, we carried out trapping experiments and ESR measurements, see Figs. O 2 A nor OH radicals would be generated since E CB of NiFe-LDH is less negative than the O 2 / O 2 A redox potential (A0.33 eV vs. NHE) 51 and E This work was supported by the Zhejiang Provincial Natural Science Foundation of China (LY19E020006, LY18E060005, LY18E020007 and LQ18E030005). The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The morphologies of the as-prepared samples were analyzed by SEM, TEM and HRTEM.SEM images demonstrated that pure NiFe-LDH has a flower-like structure made up of interconnected 2D nanosheets (Fig. 2a andb).Similar results have been reported previously and attributed to the tendency of LDHs to form aggregates due to strong particle-particle interaction 60.Moreover, well-distributed nanocubes with smooth surfaces and sharp edges can be seen clearly in the SEM images of pristine Cu 2 O (Fig. 2c andd).Upon the deposition of NiFe-LDH layers, the well-separated Cu 2 O nanocubes became aggregated and the smooth surfaces and sharp edges disappeared (Fig. 2e andf).It can be noted that the surface of NFC-4 is not as rough as that of NFC-1.The reason is not fully understood yet and might be related to the tendency of LDH to be oriented with the brucite-like OHOHOH 2 x layers parallel to the substrate surface 60. 15 phonon modes of Cu 2 O crystals 61,62.For NFC-0, the observed 143 cm A1 peak can be ascribed to the typical OMO bending mode of bruite-like layers while the complex band in the spectral region of 365e562 cm A1 were contributions from M A O and M A OH vibrations 63,64.Moreover, the 311 cm A1 band was likely related to the hydrogen bonds formed between OH units and the interlayer anions while the Raman feature at 725 cm A1 might be attributed to the interlayer CO 3 2A anions introduced during the hydrothermal synthesis of the reference NiFe-LDH 65.NFC-4 had similar Raman features to that of NFC-0, indicating the successful deposition of NiFe-LDH layers.XPS technique was used to investigate the chemical composition and oxidation states of Cu, Ni and Fe of the samples.As shown in the survey spectra, Cu and O were detected in Cu 2 O and Ni, Fe and O are found in NiFe-LDH (Fig. S3).In comparison, all these elements including Cu, Ni, Fe and O were observed in the spectra of NiFe-LDH/Cu 2 O heterostructure photocatalysts.Fig. 5a presented the Cu 2p spectra of pure Cu 2 O and NFC-4.For Cu 2 O, the two dominant peaks at binding energies (BE) of 932.7 eV and 952.5 eV can be ascribed to Cu 2p 3/2 and Cu 2p 1/2 for Cu or Cu 0 states, respectively 66,67.To further clarify these two oxidation states, Cu LMM Auger spectrum was recorded (Fig. 5b).The observed main peak at 570 eV is in good agreement with the reported BE value of Cu state 67, confirming that Cu is presented in Cu state in pristine Cu 2 O.In the spectrum of NiFe-LDH/Cu 2 O, shoulder peaks appeared at higher energy side of Cu 2p 3/2 and the Cu 2p 3/2 peak was positively shifted to 933.0 eV.Moreover, signal associated with CueS bonding was observed in the S 2p spectrum of NFC-4 (Fig. S4).Thus, it is likely that during the co-precipitation process of NiFe-LDH on Cu 2 O nanocubes, (S 2 O 3 ) 2-anions enter the interlayer space of the brucite-like layers (OHOHOH 2 x ) to balance their positive charges and some of the anions can react with Cu 2 O, forming CueS bonds at the interface between NiFe-LDH and Cu 2 O 68,69.The partial replacement of CueO bonds by CueS bonds results in strong interface interaction which can facilitate transfer of photo-excited charge carriers between Cu 2 O and NiFe-LDH.In addition, the extra Cu 2 signal observed for NFC-4 might be due to partial oxidation of Cu 2 O to CuO by Na 2 SO 3 70.Fig. 5c displayed the Ni 2p spectra of NFC-4 and NFC-0.For pure NiFe-LDH, the BE peaks at 856.3 eV and 874.1 eV can be ascribed to the Ni 2p 3/2 and Ni 2p 1/2 of Ni 2 state while peaks at 862.3 eV and 880.1 eV are associated with Ni 3 state 71,72.Upon formation of NiFe-LDH/ Cu 2 O heterostructure, The Ni 2p 3/2 peaks of NFC-4 are positively shifted to 856.6 eV (Ni 2 ) and 862.7 eV (Ni 3 ), suggesting charge transfer across the interface.Fig. 5d showed the Fe 2p spectra of NFC-4 and NFC-0.It can be found that pure NiFe-LDH has two main peaks at 712.8 eV and 724.8 eV, corresponding to the Fe 2p 3/2 and Fe 2p 1/2 of Fe 3 state 72,73.In the spectrum of NFC-4, main peaks at 713.0 eV and 726.3 eV along with their satellite peaks at 719.8 eV and 733.5 eV could be assigned to Fe 3 .Therefore, results of SEM, HRTEM, XRD, Raman and XPS measurements confirmed the successful fabrication of NiFe-LDH/Cu 2 O heterostructure photocatalysts with strong interface interaction. Fig. 6 showed the N 2 adsorption-desorption isotherms of Cu 2 O, NFC-0, NFC-2 and NFC-4, and the calculated surface areas are 15.798, 32.353, 16.249. and 25.191 m 2 /g, respectively, (Table S2).In addition, pure NiFe-LDH exhibits sheet-like adsorption behavior. Fig. 7 displayed the optical absorption spectra of all the samples.It can found that both NiFe-LDH and Cu 2 O showed optical absorption edges in the visible-light regime and the extracted band gap energies from the Tauc plots equaled to 2.14 eV and 2.05 eV, respectively, (Fig. S5).Compared to NiFe-LDH and Cu 2 O, heterostructure photocatalysts exhibited higher absorbance above 600 nm and the enhancement became more pronounced with increasing growth time.This would be helpful for the photocatalyst to make better use of solar energy and beneficial to improve photocatalytic activity.Moreover, band structure and partial density of states (PDOS) were calculated based on density functional theory (DFT) and presented in Fig. 8.The calculated band gap values are 2.29 eV and 2.32 eV for NiFe-LDH and Cu 2 O, respectively, which are in reasonably good agreement with the experimental results.From PDOS of NiFe-LDH, impurity levels associated with Fe d orbitals were found, which might give rise to the observed optical absorption band. Next, influence of constructing heterostructure structure on the separation and transfer behaviors of photo-excited charge carriers were investigated by photocurrent responses and EIS measurements.As shown in Fig. 9a andb, photocurrents rised rapidly upon switching on the light and then decreased and became nearly constant with increasing irradiation time.The superior photocurrent density of NiFe-LDH/Cu 2 O over that of pristine NiFe-LDH indicates better harvesting ability of light and promoted separation of electron-hole pairs, which plays crucial role on the enhancement of photocatalytic activity.Moreover, NFC-0, NFC-1, NFC-2 and NFC-4 samples showed spikes at the initial time of light illumination.Similar behaviors have been reported for other LDH-containing catalysts such as CoZnAl-LDH/RGO/g-C 3 N 4 44 and NiCo-LDH/ BiVO 4 15.Based on the previous works on transient photocurrent and physical model 70,74, the appearance of spikes indicates accumulation of photo-excited holes in NiFe-LDH at the semiconductor/electrolyte interface and reduced bulk recombination.Since NiFe-LDH is composed of 2D nanosheets of Ni(OH) 2 with Ni 2 being partially replaced by Fe 3 ions and interlayer chargebalancing anions, photo-generated charge carriers only needs to travel a short distance to reach the semiconductor/electrolyte junction.Fig. 9c showed Nyquist plots of all the samples.Since the semicircle at high frequency side is associated with the charge transfer resistance, the smaller diameters of NFC-1, NFC-2 and NFC-4 suggested that they had lower charge transfer barriers than that of pristine Cu 2 O and NiFe-LDH 75,76.The Nyquist plots were fitted using the equivalent circuit presented as the inset, and the extracted R p equaled to 3303, 2396, 1849, 1457 and 1278 U for NiFe-LDH, Cu 2 O, NFC-1, NFC-2 and NFC-4, respectively.The results of transient photocurrent and EIS measurements demonstrated that the fabrication of NiFe-LDH/Cu 2 O heterostructure can effectively facilitate separation and transfer of photo-generated charge carriers and thus promote photocatalytic activity. The influence of preparing NiFe-LDH/Cu 2 O heterostructure photocatalysts on the catalytic activity was investigated by MB degradation and CO 2 reduction under visible-light illumination.Fig. 10a plotted time-resolved absorption spectra of MB solutions collected during the photodegradation process over NiFe-LDH/ Cu 2 O.The clear drop of the 664 nm-absorption peak suggested decreasing of MB concentration.Fig. 10b showed C 0, fresh /C 0 as a function of time for Cu 2 O, NiFe-LDH, NFC-1, NFC-2 and NFC-4.The change of MB concentration without catalysts was also plotted and only negligible decrease was observed.Compared to pure Cu 2 O and NiFe-LDH, NiFe-LDH/Cu 2 O heterostructure photocatalysts exhibited enhanced catalytic activity and the MB removal efficiency increased from 20 (Cu 2 O) and 45 (NiFe-LDH) to 67, 88 and 93 for NFC-1, NFC-2 and NFC-4, respectively.Fig. S6 presented photodegradation efficiencies (C/C 0 ) of all the samples, which followed the order NFC-2 NFC-4 NFC-1 NFC-0 Cu 2 O. NFC-2 exhibits the highest photodegradation efficiency of 78, which is about 2.3 times of bare NiFe-LDH and 6 times of Cu 2 O. Fig. 10c plotted -ln (C/ C 0 ) as a function of irradiation time and the estimated reaction rate constants (k) are 0.0017, 0.0005, 0.0027, 0.0060 and 0.0041 min A1 for Cu 2 O, NiFe-LDH, NFC-1, NFC-2 and NFC-4, respectively.In addition, half-life value (t 1/2 ) was calculated 77 and equals to 408, 1386, 257, 116 and 169 min for Cu 2 O, NiFe-LDH, NFC-1, NFC-2 and NFC-4, respectively.The improved photocatalytic activity of NiFe-LDH/Cu 2 O can be attributed to the enhanced visible-light absorption and promoted charge carrier separation and transfer.Regarding to NFC-2 and NFC-4, it can be noted that the NFC-4 exhibits more pronounced effect of MB adsorption than NFC-2.Since both NFC-2 and NFC-4 have negative zeta potentials when pH is no more than 11 (Fig. S7) and thus tend to adsorb MB molecules.The more pronounced dye adsorption ability is likely due to the larger specific surface area of NFC-4 than that of NFC-2.The excess accumulation of organic contaminants on the catalyst surface could block active sites and attenuate incident light.Thus, the adsorption and photodegradation efficiency of NFC-4 is higher than NFC-2 whereas the photodegradation efficiency of NFC-2 is better than NFC-4. We also investigate the photo-stability of NiFe-LDH/Cu 2 O catalysts, crucial factor to practical application.As presented in Fig. 10d and Fig. S8, catalytic activity of NFC-2 and NFC-4 barely decreased after three consecutive cycles, suggesting reasonably stability and reusability.Fig. S9 showed SEM images and XRD patterns of freshly prepared NFC-4 and the sample collected after three cycles.There is only insignificantly change of morphology. To further investigate the photocatalytic mechanism of NiFe-LDH/Cu 2 O heterostructure catalysts, we tested the CH 4 yield from photoreduction of CO 2 under visible-light irradiation without any co-catalyst.As shown in Fig. 11, all the three heterostructure photocatalysts have higher efficiency than pure NiFe-LDH and Cu 2 O. NFC-4 has the highest CH 4 yield (3.33 mmol/g for 4 h), which is about 6.9 times of Cu 2 O and 5.6 times of NiFe-LDH.We note that no CH 4 was detected when there was no CO 2 or the reaction system was kept in dark, indicating that CH 4 was generated from photocatalytic reduction of CO 2 . Since the knowledge of band alignment is crucial to gain insight to the photocatalytic mechanism of heterostructure catalyst, we analyzed the CB and VB energy positions of pure NiFe-LDH and Cu 2 O.The VB edge (E VB ) position was estimated using an empirical equations 78: where c is electronegativity of semiconductor, E e 14 4.5 eV is free electron energy on the hydrogen scale and E g is band gap energy. The calculated c values are 6.60 and 5.12 and pure NiFe-LDH and Cu 2 O, respectively.Since E g 14 2.14 eV for NiFe-LDH and E g 14 2.05 eV for Cu 2 O, the CB and VB edges (E CB , E VB ) are estimated to be (1.03 eV, 3.17 separation process (Fig. 12a), the electrons will transfer from the CB of Cu 2 O to NiFe-LDH while holes move from the VB of NiFe-LDH to Cu 2 O.In this case, it is expected that neither"
  },
  {
    "title": "Conclusions",
    "content": "In summary, we have successfully synthesized Z-scheme NiFe-LDH/Cu 2 O heterostructure photocatalysts, which exhibit enhanced photocatalytic performance on degradation of MB and reduction of CO 2 under visible-light illumination.Photocatalytic mechanism was investigated by combing UVeVis DRS, transient photocurrent response, EIS, ESR measurements and theoretical calculations.A plausible Z-scheme mechanism is proposed, which can achieve enhanced charge separation and transfer while maintain high redox potentials.This work may present a feasible strategy for designing low-cost and easy-synthesis heterostructure photocatalyst. Fig. 1.Schematic illustration of synthesis process of NiFe-LDH/Cu 2 O heterostructure photocatalysts. Fig. 2. SEM images of (a, b) NiFe-LDH, (c, d) Cu 2 O, (e) NFC-1, and (f) NFC-4. Fig. 3. (a, b) TEM images of NiFe-LDH; (c, d) TEM and HRTEM images of NFC-1; (e, f) TEM images of NFC-2 and NFC-4, respectively. Fig. 4. (a) XRD and (b) Raman spectra of as-prepared Cu 2 O, NFC-0 and NFC-4. Fig. S1 displayed the EDS spectra of Cu 2 O, NFC-1 and NFC-4.Pristine Cu 2 O is mainly composed of Cu and O with negligible amounts of impurities.The presence of Ni, Fe and Srelated peaks in the spectra of NFC-1 and NFC-4 suggested the successful growth of NiFe-LDH/Cu 2 O.The presence of S element is originated from the addition of Na 2 SO 3 during the synthesis process, which can react with Cu 2 O and simultaneously enter interlayer region of NiFe-LDH laminates.Fig. S2 showed the EDS mapping results of NFC-1, which indicated uniform distribution of that Ni, Fe, Cu, O and S in NiFe-LDH/Cu 2 O.The formation of NiFe-LDH/Cu 2 O heterostructure was further confirmed by results of TEM and HRTEM observations shown in Fig. 3.In the HRTEM image of NFC-1, lattice planes of NiFe-LDH and Cu 2 O were observed.The structure of NiFe-LDH/Cu 2 O was characterized by XRD and Raman measurements.Fig. 4a presented XRD diffraction patterns of NFC-4, NFC-0 and Cu 2 O.A set of strong and sharp Bragg diffraction peaks at 29.6 , 36.5 , 42.4 , 61.4 , 73.5 and 77.4 were observed for Fig. 5. (a) high-resolution XPS spectra of Cu 2p and (b) Auger spectra of Cu 2 O and NFC-4; (c) Ni 2p spectra and (d) Fe 2p spectra of NFC-0 and NFC-4. Fig. 6.N 2 adsorption-desorption isotherms of Cu 2 O, NFC-0 and NFC-4. Fig. 8.The band structures (a, c) and (b, d) the PDOS of Cu 2 O and NiFe-LDH. eV) and (A0.41 eV, 1.64eV) vs NHE for pure NiFe-LDH and Cu 2 O, respectively.Apparently, Cu 2 O and NiFe-LDH have staggered band alignment, i.e. both the CB and VB edges of Cu 2 O are more negative than the counterparts of NiFe-LDH.Both Cu 2 O and NiFe-LDH can be excited by visible-light irradiations, and free electrons and holes can generated in CB and VB, respectively.There are two plausible ways for the transportation of photo-excited charge carriers: type-II and Z-scheme.Assuming NiFe-LDH/Cu 2 O follows a conventional type-II charge carrier Fig. 9. Transient photocurrents of (a) NFC-0, NFC-1, NFC-2 and NFC-4, and (b) Cu 2 O under visible-light illumination; (c) Nyquist plots of all the samples (Inset is the equivalent circuit for fitting). 13 and 14.It can been seen clearly that the photocatalytic activity of NiFe-LDH/Cu 2 O heterostructure was suppressed in the presence of TEOA,BQ,AgNO 3 and IPA, quenchers for h , ,O A 2 , e A and ,OH, respectively.The generation of reactive oxygen species were further investigated by ESR experiments, where characteristic peaks of the DMPO- O 2 A and DMPO- OH were observed for NFC-4 dispersion under visible-light illumination.Moreover, no signal is detected under dark condition and the signal intensity increases with increasing of irradiation time.Thus, both O 2 A and OH radicals were generated under visible-light illumination, suggesting NiFe-LDH/Cu 2 O follows Z-scheme charge transfer mechanism.Under visible-light excitations, electrons in Fig. 10.(a) Time-resolved MB absorption spectra over NFC-2, in which A30 min corresponds freshly prepared MB solution (6 mg/L, C 0, fresh ); (b) adsorption and visible-light photodegradation efficiency the samples, and curves a-f corresponds to MB solution without catalyst, Cu 2 O, NiFe-LDH, NFC-1, NFC-2 and NFC-4, respectively; (c)eln (C/C 0 ) versus time; (d) photodegradation efficiency of NFC-4 for three consecutive runs. Fig. 11.(a) Photocatalytic reduction of CO 2 over Cu 2 O, NiFe-LDH, and heterostructure photocatalysts NFC-1, NFC-2 and NFC-4 under visible-light irradiation. Fig. 12. Schematic diagrams of (a) type-II and (b) Z-scheme charge transfer mechanism during photocatalytic MB degradation and CO 2 reduction. Fig. 13.Trapping experiments of NFC-4.IPA, AgNO3, BQ and TEOA were injected as quenchers for ,OH, e A ,,O A 2 and h , respectively. Fig. 14.ESR spectra of NFC-4 dispersed in MB solution under dark and visible-light illumination conditions for DMPO- O 2 A (a), and DMPO- OH (b). 79f Cu 2 O is less positive than the redox potential of H 2 O/ OH (1.99 V vs. NHE)79.Another choice would be Z-scheme mechanism 5e7, i.e. electrons in the CB of NiFe-LDH recombine with holes in the VB of Cu 2 O (Fig.12b).In this situation, electrons accumulated in the CB of Cu 2 O are able to reduce the absorbed O 2 to O 2 A radicals and holes accumulated in the VB of NiFe-LDH can oxidize H 2 O to OH radicals.To identify the main active species involved in the photocatalytic degradation process and interpret charge transfer mechanism, we carried out trapping experiments and ESR measurements, see Figs. O 2 A nor OH radicals would be generated since E CB of NiFe-LDH is less negative than the O 2 / O 2 A redox potential (A0.33 eV vs. NHE) 51 and E This work was supported by the Zhejiang Provincial Natural Science Foundation of China (LY19E020006, LY18E060005, LY18E020007 and LQ18E030005). The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper."
  }
]