[
  {
    "title": "Doi",
    "content": "10.1016/j.cplett.2020.137467"
  },
  {
    "title": "Article_Title",
    "content": "Study on optical properties of alkali metal doped g-C3N4 and their photocatalytic activity for reduction of CO2"
  },
  {
    "title": "Abstract",
    "content": "Alkali metal (Li, Na, K and Rb) doped g-C 3 N 4 were successfully prepared by water bath heating and high temperature calcination method. Absorption spectra of Rb doped g-C 3 N 4 increases remarkably over 500-1100 nm wavelengths. Rb doped g-C 3 N 4 showed the best photo-reduction CO 2 performance with CO productivity about 12.1 mol g -1 ."
  },
  {
    "title": "Experimental",
    "content": "LiNO 3 (99), NaNO 3 (99), KNO 3 (99), RbNO 3 (99) were all purchased from Sinopharm Reagent Co., Ltd.Melamine (AR, 98) is supported from Aladdin Chemistry Co., Ltd.And the experimental water is deionized water. 3.0 g melamine with 0.1 g alkali metal nitrates (LiNO 3 , NaNO 3 , KNO 3 , RbNO 3 ) were respectively dispersed in a beaker containing 15 mL deionized water and ultrasound for 5 h.Then place it in a water bath and stir at 70 C until the solution is evaporated to dryness.After that, place the above finely grind mixture into a temperature-programmed muffle furnace and calcined at 500 C for 2 h at a heating rate of 2.3 Cmin -1 .Subsequently, grind the yellow product to powder, and calcined at 350 C for 3 h at a heating rate of 20 Cmin -1 at atmosphere, the alkali metal doped g-C 3 N 4 (Li-CN, Na-CN, K-CN, Rb-CN) were obtained. The crystal structure of a series of materials were investigated by means of a D/max-RAX-ray diffractometer (Rigaku, Japan).The Fourier transform infrared (FT-IR) spectrometer was collected by a Nicolet Magna-IR 550 spectrometer (Nicolet, USA).The optical properties were studied by the UV-vis spectrophotometer (Shimadzu UV-3600).Electrochemical impedance spectroscopy was studied by three-electrode electrochemical station of CHI 660C.In addition, the CO 2 temperature-programmed desorption are carried out by Quantachrome autosorb-iQ-C chemisorption analyzer."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The typical XRD diffraction patterns of g-C 3 N 4 and the different alkali metal doped g-C 3 N 4 are displayed in Fig. 1A.It can be observed clearly that the (1 0 0) and (0 0 2) peaks are at 13.1and 27.4, agreed well with the PDF no.50-1250 data 192021, it means the g-C 3 N 4 is successfully synthesized.Moreover, the two characteristic peaks can also be found in the XRD patterns of the differents alkali metal doped g-C 3 N 4 photocatalyst, which are consistent with two crystal planes of g-C 3 N 4 , this illustrates the different alkali metal dopants have no effect to the frame structure of CN.It's worth noting that, for the alkali metal doped g-C 3 N 4 photocatalyst, the peak at 13.1becomes stronger.The results means that the crystallinity and structure of the doped g-C 3 N 4 was enhanced 222324.The changing must originate from the doped alkali metal. Fig. 1B is the FT-IR spectra of different materials.The absorption peaks of 3400 cm -1 -3000 cm -1 in FT-IR spectra are attribute to the stretching vibrational modes of NH and eNH of g-C 3 N 4 252627, which is shown in Fig. 1B(a).The typical stretching at 1251, 1325, 1419, 1575, and 1639 cm -1 the are CN heterocycles modes of g-C 3 N 4 282930, meanwhile, the characteristic bending vibration of s-triazine units (808 cm -1 ) can also be observed 313233.Therefore the FT-IR result indicates that the pure g-C 3 N 4 is successfully compounded.In contrast, the main representative peaks of g-C 3 N 4 in Fig. 1B(b-e) are almost no change after inserting of different alkali metal (Li, Na, K and Rb), but the peaks at 808 cm -1 and 3400 cm -1 -3000 cm -1 become stronger, which implies the doped Li, Na, K and Rb have strong interaction to the CN heterocycles structure of g-C 3 N 4 . The morphology of pure g-C 3 N 4 and Rb-CN are investigated by TEM.As seen from Fig. 2a-b, the pure g-C 3 N 4 presents irregular blockystructure, also be curled and stacked together, this may be the main reason of pure g-C 3 N 4 weak light absorption, also blocked electronic transmission and possess less active sites for CO 2 activation.However, it could be seen from the TEM images of Rb-CN (Fig. 2c-d), the Rb-CN displays thinner sheet structure with some mesoporous on the surface, the sheet porous structure may result from the doping of Rb, and the porous structure may convenient transfer channel, longer contact time and good harvesting ability for light and CO 2 .Therefore, the Rb-CN may showed enhanced photoreduction CO 2 activity. The UV-vis DRS spectra of the undoped and the doped g-C 3 N 4 is researched to investigate the optical property of all materials.In Fig. 3, the absorption edge of the g-C 3 N 4 is around 465 nm.Remarkably, the photoresponse of all the different alkali metal doped g-C 3 N 4 moves towards bigger wavelength, the results must ascribed to the doped alkali metal, which can change the electronic structure, for enhancing the light absorption efficiency 343536.It is noteworthy that the Rb-doped g-C 3 N 4 has strong light absorption capacity, it means that the Rb affect has the strong influence to g-C 3 N 4 of the optical abilities. In Fig. 3b, the band gap of pure g-C 3 N 4 is calculated to be about 2.65 eV 373839.When doped with Li, Na, K and Rb, the band gap is narrowed.And the band gap of Rb doped g-C 3 N 4 is significantly much narrower than that of the others, about 2.0 eV, followed by potassium doped g-C 3 N 4 .Therefore, the results show that the K doped and Rb doped g-C 3 N 4 material can make full use of visible light. In this section, the computation model of g-C 3 N 4 before and after doping is built based on the first principle, as-shown in Fig. 4a.The exchange-correlation function was generalized gradient approximation (GGA), ultrasoft pseudo-potential was used for geometric relaxation.The specific parameters were set as follows: the cut-off energy 310 eV, self-consistent convergence precision 5 10 -6 eV/atom and k-point 2 2 1 were chosen in this paper. The slab model of 2 2 1 supercell containing 24 C and 24 N was built for the intrinsic g-C 3 N 4 , as shown of Fig. 4a.According to the geometric symmetry of system, the 14 inequivalent positions of C for substitutions were considered for energy calculations.From results of doping energies of models with substitutions at different positions, optimal structures of g-C 3 N 4 with carbon substituted by alkali metals (Li, Na, K, Rb) were found, as showed in Fig. 4b-e. In the linear response range, the macroscopic optical response function of solids can be described by the complex dielectric response function ( 1) and complex refractive index (2) 40. (1) According to the definition of direct transition probability and Kramers-Kronig dispersion relation, absorption coefficient and photoconductivity can be deduced by relevant equations respectively 41,42.Fig. 5a-b shows dielectric functions of g-C 3 N 4 with and without alkali metal doping.In contrast to pure g-C 3 N 4 and doped with Li and Na, dielectric functions of K doped and Rb doped g-C 3 N 4 move to lower energies, and obvious peaks located at 3.0 eV are found in both real and imaginary part.For the Na doped g-C 3 N 4 , 1 (0) form its dielectric function, which corresponds to the static dielectric constant, is obviously lower than other g-C 3 N 4 . Absorption spectra for g-C 3 N 4 with and without alkali metal doping are shown in Fig. 5c.It is clear from these data that the absorption of Rb doped g-C 3 N 4 in the interval of 500-1100 nm wavelength is significantly higher than that of other g-C 3 N 4 , which is in good agreement with the experimental enhancement of UV-Vis result in this wavelength range for Rb doped g-C 3 N 4 as shown in Fig. 3a. Properties of photoconductivity of pure and doped g-C 3 N 4 doping are shown in Fig. 5d.It can be seen that the g-C 3 N 4 doped by alkali metals are more photoconductive for most wavelengths than the pure g-C 3 N 4 , especially for Rb which shows an obvious enhancement among alkali metals, inferring that Rb doping is the best choice of alkali metal doping to improve conductivity of g-C 3 N 4 under illumination.Furthermore, from the EIS spectrum in Fig. 6, the arc radius of Rb doped g-C 3 N 4 is much smaller than that of other alkali metals doped g-C 3 N 4 , which further confirmed that the Rb doped g-C 3 N 4 has the lowest electron transport hindrance, consistent with the DFT results of Fig. 5d. As known that the optical performance is the one reason for affecting the photocatalytic activity, therefore, we verification it by photocatalytic CO 2 reduction.The yields of CO of the as-prepared different alkali metal doped and the undoped g-C 3 N 4 samples are shown in Fig. 7a.The CO yields of pure g-C 3 N 4 and different alkali metal (Li, Na, K and Rb) doped g-C 3 N 4 during reduction CO 2 are 3.6, 5.8, 7.4 9.8 and 12.1 mol g -1 , respectively.Obviously, the photo-reduction CO 2 activity of Rb doped g-C 3 N 4 is higher than that of the others, indicating that the optical performance has significantly effect to the conversion rate of CO.Moreover, Fig. 7b shows the recycling results of Rb doped g-C 3 N 4 reduction CO 2 , after four cycles the experiments, the materials still keep an excellent photocatalytic activity, which indicates that the Rb doped g-C 3 N 4 photocatalyst has good stability. According to the previous reports and our analysis 434445, The photocatalytic CO 2 reduction process of Rb-CN is explained as following: Firstly, the CO 2 was adsorbed on the surface active sites of Rb-CN.Under the light illumination, the electrons generated in the interior of Rb-CN will migrate to its surface and activate the adsorbed CO 2 .Then, the CO 2 will convert to the CO 2 intermediate, where the \"\" represents the surface adsorption state 4647.Immediately, the CO 2 will be reduced to CO by obtaining two electrons.The photoreduction CO 2 schematic illustration is showed as Fig. 8. CO 2 2H 2e - CO H 2 O (6)"
  },
  {
    "title": "Conclusions",
    "content": "All in all, we have studied the effect of alkali metals on the optical properties of g-C 3 N 4 .The pure g-C 3 N 4 and alkali metal doped g-C 3 N 4 were prepared by solvothermal method and high temperature calcination method, respectively.At the same time, the samples were also characterized by XRD and FT-IR.The UV-Vis DRS results indicated that the K and Rb dopants broaden the spectrum of g-C 3 N 4 obviously.Based on the DFT calculations, the intrinsic and metals doping of g-C 3 N 4 were studied.The computational results show that K and Rb dopants can enlarge the absorption range of g-C 3 N 4 , which is consistent with the experimental results.This research provides an important theoretical basis for the preparation of doped g-C 3 N 4 photocatalyst with excellent performance. Hao Zhang: Writing -original draft, Visualization.Yunqing Tang: Investigation, Writing -review editing.Zhixiang Liu: Supervision, Methodology.Zhi Zhu: Methodology.Xu Tang: Supervision.Yemei Wang: Data curation. Fig. 1.XRD patterns (A) and FT-IR spectra (B) of the pure g-C 3 N 4 (a), Li-CN (b), Na-CN (c), K-CN (d) and Rb-CN (e). Fig. 2. TEM images of pure g-C 3 N 4 (a-b) and Rb-CN (c-d) with different magnification. Fig. 4. Optimized structures of intrinsic g-C 3 N 4 and alkali metal doped g-C 3 N 4 : (a) intrinsic g-C 3 N 4 , (b) Li doped g-C 3 N 4 , (c) Na doped g-C 3 N 4 , (d) K doped g-C 3 N 4 , (e) Rb doped g-C 3 N 4 . Fig. 6.EIS of g-C 3 N 4 with different alkali metal doping. Fig. 8. Illustration of the charge transfer processes Rb-CN for reduction CO 2 ' This study was supported by grants from Jiangsu Provincial Key Research and Development Program (BE2016721), and Jiangsu Province TCM Project (No. YB2015184).The China Postdoctoral Science Foundation Funded Project (No. 2019M651729), the Natural Science Foundation of Jiangsu Province (No. BK20190862).All the authors declare that they have no conflict of interest. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper"
  }
]