[
  {
    "title": "Doi",
    "content": "10.1016/j.ceramint.2014.04.094"
  },
  {
    "title": "Article_Title",
    "content": "Green synthesis of methanol by photocatalytic reduction of CO2 under visible light using a graphene and tourmaline co-doped titania nanocomposites"
  },
  {
    "title": "Abstract",
    "content": "In this work, we studied the effect of tourmaline percent on the photocatalytic activity of mesoporous TiO 2 -graphene.To evaluate and compare the physical properties of the prepared materials, X-ray diffraction analysis, BET measurements, UV-vis spectroscopy, PL spectroscopy, and TEM were applied.To determine the photocatalytic efficiency of the prepared materials, the photocatalytic reduction of CO 2 was evaluated.The results indicate that tourmaline particles can obviously influence the structures of TiO 2 and enhance photocatalytic activity due to their spontaneous permanent polarity.The quantum yield (QE) of the TiO 2 ; G (1)-TiO 2 ; TG (1)-TiO 2 ; G (1)-T (1)-TiO 2 ; G (1)-T (1.5)-TiO 2 ; G (1)-T (2)-TiO 2 ; G (1)-T (2.5)-TiO 2 ; and G (1)-T (3)-TiO 2 is 0.0049; 0.0178; 0.0357; 0.0580; 0.0670; 0.0922; 0.1072; and 0.1012 mmol g A 1 h A 1 , respectively.Moreover, the excellent photocatalytic activity of the composites was fully maintained after six photocatalytic cycles, which may be attributed to the physicochemical property of tourmaline, graphene and the mixed-phase of anatase and brookite in the graphene and tourmaline co-doped titania composite."
  },
  {
    "title": "Experimental",
    "content": "Titanium tetraisopropoxide (Ti(Oi-Pr) 4 , abbreviated TTIP, 98.0) and graphite oxide ( 499) were purchased from Aldrich.Tourmaline powder was purchased from Beijing Tian Mei Kang Technology Co., Ltd., China.All chemicals were used without further purification.Double distilled water was used in the catalyst preparation and subsequent catalytic tests.At room temperature, 3.7 mL TTIP was added dropwise to 10 mL acidified EtOH (acidification reagent: 0.5 mL, 12 mol L A 1 HCl) and vigorously stirred for 30 min.At the same time, 0.01 g graphite oxide and 0.01 g tourmaline powder was uniformly dispersed into two beakers of EtOH/H 2 O (5.0 mL/ 2.5 mL) solution using 500 W and 100 W ultrasonic crasher respectively for 1 h.The above graphite oxide/EtOH/H 2 O and tourmaline/EtOH/H 2 O were successively added dropwise to the TTIP/EtOH/HCl solution.The sol mixture was stirred until a brown gel was obtained.The gel was subjected to hydrothermal treatment at 120 1C for 24 h.The resulting hydrogel was slowly dehydrated at 40 1C for 24 h, 60 1C for 12 h, and 80 1C for 1 h until a complete gel particulate was formed.After thermal treatment at 100 1C for 24 h, the obtained powder was washed using double distilled water at room temperature for 20 min (repeat three times).The produced samples were calcined at 350 1C for 2 h.The final product was denoted as G (1)-T (1)-TiO 2 , where G (1) and T (1) represent that the graphene and tourmaline loadings in the composite were 1 and 1, respectively.In addition, graphene, TiO 2 , G (1)-TiO 2 , T (1)-TiO 2 , G (1)-T (1.5)-TiO 2, G (1)-T (2)-TiO 2, G (1)-T (2.5)-TiO 2 and G (1)-T (3)-TiO 2 samples were also prepared using the same method. The specific surface area of the prepared samples was evaluated from the adsorption-desorption isotherms of nitrogen at A 196 1C and detected using a Nova 2000 series apparatus (Chromatech).The specific surface areas of materials were determined using the Brunauer-Emmett-Teller (BET) method and calculated by applying the BET equation.All samples were degassed under vacuum at 100 1C for 2 h prior to measurements.Particle size was determined by X-ray diffraction (XRD) analysis carried out at room temperature with a Bruker axis D8 instrument using Cu K radiation ( 14 1.540 A).The crystallite sizes of the composite catalysts were calculated using the Scherrer equation where d is the average particle size of the material under investigation, B is the Scherer constant (0.89), is the wavelength of the X-ray beam, 1/2 is the full width at halfmaximum of the diffraction peak, and is the diffraction angle. For the heterostructured samples, the weight fraction of every component can be calculated from where W A and W B separately represent the weight fraction of anatase and brookite, respectively, coefficients k A and k B are 0.886 and 2.721, respectively, and I A and I B denote the integrated intensity of anatase (101) peak and brookite (121) peak, respectively.The surface morphology of all prepared catalysts was examined using a transmission electron microscope (JEOL-JEM-1230).Before loading into the TEM, samples were suspended in ethanol, followed by ultra-sonication for 30 min.Band-gap energies of the samples were determined by UV-visible diffuse reflectance spectra (UV-vis-DRS) in air at room temperature in the wavelength range of 200-800 nm using a UV/vis/NIR spectrophotometer (V-570, JASCO, Japan).The band gap energies were calculated employing the following equation: where E g is the band gap (eV) and is the wavelength of the absorption edges in the spectrum (nm).Photoluminescence (Pl) emission spectra were recorded with a Shimadzu RF-5301fluorescence spectrophotometer.X-ray photoelectron spectroscopy (XPS) studies were performed using a Thermo Scientific K-ALPHA, XPS, England.Raman spectra were collected at room temperature using a JASCO RFT-6000 spectrometer. The photocatalytic reduction of CO 2 was carried out in an aqueous system under visible light irradiation.0.05 g catalyst was dispersed in 50 mL distilled water containing sodium bicarbonate (NaHCO 3 , 0.08 M) and 0.08 M HCl.The solution was prepared in a 30 cm A 15 cm A 5 cm reactor.Fixed catalyst concentration was used in all experiments, aiming to eliminate uncertainties associated with light reflection and reactor geometry.The solution was purged with N 2 to remove oxygen and stood in dark for 30 min until reaching adsorption-desorption equilibrium.The solution temperature was kept constant by a water bath.Visible light irradiation was provided by a 500 W high-pressure Xe lamp placed above the reactor.A UV cut-off filter consisting of 2 M NaNO 2 solution was applied to cut off the entire UV region (o 400 nm).The photocatalytic reaction was continued up to 9 h and, at every 3 h interval, the reactor was allowed to cool down naturally for CH 3 OH desorption from the catalyst.The sample solution was centrifuged and analyzed by GC-FID for CH 3 OH.The rate of CH 3 OH evolution was defined as the total amount of evolved CH 3 OH divided by the reaction time.The following reaction was proposed for the selective production of CH 3 OH We where I is light intensity (0.12 mW cm A 2 for visible light), S is the irradiated area of the reactor (30 cm A 15 cm), E is the photon energy (4.97 A 10 A 19 J at 400 nm), and N A is the Avogadro number (6.022 A 10 23 mol A 1 )."
  },
  {
    "title": "Results_and_Discussion",
    "content": "To investigate the phase structure and the phase composition of materials, XRD was used.Fig. 1 shows XRD patterns of the samples.The peaks of the anatase (JCPDS 78-2486) and brookite (JCPDS 76-1937) are observed in the samples of the TiO 2 , G-TiO 2 , T-TiO 2 and G-T-TiO 2 composites.Meanwhile, compared to TiO 2 , the decrease of the peak intensity of the TiO 2 in the TiO 2 / tourmaline-graphene composites can be attributed to the graphene and tourmaline particles loaded on the surface of the TiO 2 . The morphology of the prepared samples was characterized by TEM measurements.Fig. 2a confirms the formation of graphene nanosheets.Fig. 2b reveals that the tourmaline has a uniform block structure after undergoing ultrasonic crasher treatment.Fig. 2c shows that pure TiO 2 had a spherical shape.Fig. 2d and e reveals that both graphene nanosheets and tourmaline blocks were evenly covered on the TiO 2 surface.Graphene and tourmaline simultaneously covered the TiO 2 surface, as shown in Fig. 2f. The compositional and structural information on pure TiO 2 and the corresponding composites were characterized by using the XPS surface probe technique and Raman scattering spectra (Figs. 3 and4).The XPS surface probe technique found some shift in the Ti 2p and O 1s binding energies for G (1)-TiO 2 composite compared with TiO 2 (Fig. 3a andb), indicating that the electrons transformation at the interface between graphene and TiO 2 perturbs the Ti or O electronic environment.In addition, for the G (1)-TiO 2 composite, the C 1s binding energy was separated to four peaks, which were derived from CQC,C-C, C-O, and COO (Fig. 3c).For G (1.0)-TiO 2 , the results show that two Raman scattering peaks were also detected which corresponded to the symmetry of the A1g and the E2g modes of the sp 2 carbon atoms.For the G (1.0)-T (1.0)-TiO 2 composite, it was difficult to observe the tourmaline-related Raman signal because of the unchanged polarizability of the tourmaline.Two Raman scattering peaks which corresponded to the symmetry of the A1g and the E2g modes of the sp 2 carbon atoms were also detected.The XPS and Raman scattering spectra results showed that the G (1.0)-TiO 2 and G (1.0)-T (1.0)-TiO 2 composites exhibit obvious surface defects based on the above XPS and Raman scattering spectra results. The BET surface area of the pure TiO 2 , the graphene-TiO 2 , and the tourmaline-TiO 2 and TiO 2 /graphene-tourmaline composites are shown in Table 1.The BET surface area of TiO 2 /graphenetourmaline composites is much higher than that of the pure TiO 2 , the graphene-TiO 2 , and the tourmaline-TiO 2 .Fig. 5 shows that the shape of the isotherm of the TiO 2 /graphene-tourmaline composite exhibited a type IV isotherm with H 3 hysteresis-loop according to the IUPAC classification, which indicates the presence of a mesoporous structure (2-50 nm). The UV-vis diffuse reflectance spectra of the pure TiO 2 , the graphene-TiO 2 , the tourmaline-TiO 2 , and the TiO 2 /graphenetourmaline composites are displayed in Fig. 6.The loading of tourmaline into the pure TiO 2 , the graphene-TiO 2 caused a red-shift toward a higher wavelength, from 442 to 544 nm for different loadings of tourmaline compared to which had a wavelength of about 413 nm.The direct band gap energy for the pure TiO 2 , the graphene-TiO 2 , the tourmaline-TiO 2 , and the TiO 2 / graphene-tourmaline composites was calculated from their reflection spectra.The band gap energies were calculated employing the following equation: where E g is the band gap (eV) and is the wavelength of the absorption edges in the spectrum (nm).The results are tabulated in Table 1.It is clear that the energy gap decreased with the increase in the tourmaline up to 2.5 wt.Also, at a higher concentration of tourmaline, i.e., 3 wt, the band gap increased again.This indicated that there was an optimum value for the doping of tourmaline. Photoluminescence (Pl) emission spectra have been used to study the transfer of photogenerated electrons and holes and to understand the separation and recombination of photogenerated charge carries.In order to investigate the photoelectric properties of the prepared samples, the Pl spectra were detected for the pure TiO 2 , the graphene-TiO 2 , the tourmaline-TiO 2 , and the Binding Energy (eV) TiO 2 /graphene-tourmaline composites exited at 265 nm at room temperature, as shown in Fig. 7.It is clear that Pl intensity largely decreased with the increase of the tourmaline percent up to 2.5 wt.At a higher concentration of tourmaline, i.e., 3 wt, the Pl intensity increased again, which is in agreement with UV-vis results. 3.6.Photocatalytic activity 3.6.1.Effect of tourmaline percent on photocatalytic activity of TiO 2 /graphene-tourmaline composites for reduction of CO 2 The photocatalytic activity of the pure TiO 2 , the graphene-TiO 2 , the tourmaline-TiO 2 , and the TiO 2 /graphene-tourmaline composites was evaluated in terms of photoreduction of CO 2 to CH 3 OH under visible (4 400 nm) light irradiation.Generally, CH 3 OH is formed by CO 2 photoreduction of the photocatalyst upon visible light irradiation.Fig. 8 shows the effect of preparation methods on methanol yield.The results show that the photocatalytic activities of both single and codoped composites were found to be higher than that of pure TiO 2 .The methanol yield for TiO 2 ; G (1)-TiO 2 ; TG (1)-TiO 2 ; G (1)-T (1)-TiO 2 ; G (1)-T (1.5)-TiO 2 ; G (1)-T (2)-TiO 2 ; G (1)-T (2.5)-TiO 2 ; and G (1)-T (3)-TiO 2 are 0.033; 0.12; 0.24; 0.39; 0.45; 0.62; 0.72; and 0.68 mmol g A 1 h A 1 , respectively.The excellent photocatalytic activity of the single or co-doped TiO 2 -based can be attributed to three reasons.First, the incorporation of graphene and tourmaline within the TiO 2 matrix can result in enhanced quantum efficiency.This enhancement contributes to the electron-transporting and electron-accepting properties of graphene and tourmaline 21,24.Graphene serves as the transporter of photogenerated electrons from the anatase TiO 2 , whereas tourmaline serves as the acceptor of photogenerated electrons.Both electron-transporting and electron-accepting properties effectively suppress the recombination of e A -h pairs, leaving more photogenerated holes to form reactive species and facilitate the photocatalytic reduction of CO 2 .Second, the band gap of the graphene-doped composites was narrower compared with pure TiO 2 , which had the positive effect of increasing the photocatalytic activity of TiO 2 (Fig. 4).The charge transfer band of graphene-doped composites was suitable for the absorption of light with a wavelength in the range of 320-780 nm, which resulted in species that were more reactive.Third, the perfect surface physical and chemical properties played important roles in enhancing the photocatalytic activity of as-prepared materials.Nano-titania and the corresponding single or co-doped composites, which were prepared using solvothermal synthesis, exhibited high crystallinity, small particle size, and a large BET surface area.These favorable factors can improve photocatalytic reactivity by increasing the number of active sites and allowing for a more efficient transport of guest species throughout the photocatalyst.Our estimates of the quantum yield (QE) of the TiO 2 ; G (1)-TiO 2 ; TG (1)-TiO 2 ; G (1)-T (1)-TiO 2 ; G (1)-T (1.5)-TiO 2 ; G (1)-T (2)-TiO 2 ; G (1)-T (2.5)-TiO 2 ; and G (1)-T (3)-TiO 2 are shown in Table 2. The amount of the photocatalyst was another important factor in the photocatalytic reduction of CO 2 under visible light irradiation.The amount of G (1)-T (2.5)-TiO 2 composite ranged from 0.5 to 2.5 g L A 1 in 0.08 M of the employed solutions of NaHCO 3 .As shown in Fig. 9, we observed an increase in the methanol yield by increasing the amount of catalyst from 0.5 g L A 1 to 1.5 g L A 1 .However, further increases of the photocatalyst amount above 1.5 g L A 1 were less effective in changing the methanol yield.This can be justified by increasing the number of active sites on the photocatalyst by increasing its amount, consequently increasing the number of the absorbed CO 2 molecules and photons.However, at photocatalyst dosages above 1.5 g L A 1 , the methanol yield decreased because the excess photocatalysts blocked the light penetration. The recycling of catalysts is one of the key steps in assessing the practical application of photocatalysts and in developing heterogeneous photocatalysis technology for wastewater treatment.An examination of the photocatalytic activity of the recycled G (1)-T (2.5)-TiO 2 composite was carried out.The methanol yield was 0.89 mmol g A 1 h A 1 during the first six cycles.The results revealed that the separation of the photocatalyst was effective, and thus the photocatalyst is stable and promising for environmental remediation."
  },
  {
    "title": "Conclusions",
    "content": "Mesoporous graphene and tourmaline single and co-doped TiO 2 composites were prepared by the sol-gel method and the effect of tourmaline percent on physicochemical properties of graphene-TiO 2 was studied.The results reveal that G (1)-T (2.5)-TiO 2 composite has a high surface area of 340 m 2 /gm and a small band gap of 2.28 eV.Therefore, the tourmaline percent plays an important role in determining the surface area and band gap of the produced graphene-TiO 2 .The high photocatalytic activities can be attributed to the enhanced quantum efficiency, narrowed band gap, and perfect surface physical and chemical properties of the composites.The catalyst can be reused with no loss of activity over the first 6 cycles.Table 2 Effect of preparation methods on methanol yield and quantum yield. Fig. 1.XRD patterns of TiO 2 , G-TiO 2 , T-TiO 2 and G-T-TiO 2 composites. Fig. 2. TEM images of (a) G, (b) T, (c) TiO 2 , (d) G-TiO 2 , (e) T-TiO 2 and (f) G 1-2.5 T-TiO 2 composites. Fig. 3. XPS survey spectra for the TiO 2 and G (1)-TiO 2 composite in the Ti 2p (a), O 1s (b), and C 1s (c) binding energy regions. Fig. 4. Raman scattering spectra of G (1 )-TiO 2 (a) G (1 )-T (1)-TiO 2 . Fig. 5. N 2 adsorption/desorption isotherm of G (1)-T (2.5)-TiO 2 composite. Fig.8.Effect of type of catalyst on methanol yield, where (A) TiO 2 ; (B) G (1)-TiO 2 ; (C) TG (1)-TiO 2 ; (D) G (1)-T (1)-TiO 2 ; (E) G (1)-T (1.5)-TiO 2 ; (F) G (1)-T (2)-TiO 2 ; (G) G (1)-T (2.5)-TiO 2 and (H) G (1)-T (3)-TiO 2 . Fig. 9. Effect of amount of G (1)-T (2.5)-TiO 2 photocatalyst on the methanol yield. carried out control experiments in dark first, and no CH 3 OH was detected for all tested catalysts.Similarly, no CH 3 OH was detected for control experiments under light irradiation but without a catalyst.Preliminarily, results from these control experiments indicate that both light irradiation and catalysts are indispensable for CO 2 photoreduction to CH 3 OH.The reaction quantum yield (QE) is estimated using CH 3 OH yield, noting that six electrons are required to reduce CO 2 to CH 3 OH.The equation is as follows: Methanol 14 100 A 126 A mole of CH 3 OH yield 12mole of photon absorbed by catalyst Mole of photon 14 12I A S12N A A E BET surface area and band gap energy of pure TiO 2 , the graphene-TiO 2 , the tourmaline-TiO 2 and the TiO 2 /graphene-tourmaline composites. This work was funded by the Deanship of Scientific Research (DSR), King Abdulaziz University, Jeddah, under Grant number (130-010-D1434).The authors, therefore, acknowledge with thanks the technical and financial support from the DSR."
  }
]