[
  {
    "title": "Doi",
    "content": "10.1016/j.cej.2021.131513"
  },
  {
    "title": "Article_Title",
    "content": "A Ti-OH bond breaking route for creating oxygen vacancy in titania towards efficient CO2 photoreduction"
  },
  {
    "title": "Abstract",
    "content": "Due to the strong bonding between Ti and O atoms, creating oxygen vacancy in stable TiO 2 usually involves harsh synthetic conditions.In this work, inspired by DFT calculation results that much lower energy is required to dissociate Ti-OH bond than Ti-O bond, we report a facile approach by simply calcining TiO x (OH) y precursor in inertia atmosphere, to effectively create oxygen vacancy in titania (Ti-N 2 -600).During CO 2 photoreduction, CH 4 and CO are the major products on Ti-N 2 -600, whose evolution rates are about 2.8 times and 3.6 times those on commercial TiO 2 (P25), respectively.The in-situ Fourier-transform infrared spectroscopy (FTIR) results indicate the oxygen vacancy in Ti-N 2 -600 favors 1) CO 2 activation and photoreduction since CO 2 -is generated but not detected on P25; 2) the CO L formation and further transformation.This Ti-OH breakage strategy presents a new insight into oxygen vacancy generation in TiO 2 and more generically other metal oxide semiconductors."
  },
  {
    "title": "Experimental",
    "content": "Titanium (IV) sulfate (Ti(SO 4 ) 2 , 96.0) and ammonia solution (NH 4 OH, 25.0 28.0) were purchased from Sinopharm Chemical Reagent.P25 was purchased from Shanghai Macklin Biochemical Co., Ltd, and was dried in the muffle.Cerium (IV) hydroxide (Ce(OH) 4 ), zinc acetate dehydrate (Zn(CH 3 COO) 2 2H 2 O), and polyethylene glycol (PEG 4000) were purchased from Adamas Reagent, Ltd. General procedure for synthesis of TiO 2 series samples.Titanium sulfate (Ti(SO 4 ) 2 , 12 g) was dissolved in 100 mL of deionized water to form a transparent solution.The pH-meter (Sartorius, PB-10) was calibrated by three buffer solutions, of which the pH values were 4.01, 6.86 and 9.18, respectively.Then the pH-meter electrode was put in the Ti(SO 4 ) 2 solution, and ammonia solution (5 mL of concentrated ammonia solution diluted in 200 mL of deionized water) was added into Ti(SO 4 ) 2 solution drop by drop under continuous stirring to adjust the final pH to 7. Then the stirring was stopped for about 2 h and the precipitate was centrifuged and washed using deionized water until no SO 4 2-in supernatant could be detected by saturated BaCl 2 solution. The gel-like sample was freeze dried and grinded into powder thus the hydroxyl-containing titania was obtained and labeled as TiO x (OH) y . Oxygen-vacancy-rich TiO 2-x was prepared through calcining TiO x (OH) y in a tube furnace at 600 C for 2 h in N 2 atmosphere.The as-prepared light-yellow sample was labeled as Ti-N 2 -600.Two reference samples were prepared by a similar procedure with Ti-N 2 -600.One control sample synthesized by calcining TiO x (OH) y at 600 C for 2 h in air was named as Ti-air-600.Another was fabricated by further calcining Ti-air-600 at 600 C in N 2 atmosphere for 2 h and denoted as Ti-air-N 2 -600.P25 treated under the same condition was labeled as P25-N 2 -600. X-ray diffraction (XRD) characterization was carried out on a Rigaku D/MAX 2250 PC diffractometer with Cu K ( 0.154 nm) in the 2 range of 10-90 with a scanning rate of 4 min -1 .Raman spectra were recorded using an excitation wavelength of 532 nm laser with 0.8 mW power.Transmission electron microscopic (TEM) image was collected on a JEOL 200CX electron microscope operated at 200 kV.The solidstate magic angle spinning nuclear magnetic resonance 1 H spectroscopy ( 1 H MAS NMR) were conducted on an AVANCE III 400 MHz (Bruker) equipped with a 4 mm double-resonance probe.Prior to the test, the powder samples (100 L) were dried at 120 C for more than 4 h and then measured under the same conditions.Fourier transform infrared (FTIR) spectra were performed on a Nicolet iS10 FTIR spectrometer using KBr as the background.The electron spin resonance (ESR) measurements were performed on JEOL FA200 ESR spectrometer at room temperature with exact 30 mg of photocatalyst sample for each analysis.The UV-Vis absorption spectra and diffuse reflectance spectra (DRS) were collected on a UV-3600 Shimadzu spectroscope.N 2 adsorption-desorption isotherms at 77 K were obtained on a Micrometrics ASAP3020 system.All samples were degassed at 120 C for more Fig. 1.Dissociation energies for bonds between Ti and non-metal elements.than 6 h before the analysis.The surface area of each sample was calculated by the Brunauer-Emmett-Teller (BET) method acquired from the relative pressure range of 0.01-0.1.X-ray photoelectron spectroscopy (XPS) measurements were conducted on a Thermo Scientific ESCALAB-250 spectrometer with AlK radiation as excitation source.Binding energies were calibrated by setting C 1 s to 284.8 eV.Positron annihilation lifetime spectroscopy (PALS) was carried out using the digital positron lifetime spectrometer based on DPLS100 digitizer.CO 2 temperature programmed desorption (CO 2 -TPD) was performed on a Micrometrics Chemisorption Analyser.150 mg of sample was used for each analysis.After being pretreated at 100 C in He for 1 h and cooled to room temperature, the samples were purged with CO 2 for 30 min, and then isothermally removed the weakly bonded CO 2 in He at a flow rate of 30 mL min -1 until the baseline was flat.Finally, the temperature was gradually increased to 800 C at a ramp rate of 10 C min -1 .The blank TPD procedure was as following: 150 mg of sample was pretreated at 100 C in He for 1 h and cooled to room temperature.After the baseline was flat, the temperature was gradually increased to 800 C at a ramp rate of 10 C min -1 . DFT calculation was performed using Vienna ab initio simulation package (VASP), with Perdew-Burke-Ernzerhof (PBE) density functional 21,22.The core electrons were described by Projector Augmented Wave (PAW) pseudopotentials 23 and the cutoff energy was set to be 600 eV.A gamma-centered 1 1 1 k-point mesh was used to calculate the lattice constant and single-point-energy (SPE) of single oxygen and single hydroxyl in slab.Gamma-centered k-point meshes were applied for anatase and hydroxyl containing titania including Ti 24,25, and their material ID on Material Project are mp-1193009, mp-1191976, mp-626550, and mp-757493, respectively.The anatase (1 1 0) and (1 0 0) surfaces, (1 1 0) surface with bridging hydroxyl (OH B ) and (1 0 0) surface with top hydroxyl (OH T ) were built with 15 A vacuum slab for calculations of dissociation energies of surface O atoms and OH groups.The surface two-atom layer was unfixed while the below two-atom layer was fixed to mimicking the surface model during the optimization calculation.The bulk and surface structure models are shown in the Supporting Information (Fig. S1f-i).The bond dissociation energy for Ti-O or Ti-OH was calculated by the following equations, take Ti 6 H 8 O 16 for example. where D, E X (X Ti 6 O 11 , O, TiO 2 , Ti 6 H 8 O 16 , OH or Ti 6 H 7 O 15 ) represent the calculated bond dissociation energy and the single point energy of X structure, respectively. In-situ FTIR spectra of CO 2 photoreduction were collected on a Nicolet iS 10 FTIR spectrometer equipped with a liquid-nitrogen-cooled HgCdTe (MCT) detector.Before the FTIR measurement, the sample was put into the reaction chamber and treated in continuous N 2 flow at room temperature for 1 h to remove air in the chamber.After that, CO 2 gas bubbled through H 2 O was inlet into the chamber for 1 h in dark, then the chamber was sealed.Subsequently, the adsorption spectra in dark were recorded, which was set as the background to further record the photocatalytic spectra under different time light irradiation. Ti-N 2 -600 and P25 electrodes were prepared according to the method reported by Domen's group 26 with some modifications.mg of photocatalyst and 10 mg of iodine were grinded together and put into 50 mL of acetone, followed by sonication for 5 min to get a homogeneous ink.Subsequently, the dispersion was transferred into an electrolytic cell with two pieces of Fluorine-doped Tin Oxide (FTO) conductive glass.10 V voltage was applied to deposit the photocatalyst onto the FTO glass.Finally, a homogeneous film was obtained on FTO glass after vacuum-dried at 100 C for 5 h.Photoelectrochemical measurements were conducted on a CHI 660A electrochemical work station (Chenhua Instrument, Inc.) with a three-electrode configuration system consisting of an FTO working electrode, a Pt plate counter electrode and an Ag/AgCl reference electrode.1.0 M NaOH aqueous solution was chosen as the electrolyte.The photocurrent was tested using a 300 W Xenon lamp as the light source (light intensity was 145 mW cm -2 , tested by FieldMaxIITO, Coherent) under 0.231 V voltage vs. Ag/AgCl.Electrochemical Impedance Spectroscopy (EIS) was recorded at open circuit potential (OCP) under light illumination. The CO 2 reduction performance was evaluated in an air-tight batch reactor equipped with a circulating cooling water system.The schematic illustration of the whole apparatue is depicted in Fig. S12.The volume of the reactor with a top optical quartz window was about 475 mL.In a typical process, 30 mg of the photocatalyst was uniformly deposited on a quartzose plate with a fixed area of 2.5 cm 2.5 cm and put into the bottom center of the reactor.Then the reactor was swept by N 2 flow for 30 min to remove the residual air.Then high-purity CO 2 (99.999) was bubbled through deionized water whose temperature was kept at C to generate a mixture of CO 2 and water vapor into the photoreactor to reach an ambient pressure.The dispersed photocatalyst was equilibrated in the CO 2 and water vapor atmosphere for 30 min.A 300 W Xenon lamp (Aulight CEL-HX, Beijing) without any filter was used as the light source, and the light intensity was 300 mW cm -2 (tested by FieldMaxIITO, Coherent).The carbonaceous gas products were analyzed by a gas chromatograph (GC2010, Shimadzu Corp., Japan) with a flame ionization detector (FID).The temperature of the photoreactor was kept at 25 C through cooling water circulation.No cocatalysts or sacrifice agents were used."
  },
  {
    "title": "Results_and_Discussion",
    "content": "We first carried out DFT calculation to check the dissociation energy of Ti-O and Ti-OH bonds in anatase and hydroxyl-containing titania, respectively.The calculation results are summarized in Table 1.The dissociation energy values for Ti-O in anatase and hydroxyl-containing titania are all about 7 8 eV, while that between Ti and -OH, both OH B and OH T , interestingly, is much lower at about 3 5 eV.Therefore, the Ti-OH bond breakage strategy might be a mild way for oxygen vacancy generation in TiO 2 . Inspired by the calculation results, we prepared a titanium hydroxide precursor TiO x (OH) y , which was then calcined at 600 C in different atmospheres.From the XRD patterns shown in Fig. 2a, we can see that the precursor TiO x (OH) y is amorphous.After calcination at 600 C, all the samples are crystallized into anatase structure.Raman spectra in Fig. 2b further confirm the well-crystallized structure in all the samples except for TiO x (OH) y , in which characteristic peaks at 142, 193, 393, 515, 638 and 792 cm -1 can be ascribed to E 1g , E 2g , B 1g , A 1g B 1g , E 3g and second-order of B 1g at 393 cm -1 photon modes of anatase TiO 2 , respectively 27,28.The broad weak band in the Raman spectrum of TiO x (OH) y at around 877 cm -1 results from the Ti-OH bond 29, which proves the hydroxide nature of TiO x (OH) y sample.Raman spectra and XRD patterns give the same order of the crystallinity of these samples: Ti-air-N 2 -600 Ti-air-600 Ti-N 2 -600 TiO x (OH) y .This is easy to understand that the longer the calcination period is, the higher the crystallinity of the sample will be.Furthermore, we calculated the crystallite size of the three samples utilizing Scherrer's equation.The fitting calculating results are summarized in Table S1.We can see that the crystallite sizes of Ti-air-N 2 -600, Ti-air-600, Ti-N 2 -600 three samples are 23.1 nm, 20.7 nm, and 14.9 nm, respectively, consistent with the order of their crystallinity.From the TEM images in Fig. 3, we can see that the TiO x (OH) y sample is an aggregation of amorphous nanoparticles.Clear lattice diffraction fringes, mainly presented by the (1 0 1) lattice plane (Fig. 3f), and bright spots in selected area electron diffraction (SAED) image (Fig. 3e inset) of the Ti-N 2 -600 sample demonstrate its well-crystallized structure.TEM images of Ti-air-600 and Ti-air-N 2 -600 shown in Fig. S2 show the similar structure to that of Ti-N 2 -600.These results are in good agreement with the XRD and Raman characterizations.Additionally, the TEM mapping for N only shows background noise (Fig. S13) and no N dopant (0.00 atom) is detected in EDX spectrum of Ti-N 2 -600. To better understand the change of hydroxyl and oxygen vacancy in TiO x (OH) y and Ti-N 2 -600 samples, NMR, XPS, and ESR spectra have been collected.Fig. 4 shows the 1 H MAS NMR spectra of TiO x (OH) y and Ti-N 2 -600.We can see from the divided peaks that two kinds of hydroxyl species can be detected in TiO x (OH) y , i.e. top hydroxyl (OH T ) and bridging hydroxyl (OH B ) 30 located at about 1.3 ppm and 10.4 ppm, respectively.While in Ti-N 2 -600, only surface top hydroxyl (OH T ) appears.While the peak assigned to OH B in both P25 and P25-N 2 -600 are not quite obvious (Fig. S8a).Here is to mention that OH T groups still could be detected in Ti-N 2 -600 though the calculated dissociation energy of Ti-OH T is much lower than that of Ti-OH B .The remaining OH T groups originate from the spontaneous dissociation of water (in air) on titania surface.Several reseach groups previously in-situ observed the water dissociation around room temperature and the hydroxyl removal at elevated temperature on both nearly-perfect and defective surface of TiO 2 313233.That is to say OH T can be easily removed by calcination and also ready to be regenerated in humid air.Therefore, it is reasonable to conjecture that hydroxyl groups in TiO x (OH) y have been gradually detached during the calcination, leaving oxygen vacancies concurrently.Further evidences are presented by XPS and ESR characterizations.In Fig. 5a, the XPS survey spectra of P25 and Ti-N 2 -600 are similar with each other, which indicate that Ti, O (C is from extraneous carbon support) are the main components and no survey signal of N at around 400 eV can be detected in Fig. 5a.In this case, no heteroatom doping, in particular N doping, happened in TiO 2 during the Ti-OH bond breakage process, which is in agreement with the TEM EDX and elemental mapping results.Fig. 5b and5c show the O 1 s and Ti 2p XPS spectra of TiO x (OH) y and Ti-N 2 -600, respectively.In Fig. 5b, three distinct peaks of Ti-N 2 -600 at 529.9, 530.6, and 532.1 eV can be ascribed to lattice oxygen (O lattice ), O 2-ions near the oxygen-deficient region (O v ) 34,35, and hydroxyl groups (-OH), respectively 36, while only two peaks located at 530.0 and 531.4 eV can be fitted out for TiO x (OH) y .This result preliminarily proves the existence of oxygen vacancy defect in Ti-N 2 -600.As no ESR signal is present in TiO x (OH) y (Fig. 5d), the two O 1 s peaks are attributed to lattice oxygen (O lattice ) and hydroxyl groups (-OH).It is further noticed that the percentage of hydroxyl decreases from 24.4 in TiO x (OH) y to 2.9 in Ti-N 2 -600.These results indicate that hydroxyl groups in TiO x (OH) y have been detached, leaving oxygen vacancies behind within Ti-N 2 -600.In Fig. 5c, the Ti 2p XPS spectrum of TiO x (OH) y consists of a characteristic Ti 2p 3/2 and Ti 2p 1/2 doublet at 458.6 and 464.3 eV, respectively.The peaks of Ti-N 2 -600 ascribed to Ti 4 2p 3/2 and Ti 4 2p 1/2 (located at 458.7 and 464.4 eV, respectively) blue-shift toward higher binding energy compared with those of TiO x (OH) y , accompanied by the red-shift of O 1 s peaks, indicating the electron loss around Ti atoms, caused by the replacement of -OH groups by oxygen vacancies 37,38. ESR characterization was carried out to check the unpaired electrons in the samples.An obvious electron paramagnetic signal at g 2.000 (Fig. 5d) gives further indication that oxygen vacancy has been created in Ti-N 2 -600 39,40.However, no obvious ESR signal appeared in P25 after mild calcination in N 2 atmosphere at 600 C (P25-N 2 -600).These results agree with the DFT calculation, which reveals that it demands less energy to remove hydroxyl from hydroxyl-containing titania than a The site number denotes different oxygen or hydroxyl sites in the supercell which are marked in dashed cubes (Fig. S1).oxygen from TiO 2 .Interestingly, the sample Ti-air-600 prepared by calcining TiO x (OH) y in air also displays paramagnetic signal.We consider that the oxygen concentration in air is not high enough to refill (oxidation process) the oxygen vacancy sites when OH detaching from the titania structure.In other words, the dynamics of OH detachment is much faster than that of the oxidation process.This phenomenon could also further demonstrate our previous opinion that the OH-detaching for oxygen vacancy generation is a much easier method.While in Ti-air-N 2 -600 obtained by calcining Ti-air-600 in N 2 , the paramagnetic signal (Fig. S3) shows no significant increase compared with Ti-air-600, either.It also agrees with the DFT calculation results.Thus, we could draw a conclusion that the present Ti-OH bond breakage approach can effectively but mildly generate oxygen vacancy in titania. Positron annihilation lifetime spectroscopy (PALS) is a wellestablished technique to investigate defect species and their concentrations 41.Table 2 gives three positron lifetime components, 1 , 2 , and 3 , in accompanying with relative intensities, I 1 , I 2 and I 3, for Ti-N 2 -600 and Ti-air-N 2 -600 samples.The shortest positron lifetime 1 is usually attributed to the free annihilation of the positron in defect-free crystal.While in structure with defects, like monovacancy, positron lifetime 1 will be prolonged due to the decreased average electron density 41.The 1 values are 0.217 ns and 0.194 ns for samples Ti-N 2 -600 and Ti-air-N 2 -600, respectively, both of which are larger than the reported 1 lifetime, 0.178 ns in defect-free anatase crystal structure and 0.189 ns in P25 structure.Ti-N 2 -600 sample presents a much larger value of 1 than Ti-air-N 2 -600 and P25, indicating that higher amounts of small size defects, such as monovacancies (oxygen vacancies), have been created in Ti-N 2 -600.The second positron lifetime component 2 is generally attributed to larger size defects such as oxygen vacancy clusters (including dimers, trimers, etc.).The commonly reported 2 value for defect-free anatase structure is around 0.364 ns 42, which is quite close to that of the Ti-air-N 2 -600 sample.The lifetime component 2 of Ti-N 2 -600 sample is a little larger than those of Ti-air-N 2 -600 and the reported defect-free anatase, implying that there is also a small amount of oxygen vacancy clusters in Ti-N 2 -600.The longest lifetime 3 is usually assigned to micropores and the annihilation of ortho-positronium atoms.Besides the positron lifetime, the I 1 and I 2 intensities are also associated with the relative concentrations of bulk and surface defects, respectively 41.In Table 2, we can see that I 1 is higher than I 2 for Ti-N 2 -600, suggesting surface defects are more dominating than bulk ones.Also, the I 1 /I 2 ratio of Ti-N 2 -600 is slightly higher than those of Ti-air-N 2 -600 and the reported P25, evidencing the larger amount of bulk mono-oxygen-vacancy in Ti-N 2 -600 than Ti-air-N 2 -600 and P25.The ratio of surface-to-bulk defects might achieve a good balance in Ti-N 2 -600, thus increased photoinduced charge carrier concentration in Ti-N 2 -600 has been achieved during the photocatalytic reaction. Furthermore, we generalized this Ti-OH bond breakage strategy to create oxygen vacancy in CeO 2 and ZnO semiconductors.The ESR spectra (Fig. S11c,d) of Ce-N 2 -800, Ce-air-800, Ce-air-N 2 -800, Zn-N 2 -500, Zn-air-500, and Zn-air-N 2 -500 all show clear ESR signals.Therefore, the present Metal-OH bond breakage strategy could not only be an effective way for oxygen vacancy generation in TiO 2 , but also in other metal oxide semiconductors such as CeO 2 and ZnO.Detailed characterization and description could be seen in Fig. S11 and Supporting Information. The photocatalytic CO 2 reduction performances of TiO x (OH) y , Ti-N 2 -600, and reference samples including Ti-air-600, Ti-air-N 2 -600 and commercially purchased P25, were evaluated under full-spectrum light illumination with the presence of high purity CO 2 and H 2 O vapor by using 30 mg of the photocatalysts.CH 4 and CO are the main products being detected by our gas chromatography.The CH 4 and CO evolutions during 5 h irradiation on different samples are demonstrated in Fig. 6.Reaction container shapes, flow or static state gas atmosphere, or even the way of catalysts coating on the substrate could all affect the CO 2 photocatalytic performance 43.Therefore, it is not reasonable to directly compare different photocatalysts' activities reported by different research groups.So, we utilized the commercial titania P25 as one of the reference samples to compare with the photocatalytic performance of Ti-N 2 -600 prepared through the Ti-OH bond breakage strategy.Here is to mention that the start concentration of CH 4 are not zero, which is usually less than 0.5 ppm.There are two main reasons for this phenemonon.The first one is the apparatus for CO 2 photoreduction performance evaluation is offline and the gas transfer process from the reactor to the Gas Chromatography may have small impact on the CH 4 or CO start concentration.The second one is that the purity of CO 2 we used is about 99.999 .There is always several ppm CH 4 residuals in the high pure CO 2 .Under the same reaction condition, P25 shows a moderate CO 2 photoconversion activity, with about 5.6 mol g -1 CH 4 and 2.1 mol g -1 CO being generated in 5 h illumination.In clear contrast, Ti-N 2 -600 photocatalyst displays much higher CO 2 photoconversion performance, with 13.0 mol g -1 CH 4 and 7.8 mol g -1 CO being produced in 5 h irradiation, which are respectively about 2.3 and 3.7 times those over P25.Comparatively, the CH 4 and CO yields in 5 h on Ti-air-600 are 4.4 and 3.6 mol g -1 , respectively.Furthermore, the BET surface area (S BET ) of Ti-N 2 -600, TiO x (OH) y , and P25 are 51, 151, and 84 m 2 g -1 , respectively (Fig. S4), therefore it can be seen that the surface area is not the main contributor to the difference of CO 2 catalytic reduction a The lifetime and intensity data of P25 is adopted from Zhao's research 41. performances between Ti-N 2 -600 and P25.Also, Ti-air-N 2 -600 shows a little bit higher activity than Ti-air-600, producing 6.6 mol g -1 CH 4 and 3.2 mol g -1 CO in the same period, while P25 heat-treated in N 2 atmosphere at 600 C (labeled as P25-N 2 -600) shows no significant activity enhancement (2.1 mol g -1 CH 4 and 4.3 mol g -1 CO are produced in 5 h) compared with P25 (Fig. S5), suggesting that it is hard to break down Ti-O bonds in stable P25 by the same calcination treatment as TiO x (OH) y .The sample we used was prepared about 8 months ago.Also, the stability of the Ti-N 2 -600 photocatalyst is good.Though a little decrement of CO evolution compared with the original CO 2 reduction performance, the CH 4 generation keeps steady with refresh treatment before each cycle (Fig. S6). UV-vis absorption spectra and tauc-plots for band gap calculation are displayed in Fig. S7.In Fig. S7a, the Ti-N 2 -600 sample shows enhanced light absorption especially toward visible light compared with other titania samples.To further exclude the situation of N doping during calcination caused by N 2 dissociation into titania structure, which could also induce the light absorption enhancement, we calcined the TiO x (OH) y sample at 600 C under Ar atmosphere (Ti-Ar-600) and P25 sample at 600C under N 2 atmosphere (P25-N 2 -600).Then we compared their UV-vis absorption spectra (Fig. S8b) and found out 1) the Ti-N 2 -600 and Ti-Ar-600 display the same light absorption spectra; 2) P25-N 2 -600 shows no enhancement on light absorption compared with P25.Therefore, combining with the XPS and ESR results, we can conclude that the enhanced light absorption is induced by the presence of oxygen vacancy rather than N-doping. The bandgap calculation results using tauc plot method by treating all the titania samples as direct bandgap semiconductor, are presented in Fig. S7b.The band gap of hydroxyl-contained titania TiO x (OH) y , Ti-N 2 -600, Ti-air-600 and Ti-air-N 2 -600 were calculated to be 3.54, 3.23, 3.31 and 3.29 eV, respectively.The bandgap of Ti-N 2 -600 is approximately close to that of generally reported anatase TiO 2 .The on-and-off photocurrent responses are displayed in Fig. S7c.The convex (not square) profile of on-and-off photocurrent curves of Ti-N 2 -600 may be associated with the low recombination of charge carriers and the increased accumulation of photo-induced electrons under illumination.Also, the sample Ti-N 2 -600 shows larger photocurrent than P25, suggesting its higher concentration of charge carriers generated during the photocatalytic reaction.The electrochemical impedance spectra (EIS) are shown in Fig. S7d.We can see that Ti-N 2 -600 sample exhibits a smaller diameter of the semicircular Nyquist curve, indicating that Ti-N 2 -600 sample possesses lower charge transfer resistance as well as higher charge carrier separation/transfer efficiency.All these features benefit CO 2 photoreduction of the photocatalyst under the illumination. The intermediates formed on the surface of catalysts were investigated by in-situ FTIR spectra during the photocatalytic CO reduction.To probe the role of oxygen vacancy in photocatalytic CO reduction, we compared the performance differences of CO 2 adsorption/ activation and transformation on P25 and Ti-N 2 -600.In Fig. 7a andc, few bands during 1 h light illumination can be identified on P25 except for the gradually intensified band at around 1328 cm -1 , which is assigned to the consumption of b-CO 3 2-species 44.P25-N 2 -600 displays similar in-situ FTIR spectra and no obvious changes are observed during 60 min irradiation (Fig. S9).While on Ti-N 2 -600, in Fig. 7b andd, both b-CO 3 2-(1328 cm -1 ) and CO 2 -(around 1670 cm -1 ) band intensities become increased during the reaction.The transfer of the one electron to CO 2 to form CO 2 -at the initial stage of CO 2 reduction usually involves a very high thermodynamic potential (CO 2 (g) e - CO 2 -, -1.90 V vs. SHE at pH 7) 45,46.The distinct CO 2 -band at 1670 cm - in Fig. 7b andd, represents the rapid formation and transformation of CO 2 -, indicating that the electrons could transfer from Ti-N 2 -600 to CO even at the very beginning of light irradiation.This phenomenon further proves that the localized electrons in defective Ti-N 2 -600 sample with oxygen vacancy could greatly help the activation of the stable CO molecules 10.A negatively-oriented intensified signal at around cm -1 assigned to HCO 3 -indicates that HCO 3 -species are gradually generated during the light illumination.Interestingly, a slightly stronger band at around 2077 cm -1 can be assigned to linearly bonded CO (CO L ) 44,47 adsorbed on Ti-N 2 -600 surface during 1 h photoreaction.The presence of the CO L signal is herein assumed to be due to the CO 2 capture by the oxygen vacancy on Ti-N 2 -600 surface, in which one oxygen atom in CO 2 has filled into the oxygen vacancy on Ti-N 2 -600 surface 48, as illustrated in Fig. 7f.And the gradually intensified signal of CO L indicates the CO production and desorption from the catalyst surface via CO 2 activation and reduction by the oxygen vacancy, or to the formation of certain kinds of hydrocarbon intermediates for final CH 4 generation.These results demonstrate that CO 2 is more easily to be adsorbed and activated on Ti-N 2 -600 than on P25 due to the presence of oxygen vacancy.Furthermore, CO 2 temperature-programed-desorption (TPD) was conducted on P25, TiO x (OH) y , and Ti-N 2 -600 and the results are shown in Fig. 7e.The CO 2 desorption signal at a rather low temperature of C refers to CO 2 weakly adsorbed on the surface; while that at about C is attributed to the desorption of chemically bonded CO 2 on the catalyst surface 49.The intensively increased CO 2 desorption signal from TiO x (OH) y beyond 300 C could be attributed to the decomposition of TiO x (OH) y which releases hydroxyl groups at such elevated temperatures.While a much weaker CO 2 desorption peak around 88 C can be found on P25, and no signal could be seen for chemically bonded CO 2 . The TCD signal at about 400 C in the blank test has been evidenced not associated with CO 2 desorption on P25 surface (Fig. S10) and might be caused by oxygen detachment in P25 crystal structure.So Ti-N 2 -600 displays the most intensive desorption signals for both weakly adsorbed CO 2 and strongly adsorbed carbonate species, compared with P25 and"
  },
  {
    "title": "Conclusions",
    "content": "We have developed a novel mild strategy to introduce oxygen vacancy in TiO 2 by deliberately breaking the weak Ti-OH B bond instead of the conventional much stronger Ti-O bond, resulting in oxygen-deficient TiO 2-x photocatalysts.The oxygen vacancies can be successfully created simply by calcining titania abound in hydroxide in an oxygen-deficient atmosphere, which are evidenced to exist as monovacancy and vacancy clusters in the as-prepared TiO 2-x photocatalyst.The existence of oxygen vacancy enhances light absorption and charge transfer ability, and facilities the CO 2 adsorption and activation on the oxygen vacancyenriched TiO 2-x surface.Resultantly, CH 4 and CO are the dominant products of the CO 2 photocatalytic reduction, whose yields are about 2.3 and 3.7 times those over P25 under the identical conditions, respectively.This facile strategy has been proved to be generic in introducing oxygen vacancies in ZnO, CeO 2 , and other metal oxide semiconductors.Further modifications of this Ti-OH breakage method combined with crystal facet or even interface modulations are still necessary in the future and expected to shed light on the low-cost and scale-up synthesis of high performance photocatalysts for CO 2 conversion, organic pollutant oxidation in water/air as well for environmental purifications. b De-O, c De-OH T , and d De-OH B represent the O, OH T , and OH B detachment energy, respectively. Fig. 2. (a) The XRD patterns and (b) Raman spectra of TiO x (OH) y , Ti-N 2 -600, Ti-air-600 and Ti-air-N 2 -600 samples (Raman signal of TiO x (OH) y has been magnified by five times). Fig. 3. (a, d) TEM, (c, f) TEM of enlarged areas selected by the dashed cubic (b, e) high resolution TEM images of (a, b, c) TiO x (OH) y and (d, e, f) Ti-N 2 -600 samples.The insets in (b, e) are the corresponding selected area electron diffraction (SAED) patterns. Fig. 4. 1 H MAS NMR spectra of TiO x (OH) y and Ti-N 2 -600 samples and their divided peaks, with illustration structure on the left of top hydroxyl (OH T ) and bridging hydroxyl (OH B ), respectively. Fig. 5. (a) XPS survey spectra of P25 and Ti-N 2 -600 (the middle line is the 5-time-enlarged signal of Ti-N 2 -600 from 0 to 430 eV); (b) O 1 s and (c) Ti 2p spectra of TiO x (OH) y and Ti-N 2 -600; (d) ESR spectra of TiO x (OH) y , Ti-N 2 -600, P25 and P25-N 2 -600. Fig. 6.(a) CH 4 and (b) CO evolutions during 5 h CO 2 photoreduction on TiO x (OH) y , Ti-N 2 -600, Ti-air-600, Ti-air-N 2 -600 and P25.The twice-repeated experiments for Ti-N 2 -600 sample were performed independently (n 2), error bar data are mean s.d. Fig. 7. In-situ FTIR spectra of CO 2 photoreduction on (a) P25 and (b) Ti-N 2 -600 under illumination for varied time periods; (c) Stack arrangement of in-situ FTIR spectra in (a, b) of (c) P25 and (d) Ti-N 2 -600 with enlarged part beside; (e) CO 2 -TPD profiles of P25, Ti-N 2 -600, and TiO x (OH) y ; (f) Schematic illustrations of TiO 2 surface structure with oxygen vacancy or CO 2 being adsorbed on oxygen vacancy. 6 H 8 O 15 , Ti 12 H 4 O 26 , Ti 12 H 8 O 28 , and Ti 11 H 7 O 24 lattice constant and SPE calculation, respectively.Ti 6 H 8 O 15 , Ti 12 H 4 O 26 , Ti 12 H 8 O 28 , and Ti 11 H 7 O 24 initial structure was downloaded from Material Project Dissociation energy (D) values of oxygen and hydroxyl removal from anatase, hydroxyl-containing titania and anatase surface based on DFT calculations. This work was supported by the National Key Basic Research Program of China 2017YFE0127400, National Natural Science Foundation of China 51872317, 21835007, Science and Technology Commission of Shanghai 20520711900. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://doi. org/10.1016/j.cej.2021.131513."
  }
]