[
  {
    "title": "Doi",
    "content": "10.1016/j.catcom.2016.01.019"
  },
  {
    "title": "Article_Title",
    "content": "Core-shell structured ZnO@Cu-Zn–Al layered double hydroxides with enhanced photocatalytic efficiency for CO2 reduction"
  },
  {
    "title": "Abstract",
    "content": "Al layered double hydroxides (LDHs) heterostructures was synthesized by a facial deposition-precipitation method, and it exhibited an enhanced photocatalytic efficiency for CO 2 reduction.The physicochemical properties of as-prepared ZnOLDHs were studied by SEM, XRD, BET, UV-vis and TEM technique.The improvement of photocatalytic efficiency is related two factors.On the one hand, LDHs species can increase the surface areas of catalysts effectively, which means that more adsorb active site for CO 2 can be provided; On the other hand, the heterojunction was formed on the ZnO/LDHs interface hindering the recombination of excited charge carriers."
  },
  {
    "title": "Experimental",
    "content": "For the sample preparation, characterization and photocatalytic test have been shown in the Supporting information."
  },
  {
    "title": "Results_and_Discussion",
    "content": "A C C E P T E D M A N U S C R I P T The SEM pictures of the as-prepared ZnO were presented in Fig. 1 (a) and (d).It can be seen that the ZnO materials exhibited typical rod-like and belt-like structure.The rod-like ZnO has regular shape with an average diameter of 600 nm and a length of 3.5 m.The width of the belt-like ZnO varies from 50 nm to 200 nm, and the length of the belt is more than 10 m.Fig. 1 (b) and (e) show the morphology of ZnO enwrapped by Cu-Zn-Al layered double hydroxides (LDHs).Obviously, a coating of LDHs was covered on the surface of ZnO materials indicating that the ZnOCu-Zn-Al LDHs with a core-shell-like structure were obtained by the facile deposition-precipitation method in this study.Therefore, the rod-liked and belt-liked ZnO were marked R-ZnO and B-ZnO.Meanwhile, the rod-liked and belt-liked ZnO enwrapped by LDHs were noted R-ZnOLDHs and B-ZnOLDHs in the following description, respectively.To further investigate the morphology of ZnOLDHs, the magnifications of Fig. 1 (b) and (e) were presented in Fig. 1 (c) and (f), respectively.It can be seen that the stacked LDHs nanosheets were intercross each other with a diameter 200 nm.(JCPDS file 89-1397), respectively.Moreover, no diffraction peaks of secondary phase were observed, which indicates that these two hexagonal ZnO are phase-pure.As for the ZnOLDHs, the peaks appeared at 11.9, 23.7 and 39.4 o are assigned to the characteristic diffractions of Cu-Zn-Al LDHs with the interlayer anion of CO 3 2-(JCPDS file 48-1024).Furthermore, with the coating of LDHs, except for a small decrease in the intensity of diffraction peaks, there is no change for the characteristic peaks of ZnO phase. Fig. S2 shows the TGA curves of the as-prepared ZnO and ZnOLDHs.The weight loss is less than 2 wt for these two ZnO material, which is ascribed to the evaporation of adsorbed water.There are three weight loss stages for Cu-Zn-Al LDHs.The first step (150 o C) corresponds to the evaporation of adsorbed and interlayer intercalated water.In the range of 150350 o C, the weight loss is related to two overlapping events of the dehydroxylation and the decomposition of the interlayer CO 3 2- 28, 29.As the temperature is higher than 400 o C, the layered LDHs structure began to collapse.The TGA curves of ZnOLDHs are similar to that of LDHs, suggesting that the LDHs are coated successfully on the surface of ZnO materials.The amount of LDHs coated on ZnO was evaluated by calculating weight loss of TGA, and the data were summarized in Table S1.It can be seen that the amount of LDHs for R-ZnOLDHs and B-ZnOLDHs is approximately 17 wt and 27 wt, respectively. The N 2 -adsorption/desorption isotherms were carried out to study the surface area and porosity of ZnO, Cu-Zn-Al LDHs, and ZnOLDHs materials.As shown in Fig. 3, LDHs and ZnOLDHs samples present the type IV isotherms with a H3 hysteresis loops (P/P0 0.8), indicating the presence of a porous structure, which is ascribed to the formation of slit-shaped pores.The specific surface area and pore volumes determined from the Brunauer-Emmett-Teller (BET) isotherms are summarized in Table S1.The surface areas of 21.8 and 26.8 m 2 g -1 were obtained for R-ZnOLDHs and B-ZnOLDHs, respectively.Obviously, the values of the surface areas are significantly higher than that of ZnO.Moreover, the pore volumes of the materials increase greatly after the LDHs coating.The increase in the surface area and pore volume of ZnOLDHs is attributed to the existence of hierarchical LDHs, which has been illustrated in Fig. 1 (c) and (f). Fig. S3 shows the UV-vis diffuse reflectance spectra of the samples.Only one absorption region is observed for ZnO material, and the absorption peak appears at UV light region (360 nm).The absorbance of the B-ZnO is slight higher than that of R-ZnO.In the case of LDHs, there are two absorption regions.One is in the UV light region with a peak appearing at 240 nm, and the other locates in the visible light region at the wavelength range above 600 nm.The characteristic absorption bands of both ZnO and LDHs are presented in the profile of ZnOLDHs, indicating that no change occurs for the energy gap of ZnO and LDHs.Comparing to the uncoated ZnO, the intensity in the absorbance band enhances markedly, and this means more photons can be obtained for the photocatalytic reaction. Fig. 4 shows the TEM images of ZnOCu-Zn-Al LDHs.From Fig. 4(a) and (c), it can be seen that the rod/belt ZnO act as the core, the LDHs layer is coated on the surface of ZnO, and the light difference between the rod/belt core and the shell, which is consistent with the results of SEM.As shown in the high-resolution TEM images, the periodicity of the fringes of the core is 0.282 and 0.521 nm, corresponding to the (100) and (001) planes of hexagonal ZnO 30, 31. The nanoparticles of the LDHs shell show a fringe spacing of 0.375 nm and 0.228 nm, which is close to the reported values of the ( 006) and (015) plane of rhombohedra LDHs, respectively.32 It reveals that the interface between ZnO and LDHs can be clearly resolved, reflecting the formed heterojunction nanostructure of ZnO and LDHs phases.Under the same condition, the CH 4 cumulative yield over LDHs reaches 16.8 molg -1 , and this value is higher than that of rod and belt ZnO.The increased CH 4 yield can be ascribed to 2D layered space of LDHs.Both a higher surface area and pore volume, as a result of 2D the layered space, promote the accessibility of CO 2 molecular to surface sites.Furthermore, a much higher the CH 4 cumulative yield is obtained over the ZnOLDHs.The activity of core-shell hierarchical structures is about 3.1 fold and 3.4 fold higher than that of LDHs samples, respectively.Considering the comparative surface area and pore volume, the improved photocatalytic activity of ZnOLDHs is relative with the electronic coupling between the LDHs nanosheets and ZnO in such semiconductor heterostructure.The perfect interfacial contact at the"
  },
  {
    "title": "Conclusions",
    "content": "ZnO enwrapped by Cu-Zn-Al LDHs with hierarchical structures was synthesized by a deposition-precipitation method.A core-shell-like structure was observed for as-prepared ZnOLDHs material, and a heterojunction was formed at the ZnO/LDHs interface.The resulting ZnOLDHs catalyst exhibits significantly an enhanced activity in photoreduction of CO 2 to hydrocarbons.The improvement of photocatalytic activity can be ascribed to the increase in the Fig.2shows the XRD patterns of ZnO and ZnOLDHs.Similar diffraction patterns are Fig. S5 shows the compared tests of photo catalytic CO 2 reaction at room temperature and 200 photocatalytic performance of ZnOLDHs hierarchical structures can be greatly enhanced via Figure captions Fig. 2. XRD patterns of ZnO and ZnOLDHs Fig. 3. N 2 -sorption isotherms of Cu-Zn-Al LDHs, ZnO and ZnOLDHs composites Figure 1 Figure 3 Figure 4 Figure 5 Li et al. 22assembled Bi 2 MoO 6 /Zn-Al LDHs hierarchical heterostructures from Bi 2 MoO 6 hierarchical hollow spheres and Zn-Al LDHs nanosheets by a low-temperature hydrothermal method.The results indicated that Bi 2 MoO 6 /Zn-Al LDHs heterostructure photocatalyst exhibited excellent stability and reusability, which mainly attributed to the efficient separation of photoinduced electrons and holes. This research is supported by the Youth Science and Technology Excellence Sail Plan of Shanghai (No. 14YF1410800) and the National Natural Science Foundation of China (No. 21502116, 21302127). The special structures of ZnOLDHs increase the surface areas and CO 2 adsorbed capacity of catalysts effectively. The perfect interfacial contact at the ZnOLDHs interface promotes the separation of electron-hole pairs."
  }
]