[
  {
    "title": "Doi",
    "content": "10.1016/j.jcis.2016.11.054"
  },
  {
    "title": "Article_Title",
    "content": "Different CdSeTe structure determined photoelectrocatalytic reduction performance for carbon dioxide"
  },
  {
    "title": "Abstract",
    "content": "g r a p h i c a l a b s t r a c t CdSeTe NPs/TiO 2 NTs has the globular particle structure.The CdSeTe NPs/TiO 2 NTs photoelectrocatalyst conserves a high selectivity to produce CH 3 OH from CO 2 .Target material achieves the largest methanol yield 18.57 mmol L A1 cm A2 and faradaic current efficiency 88."
  },
  {
    "title": "Experimental",
    "content": "2.1.Preparation of CdSeTe NPs/TiO 2 NTs and CdSeTe NSs/TiO 2 NTs TiO 2 nanotubes (TiO 2 NTs) arrays were fabricated according to previous reports 21.CdSeTe NPs/TiO 2 NTs were prepared by a typical potentiostatic photoelectrodeposited method with three electrode system: TiO 2 NTs, platinum wire and saturated calomel electrode (SCE) were used as working electrode, counter electrode and reference electrode, respectively.The as-prepared TiO 2 NTs was immersed in a mixed aqueous solution of 0.1 mol L A1 CdSO 4 , 0.1 mmol L A1 (SeO 2 TeO 2 ) and 0.1 mmol L A1 Na 2 SO 4 (Cd 2 : Se 2 Te 2 1000:1), and pH was maintained at 2.7 by H 2 SO 4 solution.At room temperature, constant deposition potential and 500 W xenon lamp filtering out below 420 nm light with light intensity 100 mW cm A2 were applied.After a certain time, the electrodes were removed and soaked into the saturated CdCl 2 methanol solution about 10 min, then treated at 300 C for 2 h under nitrogen atmosphere with heating and cooling rate of 2 -C min A1 .Finally, CdSeTe NPs/TiO 2 NTs were achieved.All of reagents and materials used were purchased from Aladdin and the water used was ultrapure water in the fabrication process. Cadmium chloride solution (CdCl 2 , 40 mmol L A1 ), trisodium citrate dihydrate (C 6 H 5 Na 3 O 7 A2H 2 O, 100 mg), sodium selenite (Na 2 SeO 3 , 10 mmol L A1 ) and sodium tellurite (Na 2 TeO 3 , 10 mmol L A1 ) were added into a conical flask and diluted into 50 mL ultrapure water, and then mercaptosuccinic acid (MSA, 60 mg), sodium borohydride (NaBH 4 , 45 mg) were added in sequence under continuous magnetic stirring.The solution was placed in a Teflon-lined stainless reactor with TiO 2 NTs at 120 C for 2 h.The TiO 2 NTs modified by CdSeTe were dried at 80 C and then treated at 500 C for 2 h under nitrogen atmosphere with heating and cooling rate of 2 C min A1 30. The surface morphologies of the as-prepared samples were characterized by scanning electron microscopy (SEM, Philips XL30 FEG) under the accelerated voltage of 20 kV.The crystalline structures were characterized by X-ray diffraction (XRD, Rigaku D/MAX-rA, Japan), testing conditions: Cu Ka radiation, k 15.4184nm in the range of 2h 20-70, with scan rate of 4min A1 .Surface compositions were detected by X-ray photoelectron spectroscopy (XPS, ESCALAB 250) with a monochromated X-ray source (Al Ka hm 1486.6eV).The UV-visible diffuse reflection spectrum (UV-visible DRS) was to measure the photochemical properties (Beijing Purkinje General Instrument Co., Ltd).The electrochemical properties were measured by CHI660D electrochemical workstation (Shanghai Chenhua instrument Co., LTD). Properties of PEC CO 2 reduction were measured by CHI660D potentiostat in 0.1 mol L A1 KHCO 3 .The as-prepared electrode worked as working electrode, SCE as reference electrode, and platinum wire as counter electrode, respectively.The potential was swept linearly at a scan rate of 50 mV s A1 between 0 V and A1.5 V. N 2 was plunged into 0.1 mol L A1 KHCO 3 solution at the rate of 40 sccm for 20 min before the experiment.After that, CO 2 was plunged for 20 min until the solution reached saturated, then repeated the experiment.The samples were illuminated under visible light by a Xenon lamp with a band-pass filter (k P 420 nm, 100 mW cm A2 ). Calculation method of CO 2 adsorption volume were obtained according to previous reports 21: where Q is total charge, F is faradaic constant, G is adsorption volume, and t is scanning time.The electronic number (n) in CO 2 electroreduction reaction can be calculated n 1.According to the Cottrell theory, it can be seen from the formula that the total charge Q has a linear relationship with the t 1/2 , and the intercept in chargeaxis is nFG Q dl , in the blank medium potassium bicarbonate solu-tion that the intercept is measured as Q dl , the difference is nFG, thus the adsorption volume G of CO 2 in the electrode surface can be obtained. PEC reduction CO 2 experiments were conducted in a double cells reactor with circulating water at the constant temperature of 25 C.CdSeTe NPs/TiO 2 NTs or CdSeTe NSs/TiO 2 NTs, platinumwire and SCE were used as the working electrode, the counter electrode and the reference electrode, respectively.Electrode area was 2 A 2 cm 2 , electrode interval was 1.0 cm, the flow rate of CO 2 was 40 mL min A1 during the whole experiment.500 W Xenon lamp (k P 420 nm, 100 mW cm A2 ) served as the source of visible light.The intermediates and products were detected by gas chromatography (6890-N, Agilent) with column (2 m, inner diameter 3 mm, Parapok Q, 80-100) and flame ionization detector.The column temperature was kept at 100 C while the detector temperature was at 150 C.High purity N 2 worked as carrier gas with a flow rate of 30 sccm."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Fig. 1 showed the SEM images of CdSeTe NPs/TiO 2 NTs and TiO 2 -NTs.Obviously, the globular CdSeTe obtained via photoelectrodeposition uniformly covered the surface of TiO 2 NTs, and the particles diameters were approximately 85-150 nm, which was far less than the flaky CdSeTe obtained by hydrothermal method (diameters are about 350 nm) 30.High-resolution SEM image (Fig. 1b) revealed that the globular particle surface was densely textured with smaller nanoparticles with sizes of 20-30 nm.TiO 2 NTs could be seen in the clearance of spherical particles from Fig. 1a.And Fig. 1c showed the SEM image of TiO 2 NTs of diameter 90-100 nm.CdSeTe NPs/TiO 2 NTs material consisting of CdSeTe graininess structure and the TiO 2 tubular structure, possessed larger specific surface and more active sites, which might result in high catalytic activity.Fig. 2 showed the X-ray diffraction patterns of CdSeTe NPs/TiO 2 NTs.As shown in the graph, the strong and sharp diffraction peaks indicated good crystallizations 31.The major strong characteristic peaks of CdSeTe at 2h of 39.79, 46.72and 62.41, corresponded to the crystal planes of (2 2 0), (3 1 1) and ( 3 The material diameter size was 26.6 nm according to the data of X-ray diffraction, which was consistent with the size observed by SEM (Fig. 1).CdSeTe NSs displayed the major strong characteristic peaks at 23.02, 24.28,and 33.26, corresponding to the crystal planes of (1 0 0), (0 0 2) and (1 0 2), respectively.And the lattice parametersa 4.4613 A and c 7.2452 A were got by calculating, which was consistent with JCPDS (Joint Committee on Powder Diffraction Standards) card (No. 41-1325) 30.These results demonstrated that the two CdSeTe materials were successfully synthesized.Furthermore, compared to CdSeTe NSs, CdSeTe NPs mainly tended to grow along the crystal plane of (2 2 0) instead of (1 0 2), indicating that the CdSeTe NPs and CdSeTe NSs were not only with different morphologies, but also with different crystal planes trended to grow. Fig. 3 revealed the XPS spectrum of CdSeTe NPs/TiO 2 NTs, and the data had been revised by C1s (284.6 eV).The wide scan XPS spectrum (Fig. 3a) revealed the predominant presence of C, O, Ti, Cd, Se, and Te elements.Among those elements, O, Ti, Cd, Se, and Te elements were from the as-prepared composites and the C element from the XPS instrument itself.Comparing the standard XPS spectrum, the valence states of material elements prepared were Ti 4 , Cd 2 , Se 2A and Te 2A , thus the material was proved to be CdSeTe/TiO 2 .At the same time, the elements of CdSeTe NSs/TiO 2 NTs were also proved by the standard XPS spectrum 30. The visible light absorption of CdSeTe NPs/TiO 2 NTs obtained obvious improvement compared to that of basal TiO 2 NTs (Fig. 4a).It demonstrated the introduction of CdSeTe NPs enhanced the visible light absorption of TiO 2 NTs.The band gap was obtained by the basic data of light absorption.A band gap of 1.24 eV of the asprepared CdSeTe NPs/TiO 2 NTs was calculated by a linear fit to the experimental (ahm) 2 versus hm plot 32 (Fig. 4b).It was smaller than the band gap value of CdSeTe NSs/TiO 2 NTs (1.48 eV) 30.The narrowed value of 0.24 eV indicated CdSeTe NPs/TiO 2 NTs could be excited and utilized by visible light with lower energy (k 6 1000 nm) more easily. The photoelectric conversion efficiency curves of CdSeTe NPs/ TiO 2 NTs, CdSeTe NSs/TiO 2 NTs and TiO 2 NTs were shown in Fig. 5.The calculation method was listed as follows 33: g 14 12Total power output A Electrical power inputLight power input A 100 where j p is the photocurrent density (mA cm A2 ), the j p E rew is the total power output, the j p E app is the electrical power input, and the I 0 is the power density of the incident light (mW cm A2 ).E rew is the standard reversible potential (which is 1.23 V vs NHE for the water splitting reaction at pH 0), and E app is the absolute value of the applied potential, which is obtained as E app E means A E ocp , where E means is the electrode potential of the working electrode at which j p was measured under illumination and E ocp is the applied potential at open circuit in the same electrolyte and under the same illumination. The curve a in Fig. 5 the material's PC property.The curve c showed that the photoelectric conversion efficiency of CdSeTe NPs/TiO 2 NTs (1.47), which was 2.72 times larger than that of CdSeTe NSs/TiO 2 NTs and 5.56 times larger than that of TiO 2 NTs.Based on the above analysis, the CdSeTe NPs/TiO 2 NTs owned excellent PC performance, which might be attributed to the globular structure with small diameter size and exposing more active sites. The chronocoulometry curves were conducted on CdSeTe NSs/ TiO 2 NTs and CdSeTe NPs/TiO 2 NTs in 0.1 mol L A1 KHCO 3 aqueous solution (Fig. 6).The curve a, b were the chronocoulometry curves on CdSeTe NPs/TiO 2 NTs saturated with CO 2 and without CO 2 .The curve c, d were the chronocoulometry curves on CdSeTe NSs/TiO 2 NTs saturated with CO 2 and without CO 2 .The adsorption active sites of CdSeTe NPs/TiO 2 NTs were 2.90 lmol, which was 3.11 times that of CdSeTe NSs/TiO 2 NTs (0.93 lmol).It demonstrated that CdSeTe NPs/TiO 2 NTs had larger electrochemical adsorption active sites, which was consistent with the globular morphology and the small particle size showed in the SEM image (Fig. 1) of CdSeTe NPs.And the more adsorption active sites for CO 2 on CdSeTe NPs/TiO 2 NTs could further illustrate that it could supply more active sites for the reduction reaction. The linear sweep voltammetry (LSV) was conducted in 0.1 mol L A1 KHCO 3 solution with a standard three-electrode configuration purging with N 2 or CO 2 on CdSeTe NPs/TiO 2 NTs (Fig. 7).As we all known, the current density derived from two aspects: one was the hydrogen evolution; the other was CO 2 catalytic reduction.The PEC reduction CO 2 mechanism is as follows: In the process of PEC reduction of CO 2 , the reaction mechanism is CO 2 6 e A 6 H ?CH 3 OH H 2 O (Fig. 8a).PEC reduction of CO 2 to CH 3 OH in an aqueous solution depends on the energetic stabilization of reduction intermediates by catalytically active surfaces.(Fig. 8b) The reaction is suggested to include the following steps: where the asterisk denotes reduction intermediates.In the process of PEC reduction of CO 2 to CH 3 OH, it generates the current density. There is a competitive reaction.It is the hydrogen evolutionin the process. The reaction generates the current density.Before hydrogen evolution, CO 2 catalytic reduction was the main reaction.With the emergence of hydrogen evolution, hydrogen evolution and CO 2 reduction became competitive reactions.Under N 2 atmosphere, the current increase was due to hydrogen evolution.Under CO 2 atmosphere, the current increase was due to hydrogen evolution and CO 2 reduction.Without illumination, the current density under CO 2 atmosphere was larger than that of under N 2 atmosphere, which showed that CdSeTe NPs/TiO 2 NTs owned excellent EC reduction ability for CO 2 .Under CO 2 atmosphere, the current density of CO 2 -light was larger than that of CO 2 -no light, which showed that CdSeTe NPs/TiO 2 NTs also owned excellent PC reduction ability.The effect of different structures to the EC and PEC performance was further explored.The current density of EC reduction CO 2 on CdSeTe NPs/TiO 2 NTs (6.13 mA cm A2 ) was 2.47 times larger than that of CdSeTe NSs/TiO 2 NTs (2.48 mA cm A2 ) at A1.2 V 30.It indicated that the globular structure had the better EC performance.In addition, the current density of PEC reduction CO 2 on the CdSeTe NPs/TiO 2 NTs (6.97 mA cm A2 ) was 2.11 times larger than that of CdSeTe NSs/TiO 2 NTs (3.30 mA cm A2 ) at A1.2 V 30.Thus it can draw a conclusion that CdSeTe NPs/TiO 2 NTs not only had more favorable EC reduction CO 2 performance, but also owned more excellent PEC reduction performance than CdSeTe NSs/TiO 2 NTs. In order to better illustrate the effect of different structure to the catalytic performance, the faradaic efficiency was further studied.Faradaic efficiency was calculated according to the following equation 34: Faradaic Efficiency 14 Curve a (Fig. 9) showed that faradaic efficiency of CdSeTe NSs/ TiO 2 NTs decreased sharply in the beginning, and at 200 min its faradaic efficiency started below 25.It revealed that with the reaction proceeding, materials were in passivation and its catalytic ability declined.However, faradaic efficiency of CdSeTe NPs/TiO 2 NTs almost kept at 88 (Curve r), which was 3.52 times higher than that of CdSeTe NSs/TiO 2 NTs.It illustrated that CdSeTe NPs/ TiO 2 NTs possessed excellent PEC stability to the light and electricity.Compared curve b with curve r, the faradaic efficiency increased from EC 65 to PEC 88, the latter is about 1.35 times higher than the former.This suggested that the introduction of illumination strengthened CdSeTe NPs/TiO 2 NTs EC reduction performance, which was mainly determined by the globular particle resulting in the larger PEC reaction active sites. The main product was methanol detected by GC.Fig. 10 illustrated the methanol yield of CdSeTe NPs/TiO 2 NTs in the PEC reduction of CO 2 process.From A0.8 V to A1.2 V (vs SCE), its yield showed a trend of increase, and from A1.2 V to A1.4 V (vs SCE) showed a trend of decrease.The phenomenon was explained as followed: in the range of 0 to A1.2 V, CO 2 reduction was the main reaction and there was no hydrogen evolution reaction.The production quantity of methanol increased gradually with more negative potential.When the potential was more negative than A1.2 V, the production quantity of methanol decreased, which indicated that the water from electrolyte conducted hydrogen evolution.With the increasing of hydrogen evolution, the yield of methanol decreased.In addition, the highest methanol yield was only 1.17 mmol L A1 after 300 min on the CdSeTe NSs/TiO 2 NTs PEC reduction 30.On the other hand, it could achieve 18.57 mmol L A1 after 300 min on the CdSeTe NPs/TiO 2 NTs, which was 16 times higher than that of the CdSeTe NSs/TiO 2 NTs.It fully illustrated that CdSeTe NPs/TiO 2 NTs possessed stronger PEC reduction ability than CdSeTe NSs/TiO 2 NTs, which was consistent with the conclusions obtained by faradaic efficiency (Fig. 9).In general, the excellent PEC ability of CdSeTe NPs/TiO 2 NTs was attributed to the globular particle structure, special crystal plane, narrower band gap, more reaction active sites.The applied results in CO 2 PEC reduction have well coincided with the performance of the asprepared materials (see Table 1)."
  },
  {
    "title": "Conclusions",
    "content": "The CdSeTe NPs/TiO 2 NTs photoelectrocatalyst conserves a high selectivity to produce CH 3 OH from CO 2 than CdSeTe NSs/TiO 2 NTs.The methanol yield of CdSeTe NPs/TiO 2 NTs was 16 times higher than that of the CdSeTe NSs/TiO 2 NTs.CdSeTe NPs/TiO 2 NTs and CdSeTe NSs/TiO 2 NTs were successfully developed by loading different structures of CdSeTe to the TiO 2 NTs surface according to photoeletrodeposited and hydrothermal methods.The CdSeTe NPs/TiO 2 NTs with narrow band gap 1.24 eV, mainly orientated along the (2 2 0) crystal plane and high photoelectric conversion efficiency resulted in more excellent light absorption and utilization performance than CdSeTe NSs/TiO 2 NTs; On the other hand, the larger adsorption capacity for CO 2 and the higher stable faradaic efficiency also showed that CdSeTe NPs/TiO 2 NTs owned more effective EC ability for CO 2 and higher stable catalytic ability than CdSeTe NSs/TiO 2 NTs.In addition, methanol yield on CdSeTe NPs/ TiO 2 NTs was 16 times higher than that of CdSeTe NSs/TiO 2 NTs after 300 min, which further revealed the excellent catalytic ability of CdSeTe NPs/TiO 2 NTs.The excellent PEC ability of CdSeTe NPs/ TiO 2 NTs was attributed to the globular particle structure, special crystal plane, narrower band gap, more reaction active sites.The CdSeTe NPs/TiO 2 NTs conserves a higher selectivity to make CH 3 OH than CdSeTe NSs/TiO 2 NTs.The research provides reference in which produces a highly selective photoelectrocatalyst for the scalable PEC reduction of CO 2 . Fig.1showed the SEM images of CdSeTe NPs/TiO 2 NTs and TiO 2 -NTs.Obviously, the globular CdSeTe obtained via photoelectrodeposition uniformly covered the surface of TiO 2 NTs, and the particles diameters were approximately 85-150 nm, which was far less than the flaky CdSeTe obtained by hydrothermal method (diameters are about 350 nm)30.High-resolution SEM image (Fig.1b) revealed that the globular particle surface was densely textured with smaller nanoparticles with sizes of 20-30 nm.TiO 2 NTs could be seen in the clearance of spherical particles from Fig.1a.And Fig.1cshowed the SEM image of TiO 2 NTs of diameter 90-100 nm.CdSeTe NPs/TiO 2 NTs material consisting of CdSeTe graininess structure and the TiO 2 tubular structure, possessed larger specific surface and more active sites, which might result in high catalytic activity.Fig.2showed the X-ray diffraction patterns of CdSeTe NPs/TiO 2 NTs.As shown in the graph, the strong and sharp diffraction peaks indicated good crystallizations31.The major strong characteristic peaks of CdSeTe at 2h of 39.79, 46.72and 62.41, corresponded to the crystal planes of (2 2 0), (3 1 1) and (33 1), respectively.It is lattice parameters of a b c 6.4426A, matched with Joint Committee on Powder Diffraction Standards card (JCPDS, No. 41-1324) of standard CdSeTe sample perfectly. Fig. 1.(a) SEM image and (b) high resolution SEM image of CdSeTeNPs/TiO 2 NTs.(c) SEM image of TiO 2 NTs. Fig. 2. XRD patterns of CdSeTeNPs/TiO 2 NTs. Fig. 3. (a) The wide scan XPS spectrum of the composites.(b-d) Cd 3d,Se 3d and Te 3d XPS spectrum. Photoelectric conversion efficiency / Fig. 9. Faradaic efficiency for methanol in different conditions: a PEC reduction CO 2 on CdSeTeNSs/TiO 2 NTs, b EC reduction CO 2 on CdSeTeNPs/TiO 2 NTs, r PEC reduction CO 2 on CdSeTeNPs/TiO 2 NTs.All scans were in 0.1 mol L A1 KHCO 3 solution, with or without irradiation (Xenon light, 100 mW cm A2 ). Fig. 10.PEC reduction of CO 2 on CdSeTe NPs/TiO 2 NTs at different potentials. Fig. 8. (a) The CO 2 reduction mechanism on the CdSeTe/TiO 2 NTs catalyst.(b) The six electrons reaction mechanism. revealed TiO 2 NTs had slightly absorption to visible light.It was probably because a small amount of carbon doping into TiO 2 NTs after calcination, which resulted in the light absorption of TiO 2 NTs red shift to the visible area.The curve b displayed the photoelectric conversion efficiency increased 2 times after loading CdSeTe NSs to the TiO 2 NTs, reaching to 0.54, which manifested that the introduction of CdSeTe NSs greatly improved Absolute values of current densities for CO 2 reduction at a potential of A1.2 V on the two different catalytic materials. W. Wei et al. / Journal of Colloid and Interface Science 496 (2017) 327-333 This research was supported by the National Natural Science Foundation of China (Grant No. 21203114), Planning Project of Science and Technology in Colleges of Shandong Province (Grant No. J14LC16), we are grateful to the foundation supported by Shandong Jingbo Holdings Corporation."
  }
]