[
  {
    "title": "Doi",
    "content": "10.1016/j.jcat.2017.04.020"
  },
  {
    "title": "Article_Title",
    "content": "Novel photocatalytic conversion of CO2 by vanadium-doped tantalum nitride for valuable solar fuel production"
  },
  {
    "title": "Abstract",
    "content": "In this study, Ta 3 N 5 and V-doped Ta 3 N 5 (V-Ta 3 N 5 ) were synthesized as catalysts for the conversion of CO 2 into valuable fuels under visible light.As compared with Ta 2 O 5 , the synthesized Ta 3 N 5 and V-Ta 3 N 5 exhibited great increases in visible light adsorption and decreases in band gap energy.Therefore, the synthesized Ta 3 N 5 and V-Ta 3 N 5 photocatalytically converted CO 2 into CO and CH 4 even under visible light.The V dopants, which existed in the Ta 3 N 5 lattice, could act as an intermediate band (V3d) between the valence band (N2p) and the conduction band (Ta5d) of the Ta 3 N 5 to increase the electron-hole separation efficiency of the photocatalyst.Thus, the photocatalytic activity of V-Ta 3 N 5 was much higher than that of Ta 3 N 5 .However, an increase in the V doping ratio led the formation of VN particles distributed on the Ta 3 N 5 surface.The formed particles eclipsed the light reaching the photocatalyst surface, resulted in a decrease in photocatalytic activity.The optimal V doping ratio in V-Ta 3 N 5 was found to be 2 wt..As a result, the production rates of CH 4 , CO, O 2 , and H 2 generated from the photocatalytic reduction of CO 2 by 2 wt.V-Ta 3 N 5 under visible light were 425, 236, 1003, and 56 mmol g A1 cat h A1 , respectively."
  },
  {
    "title": "Experimental",
    "content": "Ta 2 O 5 powder (Sigma-Aldrich, 99.9) was calcined for 10 h at 1000 C in a quartz tube furnace under a flow of ammonia gas (50 mL/min) to obtain Ta 3 N 5 32.To synthesize V-doped Ta 3 N 5 photocatalyst, the Ta 2 O 5 powder was added into a 0.05 M NH 4 VO 3 solution, which was prepared by dissolving NH 4 VO 3 in deionized water at 50 C.The obtained mixtures were ultrasonicated and stirred for 1 h and 24 h, respectively, to achieve a uniform suspension.Then the suspension was dried at 150 C in the oven for 12 h and calcined in the quartz tube furnace under a flow of ammonia gas at 1000 C for 10 h to obtain the V-Ta 3 N 5 material.The weight of Ta 2 O 5 and the volume of NH 4 VO 3 solution were controlled to synthesize 1, 2, and 3 V-Ta 3 N 5 materials, in which the V/Ta ratios were 1, 2, and 3 wt.,respectively. X-ray diffraction (XRD) spectra of the pristine Ta 2 O 5 , the synthesized Ta 3 N 5 , and the V-Ta 3 N 5 photocatalysts were obtained using a Bruker AXN model with a CuKa radiation (k 1.5418A) source, operated at a scan rate of 0.02s A1 over a 2h range of 15-55.X-ray photoelectron spectroscopy (XPS) of the V-Ta 3 N 5 photocatalysts was carried out on a Thermo Fisher K-Alpha X-ray photoelectron spectrometry system.Gaussian multipeak shapes were applied to determine the elemental states of the vanadium dopant in the synthesized materials.Transmission electron microscopy (TEM) and high-resolution transmission electron microscopy (HR-TEM) images of the synthesized Ta 3 N 5 and V-Ta 3 N 5 were obtained using a JEOL TEM-2010F at an acceleration voltage of 200 kV.The BET surface area of the Ta 2 O 5 , the synthesized Ta 3 N 5 , and the V-Ta 3 N 5 photocatalysts were calculated, based on a Bru nauer-Emmett-Teller isotherm determined by nitrogen adsorption and desorption at 77 K.An Evolution 300 spectrophotometer (UV-1700 Shimadzu) was used to measure the optical absorption of the pristineTa 2 O 5 and the synthesized Ta 3 N 5 and V-Ta 3 N 5 photocatalysts in the wavelength range 300-700 nm. A continuous gas system was designed for photocatalytic CO 2 conversion.A CO 2 /H 2 O vapor, which was produced by passing compressed high-purity CO 2 gas (99.99) through a water vaporizer, was used as input gas.The flow rate and the relative humidity of the input gas were 30 mL/min and 60, respectively.The input gas was oriented to a top-and-bottom quartz reactor (20 A 2 A 1 cm), which was placed in a reaction chamber, a cask with a dark cover.The residence time of CO 2 in the reactor was 80 s.The top and bottom of the reaction chamber had two 20 W white bulbs (ES 220/N EX-L, Orex Co. Ltd., Korea) equipped with ultraviolet cutoff filters to generate visible light (k !400 nm) with a power density of 0.06 W/cm 2 .Before the photocatalytic conversion experiments, the reactor, containing 100 mg synthesized photocatalysts, which were uniformly dispersed on the reactor floor, was purged three times with high-purity CO 2 gas in order to drive off the air inside.Then the CO 2 /H 2 O mixture gas was oriented to the reactor and the bulbs were turned on to generate visible light for the CO 2 conversion process.To analyze the produced gases, 100 mL of product was automatically injected into the gas chromatography (GC) system at intervals of 30 min.The GC system contained two detectors, a flame ionization detector (FID) equipped with a methanizer for CO and CH 4 analysis and a thermal conductive detector (TCD) for H 2 and O 2 analysis.Control experiments were also conducted to determine carbon sources of the CH 4 and CO and also sources of O 2 and H 2 (see the Supplementary Material)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "XRD patterns of the pristine Ta 2 O 5 , the synthesized Ta 3 N 5 , 1 V-Ta 3 N 5 , 2 V-Ta 3 N 5 , and 3 V-Ta 3 N 5 are shown in Fig. 1.The obtained XRD pattern of the Ta 2 O 5 indicated that it existed in the orthorhombic form 33. Fig. 1 also shows that the XRD pattern of the synthesized Ta 3 N 5 photocatalyst corresponded to the typical XRD pattern of pure Ta 3 N 5 34.As observed in the XRD pattern of the synthesized Ta 3 N 5 , there was no impurity peak, indicating that the Ta 2 O 5 was completely nitrided to Ta 3 N 5 during the sintering in ammonia gas at a high calcination temperature.As compared with the XRD pattern of the Ta 3 N 5 , the XRD patterns of the synthesized V-Ta 3 N 5 photocatalysts show a shift in the peak position toward a smaller diffraction angle accompanied by peak broadening.This was because V dopants defected into the Ta 3 N 5 lattice 35.Both V and Ta are elements in the VB group in the Periodic Table ; during the nitrification converting the Ta 2 O 5 to Ta 3 N 5 , V could easily incorporate into the Ta 3 N 5 lattice by replacing several Ta atoms in the lattice.The lattice parameter of the V-Ta 3 N 5 varied linearly with the dopant concentration up to 2 wt. (see the Supplementary Material).This was because the incorporation of V into the Ta 3 N 5 lattice reached a certain limit, after which significant incorporation of further V into the TiO 2 lattice was not observed, even with further increase of the V/Ta ratio.On the other hand, the intensity of the VN peaks is positively related to the vanadium content in the V-Ta 3 N 5 , as observed in the XRD patterns of the synthesized V-Ta 3 N 5 .The occurrence of the VN was due to the reduction of the remaining V (or NH 4 VO 3 precursor), which was incorporated into the Ta 3 N 5 lattice at high calcination temperature (1000 C) and under ammonia 36.Therefore, the vanadium in the synthesized V-Ta 3 N 5 photocatalysts existed as both V dopant, which was incorporated into the Ta 3 N 5 lattice, and VN, which blended with the Ta 3 N 5 . Fig. 2 shows the high-resolution XPS spectra of the V2p 3/2 peaks of vanadium in the 1 V-Ta 3 N 5 , 2 V-Ta 3 N 5 , and 3 V-Ta 3 N 5 .The Gaussian multipeak shapes indicated that the V2p 3/2 peaks of vanadium in the V-Ta 3 N 5 consisted of two different peaks at 514.5 eV for the V 3 state and 517.4 eV for the V 5 state 29,36,37.The V 5 state in the V-Ta 3 N 5 corresponded to the state of vanadium, which was incorporated into the Ta 3 N 5 lattice.As mentioned in Section 3.1.1., the V 5 incorporated into the Ta 3 N 5 lattice by replacing Ta 5 in the lattice, leading to the formation of Ta-N-V bonds.Because it existed in the Ta 3 N 5 lattice, the V 5 could not be reduced during the material preparation process.However, the remaining V 5 (or NH 4 VO 3 ), which could not be incorporated into the Ta 3 N 5 , was reduced by ammonia to form VN, which corresponded to the V 3 state of vanadium in the synthesized V-Ta 3 N 5 photocatalysts.Fig. 2 also shows that the V 5 content, which positively related to the peak intensity of the V 5 in the XPS spectra, increased with increasing in V/Ta ratio (increasing in the used NH 4 -VO 3 precursor) up to 2 wt..This was because the incorporation of V 5 into the Ta 3 N 5 lattice reached a limit, after which significant incorporation of further V 5 into the TiO 2 lattice was not observed, even with further increase in the V/Ta ratio.Thus, when the incorporation of the V 5 into the Ta 3 N 5 reached the limit, an increase in the V/Ta ratio led to an increase in the VN formation.The result was confirmed by the increase of V 3 concentration in the synthesized materials (Fig. 2). Fig. 3A and A1 shows the TEM and HRTEM images of the selected area in the TEM image of the Ta 3 N 5 .As can be seen, the synthesized Ta 3 N 5 existed as nanocrystal particles with average size approximately 100 nm.Fig. 3B shows the TEM images of the V-Ta 3 N 5 sample.As can be observed, the particle size of the V-Ta 3 N 5 was smaller than that of the Ta 3 N 5 .This was because V doping hindered the clustering or agglomeration of the Ta 3 N 5 .The obtained HRTEM also confirmed the existence of the VN particles on the surface of the V-Ta 3 N 5 photocatalyst (Fig. 3B1).The nitrogen adsorption-desorption isotherms of Ta 3 N 5 and V-Ta 3 N 5 were determined in order to analyze the hysteresis type and morphology of the pores (see the Supplementary Material).The obtained results indicate that all adsorption isotherms were type IV isotherms with hysteresis in the relative pressure range 0.4-1.038.This suggests that both Ta 3 N 5 and V-Ta 3 N 5 had a mesoporous structure 39.The hysteresis type of the isotherm of Ta 3 N 5 was H4, which is often associated with narrow slit pores 40.However, the hysteresis type of the isotherm of V-Ta 3 N 5 was H 2 , which is usually referred to ink-bottle-shaped pores and randomly folded sheets of solids 40.The BET surface areas of the Ta 2 O 5 , Ta 3 N 5 , and V-Ta 3 N 5 are presented in Table 1.The obtained results indicate that there was little difference between the BET surface areas of the Ta 3 N 5 and Ta 2 O 5 .However, the BET surface areas of the V-Ta 3 N 5 were much higher than that of the Ta 3 N 5 .This was due to V doping, which hindered the agglomeration of the Ta 3 N 5 , resulting in the smaller particle size of the V-Ta 3 N5 than of the Ta 3 N 5 .It should be noted that the formation of VN particles on the surface of the Ta 3 N 5 resulted in increasing roughness on the photocatalyst surface and therefore increased surface area of the V-Ta 3 N 5 .The obtained surface area results listed in Table 1 confirmed that the surface area of the V-Ta 3 N 5 was positively related to the V/Ta ratio because the formation of VN, which increases the roughness of the surface, was positively related to the V/Ta ratio (confirmed from XRD and XPS results). Fig. 4A shows the optical absorption spectra of the pristine Ta 2 O 5 and the synthesized Ta 3 N 5 , 1 V-Ta 3 N 5 , 2 V-Ta 3 N 5 , and 3 V-Ta 3 N 5 .Based on the obtained optical absorption spectra, the Tauc plot, combined with the Kubelka-Munk method, was used to estimate the band gap energies of the photocatalysts (Fig. 4B) 41,42.In the Tauc plot, a linear fit was drawn from the transformed curves to the photon energy axis (hm) and the energy value at the point of intersection of the line and the horizontal axis was the band gap energy of the materials, as described in Table 1.The obtained results indicate that Ta 2 O 5 seems to absorb UV light only when the band gap energy is approximately 3.82 eV.As compared with the Ta 2 O 5 , the synthesized Ta 3 N 5 exhibited significant enhancement in the visible light adsorption.The calculated band gap energy of the Ta 3 N 5 was approximately 2.09 eV, corresponding to the typical band gap energy of the Ta 3 N 5 .The increase in visible light absorption and decrease in band gap energies of the Ta 3 N 5 as compared with the Ta 2 O 5 could be explained using Fig. 5.The band gap energy of Ta 2 O 5 was the energy gap between the conduction band, which corresponds to the Fermi level of Ta5d, and the valence band, which corresponds to the Fermi level of O2p.When the Ta 2 O 5 was completely nitrided to Ta 3 N 5 , the energy level of the valence band of the Ta 3 N 5 , which corresponds to the Fermi level of N2p, was higher than that of the Ta 2 O 5 (Fig. 5).Therefore, the band gap energy of the Ta 3 N 5 was lower than that of the Ta 2 O 5 .In addition, because of the lower band gap energy of the Ta 3 N 5 than of the Ta 2 O 5 , the visible light absorption of the Ta 3 N 5 was much higher than that of the Ta 2 O 5 .As compared with Ta 3 N 5 , the V-Ta 3 N 5 materials exhibited great increases in visible light adsorption and decreases in band gap energy.This was because V dopants, which existed in the Ta 3 N 5 lattice, could act as an intermediate band (V3d) between the valence band (N2p) and the conduction band (Ta5d) of the Ta 3 N 5 for electron transfer from the valence band to the conduction band (Fig. 5) 28.When the V/Ta ratio increased up to 2 wt., the band gap energy of the V-Ta 3 N 5 seemed to be stabilized (Table 1).This was due to the limitation of the V dopants existing in the Ta 3 N 5 .In addition, the increase in the V/Ta ratios above 2 wt. led to a great increase in the formation of the VN distributed on the Ta 3 N 5 surface.The formed VN particles could eclipse the light reaching the Ta 3 N 5 surface, resulting in a decrease in light absorption of the 3 wt.V-Ta 3 N 5 as compared with the 2 wt.V-Ta 3 N 5 . The CO 2 conversion experiments indicate that the Ta 2 O 5 could not convert CO 2 under visible light because of its wide band gap energy.However, under visible light, the Ta 3 N 5 and V-doped Ta 3 N 5 photocatalysts converted a certain amount of CO 2 into CO and CH 4 .In addition, significant amounts of O 2 and H 2 were also detected as byproducts of the photocatalytic conversion of CO 2 .The production rates of the CO, CH 4 , H 2 , and O 2 generated from the photocatalytic conversion of CO 2 by the Ta 2 O 5 and the synthesized Ta 3 N 5 , 1 V-Ta 3 N 5 , 2 V-Ta 3 N 5 , and 3 V-Ta 3 N 5 are shown in Table 1.The synthesized Ta 3 N 5 and V-doped Ta 3 N 5 photocatalysts, which were low-band-gap materials, could absorb visible light to generate significant numbers of electron-hole pairs.The generated holes could react with H 2 O to produce protons (H ).The generated electrons could directly reduce CO 2 into a certain radical anion (CO 2 ).However, the direct formation of the CO 2 A intermediate requires a very negative equilibrium potential of A1.9 V (vs.NHE at pH 7).Therefore, the formation of CO Eqs. ( 3) and ( 4) show that 8 mol protons and 8 mol electrons are needed to generate 1 mol CH 4 , whereas the formation of 1 mol CO requires 2 mol protons and 2 mol electrons.However, the generation of CH 4 (E 0 redox A 0.24 V vs. NHE at pH 7) is thermodynamically more feasible than the generation of CO (E 0 redox A 0.48 V vs. NHE at pH 7) 43.Our synthesized Ta 3 N 5 and V-Ta 3 N 5 could produce significant numbers of electrons and holes even under visible light.The dopant could promote charge transportation, leading to a high partial electron density on the photocatalyst surface.The dopants could also effectively enhance the surface reaction kinetics by lowering the activation energy or overpotential for CO 2 reduction, leading to selective conversion of CO 2 into CH 4 17.Therefore, the synthesized V-Ta 3 N 5 selectively converted CO 2 into CH 4 rather than CO.For example, the production rates of CH 4 and CO generated from the photocatalytic reduction of CO 2 by the 2 V-Ta 3 N 5 under visible light were 425 and 236 mmol g A1 cat h A1 , respectively.The production rates of O 2 and H 2 generated as byproducts of the photocatalytic conversion of CO 2 by the 2 V-Ta 3 N 5 were 1003 and 56 mmol g A1 cat h A1 , Fig. 3. TEM images of Ta 3 N 5 (A) and V-Ta 3 N 5 (B); HRTEM images of the selected areas in the TEM images of Ta 3 N 5 (A1) and V-Ta 3 N 5 (B1 and B2). The BET surface area, band gap energy, and production rates of Ta 2 O 5 , Ta 3 N 5 , 1 V-Ta 3 N 5 , 2 V-Ta 3 N 5 , and 3 V-Ta 3 N 5 materials.respectively.On the other hand, the production rates of O 2 could be calculated from the production rates of other products including CH 4 , CO, and H 2 .Based on Eqs.((2)--( 5)), the O 2 production rate is 2 A CH 4 production rate 1/2 A CO production rate H 2 production rate 996 (mmol g A1 cat h A1 ), which is similar to the detected O 2 production rate.Thus, the investigated CO 2 conversion mechanism following Eqs.((1)--( 5)) is scientifically correct.Table 1 indicates that the CO 2 conversion on the V-Ta 3 N 5 materials was much higher than that on the Ta 3 N 5 .This was because the V dopants, which existed in the Ta 3 N 5 , acted as an intermediate band between the valence band and the conduction band of the Ta 3 N 5 to narrow band gap energy and enhance its electron-hole pair separation efficiency.In addition, the intermediate band created by the V dopants also prevented the recombination of the generated electrons and holes.Therefore, the V-Ta 3 N 5 could generate significant numbers of electrons and holes for photocatalytic conversion of CO 2 relative to the Ta 3 N 5 .Table 1 also shows that the optimal V doping content enhancing photocatalytic conversion of CO 2 was 2 wt..The obtained result was consistent with the characterized properties.There was a certain limit on V dopant incorporation into the T 3 N 5 lattice leading to enhancement in its photocatalytic activity.Above the optimal doping content, the vanadium tends to exist in the form of VN distributed on the Ta 3 N 5 surface.The distributed VN could eclipse the light reaching the Ta 3 N 5 surface, resulting in a decrease in its photocatalytic activity."
  },
  {
    "title": "Conclusions",
    "content": "We successfully synthesized Ta 3 N 5 and V-Ta 3 N 5 for CO 2 conversion to produce valuable fuels, including CH 4 , CO, H 2 , and O 2 , even under visible light.Because the energy level of the valence band of the Ta 3 N 5 was higher than that of the Ta 2 O 5 , the band gap energy of the Ta 3 N 5 was lower than that of the Ta 2 O 5 , resulting in the visible light absorption by the Ta 3 N 5 being higher than that by the Ta 2 O 5 .Therefore, the photocatalytic activity of the Ta 3 N 5 for CO 2 conversion was higher than that of the Ta 2 O 5 .The V dopants, which existed in the Ta 3 N 5 lattice, decreased the band gap energy, thereby increasing the electron-hole separation efficiency of the V-Ta 3 N 5 photocatalysts.Thus the photocatalytic activity of the synthesized V-Ta 3 N 5 was higher than that of the Ta 3 N 5 .However, a large increase in the V doping ratio led the formation of VN particles distributed on the Ta 3 N 5 surface to eclipse the light reaching the photocatalyst, resulting in a decrease in its photocatalytic activity.The optimal V doping ratio in V-Ta 3 N 5 was 2 wt..The production rates of CH 4 , CO, O 2 , and H 2 generated from the photocatalytic reduction of CO 2 by 2 V-Ta 3 N 5 under visible light were 425, 236, 1003, and 56 mmol g A1 cat h A1 , respectively. Fig. 1.XRD patterns of the Ta 2 O 5 and the synthesized Ta 3 N 5 , 1 V-Ta 3 N 5 , 2 V-Ta 3 N 5 , and 3 V-Ta 3 N 5 . Fig. 2. High-resolution XPS spectra of V2p 3/2 peaks of vanadium in 1 V-Ta 3 N 5 (A), 2 V-Ta 3 N 5 (B), and 3 V-Ta 3 N 5 (C). Fig. 4. UV-vis absorption spectra (A) and Tauc plot (B) of the pristine Ta 2 O 5 and the synthesized Ta 3 N 5 , 1 V-Ta 3 N 5 , 2 V-Ta 3 N 5 , and 3 V-Ta 3 N 5 . This research is funded by Vietnam National Foundation for Science and Technology Development (NAFOSTED) under grant number 104.99-2016.29. Supplementary data associated with this article can be found, in the online version, at http://dx.doi.org/10.1016/j.jcat.2017.04.020."
  }
]