[
  {
    "title": "Doi",
    "content": "10.1039/c9cy00824a"
  },
  {
    "title": "Article_Title",
    "content": "Construction of spindle structured CeO<sub>2</sub> modified with rod-like attapulgite as a high-performance photocatalyst for CO<sub>2</sub> reduction"
  },
  {
    "title": "Abstract",
    "content": "In this study, a spindle structured CeO 2 photocatalyst modified with rod-like attapulgite (CeO 2 /ATP) was successfully prepared by simple high temperature calcination.ATP was deposited in the precursor solution of CeO 2 and then heating up the mixture afforded the CeO 2 /ATP photocatalyst.The photocatalyst showed remarkable reduction efficiency for CO 2 .CO (309.44 mol g -1 h -1 ) and CH 4 (184.33mol g -1 h -1 ) are the major products for CO 2 reduction obtained by using the optimum proportion of the CeO 2 /ATP photocatalyst; the yield of CO and CH 4 was about 3 and 3.6 times higher than that of CeO 2 , respectively.The improvement in the CO 2 reduction efficiency originated from the higher conductivity of ATP, which promoted electron transport and enhanced the separation efficiency of the electron holes.At the same time, the introduction of ATP inhibited the accumulation of CeO 2 and also increased the active sites for CO 2 reduction.Moreover, a possible photocatalytic mechanism for the CO 2 reduction reaction was proposed based on the experimental results.In addition, this study provides new insights for the simple preparation of other photocatalysts with high performance for CO 2 reduction."
  },
  {
    "title": "Experimental",
    "content": "CeIJNO 3 ) 3 6H 2 O (99.95), urea (AR), polyvinylpyrrolidone (PVP, AR), acetonitrile (99), and oleic acid (AR) were all purchase from Aladdin Chemistry Co., Ltd.HCl (38.0), triethanolamine (AR), NaOH (97), BaSO 4 (AR), KBr (AR), and ethanol (AR) were all purchased from Sinopharm Chemical Reagent Co., Ltd.Attapulgite (ATP) was purchased from Jiangsu Da Yu Development Co., Ltd. of China.Distilled water was used throughout the experiments. First, in order to obtain pure ATP, the ATP needs to be acidified to get rid of the impurities.The acidification of ATP was done in the typical way, in which 40 g original ATP was added into 50 mL HCl (pH 4) and 250 mL distilled water, and was stirred for 5 h.The products were collected after washing with distilled water and C 2 H 5 OH several times, and then dried at 60 C.Second, 1.0 g PVP and 27.0 g urea were dissolved in 100 mL CeIJNO 3 ) 3 6H 2 O aqueous solution (0.10 mol L -1 ), and then a certain amount of ATP (0.0017 g, 0.017 g, 0.0255 g, 0.051 g) was added.The mixture was stirred at 85 C for 2 h.Then, the product was isolated by centrifugation, washing, and drying at 60 C.Finally, the precipitates were calcined at 350 C for 3 h with a heating rate of 5 C min -1 , and the CeO 2 /ATP photocatalyst with 0.1 wt, 1 wt, 1.5 wt, and 3 wt of ATP mass ratios (denoted as CA-0.1,CA-1, CA-1.5, and CA-3) was harvested.In addition, pure CeO 2 was synthesized using the above method but without using ATP in the process. The powder X-ray diffraction (XRD) measurements were performed using Ni-filtered Cu K radiation (40 kV, 200 mA).The diffraction data were collected from 10-80in a fixed time mode, with a step interval of about 7min -1 .The scanning electron microscopy (SEM) images were recorded on a F20S-TWIN electron microscope (SEM, Hitachi).The morphological measurements were examined using transmission electron microscope (TEM) and high-resolution TEM (HRTEM).Fourier transform infrared (FT-IR) spectrometer was used to collect data in the wavenumber range of 400-4000 cm -1 on a Nicolet Magna-IR 550 spectrometer.The ultraviolet-visible diffuse reflectance spectra (UV-vis DRS) of the samples were investigated via a UV-vis spectrophotometer (Shimadzu UV-3600) and BaSO 4 was used as the reference.The Brunauer-Emmett-Teller (BET) surface area measurements were performed using a porosity (NDVA-2000e) and surface area analyzer.The photoluminescence (PL) spectra and the transient fluorescence (FL) were investigated using a F4500 photoluminescence detector (Hitachi, Japan).Transient photocurrent and electrochemical impedance spectroscopy (EIS) were studied using an electrochemical workstation (VersaSTAT3).The resistivity was tested on a resistivity system HALL8800.The CO 2 temperature-programmed desorption measurements (CO 2 -TPD) were performed on a Quantachrome Autosorb-iQ-C chemisorption instrument. The photocatalytic activity of the as-synthesized samples was studied by CO 2 reduction.For each test, 70 mL of 0.1 mol L -1 NaOH solution and 5 mL acetonitrile were poured into a custom-made quartz reactor (300 mL), followed by the addition of 0.05 g of the photocatalyst. 43After sealing the reactor, CO 2 was passed through for 30 min and then, the ultraviolet light (254 nm, 8 W) was turned on, which was directed on top of the quartz reactor at about 2 cm.After each period of 60 min, 500 L gas from the reaction was sampled and analyzed using a gas chromatograph (GC-7920) with a thermal conductivity detector (TCD) and a flame ionization detector (FID). The photo-electrochemical performance of the photocatalyst was studied using the photocurrent response studies and electrochemical impedance spectroscopy (EIS) on a VersaSTAT3 electro-chemical station.0.005 g of the photocatalyst was added to 0.1 mL oleic acid and 1.0 mL ethanol, and the dispersion mixture was spun onto FTO substrates (1.0 cm 0.8 cm) for use as the corresponding working electrodes.An Ag/AgCl electrode and Pt electrode were used as the reference electrode and the counter electrode, respectively."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Fig. 1a shows the theoretical structural diagram of CeO 2 .Ce 4 is densely packed according to the face-centered cubic structure and O 2-occupies all the tetrahedral spaces.The XRD patterns of the as-synthesized samples are shown in Fig. 1b.The peaks for ATP were detected at 19.9, 27.6, 35.3, 42.7, and 61.9, which is consistent with a previous report. 44For CeO 2 , the peaks at 28.54, 33.08, 47.48, 56.33, 59.09, 69.40, 76.70, and 79.07can be clearly observed, which correspond to the (1 1 1), (2 0 0), (2 2 0), (3 1 1), (2 2 2), (4 0 0), (3 3 1), and (4 2 0) planes of the cubic fluorite-structured CeO 2 crystal (JCPDS card No: 34-0394).As for the CA-0.1,CA-1, CA-1.5, and CA-3 samples, the typical diffraction peaks of CeO 2 can also be observed easily, meaning that the introduction of ATP does not affect the crystal structure of CeO 2 .Contrarily, some diffraction peaks of ATP in these samples are not distinct, which is probably due to the low ATP dosage and shading effect of CeO 2 .It is worth noting that the main diffraction peaks for CeO 2 in the CA-3 sample became wider, possibly due to the overlap of the diffraction peaks of ATP and CeO 2 . TEM and HRTEM were used to investigate the morphologies and microstructures of ATP, CeO 2 , and CA-1 (Fig. 2).It is clear from Fig. 2a that ATP exhibits a rod-like structure with different lengths.In Fig. 2b, the pure CeO 2 is bulky with poor dispersion and is stacked on each other with the uniform spindle structure and an average size of 1.5 m.Under low magnification (Fig. S1, ESI ), it could also be found that CeO 2 stacked on each other.After the introduction of ATP, the stacking degree of CeO 2 decreases with a relatively high dispersion (Fig. 2c).Meanwhile, it can be clearly observed that the rod-like structure and the spindle structure are crossing each other.The interface connections are clear from the marks (red dashed line), demonstrating that the rod-like ATP and spindle structured CeO 2 combine rather than simply stack (Fig. 2d ande).This is beneficial to the rapid separation of electrons and holes for the improvement of photocatalytic CO 2 reduction activity.The HRTEM image recorded from the selected area of CA-1 is shown in Fig. 2f.It is clearly seen that the fringe spacing of 0.316 nm in the shell can be ascribed to the (111) plane of the fluorite cubic CeO 2 , which is in good agreement with the XRD results.Furthermore, it is difficult to find the fringes for ATP, which further evidences its amorphous structure.On the basis of the above results, it can be inferred that the CeO 2 /ATP photocatalyst was successfully prepared. Fig. 3 displays the FT-IR patterns of ATP, CeO 2 , and CA-1.The FT-IR spectra of all the as-prepared samples are shown in Fig. S2. As shown in Fig. 3a, the absorption peaks at 3417 cm -1 and 3282 cm -1 are attributed to the stretching vibrations of the structural Si-OH-Si and Si-(OH)-Al bonds in ATP, 45 respectively.Several absorption peaks in the range of 1700-1600 cm -1 are assigned to the bending vibrations of the adsorbed hygroscopic water or structural -OH. 46This indicates that the surface hydroxyl groups boost the adsorption CO 2 capacity of ATP.In addition, two absorption peaks at View Article Online 1031 cm -1 and 984 cm -1 correspond to the asymmetric stretching vibration of Si-O-Si and the stretching vibration of Si-O-Mg in ATP, respectively. 47For CeO 2 (Fig. 3b), the wide absorption peak at 3450 cm -1 is ascribed to the asymmetrical -OH stretching vibration. 48The region of 1600-1400 cm -1 is attributable to the bending vibration of physically adsorbed water (O-H) molecules.As for the CA-1 (Fig. 3c), the main characteristic absorption peaks of CeO 2 almost remain unchanged after the addition of ATP; however, their intensities increase obviously with a broader absorption region.These are mainly attributed to the hydrogen bonding interaction between CeO 2 and the hydroxyl groups of ATP, and the overlap of peaks.Therefore, the groups on the surface of the photocatalyst can be detected, and, particularly, the surface hydroxyl groups play a crucial role in CO 2 reduction. The Raman spectra of CeO 2 and CA-1 are shown in Fig. 4. For CeO 2 , the sharp peak at 459 cm -1 is assigned to the F 2g vibration band of the Ce-O 8 vibrational unit of pure cubic phase CeO 2 . 49In addition, there are two weak second order peaks at about 260 cm -1 and 600 cm -1 , which are assigned to the transverse acoustic mode and non-degenerate longitudinal optical mode, respectively.In CA-1, the F 2g vibration band of the Ce-O 8 vibrational unit is slightly red-shifted to 460.5 cm -1 , which is due to the change in the interatomic force and oxygen vacancies.The intensity of the F 2g vibrational band is apparently weaker than that of CeO 2 , indicating that the incorporation of ATP into the lattice of CeO 2 enormously inhibits the crystal growth of CeO 2 and disturbs the structural symmetry of the catalyst, which further reveals that ATP was successfully introduced into CeO 2 .and 101.4 m 2 g -1 , respectively.The enhanced SSAs would potentially yield more accessible active sites, which enhance its performance for CO 2 reduction.The pore volume, average pore diameter, and the specific surface areas are given in Table S1. The addition of ATP increases the pore size distribution range and the pore volume of CeO 2 .In Fig. 5b, it can be seen that all the samples have a mesoporous pore size.In addition, it has been proved that the mesoporous structure of the CA-1 photocatalyst not only facilitates the absorption and View Article Online utilization of light but also improves the contact between the photocatalyst and CO 2 . The chemical states and the surface elemental composition of CeO 2 were examined using XPS, and the results are shown in Fig. 6.Basically, the oxidation state of CeO 2 is an important parameter of its structure.The survey spectrum of CeO 2 in Fig. 6a indicates that Ce and O elements exist on the CeO 2 surface.It can be seen that the Ce 3d spectrum has a rather complex structure as there are six peaks that can be discovered (Fig. 6b).The peaks at 882.59 eV, 889.30eV, and 898.57eV are ascribed to Ce 3d 5/2 and the other peaks at 901.00 eV, 907.59 eV, and 916.90 eV are ascribed to Ce 3d 3/2 , indicating the main Ce 4 chemical valency. 50,51Moreover, the core level XPS spectrum of O 1s is shown in Fig. 6c.The significant O 1s peak of pure CeO 2 can be separated to four peaks at about 529.55 eV, 530.58 eV, and 531.81 eV, which are ascribed to the O atoms in CeO 2 , hydroxyl oxygen, the surface adsorbed oxygen, and the O 1s electron binding energy. 52,53The peak at 530.58 eV is assigned to oxygen vacancies 54,55 within the cerium oxide system with another higher binding energy peak at 531.81 eV attributable to the adsorbed H 2 O. 56 Fig. S3 shows the XPS pattern for CA-1.As expected, Mg, Al, and Si are detected in the XPS survey spectrum as shown in Fig. S3. The results of the XPS analysis illustrate that CeO 2 is linked with ATP via a chemically bound interface rather than through physical contact. In order to further evidence the photoresponse properties and the charge carrier transfer ability of the as-prepared samples, the photoelectrochemical measurements were conducted and the results are shown in Fig. 7a.CeO 2 shows a fast and uniform photocurrent response at about 0.7 A.These prove that CeO 2 can produce photoelectric current response and efficiently separate the generated electrons and holes.It is noteworthy to mention that the CA-1 photocatalyst exhibits the highest photocurrent densities compared to the CeO 2 and ATP samples.It can be seen that the photocurrent intensity of CA-1 is approximately 2.2 times and 5 times than that of CeO 2 and ATP, respectively.The enhanced photocurrent intensity of CA-1 is due to the fact that ATP increases the electron transfer rate and inhibits the recombination of electrons and holes, which is favorable for improving the capacity of CO 2 reduction.EIS is also a technology to investigate the separation efficiency of the electron-hole pairs for the photocatalytic material.In general, the smaller arc radius reflects the smaller charge transfer obstruction of the electron-hole pairs, meaning more efficient charge separation efficiency. 57Fig. 7b shows the EIS responses of ATP, CeO 2 , and CA-1.ATP has a small impedance radius, which means that it has a good electron transport capacity.The CA-1 photocatalyst displays a smaller arc radius than pure CeO 2 , which means that it has better effective charge transfer properties.This also implies that the introduction of ATP can ef-fectively improve the photogenerated carrier separation and transfer.Therefore, CA-1 has high CO 2 reduction performance. Fig. 8 is the PL spectra of the CeO 2 and CA-1 photocatalysts.It can be seen that both the samples exhibit an emission peak centered at about 570 nm.However, the PL intensity of the CA-1 photocatalyst is diminished compared to that of pure CeO 2 .The increase in the separation efficiency of the electron-hole pairs leads to the decrease in the peak strength.A lower PL intensity, indicating a slower View Article Online recombination of the electron-hole pairs, suggests that more photoexcited holes and electrons can participate in redox reactions and, thereby, enhance the photocatalytic performance. 58Thus, the rate of electron-hole pair recombination of CeO 2 was higher than that of the CA-1 catalyst.This means that the combination of ATP with CeO 2 can separate the photogenerated charge carriers and suppress their recombination, resulting in the enhanced CO 2 reduction activity.CA-1 also shows a slower decay in the time-resolved fluorescence spectra (Fig. 8b).By fitting their decay kinetics, it is observed that all the lifetimes of the components increase sharply (Table S2 ).The calculated average lifetimes of CA-1 (2.43 ns) are approximately two times that of CeO 2 (1.44 ns).A longer decay lifetime indicates faster interfacial electron transfer occurring at the CA-1 surface.The result also demonstrates that ATP can raise the separation efficiency and increase the number of charge carriers taking part in the photocatalytic reduction of CO 2 .Moreover, the resistivity of ATP was tested to explore its conductivity, and the results are shown in Fig. 9.The result further explains that ATP can promote the separation of the photogenerated carriers. The calculated resistivity of ATP by the U-I curves are shown in Fig. 9, where the resistivity is small at about 11.0 m.Therefore, ATP has excellent electron transport capability due to its low resistivity, and the results are consistent with that of the photocurrent response studies and EIS.Therefore, the introduced ATP enhanced the photogenerated carrier transport, prolonged the electron lifetime, and lowered the recombination of charge carriers.Therefore, the introduction of ATP can enhance the performance for photocatalytic CO 2 reduction. The optical properties of the as-prepared samples were examined using UV-vis DRS.As shown in Fig. 10a, the absorption edge of ATP is at 405 nm, while CeO 2 exhibits a typical absorption edge at about 427 nm.As can be seen, the absorption edge is red-shifted to 437 nm in CA-1 and the wider light-absorbing region of CA-1 will improve the light utilization.Therefore, ATP can improve the light absorption and will enhance the photocatalytic reduction of CO 2 .In Fig. 10b, according to (h) 1/2 , the calculated band gap of CeO 2 and CA-1 are 2.70 eV (ref.59) and 2.61 eV, respectively.The decrease in the band gap of CA-1 may originate from the introduction of ATP.Therefore, CA-1 showed enhanced light absorption as well as a higher electron-hole separation rate.We also obtained the UV-vis spectra of the different samples, and the results are shown in Fig. S4. To prove the CO 2 adsorption capacity of CA-1, we performed the CO 2 -TPD, and the results are shown in Fig. 11.The typical desorption peak of CeO 2 and CA-1 can be clearly identified at about 120 C.The peak of CA-1 is higher than that of CeO 2 , suggesting that the CO 2 molecules bind more strongly with CA-1.So, CO 2 can be better absorbed and utilized. The photocatalytic CO 2 reduction activity of the assynthesized CeO 2 and CeO 2 /ATP composite with different ATP contents were investigated by the reduction of CO 2 under ultraviolet light irradiation for 5 h.Here, the yield was calculated by the amount of product per gram of the photocatalyst produced in the specific reaction duration.Fig. 12 shows the evolution of the main products CO and CH 4 .It can be found that pure CeO 2 is responsive to the light source and can reduce CO 2 under this condition but after the introduction of ATP, the yield of CO and CH 4 significantly increased.From the points in the plots, it was found that the yields of both CO and CH 4 increased with the irradiation time for all the catalysts, and the CeO 2 /ATP composites exhibited higher activity for the production of both CO and CH 4 than CeO 2 .However, the CA-1 photocatalyst showed good photocatalytic performance for the reduction of CO 2 .The maximum yield after 5 h of the photocatalytic reaction for containing 1.0 wt ATP (0.017 g) is 309.44 mol g -1 h -1 and 184.33 mol g -1 h -1 for CO and CH 4 , respectively.When the content of ATP was increased to 0.051 g and 0.1 g, the CO and CH 4 yield significantly reduced.This demonstrates that excessive ATP on the surface of CeO 2 will decrease the light transmission.At the same time, a lower content of ATP will not form the uniformly crossed structure with CeO 2 and lead to a higher recombination rate of the photo-generated electrons and holes.Therefore, the CeO 2 /ATP catalyst with a suitable loading amount of ATP has good photocatalytic performance for the reduction of CO 2 , which further demonstrates that the introduction of ATP improves the disadvantages of pure CeO 2 and enhances the photocatalytic activity of CeO 2 . Based on the data from the XPS measurements, the valence band (VB) of CeO 2 is calculated to be 2.0 eV (Fig. 13) and the CeO 2 band gap is 2.70 eV.The conduction band (CB) of CeO 2 can be determined using the following equation: E CB E VB -E g .Therefore, the alignment of the energy levels can be drawn and the possible photocatalytic reaction mechanism can be proposed for the CeO 2 /ATP photocatalyst, as shown in Fig. 14. The reduction potential for the reduction CO 2 to CH 4 is E CO 2 /CH 4 -0.24eV, 60 and for CO 2 to CO is E CO 2 /CO -0.53eV. 61It can be seen from Fig. 14 that the energy of the conduction band for CeO 2 /ATP can meet the energy requirements for the reduction of CO 2 to CH 4 and CO, indicating that there is a sufficient driving force to promote the CO 2 photoreduction. 62Under light irradiation, the photogenerated electrons can transfer from the VB of CeO 2 to the CB of CeO 2 .So, at the CB of CeO 2 , CO 2 is reduced to CO and CH 4 by the accumulated photoinduced electrons (e -).These results imply that the structure of CeO 2 /ATP is suitable in improving the separation efficiency of the photoinduced charge carriers.To some extent, the transmission property of ATP inhibits the recombination of electrons and holes.At the same time, ATP could result in a large specific surface area and enhance the absorption of more CO 2 , which can improve the CO 2 reduction performance of CeO 2 /ATP."
  },
  {
    "title": "Conclusions",
    "content": "In this study, a rod-like and spindle structured CeO 2 /ATP photocatalysts were successfully synthesized.The CA-1 composites show the best photocatalytic activity for the reduction of CO 2 .The CO and CH 4 yield was 309.44 mol g -1 h -1 and 184.33 mol g -1 h -1 , respectively, which is about three times higher than that given by pure CeO 2 in the photocatalytic reduction of CO 2 under the same conditions.The enhanced activity of CeO 2 /ATP was attributed to the high conductivity and adsorption property of ATP.It inhibited the recombination of the photogenerated electrons and hole pairs and improved the CO 2 absorption.This study provides a novel route for the preparation of rod-like and spindle structured photocatalysts for converting CO 2 into other hydrocarbons.All the results show that the CeO 2 /ATP composite can be used as a promising photocatalyst for energy conversion and environmental restoration.We hope that this study is helpful to the scientific community in developing low cost photocatalysts for the conversion of CO 2 to high value-added hydrocarbon fuel.Moreover, this study provides a novel route for the synthesis of a rod-like and spindle structured photocatalyst, and also demonstrates the potential of a new photocatalyst for the conversion of CO 2 into other hydrocarbons from the environment. Fig. 1 Structural diagram of CeO 2 (a), XRD patterns of ATP, CeO 2 , CA-0.1, CA-1, CA-1.5, and CA-3 (b). Fig. 4 Raman spectra of CeO 2 and CA-1.Fig. 3 FT-IR spectrum of (a) ATP, (b) CeO 2 , and (c) CA-1. Fig. 2 The TEM images of (a) ATP, (b) CeO 2 , (c-e) CA-1 with a different enlargement scale, and (f) the HR-TEM image of CA-1. Fig. 6 XPS spectra of the as-prepared CeO 2 : (a) survey spectrum, (b) Ce 3d spectrum, and (c) O 1s spectrum. Fig. 5 N 2 adsorption-desorption isotherms (a) and BJH pore size distribution curves (b) of the CeO 2 and CA-1 photocatalysts. Fig. 8 (a) PL spectra and (b) time-resolved fluorescence decay spectra of CeO 2 and CA-1. Fig. 7 (a) Photocurrent response curves of ATP, CeO 2 , and CA-1 under visible light irradiation.(b) Nyquist plots of EIS obtained for ATP, CeO 2 , and CA-1. Fig. 10 (a) UV-vis absorption spectra of ATP, CeO 2 , and CA-1.(b) The CeO 2 and CA-1 band gap evaluation using the linear dependence of (h) 1/2 versus h. Fig.9Two times (a1, a2 and b1, b2) of the U-I curves of ATP for calculation its resistivity under magnetic field (6800 G). Fig. 11 CO 2 -TPD spectrum of CeO 2 and CA-1. Fig. 12 Yields of CO (a) and CH 4 (b) for different photocatalytic reduction of CO 2 . Fig. 14 The schematic of the band structure diagram and photoinduced carrier transfer in CeO 2 /ATP for CO 2 photoreduction. Fig. 13 XPS valence band spectrum of CeO 2 . . Sci. Technol., 2019, 9, 3788-3799 3797 This journal is The Royal Society of Chemistry 20192H 2 O h 4H O 2 4e -(E 0.82eV)(3)CO 2 2H 2e - CO H 2 O(E -0.53eV)(4)CO 2 8H 8e - CH 4 2H 2 O(E -0.24eV)(5) This journal is The Royal Society of Chemistry 2019 Financial support by the National Natural Science Foundation of China (No. U1662125, 21871124), the Postdoctoral Science Foundation of China (No. 2016M590418), the Innovative Talents Project in Colleges and Universities of Liaoning Province (Year 2018), and the Foundation of Liaoning Province Educational Committee (No. L201683672), are gratefully acknowledged. There are no conflicts to declare."
  }
]