[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2017.02.076"
  },
  {
    "title": "Article_Title",
    "content": "AuPd/3DOM-TiO 2 catalysts for photocatalytic reduction of CO 2 : High efficient separation of photogenerated charge carriers"
  },
  {
    "title": "Abstract",
    "content": "The photocatalytic conversion of CO 2 and H 2 O into value-added chemicals using sunlight is significant to solve energy crisis and environmental problems.In this work, a series of novel bifunctional catalysts of core-shell structured AuPd nanoparticles decorated 3DOM TiO 2 (AuPd/3DOM-TiO 2 ) w were successfully fabricated via a facile one-pot method of gas bubbling-assisted membrane reduction (GBMR).AuPd/3DOM-TiO 2 catalysts show uniform 3D ordered macroporous structure, and the slow photon effect of 3DOM-TiO 2 as a photonic crystal can enhance light-harvesting efficiency.AuPd nanoparticles are highly dispersed on the surface of 3DOM-TiO 2 carrier.Since bimetallic AuPd nanoparticles with the relatively low Fermi level have good capacity of trapping electron, they can efficiently promote the separation of photogenerated electron-hole pairs in TiO 2 .The AuPd/3DOM-TiO 2 catalysts exhibit excellent photocatalytic activity for CO 2 reduction with H 2 O to CH 4 under light irradiation.Among the studied catalysts, Au 3 Pd 1 /3DOM-TiO 2 catalyst exhibits the highest photocatalytic activity and selectivity for CO 2 reduction, e.g., its formation rate of CH 4 is 18.5 mol g -1 h -1 and its selectivity to CH 4 production by CO 2 reduction is 93.9.The possible mechanism of AuPd/3DOM-TiO 2 catalysts for photocatalytic CO 2 reduction is also proposed, and it would guide further design and synthesis of high efficient photocatalysts for CO 2 reduction with H 2 O."
  },
  {
    "title": "Experimental",
    "content": "3DOM-TiO 2 support was synthesized by the method of colloidal crystal template (CCT).The synthesis procedures, such as preparations of monodispersed polymethyl methacrylate (PMMA) microspheres, fabrication of CCT via centrifugation method, and assembly, have been described and reported in the previous papers 484950.3DOM-TiO 2 support was obtained after calcination at 600 C for 5 h in a tube furnace. A series of bimetallic AuPd nanoparticle catalysts (weight ratios of Au/Pd 3, 1, and 1/3) were prepared by one-pot process of GBMR method with the poly(N-vinyl-2-pyrrolidone) (PVP) as the protecting agent and NaBH 4 as the reducing agent.The detailed information about the gas bubbling-assisted membrane reduction apparatus and schematic diagram are described previously 51,52.The total noble metal content of photocatalyst is 4.0 wt..The typical preparation processes are described as follows: Firstly, 3DOM TiO 2 support (1 g) was added into 100 mL deionized water and then a desired amount of protecting agent (PVP) was dropped under vigorous stirring.Subsequently, the aqueous solution of HAuCl 4 and PdCl 2 with the theoretical weight ratios of Au/Pd being 3, 1 and 1/3 was added into the before-mentioned mixing solution.After vigorously stirred for 0.5 h, the mixture flowed into the ceramic membrane reactor driven by a peristaltic pump.And NaBH 4 solution (the mole ratio of NaBH 4 /noble metal is 5) driven by a constant flow pump was injected into the membrane reactor and incorporated with the metal precursor mixed solution through the holes (d 40 nm) on the ceramic membrane tubes.In order to make before-mentioned mixing solution homogenous, in the meantime, hydrogen gas was introduced into the membrane reactor via the other two ceramic membrane tubes.After completing the consumption of NaBH 4 solution, the reaction system was further vigorously bubbled with hydrogen gas for 1 h.Then, AuPd/3DOM-TiO 2 catalysts were obtained after filtered, washed, dried and calcined at 400 C for 2 h.For comparison, Au/3DOM-TiO 2 and Pd/3DOM-TiO 2 catalysts with the same total metal loading were also prepared in similar process. The morphology and microscopic structure information were obtained on a scanning electron microscope (SEM, FEI Quanta 200F) and a transmission electron microscope (TEM, JEOl JEM 2100) equipped with a field emission source at an accelerating voltage of 200 kV.Mercury intrusion poros-imetry (MIP) experiments were performed by a Micromeritics AutoPoreIV 9500 apparatus.The specific surface area was calculated by the Brunauer-Emmett-Teller (BET) method.The crystal phase properties of all as-prepared samples were analyzed with a powder X-ray diffractometer (Shimadzu XRD 6000) and a Renishaw Micro-Raman System 2000 spectrometer.The laser line of Raman microscope was 532 nm.Xray photoelectron spectra (XPS) were acquired by a Perkin-Elmer PHI-1600 ESCA spectrometer with Mg Ka emission.The actual contents of Au and Pd were determined by inductive coupled plasma atomic emission spectrometry (ICP-AES).Photoluminescence (PL) spectra were recorded using the Edinburgh Instruments Xe900 equipped with a Xe lamp and the excitation wavelength was set at 380 nm.The surface photovoltage (SPV) measurements were carried out on a surface photocurrent spectroscope (PL-SPS/IPCE1000).Photoelectrochemical (PEC) measurements were performed on an electrochemical workstation (CHI660E) in the saturated solution of Na 2 SO 4 , which has a three-electrode configuration and all asprepared samples, the saturated Ag/AgCl, a platinum foil were employed to as working photoelectrode, reference and counter electrode, respectively.And PEC measurements assigned to CO 2 reduction were also performed on the same equipment in NaHCO 3 solution (0.1 mol L -1 ).The potential of -0.6 V (vs.SCE) was applied to the work electrode.Before the experiment, CO 2 was purged into NaHCO 3 solution for 20 min until it was saturated.The samples were illuminated under a 300 W Xe lamp. CO 2 photocatalytic reduction was carried out in a gas-closed circulation system (Perfect Light Company, Beijing, China) irradiated under a 300 W Xe lamp (l 320-780 nm).The certain amount of catalysts was uniformly dispersed on a watch-glass with the basal diameter of 6.5 cm.Before the light irradiation, the photoreactor system was thoroughly vacuum-treated, then CO 2 gas was introduced into the circulation system.The deionized water (2 mL) was injected into the bottom of the reactor.The intensity of incident light was measured to be 80 mW cm -2 by a spectroradiometer.During the light irradiation in 6 h, the amounts of H 2 , CO, and hydrocarbons in the reactor were analyzed by an online gas chromatograph (GC-9560; HuaAiSePu Corp., Shanghai, China) with a flame ionization detector (FID) and a thermal conductivity detector (TCD) each 40 min intervals.The gas products were analyzed by the external standard method.The apparent quantum efficiency (AQE) was measured under the similar photocatalytic reaction condition, and the irradiation light with different wavelength (380, 420, 450, 520 and 600 nm) using a band-pass filter (full width at half maximum 15 nm) was used as the light source.The incident flux was determined by Radiometer (FZ-A, Photoelectric Instrument Factory of Beijing Normal University).The AQE values of the CO 2 reduction were calculated according to the following Eq.: In order to observe the morphology and macroporous structure of AuPd/3DOM-TiO 2 catalysts, SEM observations were carried out.Fig. 1 shows the SEM images of as-prepared catalysts with different weight ratios of Au/Pd obtained via one-pot GBMR method.The catalysts show clearly three-dimensionally highly ordered macroporous structure obtained via replicating of 3D close-packed PMMA template with a face-centered cubic (FCC) array 53.The diameters of periodic voids are in the range of 200 10 nm, which corresponds to shrinkage of 15-20 in comparison with the initial size (250 nm) of PMMA microspheres (Fig. S1).The shrinkage may be caused by the melting of polymer templates and the formation of produced metal oxides.Moreover, the sublayer pores with relatively small sizes (60 10 nm) can be observed clearly and connect the periodic voids, which could be helpful for the reactant diffusion and light harvesting.In addition, the morphology structure of AuPd/3DOM-TiO 2 catalysts (Fig. 1B-1F) is similar as that of 3DOM-TiO 2 (Fig. 1A), suggesting that the preparation process of supported bimetallic AuPd nanoparticles via GBMR method has not destroyed the ordered marcoporous structure. The pore sizes of typical AuPd/3DOM-TiO 2 catalysts were further evaluated by means of mercury intrusion porosimetry (MIP) and the results are shown in Fig. 2. The peak value of the curve is corresponded to the diameter of the largest proportion of pores in catalysts.As exhibited in Fig. 2, the distribution of pore sizes in all catalysts is very narrow in the range of 20-250 nm, and the peak value corresponding to the most probable pore diameter is 65 nm in accordance with the results of SEM images.And the porosities, the average pore diameters, the total pore volumes and the pore area of AuPd/3DOM-TiO 2 catalysts analyzed by MIP are listed in Table 1.The pore volumes of 3DOM-TiO 2 and AuPd/3DOM-TiO 2 catalysts are about 2.3 mL g -1 , but the total pore volumes determined by N 2 physisorption are only 0.14 mL g -1 (Table 1), indicating that the macropores are main contribution to the total porosity.The pore diameters of 3DOM-TiO 2 and AuPd/3DOM-TiO 2 catalysts are 200 10 nm, which is in agreement with the value estimated from the SEM images.And the porosities (90) are larger than the theoretical value (74) of sphere volume in FCC array, which may be as a result of the shrinkage of oxide framework in the process of calcination 51.In addition, the surface areas of all catalysts are also summarized in Table 2.The surface areas of 3DOM-TiO 2 and AuPd/3DOM-TiO 2 catalysts are in the range of 59 1 m 2 g -1 . Moreover, according to the result of ICP-AES in Table 2, the weight percent of Au or Pd (Au, Pd) to TiO 2 and the weight ratios of Pd/Au are identical to the theoretical values, suggesting that GBMR method is an effective way to fabricate noble metals-support heterogeneous catalyst. The phase structures of 3DOM-TiO 2 and AuPd/3DOM-TiO 2 catalysts were investigated by means of XRD characterization, and the results are presented in Fig. 3.It is shown that there are seven remarkably diffraction peaks (2) centered at 25.4, 37.9, 48.1, 53.9, 55.2, 62.8 and 75.1 o which can be assigned to the (101), (004), ( 200), (105), ( 211), ( 204) and (215) lattice planes of 3DOM-TiO 2 with the tetragonal phase structure of anatase type (PDF 21-1272).Besides, the two weak diffraction peaks (2) centered at 27.4 and 36.1 o were also observed, which can be indexed to (110) and (101) crystal faces of 3DOM-TiO 2 with the tetragonal phase structure of rutile type (PDF 65-0191).It indicates that the crystal phase structures of anatase and rutile types are coexistent in 3DOM-TiO 2 support, which is similar to the crystal phase structure of commercial P25 (Fig. S2).It is well known that the coexistence of the anatase/rutile crystal phases can form the heterojunction of anatase/rutile phases, which would be helpful for enhancing the separation of photo-generated carriers and the photocatalytic activity.After introduction of supported AuPd NPs, the diffraction peaks belonging to 3DOM-TiO 2 did not changed, and the characteristic diffraction peaks of AuPd NPs were not detected.The above-mentioned results indicate that the sizes or loadings of supported AuPd NPs are smaller than the detection limit of XRD spectra for supported nanoparticles.In addition, the average crystalline sizes of 3DOM-TiO 2 are determined by Scherer equation using the (101) diffraction peak, and the results are shown in Table 2. Their average crystalline sizes are about 20.0 nm.The wall thickness observed from SEM images was about 30 5 nm (Fig. 1), thus, the macroporous wall seem to be composed of 1-3 crystallites. The phase structures of 3DOM-TiO 2 and AuPd/3DOM-TiO 2 catalysts were further confirmed by Raman spectra and the results are shown in Fig. 4. In the case of 3DOM-TiO 2 samples, the four peaks centered at 144, 397, 517, and 638 cm -1 can be attributed to the Raman-active modes of anatase phase with the symmetries of Eg, B1 g, A1 g, and Eg, respectively 54.The peaks appeared at 144 cm -1 is derived from the bending vibration of O-Ti-O bond, while the another three peaks are related to the Ti-O-Ti bending type 55.The weak Raman peaks at 197 cm -1 can be assigned to Raman-active modes of rutile phase.All these peaks reveal the coexistence of two crystal phases' structure in 3DOM TiO 2 , which is in accordance with the results of XRD.After introduction of bimetallic AuPd NPs decorating on the surface of 3DOM-TiO 2 , the Raman spectra are identical to that of 3DOM-TiO 2 support, and the related signals of AuPd NPs were not detected, because of the ultrafine particle size of NPs and the weak Raman scattering of these metals.Thus, based on the above results of XRD and Raman, it could be concluded that the deposition of AuPd NPs on the inner wall of 3DOM TiO 2 oxide makes less impact on the crystalline phase and crystallinity. Fig. 5 displays the TEM and HRTEM images of AuPd/3DOM-TiO 2 catalysts.As shown in Fig. 5A, 5C and 5E, it is observed that the catalysts have the ordered macroporous structure with overlapped pores in accordance with their SEM observation.Moreover, a mass of AuPd NPs are highly dispersed and uniform in size on the surface of 3DOM-TiO 2 (Fig. 5B, 5D and 5F).The uniform size and high dispersion of AuPd NPs may be helpful to increase the interaction between noble metals and TiO 2 support and effectively enhance the separation of photogenerated charges.The size distribution of supported bimetallic AuPd NPs is in the range of 2-6 nm, and the average diameter is about 3.7 0.2 nm via statistical analyses of more than 100 AuPd NPs (Table 2).And one spherical Au 2 Pd 2 NPs supported on the surface of TiO 2 exhibits clearly the lattice fringes with the plane spacing of 0.23 nm in inset of Fig. 5D, which is assigned to FCC(111) crystal faces of AuPd NPs.It indicates that supported AuPd NPs are crystalline, and there is a tight junction between TiO 2 and supported AuPd NPs, which is beneficial to electron transfer from TiO 2 to AuPd NPs.Fig. 6 show the HAADF-STEM and EDS elemental mapping images of Au 3 Pd 1 /3DOM-TiO 2 catalyst.As shown in Fig. 6A, supported Au 3 Pd 1 NPs are homogeneously dispersed on the surface of 3DOM-TiO 2 supports, which is in agreement with the result of TEM images.The structure of supported Au 3 Pd 1 NPs is further observed by means of HAADF-STEM-EDS elemental mapping in Fig. 6B.It obviously exhibits a core-shell structure with two different elemental dispersions which Au element is rich in the core while Pd element is rich in the shell, indicating the formation of the core-shell structural AuPd NPs.Evidently, the Pd shell is coated selectively on the surface of Au NPs to form a Pd-Au-TiO 2 heterostructure nanocrystal on the surface of 3DOM-TiO 2 .During the reduction process of the metal precursor mixed solution, Au core first formed and deposited on the 3DOM-TiO 2 surface, then Pd shell produced and coated on the Au surface.The above-mentioned reduction process in sequence is due to the difference of standard reduction potentials of the HAuCl 4 and PdCl 2 solution.The coreshell-type NPs promote synergistic effects in Au-Pd metals and improve the transfer efficiency of photogenerated electrons and the subsequent photocatalysis 56,57. To observe the electronic states of AuPd NPs, the XPS spectra of Au 4f and Pd 3d regions for Au 4 /3DOM-TiO 2 , Au 3 Pd 1 /3DOM-TiO 2 and Pd 4 /3DOM-TiO 2 catalysts were recorded and the corresponding results are shown in Fig. 7 and Table 3.As shown in Fig. 7A, the bands of binding energies located at 82.6 and 86.3 eV are related to the spin-orbit coupling Au 4f 7/2 and Au 4f 5/2, respectively.Deconvolution of the Au spectra indicates that metallic (Au 0 ) and ionic Au species (Au and Au 3 ) are coexist.For Au 4 /3DOM-TiO 2 catalyst, the surface percent of Au 0 and Au (Au and Au 3 ) species, calculated from the peaks area, are 73.8,26.2, respectively.Moreover, after introduction of Pd species on the surface of Au/3DOM-TiO 2 (Au 3 Pd 1 /3DOM-TiO 2 ), the percent of Au species increase from 26.2 to 31.8.It is deduced that the core-shell structural AuPd NPs can decrease in the d-electron density of the Au atoms.As shown in Fig. 7B, the bands of binding energies corresponding to the spin-orbit coupling Pd 3d 5/2 and Pd 3d 3/2 are located at 334.2 and 339.7 eV, 335.4 and 341.0 eV, 337.0 and 342.4 eV, which are assigned to Pd 0 , Pd 2 and Pd 4 species, respectively.It indicates that both metallic (Pd 0 ) and ionic Pd (Pd : Pd 2 and Pd 4 ) species exist on the surface of 3DOM-TiO 2 .For Pd 4 /3DOM-TiO 2 catalyst, the surface percent of Pd species is 37.8, while the value decreases to 29.0 for Au 3 Pd 1 /3DOM-TiO 2 catalyst.It is associated with the electron transfer from Au 0 to Pd in core-shell structured AuPd NPs, thus, the percent of Au species increase while the value of Pd species decreases.Au and Pd species acting as electron trapping centers of photoexcited TiO 2 under light illumination, and the vectorial electron transfer from Au to Pd can further decrease the recombination rates of photogenerated charges.The chemical state of active metals may be conducive to the photocatalytic activity for the reduction of CO 2 with H 2 O. Fig. 8 shows the UV-Vis optical absorption spectra of 3DOM-TiO 2 and AuPd/3DOM-TiO 2 catalysts.The photoresponse of commercial P25 is limited in UV range due to its wide band gap (3.2 eV).3DOM-TiO 2 support exhibits a wider light absorption region in comparison with the commercial P25, owing to the slow photon effect and multiple scatting of the 3DOM structure.As the light reflection spectra (Fig. 8A-a), the Bragg reflection peak value relative to the photonic stop-band is about 300 nm, and its red-edge centers at about 430 nm, which is overlapped with the electronic absorption band of TiO 2 (420 nm).In other words, the 'red edge' of the photonic band gap for 3DOM-TiO 2 with an average pore size of 200 nm is coupled to the electronic absorption edge of TiO 2 (420 nm).It is well known that the light waves undergo multiple scattering and travel with a strongly reduced group velocity in the closely photonic stop-band edges, which is referred to as slow light 58.It would increase light absorption ability as well as improve photocatalytic activity in theory.Moreover, it is worthy to note that AuPd/3DOM-TiO 2 catalysts extend the photoresponse from ultraviolet to visible region (450-700 nm) and make significant enhancement in absorbance compared with pure 3DOM-TiO 2 , which is assigned to the SPR effect and the photosensitizing effect of supported Au (Pd) NPs.With increasing the weight ratios of Pd/Au, the relative intensity of absorption peak centered at 530 nm decreases, indicating Pd metals selectively deposition on the Au core and formation of core-shell structured AuPd NPs.The band gaps of the semiconductors are closely related to the absorbed wavelength range and play an important role in determining its photo-activity.Therefore, Kubelka-Munk function by the linear equation (h ) 1/2 A(h-E g ) is applied and the results are shown in Fig. 8B, in which , h, , A and E g are the absorption coefficient, Planck constant, light frequency, a constant and band gap energy, respectively 59,60.It indicates that the E g values of AuPd/3DOM-TiO 2 catalyst (about 2.25-2.6 eV) are much smaller than that of 3DOM-TiO 2 supports (2.90 eV).The smaller band gap of semiconductor would extend the light absorption region, and may be as a promising photocatalyst for solar-driven applications. PL emission spectroscopy is frequently used to study the electron-hole recombination in semiconductor 61.The intensity of PL emission spectra can explore the recombination of excited electrons and holes, and the low intensity is accord with the low efficiency of electron-hole recombination.62 In other words, the higher the PL intensity is, the higher recombination is.PL spectra of 3DOM-TiO 2 and AuPd/3DOM-TiO 2 catalysts were carried out using the excitation wavelength ( Ex ) of 380 nm, and the results are shown in Fig. 9.It is observed clearly that the curves were similar with each other except for fluorescence intensity.The emission peak centered at 525 nm is assigned to the emission of electronhole recombination in TiO 2 .The peak intensity of commercial-P25 is highest, indicating that it is easy to the recombination of excited electrons and holes.3DOM-TiO 2 catalyst shows the relatively lower intensity in comparison with commercial-P25, which is related to the photonic stop-band and the slow-light effect of 3DOM material 63,64.In other words, the wavelength of emission spectra is located to near the photonic stop-band edges of 3DOM material, the slow-light effect can considerably increase the effective path length of emission spectra due to the coherent multiple scattering and the low group velocity of the light.Moreover, the peak intensity of AuPd/3DOM-TiO 2 catalysts obviously decreases compared with pure TiO 2 supports, which could be ascribed to the electron transfer from the conduction band of TiO 2 to bimetallic AuPd NPs.It indicates that the multi-coupling heterostructures of TiO 2 -Au-Pd could reduce photo-generated electron-hole recombination by confining electrons in AuPd NPs while excited holes in VB of TiO 2 .Among the catalysts, Au 3 Pd 1 /3DOM-TiO 2 catalyst shows the lowest intensity, thus, the suitable ratios of Au/Pd can efficiently improve the separation efficiency of excited charges and would enhance photocatalytic activity consequently. SPV measurement is another technique to reveal the separation efficiency of photogenerated electron-hole pairs, thus, the SPV spectra of 3DOM-TiO 2 and AuPd/3DOM-TiO 2 catalysts were measured and the results are shown in Fig. 10.The intensity of SPV signal was ascribed to the changes in the surface voltage before and after illumination, and the changes could be modulated by the charge separation 65.The relatively high SPV signal means the high efficiency separation of the photo-generated charge carriers 66.As depicted in Fig. 10, AuPd/3DOM-TiO 2 catalysts show a much higher SPV signal than that of pure 3DOM-TiO 2 support, which is ascribed to the synergistic effect of supported AuPd NPs on the separation efficiency of illumination-induced electrons and holes.Moreover, Au 3 Pd 1 /3DOM-TiO 2 catalyst exhibits the highest SPV response, indicating the best separation efficiency of photoinduced electron-hole pairs, which is in agreement with the results of PL characterization.In the process of light irradiation, the conduction band electrons in TiO 2 are generated and then transferred to AuPd NPs, but the holes left in the valence band of TiO 2 .The electron-sink function of supported AuPd NPs would be beneficial to the charge separation of photoexcited TiO 2 and would enhance photocatalytic activity. It is well known that the transient photocurrent response induced by the incident light can reflect the number of separated charge carriers on the surface of photocatalysts 67.The higher the photocurrent response is, the larger charge carrier number is 68.In order to further illustrate the capability of supported AuPd NPs for promoting separation efficiency of photoinduced electronhole pairs in AuPd/3DOM-TiO 2 photocatalytic system, the transient photocurrent responses under several on/off UV light irradiation cycles were performed, and the results are showed in Fig. 11.The photocurrent increased immediately when the light irradiation turns on, while it rapidly decreased to zero when the light was off.The photocurrent density of 3DOM-TiO 2 support is higher than commercial-P25, indicating the relatively high enrichment degree of photogenerated charges due to the slow light effect of 3DOM structure.Moreover, the transient photocurrent densities of bimetallic AuPd/3DOM-TiO 2 catalysts are higher than those of Au 4 /3DOM-TiO 2 and Pd 4 /3DOM-TiO 2 catalysts, demonstrating that the photoinduced electrons and holes in AuPd/3DOM-TiO 2 catalyts prefer to separate and transfer to surface rapidly.Au 3 Pd 1 /3DOM-TiO 2 catalyst shows the highest photocurrent density, indicating that it has the most effective separation rate of the photoinduced electrons.The weight ratios of Au/Pd can optimize the separation efficiency of photo-induced charges in TiO 2 in consistent well with the results of PL and SPV experiments. In addition, in order to further verify the role of supported AuPd nanoparticles, the experiments of photocurrent response assigned to CO 2 reduction under the negative potential were also carried out and the results are shown in Fig. S3.A clear CO 2 reduction current was detected at the applied potential in aqueous solution under simulated sunlight.It is obviously noted that the photocurrent values decreased to the more negative position under the light irradiation in comparison with those without light.The values of transient photocurrent over bimetallic AuPd/3DOM-TiO 2 catalysts are more negative than those over Au 4 /3DOM-TiO 2 and Pd 4 /3DOM-TiO 2 catalysts, indicating that supported AuPd nanoparticles contribute to the enhancing transfer of electrons under the negative potential.Among the studied catalysts, the photocurrent value of Au 3 Pd 1 /3DOM-TiO 2 catalyst is the most negative, indicating that it has the most effective separation rate of the photoinduced electrons.During several light irradiation cycles, all samples display a relatively stable photocurrent response within several on/off cycles suggesting their good stabilities.All the observations highlight the excellent performance of 3DOM-TiO 2 -supported bimetallic AuPd NPs catalysts for enhancing charge transfers in the photoreduction of CO 2 with H 2 O system. Prior to the activity tests for the photocatalytic reduction of CO 2 , a series of preliminary tests were carried out in the absence of photocatalysts, or light irradiation, or CO 2 gas.Nevertheless, carbonaceous compounds were not observed in all cases.In order to verify the sources of carbon and hydrogen in the products of CO and CH 4 , the analyses of 13 C and 2 H(D) isotopic tracing for the products of photocatalytic 13 C-labeled CO 2 reduction with D 2 O over Au 3 Pd 1 /3DOM-TiO 2 catalyst were carried out by means of GC-MS after 14 h irradiation and the results are shown in Fig. S4.It shows that the peak with m/z of 21 can be recognized as 13 CD 4 , and the peak with m/z of 29 can be attributed to 13 CO.It indicates that the carbon (C) element in the product of CO and CH 4 comes from CO 2 reactant, and the hydrogen (H) element in the product of CH 4 come from H 2 O reactant.Therefore, it is asserted that the reactants of CO 2 and H 2 O are source to photocatalytic products (CO and CH 4 ), and both photocatalysts and light irradiation must be required for the reaction process of photocatalytic CO 2 reduction with H 2 O. The photocatalytic performances of as-prepared catalysts for CO 2 reduction are shown in Fig. 12 and Table 4.The production amount of CO 2 and CH 4 over 3DOM-TiO 2 support is larger than that of commercial P25, which is attributed to the slow photon effect of 3DOM structure for enhancing the light harvesting efficiency.The selectivity of CO production (S CO ) is higher than that of CH 4 production (S CH4 ), suggesting that, the productions derived from CO 2 reduction prefer to formation of CO rather than CH 4 .Supported Au NPs on 3DOM-TiO 2 support can efficiently promote the selective formation of CH 4 and inhibit the CO production, and its S CH4 value is 95.08.After introduction of supported Pd NPs on 3DOM-TiO 2 , the photocatalytic activity for CO 2 reduction with H 2 O is improved obviously, i.e., the total formation rate of CH 4 and CO productions increases from 4.6 to 14.0 mol g -1 h -1 , and its formation rate of CO production is fastest (3.9 mol g -1 h -1 ).Interestingly, AuPd/3DOM-TiO 2 catalysts exhibit a significantly synergistic effect of Au and Pd on enhancing photocatalytic activity for CO 2 reduction.Among the catalysts, Au 3 Pd 1 /3DOM-TiO 2 catalyst exhibits the highest efficiency for formation CH 4 (18.5 mol g -1 h -1 ) and its S CH4 value is 93.91.The formation rate of CH 4 over Au 3 Pd 1 /3DOM-TiO 2 catalyst is about 11, 3, 1.8 times as high as that of 3DOM-TiO 2 , Au 4 /3DOM-TiO 2 and Pd 4 /3DOM-TiO 2 catalysts, respectively.It is attributed to that AuPd NPs can promote electron transfer from TiO 2 to Au-Pd surface due to the lower Fermi level, and the synergistic effect of Au and Pd can enhance the separation efficiency of photogenerated electron-hole pairs.With the decreasing weight ratios of Au/Pd, the formation rate of CH 4 decreases and the evolving rate of CO increases, indicating that the excess deposition of Pd on Au core can suppress the reduction of CO 2 to CH 4 and preferentially accelerate the reduction of CO 2 to CO. For semiconductor-based photocatalytic reaction, the apparent quantum efficiency (AQE) is one of the most important parameters, which represents the conversion efficiency of the incident light to the desired product.In the photoreduction of CO 2 with H 2 O reaction, the quantum efficiency can be calculated based on two electrons used for CO production and eight electrons used for CH 4 molecule and moles of photons input energy over the catalyst surface.As shown in Table 4, the AQE values of the as-prepared catalysts at wavelength of 520 nm were obtained.The AQE value The formation rates, the selectivity of CO and CH4 productions and the apparent quantum efficiency (AQE) for photocatalytic conversion of CO2 with H2O over 3DOM-TiO2 and AuPd/3DOM-TiO2 catalysts. Formation rate mol g of 3DOM TiO 2 (0.05) is higher than that of P25 (0.04), indicating that 3DOM Ti-based catalyst is a high efficiency photocatalytic system for CO 2 reduction and 3DOM structure can obviously improve the light harvesting efficiency.Among the catalysts, the AQE value of Au 3 Pd 1 /3DOM-TiO 2 catalyst is 0.41 which is the largest value of light harvesting efficiency.Therefore, it is concluded that the suitable ratios of Au/Pd on the surface of 3DOM-TiO 2 is beneficial to CO 2 reduction and can enhance the formation rate of CH 4 . Based on the results of AQE values at different wavelength (380, 420, 450, 520 and 600 nm), the action spectrum of Au 3 Pd 1 /3DOM-TiO 2 catalyst was obtained and the result is shown in Fig. 12C.Meanwhile, the UV-Vis DRS spectrum is also presented in Fig. 12C.The AQE value of Au 3 Pd 1 /3DOM-TiO 2 catalyst increases with the increasing of light absorption, and the AQE value at 420 nm is the largest due to the slow photon effect of Au 3 Pd 1 /3DOM-TiO 2 for enhancing the light-harvesting efficiency.The relatively smaller AQE value at 380 nm, compared with at 420 nm, can be attributed to the suppression from the photonic band gap reflection in the light-harvesting efficiency.It is noted that the AQE value at 520 nm has an enhanced effect, which is assigned to the surface plasmon resonance effect of supported AuPd nanoparticles.Therefore, the enhancement in the photocatalytic efficiency of AuPd/3DOM-TiO 2 catalysts under light irradiation could be attributed to the combined action of the slow photon effect and the surface plasmon resonance effect. Moreover, in order to verify the ratiocination, the formation rates of O 2 and H 2 over AuPd/3DOM-TiO 2 catalysts were further evaluated and the results are listed in Table 4.There is no doubt that Au 3 Pd 1 /3DOM-TiO 2 catalyst exhibits the highest formation rate of O 2 (57.6 mol g -1 h -1 ), which is larger than the stoichiometric theoretical amount (46.9 mol g -1 h -1 ) calculated by the formation rates of CH 4 , H 2 and CO.Therefore, some others hydrocarbon products may be theoretically produced but undetected. In order to investigate the stability of Au 3 Pd 1 /3DOM-TiO 2 catalyst, the experiments were repeated for five times under the same reaction condition.As shown in Fig. 13, Au 3 Pd 1 /3DOM-TiO 2 catalyst exhibits no obvious decrease in catalytic activities during five test cycles.Moreover, its macroporous structure and AuPd particle sizes did not changed based on the analysis of SEM (Fig. S5), and TEM (Fig. S6).The circulation experiment verifies the well stability of the photocatalysts of AuPd NPs decorated on 3DOM-TiO 2 . For the semiconductor photocatalysts, their relative positions of conduction band (CB) and valence band (VB) must meet the energy band theory for photoreduction of CO 2 to CO and CH 4 69.The photogenerated electrons can be just consumed when the CB of photocatalyst lies above the reduction potential of CO 2 /CH 4 , CO 2 /CO.The CB potential (E CB ) of TiO 2 is -0.56 V (vs.NHE at pH 7) 70, while the potentials of E (CO 2 /CO) -0.53V and E (CO 2 /CH 4 ) -0.24V are less negative than the E CB of TiO 2 71, thus, the reduction reactions of photoreduction CO 2 with H 2 O to produce CO and CH 4 are theoretically feasible.In fact, the selective formation of CH 4 or CO is the result of the compromise between charge transfer and thermodynamics.The value of E (CO 2 /CH 4 ) is lower than that of E (CO 2 /CO), in other words, the production of CH 4 is thermodynamically more feasible than the generation of CO if the supply of protons and electrons is high enough.However, from the view of charges, the production of one CH 4 molecule requires eight electrons and eight hydrogen protons, while the formation of one CO molecule just requires two electrons and two hydrogen protons.Thus, the production of CO is possible owing to the paucity of excited electrons 51,72,73.But if enough protons and electrons were sufficiently afforded during the photocatalytic process, CH 4 would may be the major reduction product 38,48. The production rates and selectivity of CO and CH 4 in the gaseous product are related to the enrichment degree of electrons and hydrogen protons, which depends on the nanostructure and the surface property of photocatalysts. Based on the results of photocatalytic CO 2 reduction with H 2 O (Fig. 12 and Table 4), AuPd/3DOM-TiO 2 catalysts exhibit super catalytic performances.The enhanced photocatalytic activity for CO 2 reduction with H 2 O can be isolated from the light-harvesting and charge-separation functions of the photocatalysts.For improving the light-harvesting, AuPd/3DOM-TiO 2 catalysts have two aspects.One aspect is attributed to the slow photon effect of 3DOM structure in accord with the results of our previous works 35,38,48,51.The other aspect is the co-catalysts of core-shell structured AuPd NPs which can effectively extend the spectral response from UV to visible region.Based on the results of comparison between UV-Vis DRS and the action spectra of Au 3 Pd 1 /3DOM-TiO 2 catalyst (Fig. 12C), it is noted that the light-harvesting efficiency can be improved by the slow photon effect of 3DOM structure, and supported AuPd nanoparticles can further improve the absorption for visible light due to the surface plasmon resonance.Therefore, AuPd/3DOM-TiO 2 catalysts show the high photocatalytic efficiency under light irradiation. For effective separation efficiency of the photogenerated charge carrier, it is mainly owing to the rapid interfacial charge transfer through the chemical heterostructure interactions and the synergetic effect of TiO 2 and noble metals (Au, Pd).On the one hand, the semiconductor of 3DOM-TiO 2 is excited to produce electron-hole pairs after the absorption of photons.From the results of XRD and Raman analysis (Fig. 3, Fig. 4), the crystal phase structures of anatase and rutile types are coexistent.The heterojunction of anatase/rutile phases would be formed in 3DOM TiO 2 , and the anatase phase of TiO 2 shows the larger band gap (3.2 eV) and 0.1 eV higher Fermi level in comparison with those of rutile phase (3.0 eV) 74,75.Thus, the photo-generated electrons may be transferred from anatase phase to rutile phase and consequently improve the separation efficiency of photo-generated electron-hole pairs.Then, the generated electrons in the CB of 3DOM-TiO 2 flow into Au, i.e., electron transfers from 3DOM-TiO 2 to AuPd.Then the enrichment electrons on the surface of AuPd NPs would be used for CO 2 reduction.The elementary steps of reduction proceeds involve the transfer of an electron, a proton, or hydrogen radical (H ), as well as breaking C O bonds and creating new C H bonds. On the other hand, the photogenerated holes (h ) are left on the VB of TiO 2 semiconductor and are used to oxidize H 2 O and formation of surface-bound hydrogen ions (H ) and O 2 .The mechanistic details for the conversion of CO 2 to CH 4 have not been fully elucidated, but three full pathways, such as the formaldehyde pathway, the carbene pathway and the glyoxal pathway, have been proposed in the literatures 17.For co-catalysts with metal NPs, they are beneficial to facilitating CO 2 activation and improving charge separation for the reduction process.Combined the results of PL spectra (Fig. 9), the surface photovoltage (Fig. 10), the photocurrent action spectra (Fig. 11) and catalytic activity (Fig. 12, Table 4), the Au 3 Pd 1 /3DOM-TiO 2 catalyst shows the lowest recombination efficiency of photoinduced electron-hole pairs and the highest catalytic activity for CO 2 reduction. Based on the discussion above, the mechanism for the photoreduction CO 2 with H 2 O over AuPd/3DOM-TiO 2 catalysts is proposed and vividly shown in Scheme 1. Firstly, under light irradiation, the slow photon effect of 3DOM-TiO 2 sufficiently improves the light-harvesting efficiency.And after deposition AuPd NPs on TiO 2 supports, the absorbance for visible light is further enhanced remarkably due to the SPR and photosensitizing effect.Secondly, the excited electron-hole pairs in TiO 2 are generated after absorbing photons with energy equals to or greater than its bandgap.The coexistence of the anatase/rutile crystal phases in 3DOM TiO 2 can form the heterojunction of anatase/rutile phases, which can improve the separation efficiency of photo-generated electronhole pairs.Then excited electrons transfer to Au NPs because of the different Fermi levels between Au and the CB edge of TiO 2 .And then the vectorial electrons further transfer from Au to Pd, which decreases the recombination rates of photogenerated electron-hole pairs due to the electron trapping role of Au and Pd species and the surface plasmon resonance of Au NPs.In addition, at the interface of AuPd and TiO 2 , the potential gradient established by the Schottky barrier suppresses the generated electrons getting back to TiO 2 once again.But the photogenerated holes are left on the VB of TiO 2 semiconductor.Eventually, the photoinduced electron-hole pairs were effectively separated through this way.And photoreduction of CO 2 and oxidation reaction proceed in loading noble metals and TiO 2 semiconductor separately.Active electrons assemble on AuPd NPs react with the adsorbed CO 2 to form CH 4 or other carbon containing compounds, while photogenerated holes enrich on the VB of TiO 2 and oxidize H 2 O to produce surfacebound hydrogen ions (H ) and O 2 .During photocatalysis process, core-shell structured AuPd NPs not only provides the reduction sites but also serves as the electron sinks, leading to an effective charge separation and enhancement in photocatalytic activity.In a word, AuPd/3DOM-TiO 2 catalysts, which take both advantages of the high light-harvesting efficiency and the excellent separation of photogenerated charge carriers, exhibit superior photocatalytic performance for CO 2 reduction. The novel photocatalysts of bimetallic AuPd NPs decorated 3DOM TiO 2 were fabricated by the GBMR method.AuPd/3DOM-TiO 2 photocatalysts possess well-defined 3DOM structure, and the core-shell structural AuPd NPs with uniform sizes (about 3.7 nm) homogeneously dispersed on the inner wall of carriers.The enhanced photocatalytic activity may originate from the excellent light-harvesting capacity and separation efficiency of photogenerated electrons and holes.The light-harvesting efficiency can be improved by the slow photon effect of 3DOM structural TiO 2 and the surface plasmon resonance of supported Au NPs.Moreover, the vectorial electron transfer of TiO 2 Au Pd induces a more efficient separation of photoinduced charges.AuPd/3DOM-TiO 2 catalysts exhibit excellent photocatalytic activity for CO 2 reduction with H 2 O to CH 4 under light irradiation.The possible mechanism of photocatalytic CO 2 reduction with H 2 O over AuPd/3DOM-TiO 2 catalysts is proposed.Our design and synthetic approach might be a great help in the design of more excellent photocatalysts. Fig. 1.SEM images of 3DOM-TiO2 and AuPd/3DOM-TiO2 catalysts.A. TiO2; B. Au4/3DOM-TiO2; C. Au3Pd1/3DOM-TiO2; D. Au2Pd2/3DOM-TiO2; E. Au1Pd3/3DOM-TiO2; F. Pd4/3DOM-TiO2. Fig. 2. The pore size distributions of typical 3DOM-TiO2 and AuPd/3DOM-TiO2 determined by MIP.a. 3DOM-TiO2; b.Au3Pd1/3DOM-TiO2; c. Au2Pd2/3DOM-TiO2. Fig. 3. XRD patterns of 3DOM-TiO2 and AuPd/3DOM-TiO2catalysts. a. TiO2; b.Au4/3DOM-TiO2; c. Au3Pd1/3DOM-TiO2; d.Au2Pd2/3DOM-TiO2; e. Au1Pd3/3DOM-TiO2; f.Pd4/3DOM-TiO2. Fig. 4. Raman spectra of 3DOM-TiO2 and AuPd/3DOM-TiO2 catalysts.a. TiO2; b.Au4/3DOM-TiO2; c. Au3Pd1/3DOM-TiO2; d.Au2Pd2/3DOM-TiO2; e. Au1Pd3/3DOM-TiO2; f.Pd4/3DOM-TiO2. Fig. 5. TEM and HRTEM images of AuPd nanoparticles of AuPd/3DOM-TiO2 catalysts.The one in HRTEM image of (D) shows an enlarged Au2Pd2 nanoparticles.A-B.Au3Pd1/3DOM-TiO2; C-D.Au2Pd2/3DOM-TiO2; E-F.Au1Pd3/3DOM-TiO2. Fig. 6.HAADF-STEM (A) and EDS elemental mapping (B) images of Au3Pd1/3DOM-TiO2 catalyst.And the model of Au3Pd1 nanoparticle is shown in Fig. B. Fig. 7. XPS of Au 4f (A) and Pd 3d (B) regions of AuPd/3DOM-TiO2 catalysts.a. Au4/3DOM-TiO2; b.Au3Pd1/3DOM-TiO2; c. Pd4/3DOM-TiO2. Fig. 9. PL spectra of 3DOM-TiO2 and AuPd/3DOM-TiO2 catalysts.a. TiO2; b.Au4/3DOM-TiO2; c. Au3Pd1/3DOM-TiO2; d.Au2Pd2/3DOM-TiO2; e. Au1Pd3/3DOM-TiO2; f.Pd4/3DOM-TiO2; g. commercial-P25. Fig. 10.SPV spectra of 3DOM-TiO2 and AuPd/3DOM-TiO2 catalysts.a. TiO2; b.Au4/3DOM-TiO2; c.Au3Pd1/3DOM-TiO2; d.Au2Pd2/3DOM-TiO2; e. Au1Pd3/3DOM-TiO2; f.Pd4/3DOM-TiO2; g. commercial-P25. Fig. 11.Transient photocurrent responses of 3DOM-TiO2 and AuPd/3DOM-TiO2 catalysts.a. TiO2; b.Au4/3DOM-TiO2; c. Au3Pd1/3DOM-TiO2; d.Au2Pd2/3DOM-TiO2; e. Au1Pd3/3DOM-TiO2; f.Pd4/3DOM-TiO2; g. commercial-P25. Fig. 12. Evolutions of CH4 (A) and CO (B) production for photocatalytic conversion of CO2 with H2O over 3DOM-TiO2 and AuPd/3DOM-TiO2 catalysts.And comparison between UV-Vis DRS (Left) and action spectrum (Right) of Au3Pd1/3DOM-TiO2 catalyst (C).a. commercial-P25; b.TiO2; c. Au4/3DOM-TiO2; d.Au3Pd1/3DOM-TiO2; e. Au2Pd2/3DOM-TiO2; f.Au1Pd3/3DOM-TiO2; g.Pd4/3DOM-TiO2. Fig. 13.Stability study on the evolution of CH4 production over Au3Pd1/3DOM-TiO2 catalyst for five test cycles. Scheme 1.The catalytic mechanism for the photoreduction of CO2 with H2O over AuPd/3DOM-TiO2 catalyst. Porosities, average diameters, pore volumes and pore areas of typical 3DOM-TiO2 and AuPd/3DOM-TiO2 catalysts. a Pore volume determined by BET method.bTotalpore volume for pores.cTotalpore area determined by Hg porosimetry.dTheaverage pores diameter.e Determined by Hg porosimetry. The crystal parameters and average crystal sizes of 3DOM-TiO2 and AuPd/3DOM-TiO2 catalysts. a Determined by XRD using Scherrer equation with the intensity of the most prominent peak, (101).b Determined by HRTEM.c Surface area obtained by BET method.d Determined by ICP-AES. Surface compositions and charge states of Au and Pd species derived from XPS analyses. a The Au (Pd ) values are equal to the sum of Au (Pd 2 ) and Au 3 (Pd 4 ). The apparent quantum efficiency with irradiation light of 520 nm. c Not determined.d This work is supported by the National Natural Science Foundation of China (No. 21673142 and 21477164), Beijing Nova Program (No. Z141109001814072), Specialized Research Fund for the Doctoral Program of Higher Education of China (No. 20130007120011). Supplementary data associated with this article can be found, in the online version, at http://dx.doi.org/10.1016/j.apcatb.2017.02.076."
  },
  {
    "title": "Results_and_Discussion",
    "content": "In order to observe the morphology and macroporous structure of AuPd/3DOM-TiO 2 catalysts, SEM observations were carried out.Fig. 1 shows the SEM images of as-prepared catalysts with different weight ratios of Au/Pd obtained via one-pot GBMR method.The catalysts show clearly three-dimensionally highly ordered macroporous structure obtained via replicating of 3D close-packed PMMA template with a face-centered cubic (FCC) array 53.The diameters of periodic voids are in the range of 200 10 nm, which corresponds to shrinkage of 15-20 in comparison with the initial size (250 nm) of PMMA microspheres (Fig. S1).The shrinkage may be caused by the melting of polymer templates and the formation of produced metal oxides.Moreover, the sublayer pores with relatively small sizes (60 10 nm) can be observed clearly and connect the periodic voids, which could be helpful for the reactant diffusion and light harvesting.In addition, the morphology structure of AuPd/3DOM-TiO 2 catalysts (Fig. 1B-1F) is similar as that of 3DOM-TiO 2 (Fig. 1A), suggesting that the preparation process of supported bimetallic AuPd nanoparticles via GBMR method has not destroyed the ordered marcoporous structure. The pore sizes of typical AuPd/3DOM-TiO 2 catalysts were further evaluated by means of mercury intrusion porosimetry (MIP) and the results are shown in Fig. 2. The peak value of the curve is corresponded to the diameter of the largest proportion of pores in catalysts.As exhibited in Fig. 2, the distribution of pore sizes in all catalysts is very narrow in the range of 20-250 nm, and the peak value corresponding to the most probable pore diameter is 65 nm in accordance with the results of SEM images.And the porosities, the average pore diameters, the total pore volumes and the pore area of AuPd/3DOM-TiO 2 catalysts analyzed by MIP are listed in Table 1.The pore volumes of 3DOM-TiO 2 and AuPd/3DOM-TiO 2 catalysts are about 2.3 mL g -1 , but the total pore volumes determined by N 2 physisorption are only 0.14 mL g -1 (Table 1), indicating that the macropores are main contribution to the total porosity.The pore diameters of 3DOM-TiO 2 and AuPd/3DOM-TiO 2 catalysts are 200 10 nm, which is in agreement with the value estimated from the SEM images.And the porosities (90) are larger than the theoretical value (74) of sphere volume in FCC array, which may be as a result of the shrinkage of oxide framework in the process of calcination 51.In addition, the surface areas of all catalysts are also summarized in Table 2.The surface areas of 3DOM-TiO 2 and AuPd/3DOM-TiO 2 catalysts are in the range of 59 1 m 2 g -1 . Moreover, according to the result of ICP-AES in Table 2, the weight percent of Au or Pd (Au, Pd) to TiO 2 and the weight ratios of Pd/Au are identical to the theoretical values, suggesting that GBMR method is an effective way to fabricate noble metals-support heterogeneous catalyst. The phase structures of 3DOM-TiO 2 and AuPd/3DOM-TiO 2 catalysts were investigated by means of XRD characterization, and the results are presented in Fig. 3.It is shown that there are seven remarkably diffraction peaks (2) centered at 25.4, 37.9, 48.1, 53.9, 55.2, 62.8 and 75.1 o which can be assigned to the (101), (004), ( 200), (105), ( 211), ( 204) and (215) lattice planes of 3DOM-TiO 2 with the tetragonal phase structure of anatase type (PDF 21-1272).Besides, the two weak diffraction peaks (2) centered at 27.4 and 36.1 o were also observed, which can be indexed to (110) and (101) crystal faces of 3DOM-TiO 2 with the tetragonal phase structure of rutile type (PDF 65-0191).It indicates that the crystal phase structures of anatase and rutile types are coexistent in 3DOM-TiO 2 support, which is similar to the crystal phase structure of commercial P25 (Fig. S2).It is well known that the coexistence of the anatase/rutile crystal phases can form the heterojunction of anatase/rutile phases, which would be helpful for enhancing the separation of photo-generated carriers and the photocatalytic activity.After introduction of supported AuPd NPs, the diffraction peaks belonging to 3DOM-TiO 2 did not changed, and the characteristic diffraction peaks of AuPd NPs were not detected.The above-mentioned results indicate that the sizes or loadings of supported AuPd NPs are smaller than the detection limit of XRD spectra for supported nanoparticles.In addition, the average crystalline sizes of 3DOM-TiO 2 are determined by Scherer equation using the (101) diffraction peak, and the results are shown in Table 2. Their average crystalline sizes are about 20.0 nm.The wall thickness observed from SEM images was about 30 5 nm (Fig. 1), thus, the macroporous wall seem to be composed of 1-3 crystallites. The phase structures of 3DOM-TiO 2 and AuPd/3DOM-TiO 2 catalysts were further confirmed by Raman spectra and the results are shown in Fig. 4. In the case of 3DOM-TiO 2 samples, the four peaks centered at 144, 397, 517, and 638 cm -1 can be attributed to the Raman-active modes of anatase phase with the symmetries of Eg, B1 g, A1 g, and Eg, respectively 54.The peaks appeared at 144 cm -1 is derived from the bending vibration of O-Ti-O bond, while the another three peaks are related to the Ti-O-Ti bending type 55.The weak Raman peaks at 197 cm -1 can be assigned to Raman-active modes of rutile phase.All these peaks reveal the coexistence of two crystal phases' structure in 3DOM TiO 2 , which is in accordance with the results of XRD.After introduction of bimetallic AuPd NPs decorating on the surface of 3DOM-TiO 2 , the Raman spectra are identical to that of 3DOM-TiO 2 support, and the related signals of AuPd NPs were not detected, because of the ultrafine particle size of NPs and the weak Raman scattering of these metals.Thus, based on the above results of XRD and Raman, it could be concluded that the deposition of AuPd NPs on the inner wall of 3DOM TiO 2 oxide makes less impact on the crystalline phase and crystallinity. Fig. 5 displays the TEM and HRTEM images of AuPd/3DOM-TiO 2 catalysts.As shown in Fig. 5A, 5C and 5E, it is observed that the catalysts have the ordered macroporous structure with overlapped pores in accordance with their SEM observation.Moreover, a mass of AuPd NPs are highly dispersed and uniform in size on the surface of 3DOM-TiO 2 (Fig. 5B, 5D and 5F).The uniform size and high dispersion of AuPd NPs may be helpful to increase the interaction between noble metals and TiO 2 support and effectively enhance the separation of photogenerated charges.The size distribution of supported bimetallic AuPd NPs is in the range of 2-6 nm, and the average diameter is about 3.7 0.2 nm via statistical analyses of more than 100 AuPd NPs (Table 2).And one spherical Au 2 Pd 2 NPs supported on the surface of TiO 2 exhibits clearly the lattice fringes with the plane spacing of 0.23 nm in inset of Fig. 5D, which is assigned to FCC(111) crystal faces of AuPd NPs.It indicates that supported AuPd NPs are crystalline, and there is a tight junction between TiO 2 and supported AuPd NPs, which is beneficial to electron transfer from TiO 2 to AuPd NPs.Fig. 6 show the HAADF-STEM and EDS elemental mapping images of Au 3 Pd 1 /3DOM-TiO 2 catalyst.As shown in Fig. 6A, supported Au 3 Pd 1 NPs are homogeneously dispersed on the surface of 3DOM-TiO 2 supports, which is in agreement with the result of TEM images.The structure of supported Au 3 Pd 1 NPs is further observed by means of HAADF-STEM-EDS elemental mapping in Fig. 6B.It obviously exhibits a core-shell structure with two different elemental dispersions which Au element is rich in the core while Pd element is rich in the shell, indicating the formation of the core-shell structural AuPd NPs.Evidently, the Pd shell is coated selectively on the surface of Au NPs to form a Pd-Au-TiO 2 heterostructure nanocrystal on the surface of 3DOM-TiO 2 .During the reduction process of the metal precursor mixed solution, Au core first formed and deposited on the 3DOM-TiO 2 surface, then Pd shell produced and coated on the Au surface.The above-mentioned reduction process in sequence is due to the difference of standard reduction potentials of the HAuCl 4 and PdCl 2 solution.The coreshell-type NPs promote synergistic effects in Au-Pd metals and improve the transfer efficiency of photogenerated electrons and the subsequent photocatalysis 56,57. To observe the electronic states of AuPd NPs, the XPS spectra of Au 4f and Pd 3d regions for Au 4 /3DOM-TiO 2 , Au 3 Pd 1 /3DOM-TiO 2 and Pd 4 /3DOM-TiO 2 catalysts were recorded and the corresponding results are shown in Fig. 7 and Table 3.As shown in Fig. 7A, the bands of binding energies located at 82.6 and 86.3 eV are related to the spin-orbit coupling Au 4f 7/2 and Au 4f 5/2, respectively.Deconvolution of the Au spectra indicates that metallic (Au 0 ) and ionic Au species (Au and Au 3 ) are coexist.For Au 4 /3DOM-TiO 2 catalyst, the surface percent of Au 0 and Au (Au and Au 3 ) species, calculated from the peaks area, are 73.8,26.2, respectively.Moreover, after introduction of Pd species on the surface of Au/3DOM-TiO 2 (Au 3 Pd 1 /3DOM-TiO 2 ), the percent of Au species increase from 26.2 to 31.8.It is deduced that the core-shell structural AuPd NPs can decrease in the d-electron density of the Au atoms.As shown in Fig. 7B, the bands of binding energies corresponding to the spin-orbit coupling Pd 3d 5/2 and Pd 3d 3/2 are located at 334.2 and 339.7 eV, 335.4 and 341.0 eV, 337.0 and 342.4 eV, which are assigned to Pd 0 , Pd 2 and Pd 4 species, respectively.It indicates that both metallic (Pd 0 ) and ionic Pd (Pd : Pd 2 and Pd 4 ) species exist on the surface of 3DOM-TiO 2 .For Pd 4 /3DOM-TiO 2 catalyst, the surface percent of Pd species is 37.8, while the value decreases to 29.0 for Au 3 Pd 1 /3DOM-TiO 2 catalyst.It is associated with the electron transfer from Au 0 to Pd in core-shell structured AuPd NPs, thus, the percent of Au species increase while the value of Pd species decreases.Au and Pd species acting as electron trapping centers of photoexcited TiO 2 under light illumination, and the vectorial electron transfer from Au to Pd can further decrease the recombination rates of photogenerated charges.The chemical state of active metals may be conducive to the photocatalytic activity for the reduction of CO 2 with H 2 O. Fig. 8 shows the UV-Vis optical absorption spectra of 3DOM-TiO 2 and AuPd/3DOM-TiO 2 catalysts.The photoresponse of commercial P25 is limited in UV range due to its wide band gap (3.2 eV).3DOM-TiO 2 support exhibits a wider light absorption region in comparison with the commercial P25, owing to the slow photon effect and multiple scatting of the 3DOM structure.As the light reflection spectra (Fig. 8A-a), the Bragg reflection peak value relative to the photonic stop-band is about 300 nm, and its red-edge centers at about 430 nm, which is overlapped with the electronic absorption band of TiO 2 (420 nm).In other words, the 'red edge' of the photonic band gap for 3DOM-TiO 2 with an average pore size of 200 nm is coupled to the electronic absorption edge of TiO 2 (420 nm).It is well known that the light waves undergo multiple scattering and travel with a strongly reduced group velocity in the closely photonic stop-band edges, which is referred to as slow light 58.It would increase light absorption ability as well as improve photocatalytic activity in theory.Moreover, it is worthy to note that AuPd/3DOM-TiO 2 catalysts extend the photoresponse from ultraviolet to visible region (450-700 nm) and make significant enhancement in absorbance compared with pure 3DOM-TiO 2 , which is assigned to the SPR effect and the photosensitizing effect of supported Au (Pd) NPs.With increasing the weight ratios of Pd/Au, the relative intensity of absorption peak centered at 530 nm decreases, indicating Pd metals selectively deposition on the Au core and formation of core-shell structured AuPd NPs.The band gaps of the semiconductors are closely related to the absorbed wavelength range and play an important role in determining its photo-activity.Therefore, Kubelka-Munk function by the linear equation (h ) 1/2 A(h-E g ) is applied and the results are shown in Fig. 8B, in which , h, , A and E g are the absorption coefficient, Planck constant, light frequency, a constant and band gap energy, respectively 59,60.It indicates that the E g values of AuPd/3DOM-TiO 2 catalyst (about 2.25-2.6 eV) are much smaller than that of 3DOM-TiO 2 supports (2.90 eV).The smaller band gap of semiconductor would extend the light absorption region, and may be as a promising photocatalyst for solar-driven applications. PL emission spectroscopy is frequently used to study the electron-hole recombination in semiconductor 61.The intensity of PL emission spectra can explore the recombination of excited electrons and holes, and the low intensity is accord with the low efficiency of electron-hole recombination.62 In other words, the higher the PL intensity is, the higher recombination is.PL spectra of 3DOM-TiO 2 and AuPd/3DOM-TiO 2 catalysts were carried out using the excitation wavelength ( Ex ) of 380 nm, and the results are shown in Fig. 9.It is observed clearly that the curves were similar with each other except for fluorescence intensity.The emission peak centered at 525 nm is assigned to the emission of electronhole recombination in TiO 2 .The peak intensity of commercial-P25 is highest, indicating that it is easy to the recombination of excited electrons and holes.3DOM-TiO 2 catalyst shows the relatively lower intensity in comparison with commercial-P25, which is related to the photonic stop-band and the slow-light effect of 3DOM material 63,64.In other words, the wavelength of emission spectra is located to near the photonic stop-band edges of 3DOM material, the slow-light effect can considerably increase the effective path length of emission spectra due to the coherent multiple scattering and the low group velocity of the light.Moreover, the peak intensity of AuPd/3DOM-TiO 2 catalysts obviously decreases compared with pure TiO 2 supports, which could be ascribed to the electron transfer from the conduction band of TiO 2 to bimetallic AuPd NPs.It indicates that the multi-coupling heterostructures of TiO 2 -Au-Pd could reduce photo-generated electron-hole recombination by confining electrons in AuPd NPs while excited holes in VB of TiO 2 .Among the catalysts, Au 3 Pd 1 /3DOM-TiO 2 catalyst shows the lowest intensity, thus, the suitable ratios of Au/Pd can efficiently improve the separation efficiency of excited charges and would enhance photocatalytic activity consequently. SPV measurement is another technique to reveal the separation efficiency of photogenerated electron-hole pairs, thus, the SPV spectra of 3DOM-TiO 2 and AuPd/3DOM-TiO 2 catalysts were measured and the results are shown in Fig. 10.The intensity of SPV signal was ascribed to the changes in the surface voltage before and after illumination, and the changes could be modulated by the charge separation 65.The relatively high SPV signal means the high efficiency separation of the photo-generated charge carriers 66.As depicted in Fig. 10, AuPd/3DOM-TiO 2 catalysts show a much higher SPV signal than that of pure 3DOM-TiO 2 support, which is ascribed to the synergistic effect of supported AuPd NPs on the separation efficiency of illumination-induced electrons and holes.Moreover, Au 3 Pd 1 /3DOM-TiO 2 catalyst exhibits the highest SPV response, indicating the best separation efficiency of photoinduced electron-hole pairs, which is in agreement with the results of PL characterization.In the process of light irradiation, the conduction band electrons in TiO 2 are generated and then transferred to AuPd NPs, but the holes left in the valence band of TiO 2 .The electron-sink function of supported AuPd NPs would be beneficial to the charge separation of photoexcited TiO 2 and would enhance photocatalytic activity. It is well known that the transient photocurrent response induced by the incident light can reflect the number of separated charge carriers on the surface of photocatalysts 67.The higher the photocurrent response is, the larger charge carrier number is 68.In order to further illustrate the capability of supported AuPd NPs for promoting separation efficiency of photoinduced electronhole pairs in AuPd/3DOM-TiO 2 photocatalytic system, the transient photocurrent responses under several on/off UV light irradiation cycles were performed, and the results are showed in Fig. 11.The photocurrent increased immediately when the light irradiation turns on, while it rapidly decreased to zero when the light was off.The photocurrent density of 3DOM-TiO 2 support is higher than commercial-P25, indicating the relatively high enrichment degree of photogenerated charges due to the slow light effect of 3DOM structure.Moreover, the transient photocurrent densities of bimetallic AuPd/3DOM-TiO 2 catalysts are higher than those of Au 4 /3DOM-TiO 2 and Pd 4 /3DOM-TiO 2 catalysts, demonstrating that the photoinduced electrons and holes in AuPd/3DOM-TiO 2 catalyts prefer to separate and transfer to surface rapidly.Au 3 Pd 1 /3DOM-TiO 2 catalyst shows the highest photocurrent density, indicating that it has the most effective separation rate of the photoinduced electrons.The weight ratios of Au/Pd can optimize the separation efficiency of photo-induced charges in TiO 2 in consistent well with the results of PL and SPV experiments. In addition, in order to further verify the role of supported AuPd nanoparticles, the experiments of photocurrent response assigned to CO 2 reduction under the negative potential were also carried out and the results are shown in Fig. S3.A clear CO 2 reduction current was detected at the applied potential in aqueous solution under simulated sunlight.It is obviously noted that the photocurrent values decreased to the more negative position under the light irradiation in comparison with those without light.The values of transient photocurrent over bimetallic AuPd/3DOM-TiO 2 catalysts are more negative than those over Au 4 /3DOM-TiO 2 and Pd 4 /3DOM-TiO 2 catalysts, indicating that supported AuPd nanoparticles contribute to the enhancing transfer of electrons under the negative potential.Among the studied catalysts, the photocurrent value of Au 3 Pd 1 /3DOM-TiO 2 catalyst is the most negative, indicating that it has the most effective separation rate of the photoinduced electrons.During several light irradiation cycles, all samples display a relatively stable photocurrent response within several on/off cycles suggesting their good stabilities.All the observations highlight the excellent performance of 3DOM-TiO 2 -supported bimetallic AuPd NPs catalysts for enhancing charge transfers in the photoreduction of CO 2 with H 2 O system. Prior to the activity tests for the photocatalytic reduction of CO 2 , a series of preliminary tests were carried out in the absence of photocatalysts, or light irradiation, or CO 2 gas.Nevertheless, carbonaceous compounds were not observed in all cases.In order to verify the sources of carbon and hydrogen in the products of CO and CH 4 , the analyses of 13 C and 2 H(D) isotopic tracing for the products of photocatalytic 13 C-labeled CO 2 reduction with D 2 O over Au 3 Pd 1 /3DOM-TiO 2 catalyst were carried out by means of GC-MS after 14 h irradiation and the results are shown in Fig. S4.It shows that the peak with m/z of 21 can be recognized as 13 CD 4 , and the peak with m/z of 29 can be attributed to 13 CO.It indicates that the carbon (C) element in the product of CO and CH 4 comes from CO 2 reactant, and the hydrogen (H) element in the product of CH 4 come from H 2 O reactant.Therefore, it is asserted that the reactants of CO 2 and H 2 O are source to photocatalytic products (CO and CH 4 ), and both photocatalysts and light irradiation must be required for the reaction process of photocatalytic CO 2 reduction with H 2 O. The photocatalytic performances of as-prepared catalysts for CO 2 reduction are shown in Fig. 12 and Table 4.The production amount of CO 2 and CH 4 over 3DOM-TiO 2 support is larger than that of commercial P25, which is attributed to the slow photon effect of 3DOM structure for enhancing the light harvesting efficiency.The selectivity of CO production (S CO ) is higher than that of CH 4 production (S CH4 ), suggesting that, the productions derived from CO 2 reduction prefer to formation of CO rather than CH 4 .Supported Au NPs on 3DOM-TiO 2 support can efficiently promote the selective formation of CH 4 and inhibit the CO production, and its S CH4 value is 95.08.After introduction of supported Pd NPs on 3DOM-TiO 2 , the photocatalytic activity for CO 2 reduction with H 2 O is improved obviously, i.e., the total formation rate of CH 4 and CO productions increases from 4.6 to 14.0 mol g -1 h -1 , and its formation rate of CO production is fastest (3.9 mol g -1 h -1 ).Interestingly, AuPd/3DOM-TiO 2 catalysts exhibit a significantly synergistic effect of Au and Pd on enhancing photocatalytic activity for CO 2 reduction.Among the catalysts, Au 3 Pd 1 /3DOM-TiO 2 catalyst exhibits the highest efficiency for formation CH 4 (18.5 mol g -1 h -1 ) and its S CH4 value is 93.91.The formation rate of CH 4 over Au 3 Pd 1 /3DOM-TiO 2 catalyst is about 11, 3, 1.8 times as high as that of 3DOM-TiO 2 , Au 4 /3DOM-TiO 2 and Pd 4 /3DOM-TiO 2 catalysts, respectively.It is attributed to that AuPd NPs can promote electron transfer from TiO 2 to Au-Pd surface due to the lower Fermi level, and the synergistic effect of Au and Pd can enhance the separation efficiency of photogenerated electron-hole pairs.With the decreasing weight ratios of Au/Pd, the formation rate of CH 4 decreases and the evolving rate of CO increases, indicating that the excess deposition of Pd on Au core can suppress the reduction of CO 2 to CH 4 and preferentially accelerate the reduction of CO 2 to CO. For semiconductor-based photocatalytic reaction, the apparent quantum efficiency (AQE) is one of the most important parameters, which represents the conversion efficiency of the incident light to the desired product.In the photoreduction of CO 2 with H 2 O reaction, the quantum efficiency can be calculated based on two electrons used for CO production and eight electrons used for CH 4 molecule and moles of photons input energy over the catalyst surface.As shown in Table 4, the AQE values of the as-prepared catalysts at wavelength of 520 nm were obtained.The AQE value The formation rates, the selectivity of CO and CH4 productions and the apparent quantum efficiency (AQE) for photocatalytic conversion of CO2 with H2O over 3DOM-TiO2 and AuPd/3DOM-TiO2 catalysts. Formation rate mol g of 3DOM TiO 2 (0.05) is higher than that of P25 (0.04), indicating that 3DOM Ti-based catalyst is a high efficiency photocatalytic system for CO 2 reduction and 3DOM structure can obviously improve the light harvesting efficiency.Among the catalysts, the AQE value of Au 3 Pd 1 /3DOM-TiO 2 catalyst is 0.41 which is the largest value of light harvesting efficiency.Therefore, it is concluded that the suitable ratios of Au/Pd on the surface of 3DOM-TiO 2 is beneficial to CO 2 reduction and can enhance the formation rate of CH 4 . Based on the results of AQE values at different wavelength (380, 420, 450, 520 and 600 nm), the action spectrum of Au 3 Pd 1 /3DOM-TiO 2 catalyst was obtained and the result is shown in Fig. 12C.Meanwhile, the UV-Vis DRS spectrum is also presented in Fig. 12C.The AQE value of Au 3 Pd 1 /3DOM-TiO 2 catalyst increases with the increasing of light absorption, and the AQE value at 420 nm is the largest due to the slow photon effect of Au 3 Pd 1 /3DOM-TiO 2 for enhancing the light-harvesting efficiency.The relatively smaller AQE value at 380 nm, compared with at 420 nm, can be attributed to the suppression from the photonic band gap reflection in the light-harvesting efficiency.It is noted that the AQE value at 520 nm has an enhanced effect, which is assigned to the surface plasmon resonance effect of supported AuPd nanoparticles.Therefore, the enhancement in the photocatalytic efficiency of AuPd/3DOM-TiO 2 catalysts under light irradiation could be attributed to the combined action of the slow photon effect and the surface plasmon resonance effect. Moreover, in order to verify the ratiocination, the formation rates of O 2 and H 2 over AuPd/3DOM-TiO 2 catalysts were further evaluated and the results are listed in Table 4.There is no doubt that Au 3 Pd 1 /3DOM-TiO 2 catalyst exhibits the highest formation rate of O 2 (57.6 mol g -1 h -1 ), which is larger than the stoichiometric theoretical amount (46.9 mol g -1 h -1 ) calculated by the formation rates of CH 4 , H 2 and CO.Therefore, some others hydrocarbon products may be theoretically produced but undetected. In order to investigate the stability of Au 3 Pd 1 /3DOM-TiO 2 catalyst, the experiments were repeated for five times under the same reaction condition.As shown in Fig. 13, Au 3 Pd 1 /3DOM-TiO 2 catalyst exhibits no obvious decrease in catalytic activities during five test cycles.Moreover, its macroporous structure and AuPd particle sizes did not changed based on the analysis of SEM (Fig. S5), and TEM (Fig. S6).The circulation experiment verifies the well stability of the photocatalysts of AuPd NPs decorated on 3DOM-TiO 2 . For the semiconductor photocatalysts, their relative positions of conduction band (CB) and valence band (VB) must meet the energy band theory for photoreduction of CO 2 to CO and CH 4 69.The photogenerated electrons can be just consumed when the CB of photocatalyst lies above the reduction potential of CO 2 /CH 4 , CO 2 /CO.The CB potential (E CB ) of TiO 2 is -0.56 V (vs.NHE at pH 7) 70, while the potentials of E (CO 2 /CO) -0.53V and E (CO 2 /CH 4 ) -0.24V are less negative than the E CB of TiO 2 71, thus, the reduction reactions of photoreduction CO 2 with H 2 O to produce CO and CH 4 are theoretically feasible.In fact, the selective formation of CH 4 or CO is the result of the compromise between charge transfer and thermodynamics.The value of E (CO 2 /CH 4 ) is lower than that of E (CO 2 /CO), in other words, the production of CH 4 is thermodynamically more feasible than the generation of CO if the supply of protons and electrons is high enough.However, from the view of charges, the production of one CH 4 molecule requires eight electrons and eight hydrogen protons, while the formation of one CO molecule just requires two electrons and two hydrogen protons.Thus, the production of CO is possible owing to the paucity of excited electrons 51,72,73.But if enough protons and electrons were sufficiently afforded during the photocatalytic process, CH 4 would may be the major reduction product 38,48. The production rates and selectivity of CO and CH 4 in the gaseous product are related to the enrichment degree of electrons and hydrogen protons, which depends on the nanostructure and the surface property of photocatalysts. Based on the results of photocatalytic CO 2 reduction with H 2 O (Fig. 12 and Table 4), AuPd/3DOM-TiO 2 catalysts exhibit super catalytic performances.The enhanced photocatalytic activity for CO 2 reduction with H 2 O can be isolated from the light-harvesting and charge-separation functions of the photocatalysts.For improving the light-harvesting, AuPd/3DOM-TiO 2 catalysts have two aspects.One aspect is attributed to the slow photon effect of 3DOM structure in accord with the results of our previous works 35,38,48,51.The other aspect is the co-catalysts of core-shell structured AuPd NPs which can effectively extend the spectral response from UV to visible region.Based on the results of comparison between UV-Vis DRS and the action spectra of Au 3 Pd 1 /3DOM-TiO 2 catalyst (Fig. 12C), it is noted that the light-harvesting efficiency can be improved by the slow photon effect of 3DOM structure, and supported AuPd nanoparticles can further improve the absorption for visible light due to the surface plasmon resonance.Therefore, AuPd/3DOM-TiO 2 catalysts show the high photocatalytic efficiency under light irradiation. For effective separation efficiency of the photogenerated charge carrier, it is mainly owing to the rapid interfacial charge transfer through the chemical heterostructure interactions and the synergetic effect of TiO 2 and noble metals (Au, Pd).On the one hand, the semiconductor of 3DOM-TiO 2 is excited to produce electron-hole pairs after the absorption of photons.From the results of XRD and Raman analysis (Fig. 3, Fig. 4), the crystal phase structures of anatase and rutile types are coexistent.The heterojunction of anatase/rutile phases would be formed in 3DOM TiO 2 , and the anatase phase of TiO 2 shows the larger band gap (3.2 eV) and 0.1 eV higher Fermi level in comparison with those of rutile phase (3.0 eV) 74,75.Thus, the photo-generated electrons may be transferred from anatase phase to rutile phase and consequently improve the separation efficiency of photo-generated electron-hole pairs.Then, the generated electrons in the CB of 3DOM-TiO 2 flow into Au, i.e., electron transfers from 3DOM-TiO 2 to AuPd.Then the enrichment electrons on the surface of AuPd NPs would be used for CO 2 reduction.The elementary steps of reduction proceeds involve the transfer of an electron, a proton, or hydrogen radical (H ), as well as breaking C O bonds and creating new C H bonds. On the other hand, the photogenerated holes (h ) are left on the VB of TiO 2 semiconductor and are used to oxidize H 2 O and formation of surface-bound hydrogen ions (H ) and O 2 .The mechanistic details for the conversion of CO 2 to CH 4 have not been fully elucidated, but three full pathways, such as the formaldehyde pathway, the carbene pathway and the glyoxal pathway, have been proposed in the literatures 17.For co-catalysts with metal NPs, they are beneficial to facilitating CO 2 activation and improving charge separation for the reduction process.Combined the results of PL spectra (Fig. 9), the surface photovoltage (Fig. 10), the photocurrent action spectra (Fig. 11) and catalytic activity (Fig. 12, Table 4), the Au 3 Pd 1 /3DOM-TiO 2 catalyst shows the lowest recombination efficiency of photoinduced electron-hole pairs and the highest catalytic activity for CO 2 reduction. Based on the discussion above, the mechanism for the photoreduction CO 2 with H 2 O over AuPd/3DOM-TiO 2 catalysts is proposed and vividly shown in Scheme 1. Firstly, under light irradiation, the slow photon effect of 3DOM-TiO 2 sufficiently improves the light-harvesting efficiency.And after deposition AuPd NPs on TiO 2 supports, the absorbance for visible light is further enhanced remarkably due to the SPR and photosensitizing effect.Secondly, the excited electron-hole pairs in TiO 2 are generated after absorbing photons with energy equals to or greater than its bandgap.The coexistence of the anatase/rutile crystal phases in 3DOM TiO 2 can form the heterojunction of anatase/rutile phases, which can improve the separation efficiency of photo-generated electronhole pairs.Then excited electrons transfer to Au NPs because of the different Fermi levels between Au and the CB edge of TiO 2 .And then the vectorial electrons further transfer from Au to Pd, which decreases the recombination rates of photogenerated electron-hole pairs due to the electron trapping role of Au and Pd species and the surface plasmon resonance of Au NPs.In addition, at the interface of AuPd and TiO 2 , the potential gradient established by the Schottky barrier suppresses the generated electrons getting back to TiO 2 once again.But the photogenerated holes are left on the VB of TiO 2 semiconductor.Eventually, the photoinduced electron-hole pairs were effectively separated through this way.And photoreduction of CO 2 and oxidation reaction proceed in loading noble metals and TiO 2 semiconductor separately.Active electrons assemble on AuPd NPs react with the adsorbed CO 2 to form CH 4 or other carbon containing compounds, while photogenerated holes enrich on the VB of TiO 2 and oxidize H 2 O to produce surfacebound hydrogen ions (H ) and O 2 .During photocatalysis process, core-shell structured AuPd NPs not only provides the reduction sites but also serves as the electron sinks, leading to an effective charge separation and enhancement in photocatalytic activity.In a word, AuPd/3DOM-TiO 2 catalysts, which take both advantages of the high light-harvesting efficiency and the excellent separation of photogenerated charge carriers, exhibit superior photocatalytic performance for CO 2 reduction."
  },
  {
    "title": "Conclusions",
    "content": "The novel photocatalysts of bimetallic AuPd NPs decorated 3DOM TiO 2 were fabricated by the GBMR method.AuPd/3DOM-TiO 2 photocatalysts possess well-defined 3DOM structure, and the core-shell structural AuPd NPs with uniform sizes (about 3.7 nm) homogeneously dispersed on the inner wall of carriers.The enhanced photocatalytic activity may originate from the excellent light-harvesting capacity and separation efficiency of photogenerated electrons and holes.The light-harvesting efficiency can be improved by the slow photon effect of 3DOM structural TiO 2 and the surface plasmon resonance of supported Au NPs.Moreover, the vectorial electron transfer of TiO 2 Au Pd induces a more efficient separation of photoinduced charges.AuPd/3DOM-TiO 2 catalysts exhibit excellent photocatalytic activity for CO 2 reduction with H 2 O to CH 4 under light irradiation.The possible mechanism of photocatalytic CO 2 reduction with H 2 O over AuPd/3DOM-TiO 2 catalysts is proposed.Our design and synthetic approach might be a great help in the design of more excellent photocatalysts. Fig. 1.SEM images of 3DOM-TiO2 and AuPd/3DOM-TiO2 catalysts.A. TiO2; B. Au4/3DOM-TiO2; C. Au3Pd1/3DOM-TiO2; D. Au2Pd2/3DOM-TiO2; E. Au1Pd3/3DOM-TiO2; F. Pd4/3DOM-TiO2. Fig. 2. The pore size distributions of typical 3DOM-TiO2 and AuPd/3DOM-TiO2 determined by MIP.a. 3DOM-TiO2; b.Au3Pd1/3DOM-TiO2; c. Au2Pd2/3DOM-TiO2. Fig. 3. XRD patterns of 3DOM-TiO2 and AuPd/3DOM-TiO2catalysts. a. TiO2; b.Au4/3DOM-TiO2; c. Au3Pd1/3DOM-TiO2; d.Au2Pd2/3DOM-TiO2; e. Au1Pd3/3DOM-TiO2; f.Pd4/3DOM-TiO2. Fig. 4. Raman spectra of 3DOM-TiO2 and AuPd/3DOM-TiO2 catalysts.a. TiO2; b.Au4/3DOM-TiO2; c. Au3Pd1/3DOM-TiO2; d.Au2Pd2/3DOM-TiO2; e. Au1Pd3/3DOM-TiO2; f.Pd4/3DOM-TiO2. Fig. 5. TEM and HRTEM images of AuPd nanoparticles of AuPd/3DOM-TiO2 catalysts.The one in HRTEM image of (D) shows an enlarged Au2Pd2 nanoparticles.A-B.Au3Pd1/3DOM-TiO2; C-D.Au2Pd2/3DOM-TiO2; E-F.Au1Pd3/3DOM-TiO2. Fig. 6.HAADF-STEM (A) and EDS elemental mapping (B) images of Au3Pd1/3DOM-TiO2 catalyst.And the model of Au3Pd1 nanoparticle is shown in Fig. B. Fig. 7. XPS of Au 4f (A) and Pd 3d (B) regions of AuPd/3DOM-TiO2 catalysts.a. Au4/3DOM-TiO2; b.Au3Pd1/3DOM-TiO2; c. Pd4/3DOM-TiO2. Fig. 9. PL spectra of 3DOM-TiO2 and AuPd/3DOM-TiO2 catalysts.a. TiO2; b.Au4/3DOM-TiO2; c. Au3Pd1/3DOM-TiO2; d.Au2Pd2/3DOM-TiO2; e. Au1Pd3/3DOM-TiO2; f.Pd4/3DOM-TiO2; g. commercial-P25. Fig. 10.SPV spectra of 3DOM-TiO2 and AuPd/3DOM-TiO2 catalysts.a. TiO2; b.Au4/3DOM-TiO2; c.Au3Pd1/3DOM-TiO2; d.Au2Pd2/3DOM-TiO2; e. Au1Pd3/3DOM-TiO2; f.Pd4/3DOM-TiO2; g. commercial-P25. Fig. 11.Transient photocurrent responses of 3DOM-TiO2 and AuPd/3DOM-TiO2 catalysts.a. TiO2; b.Au4/3DOM-TiO2; c. Au3Pd1/3DOM-TiO2; d.Au2Pd2/3DOM-TiO2; e. Au1Pd3/3DOM-TiO2; f.Pd4/3DOM-TiO2; g. commercial-P25. Fig. 12. Evolutions of CH4 (A) and CO (B) production for photocatalytic conversion of CO2 with H2O over 3DOM-TiO2 and AuPd/3DOM-TiO2 catalysts.And comparison between UV-Vis DRS (Left) and action spectrum (Right) of Au3Pd1/3DOM-TiO2 catalyst (C).a. commercial-P25; b.TiO2; c. Au4/3DOM-TiO2; d.Au3Pd1/3DOM-TiO2; e. Au2Pd2/3DOM-TiO2; f.Au1Pd3/3DOM-TiO2; g.Pd4/3DOM-TiO2. Fig. 13.Stability study on the evolution of CH4 production over Au3Pd1/3DOM-TiO2 catalyst for five test cycles. Scheme 1.The catalytic mechanism for the photoreduction of CO2 with H2O over AuPd/3DOM-TiO2 catalyst. Porosities, average diameters, pore volumes and pore areas of typical 3DOM-TiO2 and AuPd/3DOM-TiO2 catalysts. a Pore volume determined by BET method.bTotalpore volume for pores.cTotalpore area determined by Hg porosimetry.dTheaverage pores diameter.e Determined by Hg porosimetry. The crystal parameters and average crystal sizes of 3DOM-TiO2 and AuPd/3DOM-TiO2 catalysts. a Determined by XRD using Scherrer equation with the intensity of the most prominent peak, (101).b Determined by HRTEM.c Surface area obtained by BET method.d Determined by ICP-AES. Surface compositions and charge states of Au and Pd species derived from XPS analyses. a The Au (Pd ) values are equal to the sum of Au (Pd 2 ) and Au 3 (Pd 4 ). The apparent quantum efficiency with irradiation light of 520 nm. c Not determined.d This work is supported by the National Natural Science Foundation of China (No. 21673142 and 21477164), Beijing Nova Program (No. Z141109001814072), Specialized Research Fund for the Doctoral Program of Higher Education of China (No. 20130007120011). Supplementary data associated with this article can be found, in the online version, at http://dx.doi.org/10.1016/j.apcatb.2017.02.076."
  }
]