[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2017.07.024"
  },
  {
    "title": "Article_Title",
    "content": "Improved charge separation and surface activation via boron-doped layered polyhedron SrTiO3 for co-catalyst free photocatalytic CO2 conversion"
  },
  {
    "title": "Abstract",
    "content": "Boron-doped layered polyhedron SrTiO3 has successfully been prepared by solid-state method using specific TiB2 precursor and exhibits excellent photocatalytic CO2 reduction activity due to the improve light absorption, charge separation and surface activation from B doping. Highlights1. Boron-doped layered polyhedron SrTiO3 was prepared and utilized for co-catalyst free photocatalytic CO2 Conversion. 2. It was 3-times higher for the photocatalytic activity for CO2 conversion over the amount optimized borondoped layered polyhedron STO than that of bare STO nanoparticles.3. The boron doping was proven to effectively enhance the charge separation by .OH radicals test, surface photovoltage responses and photoelectrochemical measurements.4. Importantly, the enhanced CO2 surface adsorption and catalytic performance of boron-doped SrTiO3 was verified by CO2-TPD and electrochemical CO2 reduction experiments."
  },
  {
    "title": "Experimental",
    "content": "Material Synthesis.Strontium carbonate (SrCO3; AR) was obtained from sinopharm chemical reagent and Ti(OC4H9)4 was purchased from Kermel chemical reagent.Titanium boride (TiB2; AR) was supplied by Xiya reagent.All the chemicals were of analytical grade and used asreceived without further purification.For the synthesis of SrTiO3 nanoparticles, 33 in a typical experiment, 0.74 g of SrCO3 and 1.7 ml of Ti(OC4H9)4 were dissolved in 10ml absolute ethanol. At the same time, 5 drops of concentrated hydrochloric acid were added to it to prevent the hydrolysis.Then the solution was mechanically milled with a planetary ball milling apparatus at 150 runs min -1 for 3h.Subsequently, the obtained product was collected by constant temperature heating blender, washed with ethanol, and dried in air at 80 C.Finally the dry white powder was annealed in air at 1100 C (temp ramp 2 C min -1 ) for 2 h to obtain the phase purity SrTiO3 nanoparticles and denoted as STO. For the synthesis of B-doped STO sample, in a typical process, 0.74 g SrCO3, 0.02 g TiB2 and 1.66 ml Ti(OC4H9)4 were dissolved in 10 ml of absolute ethanol.At the same time, 5 drops of concentrated hydrochloric acid were added to it to prevent the hydrolysis.The rest of the procedure was the same as above.Thus, the theoretical 10 mol boron doping of STO sample was obtained.For comparison, different mole percentage (i.e. 10, 20 and 30 ) of B-doped STO samples were prepared under identical conditions and denoted as B-STO-X (X10, 20 and 30). Characterization.The XRD patterns of the material were characterized with the help of a Bruker D8 Advance X-ray diffractometer equipped with a graphite monochromatized Cu K radiation ( 1.541874A).The size and morphology of the final products were investigated by scanning electron microscopy (SEM, Hitachi, S-4800) and Transmission electron microscopy (TEM, JEOL, JEM-2100).UV-vis absorption spectra were obtained with the help of a UV-vis spectrophotometer (Shimadzu UV-2550, Tokyo, Japan).The specific surface area was determined according to the Brunauer-Emmett-Teller (BET) method using a Tristar II 3020 surface area and porosity analyzer (micromeritics).X-ray Photoelectron Spectroscopy (XPS) analysis were carried out using a Kratos-AXIS ULTRA DLD apparatus with Al (Mono) X-ray source, and the binding energies of the samples were calibrated with respect to the signal for adventitious carbon (binding energy 284.6 eV). Photoelectrochemical measurements.For the synthesis of thin film electrodes, conductive fluorine-doped tin oxide (FTO)-coated glasses were used as substrates.Prior to use, the FTO glasses were washed with deionized water under sonication for 30 min and then washed with ethanol followed by deionized water and finally annealed at 450C for 30 min.The corresponding pastes for the samples were prepared as follows: 0.1 g of the resulting sample powder was dispersed in 1ml of isopropyl alcohol under vigorous stirring, and then 0.05 g of Macrogol-2000 was added to the mixture, followed by an ultrasonic treatment for 10min and then kept under vigorous stirring for 30 min.Finally, 0.15 ml of acetyl acetone was added to it, and the mixture was kept under continuous stirring for 7 days.The films were prepared by a doctor blade method, and Scotch tape was used as the spacer.After dried naturally, the film was annealed at 450C for 30 min and then cooled to room temperature.Finally, the film was cut into 1.0 1.5 cm 2 pieces.The working geometric surface area of the samples film was 1 cm 1 cm.Photoelectrochemical (PEC) experiments were performed in a quartz cell using a 500 W xenon light with a stabilized current power supply as the illumination source and 1 M NaOH solution was used a as an electrolyte.The as-prepared films were used as working electrodes illuminated from the FTO glass side, whose illumination area was about 11 cm 2 .A platinum plate (99.9) was used as the counter electrode, and a saturated KCl Ag/AgCl electrode (SSE) was used as the reference electrode.All the potentials in this work were referred to SSE at 298K, and applied potentials were controlled by a commercial computer-controlled potentiostat (AUTOLAB PG STAT 101).High-purity N2 gas was employed to bubble through the electrolyte before the experiments.For comparison, the related current was also measured in the dark.TPD studies were performed using a CHEMBET-3000 (Quantachrome, U.S.A.) instrument in the temperature range of 313-1073 K. Evaluation of photocatalytic activities for CO2 reduction.In the photocatalytic reduction of CO2, for each experiment, 0.2 g of powder sample was dispersed in 2 ml of water contained in a 100 ml volume of cylindrical steel reactor with area 3.5 cm 2 .A 300 W Xenon arc lamp was used as the light source for photocatalytic reaction.High purity CO2 gas was passed from the water and followed into the reaction setup to reach the ambient pressure.The used photocatalyst was allowed to equilibrate in the CO2/H2O system for 1 hour.During the irradiation, about 0.5ml of the produced gas was taken from the reaction cell at given time interval for the concentration analysis of main products such as CO and CH4 using a gas chromatograph (GC-2014 with TCD detector; Shimadzu Corp, Japan and GC-7900, FID). Hydroxyl radical measurement.To detect the amount of hydroxyl radical produced, coumarin fluorescent method was used.In coumarin fluorescent method, 0.02 g powder was dispersed in 50 mL coumarin aqueous solution (0.001 M) in a beaker.Prior to irradiation, the reactor was magnetically stirred for 10 min to attain an adsorption-desorption equilibrium.After irradiation for 1 h with a 150 W GYZ220 high-pressure Xenon lamp (made in China), the sample was centrifuged, and then a certain volume of solution was transferred into a Pyrex glass cell for the fluorescence measurement of 7-hydroxycoumarinat 332 nm excitation wavelength with an emission wavelength at 456 nm through a spectrofluorometer (Perkin-Elmer LS55)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The phase purity of the as-prepared STO and B-STO-X (X10, 20 and 30) samples were studied by powder X-ray diffractometer (XRD).From Fig. 1, it is clear that the corresponding peaks at 222.8, 32.5, 40, 46.6, 52.4,57.9, 69.9 and 77.4 are ascribed to the cubic phase of perovskite-type SrTiO3 (JCPDS 84-0443).The strong peaks imply high crystallinity of the product.Despite the solid state method, nanomaterials with high crystallinity could be prepared, and the impurity is often introduced as well.It is found that rutile TiO2 phase (JCPDS 78-1510) appeared at 227.5 (the main diffraction peak of rutile) for all samples due to the associated impurities produced under high temperature treatment. 34In addition, the intensity of rutile phase TiO2 in the XRD patterns gradually become strong with the increase of TiB2 amount, as shown in Figure S1. The morphology of photocatalysts is significant because it is relative to the light absorption and charge separation.To investigate the morphology of STO and B-STO-20 samples, SEM images were taken as shown in Figure 2. It is clear that the STO particles exhibit irregular shapes with nanometric sizes and the average diameters ranges from 500-1500 nm (Figure 2A,B). However, after doping B, the irregular particles have been changed to uniform ones as shown in Figure S2 and Figure 2C.Among them, B-STO-20 sample possesses the optimal morphology and is consistent with polyhedron hexagonal prisms structure.The particles size distribution is from 500 to 800 nm.In addition, the layered structure of polyhedron STO particles could be seen from the high resolution SEM image of the broken ones as shown in Figure 2d.It is inferred that the polyhedron STO is assembled by hexagonal nanosheets. It has been previously reported that TiB2 play a bifunctional role of B-doping and morphology turning. 32When TiB2 is annealed at high temperature, B would diffuse from bulk to surface, and replace O of the TiO6 lattice, then locate on the surface of STO and favors the assemble of these nanosheets to polyhedron.To verify this, FT-IR spectra of STO and B-STO-X samples were measured and shown in Figure S3.Compared with the FT-IR spectrum of STO, two extra bands at 1100 and 1370 cm -1 are observed in all B-STO-X.The band at ca. 1370 cm -1 can be ascribed to the presence of tri-coordinated interstitial B, which tends to interact with ambient O atoms and exhibits a chemical environment similar to that of normal Ti-O-B. 35The peak at 1100 cm -1 can be attributed to the stretching vibrations of the B-O bonds.The B-O bond formed as a result of interaction between interstitial B and its neighbor O.In brief, the aforediscussed FT-IR results reveal that some B species in the B-doped STO are present as interstitial B, nevertheless, the existence of O-substituted B may not be ruled out. To further investigate the layered structure of the polyhedron STO, TEM and HRTEM images were taken.The TEM image of B-STO-20 gives the evidence of the layered STO accumulated into polyhedron, proven by the hexagonal nanosheet-like fragment could be observed from shows that the lattice fringes with d-spacing 0.18 nm correspond to the (110) plane of the cubic phase STO.The diffraction spots from selected area electron diffraction (SAED) patterns (as inset in Figure 3B) clearly demonstrate that the B-STO-20 sample is single crystalline.The single crystal structure usually has very few defects that favor charge transfer and separation. From the structural characterization of the samples, it can be learned that the morphology of the as-prepared nanoparticles changed to hexagonal polyhedron with layered structure when TiB2 is utilized to prepare B doped STO.Moreover, the as-prepared B-doped STO is monocrystal which is similar to other materials obtained by solid state method.For perovskite photocatalysts, the morphology and crystallinity is much important for photoactivities.The B-doped STO is believed to be a promising material for photocatalytic CO2 reduction. The composition and elemental chemical states of STO and B-STO-X samples were investigated by X-ray photoelectron spectroscopy (XPS).The general XPS survey spectra in Figure S5, clearly indicates the existence of Ti, Sr and O elements in all the samples as well as B in the B-doped STO.In order to clarify the chemical environment of different elements, high resolution XPS spectra are shown in Figure 4. Figure 4A clearly demonstrates that the binding energy at 132.74 eV correspond to the Sr 3d which is in accordance with the previous works about perovskite STO, and the binding energy at 134.47 eV can be attributed to Sr-O complexes. 36From high-resolution spectrum of Ti 2p (Figure 4B), it is obvious that binding energy of B-STO sample is shifted toward lower energy side as compared to that of STO.It is supposed that the blue shift in the binding energy of Ti 2p is induced by the B-doping which can reduce the Ti 4 to Ti 3 state.The XPS spectra of O 1s (Figure 4C), show two small peaks, the peak centered at 529.56 eV is attributed to lattice oxygen of STO, while the other centered at 531.78 eV is related to the surface adsorbed oxygen, resulting from the carbonates and hydroxyl oxides. As for B-STO samples, it is clear that the binding energy of O 1s is slightly shifted toward low energy side compared to the STO, suggesting that B is successfully incorporated in the crystal lattice of STO and substituted O atoms.As expected, the B 1s peak at 192 eV (Figure 4D) is attributed to the B-O bonds in the B-STO-10, B-STO-20 and B-STO-30 samples, and consistent with the FT-IR results. 37These results suggest that B-doping has a great influence on the O sites as compared to the Ti sites, which is considered the evidence of Sr site substitution.Moreover, the real atomic percentage of B element in the B-doped SrTiO3 samples is confirmed by XPS as well.As shown in Figure 4E, the atomic percent of B in B-STO-10, B-STO-20 and B-STO-30 are 1.1, 5.9 and 6.1, respectively.It can be learned from XPS and the other structural characterization that different contents B-doped polyhedron layered STO perovskite are prepared.However, it is shown that the amount of B doping could not be accurately controlled through the TiB2 based solid-state method. Figure 5 shows the UV-vis absorption spectra of STO and B-STO-X samples.Compared to the STO, the B-doped samples display enhanced light absorption in visible-light region, implying the surface doping of boron.This surface doping may result from the diffusion of B from bulk to the surface after annealing, as reported previously. 23Interestingly, after B-doping the B-STO samples exhibit extended visible-light absorption from 420 to 700 nm (inset of Figure 5).This enhancement in the light absorption is believed to have positive effect on the photocatalytic activities of the samples.For a crystalline semiconductor, the optical absorption near the band edge follows the equation ah A(h-Eg) n/2 , where a, , Eg and A are the absorption coefficient, the light frequency, the bandgap and a constant, respectively.Among them, n decides the characteristics of the transition in a semiconductor. 8The bandgaps of STO, B-STO-10, B-STO-20, and B-STO-30 are calculated to be about 3.19, 3.18, 3.07 and 3.06 eV from the onset of the absorption edge (Figure S6).The band gap narrowing of B-STO-20 and B-STO-30 samples may result from the increase in amount of rutile TiO2 impurities which is in good agreement with the XRD results. Thermodynamically, the conduction band of STO is negative enough to reduce CO2 into CH4, CO and so on.The co-catalyst free photoactivities of the as-prepared samples for CO2 reduction are shown in Figure 6A.Compared with the STO, the co-catalyst free photocatalytic activities of B-doped samples for CO2 conversion to CO and CH4 are remarkably enhanced.The production rate of CO is 8, 14, 21 and 16 molh -1 g -1 and the yield of CH4 is up to 5, 8, 14, and 11 molh - 1 g -1 for STO, B-STO-10, B-STO-20 and B-STO-30, respectively.Remarkably, O2 as the oxydic product of water is found to 15, 25, 35 and 27 molh -1 g -1 for STO, B-STO-10, B-STO-20 and B-STO-30, respectively.That means, according to the conservation of positive (for producing O2 with 4 holes) and negative electron (for producing CO with 2 electrons and CH4 with 8 electrons), some other products like methanol or formaldehyde may exist in the system. 38,39rther, the organic products of methanol and formaldehyde are qualitatively detected by GC-MS, as shown in Figure S7, supporting the above assumption.Interestingly, the amount optimized B-STO-20 sample exhibits nearly three times enhanced activity as compared to that of STO.In addition, the apparent quantum efficiency (AQE) is 1.34 for B-STO-20, along with 0.53 for STO at 365nm.However, there is no AQE for STO while 0.53 for B-STO-20 at 420nm, suggesting that a proper B doping can improve the visible light absorption.It is worth noting that the amount of CO and CH4 produced over B-doped STO without any co-catalyst in this work is superior as compared to some related works, as shown in Table S1.These results indicate that B-doping has a positive effect on the photocatalytic activity of STO for CO2 reduction.Once CO2 was replaced with N2, the evolution of CO and CH4 was also not observed, thus the suspected CO and CH4 from surroundings and surface adsorption of photocatalysts are excluded.To further confirm the source of the produced CH4, we carried out an isotopic experiment using 13 CO2 under the identical photocatalytic reaction conditions.The photocatalytic evolution of CH4 was analyzed by gas chromatography mass (GC-MS), of which the peak m/z 17 is assigned to 13 CH4 and the fragment ion of 13 CH4 is seen as well as shown in Figure S8.In addition, the stability of STO and B-STO-X samples are investigated by five times run recycles, each time washing the samples with water and absolute ethanol and then drying at 100 C.It can be seen that after five successive recycles, the B-doped samples exhibit good stability for photocatalytic CO2 reduction as shown in Figure 6B andC. There are many effects that cause the enhanced activity of B-doped STO, including surface area, charge transfer and separation and so on.In order to verify the surface area, N2 absorption and desorption isotherms of STO and B-STO-X samples were measured as shown in Figure S9. The surface area of the resultant STO photocatalyst obtained via solid state synthesis is very small because of the high temperature treatment.However, the surface area is remarkably increased after B-doping even if the B content is 30, which may be attributed to the its broken morphology.This is in accordance with the SEM images that the morphology changed after Bdoping.The nearly three times enhanced surface area may result in the improved CO2 adsorption over the photocatalyst surface, which favors the surface catalyzing reactions. Charge separation is the main affecting factor for the activity of photocatalysts. 40The produced hydroxyl radicals (OH) during the photocatalytic process can also reflect the photogenerated charge separation. 41Herein, the coumarin fluorescent method is used to detect the amount of OH produced.In coumarin fluorescent method, the coumarin could easily react with OH to produce luminescent 7-hydroxy-coumarin.As shown in Figure 7A, B-STO-20 exhibits the strongest fluorescent response, demonstrating that charge separation is significantly improved after doping a proper amount of boron.Photoluminescence (PL) emission spectrum originating from the recombination of free charge carriers, usually serves as a good candidate for the characterization of heterostructures, indicating the process of photogenerated charge separation, migration, and transfer. 42"
  },
  {
    "title": "Conclusions",
    "content": "In summary, boron doped layered polyhedron SrTiO3 nanoparticles have successfully been prepared through solid-state method using TiB2 as boron and titanium source.The SEM, TEM and photocatalytic CO2 reduction performance reveal that a proper content of B-doping is effective to promote the activity of STO.B-STO-20 sample is found to be the optimal one that is capable of producing 14 and 21 mol/h -1 g -1 of CH4 and CO, respectively.It is clearly demonstrated that B-doping is effective to promote the charge separation and improve the surface CO2 fixation, activation and catalysis of SrTiO3 for efficient co-catalyst free photocatalytic CO2 reduction.This work would help us to deeply understand the photophysical processes, and provide feasible routes to further improve the photocatalytic performance of nanosized oxide semiconductors for CO2 reduction. Yan from Academy of Quality Inspection and Research of Heilongjiang Province, China, for the help of testing and analyzing the products in liquid phase. as confirmed by means of fluorescence emission spectra related to produced .OH radicals, surface photovoltage responses and photoelectrochemical measurements; and the enhanced CO2 surface adsorption and catalytic performance of boron-doped SrTiO3 as verified by CO2-TPD and electrochemical CO2 reduction experiments.This work implies that boron-doped layered polyhedron SrTiO3 would display promising applications in the photocatalytic field of CO2 conversion to solar fuels.KEYWORDS: Charge Separation; Surface absorption; Photocatalytic CO2 Conversion; Boron doped Layered polyhedron SrTiO3; Co-catalyst Free Figure3Aof which may come from the edge of polyhedron just like the selected area in Figure Figure7Bclearly indicates that the PL intensity of STO is relatively higher, which means fast recombination of photogenerated charge carriers.However, the PL intensities of B-STO-X samples are obviously decreased after B-doping and the lowest PL signal is observed for the amount optimized B-STO-20 sample.This is in good accordance with the fluorescence results suggesting that charge separation is significantly improved.Furthermore, photoelectrochemical experiments were performed to further prove the enhanced charge separation of B-STO-X samples.Steady-state surface photovoltage spectroscopy (SS-SPS) is an effective technique to reveal the photogenerated charge separation.From Figure7C, it is clear that SS-SPS response of STO is greatly enhanced after B-doping, especially for the optimal B-STO-20 sample, suggesting that charge separation is significantly improved.This means that the B doping increases the electrostatic potential difference that boosts the internal electric field of STO.The red shift of B-doped STO samples is in good agreement with UV-vis absorption results.The EIS Nyquist plot in Figure7Ddisplays a semicircle at high frequency represents the charge-transfer process, and the diameter of the semicircle reflects the charge-transfer resistance.It is clearly demonstrated that the diameters of the semicircle for B-STO-20 are much smaller than those of STO, B-STO-10 and B-STO-30, implying that a proper amount of B doping could promote the electron mobility by reducing the electron-hole pair recombination of STO and favor charge transportation and separation.This is further supported by the Mott-Schottky curves analysis as shown in FigureS10.All the samples reveal a positive slope in the Mott-Schottky plots, as expected for the n-type semiconductor, demonstrating that the B-doping doesn't change the property of STO.In addition, the carrier density (Nd) can be calculated from the slope of the Mott-Schottky plot using the following equation:43 Figure 8B.It is clear that the cathodic currents of B-STO-X especially for B-STO-20 one is Fig.1 XRD patterns of SrTiO3 prepared with different B doping: STO, B-STO-10, B-STO-20, Fig. 2 SEM images (A, B) of STO and (C, D) of B-STO-20 samples. Fig. 3 TEM and HRTEM images (A, B) of B-STO-20 and the inset of B shows selected area Fig. 4 XPS spectra of Ti 2p, O 1s, Sr 3d, B 1s (A-D), and (E) the relative B atomic percent given Fig. 5 UV-vis absorption spectra of the STO and B-STO-X samples, the inset shows the local Fig.6The production rates of CH4 during the photocatalytic CO2 reduction with H2O on STO, Fig. 7 Fluorescence spectra related to the produced hydroxyl radicals (A) and PL intensity peaks Fig. 2 Fig. 3 Fig. 5 Fig. 6 Fig. 7 Fig. 8"
  }
]