[
  {
    "title": "Doi",
    "content": "10.1016/j.cattod.2018.11.005"
  },
  {
    "title": "Article_Title",
    "content": "Light irradiation enhanced CO2 reduction with methane: A case study in size-dependent optical property of Ni nanoparticles"
  },
  {
    "title": "Abstract",
    "content": "Ni/Al 2 O 3 catalysts and bulk Ni nanoparticles, with the average sizes of Ni particles varying from 2.7 nm to 238.0 nm, were synthesized and evaluated in CO 2 photoreduction with methane (CRM).It was found that the catalytic activities of the Ni-based catalysts were all increased almost linearly with light intensity in the range of 0-1.07 W cm -2 , with the optical properties of Niparticles being regarded to account for the activity enhancement.Wavelength dependent performance study suggested that Ni LSPR dominated for the optical property of smaller Ni nanoparticles whereas interband transition played gradually increased role in improving the activities over larger Ni particles.To the best of our knowledge, it is the first time to study the size-dependent optical properties of Ni nanoparticles, meanwhile, this study offers a foundation to further improve the efficiency of Ni-based catalysts in CO 2 utilizations."
  },
  {
    "title": "Experimental",
    "content": "The crystalline structures of the support Al 2 O 3 and Ni-based catalysts were analyzed by X-ray diff ;raction (XRD) method, on an X-Pert diffractometer equipped with graphite monochromatized Cu-K radiation.The specific surface areas were determined with a surface area analyzer (BEL Sorp-II mini, BEL Japan Co., Japan) by the Brunauer-Emmett-Teller (BET) method.The morphology and the sizes of Ni particles were observed on transmission electron microscope JEM-2100 (JEOL Ltd, Japan).The diffuse reflection spectra of the catalysts were measured by UV-vis spectrophotometer (UV-2600, SHIMADZU Co., Japan) from 200 nm to 1400 nm.The contents of Ni on the catalysts were analyzed by inductively coupled plasma optical emission spectrometry (ICP-OES, SPS3520UV-DD, SII nano technology Inc., Japan).The successful loading of Ni on Al 2 O 3 supports were identified by X-ray photoelectron spectroscopy (XPS, PHI Quantera SXM, ULVAC-PHI Inc., Japan). CRM reaction was conducted in a fixed-bed flow type reactor under atmospheric pressure shown in Scheme 1.A 0.050 g portion of catalyst without dilution was packed uniformly in the alumina cell.Both TC-1000 temperature controller (Jacso) and LA-251Xe lamp (Hayashi) with HA30 filter were employed to provide the energy input.Light with desired wavelength was generated by LA-251Xe lamp (Hayashi), filtered by a set of cut-off filters and introduced to the system via a quartz window just above the alumina cellcontaining the catalysts.CH 4 and CO 2 with the molar ratio of 1/1 were introduced into the reactor at a total flowrate of 20.0 mL/min (STP).The effluent gases were analyzed off-line by injection method on two separate gas chromatographies (GC).H 2 was analyzed on GC-8 A, Shimadzu Co., Japan, while CO, CO 2 and CH 4 were analyzed on GC-14B, Shimadzu Co., Japan.The flowrate of the effluent gas was measured with a flowmeter. The plasmonic absorption spectra of Ni particles on Ni/Al 2 O 3 catalysts were simulated by Mie theory, and the average diameters of Ni particles obtained from TEM and XRD analysis was used for simulation.The dielectric constant for Ni was taken from the report by Johnson and Christy 24, and the actual reaction atmosphere that Ni particles were mainly enclosed by gaseous reactant CO 2 and CH 4 was also taken into consideration."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The crystalline structures of the Ni/Al 2 O 3 catalysts and metallic Ni particle were characterized by XRD (Fig. 1a).The diffraction peaks attributed to the support -Al 2 O 3 could be observed from the XRD profiles of all the Ni/Al 2 O 3 catalysts, whereas the peak centered at 44.7a nd attributed to Ni could only be detected over Ni/Al 2 O 3 catalysts with higher Ni loadings (Ni contents higher than 5.0 wt).The observed Ni diffraction peaks in XRD patterns, as well as the Ni XPS analysis in Fig. S1, it indicated that Ni was successfully loaded on support Al 2 O 3 .The actual Ni loadings were analyzed by ICP-OES method, and they were found to close to the theoretical values (Table 1).The specific surface areas of the catalysts decreased with Ni loadings, and the more Ni loading the severe decrease of the specific surface areas of the catalysts (Fig. S2 and Table 1).The sizes of Ni particles over these catalysts were calculated via Scherrer equation through the diffraction peak of Ni at 44.7, and listed in Table 1.Clearly, the size of Ni particles increased gradually with Ni loadings, from quite small size (smaller than 3.0 nm, because no diffraction peaks attributed to Ni were observed) over 1Ni/ Al 2 O 3 to 35.1 nm over 40Ni/Al 2 O 3 and even 230.0nm over bulk Ni Scheme 1. Photograph of CRM reactionevaluation system.particles, which were consistent with those obtained from TEM images (Fig. 1b-g and Table 1).Fig. 1h revealed the increase trend of Ni particle sizes with the increase of Ni loadings. The catalytic performances of the Ni/Al 2 O 3 catalysts and bulk Ni particles in CRM were evaluated with or without light introduction, and the results are available in Fig. 2 and Fig. S3Fig.S9.Clearly, the Ni/ Al 2 O 3 catalysts and bulk Ni particles were all active in CRM under thermal-driven condition, with the initial catalytic activities almost in the reverse ratio of the sizes of Ni particles (Fig. S10).This is reasonable, since the larger the Ni particle sizes, the less amount of available Ni active sites 25,26.Meanwhile, it's noticeable that the catalytic activities of Ni/Al 2 O 3 catalysts were further enhanced after the introduction of extra solar light irradiation (300 nm 800 nm, 0-1.07 W cm -2 , Fig. 2 and Fig. S9), whereas no obviously enhanced activity was observed over bulk Ni particles with further light introduction.The slope of activity enhancement over a specific catalyst serves as an indicator for the capacity of the catalyst to respond to light and accelerate the reaction rate, then in this sense, it could be speculated that smaller particle sizes of Ni particles possess stronger capacity in absorbing light and enhancing the catalyst activity. Reaction conditions: 550 C, CH 4 /CO 2 1, flowrate 20.0 mL/min, 0.050 g catalyst, with and without light introduction. What's more, CO 2 conversion rates were always slightly higher than those of CH 4 due to the side reaction between CO 2 and product H 2 (CO 2 hydrogenation reaction and reverse water gas shift reaction) 272829.Additionally, the selectivities to H 2 and CO, and the mass balances were all close to 100, which lead to the similar increase trend of H 2 and CO yields to those of CH 4 and CO 2 conversions (Fig. 2 and Fig. S9). When light was irradiated onto catalyst surface, two kinds of reaction might occur, (1) the catalyst is responsive to the irradiated light and photocatalytic reactions could occur, and (2) light irradiation could lead to the local temperature increase of catalyst surface and the temperature increase might be high enough to initiate thermal-driven catalytic reactions.Here, to discover the actual reasons for the enhanced performance of Ni/Al 2 O 3 and the nearly uninfluenced performance over bulk Ni particles in CRM with light irradiation, catalyst-bed temperatures weremonitored carefully.It is found that without extra heat supply, temperature increases were indeed observed with light irradiation (Fig. S11).However, the reaction temperature remained stable at 550 C (Fig. S12), even with light being introduced tothe thermal-driven catalytic system.The reason for the uninfluenced temperature was that in the case with more intensive light being introduced, the energy from heater was less supplied and compensated to the system.Then it could be proposed that in the light assisted thermaldriven reaction system,the reaction temperature was well controlled and it was not photo-induced temperature increase that enhanced the performances of Ni/Al 2 O 3 catalysts.Previous studies on adopting Nibased catalysts in photo-involved reactions suggested that the optical property of Ni particles accounted for the activity enhancements 16,17. From the UV-vis spectra shown in Fig. 3a, it is clear over the Ni/ ), the absorption edge assigned to Al 2 O 3 could not beobserved (Fig. S13 and Fig. S14), and the reason was probably that the black Ni particles dispersed on the outmost surface of support Al 2 O 3 severely hindered light transmission.Over 40Ni/Al 2 O 3 catalyst, the absorption edge pertaining to Al 2 O 3 could be viewed, which was likely resulted from the partial penetration of light to Al 2 O 3 through the relatively wide Ni-Ni particle distance (Fig. 1).Again, only the absorption peak assigned to Ni was observed over bulk Ni (the purity of Ni is 99.5).What's more, broad peaks centered at 459 nm was observed over 1Ni/Al 2 O 3 , 5Ni/Al 2 O 3 , 10Ni/ Al 2 O 3 catalysts, which was reported to attribute to the typical absorption of metallic Ni 16,17.The absorption peak of Ni gradually shifted to higher wavelength (up to 879 nm) with the increase of Ni loadings (Fig. 3a and Table 1). To find out the reasons for the enhanced performance over Ni/Al 2 O 3 catalysts with light irradiation, several sets of cut-off filters were adopted to obtain the desired wavelength (Fig. 3b and Table S1), and the wavelength-dependent performance of these catalysts was evaluated (Fig. 3c-h).Obviously, the activities of the Ni/Al 2 O 3 catalysts were all more or less enhanced with the introduction of light of various regions (Table S2).Controlled experiments indicated that the enhanced activity of Ni/Al 2 O 3 with light irradiation was not due to support Al 2 O 3 (Table S3).Then it could be proposed that the enhanced performance was related with the properties of Ni under light irradiation.By roughly assuming the center of the introduced light and calculating the number of photons and apparent quantum efficiency (AQE, Table S1 and Table S2), a wavelength-dependent performance was obtained (Fig. 3c-h). For the catalysts 1Ni/Al 2 O 3 , 5Ni/Al 2 O 3 , 10Ni/Al 2 O 3 and 20Ni/ Al 2 O 3 (Fig. 3c-f), the AQE values exhibited similar trends with the Ni plasmonic absorption simulated by Mie theory, which suggested that it was plasmonic Ni that was primarily responsible for the enhanced performance of these catalysts under light irradiation.For 40Ni/Al 2 O 3 (Fig. 3g), the AQE values followed the trend of simulated Ni plasmonic absorption in the wavelength range of 450-800 nm, which evidenced the participation of Ni plasmonic property in the activity enhancements over 40Ni/Al 2 O 3 catalyst.Meanwhile, obviously high AQE values were obtained in the range of 300-450 nm, which revealed that Ni interband transition accounted for the activity enhancements over 40Ni/Al 2 O 3 catalyst in this wavelength range.For bulk Ni, both the characterized and simulated Ni plasmonic absorption peaks were centered at 879 nm, which are out of the range of the introduced light in this study (300 nm 800 nm).The AQE values obtained over the bulk Ni particles were rather low and could be negligible, and it suggested that the interband transition of Ni over the bulk Ni particles were quite weak and did not lead to the obviously enhanced activity in CRM with light irradiation (300 nm 800 nm). Correlating the sizes of the Ni particles over the catalysts and the optical property of these catalysts, it could be concluded that Ni LSPR dominated for the activity enhancement over the catalysts with smaller Ni nanoparticles ( 17.2 nm, the catalysts include 1Ni/Al 2 O 3 , 5Ni/ Al 2 O 3 ,10Ni/Al 2 O 3 and 20Ni/Al 2 O 3 ,) whereas interband transition played gradually increased role in improving the activities over larger Ni particles ( 33.5 nm, such as 40Ni/Al 2 O 3 and bulk Ni particles).What's more, the optical property of Ni particles became quite weak and negligible over the catalysts with extremely large Ni particles (200 nm, bulk Ni particle catalyst)."
  },
  {
    "title": "Conclusions",
    "content": "In summary, low-cost Ni/Al 2 O 3 catalysts and bulk Ni particles, with varied average Ni particle sizes, were prepared and employed in CRM reaction.With light introduction, Ni could serve both as active sites and plasmonic promoter, and was responsible for the activity enhancement.The sizes of Ni particles affected the optical property and the subsequent photothermal catalytic performance of the Ni-based catalysts in CRM.Ni LSPR dominates the optical property of Ni particles of small sizes, and interband transition accounts higher percentage of the optical Catalyst preparation Reagents Ni(NO 3 ) 2 6H 2 O, metallic Ni and Al 2 O 3 were purchased from Wako pure chemical industries Ltd and used as received.Ni/Al 2 O 3 catalysts with varied Ni loadings were prepared by wetness impregnation method.A portion of Al 2 O 3 support was added into the Ni(NO 3 ) 2 6H 2 O aqueous solution with a fixed amount of Ni (NO 3 ) 2 6H 2 O, stirred for 10 h and then evaporated, dried and calcined at 550 C for 5 h.The obtained samples were named as xNiO/Al 2 O 3 , with x representing the theoretical Ni loadings.After reducing in H 2 /Ar at 900 C for 1 h, the samples were transformed into the reduced catalysts xNi/Al 2 O 3 . Fig. 1.(a) XRD patterns of support Al 2 O 3 , Ni/Al 2 O 3 catalysts and bulk Ni, (b)-(g), TEM images of 1Ni/Al 2 O 3 , 5Ni/Al 2 O 3 , 10Ni/Al 2 O 3 , 20Ni/Al 2 O 3 , 40Ni/Al 2 O 3 and bulk Ni, respectively, with the size distributions of Ni nanoparticles (marked by purple circles) as insets, and (h) the relationship between Ni loadings and Ni particle sizes (The XRD patterns of 5Ni/Al 2 O 3 , 10Ni/Al 2 O 3 and 20Ni/Al 2 O 3 were cited from reference 16).(For interpretation of the references to colour in this figure legend, the reader is referred to the web version of this article). Fig. 2. Catalytic performances of Ni/Al 2 O 3 catalysts and bulk Ni particles in CRM with different light intensity being introduced, (a) CH 4 conversion, (b) CO 2 conversion, (c) H 2 yield and (d) CO yield. Fig. 3. a) UV-vis spectra of the Ni/Al 2 O 3 catalysts and bulk Ni particles, (b) desired light wavelength ranges obtained by a set of cut-off filters, (c)-(h), the simulated Ni plasmonic absorption spectra and AQE values over 1Ni/Al 2 O 3 , 5Ni/Al 2 O 3 ,10Ni/Al 2 O 3 , 20Ni/Al 2 O 3 , 40Ni/Al 2 O 3 and bulk Ni particles, respectively (The UV-vis spectra of 5Ni/Al 2 O 3 , 10Ni/Al 2 O 3 and 20Ni/Al 2 O 3 , spectra of the light source obtained with different filter sets, and Fig.3ewere cited from reference16). Physicochemical properties of support Al 2 O 3 and Ni/Al 2 O 3 catalysts.Al 2 O 3 catalysts with Ni loadings less than 17.3 wt (including 1Ni/ Al 2 O 3 , 5Ni/Al 2 O 3 , 10Ni/Al 2 O 3 and 20Ni/Al 2 O 3 Samples S BET (m 2 g -1 ) a Ni loading (wt.) b Ni size (nm) c Ni size (nm) d a obtained by N 2 adsorption-desorption method through Brunauer-Emmett-Teller (BET) equation.b analyzed by ICP-OES method.c calculated via Scherrer equation through the Ni diffraction peak at 44.7.d obtained from the TEM images. This work received financial support from the World Premier International Research Center Initiative (WPI Initiative) on Materials"
  }
]