[
  {
    "title": "Doi",
    "content": "10.1016/j.jcis.2022.01.065"
  },
  {
    "title": "Article_Title",
    "content": "Cadmium-sulfide/gold/graphitic-carbon-nitride sandwich heterojunction photocatalyst with regulated electron transfer for boosting carbon-dioxide reduction to hydrocarbon"
  },
  {
    "title": "Abstract",
    "content": "h i g h l i g h t sCdS/Au/g-C 3 N 4 sandwich heterojunctions were synthesized by photodeposition.The photoinduced charge transfer was rationally regulated by the heterojunction.The heterojunction photocatalyst showed superior performance for CO 2 reduction.The photocatalytic mechanism was investigated by in situ spectroscopic analyses."
  },
  {
    "title": "Experimental",
    "content": "Urea (CH 4 N 2 O, 99), cadmium acetate dihydrate (Cd(Ac) 2 A2H 2 O, analytical reagent), sulfur powder (99), chloroauric acid trihydrate (HAuCl 4 A3H 2 O, 99), thiourea (CH 4 N 2 S, analytical reagent), sodium sulfate anhydrous (Na 2 SO 4 , !99.0), ethanol (CH 3 CH 2 OH, !99.7), CO 2 gas (!99.999), nitrogen gas (N 2 , !99.999) and argon gas (Ar, !99.999) were purchased from Shanghai Aladdin Biochemical Technology Co., LTD and used without further purification.Deionized water (DI water) is homemade in the lab.The pristine g-C 3 N 4 was synthesized by thermal polymerization of urea at 550 C in air for 4 h.Then, the g-C 3 N 4 nanosheet suspension was acquired by 2 h ultrasonic treatment of the pristine g-C 3 N 4 (30 mg) in DI-water (30 mL).Subsequently, the Au/g-C 3 N 4 sample was prepared by photodepositing Au NPs on g-C 3 N 4 nanosheets.Specifically, 155 lL HAuCl 4 aqueous solution (0.01 mol/L) was injected into the g-C 3 N 4 nanosheet suspension, which was stirred in dark for 30 min and then exposed to the irradiation (k 420 nm) with an optical power density of 150 mWAcm A2 for 30 min.Afterwards, the precipitate was separated from the solution by high-speed centrifugation, washed by DIwater, and dried at 60 C in vacuum.The Au(x)/g-C 3 N 4 photocatalysts with varied theoretical Au contents (x wt.) were prepared by changing HAuCl 4 dosage for the photodeposition of Au NPs. Based on the optimization of Au content, the CdS/Au/g-C 3 N 4 heterojunction photocatalyst was prepared by further photodepositing CdS on the optimal Au/g-C 3 N 4 heterostructures.Typically, Cd(CH 3 COO) 2 A2H 2 O (40 mg), sulfur powder (10 mg), and the Au/g-C 3 N 4 sample (30 mg) were dispersed in 30 mL ethanol to form a suspension.The suspension was kept in Ar atmosphere and exposed to the visible light irradiation for 1 h with continuous stirring.After the photodepostion, the solid product was collected by high-speed centrifugation, washed by ethanol and DI-water, and dried at 60 C in vacuum.For comparison, the CdS(w 1 , w 2 )/Au (1.0)/g-C 3 N 4 photocatalysts with different CdS contents were prepared by the photodeposition of CdS on the optimal Au(1.0)/g-C 3 N 4 sample, where w 1 and w 2 represent the dosages (mg) of Cd (CH 3 COO) 2 A2H 2 O and S powder for the photodeposition of CdS, respectively. The CdS/g-C 3 N 4 photocatalyst was prepared by photodepositing CdS on g-C 3 N 4 nanosheets.Typically, Cd(CH 3 COO) 2 A2H 2 O (40 mg), sulfur powder (10 mg), and g-C 3 N 4 nanosheets (30 mg) was dispersed in 30 mL ethanol to form a suspension.The suspension was kept in Ar atmosphere and exposed to the visible light for 1 h with continuous stirring.After the reaction, the solid product was collected by high-speed centrifugation, washed by DI-water and ethanol for several times, and dried at 60 C in vacuum, obtaining the CdS/g-C 3 N 4 sample. The c-CdS/Au/g-C 3 N 4 sample was prepared by a chemical deposition for comparison.Specifically, 30 mg of the Au/g-C 3 N 4 sample prepared by the photodeposition method was dispersed in 30 mL DI-water to form a suspension.Then, 11.4 mg thiourea and 40 mg Cd(CH 3 COO) 2 A2H 2 O were dissolved in the suspension.The mixture was stirred for 30 min in dark and subsequently transferred into a 50 mL Teflon-lined stainless steel autoclave, which was kept at 160 C for 5 h.After cooling to room temperature, the precipitate was collected by centrifugation, washed by DIwater and ethanol, and dried at 60 C in vacuum, obtaining the c-CdS/Au/g-C 3 N 4 sample. Since pure CdS cannot be synthesized directly by the photoinduced reaction between Cd(CH 3 COO) 2 A2H 2 O and S powder without adding g-C 3 N 4 as a light-harvesting material, the CdS sample with a small amount of g-C 3 N 4 was synthesized by the photodeposition method for comparison.Specifically, a large amount of Cd(CH 3 -COO) 2 A2H 2 O (400 mg) and S powder (100 mg) along with a small amount of g-C 3 N 4 (10 mg) were dispersed into 30 mL ethanol to form a suspension.The suspension was kept in Ar atmosphere and exposed to the visible light for 1 h with continuous stirring.After the photodepostion, the solid product was collected by centrifugation, rinsed by carbon disulfide, ethanol and DI-water, and dried at 60 C in vacuum. The crystalline phases, microstructures, and element distributions of photocatalysts were characterized by power X-ray diffractometer (XRD, DX-2700), scanning electron microscopy (SEM, ZEISS Ultra-55), transmission electron microscopy (TEM, JEOL-2010), and high-resolution TEM (HRTEM, Hitachi S4800) equipped with an energy-dispersive X-ray (EDX) spectrometer, respectively.The actual contents of Au and CdS in the CdS/Au/g-C 3 N 4 heterojunction photocatalyst are measured by inductively coupled plasma optical emission spectrometer (ICP-OES, Perkin Elmer Optima 8300).X-ray photoelectron spectra (XPS) were acquired on a Thermo Scientific K-Alpha X-ray photoelectron spectrometer, and the binding energies were calibrated with C 1s peak at 284.8 eV as a reference.UV-vis diffuse reflectance spectra (DRS) were recorded on a spectrophotometer of Shimadzu UV-2600 with BaSO 4 as the reference.Photoluminescence (PL) spectra of the photocatalysts were measured on HORIBA Fluoromax-4 spectrophotometer at the excitation wavelength of 350 nm.The PL spectra of coumarin and umbelliferone were measured at the excitation wavelength of 332 nm.The radicals generated during photocatalytic CO 2 reduction were identified by in situ electron spin resonance (ESR) detection on a Bruker JEOL JES-FA200 spectrometer, with 5,5-dimethyl-1-pyrroline-N-oxide (DMPO) as a radicaltrapping reagent. The photoelectrochemical tests were conducted in a 0.1 M Na 2 -SO 4 solution electrolyte using a three-electrode system in a quartz cell on an electrochemical workstation (CHI660E, china).The catalyst-coated fluorine-tin-oxide (FTO) glass, platinum wire and Ag/AgCl electrode were used as photoelectrode, counter electrode, and reference electrode, respectively.For preparing a photoelectrode, 4 mg photocatalyst and 10 lL naphthol were mixed with 390 lL DI-water by 1 h sonication to form a slurry, and 200 lL of the slurry was uniformly coated onto a FTO glass (1 cm A 1 cm), which was dried naturally at room temperature.The transient photocurrent was measured under a chopped light irradiation (light on/off cycles: 30 s) from Xe lamp, with a bias potential of 0.11 V.The Mott-Schottky plots were recorded in dark at the frequencies of 500, 1000, and 1500 Hz, respectively, with the potential range from A2.0 to 2.0 V.The electrochemical impedance spectra (EIS) were measured in the frequency range of 0.01-10 5 Hz with an amplitude of 5 mV and a bias potential of 0 V vs. Ag/AgCl electrode.For comparison, the transient photocurrent tests were carried out in the Na 2 SO 4 solution saturated with varied atmospheres (Ar or CO 2 ). For the photocatalytic CO 2 reduction, 10 mg photocatalyst was dispersed in 30 mL DI-water to form a suspension, which was transferred into a 170 mL reaction vessel with a quartz glass cover.The high-purity CO 2 gas was bubbled into the suspension for 30 min to remove air and achieve the saturation of dissolved CO 2 in DI-water.Before the irradiation, 1 mL gas was extracted from the reactor and analyzed by gas chromatography (GC, FuLi 9790II), and the corresponding data were recorded for the initial reaction.Subsequently, the sealed quartz vessel was placed under the simulated sunlight irradiation (200 mWAcm A2 ) from Xe lamp (PLS-SXE300, Beijing Perfectlight) to trigger CO 2 reduction reaction.During the photocatalytic process, the gaseous products were determined by the GC analysis.The solution after reaction was checked by nuclear magnetic resonance (NMR) spectroscopy on a Bruker AVANCE AV 400 MHz spectrometer.The formation rate of each product and the total consumed electron numbers (TCENs) were calculated as follows, respectively 32: where n is the mole number of each product, m is the weight of photocatalyst and t is the time for photocatalytic reaction. 2.8.In situ diffuse reflectance infrared Fourier-transform spectroscopy (DRIFTS) analysis The in situ DRIFTS analysis for photocatalytic CO 2 reduction was performed on a Bruker TENSOR II Fourier Transform Infrared (FTIR) spectrometer.Specifically, 30 mg photocatalyst was placed on the specimen holder in the test chamber, and a drop of water was dropped beside the photocatalyst.After vacuumizing the test chamber, the background spectrum was recorded from 4000 to 400 cm A1 .Subsequently, the high-purity CO 2 gas was blown in the test chamber for 30 min to achieve the adsorption equilibrium.Finally, the time-dependent DRIFTS spectra were recorded under the irradiation of xenon (Xe) lamp, to monitor the evolutions of surface-bound species on the photocatalyst during the photocatalytic reaction."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The CdS/Au/g-C 3 N 4 sandwich heterojunctions were constructed by a two-step photodeposition process (Fig. 1).Firstly, the Au NPs were deposited selectively on the electron-rich sites of g-C 3 N 4 , where Au(III) cations were reduced to metallic Au 0 .The photoexcited electrons of g-C 3 N 4 prefer to migrate towards Au NPs in the Au/g-C 3 N 4 heterostructures because the work function (5.10 eV) of metallic Au is higher than that of g-C 3 N 4 (4.33 eV) 33,34.Subsequently, CdS was selectively formed around the Au NPs where S 0 was reduced to S 2-by the photogenerated electrons, and thus the CdS/Au/g-C 3 N 4 sandwich heterojunction was constructed.The CdS/Au/g-C 3 N 4 sample mentioned below is the ternary heterojunction photocatalyst with the optimized Au and CdS contents for photocatalytic CO 2 reduction, unless otherwise specified.The ICP-OES measurements indicate that the actual contents of Au and CdS in the CdS/Au/g-C 3 N 4 heterojunction photocatalyst are 0.15 wt and 21.91 wt (Table S1, Supplementary Information), respectively. The crystalline phases of various samples are verified by power X-ray diffraction (XRD), as shown in Fig. 2a.The dominant peak at 27.3in the XRD patterns belongs to the characteristic (0 0 2) diffraction plane of g-C 3 N 4 35.After loading Au or/and CdS on g-C 3 N 4 via the photodeposition process, the diffraction peak of g-C 3 N 4 remain almost unchanged, indicating the well maintained graphic structure of g-C 3 N 4 .The diffraction peaks of metallic Au are hardly observed because the Au contents in the samples are below the detection limit of XRD analysis 36 heterojunctions have been successfully prepared by the two-step photodeposition process.Surface elements and their chemical states of the photocatalysts are analyzed by XPS measurements.XPS survey spectrum of the CdS/Au/g-C 3 N 4 sample (Fig. 3a) clearly shows the existence of Cd, S, Au, C and N elements.Both the high-resolution spectra of Cd 3d (Fig. 3b) consist of two spin-orbital peaks at 405.3 and 412.1 eV, corresponding to the spin orbits of Cd 3d 5/2 and Cd 3d 3/2 , respectively, where the split energy between Cd 3d 5/2 and Cd 3d 3/2 is about 6.8 eV, confirming the dominance of Cd 2 cations 38.For the S 2p spectra (Fig. 3c), two characteristic peaks at 161.6 and 162.8 eV are assigned to S 2p 3/2 and S 2p 1/2 of S 2-anions in the CdS/g-C 3 N 4 sample 39, confirming that CdS was deposited on g-C 3 N 4 by the photoinduced electron reduction process.In comparison, the S 2p peaks of the CdS/Au/g-C 3 N 4 sample shift a little to lower binding energy.The high-resolution Au 4f spectra (Fig. 3d) of both Au/g-C 3 N 4 and CdS/Au/g-C 3 N 4 are composed of two peaks which are attributable to the spin orbits of Au 4f 7/2 and Au 4f 5/2 in metallic Au 0 40.Moreover, the Au 4f peaks of CdS/Au/g-C 3 N 4 positively shift 0.1 eV in comparison with Au/g-C 3 N 4 sample.Previous study has proved that the chemisorbed S species on Au acts as a weak electron acceptor but greatly reduces the density-ofstates that Au exhibits near the Fermi edge 41.Very recently, Yu and coworkers also demonstrated that the electronic interaction between Au and surface S species in AuNiS 1x resulted in the directional free-electron flow from Au to NiS 1x 42.Accordingly, the similar electronic interaction between Au NPs and S species in the present CdS/Au/g-C 3 N 4 heterojunction leads to the negative shift in the binding energy of S 2p compared with that of CdS/g-C 3 N 4 and the positive shift in the binding energy of Au 4f compared with that of Au/g-C 3 N 4 , respectively.All the C 1s spectra (Fig. 3e) of the g-C 3 N 4 based samples split into three peaks at 284.8, 286.4 and 288.2 (or 288.4) eV, corresponding to CAC bond, sp 3 -bonded carbon of C-NH x , and sp 2 -bonded carbon of N-CN, respectively 43.The C 1s peak of N-CN in both CdS/g-C 3 N 4 and CdS/Au/g-C 3 N 4 positively moves by 0.2 eV in comparison with those of g-C 3 N 4 and Au/g-C 3 N 4 .Similarly, the N 1s spectra (Fig. 3f) of the g-C 3 N 4 -based samples can also be divided into three peaks located at 398.7 (or 398.9), 400.0 (or 400.2) and 401.1 (401.3)eV, which can be assigned to the sp 2 hybridized nitrogen in CN-C bond, the nitrogen in the assembly of N-(C) 3 , and the amino groups (C-NH x ), respectively 44.The N 1s peaks of both CdS/g-C 3 N 4 and CdS/Au/g-C 3 N 4 also present the positive shifts compared to those of g-C 3 N 4 and Au/g-C 3 N 4 .These results are consistent with the electron transfer direction from g-C 3 N 4 to CdS during the photodeposition process. The photoabsorption features of catalysts are determined by UV-vis DRS measurements (Fig. 4a).The g-C 3 N 4 nanosheets show a strong optical absorption in the region of 200-450 nm.After photodeposition of Au NPs or CdS, the photoabsorption in visible light region is elevated a little, and the visible-light response of CdS/Au/ g-C 3 N 4 photocatalyst is further increased.The LSPR-associated photoabsorption of Au NPs is hardly detected due to the low Au content in the present photocatalyst, as indicated by the ICP-OES measured data (Table S1, Supplementary Information).The optical bandgaps (E g ) of g-C 3 N 4 and CdS are determined to be 2.65 and 2.53 eV, respectively, by the relationship of (ahm) 1/2 or (ahm) 2 vs. photon energy (hm) 45, as shown in Figs.S2a-b.The energy band potentials of g-C 3 N 4 and CdS are estimated by the Mott-Schottky plots (Figs.S2c-d) 46.Since the flat band potential of n-type semiconductor is close to the conduction band minimum (CBM), the CBM of g-C 3 N 4 and CdS are approximate to A1.46 and A0.90 V vs. Ag/AgCl, respectively, corresponding to A1.26 and A0.70 V (vs.NHE) 47.The valence band maxima (VBM) of g-C 3 N 4 and CdS are estimated to be 1.39 and 1.83 V according to the relationship of E g E VBM -E CBM .The separation efficiency of photogenerated carriers in photocatalysts is studied by the photoluminescence (PL) spectroscopy, as shown in Fig. 4b.In comparison, the PL intensity of CdS/Au/g-C 3 N 4 photocatalyst is greatly quenched, suggesting that the sandwich heterojunction can effectively suppress the electron-hole recombination.The separation and transfer efficiencies of photogenerated charge carriers in different photocatalysts are further demonstrated by the photoelectrochemical measurements.Fig. 4c shows the transient photocurrents of different catalyst-coated FTO photoelectrodes under the simulated sunlight with on/off cycle modes.All the g-C 3 N 4 -based heterojunction photocatalysts generate the higher photocurrents than that of pure g-C 3 N 4 .Especially, the CdS/Au/g-C 3 N 4 sandwich heterojunction exhibits the highest photocurrent density, indicating the best photo-response and the highest separation efficiency of photoinduced carriers in this material.Moreover, the CdS/Au/g-C 3 N 4 photocatalyst presents the smallest radius of EIS Nyquist plots (Fig. 4d), indicating that the sandwich heterojunction most facilitates the interface charge transfer.These results consistently validate that the CdS/Au/g-C 3 N 4 sandwich heterojunction photocatalyst has significant merits in light harvesting as well as accelerating the separation and transfer of photoinduced charge carriers, which will greatly benefit the CO 2 reduction. The photocatalytic CO 2 reduction performance of the asprepared photocatalysts was evaluated by performing the reaction in CO 2 -saturated aqueous solution without any sacrifice agent under simulated sunlight (Tables S2-4, Supplementary Information).In the present photocatalytic systems, H 2 is not generated, and the nuclear magnetic resonance (NMR) spectroscopy proves that no product remains in the reaction solution (Fig. S3).Firstly, the photocatalytic CO 2 reduction performance of the Au(x)/g-C 3 N 4 photocatalysts with different theoretical Au contents (x wt.) are screened (Fig. S4a,c and Table S2; Supplementary Information).The results indicate that all the Au(x)/g-C 3 N 4 photocatalysts only produce CO gas, and the Au(1.0)/g-C 3 N 4 sample exhibits the highest photocatalytic activity with the CO yield rate of 5.5 lmolAg cat -A1 Ah A1 .Based on the optimization of Au content, the CdS(w 1 , w 2 )/ Au(1.0)/g-C 3 N 4 photocatalysts with different CdS contents, where w 1 and w 2 represent the dosages (mg) of Cd(CH 3 COO) 2 A2H 2 O and S powder for the photodeposition of CdS, were studied (Fig. S4b,d and Table S3; Supplementary Information).All the CdS(w 1 , w 2 )/ Au(1.0)/g-C 3 N 4 heterojunction photocatalysts can produce CH 4 and CO.Among them, the CdS(40, 10)/Au(1.0)/g-C3 N 4 photocatalyst presents the best performance toward photocatalytic CO 2 Ah A1 , respectively.The CdS photocatalyst synthesized by the photodeposition process with a small amount of g-C 3 N 4 can also produce CH 4 and CO (Fig. S5c, Supplementary Information), although the activity is much lower than those of the CdS/g-C 3 N 4 and CdS/Au/g-C 3 N 4 heterojunction photocatalysts.In order to more intuitively compare the activities of different photocatalysts, the total consumed electron number (TCEN) for CO 2 reduction is calculated and illustrated in Fig. 5c.TCEN of the CdS/Au/g-C 3 N 4 photocatalyst reaches up to 23.8 lmolAg cat A1 Ah A1 which is much higher than those of the other photocatalysts.Furthermore, the superiority of photodeposi-tion method for the construction of CdS/Au/g-C 3 N 4 sandwich heterojunction photocatalyst is evidenced by using the c-CdS/Au/ g-C 3 N 4 photocatalyst (Fig. S6) synthesized via a traditional hydrothermal method as a counterpart.The activity of c-CdS/Au/ g-C 3 N 4 photocatalyst (V in Fig. 5b-c) is rather inferior to that of the CdS/Au/g-C 3 N 4 sandwich heterojunction photocatalyst.The TCEN of c-CdS/Au/g-C 3 N 4 photocatalyst for CO 2 reduction is as low as 4.0 lmolAg cat A1 Ah A1 , merely producing CO with a low yield rate of 2.0 lmolAg A1 Ah A1 .The inferior photocatalysis of c-CdS/Au/g-C 3 N 4 should be ascribed to the random distribution and severe aggregation of CdS, which cannot afford the effective heterojunction for charge transfer or the sufficient active sites for CO 2 activation. The pure g-C 3 N 4 mainly produces CO probably because the photogenerated carrier mobility in g-C 3 N 4 is very slow, which leads to the easy charge recombination before transfer to the surface for CO 2 reduction.The relative low density of surface photogenerated electrons results in the exclusive generation of CO with less electrons involved 8.Au acting as a cocatalyst mainly improves the CO yield due to its weak CO binding energy 48, and thus the Au/g-C 3 N 4 photocatalyst presents a great enhancement in CO production but cannot produce CH 4 .Since CdS is a good candidate for dissociating H 2 O to H adatoms 49, it can act as a H adatom reservoir to supply sufficient protons, which promotes the hydrogenation process of CO 2 for CH 4 formation.After the photodeposition of CdS on g-C 3 N 4 or Au/g-C 3 N 4 , the as-obtained CdS/g-C 3 N 4 and CdS/Au/g-C 3 N 4 photocatalysts have the distinct capability for CH 4 production.Particularly, the selective photodeposition of CdS on Au/g-C 3 N 4 can afford sufficient electron-enriched S dA active sites which are more beneficial to the provision of H adatoms 42.Meanwhile, the better separation of photogenerated electrons and holes in the CdS/Au/g-C 3 N 4 heterojunction photocatalyst can create the higher surface photogenerated electron density of CdS, which dynamically accelerates the multi-electron reduction reaction and thus enhances CH 4 production selectivity.In brief, the distinct advantages of the CdS/Au/g-C 3 N 4 heterojunction photocatalyst jointly improve the photocatalytic CO 2 conversion to CH 4 via a multi-proton coupled multi-electron reduction process even in pure water. In addition, the photocatalytic CO 2 reduction reaction is performed under different controlled conditions (Table S5, Supplementary Information) and the results are shown in Fig. 5d.When the photocatalytic reaction is conducted in the N 2 -saturated aqueous suspension, a slight product is generated (Fig. S7) probably because a small quality of CO 2 is adsorbed in the photocatalyst from air.No product is generated from the reaction system without catalyst or light irradiation, proving that the CO and CH 4 products are derived from photocatalytic CO 2 reduction (Fig. 5d).The temperature of the photocatalytic system with the CdS/Au/g-C 3 N 4 photocatalyst was measured to be 44 C after 5 h irradiation, whereas the CO 2 reduction cannot occur over this catalyst at 44 C in dark, excluding the thermally catalytic CO 2 reduction in the present reaction system.Finally, the cyclic experiments of photocatalytic CO 2 reduction (Fig. 5e) affirm that the CdS/Au/g-C 3 N 4 photocatalyst can maintain the high performance after four consecutive cycles (20 h).XRD, SEM and TEM characterizations on the recycled CdS/Au/g-C 3 N 4 photocatalyst (Fig. S8) indicate that the compositions and microstructures of the recycled CdS/Au/g-C 3 N 4 photocatalyst remain unchanged after four consecutive cycles (20 h), affirming the high stability of this photocatalyst in a long-term photocatalytic reaction.Therefore, the CdS/Au/g-C 3 N 4 sandwich heterojunction photocatalyst constructed by the two-step photodeposition method has favorable activity and stability for CO 2 reduction. The photodeposition of Pt NPs from the reduction of H 2 PtCl 6 by photogenerated electrons can be employed to identify the electronrich sites of a photocatalyst 50.Herein, the electron transfer path is tracked by the photodeposition of Pt NPs on the CdS/g-C 3 N 4 heterojunction instead of CdS/Au/g-C 3 N 4 , because the (1 1 1) lattice spacing of Au (0.24 nm) is very close to that of Pt (0.23 nm).As shown in Fig. 6a, Pt NPs featuring with the lattice spacing of 0.23 nm are loaded on CdS in the CdS/g-C 3 N 4 sample, indicating that the photogenerated electrons are enriched in CdS for the photodeposition of Pt NPs.In the case of CdS/Au/g-C 3 N 4 photocatalyst, the type-II heterojunction constructed by the photoreduction growth of CdS on Au/g-C 3 N 4 is particularly efficient in promoting the photocatalytic performance toward CO 2 reduction.The Au NPs sandwiched between CdS and g-C 3 N 4 can not only serve as a conductor to accelerate the electron transfer but also possibly generate a small quantity of ''hot electrons\" owing to the plasmonic effect 51.To investigate the interfacial charge transfer from photocatalyst to the chemisorbed CO 2 molecules during the photocatalytic process, the transient photocurrent responses of g-C 3 N 4 and CdS/Au/g-C 3 N 4 photocatalysts are measured in the electrolyte saturated with different gas (Ar and CO 2 ), as shown in Fig. 6b 52.The photocurrent measured in Ar atmosphere is attributed to the migration of photogenerated electrons from catalysts to electrodes.In contrast, the photocurrent measured in the electrolyte saturated with CO 2 declines obviously, which is caused by the competitive interfacial electron transfer from catalyst to the chemisorbed CO 2 molecules.Specifically, the photocurrent is reduced more for the CdS/Au/g-C 3 N 4 photocatalyst (33) than g-C 3 N 4 (25), indicating that the CdS/Au/g-C 3 N 4 photocatalyst facilitates the electron migration to CO 2 .The efficient electron delivery accelerates the activation of CO 2 and subsequent multistep protoncoupled electron transfer process for hydrocarbon formation 53.Furthermore, the in situ electron spin resonance (ESR) is conducted to detect the radical intermediates generated during the photocatalytic CO 2 reduction over different catalysts.The characteristic signal (k) of the DMPO-trapped carbon-centered radical is obviously observed in the CdS/Au/g-C 3 N 4 photocatalytic system after 10 min irradiation (Fig. 6c), suggesting the formation of carbon-centered radical intermediate 54.Besides, the DMPOtrapped hydroxyl radical (DMPO-OH) featured with a quartetpeak signal (Fig. 6c) is also observed in the CdS/Au/g-C 3 N 4 photocatalytic system by the ESR detection 55.The presence of OH radical should be ascribed to the photooxidation of surfaceadsorbed OH -groups, which is considered as the oxidation halfreaction to consume photogenerated holes (h ) in the present reaction system 54,56.Previous study has evidenced that g-C 3 N 4 could elevate energy levels of OH -at the interface by up to 0.6 eV, which made the electronic level of OH A surpass the VBM of g-C 3 N 4 , and thus the photogenerated holes of g-C 3 N 4 could oxidize OH A to produce OH radical 57.For the pure g-C 3 N 4 photocatalyst (Fig. 6d), neither OH nor carbon-centered radical is observed after 10 min irradiation, because the photocatalytic activity of g-C 3 N 4 is too low to generate detectable radicals in a short time.However, as the irradiation time is extended to 60 min, both OH and carbon-centered radical are detected obviously in the photocatalytic system of pure g-C 3 N 4 .In addition, the generation of AOH radical is further proved by a fluorescence probe method 58.The reaction of coumarin with OH radical can produce fluorescent umbelliferone which emits the characteristic fluorescence around 455 nm.After 10 min irradiation, the fluorescent umbelliferone can be generated obviously in the coumarin solution with CdS/Au/g-C 3 N 4 photocatalyst but cannot be generated in the coumarin solution with g-C 3 N 4 (Fig. 6e).After 5 h irradiation, both the photocatalytic reaction systems of g-C 3 N 4 and CdS/Au/g-C 3 N 4 show the formation of fluorescent umbelliferone (Fig. 6f).These results confirm that the OH radical can be generated from the oxi-dation of surface-adsorbed OH A by the photogenerated holes of g-C 3 N 4 and that the CdS/Au/g-C 3 N 4 photocatalyst has a much superior activity toward CO 2 reduction in water. To obtain more specific information about the reaction mechanism of photocatalytic CO 2 reduction, the in situ DRIFTS measurements are conducted to track the evolutions of surface-bound species on the photocatalyst under the simulated sunlight, and the results are shown in Fig. 7.For pure g-C 3 N 4 , a broad band appears and gradually increases in the region of 1700-1900 cm A1 after the catalyst is exposed to the humid CO 2 atmosphere and light irradiation.The broad band can be divided into three dominant peaks (1728 cm A1 for CO 3 2-, 1750 cm A1 for ACO 2 2-and 1770 cm A1 for HCO 3 -) which are ascribed to preliminary adsorption and activation of CO 2 37,59.The peak around 1521 cm A1 is attributable to the vibration of COOH 60,61.The broad band in the region of 2000-2200 cm A1 (inset in Fig. 7a) can be assigned to the chemisorbed CO.Particularly, the peaks at 2051 and 2145 cm A1 increase with the prolonged irradiation time, suggesting the generation of CO on the photocatalyst 62.For the CdS/ Au/g-C 3 N 4 photocatalyst, the characteristic peaks of several crucial intermediates for CO 2 conversion to CH 4 are detected, where the peak at 1104 cm A1 is assigned to CHO and the peaks at 1063 cm A1 and 1160 cm A1 are ascribed to CH 3 O 63,64.The intensities of these peaks gradually increase with prolonging the irradiation time, indicating the favorable activity of CdS/Au/g-C 3 N 4 photocatalyst for converting CO 2 to CH 4 65.Based on the in situ DRIFTS analysis, a possible reaction pathway of the photocatalytic CO 2 reduction over CdS/Au/g-C 3 N 4 is described in the following Eqs.( 1)-( 8), where denotes the catalytically reactive sites on photocatalyst 66. Upon gathering the above information, the mechanism of photocatalytic CO 2 reduction over the CdS/Au/g-C 3 N 4 sandwich heterojunction photocatalyst is visualized as Fig. 8.Under the irradiation, both CdS and g-C 3 N 4 are excited to generate electron-hole pairs, and meanwhile the Au NPs sandwiched between CdS and g-C 3 N 4 serve as a conductor to accelerate the electron transfer as well as possibly generate a small quantity of ''hot electrons\" owing to the plasmonic effect.Following to the charge transfer mode of a type II heterojunction photocatalyst, the photogenerated electrons migrate to the conduction band of CdS and the photogenerated holes are located in valence band of g-C 3 N 4 .Therefore, the CO 2 reduction is implemented on the electron-rich CdS surface, where the high electron density facilitates the formation of CH 4 via a multi-proton coupled multi-electron reduction process.Meanwhile, the photogenerated holes accumulated on g-C 3 N 4 are captured by the surface-adsorbed OH -groups, to generate the OH radicals which would finally turn into H 2 O and O 2 .The CdS/Au/g-C 3 N 4 sandwich heterojunction photocatalyst fabricated by the selective photodeposition process not only facilitates the separation of photogenerated electron-hole pairs to obtain the high surface electron density but also affords sufficient electron-enriched S dA active sites which are beneficial to the provision of H adatoms.As a result, the CdS/Au/g-C 3 N 4 heterojunction photocatalyst exhibits the enhanced performance in photocatalytic CO 2 reduction to hydrocarbon."
  },
  {
    "title": "Conclusions",
    "content": "In summary, the CdS/Au/g-C 3 N 4 photocatalyst with sandwich nanostructures is skillfully constructed by a selective two-step photodeposition process and used for the photocatalytic CO 2 reduction into fuels (CO and CH 4 ).The CdS/Au/g-C 3 N 4 photocatalyst with type-II heterojunction facilitates the spatial separation of electrons in CdS and holes in g-C 3 N 4 , which not only prevents CdS from photocorrosion but also increases the electron density on CdS surface.Moreover, the selective photodeposition of CdS on Au/g-C 3 N 4 affords sufficient electron-enriched S dA active sites which act as H adatom reservoir to supply enough active hydrogen, benefiting the hydrogenation of CO 2 for CH 4 formation.These dis- tinct merits of CdS/Au/g-C 3 N 4 photocatalyst jointly improve the photocatalytic CO 2 conversion to CH 4 via a multi-proton coupled multi-electron reduction process.Photocatalytic CO 2 reduction experiments demonstrate that both g-C 3 N 4 and Au/g-C 3 N 4 generate only CO product; whereas the CdS/Au/g-C 3 N 4 photocatalyst exhibits a superior CH 4 -production ability, which is about twice that of CdS/g-C 3 N 4 .The CdS/Au/g-C 3 N 4 photocatalyst also shows high stability in the consecutive cycles of CO 2 reduction.This work highlights a rational fabrication of type-II ternary heterojunction photocatalyst via the selective photodeposition, which is more controllable to regulate photogenerated charge carriers and catalytic active sites than the traditional chemical deposition method.Furthermore, the photocatalytic mechanism and reaction pathway of CO 2 reduction over CdS/Au/g-C 3 N 4 photocatalyst are studied by systematic characterizations and in situ spectroscopic analyses.Though there are still great challenges in designing CO 2 reduction photocatalyst with high activity and product selectivity, this research may bring some enlightenment for future development of this field. Au/g-C 3 N 4 , CdS/Au/g-C 3 N 4 , and CdS/g-C 3 N 4 photocatalysts via photodeposition method Fig. 1.Schematic diagram of synthesizing CdS/Au/g-C 3 N 4 sandwich heterojunctions. Fig. 2. (a) XRD patterns of difficult samples.(b-e) Characterizations on CdS/Au/g-C 3 N 4 photocatalyst: (b) SEM image, (c) TEM image (inset: size distribution of Au NPs), (d) HRTEM images recorded on the selected areas, (e) HAADF-STEM image and the element mappings recorded on the area marked with the red rectangle.(For interpretation of the references to colour in this figure legend, the reader is referred to the web version of this article.) Fig. 3. XPS spectra of different photocatalysts.(a) Survey spectra of the CdS/Au/g-C 3 N 4 photocatalyst, (b-f) high resolution spectra of (b) Cd 3d, (c) S 2p, (d) Au 4f, (e) C 1s and (f) N 1s. Fig. 4. Photoabsorption and photoinduced charge carriers of different photocatalysts.(a) UV-vis absorption spectra and photographs (insets) of the samples, (b) PL spectra, (c) transient photocurrent, (d) electrochemical impedance spectra. Fig. 5. Photocatalytic CO 2 reduction performance.(a) Time-dependent product yields, (b) product yield rates, and (c) total consumed electron numbers (TCEN) for CO 2 reduction over different photocatalysts; (d) photocatalytic CO 2 reduction performance under different conditions and (e) cycling tests of CdS/Au/g-C 3 N 4 photocatalyst.Three repeated experiments were performed for error estimates. Fig. 6.(a) HRTEM image of photodeposited Pt NPs on CdS/g-C 3 N 4 for charge transfer tracking, (b) transient photocurrent responses of g-C 3 N 4 and CdS/Au/g-C 3 N 4 in the electrolyte bubbled with Ar or CO 2 .(c, d) ESR spectra of the photocatalytic reaction systems with CdS/Au/g-C 3 N 4 and g-C 3 N 4 ; (e, f) fluorescence spectra of different reaction systems for detecting OH radical. Fig. 7.In situ DRIFTS of the photocatalytic CO 2 reduction on (a) pure g-C 3 N 4 and (b) CdS/Au/g-C 3 N 4 photocatalysts. Fig. 8. Possible photocatalytic mechanism of CO 2 reduction over the CdS/Au/g-C 3 N 4 heterostructure photocatalyst. This work was supported by the Fundamental Research Funds of Zhejiang Sci-Tech University (2020Y003), the National Natural Science Foundation of China (No. 21471004) and the Science Foundation of Zhejiang Sci-Tech University (17062002-Y). Mengtian Huang: Methodology, Investigation, Data curation, Visualization, Software.Cong Chen: Software, Validation, Writing -original draft.Ting Wang: Software, Validation, Formal analysis.Qi Sui: Software, Formal analysis.Kun Zhang: Software, Formal analysis.Benxia Li: Methodology, Supervision, Conceptualization, Writing -review editing, Funding acquisition. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://doi.org/10.1016/j.jcis.2022.01.065."
  }
]