[
  {
    "title": "Doi",
    "content": "10.1016/j.nanoen.2017.03.021"
  },
  {
    "title": "Article_Title",
    "content": "Efficient photocatalytic CO 2 reduction in all-inorganic aqueous environment: Cooperation between reaction medium and Cd(II) modified colloidal ZnS"
  },
  {
    "title": "Abstract",
    "content": "Although photocatalytic CO 2 reduction has been investigated extensively, veritably efficient \"CO 2 photoconverter\" that can be in particular operated at all-inorganic reaction system with good durability is very few.Herein, we show that photocatalytic CO 2 reduction rate over colloidal ZnS in all-inorganic aqueous environment can be improved by 1-2 orders of magnitude and reach exceptional performance after continuous regulation of reaction medium and grafting efficient cocatalysts.In the optimized condition, Cd 2 modified colloidal ZnS exhibited 95 HCOOH selectivity with 76 apparent quantum efficiency (280 nm).A modulated reaction medium maximizes the concentration of active reaction species and maintains efficient and stable photocatalytic reaction rate, while the cocatalyst significantly improves the separation of photo-excited carriers and CO 2 reduction rate with targeted product selectivity.The present reaction system is much superior over the widely used inorganic reaction system with low CO 2 conversion ability and organic complex photocatalysts with respect to long term reaction durability."
  },
  {
    "title": "Experimental",
    "content": "The colloidal ZnS (0.1g) can be quite efficiently obtained by directly pouring the freshly prepared Na 2 S solution (1.026 mmol in 20 ml) into ZnSO 4 solution (1.026 mmol in 20 ml) under vigorous stirring followed by centrifugation (10,000 rpm, 2 min).Extending stirring time and further hydrothermal or heat treatment are not needed.Then, the received precipitate was redispersed in water for activity test in the reaction cell without drying procedure.In order to modulate the reaction environment, K 2 SO 3 and KHCO 3 were added quantitatively into the aforementioned ZnS suspension and the volume of the reaction solution was fixed at 100 ml by adding more water into the reaction cell.At last, the reaction system (Fig. S1) was evacuated and highpurity CO 2 (99.999) was repeatedly injected into the reaction system until the reaction solution was saturated.Note that both K 2 SO 3 and KHCO 3 are weak alkaline electrolytes which can uptake CO 2 into the reaction solution and buffer the pH.The final pressure of CO 2 in the headspace of reaction cell is equal to atmospheric pressure (101-102 kPa).A 200 W Hg-Xe lamp equipped with UVCM2 reflector (to reflect the light with wavelength of 240-600 nm into reactor) was used as light source. X-ray diffraction (XRD) patterns were recorded on an X-Pert diffractometer equipped with graphite monochromatized Cu-K radiation.Transmission electron microscopy (TEM) images were taken by a Tecnai G2 F30 high-resolution transmission electron microscopy.The diffuse reflection spectra of catalysts were measured by UV-VIS spectrophotometer (UV-2600, SHIMADZU Co., Japan).The light intensity distribution of the light source was measured by USR-40 spectroradiometer (Ushio Inc., Japan).In-situ Fourier transform infrared (FTIR) spectroscopy measurement was performed on JASCO FT-IR-6300.The fluorescence spectra were measured by fluorescence spectrophotometer JASCO FP-6500 and the time-resolved fluorescence spectra were measured on Quantaurus-Tau Fluorescence Life Time Spectrometer (Hamamatsu Photonics).In the time-resolved fluorescence measurement, the excitation wavelength is 280 nm and emission wavelength is 420 nm.All the suspensions for the two types of fluorescence spectrum measurements contain 1 gL -1 colloidal ZnS or Cd 2 modified colloidal ZnS in water or CO 2 saturated 0.5 mol L -1 KHCO 3 in water. The CO and CH 4 in the reaction system were sampled and measured with a gas chromatograph (GC-14B, Shimadzu) equipped with a flame ionization detector (FID) according to the standard curves.The contents of H 2 were measured with an online gas chromatograph (GC-8A, Shimadzu) with a TCD detector according to the standard curve.The liquid product HCOOH was quantified by JEOL ECS 400 MHz nuclear magnetic resonance (NMR) Spectrometer, in which 0.5 ml electrolyte was mixed with 0.1 ml D 2 O (deuterated water), and 0.05 l dimethyl sulfoxide (DMSO, Sigma, 99.99) was added as an internal standard.Generally, the production amount of HCOOH was analyzed after the completion of 8 h reaction for each sample testing. In isotope tracing experiment, 13 CO 2 was injected to the evacuated reaction system and pre-absorbed by reaction solution only containing 0.1 g colloidal ZnS and 0.1 mol L -1 K 2 SO 3 .KHCO 3 was not added to the reaction solution to maintain the purity of 13 C isotope in carbon source for photocatalytic reaction.In the presence of KHCO 3 , the carbon source may be contaminated through the exchange effect in equilibrium CO 2 (aq)H 2 O(l)H (aq)HCO 3 -(aq).Isotope tracing experiments for the identification of 13 CO were performed by gas chromatography-mass spectrometry (GC-MS, JMS-K9, JEOL Co., Japan), while H 13 COOH was confirmed by NMR as described above. For AQE measurement, monochromatic light at 280 nm was obtained by passing light from a 200 W Hg-Xe lamp through a 280 nm interference filter.The width at half intensity was 17.7 nm.The AQE was calculated by the following equations, AQE (H 2 )N(H 2 )2/N(Photons)100 AQE (CO)N(CO)2/N(Photons)100 AQE (HCOOH)N(HCOOH)2/N(Photons)100 AQE (CO 2 )AQE (CO)AQE (HCOOH) in which N(H 2 ), N(CO), N(HCOOH), N(CO 2 ) and N(Photons) signify the number of generated/reacted molecules in unit time and the number of incident photons in unit time, respectively."
  },
  {
    "title": "Results_and_Discussion",
    "content": "No obvious diffraction peak was identified in the X ray diffraction analysis of the wet ZnS gel (i.e., precipitate obtained by centrifugation), revealing an amorphous structure of the sample (Fig. 1a).TEM image shows that the particle size of colloidal ZnS is ca. 5 nm (Fig. 1b).It seems that the colloidal ZnS underwent crystallization under electron beam during TEM observation.The crystallization may also occur during the sample preparation and drying before TEM observation.However, the amorphous feature of as prepared colloidal ZnS can be still distinguished from the obscure lattice fringes in TEM image.UV-VIS spectrum of colloidal ZnS exhibits a distinct absorption onset at ca. 325 nm, corresponding to a band gap of ca.3.8 eV (Fig. 1c).The band gap of colloidal ZnS in this work is larger than that of commercial wellcrystallized ZnS particles, which is possibly because of the amorphous structure and quantum size effects. Firstly, the influence of the concentration of K 2 SO 3 on photocatalytic syngas (Fig. 2a andb) and formic acid (Fig. 2e) production over colloidal ZnS was examined.HCOOH is the main product of CO 2 reduction with CO as minor product.From the time course of syngas evolution under low concentration of K 2 SO 3 (0.02 mol L -1 ), an increasing reaction rate at initial reaction stage can be found.It is supposed that more active species (such as proton for HER and H 2 CO 3 for CO 2 reduction 8) will be formed under reduced pH with the photo-oxidation of K 2 SO 3 into K 2 SO 4 , which improves photocatalytic reaction rate.Since K 2 SO 3 of low concentration (0.02 mol L -1 ) ran out easily, with the consumption of K 2 SO 3 , hole consumption becomes sluggish and photocatalytic syngas evolution rate decayed at later hours.After 8 h reaction, the total amount of H 2 , CO, and HCOOH production was nearly 2 mmol and almost equal to the initial amount of K 2 SO 3 electron donor, suggesting that the photocatalytic reduction and oxidation over colloidal ZnS proceeded quantitatively.When the concentration of K 2 SO 3 reached 0.1 mol L -1 , stable syngas evolution rate was obtained within the reaction duration.Higher concentration of K 2 SO 3 (e.g., 0.5 mol L -1 ) provided adequate amount of electron donor for long term reaction and increased the pH of reaction solution (Fig. S2), which, on one hand, kept the product evolution stable, and on the other hand, however, possibly decreased the concentration of active species, leading to the decrease of photocatalytic performances of HER and CO 2 reduction.Therefore, it is important to keep an optimum dosage of K 2 SO 3 to balance the concentration of electron donor and active reaction species. On the basis of the optimized concentration of K 2 SO 3 (0.1 mol L -1 ), KHCO 3 was further added into the reaction solution.Both the syngas and HCOOH production rates increased remarkably and monotonically with the concentration of KHCO 3 and tended to be stable at higher concentration (Fig. 2c, d ande), showing opposite trend of the influence caused by K 2 SO 3 .The enhanced CO 2 reduction rate is consistent with the increased concentration of active species (H 2 CO 3 ) in a higher concentration of KHCO 3 after CO 2 saturation 8, even if this is accompanied with slight pH increase of final reaction solution (Fig. S2). Besides maximizing the concentration of active reaction species, addition of KHCO 3 also increased the buffer ability of the reaction solution.This can be reflected by the fact that a higher KHCO 3 concentration can mitigate the pH change induced by CO 2 saturation while the K 2 SO 3 can't (Fig. S2).Buffer ability is important to maintain photocatalytic reaction rate stable when proton is involved or consumed.When HER and CO 2 reduction occur, the protons will be consumed and local pH at the solid-liquid interface will be increased due to the generation of OH -.The local pH change over colloidal ZnS during the photocatalytic reaction was detected by in-situ attenuated total reflectance Fourier transform infrared (ATR-FTIR) spectroscopy (Fig. 1f, see the measurement setup in Fig. S3).Under continuous light irradiation, two absorption bands at 1364 cm -1 and 1640 cm -1 start to appear and their intensities become stronger with time.The two absorption bands are respectively assigned to C-O stretching and CO stretching of CO 3 2-derived from the reaction of OH -HCO 3 . The buffer ability of bulk solution can immediately neutralize OH -and mitigate the pH increase, keeping the concentration of reaction species stable near the surface of catalysts 14. The CO 2 saturation will neutralize the pH of reaction solution and increase the total concentration of carbonaceous species, especially the active specie H 2 CO 3 8.In comparison with the reaction without CO 2 saturation but under Ar atmosphere, CO 2 saturation increases the selectivity of CO 2 reduction for CO and HCOOH production and suppresses the selectivity of HER (Fig. S4). 13 CO 2 was also used in isotopic tracing experiment to confirm the carbon source of products.As mentioned in the experimental section, KHCO 3 was not added to avoid the contamination of carbon source.The gas chromatography-mass spectroscopy (GC-MS) result (Fig. 3a) clearly suggests the formation of 13 CO (m/z29).Because a little amount of air in atmosphere was inevitably mixed into syringe during the transfer of gas sample into GC-MS, N 2 (m/z28) and O 2 (m/z32) can be also identified (see the relation between total ion chromatogram and m/z in Fig. S5).Analysis of product at liquid phase gave an obvious 13 C nuclear magnetic resonance (NMR) peak at 170.5 ppm assigned to H 13 COOH (Fig. 3b), and a 1 H NMR doublet (Fig. 3c) corresponding to the proton coupled to the 13 C in H 13 COOH 15.Since the normal HCOOH only has one 1 H NMR peak at ca. 8.3 ppm (Fig. S6), the isotopic tracing experiment result conclusively suggests that CO 2 provides the 100 carbon source in photocatalytic reaction. In order to further improve the activity based on the optimized reaction medium, the cocatalyst effect of various elements was systematically investigated (Table 1).The results demonstrated that only the samples with Ga 3 or Cd 2 modification obtained similar or improved activity compared with the bare colloidal ZnS.Ga 3 showed good CO selectivity and Cd 2 strikingly enhanced the CO 2 reduction rate with superior HCOOH selectivity (95).Such result seems consistent with the previous studies that Ga and Cd are respectively good CO and HCOOH formation metals in electrocatalytic CO 2 reduction 14.Over Cd 2 modified colloidal ZnS, the apparent quantum efficiency (AQE) of CO 2 reduction into HCOOH at 280 nm achieved 76 and the turnover number of HCOOH formation is 434 with respect to Cd 2 within 8 h reaction.Furthermore, the total reaction rate of CO 2 reduction (into CO and HCOOH) reached 1119 mol h -1 (or 11.19 mmol h -1 g -1 ) and we can even observe the macroscopic drop of the CO 2 pressure in the headspace of reaction system (365 ml in volume) from the pressure gauge during the photocatalytic reaction, showing that the reaction rate is really remarkable and much higher than the previous photocatalytic reaction systems, especially those inorganic reaction systems 3.A strong synergistic effect between reaction medium and Cd 2 modified colloidal ZnS can be found in the photocatalytic reaction.The CO 2 reduction rate of Cd 2 modified colloidal ZnS in 0.1 mol L -1 K 2 SO 3 and 0.5 mol L -1 KHCO 3 showed 37.5 times higher than that of bare colloidal ZnS in 0.1 mol L -1 K 2 SO 3 , while such synergistic effect has not been discovered in the previous study due to the use of inefficient organic reaction medium 16, indicating the importance of combining the strategies of reaction environmental modulation and cocatalyst modification in this work.Note that the total evolution amount of syngas and HCOOH over Cd 2 modified ZnS within 8 h reaction is nearly equal to the initial amount of K 2 SO 3 (10 mmol), while the H 2 , CO and HCOOH evolution rates are still steady during the reaction (Fig. S7), implying that buffer ability of KHCO 3 is important to maintain an efficient and stable photocatalytic reaction rate even when K 2 SO 3 has been obviously consumed.Over Cd 2 modified colloidal ZnS, the total product evolution amount under 0.1 K 2 SO 3 without KHCO 3 is only about half of that in the reaction medium containing 0.1 K 2 SO 3 and 0.5 KHCO 3 , which, again, demonstrated the importance of KHCO 3 for photocatalytic reaction, especially for CO 2 reduction into HCOOH 17. It is also interesting that noble metals, which are generally considered as efficient cocatalysts of crystalline semiconductor photocatalysts for photocatalytic reaction (e.g., HER) 18, did not improve but greatly suppressed the photocatalytic performance of colloidal ZnS photocatalyst.This is possibly because the formation of noble metal sulfides passivated the active reaction sites on colloidal ZnS.Moreover, commercial well-crystallized ZnS particles also exhibited very poor performance (Figs.S8 andS9).These results imply that the colloidal ZnS and Cd 2 modified colloidal ZnS are intrinsically active and the surface state of these colloidal particles seems very favorable for the activation process of HER and CO 2 reduction. The fluorescence spectra of colloidal ZnS were measured in order to investigate the role of Cd 2 in photocatalytic reaction (Fig. 4a).Under the excitation wavelength of 280 nm, an obvious fluorescence peak due to the near-band-edge emission of bare colloidal ZnS can be identified at wavelength region of ca.320-380 nm, which is followed by a broad emission at 380-500 nm resulting from the recombination of photoexcited carries at S vacancies 19.After Cd 2 modification, the fluorescence intensity decreases drastically, showing that Cd 2 functions as an efficient fluorescence quencher and favorably separates electrons from colloidal ZnS, which finally suppresses the annihilation of photo-generated carriers.Such quenching effect is more obvious when grafting Cd 2 onto the colloidal ZnS with more S vacancies prepared with excessive Zn 2 (Fig. S10).These results are in line with the facile electron transfer from colloidal ZnS to Cd 2 20.The fluorescence intensities of colloidal ZnS and Cd 2 modified sample were further decreased when the samples were measured in CO 2 saturated KHCO 3 solution, showing that the photo-excited electrons are more easily scavenged in the presence of CO 2 .The change of fluorescence intensity caused by Cd 2 loading is consistent with the product selectivity between syngas and HCOOH.As has been previously elaborated in both photo-and electro-catalytic CO 2 reduction, over the sulfides, the S vacancy is involved in the activation of CO 2 and HER for the formation of CO and H 2 , while the metal site controls the CO 2 activation for HCOOH formation 212223.Since photo-excited electrons are inclined to be trapped by Cd 2 instead of S vacancies, the reduction reaction should mainly occur at the Cd sites on the surface, resulting in suppressed selectivity of syngas. The dynamics of the photo-generated carriers was also studied by time-resolved fluorescence measurement (Fig. 4b).The lifetime of the photoluminescence is shortened after Cd 2 modification, showing consistent trend with other popular cocatalyst/photocatalyst systems, such as PdS/CdS 24 and Pt/TiO 2 25,26, where the trapping of photo-generated carriers by cocatalysts induces fast fluorescence decay.Also, the lifetime was further shortened when the samples were measured in the presence of CO 2 in the modulated reaction medium. Therefore, two types of fluorescence measurements consistently revealed the effectiveness of strategy combining cocatalyst modification and reaction medium modulation proposed in this work.Since the solubility products K sp of CdS (pK sp 26) is smaller than that of ZnS (pK sp 22), it is very likely that ion exchange occurred between the added Cd 2 and the Zn 2 at the surface region of colloidal ZnS.Actually, we can observe a slight red-shift of the near-band-edge emission of colloidal ZnS after Cd 2 modification (Fig. 4a), which reflected a minor narrowing of the band gap through ion exchange between Cd 2 and Zn 2 .Upon the excitation, the electrons on colloidal ZnS will be trapped by the surface state created by Cd 2 below the conduction band of colloidal ZnS (Fig. 5).Therefore, correlating the fluorescence data and photocatalytic activity, it is supposed that modification of Cd 2 cocatalyst, on one hand, greatly improves the separation of photo-excited electrons from colloidal ZnS, and on the other hand, selectively reduces CO 2 into HCOOH with excellent efficiency. The photocatalytic behaviors of quantized semiconductor colloidal is very unique and different from macrocrystalline semiconductor particle.Firstly, quantization effects lead to the discreteness of states in the conduction band and valence band as well as the widening of effective band gap.This, in turn, results in enhanced redox potentials to drive photocatalytic reactions 27.Secondly, macrocrystalline semiconductor particle has good carrier mobility and the ability to accommodate numerous excited carriers due to the small effective 13 CO, (b) 13 C NMR and (c) 1 H NMR spectra of H 13 COOH produced in isotope tracing experiment using 13 CO 2 as reactant.mass of charge carriers and large particle size.In contrast, the time interval between the absorption of two photons (or the production of two excited electrons) by extremely small colloidal particle is generally longer than 100 s depending on the light intensity, much longer than the charge transfer from photocatalysts to cocatalysts (timescale in ps) 25,26,28.Assuming that the electron scavenger is sufficient in the reaction system, the photo-excited electrons at colloidal particle is ready to be reacted in a one-by-one manner.Therefore, we can envision the pathway of CO 2 reduction over Cd 2 modified colloidal ZnS, in all likelihood, as follows.Firstly, an excited electron by a single photon absorption is transferred from colloidal ZnS to the Cd 2 and leads to the formation of Cd .Secondly, since the Cd is very unstable and the redox potential of Cd 2 /Cd is very negative 28, Cd will donate the first electron to CO 2 to form CO 2 anion radical which is normally considered as the key intermediate of CO 2 reduction 29.According to the ab initio study, the unpaired electron density at the highest occupied orbital of CO 2 anion radical is mainly localized at C atom at 84 30.As a consequence, the CO 2 anion radical in the reaction solution will be ready to take a proton from H 2 O at the nucleophilic carbon atom, forming HCO 2 14.Finally, the HCO 2 is subsequently reduced to HCOO -by a second electron donated from another Cd produced from photo-reduction of Cd 2 .We also observed an interesting phenomenon that, when the Cd 2 modified colloidal ZnS was illuminated in the CO 2 saturated solution containing 0.1 mol L -1 K 2 SO 3 and 0.5 mol L -1 KHCO 3 , or air saturated 0.1 mol L -1 K 2 SO 3 solution, the appearance of suspensions keep a stable white color during 8 h reaction (Fig. S11a,b).In both reaction systems, CO 2 and O 2 act as potent electron scavengers.However, when the same colloidal photocatalyst was illuminated in Ar saturated 0.1 mol L -1 K 2 SO 3 solution, the color of suspension gradually changed into greyish-brown (Fig. S11c), indicating the formation of metallic Cd over the colloidal particles from the over-reduced Cd 2 .Therefore, in the presence of CO 2 , it seems apparently that over-reduction of Cd 2 into metallic Cd does not occur and the efficient CO 2 reduction keeps a dynamic equilibrium with Cd 2 /Cd redox couple.The schematic illustration of the overall reaction process is shown in Fig. 6.One of the most important industrial applications of syngas is to be used as the feedstock of Fischer-Tropsch synthesis (FTS) 31.With regard to the gas phase products in this work, the ratio of H 2 /CO is too high to meet the requirement of FTS and further increasing the content of CO in syngas is necessary.Encouraged by previous electrocatalysis studies, we find that, to some extent, addition of ionic liquid into the reaction solution can increase the selectivity of CO in the syngas (Fig. S12) 323334.Moreover, the relative content of CO can be also increased by catalytic conversion of H 2 -rich syngas with CO 2 through reverse water-gas shift reaction (H 2 CO 2 COH 2 O) 35 as a posttreatment step."
  },
  {
    "title": "Conclusions",
    "content": "In conclusion, we obtained extremely efficient syngas and formic acid production over colloidal ZnS in all-inorganic reaction medium.Collaborative promotion effect from optimized reaction environment and suitable cocatalyst modification is crucial to reach such exceptional activity over colloidal photocatalysts.The combined strategy is inspiring and possibly applied in the photocatalytic CO 2 reduction system based on other sulfide photocatalysts.The reaction process reported here is very practical and can be adopted for simultaneously removal of two important industrial exhaust gas, CO 2 (greenhouse gas) and SO 2 (acid rain formation gas), where CO 2 will be reduced into CO and formic acid, while SO 2 will be finally converted into the environmentally safe product, SO 42-(Fig.S13).The photocatalytic activity of other semiconductors with relatively high conduction bands, such as commercial SrTiO 3 , NaNbO 3 , ZnO, GaN and lab-made C 3 N 4 were also measured at the same condition as this work.The preliminary study showed that these semiconductors are unable to reduce CO 2 efficiently (only ca.0-10 nmol h -1 for CO production, no detectable HCOOH was found by NMR, detailed results are not shown).This seems to imply that, besides the advantage in high conduction band potential, the surface structure of colloidal sulfides is very unique and favorable for CO 2 activation.Future work includes more detailed mechanistic studies on the activation process of CO 2 over colloidal sulfides.Meanwhile, the design of efficient visible-light-active colloidal sulfide photocatalysts is also meaningful. Fig. 1.(a) X ray diffraction analysis of colloidal ZnS.(b) TEM image of colloidal ZnS.(c) UV-VIS absorption spectrum of colloidal ZnS and the irradiation characteristic of light source. Fig. 2. Time course of photocatalytic products over colloidal ZnS.H 2 (a) and CO (b) evolution in CO 2 saturated K 2 SO 3 solutions, H 2 (c) and CO (d) evolution in CO 2 saturated 0.1 mol L -1 K 2 SO 3 and KHCO 3 solutions, (e) HCOOH production corresponding to the cases in Figure a-d within 8 h, (f) in situ FTIR spectra of CO 3 2-evolution during photocatalytic reaction. Fig. 3. (a) Mass spectrum of13 CO, (b)13 C NMR and (c)1 H NMR spectra of H13 COOH produced in isotope tracing experiment using13 CO 2 as reactant. Fig. 4. (a) Fluorescence spectra of bare and Cd 2 modified colloidal ZnS in water and CO 2 saturated 0.5 mol L -1 KHCO 3 aqueous solution.(b) Time-resolved fluorescence spectra (fitted curve from raw data) of same samples in Figure a.The excitation wavelength is 280 nm and emission wavelength is 420 nm. Fig. 5. Schematic illustration of Cd 2 cocatalyst for photo-generated electron separation and HCOOH selectivity of CO 2 reduction. The influence of cocatalysts on photocatalytic activity of colloidal ZnS. a The loading amount of metal ions is 0.5 mol for noble metals.c 2 mol for non precious metals.The precursors of cocatalysts are aqueous solutions of PdCl 2 , H 2 PtCl 6 , AgNO 3 , HAuCl 4 , CdSO 4 , Al 2 (SO 4 ) 3 , Ga 2 (SO 4 ) 3 , In 2 (SO 4 ) 3 and SnSO 4 , which are quantitatively added to the colloidal ZnS suspension before photocatalytic reaction.dThe reaction solution contains 0.1 mol L -1 K 2 SO 3 without KHCO 3 . b X. Meng and Q. Yu contributed equally to this work.This work received financial support from the World Premier International Research Center Initiative (WPI Initiative) on Materials Nanoarchitectonics (MANA), MEXT, Japan, the National Basic Research Program of China (973 Program, 2014CB239301) and the National Natural Science Foundation of China (21633004). Supplementary data associated with this article can be found in the online version at doi:10.1016/j.nanoen.2017.03.021."
  }
]