[
  {
    "title": "Doi",
    "content": "10.1016/j.ijhydene.2013.11.019"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic hydrogen production with visible light over Mo and Cr-doped BiNb(Ta)O4"
  },
  {
    "title": "Abstract",
    "content": "In the present work, we prepared pure and Cr(III) and Mo(V)-doped BiNbO 4 and BiTaO 4 by the citrate method.Pure BiNbO 4 and BiTaO 4 were obtained in triclinic phase at 600 C and 800 C, respectively.The metal doping influenced strongly the crystal structure as well as the photocatalytic activity of the oxides.The XRD data could prove that the Mo(V) doping induces the orthorhombic phase, while the Cr(III) doping favors the triclinic phase for both oxides.Metal doping also modified the photosensitivity of the oxides, extending the absorption toward the visible light region.The photocatalytic activity in water splitting under visible light irradiation was evaluated by monitoring the H 2 , CO 2 and CO evolution.The results showed that Cr(III)-doped BiTaO 4 and BiNbO 4 , in general, are more selective for hydrogen production, while Mo(V)-doped materials are more selective for CO 2 generation.Comparing the photocatalytic activity of BiTaO 4 and BiNbO 4 , the former shows higher activity for hydrogen production as well as for CO 2 generation, specially when the concentration was 2 in Cr(III) and Mo(V), respectively.Those results are in agreement with the computational study to access the effect of doping on the electronic structure.For Mo(V)-doped materials a negligible change of conduction band minimum potential was found, indicating that there might be no improvement on the reduction power of the material following the substitutional doping.In Cr(III)-doped BiNbO 4 there is a slight shift of the CBM potential increasing a little bit the reduction power.However, the effect is much stronger in the Cr(III)-doped BiTaO 4 ."
  },
  {
    "title": "Experimental",
    "content": "A high-pressure HgeXe arc lamp, with power fixed at 500 W, was used as the light source for the photocatalytic reactions.The collimated light beam was passed through an IR filter and a 418 nm cutoff filter before reaching the photocatalytic cell, which was air cooled to maintain a constant temperature.Before each experiment, the photocatalytic cell was purged with argon for 30 min to eliminate O 2 .H 2 , CO 2 and CO gases evolution was measured by gas chromatography (Shimadzu GC2014) operating with thermal conductivity detection (TCD) for hydrogen detection and flame ionization detector (FID) with methanator for CO 2 and CO detection.Because He and H 2 have similar conductivity values, argon was used as a carrier gas. In a typical photolysis experiment, 120 mg of the target material was dispersed in an aqueous solution (total volume 14 60 mL) containing 30 isopropanol and 40 mL of 8 H 2 PtCl 6 (w0.3 wt. Pt), with pH adjusted to pH 9.5 by the addition of KOH solution.Metallic platinum was deposited in situ on the photocatalyst surface by the photodecomposition of PtCl 6 2A .The photocatalytic cell was equipped with argon gas inlet/outlet tubes, which serve to collect and transfer gaseous products to the analytical system.An aliquot of gas phase was injected after 3 h of reaction.In order to ensure the accuracy of determinations, a standard mixture containing 5 H 2 , 2 CO 2 and 500 ppm CO diluted in argon was injected in GC system before each experiment; besides, the experiment for each photocatalyst was performed at least twice to observe the repeatability. The calculations were carried out within the framework of generalized gradient approximation (GGA) to density functional theory (DFT) 16,17 and using projector augmented plane wave (PAW) method 18, as implemented in VASP code 19.We used a cutoff energy of 500 eV for the plane-wave basis.In all calculations, self-consistency was achieved with a tolerance in the total energy of 0.1 meV.The DOS were calculated by means of the modified tetrahedron method of Blo chl et al. 20.In order to model the substitutional cationic doping we have built up a 3 A 3 A 2 supercell consisting of 288 atoms for both triclinic and orthorhombic phases.According to our experimental findings the doping with Cr always favors the triclinic phase while Mo favors the orthorhombic phase.Since our aim with this computational study is to access the effect of doping on the electronic structure, and correlate such effect with the photocatalytic activity, we restricted ourselves to model the doping on those corresponding phases, i.e., Cr in the triclinic phase and Mo in the orthorhombic phase.In both cases the impurity atoms were substituted on the cation sublattice.We have worked then with the following supercells: Bi 48 Ta 47 MoO 192 (orthorhombic), Bi 48 Ta 47 CrO 192 (triclinic), Bi 48 Nb 47 MoO 192 (ortohombic), Bi 48 Nb 47 CrO 192 (triclinic).As can be seen we are modeling here 2 of doping.In order to compare the density of state of the doped and pristine compounds we have aligned the semi-core states of a oxygen atom place far from the impurity site.This approach takes care of the arbitrariness of the zero energy in the solid-state calculation.It should also be pointed out that we have performed spin-polarized calculations."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Pure BiTaO 4 was synthesized according to the procedure described previously by our group 12.BiNbO 4 was also prepared following the same procedure; however, in this case, the calcination temperature was investigated.The calcined materials were submitted to XRD analysis and compared with PDF patterns of a-BiNbO 4 and b-BiNbO 4 in crystallographic databases. From XRD data showed in Fig. 1 it is possible to conclude that pure b-BiNbO 4 (triclinic phase) was formed at 600 C instead of 800 C as observed for b-BiTaO 4 prepared by the same method 12.Increasing the calcination temperature up i n t e r n a t i o n a l j o u r n a l o f h y d r o g e n e n e r g y 3 9 ( 2 0 1 4 ) 1 2 2 0 e1 2 2 7 to 700 C, the material keeps the same phase, however, when the temperature is increased up to 800 C, it is possible to note some a phase contamination.Therefore, in this work, for pure and doped BiTaO 4 preparation the polymeric precursors were calcined at 800 C for 3 h, while for pure and doped BiNbO 4 the polymeric precursors were calcined at 600 C. Fig. 2 shows the XRD patterns of Cr(III) (Fig. 2 Fig. 2(a) and (b) show the XRD patterns of pure and Cr(III)doped BiNbO 4 and BiTaO 4 , respectively.The XRD analysis reveals that at lower concentrations of chromium the triclinic phase (b phase) is predominant in both cases.However, as the concentration of chromium increases the contamination with orthorhombic phase (a phase) also increases.For Cr(III)doped BiNbO 4 , it can be evidenced through the increase in intensity of the peaks 30.5 and 31.48(2q), that are characteristic of a phase.The increase in Cr(III) concentration also increases the a phase contamination for Cr(III)-doped BiTaO 4 .Such contamination is also evident in XRD patterns in Fig. 2(b), where one can observe the increase of the relative intensity of the peak 25.1 , typical of the a phase, compared to the peaks 23.44 and 23.9 (2q), characteristic of the b phase.In any of the cases we observe chromium segregated phase, such as Cr 2 O 3 , CrO 2 or CrO 3 .Fig. 2(c) and (d) show the XRD patterns of pure and Mo(V)-doped BiNbO 4 and BiTaO 4 , respectively.Unlike Cr(III)doped BiNbO 4 and BiTaO 4 , the XRD patterns for Mo(V)doped BiNbO 4 and BiTaO 4 present the orthorhombic phase as predominant phase in both cases.At lower concentrations of Mo(V), 1 and 2, it is possible to detect the presence of b phase, which disappears when the concentration is increased to 3.In both cases the pure orthorhombic phase is obtained, without any molybdenum segregated phase.Therefore, the Mo(V) doping induces the orthorhombic phase while the Cr(III) doping favors the triclinic phase. The absence of chromium or molybdenum species in segregated phases, associated with the large similarity in the XRD patterns among pure and doped oxides, suggest an isomorphic replacement of metal doping without structure distortion.Since the ionic radii of Cr(III) and Mo(V), 75.5 and 75 pm, respectively, are quite similar to Nb(V) and Ta(V), both 78 pm, in an octahedral environmental, and are too different of Bi(III), 117 pm, the isomorphic substitution takes place in the octahedral sites of Nb(V) and Ta(V). The morphologies of the pure and metal doped oxides were depicted by SEM images.As shown in Fig. 3 i n t e r n a t i o n a l j o u r n a l o f h y d r o g e n e n e r g y 3 9 ( 2 0 1 4 ) 1 2 2 0 e1 2 2 7 the powders was not uniform, nevertheless, the materials present a spongeous appearance, suggesting that the agglomerations could be formed by nanosized particles.It can be seen more clearly in the SEM images of 2 MoeBiTaO 4 and 2 CreBiTaO 4 . The diffuse reflectance spectra of the samples indicate the extending photosensitivity of doped semiconductor photocatalysts toward the visible light region (Fig. 4).In general, as the doping concentration increases the absorbance toward the visible light region also increases. The hydrogen production was measured from an aqueous solution containing isopropanol (30) as sacrificial reagent under visible light irradiation (l !418 nm) for each target photocatalyst.The results demonstrate that pure b-BiNbO 4 and b-BiTaO 4 are inactive under visible light irradiation, however, metal doped oxide photocatalysts with different concentrations of Cr(III) and Mo(V) show some activity with respect to hydrogen production, especially those doped with chromium (Fig. 5). Besides hydrogen, CO 2 and CO concentrations were also evaluated in all experiments.Fig. 5 shows that Cr(III)-doped BiTaO 4 and BiNbO 4 , in general, are more selective for hydrogen production, while Mo(V)-doped BiTaO 4 and BiNbO 4 photocatalysts are more selective for CO 2 generation, indicating that the former are more efficient for water reduction to hydrogen and the last ones are more efficient for mineralization of organic compounds.For the photocatalysts more active with respect to hydrogen production, the XRD patterns revealed that there is a predominance of triclinic phase induced by chromium doping. From the comparison of the photocatalytic activity of BiTaO 4 and BiNbO 4 , the former shows higher activity as for hydrogen production as well for CO 2 generation, when the concentration was 2 in Cr(III) and Mo(V), respectively. In Fig. 6(a) and (b), we present the density of states of the Mo-doped BiTaO 4 and BiNbO 4 , respectively.As can be observed, the substitution of Mo on the cation-sublattice leads to the formation of impurity states near the conduction band minimum (CBM) of the host material.These states are not populated and result from the charge transfer between Mo and the coordinating oxygen atoms, i.e., the oxidation of Mo.In fact, this impurity bands are mainly composed of Mo d-states.An important effect for the application on photocatalysis is the doping induced modification of the conduction band minimum potential, which is connected to the materials reduction power.We have found a negligible change of such potential indicating that there might be no improvement on the reduction power of the material following the substitutional doping.Actually, the localized state formed near the CBM may act as trapping states worsening the charge transfer mechanism during the chemical reaction. In Fig. 7(a) and (b), we show the density of states of the Cr-doped BiTaO 4 and BiNbO 4 , respectively.The characteristics are quite different from the one obtained for Modoped systems.In BiNbO 4 the impurity bands merge with the valence and conduction bands of the host material and there is a slight shift of the CBM potential increasing a little bit the reduction power.However, the effect is much stronger in the BiTaO 4 .In this system, the CBM potential is shifted by about 143 meV, which can be quite effective for improving the reduction power of the material.Besides that, the impurity bands are placed deeper in the conduction band what may diminish the trapping mechanism of the excited electrons.These results are consistent with our experimental observations.Considering both reactions, water reduction to produce hydrogen and isopropanol oxidation to yield CO 2 , the overall reaction can be described as follows: The theoretical stoichiometry ratio H 2 /CO 2 for Equation (1) is three.Among photocatalysts, only 1 CreBiNbO 4 and 1 CreBiTaO 4 have presented ratio near the theoretical value.However, for the best photocatalyst in relation to hydrogen production, 2 CreBiTaO 4 , this ratio is 35, which means isopropanol is not being totally mineralized in the evaluated time of reaction.Although, the theoretical calculation results confirm an improvement in the reduction power of the 2 CreBiTaO 4 , as a consequence of CBM potential shift, the experimental results suggest that VBM potential is inefficient to oxidize isopropanol completely under our reaction conditions, suggesting that the reaction can take place via hydroxyl radical.The photocatalytic dehydrogenation of aliphatic alcohols, such as methanol and ethanol, is mediated by hydroxyl radical via hydrogen abstraction of alpha carbon 14,15.In the case of the present work, the hydroxyl radical, formed by reaction represented in Equation (3), reacts with isopropanol giving rise the hydroxyisopropyl radical (4).Then, the hydroxyisopropyl radical reacts with photogenerated holes in the valence band of the photoexcited semiconductor, probably, yielding propanone (5) as the mean product.A proposed mechanism compatible with this discussion is presented below:"
  },
  {
    "title": "Conclusions",
    "content": "The citrate polymeric precursor method has proven efficient in the preparation of pure b-BiNbO 4 at mild temperatures as we could also verify in the preparation of b-BiTaO 4 in a previous work.However, the calcination temperature for the former was lower than for the last, 600 C and 800 C, respectively.The metal doping strongly influences the crystal structures of the oxides, while Cr(III) doping favors the triclinic structure, Mo(V) doping induces the orthorhombic structure.In both cases we observe an isomorphical replacement of Nb(V) and Ta(V) by metal doping without structure distortion.The photocatalytic activity evaluation showed the Cr(III)-doped oxides are more efficient for water reduction to hydrogen, while Mo(V)-doped oxides are more efficient for mineralization of organic compounds.The improvement in the reduction power of the Cr(III)-doped BiTaO 4 is justified by the CBM potential shift with the substitution of Cr on the cation-sublattice, confirmed by theoretical calculations. r e f e r e n c e s Fig. 1 e XRD patterns of the powders calcined at 600 C, 700 C and 800 C and ICSD patterns of a and b-BiNbO 4 . Fig. 2 e XRD patterns of pure and doped BiNbO 4 and BiTaO 4 : (a) and (b) Cr(III) doping and (c) and (d) Mo(V) doping. i n t e r n a t i o n a l j o u r n a l o f h y d r o g e n e n e r g y 3 9 ( 2 0 1 4 ) 1 2 2 0 e1 2 2 7 Fig. 3 e SEM micrographs of pure and Mo-and Cr-doped BiNbO 4 and BiTaO 4 . (a) and (b)) and Mo(V) (Fig. 2(b) and (c)) doped materials compared with a and b phase patterns. Fig.2(c) and (d) show the XRD patterns of pure and Mo(V)-doped BiNbO 4 and BiTaO 4 , respectively.Unlike Cr(III)doped BiNbO 4 and BiTaO 4 , the XRD patterns for Mo(V)doped BiNbO 4 and BiTaO 4 present the orthorhombic phase as predominant phase in both cases.At lower concentrations of Mo(V), 1 and 2, it is possible to detect the presence of b phase, which disappears when the concentration is increased to 3.In both cases the pure orthorhombic phase is obtained, without any molybdenum segregated phase.Therefore, the Mo(V) doping induces the orthorhombic phase while the Cr(III) doping favors the triclinic phase.The absence of chromium or molybdenum species in segregated phases, associated with the large similarity in the XRD patterns among pure and doped oxides, suggest an isomorphic replacement of metal doping without structure distortion.Since the ionic radii of Cr(III) and Mo(V), 75.5 and 75 pm, respectively, are quite similar to Nb(V) and Ta(V), both 78 pm, in an octahedral environmental, and are too different of Bi(III), 117 pm, the isomorphic substitution takes place in the octahedral sites of Nb(V) and Ta(V).The morphologies of the pure and metal doped oxides were depicted by SEM images.As shown in Fig.3the morphology of Fig. 6 e Density of states of the Mo-doped BiTaO 4 (a) and BiNbO 4 (b). Fig. 5 e Hydrogen, CO and CO 2 evolution over Cr(III) and Mo(V)-doped BiNbO 4 and BiTaO 4 photocatalysts (l 418 nm). Fujishima A, Honda K. Electrochemical photolysis of water at a semiconductor electrode.Nature 1972;238:37e8.2 Maia DLS, Pepe I, Silva AF, Silva LA.Visible-light-driven photocatalytic hydrogen production over dye-sensitized b-BiTaO 4 .J Photochem Photobiol A Chem 2012;243:61e4. Fig. 7 e Density of states of the Cr-doped BiTaO 4 (a) and BiNbO 4 (b). i n t e r n a t i o n a l j o u r n a l o f h y d r o g e n e n e r g y 3 9 ( 2 0 1 4 ) 1 2 2 0 e1 2 2 7 The authors acknowledge the Brazilian research funding agencies Conselho Nacional de Desenvolvimento Cient fico e Tecnolo gico (CNPq) and Fundac a o de Amparo a Pesquisa do Estado da Bahia (FAPESB) for financial support.The authors are also thankful to Laborato rio Multi-Usua rio de Microscopia Eletro nica da UFBA (LAMUME) for the SEM analyses."
  }
]