[
  {
    "title": "Doi",
    "content": "10.1016/j.mssp.2020.105082"
  },
  {
    "title": "Article_Title",
    "content": "Synthesis and characterization of graphene oxide - TiO2 thin films by sol-gel for photocatalytic applications"
  },
  {
    "title": "Abstract",
    "content": "Titanium dioxide modified with graphene oxide (GO/TiO 2 ) nanocomposite thin films were prepared on glass substrates by a sol-gel route using the dip coating technique for photocatalytic applications.The graphene oxide powders, fabricated through a modified Hummers' method, and the GO/TiO 2 thin films were characterized by electron microscopy, XRD, Raman and UV-VIS spectroscopy to evaluate their structural, morphological and optical properties.The energy bandgap estimated for the thin films is in the range of 3.38-3.45eV after an annealing at 450 C; while the transmittance and the Raman intensity decreased significantly by increasing the amount of GO.The photocatalytic activity of the GO/TiO 2 thin films, investigated by the blenching of methylene blue, showed a significant increment with the addition of GO; furthermore, the films exhibited potential applications in the photoreduction of CO 2 , in which a methanol production of 68.443 mol cm A 2 was observed after 5 h of reaction in the presence of UV light."
  },
  {
    "title": "Experimental",
    "content": "Graphite powder; titanium isopropoxide (97), hydrogen peroxide (50) and methylene blue were purchased from Sigma Aldrich; potassium permanganate (99.0) and sodium bisulfite from Meyer; ethanol (99.91), hydrofluoric acid (48-51), sulfuric acid (97.9) and phosphoric acid (85) from J. T. Baker; Chromotropic acid disodium salt dehydrate form ACS, reagent European Pharmacopoeia and deionized water.All chemicals were used without further purification. Graphene oxide (GO) was prepared by a modification of the Hummers' method 25.Briefly, 180 mL of H 2 SO 4 and 20 mL of H 3 PO 4 were mixed for 10 min, and it was added 1.5 g of graphite powder; this mix was under stirring for 2 h.Later, 9 g of KMnO 4 were gradually added, while the temperature of reaction was kept at 25 C, and the mixture was stirred for 1 h.Subsequently the mixture was heated at 35 C during 2 h.The resulting solution was diluted with 400 mL of deionized water, and later subject to cold bath for 1 h while it was stirred.The suspension was further treated with the addition of 7.5 mL of H 2 O 2 30 v/v, and it was mixed during 24 h.The final suspension of graphite oxide was washed several times with deionized water and ethanol, and separated by centrifugation in a Nahita Angle Rotor Centrifuge model 2660; this procedure was repeated until the pH of the solution became neutral.The material was dried at 65 C for 24 h and later it was ground in an agate mortar.At this point, the separated solid material is graphite oxide.Later, 0.25 g of graphite oxide were placed in 200 mL of deionized water, and it was introduced in an ultrasonic bath at 45 kHz (100 power, 25 C) for 4 h in an ELMA TI-H-5 device to obtain GO.Finally, the material was dried at 65 C and ground. The GO obtained was characterized by UV-VIS spectroscopy with a Thermo Scientific Genesys 10S spectrophotometer, and Raman spectroscopy with a Thermo Scientific DXR2 device equipped with a 635 nm laser as an excitation source.The structural properties were evaluated by X-ray diffraction with a Rigaku Miniflex device using a CuK radiation, 14 1.54056 A, a rate of 4 min A 1 with steps of 0.02 .The morphology of the GO was evaluated by transmission electron microscopy with a JEOL model JEM-1010 equipment working at 80 kV. The titanium dioxide-graphene oxide (TiO 2 -GO) thin films were prepared by the sol-gel technique.The precursor solution consisted of titanium isopropoxide, ethanol, hydrofluoric acid (with 4:32:0.1 M ratio respectively) and graphene oxide; the last one was added according to weight ratios to obtain a composition with 1, 3, 5 and 10 wt. of GO with respect to TiO 2 in the final powder product.The GO was sonicated for 45 min with half the volume of ethanol calculated and the HF, at 45 kHz (100 power, normal mode) in an ELMA TI-H-5 device.Later, the calculated titanium isopropoxide was added to the remaining ethanol, followed by the addition of the first solution prepared with the GO; this process was done under a nitrogen atmosphere, and with manual stirring to mix.Once the precursor solution was prepared, it was removed from the inert atmosphere, and was used to coat glass substrates, previously prepared, by dip-coating technique at a speed of 6 cm min A 1 .The coated substrates were dried at 250 C for 2 min.The process was repeated on the substrates for 5 times and the films were sintered in an air atmosphere for 1 h at 450 C. The sintered thin films were investigated by various characterization techniques.The optical properties of the films were studied with a UV-VIS Thermo Scientific Genesys 10S spectrophotometer.The crystalline structure was evaluated by X-ray diffraction (XRD) with an X'pert PRO diffractometer using CuK radiation of 14 1.5406 A, 45 kV, 20 mA, a rate of 0.08 s A 1 with steps of 0.04 in a grazing angle configuration; in addition, Raman spectroscopy was used to evaluated the structural properties with a Thermo Scientific DXR2 equipment equipped with a 445 nm laser as a source of excitement.Surface morphology and thickness images of the thin films were obtained by scanning electron microscopy (SEM) using a JEOL model JSM-6300 working at 2.0 kV. Photocatalytic degradation of an aqueous solution of methylene blue (MB) by TiO 2 -GO samples was investigated under simulated UV light at 25 C. A photocatalyst thin film samples (0.8 2.5 cm) were vertically dipped in 3.5 mL of a MB dye solution (2.5 10 A 5 molL A 1 ), inside a quartz cell, and illuminated with UV radiation using a Philips G15T8 (15 W, 14 251 nm) lamp at 4 cm of distance.The irradiation times were 1-5 h with 1 h steps.The residual concentration was quantified by UV-visible absorption spectrometry, using areas under curves from 418 to 750 nm, with a UV-VIS Thermo Scientific Genesys 10S spectrophotometer after calibration with external calibration standards (2 10 A 5 , 1.5 10 A 5 , 1.0 10 A 5 , 0.5 10 A 5 and 0.25 10 A 5 mol L A 1 ). The photocatalytic reduction of CO 2 was evaluated in a custom photoreactor.Briefly, 3 substrates coated with the TiO 2 -GO composite were placed in an open quartz cylindrical container (external diameter 14 3.7 cm, internal diameter 14 3.4, height 14 11.5 cm).The photocatalytic system was illuminated with a concentric arrangement of 3 UV lamps Philips G8T5 (8 W, 14 255 nm) located at a distance of 4 cm from the reactor.Within the reactor, 60 mL of deionized water (neutral pH) was added and a CO 2 bubble (20 psi) was supplied.A small aliquot liquid sample, 1 mL, was taken out at 5 h and its methanol concentration was analyzed following the NOM-142-55A1-1995.Methanol is oxidized to formaldehyde and subsequently transformed into a colorful compound using chromotropic acid; the concentration was quantified by UV-visible absorption spectrometry at 575 nm after calibration with external calibration standards (1.25 10 A 3 , 2.5 10 A 3 , 5.0 10 A 3 , 7.5 10 A 3 , 10.0 10 A 3 and 12.5 10 A 3 v/v methanol/water)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The optical properties of the obtained GO was investigated by UV-VIS spectroscopy and Raman Spectroscopy.Fig. 1 shows the UV-VIS absorption spectra of the synthetized GO and the graphite used as precursor, measured in water as solvent; a maximum absorption peak appears at 236 nm, which is ascribed to transitions of aromatic C-C bonds (sp 2 domains) 26272829.For the graphite case, the band for transitions appears at shorter wavelengths than those of the GO, at 224 nm, which means that the last one requires lower excitation energy.Additionally, a second band between 250 and 300 nm appears, associated with n transitions, which is less evident in the GO signal; this synthesis has an effect for shifting the absorption peaks in the UV-VIS spectra to lower energies from the graphite to the final product, indicating to be an effective procedure for obtaining graphene oxide. Fig. 2 shows the Raman spectra for the synthetized GO and the graphite used as precursor.The spectrum of graphite shows a strong band at 1577 cm A 1 , called G band, which correspond to first order scatterings of the E 2g modes.The symmetry of the E 2g modes restricts the motion of the atoms to the plane of the carbon atoms; this is due that hexagonal graphite has a crystal structure built up of flat layers, in which the trivalent carbon atoms occupy the lattice sites of a two-dimensional honeycomb network 29.The G band also appears in the GO Raman spectrum, it has a lower intensity and a considerable widening of the band in comparison with graphite, but the signal are shifted to 1589 cm A 1 ; the presence of this band in the GO can be attributed to the existence of C sp 2 , although the domains of this hybridization are smaller compared to graphite. The graphite also presents a small band at 1360 cm A 1 , known as D band, which is attributed to the presence of defects on the graphitic material 30.This band is more evident in the GO, as it was expected due the graphene oxide is an oxidized form of graphene, but it appears at 1364 cm A 1 ; moreover, the D band in the GO has an intensity comparable to the G band, that suggests a considerable increase in sp 3 domains and other types of important defects such as vacancies, bond-angle disorder, edge defects, etc.Another important bands are the small 2D peak and the D' band found at 2745 cm A 1 and 2900 cm A 1 respectively; the first one correspond to an overtone of the D band, and the second band is used to evaluate structural parameters of the c-axis orientation, sometimes these bands are considered as equals but appears at different positions 2728293031. Additionally, using the Raman spectra, the disorder degree in graphitic materials is commonly measure from the relationship between of the D and G bands, I D /I G , 0.073 and 0.858 for graphite and GO respectively.The average crystallite size of the sp 2 domains in the GO could be calculated using the I D /I G ratio in diverse models 303132.Applying the Cancado model for nanographitic systems of equation ( 1), where L a is the average crystallite size of the sp 2 domains and l is the input laser energy 32, 131.69 and 13.45 nm are obtained for graphite and GO, respectively, as the average size of the C sp 2 domains; a significant reduction of the C 14 C bonds is expected, these values show the great degree of oxidation achieved in the GO from the synthesis. The X-ray diffraction patterns of graphite and raw GO are shown in Fig. 3.The GO exhibits a peak at 2 14 10.1 , that correspond to the (001) plane with inter-planar spacing of 0.875 nm; and the graphite shows a strong peak at 26.58 , which corresponds to the (002) plane according to the crystallographic chart ICCD -PDF00-041-1487, and has an interplanar distance of 0.335 nm.Some of important data extracted from diffraction patterns are presented in Table 1.The change on the interplanar distance is attributed to the oxidation of the material and the exfoliation of the layers, which indicates an effective obtaining of GO.The full width at half maximum (FWHM) of the main diffraction peaks has increased after the reaction, which gives the GO a lower crystallinity, that means that the number of sheets that integrated the material has decreased. The surface morphology of the synthetized GO was analyzed using transmission electron microscopy (TEM) as shown in Fig. 4. In the preparation of GO samples for TEM, a material sample was sonicated in deionized water using the same ultrasound time as that used to prepare the GO/TiO 2 thin films at 45 kHz (100 power, normal mode) in an ELMA TI-H-5 device.The sample has a sheet like morphology with different transparencies, possibly due to the amount of layers present in the stacked structure of the GO, and the size of the GO sheets obtained varies between 0.5 to 2 m.It can also be observed that the sheets are not completely flat, since they present folds probably due to the existence of sp 3 hybridization carbons that constitute the hydroxyl or epoxy groups of the graphene oxide, which has been observed by other authors as Tuinstra and Koening 29.The characterization by Raman spectroscopy demonstrated the above statement, since the D band is attributed to C sp 3 species and it also appears in the graphene oxide. Fig. 5 shows the UV-VIS spectrophotometry transmission spectra for the GO/TiO 2 thin films synthetized with different in weight of GO.All the samples have a transmittance greater than 65 with an abrupt absorption edge at 350 nm approximately, as was reported previously 33.It can be noted that GO has an influence on the optical properties of TiO 2 ; if a greater amount of GO is added in the synthesis, then a decrease in the transmittance of the thin films and a shift at lower wavelengths is detected.The last shift is observed from the signal at 445 nm for pure TiO 2 up to 375 nm for the modified one with 10 of GO.The optical band gap of the thin films was calculated using the Tauc's model, equation ( 2), as follows: Where is the extinction coefficient, h is the Planck's constant, is the light frequency (s A 1 ), A is the absorption constant and E g the optical energy bandgap of the material 34.The relation of (h) 1/2 and the photon energy h was plotted and the bandgap of TiO 2 can be determined by fitting the linear part of the plot, as shown in Fig. 6. From Fig. 6, the optical band gap energy, E opt g , for TiO 2 , 1, 3, 5 and 10 wt.GO/TiO 2 are 3.42 0.01, 3.45 0.01, 3.44 0.02, 3.43 0.01 and 3.38 0.02 eV, respectively; here, we take the standard error from the fitting software origin as the fitting uncertainty.It can be seen that as the GO percentage increases the band gap of the thin films decreases; for 10 wt. of GO content, the band gap decreases from 3.42 eV to 3.38 eV from the material in its intrinsic form. Raman spectroscopy was used to help to identify the phase composition.Fig. 7 shows the Raman spectra for the thin films of TiO 2 modified with different amounts of GO.All the samples correspond to anatase phase, according with Ohsaka et al. 35, without presence of microphases like rutile or brookite.All samples have similar peaks for symmetrical stretching vibration (E g ) at 143.35 cm A 1 and 636.10 cm A 1 , symmetrical bending vibration (B 1g ) peaks at 396.95 cm A 1 and antisymmetrical bending vibration (A 1g ) peaks at 516 cm A 1 of O-Ti-O in the TiO 2 system.These signals match well with previously reported works 34,363738.With the addition of GO in the system there is no modification in Raman shift of the thin films nor in the Full Width at Half Maximum (FWHM) of the most intense signal, first E 1g signal; 11.68 cm A 1 for all the thin films, except for 3 wt.GO/TiO 2 with a FWHM of 15.36 cm A 1 .However, as the concentration of GO increases in thin films, Raman intensity decreases considerably.Using their FWHM, the phonon lifetime, , can be estimated by using the energy-time uncertainly relation in equation ( 3): where E represents uncertainly in the energy of the phonon mode, h ( 14 h/2) denotes the Planck's constant, c is the speed of light and is the FWHM of the Raman peak in cm A 1 36; the phonon lifetimes calculated for E 1g mode at 143.35 cm A 1 are 0.45 (TiO 2 pure), 0.46 (1 wt.GO/TiO 2 ), 0.35 (3 wt.GO/TiO 2 ), 0.46 (5 wt.GO/TiO 2 ) and 0.45 (10 wt.GO/TiO 2 ) ps.The phonon lifetime in the TiO 2 only shows a remarkable decreasing value in the 3 wt.GO/TiO 2 thin film; this reduction is due to an effect of GO modifying that leads to suppressing the crystallite growth.Fig. 8 shows the XRD results of 5 wt.GO/TiO 2 and 10 wt.GO/ TiO 2 thin films.The XRD results confirm that the GO/TiO 2 thin films exhibit a tetragonal crystal structure with a single anatase phase, according to the crystallographic chart ICCD -PDF 78-2486; these results confirm the Raman spectroscopy analysis.The diffractogram signals for these samples are noisy, this is attributed to the thin layer of deposited material (200 and 400 nm respectively), and they also have a very narrow signal along most of the diffractogram, which corresponds to the substrate used (amorphous SiO 2 ).The (101) plane is the preferential crystal growth orientation with small signals of (004), ( 200), (105), ( 211) and (204) planes.From XRD patterns, the FWHM of the (101) plane was used to estimate the crystallite size using the Sherrer formula 38; the crystallite size for 5 and 10 wt.GO/TiO 2 thin films was 15.28 and 12.52 nm respectively.Compared to previous works, especially with May en et al. 33 since the synthesis of thin films is very similar, the crystalline sizes obtained herein were much smaller; according to Phan et al. 39, this reduction in crystalline size demonstrates that the presence of GO inhibits the growth of TiO 2 nanoparticles.There was no GO peak in the XRD patterns of any of the composite thin films owing the small concentration; this indicate that the presence of graphene oxide did not affect the structural changes.From the Bragg's law, their (101) inter-planar distance was 3.52 and 3.51 A, respectively.Okhavan and Ghaderi further detail the interaction between anatase and GO in thin films through XPS measurements after a sintering treatment at 400 C 40. The thickness and the surface morphology of samples were measurement using scanning electron microscopy (SEM).Fig. 9 shows the transverse and surface SEM images of the thin films of the 5 wt.GO/TiO 2 (a, btaken at 30000X and 100000X respectively) and 10 wt.GO/TiO 2 (c, dtaken at 50000X and 100000X respectively) composites.Fig. 9a andc shows the transverse section of the composite films, the thickness of the films is close to 360 nm and 200 nm for 5 and 10 wt. of GO respectively.Fig. 9b and d displays a homogeneous and compact surface morphology in most of the thin film with aggregates of irregular and semi-oval shapes; the particle sizes of the samples are close to 50 nm according to their histograms obtained by treating the micrographs with the ImageJ program (Fig. 9).Since the aggregates formed are compact, the films have a mesoporous structure because the size of these particles is between 40 nm and 100 nm.All the films were free of cracks and had excellent adherence to the substrate.It is well known that mesoporous materials increase the interactions between atoms, molecules, ions and nanoparticles; thus increasing the interaction between the contact surface and the bulk material 33. The photocatalytic performance of the GO/TiO 2 thin films, with different amounts of GO, was evaluate through the photoblenching of MB in an aqueous solution; all the samples were tested to the same conditions under UV light.The remaining concentration of MB after 5 h of reaction are shown in Fig. 10.The best performance in the photocatalysis reaction was obtained using the thin films with small amounts of GO, 1 and 3; these films photodegraded 92 of MB in almost 5 h with UV light.The degree of MB degradation was in the order 1-3 5 10 TiO 2 pure, according to the amounts of GO on the TiO 2 respectively.These results suggest that only small amounts of graphene oxide in titanium dioxide can improve their photocatalytic activity under the UV range.A lower MB degradation performance is observed with 5 and 10 wt.GO/TiO 2 thin films compared to composites modified with small amounts of GO; this behavior can be associated to an overhigh concentration of GO that reduces the light absorption by TiO 2 resulting in a decrease of the photoactivity, as explained by Kusiak-Nejman and Morawski 41.Referring to the X-ray diffraction results, in which a high amount of GO in the precursor solution limits the growth of crystals of TiO 2 , the photocatalytic activity of the composite will be in function of the TiO 2 crystal size of the sample; and it will only be improved by small added amounts of GO. Comparatively, Marchetti et al. 42 reported the synthesis of a composite of a monolayer graphene film modified with a TiO 2 thin film grown by atomic layer deposition.The photocatalytic activity of this composite was investigated by the degradation of methyl red under a solar simulator with an irradiation power of 1 kW m A 2 ; after 5 h of reaction the TiO 2 /graphene (1125 ALD cycles) composite shows almost a 90 of Abs/Abs 0 of methyl red, a value very similar to that recorded in this work.Cantarella et al. 43 synthetized a TiO 2 -based photocatalyst modified with SWCNTs (single wall carbon nanotubes) and immobilized in PMMA by sonication and solution casting.They registered a MB degradation of almost 65 with a PMMA/TiO 2 NPs 15 wt./SWCNTs composite, after 4 h of reaction and using a 8W UV lamp ( max 14 368 nm); In this work, almost 80 of MB removal is reported using a 1 or 3 wt.GO/TiO 2 thin film composite in 4 h of reaction. The photodegradation of MB follows a kinetic model of first order: where C and C 0 are the concentration at each interval of time and the initial concentration, respectively, k is the rate constant and t is the time of irradiation.Fig. 11 shows a plot of ln(C/C 0 ) versus t, and it can be used to obtain the rate constant from eq. ( 4) as the slope (m) of a linear equation.The rate constant are 0.038 h A 1 (photolysis), 0.153 h A 1 (TiO 2 pure), 0.446 h A 1 (1 wt.GO/TiO 2 ), 0.492 h A 1 (3 wt.GO/TiO 2 ), 0.274 h A 1 (5 wt.GO/TiO 2 ) and 0.209 h A 1 (10 wt.GO/TiO 2 ) respectively; also it can be noted that the 1 and 3 GO/TiO 2 thin films have the highest rate constants. The photocatalytic activities of all the prepared samples were also evaluated for the conversion of CO 2 in an aqueous medium to methanol under UV light irradiation.The performance of GO/TiO 2 thin films on CO 2 photoreduction is shown in Fig. 12.In contrast to MB photobleaching, CO 2 photoreduction results indicates that methanol yield increased as the amount of GO is greater in thin TiO 2 films: TiO 2 pure (7.94 ).Combining graphene oxide with semiconductors to form a composite photocatalyst can extend the light absorption edge, improve the migration rate of charge carries and enhanced the absorption capacity of diverse molecules 20; the above is demonstrated in the increase on the photocatalytic conversion of CO 2 to methanol by increasing the concentration of GO in the semiconductor matrix.Some authors suggest that the photocatalytic performace can be improved by basifying the reaction medium, since at high pH the solubility of CO 2 increases 19; therefore the water media must be basified to generate a greater retention of CO 2 in the reaction medium and increase the methanol yield. There is a large number of studies reported on the growth of thin films of TiO 2 -based composites, although their studies on CO 2 photoreduction are more limited.Fresno et al. 44 synthesized TiO 2 thin films by DC magnetron sputtering, studying the effect of surface density on the CO 2 photoreduction in a 280 mL gas reactor with 4 UV lamps of 6W ( max 14 365 nm); they obtained a maximum methanol yield of 0.933 mol h A 1 g cat A 1 (16.8 mol g cat A 1 in 18 h of reaction) in a sample with a TiO 2 area density of 0.23 cm A 2 .In the present work the methanol yield was higher than in the work of Fresno et al. (i.e. 12.69 mol h A 1 cm A 2 cat instead of 0.933 mol h A 1 g cat A 1 ). Wang et al. 45 studied the effect of Pt NPs deposited by (TTS) sputtering on TiO 2 thin films obtained by ACVD.In the CO 2 photoreduction they used a 400W Xe lamp (UV range of 250-388 nm) in a CO 2 /water gas medium; with the compound and reactor used, high selectivity towards CH 4 was recorded and they reached a peak value at 1361 mol h A 1 g cat A 1 in 5 h of reaction.There is a lower production in this manuscript compared to the work of Wang et al., however, the impact of the use of higher power lamps for the CO 2"
  },
  {
    "title": "Conclusions",
    "content": "In this work the synthesis of TiO 2 thin films modified with graphene oxide (GO/TiO 2 ) is proposed through a sol-gel route using a dip-coating deposition technique.The spectroscopic analysis confirms the successful obtaining of graphene oxide after the modification of the Hummers' method.According to the TEM, the graphene oxide shows a sheet like morphology with sizes between 0.5 and 2 m; the DRX results confirm the exfoliation of the sheets and show the loss of crystallinity of the material referred to the stacking size of those sheets.The samples presented a transmission greater than 65 in the visible region and bandgaps between 3.45 and 3.38 eV; the lower bandgap was obtained for a TiO 2 thin film modified with 10 wt. of GO.In the Raman spectroscopy and DRX results, an anatase structure of TiO 2 was observed, with a crystalline size close to 15 nm; no presence of other phases such as rutile or brookite was detected.The SEM analysis shows a mesoporous surface of irregular aggregates of semi-oval form.The photocatalytic performance of GO/TiO 2 thin films with different amounts of GO, in a photoinduced process, was influenced by their optical properties and the graphene oxide.Through a photocatalytic reduction of CO 2 , a maximum methanol yield of 63.443 mol cm 2 cat was achieved after 5 h of reaction for a TiO 2 thin film modified with 10 wt. of GO.The results obtained with this composites, compared to similar TiO 2 -based thin film composites, shown an excellent photocatalytic behavior in the reduction of CO 2 ; this study provided the experimental basis for future research on photocatalysts with solar energy applications. Fig. 1.UV-VIS absorption spectra of graphite and graphene oxide. Fig. 2. Raman spectra of graphite and graphene oxide. Fig. 3. XRD patterns of graphite and graphene oxide. Fig. 4. Transmission electron microscopy images of graphene oxide. Fig. 5. Transmittance spectra for the thin films of GO/TiO 2 . Fig. 8. XRD patterns of 5 wt.GO/TiO 2 and 10 wt.GO/TiO 2 thin films. Fig. 10.Photoblenching activity of GO/TiO 2 thin films.Fig. 11.Time dependent photocatalytic degradation ratio. Fig. 12.Total methanol yield reached over the GO/TiO 2 thin films. Crystallographic data for graphite and graphene oxide. mol h A 1 cm 2 cat ) 3 wt.GO/TiO 2 (9.06 mol h A 1 cm 2 46oreduction process is remarkable (i.e. 3 8W UV lamps in this work instead a 400W UV lamp for Wang et al.).Meng et al.46reported that the TiO 2 -MnO x -Pt composite, obtained by a hydrothermal method and modified by photodeposition, shows an improve yield in CH 4 and CH 3 OH in the CO 2 photoreduction with a 350W Xe lamp.They reported a yield of 104 and 91 mol m A 2 cat of CH 4 and CH 3 OH respectively after 3 h of reaction (i.e. 0.0035 and 0.003 mol h A 1 cm A 2 cat of CH 4 and CH 3 OH); these values are below those obtained in this work.The merit of GO/TiO 2 thin films obtained by sol-gel compared to TiO 2 -base thin film composites obtained by various physical and chemical deposition techniques is evident, which are attractive in photocatalytic applications. Authors are grateful for technical support and facilities at Universidad Aut onoma de Quer etaro (UAQ) and Universidad Nacional Aut onoma de M exico (UNAM) Campus Juriquilla, CFATA, as well as the Mexican National Research Council CONACYT (M exico) for the scholarship of Arturo Velasco-Hern andez.We would also like to thank the technical staff and advisors of UNAM campus Juriquilla: Lourdes Palma Tirado (Instituto de Neurobiologia) for TEM micrographs, Marina Vega Gonz alez (Centro de Geociencias) for DRX measurements; and the technical staff of CINVESTAV Zacatenco: M. en C. Adolfo Tavira Fuentes (Departamento de Ingenieria El ectrica) for DRX measurements and Angel Guill en Cervantes (Departamento de Fisica) for the SEM micrographs. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper."
  }
]