[
  {
    "title": "Doi",
    "content": "10.1016/j.catcom.2014.04.024"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic CO2 reduction in gas–solid regime in the presence of H2O by using GaP/TiO2 composite as photocatalyst under simulated solar light"
  },
  {
    "title": "Abstract",
    "content": "GaP/TiO 2 composites exhibited a remarkable photocatalytic activity for CO 2 reduction in the presence of water vapor producing methane.By decreasing the GaP:TiO 2 mass ratio an increase in the photocatalytic activity of the composite was observed for up to a 1:10 mass ratio.The photocatalytic activity of the composite can be attributed to the band structures of the solids as well as to the efficient charge transfer between GaP and TiO 2 heterojunction."
  },
  {
    "title": "Experimental",
    "content": "Commercial TiO 2 Evonik P25 and GaP Aldrich powders were used as the starting materials to obtain GaP/TiO 2 powders, prepared by mechanically milling both solids with a Retsch RM200 mortar grinder provided with grinding tools in agate that mixed and triturated by pressure and friction with a speed of 100 rpm at room temperature.0.5 g of GaP, as commercial pellets, was first finely grinded for 20 min.Subsequently ca.0.1 g of Degussa P25 TiO 2 powder was added to the GaP powder and both solids were again grinded for 10 min before the addition of other aliquots of TiO 2 until the needed total amount of TiO 2 was achieved.The samples contained a mass ratio GaP:TiO 2 in the range 10:1 to 1:20 and were labeled as GaP/TiO 2 preceded by the GaP:TiO 2 mass ratio.Moreover Pd and Pt-loaded GaP/TiO 2 samples with different noble metal contents were also prepared with the aim to increase the reactivity.Two sets of samples were obtained by following two methodologies, i.e. by depositing the noble metal on the 1:10-GaP:TiO 2 composite or on the bare GaP before mixing with TiO 2 to obtain the 1:10-0.2(Ptor Pd)-GaP:TiO 2 samples (see ESM for details).Some characterization techniques have been used to better understand the features of the composite materials (see ESM). The photocatalytic CO 2 reduction was carried out in a gas-solid Pyrex batch photoreactor of cylindrical shape (V 100 mL, 94 mm, height 15 mm) containing the photocatalyst (0.3 g) dispersed as a thin layer.In this tightly closed reactor the desired water amount (3 L for most of the runs, corresponding to 1.7 10 -3 M) was injected by a microsyringe after purging with ultrapure CO 2 for 60 min under dark conditions at room temperature (CO 2 concentration 4.2 10 -2 M).Some selected runs were carried out by using the maximum amount of water that can be vaporized in the photoreactor under the used experimental condition, i.e. 1.1 10 -2 M (injection of 20 L of liquid water). The photoreactor was horizontally positioned and illuminated from the top inside a SOLARBOX apparatus (CO.FO.ME.GRA.)equipped with a solar light simulating lamp (1500 W high pressure Xe lamp).The set-up of the photoreactivity system is shown in Scheme 1.The maximum temperature reached inside the reactor was ca.70 C.The irradiance reaching the photocatalyst (measured by UVX Digital Radiometer) was 1.0 mW cm -2 in the 315-400 nm range, and 100 mW cm -2 in the 400-950 nm range.The runs lasted ca.48 h and the reacting fluid was analyzed by withdrawing gas samples from the photoreactor with a gas-tight syringe.The evolution of the reaction was followed by gas chromatography (see ESM for details).The possible presence of products deriving from C impurities was checked by treating the GaP/TiO 2 composites under irradiation (before the photoactivity experiments in the presence of CO 2 ) with a flow of humid He according to Strunk et al. 13, which allowed also to clean the surface.Notably only insignificant amounts of CH 4 (less than 0.1 M) were observed during the treatment."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Table 1 reports the B.E.T. specific surface area (SSA) of the samples.Bare commercial GaP and TiO 2 show SSAs of 2 and 50 m 2 g -1 , respectively.The presence of GaP in the samples gave rise to a decrease of the SSA.EDX mapping analysis confirmed the nominal GaP:TiO 2 mass ratio, although the content of the two components in the agglomerates was not always constant, and this finding pointed to a certain inhomogeneity of the materials.Notably when Pt or Pd were present in the samples it was not possible to detect them by EDX due to their low amount.Diffuse reflectance spectra (DRS) spectra were used to determine the band gap energy of GaP, 2.3 eV, and TiO 2 , 3.0 and 3.2 eV, containing anatase and rutile polymorphs, respectively, in agreement with literature data (see ESM for characterization details). Blank tests indicated that no organic compounds were produced in the absence of catalyst as well as under dark conditions.Both bare TiO 2 Evonik P25 and GaP were inactive for CO 2 reduction in our experimental conditions also in the presence of light and H 2 O. On the contrary, the presence of methane was observed during the photocatalytic tests in the presence of cleaned GaP/TiO 2 composites.By increasing the TiO 2 content, methane increased reaching a maximum value by using the 1:10-GaP/TiO 2 sample.A further increase of TiO 2 caused a decrease in methane production.No reactivity was observed for the 1:20-GaP/TiO 2 sample.Other organic molecules different from CH 4 were absent in the photoreactor, at least in amounts comparable to the main product.The presence of CO was also checked but excluded probably because its concentration was below the analytical detection limit.The maximum activity for 1:10-GaP/TiO 2 sample can be attributed to an optimum coverage that allowed an optimal light activation of both components.Noticeably, the SSA (45 m 2 g -1 ) of the 1:10-GaP/TiO 2 sample is only slightly lower with respect to that of the bare TiO 2 , whereas the low SSAs of the 1:1-GaP/TiO 2 and the 10:1-GaP/TiO 2 samples (15 m 2 g -1 and 7 m 2 g -1 , respectively) can severely limit their photocatalytic activity. Fig. 1 shows methane concentration versus irradiation time for runs carried out under different experimental conditions by using both bare and Pt-or Pd-loaded 1:10-GaP/TiO 2 samples. The maximum concentration of methane, 118 M per gram of catalyst, was obtained by using the 1:10-GaP/TiO 2 sample after 10 h of irradiation in the presence of 1.7 10 -3 M water concentration.Methane production was of the same order of magnitude or higher with respect to values previously reported in literature under various irradiation conditions 14. Nevertheless, in the present work CH 4 concentration reached a plateau and remained constant in the reaction system even after 48 h of irradiation.The plateau can be due to a partial catalyst deactivation (the catalytic activity was lower, ca.30 after reusing twice the photocatalysts) and to the fact that O 2 was also produced from water oxidation during the formation of CH 4 .O 2 could efficiently trap electrons preventing CO 2 reduction giving also rise to the reoxidation of CH 4 to CO 2 .In this way a sort of equilibrium was reached. It is worth noting that the formation of O 2 was detected, by GC analysis, during the photocatalytic reaction although it was not quantified. As shown in Fig. 1, an increase of water concentration gave rise to a more rapid achievement of the plateau, but its value was lower than that observed in the presence of smaller concentrations of H 2 O. The maximum amount of methane decreased when the GaP/TiO 2 samples were loaded with Pt or Pd. In particular, samples loaded with 1 of Pt or Pd on the 1:10-GaP: TiO 2 composite showed a negligible activity, whereas methane concentration began to decrease after ca. 10 h in the presence of 0.2 of noble metal, suggesting that the oxidation reaction could take place in a higher extent with respect to the bare composite samples. In order to explain the photoreactivity of the various samples, we should consider that, from a thermodynamic point of view, the reduction of CO 2 requires that the bottom energy level of the conduction band of the semiconductor is lower than the reduction potential of the various processes leading to products of CO 2 reduction.Fig. 2 shows the alignment of the conduction bands of anatase 15, rutile 16 and GaP 5,8 with the reduction potentials of the CO 2 /CH 4 couple 17.The reduction of carbon dioxide to methane is the most thermodynamically favorite process among all the possible ones 18. A perusal of Fig. 2 shows that the potentials of the CB in TiO 2 rutile and anatase are only slightly lower than that of the CO 2 /CH 4 couple.This could justify why the TiO 2 sample was inactive for the CO 2 reduction, also considering the CO 2 overpotential that we did not quantify in the current experimental conditions but that was always present.On the contrary, the potentials of the VB of the two TiO 2 polymorphs are higher enough to oxidize water to O 2 .The CB potential of GaP, instead, is suitable for CO 2 reduction to CH 4 but the potential of VB does not allow water to be oxidized, and consequently this could justify why bare GaP was inactive for CO 2 photoreduction.By considering the relative position of CB and VB of both TiO 2 and GaP, the two semiconductors can be coupled with the aim to obtain a cooperative photo-redox process. The photoproduced (UV light) electrons in the CB of TiO 2 can be trapped by the photoproduced (visible light) holes in the VB of GaP (see Fig. 2).This mechanism works separating efficiently the holes in the VB of TiO 2 from the electrons in the CB of GaP, making water oxidation and CO 2 reduction possible.The circuit is closed analogously to what reported in the so-called Z-scheme 19. SEM analyses (see ESM) support the hypothesis above presented to explain the highest photocatalytic activity of 1:10-GaP/TiO 2 sample and the inactivity of the 1:20-GaP/TiO 2 sample.In fact, it can be noticed that GaP is not completely in contact with TiO 2 in the samples containing an amount of TiO 2 lower than that present in the 1:10-GaP/TiO 2 sample where GaP is in full contact with TiO 2 , whereas in the 1:20-GaP/TiO 2 sample the high amount of TiO 2 on GaP does not allow light to reach satisfactorily the GaP surface.In order to explain the behavior of the of Pt-and Pd-loaded samples, we consider that when the noble metals are deposited on the 1:10-GaP/TiO 2 sample they are mainly present onto the TiO 2 surface, trapping the photoproduced electrons and inhibiting the GaP role as an electron sink.On the contrary, for the 1:10-0.2Pt-GaP/TiO 2 and 1:10-0.2Pd-GaP/TiO 2 samples, where Pt or Pd are mainly deposited on GaP, two contrasting effects can occur: the noble metals can favor the CO 2 reduction as they favor trapping of electrons in the CB of GaP but at the same time more holes are available in the VB of TiO 2 and this phenomenon can produce the re-oxidation of CH 4 to CO 2 as observed after 10 h of irradiation (see Fig. 1), reducing the global efficiency of the process."
  },
  {
    "title": "Conclusions",
    "content": "The photocatalytic reduction of CO 2 has been performed with various GaP/TiO 2 photocatalysts mechanically prepared by mixing commercial GaP Aldrich and TiO 2 Evonik P25.Both bare GaP and TiO 2 samples resulted completely inactive, whereas the GaP/TiO 2 composites gave rise to the reduction of CO 2 mainly to CH 4 .The extent of photoactivity depended on the amount of GaP with respect to TiO 2 , with a maximum CH 4 formation observed for the 1:10 GaP/TiO 2 sample.Higher or lower amounts of GaP were detrimental.The presence of 1 or 0.2 of Pd or Pt on the surface of the most photoactive GaP/TiO 2 sample (ratio 1:10) was also detrimental.These composite GaP/TiO 2 materials prepared in a very simple way appear to be promising new candidates for reduction of CO 2 in the presence of H 2 O. Scheme 1. Set-up of the photoreactive system: (A) Solarbox; (B) lamp; (C) photoreactor; (D) powdered photocatalyst; (E) gas-tight syringe. Fig. 1.Methane concentration per gram of photocatalyst during CO 2 reduction under different experimental conditions: () 1:10-GaP/TiO 2 (3 L H 2 O); () 1:10-GaP/TiO 2 (20 L H 2 O); () 1:10-0.2Pt-GaP/TiO 2 (3 L H 2 O); () 1:10-0.2Pd-GaP/TiO 2 (3 L H 2 O). Fig. 2. Relationship between the band structures of TiO 2 and GaP and the reduction potentials (versus NHE at pH 7) for the most favorite processes of oxidation and reduction. Maximum methane concentration found in the CO 2 reduction photocatalytic runs (water amount 1.7 10 -3 M). G. Marci et al. / Catalysis Communications 53 (2014) 38-41 The authors wish to acknowledge MIUR for the economical support (PON0102257). Appendix A. Supplementary data Supplementary data to this article can be found online at http://dx. doi.org/10.1016/j.catcom.2014.04.024."
  }
]