[
  {
    "title": "Doi",
    "content": "Doi not found"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic reduction of carbon dioxide using [fac-Re(bpy)(CO) 3 (4-Xpy)] (Xpy pyridine derivatives)"
  },
  {
    "title": "Abstract",
    "content": "Photocatalytic reduction of CO 2 using fac-Re(bpy)(CO) 3 (4-Xpy) bpy 2,2 H -bipyridine, py pyridine, X tert-Bu, Me, H, MeCO, CN in a triethanolamine (TEOA)dimethylformamide (DMF) solution was examined.The quantum yields for CO formation were almost identical for each (0.03 to 0.04), except for the 4-CNpy complex.Irradiating the solutions caused ligand substitution of these complexes with solvent molecules to produce fac-Re(bpy)(CO) 3 (TEOA) and fac-Re(bpy)(CO) 3 (DMF) , followed by formation of the formate complex fac-Re(bpy)(CO) 3 OC(O)H, which acts as the real catalyst for CO formation.On the other hand, the much higher CO formation ability observed for the 4-CNpy complex (quantum yield for CO formation 0.13) was due to the participation of the cyano complex fac-Re(bpy)(CO) 3 CN, which is converted from the 4-CNpy complex during irradiation.The photochemical substitution of the initial complexes with the solvent molecules is very rapid (quantum yields 1).This phenomenon is explained by a chain mechanism."
  },
  {
    "title": "Experimental",
    "content": "All reagents and solvents were of high purity and were commercially available from Kanto Chemical Co. and Aldrich Chemical Company.The solvents TEOA and DMF were distilled under reduced pressure and kept under an argon atmosphere.The complex fac-Re(bpy)(CO) 3 -(MeCN)SbF 6 was prepared by a reported method 4.The complex fac-Re(bpy)(CO) 3 (4-Xpy)SbF 6 was synthesized using a procedure analogous to the reported method for fac-Re(bpy)(CO) 3 (py)PF 6 4, with some modications as follows.The MeCN complex fac-Re(bpy)(CO) 3 (MeCN)SbF 6 (0.20 g, 0.28 mmol) and a 50-fold molar excess of the appropriate 4-Xpy ligand were dissolved in THF (50 ml).The solution was heated at re ux under an argon atmosphere for 8 h in dim light.After cooling to room temperature, the solution was evaporated to dryness and recrystallized from MeCN-Et 2 O or CH 2 Cl 2 -Et 2 O to give fac-Re(bpy)(CO) 3 (4-Xpy)SbF 6 .The purity of these complexes was checked by elementary analysis, IR ( CO ) and ES-mass spectra (summarized in Table 1). A high pressure Hg lamp (500 W) with a band pass lter (365 nm) was used to produce 365 nm monochromatic light.Neutral density (ND) lters were added to the irradiation system to adjust light intensity.The incident light intensity was determined by a K 3 Fe(C 2 O 4 ) 3 actinometer.A TEOA DMF (1 : 5, v/v) solution (4 ml) containing the complex was placed in an 8 ml cubic quartz cell.The solution was purged with CO 2 for 20 min, then sealed with a rubber septum (Aldrich).Finally, the sample solution was irradiated while stirring at 208C.In all runs, the stirring speed was kept constant. Emission lifetimes of the complexes and the TEOA quenching rate constants were measured using the previously reported ash photolysis technique 710.In situ UVVis spectra were measured by a Photal MCPD-1000 spectrometer connected by optical ber to the reaction cell.We used a reversed-phase HPLC system consisting of a JASCO PV-980 pump, a Nakalai 5C18-ODS column, a JASCO UV-970 detector (wavelength: 360 nm) and a Rheodyne 7125 injector.The mobile phase was a mixture of MeOH and KH 2 PO 4 NaOH buffer (0.05 M, pH 5.9).Positive-ion ES mass spectra of the reaction solutions were measured following a previously reported procedure 13,14.The drift voltage was set at 10 V, where no fragment ions were detected.The CO produced was analyzed with a Yanaco G-3800 gas chromatograph using an active carbon column (2 m) and a thermal conductivity detector."
  },
  {
    "title": "Results_and_Discussion",
    "content": "All of the complexes presented here had an absorption maximum around 340 to 350 nm.The absorption bands were solvent sensitive; a red-shift was caused by changing from a polar to less polar solvent.This phenomenon is often observed in the metal-to-ligand charge transfer (MLCT) absorption of metalpolypyridine complexes, including other rhenium-bpy complexes 312, 15,16.A broad emission of around 540 to 550 nm was observed from the 3 MLCT excited state at room temperature.The photophysical properties of these complexes (summarized in Table 2) were similar to those for other reported rhenium-bpy complexes312, 15,16.As for the effect of the pyridine substituents on the absorption and emission properties, an increase in the electron accepting strength of the substituent caused shorter MLCT absorption and emission wavelengths (! MLCT and !em ).This tendency indicates that an electron should locate on the bpy ligand, but not on the 4-Xpy ligand in both the singlet and triplet MLCT excited states of these complexes.Comparing the emission lifetimes (( em ) observed here in MeCN with those of some complexes in CH 2 Cl 2 16, the values in CH 2 Cl 2 are about twice those in MeCN.This agrees well with the tendency observed for fac-Re(LL)(CO) 3 Cl (LL bpy, phenanthroline) 3.The shorter ( em in the more polar solvent is attributed to an increase in non-radiative decay rate from the excited state. The t em values increase with a decrease in l em .This fact is consistent with the energy gap low 4; an increase in the energy of an excited state decreases its non-radiative decay rate. It has been reported that emission from some rheniumbpy complexes having pyridine-derivative ligands is quenched by oxygen 16.However, there have been no reports of the reductive quenching of these excited states.Fig. 1 shows a SternVolmer plot for the quenching of the luminescence of the 4-(tert-Bu)py complex 1 by TEOA.The quenching rate constant (k q ) was 3.00 A 10 8 M A1 s A1 .The k q values of all these complexes are in the order of 10 8 M A1 s A1 (Table 2), which are similar to those of reductive quenching by TEOA of other excited rhenium-bpy tricarbonyl complexes 3,59,11,12.The k q value increases with an increase in the electron accepting strength of the pyridine substituent. Irradiating TEOADMF solutions containing complexes 1 to 5 caused catalytic reduction of CO 2 to CO. Fig. 2 shows the dependence of CO formation on irradiation time.The 4-CNpy complex 5 shows a relatively long induction period of CO formation (approximately 3 h), in contrast to other complexes.Table 3 lists the quantum yields for CO formation (E CO ) together with the quantum yields for decrease of the initial complexes (E I ) described in the following section.No signicant differences were observed between the E CO values of the complexes 1 to 4. However, the value of complex 5 was exceptionally higher than the others. Fig. 3 shows the in situ UVVis spectral changes for a CO 2 -saturated TEOADMF solution of the 4-Mepy complex 2 during 365 nm irradiation.The spectrum taken after irradiating for 119 s had an absorption maximum at approximately 490 nm Fig.3(b).This absorption is assigned to the showed almost the same pattern.The species that gave peak Z was isolated by extraction with CH 2 Cl 2 water.It was identied as the formate complex 6 because its ES-mass spectrum, using sodium ion as an ionization agent, gave the sole peak corresponding to 6 Na (m/z 495).The intermediates that gave peaks X and Y appeared not only under CO 2 , but also under an argon atmosphere.These species easily changed to fac-ClRe(bpy)(CO) 3 when an excess NEt 4 Cl was added and then warmed.Therefore, they were suggested to be complexes having an easily removable ligand, such as a solvent molecule.Actually, a DMF complex fac-Re(bpy)(CO) 3 (DMF) ( 7), which was prepared by a reaction of fac-ClRe(bpy)(CO) 3 and Ag in a DMF solution, showed the same retention time as that of X.Furthermore, the ES-mass spectra of irradiated solutions of 1 to 4 revealed a peak of m/z 576 for a single positively charged species, which is attributable to a TEOA complex fac-Re(bpy)(CO) 3 (TEOA) (8) Fig.5(b andc).Unfortunately, no peak corresponding to the DMF complex 7 was detected in the ES-mass spectra.Complex 7 should be decomposed during the ES-mass spectral measurements as described in Hori et al 9.Therefore, Y was identied as 8 and X was supposed to be derived from the DMF complex 7. Lehn and co-workers reported that the formate complex 6 photocatalyzes selective reduction of CO 2 to CO in the similar reaction condition to our systems 6.Because complexes 7 and 8 do not produce CO by themselves 9, the CO formation using complexes 1 to 4 should be caused by the photocatalysis 2 of the formate complex 6, which is photochemically produced from 7 and/or 8.In fact, the E CO values for 1 to 4 (Table 3) are similar to that for complex 6 (0.04, which was calculated using Lehn's data) 6. Spectroscopic and chromatographic changes of the 4-CNpy complex 5 during irradiation were much different from those of 1 to 4. Fig. 6 shows the in situ UVVis spectral changes for a CO 2 -saturated TEOADMF solution of 5 during 365 nm irradiation.Only a very small amount of the one-electron reduced species, which shows an absorption maximum at approximately 490 nm, was accumulated and then the absorption maximum in the spectrum, which did not change during further irradiation, was observed.This nal product was extracted with CH 2 Cl 2 water and then puried by silica-gel chromatography using MeOHethyl acetate as an eluent.Finally, the resulting species were identied as the formate complex 6 and the cyano complex fac-Re(bpy)(CO) 3 CN (9) by comparing their NMR, IR and UVVis spectra with those of authentic samples prepared by reported methods 6,17,18.We have previously reported the photoinduced cyano group rearrangement from 5 to 9 in the presence of TEOA 19.The same phenomenon occurs in the present photocatalytic reaction.Fig. 7 shows the changes in HPLC chromatograms for a CO 2 -saturated TEOADMF solution of the 4-CNpy complex 5 during irradiation.When irradiation started, peaks X and Y appeared similar to those of complexes 1 to 4 Fig.7(b).Further irradiation caused peaks Z and U, which correspond to the formate complex 6 and the cyano complex 9, respectively Fig.7(c). The sole use of 9 instead of 5 also produced catalytic CO 2reduction to CO, where the E CO value was 0.20.Although the mechanism of the photocatalytic reaction by 9 has not been known yet, complex 9 should play an important role in the photocatalytic CO formation using 5. Actually, the photoreaction system of 5 showed the high E CO value of 0.13 (Table 3), while that by the sole use of 6 was 0.04 as described above. As described above, complexes 1 to 5 changed to the solvent complexes 7 and 8 during irradiation in the presence of TEOA.Fig. 8 shows the decrease of the 4-(tert-Bu)py complex 1 in a CO 2 -saturated TEOADMF solution by 365 nm irradiation.The photochemical formation of 7 and 8 should be proceed via chain reactions because the quantum yield for decrease of 1 (E I ) was estimated to be 8.5 and those of complexes 2 to 5 also exceeded unity (Table 3).Wrighton and co-workers reported the chain ligand substi-2 Small difference of the quantum yields between our systems and the reported photocatalytic system using 6 may arise from inner-filter effects by decomposition products from the rhenium complexes during irradiation tution of fac-Re(phen)(CO) 3 (MeCN) (phen 1,10-phenanthroline) by pyridine or PPh 3 in the presence of an electron donor 20.We have also observed a similar phenomenon in the CO 2 -reduction system using fac-Re(bpy)(CO) 3 PPh 3 , that is, the initial complex rapidly changes to the solvent complexes 7 and 8 with a E I of 16.9, which is attributable to a chain mechanism 9.The ligand substitution from complexes 15 to complexes 7 and 8 should also proceed via the chain reaction, illustrated in the case of 1 as follows: (1) A 1 A DMF or TEOA 3 7 A or 8 A 4-tert-Bu py (3) The excited species 1 generated by irradiation (Eq.( 1)) is reduced by TEOA to the one-electron reduced species 1 A (Eq.( 2)), of which the (tert-Bu)py ligand is substituted with DMF or TEOA to give 7 A or 8 A (Eq.( 3)).Subsequent electron exchange of 7 A and 8 A with another 1 leads to the formation of 7 and 8 accompanied by the regeneration of 1 A (Eq.( 4)).The reduction potentials of 15 (A1.11 A1.27 V versus Ag/AgNO 3 ) were more positive than that of fac-Re(bpy)(CO) 3 PPh 3 (A1.40 V), of which chain ligand substitution to 7 and 8 has been reported in the similar reaction condition to this study 9.Although the reduction potentials of 7 and 8 have not been known because of their difculty to be isolated, the electron exchange shown in Eq. ( 4) should be reasonable."
  },
  {
    "title": "Conclusions",
    "content": "Photochemical reduction of CO 2 using fac-Re(bpy)-(CO) 3 (4-tert-Bupy) ( 1), fac-Re(bpy)(CO) 3 (4-Mepy) (2), fac-Re(bpy)(CO) 3 (py) (3), fac-Re(bpy) (CO) 3 -(4-MeCOpy) ( 4) and fac-Re(bpy)(CO) 3 (4-CNpy) (5) in a TEOADMF solution was examined.All systems produced CO catalytically.The reaction mechanisms for complexes 1 to 4 were almost identical, that is, the initial complexes caused the ligand substitution with the solvent molecules to form fac-Re(bpy)(CO) 3 (DMF) ( 7) and fac-Re(bpy)(CO) 3 (TEOA) (8), followed by the formation of the formate complex 6 which acted as the real catalyst for CO formation.On the other hand, in the case of the 4-CNpy complex 5, the cyano complex fac-Re(bpy)(CO) 3 CN (9) was formed in the initial stage of the reaction, which resulted in higher photocatalysis for CO 2 reduction. Fig. 1.SternVolmer plot for the quenching of the luminescence of the 4-(tert-Bu)py complex 1 by TEOA in an argon saturated MeCN solution.k obs observed rate constant of luminescence decay of 1. Fig. 2. Variations of CO formation with irradiation time.A CO 2 -saturated TEOADMF solution (1 : 5, v/v) containing each complex (2.60 mM) was irradiated (365 nm, light intensity 8.05 A 10 A7 einstein min A1 ; 1 einstein 6.022 A 10 23 photons) Fig. 3.In situ UVVisible spectral changes for a CO 2 -saturated TEOA DMF solution (1 : 5, v/v) of the 4-Mepy complex 2 (0.17 mM) during 365 nm irradiation for (a) 0, (b) 119, and (c) 383 s.Light intensity was 1.12 A 10 A7 einstein min A1 Fig. 4. Changes in HPLC chromatograms of a CO 2 -saturated TEOADMF solution (1 : 5, v/v) of the py complex 3 (2.60 mM) before and after 365 nm irradiation.Light intensity was 8.05 A 10 A7 einstein min A1 .Irradiation time was (a) 0, (b) 1, and (c) 4 h.The mobile phase composition was 60 : 40 (v/v) of MeOH / KH 2 PO 4 -NaOH buffer (0.05 M, pH 5.9).It is clear that the irradiated samples (b, c) included no initial complex 3 because the corresponding ES-mass spectra showed no peak of 3 (m/z 506).See Fig. 5(b) and (c). Fig. 5. Changes in ES-mass spectra of a CO 2 -saturated TEOADMF solution (1 : 5, v/v) of the py complex 3 (2.60 mM) before and after 365 nm irradiation.The light intensity was 8.05 A 10 A7 einstein min A1 .Irradiation time was (a) 0, (b) 1, and (c) 4 h.The neutral complex 6 shows no signal because complexes with no charges are hard to detect by ESmass spectrometry unless ionized by addition of some ionization agent 14. Fig. 6.In situ UV-Vis spectral changes for a CO 2 -saturated TEOADMF solution (1 : 5, v/v) of the 4-CNpy complex 5 (0.17 mM) during 365 nm irradiation for (a) 0, (b) 89, and (c) 383 s.Light intensity was 1.12 A 10 A7 einstein min A1 Fig. 7. Changes in HPLC chromatograms of a CO 2 -saturated TEOADMF solution (1 : 5, v/v) of the 4-CNpy complex 5 (2.60 mM) before and after 365 nm irradiation.Light intensity was 8.05 A 0 A7 einstein min A1 .Irradiation time was (a) 0, (b) 1, and (c) 4 h.The mobile phase composition was 60 : 40 (v/v) of MeOH/KH 2 PO 4 NaOH buffer (0.05 M, pH 5.9). Analytical and spectral data for fac-Re(bpy)(CO)3(4-Xpy)SbF 6 a Measured in an MeCN solution.b Positive ion ESMS.The m/z values are corresponding to the cation fac-Re(bpy)(CO) 3 (4-Xpy) .a Measured in an MeCN solution.b Quenching rate constant by TEOA. Quantum yields of CO formation (E CO ) a and decomposition of fac-Re(bpy)(CO) 3 (4-Xpy) (E I ) b a Measured after the induction period; calculated by the following equation: amount of CO/light intensity.b Measured by HPLC; the mixing ratios (MeOH : KH 2 PO 4--NaOH buffer) of mobile phase were 40 : 60, 50 : 50, and 60 : 40 (v/v) for the complexes (3 and 4), (2 and 5), and 1, respectively."
  }
]