[
  {
    "title": "Doi",
    "content": "10.1098/rsos.181789"
  },
  {
    "title": "Article_Title",
    "content": "Enhanced photoreduction CO <sub>2</sub> efficiency by criss-crossed TiO <sub>2</sub> nanoflakes combined with CdS under visible light"
  },
  {
    "title": "Abstract",
    "content": "In this paper, a novel photocatalyst CNCC with excellent visible light photocatalytic performance was successfully prepared to optimize the CO 2 photoreduction performance.The results showed that the methanol formation rate of CNCC was 24.7 mmol g 21 h 21 , which was 1.42 times higher than that of NCC.The enhanced photoactivity is attributed to the rapid propagation of charge carriers induced by light from the constructed composite structure."
  },
  {
    "title": "Experimental",
    "content": "All chemicals used in the experiment (Tianjin Chemical Reagent Company) are analytical reagent grade. The FTO glass (5 A 5 cm 2 ) was cleaned, and then coated with TiO 2 nanowire in ethanol solution.FTO glass was placed in a tetrafluoroethylene reactor (200 ml), 110 ml ethanol, 5 ml deionized water, 1 mmol Ti(OC 2 H 5 ) 4 , 1 mmol trihydroxytriethylamine, 1 mmol urea glycoside and 1 mmol hexadecanol were added, and then placed in an oven at 1808C for 7 days.The substrate was washed and baked at 4508C for 50 min to optimize the photoreduction performance of CO 2 . The CdS -TiO 2 heterostructure photocatalysts were prepared using a simple precipitation method.The FTO film of prepared interconnected TiO 2 nanowires was dispersed in a certain volume of 0.1 M Cd (NO3) 2 aqueous solution, using the same capacity of 0.1 M Na 2 S aqueous solution as the precipitator introduced by dripping slowly.Then the film was rinsed several times with deionized water.The anatase TiO 2 nanoparticles (15 nm primary particle size) were purchased from Aladdin.The synthetic procedures of TiO 2 nanoparticles combined with CdS were almost the same as the procedures of criss-crossed TiO 2 nanoflakes combined with CdS."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The morphology of TiO 2 on FTO glass was studied by SEM. Figure 1a indicates the micrometre-sized TiO 2 film.A magnified SEM image in figure 1b clearly demonstrates the highly organized structure of the film packaging by criss-crossed TiO 2 nanoflakes, which provide more surface area and active sites for the next catalytic reaction 14,15.Figure 1c displays magnified SEM of the criss-crossed TiO 2 nanoflakes covered with CdS-nanosized crystallites.The CdS particle size is about 8 nm.Transmission electron microscopy (TEM) images for TiO 2 and TiO 2 -CdS composite are presented in figure 1d,e to explore the nanostructure.As shown in figure 1d, criss-crossed nanoflakes were distinctly observed.From figure 1e, it can be seen that the porous surface is composed of nanoparticles with a diameter of less than 10 nm.EDX mapping images (figure 1f-i) indicate that the sample contains Ti, O, Cd and S; this finding further confirms the coexistence of titanium dioxide and cadmium sulfide.Ti, O, Cd and S are well dispersed in the samples; thus, CdS nanoparticles are uniformly dispersed on the surface of TiO 2 .Their phase structures were studied by XRD. Figure 1j shows the XRD diagram of criss-crossed TiO 2 nanoflakes, indicating formation of the anatase phase.The diffraction peak of TiO 2 can be seen by observing the XRD diagram of CdSTiO 2 composite.The peaks located at 26.58, 44.48 and 528 could be indexed to the (111), ( 220) and (311) crystal planes of cubic CdS phase, respectively. The transmission and recombination of photoinduced electrons are the main determinants of the efficiency of CO 2 photoreduction; thus, the study of these effects in CNCC is of great significance for the further development of the CO 2 photoreduction process.Intensity-modulated photocurrent spectroscopy was used to measure the transmission characteristics and intensity-modulated photovoltage spectroscopy was used to measure recombination characteristics 16.Figure 2a compares the transmission time constants of TiO 2 nanoflakes and nano-titanium dioxide particles combined with CdS as light intensity functions.The transmission time constant t c of CNCC is 2.24 A 10 24 s at the light intensity (9.12 A 10 16 cm 22 s 21 ) and 3.31 A 10 23 s at the light intensity (1.15 A 10 15 cm 22 s 21 ).Meanwhile, the transmission time constant t c of NCC is 8.34 A 10 24 s at 9.19 A 10 16 cm 2 s 21 and 8.04 A 10 23 s at 1.18 A 10 15 cm 22 s 21 .The electron transmission between TiO 2 nanoparticles and CdS is slower than that of CNCC film; this may be due to the electron's residence time in the trap of the particle network (for example, the number of connections between particles) and the region of contact between particles that limits it 17.That is to say, the A self-made 100 ml quartz reactor was used for photocatalytic CO 2 reduction.A 400 W xenon lamp with a 420 nm cut-off filter was used as the optical source.Gas products from photocatalytic reduction of CO 2 were collected with a 1 mm syringe and analysed rapidly by the gas chromatograph (SP-7890) with a flame ionization detector.Detailed experimental procedures of photocatalytic CO 2 reduction can be found in supplementary materials.Figure 3 presents the methanol and methane formation rates of NCC and CNCC in 5 h of irradiation.For CNCC and NCC, it is noteworthy that the yield of methanol (figure 3a) is much higher than that of methane (figure 3b).It can be seen that CNCC achieves a methanol formation rate of 24.7 mmol g 21 h 21 , 1.42 times higher than that of NCC.The results show that the methane production rate of CNCC was 4.59 mmol g 21 h 21 , 1.68 times higher than that of NCC.The geometry structure of criss-crossed TiO 2 nanoflakes can significantly improve its CO 2 photoreduction performance.When visible light irradiates the photocatalyst, CdS acts as a sensitizer at this time, converting the TiO 2 response from ultraviolet to visible light.Photoinduced electrons from CdS to the conductive bands of TiO 2 can reduce carbon dioxide to negative electrodes, resulting in the formation of methane or methanol.The electron transmission between criss-crossed TiO 2 nanoflakes and CdS is faster than that of NCC film, thereby inhibiting recombination with holes."
  },
  {
    "title": "Conclusions",
    "content": "The criss-crossed TiO 2 nanoflakes combined with CdS were successfully synthesized by a simple solvothermal method using hexadecanol as hydrophobic modifier.The CNCC composites exhibited good CO 2 reduction photocatalytic activity under visible light.The results showed that the methane production rate of CNCC was 4.59 mmol g 21 h 21 , which is 1.68 times higher than that of NCC.CNCC achieves a methanol formation rate of 24.7 mmol g 21 h 21 , which is 1.42 times higher than that of NCC.The increase in CH 4 and CH 3 OH yields can be attributed to the fast electron-hole transmission of TiO 2 nanoflakes.This provides a new photocatalytic method for the efficient conversion of CO 2 by solar energy. royalsocietypublishing.org/journal/rsos R. Soc.open sci.6: 181789 criss-crossed TiO 2 nanoflakes are a fine electrical conductive body along the orientation of the strip axes relative to TiO 2 nanoparticles.Figure 2b shows the recombination time constant of NNCC is two or three orders of magnitude larger than that of NCC in the studied range of light intensity.Slower carrier recombination indicates the criss-crossed TiO 2 nanoflakes have less surface recombination sites than TiO 2 nanoparticles. Figure 1.Morphology of the CNCC.(a) SEM image of the top view of the criss-crossed TiO 2 nanoflakes.(b) A magnified SEM image of the criss-crossed TiO 2 nanoflakes (c) A magnified FESEM image of the CNCC.TEM images of TiO 2 (d ) and TiO 2 -CdS (e) composite.( f-i) Composed elemental mapping image.( j) XRD pattern of the CNCC and the criss-crossed TiO 2 nanoflakes. Figure 3. Yield of (a) CH 3 OH and (b) CH 4 upon photoreduction in CO 2 as a function of time under visible light by using CNCC and NCC. Figure 2. Comparison of transmission (a) and recombination (b) time constants for CNCC and NCC. Acknowledgements.We are grateful to Pinhua Li, who provided suggestions during the drafting of manuscript. Funding.This work was financially supported by Provincial Natural Science, Research Foundation of Anhui Universities, China (KJ2016A880), National Natural Science Foundation of China (No. 21401061), Anhui Provincial Innovation Team of Design and Application of Advanced Energetic Materials (KJ2015TD003). Data accessibility.Complete data for photocatalytic CO 2 reduction are available from the Dryad Digital Repository: https://doi.org/10.5061/dryad.r2f59f018. Authors' contributions.All three authors participated in all procedures including the design of the study, carrying out the laboratory work, data analysis and drafting the manuscript.All authors approved the final version of the manuscript. Competing interests.The authors have no competing interests."
  }
]