[
  {
    "title": "Doi",
    "content": "10.1016/j.materresbull.2019.110678"
  },
  {
    "title": "Article_Title",
    "content": "CuO thin films deposited by DC sputtering and their photocatalytic performance under simulated sunlight"
  },
  {
    "title": "Abstract",
    "content": "CuO thin films were obtained by DC Sputtering varying the deposit time: 10, 20 and 30 min with the thickness of 60, 120 and 180 nm, respectively.These films were used photocatalysts in two different photocatalytic processes: hydrogen production and CO 2 photoreduction under simulated sunlight.The film with 120 nm of thickness generated the highest amount of hydrogen (24 mol) of the films tested.Furthermore, the ellipsometry results showed that this film absorbs the simulated light in the UV-to-IR region, which facilitates their photocatalytic performance.In the CO 2 photoreduction process, the CuO film with the lowest thickness exhibited the best performance, yielding 6816 mol/g CH 2 O, while the film of 120 nm in thickness generated a mixture of CH 3 OH (1536 mol/g) and CH 2 O (450 mol/g).It is assumed that the optical properties, such as absorption coefficient, refractive index, and extinction coefficient, of the film favored the production of formaldehyde and methanol."
  },
  {
    "title": "Experimental",
    "content": "CuO thin films were deposited by DC magnetron sputtering using a Cu target (99.995purity, 2.00\" X 0.250,\" Kurt J. Lesker) over glass substrates.The background pressure of the sputtering chamber was 8 10 -6 Torr, and the working pressure was of 1.5 10 -2 mTorr.The chamber was filled with argon gas (99.999 purity) and the power used during deposition was 30 W. CuO thin films were deposited for different deposit times: 10, 20, and 30 min After deposition, the thin films were annealed at 450 C for 1 h.For future references in the document, the films will be identified as 10-CuO, 20-CuO and 30-CuO where the numbers indicate minutes of deposit. Thin films characterization for structural properties has been made using an X-ray diffractometer (PANalytical) with Cu Ka radiation of 1.54 A in grazing angle.The film thicknesses were measured using an Alpha Step D-600 Stylus Profiler.Surface morphology was observed with an Atomic Force Microscope (Nanosurf NaioAFM) in contact mode.The optical properties of the films were measured using an UV-vis-NIR spectrophotometer (Cary 5000), a fixed-angle ellipsometer (Horiba, Jobin Yvon UVISEL HR 320), and a fluorescence spectrophotometer (Agilent Cary Eclipse). The photocatalytic reactions were conducted in a 250 mL cylindrical Pyrex batch reactor at room temperature.For the hydrogen production test, the films, each with an area of 15 cm 2 , were fixed inside the reactor and bubbled with N 2 for 20 min in order to remove the oxygen.Then, the films were irradiated with simulated solar light from an ABBclass irradiation source: a Xe lamp of 450 W and 100 mW/cm 2 in combination with an AM 1.5 G filter.The reaction was monitored in 30 min intervals using a Shimadzu GC-2014 gas chromatograph equipped with a thermal conductivity detector. For the CO 2 photoreduction test, the reactor was bubbled with CO 2 during 10 min, whit the aim to remove the dissolved oxygen and saturated the reaction media with this gas.Then, the reactor was closed and pressurized to 2 psi.The final products were evaluated after 3 h using a UV-vis-NIR spectrophotometer (Cary 5000) to observe the complexation with formaldehyde using chromotropic acid, phosphoric acid, and hydrogen peroxide 30."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The thicknesses of each film was measured by using a profiler.The thickness values was 60, 120 and 180 nm for CuO films with 10, 20 and 30 min of deposit respectively.Fig. 1-a shows the XRD patterns of the CuO thin films.All of the peaks can be indexed with the monoclinic phase of CuO (JCPDS-05-0661).However, it can be observed, after 10 min of deposited, that the film grew preferentially in the (111) plane but, as the deposition time increased, the favored growth direction was in the ( -111) plane.This could be because the film grew oriented to the substrate.Whereas when the deposit time increase, allows the crystals in the film began to grow oriented in the ( -111) plane with further deposition. The crystallite size was calculated using the Scherrer equation 31: where is the X-ray wavelength, is the Bragg's diffraction angle, and is the full with at half maximum (FWHM) of the most intense peak of each film.The crystallite sizes of 10-CuO, 20-CuO, and 30-CuO were about 29, 35, and 38 nm, respectively.In order to know information about the crystal structure, the dislocation density, which reflects the density of defects in the CuO thin films, was calculated according to the following equation 32,33: where D is the grain size.Fig. 1-b shows the grain size and dislocation density values.These data show that, as the crystallite size increased, the dislocation density decrease.Inasmuch as, the dislocation density decrease with the deposition time, the film deposited at 30 min have a better crystalline quality than the other films 34,35.Fig. 2 shows the AFM image of each film.The scanning area was of 7.5 X 7.5 m, and the measurements were conducted in contact mode.It can be observed that all films had homogeneous surfaces constituted by elongated grains.However, the grains on the surface became more elongated as the deposition time increased.10-CuO, 20-CuO, and 30-CuO had surface roughness values of about 1.5, 2.8, and 3.05 nm, respectively, and average grain sizes of 929 nm, 1.1, and 2 m, respectively.The grain size increased with the deposition time agrees with the trend in the crystallite size observed in the XRD results (Fig. 1-b). In addition, the optical properties of the CuO thin films were characterized.Fig. 3 shows the UV-vis transmittance spectra of the films.Since the CuO absorbs light in the visible region, the films exhibit around 50 transmittance above 500 nm.The band gap energies were calculated based on the Tauc plot considering an indirect transition to be about 1.3 and 2.2 eV 363738.These results indicate a narrowing in the band gap value due to the increase in film thickness as the deposition time increased 39. The optical characteristics of a semiconductor, such as defects or surface oxygen vacancies, can be observed using photoluminescence (PL).The PL spectrum of each film was obtained using an excitation of 650 nm.The resulting spectra, which are shown in Fig. 4-a, reveal that the films have the same emission peaks with different intensities.The first peak appeared at approximately 715 nm and corresponds to the recombination of electrons and holes at oxygen vacancies.The next emission peak around 730 nm was related to the band impurity transition resulting from the recombination of electrons bound to donors and free holes (730 nm) 40.The third emission peak around 756 nm was assigned to the excitonic transition 41.Ultimately, the last peak correspond to the band gap emission around 1.5 eV.All of the observed emissions generated excited states above the conduction band, which could cause a slight increase in the band gap value and result in the reduced photocatalytic performance of the CuO thin films. The optical properties (the absorption coefficient, refractive index, and extinction coefficient) of each film were measured using a spectroscopic ellipsometer.Fig. 5-a shows the absorption coefficient () for each film, which is related to the amount of light absorbed by the material when it is irradiated 1.These results show that all films absorb light in the wavelength range of 300-900 nm.However, the absorption of 20-CuO increased at wavelengths greater than 700 nm.The refractive index (n), which describes the ratio between the light in a vacuum and the light absorbed by a material 37,41,42, for each film is shown Fig. 5-b.It can be observed that the refractive index of 10-CuO increased in the range of 550-900 nm while those of 20-CuO and 30-CuO decreased in this visible region.Finally, the extinction coefficient (k), which describes the light loss attributed to the absorbance 37,41,42, is shown for each film in Fig. 5-c.The extinction coefficient of 10-CuO film remained very high throughout the visible region.On the other hand, that 20-CuO was high in the UV region and decreased in the visible region up to 750 nm, above which the extinction coefficient increased again.This behavior is similar to the 30-CuO film, with the difference that the extinction coefficient increased above 750 nm. Fig. 6-a presents the photocatalytic hydrogen production of the CuO films after three hours of irradiation.While all films exhibited photocatalytic activity under simulated sunlight, 20-CuO had the highest hydrogen production (24 mol).As shown in Fig. 5-a, this film absorbed the most light from the lamp across the entire spectrum, which explains its superior photocatalytic performance.This film also exhibited the lowest PL emission (Fig. 4-a), which is associated with lower charge recombination and would facilitate the observed increase in photocatalytic hydrogen production.Moreover, the dislocations density and grain size did not inhibit the photocatalytic activity in this film.On the other hand, in Fig. 6 The ellipsometry results (Fig. 5) showed that all films absorbed light from the lamp across the UV-to-IR region.However, 10-CuO exhibited a higher refractive index in the visible-to-IR region (Fig. 5-b), which favored the formaldehyde generation.In this film, the light moved slowly through this film due to the high concentration of dislocations in the structure (Fig. 1-b), which caused the light to remain in the material longer, thus prolonging the photocatalytic reaction.On the other hand, 20-CuO produced a mixture of formaldehyde and methanol.The ellipsometry results (Fig. 5-a) showed that this film exhibited the highest light absorption in the UV-to-IR region, a lower refractive index, and a higher extinction coefficient (Fig. 5-b, 5-c).These optical properties, in combination with a suitable thickness and optimal amount of dislocations, contributed to the production of a mixture of formaldehyde and methanol by this film."
  },
  {
    "title": "Conclusions",
    "content": "CuO thin films were deposited by DC sputtering with varying deposition time.All films exhibited a monoclinic phase of CuO with good crystallinity.The surfaces of the films comprised homogenous grains, which increased in length as the deposition time increased.Additionally, the PL spectra revealed different emission properties of the films, which are related to differing recombination processes at energies above the band gap.The film of 120 nm in thickness (20-CuO), had the best photocatalytic performance of all films tested, yielding the highest amount of hydrogen (24 mol) during photocatalytic hydrogen production and producing a mixture of formaldehyde (450 mol/g) and methanol (1536 mol/g) during CO 2 photoreduction.The optical properties of this film, as well as its suitable thickness (120 nm) and optimal concentration of dislocations, led to its superior performance in both photoinduced processes. Fig. 1. a) XRD patterns of CuO thin films deposited at different times and b) the corresponding crystallite sizes and dislocations densities. Fig. 2. AFM images showing the surface morphologies of a-b) 10-CuO, c-d) 20-CuO and e-f) 30-CuO. Fig. 3. a) Transmittance spectra of the TiO 2 thin films and b) Tauc plot showing the band gap of each film. -b are presented the CO 2 photoreduction results for the CuO thin films.From the figure, it can be observed that all films produced CH 2 O.The films 10-CuO and 30-CuO produced the most formaldehyde (CH 2 O), yielding 6816 and 4446 mol/g respectively.On the other hand, 20-CuO generated not only CH 2 O (450 mol/g) but also CH 3 OH (1536 mol/g). Fig. 6. a) Photocatalytic hydrogen production and b) CO 2 photoreduction under simulated sunlight with the different CuO films. Acknowledgments The authors would like to thank Catedras-CONACYT 363, CONACYT: PDCPN-2015-610, CB-2014-237049, FC-2016-01-1725, SEP-RED PROFIDES 511-6/18-11852, UANL-PAICYT IT637-18, Fig. 4. a) PL emission spectra of CuO films deposited for different times and b) a representation of the generated excited states above the conduction band.Fig. 5. a) Absorption coefficient (), b) refractive index (n), and c) extinction coefficient (k) of the CuO films.PAICYT CE865-19 and PAIFIC/2018-5, PAIFIC/2018-8.We also thank Dr. Eduardo Martinez Guerra and Dr. Francisco Enrique Longoria Rodriguez from CIMAV-Monterrey for his technical support in the XRD measurements.Also, we appreciate the support given by the Physic Juan Aguilar Solano and M.C.Luis Felipe Garay Rodriguez for the thin film characterization. The authors declare that there are no conflicts of interest."
  }
]