[
  {
    "title": "Doi",
    "content": "10.1016/j.jssc.2017.05.022"
  },
  {
    "title": "Article_Title",
    "content": "Facile synthesis of highly active reduced graphene oxide-CuI catalyst through a simple combustion method for photocatalytic reduction of CO2 to methanol"
  },
  {
    "title": "Abstract",
    "content": "We report a facile combustion method synthesis of reduced graphene oxide/CuI composites as a photocatalyst, in which CuI nanoparticles were homogeneously distributed on the surface of reduced graphene oxide (rGO), showing a good visible light response.The rGO-supported and unsupported CuI hybrids were tested over the photocatalytic reduction of CO 2 for methanol evolution in visible light.In the current study rGO-CuI composites have shown excellent yields (19.91 mol g-cat -1 ).rGO provides a light-weight, charge complementary and twodimensional material that interacts effectively with the CuI nanoparticles."
  },
  {
    "title": "Experimental",
    "content": "All reagents used in the experiments were analytical reagent grade and used without further purification.Crystalline flake graphite was purchased from Qingdao Jinrilai graphite Corporation.NaNO 3 was obtained from Tianjin Viktor Chemical CorporationH 2 O 2 (30) was supplied by Tianjin Bot Chemical Corporation.KMnO 4 was purchased from Tianjin Jiangtian Chemical Corporation.HCl and Concentrated H 2 SO 4 (98 wt) were obtained from Beijing Chemical Works.CuI was supplied by Tianjin Damao Chemical Reagent Corporation.CO 2 (99.995) was obtained from Tianjin Sizhi Gas Corporation. Fourier transform infrared spectroscopy (FT-IR) were registered in a Bruker Ten-sor27 spectrometer (Germany) with a KBr disc in the wavelength range of 4000-400 cm -1 .The X-ray diffraction (XRD) patterns were taken on Germany Bruker AX in the range of 5-90.Morphology of rGO-CuI was investigated using scanning electron microscopy (NanoSEM 450) and transmission electron microscopy (NanoTEM).The UV-visible transmittance spectrum was obtained on an Agilent Carry 100 UV-vis spectrometer, from 200 to 800 nm.The gas chromatography (GC) analyses were performed on a Shandong Lunan Ruihong SP-6860(SE 54 column (30 m 0.5 m), Inj.Temp.80 C, FID Temp.260 C and Oven Temp.80 C). Hummers' method was initially adopted to synthesize graphite oxide as our group previously synthesized 25.Graphite oxide 100 mg and CuI 0.3 g were added into a 25 mL beaker.Then 20 mL ethanol is added to the mixture that was treated as one hour with ultrasonic wave.The resulting material was subsequently removed, evenly spread over the surface of the watch glass and dry 24 h with 50 C in the drying oven.Then the dried product were quickly passed through a naked flame from a burning alcohol lamp(time 1 s, utilizing the internal flame of the alcohol lamp) 25.The internal flame of the alcohol lamp has the ability to reducing.After passing through the flame quickly, the sample was immediately placed in a bottle filled with argon."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The phase structures of GO, rGO, CuI and rGO-CuI were tested by X-ray diffraction (XRD) measurement.Fig. 1a, b, c andd compare the XRD patterns of samples in the range of 5-90(2).In Fig. 1a, the obvious and strong characteristic broad (002) peak at 11.806corresponding to GO.The GO sheets were observed increase in layer distances because both sides of the GO sheets have a large number of oxygen-containing functional groups.As shown in Fig. 1, we can see the b curve in 23.655has a width of the characteristic peaks and the characteristic peak at 11.806 is disappeared which indicate the - stacking interaction of rGO is weakened severely.So it is indicated that when GO was handled through the naked flame.The GO would soon be reduced to graphene.According to Fig. 1, the diffraction peaks of c curve at 2 of 25.558, 42.266and 50.009corresponding to the (111), ( 222) and (311) plane reflections of cubic crystal structure CuI, which agrees well with the reported data (JCPDS Card no.06-0246).The diffraction peaks of rGO-CuI almost the same as with CuI and the intensity of these peaks is also more than strong.It proves that CuI still has a good crystal structure undergoing flame treatment.Nevertheless, it did not detect the diffraction peaks of the rGO, which owing to the addition of copper iodide affects rGO crystal structure.Therefore, it manifests that we successfully reduced GO to rGO by a naked flame, and CuI is supported on the surface of rGO through a simple one-step method. To further investigate the structure and morphology of the asprepared samples, SEM observations were employed as shown in Fig. 2. It can be seen that the rGO exhibits a good three-dimensional and loose structure when GO was reduced to rGO through a flame treatment in Fig. 2a andb.This loose structure formation is considered to be in the combustion process GO decomposition produces large amounts of carbon dioxide and water caused by swelling.Lamellar spacing is large and the surface is smooth and slightly wrinkled.As is shown in Fig. 2c andd, the distinct contrast between rGO-CuI composites and rGO is observed, and the CuI nanoparticles were dispersed on the surface of rGO sheets. The morphology and microstructure of the sample are analyzed by TEM.As is shown in Fig. 3a andb, from the figure we can see that the surface of rGO is quite folded without the presence of other particles.The as-obtained rGO presents a transparent structure which indicating it is under a very low number of layers.According to the image of Fig. 3c andd, it demonstrates that a large number of CuI nanoparticles were evenly distributed on the surface of the rGO, which indicating our combustion method is successful.Fig. 1S shows the CuI particle size at the nanoscale level. UV-vis diffuse reflectance spectra shown in Fig. 4 also carried out in order to understand the optical properties of the rGO based photocatalyst.The rGO and rGO-CuI display typical absorption bands around 200-270 nm and the characteristic absorption from cyclic structure of rGO.In the visible-light region, the CuI has a very weak absorption peak at 440 nm, which originates from the excitation of electrons from the valence band to the conduction band.But the absorption peak at 440 nm in rGO-CuI and rGO are strong obviously than the peak of CuI 26.After the introduction of CuI species, the absorption of visible-light increased greatly 27.The rGO absorption strength slightly below the absorption intensity of rGO-CuI, therefore rGO photocatalytic efficiency is lower than rGO-CuI, and this theory was verified in the experiment. Fig. 5 shows the FT-IR spectra of pure GO and rGO-CuI composites.In the case of GO, the broad and intense peak centered at 3441 cm -1 , which is related to the OH groups, and the peak at 1728 cm -1 corresponds to the CO carboxylic moieties.The adsorption peak at 1636 cm -1 belongs to the skeletal vibrations of unoxidized graphitic domains.Bands at 1399 and 1098 cm -1 correspond to C-O-H deformation and CO is stretching vibrations, respectively.For rGO-CuI, the adsorption peak at 3415 cm -1 correspond to OH groups which remained on the surface of the rGO.The adsorption peak at 1629 cm -1 is linked to the aromatic CC bond.The last adsorption peak at 624 cm -1 is assigned to the Cu-I bond.From the FT-IR spectrum can be obtained that GO was reduced and CuI was loaded on the surface of the rGO. Photocatalytic activity of the rGO-CuI composites under visible light irradiation was also investigated.The powder of photocatalyst material was uniformly dispersed on a quartz tube, which was placed in the reactor.Then a 300 W Xe arc lamp, which utilized the visible-light source, was located above the quartz tube.Then, 30 mL of distilled water and a small amount of K 2 CO 3 solution were joined in the quartz tube and constantly bubbled into carbon dioxide.After switching on the Xe lamp, the lamp was encased in a self-reliant water jacket with a circulating water.Samples was collected and tested after reaction 10 h.Finally, samples were characterized by gas chromatography. To further investigate the researched photocatalytic property of the rGO-CuI composites, the evolution of methanol is measured in the presence of CO 2 and H2O under simulated sunlight irradiation.Fig. 6 shows the photocatalytic methanol production performances of GO, rGO, CuI and rGO-CuI composites.The GO and CuI have almost no photocatalytic activity in methanol generation under visible light irradiation, and the rGO composites show photocatalytic activity.Because of the band gap of graphene oxide is zero, do not absorb photons energy to produce electron-hole pairs.However, the band gap of CuI is 3.1 eV, and the energy of the visible-light is insufficient to excite the electron-hole pairs.As for rGO-CuI composites, the methanol evolution rate increases to 19.91 mol g-cat -1 , which is much higher (4 times) than that of rGO composites (4.28 mol g-cat -1 ).The results manifest that the rGO-CuI hybrid has the highest photocatalytic activity among these materials. Accordingly, the simple mechanism of photocatalytic activity of rGO-CuI composites under visible light irradiation can be illustrated in Scheme 1 and Eqs. ( 1)-( 4).In an initial step of charge carrier generation, rGO modified with CuI is excited by visible-light, photons with higher energy than the band gap of the CuI generate electron-hole pairs on the rGO-CuI photocatalyst surface.Then, on the rGO photocatalyst surface, CuI act as the electron acceptor and suppress the recombination of photo excited electron-hole pair.The excited electrons are captured by CO 2 , which adsorbed on the rGO surface, and then produces methanol 28,29."
  },
  {
    "title": "Conclusions",
    "content": "In summary, simple, speed, efficient, and eco-friendly method without any reducing agents to prepare the rGO-CuI composites on a large scale, was developed.Therefore, a great amount of oxygen-containing groups are removed successfully, and the rGO-CuI composites are obtained by a naked flame simultaneously.Results from catalytic investigations of rGO-CuI composites towards the methanol production indicate that the composites possess very high photocatalytic activity under visible light irradiations.It is believed that the rGO-CuI composites can provide a platform for the photocatalysis, adsorbent, battery, etc. Fig. 1.XRD patterns corresponding to GO(a), rGO(b), CuI(c), rGO-CuI(d). Fig. 2. The SEM image of rGO(a and b), rGO-CuI(c and d). Fig. 3.The TEM image of rGO(a and b), rGO-CuI(c and d). Fig. 4. UV-vis spectra of rGO-CuI, rGO and CuI. Fig. 5. FTIR spectra of GO(a), rGO-CuI(b). Fig. 6.Comparison of the photocatalytic production of methanol from CO 2 obtained for GO, CuI, rGO and rGO-CuI composite. This work was financially supported by the Education Department of Hebei Province (No. ZD2017214). Supplementary data associated with this article can be found in the online version at doi:10.1016/j.jssc.2017.05.022."
  }
]