[
  {
    "title": "Doi",
    "content": "10.1021/jp010885g"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic Reduction of CO<sub>2</sub> with H<sub>2</sub>O on Ti−β Zeolite Photocatalysts: Effect of the Hydrophobic and Hydrophilic Properties"
  },
  {
    "title": "Abstract",
    "content": "Two types of Ti- zeolites synthesized by a hydrothermal synthesis method under different conditions using OH -and F -ion as anions of the structure-directing agents (SDA) exhibited photocatalytic reactivity for the reduction of CO 2 with H 2 O at 323 K to produce CH 4 and CH 3 OH.In situ photoluminescence, diffuse reflectance absorption, and XAFS (XANES and FT-EXAFS) investigations of these Ti- zeolites indicate that the titanium oxide species are highly dispersed in their frameworks and exist in a tetrahedral coordination state.From the H 2 O adsorption isotherm on these Ti- zeolites at 300 K, it was found that the Ti- zeolites synthesized using OH -ions (Ti-(OH)) exhibited hydrophilic properties and the Ti- zeolites synthesized using F - ions showed hydrophobic properties.With the addition of H 2 O, Ti-(OH) exhibited a more efficient quenching of the photoluminescence of the highly dispersed tetrahedrally coordinated titanium oxide species and a more remarkable decrease in the preedge intensity of the XANES spectra of the Ti K-edge by the addition of H 2 O as compared with that of Ti-(F) having hydrophobic properties.These results indicated that the H 2 O molecules added were easily able to gain access to the tetrahedrally coordinated titanium oxide species in the Ti(OH) zeolite.The differences in the H 2 O affinity to the zeolite surface led to a strong influence on the reactivity and selectivity for the photocatalytic reduction of CO 2 with H 2 O. Therefore, the properties of the zeolite cavities were important factors controlling the reactivity and selectivity in the photocatalytic reduction of CO 2 with H 2 O to produce CH 4 and CH 3 OH on these Ti- zeolite catalysts."
  },
  {
    "title": "Experimental",
    "content": "Catalysts.Two types of Ti- zeolites were synthesized under hydrothermal conditions using OH -ions and F -ions as anions of the SDA.These Ti- zeolites are denoted according to the kinds of SDA, i.e., Ti-(OH) and Ti-(F).The sources of the silica and titanium oxide are tetraethyl orthosilicate (TEOS) and tetraisopropylorthotitanate (TPOT), respectively.The composition of material mixture for Ti-(OH) (Si/Ti ) 60) is as follows: SiO 2 :TiO 2 :N,N-dibenzyl-4,4-trimethylene bis(N-methylpiperidinium) dihydroxide:H 2 O ) 1:0.02:0.2:30.The gelation of the material mixture was carried out at room temperature, and these gel mixtures were placed in Teflon-lined stainless steel autoclaves and heated statically at 413 K for 5 days while being rotated at 60 rpm.The product was collected by centrifugal filtration, washed with distilled water, and dried in air at 353 K. To remove the occluded organic molecules, the samples were calcined under a flow of dry air at 823 K for 4 h.Ti-(F) (Si/Ti ) 60) was prepared by the same procedures as those for Ti-(OH) from a material mixture having the following composition: SiO 2 :TiO 2 :tetraethylammonium fluoride (TEAF):H 2 O ) 1:0.02:0.56:7.TS-1 (Si/Ti ) 60) was prepared from a material mixture having the following composition: SiO 2 :TiO 2 :tetrapropylammonium hydroxide (TPAOH):H 2 O ) 1:0.02:0.4:30.Ti/FSM-16 (1.0 wt as TiO 2 ) was prepared by impregnating FSM-16 with an aqueous titanium ammonium oxalate solution.The fluorination of the Ti/FSM-16 catalysts was carried out by a procedure previously reported. 24The FSM-16 was immersed in 12.5 and 25.0 ammonium fluoride solution for 2 h, dried, heated at a rate of 10 K/min to 973 K, and kept at 973 K for 5 h.The TiO 2 powder catalysts (JRC-TIO-4: anatase 92, rutile 8) were supplied by the Catalysis Society of Japan. Photocatalytic Reactions.The photocatalytic reductions of CO 2 with H 2 O were carried out with the catalysts (50 mg) in a quartz cell with a flat bottom (88 cm 3 ) connected to a conventional vacuum system (1 10 -4 Pa range).Prior to photoreactions and spectroscopic measurements, the catalysts were heated in O 2 at 723 K for 8 h and evacuated at 473 K for 2 h to 1 10 -4 Pa.UV irradiation of the catalysts in the presence of CO 2 (36 mol) and H 2 O (180 mol) was carried out using a 100 W high-pressure Hg lamp ( 250 nm) at 323 K.The reaction products were analyzed by gas chromatography. Characterizations.The photoluminescence spectra of the catalysts were measured at 298 and 77 K using a SPEX FLUOLOG-3 spectrophotofluorometer.The diffuse reflectance UV-vis absorption spectra were measured at 298 K by a Shimadzu UV-2200A double-beam digital spectrophotometer equipped with an integrating sphere, where a BaSO 4 was used as reference.The FT-IR spectra were recorded at 298 K with a JASCO FTIR-7300 spectrometer using the sample wafer.The XAFS spectra (XANES and EXAFS) of the catalysts were measured at the BL-7C facility of the Photon Factory at the National Laboratory for High-Energy Physics, Tsukuba.The X-ray source from the 2.5 GeV electron storage ring was monochromatized using a Si(111) double-crystal monochromators.The Ti K-edge absorption spectra were recorded in the transmission and fluorescence mode at 298 K.The normalized spectra were obtained by a procedure described in previous literature, 25 and Fourier transformations were performed on k 3weighted EXAFS oscillations in the range 3-10 A -1 .The curvefitting of the EXAFS data were carried out by employing the iterative nonlinear least-squares method and the empirical backscattering parameter sets extracted from the shell features of the titanium compounds. SEM images were collected on a Camscan Series Model 2-LV electron microscope operating at an acceleration voltage of 15 kV.From the SEM images of Ti-(OH) and Ti-(F) catalysts, the Ti-(OH) (0.25-0.50 m ca.) catalyst has a much smaller particle size as compared to the Ti-(F) catalyst (5-7.5 m ca.).From the BET surface area measurements, the surface area of Ti-(OH) and Ti-(F) was 630 and 443 m 2 g -1 , respectively."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Local Structure of the Titanium Oxide Species. Figure 1 shows the diffuse reflectance UV-vis absorption spectra of the Ti- and TS-1 zeolite catalysts.These catalysts exhibit an absorption band in the wavelength region of 200-260 nm, attributed to the LMCT (ligand-to-metal charge transfer) band of the highly dispersed tetrahedrally coordinated titanium oxide species. 262728 Figure 2 shows the XANES spectra of the Ti- zeolites.The XANES spectra of the titanium oxide catalysts at the Ti K-edge show several well-defined preedge peaks, which are related to the local structures surrounding the Ti atoms.The number, position, and relative intensity of these preedge peaks provide vital information on the coordination environment of Ti. 293031 In a tetrahedral symmetry, one intense single preedge peak corresponding to a dipolar-allowed transition from the 1s to t2 molecular levels built from the 3d and 4p metal orbital and from a neighboring orbital could be observed. 32As shown in Figure 2 a-c, the Ti-(OH), Ti-(F), and TS-1 zeolite catalysts exhibit one intense preedge peak.It was found that the local structure of the titanium oxide species of these zeolites is in tetrahedral coordination. Figure 2 also shows the FT-EXAFS spectra of the zeolite catalysts, and all data are given without corrections for phase shifts.All of the zeolite catalysts exhibit a strong peak at around 1.6 A, which could be assigned to the neighboring oxygen atoms (a Ti-O bond).Ti-(OH) (Figure 2-A) and Ti-(F) (Figure 2-B) as well as TS-1 (Figure 2-C) exhibit only a Ti-O peak, indicating the presence of an isolated titanium oxide species on these zeolite catalysts.From the results obtained by the curvefitting analysis of the EXAFS spectra, it was found that the titanium oxide species incorporated within these zeolite frameworks exists in tetrahedral coordination with a Ti-O bond distance of 1.84 A for Ti-(OH) and 1.83 A for Ti-(F).These XAFS (XANES and FT-EXAFS) and diffuse reflectance UVvis absorption investigations indicated that the local structure of the titanium oxide species are the highly dispersed and exist in tetrahedral coordination, while differences in the coordination geometry of these species for Ti-(OH) and Ti-(F) could scarcely be observed. FT-IR and Adsorption Isotherm of H 2 O. Figure 3 shows the FT-IR spectra of Ti- zeolites in the range of 2800-4000 cm -1 .In the spectra of Ti-(OH) (Figure 3a) and TS-1 (Figure 3b), an intense band at 3740 cm -1 and a weak and broad band in the 3400-3700 cm -1 region are observed, and these are assigned to the isolated silanol groups and silanol groups having strong hydrogen bonds, respectively. 3334435 In the case of Ti(F) (Figure 3c), weak bands at 3740 cm -1 as well as at 3731 and 3692 cm -1 could be observed.The latter two bands are assigned to silanol groups having weak hydrogen bonds. 23In general, high-silica zeolites synthesized in an OH -medium show a large concentration of defects, typically exceeding the concentration needed to compensate the charge of the templates. 36The strong intensity of the band at 3740 cm -1 for Ti(OH) and TS-1 indicates the presence of a large amount of defect sites in these zeolite catalysts. Figure 4 shows the adsorption isotherm of H 2 O molecules at 298 K.A larger amount of adsorbed H 2 O molecules can be observed with Ti-(OH) and TS-1 than for Ti-(F).In the XPS measurements, the presence of a trace amount of F atoms can be observed on the surface of Ti-(F).The presence of F atoms on the catalyst surface tends to prevent the adsorption of H 2 O on the catalyst.The difference in the amount of adsorbed H 2 O molecules can be ascribed to the high concentration of defects with Ti-(OH) and TS-1 and the presence of F atoms for Ti-(F).These different characteristics of Ti-(OH) and Ti-(F) can readily explain their respective hydrophilic and hydrophobic properties.The hydrophilicity of Ti-(OH) was found to be the highest among these zeolite catalysts. In Situ XAFS. Figure 5 shows the effect of the addition of H 2 O molecules on the intensity of the preedge peak and the shift in the XANES spectra.In both Ti- zeolites, the addition of H 2 O molecules leads to a decrease in the preedge peak intensity.The peak intensity decreased more significantly on Ti-(OH) with the addition of H 2 O than that for Ti-(F).Moreover, on Ti-(OH), the position of the preedge peak shifts to the high-energy region by the addition of excess amounts of H 2 O molecules (4.6 mmol/g-cat).The decrease in the peak intensity and the shift in the peak position of the preedge peak intensity are attributed to a modification in the local geometry of the Ti atoms from the tetrahedral coordination to a 5-or 6-fold coordination.Since the amount of H 2 O molecules for the photocatalytic reaction was to be about 3.6 mmol/g, it can be supposed that most of the titanium oxide species retain a tetrahedral coordination and a part of them probably have a 5or 6-coordinated geometry.Although a decrease in the preedge peak intensity and a shift in the position of the preedge peak could be observed with Ti-(F), it was not as remarkable as that of Ti-(OH).These results indicate that H 2 O molecules easily access to the tetrahedrally coordinated titanium oxide species of Ti-(OH), which is in agreement with the results obtained from measurements of the adsorption isotherms of the H 2 O molecules. Photoluminescence. Figure 6 shows the photoluminescence spectra of Ti-(OH) and Ti-(F).These zeolite catalysts exhibit a photoluminescence spectra at around 480 nm by excitation at 260 nm at 77 K.Although the photoluminescence spectra of these catalysts at 298 K shifted to a lower wavelength (460 nm), the relative intensity of the photoluminescence with Ti-(OH) and Ti-(F) maintained the same ratio.The observed photoluminescence spectra were attributed to the radiative decay process from the charge-transfer excited state to the ground state of the highly dispersed tetrahedrally coordinated titanium oxide species. 37As shown in Figure 6, the photoluminescence yield of the Ti-(OH) and TS-1 catalyst is higher than that of the Ti-(F) catalyst.The photoluminescence yields can be said to be related to the concentration of the charge-transfer excited complexes, Ti 3 -O -.A difference in the environment around the Ti sites in these zeolites and the presence of F atoms on Ti-(F) may be related to the low intensity of the photoluminescence.Additionally, as shown in Figures 7 and8, it was found that the addition of CO 2 and H 2 O molecules on Ti-(OH) and Ti-(F) leads to a quenching of the photoluminescence at 298 K.At the same time, it was also observed that the lifetime of the charge-transfer excited state was shortened by the addition of CO 2 and H 2 O molecules.The lifetime of Ti-(OH) was 173 s under vacuum and 147 s in the presence of 0.53 mmol/g of H 2 O (153 s in the presence of 1.1 mmol/g of CO 2 ), whereas the lifetime of Ti-(F) was 159 s under vacuum and 150 s in the presence of 1.04 mmol/g of H 2 O (152 s in the presence of 15.8 mmol/g of CO 2 ).Such a quenching of the photoluminescence with the addition of CO 2 and H 2 O molecules suggests that the added CO 2 and H 2 O interacts with the titanium oxide species incorporated within the Ti- zeolite in its excited state.As also shown in Figures 7 and8, the quenching of the photoluminescence of these Ti-(OH) and Ti-(F) with CO 2 molecules shows almost the same quenching efficiency.On the other hand, the quenching of the photoluminescence of the Ti(OH) catalyst with H 2 O molecules is much more efficient than that with the Ti-(F) catalyst.From these results, it is clear that an efficient quenching by the addition of H 2 O observed with Ti-(OH) can be attributed to its hydrophilic properties due to the easy accessibility and interaction of H 2 O molecules with the excited state of the tetrahedrally coordinated titanium oxide species. Photocatalytic Reaction.Figure 9 shows the yields of the main products in the photocatalytic reduction of CO 2 with H 2 O 323 K. UV irradiation of Ti- zeolite photocatalysts in the presence of CO 2 and H 2 O led to the formation of CH 4 and CH 3 OH as well as trace amounts of CO, C 2 H 4 , and O 2 .As shown in Figure 9, Ti-(OH) exhibits higher reactivity compared to Ti-(F).On the other hand, the selectivity for the formation of CH 3 OH from Ti-(F) (41) is higher than for that from Ti-(OH) (11).Moreover, the selectivity for the formation of CH 3 OH from Ti-(F) is higher than that of the other Ti-containing zeolites and molecular sieve catalysts (TS-1 (23), Ti-MCM-41 (31), Ti-MCM-48 (29)).The higher reactivity of Ti-(OH) over Ti-(F) is attributed to the higher concentration of the charge-transfer excited complexes for Ti-(OH) as observed by the photoluminescence. In our previous studies, it has been found that the competitive interaction of CO 2 and H 2 O molecules with the charge-transfer excited state of the tetrahedral titanium oxide species results in the formation of C radicals, H atoms, and OH radicals on the surface, while CH 4 and CH 3 OH are formed by the reaction of C radicals with H atoms and OH radicals. 11,12On Ti-(F) which has hydrophobic properties, the relative concentration of H 2 O is much lower than that for Ti-(OH), resulting in the lower reactivity yet high selectivity for the formation of CH 3 OH. The effect of the F atoms on the photocatalytic reduction of CO 2 with H 2 O on the other catalysts was also investigated.As shown in Figure 10, the partially fluorinated catalysts exhibit higher selectivity for the formation of CH 3 OH than the original catalysts without fluorination.Although a significant increase in CH 3 OH selectivity could be observed with the fluorinated catalysts, the CH 3 OH selectivity is still less than 30.This is ascribed to the fact that the fluorinated Ti/FSM-16 still exhibits slight hydrophilic properties associated with the presence of hydroxyl groups.However, as shown in Figure 11, it was confirmed that fluorinated catalysts have smaller amounts of hydroxyl groups than unfluorinated catalyst.These results indicate the same tendency as the FT-IR results for the Ti- catalysts and do support the view that the hydrophobic property allows a higher selectivity for the formation of CH 3 OH.The chemical nature of being either hydrophilic or hydrophobic seems to affect on the product selectivity in the photocatalytic reaction."
  },
  {
    "title": "Conclusions",
    "content": "Ti- zeolites synthesized under different conditions, i.e., Ti(OH) and Ti-(F), and their photocatalytic reactions for CO 2 reduction with H 2 O at 323 K have been investigated.From the UV-vis absorption and XAFS (XANES and FT-EXAFS) spectra, the titanium oxide species of Ti-(OH) and Ti-(F) were found to be highly dispersed in tetrahedral coordination in the zeolite frameworks.No large difference existed in the coordination geometry for the titanium oxide species in both zeolites.Measurements of the FT-IR spectra and the adsorption isotherm of H 2 O indicated that the surface chemical properties of these Ti- were hydrophilic for Ti-(OH) and hydrophobic for Ti-(F).The hydrophilic properties of Ti-(OH) caused a higher efficiency in the quenching of the photoluminescence with the addition of H 2 O and a large change in the Ti coordination in the rehydration process, indicating that H 2 O molecules can more easily gain access to the tetrahedrally coordinated titanium oxide species on Ti-(OH) than on Ti(F).UV irradiation of these Ti- zeolites in the presence of CO 2 and H 2 O led to the formation of CH 4 and CH 3 OH and trace amounts of CO, C 2 H 4 , and O 2 .Ti-(OH) catalyst having hydrophilic properties exhibited higher reactivity than Ti-(F), attributed to the higher concentration of the charge-transfer excited complexes, (Ti 3 -O -).On the other hand, a highly selectivity for the formation of CH 3 OH was observed on the Ti-(F) catalyst having hydrophobic properties.Therefore, the hydrophilic-hydrophobic properties of these zeolites were found to be the controlling factor in the reactivity and selectivity for the photocatalytic reduction of CO 2 with H 2 O. Figure 1.Diffuse reflectance UV-vis absorption spectra of Ti- (OH) (a), Ti-(F) (b), and TS-1 (c) catalysts. Figure 2. Ti K-edge XANES (a-c) and FT-EXAFS (A-C) spectra of Ti-(OH) (a, A), Ti-(F) (b, B), and TS-1 (c, C).CN, coordination number; R, Ti-O bond distance (A). Figure 3. IR peaks attributed the surface hydroxyl groups on the Ti(OH) (a), TS-1(b), and Ti-(F) (c) catalysts. Figure 4. H2O adsorption isotherms at 298 K of Ti-(OH) (a), TS-1 (b), and Ti-(F) (c) catalysts. Figure 5.Effect of the addition of H2O molecules on the preedge peak of the XANES spectra.(a) Ti-(OH) and (b) Ti-(F).The amount of added H2O molecules: 0, 1.4, 3.0, 4.6 mmol/g-cat (from top to bottom). Figure 6.Photoluminescence spectra of the Ti-(OH) (a), TS-1 (b), and Ti-(F) (c) catalysts at 77 K. Excitation at 260 nm. Figure 7. Effect of the addition of CO2 molecules on the photoluminescence spectra of Ti-(OH) (a) and Ti-(F) (b) catalysts at 298 K. Excitation at 260 nm.The amounts of the added CO2: (a) 0, 0.05, 0.21, and 1.1 mmol/g; (b) 0, 5.3, 10.5, and 15.8 mmol/g (top to bottom, respectively). Figure 8.Effect of the addition of H2O molecules on the photoluminescence spectra of Ti-(OH) (A) and Ti-(F) (B) catalysts at 298 K. Excitation at 260 nm.The amounts of the added H2O: (A) 0, 0.11, 0.27, and 0.53 mmol/g; (B) 0, 0.27, 0.52, and 1.04 mmol/g (top to bottom, respectively). Figure 9.Yields of CH4 and CH3OH in the photocatalytic reduction of CO2 with H2O at 323 K on the Ti-(OH), TS-1, Ti-(F), and TiO2 (P-25) catalysts.Intensity of light is 265 W cm -2 .Reaction time is 6 h. Figure 10.Effect of the fluorination of FSM-16 on the yields of CH4 and CH3OH in the photocatalytic reduction of CO2 with H2O on Ti/ FSM-16 catalysts: (a) no treatment, (b) 12.5 NH4F treatment, and (c) 25.0 NH4F treatment. Figure 11.IR spectra in OH stretching region of the fluorinated Ti/ FSM-16 catalysts: (a) no treatment, (b) 12.5 NH4F treatment, and (c) 25.0 NH4F treatment. J. Phys.Chem.B, Vol.105, No. 35, 2001 Ikeue et al. J. Phys.Chem.B, Vol.105, No. 35, 2001 Ikeue et al. Acknowledgment.The present work has been supported in part by the Grant-in-Aid on Priority-Area-Research on \"Molecular Physical Chemistry\" (12042271).The kind guidance on zeolite synthesis by Prof. M. E. Davis and people in his group of Caltech are gratefully acknowledged."
  }
]