[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2020.119832"
  },
  {
    "title": "Article_Title",
    "content": "Light-facilitated structure reconstruction on self-optimized photocatalyst TiO2@BiOCl for selectively efficient conversion of CO2 to CH4"
  },
  {
    "title": "Abstract",
    "content": "Developing well-designed photocatalysts with optimal activity and selectivity is a promising strategy for converting CO 2 to renewable fuels.Herein, a self-optimized photocatalyst TiO 2 BiOCl is prepared by facile growth of ultrathin BiOCl lamina on the defective surface of TiO 2 nanotube.Facilitated from light irradiation, Hincorporated oxygen vacancies form on defective TiO 2 nanotube matrix to extend light adsorption range, meanwhile Bi 0 atom is reduced from BiOCl lamina to restructure atomic heterojunction BiOCl-Bi 0 -TiO 2 .Bi 0 atom pours photo-generated electrons directly to Ti 3 in H-incorporated oxygen vacancy, gathering electrons efficiently to accelerate the photocatalytic efficiency.Bi-Ti dual metal sites and H-incorporated oxygen vacancies optimize CO 2 reduction path to achieve high CH 4 selectivity.Finally, the magnificent surface-reconstruction on TiO 2 BiOCl chalks up highest CH 4 productivity rate of 168.5 mol g -1 h -1 and optimal CH 4 selectivity of 99.4 during CO 2 photoreduction.Thus, the pioneering construction of efficient photocatalyst with self-optimized strategy paves a new way to fabricate efficient photocatalyst."
  },
  {
    "title": "Experimental",
    "content": "The TiO 2 nanotube samples used in this experiment were synthesized through the method reported by Kasuga et al. with a little improvement 33.At first, 50 mg commercial P25 and 50 mL NaOH solution (10 M) were mixed together.Then, the suspension was treated at 150 C for h in a Teflon vessel.After that, the resulted white products were washed with 0.1 M HCl solution and deionized water for several times.At last, the washed white color products were dried at 80 C to obtain the required TiO 2 nanotubes in the experiment. A chemical impregnation method was employed to load the BiOCl on the TiO 2 nanotubes.A certain amount of BiCl 3 and HCl were added to mL ethanol to obtain solutions with respective Bi 3 concentrations.Then, 50 mg obtained TiO 2 nanotube was added into above acidic Bi 3 solution with continuously stirring for 1 h.After that, the Bi 3 loaded TiO 2 nanotubes were centrifuged and dried at 80 C for 1 h to get white samples. Finally, the white samples were calcined at 400 C for 2 h.Bi 3 concentrations used in this experiment were 0 M, 0.005 M, 0.010 M, 0.015 M, 0.020 M and 0.025 M, and the obtained nanocomposites were named TO, 5TBC, 10TBC, 15TBC, 20TBC and 25TBC, respectively. X-ray diffraction instrument (Bruker D8 Advanced) using Cu K radiation ( 1.5405A) was employed to detect the crystalline structure of the samples.Transmission electron microscope (JEOL JEM2100) was utilized to analyze the morphology of the samples.High-angle annular dark-field scanning transmission electron microscopy (JEOL JEM-ARF200 F TEM/STEM) with a spherical aberration corrector was used to probe the rational relationship between Bi element and TiO 2 nanotubes.Brunauer-Emmett-Teller (BET) specific surface area was analyzed by nitrogen adsorption in a BET apparatus (Quantachrome Autosorb-iQ gas adsorption analyzer).Photoluminescence (PL) spectra were recorded on a Fluorescence Spectrophotometer (Hitachi F-7000).Time-resolved photoluminescence spectra were measured on a FLS980 Multifunction Steady State and Transient State Fluorescence Spectrometer (Edinburgh Instruments, 370 nm excitation, room temperature).X-ray photoelectron spectroscopy (XPS) measurement was made in an ultrahigh vacuum electron spectrometer (VG ESCALAB 210) with a multichannel detector.The electron paramagnetic resonance (EPR) spectrum was collected by an electron paramagnetic resonance spectrometer (Model EMX-10/12 X-band, Bruker, Germany) at low temperature. The electrochemical measurements were performed on an electrochemical station (CHI660D) with a three-electrode configuration.The counter electrode was a Pt sheet, and Ag/AgCl electrode was employed as a reference electrode.Meanwhile, the Na 2 SO 4 aqueous solution (0.5 M) was used as the electrolyte.Electrochemical impedance spectroscopy (EIS) were recorded at 0 V DC bias potential with 10 mV oscillation amplitude and the frequency ranged from 100 mHz to 1 MHz.Photocurrent was measured through a chronoamperometry method at 1.0 V bias potential (vs.Ag/AgCl) with the illumination \"on\" and \"off\" for 20 s internal. Periodic density functional theory (DFT) calculations were performed using the Cambridge Sequential Total Energy Package (CASTEP) in Materials Studio software (Accelrys Inc.).The exchange correlation functional was employed with the Perdew-Burke-Ernzerhof (PBE) parameterization of the generalized gradient approximation (GGA).The cut-off energy for the plane wave was 450 eV and the self-consistent field (SCF) tolerance was 1.0 10 -6 eV/atom. To calculate the electron transportation property in the interface between TiO 2 and BiOCl, a slab model consisted of a crystal face of anatase and (001) plane of BiOCl were establiahed to represent the contact surface between anatase and BiOCl.Both of the TiO 2 and BiOCl primitive cells were geometry optimized before the construction of TiO 2 BiOCl heterojunction.Then, the 1 23 supercell of anatase and a 1 22 supercell of BiOCl were linked together at a distance of 2 A.In order to overcome the interaction between adjacent slabs, the vacuum layer thickness of 20 A was chosen.The Brillouin zone was sampled on a 1 41 Monkhorst-Pack grid.Then, the heterojunction was geometry optimized and corresponding electron density difference was calculated. In order to reveal the electron transportation between Bi 0 atoms and oxygen vacancy on TiO 2 , the electron density difference of Bi 0 -TiO 2 was calculated.A 3 23 supercell of anatase including 144 oxygen atoms, 72 titanium atoms was employed as the surface of TiO 2 .The anatase surface is terminated by twofold coordinated bridging oxygen atoms and threefold coordinated in-plane oxygen atoms.The formation energy of bridging oxygen vacancy and in-plane oxygen vacancy on the anatase surface were calculated, which was calculated by Eq. 1: 34 Herein, E(Vo-TiO 2 ) is the total energy of the cell with surface oxygen vacancy, E(O 2 ) is the energy of O 2 molecule and E(TiO 2 ) is the total energy of the intrinsic cell.According to the formation energies of different oxygen vacancies, the bridging oxygen vacancy was selected as the more stable oxygen vacancy configuration for the study of deficient TiO 2 .Bi atom was put on the different locations of the oxygen vacancy with a distance of 2 A.After geometry optimization, the relative location between anatase and Bi 0 was estimated based on the energy.Then, electron properties of heterojunction models were calculated following the geometry optimization.H 2 O adsorption energy on H-free oxygen vacancy and H-incorporated oxygen vacancy of TiO 2 were calculated respectively to reveal the relationship between H 2 O adsorption and H modification.Different H locations on oxygen vacancy of TiO 2 were calculated, and the most stable configuration was chosen as the model of H-incorporated oxygen vacancy on TiO 2 .The H 2 O adsorption energy at the oxygen vacancy of TiO 2 (Vo-TiO 2 ) is defined in Eq. 2: 35 Where E(H 2 OVo-TiO 2 ) is the computed total energy of the relaxed adsorption structure of H 2 O at oxygen vacancy of TiO 2 surface, both Hfree and H-modification.E(H 2 O) is the energy of H 2 O molecular. In a typical procedure, 50 mg photocatalyst was firstly dispersed in 2 mL deionized water under ultrasonic treatment for 1 h.Then, the obtained white suspension was dropped on a piece of glass microfiber filter paper (Whatman, calcined at 450 C for 4 h before used).Afterward, the loaded glass paper was dried at 80 C for 2 h.The dried glass paper was later hanged in the test reactor of a water-splitting system (PLS, Trusttech Co., Ltd.), with the photocatalyst side facing light source, supported by a conical flask.Meanwhile, the mixture of 5 L acetonitrile and 1 mL H 2 O was injected into the test reactor through the injection port.After that, the water-splitting system was vacuumized by a vacuum pump, and then filled with ultrahigh purity CO 2 (99.999 ), until the pressure of the system reached 80 kPa.Before illumination, the system filled with CO 2 was maintained in dark for 12 h to achieve adsorption-desorption equilibrium of CO 2 on the surface of photocatalyst.Finally, a 300 W high pressure xenon lamp (MICROSOLAR300, Trusttech Co., Ltd.) was utilized to provide light source for the photocatalytic process.After irradiation for 4 h, the products of the photoreduction were monitored by a GC-2014C gas chromatograph (Shimadzu, Japan).The isotopelabeled experiment was conducted with 13 CO 2 , and the reduction products were analyzed with a gas chromatography-mass spectrometry (GC-MS, MS5977B, Agilent). In situ DRIFTS measurements were recorded on the FTIR spectrometer (Bruker) with an in situ diffuse reflectance cell (Thermal).The asprepared photocatalyst sample were pretreated in the cell in vaccum at 200 C to remove the possible hydrocarbons.After the photocatalyst was cooled to room temperature, the FTIR spectrum was recorded as background.Then, gas mixture (CO 2 and H 2 O) was introduced into the in situ cell.The time for CO 2 and H 2 O adsorption on photocatalyst was 20 min.After that, CO 2 photoreduction on the surface of photocatalyst was proceeded for 50 min by lightening the 300 W xenon lamp."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Defective ultrathin TiO 2 BiOCl heterostructure was prepared by a harsh hydrothermal coupled annealing method, as schematically illustrated in Fig. 1a.Benefitting from the special space geometry-dependent virtues, tubular TiO 2 structure effectively avoid the aggregation, overlapping of surfaces, maximally increasing the probability of contact between reactant and catalyst.Furthermore, tubular morphology enlarges the specific surface area and shorten the carriers transport pathway, making tubular TiO 2 as a promising configuration category for catalysis.To ensure that ultrathin BiOCl tiny lamina anchors on TiO 2 nanotube slowly, HCl is added into BiCl 3 solution to inhibit the nucleation and growth rate of BiOCl.Simultaneously, defects and cavities are also created on the tube by HCl etching, leading to artificially defective TiO 2 nanotube.The intimately spatial relationship of TBC (Fig. S1d) discloses that laminar BiOCl grows on the ultrathin TiO 2 nanotube with a few atomic layers thickness, suggesting a quite short transport distance and intimate interfacial contact.Thus, the rational designed heterojunction assures instantaneous bulk-to-surface transport, interfacial transfer and rapid separation for charge carriers.Moreover, XPS result confirms that Bi atom percentage of 15TBC is about 1 , indicating the low content of BiOCl in composite. During HCl etching, anatase TiO 2 nanotubes (JCPDS21-1272) change into defective TiO 2, peaks intensity of TBC getting an obviously decrease than that of bare TiO 2 (Fig. 1b).However, no BiOCl signal is detected due to the small content of BiOCl.Then, aberration-corrected high-angle-annular-dark-field scanning transmission electron microscopy (AC-HAADF-STEM) characterization illustrates the distribution of BiOCl on the tubular TiO 2 .In the AC-HAADF-STEM image (Fig. 1c), a lot of isolate bright spots appear on the surface of the nanotubes, some even arranging to a disc with the diameter about 2-3 nm.Atom mass of Bi is larger than that of Ti, endowing Bi with brighter image in the AC-HAADF-STEM image 36.Thus, the brighter white spots are Bi in BiOCl lamina, representing the location of BiOCl.The atomically dispersed Bi atoms confirm that the loaded BiOCl is an ultrathin lamina.Corresponding element mappings in Fig. 1d-g suggest the existence of Ti, O, Bi, Cl.Elements Ti and O disperse on the tubular composites homogeneously, while elements Bi and Cl scatter on it, due to the separated location of BiOCl wafer.Moreover, the statistic atom ratio of Bi is around 1 (Fig. S2), which is consistent with the statistic result of XPS.On the other hand, aberration-corrected high-resolution transmission electron microscopy (AC-HRTEM) bright field image in Fig. 1h shows several atomic vacancies and disorders on TiO 2 nanotube, as labeled by red circles.The rough surface suggests the defective wall of TiO 2 nanotube, created by HCl etching during BiOCl loading process.Furthermore, electron spin resonance (EPR) of the defective sample (Fig. 1i) shows a sharp signal at g 2.002 and a broad step at g 1.950, assigned to the oxygen vacancy and Ti 3 respectively 26,37.In this way, AC-HRTEM and EPR unveil the existence of abundant oxygen vacancies on the TiO 2 nanotube.Thus, tiny BiOCl lamina is loaded on defective TiO 2 through a simple and reproducible method. Large surface area with abundant active sites is significantly imperative for efficient photocatalyst.N 2 adsorption-desorption isotherms of TiO 2 and the composite are type IV with type H 3 hysteresis loops (Fig. 2a) 38.The adsorption capacity of both samples is high at P/P 0 of 0.8-1.0,indicating the presence of mesopores and macropores 39.The specific surface area of TiO 2 nanotube is 146 m 2 g -1 , which is much higher than that of P25 (55 m 2 g -1 , Fig. S3).However, specific surface area of TBC get a significant increase (314 m 2 g -1 , Fig. 2a).Because atomic layers of the nanotube curl loosely within large interspace (Fig. S1c), H in HCl-BiCl 3 solution permeates in the interlayer to etch the atomic layers from both sides.Then, the severe etching results in defects and cavities on the atomic layers, which increases the surface area of TBC.Furthermore, after immersed in Bi 3 solution for 1 h, the flexible atomic layers on nanotube curls in a less tight way and even exfoliate, further increasing the surface area of TBC.As a result, the cavities, exfoliated TiO 2 layers and attached BiOCl lamina engineer new pore structure, leading to substantial increase on specific surface area of TBC.The pore size distribution of TiO 2 ranges from 8 nm to 45 nm with a centralization at about 12.5 nm (Fig. 2b).However, in the defective TBC heterostructure, the minimum pore size is 5 nm with a centralization at 6 nm, indicating the formation of pores in smaller size.Loading BiOCl on TiO 2 nanotubes leads to increased surface area and the production of new pore structure, offering more CO 2 adsorption and reactive sites during CO 2 photoreduction process. Except for ample reactive sites, strong ability for photo-induced electrons collection is also quite essential for an excellent photoreduction catalyst.A series of photoelectric characterizations were investigated on the electron collection ability of as-prepared TBC.P25, TiO 2 nanotube and TBC show similar PL emission spectra (Fig. 3a).Peak at 397 nm is assigned to the emission of bandgap transition.The PL peaks at 434 nm and 467 nm are attribute to the tetrahedral Ti(IV) ones and charge-transfer transition from Ti 3 to oxygen anion in a TiO 6 octahedral complex, respectively 40,41.All the peaks intensity of TiO 2 nanotube slightly decrease because abundant defects on the ultrathin tube tend to catch electrons to facilitate carriers separation efficiently.Moreover, all the peaks intensity of TiO 2 nanotubes significantly decrease after BiOCl loading, implying that TiO 2 coupled BiOCl retards the recombination of light-induced charge carriers tremendously.The results demonstrates that the PL intensity are sensitive to the loading of BiOCl.Coupling BiOCl with TiO 2 , the resulted built-in electric field in their interface effectively inhibits the charge carriers recombination.Among all of as-prepared heterostructures, 15TBC exhibits the lowest intensity of PL emission spectra, suggesting that the loading weight of BiOCl can optimize the recombination efficiency of photo-induced charge carriers in TBC.Meanwhile, time-resolved photoluminescence (TRPL) decay spectra in Fig. 3b show that TBC heterostructure extends the radiation lifetimes from 0.99 ns of TiO 2 nanotube to 2.33 ns of 15TBC, which suggests that heterostructure efficiently speeding up the photo-generated charge carriers transfer, depressing charge carriers recombination.On the other hand, EIS circular diameter of 15TBC is smaller than that of TiO 2 (Fig. 3c), suggesting that heterojunction results in reduced electron transfer resistance.Whilst, the current density of TBC is significantly strengthened than that of TiO 2 (Fig. 3d), consistent well with the EIS results.During the first irradiation stage, their currents decreased sharply after the initial increase, suggesting that photo-generated carriers recombination occurred quickly after the photo-generated electron-hole separation.In the following irradiation stages, the photocurrent of TiO 2 continuously increases at the first 10 s and then reachs steady states, but that of 15TBC progressively increases throughout the complete 20 s.Compared with the photocurrent of TiO 2 , the continuously increased photocurrent of 15 TBC in the following 10 s is attributed to the increased charge carriers on the interface of TiO 2 and BiOCl 42.Consequently, TBC heterostructure completely optimizes the processes of carriers separation and transportation, which finally facilitates electron aggregation to enhance the photocatalytic efficiency.In addition, to uncover the transfer direction of photo-induced electron on the interface of TiO 2 and BiOCl, density-functional-theory (DFT) calculation is employed to calculate the electron density difference on the TBC heterostructure (Fig. 3f).The electron density difference image (Fig. 3f) shows electrons flow from BiOCl to TiO 2 surface, which means efficient photo-generated electron-hole separation and transfer occurring on the interface of the heterojunction 43.The calculated result is consisted well with the photoelectric characterization above.Furthermore, the electron flowing from BiOCl to TiO 2 results in electron gather on the surface of TiO 2 , declaring that the photoreduction reaction is favorable on TiO 2 .Moreover, the band structures of bare TiO 2 and BiOCl (Fig. S4c) are derived based on the results of UV-vis diffuse reflectance spectra (Fig. S4a) and valance spectra (Fig. S4b).The band structures and the electron flow direction of TBC suggests that a II-type heterojunction is established between TiO 2 nanotube and BiOCl lamina 42, To shed light on the advantage of the synthesized TBC nanocomposite, CO 2 photoreduction evolution performance of bare TiO 2 and TBC are evaluated with CO 2 and the mixture of H 2 O and acetonitrile under UV-vis light irradiation (Fig. 4a).Three controlled experiments are conducted firstly: (1) CO 2 the mixture of H 2 O and acetonitrile within photocatalyst in dark; (2) CO 2 the mixture of H 2 O and acetonitrile without photocatalyst under UV-vis light irradiation; (3) N 2 the mixture of H 2 O and acetonitrile within photocatalyst under UV-vis light irradiation. In the controlled experiments ( 1) and ( 2), neither carbon ramification nor H 2 is detected.And in the controlled experiment (3), a small amount of H 2 was detected, but no carbon ramification is found.Thus, the controlled experiments results suggest the production in Fig. 4a are generated from the CO 2 photocatalytic reduction.First, CO 2 photoreduction performance on commercial P25 is measured as a contrast test.The primary photoreduction products on P25 are CO and CH 4 , but the major products on TiO 2 nanotube is only CH 4 .Compared with commercial P25, TiO 2 nanotube not only enhances the selectivity of CH 4 , but also improves the evolution rate of CH 4 by thirteen times.The photocatalytic CO 2 reduction activity of TBC is further enhanced by incorporating BiOCl on TiO 2 nanotube.Especially, the product yield of the optimized sample 15TBC is 168.5 mol g -1 h -1 for CH 4 , with the selectivity of CH 4 as high as 99.4 .In order to illustrate the advantages of the construction of TBC heterostructure, CO 2 photocatalytic reduction performances of TiO 2 -based photocatalysts regulated with other methods have been summarized and listed in Table S1.Furthermore, isotope experiment with 13 CO 2 demonstrates that the carbonaceous reduction products are reduced from the CO 2 (Fig. S5).However, pure BiOCl can not reduce CO 2 .When pristine BiOCl is employed as photocatalyst in the same experimental condition, neither carbonaceous products nor H 2 is detected, and the initial white BiOCl changes to light grey one (Fig. S6).Interestingly, after 4 h CO 2 photoreduction, the original white TiO 2 nanotubes display blue color (Fig. 4b,d), while TBC nanocomposites change their color from pale yellow to black (Fig. 4c,e).The color changes on photocatalysts indicate that surface transformations occur on them. Defective engineering is critical to improve the performance of TiO 2 in energy storage and conversion 22232425454647.Usually, the defective TiO 2 samples are prepared through a harsh process, such as treating TiO 2 in a reduced gas atmosphere at high temperature and/or high pressure.Then, the defective samples result in different colors, such as grey, blue, black, etc. 46,47.Interestingly, the blue colored defective TiO 2 in CO 2 photoreduction, is facially produced in a fairly mild way.Under the irradiation of UV light, photo-induced electron-hole pairs are generated in TiO 2 nanotube.The holes are trapped by lattice oxygen that can weaken O-Ti interaction, and simultaneously electrons prefer gathering in the oxygen vacancy to help deriving H from H 2 O. 48 Partial resultant H incorporate with Ti to form Ti-H bond, leading to formation of H-incorporated oxygen vacancies on the surface of TiO 49,50.Moreover, benefit from the ultrathin TiO 2 nanotube, H penetrate the atomic wall of TiO 2 to scissor the oxygen atoms out from weakened Ti-O bond, creating more H-incorporated oxygen vacancies 22,51.Finally, plenty of H-incorporated oxygen vacancies in ultrathin TiO 2 nanotube result in a blue colored TiO 2 .Moreover, the H-incorporated oxygen vacancy produced in the CO 2 photoreduction process is a metastable state, which is a H reservoir providing H for the photocatalytic reaction continuously.When the mixed gas of O 2 and N 2 (20 vol percent oxygen) is induced into the reactor, the blue TiO 2 transforms to white color instantaneously, as the vivid process shown in the video.Furthermore, a verification test is conducted to confirm the presence of H-incorporated oxygen vacancies in the photocatalytic induced blue TiO 2. The as-prepared TiO 2 nanotube is deposited in a steel reactor with a quartz window, then slight H 2 is induced to the reactor to maintain a negative pressure.After 30 min of UV-vis light irradiation, the TiO changes from white to blue (Fig. S7a,b), verifying that H replace O to produce defective TiO 2 with blue color 48. Attribute to the introduction of defect level to energy band, defective TiO 2 can extent the light absorption range from UV light to visible light 26,27,45.Under visible light (400 nm), the CH 4 productivity of defective TiO 2 is 7.9 mol g -1 h -1 with near 100 selectivity (Fig. S8). In the photocurrent test of TiO 2 (Fig. 3d), light irradiation induces the generation of H-incorporated oxygen vacancy, which facilitates the photo-induced electron-hole separation.Then, defect extension of TiO results in enhanced light absorption to improve the conductivity progressively at the initial 10 s, and saturated defect level lead to steady photocurrent at the following 10 s.During the CO 2 photoreduction, defective TiO 2 nanotubes not only provide large surface with abundant catalytic sites, but also produce H-incorporated oxygen vacancies to extent the light absorption range, leading to enhanced productivity. Enhanced charge carriers separation efficiency in heterostructure can significantly boost the productivity of CO 2 photoreduction 18.Anchoring BiOCl lamina on TiO 2 nanotube efficiently enhances the photo-generated electron-hole separation, offering plentiful electrons to improve the photocatalytic efficiency.At the end of CO 2 photocatalytic reduction, the pale yellow (Fig. 4c) heterostructure TBC exhibits black color (Fig. 4e), suggesting that Bi atoms in BiOCl are even reduced to Bi 0 valance state (Bi 0 ).In addition, the black photocatalyst shows yellow color again after exposed in air for several hours, indicating that the Bi 0 turns into oxidation state in air.Further, XPS is employed to verify the changes in valance state of Bi atoms during CO 2 photoreduction experiment.Before light irradiation, peaks located at 159.3 eV and 164.6 eV in the Bi 4f spectrum of TBC (Fig. 5b) are related to Bi 4f 7/2 and Bi 4f 5/5 in BiOCl, respectively, indicating that Bi element is in the oxidation state (3) 42.After UV-vis light irradiation in CO 2 and H 2 O atomosphere for 4 h and 9 h, two peaks at lower binding energy related to Bi 4f 7/2 and Bi 4f 5/5 of Bi 0 , locating at 157.2 eV and 162.7 eV respectively, emerged (Fig. 5c,d)) 43.The appearance of Bi 0 declares that Bi 3 from BiOCl is partially reduced to Bi 0 valance state under UV-vis irradiation.Moreover, prolonging UV-vis light irradiation time in CO 2 and H 2 O, the amount of Bi 0 increases accompanied with more serious breakages on the crystal structure of BiOCl, leading to peaks in Bi 4f spectrum shifting to low binding energy (Fig. 5a).Owing to the weak Bi-O bond, the Bi-O in BiOCl lamina can be broken through light irradiation in previous reports 32.However, pure BiOCl does not change into black during the CO 2 photoreduction.So the black Bi 0 in TBC is not resulted from self-reduction of BiOCl under irradiation, suggesting that Bi 0 is reduced by photoinduced electoron of TiO 2 .With the assistance of H , the redox potential of BiOCl to Bi 0 is 0.1697 V (vs.NHE) 52.The CB of as-prepared TiO 2 nanotube in this work is calculated to be -0.39 eV (Fig. S4c), equal to -4.11 V (vs.NHE) 53, suggesting the possibility of photo-induced electrons of TiO 2 reducing Bi 3 in BiOCl to Bi 0 .Hence, with the irradiation of UV-vis light, TiO 2 nanotube splits H 2 O to H and the photo-generated electrons of TiO 2 partially reduce the BiOCl to Bi 0 at the interface of TiO 2 and BiOCl. Furthermore, the released Bi atoms distribute in single atom form (Fig. 1c).Thus, the Bi 0 single atoms on the interface of BiOCl-TiO 2 establish atomic bridges (BiOCl-Bi 0 -TiO 2 ) between BiOCl and TiO 2 . DFT calculations are performed to investigate the role of Bi in the electron transfer process.Oxygen vacancies on the surface of TiO 2 can efficiently trap light-generated electrons, thus more Bi 3 are reduced to Bi on oxygen vacancies during photocatalytic process.All the configures for Bi and oxygen vacancy on TiO 2 (Fig. S9) are geometry optimized at the same parameters, and the corresponding adsorption energy of Bi on TiO 2 are calculated.The most stable location of Bi atom on the oxygen vacancy of TiO 2 is chosen as the configuration of reconstructed Bi-TiO 2 in BiOCl-Bi -TiO 2 .Electron density difference of Bi-TiO 2 reveals that electrons in Bi atom are apt to transfer to the Ti 3 site in the oxygen vacancy of TiO 2 (Fig. 6a-c), establishing high-speed electron transport channel between BiOCl and TiO 2 .Further, photo-induced electrons from BiOCl can be orientated guided to the oxygen vacancy on TiO 2 .Then, both photo-generated electrons from TiO 2 and BiOCl are efficiently collected in oxygen vacancies on TiO 2 to boost the CO 2 photoreduction on TBC.Accordingly, in the photocurrent test (Fig. 3e), light irradiation induces the construction of Bi bridges progressively, and the corresponding photocurrent increases continuously in entire 20 s for the efficient electron transfer of Bi bridge.Moreover, the formation of Bi cluster would induce SPR (surface plasmon resonance) effect, which can enhance photocatalytic performance 54,55. The surface reconstructed photocatalyst not only speeds up the photoreduction efficiency but also optimizes the production species to S2), H 2 O adsorption energy on H-incorporated oxygen vacancy decreased 29.5 , comparing to that on H-free oxygen vacancy.It indicates that H modification on oxygen vacancy sharply depresses the adsorption of H 2 O on oxygen vacancy, efficiently dropping competitive H 2 production during photoreduction.Moreover, H-incorporated oxygen vacancy means H-rich oxygen vacancy, which can force CO 2 photoreduction on defective TiO 2 to proceed in a fast-hydrogenation process, resulting in enhanced CH 4 selectivity 56.Furthermore, Bi 0 coupling with surrounding Ti form dual metal catalytic sites to depress the desorption of intermediate CO, further reinforcing the hydrogenation process to strengthen the CH 4 selectivity 17.In this way, the further reinforced hydrogenation process coupled with increased electron injection on the oxygen vacancy of TiO 2 boosts selective generation of CH 4 , driving optimized CO 2 photoreduction process with high activity and selectivity. To further investigate the reaction mechanism of CO 2 and H 2 O on TiO 2 BiOCl, in situ Fourier-transform infrared spectroscopy (FTIR) is employed (Fig. 7a-c).During the adsorption stage of CO 2 and H 2 O on 15TBC, the mixed gas interacts with the surface of photocatalyst 15TBC to form carbonaceous chemical groups.Bands at 1595 cm -1 and cm -1 attributed to COOH and HCO 3 are detected after the adsorption 57,58.Especially, band at 1595 cm -1 is the typical frequency for asymmetric stretch of formate interacting with Ti of TiO 2 nanotube to form Ti--COOH 57.Moreover, the COOH group is a crucial reaction intermediate for the formation of CO and CH 4 17.Under UV-vis light irradiation, photo-generated e-and h trigger the photoreduction on the surface of 15TBC.With the prolong of light irradiation, CO 2 photoreduction intermediates gradually emerge.The bands at 1516 cm -1 are assigned to the CH 2 vibration of H 2 CO 58,59.The bands at 1095 cm - are belong to the characteristic band of group CHO 17,58,60, while the adsorption bands at 1038 cm -1 are attributed to the CO of methoxy CH 3 O 17,58.Moreover, the adsorption bands at 2938 cm -1 are assigned to the C-H stretch vibration of CH 3 group (Fig. 7b) 61.Interestingly, band belong to CO is not detected throughout the whole reaction (Fig. 7c), possibly due to the fast hydrogenation of bimetal sites Ti-Bi on it 17.Combine the reaction intermediates and the CO 2 photoreduction activity of 15TBC, the proposed reaction path of CO 2 photoreduction on 15 TBC could be follow: CO The efficiently selective CO 2 photoreduction mechanism is illustrated schematically in Fig. 7. Facilitated from the ultrathin defective heterostructure, UV-vis light irradiation induces interfacial reconstructions in the TBC composite during the CO 2 photoreduction process.Abundant H-incorporated oxygen vacancies are induced in the TiO 2 nanotube, whilst Bi atoms are reduced from ultrathin BiOCl lamina.Bi atoms establish high-speed electron transport bridges between TiO 2 and BiOCl, orientedly introducing electrons from BiOCl to the oxygen vacancies on TiO 2 nanotube.Meanwhile, oxygen vacancies on TiO 2 nanotube also trap electrons generated by TiO 2 nanotube, maximally collecting electrons produced by the photocatalyst to boost the photocatalytic efficiency.Additionally, the H-incorporated oxygen vacancies sharply depress H 2 O adsorption, efficiently suppressing the competitive H 2 production to ensure more electrons for CO 2 reduction.Moreover, the H-incorporated oxygen vacancies provide H-rich catalytic sites for CO 2 reduction, dramatically driving the CO 2 to be reduced in a fast-hydrogenation process with high CH 4 selectivity.At the same time, Bi couples with adjacent Ti 3 to form dual metal catalytic site, firmly trapping the intermediate CO to inhibit CO production and further improve the fast-hydrogenation path, leading to enhanced CH 4 selectivity.Thus, increasing the loading weight of BiOCl can significantly improve the selective production in CO 2 photocatalytic reduction, the highest activity and selectivity achieving on 15TBC.However, overloaded BiOCl will lessen the contact chances of TiO 2 surface and CO 2 , resulting in inferior photocatalytic efficiency.The selectivity of CH 4 production is determined by H-incorporated oxygen vacancy and Bi-Ti dual metal sites.Therefore, when H-incorporated oxygen vacancy and the dual metal sites form on TiO 2 surface, the selectivity of CH 4 production will level off, regardless of the increase of BiOCl.In this way, too much BiOCl in TBC can maintain the selectivity but lower the activity in the CO 2 photoreduction.When the content of BiOCl in TBC is continuously increased, the activity is lowered but the selectivity changes no more.Moreover, throughout the whole photocatalytic process, acetonitrile acts as a hole trapping agent to maintain sufficient electrons for the photoreduction engineering above (Fig. S10).As a summarization, electrons and holes participated reactions on the photocatalyst are illustrated as the chemical equations listed: Electron consumption reactions: Hole consumption reactions: UV-vis light irradiation induces the generation of electrons in the reconstructed BiOCl-Bi 0 -TiO 2 , which efficiently avoids the Bi 0 oxidization and ensures the catalyst photostability.Thus, with continuous UV-vis light irradiation, the yield of CH 4 and H 2 on the photocatalyst gradually increases as the photocatalysis time prolongs, the photocatalyst consistently showing high activity within 12 h and the Bi atoms maintain the initial distribution steadily (Fig. S11,12).However, when the UV-vis light is off, the Bi 0 atoms are oxidized to Bi 2 O 3 .Hence, the composition and structure of the re-oxidized photocatalyst are different from those of TBC.Nevertheless, the Bi-O bonds in the new formed Bi 2 O are stronger than that of BiOCl after annealing, so it is more difficult to gain Bi 0 atoms from the resultant Bi 2 O 3 .In this way, the activity is weakened when oxidized photocatalyst is reused for CO photoreduction."
  },
  {
    "title": "Conclusions",
    "content": "In summary, defects abundant TBC heterostructure is prepared by in situ growth of ultrathin BiOCl layers on the defective surface of TiO nanotube.The TBC nanocomposites show remarkably photocatalysis performance in CO 2 reduction field, with the highest CH 4 productivity rate of 168.5 mol g -1 h -1 and optimal CH 4 selectivity of 99.4 .The TBC with large surface area provides ample sites for CO 2 adsorption and reduction.Meanwhile, the ultrathin TBC heterostructure not only possesses quit short charge transport distance from bulk to surface, but also enhances the charge carriers separation through interface, gathering more electrons for photoreduction.Under UV-vis irradiation, oxygen vacancies on TiO 2 beneficially trap electrons produced by TiO 2 , whilst Bi 0 atom orientedly induce electrons from BiOCl to the oxygen vacancy, efficiently collecting electrons to improve the productivity.During the CO 2 photoreduction, H-incorporated oxygen vacancies tremendously suppress H 2 generation and drive CO 2 to be reduced in a fasthydrogenation way.Moreover, Bi-Ti dual metal catalytic sites around the oxygen vacancy inhibit CO production, reinforcing the hydrogenation way to boost the selective CH 4 productivity.This work exhibits a broad prospect in fabricating cheap photocaltalyst with high activity, optimal selectivity for CO 2 reduction process. Fig. 1.(a) Schematic illustration of the synthetic process of TiO 2 BiOCl photocatalyst, (b) XRD patterns of TBC with different loading weight of BiOCl, (c) AC-HAADF-STEM image of 15TBC (Inset: AC-HAADF-STEM image of 15TBC for element mapping), Element mapping of (d) Ti, (e) O, (f) Bi, (g) Cl for 15TBC, (h) AC-HRTEM image of 15TBC, (i) EPR of 15TBC. Fig. 2. (a) N 2 adsorption-desorption isotherm, (b) Pore size distribution of bare TiO 2 and 15TBC. Fig. 3. (a) PL spectra of P25, TiO 2 and TBC with different loading weights of BiOCl, (b) TRPL spectra of TiO 2 and 15TBC, (c) Electrochemical impedance spectra of TiO 2 and 15TBC, (d) Photocurrents of TiO 2 and 15TBC, (e) Photocurrents of TiO 2 and 15TBC in the third irradiation stage, (f) Electron density difference of TiO 2 BiOCl (charge accumulation is in blue and depletion in yellow). .Li et al. Fig. 4. (a) Photoreduction yields of TBC with different weight of BiOCl, (b) White TiO 2 image, (c) 15TBC image, (d) Blue TiO 2 image, (e) Image of 15TBC after CO photoreduction. Fig. 5. (a) Bi 4f spectrum of TBC after UV-vis light irradiation for different time in CO 2 and H 2 O atmosphere, Bi 4f spectrum of TBC after UV-vis light irradiation in CO 2 and H 2 O atmosphere for (b) 0 h, (c) 4 h, (d) 9 h. Fig. 6.Electron density difference of Bi 0 -TiO 2 (a) front view, (b) top view, (c) side view (Charge accumulation is in blue and depletion in yellow). Fig. 7.In-situ FTIR spectra of CO 2 and H 2 O interaction with 15TBC (a) from 1000 cm -1 to 1800 cm -1 , (b) from 2800 cm -1 to 3000 cm -1 , (c) from 1800 cm -1 to 2200 cm -1 , and (d) Schematic diagram of CO 2 photoreduction mechanism on TiO 2 BiOCl. R.Li et al. This work was supported by the National Natural Science Foundation of China (52071027, 51872025), the National Key Research and Development Program of China (2016 YFB0701100), the National Key Research and Development H863 Program of China (18H86303ZT0032702), and the Fundamental Research Funds for the Central Universities (FRF-GF-20-03A, FRF-GF-19-006B) for financial support.The computing work is supported by USTB MatCom of Beijing Advanced Innovation Center for Materials Genome Engineering. Wenjun Dong designed the light-facilitated structure reconstruction on self-optimized photocatalyst, and revised the paper.Rongjie Li conducted experiments, characterization, analysis, DFT calculation and paper writing.Qingjie Luan, Cheng Dong, Wei Tang performed characterization and analysis.Ge Wang and Yunfeng Lu revised the paper.All authors contributed to the interpretation of the results and improvement of the paper. The authors declare no competing financial interest. Supplementary material related to this article can be found, in the online version, at doi:https://doi.org/10.1016/j.apcatb.2020.119832."
  }
]