[
  {
    "title": "Doi",
    "content": "10.1039/c4dt00181h"
  },
  {
    "title": "Article_Title",
    "content": "Enhanced photocatalytic CO2-reduction activity of electrospun mesoporous TiO2 nanofibers by solvothermal treatment"
  },
  {
    "title": "Abstract",
    "content": "Photocatalytic reduction of CO 2 into renewable hydrocarbon fuels using semiconductor photocatalysts is considered as a potential solution to the energy deficiency and greenhouse effect.In this work, mesoporous TiO 2 nanofibers with high specific surface areas and abundant surface hydroxyl groups are prepared using an electrospinning strategy combined with a subsequent calcination process, followed by a solvothermal treatment.The solvothermally treated mesoporous TiO 2 nanofibers exhibit excellent photocatalytic performance on CO 2 reduction into hydrocarbon fuels.The significantly improved photocatalytic activity can be attributed to the enhanced CO 2 adsorption capacity and the improved charge separation after solvothermal treatment.The highest activity is achieved for the sample with a 2-h solvothermal treatment, showing 6-and 25-fold higher CH 4 production rate than those of TiO 2 nanofibers without solvothermal treatment and P25, respectively.This work may also provide a prototype for studying the effect of solvothermal treatment on the structure and photocatalytic activity of semiconductor photocatalysts."
  },
  {
    "title": "Experimental",
    "content": "All chemicals were analytical grade without further purification.Tetrabutyl titanate (Ti(OC 4 H 9 ) 4 , TBOT) was purchased from Shanghai Kefeng Industry Co., Ltd.Polyvinylpyrrolidone (PVP K-90) was purchased from Tianjin Bodi Chemical Co., Ltd.Glacial acetic acid (CH 3 COOH) was purchased from Tianjin Fuyu Fine Chemical Co., Ltd.Ethanol (C 2 H 5 OH) and hydrogen Chloride (HCl) were purchased from Shanghai Chemical Regent Factory of China.Sodium bicarbonate (NaHCO 3 ) was purchased from Shanghai Avision Chemical Factory.Deionized (DI) water was used in all experiments. Electrospinning and calcination process: TiO 2 nanofibers were prepared according to an electrospinning method modified from that described by Xia et al. 22 A solution was first prepared by dissolving 1 g of PVP (K-90) in 10 mL of ethanol.Then 2 mL of glacial acetic acid and 3 mL of TBOT were added into the above solution.The mixture was stirred continuously for 12 h to yield a homogeneous precursor solution.Prior to electrospinning onto a ground aluminium foil electrode, the precursor solution was sonicated for 10 min and loaded into a 20 mL plastic syringe with a stainless steel needle (diameter of 0.7 mm) at the tip.Electrospinning was performed at 26 C for 3 h at an applied potential of 15 kV with a flow rate of 3 mL h -1 , and a distance of 10 cm from the tip to the collector.The relative humidity of the chamber was kept at 30.The as-obtained nonwoven mats of composite nanofibers consisting of amorphous TiO 2 and PVP were then annealed at 400 C for 6 h to eliminate the PVP.The heating and cooling rates were both set at 2 C min -1 . Solvothermal treatment: In a typical procedure, 20 mL of ethanol and 0.4 g of the as-prepared TiO 2 nanofibers were loaded into a Teflon-lined stainless steel autoclave with a capacity of 50 mL, and heated at 180 C for 1, 2, 3 and 6 h, respectively.The white precipitate was collected and thoroughly washed with deionized water for six times to remove the residual impurity on the surface of the samples.The samples were denoted as S0 (un-treated), S1, S2, S3, and S6, corresponding to the different solvothermal treatment time, respectively.Characterization X-ray diffraction (XRD) patterns were obtained on a D/Max-RB X-ray diffractometer (Rigaku, Japan) with Cu K radiation at a scan rate (2) of 0.05s -1 .Field emission scanning electron microscopy (FESEM) images were examined by a Hitachi S-4800 scanning electron microscope equipped with a cold field emission electron gun.Transmission electron microscopy (TEM) and high-resolution transmission electron microscopy (HRTEM) analysis were conducted by a JEM-2100F transmission electron microscope (JEOL, Japan) at an accelerating voltage of 200 kV.X-ray photoelectron spectroscopy (XPS) measurement was performed on a VG ESCALAB210 XPS system with Mg K source and all the binding energies were referenced to the C 1s peak at 284.8 eV of the surface adventitious carbon.The nitrogen adsorption and desorption isotherms were measured using a Micromeritics ASAP 2020 nitrogen adsorption apparatus (USA).All the as-prepared samples were degassed at 150 C prior to nitrogen adsorption measurements.The Brunauer-Emmett-Teller (BET) specific surface area (S BET ) was determined by a multipoint BET method using the adsorption data in the relative pressure (P/P 0 ) range of 0.05-0.3.The pore size distribution was determined using adsorption data via the Barret-Joyner-Halender (BJH) method.The average pore size was obtained from the nitrogen adsorption volume at P/P 0 of 0.97.Fourier transform infrared (FTIR) spectra were obtained from a Shimadzu IR Affinity-1 FTIR spectrometer.The CO 2 adsorption was measured by using a Micromeritics ASAP 3020 carbon dioxide adsorption apparatus (USA).Photoluminescence (PL) spectra were taken with a fluorescence spectrophotometer (F-7000, Hitachi, Japan).The excitation wavelength was 375 nm, the scanning speed was 1200 nm min -1 , and the PMT voltage was 700 V.The width of excitation slit and emission slit were both 5.0 nm. The photocatalytic reduction of CO 2 was carried out in a 200 mL double-neck flask with a groove in one neck, at ambient temperature and atmospheric pressure.10b A 300 W Xe arc lamp (Changzhou Siyu Science Co. Ltd, China), providing UV/visible-light irradiation, was used as light source and positioned 22 cm away from the photocatalytic reactor.Typically, 100 mg of photocatalyst was dispersed in 10 mL DI water by sonication and transferred to the reaction vessel.After evaporation of water at 80 C, a smooth film was formed at the bottom.Before irradiation, the reactor was sealed and blown with nitrogen for 30 min to remove air and ensure that the reaction system was under anaerobic conditions.CO 2 and H 2 O vapor were produced by the reaction of NaHCO 3 (120 mg, introduced into the reactor before seal) and HCl aqueous solution (0.25 mL, 4 M), which was introduced into the reactor by syringe.The flask was then kept under xenon lamp irradiation.The gas product composition was analyzed by a gas chromato-graph (GC-2014C, Shimadzu) equipped with a flame ionization detector (FID).Products were calibrated with a standard mixture gas and determined by the retention time."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The phase structure, crystallite size and crystallinity of typical samples were determined by XRD analysis.Fig. 1 shows the XRD patterns of the TiO 2 nanofibers solvothermally treated at different time periods.The characteristic diffraction peaks for S0 at 25.3, 37.8, 48.2, 54.1and 62.5can be assigned to the (101), ( 004), ( 200), ( 105) and ( 204) crystal planes of anatase TiO 2 (JCPDS, No. 21-1272), respectively.These peaks do not show any shift for other samples, indicating the quite stable phase structure of anatase TiO 2 during the solvothermal process.It is noted that the main diffraction peak of anatase (101) becomes gradually narrower and stronger with increasing solvothermal treatment time, as shown by the enlarged view of the peak (101) in Fig. S1. We have estimated the average crystallite size of the samples with the Scherrer formula based on this main (101) peak.As listed in Table 1, the average crystallite size slightly increases from 10.1, to 10.3 and 10.5 nm by the sequence of S0, S2, and S6.These results indicate that the crystallinity of electrospun TiO 2 nanofibers is further improved by solvothermal treatment at high temperature and pressure conditions.There are only small structural changes for electrospun TiO 2 nanofibers.However, it may have a significant effect on the photocatalytic properties, as the resulting bigger crystallite size will lead to improved structural connections with close-packing of grains, which is beneficial for the charge separation in photocatalytic reactions. 25he morphology and microstructure of the TiO 2 nanofibers were examined by SEM and TEM (Fig. 2).As shown in Fig. 2a, the S0 sample appears as a common cylindrical morphology with a diameter from 300 to 500 nm and a length of dozens of micrometers.The high-magnification FESEM image in Fig. 2b clearly shows the surface of the nanofibers with aggregated nanocrystals.The overall morphology of sample S2 does not change obviously.Fig. 2c indicates that single nanofibers in sample S2 are constructed from many polycrystalline nanoscaled grains.An in-depth observation of the microstructure was conducted by HRTEM.Fig. 2d confirms that the average size of these nanoscaled grains is 10 nm.The lattice fringes with d spacing of 0.35 nm can be assigned to the (101) crystal plane of anatase TiO 2 .It is worth noting that the TiO 2 nanograins are intimately contacted with each other.During the electrospinning process, the TBOT was hydrolyzed to form amorphous TiO 2 particles in the PVP matrix.These TiO 2 particles were uniform in size due to the space confinement of the PVP matrix. 26The PVP matrix was then removed by the calcination process.Meanwhile, the amorphous TiO 2 particles were crystallized and turned into uniform and closely contacted anatase grains during the calcination process.Such intimate contact enables the electrons to move easily from one grain to another and provides an effective electron transfer pathway on TiO 2 , 18 which can remarkably improve the separation of photogenerated electron-hole pairs.Since the TiO 2 grains are already arranged closely, they are only able to grow slightly bigger upon further solvothermal treatment, due to the mutual restriction of the neighboring grains.However, this slight growth is enough to improve the connections of the closely contacted grains, which may result in a significant effect on the photocatalytic performance of TiO 2 nanofibers. The XPS survey spectra (Fig. S2 3a-c.The C 1s spectrum of S0 (Fig. 3a) can be deconvoluted into three peaks at 284.8, 286.3, and 288.8 eV.The main peak at 284.8 eV can be assigned to the carbon atoms in the C-C, CvC, and C-H bonds, which are caused by carbonization of organic groups or adventitious carbon. 27The peak at 286.3 eV is related to the hydroxyl carbon (C-OH) and the peak at 288.8 eV is attributed to carboxyl carbon (O-CvO), originating from the residual of the precursor. 28In comparison, the C 1s spectrum (Fig. 3a) of S2 only shows two peaks at 284.8 and 288.8 eV, with a dramatic decrease for the relative intensity of the peak at 288.8 eV.This is due to the fact that the solvothermal treatment largely reduces the residual of the organic precursor, thereby decreasing the amount of hydroxyl carbon and carboxyl carbon in the sample.Fig. 3b shows the O 1s spectra of S0 and S2.Three distinct peaks are observed for S0 at 529.7, 531.8, and 533.2 eV.The peak at 529.7 eV can be assigned to TiO 2 lattice oxygen (Ti-O-Ti). 29The peak at 531.8 eV is attributed to the oxygen atoms in the Ti-OH (surface hydroxyl groups) and overlapped CvO bonds (residual from precursor). 30,31And the peak at 533.2 eV are related to the oxygen atoms in the CvO bonds. 30Nevertheless, the O 1s spectrum of S2 does not show the peak at 533.2 eV, owing to the dramatic decrease of the organic species after solvothermal treatment.Moreover, the peak corresponding to TiO 2 lattice oxygen shifts to 530.0 eV.The Ti 2p spectra of S0 (Fig. 3c) shows two peaks centred at 458.5 and 464.2 eV which can be ascribed to Ti 2p 3/2 and Ti 2p 1/2 , respectively, while these two peaks shift to 458.8 and 464.5 eV for sample S2.The observed spin-orbit splitting between the Ti 2p 3/2 and Ti 2p 1/2 is 5.7 eV, which is in good agreement with the values of Ti 4 state in TiO 2 . 32The results indicate that there are a lot of organic species on the surface of S0.After solvothermal treatment, these organic species are mostly removed and a cleaner surface of TiO 2 is achieved.That is why the binding energies of Ti 2p and O 1s of TiO 2 lattice oxygen for S2 are both positively shifted by 0.3 eV.It suggests that the surface properties of the electrospun TiO 2 nanofibers do vary after solvothermal treatment. The resulting cleaner surface can help the charge immigration for better photocatalytic properties. 33Meanwhile, the removal of organic residual will release more adsorption sites for CO 2 capture. BET surface areas and pore size distribution Fig. 4 shows the nitrogen adsorption-desorption isotherms and pore size distributions of samples S0, S2 and S6.According to Brunauer-Deming-Deming-Teller classification, the isotherms of all samples are of type IV, indicating the presence of mesopores (2-50 nm). 34Furthermore, the shapes of the hysteresis loops are of type H2 at the relative pressure (P/P 0 ) range of 0.4-0.8,suggesting the formation of pores with narrow necks and wider bodies (ink-bottle pores). 34The pore size distributions (inset of Fig. 4) show a range of 2-40 nm with a peak pore diameter of 5 nm for all the samples, further confirming the existence of mesopores.However, slightly reduced specific surface areas from 59 (S0) to 55 (S2) and 49 m 2 g -1 (S6) are obtained, and the pore volume and average pore size also decrease from S0 to S2 and S6, as listed in Table 1.This is due to the slightly increased size and confirms that the grains are packed more closely after solvothermal treatment. The FTIR spectra of samples S0, S2 and S6 are shown in Fig. S3. The broad peak at 3400 cm -1 and the peak at 1650 cm -1 are attributed to the surface-adsorbed water and hydroxyl groups. 35It suggests that all TiO 2 nanofiber samples are with a number of surface hydroxyl groups that can favour the CO 2 capture.The main peaks located in the range of 400-700 cm -1 can be assigned to Ti-O stretching and Ti-O-Ti bridging stretching modes. 36The peak lying in 1380-1400 cm -1 region corresponds to carboxyl (CvO) groups of the organic species, 35,37 The peak in the 2300-2370 cm -1 region can be ascribed to CO 2 . 38Note that the CO 2 peaks of samples S2 and S6 are stronger than sample S0, implying the larger CO 2 adsorption capacity of S2 and S6. It is well-known that the adsorption of CO 2 onto the photocatalyst surface is the first essential step for the photocatalytic CO 2 reduction.Thus we further investigated the CO 2 adsorption performance of samples S0, S2 and S6 using CO 2 adsorption isotherms.As shown in Fig. 5, all samples exhibited a rapid rise in CO 2 uptake along with elevated CO 2 pressure at a relatively low level (P/P 0 0.2), indicating specific interactions between CO 2 and the surface hydroxyl groups of TiO 2 nanofibers.Especially, both the CO 2 adsorption capacity of samples S2 and S6 is higher than that of S0, due to released adsorption sites after the removal of organic residual by solvothermal treatment.It is noted that as the relative pressure increases, sample S2 shows better CO 2 uptake ability than S6.This is because at high P/P 0 condition, more CO 2 is adsorbed into the interparticle space of the nanofibers, whereas S6 has a lower specific surface area and smaller pore volume, resulting in less surface CO 2 adsorption sites.Detailed CO 2 adsorption capacity is listed in Table 1. The PL spectra can be used to reveal the separation and recombination tendency of the photogenerated electron-hole pairs within the TiO 2 nanofibers. 39Fig. S4 shows a comparison of PL spectra of the S0 and S2 samples in the wavelength range 375-550 nm.Two main emission peaks appear at about 396 and 468 nm wavelengths.The former is ascribed to the emission of bandgap transition with the energy of light approximately equal to the bandgap energy of anatase, 40 while the latter is the emission signal originating from the charge transfer transition from Ti 3 to oxygen anions in a TiO 6 8complex. 41,42Slightly weaker emission intensity is observed for S2, as compared to that for S0, implying a lower recombination rate of photogenerated electron-hole pairs.This is because the solvothermal environment can accelerate the crystallization and generate a cleaner surface of TiO 2 , resulting in the reduction of the number of defects and impurity in TiO 2 crystals, thus the chance of photogenerated electron-hole recombination can be reduced. The photocatalytic activity of the prepared samples is evaluated by using the reaction of photocatalytic CO 2 reduction into hydrocarbon fuels.The original chromatogram for the reduction of CO 2 on sample S2 is shown in Fig. 6a.Control experiments indicated that no hydrocarbon compound was detected in the absence of either photocatalyst or light irradiation, suggesting that photocatalyst and light irradiation are two indispensable factors for photocatalytic reduction of CO 2 , and production of hydrocarbon compounds.In our study, CH 4 is detected as the main product, with a small amount of CH 3 OH and HCHO.As such, possible reactions for the photocatalytic CO 2 -reduction are proposed as below.6b shows the comparison of photocatalytic CH 4 production rates on different samples.P25 is used as a reference and exhibits much lower activity than all the TiO 2 nanofiber samples, demonstrating the superiority of the electrospun TiO 2 nanofibers for photocatalytic CO 2 reduction.It is clearly seen that the CH 4 production rate increases dramatically from S0 to S2.This is mainly due to the improved CO 2 adsorption promoted by the solvothermal treatment.Furthermore, the slightly growing and more closely packed grains after solvothermal treatment can lead to improved structural connections of TiO 2 crystals, thus to accelerate the separation of photogenerated electron-hole pairs in terms of fast movement along the grain boundaries. 25In addition, the reduction of defects and impurity can suppress the recombination of photogenerated electron-hole pairs.However, a gradual decrease of CH 4 production rate is observed for the samples with increasing solvothermal treatment time (from 3 to 6 h), due to the decreased CO 2 adsorption ability and surface area.Therefore, it is necessary to modulate the solvothermal treatment time at an optimal value.As for our study, the best activity is obtained for sample S2, with 6-and 25-fold higher CH 4 production rate than those of S0 and P25, respectively.Actually we have measured the UV-vis spectra of all the TiO 2 nanofiber samples, but no difference was observed.This means the band gap of TiO 2 nanofibers are not affected by solvothermal treatment, thus there is no contribution from band gap alteration for the photocatalytic performance. Based on the above experimental results, a possible photocatalytic mechanism of CO 2 reduction over TiO 2 nanofibers is proposed and illustrated in Fig. 7. Firstly, CO 2 is largely adsorbed on the surface of TiO 2 nanofibers, through the bonding between CO 2 and surface hydroxyl groups, as well as the physisorption into the interparticle space.Upon light irradiation, photogenerated electrons and holes can easily transfer to the nanofiber surface along the well crystallized and closely packed grains with a clean surface.As a result, the photogenerated electrons are capable of reducing CO 2 into hydrocarbon fuels, meanwhile the separated holes can oxidize H 2 O into O 2 and H ."
  },
  {
    "title": "Conclusions",
    "content": "In summary, we have successfully prepared mesoporous TiO 2 nanofibers on a large scale through a simple electrospinning strategy combined with a subsequent calcination process.Further solvothermal treatment for the TiO 2 nanofibers enables them with well crystallized and closely packed grains with a clean surface.The significantly improved efficiency of photocatalytic CO 2 reduction into hydrocarbon fuels is obtained due to the improved structural connections for charge separation, and the released adsorption sites for enhanced CO 2 adsorption capacity after solvothermal treatment.At an optimal solvothermal time of 2 h, the treated TiO 2 nanofibers exhibit 6-and 25-fold higher CH 4 production rate than those of TiO 2 nanofibers without solvothermal treatment and P25, respectively.This work may not only indicate the effect of solvothermal treatment on the photocatalytic CO 2 reduction over TiO 2 , but also provide a prototype for studying the effect of solvothermal treatment on the structure and photocatalytic activity of semiconductor photocatalysts. ) indicate the existence of Ti, O and C in the S0 and S2 samples, and their photoelectron peaks emerge at binding energies of 458 (Ti 2p), 531 (O 1s) and 285 eV (C 1s), respectively.High-resolution XPS spectra of C 1s, O 1s, and Ti 2p were further examined and are shown in Fig. Fig. 1 XRD patterns of TiO 2 nanofibers with different solvothermal treatment time. Fig. 2 (a, b) FESEM images of the S0 sample; (c) TEM image of single nanofiber selected from the S2 sample; (d) HRTEM image of the circled area in (c). Fig. 3 High-resolution XPS spectra for C 1s (a), O 1s (b), and Ti 2p (c) of S0 and S2. Fig. 4 N 2 adsorption and desorption isotherms and pore size distributions (the inset) of S0, S2 and S6.Fig.5 CO 2 adsorption isotherms of S0, S2 and S6. Fig. 4 N 2 adsorption and desorption isotherms and pore size distributions (the inset) of S0, S2 and S6.Fig.5 CO 2 adsorption isotherms of S0, S2 and S6. Fig. 6 (a) The original chromatograms of S2 after 1 h irradiation and (b) CH 4 generation of the samples with different solvothermal time periods (S0, S1, S2, S3, and S6). Physical properties and photocatalytic performance of the typical samples a a The CO 2 adsorption amount obtained at P/P 0 1. Dalton Trans., 2014, 43, 9158-9165 This journal is The Royal Society of Chemistry 2014 This journal is The Royal Society of Chemistry 2014 This work was supported by the 973 program (2013CB632402), and NSFC (51272199, 51320105001, 51372190, 51203182 and 21177100).Also, this work was financially supported by the Fundamental Research Funds for the Central Universities (2013-VII-030) and Self-determined and Innovative Research Funds of SKLWUT (2013-ZD-1)."
  }
]