[
  {
    "title": "Doi",
    "content": "10.1021/jp409311x"
  },
  {
    "title": "Article_Title",
    "content": "Au/Pt Nanoparticle-Decorated TiO<sub>2</sub> Nanofibers with Plasmon-Enhanced Photocatalytic Activities for Solar-to-Fuel Conversion"
  },
  {
    "title": "Abstract",
    "content": "We present the fabrication of TiO 2 nanofibers codecorated with Au and Pt nanoparticles through facile electrospinning.The Au and Pt nanoparticles with sizes of 5-12 nm are well-dispersed in the TiO 2 nanofibers as evidenced by electron microscopic analyses.The present design of Au/Pt codecoration in the TiO 2 nanofibers leads to remarkably enhanced photocatalytic activities on both hydrogen generation and CO 2 reduction.This great enhancement is attributed to the synergy of electron-sink function of Pt and surface plasmon resonance (SPR) of Au nanoparticles, which significantly improves charge separation of photoexcited TiO 2 .Our studies demonstrate that through rational design of composite nanostructures one can harvest visible light through the SPR effect to enhance the photocatalytic activities of semiconductors initiated by UV-light to more effectively utilize the whole solar spectrum for energy conversion."
  },
  {
    "title": "Experimental",
    "content": "Fabrication of Au/Pt/TiO 2 Composite Nanofibers (NFs).The Au/Pt/TiO 2 NFs were fabricated through an electrospinning method with postcalcination.In a typical procedure, tetrabutyl titanate (Ti(OC 4 H 9 ) 4 ) (2.0 mL) and a certain amount of HAuCl 4 were added to a mixture solution containing 2 mL of acetic acid and 5 mL of ethanol under vigorous stirring.Then 0.4 g of poly(vinyl pyrrolidone) (PVP) powder (M w 1 300 000) was dissolved in the this solution followed by vigorous stirring for 6 h.Subsequently, a certain amount of H 2 PtCl 6 6H 2 O was added to this solution which was then kept vigorously stirring for another 3 h.Afterward this mixture solution of PVP/HAuCl 4 /H 2 PtCl 6 /Ti(OC 4 H 9 ) 4 was transferred into a plastic syringe with a 23-gauge needle made of stainless steel for electrospinning.The distance between the needle tip and the collector was about 15 cm, and the feeding rate was 2.0 mLh -1 .The dense web of the electrospun NFs of the PVP/HAuCl 4 /H 2 PtCl 6 /Ti(OC 4 H 9 ) 4 composite was fabricated at an applied electric voltage of 15 KV between the needle tip and the collector.Finally, the above composite NFs were calcined in air at 500 C with a rising rate of 2 Cmin -1 and kept for 2 h at the required temperature.Thus, the finally formed Au/Pt/TiO 2 composite NFs are denoted as Au (1-x) / Pt x /TiO 2 NFs in which x is the molar concentration (x) of Pt to Ti in the precursor solution.In this work, Au 1 /TiO 2 , Au 0.75 / Pt 0.25 /TiO 2 , Au 0.5 /Pt 0.5 /TiO 2 , Au 0.25 /Pt 0.75 /TiO 2 , and Pt 1 /TiO 2 NFs were fabricated to investigate the optimal content ratio of Au to Pt for solar fuels production.Meanwhile, the pure TiO 2 , Pt 0.25 /TiO 2 , Pt 0.5 /TiO 2 , and Pt 0.75 /TiO 2 NFs were also fabricated as the control samples for comparison. Characterization.X-ray diffraction (XRD) measurements were carried out by using the Shimadzu XRD-600 X-ray diffractometer with a Cu K line of 0.1541 nm.X-ray photoelectron spectroscopy (XPS) measurement was performed on a Thermo Scientific Theta probe XPS with a monochromatized Al K (h 1486.7 eV) source.Field emission scanning electron microscopy (FESEM; JSM-7600F) and transmission electron microscopy (TEM; JEOL JEM-2100) were used to characterize the morphologies and structures of the products.Energy-dispersive X-ray (EDX) spectroscopy being attached to SEM and TEM was used to analyze the composition of products.UV-vis diffuse reflectance spectroscopy (DRS) of the products was recorded on a Lambda 750 UV/vis/NIR spectrophotometer (Perkin-Elmer, USA). Photocatalytic H 2 Production.The photocatalytic H 2 production tests were performed in a 40 mL quartz reactor.Typically, 5 mg of the as-electrospun NF photocatalysts was suspended in 10 mL of aqueous solution of L-ascorbic acid (0.1 M, pH 4 adjusted by 1 M NaOH).This suspension was sealed in the quartz reactor by a rubber plug and then purged with argon gas for half an hour to drive away the residual air.Subsequently, the reactor was exposed under a 300 W Xe lamp (MAX-302, Asahi Spectra Co. Ltd.).The gas product composition from the upper space above the liquid in the quartz reactor was periodically analyzed by an Agilent 7890A gas chromatograph (GC) equipped with a thermal conductivity detector (TCD). Photocatalytic CO 2 Conversion.The photocatalytic CO 2 reduction tests were carried out in a 90 mL gastight reactor with a quartz plate at the top and sampling ports at two sides.In a typical process, 5 mg of the as-electrospun NF photocatalysts was loaded on a 2 cm 2 cm glass substrate with 0.1 mL of deionized water.After that, the above glass with the NF photocatalysts was sealed in the reactor.Before the irradiation, high purity CO 2 was bubbled through deionized water and then flowed into the reactor for 30 min to remove the residual air.Finally, the reactor loading with the aselectrospun NFs was exposed under a 500 W Xe lamp (66902, Newport Corp.).The gas products were periodically analyzed quantitatively by an Agilent 7890A GC equipped with a TCD."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The crystallographic structure and phase purity of the aselectrospun products were identified by X-ray diffraction (XRD) patterns.As shown in Figure 1A, the diffraction peaks for all the products present similar profiles and can be perfectly indexed as the tetragonal anatase TiO 2 (JCPDS, no.21-1272).As calculated by the Debye-Scherrer formula, the average crystallite size of TiO 2 is 18 nm or so for all products.The enlarged view of XRD patterns (from 35to 55) presented in Figure 1B reveals the presence of cubic Au (JCPDS, no.04-0784) and/or Pt (JCPDS, no.04-0802) diffraction peaks for the Au/Pt/TiO 2 NFs.These peaks are rather broad, indicating that the sizes of the metal nanoparticles (NPs) are very small.Note that when the metal content is below 0.5 the diffraction peaks could not be observed due to the weak signal beyond the XRD detection limit. The scanning electron microscopy (SEM) images (Figure 2A-F) reveal that all of the as-electrospun products have continuous fibrous structures with diameters of 130-200 nm (Figure S1, Supporting Information).These NFs have lengths of several micrometers and are aligned in random orientations and interweaved.Researchers have reported that the TiO 2 NFs in this size range exhibited very strong light-scattering behavior for enhancing the photocatalytic H 2 production. 44Moreover, the energy-dispersive X-ray (EDX) spectra from the corresponding SEM images (Figure S2, Supporting Information) confirm that the element contents of Au and/or Pt in the aselectrospun Au/Pt/TiO 2 NFs are very close to the theoretical value in the precursor solution, suggesting nearly no mass loss during the preparation process. Transmission electron microscopy (TEM) images (Figure 3A-H) indicate that the embedded spherical metal NPs with the uniform size and well-dispersed distribution can be clearly distinguished from the NF matrix due to their high electron density.The mean sizes of the metal NPs for the Au 1 /TiO 2 and Pt 1 /TiO 2 NFs are about 7.85 and 5.64 nm (Figure S3, Supporting Information), respectively, which are a little smaller than the corresponding values of the Au 0.75 /Pt 0.25 /TiO 2 (9.08 nm), Au 0.5 /Pt 0.5 /TiO 2 (9.31 nm), and Au 0.25 /Pt 0.75 /TiO 2 NFs (9.18 nm) (Figure S4, Supporting Information).The larger size of the metal NPs for the Au/Pt/TiO 2 NFs might be caused by the local aggregation between Au and Pt NPs. Figure 3I-L shows the high-resolution (HR) TEM images from the corresponding color squares of Figure 3B-D, in which the interplanar distances of 0.234 and 0.224 nm correspond well to the lattice spacings of the Au(111) and Pt(111) planes, respectively.These observations suggest that both metallic Au and Pt NPs coexist in the Au/Pt/TiO 2 NFs. More detailed information regarding the chemical states of the as-electrospun metal/TiO 2 NFs was investigated by X-ray photoelectron spectroscopy (XPS) analysis.Figure 4A presents the Ti 2p core-level spectra of the Au 1 /TiO 2 , Pt 1 /TiO 2 , and Au 0.25 /Pt 0.75 /TiO 2 NFs, in which all the above products display two symmetric peaks.The peak centered at around 458.8 eV corresponds to the Ti 2p 3/2 , and another one centered at 464.5 eV is assigned to Ti 2p 1/2 . 45The observed spin-orbit splitting between the Ti 2p 3/2 and Ti 2p 1/2 is 5.7 eV, which is in excellent agreement with the values of the Ti 4 state in TiO 2 . 46igure 4B shows the O 1s signal could be fitted into two symmetric peaks.The peaks located at 530.1 and 531.2 eV are ascribed to the crystal lattice oxygen (Ti-O) and surface hydroxyl groups (Ti-OH), respectively. 45,46These results indicate that the chemical states for Ti and O were not changed after Au/Pt decoration.The Au 4f and Pt 4f signals are shown in Figure 4C and D, respectively.The presented Au 4f 7/2 and Au 4f 5/2 peaks are located at 83.4 and 87.2 eV, respectively, which well agree with the values of the metallic Au 0 state. 47The Pt 4f signal of the Pt 1 /TiO 2 NFs shown in Figure 4D could be fitted into six symmetric peaks, suggesting the existence of three states of Pt species.The Pt 4f 7/2 peak at 70.6 eV and Pt 4f 5/2 peak at 73.9 eV are attributed to the metallic Pt 0 , while the binding energy peaks found at 72.5, 74.7, 76.1, and 77.8 eV are originated from 4f 7/2 of Pt 2 , 4f 7/2 of Pt 4 , 4f 5/2 of Pt 2 , and 4f 5/2 of Pt 4 , respectively. 4849950 The presence of Pt 2 and Pt 4 states might be attributed to the formation of a Pt-O bond driven by the oxygen chemisorption on the surface of Pt nanostructures, which is in agreement with the literature. 4849950 According to the XPS spectra, the molar ratios of Pt 0 /Pt 2 /Pt 4 states are estimated as 0.27:0.44:0.29 for the Pt 1 /TiO 2 nanofibers and 0.33:0.40:0.27for the Au 0.25 /Pt 0.75 /TiO 2 nanofibers.We note that the content of the oxidation states of Pt in the Pt 1 /TiO 2 nanofibers is slightly higher than that in the Au 0.25 /Pt 0.75 /TiO 2 nanofibers, which might be attributed to the smaller size of Pt NPs in the Pt 1 /TiO 2 nanofibers, leading to the larger ratio of surface oxidation states.It should be noted that the Au 4f (7/2, 5/2) and Pt 4f (7/2, 5/2) peak positions of the Au 0.25 /Pt 0.75 / TiO 2 NFs are nearly unchanged as compared to that of Au 1 / TiO 2 and Pt 1 /TiO 2 NFs, which suggests no alloy formation for the metallic Au and Pt NPs in the TiO 2 NFs. Figure 5 shows the UV-vis absorption spectra of the aselectrospun NFs, which are converted from the measured diffuse reflectance spectra by means of the Kubelka-Munk function.With regard to all products, the intense UV absorption band at wavelengths shorter than 400 nm can be assigned to the intrinsic bandgap absorption of anatase TiO 2 (E g : 3.2 eV). 8,10As observed in Figure 5, the TiO 2 NFs display a very weak absorption band centered at around 420 nm, which might be attributed to the defects or impurity doping by the polymer template during the sintering process. 22,41In contrast to the pure TiO 2 NFs, the Au 1 /TiO 2 NFs exhibit obvious enhancement on light absorption in the visible region with a broad band centered at around 590 nm which can be caused by the surface plasmon resonance (SPR) of embedded Au NPs. 23,34,37However, the SPR absorption band is hardly observed in the spectrum of Pt 1 /TiO 2 NFs (inset of Figure 5) because of the high imaginary part of the dielectric function of Pt. 23,24 Note that this SPR peak wavelength is relatively red-shifted as compared to that of similar sized Au NPs due to the high refractive index of the anatase TiO 2 NF matrix (n 2.49). 34,51Interestingly, when Pt NPs are also present in the TiO 2 NF matrix, the Au SPR peaks are blueshifted to 540 nm (see Figure 4c-e), which might be ascribed to the existence of more negative dielectric function of Pt NPs. 23The size changes of Au NPs in the Au/Pt/TiO 2 NFs with different Au content may also be a reason for inducing the SPR band shift.In short, these Au/Pt/TiO 2 NFs displayed strong visible-light absorption rising from the SPR effect of codecorated Au NPs that are capable of enhancing the photocatalytic activities of the NFs toward efficient solar-tofuel conversion. The photocatalytic hydrogen generation over different NFs was evaluated under UV-vis light irradiation in the presence of L-ascorbic acid (0.1 M, pH 4.0) as the sacrificial reagent to quench the photogenerated holes.Control experiments in the absence of either light irradiation or TiO 2 -based NFs showed no H 2 production.Figure 6A shows the H 2 production plots over different NFs as a function of irradiation time.The pure TiO 2 NFs have a very low H 2 production rate (0.009 molh -1 ) due to fast recombination of photogenerated charge carriers and large H 2 evolution overpotential on TiO 2 surfaces.In contrast, the Pt-decorated TiO 2 NFs (Pt 1 /TiO 2 ) exhibit much higher H 2 production rate (8.289 mol h -1 ) because the Pt NPs in NFs can act as electron sinks to suppress the charge recombination process and serve as active sites for H 2 production by lowering the overpotential.Interestingly, when 25 of Pt is replaced by Au in the composite NFs, for example the sample Au 0.25 /Pt 0.75 /TiO 2 , the H 2 production rate can be remarkably enhanced to 11.658 mol h -1 .However, as more Pt is replaced by Au, we observe the gradually decreased H 2 production rate by using the Au 0.5 /Pt 0.5 /TiO 2 NFs (9.274 molh -1 ) and Au 0.75 /Pt 0.25 /TiO 2 NFs (6.940 molh -1 ), suggesting that the Pt NPs are the major contribution to the active sites for H 2 production. We note that in the absence of Pt the Au 1 /TiO 2 NFs show tremendously lower (at least 18 times) H 2 production rate (0.391 mol h -1 ), which further decreases with lower Au content in the NFs (e.g., Au x /TiO 2 , x 1).This result indicates that the H 2 generation on Au particles is fairly minor as compared to that on Pt particles.Nevertheless, the Au/Pt-codecorated TiO 2 NFs with an appropriate Au ratio still can exhibit remarkable enhancement on the H 2 generation rate compared with the Pt 1 /TiO 2 NFs, which suggests that the optical response (e.g., SPR) of Au NPs in the NFs must play a crucial role in the photocatalytic H 2 generation. To further investigate the effect of Au NPs in the Au/Pt/ TiO 2 NFs, we compared the photocatalytic activity of the samples with the same Pt content, for example Pt x /TiO 2 NFs versus Au 1-x Pt x /TiO 2 NFs (x 0.25, 0.5, and 0.75), as shown in Figure 6B.Compared to the corresponding Pt x /TiO 2 NFs (x 0.25, 0.5, and 0.75), the Au 0.75 /Pt 0.25 /TiO 2 , Au 0.5 /Pt 0.5 /TiO 2 , and Au 0.25 /Pt 0.75 /TiO 2 NFs show an enhancement factor of 2.4, 1.3, and 1.5, respectively, in the H 2 production rate.Since the H 2 production on Au sites is very low as aforementioned, this comparison demonstrates that codecoration of Au NPs into Pt/ TiO 2 composite structures enables great enhancement on the photocatalytic efficiency through the plasmonic excitation of Au NPs in the composites.Furthermore, we have tested the stability and reusability of Au 0.25 /Pt 0.75 /TiO 2 NFs for the photocatalytic H 2 evolution through a cycling test.As shown in Figure 6C, the result indicates no obvious decrease of the photocatalytic activity after the three cycles, demonstrating the good stability of the Au 0.25 /Pt 0.75 /TiO 2 NFs. To generalize the hypothesis of plasmon-enhanced photocatalytic activity from codecorated Au NPs, we employed a more challenging reaction, photoreduction of carbon dioxide (CO 2 ) with water vapor, as a model system to evaluate the photocatalytic activities of the Au/Pt/TiO 2 NFs.Photocatalytic CO 2 conversion into hydrocarbon fuels has been considered as a promising way to solve the green-house and energy shortage problem. 3,525335455 According to the literature, 3,12,55 the mecha- nism of CO 2 photoreduction is the proton-assisted multielectron instead of a single electron transfer process.The gas products are strongly dependent on the number of protons and electrons.CO production needs only two protons and two electrons (CO 2 2H 2e - CO H 2 O), while CH 4 can be produced directly through a reduction process involving eight electrons and eight protons (CO 2 8H 8e - CH 4 2H 2 O) or formed by the depletion of as-produced CO through a six-electron reaction (CO 6H 6e - CH 4 H 2 O). Control experiments in the absence of CO 2 gas showed no CH 4 or CO production, indicating that the CH 4 and CO products were generated from CO 2 reduction rather than surface contaminants.As shown in Figure 7a-d, under UV-vis light irradiation, CO 2 can be reduced to CH 4 and CO in the presence of water vapor by using the as-electrospun NFs as the photocatalysts.The pure TiO 2 NFs (Figure 7a) show poor CH 4 production (0.03 mol h -1 ) and high CO production (0.06 mol h -1 ) after irradiation for 3 h.In comparison, the Pt 1 /TiO 2 NFs (Figure 7d) display more than 10 times higher activity for CH 4 production (0.42 mol h -1 ) and slightly higher activity in CO production (0.08 mol h -1 ) because the Pt NPs can act as an electron-sink to promote charge separation on TiO 2 surfaces, while the Au 1 /TiO 2 NFs (Figure 7b) showed relatively lower activity in CH 4 production (0.31 mol h -1 ) with higher CO production (0.20 mol h -1 ).This is because the electronsink effect of Au NPs is lower than that of Pt NPs due to its higher work function of -5.1 eV (-5.65 eV for Pt), thus the multielectron reaction process would occur more easily on the Pt/TiO 2 . 3,12,16Consistent with the observation in H 2 production, when some Pt in the NFs is replaced by Au, the Au 0.25 /Pt 0.75 /TiO 2 NFs (Figure 7c) exhibit 1.35 times higher activity in CH 4 production (0.57 mol h -1 ) than the Pt 1 /TiO 2 NFs.This observation further demonstrates that the codecorated Au NPs in the NFs provide additional enhancement on the photocatalytic activity of CO 2 reduction through surface plasmon excitation. The possible principles of plasmon-enhanced photocatalytic activity over the Au/Pt/TiO 2 NFs are illustrated as Figure 8.According to literature studies, 565758 the SPR effect of Au NPs in the NFs could contribute to the photocatalytic process through direct transfer of plasmon-excited \"hot\" electrons and/ or the strongly enhanced local electric field.Upon SPR excitation, the surface electrons on Au NPs may be excited to high-energy level and transfer into the conduction band (CB) of TiO 2 through the Au-TiO 2 interfaces for reduction reaction on TiO 2 surfaces.The remaining holes on Au NPs are capable of implementing some oxidation reaction in the presence of appropriate electron donors, for instance ascorbic acid in the current study for H 2 production.However, when we utilized the irradiation at 550 20 nm, which directly excites the Au SPR, for the photocatalytic test of all Au/Pt/TiO 2 NFs, no H 2 evolution was observed, suggesting that the SPR-induced hot electrons of Au NPs have no contribution to the photocatalytic H 2 production in the present study.Therefore, a more possible mechanism of SPR effect may be attributed to the strongly enhanced localized electric field near the Au/TiO 2 interface, where the electron-hole separation of photoexcited TiO 2 may be promoted through plasmonexciton coupling. 25,2829930313233 This would allow a longer lifetime for photogenerated electrons to diffuse toward Pt NPs, which serve as electron-sink and active sites, for proton reduction to H 2 or CO 2 reduction to CH 4 .In short, the overall high photocatalytic activity of Au/Pt codecorated TiO 2 NFs in fuel production can be attributed to the synergy between the SPR effect of Au NPs and the electron-sink effect of Pt NPs. Nevertheless, the photocatalytic reactions on Au NPs should not be fully excluded in our studies even though the Au NPs show higher work function and higher H 2 -production overpotential as compared to Pt NPs.In addition, compared to conventional bulk TiO 2 structures, the unique structure of the electrospun TiO 2 NF web with strong light-scattering features could enhance the light harvesting capability of the entire structure and increase the contact between the Au/Pt/TiO 2 NFs and the reagent, which might also improve the photocatalytic activity of TiO 2 for solar-to-fuel conversion."
  },
  {
    "title": "Conclusions",
    "content": "In summary, by using a facile electrospinning technique, we have successfully fabricated Au/Pt nanoparticle-decorated TiO 2 composite nanofibers with different molar ratios of Au and Pt.The Au/Pt/TiO 2 NFs exhibit remarkably improved photocatalytic activities for not only hydrogen generation but also CO 2 reduction as compared to the TiO 2 NFs with only single metal decoration (Pt/TiO 2 and Au/TiO 2 NFs).These enhanced photocatalytic activities through codecoration of Au and Pt NPs are attributed to the synergy of electron-sink function of Pt NPs and Au SPR effect that improves charge separation of photoexcited TiO 2 .Our studies demonstrate that through rational design of composite nanostructures one can utilize a high-energy photon (blue or UV region) in the solar spectrum to generate charge carriers for photocatalytic reactions, and meanwhile, the visible light in the solar spectrum can be synergically used for SPR excitation to enhance the charge separation and photocatalytic efficiency as well.This provides a more effective way to harvest solar energy for fuel production. The EDX results and size distribution histograms of the aselectrospun nanofibers with additional SEM and TEM images (Figure S1-S4).This material is available free of charge via the Internet at http://pubs.acs.org. Corresponding Author Tel.: 65 6790 6180.E-mail: cxuentu.edu.sg. Figure 1.XRD patterns of the as-electrospun NFs: (a) TiO 2 , (b) Au 1 / TiO 2 , (c) Au 0.75 /Pt 0.25 /TiO 2 , (d) Au 0.5 /Pt 0.5 /TiO 2 , (e) Au 0.25 /Pt 0.75 / TiO 2 , and (f) Pt 1 /TiO 2 . Figure 2. SEM images of the as-electrospun NFs: (A) TiO 2 , (B) Au 1 /TiO 2 , (C) Au 0.75 /Pt 0.25 /TiO 2 , (D) Au 0.5 /Pt 0.5 /TiO 2 , (E) Au 0.25 /Pt 0.75 /TiO 2 , and (F) Pt 1 /TiO 2 .The scale bar is 1 m. Figure 3.Typical TEM images of the as-electrospun NFs at low and high magnification: (A, E) TiO 2 ; (B, F) Au 1 /TiO 2 ; (C, G) Pt 1 /TiO 2 ; (D, H) Au 0.25 /Pt 0.75 /TiO 2 ; (I-L) the HRTEM images from the corresponding square marks in the images (B-D). Figure 4. XPS spectra (A) Ti 2p; (B) O 1s; (C) Au 4f; and (D) Pt 4f of the as-electrospun NFs: (a) Au 1 /TiO 2 ; (b) Pt 1 /TiO 2 ; (c) Au 0.25 / Pt 0.75 /TiO 2 . Figure 5. UV-vis absorption spectra of the as-electrospun NFs: (a) TiO 2 , (b) Au 1 /TiO 2 , (c) Au 0.75 /Pt 0.25 /TiO 2 , (d) Au 0.5 /Pt 0.5 /TiO 2 , (e) Au 0.25 /Pt 0.75 /TiO 2 , and (f) Pt 1 /TiO 2 . Figure 6.(A) Plots of photocatalytic H 2 production amount versus UV-vis light irradiation time over 5 mg of different NFs.(B) H 2 production rates of the different NFs (5 mg): (a) TiO 2 , (b) Au 1 /TiO 2 , (c) Au 0.75 /Pt 0.25 /TiO 2 , (d) Au 0.5 /Pt 0.5 /TiO 2 , (e) Au 0.25 /Pt 0.75 /TiO 2 , (f) Pt 1 /TiO 2 , (g) Pt 0.25 /TiO 2 , (h) Pt 0.5 /TiO 2 , and (i) Pt 0.75 /TiO 2 .(C) Cycling test of photocatalytic H 2 production for the Au 0.25 /Pt 0.75 /TiO 2 nanofibers. Figure 7. Plots of CH 4 and CO production amounts as a function of UV-vis light irradiation time over 5 mg of different NFs: (A) TiO 2 , (B) Au 1 /TiO 2 , (C) Au 0.25 /Pt 0.75 /TiO 2 , and (D) Pt 1 /TiO 2 . Figure 8. Schematic diagram showing the photocatalytic process for H 2 production and CO 2 reduction on the Au/Pt/TiO 2 NFs. The authors declare no competing financial interest. The authors acknowledge the financial support from NTU seed funding for Solar Fuels Laboratory, MOE AcRF-Tier1 RG 44/ 11, MOE AcRF-Tier2 (MOE2012-T2-2-041, ARC 5/13), and CRP program (NRF-CRP5-2009-04) from the Singapore National Research Foundation.Z. Y. Zhang thanks the support from the 973 Program (Grant No. 2012CB626801) and National Natural Science Foundation of China (Grant No. 11274057). REFERENCES"
  }
]