[
  {
    "title": "Doi",
    "content": "10.1016/j.cej.2021.129295"
  },
  {
    "title": "Article_Title",
    "content": "Plasmon-induced carrier separation boosts high-selective photocatalytic CO2 reduction on dagger-axe-like Cu@Co core–shell bimetal"
  },
  {
    "title": "Abstract",
    "content": "Designing plasmonic catalysts capable of efficient and selective photocatalytic CO 2 reduction is considerable important for future carbon energy utilization.Herein, among many plasmonic bimetals, dagger-axe-like CuCo core-shell bimetal exhibits excellent photocatalytic CO 2 reduction activity.The incorporation of Co layer into a Cu matrix constructs a core-shell structure, which could increase the CO 2 adsorption capacity of Cu, thus promoting faster CO 2 adsorption/activation.The electronic coupling of Co and Cu can also cause rapid interfacial charge-transfer dynamics.Therefore, the CuCo sample exhibits enhanced catalytic activity for the reduction of CO 2 to CO, and its CO production rate is 11043.33mol g -1 without photosensitizer and cocatalyst.Furthermore, CuCo proved ultra-high CO selectivity (98) and stability (48 h).This work offers a simple strategy to finely construct a fresh type of plasmonic photocatalyst for photocatalytic CO 2 reduction."
  },
  {
    "title": "Experimental",
    "content": "Dagger-axe-like CuCo core-shell bimetal was prepared by a facile synthesis method.The as-obtained CuCo bimetal is as follows: 0.85 mmol copper acetate and 0.15 mmol CoCl 2 6H 2 O was added in 60 mL 2 M NaOH, and stirring at 30 min.Next, 1.5 mL of C 2 H 8 N 2 and 5 mmol NaH 2 PO 2 were dissolved in above solution, respectively.After stirring for 1 h, the solution was poured into 100 mL Teflon-lined autoclave and heated to 200 C for 15 h.The obtained nanoparticles were centrifuged and purified with H 2 O and absolute ethanol for several times, and then vacuum treatment at 45 C for 24 h.xCuCo (x -2, -1, 2, and 3) samples were prepared by the above preparation steps except that the molar ratio of Cu/Co is changed, which were 9.5 : 0.5, 9 : 1, 8 : 2, and 7 : 3, respectively.Cu and Co samples were respectively obtained through the above process without corresponding CoCl 2 6H 2 O and copper acetate.CoCu was prepared by the above preparation steps except that the as-prepared Co sample replaces CoCl 2 6H 2 O. Furthermore, CuNi, CuPb, CuPt, CuAu and CuRu samples were also prepared by the above preparation steps except that the corresponding metal ion can substitute Co ion. X-ray diffraction (XRD) measurements were recorded on a Bruker D8 Advance diffractometer with Cu-K radiation ( 1.5406A).Fourier transform infrared (FT-IR) spectra were recorded on a Bruker Tensor spectrometer.X-ray photoelectron spectroscopy was recorded on Thermo ESCALAB250 instrument with a monochromatized Al K line source (200 W).Microstructure was investigated by a transmission electron microscope (TEM) (JEM-2100F) and a scanning electron microscope (SEM) (FESEM, Hitachi, S-4800).Brunauer-Emmett-Teller (BET) specific surface area was tested at 77.4 K using a surface area analyzer (ASAP 2020, American) based on nitrogen adsorption and desorption isotherms.Prior to the experiments, the samples were dried and degassed under vacuum at 200 C for 12 h.Fourier transform infrared (FT-IR) spectra were recorded on a Bruker Tensor 27 spectrometer.In order to verify the behavior of the samples in the existence of CO 2 , the samples were analysed by temperature programmed CO desorption (TPD-CO 2 ).The UV-vis diffuse reflectance spectra (DRS, Hitachi U-3010 spectrophotometer) were recorded by the Kubelka-Munk approach with BaSO 4 as a reference.Transient PL lifetime and photoluminescence (PL) spectra were recorded on a fluorescence spectrophotometer (Edinburgh Instruments, FLSP-920).CO and CH 4 labelled by 13 C was detected with gas chromatography-mass spectrometer (Agilent 6890 N/5975, USA). The photocatalytic CO 2 production test was conducted in a Pyrex reactor with excellent air tightness.As a representative photocatalytic CO 2 reduction experiment, 10 mg sample was added with a magnetic stirrer in a 100 mL Pyrex reactor (4 mL H 2 O, 2 mL lactic acid).The reactor was completely evacuated, and then washed with CO 2 several times.Initially, the reactor was purged with CO 2 for 30 min and then sealed at 1 atm CO 2 .The reaction mixture was continuously stirred with a magnetic and irradiated under a 300 W Xe lamp (light intensity was 150 mW/cm 2 ).Meanwhile, the cooling water was used to maintain the room temperature.After the reaction, the CO and CH 4 were analyzed by a gas chromatograph of GC7900 (Tian Mei, Shanghai) with a FID detector and the H 2 was also detected by GC7900 with a TCD detector. Electrochemical measurements were conducted with a CHI660E electrochemical workstation in a conventional three electrode cell, using an Ag/AgCl electrode (3 M KCl) as the reference electrode and a Pt wire as the counter electrode.The working electrode was prepared on ITO conductive glass.The 50 mg sample was dispersed in 2 mL ethanol by sonication to produce a slurry.The slurry was spread onto ITO conductive glass using the doctor blade technique and dried at 80 C for 12 h.The working electrodes were irradiated by a 300 W Xe lamp (PLS-SXE300, Trusttech) in 0.1 M Na 2 SO 4 solution.Scheme 1. Illustration of the synthetic process of dagger-axe-like CuCo core-shell bimetal. H. Lai et al."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Dagger-axe-like CuCo bimetal as plasmatic photocatalyst was synthesized via using hydrothermal reaction as shown in Scheme 1.The oriented growth of Co layer loaded on the Cu core was obtained to construct a core-shell structure.At the same time, the CoCu bimetal was successfully prepared by adjusting the order of reagent addition.Furthermore, the Co/Cu ratio of CoCu and CuCo has not changed significantly (Table S1).As depicted in Fig. 1, the XRD pattern of Co sample shows subtle diffraction peaks compared with Co's standard card (JCPDS No. 05-7027) depending on the orientation growth of Co layers.Furthermore, the (1 1 1), (2 0 0) and (2 2 0) planes of Cu in as-prepared samples correspond to the peaks at 43.3 , 50.5 and 74.1 respectively (JCPDS No. 04-0836).In both CoCu and CuCo samples, only the diffraction peak of Cu appeared because the relatively low content of Co and its relatively poor crystallinity cannot be detected by XRD.After gradually increasing the content of Co introduced, the as-obtained samples gradually appeared the diffraction peaks of Co (Fig. S1).This situation also exists in other bimetals, such as CuNi, CuPb, CuPt, CuAu and CuRu samples (Fig. S2).XPS analysis is used to confirm the surface chemical state of CuCo composites (Fig. 2).The Cu 2p spectrum (Fig. 2a) shows three peaks at 932.7, 943.5 eV and 952.6 eV, corresponding to Cu 2p 3/2 , the low satellite peak of Cu 2 ions and Cu 2p 1/2 , respectively 363738.Moreover, the peak (Fig. 2b) at 918.2 eV were displayed in the Cu LMM XAES, which was ascribed to the Cu 0 in the CuCo bimetal 39.This situation also exists in bare Cu (Fig. 2c).The Co 2p of CuCo (Fig. 2(d)) composite can be equipped with two peaks with centers of 796.7 and 780.9 eV, which are attributed to Co 2p 1/2 and Co 2p 3/2 , respectively 40,41.Correspondingly, the peaks at 785.41The morphologies of as-prepared samples were tested via using SEM, TEM and HRTEM.Pure Cu has a coarse mesh structure (Fig. 3a), while pristine Co displays an irregular nanostructure (Fig. 3b).When Co is wrapped with Cu in the hydrothermal reaction, its morphology changes significantly and becomes an irregular nanostructure (Fig. 3c).In addition, the CoCu sample also shows an irregular nanostructure in the TEM image (Fig. S4a).The HRTEM image (Fig. S4b andc) displays that the lattice spacing of CoCu sample is respectively 1.91 and 2.09 A, revealing the lattice planes of Co (1 0 1) and Cu (1 1 1).This result indicates that Co and Cu are prepared into alloys in CoCu sample.Conversely, in the same process of wrapping Cu with Co, its morphology becomes a dagger-axe-like structure under the guidance of Co ions (Fig. 3d ande).It can be observed from the TEM image (Fig. 3f) and HRTEM image (Fig. 3g) that there is an ultrathin Co layer attached to the outer surface of Cu.Continuing to zoom in, we can observe obvious the lattice fringe of Cu and Co (Fig. 3o andp).The lattice spacing of the main body is 2.09 A, which corresponds to the Cu (1 1 1) plane and the lattice spacing of the shell layer is 1.91 A, pointing to the Co (1 0 1) plane 43.In order to explore that no Co particles are incorporated into the Cu host, the SAED (Fig. 3q) of CuCo sample is characterized.The results show that it is an ordered single crystal structure, which once again proves the (d,e) CuCo.TEM images (f) and HRTEM (g, o and p) of CuCo.The selected area electron diffraction (SAED) pattern (q) of CuCo.EDS spectrum (m) of CuCo.Elemental mappings of original image (n), Cu (k), and Co (j) for CuCo.existence of a core-shell structure 44.EDS (Fig. 3m) and elemental mapping images (Fig. 3(n-j)) all confirm that CuCo sample is composed of Cu and Co elements. UV-vis technology is used to detect the light absorption capacity of Cu, Co, CoCu and CuCo samples (Fig. 4).An obvious peak at about 550 nm is captured in the Cu sample, which is due to the LSPR effect produced by Cu under the excitation of light, and a similar situation has also occurred in other as-synthesized catalysts 45.Furthermore, the original Cu exhibits a wide light capture range from 200 nm to 1000 nm, and for pure Co, it exhibits excellent light absorption characteristics.Not surprisingly, the light absorption properties of CuCo sample were obviously enhanced because of the good light absorption properties of Co layer.Only by changing the packing order, the light absorption characteristics of CoCu sample are slightly reduced compared to the that of CuCo sample. The photocatalytic activities of as-acquired catalysts have been evaluated under simulated solar irradiation.As shown in Fig. 5a, CuCo sample displayed a high photocatalytic activity, while other bimetal (CuNi, CuPb, CuPt, CuAu and CuRu) displayed the low activity.This result shows that it is very important to choose the right metal to give full play to its CO 2 adsorption capacity.As the content of Co enhances, the CO generation rate of xCuCo sample improves, and then the CO generation rate of xCuCo sample decreases with the excessive enhance in the load content of Co.The CuCo sample displayed the best CO production rate, and the molar ratio of Cu to Co is 8.5:1.5 (Fig. S5).Interestingly, after 3 h of photoreaction (Fig. 5b), pure Cu slowly grows until the end of the reaction (12 h).After the introduction of Co, CuCo can maintain long-term reactivity without decay (11043.33mol g -1 ).Among them (Fig. 5c), CuCo exhibits an excellent average CO production rate (920.28 mol h -1 g -1 ), which was assigned to the excellent CO 2 adsorption capacity of Co layer.At the same time, the CO selectivity of pure Cu is only 78, while the CO selectivity of CuCo is close to 98 (Fig. 5d).While greatly increasing the photocatalytic activity of CuCo sample without photosensitizers and cocatalysts, the CO selectivity of CuCo sample is also greatly improved at the same time, which is rare in the reported literature (Table S2).This result displays that the Co layer is very important for photocatalytic CO 2 reduction.It can not only increase the CO 2 adsorption capacity of Cu, but also guide the carriers on Cu to migrate quickly due to its work function.CO and CH were quantified via using gas chromatography with a FID detector; a gas chromatography (GC) signal of CuCo sample is depicted in Fig. 6a.The isotope 13 CO 2 tracking certificates that the carbon source of CH (Fig. S6) and CO (Fig. 6b) comes from CO 2 gas.The cycle test of CuCo proves that its activity can be preserved (Fig. S7).The XRD pattern (Fig. S8) and XPS analysis (Fig. S9) of CuCo once again shows its stability 46.In addition, the core-shell structure (Fig. S10) of CuCo did not change significantly after the photocatalytic reaction. To research the effect of Co on CO 2 adsorption, TPD-CO 2 of Cu, Co, CoCu and CuCo samples were tested as presented in Fig. 6c 47.The gas desorption profiles of Cu, Co, CoCu and CuCo samples show the process of CO 2 desorption at high temperature.The highest temperature (T max ) of Cu and Co is equal to 368 C and 448 C, respectively, indicating that there is a strong interaction between CO 2 and Co sample compared with pure Cu.Therefore, the amounts of CO 2 chemisorbed by Cu and CuCo samples were calculated and the CO 2 chemisorptions of CuCo sample were 218.7 mmol g -1 , which is much higher than that of bare Cu (179.2 mmol g -1 ), revealing an improvement in CuCo sample affinity from Co layer 48,49.The reaction intermediates of as-acquired samples were characterized by FT-IR test after CO 2 adsorption.As presented in Fig. 6d, the bands at about 1598, 1551 and 1420 cm , and b-HCO 3 -, respectively 50,51.Further observation revealed that the content of intermediates gradually improved, showing that the CO 2 adsorbed on the surface of the CuCo sample is rapidly reduced to the intermediates, thereby forming CH 4 and CO. To further study the recombination of photoproduced electron-hole pairs, PL spectra of Cu, Co, CoCu and CuCo samples are tested under 310 nm light excitation 52,53.It is greatly favorable for restriction of photoinduced charge recombination in the CuCo sample, which can be confirmed by PL spectra (Fig. 7a).The CuCo composite presents a lower PL intensity than that of other as-obtained samples.Notably, EIS analyses of Cu, Co, CoCu and CuCo samples are shown in Fig. 7b.The Nyquist plots of as-acquired samples display that the photoinduced carrier separation of CuCo has less electric resistance because of its small impedance radius 54.These effects are because of the formation of core-shell structure between Cu and Co with synergy advantage and large contact area.Furthermore, the transient photocurrent responses were acquired to investigate the charge carrier migration (Fig. 7c) 55.When the lamp was turned on, the photocurrent would improve and then drop suddenly once the lamp was turned off.It was noticeable that CuCo composite exhibited the highest photocurrent, which signifies enhanced separation of photoinduced charge carriers.Moreover, time-resolved PL spectroscopy can detect the lifetime of as-obtained sample 56,57.As depicted in Fig. 7d, the exponential decay kinetics of Cu and CuCo samples have short ( 1 ) and long lifetimes ( 2 ) of charge carriers fitted by a double exponential function.The average lifetime (A) of CuCo (7.48 ns) is longer than that of Cu (4.16 ns), showing that the effective charge transfer between Co layer and Cu core.This result indicates that the introduction of Co layer not only has a huge advantage in selectivity, but also can effectively separate charge carriers in Cu. On the grounds of the above outcomes, a possible mechanism discussion with respect to the superior catalytic activity for CuCo composite is depicted in Fig. 8.In general, the LSPR effect in metals can be dual-phased through Landau damping, thereby producing charge carriers to participate in the photocatalytic reaction 58.Moreover, the work functions of Co and Cu are 5.0 eV and 4.65 eV, respectively, which are thermodynamically beneficial to the transfer of charge carriers from the Cu core to the Co layer.Thus, under light irradiation, the electrons generated on the surface of the Cu core can quickly migrate to the Co layer with a large contact area, thereby undergoing a reduction reaction with CO 2 .At the same time, the holes can be consumed via using the sacrificial agent.Briefly, the implantation of Co layer can evidently enhance the photocatalytic activity of Cu because it not only serves as an effective electron transport channel, but also serves as an active site for adsorbing and activating CO 2 ."
  },
  {
    "title": "Conclusions",
    "content": "In summary, dagger-axe-like CuCo core-shell bimetal is obtained via using a facile preparation strategy, and the adsorption capacity in the nano-system can be adjusted by changing the position of Co.While greatly increasing the photocatalytic activity with hole scavenger in the absence of added photosensitizers and cocatalysts, the CO selectivity of CuCo sample is also greatly improved at the same time, which is rare in the reported literature.The photocatalytic activity accompanied by high activity and ultra-high selectivity was attributed to the fast migration of photoinduced charge carriers derived from the Co layer.Importantly, the Co layer can enhance the CO 2 adsorption capacity of Cu.The current work can stimulate the development of non-precious bimetal as plasmonic catalyst and provide different perspectives for weaving new types of photocatalysts for various photoreduction processes. Fig. 1.XRD patterns of Cu, Co, CoCu and CuCo samples. Fig. 3. SEM images of (a) Cu, (b) Co, (c) CoCu and(d, e) CuCo.TEM images (f) and HRTEM (g, o and p) of CuCo.The selected area electron diffraction (SAED) pattern (q) of CuCo.EDS spectrum (m) of CuCo.Elemental mappings of original image (n), Cu (k), and Co (j) for CuCo. Fig. 4. UV-vis diffuse reflectance spectra (DRS) of Cu, Co, CoCu and CuCo samples. Fig. 5. Photocatalytic CO 2 reduction activity: (a) the various bimetals (CuNi, CuPb, CuCo, CuPt, CuAu and CuRu); (b) photocatalytic CO 2 evolution curves over Cu, Co, CoCu and CuCo samples.(c) average photocatalytic activity of Cu, Co, CuCo and CoCu samples.(d) CO 2 photoreduction selectivity of CO, CH 4 and H 2 over Cu, Co, CoCu and CuCo samples. Fig. 6.(a) GC Chromatogram of CO and CH 4 accumulated for 12 h by the CuCo sample.(b) Mass spectra of 13 CO (m/z 29) produced over CuCo sample.(c) TPD-CO 2 profiles for the Cu, Co, CoCu and CuCo samples.(d) FT-IR characterization of CO 2 adsorption on CuCo sample. Fig. 7. (a) Steady-state photoluminescence (PL) spectra of Cu, Co, CoCu and CuCo samples.(b) Electrochemical impedance spectra (EIS) of Cu, Co, CoCu and CuCo samples.(c) Transient photocurrent responses of Cu, Co, CoCu and CuCo samples.(d) Time-resolved PL decay profiles for Cu and CuCo samples. Fig. 8.A possible mechanism for the photocatalytic CO 2 reduction about CuCo sample. . Lai et al. We are extremely grateful for the financial support of the research fund of the Xiangtan University startup grant (06KZ/KZ08082) and the Science and Technology Innovation Program of Hunan Province (2020RC2076). The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://doi. org/10.1016/j.cej.2021.129295."
  }
]