[
  {
    "title": "Doi",
    "content": "10.1016/j.electacta.2017.04.080"
  },
  {
    "title": "Article_Title",
    "content": "Mn-carbonyl molecular catalysts containing a redox-active phenanthroline-5,6-dione for selective electro- and photoreduction of CO2 to CO or HCOOH"
  },
  {
    "title": "Abstract",
    "content": "One advantage of using homogenous molecular catalysts versus their heterogeneous counterparts for CO 2 reduction is the greater degree of control one usually retains over the selectivity of the catalyst.In this context, a pair of new manganese(I) tricarbonyl species, based on the N,N'-coordinated 1,10-phenanthroline-5,6-dione (phen-dione) ligand, have been synthesized and characterized by spectroscopic methods and X-ray diffraction.They exhibit excellent selectivity for homogeneous catalytic CO 2 reduction to CO or HCOOH through electrochemical or photochemical activation, respectively.Under the latter particularly, switching the solvent from dimethylformamide to acetonitrile remarkably enhances the selectivity of the reduction reaction towards formic acid.To obtain deeper mechanistic insight, the evolution of the catalysts and products in solution during the catalytic processes was investigated by combined electrochemical, chromatographic and spectroscopic methods.It has been shown that the presence of the -accepting, redoxactive phen-dione ligand leads to different reduced intermediates compared with standard 2,2'-bipyridine and 1,10-phenanthroline complexes, with the two first redox processes remaining localized on the ligand."
  },
  {
    "title": "Experimental",
    "content": "Triethanolamine (TEOA) was distilled under reduced pressure prior to utilisation.All other commercially available reagents and solvents were used as purchased without further purification.Due to the complexes being highly light-sensitive, all the reaction mixtures were kept in the dark using Al foil.Complexes Mn(CO 3 )(bpy)Br and Mn(CO) 3 (phen)Br were prepared according to known procedures.50 2.1.1.Synthesis of fac-Mn(phen-dione)(CO) 3 Br (1) Bromopentacarbonyl manganese (200 mg, 0.72 mmol) was dissolved in 20 mL of acetonitrile.A suspension of 1,10-phenanthroline-5,6-dione (120 mg, 0.57 mmol) in 10 mL of acetonitrile was added to this solution.The mixture was stirred for 3 h at 50 C, then allowed to cool to RT before the solvent was evaporated under reduced pressure.Excess Mn(CO) 5 Br was eliminated by vigorously stirring the crude product in 30 mL of diethyl ether for 30 min, filtering and thoroughly washing the orange-brown solid with diethyl ether.Yield: 210 mg (89 / phen-dione).FTIR (KBr pellets, CO stretching region):/cm 1 2040(s); 1942(s); 1925(s); 1697 (s). All characterizations were performed in the absence of light. 1 H, 13 C NMR spectra were recorded on a Bruker Avance 300 or Avance 400 spectrometer; chemical shifts were calibrated against the residual solvent peak; measurements were performed at room temperature unless otherwise stated; 13 C signals from the carbonyl ligands could not be observed.EPR spectra were recorded on a Bruker EMX Plus spectrometer equipped with a ER4102ST Bruker X-band cavity; measurements were performed at 100 K. IR spectra were recorded on a Perkin-Elmer Spectrum GX FT-IR spectrometer using pressed KBr pellets or an adjustable path length cell with KBr windows for solid and solution analysis respectively.UV-Vis spectra were recorded on a Zeiss MCS-501 UV-Vis-NIR diode array spectrophotometer, using conventional quartz cuvettes of optical path length l 1 cm or 2 mm.Elemental analyses were performed by the microanalysis service at the DCM in Grenoble. CO detection was performed using a Perkin Elmer Clarus 500 gas chromatograph with 560S mass spectrometer using a TurboMass v. 5.4.2 program (helium eluent gas).Gases were analysed using a PDIP detector and a 30 m Carboplot 1010 column (Antelia).Accurate quantification of gases was achieved using a 5 internal CH 4 reference and comparing against a standard injection of gases (CH 4 , CO, CO 2 , H 2 ) from Air Liquide France Industrie.Detection of products in solution was performed using a Shimadzu liquid chromatograph LC-10AS with an Alltech SelectTM Degassing system and Perkin Elmer Series 200 UV/Vis detector and a Perkin Elmer polypore H column (220 mm x 4.6mm, 10 m pore size, and 20 L injection volume).The column eluent contained 0.01 M H 2 SO 4 in H 2 O. Cyclic voltammogramms (CVs) were recorded under an argon atmosphere at RT in a conventional one-compartment three-electrodes cell, using a BioLogic SP300 potentiostat/galvanostat controlled by an EC-Lab software.The electrolyte was 0.1 M tetrabutylammonium perchlorate (TBAP) in acetonitrile.The working electrode was a glassy carbon disk (3 mm diameter) cleaned by polishing with 2 m diamond compound Diamantmittel Mecaprex (Presi); the counter electrode was a platinum plate, isolated from the electrolytic working solution through an CH 3 CN 0.1 M TBAP solution bridge; the reference was a Ag/AgNO 3 (0.01 M) electrode in CH 3 CN 0.1 M TBAP.All the potentials are quoted vs. Ag/Ag .In all experiments the potential scan rate was 100 mV s -1 . Controlled potential electrolysis (CPE) experiments were carried out under an argon atmosphere (glove box) at RT using a vitreous carbon (VC) plate or carbon felt as the working electrode.The process was followed by monitoring the changes in the UV-Vis spectra of the solution by spectroelectrochemical (SEC) measurements at RT coupled with an MCS 501 UV-NIR (Carl Zeiss) spectrophotometer equipped with an automatic shutter and with optic fibers using an additional 1 mm quartz immersion probe (Hellma). Electrocatalysis experiments were carried out at RT under a CO 2 :CH 4 mixed (95:5) atmosphere (20 min purging of reaction vessel) in a conventional three-electrodes cell sealed with Apiezon M vacuum grease.The working electrode was either a VC plate or carbon felt.The total volume of the cell amounted to 173 mL and during the electrocatalytic experiments the headspace gas was analysed directly from the electrochemical cell by GC using a 100 L injection syringe.Liquid product (HCOOH) detection was done by HPLC (see 2.2.).CO 2 reduction product Faradaic yields (FY) and Turnover Numbers (TONs) were calculated. Photocatalysis experiments were performed using a method derived from the one implemented by Ishitani et al. 34 4 mL of solvent (MeCN or DMF or H 2 O) were mixed with 1 mL of triethanolamine (TEOA) in a quartz cell of optical path length l 1 cm and 28 mL total volume.Unless otherwise stated, the amounts of 1-benzyl-1,4-dihydronicotinamide (BNAH), Ru(bpy) 3 Cl 2 H 2 O and the Mn complex were calculated so that their final concentrations were 0.1 M, 0.1 mM and 0.1 mM, respectively.The quartz cell was tightly sealed using a rubber septum and the resultant solution was degassed with a CO 2 :CH 4 mix (95:5) for 30 min.The cell was then transferred to the irradiation setup bench. Photoirradiation was performed using a Hamamatsu Lightnincure LC8 lamp in association with two filters: a monochromatic one (457, 480 or 500 nm) and a large band pass filter from 400-800 nm.Irradiation was performed at 70 lamp intensity (600 mW.cm -2 ).The reaction usually proceeded for 16 h after irradiation had begun; however, during the UV-Vis monitoring experiment (see main text) irradiation was less efficient due to the additional presence of the measurement device, and complete reaction took around 60 h. Intensity data collections were carried out with a Bruker AXS Enraf Nonius diffractometer equipped with a CCD bidimensional detector using Mo-K monochromatized radiation ( 0.071073 nm).The measurement was performed at 200 K.The absorption correction was based on multiple and symmetry-equivalent reflections in the data set using the SADABS program.51 The structure was solved by direct methods and refined by full-matrix leastsquares using the SHELX-TL package52 as part of the WINGX v.1.80.05 program.53 Crystal data for 2: C 19 H 12 F 6 MnN 4 O 5 P, M r 576.24,monoclinic, space group C2/c, a 2.5956(5) nm, b 1.4186(3) nm, c 1.5317(3) nm, 122.179(30),V 4.7734(17) nm 3 , Z 8, calc 1.604 g cm -3 , F(000) 2304, GOF 1.078.23005 reflections were measured, of which 4193 were unique (R int 0.0455).R 1 0.0667 I2(I); wR 2 0.2167 (all data).Nonhydrogen atoms were refined anisotropically.Hydrogen atoms from methyl groups could not be located accurately on the Fourier maps and were constrained to ride on their parent atom using the HFIX routine.CCDC 1058764 contains the supplementary crystallographic data for this paper.These data can be obtained free of charge from the Cambridge Crystallographic Data Centre via www.ccdc.cam.ac.uk/datarequest/cif."
  },
  {
    "title": "Results_and_Discussion",
    "content": "fac-Mn(phen-dione)(CO) 3 Br (1) was synthesized with good yields from phen-dione and a slight excess (1.25 eq.) of Mn(CO) 5 Br in acetonitrile.fac-Mn(phen-dione)(CO) 3 (MeCN)PF 6 (2) was obtained by stoichiometric reaction between 1 and silver hexafluorophosphate in acetonitrile.The FTIR spectra of both complexes feature, between 1900 and 2100 cm -1 , three distinct CO stretching bands characteristic of fac-Mn tricarbonyl complexes,52,53 and a unique band corresponding to the carbonyl stretch of the phen-dione ligand at around 1700 cm -1 .41 Single crystals of 2 (red blocks), suitable for X-ray diffraction, were grown by slow vapour diffusion of diethyl ether into an acetonitrile solution.The asymmetric unit is presented in Fig. 1, characteristic bond lengths and angles in Table 1 (see Experimental Section 2.6.for crystal data and refinement parameters). Fig.1 Table 1 The species crystallizes alongside its PF 6 -counter anion and one solvent molecule (not shown on Fig. 1), in the monoclinic centrosymmetric space group C2/c.The structure confirms the fac configuration of the complex, where the Mn I center is in pseudo-octahedral environment, the last position being occupied by a coordinated acetonitrile molecule.Mn-N and Mn-C bond distances are nearly identical to those previously measured in the bipyridyl analogues.17 The short C-O distances (0.1197 nm) of the carbonyl groups in the phendione indicate the ligand has retained its diketone form. Both complexes are soluble in most organic solvents.When kept protected from light, their solutions in DMF or acetonitrile are stable for around 12 h before they start to slowly degrade. 2 is also soluble in water, where NMR measurements have shown it almost instantly turns into a mixture of three different species, whose respective proportions are pH-dependent.This equilibrium can be explained by the facile hydration of the carbonyl groups of the phen-dione in water, a commonly observed behaviour (Scheme 3).45,56 A variable temperature 1 H NMR measurement was carried out (Fig. 2) in order to identify the different species produced from 2 under five different solvent conditions.This study has shown that several factors have an impact on the species or mixture of species present in solution: temperature (low temperature slows down the equilibrium), pH, and the presence of chelating cations such as Mg 2 .These results are consistent with the study of the phendione molecule in the presence of H 2 O, protons and metal cations by Anson et al. 45 Scheme 3 Fig.2 The UV-Vis spectrum of an acetonitrile solution of 1 (Fig. 3, black curve) shows two absorption bands at max 354 and 426 nm ( 2800 and 2200 M -1 cm -1 , respectively).Based on previous studies on Mn carbonyl bipyridyl complexes, these bands can be attributed to a metal-to-ligand charge transfer (MLCT) and a halogen-to-ligand charge transfer (XLCT), respectively.52As expected, only an MLCT band is observed in the absorption spectrum of 2 ( max 366 nm, 3700 M -1 cm -1 , Fig. 3 red curve).Lower energy transitions ( max 300 nm) of higher molar extinction coefficients ( 10 4 M -1 cm -1 ) were attributed to intra-ligand - transitions. Fig.3 The reduction potentials of 1 and 2, as well as those of two reference complexes (Mn(bpy)(CO) 3 Br and Mn(phen)(CO) 3 Br), are summarized in Table 2. 1 and 2 show the same redox behavior in their reductive CVs.In acetonitrile / 0.1 M TBAP electrolyte, on the initial reduction scan, both Mn complexes show a pair of reversible redox events.This is similar to the free phen-dione, 43 as the quinone-based redox properties are retained (Fig. 4, black curves; for 1: E 1/2 -0.55V with E cp1 -0.58V and E ap1 -0.51V; E p 0.07 V and E 1/2 -1.31V with E cp2 -1.35 V and E ap2 -1.27V; E p 0.08 V).The CV of 2 (Fig. S1 in the Supplementary Content) contains the same redox systems but shifted (E p 0.16 V) to slightly less negative potentials (E 1/2 -0.40V with E cp1 -0.44V and E ap1 -0.36V; E p 0.08 V and E 1/2 -1.14V with E cp2 -1.18V and E ap2 -1.09V; E p 0.09 V).This is expected as the complex features a less electron-donating acetonitrilo ligand instead of a bromo ligand.The two reductions are assigned to two successive one-electron ligand-centered reductions (Scheme 4), similar to a previously reported Ru complex bearing a phen-dione ligand.57 In these new Mn carbonyl complexes the coordinated phen-dione is thus electrochemically reduced. Fig.4 It was also of interest to compare the CV of 1 to the CV of the free ligand (Fig. 4, red curve; E 1/2 -0.79V with E cp1 -0.82V and E ap1 -0.76V; E p 0.06 V and E 1/2 -1.54V with E cp2 -1.57V and E ap2 -1.50V; E p 0.07 V).It is unambiguous that 1 contains the phen-dione redox active ligand, but potentials are shifted towards less negative values (E 1/2 0.25 V for 1 and 0.41 V for 2) due to complexation with the Mn tricarbonyl moiety.These reduction processes successively lead to the semiquinone anion radical and the fully reduced dianion catecholate species (Scheme 4).43 A comparison of the electrochemical properties of 1 with those of a sample of Mn(phen)(CO) 3 (CH 3 CN)PF 6 (phen 1,10-phenanthroline; Fig. 5) 39,58 showed drastically different redox properties between the two. Fig.5 Indeed the phen-Mn complex behaves much like the archetypal Mn(bpy)(CO) 3 Br 17 and Mn(terpy)(CO) 3 Br complexes.29,59 This consists first in a one-electron irreversible metal centered reduction (E cp1 -1.52V; E ap1 -0.48V; Fig. 5 and Fig. S2 in the Supplementary Content).A controlled potential electrolysis (CPE) at E -1.53V leads to the formation of a Mn 0 dimer (Eq.1), characterized by the growth of four new absorption bands on the electronic spectrum of the solution during the first 43 min of the CPE ( max 394, 436, 643 and 761 nm; Fig. S3).This result suggests a one-electron EC process followed by a dimerization step, as already described in the literature for Mn-bpy complexes.However, this dimer was not stable and degraded even during its electrogeneration.The subsequent step (E cp2 -1.81V; E ap2 -1.44V; Fig. 5 and Fig. S2) is also an irreversible one-electron reduction (EC process) probably leading, at the time scale of the cyclic voltammetry, to an Mn -I monomeric species (Eq.2).This species could not be prepared by exhaustive CPE, since the dimer parent complex was not stable. Mn I (phen)(CO) 3 Br 1 e - 12 Mn 0 (phen)(CO) 3 2 Br -Eq.1 12 Mn 0 (phen)(CO) 3 2 1 e - Mn -I (phen)(CO) 3 - Eq.2 The fact that Mn(phen)(CO) 3 Br is reduced into an unstable dimer in MeCN may explain why this complex shows poor selectivity and faradaic yields for CO 2 electroreduction in spite of some catalytic activity in the presence of a proton source (Fig. S2; also see part 3.4 below). Spectroscopic properties of the reduced species resulting from the one-and two-electrons exhaustive reductions of 1 were investigated.A potential of -0.56 V was first applied.This reduction process, which was monitored by UV-Vis (Fig. 6(a)) and FT-IR (Fig. 7; black and red curves) spectroscopies, is a quantitative single electron process.The two absorption bands in the near UV region of 1 ( max 354 and 426 nm; MLCT and XLCT) increase in intensity and shift ( max 410 nm), and a new broad absorption band centered at 640 nm appears.There is no absorption evidence that would suggest a Mn 0 dimer formation ( 700-900 nm) either from 1 or from 2 (2 -: max 480 and 637 nm).The shapes of the UV-Vis spectra after the complete reductions of 1 and 2 are very similar to that of the spectrum of the phen-dione - radical anion (Fig. 6(a) inset; max 400 and 555 nm) obtained by exhaustive one-electron reduction of the free phen-dione (E app -0.90V).The only difference is that the absorption bands, due to the phen-dione reduced moiety in 1 -(Eq.3)and 2 -, are shifted by ca.80 nm to longer wavelengths.This is in agreement with what was reported when cobaltocene was used as a chemical reductant to generate the free radical anion phen-dione -.60 Mn I (phen-dione)(CO) 3 Br e - Mn I (phen-dione -)(CO) 3 Br - Eq.3 Fig.6, Fig.7 In the FT-IR spectra before and after the one-electron exhaustive reduction at -0.56 V (Fig. 7), the CO stretching bands that existed at 2032, 1941 and 1931 cm -1 in 1 are almost all shifted symmetrically to 2025 ( 7 cm -1 ), 1929 ( 12 cm -1 ) and 1919 cm -1 ( 12 cm - 1 ), respectively; but no other change is evident in the 1900 -2100 cm -1 region.This strongly suggests that the reduced complex has retained its fac-Mn-tricarbonyl structure.54 In contrast the CO stretching band of the phen-dione ligand at 1708 cm -1 disappears, in agreement with the formation of the singly reduced species (Scheme 4).In addition, we observed a shift of IR bands from 817, 676 and 635 cm -1 to 809 ( 8 cm -1 ), 678 ( 2 cm - 1 ) and 638 ( 2 cm -1 ) for the reduction 1 1 -, which we attributed to respectively counter anions and additional CO characteristic absorptions. The CVs after the one-electron reduction show the reversible redox system corresponding to 1 0/-(E 1/2 -0.55V), as well as the 1 -/2-system (E 1/2 -1.33V).The formation of a ligandlocalized radical species after reduction has been further characterized by EPR in MeCN, under argon, at 100 K with a line width of about 29 G (3373 G; sharp X-band EPR spectrum at g 2.004), proving the formation of an organic radical anion after reduction (Eq.3). The one-electron reduction of 1 -was performed at -1.50 V as a second step and followed by UV-Vis (Fig. 6(b)) and IR (Fig. 7) spectroscopies.The IR spectrum recorded after this exhaustive CPE shows a small shift of the CO-stretching wavenumbers, characteristic of a one-electron ligand-based reduction process ( co 13 cm -1 ; Eq.4).The corresponding UV-Vis spectrum is presented on Fig. 6(b), blue curve; so far this product could not be further characterized.However, the characteristic 1 2-absorption bands ( max 403 and 626 nm), which are shifted from those of 1 -( max 10 nm), have been transitorily observed after 5 min of CPE (Fig. 6(b), orange curve).This shows that 1 2-is not very stable (85 yield, from IR spectrum); still, it should be noted that the two-electron reoxidation of 1 2-regenerates the initial species (75 yield from IR data). Mn I (phen-dione -)(CO) 3 Br - e - Mn I (phen-dione 2-)(CO) 3 Br 2- Eq.4 Therefore, with the evidence gathered from the various spectroscopic and electrochemical analyses, we assume the two reductions of these Mn-phen-dione carbonyl complexes to be primarily ligand centered, most likely on the oxygen atoms of the phen-dione. 1 and 2 have been tested as molecular catalysts for CO 2 electroreduction in homogeneous solution.They are of great interest, first, because Mn-carbonyl diimine type complexes have already shown highly encouraging results for this catalytic application (see for instance references 17,21,61626364); and second, because phen-dione ligands in Mn complexes may strongly influence the efficiency and the selectivity of the CO 2 reduction reaction.In the 1990s, Wrighton et al. 60 showed that the chemically reversible reductive addition of CO 2 to phen-dione, in the presence of a strong reductant (cobaltocene), gave a CO 2 adduct bis(carbonate) species.This further emphasizes the potential role that this ligand could play in redox reactions in the presence of CO 2 . Fig.8 Scheme 5 In Fig. 8 we see that the CV of 1 changes in the presence of CO 2 (red curve), in agreement with a reaction between CO 2 and the reduced forms of 1.The first reversible redox system (1 0/-), initially at E 1/2 -0.55V, is slightly shifted to E 1/2 -0.53V (E cp1 -0.55V; E ap1 -0.50V); its intensity increases ( 20) and two new irreversible redox systems appear at E cp2 -1.15V and E cp3 -1.75V.The latter may correspond to a two-electron reduction of the CO 2 adduct (bis carbonate), generated in situ after the phen-dione was reduced and subsequently trapped two CO 2 molecules (Scheme 5).It is worth noting that the 1 -/2-system is not substantially present at E 1/2 -1.31V. After addition of 5 of H 2 O (found to be the optimal amount), under a CO 2 atmosphere, the intensity of the first reversible redox system is doubled (Fig. 8, blue curve; E 1/2 -0.41V; E cp -0.48V; E ap -0.34V; E p 0.14 V), suggesting that, under CO 2 , the redox process becomes a two-electron one.The E 1/2 is less negatively shifted (E 1/2 0.14 V) compared to 1.This CV change is similar to the one which was previously observed for free phen-dione in the presence of CO 2 .60 The results of this analytical study agree with the formation of a phenbi-carbonic acid adduct after the two-electrons reduction of 1 in the presence of CO 2 and protons (H 2 O/CO 2 ; pH 4-5; Eq.5). Mn I (phen-dione)(CO) 3 Br) 2 CO 2 2e - 2H Mn I (phen(OC(O)OH) 2 )(CO) 3 Br Eq.5 Interestingly, an intense wave is observed in this CV (Fig. 8, blue curve) starting at -1.50 V, characteristic of electrocatalytic activity.In accordance with the catalytic intermediate characterized for Mn-bpy based complexes, 17 this experimental result suggests that an anionic monomer electrogenerated at this potential (Eq.6) is probably the key catalytic species.For the phen equivalent reference compound, in the presence of CO 2 and 5 of water, the foot of the intense wave is observed at a more negative potential (-1.80 V; Fig. S1). Mn I (phen(OC(O)OH) 2 )(CO) 3 Br 2e - Mn -I (phen(OC(O)OH) 2 )(CO) 3 - Br - Eq.6 Preparative scale electrocatalytic CO 2 reduction was therefore carried out with 5 H 2 O, and the product formation was monitored over the course of the experiment.These experiments, using 1 or 2 independently, show that when applying a potential of -1.70 V, Faradaic yields (FY) of CO up to 100 are achieved over the course of 7 h.Subsequently the catalytic efficiency decreases.It should be noted that further electrocatalytic investigations in the presence of more than 5 of H 2 O were carried out and showed a decrease of the FY ( 40 over 7 h for 10 of H 2 O).Moreover, to assess the advantage of using phen-dione derivatives compared to phen complexes, we have determined the catalytic activity of Mn(phen)(CO) 3 Br for the preparative scale electroreduction of CO 2 under the same conditions as above.In this case, the reduction was not selective and produced a mixture of CO and H 2 (10:2), with a poor efficiency and FY, likely due to the instability of the reduced forms of the Mn-phen complex.The optimum total FY using Mn(phen)(CO) 3 Br was obtained for an applied potential of E -1.90V (FY CO 57 and FY H2 33 over 7h), in the presence of more added water (15).Additionally, a reference experiment using the free phen-dione ligand (CPE at E -1.70V) did not yield any detectable amount of reduction products, in agreement with a catalytic process for 1 and 2 proceeding via an interaction between the reduced form of the metallic center in Mn-phen(OC(O)OH) 2 and CO 2 molecules.There is no direct evidence that the CO 2 molecules trapped by the reduced catecholate site of phendione were further involved in the catalytic process. For Mn-carbonyl complexes, the selectivity of CO 2 photocatalytic reduction to HCOOH has recently been reported twice for 2,2'-bipyridine derivatives.36,65 Photocatalytic properties of 1 and 2 towards the reduction of CO 2 were investigated in different solvents (DMF, MeCN, MeCN/H 2 O, H 2 O).They were compared to the photocatalytic properties of analogue complexes Mn(bpy)(CO 3 )Br and Mn(phen)(CO) 3 Br, for which the measurements have been performed in our own experimental conditions (Table 3).In MeCN the photocatalytic CO 2 reduction is selective for formic acid (HCOOH) over CO and over the potentially competitive H 2 production from H reduction. Table 3 Our experimental conditions were derived from the ones implemented by Ishitani et al. 36 During the photoactivation process, a photosensitizer (here Ru(bpy) 3 Cl 2 ) in its excited state is reduced by a sacrificial reducing agent and is then able to reduce the catalyst (Eq.7).66,67 Ru II (bpy) 3 2 Ru II (bpy) 3 2 Ru I (bpy) 3 cat Ru II (bpy) 3 2 cat - Eq.7 1-benzyl-1,4-dihydronicotinamide (BNAH) and triethanolamine (TEOA) were also added as reducing agents and proton sources.68 In the absence of either of these, the products were only formed in negligible amounts.When working in water, ascorbic acid (AA) was used instead.Gaseous products (CO, H 2 ) were quantified by gas chromatography (GC), formic acid by HPLC (see Experimental Section: 2.2). Although in our experimental conditions the TONs obtained using Mn(bpy)(CO) 3 Br in DMF were not as high as those recently reported, 36 we confirmed that HCOOH was found as the major product in this solvent.In MeCN however, we noticed an inversion of selectivity towards CO.Compared to this Mn-bpy complex, the selectivity of 1 and 2 is markedly different: in DMF, 1 and 2 led to a roughly equivalent mixture of CO and formic acid, while in acetonitrile, 1 and 2 are selective for HCOOH (CO/HCOOH 1/5) and Mn(bpy)(CO) 3 Br orients the reaction towards CO production.The other reference complex, Mn(phen)(CO) 3 Br, has always afforded CO as the major product, with a lesser overall TON.In addition, 1 and 2 in MeCN proved more active than Mn(bpy)(CO) 3 Br in DMF for CO 2 reduction to HCOOH, with an overall TON around 60 after 16 h of irradiation.H 2 formation always remained below the detection limit of the GC.As 2 is soluble in water, its photocatalytic activity was also tested in this medium, but no reduction product was detected.This is not surprising considering the notably different behavior of this complex in aqueous conditions (see 3.1.) The above results aptly demonstrate the unique photocatalytic properties of Mn-phen-dione carbonyl complexes with HCOOH selectivity in MeCN, compared with Mn(bpy)(CO) 3 Br.It is then reasonable to assume the difference in products selectivity is related to the nature of the ligand.However, contrary to what was observed during the electrochemical reduction, during the photocatalytic experiment, the dione part of the Mn-phen-dione complex was not affected.The photo-and electroactivated reductions proceed through different intermediates. Fig.9 To gain a better understanding of the evolution of the different species during photocatalysis, we monitored the reaction using UV-Vis spectroscopy; because of the different setup (especially, the additional presence of an optical fiber holder) it proceeded more slowly than usual.As the behaviors of 1 and 2 are similar, only the latter will be discussed here.Fig. 9(a) shows the evolution of the UV-Vis spectrum of 2 during photocatalysis in acetonitrile.Initially (first 10 h) it is characterized by the combined increase of three absorption bands at 630, 715 and 751 nm, these last two bands eventually collapsing into a single, broad signal.Fig. 9 (b) shows the correlation between the absorbance at the max 751 nm band and the production of HCOOH over time, which suggests the corresponding species is likely to be a catalytic intermediate.After this feature disappears (t 60 h), HCOOH formation becomes negligible. Fig.10 Fig. 10 shows the UV-Vis spectra of the species generated from 2 during different photo-or electrochemical experiments.It should be remembered that the species generated by either photo-or electroreduction of Mn I (bpy)(CO) 3 Br is a dimer (Mn 0 (bpy)(CO) 3 2 characterised by two strong absorption bands at 632 and 810 nm (Fig. 10 black curve).17181920.We have shown (section 3.2.) that this dimer is not formed during the two-electrons reduction of either 1 or 2 (CPE at E -1.50 V); a diionic species characterized by a broad absorption band at 637 nm is formed instead (Scheme 4; Fig. 6(a) for 1 -).Under photocatalytic conditions, however, the reaction intermediates seem different again (Fig. 10, red curve): though these were too unstable to be characterized, their UV-Vis absorption spectra suggest neither a Mn 0 dimer nor Mn I (phendione -)(CO) 3 (MeCN)."
  },
  {
    "title": "Conclusions",
    "content": "In summary, we have synthesized and characterized two new Mn I carbonyl complexes bearing the redox-active phen-dione ligand.After a first two-electrons ligand based reduction, these complexes are able to trap two molecules of CO 2 , and by ECEC reactions, lead to Mn I bis carbonate-phen complexes.These electrogenerated species have been characterized by spectroscopic and electrochemical techniques.In acetonitrile medium, both Mn-phen-dione derivatives are active for selective catalytic CO 2 reduction, either electrochemically (yielding CO exclusively) or photochemically (yielding mostly HCOOH).In the latter case, the TON for formic acid production was higher than when using the reference complex Mn(bpy)(CO) 3 Br.Under our conditions, it was comparable to that measured in DMF for this same complex.In situ UV-Vis studies during photocatalysis pointed to a different intermediate than the usual Mn 0 dimer, which is likely to explain the difference in selectivity.The major difference between the photo-and electroactivated processes is that the photoexcitation does not seem to affect the dione moiety of the Mn-phen-dione complex, contrary to the electrochemical pathway.The solubility of one of the complexes in water makes it a potential candidate for photo-or electrocatalytic CO 2 reduction in aqueous conditions.We are currently working on characterizing the processes and equilibria involved in water/acetonitrile media to make such a reaction viable.Table 3. Photocatalytic CO 2 reduction with the Mn complexes under various conditions. a Mn NaA / AA / TEOA 500 0 0 a Unless otherwise stated: 0.1 M Ru(bpy) 3 Cl 2 as the photosensitizer, 0.1 M BNAH, irradiation time 16 h; b 24 h irradiation time; c under Ar. Fig. 1.Crystal structure of 2 with thermal ellipsoids (50 probability) including atom labels.Hydrogen atoms, solvent molecules and the PF 6 -counter-ion have been omitted for clarity. Fig. 2. 1 H NMR spectra (400 MHz) of solutions of 2: (a) in CD 3 CN; (b) in D 2 O; (c) in D 2 O at 0 C, showing a partial splitting of the broad peaks; (d) in D 2 O in the presence of excess Mg 2 , which enables a complete splitting by presumably chelating the phen-dione ligand and slowing down the exchange kinetics; (e) in D 2 O with Mg 2 in acidic medium (D 2 SO 4 ).The equilibrium, thus the relative amounts of the three species, depends on temperature, pH, and Mg 2 addition.See Scheme 3 for colour code; peak attribution was based on corresponding COSY spectra; on (d) integration is 2:2:2 for , 1:1:1:1:2 for , and 2:2:2 for . Fig. 3. UV-Vis spectra of acetonitrile solutions of 1 (black) and 2 (red), c 1 mmol dm -3 , l 2 mm. Fig. 5. CVs of 1 (black) and Mn(phen)(CO) 3 (MeCN)PF 6 (red), c 1 mmol cm -3 each in MeCN 0.1 M TBAP, 100 mV s -1 ; GC working electrode (3 mm diam.). Fig. 6.(a) In situ UV-Vis spectra of 1 during CPE at -0.56 V (black to red, 5 min/spectrum) inset: CPE at -0.90 V of the free phen-dione (10 min/spectrum) and (b) before (black) and after CPE at -0.56 V (red) and CPE at -1.50 V (orange and blue each 5 min); c 1 mmol cm -3 in MeCN 0.1 M TBAP; quartz probe l 1 mm. Fig. 7. IR spectra of 1 initial (black); after CPE at -0.56 V (red) and after CPE at -1.50 V (blue); c 1 mmol cm -3 in MeCN 0.1 M TBAP. Fig. 8. CVs of 1, c 1 mmol cm -3 in MeCN 0.1 M TBAP; under Ar (black), under CO 2 (red), under CO 2 5 H 2 O (blue); 100 mV s -1 ; GC working electrode (3 mm diameter). Fig. 9. (a) Evolution of the UV-Vis spectrum of an acetonitrile solution of 2 (l 2 mm) during the first 10 h of photocatalysis; (b) joint evolution of the max 751 nm absorption band (black curve) and the TON of formic acid production during photocatalysis (red dots). Fig. 10.UV-Vis spectra of generated intermediate species: from Mn(bpy)(CO) 3 Br in DMF under photocatalytic conditions (black), from 2 in MeCN under photocatalytic conditions (red), during the electroreduction of 2 in MeCN 0.1 M TBAP at 0.51 V (green), and at the end of exhaustive 1 e -reduction of 2 (green dotted line). (38.1); H 1.68 (1.90); N 7.85 (8.03).Single crystals suitable for X-ray diffraction were grown by slow vapour diffusion of diethyl ether into a solution of 2 in acetonitrile. Acknowledgements M. S. thanks the Universite Grenoble Alpes for his Ph.D grant.J.-D. C. acknowledges postdoctoral funding from the ARCANE Labex (ANR-11-LABX-0003-01).M. T. and P. S. received grants from the NSF International Research Experiences for Undergraduates (iREU) exchange program from LSU and scholarships from ARCANE Labex.The authors thank Mr. Florian Molton for his help with EPR and electrochemical measurements."
  }
]