[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2020.119630"
  },
  {
    "title": "Article_Title",
    "content": "Enhanced photocatalytic CO2 reduction in H2O vapor by atomically thin Bi2WO6 nanosheets with hydrophobic and nonpolar surface"
  },
  {
    "title": "Abstract",
    "content": "The artificial carbon dioxide (CO 2 ) photoreduction into useful chemicals utilizing solar energy demands the stable photocatalysts with high-efficiency charge separation and effective CO 2 adsorption capacity.For all this, for the first time, Bi 2 WO 6 photocatalysts with atomically thin structure along with hydrophobic and nonpolar surface are successfully designed and prepared using CTAB as assistant.The ultrathin feature with short diffusion distance significantly facilitates the charge separation.The hydrophobic surface, modified by nonpolar long carbon chains of CTA , boosts both the mass-transfer and adsorption of CO 2 , meanwhile suppressing the H 2 O adsorption.Hence, the prepared photocatalyst exhibits a high-efficiency photocatalytic conversion of CO 2 in H 2 O vapor without co-catalyst due to high CO 2 concentration and sufficient photogenerated carriers.The photocatalytic mechanisms including adsorption concentration and activation process of CO 2 are further revealed by the in-situ diffuse reflectance infrared fourier transform spectra (DRIFTS).As a new feature, linearly adsorbed CO at 2035 cm -1 is found on hydrophobic surface of Bi 2 WO 6 , and the absorbance of CO is critical to the next reaction step for CH 4 generation.This innovation provides a facile avenue for the design of photocatalysts with remarkable CO 2 capture ability to achieve the practical application of photocatalytic CO 2 reduction.However, the hydrogen evolution reaction (HER) is the competing"
  },
  {
    "title": "Experimental",
    "content": "The chemicals using in this work including Bismuth nitrate pentahydrate (Bi(NO 3 ) 3 5H 2 O, 99.0 ), Sodium tungstate dihydrate (Na 2 WO 4 2H 2 O, 99.5 ), Hexadecyl trimethyl ammonium bromide (CTAB, 99 ), and Potassium bromide (KBr, 99.5 ) were purchased from Aladdin and used without further purification.High purity CO 2 (99.999 ) was provided by Air Liquide China. 13C labelled CO 2 gas (99 atom 13 C) were purchased from Wuhan Newradar Special Gas Company Limited. 1 mmol of Bi(NO 3 ) 3 5H 2 O, 0.5 mmol of Na 2 WO 4 2H 2 O and 0.025-0.08g of CTAB were added to 70 mL of deionized water with ultrasonic for 10 min.After stirring for 30 min, the above mixed solution was transferred into the Teflon-lined stainless-steel autoclave and heated at 120 C for 24 h.The as-prepared sample was collected by filtration and washed with deionized water for several times.After vacuum drying for 8 h, the atomically thin and hydrophobic Bi 2 WO 6 nanosheets were obtained.The atomically thin and hydrophobic Bi 2 WO 6 nanosheets prepared with different content of CTAB (0.025, 0.05 and 0.08 g) are labelled as BWO-C1, BWO-C2 and BWO-C3, respectively. For comparison, under the same experimental procedure, the atomically thin and hydrophilic Bi 2 WO 6 nanosheets were prepared with 0.1 mmol of KBr assistant instead of CTAB, which was labelled as BWO-K.And the bulk Bi 2 WO 6 were synthesized without adding CTAB or KBr, which was labelled as BWO. The morphologies and microstructures were obtained by transmission electron microscope (TEM) on Philips-FEI Talos F200S microscope at 200 kV.The scanning transmission electron microscopy (STEM) and the X-ray spectroscopy (EDX) were collected by a high-angle annular dark-field (HAADF) detector and an EDAX analyzer, respectively.The water contact angle texts of were recorded by a contact angle meter with SL200KS (Kino, USA).Atomic Force Microscopy (AFM) were determined by Multimode 8 (Bruker).X-ray powder diffraction (XRD) patterns were acquired by a Rigaku D/Max 2550 X-ray diffractometer with Cu K radiation source.The CO 2 adsorption isotherms were measured at 298 K using a Micromeritics TriStar II 3flex automatic specific surface.BET surface areas of samples were obtained at 77 K with a Micromeritics ASAP 2020M instrument.Fourier transform infrared spectra (FTIR) were acquired by VERTEX 70 infrared spectrometer (Bruker).to determine the Bi, W and Br content.Resonance (EPR) signals were measured by Bruker A300 at 80 K to investigate the oxygen vacancies.X-ray photoelectron spectra (XPS) and valence-band X-ray photoelectron spectroscopy (VB-XPS) were recorded with Thermo ESCALAB 250 with Al K X-ray.The banding energies of Bi, W, O, and Kr were referred to the C 1s (C sp 3 ) peak at 284.8 eV.(UPS) were measured with a monochromatic He I light source (21.2 eV) and a VG Scienta R4000 analyzer.A bias of -5 V was applied to observe the secondary electron cutoff.Ultraviolet-visible diffuse reflectance spectra (DRS) were collected on a Hitachi U3010.The time-resolved photoluminescence spectra were recorded with Edinburgh Instruments FLS920 with an excitation wavelength of 300 nm, and decay curves were fitted by decay curves of ExpDec1 function. In-situ diffuse reflectance infrared Fourier transform spectra (DRIFTS) were recorded on Thermo Nicolet 6700 FT-IR spectrometer equipped with a liquid nitrogen cooled HgCdTe (MCT) detector.The spectra in absorbance units were acquired with a resolution of 4 cm -1 , using 32 scans.The reaction chamber was equipped with the circulating cooling water system.The irradiation was introduced through a liquid light guide (Au-Light, China) that connects to a 300 W Xe lamp (CEL-HXF300, Au-Light, China).Firstly, high purity CO 2 was continuously passed through a water bubbler to take a mixture of CO 2 and water vapor into the chamber at 8 mL/min for 60 min.After that, the inlet and outlet valves of the reaction chamber was closed.Prior to the light irradiation, the samples were kept in dark at CO 2 and H 2 O atmosphere for 60 min.The sample was under illumination (300 W Xe lamp) for 60 min.The spectra were collected every 10 min, and the light was temporarily blocked during the collection.The temperature of the reactor was kept at 25 C by the cooling water circulation. The photocatalytic CO 2 reduction activity tests of the photocatalysts were carried out in a 250 mL Pyrex glass reactor (PQ256, Beijing Perfectlight, China).Firstly, 30 mg of as-prepared samples and 5 mL of deionized water were added to a watch glass, with an area of 23.75 cm 2 , and then ultrasonic mixing for 10 min.The above suspension was evaporated at 60 C in drying oven to form the uniform film.The design of photocatalytic reactor was shown in Fig. S2.Prior to the light irradiation, the watch glass was put in the reactor, and the air in the system was removed completely by vacuum treatment.Subsequently, a mixture of high purity CO 2 gas and water vapor were purged into the reactor by passing the CO 2 through a water bubbler.The light source was 300 W Xe lamp (CEL-HXF300, Au-Light, China) equipped with AM 1.5.The reaction temperature was kept at 25 C by the circulating cooling water system.The operating reaction pressure during irradiations is under the atmosphere pressure.During each measurement, 1 mL of the mixed gas was periodically withdrawn by a syringe injector and analyzed by a gas chromatograph (GC7920-TFA, Au-Light, China) equipped with flame ionization detector (FID), thermal conductivity detector (TCD) and nickel catalytic converter.Using Argon as carrier gas and TDX-01 (3 mm 3 m) as chromatographic column, the product including methane, carbon monoxide, and oxygen can be analyzed. Detection accuracy is M t 3 10 -12 g/s (n-hexadecane). The isotope-labeled photocatalytic CO 2 reduction tests were performed by replacing 12 CO 2 with 13 CO 2 gas, while keeping the other reaction conditions unaltered.The obtained mixed gas was analyzed by gas chromatography-mass spectrometry (GC Model 6890 N/MS Model 5973, Agilent Technologies)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The atomically thin Bi 2 WO 6 with hydrophobic surface was synthesized with assistant of different content of CTAB.Meanwhile, the ultrathin and hydrophilic Bi 2 WO 6 was prepared with KBr assistant (BWO-K) and the bulk Bi 2 WO 6 (BWO) was synthesized for comparison.Transmission electron microscope (TEM) of BWO-C2 in Fig. 1a displays the 2D nanosheet-shaped structure of the Bi 2 WO 6 .And the high-resolution transmission electron microscopy (HRTEM) images show the marked spacing values of 0.315, 0.273, and 0.272 nm (inset of Fig. 1a andb), attributed to (113), (200), and (020) facets of Bi 2 WO 6 , respectively 24.And the corresponding FFT image in Fig. S3 further confirms the existence of ( 200) and (020) facets and the crystal structure of BWO-C2.The BWO-K prepared with KBr assistant also shows the shape of ultrathin nanosheet (Fig. 1c), while the BWO is the bulk structure with size of about 1 m (Fig. 1d).The EDX elemental mappings of BWO-C2 in Fig. 1e display that all the Bi, W and O elements are uniformly distributed, and the same results are observed in elemental mappings of BWO-K (Fig. S4). The atomic force microscopic (AFM) and the corresponding height histograms of the BWO-C2 and BWO-K are shown in Fig. 1f-g and Fig. S5, respectively.The results exhibit that the thicknesses of about 2.3 and 3.0 nm for BWO-C2 and BWO-K, respectively, indicating that the atomically thin Bi 2 WO 6 nanosheets are successfully synthesized with both the CTAB and KBr assistants.The thickness of Bi 2 WO 6 nanosheets vary with the amount of CTAB added, and the results are shown in Fig. S6.Reducing amount of CTAB (0.025 g) leads to the thickening of Bi 2 WO 6 nanosheet (Fig. S6a), tending to the formation of bulk.And the (113) facet of Bi 2 WO 6 is still found in BWO-C1(Fig.S6b).The thickness of about 7-9 nm for BWO-C1 is determined by AFM in Fig. S6c.The BWO-C1 displays thicker nanosheets than BWO-C2.Further increasing the amount of CTAB (0.08 g) also induces the thickening of Bi 2 WO 6 nanosheets, whose thickness has become about 6 nm, as show in Fig. S6d-e, which is also confirmed by AFM (Fig. S6f). The introduction of Br -ions induces the formation of atomically thin Bi 2 WO 6 .The bonding of Br to the surface of Bi 2 WO 6 results in the termination of dangling bonds and the surface negatively charged 25, which can suppress the formation of bulk.Therefore, the atomically thin Bi 2 WO 6 nanosheets can be obtained with KBr assistant, whose structural schematic is shown in Fig. S7.The Bi 2 WO 6 nanosheets prepared with large amount of KBr (0.25 mmol) assistant are displayed in Fig. S8, the more KBr in raw materials will induce the thicker Bi 2 WO 6 nanosheets.Hence, the excess Br-ions are not conducive to the formation of ultrathin nanosheets, whether using KBr or CTAB as Br source.When CTAB replaces KBr in preparation, the positively charged CTA ions will adsorb on the Bi 2 WO 6 surface by bonding with Br-ions (Fig. 1h).The positively charged CTA ions with long carbon chain result in extra surface repulsion, further preventing the Bi 2 WO 6 from stacking.Hence, the Bi 2 WO 6 nanosheets prepared with CTAB assistant are thinner than that with KBr assistant under the same concentration of Br -ions.Furthermore, the adsorbed CTA ions on surface expose the nonpolar long carbon chains 26, resulting in the hydrophobic surface of Bi 2 WO 6 , while the surface of Bi 2 WO 6 without the nonpolar groups with KBr is hydrophilic. The surface wettability of Bi 2 WO 6 nanosheets is examined by water contact angle test 27.As expected, both the BWO-K and BWO exhibit significant surface wettability (Fig. 1i-j), due to the hydrophilic surface of Bi 2 WO 6 .After modified by the CTAB, the nonpolar long carbon chains of CTA on the surface are exposed, creating a hydrophobic surface of Bi 2 WO 6 .A contact angle of 125of BWO-C2 in Fig. 1k suggests a hydrophobic surface.However, the hydrophobicity of Bi 2 WO 6 will be weakened when increasing or decreasing the amount of CTAB, as shown in Fig. S9.The contact angles of 56of BWO-C1 and 83of BWO-C3 indicate the poorer wettability.The excess CTAB crowding on surface of catalyst may tend to form the micelles, which will expose the hydrophilic parts and lead to the enhancement of hydrophile.Hence, further increasing the CTAB content will decrease the contact angle and increase the hydrophilic performance 28.These results confirm that the BWO-C2 nanosheet has the best hydrophobicity (125) and the thinnest thickness (2.3 nm) among all the samples. The structural characteristics and chemical compositions are further investigated by X-ray diffraction (XRD) patterns, Fourier transform infrared (FTIR) spectra and X-ray photoelectron spectra (XPS), as shown in Fig. 2. All the diffraction peaks in XRD patterns (Fig. 2a) can be similarly attributed to the orthorhombic-phase Bi 2 WO 6 (JCPDS No. 73-2020).The BWO-K shows no obvious changes in the XRD pattern compared with that of BWO, suggesting that the Br -ions have no influence on crystallinity of Bi 2 WO 6 .However, compared with BWO and BWO-K, the diffraction peaks intensities of BWO-K are weaker.Therefore, the existence of CTA ions will lead to the poorer crystallinity of Bi 2 WO 6 (Fig. S10).Further increasing the amounts of CTAB causes a poorer crystallinity of Bi 2 WO 6 .The large concentration of CTA ions crowding on surface is not conducive to the crystallinity of Bi 2 WO 6 nanosheets.FTIR spectra in Fig. S11 show that both the pure CTAB and BWO-C2 have the vibration peaks of alkyl chain and CH 3 -N moiety 29, while BWO and BWO-K have none (Fig. 2b).It indicates that the CTA ions are strongly adsorbed on the surface of the Bi 2 WO 6 samples prepared with CTAB.Furthermore, increasing the content of CTAB will enhance their adsorption quantity on surface of Bi 2 WO 6 , as shown in inset of Fig. 2b. X-ray photoelectron spectra (XPS) were used to reveal the electronic structure of photocatalyst.The Bi 4f XPS spectrum of BWO in Fig. 2c exhibits two peaks at 159.0 eV and 164.3 eV, which are attributed to Bi 3 4f 7/2 and 4f 5/2 , respectively.In addition, Fig. 2d shows the obvious double peaks of BWO deriving from W 6 4f 7/2 (35.1 eV) and 4f 5/2 (37.3 eV) states 30.Compared with BWO, the strong Br 3d peaks are observed in both the BWO-K and BWO-C2 samples, which suggest that the Br -ions are bound to the surface atoms of the Bi 2 WO 6 .The elemental mapping images in Fig. S12 further confirm the existence of Br element in BWO-K and BWO-C2, from the KBr and CTAB, respectively.It is noteworthy that the binding energies of Bi 4f 7/2 and W 4f 7/2 in BWO-K (158.7 and 34.9 eV) and BWO-C2 (158.4 and 34.6 eV) shift toward low binding energy compared with that of BWO, due to the introduction of Br -ions.The shifting to lower binding energy suggests the lower electropositive Bi and W in atomically thin Bi 2 WO 6 , caused by the high electron concentration of Br -ions adsorbing on the surface 31.These results confirm the formation of chemical bond between Br -ions and Bi 2 WO 6 .The XPS spectra of BWO-C2 exhibit the most negative Bi 4f and W 4f peaks, and the most positive Br 3d peak, indicating that the Br -ions from CTAB have a stronger effect on the electric charge distribution of Bi 2 WO 6 .These suggest a stronger chemical bond, which may influence the bandgap energy structure of the Bi 2 WO 6 nanosheets.Fig. S13 is the O 1s XPS spectra, two peaks at 529.4 eV and 530.6 eV of BWO-C2 are assigned respectively to lattice oxygen and hydroxyls.The peak intensity of hydroxyls of BWO-C2 is weaker than that of BWO and BWO-K, which is caused by the hydrophobic surface of BWO-C2.The surface compositions are determined by XPS, as shown in Table S1.The Br content of BWO-C2 (4.72 ) is higher than that of BWO-K (2.93 ), and the BWO-C2 exhibits the higher C content, which is from the absorbed CTA .Fig. S14a displays the ultraviolet-visible diffuse reflectance spectra (DRS) of the different Bi 2 WO 6 samples, whose band-edge absorptions are around 420 nm.The bandgap energies from the plots of (hv) 1/2 versus the energy of light are shown in Fig. S14b 32.The bandgap energy of the BWO is 3.15 eV, lower than that of the atomically thin Bi 2 WO 6 by 0.1 eV.The energy difference between the Fermi level and valence band is determined by valence band (VB) XPS spectra.Fig. S15a exhibits the apparent valence band values of 1.69, 1.78 and 1.56 eV for BWO, BWO-K and BWO-C2, respectively.The Fermi levels vs. NHE (NHE was -4.44 eV vs. vacuum level) of BWO, BWO-C2, and BWO-K are calculated to be 1.16, 0.36 and 0.56 eV, respectively (Fig. S15b-d).After calibration with reference Fermi level 33, actual valence band of BWO, BWO-K and BWO-C2 are 2.85, 2.34 and 1.92 eV, respectively.Hence, the band structures of those samples are described in Fig. S16.The more negative conduction band of BWO-C2 suggests a stronger CO 2 photoreduction ability. The photocatalytic CO 2 reduction activities of all photocatalysts were evaluated in H 2 O vapor under simulated solar irradiation.Fig. 3a shows that the remarkable enhancement in photocatalytic CO 2 reduction has been realized over the atomically thin Bi 2 WO 6 nanosheets with hydrophobic surface.The BWO-C2 displays the highest CO production rate of 7.12 mol g -1 h -1 in H 2 O vapor, which is about 18 times higher than that of bulk BWO (0.40 mol g -1 h -1 ).Both the BWO-C1 and BWO-C3 exhibit lower CO 2 reduction activities than that of BWO-C2, caused by the thicker nanosheets and poorer hydrophobicity.For comparison, the atomically thin BWO-K with hydrophilic surface shows a much lower activity with the CO production rate of 1.80 mol g -1 h -1 .The formation of CH 4 is not detected on BWO and BWO-K photocatalysts, while it is increased to 0.63 mol g -1 h -1 on BWO-C2, as shown in Fig. 3b.Although the potentials of all the Bi 2 WO 6 are thermodynamically feasible for reduction of CO 2 to CH 4 (-0.24 vs. NHE) 34, the CH 4 generation only occurs in Bi 2 WO 6 with hydrophobic surface.It is probably because that the CO intermediates desorb from the surface of hydrophilic Bi 2 WO 6 swiftly, leading to the termination of subsequent reaction steps 35.Furthermore, the main oxidation product of photocatalytic reaction is O 2 .The BWO-C2 exhibits the highest O 2 evolution rate of 4.60 mol g -1 h -1 .The stoichiometry balance between photogenerated electrons and holes (e-/h ) in photocatalytic reaction for BWO-C2, BWO-K and BWO are 1.05, 1.15 and 1.11, respectively, which are all close to 1 36.In this study, EPR was used to test oxygen vacancy.The EPR signals in Fig. S17 display that the concentrations of oxygen vacancies in BWO, BWO-K and BWO-C2 are similar.Although the thickness of BWO-C2 and BWO-K is thinner than that of BWO, they are prepared in mild conditions, which is not beneficial for the generation of vacancies.Moreover, without the additional processing, such as alkali etching or reduction, the Bi 2 WO 6 nanosheets will not display the high concentration of vacancies compared with the bulk Bi 2 WO 6 37,38.It can confirm that the enhancement of photocatalytic CO 2 reduction performance of BWO-C2 is owing to the ultrathin and hydrophobic structure, rather than oxygen vacancies. To further confirm the carbon source of reaction products, the 13 Clabeled isotopic trace experiment by substituting 12 CO 2 with 13 CO 2 was also carried out.As depicted in Fig. 3c, the peaks in GC spectra confirm the existence of 13 CO and 13 CH 4 generated from the 13 C-labeled isotopic, whose m/z values in mass spectrum signals are assigned to 29 and 17, respectively 39,40.Those results definitely demonstrate that the generated products are completely stemmed from photocatalytic CO 2 reduction.To evaluate the stability and reusable performance of photocatalyst, the circular reaction of five consecutive runs for BWO-C2 are shown in Fig. 3d.The evolution rates of CO and CH 4 are greatly maintained even after five cycles of CO 2 photoreduction, suggesting an excellent stability and reusability of atomically thin and hydrophobic Bi 2 WO 6 nanosheets.When extending the reaction time to 40 h, the main product is still the CO and the Bi 2 WO 6 nanosheets maintain the high photocatalytic CO 2 reduction performance (Fig. S18).Moreover, unchanged XPS spectra of BWO-C2 before and after cycling tests are shown in Fig. S19.Particularly, the strong Br 3d peak of used BWO-C2 indicates the existence of surface-adsorbed Br.The FTIR spectrum in Fig. S20a further demonstrates that the CTAB still absorb on the surface of Bi 2 WO 6 after photocatalytic CO 2 reduction.Meanwhile, no significant structural changes are observed in TEM images after a long illumination (Fig. S20b-c).In order to analyze the degradation and reforming reaction of surface adsorbed organic matter during photocatalysis 414243, the element compositions of BWO-C2 after cycling test are preformed, as shown in Table S1.The surface compositions exhibit that no significant changes of Br and C content for BWO-C2 are observed in XPS data after a long illumination.Furthermore, the BWO-C2 retains the hydrophobic surface after the circular reaction, as shown in Fig. S20d.A contact angle of 122of BWO-C2 suggests the stability of CTAB-modified surface during the photocatalytic CO 2 reduction.The photocatalyst surface repulsion caused by positively charged CTA ions with long carbon chain can prevent the agglomeration of nanosheets, improving the stability and reusability of photocatalyst.The BWO-C2 was washed by ethyl acetate and dilute sulfuric acid solution to remove the CTA ions.The XPS spectra indicate that the CTA ions are removed, while the Br -are still absorbed on photocatalyst, as shown in Fig. S21a-b.The photocatalytic CO 2 reduction rate of BWO-C2 distinctly decreases after washing (Fig. S21c).It is because that the removal of CTA results in the change of hydrophobic surface, which further confirms the important role of hydrophobic surface in photocatalytic CO 2 reduction.We have also conducted a 5 h-long photocatalytic experiment on BWO-C2 with N 2 and water vapor only in accordance with the reported conclusive procedure 44.The results are shown in Fig. 3a, no CH 4 , or CO were detected during the illumination, which further confirms that the generated products are completely stemmed from photocatalytic CO 2 reduction and CTAB-modified surface is stable.Conversely, the hydrophilic surface is more beneficial for the absorbance of polar H 2 O rather than nonpolar CO 2 molecules, leading to the slow supply of CO 2 molecules for CO 2 reduction. The migration and separation process of photogenerated charge carriers of atomically thin and bulk Bi 2 WO 6 are investigated by the time-resolved photoluminescence (TRPL) decay spectra (Fig. 4a).The BWO-C2 and BWO-K with the same atomically thin structure exhibit the shower decay kinetics than that of bulk Bi 2 WO 6 , whose decay lifetimes are 2.40, 2.35 and 1.81 ns, respectively 45,46.The prolonged lifetime suggests a higher charge separation efficiency of the atomically thin Bi 2 WO 6 nanosheet, due to the rapid and short-distance migration of charge carriers from interior to surface, compared with the bulk materials 15.The decay lifetimes of BWO-C1 and BWO-C3 are 2. adsorption is considered as the prerequisite for CO 2 photoreduction, herein, the different CO 2 -capture abilities are investigated by the CO 2 adsorption isotherms at 297 K 20,47.As shown in Fig. 4b, the BWO-C2 displays a higher CO 2 adsorption amount than that of BWO and BWO-K.However, the BET specific surface areas from nitrogen adsorption-desorption experiments (Fig. S23) of BWO-K, BWO-C2 and BWO are calculated to be 54.58,46.81 and 16.86 m 2 g -1 , respectively.The higher CO 2 adsorption of BWO-C2 compared with BWO may be owing to the larger surface-to-volume ratio.However, compared with BWO-K, the BWO-C2 nanosheets exhibit the smaller surface-to-volume ratio but the larger CO 2 adsorption, which is due to the nonpolar structure of BWO-C2.Compared with BWO-C2 and BWO-K, the BWO-C1 and BWO-C3 show the lower CO 2 adsorption, as shown in Fig. S24, due to the thicker nanosheets and smaller surface-to-volume ratio of BWO-C1 and BWO-C3.Furthermore, the long carbon chain may form the steric hindrance on the surface.The proper concentration of CTAB is favorable for the absorption on CO 2 molecules.Further increasing the content of CTAB on the catalyst surface will result in the steric hindrance of CO 2 absorption.Therefore, the BWO-C3 with high content of CTAB shows the lower CO 2 absorption compared with BWO-C2. Moreover, the photocatalytic mechanisms including adsorption concentration and activation process of CO 2 on BWO-C2, BWO-K and BWO are further investigated by the in-suit diffuse reflectance infrared Fourier transform spectra (DRIFTS).The characterization was performed on a sealed chamber under illumination, simulating the real CO 2 photoreduction reaction in H 2 O vapor.As shown in Fig. 4c-d and Fig. S25, for the atomically thin Bi 2 WO 6 with hydrophobic surface, the distinct peaks at 1706 and 1231 cm -1 can be ascribed to surface bicarbonate HCO 3 -species 48.The formation of bidentate carbonates (b-CO 3 2-at 1483 and 1270 cm -1 ) and monodentate carbonate (m-CO 3 2-at 1448, 1402 and 1357 cm -1 ) are also detected in this photocatalytic process 49,50.Importantly, the formation of CO 2signifies the activation of CO 2 by the way of CO 2 e- CO 2 - 51,52, due to the facile transfer of photogenerated electron to the adsorbed CO 2 on hydrophobic surface.Hence, the photocatalytic CO 2 reduction can be significantly enhanced due to those important intermediate states of HCO 3 -, CO 3 , and CO 2 -species.In comparison, the signal changes of carbonate and bicarbonate species during reaction processes in the spectra for BWO-K (Fig. S25) and BWO are much weaker, indicating a poor ability of CO 2 conversion under illumination of BWO-K and BWO.The intensities of H 2 O reversal peaks at 1648 cm -1 increase during the reaction, indicating the decrement of absorbed H 2 O.It is possibly because of the desorption of absorbed H 2 O, which are weakly bonded on the surface of the catalyst.However, the absorbed HCO 3 -, CO 3 2-, and CO 2 -species increase over time.Those suggest that the nonpolar surface is more propitious to the adsorption of carbonate and bicarbonate species.This reversal peak is also observed in H 2 O vapor without CO 2 gas under illumination (Fig. S26).As a new feature, linearly adsorbed CO at 2035 cm -1 appears on hydrophobic surface of Bi 2 WO 6 53, and the absorbance of CO is critical to the next reaction step for CH 4 generation. Based on the above-discussed results, a possible photocatalytic reaction pathway and the corresponding mechanism over atomically thin Bi 2 WO 6 nanosheet with hydrophobic surface can be illustrated, as shown in Fig. 4e.After modified by CTAB, the exposure of nonpolar long carbon chains on the surface leads to a hydrophobic surface, contributing to the absorbance of CO 2 while restraining the absorbance of H 2 O.The photogenerated electrons from the Bi 2 WO 6 for reduction reaction will be captured rapidly by CO 2 rather than H 2 O, yielding the CO 2 -anions, due to the high concentration of CO 2 on the hydrophobic surface.The crucial surface carbon anions HCO 3 -and CO 3 2-are subsequently generated and combine with H and e -into CO.Furthermore, the atomically thin nanosheets with shorter carrier's diffusion distance are favorable for separation of electron-hole pairs.The photogenerated holes for oxidation reaction will be captured by H 2 O to yield the hydroxyl radicals ( OH) and the H 54.The H 2 O will be further oxidized into O 2 by OH radicals and holes.Therefore, the efficiency of photocatalytic CO 2 reduction can be significantly enhanced by this atomically thin and hydrophobic structure."
  },
  {
    "title": "Conclusions",
    "content": "In summary, atomically thin Bi 2 WO 6 nanosheets with hydrophobic surface have been fabricated via a one-step hydrothermal method for photocatalytic CO 2 reduction.The atomically thin nanosheet improves the charge separation in Bi 2 WO 6 due to the short diffusion distance from interior to surface.The hydrophobic surface caused by nonpolar long carbon chains of CTAB enhances CO 2 adsorption onto the nonpolar surface, leading to the high concentration of CO 2 on surface for CO 2 photoreduction.Furthermore, the CO adsorption on the hydrophobic surface is favorable for the photo-methanation reaction to form CH 4 .Therefore, the atomically thin Bi 2 WO 6 nanosheets with hydrophobic surface display a high-efficiency photocatalytic CO 2 reduction in H 2 O vapor.This study provides an appealing method for the design of highly efficient photocatalyst for solar energy conversion. Fig. 1. (a, b) TEM and HR-TEM images of BWO-C2, TEM images (c) BWO-K and (d) BWO, (e) STEM and the corresponding elemental mapping images of BWO-C2, (f) AFM image and (g) the corresponding topography line scan of height profile of the BWO-C2, (h) schematic illustration of ultrathin and hydrophobic Bi 2 WO 6 nanosheets with CTAB assistant, water contact angle tests of (i) BWO-K, (j) BWO, and (k) BWO-C2. Fig. 3e illustrates the distribution of H 2 O and CO 2 molecules on Fig. 2. (a) XRD patterns, (b) FTIR spectra, and XPS spectra: (c) Bi 4f, (d) W 4f, (e) Br 3d of BWO, BWO-K and BWO-C2. 16 and 2.25 ns, respectively, as shown in Fig. S22.The shorter lifetimes of BWO-C1 and BWO-C3 are caused by the thicker nanosheet, which can affect the recombination rate of photogenerated carriers.The CO 2 Fig. 3. (a) Production rates of photocatalytic CO 2 reduction after irradiation for 5 h, (b) analysis of photocatalytic products, (c) GC-MS results of 13 CO and 13 CH 4 products generated from the 13 CO 2 isotope experiments, (d) production generation for five consecutive runs lasting for 25 h, and (e) schematic illustration of distribution of H 2 O and CO 2 molecules on hydrophobic and hydrophilic surface of Bi 2 WO 6 . Fig. 4. (a) TRPL spectra, (b) CO 2 adsorption isotherms at 298 K, in situ DRIFTS for the adsorption and activation of CO 2 under illumination: (c) BWO-C2 and (d) BWO, (e) possible mechanism for photoreaction of CO 2 and H 2 O on atomically thin Bi 2 WO 6 nanosheet with hydrophobic surface. Conceptualization, Investigation, Validation, Writing -original draft.Dongyan Shen: Investigation, Validation.Qiao Zhang: Methodology.Yuan Lin: Investigation.Feng Peng: Methodology, Supervision, Funding acquisition, Writing -review editing. We acknowledge the financial support from the National Natural Science Foundation of China (No. 21673080). The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary material related to this article can be found, in the online version, at doi:https://doi.org/10.1016/j.apcatb.2020.119630."
  }
]