[
  {
    "title": "Doi",
    "content": "10.1016/j.supflu.2020.104876"
  },
  {
    "title": "Article_Title",
    "content": "CO2 photocatalytic reduction with CNT/TiO2 based nanocomposites prepared by high-pressure technology"
  },
  {
    "title": "Abstract",
    "content": "h i g h l i g h t s CNT/TiO 2 synthesized with supercritical fluids exhibit unique physicochemical properties. These properties are intimately related to the photocatalytic activity of CNT/TiO 2 . CNT/TiO 2 with enhanced visible light absorption lead to higher CO and CH 4 production rates. These production rates are higher than those of TiO 2 particles and nanofibers synthesized with SCFs."
  },
  {
    "title": "Experimental",
    "content": "Titanium tetraisopropoxide (TTIP, pure), copper (II) acetylacetonate (Cu(acac) 2 , 99.99 metal basis) and multi-walled carbon nanotubes (MWCNT, purity 98) were provided by Sigma Aldrich.Ethanol (analytical reagent) was supplied by Scharlab.CO 2 (puri-ties99.9 for synthesis and 99.998 for photocatalytic studies) was used as received from Contse.Degussa P-25 (Evonik) TiO 2 powder was used for synthesizing one of the catalysts and as reference material for the characterization of synthesized catalysts. Various samples of TiO 2 powders were synthesized by thermal hydrolysis using TTIP as precursor and ethanol as hydrolysis agent.In addition, some samples were doped with Cu(II) using Cu(acac) 2 as precursor.These samples were supported on carbon nanotubes.In all the procedures, supercritical CO 2 was used as reaction medium. The synthesis of photocatalysts was performed in an ad hoc designed experimental set-up (Fig. 1).The heart of the installation is a stainless-steel high-pressure reactor (DEMEDE Engineering Research, 100 ml) preceded by a high-pressure pump (Thar SFC, Pseries) for the compression of CO 2 and a thermostatic bath (Selecta, Frigiterm-30).After reactor there is a filter. In this work, two types of synthesis (one-step and two-step syntheses) have been compared in order to study the influence of procedure on catalysts properties. The synthesis is relatively simple.First, titanium precursor, alcohol, carbon nanotubes, and copper precursor (if necessary) are added to the reactor.The masses of TTIP and CNT change depending on CNT/TiO 2 proportion.The molar ratio of ethanol was always 28 mmol/mmol titanium precursor, equivalent to 8 mol ethanol in CO 2 22.Then, the installation was sealed, and CO 2 introduced into the reactor after being cooled in the thermostatic bath.Afterwards, the magnetic stirring was turned on, the reactor warmed up with an electric resistance, and pressure increased until values required for the synthesis (300 C and 200 bar) 9,22.After 2 h, the electric resistance was turned off.When the temperature of reactor was appropriate the system was depressurized.After the synthesis process, solids obtained were removed from the reactor and dried at 105 C for 24 h.Then, they were calcined at 400 C for 3 h to remove the remaining structural solvent 9 and to transform most TiO 2 into anatase 23.The limit in the calcination temperature was given by the transition from anatase to rutile phases, together with the combustion of CNTs, both phenomena taking place at about 550 C 4,15,24.Thus, several references report that materials calcined with air at 400 C for 2 h do not exhibit appreciable degradation of CNT 15,25. The first step is the hydrothermal synthesis of TiO 2 and TiO 2 /Cu nanoparticles.It is carried out under the same conditions that onestep synthesis but in the absence of CNT 22. In the second step, the previously synthesized nanoparticles were supported onto CNT.For this, the TiO 2 and TiO 2 /Cu nanoparticles were introduced into the reactor together with CNT, being the total mass of mixture 200 mg for all CNT/TiO 2 weight ratios tested (0.25, 1 and 4).In this case, operating conditions were 60 C and 100 bar for 2 h, with magnetic stirring 26.The solid product was dried at 105 C for 24 h and calcined at 400 C for 3 h.CNT 50 /P25 50 also was synthesized in these conditions.In this case scCO 2 is used as a replacement of a flammable and toxic liquid solvent in wet stirring process for nanopowder mixing, helping to deagglomerate TiO 2 particles and CNT and distributing nanoparticles more evenly on the nanotubes 26. Table 1 lists all synthesized catalysts with the corresponding codes used to identify them from now on. All the synthesized photocatalysts and commercial catalyst were characterized with different analytical techniques.An Xray powder diffractometer (XRD, Philips X'Pert MPD) was used to determine crystallinity and crystalline phase of the catalysts.Crystallite size was calculated from the Scherrer equation using the X-ray diffraction peak at 2A 25.4 .A scanning electron microscope (SEM, Jeol 6490LV) and a transmission electron microscope (TEM, Jeol 2100) were used to obtain information about the morphology of the catalysts.A diffuse reflectance (DR) UV-vis spectrophotometer (Jasco, V650) was employed to obtain absorbance thresholds and band gap energies.The specific surface area of the powders was measured using a Brunauer-Emmett-Teller (BET) area analyser (Quantachrome Nova Touch LX2).The percentage of Cu was measured with inductively coupled plasma atomic emission spec- troscopy (ICP-AES) using an ICP-AES (Varian, Liberty Sequential). The detection limit of ICP spectrometer is 20 ppb Cu.The X-ray photoelectron spectroscopy measurement (XPS) was made in an ultrahigh vacuum Specs Phoibos-150 electron spectrometer.The spectra were obtained with a photon energy of 1486.6 eV (Al anode).All the binding energies were referenced to the C1s peak at 284.5 eV of the surface adventitious carbon. The catalyst activity in photocatalytic CO 2 reduction is evaluated with an ad hoc designed experimental set-up (Fig. 2).It consists of a stainless-steel reactor (50 ml) with an O-ring sealed quartz window for admitting radiation from a Xe arc lamp (Oriel, 450 W) with an Air Mass 1.5 Global filter to simulate the solar irradiation.Before the reaction chamber there is a valve for gas introduction and a bubbler with deionized H 2 O to provide the necessary relative humidity.Pressure, temperature and humidity measurements are carried out with appropriate instruments connected to the reactor.After it there is a valve for evacuation and other valve connected to a gas chromatography system (Agilent 490 Micro GC, with micro thermal conductivity detector, TCD).This equipment supplies qualitative and quantitative data of the reduction products obtained. The photocatalytic experiment consists of two stages 9: (a) Preparation of the filter: 50 mg of catalyst are dispersed in 1 l of deionized water, next the solution is passed through a filter (diameter 0.47 mm, pore size 0.45 m) and dried at 180 C for 30 min.(b) Photocatalysis: The filter is placed on a stainless-steel grid into the reactor.Then, the reactor chamber is filled with a mixture of water vapor and carbon dioxide (H 2 O/CO 2 wt. ratio of 2/7).When the operating conditions are reached (1.12 bar, 32 C, and a relative humidity of 73 ), the lamp is turned on.After 3 h reaction the products are determined with the gas chromatograph."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Synthesis yields have been estimated as the ratio between the actual mass of catalyst synthesized and the theoretical mass of catalyst that should be obtained considering the masses of reactants added into the reactor during the synthesis 9. In the case of one-step synthesis, yields ranged from 40 to 60, regardless the composite synthesis process refers to undoped or Cu doped catalysts. On the other hand, higher yields were attained in the two-step procedure, both in hydrothermal and supporting steps.In the case of the hydrothermal synthesis (first step), the yields were similar to those reported in previous works for TiO 2 nanoparticles, in the range 60 10 7,9.Regarding the supporting stage (second step), deposition yields were considerably larger, between 80 and 90 in all cases.According to these results, the global yields of the two-step synthesis were in the range 40-63. To sum up, from the synthesis yield viewpoint, to perform the two-step synthesis procedure (hydrothermal synthesis of undoped or Cu-doped TiO 2 nanoparticles followed by their deposition onto CNTs at lower temperature and pressure) in order to reach only slightly higher yields than with the one-step method is not attractive enough to leave aside the advantages related to the operational simplicity of the single stage process. The actual percentage of metal in the doped catalysts was determined by inductively coupled plasma atomic emission spectroscopy (ICP-AES).The results obtained (Table 2) confirmed the coincidence between the theoretical and actual percentages of Cu in CNT/TiO 2 /Cu composites synthesized in supercritical medium.In other words, all Cu coming from Cu precursor is present in composite copper-doped catalysts, for both one-step and two-step syntheses.The same occurred with copper-doped nanoparticles and nanofibers synthesized in supercritical medium with similar copper loadings 7,8. According to XPS analysis (presented as supplementary material in Fig. S1), the sample contains Ti, O, C and Cu elements, with sharp photoelectron peaks appearing at binding energies of 458.6 and 464 eV (Ti2p), 530 eV (O1s), 284.9 eV (C1s) and 933 eV (Cu2p).The first three correspond to TiO 2 6,27. Regarding the chemical states of copper (Fig. S1c), the peaks at 933 and 964.9 eV belong to 2p 3/2 and 2p 1/2 Cu 2 in CuO, respectively.The broad satellite peaks of weak intensity at 942.5 and 961.6 eV are also characteristic of Cu 2 species 28.There is not any peak belonging to other Cu species; therefore, all Cu in our composite is only in Cu 2 form 7. The XPS spectrum also shows the symmetric C1s peak at 284.9 eV for C C bonds in CNT (Figure S1d) 27.The oxygen functionalities attached to the carbons show deconvoluted peaks for C O C (288.2 eV) and O C O (290.8 eV) at higher binding energies.Such surface functional groups provide active sites for directed deposition of anatase nanocrystals around the surface of MWCNTs.For example, the -OH groups on the Ti precursor possibly react with the -OH and -COOH groups on the MWCNTs surface through esterification to form C-O-Ti or O C-O-Ti bonds 27. One of the main factors affecting CO 2 adsorption and its further reduction on the photocatalyst active sites is the surface area of the composite.This fundamental property of heterogeneous catalysts is usually measured by nitrogen adsorption using the BET method. The N 2 adsorption-desorption isotherms for CNT/TiO 2 composites synthesized in this work have been ascribed to type IV of the IUPAC classification, confirming that the mesoporous structure of CNTs is preserved after the introduction of TiO 2 25,29.As example, the CNT 50 /TiO 2 50 isotherm is shown in Fig. S2.The surface areas of catalysts synthesized in this work were in the range 150-155 m 2 g -1 (Table 2) but the one corresponding to composite CNT 50 /P25 50 was 216 m 2 g -1 , a value 4 times that of P25 (50 m 2 g -1 ) 9.In fact, the surface area of this photocatalyst matches with that of bare CNT (216 m 2 g -1 ), probably due to a good dispersion of P25 on CNTs outer wall 29. In the cases of photocatalysts synthesized at supercritical conditions (TiO 2 and composites consisting of undoped or Cu-doped TiO 2 nanoparticles and CNTs) surface areas were about 3 times higher than those of P25 nanoparticles.This reduction in surface area compared to that of bare CNT suggests the existence of a partial blockage of CNTs inner surface 30.Similar surface areas of 106-163 m 2 g -1 have been reported in the literature for CNT/TiO 2 composite catalysts synthesized by the sol-gel method 29,31. According to results just commented, no effect of metal doping on this catalyst property was observed, as it happened when metaldoping TiO 2 nanoparticles at supercritical conditions 7,9. In relation to the two-step synthesis, the surface area values attained were similar to those of the one-step synthesis, also in the range 150-155 m 2 g -1 . It is well known that catalysts with higher surface area usually lead to increased photocatalytic activity 32.However, surface area is not the only factor affecting the photocatalytic activity 13, so care should be taken before stating that CNT 50 /P25 50 will exhibit the best photocatalytic performance of all the composites synthesized in this work. Considering that the photocatalytic activity of catalysts strongly depends on its morphological structure 11, SEM images of synthesized catalysts were taken.Some of them are shown in Fig. 3.It can be observed that the particles on the catalysts surface show polyhedral morphology, even though metal nanoparticles and carbon nanotubes cannot be distinguished with this technique.The morphology is similar for both CNT/TiO 2 catalysts, regardless they were composed by P25 (Fig. 3a) or TiO 2 nanoparticles synthesized at supercritical conditions (Fig. 3b).Furthermore, it should be noted that the presence of small amounts of metal in the composite do not change the surface morphology (Fig. 3c andd) 33. TEM images of the catalysts are shown in Fig. 4. As in SEM micrographs, it can be appreciated that TiO 2 nanoparticles morphology is polyhedral and heterogenous.On the other hand, as in earlier TEM studies 29, weaved and interconnected networks of CNTs made of tubes held together into bundles by van der Waals forces and how the TiO 2 particles are dispersed onto them can also be observed in images of Fig. 4. Specifically, Fig. 4a illustrates that the TiO 2 nanoparticles (shown in gray color) are distributed outside the CNTs in the case of P25, but outside and inside CNTs if the composite is formed by TiO 2 nanoparticles synthesized in supercritical medium (Fig. 4b). Further, it can be observed that the TiO 2 particles are only partially agglomerated on CNTs.According to the literature 34, the presence of CNTs embedding in the composite catalyst matrix prevents TiO 2 particle agglomeration, resulting in homogeneous coverage of TiO 2 over the CNTs.Then, considering that TiO 2 nanoparticles tend to agglomerate in the absence of CNTs 34, TEM images suggest that the CNTs act as a \"dispersing agent or support\" that controls TiO 2 morphology in the composite. Regarding the effect of the composite CNT/TiO 2 ratio on TiO 2 particle morphology, at large ratios (Fig. 4c) well-defined polyhedral multigrain non-agglomerated TiO 2 nanoparticles with regular shape and size (about 10 nm) were formed 29,34.However, the formation of irregular or semi-polyhedral TiO 2 particles was observed with increasing amount of TiO 2 in the composite (Figs.4d ande), probably due to the growth of inter-connected TiO 2 nanoparticles on the surface via Van der Waals interactions.Moreover, at these conditions the dispersion of TiO 2 particles was decreased, the number of available active catalytic sites reduced and the surface of the CNTs difficult to observe 29.Obviously, this could lead to a decrease in the photocatalytic activity of the composite. In the case of photocatalysts doped with metal, the images show that metal particles (shown in black color) are distributed on both TiO 2 nanoparticles (grey color) and CNTs (Figs. 4b and4f).Regarding the size distribution of metal nanoparticles in Cu-doped photocatalysts, Fig. 5 shows that the mean size of Cu particles is 2.1 nm, for 1 loading ratio, and 2.8 nm, for 2, i.e., the Cu-particle size increases as Cu loading does (Table 2).The size distribution of Cu nanoparticles has been calculated from the analysis of around 150 particles in 10 different regions of the TEM micrographs (not shown).Moreover, the size distribution is more homogeneous for the 1 loading ratio.Thus, at 1, about 50 of particles are in the range 1.5-2 nm while, at 2, the size of most particles is between 1.5-4.5 nm.In brief, at large metal loadings the size distribution of Cu particles becomes more heterogeneous. Related to the effect on composite morphology of the stages number of the synthesis method, no significant differences were observed when TEM images of one-step procedure and two-step method were compared (Figure S3 compares CNT 49 /TiO 2 49 /Cu 2 synthesized in one and two steps). Finally, from TEM images of Fig. 4 it is possible to confirm that at the calcination temperature used (400 C) the synthesized particles are well defined and the CNTs are not removed from the composite.In fact, they are similar to those obtained before calcination (see Fig. S4 for CNT 50 /TiO 2 50 as example). It should be noted that, studying similar catalysts, some authors 35 had set the limit of calcination at 500 C since in TEM images they observed that at 500 C the carbon nanotubes begin to disappear while at 300-400 C they were still present.In addition, while particles were shown in compact aggregates after treatment at 300 C, they were well defined at 400 C 35. It is well known that P25 absorbance in the visible range is minimal so, if desired that catalysts are effective in the solar spectrum, it is important to increase its absorbance in the visible range.As above-mentioned, this is one of the main goals of this work. The UV-vis DRS spectra of different synthesized catalysts are displayed in Fig. 6.All samples show the typical absorption curve with an intense transition in the UV region of the spectrum, which is due to electron promotion of TiO 2 from VB to CB 11.The pure TiO 2 displays a sharp increase in absorption below 350 nm due to the O2p Ti3d electron transition attributed to the intrinsic absorption of the TiO 2 energy band gap 29.It has low absorption in the visible region (400-700 nm), which is characteristic of TiO 2 . Fig. 6 shows that the TiO 2 synthesized at supercritical medium has a slightly higher absorbance than P25 in the visible range 6.In addition, when TiO 2 nanoparticles are supported onto carbon nanotubes, the absorbance in visible range abruptly improves in both cases (synthesized TiO 2 and P25).The same is reported in literature 31.The presence of CNTs leads to a continuous absorption band in the range 420-800 nm, in agreement with the black color of samples 11.The presence of Ti-O-C bonds extends the light absorption to longer wavelengths, leading to the improvement of the photocatalytic activity 4. Wang et al. 34 and Dong et al. ( 2016) 36 report that a positive correlation exists between CNT content and the changes in UV-vis absorption properties, which may be due to an increment of surface electric charge of TiO 2 and subsequent modifications of electron/hole pair formation process resulting from the introduction of CNT.Nevertheless, an excessive amount of CNT shields the UV light for the absorption of TiO 2 .For this reason, controlling the composition ratio in CNT/TiO 2 composites is crucial to obtain an optimal synergistic effect between CNT and TiO 2 11.According to Fig. 6, even at 80 wt. CNT (composite CNT 80 /TiO 2 20 ) the absorbance in visible range is 8 times higher than that of P25. Copper doping (0.5-5 wt.) does not improve the absorbance in visible range in comparison to undoped composite catalyst (Fig. 6).Moreover, in the metal range analysed, the percentage of Cu in the synthesized composite has almost no influence on the absorbance in the visible range 33.Both facts were already observed by Liu et al. 37, who reported no enhancement (or even loss) of visible light absorbance for MWCNT/TiO 2 /Cu with Cu concentration 10, but improved absorbance at higher Cu dosage (10-15 ), probably due to the excitation of Cu species (Cu clusters absorbance in 400-500 nm and Cu 2 absorbance in 600-800 nm), in accordance with XPS results. In the case of doped catalysts, Fig. 6 shows differences in absorbance between one-step and two-step catalysts.As an example, two-step Cu-doped catalyst CNT 49 /TiO 2 49 /Cu 2 2 steps shows higher absorbance in the visible range than one-step Cu-doped catalyst CNT 49 /TiO 2 49 /Cu 2 .The main difference lies in that metal nanoparticles are present on both TiO 2 nanoparticles and CNTs in the case of one-step catalyst (CNT 49 /TiO 2 49 /Cu 2 ), whereas in the two-step catalyst CNT 49 /TiO 2 49 /Cu 2 2 steps metal nanoparticles are only on TiO 2 nanoparticles.This could imply differences in composite photocatalyst absorbance 37. From UV-vis DRS spectra the catalyst absorption threshold can be estimated as the intersection of the x-axis with the line tangent to the absorption curve where the slope is at a maximum 38, as shown for P25 in Supplementary Material (Fig. S5).From these data, it is possible to calculate the band gap energies of catalysts using equation E g hc/ , where h is Planck's constant ((4.135667662 0.00000008) 10 -15 eV s) 39, c the light speed (299,792,458 m s -1 ) and the absorption threshold (nm). Table 2 shows the absorption threshold of P25 and synthesized catalysts.It can be seen that absorption thresholds of undoped catalysts increase when TiO 2 -supercritical nanoparticles and P25 are supported onto carbon nanotubes (from 400-405 to 440-530 nm).This increase is higher for nanoparticles synthesized with supercritical fluids.On the other hand, doped catalysts have similar thresholds regardless of copper percentage (410-440 nm).Finally, the Cu-doped catalysts synthesized in two steps present similar or higher absorption threshold than their counterparts synthesized in one step. From these values of the absorption thresholds the band gap energies are calculated (Table 2).Significantly, the composite band gap energies decrease when the TiO 2 nanoparticles are supported onto CNTs (from 3.06 for P25 to 2.82 eV when P25 is in the composite CNT 50 /P25 50 and from 3.1 for pure TiO 2 synthesized in supercritical medium to 2.34 eV when this TiO 2 is in the composite CNT 50 /TiO 2 50 ).These values are close to those reported by Abega et al. 29 and result from the close contact between the TiO 2 and carbon phases, which is improved by the formation of Ti-C and Ti-O-C bonds.The introduction of CNTs increases the electric surface charge of the composite and modifies the formation path of the electron-hole pair throughout the visible light irradiation.Furthermore, a direct interface between TiO 2 and CNTs can introduce a new energy level inside the band gap of TiO 2 and thereby facilitate the electron transfer to CNTs under photoexcitation 29.When the CNT/TiO 2 ratio differs from 1 the shape of absorbance curve changes (Fig. 6), the absorbance in the visible range is maximum, and absorption threshold cannot be graphically calculated except for CNT 20 /TiO 2 80 2 steps .If the catalyst CNT 50 /TiO 2 50 is doped with copper (0.5-5 wt.) the band gap energies are smaller than those corresponding to P25 and TiO 2 , but higher than that of CNT 50 /TiO 2 50 .These results agree with the absorbance curves shown previously (Fig. 6) and bibliography 37.Further, according to DRS spectra and absorp- tion thresholds, two-step catalysts present similar or lower band gap energy than those synthesized in one step, as shown in Fig. 6 and Table 2 for the composites CNT 49 /TiO 2 49 /Cu 2 and CNT 49 /TiO 2 49 /Cu 2 2 steps .All in all, DRS spectra of CNT/TiO 2 composites show a notable absorption along the visible light region, implying a narrowing of the band gap produced by the introduction of CNTs due to the enhanced interfacial chemical interaction.This is related to reduced radiative recombination of photoinduced electrons trapped on the TiO 2 particle surface and means that efficient charge transfer to the nanotubes has occurred 29.Best photocatalyst regarding absorbance in visible range would be CNT 50 /TiO 2 50 . XRD diffractograms (Fig. 7) show that P25 and P25 based composites have two crystal phases, anatase and rutile, as it could be expected.However, for CNT/TiO 2 composites in which TiO 2 particles were synthesized at supercritical conditions, the patterns of CNT/TiO 2 composites show peaks around 25.4 , 37.8 , 48.1 , 53.9 , 55.1 and 62.8 , which match with pure anatase TiO 2 29.In addition, typical peaks of CNT at 26.2 and 44.3 disappear.This could be attributed to that homogeneous coverage of TiO 2 on CNTs could lead to the shielding of the CNT peaks by those of TiO 2 11,29,34. Regarding the XRD patterns of CNT/TiO 2 /Cu composites (Fig. S6 in Supplementary Material), they do not show any peak related to copper.It may be due to the small percentage of Cu and its high dispersion over TiO 2 33,40. In relation to crystallinity, when P25 and supercritical TiO 2 particles are supported onto CNTs, the crystallinity of composites is similar.This crystallinity is also kept constant when the catalysts are doped with Cu (Figs. 7 andS6).However, when the catalysts are synthesized in two steps the crystallinity clearly decreases (Fig. S7 in Supplementary Material).Somehow, the low crystallinity of CNT 80 / TiO 2 20 2 steps could be imputed to the large CNT proportion in the catalyst 30,34.However, it can be perceived that crystallinity does not improve even decreasing CNT concentration.This decrease in crystallinity for the synthesis in two stages, compared to the one-step synthesis, could be derived from the different calcination times of each synthesis process (3 3 h in two-step synthesis vs. 3 h in one-step synthesis).In fact, some authors report a partial collapse of TiO 2 structure when calcination time is prolonged 41. The crystallite sizes of TiO 2 can be calculated from the composite XRD diffractograms by using the Scherrer equation 6.The values obtained are displayed in Table 2.It can be appreciated that commercial TiO 2 (P25) has a crystallite size of 20 nm while synthesized catalysts have lower crystallite sizes.On the other hand, no difference between undoped and metal doped catalysts has been observed regarding this variable.It should be noted that the crystallite sizes of CNT/TiO 2 composites synthesized in supercritical medium are larger (14-18 nm) than those obtained by traditional methods (8-14 nm) 27,30,34. Finally, catalysts synthesized in two stages have smaller sizes (8-12 nm) than one-step catalysts due to the abovementioned collapse of TiO 2 structure with prolonged calcination time 41.In particular, the smallest crystallite size was found for CNT 80 /TiO 2 20 2 steps composite, probably because the high proportion of CNT hinders particle growth 30,34.Therefore, in a first approximation it could be said that, from the viewpoint of crystallite size, this catalyst should be the one showing greater catalytic activity. Finally, synthesized nanocomposites are used in CO 2 photocatalytic reduction experiments with water vapor in the presence of a xenon lamp that simulates sunlight.Carbon monoxide and methane were the only reduction products obtained.It should be noted that CO is an important intermediate in several reactions and CH 4 is the most reduced product from CO 2 9,42.In Fig. 8 their production rates are displayed. Fig. 8 shows that production rates obtained with TiO 2 nanoparticles synthesized at supercritical CO 2 medium (first pair of columns) slightly improved results obtained with P25 (2 mol CO/g -1 h -1 and 0.075 mol CH 4 /g -1 h -1 ), being the upturn more significative for CH 4 than for CO. Fig. 8 also shows that when TiO 2 nanoparticles are supported onto carbon nanotubes at the CNT/TiO 2 weight ratio equal to 1 (second pair of columns), the production rates increase about 4 and 15 times, respectively, for CO for CH 4 (in relation to those of P25).These results are better than those reported in a previous work for other TiO 2 based photocatalysts (TiO 2 nanofibers) also synthesized at supercritical conditions.Specifically, the best production rates observed were about 2 and 8 times those of P25 for CO and CH 4 , respectively 8.Moreover, they are even better than those reported in literature for CNT/TiO 2 composites synthesized by classical methods 14. For comparison, CH 4 production yields of different studies on photocatalytic reduction of CO 2 with water vapor and CNT/TiO 2 photocatalysts are displayed in Table 3. Methane is the main product in the majority of investigations.It can also be appreciated that best results of current study are 1.6-10 times higher than those in Table 3.The only exception is Xia et al. 13, who reported higher CH 4 production rates and the formation of other products.The main difference of this study and the present work is the higher water: CO 2 ratio used (5:1 vs. 2:7).However, according to the literature 46 and our own work 6, larger water:CO 2 ratios do not necessarily lead to better results. Regarding the effect of CNT/TiO 2 ratio on the photocatalytic activity of the composite, some studies have shown that increasing CNT loadings from 20 to 85 the photocatalytic activity also increases 47.In this work the best CNT/TiO 2 ratio is 1 (second pair of columns), decreasing the photocatalytic activity as the relationship moves away from unit.The activity decrease with higher CNT content (fourth pair of columns) could be related to an increasing absorption and scattering of photons by the CNTs in the composite 25.On the other hand, the decrease with lower CNT content (third pair of columns) may be imputed to that CNT loads in the composite were insufficient to boost the photocatalytic activity of the semiconductor 11.Related to the effect of Cu doping, for Cu concentrations in the 0.5-2 wt. range, the higher the Cu percentage was, the higher the production rates were.On the contrary, when increasing the composite copper load above 2 wt. these rates drop up to typical values of unmodified TiO 2 .Considering some studies dealing with Cu-doped catalysts, this result may be imputed to that large Cu loadings could shield the photoactive sites on TiO 2 surface, reducing the photoexciting capacity of TiO 2 33.Accordingly, best results were obtained at Cu concentrations in the ternary composite of 1 and 2 wt. (fifth and sixth pair of columns), with production rates 12 times higher than with P25 for CH 4 and 3 times for CO.These results are similar to those obtained in previous works with Cudoped TiO 2 nanoparticles synthesized at supercritical CO 2 medium 7 and better if the doping metal considered is Pd or Pt 5,6.Further, photocatalytic results with ternary composites CNT/TiO 2 /Cu do not improve those reported above for binary photocatalyst CNT 50 /TiO 2 50 .Finally, as shown in Fig. 8, catalysts synthesized in two steps do not lead to larger production rates than their single stage counterparts.Specifically, binary catalysts with CNT/TiO 2 ratios of 0.25 (CNT 20 So, it could be concluded that the synthesis in one stage is better than the two-step procedure because the former is faster and more efficient, despite the better characteristics of the latter in relation to P25, as explained in previous sections.In addition, the one-stage method is more environmentally friendly since it implies a reduction in energy consumption and reagents, as well as in the production of wastes. Finally, it should be highlighted that, according to physicochemical properties of synthesized composites (Table 2), the characteristics allowing to clearly distinguish one of them from the rest were surface area and those of optical character (absorption threshold and band gap energy).Specifically, the higher absorption threshold (shifted to visible range) and lower band gap energy attained (530 nm and 2.34 eV, respectively) corresponded to composite CNT 50 /TiO 2 50 , the catalyst later evincing the largest CO 2 photoreduction activity.Regarding surface area, composite CNT 50 /P25 50 showed the largest value for this variable, and also large photoreduction rates, the same order than those exhibited by CNT 50 /TiO 2 50 .According to literature 10,25,34, the improved performance of this CNT/TiO 2 composite catalysts may be imputed to several reasons: (1) CNT act as dispersing agent preventing TiO 2 from agglomeration and providing a high surface area to composite.(2) CNT act as adsorbent of reactants, transferring the reactants (CO 2 and water vapor) to TiO 2 surface, where the photocatalytic reaction takes place.(3) CNT act as photosensitizer (electron donor) by injecting electrons from CNT VB into TiO 2 CB, producing electron/hole pairs and promoting the photocatalytic formation of very reactive radicals.This is just a hypothesis, since some studies describe CNT as photoelectron scavenger (electron acceptor) from TiO 2 CB, leaving an excess of VB holes in the TiO 2 to migrate to the surface and take part in redox reactions 4,11,30.Further, the formation of CNT/TiO 2 heterojunctions reduces the rate of recombination of photoinduced electrons and holes 4."
  },
  {
    "title": "Conclusions",
    "content": "From results presented in previous sections the following conclusions can be drawn: The photocatalytic activity of TiO 2 nanoparticles synthesized with supercritical fluids is increased when they are supported on carbon nanotubes at appropriate synthesis conditions.For the composite with best photocatalytic properties (CNT 50 /TiO 2 50 ) the production rates of methane and CO were about 15 and 4 times larger, respectively, than with commercial P25.These results surpass those obtained in earlier works with metal-doped TiO 2 catalysts produced in supercritical medium.They also overcome those reported in literature for CO 2 photoreduction with some CNT/TiO 2 catalysts produced by classical methods of synthesis. For CNT/TiO 2 /Cu ternary composites, the effect of copper doping is overshadowed by the effect of CNT support (in the 0.5-5 weight percentage range investigated).This fact was observed when analyzing both physicochemical properties of the composites and their photocatalytic activities. For CNT/TiO 2 binary and CNT/TiO 2 /Cu ternary composites, the synthesis in one step is better than the two-step method because the former is not only faster and more efficient, but it also yields more active catalysts for CO 2 photoreduction.Additionally, the one-stage method is more environmentally friendly since it implies a reduction in energy consumption and reagents, as well as in the production of wastes. In order to further increase the kinetics of the CO 2 photoreduction and the variety of products resulting from the reaction, novel advanced TiO 2 based catalyst should be developed considering the use both new dopants (such as metals, non-metals or MOFs) and new carbon supports (such as graphene). (grants for the training of research personal in public research centers and companies 2016/9989) for financial support of this work. Fig. 1.Experimental set-up for the supercritical synthesis of photocatalysts. CNT 50 /P25 50 CNT/P25 composite (50 wt. CNT 50 wt.P25) TiO2 TiO2 nanoparticles synthesized with SCFs CNT 50 /TiO2 50 CNT/TiO2 composite (50 wt. CNT 50 wt.TiO2) CNT 20 /TiO2 80 CNT/TiO2 composite (20 wt. CNT 80 wt. TiO2) CNT 80 /TiO2 20 CNT/TiO2 composite (80 wt. CNT 20 wt. TiO2) CNT 49.75 /TiO2 49.75 /Cu 0.5 CNT/TiO2/Cu composite (49.75 wt. CNT, 49.75 wt. TiO2 0.5 wt. Cu) CNT 49.5 /TiO2 49.5 /Cu 1 CNT/TiO2/Cu composite (49.5 wt. CNT, 49.5 wt. TiO2 1 wt.Cu) CNT 49 /TiO2 49 /Cu 2 CNT/TiO2/Cu composite (49 wt. CNT, 49 wt.TiO2 2 wt.Cu) CNT 48 /TiO2 48 /Cu 4 CNT/TiO2/Cu composite (48 wt. CNT, 48 wt. TiO2 4 wt.Cu) CNT 47.5 /TiO2 47.5 /Cu 5 CNT/TiO2/Cu composite (47.5 wt. CNT, 47.5 wt. TiO2 5 wt.Cu) CNT 20 / TiO2 80 2 steps CNT/TiO2 composite synthesized in 2 steps (20 wt. CNT 80 wt. TiO2) CNT 80 / TiO2 20 2 steps CNT/TiO2 composite synthesized in 2 steps (80 wt. CNT 20 wt. TiO2) CNT 49 / TiO2 49 /Cu 2 2 steps CNT/TiO2/Cu synthesized in 2 steps (49 wt. CNT, 49 wt.TiO2 2 wt.Cu) Fig. 2. Schematic diagram of the experimental set-up for CO2 photoreduction. Fig. 3. SEM images of some synthesized catalysts.(a) CNT 50 /P25 50 , (b) CNT 50 /TiO2 50 , (c) CNT 49.75 /TiO2 49.75 /Cu 0.5 , (d) CNT 48 /TiO2 48 /Cu 4 . Fig. 4. TEM images of some synthesized catalysts.(a) CNT 50 / P25 50 , (b) CNT 49 /TiO2 49 /Cu 2 , (c) CNT 80 /TiO2 20 2 steps , (d) CNT 50 /TiO2 50 , (e) CNT 20 /TiO2 80 2 steps , (f) CNT 49.5 /TiO2 49.5 /Cu 1 . Fig. 5. Effect of Cu load on the size distribution of copper particles in the synthesized composites.(a) CNT 49.5 /TiO2 49.5 /Cu 1 .(b) CNT 49 /TiO2 49 /Cu 2 . Fig. 6.UV-vis DRS spectra of pure and composites catalysts based on P25 and TiO2 synthesized in supercritical medium. Fig. 7. XRD diffractograms showing crystal phases of different catalysts. Fig. 8. Production rates obtained during CO2 photoreduction with photocatalysts synthesized at supercritical medium (methane in blue, CO in orange). Codification of the catalysts used in this work. Characteristics of synthesized catalysts. Photocatalytic reduction of CO2 with water vapor and CNT/TiO2 photocatalysts. The authors would like to thank the Ministry of Economy and Competitiveness of the Spanish Government (CTM2016-79098-R project) and the Regional Government of Castilla-La Mancha The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary material related to this article can be found, in the online version, at doi:https://doi.org/10.1016/j.supflu.2020.104876."
  }
]