[
  {
    "title": "Doi",
    "content": "10.1016/j.apsusc.2019.144683"
  },
  {
    "title": "Article_Title",
    "content": "Graphene-Zn0.5Cd0.5S nanocomposite with enhanced visible-light photocatalytic CO2 reduction activity"
  },
  {
    "title": "Abstract",
    "content": "Carbon dioxide (CO 2 ) extent in the atmosphere has gradually increased because of excessive activities such as burning fossil fuels and deforestation.Converting CO 2 into value-added hydrocarbon fuels over semiconductors by using solar energy is thus essential to reduce the greenhouse effect.In this study, novel hierarchical graphene-Zn 0.5 Cd 0.5 S (xG-ZCS) nanocomposites were constructed through a straight forward dual-step hydrothermal approach at 180 C.The prepared composites exhibited enhanced visible-light photocatalytic transformation of CO 2 to methanol (CH 3 OH).The 2G-ZCS (2 wt graphene-Zn 0.5 Cd 0.5 S) composite produced the highest amount of CH 3 OH (approximately 1.96 mol g -1 h -1 ), that is almost 98 times greater than pure ZCS nanospheres (Zn 0.5 Cd 0.5 S).The increased photocatalytic CO 2 reduction could be as a result of graphene, which served as an exceptional electron receiver and carrier, sinking the reconsolidation of charge mobility and enhance the catalytic property.The electrochemical impedance spectroscopy and transient photocurrent analysis was analyzed to demonstrate the proposed photocatalysis mechanism."
  },
  {
    "title": "Experimental",
    "content": "2.1.Preparation of Zn 0.5 Cd 0.5 S nanospheres Analytical grade chemical reagents were used as received (Shanghai Chemical Reagent Co., China).In a typical experiment, Zinc acetate (1.8 mmol) and cadmium acetate (1.8 mmol) were added in 120 mL of water through magnetic rotation for 30 min.The solution was added with thiourea (90 mmol), mixed for 30 min, and later shifted to a 180 mL Teflon-lined stainless-steel autoclave.The hydrothermal experiments were conducted at 150 C for 5 h.After the hydrothermal experiment the resultant yellow powder was harvested by means of centrifugation, washed with ethanol and distilled water for five times and finally rinsed with carbon disulfide solution for 1 min and washed with water and dried the sample at 60 C for 8 h. 2.2.Synthesis of graphene-Zn 0.5 Cd 0.5 S nanospheres Graphene oxide (GO) was organized according to modified Hummer's method 46.In a typical Graphene-Zn 0.5 Cd 0.5 S nanospheres preparation process, a known quantity of GO were dispersed in 10 mL of ethanol and 20 mL of water by ultrasonication for 1 h and later, asfabricated Zn 0.5 Cd 0.5 S nanospheres (0.2 g) was dispersed in GO solution and mixed for 1 h to attain a consistent mixture.The resultant mixture was placed into a 60 mL Teflon-lined stainless autoclave and heated at 180 C for 3 h to adhere the GO sheets and Zn 0.5 Cd 0.5 S nanospheres and simultaneously reduce GO into reduced GO (RGO).After cooling down to room temperature, the resultant sample was harvested by centrifugation, washed with ethanol and distilled water five times, and dried at 60 C for 8 h.The weight percentage of graphene-to-Zn 0.5 Cd 0.5 S catalyst was varied from 0 wt to 5 wt (0, 0.2, 0.5, 1, 2, and 5 wt respectively) to explore the outcome of GO on the photocatalytic CO 2 reduction accomplishment beneath the visible light.The corresponding samples were considered as xG-ZCS (where 0, 0.2, 0.5, 1, 2, and 5).For photocatalytic comparison, 2 wt graphene oxide was composited with Zn 0.5 Cd 0.5 S catalyst as the same procedure above except graphene was replaced by graphene oxide and the resultant sample were dented as 2GO-ZCS. The (HZG41B-PC) X-ray powder diffraction (XRD) was applied to characterize the crystal phase properties.The Field emission scanning electron microscope (FESEM) images were obtained using JSM-7500F, JEOL, Japan.Transmission electron microscopy (TEM) and high-resolution TEM (HRTEM) images were registered by Tecnai G 2 20 U-Twin electron microscope.The Brunauer-Emmett-Teller (BET) specific surface area (S BET ) was collected on a Micromeritics ASAP 2020 (USA) instrument.A pore size was calculated by Barret-Joyner-Halender (BJH) technique 47.The X-ray photoelectron spectroscopy (XPS) was tested on a high vacuum VG ESCALAB 210 electron spectrometer with Mg K (1253.6 eV) radiation origin.The Raman spectra were performed using 633 nm Ar laser over micro-Raman spectrometer (Renishaw InVia).The optical UV-vis diffuse reflectance spectra were obtained using Shimadzu UV-2550 UV-vis spectrophotometer (Japan) instrument and BaSO 4 was used as the internal reference. The CO 2 evaluation of graphene-Zn 0.5 Cd 0.5 S composite was measured according to our recently reported method 35.In a typical CO 2 reduction reaction, 300 W Xe arc lamp, was positioned 10 cm above the reactor and 400 nm cut off filter was used as visible light source to activate the photocatalytic reaction.The CO 2 reduction yield were examined by a gas chromatograph (Shimadzu GC-2014C, Japan) operational with a flame ionized locator and methanizer. Photocurrents were recorded using CHI CHI660C electrochemical analyzer (China) in a regular three-electrode system similar to our previously reported method 35.In a typical measurement, Pt wire was used as counter electrode, Ag/AgCl as a reference electrode and prepared samples as working electrodes.3 W LED light of 420 nm was positioned 1 cm away from the reactor and photoanode was kept at a distance of 15 cm from the visible light source.0.5 M Na 2 SO 4 aqueous solution was used as electrolyte."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The composition and phase authentication of the as-obtained ZCS and xG-ZCS composite specimens were characterized by XRD.The XRD results of prepared composites with different graphene contents are displayed in Fig. 1.The powder XRD patterns are compared with the hexagonal CdS (JCPDS card no.41-1049) and hexagonal ZnS (JCPDS card no.36-1450).The XRD peaks are salient and strong, indicting extremely crystalline nature of the as-prepared composite samples.No diffraction peaks of contamination could be noticed, demonstrating the purity of the as-prepared samples.Furthermore, it is significant to reveal that the peak of nanocomposites exhibits left shift to smaller angels in contrast with the standard ZnS pattern.This behavior signifies the development of alloyed ZCS nanospheres lightly than the simple blend of ZnS and CdS particles in the ZCS nanospheres.Such, diffraction shifting was previously reported in our publications 303132.Notably, no characteristic diffraction for graphene oxide or reduced graphene oxide peaks at (2) 10.8 and 24.8 C respectively were noticed in the composite patterns owing to the smaller concentration and comparatively weakened diffraction magnitude of GO in the xG-ZCS composite sample.However, graphene sheets in the composites could be observed by FESEM, TEM, and Raman spectroscopy. The XPS analysis was carried out to understand the chemical state and surface distribution of ZCS and 2G-ZCS composite samples.As anticipated, the survey spectrum (data not revealed) designated that the ZCS and 2G-ZCS samples restrained to Zn, Cd, S, and C elements.The XPS peaks at 1022 (Zn 2p), 405.6 (Cd 3d), signifies that Zn and Cd existed in Zn 2 and Cd 2 state.Correspondingly, the S 2p peak of sulfur at 162.2 eV shows it is present in S 2-form 48.The deconvoluted C 1s curves of GO, ZCS, and 2G-ZCS are shown in Fig. 2a.The main adventitious carbon and graphitic carbon C 1s curves at 285.0 and 286.6 eV were allocated GO and (CeOH), respectively.The peak positioned at 289.2 eV could be allocated to (OeCeO) 49.The C 1s peak at 284.8 eV in the ZCS sample could be allocated due to the external carbon source derived from the XPS machine.The irregular and wide structures of the noticed C1s XPS peaks for the 2G-ZCS composite sample suggest the coexistence of distinct representations.The major C 1s curve at 284.9 eV was allocated to rudimentary carbon and the other peaks at 285.6, 287.9, and 288.7 eV were allocated to CeO in the hydroxyl or epoxy forms, CeO and C(O)O, respectively 50,51.In addition, the CeO and CeO peaks exhibited reduced intensity, signifying effective deoxygenation of GO.Existence of aforesaid facade functional groups provided effective sites for authentication of ZCS nanospheres over the exterior of graphene sheet.The Zn 2p and Cd 3d high-resolution X-ray photoelectron bands are illustrated in Fig. 2b andc, separately.The binding energy of Zn 2p and Cd 3d for the pure ZCS matches very well with the zinc and cadmium divalent states in the metal sulfides.However, the peak locations of Zn 2p for the 2G-ZCS sample were observed at 1022.1 and 1045.2 eV, respectively, with a peak shifting to a lower value of 0.4 eV.Meanwhile, doublets in the Cd 3d spectra at ca. 405 and 411.7 eV matches with Cd 3d 3/2 and Cd 3d 5/2 , respectively, attributing to Cd 2 state.Furthermore, a Cd 3d peak reallocated to upper values by 0.5 eV contrast with that of ZCS sample, which is in good conformity with earlier studies 52.This phenomenon is possibly expected towards the altered chemical changes of Zn and Cd atoms in the 2G-ZCS sample, which clearly indicates that chemical binding between graphene and ZCS composite possibly formed instead of a simple physical mixture.Meanwhile, the binding energy values for S 2p were in excellent conformity with data described in the literature (Fig. 2d) 52,53.The XRD and XPS results specify that high-purity graphene-ZCS solid solution was fabricated. Raman spectroscopy is a straight forward and nonfatal method to distinguish graphene, including organized/disorganized arrangement of carbon components.The Raman spectra of GO, ZCS, and 2G-ZCS composite samples are illustrated in Fig. 3.In the GO spectrum, two representative Raman bands for G and D bands were observed at approximately 1592 and 1350 cm -1 53.The G band is assigned to the first-order dispersion of the CeC elongating resonance of sp 2 merger of carbon atoms in a 2D hexagonal lattice of graphite.By contrast, the D band is related with irregularity and fractionally disorganized structure of the sp 2 orbit with suspended bonds in plane terminations 54.Undoubtedly, the G band was fairly shifted to higher band, as the intensity of the D band increased significantly.This enhance is due to the imperfection and disorders in the graphene sheets and further the D and G bands at 1327 and 1596 cm -1 in 2G-ZCS composite slight shift with that of GO, indicating the reduction of GO 50.Furthermore, the I D /I G ratio of GO (0.84) increased to 1.2 in the 2G-ZCS sample.The rise in I D / I G proportion specifies the arrangement of new graphitic form and consequently decline in normal content of sp 2 domain of carbon atom.The considerable intense peak at 308 cm -1 and minor peak at 610 cm -1 were allocated for elongated optical phonons 1LO and 2LO, of ZCS, respectively 55.An apparent red-shift in these peaks contrast with that of the pristine ZCS might have been created owing to the suppression of the phonon modes among O-Cd-S and O-Zn-S and later merger with graphene 56.Hence, GO was successfully reduced to RGO, and their chemical bonding actions was observed between the RGO and ZCS in the nanocomposites. The UV-vis diffuse-reflectance spectra of RGO, ZCS, and xG-ZCS samples are displayed in Fig. 4. Pure ZCS exhibited a sharp absorption edge of 532 nm.Deducing the linear section of the plot the square of the absorbance versus energy shows an estimated bandgap of 2.33 eV 57.The absorption edge for 0.2G-ZCS and 2G-ZCS samples shows blue-shift indicating that RGO in the composites were neither integrated within the ZCS crystal structure, where the sheet-architecture graphene in the composite only serve just as a layer for holding the ZCS nanospheres.Further, with the incorporation of RGO in the composites results in broad backdrop retention in the visible section.Subsequently, the photo-penetration intensities of the composites are enhanced steadily in the range of 700-900 nm.The corresponding outcome is in excellent accord with the color transformation of the samples from orange to brownish green to black (not shown).The increased photo-intake of the resultant sample mixture might be related towards the possible electron transfer from of GO.Therefore, it is concluded that a certain addition of GO would facilitate the photo-absorption of ZCS nanospheres and the segregation of photogenerated charge mobility and sudden arise in the improved catalytic activity of the composites. The morphology of the as-prepared ZCS and 2G-ZCS nanocomposites was characterized by FESEM and TEM, respectively.The FESEM image (Fig. 5a) exhibits a typical as-prepared product (ZCS) without graphene.The sample consisted of hierarchical nanospheres with a density of ca.100-150 nm.As displayed in TEM image (Fig. 5b), the ZCS spheres were comprise of a vast quantity of tiny primary nanoparticles over the surface of the nanospheres.Furthermore, these nanospheres show loose intimate arrangement, signifying the existence of mesoporous structure between these interconnected tiny primary nanoparticles (20-30 nm in size) within the nanospheres.ZCS nanoparticles are self-aggregated into sphere-like structure without surfactants or organic additives.Fig. 5c illustrates that the 2G-ZCS sample shows fully exfoliated near-transparent graphene sheet decorated by ZCS nanospheres connected on the external of the graphene sheet.Furthermore, the quantitative EDS analysis in Fig. 5d, shows that the nanocomposites subsist of Zn, Cd, S, and C components.The appearance of the Al peak is due to the analysis grid.These results clearly suggest that graphene-ZCS composite nanostructures were effectively synthesized.The close connection among the graphene and ZCS would offer more photo-generated electrons from the ZCS to graphene nanosheet, thereby increasing the charge separation and photocatalytic activity. The representative TEM and HRTEM photographs of 2G-ZCS sample are presented in Fig. 6.It could be noticed that ZCS hollow nanospheres (100-120 nm in diameter) were decorated over the near-transparent surface of the graphene nanosheet.Moreover, the exfoliated graphene sheets were wrinkled, maybe caused by the oxygen functionalization and the resultant defects formed during event of GO preparation 58.The inset in Fig. 6a shows that the nanospheres consisted of nanoclustered particles, which aggregated to form a nanosphere structure.Additionally, the clear color contrast of the ZCS nanosphere confirms the hollow structure of the as-prepared ZCS nanospheres.The ZCS nanospheres could connect through the graphene sheets over the electrostatic requisite and charge relocation communication.Thus, the interface among ZCS nanospheres and graphene sheets enabled electron transfer from ZCS nanospheres to graphene layers through the photoexcitation technique.The resultant HRTEM figure of the respective ZCS nanosphere is shown in Fig. 6b.The lattice fringe distance of approximately 0.32 nm could be allocated to hexagonal ZCS crystal's (1 0 1) lattice plane.The EDS mapping was investigated to confirm the exterior connection within the graphene-ZCS catalysts in 2G-ZCS sample.Fig. 7 shows that all four major elements (Zn, Cd, S, and C) were distributed uniformly in the 2G-ZCS photocatalyst.These results clearly suggest the successful synthesis of 2G-ZCS composite.The close contact between ZCS and graphene might support the relocation of photo-developed charge transporters, increasing the charge segregation and photocatalytic movement of the composites. The specific surface range of ZCS and xG-ZCS composites models were obtained using the multi-point BET method.Introducing graphene resulted in the large superficial area of the composite certainly with that of bulk ZCS.Improved apparent surface area of a photocatalyst could store additional active species, facilitating easier charge carrier transport and enhanced photocatalytic performance.A typical BJH pore-size delivery graph and nitrogen sorption isotherms of samples ZCS, 2G-ZCS, and 5G-ZCS are shown in Fig. 8.The nitrogen adsorption-desorption isotherms for all samples shows type IV isotherms with an H3 hysteresis loop, signifying the existence of slit-like pores 59.Furthermore, at high pressure range (P/P 0 ) all samples show high adsorption indicating the existence of huge mesopores and macropores (inset in Fig. 8) 60.The significant information of the BET analysis is reported in Table 1.All graphene-ZCS composite samples had higher specific surface areas than the ZCS sample.This result suggests that graphene nanosheets acted as substrate and reduced the crystallinity/ growth of ZCS crystallite. The photocatalytic CO 2 reduction activities under visible-light irradiated ( 400 nm) was tested for all the as-prepared samples and the representative authentic chromatogram for 2G-ZCS sample is shown in Fig. 9a.CH 3 OH was observed as the dominant produce, associated with HCHO and CH 4 at ambient temperature and pressure condition.Blank experiment showed no CO 2 reduction to hydrocarbons noticed without light illumination or catalyst.This phenomenon agrees that light irradiation and photocatalyst are very much essential for the reduction of CO 2 .Further, controlled examination was also achieved to explain the photocatalytic CO 2 reduction mechanism and eliminate potential impurity from pure ZCS and graphene-ZCS composite samples.The ZCS or 2G-ZCS composite samples were illuminated beyond presenting CO 2 as the carbon resource and nitrogen gas was utilized as transporter.Though, no hydrocarbon complexes could be detected, suggesting that the above obtained hydrocarbon compounds were due to the photocatalytic reduction of CO 2 .Fig. 9b shows the examination of visible-light photocatalytic generation rates of hydrocarbons over asprepared samples with distinct concentrations of graphene under simulated visible-light illumination for 1 h.Only trace quantity of CH 3 OH was generated by ZCS.However, addition of graphene in the composite increased the production of CH 3 OH. The 2G-ZCS composite produced the highest amount of CH 3 OH at approximately 1.96 mol g -1 h -1 , which is nearly 98 times greater than the CH 3 OH product obtained using ZCS.However, further increase in graphene loading decreased the photocatalytic activity.For instance, production of CH 3 OH dropped to 0.51 mol g -1 h -1 when the concentration of graphene was increased to 5 (5G-ZCS sample).The decrease in photocatalytic activity beyond 2 wt of the graphene content is because excessive addition of graphene content retarded the light absorption of the photocatalyst.This resulted in the diminish in the number of charge carriers about the photocatalytic reception sites, that is persistent with previous studies 61,62.These results clearly show that optimal amount of graphene content undoubtedly intensified the photocatalytic activity of xG-ZCS composites.In addition, it is interesting to observe that the photocatalytic CO 2 reduction activity over ZCS composited graphene oxide (2GO-ZCS) sample is much lower than that of the 2.0G-ZCS sample, implying that light reflection over graphene oxide-ZCS sample is weak and the fewer electrons were generated over the graphene oxide surface for photoreduction of CO 2 into methanol.Furthermore, the improved visible-light photocatalytic activity was associated toward the collective outcome of several aspects like high surface area, charge transfer, and adequate segregation of photo-induced charge carriers.Thus, the photo-generated electrons from ZCS can relocate to graphene surface with outstanding segregation of photodeveloped charge carriers of ZCS, in that graphene performs as an electron receiver and carrier.Further, the 2D -adjoined structure of the graphene sheets further boosts the retention of CO 2 molecules. The photocatalytic CO 2 to CH 3 OH conversion mechanism over the as-prepared graphene-ZCS nanocomposites is shown in Fig. 10.It is well reported that the electrons essentially need to be further negative chemical potential to reduce CO 2 to CH 3 OH, while the holes for oxidation need to be positive and lie on higher potential level.Thus, when graphene-ZCS sample were illuminated with light source, the visible light active nanoparticles undergo charge dissolution, provoking electrons movement to the CB subsequently positively charged holes to the VB.In the event of plain ZCS, the photoexcited negatively charged electrons contribute to re-associate along the positive charged holes in the VB within nanoseconds, because of their huge dissimilarity among the potential of the CB (-0.369V) of ZCS and redox couple (-0.38 V vs. NHE).Thus, the rate of CH 3 OH production on pure ZCS microspheres was negligible.However, with the existence of graphene in the composites, the photoexcited electrons would effectively migrate from the ZCS nanospheres to the graphene, to produce CH 3 OH via photocatalytic reaction, where graphene acts as an electron receiver and carrier 32,45.Furthermore, an enormous quantity of graphene in the composite not only decreases the CO 2 reduction but also shields the incident light on the catalyst surface 62.Thus, electrons in the ZCS cannot participate in the CO 2 reduction and will accumulate on the interface of graphene and ZCS.This behavior may lead to a serious reconsolidation of photo-developed charge carriers and drastically decrease the photocatalytic achievement. The complete photocatalytic CO 2 reduction movement over the Fig. 8. Nitrogen adsorption-desorption isotherms and the correlative pore-size distribution curves (inset) of the ZCS, 2G-ZCS, and 5G-ZCS samples.catalyst can be compiled as follows: (2) (3) The transient photocurrent responses of the ZCS, 2G-ZCS, and 5G-ZCS electrodes were documented over many on-off cycles of the repeated 400 nm LED-light visible-light irradiation at 0.5 V potential.The photocurrent-time (I-t) curves are illustrated in Fig. 11.ZCS sample shows an apparent photocurrent response, which is rapidly boosted as soon as the sample was irradiated and decreases to zero upon termination of irradiation.This result reveals that photocurrent was reproducible and that the photo-developed charge carriers were clearly reassigned on the sample/electrode edge to generate photocurrent over visible-light irradiation.The photocurrent curve for the 2G-ZCS sample has an apparent sharp anodic photocurrent spike at the opening period of irradiation.The photocurrent constantly decreased as time increased subsequently the spike current had been achieved, if stable current was attained.Similar decline in photocurrent specified the occurrence of the recombination process 63.In addition to the photo-generated electrons, a certain number of photo-generated holes also shifted to the graphene nanosheet during the decay process because of the close connection between the ZCS nanospheres and graphene.These holes stored at the graphene recombined with electrons against the CB of ZCS, relatively being captured or occupied in the electrolyte, resulting in the decreased photocurrent.The anodic photocurrent spike in the 5G-ZCS sample are not sharp as that of 2G-ZCS, probably because the high concentration of graphene might shield the surface of ZCS hollow nanospheres from incident light, producing fewer photo-generated charge carriers 61.These results also show that the photocurrent intensity increases first and afterward decreases with rising graphene amount.This behavior clearly confirms that a convenient concentration of graphene in the sample benefit electron reallocation, which may result in enhanced photocatalytic activity. The EIS (electrochemical impedance spectroscopy) technique was adopted to understand the important role of GO as an electron receiver and transmitter channel to assist the segregation and relocation of photodeveloped electrons, and thus attaining the superior rate of photocatalytic CO 2 reduction.The characteristic EIS Nyquist plots of the pure ZCS, 2G-ZCS, and 5G-ZCS samples are shown in Fig. 12. Related with that of ZCS, the EIS Nyquist plot of 5G-ZCS and 2G-ZCS show much lower semicircles, representing a major decrease of the charge transfer confrontation in the graphene-ZCS composites 64.The 2G-ZCS sample demonstrates the lowest semicircle, signifying that 2 wt graphene is the best possible graphene content for the better charge transfer efficiency.The intensified charged rearrangement in 5G-ZCS sample is due to the enormous addition of graphene, which may perform as new recombination centers of the photodeveloped charge carriers to delay the movement of photogenerated electrons from the center to the surface of the nanocomposite.To provide additional advantage of graphene-ZCS composite structure for CO 2 reduction, the crystal structure and morphology of 2G-ZCS catalyst before and after photocatalytic CO 2 reduction reaction were investigated and presented in Fig. 13.As shown in figure there is no obvious difference in the X-ray diffraction pattern or in morphology indicating as-prepared composite sample are highly stable."
  },
  {
    "title": "Conclusions",
    "content": "Novel graphene-ZCS nanosphere composites were processed by a straight forward duel-pot hydrothermal technique.The as-prepared xG-ZCS nanocomposites demonstrated superior photocatalytic activity for the reduction of CO 2 to hydrocarbon fuels.The addition of graphene has considerably improved the photocatalytic performance of graphene-ZCS nanocomposites.The CH 3 OH yield over 2G-ZCS nanocomposites was approximately 1.96 mol g -1 h -1 , which was around 98 times elevated CH 3 OH product obtained using ZCS nanosphere sample under visible-light illumination.The collective outcome between charge transfer and visible-light absorption in graphene-Zn 0.5 Cd 0.5 S (G-ZCS) nanocomposites could remarkably improve the photocatalytic achievement of ZCS.The layered graphene acted as an electron receiver and conveyer, thereby enhancing the lifetime of a charge carrier, which increased the photocatalytic activity of composite materials.This investigation suggests a simple approach for establishing low-cost noble-metal-free earth-abundant graphene cocatalyst ZCS nanocomposites with immense performance for CO 2 photoreduction under visible light.These findings would inspire new ideas in designing other RGO-based composites for CO 2 reduction. Fig. 1.X-ray diffraction patterns of the as-prepared composites alongside with normal diffraction results of CdS and ZnS. Fig. 2. High-resolution XPS spectra of (a) C 1s, (b) Zn 2p, (c) Cd 3d, and (d) S 2p for ZCS and 2G-ZCS samples. Fig. 3. Raman spectra of GO, ZCS, and 2G-ZCS samples. Fig. 4. UV-vis diffuse-reflectance spectra of RGO, ZCS, and as-prepared xG-ZCS samples. Fig. 5. (a) FESEM and (b) TEM images of ZCS sample and (c) FESEM image and (c) EDS pattern of 2G-ZCS sample. Fig. 6.(a) TEM and (b) HRTEM images of 2G-ZCS sample.Inset in (a) shows the TEM image of typical ZCS nanospheres over the graphene surface. Fig. 7. EDS mapping of 2G-ZCS.(a) Selected area for EDS element mappings.(b-e) EDS maps for elements Zn, Cd, S, and C. Fig. 9. (a) Authentic chromatograms for 2G-ZCS sample after 1 h light illumination compared with chromatogram without photocatalyst or light illumination and (b) evaluation of CH 3 OH reproduction rate for different as-prepared samples. Fig. 10.Schematic diagram of charge-transfer procedures for photocatalytic CO 2 reduction on 2G-ZCS composite sample. Fig. 11.Transient photocurrent feedback for ZCS, 2G-ZCS and 5G-ZCS under visible-light illuminaton (420 nm LED) in 0.5 M Na 2 SO 4 aqueous solution. Fig. 12. Electrochemical impedance spectra and electrical equivalent-circuit model (inset) of the ZCS, 2G-ZCS, and 5G-ZCS samples. Fig. 13.(a) XRD patterns and (b) FESEM images of 2G-ZCS sample before and after photocatalytic CO 2 reduction. The outcome of graphene concentration loading over the physicochemical effects and methanol generation proportion for several samples. This project was funded by the Deanship of Scientific Research (DSR) at King Abdulaziz University, Jeddah, under grant no.(RG-42-130-40).The authors, therefore, acknowledge with thanks DSR technical and financial support.This work was also supported by The National Key Research and Development Program of China (2018YFB1502001) and NSFC (21433007, 51932007, 51961135303, 21871217 and U1705251) and Innovative Research Funds of SKLWUT (2017-ZD-4). S. Wageha, Ahmed A. Al-Ghamdi and Bei Cheng conceived and supervised the project. Puttaswamy Madhusudan and Jun Zhang designed the materials and experiments.. Puttaswamy Madhusudan, Yan Yu and Bei Cheng performed the experimental data analysis and drafted the paper. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper."
  }
]