[
  {
    "title": "Doi",
    "content": "10.1039/d0cy00343c"
  },
  {
    "title": "Article_Title",
    "content": "Enhanced and selective photocatalytic reduction of CO<sub>2</sub> by H<sub>2</sub>O over strategically doped Fe and Cr into porous boron carbon nitride"
  },
  {
    "title": "Abstract",
    "content": "Strategic doping of metals and non-metals into a photocatalyst can help in tuning the band gap and alignment of band structure.The surface charge and charge transfer mechanism in a photocatalyst system govern the amount of products and their distribution.Herein, we used a wet impregnation method to embed Fe and Cr into the in-planes of porous boron-doped carbon nitride and tested the photoactivity by reducing CO 2 gas in the presence of water at room temperature under visible-light illumination.The total consumed electron number, a measure for photoactivity, was increased by 2.14 times for Cr,B-codoped carbon nitride than that of the pristine graphitic carbon nitride.Also, the selectivity for CO was increased with transition metal doping.X-ray photoelectron spectroscopy revealed that Fe existed in the 2 and 3 oxidation states; while Cr was in the 3 and 6 states.Notably, the optical and electronic properties were altered for the transition metal-doped catalysts.Several in situ measurements were performed to identify the reaction intermediates and underlying mechanism.COO -and HCHO were active intermediates for CO formation, and HCO 3 -could be an intermediate for CH 4 generation.This work elucidates the pivotal role of trapped charge carriers in enhancing charge separation efficiencies and product selectivity.The results herein clearly demonstrate a promising strategy to use the strong p-d repulsion between metal and nonmetal elements on a host photocatalyst to extend the visible-light absorption range and reduce the recombination events, which can enhance the selectivity and yields of products."
  },
  {
    "title": "Experimental",
    "content": "Catalyst preparation g-C 3 N 4 (CN).Dicyandiamide (5 g) (Sigma Aldrich, 99 purity) was calcined at 520 C (ramp rate 2.75 C min -1 ) for 1 h to synthesize g-C 3 N 4 . B-doped g-C 3 N 4 (B-CN).4 g of dicyandiamide was first mixed in 200 ml deionized water and stirred for 15 minutes at 80 C.The color of the solution changed from cloudy to clear.Further, 0.5 g H 3 BO 3 (Merck, 99.9 purity) was mixed in the solution and again stirred at 80 C for 15 minutes at 500 rpm.Then, the resulting solution (A) was kept in a hot dryer oven at 80 C for 10 h.The obtained solid material was transferred in a crucible and put in a furnace for 1 h at 520 C (ramp rate 2.75 C per minute) and the resulting material was ground, washed thoroughly, and dried overnight at 80 C to prepare B-doped g-C 3 N 4 . Fe,B-doped g-C 3 N 4 (Fe,B-CN).0.5 g FeSO 4 (Merck, 99.5 purity) was mixed in 50 ml deionized water and ultrasonicated for 5 minutes.Then, the mixture was added dropwise into 200 ml of solution A and stirred for 30 minutes at 180 C.The resulting solution was dried in an oven at 80 C for 10 h.The obtained solid material was kept in a furnace for 1 h at 520 C (ramp rate 2.75 C per minute) and the resulting material was ground, washed thoroughly, and dried overnight at 80 C to dope Fe in B-doped g-C 3 N 4 . Cr,B-doped g-C 3 N 4 (Cr,B-CN).The same synthesis procedure as that of Fe,B-doped g-C 3 N 4 was followed to dope Cr in B-doped g-C 3 N 4 .Here, 0.5 g K 2 Cr 2 O 7 (Merck 99 purity) was used as a precursor. Cr : Fe (1 : 1)B-doped g-C 3 N 4 (Cr,Fe,B-CN).Again, the same procedure was followed as for Fe and Cr doping.In this case, 0.5 g FeSO 4 and 0.25 g K 2 Cr 2 O 7 were employed to dope Cr and Fe in a 1 : 1 atomic ratio. X-ray diffraction (XRD) patterns of the fresh and used samples were recorded using a Rigaku X-ray diffractometer at a voltage of 10 kV using Cu K radiation flux ( 0.1518 nm).Scans were performed from 10to 80(2) at a scan rate of 2min -1 .After that, the Brunauer-Emmett-Teller (BET) surface area, average pore width, and corresponding nitrogen adsorption/desorption isotherms were measured using a Micromeritics Tristar 3000 analyzer at -196 C.Prior to measurements, samples were degassed at 250 C under a continuous nitrogen flow for 4 h to ensure complete removal of moisture and adventitious hydrocarbons.The morphology and corresponding elemental mapping of samples were recorded using a scanning electron microscope (Zeiss Gemini500, SEM Hitachi S-4800) equipped with energydispersive X-ray spectroscopy (EDS).The lattice structure with electron-diffraction patterns was observed using high- resolution transmission electron microscopy (HRTEM) and selected area electron diffraction (SAED) on a JEOL-JEM 2100 plus electron microscope operated at 200 keV electrons with 0.14 nm lattice resolution. X-ray photoelectron spectroscopy (XPS) was done using a PHI 5000 Versa Prob II spectrometer (FEI) equipped with an Al K anode (hv 1486 eV).All the binding energies were referenced to the C1s peak at 284.8 eV, which belongs to the adventitious carbon signals resulting from the instrument or from the catalyst surface.The C1s, N1s, B2p, Fe2p, and Cr2p core level narrow spectra were recorded using a pass energy of 20 eV for high resolution.The electron spin resonance (ESR) signals were collected using a Jeol JES -FA200 ESR spectrometer in the dark and under irradiation from a 500 W Xe lamp for approximately five minutes. UV-vis diffuse reflection spectra were recorded with a UVvis spectrophotometer (UV-2500, Shimadzu, Japan) using BaSO 4 as a reflectance standard.Photoluminescence (PL) spectra were acquired in the powder phase (at room temperature) using a FluoroMax-4 spectrofluorometer (HORIBA Scientific) in the wavelength range of 370 to 700 nm at the excitation wavelength of 360 nm for all samples.Also, Fourier transform infrared (FTIR) spectra were collected in the frequency range of 4000 cm -1 to 500 cm -1 using a Thermo Scientific Nicolet iS50 infrared spectrometer equipped with a deuterated triglycine sulfate (DTGS) detector.All the data were collected in transmittance mode using the KBr pellet technique with 64 scans for the background and 32 scans for the sample at 4 cm -1 resolution. To carry out the photocatalytic CO 2 reduction reaction, we have used the same experimental setup as illustrated in our previous report. 25Briefly, 25 mg of catalyst was dispersed in 10 mL of Milli-Q water and then the solution was sonicated for 30 minutes.The highly dispersed catalyst solution was poured onto the concave surface of a horizontally placed three-neck borosilicate glass (volume of 175 ml) and then dried at 80 C in an oven for 10 hours.Consequently, a thin film of the catalyst was uniformly formed on the concave wall of the reactor.Notably, the other two openings of the borosilicate glass were sealed using a silicone rubber septum.Ultrapure carbon dioxide gas (99.99 purity) was continuously passed through the reactor to maintain an anaerobic condition.Prior to conducting any experiment, we confirmed the anaerobic condition inside the reactor using a gas chromatograph (Model-5800, Centurion Scientific). Next, ultrapure carbon dioxide gas (99.99 purity) was passed through Milli-Q water (at 25 C) at a flow rate of 5 ml min -1 .The thus obtained moist CO 2 gas stream was sent to the reactor for 30 minutes.We supplied an additional 15 L of Milli-Q water via a syringe and heated the reactor for 15 minutes at 80 C.Then, the reactor was cooled to room temperature and kept in the dark for nearly 30 minutes to achieve adsorption-desorption equilibrium for moist CO 2 gas on the catalyst surface.Here, we employed a 500 W Xe arc lamp (Sciencetech, Canada) as the irradiation source, and the lamp was kept 7 cm away from the catalyst surface.In all experiments, the film of catalysts was irradiated for a total of four hours.After completion of the reaction, the gaseous samples were collected from the reactor using a 1 ml gastight Hamilton syringe.These samples were examined using our gas chromatograph (GC), which is equipped with a flame ionized detector (FID), a thermal conductivity detector (TCD), and a methanizer to precisely detect the amount of CH 4 and CO gases.In this study, only a molecular sieve column (length 2 m, ID 2.1 mm) was used to identify as well as quantify the gaseous products.Here, argon was used as a carrier gas.At the start of each experiment, the retention time of all involved species was recorded using a standard gas mixture (200 ppm of each gas of CH 4 , CO, H 2 , O 2 and the rest argon gas).Moreover, several blank tests were carefully performed to understand the nature of the photocatalytic reaction as well as the source of C1 products. Electrochemical tests were performed using an SP-150 potentiostat (Biologics).The working electrodes were prepared as follows: 20 mg of the photocatalyst was mixed with 4 mL of absolute ethanol (Merck) and 20 L of Nafion solution (5 w/w in water, Alfa Aesar) to form a slurry.The slurry was drop casted on the conducting side of an FTO glass substrate with an active area of about 1 cm 2 .After that, the FTO was kept in an oven at 80 C overnight.The three-electrode configuration was made by immersing the working (FTO), counter (Pt wire), and reference (saturated Ag/AgCl) electrodes in the electrolyte (0.1 M Na 2 SO 4 , pH 6.67).A 300 W xenon lamp (Sciencetech, Canada) was used to simulate visible light to study the chronoamperometry or photo transient response, which was measured by applying a constant potential of 0.2 V. Potentioelectrochemical impedance spectroscopy (EIS) was also analyzed from 1 Hz to 900 kHz under a constant bias of 0.2 V and an (R1 C1) circuit was used to fit the data points.Lastly, a Mott-Schottky study was performed at the same bias voltage and the flat band potential was calculated at nearly 1 kHz frequency. In situ DRIFTS studies were performed on the as-synthesized catalyst at room temperature under a moist CO 2 gas atmosphere.All experimental conditions were kept the same for all the tested catalysts and each experiment was repeated to confirm the consistency in the spectral features.We used a Nicolet iS50 FTIR spectrometer equipped with a HARRICK Praying Mantis high-temperature reaction chamber.Liquid nitrogen cooled MCT-A (mercury cadmium telluride) was employed as a detector with a resolution of 4 cm -1 and over 32 scans.Absorbance data from the sample (in the dark and under light) were acquired in the wavenumber range of 4000- 650 cm -1 .The background spectrum was collected for KBr powder kept in the reaction chamber using 4 cm -1 resolution and 64 scans.Further, the photo-catalyst was diluted in KBr (75 mg) and placed inside the chamber.The mixture was heated to 150 C for 2 hours under vacuum to remove adsorbed contaminants/species.After cooling to 30 C, high-purity CO 2 (99.999 purity) gas was continuously fed through a water bubbler (kept at room temperature) into the cell at a flow rate of 5 ml min -1 for 15 minutes.Then, all inlet and outlet valves connected to the reaction chamber were closed and IR data were collected.The data were collected every 15 minutes until no change in spectral features was observed.Once saturation was achieved, the catalyst was illuminated with a 500 W Xe arc lamp and the spectra were collected every 15 minutes."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Fig. 1 shows a schematic for the synthesis procedure of catalysts and details are provided in the Experimental section.Both typical peaks of g-C 3 N 4 at 2 13(d-spacing 0.682 nm) and 2 27.5(d-spacing 0.326 nm) are observed in the X-ray diffraction pattern of B-CN Fig.2(a).As is known, the first peak of g-C 3 N 4 at 2 13corresponds to the (100) plane and originates from in-plane structural repeating nitride motifs. 26The second peak at 2 27.5isassigned to the (002) plane and the obtained diffraction is due to the average interlayer stacking of conjugated aromatic rings. 27With B doping, the (002) peak shifts towards a lower angle from 27.5to 27.2, which could be attributed to the substitution of C or N by B atoms 28 Fig.002) peak for B-CN as compared to that of CN indicates that B-CN is a poorly crystalline material with reduced crystallite size and has relatively more edge defects, which can provide additional sites for CO 2 photocatalytic reduction.Also, it can be seen that after loading of Fe or Cr on B-CN, the (100) peak of B-CN at 2 13disappeared.This indicates that the Fe and Cr species were embedded into the in-planes of B-CN and also more edge defects were generated that can facilitate the photocatalytic reduction of CO 2 by providing additional active sites.Using Scherrer's equation, the crystallite size of CN, B-CN, Fe,B-CN, Cr,B-CN and Cr,Fe (1 : 1)B-CN was calculated to be 8.21 nm, 2.55 nm, 1.55 nm, 3.74 nm and 1.86 nm, respectively Table 1.Apparently, the crystallite size of CN was reduced by about 3.2 times after doping with B atoms.Moreover, Cr-doped B-CN had better crystallinity than Fe-doped B-CN.Notably, no diffraction peaks corresponding to B, Fe, Cr or any other oxides could be detected using XRD technique owing to their low amount. Next, we employed FTIR to probe the chemical functionalization of as-synthesized catalysts and their spectra are compared in Fig. 2(b).Firstly, all characteristic vibrational signals of graphitic carbon nitride are present in the CN sample.For instance, signals at 1640 cm -1 , 1572 cm -1 , 1542 cm -1 , 1463 cm -1 , 1408 cm -1 , 1317 cm -1 , 1236 cm -1 , and 1206 cm -1 can be seen.Out of these, the peak at 1640 cm -1 can be assigned to the CN stretching vibration mode, while the remaining peaks are related to aromatic CN stretching vibration modes. 29Two obvious and sharp peaks at 890 cm -1 and 810 cm -1 are attributed to the deformation mode of cross-linked heptazine and characteristic breathing vibration of the triazine ring, respectively. 30,31The broad peak in the range of 3000-3500 cm -1 can be assigned to both the N-H stretching vibration of amino groups and the O-H vibration from adsorbed water on the surface. 32s shown in Fig. 2(b), there are some spectral changes for the B-CN sample.The corresponding IR spectrum reveals new but weak absorption peaks at 780 cm -1 , 1280 cm -1 , 1165 cm -1 , 1335 cm -1 and 1384 cm -1 for the B-CN sample, which can be ascribed to out-of-plane B-N-B bending vibration, 14 B-C stretching, B-N-O, 33 B-O -stretching vibration in BO 3 units, and B-N stretching vibration, respectively 34,35 Fig.S2, IR spectrum for B-CN.Such peaks validate the XRD result that some C or N was substituted by B atoms.However, the obtained peaks for the Fe,B-CN sample were identical to that of B-CN.Apparently, Cr,B-CN showed different spectral features than these samples.More NH 2 edge defects in the graphitic nitride framework were developed for Cr-doped samples, which led to a broad peak between the 3000-3500 cm -1 region.This region corresponds to -OH and -NH 2 stretching vibrations. 36Moreover, a new peak at 2164 cm -1 can be ascribed to -CO bond stretching 37 Fig.S3, IR spectrum for -CO bond stretching. Further, the BET surface areas were determined via nitrogen adsorption-desorption isotherms Table 1.As can be seen in Fig. 2(c), the isotherms for all as-synthesized catalysts are alike and can be categorized as type III with an H3 hysteresis loop; indicating the presence of slit-like pores.The pore-size distribution suggests that all catalysts are mesoporous and pores are primarily centered at ca. 30 nm Fig.2(d).Table 1 illustrates that the porous B-CN sample has a greater surface area (23.9 m 2 g -1 ) than the other catalysts, which could be attributed to the use of H 3 BO 3 for the synthesis of B-CN.Here, the synthesis procedure involves the thermal condensation of dicyandiamide, which requires a very high temperature.At such a temperature, H 3 BO 3 decomposes to give off steam and consequently increases the porosity of B-CN. 28However, the pore width and pore volume significantly decrease in B-CN, which could be attributed to the formation of aggregates of boron dopants on the surface of CN.After Fe and Cr-loading on B-CN, the surface areas and average pore volume of the resulting catalysts were significantly reduced.Such results could be attributed to the deposition of Fe and Cr aggregates on the available pores of B-CN. Next, an insight into the structural details of the assynthesized catalysts was obtained using HRTEM and SEM 3. Firstly, these results corroborate that B-CN was porous and of a layered structure.Evidently, the SAED pattern showed diffraction halation without apparent speckles, suggesting a low degree of crystallinity.Also, numerous pores were apparently seen on the SEM micrographs.Moreover, all elements (C, B and N) were uniformly distributed on the surface of the B-CN catalyst Fig.3(b).On the other hand, the Cr,Fe,B-CN sample showed a lot of lattice fringes and many clear sparkles and rings in the SAED pattern.According to HRTEM imaging, the lattice fringes with spacing (0.157 nm) correspond to the distance between the (0 1 8) lattice planes of Cr 2 O 3 Fig.3(c). 38A closer inspection of the SAED pattern reveals the presence of the (002) and (110) planes of g-C 3 N 4 and the (311) plane of Fe 2 O 3 . 39,40This sample was composed of agglomerated sheets with wide ranges of particle sizes having a low surface area (2.13 m 2 g -1 ), as evidenced by SEM.The elemental mapping in Fig. 3(d at 398.6 eV. 43Also, the N1s spectra show peaks at 401.1 eV and 399.8 eV, which can be assigned to ternary nitrogen N-(C) 3 and -NH, respectively. 444546 A high-resolution spectrum of B1s in B-CN is illustrated with three fitted peaks centered at 190.4 eV, 191.3 eV and 192.1 eV.Regarding this, Cholet et al. earlier reported that the peak at 190.4 eV can be ascribed to the sp 2 B-N bonds in h-BN. 47Another peak at 191.3 eV can be assigned to the B atoms in the BCN network, 48 and the last peak at 192.1 eV is attributed to BCN (H), where three N atoms surround boron. 49Based on the deconvoluted peaks for B1s, it is likely possible that one carbon atom of the graphitic carbon nitride structure was replaced by one boron atom; where the latter is surrounded by the N-(C) 3 . 50he core level XPS spectra of C1s, N1s, B1s, Fe2p and Cr2p for the Fe,Cr,B-CN sample are shown in Fig. 4(b).The C1s high-resolution XPS peaks from the sample were fitted into four components at 284.8 eV (CC), 286.2 eV (C-O), 288.1 eV (C-O) and 288.8 eV (OC-O). 51,52Next, the deconvolution of the N1s spectrum revealed peaks at 396.6 eV (N-H), 53 401.6 eV (graphitic N/N-H), 54 403.5 eV (-NO 2 ), 55 408.1 eV (O-NO 2 ) 56 and 412.5 eV (-N 2 O). 57The B1s spectrum exhibited two peaks fitted with Gaussian components.The first peak at 191.9 eV could be attributed to B-N 2 O, also suggested by Sediri et al. 58 Another peak at 198.6 eV corresponds to the characteristic lines for h-BN.On deconvolution of the Fe2p spectra, it is evident that two strong peaks at 710.5 eV (Fe 2p 3/2 ) 59 ) could be attributed to Fe 3 species. 6566667 Here, no metallic phase of iron is observed.Moreover, the observed binding energy difference between the Fe2p doublet spectra is 14.0 eV which is close to that in the previous report. 68Similarly, the deconvolution of the Cr2p spectra suggests that Cr exists in two different oxidation states, 3 and 6.The peak positions at 576.8 eV and 586.8 eV correspond to the splitting orbits of Cr2p 3/2 and Cr2p 1/2 , respectively, of the Cr 2 O 3 phase (Cr 3 ).The peaks at 578.2 eV and 588.2 eV are consistent with reported Cr in 6 state binding energies.Furthermore, the contents of different Cr species were calculated and it was found that the molar ratio of Cr 3 and Cr 6 was 58.07and 41.93, respectively. A photocatalyst with a lower band gap value and suitable band edge potentials is desirable for efficient CO 2 reduction by water.Hence, it becomes important to obtain information about these values.To begin with, the light absorption behavior of the as-synthesized catalysts can be understood from their UV-vis absorption spectra (shown in Fig. 5(a)), and the corresponding band gap energies (E g ) were calculated using the Tauc plot (plot of (ahv) 1/2 vs. hv) Fig.S5, Tauc plots. 69Apparently, the as-synthesized catalysts can absorb light in the UV-vis range.Interestingly, doping with elements has red-shifted the UV-vis absorbance spectra, which means a wide light absorption band ranging from 350 to 800 nm covering the entire visible light spectrum.Also, the band gap slightly decreased after doping with boron atoms.A significant decrease in band gap value can be observed after doping with Fe and Cr.The calculated band gap value for Cr, B-CN was 0.94 eV only, whereas that of CN was 2.67 eV.This infers that Cr,B-CN can absorb light even from the infrared region ( 1319 nm).Therefore, inclusion of Fe and Cr into B-CN is effective for visible-light response of the semiconductor. Primarily, there are two observations: first, doping with elements such as Cr,Fe in B-CN led to reduction in the band gap.Earlier, Wei et al. reported that the p-d repulsion of II-Fig.5 Optical properties of the as-synthesized catalysts.(a) UV-vis absorption spectra in the 350-800 nm range (band gap energies were calculated using Tauc plots (ahv) 1/2 vs. hv and provided in Fig. S5 ), (b) photoluminescence (PL) data suggest that recombination events were significantly reduced after Fe and Cr doping in the B-CN sample. excitation 360 nm.In particular, the Cr,B-CN sample showed a relatively larger decrease in band gap of B-CN than that of the Fe,B-CN sample owing to stronger p-d repulsion between B2p and Cr3d orbits. VI semiconductors can narrow the band gap by moving up the position of the valence band top. 23Notably, the p-d repulsion is inversely proportional to the difference between the orbital energy of the p and d orbitals.Obviously, the p-d repulsion becomes stronger for smaller differences in the orbital energy.The higher the repulsion, the lower the band gap.The orbital energy of B 2p (-0.2655 eV) and Cr 3d (-0.2148 eV) is very close, which results in higher p-d repulsion and thus a lower band gap can be expected.Second, the band gap energy for Fe E g 1.41 eV is relatively higher than that of Cr,B-CN E g 0.94 eV.This could be attributed to both the extent of p-d repulsion and to the difference in their crystallite sizes.As shown in Table 1, the crystallite size of Fe-is smaller than that of Cr,B-CN.Expectedly, a smaller crystallite size tends to increase the E g value owing to quantum confinement effects. 70Therefore, the combined effect of these two factors (p-d repulsion and quantum confinement effect) modulates the E g value for doped catalysts. It is important that the photo-generated e --h pairs are efficiently separated to exhibit high photocatalytic activity.Hence, we conducted the photoluminescence (PL) experiment for as-synthesized catalysts to investigate the separation efficacy and transfer behavior of charge carriers Fig.5(b).As is known, the PL emission stems from e --h pair recombination events, and a lower PL intensity means efficient separation of photo-generated e --h pairs.The result shows that PL emission peaks are centered at 440 and 440 nm for CN and B-CN, respectively.Out of these two, relatively lower recombination events occurred in the B-CN sample.Further reduction in the PL intensity was noticed for Fe-and Cr-doped B-CN samples.This also suggests that besides lowering the initial band gap, these catalysts also reduce recombination events, which could facilitate CO 2 photoreduction.The obtained PL result is in accordance with our XRD pattern Fig.2(a).As shown earlier, doping with B, Fe, and Cr reduced the crystallinity of CN, which indicates that a higher number of structural defects are generated in these doped samples or their combination.These structural defects inside photocatalyst could trap photogenerated e --h pairs and prevent them to recombine.Consequently, the obtained PL intensity for these samples is very small, which also suggest that the higher number of charge carriers could participate in and enhance the photocatalytic reduction of CO 2 . The photocatalytic performance of the as-synthesized catalysts was tested for gas-phase reduction of CO 2 in the presence of water.In the beginning, a set of controlled experiments was conducted in the absence of photocatalyst, light and CO 2 gas.In all these experiments, no reduction products (such as CH 4 and CO) were observed Fig.S6, GC results for blank experiments.However, these products were formed only when all the three components, i.e. photocatalyst, light, and CO 2 gas, were present.Such a set of reactions also verifies that these products were generated only via photocatalytic reduction steps.Additionally, these findings also infer that no adventitious hydrocarbon species deposited on the catalyst's surface was erroneously considered as a product.As is known, the photocatalytic reduction of water is relatively easier than that of CO 2 ; hence, it can be expected that hydrogen molecule should form as a product.However, no hydrogen molecules were detected by GC over all samples, which is consistent with the earlier reports. 71,72It seems that either the generated amount of hydrogen molecules was too low to be traced or that H radical or H proton formed during the reaction reacted with CO 2 to generate CO, CH 4 and other intermediates. Fig. 6(a) and (b) present the relative amounts of products (CH 4 and CO) for the as-synthesized catalyst formed after 4 h of continuous illumination of UV-vis light (here, 500 W Xe lamp).The CH 4 and CO formation rate of CN was 0.49 and 4.17 mol g -1 , respectively.These amounts were slightly increased for the B-CN sample.Interestingly, for Fe,B-CN, the amount of CH 4 was almost similar to that of B-CN but the CO amount was increased to 9.47 mol g -1 , more than twice that of the CN.The amount of CO formation was further improved by Cr,B-CN.However, for the Cr,B-CN sample, the observed CH 4 formation was reduced to 0.3817 mol g -1 .A similar behavior for product formation was noticed for the Cr,Fe,B-CN sample.For the Cr,Fe,B-CN sample, the obtained amount of CH 4 was similar to that of Cr,B-CN but the CO amount was considerably decreased to 7.84 mol g -1 . Fig. 6(c) illustrates the total consumed electron number (TCEN) for the as-synthesized catalysts.The TCEN can be calculated using eqn (1): where C CO and C CH 4 are the concentrations of CO and CH 4 , respectively.V reactor , m cat.and t irr.are the volume of the reactor, mass of the catalyst, and time of irradiation, respectively. As can be seen, doping of boron into CN has minimally improved the TCEN value.With the inclusion of Fe in B-CN, the TCEN value has further increased to 5.84 mol g -1 h -1 .A substantial increase in the TCEN value was observed for Cr,B-CN, 6.57 mol g -1 h -1 , which was 2.14 times that of CN (4.55 mol g -1 h -1 ).A higher TCEN value means that the catalyst should exhibit better photoactivity.Comparing the corresponding TCEN values of the as-synthesized catalysts, it is evident that Cr,B-CN could be an optimum photocatalyst.However, the TCEN value was significantly reduced when Cr and Fe at a 1 : 1 atomic ratio were introduced into the B-CN sample. Next, we calculated the selectivity of CO formation using eqn (2) 73 and the obtained values are illustrated in Fig.6(d) The calculated selectivity for the formation of CO was greater for all tested catalysts, which suggests that CO was the major product.Among the tested catalysts, CN and B-CN showed similar selectivity for CO formation, and excellent selectivity was obtained for Cr-doped samples Fig.6(d).On the other hand, selectivity for other products (e.g., CH 4 ) was poor for Cr,B-CN.Based on the amount of the evolved reduction products, the CO 2 conversion was determined.As shown in Fig. 6(d), CO 2 conversion was noticed to be 0.07, 0.08, 0.16, 0.18 and 0.13 for CN, B-CN, Fe,B-CN, Cr, B-CN and Cr,Fe,B-CN, respectively.Similar values for CO 2 conversion were earlier reported for other photocatalysts. 747557677 A high selectivity towards CO formation and comparable CO 2 conversion suggest that barely any hydrogen evolution sites were available on the surface of Feand Cr-doped B-CN samples.Next, the stability of the assynthesized catalysts was investigated for two cycles and the results are given in Fig. S7 amount of reduced products for two cycles.The results disclose that the amounts of reduced products were not decisively different during the second run.However, a slight difference could be attributed to the accumulation of intermediates over the surface of the catalyst after the first cycle. The chemical, microstructural and morphological stability of catalysts are important for their prolonged use.Regarding this, we characterized the spent catalysts using different techniques such as XRD, SEM and FTIR.Interestingly, the XRD diffraction of spent catalysts exhibits a slight change in the crystal structure; however, no new peaks and no shift in the peak positions as compared to the freshly prepared catalysts were observed Fig.S8-S10, spent catalyst: SEM, XRD, FTIR.This infers that no strain was developed inside the catalyst during the photocatalytic reduction process.Additionally, SEM micrographs suggested that the two-dimensional plate-like morphology remained intact after the reaction.Additionally, IR studies exhibit no apparent change in the spectral features of the spent catalysts, suggesting that the chemical structure remained unchanged after the reaction. Electrochemical impedance spectroscopy (EIS) and transient photocurrent response test were performed to examine the migration and recombination of charge carriers in the assynthesized catalysts Fig.7(a andb).As is known, a smaller arc radius in the EIS Nyquist plot suggests that the resistance to electron migration is lower and in such samples, charge carriers are efficiently separated. 78,79In Fig. 7(a), the arc size follows the order CN B-CN Cr,Fe,B-CN Fe,B-CN Cr, B-CN.Apparently, Cr,B-CN exhibited the smallest arc size and hence, charge carriers were readily available on its surface.On the contrary, recombination events dominated in the CN sample and consequently, fewer charge carriers were available for CO 2 photoreduction.These observations are also in accordance with the aforementioned PL results Fig.5(b).Fig. 7(b) presents the transient photocurrent response of the as-synthesized catalysts.Expectedly, under light illumination, all catalysts showed greater photocurrent than the CN sample.In particular, Fe-, Cr-and Fe,Cr,B-CN present almost identical current response, which is 2.0-and 2.6-fold that of B-CN and CN, respectively.This implies that photocatalysts other than CN have better capability to separate e --h pairs.Also, the photocurrent response remained unchanged even after several ON/OFF illumination cycles, indicating good photoelectrochemical stability for the tested catalysts.Notably, B-CN showed comparable photocurrent response to the CN just after the first cycle.Possibly, such a decay in photocurrent can be attributed to a reduction in carrier mobility and/or a reduction in the number of moving carriers within the B-CN sample.It is often believed that the carriers lose energy when they thermalize within their density of states, which leads to a decrease in their mobility. 80,81It may also be possible that these charge carriers become trapped inside the catalyst, which can cause a reduction in numbers of available charge carriers. 82,83Based on the electrochemical study, it can be concluded that the inclusion of Cr-and Feinto the B-CN sample significantly improved the separation and transfer efficiency of photo-generated charge carriers. As mentioned earlier, it is important to determine the band structure of the semiconductor for a clear understanding of the possible photocatalytic mechanism.Hence, we performed Mott-Schottky analysis for all the assynthesized catalysts Fig.7(c).Notably, all catalysts demonstrated a positive slope of 1/C 2 curves, indicating that these are n-type semiconductors.Additionally, the Mott-Schottky plots revealed that the conduction bands of CN, B-CN, Fe,B-CN, Cr,B-CN and Fe,Cr,B-CN are -0.92V, -0.86 V, -0.73 V, -0.74 V and -0.78 V, versus Ag/AgCl, respectively.These values were obtained from the intercept on the abscissa. 84,85Further, the potentials versus Ag/AgCl were converted to the normal hydrogen electrode (NHE) using the following eqn (3): where V o Ag/AgCl vs. NHE 0.197 at 25 C. 86Therefore, the calculated conduction bands of CN, B-CN, Fe,B-CN, Cr,B-CN and Fe,Cr,B-CN are -0.72 V, -0.66 V, -0.53 V, -0.54 V and -0.58 V, respectively Fig.7(d).Compared with CN, the flat potential is decreased after doping with elements.Further, we used eqn (4) to calculate the valence bands of the tested catalysts. where E g is the band gap energy and E CB and E VB are the conduction and valence band edge potentials.Hence, the calculated valence bands of CN, B-CN, Fe,B-CN, Cr,B-CN and Fe,Cr,B-CN are 1.95 V, 1.87 V, 0.88 V, 0.4 V and 0.46 V versus NHE, respectively Fig.7(d).Also, we examined the valence band maximum using VB-XPS technique and the results are provided in Fig. 7(e).Specifically, the obtained values are 1.9 V and 0.45 V for B-CN and Cr,Fe,B-CN, respectively.These values are in line with the Mott-Schottky results. In situ study of the photocatalytic reaction 3.6.1In situ ESR.In order to gain an insight into a plausible charge transfer mechanism, it is crucial to collect information about the unpaired electrons of the tested samples.Also, information about trapped electrons and holes can be obtained using ESR spectroscopy under light irradiation of different wavelengths.Hence, we performed an in situ ESR study in the dark and under light illumination at room temperature.The corresponding results are illustrated in Fig. 8.A single Lorentzian line centered at g 1.99 indicates the presence of free electrons in the B-CN sample Fig.7(a).Upon light irradiation, the same signal has increased and can be attributed to photo-excitation of electrons to its conduction band.As shown earlier in our XPS study, Fe exists as 3 and 2 oxidation states in the sample Fig.4(b).Compared to B-CN, Fe,B-CN showed a broad signal at g 2.04, assigned to trapped holes inside its lattices.Also, such a broad signal could be attributed to ferromagnetic resonance signifying the presence of unpaired electrons which can enhance the photocatalytic activity Fig.8(b). 87or the Fe,B-CN sample, the ESR study also illustrated an upsurge in intensity of the signal after light irradiation, indicating an increase in number of unpaired electrons.This could be attributed to direct transfer of electrons to Fe 3 /Fe 2 from the valence band of B-CN instead of the conduction band.On the contrary, a reverse phenomenon was observed As such, the broad signal suggests that the majority of chromium species are paramagnetic and present over the catalyst surface as clusters of oxides. 88As shown in the XPS data Fig.4(b), Cr exists as 3 and 6 states; however, it is worth noting that Cr 6 states are not visible by the ESR technique. 89otably, the reduction in intensity of the signal after light irradiation indicates a decrease in unpaired electrons for the Cr,B-CN sample.The decrease in intensity could be attributed to conversion of Cr 3 to Cr 2 Cr 3 e - Cr 2 by accepting photo-excited electrons from the B-CN host.A similar observation was earlier reported by Kumar et al. 90 In Fig. 8(d), ESR results are provided for the Cr,Fe,B-CN sample in the dark and under light.As can be seen, the broad signal has decreased after irradiation and could be attributed to easy transformation of Cr 3 to Cr 2 .As is known, Fe 3 species are more stable than Fe 2 owing to half-filled d-orbitals, which infer that the conversion of Fe 3 to Fe 2 , by accepting photo-generated electrons, is not preferred. 3.6.2In situ DRIFTS.Next, we employed in situ DRIFTS studies to obtain information about the surface reaction intermediates, as these species govern the photocatalytic activities.We noticed the transformation of these surface species to new reaction intermediates under UV-vis light illumination.Fig. 9 illustrates the IR spectra after adsorption of moist CO 2 gas and subsequent UV-vis illumination for B-CN and Fe,B-CN.All spectra were collected until no further changes were observed in the spectral features.Additionally, acquisition of spectral data for each catalyst was performed multiple times to ensure consistency in the obtained results. Fig. S10 depicts the change in IR spectral features after adsorption of moist CO 2 for 1 h of exposure time at room temperature.An apparent increase in the absorbance intensity at 1703, 1562, 1655 and 1433 cm -1 was observed for the B-CN sample after adsorption of moist CO 2 gas see Fig. 9(a).In particular, the peaks observed at 1703 and 1562 cm -1 can be assigned to bidentate carbonate (b-CO 3 ). 91,92 1655 cm -1 corresponds to bicarbonate, 93 and 1432 cm -1 indicates the presence of unidentate carbonate species. 91Under subsequent photoirradiation, the absorbance value of the whole spectrum increased.Additionally, several new peaks appeared at 1732, 1675, 1580, 1557, 1540, 1379 and 1267 cm -1 .Amongst these, the peaks at 1557 and 1267 cm -1 can be attributed to COO -. 92,94 Other peaks at 1540, 1379 and 1580 cm -1 can be ascribed to formate (HCOO -) species 959697 and the peak at 1675 cm -1 could be due to bicarbonate (HCO 3 -) species. 98Notably, methoxyl (CH 3 O ) species led to a peak at 1732 cm -1 . 99ased on the observed surface intermediates, it can be realized that photogenerated electrons reach the surface from within the B-CN sample and interact with moist CO 2 gas to form COO -.Consequently, already available surface species (before illumination) transform to HCOO -and CH 3 O groups following a two-electron two-proton reaction pathway CO 2 !2e -HCOOH !2e -HCHO !2e -CH 3 OH 12 , also suggested by others. 99,100imilarly, Fe,B-CN was also subjected to the same conditions inside the cell Fig.9(b).Fe,B-CN showed an increased absorbance value after adsorption of moist CO 2 over the surface and subsequent photoillumination.We observed an increase in the intensity of peaks at 1620, 1562 and 1510 cm -1 .Among these, the peak at 1510 cm -1 corresponds to unidentate carbonate species, 101 1562 cm -1 reflects b-CO 3 2-species 101 and 1620 cm -1 is due to the polydentate carbonate species. 99Also, new peaks at 1688 and 1680 cm -1 can be assigned to bridged carbonate (br-CO 3 2- ) species. 91,102Bicarbonate species were also present, as verified by peaks at 1395 and 1646 cm -1 . 91,103ignals corresponding to b-CO 3 2-were observed at 1703, 1486 and 1343 cm -1 . 91,103At 1543 cm -1 , unidentate carbonate species were found. 103After photoirradiation, the whole spectrum shifted towards a lower wavenumber and the new peaks were generated.The major new peaks at 1523 and 1750 cm -1 are of COO -, 102,103 another peak at 1732 cm -1 corresponds to CH 3 O , 99 peaks at 1540, 1618 and 1568 cm -1 can be ascribed to HCOO - (ref.99) and another peak at 1494 cm -1 is for HCHO. 104nterestingly, CO bond formation was also verified by the peak at 1720 cm -1 . 104The peaks at 1390 and 1480 cm -1 suggest the formation of C-H bonds. 98,104b-CO 3 2-species were also found at 1421 and 1655 cm -1 . 93,103As can be seen, all primary intermediates such as b-CO 3 2-, m-CO 3 2-and HCO 3 -were predominantly available on the surface of the catalyst.These intermediates involve in multi-step reactions to form methoxyl, formate, formaldehyde, bicarbonate and CO, which eventually leads to the formation of CH 4 . Depending on the experimental findings provided in the present work, we propose a plausible mechanism for the photocatalytic reduction of CO 2 by water over the tested catalysts.Firstly, a thin film of the as-synthesized catalysts was exposed to moist CO 2 atmosphere.Secondly, the film was allowed to achieve adsorption-desorption equilibrium in the dark and at room temperature.Next, visible light of sufficient energy (hv E g ) was irradiated over the catalyst surface; resulting in the generation of e --h pairs, which could participate in the redox reactions.As is known, the band edge positions of the photocatalyst greatly influence the possible redox reactions on the surface. CO, HCOOH and CH 3 OH could also contribute to the formation of CH 4 (as shown in (R11)). 108,109ig. 10(a) summarizes the overall mechanism for Fe,B-CN and Cr,B-CN samples.As shown, photo-excited electrons from the conduction band preferentially migrate to the transition metal doped into the B-CN catalyst.Owing to such migration of electrons to metal species, charge carriers are efficiently separated and, consequently, recombination events are drastically reduced see PL data, Fig. 5 , it is clear that the rate of CH 4 formation was lower for Cr,B-CN than for Fe,B-CN and the reverse was observed for the formation rate of CO, which strongly indicates the significant role of trapped electrons and holes in their respective lattices.For Cr,Fe,B-CN, the combined effect of trapped holes and electrons can be explained for the obtained lower formation rate of both products (CO and CH 4 )."
  },
  {
    "title": "Conclusions",
    "content": "In essence, we strategically doped Fe and Cr into the B-CN sample to enhance visible-light absorption and reduce the recombination events.Such results were attained mainly due to the strong p-d repulsion for Cr and Fe in the B-CN sample.Consequently, CO 2 reduction by water was proven to be possible.Specifically, the total consumed electron number (TCEN), a measure for photoactivity, was increased by 2.14 times for Cr-doped B-CN than that of CN.Moreover, the selectivity for CO was also increased for transition metal-doped samples.XPS study revealed that Fe was in the 2 and 3 oxidation states; while Cr was in 3 and 6 states.Mott-Schottky analysis suggested that all the as-synthesized catalysts were n-type semiconductors.Also, transient photocurrent response demonstrated that all photocatalysts were stable and their corresponding band energy diagram was subsequently investigated, which validated the possibility of a multi-electron and multi-proton pathway for product (CO, CH 4 ) formation.To gain an insight into the reaction steps and intermediates, several in situ characterization techniques such as ESR and DRIFTS were employed.The results indicated that COO -formed as an active intermediate, which initiated several reactions to eventually form CO and CH 4 .Upon photoillumination, the IR intensity of HCO 3 -species (at 1654 cm -1 ) was increased and it could be regarded as a possible intermediate for CH 4 production.Additionally, we identified the dual role of trapped charge carriers in enhancing the charge separation and governing the product distribution for the tested catalysts.Therefore, the current study has successfully demonstrated a promising strategy to synergistically use the strong p-d repulsion between metal and non-metal elements on a host photocatalyst to extend the visible-light absorption range, which will enhance selectivity and yields of products. Fig. 1 Schematic for the synthesis procedure of B-CN, Fe,B-CN and Cr,B-CN using different precursors.The process also involves calcination at a later stage. Fig. 2 (a) XRD pattern of tested catalysts.Of the two typical peaks (i.e. at 2 13and 2 27.5) of g-C 3 N 4 , the peak at 2 13disappeared after transition metal doping, inferring successful insertion of these metals into the in-planes of B-CN.(b) FTIR spectra for as-synthesized catalysts show no distinct changes in signal positions.Notably, the Cr-doped catalyst shows different spectral features and could be attributed to a higher number of -NH 2 edge defects.A new peak at 2164 cm -1 can be ascribed to -CO bond stretching.(c) The nitrogen adsorption/desorption isotherms acquired at -196 C showing a typical type III isotherm and a standard H3-type hysteresis loop for all the catalysts.(d) The pore sizes are normally distributed for the tested catalysts. Fig. 3 HRTEM, SEM and EDX mapping for (a and b) B-CN and (c and d) Cr,Fe,B-CN.The TEM and SEM images disclose the presence of pores in the B-CN structure.The results show uniform elemental distribution over the surface of both catalysts.In particular, the amorphous nature of the B-CN sample was apparent from the HRTEM and SAED images.On the other hand, Cr,Fe,B-CN reveals the presence of the crystalline (018) plane of Cr 2 O 3 and the (311) plane of Fe 2 O 3 on the catalyst surface. Fig. 4 High-resolution XPS spectra for (a) elements (C1s, N1s, B1s) in B-CN.The results showed that B atoms replace some of the C and N to form B-N and B-C bonds in the B-CN sample.(b) Elements (C1s, N1s, B1s, Fe2p, Cr2p) in Cr,Fe,B-CN.The Fe2p core spectrum revealed that Fe exists in the 2 and 3 oxidation states.Similarly, deconvolution of the Cr2p spectrum suggested the presence of Cr in the 3 and 6 states. and 724.2 eV (Fe 2p 1/2 ) corresponding to Fe 2 (ref.60-62) were present.Additional peaks at 713.4 eV (ref.63) and 727.3 eV (ref.64 Fig. 6 Formation rates (mol g -1 ) of (a) CH 4 and (b) CO.(c) The total consumed electron number (TCEN) data, (d) CO selectivity () and CO 2 conversion () data, compared for the as-synthesized catalysts, i.e.CN, B-CN, Fe,B-CN, Cr,B-CN and Cr,Fe,B-CN, after 4 h of illumination at room temperature.Reaction conditions: catalysts 25 mg; photoreactor volume 175 ml; room temperature, 4 h, moist CO 2 atmosphere; light source: 500 W Xe arc lamp.Generation of CO 2 reduced products (CH 4 and CO) increased after doping with Fe and Cr into the B-CN sample.Between these two, the Cr-doped sample showed a higher CO 2 conversion. Science Technology Paperfor the Cr,B-CN sample, where the ESR signal dampened after light irradiation Fig.8(c).Here, a broad signal at g 1.98 was observed and can be ascribed to trapped electrons. Fig. 7 (a) EIS Nyquist plots (in the dark).(b) Photocurrent responses under UV-vis light illumination on/off cycles.The number of on/off cycles was five, each for 20 seconds.Light source: 300 W Xe arc lamp.(c) Mott-Schottky plots based on the results of the impedance measurements to determine the flat potentials of semiconductors three electrode configurations were used, where the sample was coated on FTO as a working electrode, Pt wire as a counter electrode, and Ag/AgCl as a reference electrode.All three electrodes were immersed in 0.1 M Na 2 SO 4 (pH 6.67).(d) A schematic illustration of the band structures for the as-synthesized catalysts.The energy band alignment suggests that the flat potential decreased after doping, but the obtained value was still higher to thermodynamically favor the reduction of CO 2 to CO and CH 4 .(e) Valence band maximum for B-CN and Cr,Fe,B-CN samples. Fig. 8 In situ ESR spectra of (a) B-CN, (b) Fe,B-CN, (c) Cr,B-CN and (d) Cr,Fe,B-CN.The experiments were carried out at room temperature under UV-vis light illumination and also in the dark.Corresponding spectra were acquired for each catalyst.Upon light illumination, the spin intensity significantly increases for B-CN, indicating the excitation of electrons to its conduction band.Similar behavior was observed for Fe,B-CN and could be attributed to direct transfer of electrons to Fe 3 /Fe 2 from the valence band of B-CN.However, Cr,B-CN showed a reverse behavior under light illumination.The observed decrease in intensity could be due to conversion of Cr 3 to Cr 2 Cr 3 e - Cr 2 by accepting photo-excited electrons from the B-CN host. Fig.9In situ DRIFTS spectra in the 1800-1200 cm -1 range for (a) B-CN and (b) Fe,B-CN.The samples were subjected to a moist CO 2 gas stream for 1 h and subsequently illuminated for 1 h at room temperature.The result depicts that primary intermediates such as b-CO 3 2-, m-CO 3 2-and HCO 3 -were predominantly available on the surfaces of both catalysts.Upon illumination, these species involve in multi-step reactions by accepting electrons and protons to form active intermediates such as COO -, CHO and CH 3 O . (b).It is worth noting that surface electrons are first consumed by CO 2 to form the active species CO 2 -which then accepts protons (H ) to form CO and CH 4 .As mentioned earlier, these metal species act as trapping centers of charge carriers, i.e. electrons and holes Fig.10(b).These trapping sites play a dual role in enhancing the charge separation and governing the product distribution for the tested catalysts.In Fig. 6(a and b), varying formation rates of product distribution can be observed for the tested catalysts and hereby we explain the possible reason.For instance, some holes are trapped inside the lattice of Fe,B-CN, as indicated by the corresponding in situ ESR spectroscopy result Fig.8(b) and shown in Fig. 10(b).These trapped holes prolong the lifetime of photogenerated electrons and also prevent the reaction product (i.e., CO) from being re-oxidized to CO 2 .In contrast, electrons were found to be trapped inside the lattice of Cr,B-CN Fig.8(c).These trapped electrons hinder the electron transfer to CO 2 .Due to the limited availability of free surface electrons, formation of CH 4 via (R10) was considerably suppressed, which requires eight electrons.From the formation rate of CO and CH 4 see Fig. 6(a and b) Crystallite sizes and textural properties of the as-synthesized catalysts.Here, the B-CN sample exhibited the highest surface area; however, the area was considerably reduced after inclusion of Fe and Cr into the B-CN network.Compared to the B-CN sample, the crystallinity was improved for the Cr,B-CN sample but decreased for Fe,B-CN Published on 23 March 2020.Downloaded by University of Reading on 4/8/2020 6:46:32 PM.View Article Online W Xe arc lamp.Generation of CO 2 reduced products (CH 4 and CO) increased after doping with Fe and Cr into the B-CN sample.Between these two, the Cr-doped sample showed a higher CO 2 conversion. (d) A schematic illustration of the band structures for the as-synthesized catalysts.The energy band alignment suggests that the flat potential decreased after doping, but the obtained value was still higher to thermodynamically favor the reduction of CO 2 to CO and CH 4 .(e) Valence band maximum for B-CN and Cr,Fe,B-CN samples. Acknowledgements S. K. acknowledges the Indian Institute of Technology Patna (IIT Patna) for financial support and for providing instrumental facilities required to perform this work.N. O. and A. B. greatly appreciate IIT Patna for their research fellowships.The authors are also grateful to the editor and reviewers for their constructive remarks which have significantly helped to improve the manuscript. , which is considered as an active intermediate for subsequent reduction steps.This reaction is widely recognized as a ratedetermining step owing to its very negative equilibrium potential of -1.9 V versus NHE. 105Here, we observed the formation of CO 2 -on the catalyst surface, which was confirmed by the IR peaks at 1523 and 1477 cm -1 .A peak corresponding to CO was also noticed for the Fe,B-CN sample at 1718 cm -1 , which could possibly originate via several ways, e.g.(R7)-(R9). 106Notably, (R7) and (R8) require a H ion, which could be obtained from oxidation of water (R5).Meanwhile, photoillumination apparently induced higher formation of bicarbonate species (1654 cm -1 ) via (R6).Also, the IR spectral features of both catalysts revealed the same results Fig.9 There are no conflicts to declare."
  }
]