[
  {
    "title": "Doi",
    "content": "10.15541/jim20200142"
  },
  {
    "title": "Article_Title",
    "content": "Bi-doped Ceria with Increased Oxygen Vacancy for Enhanced CO<sub>2</sub> Photoreduction Performance"
  },
  {
    "title": "Abstract",
    "content": "Oxygen vacancy plays an important role in promoting CO 2 adsorption and reduction on photocatalysts.Bi was heavily doped into ceria, forming a solid solution catalyst Ce 1-x Bi x O 2- meanwhile maintaining the fluorite structure, to increase the oxygen vacancy concentration.The sample Ce 0.6 Bi 0.4 O 2- showed the highest photocatalytic activity with a CO yield of 4.6 times that of the pristine ceria nanorods.Bi was homogeneously dispersed into the fluorite ceria which was confirmed by XRD and EDX elemental mapping.It has been evidenced by the results of Raman and XPS that Bi introduction boosts the concentration of oxygen vacancy in the solid solution that can facilitate the adsorption/activation of carbonate and bicarbonate intermediates on its surface according to in-situ FT-IR."
  },
  {
    "title": "Experimental",
    "content": "Samples were synthesized by a facile one-step hydrothermal process at controlled conditions.Typically, a certain amount of Ce(NO 3 ) 3 6H 2 O and Bi(NO 3 ) 3 5H 2 O were dissolved in diluted nitrite acid (HNO 3 , 5 mL, 4 mol/L) by sonication before the dropwise addition of 8 mol/L aqueous solution of NaOH (35 mL) while stirring.This mixture was kept stirring for 30 min till the formation of a gelatinous suspension and then transferred into a 50 mL Teflon-lined autoclave within a stainless-steel tank and placed at 100 C for 24 h.The obtained samples were rinsed in deionized water and washed with anhydrous ethanol for several times.Then the powder was oven-dried overnight in vacuum at 60 C.The samples were denoted as Ce 1-x Bi x O 2- , where x represents the molar ratio of Bi/(CeBi).The sample synthesized with Ce(NO 3 ) 3 5H 2 O (1.5 g) as the sole precursor under the same conditions was named as CeO 2 . X-ray diffraction patterns (XRD) of the samples were recorded on Rigaku D/Max 2200PC X-ray diffractometer.The measurement was operated at room temperature under Cu K radiation with a scanning rate of 4 ()/min.A JEM-2100F field emission transmission electron microscope (TEM) (200 kV) was used to obtain the TEM image.Ultraviolet visible (UV-Vis) absorption spectra (800 nm to 200 nm) were recorded by a UV-3101 PC Shimadzu spectroscope (BaSO 4 as the reference standard material).Electron paramagnetic resonance (EPR) spectra were obtained from a Bruker EMXplus (Germany) spectrometer at 90 K. X-ray photoelectron spectra (XPS) were obtained on a Thermo Scientific ESCALAB 250 spectrometer with multichannel detector, Al K radiation as excitation source, and C1s at 284.6 eV as a signalcalibrating standard of binding-energy values.Time-resolved fluorescence spectra were tested on an Edinburgh Instruments FLS920 spectrometer under 420 nm excitation of deuterium lamp.DXR Raman microscope was used to obtain Raman spectra under the excitation of 532 nm.In-situ Fourier transform infrared (FT-IR) spectra were collected in N 2 and CO 2 , respectively, on Nicolet iS10 equipped with MCT detector.The catalyst was swept by N 2 for 1 h and stabilized for 1 h before the FT-IR spectrum was collected and saved as background data.Subsequently, the catalyst was swept by CO 2 for 1 h and stabilized for 1 h.Then the in-situ FT-IR spectra were recorded at different time intervals since the beginning of light irradiation. Electrochemical measurements were conducted on a CHI660A electrochemical workstation (Shanghai Chenhua, China) with a standard three-electrode system.Fluorine-doped tin oxide (FTO) glass deposited (15 mm 25 mm) with photocatalyst as the working electrode, platinum wire and Ag/AgCl as counter electrode and reference electrode, respectively.The electrolyte was 0.2 mol/L Na 2 SO 4 aqueous solution.The preparation process of working electrodes by electrophoretic deposition was as follows: sample powder (20 mg) and iodine (10 mg) were mixed and well milled in an agate mortar then well-dispersed in acetone (30 mL).Thus, the plating solution was obtained.A thin film of the sample was uniformly deposited on FTO with a potentiostat bias of 10 V for 10 min and then calcined in an oven at 150 C for 2 h.During the electrochemical measurement, the coated area of all samples was controlled at 1 cm 2 .Mott-Schottky plots were obtained by impedance-potential tests at the frequency of 1000 Hz with a voltage amplitude of 10 mV.Nyquist plots were tested in dark at a bias voltage of -0.4 V vs Ag/AgCl electrode.With irradiation from a 300 W Xe arc lamp, the transient photocurrent densities were obtained at 0.3 V versus Ag/AgCl electrode. The light source was a 300 W Xenon arc lamp from Aulight CEL-HX, Beijing, the light intensity of which tested on the position of catalyst was 210 mW/cm 2 .The gas products (CO, CH 4 ) were analyzed by GC-2014 gas chromatograph (flame ionization detector, FID) equipped with a 0.5 nm molecular column and a TDX-01 packed column.The photocatalysis test was conducted typically as follows: 50 mg of photocatalyst was uniformly dispersed on a 2.5 cm 2.5 cm glass at the bottom of a 625 mL sealed glass reactor.The temperature of the reactor was kept at 15 C with cooling water circulation.To exclude possible influence of contaminants, the sealed reactor was filled with N 2 and subjected to the irradiation of Xe lamp for 2 h before CO 2 (99.99 of purity) moisturized by a water bubbler was pumped into the reactor and stabilized for 30 min.During the photoreaction, 1 mL of sample gas was continually extracted from the reactor every 1 h and analyzed on GC according to external standard method.Before each activity (or cycle) test, the photocatalyst was firstly heat-treated at 150 C for 2 h, so as to remove the organic impurities and adsorbed carbon species."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Improved photocatalytic activity of Ce 1-x Bi x O 2- in CO 2 reduction reaction A series of Ce 1-x Bi x O 2- (x0, 1, 2, 3, 4, 5) samples were synthesized by co-precipitation method and all catalysts were tested for gas-solid phase CO 2 reduction in sealed glass reactor under the conditions of 15 C, 110 5 Pa.CO was the main product with trace CH 4 detected.Controlled experiments without light irradiation, CO 2 , or photocatalysts were conducted, in which no CO was detected, proving that CO was derived from CO 2 photoreduction.As displayed in Fig. 1, with the increase of Bi content, the catalytic performance of the samples improves.Ce 0.6 Bi 0.4 O 2- shows the highest activity in CO 2 photoreduction with a CO yield of 0.5 molg -1 h -1 under Xe light irradiation, which is 4.6 times of that on CeO 2 . XRD patterns (Fig. S1) show that the Ce 1-x Bi x O 2- solid solution samples prepared in this work maintained the fluorite cubic structure of ceria (JCPDS 34-0394).With Bi content ranging from 10 to 50, all peaks broaden and shift slightly towards small angle, which indicates that adding Bi into ceria increased the lattice parameter.The morphology of the as-prepared ceria and Ce 0.6 Bi 0.4 O 2- were further characterized by TEM (Fig. 2).Pure ceria shows the morphology of granite nanorods, 100-300 nm in length and 12-20 nm in diameter (Fig. 2(a)) while Ce 0.6 Bi 0.4 O 2- is in the form of nanocubes with particle size of 35 nm (Fig. 2(b)).The substitution of Ce 4 atom with Bi 3 distorted the crystal structure and changed the crystal growth behavior, leading to surface reconstruction and defects, which can be confirmed by the bright spots observed in Ce 0.6 Bi 0.4 O 2- nanocubes 10 .Fig. 2(c ).Through the comparison of these two characteristic peaks (v 1 and v 2 ) corresponding to Ce 3 , especially against the concurrent decrease of the two adjacent peaks(u 1 and u 2 ) of Ce 4 , we are convinced of that, with the introduction of Bi into ceria lattice, Ce 3 increases in Ce 0.6 Bi 0.4 O 2- 3 .While in Fig. 3(b), the representative core level Bi4f spectrum shows that Bi 3 exists exclusively in nanocrystalline solid solution Ce 0.6 Bi 0.4 O 2- 10 .Two highly symmetric peaks are located at 158.8 eV for Bi 4f 7/2 and 164.1 eV for Bi4f 5/2 , which agree well with those observed in standard bismuth oxides 11 .This result combined with those of XRD and TEM demonstrates that Ce atoms have been successfully substituted by Bi atoms in CeO 2 lattice and a solid solution catalyst has been formed. The O1s spectra of the samples (Fig. 3(c)) can be deconvoluted into three peaks.For CeO 2 , the two peaks at 529.2 and 529.7 eV are assigned to lattice oxygen , respectively 2 .The peak at 531.6 eV is ascribed to adsorbed oxygen species (O ad ) 1213 .It is noted that there is slight band shift of O ad to lower binding energy in the O1s spectra of Ce 0.6 Bi 0.4 O 2- than in CeO 2 and the signal increases, suggesting the adsorbed H 2 O and CO 2 are more easily to get electrons from the surface of Ce 0.6 Bi 0.4 O 2- , that is, are more readily to be activated on the reactive sites after the introduction of O vs together with Bi.The O ad content calculated from peak area, which is proportional to that of O v , is 44, much higher in Ce 0.6 Bi 0.4 O 2- than 34 in CeO 2 .This means our intention of modulating O v content by Bi-doping is feasible. In the Raman spectra (Fig. 3(d)), CeO 2 and Ce 0.6 Bi 0.4 O 2- exhibit distinct vibrational bands at 350-650 cm -1 .For pristine CeO 2 , the band at 455 cm -1 is ascribed to the F 2g vibration mode of CeO 2 fluorite while the weak signal at about 600 cm -1 is related to the intrinsic O vs due to the existence of Ce 3 14 .Compared with pure CeO 2 , major differences appear in the Raman vibration modes of Ce 0.6 Bi 0.4 O 2- in that the F 2g band shifts to low frequency (about 450 cm -1 ) and slightly broadens.This phenomenon is explained as that the symmetrical stretching vibration of CeO 8 unit is distorted by Bi doping.The second vibration mode of Ce 0.6 Bi 0.4 O 2- located at 525 cm -1 can be indexed to the presence of Bi 3 .More importantly, the signal around 585 cm -1 , which is related to extrinsic O vs that serve as charge-compensating defects, is significantly strengthened 151617 .Here, it can be concluded that Bi doping in CeO 2 has boosted the presence of O vs .For Ce 0.6 Bi 0.4 O 2- , the half-width at half-maximum (HWHM) at 450 cm -1 is 29.8 cm -1 , based on which the intrinsic O vs concentration is calculated to be 2.3410 21cm -3 .It is higher than that of the pristine CeO 2 (2.1010 21 cm -3 ).This can be also verified by the enhancement of EPR signal at g-value of 2.003 corresponding to O vs of Ce 1-x Bi x O 2- compared with that of CeO 2 in Fig. S2.In following discussions, corresponding implications on the catalytic activity of the solid solution catalyst will be illustrated from aspects including visible light absorption, electrochemical performance and CO 2 adsorption/activation. UV-Vis diffuse absorbance spectra of all the samples were recorded as displayed in Fig. S3.Compared with pure ceria, all Ce 1-x Bi x O 2- solid solution samples show enhanced and red-shifted absorption.Among them, samples Ce 0.6 Bi 0.4 O 2- and Ce 0.5 Bi 0.5 O 2- show the strongest UV-visible light absorption that extends from 380 nm to around 500 nm.The result and the yellow color of the solid solution catalyst (pure ceria is white) indicate that the introduction of Bi can successfully extend the light response to UV-visible region, which can be attributed to the defect energy level generated from the increased O v concentration.Based on the UV-Vis diffuse absorbance spectra and Kubelka-Munk equation 18 for indirect gap semiconductors, the bandgaps of pure ceria and Ce 0.6 Bi 0.4 O 2- were estimated to be 3.1 and 2.6 eV, res-pectively.This bandgap narrowing caused by Bi incorporation and O v can initiate the effective visible light induced photocatalytic CO 2 reduction reaction. To better understand the influence of Bi doping on the energy band structure of the solid solution catalyst, the Mott-Schottky plots of CeO 2 and Ce 0.6 Bi 0.4 O 2- electrodes were analyzed, both of which are S-type curves of n-type semiconductors (Fig. S4(a)).The flat band potentials (V fb ) were estimated from the linear part of the plots as -0.59 and -0.48 V vs Ag/AgCl electrode for CeO 2 and Ce 0.6 Bi 0.4 O 2- , respectively.According to literature, the conduction band potential (E cb ) of one n-type semiconductor is 0-0.2V more negative than its V fb , depending on carrier concentration and effective mass of electron.Here, the potential difference is set as 0.1 V. Based on this result, the band structure can be reasonably estimated in which a downshift of E cb (from -0.7 V of CeO 2 to -0.6 V of Ce 0.6 Bi 0.4 O 2- ) and an upshift of E vb (from 2.4 V of CeO 2 to 2 V of Ce 0.6 Bi 0.4 O 2- ) are clearly illustrated.This band narrowing happens when the Bi6p and Bi6s orbits participate in the construction of CB and VB, respectively 12 . EIS Nyquist plots of the as-obtained samples in dark demonstrate that Ce 0.6 Bi 0.4 O 2- is much more conductive than CeO 2 (Fig. S4(b)).This is because that ceria is a kind of good ion conductive solid electrolyte and O v can promote ion transportation 13 and thus endows the Ce 0.6 Bi 0.4 O 2- solid solution catalyst better conductivity which could efficiently promote the separation and interfacial transmission of photoexcited carriers.As a result, the photocurrent response of Ce 0.6 Bi 0.4 O 2- nearly triples over that of CeO 2 (Fig. S5).4(a,b), respectively.Similar modes of carbonate signals after humid CO 2 sweeping can be observed on the surface of the catalysts, with those of Ce 0.6 Bi 0.4 O 2- more intense 14 .Specifically, the band at 1700 cm -1 corresponds to bicarbonate (HCO 3 -) 15 .The bands at about 1510 and 1380 cm -1 are assigned to mono-dentate carbonate (m-CO 3 2-) 16 .The bands at about 1337 and 1422 cm -1 correspond to bidentate carbonate (b-CO 3 2- ) 17 .The peaks at about 1255, 1610 and 1650 cm -1 are assigned to the bending vibration of carboxylate (COO -) 18 while the bands at about 1550 and 1200 cm -1 are ascribed to COOH.The existence of -CO 3 2-is due to the formation of carbonic acid and the adsorbed CO 2 on the catalyst surface 2 . After Xe light irradiation, the in-situ FT-IR spectra of CeO 2 and Ce 0.6 Bi 0.4 O 2- were collected and shown in Fig. 4(c,d), respectively.Over irradiation time, the clear increase and decrease of signals that is corresponding to the generation and consumption of the adsorbed intermediates on the surface of Ce 0.6 Bi 0.4 O 2- emerges while those on CeO 2 remain indiscernible.The aforementioned IR bands of both adsorbates and intermediates emerging between 1650 and 1200 cm -1 show obvious increase with prolonged irradiation time.These observations can be ascribed to the fact that the O vs could stabilize the carbonate radicals and increase their concentration on the catalyst surface by promoting charge separation and transfer to the adsorbed intermediates 1920 .According to literature 21 , the rate limiting step of CO 2 conversion to CO is the conversion of COOH to CO, which means the stabilized intermediates, including COOH, cannot be readily converted to final products and explains the increase of enhanced signal of intermediate carbonates.In contrast, the peak at 1700 cm -1 corresponding to HCO 3 -remains unchanged under irradiation.This indicates that bicarbonate plays a different role from other adsorbates that have signals between 1650 and 1200 cm -1 .Recent reports 2223 using operando ATR-SEIRAS discussed the effects of bicarbonate in liquid-solid interface reduction of CO 2 , that is, the majority of CO 2 reactant near the catalyst surface originates from an equilibrium reaction with HCO 3 -rather than direct adsorption from the solution.Although there is still controversy in the process of CO 2 reduction 24 , here based on our in-situ FT-IR results, it is reasonable to propose that in a gas phase reduction of CO 2 in the presence of H 2 O vapor, CO 2 and surface adsorbed H 2 O form HCO 3 -and release active species (denoted as init -in Eq. 1) participating in CO 2 reduction reaction 25 .The surface concentration of HCO 3 -in the equilibrium does not increase because CO 2 pressure can be seen as constant.This is consistent with the photocatalytic activity test in which Ce 0.6 Bi 0.4 O 2- shows much higher photocatalytic performance than CeO 2 (Fig. 1). CO 2 (gas)H 2 O ad HCO 3 ad H init -(Eq. 1) With the characteristic in-situ FT-IR bands and time related changes under irradiation, we proposed a pre-adsorption process that may shed new light into the mechanism of CO 2 photoreduction (Fig. 5) 26 .It is also evidenced that the introduction of Bi has created more O vs and formed localized electrons, which show significant"
  },
  {
    "title": "Conclusions",
    "content": "In this work, Bi 3 with a lower valence and similar ion radius compared to Ce 4 has been doped into ceria forming a solid solution photocatalyst, from which it is concluded that: 1) Bi 3 doping successfully introduced O vs into ceria while maintained its fluorite structure, thus the simultaneous introduction of defects as recombination sites of charge carriers could be effectively avoided; 2) The solid solution catalyst showed obviously improved CO 2 photocatalytic reduction activity with a CO yield 4.6 times of that on pure ceria; 3) The favorable effects of O vs and surface localized electrons on the adsorption/activation behavior of CO 2 on the catalyst surface and the separation/transfer of photoexcited carriers have been disclosed; 4) Doping aliovalent heteroatoms into metal oxide semiconductors to form solid solution catalysts is an effective way to introduce O vs and promote photocatalytic activity. Fig. 1 Time-dependent CO evolution over CeO 2 , Ce 1-x Bi x O 2- and Bi 2 O 3 ) shows that O, Ce, and Bi distribute homogeneously in the Ce 0.6 Bi 0.4 O 2- sample.No segregation has been observed and a solid solution catalyst can be identified.To further probe the chemical and compositional differences Bi doping induced, XPS spectra were collected to analyze the chemical states of Ce, Bi and O on the surface of CeO 2 and Ce 0.6 Bi 0.4 O 2- samples.There are multiple peaks in the Ce3d XPS spectra (Fig. 3(a)).Both CeO 2 and Ce 0.6 Bi 0.4 O 2- show eight major characteristic peaks located at 917.9, 916.6, 907.2, 900.7, 898.5, 889.7, 886.5 and 882.3 eV (spin-orbit splitting peaks), which are uniquely attributed to Ce 4 , thus the main valence state of Ce can be identified as 4.The presence of Ce 3 can be also distinguished in both CeO 2 and Ce 0.6 Bi 0.4 O 2- by the peaks at 902.5 and 884.2 eV(denoted as v 1 and v 2 Fig. 3 High resolution XPS spectra of (a) Ce3d, (b) Bi4f, (c) O1s on the surface of Ce 0.6 Bi 0.4 O 2- and (d) Raman spectra of CeO 2 and Ce 0.6 Bi 0.4 O 2- probe into the catalytic mechanism of CO 2 photoreduction on Ce 0.6 Bi 0.4 O 2- Based on the electronic structure estimation, a possible CO 2 photoreduction mechanism is proposed in Fig. 5.To further understand the origin of enhanced CO 2 photocatalytic reduction activity of the solid solution catalyst, in-situ FT-IR spectroscopy was used to investigate the adsorption, activation, and conversion process of CO 2 on Ce 0.6 Bi 0.4 O 2- and CeO 2 .The in-situ FT-IR spectra of CO 2 adsorption on CeO 2 and Ce 0.6 Bi 0.4 O 2- swept by humid CO 2 and stabilized for 1 h were collected and shown in Fig. Fig. 4 In-situ FT-IR spectra of CO 2 adsorption on the surface of (a) CeO 2 and (b) Ce 0.6 Bi 0.4 O 2- (the spectra of the samples swept by N 2 for 1 h as the background); In-situ FT-IR spectra of CO 2 photoreduction on (c) CeO 2 and (d) Ce 0.6 Bi 0.4 O 2- at different irradiation time (The spectra collected at 0 min of irradiation in humid CO 2 as background) Fig. 5 Scheme of the possible mechanism of CO 2 reduction on Ce 0.6 Bi 0.4 O 2- benefit on the adsorption/activation behavior of CO 2 on the surface of the solid solution catalyst and promote the CO 2 photocatalytic activity of the catalyst. Fig. S4 (a) Mott-Schottky plots and (b) Electrochemical impedance spectroscopy (EIS) Nyquist plots (-0.4 V (vs Ag/AgCl), in dark) of CeO 2 and Ce 0.6 Bi 0.4 O 2- Supporting materials related to this article can be found at https://doi.org/10.15541/jim20200142."
  }
]