[
  {
    "title": "Doi",
    "content": "10.1166/jnn.2017.13078"
  },
  {
    "title": "Article_Title",
    "content": "Synthesis of Different Shapes ZnFe<sub>2</sub>O<sub>4</sub>–BiOCl Nanocomposites for Photocatalytic Reduction of CO<sup>2</sup> in Cyclohexanol"
  },
  {
    "title": "Abstract",
    "content": "Nanosheet and hierarchical microsphere nanostructures of ZnFe 2 O 4 -BiOCl nanocomposites with various ZnFe 2 O 4 contents were prepared through hydrothermal deposition method.The morphology and structure of the as-prepared samples were systematically characterized by field emission scanning electron microscopy, transmission electron microscopy, X-ray diffraction, X-ray photoelectron spectroscopy, UV-vis diffuse reflectance spectroscopy, Brunauer-Emmert-Teller method, and photoluminescence spectra.The photocatalytic activities of the two different shapes of ZnFe 2 O 4 -BiOCl composites have been evaluated by photocatalytic reduction of CO 2 in cyclohexanol under UV light irradiation.The results showed that cyclohexanol was oxidized to cyclohexanone (CH), and CO 2 was reduced and then reacted with cyclohexanol to produce cyclohexyl formate (CF).The ZnFe 2 O 4 -BiOCl composites with different shapes showed much higher CF and CH yields than those of pristine BiOCl and mechanically mixed samples, respectively.When the ZnFe 2 O 4 content in the composites reached 9, two different shapes of ZnFe 2 O 4 -BiOCl composites both achieved the highest photocatalytic activities.In contrast, the activities for photocatalytic reduction of CO 2 in cyclohexanol over hierarchical microsphere ZnFe 2 O 4 -BiOCl composites were higher than those of nanosheet structure samples.The higher activities over hierarchical microsphere composites could be attributed to its unique hierarchical structure, large illumination area, and low Photoluminescence (PL) emission intensity, which were beneficial for the separation of photogenerated charge carriers.This work provided a novel approach for the design and construction of highly efficient photocatalyst and reaction system for photoreduction of CO 2 ."
  },
  {
    "title": "Experimental",
    "content": "All the reagents for synthesis and analysis were commercially available and used without further purification.BiOCl hierarchical microspheres were synthesized via an ionic liquid-assisted solvothermal process.In a typical synthetic procedure, 0.485 g of Bi(NO 3 3 5H 2 O was added in 40 mL of ethylene glycol (EG) to form a clear solution under magnetic stirring at room temperature.Then, 0.303 g of 1-hexyl-3-methylimidazolium chloride (C6Mim Cl) with another 40 mL of ethylene glycol (EG) was added into the above solution.After another 20 min of vigorous stirring, the precursor solution was transferred into a 100 mL Teflon-lined stainless autoclave and heated at 160 C for 6 h under autogenous pressure.The autoclave was cooled to room temperature naturally.Finally, the resulting precipitate was collected by centrifugation and washed thoroughly with deionized water and ethanol, and then dried at 60 C for 12 h. In a typical synthesis of BiOCl nanosheets, 0.97 g of Bi (NO 3 3 5H 2 O was dissolved in 15 mL of ethylene glycol and vigorously stirred until a uniform transparent solution was formed.In parallel, 0.1491 g of KCl was added slowly into 15 mL of deionized water with magnetically stirring for 10 min at room temperature.Then, the two solutions were mixed together and stirred vigorously for another 10 min.The mixture solution was poured into a 60 mL Teflon-lined stainless autoclave and heated at 160 C for 12 h under autogenous pressure.The autoclave was cooled to room temperature naturally.Finally, the resulting precipitate was collected by centrifugation and washed thoroughly with deionized water and ethanol, and then dried at 60 C for 12 h. ZnFe 2 O 4 -BiOCl heterostructure photocatalysts with different ZnFe 2 O 4 theoretical mass percentages (3, 6, 9, and 12) were synthesized via a facile hydrothermal deposition process.A typical synthesis of ZnFe 2 O 4 -BiOCl heterostructure with 9 ZnFe 2 O 4 content is presented as follows: 0.4 g of BiOCl and 0.133 g of Fe(NO 3 3 9H 2 O were dissolved in 30 mL of deionized water under ultrasonic treatment for 20 min to form a homogeneous suspension.Then, a solution comprised 0.0487 g of Zn(NO 3 3 6H 2 O and 5 mL of ethylene glycol was added drop by drop into the homogeneous suspension under constant stirring at room temperature.Next, 0.33 g of NaAc 3H 2 O was added to the above solution, yielding a uniform red suspension.The suspension was stirred at room temperature for 20 min and transferred into a 100 mL Teflon-lined stainless autoclave, which was treated at 160 C for 12 h.After cooling down to room temperature naturally, the resulting red precipitate was collected by centrifugation and washed with deionized water and ethanol for more than three times and dried at 60 C overnight.The prepared composites with hierarchical microsphere structure were labeled as ZBHx, and the composites with nanosheet structure were labeled as ZBSx, where the numbers of x represented the mass percentage of ZnFe 2 O 4 . The powder X-ray diffraction (XRD) measurements were recorded on a Bruker D8 Advance diffractometer using Ni-filtered Cu K radiation ( 0 15418 nm).The morphology and microstructure of the prepared samples were observed on a field emission scanning electron microscopy (FESEM, Hitachi S-4800) and transmission electron microscopy (TEM, Tecnai G2 F20a Copyright: American Scientific Publishers composition and chemical state of the samples were measured by X-ray photoelectron spectroscopy (XPS) using a PHA-5400 photoelectron spectrometer with monochromatic Al K as the X-ray source.UV-vis diffuse reflectance spectra of the prepared samples were conducted on a Shimadzu UV-2550 spectrophotometer using an integrating sphere attachment with a wavelength range of 200-800 nm.BaSO 4 was used as a reflectance standard.N 2 adsorption-desorption isotherms were examined on a Micromeritics Tristar 300 apparatus at the liquid-nitrogen temperature of 77 K, and the surface areas were determined using the Brunauer-Emmett-Teller (BET) method. The photoluminescence (PL) spectra of the prepared samples were obtained on a Fluorolog3 fluorescence spectrophotometer with an excitation wavelength of 320 nm. The photocatalytic reduction of CO 2 with cyclohexanol was performed in a self-designed slurry reactor under ambient condition.In a typical experiment, 0.01 g of photocatalyst was uniformly dispersed in 10 mL of cyclohexanol.Prior to irradiation, high purity of CO 2 (99.995) gas was bubbled into the reactor for 0.5 h to remove dissolved oxygen and ensure the absorption and desorption of CO 2 reached equilibrium.Then, the reactor was sealed and illuminated by a 250 W high pressure mercury lamp. The intensity of incident light on the liquid surface was 3.2 mW/cm 2 .During the reaction, the suspension was continuously stirred to prevent catalyst sedimentation and a circulating water jacket was used to keep the temperature of the reactant solution at about 25 C.After specific irradiation period, the suspension was collected and centrifuged to remove the photocatalyst thoroughly.The concentration of the upper clear liquid was determined by an Agilent 7890A gas chromatography equipped with a flame ionization detector and a HP Wax column."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Figure 1 shows the SEM and TEM images of pure BiOCl and ZnFe 2 O 4 -BiOCl heterostructure nanosheets with 9 ZnFe 2 O 4 content.As can be seen from Figures 1(a andb), the ZBS0 sample consists of two dimensional sheets with an average width of 60 to 100 nm and thickness of about 20 nm.Figures 1(c andd) show that after ZnFe 2 O 4 deposition, there are many obvious nanoparticles on the surface of BiOCl nanosheets.Also ZnFe 2 O 4 deposition process brings no obvious change to the morphology of the BiOCl nanosheets.A representative TEM image of ZBS0 sample in Figure 1(e) shows that many nanosheets tightly together with a size of about 50 nm to 100 nm, which is consistent with the SEM image.The corresponding HRTEM image (Fig. 1(f)) indicates that the ZBS0 sample with a highly degree of crystallinity.There are two clear lattice fringes with interplanar spacing of 0.385 nm and 0.278 nm corresponding to (010) 22 and (110) planes 23 2(e) further confirms that the BiOCl microspheres are composed of many nanoflakes.The corresponding SAED pattern suggests that the BiOCl microspheres are polycrystalline structure (Fig. 2(f)).Figure 2(g) shows the TEM image of ZBH9 sample, indicating that the microspheres are composed of nanosheets and keep well-dispersed morphology.As shown in Figure 2(h), the corresponding HRTEM picture reveals that the lattice fringes with interplanar spacing of 0.254 nm can be assigned to the (311) plane of ZnFe 2 O 4 , while the fringe intervals of 0.27 nm and 0.37 nm correspond to the interplanar spacing of (110) and (002) planes of BiOCl, 25 respectively.Also novel heterojunctions are formed between ZnFe 2 O 4 nanoparticles and BiOCl microspheres. The purity, phase structure, and crystallinity of the synthesized samples were recorded by XRD. Figure 3(a curve of the hysteresis loops in the range of 0.4-1.0P /P 0 , which is typical of mesoporous materials. 28 29Also, the isotherms of the ZBH0 and ZBH9 samples show higher adsorption than the ZBS0 and ZBS9 samples at relative pressures (P /P 0 approaching 1.0, indicating that the ZBHx samples have larger mesoporous than the ZBSx samples. 30The porous structures in photocatalyst may be important due to they can provide efficient transport pathways to make better use of solar energy.As can be seen from Figure 5, the BET specific surface areas of the ZBHx samples are larger than the ZBSx samples, indicating that the 3D hierarchical microspheres BiOCl and corresponding ZnFe 2 O 4 -BiOCl heterostructure with higher to the distinct Bi 4f 7/2 and Bi 4f 5/2 of Bi 3 , respectively. 31fter ZnFe 2 O 4 loading, both Bi 4f 7/2 and Bi 4f 5/2 peaks of ZBH9 and ZBS9 samples shift 0.2 eV toward the higher BE and become weaker clearly, indicating that the intense interaction between ZnFe 2 O 4 and BiOCl.From and O in oxygen-deficient regions. 33Two peaks located at 711.88 and 724.78 eV are assigned to Fe 2p 3/2 and Fe 2p 1/2 (Fig. 6(e)), respectively, which is characteristic of Fe 3 in the ZBH9 and ZBS9 samples. 18The Zn 2p 3/2 and Zn 2p 1/2 binding energy values of the ZBH9 and ZBS9 samples are located at 1021.18 and 1044.18eV (Fig. 6(f)), respectively, which are in agreement with the Zn 2 state. 18 To evaluate the photocatalytic activity of ZnFe 2 O 4 -BiOCl composites and compare the activity for different shapes of ZnFe 2 O 4 -BiOCl heterostructure, the as-prepared ZBHx and ZBSx samples for photocatalytic reduction of CO 2 in cyclohexanol under UV light irradiation were tested.In this photocatalytic system, CF and CH were observed as the main products in liquid phase, which were detected by GC-MS in our previous work. 34Additionally, cyclohexyl ether and HCOOH were also detected.Control experiments showed that no expected products of CH and CF were observed in the absence of either illumination or photocatalyst, indicating that illumination and photocatalyst were necessary for this reaction.Also, neither CF nor CH could be observed by bubbling N 2 instead of CO 2 through the reactor or direct introducing CO 2 into the reaction setup in the absence of cyclohexanol under light irradiation.This indicated that cyclohexanol was not been oxidized under N 2 environment and CF was produced in the presence of CO 2 and cyclohexanol under UV light irradiation. Figure 7 exhibits the yields of CF and CH over ZBHx and ZBSx catalyzed reduction of CO 2 as a function of irradiation time under UV irradiation.As can be seen from Figures 7(a andb), the pristine BiOCl (ZBH0) shows a lower photocatalytic activity, while loading of ZnFe 2 O 4 nanoparticles on the surface of BiOCl significant improves the yields of CF and CH.The production yields of CF and CH gradually increase with the loading amount of ZnFe 2 O 4 increasing from 3 to 9 wt.However, further increase the ZnFe 2 O 4 content from 9 to 12 wt leads to the decreasing of photocatalytic activity.The highest CF and CH production yields are achieved with 9 wt of ZnFe 2 O 4 content deposited on BiOCl (ZBH9).Furthermore, Figures 7(a andb) also shows the production yields for all the ZBHx samples increased with the reaction time, indicating that the ZBHx samples have good stability under UV irradiation.After 8 h irradiation, the CF and CH production yields for ZBH9 sample are 201.2 and 192 mol g -1 cat , respectively.In addition, the photocatalytic activity of mechanically mixed sample ZBH9 (blend) is much lower than that of ZBH9 sample.The production yields of CF and CH for ZBH9 sample are almost 2.1 times as those of ZBH9 (blend) after 8 h irradiation, further indicating that indeed existence of heterojunctions between ZnFe 2 O 4 and BiOCl in ZBH9 sample rather than simple physical mixture. As can be seen from Figures 7(c andd), the order for photocatalytic activity of ZBSx samples is the same as that of ZBHx samples.And the highest CF and CH production yields are also achieved with 9 wt of ZnFe 2 O 4 content in BiOCl (ZBS9) among those ZBSx samples.The yields of CF and CH over ZBS9 sample are 189 and 177 mol g -1 cat after 8 h irradiation, respectively. In contrast, the yields of CF and CH over ZBHx samples are higher than those over ZBSx samples, which may be due to several reasons: (1) 3D hierarchical structure of the ZBHx samples assembled with interlaced nanosheets can obtain stronger light absorbance than those of 2D nanosheet structure of the ZBSx samples via the light multi-reflection. (2) The hierarchical microspheres can provide larger illumination area while nanosheets may provide smaller illumination area due to tightly overlapping between the sheets. (3) The ZBHx samples with larger specific surface area can expose abundant reactive sites and promote interfacial carrier transfer, which are beneficial for improving the photocatalytic efficiency.(4) A lower Photoluminescence (PL) emission intensity is indicative of a lower recombination rate for photogenerated electron-hole pairs and is beneficial for the separation of photogenerated charge carriers.Here, the PL emission spectra of pure BiOCl and ZnFe 2 O 4 -BiOCl heterostructured samples are investigated and the results are shown in Figure 8.The PL spectra of ZBS0 display a stronger emission than ZBH0.After the loading of ZnFe 2 O 4 nanoparticles, the PL intensities for both ZBS9 and ZBH9 samples become weaken.And the ZBH9 sample exhibites weaker intensity than ZBS9 sample, indicating that ZBH9 sample has a better photocatalytic activity. Additionally, compared with our previous work for photocatalytic reduction of CO 2 over 9.78ZnFe 2 O 4 /TiO 2 composite, the production yields of CF over ZBH9 sample were increased about 13 after 8 h irradiation. 35he reason is that BiOCl with layered structure, the large spaces between sheets, and indirect transitions may be benefitial for the separation of photo-induced electron hole pairs and therefore improve the photocatalytic activity.Also, the color of pure BiOCl and ZnFe 2 O 4 -BiOCl heterojunctions became black after the photocatalytic reaction irradiated by UV light.Ye et al. 14 36 had proved that the existence of oxygen vacancies after UV light-induced by EPR spectra and PL spectra analysis, and the concentration of oxygen vacancy would increase along with the UV irradiation time.The oxygen vacancy state as an impurity band in photocatalyst, located near the bottom of the conduction band, can enhance the separation efficiency of photo-induced electron-hole pairs.The formation of heterojunction in ZnFe 2 O 4 -BiOCl composite samples can facilitate the separation of photogenerated charge carriers.So the ZnFe 2 O 4 -BiOCl heterostructured samples exhibit much higher activities than pristine BiOCl and mechanically mixed sample ZBH9 (blend)."
  },
  {
    "title": "Conclusions",
    "content": "Two different shapes of ZnFe 2 O 4 -BiOCl nanocomposites, including nanosheets and hierarchical microspheres, were prepared by a two-step hydrothermal approach.The characterization results revealed that ZnFe 2 O 4 nanoparticles were uniformly deposited on the surface of BiOCl, and the hierarchical microsphere nanostructure of ZnFe 2 O 4 -BiOCl nanocomposites had higher crystallinity, light absorption intensity, and specific surface area than those of nanosheet nanostructure samples.The photocatalytic activities of the ZnFe 2 O 4 -BiOCl nanocomposites were tested by CO 2 reduction in cyclohexanol.The experimental results demonstrated that the main products of CH and CF were detected in this reaction system.And the yields of CF and CH over ZnFe 2 O 4 -BiOCl nanocomposites were much higher than those of pure and mechanically mixed samples, attributing to the formation of heterojunctions between ZnFe 2 O 4 and BiOCl in composite samples.The morphology of the photocatalyst also affected the photocatalytic performance.Compared to the pristine BiOCl and its nanocomposite samples with nanosheet microstructure, those with hierarchical microsphere microstructure samples had higher photocatalytic activities due to its high light-harvesting capacity, large illumination area, and low Photoluminescence (PL) emission intensity, which were beneficial for acquiring higher photocatalytic activities.The reaction mechanism for photocatalytic reduction of CO 2 over ZnFe 2 O 4 -BiOCl nanocomposites was also proposed. Figure 2(a) shows a typical SEM image of ZBH0 sample.It can be seen that the diameter of the hierarchical microspheres is about 2 m and the microspheres are constructed of numerous two dimensional (2D) interlaced nanosheets.The corresponding high-magnification SEM image in Figure 2(b) shows that the microspheres are loosely assembled by interlaced nanosheets.The surface of the BiOCl hierarchical microspheres are clean and the thickness of the interlaced nanosheets are around 10-15 nm.The SEM image of ZnFe 2 O 4 -BiOCl heterostructure hierarchical microspheres (ZBH9 sample) in Figure 2(c) shows a similar size and morphology as that of pure BiOCl microspheres.The higher magnification SEM image in Figure 2(d) displays the ZnFe 2 O 4 nanoparticles with sizes of 15 2 nm which are dispersed on the surface of the BiOCl interlaced nanosheets.The TEM image in Figure ) shows the XRD patterns of the pure BiOCl hierarchical Delivered by Ingenta to: State University of New York at Binghamton IP: 5.101.221.52 On: Sun, 05 Mar 2017 05:29:17 Copyright: American Scientific Publishers Figure 1.(a, b) SEM images of ZBS0 sample with different magnifications; (c, d) SEM images of ZBS9 sample with different magnifications; (e, f) TEM and HRTEM images of ZBS0 sample; (e, f) TEM and HRTEM images of ZBS9 sample.The inset (in (f)) is the typical Fourier transform spectrum pattern. Figure 2. (a, b) SEM images of ZBH0 sample with different magnifications; (c, d) SEM images of ZBH9 sample with different magnifications; (e, f) TEM and SAED images of ZBH0 sample; (g, h) TEM and HRTEM images of ZBH9 sample. Figure 3. XRD patterns of the catalyst samples.(a) ZBHx samples, (b) ZBSx samples. shows the N 2 adsorption-desorption isotherms of pure BiOCl and ZnFe 2 O 4 -BiOCl composite samples with 9 ZnFe 2 O 4 content.As can be seen, all the isotherms of the as-prepared samples can be categorized as type IV Figure 4. UV-vis diffuse reflection spectra of the catalyst samples.(a) ZBHx samples, (b) ZBSx samples. Figure 5. N 2 adsorption/desorption isotherms of the catalyst samples. Figure 6.(a) Survey XPS spectra of the ZBH0, ZBS0, ZBH9, and ZBS9 samples; (b) Bi 4f of the ZBH0, ZBS0, ZBH9, and ZBS9 samples; (c) Cl 2p of the ZBH0, ZBS0, ZBH9, and ZBS9 samples; (d) O 1s of the ZBH0, ZBS0, ZBH9, and ZBS9 samples; (e) Fe 2p of the ZBH9 and ZBS9 samples; (f) Zn 2p of the ZBH9 and ZBS9 samples. c), two characteristic peaks of the four samples with binding energies at 197.78 and 199.18 eV are attributed to Cl 2p 3/2 and Cl 2p 1/2 of Cl -, respectively.32Figure6(d) shows the O 1s spectra of ZBH0, ZBS0, ZBH9, and ZBS9 samples.The overlapping peaks with the binding energy at 529.78 and 531.18 eV can be ascribed to the crystal lattice O atoms in BiOCl32 and surface hydroxyl or crystal water,20 respectively.In contrast, the ZBH9 and ZBS9 samples show an additional peak with a Delivered by Ingenta to: State University of New York at Binghamton IP: 5.101.221.52 On: Sun, 05 Mar 2017 05:29:17 Copyright: American Scientific Publishers higher binding energy at 532.18 eV and 532.8 eV, respectively, corresponding to the crystal lattice O in ZnFe 2 O 24 4 Ingenta to: State University of New York at Binghamton IP: 5.101.221.52 On: Sun, 05 Mar 2017 05:29:17Copyright: American Scientific Publishers Figure 7.Yields of CF (a, c) and CH (b, d) as a function of radiation time over a series of the as-prepared photocatalysts. Figure 8. PL spectra of the ZBH0, ZBS0, ZBH9, and ZBS9 samples excited at 320 nm. Figure 9. Proposed mechanism for photocatalytic reduction of CO 2 in cyclohexanol over hierarchical microsphere ZnFe 2 O 4 -BiOCl composite. ).The surface 24 pure BiOCl, respectively.Figure1(g) shows the TEM image of ZBS9 sample, revealing that many ZnFe 2 O 4 nanoparticles with an average size of about 10 to 15 nm are uniformly loaded on the surface of BiOCl nanosheets.HRTEM image of the ZBS9 sample in Figure1(h) further illustrates the intimate contact between the ZnFe 2 O 4 particles and BiOCl nanosheets.Moreover, in addition to the two lattice fringes of BiOCl with a lattice spacing of 0.385 nm between the (010) plane and a lattice spacing of 0.275 nm between the (110) plane, appearance of new lattice fringes with interplanar spacing of 0.254 nm, corresponding to the (311) plane of spinel ZnFe 2 O 4 .24TheHRTEMimage of the ZBS9 sample also confirms that novel heterojunctions are formed between ZnFe 2 O 4 nanoparticles and BiOCl nanosheets.The fast Fourier transform spectrum (inset in Fig.1(h)) of the ZBS9 sample matrix indicates that the nanocomposite matrix is a polycrystalline.The morphologies of pure BiOCl and ZnFe 2 O 4 -BiOCl heterostructure microspheres with 9 ZnFe 2 O 4 content were analyzed by SEM and TEM. Synthesis of Different Shapes ZnFe 2 O 4 -BiOCl Nanocomposites for Photocatalytic Reduction of CO 2 in CyclohexanolSong et al. Acknowledgments: This work was financially supported by the National Natural Science Foundation of China (NSFC) (No. 21176192), and Program for Changjiang Scholars and Innovative Research Team in University (PCSIRT, No. IRT0936), Tianjin natural science foundation (No. 12JCZDJC29400)."
  }
]