[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2017.07.078"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic CO2 reduction over V and W codoped TiO2 catalyst in an internal-illuminated honeycomb photoreactor under simulated sunlight irradiation"
  },
  {
    "title": "Abstract",
    "content": "Highlights V and W codoped TiO2 catalysts were easily synthesized and well characterized. CO2 photoreduction was performed in an internal-illuminated honeycomb photoreactor. V and W codoped TiO2 exhibited enhanced photocatalytic activity under simulated sunlight. The roles of V and W dopants during photocatalytic reaction were identified."
  },
  {
    "title": "Experimental",
    "content": "The TiO2 sol was prepared through a controlled thermal hydrolysis method 31 with slight modification.In a typical process, 87.6 g of titanium butoxide was slowly added into 510 mL of HNO3 aqueous solution (0.1M) under vigorous stirring.The mixture was kept stirring at 80 C for 8 h to obtain clear TiO2 sol.Then, 10 g of PEG (Mw20000) was added to improve the viscosity of TiO2 sol for dipcoating.The metal/TiO2 sol was prepared by dissolving a certain amount of metal precursors in the TiO2 sol.For V/TiO2 sol, a certain amount of vanadyl (IV) acetylacetonate was dissolved in methanol and then the mixture was added in the TiO2 sol.For W/TiO2 sol, ammonium tungstate hydrate was dispersed in oxalic acid aqueous solution before adding into the TiO2 sol.The V-W/TiO2 sol was prepared by adding both V and W precursors into the TiO2 sol. The cordierite honeycomb support used for catalyst carrier was purchased from the Chauger honeycomb support company (Taiwan).Each honeycomb support is 4 cm in diameter and has 160 square channels (2 2 mm).The metal/TiO2 catalyst was coated on the honeycomb support by the method reported in the literature 30.The honeycomb support was immersed into the metal/TiO2 sol and soaked for 30 min.Then the honeycomb support was taken out of the sol and the excess sol was blown away using compressed air.Finally, the resultant honeycomb was calcined in air at 500 C for 2h (1 C/min). The V, W codoped TiO2 catalysts were denoted as VxWyT (x and y are the mass ratios of V2O5/TiO2 and WO3/TiO2 in the catalysts, respectively).Powder catalysts were also prepared in the same procedure for comparison. X-ray diffraction (XRD) patterns of the catalysts were recorded on an Empyrean diffractometer using Cu K radiation ( 0.1542 nm) in the range of 10-80 .The surface morphology and elemental mapping of the catalysts were examined by environment scanning electron microscopy (ESEM) with an FEI Quanta 200 instrument.Transmission electron microscopy (TEM) images of the catalysts were obtained by using an FEI Tecnai G 2 F30 instrument.The specific surface areas and pore size distribution of the catalysts were measured by a Micrometrics ASAP 2020 surface area and porosity analyzer.X-ray photoelectron spectra (XPS) of the catalysts were recorded on a Shimadzu/KRATOS AXIS-ULTRA DLD-600W instrument equipped with Al/Mg K radiation.Photoluminescence (PL) and Raman spectra of the catalysts were recorded on a confocal laser Raman microscope (Horiba JobinYvon, LabRAM HR800) by using a 325 nm and a 532 nm excitation light source, respectively.The UV-Vis absorbance spectra of the catalysts were measured by a UV-Vis spectrophotometer (Perkin Elmer, Lambda 950). CO2 photocatalytic reduction under simulated sunlight irradiation (300 nm400 nm, 18.5 mW cm -2 ; 400 nm800 nm, 44.6 mW cm -2 ; measured in front of the quartz window) was carried out in a continuous internal-illuminated honeycomb photoreactor (Fig. 1A).The honeycomb support was threaded with commercial communication optical fibers with pure PMMA core and F-doped PMMA cladding.The optical fiber has a diameter of 1 mm.The honeycomb support with optical fibers was placed into a cylindrical Pyrex glass reactor (375 mL), which had a quartz window on the top for light irradiation.The simulated sunlight was supplied by a 300 W xenon lamp.The reactor was heated to 50 C by using heating tape.Ultra-pure CO2 (99.999) passed through a water bubbler to generate a mixture of CO2 and water vapor (water vapor/CO2 ratio 4.4 vol.).Prior to illumination, the reactor was first purged with CO2 and water vapor mixture at a flow rate of 200 mL min -1 for 1 h and then 10 ml min -1 for another 30 min.After the flow was stabilized, the Xe lamp was switched on to start the experiment.The concentrations of H2, CO, and hydrocarbons in the exhaust gas were analyzed every 15 min by a gas chromatography (GC) equipped with an on-line sampling loop (1 mL), a flame ionization detector (FID), and a thermal conductivity detector (TCD).First, the effluents were pre-separated by a carbon molecular sieve (TDX-01) column to flush CO2 to atmosphere.Then the effluents flowed through a molecular sieve 5A column for the separation of H2, O2, N2, CH4, and CO.Finally, H2 in the effluents was analyzed by the TCD detector and CH4 and CO (converted to CH4 by a methanizer) were analyzed by the FID detector.Ar was used as the carrier gas. For comparison, CO2 photocatalytic reduction over catalyst powders was also performed in the same cylindrical Pyrex glass reactor (conventional powder reactor, Fig. 1B).The other parts of the reactor are the same as the honeycomb reactor.The catalyst powders were spread on a sieve plate placed in the center of the cylindrical reactor.The amount of catalyst powders was the same as that of catalyst loaded on the honeycomb. A series of background tests were conducted to confirm that any carbon-containing compounds in the effluent gas measured by the GC indeed originated from CO2 photoreduction.First, tests were conducted using CO2 and water vapor as the purging and reaction gases: (1) empty reactor and (2) reactor with honeycomb support without coating.No carbon-containing products were detected in the dark or under UV-Visible light irradiation in these two cases.This demonstrated that the CO2 reduction could not proceed without photocatalyst.Second, instead of CO2, Ar and water vapor were used as the purging and reaction gases in the presence of coated honeycomb support.No carbon-containing compounds were produced under UV-Visible light irradiation.This indicated that the CO2 was the sole carbon source."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Fig. 2 shows the XRD patterns of pristine TiO2, V3T, W3T, and V3W3T catalysts.Pristine TiO2 mainly existed as anatase and rutile TiO2.A weak peak at around 30.8 can be ascribed to brookite TiO2 31.In the case of V or W doping, the intensity of the peaks corresponding to rutile TiO2 decreased remarkably.For V3W3T, the peaks corresponding to rutile TiO2 nearly disappeared, indicating that either V or W doping inhibited the anatase-rutile phase transformation.The average crystalline size of TiO2 was determined by XRD using the Scherrer equation (as shown in Table 1).The crystalline sizes of V3T, W3T, and V3W3T were all smaller than that of pristine TiO2, which demonstrated that V and W doping inhibited the growth of TiO2 grains.Similar results were reported in the literatures 26.No V or W species were detected by XRD, which can be attributed to the low concentration of V and W doping.It is notable that the anatase (101) peak of V3T, W3T, and V3W3T shifts towards the higher diffraction angle, indicating that V and W ions might incorporate into the lattice of anatase TiO2 and substituted for Ti 4 . To further confirm the successful doping of V and W into the lattice of TiO2, Raman spectra of pristine TiO2, V3T, W3T, and V3W3T are exhibited in Fig. 3.The Raman spectra showed that pristine TiO2 contained anatase, rutile, and brookite phases (Fig. 3A).The intensity of the Raman peaks corresponding to rutile phase obviously decreased after V or W doping, indicating the formation of rutile phase was inhibited, which is in line with the results of XRD.It is notable that the intensity of Raman peaks of doped TiO2 samples were much lower than that of pristine TiO2, indicating the presence of V and W dopants 34,35.In the magnified Raman spectra (Fig 3B), it can be seen that the raman peaks of doped TiO2 samples exhibited a slight blue shift comparing to the pristine TiO2.This might be attributed to the distortion of crystal lattice structure and the increased Ti-O bond caused by V and W ions 36.This also demonstrated the successful doping of V and W into the lattice of TiO2.In Fig. 3C, a small peak at around 285 cm -1 was observed on the Raman spectra of both V3T and V3W3T , which is one of the characteristic Raman peaks of V2O5 34.This indicated that part of the V dopant in V3T and V2W3T exsited as V2O5 on the surface of TiO2.However, no peaks corresponding to WO3 crystals were observed, suggesting that the incorporated W is highly dispersed in TiO2 without forming large crystals 37.N2 adsorption-desorption was used to explore the textual properties of pristine TiO2, V3T, W3T, and V3W3T catalysts.The BET surface area, pore volume, and pore size of the samples were summarized in Table 1. Both V and W doping enhanced the surface area of TiO2.V3W3T catalyst possesses the largest surface area (174.8 m 2 g -1 ) among all the samples.The enhanced surface area can be attributed to the decreased TiO2 crystalline size caused by V and W doping, as evident by XRD analysis (Table 1). XPS was used to investigate the chemical states of Ti, O, V and W on the surface of the catalysts.Fig. 4A shows the high-resolution Ti 2p XPS spectra of the samples.There exist two peaks in the binding energy region of Ti 2p.The binding energies of Ti 2p3/2 for pristine TiO2 and W3T are around 458.6 eV, which indicates Ti 4 in pristine TiO2 and W3T 38,39.Notably, comparing with pristine TiO2, the binding energy of Ti 2p3/2 for V3T shifted to a negative value, suggesting that some of Ti 4 is reduced to Ti 3 .This phenomenon can be attributed to the substitution of Ti 4 by the doped V 4 and the formation of Ti-O-V bonds 26,40, which could induce defects in the TiO2 lattice, leading to the reduction of Ti 4 into Ti 3 or the formation of oxygen vacancies 27.The formation of Ti 3 in V doped TiO2 were also observed by Pham et al. 27 and Wang et al. 36 and they owed it to the the incorporation of vanadium ions into the TiO2 lattice.However, for V3W3T, the Ti 2p binding energy shifted back to around 458.6 eV.This indicated that W doping inhibited the reduction of Ti 4 .The high-resolution O 1s XPS spectra of all the samples in Fig. 4B can be resolved into two peaks.The one with lower energy is assigned to oxygen in TiO2 lattice (OL) and the other one can be ascribed to superficial oxygen of hydroxyl species (OH) 17.The binding energy of O 1s peak for V3T is also lower than that of pristine TiO2, indicating the electron transfers from V to TiO2.Fig. 4C shows the high-resolution V 2p XPS spectra of V3T and V3W3T catalysts, which can be resolved into two peaks.The peak at around 517.0 eV could be ascribed to V 5 26, whereas that at around 515.8 eV was assigned to V 4 27.Combining the results of XRD and Raman spectra, V 4 ions could substitute for Ti 4 ions to form a Ti-O-V bond in the TiO2 lattice while the V 5 could exist in the form of V2O5 on the surface of TiO2, resulting from much closer radii between Ti 4 (74.5 pm) and V 4 (72.0 pm) than V 5 (68.0 pm) 36.Similar results have also been reported by other researchers 27,41,42.The concentration of V 5 was much higher than that of V 4 for both V3T and V3W3T catalysts, demonstrating that V 5 was dominant on the surface of V3T and V3W3T catalyst.In addition, W doping does not show obvious influence on the chemical state of V.The W 4f region displays two peaks at 37.4 and 35.4 eV (Fig. 4D), which can be ascribed to the W 4f5/2 and W4f7/2 for W 6 43.The peak at around 37.0 eV can be assigned to Ti 3p 44.Considering the similar radii between Ti 4 (74.5 pm) and W 6 (74.0 pm), W 6 could be doped into the lattice of TiO2 and substituted for Ti 4 according to the XRD results.The chemical state of W was not affected by V doping. The SEM images of the catalysts in Fig. 5 show that V or W doping has no significant influence on the morphology of TiO2 catalyst.In addition, elemental mapping exhibited uniform distribution of V and W in TiO2.Fig. 6 illustrates the TEM and HR-TEM images of pristine and doped TiO2 catalysts.It is notable that a similar morphology could still be obtained by V or W doping.The average size of TiO2 particles is around 20 nm.For pristine TiO2, V3T, and W3T, TiO2 existed in the form of anatase, rutile, and brookite according to the interplanar spacing showing in the HR-TEM images.No rutile TiO2 nanoparticle was observed in the HR-TEM image of V3W3T (Fig. 6H), which is in line with the results of XRD that the formation of rutile TiO2 phase was inhibited by V and W doping. V2O5 particles were observed in the HR-TEM image of V3T (Fig. 6D), which is accordance with the results of XPS analysis that V 5 existed as V2O5 on the surface of TiO2.No W species were observed in the TEM images of W3T and V3T3W due to the low concentration of W doping or high dispersion of W species in the catalysts. The UV-Vis absorbance spectra of the catalysts are shown in Fig. 7A.The absorption edges of V3T and V3W3T catalysts exhibited red shift compared to that of pristine TiO2 and W3T, indicating V doping could enhance the visible light absorption of TiO2.The band gap of the samples was calculated by using (Ah) n k(h-Eg), where A is the absorbance, k is the parameter that related to the effective masses associated with the valence and conduction bands, n is 2 for an indirect transition, h is the absorption energy, and Eg is the band gap 5.Fig. 7B shows the function of (Ah) 2 to h, and Eg of the samples was summarized in Table 1.The band gap of pristine TiO2 was lower than that of anatase TiO2 (3.2 eV) due to the smaller band gap of rutile TiO2 than anatase TiO2 45.The band gap of V3T is smaller than that of pristine TiO2, which can be attributed to the formation of an intermediate state below the bottom of CB of TiO2 caused by V 4 doping 26.Because of the intermediate state within the band gap, the electrons in the VB of TiO2 can be excited to the intermediate state by absorbing visible light, resulting in enhanced visible light absorption of V doped TiO2.Nevertheless, the band gaps of W3T and V3W3T were very close to pristine TiO2 and V3T catalyst, respectively.Although W doping could enhance the visible light absorption of anatase TiO2 43,44, it inhibited the formation of rutile TiO2.As a result, the band gap of pristine TiO2 and V3T changed very little after W doping. The PL spectra of the catalysts are shown in Fig. 8. Notably, the intensity of PL spectra of V3T and W3T were both lower than that of pristine TiO2, indicating that both V and W doping could effectively decrease the recombination of photogenerated electron-hole pairs.The intensity of PL spectra for V3W3T were the lowest one among all the samples, revealing the most effective separation of photogenerated charges over V3W3T catalyst.This phenomenon can be explained as follows, the V2O5 on the surface of TiO2 is a kind of semiconductor and combining it with TiO2 can form a heterojunction, which can promote the separation of photogenerated electrons and holes and reduce the charge recombination process 34. The W 6 doped in TiO2 lattice can work as charge-trapping centers to reduce the recombination process and favor the separation of photogenerated charges 43.When the electrons in the VB of TiO2 are excited to the CB and they will captured by V2O5 on the surface of TiO2 and W 6 doped in the lattice of TiO2 26,44.then these trapped electrons can react with CO2 and water adsorbed on the surface of the catalyst. Therefore, we believe that the decreased PL intensity is due to the effective separation of photogenerated electron-hole pairs caused by V and W doping, which is beneficial for the enhancement of photocatalytic activity. Fig. 9 shows the photographs of bare and catalyst-coated honeycomb support.The color of honeycomb support changed after coating, implying loading of catalysts.The SEM images and EDS analysis of bare and pristine TiO2 coated honeycomb support are exhibited in Fig. 10.As shown in Fig. 10A, the bare honeycomb support consisted of cordierite particles.For TiO2 coated honeycomb support (Fig. 10B), the surface of honeycomb support was cover by a layer of smooth material, which was determined to be TiO2 according to EDS analysis.This indicated successful loading of TiO2 catalysts on the honeycomb support.Fig. 11 illustrates the SEM images and corresponding EDS analysis of the cross-section of TiO2 coating layer on the honeycomb support.Obviously, many pores can be observed on the cross-section of honeycomb support, while the first 30 m thick has a higher density, which can be attributed to the coating layer.The EDS line mapping exhibits most Ti element was distributed from 0 to 30 m deep, indicating the coating thickness was ca. 30 nm.This further indicated successful coating of TiO2 catalyst on the honeycomb support. CO2 photocatalytic reduction over V3W3T catalyst under simulated sunlight irradiation was performed in the honeycomb reactor and conventional reactor, respectively.Fig. 12 shows the CO, CH4, and H2 yields in the above two cases.As shown in Fig. 12, the yields of products from honeycomb reactor were much higher than those from conventional reactor.This can be attributed to the high surface area per unit volume provided by the honeycomb support and efficient utilization of light irradiation via optical fibers 30,31.Fig. 13 and Table 2 shows the effect of V and W doping on the photocatalytic CO2 reduction activity and quantum efficiency of TiO2 catalyst in the honeycomb reactor.H2, CO, and CH4 were found to be the main products and CO was dominant among all the products.The activity of pristine TiO2 was lowest among all the samples and both V and W doping enhanced the production of H2, CO, and CH4.The highest photocatalytic activity was obtained by V3W3T, whose CO, CH4, and H2 yields were 1.91, 0.22, and 0.27 mol g -1 h -1 , respectively.There is no doubt that the large surface area of V3W3T is helpful for the high photocatalytic activity. However, the quantum efficiency of V3W3T is only 4.5 times as many as that of pristine TiO2 while the BET surface area of the former is almost 13 times as many as that of the latter.Moreover, the photocatalytic activity of W3T is smaller than that of V3T although its larger surface area than V3T.Therefore, the large surface area is not the main reason for the highest activity of V3W3T and the main reason can be the promoted charge separation caused by V and W doping and enhanced visible light absorption by V doping, as evident in PL and UV-Vis analysis.The V 4 and W 6 ions doped in TiO2 lattice can capture photogenerated electrons and accelerate the electron transfer within TiO2 26,27,44.Meanwhile, the V 5 on the surface of TiO2 can trap photogenerated electrons and transferred them to CO2 adsorbed on the surface of TiO2 26,40.As a result, photogenerated charges were separated effectively.In addition, V 4 doping caused the formation of an intermediate state within the band gap of TiO2 26,27, which enables TiO2 to be excited by visible light irradiation. The quantum efficiency of the catalysts were also calculated based on the method reported in the literature 32.The total quantum efficiency of V3W3T catalyst (0.063) was higher than I-doped TiO2 (0.0086) 6 and Cu/TiO2 nanotube (0.0266) 46 in conventional reactor and NiO/InTaO4 catalyst in honeycomb reactor (0.012) 30, owing to the high photocatalytic activity of V and W codoped TiO2 catalyst and high surface area and high light utilization provided by the internal-illuminated honeycomb reactor.The influence of concentration of V and W dopants on CO2 photocatalytic reduction was also investigated.The results in Fig. 14 show that the photocatalytic activity of the samples increased first and then decreased with the increasing of V or W doping content.The optimal V and W doping concentration was 1 and 3.This is because appropriate doping of V or W could promote the separation of photogenerated charges while excess doping of them might serve as recombination centers and accelerate charge recombination 25,47,48. The cycle performance of V3W3T catalyst in the honeycomb reactor under simulate sunlight irradiation is exhibited in Fig. 15.After the first cycle, same experimental procedure was repeated over the spent V3W3T catalyst.The yields of CO, CH4 and H2 in the second and the third cycle were very close to those in the first cycle, indicating good cycle performance of V3W3T catalyst under this reaction condition.XPS was used to analyze the surface chemical states of V3W3T catalyst before and after reaction.As shown in Fig. 16, the chemical states of V and W on the surface of V3W3T catalyst were stable during photocatalytic reaction, which explains the good cycle performance of V3W3T catalyst. A possible mechanism of CO2 photocatalytic reaction over V and W codoped TiO2 catalyst was proposed based on the characterization and experimental results.In the case of UV light irradiation (Fig. 17A), the electrons in the VB of TiO2 can be excited to the CB of TiO2.Because the contact of V2O5 and TiO2 can form a heterojunction and the W 6 doped in TiO2 lattice can work as electron traps, the excited electrons on the CB of TiO2 can be captured by V2O5 and W 6 26,44 while the photogenerated holes are left in the VB of TiO2, resulting in effective separation of photogenerated electron-hole pairs, as evident in PL analysis.Then these trapped electrons react with CO2 and water adsorbed on the surface of the catalyst to produce solar fuels, resulting in enhanced CO2 photocatalytic reduction. When the V and W codoped TiO2 catalyst is under visible light irradiation (Fig. 17B), the electrons in the valence band of TiO2 can be excited by visible light to the intermediate state induced by V 4 doping, which is below the bottom of CB of TiO2.Then the excited electrons will be trapped by V2O5 on the surface of TiO2 or W 6 doped in the lattice of TiO2, which ensures the effective separation of photogenerated electron-hole pair. Finally, these trapped electrons will react with the adsorbed CO2 and water to produce hydrocarbons.Due to the enhanced visible light absorption caused by V 4 doping and effective separation of photogenerated charges caused by the V2O5 loading and W 6 doping, the V and W codoped TiO2 catalyst exhibited enhanced CO2 photocatalytic reduction activity under simulated sunlight irradiation,"
  },
  {
    "title": "Conclusions",
    "content": "In this work, V and W codoped TiO2 catalysts were synthesized through a controlled thermal hydrolysis method and were coated on the surface of honeycomb support by using impregnation method.V and W ions doping inhibited the growth of TiO2 grains and TiO2 phase transformation from anatase to rutile.The V and W distributed uniformly in TiO2 particles.V 4 and W 6 ions were doped in the lattice of TiO2 while V 5 (V2O5) were loaded on the surface of TiO2.V 4 doping enhanced the visible light absorption of TiO2 by introducing an intermediate state within the band gap of TiO2.The V2O5 on the surface of TiO2 and W 6 doped in the TiO2 lattice could trap photogenerated electrons and transfer them to CO2 and water adsorbed on the surface TiO2, resulting in effective separation of photogenerated charges.CO2 photocatalytic reduction over V and W coped TiO2 catalysts was performed in an internal-illuminated honeycomb photoreactor under simulated sunlight irradiation.The efficiency of CO2 photocatalytic reduction in honeycomb reactor was much higher than in conventional reactor due to the high surface area per unit volume and efficient utilization of light in the honeycomb reactor. Appropriate doping of V and W could effectively enhance the activity of TiO2.The CO, CH4, and H2 yields of V3W3T catalyst were 1.91, 0.22, and 0.27 mol g -1 h -1 , respectively, which were much higher than those of pristine TiO2 and single metal doped TiO2 catalysts.The V and W codoped TiO2 catalyst exhibited enhanced photocatalytic activity comparing with pristine TiO2 and single metal doped TiO2 catalysts, which could be attributed to the enhanced visible light absorption and promoted separation of photogenerated electron-hole pairs caused by V and W codoping.The V and W codoped TiO2 also exhibited good cycle performance due to the stable chemical states of V and W during photocatalytic reaction. Figure 1 Schematic diagrams of the internal-illuminated honeycomb reactor (A) and the conventional powder reactor (B). Figure 2 XRD patterns of as-prepared catalysts. Figure 8 PL spectra of pristine TiO2, V3T, W3T and V3W3T catalysts.B Figure 13 CO (A) and CH4 (B) and H2 (C) yields of the catalysts Crystalline size, surface area, pore volume, and pore size of the powder samples Ba calculated by Scherrer's equation. Photocatalytic activity and quantum efficiency of the catalysts in the internal-illuminated honeycomb photoreactor.Catalyst loading was measured from the difference between the weight of the honeycomb ceramic with and without coating.Quantum efficiency() numbers of electrons (n)moles of yield of products/moles of photons reached the catalyst, n represents 8 for CH4 and 2 for CO and H2. a b c totalCOCH4H2. This project was supported by the National Natural Science Foundation of China (U1610110), the Foreign Science and Technology Cooperation of Hubei Province (2016AHB021), and the Foundation of State Key Laboratory of Coal Combustion (FSKLCCB1402).The authors acknowledge the Analytical Testing Center of Huazhong University of Science Technology."
  }
]