[
  {
    "title": "Doi",
    "content": "10.1016/j.jcis.2020.10.048"
  },
  {
    "title": "Article_Title",
    "content": "Efficient interfacial charge transfer of 2D/2D porous carbon nitride/bismuth oxychloride step-scheme heterojunction for boosted solar-driven CO2 reduction"
  },
  {
    "title": "Abstract",
    "content": "Bi 12 O 17 Cl 2 g-C 3 N 4 Build-in electric field Photocatalytic CO 2 reduction a b s t r a c t Heterostructured photocatalysts are promising candidates in the photocatalysis field, and the heterojunction plays a vital role in the separation of spatial charge carriers.Here, a heterojunction was fabricated by the in situ growth of ultrathin Bi 12 O 17 Cl 2 (BOC) nanosheets (NSs) onto porous g-C 3 N 4 (PGCN) NSs.The NSs' nanostructure can effectively shorten the diffusion path of charge carriers and thus promote interfacial charge migration, which can improve the surface photocatalytic activity.The X-ray photoelectron spectroscopy spectra and the experimental measured Fermi level (E F ) indicate that electrons transfer from PGCN to BOC, which leads to the formation of the built-in electric field with the orientation from PGCN to BOC.Driven by the built-in electric field, the charge carriers transfer through a step-like pathway.This step-scheme porous g-C 3 N 4 /Bi 12 O 17 Cl 2 (PGCN/BOC) heterostructured nanocomposite displays an enhanced photocatalytic performance compared with pure BOC and PGCN.This work provides new insight into the novel construction of a step-scheme heterojunction toward photocatalytic CO 2 reduction."
  },
  {
    "title": "Experimental",
    "content": "Thiourea, urea, BiCl 3 , ethanol, sodium hydroxide (NaOH), nafion, and sodium sulfate (Na 2 SO 4 ) were purchased by Sinopharm Chemical Reagent Co. Ltd (China).Deionized water (18.25 MXAcm) was used throughout the preparation.All reactants were of analytical purity and used as received, without further purification. In a typical synthesis, 10 g of urea and 3 g of thiourea were ground to form a uniform mixture and then placed in a muffle furnace and calcined at 823 K for 2.5 h.Raw PGCN powder was obtained by grinding further the calcined product. In a typical synthesis, 2.5227 g of BiCl 3 and 80 mL of ethanol were mixed by vigorous stirring at ambient temperature for 30 min.Then, 4.4344 g of PGCN was added while stirring to produce a uniform suspension.Subsequently, 50 mL of NaOH (1 M) solution was added dropwise.Afterward, the as-prepared PGCN/ BOC sample was washed with deionized water and dried in a vacuum freeze dryer.Subsequently, the PGCN/BOC samples were calcinated in a muffle furnace at 250 C, 350 C, 450 C, and 550 C for 2 h and labeled PGCN/BOC 250, PGCN/BOC 350, PGCN/BOC 450 and PGCN/BOC 550, respectively.BOC NSs were obtained in the same way without adding PGCN."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The fabrication process of PGCN/BOC nanocomposites is shown in Fig. 1.First, PGCN was prepared through the calcination of the urea and thiourea mixture.A large amount of released gases exerted a subtle influence on the formation of the porous structure.Then, BOC NSs were in situ grown on the PGCN surface at room temperature to obtain the PGCN/BOC composite.Subsequently, the PGCN/BOC composite was annealed at high temperature, providing enough energy for Bi 3 migration from the BOC surface to the PGCN framework to eventually form the PGCN/BOC 450 composite. To detect the crystal structure and phase of the as-prepared materials, XRD patterns were collected, as in Fig. 2a.For PGCN, the strong diffraction peaks at 2h 13.1,27.4correspond to the (1 0 0) and (0 0 2) crystal planes of g-C 3 N 4 , which are ascribed to the in-plane repeating units and interplanar stacking 55.For BOC, the strong peaks at 2h 10.06,23.18, 24.30, 26.29, 29.40, 30.47, 32.90, 45.51, 47.24, 54.83, 56.58, 58.53are assigned to the (0 0 4), (1 1 1), (1 1 3), (1 1 5), (1 1 7), (0 0 2), (2 0 0), (2 0 2), (2 2 0), (3 1 5), (3 1 7), and (3 1 9) crystal planes of tetragonal Bi 12 O 17 Cl 2 (PDF 37-0702).The strong peaks of the PGCN/BOC composite are consistent with those of pristine PGCN and BOC.The diffraction peaks of the PGCN/BOC composite indexed to BOC widened because the BOC NSs thinned when coupled with PGCN 38.In contrast with PGCN/BOC, the diffraction peaks displayed a negligible change when the PGCN/BOC composite was annealed at 250 C and 350 C (See Fig. S1).When the annealing temperature reached 450 C, the characteristic peaks linked to the (1 0 0) and (0 0 2) crystal planes of PGCN were observed.Meanwhile, the appearance of the (0 0 2) crystal plane indicates that the stretching of PGCN readjusts naturally and orderly.However, when the annealing temperature reached 550 C, PGCN/BOC mostly decomposed thermally (See Fig. S2).Therefore, the optimal thermal diffusion temperature for Bi 3 migration from the BOC surface to the PGCN framework is approximately 450 C.To further demonstrate the presence of PGCN in the PGCN/BOC composite and the variation endowed by the step-scheme heterojunction in PGCN/BOC 450, the FT-IR spectra were studied and are shown in Fig. 2b.For PGCN, the absorption peak at 808 cm A1 is linked to the breathing mode of s-triazine rings 56.The peak at 1326 cm A1 is linked to completely condensed CAN moieties 25.The peaks located at 1409, 1461, 1553, and 1641 cm A1 are associated with heptazinederived repeating units 57.The absorption peaks in the range of 3200-3700 cm A1 are due to the stretching mode of the ANH x and AOH groups 55,58.For pure BOC, the peak at 672 cm A1 is linked to the stretching mode of the BiAO bond 59.The characteristic peaks of PGCN and BOC can be indexed well to the PGCN/ BOC and PGCN/BOC 450 composites, further verifying that both composites comprise PGCN and BOC.Compared with PGCN/BOC, two additional peaks of PGCN/BOC 450 appear at 1997 and 2161 cm A1 .The additional peak at 1997 cm A1 is derived from the typical overtone band of benzene derivatives, which can be ascribed to the partial transformation of the basic tectonic units of g-C 3 N 4 from tri-s-triazine to triazine rings during the annealing process 29,60.The additional peak at 2161 cm A1 can be indexed to the asymmetric stretching vibration of cyano groups (AC\"N), which can be attributed to the thermal diffusion of Bi 3 ions from the BOC surface to the PGCN framework that contributes to the structural variation of the tri-s-triazine structure of PGCN 50,61. The morphology and structure of PGCN, BOC, and PGCN/BOC 450 are shown in Figs.3,S3, and S4.In Fig. 3a and S4a, PGCN exhibits a wrinkled sheet structure with 10-20 nm round micropores.The corresponding fast Fourier transformation (FFT) image shows the (0 0 1) diffraction for in-plane repeating units with no (2 0 0) diffraction for interplanar stacking, which is consistent with the previous report 62.As shown in Fig. S3, the morphology of PGCN/BOC composites tends to be uniformly dispersed with the increase in annealing temperature.In Fig. 3b and S4b, BOC exhibits a thin and relative flat sheet structure.The corresponding periodic FFT pattern implies the single-crystalline characteristic of BOC NSs.The bright electron diffraction spots can be indexed to the (0 2 0) and (2 2 0) families of crystal planes of tetragonal Bi 12 O 17 Cl 2 (PDF No. 37-0702).In Fig. 3c andS4c, the PGCN/BOC 450 composite displays a wrinkled nanosheet like that of PGCN, but the surface is flat and without pores.The SAED inset in Fig. 3c shows the diffraction spots, which display a sparse ring, indicating that the BOC NSs deposited on PGCN exhibited polycrystalline characteristics after annealing.The radii of the rings from inside out are labeled R1, R2, R3, and R4, which correspond to 0.2796, 0.2008, 0.1745, and 0.1311 nm d-spacings, respectively, which are indexed to the (0 2 0), (2 2 0), (1 3 0), and (3 3 0) families of crystal planes of tetragonal Bi 12 O 17 Cl 2 (PDF No. 37-0702), respectively.The simplest integer ratio of the square for the radii of the rings from inside out is 2:4:5:9, which corresponds to the tetragonal crystal structure and consistent with the XRD result (See Table S1).Fig. 3d ande show the HRTEM images of PGCN and BOC, respectively.The interplanar spacing in the corresponding inverse FFT (IFFT) pattern is 2.73 A, which can be indexed to the (2 0 0) crystal plane of tetragonal BOC (PDF 37-0702).In Fig. 3f, the solid curves reflect the heterojunction of PGCN/BOC 450.The corresponding IFFT pattern demonstrates that BOC successfully composited with PGCN.According to Fig. 3g and S5 and Table S2, the HAADF-STEM image and its corresponding electron energy loss spectroscopy (EELS) mappings and element analysis provide visual evidence that BOC evenly coats the PGCN surface. X-ray photoelectron spectroscopy (XPS) was employed to detect the chemical states of the elements.In Fig. 4a, the elements of PGCN/BOC 450 and PGCN/BOC are in good agreement with those of PGCN and BOC, which is consistent with the result of EELS.In Fig. 4b, the C 1s XPS spectra for PGCN contain three main peaks at 284.9, 286.4,and 288.2 eV, which correspond to the sp 2 CAC bond, the CAN bond, and the sp 2 bonded NCAN, respectively 63.The corresponding peaks for PGCN/BOC 450 show a slight shift to 285.0, 286.5, and 288.3 eV, respectively.In Fig. 4c, the N 1s XPS spectra for PGCN contain three components at 401.3, 399.5, and 398.7 eV, corresponding to amino groups (CANAH), tertiary nitrogen groups (NA(C) 3 ) and sp 2 -bonded N (CANC) 64.The corresponding binding energies of PGCN/BOC 450 displayed slight increases to 401.4,399.6, and 398.9 eV, respectively 65.The slight positive shifts of C 1s and N 1s are caused by the charge transfer between PGCN and BOC.As shown in Fig. 4d, the O 1s XPS spectrum for BOC can be divided into two peaks at 530.0 and 531.5 eV, which are ascribed to lattice oxygen (Bi-O) and surface-adsorbed oxygen species, respectively 66,67.The relevant peaks for PGCN/BOC 450 show slight negative shifts to 529.8 and 531.2.In Fig. 4e, the Bi 4f XPS spectra for BOC consist of two peaks at 159.3 and 164.6 eV, which are respectively indexed to the Bi 4f 7/2 and Bi 4f 5/2 orbitals, while the corresponding binding energies for PGCN/BOC 450 display slight decreases to 159.1 and 164.4 eV, respectively 68.In Fig. 4f, the Cl 2p XPS spectra for BOC reveal two peaks at 198.2 and 199.8 eV, which can be attributed to the Cl 2p 3/2 and Cl 2p 1/2 orbitals, respectively.The corresponding peaks for PGCN/BOC 450 display slight shifts to 198.1 and 199.7 eV, respectively.The slight negative shifts of Bi 4f, O 1s and Cl 2p are also ascribed to the interfacial charge migration between PGCN and BOC.Notably, the binding energies of PGCN display an overall shift to higher values, while those of BOC demonstrate the opposite trend.The difference in binding energies is always related to the surface electron density, indicating the electron density difference between BOC and PGCN upon hybridization and leading to the formation of the built-in electric field, with the orientation of PGCN to BOC.Thus, the built-in electric field will benefit the construction of the step-scheme heterojunction between PGCN and BOC and promote the separation of spatial charge carriers 28,69. To reveal the absorption of as-prepared samples, UV-Vis DRS was applied in Fig. 5a.PGCN, BOC, PGCN/BOC, and PGCN/BOC 450 have absorption edges of 449, 452, 476, and 496 nm, respectively.PGCN/BOC 250 and PGCN/BOC 350 show a nearly identical absorption edge of 455 nm (See Fig. S6).The redshift of the absorption edge for PGCN/BOC 450 further verifies the existence of Bi doping, indicating that Bi doping effectively stimulates the absorption of visible irradiation.Fig. 5b is obtained from Fig. 5a according to Formula (1).Here, n 4 for PGCN and BOC.hv and A are the irradiation energy and the absorbance, respectively.According to the results in Fig. 5b, the E g values for PGCN and BOC are 2.59 and 2.25 eV, respectively.The VB-XPS in Fig. 5c reveals the energy difference between the maximum VB and E F .The values for PGCN and BOC are 2.24 and 1.98, respectively.In Fig. 5d, the Mott-Schottky plots reveal that PGCN and BOC with positive slopes belong to n-type semiconductors 70.The value of the slope is inversely proportional to the majority carrier density 71.As shown in Fig. S7, the slope of PGCN/BOC is larger than that of PGCN/BOC 450, illustrating that PGCN/BOC 450 has a higher electron density.Furthermore, massive electrons are transferred through heterojunction during the formation of a space charge region, leading to a more robust built-in electric field and benefiting the migration of photoexcited carriers 72.The flat potential is perceived as an approximative substitution for the Fermi level 73.Therefore, the E F values for PGCN and BOC are A0.92 and A0.41 eV (vs.SCE), which are equal to A0.68 and A0.17 eV (vs.NHE), respectively.Thus, the VB values for PGCN and BOC are 1.56 and 1.81 eV, and the corresponding CB values are A1.03 and A0.44 eV (See Fig. S8), respectively. Transient photocurrent response was used to detect the separation efficiency of photogenerated charge carriers.Fig. 6a shows that the PGCN/BOC composite possesses a higher photocurrent density than pristine PGCN and BOC, indicating that heterojunction boosts the separation of charge carriers 31,74.Furthermore, PGCN/BOC 450 shows a higher photocurrent density than PGCN/ BOC, implying that Bi self-doped heterojunction triggers enhanced the migration efficiency of charge carriers compared with the traditional van der Waals heterostructure.As shown in Fig. 6b, teadystate fluorescence spectroscopy was employed to detect the recombination of electron and hole pairs.The peak of PGCN is intensive in the 460-nm vicinity, implying the recombination of massive carriers.The intensity of BOC tends to be weak, which is ascribed to the robust internal electric field between the (Cl 2 ) 2A and (Bi 12 O 17 ) 2 layers 38.The intensity of fluorescence spectroscopy in the PGCN/BOC composite became weaker than that in PGCN, illustrating that PGCN/BOC effectively suppressed the recombination of charge carriers.Furthermore, the PGCN/BOC 450 composite exhibited a lower fluorescence intensity than PGCN/BOC, further manifesting the positive effect of doped heterojunction on suppressing the combination of charge carriers.The Nyquist plots in Fig. 6c reveal the migration resistance of charge carriers.PGCN/BOC 450 shows the smallest arc radius, proving that the Bi-doped step-scheme heterojunction is more beneficial to the transfer of interfacial charge carriers than the heterostructure without annealing.The Bode plots in Fig. 6d reveal the lifetime of photogenerated charge carriers.The lifetime of charge carriers in PGCN/BOC is longer than those in pristine PGCN and BOC.Meanwhile, the lifetime of charge carriers in PGCN/BOC 450 is nearly two times longer that in PGCN/BOC, indicating that the stepscheme heterojunction facilitates the effective separation of photo-irradiated carriers 75. The CH 4 yield served as the indicator of photocatalytic CO 2 reduction activity for the as-prepared photocatalysts.As shown in Fig. 7a, the PGCN/BOC composite shows an enhanced photocatalytic CO 2 reduction activity compared with pristine PGCN and BOC.Meanwhile, PGCN/BOC 450 shows a higher photocatalytic CO 2 reduction activity than PGCN/BOC, demonstrating that the step-scheme heterojunction exerts a positive effect on photocatalytic CO 2 reduction.Meanwhile, no noticeable activity loss under 36 h of continuous irradiation can be observed, indicating endurable stability for PGCN/BOC 450.In Fig. 7b, the photocatalytic CH 4 yield for pristine PGCN is difficult to diagnose, indicating the limited reactive site on the surface of pristine PGCN for photocatalytic CH 4 yield.As expected, the photocatalytic CH 4 yield rate for PGCN/BOC 450 is 24.4 lmmolAg A1 Ah A1 , which is 2.3 and 9.6 times greater than those of PGCN/BOC (7.4 lmmolAg A1 Ah A1 ) and BOC (2.3 lmmolAg A1 Ah A1 ).In addition, the photocatalytic performance of different mass ratios for the PGCN in the composite was further evaluated under the same conditions as shown in Fig. S10, and the 15 PGCN/BOC composite displays the optimal photocatalytic activity.The in situ diffused reflectance infrared FT spectroscopy (DRIFTS) spectra of the PGCN/BOC composite in Fig. 8 were studied to reveal the reaction mechanism of photocatalytic CO 2 reduction. The peaks at 1023, 1251, 1518, and 1621 cm A1 are ascribed to the carbonate species, whereas the peaks at 1289, 1318, 1361, 1541, 1559, 1702, and 1737 cm A1 can be attributed to the formate.The peaks at 1088, 1105, 1203, 1395, 1457, and 1654 cm A1 can be acribed to formaldehyde, and the peaks at 1737 and 1105 cm A1 belong to the vibration mode of methoxyl groups.CH 4 was not discovered because of its non-polar and poor affinity with the PGCN/ BOC 450 surface.Clearly, the carbonate species were detected before irradiation when CO 2 and H 2 O vapor existed in the reaction system.After detecting the excitations of visible light, formate, formaldehyde, and methanol, the intensities gradually increased with the decrease of carbonate species.The results imply that the photoconversion of CO 2 into CH 4 on the surface of PGCN/BOC 450 was performed through a typical two-electron, two-proton reaction pathway 30, and the possible mechanism of CO 2 reduction to the CH 4 generation path can be expressed as follows: The plausible charge carriers transfer mechanism of the stepscheme heterojunction is depicted in Fig. 9. Usually, the surface electron density difference is caused by different E F levels.The electrons will migrate from the semiconductor with a higher E F level to another lower one.According to Fig. 5d, PGCN has a higher E F level than BOC, thus the electrons on PGCN are inclined to migrate to BOC when PGCN and BOC are in close contact.The electrons will no longer migrate when the Fermi levels of the two semiconductors are in equilibrium.Therefore, PGCN loses electrons and becomes positively-charged and BOC receives electrons and tends to be negatively-charged at the interface 52, resulting in the formation of a built-in electric field between PGCN and BOC, with the orientation from PGCN to BOC.Synchronously, the band edge of BOC becomes down-warped due to the accumulation of electrons, while the band edge of PGCN tends to be up-warped owing to the loss of electrons.Under light illumination, PGCN and BOC can generate photo-excited electron-hole pairs and excite the electrons from VB to CB.In the presence of a built-in electric field, the photo-induced electrons in the BOC CB can easily combine with the photo-induced holes in the PGCN VB by ohmic contact.Simultaneously, the recombination of the electrons in the PGCN CB and the holes in the BOC VB is suppressed.Obviously, the charge carriers transfer pathway follows a step-like path, indicating the formation of the step-scheme heterojunction.Driven by the step-scheme pathway, the photo-generated electrons accumulate in the PGCN CB.The step-scheme heterojunction benefits the separation of spatial charge carriers and endows the photocatalyst with a strong redox capacity, which can promote the effective photocatalytic CO 2 reduction."
  },
  {
    "title": "Conclusions",
    "content": "In this work, we successfully fabricated a two-dimensional step-scheme heterostructured PGCN/BOC nanocomposite with a remarkably enhanced photocatalytic CO 2 reduction performance compared to pure BOC and PGCN.The porous structure of PGCN endows a large specific surface area and abundant reactive sites.Unlike the traditional PCGN and BOC, the BOC exfoliated through calcination displays a nanosheet structure and thus shorten the diffusion distance of the charge carriers 43,45,76.Furthermore, the different Fermi level positions between PGCN and BOC can result in electron density difference, leading to the formation of a built-in electric field and a step-scheme charge-transfer route.This step-scheme heterojunction can not only overcome the shortcomings of the traditional type-II and Z-scheme heterojunctions, but also effectively suppress the recombination of useful electrons and holes and accelerate the recombination of useless electrons and holes 52.In addition, the step-scheme heterojunction leaves more electrons in the CB of PGCN and retains holes in the VB of BOC, which is thermodynamically favored to photo catalytic reactions because of the large driving force provided by its strong redox abilities 77,78.This work will provide new insight into the design and fabrication of novel heterojunction photocatalysts and facilitate potential applications in photocatalysis toward solar energy conversion. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Fig. 1.Diagram illustration of the formation process of PGCN/BOC 450 composite. Fig. 3. TEM images of (a) PGCN, (b) BOC and (c) PGCN/BOC, HRTEM of (d) PGCN, (e) BOC and (f) PGCN/BOC, HAADF-STEM image of (g) PGCN/BOC 450 C and corresponding EELS mappings (the scale bar is 50 nm).The insets of (a) and (b) is corresponding FFT pattern and (c) SAED pattern.The insets in the top right corner of (d) and (e) are atomic layer model of PGCN and BOC.The insets in the bottom left corner of (e) and (f) are IFFT pattern. Fig. 4. XPS of (a) survey, (b) C 1s, (c) N 1s, (d) Bi 4f, (e) Cl 2p and (f) O 1s. Fig. 5. (a) UV-Vis DRS.The inset is material object picture, (b) (Ahm) 1/2 versus hm plots from (a), (c) VB-XPS spectra, (d) Mott-Schottky plots of PGCN, BOC, PGCN/BOC and PGCN/BOC 450. Photocurrent ( A cm -2) Fig. 8.The in situ DRIFTS spectra of the PGCN/BOC 450 composite in different wavenumber ranges: (i) without CO 2 gas and irradiation, (ii) with flowing CO 2 gas for 30 min without irradiation, (iii) with flowing CO 2 gas for 60 min without irradiation and (iv) irradiation for 30 min and (v) 60 min. Investigation, Formal analysis, Writing -original draft.Jinfeng Zhang: Software, Writing -review editing, Funding acquisition.Zhongliao Wang: Investigation, Writing -original draft.Kai Dai: Conceptualization, Resources, Investigation, Writing -review editing, Supervision, Funding acquisition.Chengsi Pan: Conceptualization, Formal analysis, Writing -review editing.Changhao Liang: Conceptualization, Resources, Writing -review editing. This work was supported by the National Natural Science Foundation of China (51572103 and 51973078), the Distinguished Young Scholar of Anhui Province (1808085J14), the Major projects of Education Department of Anhui Province (KJ2020ZD005) and the Key Foundation of Educational Commission of Anhui Province (KJ2019A0595). Supplementary data to this article can be found online at https://doi.org/10.1016/j.jcis.2020.10.048."
  }
]