[
  {
    "title": "Doi",
    "content": "10.1039/c9nr07824j"
  },
  {
    "title": "Article_Title",
    "content": "Highly selective conversion of CO<sub>2</sub> to C<sub>2</sub>H<sub>6</sub> on graphene modified chlorophyll Cu through multi-electron process for artificial photosynthesis"
  },
  {
    "title": "Abstract",
    "content": "Artificial photosynthesis is a promising strategy for converting carbon dioxide into hydrocarbon fuels through solar energy as it is clean, economical and environmentally friendly.Herein, we developed a selective and stable photocatalyst for CO 2 photocatalytic reduction into C 2 H 6 through a multi-electron transfer pathway without the external sacrificial regents.The core component of this composite catalyst was extracted from a silkworm excrement and modified to make chlorophyll Cu (Chl-Cu), which contained a porphyrin structure as an antenna for light absorption and a Cu cation as an active centre.We found that C 2 hydrocarbons such as C 2 H 2 , C 2 H 4 , and C 2 H 6 tended to generate on chlorophyll-a/graphene.After substituting Mg 2 with Cu 2 cations in the centre of the porphyrin and modifying with graphene, only C 2 H 6 was detected in the 18 hours reaction.This photocatalyst presented an outstanding activity and selectivity for the photocatalytic CO 2 reduction (CO 2 RR) with a C 2 H 6 yield rate at 68.23 mol m -2 h -1 under visible light irradiation and an apparent quantum efficiency of 1.26 at 420 nm.In this system, the porphyrin rings were excited to produce electron-hole pairs by light.The photo-induced holes oxidized water to produce oxygen while graphene worked as an adsorption centre and electron acceptor for the CO 2 reduction. Electronic supplementary information (ESI) available: Details of preparation, more SEM and TEM images of graphene and photocatalyst and measurement of UV-vis, CO 2 sorption.See"
  },
  {
    "title": "Experimental",
    "content": "Copper acetate, nitric acid (65 wt), sulfuric acid (98 wt), NH 4 NO 3 , chlorosulfonic acid (97 wt), H 2 O 2 (27.5 wt), Na 2 SO 4 , ethanol, acetone, and 1, 2 dichloroethane were provided by Sinopharm Chemical Reagent Co., Ltd, China.All of the above mentioned reagents were analytical grade, and used as purchased.The aqueous solutions were prepared with deionized water from a Millipore system (18 M cm). A silkworm excrement (500 g) was soaked in ethanol with ultrasonic treatment to extract the chlorophyll (Chl-a) into ethanol.Then, the mixture was filtered and concentrated to get the chlorophyll paste.In order to substitute the Mg 2 by Cu 2 , the chlorophyll paste was dissolved in an acetone solution of copper acetate (1 mol L -1 ) and stirred for 12 hours.After adding water and allowing to stand for 15 minutes, the organic phase was collected, and this procedure was repeated 3 times to remove the excess copper acetate.Through further purification by column chromatography, a deep green Chl-Cu was obtained. The graphene sheet (GS) was prepared using the method in our previous work with the details described in the ESI. 34 Herein, a convenient film preparation method involving mist spray was applied.Typically, Chl-Cu (60 mg) was dissolved in a 100 mL solution (0.2 mg mL -1 ) of GS suspended in 1, 2 dichloroethane (DCE).Through a spray lance, the dispersion was ejected onto a 10 cm 20 cm substrate (quartz or polyethylene terephthalate (PET) film) held at 100 C and driven by N 2 at a certain pressure (0.4 MPa).Finally, in order to dispel the adsorbed solvent molecules, the prepared g-Chl-Cu films were dried in a 100 C vacuum oven for 2 h. The 1, 2 dichloroethane solution of the photocatalysts was dropped on a glassy carbon electrode (GCE) for modification and naturally dried at room temperature.A 0.5 M Na 2 SO 4 solution (20 mL) was filled in a Pyrex electrolytic cell and purged with Ar.A AgAgCl electrode and Pt wire were used as the reference and counter electrodes, respectively.Impedance measurements were recorded with frequencies of 500 Hz, 1000 Hz, and 2000 Hz using a CHI660 electrochemical workstation to investigate the approximative conduction band of the Chl-Cu by a Mott-Schottky plot. A double-faced photocatalytic film on 200 cm 2 PET was placed in a one liter quartz chamber, which had valves on the gas circuit for gas feeding and evacuation as shown in Fig. S1. This chamber was fixed on an on-line vacuum system, which possessed a vacuometer.This on-line vacuum system was connected to a gas chromatography (GC) system by a sample line.The total volume of the chamber and vacuum system was 1455 cm 3 .The photographs of this reaction system are shown in Fig. S1a b. The film with catalyst was loaded into the chamber, and then the chamber was sealed and evacuated before the injection of the reactant gas.An airflow of 99.99 pure CO 2 passed through a de-ionized water container and entered the reaction chamber finally.In order to clear away the air as thoroughly as possible, these procedures for CO 2 pumping and evacuation were repeated several times.The relative humidity of the CO 2 and H 2 O gas mixture was controlled at 85, while the pressure in this vacuum system was controlled at 98 kPa, less than atmospheric pressure.All photocatalytic CO 2 RR experiments were carried out under the irradiation of a solar simulator with a filter to cut off the ultraviolet light below 400 nm.The power density of light was 100 mW cm -2 as tested by an optical power meter (FZ-A, Perfectlight, Beijing China).The equilibrium temperature of the samples was about 45 C (5 C) under the cooling of circulating water.Therefore, the product formation rates were not obviously influenced by temperature.The chamber was wrapped with aluminum foil to use the light more effectively.After a period of irridiation, 5 mL of the gaseous sample was transferred into the GC system through a negative pressure sampling system.Then, the sample passed through a valve block in the GC system and was injected into three kinds of GC columns with a flame ionization detector (FID) and thermal conductivity detector (TCD) in parallel."
  },
  {
    "title": "Results_and_Discussion",
    "content": "After the purification of Chl-a was tested by a UV-Vis spectrum, the Soret band was at 426 nm and the Q band was at 661 nm, which was consistent with the standard UV-Vis of Chl-a.When the Mg 2 in the porphyrin was changed by Cu 2 to form Chl-Cu, the Soret band shifted to 414 nm, simultaneously, and the Q band shifted to 646 nm, as shown in Fig. 1a.It deserves to be mentioned that the intensity ratio of the Soret band to Q band for Chl-a is 1.4, while that of Chl-Cu increased to 2.3.The substitution of the central cation resulted in a stronger light absorption, which is beneficial to photocatalysis. The Mott-Schottky plot for Chl-Cu was measured at pH 7.0 (in Fig. 1b) to roughly confirm the band structure.The slope of the plots are positive, indicating that Chl-Cu is an n-type semiconductor. 37,38It means that in Chl-Cu, photo-generated electrons can be transferred from the porphyrin group to other attached molecules or materials, while holes remain in the porphyrin group to oxidize the adsorbed molecules (H 2 O).The E CB of Chl-Cu was -0.81 V vs. AgAgCl (-0.61 V vs. NHE) at pH 7.0 (Fig. 1b) approximately; the energy gap of Chl-Cu was approximately measured to be 2.66 eV through UV-Vis measurements.Therefore, the E VB could be approximated to 1.85 V vs. AgAgCl (2.05 V vs. NHE).The redox potential of CO 2 /C 2 H 6 was calculated from the Nernst equation and the Gibbs free energy of reaction, which was -0.50 V vs. Ag AgCl (-0.30V vs. NHE) at pH 7.0.Comparing the energy bands of Chl-Cu with the redox couples of O 2 /H 2 O, 1,9 it can be theoretically stated that holes on the valence band can oxidize H 2 O to O 2 , while electrons on the conduction band of Chl-Cu can reduce CO 2 to low valence products (can be seen in Fig. 2a), indicating that photocatalysis can happen on Chl-Cu.Accordingly, the transfer of excitons from the chlorophyll antenna to the adsorbed CO 2 molecules were proposed in the following route (Fig. 2b): (i) electrons were excited from the valence band into the conduction band of Chl-Cu by light, (ii) the generated electrons were transferred to the conduction band of graphene, (iii) the H 2 O molecules that adsorbed on the porphyrin group were oxidized to O 2 , and (iv) the transferred electrons reacted with the CO 2 molecules adsorbed on graphene. Because the specific surface area of the porphyrins in the solid state was small, graphene was used to interact with Chl-a and Chl-Cu as the catalyst carrier to form g-Chl-a and g-Chl-Cu, respectively. 39,40Moreover, graphene is an excellent CO 2 adsorbent with a theoretical maximum uptake of 37.93 wt. 41he conventional methods used to make GS by the reduction of graphene oxide (RGO) were not effective in producing defect free GS as the defects that already existed in RGO would be left behind in the end product of graphene.A trap level would be introduced into the band gap of graphene by the defects, which will be the traps for electron diffusion. 22Therefore, we developed a method to prepare graphene with a few defects and a high conductivity to achieve a high electron transfer efficiency.The details of the preparation are described in the ESI. For inspecting the quality of the prepared GS, a sequence of characterizations was performed (Fig. 3).Scanning electron microscopy (SEM) measurements were employed to roughly assess the exfoliation state of GS (Fig. 3a), which clearly showed that the layers of the flakes decreased significantly in comparison to graphite (Fig. S2 ).This confirmed that GS was successfully prepared by the proposed exfoliation method.Transmission electron microscopy (TEM) and selected area electron diffraction (SAED) were effective measures to confirm the number of layers.In Fig. 3b, from the high-resolution TEM image, we can see only a few layers in GS.In the corresponding SAED analysis (Fig. 3c), a comparison of the intensity of the diffraction spots from the planes (1-210) and (0-110) confirmed the number of graphene layers, which was a bi-layer.This was due to the intensity ratio of I(0-110)/I(1-210) being approximately 1/2. 42Furthermore, the SEM and TEM images are listed in the ESI (Fig. S2 ).X-ray photoelectron spectroscopy (XPS) was performed to inspect the chemical composition of the graphene sheets as shown in Fig. 3d.The oxygen ratio of the as-prepared graphene was 3.1, suggesting that the exfoliation procedure introduced only a spot of oxygen.This was further confirmed by the C 1s XPS spectrum in the insert of Fig. 3d, where only a single peak associated with graphitic carbon around 284.5 eV was observed.Therefore, we concluded that this preparation procedure directly exfoliated graphite into GS without any oxidization processes. The Raman spectrum is shown in Fig. 3e, where the 2D band (2700 cm -1 ) and G band (1580 cm -1 ) were obviously visible in the sample spectrum.Meanwhile, the D band (1350 cm -1 ) showed a weak signal, which was attributed to edge effects. 43The intensity of the D peak in the prepared GS was very different from the peak in RGO according to the literature, demonstrating that the preparation procedure used in this work did not introduce any epoxides covalently bonded and other significant structural defects into the basal plane. 44n the Raman spectrum of GS, the number of the graphene nanosheet layers was ascertained by the 2D peak. 43The as-prepared GS was a few-layer graphene (FLG) with a thickness of less than 5 base layers on the peak position and profile. 43fter incorporating the previously prepared Chl-Cu with GS, the g-Chl-Cu photocatalyst film was made and inspected by SEM as shown in Fig. 4a andb.It was observed from Fig. 4a that the photocatalyst emerged as an incompact film that was favorable for light absorbance and gas adsorption.From the enlarged image in Fig. 4b, Chl-Cu attached on GS well and displayed a relatively homogeneous dispersion as marked in red circles.In order to examine the distribution of Chl-Cu on GS more visually, energy-dispersive X-ray (EDX) elemental mapping was performed as shown in Fig. 4c-h.The carbon element represents the graphene and carbon-containing group in Chl-Cu, and the N element and the Cu element represent the position of the central ring of the porphyrin in Chl-Cu.From Fig. 4, it can be better demonstrated that Chl-Cu attached on GS in a relatively homogeneous dispersion. The as-prepared photocatalyst films (g-Chl-Cu or g-Chl-a) were placed in an enclosed quartz chamber to carry out this gas-solid photocatalysis.The samples were analyzed using a gas chromatography system equipped with three kinds of GC columns, one FID and two TCDs.The FID and column enabled the separation and detection of most hydrocarbons (HCOOH, CH 3 OH, C 2 H 5 OH, C 2 H 2 , C 2 H 4 , C x H y , etc.).The TCDs were used for the measurement of the carbon oxides and hydrogen.Standard samples of all potential products were used to identify the calibrations.The standard samples (1 mL) exhibited a steady retention time and peak area, from which the unknown samples were analyzed by these criterions qualitatively and quantitatively. g-Chl-a was employed in the contrast experiments.After irradiation in CO 2 and H 2 O vapor, the signals for C 2 H 2 , C 2 H 4 , and C 2 H 6 were detected (Fig. 5a).The amount of product generation versus time during the photocatalytic reactions are provided in Fig. 5b, where the amount of C 2 H 6 reached as high as 511.2 mol m -2 after an 18 hours reaction.The average generation rates were calculated to be 4.06, 4.71, and 28.4 mol m -2 h -1 for C 2 H 2 , C 2 H 4 , and C 2 H 6 , respectively (Fig. 5c).Though the yield of C 2 H 2 and C 2 H 4 were also detected, it is worth noting that the catalytic products of g-Chla were all C 2 hydrocarbons, which meant that the porphyrin molecule in this structure was very beneficial for C 2 production.Additionally, g-Chl-a was not stable in this system since the high concentration of CO 2 led to a reaction of chlorophyll de- magnesium with the color changing from green to yellow after several days of the reaction.Therefore, g-Chl-a was not the optimal photocatalyst in this system and needs improvement. In order to improve the catalyst properties, the Mg 2 in the center of the porphyrin molecule was substituted by Cu 2 .The modified g-Chl-Cu as a photocatalyst exhibited excellent selectivity and activity for CO 2 RR with only C 2 H 6 detected in the GC spectrum (Fig. 6e).The inverted peak corresponded to the un-reacted H 2 O. Fig. 6a also shows the yield for the hydrocarbons on the g-Chl-Cu photocatalysts.It was obvious that the average production rate of C 2 H 6 was 68.23 mol m -2 h -1 .Our photocatalysts were superior to the earlier studies regarding the production where primarily nanoparticles were used (3.5-8.2 mol m -2 h -1 ). 22Hydrogen was not detected in the GC spectrum, indicating that the amount of evolved H 2 from water reduction was in trace amounts or it was not produced at all, perhaps due to the hydrophobic property of graphene.CH 4 signals, the target product in some earlier studies, was not detected either (Fig. 6e).Other potential products as the reactive intermediates of CH 4 such as CH 2 O (can be detected by TC detectors) and CH 3 OH, were not detected either.This exceptional result suggested that the photocatalytic process described in this work had an outstanding selectivity for C 2 H 6 .Furthermore, we measured the apparent quantum efficiency (AQE) of CO 2 RR on the basis of the ferrioxalate actinometer method.The AQE of the g-Chl-Cu samples reached 1.26 at 420 nm and the C 2 H 6 yield was 0.77 after 18 hours of irradiation. To confirm whether the products were generated through catalysis or decomposition of the photocatalyst itself, a series of control experiments were performed.The photocatalyst film was either irradiated in an enclosed chamber with a N 2 or O 2 atmosphere or was heated to 50 C in a CO 2 atmosphere chamber without light irradiation.No hydrocarbons were detected (Fig. 6a) in all of the experimental conditions after the 18 h reaction, indicating that g-Chl-Cu was very stable under light irradiation and the products were indeed from the photocatalysis.For the purpose of a deeper investigation, determining recycling times for the photocatalytic reactions is a good method to evaluate the stability of the as-prepared photocatalysts (Fig. 6b).No obvious deterioration in the catalytic activity was observed after 5 times, also manifesting the high stability of the g-Chl-Cu photocatalysts.Therefore, the UV-Vis tests used for the g-Chl-Cu photocatalyst film after the photocatalytic reaction proved the stability of the photocatalyst once again (Fig. S4 ). A control experiment was performed on Chl-Cu to investigate the role of graphene alone.As shown in Fig. 6a, no products were detected.As reported, porphyrins as the light absorber and photocatalyst have to contain donors to enhance the charge separation and transfer in a liquid homogeneous reaction. 2,45Therefore, in the absence of graphene sheets as a CO 2 adsorbent and excellent electron transfer mediator, the photoreduction is difficult to occur.Additionally, as reported in literature, conjugated structure materials such as Nafion, thiophene derivatives, and g-C x N y all showed positive effects on promoting electron transfer, stabilizing the products in the transition states, as well as facilitating the generation of C x organics either in electrocatalysis or photocatalysis. 2,46,47hen the dosage of Chl-Cu was changed in the photocatalyst, the photocatalytic performance varied (Fig. 6c).When graphene was held at a constant amount of 20 mg, the amount of product increased with the increase in grams of Chl-Cu from 0 to 60 mg.This was ascribed to the increased photo-generated electron-hole pairs and active centers.However, when the amount of Chl-Cu exceeded 60 mg, the photocatalytic activity reversely decreased, which was ascribed to the agglomeration of Chl-Cu and the block in electron transfer to graphene.This proved the importance of graphene in this system once again from another perspective.Moreover, the CO 2 sorption tests directly revealed the role of graphene on CO 2 capture.The maximum CO 2 uptake of g-Chl-Cu was ca.37.5 cm 3 g -1 at 25 C as shown in Fig. S5, with a high BET surface area of 75.9 m 2 g -1 .However, the Chl-Cu powder showed a maximum uptake of ca. 2 cm 3 g -1 CO 2 and a 1.5 m 2 g -1 BET surface area (Fig. S6 ).Concentration of O 2 in the reaction chamber was observed to increase after photocatalytic reaction through the molecular sieve column and TCD in GC.The O 2 to C 2 H 6 ratio was close to the expected 3.5 : 1 stoichiometry after the 18-hour reaction (Fig. 6d).This confirmed that the water oxidation reaction also occurred on the photocatalyst, which consumed the photo-induced holes to realize sacrificial regent-free CO 2 RR.Furthermore, a 13 CO 2 isotope experiment was employed to directly confirm that the carbon source of the C 2 H 6 product was from the CO 2 molecules.Only 13 C 2 H 6 was detected when 13 CO 2 and H 2 O were the reactants (Fig. 6f ), thus confirming that C 2 H 6 originated from the CO 2 molecules. The three factors that in general influenced the photocatalytic process were light absorption, charge carrier separation, and catalysis on the surface.In our system, all three aspects were taken into account during the design of the photocatalysts.Chl-Cu was active in the visible light absorption, which enhanced the CO 2 conversion to a certain extent.Graphene with less defects not only worked as an electron acceptor, but also provided a large surface area for the Chl-Cu distribution and CO 2 capture as shown in Fig. S5 andS6. Therefore, a decent photocatalytic performance resulted from all three aspects due to the synergistic effect between the two components (Chl-Cu and graphene).At first, the special structure of the porphyrin molecule (big electron structure) in this composite system combined with GS by a - effect, which ensured a fast electron transfer from the porphyrin to graphene.Simultaneously, the central cations (Cu 2 and Mg 2 ) easily adsorbed the H 2 O molecules for water oxidation compared to the CO 2 molecules as confirmed by our earlier work. 34Secondly, because Chl-Cu is an n-type semiconductor with suitable energy levels, the photogenerated electrons were transferred out while the holes were confined.This process was demonstrated by electrochemical impedance spectra (EIS) and steady-state PL spectra. 48499505152 The Nyquist plots shown in Fig. 7a b revealed that after the Chl-Cu composite with graphene, g-Chl-Cu had a ten-fold resistance reduction in the equivalent circuit, which suggested that a lower charge-transfer resistance from Chl-Cu to graphene permitted a fast separation and transport of the photoexcited charges.On the other hand, the PL quenching of the composite was visible in the steadystate PL spectra (Fig. 7c).In this case, it indicated that an electron-transfer pathway from Chl-Cu to graphene was formed in a nonradiative quenching manner.Furthermore, the photocurrent tests on Chl-Cu and g-Chl-Cu explained this electrontransfer phenomenon more intuitively (in Fig. 7d).Before being composited with graphene, Chl-Cu showed a weak photocurrent signal.On the contrary, the signal intensity of g-Chl-Cu increased nearly ten-fold.Consequently, under light irradiation, the photoinduced electrons tended to transfer to graphene due to the relatively low energy barrier, which subsequently reacted with the adsorbed CO 2 molecules on the graphene plane.In this case, this composite photocatalyst presented a decent productive rate and high selectivity. C-C coupling into C x from CO 2 was a crucial reaction in the energy regeneration of CO 2 .Some research studies proposed a potential mechanism for the CO 2 electroreduction.Some reports that supported this C-C coupling process complied with certain procedures of the Fischer-Tropsch catalysis (CO H 2 C x H y O z ). 5354455 In this work, the photocatalysis was regarded as two processes, a light absorption process to generate electrons and an electrocatalytic process to use the excited electrons.Therefore, in this paper, the principle of CO 2 electroreduction was borrowed to construct a possible reaction mechanism for transforming CO 2 into a C 2 hydrocarbon by the photocatalytic process.It was widely accepted that the production of C 2 H 6 has two feasible base mechanisms.One pathway is through a COH intermediate, in which CO 2 is reduced to -CH 3 on the catalyst surface and then coupled to C 2 H 6 565758 as shown in Fig. S7. The other mechanism is via the reduction of CO/CO 2 dimer on the catalyst to ethylene and further hydrogenation to C 2 H 6 . 27,58However, the first mechanism is not suitable for our catalytic system for two reasons.First, it was confirmed that this process was not a one-electron reduction of CO 2 because a formed CO 2 -by one electron is very disadvantageous (the first step shown in Fig. S7, circled in a red square).The reduction potential of -2.14 V vs. SCE is much higher than the photovoltage of Chl-Cu (or Chl-a).The structural change from linear CO 2 to bent CO 2 -at least requires an overpotential of 0.1-0.6V in the rapid reduction procedure due to the kinetic restrictions. 2Secondly, the intermediate products in the first mechanism route are mainly CO and formic acid.The final product is mainly methane besides the ethane formed by the -CH 3 coupling.However, in our experiment, no CO and methane were detected, suggesting that this mechanism was not suitable.Therefore, using the CO/CO 2 coupling pathway, the proton-assisted multiple-electron transfer was a more favorable and alternative pathway to reduce CO 2 . 46,53,54,59,60The reaction result for g-Chl-a as a photocatalyst (a small amount of C In this artificial photosynthesis system, water acted as the electron donor (2H and provided electrons.It also served as the main source of protons for the following CO 2 reduction.In addition, water and CO 2 suffered from competitive adsorption on the porphyrin center, which was mentioned in our previous results. 34Water has a larger binding energy and shorter bond length, thus showing a greater competitive advantage in combining with the central cation in porphyrin.Therefore, the H 2 O oxidation reaction occurred ahead of the reduction of CO 2 .In this case, this multi-electron reaction (H 2 O oxidization) was the rate-limiting step.Then, it provided multi-electrons and multi-protons for the subsequent reduction in one effort.Multi-protons are beneficial to decrease the reduction potential of CO 2 . 46,59Multielectrons are in favor of C-C coupling. 54,55Accordingly, a drawing of the possible mechanism was provided by Amatore et al.The first steps maybe the formation of oxalate through the self-coupling of CO 2 in the presence of multi-electrons and multi-protons. 27The generation of oxalate is a critical step in transforming CO 2 to C 2 compounds, the details of which can be seen in Fig. 8.The second step is the conversion of C 2 H 2 from oxalate through a series of processes: dehydration of a vicinal diol, tautomerization of a ketone/enol, and dehydration of an enol.The last step is the reduction of C 2 H 2 to C 2 H 6 by a series of hydrogenation reactions. 61622636465 All of the intermediates were in the delocalized electronic structure as shown in the steps in Fig. 8.The intermediates were attached on the GS surface via a - non-covalent bond, which received the electrons uninterruptedly until they were reduced to C 2 H 6 .In addition, the electrostatic interaction, polarization effect, and charge dispersion effect strengthened the interaction of the intermediates and graphene, 66,67 which further increased the stability of the intermediates. 46,55The reason why Chl-Cu showed a higher selectivity than Chl-a was attributable to the potential changes in the photogenerated electrons after Cu 2 substitution. 54"
  },
  {
    "title": "Conclusions",
    "content": "In summary, converting CO 2 to chemicals via a photocatalytic method can effectively reserve the solar energy in chemicals. Moreover, the possibility that CO 2 can be photoreduced to C x compounds by artificial photosynthesis will be of great significance in the future.In this work, the product of C 2 H 6 showed a considerable amount by visible light irradiation.The presented photocatalyst demonstrated a high selectivity as well.The selectivity of the CO 2 conversion to one product was only enhanced through controlling the electron transfer path by effectively combining the properties of Chl-Cu and graphene in this photocatalyst.The improved selectivity was obtained by coupling the component materials, which had proper structures and special physicochemical properties.A possible and rational reaction mechanism was proposed to interpret the multi-electron pathway, which provided a more efficient and selective photocatalytic CO 2 RR. Fig. 1 (a) UV-Vis spectra of Chl-a and Chl-Cu at 0.1 mg ml -1 in 1,2 dichloroethane.(b) The Mott-Schottky plot of Chl-Cu was performed in 0.5 M Na 2 SO 4 with a frequency of 500 Hz, 1000 Hz, and 2000 Hz. Fig. 2 (a) Band structure of Chl-Cu and the redox potential of the H 2 O and CO 2 reactions with respect to NHE and the vacuum at pH 7.0.The redox potential of CO 2 /C 2 H 2 and CO 2 /C 2 H 6 were obtained by a calculation with the Nernst equation and the Gibbs free energy, the others refer to the literatures. 1,2(b) The potential electron transfer process among Chl-Cu, graphene, H 2 O and CO 2 . Fig. 3 SEM image (a) and HR-TEM image (b) of GS.The stripes stand for the layers of GS and (c) the corresponding SAED.(d) XPS full spectrum.The inset is a high-resolution C 1s spectrum of GS.(e) Raman spectrum of GS on a SiO 2 substrate excited by 514.5 nm laser. Fig. 4 (a and b) SEM images of a g-Chl-Cu film in different magnification.(c) SEM images of g-Chl-Cu powder.(d) The corresponding layered SEM-EDX elemental mapping of C, N, O, and Cu elements in one image.EDX elemental mapping of C (e), N (f ), O (g), and Cu (h). Fig. 5 (a) The GC spectrum of the products in the reaction chamber after the reaction using g-Chl-a.(b) Plots of products vs. time for g-Chla and (c) the corresponding average reaction rate. Fig. 6 (a) Plots of the generated products vs. time for the g-Chl-Cu catalyst loaded on the film.(b) The stability testing of g-Chl-Cu (five cycles).(c) Plots of hydrocarbon generation vs. Chl-Cu in a different mass composite with 20 mg GS after an 18 h irradiation.(d) Production of oxygen and ethane on the photocatalyst double-faced coating on 200 cm 2 PET in 18 hours.(e) The products in the reaction chamber after the reaction were tested by GC.(f) 13 CO 2 isotope experiment for C 2 H 6 analyzed by GC-MS. Fig. 7 (a) EIS spectra of g-Chl-Cu and Chl-Cu.(b) EIS spectra of g-Chl-Cu.The insert is the equivalent circuit, a solution resistance (R s ), an interfacial constant phase element (CPE I ) in parallel with a charge-transfer resistance (R ct ), and a bulk resistance (R B ) in parallel with a bulk constant phase element (CPE B ). (c) Steady-state PL spectra of g-Chl-Cu and Chl-Cu.(d) Photocurrent of Chl-Cu and g-Chl-Cu on the ITO electrode irradiated under visible light. cm 2 PET in 18 hours.(e) The products in the reaction chamber after the reaction were tested by GC. (f)13 CO 2 isotope experiment for C 2 H 6 analyzed by GC-MS. This journal is The Royal Society of Chemistry 2019 This work was supported by the National MCF Energy RD Program (2018YFE0306105), the National Natural Science Foundation of China (NSFC), China (No. 21627809 and 21501169), the National Natural Science Foundation of China (51725204, 51572179, 21771132, 21471106, and 21501126), the Natural Science Foundation of Jiangsu Province (BK20161216), the Collaborative Innovation Center of Suzhou Nano Science Technology, the Priority Academic Program Development of Jiangsu Higher Education Institutions (PAPD), the 111 Project, and the Guangdong Province Key Area RD Program (2019B010933001). There are no conflicts to declare."
  }
]