[
  {
    "title": "Doi",
    "content": "10.1016/j.jechem.2020.10.038"
  },
  {
    "title": "Article_Title",
    "content": "3D hierarchical architecture collaborating with 2D/2D interface interaction in NiAl-LDH/Ti3C2 nanocomposite for efficient and selective photoconversion of CO2"
  },
  {
    "title": "Abstract",
    "content": "This is a PDF file of an article that has undergone enhancements after acceptance, such as the addition of a cover page and metadata, and formatting for readability, but it is not yet the definitive version of record.This version will undergo additional copyediting, typesetting and review before it is published in its final form, but we are providing this version to give early visibility of the article.Please note that, during the production process, errors may be discovered which could affect the content, and all legal disclaimers that apply to the journal pertain."
  },
  {
    "title": "Experimental",
    "content": "Ni(NO 3 ) 2 6H 2 O (99) and Al(NO 3 ) 3 9H 2 O (99) were both obtained from Aladdin and used as the precursors for NiAl-LDH.Ti 3 AlC 2 and ammonium fluoride were obtained from Macklin.Hydrofluoric acid and urea were supplied by Aladdin, and all other chemicals used in the experiments were purchased from the Shanghai Chemical Reagent Company. Ti 3 C 2 was prepared by selectively etching the Al atoms from Ti 3 AlC 2 in a HF solution (40) 34.The obtained Ti 3 C 2 was rinsed repeatedly with deionized water and dried under vacuum. Fig. 1(a) displays the in situ loading of Ti 3 C 2 on NiAl-LDH.The obtained Ti 3 C 2 (1 g) was dispersed in DMSO (100 ml) and stirred overnight.Then, the powder was separated and sonicated in ionized water.The suspension was centrifuged for 1 h.The supernatant was collected, and the concentration of Ti 3 C 2 was determined to be 15 mg/mL.The Ti 3 C 2 dispersion was mixed with Ni(NO 3 ) 2 6H 2 O (0.87 g), Al(NO 3 ) 3 9H 2 O (0.375 g), NH 4 F (0.592 g) and urea (2.4 g).The mixture was sonicated and vigorously stirred for 0.5 h.Then, the solution was transferred into a Teflon-lined autoclave (100 mL) and kept at 120 C for 24 h.During the crystallization process, Ti 3 C 2 was deposited on the scaffold of NiAl-LDH.The obtained sample was washed alternatively with deionized water and alcohol.In this manner, NiAl-LDH/Ti 3 C 2 hybrids with different volumes of Ti 3 C 2 dispersions (10, 30 and 60 ml) were obtained and denoted LDH/TC-1, LDH/TC-2 and LDH/TC-3.For comparison, bare NiAl-LDH without the modification by Ti 3 C 2 was also prepared using the same procedure. X-ray diffraction (XRD) measurements of the samples were conducted on a Brucker D8 diffractometer with a Cu Ka radiation source.The sample morphologies were investigated using a field-emission scanning electron microscope (FESEM, HITACHI S-4800) equipped with an energy-dispersive X-ray spectrometer (EDS, Oxford instruments X-Max).Transmission electron microscopy (TEM) images were recorded using an FEI Tecnai F20 microscope at an accelerating voltage of 100 kV.X-ray photoelectron spectroscopy (XPS) was carried out on a PHI-5000C ESCA system (Perkin-Elmer) with Mg K radiation (h 1253.6eV).The UV-vis diffuse reflectance spectrum (UV-vis-DRS) was measured using a Shimadzu UV-2600 spectrometer and transformed into an absorption spectrum according to the Kubelka-Munk relationship. The specific surface areas and pore diameter distributions were measured using nitrogen adsorption-desorption isotherms at 77 K obtained with an automatic surface area analyser (Micromeritics Tristar-3000, USA).Photoluminescence (PL) emission spectra were recorded using a PerkinElmer LS 55 Fluorescence spectrometer at 355 nm.The photoluminescence (PL) decay profiles were obtained using a Horiba Jobin-Yvon Fluorolog-3-21-TCSPC spectrometer. The photocatalytic performance of the catalysts was evaluated under irradiation by a 300 W Xenon arc lamp.In each test, the sample (0.1 g) and deionized water (0.4 mL) were introduced as the reducer.The reaction setup was filled with highly purified CO 2 gas to achieve adsorption-desorption equilibrium prior to irradiation.Then, the lamp was turned on for 6 consecutive hours.During irradiation, approximately 1 mL of gas was removed for subsequent analysis performed using a gas chromatograph (GC-2014, Shimadzu Corp., Japan) that is equipped with both FID and TCD detectors.The carrier gas was high-purity Ar gas.The isotope-labelled experiments were performed using 13 CO 2 and H 2 18 O as the reactants, and the products were analysed using gas chromatography-mass spectrometry (QP2010SE, Shimadzu Corp., Japan). Transient photocurrent and electrochemical impedance spectroscopy measurements were performed using a CHI760E electrochemical workstation.A standard threeelectrode configuration was applied, and 0.5 M Na 2 SO 4 solution was used as the electrolyte.Fluorine-doped tin oxide (FTO) glass coated with the sample was used as the working electrode.Pt sheets and a saturated calomel electrode (SCEs) were used as the counter electrode and reference electrode, respectively.The measurements were operated at open-circuit potential.A sinusoidal ac perturbation of 5 mV was applied to the electrode over the frequency range from 0.01 Hz to 10 kHz.The XRD pattern for NiAl-LDH (Fig. 1b) displays the characteristic features of hydrotalcite-type compounds.The diffraction peaks at 11.3, 22.8, 34.6, 39.0, 46.2, 60.2 and 61.5 are assigned to the (003), (006), ( 012), ( 015), (018), ( 110) and (113) planes, respectively, and are in accordance with the standard (JCPDS 22-0452) 32."
  },
  {
    "title": "Results_and_Discussion",
    "content": "For Ti 3 C 2 , the diffraction peak for the (104) plane at 39 disappeared, indicating the transformation from Ti 3 AlC 2 to Ti 3 C 2 after etching by HF (Fig. S1) 35.The (002), (004), ( 006) and (110) planes of Ti 3 C 2 can all be observed.LDH/TC hybrids with different weight ratios of Ti 3 C 2 present similar diffraction patterns to that of bare NiAl-LDH.Owing to its low mass fraction, the diffraction peaks for Ti 3 C 2 cannot be identified in LDH/TC-1.Upon adding more Ti 3 C 2 , the diffraction peaks at 9.6 in LDH/TC-2 and LDH/TC-3 becomes more evident and stronger, indicating the existence of Ti 3 C 2 .Raman spectroscopy was further used to demonstrate the presence of Ti 3 C 2 .As displayed in Fig. 1(c), pristine NiAl-LDH exhibits prominent signals at approximately 150, 500 and 1060 cm -1 resulting from the symmetric stretching vibrations of metal-oxygen-metal bonds, metal-oxygen bonds and interlayer anions, respectively 36.The 1 , 2 , 3 and 4 Raman-active phonon vibrations of Ti 3 C 2 can be observed at approximately 170, 260, 405 and 605 cm -1 , respectively 37.For the LDH/TC-2 hybrid, although the Ti 3 C 2 content is low, the characteristic signals belonging to Ti 3 C 2 can still be distinguished. The morphology and material composition of pristine NiAl-LDH, Ti 3 C 2 and the LDH/TC composites were further analysed using SEM, TEM, and energy-dispersive X-ray (EDX) measurements.As shown in Fig. 2(a), pristine Ti 3 C 2 presents a bulky structure with typical smooth surfaces.After exfoliation and centrifugation, the supernatant of the Ti 3 C 2 colloid was directly used for preparation of the hybrid.The colloidal solution presents a prominent Tyndall effect (Fig. S2), indicating the small particle size and good dispersion of the Ti 3 C 2 nanosheets.The bare NiAl-LDH shows a flower-like hierarchical architecture that is constructed from large amounts of nanoplates (Fig. 2b).The average diameter of NiAl-LDH is approximately 4 m.After the incorporation of Ti 3 C 2 , the appearance of LDH/TC-1 is nearly the same as that of pristine NiAl-LDH due to the low Ti 3 C 2 content.In contrast to the spiny surfaces for LDH/TC-1, the nanoplates in LDH/TC-2 appear to have merged, forming evidently roughened surfaces.The voids among the NiAl-LDH nanoplates may be stuffed by the Ti 3 C 2 nanosheets.From this point of view, the uniform combination of Ti 3 C 2 and NiAl-LDH is realized, and a well-defined 2D/2D heterogeneous interface can be proposed. Moreover, the EDS elemental mapping image for LDH/TC-2 (Fig. S3) shows the welldistributed Ti, Ni and Al elements, demonstrating that NiAl-LDH and Ti 3 C 2 jointly contribute to the formation of the 3D hierarchical structure.When the amount of Ti 3 C 2 suspension used in the synthesis was increased to 60 mL, many bulky conglomerates were formed in LDH/TC-3 (Fig. 2e).The density of LDH/TC-3 is increased, and the contact between the two constituents becomes irregular. As shown in the TEM image of the samples (Fig. S4 and Fig. 3), NiAl-LDH is constructed by numerous nanoplates.The size of this hierarchical structure is consistent with the observation in the SEM image.After the deposition of Ti 3 C 2 , LDH/TC-2 presents a more closely packed architecture than that of the pristine NiAl-LDH, but the overall size shows no variations.In the elemental mapping images (Figs.3c-f), the coexistence of Ni, Al, Ti and O further demonstrates the successful loading of Ti 3 C 2 on the surfaces of NiAl-LDH.High-resolution transmission electron microscopy (HRTEM) is further used for the characterization of the layer-packed structure and the interface of the composite.As observed from the edge of a particle (Fig. 3g), the lattice spacing of 0.15 nm corresponds to the (1 1 0) planes of NiAl-LDH 31, and 0.26 nm represents the (0 1 1 0) crystal planes of Ti 3 C 2 MXene 38.These two materials are stacked in layers.It is important to note that the seamless interfaces between NiAl-LDH and Ti 3 C 2 MXene can be identified, and a close 2D/2D contact is beneficial for charge migration 39.Moreover, the HAADF-STEM image of the bottom right corner and the corresponding EDS elemental mapping images of Ni, Al, O and Ti clearly illustrate the homogeneous composition of NiAl-LDH and Ti 3 C 2 even at the edge of the sample.The formation of numerous 2D/2D assemblies can be proposed.The composition of NiAl-LDH, Ti 3 C 2 and LDH/TC-2 composite was further investigated using XPS survey spectra (Fig. 4a).It is found that NiAl-LDH is composed of Ni, Al, C and O elements.Ti and C elements can be found in Ti 3 C 2 .For LDH/TC-2, the signal for Ti is not evident in the survey spectrum due to the low content of Ti 3 C 2 . However, the coexistence of Ni, Al, Ti, C and O elements can be demonstrated from the high-resolution spectra of the samples, confirming the hybridization of NiAl-LDH and Ti 3 C 2 .Fig. 4(b andc) show the Ni2p and Al2p high-resolution spectra of the samples, respectively.The binding energies at 856.0 eV and 873.5 eV are assigned to Ni 2p 3/2 and Ni 2p 1/2 , respectively.The presence of satellite peaks at 861.8 eV and 879.7 eV signifies the presence of high-spin divalent Ni 2 in this hydrotalcite 40.After doping with Ti 3 C 2 , the binding energies of Ni 2p 3/2 and Ni 2p 1/2 shift to higher values of 856.1 eV and 873.6 eV, respectively, in LDH/TC-2, and the satellite peaks can still be observed.For Al 3 , the high-resolution spectrum can be deconvoluted into two peaks located at 68.3 eV and 74.3 eV 41, and a slight increase in the binding energy is also present after the composition change.For Ti 3 C 2 MXene, the Ti2p high-resolution spectrum can be deconvoluted into six peaks at 453.9, 457.7 458.1, 460.0, 462.1 and 463.2 eV, corresponding to the Ti-C, Ti-O, and Ti-F species (Fig. 4d) 42.It is important to note that the binding energies of Ti2p in LDH/TC-2 are obviously decreased compared with that of pristine Ti 3 C 2 .Based on the variation of the binding energies for LDH/TC-2 compared with that of pristine NiAl-LDH and Ti 3 C 2 , the electron transfer from NiAl-LDH to Ti 3 C 2 in LDH/TC-2 can be considered to be present 43.The strong interfacial interaction and facile charge migration are beneficial for the separation of photoinduced charge carriers, thus enhancing the photocatalytic activity of LDH/TC-2.indicating the formation of a mesoporous structure owing to the aggregation of nanosheets 44.By contrast, bulk Ti 3 C 2 is a nonporous material and exhibits no hysteresis loop.The BET specific surface area of Ti 3 C 2 is 1.96 m 2 /g.For NiAl-LDH and LDH/TC-2, the corresponding values were 54.08 m 2 /g and 44.75 m 2 /g, respectively. As observed from the pore-size distribution curves (Fig. 5b), there are two aperture distribution ranges for NiAl-LDH and LDH/TC-2.The pore size of approximately 2 nm is contributed by the closely stacked particles, and the large diameter ranging from 5 nm to 70 nm originates from the exterior loosely packed NiAl-LDH plates.Thus, the three-dimensional tunnel structure can be suggested.It is noteworthy that the fraction of large pores evidently decreased after the deposition of Ti 3 C 2 onto NiAl-LDH, and the content of small pores increased in LDH/TC-2.This indicates that many large voids in the hierarchical NiAl-LDH have been stuffed by Ti 3 C 2 .The two 2D materials are highly compatible, contributing to a well-defined 2D/2D heterogeneous interface. These results are consistent with the above-described results of the SEM and TEM observations.For pristine Ti 3 C 2 , a nonporous structure can be demonstrated. The photoabsorption capacity of the prepared NiAl-LDH, Ti 3 C 2 and LDH/TC composites was investigated by UV-vis diffuse reflectance spectroscopy (DRS).As shown in Fig. 5(c), NiAl-LDH presents three absorption bands ranging from the ultraviolet region to the visible light region.The first band at 200-300 nm is assigned to the ligand-to-metal charge transfer from the O 2p orbital to the Ni 3d t 2g orbital, and the other two bands both result from the d-d transitions of the Ni 2 ions in an octahedral field 45.Ti 3 C 2 displays full-spectrum absorption features owing to its darker colour (inset of Fig. 5c).For the composites, their photoabsorption properties are similar to that of NiAl-LDH because of the low ratio of Ti 3 C 2 , and the light absorption intensity is slightly increased.Generally, a higher Ti 3 C 2 content corresponds to a stronger absorption bands.Although the loading of Ti 3 C 2 cannot strengthen the excitation of NiAl-LDH, the adsorption-desorption capacity and charge migration may be enhanced by the photothermal effect of Ti 3 C 2 46.In addition, the bandgap energy of NiAl-LDH can be calculated from the following empirical formula: h A (h-E g ) n/2 .As shown in Fig. S5, the estimated band gap for NiAl-LDH is 2.36 eV. The photocatalytic CO 2 conversion over the as-prepared catalysts was investigated and is shown in Fig. 6.Both CO and CH 4 are generated for all of the samples, and CO is the main product.Upon prolonging the irradiation time (Fig. 6a), the yield of CO increases linearly.The yield of CO for the bare NiAl-LDH was 22.74 mol g -1 after 6 h of irradiation.After the incorporation of Ti 3 C 2 , the production of CO for the composite samples obviously increased.Comparison of these samples with different contents of Ti 3 C 2 shows that LDH/TC-2 exhibits the best performance.Due to the insufficient or excessive amount of Ti 3 C 2 , the effect of the co-catalyst cannot be fully elucidated.Fig. 6(b) compares the CO and CH 4 evolution rates for NiAl-LDH and the three composite samples.The average CO production rate of bare NiAl-LDH is 3.79 mol g -1 h -1 .Modification of Ti 3 C 2 obviously improved the photocatalytic performance of NiAl-LDH.LDH/TC-2 shows 11.82 mol g -1 h -1 for CO production, which is 3.2 times higher than that of the bare NiAl-LDH.In addition, the selectivity of the three hybrids towards CO production is impressively higher than 92.After four cycles of recycling tests, LDH/TC-2 shows no significant decrease in the CO yield (Fig. 6c), demonstrating its favourable durability and stability.Control experiments were then performed, and no appearance of production was detected without irradiation, CO 2 or photocatalyst.This strongly demonstrates that the photocatalytic CO 2 reduction was driven by irradiation upon the photocatalysts.Moreover, isotropic experiments using both 13 CO 2 and H 2 18 O are performed to investigate the carbon source of the products and the oxidation half-reaction.As shown in Fig. 6(d), the introduced 13 CO 2 and the produced 13 CO are well-separated and are observed respectively at 1.6 min and 1.2 min in the chromatogram.Then, 13 CO is ionized, and the signals at m/z13, 16 and 29 are detected (inset of Fig. 6d).This unambiguously confirms that the carbon source of CO is the introduced CO 2 .Meanwhile, the oxidation products are carefully examined in Fig. 6(e).O 2 evolves as the product of water oxidation, as can be demonstrated by the generation of 18 O 2 .The presence of 16 O 2 originates from the dehydration of the COOH intermediate during the photoreduction of CO 2 and the subsequent oxidation.This in situ formed H 2 16 O from CO 2 reduction is easily oxidized.The diffused oxygen in the reactor and the sampling needle also contributed to the 16 O 2 signal.Therefore, this peak has high intensity. 16O 18 O is the product of photocatalytic gas oxygen isotope exchange between l8 O 2 and 16 O 2 47,48.The high activity of H 2 16 O originated from CO 2, and the fast oxygen isotope exchange equilibrium ( 18 O 2 16 O 2 2 18 O 16 O) enhance the peak of To elucidate the different photocatalytic performance characteristics of the samples, the transfer behaviour of photoinduced charge carriers of NiAl-LDH and LDH/TC-2 was first investigated by photoluminescence (PL) spectroscopy.As shown in Fig. 7(a), NiAl-LDH presents two main emission bands centred at approximately 468 nm and 520 nm that are assigned to blue light and band-to-band emission peaks, respectively 49. The peak position at 520 nm is nearly equal to the band gap of NiAl-LDH, i.e., 2.36 eV (525 nm).After decoration with Ti 3 C 2 , the PL intensity of LDH/TC-2 decreased, revealing the depressed rate of the recombination of photoinduced electrons and holes. Moreover, an enhanced charge transfer efficiency can be suggested.Subsequently, nslevel time-resolved photoluminescence (TRPL) spectroscopy was used to characterize the charge transfer dynamics (Fig. 7b).The radiative lifetimes () can be obtained by fitting the decay curves with a biexponential function (Table S1).LDH/TC-2 shows a clearly decreased fluorescence lifetime ( 0.95 ns) compared to that of NiAl-LDH ( 1.23 ns), indicating the more efficient charge transfer due to the incorporation of Ti 3 C 2 .Meanwhile, the presence of enormous nonradiative transfer of photogenerated carriers can be proposed based on the PL and TRPL results.In fact, this nonradiative process is widely observed in the most widely used catalyst/co-catalyst and heterojunction systems 28,505152.In particular, the 2D/2D contact between NiAl-LDH and Ti 3 C 2 decreases the transfer distance of the charge carriers and facilitates interfacial charge migration. PEC tests were further performed to explore the charge transfer ability of the sample. The EIS Nyquist plots are displayed in Fig. 7(c), and the inset shows a simulated equivalent electrical circuit.R s , R ct and CPE represent the electrolyte solution resistance, interfacial charge-transfer resistance and constant phase element, respectively 53,54. A smaller diameter of the arc in the EIS plots signifies a decreased R ct and enhanced interfacial charge-carrier transfer.Modification of NiAl-LDH by Ti 3 C 2 is proven to be effective for improving charge transfer, and the optimized LDH/TC-2 exhibits the smallest interfacial charge-transfer resistance.Furthermore, the transient photocurrent response curves of the electrodes coated with pristine NiAl-LDH and different LDH/TC composites were recorded by switching the irradiation light on and off for several cycles (I-t curve, Fig. 7d).No current was generated without light irradiation for all samples. When light was turned on, the current increased sharply due to the photoexcitation of NiAl-LDH.LDH/TC composites display significantly improved photocurrent compared with bare NiAl-LDH, implying effectively enhanced charge migration and separation after the incorporation of Ti 3 C 2 .The intensity of the photocurrent for the hybrids is in the order of LDH/TC-2 LDH/TC-3 LDH/TC-1, which is in accordance with the trends observed in the EIS tests and their photocatalytic activities.Excess Ti 3 C 2 and the resulting agglomeration have adverse effects on charge transport and separation. In addition, it should be noted that the photocurrent of Ti 3 C 2 is negligible, indicating that the photoinduced electrons originate from NiAl-LDH.Ti 3 C 2 is an electron acceptor for the photocatalytic reduction in LDH/TC hybrids.The separation of electrons and holes is not only the fundamental prerequisite for photoreduction but can also promote the accumulation and activation of the CO 2 molecules on the surface of the photocatalysts 55,56.As displayed in Fig. 8(a), pristine NiAl-LDH shows a CO 2 adsorption capacity of 4.12 cm 3 /g at a relative pressure of 0.03.For LDH/TC-2, this value increases to 4.56 cm 3 /g under the same conditions, even though the BET specific surface area of the hybrids is lower than that of pristine NiAl-LDH.Considering the BET specific surface areas of the two samples, the CO 2 adsorption capacity of LDH/TC-2 is 1.4 times higher than that of NiAl-LDH after the normalization of their specific surface areas.Well-dispersed Ti 3 C 2 nanosheets are beneficial for CO 2 capture 22.After adsorption, chemically coordinated monodentate and bidentate carbonates are formed, and the subsequent protonation occurs upon light irradiation 575859.Then, the COOH species evolved as the key intermediate for CO 2 photoconversion.Finally, dehydration of COOH occurs by reaction with another proton, and CO is generated and released 60,61.As demonstrated by the in situ Fourier transform infrared spectroscopy (FTIR) measurements (Fig. 8b), all of these processes are observed on NiAl-LDH and LDH/TC-2.However, LDH/TC-2 clearly presents a stronger photoconversion capacity than pristine NiAl-LDH.This is consistent with their photocatalytic performances. Based on the above obtained bandgaps of NiAl-LDH and the Mott-Schottky plot of NiAl-LDH and Ti 3 C 2 (Fig. S6), the band alignment of LDH/TC-2 is presented in Fig."
  },
  {
    "title": "Conclusions",
    "content": "In summary, a unique 3D hierarchical LDH/TC hybrid photocatalyst was developed through the hydrothermal synthesis of NiAl-LDH and the in situ loading of a Ti 3 C 2 cocatalyst.The photocatalytic CO production rate of the optimized LDH/TC-2 can reach 11.82 mol g -1 h -1 with 92 selectivity and superior stability.The characterization results indicated that Ti 3 C 2 , a half-metallic co-catalyst, can efficiently promote the separation of the photoinduced electron-hole pairs in NiAl-LDH by virtue of the special Fig. 1.(a) Illustration of the synthesis of the 3D hierarchical NiAl-LDH/Ti 3 C 2 hybrid; (b) XRD patterns and (c) Raman spectra of the as-prepared samples. Fig. 2 FE-SEM images of (a) Ti 3 C 2 MXene, (b) NiAl-LDH, (c) LDH/TC-2, (d) LDH/TC-2 and (e) LDH/TC-3. Fig. 3. (a) The whole TEM image of an LDH/TC-2 particle; (b-f) HAADF-STEM image and EDS elemental mapping images of LDH/TC-2.(g) HRTEM image from the edge of the sample.(h-l) HAADF-STEM image and EDS elemental mapping images for the bottom right corner of LDH/TC-2. Fig. 4. (a) XPS survey spectra of NiAl-LDH, Ti 3 C 2 , and LDH/TC-2.(b) Ni2p, (c) Al2p and (d) Ti2p core-level XPS spectra. Fig. 5(a) shows the N 2 adsorption-desorption isotherms of the samples.NiAl-LDH Fig. 5. (a) Nitrogen adsorption-desorption isotherm curves for (1) NiAl-LDH, (2) LDH/TC-2 and (3) Ti 3 C 2 .(b) Diameter distribution curves of the samples.(c) UV-vis diffuse reflectance spectra and digital pictures of different samples. Fig. 6.(a) Time evolution of CO over different samples.(b) Average gas production rates over different catalysts.(c) Stability tests for CO production over LDH/TC-2.(d) The isotope analysis of 13 CO using 13 CO 2 as carbon source by GC-MS.Inset shows the mass spectrum of 13 CO.(d) The isotope analysis of oxidation half-reaction using H 2 18 O by GC-MS.Inset shows the mass spectrum of generated O 2 . Fig. 7. (a) Photoluminescence spectra and (b) time-resolved fluorescence decay traces of the samples (the excitation wavelength is 405 nm).(c) Electrochemical impedance spectra (EIS) and (d) transient photocurrent responses of the as-prepared samples. photocatalyst NiAl-LDH to the co-catalyst.Therefore, the loading of an optimized Fig. 8. (a and b) Room temperature CO 2 adsorption isotherms and in situ FTIR spectra of adsorbed CO 2 over different samples upon irradiation.(c) The energy level positions and scheme for spatial charge separation and transportation during photocatalytic CO 2 reduction over NiAl-LDH/Ti 3 C 2 composites. O18 O relative to that of18 O 2 , which is consistent with a previous report27. We are grateful to the National Natural Science Foundation of China (51303083), the National Natural Science Foundation of China for Excellent Young Scholars (51922050), the Natural Science Foundation of Jiangsu Province (BK20191293), the China Postdoctoral Science Foundation (2017m621708), and the Fundamental Research Funds for the Central Universities (30920021123) for financial support. 2D/2D interface interaction.The accumulated photoinduced electrons on Ti 3 C 2 facilitate CO 2 capture and activation, endowing LDH/TC with improved photoconversion performance towards CO 2 .This work provides an effective approach to develop an ideal photocatalyst for CO 2 conversion by combining the features of intense light harvesting capacity, efficient charge carrier separation and enhanced capture capacity towards reactants from different dimensionalities. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data associated with this article can be found in the online version. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. The authors declare the following financial interests/personal relationships which may be considered as potential competing interests:"
  }
]