[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2020.119085"
  },
  {
    "title": "Article_Title",
    "content": "Facet-selective deposition of a silver–manganese dual cocatalyst on potassium hexatitanate photocatalyst for highly selective reduction of carbon dioxide by water"
  },
  {
    "title": "Abstract",
    "content": "Previously a silver-manganese dual cocatalyst loaded on a potassium hexatitanate crystal photocatalyst was reported to be efficient for photocatalytic reduction of CO 2 to CO by using water as an electron source.In the present study, variously prepared silver-manganese dual cocatalysts were investigated to figure out their states and functions of Ag and MnO x species.Although an impregnation method provided various states of these species such as AgO x particles, core-shell structures, and oxidized aggregates, they gave negative effects on the photocatalytic activity.On the other hand, a simultaneous photodeposition method fabricated Ag and MnO x species on the long and short facets of the rod-like crystal, respectively, and these species functioned as each efficient promoter for the reductive and oxidative reactions in the photocatalysis.It was firstly evidenced that the clear separation of the reaction sites with the proper promoters is essential for the high efficiency in the photocatalytic CO 2 reduction.preferred more than the CO 2 reduction.Thus, the selective reduction of CO 2 is essentially difficult in an aqueous solution.Nevertheless, since deposited Ag nanoparticles were found to function as the active cocatalyst for CO 2 reduction to produce CO 7, various semiconductors have been studied as photocatalysts with the Ag-cocatalyst for over a decade, such as BaLa"
  },
  {
    "title": "Experimental",
    "content": "The potassium hexatitanate (K 2 Ti 6 O 13 , KTO) sample was prepared by a flux method 42,43.The two precursors, K 2 CO 3 (Kishida Chemical Co., Ltd.) and TiO 2 (rutile, Kojundo Chemical Lab.Co., Ltd), in a molar ratio of 1:6 and 70 mol of a KCl flux (Kishida Chemical Co., Ltd.), where the flux ratio was calculated as: 70 mol 100 (amount of KCl mol)/(amount of KTO mol amount of KCl mol), were mixed in a mortar for 20 min, followed by heating at 1273 K for 10 h in an electric muffle furnace.The obtained powder was thoroughly washed with hot water to remove the flux and filtrated, then dried at 323 K for 24 h. The Ag cocatalyst was loaded on the surface of KTO by a photodeposition method (PD) as follows: 1 g of the prepared KTO sample was dispersed in 400 mL of ion-exchanged water containing a required amount of AgNO 3 (Kishida Chemical Co., Ltd.) as a cocatalyst precursor, and the suspension was irradiated from a 100 W high-pressure Hg lamp with a bubbling flow of argon gas for 2 h, followed by filtration and drying at 353 K in the oven.This sample was referred to as the Ag (PD)/KTO sample.The Ag and MnO x dual cocatalyst was loaded on the KTO surface by four different methods, i.e., a simultaneous PD method, an impregnation (IMP) method, and their combinations.In the simultaneous PD method, both Ag and MnO x species were simultaneously loaded in the PD method by using an aqueous solution containing required amounts of cocatalyst precursors, AgNO 3 and Mn(NO 3 ) 2 (Nacalai tesque co.ltd), according to the same procedure of the PD method as mentioned, which gave the Ag(PD)-MnO x (PD)/KTO sample.In a simultaneous IMP method giving the Ag(IMP)-MnO x (IMP)/KTO sample, 1 g of the prepared KTO sample was suspended in an aqueous solution (150 mL) of desired amounts of AgNO 3 and Mn(NO 3 ) 2 with stirring in a beaker, followed by heating at 358 K to remove water, drying at 373 K for 24 h, and calcination at 723 K for 2 h in the muffle.In a combination of the PD and IMP method, Ag species was first loaded by the PD method, followed by loading MnO x species in the IMP method, providing the MnO x (IMP)/Ag(PD)/KTO sample.Another sample was prepared in the reverse order, i.e., the MnO x species was first loaded on the KTO sample by the IMP method, followed by loading Ag species in the PD method, which was denoted as the Ag(PD)/MnO x (IMP)/KTO sample.Some other samples were also prepared in similar ways, the details will be mentioned later.To show the loaded amount of the components, the samples are referred to as e.g., Ag(PD,x)-MnO x (PD,y)/KTO, where x and y mean the actual loading amount of Ag and Mn (wt ) determined by X-ray florescence analysis (XRF) as mentioned below. The crystal structure of the KTO sample was determined by powder X-ray diffraction with a Lab X XRD-6000 (Shimazu).Morphologies of the samples were observed by scanning electron microscopy (SEM) with a JSM-890 (JEOL).The amount of cocatalyst deposited on the samples was evaluated by X-ray florescence analysis with an EDX-8000 (Shimadzu) according to each calibration curve that was experimentally obtained from a series of reference samples prepared by the impregnation method.The diffuse reflectance (DR) UV-visible spectrum of the prepared sample was recorded by a V-670 (JASCO). Ag and Mn K-edge X-ray absorption fine structures (XAFS) were recorded at NW-10C and BL-12C of the Photon Factory (KEK, Tsukuba, Japan), respectively.Most of the samples including the references were measured in a transmission mode, while the Mn K-edge XAFS spectra of the prepared samples were measured in a fluorescence mode due to the small amount of the Mn species. Images of transmission electron microscopy (TEM) and scanning transmission electron microscopy (STEM) with energy dispersive X-ray analysis (EDX) were taken by a JEOL JEM-2100F at 200 kV in the Joint Research Centre of Kindai University.The sample was dispersed in methanol, dropped onto a carbon-coated copper grid, and dried at ambient temperature for 5 h. The reaction test for the photocatalytic CO 2 reduction with H 2 O was conducted using an inner-irradiation photochemical reaction vessel with a CO 2 bubbling flow system (Fig. S1) 20,22.The photocatalyst powder sample (0.3 g) was dispersed and suspended by magnetically stirring in ion-exchanged water (400 mL) containing 0.5 M NaHCO 3 (pH 8).Then, air was excluded from reactor by the CO 2 bubbling flow for 1.5 h in the dark.A 100 W high-pressure mercury lamp with an intensity of 22 mW cm -2 , which was measured at 254 20 nm in wavelength, located in the center of the reactor was used as the light source for the photocatalytic reaction.The reaction temperature was set at 290 K by using cooling water.The amount of the products (CO, H 2 , and O 2 ) in the outlet gas were determined by using an on-line gas chromatograph using argon as a carrier gas (Shimadzu, GC-8A, TCD, a Shincarbon ST column).Since no other reductive products than CO and H 2 were observed, the selectivity toward CO evolution, S CO (), and the ratio of the consumed electron and hole, R(e -/h ), were calculated according to Eq. 4 and 5, respectively 17,44, where the production rate of CO, H 2 , and O 2 are referred to as R CO , R H2 , and R O2 , respectively. R(e -/h ) (2R CO 2R H2 )/4R O2 (5)"
  },
  {
    "title": "Results_and_Discussion",
    "content": "Fig. S2 shows XRD patterns of the obtained KTO sample and that of a K 2 Ti 6 O 13 reference from a database (ICSD25712 45).It gives no diffraction lines from other impurity phases, confirming that the prepared potassium hexatitanate was correctly synthesized by the flux method.The SEM image (Fig. S3) shows that the KTO sample consisted of rod-like crystals with similar morphology and size 42,43. The actual loaded amounts of cocatalysts determined by XRF were shown in Table S1.The desired quantity of cocatalyst was successfully loaded over the prepared sample, except for the Ag(PD)-MnO x (PD)/ KTO, MnO x (PD)/Ag(PD)/KTO, and Ag(PD)/MnO x (PD)/KTO samples, indicating that it is somewhat difficult to load the MnO x species by the PD method. From the DR UV-visible spectrum (Fig. S4a) and the Davis-Mott equation 46, the bandgap of the bare KTO was estimated to be 3.56 eV.A large broad band centered at the 530 nm was observed for the Ag(PD,1.0)/KTO and Ag(PD,1.0)-MnOx (PD,0.09)/KTOsamples (Fig. S4b andc), which was assigned to a localized surface plasmon resonance (LSPR) of Ag nanoparticles, indicating that similar Ag nanoparticles were present on the KTO surface in these samples 474849.While for the MnO x (IMP,1.0)-Ag(IMP,1.0)/KTOand MnO x (IMP,1.0)/Ag(PD,1.0)/KTOsamples (Fig. S4d ande), a broad absorption band was observed instead of the mound-shaped LSPR adsorption band, meaning that the Ag species on these samples were different from metallic nanoparticles in their structure and properties.These samples showed gray color, which would originate from manganese oxide (MnO x ) species.And the Ag(PD,1.0)/MnOx (IMP,1.0)/KTOsample (Fig. S4f) showed a complex band shape consisting of both the small amount of LSPR adsorption band assignable to the metallic Ag nanoparticles and the broad band due to the MnO x species. Photocatalytic CO 2 reduction tests were carried out for these prepared samples.The results are shown in Fig. 1.The bare KTO sample without any cocatalyst mainly produced hydrogen and oxygen through water splitting (Fig. 1a), where CO was also produced but the formation rate was very low.Compared with the bare KTO sample, the production rate of CO was much more enhanced by loading the Ag cocatalyst (Fig. 1b).This means that the Ag nanoparticles in the Ag(PD,1.0)/KTOsample functioned as the active sites for CO 2 reduction to form CO as reported 7,20.The selectivity toward CO evolution in the reduction products (S CO ) was quite high such as 94.7. The photocatalytic performance of the sample with the dual cocatalyst consisting of Ag and MnO x species was much varied with the loading methods (Fig. 1c-f).The Ag(PD,1.0)-MnO x (PD,0.09)/KTOsample prepared by the simultaneous PD method (Fig. 1c) gave a quite high CO evolution rate (8.0 mol h -1 ) with high selectivity toward CO evolution (97.2).The Ag(IMP,1.0)-MnOx (IMP,1.0)/KTOand MnO x (IMP,1.0)/Ag(PD,1.0)/KTOsamples, however, exhibited very low activities for the CO 2 reduction (Fig. 1d ande).The former sample was prepared by the simultaneous IMP method and the latter was prepared by one of the two-step methods, first the PD method and then the IMP method, i.e., these samples were calcined at the final step of each preparation procedure and they exhibited no LSPR bands responded to metallic Ag nanoparticles (Fig. S4d andS4e).This suggests that the Ag species were in oxidized states and thus resulted in lower CO evolution and CO selectivity.The Ag(PD,1.0)/MnO x (IMP,1.0)/KTOsample (Fig. 1f) showed a moderately high photocatalytic activity for CO 2 reduction with high selectivity although it was lower than that with the Ag(PD,1.0)/KTOsample (Fig. 1b).In this sample, the Ag species was loaded by the PD method at the final step in the other two-step preparation procedure and the sample exhibited the LSPR band due to Ag nanoparticles overlapping to the broad band of MnO x species (Fig. S4f).Thus, it confirms that the metallic Ag nanoparticles are necessary for the selective CO formation.From these results, it was clear that the simultaneous PD method is excellent for the photocatalytic CO 2 reduction.The details will be discussed later.Fig. S6 shows the time course of the production rate in the photocatalytic reaction test with the Ag(PD,1.0)-MnOx (PD,0.09)/KTOsample.For the initial period of 5 h, the gradual decrease and increase with time were observed for the formation rates of CO and O 2 , respectively.After that, the stable formation of CO and O 2 were continuously observed with almost stoichiometric production ratio for 24 h, revealing that the equivalent consumption of photoexcited electrons and holes, i.e.R(e -/h ) 0.96, on the Ag(PD,1.0)-MnOx (PD,0.09)/KTOsample. However, only the Ag(PD,1.0)-MnOx (PD,0.09)/KTOsample contained the low loading amount of MnO x species (0.09 wt) among the four samples with the dual cocatalyst.Thus, the effect of the loading amount of MnO x species were examined as follows. In a photodeposition method, the photocatalyst reduces or oxidizes the cocatalyst precursors in the solution and thus the cocatalyst species can be loaded.Since precious metal precursor can be easily reduced, the photoreduction of precious metal would take place fast to fabricate metallic particles on the photocatalyst surface.In contrast, the photodeposition of transition metal precursor would not be so fast.Thus, the photodeposition of Ag metal nanoparticles would be fast, while photodeposition of MnO x species would be slow.Actually, the amount of the MnO x species in the Ag(PD,1.0)-MnOx (PD,0.09)/KTOsample was lower than the Ag species.It is thus considered that the irradiation time (2 h) might not be enough for the MnO x species although it was enough for the deposition of Ag species.In a photodeposition method, Mn 2 cation is oxidized and deposited to form the MnO x species 35, suggesting that the rate of water oxidation was higher than that of Mn 2 oxidation in the aqueous solution.On the other hand, the loading amount of the MnO x species can be accurately controlled by the IMP method.So that, to confirm the loading amount effect of the MnO x species on the photocatalytic activity, a series of experiments were additionally performed with the Ag(PD,1.0)/MnOx (IMP,x)/KTO samples with different loading amounts (x) of MnO x cocatalyst.This preparation method can provide both metallic Ag nanoparticles and MnO x species, which is supported by the DR UV-visible spectra (Fig. S5).The photocatalytic reaction tests (Fig. S7) revealed that, the activity decreased with the increase of MnO x loading amount from 0.1 to 1.0 mol , and the activity of the Ag(PD,1.0)/MnOx (IMP,0.1)/KTOsample was lower than the Ag(PD,1.0)-MnOx (PD,0.09)/KTOsample even though they had similar amount of MnO x species to each other (Fig. S7c andS7d).This indicates that the critical factor to determine the highest photocatalytic activity among these samples was not the amount of MnO x species but the preparation method and the resulting structure, state, location, and also property, as discussed later. Additional two samples were prepared by a two-step PD method, in which these species were consecutively photodeposited one by one.As shown in Fig. S8, it was uncovered that the two samples prepared by the consecutive PD method, the MnO x (PD,0.14)/Ag(PD,1.0)/KTOand Ag(PD,1.0)/MnOx (PD,0.06)/KTOsamples also exhibited high photocatalytic activity, which were similar to that of the sample prepared by the simultaneous PD method.This result means that the effect of the coexisting MnO x species on the photocatalytic activity was not related to the order of the photodeposition.As reported on the TiO 2 crystal photocatalyst covered with facets 35, it is presumed that the Ag nanoparticles and MnO x species could be separately deposited at different facets of the KTO crystal photocatalyst so that they can independently function as a dual cocatalyst. It has been reported that the metallic Ag cocatalyst can promote the photocatalytic CO 2 reduction to CO in many cases 7,10,15,22,25,29.In our previous study 42, the MnO x species were proved to enhance the O 2 evolution, and thus accelerate the photocatalytic CO 2 reduction to CO.Here, to clarify the activity of the loaded MnO x species, additional four samples having a similarly low amount of MnO x species (0.13-0.15 wt) were prepared and examined in O 2 evolution experiments in the presence of AgNO 3 as a sacrificial oxidant (Fig. 2).In this test, the initial formation rate should be compared.As shown, the MnO x species on the MnO x (PD,0.15)/KTOand MnO x (IMP,0.15)/KTOsamples much enhanced the O 2 evolution (Fig. 2e andf).The Ag (PD,0.5)-MnOx (PD,0.13)/KTOand Ag(PD,0.5)/MnOx (IMP,0.15)/KTOsamples (Fig. 2c andd) provided more O 2 evolution than that of the Ag (PD,0.5)/KTOsample and the bare KTO sample (Fig. 2a andb).These results clarified that the difference of the deposition method for the MnO x species, the PD and IMP methods, essentially does not give a tremendous effect on the function of the MnO x species for the enhancement of O 2 evolution. The chemical state and local structure of the dual cocatalyst consisting of the Ag and MnO x species were investigated by using X-ray absorption fine structure (XAFS).Fig. 3A shows Ag K-edge X-ray absorption near edge structures (XANES) of the four prepared samples and two reference samples.The absorption edges (25,519 eV) in the spectra of three photocatalyst samples, the Ag(PD,1.0)/KTO,Ag(PD,1.0)-MnOx (PD,0.09)/KTO,and Ag(PD,1.0)/MnOx (IMP,1.0)/KTOsamples (Fig. 3A c, d, andg), were consistent with that of Ag foil (25,519 eV) but different from that of Ag 2 O (25,521 eV), and the spectral feature of these XANES spectra for the photocatalyst samples is also similar to that for Ag foil, indicating that the Ag species loaded on the KTO surface in these samples were metallic.Thus, it was revealed that the coexistence of the MnO x species in these samples did not vary the metallic state of the Ag species.On the other hand, for the two samples, the Ag (IMP,1.0)-MnOx (IMP,1.0)/KTOand MnO x (IMP,1.0)/Ag(PD,1.0)/KTOsamples (Fig. 3A e andf), the absorption edges and spectral features were neither consistent with that of Ag foil nor with Ag 2 O, but similar to each other.Since the samples were calcined at 723 K in the final step, the Ag species would be oxidized during the preparation procedure.Thus, it is reasonable that the Ag species were not metallic but oxidized with a unique local structure.The Fourier transforms of EXAFS spectra of both the Ag(IMP,1.0)-MnOx (IMP,1.0)/KTOand MnO x (IMP,1.0)/Ag(PD,1.0)/KTOsamples were similarly very weak (Fig. 3B e andf).This means that the Ag species have a unique local structure possessing various Ag-O bonds, i.e., the distance between the Ag cations and the neighboring O anions are not uniformed, implying that the Ag oxidized species have a unique dispersed structure or interact with Mn species to form a special structure.The spectra of the other three photocatalysts (Fig. 3B c, d, andg) were consistent with the spectra of Ag metal reference (Fig. 3B b), confirming the presence of metallic Ag nanoparticles. Fig. 4A shows Mn K-edge XANES of the prepared samples and some reference compounds such as Mn foil, MnO, Mn 2 O 3 , and MnO 2 .Except for the Ag(PD,1.0)-MnOx (PD,0.09)/KTOsample (Fig. 4A e), the absorption edges for other three prepared samples, the Ag(IMP,1.0)-MnOx (IMP,1.0)/KTO,MnO x (IMP,1.0)/Ag(PD,1.0)/KTO,and Ag(PD,1.0)/MnO x (IMP,1.0)/KTOsamples (Fig. 4A f, g, andh) were strictly consistent with that for MnO 2 (Fig. 4d), meaning that the Mn 2 precursor was oxidized by calcination to become MnO 2 species on the KTO photocatalyst surface.The Fourier transforms of the EXAFS spectra of these three photocatalyst samples also support the formation of MnO 2 species (Fig. 4B f, g, andh).While for the Ag(PD,1.0)-MnOx (PD,0.09)/KTO sample, it had clearly different local structures from these typical manganese oxides shown here.In detail, the edge position of the XANES spectrum (Fig. 4Ae) was close to that for Mn 2 O 3 (Fig. 4Ac) and the Fourier transforms of the EXAFS spectrum of this photocatalyst samples (Fig. 4Be) showed quite different features from those of the reference oxides.Thus, the MnO x species deposited on the KTO surface by the simultaneous PD method would have a unique local structure, suggesting that they are not aggregated as a single phase of manganese oxide particles but well dispersed on the surface with unique local structure and valence, i.e., a highly dispersed MnO x species like an atomically dispersed single site species.The very small loading amount of the MnO x species such as 0.09 wt seems consistent with this suggestion.This unique structure might contribute to the high photocatalytic activity. In our previous study 42, TEM images of the Ag(PD,1.0)/KTO and Ag(PD,1.0)-MnOx (PD,0.09)/KTOsamples confirmed the presence of Ag nanoparticles on the KTO crystals.However, since no MnO x species were detected on the latter sample by TEM and EDX mapping, it was proposed that the MnO x species were well dispersed on the surface.Also in the present study, although both TEM and EDX mapping were recorded on the MnO x (0.15)/KTO and Ag(PD,1.0)-MnOx (PD,0.12)/KTOsamples, no clear information was obtained (Figs S9 andS10). Figs S10 and S11 show the TEM images and size distribution of the Ag nanoparticles over several samples with the same loading amount of the Ag nanoparticles.The average particle size of the Ag nanoparticles on the Ag(PD,1.0)/KTOsample and the Ag(PD,1.0)-MnOx (PD,x)/KTO (x 0.09, 0.12, and 0.17) samples were 15.1, 7.8, 16.2 and 17.1 nm, respectively.It seems that the Ag particle size was not much affected by the presence and the loading amount of the MnO x species.Further, most of Ag nanoparticles were found on the long facets but not on the short facets, showing that the Ag deposition by the photoexcited electrons predominantly took place on the long facets of the KTO crystals during the photodeposition and the active sites for the photocatalytic CO 2 reduction were also on the long facets, as proposed for a Na 2 Ti 6 O 13 photocatalyst consisting of similar rod-like crystals 21. To confirm the reductive and oxidative facets on the rod-like KTO crystals, large amounts of the Ag and MnO x species such as 5.0 wt were deposited by a photodeposition method by using sacrificial reagents as follows.The Ag species were photodeposited in the presence of CH 3 OH as an electron donor (referred to as PD MeOH ), while the MnO x species were photodeposited by using IO 3 -as an electron acceptor (referred to as PD IO3 ).The photoirradiation was carried out for 2 h for each photodeposition.Three samples, the Ag(PD MeOH ,5.0)/KTO, MnO x (PD IO3 ,5.0)/KTO, and MnO x (PD IO3 ,5.0)/Ag(PD MeOH ,5.0)/KTO samples, were prepared, where the last one was prepared by a two-step PD method: Ag cocatalyst was first loaded by a PD MeOH method, followed by the MnO x loading by the PD IO3 method.The XRF measurements confirmed that all the precursor was successfully used to form the deposited species on the surface of the KTO samples by the aid of the sacrificial reagents.The SEM and TEM images of these three samples are shown in Fig. S12, where the Ag nanoparticles and the amorphouslike MnO x species were found on the long and short facets, respectively.Their structures and locations were further confirmed by the combination of TEM images and EDX mappings as shown in Fig. 5.For the Ag(PD MeOH ,5.0)/KTO sample (Fig. 5a), almost all Ag cocatalyst was loaded on the long facets, and no Ag nanoparticles were found on the short facets of the KTO sample.For the MnO x (PD IO3 ,5.0) sample (Fig. 5b), most of the MnO x species covering on the short facets were observed and only a few particles were found on the long facets.When both Ag nanoparticles and MnO x species were loaded on the KTO sample by the two-step PD method with sacrificial reagents (Fig. 5c), both the long facets and short facets were deposited by the Ag nanoparticles and the MnO x species, respectively, which was evidenced by EDX mapping.Thus, it was clarified that the reductive reactions take place on the long facets and the oxidative reactions occur on the short facets. In the present photodeposition conditions without any sacrificial reagents the metallic Ag nanoparticles and the oxidized MnO x species were formed.Thus, the redox reactions during the photodeposition process should be expressed as following equations (Eqs 6-8), except for the reduction of proton (Eq.2) and oxidation of water (Eq.3) 35: Thus, the reductive reaction to form the Ag nanoparticles (Eq.6) can take place selectively on the reductive long facets on the KTO surface, while the oxidative reactions to fabricate the MnO x species (Eqs 7 and 8) should proceed predominantly on the oxidative short facets of the KTO surface.So that, the simultaneous PD method used for the preparation of the Ag(PD,1.0)-MnOx (PD,0.09)/KTOsample can form the Ag and MnO x species separately on the long and short facets over the KTO crystal, respectively. As mentioned above, in the photocatalytic CO 2 reduction, the Ag nanoparticles promotes the reduction of CO 2 to CO (Eq. 1) and the MnO x species enhances the oxidation of water (Eq.3), which is consistent with the reported trend that reduction cocatalyst prefers to be loaded on the electron-rich facet, and oxidation cocatalyst is easy to be loaded on hole-rich facets 23,50.On the Ag(PD,1.0)-MnOx (PD,0.09)/KTO sample, the Ag nanoparticles on the reductive long facet act as a reduction cocatalyst and the MnO x species on the oxidative short facets function as an oxidative cocatalyst.This distribution provides the spatially-separated reaction fields for the CO 2 reduction and O 2 evolution in the photocatalytic CO 2 reduction by water.This would limit the recombination of electrons and holes, and increases the photocatalytic activities. Fig. 6 shows TEM images and EDX mappings of the MnO x (IMP,1.0)/Ag(PD,1.0)/KTOsample.XAFS analysis revealed that this sample contained oxidized Ag species (Fig. 3f) and MnO 2 species (Fig. 4g) as mentioned above.In this sample, different structures of cocatalyst were observed.Firstly, an apparent core-shell structure was found (Fig. 6b). According to the preparation steps, it is supposed that the core-shell structure would consist of Ag-core and MnO 2 -shell, which is consistent with the observed properties that the Ag species tend to form nanoparticles and the MnO x species forms amorphous structure on the KTO surface.On the other hand, some aggregates were also found even on the short facets (Fig. 6c).The observed aggregates are not so dark but moderately dark.The EDX-mapping (Fig. 6d-f) clarified that both Ag and MnO x species existed on the short facet together.These results indicate that the Ag species were oxidized and mixed with MnO 2 species.During the preparation of this sample, the Ag cocatalyst was loaded first by a PD method, followed by loading the MnO 2 species in the IMP method.This means that the sample was finally calcined at 723 K, and during the calcination process the first-produced Ag nanoparticles could migrate even to short facets and be oxidized, which would be mixed with MnO 2 moiety.As mentioned, the activity of this sample was quite low (Fig. 1e).Thus, it is elucidated that the Ag species in these states, such as the oxidized particles, the core-shell structure, and aggregates in the oxidized form, give a negative effect on the photocatalytic reduction of CO 2 with H 2 O. Finally, Fig. 7 shows TEM images and EDX mappings of the Ag (PD,1.0)/MnOx (IMP,1.0)/KTOsample, in which metallic Ag nanoparticles and MnO 2 species were present.The combination of the TEM image and EDX mappings shows that both the metallic Ag and MnO 2 species were well dispersed on the surface of the KTO sample (Fig. 7d-f).This would be the reason why the activity of this sample was moderately high but not the highest.Although the Ag nanoparticles loaded in the PD method predominantly existed on the long facets, the MnO 2 species are present everywhere.Although the MnO 2 species loaded by the IMP method can enhance the photocatalytic oxidation as shown in Fig. 4, the MnO 2 species interacting with the Ag species on the long facets may disturb the photocatalytic reduction. From the results mentioned above, the models of the structure of the KTO photocatalysts prepared in the different ways are depicted in Fig. 8.At first, it was elucidated that the long and short facets of the rod-like KTO crystals are responsible for the reductive and oxidative reaction fields, respectively. In the Ag(PD)-MnO x (PD)/KTO sample (Fig. 8a), Ag nanoparticles and a small amount of the highly dispersed (atomically isolated) MnO x species existed on the long facets and the short facets, separately.This sample exhibited the highest activity for CO 2 reduction originating from the clearly separated location of these species.The highly dispersed structure of the MnO x species also would be a key factor for the high activity. In the Ag(IMP)-MnO x (IMP)/KTO sample (Fig. 8b), the AgO x and MnO 2 species would be randomly dispersed on the KTO surface.This showed the second-lowest activity. In the MnO x (IMP)/Ag(PD)/KTO sample (Fig. 8c), various states of oxidized Ag species were formed such as core-shell structure and mixed aggregates with MnO 2 species.This gave the lowest photocatalytic production rates. And in the Ag(PD)/MnO x (IMP)/KTO sample (Fig. 8d), small metallic Ag nanoparticles predominantly exist on the long facets, while the MnO 2 species are present everywhere.This sample showed the secondhighest activity but lower than the Ag(PD,1.0)/KTOsample, meaning the coexistence of the MnO 2 species decreased the photocatalytic activity. Considering these structures of photocatalysts and the photocatalytic activities, it is suggested that some kinds of oxidized Ag species, such as the oxidized particles, the core-shell structure, and aggregates in the oxidized form, give negative effects on the photocatalytic reduction of CO 2 with H 2 O.The separately located dual cocatalyst consisting of the metallic Ag nanoparticles on the reductive facets and the MnO x species on the oxidative facets can reduce the recombination of photoexcited electrons and holes to enhance the activity for the photocatalytic CO 2 reduction by water, and provide the reductive and oxidative reaction fields for the CO 2 reduction and O 2 evolution, respectively, which would also contribute to the high production rates."
  },
  {
    "title": "Conclusions",
    "content": "In this study, the functional state of the dual cocatalyst consisting of the Ag and MnO x species was clarified by investigating some samples prepared by the different deposition methods.The different deposition methods provided not only various chemical states and structures of the species but also the various distribution of the species on the facets of the rod-like potassium hexatitanate crystals, which gave really a large effect on the photocatalytic activity for the CO 2 reduction with H 2 O.It was concluded that oxidized particles of Ag cocatalyst, the core-shell structure, and aggregates in the oxidized form, give negative effects on the photocatalytic reduction of CO 2 with H 2 O, while metallic Ag nanoparticles are essential for the CO evolution.Here we successfully Fig. 1.Photocatalytic reaction tests of CO 2 reduction with water over the prepared samples, (a) bare KTO, (b) Ag(PD,1.0)/KTO,(c) Ag(PD,1.0)-MnOx (PD,0.09)/KTO,(d) Ag(IMP,1.0)-MnOx (IMP,1.0)/KTO,(e) MnO x (IMP,1.0)/Ag(PD,1.0)/KTO,and (f) Ag(PD,1.0)/MnOx (IMP,1.0)/KTO.The data were taken after the photoirradiation for 7 h. Fig. 2. Time course of O 2 evolution over the prepared photocatalysts, (a) bare KTO, (b) Ag(PD,0.5)/KTO,(c) Ag(PD,0.5)-MnOx (PD,0.13)/KTO,(d) Ag (PD,0.5)/MnOx (IMP,0.15)/KTO,(e) MnO x (PD,0.15)/KTO,and (f) MnO x (IMP,0.15)/KTO.Sacrificial reagent, AgNO 3 (0.5 M), was used.Light source: a 100 W high pressure Hg lamp. Fig. 3. Ag K-edge XANES (A) and Fourier-transformed EXAFS (B) of the reference samples, (a) Ag 2 O and (b) Ag foil, and the prepared samples, (c) Ag (PD,1.0)/KTO,(d) Ag(PD,1.0)-MnOx (PD,0.09)/KTO,(e) Ag(IMP,1.0)-MnOx (IMP,1.0)/KTO,(f) MnO x (IMP,1.0)/Ag(PD,1.0)/KTO,and (g) Ag(PD,1.0)/MnOx (IMP,1.0)/KTO. Fig. 4. Mn K-edge XANES (A) and Fourier-transformed EXAFS (B) of the reference samples, (a) Mn foil, (b) MnO, (c) Mn 2 O 3 , and (d) MnO 2 , and the prepared samples, (e) Ag(PD,1.0)-MnOx (PD,0.09)/KTO,(f) Ag(IMP,1.0)-MnOx (IMP,1.0)/KTO,(g) MnO x (IMP,1.0)/Ag(PD,1.0)/KTO,and (h) Ag(PD,1.0)/MnO x (IMP,1.0)/KTO. Fig. 5. TEM images and EDX mappings of the excessively loaded samples prepared by photodeposition methods with sacrificial reagents, (a) Ag(PD MeOH ,5.0)/KTO,(b) MnO x (PD IO3 ,5.0)/KTO and (c) MnO x (PD IO3 ,5.0)/Ag(PD MeOH ,5.0)/ KTO, where CH 3 OH and NaIO 3 were used as sacrificial reagents to loading the Ag nanoparticles and the MnO x species, respectively. Fig. 7. TEM images and EDX mappings of the Ag(PD,1.0)/MnOx (IMP,1.0)/KTOsample. The authors acknowledge Prof. Ying Zhou, Southwest Petroleum University, China, for the valuable discussion.This work was financially supported by Otsuka Chemical Co., Ltd, Hirose holdings Co., Ltd, the Kyoto University Foundation, the joint research program of the Artificial Photosynthesis, Osaka City University, the Program for Element Strategy Initiative for Catalysts Batteries (ESICB, JPMXP0112101003) commissioned by the MEXT of Japan, and a Grantin-Aid for Scientific Research on Innovative Areas \"Singularity\" (17H05334) from the Japan Society for the Promotion of Science (JSPS).The XAFS measurements were performed under the approval of the Photon Factory, Program Advisory Committee (Proposal No. 2016G643 and 2018G625). found that the photodeposition is a valuable method for loading the Ag-MnO x dual cocatalyst, where the deposition order, e.g., simultaneously or separately (two-step), is not so important.The photodeposition method can fabricate the Ag nanoparticles and the MnO x species on the reductive and oxidative facets, respectively, which functioned as efficient promoters for CO formation from CO 2 and O 2 evolution from H 2 O, respectively.It was firstly reported that the clear separation of the reaction fields with the suitable promoters is one of most important factors for the high efficiency also in the photocatalytic CO 2 reduction by H 2 O. Xing Zhu: Investigation, Writing -original draft.Akira Yamamoto: Methodology, Funding acquisition.Shota Imai: Investigation.Atsuhiro Tanaka: Investigation.Hiroshi Kominami: Project administration.Hisao Yoshida: Conceptualization, Funding acquisition, Project administration, Supervision, Writing -review editing. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary material related to this article can be found, in the online version, at doi:https://doi.org/10.1016/j.apcatb.2020.119085."
  }
]