[
  {
    "title": "Doi",
    "content": "10.1016/s1872-2067(17)62766-9"
  },
  {
    "title": "Article_Title",
    "content": "Supercritical synthesis of platinum-modified titanium dioxide for solar fuel production from carbon dioxide"
  },
  {
    "title": "Abstract",
    "content": "This paper investigates the properties of TiO2-based photocatalysts synthesised under supercritical conditions.Specifically, the characteristics of Pt dispersed on TiO2 catalysts obtained in supercritical CO2 are discussed and compared with those of commercial TiO2.The photocatalytic activity of the synthesised catalysts in the CO2 photoreduction reaction to produce solar fuel is tested.The main conclusion of the study is that photocatalysts with better or similar features, including high surface area, crystallisation degree, hydroxyl surface concentration, pore volume, absorbance in the visible range and methane production rate, to those of commercial TiO2 may be produced for the reduction of CO2 to fuel by synthesis in supercritical media."
  },
  {
    "title": "Experimental",
    "content": "Various samples of Pt dispersed on TiO2 powder were synthesised by thermal hydrolysis of two different precursors (DIPBAT and TTIP) with two different alcohols in the presence of Pt(II) acetylacetonate using supercritical CO2 as the reaction medium.DIPBAT (75 wt in isopropyl alcohol), TTIP (pure) and Pt(II) acetylacetonate (97 wt) were provided by Sigma-Aldrich.Analytical reagent-grade ethanol and isopropyl alcohol were provided by Scharlab.In all analyses, Degussa P-25 (Evonik) TiO2 powder was used as a reference.Some characteristics of this commercial catalyst are shown in Fig. 1 for comparison with those of the catalysts synthesised in this work.Supercritical CO2 (purity 99.9,Carburos Metalicos S.A.) was used as received. The experimental set-up depicted schematically in Fig. 2 was used to synthesise photocatalysts in supercritical CO2 in discontinuous mode.The set-up consisted of a high pressure pump (Thar SFC, P-series) preceded by a thermostated bath (Selecta, Frigiterm-30) and followed by a high pressure synthesis reactor (DEMEDE Engineering Research, 100 mL).To synthesise the catalysts, the alcohol and Ti and Pt precursors were first added to the reactor.The system was sealed and then CO2 was pumped into the reactor after being cooled in the thermostated bath.The high pressure pump and an electric resistor were used to reach and maintain the operating pressure and temperature in the reactor.After synthesis, the system was depressurised by opening valve V3 and the catalyst was collected from the reactor.Further details of this procedure are given elsewhere 34. Catalyst synthesis was conducted at a pressure of 20 0.2 MPa and temperature of 300 5 C using a molar ratio of 28 mmol alcohol/mmol precursor except for in the case of the ethanol/DIPBAT combination of reactants.Given that DIPBAT is a solution in isopropyl alcohol, the molar ratio used in this case was 28 mmol ethanol/mmol DIPBAT, although the test was actually performed in an alcohol mixture 33.An appropriate amount of Pt(II) acetylacetonate was added to give final Pt concentrations in the range of 1-3 wt.Catalyst synthesis was performed for 2 h once the experimental conditions were reached.All syntheses were repeated three times.After the synthesised catalysts were removed from the reactor, they were dried at 105 C for 12 h and then calcined at 400 C for 6 h to remove any C contaminants from the catalysts 35. The TiO2-based catalysts were characterised by different techniques.The real percentage of Pt was measured by ICP-AES (Varian, Liberty Sequential).The detection limit of the ICP spectrometer was 20 ppb Pt.The particle size and external morphology of the particles were observed by SEM using a scanning electron microscope (JEOL, 6490 LV).TEM and high-resolution TEM were measured with a JEOL 2100 TEM operating at 200 kV equipped with a side-entry double-tilt ( 25) sample holder and energy-dispersive spectroscopy detector (Oxford Link).XPS was conducted using an ultrahigh-vacuum Specs Phoibos-150 electron spectrometer.The spectra were obtained with a photon energy of 1486.6 eV (Al anode).All binding energies were referenced to the C 1s peak originating from surface adventitious C at 284.6 eV.The crystallinity and crystalline phase of the catalysts were determined by powder XRD using an X-ray diffractometer (Philips, X Pert MPD).The crystallite sizes of the TiO2 photocatalysts were estimated via the Scherrer equation using the peak at 2 25.4.The specific surface area of the powders was evaluated using a Brunauer-Emmett-Teller (BET) area analyser (Micromeritics, ASAP 2020).DRUV-vis spectra of all catalysts were obtained on a DRUV-vis spectrophotometer (JASCO, V650).Absorbance thresholds and band gap energies (Eg) were calculated from these spectra.FTIR spectra of all samples were obtained with a FTIR attenuated total reflectance spectrometer (Thermo Nicolet, Avatar 370 FT-IR).Particle size and particle size distribution were calculated using a laser scattering particle size distribution analyser (Malvern, Mastersizer 2000). The photocatalytic activities of the catalysts in photocatalytic CO2 reduction experiments were assessed using an experimental set-up consisting of a stainless steel chamber (50 cm 3 ) (Fig. 3) with valves for evacuation, gas introduction and connection to a gas chromatography (GC) system, an O-ring-sealed quartz window at the top to admit radiation from a Xe arc lamp (Oriel, 450 W) with an Air Mass 1.5 Global filter and a dew point transmitter and different manometers to measure relative humidity and pressure, respectively, during the reaction.A bubbler containing deionised H2O was positioned before the reaction chamber.The beam of the lamp was diverged with a collimator with the aim of having the inside of the reaction chamber at the same irradiance as that of the sun (100 mW/cm 2 ) to simulate solar radiation.It is possible that this irradiance decreased slightly with the use of the lamp, but this should have been negligible according to the manufacturer.Additional information can be found in a previous study 34. Most experiments described in this paper were performed with a H2O vapour/CO2 ratio of 2:7, although other ratios were also assessed (2:20 and 2:1).The H2O vapour/CO2 ratio was increased by using the same amount of H2O vapour and decreasing the amount of CO2.However, to operate the photoreactor at constant pressure, appropriate quantities of an inert gas (He) were fed into the system.We operated the system in this way because if we tried to increase the H2O vapour/CO2 ratio by increasing the partial pressure of H2O vapour while keeping the CO2 amount constant, the H2O vapour saturation pressure was reached and H2O condensed.Other variables like catalyst weight (34.6-75.5 mg) and reaction time (3-4 h) were also evaluated.The initial absolute pressure in the reactor was 1.07 bar in all experiments. To quantitatively and qualitatively measure the different species in the reaction chamber, a GC analytical method was developed.The gas chromatograph (Agilent GC 7890A) possessed two thermal conductivity (TCD) detectors and a flame ionisation detector (FID) with a methaniser, which made it possible to determine gases such as CO, CO2, CH4, light hydrocarbons (C1-C7), light alcohols, ethers and ketones.H2 could not be analysed in the system because of technical limitations.Specifically, because He was used to increase the H2O vapour/CO2 ratio in the photocatalytic reactor, H2 and He were both present in the gas stream leaving the photoreactor.These gases could not be quantified separately because the signals for both He and H2 were detected in the same channel and with similar retention times.Nevertheless, according to the literature 36, in all the experiments performed in this work, the H2 produced should be negligible. In previous experiments with Degussa-P25 conducted at a higher H2O/CO2 ratio (2 g H2O/g CO2) than in the present work, CH4, CO and H2 production rates were 0.025, 1.233 and 0.005 mol g -1 h -1 , respectively.Therefore, the amount of H2 generated during the experiments described in the present work should be less than 0.005 mol g -1 h -1 ."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The yield is the ratio between the moles of catalyst produced during synthesis with supercritical CO2 and the moles of precursor used, taking into account that the synthesis reaction involves a 1:1 ratio for both precursors (1 mol precursor : 1 mol product).The yields obtained are presented in Table 2. Reported yields are the average of triplicate experiments.The two highest yields (85.5 and 72.0) were achieved when TTIP was used.Furthermore, the average yield attained in the six experiments performed with TTIP was higher than the average yield of the six runs carried out with DIPBAT (66.5 with TTIP vs. 62.4 with DIPBAT).In principle, these results could be attributed to the higher thermal and kinetic stability of DIPBAT compared with that of TTIP.TTIP is easily hydrolysable, even at ambient temperature, in the presence of humidity because it has four isopropoxy ligands coordinated to its Ti centre 33.DIPBAT has two of these groups substituted by two acetylacetonate ligands, which are more thermally and kinetically stable than isopropoxy ligands.Thus, hydrolysis of DIPBAT is more difficult than that of TTIP but it allows better reaction control.In contrast, synthesis experiments with ethanol as a hydrolytic agent gave slightly higher yields than those with isopropyl alcohol (71.2 vs. 61.8when TTIP was used as the precursor and 64.7 vs. 60.1 in the case of DIPBAT).This is probably caused by the higher polarity of ethanol than isopropyl alcohol.Alonso et al. 33 also reported that isopropyl alcohol led to a higher degree of C contamination in catalysts, as by-product elimination deteriorated because of their lower solubility in the less polar alcohol.For this reason, all the catalysts (even the reference commercial one) were calcined at 400 C for 6 h before conducting photocatalytic experiments.The calcination temperature was limited by the transition between anatase and rutile phases, which takes place at about 700 C 37.This calcination step will have important consequences for the properties of the catalysts discussed below.Regarding the effect of metal loading on yields, it can be seen that this variable does not have a clear influence on the results. The morphology of the synthesised Pt/TiO2 particles after calcination is shown in Fig. 4. Spherical particles were obtained when DIPBAT was used as a precursor.The SEM images reveal these particles were well-defined spheres with diameters of about 4-5 m.These spherical particles are slightly bigger than those of commercial TiO2 (Fig. 1) and reported by Alonso et al. 33, who obtained particles with diameters of 270 125 nm using TTIP and 200 100 nm using DIPBAT under synthesis conditions similar to those in this work (20 MPa and 300 C).Because particle size depends on reaction temperature, the larger particles obtained here could be caused by temperature fluctuation in the reactor (300 5 C); i.e., higher temperatures (305 C) led to larger particles.In the case of TTIP, larger polyhedral-like particles were obtained than when using DIPBAT, especially when ethanol was used as the hydrolysis agent.Some agglomeration was observed as the Pt loading increased, especially when ethanol was used as the hydrolysis agent.However, this phenomenon was largely avoided by calcination of the synthesised catalysts.It should also be highlighted that the particle sizes and shapes are similar to those obtained by other groups using supercritical fluid synthesis 33,38 and classical methods like chemical vapour deposition 39. Regarding the effect of particle size and morphology on catalyst performance, a previous study 40 showed that photocatalytic activity tended to decrease with increasing particle size because specific surface area was lowered.Likewise, it has been demonstrated that anatase nanoparticles with polyhedral-like shapes are more active than those with rounded or spherical shapes 41. Representative TEM images of TTIP-isopropyl alcohol-1Pt and TTIP-isopropyl alcohol-3Pt samples are provided in Fig. 5.In both cases, small Pt particles were uniformly dispersed over the crystalline TiO2 particles.The size distribution of Pt is relatively narrow for both catalysts, with average particle diameters of 2.2 nm for the sample with 1 Pt and 3.5 nm for that with 3 Pt.This size range is consistent with that reported by Semlali et al. 23 for mesoporous Pt/TiO2 thin films synthesised by evaporation-induced self-assembly with Pt loadings of 0.5-3 wt. The Pt concentration of the samples was measured by ICP-AES.In all cases, the total amount of Pt was incorporated into the final product during the synthesis of the Pt/TiO2 catalyst within the interval assayed (1-3 wt Pt). With respect to XPS analyses, Fig. 6 The estimated ratio between the Pt 4f and Ti 3s peak intensities at 61.8 eV leads to a relative Pt:Ti concentration of 0.6 on the TiO2 surface, which is compatible with the expected stoichiometry in the final product (taking into account the error when predicting stoichiometry from XPS data). The C peak is attributed to the residual C in the sample.The low intensity of this peak is indicative of the ready ability of the calcination process to remove precursor and alcohol C-based waste species.This peak could also arise from adventitious hydrocarbons originating from the XPS instrument itself 42. The results of SEM, TEM, XPS and ICP-AES indicate that, from the viewpoint of morphology, the catalysts with higher photocatalytic activity will be those obtained from the TTIP-ethanol-Pt reactant combination, because they have polyhedral shapes.However, focusing on particle size, catalysts synthesised from the TTIP-isopropyl alcohol-Pt combination may also display high catalytic activity. XRD is a unique method to determine the crystallinity of a compound.Knowledge about the crystallinity of a catalyst is relevant because photocatalytic performance usually increases with crystallinity, which is usually attributed to the removal of dangling bonds and distorted lattice structure acting as recombination sites as crystallinity increases.Nevertheless, high crystallinity may also lead to decreases of surface OH coverage and total surface area and, as a consequence, poorer catalytic behaviour 18. XRD patterns of the catalysts obtained from the different precursor-alcohol combinations are presented in Fig. 7.The TTIP-isopropyl alcohol-Pt catalysts show the highest crystallinity (highest peak height and resolution) of the sample, very close to that of the commercial catalyst (Fig. 1).In contrast, catalysts from the other combinations exhibit poorer crystallinity, even after calcination, which usually enhances this parameter 35.Additionally, the loading percentage of Pt does not seem to markedly affect the crystallinity of the catalysts. Regarding crystal phase, anatase TiO2 displays diffraction peaks at 2 of 25.4, 37.8, 48.5, 54.0, 55.4, 62.9, 68.9, 70.3 and 75.2 43,44.According to the patterns in Fig. 7, this allotropic phase (anatase) is the most common in the catalysts synthesised in this work.In fact, no diffraction peaks originating from any other crystal phase of TiO2 were observed in the XRD patterns of synthesised catalysts, indicating the formation of pure anatase TiO2.Considering the crystal phase of the catalysts before calcination, only the anatase phase was detected, as was the case in a similar study 33 with the same reagents and under the same synthesis conditions (20 MPa and 300 C).Metal loading does not affect the resulting crystal phase, because similar catalysts obtained in the absence of metal show only the anatase phase in their XRD patterns 45.However, this was not the case for the commercial catalyst, because TiO2 P-25 from Evonik (formerly Degussa) is a mixture of 80 anatase and 20 rutile phases 46.In this case, additional peaks at 27.5, 36.9 and 41.4 ascribed to rutile TiO2 are observed (Fig. 1).The absence of the rutile phase in the synthesised catalysts also means that the calcination to remove all organic contaminants is conducted at an appropriate temperature that avoids phase change 47.This result is important because anatase TiO2 is inherently more photoactive than rutile as a result of both its solid-state properties (better light absorption and charge transport) and surface properties (larger response to charge trapping and transfer and superior chemical response to the adsorbates involved in electron transfer reactions) 18.Fig. 7 does not contain any peaks attributable to Pt, which may be caused by the low content and high dispersity of the loaded Pt atoms 44. Crystallite size (D) is a measure of single-crystal size, and therefore it can be interpreted as an indicator of the crystalline quality of catalyst particles.This crystal parameter has the largest effect on photocatalysis from the viewpoint of light-material interactions including photon absorption, charge-carrier generation and dynamics, and surface trapping 37.D, which is the size of particles in the direction vertical to the corresponding lattice plane, can be determined from XRD line broadening measurements using the Scherrer equation 48: D 0.9/cos (1) in this equation, is the X-ray wavelength (0.1541 nm), the full width at half-maximum intensity (rad) and is half of the diffraction peak angle (approximately 12.7 for the 101 anatase crystal facet). Comparison of the data in Table 3 shows that the synthesised catalysts are smaller than the commercial catalyst (19.97 nm) with the sole exception of the TTIP-isopropyl alcohol-Pt combination (D 21.25-22.77nm).The smallest catalyst is TTIP-ethanol-Pt (9.65-9.98 nm).All D values reported here are compatible with those found by other groups 38,49.It should also be highlighted that, according to Table 3, the smaller particles generally have higher surface areas, although this relationship does not hold for the combination DIPBAT-ethanol-Pt.This discrepancy may be because the Scherrer equation is not completely adequate to estimate D of catalysts, despite being the most popular method for this purpose.That is, when using the Scherrer equation to calculate D from XRD data, D are assumed to be those of a coherently diffracting domain, which is not necessarily the same as particle size.The Scherrer equation attributes XRD peak broadening exclusively to crystal size, and does not take into account that crystalline defects also cause line broadening.Neither the Ti precursor nor the percentage of Pt loading strongly influenced D when ethanol was used as the hydrolytic agent.In contrast, the catalysts synthesised with isopropyl alcohol displayed D that depended on the precursor; larger D was obtained with TTIP than with DIPBAT.Likewise, neither the alcohol type nor the Pt loading affected D when DIPBAT was used as the Ti precursor.In contrast, when TTIP was used, D obtained with isopropyl alcohol were larger than those with ethanol.In principle, these experimental findings should be related to the nature of the reactants (TTIP is hydrolysed more easily than DIPBAT and isopropyl alcohol is less polar than ethanol).However, we are still looking for a convincing explanation for our results. According to the XRD analyses, TTIP-isopropyl alcohol-Pt should be the combination with the highest photocatalytic activity, because the formation of highly crystallised anatase with larger D might facilitate the transfer of photoelectrons, which could lower the probability of the recombination of photoinduced electrons and holes.However, as we shall see in the next section, this synthesis combination also led to small specific surface areas. The specific surface area (m 2 /g) is a parameter commonly used to determine the type and properties of a material regarding adsorption, heterogeneous catalysis and surface reactions.Several methods have been developed to measure the specific surface area of materials; the BET N2 adsorption procedure is one of the most widely used.In this work, we used the BET method to determine the specific surface areas of the catalysts. The synthesised Pt/TiO2 catalysts displayed type-IV adsorption isotherms with one hysteresis loop at a relative pressure range of 0.5-0.8.The measured specific surface areas for the catalysts are listed in Table 3.The samples synthesised from TTIP possessed smaller average surface areas than those obtained from DIPBAT.With respect to the alcohol used in the catalyst synthesis, the results depend on the Ti precursor.The surface area results are undoubtedly related to the crystallinity of the synthesised catalysts.Thus, samples with high crystallinity, such as those synthesised from TTIP and isopropyl alcohol show smaller surface areas (Table 3).In contrast, materials with poor crystallinity (like the catalysts obtained using DIPBAT) display increased porosity and surface area.Similar findings have been reported in the literature for other nanoparticles synthesised in supercritical CO2 33,50.Although it is not shown in Table 3, a slight decrease (5) in specific surface area with increasing Pt loading was observed for all precursor/alcohol combinations.This finding may be related to the deposition of Pt 0 nanoparticles 26. The mean pore size in the catalysts was estimated using the Barrett-Joyner-Halenda model, while the Harkins-Jura equation was used to determine the thickness of the adsorbed N2 layer from the adsorption data assuming cylindrical pore geometry.As shown in Table 3, all samples had mesoporous structures, which can enhance the rate of gaseous photocatalytic reactions because of the rapid diffusion of gas molecules within mesopores.According to the above results, if only surface area and pore volume are taken into account, the ideal particles for photocatalysis should be those obtained from the combinations of TTIP-ethanol-Pt and DIPBAT-isopropyl alcohol-Pt. The DRUV-vis spectra of the synthesised catalysts generally shifted toward the visible range compared with that of the reference commercial catalyst (Fig. 8).These results are of great interest because the emission spectrum of the Xe lamp used in the photocatalytic experiments to mimic the solar spectrum exhibited high irradiance in the visible range.The reason for using this lamp was to gauge the possibility of using sunlight as the energy source in future research. Many groups have examined how loading TiO2 with different cations shifts its absorption into the visible region 161718.The metal atoms act as a sink for photoexcited electrons, which enhances charge separation efficiency 51.This increase in visible-light absorption is also associated with the formation of oxygen vacancies/Ti 3 species 11.In this study, the absorbance in the visible range increased by up to ten times for TTIP-ethanol-Pt (Fig. 8(b)), DIPBAT-isopropyl alcohol-Pt (Fig. 8(c)) and DIPBAT-ethanol-Pt (Fig. 8(d)) compared with that of the commercial catalyst.In the case of TTIP-isopropyl alcohol-Pt, visible light absorption increased by seven times (Fig. 8(a)). Regarding the effect of the Pt loading percentage in the catalyst, Fig. 8 reveals that the absorbance in the visible range is higher for the Pt/TiO2 catalysts than for commercial TiO2.Moreover, the absorbance intensity increased with the metal concentration for catalysts synthesized with both Ti precursors 26.Absorption thresholds and Eg of the synthesised catalysts were calculated from the UV-vis spectra in Fig. 8, and are presented in Table 4.Each absorption threshold was obtained from the intersection of the x-axis and a line tangent to the absorption curve where the maximum slope is found 52.A shift towards the visible region of the absorption threshold of met- al/TiO2 photocatalysts has been often taken as direct evidence for enhancement of their photocatalytic activity under solar or visible irradiation 52. The band gap is the void region that extends from the top of the filled valence band to the bottom of the vacant conduction band in a semiconductor 53.The band gap of a semiconductor catalyst defines the amount of photons that are available for quantum conversion.Eg can be calculated from equation 2, where h is the Planck constant (4.13566733 10 -15 eVs), c is the speed of light (3 10 5 km/s) and is absorption threshold (nm) 54.The absorption threshold of the commercial catalyst was 407 nm, whereas those of the synthesised catalysts were higher (415-483 nm) (Table 4).The combination that gave the highest mean value was TTIP-ethanol-Pt, even though DIPBAT-ethanol-3Pt displayed the highest individual value.The absorbance intensity in the visible range is reflected by the colour of the samples.Thus, as shown in Fig. 9, the samples with weak absorbance in the visible range (P-25) are white, those with a moderate absorbance are grey (TTIP-isopropyl alcohol-1Pt), and those with the strongest visible absorption (TTIP-ethanol-1Pt) are brown.It should be noted that Fig. 9 depicts the photographs of the catalysts after use in the photocatalytic reaction, although their colour was similar before reaction.Another interesting observation in Fig. 8 is that only one absorption edge can be detected in the DRUV-vis spectra, indicating that the catalysts behave as a single phase rather than a mixture of compounds with different absorption thresholds 52.Moreover, there is a linear correlation between the absorption threshold and the amount of Pt in the catalysts. Similarly, while Eg of the commercial catalyst was 3.048 eV (pure anatase: 3.2 eV), all the synthesised catalysts showed Eg in the range of 2.669-2.990eV.This means that the energy required to excite the synthesised catalysts is lowered because extra levels are introduced in the gap region below the conduction band of TiO2 6,15.This decrease in excitation energy allows more efficient use of the visible spectrum by the Pt/TiO2 catalysts 15,55. Notably, the combinations with the lowest mean band gap value are TTIP-ethanol-Pt (2.723 eV) and DIPBAT-ethanol-Pt (2.752 eV).This variable decreased less than 5 as Pt loading increased from 1 to 3 wt.For this reason, all the photocatalytic experiments were performed using catalysts with a Pt loading of 1 wt.If these results are compared with those from catalysts synthesised in the absence of Pt 45, the adsorption threshold and Eg of every Pt/TiO2 catalyst are higher and smaller, respectively, than those of the corresponding catalyst without Pt.Thus, the introduction of Pt has a positive influence on the light harvesting ability of TiO2.In short, the absorbance of the synthesised catalysts is increased in the visible range compared with that of P-25, especially when ethanol is used as the hydrolysis agent. The FTIR spectrum of the commercial P-25 catalyst (Fig. 10) only shows a peak around 690 cm -1 , which corresponds to Ti-O-Ti bonds 56. The FTIR spectra of the synthesised catalysts are generally similar to that of the commercial catalyst (Figure 10).Some of the catalysts show a small peak around 1625 cm -1 and/or a wide band centred at 3000 cm -1 , which are attributed to stretching vibrations of OH groups and H2O on the catalyst surface 57,58.In principle, as explained above, the presence of these species usually favours the photocatalytic process 18.The presence of OH groups (Brnsted acid sites) is beneficial for the reduction of CO2, because they lead to efficient charge separation and transfer to the TiO2 surface 11.The abovementioned peaks mainly appear in catalysts that use ethanol as the hydrolysis agent, especially the combination TTIP-ethanol-Pt.In the case of DIPBAT-ethanol-Pt, these peaks disappear when the Pt content exceeds 1 wt. Particle size distribution and mean particle size are two important parameters of particulate materials.Both variables have a strong influence on other previously mentioned parameters such as surface area and porosity 33,38,50, which determine the efficiency of photocatalysis because they provide a contacting surface between catalyst, light and reactants. Regarding mean particle size, the mean size of the commercial catalyst (3 m) is considerably smaller than those of the synthesised catalysts; for example, 8.75 m for TTIP-ethanol-1Pt.These results are in accordance with the SEM images of the synthesised catalysts.The particle size distributions of the synthesised catalysts are wide; only 50 of particles are around 5 m in size, whereas the commercial catalyst has 72 of particles with sizes in the range from 0.6-5 m. Considering the effects of the reagents used on particle size, the influence of both precursors on particle size is smaller than those of the alcohol employed and metal loading.Thus, the introduction of ethanol and a larger amount of Pt facilitate increased particle sizes and aggregation, as indicated in SEM measurements.These results agree with those reported by Alonso et al. 33.Decreasing particle size leads to increased surface energy, lattice distortion/strain and changed surface dangling bond population, which means that TiO2 surface properties improve as particle size decreases 18.In other words, if only surface properties are considered, the commercial catalyst should show higher photocatalytic activity than the synthesised catalysts. The majority of photocatalytic CO2 reduction studies have been performed in liquid media using H2O as the solvent.However, one important issue when studying this process is the physical state in which it is carried out.For example, although CO2 photoreduction in liquid H2O is relatively simple, certain problems arise because of both the low solubility of CO2 in H2O and the existence of competing reactions that consume holes and electrons, leading to the formation of H2 and H2O2 at the expense of CO2 reduction products (methanol, CH4, CO, etc.) 59.Furthermore, if CO2 reduction is performed in liquid H2O, CO2 is in the form of carbonates or bicarbonates, which are more difficult to reduce than CO2 itself 6.Thus, it has been found that when liquid H2O is used as the reaction medium, organic yields are low 59.To avoid such liquid-phase reaction problems, some authors have proposed working under gas-phase conditions 35,55.Moreover, this would provide an additional advantage because in the reactions with H2O vapour, the photocatalyst is immobilised, which simplifies the separation of products from the catalyst.For all these reasons, we decided to test the activity of the synthesised catalysts by performing CO2 photoreduction in the gas phase.Different series of blank experiments ((a): in the absence of photocatalyst, (b): in the dark and (c): only with wet He (in the absence of CO2)) were performed, after which no reaction product containing C was detected, except for CO2 in series (a) and (b) (data not shown).Table 5 presents the results obtained with commercial and synthesised catalysts in the presence of light and CO2.Table 5 reveals that the main reaction products were CH4 and CO, a result consistent with one of the popular possible reduction mechanisms described in the literature 49 and with experimental results from other authors.For example, Yui et al. 60 reported that the main product from CO2 photoconversion was CO and that substantial quantities of CH4 were obtained only after introducing a metal onto TiO2.Mao et al. 44 later confirmed this finding, reporting that CH4 was the main conversion product of CO2 photoreduction using Pt dispersed on TiO2 as a catalyst. Four preliminary tests were carried out with commercial P-25 as the catalyst to select the operating conditions (amount of catalyst and H2O vapour/CO2 ratio) for the photocatalytic experiments with synthesised Pt dispersed on TiO2 catalysts (Table 5).These tests were also intended to gather data to compare the performance of commercial TiO2 and Pt/TiO2 catalysts.The parameter used to assess catalyst performance was the rate of product formation.For CO2 photoreduction, this parameter is generally expressed as the amount of product (mol) divided by the time it took to accumulate (h) and the amount of catalyst used (g) 49.In the assays with commercial TiO2, Table 5 shows that the CH4 and CO production rates were 0.033-0.078and 1.497-2.014mol g -1 h -1 , respectively.The activity of P-25 may be attributed to the complementary effects of anatase and rutile phases, in which the interfaces between the phases could play a major role in catalysis 49. The effect of H2O vapour/CO2 ratio on photocatalyst activity was investigated using about 35 g of TiO2 and H2O vapour/CO2 ratios of 2:1, 2:7 and 2:20.Table 5 reveals that the highest total rates (0.075 mol CH4 g -1 h -1 and 2.014 mol CO g -1 h -1 ) were obtained at the intermediate ratio (2:7).This result agrees with those reported in the literature because, although it is commonly believed that CO2 reactivity increases as the proportion of H2O is raised, it has also been reported that excess H2O could inhibit the reaction 61.The optimum H2O/CO2 ratio obtained in this work (2:7) is considerably lower than that reported by Anpo et al. 61 for CO2 photoconversion in liquid H2O (5:1).This result is very interesting because it indicates that the reaction products are far less dilute when the photoreduction process is performed in the gas phase (i.e., using H2O vapour instead of liquid H2O). Considering the effect of catalyst weight, the experiments performed at a H2O/CO2 ratio of 2:7 with a greater weight of catalyst (75.5 g vs. 35.5 g) did not necessarily lead to the best photocatalytic performance.This may be explained by considering the well-known fact that formation rate increases linearly with catalyst concentration only up to a certain value at which decreased light penetration and increased scattering occur, limiting formation rate 49. Regarding the effect of Pt on TiO2 photocatalytic performance, for the experiments carried out with catalyst weights of 35-40 mg, a H2O vapour/CO2 ratio of 2:7 and operating times of 3-4 h, the CH4 production rates were about 3.2 times higher using the Pt/TiO2 catalysts than the commercial catalyst.The highest performance was obtained for the combination TTIP-ethanol-1Pt when the operating time was 3 h.It should be noted that this catalyst had already shown superior characteristics, as illustrated in Table 6, which orders the catalysts used in the photocatalytic experiments from best to worst according to the value of the property analysed.In particular, Table 6 reveals that the characteristics that make this catalyst better than the others are its morphology (polyhedral), narrow Eg, the presence of surface OH groups, high surface area and relatively large mean pore size. Regarding the influence of these properties of catalysts on the CO2 photocatalysis, it should be noted that the higher the surface area is, the greater the number of reactant molecules adsorbed and the more quickly the electrons can reach them.This results in a lower recombination probability and higher product yield 10,18.In addition, the presence of basic species (OH groups) on the catalyst surface leads to stronger interactions with CO2 and higher uptake of this gas 10,11,18, so the larger the surface area is, the higher the catalyst activity will be. Regarding mean pore size, although small pores result in a large surface area, mesopores (as in our case: 7-10 nm) are always preferable to allow diffusion of reactant and product molecules 18.A narrow Eg is also desired because it improves light absorption and charge carrier generation 7891062.Finally, polyhedral particle shapes show higher activity than rounded particles because of their higher density of catalytically active sites, although this has not yet been fully explained 41. The catalyst showing the second highest CH4 production rate was DIPBAT-isopropyl alcohol-1Pt, which also exhibited high surface area.Alonso and colleagues also obtained good results with this catalyst in the oxidation of methyl orange in aqueous solutions 38.According to our results, surface area seems to be the most influential property on the catalyst activity in reduction of CO2 to fuel molecules.This assertion is further supported by the fact that the catalyst exhibiting favourable values of other properties (TTIP-isopropyl alcohol-1Pt), like small particle size and high crystallinity (Table 6), did not display a high CH4 production rate. These results also clearly show that the addition of Pt to the TiO2 catalyst markedly improves the photoactivity of the resulting catalyst in CH4 production 44,60.If the photocatalytic activities of Pt/TiO2 are compared with those of TiO2 photocatalysts obtained from the same Ti precursors and hydrolysis agents under the same synthesis conditions in supercritical CO2 45, we can see that there is an increase in CH4/CO ratio for the Pt/TiO2 catalysts (0.84-4.22) compared with those of their counterparts lacking Pt (0.03-0.30) (Table 7). The CO production rate of the synthesised catalysts was about 90 lower than that of the commercial catalyst, even that of the synthesized catalyst with the highest CO formation rate (DIPBAT-ethanol-1Pt).This observation cannot be explained only by the increase in the production of CH4.The photochemical H2O-gas shift reaction to produce H2 and CO2 from CO and H2O may have occurred, lowering the yield of CO 60.This reaction is often observed in the presence of noble metal/TiO2 catalysts 60,63.However, this does not seem a satisfactory explanation in these experiments given the low H2O vapour/CO2 ratio used 36.Regarding the reaction time, Table 5 reveals that extending the photocatalytic reaction from 3 to 4 h did not substantially increase the CH4 production rate.According to Habisreutinger et al. 49, this saturation of the product formation curve may be caused by strong adsorption of the O2 produced in CO2 photolysis, which may block reaction sites. Table 8 compares CH4 and CO production rates reported in recent studies for photocatalytic reduction of CO2 with H2O vapour as the reducing agent.The values are scarcely comparable because of the many variables are involved in the CO2 reduction process.Generally, the CH4 production rates obtained in this work are of the order of those reported for metal dispersed on TiO2 particles, TiO2 in the absence of metal, TiO2 nanotubes and even metal/TiO2 over optical fibres. Nevertheless, we are aware that there is still room for improvement.On the one hand, some investigators have reported higher CH4 production rates 7,8,11,13,14,70; on the other hand, actual conversion efficiencies reported here and in previous studies are still quite low and should be increased by orders of magnitude before the CO2 photoreduction process can be used in practical applications.Because of this, we are currently attempting to further enhance the photocatalytic activity of the TiO2-based materials reported in this work. Specifically, to increase the selectivity of the catalysts for the productions of CH4 and methanol, three strategies are being followed: The use of TiO2-based catalysts with enhanced geometries: TiO2 nanofibres and TiO2 nanotubes with and without metal modification 7,13.The addition of non-metal elements to TiO2 8.The synthesis of composite photocatalysts combining TiO2 and reduced graphene oxide 9,10."
  },
  {
    "title": "Conclusions",
    "content": "Photocatalysts with similar or better features, like high surface area, large pore volume, high crystallisation degree and high OH concentration, than those of commercial TiO2 can be obtained by supercritical media synthesis.This method is more environmentally friendly and scalable than traditional techniques used to fabricate TiO2-based photocatalysts.In addition, it is possible to improve the performance of catalysts by shifting their absorption spectra to the visible region if they are loaded with Pt at concentrations between 1 and 3 wt.. When the synthesised catalysts were used in CO2 photoreduction in the gas phase, we detected CH4 and CO as the main products at the end of the reaction time, which is in agreement with one of the possible reduction mechanisms described in the literature.The CH4 production rates of the catalysts synthesised in this work were clearly improved compared with that of a commercial catalyst and better or similar to those reported in the literature for catalysts synthesised with more expensive and laborious procedures. To sum up, photochemical conversion of CO2 constitutes not only an innovative technique to reduce greenhouse gas emission, but also a potential alternative to the depletion of fossil fuel resources.Although it is clear that the catalysts synthesised to date for CO2 reduction to fuel cannot yet be commercially applied, we expect that further developments will allow them to be in the near future.To achieve this goal, further work on photocatalyst design must combine the improvement in solar light response with the control of the efficiency and selectivity of the CO2 photoreduction process. Fig. 1.SEM image (left), XRD pattern (middle) and FTIR spectrum (right) of commercial P-25 catalyst. Fig. 2. Experimental system used to synthesise TiO2-based catalysts. Fig. 3. Details of the photocatalytic reactor.(a) 50-cm 3 stainless steel chamber; (b) O-ring-sealed quartz window; (c) filter with catalyst sample; (d) Air Mass 1.5 Global filter; (e) Xe arc lamp. shows the XPS survey spectrum of TTIP-ethanol-1Pt.The sample contains Ti, O, C and Pt, with sharp photoelectron peaks appearing at binding energies of 458.4 eV (Ti 2p), 529.6 eV (O 1s), 284.6 eV (C 1s) and 68-78 eV (Pt 4f).The Ti 2p and O 1s peaks originated from TiO2. Fig. 4. SEM images of synthesised catalysts after calcination.(a) TTIP-isopropyl alcohol-1Pt; (b) TTIP-ethanol-1Pt; (c) TTIP-isopropyl alcohol-3Pt; (d) TTIP-ethanol-3Pt; (e) DIPBAT-isopropyl alcohol-1Pt; (f) DIPBAT-ethanol-1Pt; (g) DIPBAT-isopropyl alcohol-3Pt; (h) DIPBAT-ethanol-3Pt. Fig. 5. Representative TEM images (a,b) and relative estimated Pt particle size distributions (c,d) of Pt/TiO2 catalysts.(a,c) TTIP-isopropyl alcohol-1Pt; (b,d) TTIP-isopropyl alcohol-3Pt. Fig. 6.XPS survey spectrum of the TTIP-ethanol-1Pt catalyst. Fig. 7. XRD patterns of synthesised catalysts.(a) TTIP-isopropyl alcohol-Pt; (b) TTIP-ethanol-Pt; (c) DIPBAT-isopropyl alcohol-Pt; (d) DIPBAT-ethanol-Pt. Fig. 8. DRUV-vis spectra of commercial and synthesised catalysts.(a) TTIP-isopropyl alcohol-Pt; (b) TTIP-ethanol-Pt; (c) DIPBAT-isopropyl alcohol-Pt (d) DIPBAT-ethanol-Pt (black lines: commercial, dashed lines 1 Pt, grey lines 2 Pt, dotted lines 3 Pt). Fig. 9. Photographs of filters with catalysts after photocatalytic experiments.(a) Commercial; (b) TTIP-isopropyl alcohol-1Pt; (c) TTIP-ethanol-1Pt. Fig. 10.FTIR spectra of synthesised catalysts (solid lines) and P-25 (dotted lines).(a) TTIP-ethanol-1Pt; (b) TTIP-isopropyl alcohol-1Pt; (c) TTIP-ethanol-2Pt; (d) DIPBAT-isopropyl alcohol-1Pt; (e) TTIP-ethanol-3Pt; (f) DIPBAT-ethanol-1Pt. Overview of Pt/TiO2-based catalysts. Synthesis yields of different catalysts. Surface properties and crystallite sizes of commercial and synthesised catalysts. Absorption threshold and band gap energies of commercial and synthesised catalysts. Results for photocatalytic reduction of CO2. Ordering of catalysts used in photocatalytic tests. This work was supported by Spanish Government (Project CTM 2011-26564), Regional Government of Castilla-La Mancha (Project PEII10-0310-5840), and Iberdrola Foundation (Research Grant in Energy and the Environment 2010/12 for Susana Toston)."
  }
]