[
  {
    "title": "Doi",
    "content": "10.1016/j.matdes.2020.108737"
  },
  {
    "title": "Article_Title",
    "content": "Controllable construction and efficient photocatalysis performance of Bi@Bi6O7FCl3 heterostructures exposed with the (012) plane bi-quantum-dots"
  },
  {
    "title": "Abstract",
    "content": "nanotubes are synthesized by an n-type semiconductor Bi 6 O 7 FCl 3 template. The facile construction of (012) plane Bi-quantum-dots is manufactured by in situ growth. The XPS and band gap determination of Bi show a -0.16 eV shift. The photocatalytic efficiency of Bi Bi 6 O 7 FCl 3 -90 is 6.29 times that of Bi 6 O 7 FCl 3 ."
  },
  {
    "title": "Experimental",
    "content": "Ultrafine F-doped Bi 6 O 7 FCl 3 nanotubes were prepared by the hydrothermal method.First, 0.5 mmol of Bi(NO 3 ) 3 5H 2 O (Shanghai Aladdin Biochemical Technology Co., Ltd., China) was dissolved in 15 mL of a mannitol solution (0.1 M), and then, 200 mg of PVP was added to the solution with vigorous stirring.Subsequently, 2.5 mL of a NaCl solution (0.1 M) and 2.5 mL of a NaF solution (0.1 M) were successively poured into the above solution, which was further stirred for 30 min.A suitable amount of NaOH (2 M) was slowly added to bring the mixture to pH 13.The mixture was then transferred to a 25 mL polytetrafluoroethylene-lined autoclave and incubated at 160 C for 3 h.Afterwards, the contents were washed three times with water and ethanol, successively, and dried in an oven at 60 C for 24 h to obtain Bi 6 O 7 FCl 3 (BF). BiBi 6 O 7 FCl 3 -X (X 20/60/90) nanotube peapods rich in Bi quantum dots were prepared through high-energy electron beam irradiation.The Bi 6 O 7 FCl 3 powder was divided into three parts and irradiated by the electron beam in doses of 20 KGy, 60 KGy and 90 KGy, respectively.Schematic 1 showed the process of material synthesis of Bi Bi 6 O 7 FCl 3 -X (X 20/60/90) nanotubes.The obtained samples were named as BiBi 6 O 7 FCl 3 -20 (BBF-20), BiBi 6 O 7 FCl 3 -60 (BBF-60) and BiBi 6 O 7 FCl 3 -90 (BBF-90), respectively. The microstructure of all photocatalysts was investigated by using a transmission electron microscope (TEM, Tecnai 30, Tecnai, USA).The distribution of the elements was characterized by an energy spectrometer (EDS).Ultraviolet-visible diffuse reflectance spectroscopy (DRS) of all samples was recorded with a UV-Vis spectrophotometer (UV-Vis, UV-2450, Shimadzu, Japan) against a background of BaSO 4 .The photoluminescence (PL, F-2700, Hitachi, Japan) was measured using a fluorescence spectrophotometer.The sample composition was characterized by X-ray powder diffraction on a copper-potassium X-ray diffractometer (XRD, D8 Advance, Bruker, Germany); the scan angle range was 5to 90, and the voltage and current were 40 kV and 40 mA, respectively.X-ray photoelectron spectroscopy (XPS, KRATOS, Shimadzu, Japan) was used to measure the electronic state and relative contents of the material.Electrochemical impedance spectroscopy (EIS) and Mott-Schottky (MS) measurements were carried out using an electrochemical workstation (PP211CHI1030B, Zahner, Germany) with a three-electrode system.The three-electrode system included an FTO glass electrode (working electrode), platinum wire electrode (opposite electrode) and standard hydrogen electrode (NHE, reference electrode).Electron paramagnetic resonance spectroscopy (EPR, EMXnano, Bruker, USA) was also used to study the capture of free radicals or holes by 5,5dimethyl-l-pyrrolidine N-oxide (DMPO) and 2,2,6,6-tetramethyl piperidinoxy (TEMPO) under 300 W xenon lamp irradiation. The photocatalytic reduction of CO 2 was carried out on a PLR MFPR-I multifunctional photochemical reactor.First, 30 mg of the photocatalyst powder was dispersed in 5 mL of water.500 mL closed gas system was evacuated, and then, high-purity CO 2 was gradually fed into the above system at a pressure of 0.08 MPa.The total irradiation time, with a 300 W xenon lamp as the light source, was 4 h (sampling every hour).The temperature of the whole reaction process was kept at approximately 5 C.The amount of CO and CH 4 produced was determined by gas chromatography."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The formation process of F-doped Bi 6 O 7 FCl 3 ultrafine nanotubes was shown in Fig. 1 After the electron beam bombarded the surface of Bi 6 O 7 FCl 3 nanotubes, the Bi O bond was broken to in situ produce oxygen defects, and the electrons obtained by Bi 3 were reduced to Bi 0 .TEM images were obtained to evaluate the morphological characteristics of the prepared photocatalysts.As shown in Fig. 1(c), F-doped Bi 6 O 7 FCl 3 (BF) showed a good ultrafine hollow tubular structure.The surface of the nanotube was smooth and flat and presented a diameter of approximately 10 nm and a wall thickness of approximately 5 nm.Then, Bi 6 O 7 FCl 3 was used as a precursor to modify Bi 6 O 7 FCl 3 with different doses of the high-energy electron beam.After being bombarded by the high-energy electron beam, the sample maintained a good ultrafine-to medium-sized hollow tube structure.Similar to the growth of peas, there were regular and granular Bi quantum dots on the inner tube wall of F-doped Bi 6 O 7 FCl 3 .As shown in Fig. 1(e), the wall thickness of the nanotubes became 2 nm after irradiated with electron beam at a dose of 90 KGy, which was nearly half that of the BF sample.Figs.1(f-h) showed the HRTEM images of BBF-20, BBF-60 and BBF-90, respectively.The results indicated that the irradiation dose had a certain impact on the in situ generation of Bi quantum dots.The inner tube wall of the Bi 6 O 7 FCl 3 nanotube began to undergo boundary contraction at the radiation dose of 20 KGy.As the irradiation dose increased, the inner tube wall of the Bi 6 O 7 FCl 3 nanotube continued to shrink, and the tube wall became thinner.These results indicated that electron beam irradiation preferentially reduced Bi 3 to granular Bi 0 on the inner wall of Bi 6 O 7 FCl 3 during the assembly process. Comparing the BBF-20, BBF-60 and BBF-90 samples, the specifications of Bi quantum dots formed in each sample also changed with the irradiation dose.The circle annotations marked in Figs.1(f-h) were the positions of Bi quantum dots.Specifically, the sizes of the Bi quantum dots were 1.8 nm, 2.3 nm and 3.0 nm at doses of 20 KGy, 60 KGy and 90 KGy, respectively.It was due to the fact that the Bi 0 particles formed could be properly separated from the interface of the sample and gradually spread to the surface of the nanotubes at a higher radiation dose.It should be pointed out that, in Fig. 1(h), the (213) and (511) crystal planes of Bi 6 O 7 FCl 3 corresponded to the spacings of 0.296 nm and 0.275 nm, respectively.Fig. 2 showed the very neat arrangement of atoms with d 0.325 nm, which could be classified as the (012) plane of Bi 0 , corresponding to the sharp and strong peak at 2 27.16in the XRD pattern. To analyze the microscale component composition of the photocatalysts, the XRD results of all materials were studied.The result in Fig. 3(a) shows that several characteristic diffraction peaks of 107), ( 116), ( 122), ( 214) and (300) crystal planes of Bi 0 , respectively.The results indicated that, the conversion of Bi 3 and the crystallinity of Bi 0 both increased with the electron beam irradiation dose. The microstructures and compositions of BF, BBF-20 and BBF-90 were further analyzed by X-ray photoelectron spectroscopy (XPS).Fig. 3(b) shows that BF, BBF-20 and BBF-90 were mainly composed of Bi, O, F and Cl.As shown in the high-resolution spectrum of Bi (Fig. 3 (c)), for the BF sample, the peaks at binding energies of 164.09 eV and 158.73 eV were identified as the 4f 5/2 and 4f 7/2 of Bi 3 , respectively 34.For BBF-20 and BBF-90, the high-resolution spectra of Bi could be divided into two peaks.The 4f 5/2 and 4f 7/2 peaks of Bi 3 were located at 163.93 eV and 158.57eV, respectively 35.Compared with those of BF, these peaks were shifted by approximately -0.16 eV.This negative migration indicated that Bi 6 O 7 FCl 3 was partially reduced.Meanwhile, binding energies of 163.29 eV and 157.78 eV revealed the characteristic 36,37.While the Bi O lattice bond shoulder in BBF-20 and BBF-90 was located at 529.38 eV, representing a peak shift of approximately 0.22 eV lower than that of BF 38.This phenomenon further proved that the reduction of Bi O by electron beam irradiation was consistent with the conclusion of high-resolution spectroscopy of Bi.In Fig. 3(e), the characteristic peak at a binding energy of 680.49eV was attributed to the F 1s of the BF sample.It can be considered that F was not simply adsorbed on the surface of the materials but was doped into the lattice of Bi 6 O 7 FCl 3 .Similar to the previous results, BBF-20 and BBF-90 also exhibited a negative shoulder shift of 0.12 eV, and this was also consistent with Cl being replaced by F in the crystal lattice, thereby changing the chemical environment around the Bi and O atoms.The characteristic Cl 2p peaks were shown in Fig. 3(f), and their positions were slightly different among the various samples.For BF and BBF-20, the peaks at 198.92 eV and 197.52 eV were attributed to the 2p 1/2 and 2p 3/2 of Cl -, respectively 39.For BBF-90, the 2p 1/2 and 2p 3/ 2 binding energies of Cl -were positively and negatively shifted to 199.10 eV and 197.36 eV, respectively.Furthermore, the relative contents of the respective elements in the prepared samples were calculated based on the XPS and EDS data, and the results are shown in Table 1.The atomic percentages of Bi, O, F and Cl elements in Bi 6 O 7 FCl 3 before electron beam irradiation were 34.9 at., 42.3 at., 5.8 at. and 17.0 at., respectively.The atomic ratio of Bi, O, F and Cl was about 6:7:1:3, proving that the obtained nanotubes were Bi 6 O 7 FCl 3 which was consistent with the XRD data.After electron beam irradiation, the atomic percentages of Bi, O, F, and Cl elements in the BBF-90 sample were 30.8 at., 64.8 at., 1.2 at., and 3.2 at., respectively.The element composition of the prepared nanotubes changed due to the formation of Bi 0 in the inner wall of photocatalysts.Specifically, some of the chemical bonds have been broken in the process of electron beam irradiation, and there will be in-situ loss of O, F, Cl elements.The content of Bi 0 in BBF-20 and BBF-90 was 6.3 wt and 6.7 wt, respectively.With the increase of irradiation dose, the content of Bi 0 did not increase significantly.As illustrated in the TEM and XRD results, the size of Bi quantum dots for the sample modified at the irradiation dose of 90 KGy was regular and the degree of crystallization became higher.The increase of the irradiation dose plays a positive role in improving the crystallinity of the Bi Bi 6 O 7 FCl 3 heterostructures. In a closed system, the CO 2 photocatalytic reduction experiments were carried out under simulated visible light in the presence of a small amount of H 2 O.As shown in Fig. 4, the main products monitored by gas chromatography were CO and a small amount of CH 4 .Fig. 4 (a) exhibits the CO yield plot.It revealed that the BF sample produced the lowest CO yield (10.05 molg -1 ), while the BBF-20, BBF-60 and BBF-90 yields were 50.93, 57.58 and 63.17 molg -1 , respectively.The results indicated that the electron beam irradiation treatment was beneficial to improving the various photocatalytic activities.After 4 h of irradiation with a 300 W xenon lamp, BiBi 6 O 7 FCl 3 -X (X 20/60/90) showed a significant increase in the rate of CO production when compared to that of the untreated Bi 6 O 7 FCl 3 .Among them, the lowest irradiation dose of BBF-20 (12.72 molg -1 h -1 ) was first increased to 5.06 times that of untreated Bi 6 O 7 FCl 3 (2.51molg -1 h -1 ).Finally, the rate of CO formation in BBF-90, obtained with a dose of 90 KGy, was 15.79 molg -1 h -1 , which was 6.29 times that of Bi 6 O 7 FCl 3 .The reason for the phenomenon was that Bi 3 in the Bi 6 O 7 FCl 3 nanotubes was gradually reduced to Bi 0 by electron beam irradiation, and the Bi quantum dots with a small particle size had the characteristics of limiting electron-hole pair recombination.Bi quantum dots restricted the recombination of electrons and holes on their surfaces and increased the utilization of electrons and holes in photocatalysis.From the XPS results, the contents of Bi 0 in the BBF-20 and BBF-90 samples were 6.3 wt and 6.7 wt, respectively.This implied that the Bi 0 content was positively correlated with the CO yield.In addition, combined with XRD results, it was concluded that the (012) crystal plane of Bi 0 appeared in the sample after electron beam irradiation and played a major role in the photocatalytic reduction of CO 2 .To determine the stability of the obtained photocatalyst, the BBF-90 sample was selected for the cycle test.In Fig. 4(d), after five photocatalytic cycles, the CO yield of the BBF-90 material remained at approximately 61.07 molg -1 , which was satisfactory.It proved that BBF-90 exhibited excellent durability and recyclability of the photocatalysts. Generally, visible light has wavelengths in the range of 400 nm to 760 nm.The results of Fig. 5(a) showed that all the samples exhibited apparent absorption sidebands at a wavelength of approximately 450 nm.This result suggested that each sample possessed an excellent optical absorption in the visible range.A proper band gap is a prerequisite for excellent photocatalytic properties in semiconductor materials. To investigate the charge flow in each sample, the band gap of each sample was calculated according to the following formula: where , h, , A and g are the absorption coefficient, Planck constant, optical frequency, a constant, and band gap energy, respectively 40. The value of n determines the nature of the transition in the semiconductor (n 1 for direct transition and n 4 for indirect transition).According to the relevant literature, Bi 6 O 7 FCl 3 was a direct transition semiconductor 8.Fig. 5(b) shows that the band gaps of BBF-20, BBF-60 and BBF-90 were 1.87 eV, 2.67 eV and 2.70 eV, respectively.Compared with the untreated Bi 6 O 7 FCl 3 (band gap of 1.82 eV), the energy band gap of each sample showed different degrees of increment after the various doses of electron beam irradiation.The results showed that the BiBi 6 O 7 FCl 3 -X (X 20/60/90) photocatalysts had a wide optical response range and a high photogenic carrier life, which was highly consistent with the photocatalytic results.Fig. 5(c) shows that the BF sample had the tallest PL peak at an excitation wavelength of 323 nm due to its maximum electron-hole pair recombination rate.After electron beam irradiation, the PL peak of the BBF-20 sample decreased, indicating that the reduction by electron beam irradiation and formation of the Bi quantum dots inhibited the electron-hole pair recombination in the Bi 6 O 7 FCl 3 nanotubes.The PL peaks of the BBF-60 and BBF-90 samples further decreased with the increase in irradiation dose.The amount of Bi 0 at different irradiation doses was obtained by the XPS results, which implied that Bi 0 played an active role in inhibiting the recombination of electron-hole pairs.The synergistic effect of Bi quantum dots made the electrons and holes separate rapidly and thus improved the lifetime of photogenerated carriers.It is worth noting that after the electron beam irradiation, the PL shoulder peaks of the BBF-20, BBF-60 and BBF-90 samples showed a slight redshift.This change was probably due to the formation of Bi quantum dots that provided the resonance of Bi 0 -Bi 0 metal bonds in the BBF-20, BBF-60 and BBF-90 samples.It could also be observed that all the samples showed an evident trailing phenomenon after a wavelength of 375 nm.Due to the increase in Bi 0 , the resonance effect of the Bi 0 -Bi 0 bonds was further enhanced. From the results in Fig. 5(d), the BF sample showed the largest arc radius, indicating the lowest separation efficiency for photogenerated electron-hole pairs 41.Compared with the BF sample, the arc radii of BBF-20, BBF-60 and BBF-90 decreased in turn after the electron beam irradiation treatment, indicating that the generation of Bi quantum dots made the interface resistance of each sample small.The BBF-90 sample showed the smallest arc radius, which could be attributed to the maximum number of Bi quantum dots, and revealed that it had the highest separation efficiency for photogenerated electrons and holes. To further analyze the energy band structure of the catalyst, the Mott-Schottky curve was obtained to determine the flat potential of all samples prepared.The positive slope shown in Fig. 6 indicated that the Bi 6 O 7 FCl 3 and BiBi 6 O 7 FCl 3 -X (X 20/60/90) samples were ntype semiconductors with flat potentials of -0.60, -0.61, -0.93, and -0.94 V.That is, the free electron concentration in the semiconductor was significantly higher than the hole concentration, which meant that photogenerated electrons also played an important role in the catalytic system.Generally, the conduction band (E CB ) of an n-type semiconductor is consistent with the flat potential measured by a standard hydrogen electrode 27.Namely, the conduction band values of BF, BBF-20, BBF-60 and BBF-90 samples were -0.60, -0.61, -0.93 and -0.94 eV, respectively.The valence band (E VB ) position is generally determined by the following formula: Therefore, according to the energy band gap of each sample, the valence bands of BF and BBF-20, BBF-60 and BBF-90 were calculated to be 1.22,1.26, 1.74 and 1.76 eV, respectively.To test the hydrophilic and hydrophobic properties of each sample, a static water contact angle test has been performed.The BF sample showed a small static water contact angle of 37.7, indicating that the material was hydrophilic.An interesting phenomenon occurred, as after electron beam irradiation, the static water contact angles of the BBF-20, BBF-60 and BBF-90 samples increased to 45.0, 51.0and 53.9, respectively.This change was due to the electron beam irradiation treatment of the Bi 6 O 7 FCl 3 nanotubes.Bi quantum dots were preferentially generated on the inner tube wall, resulting in static water contact angles that were contrary to the trend of traditional materials. To more intuitively analyze the relationship between the potential of the photocatalyst and the CO 2 /CO potential in the photocatalytic process, the energy band structure of the sample was obtained 42,43.Fig. 7(a) shows that the conduction band positions of BF, BBF-20, BBF-60 and BBF-90 samples (-0.60, -0.61, -0.93 and -0.94 eV, respectively) were more negative than the -0.52 eV for CO 2 /CO.This result indicated that the generation of Bi quantum dots would enhance the reducibility of BiBi 6 O 7 FCl 3 -X (X 20/60/90) samples, which would make reducing CO 2 more efficient.Similarly, the reduction potential of CO 2 /CH 4 is -0.24 eV, which was more positive than that of CO 2 /CO, but the production of CH 4 by the BiBi 6 O 7 FCl 3 -X (X 20/60/90) samples was not significantly increased.This observation illustrated that the BiBi 6 O 7 FCl 3 -X (X 20/60/90) samples had a high selectivity for CO 2 reduction to CO.In general, the utilization proportions of O 2 -, OH and h play a crucial role in the efficiency of a photocatalyst 44.For this purpose, 2,2,6,6-tetramethylpiperidineoxy (TEMPO) and 5,5-dimethyl-l-pyrrolidine N-oxide (DMPO) were used to capture h , O 2 -, and OH in BBF-90, respectively.Specifically, electron spin resonance (EPR) peaks of holes and free radicals were obtained in the dark or with 300 W xenon lamp irradiation.As shown in Fig. 7(b), BBF-90 showed a strong TEMPO-h signal peak under the dark condition, but the signal was significantly weakened after 5 min of illumination, indicating one of the reasons for the photocatalytic efficiency was affected by photoluminescence 45.Fig. 7(c) shows that no characteristic peak of the DMPO-O 2 -adduct was observed under the dark condition, but the electron spin resonance signal was significantly enhanced after 5 min of illumination.This signified that photoexcited H 2 O produced a large amount of O 2 -in the presence of BBF-90, which played a positive role in the photocatalytic reaction.Similarly, the characteristic peak of the DMPO-OH adduct is shown in Fig. 7(d).There was no clear characteristic peak under the dark condition.However, the characteristic signal of the DMPO-OH adduct was significantly enhanced after 5 min of illumination.Thus, in the whole photocatalytic system, the O 2 -, OH and h generated on the surface of the photocatalyst after photoexcitation improved the efficiency of photocatalytic CO 2 reduction. Combined with the above analysis, as shown in Fig. 8, BiBi 6 O 7 FCl 3 -90 was taken as an example to describe the possible photocatalytic mechanism in the photocatalytic reduction of CO 2 to CO.Under a 300 W xenon lamp simulating sunlight, photoexcitation first caused electrons in the valence band (VB) of Bi 6 O 7 FCl 3 to transfer to the conduction band (CB), thus, leaving photogenerated holes (h ) in the process (Eq. 3) 46.The Fermi level (-0.17 eV) of Bi 0 was positive compared to the conduction band (-0.94 eV) of Bi 6 O 7 FCl 3 .Therefore, a large number of electrons accumulated in the conduction band of Bi 6 O 7 FCl 3 were transferred to Bi 0 .At the same time, the outer electrons in Bi 0 were also excited by light to produce free electrons, leaving holes (h ).Due to the small resistance of Bi 0 , the photogenerated electrons and holes were rapidly separated on Bi 0 47.On the one hand, h oxidizes a small amount of H 2 O in the system to produce hydroxyl radicals (OH) and free H (Eq.4).Some of the free electrons transferred to Bi 0 were used to generate superoxide radicals (Eq.5), and the other electrons were used to reduce CO 2 48.This indicated that h , O 2 -and OH were all active species to increase the photocatalytic efficiency. The results were consistent with the EPR results.On the other hand, the process of CO 2 reduction to CO could be presented as follows.The conduction band of the BiBi 6 O 7 FCl 3 -90 (-0.94 eV) was much higher than the reduction potential of CO 2 /CO (-0.52 eV).First, protons (H ) and electrons (e -) produced in the CO 2 molecular adsorption system generate COOH intermediates (Eq.6), and then COOH intermediate continued to protonize and generated CO (Eq.7).In addition, the extra photogenerated electrons on Bi 0 transfer to the valence band of Bi 6 O 7 FCl 3 to fill the original holes.When the light was continuously shined, the electrons were restimulated to achieve recycling.For a small amount of CH 4 produced in the process of CO 2 reduction, the reduction potential (-0.24 eV) of CO 2 /CH 4 was much lower than that of BiBi 6 O 7 FCl 3 -90 (-0.94 eV), and CH 4 was easier to generate theoretically.Actually, the amount of CH 4 produced was much smaller than that of CO.It may be due to that more electrons were needed to generate CH 4 than to generate CO 9,49.The possible production process of CH 4 was as follows: as a reduction product, CO was partially protonated under light conditions to obtain CO intermediate (Eq.8), and CO gradually combines electrons and H to finally produce CH 4 (Eq.9).The equations that may be involved in the process of photocatalytic reduction of CO 2 were as follows:"
  },
  {
    "title": "Conclusions",
    "content": "In summary, BiBi 6 O 7 FCl 3 -X (X 20/60/90) photocatalysts with Bi quantum dots were obtained by using ultrafine Bi 6 O 7 FCl 3 nanotubes as a template and electron beam irradiation.BiBi 6 O 7 FCl 3 -X (X 20/60/ 90), with a good stability and reusability, presented a high selectivity for CO 2 reduction into CO.The CO yield of BiBi 6 O 7 FCl 3 -90 was 6.29 times that of Bi 6 O 7 FCl 3 .The increase of the irradiation dose plays a positive role in improving the crystallinity of the BiBi 6 O 7 FCl 3 nanotubes.Transmission electron microscopy (TEM) demonstrated the boundary contraction and reverse growth of quantum dots in nanotubes after electron beam irradiation.This technique also revealed that Bi Bi 6 O 7 FCl 3 -X (X 20, 60 and 90) was similar to the morphological characteristics of peas.The XRD results showed the integrity of the crystal, and the Bi 0 characteristic (012) crystal plane was observed.The XPS results revealed that the binding energy of Bi decreased by 0.16 eV, which indicated that Bi 3 was gradually converted to Bi 0 with electron beam irradiation.The DRS, PL, MS and EIS results showed that the samples irradiated by the electron beam presented a good visible-light response and high electron-hole pair separation rate, which played an active role in the photocatalytic reduction of carbon dioxide.The EPR results demonstrated that h , O 2 -and OH were all active species in the photocatalytic system.In general, this study provides a green strategy for exploring the construction of quantum dots and the synthesis of photocatalysts rich in quantum dots that are essential to obtain renewable energy sources from CO 2 . (a).The negatively charged Cl -anions separated Bi 2 O 2 2 layers from the BiOCl layered tetragonal crystal structure 15.Specifically, Bi 6 O 7 4 cations and Cl 4 4-anions were first generated through the hydrothermal reaction, and the interaction between them resulted in the formation of Bi 6 O 7 Cl 4 unit intermediate.Simultaneously, the F atoms, with a strong electronegativity, entered into the Cl 4 4-layers, replacing a portion of the Cl atoms to form a new FCl 3 4-layer.The ultrafine tubular Bi 6 O 7 FCl 3 was produced after the introduction of F -. Fig. 1(b) exhibited the reduction process of Bi quantum by electron beam irradiation. Fig. 2(c) showed the diffraction pattern of the (012) crystal plane of Bi 0 , which further indicated the integrity of the (012) crystal plane.In Fig. 2(d), several complete crystal faces were the (012) with d 0.325 nm and the (104) with d 0.237 nm.Fig. 2 (e) shows the diffraction pattern of the (104) crystal plane of Bi 0 .Fig. 2(f) shows the EDS diagram of BBF-90.It can be observed that Bi Bi 6 O 7 FCl 3 -90 contained Bi, O, F and Cl elements. Synthesis process of Bi 6 O 7 FCl 3 nanotubes.Bi 6 O 7 FCl 3 can be observed in all photocatalysts.For BF, the characteristic diffraction peaks at 2 14.45, 28.15, 30.11, 31.74,32.51, 45.72, 49.96, 53.77, 55.59and 57.58could be corresponded to the (301), (503), (213), (313), (714), (904), (218), (1104) and (623) crystal planes of Bi 6 O 7 FCl 3 (PDF70-0854), respectively.After electron beam irradiation, the crystal planes of BBF-20, BBF-60, and BBF-90 all changed to different degrees, among which, the (301), (213), (313), (218) and (623) crystal planes of Bi 6 O 7 FCl 3 gradually disappeared.In addition, the peak signal of the (503) crystal plane also decreased significantly, for which BBF-90, with an irradiation dose of 90 KGy, exhibited the most reduced peak.Meanwhile, the (104) and (110) crystal faces of Bi 0 (PDF44-1246) appeared at 2 37.95and 39.61in BBF-20, BBF-60 and BBF-90.Corresponding to the (012) crystal plane of Bi 0 at 2 27.16, the peak signal at this position was significantly enhanced, with that of BBF-90 being the strongest.This result indicated that Bi 3 was gradually converted to Bi 0 with electron beam irradiation.As the irradiation dose increased, more crystal planes of Bi 0 developed in BBF-60 and BBF-90.The characteristic diffraction peaks at 2 44.55,48.68, 59.32, 62.17, 64.49, 70.76and 71.86could be corresponded to the (015), (202), ( Fig. 1.The F-doping process (a) frontal growth process of Bi quantum dots (b); The TEM images of BBF-90 (c-e), the HRTEM images of BBF-20 (f), BBF-60 (g) and BBF-90 (h). 2 and 4f 7/2 peaks of Bi 0 , respectively.The results indicated that Bi 3 in Bi 6 O 7 FCl 3 was gradually reduced to Bi 0 by the electron beam irradiation.Fig.3(d) shows that for the BF sample, the characteristic peaks of the O 1 s at 531.20 eV, 530.52 eV, and 529.60 eV are attributed to oxygen coordination defects, surface-adsorbed O H, and Bi O lattice bonds in Bi 6 O 7 FCl 3 , respectively Fig. 2. The TEM image (a), HRTEM images (b-d), diffraction pattern and EDS spectrum of BBF-90. Fig. 3.The XRD patterns of all samples (a); the XPS spectra of BF, BBF-20 and BBF-90: full spectrum (b), Bi 4f (c), O 1s (d), F 1s (e) and Cl 2p (f). Fig. 5.The DRS spectra (a), the band gaps (b), the PL spectra (c) and EIS plots (d) of BF, BBF-20, BBF-60 and BBF-90. Fig. 4. The photocatalytic reduction of CO (a) and CH 4 (b) yields of all samples, the formation rates of CO for all samples (c), and the photocatalytic cycling experiment of BBF-90 (d). Fig. 6.The Mott-Schottky curves of BF (a), BBF-20 (b), BBF-60 (c) and BBF-90 (d), including the static water contact-angle measurements. Fig. 7.The schematic band structures of BF, BBF-20, BBF-60 and BBF-90 (a); the EPR spectra of BBF-90 in the dark and with light for 5 min: h (b), O 2 -(c) and OH (d). Wang:Conceptualization, Writing -original draft.Kehui Xue:Investigation.Ren He:Investigation.Tianli Yang:Investigation.Yi Peng:Investigation.Ying Yan:Investigation.Yuanlan Wang:Writing -review editing.Hui Wang:Writing -review editing.Wenlei Wang:Writingreview editing. The Bi, O, F and Cl contents in BF, BBF-20, and BBF-90 samples. 6.7 53.2 35.2 0.3 4.6 3.9 26.9 64.8 1.2 3.2 J. Wang et al. / Materials and Design 192 (2020) 108737 Acknowledgement The authors gratefully acknowledge the financial support of the National Key Research and Development Program of China (2018YFB15011401), the National Natural Science Foundation of China (Grant Nos: 41977129, 21607176), Changsha Outstanding Innovative Youth Training Program (Grant No. kq1802011), the Natural Science Foundation of Hunan Province, China (Grant No. 2017JJ3516), and the Research Foundation of the Education Bureau of Hunan Province, China (Grant No. 16B274).The authors also thank the reviewers for their constructive comments and suggestions. Fig. 8.The possible photocatalytic processes of CO 2 reduction with BiBi 6 O 7 FCl 3 -90 as photocatalysts. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper."
  }
]