[
  {
    "title": "Doi",
    "content": "10.1016/j.cej.2021.131554"
  },
  {
    "title": "Article_Title",
    "content": "Construction of frustrated Lewis pairs on TiO2-x derived from perovskite for enhanced photocatalytic CO2 reduction"
  },
  {
    "title": "Abstract",
    "content": "Exploring high-efficiency photocatalysts to promote CO 2 reduction into high value-added products is of great significance.However, the weak adsorption and activation ability for CO 2 hampers the efficiency of photocatalytic CO 2 reduction.Herein, hierarchical hollow TiO 2-x boxes with frustrated Lewis pairs (FLPs) are successfully fabricated by in situ topological transformation of perovskite microcubes.The FLPs on TiO 2-x surface are constructed with the O Vs (Lewis acid sites) and its proximal surface hydroxyls (Lewis base sites).TiO 2-x hollow boxes with FLPs show an excellent CO production rate (65.1 mol g -1 h -1 ) in pure water without any sacrificial agents or cocatalysts, which is 19.1 times and 36.6 times higher than those of TiO 2 without FLPs and commercial TiO 2 P25, respectively.This work presents a novel strategy to construct FLPs through in situ topological transformation route and also shows great promise for the future design of high-performance CO 2 reduction photocatalysts."
  },
  {
    "title": "Experimental",
    "content": "Titanium n-butoxide (TBT) was purchased from Sigma-Aldrich Reagent Company.Calcium chloride dihydrate (CaCl 2 2H 2 O), sodium hydroxide (NaOH), Na 2 EDTA, ethylene glycol (EG), poly(ethylene glycol) (PEG-200) were purchased from Sinopharm Chemical Reagent Co. Ltd., and ethanol were taken from Shanghai Titan Scientific Co. Ltd.The ultrapure water (resistivity 18 MW cm -1 ) was obtained from a Milli-Q system.All chemicals are analytical grade and used as received. In a typical preparation process, 0.11 g of CaCl 2 2H 2 O was dissolved in 20 mL of PEG-200 and ethanol mixture solution (V PEG-200 : V ethanol 1:19).After the above mixture solution stirred and mixed well, 0.33 mL of TBT was injected and then added into 0.24 g of NaOH.After stirring evenly, the suspension was transferred into a 50 mL Teflon-lined stainless-steel autoclave, and heated at 453 K for 15 h in an electric heating oven.After cooling to room temperature, the obtained sample was washed with deionized water for several times and then dried at 333 K for 6 h. In a typical synthesis, as-obtained 75 mg of CaTiO 3 microcubes as precursor and Na 2 EDTA as chelating agent were dispersed in the 40 mL of EG and ultrapure water mixture solution (V EG : V water 1:3).The mixture was transferred into a 50 mL Teflon-lined stainless-steel autoclave and heated at 453 K for 12 h in an electric heating oven.After cooling to room temperature, the obtained sample was washed with deionized water for several times and then dried at 333 K for 6 h. The obtained TiO 2-x samples were annealed at 473 K, 573 K, and 673 K under air atmosphere for 2 h, and the obtained samples were named as TiO 2 -A-L, TiO 2 -A-M, and TiO 2 -A samples, respectively.TiO 2-x -F sample was synthesized according to the synthesis process of TiO 2-x by varying the adding amount of Na 2 EDTA (0.2 g, mol TiO2 : mol Na2EDTA 1:1) in the reaction system.TiO 2 -H sample was fabricated using TiO 2-x samples annealed at 673 K under 5 H 2 /Ar atmosphere for 2 h. X-ray diffraction (XRD) patterns of the samples were recorded on a D8 Advance diffractometer (Bruker, Germany) with Cu K radiation.The morphology and structure were observed on FEI Tecnai F30 highresolution transmission electron microscopy (HRTEM) and Zeiss Sigma-300 scanning electron microscope (SEM).X-ray photoelectron spectroscopy (XPS) was implemented on a Thermo ESCALAB 250XI spectroscopy instrument.UV-vis diffuse reflectance spectra (DRS) were recorded on a UV-vis spectrophotometer (U-3900, Hitachi) and BaSO powder was used as a reference.A high-resolution Raman spectrometer (LabRAM HR Evolution, HORIBA JOBIN YVON SAS) was used for measuring Raman spectra.The electron spin resonance (ESR) signals were measured by Bruker A300.Fourier transform infrared (FTIR) spectra were recorded by Fourier infrared spectrum instrument (Nicolet 380).Thermogravimetric Analysis (TGA) curves were recorded on a NETZSCH.Carbon dioxide temperature-programmed desorption (CO 2 -TPD), ammonia temperature-programmed desorption (NH 3 -TPD), and carbon monoxide temperature-programmed desorption (CO-TPD) measurements were carried out on a Micromeritics AutoChem II chemisorption analyzer. 13C-labeled CO 2 isotope tracer experiment were detected by gas chromatograph-mass spectrometer (GC-MS, TRACE 1310-ISQ LT, Thermo). The process of CO 2 photoreduction is as follows: The photocatalyst (20 mg) was dispersed into 15 mL water with stirring in the quartz tube, firstly pumped a vacuum of the reaction tube and then bubbled using high purity CO 2 gas, repeated the process for three times to exhaust the air in the tube and filled with enough CO 2 gas.A 25 W UV LED lamp was applied as the light source.The gas was collected and monitored via GC-7920 gas chromatograph using flame ionization detector (FID) and thermal conductivity detector (TCD) detectors within a given time interval. Transient photocurrent responses and electrochemical impedance spectroscopy (EIS) were carried out on a CHI660e electrochemical analyzer (Shanghai Chen Hua Instruments) in a standard three-electrode configuration using Na 2 SO 4 (0.1 mol L -1 ) aqueous solution as the electrolyte.The films of TiO 2 samples deposited on fluorine doped tin oxide (FTO) glass were employed as the working electrode.A Pt plate and Ag/ AgCl were acted as counter electrode and reference electrode, respectively.300 W Xe lamp was supplied as light source.EIS measurements were observed using a 10 mV alternating current amplitude in a range from 10 mHz to 100 kHz frequency.Mott-Schottky tests were measured under 10 mV amplitude at the frequencies of 0.8 kHz and 1 kHz, respectively. Density functional theory as implemented in the Vienna Ab-initio Simulation Package (VASP) was employed to optimize geometry structures for TiO 2 -A and TiO 2-x with FLPs 34.The exchange-correlation interactions were described by the generalised gradient approximation (GGA) in the form of the Perdew-Burke-Ernzerhof functional (PBE) 35.A cut-off energy of 500 eV for plain-wave basis sets was adopted and the convergence threshold was 10 -5 eV, and 5 10 -3 eV/A for energy and force, respectively.The weak interaction was described by DFT D3 method using empirical correction in Grimme's scheme 36.The vacuum space was set to be more than 20 A, which was enough to avoid the interaction between periodical images.For TiO 2 (1 0 1) structure, a 23 supercell has been used during the calculation, and the GGA U function was performed with the U eff (U eff Coulomb Uexchange J) values of 4.0 eV for Ti atoms."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The synthesis of TiO 2-x is divided into two main steps as shown in transmission electron microscope (TEM, Fig. 2c and2d).A closer TEM examination shows the shell of the hollow boxes are consisted of nanoparticles or nanosheets with the size of 10 20 nm.The HRTEM image in Fig. 2e suggests the distinct lattice fringes with an interlayer spacing of 2.56 A (Fig. 2f).The observed blurry lattice fringes in a yellow circle in Fig. 2e indicate the existence of abundant defects in TiO 2-x sample 37.The defects can combine with hydroxyl groups to construct surface FLPs on TiO 2-x , which will be discussed in the following text.By annealing the TiO 2-x samples at 673 K, the obtained TiO 2 -A maintains the same morphology of hollow hierarchical structure (Fig. S3).In addition, the XRD and Raman analysis also indicate that the phase composition of the TiO 2 -A samples remains anatase after annealing treatment (Fig. S4). In order to reveal the surface differences between the TiO 2-x and TiO 2 -A samples, a series of characterization such as XPS, EPR, UV-vis DRS, FTIR, TGA, and TPD is performed.XPS analysis is carried out to identify the chemical state and content of the elements in samples.The XPS survey spectra indicate that no Ca element exists in the TiO 2-x and TiO 2 -A samples (Fig. S5).XPS Peaks of Ti and O elements are deconvoluted to confirm the presence of Ti 3 (O Vs ) species and hydroxyl groups.Two peaks at 463.25 (Ti 2p 1/2 ) and 458.12 eV (Ti 2p 3/2 ) can be assigned to Ti 3 states for the TiO 2-x (Fig. 3a).The content of O Vs in TiO 2- x is calculated about 11.3.The sharp peak at 529.75 eV and broad peak at 530.6 eV are attributed to lattice oxygen (Ti-O-Ti) and surfaceadsorbed oxygen species (-OH) of TiO 2-x , respectively 38.While the other peak located at 532 eV can be attributed to the O-atoms near the O Vs (Fig. 3b) 39.There is no Ti 3 states or O Vs can be detected in the TiO 2 -A sample compared with the TiO 2-x spectra.Defects of O Vs are further observed by EPR measurement (Fig. 3c).A clear signal of O Vs at g value of 2.004 40, and the signal intensity of O Vs for the TiO 2-x is much larger than that of TiO 2 -A.The EPR signal also suggested the presence of abundant O Vs in the TiO 2-x , while the O Vs are eliminated from TiO 2 -A by annealing treatment in air atmosphere.Efficient light absorption and charge separation play important roles in elevating the photocatalysts' performance 41.Fig. 3d shows UV-vis DRS for TiO 2-x and TiO 2 -A samples.The absorption peak of TiO 2 -A shows the intense light absorption in the UV region, which is caused by the charge transfer process from O 2p orbitals of valence band to Ti 3d orbitals of conduction band 42.TiO 2-x spectrum exhibits an increased trailing optical absorption due to the O Vs , leading to the generating of coloured Ti 3 centers 414243.The colour of TiO 2-x (pale yellow) and TiO 2 -A (white) samples is presented in the inset of Fig. 3d.To detect surface groups of TiO 2-x and TiO 2 -A samples, FTIR spectra are observed and the results are shown in Fig. S6.A relatively broad band at 400-900 cm -1 belongs to the Ti-O-Ti stretching vibration 44.The other broad bands centered at about 1635 and 3430 cm -1 are assigned to O-H bending and stretching vibrations, including adsorbed molecular and hydroxyl groups 45.As depicted in Fig S6, FTIR analysis shows that the peak intensity of hydroxyl groups is significantly decreased for TiO 2 -A than TiO 2-x .A 2.3 weight loss of absorbed water and hydroxyl groups on TiO 2-x surface after 400 C annealing treatment under anaerobic atmosphere is observed (Fig. S7), which further confirms the presence of hydroxyl groups on TiO 2-x .Both FTIR and TGA results reveal that large amounts of hydroxyl groups on TiO 2-x surface is eliminated by annealing, thus decreasing the formation probability of FLPs on the TiO 2 -A surface significantly.Both O Vs and -OH are existing in the hierarchical hollow TiO 2-x boxes, which are confirmed by the above characterizations.The gas adsorption performance of the samples is investigated by CO 2 -TPD and NH 3 -TPD (Fig. 3e,3f) and the relative test data are listed in Table S1 andS2.The TiO 2-x with FLPs possesses the enhanced CO 2 and NH 3 adsorption than those of TiO 2 -A samples 37. The photocatalytic CO 2 reduction was performed in a closed system under 365 nm LED irradiation.Pure H 2 O was used as the solvent without adding any sacrificial agents or cocatalysts.The possible gaseous products were detected off-line on the GC.CO is the main product and CH 4 is the minor product in the current reaction system.And the yield of CO is used to evaluate the effects of FLPs on the CO 2 reduction for TiO 2-x and the control samples.After 3 h UV LED (365 nm) irradiation, the total CO yield from the photocatalytic reduction of CO 2 on TiO 2-x shows the highest value of 195.3 mol g -1 , which is higher than those of TiO 2 -A (Fig. 4a and4b).Generally, AlCl 3 and TEA are defined as Lewis acid and Lewis base, respectively.By adding the Lewis acid or base reagent into the reaction system, the photocatalytic CO 2 reduction performance significantly decreases (Fig. 4a and4b).It is speculated that the surface FLPs of TiO 2-x are destroyed, reducing the ability for the adsorption and activation of CO 2 molecules (Fig. S8).The FLPs of TiO 2-x can also be eliminated by the annealing treatment with the decreased of O Vs and surface hydroxyl groups 33.Compared with the activity of TiO 2-x and TiO 2 -A samples (Fig. 4c and Table S3), the CO generation rate through photocatalytic CO 2 reduction on TiO 2-x with FLPs is 65.1 mol g -1 h -1 , which is about 6.2, 9.3, 19.1, and 36.6 times higher than those on TiO 2-x AlCl 3 (10.5 mol g -1 h -1 ), TiO 2-x TEA (7 mol g -1 h -1 ), TiO 2 -A (3.4 mol g -1 h -1 ), and common commercial photocatalyst TiO 2 P25 (1.8 mol g -1 h -1 , Fig. S9), respectively.Furthermore, other comparative experiments of the samples for CO generation from CO 2 reduction are also exhibited in Fig. S9.The CaTiO 3 precursor has a weak CO 2 photoreduction performance (1.5 mol g -1 h -1 ) in comparison with TiO 2 -A.Additionally, by adding Na 2 EDTA into TiO 2 -A based reaction solution, the photogenerated hole could be captured by Na 2 EDTA as the scavenger.The corresponding catalytic activity (5.7 mol g -1 h -1 ) is enhanced but still much lower than that of TiO 2-x .Thus, the possible effect of residual Na 2 EDTA reagent on TiO 2-x for the enhanced activity is excluded.In addition, the photocatalytic activity of TiO 2-x with FLPs surpasses most of the TiO 2 -based catalysts (Table S4) 464748495051, as well as most of the state-of-the-art photocatalysts in Table S5, including mpg-CN x CoPPc (20.19 mol g -1 h -1 ), one-unit-cell ZnIn 2 S 4 (33.2 mol g -1 h -1 ), Ni-SA-5/ZrO 2 (11.8 mol g -1 h -1 ), ultrathin Bi 4 Ti 3 O 12 nanosheets with O Vs (11.7 mol g -1 h -1 ) and SiC-NW/C (5.9 mol g -1 h -1 ) 52535455. No product is detected in the absence of light irradiation or photocatalysts.Notably, photocatalytic reduction of 13 C-labeled CO 2 isotope tracer experiment by TiO 2-x sample is performed under the identical reaction conditions, and the dominant product 13 CO (m/z 29) is detected by GC-MS in Fig. S10.The isotope experiment confirms that the CO product is originated from the photoreduction of CO 2 . The influence of surface hydroxyl groups and O Vs on the catalytic activity is explored.The comparison of the CO 2 reduction rates for TiO 2- x , TiO 2 -A-L, TiO 2 -A-M, and TiO 2 -A samples is shown in Fig. S11.With increasing the content of surface hydroxyl, the CO 2 reduction performance is increased.TiO 2-x sample shows the highest CO generating rate among these samples, which is ascribed to the FLPs on TiO 2-x surface.As shown in Fig. S12, the O Vs concentrations of the four samples increase in the order of TiO-A, TiO 2 -A-F, TiO 2-x , TiO 2 -H.With the increase of O Vs , the CO 2 reduction performance of TiO 2-x reached a peak.The results also indicate that neither the O Vs (defects) nor hydroxyl groups alone can form the FLPs on TiO 2-x surface.The synergy between O Vs and hydroxyl groups in the FLPs contributes to the enhanced CO 2 reduction performance. The recyclability and stability of TiO 2-x for CO 2 photoreduction are investigated (Fig. S13).After cycling for three times, the CO generation yield from the photoreduction of CO 2 still remained a high value of 153.8 mol g -1 under 3 h light irradiation.To evaluate the photostability of TiO 2-x , the recycled photocatalyst is characterized by DRS and Raman tests (Fig. S14).And no obvious change is observed in comparison with the fresh sample, revealing the high stability of TiO 2-x in the CO 2 reduction system.Notably, CO can still be generated from the photocatalytic reduction of CO 2 , even under 420 and 450 nm LED lamp irradiation (Fig. S15).The visible-light-response is in accordance with the increased trailing optical absorption phenomenon of TiO 2-x revealed in DRS spectra (Fig. 3d). In order to shed light on the charge transfer process and photocatalytic reduction of CO 2 mechanism, the optical properties and band structures of as-prepared TiO 2 samples are studied 56575859.On the basis of the UV-vis DRS of TiO 2 samples (Fig. 3d), the band gap energies (E g ) of the TiO 2-x and TiO 2 -A samples are explored via the Kubelka-Munk equation: the positions of E F are -0.4712 and -0.4121 V (about -0.47 and -0.41 V) for TiO 2-x and TiO 2 -A versus a normal hydrogen electrode (NHE) at pH 7.0, respectively. Valence-band XPS is measured and shown in Fig. 6c and6d, revealing that the distances between VB maximum (VBM) and Fermi level are 2.25, 2.61 eV for TiO 2-x and TiO 2 -A, respectively. The CB positions are calculated by equation: The E g , E F , E VB , and E CB of TiO 2-x and TiO 2 -A samples are acquired by the above characterizations. As shown in Fig. 7, the CB positions of TiO 2-x and TiO 2 -A are -1.12 and -0.98 V, respectively, which are negative than the positions of CO 2 / CO (-0.53 V) and CO 2 /CH 4 (-0.24V).It is indicated that both samples meet the thermodynamic requirements for the reduction of CO 2 to CO and CH 4 .A significant upshifting of the CB minimum (CBM) and VBM values is observed for TiO 2-x in comparison with TiO 2 -A.The photogenerated electrons of TiO 2-x are placed at a more negative potential, which is highly favorable for exhibiting a stronger reduction power in driving the reduction of CO 2 31. To investigate the separation of photogenerated carriers and electron transfer status, photocurrent and EIS measurements are characterized 606162.As shown in Fig. 8, the photocurrent response of TiO 2 -A enhances, and the electron transfer resistance decreases, owing to the improved crystallinity after the annealing treatment of the TiO 2-x samples.The EIS spectra demonstrate the charge-transfer kinetics at the interface between the electrode and electrolyte.As shown in Fig. 8b, the Furthermore, the specific surface area is observed from N 2 adsorption-desorption isotherms, and the corresponding pore size distribution is obtained from BJH methods (Fig. 9 and Table S6).The specific surface area of TiO 2-x is 115.2 m 2 g -1 , which is slightly larger than that of TiO 2 -A (88.0 m 2 g -1 ).However, TiO 2-x shows a very high activity than that of TiO 2 -A (Fig. 4c). According to the above characterization results, we speculate that the surface FLPs on TiO 2-x serve as active sites for the high efficient CO reduction (Fig. S16) 14,16,26.The CO 2 adsorption on photocatalyst surface is an essential step for CO 2 reduction.The reaction energy of CO reduction is calculated and depicted in Fig. 10a and10b, which compared the optimized models of one CO 2 molecule adsorbed on TiO 2 -A and TiO 2-x with FLPs.The adsorption energy (E ads ) of CO 2 onto TiO 2 -A is equal to -0.18 eV, which is consistent with the previous reports 63.The surface FLPs of TiO 2-x is constructed with O Vs (Lewis acid site) and its adjacent hydroxyls (Lewis base site), which has a much more negative adsorption energy of -1.352 eV for CO 2 molecules 64.Clearly shown in Fig. S17 and Table S7, the adsorption energy (E ads ) of CO 2 onto Ti-3 site (with titanium hydroxide groups as the Lewis base and coordinatively unsaturated titanium sites as Lewis acid) of TiO 2-x (-1.352 eV) is more negative than those onto Ti-1 site (proximal surface hydroxyls, -1.04 eV) and Ti-2 site (proximal unsaturated titanium sites, -1.16 eV).The higher adsorption energy suggests that CO 2 molecules are easily adsorbed onto the surface FLPs site of TiO 2-x .Oxygen atom in CO 2 combined with Lewis acid site (O Vs or Ti 3 ), while the carbon atom linked to the Lewis base centers (its adjacent hydroxyls) 26.Based on the above experimental and theoretical calculation results, a possible reaction mechanism for the photocatalytic reduction of CO 2 on the surface FLPs of TiO 2-x is proposed and depicted in Fig. 10c.The FLPs on the TiO 2-x surface plays an important role in the highly efficient CO activation by strong adsorption, which greatly enhanced CO 2 reduction performance.Additionally, CO TPD is measured (Fig. S18) to get a deep insight into the CO desorption process.TiO 2-x displays a lower onset"
  },
  {
    "title": "Conclusions",
    "content": "In summary, we demonstrate that anatase TiO 2-x hierarchical hollow boxes with FLPs could be obtained by in situ topological transformation of perovskite for efficient photocatalytic CO 2 reduction.The O Vs acted as Lewis acid sites and its proximal surface hydroxyls acted as Lewis base sites, together construct the surface FLPs of TiO 2-x , and the sample exhibited the outstanding abilities for the adsorption and activation of CO 2 .TiO 2-x hollow hierarchical boxes with FLPs show highly enhanced activity for the reduction of CO 2 to CO without employing any sacrificial agents or cocatalysts.Our finding opens a new route to construct FLPs on the single-component solid photocatalyst surface through in situ topological transformation, and also provides a novel way to create high efficient photocatalysts for the conversion of solar energy to chemical energy. Fig. 1.Schematic illustration for the synthesis of hierarchical hollow TiO 2-x boxes via in situ topological transformation of perovskite. Fig. 2. a) XRD pattern, b) SEM image, c, d) TEM images, e) HRTEM image of TiO 2-x , and f) the corresponding lattice spacing in e). Fig. 3. XPS spectra of TiO 2-x and TiO 2 -A: a) in the Ti 2p, and b) O 1 s regions.c) EPR, and d) DRS spectra and powder colour (inset) of TiO 2-x and TiO 2 -A.e) CO 2 -TPD, and f) NH 3 -TPD of TiO 2-x and TiO 2 -A samples. Fig. 4. CO generation rate of photoreduction of CO 2 using a) TiO 2-x and b) TiO 2 -A with and without adding Lewis acid/base.c) Comparison of the activity of TiO 2-x and TiO 2 -A with and without adding Lewis acid/base. where , h, , and A represent absorption coefficient, Planck constant, light frequency, and a constant, respectively.The value of n is 1/2 for direct band gap semiconductor while n is 2 for indirect band gap semiconductor.The E g values of TiO 2-x (2.90 eV) and TiO 2 -A (3.18 eV) are acquired from Fig.5.Mott-Schottky measurements are carried out to confirm the potential of Fermi level (E F ) for the samples.Fig. 6a and 6b shows the Mott-Schottky plots of TiO 2-x and TiO 2 -A samples, the slopes of the curves' linear part are positive, indicating the two samples are both n-type semiconductor.From the Fig. 6a and 6b of the Mott-Schottky plots, the flat band potentials (E FB , the E FB are -0.61 and -0.55 V for TiO 2-x and TiO 2 -A, versus Ag/AgCl at pH 6.0) of the samples can also be gained, which are equal to their values of E F for the n-type semiconductors.According to equation, E (RHE) E (Ag/AgCl) 0.0591pH 0.197 Fig. 5. Tauc plots of TiO 2-x and TiO 2 -A samples. .Jia et al. x sample has a larger radius of the arcs (Rct (TiO2-x) 22.8 , Rct means the Faraday resistance of the sample) than that of TiO 2 -A (Rct (TiO2-A) 20.6 ), indicating that a larger charge-transfer resistance and a lower electrical conductivity of TiO 2-x in comparison with TiO 2 -A. Fig. 7. Energy-band structure alignments of TiO 2-x and TiO 2 -A samples. Fig. 8. a) Photocurrent, and b) EIS tests of TiO 2-x and TiO 2 -A samples. Fig. 10.CO 2 molecule adsorption energy on a) TiO 2 -A, and b) TiO 2-x with FLPs (hydroxyl and O Vs ).The blue atoms denote titanium, the red atoms denote oxygen, the brown atoms denote carbon, and the pink atoms denote hydrogen.c) Schematic diagram of mechanism for CO 2 reduction on the model of TiO 2-x with FLPs.(For interpretation of the references to colour in this figure legend, the reader is referred to the web version of this article.) This work was financially supported by the Natural Science Foundation of Shandong Province (ZR2019JQ05, ZR2019QB008, ZR2020QE033, and ZR2018MB018), the Education Department of Shandong Province (2019KJC006), the Key Basic Research Project of the Natural Science Foundation of Shandong Province (ZR2019ZD47). The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://doi. org/10.1016/j.cej.2021.131554."
  }
]