[
  {
    "title": "Doi",
    "content": "10.1016/j.jece.2021.106042"
  },
  {
    "title": "Article_Title",
    "content": "In-situ sulfurized In2S3/MoO3@MoS2 heterojunction for visible light induced CO2 photoreduction"
  },
  {
    "title": "Abstract",
    "content": "In 2 S 3 -decorated MoO 3 MoS 2 (In/MoO 3 MoS 2 ) composites were fabricated via the in-situ sulfurization of nonthermal plasma for the visible light driven photoreduction of CO 2 to CH 4 and CO.In 2 S 3 can efficiently enhance the photocatalytic activity of In/MoO 3 MoS 2 in comparison to h-MoO 3 .The optimal 3-In/MoO 3 MoS 2 with a In content of 1.33 and the MoS 2 thickness of around 10 nm presents the superior conversion efficiency of CO 2 , of which the yield of CH 4 and CO are 29.4 and 35.6 mol g -1 h -1 , respectively.However, the long-term photo-corrosion induced to the declining yield of CH 4 and CO after three cycle times.The introduction of In 2 S 3 into MoO 3 MoS 2 as well as the nonthermal plasma induced S-rich sites and O vacancies is likely to provide the sufficient active sites for promoting CO 2 activation and the efficient junction interface for achieving the transfer and separation of charge carriers."
  },
  {
    "title": "Experimental",
    "content": "h-MoO 3 was prepared by the chemical precipitation method.7 mmol Na 2 MoO 4 2H 2 O was dissolved into 195 mL deionized water under ultrasonic treatment at room temperature for 20 min, and then 5 mL HNO 3 (99.9)was added into above solution under ultrasonic treatment at room temperature for 10 min.After that, the mixture solution was stirred at 363 K for 60 min, gradually cooled down to room temperature, centrifuged, washed with deionized water for three times, and dried at 343 K for 6 h. In/MoO 3 MoS 2 was synthesized via the in-situ sulfurization of DBD plasma, of which the coaxial DBD reactor was reported in previous works 515253.Briefly, 0.8 g obtained h-MoO 3 and 8 mg In(NO 3 ) 3 xH 2 O were dispersed into 50 mL deionized water under intensive stirring at room temperature for 90 min, centrifuged, and dried at 343 K for 6 h.After that, the obtained precursor was placed at the discharge area of DBD reactor and treated by 40 mL min -1 H 2 S/Ar gas for 40 min to obtain 1-In/MoO 3 MoS 2 .The volume ratio of H 2 S to Ar is 1:9, and the output power of DBD plasma is 100 W. According to the above process, 1-In/MoO 3 MoS 2 , 2-In/MoO 3 MoS 2 , 4-In/MoO 3 MoS 2 , and 5-In/MoO 3 MoS 2 were also prepared using 24, 40, 56, and 72 mg In (NO 3 ) 3 xH 2 O, respectively.The characteristic methods of these samples were described in the Section S1 of supported information. In/MoO 3 MoS 2 composites were performed in a Schlenk flask reactor (CEL-PAEM-D8, CEAULIGHT, China) equipped with a sampling port and two venting valves at 423 K.A commercial Xe lamp (300 W, Philips) serves as the light source, of which the detected power density of Xe lamp was 200 mW cm -2 ( 420 nm) (Fig. S1). 10 mg obtained sample was dispersed into 10 mL deionized water under the intensive stirring.Subsequently, the reactor was evacuated by a mechanical pump to remove air, and then 5 mL CO 2 was injected into the above reactor.After irradiated every 1 h intervals, 0.5 mL gas was sampled and analyzed by an on-line gas chromatograph (GC-6890N, Agilent technologies, Inc.) equipped with a thermal conductive detector and a flame ionization detector.Prior to the visible light irradiation, the controlled experiments such as without light irradiation and irradiation without photocatalyst bulks were carried out to confirm the necessity of catalyst and light illumination for CO 2 photoreduction.In addition, H 2 O-assisted pure N 2 was irradiated in reactor with the presence of catalyst bulks to verify the yield CH 4 and CO by CO 2 ."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The phases and crystallinity of h-MoO 3 , h-MoO 3 MoS 2 , and In/ MoO 3 MoS 2 composites were analyzed by XRD, as shown in Fig. 1.The peaks of h-MoO 3 are all indexed to the hexagonal phases of h-MoO 3 (JCPDS, 21-0569), of which the (110), ( 200), ( 210), (300), ( 204), ( 220), (310), ( 224), (320), (410), (404), (008), (500), (330), (420), ( 218), (334), (424), ( 430), (610), and (524) planes locate at 16.61 54,55.These peaks were also detected in the XRD patterns of h-MoO 3 MoS 2 and In/MoO 3 MoS 2 composites.For In/MoO 3 MoS 2 , the appearing peak of these samples at 23.04 can be attributed to the (110) plane of -MoO 3 (JCPDS, 76-1003), and its peak intensity increases and then decreases with an increase in In 2 S 3 content (Table S1) 50,56.It's indicated that the in-situ sulfurization of DBD Fig. 1.XRD patterns of h-MoO 3 , h-MoO 3 MoS 2 , and X-In/MoO 3 MoS 2 . F. Wang et al. plasma can facilitate the phase change from metastable h-MoO 3 to stable -MoO 3 phase, which is efficiently promoted by the adequate In 3 ions. On the one hand, the adsorbed In 3 ions on the surface of h-MoO 3 are converted into In 2 S 3 .On the other hand, the adjacent h-MoO 3 are converted into -MoO 3 and MoS 2 .With an increase in the adsorbed In 3 ions, much more In 2 S 3 and MoS 2 nanoparticles are formed on the bulks surface of MoO 3 , limiting the transformation of h-MoO 3 phase into -MoO 3 phase.Due to the small content of In 2 S 3 , the peaks of In 2 S 3 phases were not observed in these samples.The weak peaks of h-MoO 3 MoS 2 and In/MoO 3 MoS 2 samples at 32.39 and 33.12 are assigned to the (001) and (101) planes of hexagonal 2H-MoS 2 (JCPDS, , respectively 57,58. The morphologies of h-MoO 3 , MoO 3 MoS 2 , and In/MoO 3 MoS 2 were revealed by FESEM.h-MoO 3 (Fig. 2A-C) is the regularly hexagonal nanorods with a length of around 400 nm and a diameter about 100 nm.When in-situ sulfurized in DBD reactor, there are many nanoparticles existing on the surface of h-MoO 3 nanorods, meaning the formation of h-MoO 3 MoS 2 (Fig. 2D-F).As shown in Fig. S2, h-MoO 3 nanorods adsorbed with In 3 ions were treated by DBD plasma to form nanoparticles adhering to the surface of h-MoO 3 .With an increase in the adsorbed In 3 ions, the amounts of MoS 2 and In 2 S 3 nanoparticles increases, and even the hexagonal structure is destroyed in the discharge field.In contrast with 1-In/MoO 3 MoS 2 with the In content of 0.27 (Figs.S1A-C), 3-In/MoO 3 MoS 2 with the In content of 1.33 (Fig. 2G-I) has more nanoparticles on the bulks surface.TEM images (Fig. 2J andK) further confirm h-MoO 3 nanorods adsorbed with In 3 ions are sulfurized to form MoS 2 shell with a thickness about 10 nm and MoS 2 and In 2 S 3 nanoparticles.As shown in Fig. 2L, the lattice fringes of 0.38, 0.32, and 0.27 nm can be indexed to the (110) plane of MoO 3 , (311) plane of In 2 S 3 , and (100) facet of MoS 2 , respectively 25,49,59.The elemental mapping images (Fig. S2 and Fig. 2M-P) indicate that there are Mo, In, O, and S elements detected in 3-In/MoO 3 MoS 2 .It's suggested that the in-situ sulfurization route is a useful strategy to prepare MoS 2 -based composites. XPS was performed to investigate the surface compositions and elemental states of h-MoO 3 , h-MoO 3 MoS 2 , and 3-In/MoO 3 MoS 2 (Fig. 3).In contrast with h-MoO 3 (235.93eV, 232.77 eV), the binding energies of Mo 3d 3/2 and Mo 3d 5/2 in MoO 3 MoS 2 and 3-In/MoO 3 -MoS 2 shift to the lower values (Fig. 3A) 50,60.The weak peaks of MoO 3 MoS 2 and 3-In/MoO 3 MoS 2 at 229.06 and 228.97 eV are both assigned to Mo 3d 5/2 of Mo 4 61,62.The broad and strong peak of Mo 3d 1/2 of Mo 4 appears at 232.35 eV in h-MoO 3 MoS 2 .The presence of In 2 S 3 in 3-In/MoO 3 MoS 2 can further shift the binding energies of Mo 3d to the lower values in comparison to h-MoO 3 MoS 2 .The long-term irradiation slightly changes the binding energy positions of used 3-In/MoO 3 MoS 2 .The splitting peaks at 531.50, 530.72, and 530.01 eV (Fig. 3B) are ascribed to the adsorbed oxygen, oxygen vacancy or defect, and lattice oxygen, respectively 63646566.Considering the radical species such as H, H , HS -, S 2-, and Ar excited by high-energy electrons of DBD plasma, the adsorbed In 3 ions and Mo-O are intensively attacked to form In-S and Mo-S, and even S-Mo-O bonds, leading to the generation of lattice defects.Hence, the in-situ sulfurization of DBD plasma and the introduction of In 2 S 3 result in the varying values of O 1s splitting peaks.The presence of In 2 S 3 results in the oxygen vacancy (or defect) and lattice oxygen existing in 3-In/MoO 3 MoS 2 .The adsorbed oxygen was not detected in 3-In/MoO 3 MoS 2 , while detected in the used 3-In/MoO 3 MoS 2 after three cycles.The oxygen defect content in 3-In/MoO 3 MoS 2 is higher than that of h-MoO 3 -MoS 2 .The strong peaks of 3-In/MoO 3 MoS 2 at 452.52 and 444.66 eV (Fig. 3C) are respectively indexed to In 3d 3/2 and In 3d 5/2 , while these corresponding peaks of used 3-In/MoO 3 MoS 2 are respectively changed to 452.34 and 444.78 eV 67,68.The divided peaks of h-MoO 3 MoS 2 , fresh and used 3-In/MoO 3 MoS 2 at 164.24, 163.02, and 161.74 eV (Fig. 3D) are respectively assigned to S 2 2-, S 2p 1/2 , and S 2p 3/2 , meaning the formation of S-rich MoS 2 61,69.Due to the S element enriched in MoS 2 , Mo-S bonds can be converted from Mo 6 to Mo 4 .It's indicated that h-MoO 3 MoS 2 and 3-In/MoO 3 MoS 2 with S-rich and O vacancies can be successfully obtained in the nonthermal plasma field. The light-harvesting capacity of obtained samples were evaluated by UV-vis DRS, as shown in Fig. 4A.h-MoO 3 displays the effective lightcapturing capacity in the region of below 450 nm, while h-MoO 3 -MoS 2 and X-In/MoO 3 MoS 2 (X 1-5) exhibit the similar lightharvesting spectra with strong intensities of solar light region.Based on the slope of plots of (hv) 2 verse (hv) (Fig. S4), the estimated bandgap energies (E g ) of h-MoO 3 MoS 2 (2.82 eV) and In/MoO 3 MoS composites were smaller than that of h-MoO 3 (2.97 eV) (Table S1).Photocurrent is an important indicator of the transfer efficiency and separation rate of photo-induced carriers.The photocurrent results (Fig. 4B) confirm that the photocurrent intensities of these samples are maximum after the light irradiation of 20 s, while decline to the minimum when the light is turned off for 20 s.In 2 S 3 serving as the capturing and transferring substrate of charge carriers is favorable for the enhancing the separation efficiency of electron-hole pairs 59.Among In/MoO 3 MoS 2 composites, the optimal 3-In/MoO 3 MoS 2 presents the strongest photocurrent intensity, indicating the most efficient separation of charge carries 70.When irritated under solar light, the excited electrons on the bulks surface are transferred to the electrode to generate photo-induced current.Considering the low crystallinity and interaction interface of these samples induced in nonthermal plasma, the photocurrent is unstable with the increasing irradiation time.When the light is turned off, the photocurrent gradually decreases with the increasing time at intervals.Due to the smallest radius of electrochemical impedance spectrum (Figs.4C), 3-In/MoO 3 MoS 2 favors the charge transfer and the reduced carrier recombination at the junction interface between MoO 3 , MoS 2 , and In 2 S 3 .In contrast with h-MoO 3 and h-MoO 3 MoS 2 , the PL intensities of In/MoO 3 MoS 2 composites (Fig. 5) are the weaker, which further confirms the efficient separation of charge carriers 42,45.The PL intensity of In/MoO 3 MoS 2 increases and then decreases with an increasing In 2 S 3 content, and the optimal 3-In/MoO 3 MoS 2 exhibits the weakest PL intensity.It's indicated that the efficient transfer and separation of charge carriers can be achieved by 3-In/MoO 3 MoS 2 . The flat band gap energy (E fb ) of obtained sample was estimated by Mott-Schottky equation: where, C and V a are the space charge layer capacitance and applied potential, e and N d are electron charge and electron donor density, and and 0 are dielectric constant and permittivity of vacuum, respectively. The slop value (2/e 0 N d ) of this equation is an important indicator of semiconductor property.The positive slopes of Mott-Schottky curves (Fig. 4D andS5) indicate that In/MoO 3 MoS 2 as well as h-MoO 3 and h-MoO 3 MoS 2 are the n-type semiconductors.According to the extending linear to the 1/C 2 value of zero, the estimated flat band gap energies (E fB ) of h-MoO 3 , h-MoO 3 MoS 2 , and 3-In/MoO 3 MoS 2 (Table S1) are -0.58,-0.35, and -0.65 V, respectively.Due to the units of E FB changed from V versus Ag/AgCl into NHE (normal hydrogen electrode) potential, the calculated conduction band (E CB ) of h-MoO 3 , h-MoO 3 -MoS 2 , and X-In/MoO 3 MoS 2 (X 1-5) are listed in Table S1.The E CB value of 3-In/MoO 3 MoS 2 (-0.45 eV) is more negative than the reduction potential of CO 2 /CH 4 (-0.24V), and the slight positive than reduction potential of CO 2 /CO (-0.50 V) 71.In addition, the calculated valence band energies (E VB ) of h-MoO 3 , h-MoO 3 MoS 2 , and 3-In/MoO 3 MoS 2 (Table S1) are respectively 2.59, 2.67, and 2.05 eV, which are positive than the redox potential of H 2 O/O 2 (1.23 V).It's indicated that 3-In/MoO 3 MoS 2 is suitable for the H 2 O-assisted CO photoreduction. The photoreduction activities of h-MoO 3 , h-MoO 3 MoS 2 , and X-In/ MoO 3 MoS 2 (X 1-5) were performed by the visible light driven conversion of CO 2 and H 2 O in a closed gas circulation reactor at 423 K Fig. 2. SEM images of h-MoO 3 (A-C), h-MoO 3 MoS 2 (D-F), and 3-In/MoO 3 MoS 2 (G-I), TEM images (J and K), HRTEM image (L), and elemental mapping images (M-P) of 3-In/MoO 3 MoS 2 . (Fig. S1).These samples exhibit the efficient photocatalytic conversion of CO 2 into CH 4 and CO as major products, and CH 4 yield is lower than CO yield.The results are agreed with the previous works 5,50.As shown in Fig. 6A, CH 4 and CO yield over h-MoO 3 are 8.4 and 11.6 mol g -1 h -1 , respectively.For h-MoO 3 MoS 2 , CH 4 yield declines to 7.2 mol g -1 h -1 , and CO yield increases to 28.5 mol g -1 h -1 .It's ascribed to the intimating interfacial contact between h-MoO 3 and MoS 2 for the rapid transferability and segregation of charge carriers 7,50,72.In addition, the S-rich and O vacancies, small crystal size, and enough amount of naked active sites can efficiently capture reactants such as CO 2 and H 2 O for catalytic conversion 45,67.Introduction of In 2 S 3 can enhance the CH 4 yield of In/MoO 3 MoS 2 compared with h-MoO 3 and h-MoO 3 MoS 2 .CO yield of X-In/MoO 3 MoS 2 (X 1-5) is higher than that of h-MoO 3 , while CO yield of X-In/MoO 3 MoS 2 (X 1 and 5) is lower than that of h-MoO 3 MoS 2 .CH 4 yield increases and then decreases with an increase in In 2 S 3 content, of which the optimal 3-In/MoO 3 MoS 2 displays the highest yield of CH 4 (29.4 mol g -1 h -1 ).A similar result of CO yield is obtained by the increasing In 2 S 3 content of In/MoO 3 MoS 2 , and the maximum yield of CO (47.7 mol g -1 h -1 ) is achieved by 4-In/MoO 3 MoS 2 .The calculated CH 4 /CO molar ratio of 3-In/MoO 3 MoS 2 and 4-In/MoO 3 MoS 2 are 0.83 and 0.53, respectively.Compared with the reported works (Table S2), the excellent CH 4 and CO yield are well achieved by 3-In/MoO 3 MoS 2 for CO 2 photoreduction.It's further suggested that the in-situ sulfurization technology is a promising route to fabricate efficient photocatalysts. As shown in Fig. 6C andD, CH 4 and CO yield of obtained h-MoO 3 , h-MoO 3 MoS 2 and X-In/MoO 3 MoS 2 (X 1-5) increase, while their yield rates become weaker with an increase in the illumination time after 5 h.The possible reason is that the surface coverage of intermediates and the re-oxidation of products 13,48.The H atoms oxidized from H 2 O and eight-electron reduction lead to the lower CH 4 yield compared with CO in H 2 O-assisted photocatalytic system.Two-electron reduction can achieve the conversion of CO 2 into CO, and then part of CO molecules is desorbed and escaped from the bulks surface without participating in the photoreduction of CO to CH 4 9,11,12.The photocatalytic durability of 3-In/MoO 3 MoS 2 for the photo-reduction of CO 2 into CH 4 and CO was evaluated after three successive runs, as shown in Fig. 6D.Compared with the first run after irradiated for 5 h, the yields of CH 4 and CO decreases 4.44 and 3.76 in second run, and even reduce 6.84 and 7.03 in third run, respectively.Although SEM and TEM images (Fig. S6) indicate that the texture and morphology of 3-In/MoO 3 MoS 2 are not changed during the photocatalytic process, its surface composition content and valence F. Wang et al. states (Fig. 3) are difference from fresh sample.The main reason is that the long-term photo-corrosion induces to the declining light absorption 73.In addition, the small loss of 3-In/MoO 3 MoS 2 content during subsequent recovery process possibly results in the inferior yield rate of CH 4 and CO 7,11. It's well known that the CO 2 photoreduction is a complex reaction, which is affected by crystalline phase of hybrid composites and separation efficiency of charge carriers 61,71,72.The visible light harvesting of obtained In/MoO 3 MoS 2 composites is considered as the noteworthy factor for the enhanced photocatalytic activity, while their crystallinity is not the major reason of the varying photocatalytic performance 737475.Based on the experimental result and reported works 676869, the possible photocatalytic mechanism of In/MoO 3 MoS 2 composite is displayed in Fig. 7. H 2 O-assisted CO 2 photoreduction is not a transfer process of single electron, but a proton-assisted transfer of multiple electrons 4,5.When In/MoO 3 MoS 2 is irradiated in visible light region, the charges are excited, separated, and migrated to the surface bulks, especially the junction interface 72,73.Based on the results of Kubelka-Munk and Mott-Schottky equations, the E VB and E CB of 3-In/MoO 3 MoS 2 (Table S1) are 2.05 and -0.45 eV, respectively.The photo-excited h reacts with H 2 O to form hydroxyl radicals (OH) and hydrogen ions (H ), and then H reacts with e -to generate H 74,75.CO 2 also interacts with e -to generate CO 2 -, which further reacts with H to produce hydroxyl ions (OH -) and CO.The E VB potential of 3-In/MoO 3 MoS 2 is more negative than redox potential of CO 2 /CH 4 (-0.24eV), and slightly positive than that of CO 2 /CO (-0.50 eV) 4,12.However, CO is photo-reduced from CO 2 with two electrons and two hydrogen ions, and CH 4 is photo-converted from CO 2 with eight electrons and eight hydrogen ions.Especially, the E CB potential of In 2 S 3 (-0.89eV) is much more negative than that of CO 2 /CO (-0.50 eV), favoring the formation of CO 67,68.The excited h at the VB position of h-MoO 3 is transferred to the VB position of In 2 S 3 and then to that of MoS 2 .The E VB values of h-MoO 3 (2.59eV) and In 2 S 3 (1.27eV) are more positive, while that of MoS 2 (1.10 eV) is more negative than the redox potential of H 2 O/O 2 (1.23 V).This induces to the non-efficient conversion of H 2 O into H and O 2 via the reaction with h .Hence, the insufficient H ions are responsible for the less CH 4 in comparison to CO (Fig. 6A).The photocatalytic process of H 2 O-assisted CO 2 is well strengthened by the enhanced visible light absorption and the efficient transfer and separation of charge carriers."
  },
  {
    "title": "Conclusions",
    "content": "In/MoO 3 MoS 2 composites were in-situ sulfurized by DBD plasma for the enhanced photocatalytic conversion of CO 2 into CH 4 and CO in visible light region.The max yield of CH 4 (29.4 mol g -1 h -1 ) and CO (47.7 mol g -1 h -1 ) have been respectively achieved by 3-In/MoO 3 -MoS 2 and 4-In/MoO 3 MoS 2 .In contrast with h-MoO 3 , the CH 4 and CO yield of 3-In/MoO 3 MoS 2 with the In 2 S 3 content of 1.33 are about 3.50 and 3.07 times higher under the same conditions.The S-rich sites and O vacancies can provide sufficient active sites for the adsorption and photoreduction of reactants.The enhanced visible-light absorption also facilitates the photocatalytic activity of In/MoO 3 MoS 2 composites.In addition, the charge carriers are efficiently transferred and separated at the junction interface between h-MoO 3 , MoS 2 , and In 2 S 3 .The in-situ sulfurization of nonthermal plasma is thus a unique route to fabricate the metal sulfide based photocatalyst for wastewater treatment and gasphase catalysis. Fig. 3. Mo 3d (A), O 1s (B), In 3d (C), and S 2p (D) XPS spectra of h-MoO 3 , h-MoO 3 MoS 2 , 3-In/MoO 3 MoS 2 , and used 3-In/MoO 3 MoS 2 . Fig. 4. UV-Vis DRS spectra (A), photocurrent responses (B), electrochemical impedance spectra (C), and Mott-Schottky curves (D) of In/MoO 3 MoS 2 . Fig. 6.Photocatalytic activity of h-MoO 3 , h-MoO 3 MoS 2 , and In/MoO 3 MoS 2 (A), CH 4 yield (B), CO yield (C), and photocatalytic stability (D) of 3-In/ MoO 3 MoS 2 in visible light region. Visualization, Software, Writing -Original draft.Daixin Liu: Methodology, Data curation, Investigation.Jing Wen: Supervision, Conceptualization, Validation.Xiaogang Zheng: Supervision, Writingreview editing. , 19.35 , 25.69 , 29.28 , 30.84 , 33.68 , 35.24 , 41.66 , 42.77 , 45.06 , 46.26 , 48.93 , 49.47 , 51.76 , 52.60 , 55.91 , 57.56 , 58.57 , 61.33 , 66.72 , and 68.75 , respectively The authors gratefully acknowledge the financial support of this work by Sichuan Science and Technology Program (Grant No: 2018JY0451), Natural Science Foundations of Qinghai Province (Grant No: 2021-ZJ-718), Chinese Academy of Sciences and Youth Innovation Promotion Association, CAS (Grant No: 2019423), Opening Fund of Key Laboratory of Sichuan Province for Fishes Conservation and Utilization in the Upper Reaches of the Yangtze River (Grant No: NJTCCJSYSYS10), and Research Team Project of Neijiang Normal University (Grant No: 2020TD01). The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data associated with this article can be found in the online version at doi:10.1016/j.jece.2021.106042."
  }
]