[
  {
    "title": "Doi",
    "content": "10.1016/j.ceramint.2021.12.050"
  },
  {
    "title": "Article_Title",
    "content": "Efficient solar-driven CO2 reduction on aminated 2D/2D BiOBr/CdS-diethylenetriamine S-scheme heterojunction"
  },
  {
    "title": "Abstract",
    "content": "In recent years, converting solar energy into chemical energy has been shown to be a promising method to alleviate the problem of a global energy shortage.Coupling different semiconductors to construct a step-scheme (S-scheme) heterojunction photocatalyst has become one of the most effective methods.Through the amination of CdS, a 2D/2D BiOBr/CdS-diethylenetriamine (B/CS-D) S-scheme heterojunction was constructed to achieve efficient charge carrier separation and transfer.It is worth noting that the optimal B/CS-D photocatalyst, with the BiOBr mass ratio of 40, shows a CO production rate of 19.4 mol h -1 g -1 , which is 3.68 times higher than that of CdS-D.The rate of 40B/CS without D is 11.2 mol h -1 g -1 , and the catalyst becomes severely corroded, however, by constructing an S-scheme heterojunction containing D, the stability of the photocatalyst can be improved due to the existence of amine molecules which strengthen the interface contact, and the 2D structure, which increases the area of the contact, thereby speeding up the separation and transmission of carriers.This study shows the construction of an S-scheme heterostructure photocatalyst with improved separation of photoexcited holes and electrons, and a retardation of the corrosion of CdS."
  },
  {
    "title": "Experimental",
    "content": "Cadmium chloride (CdCl 2 2.5H 2 O), sublimed sulfur (S), D, bismuth nitrate pentahydrate (Bi(NO 3 ) 3 5H 2 O), acetic acid (CH 3 COOH) and potassium bromide (KBr) were provided from Sinopharm Chemical Reagent Co. Ltd. Bi(NO 3 ) 3 5H 2 O (0.487g) was added to 1.5 mL CH 3 COOH to form a homogeneous mixed solution.The mixture was added to 30 mL of milky white solution containing 0.119 g of KBr and stirred for 20 min.Finally, the obtained suspension was transferred to an autoclave and then heated at 120 C for 24 h.The precipitate was centrifuged and dried to obtain BiOBr nanosheets. BiOBr, CdCl 2 2.5H 2 O and S were added to a mixed solution of 24 mL D and 12 mL H 2 O.The mixture was then put into a microwave reactor and heated at 80 C for 0.5 h.The resulting product was centrifuged and dried.The synthesis method of CS-D is similar to the above steps without adding BiOBr. The different proportions of samples (50 mg) and H 2 O (10 mL) were placed in a two-necked flask.The two-necked flask which was subjected to ultransonification to disperse the sample evenly.The samples were dried at 60 C, then NaHCO 3 (0.12 g) was added to a small vessel and degassed in N 2 for 0.5 h.Then 2 M H 2 SO 4 (0.5 mL) was injected into the small tank to produced CO 2 and H 2 O. Finally, the container was placed on a 300 W Xe lamp ( 410 nm) to simulate visible light irradiation, and 1 mL mixed gas was extracted per hour and analyzed with GC-2014C."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The 2D/2D B/CS-D composites preparation process is shown in Fig. 1.First, BiOBr nanosheets were prepared by adding Bi(NO 3 ) 3 5H 2 O, CH 3 COOH and KBr by a solvothermal method, where CH 3 COOH can control the morphology of the sample.Subsequently, BiOBr was added to CdCl 2 2.5H 2 O, D, S and H 2 O, the protonated D organic molecules control crystal growth and make the composite sample more closely contacted.Finally, the 2D/2D B/CS-D composites were prepared. XRD was used to determine the phase and crystal structure of CS-D, The morphology and microstructure of the BiOBr, CS-D and B/CS-D samples is shown in Fig. 3. From the SEM image in Fig. 3a, it can be found that the BiOBr is a nanosheet structure with a size of about 1-2 m.This is verified by the TEM image in Fig. 3c.It is worth noting that the CS-D (Fig. 3b) is also a nanosheet structure.In Fig. 3d, the nanosheet CS-D is attached to the BiOBr nanosheet.In the HRTEM image (Fig. 3e), two different lattice fringes, the interplanar spacing of 0.317 nm, which corresponds to the (101) plane of CS-D, and the interplanar spacing is 0.333 nm, which corresponds to the (011) plane of BiOBr can be clearly seen.The clear lattice boundary of the B/CS-D composites can also be seen from Fig. 3e.It better illustrates that BiOBr and CS-D form a better interface contact instead of mechanical mixing.From the partial TEM mapping images in Fig. 3f-k S, Br, Cd, and Bi elements, and the elements are evenly distributed, which further illustrates that CS-D and BiOBr form close contact on the surface. In order to further determine the surface chemical state of CS-D, BiOBr and B/CS-D, XPS measurements were performed.Fig. 4a shows the full spectrum of the different photocatalysts, which displays peaks corresponding to Cd, S, Bi, Br, and O.All elements of BiOBr and CS-D were detected in 40B/CS-D.In Fig. 4c, the two peaks of CdS-D at 410.5 and 403.7 eV correspond to Cd 3d 3/2 and Cd 3d 5/2 , respectively 59.In 40B/CS-D, the two peaks for Cd 3d 3/2 and Cd 3d 5/2 were assigned to 410.7 and 404.0 eV.The Cd 3d peak position in 40B/CS-D had moved to a larger binding energy direction relative to the Cd 3d peak position of CS-D.The change in binding energy corresponds to the change in electron density, where a larger binding energy means a decrease in electron density, and a smaller binding energy means an increase in electron density.Therefore, electrons flow out from CS-D.According to Fig. 4d, the two peaks at 161.2 and 160.1 eV were identified as the characteristic peaks of S 2p 1/2 and S 2p 3/2 in CS-D.The peaks of S 2p 1/2 and S 2p 3/2 in 40B/CS-D were at 161.5 and 160.4 eV, respectively.The S 2p peak position in 40B/CS-D had moved to a larger binding energy direction relative to the S 2p peak position of CS-D, which also shows that the binding energy increases and electrons flowed out.On the contrary, it can be found that in the O 1s XPS of BiOBr (Fig. 4b), only a characteristic peak at 530.2 eV corresponds to lattice oxygen: the characteristic peak of O 1s was at 530.0 eV in 40B/CS-D showing that the O 1s peak position of 40B/CS-D was shifted to the direction of decreasing binding energy relative to the O 1s peak position of BiOBr.The binding energy of 40B/CS-D decreases and electrons flow into BiOBr.In Fig. 4d, the two peaks of BiOBr at 164.8 and 159.4 eV correspond to Bi 4f 5/2 and Bi 4f 7/2 , respectively.The two peaks of 40 B/CS-D were at 163.8 and 158.5 eV, assigned as Bi 4f 5/2 and Bi 4f 7/2 , respectively 60.Relative to the Bi 4f peak position of BiOBr, the Bi 4f peak position in 40B/CS-D was moved to the direction of decreasing binding energy, which further indicates that electrons flow into BiOBr.In Fig. 4f, the two peaks of BiOBr at 69.5 and 68.6 eV correspond to Br 3d 3/2 and Br 3d 5/2 , respectively 61.It can also be seen that the two peaks of 40B/CS-D at 68.9 and 67.5 eV correspond to Br 3d 3/2 and Br 3d 5/2 , respectively.Relative to the two peaks of BiOBr, the positions was moved to the position where the binding energy was reduced, indicating that electrons flowed into BiOBr.Because of the presence of amine molecules, CdS and BiOBr form a stronger chemical bond, the binding energies of Br 3d and Bi 4f shifted greatly in the 40B/CS-D 62.In summary, CS-D and BiOBr were in close contact, and electrons move from CS-D to BiOBr.Fig. S2 is the N 2 adsorption-desorption isotherm curve and BET specific surface area (S BET ) of CS-D, BiOBr and 40B/CS-D.In Fig. S2a, according to the Brunauer-Deming-Deming-Teller classification, the isotherm is a type-IV curve with a hysteresis loop of type-H3.This kind of hysteresis loop is a typical feature of flake particles.In Fig. S2b, it can be seen from that the S BET of BiOBr, CS-D and 40 B/CS-D are 10.2 m 2 /g, 109.5 m 2 /g and 69.2 m 2 /g, respectively.Due to the addition of CS-D, the S BET of 40B/CS-D is higher than that of BiOBr, which helps explain the improved photocatalytic performance seen in Fig. 7. The optical properties of BiOBr, CS-D and B/CS-D were characterized by UV-Vis DRS.As shown in Fig. 5a, it can be clearly seen that the absorption edge of BiOBr is near 435 nm.In contrast, CS-D has a large absorption range from ultraviolet to visible light, with the absorption edge near 508 nm.When the two different semiconductors were coupled, the absorption band edges of B/CS-D composites with different content of BiOBr have a red shift and the absorption strength increases.The color of the prepared sample is shown in Fig. S3: the color of CS-D is yellow, the color of BiOBr is white, and the color of the composite sample gradually changes from green to dark green as the proportion of BiOBr increases.For CS-D and BiOBr, the corresponding band gap can be estimated from the following formula 63: Herein, is the absorption index, h is Planck's constant, A is a constant.The index n is directly related to the semiconductor type, n 1 represents a direct band gap semiconductor, n 4 represents an indirect band gap semiconductor.Therefore, the values of n are 1 for CS-D and 4 for BiOBr.In Fig. 5b, the band gaps of BiOBr and CS-D are calculated to be 2.710 and 2.550 eV, respectively.The E CB and valence band position (E VB ) of CS-D and BiOBr were calculated according to the following formula: In the formula, X is electronegativity.The electronegativity of CS-D is 5.250 eV, and BiOBr is 6.170 eV.E e is constant.It can be calculated that E CB and E VB of CS-D are -0.525 and 2.025 V, respectively.For BiOBr, the E CB is 0.300 V and E VB is 3.025 V 64,65. In order to verify the existence of diethylenetriamine, FT-IR spectroscopy was used for exploration.CS-D and B/CS-D contain C-H, C-N, N-H and N-H 2 groups (Fig. 6).There are no such peaks in CdS.As can be seen in Fig. S4,40B and CS-D were composited, it can be clearly seen that the CO 2 reduction performance of the combined photocatalyst is the best (about 19.4 mol h -1 g -1 ) when the mass ratio of BiOBr is 40.This is about 3.68 times that of CS-D.At the same time, the rates of CdS and 40B/CS without D are 1.8 mol h -1 g -1 and 11.2 mol h -1 g -1 , respectively (Fig. S5): the performance of 40B/CS-D containing D is better than that of 40B/ CS.D connects CdS and BiOBr, which speeds up the transport of carriers.By coupling CS-D and BiOBr to construct a 2D/2D S-scheme heterojunction, the absorption of light is enhanced, the recombination of carriers is reduced and the speed of the transport of carriers at the interface is increased.It can be seen in Fig. 7b that the production of CO is almost undetectable in the dark condition or with no catalyst.In the absence of CO 2 , almost no CO production is detected (Fig. S6), indicating that the carbon source of CO is CO 2 . The stability of the photocatalyst is also important, so cycle experiments were used to explore the stability.In Fig. 7c, four cycles of CS-D and 40B/CS-D were carried out.It can be found that the CO 2 reduction performance of 40B/CS-D is relatively stable, and the CO yield remains above 86 after four cycles.The CO yield of CS-D was less than 50 after four cycles of experiments.From the XRD spectra before and after the test (Fig. 7d), the position of the diffraction peaks was well matched.It shows that after the cycle, the crystal structure was maintained relatively well.40B/CS and CdS were cycled for three times, the performance of 40B/CS in the second cycle is significantly reduced (Fig. S7).In addition, the performance of CdS is not good and the CdS also has a significant decline in the second cycle.The stability of the photocatalyst can be improved by constructing an S-scheme heterojunction containing D. The improvement in stability is attributed to the construction of a 2D/2D S-scheme heterojunction, which improves the shortcomings of CS-D that is easily corroded by light. In-situ FT-IR measurement can explore the intermediate species produced by 40 B/CS-D during the photoreduction process (Fig. 8).In the dark, a mixture of CO 2 and water vapor is introduced to flow through the sample chamber.After a certain period of time, CO 2 is adsorbed on the surface of the sample.The characteristic peak at 1651 and 1337 cm -1 was attributed to the bidentate carbonate group (b-CO 3 ).The characteristic peaks at 1670, 1540, and 1435 cm -1 are attributed to the ).The illumination time was extended from 0 to 120 min, not only the intensity of some peaks also becomes stronger with the extension of the illumination time, but also some new wavebands are produced.The peak at 1558, 1360 cm -1 corresponds to COO -, and the peak at 1519, 1420 cm -1 corresponds to -HCOO -.HCOOH is the intermediate product of the conversion of CO 2 to CO.In addition, the peak of CO was also detected at 1720 cm -1 and the peak intensity gradually increased with the increase of the illumination time, which indicated that a large amount of CO was produced. In order to further explore the separation efficiency of photogenerated electrons and holes in the photocatalysts, photoelectrochemical measurements were carried out on BiOBr, CS-D and B/ CS-D.Fig. 9a shows the transient photocurrent response curve of the photocatalysts: the B/CS-D prepared under the same conditions has a higher photocurrent density than CS-D and BiOBr.The result is consistent with the CO 2 reduction performance.This indicates that constructing S-scheme heterojunctions can promote the separation of photogenerated carriers.When the visible light illumination is in the onoff mode, 40B/CS-D shows the highest photocurrent intensity.Therefore, 40B/CS-D can effectively reduce the recombination efficiency of photogenerated electrons and holes.In Fig. 9b, electrochemical impedance spectra can show the ability of electron migration.The semicircle diameter of the photocurrent impedance diagram infers the charge transfer resistance.Smaller arcs reflect faster electron-hole separation.40B/CS-D shows the smallest semicircle radius, indicating that it has the least resistance to charge transfer.This is due to the formation of S-scheme heterojunction and D promotes the separation of electrons and holes.This is consistent with the photocatalytic performance. Exploring the charge transfer path after S-scheme heterojunction formed by BiOBr and CdS through density functional theory calculations.The structure of BiOBr and CdS was optimized and calculate their Fermi level (Fig. 10).The calculated work function of the CdS (002) surface is 4.61 eV (Fig. 10a)and the calculated work function of BiOBr (012) surface is 5.19 eV (Fig. 10b).It is worth noting that the Fermi level of CdS is higher than that of BiOBr.This can further illustrate that when CdS and BiOBr contact, the migration of electrons from CdS to BiOBr is due to the higher work function of CdS.Finally, the Fermi levels of CdS and BiOBr reach equilibrium.This result is consistent with the xps analysis result.And due to the movement of electrons, an interface electric field from CdS to BiOBr will be generated at the interface, which is conducive to the separation of electrons and holes. Based on the above analysis, an appropriate S-scheme mechanism of B/CS-D under visible light was proposed 666768.In Fig. 11a, BiOBr is an oxidizing semiconductor, and CS-D is a reducing semiconductor.Compared with BiOBr, CS-D has a higher CB and VB position.When CS-D and BiOBr were closely combined, electrons were transferred from the high Fermi level of CS-D to the low Fermi level of BiOBr 69.After reaching equilibrium (Fig. 11b), a built-in electric field is created at the contact interface of CS-D and BiOBr due to the charge transfer.An electron depletion layer and an electron accumulation layer were formed on the interface of CS-D and BiOBr, respectively.Due to the movement of the particles, as the energy of CS-D becomes higher, the conduction band (CB) and valence band (VB) of CS-D were bent upward, Where is representative of adsorbed state 70,71.The holes in VB of BiOBr react with H 2 O to produce a small amount of O 2 and H 2 O 2 (Fig. 11d).The photocatalytic performance of BiOBr under visible light conditions is poor, conditions is poor, and CS-D is easily corroded by light.As the S-scheme heterojunction is constructed through recombination, useful photo-generated electrons are retained to participate in the photocatalytic reaction, which improves the photocatalytic performance and the photocorrosion resistance.The S-scheme improves the oxidation and reduction ability of B/CS-D, and it can effectively separate the photogenerated electron-hole pairs, thereby improving the photocatalytic CO 2 reduction performance 72."
  },
  {
    "title": "Conclusions",
    "content": "In summary, we prepared BiOBr by the solvothermal method, and an aminated 2D/2D B/CS-34D S-scheme heterojunction was successfully constructed by a microwave solvothermal method.This structure effectively reduces the recombination of carriers and accelerates the transport of carriers, thus improving the photocatalytic performance.The photocatalytic CO 2 reduction activity was studied by simulating visible light irradiation.It is worth noting that when the mass ratio of BiOBr is 40, the best CO 2 reduction performance of 19.4 mol h -1 g -1 is observed.It has been shown that the addition of amine molecules makes CdS and BiOBr form a closer interface contact, and that the construction of a 2D/2D S-scheme heterojunction is an effective factor for enhancing light absorption and improving photocatalytic performance.This work has synthesized semiconductor materials with high activity and good stability.We hope to provide new ideas in the field of environmental photocatalysis and energy photocatalysis. Fig. 1.Schematic diagram of B/CS-D compounding process. Fig. 2. XRD pattern of CS-D, BiOBr and B/CS-D. Fig. 3. (a) SEM image of BiOBr, TEM images of (b) CS-D, (c) BiOBr and (d) 40B/CS-D, (e) HRTEM image, (f) TEM image of 40B/CS-D and corresponding element mapping: (g) O, (h) S, (i) Br, (j) Cd and (k) Bi. Fig. 4. (a) XPS full spectrum of BiOBr, CS-D and 40 B/CS-D, high-resolution XPS of (b) O 1s, (c) Cd 3d, (d) Bi 4f and S 2p and (e) Br 3d. /CS-D contains C-H, C-N, N-H and N-H 2 groups, while 40B/CS does not contain these peaks.It can directly show that CdS and B/CS-D contain D whereas 40B/CS and CdS do not contain D. The ability of catalysts to reduce CO 2 under visible light irradiation reflects the photocatalytic activity of CS-D, BiOBr and B/CS-D.In Fig. 7a, CS-D, BiOBr and B/CS-D have different CO 2 reduction performance.Compared with BiOBr (almost none), the CO 2 reduction performance of the CS-D photocatalyst was better, about 5.3 mol h -1 g -1 .When BiOBr Fig. 5. (a) UV-Vis DRS of BiOBr, CS-D and B/CS-D, (b) plots of the (h) 2 vs photon energy (h) for CS-D and plots of the (h) 1/2 vs photon energy (h) for BiOBr. Fig. 6.FT-IR spectra of CdS, CS-D and B/CS-D. Fig. 7. (a) Photocatalytic CO 2 reduction rate of CS-D, BiOBr and B/CS-D, (b) PCR performance of 40B/CS-D under various condition, (c) Cyclic experiment of CS-D and 40B/CS-D, (d) XRD patterns of 40B/CS-D before and after the photocatalytic test. Fig. 8.In situ FT-IR spectra for the absorption and activation of CO 2 on 40B/ CS-D photocatalyst. Fig. 9. (a) Transient photocurrent responses and (b) electrochemical impedance spectra for CS-D, BiOBr and B/CS-D. Fig. 10.Calculated Fermi levels of (a) CdS and (b) BiOBr. Fig. 11.Schematic diagram of the photocatalytic mechanism of the composite. ) H e -CO H 2 O (7) This work was supported by the National Natural Science Foundation of China (51572103 and 51973078), the Distinguished Young Scholar of Anhui Province (1808085J14), the Major projects of Education Department of Anhui Province (KJ2020ZD005), and the Key Foundation of Educational Commission of Anhui Province (KJ2019A0595). We declare that we have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://doi.org/10.1016/j.ceramint.2021.12.050."
  }
]