[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2017.04.009"
  },
  {
    "title": "Article_Title",
    "content": "Enhanced photocatalytic conversion of greenhouse gas CO2 into solar fuels over g-C3N4 nanotubes with decorated transparent ZIF-8 nanoclusters"
  },
  {
    "title": "Abstract",
    "content": "InlineImage1 Highlights Tubular g-C 3 N 4 nanodesign and ZIF-8 grafting are combined. Tubular g-C 3 N 4 have modified electronic structures. Tubular g-C 3 N 4 have improved charge separation efficiency. Transparent ZIF-8 nanoclusters act as CO 2 adsorption centers."
  },
  {
    "title": "Experimental",
    "content": "The holey g-C3N4 nanotubes (named as TCN) were prepared according to a published literature with some modification 38.In a typical synthesis process, 0.52 g of melamine was dissolved in 20 mL of ethylene glycol to make a saturated solution. And then 60 mL of 0.12 M nitric acid aqueous solution was added into the above solution dropwise under stirring.After stirring for 10 minutes, the generated white precipitation was collected and washed with ethanol for three times, and then dried at 55 C in a vacuum oven for 8 h.The obtained white products were annealed at 350 C for 1 h with a heating rate of 8 C min -1 , to get the final TCN.For comparison, Bulk g-C3N4 (named as BCN) was also synthesized by pyrolysis of melamine at 550 C for 2 h 39. The fabrication of g-C3N4/ZIF-8 composite was conducted by simple in-situ heterogeneous deposition method.In brief, 100 mg the as-prepared g-C3N4 nanotubes powder was dispersed into 30 mL methanol under ultrasonic irradiation for 15 min to obtain a uniform suspension.Subsequently, a certain amount of zinc acetate hexahydrate and 2-methylimidazole was added into the above suspension, successively (the mole ratio of zinc acetate hexahydrate and 2-methylimidazole was 1:4).After stirred for 1 h, the suspension was aged at room temperature for another 24 h ensuring that the ZIF-8 nanoclusters uniformly grown on the surface of g-C3N4 nanotubes.Finally, the precipitation was collected by centrifugation and washed with water for three times, and then dried at 80 C for 12 h.The obtained samples were denoted as TCNZx (x is related to the initially designed mass ratio of g-C3N4 to ZIF-8) and listed in Table 2. ZIF-8 nanocrystals were synthesized following the previously reported procedures.40 Typically, 2 mmol zinc acetate hexahydrate and 8 mmol 2methylimidazole were dissolved in 40 mL methanol successively and stirring for 3 h.The white powder product was separated from the milky colloidal dispersion by centrifugation after aging at room temperature for 24 h.And then, the product was washed with methanol for three times and dried at 80 C for 12 h.The obtained sample was named as p-Z. The prepared products were characterized by different analytical techniques.The crystallographic phase of these obtained products was determined by powder X-ray diffraction (XRD) using a D/Max-RB X-ray diffractometer (Rigaku, Japan) with Cu K irradiation at a scanning rate of 0.05 2 s -1 .Field-emission scanning electron microscopy (a JEOL JSM-7500F microscope, Japan) linked with an Oxford Instruments X-ray analysis system together with Transmission electron microscopy (a JEOL JEM-2100F microscope, Japan) were used to examine the microstructures and components of the as-prepared samples.X-ray photoelectron spectroscopy (XPS) measurements were performed on an ultrahigh vacuum VG ESCALAB 210 electron spectrometer (monochromated Al Ksource).All the binding energies were calibrated using the C 1s peak at 284.8 eV.The CHNS elemental analyzer (Vario EL cube, Elementar Analysensysteme GmbH, Germany), equipped with a balance which is accurate up to one over one million, was used to analyze the content of C and N. Thermogravimetric analysis was performed in air using a DTG-60H analyzer (Shimadzu, Japan) from room temperature to 800 o C with a heating rate of 10 o C min - 1 .Nitrogen adsorption-desorption isotherms were measured on an ASAP 2020 gas adsorption apparatus (Micromeritics Instrument, USA).All the samples were degassed at 180 o C prior to nitrogen sorption measurements.The pore size distributions were determined using the adsorption data according to the Barrett-Joyner-Halenda (BJH) method.The Brunauer-Emmett-Teller surface area (SBET) was determined by a multipoint BET method using adsorption data in the relative pressure (P/P0) range of 0.05 -0.3.The volume of nitrogen adsorbed at the relative pressure (P/P0) of 0.97 was used to determine the pore volume and the average pore size.The CO2 adsorption measurement was carried out under ambient temperature using a TriStar II 3020 carbon dioxide adsorption apparatus (Micromeritics, USA).All the samples were degassed at 150 o C for 4 h before CO2 adsorption measurement.The optical properties were analyzed by diffuse reflectance spectroscopy (DRS) on a UVvis spectrophotometer (UV-2550, SHIMADZU, Japan), with BaSO4 as the reflectance standard.Photoluminescence (PL) spectra were obtained on a Fluorescence spectrophotometer (F-7000, Hitachi, Japan) at room temperature.The Photo Multiplier Tube voltage was 700 V, the scanning speed was 1200 nm/min, and the excitation wavelength was 350 nm.The slit width used for the excitation and emission were both 1.0 nm.Fourier transform infrared (FTIR) spectra were recorded on an IR Affinity-1 FTIR spectrometer (Shimadzu, Japan).The zeta potentials of typical samples were performed on a zeta potential analyzer at room temperature (Malvern, Zetasizer Nano, ZS90).Before the measurement, 5 mg of each sample powder was dispersed in deionized water (100 mL) by ultrasonication for 15 min.The zeta potential of each sample was tested for three times by testing the suspension with the initial pH value. The evaluation of gas-phase based photocatalytic CO2 reduction activity was carried out in a 200 mL self-made Pyrex reactor at atmospheric pressure and room temperature.The reactor has two openings which were sealed using a silicone rubber septum.In a typical photocatalytic experiment, 100 mg of as-prepared photocatalyst sample was dispersed into 10 mL distilled water in the glass reactor under ultrasonic irradiation for ca.30 min.Afterward, the reactor was kept at 80 o C for 2 h for water evaporation, and finally, the sample was deposited on the bottom of the reactor as uniform thin film.Before irradiation, the reactor was blown with nitrogen for 30 min to remove air, and to ensure that the reaction system was under anaerobic conditions.CO2 and H2O vapor were generated by in situ reaction of NaHCO3 (84 mg, put into the reactor before seal) and H2SO4 aqueous solution (0.3 mL, 2 M, introduced into the reactor using a syringe).A 300 W full-spectrum Xe lamp was served as the light source and positioned 10 cm away from the photocatalytic reactor.After light irradiation for 1 hour, 1 mL of evolved gas product was extracted from the reactor, which was then detected by a gas chromatograph (GC-2014C, Shimadzu, Japan) equipped with a flame ionized detector (FID).Products were calibrated with a standard gas and determined by the retention time.The carrier gas used in the GC-2014C was high purity nitrogen. The transient photocurrent analyses and Mott-Schottky plots were obtained on an electrochemical analyzer (CHI660C electrochemical workstation, Chenhua Instrument, Shanghai, China) in a standard three-electrode configuration including a working electrode, a counter electrode and a reference electrode.The as-prepared samples serve as the working electrodes with an active area of ca.0.5 cm 2 , a platinum wire serves as the counter electrode and Ag/AgCl (saturated KCl) act as the reference electrode.A 3 W LED ( 365 nm) lamp with a focused intensity of 80.0 mWcm -2 was utilized as light source.A 0.5 M Na2SO4 aqueous solution was used as the electrolyte.Working electrodes were prepared as follows: 0.1 g of the as-obtained photocatalyst was ground together with 2.0 mL of ethanol to form slurry. Afterward, the slurry was coated onto a 2 cm 1.5 cm F-doped SnO2-coated glass (FTO glass) electrode by doctor blade method.The electrodes were then dried at 80 C in an oven. All of the used working electrodes had a similar film thickness ( 15 m).Mott-Schottky plots were recorded by using the Impedance-Potential mode.The Mott-Schottky plots were obtained in darkness at a fixed frequency of 1.0, 2.0, and 3.0 kHz. The potential ranged from -1.0 to 1.0 V (vs Ag/AgCl) with a scanning rate 50 mV/s. The in situ FTIR spectra were obtained through an in situ diffuse reflectance Fourier transform infrared spectrometer (Nicolet iS50, TMO, US).The sample was degassed for 4 h at 150 o C prior to measurement.Then the degassed sample was sealed in specimen chamber and purged with nitrogen for one hour to remove air. After that, a mixed gas of CO2 and water vapour was flowed into the specimen chamber for another hour.Subsequently, the sample was irradiated with a LED lamp (365 nm) for two hours and the infrared absorbance was recorded simultaneously."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The X-ray diffraction was performed to investigate the crystal structure of the asprepared various samples and the results were shown in Fig. 1.Two distinctive XRD peaks were observed for sample TCN and BCN, characteristic of a graphite-like structure.The strong diffraction peak of sample TCN was located at about 27.4 (d 0.326 nm), which was close to that of sample BCN.This strong diffraction peak was related to the interplanar stacking of conjugated aromatic systems, corresponding to the (002) plane of g-C3N4 41.Notably, the small diffraction peak was located at about 17.4 (d 0.49 nm) for sample TCN, which was very different from that for sample BCN, locating at about 13 (d 0.681 nm).The small diffraction peak could be related to the in-plane repeating unit.It was suggested that sample TCN was constructed by the s-triazine based building units, while the sample BCN was built by the tri-s-triazine based repeating units 31,38.The variation in basic building blocks for sample TCN versus sample BCN would result in their different band structures. The surface grafting of ZIF-8 nanoclusters on g-C3N4 nanotubes did not affect the crystal structure too much.The two characteristic XRD peaks were remained for all the TCNZx samples.The XRD pattern of the as-synthesized pure ZIF-8 nanocrystals (sample p-Z) matched well with the published patterns 41,42.Note that, the asprepared g-C3N4 nanotubes are negatively charged (Fig. S1 in the Supporting Information) and thus have good affinity to zinc ions.Therefore, ZIF-8 nanoclusters can grow on the surface of g-C3N4 nanotubes without any additional surface modification.However, the grafted ZIF-8 nanoclusters on g-C3N4 nanotubes for most TCNZx samples did not exhibited obvious characteristic XRD peaks of the ZIF-8, until the content of grafted ZIF-8 was high enough.In the present study, several clear XRD peaks assigned to ZIF-8 was detected when the initially designed mass ratio of ZIF-8 to g-C3N4 was 1 (sample TCNZ1). The morphology and microstructures of the as-prepared pure g-C3N4 nanotubes (TCN) and the typical ZIF-8 grafted g-C3N4 nanotubes (TCNZ8) were investigated using field-emission scanning electron microscopy (FESEM) and transmission electron microscopy (TEM).The results were show in Fig. 2. As can be clearly seen from Fig. 2a andb, the as-prepared pure g-C3N4 nanotubes was mainly composed of porous nanotubes with numerous holes on the surface.Overall, these g-C3N4 nanotubes were not uniform in length and diameter, having diameters of 0.5 -3 m and lengths of several tens to hundreds micrometers.Relatively, the thicknesses of the tube walls are thin and are comparable to each other, of several tens nanometers.The corresponding TEM image (Fig 2e) further confirmed the tubular morphology with penetrated holes across the tube wall.The unique texture of these g-C3N4 nanotubes shall endow them with several benefits for photocatalytic CO2 reduction reaction.It has been well documented that the thin tubular structures favor charge separations 434445.Meanwhile, the tubular morphology and the holes penetrating the tube wall shall facilitate the mass transportation of reactants and products during photocatalytic reactions.After deposition of suitable amount of ZIF-8 nanoclusters on the g-C3N4 nanotubes (sample TCNZ8), it is obvious that the overall tubular morphology was remained (Fig. 2c, d andf).Notably, most of the pores on the tube wall were filled and the surface of the modified g-C3N4 nanotubes turned to be relatively smoother (Fig. 2c andd).In addition, some protruded nanoparticles were observed on tube wall of g-C3N4 nanotubes.Both aspects suggested that the ZIF-8 was successfully grafted on the surface of the g-C3N4 nanotubes, which was further confirmed by the corresponding TEM image in Fig. 2f.The thickness of the tube wall was obviously increased after ZIF-8 deposition and, some ZIF-8 nanoclusters were protruded out. Moreover, the Energy-dispersive X-ray spectroscopy (EDS) elemental mapping of the ZIF-8 modified g-C3N4 nanotubes (Fig. 3) clearly indicated that Zn element was indeed distributed homogeneously along the nanotubes, in addition to C and N elements.Owing to a variation in mass loss of about 3.7 for TCNZ8 versus TCN, the actual loading content of surface deposited ZIF-8 on sample TCNZ8 could be calculated to be 10.3.It was understandable that the actual amount of surface deposited ZIF-8 on g-C3N4 tubes was somewhat less than the designed value. The X-ray photoelectron spectroscopy (XPS) was investigated to further analyze the variation in chemical compositions and states of typical samples, and the results were shown in Fig. 5.All the XPS survey spectra (Fig. 5a) for sample BCN, TCN, and TCNZ8 clearly reflected the XPS peaks assigned to C 1s, N 1s, and O 1s.The O 1s signal probably came from the absorbed CO2 and H2O on the surface of the samples.Notably, as expected, Zn 2p was also presented in the XPS survey spectrum for sample TCNZ8.The high-resolution XPS spectra of Zn 2p were displayed in Fig 5b, with two peaks locating at 1022.0 eV and 1044.9 eV, corresponding to Zn 2p3/2 and Zn 2p1/2, respectively 46,47.Although it was difficult to distinguish the oxidation states of Zn by only using Zn 2p spectra due to the overlap of binding energy range of Zn 0 and Zn 2 , the chemical states of Zn shall be Zn 2 , taking account of the non-reducing synthesis condition and previous study by Zn LMM Auger spectra 46.The C 1s spectra for sample BCN, TCN and TCNZ8 can be fitted into two peaks, centered at 284.8 and 288.0 eV (Figure 5c), which were ascribed to sp 2 C-C bonds and sp 2 -hybridized carbon of NC-N coordination, respectively 13,48.The peak area of the former peak becomes large because of the existence of 2-methylimidazole after surface modification.The N 1s spectra for sample BCN, TCN and TCNZ8 can be deconvoluted into three peaks (Figure 5d).The first peak belongs to sp 2 -hybridized aromatic nitrogen atoms bonded to carbon atoms (CN-C).The second peak is ascribed to the tertiary N-(C)3 groups.The third peak can be assigned to the N bonded with H atoms (N-H) 484950.The peak area ratio of N-(C)3 to CN-C is increased after nanostructuring and is further increased after the additional ZIF-8 grafting. Overall, the chemical states of carbon are similar for BCN, TCN and TCN8, but there are changes in the chemical states of nitrogen for the three samples.Quantitative analysis from XPS revealed that the C/N atomic ratio of TCN (0.57) is much smaller than that of BCN (0.69).Elemental analysis by the CHNS elemental analyzer (Table 1) also reflected that the TCN has a smaller C/N atomic ratio (0.55) than that of BCN (0.65), indicating that the TCN is nitrogen-rich graphitic carbon nitride. The Fourier transform infrared (FTIR) spectra of the as-synthesized typical samples were shown in Fig. 6.Basically, the sample BCN, TCN and TCNZ8 share the similar IR vibrational modes, suggesting that the basic structural framework was not damaged by either nanostructural design or surface modification.The broad peaks in the range of 3000 -3500 cm -1 were attributed to the stretching vibration modes of NH and NH2 groups 51,52.The peaks between 1000 and 1650 cm -1 were typical stretching modes of C-N heterocycles 53.Note that, the peak at around 1384 and 1520 cm -1 in the spectra of holey g-C3N4 nanotube were corresponded to the vibration band of nitrate moiety and the band of protonated amine, respectively 38.The adsorption peak appears at about 808 cm -1 was the characteristic breathing mode of the triazine unit 54,55.Overall, the IR results confirm that the present holey C3N4 nanotube as well as the ZIF-8 modified counterpart was graphitic phase, consistent with the XRD result.Moreover, a new band emerged at approximately 421 cm -1 for the sample TCNZ8, which was assigned to the Zn-N stretching mode 56, suggesting the existence of ZIF-8 in the composite. The N2 sorption measurements are used to investigate the pore structure and specific surface area of as-synthesized samples.As shown in Fig 7, all the adsorptiondesorption isotherms of BCN, TCN and TCNZ8 are of type IV classification 575859. At high relative pressures, the isotherms exhibited hysteresis loop associated with capillary condensation of gases within mesopores.The hysteresis loop covers relatively wide range of relative pressures, suggesting the wide mesopore size distributions, which is confirmed by the corresponding broad BJH pore-size distributions (inset in Fig 7).In particular, in the relative pressure (P/P0) range from 0.9 to 1.0, the sample BCN exhibit relatively high adsorption, consistent with the existence of a large portion of larger mesopores and macropores.It was reported that those larger mesopores and macropores was mainly associated with inter-particle aggregations 13.In comparison with sample BCN, the adsorption at the high relative pressures was much less for sample TCN and TCNZ8.Some of the larger mesopores and macropores were diminished.In contrast, the portion of smaller mesopores, associated with intra-aggregation, was increased to great extent by textural modification (sample TCN) and/or surface modifications (TCNZ8).The specific surface area, pore volume, and average pore size of all samples are summarized in Table 2. Overall, in the present study, by constructing tubular nanostructures of g-C3N4, the specific surface area can be increased, and more small-sized mesopores are generated, but the overall pore volume is somewhat less than that of the bulk g-C3N4. Moreover, combined textural modification with surface guest modification, the specific surface area can be further increased, and even more small-sized mesopores are generated. It has been well documented that the adsorption of CO2 onto the photocatalyst surface was the first essential step affecting the reaction pathway and dynamics of the photocatalytic CO2 reduction 2.The CO2 adsorption performance of samples BCN, TCN and TCNZx was investigated using CO2 adsorption isotherms (Fig 8). Essentially, all the studied samples show linear relationship between CO2 adsorption capacity and relative pressure in the relative pressure (P/P0) range of 0.1 -1.0.Such relationship suggests the dominant physical interaction between CO2 and the studied samples 60.Note that, in the low relative pressure region (P/P0 0.1), a relative fast increase in CO2 uptake occurred, indicating the initial chemical adsorption of CO2 on the whole studied samples 34.The sample TCN has higher specific surface area, and consequently, the sample TCN samples are more effective in CO2 adsorption. Moreover, with the incorporation of ZIF-8, the CO2 adsorption capacity of TCNZx samples was further improved.With increasing the introduced ZIF-8, the CO2 adsorption capacity of TCN was steadily increased.Therefore, a combined textural modification and surface guest modification is efficient in tuning the adsorption property of g-C3N4 photocatalyst. The UV-Vis diffuse reflectance spectroscopy (DRS) was measured to study the optical properties and electronic structure of the as-prepared samples.First of all, the electronic structure of g-C3N4 can be altered to great extent by nanostructural design. And consequently, two aspects of significant changes in optical properties occurred. As shown in Fig. 9a, compared with BCN, the adsorption edge of TCN is blue shifted from about 450 to 400 nm.Accordingly, the bandgap of TCN was calculated to be 3.10 eV, as compared to 2.75 eV for BCN (inset in Fig 9).This may be ascribed to quantum confinement effects 52,61.Furthermore, relative to sample BCN, a very strong absorption tail in the broad range of 450 -800 nm is clearly presented for sample TCN.The increased visible light absorption shall be beneficial for the overall apparent photocatalytic performance.The long-tail absorption in the visible light region is probably associated with abundant surface defects in sample TCN.Such a statement is in agreement with the great deviation in C/N ratio for sample TCN based on XPS results.ZIF-8 is usually transparent, having nearly no light absorption in the UV and visible light range 62, which is consistent with the present result for the as-prepared ZIF-8 crystals.As a consequence, after surface ZIF-8 deposition, very slight variation in the light absorption capacity is observed for TCNZ8 versus TCN.Therefore, it is demonstrated for the first time in the present study that, by introducing ZIF-8 as an exemplary metal organic framework, transparent porous adsorption layer can be constructed over C3N4 photocatalyst without impairing the light absorption ability. Note that, the limited reduction in visible light might be related to the reduced surface defective sites after coating surface ZIF-8 as passivation layer.Overall, all these CB values thermodynamically enable photocatalytic CO2 reduction reactions (CO2/CH3OH: -0.60 V vs. Ag/AgCl at pH 7).The more negative CB potential of TCNZ8, relative to TCN, makes it thermodynamically stronger for photocatalytic CO2 reduction reactions.However, owing to a lower flat band potential, TCN possesses a higher electrical conductivity 63, relative to TCNZ8. Therefore, there are both positive and negative influences from grafted ZIF-8 on the photocatalytic CO2 reduction performance of g-C3N4 nanotubes. Photocatalytic CO2 reduction with the assistance of water vapor over all the asprepared samples was measured under the irradiation of a 300 W Xe arc lamp without a UV-cutoff filter.Control experiments indicated that no observable hydrocarbon products including CH4, HCHO, and HCOOH were detected in the absence of either light irradiation or photocatalysts, suggesting that both light irradiation and photocatalysts are indispensible for CO2 reduction in the present study. In this study, in the presence of various as-prepared photocatalyst, CO2 was generally reduced to methanol (CH3OH) as the dominant product during the photocatalytic reduction reactions.Methanol is one of the most important chemical products.The in situ FTIR spectra were recorded on a typical sample (TCNZ8) to analyze the possible intermediates and the conversion process of photocatalytic CO2 reduction reaction in the present system.As can be seen from Fig 10a, the peaks at 1338, 1504, and 1620 cm -1 are ascribed to carbonate species.Those peaks at 1386, 1540, 1568, 1648, and 1682 cm -1 are attributed to formate species.Two peaks at 1715 and 1429 cm -1 are referred to formaldehyde.Another two peaks located at 1732 and 1472 cm -1 are derived from the vibration of methoxyl groups 646566.According to the existence of different intermediates, the possible mechanism for CH3OH production can be described using typical two-electron, two-proton reaction pathway (CO2HCOOHHCHOCH3OH) 5. As shown in Fig. 10b, it is demonstrated that the photocatalytic activity for CH3OH production over g-C3N4 photocatalyst can be greatly improved by combined textural and surface guest modification.By solely nanostructural design or ZIF-8 modification, the photocatalytic CH3OH production activity can be increased by about 90 (Fig. 10).By combined nanostructural design and ZIF-8 modification, the photocatalytic CH3OH production activity can be increased by more than three times (Fig. 10).Notably, the amount of grafted ZIF-8 nanoclusters is crucial for synergetic nanostructural design and ZIF-8 modification.As illustrated earlier, the surface ZIF-8 grafting significantly promotes the CO2 capture, which is the very important step before the final surface photocatalytic CO2 reduction reactions to produce methanol.Usually, higher CO2 adsorption capacity accompanies with higher photocatalytic CO2 reduction efficiency for a semiconductor photocatalyst.As a consequence, initially, with increasing amount of grafted ZIF-8 nanoclusters, the photocatalytic CH3OH production rate of TCNZx continues increasing.However, it seems that the grafted ZIF-8 clusters have bilateral effects on the photocatalytic CH3OH production properties.In this study, as the mass ratio of grafted ZIF-8 clusters to g-C3N4 microtubes is 1:8 (that is, sample TCNZ8), the photocatalytic CH3OH production rate is highest, reaching 0.75 mol h -1 g -1 .While CO2 adsorption can be enhanced by surface grafting ZIF-8, the surface charge transfer might be inhibited by the introduced ZIF-8 at the same time, due to the weaker electrical conductivity of ZIF-8.Such an assumption is confirmed by combined analyses of the steady-state photoluminescence (PL) spectra and transient photocurrent responses. Steady-state PL spectra of the typical as-prepared samples were shown in Fig. 11.While sample BCN showed a strong PL emission peak at about 450 nm, the emission peak of sample TCN shifted to 400 nm because of quantum confinement effects of the unique nanostructure.Meanwhile, the PL intensity of TCN was significantly lower than that of BCN, indicating a much lower recombination rate of charge carriers and a faster charge transfer within the sample TCN, relative to sample BCN.This result strongly suggested that the unique tubular nanostructure facilitated the charge separation efficiency.Unfortunately, after grafting ZIF-8 nanoclusters on the surface of TCN, the PL intensity of TCNZ8 as was slightly enhanced.In this regard, the charge separation and transfer efficiency was retarded after surface grafting ZIF-8.Such a conclusion was further confirmed by the photoelectrochemical measurements.As shown in Fig. 12, the transient photocurrent curves for all the three tested samples exhibited an anodic photocurrent spike at the very initial time of light irradiation, and then photocurrent decreases continuously until a constant photocurrent is reached.The photocurrent decay indicates that the holes accumulated at the surface of g-C3N4 photocatalysts competitively recombine with the electrons from the conduction band, instead of being trapped or captured by reduced species in the electrolyte 54.The photocurrent becomes constant after the equilibration of competitive separation and recombination of electron-hole pairs.Clearly, the stable photocurrent value for sample TCN was the highest among the three samples, suggesting its fastest charge separation efficiency, which was consistent with the aforementioned PL study.Unfortunately, the surface grafting of ZIF-8 nanoclusters somewhat retarded the charge separation, with consequence of reduced photocurrent intensity for sample TCNZ8, relative to that for pristine TCN.Even though, it was worth mentioning that the photocurrent intensity of sample TCNZ8 was still much higher than the sample BCN. In this study, it is significantly demonstrated that, a reasonable combination of the nanostructural design and surface modification of g-C3N4 photocatalyst leads to synergetic tuning of the complex interconnected photocatalytic processes, and therefore, the photocatalytic CO2 reduction ability can be largely improved.First of all, the nanostructural design of g-C3N4 photocatalyst gives rise to unique nanotubes, bringing about significant modification of the optical absorption properties, photocatalytic redox ability and charge separation efficiency.Nevertheless, upon sole nanostructural design, the CO2 capture capacity is still not satisfying.In this regard, a cooperative surface modification by ZIF-8 grafting is combined to build transparent porous adsorption antenna.As expected, the CO2 capture capacity can be greatly increased.More significantly, the side effects of adsorption layers in interfering the optical absorption and charge transfer can be minimized by controlling the loading amount of grafted ZIF-8.As a result, the apparent photocatalytic CO2 efficiency can be optimized accordingly."
  },
  {
    "title": "Conclusions",
    "content": "In summary, we have successfully synthesized TCN/ZIF-8 composite by growing ZIF-8 nanoclusters on the surface of the preformed g-C3N4 nanotubes.The designed hybrid structures not only largely inherited the broadened optical absorption properties, enhanced photocatalytic redox ability and promoted charge separation efficiency from the g-C3N4 nanotubes, but also possessed the excellent CO2 adsorption capacity because of grafting additional ZIF-8 nanoclusters.As a result, the TCN/ZIF-8 composite photocatalyst exhibited a much higher photocatalytic activity for the CO2 reduction, reaching 0.75 mol h -1 g -1 under mild reaction condition.This work will enlighten a promising strategy to construct efficient photocatalyst for greenhouse gas CO2 resourcing, by taking advantage of the cooperative effects of semiconductor nanostructures and surface metal-organic framework grafters. Meanwhile, we noticed that the conductivity of most MOF materials is not good enough, and thus the charge transfer within the photocatalytic system of MOF based composites will be more or less impaired.There is a trade off between the charge transfer and the CO2 capture in most MOF based composite photocatalysts, and therefore, the loading amount of MOF is always crucial in optimizing the apparent photocatalytic performance. ) analysis (Fig.4) was carried out in air to determine the actual loading contents of deposited ZIF-8 in the final TCNZx products.All the three tested samples demonstrated good thermal stability against phase transformation below 350 o C. A total weight loss of about 65 was recorded for pure ZIF-8 from approximately 350 o C to 620 o C, corresponding to the decomposition of the metal organic framework to produce thermal-stable ZnO, which was in agreement with the calculated weight loss of 64.The pure g-C3N4 nanotubes (sample TCN) presented a weight loss of 100 in the temperature range from 400 to 600 o C, associated with the complete sublimation and/or decomposition of g-C3N4.The TG curves of the ZIF-8 modified g-C3N4 nanotubes (sample TCNZ8) show similar trend to that of the sample TCN.But the weight loss for TCNZ8 was about 96.3 in the similar temperature range, which was less than that for sample TCN.The remaining mass was related to the residual ZnO derived from surface deposited ZIF-8 on sample TCNZ8.The chemical composition of ZIF-8 can be indexed as Zn(2-methylimidazole)2 with a molecular mass of 227.6 g/mol, and each structural unit contains one Zn (65.4 g/mol). Mott-Schottky plots of typical samples were examined to further study their electronic band structures.As shown in Fig 9b, all the three samples exhibit positive slopes in the Mott-Schottky plots at frequencies of 1, 2, and 3 kHz, which is a typical characteristic of n-type semiconductors.So, their flat band potentials are comparable to the CB potential.And the derived flat-band potential for the sample BCN, TCN, and TCNZ8 is about -1.38, -1.26 and -1.32 V versus Ag/AgCl at pH 7, respectively.In combination with the bandgap estimated from Fig. 9a, the band alignments for sample BCN, TCN and TCNZ8 are depicted in Fig. S2 (Supporting Information). Fig.1XRD patterns of the as-synthesized various samples. Fig. 2 FESEM (a -d) and TEM images (e, f) for the sample TCN (a, b and e) and sample TCNZ8 (c, d and f). Fig. 3 EDX elemental mapping of the typical sample TCNZ1. The element content of C and N for sample BCN and TCN by the CHNS Comparison of the SBET, pore volume, average pore size, CO2 adsorption and CH3OH production rate for the as-prepared samples. This study is financially supported by NSFC (51572209), the National Key Research and Development Program (2016YFC0204800), the Start-up Funds for High-Level Talents of Sun Yat-sen University (38000-31131103) and the Fundamental Research Funds for the Central Universities (No. 16lgjc64)."
  }
]