[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2021.120411"
  },
  {
    "title": "Article_Title",
    "content": "Aspect ratio dependent photocatalytic enhancement of CsPbBr3 in CO2 reduction with two-dimensional metal organic framework as a cocatalyst"
  },
  {
    "title": "Abstract",
    "content": "All-inorganic CsPbBr 3 perovskites have been regarded as promising candidates for photocatalytic CO 2 reduction, but the conversion efficiency is limited by serious charge recombination and poor surface reactivity.Herein, a two-dimensional Ni based metal-organic framework (NMF) has been employed as a cocatalyst, which not only acts as an electron extractor in enhancing the electron-hole separation, but also serves as a CO 2 capturing agent in facilitating the adsorption and activation of CO 2 molecules.As a result, 1.8, 2.5 and 4.1-fold enhancement in CO production has been realized for CsPbBr 3 nanocubes, nanorods and nanowires, respectively, which is proved to be positively correlated with the aspect ratio of CsPbBr 3 .The aspect ratio dependent photocatalytic enhancement is attributed to the increased energy difference at the interface between the conduction band of CsPbBr 3 and NMF with the elongation of CsPbBr 3 , which produces an enlarged driving force for promoted interfacial electron transfer and superior charge separation properties."
  },
  {
    "title": "Experimental",
    "content": "2D NMF was prepared by a liquid exfoliation method 40.In detail, 100 mg of as-synthesized 3D NMF (synthetic method in Supplementary data) was firstly grounded into powders.Then these powders were added in 100 mL ethanol followed by ice bath ultra-sonication for 10 h.The ultrasound probe was operated for 2 s and stopped for 4 s.The temperature of the dispersion was controlled below 25 C by an ice bath.Then the dispersion was centrifuged at 3,000 rpm for 5 min to collect the supernatant.The 2D NMF was collected by centrifugation at 8,000 rpm for 5 min and finally dried at 45 C in a vacuum. In a typical synthesis of NMF/CPB, 30 mg of 2D NMF was redispersed in 10 mL toluene through ultrasonic treatment.Then 10 mL toluene solution of CsPbBr 3 (20 mM) (synthetic method in Supplementary data) was added dropwise to the dispersion of NMF followed by sonication for 10 min.The product was collected by centrifugation and finally dried at 45 C in a vacuum for 12 h. To investigate the photocatalytic performance of the samples in CO 2 reduction, 5 mg of photocatalysts were suspended in an EA/water solution (5 mL, 49:1, v:v), and was dispersed on a flat glass plate at the bottom of a 100 mL photocatalytic reactor (Beijing Perfectlight, China).Prior to the test, the reactor loaded with the catalyst was first purged with high purity CO 2 (0.15 MPa) for 15 min in the dark.Then the lightirradiation experiment was performed by using a 300 W Xe lamp (PLS-SXE300D/300DUV, Beijing Perfectlight, China) with visible light as the illumination source, which was realized using both a 420-nm cutoff filter (long-wave-pass) and a 780-nm cutoff filter (short-wave-pass).The power density of visible light (420 780 nm) was measured to be 100 mW cm -2 using a radiometer (FZ-A, China).The photocatalytic reaction was conducted for 4 h with stirring at 600 rpm.The gaseous mixture was analyzed using a gas chromatograph (GC-2014, Shimadzu) with Ar as the carrier gas.The amount of O 2 was determined using a thermal conductivity detector (TCD).The CH 4 was measured by using a flame ionization detector (FID).The CO was converted to CH 4 by using a methanation reactor and then analyzed using the FID 41,42.During the stability test, the photocatalyst was collected after each run and then reused for the photocatalytic reaction.Isotope-labeling experiments were performed using 13 CO 2 instead of 12 CO 2 , and the products were analyzed using gas chromatography-mass spectrometry (7890B/5977A, Agilent).The wavelength-dependent CO 2 reduction performance was measured using the Xe lamp equipped with 365, 400, 450, 500, 550 and 600 nm band-pass filters, respectively."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The synthesis of the NMF/CPB photocatalysts begins with the preparation of three-dimensional (3D) NMF according to a previously reported hydrothermal method (Fig. 1a) 43.The irregular long and thick bulk morphology of as-obtained 3D NMF is revealed by the scanning electron microscopy (SEM) (Fig. S1a).The powder X-ray diffraction (XRD) pattern of the 3D NMF agrees well with the simulated result (Fig. S1b).The as-synthesized 3D NMF was further ultrasonically exfoliated into nanosheets in ethanol solution (Fig. 1a).The 2D structure of as-obtained NMF nanosheets is verified by the transmission electron microscopy (TEM) image in Fig. S2.Then CsPbBr 3 nanocrystals in different geometries were pre-synthesized and deposited on the surface of 2D NMF to fabricate the NMF/CPB photocatalysts in toluene (Fig. 1a).In detail, well-defined nanocubes, nanorods and nanowires in uniform size were prepared based on different precursors and reaction conditions, which are denoted as CsPbBr 3 -NCs, CsPbBr 3 -NRs and CsPbBr 3 -NWs, respectively (Fig. S3) 444546.For all the colloidal CsPbBr 3 , the corresponding toluene solution shows a bright green fluorescence under 365 nm UV light (inset of Fig. S3).Based on statistical analysis over more than 500 particles in the TEM images, the average widths of CsPbBr 3 -NCs, CsPbBr 3 -NRs and CsPbBr 3 -NWs are determined to be 9.1, 8.2 and 4.3 nm, respectively, while the corresponding average lengths are 9.3, 20.5 and 191.6 nm, respectively (Fig. S4).Thus, the aspect ratios of CsPbBr 3 were estimated to be 1.0, 2.5 and 44.6 for cubes, rods and wires, respectively. The successful combination of CsPbBr 3 with NMF can be confirmed by the X-ray diffraction (XRD) and UV-vis diffuse reflectance spectrometer measurements.According to the XRD patterns in Fig. 1b, the CsPbBr 3 samples are of cubic (JCPDS No. 54-0752) or orthorhombic phase (JCPDS No. 18-0361).Compared to pristine CsPbBr 3 , additional peaks in the XRD patterns of NMF/CPB samples can be attributed to the reflections of 2D NMF, confirming the formation of nanohybrids.The optical absorptions of the samples are revealed by UV-vis diffuse reflectance spectra in Fig. 1c.The NMF exhibits an absorption edge at around 360 nm, a wider shoulder tail in the 360-500 nm range and a plasmonic band in the 500-800 nm.The light absorption behaviors of CsPbBr 3 samples are comparable and the corresponding absorption edges are located at about 550 nm.In comparison with bare NMF and CsPbBr 3 , NMF/CPB samples show two obvious absorption edges belonging to NMF and CsPbBr 3 in addition to the plasmonic absorption of NMF, further evidencing the coupling of them.The similar XRD patterns and UV-vis absorption spectra of the NMF/CPB samples exclude the influence of phase structures and light absorption on the ultimate photocatalytic activity 47,48.After the assembling process, as shown by TEM images in Fig. 2, CsPbBr 3 nanocubes, nanorods and nanowires are uniformly deposited on the surface of NMF to fabricate the NMF/CPB-NCs, NMF/CPB-NRs and NMF/CPB-NWs hybrids, respectively.The lattice spacings of 4.1 A in the high-resolution TEM (HRTEM) image of NMF/CPB-NCs can be assigned to the (110) lattice plane of cubic CsPbBr 3 , indicating the exposure of six (002) facets of the nanocube considering the 45-degree angle between the lattice fringe and the surface (Fig. 2c).Meanwhile, the lattice spacing of 2.9 A in the HRTEM images of NMF/CPB-NRs and NMF/CPB-NWs corresponds to (200)/(002) facets of orthorhombic CsPbBr 3 (Fig. 2f,i).In addition, the loading amounts of CsPbBr 3 on the 2D NMF were kept the same in different NMF/CPB samples (Table S1). The composition analysis of as-obtained NMF/CPB samples begins with the energy dispersive X-ray (EDX) spectrum measurement with NMF/CPB-NWs as a representative sample, which displays the presence of Cs, Pb, Br, C, O, N and Ni elements, further supporting the successful integration of CsPbBr 3 and NMF (Fig. S5).The element distribution in the sample is further confirmed by the scanning TEM (STEM) image as well as the corresponding energy-dispersive spectroscopy (EDS) mapping profiles (Fig. 3a).X-ray photoelectron spectroscopy (XPS) was then performed to reveal the chemical states of the constituent elements (Fig. S6).The high-resolution XPS spectra of Cs3d, Pb4f and Br3d show doublet peaks of CsPbBr 3 corresponding to Cs3d 3/2 , Cs3d 5/2 , Pb4f 5/2 , Pb4f 7/2 , Br3d 3/2 and Br3d 5/2 , respectively (Fig. 3b-d).The peaks in the C1s XPS spectrum can be assigned to C--C, C-O and C--O, respectively (Fig. 3e).The O1s spectrum can be deconvoluted into peaks of O -C and O-Ni (Fig. 3f).The Ni2p XPS spectrum exhibits two main peaks corresponding to Ni2p 1/2 and Ni2p 3/2 , while the other two peaks are attributed to their shake-up satellites 49.Noticeably, with the change of the shape of CsPbBr 3 from cube to rod and then to wire, the peaks of Cs3d, Pb4f and Br3d slightly shift toward higher binding energies, while the binding energies of C1s, O1s and Ni2p become more negative, indicating more electron loss and accumulation in CsPbBr 3 and NMF, respectively 50.These results suggest the migration of free electrons from CsPbBr 3 to NMF upon the hybridization of them owing to their different work functions.And the charge re-distribution is more obvious when the aspect ratio of CsPbBr 3 is higher maybe due to larger work function difference when compared to NMF. Up acquiring the detailed sample information, the photocatalytic performances of the as-prepared samples are then evaluated under visible light irradiation (420 780 nm).As displayed in Fig. 4a, pure 3D and 2D NMF are inactive to reduce CO 2 under light illumination, confirming that NMF is not the light-harvesting component in generating photoinduced charge carriers.In contrast, CsPbBr 3 -NCs, CsPbBr 3 -NRs and CsPbBr 3 -NWs enable the CO 2 conversion with CO evolution rates of 28.4,12.1 and 19.9 mol g cat -1 h -1 , respectively.After combined with NMF, the CO production rates increase to 50.7, 30.2 and 81.0 mol g cat -1 h -1 for NMF/CPB-NCs, NMF/CPB-NRs and NMF/CPB-NWs, respectively, which are 1.8, 2.5 and 4.1 times higher than those of corresponding CsPbBr 3 , respectively.These results indicate that more enhancement in the photocatalytic activity is achieved by CsPbBr 3 in higher aspect ratio.To further examine the source of CO, the 13 C isotope labeling experiment was carried over NMF/CPB-NWs.The mass signal at m/z 29 is detected in Fig. 4b, which is strong evidence that the produced CO is originated from photocatalytic reduction of CO 2 molecules.In addition to CO as the main product, trace amounts of CH 4 were also generated by CsPbBr 3 samples without NMF (Fig. S7).For all the photocatalysts evaluated, no liquid product (e.g., HCOOH, CH 3 OH and HCHO) and side product (e.g., H 2 ) was detected. For NMF/CPB-NWs with the best photocatalytic activity, the external quantum efficiency (EQE) was measured under a 420 nm LED light and calculated to be 0.05 .The EQE and average electron consumption rate (R electron ) towards CO 2 reduction also outperform those of previous reported CsPbBr 3 -based photocatalysts (Table S2) 19,20,22,24252628,35,36.Additionally, CsPbBr 3 -NWs were also integrated with 3D NMF before exfoliation for comparison (Fig. S8a).The obtained 3D-NMF/CPB-NWs delivers an extremely lower CO-evolving rate of 30.7 mol g cat -1 h -1 in comparison with that of NMF/CPB-NWs, underlining the pivotal role of the unique 2D structure of NMF in boosting the photocatalytic activity (Fig. S8b).Moreover, the wavelength-dependent CO 2 reduction of NMF/CPB-NWs was further assessed in Fig. 4c.The trend of CO yield matches well with light absorption profile of the heterostructure, indicating that the CO 2 photoreduction is actually driven by the photon excitation of NMF/CPB-NWs 51,52. In addition to the photocatalytic activity, the contribution of NMF to the stability of CsPbBr 3 catalyst was assessed by comparing CsPbBr 3 -NWs and NMF/CPB-NWs in durability testing.As presented in Fig. 4d, after five 4-h cycles of testing, 95.5 of CO production rate is maintained, which can be ascribed to the well-maintained morphology, structure and composition of the catalyst during the photocatalytic process (Fig. S9-S11).In sharp contrast, the CO evolution activity of pristine CsPbBr 3 -NWs has deteriorated by 31.7 .Marked agglomeration and corrosion of CsPbBr 3 -NWs can be observed after the photocatalytic reactions (Fig. S12).There results imply that the reusability of CsPbBr 3 can be improved when is strongly immobilized on the surface of NMF nanosheets.It is noteworthy that increasing O 2 has also been detected as the oxidation product, confirming the balance between the reduction (CO 2 2H 2e - CO H 2 O) and oxidation (H 2 O 2h 1/2O 2 2H ) half reactions (Fig. S13). To decipher the cause of the aspect ratio dependent photocatalytic performance, the charge dynamics of the samples were studied with the combination of several photoelectrochemical, photoluminescence (PL) and electrochemical measurements.Fig. 5a displays the photocurrent responses measured under chopped visible light irradiation.It could be seen that 2D NMF produces negligible photocurrent owing to its feeble light absorption in visible region.In contrast, obvious photocurrent signals are exhibited by CsPbBr 3 nanocrystals, which follow the same order as the CO yields: CsPbBr 3 -NCs CsPbBr 3 -NWs CsPbBr 3 -NRs.Up the hybridization with NMF, the photocurrent densities of CsPbBr 3 -NCs, CsPbBr 3 -NRs and CsPbBr 3 -NWs increase by 1.2, 2.4 and 2.8 times, respectively, implying the contribution of NMF in separating photogenerated electrons and holes.PL emission spectra measured under 380 nm monochromatic light excitation were then used to gain more information of the photoexcited electron-hole pairs.As depicted in Fig. 5b, the PL intensities of CsPbBr 3 -NCs, CsPbBr 3 -NRs and CsPbBr 3 -NWs decrease enormously after the incorporation of NMF, further confirming the inhibition of radiative recombination of photogenerated charge carriers in the CsPbBr 3 nanocrystals.Time-resolved PL spectra fitted with biexponential functions were further conducted to study the specific charge carrier dynamics of the systems.As shown in Fig. 5c and Table S3, the average emission lifetimes of CsPbBr 3 -NCs, CsPbBr 3 -NRs and CsPbBr 3 -NWs are 7.93, 24.04 and 20.71 ns, respectively.This result is consistent with previous report, in which the PL lifetime of CsPbBr 3 increases first and then decreases when plotted as a function of aspect ratio with an optimum aspect ratio of 5.0 possessing the longest time 53.Upon the elongation of the cubes into rods and wires, on one hand, the lowering of symmetry leads to a splitting of the degeneracy of the energy levels and an increase in the relaxation process; on the other hand, the enhanced charge transport and mobility along the long axis reduce the possibility of exciton radiative recombination 54,55.It is also possible that the extension of the crystal increases the polarization enhancement of its internal electric field, accelerating the separation and migration of charge carriers from bulk to surface 56,57.As a result, a \"volcano\" relationship between the PL lifetime and aspect ratio is formed, which also well explains the changing trend of photocurrent densities in different CsPbBr 3 samples.After depositing the CsPbBr 3 onto the surface of NMF, the emission lifetimes of NMF/CPB-NCs, NMF/CPB-NRs and NMF/CPB-NWs decrease by 1.4, 1.9 and 2.0 times to 5.58, 12.62 and 10.48 ns, respectively, further validating the enhanced separation of photogenerated charge carriers.The different degrees of photocurrent enhancement and emission lifetime reduction indicate that the effect of NMF for restraining the recombination of photogenerated charge carriers is more significant when the aspect ratio of CsPbBr 3 is increased. To explain the enhanced charge separation efficiency, electrochemical impedance spectroscopy (EIS) was then employed, which was fitted with an appropriate equivalent circuit.As shown in Fig. 5d and Table S4, the impedance spectra of bare CsPbBr 3 nanocrystals display semicircles at the high-frequency region with electron-transfer resistances of 662.9, 1506.0 and 1043.0 cm -2 for cubes, rods and wires, respectively.When the NMF is introduced, the resistances decrease to 602.1, 805.5 and 786.4 cm -2 , respectively, implying that NMF facilitates the charge transfer between CsPbBr 3 and redox labels in the electrolyte solution.The resistance of bare NMF is only 170.8 cm -2 , confirming that the NMF can act as a conductive channel for smooth electron transfer.These results are further supported by the lifetime of photogenerated electrons, which has been measured by the open circuit photovoltage (V oc ) decay (OCVD) under visible light irradiation (Fig. 5e).It can be seen from Fig. 5f that the average electron lifetime of CsPbBr 3 is remarkably lower than that of corresponding NMF/CPB.These results further signify that the introduction of NMF attenuates the recombination of photogenerated charge carriers and prolongs the lifetimes of electrons.Similar to photocurrent and PL results, more obvious enhancement in the electron-transfer resistance and average electron lifetime can be observed by NMF/CPB with higher aspect ratio of CsPbBr 3 .These results suggest that the aspect ratio dependent charge carrier dynamics is the main reason explaining the results of NMF induced photocatalytic enhancement. To gain an in-depth insight into the aspect ratio dependent charge kinetics in the NMF/CPB samples, the electronic structures of NMF and CsPbBr 3 involved were analyzed with the assistance of Mott-Schottky plots, valence-band XPS spectroscopy and Tauc plots 58,59.According to the Mott-Schottky plots in Fig. 6a, NMF and CsPbBr 3 exhibit n-type and p-type semiconductor characteristics with positive and negative slopes for the curves of 1/C 2 vs. potential, respectively.The Fermi levels (E f ) of NMF, CsPbBr 3 -NCs, CsPbBr 3 -NRs and CsPbBr 3 -NWs were determined to be -0.07,0.40, 0.26 and 0.08 V vs. Ag/AgCl, respectively, i.e., 0.13, 0.60, 0.46 and 0.28 V vs. NHE according to the equation: E NHE E Ag/AgCl 0.197.Valence-band XPS spectra in Fig. 6b suggest that the energy gaps between E f and valence band maximum (VBM) are 3.10, 0.70, 0.63 and 0.57 eV for NMF, CsPbBr 3 -NCs, CsPbBr 3 -NRs and CsPbBr 3 -NWs, respectively.Thus, the VBM values for NMF, CsPbBr 3 -NCs, CsPbBr 3 -NRs and CsPbBr 3 -NWs are derived as 3.23, 1.30, 1.09 and 0.85 V vs. NHE.NMF and CsPbBr 3 are known as direct and indirect semiconductors, respectively, for which the optical band gaps can be obtained from the Tauc plots according to corresponding UV-vis diffuse reflectance spectrum.As shown in Fig. 6c andd, the band gaps of NMF and CsPbBr 3 are 3.91 and 2.27 eV, respectively, which are independent on the aspect ratio of CsPbBr 3 .Based on the data of VBM and band gap, the conduction band minimum (CBM) values for NMF, CsPbBr 3 -NCs, CsPbBr 3 -NRs and CsPbBr 3 -NWs are calculated to be -0.68,-0.97, -1.18 and -1.42 V vs. NHE, respectively.The upshift of the CBM and VBM with the elongation of CsPbBr 3 is in well agreement with literature report 53. According to above results, the experimental determined electronic band alignments between CsPbBr 3 and NMF in the NMF/CPB samples are displayed in Fig. 6e.It can be seen that staggered Type II heterojunctions are formed upon the contact between CsPbBr 3 and NMF. Under visible light illumination, narrow-band-gap CsPbBr 3 rather than wide-band-gap NMF is excited.The photogenerated electrons transfer from the CB of CsPbBr 3 in higher position to the CB of NMF in lower position, which subsequently migrate to the surface of NMF to drive the photoreduction of CO 2 molecules to CO. Resulted from the lower CBM of NMF compared to those of CsPbBr 3 , the reduction potential of the photoelectrons in the NMF/CPB samples is in lower position.Consequently, CH 4 cannot be generated by the NMF containing photocatalysts 18.Meanwhile, the photoinduced holes remain on the valence band (VB) of CsPbBr 3 for the oxidation of H 2 O to O 2 .When the electronic structure difference of CsPbBr 3 -NCs, CsPbBr 3 -NRs and CsPbBr 3 -NWs is taken into consideration, the gradual increase of CBM by 0.21 and 0.24 V from cubes to rods and then to wires enlarges the E between the CBM of CsPbBr 3 and that of NMF, which can be estimated to be 0.29, 0.50 and 0.74 V for NMF/CPB-NCs, NMF/CPB-NRs and NMF/CPB-NWs, respectively.The larger E causes the stronger driving force for the interfacial electron transfer from CsPbBr 3 to NMF and allows more efficient electron injection rate for more significant spatial separation of electrons and holes, well explaining the aspect ratio dependent photocatalytic performance enhancement 60,61. In addition to charge transfer and separation dynamics, the photocatalytic performance is also influenced by the surface reaction kinetics.In term of the CsPbBr 3 in different shapes, the Brunauer-Emmett-Teller (BET) surface areas of nanocubes, nanorods and nanowires were measured to be 8.49, 8.78 and 10.41 m 2 g -1 , respectively (Fig. S14).Then the intrinsic activities normalized with the surface area were calculated to be 3.35, 1.38 and 1.92 mol m -2 h -1 for CsPbBr 3 -NCs, CsPbBr 3 -NRs and CsPbBr 3 -NWs, respectively 62.Given the same crystalline phase and dominant exposed facet of nanorods and nanowires, the surface adsorption and activation behavior is not the crucial factor resulting in the different intrinsic activities of CsPbBr 3 63.As for the NMF/CPB samples, considering the exposure of the same NMF for CO 2 reduction reaction, the influence of the surface reactivity on the aspect ratio dependent photocatalytic performance can also be excluded.To further reveal the contribution of NMF to the adsorption and activation of CO 2 molecules, several experiments have been conducted with CsPbBr 3 -NWs and NMF/CPB-NWs as comparative examples.Firstly, the CO 2 adsorption behaviors of the samples were examined.As shown in Fig. 7a, NMF/CPB-NWs exhibits a CO 2 uptake of 15.3 cm 3 g -1 at 298 K under 1 atm, much higher than that of CsPbBr 3 -NWs, corroborating that the periodic pores and numerous sites of NMF can facilitate the adsorption of CO 2 molecules.As the dissociation of adsorbed CO 2 requires accepting photoelectrons from catalysts, the PL spectra measured in Ar and CO 2 atmosphere were compared in Fig. 7b.It can be seen that the PL intensity of NMF/CPB-NWs decreases remarkably when the gas is shifted from Ar to CO 2 , which can be attributed to the transfer of trapped electrons to the adsorbed CO 2 .In contrast, the quenching of the PL signal is less obvious in pristine CsPbBr 3 -NWs, confirming the role of NMF in activating CO 2 molecules.Fig. 7c exhibits the linear sweep voltammetry (LSV) under Ar-saturated and CO 2 -saturated tetrabutylammonium hexafluorophosphate (TBAPF 6 ) electrolyte, respectively.The increased current densities under CO 2 environment compared with those under Ar bubbling can be assigned to the cathodic current generated in the CO 2 reduction reaction 64,65.Comparing with CsPbBr 3 -NWs, NMF/CPB-NWs not only achieves more current density enhancement, but also has a much lower onset potential when the CO 2 is bubbled.These results further evidence that CO 2 is more easily activated by NMF/CPB owing to the presence of NMF. The excellent CO 2 adsorption and activation behaviors of NMF further explain the different orders between the charge dynamics results (NMF/CPB-NCs CsPbBr 3 -NCs NMF/CPB-NWs NMF/CPB-NRs CsPbBr 3 -NWs CsPbBr 3 -NRs) and the ultimate CO yields (NMF/CPB-NWs NMF/CPB-NCs NMF/CPB-NRs CsPbBr 3 -NCs CsPbBr 3 -NWs CsPbBr 3 -NRs) (Figs.4a and5).On one hand, in spite of the interior charge separation of NMF/CPB-NWs and NMF/CPB-NRs in comparison with CsPbBr 3 -NCs, NMF cocatalysts provide highly actives sites for CO 2 reduction, contributing to higher photocatalytic performance of NMF/ CPB-NWs and NMF/CPB-NRs.On the other hand, when NMF/CPB-NCs is taken into consideration, the larger photocurrent density and smaller PL lifetime of NMF/CPB-NCs is mainly ascribed to the superior charge separation efficiency in the supported CsPbBr 3 -NCs itself rather than the electron-hole spatial separation through the CsPbBr 3 -NMF interfaces.Namely, smaller amount of electrons travel from CsPbBr-NCs to NMF cocatalyst for CO 2 reduction owing to the smaller E between the CB of them.In sharp contrast, despite the interior charge separation in the CsPbBr 3 -NWs, more electrons migrate from CsPbBr-NWs to NMF due to the larger E between them, resulting in higher photocatalytic activity of NMF/CPB-NWs. To deeply understand the mechanism of chemical activation of CO 2 molecules on the surface of NMF cocatalyst, in situ Fourier transform infrared (FT-IR) spectroscopy was performed on the NMF/CPB-NWs.As shown in Fig. 7d, with extension of the irradiation time, the increased peaks at 1653 and 1600 cm -1 can be attributed to bidentate carbonate (b-CO 3 2-), at 1557, 1521 and 1243 cm -1 can be assigned to COO-species, at 1540, 1506 and 1456 cm -1 can be ascribed to monodentate carbonate (m-CO 3 2-), at 1473, 1430, 1417 and 1395 cm -1 can be imputed to bicarbonate (HCO 3 -) 666768.These carbonates and bicarbonates most likely derive from the interaction between CO 2 and water vapor.More importantly, COO -is the rate-limiting intermediate in the conversion of CO 2 to CO.According to the above in situ FT-IR analysis, the possible reaction pathway is CO 2 CO 2 COOH CO CO."
  },
  {
    "title": "Conclusions",
    "content": "In summary, 2D NMF as a supporting cocatalyst provides an ideal platform for raising the photocatalytic performance of CsPbBr 3 in CO 2 reduction and studying the aspect ratio dependent interfacial charge transfer dynamics.As the aspect ratio of CsPbBr 3 is increased from 1.0 to 2.5 and 44.6, the coupling with NMF causes the 1.8, 2.5 and 4.1-fold enhancement of CO evolution rate over nanocubes, nanorods and nanowires, respectively.The enhanced photocatalytic activity originates from the promoted charge separation and elevated CO 2 adsorption/ activation capacity enabled by NMF, while the elongation of CsPbBr 3 increases the E between the CB of CsPbBr 3 and NMF, contributing to the enlarged driving force for the electron transfer from CsPbBr 3 to NMF and more pronounced enhancement in the photocatalytic activity.Our work not only demonstrates 2D NMF as a versatile and effective platform supporting semiconductor photocatalysts to boost their CO 2 conversion efficiency, but also sheds lights on the rational adjustment of the aspect ratio of one-dimensional semiconductor to modulate the charge carrier dynamics in heterostructured photocatalytic systems. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Fig. 1.Synthesis of NMF/CPB samples: (a) schematic illustrating the synthetic process; (b) XRD patterns and (c) UV-vis diffuse reflectance spectra of 2D NMF, CsPbBr 3 and NMF/CPB samples. Fig. 2. Morphology characterizations of NMF/CPB samples: TEM and HRTEM images of (a-c) NMF/CPB-NCs, (d-f) NMF/CPB-NRs and (g-i) NMF/CPB-NWs. Fig. 3. Composition analysis of the NMF/CPB samples: (a) STEM image and EDS mapping profiles of NMF/CPB with NMF/CPB-NWs as a representative sample; (b-f) high-resolution spectra of NMF/CPB samples: (b) Cs3d, (c) Pb4f, (d) Br3d, (e) C1s, (f) O1s and (g) Ni2p. Fig. 4. Photocatalytic performance analysis: (a) CO production rates over different samples under visible light irradiation; (b) mass spectra showing 13 CO 2 (m/z 29) produced over NMF/CPB-NWs during the 13 C isotope labeling experiment; (c) CO production rates of NMF/CPB-NWs under light irradiation of different wavelengths; (d) cycling production of CO with CsPbBr 3 -NWs and NMF/CPB-NWs as the catalysts. Fig. 5. Charge transfer and separation dynamics analysis: (a) photocurrent vs. time curves at -0.4 V vs. Ag/AgCl under visible light irradiation; (b) steady-state PL emission spectra with an excitation wavelength of 380 nm; (c) time-resolved PL spectra decay with an excitation wavelength of 380 nm and an emission wavelength of 520 nm; (d) EIS Nyquist plots; (e) V oc transient rise/decay obtained during excitation/termination of visible light irradiation; (f) average electron lifetimes ( n ) obtained from transient OCVD measurements. Fig. 6.Energy band structure analysis of NMF/CPB samples: (a) Mott-Schottky plots, (b) valence-band XPS spectra and (c,d) Tauc plots of NMF and CsPbBr 3 ; (e) schematic illustration of the proposed band structure for NMF/CPB samples. Fig. 7. Surface reaction kinetics analysis with CsPbBr 3 -NWs and NMF/CPB-NWs as representative samples for comparison: (a) CO 2 adsorption isotherms under 298 K; (b) steady-state PL emission spectra in Ar and CO 2 atmosphere with an excitation wavelength of 380 nm; (c) linear sweep voltammetry (LSV) curves recorded in Ar and CO 2 atmosphere with a scanning rate of 10 mV s -1 ; (d) In situ FT-IR spectra of photoreduction of CO 2 with H 2 O over NMF/CPB-NWs without and with light irradiation. Conceptualization, Investigation, Data curation, Writingoriginal draft.Xingwei Zhang: Software, Formal analysis, Validation.Yue Shen: Investigation, Data curation.Wenrou Dong: Methodology, Investigation.Zhixin Fan: Investigation.Kefeng Wang: Data curation.Shuxian Zhong: Validation, Investigation, Resources.Song Bai: Conceptualization, Formal analysis, Supervision, Writing -review editing, Funding acquisition, Project administration. This work was financially supported by the National Natural Science Foundation of China (No. 21603191), Zhejiang Provincial Natural Science Foundation of China (No. LY20B030003 and LQ16B010001), Public Welfare Technology Application Research Plan Project of Zhejiang Province (Analysis Test Item, No. 2017C37024), Foundation of Science and Technology Bureau of Jinhua (No. 20204185), Self-Topic Fund of Zhejiang Normal University (2020ZS04) and Open Research Fund of Key Laboratory of the Ministry of Education for Advanced Catalysis Materials and Zhejiang Key Laboratory for Reactive Chemistry on Solid Surfaces, Zhejiang Normal University. Supplementary material related to this article can be found, in the online version, at doi:https://doi.org/10.1016/j.apcatb.2021.120411."
  }
]