[
  {
    "title": "Doi",
    "content": "10.1016/j.optmat.2015.11.015"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic transformation of CO2 to CH4 and CO on acidic surface of TiO2 anatase"
  },
  {
    "title": "Abstract",
    "content": "Recently, many studies have demonstrated that carbon dioxide can be converted to methane on TiO 2 surface by a photocatalytic process.We show that such a photo-reduction can be significantly affected by the presence of an acidic proton in powder samples of titania.Using in situ absorption gas-phase rovibrational spectroscopic detection of CH 4 , CO and CO 2 , we demonstrate that proton enhancement positively affects transformation of intermediate derivatives to methane during the photo-irradiation process via several reactions in which the electron transfer inside titania is coupled to oxygen transfer to the Ti 3 centers of TiO 2 structure.The yield of CH 4 or CO depends on the surface conditioning of titania: the formation of CH 4 is boosted by a presence of adsorbed HCl, while the formation of CO is boosted by adsorbed H 2 SO 4 ."
  },
  {
    "title": "Experimental",
    "content": "In our photochemical experiments, three UV broadband light sources (each of them 300-400 nm, k(max) 366 nm, 160 W, E27 Omnilux Lamp) in an air flow cooled photo reactor vessel have been used to irradiate powder TiO 2 in presence of 10 Torr of CO 2 .Three types of TiO 2 samples have been prepared as follows: (1) 1 g of neat crystalline TiO 2 anatase prepared in a closed allglass vacuum apparatus from titanium tetrachloride (99.98 Aldrich) vapor hydrolyzed with deionized water ice.The synthesis is described in details in our previous works 161718192021.The sample is referred to as A100, indicating annealing temperature of 100 C after the synthesis.According to our previous results, such sample contains 17 wt of adsorbed HCl. (2) 1 g of pure crystalline TiO 2 anatase A100 was additionally calcinated at the temperature of 450 C in vacuum.This sample is further referred to as A450.According to our previous results, the calcination temperature of 450 C removes all traces of HCl and water.This A450 titania sample has been subsequently treated with 1 ml of 10 H 2 SO 4 . (3) Comparative measurement has been performed with pristine A450 (free from H 2 SO 4 ). The irradiation and subsequent detection of products using FTIR spectrometry 22,19,232425 have been conducted in situ in a 20 cm long (2.5 cm diameter) glass optical cell with CaF 2 windows equipped with a 25 cm long quartz tube finger where irradiation of the TiO 2 took place (see Fig. 1).Samples were frozen at A5 C and contacted with 10 Torr of CO 2 .The quartz finger was placed into the irradiation vessel for 70 h.Spectral measurements have been performed in selected time intervals using a Bruker IFS 125 HR spectrometer (CaF 2 beam splitter, InSb detector) 26272829 in a spectral range from 2000 to 5000 cm A1 .50 spectral scans have been accumulated with a resolution of 0.02 cm A1 using the Blackmann-Harris apodization function."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Using FTIR spectra, methane and carbon monoxide have been identified as the main products in our irradiation experiments.Their formation was observed in both experiments with UV irradiation of CO 2 in presence of A100 (A100 contains adsorbed HCl) and A450 sample (free from HCl) but treated with 10 H 2 SO 4 .Fig. 2 shows the most significant spectral bands in our experiments.The upper three panels show CH 4 , CO 2 and CO bands in our experimental samples, while the lower three panels show standard pure gas spectra of CH 4 , CO 2 and CO measured on the same apparatus. Detailed spectra of methane v 3 band measured after 37 and 70 h of A100 irradiation are shown in Fig. 3.A comparative measurement was also performed with A450 in absence of any acid.In this case, methane concentration remained under detection limit.However, we detected 0.05 Torr of carbon monoxide. Time evolution of gas phase concentrations is depicted in Fig. 4. At the end of the irradiation, the concentration of CH 4 in the gas phase above A100 anatase sample is significantly larger than that of CO.On the other hand, A450 sample with H 2 SO 4 produces more CO than CH 4 (the methane band is about 4 times weaker than that of CO and is therefore difficult to distinguish it in the picture).Treatment of CO 2 in presence of A100 anatase (panel A) resulted in formation of 0.33 Torr of methane, while A450 (panel B) treated with H 2 SO 4 provided 0.26 Torr of CH 4 .In the case of A100 sample, the ratio of carbon monoxide to methane was significantly lower than in case of experiment with A450 treated with H 2 SO 4 . The mechanism of CH 4 and CO formation has been discussed in details by Zapol et al. 6 A short scheme is shown in Fig. 5. CO 2 is adsorbed on the TiO 2 surface and accepts electron excited from the valence band to conduction band by UV radiation.Reaction with acidic proton leads to the formation of formyl HC-O radicals which subsequently transform to glyoxal OCH-HCO.In the following reaction steps, glyoxal again accepts protons and electrons and reacts with a donor of hydrogen (HCO, CH 3 OH etc.) 303132 forming acetaldehyde.During these reaction steps, water is released.In the final step which involves photolysis, acetaldehyde splits to CO molecule and methane.According to our results, this radical mechanism involving only CO 2 as a parent molecule in CO and CH 4 synthesis is very likely.In our previous studies and using 18 O isotopically labeled titania, we have demonstrated that oxygen in CO molecule originates only from CO 2 and not from the TiO 2 lattice, which, in other cases, exhibits very unique oxygen mobility 17.However, the resulting ratio of the products depends also on a parent material.Irradiation of A100, which contains HCl, resulted in CO:CH 4 ratio 1:3.5.Hence, this material is very efficient in CH 4 synthesis.Moreover, in our previous study, we also showed analogous synthesis of acetylene if XeCl laser is used as a source of radiation 17.On the contrary, a photo induced synthesis involving calcinated titania A450 in presence of H 2 SO 4 led to CO:CH 4 ratio of 26:1.These results show that systems with oxygen excess (solutions of acids) are less favorable for methane synthesis than materials containing only directly adsorbed protons (from acid, an example of low temperature calcinated synthetic titania with HCl).We would like to note, that also the morphology of calcinated titania A450 differs from A100.During the calcination process all the particles sinter to larger aggregates and the BET active area also decreases 18."
  },
  {
    "title": "Conclusions",
    "content": "We demonstrated that CO 2 reduction to CH 4 is more efficient in presence of adsorbed protons.In comparison to experiments with irradiation of titania in presence of solution of acids, titania prepared by hydrolysis of TiCl 4 subsequently calcinated at low temperatures (100 C) is more advantageous material due to significantly lower production rate of carbon monoxide.Despite the fact that industrial application of this technique is still very far off, it represents a possible solution for transformation of CO 2 to CH 4 and CO containing fuel or formation of organic substances from CO 2 upon UV radiation in planetary atmospheres. Fig.1.Scheme of the optical cell equipped with a quartz finger for calcination and irradiation. Fig. 2. The main absorption bands of CO 2 (v 3 ), CH 4 (v 3 ) and CO after 70 h of irradiation.Panel A shows an experiment with A450 H 2 SO 4 , panel B A100, panel C experiment with pristine A450, panel D depicts standard spectrum of CH 4 , panel E standard spectrum of CO 2 and panel F standard spectrum of CO.All spectra have been scaled to fit the picture, so quantitative data cannot be deduced form this picture. Fig. 3. Time evolution of absorption v 3 band of methane during irradiation of anatase A100 sample. Fig. 4. Formation of main products in CO 2 treatment in presence of A100 with HCl is depicted in the panel A and in presence of A450 treated H 2 SO 4 in the panel B. Partial pressure (Torr) of CH 4 is marked in blue circles and CO is marked in black hollow squares. Fig.5.Scheme of CO 2 conversion to CO and CH 4 on the titania surface in the ''Glyoxal Cycle'' Gas Phase CO 2 molecules are adsorbed on the surface and all the products subsequently react with acidic protons, hydrogen donors and electrons coming from the conduction band.This chemistry is explained in details in Ref.6. S. Civis et al. / Optical Materials 56 (2016) 80-83 This work was financially supported by the Ministry of Education, Youth, and Sports of the Czech Republic (COST Action CM1104, grant No. LD14115) and by the Grant Agency of the Czech Republic (contracts Nos.13-07724S and 14-12010S)."
  }
]