[
  {
    "title": "Doi",
    "content": "10.1016/j.nanoen.2015.11.010"
  },
  {
    "title": "Article_Title",
    "content": "Mesostructured CeO2/g-C3N4 nanocomposites: Remarkably enhanced photocatalytic activity for CO2 reduction by mutual component activations"
  },
  {
    "title": "Abstract",
    "content": "CO 2 is highly stable and therefore extremely difficult to be reduced at room temperature.Herein, mesostructured CeO 2 /graphite carbon nitride (m-CeO 2 /g-C 3 N 4 ) was designed and synthesized through a hard-template route.The heterogeneous nanocomposites showed greatly enhanced response to solar light, promoted charge carrier separation and transfer efficiency.Consequently, their CO 2 photoreduction performance has been remarkably enhanced.Maximum CO and CH 4 yields of 0.590 and 0.694 mol, respectively, have been obtained from the CO 2 reduction after one hour irradiation at room temperature on 50 mg nanocomposite photocatalyst.Different from common g-C 3 N 4 -based composites in which the additional component only plays a role of electron sink in electron-hole separation, a synergetic effect of mutual activations between the two components is proposed, which is featured with g-C 3 N 4 activation due to significantly promoted separation of photo-generated carriers under Xenon lamp irradiation, and CeO 2 activation via the reduction of Ce 4 to Ce 3 by the trapped electrons."
  },
  {
    "title": "Experimental",
    "content": "All the chemicals are analytical grade and used as received without further purification.The nanocomposites m-CeO 2 / g-C 3 N 4 were prepared as follows: 20.0 g urea and certain amount (x wt) of Ce(NO 3 ) 3 6H 2 O were dissolved in 45.0 g water dispersion with 40 12-nm SiO 2 particles (Ludox HS-40, Aldrich), which were used as hard template.The mixture was kept at 85 1C with magnetic stirring to evaporate water and then put in an oven at 80 1C overnight.The resultant white powder was calcined at 550 1C in an alumina crucible with a cover for 2 h in static air with a ramp rate of 4 1C/min.The yellow product was finally treated with 4 M ammonium bifluoride (NH 4 HF 2 ) for 48 h to remove the silica template.The powder was then centrifuged and washed with ethanol and distilled water for several times and lyophilized overnight.The as-synthesized nanocomposites are denoted as x m-CeO 2 /g-C 3 N 4 .The mesoporous g-C 3 N 4 (m-g-C 3 N 4 ) was prepared by the same method without adding Ce(NO 3 ) 3 6H 2 O.The mesoporous CeO 2 (m-CeO 2 ) can be obtained by removing g-C 3 N 4 from the m-CeO 2 /g-C 3 N 4 nanocomposite under 550 1C for 3 h, as demonstrated by XPS analysis below. For photocatalyst characterization, X-ray diffraction patterns (XRD) were recorded by a Rigaku D/Max 2200PC X-ray diffractometer with a scanning rate of 4 1/min.The X-ray tube using Cu K radiation was operated at 40 mA and 40 kV.The measurement were made at room temperature in the 2 range of 10-801.Brunauer-Emmett-Teller (BET) specific surface area of the samples was characterized by sorption using Micromeritics Tristar 2000 instrument at 77 K. Transmission electron microscopy (TEM), selected area electron diffraction (SAED) patterns, and high-resolution transmission electron microscopy (HRTEM) images of the catalyst samples were obtained by JEM-2100F field emission transmission electron microscope (FE-TEM) operated at 200 kV and equipped with an energy-dispersive X-ray (EDX) instrument.Field emission scanning electron micrograph (FE-SEM) was acquired on a Hitachi S-4800.Ultraviolet visible (UV-vis) diffuse reflection spectra were recorded in the range of 200-800 nm on a UV-3101 PC Shimadzu spectroscope using BaSO 4 as a reflectance standard material.A Hitachi F-4500 was used to analyze the catalysts' photoluminescence (PL) characteristics with an excitation wavelength of 325 nm at room temperature.X-ray photoelectron spectroscopy (XPS) was carried out on a Thermo Scientific ESCALAB 250 spectrometer with an Al K radiation line source and multichannel detector.All the binding energy values for the high-resolution spectra were calibrated with the signal of contaminated carbon C 1 s at 285 eV. Electrochemical measurements were carried out on a CHI 660A electrochemical workstation (Shanghai Chenhua Instrument, Inc.) with a standard three-electrode cell.Fluorine-doped Tin Oxide (FTO) deposited with photocatalysts served as a working electrode, while the counter and the reference electrodes were a platinum plate and Ag/AgCl respectively, with 0.2 M Na 2 SO 4 as electrolyte solution.The working electrodes were prepared by electrophoretic deposition in an acetone solution (25 mL) containing the sample powder (12 mg) and iodine (3 mg).Two parallel FTO glasses were kept in the above solution for 5 min with a 10 V bias under potentiostat control.All the samples are deposited as a thin film onto Fluorine-doped Tin Oxide (FTO), and the coated area was fixed at 1 cm 2 .After being calcined for 2 h in an oven at 150 1C, a homogeneous film can be obtained.50 mL of 0.2 M Na 2 SO 4 was used as electrolyte solution, which represented the best compromise between activity and stability of the nanocomposites.The transient photocurrent densities of the as-prepared electrodes were tested at 0.3 V versus Ag/AgCl under irradiation.The bias voltage for obtaining Nyquist plots of these electrodes was set at A 0.4 V versus Ag/AgCl in dark. CO 2 photocatalytic reduction was typically conducted in a gas-closed circulation system by using a reactor (volume: 500 mL) purchased from PerfectLight Company (China, Beijing).The reactor is made of borosilicate glass, which was purchased from Perfect Light Company (China, Beijing), with an optical quartz window at the top.To remove possible trace organic contaminants, all the samples were treated at 200 1C for 3 h in air.In a typical process, 50 mg photocatalyst was uniformly dispersed on a flat glass plate with the area fixed at 1.5 cm A 1.5 cm.In order to ensure that air was eliminated, high purity CO 2 (99.99) gas, monitoreded by a mass flow controller, was led to pass through a water bubbler to generate a mixture of CO 2 and water vapor.A 300 W of Xenon-arc lamp (Aulight CEL-HX, Beijing) was used as the light source.The temperature of the reactor was controlled at 25 1C by cooling water circulation.During the irradiation, 1 mL gas was sampled from the glass chamber at a given time intervals (1 h) for detecting CH 4 and/or other carbon-based gases.CO can also be detected by installing a methanizer, using N 2 as carrier gas.The sample was analyzed by a gas chromatograph (GC-2060, Fuli Corp., China) with a flame ionization detector (FID) equipped with a 5A molecular column and a TDX-01 packed column.During the stability test, the photocatalyst was collected after each run and then reused for photoreduction of CO 2 .The catalyst was heattreated at 150 1C for two hours after the second and third runs before its reusing."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The morphology of m-g-C 3 N 4 and the 3 m-CeO 2 /g-C 3 N 4 nanocomposite was investigated by FE-SEM and TEM as demonstrated in Fig. 1.In Fig. 1a andb, it can be apparently seen that a great number of spherical mesopores of about 10 nm in diameter have been formed in the m-g-C 3 N 4 and the nanocomposites, which is in line with the results of BJH pore size distribution as shown below.The pore structure reflects the geometric properties of the original template of SiO 2 particles.The element mappings (seen in Fig. S1) of the nanocomposite imply the uniform distribution of CeO 2 and g-C 3 N 4 .The SAED pattern recorded on the 3 m-CeO 2 /g-C 3 N 4 sample demonstrates the clear and highly regular diffraction spots and diffraction rings, indicating that m-CeO 2 in the nanocomposite is polycrystalline (Fig. 1e).The high-resolution TEM (HRTEM) image of 3 m-CeO 2 /g-C 3 N 4 (Fig. 1f) reveals lattice spacing values of 0.28 and 0.31 nm indexed to the exposed (2 0 0) and (1 1 1) facets of CeO 2 , respectively 29.The exposed (1 1 1) plane could be very important for the photocatalytic activity, since a high-activity lattice plane with high crystallinity is very sensitive to light-induced reactions 30.In Fig. 1f, it can be seen that the CeO 2 and g-C 3 N 4 closely bond together, forming a heterojunction structure and would not be separated even after a long time ultrasonication treatment at room temperature, which is very important for interface electron transfer between heterogeneous semiconductors. The formation of m-CeO 2 /g-C 3 N 4 nanocomposites with varied component ratios was firstly proved by XRD analysis (shown in Fig. 2a).In pure g-C 3 N 4 , two significant peaks at 27.41 and 13.11 can be found, which can be indexed as the (002) and (100) reflections, respectively, corresponding to the interlayer stacking and in-plane structure packing motif of aromatic segments 20.Sample m-CeO 2 has a fluorite cubic phase and the XRD peaks are in good agreement with the Powder Diffraction Standards data (JCPDS Card no.043-1002).No peaks corresponding to other N-containing or Cecontaining phases can be detected in the XRD patterns.In m-CeO 2 /g-C 3 N 4 nanocomposites, the reflections of g-C 3 N 4 are clear but no peaks of m-CeO 2 can be identified, which might be attributed to the low content and high dispersion of m-CeO 2 . In order to investigate the textural and structural properties of these samples, nitrogen adsorption-desorption measurement was performed at 77 K. Their isotherms and Barrett-Joyner-Halenda (BJH) pore size distributions are shown in Fig. 2b andc.All isotherms show an profound uptake of N 2 as a result of capillary condensation mostly in a relative pressure (P/P 0 ) range of 0.70-0.95,which indicates the existence of defined mesoporosity of relatively large pore size 23.The pore size distributions obtained from desorption branches of their isotherms are shown in Fig. 2c.It can be seen that the pore sizes of all samples center at about 10 nm, which should be generated from the dissolution of silica nanoparticles templates.Their BET surface areas and BJH pore sizes are summarized in Table 1.The surface area of m-CeO 2 is only 63.9 m 2 g A 1 , while the specific surface area of the m-CeO 2 /g-C 3 N 4 nanocomposites slightly increases with the increasing content of m-CeO 2 and reaches the maximum value of 179.1 m 2 g A 1 for 3 m-CeO 2 /g-C 3 N 4 . To investigate the optical absorption properties, UV-vis diffuse reflectance spectra (DRS) of the m-CeO 2 , m-g-C 3 N 4 , and m-CeO 2 /g-C 3 N 4 samples in the range of 200-800 nm were examined and the results are shown in Fig. 3.All the samples absorb UV to visible light (Fig. 3a), which signifies their Xenon-light-induced photocatalytic activity.It is apparent that the absorption edges of all the samples have red-shifted and significant absorption can be found between 300 nm and 700 nm.Among these hetero-structured nanocomposites, it is interesting that the sample 3 m-CeO 2 /g-C 3 N 4 shows the strongest absorption under irradiation as shown in Fig. 3b.It was previously reported that the nitrogen doping could lead to a mixing of N 2p orbital with O 2p orbital to form intermediate energy levels and an absorption edge shift toward visible light region 31.The band gap energy of a semiconductor can be calculated using the formula (ahv) n k (hvAE g ), where a is the absorption coefficient, k is a parameter that relates to the effective masses associated with the valence and conduction bands, n is 1/2 for a direct transition, hv is the absorption energy, and E g is the band gap energy 32.Plotting (ahv) 1/2 versus hv based on the spectral response in Fig. 3c gives the extrapolated intercept corresponding to the E g value.The optical band gap energies of the samples listed in Table 1 indicate the enhanced ability in absorbing solar light, making them promising candidates for solar-driven applications. PL analysis was also performed to investigate the interfacial charge transfer and the separation of photogenerated electrons and holes in the photocatalysts.As shown in Fig. 3d, all the photocatalysts show a broad PL peak centered at around 480 nm with a tail extending to 600 nm, which could be attributed to the band-band PL phenomenon due to the down-transfer of the photo-induced charge carriers of m-g-C 3 N 4 33.It is obvious that the PL emission intensities reach the highest value for pure m-g-C 3 N 4 and decrease remarkably with the addition of m-CeO 2 , indicating that the recombination of photo-induced charge carriers in m-g-C 3 N 4 has been effectively inhibited after hetero-juncture formation with m-CeO 2 .It is obvious that the sample 3 m-CeO 2 /g-C 3 N 4 shows the lowest emission intensity, i.e., the lowest recombination rate, which is in consistence with its highest photocatalytic activity as described below.The presence of CeO 2 should result in the promoted transfer of photo-generated electrons between the two components. The excitation and transfer of photogenerated charge carriers in the samples were further investigated by photoelectrochemical measurements.Fig. 4a shows the photocurrent responses of m-CeO 2 , 3 m-CeO 2 /g-C 3 N 4 , and m-g-C 3 N 4 during seven on-off cycles.The transient photocurrent results provide more clear evidence on electron transfer within this semiconductor-semiconductor system.A fast and uniform photocurrent response can be observed upon the light-on and light-off in the three samples, which indicates the extremely fast charge transport in these as-prepared samples.The pristine m-g-C 3 N 4 presents a quickly increasing current once the light is on and a sharply declining signal when the light is off.This kind of transient delay stems from the electron trapping and releasing mediated by surface defects 34.It is clear that the photocurrent intensity of hetero-structured nanocomposites (0.75 A cm A 2 ) is more than four times that of pure m-g-C 3 N 4 (0.18 A cm A 2 ) under visible light irradiation, indicating the much more effective charge separation and higher photocatalytic activity of the nanocomposite than the two single-component counterparts.To verity this assumption, the charge transfer in dark was studied by EIS.The semicircular Nynquist plots for m-g-C 3 N 4 , m-CeO 2 , and 3 m-CeO 2 /g-C 3 N 4 samples were obtained.As shown in Fig. 4b, compared with m-g-C 3 N 4 and m-CeO 2 , the semicircle diameter of 3 m-CeO 2 /g-C 3 N 4 becomes much smaller than the two individuals, reflecting the accelerated electron transfer in this heterostructured nanocomposite 35. Surface chemical compositions of the synthesized materials were further studied by XPS as shown in Fig. 5.A weak signal of N located at about 400 eV can be found in m-CeO 2 , confirming the nitrogen incorporation into CeO 2 26b, which was obtained by removing g-C 3 N 4 from the synthesized m-CeO 2 /g-C 3 N 4 nanocomposites, and believed to be favorable for catalytic activity enhancement.Three peaks with binding energy values of 285 eV, 399 eV and 530 eV can be observed and ascribed to the signals of C 1s, N 1s and O 1s, respectively, as shown in Fig. 5a, which indicates that C and N are the main elements in both m-g-C 3 N 4 and 3 m-CeO 2 /g-C 3 N 4 .Fig. 5b demonstrates that C 1s spectra could be fitted with three peaks at 285 eV, 288.4 eV, and 293.7 eV, corresponding to C-C coordination of the surface adventitious carbon, the sp 2 -hybridized carbon in N C-N coordination 16a,36, and -excitation, respectively.The N 1s spectra in Fig. 5c can be deconvoluted into four peaks.The peaks centered at 399 and 401 eV are attributed to the sp 2 -hybridized nitrogen atoms in C N-C groups and the amino function groups, respectively 37.The peak at around 404.6 eV derives from charging effects or positive charge localization in heterocycles 38, while that at 399.9 eV is attributed to the tertiary nitrogen N-C 3 groups or H-N-C 2 39.Fig. 5d shows the XPS spectra of Ce 3d of m-CeO 2 and 3 m-CeO 2 /g-C 3 N 4 .Ce 3d core level spectra of m-CeO 2 sample can be deconvoluted into eight contributions, in which two types of cerium Ce(III) and Ce(IV) are present.The appearance of u and v signals (around 961.5 and 898.4 eV), together with u and v peaks (900.3 and 881.7 eV) which are weaker than the u and v peaks (911.1 and 891.9 eV), confirms the presence of Ce(IV).The high intensity and area of u, the fingerprint of Ce(IV), suggests that Ce(IV) is the dominant state.Peaks labeled with u 0 , v 0 , u1 and v1 belong to Ce(III), which can be attributed to the interaction between Ce and its surrounding atoms.Ce(III) can be regarded as an indicator for photoreduction reaction 29.The Ce 3d core level of 3 m-CeO 2 /g-C 3 N 4 is also displayed in Fig. 5d.The weak and diffused Ce 3d peaks at about 903.5 and 884.9 eV also confirm the existence of Ce though its content is very low. The photocatalytic activities of the photocatalysts were measured in a gas-closed quartz circulation system operated under ambient pressure with high purity CO 2 and gaseous H 2 O reactants sealed in the system as previously described 40.The products in the gas phase were continually taken from the reaction cell at given intervals (1 h) for subsequent quantitative analysis based on the external standard method and calibration curve.CO and CH 4 were found to be the only products of CO 2 reduction and no other carbonaceous compounds were detected.The production rates of CO and CH 4 were in mol h A 1 .The control photocatalytic experiments under identical conditions but in the absence of CO 2 or light irradiation were performed, in which no carbonaceous products could be detected. Fig. 6 shows the evolutions of CO and CH 4 as functions of irradiation time on all photocatalysts under Xenon-arc light irradiation.For all the samples tested in this work, compared with m-CeO 2 or m-g-C 3 N 4 , the yields of CO and CH 4 on all the nanocomposites are enhanced, while a slight decrease in the production rate occurs upon prolonged irradiation (seen in Fig. S2).The decrease in production rate reveals a gradual deactivation of the catalyst, which has been generally observed in other literature reports, including our previous work 40,41.The possible reason for this deactivation can be probably attributed to the adsorption/coverage of the catalytically active sites on the catalysts' surface by products and/or intermediates, thus deteriorating the CO 2 photo-reduction reaction.The heterostructured nanocomposites exhibit higher photocatalystic activity than m-g-C 3 N 4 as well as m-CeO 2 , suggesting that such a combination is effective in enhancing the photocatalytic activity of m-g-C 3 N 4 .As reported, m-CeO 2 and m-g-C 3 N 4 in the nanocomposites are likely to show significant synergetic effect during the photoreduction reaction 27. During the evaluation test, an interesting phenomenon was observed.The products of CO 2 photoreaction in the presence of gaseous water highly depend on the photocatalysts.CO is the only product detected in gas phase over m-g-C 3 N 4 , while both CO and CH 4 can be found on m-CeO 2 . Moreover, O 2 was detected in the outlet gases (Fig. S3).It can be seen in Fig. 6a, only a small amount of CO (0.20 mmol) can be obtained over m-CeO 2 in 6 h of irradiation, while the CO yield on m-g-C 3 N 4 is up to 0.98 mmol in 6 h of irradiation.Compared with m-CeO 2 and m-g-C 3 N 4 , both CO and CH 4 amounts generated on the nanocomposites are remarkably increased.It can be seen that 3 m-CeO 2 /g-C 3 N 4 shows the highest CH 4 yield among the as-prepared samples, which is in line with the above results that 3 m-CeO 2 /g-C 3 N 4 has the strongest light absorption and the lowest recombination efficiency of electrons and holes.At a relatively high level of Ce loading (45), the CO and CH 4 yields decrease (Fig. S4), probably because excessive Ce species have become recombination centers for charge carriers 42.The stabilities of CO and CH 4 revolutions over 3 m-CeO 2 /g-C 3 N 4 were also carried out as shown in Fig. 6c andd, respectively.The evolution amounts of both CO and CH 4 decrease sharply in the second run, however, the photocatalyst recovers its activity after being heated in an oven at 150 1C for two hours and no significant deactivation has been observed during the next two runs, which verifies our assumption above. To investigate the structural stability in the photoreduction of CO 2 with water vapor, we characterized the structure, morphology, and corresponding pore-size distributions of the representative nanocomposite after photocatalytic tests (seen in Figs.S5-S7).The structure of the used sample does not show significant changes compared with the fresh one, suggesting that the nanocomposite is structurally stable (Fig. S5 andS6).However, the specific surface area of the used sample shows a slight decrease from 179.1 m 2 g A 1 to 139.6 m 2 g A 1 .Meanwhile, the pore size also decreases gently from 10.6 nm to 10.1 nm (shown in Fig. S7).These slight decreases can be attributed to the adsorption/coverage of the actively sites by CO and/or CH 4 products or intermediates, in correspondence to the recycling activity tests shown in Fig. 6c and6d. Compared with the pure m-CeO 2 and m-g-C 3 N 4 , the photocatalytic activity of CO 2 reduction on the m-CeO 2 /g-C 3 N 4 nanocomposites has been greatly enhanced as described above, which has not been found in previous reports.Such an enhancement can be mainly attributed to their unique structure with a variety of favorable properties.On the one hand, mesoporous architecture with large surface area provides a large amount of active sites and enables the free diffusions of reactants/products into/out of the bulky catalysts.On the other hand, the addition of m-CeO 2 to m-g-C 3 N 4 effectively favors the spectral response from UV to visible area, i.e., the visible light from Xenon arc lamp contributes to the photocatalytic efficiency of these mesoporous nanocomposites in the reduction of CO 2 with H 2 O 29.According to band gap theory 43 and the above information, a synergetic catalytic mechanism for the CO 2 photoreduction on m-CeO 2 /g-C 3 N 4 under irradiation is proposed as follows (shown in Scheme 1).The photogenerated electrons in g-C 3 N 4 will migrate to m-CeO 2 driven by the inner electric field between them because of the energy band bending in space charge region, while the holes generated in m-CeO 2 transfer to VB of g-C 3 N 4 .Such charge transfers result in mutual activation of both g-C 3 N 4 and CeO 2 27, as illustrated in Scheme 1. Firstly, the promoted charge separation or suppressed charge recombination results in accumulation of longer life-time holes (h ) on g-C 3 N 4 , i.e., the activation of g-C 3 N 4 .At the VB of g-C 3 N 4 , H 2 O molecules are oxidized by h to generate O 2 and H , meanwhile, at the CB of CeO 2 , CO 2 molecules are reduced to CO and CH 4 by accumulated photo-generated electrons (e A ) under the assistance of H .Secondly, the accumulated e A on CeO 2 will lead to partial reduction of Ce 4 to Ce 3 , as demonstrated by XPS, i.e., both Ce 3 and Ce 4 exist in the nanocomposite photocatalysts.It is well known that Ce 4 can trap photo-excited electrons at the ceria-containing interface through reaction 1 23,44, while Ce 3 can react with gas-phase CO 2 (reaction 2) to form CO A 2 , which can be further reduced to CO (reaction 3) and CH 4 (reaction 4) in this case.The formation of CO A 2 has been confirmed by a number of reports 45.Hence, the presence of Ce 4 can enhance electron trapping and transfer to CO 2 , in the meantime, the generated Ce 3 by Ce 4 reduction favors the formation of the products from CO A 2 .Both processes prevent the recombination of photogenerated electrons and holes, and generate Ce 3 from Ce 4 reduction by the trapped electrons, which results in considerably enhanced activity of the photocatalytic reaction."
  },
  {
    "title": "Conclusions",
    "content": "In conclusion, we have demonstrated a novel kind of mesostructured CeO 2 /g-C 3 N 4 nanocomposites by a simple hard template method, which exhibit significantly enhanced Fig. 1 SEM images of (a) m-g-C 3 N 4 , (b) 3 m-CeO 2 /g-C 3 N 4 nanocomposite; TEM images of (c) m-g-C 3 N 4 , (d) m-CeO 2 , (e) 3 m-CeO 2 / g-C 3 N 4 nanocomposite with inserted SAED pattern (inset of e); (f) HR-TEM image of 3 m-CeO 2 /g-C 3 N 4 sample. Fig. 2 (a) XRD patterns of m-CeO 2 , m-g-C 3 N 4 , and m-CeO 2 /g-C 3 N 4 samples; (b) N 2 adsorption-desorption isotherms; (c) corresponding pore-size distributions calculated from the desorption branch of the as-prepared samples. Fig. 3 (a) UV-vis diffuse reflectance spectra (DRS); (b) the magnified DRS image of the selected frame from (a); (c) the plots of (ahv) 1/2 versus energy (hv) for the band gap energies of the samples; (d) photoluminescence spectra of the as-prepared samples excited at 325 nm. Fig. 4 (a) Transient photocurrent density of m-CeO 2 , m-g-C 3 N 4 , and 3 m-CeO 2 /g-C 3 N 4 electrodes at 0.3 V versus Ag/AgCl; (b) electrochemical impedance spectra of the as-prepared samples at A 0.4 V versus Ag/AgCl. Fig. 5 XPS profiles of (a) survey, (b) C 1s, (c) N 1s, and (d) Ce 3d of the samples m-CeO 2 , m-g-C 3 N 4 and 3 m-CeO 2 /g-C 3 N 4 . Fig. 6 Time-dependent CO (a), CH 4 (b) amounts generated on m-CeO 2 , m-g-C 3 N 4 , and m-CeO 2 /g-C 3 N 4 nanocomposites.Stability studies of CO (c) and CH 4 (d) evolutions over 3 m-CeO 2 /g-C 3 N 4 .Condition: 50 mg catalyst, reaction temperature 25 1C, ambient pressure, 300 W Xe-lamp. light response, highly efficient separation and transfer of photogenerated charge carriers across the interface between mesoporous CeO 2 and g-C 3 N 4 , and consequently, the greatly enhanced photocatalytic performance in the photoreduction of CO 2 by gaseous water under full spectrum light irradiation.A synergetic catalytic effect of mutual activations between m-CeO 2 and g-C 3 N 4 is proposed: The migration of photo-generated electrons from g-C 3 N 4 to m-CeO 2 and their trapping by Ce 4 leads to the recombination prevention of photogenerated electrons and holes in g-C 3 N 4 (g-C 3 N 4 activation) and the generation of Ce 3 from Ce 4 reduction by the trapped electrons in m-CeO 2 (CeO 2 activation), both of which benefits the activity enhancements of CO 2 reduction.As a result, as high as 0.590 mol CO and 0.694 mol CH 4 can be obtained by CO 2 reduction on 50 mg photocatalyst in the first hour.This work presents a promising m-CeO 2 /g-C 3 N 4 photocatalyst for CO 2 photoconversion without addition of any noble-metal co-catalyst.Mengli Li received her M.S. degree from Lanzhou Institute of Chemical Physics, Chinese Academy of Sciences in 2010.Currently she is a Ph.D. candidate under the supervision of Professor Jianlin Shi at Shanghai Institute of Ceramics, Chinese Academy of Sciences.Her current main research focuses on the design and synthesis of graphitic carbon nitride based nanocomposites used in environmental protection and energy conversion.Lingxia Zhang received her Ph.D. degree from Shanghai Institute of Ceramics, Chinese Academy of Sciences in 2003.She has been working at the institute after graduation.Currently her research mainly includes mesoporous and low-dimensional materials applied in artificial photosynthesis and environmental purification. Physicochemical properties and photocatalytic activities of the photocatalyst for CO 2 reduction under simulated solar light. a BET surface area.bBJHaverageporesize.cTheamount of CO evolution after 1 h irradiation.dTheamount of CH 4 evolution after 1 h irradiation. This work was financially supported by the National Key Basic Research Program of China (2013CB933200), National 863 plans projects (2012AA062703), National Natural Science Foundation of China (21177137), Youth Innovation Promotion Association CAS (2012200) and Shanghai Technical Platform for Testing and Characterization on Inorganic Materials (14DZ2292900). Supplementary data associated with this article can be found in the online version at http://dx.doi.org/10.1016/j.nanoen.2015.11.010."
  }
]