[
  {
    "title": "Doi",
    "content": "10.1016/j.apcata.2020.117503"
  },
  {
    "title": "Article_Title",
    "content": "Gas-phase CO2 photoreduction via iron/ZSM-5 composites"
  },
  {
    "title": "Abstract",
    "content": "Photocatalytic conversion of CO 2 into chemicals has been recognized as a promising strategy for combining virtuous carbon cycle and solar energy storage.The realization of this process depends on an efficient catalyst to activate CO 2 molecule utilizing solar light.Rational design of hybrid structural photocatalyst comprising multiple components with distinctive functionalities is highly desirable for gas-phase CO 2 photocatalytic conversion.Here we report iron oxide species modified zeolite ZSM-5 by function ion preadsorption assistance for the efficient photocatalytic reduction of CO 2 to CO and aldehyde.Derived from the synergistic Fe II and Fe III functions on ZSM-5, the FeO X /ZSM-5 composite catalysts furnished favorable band gaps and active sites for CO 2 adsorption/activation as well as CeC coupling.Significantly, the 3 wt FeO X /ZSM-5 catalyst exhibits a high CO 2 conversion rate of 17.6 mol g cat -1 h -1 , with a high selectivity (43.1 ) for aldehyde generation (7.6 mol g cat -1 h -1 )."
  },
  {
    "title": "Experimental",
    "content": "All chemicals employed are of analytic grade and were used without any purification.HZSM-5 zeolite (SiO 2 /Al 2 O 3 molar ratio 60), was derived from ZSM-5 with an MFI framework through an ion-exchange procedure, as reported in literature 19.The FeO X /ZSM-5 composites were prepared using a function ion preadsorption method.In a typical preparation process, HZSM-5 zeolite was first soaked in 0.001 M NaOH at room temperature for 1 h to functionalize the surface with hydroxyl groups, and washed with deionized water until the pH value of the filtrate was around 7. The resulting ZSM-5 was heated to 150 C in Ar flow (99.999 ) and hold for 3 h, and then added to the ferric aqueous solution containing the calculated amount of Fe(NO 3 ) 3 to deposit.The mixture containing both iron salt and ZSM-5 zeolite in aqueous solution was ultrasonically dispersed for 30 min.Then, the suspension was transferred into a flask to evaporate at 500 rpm stirring and 60 C temperature.During evaporation, the solvent portion (i.e.water) of the suspension was eliminated and the sedimentation further calcined in argon atmosphere (99.999 ) at a 2 C/min heating increment from room temperature to 600 C and hold for 3 h to obtain FeO X /ZSM-5 composite catalyst. A photocatalytic thin film of as-synthesized FeO X /ZSM-5 composite catalyst was fabricated by a controllable spin-coating method (spin coater, KW-4A).Typically, 40 mg catalyst powder was dispersed into 2 mL anhydrous ethanol and ultrasonically dispersed for 30 min.After that, a clean round-shape quartz glass (diameter, 4 cm) was placed onto the palm of spin coater, then, 150 L catalyst suspension was slowly added onto the quartz platform at the rotation speed of first 4500 rpm and then 6000 rpm.After calcined in argon atmosphere at 500 C for 3 h, the catalytic FeO X /ZSM-5 film series with stepwise controlled iron composites were obtained.And the catalysts were denoted as FZ1, FZ2, FZ3, FZ4, FZ5 and FZ8, which correspond to the equivalent Fe 2 O 3 mass fraction of 1, 2, 3, 4, 5 and 8, respectively, in the hybrid composites. The crystal structures of the catalysts were determined by X-ray diffraction (XRD) patterns performed on a Rigaku Ultima 4 X-ray diffractometer employing Cu K radiation ( 1.54056A) at 40 kV and 40 mA.XRD patterns were recorded at a scan rate of 4/min and in the range of 550.Identifications of crystalline structures were performed by comparing XRD peaks with Joint Committee on Powder Diffraction Standards (JCPDS) cards.Morphology and microstructure analyses of composites were conducted upon a JEOL JEM-2100 transmission electron microscopy (TEM) under a 200 kV accelerating voltage.Typically, a sample powder was ultrasonically suspended in ethanol and was dropped onto a microgrid carbon film supported on a copper grid, followed by drying at room temperature.X-ray photoelectron spectroscopy (XPS) measurements were carried out at a Quantum 2000 Scanning ESCA Microprobe instrument using monochromatic Al K radiation (h is 1486.6 eV and the work function of Al is 4.62 eV) performed under 12 kV and 4 mA.The binding energies of all XPS spectra were calibrated to C1s peak (284.8 eV) and fitted with Gaussian-Lorenz function after removing extrinsic loss structure by a Shirley-type background subtraction.The valence band XPS spectra (VB-XPS) were carried out in the energy range of -5 eV to 40 eV.The lower binding energy ends (around 0 eV) of VB-XPS spectra were used for valence band calculations via linear extrapolations.Inductively coupled plasma optical emission spectroscopy (ICP-OES) of composites were tested on an OPTIMA 8000 optical emission spectrometer of PerkinLemer equipped with a S10 autosampler and a PlasmaCam observation camera. UV-Vis diffuse reflectance spectra (DRS) were measured using a Hitachi-3010 spectrophotometer equipped with an integrating sphere attachment.The spectra were recorded in the range of 200800 nm with the optically pure BaSO 4 as reference.The diffuse reflectance coefficient (R), deduced from the absorbance of samples, was converted to Kubelka-Munk function F(R) as Tauc plots for further calculations.Photoluminescence (PL) emission spectra were obtained using a Renishaw inVia Raman 325nm HeCd laser. CO 2 temperature programmed desorption (CO 2 -TPD) measurements were conducted on a Micormeritics AutoChem-II instrument equipped with a thermal conductivity detector (TCD).Typically, the catalyst (100 mg) was first purged in He atmosphere with a flow rate of 40 mL/ min, then the sample was heated to 200 C and hold for 1 h.After that, the catalyst was cooled down to 50 C and the gas flow was changed to CO 2 (40 mL/min) for adsorption procedure for 2 h.After purged again with He for 30 min, desorption of CO 2 was carried out in He flow by heating the individual catalyst from 50 to 600 C at a heating rate of 5 C/min.The signal of excurrent CO 2 was detected by TCD.CO 2 uptake isotherms were measured at 25 C on a TriStar II physisorption apparatus from Micromeritics Instrument (Shanghai) Ltd. Electrochemical impedance spectroscopy (EIS) measurement was carried out on a Biologic VMP3 potentiostat using a three-electrode quartz cell system.A clean glass carbon electrode with each FeO X /ZSM-5 catalyst powder was employed as the working electrode, platinum wire and KCl-saturated Ag/AgCl electrode was used as the counter and reference electrodes, respectively.An aqueous mixture of 0.2 M KCl and 0.2 M K 3 Fe(CN) 6 was served as the electrolyte.In a typical working electrode preparation, 10 mg catalyst powder was suspended into 0.5 mL 0.25 wt Nafion ethanol solution and ultrasonically dispersed for 30 min, then 10 L suspension was dropwise dipped onto the working area of the glass carbon electrode for drying.Before EIS measurements, the solution was purged by Ar and then sufficiently bubbled with CO 2 to form a CO 2 -saturated electrolyte solution.The EIS test range was set from 200 kHz to 20 mHz and the potential perturbation was 10 mV. The photocatalytic performance evaluation of gas-phase CO 2 reduction was conducted on a FeO X /ZSM-5 catalyst (typically 2 mg) thinfilm placed in a tailored quartz photoreaction cell (50 mL, 25 C).Typically, a humidified CO 2 gas stream with a steady flow of 2.5 sccm was introduced into the cell and a solar simulator made from a 300 W Xe lamp and an AM1.5 filter was served as light source (100 mW/cm 2 ).The light intensity was measured by an optical power meter (CEL-NP 2000).Prior to photocatalytic reaction, the photoreaction cell was fully vacuumed and filled with water-saturated CO 2 for 30 min.The outlet flow maintained at 65 C was directly delivered to an online gas chromatography (GC).The GC was equipped with two HayeSep C columns of 6080 meshes and one ShinCarbon ST column of 5080 meshes for product-gas separations, two flame ionization detectors (FIDs) for CO and oxygenic hydrocarbon detections and a thermal conductivity detector (TCD) for H 2 examination.Products dissolvable into water were gathered by 5 mL cold water and detected by an off-line GC equipped with an automatic headspace injector, an AC-20 capillary column and an FID detector.The oxygen produced was also collected by water (25 C) and measured by a dissolved oxygen meter (JPSJ-606 L).To determine the origin of the products, isotope-labelling experiment was performed under the same photocatalytic conditions using 13 CO 2 (purity: 99 at, Sigma-Aldrich) as the reactant, and the effluent was analyzed by the on-line mass spectrometry analysis system (OmniStar, Pfeiffer Vacuum)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "XRD patterns of bare ZSM-5 and FeO X /ZSM-5 composites are displayed in Fig. 1 in the range of 550.The diffraction peaks corresponding to typical ZSM-5 characteristics (JCPDS no.44-0003) exist in all samples, implying the well-defined MFI framework of ZSM-5 was preserved.Nevertheless, the intensities of ZSM-5 peaks are gradually decreased as increasing iron loading level, which is attributed to the Xray absorption effect of the magnetic iron species 20.Exhaustive analyses for the iron oxide-related peaks from 32to 36(right part in Fig. 1) indicate that no legible new peaks appear from FZ1 to FZ4, indicating iron species in the composites with low Fe level were highly dispersed with too small particle size to be detected by XRD.When the iron dopant level exceeds 5 wt (Fig. 1f), only a new tiny peak at 33.1e merged, corresponding to -Fe 2 O 3 (104) plane (JCPDS 33-0664).While FZ8 (Fig. 1g) showed the distinct diffraction peaks assigned to -Fe 2 O 3 (104) and (110) planes, respectively, implying the relatively larger Fe 2 O 3 particles at high iron level 21,22. TEM observations (Fig. 2) reveal that spatially dispersed nanoparticles were expediently resolved on ZSM frameworks for all FeO X / ZSM-5 composite catalysts.A large number of nanoparticles were imaged randomly.The representative high-resolution TEM (HRTEM) images and relevant fast Fourier transform (FFT) patterns (Fig. S1) presented the interplanar spacing mainly at 2.52 0.01 A, 2.70 0.01 A and 2.04 0.01 A, which respectively corresponding to the 110 plane of -Fe 2 O 3 , 104 plane of -Fe 2 O 3 and 101 plane of FeO.Particles with the spacing of 2.52 0.01 A or 2.70 0.01 A in each HRTEM image indicated that -Fe 2 O 3 phase nanoparticles exist in all the composites.While the spacing of 2.04 0.01 A were mainly observed in FZ2 and FZ3.The occurrence of the ferrous species indicate the Fe 2 O 3 autoreduction with the functional groups of ZSM-5 induced by their interactions during the catalyst preparation process, as recognized previously 23,24.Size distribution histograms of FeO X /ZSM-5 composites show that approximately 80 particles were in the range of 512 nm (Table S1), and FZ2 and FZ3 show the relatively broader size distributions compared to the other composites, elucidating such strong interactions lead to not only the new FeO component but also the broad particle size distributions. The surface electronic states of iron species in FeO X /ZSM-5 composites were studied by XPS.The Fe 2p spectra in all composites (Fig. 3A) were fitted with three components with the corresponding 2p 3/2 peaks assigned to Fe III in the Fe 2 O 3 state at a binding energy of 711.1 eV, Fe II in the FeO state at 709.1 eV, and Fe(OH) X (x is between 2 and 3) at 714.0 eV, respectively, in accordance with previous reports on iron-based zeolites 25,26.The presence of Fe(OH) x component implies the protonation effect on FeO X species induced by the surface hydroxyl group of ZSM-5 27.Shake-up satellites associated with Fe III peaks were also fitted, typically located at 8 eV higher than the Fe III 2p 3/2 main peak 28,29.Moreover, Fe II component was derived from the autoreduction effect of Fe III in the high-temperature synthesis procedure 24,30, as evidenced by the FeO (101) planes in HRTEM investigations.Inductively coupled plasma optical emission spectroscopy (ICP-OES) results (Fig. S2) showed all composites possessed larger Fe concentrations than the theoretical values due to the oxygen loss, suggesting the construction of the FeO 1.5-X particles rather than simple Fe-species formation is sensitive to iron loadings in Fe-ZSM-5 systems, in agreement with the results of earlier reports 31,32.Fig. 3B shows the intensity ratios of Fe II /Fe III versus the mass fraction of total iron species in hybrid catalysts.The Fe II /Fe III ratios rapidly increased from 15 to 33 with increasing total iron level from 1 to 3 and then gradually decreased to 9 at FZ8 (Table S2 andS3), implying the potential composition inflexion at FZ3.This redox-tailoring effect can modulate divergent and distinguished electronic band structures of the hybrid composites.In contrast, the molar ratio of Fe(OH) X /Fe III (Fig. 3B) roughly maintained a steady level around 50 with only a monotonous decrease as increasing the iron-dopant amounts. The absorption edges and the band properties for stepped-level irondoped zeolites were studied by DRS (Fig. 4).One sees that ZSM-5 nearly shows inferior visible light adsorption ability while Fe-doped composites possess broad light-harvesting regions from 200 nm to almost 650 nm.Thus, the absorption threshold is progressively intensified and apparently red shifted in tune with Fe-level elevating, which showcases the charge transfer transitions of t 1 t 2 and t 1 e 1 of FeO X 22,33.Tauc plots based on DRS absorption edges 34,35 show the band gaps are sharply narrowed from 3.66 eV of ZSM-5 to 2.93 eV of FZ1 and 2.79 eV of FZ2 (insets II and III in Fig. 4).After that, lower band-gap values were presented, only with a minor raise from 2.04 eV (FZ3) to 2.06 eV (FZ4) and 2.05 eV (FZ5), and further up to 2.08 eV (FZ8) (insets I and III in Fig. 4).Thus, the regulated bandgap values have been realized and FZ3 possesses the narrowest band gap (2.04 eV), which favors the light harvest of FZ3. Photocatalytic CO 2 reduction reaction (CO 2 RR) was conducted over FeO X /ZSM-5 thin film with H 2 O-saturated CO 2 flow in a quartz photocell.The solar simulator made from the 300 W Xe lamp and the AM1.5 filter was utilized as irradiation source with the similar solar spectrum (Fig. S3).As shown in Fig. 5, the products CO and CH 3 CHO were reproducibly generated over FeOx/ZSM-5 composite catalysts.Bare ZSM-5 showed the CO 2 photocatalytic activities with CO and CH 3 CHO production rates of 6.19 and 0.86 mol g cat -1 h -1 , respectively.The less-iron doping catalyst FZ1 gave the CO 2 conversion rate of 11.76 mol g cat -1 h -1 .With increasing Fe content, the CO 2 conversion rate increased to 13.99 mol g cat -1 h -1 over FZ2 and further up to 17.59 mol g cat -1 h -1 over FZ3.And FZ3 possessed the highest CO and CH 3 CHO production rates of 10.01 and 3.80 mol g cat -1 h -1 , respectively, indicating approximately 2.23 time of CO 2 conversion rate that of ZSM-5.After that, the activities fade rapidly and CO 2 conversion rates of FZ4 and FZ5 decreased to 1.62 and 0.96 time that of ZSM-5. The CO 2 conversion rate of FZ8 was 2.49 mol g cat -1 h -1 and only 14.14 of FZ3.The overall production rates of CO and CH 3 CHO were highly dependent on the surface electronic configuration of Fe II /Fe III molar ratio.Oxygen vacancy constructions have been demonstrated to be a pivotal criticism for facilitating photocatalytic CO 2 RR performance in previous photocatalysts 16,36,37.The oxygen vacancies in the FeO X multiparticles could be inferred from the theoretical stoichiometric ratio of Fe 2 O 3 and FeO.The more Fe/O ratio is, the less oxygen atoms are incorporated in the FeO X lattices under the inert fabrication atmosphere, which build more oxygen vacancies for activating CO 2 .Table S3 calculated the approximate oxygen-vacancy levels for all catalysts derived from the variability of Fe II /Fe III ratios, namely FeO 1.44 for FZ1, FeO 1.39 for FZ2, FeO 1.38 for FZ3, FeO 1.42 for FZ4, FeO 1.44 for FZ5 and FeO 1.46 for FZ8 were respectively obtained.The Fe/O values are keeping in good pace with the total yield of CO and CH 3 CHO.Furthermore, the selectivity of the C 2 product CH 3 CHO monotonically increased with increasing Fe content.Control experiments including solely no water, no photocatalysts, no illumination was systematically conducted, as a result, no products or only a trace amount of CO were observed in all experiments.The isotope-labeling experiment using 13 CO 2 as the reactant was carried out for studying the carbon source of the products.As shown in the Fig. S4A, when the non-isotope-labeled CO 2 was used as the reactant, the mass spectrum of the effluent showed the signals of CO 2 (m/z 44, 28, 16, 12), H 2 O (m/z 18, 17, 16), O 2 (m/z 32, 16), CO (m/z 28, 12) and CH 3 CHO (m/z 29, 44, 43).While using 13 C-labeled feed, the signals in the mass spectrum shifted to 13 CO 2 (m/z 45, 29, 16, 13), H 2 O (m/z 18, 17, 16), O 2 (m/z 32, 16), 13 CO (m/z 29, 13) and 13 CH 3 13 CHO (m/z 30, 46, 45) (Fig. S4B).Although there are some overlapped signals due to the ion fragments, the overall results verified that the products were from CO 2 photoreduction.In addition, a certain amount of oxygen detected by a Clark-type oxygen electrode of dissolved oxygen analyzer confirmed the existence of H 2 O oxidation reaction accompanying CO 2 reduction.The catalyst FZ3 showed the excellent stability with only 10 decay for the CO and CH 3 CHO production rates at the 6th cycle (Fig. S5A).Although the CO and CH 3 CHO production rates over FZ4 are about 70 of those over FZ3, FZ4 also show the stable cycling performances (Fig. S5B).The ratios of Fe II /Fe III and Fe(OH) X /Fe III after different cycles were obtained from the corresponding post-reaction XPS spectra (Fig. S6).The detailed ratios of Fe II /Fe III and Fe(OH) X /Fe III are listed in Table S2.The ratios of both Fe II /Fe III and Fe(OH) X /Fe III in FZ3 remained almost constant with negligible fluctuations, corroborating the surface iron oxide species in FZ3 were stable. The photo-induced charge carrier behaviors of FeOx/ZSM-5 catalysts were investigated by PL spectra.As shown in Fig. 6, bare ZSM-5 demonstrated relatively high PL intensity, which may derive from the trace iron impurities (Fig. S2) 18,31, suggesting the rapid recombination of photogenerated electron-hole pairs 38.While in FeO X modified hybrid catalyst, a successive PL signal quenching was realized, which indicates the iron species paves new way to separate and migrate charge carriers by regulating the electronic structures of zeolite.Consequently, the lifetime of charge carriers was prolonged, i.e., more electrons and holes were engaged in CO 2 reduction and H 2 O oxidation, hence leading to the enhancement of CeC coupling at FeO X oligomer sites in photocatalytic CO 2 RR.Furthermore, EIS spectrum of FZ3 showed a significantly reduced arc radius of the semicircle in high frequency region compared with ZSM-5 (Fig. S7), implying FZ3 possesses a lower charge transfer resistance and a better suppression of charge recombination. CO 2 adsorption/desorption features of composite catalysts were investigated by CO 2 uptake isotherms and CO 2 -TPD spectra to evaluate their effectiveness in initiating, activating and terminating CO 2 photocatalytic reactions 394041.The adsorbed CO 2 amounts over bare ZSM-5 and FeO X /ZSM-5 composites were in the range of 1.2-1.7 mmolg cat -1 at 1 bar and 25 C (Fig. S8), comparable to the previous reports 42,43.The support ZSM-5 acts as a CO 2 -supply pool to ensure a high local CO 2 concentration for photocatalytic conversion at active iron sites.Both the low-temperature and high-temperature CO 2 desorption peaks (peak and ) appeared over bare ZSM-5 while only peak over FeO X /ZSM-5 composites, as shown in Fig. 7. Peak can be assigned to the desorption of weakly adsorbed CO 2 from the negative charge oxygen sites in the zeolitic framework 444546, and peak derives from the strong basic sites in ZSM-5, which was vanished due to the iron protoxide modifications.Moreover, peak for FZ3 showed the highest desorption temperature at 128 C compared to the other composites, revealing an enhanced CO 2 adsorption capability for better CO 2 activation. Fig. 8 illustrates the CO 2 photoreduction mechanisms over FeOx/ ZSM-5 catalysts.The electrons from the FeO X VB are excited to the CB position under light radiation, leaving equal number of holes in VB.Profitting from the interaction with the surface hydroxyl groups of ZSM-5, FeOx/ZSM-5 composites possess the mix band structures, resulting in the improvement of light harvest.And composites with the mixed valence can facilitate the interfacial charge transfer 47484950 and prolong the charge-carrier lifetimes, establishing reinforced electron utilization ability with adsorbed CO 2 51525354.Moreover, highly dispersed FeOx nanoparticles with rich oxygen vacancies in the composite catalysts act as the active sites for the dimerization of intermediate HeC O, a critical step distinguishing glyoxal pathway from formaldehyde or carbene pathways 55,56.FeO X surfaces exposed in the forms of Fe oligomers (O a and O b ) increase gradually, which could be beneficial for the CeC coupling of reaction intermediates (Fig. S9 and Scheme S1) 22,57.In addition, the protolysis of brnsted acid sites in the zeolite, not only gives substantial influence on the structure distribution of iron species 58, but also provides proton transfer channels for hydrogenation accompanying charge transfer procedure in CO 2 reduction steps 59, which build the enhanced charge separation, transfer and transport cooperation and render controllable CO 2 photoreduction activity."
  },
  {
    "title": "Conclusions",
    "content": "FeO X /ZSM-5 composite catalysts with varied concentrations and oxygen-deficient levels were successfully synthesized and exhibited the improved CO 2 photocatalytic reduction performance to CO and aldehyde under simulated sun light irradiation.Specific Fe-O formulations and band structures were quantified with insights to regulate photocatalytic CO 2 RR activity and product selectivity.Due to the unique interaction between FeO X and ZSM-5 support, the rationally dispersed Fe protoxide oligomers were established in FeO X /ZSM-5 series, which facilitate the interfacial charge transfer and prolong the charge-carrier lifetimes.As a result, a high oxygen vacancy of FeO 1.38 was engaged in the 3 wt iron oxide concentration of total composite proportion (FZ3) with the narrowest bandgap of 2.04 eV, yielding the CO 2 conversion rate of 17.6 mol g cat -1 h -1 and endowing the high selectivity of 43.1 for aldehyde generation (7.6 mol g cat -1 h -1 ).Moreover, the surface FeO X oligomers facilitate the CeC coupling to efficiently generate aldehyde.This work highlights the great potential of using porous ZSM-5 as a platform to anchor earth-abundant iron active sites for heterogeneous CO 2 reduction to produce valuable C 2 chemicals. Xiaoju Zhao: Writing -original draft.Wei Chen: Conceptualization, Writing -review editing, Supervision.Wei Wei: Supervision.Yunhan Sun: Supervision. Fig. 1.XRD patterns of bare ZSM-5 and FeO X /ZSM-5 photocatalysts (a) ZSM-5, (b) FZ1, (c) FZ2, (d) FZ3, (e) FZ4, (f) FZ5 and (g) FZ8. Fig. 2. TEM images with high-and low-magnifications and particle distributions of iron species of FeO X /ZSM-5 photocatalysts.(a) FZ1, (b) FZ2, (c) FZ3, (d) FZ4, (e) FZ5 and (f) FZ8. Fig. 3. Surface analysis of FeO X /ZSM-5 photocatalysts.(A) Fe 2p XPS spectra of (a) FZ1, (b) FZ2, (c) FZ3, (d) FZ4, (e) FZ5 and (f) FZ8.Sat.represents shake-up satellite peak of the Fe III main peak and Exp.represents raw experimental data.(B) Relative intensity ratios of Fe II /Fe III and Fe(OH) X /Fe III versus the mass fraction of total iron species in composites. 3 upon ZSM-5. Fig. 4. UV-vis DRS spectra of bare ZSM-5 and FeO X /ZSM-5 photocatalysts.Inset I, Inset II: Tauc plots based on the DRS spectra, where F(R)h 0.5 is the Kubelka-Munk function for indirect-band semiconductors and h is photon energy; Inset III: Optical band-gap trend as increasing Fe level. Fig. 5. Production rates of the phototcatalytic products CO and CH 3 CHO over bare ZSM-5 and FeO X /ZSM-5 photocatalysts under simulated sunlight irradiation.The CH 3 CHO selectivities are shown with purple dots, which is calculated based on the equation CH 3 CHO selectivity 2Producton rate of CH 3 CHO100 /(2Producton rate of CH 3 CHO Production rate of CO).(For interpretation of the references to colour in this figure legend, the reader is referred to the web version of this article). Fig. 6.PL spectra of bare ZSM-5 and FeO X /ZSM-5 photocatalysts. Fig. 7. CO 2 -TPD profiles of bare ZSM-5 and FeO X /ZSM-5 photocatalysts. This work was financially supported by the National Natural Science Foundation of China (nos.91745114, 21802160), the Ministry of Science and Technology of China (nos.2016YFA0202800, 2018YFB0604700), Shanghai Sailing Program (no.18YF1425700), Shanghai Advanced Research Institute Innovation Research Program (nos.Y756812ZZ1 (172002) and Y756803ZZ1 (171003)) and Shanghai Functional Platform for Innovation Low Carbon Technology.W. C. also acknowledges the support from the Hundred Talents Program of Chinese Academy of Sciences. Supplementary material related to this article can be found, in the online version, at doi:https://doi.org/10.1016/j.apcata.2020.117503."
  }
]