[
  {
    "title": "Doi",
    "content": "10.1016/j.jphotochem.2017.07.046"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic conversion of CO 2 into methanol over Cu-C/TiO 2 nanoparticles under UV light and natural sunlight"
  },
  {
    "title": "Abstract",
    "content": "Highlights Cu-C/TiO2 nanoparticles were synthesized via sonicated sol-gel method. Photocatalytic reduction of CO2 into CH3OH was successfully achieved using Cu-C/TiO2. 1 g L -1 of 3wtCu-C/TiO2 exhibited maximum catalytic activity. Methanol production by Cu-C/TiO2 was much higher than those of C/TiO2 and Degussa P25."
  },
  {
    "title": "Experimental",
    "content": "The preparation of Cu-C/TiO2 by sol-gel was carried out by the addition of 30 mL of titanium (IV) iso-propoxide to 30 mL of absolute ethanol under continuous sonication.To modify the catalyst, 15 ml of glucose (0.01M) and different contents of copper sulfate were added into the prepared mixture.The solution pH was adjusted to be 3.2 with 50 HNO3 and the sonication was continued for additional 2 h.The obtained gel was kept around one day time period in the normal room temperature and then dehydrated at 85C for 12 hours.This powder was then transferred into a crucible and was kept in muffle furnace at 500C for 2 h.The synthesis of C/TiO2 was achieved by following the same procedure used in preparing Cu-C/TiO2 except the addition of Cu.TiO2 P25 (Degussa, Japan) was used as a reference photocatalyst without any pretreatment. A 6000 X-ray generator (Shimadzu) with a copper K radiation at 30 mA and 40 kV were used to carry out the X-ray diffraction (XRD) measurements, data were collected over the 2 range of 20-70 degree at a scan rate of 1.0 min -1 .The UV-Vis spectra of the photocatalysts were recorded on a Shimadzu, Pharma-Spec UV-1700 Spectrophotometer.A JSM-7600F, JEOL (USA) Scanning Electron Microscope (SEM) was used to investigate the surface morphology of the photocatalysts was investigated.The elemental composition and examining the presence of carbon and copper in the photocatalysts were performed by using by Energy Dispersive X-Ray Spectroscopic unit (EDS, X-Max 50 mm 2 , Oxford Instruments) attached to the SEM.X-ray photoelectron spectroscopy (XPS) measurements were carried out on a SPECS surface analysis systems operating at a base pressure of 4 x 10 -10 mbar.A dual anode non-monochromatic Mg-K (1253.6 eV) X-ray source was used to irradiate the sample surface with 13.5 kV, 150 W of Xray power. A homemade stirred set annular reactor was used to perform the photocatalytic reduction experiments.The reactor was made up of Pyrex glass and was connected to CO2 cylinder with a tightly closed tube.A simple schematic representation of the reaction system is shown in Figure 1. The desired catalyst loading was suspended in 0.2 M NaOH solution.Before irradiation, the stirred suspension was purged with a certified super-critical fluid grade carbon dioxide (with a maximum hydrocarbon content of less than 1.0 ppm) for 30 min to maintain a saturated solution, then the CO2 cylinder is turned off.To avoid any sedimentation of the catalyst, all photocatalytic experiments were carried out under continuous stirring.To maintain the constant pressure of CO2 and to avoid the outer contact, the photoreactor was firmly locked.The temperature and pH were monitored continuously during the reaction by using probe sensors mounted inside the reactor.The reactor vessel was irradiated from all sides by UV lamps emitting 365 nm wavelength (Sankyo Denki, Germicidal Lamp, G15 T8-Japan).The solar photocatalytic reduction experiments were carried out by direct exposure of the photoreactor to the real sunlight on sunny days between 09:30 am to 2:30 pm.A 3670i Silicon Pyranometer Sensor attached to Field Scout Light Sensor Reader (Spectrum Technologies, Inc.) was used to measure the average solar intensity, which found to be 1200 W m -2 . The aqueous samples were withdrawn at steady intervals of time using a tightly closed syringe, which is connected to the reactor through an additional opening.Different sets of blank experiment tests were completed to confirm that the formation of methanol was due to photo induced reduction of CO2.Blank tests were performed under UV illumination without catalyst.The levels of CO2 were measured by both gas chromatographic technique using Bruker, GC-450 and titrimetric method according to standard method described by Strickland and Parason, 1972 21.Methanol contents were measured using the spectrophotometric technique according to method described by Anpo et al. 3, and Zhan et al. 22."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Figure 2 displays the XRD spectra of P25, C/TiO2 and Cu-C/TiO2 of various copper loadings. The obtained XRD patterns do not show any characteristic peaks of copper or carbon, probably due the high dispersion of Cu and C over TiO2 surface or the total incorporation of the dopants into the TiO2 crystal lattice in all the doping cases 23.Furthermore, at low loading percentages, there is insufficient structural modification to the TiO2 such as to give an observable change in the XRD spectra.The characteristic diffraction peaks show that the C/TiO2 and all Cu-C/TiO2 samples are of monophase of anatase structure.While the diffraction peak pattern of P25 shows a combination of anatase 80.61 and rutile 19.39, as calculated from the following equations 24,25: where IR and IA are the peak intensities of ( 110) and (101), respectively. The crystal sizes of C/TiO2 and all Cu-C/TiO2 samples were in the range of 8.33 to 18.33 nm, whereas it was found to be 21 nm for P25 (Table 1), as calculated by using the Scherrer equation: here is stands for wave length of X-Ray (0.1541 nm), is stands for FWHM (full width at half maximum), is for the diffraction angle and D is the representation of mean crystallite size (nm).in Supplementary material).It clearly noted that the increase of Cu-loading leads to the increase of Atomic of Cu in Cu-C/TiO2 photocatalysts (Table 1). Figure 3a shows the UV-Vis absorption spectra for P25, C/TiO2 and all Cu-C/TiO2 samples. Obvious shift of the absorption spectra for the modified catalysts (C/TiO2 and all Cu-C/TiO2) towards the visible region compared to unmodified P25 is clearly noted.It is clear that, elevated level of Cu content enhances the absorbance of Cu-C/TiO2 samples.Using the Tauc Plot of transformed Kubelka-Munk function, the optical band gap energies of the photocatalysts (Figure 3b) were estimated 26,27: (F(R) h) n A(h -Eg) (11) where: (where Eg, h, , , A, R and S, represent optical bandgap, Planck's constant, light absorption coefficient, frequency of vibration, optical constant, diffused reflectance, scattering coefficient, respectively).Significantly, low bandgap energy values ranging between 1.71 and 1.85 eV were observed for C/TiO2 and all Cu-C/TiO2 samples compared to 3.09 eV for P25 (Table 1).The remarkable narrowing of the bandgap from 3.09 eV for P25 to 1.85 eV for C/TiO2 can be attributed to the mixing of O 2p states with C 2p states for carbon-modified catalyst (C/TiO2).Due to the lower number of electrons in the valence shell of C than the valence shell electron numbers of O, therefore C 2p worked as an acceptor state 28.Further reduction of the bandgap of the catalysts was observed by loading the catalysts with Cu.It is noticeable that the optical bandgap energy of Cu-C/TiO2 samples decreased with increasing Cu content.It can be assumed that the metal ion implantation of TiO2 can improve its electronic properties as a result of the strong interaction which arises between the dopant metal ions and TiO2 3. The X-ray photoelectron spectroscopic spectra (XPS) of 3.0 Cu/C-TiO2 are shown in Figure 4.The presence of Ti, O, C, and Cu species has been confirmed by the XPS survey spectrum (Fig. 4a).The Ti 2p spectrum in Fig. 4b indicates XPS peaks at about 457.2 eV (2p3/2), 458.8 eV (2p3/2), 462.1 eV (2p1/2) and 464.1 eV (2p1/2), which can be attributed to Ti 4 and Ti 3 oxidation states 29. The O 1s XPS spectrum (Fig. 4c) exhibited four peaks 527.8, 530.1, 532.1 and 534.1 eV, corresponding to oxygen in TiO2 lattice (Ti-O, Ti-O-Ti) and OH -which are resulting mainly from the chemisorbed H2O or the free hydroxyl group (O-H) on the surface 303132.Four peaks at 283.3, 285.2, 286.9 and 288.8 eV were indicated for C 1s XPS spectrum (Fig. 4d), which can be assigned to C-Cu, C-C, C-O/CO, and O-CO, respectively 30,333435.Fig. 4e shows the XPS spectrum of Cu 2p.The binding energy of the Cu 2p3/2 peak is 933.1 and 935.9 eV, suggesting that the presence of copper as Cu 2 35,36.The elemental quantification determined through XPS for P25, C/TiO2 and 3 wt Cu-C/TiO2 samples is shown in Table 2.The results obtained from the XPS analysis evidenced the successful e doping of Cu and C atoms into TiO2 lattice.The observed discrepancy between the elemental analysis obtained by EDS and XPS can be attributed to the different incident energy sources of these two kinds of probes; X-ray and electron, revealing the detection of both C and Cu elements at different depths from the surface.Where, the quantitative results of XPS show the outmost surface of catalyst, while those of EDS give the deep structural layers and represent near bulk property 37. To assess the photocatalytic activity of the reduction of CO2 into CH3OH, the conversion process was investigated by using P25-TiO2, C/TiO2, and Cu-C/TiO2 under UV as the light source. The reduction of CO2 at various intervals of time with catalysts is shown in Fig. 5a and the corresponding formation of methanol is shown in Fig. 5b.It is worth revealing that the formation of methanol is quite high on Cu-C/TiO2 compared to that on both P25-TiO2 and C/TiO2.Generally, the contact of TiO2 with metal causes a redistribution of electric charges.Therefore, Cu suppresses the recombination of holes and electrons by serving as an electron trapping 20.Moreover, the rapid transfer of excited electrons enhances the separation of electrons and holes 19.In actuality, Cu 2 with lower redox potential is an encouraging dopant species.Because of the unfilled 3d shell of Cu 2 , it is legitimate to expect that electrons can be caught by Cu-II on the surface of TiO2 38,39.The photo-energized conduction band electrons ( -) will be caught by Cu 2 , and reduced to Cu species.These electrons on Cu species could be devoured through the decrease of H producing hydrogen radical, H and hence re-oxidizing the Cu to Cu 2 species.Due to this consecutive cycle, the process of recombination rate of electron-hole could be successfully decreased.Importantly, Cu species can also act at as a primary adsorption site of CO2 for its reduction to methanol reacting with hydrogen radical, H 40.However, the mechanism of Cu on selective production of methanol has not proved yet 19,41.The mechanism of methanol production has been described by Kakumoto 40.The concept was explained by the adsorption of CO2 on Cu.The H-atom, which is adsorbed on metallic Cu, attacks carbon atom of the adsorbed CO2, leading to the formation of formate intermediate.Further H atoms attack the C-O bond of formate species, then formaldehyde type intermediate will be formed on Cu.Finally, H atoms, formed on TiO2, attack the formaldehyde species to produce methoxy intermediate, followed by the formation of methanol.Generally, the reduction process of CO2 to form methanol requires 6 H as described in Eq (3).This was possibly accomplished by two steps 42; first, saturating the two double bonds in carbon dioxide (OCO) by addition of 4 H to form formaldehyde (HCHO). Second step, methanol (CH3OH) was then formed by addition of two more H to the formed formaldehyde. HCHO 2 H CH3OH (14) The proposed mechanism of photocatalytic reduction of CO2 is shown in Fig. 6.The molecules of water and CO2 are in contact with trapped electron at the surface of Copper-bunch.The presence of NaOH induces the dissociation and the conversion of CO2 into carbonate and bicarbonate species.Upon light irradiation, photo-excited electrons attack carbonate species to form formyloxyl radical: HCO3 - H2O e - HCOO 2OH - The additional electron transfer produces formate ion, which is further protonated to produce HCOOH. HCOO - H HCOOH (18) Then HCOOH can be reduced into CH3OH. The production of methanol with various Cu loading is shown in Fig. 7.The yield of methanol was ascending with the increase of Cu loading from 0.5 to 3wt.Subsequent increase in Cu loading leads to a decline in methanol yield, revealing that 3 wt was the optimal Cu loading. Generally, elevated Cu loading can increase the number of the active sites on the catalyst surface, which in turn will favor the methanol yield.However, the reduction of the photoactivity of the catalyst with more Cu beyond the optimum loading can be ascribed to the shielding of the photoactive sites on TiO2 surface, subsequently reducing the photoexciting capacity of TiO2 424344 and less methanol can be produced. The reduction of CO2 and the yield of methanol at various catalyst loadings are depicted in Fig .More light photons are expected to be absorption by higher concentration of catalyst.However, when the catalyst concentration exceeds the value of 1.0 g L -1 , the incident photon is blocked by excess amounts of photocatalyst in the solution.Consequently, all photocatalyst particles were not uniformly exposed to incident light 20 and thereby the production of methanol decreased (Fig. 9), revealing that 1.0 g/L is the optimum dosage of catalyst. The concentration of NaOH solution can critically affect the photoreduction of CO2 44. Basically, there are two types of reactions, which can explain the effects of NaOH concentration. First, photoinduced holes are scavenged by the high concentration of hydroxyl ion and convert into hydroxyl radicals that enhanced the rate of energetically challenging water oxidation to O2 gas, which in turn increased the degree of reduction of CO2 to methanol.Secondly, the solubility CO2 in caustic NaOH solution is higher than in pure water 20.Figures 10a and10b show the effects of NaOH concentration on the CO2 reduction and the methanol yield, respectively.It is clearly noted that the highest methanol yield was obtained at 0.2 M NaOH (Figure 10b).When the concentration of NaOH exceeded the level of 0.2 M, the dissolution of CO2 was more and after half an hour of purging, solution was slightly acidic with lesser yield of methanol.In our experiment, the initial pH of 0.2 M NaOH solution declined from 12.9 to nearly 7.2 after purging of CO2.It was noted that the methanol formation under alkaline condition was higher than acidic and neutral conditions. It is interesting to investigate the photocatalytic conversion of CO2 into CH3OH by using 3 wt Cu-C/TiO2, C/TiO2, and P25-TiO2, under real sunlight.Figure 11a"
  },
  {
    "title": "Conclusions",
    "content": "Methanol production from CO2 by a photocatalytic reduction process Cu-C/TiO2 nanoparticles has been successfully carried out under natural sunlight and UV.Under current experimental conditions, the optimum Cu doping was found to be 3.0 wt , and the yield of methanol was favorable under alkaline conditions.The methanol yield over Cu-C/TiO2 was higher than those over C/TiO2 and the commercial one, Degussa P25.The observed enhancement of methanol yield indicates that the copper species act as an electron trap to reduce the recombination of electronhole and as well as active catalytic site for CO2 reduction.Tables Table 1: The properties of P25, C/TiO2 and Cu-C/TiO2 samples. The morphological characteristics of P25, C/TiO2 and Cu-C/TiO2 of various copper loadings are shown by the SEM images (Fig.S1in Supplementary material).The little amount of Cu doping onto the TiO2 could not change the surface morphology remarkably.When Cu loading became more, significant roughness and morphological changes were observed.A typical spherical, nanosized particle for P25 and C/TiO2 is clearly noted.Whereas, Cu clusters or feather-like shapes are covering the spherical particles of Cu-C/TiO2 of samples.The elemental composition determined through EDS analysis evidenced the modification of carbon in all carbon doped catalysts (C/TiO2 and Cu-C/TiO2) and the presence of Cu in all Cu-C/TiO2 photocatalysts (Fig.S2 8a and Fig 8b, correspondingly.While varying the concentration of TiO2, the change in methanol yield is clearly observed.The concentration of methanol increases with the amount of catalyst, then started to decline when the concentration overdoes 1.0 g L -1 shows the reduction of CO2 at various intervals of time with catalysts under natural sunlight.The corresponding formation of methanol is shown in Fig. 11b.No methanol production was observed when reference P25-TiO2 was used.It is clearly seen that the conversion of CO2 into CH3OH by the way of photocatalysis under real sunlight is dramatically enhanced by modification of titanium oxide with Cu in addition to the carbon (3 wt Cu-C/TiO2) compared to C/TiO2, which can be attributed to the suppression of electron-hole recombination by Cu-loading for Cu-C/TiO2 photocatalyst. Figure 1.Schematic representation of the reaction system.(1 vacuum chamber; 2 CO2 cylinder; 3 batch reactor; 4 magnetic stirrer; 5 UV light; 6 sampling syringe; 7 gas valve; and 8 probe sensor). Figure 2. XRD patterns of the photocatalysts. Figure 3. UV-Vis spectra of the photocatalysts (a); the plot of transformed Kubelka-Munk Figure 4. XPS spectra of 3 wt Cu/C-TiO2 sample: (a) survey spectra, (b) Ti 2p, (c) O 1s, (d) C Figure 5.Time dependence on: CO2 reduction (a); methanol yield by using P25-TiO2, C/TiO2, Figure 6.Mechanism of photocatalytic reduction of CO2 by using Cu-C/TiO2. Figure 7. Effect of Cu loading on methanol yield after 5h of UV irradiation. Figure 8.Effect of 3 wt Cu-C/TiO2 dose on CO2 reduction (a); methanol yield (b). Figure 9. Methanol yield at various concentrations of 3 wt Cu-C/TiO2 after 5h of UV Figure 10.Time dependence on: CO2 reduction (a); methanol yield at various NaOH Figure 11.Time dependence on: CO2 reduction (a); methanol yield (b) by using P25-TiO2, The elemental quantification determined through XPS analysis for P25, C/TiO2 and 3 wt Cu-C/TiO2 samples. \"The author, Yasar N Kavil, is grateful to the Deanship of Graduate studies, King Abdulaziz University for providing Ph.D. Fellowship.\""
  }
]