[
  {
    "title": "Doi",
    "content": "10.1016/j.apsusc.2014.07.153"
  },
  {
    "title": "Article_Title",
    "content": "Visible-light CO2 photocatalytic reduction performance of ball-flower-like Bi2WO6 synthesized without organic precursor: Effect of post-calcination and water vapor"
  },
  {
    "title": "Abstract",
    "content": "Nanoplates-composed ball-flower-like Bi 2 WO 6 (PB-Bi 2 WO 6 ) was synthesized by a hydrothermal method without any organic precursor and its performance in photocatalytic reduction of CO 2 was investigated in a continuous-flow reaction system under visible light irradiation (420 nm 620 nm).CO was detected as the main product of this photocatalytic process and H 2 O was found to suppress the conversion of CO 2 to CO due to its competitive absorption with CO 2 on the medium strength basic sites of Bi 2 WO 6 .PB-Bi 2 WO 6 annealed at 550 C showed superior CO yield in the condition with little water vapor.It might be attributed to the enhanced crystallinity, significantly decreased recombination rate of photo-generated electrons and holes and more stable basic sites for strengthened CO 2 adsorption, according to characterization results by XRD, SEM, UV-vis SRS, PL and CO 2 -TPD.However, comparing with PB-Bi 2 WO 6 , the negative effect of H 2 O was even more prominent on the annealed sample because of the reduced surface area.Yield decrease was observed during the irradiation time due to the adsorption of intermediates generated but fortunately washing with deionized water was found to be an effective way to renew the catalyst."
  },
  {
    "title": "Experimental",
    "content": "Bi(NO 3 ) 3 5H 2 O, Na 2 WO 4 2H 2 O, HNO 3 were purchased from Sinopharm Chemical Reagent Co. Ltd. (Shanghai, China).All of the chemicals were of analytical purity and used without any further purification.Deionized water was used in all experiments. Nanoplate-composed ball-flower-like Bi 2 WO 6 (PB-Bi 2 WO 6 ) was synthesized referring to the literature reported 29.Typically, 4 mmol Bi(NO 3 ) 3 5H 2 O and 8 mmol Na 2 WO 4 2H 2 O was dissolved in 40 mL 0.6 M HNO 3 and 40 mL deionized water, respectively.Then the two solutions were mixed with each other dropwise and stirred vigorously for 24 h.After that, the mixture was transferred into a 100 mL Teflon-lined autoclave, kept at 160 C for 20 h and cooled to room temperature naturally.The resulted precipitates with bright yellow color were washed with deionized water and dried at 60 C. Post-treatment of PB-Bi 2 WO 6 was conducted by annealing the sample at 550 C for 4 h.The annealed sample was labelled as PB550-Bi 2 WO 6 . The crystal phase and composition of as-prepared catalysts were analyzed using with an X-ray diffractometer (X'Pert PRO, PANalytical Co., Japan) with Cu K irradiation.Field emission scanning electron microscopy (FE-SEM) images were recorded to study the morphology of the samples with a scanning electron microscope (SIRION-100, FEI Co., USA).The specific surface areas were determined with a static adsorption instrument (JW-BK 132F, Beijing JWGB Sci Tech Co., China) by the Brunauer-Emmett-Teller (BET) method and the pore distribution curves were obtained by the BJH desorption method. The diffuse reflection spectra were measured with an integrating sphere equipped UV-vis recording spectrophotometer (TU-1901, Beijing Purkinje General Instrument Co., China) using BaSO 4 as a reference, and the optical absorptions were converted from the reflection spectra according to the Kubelka-Munk equation.The photoluminescence spectra were measured with a steady-state-lifetime fluorescence (FLUOROLOG-3-TAU, Jobin Yvon, Fance) using 420 nm lasers as excitation source. CO 2 temperature programmed desorption (CO 2 -TPD) was carried out on a custom-made setup with a mass spectrometer (Hiden QGA, Hiden Analytical Ltd., U.K.) using 100 mg catalysts.The sample was pretreated with 50 mL/min Helium at 30 C for 1 h and then saturated with pure CO 2 for 15 min.Helium was used again to thoroughly blow away the residual CO 2 and in the following TPD process from 30 C to 850 C at a heating rate of 10 C/min.The amount of CO 2 in the effluent gas was recorded by detecting the charge-mass ratio of 44 with the equipped mass spectrometer. The CO 2 photoreduction experiments were carried out in a continuous-flow system as shown in Fig. 1.The cylindrical photocatalytic reactor was made of stainless steel with an inner cavity (60 mm in diameter, 10 mm in depth) and a quartz window at the top.The light source was a 300 W Xe lamp (PLS-SXE300, Beijing Trust-tech Co. Ltd., China).A VISREF filter and a UV420 cutoff filter (Beijing Trust-tech Co. Ltd., China) were used to obtain visible light (420-620 nm).The distance between the quartz window and light source was 11 cm.The total light intensity ranging from 420 nm to 620 nm on the surface of the quartz window was detected to be 100 mW/cm 2 by an irradiatometer at the central point, away from which the light intensity decreased dramatically.Before the experiment, certain amount of photocatalyst was distributed in the reactor and N 2 containing 10 CO 2 (10 CO 2 /N 2 ) was first purged into the system at 200 mL/min for 2 h to get rid of any impurity gas.Then the flow was adjusted to 2.0 mL/min and stabilized for 30 min before the Xe lamp was turned on.Products in the effluent gas were detected by a gas chromatography (Agilent 7890A) through auto-valves at a certain time interval.The gas chromatography was equipped with three tunnels: (1) Gaspro capillary column and FID detector to detect other hydrocarbons that may be formed besides CH 4 ; (2) Porapark Q and 5A packed column with a Ni-catalyzed methanation oven and a FID detector for the quantification of CO"
  },
  {
    "title": "Results_and_Discussion",
    "content": "According to the XRD patterns in Fig. 2, it can be confirmed that the photocatalyst synthesized was russellite Bi 2 WO 6 (ICDD PDF39-0256) as well as the post-treated sample.Annealing treatment only enhanced the crystallinity without altering the local structure of PB-Bi 2 WO 6. SEM images of PB-Bi 2 WO 6 and PB550-Bi 2 WO 6 are presented in Fig. 3.It revealed that the samples were ball-flowers-like microspheres with a diameter about 2 m and each single sphere was composed of numerous nanoplates.PB550-Bi 2 WO 6 and PB-Bi 2 WO 6 , were almost the same in low-magnification SEM images (Fig. 3A andB).Higher-magnification images (Fig. 3C andD) revealed that the nanoplates of the sample after calcination were thicker and seemed to be ruined in the heating process with multiple pores on the plates and waved edges. The nitrogen adsorption-desorption isotherms and porosity of the synthesized samples were further investigated.Fig. 4 gives the nitrogen adsorption-desorption isotherms.Sample before calcination showed much larger adsorption volume than the Both isotherms were with a larger desorption volume larger than the corresponding absorption volume thus leaving a hysteresis loop in the relative pressure range from 0.2 to 1.0.According to IUPAC classification, this kind of isotherm was assigned to type IV isotherm which was the characteristic isotherm of mesoporous material.The hysteresis loops showed no saturated adsorption stage suggesting the mesopores were irregular.Such kind of hysteresis loop (type H 3 ) was characteristic of materials with a structure of plate slits, cracks and wedges etc.This was in agreement with the nanoplates-composed hierarchical microsphere morphology of the samples as shown in the SEM images (Fig. 3).Barrett-Joyner-Halenda (BJH) pore-size distribution curves of both sample were inserted in Fig. 4. It can be found that PB-Bi 2 WO 6 showed various mesopores ranging from 2 nm to 40 nm with 2.5 nm and 4 nm as two dominating diameters.However, those mesopores shrinked after calcination.PB550-Bi 2 WO 6 showed only a small amount mesopores with diameter from 2 nm to 10 nm. UV-vis light absorption spectra of PB-Bi 2 WO 6 and PB550-Bi 2 WO 6 were nearly the same with an absorption started from 450 nm, as shown in Fig. 5. Still it could be observed that the absorption edge of 550 C calcined sample showed a slight red shift compared with that of the pristine Bi 2 WO 6 .Since the Bi 2 WO 6 was a semiconductor with direct optical transition 22,32, its band gap energy could be estimated from the intercept of the tangents to the plots of (Ah ) 1/2 vs. photon energy (h ) (Fig. 5 insert) 33.Accordingly, the band gap energies of both samples could be respectively estimated to be 2.63 eV and 2.62 eV. Photoluminescence (PL) signals of PB-Bi 2 WO 6 and PB550-Bi 2 WO 6 excited by 420 nm light are presented in Fig. 6.Compared with PB-Bi 2 WO 6 , PB550-Bi 2 WO 6 showed an efficient quenching of photoluminescence, indicating an reduced recombination rate of photo-excited electrons and holes 20.and PB550-Bi 2 WO 6 .The desorption peaks at higher temperature of PB550-Bi 2 WO 6 suggested that post-calcination treatment enhanced the medium strength basic sites on PB-Bi 2 WO 6 .These CO 2 species absorbed on the stronger basic sites might be more active in following photocatalytic process. Photocatalytic reduction of CO 2 under visible light (420 nm 620 nm) using PB-Bi 2 WO 6 and PB550-Bi 2 WO 6 Fig. 4. Nitrogen adsorption-desorption isotherms and BJH pore-size distribution (insert) of PB-Bi2WO6 and PB550-Bi2WO6. were conducted in two conditions (a: with 10 CO 2 flowed through a water bubbler; b: with 10 CO 2 immediately flowed into the reactor without trough a water bubbler).Surprisingly, the Bi 2 WO 6 used in our experiments yielded CO as the main product whilst a little amount of acetaldehyde was also detected with negligible amount of other hydrocarbons.Following control experiments were also conducted: (1) irradiating the reactor with CO 2 flow but without catalysts; (2) using pure Ar instead of 10 CO 2 /N 2 ; (3) dark experiment without light irradiation.None of them showed obvious formation of products within our detection limits (Fig. S1).The real-time CO yield and accumulated CO production over irradiation time are displayed in Fig. 8.It was observed that the CO was much more efficiently generated in condition b than in condition a over both PB-Bi 2 WO 6 and PB550-Bi 2 WO 6 .Interestingly, the production of CO over PB-Bi 2 WO 6 was higher than that over PB550-Bi 2 WO 6 in condition a, but this was reversed in condition b.The rate of CO evolved over PB-Bi 2 WO 6 in condition a peaked with a value of 147 nmol/h/g cat and reduced to 96 nmol/h/g cat after 5 h irradiation.In condition b, CO evolution over PB-Bi 2 WO 6 could reach 333 nmol/h/g cat , which was three times greater than that in condition a.However, under condition b, the catalyst deactivated seriously with a CO production of only 146 nmol/h/g cat after irradiated for 5 h, i.e. a decrease by more than two fold.Similar phenomena were observed on PB550-Bi 2 WO 6 and the increase in CO evolution by changing the condition from a to b was even more obvious.As shown in Fig. 8b, the accumulated CO production over PB550-Bi 2 WO 6 in condition b after 5 h was more than 2.5 mol/g cat., while the value was only near 0.5 mol/g cat. in condition a. Above results suggested that (1) more water content led to a lower CO production on Bi 2 WO 6 probably due to the competitive absorption of H 2 O and CO 2 on the surface of Bi 2 WO 6 .And the phenomenon was more obvious for PB550-Bi 2 WO 6 with a small surface area.(2) Post-treatment by annealing BF-Bi 2 WO 6 at 550 C for 4 h enhanced the photocatalytic activity of the sample in the condition without a negative influence of water.This could be attributed to the higher crystallinity and less surface/bulk defects after annealing treatment, as that demonstrated by XRD (Fig. 2) and PL (Fig. 6) analysis and that reported by Zhang et al. 29.Besides, the more firmly adsorption of CO 2 on PB550-Bi 2 WO 6 shown by CO 2 -TPD (Fig. 7) might contribute to a more efficient production of CO from CO 2 . It should be noticed that the real-time CO yield decreased with the irradiation time during the CO 2 photocatalytic reduction process especially in the condition with poor amount of water vapor.This kind of production reduce was also observed by other researchers in continuous-gas-flow photocatalytic reduction of CO 2 using TiO 2 and Pt modified TiO 2 31,35.And the decrease of product evolution was even more commonly presented in closed system 14,363738.Possible reasons reported include the diminishment of the absorption capacity of the catalyst 39, saturation of absorption sites on the catalyst with intermediate products 35 and limited H 2 O splitting efficiency 40.However, none of the reported researches has taken any efforts in renewing the catalyst. Prolonged experiment with PB550-Bi 2 WO 6 in the condition with poor amount of water vapor at a higher temperature (120 C) (Fig. 9) showed that CO yield reduced sharply in the first 4 h while kept at a relatively stable rate afterwards.After 18 h irradiation, we kept the reacted catalyst in the dark without changing the atmosphere and temperature for 12 h.Then a second reaction run was carried out by turning on the light again.The initial production rate of CO in this run was a little higher than the final rate in the first run and no sharp decrease was investigated afterwards.This indicated that the surface property of the original PB550-Bi 2 WO 6 was changed after a period of irradiation and reaction.It was possibly caused by the intermediate species taking the adsorption sites of CO 2. Then an equilibrium between CO 2 adsorption and products desorption would reach, resulting in a relatively stable CO generation rate. On the other hand, the simple treatment by placing catalysts in the dark with 10 CO 2 led to a little improvement of photocatalytic performance, suggesting that this kind of deactivation might be recovered by more efficient treatment.In this light, we subsequently tried to recover the activity of the catalyst by washing the used catalyst with deionized water.To our surprise, this facile method turned out to be very effective.As shown in Fig. 10, used PB550-Bi 2 WO 6 showed almost the same real-time CO yield and accumulated CO production in 5-h reaction duration after washed with deionized water despite of a little loss of catalyst mass during the renewing process.To exclude the possibility that the recovery of the catalyst might be caused by contacting with water molecule, in situ wetting and drying the catalyst in the reactor was carried out followed by photocatalytic performance evaluation.However, such treatment failed to recover the catalyst (Fig. S2), indicating that intermediate species which could be washed away during the washing process led to the deactivation of Bi 2 WO 6 in photocatalytic reduction of CO 2 .To note, though washing was here proved to be an easy and effective way to regenerate the catalyst, the loss of sample during the washing process remain a problem.Thus, annealing treatment was also carried out to renew the PB550-Bi 2 WO 6 .However, annealing the used catalyst at 300 C for 1 h (Fig. 10a,2nd) or at 400 C for 1 h (Fig. 10a,3rd) was found not able to recover the activity of the catalyst and even would lead to a more serious decrease of CO production. In terms of the way how CO 2 was photo-reduced to CO, it seemed that the theoretical understanding based on the comparison between band energy and redox potential was not enough.According to previous researches 2,3,7, CO might evolve through the following path: However the redox potential of formula (1) was reported to be -0.53eV 41 while the conduction band of Bi 2 WO 6 was just located at around -0.4 eV 23.It was impossible for electrons formed in the conduction band of Bi 2 WO 6 to reduce CO 2 molecule into CO with H .This contradiction implied that CO was not generated from CO 2 molecule physically absorbed on the catalyst.As mentioned above, a little amount of acetaldehyde was also detected and there existed intermediates species on the surface of Bi 2 WO 6 during irradiation.Compared with CO, acetaldehyde needs more electrons and protons to form and thus could not be the first product generated.Meanwhile, TPD experiment showed that CO 2 can be chemically adsorbed on Bi 2 WO 6 (Fig. 7).It can be deduced that CO could be generated from the actively adsorbed CO 2 species immediately by losing an oxygen atom or from the intermediates formed during the photocatalytic process.The later should also be the route how acetaldehyde was produced.Accordingly, the actively adsorption of CO 2 on the catalyst was vital for the reaction to proceed."
  },
  {
    "title": "Conclusions",
    "content": "In this study, the photocatalytic CO 2 reduction performance under visible light irradiation of non-organic hydrothermally synthesized nanoplates-composed ball-flower-like Bi 2 WO 6 was investigated along with the influence of water vapor and postcalcination treatment.CO was detected as the main product with a little amount of acetaldehyde and negligible amount of other hydrocarbons.During the reaction process, a competitive adsorption between water molecule and CO 2 molecule was revealed.The yield of CO in condition with little water vapor was much higher than that in a condition with saturated water vapor at 30 C. PB550-Bi 2 WO 6 obtained by annealing PB-Bi 2 WO 6 at 550 C for 4 h showed improved CO production in the condition with poor amount of water vapor due to the enhanced crystallinity, reduced recombination rate of photo-formed electrons and holes higher and strengthened CO 2 adsorption sites.However, the backward influence of H 2 O became more prominent on the annealed sample for the reduced surface area. For CO 2 photocatalytic reduction over Bi 2 WO 6 , the active adsorption sites played an essential role for its conduction band in a low position and annealing seemed to be an effective way to improve the strength of the adsorption sites.This novel observation of CO formation in CO 2 photocatalytic reduction using Bi 2 WO 6 prepared without any organic precursor was hoped to provide an inspiration to mechanism studies on CO 2 photocatalytic reduction using photocatalyts with different properties. Moreover, while catalyst deactivation was observed during the experiment which was caused by intermediate species adsorbed on the catalyst surface, water washing was found be an effective to renew the catalyst.This is the first time that the regeneration of the photocatalysts used in CO 2 photocatalytic reduction was studied. Fig. 1.Schematic of experimental setup for the photocatalytic reduction of CO2. Fig. 2. XRD patterns of PB-Bi2WO6 and PB550-Bi2WO6. CO 2 TPD CO 2 temperature programmed desorption (TPD) curves of PB-Bi 2 WO 6 and PB550-Bi 2 WO 6 from 30 C to 800 C are shown in Fig. 7. Different carbon dioxide desorption temperature (T D ) suggested the catalysts' basic sites of different strengths 34.The CO 2 desorption peak below 100 C of PB-Bi 2 WO 6 corresponded to physically absorbed CO 2 due to its mesoporous structure.In contrast, PB550-Bi 2 WO 6 with poor amount of pores showed no CO 2 desorption peaks blow 100 C. Medium strength basic sites (T D between 300 and 600 C) could be observed on both PB-Bi 2 WO 6 Fig. 3. SEM images in different magnification of PB-Bi2WO6 (A and C) and PB550-Bi2WO6 (B and D). Fig. 5. UV-vis DRS spectra and (Ah ) 1/2 -h curves (insert) of PB-Bi2WO6 and PB550-Bi2WO6. Fig. 6.Photoluminenscence spectra of PB-Bi2WO6 and PB550-Bi2WO6 with 420 nm excitation light. Fig. 7. CO2-TPD-MS results of PB-Bi2WO6 and PB550-Bi2WO6 from 30 C to 800 C. Fig. 8. (a) Real-time yield of CO and (b) accumulated CO production of PB-Bi2WO6 and PB550-Bi2WO6.(Conditions: 55 mg catalyst, 25 C reaction temperature, 2 mL/min 10 CO2 flow, 420-620 nm visible light irradiation, a through a water bubbler, b without through a water bubbler.) Fig. 10.(a) Real-time yield of CO using fresh PB550-Bi2WO6 and its regenerated samples by washing or annealing; (b) accumulated CO production in repeated using of PB550-Bi2WO6 through regeneration by washing with deionized water (Conditions: 65 mg catalyst originally, 120 C reaction temperature, 2 mL/min 10 CO2 flow without through a water bubbler, 420-620 nm visible light irradiation.) This research was financially supported by the Natural Science Foundation of Zhejiang Province (No. Z5100116), Changjiang Scholar Incentive Program (Ministry of Education, China, 2009), National Natural Science Foundation of China (No. 50808156). Supplementary material related to this article can be found, in the online version, at http://dx.doi.org/10.1016/j.apsusc.2014.07.153."
  }
]