[
  {
    "title": "Doi",
    "content": "10.1016/j.matlet.2019.127201"
  },
  {
    "title": "Article_Title",
    "content": "Synergetic effect of Bi2WO6 micro-spheres and activated carbon mm-spheres for enhancing photoreduction activity of CO2 to CO"
  },
  {
    "title": "Abstract",
    "content": "The lower CO 2 adsorption capacity and product selectivity have been two major obstacles for improving the efficiency of photocatalytic CO 2 reduction.In this work, activated carbon mm-spheres (ACSs), as excellent catalyst supporter with high CO 2 adsorption capacity and glorious electron migration efficiency, can effectively enhance the photocatalytic activity of Bi 2 WO 6 micro-spheres for CO 2 photoreduction to CO. Results demonstrate that, CO 2 adsorption capacity (97.8 mg g A1 ) of Bi 2 WO 6 /ACSs, is nearly 40 times higher than that (2.49 mg g A1 ) of pure Bi 2 WO 6 .Moreover, the CO yield of Bi 2 WO 6 /ACSs achieves 57.5 lmol g A1 h A1 , 2.25 times higher than that of Bi 2 WO 6 .After five consecutive runs, there is no obvious loss for the photocatalytic activity, recyclability and stability of Bi 2 WO 6 /ACSs.A possible enhanced photocatalysis mechanism is provided for further understanding the synergetic effect of Bi 2 WO 6 microspheres and ACSs.Our findings should give new insights and ideas to faultlessly design higher efficient catalysts for CO 2 to solar fuels."
  },
  {
    "title": "Experimental",
    "content": "Firstly, phenolic resin spheres as precursors were synthesized via thermal polymerization process, then heated to 800 C and activated in a tube furnace under N 2 and H 2 O(g) atmospheres to obtain https://doi.org/10.1016/j.matlet.2019.1272010167-577X/O 2019 Elsevier B.V. All rights reserved. E-mail address: zhangxiaochaotyut.edu.cn(X.Zhang). Contents lists available at ScienceDirect ACSs.Secondly, the tailored Bi(NO 3 ) 3 and Na 2 WO 4 solutions mixed together with ACSs in proportion to form a suspension that was transferred into autoclave and heated at 160 C for 24 h.Finally, the products were filtered, dried and annealed at 400 C to obtain Bi 2 WO 6 /ACSs.The crystalline structures, structural morphologies, electronic properties, surface chemical states and adsorption capacities of as-prepared samples were characterized via XRD, SEM, UV-vis DRS, XPS, PL and CO 2 adsorption isotherm.Besides, photocatalytic CO 2 reduction tests were carried out in CEL-SPH2N-D9 gas-closed circulation system (Beijing China Education Au-Light Co., Ltd.).(Supplementary information)"
  },
  {
    "title": "Results_and_Discussion",
    "content": "The XRD patterns of as-prepared samples are displayed in Fig. 1.All the main pattern peaks of Bi 2 WO 6 and Bi 2 WO 6 /ACSs, including (1 3 1), (0 0 2), (2 2 0), (1 3 3), (2 2 6), (4 0 0), (3 1 9), and (4 0 6) planes can correspond well to orthorhombic Bi 2 WO 6 (JCPDS card No.39-256), demonstrating that pure Bi 2 WO 6 can be synthesized, and the introduction of ACSs has no obvious effect on the crystal structure of Bi 2 WO 6 . The properties of materials used to be sensitive to their shape and size 9, Fig. 2 reveals the SEM images of the samples.The morphology structure of pure Bi 2 WO 6 composed of numerous irregular nanoplates (Fig. 2(a)).The sphericity of ACSs is substantially favorable with a diameter of 1.5 mm (Fig. 2(b)), and the inner pore structure possesses a well-developed feature from the crosssectional point of view (Fig. 2(c)).With the magnify of Bi 2 WO 6 / ACSs samples from Fig. 2(d-f), Bi 2 WO 6 can be uniformly supported on the ACSs surface, and such concave-convex surface of Bi 2 WO 6 / ACSs can effectively enhance the roughness compared with ACSs.In Fig. 2, there is has no obvious differences for Bi 2 WO 6 morphology, indicating that the introduction of ACSs cannot modify the initial morphology structure of Bi 2 WO 6 .Noted that the adsorption activity of catalyst used to be associated with its specific surface area, and that the bandgap value (E g ), the positions of valence band (VB) and conduction band (CB) are essential factors in determining the electronic mobility, which will have vital effects on the photocatalytic performance 10. It is found from Fig. 3(a) that the CO 2 adsorption capacity of Bi 2 -WO 6 /ACSs can reach 97.8 mg g A1 , nearly 40 times higher than that of single Bi 2 WO 6 (2.49 mg g A1 ) at 298 K and 1 atm, and much higher than reported data of 12.7 3 and 3.306 mg g A1 4, which should be primarily ascribed to the stronger specific surface area and well-developed pore structure of ACSs.Furthermore, compared with Bi 2 WO 6 , the Bi 2 WO 6 /ACSs exhibits an additional optical absorption due to the intrinsic characteristic absorption of ACSs, the absorption edge of Bi 2 WO 6 locates at 416 nm (Fig. 3(b)), corresponding to E g of 2.98 eV.The VB potential of Bi 2 WO 6 can be estimated to be 1.92 V via VB-XPS (Fig. 3(b)), and the CB potential of Bi 2 WO 6 should be calculated at A1.06 V, more negative than E 0 (CO 2 /CO) (A0.53 V) 5.In addition, the lower intensity of Bi 2 WO 6 /ACSs (Fig. 3(c)), indicating the higher electron-hole separation efficiency than Bi 2 WO 6 .As can be seen (Fig. 3(d)) that Bi 2 WO 6 /ACSs exhibits the best photocatalytic CO 2 reduction capacity of 57.5 lmol g A1 h A1 CO, 2.25 times higher than pure Bi 2 WO 6 (25.5 lmol g A1 h A1 ).However, single ACSs has no any photocatalytic activity for CO 2 reduction.The control experiments in the absence of either catalyst or light irradiation, filling with N 2 instead of CO 2 or without the introduction of CO 2 reveal that CO is not detected, which remarkably confirms that CO production is derived from CO 2 conversion in the reaction system under the combined action of catalyst and light rather than the adsorbate or impurity.Furthermore, there is no H 2 or CH 4 detected by GC.Moreover, the reduced amount of CO over Bi 2 WO 6 / ACSs was 7.8 after five consecutive runs, giving expression to an excellent photocatalytic stability.(Fig. 3(e)). To clearly expound the synergetic effect of Bi 2 WO 6 microspheres and activated carbon mm-spheres for enhancing photoreduction activity of CO 2 to CO, the possible mechanism of CO 2 photoreduction to CO in water phase over Bi 2 WO 6 /ACSs is presented to further understand the photogenerated charge transfer process.In Fig. 3(f), Bi 2 WO 6 can meet with the requirements of CO 2 reduction, but there is week effective separation of photogenerated carriers and insufficient CO 2 adsorption capacity, which significantly limits the rate of photocatalytic reduction of CO 2 .For Bi 2 WO 6 /ACSs, under simulated solar irradiation, photoinduced electrons (e -) are firstly excited to CB of Bi 2 WO 6 , and accordingly photoinduced holes (h ) are left in the maximum of VB, whereas e -in CB will transfer to ACSs with metal-like electronic properties 10.Furthermore, ACSs endowed with the stronger CO 2 adsorption capacity will provide an environment for higher concentrated CO 2 on the ACSs surface.The electrons, that migrate to ACSs form CB of Bi 2 -WO 6 , will activate the large amount of CO 2 adsorbed on ACSs, giving rise to CO, and the holes probably in VB of Bi 2 WO 6 will oxidize H 2 O molecules to produce O 2 and protons 10.Therefore, we conclude that the enhanced activity and stability of CO 2 photoreduction to CO over Bi 2 WO 6 /ACSs should be due to synergetic effect of Bi 2 WO 6 micro-spheres and ACSs with excellent CO 2 adsorption capacity and separation efficiency of photoinduced e A -h pairs."
  },
  {
    "title": "Conclusions",
    "content": "In summary, activated carbon mm-spheres (ACSs), as an excellent catalyst supporter endowed with superior CO 2 adsorption ability and admirable electrical conductivity, can effectively enhance the photocatalytic CO 2 photoreduction activity and stability of Bi 2 WO 6 micro-spheres, achieving the CO formation rate of 57.5 lmolg A1 h A1 , 2.25 times higher than single Bi 2 WO 6 in water phase under simulated sunlight irradiation without any cocatalyst.More importantly, the catalytic activity for original Bi 2 -WO 6 /ACSs composite system has no obvious attenuation even after five consecutive runs.In brief, ACSs, as perfect carriers for supporting photocatalysts, will open new opportunities to widely design a series of catalyst systems for highly efficient and robuster photocatalytic CO 2 reduction to solar fuels. Fig. 1.XRD patterns of ACSs, pure Bi 2 WO 6 and Bi 2 WO 6 /ACSs samples. G. Ren et al. / Materials Letters 264 (2020) 127201 The authors are thankful to the National Natural Science Foundation of China (No. 21978196, 21676178, 21706179) and Shanxi Province Science Foundation for Youths (201801D211008). The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://doi.org/10.1016/j.matlet.2019.127201."
  }
]