[
  {
    "title": "Doi",
    "content": "10.1039/d0nj04018e"
  },
  {
    "title": "Article_Title",
    "content": "Construction of a CsPbBr<sub>3</sub> modified porous g-C<sub>3</sub>N<sub>4</sub> photocatalyst for effective reduction of CO<sub>2</sub> and mechanism exploration"
  },
  {
    "title": "Abstract",
    "content": "In-depth research of the active sites and charge transport behavior is an important topic for investigating photocatalytic reduction of CO 2 .Herein, a novel photocatalyst composed of flake-like porous graphitic carbon nitride (P-CN) and CsPbBr 3 is fabricated via a high temperature calcination and freeze drying method.The experimental results show that P-CN/CsPbBr 3 has a superior CO 2 reduction efficiency, and that the yield of CO reaches 30.39 mmol g A1 , which is about 7.2 and 1.2 times higher than those of the primary B-CN (4.2 mmol g A1 ) and CsPbBr 3 (24.4mmol g A1 ), respectively.The improvement in photocatalytic performance is mainly ascribed to the heterostructure, which can promote the separation of photogenerated carriers, and the porous structure of P-CN, which can improve the absorption capacity of CO 2 .This study provides a significant method for the construction of efficient g-C 3 N 4 based photocatalysts to reduce CO 2 ."
  },
  {
    "title": "Experimental",
    "content": "The chemical reagents used in this experiment are melamine (99), dodecanol (99), sodium dodecyl sulfonate (98), gum arabic, Cs 2 CO 3 (99), octadecene (90), oleic acid (AR), PbBr 2 (99), oleylamine (C18: 80-90), and n-hexane (97), all purchased from Aladdin Chemistry Co., Ltd, while ethanol (C 2 H 5 OH, 95) is purchased from Sinopharm Chemical Reagent Co., Ltd.Deionized water is used throughout the whole experiment. 3.0 g of melamine is put into a crucible, and then transferred to a muffle furnace and calcined at 500 1C for 2 h.Afterwards, it is heated up to 550 1C for another 2 h with the heating rate of 2.3 1C min A1 .Finally, bulk g-C 3 N 4 (B-CN) is obtained. Initially, 0.3 g of Cs 2 CO 3 is added to a mixed solution containing 40 mL of octadecene and 2.5 mL of oleic acid, and dried under vacuum at 120 1C for 0.5 h.It is then heated to 150 1C until Cs 2 CO 3 reacts completely with oleic acid.After this, 0.21 g of PbBr 2 is dissolved into 15 mL of octadecene in another beaker.1.5 mL of oleylamine and 1.5 mL oleic acid are injected into the above solution.When the PbBr 2 is completely dissolved, the mixture is heated to 150 1C and 1.2 mL of Cs-oleate solution is quickly injected.30 s later, the mixture is cooled in an ice water bath.Finally, the product is washed in a centrifuge with n-hexane several times and dried at 40 1C for 12 h. In experiment 2.3, when PbBr 2 is completely dissolved, B-CN is poured into the mixture, and then the temperature is increased to 150 1C.The other steps are the same as experiment 2.3 to obtain B-CN/CsPbBr 3 .Subsequently, 0.5 mL of dodecanol, 0.2 g of sodium dodecyl sulfonate, 0.2 g of gum arabic and a certain amount of the above mixture are scattered in 10 mL of deionized water.After stirring at 60 1C for 20 min, the compound is frozen for 24 h.Subsequently, the mixture is placed in a vacuum freeze-drying machine to freeze for 24 h.After this, the samples are dried at 100 1C for 24 h.Finally, the products are washed in a centrifuge with ethanol several times and dried at 100 1C for 24 h.The content of B-CN/CsPbBr 3 is 0.05 g, 0.2 g, 0.3 g, and 0.4 g, respectively, and the samples with different contents are labeled as P-CN/CsPbBr 3 -1, P-CN/CsPbBr 3 -2, P-CN/ CsPbBr 3 -3, and P-CN/CsPbBr 3 -4.The method for preparing porous g-C 3 N 4 (P-CN) is the same as that of P-CN/CsPbBr 3 , except that B-CN/CsPbBr 3 is changed to B-CN. The crystal structure of the photocatalytic material was studied using a Bruker D8 X-ray diffractometer, equipped with a Cu-Ka radiation X-ray source, which was scanned in the range of 10-801 at a rate of 71 min A1 .The structure and chemical bonds of the molecule were studied by FT-IR (Magna-IR 550).The surface chemical valence state of the catalyst was studied by X-ray photoelectron spectroscopy (XPS, EScalab 250A).The morphology and structure of the materials were characterized by transmission electron microscopy (TEM, JEM2000-CX) nd scanning electron microscopy (SEM, JSM-7800F).The UV-visible diffuse reflectance spectroscopy of the photocatalytic materials was determined using a UV-visible diffuse reflectance spectrometer (UV-3600) with BaSO 4 as the standard substrate.The measurement range was 200-800 nm.The specific surface area and pore diameter of the photocatalytic materials were analyzed using an automatic specific surface and porosity analyzer (NDVA-2000e).The optical properties of the photocatalyst were analyzed using a photoluminescence detector. Photocatalytic CO 2 reduction in the liquid phase is performed in a custom-built glass reactor with a 300 mL volume.Cooling water from a chiller is passed through the jacketed wall of the reactor to control the temperature at 25 1C.A 300 W Xe lamp is used as a light source.First, 0.05 g of photocatalyst is dispersed in 100 mL of deionized water in a glass reactor under magnetic stirring.Before light irradiation, CO 2 gas is brought into the above solution for 10 min to eliminate air and to build up a saturated CO 2 solution.Subsequently, the lamp is turned on to start the photoreaction.During the reaction process, photocatalytic materials were taken from the enclosed light at 1 h intervals.The type and content of the product were measured every 1 h using a gas chromatography (GC-7920, China) detector.The isotope labeling experiment used 13 CO 2 instead of 12 CO 2 , and the products were analyzed by gas chromatography mass spectrometry (GC-MS, 7890A and 5975C, Agilent)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The microstructure and morphology of B-CN, P-CN, CsPbBr 3 and P-CN/CsPbBr 3 are researched by TEM.As illustrated in Fig. 1a, the obtained B-CN presents a massive structure with a smooth surface.However, the P-CN has an obvious porous structure (Fig. 1b), the distinctive structure being beneficial to its lightness and floatability, and once immersed in the precursor solution, not only can the solution flow in and out freely, but also the active substance can be deposited uniformly. 31,32otably, in Fig. 1c, CsPbBr 3 has an overlapping flake structure with a small average grain diameter of about 9 nm. 33,34n addition, it can be seen from Fig. 1d that CsPbBr 3 is evenly distributed and P-CN and CsPbBr 3 are fixed together.The intimate interface between CsPbBr 3 and P-CN makes the complex have an effective electron transfer passageway.The large specific surface area of P-CN/CsPbBr 3 (66.6725m 2 g A1 ) may result from the porous structure, which will provide more active sites for the reduction of CO 2 .In the HRTEM image (Fig. 1e), B-CN and CsPbBr 3 show clear lattice fringes with a lattice spacing of 0.31 nm and 0.29 nm, corresponding to (002) and (200) lattice faces, respectively.Additionally, the SEM images and EDX mapping spectrum of P-CN/CsPbBr 3 are displayed in Fig. S1 (ESI ), and C, N, Cs, Pb and Br elements, can be detected, which further proves the successful synthesis of P-CN/CsPbBr 3 . The structure and composition of the as-prepared photocatalyst were investigated by XRD characterization.As displayed in Fig. 2,B-CN shows two typical peaks at 13.11 and 27.41, corresponding to the (100) and (002) plane with a graphitic structure (JCPDS87-1526), respectively. 35,36 211) and (202) crystal planes, in accordance with JCPDS card No. 18-0364. 37For P-CN, the diffraction peak position is not obviously changed.Moreover, the XRD pattern of P-CN/ CsPbBr 3 is similar to that of P-CN, but the diffraction peak intensity is slightly weaker, which may originate from the low coordination content and the smaller size of CsPbBr 3 on the surface of P-CN, which is consistent with the above TEM analysis.Fig. 3A shows that the N 2 adsorption/desorption isotherms of all samples are type-IV curves with a H3 hysteresis loop, revealing that they all have the characteristics of a mesoporous structure.The specific surface areas of B-CN, CsPbBr 3 , P-CN and P-CN/CsPbBr 3 are 9.4, 18.4, 42.7 and 66.7 m 2 g A1 , respectively.The larger BET surface can provide more active sites and improve the mass transfer performance, which is conducive to enhancing the reducibility of CO 2 .The pore size of all the asprepared samples is 9.8, 7.1, 34.3, and 21.2 nm, respectively (Fig. 3B).The slight decrease in the pore size of P-CN/CsPbBr 3 may be caused by the CsPbBr 3 loaded on the surface of P-CN, and the close contact interface between CsPbBr 3 and P-CN may accelerate the electron transport. 37 The elements and surface chemical states of the as-prepared photocatalysts were determined using XPS.The XPS spectra of B-CN and P-CN/CsPbBr 3 (Fig. 4a) verify that C and N are the co-owned and predominant elements, while Cs, Br and Pb are unique elements of the as-prepared P-CN/CsPbBr 3 , indicating that the P-CN/CsPbBr 3 photocatalyst was successfully synthesized.Fig. 4b shows the C 1s spectrum of B-CN, possessing three types of carbon species located at 284.8, 286.1 and 288.2 eV, which are respectively associated with the adventitious type carbons (SP 3 , C-C), the sp 2 C atom on the aromatic ring connected with the -NH 2 group and the sp 2 -bonded carbon of NQC-N in the aromatic ring. 38,39Similarly, the C 1s peaks of P-CN/CsPbBr 3 are also fitted into three secondary peaks.It is worth noting that the peak strength of XPS corresponding to the C-C bond of P-CN/CsPbBr 3 is obviously enhanced, while the intensity of the sp 2 -bonded carbon is significantly weakened, which may be caused by CsPbBr 3 covering the surface of P-CN.The N 1s XPS spectrum of B-CN (Fig. 4c) can be decomposed into four separate peaks, and the binding energies at 398.4, 399.6, 401.2 and 404.1 eV are assigned to the sp 2 -hybridized nitrogen of the CQN-C functions, the N-(C) 3 tertiary nitrogen, C-NH 2 , and pi-pi (star transition), N-O nitrogens, respectively. 40,41s for P-CN/CsPbBr 3 , the peaks of N-(C) 3 and C-NH 2 left shift to 400.2 and 403.4 eV, which implies the combination of chemical bonds between P-CN and CsPbBr.It also indicates that there is a strong chemical and electronic coupling interaction between P-CN and CsPbBr 3 .According to Fig. 4d, the peaks at 724.4 and 738.2 eV are assigned to Cs 3d 3/2 and Cs 3d 5/2 of CsPbBr 3 in P-CN/CsPbBr.There are two characteristic peaks that appeared at 138.8 and 143.8 eV (Fig. 4e), corresponding to tetravalent Pb 4f 7/2 and Pb 4f 5/2 , respectively. 42In Fig. 4f, the binding energies of Br 3d in the P-CN/CsPbBr 3 composite are seated at 68.3 and 69.2 eV, belonging to Br 3d 5/2 and Br 3d 3/2 , respectively.In conclusion, the P-CN catalyst may form new chemical bonds with CsPbBr in P-CN/ CsPbBr 3 , which is helpful for the reduction reaction. Fig. 5 shows the FT-IR spectrum of the different as-prepared samples.For B-CN, the absorption peak range of 1200-1700 cm A1 is assigned to the typical stretching modes of C-N or CQN, and the signal at 806 cm A1 represents the vibration mode of the s-triazine unit. 43In addition, it can be seen from the spectra of P-CN that the absorption peaks are weakened and there are no other peaks, indicating that the P-CN is mainly composed of B-CN. 41Furthermore, the characteristic peak of CsPbBr 3 at 1759 cm A1 can correspond to the CQO stretching vibration band of oleic acid. 42The chemical bands at 2922 and 2857 cm A1 are ascribed to the antisymmetric stretching vibration of -CH 3 . 42oticeably, P-CN/CsPbBr 3 not only displays the characteristic absorption peaks of P-CN, but also shows the peaks of CsPbBr 3 .In comparison with P-CN, the characteristic peaks of 806 cm A1 and 1200-1700 cm A1 become stronger, which is beneficial for enhancing the reduction effect. The Raman spectra of the as-prepared samples are presented in Fig. S2 (ESI ).The Raman modes of D and G at 1232 and 1345 cm A1 are ascribed to the interlayer stacking structure of B-CN, and the characteristic peaks located at 489, 700 and 960 cm A1 are assigned to the vibration modes of B-CN 434445 (Fig. S2a, ESI ), and these stretching vibration characteristic peaks can also be detected in P-CN (Fig. S2b,ESI ).Furthermore, two peaks signaled at 147 and 320 cm A1 are attributed to the vibrational mode of PbBr 6 4A octahedra and motion of Cs cations (Fig. S2c, ESI ), respectively. 46The results are well matched with the previous literature.It is worth noting that the P-CN/CsPbBr 3 displays all the peaks mentioned above, but the vibration peak intensities are generally weakened owing to the small amount of CsPbBr 3 introduction, and its vibrations suppress the C-N and CQN stretching modes (Fig. S2d,ESI ).Compared with pure CsPbBr 3 , the peak at 320 cm A1 in P-CN/ CsPbBr 3 slightly shifts, which means the formation of a new chemical bond between CsPbBr 3 and P-CN.The chemical bond may be in favor of the transport of photogenerated carriers, and thus more conducive to the photocatalytic reaction of CO 2 . The optical absorption properties of the as-prepared samples were investigated by UV-vis DRS.In Fig. 6A,B-CN exhibits obvious absorption in the visible light region, with the absorption boundary at 450 nm, 45 while the absorption edge of CsPbBr 3 is position at 556 nm.In addition, the absorption edge of P-CN obviously shifts to 470 nm compared with B-CN, which may be caused by the pore structure confinement effect.However, the P-CN/CsPbBr 3 exhibits a similar absorption range compared to P-CN, which may be due to the little addition of CsPbBr 3 .Conclusively, the band gaps of B-CN, CsPbBr 3 , P-CN and P-CN/CsPbBr 3 are acquired according to the plots of (ahn) 1/2 vs. photon energy, 42 and the values are calculated to be 2.58, 2.23, 2.53 and 2.45 eV (Fig. 6B), respectively. The ability of carrier separation and recombination in the semiconductors is revealed.The PL spectra of B-CN, CsPbBr 3 , P-CN and P-CN/CsPbBr 3 at an excitation wavelength of 360 nm are depicted in Fig. 7a.It should be noted that the PL intensity of P-CN/CsPbBr 3 is higher than those of the other samples.The reason may result from the higher photocarrier concentration gathered on the P-CN/CsPbBr 3 surface, rather than the higher recombination rates of photoinduced electron-hole pairs. 47he charge transfer kinetics of B-CN, CsPbBr 3 , P-CN and P-CN/CsPbBr 3 are investigated by FL spectra (Fig. 7b), and the average fluorescence longevities are calculated to be 2.02, 1.72, 2.2 and 2.85 ns, respectively.The longer the lifetime of the photocarriers, the more likely they are to participate in the photocatalytic reaction of CO 2 and enhance the activity. 48Thus it can be seen that after CsPbBr 3 loading, the heterojunction has been successfully prepared, which can effectively prolong the lifetime of the photocarriers. 49he photocurrent responses of B-CN, CsPbBr 3 , P-CN and P-CN/ CsPbBr 3 are recorded to further reveal their photocatalytic properties.The photocurrent intensity of P-CN/CsPbBr 3 is obviously the highest, and is approximately 1.5 times higher than that of B-CN and 1.7 times higher in comparison with P-CN (Fig. 8A), respectively, indicating that the P-CN/CsPbBr 3 has the highest charge transfer ability.In order to further evaluate the separation ability of electron-hole pairs, EIS measurement has also been conducted (Fig. 8B).The arc radius of the Nyquist circle for P-CN/ CsPbBr 3 is smaller than that of P-CN, indicating that the introduction of CsPbBr 3 contributes to decreasing the interfacial electron transport barrier of P-CN/CsPbBr 3 , which implies more effective electron transfer capability, thus enhancing the photocatalytic activity. Fig. 9a shows the photocatalytic CO 2 reduction activities of B-CN, CsPbBr 3 , P-CN and P-CN/CsPbBr 3 under full spectrum irradiation.The CO yield of P-CN is 3.1 times higher than that of B-CN, and the flake porous structure is the main reason for the increase in activity.The photocatalytic CO 2 reduction activity of P-CN/CsPbBr 3 -2 is the highest (30.39 mmol g A1 ), and is 7.2 times, 2.4 times and 1.2 times the CO yields of B-CN, P-CN and CsPbBr 3 , respectively.The commendable performance is benefitted from the porous structure of the P-CN, improving the adsorption and mass transfer properties. 51Furthermore, the heterostructure interface between P-CN and CsPbBr 3 enables the photo-induced carriers to quickly separate, which makes more electrons participate in the reduction reaction, thus enhancing the photocatalytic CO 2 reduction activity. 52n addition, the photocatalytic performance of P-CN/CsPbBr 3 with different contents of CsPbBr 3 is depicted in Fig. 9b.It can be seen that P-CN/CsPbBr 3 -2 has the highest yield of CO (30.39 mmol g A1 ) compared with the other photocatalysts.However, the photocatalytic activity is not ideal with increasing CsPbBr 3 content.This phenomenon can be attributed to the over-modification of CsPbBr 3 covering some active sites, which hinders the charge transfer and light absorption.The activity tests of the above materials show that the synergistic effect of the porous structure of g-C 3 N 4 and CsPbBr 3 can effectively improve the reduction ability of CO 2 . Fig. S3 (ESI ) shows the stability of CO 2 conversion over P-CN/CsPbBr 3 -2 under 30 h of continuous light irradiation.The CO 2 reduction activity of P-CN/CsPbBr 3 -2 is not significantly reduced, and the yield is still around 27.50 mmol g A1 (Fig. S3a, ESI ), which indicates that P-CN/CsPbBr 3 -2 has superior photostability.In order to further verify the cycling stability of P-CN/ CsPbBr 3 -2, the structure of the samples before and after cycling was characterized by XRD analysis, and the results are shown in Fig. S3b (ESI ).As expected, the structure of the samples before and after cycling does not change much, indicating once again that P-CN/CsPbBr 3 -2 has excellent stability and reusability.Fig. S4 and S5 (ESI ) respectively exhibit the XPS, TEM and FESEM of P-CN/CsPbBr 3 after photoreduction of CO 2 , which also confirm the stability of P-CN/CsPbBr 3 .In addition, in order to demonstrate the source and content of the products in the process of CO 2 photoreduction, isotope tracing experiments were carried out by gas chromatography-mass spectrometry (GC-MS), and the results are shown in Fig. S6 (ESI ).It is observed that obvious signals appear at m/z 29 ( 13 CO) and m/z 28 ( 12 CO), which confirms that CO is derived from the photocatalytic reduction of CO 2 over P-CN/CsPbBr 3 . Based on the above analyses, the possible photocatalytic reduction of CO 2 mechanism and photogenerated carrier transfer path of P-CN/CsPbBr 3 is illustrated in Fig. 10.As the P-CN and CsPbBr 3 have well matched band structures, a heterojunction can be formed between P-CN and CsPbBr 3 .The electrons on the valence bands (VBs) of CsPbBr 3 and P-CN migrate to the corresponding conduction bands (CBs) under light illumination, resulting in the formation of electron-hole pairs.According to Fig. S7 andS8 (ESI ), when CsPbBr 3 contacts with P-CN to form a heterojunction structure, although the CB position of CsPbBr 3 (A0.75eV) is more negative than that of P-CN (A0.38 eV), and the VB position of P-CN (2.19 eV) is more positive than that of CsPbBr 3 (1.52 eV), the CB potential of P-CN is not negative enough to produce CO (A0.53 eV), and therefore it can be directly inferred that the two semiconductors form a Z-scheme heterojunction.The specific path of electron transfer is as follows: the electrons accumulated in the CB of P-CN will spontaneously transfer to the holes of CsPbBr 3 (eqn (1)-( 3)). 53Meanwhile, the CB potential of CsPbBr 3 (A0.75eV) is more negative than that of E y (CO 2 /CO) A0.53 eV, therefore CO 2 can be reduced to CO (eqn (4)).The photoinduced holes derived from P-CN can oxidize water to generate O 2 and H 54,55 (eqn (5)).This transfer mechanism is beneficial to inhibit the recombination of photocarriers and improve the photocatalytic performance of P-CN/CsPbBr 3 . CsPbBr 3 hn -CsPbBr 3 (e A h ) ("
  },
  {
    "title": "Conclusions",
    "content": "In summary, a porous g-C 3 N 4 heterojunction photocatalyst loaded with CsPbBr 3 (P-CN/CsPbBr 3 ) is successfully synthesized.In comparison with B-CN and CsPbBr 3 , the CO yield of P-CN/CsPbBr 3 is significantly increased to 0.3039 mmol g A1 , which is about 7.2 times and 1.2 times higher than that of B-CN and CsPbBr 3 , respectively.It should be admitted that the enhanced photocatalytic CO 2 reduction properties can be attributed to an accepted fact that the porous structure can increase the specific surface area, expose more active sites, and enhance the adsorption capacity of CO 2 .Meanwhile, the synergistic effect between the P-CN and CsPbBr 3 heterojunction can improve the carrier concentration and accelerate charge separation and transfer, which has been proved by photocurrent, PL, FL and EIS analysis.Therefore, our work offers a highly efficient photocatalyst for CO 2 reduction and provides a new perspective for the research on porous g-C 3 N 4 based catalysts. Furthermore, CsPbBr 3 exhibits several peaks at 14.91, 21.11, 26.31, 30.41, 37.41 and 43.41, which are ascribed to the (100), (110), (111), (200), ( Fig. 1 TEM images of (a) B-CN, (b) P-CN, (c) CsPbBr 3 and (d) P-CN/ CsPbBr 3 , and (e) HRTEM image of P-CN/CsPbBr 3 . Fig. 3 (A) N 2 adsorption-desorption isotherm, and (B) pore diameter distribution of (a) B-CN, (b) CsPbBr 3 , (c) P-CN and (d) P-CN/CsPbBr 3 . Fig. 5 FT-IR spectra of B-CN, CsPbBr 3 , P-CN and P-CN/CsPbBr 3 . Fig. 6 (A) UV-vis DRS and (B) band gaps of (a) B-CN, (b) CsPbBr 3 , (c) P-CN and (d) P-CN/CsPbBr 3 . Fig. 9 (a) Time courses of photocatalytic CO 2 evolution over different as-prepared samples, and (b) photocatalytic CO 2 evolution yields of different as-prepared samples under full spectrum irradiation. Fig. 10 Schematic diagram of the photocatalytic reduction of CO 2 over P-CN/CsPbBr 3 . This journal is The Royal Society of Chemistry and the Centre National de la Recherche Scientifique 2021 This work was financially supported by the National Natural Science Foundation of China (No. 21908080, 21871124), the Natural Science Foundation of Jiangsu Province (No. BK20190862, BK20 181231 and BK20180884) and the National Natural Youth Foundation of China (No. 21802002).All of the authors declare that they have no conflict of interest. There are no conflicts to declare."
  }
]