[
  {
    "title": "Doi",
    "content": "10.1016/j.jcou.2018.05.010"
  },
  {
    "title": "Article_Title",
    "content": "Sunfuels from CO2 exhaust emissions: Insights into the role of photoreactor configuration by the study in laboratory and industrial environment"
  },
  {
    "title": "Abstract",
    "content": "Direct photoconversion of CO 2 from exhaust emissions into fuels and chemicals is one of the most ambitious challenges to a greater and more effective use of the solar source.Through an extensive and systematic evaluation of CO 2 photoreduction process, both in aqueous media and in gas-vapour stream for over 120 h, this work addresses the role of the photoreactor configuration on the CO 2 reduction efficiency, leading the study from laboratory to industrial environment, probably for the very first time.Therefore, the performance of a continuously stirred \"semi-batch\" (SB) photoreactor, a packed-bed (PB) photoreactor and a multi-tubular (MT) photoreactor has been compared in term of efficiency, products distribution and available energy.The results of the photocatalytic tests demonstrate a strong influence of process conditions on the photocatalyst performance and on the reaction path.The packed-bed (PB) configuration reports a maximum \"apparent quantum efficiency\" of about 6.0 and a net thermal energy of 0.3 kW h/m 2 generated in 120 h."
  },
  {
    "title": "Experimental",
    "content": "A commercial TiO 2 sample (Mirkat M211) was used as reference photocatalyst, while a 0.5 wt CuO/TiO 2 system was obtained by the incipient wetness impregnation of the above TiO 2 sample with a 0.01 M aqueous solution of the Cu(NO 3 ) 2 precursor (Sigma-Aldrich, 99.99) 43.Powdered photocatalyst samples (100m) were used for tests in the semi-batch photoreactor, while the 40-70 mesh fraction was used in the packed-bed configuration tests.Finally, tests in Italcementi plant were performed by using the multi-tubular photoreactor configuration, equipped with Pyrex tubes (i.e. 4 mm of diameter) internally coated with the photocatalyst (0.25 mg/cm 2 ). Surface area (SA), pore volume (PV) and average pore diameter (APD) were obtained from nitrogen adsorption/desorption isotherms (77 K), using a fully automated gas adsorption device (ASAP 2020, Micromeritics Instrument).Physical adsorption isotherms were elaborated by standard BET and BJH methods for SA and PV evaluation, respectively.Before measurements, the samples were out-gassed at 150 C under vacuum (2 h). The TPR measurement of the photocatalyst sample (ca.60 mg) in the range of 100-600 C was performed using a linear quartz microreactor (i.d., 4 mm) fed with a 5 H 2 /Ar mixture flowing at 60 stp cm 3 min -1 and heated at the rate of 10 Cmin -1 .The H 2 consumption was monitored by a TCD quantitatively calibrated with commercial CuO standard.Under such conditions, TPR was reliable and accurate in terms of both peak position ( 5 C) and hydrogen consumption ( 5) 444546. XRD analysis of powder samples in the 2 range of 5-80were performed by a Philips X-Pert diffractometer operating with Ni -filtered Cu K radiation at 40 kV and 30 mA, at a scan rate of 0.5min -1 .The mean crystallite size of TiO 2 was estimated using Scherrer's equation: where d cs is the crystallite size, k is a constant ( 0.9 assuming that the particles are spherical), is the full width at half maxima (FHWM) of the diffraction peak, and is the Bragg's diffraction angle. UV-Vis spectra were recorded in the range of 200-800 nm using an Agilent Cary 5000 UV-vis-NIR spectrophotometer with a diffuse reflectance accessory.Diffuse reflectance spectra were obtained using Kubelka-Munk function of where R is reflectance ().Then, the band gap energies of samples were valued from the extrapolation of Tauc plot, obtained from the equation: where A is a constant, h is photon energy, E g is the allowed energy gap, n 0.5 for allowed direct transition and n 2 for allowed indirect transition 47. The same OSRAM 300 W lamp ULTRA-VITALUX set at the distance of 30 cm was used for the laboratory tests, while in the industrial relevant environment the photocatalytic measurement was carried out with a proportionally higher number of the same lamps, due to the greater exposure of the surface of the MT photo-reactor.The UVA optical power was measured 285 W/m 2 , employing an R-752 Universal Radiometer Readout with sensor DIGIRAD model PH-30.Assuming a wavelength of 388 nm (i.e.corresponding to an energy gap of 3.2 eV, typical of TiO 2 materials), the total radiation flux (q sup ) was estimated to be 9.24 10 -4 einsteinm -2 s -1 . 2.3.1.Tests in laboratory 2.3.1.1.SB photoreactor configuration.Tests in water-media were carried out at room temperature by the use of 1 L continuously stirred \"semi-batch\" (SB) photoreactor, with a round quartz window (i.d.80 mm; 1 mm of thickness) for the light irradiation (Fig. 1A).The photocatalytic tests were performed by feeding 20.0 stp ccmin -1 of a gas mixture of 92 CO 2 (8 N 2 used as internal standard for analysis), loading 1.5 g of photocatalyst and 600 ml of K 2 CO 3 solution 0.1 M.At scheduled intervals of time, the reaction liquid was sampled and analyzed by a flame ionization detector (FID) of GC model Agilent 7890 A, equipped with an auto-sampler tower, model Agilent G4513 A. The conversion of CO 2 was online monitored by GC using thermal conductivity detector (TCD) directly connected to the photoreactor.Therefore, Argon (TCD) or Helium (FID) were fed as carrier gasses.The \"sensitive factors\" of each compound were determined for the calibration of the GC signals by using several standards. Tests in gas-stream were carried out at room temperature using a micro-plant with an array of three packed-bed (PB) quartz photoreactors, flowing continuously 20.0 stp ccmin -1 of 90 gas mixture (i.e.92 CO 2 /N 2 ) and 10 of H 2 O vapour at the saturated pressure of 46 C, heating pipe-lines at 50 C in order to avoid water condensation, Fig. 1B.The photocatalytic tests were performed with 1.5 g of photocatalyst.The composition of the outlet stream was analyzed by Agilent 7890 A gas chromatograph (GC), equipped with a flame ionization (FID) and a thermal conductivity (TCD) detectors, and by Thermo-ONIX Pro-Lab Quadrupole Mass Spectrometer (QMS), for the detection of not ionisable compound compounds.The GC analytical system was composed by a double column (i.e.Molecular Sieves and a Poropak-Q) connected to TCD for the analysis of permanent gas, while a capillary column (30 m x 0.32m x 0.53m) model Phenomenex Zebron Wax-plus, directly connected to FID, was used for the hydrocarbons quantification.Therefore, Argon (TCD) or Helium (FID) were fed as carrier gasses.The \"sensitive factors\" of each compound were determined for the calibration of the GC signals by using several standards. For the demonstration proof in an industrially relevant environment (Bergamo factory, Italcementi S.p.A.), the photocatalytic tests were carried out in an innovative purpose-built system, consisting of two integrated sections.The first section is a gas treatment unit for the cleaning of exhaust emissions and the enrichment of CO 2 content up to 60-80 by means of innovative membranes, while the second section is the photoreactor unit, consisting of the chamber for the photoreduction of CO 2 , equipped with an array of \"Multi-Tubular\" (MT) photoreactors, including 20 Pyrex reactor tubes (i.d., 4 mm; l., 700 mm) connected in series (Fig. 1C).The tests were conducted in continuous mode, feeding a 60 CO2/N2 stream at 60-70 of relative humidity (RH).The composition of the gas phase was monitored online by a micro-GC system (MyGC Fast Gas Analyzer). The conversion of CO 2 (X CO2 , ) was calculated by GC-TCD analysis, according to the following equation: where: q sup is the is the total radiation flux of the lamp (9.24 10 -4 einsteinm -2 s -1 , see in the section 2.2.5 Optical-power determination), and S is the reaction selectivity defined as: where: S i is the fractional selectivity of i-th product, and n i is the inverse of the charge carrier species required to obtain the specific iproduct (i.e.1/6 for methanol, 1/8 for methane and 1/2 for carbon monoxide).Therefore, the efficiency of the different systems to convert radiation energy into chemical energy were calculated as follows: where: E c is the thermal energy generated per square meter of photoreactor by products combustion and E i is the net UVA energy emitted by radiation source. The main physical-chemical properties of the TiO 2 and Cu-TiO 2 photocatalysts are summarized in Table 1.The commercial TiO 2 sample is characterized by a total surface area of ca.300m 2 g -1 and a Band Gap of 3.24 eV, featuring an XRD pattern that is typical of a crystalline Anatase phase (Fig. 2), with an average crystallite size of 13 nm 52. An analogous XRD pattern (Fig. 2), along with no significant changes in the textural properties (Table 1), discloses a minor influence of the Cu addition on the main physico-chemical properties of the TiO 2 semiconductors.Despite the lack of additional reflexes of the Cu phase, however, the effect of doping on the reactivity of titania is evident from 0.2 eV decrease in the bad gap of the Cu-TiO 2 with respect to the pure TiO 2 (Table 1 and Fig. S1). The reduction characteristics of the studied materials have been also probed by TPR measurements (Fig. 3).TiO 2 sample shows a slight hydrogen consumption in the range of 250-500 C, denoting an incipient reduction of surface Ti 4 ions 53.Whereas, the Cu-TiO 2 catalyst features two well resolved peaks centred at 220 C and 280 C, accounting for the reduction of isolated Cu 2 ions and amorphous copper oxide patches to metal Cu, respectively 444546. For the sake of comparison, the main activity data of the photocatalysts in the different photoreactor configurations are summarized in Table 2.A significant promoting effect of the Cu-doping on the intrinsic photoactivity of the TiO 2 semiconductor is evident from higher CO 2 conversion rates attained by the Cu-TiO 2 system, irrespective of the photoreactor configuration.In particular, in the SB configuration TiO 2 and Cu-TiO 2 catalysts attain maximum conversion values in 2 h of ca.0.1 and 0.4, respectively, showing afterward a similar deactivation trend along the 120 h of irradiation, which leads to almost zero photoactivity in about 8 h, prefiguring a significant corrosive effect of water 41,42. On the other hand, the process selectivity is rather insensitive to the Cu-doping, since methanol is the only product formed by both photocatalytic systems in the SB photoreactor (Table 2).Accordingly, methanol rate profiles comparable to conversion ones indicate peak values of 22 and 4molg cat -1 h -1 for Cu-TiO 2 and TiO 2 photocatalysts, respectively (Fig. 4B). Considering that one of important limits of the three-phase photoreaction is the dissolution of CO 2 in the aqueous solution 10, and that the catalyst recovery is an additional drawback for operations in tankphotoreactors 13,51, the fixed-bed gas-phase photoreactor configuration looks more attractive, also for the expected positive effects on photocatalyst stability.On this account, a packed-bed (PB) photoreactor was realized to assess the role of the photoreactor configuration on the efficiency of the photoreduction process.The results are shown in Figs. 5 and6.After an induction period of ca. 10 h, TiO 2 drives an average CO 2 conversion of 0.4, keeping stable during the whole irradiation time (120 h).By contrast, the Cu-TiO 2 catalyst attains steadystate-conditions after 90 h, featuring a conversion peak of 1.5 at 60 h of irradiation, before reaching the plateau value of about 0.78 (Fig. 5), comparing to the 0.4 value of the SB photoreactor.Besides to a strong inhibition of the deactivation pattern observed in the SB configuration (Fig. 4), the photoreduction process in the gas phase affects the selectivity of the photocatalysts (Table 2).In fact, in this case the TiO 2 sample mostly promotes the formation of methane, with a stable rate of 9molg cat -1 h -1 that is circa twofold the methanol productivity.At variance, the Cu-TiO 2 sample shows a low rate of methane formation (3molg cat -1 h -1 ), and a much higher methanol productivity attaining a maximum value of 47molg cat -1 h -1 at 60 h of irradiation.Trace amounts ( 1) of formaldehyde, acetaldehyde and ethanol were further detected (Table 2). In this respect, literature studies with batch or semi-batch reactor indicate controversial results 2627282931,37, since the CO 2 photoreduction process in water implies a variable reaction network, because of the huge number of possible reactions and of electrons transferred between photogenerated carriers and species inside the reaction system 14: Therefore, thermodynamic more than kinetic factors could explain the above selectivity pattern.Indeed, methanol and methane are the most favourable products because of lower reduction potentials (see half-reactions 11 and 12), although, the rates of formation of methanol and methane are kinetically slower than that of formaldehyde, CO and formic acid, because of the greater number of electrons-protons required (see half-reactions 8-10). The tests in the Italcementi factory (Bergamo, Italy) have been performed on 60 CO 2 /N 2 stream, obtained by purification and Table 2 Results of photocatalytic tests in laboratory and industrial environments: selectivity, highest formation rates under UVA 285 W/m 2 irradiation and net hydrocarbon (NH) and carbon monoxide (CO) yield in 120 h.The laboratory findings have shown much lower efficiency and stability of the photoreduction process in the SB configuration with respect to the gas phase PB reactor.On the other hand, the PB is affected by a poor irradiation efficiency and photocatalyst exploitation, due to the limited penetration of light radiation in the photocatalytic bed 41.In order to enhance the irradiation efficiency, the tubular photoreactors of the MT configuration have been internally coated with a thin film of the Cu-TiO 2 photocatalyst, thus reducing the loading of photocatalyst per unit of irradiated surface. The results are somewhat surprising, since methanol evolution is not observed, while methane and carbon monoxide are the only detected products, irrespective of the water content of the reaction mixture.However, a slight enrichment of water in the stream drives to a considerable improvement of the productivity, also boosting the formation of methane (Fig. 7).In fact, a two folds increase of the overall reaction rate from 40 to 80molg cat -1 h -1 is recorded at the higher 70 of relative humidity.Moreover, the methane selectivity rises from 20 to 50, corresponding to a formation rate of 40molg cat and 38molg cat -1 h -1 for CO and CH 4 , respectively. In terms of reactor photoactivity per gram of photocatalyst, the performance of MT photoreactor is greater than that of laboratory, however, the product yield per unit of reactor surface is notably lower, considering its larger irradiated surface, Table 3. The above experimental results indicate that properties of the photocatalyst, reaction environment and reactor configuration altogether determine the efficiency of the CO 2 photoreduction process, both in terms of rate and selectivity 13141516.Moreover, it is evident a significant promoting effect of the Cu-doping on the photoactivity of titania, regardless of the process conditions and reactor design.Aside from being an electron trap preventing the electron-hole pairs recombination and an improver of the electron transfer during the holeelectron generation process 24,262728293031323354, the key role played by copper can be further ascribed to a combination of different effects, such as the electronic promotion, as demonstrated by the decrease of the band-gap energy (Table 1) and by the larger electron mobility consequent to the improved redox properties (Fig. 3).In addition, the Cu-promoter may enhance the CO 2 adsorption on the photocatalyst surface, as in the methanol synthesis via CO 2 hydrogenation 44454655. In fact, on the Cu-TiO 2 system the methanol formation might involve highly dispersed Cu ions across the semiconductor surface and/or Cu-O-Cu 1 species in interaction with TiO 2 phase, these being strongly hindered in presence of water 27,44.The volcano shaped trend in photoactivity (Figs. 5 and6), supports the occurrence of degradationreconstruction processes of the active sites, although competitive adsorption of reagents, products and intermediates can further explain the catalyst deactivation pattern 56,57.On the other hand, the different process conditions of the industrial test modify the CO 2 photoreduction pattern.Indeed, the total length (14 m) of the photoreactor ensures a very high residence-time of reagents and products, likely favouring the further reduction of methanol to methane and/or its decomposition to CO and H 2 58.Furthermore, low photocatalyst loading and low water content of the reaction mixture, may affect the productivity and selectivity distribution.Even the high temperature reached in the MT photoreactor (70-90 C), might hinder the condensation/adsorption of water on the inner surface of photoreactor tubes.At variance, higher water content and photocatalyst load determine water condensation in the PB photoreactor, further accounting for the different process performance of the MT and PB configurations.In fact, a greater availability of H 2 can promote hydrogenation reactions, leading to the formation of light hydrocarbons (i.e.formic acid and methanol), according to a hydrogenation mechanism 59,606162.On the other hand, hindering the generation of hydrogen, the photoreduction can drive to CO via a deoxygenation mechanism 59, in agreement with a limited number of electrons and protons available 636465.In addition, proton-assisted multi-electron transfer mechanism (MET) can also favour the formation of methanol and hydrocarbons at the photocatalyst surface in the systems at larger water availability (i.e.SB and PB photoreactors), because of the higher protons accessibility 36,63646566. On this account, high residence time of reagents and products likely explain the formation of the most stable methane and CO molecules in the MT configuration 35.Beside to the product selectivity, the reactor configuration is decisive for activity and stability of the photocatalyst.Indeed, the SB configuration is detrimental for the overall process productivity also because of the occurrence of relevant deactivation phenomena.As a consequence, the net hydrocarbon yields during 120 h of irradiation is two orders lower in the liquid phase (SB) than in gas-phase, for both titania and Cu-TiO 2 photocatalysts (Table 2).Then, the thermal energy generable through the combustion of the products is directly related to the photoreactor performance, in term of efficiency, yield and energy density of fuels products.In this regard, in 120 h the photoreactor PB obtains fuel products equivalent to an energy of 315 W h/m 2 , which is a value almost 60 fold higher than that of SB and MT photoreactors (ca. 5 W h/m 2 ), stressing out the role of photocatalyst stability and the effectiveness of photoreactor, Table 3. Even in terms of efficiency of light radiation exploitation, the PB configuration achieves remarkable results with Cu-TiO 2 photocatalyst, reporting 2.36 of AQE and 5.70 as peak (AQE max ), driving to a net system efficiency of 0.046 () and 0.1 ( max ), Table 3.In comparison, SB photoreactor marks 1.19 of AQE max and 0.034 of AQE, reflecting also the lower efficiency of the system, 0.001 () and 0.05 ( max ), due in part to the shorter \"life-time\" of photocatalysts (i.e. 10 h). MT photoreactor shows the lowest energy efficiency, pointing out the low photocatalyst load with respect to the irradiated surface.In fact, MT configuration reports the lowest quantum efficiency value (i.e.0.063 of AQE max and 0.025 of AQE), which also leads to a very modest system efficiency (i.e.0.012 of and 0.03 of max ,) and a minor thermal energy value, Fig. 8 and Table 3.Therefore, the values of quantum efficiency here reported are comparable with the best ones referred to in the literature 11,27,29,30,51,68 and in many case are placed at high level if it is considered the difference in the process condition, calculation and duration of tests (over 120 h).In particular, Ola et al. 51 indicates a quantum efficiency of 0.047 during 12 h of irradiation for internally illuminated monolith photoreactor, while AQE value between 5 and 20 were obtained in 6 h by Slamet et al. 27 and Tseng et al. 68, although the authors consider the photon fraction adsorbed by photocatalyst only. Then, the practical conversion of solar energy into chemical energy appear far from a commercial application, especially in comparison with photovoltaic technology achievement.Nowadays, the photovoltaic panel generates at AM 1.5 a net power of 180 W/m 2 .Reaching 100 of quantum efficiency the photoreactor could produce about 110mmolm -2 h -1 of methanol fuel, in the same irradiation condition, equivalent to 20 W/m 2 of thermal energy generable by combustion.In this study, we have obtained about 32mmolm -2 h -1 of fuel product with a 5 fold higher irradiation (UVA 285 W/m 2 ) than that of the sun.Therefore, to be the photoreduction technology industrially accessible, besides to improve photocatalyst quantum efficiency, the main efforts will have to be devoted to develop efficient solar dishes and to enlarge the radiation adsorbed by photocatalyst which is actually only 3.4 of total solar spectrum 69,70. One of the main technological limit in CO 2 utilization for energetic purposes via the photoreduction process is still the low efficiency in solar energy exploitation.In respect of this, we have obtained about 32mmolm -2 h -1 of fuel product, marking a step forward in the route of industrial gap reducing.Then, photoreduction technology has been validated in the laboratory for over 120 h, while test in a relevant industrial environment have lead to the overcoming of the technological demonstration. Therefore, the efficiency of \"conversion-storage\" of the solar energy is affected by photocatalyst behaviour, photoreactor configuration, reaction environment and process conditions.Besides the different stability showed by photocatalytic materials in the diverse reaction environment, our findings stress out the greater effectiveness of PB approach.As proof of this, the performance in the water-phase is two orders lower than that in gas-vapour stream, resulting the \"packed bed\" configuration the most performing technical choice in terms of energetic yield, process control and quantum efficiency.PB photoreactor achieves about 6 of AQE max and a fuel with an equivalent thermal energy of 315 W h/m 2 . This study proves the practical feasibility of CO 2 exploitation from exhaust emissions, although the economical valorisation of photoreduction process needs further improvement in the process-engineering design and progress in the development of more stable and active photocatalytic materials, which will be the most challenging aspects of the next future. the products distribution was established by GC-FID analysis, according to the relative \"sensitive factors\" of each compound.Apparent quantum efficiency (AQE) has been calculated, considering negligible light adsorption by reactants/products and valuing the net radiation flux reaching the surface of photoreactor and, thus, impinging on the photocatalyst, according to the following equation48495051: Fig. 1.Schematic of experimental setup: continuously stirred \"semi-batch\" (SB) photoreactor configuration (A), packed-bed (PB) photoreactor configuration (B), \"multi tubular\" (MT) photoreactor array (C). Fig. 2. XRD analysis of TiO 2 and Cu-TiO 2 photocatalysts. Fig. 3. TPR profiles of TiO 2 and Cu-TiO 2 photocatalysts. Fig. 4. Results of CO 2 photocatalytic tests carried out in the semi-batch (SB) photoreactor UVA 285 W/m 2 irradiation: time dependence on carbon dioxide conversion (A) and on the methanol formation rate (B) over TiO 2 and Cu-TiO 2 photocatalysts. Fig. 5. Results of CO 2 photocatalytic tests carried out in packed-bed (PB) photoreactor UVA 285 W/m 2 irradiation: carbon dioxide conversion vs. irradiation time over TiO 2 and Cu-TiO 2 samples. Fig. 6. Results of CO 2 photocatalytic tests carried out in packed-bed (PB) photoreactor UVA 285 W/m 2 irradiation: time dependence on methanol formation rate (A) and methane formation rate (B) over TiO 2 and Cu-TiO 2 samples. Fig. 7. Results of photocatalytic tests carried out in the multi-tubular (MT) photoreactor UVA 285 W/m 2 irradiation: influence of the relative humidity in the gas stream on product formation rate. Total radiation flux (Einstein/m 2 s).c Thermal energy generable through the combustion of the products formed in 120 h under UVA 285 W/m 2 irradiation, considering c H s CH3OH 7.310 5 J/ mol, c H s CH4 8.910 5 J/mol, c H s CO 2.810 5 J/mol 67. List of photocatalysts with physical and chemical properties. Efficiency and productivity of the different photoreactors. a Consider Planar geometry. Activity was carried out under the financial support of the Italian Ministry of Research and EU grant, PON Ricerca, Sviluppo e Competitivita.Fig. 8.Comparison of the performance of the different photoreactor configurations in terms of product formation rate and apparent quantum efficiency UVA 285 W/m 2 irradiation. Appendix A. Supplementary data Supplementary material related to this article can be found, in the online version, at doi:https://doi.org/10.1016/j.jcou.2018.05.010."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The main physical-chemical properties of the TiO 2 and Cu-TiO 2 photocatalysts are summarized in Table 1.The commercial TiO 2 sample is characterized by a total surface area of ca.300m 2 g -1 and a Band Gap of 3.24 eV, featuring an XRD pattern that is typical of a crystalline Anatase phase (Fig. 2), with an average crystallite size of 13 nm 52. An analogous XRD pattern (Fig. 2), along with no significant changes in the textural properties (Table 1), discloses a minor influence of the Cu addition on the main physico-chemical properties of the TiO 2 semiconductors.Despite the lack of additional reflexes of the Cu phase, however, the effect of doping on the reactivity of titania is evident from 0.2 eV decrease in the bad gap of the Cu-TiO 2 with respect to the pure TiO 2 (Table 1 and Fig. S1). The reduction characteristics of the studied materials have been also probed by TPR measurements (Fig. 3).TiO 2 sample shows a slight hydrogen consumption in the range of 250-500 C, denoting an incipient reduction of surface Ti 4 ions 53.Whereas, the Cu-TiO 2 catalyst features two well resolved peaks centred at 220 C and 280 C, accounting for the reduction of isolated Cu 2 ions and amorphous copper oxide patches to metal Cu, respectively 444546. For the sake of comparison, the main activity data of the photocatalysts in the different photoreactor configurations are summarized in Table 2.A significant promoting effect of the Cu-doping on the intrinsic photoactivity of the TiO 2 semiconductor is evident from higher CO 2 conversion rates attained by the Cu-TiO 2 system, irrespective of the photoreactor configuration.In particular, in the SB configuration TiO 2 and Cu-TiO 2 catalysts attain maximum conversion values in 2 h of ca.0.1 and 0.4, respectively, showing afterward a similar deactivation trend along the 120 h of irradiation, which leads to almost zero photoactivity in about 8 h, prefiguring a significant corrosive effect of water 41,42. On the other hand, the process selectivity is rather insensitive to the Cu-doping, since methanol is the only product formed by both photocatalytic systems in the SB photoreactor (Table 2).Accordingly, methanol rate profiles comparable to conversion ones indicate peak values of 22 and 4molg cat -1 h -1 for Cu-TiO 2 and TiO 2 photocatalysts, respectively (Fig. 4B). Considering that one of important limits of the three-phase photoreaction is the dissolution of CO 2 in the aqueous solution 10, and that the catalyst recovery is an additional drawback for operations in tankphotoreactors 13,51, the fixed-bed gas-phase photoreactor configuration looks more attractive, also for the expected positive effects on photocatalyst stability.On this account, a packed-bed (PB) photoreactor was realized to assess the role of the photoreactor configuration on the efficiency of the photoreduction process.The results are shown in Figs. 5 and6.After an induction period of ca. 10 h, TiO 2 drives an average CO 2 conversion of 0.4, keeping stable during the whole irradiation time (120 h).By contrast, the Cu-TiO 2 catalyst attains steadystate-conditions after 90 h, featuring a conversion peak of 1.5 at 60 h of irradiation, before reaching the plateau value of about 0.78 (Fig. 5), comparing to the 0.4 value of the SB photoreactor.Besides to a strong inhibition of the deactivation pattern observed in the SB configuration (Fig. 4), the photoreduction process in the gas phase affects the selectivity of the photocatalysts (Table 2).In fact, in this case the TiO 2 sample mostly promotes the formation of methane, with a stable rate of 9molg cat -1 h -1 that is circa twofold the methanol productivity.At variance, the Cu-TiO 2 sample shows a low rate of methane formation (3molg cat -1 h -1 ), and a much higher methanol productivity attaining a maximum value of 47molg cat -1 h -1 at 60 h of irradiation.Trace amounts ( 1) of formaldehyde, acetaldehyde and ethanol were further detected (Table 2). In this respect, literature studies with batch or semi-batch reactor indicate controversial results 2627282931,37, since the CO 2 photoreduction process in water implies a variable reaction network, because of the huge number of possible reactions and of electrons transferred between photogenerated carriers and species inside the reaction system 14: Therefore, thermodynamic more than kinetic factors could explain the above selectivity pattern.Indeed, methanol and methane are the most favourable products because of lower reduction potentials (see half-reactions 11 and 12), although, the rates of formation of methanol and methane are kinetically slower than that of formaldehyde, CO and formic acid, because of the greater number of electrons-protons required (see half-reactions 8-10). The tests in the Italcementi factory (Bergamo, Italy) have been performed on 60 CO 2 /N 2 stream, obtained by purification and Table 2 Results of photocatalytic tests in laboratory and industrial environments: selectivity, highest formation rates under UVA 285 W/m 2 irradiation and net hydrocarbon (NH) and carbon monoxide (CO) yield in 120 h.The laboratory findings have shown much lower efficiency and stability of the photoreduction process in the SB configuration with respect to the gas phase PB reactor.On the other hand, the PB is affected by a poor irradiation efficiency and photocatalyst exploitation, due to the limited penetration of light radiation in the photocatalytic bed 41.In order to enhance the irradiation efficiency, the tubular photoreactors of the MT configuration have been internally coated with a thin film of the Cu-TiO 2 photocatalyst, thus reducing the loading of photocatalyst per unit of irradiated surface. The results are somewhat surprising, since methanol evolution is not observed, while methane and carbon monoxide are the only detected products, irrespective of the water content of the reaction mixture.However, a slight enrichment of water in the stream drives to a considerable improvement of the productivity, also boosting the formation of methane (Fig. 7).In fact, a two folds increase of the overall reaction rate from 40 to 80molg cat -1 h -1 is recorded at the higher 70 of relative humidity.Moreover, the methane selectivity rises from 20 to 50, corresponding to a formation rate of 40molg cat and 38molg cat -1 h -1 for CO and CH 4 , respectively. In terms of reactor photoactivity per gram of photocatalyst, the performance of MT photoreactor is greater than that of laboratory, however, the product yield per unit of reactor surface is notably lower, considering its larger irradiated surface, Table 3. The above experimental results indicate that properties of the photocatalyst, reaction environment and reactor configuration altogether determine the efficiency of the CO 2 photoreduction process, both in terms of rate and selectivity 13141516.Moreover, it is evident a significant promoting effect of the Cu-doping on the photoactivity of titania, regardless of the process conditions and reactor design.Aside from being an electron trap preventing the electron-hole pairs recombination and an improver of the electron transfer during the holeelectron generation process 24,262728293031323354, the key role played by copper can be further ascribed to a combination of different effects, such as the electronic promotion, as demonstrated by the decrease of the band-gap energy (Table 1) and by the larger electron mobility consequent to the improved redox properties (Fig. 3).In addition, the Cu-promoter may enhance the CO 2 adsorption on the photocatalyst surface, as in the methanol synthesis via CO 2 hydrogenation 44454655. In fact, on the Cu-TiO 2 system the methanol formation might involve highly dispersed Cu ions across the semiconductor surface and/or Cu-O-Cu 1 species in interaction with TiO 2 phase, these being strongly hindered in presence of water 27,44.The volcano shaped trend in photoactivity (Figs. 5 and6), supports the occurrence of degradationreconstruction processes of the active sites, although competitive adsorption of reagents, products and intermediates can further explain the catalyst deactivation pattern 56,57.On the other hand, the different process conditions of the industrial test modify the CO 2 photoreduction pattern.Indeed, the total length (14 m) of the photoreactor ensures a very high residence-time of reagents and products, likely favouring the further reduction of methanol to methane and/or its decomposition to CO and H 2 58.Furthermore, low photocatalyst loading and low water content of the reaction mixture, may affect the productivity and selectivity distribution.Even the high temperature reached in the MT photoreactor (70-90 C), might hinder the condensation/adsorption of water on the inner surface of photoreactor tubes.At variance, higher water content and photocatalyst load determine water condensation in the PB photoreactor, further accounting for the different process performance of the MT and PB configurations.In fact, a greater availability of H 2 can promote hydrogenation reactions, leading to the formation of light hydrocarbons (i.e.formic acid and methanol), according to a hydrogenation mechanism 59,606162.On the other hand, hindering the generation of hydrogen, the photoreduction can drive to CO via a deoxygenation mechanism 59, in agreement with a limited number of electrons and protons available 636465.In addition, proton-assisted multi-electron transfer mechanism (MET) can also favour the formation of methanol and hydrocarbons at the photocatalyst surface in the systems at larger water availability (i.e.SB and PB photoreactors), because of the higher protons accessibility 36,63646566. On this account, high residence time of reagents and products likely explain the formation of the most stable methane and CO molecules in the MT configuration 35.Beside to the product selectivity, the reactor configuration is decisive for activity and stability of the photocatalyst.Indeed, the SB configuration is detrimental for the overall process productivity also because of the occurrence of relevant deactivation phenomena.As a consequence, the net hydrocarbon yields during 120 h of irradiation is two orders lower in the liquid phase (SB) than in gas-phase, for both titania and Cu-TiO 2 photocatalysts (Table 2).Then, the thermal energy generable through the combustion of the products is directly related to the photoreactor performance, in term of efficiency, yield and energy density of fuels products.In this regard, in 120 h the photoreactor PB obtains fuel products equivalent to an energy of 315 W h/m 2 , which is a value almost 60 fold higher than that of SB and MT photoreactors (ca. 5 W h/m 2 ), stressing out the role of photocatalyst stability and the effectiveness of photoreactor, Table 3. Even in terms of efficiency of light radiation exploitation, the PB configuration achieves remarkable results with Cu-TiO 2 photocatalyst, reporting 2.36 of AQE and 5.70 as peak (AQE max ), driving to a net system efficiency of 0.046 () and 0.1 ( max ), Table 3.In comparison, SB photoreactor marks 1.19 of AQE max and 0.034 of AQE, reflecting also the lower efficiency of the system, 0.001 () and 0.05 ( max ), due in part to the shorter \"life-time\" of photocatalysts (i.e. 10 h). MT photoreactor shows the lowest energy efficiency, pointing out the low photocatalyst load with respect to the irradiated surface.In fact, MT configuration reports the lowest quantum efficiency value (i.e.0.063 of AQE max and 0.025 of AQE), which also leads to a very modest system efficiency (i.e.0.012 of and 0.03 of max ,) and a minor thermal energy value, Fig. 8 and Table 3.Therefore, the values of quantum efficiency here reported are comparable with the best ones referred to in the literature 11,27,29,30,51,68 and in many case are placed at high level if it is considered the difference in the process condition, calculation and duration of tests (over 120 h).In particular, Ola et al. 51 indicates a quantum efficiency of 0.047 during 12 h of irradiation for internally illuminated monolith photoreactor, while AQE value between 5 and 20 were obtained in 6 h by Slamet et al. 27 and Tseng et al. 68, although the authors consider the photon fraction adsorbed by photocatalyst only. Then, the practical conversion of solar energy into chemical energy appear far from a commercial application, especially in comparison with photovoltaic technology achievement.Nowadays, the photovoltaic panel generates at AM 1.5 a net power of 180 W/m 2 .Reaching 100 of quantum efficiency the photoreactor could produce about 110mmolm -2 h -1 of methanol fuel, in the same irradiation condition, equivalent to 20 W/m 2 of thermal energy generable by combustion.In this study, we have obtained about 32mmolm -2 h -1 of fuel product with a 5 fold higher irradiation (UVA 285 W/m 2 ) than that of the sun.Therefore, to be the photoreduction technology industrially accessible, besides to improve photocatalyst quantum efficiency, the main efforts will have to be devoted to develop efficient solar dishes and to enlarge the radiation adsorbed by photocatalyst which is actually only 3.4 of total solar spectrum 69,70."
  },
  {
    "title": "Conclusions",
    "content": "One of the main technological limit in CO 2 utilization for energetic purposes via the photoreduction process is still the low efficiency in solar energy exploitation.In respect of this, we have obtained about 32mmolm -2 h -1 of fuel product, marking a step forward in the route of industrial gap reducing.Then, photoreduction technology has been validated in the laboratory for over 120 h, while test in a relevant industrial environment have lead to the overcoming of the technological demonstration. Therefore, the efficiency of \"conversion-storage\" of the solar energy is affected by photocatalyst behaviour, photoreactor configuration, reaction environment and process conditions.Besides the different stability showed by photocatalytic materials in the diverse reaction environment, our findings stress out the greater effectiveness of PB approach.As proof of this, the performance in the water-phase is two orders lower than that in gas-vapour stream, resulting the \"packed bed\" configuration the most performing technical choice in terms of energetic yield, process control and quantum efficiency.PB photoreactor achieves about 6 of AQE max and a fuel with an equivalent thermal energy of 315 W h/m 2 . This study proves the practical feasibility of CO 2 exploitation from exhaust emissions, although the economical valorisation of photoreduction process needs further improvement in the process-engineering design and progress in the development of more stable and active photocatalytic materials, which will be the most challenging aspects of the next future. the products distribution was established by GC-FID analysis, according to the relative \"sensitive factors\" of each compound.Apparent quantum efficiency (AQE) has been calculated, considering negligible light adsorption by reactants/products and valuing the net radiation flux reaching the surface of photoreactor and, thus, impinging on the photocatalyst, according to the following equation48495051: Fig. 1.Schematic of experimental setup: continuously stirred \"semi-batch\" (SB) photoreactor configuration (A), packed-bed (PB) photoreactor configuration (B), \"multi tubular\" (MT) photoreactor array (C). Fig. 2. XRD analysis of TiO 2 and Cu-TiO 2 photocatalysts. Fig. 3. TPR profiles of TiO 2 and Cu-TiO 2 photocatalysts. Fig. 4. Results of CO 2 photocatalytic tests carried out in the semi-batch (SB) photoreactor UVA 285 W/m 2 irradiation: time dependence on carbon dioxide conversion (A) and on the methanol formation rate (B) over TiO 2 and Cu-TiO 2 photocatalysts. Fig. 5. Results of CO 2 photocatalytic tests carried out in packed-bed (PB) photoreactor UVA 285 W/m 2 irradiation: carbon dioxide conversion vs. irradiation time over TiO 2 and Cu-TiO 2 samples. Fig. 6. Results of CO 2 photocatalytic tests carried out in packed-bed (PB) photoreactor UVA 285 W/m 2 irradiation: time dependence on methanol formation rate (A) and methane formation rate (B) over TiO 2 and Cu-TiO 2 samples. Fig. 7. Results of photocatalytic tests carried out in the multi-tubular (MT) photoreactor UVA 285 W/m 2 irradiation: influence of the relative humidity in the gas stream on product formation rate. Total radiation flux (Einstein/m 2 s).c Thermal energy generable through the combustion of the products formed in 120 h under UVA 285 W/m 2 irradiation, considering c H s CH3OH 7.310 5 J/ mol, c H s CH4 8.910 5 J/mol, c H s CO 2.810 5 J/mol 67. List of photocatalysts with physical and chemical properties. Efficiency and productivity of the different photoreactors. a Consider Planar geometry. Activity was carried out under the financial support of the Italian Ministry of Research and EU grant, PON Ricerca, Sviluppo e Competitivita.Fig. 8.Comparison of the performance of the different photoreactor configurations in terms of product formation rate and apparent quantum efficiency UVA 285 W/m 2 irradiation. Appendix A. Supplementary data Supplementary material related to this article can be found, in the online version, at doi:https://doi.org/10.1016/j.jcou.2018.05.010."
  }
]