[
  {
    "title": "Doi",
    "content": "10.1016/j.cej.2020.125922"
  },
  {
    "title": "Article_Title",
    "content": "Recycling heavy metals from wastewater for photocatalytic CO2 reduction"
  },
  {
    "title": "Abstract",
    "content": "Recycling harmful heavy metals for photocatalytic CO 2 reduction. Proposing an \"adsorbent-to-photo- catalyst\" strategy. Calcium silicate hydrate ultrathin na- nosheets as an ideal adsorbent."
  },
  {
    "title": "Experimental",
    "content": "The ultrathin calcium silicate hydrate (CSH) nanosheets were synthesized by the rate-controlled precipitation reported in previous work 33, as depicted in Scheme 1.Briefly, 5 mL aqueous solution of Ca (NO 3 ) 2 4H 2 O (3.0 mmol) was injected into 50 mL aqueous solution of Na 2 SiO 3 9H 2 O (3.0 mmol) at a rate of 2.5 mL h -1 under vigorous stirring.The injection rate was controlled by micro infusion pump (Smiths Medical Instrument (Zhejiang) Co., Ltd., WZ-50C6).The photograph of micro infusion pump is shown in Fig. S1.The resulting suspension was continuously stirred for 3 h.The whole synthesis processes were carried out at ambient temperature.The product was collected by centrifugation, washed with deionized water three times and then ethanol three times.Finally, ultrathin CSH nanosheets were obtained after drying at 60 C in an oven. Adsorption experiments were carried out at 25 C and the initial pH values of the heavy metal solutions were adjusted to pH 5 0.1 by HNO 3 (0.1 mol L -1 ) and NaOH (0.1 mol L -1 ).For the adsorption kinetics, ultrathin CSH nanosheets (20 mg) were added to heavy metal solutions (50 mL, 100 ppm).Cu(NO 3 ) 2 3H 2 O, Zn(NO 3 ) 2 6H 2 O, Ni (NO 3 ) 2 6H 2 O, and Pb(NO 3 ) 2 were chosen as sources of heavy metals, respectively.The resulting suspensions were stirred to be homogeneous.And then 1 mL suspensions were centrifuged to remove CSH nanosheets at t 0, 5, 10, 20, 30, 45, 60, 90, 120, 180, 240, and 300 min, respectively.The supernatant was diluted with 2 HNO 3 and then analysed by atomic absorption spectrophotometer (AAS, Shimadzu, AA-6880).For the adsorption isotherms, ultrathin CSH nanosheets (20 mg) were added to heavy metal solutions with different concentrations (25,50,75,100,125,150,175,200,250 and 300 ppm).The contact time was set as 180 min and then the residual concentration of heavy metals was determined by AAS.After adsorption of heavy metals (100 ppm), ultrathin CSH nanosheets were recycled from suspensions for photocatalytic CO 2 reduction.They were just centrifuged and washed with water and ethanol several times without any other special treatment.CSH nanosheets bearing different heavy metals were denoted as CSH-M (M: Cu, Zn, Ni, and Pb). The photocatalytic activities of CSH-M were evaluated in a Quartz reactor.CSH-M (1 mg), Ru(bpy) 3 Cl 2 6H 2 O (8 mg), and 2,2-bipyridine (15 mg) were dissolved into the mixed solvent of CH 3 CN:H 2 O:TEOA 3:2:1 (vol/vol).The reaction setup was alternately vacuum degassed and purged with CO 2 three times, after which high-purity CO 2 was purged again for 30 min.The reaction solution was stirred and irradiated under a 300 W Xenon lamp with a 420 nm cutoff filter.The temperature was controlled at 301-303 K by circulating cooling water and heater.The gaseous product was analysed by a gas chromatography (Agilent 7890B). The 13 CO 2 isotopic experiment was performed under the same catalysis conditions except that the 12 CO 2 gas was replaced by 13 CO 2 .The reduction products were analysed by a gas chromatography-mass spectrometry (GC-MS, Agilent 7890B and Agilent 5977B MSD).To evaluate stability of catalysts, the photocatalytic CO 2 reduction was performed for 2 h at first.And then, the photocatalysts were separated from reaction solutions by centrifugation.After washing and drying, they were re-dispersed into fresh reaction solutions to perform photocatalytic CO 2 reduction.The process was repeated three times and the gas yield was recorded.To compensate the transfer loss of photocatalysts, more sample (2 mg) was added into initial reaction solutions. Powder X-ray diffraction (XRD) patterns were recorded on a desktop X-ray diffractometer (RIGAKU-Miniflex II) with Cu K radiation ( 1.5406A).N 2 and CO 2 adsorption and desorption isotherms were measured at 77 K and 298 K on a physisorption analyser (Micromeritics, ASAP 2020).The samples morphology was observed via transmission electron microscopy (TEM, JEOL, JEM-2100F) and scanning electron microscopy (SEM, Zeiss, Supra-55).The elemental analysis and mapping were conducted on an energy dispersive X-ray (EDX) spectrometer.X-ray photoelectron spectroscopy (XPS, Thermo K-Alpha) was adopted to determine the chemical components.The thickness of CSH nanosheets was measured on an atomic force microscope (AFM, Bruker Dimension Edge).Ultraviolet-visible (UV-Vis) absorption spectra were recorded by an UV-Vis spectrometer (Lambda 950) equipped with an integrating sphere accessory in the diffuse reflectance mode (R).BaSO 4 was used as a reference material.Photoluminescence (PL) spectra were recorded on a fluorescence spectrometer (HORIBA, FluoroMax-4). Photoelectrochemical measurement was performed using a standard three-electrode quartz cell.The FTO glass coated with the photocatalysts was prepared and used as a working electrode, while Pt and Ag/AgCl were used as the counter and the reference electrode, respectively.The area that sample covered was 0."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Ultrathin CSH nanosheets are prepared by rate-controlled precipitation at ambient temperature, as depicted in Scheme 1. CSH with a phase of 1.4 nm tobermorite has an intrinsic layered structure.Ca-O layers are sandwiched between silicate chains, which are then separated by calcium ions and water molecules (Scheme 1 and Fig. S2).The theoretical thickness of a single unit cell is 2.8 nm.SEM image shows that CSH nanosheets assemble into fluffy foams (Fig. 1a).High transparency of CSH nanosheets under TEM observation is originated from their ultrathin thickness (Fig. 1b).The thickness of dark edges is estimated to be 2.8nm (Fig. S3), which is in accordance with theoretical value.AFM image shows the micron-sized face of CSH nanosheets (Fig. 1c) and thickness is 3.11 nm measured from height profile (Fig. 1d).The above microstructure observation indicates the successful synthesis of ultrathin CSH nanosheets whose thickness is closed to a single unit cell. XRD pattern (Fig. 1e) of CSH nanosheets can be indexed into a phase of 1.4 nm tobermorite (Ca 5 Si 6 O 16 (OH) 2 8H 2 O, JCPDS: 29-0331).Ca, Si, and O elements are detected by EDX spectroscopy (Fig. S4).Ca/Si molar ratio (0.65) is smaller than theoretical value (0.83), which is ascribed to leaching of calcium ions by water 33.Thanks to well-defined 2-D ultrathin morphology, CSH nanosheets have ultrahigh BET specific surface area of 637.2 m 2 g -1 (Fig. 1f), so that much more accessible reaction sites can be exposed.In this regard, ultrathin CSH nanosheets are an ideal \"bridge\" to connect heavy metals removal and photocatalytic CO 2 reduction. We firstly evaluate removal efficiency of heavy metals with ultrathin CSH nanosheets as adsorbents.Four typical harmful heavy metals including Cu 2 , Zn 2 , Ni 2 , and Pb 2 ions are chosen.The removal efficiency is shown in Fig. 2a.Benefiting from strong ion exchange and ultrahigh specific surface area of CSH nanosheets, the rapid removal of heavy metals is achieved.Initial concentrations of Cu 2 , Ni 2 , and Pb 2 ions with C 0 100 ppm can be down to below 5 ppm within 10 min.Longer time (180 min) is necessary for Zn 2 ions to reach adsorption equilibrium.Nearly all heavy metals can be entirely removed at this concentration, indicating the universality of ultrathin CSH nanosheets.High removal efficiency toward various harmful heavy metals is much attractive for practical applications.The adsorption manner is further investigated.As shown in Fig. 2b, t/Q t as a function of time (t) is well fitted into pseudo-second-order model according to the following expression: where Q t and Q e are adsorption capacity at contact time (t) and equilibrium, and k is rate constant, respectively.The experimental and calculated parameters are listed in Table S1 and have proximate values.The coefficients of linear fitting (R 2 ) for all heavy metals are 0.99.These results indicate that the chemical adsorption rather that mass transport is dominated in heavy metals removal 24.In comparison, the commercial calcium silicate is also used for heavy metals removal under the same conditions (Fig. S5).Only Pb 2 ions can be removed by commercial calcium silicate at low efficiency, and it shows negligible adsorption toward Cu 2 , Zn 2 , and Ni 2 ions. The adsorption isotherms are shown in Fig. 2c, which have the similar trend for four heavy metals.The equilibrium adsorption capacities (Q e ) sharply increase with equilibrium concentration (C e ) at first and then levelled off.The maximum adsorption capacities of Cu 2 , Zn 2 , Ni 2 , and Pb 2 ions are as high as 408, 279, 407, and 910 mg g -1 , respectively.C e /Q e as a function of C e (Fig. 2d) is well fitted into Langmuir model according to the following expression: where Q m and C e are maximum adsorption capacity and equilibrium concentration, and K L is Langmuir adsorption constant, respectively.The experimental and calculated parameters are listed in Table S2.The proximate values and large linear fitting coefficients (R 2 0.98, Fig. 2d) indicate that the adsorption behaviour of ultrathin CSH nanosheets follows the Langmuir model, that is, monolayer adsorption of heavy metals on the surface 32.The fitting parameters calculated by Freundlich model are also provided in Table S2 and show the large deviation.The comparison of adsorption capacity between ultrathin FTIR spectra of CSH-M are shown in Fig. 3b.For pristine CSH nanosheets, the absorption bands at 451 and 665 cm -1 result from deformation of SiO 4 tetrahedra and Si-O-Si bending vibrations, respectively 36.Si-O stretching vibrations are located at 970 cm -1 36.An absorption band at 1640 cm -1 corresponds to -OH of water molecules.It is found that CO 2 molecules from air can be dissolved into solutions and then attached to the surface of CSH nanosheets.The out-of-plane bending and asymmetric stretching of CO 3 2-can be found at 868 cm -1 and 1400-1500 cm -1 , respectively 37.This information suggests that CSH nanosheets are an excellent substrate for CO 2 adsorption.CO 2 adsorption and activation have been demonstrated as key steps in photocatalytic CO 2 reduction 38.Therefore, CSH nanosheets may be a promising photocatalyst for efficient CO 2 reduction.As expected, FTIR spectra of CSH nanosheets have no obvious change after adsorption of Cu 2 and Zn 2 ions.Although CSH-Ni has a FTIR spectrum similar to pristine CSH nanosheets, there are some changes including: stronger absorption band at 665 cm -1 , weaker absorption bands at 1400-1500 cm -1 , and shifting of band at 970 cm -1 to 1050 cm -1 .FTIR results suggest that the coordination environments of CSH structure have changed a lot after incorporation of Ni 2 ions, which is ascribed to phase change and formation of nickel silicate hydroxide.For CSH-Pb, the absorption band at around 868 cm -1 (bending vibrations of CO 3 ) becomes much stronger due to the formation of hydrocerussite (Pb 3 (CO 3 ) 2 (OH) 2 ).The analysis results of FTIR spectra are in accordance with that of XRD patterns. From XRD and FTIR results, it is rationally concluded that both ion exchange and chemical reactions take place for the heavy metals removal.Previous studies showed that CSH could release Ca 2 and OH - into the surrounding environments, during which harmful heavy metals would take the sites of Ca 2 by ion exchange and OH -groups were able to react with them to form metal hydroxides 24,27.Benefiting from the abundant exposed surfaces of ultrathin CSH nanosheets, these processes can be accelerated significantly, resulting in rapid removal and large adsorption capacity. Compositional analysis is carried out.XPS spectra of pristine CSH nanosheets and CSH-M are shown in Fig. 3c.The peaks at 532.1 eV and 103.1 eV correspond to O 1 s and Si 2p, respectively 27.And binding energy of Ca 2s and Ca 2p are located at 439.1 eV and 347.1 eV, respectively.The additional characteristic peaks of heavy metals can be obviously found for XPS spectra of CSH-M, including Cu 2p, Zn 2p, Ni 2p, and Pb 4f.As a representative example, the high-resolution XPS spectra of Ni 2p are provided in Fig. 3d.Two peaks at 874.1 eV and 856.1 eV are associated with Ni 2p 1/2 and Ni 2p 3/2 , accompanied with two satellite peaks at 880.0 eV and 862.0 eV.These peaks show the feature of Ni 2 ions, which is consistent with nickel silicate hydroxide reported previously 39,40.The microstructural change of CSH nanosheets after heavy metals removal is examined by SEM.As show in Fig. 4a-d, the foam-like fluffy framework assembled by nanosheets is well maintained for all CSH-M.In addition, the existence of hexagonal sheets is clearly observed for CSH-Pb due to formation of hydrocerussite (Fig. 4d).EDX elemental mapping of CSH-M shows the homogeneous distribution of corresponding heavy metals in the nanosheets (Fig. S8).After careful characterization, it is proposed that heavy metals are removed by two pathways: (1) ion exchange between Ca 2 ions and heavy metals, and (2) chemical interaction between surface hydrogels and heavy metals. The exposed active sites, ultrahigh surface area, and abundant hydroxyls of CSH nanosheets are favorable for heavy metals removal.And in the meantime, these features are also much desirable for CO 2 adsorption and reduction 35,414243.The strong adsorption and attachment of CO 2 molecules have been confirmed by the presence of CO 3 2in the FTIR spectrum of all CSH-M samples (Fig. 3b).Consequently, it is encouraging that CSH-M may be a promising photocatalysts for CO 2 reduction. We evaluate the photocatalytic CO 2 reduction of CSH-M that is recycled without any secondary treatment.Photocatalytic reactions are carried out under saturated CO 2 atmosphere and visible light ( 420 nm), with Ru(bpy) 3 Cl 2 6H 2 O (denoted as Ru) and triethanolamine (TEOA) as photosensitizer and electron donor, respectively.As expected, CSH-Pb bearing non-transition metal is inert for CO 2 reduction (Fig. 5a).In addition, CSH-Cu, CSH-Zn, and CSH-Ni show an enormous difference in gas yield.There is very little gas generating for CSH-Cu and CSH-Zn, whereas CSH-Ni has superior photocatalytic activity over other samples.The CO yield reaches to 17.11 mol, giving an evolution rate of 1.71 10 4 mol g -1 h -1 .We explore the reasons of the difference.Firstly, the CO 2 adsorption of CSH-Cu, CSH-Zn, and CSH-Ni is measured and shown in Fig. 5b.The stronger CO 2 adsorption of CSH-Ni is observed.The CO 2 quantity adsorbed by CSH-Ni (31.2 cm 3 g -1 ) is larger than that adsorbed by CSH-Zn (29.1 cm 3 g -1 ), and CSH-Cu (28.5 cm 3 g -1 ), respectively.Secondly, interaction between metals and CO 2 is critical for the activation of CO 2 .The previous studies have shown that the bond distance between Ni and CO 2 was much shorter than that between other transition metals and CO 2 , while the adsorption energy of CO 2 on Ni was higher 17,18.Therefore, the interaction between Ni and CO 2 is much stronger.Thirdly, the free energy corresponding to the formation of intermediate COOH was relatively low for Ni 17.These factors together decide the high photocatalytic activity of CSH-Ni. In addition, only 0.13 mol of CH 4 is generated and no H 2 can be detected, resulting in high CO selectivity (99.2).It was shown that H 2 O adsorption energy is low and the free energy of hydrogen evolution is high for Ni 2 , which can greatly suppress competing hydrogen evolution reaction (HER) 17,18.These factors decide the high selectivity of CSH-Ni.The comparison between CSH-Ni and the state-ofthe-art photocatalysts is provided in Table S4.The CO yield and selectivity with CSH-Ni as a photocatalyst are comparable to or even outperforming many other photocatalysts.The polluted water from different sources may contain two or more heavy metals.We have also evaluated the adsorption capacity of CSH nanosheets towards the mixed metals (Fig. S9a).The photocatalytic performance of CSH after adsorption of mixed metals is evaluated and provided in Fig. S9. The photocatalytic performance of CSH-Ni is tested in detail.The gas yield over time is shown in Fig. 5c.At t 1 h, almost no H 2 is detected and the CH 4 yield is only 0.13 mol, whereas the CO yield is as high as 17.11 mol.The gas yield increases gradually over time.And even at t 4 h, just a small amount of CH 4 (0.40 mol) and H 2 (0.16 mol) are generated.The CO yield reaches to 44.03 mol at this time and its selectivity is still maintained at 98.7.The turnover number (TON) of CO is 10.34 for the 4-hour reaction. The influence factors of photocatalytic performance are explored (Fig. 5d).The results show that: (1) pristine CSH nanosheets bearing Ca 2 ions are unable to reduce CO 2 , emphasizing the key role of Ni 2 ions; (2) in the absence of CSH-Ni, the photogenerated electron-hole pairs of photosensitizer Ru are seriously recombined, so that CO 2 cannot be efficiently reduced by electrons; (3) there is hardly any gas generating in the absence of Ru or visible light irradiation, indicating the intrinsic photocatalysis process; (4) TEOA as a sacrificial electron donor is also indispensable for CO 2 reduction; (5) under N 2 atmosphere rather than CO 2 , the CO yield falls substantially, which suggests that carbon source of CO comes from CO 2 .The isotopic tracing experiment is conducted to determine the carbon source.The photocatalytic reaction is performed under 13 CO 2 atmosphere and the gas products are analysed by GC-MS.The result is shown in Fig. 5e.A dominant signal that corresponds to 13 CO is detected, supporting that the main carbon source of CO is originated from CO 2 rather than other carbon species. The cycling stability of CSH-Ni shows that gas yield fluctuates within a narrow range (Fig. 5f To acquire a deep insight into the mechanism of photocatalytic CO 2 reduction, photoelectrochemical properties of CSH-Ni (i.e., nickel silicate hydroxide) are characterized.As shown in Fig. 6a, the optical band gap of CSH-Ni is estimated to be 3.55 eV according to the Tauc plot.E (Ag/AgCl) is determined to be -0.94V by Mott-Schottky plots (Fig. 6b).Thus, the flat band potential of CSH-Ni is calculated by E (Ag/ AgCl) 0.2 V -0.74V.For thermodynamics, the formal potential of photocatalysts should be more negative than -0.53 V (vs.normal hydrogen electrode) to drive the conversion of CO 2 into CO 44.In this point, photocatalytic CO 2 reduction with CSH-Ni as a catalyst is allowed. The positive slope of Mott-Schottky plots suggests that CSH-Ni is an n-type semiconductor.For n-type semiconductor, the position of flat band potential is 0.10 V lower than that of conduction band edge 45,46, so that the position of conduction band minimum (CBM) of CSH-Ni is estimated to be -0.84V. Further, the CBM relative to vacuum level is calculated according to E (vacuum) -0.84V 4.44 eV 3.60 eV 47,48.Therefore, the valence band minimum (VBM) of CSH-Ni relative to vacuum level is determined to be 7.15 eV based on the band gap of 3.55 eV.In addition, the positions of highest occupied molecular orbital (HOMO) and lowest unoccupied molecular orbital (LUMO) of Ru are located at 5.68 eV and 3.19 eV, respectively 47.From above discussion, we could obtain the energy-level relationship between CSH-Ni and Ru, as illustrated in Fig. 6c.Since the LUMO of Ru is higher than CBM of CSH-Ni, the photogenerated electrons in the LUMO of Ru can be transferred to the conduction band of CSH-Ni.These highly reductive electrons will then convert CO 2 into CO. The role of CSH-Ni is emphasized.Firstly, CSH-Ni provides the abundant exposed Ni 2 active sites for CO 2 adsorption and subsequently reduction.We have demonstrated the strong CO 2 adsorption of CSH-Ni (Fig. 5b).Secondly, CSH-Ni can accept the photogenerated electrons came from LUMO of Ru due to the energy-level matching (Fig. 6c).It is critical that the transfer of photogenerated charge carriers should be accelerated for efficient photocatalytic CO 2 reduction.The separation and transfer of photogenerated electron-hole pairs is examined by photoluminescence (PL) spectra.As shown in Fig. 6d, the PL intensity of Ru is declined after introduction of CSH-Ni.It has been recognized that PL emission is a result of the recombination of free charge carriers 18.Consequently, PL quenching indicates that CSH-Ni can greatly inhibit the recombination of photogenerated charge carriers.In addition, we also performed the photoelectrochemical measurement of pristine CSH and CSH-Ni.As shown in Fig. S11, both CSH and CSH-Ni show the stable photocurrent response during four on-off cycles.However, the photocurrent density of CSH-Ni is larger than that of CSH, which can be ascribed to higher separation efficiency of electron-hole pairs 49.The efficient charge separation is directly associated with better photocatalytic performance, leading to a great difference in gas yield (Fig. 5a).The electrochemical impedance spectra (EIS) of CSH and CSH-Ni are also provided in Fig. S12. The mechanism of photocatalytic CO 2 reduction is proposed (Fig. 7): (1) under visible light irradiation, photosensitizer Ru is excited to generate excited state (Fig. 7a); (2) the excited state is quenched by sacrificial electron donor TEOA and a reductive photosensitizer will be formed; (3) the electrons are efficiently transferred from reductive photosensitizer to CSH-Ni, inhibiting the recombination of charge carriers; (4) CSH-Ni provides the active sites for CO 2 adsorption, enabling high CO yield (Fig. 7b); (5) CSH-Ni has a stronger affinity with CO 2 than H 2 O 17,18,41, which can greatly suppress competing hydrogen evolution reaction and then improve product (CO) selectivity.From above results and discussion, it is reasonably concluded that nickel silicate hydroxide (CSH-Ni) is an ideal photocatalyst for CO 2 reduction considering its suitable energy level, strong CO 2 adsorption, and abundant exposed Ni 2 sites.As far as we know, nickel silicate hydroxide for photocatalytic CO 2 reduction has not been reported before, which offers new ideas for designing transition metal silicates-based photocatalysts 50.The proposed mechanism of photocatalytic CO 2 reduction can be explained by the following reaction equations 18,47:"
  },
  {
    "title": "Conclusions",
    "content": "In summary, we have proposed an \"adsorbent-to-photocatalyst\" strategy to bridge water remediation, air purification, and fuels conversion.The key point is that harmful heavy metals (from polluted water) can be removed, collected, and converted into photocatalysts (for CO 2 reduction) without any secondary treatment.CSH nanosheets with ultrathin thickness (2.8 nm), ultrahigh surface area (637.2 m 2 g -1 ), and abundant hydroxyls are prepared as an ideal \"bridge\".One of interesting findings is that CSH nanosheets after collecting Ni 2 are spontaneously converted into a semiconductor nickel silicate hydroxide.Its suitable energy levels matching with photosensitizer Ru, strong CO 2 adsorption, and exposed Ni 2 sites have contributions to efficient and selective photocatalytic CO 2 reduction.The CO yield is up to 1.71 10 4 mol g -1 h -1 with 99.2 selectivity under visible light.The \"adsorbent-to-photocatalyst\" strategy demonstrated here may offer a green and sustainable way for environmental remediation and energy crisis. 25 cm 2 .Mott-Schottky tests were carried out in Na 2 SO 4 solution (0.1 M) on a ParSTAT MC electrochemical workstation (Princeton Applied Research, Co.).Electrochemical impedance spectra (EIS) were recorded in mixed aqueous solution of 5 mM K 3 Fe(CN) 6 /5 mM K 4 Fe(CN) 6 /0.1 M KCl on a ParSTAT MC electrochemical workstation.The transient photocurrent response was measured in Na 2 SO 4 solution on a CHI660E electrochemical analyser under irradiation with a Xenon lamp. Scheme 1. Schematic illustration for the synthesis of ultrathin CSH nanosheets by rate-controlled precipitation, and crystal structure of 1.4 nm tobermorite projected along 2 1 0. Fig. 1.Characterizations for ultrathin CSH nanosheets: (a) SEM image, (b) TEM image, (c) AFM image, (d) height profile, (e) XRD pattern, and (f) nitrogen adsorption/desorption isotherms. Fig. 2. (a) Adsorption kinetics of different heavy metals with C 0 100 ppm.(b) Fitting plots of pseudo-second-order model.(c) Adsorption isotherms.(d) Fitting plots of Langmuir model.C 0 : initial concentration; C t and C e : concentration at contact time (t) and equilibrium; Q t and Q e : adsorption capacity at t and equilibrium. Fig. 3. Characterizations for CSH nanosheets after heavy metals removal: (a) XRD patterns, (b) FTIR spectra, (c) XPS spectra, and (d) high-resolution XPS spectra of Ni 2p. Fig. 4. SEM images of ultrathin CSH nanosheets after heavy metals removal.Red arrows mark the hexagonal hydrocerussite.(For interpretation of the references to colour in this figure legend, the reader is referred to the web version of this article.) ) in each run.Slight decrease of CO yield after three runs results from the transfer loss of CSH-Ni during centrifuging and re-dispersion.The structural change of CSH-Ni after photocatalytic reaction is examined by XRD.The crystalline structure of CSH-Ni is well retained (Fig. S10), demonstrating the chemical stability of CSH-Ni photocatalyst. Fig. 5. Evaluation of photocatalytic CO 2 reduction: (a) gas yield with CSH-M as photocatalysts, (b) CO 2 uptake of CSH-Ni, CSH-Zn, and CSH-Cu, (c) time course of gas yield with CSH-Ni as a photocatalyst, (d) gas yield under different reaction conditions, (e) mass spectra of 13 CO (m/z 29), and (f) cycling stability of CSH-Ni (2 mg of photocatalyst is used). Fig. 6.(a) Tauc plot of CSH-Ni.(b) Mott-Schottky plots of NSH.(c) Energy-level diagram shows the electron transfer from Ru to CSH-Ni.(d) PL spectra of Ru solution without or with addition of CSH-Ni. H e - COOH (4) COOH H e - CO H 2 Fig. 7. Proposed mechanism of photocatalytic CO 2 reduction: (a) photogenerated electrons from excitation of Ru under visible light irradiation; (b) chemical conversion on the CSH-Ni photocatalyst. Financial support from the National Natural Science Foundation of China (51672046, U1905215) is gratefully acknowledged. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https:// doi.org/10.1016/j.cej.2020.125922."
  }
]