[
  {
    "title": "Doi",
    "content": "10.1016/j.jiec.2019.09.033"
  },
  {
    "title": "Article_Title",
    "content": "Effective charge separation in rGO/NiWO4@Au photocatalyst for efficient CO2 reduction under visible light"
  },
  {
    "title": "Abstract",
    "content": "Catalyst performance can be improved by introducing an electron donor into both the valence band (VB) and conduction band (CB) to facilitate charge separation and suppress electron-hole recombination.Herein, Au nanoparticles served as CB electron donors in NiWO 4 core particles which were evenly dispersed on a reduced graphene oxide (rGO) sheet that served as a VB electron donor.The resulting rGO/ NiWO 4 Au photocatalyst was applied to reducing CO 2 .The particles exhibited broadband absorbance from the ultraviolet to near-infrared, with a specific Au surface plasmon resonance (SPR) absorption peak at 600 nm.Moreover, the catalyst exhibited low photoluminescence (PL) and a high photocurrent density, indicating that photo-excited electron-hole recombination was suppressed and the charges effectively separated.Photocatalytic reduction of CO 2 on rGO/NiWO 4 Au was significantly enhanced as evidenced by the total amounts of reduction products (CO and CH 4 ), which were 15 times those for NiWO 4 and six times those for rGO/NiWO 4 and NiWO 4 Au.The expected electron-transfer mechanism on rGO/ NiWO 4 Au involves electron donation into the VB from the p-electron rich rGO, combined with photoexcited electrons from the NiWO 4 and Au particles where electrons on the Au surfaces were amplified by the SPR and then moved to the CB of NiWO 4 .Intensity-modulated photovoltage spectroscopy of rGO/ NiWO 4 Au indicated a significantly reduced electron-hole recombination rate."
  },
  {
    "title": "Experimental",
    "content": "Synthesis of NiWO 4 , NiWO 4 Au, rGO/NiWO 4 , and rGO/NiWO 4 Au particles Graphene oxide (GO) was produced via the following method.While the temperature was maintained at 0 C, 6.0 g of graphite was added to a beaker containing 300.0 mL of sulfuric acid, followed by stirring for 2 h and sonication for 3 h.Then, 4.0 g of sodium nitrate (NaNO 3 , !99.0, Sigma-Aldrich) was added, with stirring for 1 h.The temperature was increased to 10 C, 25.0 g of potassium permanganate (KMnO 4 , !99.0, Sigma-Aldrich) was added, and the mixture was stirred for 4 h.Here, heat was generated.The temperature was increased to 35 C, and the mixture was stirred for an additional hour before being allowed to cool.Then, 300.0 mL of distilled water was added, and after stirring for 1 h, another 900.0 mL of distilled water was added.Subsequently, 80.0 mL of a 30 wt. hydrogen peroxide solution (H 2 O 2 , !30, Sigma-Aldrich) was added to obtain a precipitate.This precipitate was washed with 1.0 L of 5.0 hydrochloric acid (HCl, 37, Sigma-Aldrich), washed again with 4.0 L of distilled water, and dried at 50 C for 24 h. To prepare the rGO, 2.0 g of GO was added to 1200.0 mL of ethylene glycol (C 38 H 70 O 4 , 99, Sigma-Aldrich), followed by stirring for 1 h.Then, 2.0 mL of a 35 wt. hydrazine solution in H 2 O (N 2 H 4 65, 99.99, Sigma-Aldrich) was added, followed by stirring for 1 h.The solution was placed in an autoclave and heat-treated at Scheme 1. Synthesis sequences for the NiWO 4 , NiWO 4 Au, rGO/NiWO 4 , and rGO/NiWO 4 Au particles.materials for Ni and W, respectively.First, 0.1 mol of sodium tungstate dihydrate was dissolved in 1.0 L of distilled water, 0.1 mol of nickel nitrate was added dropwise, and the mixture was sonicated for 10 min.After 1 h of stirring, the final solution was transferred to a 2.0 L autoclave.The temperature was increased to 180 C at a heating rate of 10 C per minute, and the solution was heat-treated at this temperature for 5 h.The resulting light-green precipitate was washed twice with distilled water and three times with ethanol.Subsequently, it was dried at 80 C for 24 h and transferred to an electric furnace.It was then heated to 600 C for 2.5 h and crystallized via sintering at this temperature for 6 h (Scheme 1a). To synthesize NiWO 4 Au particles, 2.0 g of the prepared NiWO 4 powder was added to 400.0 mL of distilled water, followed by stirring for 1 h.Then, 10.0 mL of the prepared Au solution was added to the solution from the previous step, followed by stirring for 30 min.Next, 4.0 mg of sodium borohydride (NaBH 4 , 99, Sigma-Aldrich) was added, followed by stirring for 3 h to obtain a precipitate.The precipitate was washed three times with distilled water and twice with ethanol and then dried at 50 C for 24 h.The powder was sintered for 2 h in an electric furnace set at 450 C (Scheme 1b). To prepare the rGO/NiWO 4 particles, 0.2 g of NiWO 4 powder was added to 400.0 mL of distilled water, followed by sonication for 1 h.Next, 2.0 g of rGO powder was added, and the mixture was stirred for 1 h.Subsequently, 40.0 mL (1.0 mol) of sulfuric acid (H 2 SO 4 !98,Sigma-Aldrich) was added, followed by stirring for 3 h and then ultrasonic treatment for 10 min.The final solution was placed in an autoclave and treated at 170 C for 24 h to obtain a precipitate.The precipitate was washed with distilled water three times, washed with ethanol, and dried (Scheme 1c). Finally, rGO/NiWO 4 Au particles were synthesized via the following steps.First, 0.2 g of NiWO 4 powder was added to 400.0 mL of distilled water, followed by ultrasonic treatment for 1 h.Next, 2.0 g of rGO powder was added, and the mixture was stirred for 1 h.Then, 10.0 mL of an Au solution was added, followed by stirring for another 1 h.After 40.0 mL (1.0 mol) of H 2 SO 4 and 4.0 mg of NaBH 4 were added, the mixture was stirred for 3 h and sonicated for 10 min.The final solution was transferred to an autoclave and heat-treated at 170 C for 24 h.The resulting precipitate was washed three times with distilled water and twice with ethanol and then dried (Scheme 1d). The crystal structures and shapes of the synthesized NiWO 4 , NiWO 4 Au, rGO/NiWO 4 , and rGO/NiWO 4 Au particles were examined via X-ray diffraction (XRD) analysis (X'Pert Pro MPD PANalytical, Ni-filtered Cu K (l 1.5406A), 30 kV, 15 mA, 2u angle of 10 -80 ) and transmission electron microscopy (TEM, H-7600, Hitachi, Japan).The crystal lattice structure of the particles was analyzed using high-resolution TEM (HRTEM, JEM-2100 F, JEOL), and the images were obtained at 200 kV.The X-ray photoelectron spectra of the particles were obtained using a Kratos Axis Nova instrument with monochromatic Al K radiation (225 W, 15 mA, 15 kV).To determine the optical properties, a diffuse-reflectance UV-vis (DIR-UV-vis) spectrometer (Neosys-2000, Scinco Co., Korea, wavelength of 200800 nm), photoluminescence (PL) spectroscopy (PerkinElmer, He-Cd laser source, wavelength of 320 nm), and photocurrent measurements (2000 solar simulator, ABET Technologies) were used.Raman spectroscopy was performed using a Horiba Jobin-Yvon LabRam HR instrument with laser-beam excitation at l 633 nm.Intensity-modulated photovoltage spectroscopy (IMVS) and intensity-modulated photocurrent spectroscopy (IMPS) were performed under open-circuit conditions to measure the electron and hole recombination properties and the electron-transport time using a Sun 2000 Solar Simulator (IVIUM STAT, ABET Technologies) under illumination with a power density of AM1.5 (100 mW/cm 2 ).Time constants were calculated using the frequency at which a minimum occurred in the imaginary response, via a nonlinear fitting procedure.To confirm the amounts of CO 2 adsorbed on the surfaces of the catalysts, CO 2 -TPD experiments (BEL Japan Inc., Japan) were conducted. The CO 2 photoreduction activities of the synthesized NiWO 4 , NiWO 4 Au, rGO/NiWO 4 , and rGO/NiWO 4 Au particles with H 2 O were examined in a closed cylinder-type quartz vessel (length, 15.0 cm; diameter, 1.0 cm; total volume, 12.5 mL) that was employed in our previous study 23.Here, 0.2 g of the catalyst and 40.0 mL of distilled water were placed in the photoreactor.CO 2 gas with 99.999 purity was used as the reactant.The CO 2 gas was flowed into the chamber to purge air from the chamber before irradiation.The reactor chamber was then closed, and a Sun 2000 Solar Simulator (IVIUM STAT, ABET Technologies) with a power density of AM1.5 (100 mW/cm 2 ) was used as a light source.The distance between the reactor and the light source was fixed at 1.0 cm.The photoreduction was conducted at room temperature and the atmospheric pressure.The gases inside the reactor were sampled at intervals of 1 h using a nanoliter syringe, and the product gases were analyzed using a gas chromatography instrument (Master GC, Scinco, Korea) equipped with thermal conductivity and flame ionization detectors to separate the C 1 -C 3 light hydrocarbons and oxygenated compounds, such as CH 4 , Fig. 2. TEM images of synthesized particles. CH 3 OH, HCHO, HCOOH, and CO.The product selectivity was calculated using the following equation: C i () C i moles of the product /total moles of C produced A 100 (1)"
  },
  {
    "title": "Results_and_Discussion",
    "content": "Fig. 1A shows the XRD patterns of NiWO 4 , NiWO 4 Au, rGO/ NiWO 4 , and rGO/NiWO 4 Au particles.In general, the NiWO 4 particles exhibited XRD peaks in the same positions, which corresponded to the monoclinic crystal system 24.The obtained patterns also clearly indicated the absence of phase impurities.For the NiWO 4 Au particles, the peak intensity was only slightly reduced, and there was no change in the monoclinic crystal structure compared with NiWO 4 .The (111) and (200) diffraction planes corresponding to the Au cubic structure were observed at 2u 38.27 and 44.6 , respectively 25.These results indicate that the Au nanoparticles were well loaded on the surface of the NiWO 4 particles.In contrast, for the rGO/NiWO 4 particles, the presence of C was expected, as the baseline of the 2u 25 peak was broad and excited, which is attributed to the C in rGO 26.Finally, for the rGO/NiWO 4 Au particles, the characteristic peaks of Au exhibited higher intensities; thus, the presence of Au was more clearly detected.In conclusion, the presence of Au loaded on NiWO 4 and the presence of NiWO 4 loaded on rGO were confirmed by the XRD analysis.However, the presence of rGO was not observed in the XRD patterns.Therefore, its presence was confirmed via Raman spectroscopy, as shown in Fig. 1B.The presence of rGO in the rGO/NiWO 4 Au catalyst was confirmed by the peaks at 1300 and 1600 cm A1 27.A sharp peak at 1000 cm A1 corresponding to the NiWO 4 was also observed 28.Moreover, the broad peak near 2700 cm 1 was strong evidence for the presence of Au in the rGO/ NiWO 4 Au catalyst 29. The shapes of the particles were examined using TEM, as shown in Fig. 2. The NiWO 4 particles exhibited a rhomboidal shape, and their sizes ranged from 100 to 200 nm.The image of NiWO 4 Au particles indicated that Au particles approximately 50 nm in size were loaded on the surface of a large NiWO 4 core particle with a width of 200 nm and a length of 300 nm.The image of the rGO/ NiWO 4 particles indicated that NiWO 4 particles 50-100 nm in size were embedded on the thin rGO sheet.Finally, the images of the rGO/NiWO 4 Au particles indicated that the Au-loaded NiWO 4 particles were uniformly embedded on the rGO.Thus, the TEM image well matched the XRD results. The crystal lattices of the rGO/NiWO 4 Au particles were identified, and the selected-area electron diffraction (SAED) pattern was obtained to confirm the crystallinity and to confirm that the elements present in the sample were uniformly distributed.Fig. 3 shows HRTEM images (a), specific lattice planes (b), SAED patterns (c), and high-angle annular dark-field imaging (HAADF) element-mapping images (d).As indicated by the HRTEM images, the NiWO 4 Au particles were uniformly dispersed in the rGO, and the Au was loaded not on the rGO but only on the NiWO 4 particles.Lattice-plane calculations indicated that the lattice widths of the Au (111) and NiWO 4 (110) planes were 1.43 and 3.47 A, respectively.The SAED patterns exhibited a uniform circular shape, suggesting that the particles were uniform single crystals.The distribution of elements in the rGO/NiWO 4 Au particles was very uniform, with the C from the rGO having the highest density, followed by O, W, and Ni.In particular, Au exhibited a dense electron density, with a shape similar to that of red beads approximately 20 nm in size.These results confirmed that the rGO/ NiWO 4 Au catalyst prepared in this study was made of NiWO 4 Au particles uniformly loaded with Au on NiWO 4 particles well dispersed on rGO. Fig. 4 shows the X-ray photoelectron spectroscopy (XPS) measurements for the oxidation states of the constituent elements in each sample.XPS was performed to monitor the characteristic binding energy of the C 1s peaks, corresponding to each functional group on the rGO/NiWO 4 Au and rGO/NiWO 4 particles.The C 1s XPS spectra were deconvoluted into two peaks corresponding to C14C (284.5 eV) and CA AC (285.6 eV) 30.These peaks were separated in almost the same area in the two samples, and the binding-energy positions were almost the same.For the NiWO 4 and NiWO 4 Au samples, the O 1s regions exhibited two main contributions: the O 2A state of lattice O (M-O) at 530.6 eV and the O 2A state of O defects/vacancies at 531.8 eV 31.For the rGO/ NiWO 4 and rGO/NiWO 4 Au samples, the O 1s peaks were divided into two peaks at 530.5-530.6 and 532.5-532.6 eV via Gaussian fitting.Notably, the second peak was clearly observed and was due to the CA AO in rGO 32.For the NiWO 4 and NiWO 4 Au samples, the fitted Ni 2p peaks at binding energies of 854.2-855.9 and 872.7-873.5 eV are ascribed to the Ni 2 , whereas the fitted peaks at binding energies of 856.9-857.6 and 874.3-875.3eV correspond to the Ni 3 33.The Ni 2p 3/2 peaks were located at 855.1-856.2and 856.5-857.7 eV for the rGO/NiWO 4 and rGO/NiWO 4 Au samples.The Ni 2p peaks for the Au-loaded catalysts were observed at lower binding energies that those for NiWO 4 .The W 4f profile was fitted by two Gaussian peaks centered around 37 and 35 eV, which were the binding energies of electrons in the 4f 5/2 and 4f 7/2 levels of W in the W 6 valence state in WO 3 , respectively 34.For the rGO/NiWO 4 and NiWO 4 Au samples, the two peaks shifted to lower binding energies compared with NiWO 4 , indicating that the W ions were reduced.The shift was larger for the NiWO 4 Au sample.This indicates that the electrons were more enriched in the Au-loaded catalyst compared with the NiWO 4 catalyst.Thus, in the Au-loaded catalyst, the electrons were easily excited by light.Finally, the Au in the NiWO 4 Au sample existed in metallic states, as indicated by the Au 4f spectra, which were composed of Au 4f 7/2 and Au 4f 5/2 peaks at 83.6 and 87.3 eV, respectively 35.For the rGO/NiWO 4 Au sample, the Au 4f 7/2 peak was slightly shifted toward the lowerbinding energy region (maybe bulk Au), indicating a strong interaction between the Au and the NiWO 4 support.The strong interaction between the Au nanoparticles and the NiWO 4 support was expected to enhance hot-electron transfer from the Au nanoparticle surface to the NiWO 4 CB through the Schottky energy barriers 36.Catalytic performance of catalysts for CO 2 photoreduction Fig. 5 shows the yields of the primary product of CO and the final product of CH 4 when the following reaction was conducted under visible light using four types of particles: NiWO 4 , NiWO 4 Au, rGO/NiWO 4 , and rGO/NiWO 4 Au catalysts: For the NiWO 4 catalyst, very small amounts of the CO and CH 4 gases were accumulated after 10 h of reaction, and their ratio was almost 1:1.For the NiWO 4 Au catalyst (Au loaded on NiWO 4 ), the amount of CO generated increased sharply, and the CO production was nearly 10 times that for CH 4 .Many studies have indicated that the amount of CO 2 is significantly reduced by the effect of Au on the SPR 37, and the selectivity to CH 4 is increased 38.However, for NiWO 4 Au, the selectivity of CH 4 hardly changed, and the fact that only the production of CO increased significantly is unusual.However, for the rGO/NiWO 4 catalyst, the amount of CH 4 increased by more than 4 times compared with that for the NiWO 4 Au catalyst.This result implies that the CO on the rGO in the rGO/ NiWO 4 catalyst reacted with H and was converted into CH 4 .For the final catalyst, i.e., the rGO/NiWO 4 Au particles, the total product amount increased by a factor of 6 compared with that for the rGO/ NiWO 4 catalyst and by a factor of 15 compared with that for the NiWO 4 catalyst.However, the amount of CH 4 hardly increased.According to these results, we predicted that the addition of Au in rGO/NiWO 4 Au increased the amount of the primary product, CO, because the system did not contain redox to decompose water. For clarifying the CO 2 photoreduction mechanism, Fig. 6A shows the mass spectra of the gas species formed on rGO/ NiWO 4 Au during 10 h of CO 2 photoreduction.In our mass analysis, C, CH 2 , and CH 3 intermediates were observed.Therefore, we predicted that CO 2 was reduced through the carbene pathway for the rGO/NiWO 4 Au catalyst.There were two pathways, and both preferred the two-electron mechanism, where two photogenerated electrons participated in concert in one elemental step 39.One pathway is called the formaldehyde pathway (fast hydrogenation pathway), in which the reaction follows the path CO 2 HCOOH HCHO CH 3 OH CH 4 40.This pathway is thermodynamically feasible; however, in our mass analysis, HCOOH and CH 3 OH were not observed.The other pathway is the carbene pathway (fast deoxygenation pathway), in which CO 2 is reduced along the path CO 2 CO 41.Fig. 6B shows the IR spectra of the surface of rGO/NiWO 4 Au before and after CO 2 adsorption and after CO 2 reduction.In the rGO/NiWO 4 Au before CO 2 adsorption, six peaks at 706, 832, 1180, 1390, 1555, and 3413 cm A1 were observed, corresponding to NiA AO, WA AO, CA AOH, CA AO, C14C, and OA AH configurable stretching and bend vibrations in the NiWO 4 and rGO 42,43.After CO 2 adsorption, the vibration mode for isolated CO 2 gas was observed at 2450 cm A1 .This indicates that CO 2 was well adsorbed onto the rGO/NiWO 4 Au catalyst.After the CO 2 photoreduction reaction, the C14O vibrational mode was observed at 2030 cm A1 , and three large peaks corresponding to the CA AH bending mode in CH 4 were observed at 1076, 1210, and 1302 cm A1 44.The OA AH stretching mode at 3413 cm A1 exhibited the largest peak, indicating that the reaction intermediate (CO) adsorbed on the catalyst became CatA ACO, and then H was bound to CatA ACOH.According to the report of W. Zhang et al. 45, we predicted the following three mechanisms in this study. Optical properties of catalysts Fig. 7A shows the DIR-UV-vis spectra of the NiWO 4 , NiWO 4 Au, rGO/NiWO 4 , and rGO/NiWO 4 Au particles, which were used to determine their bandgaps.According to de Oliveira et al. 46, the absorption bands in NiWO 4 above 750 (IR range), 470, and 380 nm (UV range) can transition from 3A 2g to the excited states 3T 2g , 3T 1g , and 3T 1g , respectively.Because a 1-sun light source was used in this study, the absorbance of NiWO 4 was reasonable at 470 nm; thus, the bandgap was 2.63 eV.This is consistent with previously reported results 47.The absorption peak of Au, which indicated the effect of the SPR on the NiWO 4 Au particles, was clearly observed at 600 nm 48.The rGO/NiWO 4 and rGO/NiWO 4 Au particles containing rGO absorbed light in the wavelength range of 300-1000 nm (from the UV to the near-IR region).This result implies that a catalyst that absorbs light over the entire wavelength range can be fabricated by uniformly applying nanoparticles to rGO.The position of the VB in the NiWO 4 obtained via XPS was 2.27 eV, as shown in Fig. 7B.By subtracting this VB position from the bandgap obtained in Fig. 7A, we obtained the desired CB, which corresponded to A0.36 eV. The electrons excited into the CB of the particles were relaxed again and recombined with the holes.The analytical method for measuring these relaxed photoelectrons is PL, and the PL spectroscopy results are shown in Fig. 8A.The electrons excited by 300 nm wavelength light were emitted through the relaxation process at 410 nm.For the NiWO 4 with pure crystals, a large phosphorescence peak appeared at 410 nm, and small fluorescence peaks were observed at 470 and 540 nm.For NiWO 4 Au, the intensities of the PL peaks were significantly lower.In particular, the PL peaks for the rGO/NiWO 4 and rGO/NiWO 4 Au particles containing rGO were small.This is attributed to electron capture caused by defects in the rGO/NiWO 4 and rGO/NiWO 4 Au crystals or the intercalation phenomenon between the adjacent particles 49,50.Eventually, in any case, the number of excited electrons recombined with the holes will be reduced, which ultimately increases the activity of the photocatalyst.However, in the NiWO 4 and NiWO 4 Au films, photocurrent hardly flowed when the light was on, as shown in Fig. 8B.However, in the rGO-added rGO/ NiWO 4 , the current increased to 10 mA/cm 2 in the 1st cycle of the light being turned on, tended to stabilize until the 3rd cycle, and then decreased in the 4th cycle.Thus, the initial activity of the catalyst was good, but catalyst deterioration occurred owing to the recombination of electrons and holes during the cycling.The rGO/ NiWO 4 Au catalyst exhibited the largest photocurrent increase, and the photocurrent did not decrease until the 5th cycle.These results indicate that the separation of electrons and holes was easy in this catalyst. To calculate the electron-transport time and the recombination lifetime for NiWO 4 and rGO/NiWO 4 Au, IMPS and IMVS were performed, and the typical responses are presented in Fig. 9. Generally, it is reasonable to use IMPS to determine the electrontransport time 51, and the transport time constant affects the measured IMPS signals at high frequencies, as shown in Fig. 9A.A higher voltage across both catalysts yielded a larger movement of the circle to the left and a smaller circle.This indicates that a higher voltage led to faster electron transport.However, the spacing of the circles for the rGO/NiWO 4 Au catalyst was narrower and smaller than that for the NiWO 4 catalyst.This was due to the faster transfer of electrons on the rGO/NiWO 4 Au catalyst.As shown in Fig. 9B, as the applied voltage increased, the IMVS circles moved to the right and became larger.This indicates that when a high voltage was applied, the recombination rate of the electrons and holes decreased.The IMVS circles were more shifted to the right for the rGO/NiWO 4 Au catalyst than for the NiWO 4 catalyst, and the circle spacing was wider.This shift indicated slower recombination of electrons and holes in rGO/NiWO 4 Au compared with NiWO 4 . According to the IMPS and IMVS curves, the electron-transport times (s, y-axis) and recombination lifetimes were estimated using the expression s 1/2pft (or fr), where ft or fr represents the characteristic frequency at the minimum value of the imaginary components of IMPS or IMVS 52.The results are presented in Fig. 10.The electron-transfer rate for the rGO/NiWO 4 Au catalyst (Fig. 10A) was significantly higher (approximately 30) than that for the NiWO 4 catalyst.This indicates that the electrons generated in the Au moved quickly to the NiWO 4 , and the charge separation between the electrons and holes was useful because the rGO quickly filled the electrons with the empty orbit of Au and NiWO 4 .It is believed to be accelerated.Additionally, as shown in Fig. 10B, the rate of recombination of electrons and holes for the rGO/ NiWO 4 Au catalyst was significantly lower than that for the NiWO 4 catalyst, by a factor of approximately 10.This was due to the continuous supply of electrons from the electron-rich rGO to the empty valence shell of NiWO 4 . According to the foregoing catalyst properties and performance, the expected CO 2 photoreduction mechanism on the rGO/ NiWO 4 Au catalyst is depicted in Scheme 2. In the CO 2 photocatalytic reduction, the enhanced photocatalysis of the ternary nanocomposites is attributed to the synergistic effect of the three components.First, both the NiWO 4 and the rGO nanosheets provided adsorption to CO 2 molecules.Then, the photogenerated carriers were formed through the excitations of both the bandgap transition of NiWO 4 and the SPR of Au nanoparticles upon the visible-light irradiation.The Au nanoparticles enhanced the visible-light harvesting owing to their SPR properties, and the amplified electrons on the surface of Au moved to the CB of NiWO 4 .Additionally, in the electron-rich CB of NiWO 4 , the reduction of the adsorbed CO 2 molecules into CO occurred.Alternatively, holes (h ) could have oxidized the surface H 2 O, forming reactive OH and H .The rGO nanosheets offered a path for rapid transport of the photogenerated electrons, yielding efficient charge separation during the photocatalytic process.The injected electrons in the rGO sheets were subsequently captured by the adsorbed H , producing the active CHO, CH 2 , and CH 3 radicals during the photocatalysis.Finally, they combined with H on the electron-rich rGO, producing CH 4 ."
  },
  {
    "title": "Conclusions",
    "content": "In this study, rGO/NiWO 4 Au catalysts with electron donors of rGO and Au grafted to an NiWO 4 main catalyst were synthesized.We intended to promote the reduction of CO 2 by efficiently inducing oxidation and reduction reactions at two bands through the continuous supply of electrons to both the VB and CB of NiWO 4 .The synthesized rGO/NiWO 4 Au three-component catalyst exhibited synergy between the constituents, in contrast to NiWO 4 and bimetallic catalysts, yielding better catalytic activity in the CO 2 reduction reaction.The rGO/NiWO 4 Au three-component catalyst had several advantages, exhibiting improved photocatalytic and photoelectric performance.(1) The Au nanoparticles of rGO/ NiWO 4 Au acted as electron donors, promoting the electron transfer and improving the quantum efficiency.(2) The excellent conductivity and electron-transfer capability of rGO contributed to the sustained maintenance of the catalytic reaction cycle, as the rGO supplied electrons to the VB of NiWO 4 .(3) The irregular interfaces of the rGO/NiWO 4 Au three-component catalyst not only provided many reactive sites but also absorbed and scattered light, increasing the light utilization.These three advantages contributed to the enhancement of the catalytic activity through the effective separation of the charges formed on the catalyst surface. Fig. 1. (A) XRD patterns and (B) Raman spectra of the synthesized particles. Fig. 3. (a) HRTEM image, (b) specific lattice planes, (c) SAED pattern, and (d) HAADF element-mapping images of rGO/NiWO 4 Au particles. Fig. 4. C1s, O1s, Ni2p, W4f, and Au4f X-ray photoelectron spectra of the synthesized particles. Fig. 5. Catalytic performances of the synthesized catalysts for CO 2 photoreduction. Fig. 6. (A) Mass spectra of gas species formed on rGO/NiWO 4 Au during 10 h of CO 2 photoreduction; (B) IR spectra of the surface of rGO/NiWO 4 Au before and after CO 2 adsorption and after CO 2 reduction. Fig. 7. (A) DIR-UV-vis spectra of the synthesized particles; (B) XPS curve for determining the position of the VB in the NiWO 4 . Fig. 8. (A) PL curves and (B) photocurrent density cycles of the synthesized particle films. Fig. 9. (A) IMPS and (B) IMVS results for NiWO 4 and rGO/NiWO 4 Au. Fig. 10.(A) Recombination rate of electrons and holes and (B) electron-transfer rate for NiWO 4 and rGO/NiWO 4 Au. J. Shin et al. / Journal of Industrial and Engineering Chemistry 81 (2020) 427-439 J. Shin et al. / Journal of Industrial and Engineering Chemistry 81 (2020) 427-439 This work was supported by the National Research Foundation of Korea (NRF) grant funded by the Korea government (MSIT) (No.2018R1A2B6004746), and the authors appreciate these supports. Scheme 2. CO 2 photoreduction mechanism on the rGO/NiWO 4 Au catalyst."
  }
]