[
  {
    "title": "Doi",
    "content": "10.1016/j.cej.2014.08.095"
  },
  {
    "title": "Article_Title",
    "content": "New optimized mesoporous silica incorporated isolated Ti materials towards improved photocatalytic reduction of carbon dioxide to renewable fuels"
  },
  {
    "title": "Abstract",
    "content": "h i g h l i g h t sTi-mesoporous silicas were used to convert CO 2 greenhouse gas into renewable fuels.CH 4 , CH 3 OH, CO and H 2 were the main products obtained during the reaction.Increased surface OH groups and more isolated Ti species boosted higher activity.The reaction was preceded by the competitive adsorption of CO 2 and H 2 O vapors.UV light, H 2 O/CO 2 ratios and catalyst shapes were optimized to boost the products."
  },
  {
    "title": "Experimental",
    "content": "The mesoporous silica materials (SBA-15-S, KIT-6) were obtained by following the procedure shown in recent works 32,34,35.After a hydrothermal treatment, the obtained solid product was filtered, dried and/or calcined at 550 C for 5 h, and was then utilized to prepare Ti-SBA-15-S (dried or calcined) and Ti-KIT-6 (dried or calcined).The dried and calcined SBA-15-S and KIT-6 materials were then treated with Titanium (IV) Isopropoxide (98) at different Si/Ti ratios (200, 100 and 50), and finally calcined to obtain Ti-SBA-15-S and Ti-KIT-6 by following the recently reported procedure 36, and is shown in Scheme 1. Ti-KIT-6 (calcined) materials were further characterized and evaluated by reaction to achieve the most optimized photocatalyst which would be discussed in later parts.The optimized Ti-KIT-6 was used in further optimization of the process and the key reaction parameters. The Brunauer-Emmett-Teller (BET) specific surface area (S BET ), pore volume (PV), average pore diameter (APD), isotherms and pore size distributions (PSD) were measured on the powder materials, which had previously been outgassed at 150 C using a Micromeritics FlowPrep 060, USA (sample degas system), by means of N 2 sorption at 77 K on a Micromeritics Tristar II, USA (surface area and porosity) instrument. Scanning electron microscopy (SEM) FEI Quanta Inspect 200 was used to observe the morphology of the synthesized mesoporous silica and Ti-mesoporous silica materials.EDAX Genesis, with an SUTW detector equipped with SEM equipment, was used to carry out the EDX analysis in order to confirm the presence and quantification of silica and Ti.The UV-Vis diffuse reflectance spectra were recorded using a Varian model Cary 500 spectrophotometer with a quartz cell suitable for measuring powders. FT-IR spectra were collected at a resolution of 2 cm A1 on a Perkin Elmer FT-IR spectrophotometer equipped with an MCT detector.The XPS spectra were recorded using a PHI 5000 Versa Probe (USA), with a scanning ESCA microscope fitted with an Al monochromatic X-ray source (1486.6 eV, 25.6 W), a beam diameter of 100 lm, a neutralizer at 1.4 eV, 20 mA, and in FAT analyzer mode.TEM images were taken at the thin edges of the sample particles using a TEM Philips CM12, with a LaB6 filament, double-tilt holder, operating at 120 kV. In order to have a viable application, the Ti-mesoporous silica photocatalyst cannot be used in powder form but needs to be shaped into a structured reactor.Different alternatives to powder are possible, and the following have been examined in this work: Scheme 1. Scheme for the synthesis of the materials. -Fine 500 micron pellets uniformly dispersed in the reactor; this provides the maximum available geometrical surface area exposed to light and for reactant adsorption.-A thin catalyst layer laid over an illuminated surface; this maximizes the geometrical surface area exposed by the photocatalyst and UV light. A 0.2 g sample of bare powder catalyst, which was dispersed over the same surface using a spatula, was prepared for comparison purposes. The basic experimental CO 2 photocatalytic reduction set-up is shown in Fig. 1.This set-up includes a Pyrex glass reactor, connectors, mass flow controllers (Bronkhorst, High-Tech), a water bubbler and a UV lamp (Newport/Oriel Instrument USA 200 W with a focusing lens assembly or Osram Ultra-Vitalux 300 W).The set-up also includes a CO 2 gas cylinder (99.99), a gas chromatograph (GC, Varian CP-3800) equipped with a capillary column (CP7381), a flame ionization detector (FID) and a thermal conductivity detector (TCD).A photocatalytic reaction was performed in the reactor, which contained 0.5 or 0.2 g of photocatalyst.The reactor and lines were purged with a He flow to remove the trapped air and the impurities.CO 2 gas 100 pure or after dilution (20) with He, was introduced into the reactor after having passed through the water bubbler and ensuring it was adsorption-desorption balanced in order to saturate the catalyst with CO 2 and H 2 O.When equilibrium was reached, the UV light was turned on and the reaction products were analyzed by means of the GC.Blank tests were also conducted to ensure that the products were due to the photocatalytic reaction.The blank tests consisted of a UV-illumination without the photocatalyst and a reaction in the dark with the photocatalyst."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The physical and textural properties of the mesoporous materials (SBA-15-S, KIT-6) and Ti-mesoporous silica series were obtained by means of N 2 -sorption and are shown in Table 1.SBA-15-S and KIT-6 have shown different and large S BET , PV and APD on the basis of their characteristics.However, there was a significant decrease in the S BET , PV and APD of SBA-15-S in the Ti-SBA-15-S-calcined series of photocatalysts, which is due to the increased Ti content in the rigid 1-dimensional or 2-dimensional (1-D or 2-D) calcined structure of SBA-15-S.A similar decreasing trend in the physical properties was also observed in Ti-SBA-15dried series.However, due to the dried bulk structure, there was easy incorporation of Ti.Since due to the restructuring and final calcination, the S BET , PV and APD were higher in this case. A noticeable decrease can be seen in the physical properties of KIT-6, after Ti incorporation with different Si/Ti ratios.The S BET and PV of the Ti-KIT-6 (dried) materials were slightly higher than those of the Ti-KIT-6 (calcined) ones, which might be due to the easy incorporation of Ti in the dried weak structure of KIT-6.However, Ti could be trapped in the bulk of the dried KIT-6 material, but not in that of the rigid structure of the calcined KIT-6 one.The APD was not changed significantly and remained uniform, which might be due to the three-dimensional (3-D) pore structure of KIT-6, which is able to accommodate the uniform isolated-Ti dispersion and also facilitates faster diffusion of reactants and products 34. The porous and textural properties of the mesoporous silica and Ti-mesoporous silica materials were examined by means of N 2 adsorption/desorption isotherms at 77 K and PSD, as shown in Fig. 2. SBA-15-S and KIT-6 before Ti incorporation, showed the typical reversible type IV adsorption isotherms as defined in IUPAC Fig. 1.Photocatalytic reaction set up for the CO 2 conversion to fuels.37.The type IV isotherm also provides useful information on the mesoporous structure through its hysteresis loop 35,37.According to the IUPAC classification of adsorption hysteresis, SBA-15-S and Ti-SBA-15-S showed a type IV isotherm, but hysteresis of the H2 type, with a sharp inflection at a relative pressure in the 0.6-0.9range, which is indicative of a high quality mesoporous material with uniform mesopores, as shown in Fig. 2a andc.However, unlike the Ti-SBA-15-S-dried series, there was a significant decrease in the volume adsorbed of the Ti-SBA-15-S-calcined series and the hysteresis loops were slightly changed, which are in accordance with the physical properties shown in Table 1.A similar decreasing trend in case of PSD have been observed as shown in Fig. 2b andd. Unlike SBA-15-S, the adsorption branch of each isotherm in KIT-6 and Ti-KIT-6, showed a sharp inflection at a relative pressure in the 0.5-0.80 range, which means a typical capillary condensation within uniform pores with a typical H1 type hysteresis loop, and which points out large channel like pores with a narrow pore size distribution as can be seen in Fig. 2e andg.Although there was decrease in the volume adsorbed by increased Ti content, however, all the Ti-KIT-6 materials preserved the hysteresis shapes and positions.Similarly, regardless of the decrease in volume due to Ti addition, the Ti-KIT-6 materials also preserved the PSD due to the 3-D pore structure, which can be seen in Fig. 2f andh and are in agreement with the results shown in Table 1.Fig. 3 shows the morphologies of the mesoporous silica and the Ti-mesoporous silica (calcined or dried, Si/Ti 100).As shown in Fig. 3a andb, SBA-15-S has a spherical morphology in agreement with Wang et al. 38.It has well-dispersed microspheres with a limited dispersion of the particle size in the 2-3 lm range, together with a high yield of almost 100.However, calcination treatment of Ti-SBA-15-calcined (Si/Ti 100) changed the morphology of SBA-15-S-calcined, in which the particles were much grown to larger spherical rigid particles (shown by right side blue arrow).Due to these rigid particles Ti was not dispersed uniformly and formed many agglomerates.The Ti-O-Ti or TiO 2 agglomerates could be seen within the spherical rigid silica particles (shown by rectangles and left side arrow) (Fig. 3c andd).Unlike to the Ti-SBA-15-calcined (Si/Ti 100), the Ti-SBA-15-dried (Si/Ti 100) after calcination, has shown more uniform morphology with comparatively better dispersed Ti (Fig. 3e andf) within the dried SAB-15 structure/surface and formed less agglomerates (shown by rectangle and arrows), which is in agreement with the results discussed in Table 1 and Fig. 2. The morphology of KIT-6 is shown in Fig. 3g and h and is consistent with that shown in the literature 39.As shown in Fig. 3i-l, after Ti incorporation and calcination, no significant difference was observed in the morphology of KIT-6, which indicates that Ti was very well dispersed within the 3-D structure. The EDX analysis results of Ti-SBA-15-S-dried/calcined (Si/ Ti 100) and Ti-KIT-6-dried/calcined (Si/Ti 100) shown in Table 1 indicate that all the photocatalysts have almost similar Ti content.However, the position (surface or bulk) and the nature (isolated or agglomerates) of the active sites could be different which could influence the overall activity of the catalysts. In optimization point of view, Ti-KIT-6-calcined series have been found better than all other materials, both in characteristics, as well as in activity (which will be discussed hereafter).Therefore, further characterizations have been done only for the Ti-KIT-6-calcined series to explore the most optimized Si/Ti ratio out of 200, 100 and 50 ratios.The UV-Vis spectra of the Ti-KIT-6-calcined (Si/Ti 200, 100 and 50) are shown in Fig. 4. It has been observed that, with the increased Ti content, the absorption spectra are shifted to higher wavelengths for an absorption edge wavelength change from 320 to 372 nm (Table 2), that is, moving towards the trend of pure TiO 2 .Therefore, it can be observed that this increased Ti might also have more chance of making the agglomerates of TiO 2 with the moisture present during the synthesis.The band gap energies of the Ti-KIT-6 materials, corresponding to a band gap of 3.33-3.87eV, which is the characteristic band gap of Ti-silica, are shown in Table 2.The variation in the band gap is due to the TiO 2 agglomerates that have formed, as already mentioned, and which will be dealt with in more detail hereafter. Mesoporous structure in the KIT-6 material has been confirmed by TEM analysis, which also shows isolated Ti dispersion within the KIT-6 structure.The successful formation of the KIT-6 structure with an ordered array of mesopores can be seen in Fig. 5a, which shows the centers of two adjacent pores about 10 nm apart; a pore diameter of 6 nm can also be seen.APD finding is also in accordance with the results obtained from N 2 -sorption (Table 1), as well as with that reported in literature 34.The TEM images of Ti-KIT-6-calcined (Si/Ti ratios of 200, 100 and 50) have been shown in Fig. 5b-d.Ti-KIT-6 (200) shows a uniform Ti dispersion with hardly any Ti agglomeration, which indicates the preserved structure of the KIT-6, as is confirmed by the mesoporous channels of KIT-6, which are shown in Fig. 5b.Ti-KIT-6 (100) has a similar tendency to Ti-KIT-6 (200) in which a good dispersion of isolated Ti and mesoporous structure preservation is obvious (Fig. 5c).Unlike to Ti-KIT-6 (200) and Ti-KIT-6 (100), it can also be observed that the mesopore structure of KIT-6 is partially collapsed/damaged in Ti-KIT-6 ( 50), (top right corner in Fig. 5d), due to the higher Ti content than for the other two ratios.Despite the isolated Ti species being dispersed on the KIT-6 support material, some Ti-O-Ti/TiO 2 agglomerates which were not seen in Ti-KIT-6 (200, 100), but only in Ti-KIT-6 (50) have also been observed and are shown in the small insert in Fig. 5d.This is due to the increased Ti which is not uniformly dispersed, and either produces Ti-O-Ti agglomerates or forms TiO 2 due to the moisture present during the synthesis. In order to confirm the TiO 2 formation which was observed in TEM analysis, XPS analysis of the Ti-KIT-6 materials (Si/Ti ratios of 100, 50) was performed as shown in Fig. 6.The overall XPS spectra of the Ti-KIT-6 (Si/Ti 100), Ti-KIT-6 (Si/Ti 50) are shown in Fig. 6a andb, respectively.The deconvoluted XPS spectra shown in Fig. 6c andd and values in Table 2 indicate that, for an increased Ti content of Si/Ti 50, the Ti (2p 3/2 ) line was shifted to 458.0 eV, which is close to the binding energy of Ti (2p 3/2 ) of pure TiO 2 .As can be seen in Fig. 6e andf and Table 2, the deconvoluted XPS spectra of Ti-KIT-6 (Si/Ti ratios of 100 and 50), depicted two peaks at 533 eV for Si-O-Si and 530.8 eV corresponding to Ti-O-Ti.These indicate that there is more free TiO 2 phase formation in Ti-KIT-6 (Si/Ti 50) than in Ti-KIT-6 (Si/Ti 100) material.This is also in accordance with the findings of the UV-Vis and TEM analysis techniques. Blank tests conducted without photocatalysts as well as the reactions in the dark with catalysts, have shown no product formation, which indicates that the products obtained during the reaction are merely photocatalyst based.The preliminary screening catalytic activity tests were performed to obtain the optimized catalysts only on the base of CH 4 by FID detector as shown in Fig. 7a-c.Fig. 7a shows CH 4 production rate comparison of the Ti-SBA-15-S (calcined or dried) series after 3 h of reaction time using 100 CO 2 .Overall, Ti-SBA-15-S (dried, Si/Ti ratios of 100, 50) are better in activity than the Ti-SBA-15-S (calcined, Si/Ti ratios of 100, 50), since due to comparatively better physical characteristics and the Ti dispersion.However, the activity of Ti-SBA-15-S (dried, Si/ Ti 200) is less than the Ti-SBA-15-S (calcined, Si/Ti 200), due to the small Ti content which might be trapped in the dried structure.Therefore, Ti-SBA-15-S (dried, Si/Ti 100) was found to be the most optimized in this series.However, as shown in Fig. 7b, Ti-KIT-6-calcined series clearly showed better activity than the Ti-KIT-6dried series as well as Ti-SAB-15-S-calcined/dried series.This might be due to the fact that some Ti species in Ti-KIT-6-dried materials were not accessible on surface for the reaction, and might have been trapped in the bulk dried KIT-6 powder during the synthesis 40.However, this might not be the problem in the case of Ti-KIT-6-calcined, where the 3-D pore structure was fully developed in the calcined KIT-6.Therefore, the greater number of accessible active sites in Ti-KIT-6-calcined than in Ti-KIT-6-dried may have caused higher activity.Similar to Ti-SBA-15-S series, Ti-KIT-6 (calcined, Si/Ti 100) was found to be the most optimized photocatalyst.As shown in Fig. 7c, the optimized Ti-KIT-6 (calcined, Si/Ti 100) has also shown much better activity, in terms of Ti content, than the best commercial Aeroxide (Degussa) P25 TiO 2 .Later on, optimized Ti-KIT-6-calcined series (Si/Ti ratios of 200, 100, 50) was explored to see other possible products on the availability of TCD and FID detectors.The main desired product is CH 4 as it has a greater energy or heat content 41 than H 2 or the produced syngas (CO H 2 ), whereas CH 3 OH (vapors) is a minor product obtained.It is clear that Ti-KIT-6 (calcined, Si/Ti 100) shows higher activity than the Si/Ti ratios of 200 or 50, due to the combined contribution of the high dispersion state of the Ti-oxide species, which is due to the large pore size with a 3-D channel structure, and the lower formation of Ti-O-Ti or TiO 2 agglomerates, as confirmed by UV-Vis, TEM and XPS analyses.Moreover, the high production of CH 4 for Ti-KIT-6 (Si/Ti 100) with a greater concentrations of the OH groups (2 nm A1 ) than the other ratios (Si/Ti 200, 50: 1.5 and 1.2, respectively) obtained from the FT-IR of the materials and shown in Table 2, actually affects the adsorption properties of the water on the catalyst surface 24.A competitive adsorption between the H 2 O vapors and CO 2 is another parameter that can determine the selectivity of CH 4 or CH 3 OH.CH 4 formation selectivity becomes higher as H 2 O vapor adsorption increases due to the greater concentration of OH groups or hydrophilicity of the material 28. The photocatalytic reduction mechanism of CO 2 with H 2 O vapors is a complex phenomenon, where two aspects regarding the rate limiting step should be taken into consideration.CO 2 is a thermodynamically stable and chemically inert compound and it is difficult to oxidize or reduce it to various intermediate chemicals under normal operating conditions. As shown in Eq. ( 1), a single electron reduction of CO 2 to an anion radical A CO 2 A has a very strong negative electrochemical potential of A1.90 V 4, which is thermodynamically unfeasible for any semiconducting material to provide a single photogenerated electron to a CO 2 molecule.Unlike to CO 2 , the standard potential of H 2 O to generate H 2 is much lower and is viable.Even though it is unfeasible to transfer a single photogenerated electron to a CO 2 molecule, it is possible to conduct the proton-assisted transfer of multiple electrons.Therefore, as shown in Eqs. ( 2) and ( 3), H 2 and CO formation is comparatively favorable as they need a lower number of electrons and protons 42, while CH 4 and CH 3 OH require more electrons and protons and are difficult to form as shown in Eqs. ( 4) and (5). In this context, the best possible way of activating the inert CO 2 molecule for reduction purposes, is to adsorb it on the surface of any semiconductor, which lowers its energy barrier 43.Therefore, in the current work, the adsorption of CO 2 and H 2 O is the main focus.Fig. 8 shows the reaction mechanism with the detailed steps and necessary pathways to achieve the required energy bearing products.Therefore, before starting the reaction, the CO 2 and H 2 O vapors were adsorbed to obtain a good adsorption of these reactants on the photocatalyst surface.However, as can be seen in Fig. 8, H 2 O, as a polar (1.85D) molecule shows a greater tendency to be adsorbed than CO 2 , which has a lower dipole moment (0D); it indicates that both H 2 O and CO 2 compete for adsorption. Moreover, the carbene pathway has been found to be wellsuited in the present contest, as CO 2 photocatalytic reduction active sites are isolated tetrahedrally coordinated Ti 4 centers which are embedded in silica/zeolite matrices 4.The quantum confinement effects in these spatially separated 'single-site photocatalysts', upon UV light absorption, cause charge-transfer excited states to be formed.Reaction mechanism shown in Fig. 8 indicates that, these excited states, i.e., (Ti 3 -O A ) , contain the photogenerated electron and hole which are more localized on neighboring atoms 4,44 and are closer than in bulk semiconducting materials, where the charge carriers are free to diffuse.Also, the lifetime of the excited Ti 3 -O A is found to be 54 ls 45.This lifetime is substantially higher than that of bulk TiO 2 powder, which is instead of a nanosecond order.Therefore, these active sites in Ti-KIT-6 materials, i.e., (Ti 3 -O A ) , are more energetic and longer living than in bulk TiO 2 .As shown in Fig. 8, CO 2 and H 2 O are being adsorbed on the surface of the photocatalyst, with competitive adsorption, due to their different dipole moments.The active sites for the adsorption of the reactants are Ti-OH.As the UV light is turned on, the adsorbed CO 2 and H 2 O vapors interact with the photoexcited active sites, i.e., (Ti 3 -O A ) .This induces the formation of intermediates, including CO, which can be an intermediate as well as a released product, which is shown in Fig. 8. Ultimately, C, H and OH radicals are formed which can further combine to form other products, such as CH 4 , H 2 and CH 3 OH.Therefore, the adsorption and the concentration of OH groups play a key role in the reaction mechanism to achieve selective products. The reaction was further improved by using the diluted CO 2 (20) in feed to increase the concentration of H 2 O vapors in the reaction.The optimization step improved the fuel products, however, the products were further increased by optimizing the factors which affect the photocatalytic activity.These factors including UV light sources and their intensities, H 2 O/CO 2 ratios, forms of the catalyst shapes used (powder, pellets, film), have been optimized to increase the fuel products. The main factor that directly affects the initiation of a photocatalytic reaction is light, whether it is UV or solar light.In photocatalytic reactions, UV lights are of common sources of illumination and usually provide 100-400 nm range of wavelength.Moreover, usage of light with a shorter wavelength for irradiation, is definitely more effective but not economical.Therefore, the selection of the optimum light for a specific semiconducting material in a photocatalytic reaction is of vital interest. Two different types of UV lamps with similar UVA and UVB ranges but different in intensities and temperatures and with powers of 200 and 300 W have been exploited in the current work to explore and optimize the effect of light on the catalytic activity.The difference in the production rates and a comparison of the average production rates of the products obtained from optimized Ti-KIT-6-calcined (Si/Ti 100) photocatalyst is shown in Fig. 9.The results indicate that the 300 W lamp is more useful in this reaction than the 200 W lamp.The 300 W lamp has more photon power, more UVB intensity and produces a higher temperature, which boosts the CO 2 reduction path.Therefore, more fuel products are produced when the 300 W lamp is used. Another factor that affects this reaction is the light intensity.As the light intensity increases, the number of generated photons increases, and this leads to more electron-hole pairs being excited with high energy 46.The effect of light intensity on the production rate and average production rate of the products via optimized Ti-KIT-6-calcined (Si/Ti 100) photocatalyst is shown in Fig. 10.Three different distances (70, 35 and 10 cm) have been explored between the lamp and the catalyst in the reactor to acquire different light intensities.As shown in Fig. 10a andd, products formation is lower at a distance of 70 cm.Moreover, the reaction kinetics is slower, due to the low light intensity.However, as can be observed in Fig. 10b ande, when the distance is reduced to 35 cm, the light intensity increases and the production rate increases remarkably with faster reaction kinetics and long-term product formation stability.Fig. 10c and f shows that, as the distance is further decreased to 10 cm, the product formation increases and very fast reaction kinetics occurs at the beginning of the reaction process, which is due to the increased light intensity.However, in this case, after 3 h of illumination, the reaction shows a deactivation trend, which could be caused by the rapid saturation of the active sites, due to the fast reaction kinetics and increased temperature from the light. Recent research indicates that H 2 O vapors have shown a green chemistry approach towards CO 2 reduction to fuels, however, reaction is mainly dependent on the H 2 O/CO 2 molar ratio 47.The effect of different H 2 O/CO 2 ratios on the activity of the optimized Ti-KIT-6-calcined (Si/Ti 100) photocatalyst is shown in Fig. 11.Different ratios were explored to achieve the best ratio to maximize the fuel products.Fig. 11a-d indicates that CO 2 conversion increases as the H 2 O/CO 2 ratio increases from 0.1 to 0.3, whereas, an excessive amount of H 2 O (H 2 O/CO 2 0.4) has comparatively suppressed the overall reaction, which is in agreement with the literature 48. Another key parameter to be optimized is the shape of a catalyst that affects product formation as is the potential use of the catalyst for commercial applications 49,50.The powder form of the catalyst has been compared with that of pellets (500 micron) and thin film, as shown in Fig. 12a-f.The pellets and thin film showed comparatively higher activity than the powder shape of the photocatalyst, which is in accordance with the literature 50,51.In pellets and film shapes of the photocatalyst, the better exploitation of the surface that is available for the adsorption of CO 2 and H 2 O, and the better penetration of the UV light, which is necessary to initiate a photocatalytic reaction are the main causes of the superior activity.Moreover, better reaction kinetics and better long-term photocatalytic stability have also been observed for the pellets and thin film than for the powder. Water vapors have a significant role in CO 2 photocatalytic reaction to fuel products.This essential role of water vapor has been confirmed, which is shown in Fig. 13.This indicates that the reaction could not pursue in the absence of water vapors as well without UV light.Moreover, as shown in Fig. 13, the color of the photocatalyst changed and a slight photocatalytic deactivation was observed.The deactivation mechanism is not still clear, but could be due to the partial saturation of the active sites for adsorption, on the photocatalyst surface, with intermediate product/by-product/mixture formation.Moreover, after formation, some products as CH 3 OH and CO were supposed to be not desorbing fully from the catalysts surface and could be re-oxidized back into CO 2 through the O 2 produced during reaction 52.There was not a significant decrease in the physical properties (S BET , PV and APD) of the used catalyst.This indicates that there is physisorption of water and other species as well as saturation of the active sites.The deactivated catalyst was naturally dried for 24 h.After the regeneration, this acquired again more than 90 of the activity which indicates that most of the adsorbed species were desorbed away.The final stability test of the optimized Ti-KIT-6-calcined (Si/Ti 100) photocatalyst under the optimized reaction conditions for extended reaction time of 10 h has shown (Fig. 14) that there is a slow deactivation trend than the reaction under the standard operating conditions.This indicates that the deactivation is not due to a single factor.Therefore, for a more clear understanding about the deactivation, a separate in-depth study is recommended to explore the exact nature and the causes of these deactivating species."
  },
  {
    "title": "Conclusions",
    "content": "Optimization of the novel synthesized Ti-mesoporous silica (SBA-15-S, KIT-6: calcined or dried) materials with different Si/Ti ratios (200, 100 and 50) has revealed that the Ti-KIT-6-calcined (Si/Ti 100) was the most optimized photocatalyst than the other materials explored in this study, in the activity of CO 2 reduction with water vapors to renewable fuels.This was due to the presence of more accessible surface reaction active sites in the Ti-KIT-6-calcined (Si/Ti 100), which were due to the lower number of Ti-O-Ti or TiO 2 agglomerates, and to the more isolated Ti species, which were uniformly dispersed on the 3-D KIT-6 mesoporous silica support without collapsing the mesoporous structure.The increased surface concentrations of OH groups found in the Ti-KIT-6-calcined (Si/Ti 100) also boosted higher activity.The reaction mechanism indicates that the reaction proceeds mainly by the competitive adsorption of CO 2 and H 2 O vapors on the catalyst surface.The UV light source, UV intensity, H 2 O/CO 2 ratios and catalyst shapes are the key factors that influence the performance of the catalyst, and therefore, these parameters have here been optimized to increase the renewable fuel products.The partial saturation of the active adsorption sites by means of the products or by-products or mixture formation are supposed to be the main possible causes of the deactivation.The O 2 produced in the reaction is also considered as a redundant, as it might promote the deactivation by means of oxidation of the products back to CO 2 .A simple evaporation technique can quickly regenerate the photocatalyst.However, a separate in-depth study is recommended to explore the exact nature and the causes of these deactivating species.Moreover, one of the main hurdles to overcome for photocatalytic reaction to be practical is source of light to initiate the reaction.The wavelength of solar light is not sufficiently short for this scheme.However, CO 2 conversion utilizing solar energy is fundamentally very important for the sustainable future.Therefore, we hope that the development of the photocatalysis with nanomanufacturing will realize CO 2 reduction with solar energy in the near future.These findings indicate that the optimized photocatalyst is a promising candidate for this application in the future research. Fig. 2. N 2 adsorption/desorption isotherm and pore size distribution trends of: (a and b) SBA-15-S calcined and Ti-SBA-15-S-calcined series, (c and d) Ti-SBA-15-S-dried series, (e and f) KIT-6 calcined and Ti-KIT-6-calcined series (g and h) Ti-KIT-6-dried series. Fig. 3. SEM images showing the differences in morphology of: (a and b) SBA-15-S calcined, (c and d) Ti-SBA-15-S-calcined (Si/Ti 100), (e and f) Ti-SBA-15-S-dried (Si/ Ti 100), (g and h).KIT-6 calcined, (i and j) Ti-KIT-6-calcined (Si/Ti 100), (k and l) Ti-KIT-6-dried (Si/Ti 100). Fig. 4. UV-Vis spectra of Ti-KIT-6-calcined series (Si/Ti 200, 100, 50 ratios). Fig. 5. TEM images of: (a) KIT-6-calcined, (b) Ti-KIT-6-calcined (Si/Ti 200), (c) Ti-KIT-6-calcined (Si/Ti 100) and (d) Ti-KIT-6-calcined (Si/Ti 50). Fig. 6.XPS analysis of Ti-KIT-6-calcined (Si/Ti 100, 50 ratios) materials showing the difference in: (a and b) overall scan, (c and d) Ti (2p 3/2 ) deconvolution, and (e and f) O (1s) deconvolution spectra. Fig. 7. Methane/fuel formation comparison after 3 h of photocatalytic reduction of CO 2 and H 2 O vapor.(a) Ti-SBA-15-S-calcinded vs. dried series, (b) Ti-KIT-6-calcinded vs. dried series, (c) optimized Ti-KIT-6-calcined (Si/Ti 100) vs. commercial Degussa (Aeroxide)-P25 on Ti basis, (d) fuel production rate over KIT-6-calcined (Si/Ti 200), (e) fuel production rate over KIT-6-calcined (Si/Ti 100), (f) fuel production rate over KIT-6-calcined (Si/Ti 50), at standard operating conditions with 100 CO 2 , 0.5 g of photocatalyst, 50 mL/min flow rate, H 2 O/CO 2 0.02, 300 W UV lamp. Fig. 8. Reaction mechanism and pathways of the photocatalytic reduction of CO 2 with H 2 O vapor to fuels. Fig. 9.The UV light source effect on the activity of the optimized Ti-KIT-6-calcined (Si/Ti 100) photocatalyst: (a and c) 200 W UV lamp, (b and d) 300 W UV lamp, at standard operating conditions with 20 CO 2 , 0.2 g of photocatalyst, 50 mL/min flow rate, H 2 O/CO 2 0.1. Fig. 10.Effect of different UV light intensities on the activity of the optimized Ti-KIT-6-calcined (Si/Ti 100) photocatalyst: (a and d) 70 cm, (b and e) 35 cm, (c and f) 10 cm, at standard operating conditions with 20 CO 2 , 0.2 g of photocatalyst, 50 mL/min flow rate, H 2 O/CO 2 0.1, 300 W UV lamp. Fig. 11.Effect of different H 2 O/CO 2 ratios on the activity of the optimized Ti-KIT-6-calcined (Si/Ti 100) photocatalyst: (a) 0.1, (b) 0.2, (c) 0.3 (d) 0.4, at standard operating conditions with 20 CO 2 , 0.2 g of photocatalyst, 50 mL/min flow rate, 300 W UV lamp. Fig. 12.Effect of different catalyst shapes of the optimized Ti-KIT-6-calcined (Si/Ti 100) photocatalyst on the activity: (a and d) powder, (b and e) pellets, (c and f) film, at standard operating conditions with 20 CO 2 , 0.2 g of photocatalyst, 50 mL/min flow rate, H 2 O/CO 2 0.1, 300 W UV lamp. Fig. 13.Confirmatory test of effect of water vapor on the activity of the optimized Ti-KIT-6-calcined (Si/Ti 100) photocatalyst, and catalyst deactivation/ regeneration. Fig. 14.Stability test of the optimized Ti-KIT-6-calcined (Si/Ti 100) photocatalyst under the optimized reaction conditions for 10 h of the reaction: 0.2 g pellets, with 20 CO 2 , 50 mL/min flow rate, H 2 O/CO 2 0.3, 300 W UV lamp with 35 cm distance. Physical properties of the synthesized Ti-mesoporous silica materials. S BET (BET specific surface area in m 2 /g); PV (cumulative pore volume in cm 3 /g); APD (average pore diameter in nm), n.d.(not determined).Used catalyst (BET after drying). Comparison of band gap energies, surface hydroxyl groups and Ti (2p 3/2 ) and O (1s) atomic concentrations of different Ti-KIT-6 materials. n.d.(not determined). M. Hussain et al. / Chemical Engineering Journal 278 (2015) 279-292 M. Hussain et al. / Chemical Engineering Journal 278 (2015) 279-292 The financial support from the Eco 2 CO 2 European Project (309701-2 Eco 2 CO 2 CP-FP FP7-NMP-2012-SMALL-6) is gratefully acknowledged."
  }
]