[
  {
    "title": "Doi",
    "content": "10.1039/c4pp00407h"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic reduction of CO2 over platinised Bi2WO6-based materials"
  },
  {
    "title": "Abstract",
    "content": "The photocatalytic reduction of CO 2 with H 2 O to produce CH 4 in the gas phase was carried out in the presence of two Bi 2 WO 6 -based materials.For this purpose, single Bi 2 WO 6 and a coupled Bi 2 WO 6 -TiO 2 system were synthesised and metallised with Pt, through a Pt photodeposition method.Then, the samples were characterised and the photocatalytic activity was evaluated in a continuous fluidised-bed reactor irradiated with UV light.Single Bi 2 WO 6 presents an interesting behaviour under H 2 O rich conditions.In particular, the metallisation improves the material's performance for CH 4 formation, while the TiO 2 addition to Bi 2 WO 6 increases the CH 4 yield only at low H 2 O/CO 2 ratio.The Bi 2 WO 6 -TiO 2 system metallised with a Pt photocatalyst displayed the highest CH 4 yield among all the prepared photocatalysts.The stability of the system can be enhanced through the addition of a blue phosphor to the reactant mixture, especially under H 2 O rich conditions."
  },
  {
    "title": "Experimental",
    "content": "Catalysts were prepared by following a procedure that was described elsewhere. 28,29Briefly, for the preparation of single Bi 2 WO 6 , two solutions, one of Bi(NO 3 ) 3 5H 2 O (0.01 mol) in glacial acetic acid (10 mL) and a second one of Na 2 WO 4 2H 2 O (0.005 mol) in bidistilled water (90 mL), were mixed to form a white suspension that was kept under stirring for 1 hour.Then, the suspension so obtained was submitted to hydrothermal treatment at 140 C for 20 h in a Teflon recipient inside a stainless steel autoclave.The precipitate was then filtered, repeatedly washed, dried overnight at 120 C and calcined at 300 C for 4 hours. The Bi 2 WO 6 -TiO 2 system was prepared by using commercial TiO 2 -P25.For this purpose, a corresponding amount of TiO 2 (50 wt) was added to the white suspension of the Bi-W precursors.Then the resulting mixture was submitted to hydrothermal treatment and calcined under the same conditions as that for Bi 2 WO 6 .This sample was named BiWO-Ti50i. The samples previously obtained were metallised with low Pt content (0.5 wt) following a photodeposition method. 30For this purpose, a necessary amount of H 2 PtCl 6 (Aldrich 99.9) as the metallic precursor was added to a solution of 2-propanol (0.3 M) used as a sacrificial agent.Afterwards, the suspension of the catalyst in this solution was irradiated under a continuous flow of N 2 to avoid reoxidation, with an Osram Ultra-Vitalux lamp with a sun-like radiation spectrum and a main emission line in the UVA range at 365 nm.An irradiation intensity of 60 W m -2 was used for 2 h, after which the powders were filtered, repeatedly washed and dried overnight at 110 C.The names for these materials will be related to those of the samples without platinum, being in this case: Pt-BW and Pt-BiWO-Ti50i. The crystalline phase and the degree of crystallinity of the samples were estimated by X-ray diffraction (XRD).XRD pat-terns were obtained on a Siemens D-501 diffractometer by using Cu K radiation (0.15406 nm). The BET surface area and porosity measurements were carried out by N 2 adsorption at 77 K using a Micromeritics 2010 instrument. The chemical composition of the samples was determined by X-ray fluorescence spectrometry (XRF) in a Panalytical Axios sequential spectrophotometer equipped with a rhodium tube as the source of radiation.Some micrographs were obtained through TEM measurements performed using a Philips CM200 instrument.The samples were dispersed in ethanol using an ultrasonicator and dropped on a copper grid. UV-vis spectra were recorded by using a Cary 100 (Varian) spectrometer in the diffuse reflectance mode (R) and transformed to a magnitude proportional to the extinction coefficient (K) through the Kubelka-Munk function, F(R).For the measurements, pellets of a mixture of samples with BaSO 4 that do not absorb in the UV-vis radiation range (white standard) were prepared.The scan range was 200-800 nm.Band gap values were estimated from the plot of the Tauc function against the photonic energy, following the method of Tandon and Gupta. 31-ray photoelectron spectroscopy (XPS) was conducted on a Leybold-Heraeus LHS-10 spectrometer working with a constant pass energy of 50 eV.The spectrometer main chamber was maintained at a pressure 2 10 -9 Torr, and the machine was equipped with an EA-200 MCD hemispherical electron analyzer with a dual X-ray source of Al K (h) 1486.6 eV at 120 W and 30 mA.The samples were outgassed in the prechamber of the instrument at 150 C up to a pressure of 2 10 -8 Torr to remove chemisorbed water from the surface. A continuous gas-solid photocatalytic fluidised-bed reactor was used to perform the photocatalytic tests.A more detailed description of the photoreactor can be found in previous studies. 32,33The reactor was illuminated by two ultravioletlight-emitting diode (UV-LED) modules positioned in front of the Pyrex windows.Each UV-LED module consisted of 40 pieces (supplied by Nichia Corporation) with a wavelength peak of 365 38 nm.The light intensity emitted by the UV-LEDs and entering into reactor was 90 mW cm -2 .The reaction temperature was controlled by a PID controller connected to a heating system and installed in the reactor. In the first configuration, a gas stream of CO 2 (flow rate of 30 L h -1 (STP) controlled by mass flow controllers, Brooks Instruments) was fed through a saturator with H 2 O at controlled temperature.In this way, two H 2 O concentrations in the feeding stream were evaluated: 2 and 4 vol. In the second configuration, a He stream was fed through the saturator with H 2 O, while CO 2 (1 vol) was independently supplied to the system, in order to evaluate different H 2 O/CO 2 ratios in a range of 0.1-2.0. Prior to the tests, 2.2 g of the photocatalyst were mixed with 20 g of glass spheres (Lampugnani Sandblasting HI-TECH, 70-110 m of the grain size) to ensure fluidization.Then, the mixture was added to the reactor and pre-treated with the helium stream while heating.Dark equilibrium adsorption of CO 2 was achieved prior to the photocatalytic tests.UV-LED modules were switched on after the complete adsorption of CO 2 on the catalyst surface. Additional tests in the presence of blue phosphors were carried out.For this purpose, 1 g of a commercial phosphor (RL-B model supplied by DB Chemic with excitation and emission wavelengths of 356 and 440 nm, respectively) was added to a mixture of photocatalyst and glass spheres and the same procedure was followed at several H 2 O : CO 2 ratios. The gas composition was continuously monitored by using an online quadrupole mass detector (Trace MS, ThermoQuest) and a continuous CH 4 -CO-CO 2 NDIR analyser (Uras 10, Hartmann Braun).In this way, CH 4 and CO 2 were analysed, although CO was also followed as a possible reaction intermediate."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Characterisation XRF analysis of the metallised samples was carried out.The results in terms of Pt and TiO 2 contents are presented in Table 1.In all the cases, the Pt content agrees well with the nominal amount, being close to 0.5 wt.On the other hand, the estimated amount of TiO 2 in Pt-BiWO-Ti50i also agrees with the expected content. S BET values are also displayed in Table 1.The coupled Bi 2 WO 6 -TiO 2 sample exhibits a surface area between those of single Bi 2 WO 6 and TiO 2 -P25.According to the calculated values, the photodeposition of Pt does not change the S BET in the platinised materials.Additionally, no change in the pore size distribution was found after platinisation. The XRD of the different materials were measured before and after photodeposition, with no evident change in the patterns and no appearance of any peak ascribed to Pt.The results for the metallised samples are presented in Fig. 1.It is possible to observe that all the materials exhibit two main signals corresponding to the russellite Bi 2 WO 6 (JCPDS 39-0256) at 28.3and 32.9, with the second one associated with the contribution of (060), ( 200) and (002) planes.In Pt-BiWO-Ti50i an anatase-TiO 2 peak is observed, as expected due to the relevant amount of TiO 2 present. The crystallite sizes were calculated from the XRD spectra with the Scherrer equation.The estimated values are collected in Table 1, where very similar sizes can be found for the different samples with almost negligible influence because of the presence of TiO 2 . By the UV-vis spectra (see Fig. S1 in ESI ), it is possible to see the influence of platinum on the absorption properties, with the appearance of a secondary band in the visible range ( 450 nm).This effect has been ascribed to the low energy transitions between the semiconductor and the localised states of the metal clusters. 34The major influence is found in the Pt-BW sample, which also displays a higher absorption in the visible range, prior to and after platinisation.It might also be observed in Table 1, from the estimated band gap values, that there is a decrease in this value for the BW sample from 2.8 to 2.5 eV due to the Pt presence, as also observed by other authors 35 in the PtCl 4 /Bi 2 WO 6 systems.In the case of the BiWO-Ti50i sample, the addition of TiO 2 slightly increases the band gap in comparison with the single Bi 2 WO 6 ; though the platinisation does not induce significant changes. As seen from the TEM micrographs in Fig. 2, BiWO-Ti50i consists of two fundamental types of structures: lamellar particles that might be associated with Bi 2 WO 6 , formed through an anisotropic growth mechanism, 21 and roundish particles of different sizes, related to TiO 2 -P25.The platinisation of these materials induces the appearance of small Pt nanoparticles on the surface (Fig. 2B andC).However, a poor distribution is observed, probably due to the low metal content and due to the fact that metal clusters could have some preference for certain sites on the sample.In the case of Pt-BW, given the tendency of this material to self-assemble, it was difficult to obtain good images.However, some isolated zones in which small Pt particles deposited can be found, as shown in Fig. 2D.Despite the presence of the metal on the surface of Pt-BiWO-Ti50i, platinum peaks obtained by XPS analysis had very low intensities, probably due to a high dispersion and low particle size of the Pt particles.In contrast, the XPS Pt 4f zone for Pt-BW clearly showed the Pt doublet as seen in Fig. 3.The deconvolution of these peaks reveals an incomplete reduction of Pt 4 to Pt 0 , with the presence of a doublet state at 75.8 and 72.5 eV, related to Pt 2 species. 36This fact might be explained by the low reducing power of Bi 2 WO 6 , associated with its conduction band position. 37This oxidised species has been claimed to have a positive influence on photoactivity, despite its lower efficiency when compared to metallic nanoparticles.In this case, the role can be explained by a successive reduction/oxidation process under the illumination of a photocatalyst. 38 All the photocatalysts were tested in the CO 2 photo-reduction under several reaction conditions.When UV light was switched on, the products were continuously monitored until reaching stable conditions.The main detected product was CH 4 . The temperature for all the tests was set to 140 C as previous studies carried out at lower values with BiWO-Ti50i and Pt-BiWO-Ti50i between 60 and 140 C showed that temperatures between 100 and 140 C were the optimal ones (see Fig. S2 in ESI ). CH 4 yields (expressed as mol g -1 h -1 ) were estimated and the results are presented in Fig. 4.Under a low H 2 O/CO 2 ratio, a very low yield of CH 4 is obtained with single BW.However, an improved behaviour can be observed in the heterostructure as a consequence of coupling of Bi 2 WO 6 with TiO 2 -P25.In this sense, BiWO-Ti50i displays better CH 4 yields than both single materials. On the other hand, the right part of Fig. 4B displays the obtained yields with the platinised materials.In this case, it is obvious that platinisation plays an interesting role in CO 2 photo-reduction.The two platinised samples with and without TiO 2 exhibit great improvements associated with the Pt presence.It has been claimed that nanoparticles of noble metals such as Pt can play an important role in the mechanism of CO 2 photocatalytic reduction, not only by enhancing the charge separation, but also by catalysing the multistep process of CO 2 conversion into different products. 39Similar to the situation of the non-platinised materials, the coupled system displays the highest CH 4 yield (6.7 mol g -1 h -1 ).Concerning platinised TiO 2 , it has been claimed that Pt nanoparticles on the surface could act as electron traps thus avoiding to some extent the recombination processes. 38,40In the case of Pt-Bi 2 WO 6 systems, the same situation can take place, as proposed for Ag-Bi 2 WO 6 41 and PtCl 4 -Bi 2 WO 6 systems. 35This aspect is very important, as the CO 2 photoreduction process requires multielectronic transfers, i.e. eight electrons in order to obtain CH 4 , instead of the single electron mechanism employed in other reactions. 42In the Pt-BW sample, the less reduced Pt 2 species can act as electron traps, through a reduction path of the oxidised species to metallic Pt, as indicated by some authors. 35This mechanism can explain the important differences in the CH 4 yield between single BW and Pt-BW under these conditions. Regarding the BiWO-Ti50i system, an enhanced charge transfer between Bi 2 WO 6 and TiO 2 has been previously proposed, leading to a synergistic mechanism.Moreover, the conduction band of Bi 2 WO 6 presents a more positive edge than that of TiO 2 ; 43 for this reason, the direct reduction of CO 2 would be thermodynamically less favoured with the former. The effect of a higher H 2 O/CO 2 ratio has also been evaluated in Fig. 5.Under these conditions, it is interesting to find that BW is more efficient than BiWO-Ti50i and TiO 2 -P25 (Fig. 5A).In this situation, the presence of TiO 2 does not have a positive effect and, even in the test with single TiO 2 -P25, the CH 4 yield decreases by almost half. The important influence of the H 2 O/CO 2 ratio on the amount of CH 4 has been previously remarked upon by Anpo et al. 44 According to their studies, small increments in the ratio can improve the CH 4 yield; however, after a certain H 2 O amount, the CO 2 photo-reduction can be suppressed.Clearly, this influence depends on the nature of the photocatalyst. In general terms, it has been proposed that the mechanism goes through some steps that involve the reaction of the photogenerated holes with the adsorbed H 2 O on the catalyst surface, producing OH radicals and H ions.After this, the reaction of these radicals with H 2 O and the holes could lead to the formation of O 2 and H .Finally, the H ions and the electrons are able to form hydrocarbons as CH 4 with the ( C) radicals. 17,45igher amounts of H 2 O are expected to increase the concentration of OH radicals which eventually could re-oxidise CH 4 into CO 2 , thus decreasing the efficiency of the process.Besides this, it has been stated that the presence of O 2 as an adsorbed species can compete with CO 2 for the electrons, through the formation of superoxide radicals (O 2 -), 13 which in fact are also oxidising species.These processes could explain the important decrease in the efficiency associated with the higher H 2 O/CO 2 ratio.In the case of BW, its lower photoactivity compared to the coupled system plays in its favour under these conditions.Moreover, some authors have proposed that the direct formation of superoxide radicals is not thermodynamically allowed in Bi 2 WO 6 , given the redox potential associated with its conduction band.Hence, O 2 -species can be produced with this material only by multielectron mechanisms through the formation of O 2 H species. 43 Conversely, materials with TiO 2 exhibit better oxidising properties and thus are negatively affected by higher water contents. Regarding the platinised samples (Fig. 5B), CH 4 yields also decrease in comparison with the results obtained under a low H 2 O/CO 2 ratio.The platinisation of BW slightly lowers the formation of CH 4 when higher H 2 O ratio is fed into the system.From the obtained result for the non-platinised BW, this can be expected, as platinisation could probably enhance the multielectron process of superoxide radical formation. In the case of the Pt-BiWO-Ti50i heterostructure, both the platinisation effect and the negative influence of TiO 2 under rich water conditions affect the final behaviour of the material.For this reason, there is still an improvement between the nonplatinised and platinised samples under these conditions.However, an obvious decrease in the yield from 6.7 to 2.7 mol h -1 g -1 can be seen when low and high H 2 O/CO 2 ratios are compared. Phosphors are emitting phosphorescent particles with enough afterglow time and appropriate wavelength emission for exciting and activating the photocatalyst.Through this effect, the catalytic surface that is irradiated can be increased and the limitations for the photons to penetrate the reactor core volume can be overcome, 46,47 thus significantly increasing the process efficiency.For this purpose, additional tests with several H 2 O/CO 2 ratios with mixtures of blue phosphors and Pt-BiWO-T50i were performed. The evolution of the CH 4 signal in the test with a H 2 O/CO 2 ratio of 2.0 is presented in Fig. S3 (see ESI ).It is possible to observe that initially a significant CH 4 formation is achieved after irradiation, but a fast decrease takes place until reaching a stable concentration.The addition of phosphors improves the stability of the system by slowing down the decay in the CH 4 concentration, which is most evident in the case of higher H 2 O/CO 2 ratios.The obtained results at several ratios are collected in Fig. 6.As can be seen, both the initial CH 4 concentration and the final rate (under stable conditions) are greatly affected by the H 2 O/CO 2 ratio, with the optimal values between 0.5 and 1.0.In the presence of phosphors, the initial concentrations of CH 4 are slightly lower in comparison with the tests with only Pt-BiWO-T50i, but the values are more stable.This effect can be explained considering that phosphors absorb a significant part of the UV irradiation coming from UV-LEDs thus inhibiting the initial reduction of CO 2 by the photocatalyst.Later, an improved mechanism of photonic transference could be established between the phosphors and the photocatalyst, leading to a slower but more controlled process.Even at a H 2 O/CO 2 ratio of 3.0, the obtained CH 4 values are more stable.Moreover, the final CH 4 rate seems to be slightly improved between ratios of 1.0 and 3.0. The quantum yield for the Pt-BiWO-Ti50i sample (at H 2 O/ CO 2 of 2.0, in the presence of phosphors) was calculated as the ratio between the number of CH 4 molecules produced per second and the number of photons entering the reactor per second. 32The obtained quantum yield is about 0.03, which is in the range of 0.002-0.0049reported for the photocatalytic CO 2 reduction in a batch reactor. 19Moreover, final CH 4 yields of about 8-9 mol h -1 g -1 can be obtained under different H 2 O conditions in a continuous system, while some studies with TiO 2 can be found with reported yields in a range of 0-10 mol g -1 in batch processes after several hours of irradiation. 16,17,45"
  },
  {
    "title": "Conclusions",
    "content": "Several Bi 2 WO 6 -based materials have been studied for the CO 2 photo-reduction in the gas phase, using a continuous fluidised-bed reactor.Some of the Bi 2 WO 6 -based photocatalysts demonstrate a higher activity than commercial TiO 2 -P25.Single Bi 2 WO 6 seems to exhibit a good ability in the photo-reduction of CO 2 only at high H 2 O concentrations.Although both the presence of TiO 2 and metallisation with a low content of Pt (0.5 wt) have been proved to have a positive effect on Bi 2 WO 6 for this reaction, especially under conditions of lower H 2 O feeding, Pt-BiWO-Ti50i displays the highest CH 4 yield among all the prepared photocatalysts.This behaviour is explained through the promotion effect of Pt in the withdrawal of photogenerated electrons. The final features of the metallised photocatalysts clearly depend on the properties of the starting material.In this sense, during the photodeposition process, not all Pt 4 is reduced to metallic Pt with the single Bi 2 WO 6 and some Pt 2 species are found in the metallised material.These species also seem to play a role in the improvement of the Pt-Bi 2 WO 6 sample. Adding blue phosphors in the reactor bed has a positive effect on the stability of the system, even at high H 2 O/CO 2 ratios, thanks to the improved photonic transfer to the entire reaction volume. Fig. 1 XRD patterns of the metallised materials, Pt-BW and Pt-BiWO-Ti50i. represents the peak corresponding to the anatase TiO 2 phase. Fig. 2 TEM micrographs of the BiWO-Ti50i (A), Pt-BiWO-Ti50i (B), (C), and Pt-BW (D) materials. Fig. 3 Deconvolution of the XPS spectra in the Pt 4f zone for the Pt-BW sample. Fig.4CH 4 formation yields (mol g -1 h -1 ) obtained with the nonmetallised (A) and metallised (B) materials at 140 C and 2 vol of H 2 O in the feeding stream. Fig.5CH 4 formation yields (mol g -1 h -1 ) obtained with the nonmetallised (A) and metallised (B) materials at 140 C and 4 vol of H 2 O in the feeding stream. Semi-quantitative XRF chemical analysis, S BET , crystallite size and band gap values of the different materials (non-metallised and metallised) This journal is The Royal Society of Chemistry and Owner Societies 2015 Photochem.Photobiol.Sci., 2015, 14, 678-685 683 Published on 19 December 2014.Downloaded by Universidad Autonoma de Madrid on 15/09/2015 19:37:52. This journal is The Royal Society of Chemistry and Owner Societies 2015 Published on 19 December 2014.Downloaded by Universidad Autonoma de Madrid on 15/09/2015 19:37:52.View Article Online Fig. 6 CH 4 formation yields (mol g -1 h -1 ) and initial concentrations ( ppm) obtained in the tests in the presence of Pt-BiWO-Ti50i with and without blue phosphor at different H 2 O/CO 2 ratios. The authors acknowledge financial support from Junta de Andalucia (Excellence project P09-FQM-4570) and from the Spanish \"Ministerio de Ciencia e Innovacion\" ( project ref. CTQ2011-26617-C03-02). S. Murcia Lopez also thanks CSIC for the concession of a JAE-Pre grant.V. Vaiano and D. Sannino wish to thank the University of Salerno for funding the project \"ORSA111873; Processi chimici catalitici per la produzione di energia sostenibile e l'ambiente\"."
  }
]