[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2016.10.001"
  },
  {
    "title": "Article_Title",
    "content": "Selective photocatalytic reduction of CO2 into CH4 over Pt-Cu2O TiO2 nanocrystals: The interaction between Pt and Cu2O cocatalysts"
  },
  {
    "title": "Abstract",
    "content": "Photocatalytic reduction of CO 2 with water is one of the most popular and challenging technologies to produce renewable energy.In this paper, Pt and Cu 2 O nanoparticles (NPs) were deposited on the surface of anatase TiO 2 nanocrystals, and their effects on the photocatalytic performance of TiO 2 were thoroughly studied.Based on experimental results, Pt tended to promote the production of CH 4 and H 2 .However, Cu 2 O suppressed H 2 production and exhibited lower CH 4 selectivity than that of Pt.Furthermore, when Pt and Cu 2 O were co-deposited on TiO 2 crystals, H 2 production was inhibited and CO 2 was selectively converted into CH 4 .From characterization, we found that Pt could not only capture photogenerated electrons and but also increase the electrons density on the catalyst, which were beneficial for selective CH 4 formation.In addition, co-deposited Cu 2 O enhanced the CO 2 chemisorption on TiO 2 while inhibited that of water, resulting in enhancement of CO 2 reduction and lower H 2 production.On account of the above-mentioned contribution of Pt and Cu 2 O NPs, Pt-Cu 2 O/TiO 2 catalyst showed high CH 4 selectivity towards all products from reductive reaction."
  },
  {
    "title": "Experimental",
    "content": "TiO 2 nanocrystals with co-exposed 001 and 101 facets were prepared by a solvothermal method reported in our previous work 17.First, 10 mL titanium butoxide and 1.2 mL HF solution were added into 90 mL ethanol under sonication for 1 h.The mixed solution was transferred into a 200 mL Teflon-lined autoclave and kept at 180 C for 24 h.Later, the autoclave was cooled naturally to ambient temperature.The white precipitate in the clave was collected by centrifugation, washed with ethanol and deionized water for 3 times, and then dried in an oven at 60 C for 12 h.To remove fluorine residues, the TiO 2 powder was further calcined in air atmosphere (500 C, 2 h). Pt and Cu 2 O NPs were co-deposited onto TiO 2 nanocrystals by using a chemical reduction method with the help of NaBH 4 .In a typical process, 1 g TiO 2 nanocrystal powders were dispersed in a 50 mL H 2 PtCl 6 and Cu(CH 3 COO) 2 mixed aqueous solution under stirring for 30 min.The mass ratio of Pt or Cu to TiO 2 is 1.Then 5 mL of mixed solution of NaBH 4 solution (0.1 M) and NaOH solution (0.5 M) were added into the TiO 2 suspension under vigorous stirring for 30 min.After reduction, the solid samples were washed with DI water and collected by centrifugation and drying at 60 C overnight.The obtained sample was donated as Pt-Cu 2 O/TiO 2 .Besides, Pt/TiO 2 and Cu 2 O/TiO 2 were fabricated by dispersing TiO 2 into the metal precursor solution (only H 2 PtCl 6 or Cu(CH 3 COO) 2 ), which is similar to the above-mentioned method. For all samples, X-ray diffraction (XRD) patterns were recorded on an Empyrean diffractometer using Cu K radiation ( 0.1542 nm) in the range of 10-80 .The specific surface areas and pore size distribution were measured by a Micrometrics ASAP 2020 surface area and porosity analyzer.Transmission electron microscopy (TEM) images were obtained using an FEI Tecnai G 2 F30 instrument.X-ray photoelectron spectra (XPS) were recorded on a Shimadzu/KRATOS AXIS-ULTRA DLD-600W instrument equipped with Al/Mg K radiation.Photoluminescence spectra (PL) were recorded on a confocal laser Raman microscope (Horiba JobinYvon, LabRAM HR800) using a 325 nm excitation light source. In order to verify the behavior of the catalysts in the presence of CO 2 , all samples were analyzed by temperature programmed CO 2 desorption (TPD-CO 2 ).This technique enables us to analyze the types of sites existing in the materials.For the procedures in detail, 50 mg sample of powder was placed into a quartz tube reactor first, which was heated under ultra-high purity He flow (30 mL min -1 ) up to 300 C at a rate of 25 C min -1 for 1 h and then cooled to ambient temperature.After the pretreatment, CO 2 flow (30 mL min -1 ) passed through the catalyst bed for 30 min, subsequently the sample was flushed by He flow (30 mL min -1 ) for 1 h.Finally, the TPD analysis was performed under He flow (30 mL min -1 ) by heating the reactor up to 750 C (Rate: 10 C min -1 ).The effluent gas flow was monitored by a TCD detector.CO 2 photocatalytic reduction under UV light irradiation was carried out in an internal circulated reaction system (as shown in Fig. 1), including a 500 mL Pyrex glass reactor with a quartz window at the top, a 300 W Xe lamp positioned 10 cm above the reactor, and an online gas chromatography (GC).The UV light (300 nm 400 nm, 20.5 mW cm -2 ) was obtained by using a UV light reflector.10 mL of deionized water was added in the bottom of the reactor, and then 20 mg of catalyst powders was placed on a Petri plate positioned 2 cm above the water in the reactor.Prior to illumination, the reactor was first vacuumed by a pump and then was purged and filled by ultra pure CO 2 (99.999).The internal pressure of the reactor was 71 kPa and the temperature of the reactor was kept at 20 C by cooling it with circulating water.The vapor pressure of water was 2.3 kPa under this situation.During 4 h UV light irradiation, the amounts of H 2 , CO, and hydrocarbons in the reactor were analyzed by a GC every 15 min.The GC was equipped with a flame ionization detector (FID), a thermal conductivity detector (TCD), and a methanizer.The gaseous sample containing H 2 , O 2 , N 2 , CO, CO 2 , and hydrocarbons flowed through a carbon molecular sieve column (TDX-01) to flush CO 2 back to the atmosphere.After that, H 2 , O 2 , N 2 , CO, and hydrocarbons in the sample were separated by a molecular sieve 5A column.Finally, H 2 , O 2 , and N 2 in the sample were analyzed by the TCD, while CH 4 and CO (converted to CH 4 by a methanizer) were analyzed by the FID.Ar was the carrier gas of GC. Several blank experiments were performed to ensure that any carbon-containing products measured by GC indeed originated from purged CO 2 .First, tests using CO 2 and water as reactants were conducted in the empty reactor.No hydrocarbons were detected in the dark or under light irradiation in this case.This indicated that the CO 2 reduction reaction could not happen in the absence of catalyst.Also, when the reactor was vacuumed (without purged CO 2 ), no hydrocarbons were detected under UV light irradiation in the presence of water and catalyst."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Fig. 2 shows the XRD patterns of as-prepared samples.Among all the samples, TiO 2 was in anatase form and no diffraction peaks for Pt or Cu species were observed, which may result from the low loaded content or fine dispersion of metal species on the surface of TiO 2 crystals 8,20.The patterns showed that the deposition of metal species did not affect the crystal structure of anatase TiO 2 . N 2 adsorption-desorption was used to explore the textual properties of the catalysts.The BET surface area, pore volume, and pore size of the samples were summarized in Table 1.The BET surface areas of the all samples are nearly identical (ca.165 m 2 g -1 ).The loaded metal species barely affect the surface areas, pore size, and pore structure of TiO 2 nanocrystals. The TEM and HR-TEM images of the samples are shown in Fig. 3.The pure TiO 2 nanocrystal is a truncated tetragonal bipyramidal enclosed by eight 101 facets on sides and two 001 facets on the top and bottom (Fig. 3A).The side length and thickness of TiO 2 nanocrystal was approximately 50 nm and 20 nm.The ratio of the 001 facets was calculated to be around 40 based on the method reported in the literature 21.Fig. 3B-C shows the TEM and HR-TEM of Pt/TiO 2 sample.Many small black spots were observed on the surface of TiO 2 NPs.According to the interplanar spacing in Fig. 3C, these black spots were identified as Pt particles 20,22.The TEM images of Cu 2 O/TiO 2 catalysts are shown in Fig. 3D-F.The TiO 2 nanocrystals with co-exposed 101 and 001 facets was clearly observed but Cu was difficult to be found in Fig. 3D, which may be caused by the small size and low crystallinity of Cu species.In Fig. 3E, with higher resolution, Cu species deposited on the surface can be clearly observed, which existed as Cu 2 O according to the interplanar spacing shown in Fig. 3F 19.For Pt-Cu 2 O/TiO 2 catalyst (shown in Fig. 3G-H), both Pt and Cu 2 O NPs could be distinguished on the surface of TiO 2 crystals. XPS was used to investigate the chemical states of Pt, Cu, Ti, and O on the surface of the catalysts.PL spectrum was useful for the investigation of electron-hole recombination in semiconductor, which induces fluorescence.The PL spectra of the catalysts are shown in Fig. 5. Their PL spectra were similar to each other except for different fluorescence intensity.Generally, fluorescence intensity declines in accordance of reduced photogenerated electron-hole recombination 28.In our previous work 17, we found that the co-exposed 101 and 001 facets of TiO 2 nanocrystals promoted the separation of photogenerated charges because photogenerated electrons on the anatase TiO 2 nanocrystals prefer to migrate to the 101 facets while the photogenerated holes tend to transfer to the 001 facets 21,29.In this work, the deposition of Pt and Cu 2 O NPs on TiO 2 nanocrystals both suppressed the PL intensity of TiO 2 nanocrystals.This is because the Pt and Cu 2 O NPs deposited on the 101 facets of TiO 2 crystals can easily capture the photogenerated electrons accumulated on Photocatalytic activities and selectivities of as-prepared samples. CO2 chemisorbed /mol g -1 Yields/mol g Fig. 6 and Table 2 show the yields and product selectivity of H 2 , CO, and CH 4 using different catalysts.The amounts of H 2 , CH 4 , and CO all increased almost linearly with the reaction time, suggesting that the generation of H 2 , CH 4 , and H 2 over our catalysts proceeded in a steady-state manner but not a transient manner 18.Comparing to pristine TiO 2 , Pt/TiO 2 significantly enhanced the production of H 2 and CH 4 while inhibited that of CO, which can be attributed to reduced electron-hole recombination (in good accordance with the PL spectra).Differing from Pt, Cu 2 O promoted the production of CH 4 but suppressed that of H 2 .Moreover, the CH 4 yield of Cu 2 O/TiO 2 was lower than that of Pt/TiO 2 .This can be explained by the higher electron-hole recombination rate in Cu 2 O/TiO 2 , which was confirmed by comparing different PL spectra.Moreover, it seems that Pt preferred to activate H 2 O while Cu 2 O intended to reduce CO 2 , which was similar to the results from reported literatures 19,30.For Pt-Cu 2 O/TiO 2 catalyst, the productions of H 2 and CO were both effectively inhibited and CO 2 was selectively converted into CH 4 (selectivity 96.6),which may be attributed to the co-deposition of Pt and Cu 2 O cocatalysts.The product selectivity of different catalyst will be discussed later in detail. The O 2 yields during the photocatalytic reaction were also measured (Table 2).On one hand, for Pt-Cu 2 O/TiO 2 , the O 2 yield was 2.95 mol g -1 h -1 .On the other hand, we also estimated the stoichiometric yield of O 2 from the product yields of H 2 , CH 4 and CO.The calculation shows as follows: stoichiometric yield of O 2 (H 2 yield)/2 (CH 4 yield) 8 (CO yield)/2 2.87 mol g -1 h -1 , which was only slightly lower than the average production rate of O 2 , indicating that H 2 , CH 4 and CO were the main products of Pt-Cu 2 O/TiO 2 .Fig. 7 shows the cycle performance of Pt-Cu 2 O/TiO 2 catalyst.After the first cycle, the used Pt-Cu 2 O/TiO 2 catalyst was collected and the same experimental process was repeated.The yields of CH 4 and CO in the second and the third cycle were similar to those in the first cycle.This suggests that the reactions over the Pt-Cu 2 O/TiO 2 catalyst are catalytic reactions but not stoichiometric ones 18.Besides, the results in Fig. 7 also indicate that the cycle performance of Pt-Cu 2 O/TiO 2 catalyst is good under our reaction conditions. Generally, Pt serves as active site for water reduction while Cu 2 O is responsible for CO 2 reduction 19,30.Considering the possible transformation of the cocatalysts, especially Cu species, during the photocatalytic reaction, XPS spectra of the catalysts after photocatalytic reaction were also recorded and compared with those before the reaction (Fig. 8).As shown in Fig. 8A, the binding energy of Pt 4f peaks in Pt/TiO 2 catalyst remained unchanged after reaction, indicating the chemical state of Pt in Pt/TiO 2 was stable during the reaction.Combining the photocatalytic activity of Pt/TiO 2 , Pt in Pt/TiO 2 works as the active site for the reduction of CO 2 and water.For Cu 2 O/TiO 2 catalyst, the Cu existed in Cu 2 O form before reaction (Fig. 8B).After 4 h reaction, Cu 2 O was partially reduced into elemental Cu.This can be explained by the reduction of Cu 2 O by trapped photogenerated electrons.For Pt-Cu 2 O/TiO 2 catalyst (Fig. 8C-D The mechanism plays a decisive part in both the selectivity of photo-excited electrons for CO 2 reduction and that of products of CO 2 reduction.The present work has demonstrated that deposition of both Pt and Cu 2 O NPs significantly enhanced the selectivity of photogenerated electrons for CO 2 and the production of CH 4 . The catalytic performance of Pt-Cu2O/TiO2 catalyst in control experiments a . Yield/mol g a Reaction conditions: catalyst, 0.020 g; CO2 pressure, 71 kPa; H2O, 5 mL; irradiation time, 4 h.b The molar ratio of H2 to CO2 is 0.1. The results in Fig. 6 show that the high selectivity of Pt-Cu 2 O/TiO 2 for CO 2 reduction resulted from the deposited Cu 2 O, which remarkably inhibited the production of H 2 .The Cu 2 O may suppress H 2 production through three possible routes.First, the H 2 produced from water splitting may be consumed by the reduction of Cu 2 O. Second, H 2 can also be consumed by the hydrogenation of CO 2 /CO 26,31.Third, the interfacial contact between water and catalyst might be inhibited and results in low H 2 production.For example, Zhai et al. 19 found that H 2 production was suppressed when the Pt on TiO 2 was covered by Cu 2 O layer.Similarly, Xie et al. 18 reported that MgO loaded Pt/TiO 2 obviously enhanced the CO 2 adsorption on TiO 2 so that the adsorption of water on TiO 2 was inhibited, resulting in low H 2 production. Considering the low Cu 2 O loading content, the reduction of Cu 2 O cannot be the key factor for the completely inhibited H 2 production over the catalyst.In order to verify the possibility of the last two cases, we performed several control experiments to investigate the reaction pathway of CO 2 reduction over Pt-Cu 2 O/TiO 2 (as shown in Fig. 10 and Table 3).In the case of CO 2 hydrogenation with H 2 addition, the CO and CH 4 yield were much higher and lower than those with water as reductant.This indicated that H 2 reduced CO 2 into CO but was difficult to further reduce CO into CH 4 .In the case of CO reduction with water vapor, the H 2 yield was remarkably higher while the CH 4 yield was much lower than those of CO 2 reduction with water vapor.The enhanced H 2 production can be attributed to the water-gas shift (WGS) reaction, namely, CO H 2 O CO 2 H 2 1.The reduced CH 4 yield refers to the insufficiency of effective CO reduction into CH 4 by H 2 or water vapor, although CO is believed to be more active.These results demonstrate that the consumption of H 2 by CO 2 /CO hydrogenation was not the main cause for low H 2 yield of Pt-Cu 2 O/TiO 2 during CO 2 photoreduction.Based on the above-mentioned contents, we propose that CH 4 should be mainly produced through the direct photocatalytic reduction of CO 2 into CH 4 while a part of CH 4 may come from the photocatalytic reduction of CO. Moreover, we also tested the H 2 production of Pt-Cu 2 O/TiO 2 in the absence of CO 2 (Fig. 8, Table 3).Comparing to the H 2 production of Pt-Cu 2 O/TiO 2 in the presence of CO 2 , the result clearly shows the existence CO 2 obviously inhibited the production of H 2 .Considering the competitive adsorption of CO 2 and H 2 O on the surface of TiO 2 18,19,32, we suppose the low H 2 yield of Pt-Cu 2 O/TiO 2 in the presence of CO 2 is mainly caused by the suppressed water adsorption on TiO 2 due to the enhanced CO 2 absorption induced by Cu 2 O. To investigate the effect of Pt and Cu 2 O NPs on CO 2 adsorption of the catalyst, TPD-CO 2 of all the samples were performed and the results are shown in Fig. 11.The profiles of TiO 2 show CO 2 desorption at low temperatures, with T max equal to 109 C and 450 C, respectively, indicating low interaction between CO 2 and the photocatalyst.This interaction may be slightly higher for Pt/TiO 2 due to the higher desorption temperature at 341 C and 490 C. For Cu 2 O/TiO 2 and Pt-Cu 2 O/TiO 2 , their profiles show higher desorption peaks at temperatures of 148, 374, 500 C and 111, 394, and 497 C, respectively, indicating Cu 2 O cocatalyst can enhanced the interaction between CO 2 and the photocatalyst.The amounts of CO 2 chemisorbed by the catalysts were calculated and summarized in Table 2.The CO 2 chemisorption of TiO 2 was the lowest among all the samples.Besides, the effect of Pt on the CO 2 chemisorption was not obvious, however, the CO 2 chemisorption remarkably enhanced while Cu 2 O was deposited on TiO 2 .The CO 2 chemisorptions of Cu 2 O/TiO 2 and Pt-Cu 2 O/TiO 2 were 10.6 and 11.0 mol g -1 , respectively, which are much higher than that of TiO 2 (6.3 mol g -1 ) and Pt/TiO 2 (6.8 mol g -1 ), indicating an increase in the photocatalyst affinity from Cu 2 O deposition.Comparably, Paulino et al. also reported that Cu/TiO 2 obviously enhanced the CO 2 chemisorption of TiO 2 33.Combing with the results of control experiments, we confirmed our speculation that the high selectivity of Pt-Cu 2 O/TiO 2 for CO 2 reduction was mainly caused by the enhanced CO 2 absorption induced by Cu 2 O, which also led to the suppression of water adsorption on TiO 2 .However, we still cannot rule out the possibility that part of H 2 was consumed by CO 2 /CO hydrogenation and Cu 2 O reduction. It has been widely accepted by many researchers that the formation of CH 4 and CO are the compromise between charge transfer and thermodynamics 18,27.The formation of CH 4 is thermody-namically more feasible than that of CO 34.That means CH 4 will be selectively formed if enough protons and electrons are supplied.CO was formed as the main product over TiO 2 , which possibly results from the low electron density over TiO 2 .As mentioned previously, CH 4 was formed through the direct reduction of CO 2 .Thus, it is easy to understand that Pt/TiO 2 and Cu 2 O/TiO 2 exhibit higher CH 4 selectivity because both Pt and Cu 2 O NPs captures photogenerated electrons and increase the electrons density on them as evidenced by the PL spectra, which enhance the probability of multielectron reactions to form CH 4 .It is worth noting that the CH 4 selectivity further increased by loading both Pt and Cu 2 O onto TiO 2 catalyst.This is because the simultaneous loading of Pt and Cu 2 O trap photogenerated electrons and promote the separation of photogenerated electrons and holes more effectively (also proved by PL spectra). In addition, the Cu 2p XPS spectra of the fresh Cu 2 O/TiO 2 and Pt-Cu 2 O/TiO 2 catalysts (shown in Fig. 4C-D Based on the results, it can be concluded that the deposition of Cu 2 O enhanced the CO 2 chemisorption on the surface of TiO 2 , which accelerated the reduction of CO 2 and suppressed that of H 2 O.Meanwhile, the loaded Pt promoted the migration of excited electrons towards the cocatalysts and effectively enhanced the electron density on Cu 2 O particles.Consequently, the absorbed CO 2 was sufficiently supplied with photogenerated electrons and selectively reduced to CH 4 ."
  },
  {
    "title": "Conclusions",
    "content": "Pt and Cu 2 O NPs co-depositedTiO 2 nanocrystals with coexposed 001 and 101 facets were prepared through a solvothermal method combining with a NaBH 4 reduction method.Pt remarkably promoted the production of H 2 and CH 4 while suppressed the formation of CO.Cu 2 O enhanced the generation of CH 4 while suppressed the production of H 2 .When Pt and Cu 2 O were co-deposited on TiO 2 crystals, the productions of H 2 and CO were both effectively inhibited and CO 2 was selectively converted into CH 4 (selectivity 96.6).We demonstrated that CH 4 was mainly produced through the direct photocatalytic reduction of CO 2 into CH 4 rather than the hydrogenation of intermediate products such as CO.The deposition of Cu 2 O enhanced the CO 2 chemisorption on TiO 2 and inhibited that of water, resulting in enhanced CO 2 reduction and suppressed H 2 production.The Pt loading captured photogenerated electrons and increased the electrons density on the cocatalysts, which was advantageous to the selective formation of CH 4 .The high CH 4 selectivity of Pt-Cu 2 O/TiO 2 catalysts can be attributed to the co-loading of Cu 2 O and Pt NPs, which enhanced the CO 2 chemisorption and electron density on the surface of TiO 2 simultaneously. Fig. 1.Schematic of experimental setup for CO2 photocatalytic reduction. Fig. 2. XRD patterns of the as-prepared catalysts. Fig.4Ashows the high-resolution Ti 2p XPS spectra of Pt/TiO 2 .There exist two peaks in the binding energy region of Ti 2p.The binding energy of Ti 2p 3/2 for each sample is around 458.6 eV, which indicates Ti 4 in the TiO 223,24.The high-resolution O 1 s XPS spectra of all the samples in Fig.4Bcan be resolved into two peaks.The one with lower energy (around 530.0 eV) is assigned to oxygen in TiO 2 lattice (O L ) and the other (531.5 eV) can be ascribed to superficial oxygen of hydroxyl species (O H ) 17.The O H /O L molar ratio of TiO 2 , Pt/TiO 2 , Cu 2 O/TiO 2 , and Pt-Cu 2 O/TiO 2 were 0.203, 0.243, 0.269, and 0.338, respectively.This information suggests that both deposited Pt and Cu increased the amount of O H on TiO 2 , which may enhance of CO 2 adsorption and its catalytic activity 20,25,26.The high-resolution Pt 4f XPS spectra of Pt/TiO 2 and Pt-Cu 2 O/TiO 2 catalysts are shown in Fig. 4C.The Pt 4f region contains two peaks, which can be resolved into two pairs of XPS peaks.The peaks can be attributed to Pt 0 (70.6 eV, 74.1 eV) and Pt 2 (71.4 eV and 75.5 eV) 23,24.The existence of Pt 2 might result from partial oxidation of Pt NPs 27.Meanwhile, the binding energy of Pt 4 almost unchanged, showing the electron density on Pt was not influenced by co-deposited Cu 2 O. Fig. 4D shows the high-resolution Cu 2p XPS spectra of Cu 2 O/TiO 2 and Pt-Cu 2 O/TiO 2 catalysts.The binding energy of Cu 2p 3/2 for Cu 2 O/TiO 2 was ca.932.5 eV, indicating that the Cu species exist as Cu 2 O 19,26.This is in line with the results from TEM. Besides, compared to the peak position of Cu 2 O/TiO 2 catalyst, it is notable that the Cu 2p peaks of Pt-Cu 2 O/TiO 2 shows slight shift to lower binding energy, which implies that Pt promoted the electron migration towards Cu 2 O NPs.The phenomenon also indicated increased electron density on Cu 2 O NPs.PL spectrum was useful for the investigation of electron-hole recombination in semiconductor, which induces fluorescence.The PL spectra of the catalysts are shown in Fig.5.Their PL spectra were similar to each other except for different fluorescence intensity.Generally, fluorescence intensity declines in accordance of reduced photogenerated electron-hole recombination28.In our previous work17, we found that the co-exposed 101 and 001 facets of TiO 2 nanocrystals promoted the separation of photogenerated charges because photogenerated electrons on the anatase TiO 2 nanocrystals prefer to migrate to the 101 facets while the photogenerated holes tend to transfer to the 001 facets21,29.In this work, the deposition of Pt and Cu 2 O NPs on TiO 2 nanocrystals both suppressed the PL intensity of TiO 2 nanocrystals.This is because the Pt and Cu 2 O NPs deposited on the 101 facets of TiO 2 crystals can easily capture the photogenerated electrons accumulated on Fig. 3. TEM and HR-TEM images of TiO2 (A), Pt/TiO2 (B-C), Cu2O/TiO2 (D-F), and Pt-Cu2O/TiO2 (G-H) catalysts. Fig. 4. XPS spectra of the as-prepared samples: (A) High-resolution Ti 2p spectra; (B) High-resolution O 1s spectra; (C) High-resolution Pt 4f spectra; (D) High-resolution Cu 2p spectra. Fig. 5.The photoluminescence spectra of the catalysts. Fig. 6.H2 (A), CO (B), and CH4 (C) yields over the catalysts. Fig. 7. Cycle photocatalytic performance of Pt-Cu2O/TiO2 catalyst. photocatalytic reaction, XPS spectra of the catalysts after photocatalytic reaction were also recorded and compared with those before the reaction (Fig.8).As shown in Fig.8A, the binding energy of Pt 4f peaks in Pt/TiO 2 catalyst remained unchanged after reaction, indicating the chemical state of Pt in Pt/TiO 2 was stable during the reaction.Combining the photocatalytic activity of Pt/TiO 2 , Pt in Pt/TiO 2 works as the active site for the reduction of CO 2 and water.For Cu 2 O/TiO 2 catalyst, the Cu existed in Cu 2 O form before reaction (Fig.8B).After 4 h reaction, Cu 2 O was partially reduced into elemental Cu.This can be explained by the reduction of Cu 2 O by trapped photogenerated electrons.For Pt-Cu 2 O/TiO 2 catalyst (Fig.8C-D), most of Cu 2 O were reduced to elemental Cu after reaction, indicating that the deposition of Pt promoted the electron transfer to Cu 2 O during photocatalytic reaction.Considering the good stability of Pt-Cu 2 O/TiO 2 catalysts even after most of Cu 2 O was reduced to Cu, it is necessary to investigate the effect of Cu on CO 2 photocatalytic reduction.Cu (0) deposited TiO 2 (Cu/TiO 2 ) was prepared by the reduction of Cu 2 O/TiO 2 under a flow of 5 H 2 /N 2 at 250 C for 3 h.Similarly, Pt and Cu (0) co-deposited TiO 2 catalyst (Pt-Cu/TiO 2 ) was by the reduction of Pt-Cu 2 O/TiO 2 .The XPS spectra in Fig. S1 in the online version at DOI: http://dx.doi.org/10.1016/j.apcatb.2016.10.001indicated that the Cu 2 O NPs in Cu 2 O/TiO 2 and Pt-Cu 2 O/TiO 2 were both totally reduced to Cu after H 2 reduction, while the chemical state of Pt had no significant change.Fig. 9A shows the photocatalytic activities of Cu/TiO 2 and Cu 2 O/TiO 2 .The results show that Cu loading also enhances the CH 4 production of TiO 2 .This is because Cu(0) can also capture photogenerated electrons and work as the active site Fig. 9. Photocatalytic activity of Cu/TiO2 (A)and Pt-Cu/TiO2 (B) catalysts. Fig. 10.The catalytic behavior of Pt-Cu2O/TiO2 catalyst in the control experiments. Fig. 11.TPD-CO2 profiles for the catalysts. ) have shown that the addition of Pt can enhance the electron density on Cu 2 O particles, resulting in higher CH 4 selectivity of Pt-Cu 2 O/TiO 2 .And the XPS spectra of the used Cu 2 O/TiO 2 and Pt-Cu 2 O/TiO 2 catalysts (as shown in Fig. 8) demonstrated that the presence of Pt promoted the reduction of Cu 2 O during reaction, indicating accelerated electron transfer to Cu 2 O during reaction.This contributes to the enough supply of photogenerated electrons for CH 4 production. Specific surface areas, pore volumes, and pore sizes of the catalysts. This project was supported by the National Key Basic Research and Development Program (2011CB707301), the National Key Technology RD Program (2011BAC05B00), the Program of International ST Cooperation (2012DFB60100), the Foundation of State Key Laboratory of Coal Combustion (FSKLCCB1402), and the Foreign Science and Technology Cooperation of Hubei Province.The authors acknowledge the Analysis and Test Center of Huazhong University of Science Technology."
  }
]