[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2020.118644"
  },
  {
    "title": "Article_Title",
    "content": "Optical control of selectivity of high rate CO2 photoreduction via interband- or hot electron Z-scheme reaction pathways in Au-TiO2 plasmonic photonic crystal photocatalyst"
  },
  {
    "title": "Abstract",
    "content": "Photonic crystals consisting of TiO 2 nanotube arrays (PMTiNTs) with periodically modulated diameters were fabricated using a precise charge-controlled pulsed anodization technique.The PMTiNTs were decorated with gold nanoparticles (Au NPs) to form plasmonic photonic crystal photocatalysts (Au-PMTiNTs).A systematic study of CO 2 photoreduction performance on as-prepared samples was conducted using different wavelengths and illumination sequences.A remarkable selectivity of the mechanism of CO 2 photoreduction could be engineered by merely varying the spectral composition of the illumination sequence.Under AM1.5 G simulated sunlight (pathway1), the Au-PMTiNTs produced methane (302 mol - g cat. 1 h -1 ) from CO 2 with high selectivity (89.3 ).When also illuminated by a UV-poor white lamp (pathway2), the Au-PMTiNTs produced formaldehyde (420 mol - g cat. 1 h -1 ) and carbon monoxide (323 mol - g cat. 1 h -1 ) with almost no methane evolved.We confirmed the photoreduction results by 13 C isotope labeling experiments using GCeMS.These results point to optical control of the selectivity of high-rate CO 2 photoreduction through selection of one of two different mechanistic pathways.Pathway1 implicates electron-hole pairs generated through interband transitions in TiO 2 and Au as the primary active species responsible for reducing CO 2 to methane.Pathway2 involves excitation of both TiO 2 and surface plasmons in Au.Hot electrons produced by plasmon damping and photogenerated holes in TiO 2 proceed to reduce CO 2 to HCHO and CO through a plasmonic Z-scheme."
  },
  {
    "title": "Experimental",
    "content": "Titanium Foil (99 purity, 0.89 mm thickness) and aluminum foil (99.99 purity, 0.25 mm thickness) were procured from Alfa Aesar.Ethylene glycol ( 99 ), ammonium fluoride ( 98 ), aqueous hydrofluoric acid (49 ), nitric acid (70 ) and acetic acid ( 99 ) were obtained from Fisher Scientific and used in their as-received form without any further purification.De-ionized water was used throughout all experiments. 12CO 2 was of 99 purity and was obtained from Praxair (Canada). 13CO 2 of 99 purity was obtained from Cambridge Isotope Laboratories, Inc. (USA). Ti foil was cut into 2.5 2.5 cm pieces and washed using soap water, followed by sonication in DI water, acetone, and methanol successively for 10 min each.After being dried under a nitrogen stream, the Ti pieces were chemically polished by dipping into a mixed acid solution of 2:1:1 HNO 3 : HF: CH 3 COOH (v/v).They were then rinsed in DI water and stored in a methanol bath.Before anodization, foils were dried under a N 2 stream and then adhered to 2.5 4.5 cm aluminum foils to improve uniformity by ensuring constant potential across the back of the foil.The Ti foil was anodized using charge-controlled pulse anodization in a two-electrode cell using a 2.5 4.5 cm Ti counter electrode.Anodization was performed using a 3-step charge-controlled pulse for 30-100 periods in an ethylene glycol (EG) based electrolyte (0.3 wt NH 4 F, 4 vol DI) at 65 C.After anodization, the as-formed PMTiNT on Ti foil was detached from the aluminum backing and soaked in methanol and hexane for 5 and 3 min respectively, to clean off the electrolyte and ensure low surface-tension for drying.It was found that using high surface-tension solvents to clean the PMTiNT caused it to crack and delaminate from the Ti substrate.Finally, the asprepared PMTiNT were annealed in a 3-zone tube furnace (STF55666C-1, Thermo Scientific Lindberg/Blue M), increasing from room temperature to 525 C in 4 h and held at 525 C for an additional 4 h.The 3step anodization pulse consisted of a positive charge-controlled 60 V period, followed by 2 s of -4 V, and 20 s of 0 V.The charge was kept constant across pulses by integrating current over time using a 0.1 shunt resistor in series with the cell, which was measured using an Arduino ATmega328 P, and shut off once it reached the desired value.During the 20 s of 0 V, the anode and cathode were shorted to quickly remove any lingering static potential between the electrodes.For Au nanoparticle decoration, as-prepared PMTiNT was loaded in a DC magnetron sputter system (Kurt J. Lesker Co.).The base pressure was 7 mTorr, the power applied to the Au target was 75 W and the duration of sputtering was 1 min.Gold nanoparticles (Au NPs) were deposited by magnetron sputtering without substrate heating.The distance between the sputtering target and the samples was 1 m, due to which radiative heating of the samples by the Ar plasma could be safely ignored.Therefore, the samples were at room temperature during the whole sputtering process.The sputter deposition rate was 7.4 nm/min at a chamber pressure of 7 mTorr.The sample area was 6.25 cm 2 and the density of gold was 19.3 g cm -3 .The loading of Au NPs was estimated to be 85 g per sample.Following sputtering, samples were annealed in the 3-zone tube furnace again at the same temperature (525 C) for 30 min. The photocatalyst PMTiNT or Au-PMTiNT was loaded in a cylindrical reactor (32 mL internal volume) having a quartz window, as mentioned in our previous report 12.One piece of Au-PMTiNT photocatalyst was placed in the reactor, which was charged with 200 L DI water and 50 psi of CO 2 .Prior to introducing CO 2 , the reactor was purged several times with N 2 gas followed by CO 2 and finally the CO 2 pressure was maintained at 50 psi.Subsequently, the reactor was placed on a hot plate heated to 80 C to evaporate water droplets.To investigate CO 2 to CH 4 photocatalytic reaction, the loaded reactor was illuminated under collimated AM 1.5 G irradiation from a Class A solar simulator (Newport-Oriel instrument USA) for 2 h.The power density at the surface of the samples was 100 mW cm -2 .The sample was also irradiated with 50 W white cold LED light ( 400 nm, max.intensity at 520 nm, Model: GT-FL001-50W, Power density 1 mW cm -2 ) for 2 h, followed by solar simulator for 2 h.Further, to investigate the effect of wavelength on the product selectivity and probe the Z-scheme photoreduction mechanism, the photocatalyst loaded reactor was illuminated by 365 nm (UV light) and 505 nm (green light) LEDs, simultaneously for 2 h.The power density on the surface of samples was 10 mWcm -2 for both 365 nm and 505 nm LEDs.Subsequent to each irradiation step, the obtained gas samples were analyzed by a Shimadzu gas chromatograph (GC-2014) equipped with a Porapak Q column and a molecular sieve column, and a pulsed discharge detector (PDD).Conditions: He carrier flow rate: 0.5 mL min -1 , detector temperature: 160 C, oven temp: started from 60 C and raised up to 160 C to expel water vapor.In addition, isotope labeling experiments using 13 CO 2 instead of 12 CO 2 were carried out under identical conditions to rule out contamination from 12 C source.Gas chromatography-mass spectrometry (GC-MS) was employed to analyze the obtained gas samples and verify that the products were generated from the photocatalytic reaction."
  },
  {
    "title": "Results_and_Discussion",
    "content": "As evident from FESEM imaging of PMTiNT, the pulsed anodization method forms a periodically modulated nanotube structure with an average diameter of 80 nm 5 nm wherein, the repeating long segment is 194.5 nm 14 nm in length, and the short segment is 54.8 nm 5.8 nm in length (Fig. 1B andC).The periodicity of the TiO 2 phase results in oscillatory dielectric constants that influence photon propagation.Thus, desired photonic band gaps (PBGs) can be obtained by modifying the structure's periodicity, which is controlled by the quantity of constant charge used during pulsed anodization.TEM images of Au-PMTiNT indicate Au NPs with a diameter ranging from 3-7 nm are deposited throughout the nanotubes (Fig. 1D andE).Fig. 1F andG, show HRTEM images of Au-PMTiNT.It can be seen from Fig. 1F that Au NPs were homogeneously distributed on the walls of TiO 2 nanotubes.TEM images at high magnification distinctly show lattice fringes of Au nanoparticles with 0.24 nm d-spacing corresponding to the (111) plane of metallic Au (Fig. 1F).The Au NPs had an average diameter of 4.9 nm with a standard deviation of 1.9 nm.The Au NP size distribution was determined by measuring the diameter of 100 individual nanoparticles.Fig. 1H presents the relationship between anodization charge, period length, and PBG wavelength.The X-ray diffraction (XRD) pattern for Au-PMTiNT split into its component signals exhibited various specific peaks corresponding to anatase TiO 2 (JCPDS 21-1272), rutile TiO 2 (JCPDS 21-1276), fcc metallic Au (JCPDS 04-0784) and Ti respectively (Fig. 2a).The rutile phase signal intensity was too low, indicating anatase to be the predominant phase of TiO 2 in Au-PMTiNT samples. The interaction with light is critical for photocatalysts, which was examined using diffuse reflectance UV-vis spectroscopy and Lumerical FDTD simulations.The UV-vis diffuse reflectance spectrum of PMTiNT (black line in Fig. 2b) shows a broad photonic stopband from 350 to 550 nm, which is supported by simulated reflectance of PMTiNT (blue dash line in Fig. 2b) showing three sharp PBGs at 350 nm, 400 nm, and 550 nm.After Au sputtering (red line in Fig. 2b), the reflectance of the photonic stopband is damped drastically.The absorption band edge is shifted to 386 nm which is characteristic of the anatase bandgap. Additionally, the reflectance valley is shifted at 550 nm due to the absorption of the localized surface plasmon resonance (LSPR) of Au NPs.The propagation of photons in PMTiNT was investigated through a cross-sectional view of the spatial distribution of Poynting vector field map obtained from Lumerical FDTD.Clear evidence of periodic high intensity local electric fields is seen in Fig. 2c, which supported the aforementioned theory that oscillatory dielectric constants forbid the propagation of photons of particular wavelengths.In Fig. 2d, a simulated top view of the absorption caused electric field indicates a strong electric field surrounding the Au NPs under plasmon resonance excitation.These plasmonic Au NPs induced over 10 times higher local field compared to the electric field at the air-TiO 2 interface.The aforementioned plasmonic response and 1D photonic crystal architecture are critical effects that make the Au-PMTiNT nanostructured heterojunction a unique photocatalyst. The concentration of surface adsorbed CO 2 is of utmost importance to afford maximum product yield and water molecules always compete with CO 2 to occupy active sites.Since CO 2 is weakly acidic in nature, the availability of basic catalytic sites is essential to achieve a higher surface concentration.CO 2 temperature programmed desorption (CO 2 -TPD) was employed on both PMTiNT and Au-PMTiNT samples in order to investigate the nature of catalytic sites and the physicochemical interaction of CO 2 interaction with the material surface (see Supporting Information, Fig. S6).The TPD spectra of bare PMTiNT displayed three desorption peaks located at 111 C, 293 C and 335 C assigned to the desorption of chemisorbed CO 2 from Ti 3 , Ti 4 , and oxygen vacancy sites respectively.The intense peaks suggest plenty of basic sites were present on the surface, favorable for excellent chemisorption of weakly acidic CO 2 .On the other hand, in the TPD spectra of Au-PMTiNT sample, the intensities of these three peaks decreased significantly and shifted toward lower temperatures (106 C, 171 C and 190 C), suggesting sputtered Au acts as an adsorption barrier layer due to the blocking of available surface sites and promotes faster desorption of CO 2 at relatively lower temperature.The TPD data unambiguously points to poor-to-negligible adsorption of CO 2 on the surface of Au NPs.The most significant difference between the PMTiNT and Au-PMTiNT surfaces is that Ti 3 states are not significant in the Au-PMTiNT samples.Even TiO 2 nanotubes that are not subjected to a special reducing treatment possess Ti 3 states due to the incorporation of fluorine atoms during the anodization process and incomplete oxidation of Ti 38,39.In Au-PMTiNT, electron paramagnetic resonance spectra (not shown) did not detect Ti 3 peaks 40.Likewise, XPS spectra (Fig. S9) did not show the presence of Ti 3 states since the Ti 2p 3/2 and Ti 2p 1/2 states present in Au-PMTiNT at 458.4 eV and 464.2 eV respectively, correspond to Ti 4 states; in previous work too, Ti 3 states were noticeably absent for TiO 2 nanotubes sputter-coated with Au NPs 41.This is corroborated by the FTIR spectra of PMTiNT and Au-PMTiNT samples exposed to CO 2 alone, and to both CO 2 and water vapor (Fig. S15 in Supporting Information) wherein the symmetric stretching mode of monodentate carbonate species adsorbed on defect sites ( S 1325 cm -1 ) is prominent only in bare PMTiNT, while being weak or absent in Au-PMTiNT 42.Other prominent features corresponding to bicarbonate species (1410 cm -1 and 1630 cm -1 ) and linearly adsorbed CO 2 molecules (2346 cm -1 ) are seen in both PMTiNT and Au-PMTiNT samples 424344; however, the amplitude of these features is stronger in bare PMTiNT compared to Au-PMTiNT.This suggests that while a smaller amount of CO 2 is adsorbed on Au-PMTiNT (confirming the TPD result) and Ti 3 sites are far fewer, the adsorption modes of CO 2 on Ti 4 -O 2-Lewis acid-base pairs in Au-PMTiNT are not fundamentally different from those in bare PMTiNT.The equilibration between TiO 2 surfaces and Au NPs through transfer of negative charge from TiO 2 to Au due to Schottky junction formation described in the next section, may have resulted in the disappearance of Ti 3 states in Au-PMTiNT. The surface chemical composition and nature of chemical bonding of Au-PMTiNT and anatase thin film TiO 2 (ATF) was evaluated using Xray photoelectron spectroscopy (XPS) (See Supporting Information, Fig. S7-S8).To understand the charge generation and separation mechanisms which might be leading to specific product distributions, the electronic band structure of ATF and Au-PMTiNT was evaluated with work function and valence band spectra using ultraviolet photoelectron spectroscopy (UPS) (See Supporting Information, Fig. S8d).Based on our calculation for both ATF and Au-PMTiNT, WF were respectively 4.06 eV and 3.64 eV; while the valence band maxima of ATF and Au-PMTiNT were 3.12 eV and 2.72 eV lower than Fermi level.In CO 2 reduction studies, the band positions are usually expressed at NHE scale.So, the obtained band positions were converted to NHE scale at pH 0 by using expression E NHE (V) E vac (eV) 4.5 eV followed by conversion to E NHE at pH-7 using Nernst equation E 0 (at desired pH) E 0 (pH 0 )-0.06pH.The Fermi level and valence band positions for pristine ATF were found to be -0.86V and 2.26 V while for Au-PMTiNT these values were calculated to be -1.26 and 1.44 V vs NHE at pH-7 respectively.The upshifting of the Fermi level and band position demonstrate upward band bending and formation of Schottky junction via Fermi level alignment between metallic gold and n-type semiconductor TiO 2 .The band energy diagram of TiO 2 , Au-PMTiNT, and CO 2 reduction potential vs NHE at pH-0 before and after the formation of Schottky junction are given in Fig. 3. The CO 2 photoreduction performance of Au-PMTiNT was investigated under two different irradiation conditions leading to two different reaction pathways 1) Conventional direct route under AM1.5 G simulated sunlight and 2) Z-scheme under UV-poor visible illumination followed by AM1.5 G simulated sunlight.The CO 2 photoreduction experiments using Au-PMTiNT as a photocatalyst were performed in a stainless steel gas-tight reactor with a quartz window in the presence of gas phase CO 2 and vapor phase H 2 O 10.For the first conventional reaction pathway, the reactor was irradiated under AM1.5 G simulated sunlight for 2 h.The gaseous products were analyzed by using GC-PDD and GC-MS, and the obtained product yield in ppm was converted into mol - g cat. 1 h -1 , as mentioned in our previous report 10.Under simulated sunlight, methane was observed as the dominant CO 2 photoreduction product with a methane formation rate (R CH4 ) of 302 mol - g cat. 1 h -1 .Extremely high selectivity manifested in the product composition which consisted of 89.3 methane, 8.5 carbon monoxide, 1.6 hydrogen and 0.6 ethane (Fig. 4a).To manipulate the reaction into following the second reaction pathway, the experiment was carried out under identical conditions with merely the illumination sequence changed, by first irradiating the reactor with a 50 W white LED (P max at 520 nm) for 2 h followed by irradiating the reactor with AM1.5 G simulated sunlight for 2 h respectively.Interestingly, following this illumination sequence, the composition of the photoreduction product changed drastically compared to conventional CO 2 /CH 4 photocatalysis; formaldehyde (CH 2 O) and carbon monoxide (CO) were observed as the primary reaction products (Fig. 4a).From GC analysis, the CO and CH 2 O formation rate (R CO and R CH2O ) were extracted to be 323 and 420 mol - g cat. 1 h -1 respectively.To validate the optical wavelength-directed product selectivity of CO 2 photoreduction on Au-PMTiNT, the photoreaction was also carried out under identical conditions by illuminating with UV light (365 nm) and green light (505 nm) LEDs simultaneously.As anticipated, formaldehyde and CO were observed as major reaction products and no trace of methane was detected.The rate of photocatalytic CO and CH 2 O generation were found to be 364 and 123 mol - g cat. 1 h -1 respectively.To discern if the observed reaction products were truly a result of CO 2 photoreduction and not due to carbonaceous impurities, a series of sanity tests were performed under identical conditions but with absence of one element in control experiments: 1) absence of photocatalyst; 2) absence of water; 3) absence of light; 4) absence of CO 2 .No CO 2 reduction product was observed in any of the four control experiments which proved the photocatalytic origin of products.Additionally, experiments using isotopically labeled 13 CO 2 were also conducted to confirm the origin of observed products and to eliminate possible carbon contamination.The GC-MS spectra of reaction product exhibited ion-chromatogram peaks at m/z value of 17 for 13 CH 4 , 29 for 13 CO and 31 for 13 CH 2 O respectively (Fig. 4b). To understand the charge separation mechanism and carrier dynamics in Au-PMTiNT, the surface potential (SP) under different illumination conditions was determined using Kelvin probe force microscopy (KPFM) (Fig. 4c).Since the gold was sputtered on to the PMTiNTs, the maximum number of Au NPs are found on the top surface of the PMTiNTs, and the charge on these Au NPs determines the surface potential of the Au-PMTiNT samples.Under dark conditions, the SP of Au-PMTiNT was found to be -50 mV (black curve in Fig. 4c) which demonstrates a slightly electron-rich surface of Au-PMTiNT, which confirmed the presence of a Schottky junction at equilibrium due to transfer of electrons from TiO 2 to Au, and validated the UPS results.Under UV irradiation by 365 nm photons, a large negative shift of 300 mV with respect to dark was observed (blue curve in Fig. 4c). Owing to the large amount of TiO 2 in Au-PMTiNT system and the UVinduced photogeneration in TiO 2 , a flat band or accumulation region is expected to prevail at the Au-TiO 2 interface (e.g.Fig. 3e) with the concomitant transfer of a larger amount of negative charge to the Au NPs.The Au NPs thus act as electron sinks for the large excess carrier concentration in TiO 2 under UV illumination, a behaviour that is welldocumented in prior reports 45,46.On the other hand, under 532 nm illumination, Au nanoparticles are the major absorbers due to the LSPR.Under visible illumination, a small positive shift (25 mV) was observed which indicates the transfer of hot electrons into E CB of TiO 2 across the Schottky junction following absorption and plasmon dephasing (as illustrated in Fig. 3d), thus leaving positively charged holes on the Au NPs.The electrons transferred to TiO 2 following LSPR excitation and damping, have extremely long lifetimes (seconds to hours) due to two major reasons: (1) The extremely low residual hole concentration in TiO 2 that discourages recombination and (2) The high dielectric relaxation time in TiO 2 due to which thermal equilibration of excess carrier concentrations is a slow process 47,48.Consequently, the remnant photogenerated holes in Au also have a long lifetime.Two further experiments were used to confirm these inferences.First, the terephthalic acid photoluminescence test 49 was used to detect the presence of hydroxyl radicals in Au-PMTiNT following UV-filtered white light illumination (Fig. S9 in Supporting Information).Since these hydroxyl radicals arise from the reaction of photogenerated holes with surface adsorbed water molecules, the presence of long-lived holes on the Au NPs (TiO 2 was not excited by the light source used) was confirmed.Secondly, UV-vis spectra of Au-PMTiNT were measured before and after a 2 h white lamp illumination ( 420 nm) (Fig. 4d).Fig. 4d clearly shows the surface plasmon resonance peak at ca. 550 nm.The white LED lamp had maximum intensity around 520 nm; following illumination and LSPR excitation, the transfer of hot electrons into TiO 2 as described above, significantly increased the concentration of free electrons in TiO 2 which manifested itself as an increased absorbance in the near-infrared (NIR) region in a backward scan (longer wavelength to shorter wavelength) due to enhanced free carrier absorption of NIR photons (red curve in Fig. 4d).Interestingly, after illumination when the sample was scanned in the forward direction (from shorter wavelength to longer wavelengths), no increase in absorbance was observed in the NIR region (black curve in Fig. 4d) which suggests that free electrons were used up during UV irradiation.This interesting result provided us the first indication that a plasmonic Z-scheme might be operational in the Au-PMTiNT photocatalyst as indicated in Fig. 3f.Taken together, the picture that emerges from the gas evolute, KPFM and UV-vis data is that illumination by near-LSPR visible photons alone produces transfer of hot electrons from Au to TiO 2 and illumination by UV photons alone produces transfer of photogenerated electrons from TiO 2 to Au through the electron sink effect of noble metal NPs.Under AM1.5 G one sun illumination following visible illumination, an accumulation-type interfacial band alignment exists (Fig. 3e) which promotes a large flux of electrons (both photogenerated electrons and transferred hot electrons) to move from TiO 2 to Au, which in turn recombine with holes in Au generated by plasmon damping.This leaves hot electrons in Au NPs and photogenerated holes in TiO 2 available to drive photocatalytic reactions (Fig. 3f).Although hot electrons in Au experience thermalization at picosecond timescales, our gas evolute results clearly indicate that charge transfer to adsorbed CO 2 species occurs within this timeframe. To the best of our knowledge, the optical control of product selectivity has never been previously observed.The key question that arises is what factors govern the controllable product selectivity under different wavelength illumination conditions and the underlying mechanism involved.Highly selective methane formation on Au/TiO 2 systems under solar illumination has been previously observed and explained on the basis of energy level positions i.e. the E CB position of TiO 2 which lies above reduction potential of CO 2 /CH 4 but remains below the reduction potential of CO 2 /CO and CO 2 /CH 2 O 19.However, conversion of band positions values on NHE scale at pH 7 actually shows that TiO 2 can reduce CO 2 to CO and CH 2 O 50515253.Further, we calculated that E CB of TiO 2 in Au-PMTiNT to be situated at -0.88 V vs NHE at pH 7 suggesting that TiO 2 can reduce CO 2 to CO and CH 2 O.Such an energy level alignment is depicted in Fig. 3b for instance.Therefore, the energy levels of TiO 2 are insufficient to explain the controllable product selectivity observed by us.The excellent selectivity of methane formation under AM1.5 G simulated sunlight can be explained based on 1) Photonic band gaps 545556 and 2) Carbene pathway.As mentioned earlier, PBGs of PMTiNT were observed at 350, 400, and 500 nm (Fig. 2b; also see Fig. S5 in Supporting Information), which allowed the propagation of selected wavelengths in the PMTiNT photonic crystal and enhanced the selectivity of products.The electronic band gap of anatase phase TiO 2 is 3.2 eV which corresponds to a band-edge of 386 nm and only photons with wavelengths shorter than 386 nm can induce a direct transition of electrons from the valence band to conduction band.While the conduction band is constituted of Ti 4 3d overlaps, the presence of defect states (Ti 3 , O vacancies etc.) creates sub-gap states just below the conduction band and longer wavelengths can also stimulate electronic transitions.Due to the presence of photonic stop-bands in the PMTiNT at 350 and 400 nm, only light in a narrow range of 355-386 nm remains available for the transition.Photons with wavelengths in the range 386-410 nm, which are primarily responsible for the sub-bandgap excitation of defect states, were attenuated.Due to this filtering effect, only mobile, high energy electrons are excited to the conduction band and react with surface adsorbed CO 2 to form methane. Our infrared spectroscopy results for adsorbed CO 2 and H 2 O on PMTiNT and Au-PMTiNT surfaces (Fig. S15) are indicative but not exhaustive since they were obtained in specular reflectance mode wherein only the adsorption modes of CO 2 and H 2 O on the top surface of the nanostructured three-dimensional films are detected.Anodically synthesized TiO 2 nanotubes can exhibit a strong crystallographic texture with (001) facets on top surfaces and (101) facets on the walls 57.In such a case, the adsorption modes of CO 2 on the nanotube walls could be different from that on the top surface.With this caveat in place, we briefly discuss how CO 2 photoreduction might proceed along the carbene pathway, which is the leading route for methane formation on the Ti 4 centres.Yongfei Ji et al. describe how CO can form through concurrent transfer of protons and electrons to linear CO 2 molecules (which are clearly observed in Fig. S15), on defect-free anatase (101) surfaces 58.Once CO is formed, it can be easily photoreduced to other organic molecules 58.Previous studies also suggest that bidentate coordination of CO 2 is favored on Ti 4 centers (strong Ti 4 Lewis base sites in conjunction with strong O -Lewis acid sites), while the monodentate configuration is achieved on Ti 3 sites (strong Ti 3 Lewis base sites in conjunction with weak Lewis acid sites (oxygen vacancies) 596061.The bidentate coordination of CO 2 through two oxygens on two Ti 4 centers followed by bonding of carbon with on TiO 2 oxygen centers form adsorbed carbonate species which promotes facile reduction of CO 2 to CO 2 anion radical bonded in a bidentate manner followed by the subsequent reduction to methane via carbene pathway 58,62636465 formaldehyde pathway 51,62,66.The observation of methane as a sole reaction product (with minor CO) under AM1.5 G simulated sunlight indicates that the direct transition of sufficiently energetic electrons to the conduction band of TiO 2 is favoured, and the filtering effect of the photonic bandgaps prevent defect mediated low energy transitions which might lead to other CO 2 reduction products (schematically illustrated in Fig. 3c).Additionally, due to the lower reduction potential of CO 2 /CH 4 (-0.24V vs NHE at pH7) in comparison to CO 2 /CO (-0.53 V) and CO 2 /CH 2 O (-0.48 V), the formation of methane was thermodynamically more feasible.The phase of water also affects the product distribution on the surface of TiO 2 during CO 2 photoreduction, and methane is observed as the dominant product in vapor phase reactions such as the one reported here 67,68.Carbene pathway: The selective CH 4 formation under AM1.5 G simulated sunlight, and the photoreduction of CO 2 under white LED illumination followed by AM1.5 G solar illumination to form formaldehyde and carbon monoxide as major products strongly suggests the presence of a second mechanism.The selective formation of CH 2 O and CO can be explained by the Z-scheme mechanism (Fig. 3e-f).The irradiation of Au-PMTiNT samples with white cold LED light ( 420 nm) which has maximum photon flux at 520 nm cannot excite electrons from the E VB to E CB of TiO 2 while Au can absorb most of the light in this region due to LSPR and inject the generated hot electrons into the E CB of TiO 2 leaving behind poorly oxidizing holes.The poorly oxidizing hole on Au does not have adequate energy to drive water splitting.Hence, visible light irradiation resulted in the accumulation of negatively charged electrons in E CB of TiO 2 and positive holes on Au as described previously.Despite the capability of photogenerated hot electrons in gold to perform proton assisted CO 2 reduction, the absence of water splitting to furnish the required protons, suppresses the reaction.Once the solar simulator is turned on, electron-hole pairs are generated in E CB and E VB of TiO 2 .As previously described, the electrons in E CB of TiO 2 move rapidly toward Au and recombine with holes there while holes left in the E VB of TiO 2 , oxidize water to release required electrons and protons (Zscheme) 69.Several reports demonstrate transfer of electrons from semiconductors to the gold nanoparticles and Z-scheme catalysis 7071727374.As the photon flux of the white LED was concentrated near the gold LSPR excitation, a large fraction of photons from the white LED was used for generation of hot electrons and low energy holes.On the other hand, due to only 5 of energy in sunlight residing at ultraviolet wavelengths, the number of photogenerated electrons-holes pairs in TiO 2 was much lower than Au.The large population of less energetic holes on the Au surface recombined with photogenerated electrons in E CB on TiO 2 to actuate a Z-scheme mechanism.Due to the low numbers of holes in the E VB of TiO 2 , the rate of proton generation from water was poor and the surface concentration of protons was the rate-determining step.The low surface concentration of protons favored proton deficient CO 2 reduction products CH 2 O and CO (4 and 2 proton reduction products) via the formaldehyde pathway.Further, previous reports suggest that selective formation of carbonyl reduction products 75,76 occurs due to effective overlap between metal d orbital (donor) and orbital (acceptor) of carbonyl compounds that stabilize transition states on its surface 777879.To validate the Z-scheme mechanism, the CO 2 reduction reaction was carried out by simultaneously illuminating the sample with UV (365 nm) and green (505 nm) LEDs having identical intensity on the surface of the sample.Again, CH 2 O and CO were observed as major products.The observed results suggest that the recombination rate in TiO 2 was higher which reduced the effective concentration of available protons for complete CO 2 reduction and a Zscheme mechanism operated. Formaldehyde Pathway: To gain more insight into the electronic structure of the Au-TiO 2 heterojunction, density functional theory (DFT) calculations were conducted on Au cluster decorated (101) anatase TiO 2 for imitating the Au-PMTiNT photocatalyst 80,81.DFT calculations with Hubbard U correction method were performed using OpenMx software (an open source package for Material eXplorer) 82, which allowed us to obtain the projected density of states (PDOS), which is shown in Fig. 5, and which was calculated from pseudoatomic orbitals and relativistic pseudopotentials adopted by LDA.DFT calculations were done for two cases respectively: (1) When the distance of Au nanoparticles and the anatase surface was large (several angstroms away) and (2) When they were close.In Fig. 6, it is shown that both the HOMO and LUMO are localized on the Au nanoparticles, which reflected the case that the interaction of Au atoms and TiO 2 surface was weak when they were away.However, an interesting result emerged when Au atoms approached the surface of TiO 2 closely.In Fig. 6b, it is seen that the HOMO orbitals lay on TiO 2 while the LUMO orbitals were mostly located on Au nanoparticles while slightly penetrating into the TiO 2 surface.It is worth noting that the spatial and energetic overlap of HOMO and LUMO fulfills the condition for the construction of a Zscheme as mentioned in the main article.This HOMO and LUMO diagram demonstrated electron flow from E CB of TiO 2 to the gold Fermi level, and is consistent with experimental results.Fig. 6c is the second level positions of HOMO and LUMO in our system.It is clear that the second LUMO level is spread out on both gold cluster and TiO 2 , which is supportive of our claim in the DFT section of the main article. Combining the DFT results with the aforementioned experimental results, the PDOS diagram not only supported our hypothesis but also displayed the hidden charge flow mechanism from an electronic structure perspective.In Fig. 5, although the Au sp hybridized orbital extended out to -1.2 eV, the dominant filled electronic orbitals in this system are those corresponding to O 2p and Au 3d.O 2p is well known as the main contributor to the valence band in TiO 2 83.Once the sample is illuminated by photons exceeding the bandgap of TiO 2 , electrons are excited to the Ti 3d orbital that constitutes the conduction band of TiO 2 84.An Au 3d interband transition overlaps with the O 85.This intraband transition is stimulated following dephasing of the Au surface plasmons excited by visible light illumination to create a nonequilibrium distribution of carriers (hot electrons).It is also important to note that the Ti 3d orbital at 0.1 eV is isoenergetic with the 0.1 eV Au sp orbital (also showed as orbital visualization in Fig. 5).Therefore, if ultraviolet illumination immediately follows or is coincident with visible illumination close to the LSPR peak, photogenerated electrons populating the Ti 3d orbital would be energetically inclined to recombine with holes on the Au sp orbital that were created due to the intraband transition 70,72. An unexpected and interesting feature in the PDOS (Fig. 5) is that the next energy level higher than the LUMO of the Au-TiO 2 system is at 0.8 eV (sometimes called S 2 in a molecular system), and mainly consists of Ti 3d orbital isoenergetic with the Au sp orbital as shown in Fig. 6.As earlier discussed, the majority of CO 2 is adsorbed on TiO 2 based on our TPD analysis.The coexistence of second LUMO indicates that Ti 3d orbital is strongly coupled with Au sp orbital and serves as a shuttle to deliver the LSPR electrons to the CO 2 photoreduction reaction 86,87. Fig. 1. (A) Schematic illustration of the preparation process of PMTiNT arrays (B, C) Top-view and cross-sectional view FESEM images of as-prepared PMTiNT (D, E) TEM images of Au loaded PMTiNT (F, G) HRTEM images of gold nanoparticles and lattice fringes (H) Variation of photonic crystal pitch (length of repeating periodic segment) and optical reflectance peak vs. anodization charge in charge-controlled anodization for the design of photonic bandgaps. Fig. 2. (a) XRD pattern of Au-PMTiNT, illustrating material components and TiO 2 phase by separating signals.(b) Diffuse reflectance spectra of PMTiNT (black line), Au-PMTiNT (red line) and FDTD simulated PMTiNT (blue dash line) (c) Cross-section view of simulated Poynting vector plot for PMTiNT (d) Top view simulated electric field map for Au-PMTiNT.(For interpretation of the references to colour in this figure legend, the reader is referred to the web version of this article). Fig. 3. Proposed energy band diagram(s) of Au-PMTiNT obtained from UPS WF and VB spectra showing (a) Band energies of pristine TiO 2 and gold before contact (b) Formation of Schottky junction between Au and TiO 2 via Fermi level alignment and reduction of CO 2 to methane under solar simulated light (UV; TiO 2 and UV Vis; Au LSPR) leading to conventional SPR assisted scheme and the reduction potential of various CO 2 reduction products is given in the blue text (c) Overall schematic representation of methane formation on Au-PMTiNT system under AM1.5 G solar illumination (d) Hot electron injection from Au NPs across the Schottky barrier into E CB of TiO 2 under visible irradiation via LSPR originated electrons on Au under visible light resulting in a build-up of excess electrons in TiO 2 (e) Recombination of accumulated electrons in TiO 2 with LSPR originated holes in Au NPs results in a plasmonic Z-scheme wherein hot electrons on Au generated via LSPR in visible light are used for CO 2 reduction to CH 2 O and CO and photogenerated holes in E VB of TiO 2 are used for the water oxidation to furnish required protons for the photoreduction (f) Overall schematic illustration of Z-scheme photocatalytic conversion of CO 2 to CH 2 O. (For interpretation of the references to colour in this figure legend, the reader is referred to the web version of this article). Fig. 4. (a) Product distribution chart from CO 2 photoreduction on Au-PMTiNT for two different illumination conditions, showing clearly that the dominating products varied under different illumination conditions (b) Ion-chromatogram confirming the existence of 13 C isotopic labeled products (c) Surface potential shift under different illumination conditions measured by KPFM with the opposite shifts under 365 nm and 532 nm illumination suggesting two different reaction pathways at work (d) Absorption spectra of as-prepared Au-PMTiNT before and after irradiation of white 50 W, LED lamp (filtered-out UV) (Both collected in the backward scan) After forwarding scan of LED illuminated samples the enhanced absorption peak in NIR region corresponded to free electrons was disappeared and spectra were exactly identical as the non-irradiated sample. Fig. 5. Projected density of states diagram of selected gold atom (red line), titanium atom (green line), oxygen atom (blue line).the Fermi energy is at 0 eV.(For interpretation of the references to colour in this figure legend, the reader is referred to the web version of this article). Fig. 6.Images from left to right of each row are visualizations of optimized geometries, HOMO and LUMO positions respectively.Three cases are displayed: (a) Gold atoms are far away from TiO 2 anatase surface (several angstroms) (b) first HOMO/LUMO positions and (c) second HOMO/LUMO positions, when gold atoms are close to TiO 2 anatase surface. . While neither bidentate coordinated CO 2 nor Ti 3 states were observed in our study, it is important to keep an open mind regarding CO 2 coordination due to the possibility of crystallographic texturing obscuring adsorption modes.Monodentate coordination of CO 2 on TiO 2 through one oxygen atom facilitates the formation of carboxyl (hydroxyformyl) radical ( COOH) which is transformed into formaldehyde and subsequently into methane through the All authors thank NSERC, NRC-Nano, CFI, CMC Microsystems, Alberta Innovates and Future Energy Systems CFREF for direct and indirect (equipment-related) financial support.The characterization assistance provided by Dr. Kai Cui (NRC-Nano), Dr. Steve Launspach (NRC-Nano), Dr. Mike Xia (NRC-Nano), Ms. Lisa Nikolai, and the staff at the UofA nanoFab is acknowledged.S.Z., E.V. and K.S offer their heartfelt thanks to Prof. Arvind Rajendran and James Sawada for assistance with gas chromatography, to Prof. Thomas Thundat for access to KPFM, and to Prof. Natalia Semagina for access to temperatureprogrammed desorption."
  },
  {
    "title": "Conclusions",
    "content": "In summary, Au nanoparticle-decorated periodically modulated TiO 2 nanotube arrays for photocatalytic CO 2 reduction were prepared using precise charge-controlled pulse anodization method with remarkable photoactivity.The unique optical property of photonic crystal to regulate the propagation of photons and the surface plasmon resonance of Au-PMTiNT leads to remarkable wavelength-controlled product selectivity.The spectral composition of incident light could be used to switch the photoreduction pathways freely between a methane generating pathway and a plasmonic Z-scheme that generated formaldehyde and carbon monoxide.This is the first time that a true plasmon-involved Z-scheme based on Au/TiO 2 heterojunction has been reported.CH 4 (302 mol/g/h with 89.3 selectivity) was observed as the dominant CO 2 photoreduction product under simulated sunlight while CH 2 O (420 mol/g/h) and CO (323 mol/g/h) were produced predominantly under visible UV light.Isotopic labeling experiments using 13 CO 2 authenticated the light-driven generation of reaction products. The authors have no conflicts to declare. Supplementary material related to this article can be found, in the online version, at doi:https://doi.org/10.1016/j.apcatb.2020.118644."
  }
]