[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2021.120524"
  },
  {
    "title": "Article_Title",
    "content": "Crystallographic facet heterojunction of MIL-125-NH2(Ti) for carbon dioxide photoreduction"
  },
  {
    "title": "Abstract",
    "content": "Facet exposure affects photocatalytic CO 2 reduction reaction, but the insight remains unclear.Here, we report finely controlled six types of MIL-125-NH 2 (Ti) exposing single and co-exposing mixed low-index facets as model catalysts and provide an insight into facet effect on photoreduction of CO 2 .Facet surface heterojunction endows MIL-125-NH 2 (Ti) with a broadened light-absorption and accelerated charge migration.The MIL-125-NH 2 (Ti) with 110/111-heterojunction yields ca. 10 and 18 times enhanced CO 2 reduction to CO and CH 4 compared with the single 001 facet exposed.Density functional theory (DFT) calculations provide an energetically favorable CO 2 catalytic reduction pathway and identify the rate-limiting step on different low-index facets.This work aims at exploring facet-effect on CO 2 photoreduction, understanding the facet-dependence and providing a paradigm for MOFs materials by regulating facet to enhance the general surface catalytic reaction activity."
  },
  {
    "title": "Experimental",
    "content": "001 facets (T1): DMF (7.0 mL) was mixed with MeOH (3.0 mL) to form the mixed solvent.0.34 g of NH 2 -BDC and 1.12 g of CTAB were dispersed into an above mentioned mixed solvent with sonication.Then, 0.25 mL of TBOT was added and continuous ultrasonication for 5 min.The yellow solution was sealed into the Teflon-line steel autoclave, and kept in an oven at 150 C for 8 h.The yellow powders were separated by centrifuging, washed with DMF three times, and ethanol five times, and fully dried in vacuum oven for 5 h at 80 C. 110 facets (T2): 9.0 mL of DMF and 1.0 mL of MeOH form the mixed solvent.0.28 g of NH 2 -BDC was dispersed into the above mentioned mixed solvent with sonication.Then, 0.34 mL of TBOT and 0.27 mL of AA were added and continuous ultrasonication for 5 min.The yellow solution was sealed into the Teflon-line steel autoclave, and kept in an oven at 150 C for 24 h.The yellow powders were separated by centrifuging, washed with DMF three times, and ethanol five times, and fully dried in vacuum oven for 5 h at 80 C. 111 facets (T3): 9.0 mL of DMF and 1.0 mL of MeOH to form the mixed solvent.0.14 g of NH 2 -BDC was dispersed into the above mentioned mixed solvent with sonication.Then, 0.15 mL of TPOT and 0.53 mL of AA were added and continuous ultrasonication for 5 min.The yellow solution was sealed into the Teflon-line steel autoclave, and kept in an oven at 150 C for 24 h.The yellow powders were separated by centrifuging, washed with DMF three times, and ethanol five times, and fully dried in vacuum oven for 5 h at 80 C. 001/110 facets (T12): 7.0 mL of DMF and 3.0 mL of MeOH to form the mixed solvent.0.21 g of NH 2 -BDC and 0.25 mL of TBOT were dispersed into the above mentioned mixed solvent with sonication.The yellow solution was sealed into the Teflon-line steel autoclave, and kept in an oven at 150 C for 8 h.The yellow powders were separated by centrifuging, washed with DMF three times, and ethanol five times, and fully dried in vacuum oven for 5 h at 80 C. 001/111 facets (T13): 2.7 mL of DMF and 0.3 mL of MeOH to form the mixed solvent.0.11 g of NH 2 -BDC and 0.17 mL of TBOT were added into the above mentioned mixed solvent with sonication.The yellow solution was sealed into the Teflon-line steel autoclave, and kept in an oven at 150 C for 24 h.The yellow powders were separated by centrifuging, washed with DMF three times, and ethanol five times, and fully dried in vacuum oven for 5 h at 80 C. 110/111 facets (T23): 9.0 mL of DMF and 1.0 mL of MeOH form the mixed solvent.0.14 g of NH 2 -BDC was dispersed into the above mentioned mixed solvent with sonication.Then, 0.15 mL of TPOT and 0.80 mL of AA were added and continuous ultrasonication for 5 min.The yellow solution was sealed into the Teflon-line steel autoclave, and kept in an oven at 150 C for 24 h.The yellow powders were separated by centrifuging, washed with DMF three times, and ethanol five times, and fully dried in vacuum oven for 5 h at 80 C. All of the density functional theory (DFT) calculations were carried out using the Vienna ab initio simulation package (VASP) based on the projector augmented wave (PAW) method 31,32.The generalized gradient approximation (GGA) method together with the Perdew-Burke-Ernzerhof (PBE) as exchange-correlation functional was employed in both geometry optimizations and electronic property calculations 33.The Grimme method was applied to take the van der Waals interaction into consideration, and the cutoff kinetic energy was set to be 450 eV 34,35.The Hubbard-like U approach 36 was used to treat the Ti atoms with the effective U eff , U eff U -J 7.0 eV for Ti atoms 37.Three slab models in periodic boundary condition (PBC) were built to study the CO 2 conversion pathways on (001), ( 110) and (111) surfaces, respectively (Table S7).The vacuum thickness was set to be 15 A to avoid the interactions between the adjacent cells.It is recognized that in many cases PBE functional would underestimate the bandgap of the materials, which has been demonstrated in recent works 38394041.The employment of HSE06 functional may relieve this problem.However, the number of the simulated model for (111) surface is about 300 atoms in a cuboid box with periodical boundary condition (PBC).The CO 2 -to-CH 4 reduction reaction is a complex process with the involvement of eight protons and electrons.For studying of the CO 2 -to-CH 4 process systematically, it may be difficult to examine the different reaction pathways on three different surface facets, i.e. ( 001), ( 110), (111), with the expensive HSE06 functional for about 30 intermediates.The energy convergence value between two consecutive steps was chosen as 1 10 -4 eV, and a maximum force was allowed lower than 0.04 eV/A on each atom. The CO 2 reduction reaction process can be described by eight basic steps: in which represents the MIL-125-NH 2 (Ti) surface.The Gibbs free energy changes can be calculated by the following Eqs. where E total is the total energy from the DFT calculations.E ZPE is the zero-point energy, S is the entropy, and T is the temperature. The photoreduction of CO 2 experiment was carried out in CEL-SPH2N-D9 (CeAulight, China) with a condensate circulating water filter to avoid the photothermal effect.Firstly, 5 mg of the as-synthesized photocatalysts were scattered in 15 mL MeCN and 1 mL water with 3 mL TEOA as a sacrificial agent, ultra-sonicated to form a suspension, and pour into the reaction cell (d 4 cm).In a vacuum reaction system, pure CO 2 gas (80 kPa, 99.999 , Shangyuan Gas) was injected with a 4 C condenser circulation pump.A 300 W xenon arc lamp with AM 1.5 G filter (100 mW/cm 2 ) was used as the light source and vertically placed outside the reactor.Every 1 h, 1.0 mL of reactive gas were taken from the reactor with the online automatic gas sampling system (CEL-GSOA-1).The gas products were detected by gas chromatography (GC-9860) with a flame ionized detector (FID).The retention time of CO and CH 4 are 1.290 and 2.370 min.All photocatalytic data were repeated at least three times.Recycling experiments were performed under similar conditions by using a collected catalyst instead of a fresh catalyst. The electrochemical measurements including electrochemical impedance spectroscopy (EIS) and Mott-Schottky test were performed on the Zahner electrochemical workstation with standard threeelectrode system.Carbon cloth and photocatalyst-coated glassy carbon as the working electrode for EIS and Mott-Schottky test, graphite rod as the counter electrode and Ag/AgCl electrode as the reference electrode.0.2 M of Na 2 SO 4 solution and the mixed solution of 0.5 M of KCl solution and 0.01 M of K 3 Fe(CN) 6 /K 4 Fe(CN) 6 with a ratio of 1:1 were used as the electrolyte for Mott-Schottky and EIS test, respectively. The cyclic voltammetry curve was measured on a CHI 730E electrochemical workstation with a standard three-electrode system with a scan rate of 0.1 V/s.Platinum wire and Ag/AgCl electrode as the counter and refence electrode.The working electrode was ITO coated with samples.The curves were obtained for the electrolyte in MeCN with tetrabutylammonium hexafluorophosphate (0.1 M).The inks were prepared by utrasonication of 2 mg samples in a 1.05 mL mixed solution (Nafion: H 2 O: isopropanol 1:10:10) for 30 min and dropping 100 L of the suspension onto the ITO electrode. Transient photocurrent measurements were measured on a CHI 730E electrochemical workstation in a standard three-electrode system.Graphite rod, ITO plate(1 cm 2 ) and Ag/AgCl electrode as counter, working and reference electrode, respectively.Na 2 SO 4 (0.2 M) solution as the electrolyte.Switch light at least 10 recycles. The quantum yield of CO 2 photocatalytic conversion in 5 h can be calculated by following Eqs.( 18) and (19).Two and eight electrons are required to convert CO 2 to CO and CH 4 , respectively 42,43. 2 mole of CO formation mole of photons absorbed by photocatalyst (18) CH4 () 8 mole of CH 4 formation mole of photons absorbed by photocatalyst (19) The number of moles of photons absorbed by photocatalyst (MPAP) during 5 h was calculated by Eq. (20)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "To explore the possibility of photocatalytic performance of MIL-125-NH 2 (Ti) during the CO 2 reduction reaction process, the partial density of states (PDOS) was calculated by DFT.The MIL-125-NH 2 (Ti) displayed semiconductor property with a bandgap (E g ) of 1.83 eV as shown in Fig. 1.The low E g value indicates that MIL-125-NH 2 (Ti) possesses a good capacity for absorbing light to improve the efficiency of CO 2 conversion.The bandgap was 1.51 eV without GGA U approach (Fig. S1), indicating that taking the on-site coloumbic repulsion into account was important to describe the electronic structure of transition metal atoms 44.Moreover, the conduction-band minimum (CBM) is mainly composed of Ti 3d orbitals.The valence-band maximum (VBM) is dominated by C 2p and N 2p orbitals, thus the Ti center may play the role of the active site for the CO 2 conversion. Based on the above mentioned results, the study of MIL-125-NH 2 (Ti) with different facets on photocatalytic CO 2 reduction is a compelling project.As shown in Fig. 2a, the specific facets and morphologies of MIL-125-NH 2 (Ti) were achieved by changing the reaction time, DMF-MeOH solvent ratio and modulator in the reaction.Powder X-ray diffraction (PXRD) patterns were used to characterize the crystal phases of these assynthesized MIL-125-NH 2 (Ti).All the samples display similar PXRD patterns (Fig. S2), which are in agreement well with the calculated MIL-125-NH 2 (Ti) 45.Herein, the hkl indicates the set of all planes that are equal to (hkl) by the lattice symmetry, and h, k and l mean Miller index 46.The identification and calculation of low-index crystallographic facet including 001, 110 and 111 facets are presented in Fig. S3 47.The relationship between the morphology and crystal plane is further supported by Steno's law, namely the angles between two corresponding facets on the crystals are constant, thus the crystallographic facet can be defined 48,49, and the results are shown in Fig. S4 and Table S1. Scanning electron microscopy (SEM) images reveal the morphology and facet features of these as-synthesized samples directly.The lowindex crystallographic facets of 001, 110 and 111 are exposed as exhibited in Fig. 2b, c andd, displaying different morphologies with disk-shaped plate, rhombic dodecahedron and octahedron, which are named as T1, T2 and T3, respectively.Fig. 2e shows the morphology of MIL-125-NH 2 (Ti) with rectangle-like plates consisting of 001 and 110 facets, donated as T12.001 and 111 mixed facets construct a truncated cube (Fig. 2f), and 111 and 110 facets build a truncated octahedron (Fig. 2g) of samples, which are set to T13 and T23, respectively.Fourier transform infrared (FTIR) spectroscopy (Fig. S5) and Xray photoelectron spectroscopy (XPS) (Figs.S6-S11) were employed to clarify the functional groups and surface chemical state in these samples. In addition, the Ti element atomic concentrations of these samples were listed in Table S2, which indicates the varied exposure degree of the metal-oxo cluster on different facets. To explore the optical properties and band structure of the assynthesized MIL-125-NH 2 (Ti), UV-vis diffuse reflectance spectra (DRS) were measured.The results show the effectively broadened light absorption range by tuning the facet exposure of the samples (Fig. S12).The corresponding gaps between the highest occupied molecular orbital (HOMO) and the lowest unoccupied molecular orbital (LUMO) for T1, T2, T3, T12, T13 and T23 were calculated to be 2.77, 2.70, 2.68, 2.69, 2.67 and 2.63 eV by Tauc plots derived from the DRS (Fig. S13), respectively 505152.Mott-Schottky plots were further employed to definite the HOMO-LUMO gap edges of the samples since that all samples as typical n-type semiconductors (Fig. S14) 53.All the results of measurements and calculations are shown in Fig. 3, the LUMO energy level was more negative than the reduction potential of thermodynamic requirements of photocatalytic conversion of CO 2 -to-CO (-0.52 V vs NHE) and CO 2 -to-CH 4 (-0.24V vs NHE) 54.Thus, MIL-125-NH 2 (Ti) has promising potential for photoreduction of CO 2 . The photocatalytic CO 2 reduction performances of as-synthesized catalysts were evaluated by simulated sunlight-driven photoreduction experiments conducted under a CO 2 -saturated CH 3 CN/H 2 O (v:v 15:1) system with triethanolamine (TEOA) as sacrificial electron donor.All samples demonstrated to have the ability for conversion of CO 2 to CO and CH 4 under simulated sunlight irradiation.The CO and CH 4 were detected by gas chromatography with FID detector (Fig. S15).Fig. 4a shows the reduction products yields with different catalysts, and the detailed catalytic performance data are listed in Table S3, T23 with 110/111 co-exposed facets achieves the optimal yields of CO (15.49mol g -1 h -1 ) and CH 4 (5.46 mol g -1 h -1 ), which are 10 and 18 times higher than T1 with only 001 facet exposed.And the effectiveness of photo-electrons reached 74.66 mol g -1 h -1 for T23 (Fig. 4b).The quantum yields (QY) over T23 are 0.26 and 0.37 for CO and CH 4 , respectively (Table S4).The photocatalytic activity was comparable to the previously reported ones under the similar liquidphase reaction without photosensitizer and also higher than that of some typical MOFs photocatalysts (Table S6).There is no liquid product detected in the photocatalytic system ensured by 1 H-NMR spectral measurements (Fig. S16).The TEOA was oxidized during the photocatalytic process (Fig. S17).The 13 C-isotope trace test by using 13 CO 2 as a reduction substrate in the photoreduction of CO 2 confirms that the CO and CH 4 originated from the CO 2 , rather than the decomposition of the organic framework of the catalysts (Fig. 4c) 55.All the as-synthesized MIL-125-NH 2 (Ti) samples exhibit good stability after 5 recycles (Fig. S18).The PXRD patterns, SEM images and FTIR spectra of all the catalysts after 5 recycles confirmed the stability of crystal phases, morphology and functional groups (Figs.S19-S21).The above results further demonstrated the excellent stability of as-synthesized MIL-125-NH 2 (Ti) in CO 2 photoreduction reaction. In addition to the optical properties and band structure, large specific surface area and high CO 2 adsorption capacity are the essential requisites for photocatalytic CO 2 reduction 28.Thus, N 2 and CO 2 adsorption isotherms of the as-synthesized samples were measured (Figs.S22-S24).The results are listed in Table S5, T23 possesses the largest specific surface area and the highest CO 2 uptakes, providing more adsorption and activation sites for CO 2 substrate.To further understanding the photogeneration charge separation and transfer abilities, photoluminescent (PL) and time-resolved fluorescence decay experiments were carried out.T1 has a high PL emission, which is attributed to the recombination of electron-hole pairs while T23 exhibits a fast electron transfer ability with a prolonged carrier lifetime as well as low PL peak intensity (Fig. 5a andb).The average carrier lifetime decreases in the order of T23 (1.84 ns) T3 (1.74 ns) T13 (1.30 ns) T2 (1.19 ns) T12 (1.08 ns) T1 (0.57 ns).In order to show the intrinsic properties and the state of all the samples at different potentials, the cyclic voltammetry curves were tested (Fig. S25) 56.Moreover, to further evaluate the separation and migration efficiency of charge carriers, the photocurrent transient response (Fig. 5c) was examined.All the catalysts show a significant photocurrent response under irradiation.Obviously, T23 shows the strongest photocurrent density than the others, indicating that charge separation and migration efficiency of T23 was improved by exposing 110 and 111 facets.In Fig. 5d, the smallest semicircle radius for T23 was presented in Nyquist plots, indicating that T23 with the lowest charge-transfer resistance (R ct ) 57,58.Electron paramagnetic resonance (EPR) spectra were used to validate the existence of Ti III under irradiation relative to the EPR signal in the dark, indicating the conversion of Ti IV and Ti III in the photocatalytic reaction 59.As revealed in Fig. S26, T23 shows the strongest EPR signal under irradiation, indicating that T23 possesses more Ti III in the photoreduction system and the Ti III have strong reducibility to achieve the conversion of CO 2 to CO and CH 4 . Gibbs free energy calculations were further carried out by building models of (001), ( 110) and (111) surfaces to study the possible CO 2 -to-CO and CO 2 -to-CH 4 reaction pathways for the MIL-125-NH 2 (Ti) enclosed by low-index 001, 110 and 111 facets.According to the results shown in Fig. 6, the formation of COOH intermediates on (001) and (110) surfaces are endothermic steps, with the 1.52 and 1.69 eV uphill in free energy, respectively, which are the rate-limiting step for both facets.The (111) surface of MIL-125-NH 2 (Ti) has a COOH formation energy with 0.35 eV lower than the other two surfaces.The COOH intermediate could be attacked by the proton-electron pair (H e -) to form the CO species with the first H 2 O desorption simultaneously.The CO molecules could be relatively easily desorbed from the MIL-125-NH 2 (Ti) to form free CO molecules with the CO binding energy of -0.14, -0.27, and -0.23 eV on (001), ( 110) and (111) surfaces, respectively, which is in agreement with the experiments.Then, the proton-electron pair could attack the C or O atom of CO to form the CHO or COH intermediates, respectively.In contrast, the formation energy of COH is relatively high on three facets.This suggests that the CHO intermediate is energetically more favorable in this process.The subsequent protonation steps, including reducing CHO to CH 2 O and CH 3 O are thermodynamically favorable with the free energies downhill. The formation of CH 3 OH is an endothermic process on (001), ( 110) and (111) surfaces, with the free energy uphill of 0.15, 0.88 and 0.82 eV, respectively, which is the rate-limiting step for ( 111 -S29, respectively.Among the three surfaces of MIL-125-NH 2 (Ti), the (111) surface shows the lowest Gibbs free energy change of rate-limiting step, which indicated that the photocatalyst made up of (111) surfaces could be more efficient for CO 2 conversion, in agreement with the experimental results.Thus, the calculation results give a reasonable explanation that higher CO 2 reduction efficiency of 111 facets than 001 and 110 facets, meanwhile, revealed an eight-electron transfer process involving CH 4 evolution on the MIL-125-NH 2 (Ti) facets. In addition, the transfer ways of the electrons and holes after irradiation should be further discussed for the MIL-125-NH 2 (Ti) with mixed low-index facets.T12, T13 and T23 are constructed by two facets, and their band structures are determined by using HOMO-LUMO gap derived from the UV-vis diffuse reflectance spectra (DRS) (Figs.S12 andS13) and the band edge position obtained from the Mott-Schottky plots (Fig. S14) of each composed facet.For T23, the electron was excited on the 111 facets under irradiation and quickly migrated to the 110 facets thanks to the matched band structure between 110 and 111 facets (Fig. 7c), which could effectively inhibit the recombination of electron-hole pairs, prolonging the lifetime of photogenerated electrons.Thus, it enhances photocatalytic activity 16.T12 and T13, have 001 facets exposed on the surface and possess the decreased photocatalytic activity compared with T2 and T3, respectively.Combined with band structure (Fig. 7a andb) and PL intensity, it is indicated that the 001 facet plays the role of recombination centers for photogenerated charge carriers and thus inhibits the charge separation 60.Thus, the formation of facet surface heterojunction is one of the factors for the photocatalytic abilities of CO 2 conversion."
  },
  {
    "title": "Conclusions",
    "content": "In summary, MIL-125-NH 2 (Ti), a well-used photocatalyst 616263, was utilized as a model for the systematic investigation on the impact of the low-index facets exposed on the photoreduction of CO 2 .PDOS calculations were used to ensure the potential of MIL-125-NH 2 (Ti) for photocatalytic applications.In the photocatalytic system, Ti III shows strong reducibility for CO 2 -to-CO and CO 2 -to-CH 4 .The 111/110 mixture facets co-exposed exhibit excellent catalytic activity due to the formation of surface heterojunction and are in favor of the interfacial charge transfer.Thus, the regulation and optimization of facets are critical to the photocatalytic performance, which is beneficial to the initiation of the photocatalytic reaction, the promotion of electron migration and the inhibition of charge recombination.DFT calculations further revealed the energetically favorable reduction reaction pathway and proposed that 111 facets with lower energy input compared with 001 and 110 facets in the photocatalytic reaction.In short, this work uncovered the importance of morphorgy/facet on the catalytic activity as well as the facet heterojunction in boosting photocatalytic CO 2 reduction. Fig. 1.The crystal structure (a) and partial density of states (PDOS) of MIL-125-NH 2 (Ti) at PBE U level (b). Fig. 2. (a) Schematic illustration of the evolution of morphology and facet over MIL-125-NH 2 (Ti).SEM images of as-synthesized MIL-125-NH 2 (Ti) with disk-shaped plate (T1) (b), rhombic dodecahedron (T2) (c), octahedron (T3) (d), rectangle-like plate (T12) (e), truncated cube (T13) (f) and truncated octahedron (T23) (g).Scale bar: 500 nm. Fig. 3. HOMO-LUMO gap of the as-synthesized MIL-125-NH 2 (Ti). Fig. 4. The yield of products (a) and effective photo-electrons (b) of CO and CH 4 after irradiation for 5 h over the as-synthesized MIL-125-NH 2 (Ti), (c) 13 C-isotope trace test by using T23 as photocatalyst. Fig. 5. (a) Steady PL spectra under 325 nm excitation, (b) time-resolved fluorescence decay spectra, (c) photocurrent transient response, and (d) EIS Nyquist plots of the as-synthesized photocatalysts. Fig. 6.Free energy diagrams of photocatalytic reduction pathways of CO 2 -to-CO and CO 2 -to-CH 4 for MIL-125-NH 2 (Ti) on (a) (001), (b) (110) and (c) (111) surfaces. ) surface of MIL-125-NH 2 (Ti).The CH 3 OH intermediate is reduced by the hydrogen atom to generate the CH 3 along with desorption of the second H 2 O molecule.Finally, CH 3 could react with the proton-electron pair to generate CH 4 to complete the catalytic pathway.Therefore, the possible reaction pathway on three low-index facets of MIL-125-NH 2 (Ti) could be CO 2 COOH CO CHO CH 2 O CH 3 O CH 3 OH CH 3 CH 4 .The optimized geometric structures of intermediates on (001), (110) and (111) surfaces are exhibited in Figs.S27 Xiao-Mei Cheng: Investigation, Validation, Data curation, Writingoriginal draft, Visualization.Yuming Gu: Formal analysis.Xiao-Yu Zhang: Investigation.Xiao-Yao Dao: Investigation, Validation.Shi-Qing Wang: Investigation, Validation.Jing Ma: Formal analysis, Writing -review editing.Jing Zhao: Writing -review editing, Supervision.Wei-Yin Sun: Conceptualization, Resources, Writing -review editing, Supervision. We gratefully acknowledge the National Basic Research Program of China (grant no.2017YFA0303504) and the National Natural Science Foundation of China (grant nos.22033004, 21873045) for financial support of this work.This work was also supported by a Project Funded by the Priority Academic Program Development of Jiangsu Higher Education Institutions.We are grateful to the High-Performance Computing Center of Nanjing University for conducting the DFT calculation in this work on its Flex cluster system. The authors report no declarations of interest. Supplementary material related to this article can be found, in the online version, at doi:https://doi.org/10.1016/j.apcatb.2021.120524."
  }
]