[
  {
    "title": "Doi",
    "content": "10.1021/acscatal.7b04308"
  },
  {
    "title": "Article_Title",
    "content": "Fast and Selective Photoreduction of CO<sub>2</sub> to CO Catalyzed by a Complex of Carbon Monoxide Dehydrogenase, TiO<sub>2</sub>, and Ag Nanoclusters"
  },
  {
    "title": "Abstract",
    "content": "Selective, visible-light-driven conversion of CO 2 to CO with a turnover frequency of 20 s -1 under visible light irradiation at 25 C is catalyzed by an aqueous colloidal system comprising a pseudoternary complex formed among carbon monoxide dehydrogenase (CODH), silver nanoclusters stabilized by polymethacrylic acid (AgNCs-PMAA), and TiO 2 nanoparticles.The photocatalytic assembly, which is stable over several hours and for at least 250000 turnovers of the enzyme's active site, was investigated by separate electrochemical (dark) and fluorescence measurements to establish specific connectivities among the components.The data show (a) that a coating of AgNCs-PMAA on TiO 2 greatly enhances its ability as an electrode for CODHbased electrocatalysis of CO 2 reduction and (b) that the individual Ag nanoclusters interact directly and dynamically with the enzyme surface, most likely at exposed cysteine thiols.The results lead to a model for photocatalysis in which the AgNCs act as photosensitizers, CODH captures the excited electrons for catalysis, and TiO 2 mediates hole transfer from the AgNC valence band to sacrificial electron donors.The results greatly increase the benchmark for reversible CO 2 reduction under ambient conditions and demonstrate that, with such efficient catalysts, the limiting factor is the supply of photogenerated electrons."
  },
  {
    "title": "Experimental",
    "content": "Preparation of Silver Nanoclusters (AgNCs).Silver nanoclusters (AgNCs) were synthesized according to a previously published procedure. 23A freshly prepared aqueous solution of silver nitrate (0.1 M, 10 mL, Sigma-Aldrich, 99) was mixed with an equal volume of PMAA solution (5 mg/mL, adjusted with nitric acid to pH 3.0) at room temperature.After mixing, the colorless solution was purged by N 2 bubbling for 15 min to remove O 2 before exposing to laboratory sunlight.With increasing irradiation time the solution gradually changed from colorless to light pink and then to magenta.The solution was then mixed with tetrahydrofuran (17-30 w/w), and the deep magenta clusters that aggregated upon shaking were removed by centrifugation (3600 rpm, 15 min) and redissolved in water.The concentration of AgNCs was measured by inductively coupled plasma mass spectrometry (ICP-MS, Thermo Element 2).Matrix-assisted laser desorption time-of-flight mass spectra (MALDI-ToF-MS) were recorded on a Bruker Reflex III operated in reflectron mode using a N 2 laser (337 nm) and an accelerating voltage of 20 kV.The sample was prepared by drop-coating the solution onto the target. Electrochemistry Experiments.The working electrode consisting of TiO 2 deposited on indium tin oxide (ITO) (see the Supporting Information) was used in a single-compartment electrochemical cell with a Pt (wire) counter electrode, with a saturated calomel reference electrode held in a separate side arm and linked by a Luggin capillary.All potentials are quoted vs the standard hydrogen electrode (SHE) using the conversion relationship E SHE E SCE 241 mV at 25 C.The electrolyte consisted of 0.1 M NaCl and 0.2 M MES at pH 6.0, and all solutions were prepared using purified water (Milli-Q, 18 M cm).Electrochemical measurements were carried out with an Autolab potentiostat (PGSTAT30) controlled by Nova software (EcoChemie).Precise gas mixtures (BOC gases) were created using mass flow controllers (Sierra Instruments), and the electrochemical cell was constantly purged with the gas mixture throughout the experiments. Quantitative Analysis of CO Formed in Photocatalytic Experiments.An Agilent 7890A series gas chromatograph (GC) with electronic pneumatic control optimized for trace gas analysis was used to monitor CO production at regular intervals.Headspace gas samples (20 L) were injected into the GC in pulsed splitless mode using a gastight Hamilton syringe.A 1.5 mm diameter split/splitless liner, a Restek ShinCarbon ST micropacked column, a micro thermal conductivity detector, and high-purity He carrier gas with a constant pressure of 25 psi were used.The column oven was heated from 40 to 200 C at a rate of 10 C min -1 during measurements. Photocatalysis. Figure 1 shows experiments in which an aqueous suspension of CODH/AgNCs-PMAA/TiO 2 sealed under a CO 2 atmosphere was illuminated with visible light.Details for the preparation of AgNCs-PMAA and AgNCs-PMAA/TiO 2 nanomaterials are given in Figures S1-S3 in the Supporting Information.All suspensions were prepared in a glovebox under a N 2 atmosphere before they were taken out for measurements.Briefly, a suspension of AgNCs-PMAA/TiO 2 (5 mg) formed from 3.05 mg of TiO 2 (Evonik Aeroxide P25, 21 nm diameter) and 1.95 mg of AgNCs templated in PMAA (resulting in a final Ag/Ti atomic ratio of 0.27 as determined by ICP-MS) was formed by sonicating the two components in a 5 mL aqueous solution of 0.1 M triethanolamine (TEOA), 0.1 M NaCl, and 25 mM EDTA, adjusted to pH 6.0, all contained in a Pyrex pressure vessel (total volume 22.5 mL).Then CODH (50 L of 10 M solution, see the Supporting Information) was added and the suspension was stirred gently for 3 min to allow adsorption of the enzyme, before the vessel was sealed tightly with a rubber septum and the headspace purged with CO 2 .The stirred suspension was irradiated with visible light using a 300 W arc lamp (Newport 67005) fitted with a 420 nm filter and held 5 cm from the vessel.The temperature was controlled by immersing the vessel in a water bath.Production of CO was monitored at regular intervals by removing small volumes (20 L) of headspace gas for gas chromatography (GC) analysis.The amount of CO was quantified against calibration plots obtained with known amounts of CO (Figure S4).Turnover frequencies were obtained by dividing the quantity of CO formed in a given time by the total amount of CODH used. The results obtained without one of the components present, CODH, TiO 2 or AgNCs-PMAA, are included in Figure 1: the data suggest the requirement for a quasi-ternary complex containing all three components, although not necessarily in a stoichiometric manner (hence \"quasi\").The initial turnover frequency (TOF) of 20 s -1 observed at 25 C increases to 37 s -1 at 50 C.At 25 C the rate of CO production is steady during the first 1 h of irradiation before decreasing gradually to 14 s -1 over the next 3 h.Although the underlying stability is one factor, much of this decrease could be attributed to product inhibition by CO because the rate increased substantially each time the headspace was refreshed (Figure 1b).Taking cycle 1 as an example, the CO concentration reaches 6.7 in the headspace before flushing out: assuming a value of 1 mM for Henry's constant, the corresponding CO concentration in the solution would be 67 M, a value that exceeds the inhibition constant (46 M) measured electrochemically under comparable conditions at -560 mV vs SHE. 28In no case was any H 2 detected by GC: this important result is consistent with previous results 29 showing that CODHs are highly selective catalysts for CO 2 reduction even though water reduction is favored thermodynamically.An interesting and obvious outcome of the experiments shown in Figure 1b is that, after 6 h, each CODH molecule has turned over about 250000 times.Results obtained under a wide range of conditions are shown in Table 1.The rate of CO production varies by less than a factor of 2 among different electron donors (TEOA, EDTA, and MES).No significant changes in CO yield after 30 min irradiation were observed for TEOA concentrations between 0.05 and 0.25 M (Figure S5).Using the filtered light intensity and illuminated facial area of the reaction vessel, we estimated that the quantum yield would be approximately 1.5 on the basis of a wavelength of 500 nm. The discovery that a quasi-ternary complex formulated as CODH/AgNCs-PMAA/TiO 2 photoreduces CO 2 far more quickly than any binary combination was followed up with studies designed to examine different aspects of the interaction.An estimation of the composition of AgNCs-PMAA (the \"soft\" and least well-defined component) was carried out, on the basis of an average molecular weight of 5000 for PMAA.Taking, as a reference point, Ag 5 to be the dominant nanocluster (Figure S1), the analytical mass ratio 1/0.53 determined by ICP-MS yielded 5 Ag 5 per polymer molecule.Each PMAA has approximately 60 monomer units; therefore, numerous carboxylates should remain free to bind to the TiO 2 surface. 26lectrocatalysis.To investigate how AgNCs influence the \"dark\" electrocatalytic CO 2 /CO interconversion by CODH at a TiO 2 surface, experiments were carried out in which an electrode consisting of TiO 2 deposited on indium tin oxide (ITO) was modified with various combinations of AgNCs-PMAA, PMAA alone, and CODH.The results are shown in Figure 2. An unmodified TiO 2 electrode displays a signature \"trumpet shaped\" voltammogram that may be interpreted, chemically, in terms of the electronic conductivity increasing at the most negative potential as Ti(IV) centers are converted to Ti(III). 16omparisons between catalytic cyclic voltammograms (CVs) of CODH adsorbed at a TiO 2 electrode (Figure 2a) and at an AgNCs-PMAA/TiO 2 electrode (Figure 2b) reveal that CO 2 reduction activity is greatly enhanced by the presence of AgNCs-PMAA, which causes the current to increase at a lower overpotential.A small current due to reoxidation of CO becomes detectable, and there is also a change in the \"background\" control voltammogram (no CODH) when AgNCs-PMAA is present.Proof that the catalytic current stems from enzymatic activity was obtained by injecting an aliquot of concentrated KOCN solution into the cell (to a final concentration of 60 mM).Cyanate (NCO -), which is isoelectronic with CO 2 , targets the C red2 state of the enzyme and blocks CO 2 reduction. 28Figure 2c depicts the selective inhibition of CO 2 reduction on a CODH/AgNCs-PMAA/TiO 2 electrode after adding KOCN.Comparison of the background traces in Figure 2a,b shows that modification of the TiO 2 electrode with AgNCs-PMAA leads to a new reduction peak at -0.56 V (vs SHE), similar to that attributed to trap surface states of TiO 2 introduced particularly by binding of oxygen atom donor ligands. 30,31Figure 2d shows that PMAA alone (without AgNCs) also gives rise to a change in the TiO 2 background, introducing a small reduction peak similar to that observed with AgNCs-PMAA but shifted to more positive potential.Importantly, no catalytic current is observed when CODH is introduced, indicating that PMAA alone blocks the electrode with regard to electron transfer, enzyme binding, or both. Experiments to determine the stability and temperature dependence of the catalytic current were carried out: C. hydrogenoformans is a thermophile, and CODH should be inherently stable at ambient temperatures. 32The temperature dependence of CO 2 reduction activity at a CODH/AgNCs-PMAA/TiO 2 electrode over the range 25-50 C is shown in Figure S6, while Figures S7 andS8 show the stabilities determined by cyclic voltammetry and chronoamperometry, respectively.Cyclic voltammograms obtained under 100 CO 2 showed only a small decrease in current over 24 h, and chronoamperometry at -0.66 V vs SHE revealed even a small improvement with time.Both results reinforce the observations of the photocatalytic time courses for CO production with colloidal CODH/AgNCs-PMAA/TiO 2 and highlight the stark contrast with earlier results obtained with a RuP-TiO 2 system. 18,33The fact that increasing the temperature from 25 to 50 C yields only a modest (less than 2-fold) increase in rate suggests that CO 2 reduction at the active site of the enzyme (a Ni4Fe-4S cofactor known as the \"C-cluster\" 14,20 ) is still not a limiting factor. Fluorescence.The specific interaction between PMAAstabilized AgNCs and CODH was studied by performing a photoluminescence (PL) titration along with nanosecond luminescence kinetics.As shown in Figure 3a, the emission intensity first decreases and then increases as CODH is added to a solution containing AgNCs-PMAA.The point at which emission is minimal should correspond to optimal formation of a CODH/AgNCs-PMAA complex, which in this case (Ag atom concentration 20 M) occurs when the CODH concentration is 0.54 M.However, due to the coexistence of different structures and compositions in AgNCs-PMAA solution (Figure S1), the binding stoichiometry and a meaningful dissociation constant (K d ) between AgNCs-PMAA and CODH cannot be determined. The mechanism of photoemission by metal nanoclusters is controversial, 34353637 and independent studies have shown that the natures of the nanocluster core and anchoring ligands are both important.The quenching of emission that is observed as aliquots of CODH are added to AgNCs-PMAA resembles the quenching that is observed specifically in the presence of cysteine. 25The subsequent increase (Figure 3a and Figure S9 peak I at 544 nm) and appearance of a new blue-shifted emission peak (Figure S9 peak II at 522 nm) at higher CODH concentration suggests that further reactions occur beyond the binding of cysteine thiolate to Ag (see Figure S10). Time-correlated single photon counting (TCSPC) provided further information about the charge-transfer dynamics underlying the AgNCs fluorescence quenching (Figure 3b and Table S1).The short lifetime for Ag nanoclusters is typical for metal core sp-d hole recombination (fluorescence originating from the recombination of electrons in the s-p band with holes in the d band). 38The longer emission lifetime observed in the presence of CODH suggests surface-state sensitivity: 39 specifically, in this case, an interaction between the metal core and the thiolate-S. 38,40DISCUSSION Although the structure of CODH I has not been solved, some idea of the availability of surface cysteines is obtained from the structure of CODH II (1SU7) 41 and the CODH (CODH Rr) from Rhodospirillum rubrum (1JQK). 42A model for CODH I based on CODH-Rr using the SWISS-MODEL web program was simulated (Figure S11), and four possible surface cysteines were predicted for each half of the enzyme, these being cys162, cys271, cys346, and cys401.Of these possibilities, one cysteine (346) is conserved and surface exposed in the structure of CODH II and CODH Rr.Although the surface-exposed cysteine appears to be too remote to allow a direct electron transfer into the enzyme, it is likely that such a residue acts as an anchor point by which one Ag nanocluster is bound, the overall effect being to bring CODH, TiO 2 , and other PMAAstabilized AgNCs into dynamic close contact. Attempting to explain the interactions within a pseudoternary assembly in which the \"soft\" AgNCs-PMAA is a crucial component required an empirical approach.The connectivities among CODH, AgNCs, PMAA, and TiO 2 , in terms of all the experiments carried out, are therefore presented in Scheme 1. Whether measured by electrocatalysis (E) or photocatalysis (P), the ternary system outperforms the binary CODH/TiO 2 system by about 2 orders of magnitude and the activity is much longer lived.The fact that the CODH/PMAA/TiO 2 system (lacking AgNCs) is inactive electrochemically shows that any surface trap states that are introduced play no rolethe PMAA acting instead to block electron transfer. Referring to Table 1, rates of photocatalysis scale with the amount of enzyme in the system, and notably, for each given quantity of CODH, the rate of CO production is independent of the amount of AgNCs-PMAA/TiO 2 .These results show that the Ag nanoclusters are not acting directly as reduction catalysts. 4344445 Instead, since CO 2 reduction is driven by visible light and not UV (as would be required for bandgap excitation of TiO 2 ), the Ag nanoclusters must be operating as photosensitizers.The report that photoexcited AgNCs are highly proficient in reducing methylviologen is consistent with a calculation by Chen et al. indicating that the LUMO of a AgNC is 0.26 eV higher in energy than the conduction band of TiO 2 (itself capable of reducing CO 2 ). 43Although this energy gap means that electrons could pass from photoexcited AgNCs to TiO 2 , and then to enzyme, the electrochemical evidence discussed in more detail below suggests that electrons could instead transfer directly from photoexcited AgNCs to CODH and thence rapidly reduce CO 2 , the catalytic efficiency of the enzyme providing such an effective trap. From the electrocatalysis experiments, AgNCs-PMAA adsorbed on TiO 2 promotes CO 2 reduction by CODH at a higher potential (lower overpotential) in comparison to TiO 2 alone, whereas PMAA alone, which also produces a surfacestate redox transition, completely blocks electrocatalysis.Therefore, the AgNCs contained in PMAA are acting as electron mediators to the coadsorbed enzyme.The AgNCs embedded in PMAA must therefore be capable of rapid motion within the polymer, fast intercluster electron transfer, or both.The specific binding of CODH to Ag nanoclusters that is observed by fluorescence (F) helps to account for the photocatalytic activity that is displayed (at a much lower level) by the binary system CODH/AgNCs-PMAA.On the basis of the selective interaction with cysteine reported by others, 25 we expect that one or two surface-exposed cysteines are the primary targets, the interaction being dynamic and short-lived in order to account for the fact that the fluorescence is completely quenched during the titration.The surfaceexposed cysteine thiolates on CODH are too remote to allow direct electron transfer to the active site from a transiently interacting AgNC, but a dynamic arrangement and/or fast electron transfer between AgNCs within the same PMAA particle would allow use of the surface-exposed D cluster. 46he increased catalytic activity observed for the quasi-ternary assembly that includes TiO 2 in comparison to CODH/AgNCs-PMAA alone suggests that the TiO 2 nanoparticle is more than just a supporting scaffold.An estimate indicates that on average at least two CODH molecules may be loaded onto a single AgNCs-PMAA/TiO 2 nanoparticle (calculation given in the Supporting Information).On the basis of a proposal by Wang and co-workers, 43 the most likely mechanistic role for TiO 2 is to mediate hole transfer from the AgNC valence band to sacrificial electron donors reacting at its surface. In summary, a stable, quasi-ternary complex of CODH coadsorbed on TiO 2 nanoparticles with PMAA-stabilized Ag nanoclusters displays specific reduction of CO 2 to CO under visible light, at a per-CODH rate that is 2 orders of magnitude higher and much more stable than that reported earlier when a photosensitizing RuP complex was used. 18The findings raise interesting questions about the overall mechanism, important details of which remain to be clarified.The results help to emphasize the value of using enzymes in investigations of colloidal photocatalysts: their superb abilities as fast, efficient, and selective electrocatalysts focuses attention instead on the limitations affecting the light-harvesting and charge-transfer components and the directions needed for major improvements, including capitalizing on what is already known about the interaction of CODH with CO 2 and CO. 14 ASSOCIATED CONTENT Figure 1.Photocatalytic CO 2 reduction.(a) Time courses for photocatalytic CO production by the ternary CODH/AgNCs-PMAA/TiO 2 complex and other combinations, along with various control experiments, under visible light irradiation, followed using GC.In all cases, the 5 mL of water in the vial contained 0.1 M TEOA, 0.1 M NaCl, and 25 mM EDTA at pH 6.0.For experiments with the ternary complex (T), the vial contained 5 mg of AgNCs-PMAA/TiO 2 and 0.50 nmol of CODH.Experiments were carried out at 25 C (black), 37 C (red), and 50 C (blue).Control experiments were carried out using CODH/AgNCs-PMAA (no TiO 2 ), CODH/TiO 2 (no AgNCs-PMAA) and AgNCs-PMAA/TiO 2 (no CODH).(b) Production of CO over the course of 6 h, in which CO was flushed out at 2 h intervals and CO 2 was restored to the initial level (98). Figure 2. Cyclic voltammograms of CODH adsorbed on variously modified TiO 2 electrodes under an atmosphere of 100 CO 2 .(a) Electrocatalytic activity of CODH/TiO 2 and that of a bare TiO 2 electrode.(b) Electrocatalytic activities of CODH/AgNCs-PMAA/TiO 2 and AgNCs-PMAA/TiO 2 electrodes.(c) Selective inhibition of CO 2 reduction by CODH/AgNCs-PMAA/TiO 2 electrode in the presence of 60 mM KOCN.(d) Effect of PMAA alone on electrocatalytic activity, observed by comparing CODH/PMAA/TiO 2 with PMAA/TiO 2 .All solutions contained 0.2 M MES (pH 6.0, 0.1 M NaCl), with a temperature of 25 C and a scan rate of 10 mV s -1 . Figure 3. Interaction between AgNCs-PMAA and CODH.(a) Photoluminescence spectra of AgNCs-PMAA (Ag atom concentration 20 M determined by ICP-MS) using CODH (0-7.56 M) in 0.2 M MES buffer (0.5 mL, pH 6.0) with ex 460 nm.(b) Fluorescence decay traces of AgNCs-PMAA monitored at 460 nm.Black, green, and blue traces are for AgNCs-PMAA, AgNCs-PMAA/glutathione (GSH), and AgNCs-PMAA/CODH, respectively, in 0.2 M MES, pH 6, at room temperature.Fits are shown in red. Scheme 1. Connectivities between the Different Components As Viewed in Various Experiments a Visible-Light-Driven CO 2 Reduction by CODH/ AgNCs-PMAA/TiO 2 Assemblies under Different Conditions a Unless otherwise noted in the table, standard conditions were employed, which were as follows: CODH (50 L of 10 M solution) was added to a 5 mL dispersion of AgNCs-PMAA/TiO 2 (5 mg, composed of 3.05 mg of TiO 2 and 1.95 mg of AgNCs-PMAA, with Ag/Ti atom ratio of 0.27) in 0.1 M triethanolamine (TEOA), 25 mM ethylenediaminetetraacetic acid (EDTA), and 0.1 M NaCl at pH 6 and 25 C.Irradiation was carried out with a Newport 67005 arc lamp (300 W) fitted with a 420 nm filter and located 5 cm from the solution.b CO production rate (mol of CO h -1 ) based on the first hour of irradiation.c Turnover frequency (TOF) expressed as molecules of CO produced per second per molecule of CODH).d Value below 0.001 s -1 .e 2-(N-Morpholino)ethanesulfonic acid (MES). DOI: 10.1021/acscatal.7b04308ACS Catal.2018, 8, 2789-2795 L.Z. designed, carried out and analyzed all experiments.L.Z. and F.A.A. interpreted the results and wrote the manuscript.M.C. and S.W.R. prepared the enzyme and revised the manuscript. The authors declare no competing financial interest. L.Z. thanks the Royal Society and Newton fund for a Newton international fellow award (DHR00490).F.A.A. is a Royal Society-Wolfson Research Merit Award holder: research in his laboratory has been supported by several grants from the UK Biotechnology and Biological Sciences Research Council (BBSRC) particularly BB/M005720/1.We thank Professor Stephen Faulkner for allowing us to use his fluorescence spectrometer."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Photocatalysis. Figure 1 shows experiments in which an aqueous suspension of CODH/AgNCs-PMAA/TiO 2 sealed under a CO 2 atmosphere was illuminated with visible light.Details for the preparation of AgNCs-PMAA and AgNCs-PMAA/TiO 2 nanomaterials are given in Figures S1-S3 in the Supporting Information.All suspensions were prepared in a glovebox under a N 2 atmosphere before they were taken out for measurements.Briefly, a suspension of AgNCs-PMAA/TiO 2 (5 mg) formed from 3.05 mg of TiO 2 (Evonik Aeroxide P25, 21 nm diameter) and 1.95 mg of AgNCs templated in PMAA (resulting in a final Ag/Ti atomic ratio of 0.27 as determined by ICP-MS) was formed by sonicating the two components in a 5 mL aqueous solution of 0.1 M triethanolamine (TEOA), 0.1 M NaCl, and 25 mM EDTA, adjusted to pH 6.0, all contained in a Pyrex pressure vessel (total volume 22.5 mL).Then CODH (50 L of 10 M solution, see the Supporting Information) was added and the suspension was stirred gently for 3 min to allow adsorption of the enzyme, before the vessel was sealed tightly with a rubber septum and the headspace purged with CO 2 .The stirred suspension was irradiated with visible light using a 300 W arc lamp (Newport 67005) fitted with a 420 nm filter and held 5 cm from the vessel.The temperature was controlled by immersing the vessel in a water bath.Production of CO was monitored at regular intervals by removing small volumes (20 L) of headspace gas for gas chromatography (GC) analysis.The amount of CO was quantified against calibration plots obtained with known amounts of CO (Figure S4).Turnover frequencies were obtained by dividing the quantity of CO formed in a given time by the total amount of CODH used. The results obtained without one of the components present, CODH, TiO 2 or AgNCs-PMAA, are included in Figure 1: the data suggest the requirement for a quasi-ternary complex containing all three components, although not necessarily in a stoichiometric manner (hence \"quasi\").The initial turnover frequency (TOF) of 20 s -1 observed at 25 C increases to 37 s -1 at 50 C.At 25 C the rate of CO production is steady during the first 1 h of irradiation before decreasing gradually to 14 s -1 over the next 3 h.Although the underlying stability is one factor, much of this decrease could be attributed to product inhibition by CO because the rate increased substantially each time the headspace was refreshed (Figure 1b).Taking cycle 1 as an example, the CO concentration reaches 6.7 in the headspace before flushing out: assuming a value of 1 mM for Henry's constant, the corresponding CO concentration in the solution would be 67 M, a value that exceeds the inhibition constant (46 M) measured electrochemically under comparable conditions at -560 mV vs SHE. 28In no case was any H 2 detected by GC: this important result is consistent with previous results 29 showing that CODHs are highly selective catalysts for CO 2 reduction even though water reduction is favored thermodynamically.An interesting and obvious outcome of the experiments shown in Figure 1b is that, after 6 h, each CODH molecule has turned over about 250000 times.Results obtained under a wide range of conditions are shown in Table 1.The rate of CO production varies by less than a factor of 2 among different electron donors (TEOA, EDTA, and MES).No significant changes in CO yield after 30 min irradiation were observed for TEOA concentrations between 0.05 and 0.25 M (Figure S5).Using the filtered light intensity and illuminated facial area of the reaction vessel, we estimated that the quantum yield would be approximately 1.5 on the basis of a wavelength of 500 nm. The discovery that a quasi-ternary complex formulated as CODH/AgNCs-PMAA/TiO 2 photoreduces CO 2 far more quickly than any binary combination was followed up with studies designed to examine different aspects of the interaction.An estimation of the composition of AgNCs-PMAA (the \"soft\" and least well-defined component) was carried out, on the basis of an average molecular weight of 5000 for PMAA.Taking, as a reference point, Ag 5 to be the dominant nanocluster (Figure S1), the analytical mass ratio 1/0.53 determined by ICP-MS yielded 5 Ag 5 per polymer molecule.Each PMAA has approximately 60 monomer units; therefore, numerous carboxylates should remain free to bind to the TiO 2 surface. 26lectrocatalysis.To investigate how AgNCs influence the \"dark\" electrocatalytic CO 2 /CO interconversion by CODH at a TiO 2 surface, experiments were carried out in which an electrode consisting of TiO 2 deposited on indium tin oxide (ITO) was modified with various combinations of AgNCs-PMAA, PMAA alone, and CODH.The results are shown in Figure 2. An unmodified TiO 2 electrode displays a signature \"trumpet shaped\" voltammogram that may be interpreted, chemically, in terms of the electronic conductivity increasing at the most negative potential as Ti(IV) centers are converted to Ti(III). 16omparisons between catalytic cyclic voltammograms (CVs) of CODH adsorbed at a TiO 2 electrode (Figure 2a) and at an AgNCs-PMAA/TiO 2 electrode (Figure 2b) reveal that CO 2 reduction activity is greatly enhanced by the presence of AgNCs-PMAA, which causes the current to increase at a lower overpotential.A small current due to reoxidation of CO becomes detectable, and there is also a change in the \"background\" control voltammogram (no CODH) when AgNCs-PMAA is present.Proof that the catalytic current stems from enzymatic activity was obtained by injecting an aliquot of concentrated KOCN solution into the cell (to a final concentration of 60 mM).Cyanate (NCO -), which is isoelectronic with CO 2 , targets the C red2 state of the enzyme and blocks CO 2 reduction. 28Figure 2c depicts the selective inhibition of CO 2 reduction on a CODH/AgNCs-PMAA/TiO 2 electrode after adding KOCN.Comparison of the background traces in Figure 2a,b shows that modification of the TiO 2 electrode with AgNCs-PMAA leads to a new reduction peak at -0.56 V (vs SHE), similar to that attributed to trap surface states of TiO 2 introduced particularly by binding of oxygen atom donor ligands. 30,31Figure 2d shows that PMAA alone (without AgNCs) also gives rise to a change in the TiO 2 background, introducing a small reduction peak similar to that observed with AgNCs-PMAA but shifted to more positive potential.Importantly, no catalytic current is observed when CODH is introduced, indicating that PMAA alone blocks the electrode with regard to electron transfer, enzyme binding, or both. Experiments to determine the stability and temperature dependence of the catalytic current were carried out: C. hydrogenoformans is a thermophile, and CODH should be inherently stable at ambient temperatures. 32The temperature dependence of CO 2 reduction activity at a CODH/AgNCs-PMAA/TiO 2 electrode over the range 25-50 C is shown in Figure S6, while Figures S7 andS8 show the stabilities determined by cyclic voltammetry and chronoamperometry, respectively.Cyclic voltammograms obtained under 100 CO 2 showed only a small decrease in current over 24 h, and chronoamperometry at -0.66 V vs SHE revealed even a small improvement with time.Both results reinforce the observations of the photocatalytic time courses for CO production with colloidal CODH/AgNCs-PMAA/TiO 2 and highlight the stark contrast with earlier results obtained with a RuP-TiO 2 system. 18,33The fact that increasing the temperature from 25 to 50 C yields only a modest (less than 2-fold) increase in rate suggests that CO 2 reduction at the active site of the enzyme (a Ni4Fe-4S cofactor known as the \"C-cluster\" 14,20 ) is still not a limiting factor. Fluorescence.The specific interaction between PMAAstabilized AgNCs and CODH was studied by performing a photoluminescence (PL) titration along with nanosecond luminescence kinetics.As shown in Figure 3a, the emission intensity first decreases and then increases as CODH is added to a solution containing AgNCs-PMAA.The point at which emission is minimal should correspond to optimal formation of a CODH/AgNCs-PMAA complex, which in this case (Ag atom concentration 20 M) occurs when the CODH concentration is 0.54 M.However, due to the coexistence of different structures and compositions in AgNCs-PMAA solution (Figure S1), the binding stoichiometry and a meaningful dissociation constant (K d ) between AgNCs-PMAA and CODH cannot be determined. The mechanism of photoemission by metal nanoclusters is controversial, 34353637 and independent studies have shown that the natures of the nanocluster core and anchoring ligands are both important.The quenching of emission that is observed as aliquots of CODH are added to AgNCs-PMAA resembles the quenching that is observed specifically in the presence of cysteine. 25The subsequent increase (Figure 3a and Figure S9 peak I at 544 nm) and appearance of a new blue-shifted emission peak (Figure S9 peak II at 522 nm) at higher CODH concentration suggests that further reactions occur beyond the binding of cysteine thiolate to Ag (see Figure S10). Time-correlated single photon counting (TCSPC) provided further information about the charge-transfer dynamics underlying the AgNCs fluorescence quenching (Figure 3b and Table S1).The short lifetime for Ag nanoclusters is typical for metal core sp-d hole recombination (fluorescence originating from the recombination of electrons in the s-p band with holes in the d band). 38The longer emission lifetime observed in the presence of CODH suggests surface-state sensitivity: 39 specifically, in this case, an interaction between the metal core and the thiolate-S. 38,40DISCUSSION Although the structure of CODH I has not been solved, some idea of the availability of surface cysteines is obtained from the structure of CODH II (1SU7) 41 and the CODH (CODH Rr) from Rhodospirillum rubrum (1JQK). 42A model for CODH I based on CODH-Rr using the SWISS-MODEL web program was simulated (Figure S11), and four possible surface cysteines were predicted for each half of the enzyme, these being cys162, cys271, cys346, and cys401.Of these possibilities, one cysteine (346) is conserved and surface exposed in the structure of CODH II and CODH Rr.Although the surface-exposed cysteine appears to be too remote to allow a direct electron transfer into the enzyme, it is likely that such a residue acts as an anchor point by which one Ag nanocluster is bound, the overall effect being to bring CODH, TiO 2 , and other PMAAstabilized AgNCs into dynamic close contact. Attempting to explain the interactions within a pseudoternary assembly in which the \"soft\" AgNCs-PMAA is a crucial component required an empirical approach.The connectivities among CODH, AgNCs, PMAA, and TiO 2 , in terms of all the experiments carried out, are therefore presented in Scheme 1. Whether measured by electrocatalysis (E) or photocatalysis (P), the ternary system outperforms the binary CODH/TiO 2 system by about 2 orders of magnitude and the activity is much longer lived.The fact that the CODH/PMAA/TiO 2 system (lacking AgNCs) is inactive electrochemically shows that any surface trap states that are introduced play no rolethe PMAA acting instead to block electron transfer. Referring to Table 1, rates of photocatalysis scale with the amount of enzyme in the system, and notably, for each given quantity of CODH, the rate of CO production is independent of the amount of AgNCs-PMAA/TiO 2 .These results show that the Ag nanoclusters are not acting directly as reduction catalysts. 4344445 Instead, since CO 2 reduction is driven by visible light and not UV (as would be required for bandgap excitation of TiO 2 ), the Ag nanoclusters must be operating as photosensitizers.The report that photoexcited AgNCs are highly proficient in reducing methylviologen is consistent with a calculation by Chen et al. indicating that the LUMO of a AgNC is 0.26 eV higher in energy than the conduction band of TiO 2 (itself capable of reducing CO 2 ). 43Although this energy gap means that electrons could pass from photoexcited AgNCs to TiO 2 , and then to enzyme, the electrochemical evidence discussed in more detail below suggests that electrons could instead transfer directly from photoexcited AgNCs to CODH and thence rapidly reduce CO 2 , the catalytic efficiency of the enzyme providing such an effective trap. From the electrocatalysis experiments, AgNCs-PMAA adsorbed on TiO 2 promotes CO 2 reduction by CODH at a higher potential (lower overpotential) in comparison to TiO 2 alone, whereas PMAA alone, which also produces a surfacestate redox transition, completely blocks electrocatalysis.Therefore, the AgNCs contained in PMAA are acting as electron mediators to the coadsorbed enzyme.The AgNCs embedded in PMAA must therefore be capable of rapid motion within the polymer, fast intercluster electron transfer, or both.The specific binding of CODH to Ag nanoclusters that is observed by fluorescence (F) helps to account for the photocatalytic activity that is displayed (at a much lower level) by the binary system CODH/AgNCs-PMAA.On the basis of the selective interaction with cysteine reported by others, 25 we expect that one or two surface-exposed cysteines are the primary targets, the interaction being dynamic and short-lived in order to account for the fact that the fluorescence is completely quenched during the titration.The surfaceexposed cysteine thiolates on CODH are too remote to allow direct electron transfer to the active site from a transiently interacting AgNC, but a dynamic arrangement and/or fast electron transfer between AgNCs within the same PMAA particle would allow use of the surface-exposed D cluster. 46he increased catalytic activity observed for the quasi-ternary assembly that includes TiO 2 in comparison to CODH/AgNCs-PMAA alone suggests that the TiO 2 nanoparticle is more than just a supporting scaffold.An estimate indicates that on average at least two CODH molecules may be loaded onto a single AgNCs-PMAA/TiO 2 nanoparticle (calculation given in the Supporting Information).On the basis of a proposal by Wang and co-workers, 43 the most likely mechanistic role for TiO 2 is to mediate hole transfer from the AgNC valence band to sacrificial electron donors reacting at its surface."
  },
  {
    "title": "Conclusions",
    "content": "In summary, a stable, quasi-ternary complex of CODH coadsorbed on TiO 2 nanoparticles with PMAA-stabilized Ag nanoclusters displays specific reduction of CO 2 to CO under visible light, at a per-CODH rate that is 2 orders of magnitude higher and much more stable than that reported earlier when a photosensitizing RuP complex was used. 18The findings raise interesting questions about the overall mechanism, important details of which remain to be clarified.The results help to emphasize the value of using enzymes in investigations of colloidal photocatalysts: their superb abilities as fast, efficient, and selective electrocatalysts focuses attention instead on the limitations affecting the light-harvesting and charge-transfer components and the directions needed for major improvements, including capitalizing on what is already known about the interaction of CODH with CO 2 and CO. 14 ASSOCIATED CONTENT Figure 1.Photocatalytic CO 2 reduction.(a) Time courses for photocatalytic CO production by the ternary CODH/AgNCs-PMAA/TiO 2 complex and other combinations, along with various control experiments, under visible light irradiation, followed using GC.In all cases, the 5 mL of water in the vial contained 0.1 M TEOA, 0.1 M NaCl, and 25 mM EDTA at pH 6.0.For experiments with the ternary complex (T), the vial contained 5 mg of AgNCs-PMAA/TiO 2 and 0.50 nmol of CODH.Experiments were carried out at 25 C (black), 37 C (red), and 50 C (blue).Control experiments were carried out using CODH/AgNCs-PMAA (no TiO 2 ), CODH/TiO 2 (no AgNCs-PMAA) and AgNCs-PMAA/TiO 2 (no CODH).(b) Production of CO over the course of 6 h, in which CO was flushed out at 2 h intervals and CO 2 was restored to the initial level (98). Figure 2. Cyclic voltammograms of CODH adsorbed on variously modified TiO 2 electrodes under an atmosphere of 100 CO 2 .(a) Electrocatalytic activity of CODH/TiO 2 and that of a bare TiO 2 electrode.(b) Electrocatalytic activities of CODH/AgNCs-PMAA/TiO 2 and AgNCs-PMAA/TiO 2 electrodes.(c) Selective inhibition of CO 2 reduction by CODH/AgNCs-PMAA/TiO 2 electrode in the presence of 60 mM KOCN.(d) Effect of PMAA alone on electrocatalytic activity, observed by comparing CODH/PMAA/TiO 2 with PMAA/TiO 2 .All solutions contained 0.2 M MES (pH 6.0, 0.1 M NaCl), with a temperature of 25 C and a scan rate of 10 mV s -1 . Figure 3. Interaction between AgNCs-PMAA and CODH.(a) Photoluminescence spectra of AgNCs-PMAA (Ag atom concentration 20 M determined by ICP-MS) using CODH (0-7.56 M) in 0.2 M MES buffer (0.5 mL, pH 6.0) with ex 460 nm.(b) Fluorescence decay traces of AgNCs-PMAA monitored at 460 nm.Black, green, and blue traces are for AgNCs-PMAA, AgNCs-PMAA/glutathione (GSH), and AgNCs-PMAA/CODH, respectively, in 0.2 M MES, pH 6, at room temperature.Fits are shown in red. Scheme 1. Connectivities between the Different Components As Viewed in Various Experiments a Visible-Light-Driven CO 2 Reduction by CODH/ AgNCs-PMAA/TiO 2 Assemblies under Different Conditions a Unless otherwise noted in the table, standard conditions were employed, which were as follows: CODH (50 L of 10 M solution) was added to a 5 mL dispersion of AgNCs-PMAA/TiO 2 (5 mg, composed of 3.05 mg of TiO 2 and 1.95 mg of AgNCs-PMAA, with Ag/Ti atom ratio of 0.27) in 0.1 M triethanolamine (TEOA), 25 mM ethylenediaminetetraacetic acid (EDTA), and 0.1 M NaCl at pH 6 and 25 C.Irradiation was carried out with a Newport 67005 arc lamp (300 W) fitted with a 420 nm filter and located 5 cm from the solution.b CO production rate (mol of CO h -1 ) based on the first hour of irradiation.c Turnover frequency (TOF) expressed as molecules of CO produced per second per molecule of CODH).d Value below 0.001 s -1 .e 2-(N-Morpholino)ethanesulfonic acid (MES). DOI: 10.1021/acscatal.7b04308ACS Catal.2018, 8, 2789-2795 L.Z. designed, carried out and analyzed all experiments.L.Z. and F.A.A. interpreted the results and wrote the manuscript.M.C. and S.W.R. prepared the enzyme and revised the manuscript. The authors declare no competing financial interest. L.Z. thanks the Royal Society and Newton fund for a Newton international fellow award (DHR00490).F.A.A. is a Royal Society-Wolfson Research Merit Award holder: research in his laboratory has been supported by several grants from the UK Biotechnology and Biological Sciences Research Council (BBSRC) particularly BB/M005720/1.We thank Professor Stephen Faulkner for allowing us to use his fluorescence spectrometer."
  }
]