[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2018.11.021"
  },
  {
    "title": "Article_Title",
    "content": "Enhanced photocatalytic CO2 reduction to methane over WO3·0.33H2O via Mo doping"
  },
  {
    "title": "Abstract",
    "content": "Highlights Homogeneous Mo doping in WO30.33H2Oleads to the increased yield and selectivity for CO2 reduction to CH4. Mo doping in WO30.33H2Ofacilitates CO2 activation. Tungsten bronze (HxWO30.33H2O)formed under light irradiation, provides required electrons and protons for CO2 reduction. Enhanced water oxidation promotes protons supply for CH4 generation."
  },
  {
    "title": "Experimental",
    "content": "All chemicals involved were of analytical grade and used without further purification.WO nanorods were synthesized by hydrothermal method 36,37.Typically, 10 mL of hydrochloric acid (3 M) was added to 20 mL of sodium tungstate (Na2WO42H2O) solution (0.075 M) under stirring.When a light-yellow precipitate of amorphous tungstic acid appeared, the mixture was separated by filtration, after which deionized water (30 mL) and a certain amount of sodium sulfate (1.8 g) were immediately added to the solid precipitate.After ultrasonic concussion for 10 min, the system was transferred into a Teflon-lined stainless steel autoclave and heated at 180 C for 12 hours.The products were filtered and washed thoroughly with deionized water and freeze drying overnight. As for Mo-doped WO nanorods, Na2WO42H2O and Na2MoO42H2O of different stoichiometric ratios (Mo:W 1, 3, 5) were first dissolved in deionized water (20 mL, WMo1.5 mmol), while the subsequent process was the same as that of WO nanorods.The corresponding products were denoted as 1Mo-WO, 3Mo-WO, 5Mo-WO, respectively. The XRD characterization of the samples was carried out by a Rigaku Miniflex II desktop X-ray diffractometer with an operating voltage of 30 kV and current of 100 mA, while the wavelength of monochromatized Cu K radiation was 0.15418 nm.Raman spectra were recorded on a Horiba LABRAM HR, with a 514 nm excitation laser line. Fourier transform infrared (FTIR) spectra were recorded on a Lambda FTIR-7600 spectrometer over 4000-400 cm -1 with a resolution of 4 cm -1 .X-ray photoelectron spectroscopy (XPS) measurements were performed at a Thermo Fisher ESCALAB 250Xi XPS microprobe using monochromatic Al K radiation (1253.6 eV) as the X-ray source. Morphology and microstructure of the samples were investigated upon a JEOL JEM-2100F transmission electron microscopy (TEM) under a 200 kV accelerating voltage. Diffuse reflectance spectra (DRS) were measured using a Hitachi U-3010 spectrophotometer fitted with an integrating sphere attachment from 300-800 nm with BaSO4 as the reference.Carbon dioxide temperature-programmed desorption (CO2-TPD) measurements were performed on an Auto Chem II 2920 instrument.Typically, 100 mg of the sample, placed in a glass tube, was pretreated by a He gas flow at 150 C for 30 min and then cooled down to 50 C.The adsorption of CO2 was performed in a CO2 (10 in He) gas flow at 50 C for 2 h.After purge by He gas, the sample was heated from 50 to 700 C at a rate of 10 C/min.The TPD signal was recorded by a thermal conductivity detector.Electron paramagnetic resonance (EPR) spectra were obtained by a Bruker A30 EPR spectrometer (300 K, 9.866 GHz, X-band).Photoluminescence (PL) spectra were obtained to investigate the OH radicals from a Hitachi F-4600 fluorescence spectrophotometer at room temperature.The OH scavenger of terephthalic acid was mixed with sodium hydroxide to prepare colorless aqueous solution.25 mg of the catalyst with as prepared solution (terephthalic acid: 0.5 mM, sodium hydroxide: 2mM) was added into the reactor, then dry nitrogen was bubbled continuously through the suspension in the dark for 40 min, after which the illumination was turned on for 90 min. The peak intensity of FL indicated the concentration of OH radicals in the catalytic system.The fluorescence wavelength which represents the generation of OH is 425 nm with the excitation at 315 nm. Photoelectrochemical analyses were conducted on a Chenhua CHI 660D electrochemical workstation with conventional three-electrode quartz cell system: a platinum sheet and a saturated calomel electrode (SCE) were used as the counter and reference electrodes respectively, while a CHF-XM-500W Xe-lamp served as light source.To make a working electrode, catalyst powders were deposited on a fluorinedoped tin oxide (FTO) substrate.Typically, a slurry containing 10 mg photocatalysts and 1.0 mL ethanol was made and ultrasonically scattered for several minutes, then 100 L of the slurry above was coated onto FTO glass.After natural evaporation of ethanol, the working electrodes were then calcined at 120 o C for 2 h in an argon atmosphere to improve the attachment.During the measurements, the electrolyte of 0.1 M Na2SO4 solution (pH 6.8) was bubbled with carbon dioxide or Argon. The experiments of gas-phase CO2 photoreduction with H2O on photocatalysts were carried out in a closed pyrex cell (600 mL) with a quartz window under 500 W Xe-lamp, while the whole reaction process was maintained at 30 o C. Generally, WO or Mo-WO powder (25 mg) was sprinkled on bottom of the pyrex cell.Water (0.5 mL) was sprayed around the catalyst.Prior to the irradiation, the cell was purged with dry nitrogen, followed by injection of CO2 (0.25 ml, about 400 ppm).The gaseous products (CO, CH4) was analyzed by a gas chromatograph (GC, Tianmei 7890) equipped with a TDX-01 column and a flame ionization detector (FID).Some possibly existed by-products were also analyzed.C2H6 was analyzed by a gas chromatograph (GC, Tianmei 7890) equipped with a TM-Al2O3/S column and a flame ionization detector (FID).Products those can dissolve in water were absorbed into 15 mL water and analyzed by a gas chromatograph (GC, Tianmei 7890) equipped with a SE-54 column and a flame ionization detector (FID).The H2 product was analyzed by a GC (Tianmei 7890II) equipped with a Molecular Sieve 5A 80/100 Mesh column and a thermal conductivity detector (TCD)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Fig. 1a depicts the XRD patterns of WO30.33H2O(noted as WO) and Mo-doped WO30.33H2O(noted as Mo-WO) nanorods with various Mo/W ratios.All of the peaks can be well-indexed to the hexagonal phase of WO30.33H2O(JCPDS 35-1001), similar to a previous report using K2SO4 assisted method to fabricate hexagonal WO3 38.The intensity of the (001) plane is stronger than that of the rest of the planes, implying that Raman spectra for the as-synthesized WO and Mo-WO nanorods are shown in Fig. 2a, providing further structural composition information.The bands at 253 and 332 cm -1 are related to the W-O-W bending modes, while the bands at 759 and 802 cm -1 are related to O-W-O stretching modes 39.The band at around 962 cm -1 is assigned to the stretching mode of the terminal WO bond 40.This mode is common for all types of tungsten trioxide hydrates.Fig. 2b displays the FTIR spectra of the as-synthesized WO and 3Mo-WO nanorods.Absorption bands at 560-850 cm -1 and 954 cm -1 for WO are the characteristics of the stretching modes of O-W-O and WO, respectively 41. Minor peaks at 2308-2380 cm -1 are ascribed to CO2 adsorption on WO.Broad absorption band at 3460 cm -1 and sharp band at 1634 cm -1 have been observed, originating from stretching and bending vibrations of OH group, indicating that the sample contains water molecules 42.The FTIR spectra exhibit the clean surface of our samples.Furthermore, no distinct position changes of Raman and FTIR spectra could be observed after Mo doping, confirming that doping of WO exerted negligible influence on its structure. The UV-vis-NIR absorption spectra of the WO and Mo-WO samples are performed in Fig. 3a.A higher broad absorption tail appears in WO, suggesting polaron-to-polaron transitions between W 6 and the adjacent W 5 or W 4 states through hopping induced by incident photons 43,44.As Mo concentration increases, the absorption intensity in the To further investigate whether the position of the band edges is influenced by Mo doping, electrochemical Mott-Schottky measurements were performed to measure the flat-band potential (Efb) of the WO and 3Mo-WO.As shown in Fig. 3c and Fig. 3d, the slope of linear 1/C 2 potential curve is positive, indicating that WO is a characteristic ntype semiconductor.The Efb values are calculated from the intercept of the axis with potential values to be -0.16 and -0.14 V vs. NHE at pH 7 for WO and 3Mo-WO, respectively.Generally, the position of Efb is considered to be about 0.1 V below the conduction band (Ecb) for many n-type semiconductors 12.As a result, the Ecb of WO and 3Mo-WO is -0.26 and -0.24 V vs. NHE at pH 7, respectively.As seen in Fig. 3e, though the Ecb and the valence band (Evb) slightly positively shifted after Mo doping, 3Mo-WO still met the potential demand for CO2 reduction to CH4.In addition, the thermodynamical reduction potential would dramatically decrease by adsorption and activation which may play a more important role in promoting CO2 reduction 19,20. In order to shed light on the compositions and elementary valence states of the samples, X-ray photoelectron spectroscopy (XPS) analysis was then carried out (Fig. S2 and Fig. S1, the surface Mo/W ratios determined by XPS data is comparable to the chemical composition measured by EDS, indicating a homogeneous distribution of Mo and W in the samples.As displayed in Fig. 4a, the high resolution spectrum of W 4f presents two strong peaks at 37.6 eV and 35.5 eV for WO sample, which could be severally assigned to W 4f5/2 and W 4f7/2 of W 6 , while two minor peaks at 36.7 eV and 34.6 eV can be ascribed to W 5 31.The co-existence of W 6 and W 5 confirms polaron-to-polaron transitions in our samples, fairly agreeing with the broad absorption tail in UV-vis-NIR absorption spectra in Fig. 3a.Fig. 4b shows O 1s XPS spectra of the samples.The peak at 530.5 eV is ascribed to the lattice oxygen, while the other two peaks located at 531.4 and 533.3 eV are attributed to the O-atoms in the surface OH and the O-atoms in the surface OH2, respectively 12,45. The high-resolution Mo 3d XPS spectrum of 3Mo-WO (Fig. 4c) reveals that both Mo 6 (binding energy at 232.9 and 236.2 eV) and Mo 5 (binding energy at 231.3 and 234.51 eV) are presented in the samples 31.The introduction of Mo 5 enhances polaron-topolaron transitions and improves the ability to harvest vis-NIR light (Fig. 3a).For Mo doped WO, the characteristic peaks of W 4f and O 1s were shifted to higher binding energy with increasing the concentration of Mo, which indicates the electronic modulation of WO by Mo doping. EPR spectra are further used to determine the low valence state metal ions in our samples.The spectra are similar with that of the recent report 32.According to Fig. 4d, a hyperfine structure with both parallel (g// 1.846) and perpendicular (g 1.907) bands relevant to Mo species occurs in the EPR spectrum of Mo-WO, which indicates the 32.The penta-coordination further proves the presence of coordinately unsaturated Mo species in Mo-WO 32.According to previous reports, owing to the strong electron donating power, low-valent metal species such as Ti 3 and Bi 2 give good CO2 or N2 activation performance 46474849.Therefore, Mo 5 and W 5 species in our sample may also promote CO2 activation. To assess the catalytic performance, photocatalytic CO2 reduction was conducted at room temperature and atmospheric pressure.Firstly, no organics were used as raw materials in our samples, excluding the possible influence of other carbon sources. Besides, a control experiment was carried out without either photocatalysts or illumination, no detectable products were observed, indicating that both the photocatalysts and light irradiation are indispensable for CO2 photoreduction.It is worth noting that no H2, C2H6, methanol or ethanol was detected during the photocatalytic process (Fig. S3,S4).Fig. 5 summarizes the photocatalytic CO2 reduction activity of the WO and Mo-WO samples.As depicted in Fig. 5a, the 3Mo-WO sample exhibits the highest performance for the photocatalytic CO2 reduction to CH4 (31.8 umol g -1 ) during the first six hours under atmospheric CO2 concentration (400 ppm), which is about 5.2 times higher than that of WO (6.1 umol g -1 ) under the same conditions, indicating the superior effect of Mo doping in WO.However, the change of CO yield is slightly relevant to Mo doping (Fig. S5).For 3Mo-WO sample, the CO productive rate is only about 1.2 times higher than that of WO, demonstrating Mo doping mainly improves the activity of CH4 generation.As shown in Fig. 5b, the CH4 selectivity is highly improved from 27.3 to 61.2 after Mo doping, among which 3Mo-WO reaches the highest In addition, the yields of CH4 production were acceptably stable in at least 5 cycles, indicating the stability of 3Mo-WO catalyst (Fig. 5c). Mo doping in WO has highly improved the activity of CO2 photoreduction, especially for CH4 generation.To better understand the process and guide our future works, the roles of Mo doping in CO2 activation and protonation should be investigated carefully. Considering the thermodynamical stability of CO2, the adsorption and activation of CO2 are supposed to be discussed.Firstly, the CO2 temperature-programmed desorption (TPD) has been carried out to reveal the adsorption sites of CO2 on the surface of WO and Mo-doped WO samples.As shown in Fig. 6a, the TPD profiles contains three major desorption peaks.A low-temperature desorption peak occurs at approximately 160 C due to physical adsorption, assigned to the linear adsorbed CO2 by surface OH 12.The medium-temperature desorption peaks between 280 C and 450 C is most likely associated with the lattice oxygen anions, while the peak above 450 C probably corresponds to the CO2 desorption on the strong basic sites of low-coordination oxygen 50.In view of the above, it is found that both of the WO and Mo-WO have great ability for CO2 adsorption, and the CO2 adsorption capacity is similar. To further examine the adsorption and chemical activation of CO2 molecule on the WO and Mo-WO, FTIR spectra were displayed in Fig. 6b and Fig. S6.The weak IR bands at 1410-1490 and 1500-1590 cm -1 may be assign to the bicarbonate (HCO3 -) features and mono-and bidentate carbonates (b-CO3 2-, m-CO3 2-), respectively, which was induced by exposing the WO and Mo-WO to air or CO2 atmosphere 51.After light irradiation under CO2 atmosphere for 20 minutes, the key intermediates of CO2 -species at 1260 cm -1 were observed 19,52.This finding suggests that the surface active sites of Mo-WO can trap the photogenerated electrons and then effectively facilitate the process of electron injection to the adsorbed CO2 molecules, achieving the CO2 activation. Normally, the one-electron reduction of CO2 is very difficult, but the literatures have reported that the single-electron reduction of CO2 to CO2 -easily occurred on low-valent metal species such as Ti 3 and Bi 9,21,53.This suggests that the W 5 and Mo 5 in our samples promote the one-electron transfer reaction. To further look into the role of Mo doping for CO2 activation, photoelectrochemical method was conducted to examine the interfacial charge kinetics for WO and Mo-WO through transient photocurrent responses in different atmosphere.In Fig. 6c, the photocurrent in Ar atmosphere can be ascribed to the transfer of photo-induced electrons to electrode, while in CO2 saturated solution, photocurrent would compete with electrons transfer to CO2 32.Intriguingly, the photocurrent density of 3Mo-WO under the CO2 atmosphere reduces about 30 than that under the Ar atmosphere, while for WO, the photocurrent density reduces 21, indicative of the stronger interaction between the surface active sites and CO2 for 3Mo-WO.Mo doping is highly favorable for the interfacial electrons transfer from the excited Mo-WO to the adsorbed CO2, promoting photocatalytic CO2 activation and reduction.In addition, similar to the report, WO and Mo-WO have the ability to store photogenerated electrons with enhanced vis-NIR absorption under light irradiation (Fig. S7) 54.To compare the electrons storage and S8) exhibits obvious charge release once the light is shielded, indicating sufficient charge storage on exposure to photons 55.In comparison with the signal of pristine WO, the above charge storage and release should be reasonably attributed to that the Mo doping improves the electrons storage and localization ability.It is supposed that Mo 5 ions doped in WO prefer to localize electrons around them and enhance photo-induced electron density on the active sites, so as to improving the electron-giving ability for CO2 activation and reduction.Besides, a smaller semicircle for the Mo doping sample from Nyquist plots (Fig. 6d) points out a lower resistance, which is also beneficial to interfacial electrons transfer and CO2 photoreduction. In addition to the surface CO2 activation, photoinduced protonation with electron/proton transfer is another elementary step for CO2 reduction to CH4.Water splitting (H2O OHads x H x e -) followed by proton and electron insertion reaction under light irradiation (WO x H x e - HxWO) which converts WO into tungsten bronze (HxWO, 0 x 1), was observed in Mo-WO and WO 565758.Protons and electrons are inserted into the lattice of WO or Mo-WO and stabilized as Brnsted acidic OH groups and W 5 or Mo 5 sites, respectively, acting as active sites for the hydrogenation reaction 24,5960616263.Hence proton insertion process guaranteed the supply of required electrons and protons for the hydrogenation process of the activated CO2 to generate CH4.The water splitting and proton insertion process can be exhibited by the following reaction schemes (Scheme 1), which has been evidenced by Raman spectra (Fig. 7a and Fig. S9), 7b) and FTIR spectra (Fig. 6b).As shown in Fig. 7a, after the Mo-WO was irradiated by Xe-lamp under water vapor atmosphere, the new strong peaks appeared at 1135 and 1538 cm -1 , corresponding to the bending vibration of the W-OH and O-H in W-OH bond, which is due to the surface adsorbed water spitting and proton bonding with lattice atoms by proton insertion reaction 40,62.In Fig. 6b, the peak appearing at 1114 cm -1 after light irradiation is also assigned to the bending vibration of the W-OH, agreeing with the Raman spectra 41.Fig. 7b shows the evolution of (001) reflections after light irradiation.With proton insertion, the (001) peak moves to lower two-theta direction, suggesting an extended (001) lattice space with proton insertion, which coincides with previous reports 55,63. Obviously, the efficiency of proton generation and insertion for CO2 reduction plays a great role in promoting CH4 generation, which is usually limited by water oxidation step. Due to the reaction (H2O h H OH) could happen in aqueous solution by photocatalytic water oxidation through WO, the amount of OH is used to assess the water oxidation ability of catalysts 64.The photocatalytic activities toward water oxidation were evaluated in aqueous solution containing terephthalic acid (0.5 mM) as the OH scavenger.Fig. 8 Based on the above results, the photocatalytic CO2 reduction process over Mo-WO can be illustrated as Scheme 2. Generally, CO2 adsorption on the Mo-WO leads to the formation of a partially charged species CO2 -which is bended and activated on the surface.Meanwhile, water is dissociated into protons and hydroxyls followed by proton insertion and conduction in the lattice of Mo-WO.Subsequently, the photogenerated electrons coupled with the protons react with the activated CO2 -species.Mo doping highly boosts the transfer efficiency of electrons and protons to the reaction sites.As a result, the enhanced photocatalytic CO2 reduction to CH4 is achieved, while some CO is also generated in this process."
  },
  {
    "title": "Conclusions",
    "content": "In summary, Mo doped WO nanorods with diameter of 5-10 nm were synthesized by hydrothermal method.The 3Mo-WO nanorods realize photocatalytic CO2 reduction into CH4 with a rate of 5.3 mol gcat -1 h -1 under atmospheric CO2 concentration (about 400 ppm), which is about 5.2 times higher than that of pristine WO.The Mo doping in the WO nanorods improves the electrons storage and localization ability, enhancing photo-induced electron density in the active sites, which could highly boost the transfer of photoexcited electrons to adsorbed CO2, thereby facilitating CO2 activation and reduction.In addition, proton and electron insertion converts WO into tungsten bronze 001 is the preferential growth direction of WO along the c-axis.The sharp peaks indicate the as-synthesized product is well-crystallized.After doping WO with Mo ions, no new peak appears, indicating the homogeneous doping of Mo into the lattice of WO.Transmission electron microscopy (TEM) images for as-prepared WO and Mo-doped WO samples are shown in Fig. 1b and Fig. S1.WO has a rod-shaped morphology with diameters of 5-10 nm, as well as Mo doped WO.The HRTEM images of WO and A C C E P T E D M A N U S C R I P T 3Mo-WO are supplemented in Fig. 1c, d, in which the crystal lattice stripes are clearly demonstrated.The lattice spacing of 0.38 nm is assigned to the (001) planes of WO30.33H2O, which indicates that the WO nanorods grow in the 001 direction.This is in agreement with the XRD result that the hexagonal phase of WO30.33H2O has preferential c-orientation.After Mo doping, the lattice spacing hardly changed. range of 450-900 nm increases obviously, indicating the enhanced polaron-to-polaron transitions between two adjacent non-equivalent W or Mo sites through hopping.The enhanced polaron-to-polaron transitions may attribute to the developed low valence Mo 5 species in our samples which provide new sites for polaron hopping.The intrinsic UV-vis absorption edges of the WO, 1Mo-WO and 3Mo-WO (Fig.3b) are almost the same, indicating a similar intrinsic band gap of about 2.63 eV.However, we notice that excessive Mo doping (3 mol) induces a slight decrease of band gap (2.55 eV), which may be due to creating new defects in the samples. . As shown in Table release ability, the transient photocurrent of WO and Mo-WO after light irradiation for one hour are displayed in Fig. S8.The transient current of 3Mo-WO (Fig. shows the FL spectra for the generation of OH in an aqueous solution by photocatalytic water oxidation through WO or 3Mo-WO in 90 min.The peak intensity of FL indicated the concentration of OH radicals in the aqueous solution.Mo-WO displays a higher rate of OH evolution compared with WO, illustrating the property of Mo doping for boosting water oxidation.Furthermore, the enhanced water oxidation increases the efficiency of proton generation, and then promoting proton insertion and conduction to react with CO2 intermediate to generate CH4. HxWO), guaranteeing required electrons and protons for CO2 reduction.The enhanced water oxidation of Mo doped WO promotes proton supply and insertion process, improving the hydrogenation process of the carbon intermediate to generate CH4.The combined action of the enhanced CO2 activation and water oxidation with efficient proton and electron insertion improves the performance of CO2 photoreduction to CH4. Fig. 1 Fig. 1.(a) XRD patterns of WO, 1Mo-WO, 3Mo-WO and 5Mo-WO nanorods, (b) Fig. 2 Fig. 2. (a) Raman spectra of WO, 1Mo-WO, 3Mo-WO and 5Mo-WO nanorods, (b) Fig. 3 Fig. 3. (a) Ultraviolet-visible-near infrared (UV-vis-NIR) absorption spectra and (b) plots Fig. 4 Fig. 4. XPS spectra of W 4f (a), O 1s (b), and Mo 3d (c) for WO, 1Mo-WO, 3Mo- Fig. 5 Fig. 5.The yield (a) and selectivity (b) of photocatalytic CO2 reduction to CH4 in the first Fig. 6 Fig. 6.(a) CO2 TPD curves for WO and 3Mo-WO; (b) FTIR spectra at 1000-1600cm -1 Fig. 7 Fig. 7. (a) Raman spectra of 3Mo-WO before (black line) and after (red line) light Fig. 8 Fig. 8.The FL spectra for the generation of OH in an aqueous solution by photocatalytic This work provides a strategy for regulating active sites via a simple doping strategy to promote photocatalytic CO2 reduction. This work was financially supported by the National Natural Science Foundation of China (51772312, 51472260)."
  }
]