[
  {
    "title": "Doi",
    "content": "10.1039/b000000x/"
  },
  {
    "title": "Article_Title",
    "content": "Hexanuclear Cobalt Metal-Organic Framework for Efficient CO 2 Reduction under Visible Light"
  },
  {
    "title": "Abstract",
    "content": "Increasing global challenges including climate warming and energy shortage have stimulated worldwide explorations of efficient materials for applications in capture of CO2 and conversion it to chemicals.In this study, a novel pillared-layer porous metal-organic framework (Co6-MOF) with high nuclearity Co II clusters has been synthesized.This material exhibited CO2 adsorption capacity up to 55.24 cm 3 g -1 and 38.17 cm 3 g -1 at 273 K and 298 K, respectively.In a heterogeneous photocatalytic system of CO2 reduction, this material, cooperated with a ruthenium-based photosensitizer, can efficiently realize CO2 to CO conversion.Under visible-light irradiation for 3 hours, 39.36 mol CO and 28.13 mol H2 was obtained.This result is higher than most of reported MOF materials under similar condition and to the best of known, this is the first example of high nuclear MOF used in CO2 reduction.Rooted reasons behind the high reactivity were studied through theoretic calculation studies.Results showed electrons on reduced Ru(bpy)3Cl2 .6H2O (bpy 4,4'-bipyridine) could transfer to Co6-MOF and adsorbed CO2 molecule on charged Co6-MOF could be activated more facilely.This work not only clarifies the reasons for high efficiency in CO2 photoreduction system but also points out the direction for us in designing more effective MOF materials as photocatalysts for artificial CO2 photoreduction."
  },
  {
    "title": "Experimental",
    "content": "Co(CH3CHO)26H2O, NTB and 4,4'-bpy for the synthesis were purchased from Alfa, and they were used as received.Purity of all reagents was analytical grade. The C, H and N elemental analyses were performed on a Perkin-Elmer 2400 CHN elemental analyzer.The FT-IR spectra were examined in the range of 4000-400 cm -1 on a Mattson Alpha-Centauri spectrometer using KBr pellets.The UV-Vis absorption spectra were conducted on a Shimadzu UV-2550 spectrophotometer in the wavelength range of 200-800 nm.Powder X-ray diffraction (PXRD) patterns were collected with an Xray diffractometer of Rigaku, Rint 2000.Thermogravimetric analyses (TGA) were carried out on a Perkin-Elmer TG-7 analyzer heated from room temperature to 1000 C under nitrogen gas atmosphere at a heating rate of 5 C/min. A solid mixture of NTB (30.0 mg, 0.080 mmol), 4,4'-bpy (15.6 mg, 0.100 mmol), Co(CH3CHO)26H2O (37.4 mg, 0.150 mmol) was suspended in DEF (diethylformamide, 6 mL) in a 25 mL Teflon-lined stainless steel container.The mixture was heated at 120 C for 2 days resulting in redness crystals, which were washed and isolated using DMF.Subsequently, it was dried in air at room temperature. Single-crystal X-ray diffraction data for Co6-MOF were recorded by using a Bruker Apex CCD diffractometer with graphitemonochromated MoK radiation ( 0.71069 A) at 293 K. Absorption corrections were applied using multi-scan technique.All the structures were solved by Direct Method of SHELXS-2014 and refined by full-matrix least-squares techniques using the SHELXL-2014 program within WinGX.Non-hydrogen atoms were refined with anisotropic temperature parameters.CCDC 1533801 for Co6-MOF contains the supplementary crystallographic data for the work.These data can be obtained free of charge from the cambridge crystallographic data centre. The N2 and CO2 sorption measurements were performed on automatic volumetric adsorption equipment (Belsorp mini II).The solvent-removal assay has been employed before the gas adsorption measurements.The fresh as-synthesized samples were immersed in CH2Cl2 for 48 h, and then transferred these samples to CH3OH for 48 h to remove the DEF.Subsequently, the samples were gathered by decanting CH2Cl2 similarly to remove CH3OH.When the CH2Cl2 was removed by decanting, these samples were activated in a heated manner under a dynamic vacuum at 100 C for 24 h to form the activated samples.Before the gas adsorption test, the samples needed to be dried again by using the 'outgas' function of the surface area analyzer for 12 h at 150 C.After activation, the samples were tested for N2 and CO2 sorption measurements. Photocatalytic reactions were carried out in a quartz tube with a cap at 1 atm CO2 partial pressure.The reaction system contained Ru(bpy)3Cl2 .6H2O (0.01 mmol), Co6-MOF (0.005 mmol), acetonitrile (4 mL), H2O (1 mL), triethanolamine (TEOA 1 mL).After the solution was purified by CO2 for 10 min, it was beamed by a 150 W Xenon lamp at 420 780 nm in a carousel irradiation apparatus.The reaction temperature was maintained at 35 C by using a water bath.The result by PXRD can show that at the end of the reaction, the crystal keeps the original structure(Fig.S11).After the catalytic reaction completed, the gases (CO and H2) were tested and analyzed by GC instrument.To detect the formation of carbon monoxide from the reaction mixture, 500 L of the middle of the test tube was taken out by a syringe and injected into a GC with FID detector, using argon as carrier gas and reference gas.The volume of the carbon monoxide produced was calculated by comparing the integrated area of the signals of carbon monoxide with a calibration curve.The injector and detector temperatures were set to be 60 C.Retention times of hydrogen were 1.9 min.To detect the formation of hydrogen from the reaction mixture, 1000 L of the headspace of the test tube was taken out by a syringe and injected into a GC with TCD detector, using a 5A molecular sieve column and argon as carrier gas and reference gas.The volume of the hydrogen produced was calculated by comparing the integrated area of the signals of hydrogen with a calibration curve.The injector and Please do not adjust margins Please do not adjust margins detector temperatures were set to be 60 C.Retention times of hydrogen were 0.7 min.All the photocatalytic reactions were repeated five times to confirm the reliability of the data."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Co6-MOF was prepared through admixing 4,4'-bpy, NTB ligands and Co(CH3CHO)26H2O in DEF heated at 120 C for 2 days.The reaction produced violet crystals with polyhedral morphology.The structures of the Co6-MOF were confirmed by single X-ray crystallography.Single-crystal X-ray diffraction analysis reveals that the Co6-MOF crystallized in the hexagonal P63/mcm space group (Table S2).In the asymmetric unit, there are a half Co ion, one-sixth NTB ligands and one-fourth 4,4'-bpy ligands.The solvent DEF molecules in the channels are not crystallographically well defined.Six Co cations and six 3-OH groups construct Co6(3-OH)6 clusters serving as secondary building units (SBUs) in the structure.Each Co ion in the Co6(3-OH)6 clusters adopts six coordination connecting with one nitrogen atom of 4;4'-bpy ligand and five oxygen atoms provided by two carboxylates of different NTB ligands and three 3-OH groups (Fig. 1 (a)).Besides each 4,4'-bpy ligand binds to two Co atoms in two Co6(3-OH)6 SBUs through N atoms in 4,4'-position (Fig. S1).Each NTB ligand act as a 3-connecting nodes linked with three Co6(3-OH)6 SBUs forming two-dimensional layers (Fig. S2).The adjacent Co6(3-OH)6-NTB layers are further pillared by the bpy triangular prism (Fig. 1 with the dimensions of 11.31 12.56 A (a c or b c) (Fig. S4 (a)) and 8.89 8.89 A (a b) (Fig. S4 (b)).Topological analysis shows that the Co6(3-OH)6 SBUs can be regarded as 8-connected nodes, and the NTB ligand was defined as 3-connected nodes, so the architecture of the Co6-MOF can be reduced to a 3,8-connected tfzd (-UO3) type topology with the point symbol of (4 3 )2(4 6 .6 18 .8 4) (Fig. 1 (d)).Many MOFs with the tfz-d type topology have been reported. 3637738 In this type topology, 3-connected and 8-connected exist simultaneously, and they will form a double connected 3D structure.PLATON calculation shows that the effective pore volume of the Co6-MOF is about 63.9 (4682.8A 3 ) per unit cell (7324.9A 3 ), which is occupied by DEF molecules. The purity of the synthesized Co6-MOF was verified by high similarities between simulated and experimental powder X-ray diffraction (PXRD) patterns.In order to determine the possibility of practical application of Co6-MOF, we conducted the stability toward moisture.The XRPD patterns still keep the high similarities compared with simulated PXRD patterns after soaking in water for 24h.In addition, the acid resistance and alkali resistance of Co6-MOF were also investigated.Surprisingly, after placing it in a hydrochloric acid solution (pH 2) and sodium hydroxide solution (pH 12) for 24 h, it exhibits excellent acid and alkali resistance revealing from the similar shape and intensity of the PXRD (Fig. S6).Such high acid resistance and alkali resistance is quite rare in reported MOFs. 39Thermal stability of Co6-MOF is revealed through the TG curve.As shown in Fig. S7, an evident weight loss of 11.2 was observed in the step from 270 to 285 C, which may ascribe to the release of solvent molecules.After 285 C, the framework of Co6-MOF starts to decompose. To study the porosity and CO2 adsorption capability of Co6-MOF, we performed the N2 and CO2 adsorption experiments (Fig. 2).The samples were adequately activated by the method represented in experimental section.The PXRD of the activated sample showed similar peaks with the as-synthesized sample, indicating the maintenance of the framework. N2 adsorption of the activated Co6-MOF was carried out at 77 K.The adsorption isotherm of N2 unfolds a characteristic type I behavior with good reversibility for microporous solids.The Brunauer-Emmett-Teller (BET) and Langmuir surface areas are 1957.5 m 2 g -1 and 2257.1 m 2 g -1 , respectively, calculated by the N2 adsorption isotherms, and the total pore volume of the Co6-MOF is 0.87 cm 3 g -1 .The N2 adsorption amounts of the Co6-MOF at 1 bar is approximately 568.1 cm 3 g -1 , which is equivalent to 42.1 N2 per unit cell, lower than the theoretical pore volume calculated by PLATON based on the single crystal X-ray diffraction data.In order to prove that the Co6-MOF remains intact structure in water, we performed N2 sorption of the Co6-MOF which was soaked in water for 24h.Corresponding adsorption isotherm of this sample is presented in Fig. S9 and the result shows the BET of it is similar to activated sample indicating structure of Co6-MOF maintains well after soaked in water.This journal is The Royal Society of Chemistry 20xx Please do not adjust margins Please do not adjust margins The CO2 sorption behaviors for the Co6-MOF were measured at 273 K and 298 K, respectively and the sorption isotherms are shown in Fig. 2 (b).At 1 atm and 273 K, the Co6-MOF has CO2 uptakes at a saturation of 55.24 cm 3 g -1 , based on the total weight.And at 298 K, the CO2 uptakes decreased slightly, up to 38.17 cm 3 g -1 (Fig. 2 (b)).This capacity is comparable to classical MOF, Uio-66 and NH2-Uio-66 which were employed as catalyst for CO2 reduction. 40 The photocatalytic CO2 reduction system consists of Co6-MOF, Ru(bpy)3Cl2 .6H2O, and TEOA (triethanolamine).The solvent of the photocatalytic system filled with atmospheric CO2 is MeCN and H2O.After irradiation with visible light ( 420 nm) for 30 min, the reduction system generated CO (3.73 mol) and H2 (2.81 mol) gases.In this reduction process, CO2 was split into CO at a reaction rate of 0.13 mol min -1 , along with the evolution of H2 with a rate of 0.10 mol min -1 (Fig. 3).Trace CH3OH was detected in the solution.With reaction time increasing, the evolution amount of CO and H2 enhance consistently (Fig. 3).After 3 hours' irradiation, total amount of CO and H2 reaches 39.35 and 28.13 mol (entry 1, Table 1).This activity is much higher than that of many classical MOF materials for converting CO2 to CO listed in Table S1. 20,27 otochemical quantum yield of CO (CO) of Co6-MOF under irradiation of 420 nm light was calculated as 0.758 (The detailed calculation was given in supporting information).In order to determine the importance of the components in the photocatalytic CO2 reduction system, we provided a series of reference experiments and the results are summed up in Table 1.As we have seen, in total darkness, CO or H2 was undetectable in the photocatalytic system (entry 2, Table 1).When the system was short of Ru(bpy)3Cl2 .6H2O, no gases were detected in the reaction system (entry 3, Table 1).Replacing Ru(bpy)3Cl26H2O with Tris(2phenylpyridinato)iridium(III), CO gas wasn't detected in the reaction while only a trace amounts of H2 produced (entry 13, Table 1).These results mentioned above indicate the necessity of the energy band matching of photosensitizer and MOFs in the photocatalytic CO2 reduction reaction.This was further ascertained by the truth that no CO or H2 was detected when the photosensitizer didn't exist or the band mismatch of photosensitizer and MOFs. In the experimental study, we also explored the influence of the amount of Co6-MOF on the photocatalytic property in the system (Fig. 4).From this Figure, you can see that the yield of CO and H2 changed obviously when the added amount of Co6-MOF changed a little.The optima amount of Co6-MOF is 3 mg with a maximum value of both CO and H2.Overall, these results have been proved the major role of Co6-MOF by fastening CO2 acting as a CO2 redox promoter and absorber in photocatalytic reduction system.Fig. 4 The effect of the amount of Co6-MOF on the evolution of CO and H2 from the CO2 photoreduction system. In absence of Co6-MOF, the turnover number decreases 3.37, significantly lower than catalytic system containing Ru(bpy)3Cl2 .6H2O and Co6-MOF (entry 4, Table 1).To further confirm the role of the formation of MOFs as a co-catalyst in photocatalytic reaction system, we destroyed the Co6-MOF by calcination at 900C in N2 gas, and then the residues were applied in the reaction system to instead of Co6-MOF (entry 5, Table 1).The result showed that CO and H2 production decreased dramatically.This indicates the necessity of the complete framework structure of Co6-MOF in the CO2 splitting, possibly by the promotion of substrate concentration and carrier transfer.To further confirm the role of the formation of MOFs as a co-catalyst in photocatalytic reaction system, we measured the photocatalytic efficiency of physical mixtures including the Co 2 and ligand in a homogeneous system.We use 4,4'-bpy, NTB, and Co(CH3CHO)26H2O to replace Co6-MOF, and the result reflected that the physical mixture of them also plays the catalytic role in photocatalytic reaction system, but with lower TON than those with Co6-MOF (entry 6, Table 1).These results noted above confirmed that as a heterogeneous cocatalyst, the Co6-MOF effectively promotes the efficiency of photochemical reaction. In the experiment of photocatalytic reaction, the participation of CO2 was investigated by replacing CO2 with N2 (entry 7, Table 1).Once CO2 was replaced by N2, the evolution of CO was not observed, and only 2.37 mol H2 was detected under the same reaction conditions.It is noticeable that when there was no CO2 in the system, light-induced electrons just can promote H2 generation. In the course of the experiment, we found the reaction medium has a great influence to the catalytic effect of Co6-MOF on CO2 photocatalytic reduction reaction.There was no reaction occurred when only using H2O as the reaction medium which might due to the weak chemical affinity towards CO2 molecules (entry 10, Table 1).Meanwhile, MeCN and DMF was a favorable reaction medium for the CO2 reduction (entry 11 and entry 12, Table 1).They possessed nitrogen or oxygen atoms can interact with and solubilize CO2 via Lewis acid-base interactions. 41422 In addition, we replaced Co6-MOF with Co3O4-Uio-66, the turnover number decreases 3.87, significantly lower than original catalytic system(entry 14, Table 1 Fig.S13). In order to unambiguously determine the source of the C atom of CO, we conducted an isotopic tracing experiment by replacing CO2 by 13 CO2 under the same photocatalytic reaction conditions, and we used gas chromatography mass spectrometry to analysis the evolution of CO.After irradiation with visible light for 30 min, the peak at 1.99 min and m/z 29 was assigned to 13 CO (Fig. S12) and no sign at m/z 28 was detected.It turns out to be the case that Co6-MOF can indeed stimulate the deoxygenative reduction of CO2 into CO. The results above clearly demonstrate the effective role of Co6-MOF in the photocatalystic system.The next important target is to understand the root reason in such system.Inspired by Tang's work, 43 the highest occupied molecular orbital (HOMO) and the lowest unoccupied molecular orbital (LUMO) energy levels of Ru(bpy)3Cl2 photosensitizer and Co6-MOF is studied firstly.According to the reference, 43 the HOMO and LUMO of Ru(bpy)3Cl2 is -5.68 and -3.19 eV, respectively.Theoretic calculation is introduced to reveal the HOMO and LUMO of Co6-MOF.Calculation result shows the HOMO and LUMO of Co6-MOF is -6.22 and -4.56 eV (Fig. S14).Since the LUMO of the Co6-MOF is lower than the that of Ru(bpy)3Cl2, the electrons in the LUMO of Ru(bpy)3Cl2 can be transferred to the LUMO of Co6-MOF (Fig. 5).As described above, Co6-MOF has the capability of CO2 adsorption, the adsorption energy was investigated, as well.As density functional theory (DFT) calculation shown, adsorption energy of Co6-MOF in CO2 adsorption is 0.275 eV.Science the activation of CO2 molecule is usually triggered by two-electron charges. 44From first-principles simulations, we calculated the adsorption energy changes after Co6-MOF accepting one-or two electrons.The result shows when receiving one electron, the energy increases from 0.275 to 0.361 eV.When obtaining two electrons, the energy further enhances to 0.907 eV.What's more, we simulated the potential energy surfaces with the variation of O-C bond of CO2 adsorbed on Co6-MOF.From the simulation results, we can see that one-electron charge can hardly change the activation-energy barrier (EB) of CO2 while two-electron charge can effectively reduce the EB from 5.66 to 4.98 eV (Fig. 5 (c) Fig. S15).Therefore, upon receiving electrons from Ru(bpy)3Cl2 photosensitizer, Co6-MOF can turn into an active photocatalyst material for the CO2 activation and further facilitating CO2 reduction. On the basis of above results, a possible rooted reason for CO2 reduction in Co6-MOF participated system was proposed.Under irradiation, the photosensitizer Ru(bpy)3Cl2 is excited to the excited state.This excited state then quenched reductively by sacrificial electron donor, TEOA 40"
  },
  {
    "title": "Conclusions",
    "content": "In conclusion, based on highly symmetrical Co6(3-OH)6 cluster SBUs and organic ligands of NTB and 4,4'-bpy, a pillared-layer hexanuclear cobalt MOF, Co6-MOF, was obtained containing nanoporous structure.With this merit, Co6-MOF displays a satisfied amount of CO2 uptake, up to 55.24 cm 3 g -1 .Under irradiation with visible light, Co6-MOF can be used as stable co-catalyst coupled to an appropriate photosensitizer (Ru(bpy)3Cl2 .6H2O) realizing Please do not adjust margins Please do not adjust margins photocatalytic reduction of CO2 into CO.Around 39.36 mol CO and 28.13 mol H2 was produced after 3 hours irradiation.This result is higher than most of reported classic MOF materials under similar condition.To the best of known, this is the first example of high nuclear MOF used in CO2 reduction.Possible mechanism was proposed through theoretic calculation studies.The results showed that electrons on reduced Ru(bpy)3Cl2 .6H2O could transfer to Co6-MOF and the adsorbed CO2 molecule on charged Co6-MOF could be activated more facilely.Rooted reasons behind the high reactivity were revealed through theoretic calculation studies which showed electrons on reduced Ru(bpy)3Cl2 .6H2O could transfer to Co6-MOF and the adsorbed CO2 molecule on charged Co6-MOF could be activated more facilely.This work not only clarifies the reasons for the high efficiency in the CO2 photoreduction system but also points out the direction for us in designing more effective MOF materials as photocatalysis for artificial photochemical CO2 reduction. Fig. 1 (a) The coordination environment of Co6(3-OH)6 SBUs.(b) and (c) Ball-and-stick model of the carbon nanotubes channel along thea b and a c or b c direction.(d) Topological nets of the Co6-MOF.All hydrogen atoms and solvent molecules have been omitted for clarity.Color coding: Co: Violet; C: gray; O: red; N: Sky blue. Fig. 2 (a) N2 sorption isotherms of the Co6-MOF; (b) CO2 sorption isotherms of the Co6-MOF. Fig.3 The effect of the time of reaction on the evolution of CO and H2 from the CO2 photoreduction system. Fig. 5 (a) Proposed mechanism for the photosensitized catalytic reduction of CO2 to CO.(b) Schematic energy-level diagram showing electron transfer from Ru(bpy)3Cl2 to Co6-MOF.(c) Potential energy surfaces along the O-C bond length for the activation of the CO2 molecule adsorbed on Co6-MOF in the neutral state or the states charged with one or two electrons, from which the EB of CO2 were deducted. (Fig.5 (a)) and formed a reduced photosensitizer.Then the electrons in the reduced photosensitizer transferred to Co6-MOF.The adsorbed CO2 molecule on Co6-MOF was activated after Co6-MOF obtaining electrons.In the end, CO2 is reduced to CO and released from Co6-MOF. The research of reaction conditions a) 6 J. Name., 2012, 00, 1-3 This journal is The Royal Society of Chemistry 20xx Please do not adjust margins Please do not adjust margins This work was financially supported by the NSFC of China (No. 21601032, 21671034, 21471027), National Key Basic Research Program of China (No. 2013CB834802), the Fundamental Research Funds for the Central Universities (2412016KJ021), Changbai Mountain Scholars of Jilin Province, Foundation of Jilin Educational Committee (No. 2016498).These authors contributed equally to this work."
  }
]