[
  {
    "title": "Doi",
    "content": "10.1007/s11771-014-2248-1"
  },
  {
    "title": "Article_Title",
    "content": "Facile synthesis of Zn2GeO4 nanorods toward improved photocatalytic reduction of CO2 into renewable hydrocarbon fuel"
  },
  {
    "title": "Abstract",
    "content": "Zn 2 GeO 4 nanorods were prepared by a surfactant-assisted solution phase route.The as-prepared products were characterized by X-ray powder diffraction (XRD), scanning electron microscopy (SEM), high-resolution transmission electron microscopy (HRTEM), inductively coupled plasma atomic emission spectrometer (ICP-AES), UV-vis diffuse reflection spectroscopy and photoluminescence (PL) spectroscopy.The possible formation mechanism of Zn 2 GeO 4 nanorods was discussed.It was supposed that the CTA cations preferentially adsorb on the planes of Zn 2 GeO 4 nanorods, leading to preferential growth along the c-axis to form the Zn 2 GeO 4 rods with larger aspect ratio and higher surface area, which showed the improved photocatalytic activity for photoreduction of CO 2 .The photoluminescence (PL) property of Zn 2 GeO 4 nanorods was investigated through the emission spectra."
  },
  {
    "title": "Experimental",
    "content": "For the dispersion of RuO 2 particles as a cocatalyst on Zn 2 GeO 4 , 0.25 g Zn 2 GeO 4 photocatalyst powder was impregnated with ruthenium carbonyl complex, Ru 3 (CO) 12 (Aldrich Chemical Co., 99 pure), in THF and oxidized at 350 C in air for 4 h to convert the Ru complex species to RuO 2 particles.RuO 2 was loaded at the rate of 1 (mass fraction) for these as-prepared Zn 2 GeO 4 . In the photocatalytic reduction of CO 2 , Zn 2 GeO 4 powder (0.1 g) was uniformly dispersed on a glass reactor with an area of 4.2 cm 2 .A 300 W Xenon arc lamp was used as the light source for the photocatalytic reaction.The volume of the reaction system was about 230 mL.The reaction setup was vacuum-treated several times, and then high-purity CO 2 gas was introduced into the reaction to achieve ambient pressure.Deionized water (0.4 mL) was injected into the reaction system as reducing reagent.During the irradiation, about 1 mL of gas was taken from the reaction cell at given intervals for subsequent CH 4 or CO concentration analysis with a gas chromatograph (GC-2014, Shimadzu Corp., Japan).The TEM image shows that rod-shaped nanostructures have been successfully prepared by this solution route in a large scale (see Fig. 2(a)).The nanorods have regular hexagonal prism geometric shape (see Fig. 2(b)).The nanorods obtained by adding 0.1 g CTAB (100 nm length and 20 nm width) have the aspect ratio of 5:1.As demonstrated by BET measurements, the specific surface area was increased from 0.91 m 2 /g for the SSR-Zn 2 GeO 4 to 47.62 m 2 /g for Zn 2 GeO 4 nanorods due to the nanostructures.The HRTEM images of the nanorods are shown in Figs. 2 (c) and (d).The lattice fringe of (110) with an interplanar spacing of 0.712 nm is observed parallel to the rod direction (see Fig. 2(c)).Another lattice fringe of (113) with an interplanar spacing of 0.290 nm is observed at an angle of 66 to the rod direction (see Fig. 2(d)).Therefore, the nanorods grow in the direction of the c-axis of the rhombohedral phenacite-type structure.Selected area electron diffraction (SAED) patterns for a whole hexagonal prism (see Fig. 2(c), inset) show that the nanorods are single crystalline."
  },
  {
    "title": "Results_and_Discussion",
    "content": "To explore the function of CTAB in the synthesis of Zn 2 GeO 4 nanorods, the experiments by adding different contents of CTAB with other conditions unchanged are performed and the products are characterized by SEM.The SEM images of the Zn 2 GeO 4 nanorods obtained by adding 0, 0.02 and 0.05 g CTAB are shown in Fig. 3. From the SEM images at different magnifications, the diameter of Zn 2 GeO 4 nanorods changes from ca. 80 nm (without using CTAB), 60 nm (using 0.02 g CTAB) to 40 nm (using 0.05 g CTAB).With the increase of the content of CTAB, the diameter of Zn 2 GeO 4 nanorods decreases and the aspect ratio of the nanorods increases from 2.5:1 to 3.75:1.Based on the experimental results, we believe that the surfactant CTAB is crucial in the diameter and aspect ratio of Zn 2 GeO 4 nanorods because they are modulated only by varying the content of CTAB with other experimental conditions unchanged.As known, in the preparation of nanomaterials, CTAB is often used as a \"capping reagent\" since it may adsorb on solid surfaces and selectively bind to some specific panels and thus to control the velocity and direction of crystal growth 21.The crystal growth in the direction of the c-axis probably resulted from the crystallographic feature of phenacite structure 20.The phenacite Zn 2 GeO 4 has internal hexagonal hollow tubes and directional polymerization axes of ZnO 4 and GeO 4 tetrahedra in the direction of the c-axis.Therefore, this structure tends to grow through connecting GeO 4 and ZnO 4 tetrahedra in the direction of the c-axis 20.In our case, the CTA cations preferentially adsorb on the special planes of tiny Zn 2 GeO 4 particles 7, leading to preferential growth along a certain direction and thus decreasing the diameter and increasing the aspect ratio of Zn 2 GeO 4 nanorods. The diffuse reflectance spectrum of the Zn 2 GeO 4 samples is shown in Fig. 4. The light absorption edges of Zn 2 GeO 4 nanorods exhibit blue shift remarkably compared with the SSR-Zn 2 GeO 4 , which may be attributed to the size effect.The band gap of Zn 2 GeO 4 nanorods obtained with adding CTAB or no CTAB and the SSR-Zn 2 GeO 4 is estimated from the absorption edge to be 4.66, 4.64 and 4.50 eV, respectively.In addition, photoreduction of CO 2 on the as-prepared Zn 2 GeO 4 samples are performed.Figure 5 shows that CO 2 can be photoreduced to CH 4 in the presence of water vapor by using the above-mentioned Zn 2 GeO 4 samples as photocatalysts.The mechanism of photoreduction of CO 2 into CH 4 can be described as follows: under UV-vis light irradiation, the photogenerated hole on the valence band top (potential: 2.86 V vs NHE) 22 of Zn 2 GeO 4 can lead to oxidation of water to produce hydrogen ions via H 2 O1/2O 2 2H 2e -(E o redox 0.82 V vs NHE), 12 and the photogenerated electron on the conduction band bottom (potential: -0.29 V vs NHE) of Zn 2 GeO 4 can drive the reduction of CO 2 into CH 4 via CO 2 8e -8H CH 4 H 2 O (E o redox -0.24V vs NHE) 23.From Fig. 5, it is obvious that Zn 2 GeO 4 nanorods obtained by adding 0.1 g CTAB (7.6210 -6 h -1 CH 4 ) exhibit higher activity than Zn 2 GeO 4 nanorods obtained without adding CTAB (5.3310 -6 h -1 CH 4 ) and SSR-Zn 2 GeO 4 (2.85 10 -6 h -1 CH 4 ).The Zn 2 GeO 4 nanorods exhibit the better photoreduction performance, which is attributed to the higher specific surface area (47.62 m 2 /g) than those of Zn 2 GeO 4 (23.16m 2 /g) and SSR-Zn 2 GeO 4 (0.91 m 2 /g) and also dominant (110) crystal face maybe induce the strong CO 2 gas adsorption 20. The PL properties of the Zn 2 GeO 4 nanorods prepared with adding CTAB or no CTAB and Zn 2 GeO 4 bulks prepared at 1300 C were investigated and the results are shown in Fig. 6.The main blue-green emission band ranging from 350 to 650 nm for the three samples was observed.Obviously, the PL intensity of Zn 2 GeO 4 bulks is much higher than that of Zn 2 GeO 4 nanorods.This emission was ascribed to the donoracceptor recombination, where oxygen vacancy and Zn interstitial were donors, while Ge vacancy and Zn vacancy served as acceptors 4.The Zn/Ge ratio in these as-prepared samples was analyzed by ICP to be 1.99 for nanorod, which is higher than 1.97 for the Zn 2 GeO 4 bulk, indicating that many defects existed in the Zn 2 GeO 4 bulk due to the Zn volatilization at high temperature.Therefore, the low PL intensity for Zn 2 GeO 4 nanorods suggests that those samples have the less crystal defects due to the mild synthetic conditions.The PL results indicate that the recombination of photogenerated electrons and holes was inhibited in the Zn 2 GeO 4 nanorods semiconductors, which conforms to the discussion about the separation of charge carriers and photocatalytic experiments.2) The synthesis mechanism is discussed and it is supposed that the CTA cations preferentially adsorb on the special planes of tiny Zn 2 GeO 4 particles, leading to preferential growth along a certain direction and thus decreasing the diameter of Zn 2 GeO 4 nanorods. 3) The high photocatalytic activity can be attributed to the less crystal defects and high specific surface area. Figure1shows the XRD pattern of the as-synthesized Zn 2 GeO 4 products.The XRD pattern of bulk Zn 2 GeO 4 crystals is also shown for comparison.All of the diffraction peaks for both Zn 2 GeO 4 nanorods and bulk Zn 2 GeO 4 samples can be assigned to the rhombohedral phase of Zn 2 GeO 4 (JCPDS no.11-0687), with lattice constants of ab1.4231nm and c0.953 nm A, 90 and 120.There is no trace of impurity phase under the instrument's resolution.Note that the XRD peaks of the Zn 2 GeO 4 nanorods are broader than the corresponding peaks of the bulk Zn 2 GeO 4 crystals, reflecting the nanostructural nature of the former. Fig. 1 XRD patterns of Zn 2 GeO 4 obtained by solution phase route with 0 g CTAB (a), with 0.1 g CTAB (b) and SSR-Zn 2 GeO 4 (c) Fig. 2 TEM images of Zn 2 GeO 4 obtained by solution phase route with 0.1 g CTAB (a), (b), HRTEM image of crystal lattice (c), (d) and selected area electron diffraction (SAED) patterns (inset of c) Fig. 5 CH 4 generation over Zn 2 GeO 4 obtained by solution phase route with 0.1 g CTAB (a), with 0 g CTAB (b) and SSR-Zn 2 GeO 4 (c)"
  },
  {
    "title": "Conclusions",
    "content": "Fig. 6 Room temperature PL spectra of SSR-Zn 2 GeO 4 (a) and Zn 2 GeO 4 obtained by solution phase route with 0 g CTAB (b), or 0.1 g CTAB (c) with UV fluorescent light excitation of 264 nm 4 Conclusions 1) By a facile solution phase route, the Zn 2 GeO 4 nanorods are prepared by using CTAB as capping reagent, which exhibit the improved photocatalytic performance in photoreduction of CO 2 . Foundation item: Project(51208102) supported by the National Natural Science Foundation of China"
  }
]