[
  {
    "title": "Doi",
    "content": "10.1021/ef9003957"
  },
  {
    "title": "Article_Title",
    "content": "Quantum Mechanical Modeling of CO<sub>2</sub>Interactions with Irradiated Stoichiometric and Oxygen-Deficient Anatase TiO<sub>2</sub>Surfaces: Implications for the Photocatalytic Reduction of CO<sub>2</sub>"
  },
  {
    "title": "Abstract",
    "content": "The conversion of CO 2 using light energy (CO 2 photoreduction) has the potential to produce useful fuels or valuable chemicals while decreasing CO 2 emissions from the use of fossil fuels.Identifying the mechanism and the active sites involved in the formation of negatively charged CO 2 species on TiO 2 surfaces represents a significant advance in our understanding of CO 2 photoreduction.To understand the role of the TiO 2 surface acting as a photocatalyst mediating CO 2 photocatalytic reduction, excited-state ab initio calculations of CO 2 adsorbed on clusters from the ( 010), ( 101), and (001) anatase surface planes were performed.Both post-Hartree-Fock calculations on small model surface clusters as well as density-functional theory (DFT) calculations on larger clusters indicate that conduction band electrons in irradiated, stoichiometric TiO 2 surfaces may not be transferred to CO 2 .On the other hand, oxygen vacancies may act as the active sites for CO 2 photoreduction."
  },
  {
    "title": "Experimental",
    "content": "In this study, neutral TiO 2 -CO 2 clusters obtained from unreconstructed, stoichiometric surfaces are referred to as being defect-free.Two computational tools were used to model excited states of these TiO 2 -CO 2 clusters: Gaussian 03 (G03) 17 and Turbomole V5.9. 18Single-point post-Hartree-Fock (post-HF) symmetry-adapted cluster-configuration interaction (SAC-CI) 19 calculations were performed on relatively small clusters containing one or two Ti atoms in G03.The clusters modeled in G03 are the following: Ti 2 O 9 H 10 -CO 2 (denoted as Ti 2 -CO 2 ), Ti-(OH) 4 H 2 O-CO 2 (Ti-watCO 2 ), and Ti(OH) 4 -CO 2 (Ti-4cCO 2 )).DFT level calculations on larger TiO 2 -CO 2 clusters (Ti 6 O 21 H 18 -CO 2 , denoted as Ti 6 -5cCO 2 ) from the (101), (001), and (010) surfaces and the (110) Ti 6 cluster (Ti 6 O 22 H 20 , Ti 6 -4c) of anatase TiO 2 were performed in Turbomole. One limitation of the cluster-based approach used in this study is the discrepancies in band gap (or the difference in the energy levels of the HOMO and the LUMO) between the model clusters and bulk TiO 2 surfaces.However, our previous results suggest that localized processes (such as adsorption) on titania surfaces could be treated using small clusters. 20In addition, de Lara-Castells and Krause 21 used small cluster models of defective TiO 2 surfaces to study the photodesorption of molecular oxygen using post-Hartree-Fock (HF) calculations.Therefore, there is precedence for using small cluster models of TiO 2 surfaces to study photoinduced processes using post-HF calculations.Adsorption of anionic species on oxide surfaces is also well-described by hydrogen-saturated cluster models. 22Cluster calculations of anion adsorption yielded results in agreement with periodic DFT calculations. 23An alternative technique to model the surface involves the use of embedded point charges instead of the hydrogen atoms.However, as pointed out by Belelli et al., 24 the use of embedded charges leads to varying charges for equivalent atoms in the lattice.In the case of small molecules such as CO 2 , long-range electrostatic effects are therefore expected to play a minor role in controlling adsorption.On the other hand, to accurately model the band gap of TiO 2 , larger clusters are required.We note that slightly larger Ti 7 O 14 clusters have been used to model the photocatalytic oxidation of water on rutile (110) TiO 2 surface. 25Ultimately, considering the computational costs, we used clusters comprised of 1-2 Ti atoms for SAC-CI calculations and 6-Ti atom clusters for DFT calculations. In addition to stoichiometric TiO 2 clusters, nonstoichiometric clusters containing a bridging oxygen vacancy were also studied because previous experimental results indicated that the presence of oxygen defects promoted the adsorption of CO 2 as bent-CO 2 species. 12,26,27Although the oxygen-deficient anatase clusters are more reactive (less stable) compared to a stoichiometric TiO 2 cluster, this does not preclude us from comparing the stoichiometric and oxygen-deficient clusters because real, polycrystalline TiO 2 surfaces do contain a finite amount of defects.Additionally, using periodic DFT calculations, Bonapasta and Filippone concluded that bridging oxygen vacancies on the anatase (100) surface promoted the photoreduction of oxygen. 28Therefore, as a first step toward examining the photoinduced reactivity of CO 2 on reduced TiO 2 surfaces, we also investigated the adsorption of CO 2 on both singlet and triplet reduced model clusters. A detailed description of the parameters used and the cluster preparation procedures for the SAC-CI and DFT calculations is provided in the following section. a. Details of Cluster Preparation and Parameters Used for SAC-CI Calculations in G03.Clusters of various sizes were cut from the (001), (010), and (110) surface planes of anatase using the Cerius 2 software suite (Accelrys Inc., San Diego, CA).The coordination of the dangling bonds was saturated by adding protons at the same location as the missing Ti atom.All O-H bond distances were initialized to 0.97 A . (Full geometry optimizations of a Ti(OH) 4 CO 2 cluster at the B3LYP/6-31G-(d) level resulted in a O-H bond length of 0.967 A ). TiO 2 -CO 2 clusters from the (001) and (110) surface planes containing a single Ti atom were obtained by minimizing the geometry of a cluster having a CO 2 molecule located over the Ti atom.Only Ti, O, and CO 2 atoms in the Ti-watCO2 and Ti-4cCO2 clusters were allowed to relax.This resulted in linearly adsorbed CO 2 species.The anatase (110) surface was exposed 4-c Ti and 2-c oxygen atoms, whereas the anatase (001) surface exposes 5-c Ti atoms and 2-c and 3-c O atoms. 29Additionally, 4-c Ti atoms at the interface between anatase and rutile phases have been proposed to act as electron traps in Degussa P-25. 30,31Therefore, comparing excited state calculations from these two clusters will provide insights into the role of surface coordination on electron transfer to linear CO 2 species. Excited states of carbonate-like species adsorbed on (010) anatase surface plane (modeled using Ti 2 -CO 2 clusters) were also calculated.Details of methods used to model the ground state of the Ti 2 O 9 H 10 -CO 2 are given in a previous publication. 20The ground states of these clusters were modeled using Becke's 3-parameter hybrid method 32 with the LYP correlation functional 33 (B3LYP), and the 6-31G(d) basis set (as implemented in G03) with default optimization criteria. For the excited state calculations, the SAC-CI method was chosen to overcome size limitations of the active space and to avoid pitfalls in selecting chemically relevant orbitals.SAC calculations on the ground-state singlet cluster indicate that it can be well described using single determinant wave functions.Therefore, the B3LYP/6-31G(d) ground-state geometry could be used as a starting point for single-point excited-state post-HF calculations.Excited-state calculations used the SD-R version of SAC-CI (with singles and doubles linked excitation operators).The following paragraphs describe the parameters and methods used for excited-state population analysis for clusters containing one and two Ti atoms. In the case of clusters containing one Ti atom, excited-state calculations were performed without frozen core orbitals.The maximum R2 operators after perturbation selection (MaxR2Op) were set to 10 6 .Atomic charges (to be used as one indicator of CO 2 reduction) from the single-point excitedstate calculations were calculated using relaxed density natural population analyses (using the NBO program 34 included in G03).It should be noted that the \"relaxed density\" corresponds to a one-particle density matrix consisting of an HF-contribution with a correlation correction, and does not refer to excited state orbitals.In this study, SAC-CI calculations were performed at the lowest threshold for the selection of double excitation operators.Single-point SAC-CI calculations for the first four excited-states were performed for both (001) Ti-watCO 2 and (110) Ti-4cCO 2 clusters, using the above criteria.The amount of charge gained by the CO 2 moiety in an excited Indrakanti et al. state, compared to the SAC ground state, was calculated as where qCO 2 refers to the change in charge of CO 2 compared to the SAC ground state and q(O cluster ) refers to the change in the charge of all the oxygen atoms of the cluster.Excited-state calculations with two Ti atoms (Ti 2 -CO 2 ) used 30 frozen core orbitals.It was not possible to calculate relaxed density excited-state natural population analyses for the Ti 2 -CO 2 clusters.Instead, unrelaxed excited-state Mulliken population analyses 35 for the first four excited states are reported.Other parameters were the same as those for the Ti-watCO 2 and Ti-4cCO 2 clusters described above.We also compared the SAC-CI excitation energies and oscillator strengths to those obtained from time-dependent density functional theory (TD-DFT) 36 calculations at the B3LYP/6-31G(d) level to examine the possibility of using these computationally more efficient methods to model TiO 2 -catalyzed CO 2 photoreduction. b. Details of Cluster Preparation and Parameters Used for DFT Calculations in Turbomole.To complement these SAC-CI calculations on small TiO 2 -CO 2 clusters, we also performed DFT level calculations on larger TiO 2 -CO 2 clusters (Ti 6 -5cCO 2 ) using Turbomole.Similar to the smaller clusters, larger (Ti 6 ) clusters from bulk-terminated (101), ( 010), (001), and (110) surfaces were cut with Cerius 2 , and the coordination of dangling bonds was saturated by adding protons at O-H distances of 0.97 A .All Ti atoms in the clusters thus prepared have the same coordination as that of the defect-free surface.All added H atoms were fixed during geometry optimizations in Turbomole.In addition to CO 2 , only surface atoms and their next nearest neighbors were allowed to relax.This meant that different numbers of atoms were constrained for different surfaces. The geometry of the ground-state neutral singlet bare cluster (without CO 2 ) was optimized with B3LYP/def2-SV(P) model chemistry using default optimization criteria.(The def2-SV(P) basis set 37 is approximately equivalent to the Pople 6-31G(d) basis set.The implementation of the B3-LYP functional (incorporating the VWN(V) correlation) in Turbomole differs from that in the G03 (VWN(III) correlation).Henceforth, in this paper, TM-B3LYP denotes the Turbomole implementation, while G03-B3LYP will be used to refer to the G03 implementation.All Turbomole calculations used the multipole-accelerated-resolution-of-identity-J (MARI-J) approximation 38 with the def2-SV(P) auxiliary basis set on Ti, O, and C atoms.The error in single-point self-consistent-field (SCF) energy with the MARI-J approximation for a TiO 2 cluster containing 47 atoms was calculated at the TM-B3LYP/def2-SV(P) level of theory to be 1.2 mH. Upon optimizing the ground-state, similar constraints were used to model the triplet state of the cluster.Subsequently, a CO 2 molecule (with r(C-O)1.167A and OCO180) was located at a distance of 2.2-1.9A from the Ti atom where the photogenerated electron was localized.A similar procedure has been reported in the literature for a study of O 2 and H 2 O interactions on irradiated TiO 2 . 24Geometry optimization of the triplet Ti 6 -CO 2 clusters was performed using constraints and model chemistry similar to that as the \"bare\" cluster.Atomic charges were calculated using natural population analysis (NPA) 34 for singlet and triplet states of the bare and CO 2containing clusters. The adsorption of CO 2 on nonstoichiometric anatase surfaces containing oxygen vacancies was also performed to compare the results with those from defect-free clusters.An earlier modeling study of O 2 photoreduction on surface oxygen vacancies has shown that O 2 -species could be formed on and desorbed from illuminated defective (100) anatase TiO 2 surfaces. 28Therefore, CO 2 adsorption on a bridging oxygen vacancy on the (010) surface (isostructural with the anatase (100) surface) was investigated.After removing one of the bridging 2-coordinate (2-c) oxygens on the (010) surface, the ground state geometry (triplet) was optimized, with constraints similar to the defectfree Ti 6 -cluster.Two different configurations of CO 2 adsorbed on the vacancy were modeled, resulting in linear and bent CO 2 species.The geometry ground-state neutral singlet cluster was optimized at the TM-B3LYP/def2-SV(P) level of theory.The optimized Ti 6 -cluster with CO 2 adsorbed on the oxygen vacancy (Ti 6 O 20 H 18 -CO 2 ) is denoted as (010) Ti 6 (Vo)-5cCO 2 -linear and (010) Ti 6 (Vo)-5cCO 2 -bent.Counterpoise uncorrected binding energies between the Ti 6 -stoichiometric cluster and CO 2 in both singlet and triplet states are given as Binding energies for nonstoichiometric clusters and CO 2 are calculated as In the above equations, E refers to the electronic energy of the cluster.Reasonable values for the basis set superposition error (BSSE) in the energies for the triplet state clusters could not be obtained.The BSSE values for the singlet state clusters were typically 8-13 mH.For the sake of uniformity, we present energies without the counterpoise correction. The gOpenMol program 1,2 (v3.0) was used to display molecular orbitals and spin densities.The ChemCraft program (Plimus Corporation, San Diego, CA) was used to display cluster geometries. The optimized geometries of the (110) Ti-4cCO 2 and (001) Ti-watCO 2 clusters are shown in Figure 2. CO 2 adsorbs linearly at the Ti Lewis acid sites.The O-C-O bond angle of CO 2 is not significantly distorted from its gas-phase value of 180, which indicates that the electronic interaction between the unoccupied orbitals of CO 2 and the occupied orbitals of the \"bare\" cluster in the ground state is weak. Excitation energies and symmetries of the first four excited states of these two clusters, calculated from single-point calculations at the SAC-CI/6-31G(d) level of theory are shown in Table 1.These vertical excitation energies lie in the (UV-B)-(UV-C) region of the spectrum.Additionally, the excitation energies for the (4-c) Ti-4cCO 2 cluster are significantly higher than the (5-c) Ti-watCO 2 cluster.This is consistent with the trends in the ligand-to-metal charge transfer (LMCT) transition energies for tetrahedral (4-c) and octahedral (6-c) Ti atoms. 39n the next step, excited states of a cluster ((010) Ti2-CO 2 ) with significant electronic interaction between the bare a The excitation energies predicted by TD-DFT calculations are within 0.5 eV of those from SAC-CI calculations.However, TD-DFT calculations neither predict correct oscillator strengths nor correct excited-state symmetries, making TD-DFT qualitatively incorrect.Ti 6 -5cCO 2 cluster, (c) (001) Ti 6 -5cCO 2 cluster, (d) Ti 6 -4c cluster without CO 2 .The difference in spin densities (alpha-beta) is plotted at a isocontour value of 0.03 e/A 3.In parts a-c, the photogenerated electrons are localized on the 3d orbitals of the Ti atoms and are not transferred to CO 2 .In part d, the photogenerated electrons on the (110) surface are not available to surface Ti atoms and are localized on (6-coordinate) Ti atoms in the bulk.Therefore, CO 2 adsorption and further electron transfer on this surface was not investigated (plotted with the gOpenMol visualization program 1,2 ).cluster and CO 2 (in the ground-state) were studied.This represented carbonate-like species adsorbed on the (010) surface plane of anatase.Comparisons of the SAC-CI/6-31G(d) adiabatic excitation energies for the (010) Ti 2 -CO 2 cluster (shown in Figure 3) with those obtained from TD-DFT calculations at the G03-B3LYP/6-31G(d) level are shown in Table 2. Clearly, TD-DFT excitation energies are within 0.5 eV of those obtained with SAC-CI.Therefore, although significant errors exist in TD-DFT values, TD-DFT could be used to estimate the trends in vertical excitation energies for larger clusters.However, the oscillator strengths predicted by the less expensive TD-DFT calculations do not agree with those from SAC-CI calculations.Moreover, the excited state symmetries predicted by TD-DFT do not agree with those predicted by SAC-CI.Therefore, even qualitative comparisons of TD-DFT absorption spectra with experimental spectra will be complicated by the fact that the oscillator strengths are inaccurate.This indicates the need for post-HF methods rather than TD-DFT to study excited states of chemisorbed carbonatelike species. The percentage of charge transferred from the oxygen atoms of the cluster to the CO 2 moiety in the Ti-watCO 2 and Ti-4cCO 2 clusters is shown in Figure 4. Figure 5 shows the change in the charge (from unrelaxed Mulliken population analyses of the excited-states) of various moieties (CO 2 , CO 2 O bridging (referred to as CO 3 ), and Ti 2 O 9 H 10 ) of the Ti 2 -CO 2 cluster.In Figure 5, the results are shown as the difference of the charge of the moiety between the SAC ground state and the excited state.In addition to these criteria, charge transfer to CO 2 can be indicated by examining the excited states and the type of (canonical) molecular orbitals comprising various configurations of the wave function.From the analysis of the ground-state molecular orbitals of the linear CO 2 species (Ti-watCO 2 , Ti-4cCO 2 ) (involved in various excited state configurations) (presented in the Supporting Information), it is clear that the majority of the contribution to the unoccupied orbitals comes from the Ti 3d atomic orbitals and not C-O orbitals of CO 2 .Therefore, most of the charge transferred from the oxygen atoms is localized on the Ti atoms.These SAC-CI results indicate that the amount of charge transfer from the bare cluster to CO 2 is insignificant compared to the charge gained by Ti atoms, for both linearly adsorbed CO 2 as well as carbonate-like chemisorbed species. The results in Figure 4 indicate a large discrepancy between Mulliken and natural population analyses for the Ti-watCO 2 cluster.Mulliken population analyses are not independent of the basis set and the method used for the calculations.In contrast, atomic charges obtained by NPA analysis are known to vary less with the choice of the basis set.NPA analysis is therefore a better indicator of the real charge of the species in various excited states. In the next part of this study, we modeled the adsorption of CO 2 on triplet (Ti 6 ) clusters from various surface planes.Various starting configurations were used for the interaction of CO 2 with the electron-center (Ti 3 ), and the lowest energy configurations are shown in Figure 6.More details, including the local geometry around the Ti atom interacting with the CO 2 species are shown in Figure 7.The overall nature of CO 2 adsorption on triplet Ti 6 clusters modeled using Turbomole is similar to that observed with the smaller ground-state clusters modeled in G03.The interaction is mainly weak acid-base in character.On the (010) and ( 101) triplet Ti 6 -5c clusters, CO 2 adsorbs with the oxygen end-on Ti atom.In the case of the triplet (001) Ti 6 -5c cluster, one of the (Ti-2c O) bonds is broken (shown in Figure 7) and CO 2 is more loosely bound.We also observed the formation of carbonate species on the (001) TiO 2 surface.However, electron transfer was not predicted for these carbonate species to or from the TiO 2 surface in the triplet state.The difference between the alpha and beta spin densities of the triplet (010), (101), and (001) Ti 6 -5cCO 2 clusters, shown in Figure 6 indicates that the photogenerated electron is not transferred to CO 2 . In the limit of the cluster sizes used in this study, we find that photogenerated electrons are available for surface reactions on (010), (001), and (101) surfaces (Figure 7a-c).The photogenerated electrons are localized on the terrace 5-c Ti atoms of the (101) surface.On the (110) surface exposing 4-c Ti atoms, the photogenerated electron and hole were localized in the bulk.Therefore, CO 2 adsorption on this surface in the triplet state was not modeled. Both SAC-CI and DFT calculations have shown that clusters from defect-free anatase TiO 2 surfaces do not transfer the photogenerated electron to CO 2 .Because oxygen vacancies are among the most common defects on metal oxide surfaces, CO 2 adsorption on oxygen-deficient clusters was modeled.The ground-state of the (010) oxygen-deficient bare anatase cluster (Ti 6 (Vo)-5c) is a triplet.However, upon CO 2 adsorption, the ground-state of the (010) Ti 6 (Vo)-5cCO 2 cluster was found to be a singlet.As shown in Figure 8, CO 2 adsorbs on the oxygen vacancy, forming a negatively charged CO 2 -species, which resembles a CO 2 -(metal-CO 2 ) complex. 40Additionally, linear CO 2 adsorbed on the Ti 3 electron centers (formed as a result of the oxygen vacancy formation) (Figure 9) were also modeled.Triplet states of the oxygendeficient CO 2 -TiO 2 clusters were also studied. The charges on the CO 2 moieties from DFT level calculations on oxygen-deficient and defect-free clusters are shown in Figure 10.Counterpoise uncorrected electronic binding energies of CO 2 adsorption on the (010), (101), and (001) Ti 6 -5c defectfree and oxygen-deficient clusters are shown in Table 3. Table 4 shows the energies of electrons in the highest occupied orbitals of the (010) Ti 6 -5c triplet defect-free and oxygen-deficient clusters compared to the energy of the LUMO of CO 2 . Why was no electron transfer to CO 2 from defect-free TiO 2 in the excited state predicted by these calculations?One reason is the energy level of the LUMO and HOMO of CO 2 with respect to those of TiO 2 .As shown in Figure 11, the LUMO of the clusters is far below the LUMO of CO 2 .Increasing the size of the cluster (as shown in the (001) Ti 15 O 41 H 22 cluster) decreases the band (HOMO-LUMO) gap, but does not increase the energy of the LUMO.However, chemical interaction between the surface and the gas-phase species (CO 2 ) can alter the energy level of the CO 2 LUMO.The binding energies between CO 2 and the triplet defect-free (Ti 6 -5c) clusters shown in Table 3 do not indicate significant interaction.Therefore, due to this weak acid-base interaction (in the defect-free cluster models), the LUMO of CO 2 does not a CO 2 interacts more strongly with the ground-state singlet oxygendeficient Ti 6 (Vo)-5cCO 2 cluster than the ground-state singlet stoichiometric Ti 6 -5cCO 2 cluster.These stronger bindings lead to lowering of the CO 2 LUMO, increasing the possibility of electron transfer.contribute strongly to the LUMO of the (CO 2 TiO 2 ) surface complex. Another reason why no charge transfer is observed from an excited-state cluster to CO 2 is the negative electron affinity of a single CO 2 molecule. 13,14,41CO 2(g) -is metastable with respect to electron detachment. 42Factors such as solvation could change the electron affinity of CO 2 .For example, recent high-level ab initio calculations have shown that (CO 2 ) 4 clusters, where the CO 2 essentially acts as a solvent stabilizing the (CO 2 ) 4 -species, could have a positive vertical electron affinity. 41The implications of this cluster formation, in terms of selecting appropriate temperature and pressure conditions, as well as the choice of theoretical methods for modeling these reactions on the surface, are currently not well-understood. Mechanisms of CO 2 photocatalysis in the literature indicate that CO 2 gains electrons from the conduction band of TiO 2 .However, as shown in Figure 10, such transfer from defect-free surfaces is unlikely.Using larger clusters will further reduce the energy of the LUMO of the bare cluster.Therefore, any electrons in the conduction band produced by photoexcitation cannot be transferred to the LUMO of gas-phase CO 2 . The photocatalyst surface plays a role in activating CO 2 by lowering the LUMO of CO 2 from its gas-phase value, possibly via decreasing the O-C-O bond angle.In one limiting case, this corresponds to the formation of carbonatelike species on the surface.However, the results from SAC-CI single point calculations on the carbonatelike species on the (010) anatase surface indicate that even the carbonate species do not gain appreciable electron density from the TiO 2 cluster in various excited states.Therefore, excited-state calculations on both linear and the bent-carbonate species indicate that they do not undergo charge transfer from the cluster. Why does CO 2 gain electrons from oxygen-deficient clusters?The Ti n ion has stable (formal) oxidation numbers of n2, 3, and 4. A missing oxygen atom would leave two extra electrons at the site of the vacancy.These electrons then reduce the adjacent two surface Ti 4 sites to Ti 3 , creating surface electron centers.As shown in Table 4, the energies of the highest singly occupied molec-ular orbital (SOMO) of the (010) Ti 6 -5c cluster is 0.5 eV larger than that of the (010) Ti 6 (Vo)-5c cluster (with the bridging oxygen vacancy).Therefore, electrons in the highest SOMO of the (010) Ti 6 (Vo)-5c cluster have more energy, compared to the defect-free cluster.Nevertheless, this energy difference is not the primary reason for the formation of the negatively charged species. Electron transfer also requires that orbitals of similar symmetries overlap.Therefore, CO 2 should be located close to the Ti 3 atoms to form a surface complex where the CO 2 moiety gains electrons.Only initial configurations where CO 2 was located in the Ti-O-Ti plane, bridging the two Ti atoms, resulted in the formation of bent-CO 2 species.The presence of O atoms on a defect-free surface does not permit these interactions, due to the repulsion between the large oxide ions on the surface and the lone electron pairs on the oxygen atoms of CO 2 .This is further shown in a comparison of the highest occupied molecular orbitals of the oxygen-deficient and defect-free clusters, shown in Figure 12.Overlap between the (C-O) antibonding orbitals and the Ti(3d) orbitals is possible only when oxygen vacancies are present. The bonding between CO 2 and the oxygen-deficient cluster leading to the bent-adsorbed state resembles a CO 2 -(metal-CO 2 ) homogeneous complex. 40Therefore, overlap between the 3d-orbitals of the reduced Ti atom and the antibonding orbitals of CO 2 may lead to such species. 43The binding energies (Table 3) of bent-CO 2 species adsorbed on clusters containing oxygen vacancies are higher than those for the linearly adsorbed CO 2 on singlet defect-free clusters.This indicates that the singlet bent-CO 2 species are strongly bound to the surface.However, compared to the singlet bent-CO 2 species, the triplet bent-CO 2 species are weakly bound to the surface.Additionally, CO 2 adsorbed linearly on regular 5-c Ti 4 sites ((010) Ti 6 -5cCO 2 ) interacts less strongly with the surface compared to the linear CO 2 species adsorbed on reduced 4-c Ti 3 sites ((010) Ti 6 (Vo)-5cCO 2 ).This is consistent with the evidence for two-peak desorption of CO 2 obtained from thermal desorption spectroscopic (TDS) studies of CO 2 on reduced rutile (110) surfaces. 44Moreover, the binding energies in Table 3 indicate that the bent-CO 2 species ((010) Ti 6 (Vo)-5cCO 2 -bent) is more stable than the CO 2 species linearly adsorbed at the oxygen vacancies ((010) Ti 6 (Vo)-5cCO 2 -linear).Bent-CO 2 species have been observed on reduced polycrystalline powdered TiO 2 at low temperatures. 12Other studies also have emphasized the importance of oxygen defects on TiO 2 surfaces influencing reactivity toward CO 2 .Using CASPT2 and density functional theory (DFT), Rapp e and Ford 45 calculated that the barriers involved in the reaction of CO 2 with oxygen vacancies on TiO 2 forming bent-CO 2 and reduced-C 1 species were approximately 10 kcal/mol (42 kJ/mol).Chen et al. 46 note that oxygen vacancies in mixed-phase titania contribute to the visible light-induced photoactivity toward CO 2 .Although these studies were not performed on anatase TiO 2 , the results highlight the contribution of oxygen vacancies in influencing reactivity toward CO 2 . Whether or not the original Ti 3 centers could be regenerated by interaction with light, or whether CO 2 -formation is a stoichiometric reaction, is an open question.Using infrared spectroscopic studies on reduced polycrystalline rutile powders, Rask o and Solymosi 12 found that CO 2 adsorbed on the oxygen vacancies forming a bent-CO 2 species.The intensity of the bands corresponding to C-bent CO 2 species increased upon irradiation, indicating further charge transfer from reduced TiO 2 to CO 2 upon irradiation, but no CO formation via CO 2 dissociation was observed.On the other hand, experiments at higher temperatures by Raupp and Dumesic 47 as well as recent surface studies by Wilson et al. 48showed that CO 2 underwent dissociation and further reactions on reduced TiO 2 surfaces, leading to stoichiometric consumption of the oxygen vacancy.Further work is therefore required to compare the geometries, IR frequencies, and other characteristics of these species to the ones observed during previous experimental studies. Experimental studies of well-defined anatase surfaces have begun only in the past 10 years, whereas rutile TiO 2 surfaces are relatively better understood.Because real crystalline surfaces always have defects, studies of anatase surface reconstructions and steps 495051525354 will help identify other surface features that could promote CO 2 photoreduction.Anatase surfaces have a lower concentration of oxygen vacancies compared to rutile. 55However, doping, either with cations or anions, could result in the formation of oxygen vacancies/other defects.In contrast to O 2 photoreduction, which has been modeled on defect-free anatase surfaces, 24 CO 2 photoreduction likely requires surface/ bulk defects. Using a combination of both post-HF calculations on small model (TiO 2 :CO 2 ) clusters, as well as DFT calculations on larger CO 2 -TiO 2 clusters, we have shown that charge transfer from defect-free TiO 2 surfaces to CO 2 is energetically unfavorable.DFT calculations on triplet defect-free clusters indicate that the interaction between CO 2 and the excited stoichiometric TiO 2 surface do not lead to charge transfer to CO 2 .CO 2 photoreduction mechanisms in the literature assume that CO 2 gains electrons from the conduction band of TiO 2 .However, our results show that such electron transfer may only be mediated by surface defects.This work therefore underscores the significance of defects such as steps, kinks, and vacancies on anatase TiO 2 surfaces in promoting electron transfer to CO 2 in the excited state.The role of defects in catalytically promoting CO 2 photoreactions needs to be investigated.These computations will serve as guidelines for in situ irradiated single crystal studies of CO 2 on anatase, by which structures of adsorbates at well-defined surfaces can be obtained.Appendix: Cluster Notation (001) Ti-watCO 2 (001) Ti(OH) 4 OH 2 -CO 2 cluster (110) Ti-4cCO 2 (110) Ti(OH) 4 CO 2 cluster (010)Ti 2 -CO 2 (010) Ti 2 O 9 H 10 -CO 2 cluster Ti 6 -5cCO 2 Ti 6 O 21 H 18 -CO 2 cluster Ti 6 (Vo)-5cTi 6 O 20 H 18 cluster Ti 6 (Vo)-5cCO 2 Ti 6 O 20 H 18 -CO 2 cluster 3 (010) Ti 6 -5ctriplet state (010) Ti 6 O 21 H 18 cluster Supporting Information Available: SAC-CI excited state configurations and the canonical molecular orbitals for the Ti-watCO 2 and Ti-4cCO 2 clusters and the Cartesian coordinates of all clusters used in this study.This material is available free of charge via the Internet at http://pubs.acs.org. Figure 1.Schematic of semiconductor-mediated CO 2 photoreduction.Photogenerated electrons and holes are transferred to CO 2 and H 2 O in a series of reactions leading to the formation of compounds such as CH 4 and O 2 , respectively. Figure 2. (left) (001) Ti-watCO 2 (Ti(OH) 4 H 2 O-CO 2 ) cluster.(right) Ti-4cCO 2 (Ti(OH) 4 H 2 O-CO 2 ) cluster, optimized at the G03-B3LYP/6-31G(d) level of theory.The bond lengths are in angstroms; the angles are in degrees. Figure 3. Ground-state ( 1 A) (010) C 2 symmetric Ti 2 O 9 H 10 CO 2 cluster optimized with G03-B3LYP/6-31G(d) model chemistry.The bond distances are in angstroms; angles are in degrees.CO 2 forms a carbonatelike species on the (010) anatase surface. Figure 4. Percentage of charge transferred to CO 2 , calculated from single-point excited-state relaxed density population analyses.Negative values indicate a net gain in the charge of the CO 2 moiety.(a) (001) Ti-watCO 2 , NPA, (b) (001) Ti-watCO 2 , Mulliken, (c) (110) Ti-4cCO 2 , NPA, (d) (110) Ti-4cCO 2 , Mulliken.The NPA analyses for both (001) Ti-watCO 2 and (110) Ti-4cCO 2 clusters indicate insignificant charge transfer to CO 2 .The lines are shown for clarity and are not meant to indicate charge transfer trends among different excited states. Figure 5. Changes in summed atomic charges of the CO 2 (CO2), surface species (CO3) and the bare cluster (Ti2O9H10) over the SAC ground state, calculated with unrelaxed excited-state SAC-CI densities (from single point calculations) using the 6-31G(d) basis set.The amount of charge transferred from/to the CO 2 moiety in various excited states is minimal. Figure 6.Location of the photogenerated electron and hole in various triplet Ti 6 clusters.(a) (010) Ti 6 -5cCO 2 cluster, (b) (101)Ti 6 -5cCO 2 cluster, (c) (001) Ti 6 -5cCO 2 cluster, (d) Ti 6 -4c cluster without CO 2 .The difference in spin densities (alpha-beta) is plotted at a isocontour value of 0.03 e/A 3.In parts a-c, the photogenerated electrons are localized on the 3d orbitals of the Ti atoms and are not transferred to CO 2 .In part d, the photogenerated electrons on the (110) surface are not available to surface Ti atoms and are localized on (6-coordinate) Ti atoms in the bulk.Therefore, CO 2 adsorption and further electron transfer on this surface was not investigated (plotted with the gOpenMol visualization program 1,2 ). Figure 7. Local geometry around the Ti atom interacting with CO 2 in various triplet Ti 6 -CO 2 clusters, from TM-B3LYP/def2-SV(P) calculations.(a) (010) Ti 6 -5cCO 2 , (b) (101) Ti 6 -5cCO 2 cluster, (c) (001) Ti 6 -5cCO 2 cluster.Only linear CO 2 species are shown in the figure.CO 2 is not significantly distorted from its linear geometry in all three cases.The bond lengths are in angstroms; the angles are in degrees.Only Ti and O (and CO 2 ) atoms on and adjacent to the (010), (101), (001), and (110) surfaces were relaxed from their positions in the bulk TiO 2 anatase crystal. Figure 8. TM-B3LYP/def2-SV(P) optimized geometry of the singlet (010) Ti 6 (Vo)-5cCO 2 -bent (Ti 6 O 20 H 18 -CO 2 ) cluster.CO 2 adsorbs on the reduced (010) surface with bridging oxygen vacancies forming a negatively charged CO 2 -species, which resemble 2 -(transition metal-CO 2 ) complexes.The bond lengths are in angstroms; the angles are in degrees.Only Ti and O (and CO 2 ) atoms on and adjacent to the (010), (101), (001), and (110) surfaces were relaxed from their positions in the bulk TiO 2 anatase crystal. Figure 9. TM-B3LYP/def2-SV(P) optimized geometry of the singlet (010) Ti 6 (Vo)-5cCO 2 -linear (Ti 6 O 20 H 18 -CO 2 ) cluster.CO 2 adsorbs linearly on the reduced (010) surface with bridging oxygen vacancies.The linear complex is not stable compared to the bent-adsorption mode, shown in the previous figure.The bond lengths are in angstroms; the angles are in degrees.Only Ti and O (and CO 2 ) atoms on and adjacent to the (010), (101), (001), and (110) surfaces were relaxed from their positions in the bulk TiO 2 anatase crystal. Figure 10.Natural charges of CO 2 species calculated from TM-B3LYP/def2-SV(P) level calculations on Ti 6 -5cCO 2 clusters from various surface planes.(a) Triplet (010) Ti 6 -5cCO 2 , (b) triplet (010) Ti 6 (Vo)-5cCO 2 -bent, (c) singlet (010) Ti 6 (Vo)-5cCO 2 -bent, (d) triplet (101) Ti 6 -5cCO 2 , (e) triplet (001) Ti 6 -5cCO 2 .CO 2 gains electrons only from oxygen-deficient TiO 2 clusters.Table 3. Counterpoise Uncorrected Electronic Binding Energies of CO 2 Adsorption on Various Singlet and Triplet (010), (101), and (001) Defect-Free Clusters and Those of Singlet and Triplet (010) Oxygen-Deficient Clusters, Calculated at the TM-B3LYP/def2-SV(P) Level a 40) Gibson, D. H. Carbon dioxide coordination chemistry: metal complexes and surface-bound species.What relationships?Coord.Chem.Rev. 1999, 185-186, 335-355. Figure 11.Positions of the bottom of the conduction band (LUMO) and top of the valence band (HOMO) for singlet Ti(OH) 4 H 2 O (010) and Ti(OH) 4 H 2 O (001) clusters compared with those of a CO 2 molecule in the gas phase at the G03-B3LYP/6-31G(d) level.A single point G03-B3LYP/GenECP calculation (LANL2DZ on Ti atoms, 6-31G(d) on O, H) with the larger Ti 15 O 41 H 22 cluster was performed to calculate the HOMO and LUMO energies. Comparison of Energies of LUMO of CO 2 with the Highest SOMO of Defect-Free and Oxygen-Deficient Ti 6 Clusters and the Highest SOMO of the Surface Complex ((010) Ti 6 (Vo)-5cCO 2 ) a molecular orbital energy, eV 1 CO 2(g) , LUMO 0.91 3 (010) Ti 6 (Vo)-5c highest SOMO -3.73 3 (010) Ti 6 -5c highest SOMO -4.29 3 (010) Ti 6 (Vo)-5cCO 2 -bent highest SOMO -4.38The electrons in the highest SOMO of the bare, oxygen-deficient cluster are higher in energy compared to those in the highest SOMO of the bare, defect-free cluster.Calculations were performed using the TM-B3LYP/def2-SV(P) model chemistry.(41) Sommerfeld, T.; Posset, T. Electron attachment to CO 2 clusters.J. Chem.Phys.2003, 119 (15), 7714-7724.(42) Freund, H. J.; Roberts, M. W. Surface chemistry of carbon dioxide.Surf.Sci.Rep. 1996, 25 (8), 227-273.(43) Busca, G.; Lorenzelli, V. Infrared spectroscopic identification of species arising from reactive adsorption of carbon oxides on metal oxide surfaces.Mater.Chem.1982, 7 (1), 89-126.(44) Thompson, T. L.; Diwald, O.; Yates, J. T., Jr. CO2 as a Probe for Monitoring the Surface Defects on TiO 2 (110)-Temperature-Programmed Desorption.J. Phys.Chem.B 2003, 107 (42), 11700-11704. Figure 12.Highest occupied molecular orbitals of various (010) Ti 6 clusters with and without CO 2 (plotted with the gOpenMol visualization program 1,2 ).(a) Triplet oxygen-deficient (Ti 6 (Vo)-5c) bare cluster, (b) singlet oxygen-deficient (Ti 6 (Vo)-5c) bare cluster, (c) triplet defect-free (Ti 6 -5c) bare cluster, (d) singlet bent-CO 2 species adsorbed on the oxygen-deficient cluster (Ti 6 (Vo)-5cCO 2bent) plotted at an isocontour value of 0.1 e 1/2 /A 3/2 .The HOMO of cluster d consists of both the Ti(3d) orbital (similar to those in parts a and b) and the (C-O) orbitals of CO 2 . Excitation Energies (for the First Four Excited States) of CO 2 Linearly Adsorbed on Clusters from (110) and (001) Anatase TiO 2 Surfaces (Ti-4cCO 2 , Ti-watCO 2 ), Calculated at the SAC-CI/6-31G(d) Level of Theory a (37) Schafer, A.; Horn, H.; Ahlrichs, R. Fully optimized contracted Gaussian basis sets for atoms Li to Kr.J. Chem.Phys.1992,97(4),2571.(38)Sierka,M.; Hogekamp, A.; Ahlrichs, R. Fast evaluation of the Coulomb potential for electron densities using multipole accelerated resolution of identity approximation.J. Chem.Phys.2003,118 (20), 9136. Excited-State Symmetries, Excitation Energies, and Oscillator Strengths for the First Four Excited Singlet States of the (010) Ti 2 O 9 H 10 CO 2 Cluster (Carbonatelike Species) Calculated by SAC-CI and TD-DFT using the 6-31G(d) Basis Set a Acknowledgment.V.P.I. thanks Penn State Institutes of Energy and the Environment (PSIEE) for financial support.Computational support was in part provided by the National Science Foundation under Grant No. CHE-0431328 for the Center for Environmental Kinetics Analysis (CEKA) at The Pennsylvania State University.We deeply thank Dr. Michael Janik for his insightful comments on a previous draft of this article.Discussions with Dr. Alexander Mitin helped shape this work.We also thank the Gaussian and Turbomole support teams for clarifying certain aspects of their programs."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The optimized geometries of the (110) Ti-4cCO 2 and (001) Ti-watCO 2 clusters are shown in Figure 2. CO 2 adsorbs linearly at the Ti Lewis acid sites.The O-C-O bond angle of CO 2 is not significantly distorted from its gas-phase value of 180, which indicates that the electronic interaction between the unoccupied orbitals of CO 2 and the occupied orbitals of the \"bare\" cluster in the ground state is weak. Excitation energies and symmetries of the first four excited states of these two clusters, calculated from single-point calculations at the SAC-CI/6-31G(d) level of theory are shown in Table 1.These vertical excitation energies lie in the (UV-B)-(UV-C) region of the spectrum.Additionally, the excitation energies for the (4-c) Ti-4cCO 2 cluster are significantly higher than the (5-c) Ti-watCO 2 cluster.This is consistent with the trends in the ligand-to-metal charge transfer (LMCT) transition energies for tetrahedral (4-c) and octahedral (6-c) Ti atoms. 39n the next step, excited states of a cluster ((010) Ti2-CO 2 ) with significant electronic interaction between the bare a The excitation energies predicted by TD-DFT calculations are within 0.5 eV of those from SAC-CI calculations.However, TD-DFT calculations neither predict correct oscillator strengths nor correct excited-state symmetries, making TD-DFT qualitatively incorrect.Ti 6 -5cCO 2 cluster, (c) (001) Ti 6 -5cCO 2 cluster, (d) Ti 6 -4c cluster without CO 2 .The difference in spin densities (alpha-beta) is plotted at a isocontour value of 0.03 e/A 3.In parts a-c, the photogenerated electrons are localized on the 3d orbitals of the Ti atoms and are not transferred to CO 2 .In part d, the photogenerated electrons on the (110) surface are not available to surface Ti atoms and are localized on (6-coordinate) Ti atoms in the bulk.Therefore, CO 2 adsorption and further electron transfer on this surface was not investigated (plotted with the gOpenMol visualization program 1,2 ).cluster and CO 2 (in the ground-state) were studied.This represented carbonate-like species adsorbed on the (010) surface plane of anatase.Comparisons of the SAC-CI/6-31G(d) adiabatic excitation energies for the (010) Ti 2 -CO 2 cluster (shown in Figure 3) with those obtained from TD-DFT calculations at the G03-B3LYP/6-31G(d) level are shown in Table 2. Clearly, TD-DFT excitation energies are within 0.5 eV of those obtained with SAC-CI.Therefore, although significant errors exist in TD-DFT values, TD-DFT could be used to estimate the trends in vertical excitation energies for larger clusters.However, the oscillator strengths predicted by the less expensive TD-DFT calculations do not agree with those from SAC-CI calculations.Moreover, the excited state symmetries predicted by TD-DFT do not agree with those predicted by SAC-CI.Therefore, even qualitative comparisons of TD-DFT absorption spectra with experimental spectra will be complicated by the fact that the oscillator strengths are inaccurate.This indicates the need for post-HF methods rather than TD-DFT to study excited states of chemisorbed carbonatelike species. The percentage of charge transferred from the oxygen atoms of the cluster to the CO 2 moiety in the Ti-watCO 2 and Ti-4cCO 2 clusters is shown in Figure 4. Figure 5 shows the change in the charge (from unrelaxed Mulliken population analyses of the excited-states) of various moieties (CO 2 , CO 2 O bridging (referred to as CO 3 ), and Ti 2 O 9 H 10 ) of the Ti 2 -CO 2 cluster.In Figure 5, the results are shown as the difference of the charge of the moiety between the SAC ground state and the excited state.In addition to these criteria, charge transfer to CO 2 can be indicated by examining the excited states and the type of (canonical) molecular orbitals comprising various configurations of the wave function.From the analysis of the ground-state molecular orbitals of the linear CO 2 species (Ti-watCO 2 , Ti-4cCO 2 ) (involved in various excited state configurations) (presented in the Supporting Information), it is clear that the majority of the contribution to the unoccupied orbitals comes from the Ti 3d atomic orbitals and not C-O orbitals of CO 2 .Therefore, most of the charge transferred from the oxygen atoms is localized on the Ti atoms.These SAC-CI results indicate that the amount of charge transfer from the bare cluster to CO 2 is insignificant compared to the charge gained by Ti atoms, for both linearly adsorbed CO 2 as well as carbonate-like chemisorbed species. The results in Figure 4 indicate a large discrepancy between Mulliken and natural population analyses for the Ti-watCO 2 cluster.Mulliken population analyses are not independent of the basis set and the method used for the calculations.In contrast, atomic charges obtained by NPA analysis are known to vary less with the choice of the basis set.NPA analysis is therefore a better indicator of the real charge of the species in various excited states. In the next part of this study, we modeled the adsorption of CO 2 on triplet (Ti 6 ) clusters from various surface planes.Various starting configurations were used for the interaction of CO 2 with the electron-center (Ti 3 ), and the lowest energy configurations are shown in Figure 6.More details, including the local geometry around the Ti atom interacting with the CO 2 species are shown in Figure 7.The overall nature of CO 2 adsorption on triplet Ti 6 clusters modeled using Turbomole is similar to that observed with the smaller ground-state clusters modeled in G03.The interaction is mainly weak acid-base in character.On the (010) and ( 101) triplet Ti 6 -5c clusters, CO 2 adsorbs with the oxygen end-on Ti atom.In the case of the triplet (001) Ti 6 -5c cluster, one of the (Ti-2c O) bonds is broken (shown in Figure 7) and CO 2 is more loosely bound.We also observed the formation of carbonate species on the (001) TiO 2 surface.However, electron transfer was not predicted for these carbonate species to or from the TiO 2 surface in the triplet state.The difference between the alpha and beta spin densities of the triplet (010), (101), and (001) Ti 6 -5cCO 2 clusters, shown in Figure 6 indicates that the photogenerated electron is not transferred to CO 2 . In the limit of the cluster sizes used in this study, we find that photogenerated electrons are available for surface reactions on (010), (001), and (101) surfaces (Figure 7a-c).The photogenerated electrons are localized on the terrace 5-c Ti atoms of the (101) surface.On the (110) surface exposing 4-c Ti atoms, the photogenerated electron and hole were localized in the bulk.Therefore, CO 2 adsorption on this surface in the triplet state was not modeled. Both SAC-CI and DFT calculations have shown that clusters from defect-free anatase TiO 2 surfaces do not transfer the photogenerated electron to CO 2 .Because oxygen vacancies are among the most common defects on metal oxide surfaces, CO 2 adsorption on oxygen-deficient clusters was modeled.The ground-state of the (010) oxygen-deficient bare anatase cluster (Ti 6 (Vo)-5c) is a triplet.However, upon CO 2 adsorption, the ground-state of the (010) Ti 6 (Vo)-5cCO 2 cluster was found to be a singlet.As shown in Figure 8, CO 2 adsorbs on the oxygen vacancy, forming a negatively charged CO 2 -species, which resembles a CO 2 -(metal-CO 2 ) complex. 40Additionally, linear CO 2 adsorbed on the Ti 3 electron centers (formed as a result of the oxygen vacancy formation) (Figure 9) were also modeled.Triplet states of the oxygendeficient CO 2 -TiO 2 clusters were also studied. The charges on the CO 2 moieties from DFT level calculations on oxygen-deficient and defect-free clusters are shown in Figure 10.Counterpoise uncorrected electronic binding energies of CO 2 adsorption on the (010), (101), and (001) Ti 6 -5c defectfree and oxygen-deficient clusters are shown in Table 3. Table 4 shows the energies of electrons in the highest occupied orbitals of the (010) Ti 6 -5c triplet defect-free and oxygen-deficient clusters compared to the energy of the LUMO of CO 2 . Why was no electron transfer to CO 2 from defect-free TiO 2 in the excited state predicted by these calculations?One reason is the energy level of the LUMO and HOMO of CO 2 with respect to those of TiO 2 .As shown in Figure 11, the LUMO of the clusters is far below the LUMO of CO 2 .Increasing the size of the cluster (as shown in the (001) Ti 15 O 41 H 22 cluster) decreases the band (HOMO-LUMO) gap, but does not increase the energy of the LUMO.However, chemical interaction between the surface and the gas-phase species (CO 2 ) can alter the energy level of the CO 2 LUMO.The binding energies between CO 2 and the triplet defect-free (Ti 6 -5c) clusters shown in Table 3 do not indicate significant interaction.Therefore, due to this weak acid-base interaction (in the defect-free cluster models), the LUMO of CO 2 does not a CO 2 interacts more strongly with the ground-state singlet oxygendeficient Ti 6 (Vo)-5cCO 2 cluster than the ground-state singlet stoichiometric Ti 6 -5cCO 2 cluster.These stronger bindings lead to lowering of the CO 2 LUMO, increasing the possibility of electron transfer.contribute strongly to the LUMO of the (CO 2 TiO 2 ) surface complex. Another reason why no charge transfer is observed from an excited-state cluster to CO 2 is the negative electron affinity of a single CO 2 molecule. 13,14,41CO 2(g) -is metastable with respect to electron detachment. 42Factors such as solvation could change the electron affinity of CO 2 .For example, recent high-level ab initio calculations have shown that (CO 2 ) 4 clusters, where the CO 2 essentially acts as a solvent stabilizing the (CO 2 ) 4 -species, could have a positive vertical electron affinity. 41The implications of this cluster formation, in terms of selecting appropriate temperature and pressure conditions, as well as the choice of theoretical methods for modeling these reactions on the surface, are currently not well-understood. Mechanisms of CO 2 photocatalysis in the literature indicate that CO 2 gains electrons from the conduction band of TiO 2 .However, as shown in Figure 10, such transfer from defect-free surfaces is unlikely.Using larger clusters will further reduce the energy of the LUMO of the bare cluster.Therefore, any electrons in the conduction band produced by photoexcitation cannot be transferred to the LUMO of gas-phase CO 2 . The photocatalyst surface plays a role in activating CO 2 by lowering the LUMO of CO 2 from its gas-phase value, possibly via decreasing the O-C-O bond angle.In one limiting case, this corresponds to the formation of carbonatelike species on the surface.However, the results from SAC-CI single point calculations on the carbonatelike species on the (010) anatase surface indicate that even the carbonate species do not gain appreciable electron density from the TiO 2 cluster in various excited states.Therefore, excited-state calculations on both linear and the bent-carbonate species indicate that they do not undergo charge transfer from the cluster. Why does CO 2 gain electrons from oxygen-deficient clusters?The Ti n ion has stable (formal) oxidation numbers of n2, 3, and 4. A missing oxygen atom would leave two extra electrons at the site of the vacancy.These electrons then reduce the adjacent two surface Ti 4 sites to Ti 3 , creating surface electron centers.As shown in Table 4, the energies of the highest singly occupied molec-ular orbital (SOMO) of the (010) Ti 6 -5c cluster is 0.5 eV larger than that of the (010) Ti 6 (Vo)-5c cluster (with the bridging oxygen vacancy).Therefore, electrons in the highest SOMO of the (010) Ti 6 (Vo)-5c cluster have more energy, compared to the defect-free cluster.Nevertheless, this energy difference is not the primary reason for the formation of the negatively charged species. Electron transfer also requires that orbitals of similar symmetries overlap.Therefore, CO 2 should be located close to the Ti 3 atoms to form a surface complex where the CO 2 moiety gains electrons.Only initial configurations where CO 2 was located in the Ti-O-Ti plane, bridging the two Ti atoms, resulted in the formation of bent-CO 2 species.The presence of O atoms on a defect-free surface does not permit these interactions, due to the repulsion between the large oxide ions on the surface and the lone electron pairs on the oxygen atoms of CO 2 .This is further shown in a comparison of the highest occupied molecular orbitals of the oxygen-deficient and defect-free clusters, shown in Figure 12.Overlap between the (C-O) antibonding orbitals and the Ti(3d) orbitals is possible only when oxygen vacancies are present. The bonding between CO 2 and the oxygen-deficient cluster leading to the bent-adsorbed state resembles a CO 2 -(metal-CO 2 ) homogeneous complex. 40Therefore, overlap between the 3d-orbitals of the reduced Ti atom and the antibonding orbitals of CO 2 may lead to such species. 43The binding energies (Table 3) of bent-CO 2 species adsorbed on clusters containing oxygen vacancies are higher than those for the linearly adsorbed CO 2 on singlet defect-free clusters.This indicates that the singlet bent-CO 2 species are strongly bound to the surface.However, compared to the singlet bent-CO 2 species, the triplet bent-CO 2 species are weakly bound to the surface.Additionally, CO 2 adsorbed linearly on regular 5-c Ti 4 sites ((010) Ti 6 -5cCO 2 ) interacts less strongly with the surface compared to the linear CO 2 species adsorbed on reduced 4-c Ti 3 sites ((010) Ti 6 (Vo)-5cCO 2 ).This is consistent with the evidence for two-peak desorption of CO 2 obtained from thermal desorption spectroscopic (TDS) studies of CO 2 on reduced rutile (110) surfaces. 44Moreover, the binding energies in Table 3 indicate that the bent-CO 2 species ((010) Ti 6 (Vo)-5cCO 2 -bent) is more stable than the CO 2 species linearly adsorbed at the oxygen vacancies ((010) Ti 6 (Vo)-5cCO 2 -linear).Bent-CO 2 species have been observed on reduced polycrystalline powdered TiO 2 at low temperatures. 12Other studies also have emphasized the importance of oxygen defects on TiO 2 surfaces influencing reactivity toward CO 2 .Using CASPT2 and density functional theory (DFT), Rapp e and Ford 45 calculated that the barriers involved in the reaction of CO 2 with oxygen vacancies on TiO 2 forming bent-CO 2 and reduced-C 1 species were approximately 10 kcal/mol (42 kJ/mol).Chen et al. 46 note that oxygen vacancies in mixed-phase titania contribute to the visible light-induced photoactivity toward CO 2 .Although these studies were not performed on anatase TiO 2 , the results highlight the contribution of oxygen vacancies in influencing reactivity toward CO 2 . Whether or not the original Ti 3 centers could be regenerated by interaction with light, or whether CO 2 -formation is a stoichiometric reaction, is an open question.Using infrared spectroscopic studies on reduced polycrystalline rutile powders, Rask o and Solymosi 12 found that CO 2 adsorbed on the oxygen vacancies forming a bent-CO 2 species.The intensity of the bands corresponding to C-bent CO 2 species increased upon irradiation, indicating further charge transfer from reduced TiO 2 to CO 2 upon irradiation, but no CO formation via CO 2 dissociation was observed.On the other hand, experiments at higher temperatures by Raupp and Dumesic 47 as well as recent surface studies by Wilson et al. 48showed that CO 2 underwent dissociation and further reactions on reduced TiO 2 surfaces, leading to stoichiometric consumption of the oxygen vacancy.Further work is therefore required to compare the geometries, IR frequencies, and other characteristics of these species to the ones observed during previous experimental studies. Experimental studies of well-defined anatase surfaces have begun only in the past 10 years, whereas rutile TiO 2 surfaces are relatively better understood.Because real crystalline surfaces always have defects, studies of anatase surface reconstructions and steps 495051525354 will help identify other surface features that could promote CO 2 photoreduction.Anatase surfaces have a lower concentration of oxygen vacancies compared to rutile. 55However, doping, either with cations or anions, could result in the formation of oxygen vacancies/other defects.In contrast to O 2 photoreduction, which has been modeled on defect-free anatase surfaces, 24 CO 2 photoreduction likely requires surface/ bulk defects."
  },
  {
    "title": "Conclusions",
    "content": "Using a combination of both post-HF calculations on small model (TiO 2 :CO 2 ) clusters, as well as DFT calculations on larger CO 2 -TiO 2 clusters, we have shown that charge transfer from defect-free TiO 2 surfaces to CO 2 is energetically unfavorable.DFT calculations on triplet defect-free clusters indicate that the interaction between CO 2 and the excited stoichiometric TiO 2 surface do not lead to charge transfer to CO 2 .CO 2 photoreduction mechanisms in the literature assume that CO 2 gains electrons from the conduction band of TiO 2 .However, our results show that such electron transfer may only be mediated by surface defects.This work therefore underscores the significance of defects such as steps, kinks, and vacancies on anatase TiO 2 surfaces in promoting electron transfer to CO 2 in the excited state.The role of defects in catalytically promoting CO 2 photoreactions needs to be investigated.These computations will serve as guidelines for in situ irradiated single crystal studies of CO 2 on anatase, by which structures of adsorbates at well-defined surfaces can be obtained.Appendix: Cluster Notation (001) Ti-watCO 2 (001) Ti(OH) 4 OH 2 -CO 2 cluster (110) Ti-4cCO 2 (110) Ti(OH) 4 CO 2 cluster (010)Ti 2 -CO 2 (010) Ti 2 O 9 H 10 -CO 2 cluster Ti 6 -5cCO 2 Ti 6 O 21 H 18 -CO 2 cluster Ti 6 (Vo)-5cTi 6 O 20 H 18 cluster Ti 6 (Vo)-5cCO 2 Ti 6 O 20 H 18 -CO 2 cluster 3 (010) Ti 6 -5ctriplet state (010) Ti 6 O 21 H 18 cluster Supporting Information Available: SAC-CI excited state configurations and the canonical molecular orbitals for the Ti-watCO 2 and Ti-4cCO 2 clusters and the Cartesian coordinates of all clusters used in this study.This material is available free of charge via the Internet at http://pubs.acs.org. Figure 1.Schematic of semiconductor-mediated CO 2 photoreduction.Photogenerated electrons and holes are transferred to CO 2 and H 2 O in a series of reactions leading to the formation of compounds such as CH 4 and O 2 , respectively. Figure 2. (left) (001) Ti-watCO 2 (Ti(OH) 4 H 2 O-CO 2 ) cluster.(right) Ti-4cCO 2 (Ti(OH) 4 H 2 O-CO 2 ) cluster, optimized at the G03-B3LYP/6-31G(d) level of theory.The bond lengths are in angstroms; the angles are in degrees. Figure 3. Ground-state ( 1 A) (010) C 2 symmetric Ti 2 O 9 H 10 CO 2 cluster optimized with G03-B3LYP/6-31G(d) model chemistry.The bond distances are in angstroms; angles are in degrees.CO 2 forms a carbonatelike species on the (010) anatase surface. Figure 4. Percentage of charge transferred to CO 2 , calculated from single-point excited-state relaxed density population analyses.Negative values indicate a net gain in the charge of the CO 2 moiety.(a) (001) Ti-watCO 2 , NPA, (b) (001) Ti-watCO 2 , Mulliken, (c) (110) Ti-4cCO 2 , NPA, (d) (110) Ti-4cCO 2 , Mulliken.The NPA analyses for both (001) Ti-watCO 2 and (110) Ti-4cCO 2 clusters indicate insignificant charge transfer to CO 2 .The lines are shown for clarity and are not meant to indicate charge transfer trends among different excited states. Figure 5. Changes in summed atomic charges of the CO 2 (CO2), surface species (CO3) and the bare cluster (Ti2O9H10) over the SAC ground state, calculated with unrelaxed excited-state SAC-CI densities (from single point calculations) using the 6-31G(d) basis set.The amount of charge transferred from/to the CO 2 moiety in various excited states is minimal. Figure 6.Location of the photogenerated electron and hole in various triplet Ti 6 clusters.(a) (010) Ti 6 -5cCO 2 cluster, (b) (101)Ti 6 -5cCO 2 cluster, (c) (001) Ti 6 -5cCO 2 cluster, (d) Ti 6 -4c cluster without CO 2 .The difference in spin densities (alpha-beta) is plotted at a isocontour value of 0.03 e/A 3.In parts a-c, the photogenerated electrons are localized on the 3d orbitals of the Ti atoms and are not transferred to CO 2 .In part d, the photogenerated electrons on the (110) surface are not available to surface Ti atoms and are localized on (6-coordinate) Ti atoms in the bulk.Therefore, CO 2 adsorption and further electron transfer on this surface was not investigated (plotted with the gOpenMol visualization program 1,2 ). Figure 7. Local geometry around the Ti atom interacting with CO 2 in various triplet Ti 6 -CO 2 clusters, from TM-B3LYP/def2-SV(P) calculations.(a) (010) Ti 6 -5cCO 2 , (b) (101) Ti 6 -5cCO 2 cluster, (c) (001) Ti 6 -5cCO 2 cluster.Only linear CO 2 species are shown in the figure.CO 2 is not significantly distorted from its linear geometry in all three cases.The bond lengths are in angstroms; the angles are in degrees.Only Ti and O (and CO 2 ) atoms on and adjacent to the (010), (101), (001), and (110) surfaces were relaxed from their positions in the bulk TiO 2 anatase crystal. Figure 8. TM-B3LYP/def2-SV(P) optimized geometry of the singlet (010) Ti 6 (Vo)-5cCO 2 -bent (Ti 6 O 20 H 18 -CO 2 ) cluster.CO 2 adsorbs on the reduced (010) surface with bridging oxygen vacancies forming a negatively charged CO 2 -species, which resemble 2 -(transition metal-CO 2 ) complexes.The bond lengths are in angstroms; the angles are in degrees.Only Ti and O (and CO 2 ) atoms on and adjacent to the (010), (101), (001), and (110) surfaces were relaxed from their positions in the bulk TiO 2 anatase crystal. Figure 9. TM-B3LYP/def2-SV(P) optimized geometry of the singlet (010) Ti 6 (Vo)-5cCO 2 -linear (Ti 6 O 20 H 18 -CO 2 ) cluster.CO 2 adsorbs linearly on the reduced (010) surface with bridging oxygen vacancies.The linear complex is not stable compared to the bent-adsorption mode, shown in the previous figure.The bond lengths are in angstroms; the angles are in degrees.Only Ti and O (and CO 2 ) atoms on and adjacent to the (010), (101), (001), and (110) surfaces were relaxed from their positions in the bulk TiO 2 anatase crystal. Figure 10.Natural charges of CO 2 species calculated from TM-B3LYP/def2-SV(P) level calculations on Ti 6 -5cCO 2 clusters from various surface planes.(a) Triplet (010) Ti 6 -5cCO 2 , (b) triplet (010) Ti 6 (Vo)-5cCO 2 -bent, (c) singlet (010) Ti 6 (Vo)-5cCO 2 -bent, (d) triplet (101) Ti 6 -5cCO 2 , (e) triplet (001) Ti 6 -5cCO 2 .CO 2 gains electrons only from oxygen-deficient TiO 2 clusters.Table 3. Counterpoise Uncorrected Electronic Binding Energies of CO 2 Adsorption on Various Singlet and Triplet (010), (101), and (001) Defect-Free Clusters and Those of Singlet and Triplet (010) Oxygen-Deficient Clusters, Calculated at the TM-B3LYP/def2-SV(P) Level a 40) Gibson, D. H. Carbon dioxide coordination chemistry: metal complexes and surface-bound species.What relationships?Coord.Chem.Rev. 1999, 185-186, 335-355. Figure 11.Positions of the bottom of the conduction band (LUMO) and top of the valence band (HOMO) for singlet Ti(OH) 4 H 2 O (010) and Ti(OH) 4 H 2 O (001) clusters compared with those of a CO 2 molecule in the gas phase at the G03-B3LYP/6-31G(d) level.A single point G03-B3LYP/GenECP calculation (LANL2DZ on Ti atoms, 6-31G(d) on O, H) with the larger Ti 15 O 41 H 22 cluster was performed to calculate the HOMO and LUMO energies. Comparison of Energies of LUMO of CO 2 with the Highest SOMO of Defect-Free and Oxygen-Deficient Ti 6 Clusters and the Highest SOMO of the Surface Complex ((010) Ti 6 (Vo)-5cCO 2 ) a molecular orbital energy, eV 1 CO 2(g) , LUMO 0.91 3 (010) Ti 6 (Vo)-5c highest SOMO -3.73 3 (010) Ti 6 -5c highest SOMO -4.29 3 (010) Ti 6 (Vo)-5cCO 2 -bent highest SOMO -4.38The electrons in the highest SOMO of the bare, oxygen-deficient cluster are higher in energy compared to those in the highest SOMO of the bare, defect-free cluster.Calculations were performed using the TM-B3LYP/def2-SV(P) model chemistry.(41) Sommerfeld, T.; Posset, T. Electron attachment to CO 2 clusters.J. Chem.Phys.2003, 119 (15), 7714-7724.(42) Freund, H. J.; Roberts, M. W. Surface chemistry of carbon dioxide.Surf.Sci.Rep. 1996, 25 (8), 227-273.(43) Busca, G.; Lorenzelli, V. Infrared spectroscopic identification of species arising from reactive adsorption of carbon oxides on metal oxide surfaces.Mater.Chem.1982, 7 (1), 89-126.(44) Thompson, T. L.; Diwald, O.; Yates, J. T., Jr. CO2 as a Probe for Monitoring the Surface Defects on TiO 2 (110)-Temperature-Programmed Desorption.J. Phys.Chem.B 2003, 107 (42), 11700-11704. Figure 12.Highest occupied molecular orbitals of various (010) Ti 6 clusters with and without CO 2 (plotted with the gOpenMol visualization program 1,2 ).(a) Triplet oxygen-deficient (Ti 6 (Vo)-5c) bare cluster, (b) singlet oxygen-deficient (Ti 6 (Vo)-5c) bare cluster, (c) triplet defect-free (Ti 6 -5c) bare cluster, (d) singlet bent-CO 2 species adsorbed on the oxygen-deficient cluster (Ti 6 (Vo)-5cCO 2bent) plotted at an isocontour value of 0.1 e 1/2 /A 3/2 .The HOMO of cluster d consists of both the Ti(3d) orbital (similar to those in parts a and b) and the (C-O) orbitals of CO 2 . Excitation Energies (for the First Four Excited States) of CO 2 Linearly Adsorbed on Clusters from (110) and (001) Anatase TiO 2 Surfaces (Ti-4cCO 2 , Ti-watCO 2 ), Calculated at the SAC-CI/6-31G(d) Level of Theory a (37) Schafer, A.; Horn, H.; Ahlrichs, R. Fully optimized contracted Gaussian basis sets for atoms Li to Kr.J. Chem.Phys.1992,97(4),2571.(38)Sierka,M.; Hogekamp, A.; Ahlrichs, R. Fast evaluation of the Coulomb potential for electron densities using multipole accelerated resolution of identity approximation.J. Chem.Phys.2003,118 (20), 9136. Excited-State Symmetries, Excitation Energies, and Oscillator Strengths for the First Four Excited Singlet States of the (010) Ti 2 O 9 H 10 CO 2 Cluster (Carbonatelike Species) Calculated by SAC-CI and TD-DFT using the 6-31G(d) Basis Set a Acknowledgment.V.P.I. thanks Penn State Institutes of Energy and the Environment (PSIEE) for financial support.Computational support was in part provided by the National Science Foundation under Grant No. CHE-0431328 for the Center for Environmental Kinetics Analysis (CEKA) at The Pennsylvania State University.We deeply thank Dr. Michael Janik for his insightful comments on a previous draft of this article.Discussions with Dr. Alexander Mitin helped shape this work.We also thank the Gaussian and Turbomole support teams for clarifying certain aspects of their programs."
  }
]