[
  {
    "title": "Doi",
    "content": "10.1016/j.apsusc.2021.151997"
  },
  {
    "title": "Article_Title",
    "content": "g-C3N4 microtubes@CoNiO2 nanosheets p–n heterojunction with a hierarchical hollow structure for efficient photocatalytic CO2 reduction"
  },
  {
    "title": "Abstract",
    "content": "Carbon nitrides (g-C 3 N 4 ) have emerged as the promising photocatalysts for CO 2 conversion.However, they suffer from inefficient charge transfer and a lack of metal sites.Herein, the p-type CoNiO 2 nanosheets are anchored on the n-type g-C 3 N 4 microtubes to construct p-n heterojunction photocatalysts.The CoNiO 2 nanosheets provide metal sites to bind and activate CO 2 molecules, and the configuration of p-n heterojunction impels electron-hole separation.The CoNiO 2 nanosheets that are vertically aligned on the surfaces of g-C 3 N 4 microtubes build a hierarchical hollow structure and an intimate contact interface, which also contributes to the CO 2 adsorption and rapid migration of charged carriers.As a result, the g-C 3 N 4 CoNiO 2 p-n heterojunction photocatalysts exhibit outstanding yields (3645 mol h -1 g -1 of CO and 943 mol h -1 g -1 of H 2 ) from CO 2 reduction under visible light irradiation, much higher than that of pure CoNiO 2 nanosheets and g-C 3 N 4 microtubes.In situ DRIFT spectra are performed to monitor the intermediates of CO 2 reduction on the surfaces of g-C 3 N 4 CoNiO 2 , the results of which confirm the adsorption and activation of CO 2 molecules.It is expected that this work would provide a feasible strategy for designing high-efficiency g-C 3 N 4 -based heterojunction photocatalysts."
  },
  {
    "title": "Experimental",
    "content": "The g-C 3 N 4 microtubes were prepared through hydrothermalassisted thermal polymerization 41.Briefly, the melamine-cyanuric acid precursors were firstly obtained by hydrothermally treating an aqueous solution (60 mL) of melamine (1 g) at 180 C for 24 h.The asobtained precursors were then calcined at 520 C for 4 h under N 2 atmosphere.The heating rate was set to be 2 C min -1 .Finally, the yellow g-C 3 N 4 was collected and used as a template for growing CoNiO 2 nanosheets. The CoNiO 2 nanosheets were prepared by a two-step method 42.Typically, NiCl 2 6H 2 O (1 mmol) and CoCl 2 6H 2 O (1 mmol) were dissolved in deionized water (60 mL), followed by the addition of hexamethylenetetramine (8.75 mmol).After continuously stirring for 60 min, the resulting reaction solution was treated at 95 C for 5 h in an oil bath.In the second step, the as-obtained samples were calcined at 350 C for 2 h in a muffle furnace.The heating rate was set to be 2 C min -1 . The preparation procedures of g-C 3 N 4 CoNiO 2 were similar to those of CoNiO 2 nanosheets.Typically, g-C 3 N 4 microtubes (40 mg) were dispersed in an aqueous solution (60 mL) of NiCl 2 6H 2 O (1 mmol) and CoCl 2 6H 2 O (1 mmol) under stirring, followed by the addition of hexamethylenetetramine (8.75 mmol).After continuously stirring for min, the resulting reaction solution was treated at 95 C for 5 h in an oil bath.The as-obtained samples were calcined at 350 C for 2 h in a muffle furnace.The heating rate was set to be 2 C min -1 . The crystal phases of samples were determined by X-ray diffraction (XRD, Rigaku Ultima III).The structure and components of samples were analyzed by scanning electron microscopy (SEM, FEI Nova NanoSEM 230), transmission electron microscopy (TEM, JEOL JEM-2100F), and Xray photoelectron spectroscopy (XPS, Thermo Fisher Scientific K-Alpha).The CO 2 adsorption of samples was measured at 298 K on a physisorption analyzer (Micromeritics ASAP 2020).Photoluminescence (PL) spectra were measured on a spectrometer (HORIBA FluoroMax-4) under an excitation wavelength of 500 nm.Electron paramagnetic resonance (EPR) spectra were recorded on a spectrometer (Bruker ELEXSYS E500).In situ diffuse reflectance infrared Fourier transform (DRIFT) spectra (Nicolet 6700) were recorded to monitor the intermediates of CO 2 reduction under light irradiation with a Xenon lamp. Photoelectrochemical measurements were performed in a standard three-electrode quartz cell.Pt and Ag/AgCl electrodes were used as counter and reference electrodes, respectively.FTO glass coated with samples was used as a working electrode.Mott-Schottky plots were measured on an electrochemical workstation (Princeton PARSTAT MC) in the Na 2 SO 4 aqueous solution (0.2 mol L -1 ).The photocurrent density was measured on an electrochemical analyzer (Shanghai CH Instruments CHI660E) in a mixed solution of acetonitrile, deionized water, and triethanolamine in the presence of Ru(bpy) 3 Cl 2 6H 2 O (bpy 2,2bipyridine) when the sample was irradiated with a Xenon lamp.Electrochemical impedance spectroscopy (EIS) plots were measured on an electrochemical workstation (USA Princeton PARSTAT MC) in an aqueous solution of K 3 Fe(CN) 6 (5 mmol L -1 ), K 4 Fe(CN) 6 (5 mmol L -1 ), and KCl (0.1 mol L -1 ). Photocatalytic CO 2 reduction was performed in a closed Quartz reactor.The g-C 3 N 4 CoNiO 2 (2 mg) and Ru(bpy) 3 Cl 2 6H 2 O (8 mg) were dispersed in a mixed solution of acetonitrile (3 mL), deionized water (2 mL), and triethanolamine (1 mL).The reactor was vacuum degassed and then inflated with CO 2 for 30 min.The Xenon lamp with a cutoff filter ( 420 nm) was used as a light source.The reaction temperature was controlled at 30 C. The gas products from CO reduction were detected and quantified by gas chromatography (Agilent 7890B).The isotopic labeling experiment was performed under similar photocatalytic conditions, but 13 CO 2 instead of CO 2 was used as a gas source.The reduction products in the isotopic labeling experiment were detected by gas chromatograph-mass spectrometer (GC-MS, Agilent 7890B-5977B)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Fig. 1 shows the preparation processes of the g-C 3 N 4 CoNiO 2 p-n heterojunction.Initially, the melamine-cyanuric acid precursors were prepared through supramolecular self-assembly under hydrothermal treatment.The g-C 3 N 4 samples with a hollow tubular structure are obtained after calcination of the as-prepared melamine-cyanuric acid precursors (Fig. 2a).The g-C 3 N 4 microtubes have different sizes in length and diameter.The maximum length and diameter of g-C 3 N 4 microtubes can be more than 50 m and 5 m, respectively (Fig. S1a). TEM image shows the high transparency of the g-C 3 N 4 microtubes (Fig. S1b), suggesting ultrathin thickness of walls.The ultrathin walls are expected to decrease the migration pathway of charged carriers, thus accelerating electron transfer.The hollow structure of the g-C 3 N 4 microtubes makes the inner and outer surfaces available for subsequent growth of CoNiO 2 . A two-step method is used to grow CoNiO 2 nanosheets on g-C 3 N 4 microtubes (Fig. 1).In the first step, the NiCo-layered double hydroxide (LDH) nanosheets are in situ grown on the surfaces of the g-C 3 N 4 microtubes.As shown in Fig. 2b, both the inner and outer surfaces of g-C 3 N 4 microtubes are homogeneously covered by NiCo-LDH nanosheets.The NiCo-LDH nanosheets are vertically aligned on the g-C 3 N 4 microtubes, building a hierarchical structure.XRD pattern of g-C 3 N 4 NiCo-LDH can be indexed into a hydrotalcite phase (JCPDS 14-0191), indicating the successful growth of NiCo-LDH (Fig. S2).In the second step, the NiCo-LDH nanosheets on the g-C 3 N 4 microtubes were transformed to CoNiO 2 nanosheets through calcination treatment.The hierarchical hollow structure of g-C 3 N 4 CoNiO 2 keeps almost unchanged compared to the g-C 3 N 4 NiCo-LDH precursors (Fig. 2c), indicating the high thermal stability of g-C 3 N 4 microtubes.The high-magnification SEM image confirms the presence of the CoNiO 2 nanosheets on the inner and outer surfaces of g-C 3 N 4 microtubes (Fig. S3).The pure CoNiO 2 samples are also prepared in the absence of the g-C 3 N 4 microtubes.The CoNiO 2 nanosheets with good dispersion are observed in the SEM and TEM images (Fig. S4a,c).Some of them show a hexagonal structure, which is a typical morphology of LDH materials.The highmagnification SEM and TEM images exhibit that the CoNiO 2 nanosheets are constructed by many small particles (Fig. S4b,d), indicating the collapse of the pristine NiCo-LDH. The detailed structural information of g-C 3 N 4 CoNiO 2 was revealed by TEM images.As shown in Fig. 2d, the CoNiO 2 nanosheets covered on the surfaces of the g-C 3 N 4 microtubes make the samples dark under TEM observation.The vertically aligned CoNiO 2 nanosheets can be observed from the high-magnification TEM image (Fig. 2e).The high-resolution TEM (HRTEM) image shows the clear lattice fringes (Fig. 2f).The interplanar spacings are measured to be 0.21 and 0.24 nm, matching with (2 0 0) and (1 1 1) planes of CoNiO 2 , respectively.The elemental mappings display the presence of C, N, Co, Ni, and O (Fig. 2g).These elements are homogeneous distribution in g-C 3 N 4 CoNiO 2 .Moreover, the C and N elements are wrapped by the Co, Ni, and O elements, indicating the core/shell structure of g-C 3 N 4 CoNiO 2 . XRD patterns are used to determine the crystal phase of samples.As shown in Fig. 3a, a dominant peak at 27.1 in the XRD pattern of g-C 3 N 4 microtubes corresponds to (0 0 2) planes, which is assigned to interlayer stacking of g-C 3 N 4 37.Three peaks at 36.9 3e, the Co 2p spectra show the presence of two kinds of Co species.The peaks at 794.9 and 779.5 eV are assigned to Co 3 , and the peaks at 796.5 and 781.6 eV are assigned to Co 2 .Similarly, four peaks along with two satellite peaks are observed in the Ni 2p spectra (Fig. 3f).The characteristic peaks of Ni 3 can be observed at 873.3 and 855.5 eV, and the peaks of Ni 2 are located at 871.3 and 853.7 eV.XPS results manifest that metal ions in CoNiO 2 nanosheets have multiple valence states, making themselves rich in active sites for photocatalysis 47,48. The photocatalytic performance is evaluated in a closed reactor under CO 2 atmosphere.The photosensitizer Ru(bpy) 3 2 is used to enhance light harvesting and provide additional reductive electrons.As shown in Fig. 4a, the generation rates of CO and H 2 over the pure g-C 3 N are just 698 and 458 mol h -1 g -1 , respectively.The electrons and holes are easily recombined over the pure g-C 3 N 4 microtubes, which greatly decreases the amount of available reductive electrons.Moreover, a lack of metal sites makes g-C 3 N 4 difficult to capture CO 2 molecules and accept electrons.These factors determine the low photocatalytic activity of the pure g-C 3 N 4 microtubes in CO 2 reduction.Benefiting from the metal ions with multiple valence states, CoNiO 2 nanosheets afford high generation rates of CO (1635 mol h -1 g -1 ) and H 2 (225 mol h -1 g -1 ), as shown in Fig. 4a.The photocatalytic performance of the pure g-C 3 N microtubes and CoNiO 2 nanosheets can be further improved after constructing p-n heterojunction.Large amounts of CO (3645 mol h -1 g -1 ) and H 2 (943 mol h -1 g -1 ) are produced over the g-C 3 N 4 CoNiO 2 p-n heterojunction.The catalytic activities of the g-C 3 N 4 CoNiO 2 samples with different g-C 3 N 4 contents are measured and shown in Fig. S5.The gas generation rate slightly increases with the g-C 3 N 4 contents.Considering the moderate catalytic activity and dosage of g-C 3 N 4 , the g-C 3 N 4 CoNiO 2 sample with 40 mg of g-C 3 N 4 is selected for studies in this work. The gas yields of CO and H 2 as a function of photocatalytic time over g-C 3 N 4 CoNiO 2 are shown in Fig. 4b.The gas yields increase gradually, demonstrating the high stability of the sample.The accumulative yields of CO and H 2 during 4-h photocatalysis are up to 11,555 and 2670 mol h -1 g -1 , respectively.The generation rates are still maintained at mol h -1 g -1 for CO and 668 mol h -1 g -1 at this time.The stability of g- C 3 N 4 CoNiO 2 is further confirmed by the cycling experiment (Fig. 4c).There is a slight decline in gas generation rate after 4 cycles, which may be ascribed to the mass loss of the sample during the cycling experiment.The g-C 3 N 4 CoNiO 2 sample after photocatalysis is collected for XRD analysis.As shown in Fig. S6, the similar XRD patterns indicate the structural integrity of the sample after photocatalysis.SEM image also shows that the CoNiO 2 nanosheets are firmly attached to the surfaces of the g-C 3 N 4 microtubes after photocatalysis (Fig. S7).In addition, the 13 CO 2 isotopic labeling experiment is performed to determine the carbon source of CO.As shown in Fig. 4d, a dominant signal that is assigned to 13 CO is observed in the mass spectrum, which indicates that CO is mainly produced from CO 2 rather than other potential organic species. As aforementioned, the pure g-C 3 N 4 suffers from inefficient charge separation and transfer and insufficient CO 2 adsorption.Photoelectrochemical measurements and CO 2 adsorption isotherms are performed to elucidate the enhancement of these two properties in the g-C 3 N 4 CoNiO 2 p-n heterojunction.As shown in Fig. 5a, the PL spectrum of the photosensitizer Ru(bpy) 3 2 shows a strong emission peak, which is ascribed to serious recombination of electrons and holes.After introducing g-C 3 N 4 microtubes, PL quenching is observed, indicating the efficient electron-hole separation between Ru(bpy) 3 2 and g-C 3 N 4 .The intensity of emission peak is much lower after anchoring CoNiO 2 nanosheets on g-C 3 N 4 microtubes, which suggests that the construction of p-n heterojunction can further suppress the charge recombination.The efficient charge separation is expected to accelerate the electron transfer, as confirmed by photocurrent response.As shown in Fig. 5b, all samples display photocurrent response during light on-off cycles.The photocurrent is produced by the directional movement of electrons under light irradiation.The largest photocurrent density of g-C 3 N 4 CoNiO 2 manifests the most efficient electron transfer.The interfacial charge transfer resistance is evaluated by EIS plots (Fig. 5c).The radius of a semicircle of g-C 3 N 4 CoNiO 2 is much smaller than that of the pure g-C 3 N 4 and CoNiO 2 , demonstrating that the construction of p-n heterojunction greatly decreases charge transfer resistance.The CO 2 adsorption isotherms are shown in Fig. 5d.As expected, the g-C 3 N 4 microtubes without metal sites barely capture CO 2 molecules.The CO 2 adsorption quantity is just 2.34 cm g -1 .By contrast, the CoNiO 2 nanosheets show much better CO 2 uptake ability (3.76 cm g -1 ).Benefiting from strong CO 2 adsorption of CoNiO 2 nanosheets and hierarchical hollow structure, the CO 2 adsorption quantity of g-C 3 N 4 CoNiO 2 is improved to 4.19 cm g -1 .These results demonstrate that both the charge transfer and CO 2 adsorption of the p-type g-C 3 N 4 microtubes can be significantly enhanced by anchoring n-type CoNiO 2 nanosheets, which is responsible for the boosted photocatalytic CO 2 reduction. The possible charge transfer route of g-C 3 N 4 CoNiO 2 p-n heterojunction is studied.The semiconductor types are firstly revealed by Mott-Schottky plots.The negative slope suggests that the CoNiO nanosheets are p-type semiconductors (Fig. S8), and the positive slope suggests that the g-C 3 N 4 microtubes are n-type semiconductors reported elsewhere 37,49.Then the optical bandgap of the CoNiO 2 nanosheets is determined to be 1.74 eV by Tauc plots (Fig. S9), and that of the g-C 3 N 4 microtubes is 2.82 eV according to the literature 37.The XPS valence band spectra show that the valence band (VB) energy levels of the CoNiO 2 nanosheets and g-C 3 N 4 microtubes are 0.60 and 2.10 eV, respectively (Fig. S10).Therefore, the conduction band (CB) positions the CoNiO 2 nanosheets and g-C 3 N 4 microtubes are determined to be -1.14 and -0.72 eV, respectively.The band structures of CoNiO 2 and g-C 3 N 4 can be obtained and showed in Fig. 6a.When they contact each other, the electrons flow from n-type g-C 3 N 4 to p-type CoNiO 2 , and simultaneously the holes flow in an opposite position until the Fermi levels (E F ) reach equilibrium (Fig. 6b) 33.Consequently, a built-in electric field is formed near interfaces of p-n heterojunction 48.Under light irradiation, both CoNiO 2 and g-C 3 N 4 are excited to produce electrons and holes (Fig. 6c).The built-in field and Coulomb interaction accelerate the recombinantion of holes from CoNiO 2 and electrons from g-C 3 N 4 44,45.Finally, the reductive electrons remaining in CoNiO convert CO 2 and H 2 O to CO and H 2 , and the holes remaining in g-C 3 N are consumed by triethanolamine.The EPR results confirm the charge transfer pathway.As shown in Fig. S11, the almost identical signals of DMPO- O 2-between CoNiO 2 and g-C 3 N 4 CoNiO 2 suggest that the photogenerated electrons stay in the CB of CoNiO 2 .Therefore, the charge transfer mechanism of the g-C 3 N 4 CoNiO 2 p-n heterojunction follows the Z-scheme mechanism. To gain a deep insight into the reduction process on the surfaces of g-C 3 N 4 CoNiO 2 , in situ DRIFT spectra are performed.As shown in Fig. 7a bands with irradiation time support that the CO 2 molecules are adsorbed and reduced on the surfaces of g-C 3 N 4 CoNiO 2 ."
  },
  {
    "title": "Conclusions",
    "content": "In conclusion, a kind of p-n heterojunction with a hierarchical hollow structure is successfully prepared by anchoring p-type CoNiO 2 nanosheets on n-type g-C 3 N 4 microtubes through a two-step method.The introduction of CoNiO 2 nanosheets brings the following benefits: (1) the CO 2 capture of g-C 3 N 4 is enhanced due to rich metal sites of CoNiO 2 ; (2) the vertically aligned nanosheets build a hierarchical structure, which increases active sites to accept photogenerated electrons; (3) the built-in electric field is spontaneously produced because of the formation of p-n junctions, which is favorable for the separation of electrons and holes; and (4) in situ growth of CoNiO 2 nanosheets makes the contact interface intimate, which reduces the distance of charge transfer.As a result, the efficiency of photocatalytic CO 2 reduction for the g-C 3 N 4 CoNiO 2 p-n heterojunction is greatly improved compared to the pure g-C 3 N 4 and CoNiO 2 .This work is expected to provide an instructive guideline for constructing high-performance heterojunction photocatalysts. Fei-Fei Chen: Methodology, Data curation, Formal analysis, Funding acquisition, Writingoriginal draft.Junbin Chen: Formal analysis.Lingyun Li: Formal analysis.Feng Peng: Conceptualization, Formal analysis, Writingreview editing.Yan Yu: Conceptualization, Formal analysis, Funding acquisition, Writingreview editing. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Fig. 1.Schematic illustration of preparation processes of the g-C 3 N 4 CoNiO 2 p-n heterojunction with a hierarchical structure. Fig. 2. SEM images of (a) g-C 3 N 4 , (b) g-C 3 N 4 NiCo-LDH and (c) g-C 3 N 4 CoNiO 2 .(d, e) TEM images, (f) HRTEM image and (g) elemental mappings of g-C 3 N 4 CoNiO 2 . , 43.1 , and 62.5 in the XRD pattern of CoNiO 2 match with (1 1 1), (2 0 0), and (2 2 0) planes of CoNiO 2 (JCPDS 10-0188).XRD pattern of g-C 3 N 4 CoNiO 2 shows the characteristic peaks of CoNiO 2 .The diffraction peaks of g-C 3 N 4 are not as strong as that of CoNiO 2 , which mainly results from the coverage of the CoNiO 2 nanosheets on the g-C 3 N 4 microtubes.The chemical states are analyzed by XPS spectra.The XPS survey spectra of g-C 3 N 4 , CoNiO 2 , and g-C 3 N 4 CoNiO 2 samples are shown in Fig. 3b.The signals of C 1s, N 1s, Co 2p, Ni 2p, and O 1s can be detected for g-C 3 N 4 CoNiO 2 .The C 1s spectrum of g-C 3 N 4 can be deconvoluted to two peaks at 288.0 and 284.4 eV (Fig. 3c), corresponding to the sp 2bonded carbon (N-C--N) and graphitic carbon (C-C), respectively 43.Owning to the coverage of CoNiO 2 , the C 1s spectrum of g-C 3 N 4 CoNiO 2 shows a lower peak intensity of N-C--N.Moreover, the N -C--N peak shifts to 287.3 eV, which is caused by charge transfer at the interface of g-C 3 N 4 and CoNiO 2 44,45.The N 1s spectrum of g-C 3 N 4 is shown in Fig. 3d.Four peaks are identified at binding energies of 404.4,401.1, 400.0, and 398.5 eV, which are assigned to the -excitation of C -N, amino groups, tertiary N -(C) 3 , and C -N--C 46, respectively.The slight negative shift of C-N--C peak (398.2 eV) in the N 1s spectrum of g-C 3 N 4 CoNiO 2 is also ascribed to the interfacial charge transfer.As shown in Fig. Fig. 3. (a) XRD patterns and (b) XPS survey spectra of g-C 3 N 4 , CoNiO 2 , and g-C 3 N 4 CoNiO 2 .HRXPS spectra of (c) C 1s, (d) N 1s, (e) Co 2p and (f) Ni 2p. .-F.Chen et al. Fig. 4. (a) Gas generation rate over different samples after 2-h photocatalysis.(b) Time course of gas yield over g-C 3 N 4 CoNiO 2 .(c) Cycling stability of g-C 3 N 4 CoNiO 2 .(d) Mass spectrum of gas products in isotopic labeling experiment. Fig. 5. (a) PL spectra.(b) Photocurrent response.(c) EIS plots.(d) CO 2 adsorption isotherms. .-F.Chen et al. Fig. 6.(a) Band structures of g-C 3 N 4 and CoNiO 2 .(b, c) Possible charge transfer route of g-C 3 N 4 CoNiO 2 p-n heterojunction. .-F.Chen et al. Fig. 7. (a) In situ DRIFT spectra of g-C 3 N 4 CoNiO 2 under light irradiation with different time.(b) Region of CO 2 fingerprint modes. .-F.Chen et al. This work was supported by the National Key Research and Development Program of China (2020YFA0710303), and National Natural Science Foundation of China (U1905215, 52072076, 52002072). Supplementary data to this article can be found online at https://doi.org/10.1016/j.apsusc.2021.151997."
  }
]