[
  {
    "title": "Doi",
    "content": "10.1007/s10562-021-03554-3"
  },
  {
    "title": "Article_Title",
    "content": "Plasmonic Ag Nanoparticles Decorated Acid-Aching Carbon Fibers for Enhanced Photocatalytic Reduction of CO2 into CH3OH Under Visible-Light Irradiation"
  },
  {
    "title": "Abstract",
    "content": "In this work, acid-ached carbon fibers decorated by plasmonic Ag nanoparticles (denoted as Ag NPs/ACFs) were facile fabricated and acted as photocatalyst to convert CO 2 into high value-added CH 3 OH.Such photocatalyst afforded a CH 3 OH evolution rate of 13.9 mol g -1 h -1 without any sacrifice reagent under visible light ( 420 nm), which is 2.5 times higher than that of Ag NPs/CFs (5.5 mol g -1 h -1 ).This excellent performance is ascribed to the accelerated e -/h pairs separation and a strong interaction between Ag NPs and carbon fibers resulted by the generation of more oxygen-containing functional groups on carbon fibers, which is caused by acid acid-aching.This study may provide an important reference for plasmonic photocatalyst in potential photocatalytic applications."
  },
  {
    "title": "Experimental",
    "content": "The carbon fibers (diameter 150 nm) were produced at the Showa Denko in Japan.Nitric acid (HNO 3 , 65-68) was provided by Xilong Science and Technology Co., Ltd.The silver nitrate (AgNO 3 , purity 99.8) was purchased from Sinopharm Chemical Reagent Co., Ltd.Polyvinylpyrrolidone (PVP, M w 5800) was purchased from Sigma Aldrich.All chemical reagents were of analytical grade and used without further purification. 1 g carbon fibers were immersed in 60 mL concentrated HNO 3 (16 M), which was stirred at 40 C for 4 h.Then the mixture was washed with deionized water and dried under ambient conditions to achieve the acid-aching carbon fibers (ACFs). The Ag NPs/ACFs was prepared via solution dipping coupled with a modified ultrasonic method as the previous report 9, where silver nitrate was used as the precursor for preparing the Ag NPs, and polyvinylpyrrolidone served as the stabilizer.In detail, 50 mL 0.2 M silver nitrate solution was prepared, and 200 mg of the as-prepared ACFs were added into the solutions.The suspension was ultrasonically treated using a cell breaker for 1 h, accompanying with 5 wt of PVP aqueous solution adding slowly.The above suspension continues to be ultrasonically treated for 1 h.After ultrasonic treatment, the suspension was put into water bath with 80 C and stirred for 3 h.The color of the suspension changed from dark to brown.Finally, the suspension was washed by DI water, and dried under ambient conditions for 24 h to obtain Ag NPs/ACFs.The preparation process is illustrated in Scheme 1.The Ag NPs/ CFs were prepared by the same methods using CFs as raw material. X-ray diffractometer (XRD) patterns were recorded on a Bruker powder diffractometer using Cu K radiation source ( 1.54184A, 40 kV and 30 mA) with the scanning rate of 8/min in the 2 range of 10-80.Fouriertransform infrared (FT-IR) spectra were performed on a Nicolet iS10 spectrometer in the wavenumber range of 400 cm -1 -4000 cm -1 to determine the surface functionalized groups.The UV-vis diffuse reflectance spectra (DRS) were measured on a Shimadzu UV-2600 UV-vis spectrophotometer at wavelengths range of 220-800 nm by using BaSO 4 as a reference.X-ray photoelectron spectroscopy (XPS) were determined by a Thermo-VG Scientific Escalab 250 spectrometer to obtain the chemical state of the element and bonding manner.Elemental analysis of samples was analyzed by a Perkin Elmer inductive coupled plasma emission spectrometer (ICP-OES).TEM and HR-TEM (JEOL-2010) were performed to reveal the surface microstructures and the lattice fringe of as-prepared samples.The electrochemistry impedance spectroscopy (EIS), Mott-Schottky (MS) and photocurrent measurements (i-t curve) were carried out on an electrochemical workstation (CHI 760E) by three-electrode system in a quartz cell.Platinum electrode and Ag/AgCl electrode were served as the counter electrode and the reference electrode, respectively, and a 0.5 mol L -1 Na 2 SO 4 solution was used as the electrolyte.A sample uniformly coated on ITO glass used as the working electrode.All the experiments were performed under a 300 W Xe irradiation. The photocatalytic reduction of CO 2 was carried out in an autoclave with a quartz window at the top (Anhui Kemi Machinery Technology Co., Ltd., China), and the diagram of the reaction device was shown in Fig. S1.The typical experimental was performed under the illumination of a 300 W Xe light with a 420 nm cutoff.Detailly, 15 mg of the photocatalyst with 20 mL deionized water was added into a polytetrafluoroethylene inner tank of the autoclave firstly.Then, the autoclave was evacuated and blown with high-purity CO 2 for several times to remove the air.Then, the high-purity CO 2 was filled into the reactor to reach a pressure of 0.6 MPa and the temperature was controlled at 80 C by circulating water.Prior to the irradiation, the reaction was stirred at dark for 30 min to achieve the adsorption-desorption equilibrium of CO 2 on the catalyst active sites.Finally, the light reaction was carried out under stirring.After irradiation for 8 h, the produced gas was injected into a gas chromatograph (GC 9860), and an FID equipped with a Al 2 O 3 capillary column (PEG-20 M, 30 m 0.32 mm 0.5 m) and reformer were used for quantitative analysis of CO and CH 4 concentrations.The liquid products (CH 3 OH) were vaporized at 80 C in a headspace autosampler (AHS-12A) and then determined by the above gas chromatography.The computational process of CO, CH 4 and CH 3 OH production rates were shown in the supporting information."
  },
  {
    "title": "Results_and_Discussion",
    "content": "X-ray diffraction patterns of CFs, ACFs, Ag NPs/CFs and Ag NPs/ACFs are shown in Fig. 1a.All four samples present three reflection peaks at 2 angle of 26.3, 42.5 and 77.5, which are corresponded to the typical structure of graphite in carbon fibers 25.Peaks at 2 angle of 38.0, 44.4 and 64.5 are indexed to (111), ( 200) and (220) planes of Ag crystals, respectively, manifesting the formation of Ag nanocrystals in Ag NPs/CFs and Ag NPs/ACFs 22,26. FT-IR spectra of CFs, ACFs, Ag NPs/CFs and Ag NPs/ ACFs in the range from 400 to 4000 cm -1 are depicted in Fig. 1b, in which the distribution of functional groups upon these samples could be observed clearly.All catalysts afford an intense and broad band centered at 3443 cm -1 , which can be corresponded to the stretching vibrations of -OH Scheme 1 Preparation process of Ag NPs/ACFs photocatalyst groups in the adsorbed H 2 O by carbon samples.The intense band at 1627 cm -1 is assigned to carbonyl groups (CO or -COOH) or CO in a six-membered ring or aromatic ring 27.Band at 1397 cm -1 can be associated with the bending in-plane -OH vibrations of -COOH 15.The weak band at 2929 cm -1 and 2859 cm -1 can be assigned to the vibration of methyl (-CH 3 )/methylene (-CH 2 -), respectively 28.The broad bands presented in the catalysts between 1300 cm -1 and 900 cm -1 are due to the stretching C-O vibrations 29.In comparison with the CFs and Ag NPs/CFs, the intensity of the vibration peaks corresponding oxygen-containing functional groups (3443 cm -1 , 1627 cm -1 , 1397 cm -1 and the peaks between 1300 cm -1 and 900 cm -1 ) for ACFs and Ag NPs/ACFs are significantly enhanced, indicating that acid etching is an efficient way to introduce or increase functional groups (carboxyl, hydroxyl and carbonyl) onto carbon fibers, which could become effective adsorption sites 30,31 and further affect the catalytic performance. TEM were carried out to give insight for the microstructures over the Ag NPs/CFs and Ag NPs/ACFs.For Ag NPs/ CFs, carbon fibers have smooth surface with some Ag nanoparticles anchoring (Fig. 2a).In case of Ag NPs/ACFs, the carbon matrix seems a little rough, which should be profit from acid aching treatment (Fig. 2b).Remarkably, silver nanoparticles are uniform in size for Ag NPs/ACFs, with a diameter of approximately 30 nm (Fig. 2c,d).In contrast, silver nanoparticles in Ag NPs/CFs range in size from 2 to 50 nm.Interestingly, many silver species have been embedded inside the carbon matrix of Ag NPs/ACFs, which may be attributed to the special surface microstructure after acid aching treatment.Given the abovementioned facts and combined the FTIR analysis, it can be deduced that acid aching can introduce oxygen-containing functional groups onto carbon fiber surface, which might be beneficial for the anchoring of Ag species on carbon matrix.Meanwhile, the tight binding of carbon materials with Ag nanoparticles may promote the transfer of photogenerated electrons and holes and thus improving the photocatalytic performance. High resolution TEM (HR-TEM) was adopted to reveal the lattice fringe of the Ag NPs/CFs and the results are presented in Fig. 2e.The lattice fringe corresponding to carbon and Ag NPs can be clearly observed.These results further confirm the successful analysis of Ag NPs/ACFs. The surface structure and compositions on the as-prepared Ag NPs/CFs and Ag NPs/ACFs were checked by XPS measurements.The XPS spectra of C1s, O1s and Ag3d are exhibited in Fig. 3 and the percentages of C, O and Ag as well as the concentrations of functional groups presented in the two samples are summarized in Table 1. Based on Table 1 and Fig. 3a, the Ag NPs/CFs contains 90.59 carbon, 8.01 oxygen and 1.40 Ag, while the Ag NPs/ACFs contains 85.89 carbon, 11.61 oxygen and 2.49 silver.The silver content in Ag NPs/CFs is approximately in line with the ICP results.However, more silver species can be determined by ICP-OES than XPS for Ag NPs/ACFs, which might be attributed to that many silver species are anchored inside the carbon fibers, which are well agreement with the TEM results.The content of oxygen and silver in the Ag NPs/ACFs is significantly increased in comparison with Ag NPs/CFs, further proving that acid etching increases the oxygen-containing functional groups and can provide favorable microenvironment for anchoring more metal nanoparticles. By performing a peak fitting deconvolution, the C1s spectra (Fig. 3b) can be splitted into three characteristic peaks at approximately 284.7, 285.7 and 287.1 eV, which corresponds to sp 2 CC, C-OH and CO, respectively 32,33.By combining the data in The O1s spectra for the two samples are recorded and fitted into two peaks as presented in Fig. 3c.The sub-bank peaks located at the higher binding energy approximately 532 eV could be corresponded to the oxygen in -C O and the peaks at the lower binding energy approximately 531 eV should be attributed to the oxygen in -C-O 34.According to Table 1, the Ag NPs/CFs contains 45.4 CO and 54.6 C-O while the Ag NPs/ACFs contains 35.7 CO and 64.3 C-O.As reported, the Ag derived from aqueous AgNO 3 solution was first stably anchored on the -OH groups of the carbon surface via the ion-dipole interaction due to the high affinity toward oxygen 35.Most of O in C-OH group should be one of the reasons for more silver content in Ag NPs/ACFs.In case of comparing the peak position of Ag NPs/ACFs with Ag NPs/CFs, a slight shift to higher binding energies can be observed clearly, which could be considered as the decreased electron cloud density and the weakened shielding effect, hinting the changes of microenvironment around the oxygen-containing functional groups and the different interaction between Ag species and carbon. The Ag 3d region in Fig. 3d gives two characteristic bands at 368.7 and 374.7 eV, which can correspond to the typical Ag 3d 5/2 and Ag 3d 3/2 binding energies of metallic Ag 0 species, respectively 36.Ag species are existed in the both Ag NPs/CFs and Ag NPs/ACFs, and both of which are in the form of Ag nanoparticles rather than Ag 2 O or other species, conceding with the results of XRD patterns. Overall, Ag NPs/ACFs exhibits more polarized oxygencontaining functional groups than Ag NPs/CFs, which is in favor of the transformation from Ag into Ag nanoparticles and further results in the more loaded Ag nanoparticles on carbon fibers.Meanwhile, the microenvironment and the interaction between Ag species and carbon in Ag NPs/ACFs should be a little different from Ag NPs/CFs, which might induce a different catalytic performance. The photocatalytic reduction of CO 2 was evaluated under visible light ( 420 nm) irradiation at 80 C and H 2 O was served as photo-induced holes' acceptor.As revealed in Fig. 4, CH 3 OH is the predominant product over these photocatalysts with very little CO and CH 4 generating, which can be explained from two perspectives.Firstly, the production of CO and CH 3 OH obey the following Eqs.( 1) and ( 2), respectively: (1) The volume of the reaction system tends to decrease under high-pressure condition, thus CH 3 OH is easier produced owing to its good solubility in water.Secondly, different from the production of CO or CH 4 , the reaction (2) can move in the direction of CH 3 OH production continuously once CH 3 OH dissolving. From Fig. 4, it also can be seen that CFs shows very low photocatalytic efficiency with only 0.89 mol g -1 h -1 CH 3 OH production rates, which is slightly enhanced after acid etching and achieved a production rate of 1.23 mol g -1 h -1 for ACFs.After Ag species anchoring on carbon fibers, the photocatalytic efficiency is significantly improved.Apparently, the Ag NPs/ACFs exhibits the highest photocatalytic activity (13.9 mol g -1 h -1 ), which is 2.5 times higher than that of Ag NPs/CFs.Considering the results achieved in TEM, XPS and FTIR, it can be speculated acid treatment has optimized the surface structure of carbon fibers, generating more oxygen-containing functional groups, producing more Ag species anchoring or embedding inside the carbon fibers, which could induce favorable interaction between Ag with carbon and might result in an enhanced photocatalytic activity.Additionally, the CH 3 OH production of Ag NPs/ACFs is also higher than that of the reported photocatalysts shown in Table 2. To investigate the stability of the prepared Ag NPs/ACFs, photocatalytic CO 2 reduction for 5-run recycling experiments was carried out and the results are given in Fig. 5.The production rates of CH 3 OH almost remained unchanged after 5 cycles, confirming their favourable photostability.The structure of these catalysts before and after photoreduction tests were also inspected in Fig. S2.The typical structure of Ag NPs/ACFs was remined, manifesting their structural stability and durability for practical applications. To verify the origin of the produced CH 3 OH, a blank experiment under N 2 atmosphere was carried out over Ag NPs/ACFs (Fig. 6).No product was detected during the 8 h, proving that the carbon source was completely from the input CO 2 .Besides, another control experiment was also carried out as presented in Fig. 6, under the condition of dark at 25 C or 80 C, no CH 3 OH was produced, which confirmed that both the light irradiation and suitable temperature were essential for CO 2 photoreduction. UV-DRS was performed to determine the optical performance of CFs, ACFs, Ag NPs/CFs and Ag NPs/ACFs and the results were presented in Fig. 7A.It is obvious that all samples exhibit excellent photo-absorption ability in a broad region from 300 to 800 nm possibly due to the black color of CFs.This phenomenon was well conceding with the previous reports 15,42.Compared with CFs, the ACFs shows stronger absorption in the visible light region, which can be attributed to the optimization of the surface texture of carbon fibers from acid aching.After Ag NPs loading, the intensity of the absorption peaks increases dramatically, which is due to LSPR absorption of Ag-NPs 43.It's worth noting that Ag NPs/ACFs shows stronger absorption than Ag NPs/CFs at more than 500 nm, which possibly means the enhanced adsorption for the photoreduction of CO 2 and thereby presents higher activity in the photocatalysis.The electrochemical impedance spectroscopy is considered as a powerful tool for examining the separation efficiency of photogeneration e -/h pairs.The Nyquist impedance spectra of CFs, ACFs, Ag NPs/CFs and Ag NPs/ACFs are presented in Fig. 7B.As widely known that a smaller arc radius of EIS Nyquist curve means a lower charge transfer resistance across the surface of photoelectrodes, which can further achieve more effective separation of e -/h pairs and low interfacial resistance.There is no obvious arc radius in the Nyquist curves of CFs and ACFs, which may be ascribed to the conductor properties of the two samples.However, the arc radius of the Nyquist curves is appeared after Ag NPs loading, manifesting that Ag NPs loading increase the electron transfer resistance, which is well accordance with the previous report 15.It is verified that Ag NPs/ACFs has smaller arc radius than Ag NPs/CFs, indicating a more effective separation of the photoelectron-hole pairs and a lower charge transfer resistance across the surface of Ag NPs/ACFs than Ag NPs/CFs, which can be responsible for the better photocatalytic performance. The transient photocurrent response is another technique to reflect the recombination rate of e -/h pairs, which is performed under visible light irradiation with several on-off cycles and the results also supported the above outcomes (Fig. 7c).Ag NPs/CFs and Ag NPs/ACFs present remarkably enhanced photocurrent than CFs and ACFs.It is reasonable conjectured that Ag NPs loading might endow carbon fibers with semiconductor properties.In the Ag NPs/CFs and Ag NPs/ACFs system, it was reported that Ag can generate plasmon-excited electrons and hole under visible light irradiation, thereby playing critical role of electron donor.Correspondingly, CFs or ACFs act as the electron acceptors.The plasmon-excited electrons transferred from silver to carbon fibers, and the hole is remained, thus achieving the separation of electrons and holes in space, and promoting the photocatalytic activity.This process is as shown in Fig. 7d.44 More importantly, the Ag NPs/ACFs shows higher photocurrent value in comparison with Ag NPs/CFs, designating the more efficient charge carrier's separation and transfer of Ag NPs/ACFs than Ag NPs/CFs.As reported, the Plasmonexcited electrons transfer to the CFs by the interface between Ag NPs and CFs or some linkage bond.Therefore, the more oxygen-containing functional group (such as -OH) induced by acid aching may be responsible for the better charge carrier's separation and transfer performance.All above results demonstrate that the Ag NPs/ACFs has enhanced light absorption, improved separation and transfer of photogeneration charge.The band structure of Ag NPs/ ACFs was further inspected by UV-DRS and Mott-Schottky measurements (Fig. S3 and Fig. S4).According to Fig. S3, the band gap energy (Eg) of Ag NPs/ACFs is approximately 1.75 eV.Meanwhile, MS curve shows the flat band potential of Ag NPs/ACFs is -0.75 eV.This value can be translated into conduction band potential (CB) and the calculation process was shown in supporting information.The valence band potential can be further obtained based on the results of CB and Eg.The resultant band structure was exhibited in Table S1.CB value of Ag NPs/ACFs is -0.75 eV, which is located above the redox potentials of the CH 3 OH/CO 2 couples.Thus, from a thermodynamic viewpoint, Ag NPs/ ACFs can be photoexcited and then convert CO 2 into CO, CH 4 and CH 3 OH."
  },
  {
    "title": "Conclusions",
    "content": "Ag NPs/ACFs plasmonic photocatalyst has been successfully prepared through an acid aching process coupled with an ultrasonic treatment.The resultant Ag NPs/ACFs behaved a much higher CH 3 OH yield than Ag NPs/CFs.The increased oxygen-containing functional group, the favorable microstructure and interaction between Ag NPs and carbon, and the accelerated e -/h pairs separation should be responsible for the significant enhancements.This study will promote new developments in plasmonic photocatalyst to solve environmental issues. Fig. 1 Structural characterizations of CFs, ACFs, Ag NPs/CFs and Ag NPs/ACFs.a XRD patterns; b FTIR spectra Fig. 2 TEM images of a Ag NPs/CFs, b and c Ag NPs/ACFs; d Distribution of partical size; e HR-TEM of Ag NPs/ACFs Fig. 3 a XPS survey spectra of Ag NPs/CFs and Ag NPs/ACFs; XPS spectra of b C1s, c O1s, and d Ag 3d in the Ag NPs/CFs and Ag NPs/ACFs. Fig. 4 Photocatalytic activities of CFs, ACFs, Ag NPs/CFs and Ag NPs/ACFs towards CO, CH 4 and CH 3 OH Fig. 7 UV-vis diffuse-reflectance spectra (a); EIS Nyquist plots (b); Photocurrent density profiles (c) of photocatalysts; Possible mechanisms of photocatalytic CO 2 reduction (d) the Ag NPs/CFs contains 80.2 CC, 11.4 C-OH and 8.4 CO, whereas the Ag NPs/ACFs contains 70.4 CC, 19.2 C-OH and 10.4 CO groups.Clearly, the polar Concentrations of different atoms and functional groups of Ag NPs/CFs and AgNPs/ACFs a The results of atomic wt were obtained by XPSbThe results of atomic wt were obtained by ICP-OES Comparison of CH 3 OH production in the present study and previous reports Acknowledgements This work was financially supported by National Natural Science Foundation of China (21908108), Jiangsu Province Scientific and Technological Project (BK20180449), Fundamental Research Funds for the Central Uiversities (30920041108), Top-notch Academic Programs Project of Jiangsu Higher Education Institutions, Open Fund for Large Instruments and Equipments of Nanjing University of Science and Technology. The online version contains supplementary material available at (https ://doi.org/10.1007/s10562-021-03554 -3). Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Ruonan Wang"
  }
]