[
  {
    "title": "Doi",
    "content": "10.1016/j.jece.2021.105469"
  },
  {
    "title": "Article_Title",
    "content": "Solar-light induced photoreduction of CO2 using nonthermal plasma sulfurized MoO3@MoS2-CuS composites"
  },
  {
    "title": "Abstract",
    "content": "To enhance the solar-light photocatalytic efficiency of MoO 3 for conversion of CO 2 into CH 4 and CO, CuS and MoS 2 co-modified h-MoO 3 (MoO 3 MoS 2 -CuS) composites were sulfurized by dielectric barrier discharge (DBD) plasma.The photocatalytic activities of MoO 3 MoS 2 and MoO 3 MoS 2 -CuS for solar-light driven CO 2 photoreduction were better than that of h-MoO 3 , while MoO 3 MoS 2 -CuS presented the enhancing CH 4 yield and the declining CO yield.It's ascribed to the improved visible light response and the efficient charge transfer and separation.In addition, CO 2 and H 2 O molecules were trapped and photo-reduced at the naked edge-rich sites of junction interface between MoO 3 , MoS 2 , and CuS.The optimal MoO 3 MoS 2 -CuS-3 with the CuS content of 2.27 wt presented the CH 4 yield of 44.64 mol g -1 h -1 and CO yield of 7.59 mol g -1 h -1 , and its durability was slightly declined after three cycles."
  },
  {
    "title": "Experimental",
    "content": "MoO 3 MoS 2 -CuS composites were synthesized in DBD reactor, of which the configuration structure was described in previous works 545556.Hexagonal h-MoO 3 nanorods were prepared via the chemical precipitation route using Na 2 MoO 4 2H 2 O and HNO 3 as raw materials 57.In a typical process, 7 mmol Na 2 MoO 4 2H 2 O (AR, 99) was dissolved into 195 mL DI water under ultrasonic treatment for 20 min, and then 5 mL HNO 3 (AR, 99.9) was added into above solution under ultrasonic treatment at room temperature for 10 min.After stirred at 363 K for 60 min, the mixture was gradually cooled down to room temperature, centrifuged, washed with DI water for three times, and dried at 343 K for 6 h to obtain h-MoO 3 nanorods.MoO 3 MoS 2 -CuS were then prepared as following:1.0g h-MoO 3 and 0.025 g Cu (NO 3 ) 2 3H 2 O (AR, 99.5) were dispersed into 100 mL DI water and stirred at room temperature for 2.0 h.The above suspension was centrifuged, dried at 343 K for 3 h, sulfurized in DBD reactor using a H 2 S/Ar (20 vol) flow of 40 mL min -1 and an input power of 100 W for 40 min to obtain MoO 3 MoS 2 -CuS-1.MoO 3 MoS 2 -CuS-X (X 2, 3, 4, and 5) were prepared with the addition of 0.075, 0.126, 0.176, and 0.226 g Cu(NO 3 ) 2 3H 2 O according to the above process.The characteristic methods of these obtained samples were described in Section S1 (Supporting Information). The obtained samples were obtained by X-ray diffraction (XRD, Bruker D8), Scanning electronic microscopy (SEM, Hitachi FESEM-4800), transmission electron microscope (TEM, FEI Tecnai G2F20), inductively coupled plasma optical emission spectrometer (ICP-OES, Varian 710-ES), UV-vis diffuse reflectance spectra (DRS, Hitachi U-4100), photoluminescence spectra (PL, FLSP 920), and X-ray photoelectron spectroscopy (XPS, VS ESCALAB 250).A systematic threeelectrode pattern in 0.1 mol L -1 Na 2 SO 4 solution was performed for the photoelectrochemical properties of obtained samples on a photoelectric instrument (CEL-PECX2000, Beijing CEL Tech.Co., Ltd., China) equipped with a Vertex.C. EIS electrochemistry workstation (Ivium Technologies B.V., Holland) and a Xe lamp ( 420 nm, 240 mW cm -2 ).Pt flake covered with 10 mg obtained photocatalyst film (0.5 cm 2 ), Ag/ AgCl, and calomel electrode acted as the working electrode, counter electrode, and reference electrode, respectively. Solar-light driven CO 2 photoreduction performance of MoO 3 MoS 2 -CuS was performed in a 100 mL sealed reactor equipped with a 300 W Xe lamp (600 mW cm -2 ) serving as the light source, of which the irradiated distance and area were 10 cm and 7.06 cm 2 , respectively.Briefly, 10 g MoO 3 MoS 2 -CuS bulks were dispersed into 20 mL deionized water under intensive stirring at room temperature for 1 h, and then Ar flow (99.99) of 30 mL min -1 was bubbled to dispel the dissolved O 2 .When Ar flow was completely expulsed by a mechanical pump, 10 mL pure CO 2 (99.99) was injected into the closed circulation reactor.After irradiated with a tested impower intensity of 560 mW cm -2 at 423 K for a certain time interval, 0.5 mL products were evaluated on an online gas chromatograph (SC-300G, Chongqing Chuanyi Automation Co., Ltd.) equipped with a flame ionization detector (FID) and a thermal conductive detector (TCD).FID and gas converter were operated at K and 633 K, respectively.When operated at 0.4 MPa, H 2 /N 2 mixture with a volume ratio of 1:2 and a flow rate of 40 mL min -1 served as carrier gas, and air flow of 60 mL min -1 acted as combustion-supporting gas."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The typical peaks of hexagonal MoO 3 phases (JCPDS, 21-0569) were detected in the XRD patterns of h-MoO 3 , MoO 3 MoS 2 , and MoO 3 -MoS 2 -CuS composites (Fig. 1) 57,58.The appearing peaks of MoO 3 MoS 2 at 23.04 and 46.27 were respectively assigned to the (110) and (061) planes of -MoO 3 (JCPDS, 76-1003) 49,52.It's indicated that the metastable h-MoO 3 was transferred into stable -MoO phases in discharge process of DBD plasma.In addition, the adsorbed Cu 2 ions and out-layered MoO 3 particles were sulfurized into CuS and MoS 2 .CuS content induced to the declining peaks intensity of -MoO and h-MoO 3 phases, while did not affected the CuS and MoS 2 phases.The peaks belonging to the (102), (110), and (108) facets of hexagonal CuS phases (JCPDS, 06-0464) and the (300), (008), and (420) planes of hexagonal MoO 3 phases (JCPDS, 76-1003) were overlapped at 29.28 , 48.93 , and 52.60 , respectively.The weak peaks indexing to (001) and (101) factes of hexagonal MoS 2 phases (JCPDS, 75-1539) located at 32.39 and 33.12 , respectively. MoS 2 nanoparticles with the particle sizes of around 50 nm as well as MoS 2 layers sulfurized from MoO 3 were randomly loaded on the surface of MoO 3 nanorods with a length of around 2 m to form MoO 3 MoS (Fig. 2A-C).The adsorbed Cu 2 ions on the surface of MoO 3 nanorods were sulfurized into CuS nanoparticles to form CuS-modified MoO 3 -MoS 2 (Fig. 2D-F andS1).With the increasing CuS content, there were more and more nanoparticles and even clusters loading on the nanorods surface, and the hexagonal nanorods were seriously destroyed, forming the irregular edge-structure and edge-rich sites due to the drastic plasma field.TEM images (Fig. 2G andH) indicated that many nanoparticles existed on the surface of obtained MoO 3 MoS 2 -CuS-3 with a CuS content of 2.27 wt (Table 1).However, it's difficult to distinguish CuS and MoS 2 in obtained MoO 3 MoS 2 -CuS, which was confirmed by elemental mapping images.As shown in Fig. 2I-M, Cu, Mo, O, and S elements were well dispersed in MoO 3 MoS 2 -CuS-3, which was also confirmed by XPS survey spectrum (Fig. S2).It's suggested that the in-situ sulfurized route of nonthermal plasma was suitable to form the tight interface between MoO 3 , MoS 2 , and CuS in obtained MoO 3 MoS 2 -CuS, favoring the transfer and separation of photoinduced electron-hole pairs 13,17.These samples presented the type IV isotherms of N 2 absorption-desorption, forming the macro and/or mesopores (Fig. S3).The adding Cu 2 ions and our-layered MoO 3 were sulfurized into CuS and MoS 2 to form abundant active sites occupying the nanorods surface and pores.Considering the limited adsorption capacity of h-MoO 3 for Cu 2 ions, the tested CuS content of MoO 3 MoS 2 -CuS was lower than the theoretical value.Compared with h-MoO 3 (29.64m 2 g -1 ) and MoO 3 MoS 2 (24.49m 2 g -1 ), an increase in CuS content hence resulted in the declining BET surface area (Table 1). The light-harvesting capacity of MoO 3 MoS 2 and MoO 3 MoS 2 -CuS composites (Fig. 3A) extended from UV to visible light region as compared to h-MoO 3 , meaning the efficient utilization of solar energy.The Kubelka-Munk function (Fig. S4) was further performed for evaluating the light-absorption nature of obtained samples.As listed in Table 1, the calculated band-gap energy (Eg) values of MoO 3 MoS 2 (2.28 eV) and MoO 3 MoS 2 -CuS-1 (1.91 eV) were lower compared with h-MoO 3 (2.76 eV).Among these MoO 3 MoS 2 -CuS composites, MoO 3 MoS 2 -CuS-3 with a CuS content of 2.27 wt presented the strongest visible-light response.The photocurrent intensity of MoO 3 -MoS 2 -CuS composites (Fig. 3B) were higher than that of h-MoO 3 and MoO 3 MoS 2 , and were affected by CuS content.It's indicated that the junction interface between MoO 3 , MoS 2 , and CuS was suitable for boosting the charge transfer and migration.The efficient charge separation induced to the distinct on-off ration in photocurrent intensity of MoO 3 MoS 2 -CuS-3.As shown in Fig. 3C, the smaller arc radius of electrochemical impedance spectrum was obtained by MoO 3 MoS 2 -CuS-3 compared with h-MoO 3 and MoO 3 MoS 2 , further confirming the retained recombination of photo-excited charge carriers 59,60.The redox activity of photocatalyst was greatly affected by its valence band (VB) and conduction band (CB) potentials.As reported in previous works, the flat band potential (E FB ) calculated from Mott-Schottky equation was close to the bottom of conduction band (LUMO) of n-type semiconductors 616263.The positive slopes of Mott-Schottky plots (Fig. 3D) suggested that h-MoO 3 , MoO 3 MoS 2 , and MoO 3 MoS 2 -CuS-3 were the n-type materials, of which the corresponding E FB values were -0.305, -0.413, and -0.534 V (Ag/AgCl vs NHE at pH 7.0, normal hydrogen electrode), respectively.The difference in E FB potentials between MoO 3 MoS 2 and MoO 3 MoS 2 -CuS-3 was due to the work function of CuS.Based on Ag/AgCl electrode as the counter electrode, the calculated E CB value of MoO 3 MoS 2 -CuS-3 was -0.34 eV (Ag/AgCl vs NHE at pH 7.0).In addition, the estimated E VB and Eg values were 1.57 and 1.91 eV, respectively.Hence, the estimated band-gap energy of MoO 3 MoS 2 -CuS-3 was 1.72 eV, favoring the solar-light induced photocatalytic reaction.The charge transfer and separation of obtained samples were evaluated by PL (Fig. 4).The sulfurized h-MoO 3 presented the lower emission intensity than that of MoO 3 due to the introduction of edge-rich MoS 2 and the synergic effect formed from MoO 3 and MoS 2 33,35,36.The PL intensity of MoO 3 -MoS 2 was further suppressed by the adding CuS, and was intensively affected by CuS content.Among these MoO 3 MoS 2 -CuS composites, the lowest PL intensity of MoO 3 MoS 2 -CuS-3 confirmed the superior separation and weak recombination of photo-excited electron-hole pairs, leading to the climbing photocatalytic activity. The obtained MoO 3 MoS 2 -CuS composites were performed for solar-light induced CO 2 photoreduction.As plotted in Fig. 5A, MoO 3 MoS 2 prepared via the in-situ sulfurized approach exhibited the better yields of CH 4 (14.75 mol g -1 h -1 ) and CO (16.62 mol g -1 h -1 ) than those yields of h-MoO 3 (CH 4 : 8.53 mol g -1 h -1 , CO: 11.61 mol g -1 h -1 ).This was due to the versatile benefits of naked edge sites of edge-rich MoS 2 and the increased oxygen vacancies of h-MoO 3 for the optimized charge transport and strong light-harvesting 33,49.Notably, the addition of CuS could efficiently enhance CH 4 yield while suppressed CO yield.It's indicated that the adjustive band-gap structure of MoO 3 MoS 2 -CuS was favorable for solar-light induced photo-conversion of CO 2 into CH 4 instead of CO, especially the appropriate CuS content.With an increase in CuS content, CH 4 yield increased and then decreased, while CO yield slightly changed.CH 4 and CO yields of MoO 3 MoS 2 -CuS-3 were respectively 44.64 and 7.59 mol g -1 h -1 for solar-light induced CO photoreduction.CH 4 /CO ratios of MoO 3 MoS 2 -CuS-3 and h-MoO were respectively 5.88:1 and 0.74:1, meaning the favorable CH 4 selectivity of CO 2 photoreduction.In contrast with the reported works (Table 2), CH 4 yield of MoO 3 MoS 2 -CuS-3 was greatly enhanced, while the corresponding CO yield was moderate.It's indicated that the obtained MoO 3 MoS 2 -CuS-3 via the in-situ sulfurized route was a promising photocatalyst for solar-light driven photoreduction of CO 2 into CH 4 .Although the yields of CH 4 and CO increased, the corresponding yield rates decreased with the increasing irradiated time (Fig. 5B andC).This was further confirmed by the cycle testing of MoO 3 MoS 2 -CuS-3 (Fig. 5D).After 7-h reaction of three cycles, CH 4 yield declined from 281.48 to 267.48 mol g -1 , and CO yield decreased from 46.19 to 42.21 mol g -1 .The declined photocatalytic activity of MoO 3 Mo-S 2 -CuS-3 was due to the loss of edge-rich sites and the change in valence states of surface compositions. The microstructure and morphology of used MoO 3 MoS 2 -CuS-3 (Fig. S5) were not obviously changed.Although Cu, Mo, O, and S elements (Fig. S2) exhibited in used MoO 3 MoS 2 -CuS-3, long-term irradiation induced to the difference in valence states between fresh and used samples (Fig. S6).The splitting Cu 2p peaks of fresh sample at 951.24 and 931.39 eV (Fig. S6A) were indexed to Cu 2p 1/2 and Cu 2p 3/2 , while these peaks of used one shifted to 951.69 and 931.80 eV, respectively 64,65.The splitting Mo 3d peaks of fresh sample at 234.29, 230.99, and 227.73 eV (Fig. S6B) were respectively assigned to Mo 3d 3/2 , Mo 3d 5/2 of Mo 4 , and Mo 5 of oxygen defected MoO 3-x , respectively 34,49,52.However, those splitting Mo 3d peaks of used composite shifted to 234.33, 231.33, and 228.09 eV, respectively.Notably, the separation distance of Cu 2p 1/2 and Cu 2p 3/2 in fresh and used samples were 19.94 and 19.89 eV, while the corresponding separation space of Mo 3d 3/2 and Mo 3d 5/2 were 3.26 and 3.24 eV, respectively.It's suggested that the long-term radiation induced to the lower electronegativity.The peaks of fresh and used sample at 225.48 and 225.63 eV (Fig. S6C) were assigned to S 2s of MoS 2 66,67.The splitting S 2p peaks of fresh sample at 162.71 and 161.73 eV (Fig. S6D) were respectively assigned to S 2p 1/2 and S 2p 3/2 of S 2 -, and the peak at 160.57eV was indexed to S 2 , indicating the formation of S-rich MoS and CuS 67,68.However, these splitting peaks of used sample respectively shifted to 163.26, 162.11, and 160.89 eV.Compared with fresh sample (1.97:1), the atomic ratio of S to metal elements (Cu and Mo) of used one decreased to 1.94:1, meaning the missing S atoms under solar-light irradiation 26.It's indicated that MoO 3 was efficiently sulfurized into MoO 3-x and MoS 2 , forming edge-rich active sites of Mo-S-Mo, O-Mo-S, and Mo-S-Cu bonds in nonthermal plasma field.The divided O 1s peaks belonging to the oxygen defect (or vacancy) and lattice oxygen (Fig. S6C) located at 530.79 and 529.32 eV in O 1s XPS spectrum of fresh sample.In contrast, the O 1s peaks of used composite indexing to oxygen defect (or vacancy) and lattice oxygen respectively appeared at 530.70 and 529.55 eV, and the corresponding area ratio of oxygen defects to lattice oxygen was lower than that of fresh one.Hence, the decreased amounts of oxygen defects and edge sites were not favorable for the solar-light driven photoreduction activity of MoO 3 -MoS 2 -CuS-3 13,21,66. The possible mechanism of solar light driven CO 2 photoreduction was proposed in Fig. 6.The CB potential (-0.34 eV) of MoO 3 MoS 2 -CuS-3 was positive than the redox potential of CO 2 /CO (-0.5, NHE at pH 7.0), while negative than that of CO 2 /CH 4 (-0.24,NHE at pH 7.0) and H /H 2 (0, NHE at pH 7.0).In addition, its VB potential (1.57eV) was positive than that of O 2 /H 2 O (1.23, NHE at pH 7.0).Although the photoreduction reaction of CO 2 into CH 4 consumed much more Fig. 4. PL spectra of h-MoO 3 , MoO 3 MoS 2 , and MoO 3 MoS 2 -CuS composites.electrons than that of CO 2 into CO, the band-gap structure of MoO 3 -MoS 2 -CuS-3 was favorable for the solar-light driven conversion of CO 2 into CO.The reported CB values of CuS, MoS 2 , and MoO 3-x are -1.14, -0.42, and 0.27 eV, and the corresponding VB values were 0.94, 1.10, and 3.27 eV, respectively 34,50.Hence, the photo-generated electrons were transferred from CB of CuS to that of MoS 2 , and then to MoO 3-x , while the photo-driven holes were migrated from VB of MoO 3-x to that of MoS 2 , and then to CuS under solar light irradiation.On the one hand, the oxygen vacancies of MoO 3-x induced to the photo-induced holes migration to adjacent MoS 2 and CuS layers or adsorbed reactants of lower work functions 69,70.On the other hand, the edge-rich sites of MoS 2 and the photo-thermal effect of CuS were helpful for the adsorption and photoreduction of CO 2 .In addition, the tight interface between CuS, MoS 2 , and MoO 3-x accelerated the charge transfer and migration.H 2 O molecule reacted with h to form O 2 and H , of which H species were consumed by CO 2 molecules to generate COOH.This immediate was further converted into CH 4 , H 2 CO, H 3 COH, and H 3 CO 5,8,49.It's reported that the energy barriers of CO 2 , CO, HCO, H 2 CO, and H 3 CO hydrogenation over oxygen-defected MoO 3 were respectively 2.52, 0.98, 0.04, 2.28, 0.35, and 0.90 eV, while the energy barriers of COOH Comparison between this work and previous works for CO 2 photoreduction. Light source Products and optimal yield (mol g -1 h -1 ) Ref. Cu/TiO 2 UV-light bulbs CH 4 (2. Fig. 1.XRD patterns of h-MoO 3 , MoO 3 MoS 2 , and MoO 3 MoS 2 -CuS composites. Fig. 3. UV-Vis DRS spectra (A), photocurrent responses (B), electrochemical impedance spectra (C), and Mott-Schottky curves (D) of h-MoO 3 , MoO 3 MoS 2 , and MoO 3 MoS 2 -CuS. Fig. 5. Photocatalytic activity of h-MoO 3 , MoO 3 MoS 2 , and MoO 3 MoS 2 -CuS composites (A), and CH 4 yield (B), CO yield (C), and photocatalytic stability (D) of MoO 3 MoS 2 -CuS-3. Fig. 6.Photocatalytic mechanism of MoO 3 MoS 2 -CuS-3 for CO 2 photoreduction. CuS content and texture parameter of MoO 3 MoS 2 -CuS composites.The theoretical value of CuS is the percentage of MoO 3 (1.0 g).bThe tested value of CuS is calculated from the detected Cu 2 ions by ICP-OES. a The authors gratefully acknowledge the financial support of this work by Sichuan Science and Technology Program (Grant No: 2018JY0451), Natural Science Foundations of Qinghai Province (Grant No: 2021-ZJ-718), Chinese Academy of Sciences and Youth Innovation Promotion Association, CAS (Grant No: 2019423), and Research Team Project of Neijiang Normal University (Grant No: 2020TD01). and H 3 COH dihydroxylation were respectively 0.97 and 0.53 eV 49.Hence, the lower barrier of obtained MoO 3 MoS 2 -CuS-3 was favorable for the solar-light induced photoconversion reaction of CO2 into CH 4 and CO."
  },
  {
    "title": "Conclusions",
    "content": "Compared with h-MoO 3 and MoO 3 MoS 2 , MoO 3 MoS 2 -CuS prepared via the sulfurized route of nonthermal plasma exhibited the better CH 4 yield and lower CO yield under solar light irradiation.The photoreduction efficiency of CO 2 increased and then decreased with the climbing CuS content.The tight interface formed between MoO 3 , MoS 2 , and CuS enhanced the visible light response, and accelerated the transfer and separation of charge carriers.Due to the long term photo-corrosion, CH 4 yield over the optimal MoO 3 MoS 2 -CuS-3 with a CuS content of 2.27 decreased from 281.48 to 267.48 mol g -1 , and CO yield reduced from 46.19 to 42.15 mol g -1 after three cycles.Hence, the sulfurized synthesis of nonthermal plasma was a potential route to fabricate metal sulfides-based materials. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data associated with this article can be found in the online version at doi:10.1016/j.jece.2021.105469."
  }
]