[
  {
    "title": "Doi",
    "content": "10.1007/s10562-020-03111-4"
  },
  {
    "title": "Article_Title",
    "content": "Enhanced Photocatalytic CO2 Reduction and Water Splitting Over a Boron-Rich Alloy Boron Suboxide (B6O) via Cr or Co Doping"
  },
  {
    "title": "Abstract",
    "content": "Boron-rich alloy boron suboxide (B 6 O) as a novel metal-free photocatalyst was recently explored for photocatalytic CO 2 reduction and water splitting.However, to broaden the potential applications of B 6 O in the field, further improving its activity and understanding its fundamental chemical properties are essential.Herein, transition metal doping (Cr or Co) is designed to engineer the band structure of B 6 O via a solid state reaction.The valence band edge of Cr or Co doped B 6 O is proposed to be more positive than that of pristine B 6 O while the original conduction band of B 6 O is not much influenced by doping, contributing to the better light harvesting ability and lower charge recombination rate of doped B 6 O.The photocatalytic and photoelectrochemical (PEC) performances of doped B 6 O were therefore remarkably enhanced.The apparent quantum yields (AQY) of 20 wt Cr or Co doped B 6 O are much higher than that of pristine B 6 O.In addition, the 20 wt Cr doped B 6 O exhibits the best electrical conductivity and photocatalytic performance compared with the Co doped B 6 O and pristine B 6 O.The present work demonstrates a facile and effective strategy to engineer the band structure and reduce the charge migration resistance of B 6 O."
  },
  {
    "title": "Experimental",
    "content": "Boron suboxide was synthesized according to the previous report with some modifications 22.Firstly, to remove possible impurities, amorphous boron powders were washed repeatedly with a sequence of 0.1 M HCl aqueous solution and deionized (DI) water for several times.Then the amorphous boron powders were annealed at 1200 C for 10 h in a BN crucible to form crystalline boron (denoted as B-1200).Subsequently, the B-1200 was dispersed into a H 2 O 2 solution (10 mg/mL).After magnetic stirring for 5 min, the mixed solution was transferred to an oil bath with vigorous stirring and then was heated at 90 C for 60 min.The resulting product was collected and washed several times with DI water and ethanol.The finial product was dried at 60 C overnight to obtain the B 6 O powders. Co doped B 6 O photocatalysts were synthesized via solid state reaction.Under vigorous stirring, 50 mg of B 6 O was dispersed into ethanol to form a uniform emulsion.Next, a certain amount of Co(NO 3 ) 2 6H 2 O (wt) was added into above solution under continuous magnetic stirring.After stirring for another 2 h, the above solution was transferred into an airdry oven at 60 C for 24 h.The obtained powders were fully grinded with an agate mortar.Subsequently, the powders were calcined at 550 C for 6 h in argon with a heating ratio of 5 C min -1 .Then the final products were collected and washed with DI water and ethanol for three times.The resultant samples were denoted BO-Co-x, where x was the weight percentage of Co(NO 3 ) 2 6H 2 O.The Cr doped B 6 O was prepared in the same way except using Cr(NO 3 ) 2 9H 2 O as the doping agent.The undoped B 6 O (after calcined at 550 C for 6 h) was denoted as BO-0. XRD patterns were obtained on the Bruker D8 Advance diffractometer with Cu-K radiation.The morphology and composition of the catalysts were conducted by scanning electron microscope (SEM; TESCAN MIRA3 LMU) equipped with an X-ray (EDX) system (Oxford X-Max20).After that, the transmission electron microscopy (TEM) images were acquired at 200 kV accelerating voltage using a JEOL JEM-2100.The Brunauer-Emmett-Teller (BET) surface area was obtained with a TriStarII 3020 (Micromeritic Instruments Corporation, USA) by N 2 sorption/desorption isotherms at 423 K. Photoluminescence (PL) spectra were recorded on a Hitachi F-4600.Optical diffuse reflectance spectra were obtained by UV-Vis spectroscopy (Shimadzu UV-2550).The light density was obtained using a thermopile detector (Newport Corp., Model 1918-R).X-ray photoelectron spectroscopy (XPS) measurements were collected at 30 eV pass energy using a Thermo ESCALAB 250X. 10 mg of the photocatalyst was transferred into a 50 mL aqueous solution containing 0.02 M NaOH and 3 mM terephthalic acid to form suspension with magnetic stirring for 30 min in the dark.After that, a 300 W Xe lamp (with a 400 nm cut-off filter) was applied to illuminate the suspension.When the photocatalytic reaction begins, collect 2 mL of the suspensions in a time interval of 20 min, centrifuge the obtained samples and dilute the obtained supernatants twice.The final liquid was used for the measurements of fluorescence spectroscopy.The photoreactions were conducted without purging oxygen into the suspension.The generated signals of 2-hydroxy terephthalic acid were measured by a fluorescence spectrophotometer with an excitation light wavelength of 320 nm. A Pyrex top irradiation reactor connected to a glass closed gas circulation system was used to perform the photocatalytic CO 2 reduction.Typically, 20 mg of the as-prepared samples were evenly dispersed into a petri dish (diameter 6 cm) with 20 mL of DI water as dispersing agent. The powder samples can be evenly dispersed to form a thin film on the petri dish after natural air drying.The petri dish was then placed in the reactor, and 2 mL of DI water as hole scavengers was added to the bottom of the reactor (the volume of the reactor was about 400 mL).Next, the reactor was vacuumed and pumped to the atmospheric pressure with high purity CO 2 (99.999) for at least four times.The samples were irradiated by a 300 W Xe lamp (PLS-SXE300C, Beijing Perfectlight Technology Co., Ltd.) with about 400 mW cm -2 of the outputting light density.A gas chromatography (Fuli 9790II), equipped with a flame ionization detector (FID) was used to quantitatively analyze the produced gases.Photocatalytic H 2 evolution was conducted using the same system.20 mg of samples were placed in a 100 mL aqueous solution containing 20 ethanol, and stirred vigorously.A jacketed cooling water system can keep the reaction temperature at 20 C.The produced H 2 was quantitatively analyzed by gas chromatography (Fuli 9790II), equipped with a thermal conductivity detector (TCD).The light source was a 300 W Xe lamp (PLS-SXE300C, Beijing Perfectlight Technology Co., Ltd.) with a 400 nm cut-off filter, and the outputting light density was about 310 mW cm -2 . Apparent quantum yield (AQY) was calculated based on the equation: AQY 2 (generation rate of H 2 molecules) / (I/hc), where I is the light intensity, h is the Plank constant, and c is the speed of light.A 400 nm bandpass filter was used for the reaction.A radiant power energy meter (Newport Corp., Model 1918-R with a Thermopile Detector) was used to determine the numbers of incident photons. The PEC tests were conducted on a VersaSTAT 3 (Princeton Applied Research) electrochemical system with the Versa studio program in a standard three-electrode configuration.The electrolyte was 35 mM FeCl 2 and 0.1 M FeCl 3 (Fe 2 / Fe 3 redox couple) in acetonitrile.The light source was a 300 W Xe lamp (Newport Corp.) with a 400 nm cut-off filter (light density was about 180 mW cm -2 ).A spin-coating method was applied to prepare for the working electrode.In detail, a 100 L of B 6 O ethanol solution with a concentration of 1 mg mL -1 was dropped on the FTO glass and kept the spinning rate at 2000 rpm for 30 s.Then, the B 6 O/FTO was annealed in argon at 450 C for 60 min before PEC measurements.The electrochemical impedance spectroscopy (EIS) measurements were taken under visible-light irradiation at 0.6 V vs. Normal Hydrogen Electrode (NHE) potential in the frequency range of 0.01-10 5 Hz with a 10 mV amplitude.In order to exclude the influence of air, the argon was continuously purged throughout the PEC measurements."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The crystallization of synthesized photocatalysts were investigated by X-ray diffraction (XRD).Figure 1a It should be noted that the usage of doping agents was optimized based on its photocatalytic performance in the unit of weight percentage (from 10 to 60 wt).The photocatalysts prepared with 20 wt of doping agents for both Cr and Co doping exhibit the best performance which will be discussed later.As shown in Fig. S1a andb BO in the full region of light.In the visible-light region, BO-Cr-20 exhibits much better light absorption ability than the BO-Co-20, BO and BO-0.The enhanced light adsorption can absorb more photo energy to generate more electron-hole pairs under the irradiation of visible-light, which can lead to a higher photocatalytic activity 41.It has been demonstrated that metal or nonmetal ions doping could form mid-gap states within the band gap, which would facilitate the visible-light absorption of photocatalysts 29,42.Figure 1c shows the nitrogen adsorption-desorption isotherm curves of synthesized photocatalysts (BO, BO-0, BO-Cr-20 and BO-Co-20).The BET surface area is 19.99 m 2 g -1 for BO-0 compared with 49.73 m 2 g -1 for B 6 O, which may be attributed to the partial aggregation upon calcination in Table S1.The surface areas of BO-Cr-20 and BO-Co-20 are 48.02 and 37.39 m 2 g -1 respectively.The larger surface areas of BO-Cr-20 and BO-Co-20 compared with BO-0 may be due to NOx evolution of nitrate pyrolysis during calcination.The gas evolution during calcination would form pores and therefore enlarge the surface areas 43. As shown in Fig. 2a andb, regular and distinct rhombohedra particles can be observed.Fig. S3a andb indicate that the rhombohedra morphology of B 6 O is ubiquitous.In Fig. 2c andd, the rhombohedra morphology of B 6 O does not change after high temperature calcination (550 C for 6 h), indicating that the morphology of B 6 O has good stability.The Fig. 2e and f are the SEM images of BO-Cr-20 and BO-Co-20, indicating that the rhombohedra morphology of B 6 O is preserved after doping.The energy dispersive X-ray spectroscopy (EDS) analysis of BO-Cr-20 and BO-Co-20 is shown in Fig. 3c andd.It reveals that Cr or Co is successfully doped into the photocatalysts (Si and C are from the substrate and the air respectively).The types and rough contents of elements can be obtained by energy dispersive X-ray spectroscopy (EDS) analysis 44.The elemental distributions of the samples are summarized in Table S2.The general atomic ration of B to O is over 6:1 because there are lots of defects in B 6 O and the real formula should be 'B 6 O 1-x ' which is accordance with the previous report 45.The mapping images for BO-Cr-20 and BO-Co-20 are shown in Fig. S4, indicating the presence of B, O, Cr and Co without any impurities.Both Cr and Co doped samples exhibit homogeneous distribution throughout the materials.These results demonstrate the effectiveness of our synthetic method for the fabrication of B 6 O, which can dope B 6 O with Cr and Co uniformly.To investigate the exact doping amount of Cr or Co, we performed inductively coupled plasma-optical emission spectroscopy (ICP-EOS) measurements of the prepared samples.The results are summarized in Table S3, indicating the relatively low doping level of Co or Cr. Figure 4a-c present the high-resolution TEM images of undoped and Cr or Co doped (20 wt of Cr or Co) B 6 O samples. Figure 4a is the HRTEM image of BO-0 and the lattice spacing of 0.4112 nm is clearly observed, corresponding to the (003) facet of B 6 O 22.For the B 6 O samples doped with 20 wt Cr or Co, the lattice spacing is measured to be 0.4123 or 0.4146 nm, respectively.The slight change of the lattice spacing can be attributed to the relatively low doping level of Co or Cr and the homogeneous embedding of Co or Cr in the crystal lattice of B 6 O 46. XPS measurements were applied to investigate the surface atomic information of the samples.In Fig. 5a (BO-0 sample), only B and O elements are observed.In comparison, two additional peaks attributed to Cr and Co in the samples of BO-Cr-20 and BO-Co-20 emerge on the surface respectively.The results further demonstrate that Cr and Co are successfully doped into the B 6 O.To further investigate their chemical states, high-resolution XPS spectra of B 1s, Cr 2p and Co 2p (Fig. 5b-d) are conducted.As shown in Fig. 5b, the B 1s spectra of the BO-0 can be deconvoluted into three peaks around 187.3 eV, 189.2 eV and 192.4 eV respectively.These three peaks correspond to B-B bond 47, B-O bond 22, and the B 2 O 3 47.A slight shift of -0.2 eV for the BO-Cr-20 and BO-Co-20 samples confirms the lower electron concentration of B after Cr or Co doping 48.To further analyze the chemical states of Cr in BO-Cr-20, the binding energy peaks for Cr locate at 587.1 and 576.5 eV in Fig. 5c, corresponding to the 2p 1/2 and 2p 3/2 states, respectively.The peak centered at 576.5 eV is due to the existence of Cr 3 , which is well agreed with the previous report 49.High-resolution spectrum of Co 2p displays in Fig. 5d.The binding energies at 783.7, 786.7 and 803.2 eV can be classified as the shake-up peaks of Co 2 50.In addition, the peaks at 781.1 and 797.3 eV for the Co 2p 3/2 and Co 2p 1/2 respectively, can be attributed to the Co-O bond 51,52.And the peaks at 780.8 eV can be assigned to the Co 2p 3/2 , which is the characteristic peak of CoO 53. To verify that the samples are photocatalytic responsive, the photocatalytic activity of the prepared samples was then estimated by measuring the generated OH radicals as described previously.14,16,22.It is believed that the photoinduced holes are the main substance for the OH radicals generation, while the photoinduced electrons primarily function for the CO 2 reduction and H 2 generation.It has been demonstrated that the 2-hydroxyterephthalic acid (TAOH) would be produced through the reaction between the OH radicals and the terephthalic acid (TA), which would emit a unique fluorescent peak located at around 426 nm 54,55.In Fig. S5a As shown in Fig. S6, with the irradiation time increased, the signal is stronger, revealing the excellent stability of the samples.Figure 6a illustrates the time-dependent fluorescence intensities at 426 nm obtained by using the BO, BO-0, BO-Cr-20 and BO-Co-20 as photocatalysts.The emission signal increases monotonically with the irradiation time increased, which also confirms its superb stability (Fig. 6a).The photogeneration rates of OH radicals for the BO-Cr-20 and BO-Co-20 samples are 5.44 and 3.97 times higher than the pristine B 6 O respectively, which reveals the It is commonly recognized that metal ion doping can enhance the conductivity and accelerate the migration of photogenerated carriers to the surface of photocatalysts 38,40.As shown in Fig. 6b andc, the time courses of photocatalytic CO 2 reduction reveal that with careful optimization of the amounts of doping agents, the photocatalysts with superior performance can be obtained.It has been reported that a deep impurity level usually plays the role as a recombination center and obstacle the photocatalytic reaction, while a shallow impurity level can enhance the photocatalytic activity as a trapping center 56,57.The dopant concentrations have great influence on impurity band numbers 56.Therefore, with the increased dosage, the trend of the photocatalytic activity just looks like the volcano-shape.The optimal concentration of doping agents is 20 wt of Cr or Co doped B 6 O. Without any noble metal cocatalysts and sacrificial agents, the BO-Cr-20 shows the highest photocatalytic CO evolution rates of 1.01 mol g -1 h -1 which are 2.71 times higher than the pristine B 6 O in Fig. 6b (0.37 mol g -1 h -1 ).The CO evolution rate of the BO-Co-20 is about 0.79 mol g -1 h -1 (2.12 times higher than that of the pristine B 6 O) based on the first 5 h irradiation (Fig. 6c).As shown in Fig. S7a, the high temperature treated sample (BO-0) does not show an enhancement of the photocatalytic activity.Figure 6d shows the photocatalytic water splitting performances of BO, BO-Cr-20 and BO-Co-20 under visible-light irradiation ( 400 nm).Without the assistant of noble metal cocatalysts, H 2 evolution rates of BO, BO-Cr-20 and BO-Co-20 are about 2.24, 4.21 and 3.72 mol g -1 h -1 , respectively.The rates of BO-Cr-20 and BO-Co-20 are 1.88 and 1.66 times higher than that of pristine B 6 O.The H 2 evolution rates show negligible change after 30 h illumination, indicating the excellent photocatalytic stability of the samples.The doped samples exhibit much better photocatalytic activity than the pristine B 6 O which may be attributed to the enhanced optical absorption and electrical conductivity of the photocatalysts upon transition metal doping.The apparent quantum yield (AQY) of BO-Cr-20 was calculated to be 0.033 at 400 nm (0.024 of BO-Co-20), which is much higher than the AQY value of 0.015 for the pristine B 6 O in the previous report 22.Moreover, the X-ray diffraction patterns of B 6 O, BO-Cr-20 and BO-Co-20 before and after photocatalytic reactions present no significant changes as shown in Fig. S7b, c and d respectively, further confirming the structural stability of the photocatalysts.The exciting results can be ascribed to the reduced recombination rate of photoinduced electron-hole pairs and the enhanced electrical conductivity upon transition metal doping 57,58. The synthesized photocatalysts were spinning coated on the FTO substrates and used for PEC experiments.Figure 7a depicts the density-potential (J-V) behaviors of four samples in dark and visible-light irradiation ( 400 nm).The photocurrent density of B 6 O is about 0.22 mA cm -2 at 0.6 V vs. NHE (subtracting dark current).As shown in Fig. 7b, the high temperature treated sample of BO-0 does not exhibit increased PEC performance because the calcination may not be able to improve the electrical conductivity of samples as evidenced in Fig. 7c.The Cr and Co doping agents were optimized as shown in Fig. S8a andb accelerate the separation of these electron-hole pairs, which enables more available electrons to participate in the photoreduction reactions 38,68."
  },
  {
    "title": "Conclusions",
    "content": "In summary, we have successfully synthesized Cr or Co doped metal-free boron-rich alloy B 6 O photocatalysts via a solid state reaction.The morphology, crystal structure, optical absorption, surface chemical compositions, photocatalytic properties and PEC performances of prepared samples were thoroughly investigated.Without changing the appearance of the rhombohedra B 6 O, Cr doping is more effective than Co doping to improve the photocatalytic activity and PEC performance.The apparent quantum yield (AQY) of BO-Cr-20 was calculated to be 0.033 at 400 nm (0.024 of BO-Co-20), which is much higher than the AQY value of 0.015 for the pristine B 6 O in the previous report.The enhanced photocatalytic and PEC performance can be ascribed to the enhanced visible-light harvesting ability and charge separation efficiency.The present work provides a facile and effective strategy to engineer the band structure and improve the photocatalytic and PEC performance of metal-free boron-rich alloy B 6 O photocatalysts. shows the XRD patterns for B 6 O, BO-0 and Cr or Co doped B 6 O photocatalysts (BO-Cr-20 and BO-Co-20).The samples present typical XRD patterns of B 6 O (PDF 50-1505) without any impurity peaks.The broad peaks centered at 21.59 can be assigned to the (003) lattice planes of B 6 O 22.The peaks at 34.86, 39.25 can be attributed to the (104), (021) lattice planes of B 6 O, respectively 40.It can be seen that the crystal structure of B 6 O is not changed upon Cr or Co doping. Fig. 1 The samples of BO, BO-0, BO-Cr-20 and BO-Co-20: a XRD patterns; b UV-Vis DRS spectrum; c Nitrogen adsorption/desorption isotherm curves and b, by using the five Cr doped B 6 O with different amounts of Cr doping agents under the same illumination conditions, the clear emission signal of TAOH appears at 426 nm.The intensity of the signal increases firstly and then decreases as the amount of Cr doping agent increases and the sample of BO-Cr-20 presents the best photocatalytic activity.In Fig.S5c and d, it is clearly shown that the BO-Co-20 exhibits the best performance in the five Co doped B 6 O samples. Fig. 2 SEM images of a, b pure B 6 O, c, d BO-0 (B 6 O 550 C 6 h), e, f BO-Cr-20 and BO-Co-20 respectively Fig. 3 EDS spectra of BO-Cr-20 (a, c) and BO-Co-20 (b, d) , indicating that BO-Cr-20 and BO-Co-20 possessed the best PEC performance.At 0.6 V vs. NHE, the photocurrent densities of BO-Cr-20 and BO-Co-20 can reach 0.31 and 0.29 mA cm -2 , which are Fig. 4 The HRTEM images of BO-0, BO-Cr-20 and BO-Co-20 (a-c) proposes a possible mechanism for the charge separation of Cr or Co doped boron-rich alloy B 6 O.The occupied Cr 3d or Co 3d level can raise the valence band edge of B 6 O and leave the original conduction band with negligible change 49, 66.As a result, the impurity band could be the pivotal role in the enhancement of visible-light absorption resulting in more electron-hole pairs generated in B 6 O 56.Since the Cr 3d level is more positive than the Co 3d level (Fig. 8b), the Cr doped B 6 O exhibits the best photo absorption ability and photocatalytic performance.Upon illumination, the electrons of doped B 6 O can be photoexcited, inject into the conduction band and carry out photocatalytic reactions as shown in Fig. 8 45, 66, 67.The impurity band by transition metal doping might also Fig. 5 a XPS survey spectra, high resolution XPS spectrum of b B 1s, c Cr 2p, d Co 2p Fig. 6 a Time-dependent fluorescence intensities of TAOH at 426 nm.Time-yield plots of CO 2 photoreduction products for b Cr doped B 6 O and c Co doped B 6 O with different dopant concentrations Fig. 7 LSV plots a 1-1 B 6 O (BO) dark, 2-2 BO-0 (after calcination of B 6 O) dark, 1 BO light, 2 BO-0 light, 3 BO-Co-20 light, 4 BO-Cr-20 light, b Transient photocurrent curves and c EIS Nyquist plots under visible-light irradiation at 0.6 V vs. NHE Acknowledgements This work was financially supported by the Scientific Research Fund of Hunan Provincial Education Department (18B065) and the Natural Science Foundation of Hunan Province (2019JJ50595). The authors declare that they have no conflict of interest. Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations."
  }
]