[
  {
    "title": "Doi",
    "content": "10.1016/j.matlet.2012.10.059"
  },
  {
    "title": "Article_Title",
    "content": "Photochemical reduction of CO2 catalyzed by silicon nanocrystals produced by high energy ball milling"
  },
  {
    "title": "Abstract",
    "content": "High energy ball milling (HEBM) with ZrO 2 balls is shown to be an efficient method for the preparation of silicon nanocrystals (SiNCs), which exhibit excellent photocatalytic activity for the reduction of CO 2 in aqueous solution.TEM indicated that the size of the as-prepared SiNCs ranged from 1 to 4 nm, and XRD data confirmed that the crystallinity of the SiNCs was well preserved.The SiNCs without capping molecules (no-SiNCs) on their surfaces exhibited excellent rates for the conversion of CO 2 to aldehyde.No photochemical catalytic activity was observed for the alkyl-capped SiNCs (alkyl-SiNCs).A mechanism for the photocatalytic properties associated with the photoluminescent characteristics of these two types of SiNCs was tentatively proposed."
  },
  {
    "title": "Experimental",
    "content": "The SiNCs were prepared using an HEBM method.A piece of clean silicon wafer was loaded into the first milling vial; a piece of clean silicon wafer and 10 cm 3 1-octadecene were loaded in the second vial.The two vials were filled with ZrO 2 milling balls, sealed under inert atmosphere, and placed in a TJH-DZ impactmill (Taijihuan Nanotech.Co. Ltd., Qinhuandao).Milling was performed (cooled externally with circulating water) for 3 h, and the products were collected in a glove box under argon atmosphere.The silicon powders were dispersed in ethanol or water and passed through a 220 nm syringe filter. A 200 W xenon lamp with a sunlight filter was used to photocatalytically reduce CO 2 .The as-prepared no-SiNCs were added to an aqueous solution of 0.01 M Na 2 CO 3 in a quartz flask.CO 2 was bubbled slowly through the Na 2 CO 3 solution.As the reaction proceeded, samples (1 cm 3 ) were collected every hour from the reaction mixture.The Nash reagent was used to measure the formaldehyde (HCHO) in these samples.Control experiments were conducted in the absence of either the no-SiNCs or irradiation of light.Reference samples (2 cm 3 ) were collected before the reaction started."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The pre-prepared SiNCs were analyzed using X-ray diffraction (XRD) with CuKa irradiation.The XRD pattern for free-standing SiNCs contains three standard diffraction peaks at 28.91 (111), 47.51 (220), and 56.71 (311) and other reflections such as (400) and (331) at 691 and 76.21, respectively (Fig. 1a).Compared to the X-ray data for a single crystalline silicon wafer 18, the silicon reflections in (Fig. 1a) are significantly broader, which indicates the formation of SiNCs.The mean size was calculated to be around 150 nm.The TEM images show that the size of the SiNCs ranges from 1 to 4 nm (Fig. 1b andc) after filtration.Compared with the bottom up method produced SiNCs with alkyl capping 11, the size of the SiNCs that prepared by HEBM are less uniform. The concentration of HCHO, one of the reduction products, was determined by adding Nash reagent to a sample and monitoring its maximum absorbance at 412 nm 19.When no-SiNCs were used as a photocatalyst, the UV-visible spectra of the sample (obtained from the reaction mixture after 2 h of illumination) contained an absorption band centered at 412 nm (Fig. 2a, black curve).The absorbance of 3 A 10 A 2 was calculated to be corresponded to a formaldehyde concentration of 2 mg cm A 3 .There was no evidence of formaldehyde formation in samples obtained under otherwise identical experimental conditions but without illumination (Fig. 2a, blue curve) or in the absence of no-SiNCs (Fig. 2a, red curve).These results proved that the reduction of CO 2 was driven by light with the no-SiNCs as a photocatalyst.In this work, the light source was filtered through a sunlight filter; only visible and near-UV light were responsible for the photo excitation reaction.The formation of formaldehyde demonstrated that the no-SiNCs were an efficient photocatalyst for the reduction of CO 2 , similar behavior was observed for other NCs 20.In our work, the amount of formaldehyde increased in an almost linear relationship with reaction time (Fig. 2b), which is consistent with surface initiated photochemical reactions. To investigate the effect of the surface modification of SiNCs on their catalysis of the photochemical reduction of CO 2 , alkyl-SiNCs were prepared by HEBM in the presence of 1-decene molecules 14.The XRD-pattern and TEM of the alkyl-SiNCs are identical to the results for the no-SiNCs.The FTIR spectrum of the as-prepared alkyl-SiNCs confirmed that the 1-decene attached to the surface of the SiNCs (Fig. 3a).However, the alkyl-SiNCs did not photocatalyze the reduction of CO 2 because no HCHO was detected.It is possibly that that the capping organic monolayer on the SINCs blocked the electron/hole transfer with outside media.The alkyl-SiNCs and the no-SiNCs had identical UV absorbance spectra.Strong fluorescence was recorded for alkyl-SiNCs as expected (Fig. 3b), but there was no fluorescence for the no-SiNCs.We propose that these observations may be related to the difference between the efficacies of the no-SiNCs and the alkyl-SiNCs for the photocatalytic reduction of CO 2 .For the no-SINCs, upon receive photons, electrons/holes were generated.When they migrated to the surface they were captured by CO 2 and H 2 O respectively, so little recombination could occur and this resulted in no fluorescence observed. It has been suggested that the conversion of CO 2 to HCHO is a multistep reduction process that includes the following reactions 4: where e A and h denote photogenerated electrons and holes, respectively.In this study, 0.01 M Na 2 CO 3 was used to combine temporarily with the photogenerated holes to avoid fast recombination processes by the photo-excited electron-hole pairs.From the experimental results described above, we tentatively concluded that both SiNCs absorbed light and were excited when they were illuminated with suitable wavelengths of light.In the alkyl-SiNCs, the photo-excited electron-hole pairs were not conducted to the exterior surface of the particles or, possibly, the H 2 O and CO 2 could not reach the surface to react because the alkyl-SiNCs are hydrophobic.Therefore, the electron-hole pairs recombined and did not react with CO 2 or H 2 O.After the SiNCs absorb the energy of the sunlight, fluorescence is emitted (Fig. 3b) and there are no electron-hole pairs available to react.It is possible that the no-SiNCs did not show any fluorescence because the photogenerated holes and electrons reacted with H 2 O and CO 2 , respectively, and no electron-hole recombination occurred to emit light. We propose a mechanism for the photocatalysis of CO 2 reduction by the no-SiNCs that is essentially the same as photocatalysis by H-SiNCs because both nanocrystals are easily oxidized under experimental conditions.The SiNCs are small in size and slightly oxidized, but they can still be used as photocatalysts for CO 2 reduction.The high efficiency of the photocatalytic reduction of CO 2 observed in this report might be due to the dispersion of the SiNCs in the reaction medium, which exposes a larger surface area than when nanocrystals are fixed on a membrane or substrate 6,20.However, it is more promising using no-SiNCs because HEBM is easily scalable."
  },
  {
    "title": "Conclusions",
    "content": "In conclusion, we demonstrated that no-SiNCs produced by HEBM, a method that is scalable for the production of SiNCs, can be used as an efficient photocatalyst for the reduction of CO 2 .Comparison studies indicated that there are some correlations between the photocatalytic properties and the photoluminescent properties of these SiNCs.Further work on the use of UV light sources with wavelengths matching the absorption spectra of the SiNCs, the determination of other reduced species, and the long-term testing of the photocatalysts are currently under investigation. Contents lists available at SciVerse ScienceDirect journal homepage: www.elsevier.com/locate/matletMaterials Letters 0167-577X/ -see front matter 2012 Elsevier B.V. All rights reserved.http://dx.doi.org/10.1016/j.matlet.2012.10.059 Fig. 1.(a) XRD pattern of the SiNCs.(b) and (c) The TEM images of SiNCs produced by HEMB for 3 h with different magnifications. Fig. 2. (a) UV-visible spectra of the reaction solution (after 2 h of illumination) treated with Nash reagent for the determination of formaldehyde.Black: in the presence of no-SiNCs with illumination; red: in the absence of unmodified SiNCs; blue: in the absence of illumination.(b) The concentration of formaldehyde as a function of reaction time.(For interpretation of the references to color in this figure legend, the reader is referred to the web version of this article.) Fig. 3. (a) FTIR spectra of the alkyl-passivated SiNCs.(b) The absorption and photoluminescence (excitation wavelength: 365 nm) (UV-PL) spectra of the alkyl-SiNCs.The inset image is a photograph of alkyl-SiNCs dispersed in ethanol under UV illumination (wavelength: 365 nm). The authors acknowledge support from the NSFC (20971030, 90923007, 21101039 and 212731126) and MOST (2009CB930700) for financial support."
  }
]