[
  {
    "title": "Doi",
    "content": "10.1016/j.mtphys.2021.100358"
  },
  {
    "title": "Article_Title",
    "content": "Three-dimensional self-attaching perovskite quantum dots/polymer platform for efficient solar-driven CO2 reduction"
  },
  {
    "title": "Abstract",
    "content": "A well-designed scaffold that allows the full exposure of nanophotocatalyst to reactants is equally important with an efficient catalyst material in realizing a high-performance photocatalytic reaction.In this work, we develop a three-dimensional (3D) bandgap tunable perovskite quantum dots (PQDs)/ polyethersulfone (PES) monolithic film to maximize the specific area and enhance light harvesting, thereby making full use of PQDs in solar-driven CO 2 reduction.The PQDs are electrostatically selfattached to the 3D PES scaffold with minimal agglomeration and clustering so that can be fully exposed to gaseous reactant and sustaining its superior high surface/volume ratio.Through composition engineering, the small-bandgap I-rich CsPbI x Br 3-x PQDs along with the 3D PES scaffold achieve a high electron consumption rate of 64.90 mmol g A1 h A1 , exceeding all the reported PQD-based single photocatalysts in CO 2 photoreduction.Our work provides a new platform to fully exploit the perovskite nanomaterials by constructing 3D nanocatalyst/polymer film for highly efficient photocatalytic reactions."
  },
  {
    "title": "Experimental",
    "content": "CsPbBr 3 PQD was synthesized through room-temperature supersaturated recrystallization method.All the reagents were purchased and used directly without extra treatment.0.1 mmol CsBr (Sigma-Aldrich 99.999) and 0.1 mmol PbBr 2 (Sigma-Aldrich 99.999) were dissolved in 2.5 mL DMF (Sigma-Aldrich 99.8) with 250 mL Oleic Acid (Sigma-Aldrich 90) and 125 mL Oleylamine (Sigma-Aldrich 70).After magnetic stirring at 70 C for over 2 h, the precursor solution is cool down to room temperature and filtered.2 mL solution was injected into 20 mL Toluene (Alfa Aesar 99.5) under vigorous stirring to drive the synthesis.The solution gradually turns into yellow-green and stabilized after around 30s. CsPbBr 3 PQD was then isolated and purified to collect the highquality small size PQD and get rid of DMF which is corrosive to PES membrane.The crude solution was first centrifuged at 15,000 rpm for 10 min at 15 C. The supernatant was discarded and the precipitation was redispersed in 10 mL Toluene.After that, 5000 rpm 5min 15 C centrifugation was applied to remove the large particles, and the supernatant was collected as the final stable colloidal dispersion of CsPbBr 3 PQD. Anion exchange method was adopted to facilely tune the bandgap of the synthesized CsPbBr 3 PQD.0.15 mmol ZnI 2 was dissolved in the mixture of 100 mL OAm and 5 mL Toluene, and stirred for over 1 h.The obtained solution was added into the collected CsPbBr 3 QD solution at 20 mL each time under vigorous stirring.The yellow-green solution gradually turns into orange, red and dark red with the addition of ZnI 2 solution.The resulted CsPbI 3- x Br x PQDs could be finetuned to obtain any product with optical bandgap between 1.9 and 2.4 eV. Hydrophilic polyethersulfone (PES) membrane was purchased from Millipore Express with pore size of 0.22 mm and diameter of 25 mm, and used as it is.The membrane was first immersed in Toluene for 10 min, and then dried by 50 C mild annealing and weighed.After that, the membranes were vertically immersed in 10 mL redispersed PQD solutions for 1 h.The resulted PQD/PES film was rinsed with pure Toluene and dried by 50 C mild annealing.The resulted PQD/PES films have the same color as PQD solutions, and shows strong photoluminescence under UV lamp with high uniformity, indicating the successful loading.The mass loading was calculated by the precise mass difference before and after PQD attachment, weighed by high-precision balance (Mettler Toledo XSE105) with precision of 0.01 mg. SEM images and EDX mapping were obtained using scanning electron microscopy (Hitachi S4800 FEG SEM, Leo 1530 FEG SEM).Reflection curves of PES and QD/PES film were obtained by UVeVisible spectroscopy with integration sphere (Lambda 35, Perkin Elmer).Surface area characterization has been conducted using Brunauer-Emmett-Teller (BET) surface area analyzer (JW-BK112, JWGB SCI TECH Ltd.), the related calculation and discussion were summarized in Supplementary Note 1 in Supporting Information.TEM images, diffraction and EDX were characterized by transmission electron microscopy (FEI Tecnai G2 20 Scanning TEM).Room temperature PL measurements were performed with a HeCd (325 nm) laser as the excitation source, and the spectra were collected using a fiberoptic spectrometer (PDA-512USB, Control Development Inc.).Particle size distribution and zeta potential were characterized by dynamic light scattering (Nanotrac Wave, Just Nanotech).The details of zeta potential measurement were summarized as Supplementary Note 2 in Supporting Information.The bandgap of PQDs were calculated by Tauc equation based on the absorption curves measured by UVeVisible spectroscopy (Lambda 35, Perkin Elmer).UV photoelectron spectroscopy (UPS) was conducted to obtain the valence band maximum (VBM) using a He discharged lamp (He I 21.22 eV). The PQD/PES film was placed in a 30 mL customized stainlesssteel chamber with high transparency quartz window for proceeding the batch-mode photocatalytic reaction.High purity carbon dioxide (99.95,CO-free, flow rate 30 mL/min, controlled by airflow meter) continuously flowed through a water tank and purged the reaction chamber for more than 20 min before reaction, in order to completely exclude the disturbance.The photocatalytic reactions were processed under standard AM1.5G 1 sun condition provided by Abet Sun 3000 Solar Simulator. 1 mL gas product was transferred to Fuli 9720 gas chromatography (GC) by gas syringe.The GC was installed with flame ionization detector (FID) and thermal conductivity detector (TCD) for characterizing multicarbon and hydrogen products, respectively.The component difference of before and after illumination was utilized to present the accurate performance of the catalyst."
  },
  {
    "title": "Results_and_Discussion",
    "content": "3.1.Self-attached perovskite quantum dot/polyethersulfone films Fig. 1a shows the schematic illustration of the dyeing-like selfattaching method for fabricating the PQD/PES monolithic film, where a porous PES membrane (Millipore Sigma, 0.22 mm) was immersed into purified PQD colloidal suspension for 1 h.Due to the Brownian motion and electrostatic adsorption, PQDs can be strongly self-attached onto the 3D PES scaffold.During the bathimmersion process, the hydrophilicity of PES facilitates the infiltration of the PQD solution into the porous scaffold.The mass loading could be easily controlled by adjusting the immersion duration or the agitation of the PQD solution.This simple and robust dyeing-like method can be used to fabricate a large-sized film with uniform distributed PQDs on the 3D scaffold (Fig. 1b; Supporting Information, Fig. S1), which can potentially be a viable technology for industrial production.As shown in Fig. 1c for scanning electron microscopy (SEM) characterizations, we observed uniform coverage of PQDs with negligible particle agglomeration in the self-attached monolithic photocatalyst film, thus sustaining the superior high surface/volume ratio of PQDs.To the best of our knowledge, our reported 3D PQD/PES structure is the first particle loading method that can achieve such large-scale PQD uniformity on a non-conductive substrate with such large surface area.In comparison with commonly used particle loading process, we also fabricated the drop-casted samples by dropping PQD solution on a glass substrate and a bare PES membrane, respectively, and then dried them in air.The obvious coffee rings were formed on the PQD/ glass sample, resulting from the gradual evaporation of background solvent (Supporting Information, Fig. S2a,b); while the drop-casted PQD/PES sample showed the agglomerated micrometer-sized PQD clusters with poor coverage (Supporting Information, Fig. S2c,d).Additionally, the spin-coated sample was also prepared by multiple dropping of the PQD solution on the glass substrate (Supporting Information, Fig. S3), and a compact thin PQD film was formed.None of these films fulfill our requirement to maintain the superior high surface/volume ratio of PQDs, which on the other hand proves the superiority of the developed self-attaching method.Brunauer-Emmett-Teller (BET) surface area analysis has been conducted to quantify the surface area of PQDs on PES substrate (Supporting Information, Fig. S4).A surface area value of 12.88 m 2 /g was obtained, which is at the same order with the theoretical maximum surface area of a 15.7 nm-sized cubic PQD crystal on substrate, and two orders higher than the spin-coated PQD/glass compact thin films (Supporting Information, Supplementary Note 2), suggesting the extremely low agglomeration rate of our method. We applied the room-temperature supersaturated recrystallization method to synthesize CsPbBr 3 PQDs 21.Perovskite precursor solution was simply injected into toluene in the ambient environment without heating or inert gas purging.The green PQDs synthesized by such a method were reported to possess a high quantum yields (QYs) over 95, indicating the excellent low nonradiative recombination rate and low trap-state density benefiting from the passivation effect, which is highly favorable for the charge transfer and separation in photocatalytic reactions.Anion exchange method was adopted to tune the halide ratio in the synthesized CsPbBr 3 PQDs by adding ZnI 2 /oleylamine/toluene solution into CsPbBr 3 PQD solution 22e24.The gradual color change and photoluminescence (PL) peak shift are shown in Fig. 2a,b.The pristine CsPbBr 3 PQD solution was transparent green-yellow under ambient light and showed a 506.5 nm PL peak under ultraviolet (UV) illumination.20 mL ZnI 2 /oleylamine/toluene solution was then added into the 2 mL pristine CsPbBr 3 PQD step by step.The solution color was progressively changed from green-yellow to dark red, corresponding to the PL peak redshifted with a step of 28 nm, which indicated a successful exchange of anions between ZnI 2 and PQD with gradually increased iodide composition ratio in PQDs.For easier differentiation, the PQDs were named after their PL colors, namely green (pristine), orange (60 mL addition), and red (120 mL addition), respectively.The I/Br ratio was characterized by energy dispersive X-ray (EDX) element analysis, showing 0/1 (pure Br) and 0.87/0.13(I-rich) for green (CsPbBr 3 ) and red PQDs (CsPbI 2.61 Br 0.39 ), respectively, indicating the successful anion exchanging. The synthesized PQDs were characterized by transmission electron microscopy (TEM), as shown in Fig. 2c,d.The green PQDs presented the cuboid crystal morphology with the edge length of 5e25 nm.A considerable number of black dots were observed in the green PQDs due to their instability under the high voltage electron beam.This is consistent with previously reported studies 25,26.The electron beam irradiation induces quick decomposition of PQDs from the surface halogen defects, and therefore the number of black dots is partially correlated to the defect level of PQDs.Here, the red PQDs inherited the crystal morphology and size of the green PQDs after the anion exchange process, maintaining the large specific area.It is worth to note that the black dots were much less in the red PQDs benefiting from the healing effect for surface halogen defects via ZnI 2 treatment 22.The TEM diffraction pattern and corresponding the d-spacing data were used to verify the successful iodine involvement in the perovskite crystal lattice (Supporting Information, Fig. S5, Table S1).Five shiny diffraction rings represent five major facets of PQD crystals; the d-spacing in all the five facets were increased from a green PQD to a red PQD, indicating the replacement of small ionic radius Br A (1.96 A) by large ionic radius I A (2.20 A) in the crystal lattice, which is consistent with the increasing trend of I/Br ratios (EDX element analysis) in our products.Therefore, through the synthesis of the green PQDs and the anion-exchange/defect healing by ZnI 2 post-treatment, we fabricated high quality CsPbI 3-x Br x PQDs with adjustable I/Br ratio and tunable bandgap. Fig. 3a shows the as-prepared PQD/PES monolithic films, in which the colorless PES membrane was dyed into green, orange, and red (also named after PL colors) by the synthesized CsPbI x Br 3-x PQD solutions with tunable bandgaps, exhibiting excellent uniformity with strong PL under UV light.We characterized the light absorption of the prepared PQD/PES monolithic films using the UVevisible (UVeVis) spectroscopy.Since the light could not penetrate through the 200 mm thick PES film, we applied the reflection mode test.Fig. 3b shows the reflection curves of the bare PES membrane (blue) and the as-prepared PQD/PES films (green, orange, red).The bare PES membrane showed a completely reflective characteristic (100 reflection rate) in the visible spectrum.In contrast, three PQD/PES films exhibited substantially reduced light reflection below 25 within their absorption ranges.Here, the absorption-free 3D-structured PES is beneficial to light harvesting and trapping, and thereby serves as an ideal scaffold paired with PQDs through electrostatic self-attached interaction.Besides, the absorption edge is extended from 520 nm (green) to 620 nm (red), which would boost the photogenerated electrons and further enhance the photocatalytic performance.Therefore, the structure and composition designs are both beneficial for the light absorption of the photocatalyst. The correct selection of substrates is undoubtedly essential for pairing with the self-attached method and PQD photocatalyst.In this work, we selected the hydrophilic and porous PES membrane as a 3D scaffold for supporting PQDs.First, the PES membrane was chemically resistive to the background toluene solvent in the PQD solution and did not deform after bath-immersion.Second, the PES membrane is absorption-free to visible light so that it has no competitive absorption with the attached PQD photocatalysts.Third, upon light illumination, the incident light is reflected and scattered inside the hierarchically porous structure until being absorbed by the attached photocatalysts, leading to a light trapping effect.Forth, the 3D porous structure would enable flow-through photocatalytic reactions.Hence, the PES membrane can be an ideal substrate for fully exploiting high surface/volume ratio PQDs for efficient photocatalytic reactions.It is worth noticing that PES is not the only choice in this work.Other electronegative polymer could also be applied as the substrate (for example, polyvinylidene fluoride, Supporting Information, Fig. S6).Therefore, such kind of design philosophy also provides a universal approach for other nano-photocatalysts and 3D substrates.Other than polymer membranes, substrate candidates like fabrics, papers, metal meshes, and anodized aluminum oxides, are either not insulated, or have large pore size (up to tens of mm) or competitive absorption with photocatalyst, are thereby not as suitable as polymer films. The electrostatic interaction between PQDs and PES plays a key role in the self-attaching behavior.We used dynamic light scattering (DLS) test to characterize the particle size distribution and zeta potential for the synthesized PQDs, as shown in Fig. 4a.The related detail information of the testing process was summarized in Supplementary Note 2 in Supporting Information.A narrow particle size distribution was observed in the PQD solution with an average size of 15.7 nm (more than 96 PQDs have a diameter smaller than 25.6 nm), consistent with the size observed in the TEM images.The positive zeta potential of 74.4 mV indicates the stable colloidal dispersion with positively charged PQDs.This is because bromide ions were enriched on the surfaces of PQDs synthesized by the room temperature supersaturated recrystallization method, resulting in the predominant existence of oleylamine on the surface by forming ammonium-halide hydrogen-bonding interaction 21,27,28.Consequently, the PQDs became positively charged and repelled each other.The PQD solution was stable with no precipitation, phase transformation, or halide segregation observed after the 10-day sealed storage in the ambient condition (Supporting Information, Fig. S7). The positively charged I/Br mixed PQDs were self-attached on the negatively charged surface of the PES scaffold when immersing the membrane into the PQD solutions, of which mechanism is schematically illustrated in Fig. 4b.The SEM EDX element mapping (Supporting Information, Fig. S8) demonstrated the uniform distribution of Cs, Pb and Br alongside the 3D scaffold of PES.The broad absorption peak around 3600 cm A1 in the Fourier-transform infrared spectroscopy (FT-IR) revealed a large number of hydroxyl groups on the PES, providing the hydrophilicity and negatively charged characteristics (Supporting Information, Fig. S9).To further verify the effectiveness of hydroxyl groups on the self-attaching process, bare and long-time ozone plasma-treated (hydroxyl-rich) Si wafers were immersed into the PQD solution (Fig. 4c).Compared with the PES membrane, a similar PQD coating was observed on the ozone plasma-treated sample (green PL under UV light) while there was poor coverage of PQDs on the bare Si.As seen in the SEM image in Fig. 4d, PQDs were uniformly attached to the treated Si surface simultaneously repelling each other, providing a direct evidence for electrostatic adsorption of PQDs on negatively charged surface. We conducted batch-mode photocatalytic reactions by placing the PQD/PES film in a 30 mL customized stainless-steel chamber with a high transparency quartz window (Supporting Information, Fig. S10) under standard AM1.5G 1 sun condition solar simulator.Experiment details are described in the Methods section.For all kinds of PQD photocatalysts developed in this work, CO turned out to be the major product and other products such as H 2 , CH 4 or multi-carbon products were very little even after long-time reaction.Therefore, we only counted the CO production in the following discussion.As a fair comparison, each group of experimental data were obtained from the same batch of experiments. The photocatalytic performance of CO 2 to CO conversion is shown in Fig. 5a.The PQD/glass sample was prepared by directly drop-casting the green PQD solution on a bare glass substrate and followed by a mild baking at 50 C to remove the background solvent.In our experiments, all the mass loading was precisely weighed by high-precision balance (Mettler Toledo XSE105) with precision of 0.01 mg, and controlled to be around 1 mg; and the sizes of different substrates (glass, PES) were controlled to be the same (4.9cm 2 ) for a fair comparison.For the green PQD/glass sample (Supporting Information, Fig. S3), the smaller specific area and more agglomerated PQDs on the glass substate limited the CO production rate to be 11.87 mmol g A1 h A1 CO, of which electron consumption rate is 23.74 mmol g A1 h A1 .Such a performance is very close to the reported work with a total electron consumption rate of 20e30 mmol g A1 h A1 15e18,20.In comparison, the PQD/PES sample achieved over twice production rate of 27.22 mmol g A1 h A1 CO with electron consumption rate of 54.44 mmol g A1 h A1 , demonstrating the great advancement of the ideal structure and sustained large specific area on photocatalytic performance based on our new self-attaching method.Here, it is worth to note that the PQDs were attached on both side of PES membrane, while only one side can be faced toward illumination.Light cannot penetrate the 200 mm thick PES film so that the PQDs loaded on the back side can barely contribute to the photocatalytic performance.Therefore, the photocatalytic performance of our PQD/PES monolithic films were still underestimated as compared to the reported work that based on rigid substrates with only one-side deposition. Physically, the narrower bandgap extended the absorption edge and increased the photogenerated electrons for improved photocatalytic performance.In our case, the absorption edge can be largely extended from 518.8 nm (green PQD) to over 626 nm (red PQD).By narrowing the bandgap of PQDs, the red PQD/PES film achieved an improved productivity of 32.45 mmol g A1 h A1 CO (64.90 mmol g A1 h A1 electron consumption rate); however, the orange PQD/PES film showed a degraded productivity of 25.29 mmol g A1 h A1 CO (50.58 mmol g A1 h A1 electron consumption rate) as compared to the green samples, even though with extended absorption.Therefore, the photocatalytic performance of PQDs were not simply correlated to the light absorption ability.Here, the trap-state density also affects the photocatalytic performance.The green PQDs can reach a high quantum yields (QYs, e.g.90), but the QYs usually decrease in the orange PQDs and red PQDs (e.g.70e80) in the reported values 21,24,29,30.And the QYs value are negatively correlated with the trap-state density inside PQDs: higher QY represents the lower non-radiative recombination, which is directly correlated to the low trap-state density.Therefore, a synergistic effect between light absorption and trap-induced recombination may determine the overall photocatalytic performance of the PQDs.From the green PQDs to the orange PQDs, the increased light absorption could possibly not compensate for the increase in the trap-state density, resulting in the degraded overall performance.When the iodide ratio is further increased to form the red PQDs, the greatly increased light absorption could exceed the loss in the trap-state density, thereby exhibiting a higher performance. In Fig. 5b, all three groups of PQD photocatalysts showed the decrease of production rate after half an hour reaction because the contact between the PQDs and H 2 O under illumination would accelerate the decomposition of PQDs 31.The intrinsic low formation enthalpy of halide perovskites usually makes them easy to be formed or decomposed 32.In our work, since the PQDs were simply covered by oleic acid and oleylamine, and used as single catalyst without involving any other protective shells or cocatalysts, inevitable degradation of PQDs on the monolithic film was observed after short-time reaction, as presented by the color fading (Supporting Information, Fig. S11). With the concern of the relatively small mass loading and instability of PQDs in the abovementioned solid/gas reaction, a batch-mode liquid-phase reaction was also conducted to confirm the productivity trend for green, orange, and red PQDs.The purified CsPbBr 3 PQDs/toluene solution was equally divided into three parts, two of which were treated with ZnI 2 to form the orange and red PQD solutions.The resulted solutions were placed in wellsealed glass reaction chamber with mild stirring and purged with CO 2 gas (same as the process in gaseous reaction) to carry out the photocatalytic reactions.In contrast to the degradation of PQD/PES film in gaseous reactions, the PQD solutions maintained their original colors with negligible changes after reaction (Supporting Information, Fig. S12).The liquid-phase productivity trend (red green orange) is consistent with the gas-phase experiment. To verify the originate of CO product, a control experiment of PQD/PES film in Ar (99.95) atmosphere was conducted.The result shows extremely low CO production 1.3 ppm/h, which was less than 1/20 of the result in CO 2 /H 2 O environment.It might either come from the photoreduction of the CO 2 impurity in the chamber (from Ar gas tank, or leakage of the air, or adsorbed CO 2 on PES film), or from the self-degradation of PES film.Overall, the production rate is too low to have influence on our results.Considering that it is highly possibly from the experimental errors, we could at least conclude most (95) of the CO product originates from the photocatalytic reduction of CO 2 . The energy diagram of the synthesized PQDs were investigated to study the photocatalytic reaction paths and mechanism.UV photoelectron spectroscopy (UPS) was conducted to obtain the valence band maximum (VBM) (Supporting Information, Fig. S13).The bandgaps were calculated from the UVeVis absorption curve based on the Tauc equation (Supporting Information, Fig. S14), which was 2.39 eV for the green PQDs and 1.98 eV for the red PQDs, respectively.The schematic of energy diagram and reaction mechanism are shown in Fig. 5c andd.The green PQDs have a conduction band of A1.025 eV (vs.NHE, pH 14 0), 0.905 eV higher than the reduction energy level of CO 2 /CO 33.Although the conduction band of the red PQDs shifts to a lower position of A0.701 eV, it is still 0.581 eV higher than the reduction energy level of CO 2 /CO.Thus, the green, orange and red PQDs showed the consistent selectivity for producing CO following the reactions: (including our reference experiment).In comparison, our PQD/PES films showed a much higher production rate of 54.44 mmol g A1 h A1 based on the same photocatalyst of CsPbBr 3 due to the full exposure of PQDs to gaseous reactants.Among all existing studies, our CsPbI x Br 3-x PQD/PES films showed the highest production rate of 64.90 mmol g A1 h A1 for using PQD as a single catalyst, which has already overperformed some of the commonly adopted photocatalysts, e.g.TiO 2 , C 3 N 4 , etc., enabling a promising platform for conducting efficient CO 2 photoreduction 5e7.By incorporating with appropriate co-catalysts to further enhance the charge transfer and protect PQDs from decomposition, the PQDs with high surface/volume ratio, low trap-state density, and strong light absorption shows great potential in achieving outstanding photocatalytic performance."
  },
  {
    "title": "Conclusions",
    "content": "In summary, a self-attaching method was developed with compositional engineering to prepare bandgap tunable PQD/PES monolithic films.Narrow-bandgap I-rich CsPbI x Br 3-x PQDs were synthesized by ZnI 2 anion-exchange method based on pristine CsPbBr 3 PQDs, demonstrating inherited morphology and extended absorption edge.The positively charged PQDs were electrostatically self-attached to the 3D PES scaffold with minimal agglomeration and thereby fully exposed to gaseous reactants with maximized specific area.Through the balance of light absorption and trapinduced recombination, I-rich CsPbI x Br 3-x PQDs overperform the CsPbBr 3 PQDs and achieve a high photocatalytic performance of 64.90 mmol g A1 h A1 in this work, beyond all the reported PQDbased single photocatalysts in solar-driven CO 2 reduction.Our work paves the way for developing 3D nanocatalyst/polymer platforms for highly efficient photocatalytic reactions. Fig. 1.(a) Schematic illustration of dyeing-like self-attaching method for preparing PQD/PES monolithic photocatalyst film.The electrostatic self-attaching process avoids the formation of piled films or clusters.(b) Real image of large scale (D 14 100 mm) PQD/PES monolithic film.(c) SEM images of PQD attached 3D PES scaffold. Fig. 2. (a) Real image, (b) PL characterization, of 2 mL PQD solution in cuvette with 0e140 mL addition of ZnI 2 solution.TEM image of (c) green, (d) red PQDs. Fig. 3. (a) Real images of prepared PQD/PES monolithic films under ambient light and UV light.(b) Reflection curves of bare PES membrane and PQD/PES monolithic films. Fig. 4. (a) Particle size distribution and zeta potential characterized by dynamic light scattering (DLS).(b) Schematic illustration of electrostatic adsorption of PQD on PES.(c) Real images of bare and ozone plasma-treated (hydroxyl-rich) Si wafers under UV light, after the PQD solution bath-immersion.(d) SEM image of the PQDs attached on the ozoneplasma-treated Si wafer. Fig. 5. (a) Typical electron consumption rate of green PQD/glass, green PQD/PES, orange PQD/PES and red PQD/PES samples.(b) Production curves of green, orange, and red PQD/ PES monolithic films.(c) Energy level diagram of CO 2 photoreduction and band diagram of green and red PQDs.(d) Reaction mechanisms for CO 2 reduction by PQD photocatalysts. summarizes the reported CO 2 photoreduction studies based on PQDs 15e20.All the studies based on glass substrates showed relatively low performances from 9.86e33.79mmol g A1 h A1 This work was supported by the General Research Fund of the Research Grants Council of Hong Kong Special Administrative Region, China under award number 17204518 and 17206519.This work was also supported by the National Science Foundation (Grant no.CBET-1931964), USA, and the Seed Fund for Strategic Interdisciplinary Research Scheme at the University of Hong Kong and HKU-Zhejiang Institute of Research and Innovation (HKU-ZIRI).The authors also thank Dr. Fangzhou Liu, Prof. Aleksandra B. Djuri sic, Mr. W. K. Ho, Dr. Yipu Xia, Prof. Mao Hai Xie (The University of Hong Kong), Dr. Craig A. Grimes (Flux Photon Corporation), and Prof. Jun Zhang (Inner Mongolia University) for the support and assistance. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://doi.org/10.1016/j.mtphys.2021.100358."
  }
]