[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2013.01.040"
  },
  {
    "title": "Article_Title",
    "content": "Tailoring Cu valence and oxygen vacancy in Cu/TiO2 catalysts for enhanced CO2 photoreduction efficiency"
  },
  {
    "title": "Abstract",
    "content": "The incorporation of Cu species in TiO 2 photocatalysts is critical in photocatalytic CO 2 reduction to fuels, but the effect of Cu valence is poorly understood.In this work, Cu/TiO 2 (P25) nanoparticle catalysts were prepared by a simple precipitation and calcination method.The as-prepared Cu/TiO 2 sample was dominated by Cu 2 species.Thermal pretreatment of the as-prepared samples in He and H 2 atmosphere resulted in the transition to a surface dominated by Cu and mixed Cu /Cu 0 , respectively, confirmed by in situ X-ray photoelectron spectroscopy (XPS) and diffuse-reflectance infrared Fourier transform spectroscopy (DRIFTS) analyses.These thermal pretreatments in reducing atmospheres also induced the formation of defect sites such as oxygen vacancies and Ti 3 .The various Cu/TiO 2 catalysts were tested in CO 2 photoreduction with water vapor under simulated solar irradiation, and their activities were in the order of as-prepared (unpretreated) He-pretreated H 2 -pretreated.Compared with unpretreated TiO 2 (P25), the H 2 -pretreated Cu/TiO 2 demonstrated a 10-fold and 189-fold enhancement in the production of CO and CH 4 , respectively.This significant enhancement was mainly attributed to the synergy of the following two factors: (1) the formation of surface defect sites promoting CO 2 adsorption and subsequent charge transfer to the adsorbed CO 2 ; (2) the existence of Cu /Cu 0 couples that facilitate electron and hole trapping at different sites."
  },
  {
    "title": "Experimental",
    "content": "Cu/TiO 2 was prepared by a simple precipitation method.In brief, 0.5 g of TiO 2 (Degussa P25) was dispersed in 50 ml of 0.25 M NaOH aqueous solution, and then a certain volume of 0.05 M CuCl 2 solution (Cu:Ti 1, 5 at) was added dropwise under stirring.After further stirring for 6 h, the precipitates were washed with deionized water until pH to 7, and then dried at 80 C for 12 h.TiO 2 samples without Cu were also prepared in a similar way.Both TiO 2 and Cu/TiO 2 were calcined at 400 C for 2 h in air. To prepare Cu/TiO 2 catalysts with different Cu valences, the asprepared Cu/TiO 2 was in situ pretreated inside the DRIFT reaction cell (for investigation of CO 2 adsorption) or inside the photoreactor (for activity test of CO 2 photoreduction with H 2 O) at 220 C for 1.5 h with a flow of He (99.999, 120 ml/min) or H 2 (99.998, 35 ml/min).Bare TiO 2 samples were also pretreated under the same condition.It has been reported that inert gas (e.g., N 2 , Ar, He) treatment leads to the formation of oxygen vacancies in TiO 2 and increases the number of electrons in shallow donor states and in the conduction band; each Cu 2 ion traps one of these electrons and converts to Cu ion 28.In a more reductive environment (i.e., H 2 ), the obtained Cu ions are possibly further reduced into Cu 0 13.Hence, our hypothesis was that the as-prepared (unpretreated) Cu/TiO 2 surface would be dominated by Cu 2 species, while He and H 2 pretreated Cu/TiO 2 dominated by Cu and Cu 0 , respectively.The thermal pretreatment may also result in the formation of V O /Ti 3 sites on TiO 2 and Cu/TiO 2 .The unpretreated and pretreated TiO 2 and Cu/TiO 2 samples were denoted as Ti(UP), Ti (He), Ti(H 2 ), xCu/Ti(UP), xCu/Ti (He) and xCu/Ti(H 2 ), respectively, where the x was the nominal atomic ratio of Cu to Ti, either 1 or 5, calculated from the Cu and Ti precursor molar concentrations. The surface area, pore size and pore volume of the unpretreated and pretreated 1Cu/Ti samples were analyzed by nitrogen adsorption at 77 K with the Brunauer-Emmett-Teller (BET) method (Micromeritics, ASAP 2020). The crystal structures of the Cu/TiO 2 samples were identified by X-ray diffraction (XRD, Scintag XDS 2000) using Cu K irradiation at 45 kV and a diffracted beam monochromator at 40 mA. The lattice structure of Cu/TiO 2 was visualized by phasecontrast high resolution transmission electron microscopy (HRTEM) carried out with 300 keV electrons in a Hitachi H9000NAR instrument with 0.18 nm point and 0.11 nm lattice resolution.Amplitude contrast TEM images were used to obtain the information about the sizes and morphology. The valence state of Cu was identified by in situ XPS analysis, which was performed on a PHI 5000 Versaprobe system using monochromatic Al KR radiation (1486.6 eV).In the case of pretreated sample, the as-prepared Cu/TiO 2 was placed in the introduction chamber (IC), and then was transferred to the reaction chamber (RC) by a transfer rod.After degassing the RC, the samples were in situ pretreated by introducing He or H 2 into RC at the same conditions as previously described in Section 2.1.As the temperature was cooled down from 220 C to room temperature, the samples were transferred back to IC, and were degassed again to remove the adsorbed He or H 2 .Subsequently, the samples were transferred to the main chamber (MC) for XPS detection.For the unpretreated Cu/TiO 2 , the same procedure was performed but without the thermal pretreatment in the RC.All binding energies were referenced to the C 1 s peak at 284.6 eV. UV-vis diffuse reflectance spectra of the unpretreated and pretreated Cu/TiO 2 were obtained by a UV-visible spectrometer (Ocean Optics) using BaSO 4 as the background. All IR spectra presented in this work were recorded on a Nicolet 6700 spectrometer (Thermo Electron) equipped with a liquid nitrogen cooled HgCdTe (MCT) detector.The spectra were displayed in absorbance units, and acquired with a resolution of 4 cm -1 , using 32 scans.The DRIFTS studies were performed in a Praying Mantis DRIFTS accessory and a reaction chamber (Harrick Scientific, HVC-DRP).The reaction cell is equipped with a heater and a temperature controller, as well as a sample cup in the center.The dome of the DRIFTS cell has two KBr windows allowing IR transmission and a third (quartz) window allowing transmission of irradiation introduced through a liquid light guide (Newport) that connects to a 150 W solar simulator. The state of Ti on the unpretreated and pretreated Cu/TiO 2 samples was identified by DRIFTS by examining the characteristic Ti-OH bonds.In addition to XPS analysis, in situ DRIFTS experiment was separately performed to confirm the valence of Cu by investigating the adsorption of CO, a probe molecule, on Cu/TiO 2 .He-pretreated Cu/TiO 2 samples were in situ prepared by first purging the DRIFTS chamber with He while ramping the temperature to 220 C at 5 C/min and then maintaining at 220 C for 1.5 h in He environment.H 2 -reduced Cu/TiO 2 was prepared in a similar manner, and immediately after H 2 treatment at 220 C for 1.5 h, a relatively high flow rate of He (100 ml/min) was used to purge the DRIFTS chamber to remove surface-adsorbed H 2 , if any, until the chamber was cooled down to room temperature.After that, 5CO balanced in He (Praxair) was introduced into the reaction cell at a rate of 4.0 ml/min at 15 C. IR spectra were recorded before and after the introduction of CO as the probe molecule. The in situ DRIFTS spectra of CO 2 adsorption and activation were recorded on the unpretreated and pretreated 1Cu/TiO 2 .In the case of 1Cu/Ti(UP), the sample was purged by He for 1 h at 25 C, and the background spectrum in the presence of the sample was collected.After that, 10CO 2 balanced in He (Praxair) passed through the chamber at 2.0 ml/min under photoillumination for 45 min.Meanwhile, the IR spectrum was recorded as a function of time.In the cases of 1Cu/Ti(He) and 1Cu/Ti(H 2 ), the same procedure was used except that the sample was undergone the previously described pretreatment process at 220 C and the DRIFTS reaction cell was allowed to cool down to 25 C before the IR spectra were taken. The experiments of CO 2 photoreduction with H 2 O on unpretreated and pretreated TiO 2 and Cu/TiO 2 catalysts were carried out in a photoreactor system as described in our previous study 8.For each test, 50 mg of catalysts was used.For Ti(UP) and Cu/Ti(UP), CO 2 was continuously passed through a water bubbler to bring a mixed gas of CO 2 H 2 O into the photoreactor at a flow rate of 2 ml/min.Ti(He), Ti(H 2 ), Cu/Ti(He) and Cu/Ti(H 2 ) were in situ prepared by pretreating Ti(UP) and Cu/Ti(UP) in an He or H 2 environment in the photoreactor using a 250 W infrared lamp to heat up the reactor to 220 C.After thermal pretreatment, a mixed gas of CO 2 H 2 O at a relatively high flow rate (120 ml/min) was immediately introduced to purge the photoreactor until the reactor was cooled down to room temperature.This step was aimed to remove any surface-adsorbed H 2 from the thermal treatment process.Background measurement by the GC was conducted to verify no H 2 present in the gas phase.After that, the flow rate of CO 2 H 2 O gas was decreased to 2 ml/min for another hour before the photoillumination was turned on to initiate the photocatalytic reaction.A 150 W solar simulator (Oriel) was used as the light source, and the light intensity was about 90 mW/cm 2 in the range of 200-1000 nm.The gaseous products in the reactor effluent were continuously analyzed by a gas chromatograph (GC, Agilent 7890A) equipped with both a thermal conductivity detector (TCD) and flame ionization detector (FID)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The crystal structures of Cu/TiO 2 samples before and after pretreatment were compared by XRD measurement, as shown in Fig. 1.The Cu/Ti(UP) and Cu/Ti(He) samples showed identical mixed phases of anatase and rutile TiO 2 without appearance of copper oxide or metallic copper, suggesting that Cu species were highly dispersed on the surface.However, a new weak peak for metallic Cu crystal (2A 43.3 ) 29 were observed on 5Cu/Ti(H 2 ), but not on 1Cu/Ti(H 2 ).The possible reason for this observation was that at the low loading, the small Cu particles were still highly dispersed even after H 2 reduction; while at the high loading, some Cu species were easily aggregated to larger particles and reduced to metallic Cu 0 by H 2 12.It was noted that the diffraction peaks of these He and H 2 treated samples were neither broadened nor narrowed, indicating the crystal phase and size of TiO 2 remained unchanged after the relatively low temperature (220 C) thermal treatment. Only the 5Cu/Ti(H 2 ) sample was analyzed by TEM and HRTEM because metallic Cu was only observed on this sample and the TiO 2 particle size and morphology were the same as other samples.The TEM image in Fig. 2a showed aggregates of fine nanoparticles with an average size of about 20 nm, agreeing with the primary size of P25 nanoparticles.The HRTEM image in Fig. 2b exhibited clear lattice fringes with an interplanar spacing of 0.350 nm that corresponded to the (1 0 1) plane of anatase 30,31.The HRTEM image also consisted of the lattice spacing of 0.240 and 0.319 nm that coincided with the (0 0 1) and (1 1 0) plane of rutile TiO 2 , respectively 32.In particular, under the observed projections, other nanoparticles with a size of about 4 nm were seen on the top or the edge of TiO 2 .Since the particles were not crystallographically oriented and their sizes were much smaller than that of TiO 2 , it may be related to the amorphous Cu species.This HRTEM image directly supported the XRD results that Cu species were highly dispersed on the TiO 2 crystal surface. The textual property of Cu/TiO 2 catalysts was characterized by N 2 adsorption-desorption isotherms.Table 1 compared the results of BET surface area, pore size and pore volume for the unpretreated and pretreated 1Cu/Ti samples.All three samples had a comparable BET surface area around 50 m 2 /g, agreeing with the literature data for TiO 2 P25.The pore size and pore volume for 1Cu/Ti(He) and 1Cu/Ti(H 2 ) were similar, but slight larger than those of 1Cu/Ti(UP). UV-vis diffuse reflectance spectra in Fig. 3 showed that the absorption edge of 1Cu/Ti(UP) is around 410 nm, corresponding to a calculated band gap of 3.04 eV.A slight red shift in the absorption The BET surface area, pore size, pore volume, band gap and surface atomic ratio of Cu/Ti for the three 1Cu/TiO2 samples. BET surface area (m The UV-vis DRS results agree with the physical appearance of the samples reported in Section 3.3. A comparison of the DRIFTS spectra of unpretreated and pretreated samples in the range of 3000-3800 cm -1 was used to elucidate the existence of Ti 3 species.As shown in Fig. 4, for unpretreated sample Cu/Ti(UP) with either 1 or 5 Cu, IR bands at 3693/3635 cm -1 were assigned to stretching vibration of OH groups (perturbed by H-bond with H 2 O) and that at 3669 cm -1 was assigned to Ti 4 OH 32,34,35.For pretreated samples, Cu/Ti (He) and Cu/Ti(H 2 ), the original double bands at 3693/3635 cm -1 disappeared probably due to H 2 O desorption; whereas, a new shoulder at 3717 cm -1 appeared, which was assigned to Ti 3 OH 35.Compared to Cu/Ti(UP), pretreatment also results in not only the increase of the intensity of 3665-3669 cm -1 peaks for Ti 4 OH, but also to the appearance of two new weak shoulders at 3615 and 3570 cm -1 on Cu/Ti(He) and a new band at 3771 cm -1 on Cu/Ti(H 2 ).Those peaks are possibly related to OH groups experiencing weak intermolecular interactions and the formation of octahedral vacancies, respectively 35,36.These different IR features suggest that treatment of Cu/Ti facilitates the exposure of more defect sites and OH groups, which probably benefit for CO 2 adsorption and activation.The observations were the same for both 1Cu/Ti and 5Cu/Ti samples.This result was in well accordance with the literature that Ti 3 and V O sites were created simultaneously when annealing TiO 2 in an inert or reductive atmosphere 23,24,37,38.Possible reaction pathways are as follows, where represents oxygen vacancy, i.e., V O . Hence, the unpretreated Cu/TiO 2 (calcined in an air environment) was relatively defect-free, while He and H 2 pretreated Cu/TiO 2 were defective with V O /Ti 3 sites. The existence of V O /Ti 3 on the pretreated Cu/TiO 2 was also directly supported by comparing the physical appearance of the catalysts.As shown in Fig. 5, He and H 2 pretreatment induced the change of the initial white color of Ti(UP) to gray and dark gray, respectively.This color transformation was in agreement with the studies by Chen et al. 22 and Danon et al. 23 that the intrinsic defect disorders like V O and Ti vacancy and hydrogen impurities like interstitial H atom on H 2 -reduced TiO 2 caused the appearance of black color for their samples.In analogy, 1Cu/Ti(UP) was light green, while its color turned to brownish and dark cyan, respectively after He and H 2 pretreatment.The colors of 5Cu/Ti catalysts also in turn changed from gray to dark gray and dark blue.Clearly, the color of pretreated Cu/Ti was significantly darker than that of pretreated TiO 2 , possibly because of two reasons: (1) the formation of intrinsic V O /Ti 3 defects and (2) the reduction of Cu 2 to Cu or Cu 0 .Compared with Cu/Ti(He), the significantly darkened Cu/Ti(H 2 ) may result from the high content of V O and the additional interstitial H. To confirm whether Cu 2 was reduced during the pretreatment process, in situ XPS was applied to probe the Cu valence before and after pretreatment.Fig. 6a illustrated the Cu 2p spectra of 1Cu/Ti samples.For 1Cu/Ti(UP), two peaks (Cu 2p3/2 at 933.5 eV, Cu 2p1/2 at 953.3 eV) and a satellite peak (at 942.2 eV) for characteristic Cu 2 were observed 11,30,39,40.Two additional peaks for Cu also appeared at 931.4 (Cu 2p3/2) and 951.3 eV (Cu 2p1/2) 12,39,41.The appearance of Cu was possibly because of the reduction of Cu 2 to Cu resulting from the bombardment effect by X-ray irradiation under ultra high vacuum 30, when Cu content was low and existed in a highly dispersed state on the TiO 2 surface.These analyses indicated that Cu 2 was the primary species on the 1Cu/Ti(UP) surface.By contrast, the typical Cu 2p peaks and the satellite peak for Cu 2 disappeared on both 1Cu/Ti(He) and 1Cu/Ti(H 2 ).Correspondingly, the signals of Cu increased and were broadened.This change demonstrated that Cu species possibly dominated the 1Cu/Ti(He) surface.However, the two Cu 2p peaks for Cu could be a mixture of Cu /Cu 0 since Cu and Cu 0 have very similar Cu 2p spectra 42.Due to the difficulty in the identification of Cu and Cu 0 only by binding energy of Cu, the Cu L 23 VV Auger peaks of Cu were normally applied to distinguish the Cu and Cu 0 from each other 20,30,39.Unfortunately, no obvious difference was found in the kinetic energies of Cu in our treated samples, possibly due to the very low content of Cu and the charge effect between Cu and TiO 2 .Hence, another method, in situ DRIFTS analysis of CO adsorption on Cu sites was applied to explore the change in Cu valence that is described later in this paper. The same observations for Cu 2p spectrum were also seen on 5Cu/Ti catalysts, as shown in Fig. 6b.The similar Cu 2 and Cu mixture was observed on 5Cu/Ti(UP).Upon He and H 2 pretreatment, the sharp peaks of Cu 2p3/2 at 931.7 eV and Cu 2p1/2 at 951.5 eV completely replaced the initial Cu 2p peaks and the satellite peak for Cu 2 , suggesting that Cu or Cu /Cu 0 mixed species were indeed obtained on the treated surfaces.The XPS spectra of binding energies for Ti 2p of 5Cu/Ti samples are shown in Fig. 6c.Almost identical Ti 2p3/2 (458.0 eV) and Ti 2p1/2 (463.9 eV) peaks were observed on the three 5Cu/Ti samples, and all the features were assigned to Ti 4 23,30,37,40.Ti 3 species were not detected in the XPS spectra of either 5Cu/Ti(He) or 5Cu/Ti(H 2 ), as opposed to the observation of Ti 3 species in the DRIFTS spectra (Fig. 4) and from the color change of the catalysts (Fig. 5).The literature also reported similar findings that surface Ti 3 was absent in the XPS spectra of H 2 -reduced TiO 2 whereas other characterization methods like electron paramagnetic resonance (EPR) well identified the existence of Ti 3 23,24,37.It was probably because Ti 3 species were in the subsurface or the bulk while XPS technique only characterized the top 1-10 nm surface-layer of the materials 37. XPS was also employed to quantify the real surface Cu concentration compared to the nominal value calculated from precursor concentrations.The data is shown in Table 1.For all the unpretreated and pretreated 1Cu/TiO 2 samples, the surface atomic ratio of Cu/Ti is in the range of 2-3, higher than the nominal value (1), indicating surface Cu concentration is higher than in the bulk. Because XPS cannot well distinguish Cu from Cu 0 as previously discussed, in situ DRIFTS of CO adsorption was performed to facilitate the identification of the various Cu valences, since CO can be selectively coordinated with Cu 2 (2190-2200 cm -1 ), Cu (2100-2150 cm -1 ), and Cu 0 (2050-2100 cm -1 ) at different positions 434445.Fig. 7 displayed the IR spectra of CO interaction with various Cu/Ti catalysts.For 1Cu/Ti(UP) (Fig. 7a), three very weak bands appeared at 2106, 2160 and 2182 cm -1 , which were attributed to the coordination of CO with Cu , Ti 4 OH and Ti 4 , respectively 46,47.The Cu 2 CO band expected at 2192 cm -1 was not observed possibly due to the weak interaction of CO with Cu 2 43.By contrast, the intensity of Cu CO band on 1Cu/Ti (He) was much stronger than that on 1Cu/Ti(UP), and further increased on 1Cu/Ti(H 2 ).In addition, a new shoulder appeared at 2097 cm -1 on 1Cu/Ti(H 2 ) which could be assigned to Cu 0 CO band 45.Similar IR spectra for Cu CO and Cu 0 CO were also observed upon CO interaction with 5Cu/Ti catalysts, as shown in Fig. 7b.Compared to the 1Cu/Ti(H 2 ) catalyst, the 5Cu/Ti(H 2 ) catalyst showed stronger features of Cu 0 CO, most likely due to the higher Cu concentration.The 5Cu/Ti(He) catalyst showed a hump-like Cu 0 CO feature, which was not apparent on the 1Cu/Ti(He) catalyst with lower Cu concentration.The above evolutions of IR spectra clearly indicated that thermal-treatment in He or H 2 reduced Cu 2 to Cu and further to Cu 0 , forming a mixed Cu /Cu 0 state, with a larger fraction of Cu 0 by H 2 treatment.Combining the results from both in situ XPS and DRIFTS analyses, it is reasonable to conclude the following Cu valence states on the prepared Cu/TiO 2 samples: Cu/Ti(UP) has mixed Cu 2 /Cu states dominated by Cu 2 , Cu/Ti(He) has mixed Cu /Cu 0 states dominated by Cu , and Cu/Ti(H 2 ) has mixed Cu /Cu 0 states with a higher fraction of Cu 0 than in Cu/Ti (He). Attempts have been made to prepare single valence Cu 0 on TiO 2 by increasing the H 2 reduction temperature from 220 to 400 C.However, the in situ DRIFTS spectra of CO adsorption still showed a strong peak of Cu CO and a shoulder of Cu 0 CO, very similar to the spectra shown in Fig. 7 for the Cu/Ti(H 2 ) sample.This suggests that it is difficult to completely reduce Cu species to Cu 0 possibly because the Cu species are in highly dispersed state.In addition, this is an original work that aimed to qualitatively identify the different Cu valences and TiO 2 defect sites as well as their effects on photocatalytic activity in CO 2 reduction.Quantitative measurements of the Cu valence composition (e.g., the fraction of Cu in the Cu /Cu 0 mixture) and surface density of the active sites will be fully investigated in follow-up studies. The photocatalytic activities of the unpretreated and pretreated TiO 2 and Cu/TiO 2 catalysts were measured in the experiments of CO 2 photoreduction by H 2 O vapor.CO and CH 4 were found to be the major CO 2 reduction products and no other products were detected, consistent with the findings in our previous studies 15,17 and some literature reports 3,4,16.Since the reactor was operating in a continuous-flow mode, the production rates of CO and CH 4 , in mol g -1 h -1 , were recorded as a function of illumination time for all samples (see Fig. 8 for example curves of the CO and CH 4 production rates using 1Cu/Ti samples).For all the samples tested in this work, including bare TiO 2 , 1Cu/Ti and 5Cu/Ti, the rates of CO and CH 4 production did not remain steady after reaching their maximum values, but gradually decreased.This decrease in production rate suggests a gradual deactivation of the catalyst, a phenomenon that has been generally observed in CO 2 photoreduction studies, including our previous work 15,21 and other literature reports 48,49.The exact mechanism of deactivation is not clear, but possible reasons are saturation of the adsorption sites on the TiO 2 surface with intermediate products and/or photooxidation of products back into CO 2 by O 2 produced in the reaction 15,48,50,51. In this work, the change of catalyst properties may also result in the deactivation.The 1Cu/Ti(He) catalyst after CO 2 photoreduction reaction was characterized by in situ DRIFTS of CO adsorption; the result indicated that the intensity of Cu CO band drastically decreased after the reaction, compared with the fresh 1Cu/Ti(He) sample.This indicates a possible transition of Cu to Cu 2 during the photoreaction, with Cu acting as a hole scavenger 21.In addition, a general observation was that the color of pretreated Cu/TiO 2 catalysts became lighter after CO 2 photoreduction.This may be due to the partial consumption of surface defect sites (i.e., V O /Ti 3 ) because the O fragment from CO 2 tends to heal the V O 27.The decreasing number of defect sites may also result in reduced CO 2 activation and photoreduction rate.A separate study in enhancing the stability of catalytic performance in CO 2 photoreduction is underway. Because of the general trend of catalyst deactivating, to better compare the photocatalytic activities of the various samples, the accumulative productions of CO and CH 4 for the period of 6.5 h, in mol g -1 , were calculated by integrating the production rate with illumination time, and the results are summarized in Fig. 9.As shown in Fig. 9a, for bare TiO 2 , the production of CO was close to each other on Ti(UP) and Ti(He), but was enhanced by nearly 4 times on Ti(H 2 ).The incorporation of Cu 2 on unpretreated TiO 2 enhanced CO production at a lower Cu concentration (i.e., 1Cu/Ti(UP)) but reduced CO production at a higher Cu concentration (i.e., 5Cu/Ti(UP)).Compared to unpretreated Cu/Ti, the ones pretreated by He or by H 2 , exhibited remarkable enhancement in CO production, and the order of activity was in the order of unpretreated He-pretreated H 2 -pretreated.Fig. 9b showed the production of CH 4 , which was always lower than that of CO, probably because the formation of one CH 4 molecule requires eight electrons while that of CO requires only two 2,16.The production of CH 4 on bare TiO 2 , pretreated or not, were negligible.The trends in CH 4 production enhancement due to the modification of Cu and He/H 2 pretreatment were similar to those observed in CO production.Among all the catalysts, 1Cu/Ti(H 2 ) had the highest activity at 25 and 4.4 mol g -1 for CO and CH 4 production respectively, demonstrating the superb ability of H 2 -treated Cu/TiO 2 for CO 2 photoreduction. To decouple the potential contributions of Cu species from those of defect sites and to explore the synergy between them, the enhancement factor (F) was calculated, defined by the normalized CO or CH 4 production of a treated TiO 2 or 1Cu/TiO 2 catalyst compared to that of unpretreated TiO 2 , as shown in Table 2.The enhancement attributed to the addition of Cu species, to the defect sites formed by pretreatment in He or in H 2 , and to the combination of the above two effects are represented by F Cu , F D and F Cu/D , respectively.F Cu is 1.3 and 7.4 for CO and CH 4 production, respectively, indicating the addition of Cu (i.e., Cu 2 ) enhanced both CO and CH 4 production, because Cu species can inhibit charge recombination by trapping electrons 13,48.The F D values are all greater than 1, suggesting the pretreatment of TiO 2 improved CO 2 photoreduction mainly due to the formation of surface defects like V O /Ti 3 sites.The reason of defect sites in facilitating the activation and reduction of CO 2 is described later in this paper using in situ DRIFTS analysis.The F D for CO production is higher on Ti(H 2 ) than that on Ti(He), possibly due to the increasing number of V O /Ti 3 sites in a more , where Y represents the production of CO or CH4 as shown in Fig. 8. reductive atmosphere (i.e., H 2 ); however, the F D for CH 4 production is comparable on the two samples, indicating the V O /Ti 3 sites have more significant effect on CO production than on CH 4 . The most important results in Table 2 are the values of F Cu/D , which are greater than the sum of their corresponding F Cu and F D values, clearly demonstrating the synergy between Cu species and surface defect sites.For 1Cu/Ti(He), the material characterization results showed a dominated Cu species on the surface.These Cu species on Cu/Ti(He) surface can more effectively trap electrons than Cu 2 species (as on Cu/Ti(UP) surface) do, because the reduction potential of Cu /Cu 0 (0.52 eV) is more positive than that of Cu 2 /Cu 0 (0.34 eV) 13.For 1Cu/Ti(H 2 ), the F Cu/D values for CO and CH 4 production are 10.4 and 188.9, respectively, much higher than those on the 1Cu/Ti(He) sample, and the F Cu/D values are even greater than the products of their corresponding F Cu and F D .These extremely high F Cu/D values on Cu/Ti(H 2 ) probably resulted from the synergy of the following three factors: (1) the formation of unique Cu /Cu 0 couples where Cu traps electron and Cu 0 traps hole, thus separating electrons and holes on different sites, which is more effective than the sole electron trapping effect by Cu alone; (2) the increased number of V O and Cu /Cu 0 because of annealing in a more reductive atmosphere (i.e., H 2 ) than He; and (3) the ndoping effect of H atoms into the TiO 2 lattice (i.e., interstitial H) 38. Another distinct finding from Table 2 and Fig. 9 is the significant enhancement in CH 4 production on the Cu/Ti(H 2 ) samples.This can be attributed to two possible reasons.First, the abundant Cu 0 species on Cu/Ti(H 2 ) could facilitate the capture of photo-generated holes, and thus H 2 O dissociation favorably occurred at the metallic Cu 0 -V O interface, supplying enough protons (H ) for the formation of CH 4 .Second, the interstitial H species may donate H atoms to promote CH 4 production.This is supported by an additional set of experiments for CO 2 photoreduction on 1Cu/Ti samples carried out under the following conditions: (1) without H 2 O, and (2) with H 2 O in the gas stream.Without H 2 O, CH 4 production was 0.02, 0.19 and 1.05 mol g -1 on 1Cu/Ti(UP), 1Cu/Ti(He), and 1Cu/Ti(H 2 ), respectively.The relatively high CH 4 production on 1Cu/Ti(H 2 ) suggests the contribution of interstitial H species since the effect of H 2 O vapor and adsorbed H 2 can be ruled out.Another important finding was that in the presence of H 2 O vapor, the CH 4 production was much more prominent, reaching 0.17, 0.5 and 4.3 mol g -1 on 1Cu/Ti(UP), 1Cu/Ti(He), and 1Cu/Ti(H 2 ), respectively.For 1Cu/Ti(H 2 ), CH 4 production in the presence of H 2 O vapor was four times as high as that without H 2 O vapor.This clearly indicates that H 2 O vapor is the primary donor of H to form CH 4 , although interstitial H also contributes to certain extent. To verify the favorable activation and dissociation of CO 2 on the defective Cu/Ti, in situ DRIFTS for CO 2 photoreduction was conducted on unpretreated and pretreated 1Cu/Ti.As shown in Fig. 10 calculation that the reduced TiO 2 with V O was more favorable for CO 2 binding with accompanying charge transfer to CO 2 25.The above in situ DRIFTS result correlates well with UV-vis spectra in Fig. 3, the IR features in Fig. 4 and activity results in Fig. 9, indicating that treated samples have more defect sites for light harvest and CO 2 adsorption, thus having higher activity for CO 2 conversion than unpretreated samples. To confirm the source of CO 2 reduction products, isotopically labeled 13 CO 2 photoreduction was also performed.The IR spectra of 12 CO 2 and 13 CO 2 interaction on Cu/Ti(He) under photo-irradiation are shown in Fig. 11.Similar IR features in adsorbed species including carbonates and bicarbonates were observed for 13 CO 2 adsorption, except a shift in the spectra compared with the spectrum of 12 CO 2 adsorption.According to the Harmonic equation that is used to calculate the theoretical peak shift for isotopic molecules 47, the vibration frequency (v) of 13 CO (bonded with Cu ) and 13 mechanism reported in the literature 10,18,47, CO 2 -could be reduced to CO via reaction with H (Reaction 1) or selftransformation (Reaction 2), or direct dissociation by healing the V O sites (Reaction 3).The formation mechanism of CH 4 may be much more complicated than that of CO, as more electrons and protons are involved in the multi-step conversion.Surface HCO 3 -is a possible intermediate that may be converted to CH 4 (Reaction 4), once dissociated hydrogen is available 10.Formic acid, methanol, formaldehyde, and CO are also reported as the possible intermediates for CH 4 formation 4,18,54.However, in the DRIFTS study in this work, even for Cu/Ti(H 2 ), we have not found direct evidence to explain the CH 4 formation pathway.Future study using both labeled carbon and hydrogen (i.e., 13"
  },
  {
    "title": "Conclusions",
    "content": "This work comparatively studied the photoreduction of CO 2 with H 2 O vapor on Cu/TiO 2 nanoparticles that were engineered with different Cu species and defect sites by low-temperature annealing in different reducing environments.The unpretreated, He-pretreated, and H 2 -pretreated Cu/TiO 2 surfaces were dominated by Cu 2 , Cu , and Cu /Cu 0 , respectively, and they had increasing activities in CO 2 photoreduction with H 2 O vapor.The correlation of photo-activity with material property suggests that the high activity of He or H 2 -pretreated Cu/TiO 2 is probably attributed to the synergy of the Cu species and the surface defect sites like oxygen vacancies, which facilitate the separation of electron-hole pairs and promote electron transfer to adsorbed CO 2 .The mixture of Cu /Cu 0 induced by H 2 -reduction seemed to be more active in charge separation than Cu species alone induced by He-pretreatment.The significantly promoted CH 4 selectivity on H 2 -reduced Cu/TiO 2 samples is possibly related to interstitial H atoms as well.The in situ DRIFTS study in this work has also revealed a feasible way to study the reaction intermediates and pathways that are important in understanding the mechanism of CO 2 photoreduction. Fig. 1.XRD patterns for unpretreated and pretreated 1Cu/Ti and 5Cu/Ti catalysts. Fig. 2. The TEM (a) and HRTEM (b) images of H2-reduced 5Cu/Ti sample.The labeled R and A represented rutile and anatase phase, respectively. Fig. 3. UV-vis diffuse reflectance spectra of the unpretreated and pretreated 1Cu/TiO2. Fig. 4. DRIFTS spectra for the OH group in the region of 3500-3800 cm -1 on unpretreated and pretreated Cu/TiO2 samples. Fig. 5. Appearance of the various prepared catalysts. Fig. 6.In situ XPS spectra for (a) Cu 2p of 1Cu/Ti samples, (b) Cu 2p of 5Cu/Ti samples, and (c) Ti 2p of 5Cu/Ti samples. Fig. 7.In situ DRIFTS spectra of CO adsorption on unpretreated and pretreated Cu/Ti samples (a) 1Cu/Ti; (b) 5Cu/Ti. Fig. 8.The production rate of (a) CO and (b) CH4 on the unpretreated and pretreated 1Cu/Ti catalysts as a function of photoirradiation time. Fig. 9.The production of (a) CO and (b) CH4 on the unpretreated and pretreated TiO2 and Cu/TiO2 catalysts under photoirradiation for 6.5 h. , exposure of the three 1Cu/Ti to CO 2 and photo-irradiation induced the formation of bidentate carbonate (b-CO 3 2-, at 1578, 1344 cm -1 ), bicarbonate (HCO 3 -, at 1411, 1220 cm -1 ), CO 2 -(at 1245, 1672 cm -1 ) and Cu CO (at 2115 cm -1 ) 46,47,52.The formation of CO 2 -suggests that CO 2 can be activated in a way that excess charge, being trapped in defects sites, migrates to adsorbed CO 2 (e.g., CO 2 e CO 2 -) 25,27,53.The appearance of Cu CO suggests that CO 2 can be dissociated into CO possibly via the CO 2 intermediate.However, the IR features for the CO 2 -and Cu CO species were very weak on 1Cu/Ti(UP), but much stronger on 1Cu/Ti(He) and 1Cu/Ti(H 2 ).This difference indicated that compared to the defect-free Cu/TiO 2 , the defects on the treated Cu/TiO 2 could act as active sites for CO 2 adsorption, and facilitate the activation and dissociation of CO 2 to CO, agreeing with theoretical Fig. 10.In situ DRIFTS spectra of CO2 interaction with the unpretreated and pretreated 1Cu/TiO2 under the photoirradiation. Fig. 11.In situ DRIFTS spectra for 12 CO2 and 13 CO2 interaction with 1Cu/Ti(He) under photoirradiation for 20 min. The enhancement factor (F) of CO and CH4 production for the treated TiO2 and 1Cu/Ti photocatalysts in comparison to unpretreated TiO2.Ti(He) /Y Ti(UP) or Y Ti(H 2 ) /Y Ti(UP) . a FCu Y Cu/Ti(UP) /Y Ti(UP) .b FD Y c F Cu/D Y Cu/Ti(He) /Y Ti(UP) or Y Cu/Ti(H 2 ) /Y Ti(UP) CO 2 and D 2 O) will be helpful to explore the intermediates and pathways for CH 4 production.CO 2- H e - CO OH - The authors acknowledge the support from American Chemical Society-Petroleum Research Fund (ACS-PRF, Grant 50631-DNI10)."
  }
]