[
  {
    "title": "Doi",
    "content": "10.1039/c8ra02362j"
  },
  {
    "title": "Article_Title",
    "content": "TiO<sub>2</sub> surfaces self-doped with Ag nanoparticles exhibit efficient CO<sub>2</sub> photoreduction under visible light"
  },
  {
    "title": "Abstract",
    "content": "Doping with intrinsic defects to enhance the photocatalytic performance of TiO 2 has recently attracted attention from many researchers.In this report, we developed an original approach to realise stabilized surface doping using intrinsic defects with the loading of Ag nanoparticles (AgNPs) on the surface.Herein, atmospheric pressure dielectric barrier discharge (DBD) cold plasma was used to help load the AgNPs, and ethanol treatment was used to introduce intrinsic defects (oxygen vacancies and Ti 3 ) on the surface of materials.This method avoids environmentally hazardous reducing regents and is undertaken under atmospheric pressure, thus reducing energy-consuming and complex operation.We combine the advantages of noble metal nanoparticles and surface doping to enhance the photocatalytic performance under the visible light.The characterization of the materials indicates that the loading of AgNPs and introduction of intrinsic defects can change the electronic structure of the composite material and improve its efficiency.The samples show significant enhancement in CO 2 photoreduction to obtain CO and CH 4 , with yields reaching 141 mmol m A2 and 11.7 mmol m A2 , respectively.The formation mechanism of the method for TiO 2 modification and CO 2 reduction is also discussed."
  },
  {
    "title": "Experimental",
    "content": "Commercial Ti-foil which was of 99.9 purity was purchased from XinXin Metal Material Company, China.Silver nitrate (AgNO 3 ), hydrochloric acid (HCl, 36), ethanol (C 2 H 6 O) and ammonium hydroxide (NH 3 H 2 O, 26) were purchased from China Experiment Reagent Co., Ltd.(analytical grade) and were used without further purication. The TiO 2 lm was prepared through the method which was recently reported by our group using pristine TiO 2 in the experiments. 23The deposition of the Ag nanoparticles was accomplished by a simple two-step method that is illustrated in Scheme 1.The as-prepared TiO 2 lm was immersed into the AgNO 3 solution of a certain concentration (50 mL).Then, 0.15 M NH 3 H 2 O was added dropwise into the solution under magnetic stirring (Scheme 1(a)).The lm was kept in the solution for 15 min until its colour changed to brown and then dried in air. Subsequently the sample was reduced by the DBD cold plasma method.Scheme 1(b) shows the diagram of the DBD cold plasma device.The voltage can be applied to the reactor by two electrodes which are put on the two sides of the quartz glass of the reactor.A mixture of hydrogen and argon (weight ratio 1 : 1) was pumped into the reactor (50 mL min A1 ).The power source supplied a bipolar sine wave output of 45-200 W at a frequency of 10-20 kHz.The DBD plasma treatment lasted for 30 s.The weight of silver nitrate was controlled to be variously 0.01 g, 0.02 g and 0.03 g, and the corresponding resulting samples were labelled as AP1, AP2 and AP3, respectively. Additionally, three samples loaded with the same amount of Ag 2 O as AP1, AP2 and AP3 were treated by heated ethanol before they were reduced by the DBD cold plasma.Each sample was put into a porcelain boat with 10 mL ethanol and covered by another porcelain boat.They were then calcined in a muffle furnace at the heating rate of 10 C min A1 .The samples were kept at 200 C for 60 min and then naturally cooled.Finally they were treated by DBD cold plasma as mentioned above.The corresponding resulting samples were labelled as ACP1, ACP2 and ACP3, respectively. The morphologies of the fabricated samples were examined using scanning electron microscopy (SEM, Hitachi S4800) and transmission electron microscopy (TEM, JEM 2100F).The dispersion of elements (Ag, Ti, and O) on the Ag/TiO 2 samples was analyzed by an energy dispersive spectrometer (EDS).The crystal phases of all as-prepared samples were determined using X-ray diffraction (XRD), which was performed on an X 0 Pert PRO X-ray diffractometer equipped with Cu Ka radiation (l 14 0.1541 nm).X-ray photoelectron spectroscopy (XPS) was performed on a VG ESCALAB Mark II instrument using Mg-Ka (photon energy 14 1253.6 eV) as the excitation source, and its energy analyser working at 50 eV with the overall resolution of 0.2 eV.Due to relative surface charging, the binding energy displayed a shi which was rectied using the C 1s binding energy of 284.6 eV as an internal standard.UV-vis diffuse reectance spectra of the samples were obtained using a UVvis spectrophotometer (Shimadzu UV-3600, Japan).BaSO 4 was used as a reectance standard in the UV-vis diffuse reectance experiments.Raman spectra were obtained on a LabRam HRUVat room temperature. The CO 2 photoreduction experiments with H 2 O vapor were carried out in a self-assembled reactor (capacity 4500 mL) as reported in our previous study. 23The as-prepared samples were placed at the centre of the reactor under the illumination of two 300 Watt xenon lamp simulated solar light sources.A 350 W ultraviolet lamp was used as the ultraviolet source with the wavelength shorter than 420 nm.Before illumination, ultrapure CO 2 (Air Products, 99.995) was pumped into the reactor at a ow rate of 300 mL min A1 for 1 h to purge residual air with a ask lled with de-ionized water to add the H 2 O vapour into the reactor.Aer purging, illumination commenced and the CO 2 ow was stopped.The gaseous products in the reactor were periodically analyzed by gas chromatography (GC/ FID, Thermo-Fisher, Trace GC).The room temperature remained at 25 C during the testing."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The surface self-doping process on the TiO 2 lm occurs mainly by three steps.In the rst step, Ag 2 O nanoparticles are deposited on the surface of the lm by a chemical precipitation method.The AgNO 3 solution reacts with ammonium hydroxide to generate Ag 2 O nanoparticles and these nanoparticles are deposited on the surface of the lm.In the ethanol treatment process, the TiO 2 and Ag 2 O will be partly reduced by the ethanol (Fig. S1; see ESI ).In this process, ethanol liquid becomes gas under 200 C and the hydroxyl group of the ethanol gas reacts with an oxygen atom in TiO 2 to produce acetaldehyde and water, leaving an oxygen vacancy in the crystal lattice, which was revealed in a previous report. 10The main function of the DBD cold plasma is to totally reduce the Ag 2 O nanoparticles.Aer this process, the Ag 2 O nanoparticles are totally reduced to AgNPs and the intrinsic defects in the TiO 2 lm are preserved. The crystal structures of the six samples were investigated by their corresponding XRD patterns.All of the sample types exhibited a rutile phase (JCPDS card no.21-1276, Fig. 1).The diffraction peaks appearing at 2q 14 27. the XRD patterns reveal that the TiO 2 lms have good crystallinity.There are no peaks attributed to silver detected in any of the samples.The reason for this may be that the levels of the deposited AgNPs of small diameter are too low to be detected by XRD.This may also illustrate the uniform distribution of the AgNPs.The perfect match of the XRD patterns suggests that neither the process of the DBD plasma nor the annealing in ethanol signicantly affected the crystalline structures of the TiO 2 lm (Fig. 1). The morphologies of the lms were observed by SEM (Fig. 2 and S2 ).The lm consists of rutile nanorods with loaded AgNPs. These sliver nanoparticles are distributed homogeneously on the surface of the TiO 2 nanorods and the diameter of the nanoparticles is typically smaller than 20 nm.With increasing concentration of the AgNO 3 solution, the density of AgNPs becomes higher.A single deposited Ag nanoparticle and TiO 2 nanorods are further revealed by TEM and HRTEM in Fig. 3. AgNPs deposited on the AP2 (Fig. 3a) were not calcined and the lattice fringes of 0.24 nm can be attributed to the (111) plane of metallic silver.The TiO 2 nanorods can be revealed by the 0.32 nm spacing which is attributed to the rutile phase in the (110) plane.According to the SAED pattern of AP2, the rutile phase is a kind of perfect single crystal whose crystal defects are less than those of the polycrystalline phase.This is an important characteristic that can reduce the recombination of the photoelectrons and holes, which helps improve the photocatalytic efficiency.The EDS spectrum of AP2 (Fig. 3b) reveals its elemental composition.The elemental copper originates from the TEM sample holding grid and Ti, O, and Ag are from the sample AP2.The spectrum also illustrates that the present experimental approach can help avoid contamination by impurity elements.The HRTEM image of ACP2 (Fig. 3c) and the EDS spectrum (Fig. 3d) are nearly the same as those of AP2. Comparison between AP1-3 and ACP1-3 indicates that their SEM images are nearly the same with regard to the density of AgNPs, which also veries that the ethanol treatment and DBD plasma did not change the morphology and microstructure of the lms. The UV-vis spectra of various samples are shown in Fig. 4a and the corresponding band gap values are also indicated by Tauc plots in Fig. 4b.These samples are characterized by strong absorption in the UV region (below 410 nm wavelength), which is a typical rutile TiO 2 absorption. 2425526 It is apparent that the deposited AgNPs can expand the absorption of these lms and with the increasing amount of the deposited AgNPs, these samples have better response to visible-light (above 420 nm wavelength).In addition, the absorption edges of these samples also have a slight red shi due to the deposited AgNPs; this trend becomes more signicant with the increasing concentration of the AgNPs, which is consistent with results of the SEM images.Compared to the AP1-3 series of samples, the ACP1-3 series of samples exhibits more positive response to the visible light which may be owing to the introduction of the surface doping intrinsic defects that can be revealed by XPS and Raman spectra.There is a wide absorption range from about 460 nm to 600 nm with peaks at about 540 nm, which is attributed to the LSPR effect of the metallic sliver nanoparticles. 1617718 The UV-vis spectrum of pristine TiO 2 lm is shown in the Fig. S3 which indicates that AP and ACP samples increase the visible light absorption. As can be seen in Fig. S4, peaks attributed to Ag, O, Ti and C are present, which is consistent with the EDS results indicating the existence of these pure elements.High resolution XPS was employed to investigate the surface chemical bonding of the samples (Fig. 5).Fig. 5a andb show Ag 3d high resolution XPS spectra of samples AP1 and ACP1, respectively.In these two spectra, there are only two symmetrical peaks at 367.9 eV and 373.9 eV which can be attributed to Ag 0 3d 5/2 and 3d 3/2 , respectively. 2728829 Their spin energy separation is 6.0 eV, which means that the AgNPs exist as metallic silver.These results conrm the results of the crystal plane in the HRTEM images, indicating that the DBD plasma can thoroughly reduce the Ag to Ag 0 .The spectra in Fig. 5c andd show Ti 2p states with binding energies of 458.22 and 463.85 eV, consistent with the standard 2p 3/2 and 2p 1/2 binding energies, respectively for Ti 4 in rutile.The XPS spectra of ACP1 are different from those of AP1.The spectrum in Fig. 5d shows not only the peak of the Ti 4 2p states but also the binding energies of 457.59 and 462.83 eV which are consistent with the standard 2p 3/2 and 2p 1/2 binding energies for Ti 3 , respectively. 303113233 These results illustrate that the ethanol treatment has introduced Ti 3 into the lms.Samples AP1 and ACP1 show an O 1s state with a binding energy of 529.49eV, consistent with the standard binding energy for O in rutile.This peak has two shoulders at 530.79 and 531.99 eV attributed to an oxygen vacancy and surface hydroxyl band, respectively. 3031132 There were oxygen vacancies (Fig. 5e) found in sample AP1.According to the previous reports, the numerous un-coordinated O atoms existing on the surface of the rutile can facilitate the formation of oxygen vacancies.However, it is apparent that the shoulder peak attributed to oxygen vacancy (Fig. 5f) accounts for a greater proportion in sample ACP1, which illustrates that the ethanol treatment can introduce oxygen vacancies in rutile.As the detection depth of XPS is restricted to several nanometers below the surface of TiO 2 , the results indicate that these intrinsic defects are distributed mainly on the surface.The additional experiment (Fig. S5 ) also illustrates that the AgNPs help introduce these intrinsic defects onto the surface of the samples. In order to obtain better conrmation on the presence of intrinsic defects, Raman spectra of the samples (Fig. 6) were also observed.Three typical Raman bands at 230 (B 1g mode), 440 (A 1g mode), and 610 (B 2g mode) cm A1 are observed which are attributed to rutile. 34,35The results of the phase composition revealed from the Raman spectra also corroborate the XRD results.Compared with the Raman spectra of pristine TiO 2 and AP1, the Raman spectrum of ACP1 shows a clear blueshi at 230 (B 1g mode) and redshi at 440 cm A1 (A 1g mode).At the same time, the peak at 610 cm A1 (B 2g mode) does not show any difference among these three samples.According to a previous report, these phenomena indicate that the sample ACP1 was doped with intrinsic defects by the ethanol treatment. 35owever, the sample AP1 that has not been treated with ethanol conforms to the pristine TiO 2 , which means that intrinsic defects have not been introduced into the sample AP1.These results are in good accordance with those from the XPS and UVvis spectra.compared with the P25 under visible light, which should be attributed to the LSPR effect of the Ag nanoparticle.This is also consistent with the results of the UV-vis spectra. The probable mechanism of the enhanced photocatalytic activity may be due to the following explanation.The AgNPs deposited on the TiO 2 surface are motivated by the visible light due to the LSPR effect.The photoelectron ow injects into the conduction band (CB) of TiO 2 , causing separation between electrons and holes, attributed to the Schottky barrier between TiO 2 and AgNPs. 363773839 The resulting LSPR effect can also promote the charge migration by producing the local surface electronic eld and restraining the recombination of electrons and holes. 38,40,41TiO 2 nanorods act as electron acceptors, and the reactants H 2 O and CO 2 adsorbed on the surface of the nanorods will react with the electrons. 1,22The reason for the higher photocatalytic efficiency of sample ACP1-3 is due to the surface doping.The surface defects will act as adsorption and reaction sites.CO 2 molecules adsorbed on the surface of the TiO 2 lm accept the separated electrons to produce an anion radical.The different possible products obtained are a result of the consuming of different numbers of electrons.As shown in Scheme 2, one CH 4 molecule obtained consumes more electrons (8H) than the generation of CO (2H).The CO is not only a product but also a reactant of the CH 4 .As a result, the yield of CO is generally much higher than that of CH 4 . 42,43"
  },
  {
    "title": "Conclusions",
    "content": "In conclusion, Ag-TiO 2 lms with surface self-doping of intrinsic defects were obtained by a facile method involving ethanol treatment as the reducing reagent to realize the selfdoped lms.The lms with AgNPs and intrinsic defects have broadened response to visible light and promote the adsorption of reactive reagents, thus enhancing the photocatalysis performance of the lms for reduction of CO 2 to CO and CH 4 under visible light.The highest yields of CO and CH 4 under visible light were about 141 mmol m A2 and 11.7 mmol m A2 , respectively.The loaded AgNPs change the band gap of the photocatalyst which broadens the absorption of the lm in the visible light and the near-infrared regions, thereby achieving photocatalytic activity.The deposited AgNPs are likely to help stabilize the surface intrinsic defects, which can promote the photoreduction on the surface.These results indicate that the composite lms presented herein may be a way to combine the advantages of noble metal addition and self-doping.We hold the opinion that the deposited noble metal nanoparticles can have an impact on the surface self-doping, which should be further studied.It is an edication for researchers who are interested in TiO 2 self-doping and noble metal deposition.This journal is The Royal Society of Chemistry 2018 4 , 36.1 , 39.1 , 41.2 , 44.1 , 54.3 , 56.6 , 62.74 and 64.03 are attributed to the (110), (101), (200), (111), (210), (211), (220), (002) and (310) lattice planes of the rutile phase, respectively.In addition, the diffraction peaks at 2q 14 38.4 , 40.2 and 53.0 are attributed to the (002), (101), and (102) lattice planes of the Ti metal (JCPDS card no.44-1294), respectively.The sharp diffraction peaks of Fig. 1 XRD patterns of the different samples.;: Ti metal and : rutile phase of TiO 2 . Fig. 3 HRTEM images of the samples: AP2 (a) and ACP2 (c).The insets are their corresponding SAED patterns; (b) (d): EDS spectra of AP2 and ACP2, respectively. Fig. 5 High resolution XPS spectra of Ag 3d of different samples: AP1 (a) and ACP1 (b);Ti 2p: AP1 (c) and ACP1 (d); O 1s: AP1 (e) and ACP1 (f). shows the CO 2 photoreduction activity of the different samples in the presence of H 2 O vapor under the inuence of visible light.Before the experiments, blank tests were performed, which consisted of measurements of light-illuminated CO 2 H 2 O without the photocatalyst, CO 2 H 2 O with the photocatalyst in the dark, and light-illuminated photocatalyst in H 2 O without CO 2 , respectively, and no target products were detected in the blank tests.It is obvious that the samples ACP1-3 exhibits higher photocatalytic efficiency than samples AP1-3 under both two kinds of light.The highest CO and CH 4 production rates of ACP3 are about 141 mmol m A2 and 11.7 mmol m A2 under simulated solar light, respectively, while the production rates of AP3 are about 88 mmol m A2 and 7.9 mmol m A2 .The highest CO and CH 4 production rates of ACP3 are about 47 mmol m A2 and 5.5 mmol m A2 under visible light, respectively, while the production rates of AP3 are about 37 mmol m A2 and 4.6 mmol m A2 .The samples that deposited Ag nanoparticles exhibit excellent photocatalytic performance Fig. 6 Raman spectra of the different samples. Scheme 2 Schematic of mechanism for photocatalytic process of TiO 2 decorated with AgNPs and surface self-doping. Fig. 7 Evolution of CO and CH 4 yields of different samples under simulated solar light (a) and visible light (b). This journal is The Royal Society of Chemistry 2018 The authors declare that there is no conict of interest."
  }
]