[
  {
    "title": "Doi",
    "content": "10.1039/d0ta07072f"
  },
  {
    "title": "Article_Title",
    "content": "Efficient photocatalytic CO<sub>2</sub> reduction mediated by transitional metal borides: metal site-dependent activity and selectivity"
  },
  {
    "title": "Abstract",
    "content": "The search for novel and low-cost cocatalysts that can achieve high efficiency meanwhile maintain high selectivity in photocatalytic CO 2 reduction is highly desirable yet remains"
  },
  {
    "title": "Experimental",
    "content": "The transitional metal borides Ni 3 B, Co 3 B and Fe 2 B nanoparticles were prepared by a simple chemical reduction and thermal annealing process.For the synthesis of Ni 3 B, two seperated solutions were prepared.Solution A was prepared by dissolving 0.8 g NiCl 2 .6H 2 O in 40 ml deionized water.Solution B was prepared by dissolving 0.4 g of NaBH 4 in 30 ml deionized water.After that, the solution B was slowly dropped into the solution A under vigorous stirring under the protection of Ar.The mixed solution was further stirred for 30 min.After that, the black powder was obtained by centrifugation and washing with deionized water for five times, following with drying under vacuum at 50C.The obtained powder was annealed under Ar at 300 0 C for 2 hours.For the synthesis of Co 3 B and Fe 2 B, NiCl 2 .6H 2 O was replaced by CoCl 2 .6H 2 O and FeCl 3 , and the annealing temperatures were set at 400 0 C and 200 0 C, respectively.TaB 2 , NbB 2 and MoB powders were commercially obtained from High Purity Chemicals Corporation (Japan).Air treated Ni 3 B was prepared via thermal annealing of Ni 3 B in air at 300 0 C for 2 hours.Ni nanoparticles were prepared by thermal treatment of Ni 3 B in H 2 at 300 0 C for 2 hours.NiO was commercially obtained from Wako Corporation (Japan). The XRD patterns were recorded by powder XRD on the X-ray diffractometer (X'pert powder, PANalytical B.V., Netherlands).The morphology of metal borides was abtained by field-emission scanning electron microscope (JSM-6701F, JEOL).TEM and HRTEM images of samples were received from the TEM machine (FEI, Talos F200x).UV-Vis absorption spectrum was obtained by Ultraviolet-visible spectroscopy (UV-2600 Shimadzu Corp., Japan). The decay time spectra were achieved on the Hamamatsu instrument (Hamamatsu C5680, Japan), and the wavelength of excitation light is 400 nm.The chemical states of the prepared samples were recorded on X-ray photoelectron spectroscopy (XPS, VG-ESCA Mark II).The in situ Fourier-transform infrared (FTIR) spectroscopies were conducted by JASCO FT-IR-6300h in CO 2 atmosphere.The Ni K-edge X-ray absorption fine structure (XAFS) measurements were conducted at the Photon Factory Advanced Ring in Tsukuba of Japan.Ni metal foil, NiO and Ni 3 B samples with analytical grade were measured.The ICP-OES data was abtained on Agilent 7900 ICP-MS. The Photocatalytic CO 2 reduction reactions were conducted in a liquid-solid reaction mode in a 100 ml quartz reactor under the ambient temperature and atmospheric pressure, and the experimental setup is displayed in Figure S2.Typically, 5 mg metal borides cocatalysts, 30 mg Ru(bpy) 3 Cl 2 6H 2 O (commercially obtained from sigma-aldrich), 6 ml deionized water, 18 ml acetonitrile (MeCN) and 6 ml triethanolamine (TEOA) were mixed and sonicated in a gasclosed quartz reactor.The reaction system was evacuated completely (no O 2 or N 2 can be detected), and then was filled with 100 kPa pure CO 2 gas.The light source was employed by a 300 W xenon arc lamp combined with a UV-cut filter (L42 filter, 420 nm) and cooling water filter.The evolved H 2 and CO gas products were detected and quantified by using gas chromatographs (GC-8A, Shimadzu Co., Japan) and (GC-14B, Shimadzu Co., Japan), respectively.The carrier gas of GC was pure Ar gas.The isotope-labeled experiment was conducted using 13 CO 2 instead of 12 CO 2 , and the generated gas was detected by the gas chromatograph-mass spectrum (GC-MS, JEOL-GCQMS, JMS-K9 and 6890N Network GC system).The cycling test of experiment was conducted as follows.The Ni 3 B powder was received by centrifugation and washing with MeCN for three times, then re-dispersed in a fresh reaction solution (30 mg Ru(bpy) 3 Cl 2 6H 2 O, 6 ml water, 18 ml MeCN and 6 ml TEOA) for the next cycling experiment until a total of 5 cycles.The measurement of apparent quantum yield (AQY) was conducted by applying a 300 W xenon arc lamp with monochromatic light band-pass filters (MIF-W, Optical Coatings Japan Co.).The radiant power energy meter (Ushio Spectroradiometer, USR-40) was applied to measure the number of incident photons.The AQY of CO evolution was calculated by the below equation:"
  },
  {
    "title": "Results_and_Discussion",
    "content": "Ni, Co and Fe borides were prepared by a facile chemical reduction of metal chloride solution using NaBH 4 at room temperature, followed with thermal annealing procedures under Ar.X-ray diffraction (XRD) patterns (Figure 1a,b,c The prepared Ni 3 B, Co 3 B and Fe 2 B were then investigated as cocatalysts for photocatalytic CO 2 reduction, which were conducted in the reaction system with Ru as light absorber and charge generator, and the system is shown in Figure S3.The main products of this photocatalytic system were CO and H 2 , and no formation of CH 4 or formic acid was observed. 20,21 Th time-dependent CO and H 2 evolution of metal borides photosensitized by Ru are shown in Figure S4.The evolution rates for CO and H 2 decrease after 1-hour continuous testing (Figure S4).This stagnation effect is mainly due to the photobleaching of the Ru light absorber that has been commonly reported in previous works. 20,21 S1. 2021222324252627 Without metal borides in the photocatalytic system, Ru only exhibits the CO evolution rate of 2.9 mol h -1 together with CO selectivity of 37.7.The CO and H 2 evolutions are completely terminated in the absence of Ru.These results indicate the cocatalytic effect of metal borides in the photocatalytic CO 2 reduction reaction.Co 3 B and Fe 2 B can also act as the cocatalysts for photocatalytic CO 2 reduction, however, their CO evolution rates and selectivities are much lower than those of Ni 3 B (Figure 2a). Given that the Ni 3 B achieves a high activity, its stability was then evaluated.The used Ni 3 B catalyst is collected and re-dispersed in a fresh reaction solution with newly added Ru for stability tests.As presented in Figure 2c, the used Ni 3 B cocatalyst remains 94 of its original performance after five cycle tests, demonstrating its high stability for photocatalytic CO 2 reduction.The SEM image and XRD pattern of Ni 3 B after photocatalytic reaction further confirm the high stability (Figure S5 and Figure S6).The evolution of CO is not observed under either Ar or without light, indicating that the CO product indeed originates from the photocatalytic conversion of CO 2 molecules (Figure S7).To further certify the carbon source of the produced CO, 13 C-labelled isotopic experiment using 13 CO 2 was conducted in Ni 3 B/Ru system, and the product was then analyzed by GC-MS machine.The CO product appears at the GC peak of 6.06 min, and the other two peaks in GC spectrum are O 2 and N 2 , respectively, derived from the air of the sampling needle (Figure 2d).The analysis of CO obtains the m/z 29, corresponding to the 13 CO.This result clearly demonstrates that the generated CO indeed comes from the reduction of CO 2 .This results indicate the cocatalytic performance is dependent on the metal sites of metal borides. The high cocatalytic activities of Ni, Co and Fe borides can be attributed to the intrinsic catalytic properties of Ni, Co and Fe active sites for CO 2 activation. 28,29 erally speaking, photocatalytic conversion of CO 2 to CO undergoes the formation of a formate intermediate (COOH) via CO 2 H e - COOH. 22To investigate the CO 2 photoreduction process on Ni 3 B/Ru system, in-situ Fourier-transform infrared spectroscopy (FTIR) investigation was conducted.As shown in Figure 3a, a strong broad absorption peak centered at 2329 cm -1 appears during CO 2 photoreduction, which is ascribed to the absorbed CO 2 melocular. 30In addition, the broad absorption peaks centered at 1522 cm -1 and 1354 cm -1 are assigned to the carbonate-type species and the adsorbed formate (COOH) species, respectively. 30Furthermore, the broad absorption peaks in a range of 1670-1820 cm -1 with a center located at 1731 cm -1 correspond to the asymmetric stretching of O-CO, which also belong to the intermediate formate (COOH) species. 31It can be seen that with the increase of irradiation time, the intensities of these peaks gradually increase, illustrating the formation of formate intermediate during the CO 2 photoreduction process.The CO is then produced from COOH conversion by a proton-electron transfer reduction process (COOH H e - CO H 2 O) and CO is finally released from the dissociation of the absorbed CO adduct (CO CO). 22The cocatalytic performances of metal borides follow the order: Ni 3 B Co 3 B Fe 2 B. In order to investigate the origin of metal-site-dependent performance of metal borides for CO 2 photoreduction, density functional theory (DFT) calculations are then conducted (see computational details in Supporting Information).The optimized bulk Ni 3 B, Co 3 B, and Fe 2 B lattice parameters were in good agreement with the experimental value as shown in Table S2.Noting that the electronic structure and chemical state of cocatalysts play significant roles in inferencing their photocatalytic CO 2 reduction performances.X-ray photoelectron spectroscopy (XPS) was utilized to reveal the chemical states of Ni 3 B. Figure 4a shows the high-resolution XPS spectrum of Ni 2p of Ni 3 B. The peak locating at the binding energy of 852.2 eV can be attributed to Ni 0 , originating from Ni-B bond. 32Noting that the coordination between B and transition metals would result in partial electron transfer from B to the vacant d-orbital of transition metals, making the transition metals electron rich and the alloying B electron deficient, and thus the low oxidation transition metals are formed. 13A weak peak at higher binding energy of 855.8 eV corresponds to the Ni 2 signal, resulting from the inevitable surface oxidation in air storage. 33The XPS spectrum of B 1s of Ni 3 B is displayed in Figure S11, and the peaks located at 191.9 eV and 187.7 eV correspond to B-O bonding and B-Ni bonding, respectively. 32e formation of B-O bonding is derived from the surface oxidation in air.To probe the chemical environment of Ni element in the Ni 3 B, the Ni K-edge extended X-ray absorption fine structure (EXAFS) and X-ray absorption near-edge structure (XANES) spectroscopies were measured.Figure 4b 36 Similarly, the Co 0 and Fe 0 also exist in Co 3 B and Fe 2 B, respectively, which can be confirmed by their XPS spectra (Figure S12), consistent with previous reports. 37,38 he metallic features of Co 3 B and Fe 2 B are also confirmed by their calculated DOS distributions (Figure 4e,f).The metallic character of the Ni 3 B, Co 3 B and Fe 2 B materials could bring efficient transport of charge carriers, and thus they can act as highly active cocatalysts to promote photocatalytic performances. Figure 5a shows the valence band XPS (VB-XPS) spectrum of Ni 3 B. It can be seen that the E f of Ni 3 B is occupied by continuous electronic occupied states, further disclosing its metallic feature.Figure 5b shows the calculated charge distribution of Ni 3 B, which indicates that charges are accumulated on the Ni-B bond.This unique feature enables Ni-B bond acting as electron accumulator to store electrons, which can provide abundant long-lived electrons to be injected into the Ni 0 active sites for the activation of CO 2 during photocatalytic reactions.The timeresolved PL decay spectroscopy was then utilized to experimentally reveal the dynamic charge behavior of the photocatalytic system. 39"
  },
  {
    "title": "Conclusions",
    "content": ") reveal the as-prepared Ni, Co and Fe borides have crystalline metal borides phase structures Ni 3 B (ICSD: 614985), Co 3 B (ICSD: 44339) and Fe 2 B (ICSD: 391328), respectively.The inductively coupled plasma optical emission spectroscopy (ICP-OES) was used to investigate the atomic ratio of Ni: B in the asprepared Ni 3 B materials, and the measured atomic ratio of Ni: B is 2.89: 1, which is close to the stoichiometric ratio of Ni: B in Ni 3 B. Figure S1 shows the energy dispersive Xray spectroscopy (EDX) of the as-prepared Ni 3 B, and the atomic ratio of Ni: B is measured to be 4.52: 1, revealing that Ni is the exposed site in as-prepared Ni 3 B. The morphology of metal borides is investigated by scanning electron microscopy (SEM) images.Figure 1d, e, f show that the as-prepared Ni 3 B, Co 3 B and Fe 2 B samples present as aggregated particles, with the size in the range of tens of nanometers to hundreds nanometers.The transition electron microscopy (TEM) image in Figure S2 shows the typical aggregated nanoparticle shape of Ni 3 B, Co 3 B and Fe 2 B, consistent with the SEM observation.In the high-resolution transition electron microscopy (HRTEM) images, well-resolved lattice fringe spaces of 0.235 nm, 0.205 nm and 0.201 nm are observed for Ni 3 B, Co 3 B and Fe 2 B, corresponding to the (121), (220) and (121) crystallographic planes of of Ni 3 B, Co 3 B and Fe 2 B phase, respectively. Figure 2a summarizes the photocatalytic performances of metal borides cocatalysts in the initial one hour.Ni 3 B/Ru (Ni 3 B as cocatalyst and Ru as light absorber) exhibits a considerable CO evolution rate of 157.7 mol h -1 with a H 2 production rate of 11.8 mol h -1 during the 1 h reaction period, obtaining a high CO selectivity of 93.0.The apparent quantum yield (AQY) of CO evolution along with the wavelength of the incident light was investigated.As shown in Figure 2b, the variation tendency of AQY matches well with the light absorption spectrum of the Ru, indicating the CO 2 reduction reaction occurs photocatalytically by the Ru light absorber.Notably, the AQY at the monochromatic light of 420 nm was measured as high as 4.5.The achieved photocatalytic CO 2 reduction performance outperforms the state-of-the-art cocatalysts under comparable conditions in the literature, as shown in Table photoreduction of CO 2 .It is very interesting to investigate the cocatalytic effect of other metal The (010) surface is chosen for simulation, as Ni 3 B (010) surface has the least barrier of 0.49 eV.The corresponding surface energy and structure of intermediate along the reaction path are shown in Figure S9 and Figure S10, respectively.The reaction free energy diagrams of the CO 2 reduction over Ni 3 B, Co 3 B and Fe 2 B are plotted in Figure 3b.As for Ni 3 B, Co 3 B and Fe 2 B, their rate-determining steps of the reaction are the dissociation of CO adduct, which are 0.49 eV, 0.81 eV and 1.33 eV, respectively.The free energy barrier of CO 2 reduction shows the expected trend of Ni 3 B Co 3 B Fe 2 B, consistent with the experimental results that Ni 3 B shows higher CO 2 reduction activity than Co 3 B and Fe 2 B. The above results have revealed the highly active Ni 3 B for promoting photocatalytic CO 2 reduction reaction, and now we are in a position to disclose the advantages of this structure. shows the normalized XANES spectra collected at Ni K-edge for Ni metal, NiO and Ni 3 B. The pre-edge region of Ni 3 B consists of a small peak at 8334 eV whose shape and position are similar to Ni metal, indicating predominance of the Ni 0 state in the sample.Figure 4c shows Fourier transformed EXAFS spectra of Ni metal, NiO and Ni 3 B.For the Ni metal, the peak at 2.20 A corresponds to the Ni-Ni bond.Ni 3 B exhibits a much weaker peak centered at 2.16 A, which is attributed to the Ni-Ni scattering pair in Ni 3 B. 34, 35 This peak position is smaller than that of Ni-Ni (2.20 A) in the Ni foil standard sample, which results from the chemical interaction involved hybridization and electron transfer between B 2p states with the Ni metal d orbitals. 34, 35The Ni-O bond at 1.65 A and Ni-O-Ni bond at 2.58 A are absent in Ni 3 B, indicating the portion of surface Ni 2 oxidation species in Ni 3 B is very low.Ni 3 B displays metallic feature, which can be confirmed by DFT calculations.As shown in Figure 4d, the total density of states (DOS) of Ni 3 B are mainly ascribed to the contribution from the d orbitals of Ni atom, and the values of DOS of Ni 3 B around the Fermi level (E f ) are all continuous without obvious bandgap, demonstrating the metallic feature of Ni 3 B.In addition, the p orbitals of B also displays the continuous nature, indicating the covalent interaction between B and Ni in the metallic state. Figure 5c shows the decay curves of Ru with and without Ni 3 B. The fitted average lifetimes are shown in Table S3, which indicates that the PL average lifetime increases in the following order: pure Ru Ni 3 B/Ru.The lengthened lifetime of Ru in the presence of Ni 3 B is ascribed to the electron transfer from Ru to Ni 3 B, and the electrons are accumulated on Ni 3 B. The mechanism for the photocatalytic CO 2 reduction is displayed in Figure 5d and Figure S13 based on above results and the previous reports in Ru photosensitized systems. 22Under visible light irradiation, the electrons generated from photosensitizer Ru can be transferred to the metal borides cocatalysts.Then, the CO 2 moleculars absorbed on the surface of the metal borides is reduced to CO.The H 2 evolution is regarded as a competing reaction to the CO evolution, and Ni boride is demonstrated as the most effective cocatalyst to suppress the H 2 evolution and simultaneously maintain a record high CO evolution rate.To demonstrate the dominant role of Ni-B bond in Ni 3 B for photocatalytic CO 2 reduction, the cocatalytic performances of Ni 3 B, air treated Ni 3 B, Ni nanoparticles and NiO were Page 12 of 23 Journal of Materials Chemistry A Journal of Materials Chemistry A Accepted Manuscript Published on 01 October 2020.Downloaded by UNSW Library on 10/1/2020 8:54:41 AM.View Article Online DOI: 10.1039/D0TA07072F evaluated and compared.Air treated Ni 3 B was prepared by thermal treatment of Ni 3 B in air at 300 0 C for 2 hours and Ni nanoparticles were prepared by thermal treatment of Ni 3 B in H 2 at 300 0 C for 2 hours.XRD pattern indicates that the air treated Ni 3 B also displays crystalline Ni 3 B phase structure (Figure S14), and H 2 treated Ni 3 B displays crystalline Ni phase structure (Figure S15).The SEM images show that air treated Ni 3 B and H 2 treated Ni 3 B exhibit aggregated particles, which have the similar morphology compared with Ni 3 B (Figure S16).However, the content of Ni-B bond on the surface of air treated Ni 3 B is significantly decreased, as revealed by XPS spectra (Figure S17).The decreased content of Ni-B bond is caused by the thermal oxidation of Ni 0 to Ni 2 in air.The photocatalytic performances of Ni 3 B, air treated Ni 3 B, Ni nanoparticles and NiO in the presence of Ru are shown in Figure S18.It is obvious that Ni 3 B exhibits much higher activity and selectivity than air treated Ni 3 B, Ni nanoparticles and NiO, demonstrating the dominant role of the Ni-B bond for promoting the photocatalytic CO 2 activation and reduction.The lower photocatalytic performance of NiO is due to its semiconducting features, whose conductivity and electron transfer efficiency is much lower than that of Ni 3 B (Figure S19).The existence of Ni-B bond in Ni 3 B is beneficial for the desorption of CO molecular, which can be revealed by the DFT calculations.The calculated CO adsorption energy was -0.27 eV over Ni 3 B(010) surface, which is much weaker than that over Ni(111) (-0.41 eV and -0.72 eV on top site and hollow site, respectively) (see computational details).The charge density analysis in Figure S20 further verifies the lower adsorption energy of CO over Ni 3 B(010) surface than that over Ni(111) surface, indicating COproduct is much easier to be released from Ni 3 B surface, which is one of the reasons why Ni 3 B exhibits much higher activity than Ni nanoparticles for photocatalytic CO 2 reduction (FigureS18). photocatalytic reactions.This work may provide fundamental guidance for the design of Published on 01 October 2020.Downloaded by UNSW Library on 10/1/2020 8:54:41 AM.View Article Online DOI: 10.1039/D0TA07072F This work received financial support from the World Premier International Research Center Initiative (WPI Initiative) on Materials Nanoarchitectonics (MANA), MEXT (Japan), JSPS KAKENHI (JP18H02065), the Photo-excitonix Project at Hokkaido University, National Natural Science Foundation of China (21633004), Fundamental Research Funds for the Central Universities (No. NE2019103). Published on 01 October 2020.Downloaded by UNSW Library on 10/1/2020 8:54:41 AM. The authors declare no competing financial interests. Published on 01 October 2020.Downloaded by UNSW Library on 10/1/2020 8:54:41 AM."
  }
]