[
  {
    "title": "Doi",
    "content": "10.1021/acsami.0c11551"
  },
  {
    "title": "Article_Title",
    "content": "Selective Photocatalytic Reduction of CO<sub>2</sub> to CH<sub>4</sub> Modulated by Chloride Modification on Bi<sub>2</sub>WO<sub>6</sub> Nanosheets"
  },
  {
    "title": "Abstract",
    "content": "Solar-driven photocatalytic CO 2 reduction into CH 4 with H 2 O is considered to be a promising way to alleviate the energy crisis and greenhouse effect.However, current CO 2 photoreduction technologies tend to overlook the role of photooxidation half reaction as well as the effect of the protons produced by water oxidation on CH 4 generation, resulting in low CO 2 conversion efficiency and poor CH 4 selectivity.In the present study, a series of chloride-modified Bi 2 WO 6 nanosheets were constructed in view of chloride-assisted photocatalytic water oxidation.The results show that the CH 4 yield of the synthesized sample can be enhanced up to about 10 times compared to that with no Cl -modification.Besides, the selectivity of CH 4 can be regulated by the loading amount of chloride, varying from 51.29 for Bi 2 WO 6 to 94.98 for the maximum.The increase of product yield is attributed to chloride modification, which not only changed the morphology of the catalyst, but also modified the pathway of water oxidation.Further studies on intermediate products and the density functional theory calculation confirm that the Cl -ions on Bi 2 WO 6 nanosheets not only promote H 2 O oxidation, but also lower the energy barrier for intermediate CHO generation, thus facilitating CH 4 production.The results gained herein may provide some illuminating insights into the design of a highly selective photocatalyst for efficient CO 2 reduction."
  },
  {
    "title": "Experimental",
    "content": "For comparison, pure Bi 2 WO 6 and BiOCl were prepared using the same method.The Bi 2 WO 6 nanosheets were synthesized without adding NaCl, and the product is denoted as BW for brevity.The BiOCl was synthesized without adding Na 2 WO 4 2H 2 O. 2.2.Characterization.Powder X-ray diffraction (XRD; PANalytical X'Pert PRO) was employed to characterize the crystal phases of the catalysts.Transmission electron microscopy (TEM; FEI Tecnai G 2 F20-S-TWIN) and scanning electron microscopy (SEM; Carl Zeiss Sigma 500) were used to observe the morphology of the synthesized samples.The crystal orientation of the samples was determined by a high-resolution TEM (HRTEM) image and a fast-Fourier transform (FFT) diffraction pattern.UV-vis diffuse reflectance spectra (DRS; Agilent Cary 5000) were obtained to investigate the light-harvesting ability of the catalysts.Raman spectra (Renishaw InVia) were employed to characterize the surface structure of the catalysts.The CO 2 adsorption ability was evaluated by CO 2 adsorption-desorption isotherms (Quantachrome Autosorb-IQ2) at 0 C and CO 2 temperature programmed desorption (CO 2 -TPD; Autosorb-iQ) from 50 to 500 C.The chemical environments of elements on the catalyst's surface were characterized by X-ray photoelectron spectroscopy (XPS; PerkinElmer PHI 5300). The intermediate hypochlorite was detected by the spectrophotometry method with the N,N-diethyl-p-phenylenediamine (DPD) reagent as a chromogenic agent (Experimental Section S1.2 in Supporting Information). 2.3.Photocatalytic Performance Tests.The photocatalytic CO 2 reduction activities of catalysts were tested in a 200 mL stainlesssteel reactor with a 300 W Xenon lamp (PLS-SXE300, Beijing Perfectlight Co., Ltd.) as the light source.The catalyst powders (20 mg) were dispersed on a glass substrate uniformly and placed into the stainless-steel reactor.Prior to photoreduction CO 2 tests, the reactor was vacuum-treated and scavenged with high purity CO 2 gas (99.995) five times.Then, the compressed high purity CO 2 gas was passed through a water bubbler to generate a mixture of CO 2 and H 2 O vapor.The mixed CO 2 /H 2 O gas was introduced to the stainless steel reactor to act as a reactant. The products from the reactor were detected by gas chromatography (Agilent 7820A).A flame-ionized detector was adopted to determine CH 4 and CO yields, while a thermal conductivity detector was employed to detect the O 2 yield.It should be noted that apart from CO and CH 4 , other products, including H 2 , C 2 H 4 , C 2 H 6 , HCHO, and CH 3 OH, were not detected within the detection limits of our instrument.The 13 C isotope tracing technique was carried out under identical conditions to verify the source of CH 4 and CO.The obtained products were identified by a gas chromatography-mass spectrometer (GC-MS, Agilent 7890B and OmniStar GSD 320). 2.4.Theoretical Calculations.Density functional theory (DFT) calculations were carried out using the plane-wave technique mentioned in the Vienna Ab initio Simulation Package (VASP) code. 32The interactions between ions and valence electrons were described by the projector-augmented wave method. 33The generalized gradient approximation expressed by the Perdew-Burke-Ernzerhof (PBE) functional was adopted to handle the exchange correlations between electrons. 34,35The detailed computational parameters are shown in Supporting Information.The equilibrium lattice constants of an orthogonal Bi 2 WO 6 unit cell were optimized, when using a 6 6 2 Monkhorst-Pack k-point grid for Brillouin zone sampling.We then use it to construct an O-Bi-O terminated Bi 2 WO 6 (001) surface model with p (2 1) periodicity in the x and y directions and one stoichiometric layer in the z direction with a vacuum layer of 15 A in depth in order to separate the surface slab from its periodic duplicates.The detailed computational parameters are shown in Supporting Information."
  },
  {
    "title": "Results_and_Discussion",
    "content": "3.1.Structural Characterization.XRD measurements were carried out to determine the phase of bare Bi 2 WO 6 and the chloride-modified samples BW-Clx (x 1-5), and the results are shown in Figure 1a.The diffraction peaks of bare Bi 2 WO 6 match well with the standard patterns of orthorhombic Bi 2 WO 6 (PDF no: 01-079-2381).For the chloridemodified samples BW-Clx, all the diffraction patterns are also in good agreement with those of orthorhombic Bi 2 WO 6 with no appearance of other phases.The results indicate that the phase of BW-Clx is not affected when the concentration of chloride is within a certain range in the reaction systems. Raman spectra were further adopted to investigate the structural difference induced by chloride modification (Figure 1b).The peak at 157.1 cm -1 for BW is attributed to the external vibration of WO 6 6-. 36The corresponding peaks for BW-Cl1, BW-Cl2, BW-Cl3, BW-Cl4, and BW-Cl5 were observed to shift to 156.6, 155.1, 154.7, 151.3, 150.9 cm -1 , respectively.A clear trend is observed, that is, the peak at 157.1 cm -1 shifts to a lower wave number with the increasing Cl - content.The reason may be the existence of A 1g internal Bi-Cl stretching (144 cm -1 ), implying that the chlorides are successfully bonded to bismuth ions. 36,37.2.Morphology.The morphology and microstructure of the synthesized BW-Clx and pure Bi 2 WO 6 were investigated by SEM and TEM.Pure Bi 2 WO 6 powders exhibit a flower-like morphology with hierarchical structures (Figure S3a,b).The formation of the flower-like hierarchical structures may be attributed to the high intrinsic anisotropic nature of Bi 2 WO 6 two-dimensional nanosheets as well as the self-assembly of the nanosheets.With an increasing content of Cl -modification, the flower-like morphology is gradually transformed into lamellar aggregates, which mostly consist of parallelly intersected nanosheets (Figure S3c-g).Moreover, the sizes of the aggregates first decrease and then increase with increase in the amount of Cl -content.The collapse of hierarchical structures is probably due to the addition of chlorides. A typical TEM image of BW-Cl3 is shown in Figure 2a.As can be seen, BW-Cl3 is composed of square nanosheets with a width of 20-100 nm and a thickness of 5.9 nm (inset in Figure 2a).Further TEM observation shows that the average thickness of the nanosheets in pure Bi 2 WO 6 is about 10.4 nm (Figure S4).With increasing Cl -content, the thicknesses of the nanosheets for BW-Cl1, BW-Cl2, and BW-Cl3 gradually decrease from 9.3 to 5.9 nm, probably induced by the introduced chloride in the synthetic process. 38When the Cl - content is further increased, the nanosheet thickness for both BW-Cl4 and BW-Cl5 is at around 5.8 nm; respectively, very close to that of BW-Cl3.Figure 2b displays the HRTEM image of selected area in Figure 2a.Three sets of lattice fringes with a distance of 0.272, 0.273, and 0.192 nm can be distinguished clearly.The lattice spacing matches well with the (020), (200), and (220) planes of orthorhombic Bi 2 WO 6 , respectively. 39In addition, the highlighted spots in the simulated FFT pattern (inset in Figure 2b) are well indexed to the above planes.We accordingly deduce that the lamellar Bi 2 WO 6 nanosheets grow preferentially along the 110 and -110 directions, whereas the exposed crystal facet of lamellar Bi 2 WO 6 is 001 (inset of Figure 2a). 39.3.Surface and Composition Analysis.XPS measurements were carried out to elucidate the surface composition and chemical states.In the high-resolution Cl 2p spectra (Figure 3a), two distinct peaks at 199.4 and 197.8 eV, which are attributed to Cl 2p 1/2 and Cl 2p 3/2 , 40 respectively, are observed for BW-Cl3 and BW-Cl5.According to other similar chloride-modified materials, 41 chlorides are considered to be successfully bonded with bismuth ions in our synthesized ones.To determine the Cl content on the surface of the materials, we calculated the molar ratio of Cl/Bi for the representative BW-Cl3, based on the area of peak Cl 2p 3/2 and peak Bi 4f 7/2 (Figures 3a andS5).42 The molar ratio of Cl/Bi on the BW-Cl3 surface is calculated to be 0.25.For comparison, we also measured the Cl/Bi molar ratio of BW-Cl3 by the turbidimetric method.43 The detected Cl/Bi molar ratio is 0.062, far lower than that calculated from the XPS peak area.The results imply that most of the chlorides are modified onto the surface of the BW-Cl3 sample.38 The grafting chlorides on the surface of BW-Cl3 probably inhibit the growth of Bi 2 WO 6 crystals along the 010 direction, resulting in thinner BW-Cl3 nanosheets.38 The O 1s spectra (Figure 3b) can be deconvoluted into three peaks at 530.1, 531.6, and 533.0 eV.The peak at 531.6 eV is related to the surface hydroxyl groups, 44 whereas the peaks at 530.1 and 533.0 eV may be assigned to lattice O atoms and adsorbed H 2 O molecules, respectively.38 In view of the crucial role of hydroxyl groups in the adsorption of H 2 O and CO 2 , the proportion of hydroxyl groups in all oxygen atoms was estimated according to the resolved peak area.24 The percentage of hydroxyl oxygen atoms in all oxygen atoms for Bi 2 WO 6 is 27.6, whereas it decreases to 14.9 and 10.6 for BW-Cl3 and BW-Cl5, respectively.The reason for the decrease of surface hydroxyls of BW-Clx may be attributed to the replacement of hydroxyls by Cl -ions, according to Hao et al. 24 The replacement of hydroxyls by Cl -ions can also be verified by measuring the surface wettability for the synthesized samples (Figure S6).The corresponding band gap can be estimated from the plot of (h) 2 versus photon energy (h) (Figure S7), considering that Bi 2 WO 6 is a direct band gap semiconductor. 45The band gap of BW is calculated to be 2.82 eV, while that of BW-Clx ranges from 2.86 to 2.88 eV.For BW-Clx with different Cl - content, the band gap is almost unchanged but larger than pure Bi 2 WO 6 .The results are consistent with those reported previously.41 The band structure of the prepared materials is very important for CO 2 reduction because of its great influence on the redox reactions occurring on the surface of the photocatalysts.Therefore, we first determine the valence band (VB) of the representative BW, BW-Cl3, and BW-Cl5 by Mott-Schottky plots (Figure S8) and VB XPS spectra (VB-XPS; Figure S9). 46The estimated VB position of BW, BW-Cl3, and BW-Cl5 is located at 2.04, 2.05, and 2.00 V (vs normal hydrogen electrode), respectively.The CB of BW, BW-Cl3, and BW-Cl5 is then calculated to be -0.78,-0.81, and -0.88 eV, respectively, according to the classical approach.47 Accordingly, the band structure of BW, BW-Cl3, and BW-Cl5 can be schemed, respectively, as shown in Figure 4b.The CB positions of BW-Cl3 and BW-Cl5 move upward in comparison with those of BW.The elevated reduction potentials of CB in BW-Clx are beneficial to the CO 2 reduction, as claimed by Zhou et al.48 3.5.CO 2 Adsorption Ability.The CO 2 adsorption ability is a pivotal factor that intensely affects the CO 2 reduction activity of photocatalysts.We thus evaluated the adsorption capacity of BW, BW-Cl3, and BW-Cl5 by measuring their CO 2 adsorption isotherms at different pressures, and the results are shown in Figure 5. BW-Cl3 and BW-Cl5 have higher adsorption capacity than BW, possibly resulting in higher CO 2 reduction ability.24,49 Nevertheless, the CO 2 adsorption capacity of BW-Cl5 is lower than that of BW-Cl3, which may be due to the stronger agglomeration of BW- Cl5 (Figure S3). Siilarly, the results of CO 2 temperatureprogrammed-desorption experiments for BW, BW-Cl3, and BW-Cl5 also prove that BW-Cl3 has the highest CO 2 adsorption capacity (Figure S10). 3.6.Photocatalytic Activities.The photocatalytic CO 2 reduction activities of BW, BiOCl, and BW-Clx (x 1-5) were tested in the presence of water vapor under full spectrum irradiation, and the yields of the products are shown in Figure 6a.The unit of mol/g-cat in the context was adopted to represent the amount of products per gram of photocatalyst.For BW, the yields of CO and CH 4 are 1.90 and 0.50 mol/gcat, respectively, while for BiOCl, they are 1.91 and 0.05 mol/ g-cat, respectively.The main product for BW and BiOCl is CO.After introducing Cl -ions, all the BW-Clx samples exhibit much more CH 4 yield than their pure counterpart.In addition, the main product of BW-Clx varies from CO to CH 4 in the light of Cl -content.For BW-Cl1 with 0.19 wt Cl content, the main product is still CO like BW.However, the yield ratio of products CH 4 to CO increases.As the Cl - content increases, the major product changes from CO to CH 4 , for instance BW-Cl2.The maximal CH 4 yield for BW-Cl3 can reach up to 4.97 mol/g-cat, about 10 times that of BW.When loading more Cl -ions on Bi 2 WO 6 , the yield of CH 4 decreases instead, as shown in other cases (Figure 6a).The activity of CO 2 reduction for BW-Clx (x 1-5) is closely related to their CO 2 adsorption capacity.The greater the adsorption capacity, the stronger the activity.On the other hand, the CO 2 adsorption capacity is relevant to the morphology of the synthesized materials.As stated above, chloride modification greatly affected the morphology of BW-Clx.Consequently, the CO 2 reduction activity of BW-Clx can be regulated by chloride modification. The influence of chlorides on CO 2 reduction can be observed more clearly by product selectivity.The selectivity of CH 4 is defined as the percentage of electrons consumed to produce methane in all reduction products. 8According to the electron transfer number for producing each reduction product (8e -for CH 4 and 2e -for CO), the selectivity of CH 4 is defined as follows.  where n(CH 4 ) and n(CO) are the molar yield of CH 4 and CO formed at a given time, respectively.Figure 6b The results suggest that chloride modification on the surface of Bi 2 WO 6 nanosheets is beneficial for producing methane, and CH 4 selectivity can be adjusted by changing the amount of chlorides.In addition, we calculated the apparent quantum efficiency (AQE) using the total electron transfer number for CO 2 reduction to evaluate energy conversion efficiency (Supporting Information S1.4).The calculated AQE is 0.083 for the optimized photocatalyst BW-Cl3.Still, the energy conversion efficiency is very low, far away from practical application.Blank control tests were conducted to provide strong evidence of the origin of carbonaceous products (Table S1).In the absence of the BW-Cl3 catalyst, light, or CO 2 , the product yields are negligible (Figure 6c), implying that CO and CH 4 are indeed derived from the CO 2 gas.Isotopic tracer experiments were further carried out to provide direct proof for the source of CH 4 and CO.The present peaks of 17 m/z and 29 m/z are assigned to 13 CH 4 and 13 CO products, respectively.With 13 CO 2 as the feed gas, most of the products such as CO and CH 4 carry the signals of 13 C, demonstrating that the produced CH 4 and CO are really derived from CO 2 reduction (Figure 6d). Stability is known to be of importance for CO 2 reduction.The stability for the representative sample BW-Cl3 was thus investigated with each cycle of 9 h (Figure 7a).For the first cycle, BW-Cl3 exhibits a CH 4 yield of 9.86 mol/g-cat and a CO yield of 1.46 mol/g-cat.In the second cycle, the yields of CH 4 and CO decrease to 8.29 and 1.25 mol/g-cat, respectively.The yield drop of products CH 4 and CO probably results from the dissociation of surface Cl - ions. 50,51To prove the assumption of Cl -dissociation, we dispersed the irradiated sample BW-Cl3 into water and detected the dissociated Cl -ions by the turbidimetric method. 43The measured Cl -ion content, which is dissociated from BW-Cl3, is 0.07 wt , equivalent to 11 Cl -ions lost after 9 h of irradiation. To confirm the crucial role of Cl -ions, we immersed the BW-Cl3 sample after the second cycle into a 1 mol/L NaCl solution to reactivate it.As expected, the yields of CH 4 and CO for the NaCl-treated BW-Cl3 are 12.29 and 1.85 mol/g-cat, respectively, higher than that of the fresh catalyst.In the subsequent fourth and fifth cycles, the yield of CH 4 and CO decreases gradually once again.However, the photocatalytic activity of BW-Cl3 could revive as before when treated with NaCl solution, as shown in the sixth cycle.The yields of CH 4 and CO for more cyclical tests are consistent with the abovementioned results (Figure S11).Considering the remarkable effect and the abundant reserve of NaCl, chloride modification on a catalyst surface to refresh photocatalytic activity may be an economic and practicable method for sustainable CO 2 reduction. In order to verify the crucial role of chlorides in the process of CO 2 reduction experimentally, we managed to remove the surface Cl -ions on BW-Cl3 by immersing it in dilute nitric acid (Experimental Section S1.3 in Supporting Information).According to the literature, 41 Bi 2 WO 6 does not dissolve in dilute HNO 3 solution.The results show that BW-Cl3 still maintains the phase of Bi 2 WO 6 after treatment (Figure S12).However, the yield of CH 4 and CO for HNO 3 -treated BW-Cl3, as shown in Figure 7b, is only 1.96 and 1.99 mol/g-cat, respectively.If the yields of CH 4 and CO are converted to electron transfer number as aforementioned, the effect of Cl - ions loss on CO 2 reduction can be seen more clearly.The corresponding total yield based on transfer electron number for the latter is 19.68 mol/g-cat, far lower than that of the untreated BW-Cl3 sample (37.26 mol/g-cat).Apart from the decrease of yield, CH 4 selectivity declines from 94.98 to 79.76.The results, in turn, prove that the Cl -ions play an important role in improving both CO 2 conversion efficiency and CH 4 selectivity.It is noted that the HNO 3 -treated BW-Cl3 still has a higher CO 2 conversion efficiency than BW, which may be attributed to the difference in the morphology (Figures S3 andS4). 3.7.Photocatalytic CO 2 Reduction Mechanism.Based on the results of CO 2 reduction and chloride modification, we speculate the mechanism of chloride-mediated photocatalytic CO 2 reduction in eqs 2-8.Under irradiation, the photocatalyst will absorb photons and produce photogenerated electrons and holes (eq 2).For unmodified Bi 2 WO 6 , water molecules are oxidized by photogenerated holes and produce O 2 and protons (eq 3).Because the formation of one oxygen molecule requires four electrons, direct O 2 evolution is a slow pathway in dynamics. 18For chloride-modified Bi 2 WO 6 , the photogenerated holes (h ) are consumed by self-oxidation of modified Cl -ions, producing Cl 2 (eq 4). 19The produced Cl 2 reacts with water molecules to form hypochlorous acid (HClO) and protons (eq 5). 23The generated HClO would further decompose into O 2 and Cl -ions (eq 6). 22During the process of Cl -oxidation, carbon dioxide molecules are reduced to CO or CH 4 in the presence of the produced protons (eqs 7 and 8).As a result, the chloride-assisted CO 2 reduction reactions are achieved, as shown in Figure 8.In the process of CO 2 reduction, the surface Cl -ions are supposed to act as the oxidation reaction site. 19Under the assistance of Cl -ions, the degree of difficulty for oxidation half reaction is greatly reduced, thereby promoting the activity of reduction half reaction (CO 2 reduction). To verify the above mechanism, we detected the presence of hypochlorous acid by the spectrophotometry method using DPD as the chromogenic agent.It is reported that DPD reagent can be oxidized by HClO, and that the oxidation product can be measured by a spectrophotometer. 23The absorption spectra are shown in Figure 9. Two peaks at around 511 and 552 nm can be observed for the irradiated BW-Cl3, while no peak appears for fresh BW-Cl3.According to Iguchi and co-workers, 23 the intense peaks are derived from the oxidation of Cl -ions.The results suggest that a part of the Cl - ions on the surface of BW-Cl3 are indeed oxidized to HClO under irradiation. To further estimate the balance of electron transfer number for oxidation and reduction half reaction, the yields of O 2 , HClO, CO, and CH 4 were detected for BW-Cl3 irradiating for 12 h.The yield of products CO and CH 4 is 1.83 and 9.64 mol/g-cat, respectively.Correspondingly, the total electron number of the obtained is 80.78 mol/g-cat.Similarly, the total number of lost electrons for producing O 2 and HClO is 83.66 mol/g-cat, according to their yields 17.3 and 7.23 mol/g-cat.The total lost electron number is approximately equal to that of the obtained, proving that the reduction half reaction basically keeps in balance with the oxidation half reaction. Based on the abovementioned results, we consider that it is correct for the mechanism of chloride-mediated reaction.When introducing chlorides on the synthesized materials, the formation of the intermediates such as HClO in the process of CO 2 reduction is more advantageous in kinetics than producing O 2 directly. 18,202112223 According to Huang et al., 21 the activation energy for HClO formation is lower than that for water oxidation.Therefore, we can conclude that it is the decrease of activation energy that results in the increase of oxidation half reaction activity.The promoted oxidation half reaction would supply more abundant dissociated electrons, thus resulting in the improvement of CO 2 reduction half reaction. 19,52On the other hand, the abundant dissociated electrons would lead to a higher surface photogenerated electron density of photocatalysts, which may accelerate the dynamics of multi-electron methane production. 8o get clarity on the reactive sites of Cl -ion-modified Bi 2 WO 6 at an atomic level, we conducted DFT calculations with a PBE functional to further illustrate the CO 2 activation mechanism, and the results are shown in Figure 10.It should be noted that the adopted PBE formulation may over bind CO, which would reduce the accuracy of the energetics.Therefore, we only use calculation results to roughly observe the trend of adsorption energy for intermediates.In the model of chloridemodified Bi 2 WO 6 , partial hydroxyl groups on the Bi 2 WO 6 surface were replaced by Cl -ions to simulate surface chlorides. 24The adsorbed CO 2 molecules on both Bi 2 WO 6 and chloride-modified Bi 2 WO 6 are considered to be initially hydrogenated to COOH. 10The intermediate COOH is converted to CO and OH, which then transform to intermediates CO and H 2 O, respectively. 13The intermediate CO may be desorbed from the surface to generate CO (pathway I) or hydrogenated with proton to form CHO (pathway II).The CO desorption energy for chloride-modified Bi 2 WO 6 is calculated to be 6.42 eV, higher than that for Bi 2 WO 6 (6.06 eV).The results imply that the Cl -ions bonded on the Bi 2 WO 6 surface can hinder CO desorption, which is beneficial for further protonation of CO. 53On the other hand, the chloride-modified Bi 2 WO 6 has lower CHO generation energy (4.21 eV) than bulk Bi 2 WO 6 (4.75 eV), indicating that the intermediate CO is easier to be protonated with the existence of Cl -ions. 10,13In brief, with the surface Cl -ions, CO 2 is probably reduced more to CHO through pathway II rather than pathway I (CO desorption).It is to be noted that the generation of CHO is a critical step for CH 4 formation. 10,13It can thus be concluded that the modification of Cl -ions facilitates the generation of CH 4 and increases CH 4 selectivity."
  },
  {
    "title": "Conclusions",
    "content": "A series of chloride-modified Bi 2 WO 6 nanosheets are rationally constructed by taking into account the roles of chlorideassisted photocatalytic oxidation.The chloride-modified photocatalysts exhibit excellent CO 2 reduction activity and high CH 4 selectivity than pure Bi 2 WO 6 .The optimal chloridemodified Bi 2 WO 6 achieves a 4.97 mol/g-cat CH 4 yield with 94.98 selectivity after a 3 h illumination.More importantly, cyclic experimental results show that CO 2 reduction activity of the catalyst can be reactivated repeatedly when the catalyst is simply treated with NaCl solution.A CO 2 reduction mechanism involving chloride is thus proposed and further testified by detection of HClO and O 2 .In the presence of chlorides, the photooxidation water half reaction is greatly promoted via the mediating effect of Cl -ions.Simultaneously, the produced protons facilitate the formation of methane, thus resulting in enhanced CH 4 selectivity.DFT calculations further confirm that the presence of Cl -ions on Bi 2 WO 6 nanosheets is capable of lowering the energy barrier for intermediate CHO Figure 1.(a) XRD patterns of BW and BW-Clx (x 1-5); (b) Raman spectra of BW, BW-Cl3, and BW-Cl5. Figure 2. (a) TEM image of BW-Cl3 (inset: schematic illustration of Bi 2 WO 6 crystal orientation and the image of vertically standing nanosheets); (b) HRTEM image of BW-Cl3 of the selected area (inset: corresponding FFT pattern). Optical Properties and Band Structure. Figure 4 shows the results of UV-vis DRS for BW and BW-Clx.All the absorption edges of BW and BW-Clx are at around 450 nm. Figure 3. High-resolution XPS spectra of Cl 2p (a) and O 1s (b) for BW, BW-Cl3, and BW-Cl5. Figure 4. (a) UV-vis DRS of BW and BW-Clx; (b) diagram of the energy band structure of BW, BW-Cl3, and BW-Cl5. Figure 5. CO 2 adsorption isotherms of BW, BW-Cl3, and BW-Cl5. Figure 6.Yields (a) and selectivity (b) of CO and CH 4 for BW, BiOCl, and BW-Clx (x 1-5) for 3 h; (c) yields of CO and CH 4 under various conditions for 3 h; and (d) GC-MS analyses for CO and CH 4 produced with 13 CO 2 as feed gas. Figure 7. (a) Cyclic photocatalytic activity of BW-Cl3 and BW-Cl3 reactivated with NaCl solution; (b) yields of products for BW, HNO 3 -treated BW-Cl3, and BW-Cl3. Figure 8. Schematic illustration of the possible CO 2 reduction mechanism. Figure 9. Absorption spectra in the DPD test for BW-Cl3 before and after photoirradiation for 1 h. The ultrathin Bi 2 WO 6 nanosheets were synthesized via a simple hydrothermal method with the assistance of NaCl solution.Typically, 83 mg of Na 2 WO 4 2H 2.1.Catalyst Preparation. 2 displays the calculated selectivity of CH 4 and CO for all samples.Pure BW and BiOCl exhibit 51.29 and 9.48 CH 4 selectivity, respectively.For BW-Clx samples, CH 4 selectivity first increases and then decreases, depending on the Cl -content, and BW-Cl3 exhibits the highest CH 4 selectivity of 94.98. 22 https://dx.doi.org/10.1021/acsami.0c11551ACS Appl.Mater.Interfaces XXXX, XXX, XXX-XXX B https://dx.doi.org/10.1021/acsami.0c11551ACS Appl.Mater.Interfaces XXXX, XXX, XXX-XXX C https://dx.doi.org/10.1021/acsami.0c11551ACS Appl.Mater.Interfaces XXXX, XXX, XXX-XXX D https://dx.doi.org/10.1021/acsami.0c11551ACS Appl.Mater.Interfaces XXXX, XXX, XXX-XXX E https://dx.doi.org/10.1021/acsami.0c11551ACS Appl.Mater.Interfaces XXXX, XXX, XXX-XXX F https://dx.doi.org/10.1021/acsami.0c11551ACS Appl.Mater.Interfaces XXXX, XXX, XXX-XXX https://dx.doi.org/10.1021/acsami.0c11551ACS Appl.Mater.Interfaces XXXX, XXX, XXX-XXX H https://dx.doi.org/10.1021/acsami.0c11551ACS Appl.Mater.Interfaces XXXX, XXX, XXX-XXX I We would like to thank the financial supports of National Natural Science Foundation of China (nos.21671176 and 21471133) and Key scientific research projects of colleges and universities in Henan Province (no.20A150041). G generation, facilitating CH 4 production.The knowledge gained herein is expected to be useful in developing reusable photocatalysts and in understanding the mechanism of selective photocatalytic CO 2 reduction. The Supporting Information is available free of charge at https://pubs.acs.org/doi/10.1021/acsami.0c11551. Additional data for TEM images, XRD, XPS, valenceband XPS, contact angles test, and CO 2 -TPD (PDF)"
  }
]