[
  {
    "title": "Doi",
    "content": "10.1016/j.apsusc.2022.152463"
  },
  {
    "title": "Article_Title",
    "content": "Electron-induced enhanced interfacial interaction of the CuO/BiOCl heterostructure for boosted CO2 photoreduction performance under simulated sunlight"
  },
  {
    "title": "Abstract",
    "content": "To help China achieve its goal of carbon neutrality, a CuO/BiOCl heterostructure with enhanced electroninduced interfacial interactions and improved CO 2 photoreduction performance was hydrothermally synthesized in situ.The electrons originating from the surface residual CTAB urea reacted with the CuO component to generate Cu 2 O, and between them BiOCl played the bridged role to transfer the electrons, which strengthened the intense contact between the two components, thus harvesting light and promoting the segregation and transfer efficiency of the photogenerated carriers.Furthermore, the greater number of generated electrons could enhance the activation of CO 2 , which could decrease the energy barriers of the thermodynamically stable CO 2 and especially promote the formation of CO 2 -reduced intermediates (HCOOH, HCO 3 -).As a result, the CO 2 photoreduction performance of the electron-induced heterostructure of CuO/BiOCl composites exhibited higher CH 4 and CH 3 OH yields than neat CuO or BiOCl, in which the optimized BC2 photocatalyst (2 mass ratio of CuO to BiOCl) reached 114.1 molh -1 g -1 CH 4 and 36.2 molh -1 g -1 CH 3 OH.This work provided a new strategy to synthesize efficient heterojunctions that can improve the photocatalytic reduction of CO 2 ; these heterojunctions were constructed with a strong interaction interface via self-electron-reduction."
  },
  {
    "title": "Experimental",
    "content": "Copper sulfate (CuSO 4 ), sodium hydrate (NaOH), bismuth chloride (BiCl 3 ), cetyltrimethyl ammonium bromide (CTAB), urea (CO(NH 2 ) 2 ) and ethanol were purchased from Sinopharm Chemical Reagent Co., Ltd.(China).The reagents were all of analytical grade and used without further purification.Deionized water (H 2 O) purified with a Millipore purification system was used throughout all experiments. 1 g CuSO 4 was added into 400 mL H 2 O to form a homogeneous aqueous solution, in which H 2 O was maintained at 55 C before the addition of CuSO 4 .After stirring vigorously for 0.5 h, 0.4 g NaOH was added and then the temperature was heated up to 70 C. The mixed suspension was stirred until the blue precipitate was no longer produced.Next, the mixture was cooling down to room temperature, and the precipitate was separated under the centrifugation whilst washing with H 2 O and ethanol for several times.After drying at 60 C for 12 h, the final product was obtained and identified as CuO. A hydrothermal process was used to prepare the CuO/BiOCl composites.First, the obtained CuO was ultrasonically dispersed in 50 mL of ethanol, and then a certain amount of BiCl 3 was added so that the mass ratio of CuO to BiOCl was 1 wt, 2 wt or 3 wt.After continuous stirring for 0.5 h, the CTAB and urea reagents were added to the solution, which was stirred for 1 h.The mass ratio of the added BiCl 3 , CTAB and urea was 3:1:1.During the hydrothermal process, the temperature was maintained at 180 C for 24 h.After cooling to room temperature naturally, the mixture was centrifuged with H 2 O and ethanol several times.Following drying at 60 C, the final product was obtained and named BCx (x 1, 2, 3, referring to the mass ratio of CuO).Pure BiOCl was synthesized for comparison and simplified as BOC.The preparation process was similar to that used to obtain the CuO/BiOCl composites, the difference being that CuO was absent. Detailed descriptions of the applied characterization methods and the CO 2 photoreduction testing conditions are summarized in the Supporting Information."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The crystal structures of the prepared neat BiOCl, CuO and CuO/ BiOCl composites were investigated via XRD, as shown in Fig. 1(a).The observed peak positions in the pure BiOCl sample all matched the typical tetragonal structure of standard BiOCl (JCPDS No. 06-0249).As was observed in our previous work 21, the intensity of the peak at 32.5 ((1 1 0) face) on pure BiOCl was stronger than that of the peak at 33.4 ((1 0 2) face), and the former peak displayed the highest peak intensity among all peaks, which was contrary to the standard peak.This result indicated that the (1 1 0) face was the main exposed face, which was proven to be the active face for photocatalysis 30.The peaks of the pure CuO sample all matched those of the standard CuO (JCPDS No. 44-0706), in which two obvious peaks at 35.2 and 38.5 represented the (1 1-1) and (1 1 1) faces.In addition, no peaks corresponding to Cu 2 O were found, indicating the purity of the synthesized CuO sample.However, in the diffraction patterns of the CuO/BiOCl series composites, the peaks assigned to CuO, Cu 2 O and BiOCl all appeared, and the composites mainly exhibited BiOCl patterns.After the CuO x species were loaded on BiOCl, the main exposed face of BiOCl changed from the (1 1 0) to (1 0 2) face, and the crystal structure of the CuO x species converted from a single phase to a mixed phase.The results indicated the successful construction of mixed-phase heterostructured CuO-Cu 2 O/ BiOCl, and there was strong contact between the CuO x species and BiOCl due to electron transfer.To explore the generation process of Cu 2 O during the preparation, two different synthetic procedures were applied, in which CTAB urea or BiCl 3 was absence during the preparation of the composites.The obtained products were analyzed by XRD technique, as displayed in Fig. S1.The results showed that the peaks corresponded to CuO were found alone over BiCl 3 -absence sample, while the peaks assigned to CuO and BiOCl were both appeared over CTAB urea-absence sample.No peaks ascribed to Cu 2 O was found over these two samples.The absence of peaks assigned to Cu 2 O over CTAB ureaabsence sample indicated that the electrons to reduce CuO were not originated from BiOCl, which might originate from CTAB or urea.However, there were also no peaks corresponded to Cu 2 O was found The morphologies of pure BiOCl, CuO and the CuO/BiOCl composites were observed via SEM.As displayed in Fig. 1(b), SEM images revealed the fusiform shape of pure CuO and the lamellar morphology of pure BiOCl.Lamellar shapes were mainly observed in the images of the BC2 sample, indicating that the main body of the composite was BiOCl, which was in accordance with the XRD results.Compared with that in pure BiOCl, the surface of the lamella in the BC2 was rougher due to the addition of CuO x species.A similar phenomenon occurred in both the BC1 and BC3 samples, as displayed in Fig. S2.The roughness of the lamellar surface increased with increasing amounts of added CuO x .To confirm the presence of CuO x species on the surface of the BiOCl, EDS mapping was applied to the BC2 sample, as shown in Fig. 1(c).The results showed the presence and good dispersion of CuO x species on the surface, although Cu particles were sparse compared to Bi particles due to the low addition of the Cu precursor during preparation.The SEM results also verified the successful construction of mixed-phase heterostructured CuO-Cu 2 O/BiOCl, and the disappearance of fusiform CuO and the appearance of rough lamella in the composites further demonstrated the strong interactions between CuO x species and BiOCl. The morphology of the three samples, especially that of the interface between CuO x species and BiOCl, was observed on a smaller scale via TEM and HR-TEM, as displayed in Fig. 2. The same morphologies as those shown in the SEM images were also observed in the TEM images of pure CuO, pure BiOCl and BC2.In addition to the rough surface, some small particles around the lamellar BiOCl were observed in the image of the BC2 composite.For the pure CuO sample, mainly two kinds of lattice spacings appeared, which were assigned to the (1 1 1) and ( -1 1 1) faces of CuO.An additional polycrystal diffraction ring on the ( -2 0 2) face was found in the selected-area electron diffraction (SAED) image.One periodical lattice fringe assigned to the (1 1 0) face of the pure BiOCl was exhibited, while another facet corresponding to (2 0 0) was found in the SAED image.In the image of the BC2 composite, the small particles capped over the lamellar BiOCl were proven to be Cu 2 O and displayed a lattice spacing of 0.246 nm, assigned to the (1 1 1) face of Cu 2 O.Moreover, an unclear lattice fringe occurred due to the capping of CuO x species, thus leading to the rough surface of the lamella; such a lattice fringe was not observed on the pure BiOCl.This phenomenon also confirmed the strong interaction between the CuO x species and BiOCl.In the SAED image, only a single crystal diffraction spot corresponding to BiOCl appeared, indicating that the main body of the composite was BiOCl, which was in accord with the XRD results. The chemical composition and electronic state on the surface of the pure BiOCl, the CuO and the BC2 composite were investigated via XPS, as shown in Fig. 3.The XPS survey spectra (Fig. S3) confirmed the existence of Bi, Cl, Cu and O elements on the surface of the catalysts.Two peaks were observed in the Bi 4f spectrum, in which the peak at a low binding energy (BE) was assigned to Bi 4f 7/2 , while the peak at a high BE was assigned to Bi 4f 5/2 31.The interval value of approximately 5.3 eV between the two splitting orbitals confirmed the presence of Bi 3 32.In the O 1 s spectrum, two apparent peaks were found in which a low BE peak was related to lattice oxygen, such as Cu-O and Bi-O bonding, while a high BE peak was related to adsorbed oxygen, caused by the generated oxygen vacancies 33.The two fitting peaks in the Cl 2p spectra at high BE and low BE were assigned to Cl 2p 1/2 and Cl 2p 3/2 , respectively 34.For Cu 2p spectra in pure CuO, the peaks at 953.52 eV and 933.63 eV were related to Cu 2p 1/2 and Cu 2p 3/2 of Cu 2 species 35.However, after the combination with BiOCl, the peak intensity was obviously weakened, and the corresponding two peaks shifted to a low BE, supporting the generation of Cu 1 species 36, which was in accord with the XRD results.In addition, the marked yellow area was related to the split Cu 2p shake-up peak.In all the obtained XPS spectra of these three samples, a peak shift was observed after CuO and BiOCl were combined.To confirm the existence of N or Br element on the surface, XPS technique was applied, as shown in Fig. S4 (a-c).The results showed that the N and Br could be detected on the surface of BC2 composite, and the intensity of Br 3d was stronger than that of N 1 s, in which Br 3d appeared in the survey spectra while N 1 s could not be observed clearly.To investigate the existence form of these two elements, the comparison among BC2 composite, pure BiOCl and the standard card was applied, as displayed in Fig. S4 (d e).The comparison of XRD peak between BC2 composite and the standard card indicated that the synthesized composite was well matched with the standard BiOCl (JCPDS No. 06-0249), and the peaks assigned to BiOBr were barely observed.The comparison of XRD peak between BC2 composite and pure BiOCl showed that no peak shift was found, indicating that the N element was not doped into the lattice.Therefore, the N and Br element were still existed in the form of urea and CTAB on the surface of BC2 composite.The reported work also confirmed that CTAB was hardly to be removed by the normal centrifugalization and washing with H 2 O 37. The band structures of two separate materials were explored, which resulted in a better understanding of the band structure of the composite and the photocatalytic mechanism.As displayed in Fig. 5(a), the valence-band maximum (E VB ) was obtained by VB-XPS spectroscopy, in which BiOCl alone exhibited a value of 2.29 eV, while CuO alone exhibited a value of 0.22 eV.The band gap (E g ) was calculated from the Tauc plot, which was converted from the UV-vis DRS spectra, as shown in Fig. 5(b).The square root of (Ahv) indicates the indirect transition of the sample, while the square represents the direct transition 33.The converted Tauc profiles of the CuO and BiOCl showed that they are both direct-transition semiconductors, and the E g values were 1.43 eV and 3.43 eV, respectively.Hence, the obtained conduction-band minimum (E CB ) values were -1.21 eV and -1.14 eV, corresponding to CuO and BiOCl, respectively.The value of the flat band (V fb ) was acquired by Mott-Schottky measurement, as displayed in Fig. 5(c).In general, the position of V fb was close to the Fermi level 38.The V fb values of CuO and BiOCl alone were plotted at -0.55 and -0.20, respectively, in units of V vs. Ag/AgCl.To match the units of the E VB and E g , this unit was converted to a normal hydrogen electrode (NHE) potential according to the following formula 39: After transformation, the V fb of CuO and BiOCl was obtained as -0.353 eV and -0.003 eV, respectively.In addition, the positive slope of the plotted profiles manifested the n-type semiconductors of both CuO and BiOCl 21.Based on the above results, the band structures of CuO and BiOCl alone are schematically illustrated in Fig. 5(d).The E VB and E CB of BiOCl alone were both higher than those of CuO alone, but their V fb values were close to each other, which could promote their intense contact and the formation of a strong heterostructure; this result verifies the phenomenon shown in the TEM images. The photocatalysis performances of all the catalysts were evaluated by the photoreduction of CO 2 (CO 2 RR) under simulated sunlight, as shown in Fig. 6(a).The products of CO 2 RR were detected to be CH 4 and CH 3 OH over all catalysts, and the yields of CH 4 were all higher than those of CH 3 OH because the reduction potential of CH 4 was lower than that of CH 3 OH (CO 2 /CH 4 -0.24eV, CO 2 /CH 3 OH -0.38 eV).Compared to the two individual catalysts (BiOCl and CuO), the heterostructured composites exhibited higher CH 4 and CH 3 OH yields, and the BC2 catalyst displayed the optimum CO 2 RR activity, which was 114.1 molh -1 g -1 CH 4 and 36.2 molh -1 g -1 CH 3 OH.This result indicated that the strong interactions between CuO and BiOCl benefited the CO 2 reduction process by greatly accelerating the photoinduced carrier transfer that occurred on the heterostructured interface.The selectivity of the two products over all catalysts was calculated, as shown in Fig. 6 (b).The selectivity of CH 4 over all catalysts was approximately 80, indicating that the formation of a heterostructure had little influence on the selectivity.In addition, the obviously different boiling points of CH 4 and CH 3 OH enabled their easier separation.Due to the observation of Cu 2 O in the composite, the role of Cu 2 O played in the photoreduction of CO 2 was investigated.The role of Cu 2 O could be reflected by its content in the composites, which could be obtained from the peak intensity in XRD patterns.The peak assigned to Cu 2 O at 42.4 and the highest peak corresponded to BiOCl at 33.4 was selected to calculate the content of Cu 2 O in the composite, as displayed in Table S1.It could be seen that the generated Cu 2 O played the positive role in the CH 4 and CH 3 OH yield amount, while it exhibited less influence on the CH 4 and CH 3 OH selectivity.Combined with the above proposed formation process of Cu 2 O, the increase of Cu 2 O content in the composites was ascribed by the increase of electrons transfer from CTAB or urea to CuO via the bridged BiOCl, which could lead to the stronger contact between CuO and BiOCl and promote more photoinduced electrons to participate CO 2 photoreduction, thus leading to enhancement of CH 4 and CH 3 OH yield amount.The H 2 and O 2 evolution reactions (HER and OER) were also tested over the synthesized catalysts, and their yield amounts were listed in Table S2.The results showed that all catalysts exhibited HER activity, due to the more negative potential than HER potential 40, while the product of O 2 could not be detected.The disappearance of O 2 evolution might be caused by the consumption of OH by the intermediate of CO 2 and CH 3 to generate CH 3 OH.Moreover, the variation tendency of HER performance over these catalysts were in accord with CO 2 photoreduction performance, indicating that the active species of H to generate H 2 was the key intermediate during the CO 2 reduction process. The catalytic durability of the catalyst was a significant performance index, therefore the cyclic durability tests over the optimized BC2 composite was conducted, as shown in Fig. S5.The durability test is described as where a used sample is collected by a centrifugal process for the next CO 2 photoreduction test.The results showed that the CH 4 and CH 3 OH yields were decreased slightly after a fourth cyclic test, indicating that the synthesized BC2 composite possessed satisfactory stability properties. The light response capacity of all catalysts was investigated via UV-vis absorption spectroscopy, as displayed in Fig. 7(a).Among all catalysts, the CuO catalyst alone exhibited the strongest light response capacity, while the BiOCl catalyst alone displayed the weakest light response capacity.The three composites had a similar light response. The absorption edge (AE) of the BiOCl alone appeared at 387 nm, the same wavelength as the absorption edge in Li's work 24; it was located in the wavenumber range of UV excitation.When the CuO component, which had a near-infrared light response, was combined with BiOCl, the AE of the composites shifted to the visible light response range, and they had similar AE values.The above results indicated that the introduction of CuO to BiOCl enhanced the light response and the excitation of carriers under visible light.Moreover, the similar spectra of the BiOCl alone and the BC composite confirmed the presence of the BiOCl matrix and the formation of a heterostructure.The separation of the photoinduced carriers was explored by photoluminescence (PL) spectroscopy, as shown in Fig. 7(b).Generally, the strong peak intensity represents the easy recombination of photoexcited carriers 41.The PL results showed that the introduction of CuO helped inhibit the photoinduced carriers, indicating that the construction of a heterostructure between BiOCl and CuO improved the separation of photoexcited carriers.Electrochemical impedance spectroscopy (EIS) and the resulting Nyquist plots were applied to investigate the migration capability of photoinduced carriers, as displayed in Fig. 7(c).As was observed in the UV-vis and PL spectra, the introduction of CuO enhanced the carrier migration ability after the formation of a heterostructure, as it contributed to the decrease in the arc radius of the Nyquist plot 42.A photocurrent test was carried out to observe the yield of photoinduced carriers under simulated sunlight illumination, as displayed in Fig. 7(d).The BC composites exhibited an obviously higher peak intensity than BiOCl alone, indicating that the introduction of CuO could also improve the photocurrent response.As with the CO 2 RR performance, the enhancement of photoreduction activity over BC composites was ascribed to the successful construction of a heterostructure and the strong interaction between CuO and BiOCl, which promoted the visible light response, inhibited the recombination of photoinduced carriers, accelerated the migration of the carriers and enhanced the photocurrent response. To investigate the influence of surface oxygen vacancies on the photocatalytic reduction activity of CO 2 , the ESR spectra of pure CuO, pure BiOCl and BC2 composite were applied, as shown in Fig. 8.The results exhibited that all three samples showed an obvious signal at g 2.002, which was assigned to the oxygen vacancies 20.The peak intensities of three samples were measured to be 0.0595, 0.0358 and 0.0178, representing for BC2 composite, pure CuO and pure BiOCl, respectively.The results demonstrated that the synthesized BC2 composite possessed the highest oxygen vacancies concentration among three samples, which benefited for the photocatalytic reduction of CO 2 . The pathway of CO 2 photoreduction on the BC composite was explored by in situ DRIFTS, as displayed in Fig. 9 Based on the obtained XRD, XPS and photocatalytic activity results, the specific CO 2 photoreduction pathway is described below.The formation of Cu 2 O indicated the vast generation of electrons during the construction of the heterostructure between CuO and BiOCl, and these generated electrons could react with the adsorbed CO 2 to form CO 2 -. Therefore, the peak assigned to CO 2 -was observed throughout the whole process, as displayed in Fig. 9"
  },
  {
    "title": "Conclusions",
    "content": "In summary, the strong electron-induced interfacial interaction of the CuO/BiOCl heterostructure was prepared in situ via a simple hydrothermal method, and the influence of the CuO to BiOCl ratio on CO 2 photoreduction performance under simulated sunlight was explored.The results indicated that CuO was reduced to Cu 2 O by the surface residual CTAB urea, and BiOCl played the bridged role to transfer the electrons from CTAB urea to CuO, thus forming an intense interface between CuO and BiOCl, which was confirmed by XRD, TEM, XPS and DFT calculations.The generated enhanced interfacial interaction could harvest the light adsorption and promote the separation and transport efficiency of the photogenerated carriers, which was demonstrated by UV-vis absorbance spectra, PL, EIS and ESR techniques, thus enhancing the CO 2 photoreduction activity.Among the composites with different CuO to BiOCl ratios, BC2 exhibited the optimized ratio, which reached 114.1 molh -1 g -1 CH 4 and 36.2 molh -1 g -1 CH 3 OH.The two generated products could be separated easily due to the obviously different boiling points.Importantly, in addition to the construction of an intense interfacial interface, the electron-enriched surface heterostructure benefited from the activation of CO 2 and the reduction of CO 2reduced intermediates (HCOOH, HCO 3 -).This work provides new insight into the synthesis heterostructures with intense interfaces and outstanding photoreduction performance to achieve the goal of reaching carbon neutrality in China as soon as possible. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Fig. 1.(a) XRD patterns and (b) SEM images of pure CuO, pure BiOCl and the CuO/BiOCl composites.(c) EDS mapping images of the BC2 composites. Fig. 2. TEM (a), HR-TEM (b) and SAED (c) images of pure CuO, pure BiOCl and the BC2 composite. Fig. 3. XPS spectra (Bi 4f, O 1 s, Cu 2p and Cl 2p) of three selected samples (BOC, CuO and BC2). Fig. 4. Charge density difference contour plot at the BiClO-CuO(1 1 1) interface. Fig. 5. VB-XPS (a), Tauc plot (b), Mott-Schottky measurement (c) and illustrated band structures (d) of CuO and BiOCl alone. Fig. 6.Performance of CO 2 photoreduction (a) and product selectivity (b) over pure CuO, pure BiOCl and the CuO/BiOCl composites. Fig. 7. UV-vis absorbance spectra (a), PL spectra (b), EIS Nyquist plots (c) and photocurrent profiles (d) of pure CuO, pure BiOCl and the CuO/BiOCl composites. (a).In total, six peaks could be observed over the BC2 composite, including those of adsorbed H 2 O (1648 cm -1 ), monodentate carbonates (m-CO 3 2-, 1539 cm -1 ), bicarbonate (HCO 3 -, 1415 cm -1 ), formic acid (HCOOH, 1392 cm -1 ), bidentate carbonates (m-CO 3 2-, 1344 cm -1 ) and adsorbed CO 2 (CO 2 -, 1270 cm -1 ) 43.The results showed that the peaks assigned to m-CO 3 2-, b-CO 3 2-and CO 2 -were observed when pure CO 2 was injected, and the peak ascribed to adsorbed H 2 O arose when H 2 O was added.After illumination with simulated sunlight, two new peaks ascribed to HCO 3 -and HCOOH appeared.Moreover, the intensity of these two peaks increased with the extension of illumination.Notably, the peaks assigned to mwere maintained with the addition of H 2 O and simulated sunlight.Based on the above results, the following possible reaction pathway over BC2 was proposed: H 2 O h H OH CO 2 e CO 2 -CO 2H e HCOOH, CO 2 - OH HCO e C(ads), C(ads) H CH 3 , CH 3 H CH OH CH 3 OH b), and the vast generation of electrons (originated from the residual CTAB urea) was the key to deducing the above pathway, which could be confirmed by the formation of Cu 2 O.The existence of BiOCl played the bridged role to transfer the electrons from CTAB urea to CuO.Hence, the generation of Cu 2 O not only indicated the intense connection between CuO and BiOCl, which promoted the segregation and transfer capability of the photoinduced carriers, but also confirmed the vast generation of electrons on the surface, which promoted the reduction of the adsorbed CO 2 on the surface. Fig. 9.In situ DRIFTS spectra over BC2 composite. Conceptualization, Methodology, Writingoriginal draft, Visualization.Caichao Ye: Resources, Visualization.Xue Yu: Data curation, Resources, Investigation.Jiayu Tang: Data curation, Resources, Investigation.Yunxia Zhao Discussion: Writingreview editing.Wei Cai: Supervision, Project administration, Writingreview editing. (a).The participating H and OH were obtained via the decomposition of H 2 O at the reduction potential of BiOCl or CuO, and then the formed CO 2 -reacted with H and OH to generate HCO 3 -and HCOOH.Subsequently, HCO 3 -and HCOOH were reduced by the generated electrons on the surface to form carbon free radicals (C(ads)), which could be hydrogenated by H (originating from the decomposition of H 2 O) to form CH 3 .Next, CH 4 and CH 3 OH could be obtained via the reaction between CH 3 and H or OH.The above description is illustrated in ESR spectra of pure CuO, pure BiOCl and BC2 composite. Fig. 8. This work was financially supported by the National Natural Science Foundation of China (51808296), the Research Innovation Program for College Graduates of Jiangsu Province (SJCX210377) and the Startup Foundation for Introducing Talent of NUIST (2243141601034).Additionally, C. Ye acknowledge the support from Guangdong Provincial Key Laboratory of Computational Science and Material Design (2019B030301001) and Guangdong Innovation Research Team Project (2017ZT07C062).Computing resources were supported by Center for Computational Science and Engineering at Southern University of Science and Technology. Supplementary data to this article can be found online at https://doi. org/10.1016/j.apsusc.2022.152463."
  }
]