[
  {
    "title": "Doi",
    "content": "10.1016/j.cej.2021.131249"
  },
  {
    "title": "Article_Title",
    "content": "A solar photothermocatalytic approach for the CO2 conversion: Investigation of different synergisms on CoO-CuO/brookite TiO2-CeO2 catalysts"
  },
  {
    "title": "Abstract",
    "content": "The photoactive features of the least common polymorph of TiO 2 , i.e. brookite, were combined with the thermocatalytic redox ones of cerium oxide, focusing on the effects of the addition of small amounts of Co-Cu oxides for the solar CO 2 conversion.By considering the characterization data, a surface segregation of the hosted metal oxides on the TiO 2 -CeO 2 composite was evidenced, and their presence increased the amount of oxygen vacancies and improved the charge carriers separation.The bimetallic oxides-based sample was the most performing one in the photocatalytic carbon dioxide reduction at room temperature.The formation of carbon monoxide and methane was 5 and 0.5 mol g -1 h -1 , respectively, i.e. about 10 times higher than that found with bare brookite.A further enhancement was obtained with the same CoO-CuO/TiO 2 -CeO 2 catalyst applying the photothermal approach.The CO 2 -TPD and the FTIR measurements highlighted the high interaction between CO 2 and the surface sites."
  },
  {
    "title": "Experimental",
    "content": "The CO 2 photoreduction at room temperature was performed using a home-made quartz reactor, filling it with 0.2 g of catalyst and irradiating with a solar lamp (Osram Ultra Vitalux 300 W, irradiance of 10.7 mW/ cm 2 ).The temperature was maintained constant through a fan located near the photoreactor.Before the photocatalytic tests, the samples were left overnight under He flow and UV irradiation (using a 100 W mercury lamp, Black-Ray B-100A, 365 nm) in order to desorb the possible impurities and the carbonaceous species arising from the sample surface.Subsequently, water vapour was introduced together with the He under irradiation and various portions of the gas leaving the reactor were analysed by gas-chromatography (GC) to monitor the effectiveness of the cleaning process and the possible presence of residual carbonaceous contamination 27. Before starting the batch photo-and photothermo-catalytic tests, a mixture of CO 2 and H 2 O vapour were flowed in the photoreactor to achieve the saturation of the catalyst surface with the reagent molecules.The water vapour produced from a bubbler maintained at 80 C was mixed with CO 2 (99.999).By means of a mass flow controller, a CO 2 / H 2 O mixture with a molar ratio of 15 was obtained.After some preliminary tests, this ratio was chosen because it favoured the CO reduction rather than the competitive water splitting reaction that produced H 2 28.For the photothermal catalytic tests the same setup was used heating the reactor at the chosen temperature and irradiating it with the solar lamp. The reaction products were examined with the Agilent 6890 N gas chromatograph (HP-PLOT Q column, TCD detector) calibrated for the detection of methane and carbon monoxide, and with the Trace GC instrument (Porapak Q column, FID detector) used to detect the possible formation of organic compounds.For the reusability tests, the cleaning steps described above were repeated on the as-used sample before carrying out the subsequent runs. One of the critical issues in the use of brookite TiO 2 is the choice of the appropriate preparation method and the thermal treatments to obtain a pure brookite crystalline phase, without rutile and anatase 21.The thermohydrolysis of TiCl 4 in HCl solution is an established procedure to obtain pure brookite 24.Raman spectroscopy was employed to verify the presence of pure brookite phase and to analyze the structural properties of the as-synthesized composites.Compared to XRD characterization the Raman spectroscopy is more accurate for brookite detection due to the detection of typical vibration modes, whereas to clearly identify the XRD brookite signals, a structure refinement method is required 21. The Fig. 1A illustrates the Raman spectra of the samples.The bare brookite TiO 2 showed 10 vibrational modes, assigned on the basis of the literature data to: 4 A 1g modes (the main one at 154 cm -1 and the others at 249, 417 and 633 cm -1 ), 2 B 1g (213 and 325 cm -1 ), 2 B 2g (367 and 463 cm -1 ) and 2 B 3g (500 and 545 cm -1 ), whereas the other bands that are present with a very low intensity at 128 cm -1 , at 195 cm -1 (overlapped with the B 1g band at 213 cm -1 ) and at 586 cm -1 , are assigned to other 2 A 1g vibrational modes and to another one B 2g mode 13,24 respectively. The typical vibrational mode at 154 cm -1 is characteristic of the brookite phase and the absence of vibrational bands at 516 cm -1 (due to anatase TiO 2 ) and 446 cm -1 (rutile TiO 2 ) confirmed the pure brookite formation 13,24, as also verified with the XRD patterns of all the investigated samples (Fig. S1). In the composites with CeO 2 , the main vibrational mode of cerium oxide at 463 cm -1 related to the F 2g vibrational mode of the cubic fluorite structure 29 overlaps with the second B 2g mode of brookite.The absence of signals related to the Cu and/or Co species in the Co/ TiCe3, Cu/TiCe3 and Co-Cu/TiCe3 samples, can be due to the low amount of the metal species present in the composites and/or to their good dispersion on the brookite-ceria composite 30.The structural modifications related to the metal oxides are indeed highlighted by the Raman shift of the main brookite band (Fig. 1B).In particular, a 0.9 cm -1 shift to lower wavenumbers was observed in Co/TiCe3 compared to pure brookite.In the bimetallic oxides sample this redshift is more evident (1.9 cm -1 ).These changes can be attributed to the structural disorders and defects as oxygen vacancies in the brookite structure generated by the addition of cobalt and copper species, especially when they are simultaneously present 31. The boundary interaction between the TiO 2 and CeO 2 can be noted from the TEM image of TiCe3 (Fig. 2A), although the similar d-space of the (1 2 1) planes of brookite TiO 2 (0.28 nm) and the (1 1 1) planes of CeO 2 (0.31 nm) did not permit to clearly discriminate the interface between the two oxides 32. The particle size distribution of the added metal oxides on the TiCe3 and the TEM images of the Co/TiCe3, Cu/TiCe3 and Co-Cu/TiCe3 samples are illustrated in the Fig. 2B-D. The estimated mean particle diameter was 6 nm for the cobalt oxide in the Co/TiCe3 sample (Fig. 2B), 13 nm for the CuO in the Cu/TiCe3 (Fig. 2C) whereas in the Co-Cu/TiCe3 catalysts the CoO and CuO oxides exhibited a similar mean size (10 nm and 9 nm for the cobalt and copper oxides respectively, Fig. 2D).This size variation can be due to the establishment of a mutual interaction between the metal oxides particles when they are contemporary present in the TiO 2 -CeO 2 composite, thus influencing their growth and their dispersion 33,34.However, the possible presence of aggregates of nano-oxides on the TiCe3 cannot be excluded. The presence of the cobalt and copper oxides was further confirmed by the SAED patterns analysis (Fig. S2).The d space values of 0.28 and 0.25 nm correspond to the (1 1 0) and (1 1 1) planes of CuO and CoO nano-oxides, respectively 35,36.The same d spaces values and similar SAED patterns were found for the Co/TiCe3 and Cu/TiCe3 samples. The textural features of the samples are reported in the Table 1.The presence of ceria caused a notable decrease in the surface area of brookite from 100 m 2 /g to 68 m 2 /g and a slight increase in the pore volume and the mean pore diameter.The addition of the metal oxides, instead, did not substantially modify the textural features of the TiCe3 sample.These findings can be ascribed to the inclusion of CeO 2 in the TiO 2 and to the thermal treatments (calcination in air) carried out to eliminate the nitrates of the metal salt precursors of ceria, copper and cobalt 37. The optical properties of the samples were determined with the UV-vis DRS and the photoluminescence (PL) spectroscopies. Fig. 3 illustrates the results of the UV-DRS measurements, plotting the Kubelka-Munk function, vs .The spectra of brookite TiO 2 and TiCe3 are similar, with no substantial changes due to the addition of ceria, but those of the other samples show a less significant reflectance in the 200-400 nm wavelength range, probably due to an increased absorption by cobalt and copper species present on their surface.The optical band gap of the catalysts with a single metal (the inset of Fig. 3 shows the graph of Co-Cu/TiCe3 as representative sample) are basically the same as that of brookite, being 3.24 eV for the latter, 3.26 eV for the TiCe3 and Cu/TiCe3 composites, and 3.25 eV for the Co/TiCe3 sample, whereas the addition of the bimetallic oxides led to a slightly higher band gap (3.31 eV), probably due to an interaction between the two metallic species which can influence the absorption. On the contrary, some interesting optical features were detected investigating the photoluminescence responses of the samples (Fig. 4).The PL spectra of pure brookite present four typical bands.In accordance with the literature data, the band at 390 nm is reasonably attributed to the band-to-band emission of titania and that at 432 nm to the self-trapped excitons present in the crystalline structure of brookite.Moreover, the band at 460 nm is due to the presence of oxygen vacancies, and the PL band at 555 nm is usually related to the excited electrons trapped in the mid-gap levels (i.e.defect centers) 38.In the composite with CeO 2 it can be noticed the occurrence of a quenching of the PL bands at 390 nm and 430 nm, whilst the band at 460 nm of TiO overlaps with those at about 463 nm attributed to the CeO 2 band to band emission 39.Notably, the addition of the metal oxide species resulted in a further decrease of the PL bands of TiO 2 and CeO 2 .A broad band is visible in the 480-510 nm range for the Co/TiCe3 sample probably due to the formation of oxygen vacancies induced by the cobalt oxide 40.In fact, the presence of small amounts of metal nano-oxides, and in particular of cobalt oxides, facilitated the creation of new oxygen vacancies as intrinsic defects inside the principal oxide (in this case the TiO 2 -CeO 2 system) 41.Generally, a lower intensity of the PL bands is connected to a decrease of the charge recombination among the photoelectrons and the photoholes.Consequently, the diminution of the band intensity can be associated to an increase of the effectiveness in the charge carriers separation 42.Therefore, the above results indicate that the addition of copper and/or cobalt species to the TiO 2 -CeO composites permitted to decrease the photoelectrons/holes recombination and to increase the number of defects in the composite, as confirmed by the Raman measurements.Cobalt oxide can also act as reservoir of oxygen vacancies. The surface electronic structure was studied using XPS.Results for the bare brookite TiO 2 showed sharp titanium spin-orbit bands at 459.2 and 465.0 eV (Fig. 5A).A careful deconvolution of the Ti spectrum profile revealed the presence of an additional spin-orbit component at 457.6 and 462.5 eV due to the presence of some surface Ti 3 states, as a result of the presence of oxygen vacancies (Fig. S3A) 13,26. Fig. 5A shows the XPS of TiCe3, Co/TiCe3, Cu/TiCe3 and Co-Cu/ TiCe3 catalysts, in the Ti 2p energy region.Apart from a negligible different band broadening, no relevant binding energy differences were detected, being all of them at 0.3 eV of lower binding energy (BE) with respect to the pure brookite TiO 2 .This observation can be justified by taking into account the electronegativity of titanium (1.5) larger than that of cerium (1.1), thus indicating their electronic interaction.Fig. S3B shows the fitted representative high-resolution XP spectrum of the Co-Cu/TiCe3 sample in the Ti 2p binding energy region.The fitting required two Gaussian spin-orbit doublets (Ti 2p 3/2 at 458.9 and 457.0 eV; Ti 2p 1/2 at 464.6 and 462.2 eV).The main doublet is associated with the Ti 4 species of the brookite phase 13, while the weak doublet shifted 2 eV to lower binding energy, and it is due to the presence of the residual surface Ti 3 cations after interaction with Ce 4 ions 43,44. The O 1 s band of pure brookite is centered at 530.7 eV (Fig. S4A) and shows the presence of some Ti-OH hydroxide species, at 532.6 eV 26.The high-resolution spectra of the O 1s core levels for TiCe3, Co/TiCe3, Cu/TiCe3 and Co-Cu/TiCe3 catalysts (Fig. S4A), display a O 1 s peak at 530.4 eV, comparable to that observed for the TiO 2 , also in this case downshifted of 0.3 eV.Again, a sizeable higher binding energy shoulder accounts for some -OH groups. The Ce 3d XPS of TiCe3 (Fig. S4B) illustrates the overlap of Ce 4 and Ce 3 states 43.The double bands at 883.4 and 902.0 eV is assigned to the Ce(IV) 3d 9 4f 2 (O 2p 4 ) state.The doublet at 886.6 and 905.2 eV is consistent with the Ce(III) 3d 9 4f 2 (O 2p 5 ) state.Furthermore, the occurrence of Ce 4 is also established by the typical band at 917.7 eV (the fitted spectra are reported in Fig. S4C). For analogous samples, it has been stated that the occurrence of Ce 3 may be due to TiO 2 and CeO 2 electronic interactions that cause some reduction of the Ce 4 43.Obviously, the presence of some Ti 3 cations on the TiO 2 surface is essential for this redox process, and we already evidenced a minor spin-orbit component at 457.0 and 462.2 eV due to the not complete axial coordination of the surface Ti cation in TiO 2 that leads to some surface Ti reduction (vide supra) 44.Practically, any electronic communication between CeO 2 and TiO 2 is limited to the topmost ionic layers of these nanostructures, confirming the presence of a heterojunction between the TiO 2 and CeO 2 interfaces as verified by the TEM measurements.We already evidenced that the Ti 2p states of all catalysts are at 0.3 eV lower BE with respect to pure brookite, while the BE of the Ce 4 3d states in TiCe3 are 0.4 eV at higher BE with respect to the same levels usually observed in the bare CeO 2 (883.0 eV, Fig. S4D).This further underlines the presence of an electronic coupling between Ti and Ce (both Ce 4 and Ce 3 ) ions.Furthermore, the binding energies of both Ce 4 and Ce 3 3d levels in systems containing CoO or/and CuO (Fig. S4B) are 0.2 eV at higher values compared to the same bands detected for TiCe3 (883.4 eV), due to the interactions between the Ce, Co and Cu ions.These strong electronic interactions and the redox process between the Ti and Ce ions favoured the formation of oxygen vacancies in the samples 434445 as also confirmed by Raman and PL measurements. Fig. 5B shows the XPS of the Co/TiCe3 and Co-Cu/TiCe3 catalysts in the Co 2p energy region.In both cases, the Co 2p 3/2,1/2 bands are at 781.3 and 797.1 eV (15.8 eV spin-orbit coupling) 46.It has been previously reported that Co 2p ionization energies are not diagnostic of Co 2 and Co 3 oxidation states since it appears that any intrinsic shift between tetrahedral Co(II) and octahedral Co(III) is compensated by the site potential difference for the two different types of cations.Nevertheless, shakeup satellites at a binding energy 6 eV higher than the main spin-orbit components (Fig. 5B) are fingerprint of Co 2 species 47. The XPS spectra of the Cu/TiCe3 and Co-Cu/TiCe3 samples in the Cu 2p zone are reported in the Fig. 5C.In both cases, two well-resolved spin-orbit components centered at 933.9 and 953.8 eV are evident with a 19.9 eV spin-orbit separation, consistently with Cu 2 states 48. Finally, XPS atomic concentration analysis provided the surface composition of all investigated catalysts.Atomic Ce/Ti ratios observed in all samples were close to nominal values whilst surface atomic Co/Ti and Cu/Ti ratios were approximately 24 times larger than nominal values in both mono and bimetallic oxide samples, thus indicating the occurrence of a significant surface segregation of cobalt and/or copper.The above finding highlights the fundamental role that these cations play in the catalytic performance of the studied samples that obviously strongly depends on the catalyst surface composition. A first catalytic screening was performed by using the three TiCe1, TiCe3 and TiCe5 samples synthesized with a rising loading of CeO deposited on brookite TiO 2 .The solar photocatalytic conversion of CO at room temperature on these catalysts is reported in the Fig. 6A.Under the experimental conditions used, only CO and CH 4 were detected as reaction products, whereas the amount of evolved hydrogen, arising from the water splitting reaction, was negligible.Specifically, carbon monoxide was the main product of the CO 2 conversion when brookite TiO 2 -based photocatalysts were used together with water vapour as the reducing agent 5,14.The photoconversion of CO 2 to CO requires two electrons with a more negative potential (i.e.-0.53 V at pH 7 vs.NHE) compared to the photoproduction of methane (-0.24V), which but requires eight electrons 28. The TiCe3 sample allowed to obtain higher production rates of CO (0.8 mol g -1 h -1 ) and CH 4 (0.09 mol g -1 h -1 ) than the bare brookite (0.5 mol g -1 h -1 and 0.05 mol g -1 h -1 for the CO and CH 4 , respectively).A further increase in the cerium oxide amount showed a detrimental effect (Fig. 6A). In the photothermocatalytic tests (Fig. 6B, T 120 C) the activity trends both for the CO and the CH 4 evolution were the same as those obtained in the photocatalytic tests at room temperature, i.e.: TiCe3 TiCe 1 Brookite TiO 2 TiCe5. For the best composite (TiCe3) the hybrid catalytic approach allowed to increase of 2.5 times the CO photoproduction (2 mol g -1 h -1 ) and 2.2 times the CH 4 formation (0.2 mol g -1 h -1 ).A lower amount of cerium oxide did not substantially change the photo and photothermal activity of pure brookite, whereas a higher quantity had a negative effect.This can be due to the coverage of the surface sites of TiO 2 caused by the ongoing deposition of cerium oxide 12,16.On the basis of the above results, cobalt and copper species were added only to the TiCe3 sample and the effects of their presence were investigated. The addition of cobalt and copper oxides allowed to increase the formation of carbon monoxide and methane both in the photocatalytic and photothermocatalytic tests (Fig. 7).The order of photoactivity at room temperature (Fig. 7A) was Co-Cu/TiCe3 Cu/TiCe3 Co/TiCe3 TiCe3 Brookite TiO 2 .Compared to the TiCe3 composite, the addition of the two oxides led to an increase in the formation of CO by about 6 times (5 mol g -1 h -1 ) and of CH 4 by 5.5 times (0.5 mol g -1 h -1 ).Cu/ TiCe3 was more active than the Co/TiCe3 sample, which in turn showed slightly higher activity (1 and 0.15 mol g -1 h -1 for CO and CH 4 , respectively) than the TiCe3 composite. A further positive effect was verified with the multi catalytic approach (Fig. 7B), as also verified with the bare TiO 2 -CeO 2 composites (Fig. 6B).The contemporaneous heating/irradiation of the Co-Cu/TiCe3 sample resulted in the highest production of CO (12 mol g -1 h -1 ) and CH 4 (1.8 mol g -1 h -1 ). Notably, comparing the performance of bare TiCe3 (2 mol g -1 h -1 and 0.2 mol g -1 h -1 for CO and CH 4 , respectively) with that of Co-Cu/TiCe3, it is possible to notice that the increase of the methane production detected with the Co-Cu/TiCe3 sample was higher than the increase of the carbon monoxide evolution.Indeed, the CO production increased by 6 times, i.e. the same enhancement verified in the runs performed without heating, whereas the increase of methane formation in the photothermal tests was 9 times higher, almost doubling the improvement observed with the photocatalytic tests. The Cu/TiCe3 sample confirmed its higher activity in the photothermal tests compared to the Co/TiCe3 powders, increasing by about 2 times and by 2.6 times the CO (6 mol g -1 h -1 ) and the CH 4 (0.8 mol g -1 h -1 ) production, respectively.This trend was confirmed also with the Co/TiCe3 catalyst, being the CO/CH 4 improvement 3 times higher comparing the photothermocatalytic and the photocatalytic results. The beneficial effects of the multi catalytic approach are amplified if the performance of pure brookite is compared with that of the Cu-Co/ TiCe3 catalyst in the photocatalytic and photothermocatalytic tests (see Fig. 7A and7B).The use of this latter catalyst led to improve, in fact, both the CO and CH 4 production of about 10 times in the photocatalytic measurements, and of about 8 times for CO and 20 times for CH 4 in the photothermal tests.The photothermo catalytic results in function of the surface area are summarized in the Table 1. Furthermore, it is important to highlight that for all of the samples, no formation of solar fuels was detected in the thermocatalytic test carried out at temperatures 300 C and under dark, in accordance with the literature data 4,5. The CO 2 is an acid molecule, and it is largely used as probe for the investigation of the basicity of the catalysts surface sites 49.The first step of the CO 2 photoconversion is its adsorption on the surface of the catalyst.The investigation of the CO 2 -TPD profiles of the examined catalysts can be useful to determine the strength of the interaction and the nature of the surface basic sites. The presence of cerium oxide led to exploit its surface basicity that allowed to improve the adsorption of carbon dioxide, with the formation of different carbonates on the surface of the samples.The CO 2 -TPD curves (Fig. 8) recorded between room temperature and 600 C can be divided into three parts indicated as , and , and associated to weak, medium and strong sites, respectively 50.The weak basic sites are usually identified with the surface hydroxyl groups on metal oxides which form hydrogen carbonate by interacting weakly with CO 2 .The peaks are characteristic of the linear adsorptive form of CO 2 , the and the ones represent the bridge-bonded adsorptive form. From the Fig. 8 it is clear as the surface sites of the samples changed on the basis of the specific chemical modifications of brookite TiO 2 .The pure TiO 2 showed only weak desorption features in the hightemperature zone.The addition of small amount of cerium oxide (TiCe3 sample) led to an increase in the CO 2 adsorption capacity.In fact, slightly more intense signals related to the moderate () and strong basic sites () can be observed.Three desorption peaks are visible in the The CO 2 -TPD profile of the Co-Cu/TiCe3 points to a strong interaction between the CO 2 and the surface sites of this catalyst as indicated by the presence of the and peaks.Indeed, this sample showed a peak at 308 C, similarly to the Cu/TiCe3 powder, and two peaks at 108 C and 469 C slightly shifted at higher temperature (stronger CO 2 interaction) compared to those of Co/TiCe3.Furthermore, another signal (at 396 C) was detected.The desorption peaks in the range 380-570 C were related to the decomposition of (bidentate) carbonate species, whereas the features between 180 and 380 C and between 550 and 780 C are due to the decomposition of hydrogen carbonates and monodentate carbonates respectively 14,50.Only for a general comparison, the CO 2 -TPD curves of the pure CuO, CoO and of CoO-CuO prepared by chemical precipitation are reported in the supporting information (Fig. S5).It is important to highlight, in fact, that a real comparison is not possible considering that in our work the bimetallic Co-Cu oxides were added as co-catalysts in small amount (0.3 wt -0.3 wt) on brookite TiO 2 -CeO 2 , using a different preparation method (impregnation) compared to the synthesis of the bare CuO, CoO and of the mixture CoO-CuO (that required a chemical precipitation).Furthermore, the CO 2 interaction was influenced by the presence of both the acid sites of TiO 2 and mainly the basic sites of CeO 2 . Surface enrichment of the metal oxides due to phase segregation was noticed on Co/TiCe3, Cu/TiCe3 and Co-Cu/TiCe3 samples, as indicated by XPS results.This facilitated the CO 2 adsorption especially in the Co-Cu/TiCe3 sample where multiple metal surface sites allowed to establish a strong interaction with CO 2 , which occurs instead with much lower strength in the bare brookite and in the TiCe3 composite. To further confirm the formation of the carbonate species after the adsorption of CO 2 on the surface of the TiCe3-based catalysts, we have compared the FTIR spectra of the Co/TiCe3, Cu/TiCe3 and Co-Cu/TiCe3 samples before and after the photothermocatalytic tests (Fig. 9). Before the activity runs all samples exhibited the typical FTIR spectra of TiO 2 -based materials with a broad band at around 3500-3400 cm -1 and a peak at around 1610-1620 cm -1 assigned to the stretching and bending modes of the hydroxyl groups, respectively.These bands can be due to both the residual water molecules and the Ti-OH bonds.The broad band observed in the range 700-600 cm -1 is attributed to the Ti-O-Ti vibrations (Figs. 9 and S6) 12.After the photothermal tests, it is possible to note the formation of new bands in the (hydrogen)carbonate zone (1400-1050 cm).All samples showed a strong band at 1383-1384 cm -1 , assigned to the symmetric stretching of carboxylate molecules 51.Co/TiCe3 showed a spectrum with a small signal at 1114 cm -1 of the bridged bidentate carbonates 51.The Cu/TiCe3 sample exhibited signals at 1187 and 1115 cm -1 related to bridged carbonates, while the band at 1068 cm -1 is assigned to the C-O of monodentate carbonate 51.In the Co-Cu/TiCe3 catalyst, two small bands at 1215 and 1131 cm -1 can be assigned to bridged bidentate carbonates, whereas the feature at about 1036 cm -1 to small amounts of hydrogen carbonates 51. The contemporaneous presence of different surface metal sites (mainly Co, Cu and/or Co-Cu centers due to surface segregation as evidenced by XPS) favoured the formation of both hydrogen carbonates and bridged bidentate carbonates species in the Co-Cu/TiCe3 catalyst, with a beneficial effect in the CO 2 reduction.As reported in the literature, the bidentate binding mode of carbon dioxide, with the formation of bidentate carbonates favours the formation of CO through the bidentate formate species as intermediate and a successive transformation of CO into CH 4 4,52.Note that during the catalytic and photocatalytic measurements no formic acid was detected.This acid was instead reported as a common product of the CO 2 photoreduction performed in aqueous (liquid) media 28.Furthermore, the presence of hydrogen carbonates is beneficial because they can act as holes scavenger and can be also converted into other bidentate formate species 4,52.This is one of the key features that can explain the improved performance of this bimetallic oxide-based catalyst with respect to the others. The formation of the carbonate species after the photothermo catalytic measurements was also confirmed by the comparison of the XPS spectra in C 1 s region before and after the test (Fig. S7, Co-Cu/TiCe3 chosen as representative sample).All the spectra show the adventitious carbon peak at 285.0 eV, currently used for calibration 26.Furthermore, the XP spectrum of the sample measured after the CO 2 photoreduction also exhibits a peak at 289.0 eV ascribed to the carbonate species (-CO 3 2-), thus confirming their formation during the reaction.This signal is not present in the sample analyzed before the photothermal tests, pointing to the absence of carbon impurities (they were removed during the cleaning steps, see par.1.3) on the surface of the sample. The photo(thermo) catalytic results and the characterization data here reported can be discussed in terms of different synergisms, which are involved in determining the final performance of the investigated samples. The first exploited synergism is the \"energy synergism\" between the photocatalytic and the thermocatalytic mechanisms.The multi catalytic approach allowed to increase the solar fuel formation (Fig. 6 and Fig. 7).The heating, as well as to increase the rate of the CO 2 conversion and of the water oxidation 10,11, promoted the oxygens mobility of the reducible oxides as CeO 2 , CoO and CuO, and the presence of oxygen vacancies in the CeO 2 (generated by the Ce 3 species as confirmed by XPS) was further increased by the simultaneous addition of copper and cobalt species in the Co-Cu/TiCe3 sample (as confirmed by XPS, Raman and PL measurements).These oxygen vacancies sensibly decrease the energy for the adsorption of CO 2 .It is indeed reported that carbon dioxide preferentially adsorbs on oxygen defective sites 17,18.Furthermore, to have an efficient CO 2 reduction, the electron and proton transfers should be synchronous.Considering that the time scale for the electron transfer is picoseconds whereas that of proton transfer is hundreds of microseconds, the rate determining step of the reaction should be the H transfer process 6,8.In this contest, the contemporaneous presence of solar and thermal energy leads to enhance, as reported in the literature, the proton transfers 53 obtaining beneficial multiple protons/electrons transfers. We want to highlight that this synergism between thermo and photocatalysis had a positive effect only if the photocatalytic mechanism was simultaneously activated.Indeed, no CO and CH 4 formation was detected in the thermocatalytic tests up to 300 C. Although, in fact, the presence of the oxygen vacancies facilitates the adsorption of CO 2 , its further conversion requires multi proton/electron transfers, that can be generated by the photocatalytic mechanism, or higher temperatures (T 300 C) necessary for the carbon dioxide dissociation 4,5,54 as also stated by the CO 2 -TPD.A confirmation of the mutual positive effect between the photocatalytic and the thermocatalytic mechanisms was highlighted by the solar photothermal results performed at increasing temperature with the most performing sample (the Co-Cu/TiCe3 catalyst) (Fig. S8).The high temperature promotes the CeO 2 redox properties 12 favouring the CO/CH 4 formation.It is possible to notice that the beneficial synergistic effect led to a linear growth in the evolution of CO and CH 4 up to about 2 times every 60 C of temperature increase. The CO 2 -TPD and the FTIR measurements pointed to a peculiar \"surface sites synergism\" particularly evident on the bimetallic oxides sample, considering also that the XPS stated the surface segregation of these species on the TiCe3.The strong interaction of CO 2 with the multiple metal surface sites favoured its adsorption and activation.Considering the results obtained which highlighted the greater performance of the Co-Cu/TiCe3 catalyst compared to the other samples, the proposed mechanism of photothermocatalytic conversion of CO 2 is illustrated in Fig. 10. Under solar irradiation, the photogenerated electrons and holes were efficiently separated due to the heterojunction (detected by TEM) between the brookite TiO 2 and the CeO 2 .The conduction and the valence band levels of CeO 2 and brookite TiO 2 allowed the generation of CO and CH 4 and the oxidation of water with the formation of H 14.Copper and cobalt oxides acted as efficient co-catalysts, which allowed to increase the solar fuel formation and to efficiently separate the charge carriers as confirmed by the PL characterization.In fact, the excited electrons can react with the adsorbed CO 2 while the holes interacting with the CoO-CuO co-catalysts, boost up the oxidation of water and the generation of protons.The surface segregation of these oxides on brookite-cerium oxide enabled the improvement of the interaction with carbon dioxide molecules also favouring the formation of carbonate species as intermediates, which paved the way for the conversion of CO 2 into CO and CH 4 . The contemporaneous presence of CoO and CuO on the surface of TiCe3 led to a holistic effect (\"bimetallic oxide synergism\") that permitted to increase the catalytic performance compared to the monometallic counterparts.The strong mutual interaction between the two metal oxides, that influenced their growth and dispersion on the TiCe3 as detected by TEM measurements, allowed to join the beneficial properties of copper and cobalt oxides.In particular, the CuO promoted the CO 2 reduction, being an efficient co-catalyst for the electrons donation 5,23, the cobalt oxide facilitated the formation of oxygen vacancies, as detected by PL spectroscopy, and the holes trap, boosting the oxidation of water and protons formation 8,41.Although these features could be exploited also in the monometallic CoO and CuO catalysts, the simultaneous addition of both oxides on the surface of TiCe3 synergistically increased the solar fuel formation. Finally, it is important to highlight that these peculiar synergisms were more effective in the presence of the pure brookite phase.Indeed, in the same experimental conditions, we have compared the performance in the photothermal test at 120 C of Co-Cu/TiCe3 sample with those of two samples prepared with the same synthesis but employing commercial anatase (Sigma Aldrich 637254) and rutile (Sigma Aldrich 224227) TiO 2 .The use of rutile led to the lowest CO/CH 4 formation (Fig. S9).As reported, the CB energy level of rutile was not appropriate for the CO 2 reduction into CO, whereas the CB edge of anatase was similar to that of brookite 23.However, with the anatase TiO 2 -based composite the CO and CH 4 production were lower (8 and 0.9 mol g -1 h -1 respectively) compared to the brookite-based sample (12 and 1.84 mol g -1 h -1 for CO and CH 4 respectively).The peculiar preparation mode of the pure brookite, its strong interaction with cerium oxide and its specific physico-chemical properties make this crystalline phase particularly suitable for the photoreduction reactions and for multi catalytic approaches 13,555657.The good affinity between brookite TiO 2 and CeO 2 was further highlighted by comparing the photothermal activity of the Co-Cu/TiCe3 with those of Co-Cu/brookite TiO 2 and the Co-Cu/CeO 2 (Fig. S10).Indeed, the CO and the CH 4 formation obtained with the Co-Cu/brookite TiO 2 was about two times and five times lower of the Co-Cu/TiCe3 respectively, whereas the Co-Cu/CeO 2 showed a very low activity being the CO formation 30 times lower than that observed with Co-Cu/TiCe3, without methane evolution. The 0.3-0.3wt was the optimal amount of the bimetallic oxides sample (Fig. S11), whereas a higher amount led to a detrimental effect, presumably due to excessive coverage of the active sites of TiO 2 12,16. The Co-Cu/Ti(brookite)Ce3 also showed a good stability after 3 consecutive runs of phothermocatalytic tests at 120 C (Fig. S12) pointing to as the experimental conditions of this hybrid catalysis or the eventual formation of carbonaceous impurities on the surface of the sample, that however were removed during the cleaning steps (par.1.3), did not affect the catalytic activity of the best performing sample examined in this work. The solar photothermocatalytic conversion of the carbon dioxide was investigated on brookite TiO 2 -CeO 2 -based catalysts.The influence of the addition of small amounts of cobalt oxide, copper oxide and of the CoO-CuO bimetallic oxides was investigated.For both photocatalytic and photothermocatalytic tests, the CoO-CuO supported on the TiO 2 -3 CeO 2 gave the best results.The \"multi\" properties of this peculiar material and the multi catalytic approach allowed to sensibly increase the CO/CH 4 formation.In particular, the use of Co-Cu/TiCe3 material allowed to exploit: (i) the energy synergism between the catalytic and the photocatalytic mechanisms that increased the CO 2 conversion and favoured efficient e -/H transfers; (ii) the surface sites synergism that facilitated the CO 2 adsorption and its activation through the formation of carbonates as intermediates; (iii) the bimetallic oxides synergism that promoted an efficient charge carriers separation, the increase of oxygen vacancies on the brookite TiO 2 -CeO 2 composite and the surface segregation of the added oxides which boosted the CO 2 conversion and the oxidation of water. The application of this hybrid catalysis using versatile catalysts possessing both photocatalytic and thermocatalytic properties can be a fascinating strategy to exploit CO 2 through solar fuel production. Fig. 1. (A) Raman spectra of the analysed catalysts, (B) Zoom of the region of the A 1g vibrational mode of brookite TiO 2 . Fig. 2. TEM images of TiCe3 (A).Particle size distribution and TEM images of Co/TiCe3 (B), Cu/TiCe3 (C) and Co-Cu/TiCe3 (D). Fig. 3. Reflectance spectra of the analysed samples.In the inset the band gap determination of the Co-Cu/TiCe3 as representative catalyst. Fig. 4. Photoluminescence spectra of the analysed samples ( excitation 300 nm). Fig. 5. (A) XPS spectra of the examined samples in the Ti 2p binding energy zone; (B) XPS spectra of Co/TiCe3 and Co-Cu/TiCe3 samples, in the Co 2p zone; (C) Cu/TiCe3 and Co-Cu/TiCe3 samples, in the Cu 2p zone. Fig. 6. (A) Solar photocatalytic CO 2 reduction at room temperature, (B) Photothermocatalytic tests at T 120 C on the brookite TiO 2 -CeO 2 composites.The catalysts were irradiated for 5 h. Fig. 7. (A) Solar photocatalytic CO 2 reduction at room temperature, (B) Photothermocatalytic tests at T 120 C on the TiCe3-based samples.The catalysts were irradiated for 5 h. Fig. 8. CO 2 -TPD curves of the analysed catalysts in the 50-600 C temperature range.The , , and zones identify the weak, medium and strong basic sites, respectively. Fig. 9. FTIR spectra before and after the photothermocatalytic CO 2 reduction on Co/TiCe3, Cu/TiCe3 and Co-Cu/TiCe3. Fig. 10.Proposed photothermocatalytic mechanism with the Co-Cu/TiCe3 catalyst. Textural properties (surface area, mean pore diameter and pore volume) and photothermo catalytic performance (T 120 C) of the used photocatalysts. The PON AIM project of the European Social Found (for the author R. F.) and the PIACERI 2020-2022 project of the University of Catania (for the authors S.S., L.D., A.G.) are acknowledged for funding. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://doi. org/10.1016/j.cej.2021.131249."
  },
  {
    "title": "Results_and_Discussion",
    "content": "One of the critical issues in the use of brookite TiO 2 is the choice of the appropriate preparation method and the thermal treatments to obtain a pure brookite crystalline phase, without rutile and anatase 21.The thermohydrolysis of TiCl 4 in HCl solution is an established procedure to obtain pure brookite 24.Raman spectroscopy was employed to verify the presence of pure brookite phase and to analyze the structural properties of the as-synthesized composites.Compared to XRD characterization the Raman spectroscopy is more accurate for brookite detection due to the detection of typical vibration modes, whereas to clearly identify the XRD brookite signals, a structure refinement method is required 21. The Fig. 1A illustrates the Raman spectra of the samples.The bare brookite TiO 2 showed 10 vibrational modes, assigned on the basis of the literature data to: 4 A 1g modes (the main one at 154 cm -1 and the others at 249, 417 and 633 cm -1 ), 2 B 1g (213 and 325 cm -1 ), 2 B 2g (367 and 463 cm -1 ) and 2 B 3g (500 and 545 cm -1 ), whereas the other bands that are present with a very low intensity at 128 cm -1 , at 195 cm -1 (overlapped with the B 1g band at 213 cm -1 ) and at 586 cm -1 , are assigned to other 2 A 1g vibrational modes and to another one B 2g mode 13,24 respectively. The typical vibrational mode at 154 cm -1 is characteristic of the brookite phase and the absence of vibrational bands at 516 cm -1 (due to anatase TiO 2 ) and 446 cm -1 (rutile TiO 2 ) confirmed the pure brookite formation 13,24, as also verified with the XRD patterns of all the investigated samples (Fig. S1). In the composites with CeO 2 , the main vibrational mode of cerium oxide at 463 cm -1 related to the F 2g vibrational mode of the cubic fluorite structure 29 overlaps with the second B 2g mode of brookite.The absence of signals related to the Cu and/or Co species in the Co/ TiCe3, Cu/TiCe3 and Co-Cu/TiCe3 samples, can be due to the low amount of the metal species present in the composites and/or to their good dispersion on the brookite-ceria composite 30.The structural modifications related to the metal oxides are indeed highlighted by the Raman shift of the main brookite band (Fig. 1B).In particular, a 0.9 cm -1 shift to lower wavenumbers was observed in Co/TiCe3 compared to pure brookite.In the bimetallic oxides sample this redshift is more evident (1.9 cm -1 ).These changes can be attributed to the structural disorders and defects as oxygen vacancies in the brookite structure generated by the addition of cobalt and copper species, especially when they are simultaneously present 31. The boundary interaction between the TiO 2 and CeO 2 can be noted from the TEM image of TiCe3 (Fig. 2A), although the similar d-space of the (1 2 1) planes of brookite TiO 2 (0.28 nm) and the (1 1 1) planes of CeO 2 (0.31 nm) did not permit to clearly discriminate the interface between the two oxides 32. The particle size distribution of the added metal oxides on the TiCe3 and the TEM images of the Co/TiCe3, Cu/TiCe3 and Co-Cu/TiCe3 samples are illustrated in the Fig. 2B-D. The estimated mean particle diameter was 6 nm for the cobalt oxide in the Co/TiCe3 sample (Fig. 2B), 13 nm for the CuO in the Cu/TiCe3 (Fig. 2C) whereas in the Co-Cu/TiCe3 catalysts the CoO and CuO oxides exhibited a similar mean size (10 nm and 9 nm for the cobalt and copper oxides respectively, Fig. 2D).This size variation can be due to the establishment of a mutual interaction between the metal oxides particles when they are contemporary present in the TiO 2 -CeO 2 composite, thus influencing their growth and their dispersion 33,34.However, the possible presence of aggregates of nano-oxides on the TiCe3 cannot be excluded. The presence of the cobalt and copper oxides was further confirmed by the SAED patterns analysis (Fig. S2).The d space values of 0.28 and 0.25 nm correspond to the (1 1 0) and (1 1 1) planes of CuO and CoO nano-oxides, respectively 35,36.The same d spaces values and similar SAED patterns were found for the Co/TiCe3 and Cu/TiCe3 samples. The textural features of the samples are reported in the Table 1.The presence of ceria caused a notable decrease in the surface area of brookite from 100 m 2 /g to 68 m 2 /g and a slight increase in the pore volume and the mean pore diameter.The addition of the metal oxides, instead, did not substantially modify the textural features of the TiCe3 sample.These findings can be ascribed to the inclusion of CeO 2 in the TiO 2 and to the thermal treatments (calcination in air) carried out to eliminate the nitrates of the metal salt precursors of ceria, copper and cobalt 37. The optical properties of the samples were determined with the UV-vis DRS and the photoluminescence (PL) spectroscopies. Fig. 3 illustrates the results of the UV-DRS measurements, plotting the Kubelka-Munk function, vs .The spectra of brookite TiO 2 and TiCe3 are similar, with no substantial changes due to the addition of ceria, but those of the other samples show a less significant reflectance in the 200-400 nm wavelength range, probably due to an increased absorption by cobalt and copper species present on their surface.The optical band gap of the catalysts with a single metal (the inset of Fig. 3 shows the graph of Co-Cu/TiCe3 as representative sample) are basically the same as that of brookite, being 3.24 eV for the latter, 3.26 eV for the TiCe3 and Cu/TiCe3 composites, and 3.25 eV for the Co/TiCe3 sample, whereas the addition of the bimetallic oxides led to a slightly higher band gap (3.31 eV), probably due to an interaction between the two metallic species which can influence the absorption. On the contrary, some interesting optical features were detected investigating the photoluminescence responses of the samples (Fig. 4).The PL spectra of pure brookite present four typical bands.In accordance with the literature data, the band at 390 nm is reasonably attributed to the band-to-band emission of titania and that at 432 nm to the self-trapped excitons present in the crystalline structure of brookite.Moreover, the band at 460 nm is due to the presence of oxygen vacancies, and the PL band at 555 nm is usually related to the excited electrons trapped in the mid-gap levels (i.e.defect centers) 38.In the composite with CeO 2 it can be noticed the occurrence of a quenching of the PL bands at 390 nm and 430 nm, whilst the band at 460 nm of TiO overlaps with those at about 463 nm attributed to the CeO 2 band to band emission 39.Notably, the addition of the metal oxide species resulted in a further decrease of the PL bands of TiO 2 and CeO 2 .A broad band is visible in the 480-510 nm range for the Co/TiCe3 sample probably due to the formation of oxygen vacancies induced by the cobalt oxide 40.In fact, the presence of small amounts of metal nano-oxides, and in particular of cobalt oxides, facilitated the creation of new oxygen vacancies as intrinsic defects inside the principal oxide (in this case the TiO 2 -CeO 2 system) 41.Generally, a lower intensity of the PL bands is connected to a decrease of the charge recombination among the photoelectrons and the photoholes.Consequently, the diminution of the band intensity can be associated to an increase of the effectiveness in the charge carriers separation 42.Therefore, the above results indicate that the addition of copper and/or cobalt species to the TiO 2 -CeO composites permitted to decrease the photoelectrons/holes recombination and to increase the number of defects in the composite, as confirmed by the Raman measurements.Cobalt oxide can also act as reservoir of oxygen vacancies. The surface electronic structure was studied using XPS.Results for the bare brookite TiO 2 showed sharp titanium spin-orbit bands at 459.2 and 465.0 eV (Fig. 5A).A careful deconvolution of the Ti spectrum profile revealed the presence of an additional spin-orbit component at 457.6 and 462.5 eV due to the presence of some surface Ti 3 states, as a result of the presence of oxygen vacancies (Fig. S3A) 13,26. Fig. 5A shows the XPS of TiCe3, Co/TiCe3, Cu/TiCe3 and Co-Cu/ TiCe3 catalysts, in the Ti 2p energy region.Apart from a negligible different band broadening, no relevant binding energy differences were detected, being all of them at 0.3 eV of lower binding energy (BE) with respect to the pure brookite TiO 2 .This observation can be justified by taking into account the electronegativity of titanium (1.5) larger than that of cerium (1.1), thus indicating their electronic interaction.Fig. S3B shows the fitted representative high-resolution XP spectrum of the Co-Cu/TiCe3 sample in the Ti 2p binding energy region.The fitting required two Gaussian spin-orbit doublets (Ti 2p 3/2 at 458.9 and 457.0 eV; Ti 2p 1/2 at 464.6 and 462.2 eV).The main doublet is associated with the Ti 4 species of the brookite phase 13, while the weak doublet shifted 2 eV to lower binding energy, and it is due to the presence of the residual surface Ti 3 cations after interaction with Ce 4 ions 43,44. The O 1 s band of pure brookite is centered at 530.7 eV (Fig. S4A) and shows the presence of some Ti-OH hydroxide species, at 532.6 eV 26.The high-resolution spectra of the O 1s core levels for TiCe3, Co/TiCe3, Cu/TiCe3 and Co-Cu/TiCe3 catalysts (Fig. S4A), display a O 1 s peak at 530.4 eV, comparable to that observed for the TiO 2 , also in this case downshifted of 0.3 eV.Again, a sizeable higher binding energy shoulder accounts for some -OH groups. The Ce 3d XPS of TiCe3 (Fig. S4B) illustrates the overlap of Ce 4 and Ce 3 states 43.The double bands at 883.4 and 902.0 eV is assigned to the Ce(IV) 3d 9 4f 2 (O 2p 4 ) state.The doublet at 886.6 and 905.2 eV is consistent with the Ce(III) 3d 9 4f 2 (O 2p 5 ) state.Furthermore, the occurrence of Ce 4 is also established by the typical band at 917.7 eV (the fitted spectra are reported in Fig. S4C). For analogous samples, it has been stated that the occurrence of Ce 3 may be due to TiO 2 and CeO 2 electronic interactions that cause some reduction of the Ce 4 43.Obviously, the presence of some Ti 3 cations on the TiO 2 surface is essential for this redox process, and we already evidenced a minor spin-orbit component at 457.0 and 462.2 eV due to the not complete axial coordination of the surface Ti cation in TiO 2 that leads to some surface Ti reduction (vide supra) 44.Practically, any electronic communication between CeO 2 and TiO 2 is limited to the topmost ionic layers of these nanostructures, confirming the presence of a heterojunction between the TiO 2 and CeO 2 interfaces as verified by the TEM measurements.We already evidenced that the Ti 2p states of all catalysts are at 0.3 eV lower BE with respect to pure brookite, while the BE of the Ce 4 3d states in TiCe3 are 0.4 eV at higher BE with respect to the same levels usually observed in the bare CeO 2 (883.0 eV, Fig. S4D).This further underlines the presence of an electronic coupling between Ti and Ce (both Ce 4 and Ce 3 ) ions.Furthermore, the binding energies of both Ce 4 and Ce 3 3d levels in systems containing CoO or/and CuO (Fig. S4B) are 0.2 eV at higher values compared to the same bands detected for TiCe3 (883.4 eV), due to the interactions between the Ce, Co and Cu ions.These strong electronic interactions and the redox process between the Ti and Ce ions favoured the formation of oxygen vacancies in the samples 434445 as also confirmed by Raman and PL measurements. Fig. 5B shows the XPS of the Co/TiCe3 and Co-Cu/TiCe3 catalysts in the Co 2p energy region.In both cases, the Co 2p 3/2,1/2 bands are at 781.3 and 797.1 eV (15.8 eV spin-orbit coupling) 46.It has been previously reported that Co 2p ionization energies are not diagnostic of Co 2 and Co 3 oxidation states since it appears that any intrinsic shift between tetrahedral Co(II) and octahedral Co(III) is compensated by the site potential difference for the two different types of cations.Nevertheless, shakeup satellites at a binding energy 6 eV higher than the main spin-orbit components (Fig. 5B) are fingerprint of Co 2 species 47. The XPS spectra of the Cu/TiCe3 and Co-Cu/TiCe3 samples in the Cu 2p zone are reported in the Fig. 5C.In both cases, two well-resolved spin-orbit components centered at 933.9 and 953.8 eV are evident with a 19.9 eV spin-orbit separation, consistently with Cu 2 states 48. Finally, XPS atomic concentration analysis provided the surface composition of all investigated catalysts.Atomic Ce/Ti ratios observed in all samples were close to nominal values whilst surface atomic Co/Ti and Cu/Ti ratios were approximately 24 times larger than nominal values in both mono and bimetallic oxide samples, thus indicating the occurrence of a significant surface segregation of cobalt and/or copper.The above finding highlights the fundamental role that these cations play in the catalytic performance of the studied samples that obviously strongly depends on the catalyst surface composition. A first catalytic screening was performed by using the three TiCe1, TiCe3 and TiCe5 samples synthesized with a rising loading of CeO deposited on brookite TiO 2 .The solar photocatalytic conversion of CO at room temperature on these catalysts is reported in the Fig. 6A.Under the experimental conditions used, only CO and CH 4 were detected as reaction products, whereas the amount of evolved hydrogen, arising from the water splitting reaction, was negligible.Specifically, carbon monoxide was the main product of the CO 2 conversion when brookite TiO 2 -based photocatalysts were used together with water vapour as the reducing agent 5,14.The photoconversion of CO 2 to CO requires two electrons with a more negative potential (i.e.-0.53 V at pH 7 vs.NHE) compared to the photoproduction of methane (-0.24V), which but requires eight electrons 28. The TiCe3 sample allowed to obtain higher production rates of CO (0.8 mol g -1 h -1 ) and CH 4 (0.09 mol g -1 h -1 ) than the bare brookite (0.5 mol g -1 h -1 and 0.05 mol g -1 h -1 for the CO and CH 4 , respectively).A further increase in the cerium oxide amount showed a detrimental effect (Fig. 6A). In the photothermocatalytic tests (Fig. 6B, T 120 C) the activity trends both for the CO and the CH 4 evolution were the same as those obtained in the photocatalytic tests at room temperature, i.e.: TiCe3 TiCe 1 Brookite TiO 2 TiCe5. For the best composite (TiCe3) the hybrid catalytic approach allowed to increase of 2.5 times the CO photoproduction (2 mol g -1 h -1 ) and 2.2 times the CH 4 formation (0.2 mol g -1 h -1 ).A lower amount of cerium oxide did not substantially change the photo and photothermal activity of pure brookite, whereas a higher quantity had a negative effect.This can be due to the coverage of the surface sites of TiO 2 caused by the ongoing deposition of cerium oxide 12,16.On the basis of the above results, cobalt and copper species were added only to the TiCe3 sample and the effects of their presence were investigated. The addition of cobalt and copper oxides allowed to increase the formation of carbon monoxide and methane both in the photocatalytic and photothermocatalytic tests (Fig. 7).The order of photoactivity at room temperature (Fig. 7A) was Co-Cu/TiCe3 Cu/TiCe3 Co/TiCe3 TiCe3 Brookite TiO 2 .Compared to the TiCe3 composite, the addition of the two oxides led to an increase in the formation of CO by about 6 times (5 mol g -1 h -1 ) and of CH 4 by 5.5 times (0.5 mol g -1 h -1 ).Cu/ TiCe3 was more active than the Co/TiCe3 sample, which in turn showed slightly higher activity (1 and 0.15 mol g -1 h -1 for CO and CH 4 , respectively) than the TiCe3 composite. A further positive effect was verified with the multi catalytic approach (Fig. 7B), as also verified with the bare TiO 2 -CeO 2 composites (Fig. 6B).The contemporaneous heating/irradiation of the Co-Cu/TiCe3 sample resulted in the highest production of CO (12 mol g -1 h -1 ) and CH 4 (1.8 mol g -1 h -1 ). Notably, comparing the performance of bare TiCe3 (2 mol g -1 h -1 and 0.2 mol g -1 h -1 for CO and CH 4 , respectively) with that of Co-Cu/TiCe3, it is possible to notice that the increase of the methane production detected with the Co-Cu/TiCe3 sample was higher than the increase of the carbon monoxide evolution.Indeed, the CO production increased by 6 times, i.e. the same enhancement verified in the runs performed without heating, whereas the increase of methane formation in the photothermal tests was 9 times higher, almost doubling the improvement observed with the photocatalytic tests. The Cu/TiCe3 sample confirmed its higher activity in the photothermal tests compared to the Co/TiCe3 powders, increasing by about 2 times and by 2.6 times the CO (6 mol g -1 h -1 ) and the CH 4 (0.8 mol g -1 h -1 ) production, respectively.This trend was confirmed also with the Co/TiCe3 catalyst, being the CO/CH 4 improvement 3 times higher comparing the photothermocatalytic and the photocatalytic results. The beneficial effects of the multi catalytic approach are amplified if the performance of pure brookite is compared with that of the Cu-Co/ TiCe3 catalyst in the photocatalytic and photothermocatalytic tests (see Fig. 7A and7B).The use of this latter catalyst led to improve, in fact, both the CO and CH 4 production of about 10 times in the photocatalytic measurements, and of about 8 times for CO and 20 times for CH 4 in the photothermal tests.The photothermo catalytic results in function of the surface area are summarized in the Table 1. Furthermore, it is important to highlight that for all of the samples, no formation of solar fuels was detected in the thermocatalytic test carried out at temperatures 300 C and under dark, in accordance with the literature data 4,5. The CO 2 is an acid molecule, and it is largely used as probe for the investigation of the basicity of the catalysts surface sites 49.The first step of the CO 2 photoconversion is its adsorption on the surface of the catalyst.The investigation of the CO 2 -TPD profiles of the examined catalysts can be useful to determine the strength of the interaction and the nature of the surface basic sites. The presence of cerium oxide led to exploit its surface basicity that allowed to improve the adsorption of carbon dioxide, with the formation of different carbonates on the surface of the samples.The CO 2 -TPD curves (Fig. 8) recorded between room temperature and 600 C can be divided into three parts indicated as , and , and associated to weak, medium and strong sites, respectively 50.The weak basic sites are usually identified with the surface hydroxyl groups on metal oxides which form hydrogen carbonate by interacting weakly with CO 2 .The peaks are characteristic of the linear adsorptive form of CO 2 , the and the ones represent the bridge-bonded adsorptive form. From the Fig. 8 it is clear as the surface sites of the samples changed on the basis of the specific chemical modifications of brookite TiO 2 .The pure TiO 2 showed only weak desorption features in the hightemperature zone.The addition of small amount of cerium oxide (TiCe3 sample) led to an increase in the CO 2 adsorption capacity.In fact, slightly more intense signals related to the moderate () and strong basic sites () can be observed.Three desorption peaks are visible in the The CO 2 -TPD profile of the Co-Cu/TiCe3 points to a strong interaction between the CO 2 and the surface sites of this catalyst as indicated by the presence of the and peaks.Indeed, this sample showed a peak at 308 C, similarly to the Cu/TiCe3 powder, and two peaks at 108 C and 469 C slightly shifted at higher temperature (stronger CO 2 interaction) compared to those of Co/TiCe3.Furthermore, another signal (at 396 C) was detected.The desorption peaks in the range 380-570 C were related to the decomposition of (bidentate) carbonate species, whereas the features between 180 and 380 C and between 550 and 780 C are due to the decomposition of hydrogen carbonates and monodentate carbonates respectively 14,50.Only for a general comparison, the CO 2 -TPD curves of the pure CuO, CoO and of CoO-CuO prepared by chemical precipitation are reported in the supporting information (Fig. S5).It is important to highlight, in fact, that a real comparison is not possible considering that in our work the bimetallic Co-Cu oxides were added as co-catalysts in small amount (0.3 wt -0.3 wt) on brookite TiO 2 -CeO 2 , using a different preparation method (impregnation) compared to the synthesis of the bare CuO, CoO and of the mixture CoO-CuO (that required a chemical precipitation).Furthermore, the CO 2 interaction was influenced by the presence of both the acid sites of TiO 2 and mainly the basic sites of CeO 2 . Surface enrichment of the metal oxides due to phase segregation was noticed on Co/TiCe3, Cu/TiCe3 and Co-Cu/TiCe3 samples, as indicated by XPS results.This facilitated the CO 2 adsorption especially in the Co-Cu/TiCe3 sample where multiple metal surface sites allowed to establish a strong interaction with CO 2 , which occurs instead with much lower strength in the bare brookite and in the TiCe3 composite. To further confirm the formation of the carbonate species after the adsorption of CO 2 on the surface of the TiCe3-based catalysts, we have compared the FTIR spectra of the Co/TiCe3, Cu/TiCe3 and Co-Cu/TiCe3 samples before and after the photothermocatalytic tests (Fig. 9). Before the activity runs all samples exhibited the typical FTIR spectra of TiO 2 -based materials with a broad band at around 3500-3400 cm -1 and a peak at around 1610-1620 cm -1 assigned to the stretching and bending modes of the hydroxyl groups, respectively.These bands can be due to both the residual water molecules and the Ti-OH bonds.The broad band observed in the range 700-600 cm -1 is attributed to the Ti-O-Ti vibrations (Figs. 9 and S6) 12.After the photothermal tests, it is possible to note the formation of new bands in the (hydrogen)carbonate zone (1400-1050 cm).All samples showed a strong band at 1383-1384 cm -1 , assigned to the symmetric stretching of carboxylate molecules 51.Co/TiCe3 showed a spectrum with a small signal at 1114 cm -1 of the bridged bidentate carbonates 51.The Cu/TiCe3 sample exhibited signals at 1187 and 1115 cm -1 related to bridged carbonates, while the band at 1068 cm -1 is assigned to the C-O of monodentate carbonate 51.In the Co-Cu/TiCe3 catalyst, two small bands at 1215 and 1131 cm -1 can be assigned to bridged bidentate carbonates, whereas the feature at about 1036 cm -1 to small amounts of hydrogen carbonates 51. The contemporaneous presence of different surface metal sites (mainly Co, Cu and/or Co-Cu centers due to surface segregation as evidenced by XPS) favoured the formation of both hydrogen carbonates and bridged bidentate carbonates species in the Co-Cu/TiCe3 catalyst, with a beneficial effect in the CO 2 reduction.As reported in the literature, the bidentate binding mode of carbon dioxide, with the formation of bidentate carbonates favours the formation of CO through the bidentate formate species as intermediate and a successive transformation of CO into CH 4 4,52.Note that during the catalytic and photocatalytic measurements no formic acid was detected.This acid was instead reported as a common product of the CO 2 photoreduction performed in aqueous (liquid) media 28.Furthermore, the presence of hydrogen carbonates is beneficial because they can act as holes scavenger and can be also converted into other bidentate formate species 4,52.This is one of the key features that can explain the improved performance of this bimetallic oxide-based catalyst with respect to the others. The formation of the carbonate species after the photothermo catalytic measurements was also confirmed by the comparison of the XPS spectra in C 1 s region before and after the test (Fig. S7, Co-Cu/TiCe3 chosen as representative sample).All the spectra show the adventitious carbon peak at 285.0 eV, currently used for calibration 26.Furthermore, the XP spectrum of the sample measured after the CO 2 photoreduction also exhibits a peak at 289.0 eV ascribed to the carbonate species (-CO 3 2-), thus confirming their formation during the reaction.This signal is not present in the sample analyzed before the photothermal tests, pointing to the absence of carbon impurities (they were removed during the cleaning steps, see par.1.3) on the surface of the sample. The photo(thermo) catalytic results and the characterization data here reported can be discussed in terms of different synergisms, which are involved in determining the final performance of the investigated samples. The first exploited synergism is the \"energy synergism\" between the photocatalytic and the thermocatalytic mechanisms.The multi catalytic approach allowed to increase the solar fuel formation (Fig. 6 and Fig. 7).The heating, as well as to increase the rate of the CO 2 conversion and of the water oxidation 10,11, promoted the oxygens mobility of the reducible oxides as CeO 2 , CoO and CuO, and the presence of oxygen vacancies in the CeO 2 (generated by the Ce 3 species as confirmed by XPS) was further increased by the simultaneous addition of copper and cobalt species in the Co-Cu/TiCe3 sample (as confirmed by XPS, Raman and PL measurements).These oxygen vacancies sensibly decrease the energy for the adsorption of CO 2 .It is indeed reported that carbon dioxide preferentially adsorbs on oxygen defective sites 17,18.Furthermore, to have an efficient CO 2 reduction, the electron and proton transfers should be synchronous.Considering that the time scale for the electron transfer is picoseconds whereas that of proton transfer is hundreds of microseconds, the rate determining step of the reaction should be the H transfer process 6,8.In this contest, the contemporaneous presence of solar and thermal energy leads to enhance, as reported in the literature, the proton transfers 53 obtaining beneficial multiple protons/electrons transfers. We want to highlight that this synergism between thermo and photocatalysis had a positive effect only if the photocatalytic mechanism was simultaneously activated.Indeed, no CO and CH 4 formation was detected in the thermocatalytic tests up to 300 C. Although, in fact, the presence of the oxygen vacancies facilitates the adsorption of CO 2 , its further conversion requires multi proton/electron transfers, that can be generated by the photocatalytic mechanism, or higher temperatures (T 300 C) necessary for the carbon dioxide dissociation 4,5,54 as also stated by the CO 2 -TPD.A confirmation of the mutual positive effect between the photocatalytic and the thermocatalytic mechanisms was highlighted by the solar photothermal results performed at increasing temperature with the most performing sample (the Co-Cu/TiCe3 catalyst) (Fig. S8).The high temperature promotes the CeO 2 redox properties 12 favouring the CO/CH 4 formation.It is possible to notice that the beneficial synergistic effect led to a linear growth in the evolution of CO and CH 4 up to about 2 times every 60 C of temperature increase. The CO 2 -TPD and the FTIR measurements pointed to a peculiar \"surface sites synergism\" particularly evident on the bimetallic oxides sample, considering also that the XPS stated the surface segregation of these species on the TiCe3.The strong interaction of CO 2 with the multiple metal surface sites favoured its adsorption and activation.Considering the results obtained which highlighted the greater performance of the Co-Cu/TiCe3 catalyst compared to the other samples, the proposed mechanism of photothermocatalytic conversion of CO 2 is illustrated in Fig. 10. Under solar irradiation, the photogenerated electrons and holes were efficiently separated due to the heterojunction (detected by TEM) between the brookite TiO 2 and the CeO 2 .The conduction and the valence band levels of CeO 2 and brookite TiO 2 allowed the generation of CO and CH 4 and the oxidation of water with the formation of H 14.Copper and cobalt oxides acted as efficient co-catalysts, which allowed to increase the solar fuel formation and to efficiently separate the charge carriers as confirmed by the PL characterization.In fact, the excited electrons can react with the adsorbed CO 2 while the holes interacting with the CoO-CuO co-catalysts, boost up the oxidation of water and the generation of protons.The surface segregation of these oxides on brookite-cerium oxide enabled the improvement of the interaction with carbon dioxide molecules also favouring the formation of carbonate species as intermediates, which paved the way for the conversion of CO 2 into CO and CH 4 . The contemporaneous presence of CoO and CuO on the surface of TiCe3 led to a holistic effect (\"bimetallic oxide synergism\") that permitted to increase the catalytic performance compared to the monometallic counterparts.The strong mutual interaction between the two metal oxides, that influenced their growth and dispersion on the TiCe3 as detected by TEM measurements, allowed to join the beneficial properties of copper and cobalt oxides.In particular, the CuO promoted the CO 2 reduction, being an efficient co-catalyst for the electrons donation 5,23, the cobalt oxide facilitated the formation of oxygen vacancies, as detected by PL spectroscopy, and the holes trap, boosting the oxidation of water and protons formation 8,41.Although these features could be exploited also in the monometallic CoO and CuO catalysts, the simultaneous addition of both oxides on the surface of TiCe3 synergistically increased the solar fuel formation. Finally, it is important to highlight that these peculiar synergisms were more effective in the presence of the pure brookite phase.Indeed, in the same experimental conditions, we have compared the performance in the photothermal test at 120 C of Co-Cu/TiCe3 sample with those of two samples prepared with the same synthesis but employing commercial anatase (Sigma Aldrich 637254) and rutile (Sigma Aldrich 224227) TiO 2 .The use of rutile led to the lowest CO/CH 4 formation (Fig. S9).As reported, the CB energy level of rutile was not appropriate for the CO 2 reduction into CO, whereas the CB edge of anatase was similar to that of brookite 23.However, with the anatase TiO 2 -based composite the CO and CH 4 production were lower (8 and 0.9 mol g -1 h -1 respectively) compared to the brookite-based sample (12 and 1.84 mol g -1 h -1 for CO and CH 4 respectively).The peculiar preparation mode of the pure brookite, its strong interaction with cerium oxide and its specific physico-chemical properties make this crystalline phase particularly suitable for the photoreduction reactions and for multi catalytic approaches 13,555657.The good affinity between brookite TiO 2 and CeO 2 was further highlighted by comparing the photothermal activity of the Co-Cu/TiCe3 with those of Co-Cu/brookite TiO 2 and the Co-Cu/CeO 2 (Fig. S10).Indeed, the CO and the CH 4 formation obtained with the Co-Cu/brookite TiO 2 was about two times and five times lower of the Co-Cu/TiCe3 respectively, whereas the Co-Cu/CeO 2 showed a very low activity being the CO formation 30 times lower than that observed with Co-Cu/TiCe3, without methane evolution. The 0.3-0.3wt was the optimal amount of the bimetallic oxides sample (Fig. S11), whereas a higher amount led to a detrimental effect, presumably due to excessive coverage of the active sites of TiO 2 12,16. The Co-Cu/Ti(brookite)Ce3 also showed a good stability after 3 consecutive runs of phothermocatalytic tests at 120 C (Fig. S12) pointing to as the experimental conditions of this hybrid catalysis or the eventual formation of carbonaceous impurities on the surface of the sample, that however were removed during the cleaning steps (par.1.3), did not affect the catalytic activity of the best performing sample examined in this work."
  },
  {
    "title": "Conclusions",
    "content": "The solar photothermocatalytic conversion of the carbon dioxide was investigated on brookite TiO 2 -CeO 2 -based catalysts.The influence of the addition of small amounts of cobalt oxide, copper oxide and of the CoO-CuO bimetallic oxides was investigated.For both photocatalytic and photothermocatalytic tests, the CoO-CuO supported on the TiO 2 -3 CeO 2 gave the best results.The \"multi\" properties of this peculiar material and the multi catalytic approach allowed to sensibly increase the CO/CH 4 formation.In particular, the use of Co-Cu/TiCe3 material allowed to exploit: (i) the energy synergism between the catalytic and the photocatalytic mechanisms that increased the CO 2 conversion and favoured efficient e -/H transfers; (ii) the surface sites synergism that facilitated the CO 2 adsorption and its activation through the formation of carbonates as intermediates; (iii) the bimetallic oxides synergism that promoted an efficient charge carriers separation, the increase of oxygen vacancies on the brookite TiO 2 -CeO 2 composite and the surface segregation of the added oxides which boosted the CO 2 conversion and the oxidation of water. The application of this hybrid catalysis using versatile catalysts possessing both photocatalytic and thermocatalytic properties can be a fascinating strategy to exploit CO 2 through solar fuel production. Fig. 1. (A) Raman spectra of the analysed catalysts, (B) Zoom of the region of the A 1g vibrational mode of brookite TiO 2 . Fig. 2. TEM images of TiCe3 (A).Particle size distribution and TEM images of Co/TiCe3 (B), Cu/TiCe3 (C) and Co-Cu/TiCe3 (D). Fig. 3. Reflectance spectra of the analysed samples.In the inset the band gap determination of the Co-Cu/TiCe3 as representative catalyst. Fig. 4. Photoluminescence spectra of the analysed samples ( excitation 300 nm). Fig. 5. (A) XPS spectra of the examined samples in the Ti 2p binding energy zone; (B) XPS spectra of Co/TiCe3 and Co-Cu/TiCe3 samples, in the Co 2p zone; (C) Cu/TiCe3 and Co-Cu/TiCe3 samples, in the Cu 2p zone. Fig. 6. (A) Solar photocatalytic CO 2 reduction at room temperature, (B) Photothermocatalytic tests at T 120 C on the brookite TiO 2 -CeO 2 composites.The catalysts were irradiated for 5 h. Fig. 7. (A) Solar photocatalytic CO 2 reduction at room temperature, (B) Photothermocatalytic tests at T 120 C on the TiCe3-based samples.The catalysts were irradiated for 5 h. Fig. 8. CO 2 -TPD curves of the analysed catalysts in the 50-600 C temperature range.The , , and zones identify the weak, medium and strong basic sites, respectively. Fig. 9. FTIR spectra before and after the photothermocatalytic CO 2 reduction on Co/TiCe3, Cu/TiCe3 and Co-Cu/TiCe3. Fig. 10.Proposed photothermocatalytic mechanism with the Co-Cu/TiCe3 catalyst. Textural properties (surface area, mean pore diameter and pore volume) and photothermo catalytic performance (T 120 C) of the used photocatalysts. The PON AIM project of the European Social Found (for the author R. F.) and the PIACERI 2020-2022 project of the University of Catania (for the authors S.S., L.D., A.G.) are acknowledged for funding. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://doi. org/10.1016/j.cej.2021.131249."
  }
]