[
  {
    "title": "Doi",
    "content": "10.1039/d0dt03500a"
  },
  {
    "title": "Article_Title",
    "content": "Iron(<scp>iii</scp>)-bipyridine incorporated metal–organic frameworks for photocatalytic reduction of CO<sub>2</sub> with improved performance"
  },
  {
    "title": "Abstract",
    "content": "Metal-organic frameworks (MOFs) represent an emerging class of platforms to assemble single site photocatalysts for artificial photosynthesis.In this work, we report a new CO 2 reduction photocatalyst (UiO-68-Fe-bpy) based on a robust Zr(IV)-MOF platform with incorporated Fe(bpy)Cl 3 (bpy refers to the 4'-methyl-2,2'-bipyridine moiety) via amine-aldehyde condensation.We show that this hybrid catalyst can reduce CO 2 to form CO under visible light illumination with excellent selectivity and enhanced activity with respect to its parent MOF and corresponding homogeneous counterpart.Using steady state and transient absorption (TA) spectroscopy, we show that the enhanced photocatalytic activity of UiO-68-Febpy is attributed to the elongated excited state lifetime of Fe(bpy)Cl 3 after being incorporated to the UiO-68-NH 2 platform.This work demonstrates the great potential of MOFs as a next generation platform for solar fuel conversion. Electronic supplementary information (ESI) available: Synthesis and characterization of UiO-68-NH 2 and UiO-68-Fe-bpy, photocatalytic experiments, UV-Vis, MS, IR, 1 HNMR, XPS, TGA, EXAFS, femtosecond TA spectra, XRPD patterns, SEM images and gas adsorption experiments.See"
  },
  {
    "title": "Experimental",
    "content": "The as-synthesized UiO-68-NH 2 (0.03 mmol, 0.08 g) was suspended in MeOH (5 mL) under ultrasound conditions, and then bpy-CHO (0.81 mmol, 0.16 g) was dissolved in MeOH (5 mL) followed by the addition of acetic acid (HOAc) (25 L).The mixture was refluxed at 70 C for 24 h.Afterwards, the precipitate was collected by centrifugation and washed with abundant MeOH (three times) and dried in air.The new MOF particles were dispersed in MeOH (10 mL), and then FeCl 3 (1.54mmol, 0.25 g) was added, and the mixture was heated at 70 C for an additional 12 h.The resulting precipitate was col-lected by centrifugation and washed with abundant MeOH (three times) and dried in a vacuum.IR (KBr pellet, cm -1 ) 3429 (m), 1700 (m), 1600 (vs), 1533 (m), 1420 (s), 1182 (w), 1104 (w), 785 (m), 713 (w), 657 (m), 567 (w), 467 (w). The photocatalytic activities of all samples were carried out in a batch-type reaction system (CEL-SPH2N-D9, CeAulight, China) equipped with a homemade photoreactor and a homemade circulating water filter to avoid the photothermal effect.2 mg of sample was dispersed in 1 mL of acetone and ultrasonicated for 5 minutes, and then the suspension was uniformly dispersed onto a glass fiber film ( 25 mm, 0.22 m pore diameter) drop by drop under an infrared lamp.The film was activated in a vacuum at 120 C for 12 h.Then the film was placed in the reaction cell, and 2 mL of triethanolamine (TEOA) was added into the reactor, and the reactor was maintained at 50 C using an oil bath.After complete evacuation of the reaction system (no O 2 or N 2 could be detected), 80 kPa of pure CO 2 gas (99.999,Tianhong Gas) was injected into the airtight system.A 300 W xenon arc lamp (Sirius-300P, Zolix Instruments Co., Ltd, China) with a 400-780 nm filter (CeAulight, China) was used as the light source.The optical power density was set at 200 mW cm -2 , which was measured using an optical power meter (CEL-NP2000-2, CeAulight, China).The gas products were monitored using gas chromatography (GC-9860, Luchuang Instrument, China), equipped with a TCD to measure H 2 , and an FID detector with a methane conversion oven to convert CO and CO 2 into CH 4 before entering the FID.The gas was separated by a 1 m TDX-01 column with N 2 (99.999) as the carrier gas, and the temperatures for the TCD, FID, column and methane converter were 100, 150, 100 and 360 C, respectively.The retention times of CO, CH 4 and H 2 were 1.290, 2.540 and 0.578 min, respectively.The calibration curves for gases were established separately. The Femtosecond TA setup is based on a regenerative amplified Ti-Sapphire laser system (Solstice, 800 nm, 100 fs FWHM, 3.5 mJ per pulse, 1 kHz repetition rate).The tunable (235-1100 nm) pump was generated by TOPAS from seventyfive percent of the Solstice output and was chopped at 500 Hz.The remaining twenty-five percent of the Solstice output was used to generate white light in a sapphire crystal (420-800 nm) in a Helios ultrafast spectrometer (Ultrafast Systems LLC).To make thin films for TA measurements, 1 mg of sample was added into 0.5 mL of Nafion (5 w/w in water and 1-propanol) in a glass vial.The hybrid was stirred for 2 h and then distributed uniformly on a piranha-etched glass.The samples were dried in air.The film samples were constantly translated in the case of heating and permanent degradation.The pump power at 440 nm is 0.2 mW for all measurements. Scheme 1 Synthesis of UiO-68-Fe-bpy. Dalton Transactions"
  },
  {
    "title": "Results_and_Discussion",
    "content": "Briefly, the yellowish crystalline UiO-68-NH 2 was obtained by a solvothermal reaction of amino-triphenyldicarboxylic acid (NH 2 -TPDC) and ZrCl 4 in DMF in the presence of HOAc as a modulator. 53,54UiO-68-NH 2 was then treated with bpy-CHO (excess) and HOAc in MeOH at 70 C for 24 h to afford UiO-68bpy via an amine-aldehyde condensation.UiO-68-Fe-bpy was achieved by metalation of UiO-68-bpy using FeCl 3 (Scheme 1). The powder X-ray diffraction (PXRD) patterns of the as-synthesized UiO-68-NH 2 and post-modified UiO-68-Fe-bpy agree well with the simulated pattern of UiO-68-NH 2 (Fig. 1a), implying that the crystallinity of UiO-68-NH 2 is retained during the PSM reaction.The SEM images show that UiO-68-NH 2 particles are discrete octahedral crystals with dimensions of 2 to 3 m per side (Fig. 1b).The post-modified UiO-68-Fe-bpy shows a similar morphology to its parent MOF (Fig. 1c), which further supports that UiO-68-NH 2 is chemically stable during the PSM.The inductively coupled plasma (ICP) measurement of the Zr : Fe ratio of the digested UiO-68-Fe-bpy is 1 : 0.59 (calcd 1 : 1), where the functionalization yield is 59, which is reasonable as reported previously. 54We tried by varying the reactant ratio, reaction temperature and time to improve the functionalization yield, and finally got the highest yield of 59.The limited modification yield may be ascribed to the heterogeneous PSM reaction. The FT-IR spectra of UiO-68-NH 2 and UiO-68-Fe-bpy in the range of 4000-400 cm -1 shown in Fig. S1, ESI demonstrate the formation of a covalently modified compound.The FT-IR spectrum of UiO-68-NH 2 shows bands at 830 and 1580 cm -1 corresponding to the primary amino in-and out-of-plane bending vibrations, respectively. 55After the amine-aldehyde condensation, the intensity of these characteristic amino peaks decreases.In contrast, the intensity of the peak at 1610 cm -1 associated with the NvC stretching vibration increases. 56These changes imply that UiO-68-NH 2 was successfully modified by amine-aldehyde condensation to generate UiO-68-bpy.In addition, 1 H NMR spectral measurements in DMSO-d 6 for digested UiO-68-NH 2 (Fig. S2a,ESI ) and UiO-68-bpy (Fig. S2b,ESI ) with aqueous HF were performed. The average integration ratio of the signals that originated from bpy-CHO and NH 2 -TPDC as observed for the digested UiO-68-bpy sample (Fig. S2b, ESI ) is 0.62, implying that the functionalization yield of bpy-CHO is 62 agreeing with the ICP result of the Fe-Zr ratio, which further confirms the successful combination of bpy-CHO with UiO-68-NH 2 .Thermogravimetric analysis (TGA) was performed to examine the thermal stability of the frameworks.The TG curves of UiO-68-NH 2 and UiO-68-Fe-bpy show that they have similar thermal stability (Fig. S3, ESI ). In addition to the bulk structure, the local geometry of the Fe center was examined by steady-state X-ray absorption spectra (XAS).The control sample was TPDC-Fe-bpy synthesized by the reaction of dimethyl ester of amino-triphenyldicarboxylic acid (amino-TPDC), bpy-CHO and FeCl 3 using the method for the preparation of UiO-68-Fe-bpy (Fig. S4,ESI ).Fig. 2a shows the XANES (X-ray absorption near edge structure) spectra of UiO-68-Fe-bpy and TPDC-Fe-bpy measured at the Fe edge.The XANES spectrum of the reference sample (FeCl 3 with octahedral geometry) is also shown in Fig. 2a.The main feature observed at 7121.13 eV is assigned to the dipole allowed 1s-4p transition.Additionally, the spectrum of FeCl 3 exhibits a sharp pre-edge feature corresponding to the quadrupole allowed 1s-3d transition and is forbidden for a perfect centrosymmetric octahedral geometry, which suggests the distorted octahedral geometry of the Fe center in FeCl 3 .The XANES spectrum of TPDC-Fe-bpy is similar to that of FeCl 3 .However, there are some differences between the spectra of UiO-68-Fe-bpy and TPDC-Fe-bpy, including the intensity change of the so called B-feature (dashed line in Fig. 2a), and the different shape and intensity of the absorption peak at region C compared to those of FeCl 3 and TPDC-Fe-bpy.These differences were established as a structure sensitive multiple scattering resonance previously, 57,58 implying that the Fe center in the UiO-68-Fe-bpy sample likely adopts a more distorted octahedral geometry.Moreover, the edge energy of both the samples, as shown in the first derivative spectra (the inset of Fig. 2a), is in good agreement with the FeCl 3 reference sample, suggesting that the Fe center retains the 3 oxidation state after incorporation. To gain more insight into the coordination environment, we quantitatively analyzed the extended X-ray absorption fine Paper structure (EXAFS) spectra (Fig. S5, ESI ) using the FeFF model.Fig. 2b shows the EXAFS spectra of UiO-68-Fe-bpy and TPDC-Fe-bpy in R-space.Compared to the spectrum of TPDC-Fe-bpy, the intensity of the peak corresponding to the Fe-ligand first shell (e.g.Fe-N and Fe-Cl) in the spectrum of UiO-68-Fe-bpy is reduced, which can be either attributed to the decrease in the Fe coordination number or the increase in disorder.It is unlikely that the coordination number of Fe changes.As a result, the decreased amplitude for the Fe-ligand first shell peak can be attributed to the increased disorder of the Fe coordination environment in UiO-68-Fe-bpy, consistent with the XANES results.In addition, slight reduction of the bond distance of the Fe-ligand first shell in UiO-68-Fe-bpy was observed compared to that of TPDC-Fe-bpy.These results are further supported by the fitting results.The best fitting to the EXAFS experimental data is also shown in Fig. 2b with the fitting parameters being listed in Tables S1 andS2, ESI, from which we found that the Fe-N distance of UiO-68-Fe-bpy (2.07 A) is reduced by 0.04 A compared to that of TPDC-Fe-bpy (2.11 A).In contrast, while the Fe-Cl distance remains the same (2.18A) for both samples, the Debye-Waller factor increases slightly in the UiO-68-Fe-bpy sample with respect to TPDC-Fe-bpy, consistent with the assignment of the increase in disorder.These results together suggest that the coordination geometry for the Fe center in UiO-68-Fe-bpy is largely similar to that of TPDC-Fe-bpy except for the slightly reduced Fe-N distance and increased disorder for Fe-Cl.X-ray photoelectron spectroscopy (XPS) was employed to explore the elemental composition of UiO-68-Fe-bpy (Fig. S6, ESI ).The peaks at 710.1, 531.6, 400.1, 284.5 and 184.5 eV correspond to the Fe 2p, O 1s, N 1s, C 1s and Zr 3d, respectively.Furthermore, the peak-fitted N 1s core-line spectrum of UiO-68-Fe-bpy (Fig. S7,ESI ) shows the presence of three resolved peaks at 400.4, 399.6 and 398.9 eV, corresponding to the imine (-CvN-), amino (-NH 2 ) and pyridine N, respectively. 55Furthermore, the energy dispersive spectroscopy (EDS) spectra (Fig. S8, ESI ) of UiO-68-Fe-bpy disclosed the presence of metal element and the elemental mapping indicates that Fe was modified uniformly throughout the MOF.The atomic ratio of Zr and Fe from EDS is estimated to be 1 : 0.51, which is close to the ICP result. The gas adsorption properties of the guest-free UiO-68-NH 2 and UiO-68-Fe-bpy were examined to ensure the architectural stability and porosity after PSM.N 2 and CO 2 adsorption isotherms are shown in Fig. S9-S13, ESI. As expected, the results indicate a decrease in porosity after PSM (Fig. S13,ESI ) with Brunauer-Emmett-Teller (BET) surface areas of 2589.7 and 1372.1 m 2 g -1 for UiO-68-NH 2 (Fig. S9,ESI ) and UiO-68-Febpy (Fig. S10, ESI ), respectively, which can be attributed to the introduction of an Fe(bpy)Cl 3 moiety to the functional ligand of UiO-68-NH 2 . 59ith the PSM of the Fe(bpy)Cl 3 moiety into UiO-68-NH 2 , it is expected that UiO-68-Fe-bpy can improve the absorption capacity of visible light compared to UiO-68-NH 2 since the absorption region of TPDC-Fe-bpy extends to 750 nm, which means that TPDC-Fe-bpy (ca.1.69 eV) has a great capacity to absorb visible light (Fig. S14,ESI ).Indeed, the color change from yellow to dark red after metalation was observed due to the coordination of Fe(III) with N atoms of bpy and the presence of ligand-to-metal (bpyFe III ) charge transfer (LMCT), from which the corresponding electronic edge energy (E g ) of LMCT transitions can be estimated. 60UV-Vis diffuse-reflectance spectra (DRS) show that the synthesized UiO-68-NH 2 (ca.2.67 eV) and UiO-68-Fe-bpy (ca.1.87 eV) have a similar absorption band in the region of 250-380 nm (Fig. S14 and S15, ESI ), which can be ascribed to the absorption of the Zr-O cluster. 61However, UiO-68-Fe-bpy exhibits an extra absorption band with the edge extending to around 700 nm in the visible light region, in agreement with the dark red color.These results suggest that UiO-68-Fe-bpy exhibits a better absorption capacity of visible light after the PSM. The electrochemical properties of TPDC-Fe-bpy were investigated by cyclic voltammetry (Fig. S16, ESI ) in a 0.1 M n-Bu 4 NPF 6 /DMF supporting electrolyte saturated with CO 2 .When the electrochemical potential is scanned in the reductive direction, three distinct redox waves at -0.012 ( process 1), -0.626 ( process 2) and -0.971 ( process 3) V versus SCE were observed, which can be attributed to Fe(III/II), Fe(II/I) and Fe(I/ 0). 62As shown in Fig. S17, ESI, compared to a N 2 atmosphere, the redox couple Fe(II/I) becomes irreversible, which suggests that Fe(I) can have interaction with CO 2 (Scheme S1 ).The excited state potential (E) of UiO-68-Fe-bpy was estimated using the equation, E E (FeII/I) E g , where E (FeII/I) is the ground state potential and E g is the above-mentioned electronic edge energy.E was calculated to be about 1.24 V, implying that the electrons can be transferred from UiO-68-Fe-bpy to CO 2 . 63The results together suggest that UiO-68-Fe-bpy has the appropriate energetics and redox properties to catalyze the photocatalytic reduction of CO 2 to form CO. With the successful modification of Fe(bpy)Cl 3 into the robust MOF UiO-68-NH 2 and its feasibility as a photocatalyst for CO 2 reduction, we evaluated the activity and selectivity of UiO-68-Fe-bpy for photocatalytic CO 2 reduction in the presence of TEOA as an electron donor upon visible light irradiation.As shown in Fig. S18, ESI, the FID, which monitors CO and CH 4 , showed that CO was detected with a retention time of about 1.290 min while no CH 4 (retention time: 2.540 min) was detected.On the other hand, the TCD, which monitors H 2 generation, showed that no H 2 (retention time: 0.578 min) was detected.Besides, the 1 H-NMR spectrum was used to detect the liquid product of the photocatalytic reaction and the results show that no liquid product is produced in the reaction system (Fig. S19,ESI ).These results together suggest that the selectivity of CO 2 photoreduction to CO is 100.Such high selectivity may be due to the solvent-free photocatalytic reaction system as reported previously, 64 in which TEOA acts as electron and proton donors and is oxidized to 2-(bis(2-hydroxyethyl)amino)acetaldehyde. 65As shown in Fig. 3a, the control experiment with the Xe lamp off shows that CO 2 to CO did not occur, suggesting that this reaction is light-driven.When the Paper Dalton Transactions system was operated in the presence of UiO-68-NH 2 under visible-light illumination, CO 2 was split into CO at a reaction evolution of 10.01 mol g -1 for six hours.Compared to the poor activity of UiO-68-NH 2 , UiO-68-Fe-bpy exhibits much better photocatalytic efficiency (about 10 times that of UiO-68-NH 2 , Fig. 3a), suggesting that the incorporated Fe(bpy)Cl 3 plays a critical role in improving its photocatalytic activity.It is noteworthy that the photocatalytic efficiency of UiO-68-Fe-bpy is better than those of some typical MOFs and inorganic materials (Table S3, ESI ).Moreover, the photocatalytic performance of the physical mixture of TPDC-Fe-bpy and UiO-68-NH 2 was evaluated under the same catalytic conditions.As shown in Fig. 3a, the system stopped generating CO after three hours upon visible-light illumination, while UiO-68-Fe-bpy can steadily generate CO for at least 6 hours, suggesting that UiO-68-NH 2 can improve the stability of Fe(bpy)Cl 3 , and the CO 2 reduction activity of UiO-68-Fe-bpy is not a simple sum of Fe-bpy and UiO-68-NH 2 activities.The covalent linkage of CvN between UiO-68-NH 2 and bpy could provide the ideal stability of UiO-68-Fe-bpy after the PSM, which can prevent the Fe complex from decomposing under visible light illumination. 66A proposed mechanism for photocatalytic CO 2 reduction over the UiO-68-Fe-bpy under visible light is shown in Scheme S1. Furthermore, the recycling experiments show that a negligible change was observed in the CO-production yield during the three runs for 18 h (Fig. 3b).PXRD patterns (Fig. S20, ESI ) and SEM results (Fig. S21, ESI ) confirm that the crystallinity and structural integrity were retained after the photocatalytic reactions, suggesting that irradiation does not lead to the photodegradation of the catalyst within 18 hours.The results of each cycle obtained by ICP are shown in Table S4, ESI. While the capability of UiO-68-Fe-bpy MOFs as efficient photocatalysts for CO 2 reduction has been successfully demonstrated by the above photocatalytic experiments, it is necessary to study the excited state (ES) dynamics in order to figure out the specific roles that MOFs play in catalytic reactions. Femtosecond TA spectroscopy was used to investigate the ES dynamics of UiO-68-Fe-bpy MOFs.Fig. 4a andb shows the TA spectra of TPDC-Fe-bpy on an Al 2 O 3 film and UiO-68-Fe-bpy MOFs following 400 nm excitation, respectively.The Al 2 O 3 film was used as a control to illustrate the intrinsic effect of the porous surface on ES dynamics.As shown in Fig. 4a, the spectrum of TPDC-Fe-bpy exhibits a negative band centered at 570 nm, which can be assigned to the ground state bleach (GSB).At an early time period (2 ps), two positive features identified as ES absorption were observed at 460-500 nm and 650-800 nm regions.The ES signal at 460-500 nm was quickly replaced by a negative feature, which can be attributed to the overlap of ES absorption with GSB and the faster decay of ES than the GSB recovery.Compared to TPDC-Fe-bpy, UiO-68-Febpy shows similar GSB centered at 600 nm, which is consistent with the UV-Vis ground state absorption spectrum.However, distinct differences were observed between the GSB recovery kinetics of two samples.As shown in Fig. 4c, the recovery of GSB in UiO-68-Fe-bpy is slower than TPDC-Fe-bpy on the Al 2 O 3 film, which suggests that the recovery of ES molecules to the ground state was inhibited in UiO-68-Fe-bpy and thus a longer lived ES of the Fe complex in UiO-68-Fe-bpy.One possible explanation for the elongated ES lifetime is that the rigid framework plays an important role in stabilizing the charged separated excited state and suppressing the undesired charge recombination, which has also been observed in previously published work. 67Therefore, the prolonged ES lifetime of a photocatalyst is beneficial for charge transfer from the sacrificial donor to the catalyst or from the catalyst to reduce CO 2 , which well explains the enhanced catalytic performance of UiO-68-Fe-bpy with respect to TPDC-Fe-bpy for CO 2 reduction."
  },
  {
    "title": "Conclusions",
    "content": "In summary, we have successfully synthesized a MOF photocatalyst by incorporating Fe(bpy)Cl 3 using PSM, which shows an enhanced light-absorbing ability and undergoes highly efficient CO 2 reduction to form CO with 100 selectivity under visible-light irradiation.Using transient absorption spectroscopy, we show that Fe(bpy)Cl 3 in UiO-68-NH 2 has longerlived ES and slower recovery of GSB, which is beneficial for boosting the efficiency of photocatalytic CO production.In addition, the robust nature of UiO-68 ensured the stability of the photocatalyst (UiO-68-Fe-bpy), enabling at least three cycles (18 h) of the photocatalytic process.This work not only reports a new MOF photocatalyst for CO 2 reduction with perfect selectivity for CO generation but also elucidates that PSM is an effective strategy to introduce molecular metal complexes for the optimization of MOF-based materials for photocatalysis. Fig. 1 (a) PXRD patterns of simulated and measured UiO-68-NH 2 and UiO-68-Fe-bpy.SEM images of (b) UiO-68-NH 2 and (c) UiO-68-Fe-bpy. Fig. 2 (a) XANES and (b) Fourier-transform EXAFS spectra of UiO-68-Fe-bpy and TPDC-Fe-bpy at the Fe K-edge.The inset in (a) illustrates the first derivative of the XANES edges.The solid lines and open circles in (b) are experimental and fitted results, respectively. Fig. 3 (a) Photocatalytic CO evolution of UiO-68-NH 2 , TPDC-Fe-bpy and UiO-68-Fe-bpy (2 mg photocatalyst).(b) Recycling performance of UiO-68-NH 2 and UiO-68-Fe-bpy. Fig. 4 Femtosecond TA spectra of (a) TPDC-Fe-bpy and (b) UiO-68-Fe-bpy.(c) Comparisons of the ground state bleach (GSB) recovery between TPDC-Fe-bpy and UiO-68-Fe-bpy. This journal is The Royal Society of Chemistry 2020Dalton Trans.Published on 08 December 2020.Downloaded by Goteborgs Universitet on 12/17/2020 2:57:56 AM.View Article Online We gratefully acknowledge the National Basic Research Program of China (grant no.2017YFA0303504) for financial support of this work.This work was also supported by a Project Funded by the Priority Academic Program Development of Jiangsu Higher Education Institutions.The use of the Advanced Photon Source at Argonne National Laboratory was supported by the U. S. Department of Energy, Office of Science, Office of Basic Energy Sciences, under Award No. DE-AC02-06CH11357.S. Y. acknowledges the John J. Eisch fellowship during the 2018-2019 academic year. There are no conflicts to declare."
  }
]