[
  {
    "title": "Doi",
    "content": "10.1038/s41929-021-00665-3"
  },
  {
    "title": "Article_Title",
    "content": "Self-adaptive dual-metal-site pairs in metal-organic frameworks for selective CO2 photoreduction to CH4"
  },
  {
    "title": "Abstract",
    "content": "Solar-light-driven reduction of CO 2 -to-CH 4 is a complex process involving multiple elementary reactions and various by-products.Achieving high CH 4 activity and selectivity therefore remain a significant challenge.Here we show a bioinspired photocatalyst with flexible dual-metal-site pairs (DMSPs), which exhibit dynamic self-adaptive behaviour to fit mutative C1 intermediates, achieving CO 2 -to-CH 4 photoreduction.The Cu and Ni DMSPs in their respective single-site forms under flexible microenvironment are incorporated into a metal-organic framework (MOF) to afford MOF-808-CuNi.This dramatically boosts CH 4 selectivity up to 99.4 (electron basis) and 97.5 (product basis), and results in a high production rate of 158.7 mol g -1 h -1 with a sacrificial reagent.Density functional theory calculations reveal that the flexible self-adaptive DMSPs can stabilize various C1 intermediates in multistep elementary reactions, leading to highly selective CO 2 -to-CH 4 process.This work demonstrates that efficient and selective heterogeneous catalytic processes can be achieved by stabilizing reaction intermediates via the self-adaptive DMSP mechanism."
  },
  {
    "title": "Experimental",
    "content": "The MOF-808 and MOF-808-EDTA were prepared according to the previously reported methods with modifications 47,48 .Typically, MOF-808 was prepared by 1,3,5-benzenetricarboxylic acid (H 3 BTC) and ZrOCl 2 8H 2 O in a solvent mixture of DMF/formic acid at 135 C for 48 h.EDTA was dangled onto Zr-oxo clusters by reacting MOF-808 in EDTA-2Na aqueous solution at 60 C for 24 h.Then Cu 2 and Ni 2 ions were tethered to MOF-808-EDTA by a facile adsorption and chelation process.Specifically, 100 mg of MOF-808-EDTA was dispersed in 100 ml of aqueous solution with 10 mg of Ni(NO 3 ) 2 6H 2 O and 8 mg of Cu(NO 3 ) 2 3H 2 O, and reacted by stirring for 12 h at 25 C.The product was washed with water and centrifugated, followed by drying under vacuum at 60 C to afford MOF-808-CuNi. MOF-808-Cu.Following a similar synthetic procedure to that of MOF-808-CuNi, the MOF-808-Cu was prepared by using 16 mg of Cu(NO 3 ) 2 3H 2 O, without any other metal salt. MOF-808-Ni.Following a similar synthetic procedure to that of MOF-808-CuNi, the MOF-808-Ni was prepared using 20 mg of Ni(NO 3 ) 2 6H 2 O, without any other metal salt. Mix-MOF-808-Cu-Ni.The 100 mg of physical mixture was obtained by physically mixing 50 mg of MOF-808-Cu and 50 mg of MOF-808-Ni. The MOF-808-CuNi(low) was prepared following a similar synthetic procedure to that of MOF-808-CuNi, except for using 0. MOF-808-MnCo.The MOF-808-MnCo was prepared following a similar synthetic procedure to that of MOF-808-CuNi, except for using 9 mg of Mn(NO 3 ) O were mixed in a 50-ml solution containing 30 ml of acetonitrile, 10 ml of TEOA and 10 ml of H 2 O in a 250-ml quartz reaction cell.The CO 2 (purity 99.999) was purged into this reaction cell for 0.5 h to eliminate the dissolved oxygen.Before illumination, the reactor was installed to CEL-SPH2N system (Beijing China Education Au-light Co., Ltd) equipped with a 300-W Xe lamp with the 420-nm cutoff filter (420 nm 760 nm).On degassing, the system was filled with CO 2 (purity 99.999) to 1 atm.For photocatalytic CO and HCOOH reduction measurements, 10 ml of CO (99.999) or 1 ml of liquid HCOOH was injected into photocatalytic system.Subsequently, the Ar as the packed gas was purged into the system to reach atmospheric pressure.Gas chromatography (Agilent 7890B) was applied to analysed gaseous products by the detectors of a thermal conductivity detector and a flame ionization detector using Ar as the carrier gas.The HCOOH in the liquid phase was analysed using ion chromatography (Thermo ICS-5000).The possible alcohol products were detected by a liquid chromatogram (Waterse 2695), and no related signals could be observed.The catalytic results were repeated three times with three batches of catalysts to give more reliable data.Gas chromatographymass spectrometry (Bruker solanX 70 FT-MS) was applied to analyse the isotope labelled products using 13 CO 2 as the feed gas.The light intensity data were measured using a PM100D optical power meter (Thorlabs) equipped with a S425C detector (Supplementary Table 9).The heterogeneity test was performed by removing the catalyst from the reaction medium at 6 h by centrifugation 49 . Photoelectrochemical measurements.The CHI760E electrochemical workstation (Shanghai Chenhua Instrument Co., Ltd, China) was used to conduct photoelectrochemical measurements in 0.5 mol l -1 Na 2 SO 4 solution with a 300-W Xe lamp light source.A three-electrode experimental system contained the counter electrodes (Pt foil), reference electrodes (Ag/AgCl) and working electrodes (as-prepared catalysts).The photocurrent was performed by intermittent illumination with 0.5 V bias.Electrochemical impedance spectra were measured at open circuit potential.Mott-Schottky plots were measured at the frequencies of 1,000, 2,000 and 3,000 Hz.The CH 4 yields were measured using 420-nm monochromatic light, and the apparent quantum efficiency (AQE) (Supplementary Fig. 15) was calculated on the basis of Ferrioxalate actinometry 34 . The total transferred electrons were calculated as follows, Total electron transfer 2 CO production rate 8 CH4 production rate 2 HCOOH production rate 2 H2 production rate (1) First-principles-based computational details.All DFT calculations were carried out in the framework of the CP2K code with mixed Gaussian and plane-wave basis sets 50 .The norm-conserving Goedecker-Teter-Hutter pseudopotentials were used to describe the core electrons 51525354 .The valence electron wave function was expanded in a double- basis set with polarization functions 55 along with an auxiliary plane-wave basis set.The Perdew, Burke and Enzerhof exchange-correlation functional 56 within the generalized gradient approximation was adopted in the calculations.The cutoff energy was set to 360 Ry.The -point only sampling scheme was applied in all calculations.To verify the calculation accuracy, each reaction configuration was optimized using the Broyden-Fletcher-Goldfarb-Shanno algorithm with self-consistent field convergence criteria of 1.0 10 -8 AU.The total energy change of the reaction configuration was negligible (0.01 eV) when the force convergence criteria of 0.001 hartree per bohr was used. The compensation for the long-range van der Waals dispersion interaction between the adsorbates and MOF skeleton was described using the DFT-D3 scheme 57 with an empirical damped potential term.The Gibbs free reaction energy for each elementary step was calculated at 298.15 K using the computational hydrogen electrode model: 58,59 G where E is the difference of electronic energy derived from CP2K, E ZPE is the difference of zero-point energy (ZPE) and TS is the entropy change, as shown in Supplementary Table 10; e is the elementary charge, e is the number of transferred electrons and U is the applied overpotential, where U 0 V, that is, zero overpotential referenced with the reversible hydrogen electrode and non-charged models are applied in this work.The reliability of non-charged calculation system in the computational hydrogen electrode model has also been investigated in photoelectrochemical reduction of CO 2 to CH 4 (Supplementary Figs.43 and44, Supplementary Tables 11 and12 and Supplementary Notes 11 and 12).The CO hydrogenation rate constant k HYD and CO desorption rate constant k DES are 0.018 and 4.81 10 -12 s -1 , respectively.E ZPE and TS for each reaction intermediate were calculated as follows 60 , where h, v i and k B are the Planck constant, vibrational frequency and Boltzmann constant.Please note only the adsorbates, Cu and Ni atoms were taken into account in the vibrational frequency calculations, while the contributions from the MOF-808-EDTA framework were assumed to be negligible.Gibbs free energies of activation for each elementary step were calculated using the climbing image nudged elastic band method 61,62 .Supplementary Tables 131415show the DFT calculated TS, E ZPE , E DFT and G (all in kJ mol -1 ) for reaction intermediates over MOF-808-CuNi, MOF-808-Cu and MOF-808-Ni.The pristine MOF-808 was composed of Zr 6 O 4 (OH) 4 (HCOO) 6 metal nodes, where each metal node was connected with six 1,3,5-benzene tricarboxylate (BTC 3-) ligands.The diameter of MOF-808 pore apertures was 14 A.The periodic MOF-808 unit cell had 1,280 atoms with a lattice constant of 35.0764 A (Supplementary Fig. 45). To identify the structure of the self-adaptive DMSPs, three configurations with ortho, meta and para positions of two EDTA ligands anchored single Ni and Cu atoms in the six-ring pore of the MOF-808 framework were initially set up, as shown in Supplementary Fig. 46.Periodic AIMD simulations of MOF-808-CuNi were performed in the canonical ensemble (NVT) at 300 K using CP2K.The Nose-Hoover thermostat method was implemented in the NVT ensemble simulations with the time step of 0.5 fs.Each AIMD simulation was run for 20,000 steps, that is a total simulation time of 10 ps.AIMD simulations show that the neighbouring EDTA ligands in the ortho position provide the self-adaptive DMSPs. For computationally feasible, a MOF-808-CuNi cluster model was built in the calculations for studying reaction mechanism and dynamic feature of self-adaptive DMSPs.As shown in Supplementary Fig. 9a, the MOF-808-CuNi cluster model with a total of 276 atoms contained two directly connected Zr 6 metal nodes with six Fig. 1 Schematic illustration of the self-adaptation concept.a,b, Implanting flexible and self-adaptive Cu/Ni DMSPs into MOF-808 for highly selective CO 2 photoreduction to CH 4 .a, The flexible DMSPs for self-adaptive CO 2 -to-CH 4 photoreduction.b, Schematic diagram of bioinspired CO 2 photoreduction in MOF-808-CuNi.Carbon, oxygen, hydrogen, nitrogen, copper and nickel atoms are coloured in grey, red, white, blue, orange and light-grey, respectively.The same colour scheme is applied in Figs. 2 and 5. Fig. 2 teM observations and structural characterization of MOF-808-CuNi.a-c, HR-TEM image (scale bar, 20 nm) (a), energy-dispersive spectroscopy mapping (scale bar, 500 nm) (b) and elemental colour overlay images (scale bar, 500 nm) (c) of MOF-808-CuNi.d, Cu K-edge XANES spectra (inset, DFT-optimized structure of the Cu coordination sphere).e, Ni K-edge XANES spectra (inset, DFT-optimized structure of the Ni coordination sphere).f,g, AIMD-simulated d Cu-Ni and 2N-2N values for a Cu/Ni DMSP (f) and total energy changes relative to the minimum energy (E) (g).t, time.h, Snapshot images of a flexible Cu/Ni DMSP recorded at 1.5, 5.0 and 8.5 ps (the Zr-oxo clusters and ligands in MOF-808-CuNi have been removed for clarity). Fig. 3 Photocatalytic CO 2 reduction performance.a,b, Time-dependent CH 4 and CO evolution curves.Time-dependent production of CH 4 (a) and CO (b) under visible light irradiation (420 nm 760 nm) within 10 h using MOF-808-EDTA (black diamond), MOF-808-Cu (pink triangle), MOF-808-Ni (blue square), MOF-808-CuNi (red sphere) and mix-MOF-808-Cu-Ni (green star).c, The control experiments of photocatalytic CO 2 reduction performance over MOF-808-CuNi under altered conditions; error bars mean standard deviations calculated from three independent measurements.d,e,The isotope labelling experiment for HCOOH, CH 4 and CO. d,13 C nuclear magnetic resonance spectra of the HCOOH product obtained from reaction over MOF-808-EDTA with13 CO 2 and 12 CO 2 .e, Mass spectra of13 CH 4 (m/z 17) and13 CO (m/z 29) produced in the photocatalytic reduction of13 CO 2 over MOF-808-CuNi. Fig. 4 Charge transfer in CO 2 photoreduction over MOF-808-CuNi.a,b, ESR spectra of Cu species in MOF-808-CuNi (a) and Ni species in MOF-808-Ni (b) (MOF-808-Ni is studied instead here because the Ni signal is shielded by the strong Cu signal in MOF-808-CuNi) under various conditions.The A // of 155 g for Cu and the g // of 2.360 are for the distorted tetrahedral Cu coordination, where // indicates that coordinate axes are parallel to the magnetic direction.c, Isosurfaces (level 0.005) of charge density differences on MOF-808-EDTA with Cu 2 and Ni 2 .The minus sign indicates electron accumulation.d, Isosurfaces (level 0.005) of charge density differences on MOF-808-CuNi with CO 2 molecules.Yellow indicates electron accumulation, and light blue indicates depletion.e, Schematic process of charge transfer in the photocatalytic CO 2 reaction over MOF-808-CuNi using Ru(bpy) 3 Cl 2 6H 2 O as a photosensitizer (the ligands in MOF-808-CuNi are removed for clarity). Fig. 5 Detection of the reaction mechanism for the photoreduction of CO 2 to CH 4 .a, In situ DRIFTS spectra at 1,110-2,200 cm -1 for detecting the reaction intermediates in CO 2 photoreduction and recording the adsorption and activation of CO 2 over MOF-808-CuNi in the presence of H 2 O under visible light irradiation.AU, arbitrary units.b, gibbs free energy diagram.The energy data (in red) are the energy of each intermediate state, which is relative to the energy (zero) of the reference system, that is, MOF-808-CuNi and gaseous CO 2 .The energy data in brackets (in black) are the calculated gibbs free energy of activation for each elementary step. 5 mg of Ni(NO 3 ) 2 6H 2 O and 0.4 mg of Cu(NO 3 ) 2 3H 2 O, without any other metal salt. Fig. 6 Self-adaptive Cu and Ni sites for the selective photoreduction of CO 2 to CH 4 .a,b, Configuration evolution with varying values of d Cu-Ni (a) and 2N-2N (b).c,d, Adsorption energies of CO (c) and HCOOH (d) intermediates for various Cu/Ni distances.The red asterisks () represents the strongest binding energies for the CO and HCOOH intermediates that are found with the self-adaptive flexible d Cu-Ni distance. charge transfer resistance than all other counterparts (Supplementary Figs.20 and 21), demonstrating the superior separation and transport of photoinduced charges in MOF-808-CuNi, and this accounts well for its superior photocatalytic activity.Cycling experiments and heterogeneity tests demonstrate the reusable and heterogeneous nature of the catalysts; the activity and selectivity of MOF-808-CuNi are almost maintained in five consecutive runs (Supplementary Figs.22-25and Supplementary Note 6).The microstructure and situation of the catalyst can be retained during the reaction (Supplementary Figs.26 . Moreover, MOF-808-CuNi presents much better charge separation efficiency and lower Reaction conditions: 25 mg of catalyst and 50 mg (the molar concentration of 1.3 mM) of Ru(bpy) 3 Cl 2 6H 2 O as a photosensitizer; 30 ml of MeCN, 10 ml of TEOA as a sacrificial agent and 10 ml of H 2 O; Visible light irradiation (420 nm 760 nm), 1 atm CO 2 and 25 C.b Electron selectivity (Sel electron ) of CH 4 : Sel electron () (8 v(CH 4 ))/(8 v(CH 4 ) 2 v(CO) 2 v(H 2 ) 2 v(HCOOH)) 100; c Product selectivity (Sel product ) of CH 4 : Sel product () (v(CH 4 ))/(v(CH 4 ) v(CO) v(H 2 ) v(HCOOH)) 100, where v(CH 4 ), v(CO), v(H 2 ) and v(HCOOH) denote the formation rates of CH 4 , CO, H 2 and HCOOH, respectively. a Nature CataLYSiS VOL 4 AUgUST 2021 719-729 www.nature.com/natcatal 2 4H 2 O and 10 mg of Co(NO 3 ) 2 6H 2 O, without any other metal salt.MOF-808-CuMn.The MOF-808-CuMn was prepared following a similar synthetic procedure to that of MOF-808-CuNi, except for using 9 mg of Mn(NO 3 ) 2 4H 2 O instead of 10 mg of Ni(NO 3 ) 2 6H 2 O. BRUKER D2 PHASER).The XPS and Auger electron spectroscopy data were collected by ESCALAB 250 X-ray photoelectron spectrometer and the excitation source is Al K X-ray.The position of C 1s line at 284.6 eV was used to correct all XPS spectra.In situ DRIFTS spectra were collected on a Nicolet iS 10 Fourier transform infrared spectrometer equipped with a mercury cadmium telluride detector, using two CaF 2 as windows with the humid ultra-pure CO 2 (99.999) under visible light irradiation.The flowing CO 2 gas passes through the H 2 O trap, before going into the in situ DRIFTS instrument.To avoid the signals of organic ligand, the in situ DRIFTS data were analysed by the difference value of 0 min in light.The Cu and Ni contents were determined by inductively coupled plasma-mass spectrometry data analysis.A Bruker Fourier 400M was used to test nuclear magnetic resonance.The Shimadzu UV-3101 spectrophotometer was used to record UV-vis diffuse reflection spectra.The X-ray absorption structures at the Cu and Ni K-edge of the MOF-808-CuNi were obtained in fluorescence excitation mode using a Lytle detector at the 1W1B station at the Beijing Synchrotron Radiation Facility and the double crystal monochromator was silicon (111).k 3 -weighted (k) data in the k-space were 2 Nature CataLYSiS VOL 4 AUgUST 2021 719-729 www.nature.com/natcatal acknowledgements This work was financially supported by the National Key Projects for Fundamental Research and Development of China (grant no.2016YFB0600901 C.Z.), National Natural Science Foundation of China (grant nos.22038010 to C.Z., 21978212 to H.H., 21725101 to H.L.J., 22161142001 to H.L.J., 91961119 to D.M. and 21521001 to H.L.J.) and the Science and Technology Plans of Tianjin (grant nos.18PTSYJC00180 C.Z. and 19PTSYJC00020 H.H.).We thank the 1W1B station for X-ray absorption fine structure measurements at BSRF and Testing Centre of Tiangong University for providing some analytical tests. The data that support the plots within this paper and other findings of this study are available from the corresponding authors upon reasonable request.Source data are provided with this paper. BTC ligands, where original formic acids at the node of MOF-808 metal node were replaced by two EDTA ligands. C.Z. and H.L.J. conceived the idea, supervised and directed the project.H.L.J., J.L. and H.H. designed the study.J.L. and H.H. performed the experiments.W.X., X.S. and D.M. performed the theoretical calculations and analysed the DFT data.J.L. and K.S. conducted the DRIFTS and ESR experiments.C.W., L.N. and Y.L. participated in some experiments.C.L. and Y.P. studied the proton source in the photocatalytic product by synchrotron-radiation photoionization-mass spectrometry.J.L., H.H., H.L.J., K.S. and C.Z. cowrote the paper.All authors discussed the results and commented on the paper. The authors declare no competing interests."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Morphological and structural characterization.The Cu/Ni DMSPs in MOF-808-CuNi were formed via a facile capture process, where Cu 2 and Ni 2 ions were chelated by the dangling EDTA ligands (Fig. 1a), where roughly two EDTA molecules are grafted onto each Zr 6 cluster (Fig. 1b and Supplementary Fig. 1).Powder X-ray diffraction patterns demonstrate their similar crystalline structures to MOF-808 (Supplementary Fig. 2) 33 .Although no Cu or Ni nanoparticles are present (Fig. 2a), the existence of Cu/Ni is demonstrated in MOF-808-CuNi (Fig. 2b,c, Supplementary Figs. 3 and4 and Supplementary Note 1).The 2 oxidation states of Cu and Ni species in MOF-808-CuNi are further verified by X-ray photoelectron spectroscopy (XPS) (Supplementary Fig. 5).The shifted N 1s peak illustrates the strong interactions between Cu/Ni and the N atoms of EDTA (Supplementary Fig. 6). To further unveil the status of Cu/Ni in MOF-808-CuNi, X-ray absorption near edge structure (XANES) profile was collected.It suggests that the Cu/Ni species are more positively charged than their metal foils and metal oxides, while they are more negatively charged than the metal ions (Supplementary Fig. 7a,b), possibly as a result of the chelation effect of the EDTA.The Fourier transforms of the extended X-ray absorption fine structure spectra exhibit an obvious Cu peak at roughly 1.47 A and a Ni peak at roughly 1.69 A, which are attributed to the isolated Cu(or Ni)-N(O) first coordination shell, whereas another minor peak at 2.17 A (or 2.45 A) could be ascribed to the Cu(or Ni)-C(N or O) second coordination shell (Fig. 2d,e).These results confirm that both Cu and Ni species are in their single-site forms in MOF-808-CuNi.The extended X-ray absorption fine structure fitting analyses further suggest that the Cu and Ni are chelated by EDTA with tetra-coordinated structures of Cu-2N-2O and Ni-2N-2O (Supplementary Fig. 8 and Supplementary Table 1), in line with the DFT-optimized results (insets, Fig. 2d,e and Supplementary Fig. 9a). Given the nonconjugated structure of EDTA, it can endow the chelated Cu and Ni sites with dynamic behaviour.To further understand the bioinspired design of the flexible Cu/Ni DMSPs in MOF-808-CuNi, ab initio molecular dynamics (AIMD) simulations were carried out (Supplementary Video 1).Two important parameters, that is, the distance (d) between Cu and Ni atoms (d Cu-Ni ) and the dihedral angle () formed by the four N atoms in EDTA ( 2N-2N ), clearly describe the variable configurations and the dynamic local structure (Supplementary Fig. 9b,c The same colour scheme is applied in Figs. 2 and5. dynamically fluctuate in the ranges of 4.250 to 5.036 A and 12.419 to 90.114, respectively (Fig. 2f).Accordingly, the total energy also fluctuates throughout the AIMD simulations (Fig. 2g).Similar results can also be observed for MOF-808-Cu and MOF-808-Ni (Supplementary Fig. 10).More intuitively, randomly selected snapshot images recorded at 1.5, 5.0 and 8.5 ps show the different configurations of the Cu and Ni site pairs (Fig. 2h).These images unambiguously highlight the dynamic nature of the catalytic Cu/ Ni DMSPs, which enables a bioinspired local structure, the spatial configuration of which can be self-regulated to adapt to diverse intermediates. The loadings of Cu and Ni in MOF-808-CuNi are estimated to be 1.98 and 0.79 wt, respectively (Supplementary Table 2).MOF-808-CuNi retains moderately high porosity, surface area and CO 2 uptake, indicating its sound CO 2 capture capability and accessibility (Supplementary Figs.111213).Also, MOF-808-CuNi possesses appropriate band edge positions for reducing CO 2 molecules (Supplementary Fig. 14 and Supplementary Note 2). Selective photocatalytic conversion of CO 2 to CH 4 .Photocatalytic CO 2 reduction reactions were conducted and described the Methods.As shown in Table 1 and Fig. 3a,b, MOF-808-EDTA exhibits CH 4 , CO, H 2 and HCOOH evolution rates of 23.4,3.4, 1.6 and 167.1 mol g -1 h -1 , respectively, corresponding to low CH 4 selectivity.Evidently, the HCOOH evolution rate is much higher than that of CH 4 .In comparison, the HCOOH evolution rate of 110.2 mol g -1 h -1 over MOF-808-Ni presents only a slight decrease.This catalytic performance significantly changes after the Cu 2 incorporation.MOF-808-Cu displays an increased CH 4 production rate of 62.1 mol g -1 h -1 and an effectively suppressed HCOOH Nature Catalysis production rate of 2.0 mol g -1 h -1 .By integrating these two metals together to form DMSPs, a significantly enhanced CH 4 production rate of 158.7 mol g -1 h -1 is achieved over MOF-808-CuNi, featuring turnover number of roughly 5.92 at 10 h based on Cu-Ni pairs.A high CH 4 Sel electron of roughly 99.4 and Sel product of roughly 97.5 is achieved, while the by-products are almost negligible.This finding indicates a synergistic effect between Cu and Ni sites for photoreducing CO 2 to CH 4 .In contrast, photocatalytic CO 2 reduction over the physical mixture, denoted mix-MOF-808-Cu-Ni, yields a much inferior CH 4 evolution rate of 47.7 mol g -1 h -1 .The MOF-808-CuNi(low), where the low metal loadings could increase the distance between Cu and Ni sites, exhibits low CH 4 selectivity (Supplementary Table 3), illustrating the synergistic effect might occur only between adjacent Cu and Ni sites.The homogeneous EDTA-CuNi also affords low activity and selectivity, highlighting the key role of MOF-808 for high performance.In particular, MOF-808-CuNi possesses superior CH 4 activity and selectivity, among MOF-808-MnCo, MOF-808-CuMn, MOF-808-NiCo and previously reported photocatalysts (Supplementary Tables 3 and4).The CH 4 apparent quantum efficiency over MOF-808-CuNi (Supplementary Fig. 15 and Supplementary Note 3) is 2.31 under monochromatic light at 420 nm (ref. 34).Moreover, the total electron transfer of MOF-808-CuNi reaches 1,277.6 mol g -1 h -1 , much higher than that of other counterparts (Supplementary Table 5). To further verify the strong capabilities of MOF-808-CuNi for CO 2 -to-CH 4 conversion, the use of CO and HCOOH in this photocatalytic system as C1 feeds was also attempted for generating CH 4 . Explorative experiments were performed using CO and HCOOH feeds under an Ar atmosphere.As expected, MOF-808-CuNi exhibited a much higher CH 4 production rate than other catalysts, supporting the occurrence of a synergistic effect between Cu and Ni sites for photoreducing CO and HCOOH to CH 4 (Supplementary Fig. 16).The results indicate that the flexible DMSPs might self-adaptively bond various C1 intermediates during the reduction of CO 2 to CH 4 .Control experiments clearly indicate that this is a real photocatalytic reduction process with triethanolamine (TEOA) as the sacrificial agent at 25 C, the Ru complex as the photosensitizer and H 2 O as the proton source (Fig. 3c, Supplementary Figs. 17 and 18 and Supplementary Notes 4 and 5).To explore the origin of the products, a 13 CO 2 isotope labelling experiment over MOF-808-CuNi was conducted, demonstrating that CO 2 gas is responsible for the formation of carbon-related products (Fig. 3d,e).Photoelectrochemical measurements were performed to elucidate the excellent CO 2 photoreduction performance of MOF-808-CuNi. The photoluminescence peak intensity is slightly weakened after introducing Ni 2 ions and it is almost quenched on Cu 2 incorporation (Supplementary Fig. 19), suggesting that the incorporation of metal ions suppresses radiative electron-hole recombination 35 -28), demonstrating its stability.In addition, negligible poisoning effect excludes the formation of metal nanoparticles (Supplementary Fig. 29). Charge transfer in the photocatalytic CO 2 reaction.To unveil the charge transfer behaviour during the photocatalytic CO 2 reaction over MOF-808-CuNi, electron spin resonance (ESR) measurements were conducted.The ESR peak (Supplementary Fig. 30) of MOF-808-EDTA at g 2.002 is assignable to oxygen-centred active sites in Zr-oxo clusters 3637383940 , which is generated by electron transfer from Ru(bpy) 3 Cl 2 to Zr-oxo clusters in the MOF.This ESR signal becomes much weaker under a CO 2 atmosphere as electrons are transferred to CO 2 from Zr-oxo centres.Given that Cu(I) and Ni(II) do not generate ESR signals 41,42 , the apparent ESR peaks at g 2.044 and 2.115 are ascribed to Cu(II) and Ni(I), respectively (Fig. 4a,b).On light irradiation, the signal of Cu(II) displays an evident decrease, accompanied by the appearance of the Cu(I) peak in the Auger spectrum (Supplementary Fig. 31 and Supplementary Note 7), while the Ni(I) signal is enhanced indicating that both metal sites are able to accept electrons from Zr-oxo clusters in MOF-808-CuNi.When CO 2 is introduced into the system, these ESR signals are partially recovered, clearly disclosing electron migration from metal sites to CO 2 , giving rise to its subsequent reduction.DFT calculations show the charge density differences between the MOF-808-CuNi system and MOF-808-CuNi system with CO 2 (Fig. 4c,d), further emphasizing that electrons are transported from Zr-oxo clusters to Cu/Ni DMSPs and then coupled with CO 2 molecules.With the above results, the charge transfer mechanism underlying the CO 2 photoreduction over MOF-808-CuNi can be illustrated (Fig. 4e).On photoexcitation, Ru(bpy) 3 2 is promoted to the excited state.This excited state is directly quenched, accompanied by the Ru(bpy) 3 3 formation, during which electrons are transferred from the Ru complex to Zr-oxo clusters.The oxidized light absorber is reduced back to Ru(bpy) 3 2 with the help of TEOA.Then, the electrons on Zr-oxo clusters briefly migrate to Cu/Ni DMSPs.Once CO 2 molecules interact with Cu/Ni DMSPs, the electrons are transferred to CO 2 , leading to the CH 4 product. Reaction mechanism of CO 2 photoreduction to CH 4 .In situ diffuse reflectance infrared Fourier transform spectroscopy (DRIFTS) was performed to detect the reaction intermediates in photocatalytic CO 2 reduction (Fig. 5a and Supplementary Fig. 32).The peaks at 1,439, 1,510 and 1,676 cm -1 can be assigned to HCO 3 , CO 3 and CO 2 species, respectively, which are generated from CO 2 and -OH groups and might serve as possible intermediates for subsequent production of C1 fuels 43 .The CO absorption band at 2,077 cm -1 can be observed in the photocatalytic process 44 .Considering this, the trace amount of CO generated in this photocatalytic system is understandable.The bands at 1,135 and 1,377 cm -1 assignable to OCH 3 and CH 3 groups, respectively, are recognized as the key intermediates that are directly related to the CO 2 -to-CH 4 photoreduction 43,45 . To further understand the CO 2 photoreduction over MOF-808-CuNi, DFT calculations were conducted to illustrate the critical role of the flexible Cu/Ni DMSPs in achieving the excellent CH 4 selectivity.As shown in Fig. 5b (Supplementary Figs.33343536, Supplementary Notes 8 and 9 and Supplementary Table 6), CO 2 photoreduction over MOF-808-CuNi follows the COOH intermediate route, which is first triggered by the activation of CO 2 with Cu-C and Ni-O bonds.Although both CO 2 protonation steps are endergonic (5 and 23 kJ mol -1 ), the first protonation step of CO 2 leading to the COOH formation is thermodynamically and kinetically more feasible than the HCOO formation, with the Gibbs free energy of activation of 54 versus 115 kJ mol -1 .The protonation of formed COOH produces HCOOH with a large exergonic reaction energy (-83 kJ mol -1 ).Another reaction path for COOH protonation leads to the CO formation, with an exergonic Gibbs free reaction energy of -21 kJ mol -1 .Although the HCOOH formation is thermodynamically more favourable, DFT calculations show the CO formation is spontaneous while the HCOOH formation needs to overcome a kinetic barrier of 63 kJ mol -1 .The desorption of HCOOH and CO from the Cu/Ni DMSPs is difficult because the large desorption energies of 94 and 65 kJ mol -1 , respectively.This is consistent with our experimental observation of very low CO production rate (2.3 mol g -1 h -1 ) and no HCOOH product.With calculated Gibbs free energies, CO hydrogenation over MOF-808-CuNi is much faster than its desorption, substantially inhibiting CO desorption.The formed CO is further converted into HCO with a small energy barrier of 39 kJ mol -1 , while the conversion of HCOOH-to-HCO step is not feasible due to the high Gibbs free energy of activation of 91 kJ mol -1 .On HCO formation, the subsequent two protonation steps leading to the methoxy (H 3 CO) formation are kinetically relevant with Gibbs free energies of activation of 51 and 69 kJ mol -1 , respectively.Then, the CH 3 OH intermediate is formed with an exergonic of -18 kJ mol -1 conquering a barrier of 50 kJ mol -1 .DFT calculation also suggests CH 3 OH desorption is difficult because of the large desorption energy of 174 kJ mol -1 .The formed CH 3 OH is then further dehydrated into the CH 3 .Significantly, the generation of CH 3 is evidenced by the in situ DRIFTS results, confirming that CH 4 is derived from CH 3 . For comparison, we also calculated the Gibbs free energy diagrams of CO 2 photoreduction over MOF-808-Cu and MOF-808-Ni on the assumption of the similar reaction route over MOF-808-CuNi (Supplementary Figs.373839404142).For MOF-808-Ni, Gibbs free energies of activation for the formation of CO and HCOOH from COOH are 70 and 72 kJ mol -1 , respectively, indicating these two key reaction steps are competitive.Since the calculated Gibbs free reaction energy of -21 kJ mol -1 and no transition state is located, the desorption of the formed HCOOH is spontaneous.Given the conversion of HCOOH to HCO has to overcome a Gibbs free energy of activation of 46 kJ mol -1 , the formed HCOOH would desorb rather than further being converted leading to CH 4 formation.This explains the experimentally observed high HCOOH production rate of 130.2 mol g -1 h -1 over MOF-808-Ni, and HCOOH rather than CH 4 becomes the main product.Conversely, DFT calculation results show the CO formation from COOH is more favourable than the HCOOH formation over MOF-808-Cu.Although the HCO formation by CO protonation has a large free energy barrier of 70 kJ mol -1 , the CO desorption barrier of 76 kJ mol - 1 is higher.Therefore, the formed CO will be further protonated until the CH 4 formation on MOF-808-Cu.Although the same main product of CH 4 was observed for both MOF-808-CuNi and MOF-808-Cu, compared with MOF-808-CuNi, the CH 4 production rate (62.1 mol g -1 h -1 ) over MOF-808-Cu is greatly reduced.This is largely due to the higher activation barrier of 84 kJ mol -1 for CO 2 activation on MOF-808-Cu than that of 54 kJ mol -1 on MOF-808-CuNi, which is consistent with our experimental observation.Furthermore, the calculated time of flight for the CO 2 -to-CH 4 photoreduction of over MOF-808-CuNi is much higher than those over MOF-808-Cu and MOF-808-Ni (Supplementary Tables 7 and8 and Supplementary Note 10).value is adjusted to 4.454 A to accommodate COOH after one proton-coupled electron transfer process (Fig. 6a).When COOH evolves into HCOOH via the next hydrogenation step, the d Cu-Ni value changes to 4.356 A.Similarly, the other important parameter, 2N-2N , ranges from 66.459 to 83.377 during the CO 2 photoreduction process (Fig. 6b).Clearly, the spatial configuration of the Cu/Ni DMSP is dynamic during CO 2 photoreduction process.Just like the most suitable configurations of enzymes can be induced by bonding to substrates 46 , the d Cu-Ni and 2N-2N values continuously evolve to stabilize the C1 intermediates, suppressing the desorption of by-products.This is believed to be the origin of the highly selective photoreduction of CO 2 to CH 4 .In this way, it can be expected that each reaction intermediate will be in its optimal state during the CO 2 photoreduction reaction.To further prove this assumption, the binding energies of CO and HCOOH on a self-adaptive Cu/Ni DMSP are compared with those for static Cu/Ni site pairs with ten different fixed Cu-Ni distances ranging from 4.0 to 4.8 A (Fig. 6c,d).Both CO and HCOOH are found to have the strongest binding energies for the self-adaptive Cu/Ni DMSP.Therefore, both CO and HCOOH will remain at self-adaptive Cu/Ni DMSPs for further protonation without desorption.We believe that this enhanced stabilization of each reaction intermediate, enabled by the self-adaptive Cu/Ni DMSPs, is the critical factor in achieving the very high CH 4 activity and selectivity."
  },
  {
    "title": "Conclusions",
    "content": "In summary, we have developed a MOF photocatalyst featuring Cu/Ni DMSPs, which exhibit the dynamic capability of enzymes to self-adaptively stabilize diverse C1 intermediates during CO 2 photoreduction, thereby significantly boosting the activity and selectivity for CH 4 .Both Cu and Ni exist in their single-site forms and flexible microenvironment in the DMSPs incorporated into the MOF skeleton 29 , and the bioinspired design of these Cu/Ni DMSPs is confirmed by AIMD simulations.Moreover, DFT calculations unambiguously suggest the synergistic mechanism, in which the spatial configurations of the Cu/Ni DMSPs evolve continuously with the diverse C1 intermediates in a self-adaptive manner during the multistep photocatalytic CO 2 reduction.As a consequence, MOF-808-CuNi exhibits a high Sel electron of roughly 99.4 and Sel product of roughly 97.5 with a fast yield of 158.7 mol g -1 h -1 .This work, inspired by enzymes, provides an approach for the fabrication of heterogeneous catalysts featuring self-adaptive DMSPs for stabilizing reactive intermediates toward efficient and selective CO 2 photoreduction. The MOF-808 and MOF-808-EDTA were prepared according to the previously reported methods with modifications 47,48 .Typically, MOF-808 was prepared by 1,3,5-benzenetricarboxylic acid (H 3 BTC) and ZrOCl 2 8H 2 O in a solvent mixture of DMF/formic acid at 135 C for 48 h.EDTA was dangled onto Zr-oxo clusters by reacting MOF-808 in EDTA-2Na aqueous solution at 60 C for 24 h.Then Cu 2 and Ni 2 ions were tethered to MOF-808-EDTA by a facile adsorption and chelation process.Specifically, 100 mg of MOF-808-EDTA was dispersed in 100 ml of aqueous solution with 10 mg of Ni(NO 3 ) 2 6H 2 O and 8 mg of Cu(NO 3 ) 2 3H 2 O, and reacted by stirring for 12 h at 25 C.The product was washed with water and centrifugated, followed by drying under vacuum at 60 C to afford MOF-808-CuNi. MOF-808-Cu.Following a similar synthetic procedure to that of MOF-808-CuNi, the MOF-808-Cu was prepared by using 16 mg of Cu(NO 3 ) 2 3H 2 O, without any other metal salt. MOF-808-Ni.Following a similar synthetic procedure to that of MOF-808-CuNi, the MOF-808-Ni was prepared using 20 mg of Ni(NO 3 ) 2 6H 2 O, without any other metal salt. Mix-MOF-808-Cu-Ni.The 100 mg of physical mixture was obtained by physically mixing 50 mg of MOF-808-Cu and 50 mg of MOF-808-Ni. The MOF-808-CuNi(low) was prepared following a similar synthetic procedure to that of MOF-808-CuNi, except for using 0. MOF-808-MnCo.The MOF-808-MnCo was prepared following a similar synthetic procedure to that of MOF-808-CuNi, except for using 9 mg of Mn(NO 3 ) O were mixed in a 50-ml solution containing 30 ml of acetonitrile, 10 ml of TEOA and 10 ml of H 2 O in a 250-ml quartz reaction cell.The CO 2 (purity 99.999) was purged into this reaction cell for 0.5 h to eliminate the dissolved oxygen.Before illumination, the reactor was installed to CEL-SPH2N system (Beijing China Education Au-light Co., Ltd) equipped with a 300-W Xe lamp with the 420-nm cutoff filter (420 nm 760 nm).On degassing, the system was filled with CO 2 (purity 99.999) to 1 atm.For photocatalytic CO and HCOOH reduction measurements, 10 ml of CO (99.999) or 1 ml of liquid HCOOH was injected into photocatalytic system.Subsequently, the Ar as the packed gas was purged into the system to reach atmospheric pressure.Gas chromatography (Agilent 7890B) was applied to analysed gaseous products by the detectors of a thermal conductivity detector and a flame ionization detector using Ar as the carrier gas.The HCOOH in the liquid phase was analysed using ion chromatography (Thermo ICS-5000).The possible alcohol products were detected by a liquid chromatogram (Waterse 2695), and no related signals could be observed.The catalytic results were repeated three times with three batches of catalysts to give more reliable data.Gas chromatographymass spectrometry (Bruker solanX 70 FT-MS) was applied to analyse the isotope labelled products using 13 CO 2 as the feed gas.The light intensity data were measured using a PM100D optical power meter (Thorlabs) equipped with a S425C detector (Supplementary Table 9).The heterogeneity test was performed by removing the catalyst from the reaction medium at 6 h by centrifugation 49 . Photoelectrochemical measurements.The CHI760E electrochemical workstation (Shanghai Chenhua Instrument Co., Ltd, China) was used to conduct photoelectrochemical measurements in 0.5 mol l -1 Na 2 SO 4 solution with a 300-W Xe lamp light source.A three-electrode experimental system contained the counter electrodes (Pt foil), reference electrodes (Ag/AgCl) and working electrodes (as-prepared catalysts).The photocurrent was performed by intermittent illumination with 0.5 V bias.Electrochemical impedance spectra were measured at open circuit potential.Mott-Schottky plots were measured at the frequencies of 1,000, 2,000 and 3,000 Hz.The CH 4 yields were measured using 420-nm monochromatic light, and the apparent quantum efficiency (AQE) (Supplementary Fig. 15) was calculated on the basis of Ferrioxalate actinometry 34 . The total transferred electrons were calculated as follows, Total electron transfer 2 CO production rate 8 CH4 production rate 2 HCOOH production rate 2 H2 production rate (1) First-principles-based computational details.All DFT calculations were carried out in the framework of the CP2K code with mixed Gaussian and plane-wave basis sets 50 .The norm-conserving Goedecker-Teter-Hutter pseudopotentials were used to describe the core electrons 51525354 .The valence electron wave function was expanded in a double- basis set with polarization functions 55 along with an auxiliary plane-wave basis set.The Perdew, Burke and Enzerhof exchange-correlation functional 56 within the generalized gradient approximation was adopted in the calculations.The cutoff energy was set to 360 Ry.The -point only sampling scheme was applied in all calculations.To verify the calculation accuracy, each reaction configuration was optimized using the Broyden-Fletcher-Goldfarb-Shanno algorithm with self-consistent field convergence criteria of 1.0 10 -8 AU.The total energy change of the reaction configuration was negligible (0.01 eV) when the force convergence criteria of 0.001 hartree per bohr was used. The compensation for the long-range van der Waals dispersion interaction between the adsorbates and MOF skeleton was described using the DFT-D3 scheme 57 with an empirical damped potential term.The Gibbs free reaction energy for each elementary step was calculated at 298.15 K using the computational hydrogen electrode model: 58,59 G where E is the difference of electronic energy derived from CP2K, E ZPE is the difference of zero-point energy (ZPE) and TS is the entropy change, as shown in Supplementary Table 10; e is the elementary charge, e is the number of transferred electrons and U is the applied overpotential, where U 0 V, that is, zero overpotential referenced with the reversible hydrogen electrode and non-charged models are applied in this work.The reliability of non-charged calculation system in the computational hydrogen electrode model has also been investigated in photoelectrochemical reduction of CO 2 to CH 4 (Supplementary Figs.43 and44, Supplementary Tables 11 and12 and Supplementary Notes 11 and 12).The CO hydrogenation rate constant k HYD and CO desorption rate constant k DES are 0.018 and 4.81 10 -12 s -1 , respectively.E ZPE and TS for each reaction intermediate were calculated as follows 60 , where h, v i and k B are the Planck constant, vibrational frequency and Boltzmann constant.Please note only the adsorbates, Cu and Ni atoms were taken into account in the vibrational frequency calculations, while the contributions from the MOF-808-EDTA framework were assumed to be negligible.Gibbs free energies of activation for each elementary step were calculated using the climbing image nudged elastic band method 61,62 .Supplementary Tables 131415show the DFT calculated TS, E ZPE , E DFT and G (all in kJ mol -1 ) for reaction intermediates over MOF-808-CuNi, MOF-808-Cu and MOF-808-Ni.The pristine MOF-808 was composed of Zr 6 O 4 (OH) 4 (HCOO) 6 metal nodes, where each metal node was connected with six 1,3,5-benzene tricarboxylate (BTC 3-) ligands.The diameter of MOF-808 pore apertures was 14 A.The periodic MOF-808 unit cell had 1,280 atoms with a lattice constant of 35.0764 A (Supplementary Fig. 45). To identify the structure of the self-adaptive DMSPs, three configurations with ortho, meta and para positions of two EDTA ligands anchored single Ni and Cu atoms in the six-ring pore of the MOF-808 framework were initially set up, as shown in Supplementary Fig. 46.Periodic AIMD simulations of MOF-808-CuNi were performed in the canonical ensemble (NVT) at 300 K using CP2K.The Nose-Hoover thermostat method was implemented in the NVT ensemble simulations with the time step of 0.5 fs.Each AIMD simulation was run for 20,000 steps, that is a total simulation time of 10 ps.AIMD simulations show that the neighbouring EDTA ligands in the ortho position provide the self-adaptive DMSPs. For computationally feasible, a MOF-808-CuNi cluster model was built in the calculations for studying reaction mechanism and dynamic feature of self-adaptive DMSPs.As shown in Supplementary Fig. 9a, the MOF-808-CuNi cluster model with a total of 276 atoms contained two directly connected Zr 6 metal nodes with six Fig. 1 Schematic illustration of the self-adaptation concept.a,b, Implanting flexible and self-adaptive Cu/Ni DMSPs into MOF-808 for highly selective CO 2 photoreduction to CH 4 .a, The flexible DMSPs for self-adaptive CO 2 -to-CH 4 photoreduction.b, Schematic diagram of bioinspired CO 2 photoreduction in MOF-808-CuNi.Carbon, oxygen, hydrogen, nitrogen, copper and nickel atoms are coloured in grey, red, white, blue, orange and light-grey, respectively.The same colour scheme is applied in Figs. 2 and 5. Fig. 2 teM observations and structural characterization of MOF-808-CuNi.a-c, HR-TEM image (scale bar, 20 nm) (a), energy-dispersive spectroscopy mapping (scale bar, 500 nm) (b) and elemental colour overlay images (scale bar, 500 nm) (c) of MOF-808-CuNi.d, Cu K-edge XANES spectra (inset, DFT-optimized structure of the Cu coordination sphere).e, Ni K-edge XANES spectra (inset, DFT-optimized structure of the Ni coordination sphere).f,g, AIMD-simulated d Cu-Ni and 2N-2N values for a Cu/Ni DMSP (f) and total energy changes relative to the minimum energy (E) (g).t, time.h, Snapshot images of a flexible Cu/Ni DMSP recorded at 1.5, 5.0 and 8.5 ps (the Zr-oxo clusters and ligands in MOF-808-CuNi have been removed for clarity). Fig. 3 Photocatalytic CO 2 reduction performance.a,b, Time-dependent CH 4 and CO evolution curves.Time-dependent production of CH 4 (a) and CO (b) under visible light irradiation (420 nm 760 nm) within 10 h using MOF-808-EDTA (black diamond), MOF-808-Cu (pink triangle), MOF-808-Ni (blue square), MOF-808-CuNi (red sphere) and mix-MOF-808-Cu-Ni (green star).c, The control experiments of photocatalytic CO 2 reduction performance over MOF-808-CuNi under altered conditions; error bars mean standard deviations calculated from three independent measurements.d,e,The isotope labelling experiment for HCOOH, CH 4 and CO. d,13 C nuclear magnetic resonance spectra of the HCOOH product obtained from reaction over MOF-808-EDTA with13 CO 2 and 12 CO 2 .e, Mass spectra of13 CH 4 (m/z 17) and13 CO (m/z 29) produced in the photocatalytic reduction of13 CO 2 over MOF-808-CuNi. Fig. 4 Charge transfer in CO 2 photoreduction over MOF-808-CuNi.a,b, ESR spectra of Cu species in MOF-808-CuNi (a) and Ni species in MOF-808-Ni (b) (MOF-808-Ni is studied instead here because the Ni signal is shielded by the strong Cu signal in MOF-808-CuNi) under various conditions.The A // of 155 g for Cu and the g // of 2.360 are for the distorted tetrahedral Cu coordination, where // indicates that coordinate axes are parallel to the magnetic direction.c, Isosurfaces (level 0.005) of charge density differences on MOF-808-EDTA with Cu 2 and Ni 2 .The minus sign indicates electron accumulation.d, Isosurfaces (level 0.005) of charge density differences on MOF-808-CuNi with CO 2 molecules.Yellow indicates electron accumulation, and light blue indicates depletion.e, Schematic process of charge transfer in the photocatalytic CO 2 reaction over MOF-808-CuNi using Ru(bpy) 3 Cl 2 6H 2 O as a photosensitizer (the ligands in MOF-808-CuNi are removed for clarity). Fig. 5 Detection of the reaction mechanism for the photoreduction of CO 2 to CH 4 .a, In situ DRIFTS spectra at 1,110-2,200 cm -1 for detecting the reaction intermediates in CO 2 photoreduction and recording the adsorption and activation of CO 2 over MOF-808-CuNi in the presence of H 2 O under visible light irradiation.AU, arbitrary units.b, gibbs free energy diagram.The energy data (in red) are the energy of each intermediate state, which is relative to the energy (zero) of the reference system, that is, MOF-808-CuNi and gaseous CO 2 .The energy data in brackets (in black) are the calculated gibbs free energy of activation for each elementary step. 5 mg of Ni(NO 3 ) 2 6H 2 O and 0.4 mg of Cu(NO 3 ) 2 3H 2 O, without any other metal salt. Fig. 6 Self-adaptive Cu and Ni sites for the selective photoreduction of CO 2 to CH 4 .a,b, Configuration evolution with varying values of d Cu-Ni (a) and 2N-2N (b).c,d, Adsorption energies of CO (c) and HCOOH (d) intermediates for various Cu/Ni distances.The red asterisks () represents the strongest binding energies for the CO and HCOOH intermediates that are found with the self-adaptive flexible d Cu-Ni distance. charge transfer resistance than all other counterparts (Supplementary Figs.20 and 21), demonstrating the superior separation and transport of photoinduced charges in MOF-808-CuNi, and this accounts well for its superior photocatalytic activity.Cycling experiments and heterogeneity tests demonstrate the reusable and heterogeneous nature of the catalysts; the activity and selectivity of MOF-808-CuNi are almost maintained in five consecutive runs (Supplementary Figs.22-25and Supplementary Note 6).The microstructure and situation of the catalyst can be retained during the reaction (Supplementary Figs.26 . Moreover, MOF-808-CuNi presents much better charge separation efficiency and lower Reaction conditions: 25 mg of catalyst and 50 mg (the molar concentration of 1.3 mM) of Ru(bpy) 3 Cl 2 6H 2 O as a photosensitizer; 30 ml of MeCN, 10 ml of TEOA as a sacrificial agent and 10 ml of H 2 O; Visible light irradiation (420 nm 760 nm), 1 atm CO 2 and 25 C.b Electron selectivity (Sel electron ) of CH 4 : Sel electron () (8 v(CH 4 ))/(8 v(CH 4 ) 2 v(CO) 2 v(H 2 ) 2 v(HCOOH)) 100; c Product selectivity (Sel product ) of CH 4 : Sel product () (v(CH 4 ))/(v(CH 4 ) v(CO) v(H 2 ) v(HCOOH)) 100, where v(CH 4 ), v(CO), v(H 2 ) and v(HCOOH) denote the formation rates of CH 4 , CO, H 2 and HCOOH, respectively. a Nature CataLYSiS VOL 4 AUgUST 2021 719-729 www.nature.com/natcatal 2 4H 2 O and 10 mg of Co(NO 3 ) 2 6H 2 O, without any other metal salt.MOF-808-CuMn.The MOF-808-CuMn was prepared following a similar synthetic procedure to that of MOF-808-CuNi, except for using 9 mg of Mn(NO 3 ) 2 4H 2 O instead of 10 mg of Ni(NO 3 ) 2 6H 2 O. BRUKER D2 PHASER).The XPS and Auger electron spectroscopy data were collected by ESCALAB 250 X-ray photoelectron spectrometer and the excitation source is Al K X-ray.The position of C 1s line at 284.6 eV was used to correct all XPS spectra.In situ DRIFTS spectra were collected on a Nicolet iS 10 Fourier transform infrared spectrometer equipped with a mercury cadmium telluride detector, using two CaF 2 as windows with the humid ultra-pure CO 2 (99.999) under visible light irradiation.The flowing CO 2 gas passes through the H 2 O trap, before going into the in situ DRIFTS instrument.To avoid the signals of organic ligand, the in situ DRIFTS data were analysed by the difference value of 0 min in light.The Cu and Ni contents were determined by inductively coupled plasma-mass spectrometry data analysis.A Bruker Fourier 400M was used to test nuclear magnetic resonance.The Shimadzu UV-3101 spectrophotometer was used to record UV-vis diffuse reflection spectra.The X-ray absorption structures at the Cu and Ni K-edge of the MOF-808-CuNi were obtained in fluorescence excitation mode using a Lytle detector at the 1W1B station at the Beijing Synchrotron Radiation Facility and the double crystal monochromator was silicon (111).k 3 -weighted (k) data in the k-space were 2 Nature CataLYSiS VOL 4 AUgUST 2021 719-729 www.nature.com/natcatal acknowledgements This work was financially supported by the National Key Projects for Fundamental Research and Development of China (grant no.2016YFB0600901 C.Z.), National Natural Science Foundation of China (grant nos.22038010 to C.Z., 21978212 to H.H., 21725101 to H.L.J., 22161142001 to H.L.J., 91961119 to D.M. and 21521001 to H.L.J.) and the Science and Technology Plans of Tianjin (grant nos.18PTSYJC00180 C.Z. and 19PTSYJC00020 H.H.).We thank the 1W1B station for X-ray absorption fine structure measurements at BSRF and Testing Centre of Tiangong University for providing some analytical tests. The data that support the plots within this paper and other findings of this study are available from the corresponding authors upon reasonable request.Source data are provided with this paper. BTC ligands, where original formic acids at the node of MOF-808 metal node were replaced by two EDTA ligands. C.Z. and H.L.J. conceived the idea, supervised and directed the project.H.L.J., J.L. and H.H. designed the study.J.L. and H.H. performed the experiments.W.X., X.S. and D.M. performed the theoretical calculations and analysed the DFT data.J.L. and K.S. conducted the DRIFTS and ESR experiments.C.W., L.N. and Y.L. participated in some experiments.C.L. and Y.P. studied the proton source in the photocatalytic product by synchrotron-radiation photoionization-mass spectrometry.J.L., H.H., H.L.J., K.S. and C.Z. cowrote the paper.All authors discussed the results and commented on the paper. The authors declare no competing interests."
  }
]