[
  {
    "title": "Doi",
    "content": "10.1016/j.cej.2021.132348"
  },
  {
    "title": "Article_Title",
    "content": "Organic terpyridine molecule as an efficient cocatalyst for metal–free CO2 photoreduction mediated by mesoporous graphitic carbon nitride"
  },
  {
    "title": "Abstract",
    "content": "Metal-free catalytic conversion of CO 2 with high selectivity and efficiency is promising for achieving carbon neutrality.However, nonmetallic catalytic sites for highly selective and efficient CO 2 photoconversion are still challenging.In this work, organic terpyridine molecules are developed as highly active cocatalysts for visiblelight-driven CO 2 reduction with a CO evolution rate of 1.92 10 4 mol g -1 h -1 and 99.8 selectivity in aqueous solution, which is among the highest CO evolution rates for metal-free CO 2 photoreduction.Mechanistic studies revealed that efficient electron transfer from organic light-absorbing photosensitizer to terpyridine molecules was mediated by mesoporous g-C 3 N 4 (mpg-C 3 N 4 ), with no need of much efforts to optimize inherent fast charge recombination of pristine mpg-C 3 N 4 .The synergistic effect of mpg-C 3 N 4 and terpyridine molecule suppressed H 2 evolution process from CB of mpg-C 3 N 4 and promoted CO 2 reduction at terpyridine sites.These results pave a feasible way to achieve robust metal-free CO 2 photoreduction by employing organic molecular hybrid photocatalysis."
  },
  {
    "title": "Experimental",
    "content": "All reagents including solvents and starting materials for synthesis were purchased from commercial suppliers and used as received.Powder X-ray diffraction (XRD) patterns were obtained using D8 Advance Xray diffractometer with Cu K radiation.CV and photoelectrochemical experiments were carried out on CHI660E in a one-compartment cell equipped with glassy carbon or samples loaded FTO glass as working electrode, Ag/AgCl reference electrode, and platinum plate counter electrode at room temperature.The potentials were referenced to SCE through an internal standard oxidation of Ru(bpy) 3 Cl 2 .GC analysis for CO 2 reduction was performed on Shimadzu GC-2014 (packed column TDX-01, 2 m 3 mm, FID detector with Shimadzu Methanizer MTN-1 for CO and TCD detector for H 2 , N 2 as carrier gas).HCOOH was detected with HPLC Shimadzu LC-20AD (SI-52 4E column and 3.6 mmol/L Na 2 CO 3 aqueous solution as the eluant).X-ray photoelectron spectroscopy (XPS) was carried out using Thermo Scientific K-Alpha with Al K X-ray source (h 1486.6eV).Time-resolved emission decay curves were recorded on Edinburgh FLS980 spectrometer.The UV-vis diffuse reflectance spectra (DRS) were recorded on Lambda 950 Scan Spectrophotometers (Perkin Elmer).N 2 adsorption-desorption isotherms were obtained with Micromeritics ASAP 2460 at 77 K. Fourier transform infrared (FT-IR) spectra were recorded on a Nicolet 670 FT-IR spectrometer with KBr.Scanning electron microscope (SEM) images were obtained on a Hitachi S4800 Field-Emission Scanning Electron Microscope at an accelerating voltage of 15.0 kV. General procedure for synthesis of Tpy x mpg-C 3 N 4 : mpg-C 3 N 4 (0.1 g) and 4-(2,2 :6 ,2 '-terpyridin-4 -yl)benzoyl chloride (x g) were mixed in dry THF (50 mL).Then dry triethylamine (2.0 mL) was added.The mixed solution was stirred at reflux for 12 h under N 2 atmosphere.The resulting mixture was filtered without cooling and the precipitate was collected after washing with THF, CH 2 Cl 2 , C 2 H 5 OH and water.Finally, the collected precipitate was dried at 80 C in vacuum for 24 h to afford Tpy x mpg-C 3 N 4 (x 0.01, 0.05, 0.1, 0.2). A 5 mL mixed DMF/H 2 O solution containing mpg-C 3 N 4 or Tpy x mpg-C 3 N 4 (3 mg), 4CzIPN and 0.28 M TEA was degassed with CO 2 for 16 min in a glass tube.Then the tube was completely sealed with a rubber plug.The solution was irradiated with a white LED equipment (SMPC-LVWT, 420-650 nm, 3 W LEDs) supplied by the Institute of Physics and Chemistry Chinese Academy of Sciences. The generated CO and H 2 were analyzed through an external standard method by injection of 100 L aliquots of headspace gas into Shimadzu GC-2014 instrument equipped with TCD and FID detectors.The possible liquid product such as HCOOH in liquid was analyzed by HPLC Shimadzu LC-20AD.The apparent quantum yield (AQY) of photocatalytic CO 2 reaction is determined according to the following equation: The light sources for AQY are blue LEDs (440 nm, 180 mW cm -2 ).White LEDs were not used to estimate the AQY due to multiple wavelengths.The number of incident photons for photocatalysis was determined to be 8.0 10 21 per hour, which should be overloaded for the present catalytic system when 3 mg catalyst was used.A higher AQY might be obtained when a larger amount of catalyst was used in the photocatalytic process. FTO glass working electrode was prepared as follows: 3 mg mpg-C 3 N 4 or Tpyxmpg-C 3 N 4 was mixed with 10 L Nafion solution in 1 mL C 2 H 5 OH.The mixture was then treated by sonication for 5 min to obtain a suspension.The suspension was carefully dropped onto the conductive surface of FTO glass.Next, the FTO glass was dried under vacuum at 80 C for 12 h to be used as the working electrode. Cyclic voltammograms were carried out in DMF solution containing tetra-n-butylammonium hexafluorophosphate (0.1 M) in a threeelectrode electrochemical cell.The working electrode was FTO glass loaded with mpg-C 3 N 4 or Tpy 0.1 mpg-C 3 N 4 .The reference electrode was Ag/AgCl and the counter electrode is a platinum plate. Mott-Schottky plots, transient photocurrent responses and electrochemical impedance spectra were all obtained in the aqueous Na 2 SO 4 solution (0.4 M) with a three-electrode electrochemical cell.The working electrode was FTO glass loaded with mpg-C 3 N 4 , Tpy 0.05 mpg-C 3 N 4 , or Tpy 0.1 mpg-C 3 N 4 .The reference electrode was Ag/AgCl and the counter electrode is a platinum plate. For Mott-Schottky plots, the initial potential was -0.7 V and the final potential is 1.3 V.The increment of potential was set as 0.05 V.For transient photocurrent responses, run time was 300 s with an interval of 20 s.The light source was the same white LEDs equipment as that used for photocatalytic experiments.The potential for transient photocurrent test was set at open circuit potential.For electrochemical impedance spectra, the potential was set at open circuit potential and the frequency was set from 0.1 to 10 5 Hz."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The hybrid photocatalysts Tpy x mpg-C 3 N 4 were prepared as shown in Scheme 1 and named as Tpy 0.01 mpg-C 3 N 4 , Tpy 0.05 mpg-C 3 N 4 , Tpy 0.1 mpg-C 3 N 4 , and Tpy 0.2 mpg-C 3 N 4 .The subscript represents the mass (g) of terpyridine derivative 4-(2,2 :6 ,2 '-terpyridin-4 -yl) benzoyl chloride used in the synthetic route as shown in Scheme 1.The derivative 4-(2,2 :6 ,2 '-terpyridin-4 -yl)benzoyl chloride 48 and mpg-C 3 N 4 49 were prepared as reported.The reaction between 4-(2,2 :6 ,2 '-terpyridin-4 -yl)benzoyl chloride and mpg-C 3 N 4 was accomplished in 12 h, resulting in the hybrid photocatalyst after filtration and washing with solvents.Various amounts of 4-(2,2 :6 ,2 '-terpyridin-4 -yl)benzoyl chloride were used in the reaction to evaluate the influence of terpyridine molecules on the catalytic activity of hybrid photocatalysts. As shown in Fig. 1a, X-ray diffraction (XRD) measurements show characteristic diffraction peaks of mpg-C 3 N 4 at 12.6 and 27.6 , which are attributed to in-plane packing of tri-s-triazine units and interplanar stacking of aromatic systems in mpg-C 3 N 4 (g-C 3 N 4 , JCPDS No.87-1526).50,51 Hybrid photocatalysts including Tpy 0.01 mpg-C 3 N 4 , Tpy 0.05 mpg-C 3 N 4 , Tpy 0.1 mpg-C 3 N 4 and Tpy 0.2 mpg-C 3 N 4 exhibit similar XRD peak patterns, suggesting the general structure of mpg-C 3 N is still maintained after covalent combination with terpyridine molecules.However, the peak at 12.6 became weaker in the hybrid photocatalysts, which indicates terpyridine molecules are connected to mpg-C 3 N 4 and may decrease the crystallinity of in-plane packing. X-ray photoelectron spectroscopy (XPS) experiments were conducted for pristine mpg-C 3 N 4 and Tpy 0.1 mpg-C 3 N 4 to analyze the surface elements state.The survey spectrum of Tpy 0.1 mpg-C 3 N 4 shows main elements are C, N, and O without any metal elements, which is consistent with the synthetic route (Fig. 1b).The elements fractions of C and O in Tpy 0.1 mpg-C 3 N 4 are slightly higher than those in mpg-C 3 N 4 , which is due to the introduction of terpyridine molecules into the skeleton of mpg-C 3 N 4 (Table S1).The high solution C 1 s spectrum of mpg-C 3 N exhibits characterized peaks of mpg-C 3 N 4 at 284.5, 286.2, and 287.9 eV that are assigned to C-C/C--C, C-NH x (x 1, 2), and N-C--N species, respectively (Fig. 1c).35,37,52 These three peaks were also observed in Tpy 0.1 mpg-C 3 N 4 .However, compared with mpg-C 3 N 4 , the percentages of C -C/C--C and C -NH x are higher in Tpy 0.1 mpg-C 3 N (Table S2).More importantly, a new peak at 289.2 eV that is attributed to C--O species from terpyridine molecules could be observed in the XPS C 1 s spectrum of Tpy 0.1 mpg-C 3 N 4 , indicating the existence of carbonyl group in the hybrid photocatalyst.The high solution O 1 s spectrum of Tpy 0.1 mpg-C 3 N 4 shows a peak at 532.2 eV, which is probably caused by C--O group (Fig. S1).28 For the high solution N 1 s spectra, no new peak was observed and peaks of Tpy 0.1 mpg-C 3 N 4 are similar to mpg-C 3 N 4 at 398.4, 399.8, 400.9, and 404.1 eV that are assigned to C -N--C, N -(C) 3 , NH x and -excitation, respectively.53,54 This indicates that the chemical environment of N element in mpg-C 3 N 4 was less changed after the introduction of terpyridine molecules.However, the percentage of a peak at 398.4 eV became a little higher due to enhancement of sp 2 -hybridized N from terpyridine after treatment of mpg-C 3 N 4 with terpyridine derivate 4-(2,2 :6 ,2 '-terpyridin-4 -yl)benzoyl chloride (Table S3).These results are in accordance with the covalent linkage between mpg-C 3 N 4 and terpyridine molecule via amido bond in the hybrid photocatalysts. The porous morphology structure of hybrid Tpy 0.1 mpg-C 3 N 4 is revealed by Scanning electron microscope (SEM) image in Fig. 1d, which is similar to the porous structure of pristine mpg-C 3 N 4 (Fig. S2).The SEM-EDS elemental mapping results show Tpy 0.1 mpg-C 3 N 4 is mainly composed of C and N with a small amount of O element (Fig. S3).Further N 2 adsorption-desorption isotherms show a type IV isotherm for both Tpy 0.1 mpg-C 3 N 4 (Fig. 1e) and mpg-C 3 N 4 (Fig. S4), confirming their mesoporous structure.The specific surface area of Tpy 0.1 mpg-C 3 N 4 was determined to be 44 m 2 g -1 , which is much smaller than that of mpg-C 3 N 4 (201 m 2 g -1 ).The pore volume of mpg-C 3 N 4 decreased from 0.42 cm 3 g -1 to 0.12 cm 3 g -1 of Tpy 0.1 mpg-C 3 N 4 , suggesting organic terpyridine molecules were embedded into the main structure of mpg-C 3 N 4 .However, the pore size of Tpy 0.1 mpg-C 3 N 4 is 8.73 nm and is similar to that of mpg-C 3 N 4 (9.15 nm).Thus, modification of mpg-C 3 N 4 with terpyridine molecules reduces the specific surface area and pore volume, while the mesoporous structure is kept.Additionally, it was found that Tpy 0.1 mpg-C 3 N 4 displayed a higher CO 2 adsorbed amount than mpg-C 3 N 4 (Fig. S5).This indicates the introduction of terpyridine molecules could promote the adsorption of CO 2 . UV-vis diffuse reflectance spectroscopy (UV-vis-DRS) was used to Scheme 1. Synthetic route of hybrid photocatalysts Tpy x mpg-C 3 N 4 and the chemical structure of 4CzIPN. investigate the electronic absorption properties of mpg-C 3 N 4 and hybrid photocatalysts including Tpy 0.05 mpg-C 3 N 4 and Tpy 0.1 mpg-C 3 N 4 . The UV-vis-DRS results show mpg-C 3 N 4 and hybrid photocatalysts could absorb visible light (Fig. S6).However, a peak at 578 nm was observed for hybrid photocatalysts, which is probably caused by the electronic interaction between mpg-C 3 N 4 and linked terpyridine molecules.The band gaps were further evaluated by corresponding Tauc plots of mpg-C 3 N 4 and hybrid photocatalysts (Fig. 1f).The bandgap of mpg-C 3 N 4 was found to be 2.71 eV as reported.The value is close to that of hybrid photocatalysts (2.75 eV), indicating mpg-C 3 N 4 structure was not significantly changed after modification with terpyridine molecules.Although all these samples based on mpg-C 3 N 4 have suitable band gaps to absorb visible light, they alone may still exhibit poor photocatalytic performance towards CO 2 reduction due to the fast recombination of photogenerated electrons and holes.Fourier transform infrared spectrum (FT-IR) spectra of hybrid photocatalysts including Tpy 0.05 mpg-C 3 N 4 , Tpy 0.1 mpg-C 3 N 4 , and Tpy 0.2 mpg-C 3 N 4 were next recorded to investigate the connection between terpyridine molecules and mpg-C 3 N 4 (Fig. S7).A characterized peak of mpg-C 3 N 4 could be observed at 807 cm -1 that is assigned to triazine units for all hybrid photocatalysts.35,55 Multiple peaks from 1200 to 1800 cm -1 were also observed, which are ascribed to single C-N and double C--N bonds.Another peak at 2175 cm -1 can be assigned to triple C ---N bonds.56 Additionally, a broad band from 3000 to 3500 cm -1 was observed for pristine mpg-C 3 N 4 due to -NH 2 groups.35 This broad band is weaker in the hybrid photocatalysts, while the peak at 807 cm -1 is much stronger than pristine mpg-C 3 N 4 , indicating connection between terpyridine compound and mpg-C 3 N 4 .The peak of the carbonyl group in the hybrid photocatalysts is not observed obviously, which is probably due to overlapping with peaks of mpg-C 3 N 4 from 1200 to 1800 cm -1 . Visible-light-driven CO 2 reduction experiments were carried out in mixed DMF/H 2 O solution as we previously reported.44,45 Since fast recombination of photogenerated electrons and holes in pristine mpg-C 3 N 4 , an organic TADF photosensitizer 4CzIPN was used here to absorb visible light and enhance the spatial separation of electrons and holes.It is should be mentioned that 4CzIPN could be facilely synthesized from commercial materials in one step reaction in high yield with relatively low cost.57 Triethylamine (TEA) was used as the sacrificial electron donor to reduce the excited state of 4CzIPN.Light sources are white light LEDs (420-650 nm, 3 W LEDs). All photocatalysts including mpg-C 3 N 4 , Tpy 0.01 mpg-C 3 N 4 , Tpy 0.05 mpg-C 3 N 4 , Tpy 0.1 mpg-C 3 N 4 , and Tpy 0.2 mpg-C 3 N 4 showed efficient conversion of CO 2 into CO with negligible H 2 evolution in the presence of organic photosensitizer 4CzIPN (Fig. 2a), indicating their high selectivity for CO 2 reduction.The catalytic system with pristine mpg-C 3 N 4 only generated a small amount of CO (0.3 mol), which was much lower than hybrid photocatalysts bearing terpyridine molecules (Table S4).It was further found that Tpy 0.1 mpg-C 3 N 4 displayed the best catalytic performance with the formation of 36.06 mol CO and the selectivity over H 2 was up to 99.9.This demonstrated terpyridine molecules could strongly promote CO generation during photocatalytic CO 2 reduction reactions.To show the significance of covalent bonding between terpyridine molecules and mpg-C 3 N 4 , a comparison of catalytic efficiency is collected in Table 1.Table 1 undauntedly demonstrates the synergistic effect of terpyridine and mpg-C 3 N 4 during photocatalysis.Control experiments further revealed that light, CO 2 , TEA, 4CzIPN, and hybrid catalyst were all indispensable for achieving efficient CO 2 reduction catalysis (Table S5).It is noteworthy that there was no detectable formation of CO and H 2 under visible light irradiation for 2 h in the absence of photosensitizer 4CzIPN.Isotopic labelling experiment using 13 CO 2 instead of CO 2 was further carried out to confirm the generation of 13 CO (Fig. S8), suggesting carbon dioxide is the carbon source in the photocatalytic CO 2 reduction. As shown in Fig. 2b, the organic photosensitizer 4CzIPN plays a vital role in the photocatalytic process.As 4CzIPN was added from 0.1 mg to 1.0 mg, the amount of generated CO increased significantly.More addition of 4CzIPN was failed to further enhance the generation of CO, which was probably due to precipitation of 4CzIPN in the presence of water.Extra light-absorbing molecular photosensitizers like 4CzIPN were seldom used in photocatalytic reactions based on graphitic carbon nitride because of the inherent light-absorbing ability of graphitic carbon nitride.However, catalytic results in Fig. 2b undoubtedly demonstrate the significance of 4CzIPN for CO 2 reduction.Thus, it is assumed that electrons on the reduced state of 4CzIPN would transfer to valence band (VB) of mpg-C 3 N 4 for further reduction of CO 2 .Although no effort like optimizing band potentials was made to restrict the fast recombination of photogenerated electrons and holes originating from mpg-C 3 N 4 , electrons from reduced photosensitizer 4CzIPN might finally reach terpyridine fragments through VB of mpg-C 3 N 4 .In this way, photogenerated electrons and holes are efficiently separated between 4CzIPN and terpyridine fragments. Water as a green solvent is attractive for photocatalytic CO 2 reduction due to potential coupling with water oxidation reaction in which water could also be used as the electron donor and proton donor.However, water was usually avoided in the hybrid photocatalytic systems for molecular catalysts and pure organic solvent such as acetonitrile was more popular.This is probably because water reduction is simultaneously feasible under CO 2 reduction conditions, resulting in low selectivity in the presence of water.Nevertheless, molecular hybrid photocatalyst Tpy 0.1 mpg-C 3 N 4 showed high selectivity up to 99.9 towards CO formation (36.06 mol CO and 0.026 mol H 2 ) even in the presence of water (Fig. 2c).More importantly, it was found water strongly promote the photocatalytic process when water fraction was increased to 40.A larger amount of water obviously reduced the generation of CO, probably because of the low solubility of 4CzIPN in water.This phenomenon is in consistence with our previous results when terpyridine-based iron complexes were used for photocatalytic CO 2 reduction.44,45 It is therefore assumed that redox-active terpyridine fragments are key species for CO 2 reduction. To know more about the influence of terpyridine molecules on photocatalytic CO 2 reduction, the time-dependent performances of pristine mpg-C 3 N 4 and Tpy 0.1 mpg-C 3 N 4 were specifically investigated under identical optimal conditions.As depicted in Fig. 2d, hydrogen evolution was negligible for both catalysts.The whole catalytic cycle ceased after 120 min of visible light irradiation due to the decomposition of 4CzIPN.These results are similar to previous reports by using terpyridine-related catalysts for photocatalytic CO 2 reduction.44,45 The hybrid photocatalyst Tpy 0.1 mpg-C 3 N 4 produced 57.6 mol CO with an evolution rate of 1.92 10 4 mol g -1 h -1 , while pristine mpg- C 3 N 4 only generated 1.58 mol CO with an evolution rate of 5.25 10 2 mol g -1 h -1 .The selectivity for Tpy 0.1 mpg-C 3 N 4 is determined to be 99.8 (0.12 mol H 2 ).Further characterizations of Tpy 0.1 mpg-C 3 N 4 after the photocatalysis were also conducted by XRD (Fig. S9) and XPS (Fig. S10), which showed no big differences before and after photocatalysis.found Although the reaction time is relatively short due to the decomposition of organic photosensitizer 4CzIPN, this catalytic system showed three photocatalytic cycles without significant loss of catalytic activity (Fig. S11).The quantum yield was estimated to be 0.2 when 3 mg Tpy 0.1 mpg-C 3 N 4 was used under blue light irradiation (440 nm, 180 mW cm -2 ). To gain insights into the photocatalytic process, photoelectrochemical measurements were carried out.As discussed above, band gaps of hybrid photocatalysts Tpy 0.05 mpg-C 3 N 4 and Tpy 0.1 mpg-C 3 N 4 are close to mpg-C 3 N 4 .Mott-Schottky plots were then recorded to determine the band potentials of these materials.Fig. 3a shows Tpy 0.1 mpg-C 3 N 4 is a n-type semiconductor and the conduction band potential of Tpy 0.1 mpg-C 3 N 4 was estimated to be -1.08V. Conduction band potentials of Tpy 0.05 mpg-C 3 N 4 and mpg-C 3 N 4 were determined to be -1.07V and -1.09V, respectively (Fig. S12 andS13).These values are nearly identical and reveal that terpyridine molecules have negligible influence on the band potentials of mpg-C 3 N 4 .It is therefore concluded that the higher CO evolution rates for hybrid photocatalysts were not caused by optimization of band potentials of mpg-C 3 N 4 .Additionally, a small potential wave around -1.16 V was observed for Tpy 0.1 mpg-C 3 N 4 which is probably ascribed to terpyridine fragments and much smaller than free terpyridine derivatives (Fig. S14).45 Although the potential of terpyridine fragments in hybrid photocatalysts is a little more negative than potential of mpg-C 3 N 4 (-1.09V), electrons on the CB of mpg-C 3 N 4 might transfer to terpyridine fragments due to electron-withdrawing character of pyridine groups.Pyridinebased molecules have been shown as homogeneous electrocatalysts for CO 2 reduction in spite of controversies over catalytic efficiencies.58,59 Photocurrent responses of mpg-C 3 N 4 , Tpy 0.05 mpg-C 3 N 4 and Tpy 0.1 mpg-C 3 N 4 were obtained with a three-electrode system in 0.4 M Na 2 SO 4 aqueous solution.As can be seen from Fig. 3b, hybrid photocatalysts such as Tpy 0.05 mpg-C 3 N 4 and Tpy 0.1 mpg-C 3 N 4 showed enhanced photocurrents compared with mpg-C 3 N 4 , indicating more efficient generation and separation of photogenerated electrons and holes in the hybrid photocatalysts.In this context, terpyridine fragments of hybrid photocatalysts may behave as electron reservoirs that could store electrons from CB of mpg-C 3 N 4 .This was further proved by timeresolved fluorescence decay spectra of mpg-C 3 N 4 and Tpy0.1mpg-C 3 N 4 in Fig. 3c.The average fluorescence lifetime of Tpy0.1mpg-C 3 N was determined to be 5.19 ns, which is longer than that of mpg-C 3 N (3.30ns).The longer fluorescence lifetime for hybrid photocatalyst revealed longer existence of photogenerated electrons in the presence of electron acceptor terpyridine groups.The long-lived photogenerated electrons are beneficial for CO 2 reduction, which is consistent with the fact that much higher CO evolution rates for hybrid photocatalysts were observed than pristine mpg-C 3 N 4 .Electrochemical impedance spectra (EIS) show a smaller radius for Tpy0.1mpg-C 3 N 4 than mpg-C 3 N 4 in Nyquist plots, indicating less charge-transfer resistance in hybrid photocatalysts (Fig. 3d).Taken together, these results demonstrate redox- active terpyridine molecules covalently tethered to mpg-C 3 N 4 could enhance the separation of photogenerated electrons and holes in the hybrid photocatalysts for photocatalytic CO 2 reduction. A probable mechanism is proposed for photocatalytic CO 2 reduction with molecular hybrid photocatalysts based on the above results.As shown in Fig. 4, photosensitizer 4CzIPN is stimulated to excited state (P) upon visible light irradiation.Then P receives an electron from sacrificial electron donor TEA and is reduced to anion species P -.P -is a reductant with a moderate potential (-1.21 V) that is further oxidized by CB of mpg-C 3 N 4 (-1.09V).Next, electrons are delocalized on the covalently linked terpyridine groups due to electron-withdrawing ability.However, electrons may transfer back to CB of mpg-C 3 N 4 because of relatively narrow energy barrier between CB of mpg-C 3 N 4 and reduction potential of adjacent terpyridine groups.This is supported by the longer fluorescence lifetime of hybrid photocatalyst.As a result, terpyridine moieties function as electron reservoirs.That is to say, electrons from sacrificial electron donor TEA would finally get to terpyridine groups through 4CzIPN and mpg-C 3 N 4 .The electrons stored in the terpyridine groups could be further utilized for reduction of CO 2 .Photogenerated electrons originating from VB of mpg-C 3 N 4 are not ruled out.However, fast charge recombination will occur in the absence of terpyridine molecules and 4CzIPN, which is supported by low catalytic efficiency of pristine mpg-C 3 N 4 even in the presence of 4CzIPN.This photocatalytic process highlights the synergistic effect of mpg-C 3 N 4 and redox-active terpyridine molecules which make charge separation more efficient and store long-lived electrons at terpyridine sites for CO 2 reduction.In this case, high selectivity of CO evolution over H 2 could be achieved due to suppression of H 2 generation from CB of mpg-C 3 N 4 ."
  },
  {
    "title": "Conclusions",
    "content": "In summary, redox-active organic terpyridine molecules have been covalently linked to mpg-C 3 N 4 for robust photocatalytic CO 2 reduction with a CO evolution rate up to 1.92 10 4 mol g -1 h -1 in combination with an organic TADF photosensitizer 4CzIPN.The metal-free molecular hybrid system has been studied by FT-IR, XPS, XRD, SEM, UV-vis-DRS, electrochemical impedance spectroscopy and time-resolved fluorescence spectroscopy.It was demonstrated that photosensitizer 4CzIPN received an electron from sacrificial donor TEA and electrons were finally stored in terpyridine molecules for CO 2 reduction.The process was mediated by mpg-C 3 N 4 which acted as an electron transporter.Since electrons were consumed at terpyridine sites rather than CB of mpg-C 3 N 4 , the selectivity for CO generation was as high as 99.8 even in the presence of a large amount of water.These results prove that terpyridine molecules could be used as cocatalysts for CO 2 reduction without the aid of metal cations, which sheds new light on catalytic sites of polypyridine metal complexes for photocatalytic CO 2 reduction.Additionally, these results offer a promising and feasible way to achieve highly selective and efficient metal-free CO 2 photoreduction by taking advantage of organic redox-active species and nonmetallic semiconductor in a molecular hybrid catalytic system. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Fig. 1.Structure characterization.(a) XRD patterns of mpg-C 3 N 4 , Tpy 0.01 mpg-C 3 N 4 , Tpy 0.05 mpg-C 3 N 4 , Tpy 0.1 mpg-C 3 N 4 and Tpy 0.2 mpg-C 3 N 4 .(b) XPS survey spectrum of Tpy 0.1 mpg-C 3 N 4 .(c) High solution C 1 s spectra of mpg-C 3 N 4 and Tpy 0.1 mpg-C 3 N 4 .(d) SEM image of Tpy 0.1 mpg-C 3 N 4 and the scale bar is 1 m.(e) N 2 adsorption-desorption isotherms of Tpy 0.1 mpg-C 3 N 4 and the inset is corresponding pore size distribution.(f) Tauc plots of mpg-C 3 N 4 , Tpy 0.05 mpg-C 3 N 4 , and Tpy 0.1 mpg-C 3 N 4 . Fig. 2. Photocatalytic CO 2 reduction.(a) Photocatalytic CO 2 reduction in mixed DMF/H 2 O (v/v, 3:2) solution with 0.5 mg 4CzIPN, 0.28 M TEA and 3 mg various catalysts under 2 h of visible light irradiation (1 mpg-C 3 N 4 , 2 Tpy 0.01 mpg-C 3 N 4 , 3 Tpy 0.05 mpg-C 3 N 4 , 4 Tpy 0.1 mpg-C 3 N 4 and 5 Tpy 0.2 mpg-C 3 N 4 ).(b) Photocatalytic CO 2 reduction in mixed DMF/H 2 O solution (v/v, 3:2) with 3 mg Tpy0.1mpg-C 3 N 4 , 0.28 M TEA and various amounts of 4CzIPN from 0.1 to 1.5 mg under 2 h of visible light irradiation.(c) Photocatalytic CO 2 reduction using 0.5 mg 4CzIPN, 3 mg Tpy 0.1 mpg-C 3 N 4 and 0.28 M TEA with various water fractions (0, 20, 40, 60 and 80) under 2 h of visible light irradiation.(d) Time courses of CO and H 2 formation with mpg-C 3 N 4 and Tpy 0.1 mpg-C 3 N 4 under optimal conditions containing 3 mg catalyst, 1 mg 4CzIPN and 0.28 M TEA in CO 2 -saturated DMF/H 2 O (v/v, 3:2) solution. Fig. 3. Mechanistic studies.(a) Mott-Schottky plots of Tpy 0.1 mpg-C 3 N 4 .(b) Transient photocurrent responses of mpg-C 3 N 4 , Tpy 0.05 mpg-C 3 N 4 and Tpy 0.1 mpg-C 3 N 4 .(c) Emission decay of mpg-C 3 N 4 and Tpy 0.1 mpg-C 3 N 4 . ex 360 nm and em 450 nm.(d) EIS of mpg-C 3 N 4 , Tpy 0.05 mpg-C 3 N 4 and Tpy 0.1 mpg-C 3 N 4 . Chen: Data curation, Validation, Formal analysis, Writingoriginal draft, Investigation.Ting Liu: Data curation, Investigation.Duobin Chao: Validation, Formal analysis, Investigation, Writingoriginal draft, Writingreview editing, Conceptualization, Methodology, Supervision, Funding acquisition, Project administration. Fig. 4. Probable mechanism.Proposed mechanism for photocatalytic CO 2 reduction. Catalytic evidence of synergistic effect of terpyridine molecules and mpg-C 3 N 4 for CO 2 photoreduction.a. This work was supported by the National Natural Science Foundation of China (21605013) and Natural Science Foundation of Ningbo (202003N4077). Supplementary data to this article can be found online at https://doi. org/10.1016/j.cej.2021.132348."
  }
]