[
  {
    "title": "Doi",
    "content": "10.1016/j.cej.2020.125390"
  },
  {
    "title": "Article_Title",
    "content": "Plasmon-induced interfacial charge-transfer transition prompts enhanced CO2 photoreduction over Cu/Cu2O octahedrons"
  },
  {
    "title": "Abstract",
    "content": "The plasmon-induced interfacial charge-transfer transition (PICTT) involves the direct electron transfer from a plasmonic metal to the acceptor state in a semiconductor (SC).Such plasmonic decay is fostered by strong orbital coupling and mixing of electronic levels in plasmonic metals and SC.Although the effectiveness of PICTT for charge transfer has been testified, its realization still remains a great challenge.Herein, we employed a facile electroless reduction strategy for the in-situ growth of copper (Cu) nanoparticles (NPs) over Cu 2 O ordered octahedrons.Amorphous carbon formed at the Cu 2 O surface via calcination provides an electroless reduction configuration for the conversion of Cu ions within Cu 2 O lattice into Cu NPs.The in-situ growth guarantees a rational couple of Cu 2 O with its derivative Cu NPs.Such a unique arrangement enables extension of optical absorption range as well as achievement of PICTT upon excitation of Cu-localized surface plasmon resonance (LSPR), which promotes desirable CO 2 photoreduction activity under near-infrared irradiation.This work provides an effective strategy for constructing plasmonic-metal/metal-oxide composites with enhanced photocatalytic efficiency."
  },
  {
    "title": "Experimental",
    "content": "All chemicals and reagents are of analytical reagents grade and used without further purification.Copper chloride dihydrate (CuCl 2 2H 2 O), PVP (K30), sodium hydroxide (NaOH) and L-ascorbic acid (C 6 H 8 O 6 ) were purchased from Beijing Sinopharm Chemical Reagent Co., Ltd. Cu 2 O octahedrons were prepared according to the literature 33 with a little modification.Typically, 3.33 g of PVP was dissolved in 100 mL aqueous CuCl 2 2H 2 O (0.01 M) solution under magnetic stirring.Then, 10 mL of NaOH solution (2 M) was dropped onto the above solution with stirring for 30 mins.Color of the solution turned rapidly from pale blue to turbid blue and finally to dark brown.Afterwards, 6 mmol of aqueous ascorbic acid was added dropwise to the above suspension with aging for another 3 h.All the above procedures were conducted under continuous stirring at a fixed temperature of 60 C.The resultant brick-red precipitates were separated by repeating centrifugation-washing cycles with H 2 O and ethanol and dried under vacuum at 60 C overnight.The as-obtained powders were further annealed at 400 C under N 2 environment during different periods.Before the calcination, N 2 gas was flowed for 30 mins to purge air away from the oven.The prepared photocatalysts were denoted as Cu 2 O, Cu 2 O-1, Cu 2 O-2 and Cu 2 O-3 for samples calcined for 0, 1, 2 and 3 h, respectively.During the CO 2 PR test, the Cu 2 O-1 sample showed the best activity.Therefore, most characterizations were devoted to this sample and pristine Cu 2 O unless otherwise stated. X-ray diffraction (XRD) patterns of the samples were obtained using D/Max-RB X-ray diffractometer (Rigaku, Japan) with CuK radiation ( 1.5406 A) at a scan rate of 0.05(2) S -1 .Raman spectroscopy was performed on Micro-Raman spectrometer (Renishaw InVia) with back-scattering geometry and 630 nm Ar laser as an excitation source.Field-emission scanning electron microscopy (FESEM) (JSM-7500F, JEOL, Japan) equipped with energy-dispersive X-ray spectroscope (EDS) (Oxford Instruments, UK), transmission electron microscopy (TEM) and high-resolution transmission electron microscopy (HRTEM (Titan G2 60-300 operated at 300 kV) were used to investigate the morphologies, microstructure and elemental distributions of the prepared samples.The surface composition and chemical states of Cu 2 O and Cu 2 O-3 samples were tested by X-ray photoelectron spectroscopy (XPS) (Thermo ESCALAB 250).Diffused reflectance spectroscopy (DRS) was employed to investigate the ultraviolet-visible-near-infrared (UV-Vis-NIR) light absorption of the studied samples.BaSO 4 was used as the reflectance standard.To determine the Brunauer-Emmett-Teller (BET) specific surface area (S BET ) and porosity of the prepared samples, the nitrogen adsorption-desorption and CO 2 adsorption isotherms were measured on a Micromeritics ASAP 2020 apparatus (USA).The pore size, average pore size and pore volume of the samples were calculated through the Barret-Joyner-Halender (BJH) method.Steady-state photoluminescence (PL) spectra were recorded on a Hitachi F-7000 (Japan) Scheme 1. Fabrication process of Cu/Cu 2 O hybrid system.fluorescence spectrophotometer while time-resolved photoluminescence (TRPL) spectra were recorded by an FLS1000 fluorescence lifetime spectrophotometer (Edinburgh Instruments, UK) with 450 nm as an excitation wavelength.Diffuse-reflectance-infrared Fourier transform spectroscopy (DRIFTS) analysis was obtained by an FTIR spectrometer (Thermo Scientific, Nicolet iS50, USA).For such a test, the sample was placed into the reaction chamber then a mixed stream of CO 2 and H 2 O gases was allowed to flow into the chamber.The change in the IR spectrum of the sample is recorded at different times after the gas flow.The DRIFTS analysis was conducted under both dark and light irradiation conditions to investigate the actual reduction mechanism for CO 2 over the prepared catalyst. The electrochemical measurements were performed in a standard three-electrode configuration analyzer (CHI660C instruments, CHI, China) system where Pt wire and Ag/AgCl were utilized as counter and reference electrodes, respectively.The working electrode was prepared from the synthesized materials as follows: 15 mg of the fine catalysts and 10 L of Nafion solution were thoroughly dispersed in 3 mL of absolute ethanol to form a homogeneous paste.This paste was then spread on a pre-treated fluorine-doped tin oxide (FTO) (1.0 1.0 cm -2 ) glass and air-dried at room temperature to obtain the working electrodes.The three-electrode system was then immersed in 0.5 M Na 2 SO 4 aqueous solution as the electrolyte. The photocatalytic CO 2 reduction test was carried out in 200 mL of a Pyrex reactor at room temperature.Typically, 50 mg of the prepared catalyst was dispersed in 10 mL of deionized water ultrasonically for 10 min.Then, the dispersion was dried at 80 C for 6 h.Furthermore, the reactor was sealed and purged with nitrogen gas for 30 min. 1 mL of 4 M HCl was then injected to the sidearm of the reactor which contains 85 mg of NaHCO 3 (added to the reactor before sealing) to allow in-situ generation of CO 2 and H 2 O vapor.A 300 W simulated solar light Xe arc lamp (with spectral distribution dominantly from 250 to 1100 nm) was used as the light source and placed 10 cm above the Pyrex reactor.After a certain time of light irradiation, 1 mL of mixed gaseous products was withdrawn from the reactor and analyzed by a gas chromatograph (PGC-80, Changzhou Panna Instrument, China) equipped with a flameionized detector (FID) and methanizer.Isotopic tracer experiments were accomplished on TILON LC-D200M gas chromatography-mass spectrometer following similar procedures.NaH 12 CO 3 and NaH 13 CO 3 were used as sources for 12 CO 2 and 13 CO 2 , respectively."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The phase structure of the prepared Cu 2 O samples and calcination effect on it were investigated by XRD (Fig. 1a).All the fabricated samples show diffraction peaks that match well with cuprite Cu 2 O (JCPDS No. 78-2076) 34,35.Upon calcination, tiny yet distinctive diffraction peaks located at 43.25 and 50.45 emerge.They are ascribed to (111) and (200) planes of copper (JCPDS No. 85-1326).Obviously, these peaks are strengthened with increasing calcination time.The calcination of PVP-capped Cu 2 O octahedrons at 400 C is expected to initiate the decomposition of PVP units with simultaneous deposition of carbon residues at the outer surfaces of Cu 2 O octahedrons.The detailed degradation mechanism of pristine PVP and PVP-capped NPs was studied extensively in the literature with a common conclusion.The disintegration of PVP molecules onto carbon residues consists of amorphous carbon which aggregates over the pristine NPs in case of PVPcapped NPs 363738.In our experiment, Raman analysis was used to confirm the presence of carbon residuals in an amorphous nature as testified by the emergence of D and G characteristic Raman peaks for amorphous carbon at approximately 1350 and 1540-1580 cm -1 , respectively 39 (Fig. 1c).Similar amorphous carbon residues were formed over TiO 2 NPs when PVP-capped TiO 2 was subjected to calcination at 400 C 40. The formation of Cu NPs after calcination could be ascribed to the reduction effect induced by the deposited carbon.The work function of carbon has been reported to be 5 eV 41.Therefore, the Fermi level of carbon locates at about 0.5 V above the potential of a standard hydrogen electrode (SHE).Meanwhile, the standard reduction potentials of Cu /Cu system is 0.52 V vs SHE) 42.Due to the fact that Fermi level of carbon locates in a higher potential position regarding the reduction potential of Cu /Cu couple, electrons will spontaneously move from carbon side (oxidation) to the Cu 2 O SC where they are consumed for Cu (I) ions reduction.The formation of metals on various materials has been reported when a suitable redox reaction is established 303132.With increasing annealing time, more amorphous carbon is attached to the Cu 2 O surface, which induces excessive formation of Cu NPs at the C/Cu 2 O interface as well. Furthermore, the composition of the prepared samples was investigated using Raman spectroscopy.Fig. 1b shows the Raman spectra of Cu 2 O and Cu 2 O-1 samples.Characteristic Raman peaks of Cu 2 O centered at 225, 316, 410, 520 and 620 cm -1 indicated the high quality of the prepared Cu 2 O samples 43,44.Notably, these peaks were significantly intensified after the formation of Cu NPs.Such prodigious enhancement is basically attributed to (i) resonance Raman scattering (RRS) effect induced by Cu NPs 45, (ii) surface-enhanced Raman scattering (SERS) effect 27 and (iii) chemical enhancement (CE) accomplished by charge transfer from Cu NPs to Cu 2 O SC 46.Besides, the shift of all Raman peaks to shorter wavelengths may be a result of residual stress within the lattice of Cu 2 O upon Cu NPs growth as well as heating effect induced by the plasmatic Cu NPs 45. FESEM, EDS, TEM and HRTEM were used to investigate the morphology and microstructures of the obtained Cu 2 O and Cu-Cu 2 O samples.Perfect Cu 2 O octahedrons built by eight 111 isosceles triangles (with base ca. 670 nm and two equal sides ca. 870 nm) with sharp edges and smooth facets are obtained using a facile stabilization-precipitation-reduction method (scheme 1, Figs. 2a and3a).It is believed that the morphology evolution process is accomplished by the aid of PVP as a stabilizing agent favorably adsorbed onto the (111) planes and hence prevents further growth in perpendicular directions 33.The formation of Cu 2 O can be represented as follows 47: (1) (2) (3) Surprisingly, upon calcination, the smooth facets turned rough.Uniform yet tiny Cu NPs grew over the parent Cu 2 O octahedrons surface (scheme 1, Figs. 2b-e, 3b-d and Supporting information Figs.S1 andS2).TEM and HRTEM (Fig. 3b-d) show the distribution of these nanoparticles on the (1 1 1) facets of Cu 2 O octahedrons and their lattice fringes, respectively.Besides, TEM images of the calcined samples (Supporting information, Fig. S2) show that the residual amorphous carbon aggregates in some regions rather than forms a continuous layer over the outer surface of Cu 2 O octahedrons.Therefore, the newly emerged Cu NPs are expected to be in direct contact with the reactant molecules during the photocatalytic CO 2 reduction, which maximizes their roles in enhancing the performance of the entire system. Benefiting from the rational contact between Cu 2 O SC and such amorphous carbon, the electroless formed Cu NPs are rationally coupled with their parent Cu 2 O (supplementary Fig. S1).Such intimate contact between Cu NPs and Cu 2 O is in favor of the PICTT. Homogenous distribution of nearly spherical Cu NPs emerged from Cu 2 O octahedrons after calcination for 1 h (Figs.2b, f, 3b and Supporting information, Figs.S1 andS2).The size of Cu NPs gets enlarged with prolonged calcination time and even almost full-coverage is achieved after 3 h.This result suggests that Cu NPs formed at preliminary stages act as nucleation sites for further growth of Cu nanoclusters.By adjusting the calcination time, the amount and size of Cu NPs can be tuned skillfully.It is worthwhile to mention that controlling the content and size of plasmonic NPs (such as Au, Ag, Cu) allows the manipulation of electronic and optical features of their hybrid nanostructures 19,21,48. Furthermore, a lattice fringe of 0.208 nm corresponds to the (1 1 1) plane of cubic Cu (space group Fm3m, (2 2 5)) 26 which is consistent with XRD results (Fig. 3d).The homogenous distribution of Cu and O elements over the surface of Cu 2 O octahedrons was further confirmed by EDS analysis (Fig. 3e). The chemical composition and states of constituent elements for Cu 2 O and Cu 2 O-3 samples were investigated by the survey and highresolution XPS analysis (Fig. 4).The presence of O and Cu was eventually assured by the emergence of corresponding peaks, i.e.O 1 s, Cu 2p and Cu LMM, respectively (Fig. 4a).The appearance of C 1s is associated with the adventitious carbon in the environment and the thermally-driven carbon 49.The O 1s core-level peak in both samples can be deconvoluted into two peaks (Fig. 4d).For the Cu 2 O sample, these two peaks are at 531.3 and 531.0 eV corresponding to surface oxygen (hydroxyl groups or adsorbed water molecules, O H ) and lattice oxygen (O L ), respectively 50.By contrast, those in Cu 2 O-3 are located at 531.4 and 530.3 eV.The Cu 2p 3/2 peaks were also deconvoluted by similar Gaussian fitting into two peaks i.e. at 934.7 and 933.1 eV for Cu 2 O sample and 934.1 and 932.7 for Cu 2 O-3 sample.The peak at higher binding energy can be indexed to Cu 2 (formed on the sample's surface during the XPS testing) and the other one could be attributed to Cu 0 and/or Cu as they have very close Cu 2p peaks.It is difficult to distinguish based on this peak only 13,17,51.Auger Cu LMM was further used to assign the actual copper species in both samples (Fig. 4c).The Cu species in Cu 2 O sample is ambiguously Cu and that in Cu 2 O-3 sample is indeed Cu 0 as evidenced from their Auger Cu LMM peaks at 570.1 and 569.2, respectively 25,52.The surface-limited range of XPS analysis is reasonable to show only Cu 0 within the Cu 2 O-3 sample because Cu 2 O surface is almost fully covered by Cu NPs after annealing, as indicated by the FESEM results (Fig. 2).It is worth noting that the Cu 2P 3/2 peaks shifted to lower binding energy after the growth of Cu NPs.This result, on one hand, suggests that the effective attractive force from the atomic nucleus is reduced as induced by the high localized electron density over the Cu atoms.This hypothesis is reasonable when considering the electronic structures of both materials.It is reported that the work functions of Cu and Cu 2 O are about 4.65 eV and 4.8 eV, respectively 41,53, which induces electron transfer from Cu metal to Cu 2 O upon their contact.This transfer leads to the formation of a Schottky barrier at their interface.Particularly, the Schottky contact with plasmonic metal NPs provides an efficient channel for fast trapping of plasmon-induced hot charge carriers thus extend their lifetime and hence improve their usage for photo-based conversions 545556.On the other hand, the above results also suggest the strong interaction and rational electronic level coupling between Cu NP and Cu 2 O, which facilitates the charge transfer from the metal to the SC and further The UV-Vis-NIR light absorption of the prepared samples was tested and the results are presented in Fig. 5.The Cu 2 O sample exhibit the characteristic absorption spectrum of Cu 2 O with an absorption edge at 620 nm corresponding to the optical bandgap of E g 2 eV as estimated from Tauc plot (inset of Fig. 5a) 13.After the evolution of Cu NPs, the optical absorption of the prepared samples was drastically improved and even extended to the NIR region.This was ascribed to the LSPR effect of Cu NPs, which act as optical antennas harvesting the incident light efficiently.Importantly, the LSPR absorption peak of plasmonic Cu NP is extremely damped and extended over a wide optical range and even to the NIR region.This phenomenon is universal for plasmonic NPs functionalized by adsorbate molecules where the plasmon excitons would decay through a mechanism called chemical interface damping (CID).This mechanism enables direct charge transfer from plasmonic metal under excitation to strongly coupled energy levels on the adsorbed molecules 1,19,575859.Analogous to this mechanism, plasmonic NPs in contact with a SC with proper band structures could display similar behavior, namely PICTT, providing that strong inter-domain coupling and energy-level-mixing of the metal and SC are established 23,60,61.The damping of the characteristic Cu LSPR peak, as well as the broad and extended absorption spectrum to the NIR region, can be jointly attributed to the strong mixing of Cu and Cu 2 O electronic levels.Such a strong interaction not only activates the PICTT plasmonic decay pathway 23 but also provides new and accessible channels for absorbing the incident light which maximizes the light absorption ability of the whole system. Although the content of Cu NPs increases with the calcination time (as observed from XRD and FESEM results), the trend of DRS change does not follow such increment.The size and shape of the NPs, as well as the dielectric constant of the surrounding medium, generally affect the LSPR response of plasmonic materials in a very complex manner 21.Due to the change in the size and shape of Cu NPs, their LSPR changes accordingly in an erratic pathway and thus the DRS of the whole system also changes. To further confirm the PICTT mechanism, the PL of Cu 2 O octahedrons, physically mixed Cu NPs and Cu 2 O octahedrons (i.e.Cu Cu 2 O) and Cu 2 O-1 samples were measured against different excitation energies lower than the absorption edge of Cu 2 O (2 eV) and the results are depicted in Fig. 5. Notably, the emission spectra of all Cu 2 O samples at each wavelength possess multiple peaks.Firstly, the main peak (MB) represents the recombination of electrons and holes.The electrons are those excited to energy levels corresponding to the excitation wavelength; while the holes are those on the valence band (VB).The nearband emission (NBE) peak attributed to emissions by the recombination of carriers with trapping states locates at lower energy levels.Thirdly, the peak at 828 nm corresponds to intra-band transition in Cu 2 O (Fig. 5b-d andscheme 2b).Generally, with increasing excitation wavelength, the NBE peak in the Cu 2 O-1 sample is bleached along with distinctive enhancement of the peak at 828 nm.Such observations are inconspicuous in the Cu 2 O and physically mixed Cu Cu 2 O samples (Fig. 5c,d).Conceivably, the strong bleaching action of the NBE peak in the Cu 2 O-1 sample is indeed caused by state filling of corresponding energy levels by LSPR electrons directly injected to the Cu 2 O CB from plasmonic Cu NPs under excitation.Furthermore, the pronounced intensification of the 1 e 1 e emission peak (at 828 nm) in the Cu 2 O-1 system is a consequence of more excitons injected to the CB of Cu 2 O, which further relaxed to lower levels 23,62. These results imply that excessively excited LSPR electrons are directly dephasing to the strongly coupled Cu 2 O energy levels with increasing the excitation wavelength.This postulate is based on the fact that the propagation length of the LSPR-like wave is directly varied with the excitation wavelength 63. A longer propagation length of the LSPR-accompanied wave gives rise to extended interference with Cu 2 O energy levels, leading to direct charge transfer (scheme 2a).Such energy overlapping between plasmon-induced electric field wave and Cu 2 O energy levels is the sole pathway for direct hot electron injection (PICTT).The aforementioned results affirm the strong coupling between Cu and Cu 2 O energy levels, which provides accessible channels for successful PICTT transfer. As a proof of concept, the implication of such a unique LSPR decay pathway (i.e.PICTT) on the PR activity of CO 2 over the prepared LSPRactive materials was tested and the results are depicted in Fig. 6.The CO 2 PR activity is recognized by detecting carbon monoxide (CO) and methane (CH 4 ) as the major and minor products, respectively.Despite yielding small amounts of CO and CH 4 as products of CO 2 PR, the detection of these products over Cu 2 O alone reflects its capability to be an active component for CO 2 PR.The emergence of Cu NPs brings prodigiously improved photocatalytic activity.Markedly, 2.2, 1.7 and 1.6 times higher activities are achieved for Cu 2 O-1, Cu 2 O-2 and Cu 2 O-3 than the bare Cu 2 O octahedrons, respectively (Fig. 6a).This enhancement is boosted by the improved light absorption ability and the remarkable decline of PL intensity after Cu NPs formation (Figs. 5a and6e).Besides, this activity enhancement should be attributed to the facilitated charge transfer and separation at the metal/SC Schottky junction 22. When Cu NPs are coupled with the parent Cu 2 O SC, their CO 2 PR activities are in the order of Cu With a larger amount of Cu NPs accumulated on the surface of Cu 2 O following the calcination time, they act as recombination centers for the photogenerated charge carriers.Therefore, it is expected that photocatalysts with a higher content of Cu NPs display a strong recombination rate for charge carriers (strong PL spectra), and this is the case for Cu 2 O-2 and Cu 2 O-3 photocatalysts (Fig. 6e), which explains their declined activity. Table S2 (Supporting information) compares the CO 2 PR activity obtained in this work relevant to state-of-the-art photocatalysts reported within the literature.The data showed in this table indicates the potential of the prepared Cu-Cu 2 O plasmonic photocatalyst as a workable CO 2 PR catalyst. Additionally, the selectivity toward CH 4 is increased after the emergence of Cu NPs.Such selectivity improvement is attributed to the larger adsorption strength of Cu NPs at the surface toward the intermediate CO molecules than the Cu 2 O does 64.The adsorbed CO molecules undergo further photoreduction into CH 4 at the Cu NPs.This result unambiguously suggests that Cu NPs could serve as active sites for the selective reduction of CO 2 . Furthermore, the stability of PR activity of Cu 2 O and Cu 2 O-1 photocatalysts was examined via long-term photocatalytic reactions.The stable activity suggests that Cu 2 O samples can become effective candidates for PR of CO 2 (Fig. 6b).The BET surface area and pore size measurements revealed a larger surface area and pore volume, along with a wider pore-size distribution of the Cu 2 O-1 sample than those of the bare Cu 2 O (Supporting information Fig. S3 and Table S1).In addition, the Cu 2 O-1 photocatalyst exhibited much better adsorption ability for CO 2 molecules (Fig. 6f) enabled by the preferential adsorption of CO 2 at Cu sites 65.All these factors are inevitably accounted for the improved activity of the Cu-Cu 2 O system 66,67. It is worth mentioning that control experiments (without light irradiation and/or CO 2 source) were conducted to assure that CO comes from CO 2 PR.The results demonstrate that no product was detected in the absence of the photocatalyst and/or light illumination.Isotopic labeling experiment was further used to affirm that the C1 products (CO and CH 4 ) are indeed generated from CO 2 PR reaction.The results show a proper matching between the m/z ratio of C1 products and the employed CO 2 (Fig. 6c,d).Meanwhile, molecular oxygen (O 2 ) was also detected in the GC-MS chromatogram as a plausible product of water oxidation by photogenerated holes. To ensure the functions of plasmonic Cu NPs, CO 2 PR activity was investigated under visible-light and almost NIR irradiation by using 420 and 720 nm cut-off filters, respectively.We chose a 720 nm filter to completely exclude the contribution from Cu 2 O and only allow the absorption by plasmonic Cu NPs.Obviously, the activity of Cu 2 O samples under visible-light irradiation is comparable to that under fullspectrum irradiation (Fig. 7a). Surprisingly, the Cu 2 O-1 sample (denoted as Cu-Cu 2 O-C in Fig. 7 to indicate the carbon-based plasmonic Cu system) still displays acceptable CO 2 PR activity even under approaching NIR irradiation while the activity of Cu 2 O is almost vanishing.This phenomenon is attributed to plasmonic Cu NPs, which can absorb incident light with longer wavelengths and hence initiate LSPR excitation.The rational contact and energy levels coupling between Cu NPs and Cu 2 O in Cu-Cu 2 O-C allow the direct injection of hot carriers from Cu to Cu 2 O (PICTT).In fact, other mechanisms could also be used to explain such activity enhancement.Plasmon-induced resonance energy transfer (PIRET) and local field enhancement are two examples.These two mechanisms require the spectral overlap between the plasmonic metals and the SC while the direct contact between them is not mandatory 68,69.Because there is no spectral overlap between the LSPR of Cu NPs and the absorption spectrum of Cu 2 O octahedrons, the contribution of both mechanisms can be ruled out. To assign the real operating plasmonic mechanism, we employed a photodeposition method instead of calcination to deposit Cu NPs at the external surface of Cu 2 O octahedrons where they are prevented from direct contact with Cu 2 O surface.This was realized by means of the preadsorbed PVP moieties during the preparation of Cu 2 O octahedrons (Supporting information, supporting methods; the abbreviation Cu-Cu 2 O-P is used to refer to the photodeposited sample).The morphology and crystal structure of the photodeposited hybrid are given in Supporting information (Supporting information Figs.S4 andS5).Although both samples (Cu-Cu 2 O-C and Cu-Cu 2 O-P) have almost similar crystal structures, their morphologies are quite different.As we discussed in previous sections, as for Cu-Cu 2 O-C, Cu NPs were generated after calcination treatment by carbon-based reduction process, which are inevitably hybridized and merged with its parent Cu 2 O.For the Cu-Cu 2 O-P system, Cu NPs are found to be deposited at the external surface of Cu 2 O octahedrons yet enclosed in PVP residues.A distinctive separating layer is observed between the photodeposited Cu NPs and the Cu 2 O (Supporting information Fig. S4).Such a separation layer prevents the direct contact between plasmonic Cu NPs and Cu 2 O SC thus excludes the possibility of PICTT in such a system. As a confirmation for the PICTT mechanism, the Cu-Cu 2 O-P system exhibits very low CO 2 PR activity compared to Cu-Cu 2 O-C.At such conditions, the PVP separation layer delays the photoexcited hot electrons from being injected into the CB of Cu 2 O. Therefore, PICTT mechanism is not valid, which culminates a sharp drop in the CO 2 PR activity (Fig. 7a).This result further demonstrates the PICTT as the underlying plasmonic mechanism to improve the photocatalytic activity of the prepared Cu-Cu 2 O-C plasmonic system.The DRS spectra of both systems (Cu-Cu2O-C and Cu-Cu2O-P) are also compared (Fig. 7b).The absorption of Cu-Cu 2 O-C system is more intense than that of Cu-Cu 2 O-P.Such improved absorption is a consequence of the unique PICTT mechanism that provides new and accessible channels for absorbing the incident light thus maximizing the light absorption ability of the calcination-based plasmonic copper system.Additionally, the photocurrent response under different excitation windows again demonstrates the ample ability of the Cu-Cu 2 O-C system to induce distinctive photocurrent even under a light with 720 nm benefiting from the unique PICTT.Meanwhile, Cu 2 O and Cu-Cu 2 O-P systems afford very low photocurrent under both full-spectrum and visible-light irradiations.And these responses almost vanish under excitation from light with 720 nm (Fig. 7d,e).All these results confirm the ability of the Cu-Cu 2 O-C system to implement PICTT. Other than the improved light-harvesting ability and charge transfer pathway (i.e.PICTT), other factors could also be accounted for such enhanced activity.Charge transfer kinetics and their recombination rate are vital parameters that greatly affect the performance of photocatalysts 70717273.Therefore, TRPL was employed to explore the charge carrier kinetics and their lifetimes in Cu 2 O systems (Fig. 7c and Table 1).Obviously, the Cu-Cu 2 O-C system displays the slowest emission decay with the longest average lifetime (1 ns, as estimated from the fitting parameters of the TRPL curve).Such electron-hole recombination delay is boosted by the unique interfacial coupling between the two components which enables facile electron transfer and retarded recombination for electron-hole pairs.Since the excitation source used in the TRPL test is a 450 nm laser source, electronic excitation of Cu 2 O will exclusively take place.Benefiting from the rational contact between Cu NPs and Cu 2 O SC in Cu-Cu 2 O-C system (Supporting information, Fig. S1), the photogenerated electrons in Cu 2 O will transfer to Cu NPs while their back movement is prevented by the Schottky barrier at the interface.The transferred electrons at the Cu side away from the photogenerated holes are supposed to have longer lifetime and greater chances to participate in the CO 2 PR reaction.The EIS measurements (Fig. 7f) also predict similar performance improvement for the Cu-Cu2O-C system, where a smaller semicircle diameter at a higher frequency is a direct reflection of the smaller charge transfer resistance. The CO 2 PR pathway over Cu-Cu 2 O-C plasmonic photocatalyst is further analyzed using in-situ DRIFTS measurements under darkness (Fig. 8b-d) and illumination (Fig. 8e-g).No distinctive absorption peaks can be detected in the absence of CO 2 and H 2 O (Fig. 8a), revealing that the observed products are indeed generated from CO 2 PR in the presence of water.After the introduction of CO 2 and H 2 O into the reaction chamber, progressively increased absorption peaks are attributed to bicarbonate species (HCO 3 -) generated from adsorption of CO 2 molecules.After switching to light condition, distinguishable peaks indexed to formate (HCOO -) as intermediate species emerged in the DRIFTS spectrum.CO as the main product from CO 2 PR over Cu-Cu 2 O-C catalyst was also observed with two characteristic and time-enhanced peaks at 1619 and 2250 cm -1 .CH 4 is not detected owing to its nonpolar feature 72. Based on the aforementioned results and discussions, the PR mechanism of CO 2 over the prepared Cu-Cu 2 O-C system can be drawn as in Fig. 9. On one hand, under rough NIR irradiation ( 720 nm, thus only excitation of Cu NPs-LSPR will occur), the initiation of Cu-LSPR excitation induces the direct transition of hot electrons from Cu-donor levels to acceptor levels in Cu 2 O through PICTT mechanism.The hot electrons injected to the Cu 2 O side are inevitably consumed for CO 2 PR while photogenerated hot holes at plasmonic Cu NPs are used to participate in water oxidation (Fig. 9b).Such a PICTT mechanism, which efficiently transfers hot electrons without significant energy loss, can be a fruitful protocol for designing other artificial photosynthesis systems. On the other hand, when the incident light has an energy equal to or larger than the bandgap of Cu 2 O SC, electrons at the VB of Cu 2 O are excited to the CB and then migrate preferentially toward Cu NP side.This electron transfer is boosted by both the strong interface junction established at Cu 2 O (as a p-type semiconductor with work function 4.8 eV 74) and metallic Cu NPs (with work function 4.65 eV 41) (Supporting information, Fig. S1) and the rational coupling and energy-state-mixing between Cu and Cu 2 O.The accumulated electrons at the metallic side are prevented from back transfer to the SC side by the Schottky junction established at the interface since the contact is a Schottky contact (the work function of Cu metal is smaller than that of Cu 2 O p-type SC).These electrons that rationally separated from the photogenerated holes have a great opportunity to be consumed for CO 2 reduction.The photogenerated holes at the Cu 2 O VB are used for water oxidation (Fig. 9a).We believe that both mechanisms could occur in plamonic Cu-Cu 2 O system under full spectrum or visible light ( 420 nm) irradiation and the dominant mechanism under such conditions would be the subject of further investigation."
  },
  {
    "title": "Conclusions",
    "content": "In this study, we developed an electroless reduction method to fabricate plasmonic Cu-Cu 2 O octahedrons.This strategy relies on the reduction of Cu ions by the attached carbon moieties at the Cu 2 O surface thus allows for the direct growth of Cu NPs.The energy level coupling s of Cu and Cu 2 O supports the direct hot-electron transfer mechanism i.e.PICTT from plasmonic Cu NPs to Cu 2 O.Such a charge transfer pathway prompts an enhanced CO 2 PR activity under approximate NIR irradiation.We believe that the developed method can be applied to design other metal/metal oxide plasmonic hybrids with fullspectrum light utilization for advanced photocatalytic applications and beyond. Fig. 1.Structure of Cu 2 O catalysts.(a) XRD patterns of all the prepared samples and (b, c) Raman analysis of Cu 2 O and Cu 2 O-1 samples. Fig. 3. (a) TEM image of Cu 2 O, (b-d) TEM and HRTEM images of Cu 2 O -1 and (e) EDS mapping of Cu 2 O sample. Fig. 4. (a) XPS survey spectra of Cu 2 O and Cu 2 O-3 samples, (b-d) high-resolution XPS spectra of (b) Cu 2p 3/2 , (c) Cu LMM and (d) O1s for both samples. Fig. 5. (a) DRS spectra of all prepared samples with inset represents the Tauc plots; PL spectra of under different excitation wavelength ( 620 nm) for (b) Cu 2 O-1, (c) physical mixture of Cu NPs and Cu 2 O and (d) bare Cu 2 O. Scheme 2. (a) Schematic illustration showing the increment of propagation length of the LSPR-related waves with the excitation wavelength and (b) scheme represents possible LSPR-induced hot electron injection mechanism and decay pathways. Fig. 6.(a) Photocatalytic CO 2 reduction-products over Cu 2 O samples, (b) long-term CO 2 PR activity of Cu 2 O and Cu 2 O-1 samples, (c) GC-MS patterns of CH 4 and (d) CO together with O 2 (as the oxidation product) over Cu 2 O-1 sample using 12 CO 2 and 13 CO 2 as the carbon source, (e) PL spectra of the prepared Cu 2 O samples and (f) CO 2 adsorption isotherms over Cu 2 O and Cu 2 O-1 samples. Fig. 7. Different characterization test results for Cu 2 O, Cu-Cu 2 O-C and Cu-Cu 2 O-P samples include (a) CO 2 PR activity under different irradiation wavelengths, (b) DRS spectra, (c) TRPL spectra, I-t curves under (d) full-spectrum and 420 nm and (e) 720 nm; (f) EIS measurements. Fig. 8. In-situ DRIFTS results for Cu-Cu 2 O-C sample under dark after 0 (a), 10 (b), 30 (c) and 60 min (d); and light illumination for 10 (e), 30 (f) and 60 min (g). Fig. 9. Photogenerated charge carrier pathways and CO 2 reduction mechanism over Cu-Cu 2 O system under (a) excitation of Cu 2 O SC (b) excitation of Cu LSPR. Fitting parameters for TRPL curves recorded for Cu 2 O, Cu-Cu 2 O-C and Cu-Cu 2 O-P samples. This work was supported by National Key Research and Development Program of China (2018YFB1502001), National Natural Science Foundation of China (51872220, 51932007, 51961135303, 21871217, U1905215 and U1705251), and the Fundamental Research Funds for the Central Universities (WUT: 2019IVB050). The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https:// doi.org/10.1016/j.cej.2020.125390."
  }
]