[
  {
    "title": "Doi",
    "content": "10.1016/j.jpcs.2020.109917"
  },
  {
    "title": "Article_Title",
    "content": "Ternary ZnO/CuO/Zeolite composite obtained from volcanic ash for photocatalytic CO2 reduction and H2O decomposition"
  },
  {
    "title": "Abstract",
    "content": "An n-p heterojunction based on ZnO/CuO supported in a zeolitic framework (ZF) was designed to produce solar fuels from H 2 O decomposition and CO 2 conversion.ZF was synthesized from volcanic ashes by an alternative microwave-hydrothermal method using a biodegradable template for its formation.The framework resulted in NaAlSiO 4 (NAS) with a high surface area and a morphology composed of circular channels of 50 nm.Incorporating the ZnO/CuO heterostructure in the NAS channels resulted in an improved light-absorption, more efficient charge transfer, nanostructure morphology, and more active sites available for the CO 2 adsorption and photocatalytic reactions.The activities for H 2 and light-hydrocarbons (HCOOH, HCOH, and CH 3 OH) evolution were evaluated in the photocatalytic water-splitting and CO 2 reduction under UVA irradiation, respectively.The ZnO/ CuO/NAS composite exhibited a remarkably higher H 2 (187 mol/g) and HCOOH (2721 mol/g) evolution after 3 h of irradiation.These results were related to the synergistic effect among ZnO, CuO, and NAS framework.A mechanism of the photocatalytic reaction was proposed."
  },
  {
    "title": "Experimental",
    "content": "ZnO/CuO heterostructures were synthesized by a one-pot microwave-hydrothermal method.The method implies the dissolution of 0.01 mol of Zn(CH 3 CO 2 ) 2 2H 2 O (Aldrich, 99) in 50 mL of methanol (Aldrich, 99).Then, stoichiometric amounts of Cu(CH 3 CO 2 ) 2 H 2 O (Aldrich, 99) were added to the formation ZnO/CuO heterostructures with 5 wt of CuO.After that, 1 g of NaOH (Fermont, 99) was added to the mixture under stirring.The resulting mixture was exposed to microwave-hydrothermal heating in a reactor model Mars 6, with the following conditions: 100 W, 100 C, and 1 h.The resulting samples were washed with distilled water and methanol to remove the byproducts generated during the synthesis. The volcanic ashes (VAs) were taken from the Colima volcano.In the first stage, VAs were mixed with pellets of NaOH (Fermont, 99) in a weight ratio of 1:1.2 in an agate mortar to promote its alkali fusion and the extraction of the water-soluble sources of Si and Al.Then, VAs were calcined at 550 C for 2 h in air using a ramp of 10 C/min.After the heat treatment time elapsed, the sample obtained was mixed with distilled water and left it to age overnight.The powders were separated from the solvent by centrifugation, and they were dried at 100 C. Once dried, 1 g of the product was mixed with 50 mL of distilled water and sodium citrate (Na 3 C 6 H 5 O 7 , Fermont 99) as a biodegradable template at pH 8. Finally, the sample was calcined at 550 C for 2 h.This sample was labeled as NAS. The impregnation of the heterojunction n-p ZnO/CuO on NAS was carried out by microwave-hydrothermal.For this purpose, 1 g of each material was mixed in an aqueous solution, and then it was exposed to microwave irradiation (100 W) for 30 min at 100 C.After treatment, the samples were washed with distilled water and dried at 100 C overnight.The sample was identified as ZnO/CuO/NAS.In this case, the 50/50 wt ratio of ZnO/CuO and NAS was used since it presents the highest photocatalytic activity for H 2 evolution, as will be further discussed. To clarify each step of the synthesis, Fig. S1 shows a schematic representation of the ZnO/CuO/NAS composite fabrication. X-ray powder diffraction was used to perform the structural char- acterization in a Bruker D8 Advance diffractometer with Cu K radiation (40 kV, 30 mA).The analysis was made using a scan rate of 0.05 by 0.5 s.Crystallite size was obtained using the Debye's-Scherrer equation ( 1): Where D is the crystallite size, K is the shape factor (0.94), is the wavelength of Cuk radiation, and hkl is the instrument broadening, which it was calculated by using equation (2).In this case, we used the Al 2 O 3 corundum as reference. The chemical composition of the volcanic ash was investigated by Xray fluorescence (XRF) using a Panalytical Epsilon Energy Dispersive Fluorescence equipment.Scanning electron microscopy (SEM) was used to study the morphology of the samples in a JEOL 6490 LV microscope.The surface area of the samples was calculated from N 2 adsorptiondesorption isotherms obtained in a Bel-Japan Minisorp II analyzer at -196 C. The band gap of the samples was calculated from the diffuse reflectance spectra obtained in a UV-Vis NIR spectrophotometer (Cary 5000) coupled with an integration sphere.The band gap energy was calculated using the Kubelka-Munk function, considering a direct transfer of charge in the samples.Photoluminescence analysis was performed in a fluorescence spectrophotometer Cary Eclipse integrated with a Xenon flash lamp at 25 C. The samples were excited at 290 nm, using a scanning speed of 600 nm/min, and an excitation width and emission slit of 10 nm. The production of solar fuels was carried out in the experimental setup shown in Fig. 2. The set-up consisted of three main parts: i) the photocatalytic reactor, ii) chromatographs for the quantification of reaction products, and iii) peripheral equipment (mass flow control, valves, manometer, moisture trap).The photocatalytic reactor was constructed of borosilicate glass of 0.25 L. All the tests were evaluated at 25 C. For the experiments, 0.1 g of the photocatalyst was suspended in distilled water under magnetic stirring.The reactor was purged with N 2 (99.9) for H 2 evolution and with CO 2 (99.9) for HCOOH production, respectively.The suspension was irradiated with two halogen lamps of 20 W with an irradiance of 8 W/m 2 .The products generated were identified as follows: H 2 in a gas chromatograph Shimadzu GC-2014 equipped with a thermal conductivity detector (TCD), while HCOH and HCOOH were measured with an HPLC model Prominence-i LC2030C 3D, Shimadzu equipped with a Shimadzu C18 column using 25 L of the sample.The quantification of formic acid by this technique required a mobile phase based on H 2 SO 4 0.005 M-acetonitrile 80:20 v/v ( 210 nm).For formaldehyde measurement, the sample was mixed with 2,4-dinitrophenylhydrazine and phosphoric acid for a complex formation ( 360 nm).In this case, a mixture of acetonitrile-water 45:55 v/v was used as a mobile phase.On the other hand, CH 3 OH was identified by a complexometric method with sodium nitroprusside in a UV-Vis spectrophotometer Cary 5000 at 481 nm."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The crystal structure of the pristine and synthesized materials was investigated by X-ray powder diffraction.Fig. S2 shows the diffractograms of VAs and NAS samples.Pristine ashes (VAs) crystallized in the triclinic system associated with the presence of albite (NaAlSi 3 O 8 , JCPDS card no.83-1608) as only crystal phase.NAS sample exhibited a cubic zeolite NaAlSiO 4 structure according to the JCPDS card no.11-0221.Also, the presence of traces of albite was identified at 2 13.6,22.8, 28.2, 29.1, 31.7, and 45.4 .The crystallite size of the VAs and NAS samples was 52 and 43 nm, respectively. The X-ray diffraction patterns of ZnO, CuO, and the heterostructure between them are shown in Fig. 3. Bare-ZnO was obtained in pure form according to the JCPDS card of the polymorph hexagonal No. 36-1451.The diffractogram of the ZnO/CuO heterostructure did not show reflections associated with CuO; however, its crystallite size was larger (29 nm) concerning ZnO (18 nm).In the diffractogram of the ternary composite was possible to identify crystalline phases related to ZnO, NaAlSiO 4 , and traces of NaAlSi 3 O 8 .These two phases are related to the NAS sample, as it is shown in Fig. S2.The crystallite size of the ternary composite was 15 nm, as it is shown in Table 1. Also, the investigation of the chemical composition of the pristine Fig. 2. Set-up system used for the photocatalytic experiments.Fig. 3. Diffractograms of the as-prepared samples. volcanic ash was characterized by XRF.The composition of the VA sample is shown in Table S1.SiO 2 , Na 2 O, and Al 2 O 3 were identified as principal oxides.Other compounds such as CaO, Fe 2 O 3 , and traces of K 2 O, MgO, and TiO 2 were detected.SiO 2 /Al 2 O 3 ratio is important to predict the formation of zeolites from different by-products, i.e., fly ash or volcanic ash.A SiO 2 /Al 2 O 3 higher than 2 favors the formation of zeolitic structures 34.Thus, according to the XRF characterization, VAs has a SiO 2 /Al 2 O 3 ratio of 8, high enough to promote the formation of zeolitic structures under an adequate alkali activation. For reference purposes, the morphology of the volcanic ash is presented in Supplementary Fig. S3.VAs exhibited heterogeneous morphology composed of big particles (50 m) with a rough surface.SEM micrographs of the as-prepared samples are shown in Fig. 4. The morphology of the NAS sample was composed of flake-particles interconnected among them (Fig. 4a).Also, this sample exhibited notably circular channels of diameter around 50 nm.Bare-ZnO particles showed a homogeneous morphology composed of uniformly distributed spherical particles (50 nm), as it can be seen in Fig. 4b.The incorporation of CuO into ZnO resulted in the formation of bigger and more irregular particles than the reference (Fig. 4c andd).It was possible to distinguish CuO on the surface of ZnO as clusters of 1 m in the ZnO/CuO sample by EDS elemental mappings (Fig. S4).The ternary composite morphology resulted in seed-like particles of an average size of 200 nm distributed homogeneously (Fig. 4e).A closer view of these particles evidenced their roughness, as it is shown in Fig. 4f.These results indicate the feasibility of the microwave-hydrothermal method to fabricate nanostructures with homogeneous morphology from earth-natural sources. UV-Vis diffuse reflectance spectroscopy was used to investigate the optical properties of the synthesized samples, as shown in Fig. 5. Bare-ZnO exhibited the characteristic band edge of the wurtzite, corresponding with a band gap energy of 3.1 eV.The optical absorption edge shifted from blue to red in the ZnO/CuO and ZnO/CuO/NAS samples due to the CuO absorption in the visible range (1.4 eV), as it is shown in Fig. 5.An increase in the absorption light-capacity of the samples was observed, mainly in the ZnO/CuO/NAS sample.This effect could be attributed to the light scattering in the porous structure, leading to a more extended pathway of light for its further utilization 35.Fig. 5 also shows the emission spectra of the lamp used as irradiation source for the photocatalytic experiments.As it can be seen, the main emission peak of the lamp corresponds to the absorption edge of the samples.Also, the lamp shows two more emissions at 3.1 and 2.8 eV, which energy can be absorbed by the ZnO/CuO and ZnO/CuO/NAS to promote the generation of the electron and hole pair. To investigate the effect of the n-p heterojunction formation on the emission characteristic of ZnO, photoluminescence spectra were recorded.Fig. 6 shows the emission spectra of ZnO, ZnO/CuO, and ZnO/CuO/ NAS.The spectra of the samples exhibit a defined peak at 390 nm.This emission (3.2 eV) is ascribed to near-band emissions due to the excitonic shift from localized regions below the conduction band to the bottom of the valence band 36.This emission is usually related to the free charge carriers' recombination through an exciton-exciton collision process 37.As can be seen, the intensity of emission at 390 nm decreases after the formation of the n-p heterojunction.This effect was more notable in the ternary composite ZnO/CuO/NAS, which evidences an enhancement in the charge transfer in the material fabricated.It is also important to note that no emission in the visible-light was observed in the PL spectra. Fig. 7 shows the N 2 isotherms of the synthesized samples.The NAS sample exhibited combined type-I and IV isotherms, as well as type H4 hysteresis loop.On the other hand, ZnO and the n-p heterostructure showed a type-II profile related to macroporous samples.When the heterostructure was supported on the NAS sample, the samples showed a mixed profile related to meso-macroporous materials (type-IV), which indicates the presence of porosity in the ternary composite.This property was evidenced by the hysteresis in the interval 0.75-0.95 of P/P 0 , as shown in Fig. 7a.Barrett-Joyner-Halenda (BJH) method was performed to evidence the pore size distribution in the NAS and ternary composite, which results were included in Fig. 7b.The average pore radius of NAS sample was 1.8 nm, while the ternary composite exhibited a similar value (1.6 nm).These results were slightly higher than previous reports for nanostructured zeolites 38,39. The specific surface area values of the samples are listed in Table 1.NAS sample exhibited the highest surface area (121 m 2 /g), which provide a high number of active sites for the photocatalytic reaction. The ternary composite ZnO/CuO/NAS synthesized exhibited higher surface area (52 m 2 /g) in comparison with bare-ZnO and the ZnO/CuO heterostructure, which evidences the synergy effect among the compounds investigated. a) Hydrogen production Fig. 8 shows the hydrogen evolution using the as-prepared and the reference samples under UV light.As it can be seen, the highest photocatalytic activity of the as-prepared samples was obtained with the ternary composite.After 3 h, 187 mol/g of hydrogen were generated, whereas with the n-p heterojunction ZnO/CuO only 50 mol/g of H 2 were detected.These results indicated that the photocatalytic performance for H 2 production with the ZnO/CuO/NAS was 3.7 and 18 times higher than those ZnO/CuO and ZnO samples, respectively.The high photocatalytic efficiency of the ZnO/CuO/NAS composite was associated to the combination of its physicochemical properties such as both high porosity and surface area, enhanced light absorption, and a lower recombination of the photogenerated electron and hole pair. For reference purpose, the activity of NAS and VAs was evaluated under the same experimental conditions, which results are shown as input image in Fig. 8.The reference samples showed a low photocatalytic activity (1 mol/g). On the other hand, the effect of different amounts of NAS in the ternary composite was studied for H 2 evolution in Fig. S5.According to the results, the composite with low (x 0.3) and high (x 0.8) amounts of NAS did not favor higher yields of H 2 production regarding the reference sample (x 0.5).These results could be attributed to the following reasons: I. Low loads of NAS did not contribute significantly with active sites to carry out the photocatalytic reaction.However, the efficiency of H 2 evolution was 1.9 times higher than the ZnO/CuO heterostructure. II. High amounts of NAS (x 0.8) in the composite did not favor the H 2 production since the zeolitic framework does not have photocatalytic activity.In this scenario, it is necessary to add more ZnO/CuO photocatalyst to carry out the H 2 O reduction. Thus, the ternary composite with half of the zeolitic support was chosen for CO 2 reduction experiments. The references and the as-prepared samples were evaluated as photocatalyst in the CO 2 reduction in the liquid phase to produce HCOOH, HCOH, and CH 3 OH formation, as it is shown in Fig. 9. HCOOH was the main product of the CO 2 reduction, while HCOH and CH 3 OH were detected in minor amounts.The ZnO/CuO/NAS composite exhibited remarkably photocatalytic activity compared with the reference samples for HCOOH production, reaching a production up to 2721 mol/g in 3 h.This efficiency was 3.8 times higher than that of the heterojunction ZnO/CuO, and up to 500 times higher than the reference ZnO.Regarding to HCOH and CH 3 OH production, the photocatalytic efficiency of the ternary composite was also higher than those of the ZnO/ CuO and ZnO samples, as it can be seen in Fig. 9b. The higher production of HCOOH compared to that of HCOH and CH 3 OH can be related to kinetic aspects.Equations ( 3)- (6) show the reactions and products of the H 2 O decomposition and CO 2 reduction.As it can be seen, HCOOH and H 2 production is kinetic favored since only two electrons and protons are required for their formation (equations ( 3) and ( 4)), in spite of its higher thermodynamic potential (-0.61 V).In contrast, the formation of HCOH and CH 3 OH required 4 and 6 electrons and protons, respectively at lower potentials (equations ( 5) and ( 6)) at pH 7 40. Fig. 6.Room temperature photoluminescence emission spectra of the asprepared samples. ) The improved photocatalytic performance of the ZnO/CuO/NAS composite in the CO 2 reduction can be associated to a more efficient charge transfer among the components, enhanced light-absorption, and a higher surface area that contributes to the fixation of CO 2 .The improvement in the CO 2 adsorption could be attributed to the presence of the zeolite.Particularly, the excellent capacity (1.4 mmol/g) of NaAlSiO 4 for CO 2 adsorption was evidenced under similar experimental conditions (P CO2 0.15 bar, T 40 C) by Bae et al. 41.Thus, this factor could be critical to assure high efficiencies for HCOOH production.Once the CO 2 is adsorbed on the surface of photocatalyst is necessary to provide an enough number of electrons and protons to carry out is conversion to light-hydrocarbons.In this context, the strategy of supporting the n-p ZnO/CuO heterojunction on the zeolite also favored the charge transfer and delay the recombination of the electrons and holes, as it was evidenced by PL analysis.This effect could be related to the synergistic effect created at the interface of the n-p heterojunction and the pore walls of the NAS sample.Furthermore, the presence of Al 3 ions in the NAS sample exhibits a Lewis acidity 4243444546, which provides unoccupied orbital as an electron trap.This Lewis acid site improves the separation efficiency of photogenerated charges.The photocatalytic mechanism proposed is shown in Fig. 10.In this mechanism, ZnO is excited with UV light with the promotion of an electron from the valence band (VB) to the conduction band (CB) of this semiconductor.Then, the electrons can be transferred to the CB of CuO, which interacts with the water molecules to produce H 2 or react with the adsorbed CO 2 molecule to produce mainly formic acid.Additionally, the NAS support provides Lewis acid site (marked as squares) to trap the photogenerated electrons that can be reacted with the CO 2 adsorbed on the support. The production of formic acid in this work using the ZnO/CuO/NAS composite was notably high (2.7 mmol/g) and competitive with previous works 11121314.Also, the ternary composited proposed produced solar fuels with high efficiencies without sacrificial agents at near ambient conditions.These results are important since both solar fuels (H 2 /HCOOH) generated can be used as chemical feedstock in many industrial process.Nowadays, these solar fuels are produced in the industry using coal and natural gas as raw materials, which makes the actual process high polluting.Thus, the design of new and advanced photocatalytic materials such as ZnO/CuO/NAS with high efficiencies to obtain clean and renewable solar fuels is vital to migrate to cleaner technologies to supply energy needs."
  },
  {
    "title": "Conclusions",
    "content": "Ternary ZnO/CuO/NAS composite was designed to act as an efficient catalyst to produce value-added compounds such as hydrogen and lighthydrocarbons from water splitting and CO 2 reduction, respectively.The composite was synthesized by a two-step route of preparation of NiAl-SiO 4 (NAS) from volcanic ash and assembly of the n-p heterojunction based on ZnO/CuO inside of NAS.SEM analysis evidenced that ZnO/ CuO nanoparticles were embedded in the circular channels of the NAS framework.This closer contact favored in the composite an increase of the surface area light-absorption, and a more efficient charge transfer. ZnO/CuO/NAS composite showed remarkably photocatalytic activity for H 2 (187 mol/g) and HCOOH (2721 mol/g) evolution under UVA irradiation deriving from the synergistic effect among ZnO, CuO, and the porous zeolitic support (NAS).The presented results afford a highly promising alternative for obtaining efficient and low-cost photocatalysts to migrate to renewable energy sources under sunlight. CRediT authorship contribution statement E. Luevano-Hipolito: Methodology, Formal analysis, Funding acquisition, Supervision, conceived of the present idea.proposed the utilization of volcanic ashes to fabricate inorganic framework to support Cu2O.verified the analytical methods and supervised the findings of this work.Leticia M. Torres-Martinez: Funding acquisition, Supervision, conceived of the present idea.proposed the use of the material for CO2 utilization to produce solar fuels such as formic acid.erified the analytical methods and supervised the findings of this work.A. Fernandez-Trujillo: Funding acquisition, Supervision, synthesized the materials and performed the evaluation for hydrogen evolution.verified the analytical methods and supervised the findings of this work.All authors discussed the results and contributed to the final manuscript. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Fig. 1.Colima volcano located at 19.5 N and 103.5W in Mexico. Fig. 4. SEM micrographs of a. NAS, b.ZnO, c-d.ZnO/CuO, and e-f.ZnO/CuO/NAS samples. Fig. 5. Kubelka-Munk diffuse reflectance spectra of synthesized samples and the emission of the halogen lamp. Fig. 7. a. N 2 isotherms of the synthesized samples and b.BJH pore size distribution of porous samples. Fig. 8. Photocatalytic H 2 evolution from H 2 O decomposition using the as-prepared and reference samples.Input image: H 2 evolution of reference materials. Fig. 9. Solar fuels generation via CO 2 reduction: a. HCOOH and b.HCOH/CH 3 OH production. Fig. 10.Photocatalytic mechanism proposed for solar fuels production with the ZnO/CuO/NAS composite. Summary of the physicochemical properties of the samples. E. Luevano-Hipolito et al. The authors wish to thank CONACYT for financial support for this research through the following projects: Catedras CONACYT 1060 and CONACYT-FC-1725.Also, the authors want to thank Programa Delfin for its support for the scholarship to A. Fernandez-Trujillo.In addition, the authors want to thank to Nayely Pineda Aguilar from CIMAV for her help with the SEM characterization. Supplementary data to this article can be found online at https://doi. org/10.1016/j.jpcs.2020.109917."
  }
]