[
  {
    "title": "Doi",
    "content": "10.1021/acscatal.8b02372"
  },
  {
    "title": "Article_Title",
    "content": "Synergy between Defects, Photoexcited Electrons, and Supported Single Atom Catalysts for CO<sub>2</sub> Reduction"
  },
  {
    "title": "Abstract",
    "content": "Dispersed atomic catalysts can achieve high catalytic efficiency and have the potential to enable chemical transformation of inert molecules like CO 2 .The effect of surface defects on photocatalytic reduction of CO 2 using supported single atom catalysts however requires clarification.Using density functional theory and experimental techniques, we have investigated the role of surface oxygen vacancies (O v ) and photoexcited electrons on supported single atom Cu catalysts and CO 2 reduction.Adsorption of Cu was strong to the TiO 2 surface, and charges of the Cu atoms was highly dependent on whether surface defects were present.Cu atoms with O v aided in the adsorption of activated bent CO 2 , which is key to CO 2 reduction.Our results also show that CO 2 dissociation (CO 2 CO O), which is a proposed initial step of CO 2 reduction to hydrocarbon products, occurs very readily for a single Cu atom in an O v , with barriers 0.19 eV.Such low barriers do not occur with Cu over a stoichiometric surface.Furthermore, the presence of a photoexcited electron leads to a substantial increase in reaction rate for Cu over a stoichiometric surface; the Cu/TiO 2 surface is largely inert in the absence of photoexcited electrons.Experimental results corroborate these theoretical calculations and show that activation of CO 2 occurs most readily for TiO 2 catalysts with dispersed Cu and O v .CO 2 photoreduction also occurs most readily for TiO 2 catalysts with dispersed Cu and O v , compared to TiO 2 or Cu over stoichiometric TiO 2 catalysts.We also modeled atomic Pt to understand how metals besides Cu may behave.We found that Pt over TiO 2 also activates CO 2 but that dissociation of CO 2 over Pt with O v does not occur as readily as for Cu with O v .Our results show that tailoring TiO 2 surfaces with defects in conjunction with specific atomic catalysts like Cu may lead to fast desirable photoreduction of CO 2 ."
  },
  {
    "title": "Experimental",
    "content": "P25 TiO 2 was obtained from Evonik and used as received.Cu/TiO 2 was synthesized via surface adsorption.In a typical synthesis, 500 mg of dried TiO 2 was dispersed in 75 mL Milli-Q water and sonicated for 10 minutes.100 mg of CuCl 2 (Sigma-Aldrich, 99.995) was then added to the TiO 2 suspension under constant stirring.The resulting mixture was stirred at room temperature for 12 hours before Cu/TiO 2 was recovered via centrifugation and was washed with Milli-Q water for three times.The Cu/TiO 2 sample was then dried at 90 o C for 2 hours. Thermal treatment of powder samples was conducted in a Harrick Praying Mantis diffuse reflectance accessory in a Thermo Nicolet 6700 FTIR spectrometer.A small amount of TiO 2 or Cu/TiO 2 was placed in the sample holder of the accessory, purged with Ar at room temperature, and then annealed at 300 o C for 1 hour under 5 H 2 (95 Ar) or O 2 prior to further CO 2 adsorption and photochemical studies. The synthesized Cu/TiO 2 sample was examined using transmission electron microscopy (TEM, Zeiss/LEO 922 Omega).The loading of Cu on TiO 2 was quantified using a Varian Vista AX induced coupled plasma atomic emission spectrometer.X-ray photoelectron spectroscopy (XPS) analysis was conducted on a PHI5600 system. 84UV-visible spectra of powder samples were obtained on a Cary 50 Bio spectrophotometer.A Barrelino diffuse reflectance probe was used to collect UV-visible spectra of powder samples using BaSO 4 as a standard.For studies with XPS and UV-visible spectroscopy, thermal treatment was carried out in a STF 1200 tube furnace at 300 o C under 5 H 2 (95 Ar) or O 2 ."
  },
  {
    "title": "Results_and_Discussion",
    "content": "We first modeled a Cu atom adsorbed over stoichiometric and reduced (101) surfaces, as summarized in Figure 2. We considered several different initial sites, as discussed in the Supporting Information, but the most stable sites are shown.Over the stoichiometric surface the Cu atom preferred a bridge geometry between two O 2c atoms, similar to previous work, 53,58,63 with Cu-O 2c distances of 1.88 A.The adsorption energy for a Cu atom over the stoichiometric surface (-2.30eV) agreed very well with the work by Seriani et al. (-2.30eV) 53 and Alghannam et al. (-2.26 eV). 58The calculated charge of the adsorbed Cu atom over the stoichiometric surface (0.5) was also in agreement with the work of Alghannam et al. (0.64). 58We tested the effect of U correction on the adsorption energy of Cu (-2.59 eV without U correction and -2.30 eV with U correction), and it agreed with our previously reported value (-2.56 eV without U correction). 63or a surface with an oxygen vacancy, we found three stable adsorption modes: Cu in the vacancy, near the vacancy, and far from the vacancy (Figures 2b-d).Several initial sites were modeled, as discussed in the Supporting Information.Previous results on metal atom adsorption over reduced TiO 2 surfaces with other transition metals, such as Pt and Au, 49,50,85 were used to help guide our choice of Cu adsorption sites.We found the most stable adsorption site over the reduced surface occurred when Cu filled the oxygen vacancy (Figure 2b), with an adsorption energy of -2.23 eV.A slightly lower adsorption energy (-2.12 eV) was found when the Cu atom adsorbed near the vacancy but did not completely occupy it (Figure 2c).When the Cu atom was far from the oxygen vacancy, it interacted with the surface in a similar manner as with the stoichiometric surface (Figure 2d), giving a comparable adsorption energy (-2.26 eV).Our results show that the Cu atoms became positively charged when interacting with O 2c atoms (stoichiometric and far from the oxygen vacancy) but negatively charged when in or near the oxygen vacancy.The region around the vacancy is negatively charged due to unpaired electrons left in the surface on nearby Ti atoms upon O removal, and the surface donates this charge to the adsorbed Cu atom.Negative metal atoms adsorbed in an O v have been reported previously, 50,57,86 as well as negative copper clusters. 87All adsorption energies were close to each other (-2.12 to -2.30 eV), indicating that all geometries could occur upon Cu adsorption over TiO 2 and may be catalytically relevant.We thus considered all four geometries when modeling CO 2 adsorption and reduction over Cu/TiO 2 surfaces. Our surface model (lone Cu atoms on the TiO 2 surface) is commensurate with the Cu/TiO 2 materials synthesized in our experiments.We have shown in previous work 62 that atomic Cu species can be deposited on the TiO 2 surface, giving catalysts with CO 2 photocatalytic activity.In other work, 63 we demonstrated Cu dimer formation is an endothermic process, which would limit the growth of single Cu atoms.Furthermore, we showed that Cu atoms have high diffusion barriers on the TiO 2 surface, which may also limit the formation of dimers and larger clusters. 63The thermodynamic and kinetic limitations for dimer formation favor single Cu atoms on the surface. In Figure 3 is shown the density of states (DOS) for Cu adsorbed on the various surfaces.DOS for the stoichiometric (Figure 3a) and reduced TiO 2 surfaces (Figure 3b) are also given for comparison.A gap state for a surface with O v was observed due to electrons localizing on Ti atoms, and is a well-known phenomenon.For Cu over TiO 2 (Figure 3c), a gap state created by Cu was also observed.Similar gap states have been seen by other authors. 57,59For instance, Yang et al. 59 observed gap states for Ag (one row below Cu) clusters in O v to be near -1.2 eV and -1.8 eV below the edge of the conduction band. For Cu in an O v a similar gap state due to Cu occurs (near -1.5 eV), but there is also a gap state on TiO for TiO 2 was found to be 4.43 eV, similar to the value by Cheng et al. (4.34 eV). 36However, we calculated the O v formation energy in the presence of Cu (or starting with a Cu/TiO 2 surface) to be between 4.47 and 4.61 eV, depending on whether the Cu atom in the final state was in the O v , near the O v , or far from the O v .These energies indicate that Cu is not likely to help increase the number of O v .Rather O v on the surface could form by other means, such as annealing, 89 doping, 90 other treatments, 91,92 or synthesis conditions. 93e modeled CO 2 adsorption over the various TiO 2 and Cu/TiO 2 surfaces.Formation of bent CO 2 is a key step in CO 2 activation in order to further reduce the molecule. 37,94Linear CO 2 is inert and resistant to reactivity.We have summarized results for both linear and bent CO 2 adsorption in Figure 4, giving both adsorption energies and calculated charges of CO 2 .We modeled CO 2 adsorption over stoichiometric surfaces (configurations S1 and S2), and reduced surfaces (configurations R1-R4).Figure 5 shows the final optimized geometries for bent CO 2 .Figure S3 shows the adsorbed linear CO 2 geometries , while Figure S4 shows other less stable bent configurations that we found. Over stoichiometric TiO 2 (configurations S1 and S2), linear CO 2 adsorption was more stable than bent CO 2 , regardless of whether Cu is present.The linear and bent CO 2 energies on TiO 2 (-0.20 eV for bent and -0.39 eV for linear) and Cu/TiO 2 (-0.28 eV for bent and -0.37 eV linear) are in agreement with our previous work. 63Linear CO 2 had charges near 0 e -(see Figure 4b) while bent CO 2 had negative charges near -0.3 e -over stoichiometric TiO 2 .Stoichiometric TiO 2 has no free electrons available to readily transfer to CO 2 which could explain why neutral, linear CO 2 is more stable than the bent, anionic CO 2 over the stoichiometric surface.Electron transfer from the Cu/TiO 2 surface to CO 2 was also apparently difficult, at least compared to the reduced surfaces as discussed below.This leads to linear CO 2 being more stable than bent CO 2 over the two stoichiometric surfaces we modeled.We note that the bent CO 2 configuration over the stoichiometric surface (see configuration S1 in Figure 5) resembled a carbonate-like structure, which was also observed in previous work. 37,38,63e next analyzed the effect of surface vacancies on CO 2 adsorption.Bent CO 2 is markedly stabilized over the surfaces with O v present, as Figure 4 and Figure 5 show.Over TiO 2 , the O v leads to a very strong bent CO 2 structure, as the CO 2 molecule fills the O v (see R1 in Figure 5).The adsorption energy of bent CO 2 in an O v was -1.28 eV, compared to linear CO 2 having an adsorption energy of -0.85 eV.We also compared our adsorption energies to literature papers that modeled the TiO 2 anatase (101) with O v and adsorbed bent CO 2 .Sorescu et al. 38 reported an adsorption energy of -1.35 eV for the R1 case, which is similar to our adsorption energy of -1.28 eV.He et al. 37 reported an adsorption energy of -1.09 eV for the R1 configuration at the PBE level, similar to our calculated PBE value of -0.92 eV.He et al. used a (2 x 1) TiO 2 surface cell whereas our work using a larger (2 x 4) surface cell, which might explain the slight differences.Further details 6 on the effect of the U correction can be found in the Supporting Information. When Cu is present on a reduced surface, we observed strong stabilization of bent CO 2 , with bent CO 2 adsorption energies of -0.85 eV (R2), -1.30 eV (R3), and -1.29 eV (R4).Interestingly, the bent CO 2 adsorption energies over a surface with O v (R1) and Cu/O v (R3) are comparable.In all cases over reduced surfaces bent CO 2 is preferred over linear CO 2 , but for the R2, R3 and R4 states this preference is very pronounced, with energy differences of -0.34, -1.03 eV and -0.80 eV, respectively, between the linear and bent CO 2 structures.Such significant differences in adsorption energies between linear and bent CO 2 suggest high selectivity for bent CO 2 formation over surfaces with both Cu and O v present, and hence potentially larger CO 2 reduction activity. Bent CO 2 had O-C-O angles near 130 (see Table S1) while linear CO 2 angles were all near 180 , indicating the activated nature of CO 2 .In the R1 configuration, CO 2 had all three atoms (O, C, O) bonding with the Ti near the oxygen vacancy.The R4 configuration had essentially the same CO 2 bent adsorption energy and structure as R1, suggesting that the Cu adatom in R4 was far enough from the O v so that it did not interact with the adsorbed CO 2 or O v significantly. In the R2 configuration, the Cu adatom bound to the O v strongly and blocked the CO 2 molecule from filling the O v .The CO 2 bent as it formed bonds (Cu-C and Ti-O) with the surface.In the R3 configuration, the optimized bent CO 2 structures appeared to be very similar to R2 configuration (see Figure 5).CO 2 only had two atoms (O and C) bonding with the surface in the R2 and R3 configurations: one O atom of the CO 2 bound to the Ti atom near the O v and the C atom interacted with two Ti atoms.The CO 2 charge in the R2 configuration was -0.56 e -for instance, while in the R3 configuration the CO 2 charge was -0.63 e -.Their adsorption energies were however different, with the R3 configuration being 0.45 eV more stable than the R2 geometry.The Cu atom in the R3 configuration was further from the O v which allowed Cu interactions with the surface O 2c atom.In the bent CO 2 R2 configuration, the Cu atom was 1.23 A from the O v site, while in the R3 configuration the Cu atom was 1.48 A from the O v site.This slightly different configuration could lead to the R3 configuration being more stable than R2 configuration.We further examined the stability of the R2 site by perturbing the Cu atom away from the O v and allowing geometry optimization.We found that with sufficient perturbation the R2 configuration relaxed to the R3 configuration, which suggests that R2 may be a local minimum. O v should be highly reactive due to undercoordinated surface atoms, but may also generate excess electrons which may transfer to the 7 CO 2 molecule, as shown in previous work. 95,96igure 4b shows that all the bent CO 2 became very negative when O v was present, being -0.28 e -(S1) and -0.35 e -(S2) over stoichiometric surfaces while -0.74 e -(R1), -0.56 e -(R2), -0.63 e -(R3), and -0.74 e -(R4) over the reduced surfaces.All the linear CO 2 had similar charges, being slightly cationic, near 0 e -.The most negatively charged CO 2 occurred in the R1 and R4 configurations(-0.74 e -), where both O atoms of CO 2 formed bonds with nearby Ti atoms.In both the R1 and R4 configurations, one reduced Ti atom (adjacent to the adsorbed CO 2 ) lost 0.36 e -and the other gained 0.1 e - upon CO 2 adsorption.Likewise, CO 2 gained 0.37 e -while the C atom was nearly neutral after adsorption.When only one O atom and the C atom of CO 2 interacted with surface Ti and Cu atoms, as observed as in the R2 and R3 cases, the calculated charges on CO 2 were -0.56 e -and -0.63 e -, respectively.In R3 for example, the C had a charge of 0.28 e -, while the O atoms had charges of -0.35 e -(O away from the surface) and -0.57e -(O close to the surface) after CO 2 adsorption.However, despite having less CO 2 charge, the R3 configuration had almost the same adsorption energy as R1 and R4, which had more negative CO 2 charge, suggesting that the presence of the Cu adatom in R3 had a substantial effect in stabilizing bent CO 2 . Projected density of states details for adsorbed bent CO 2 are shown in Figure 6.For the S1 configuration, the majority of CO 2 bands are near the edge of the valence band (-2 eV below the conduction band), which is 2 eV higher than the CO 2 bands in the gas phase which has a characteristic peak near -4 eV below the conduction band (shown in Figure S6).For the S2 configuration, the Cu state overlapped with the TiO 2 states, while overlap of Cu and CO 2 states were minimal, suggesting stronger Cu/TiO 2 and weaker Cu-CO 2 interactions.This agrees with the previous work by Iyemperumal and Deskins. 63For the R1 configuration, the highest CO 2 energy level was near -1.7 eV.The gap state created by the oxygen vacancy (shown in Figure 3b) also shifted to near -1.7 eV in the R1 configuration (Fig- We already demonstrated how activation of CO 2 to its bent structure occurs when Cu atoms and O v are present.We now discuss the reactivity of CO 2 over the various TiO 2 surfaces.Using the CI-NEB method we calculated several barriers for CO 2 dissociation over select surfaces.Formation of CO from CO 2 is one of 8 the proposed early steps of CO 2 reduction, 42,64 with subsequent hydrogenation steps forming various intermediates and products.In Table 1 we summarize the calculated reaction energies and activation barriers for the reaction CO 2 CO O.We started with bent CO 2 in all cases, and details on CO and O adsorption can be found in the Supporting Information.For the stoichiometric surface (S1) the CO 2 dissociation energy was found to be 1.50 eV.Since the reaction energy was so large, we expect the activation barrier to be at least 1.50 eV, and did not calculate the activation barrier.Over the Cu/TiO 2 surface (S2) the dissociation energy was 0.58 eV.We calculated the activation barrier to be 0.83 eV for the Cu/TiO 2 case (S2).Thus, it appears that CO 2 dissociation over these stoichiometric surfaces is likely to proceed at a very slow rate since the activation barriers prevent rapid CO 2 dissociation and reduction.The dissociation path for the S2 configuration can be found in Figure S8a in the Supporting Information. We also modeled CO 2 dissociation over reduced surfaces.The calculated dissociation energy of CO 2 in an O v (configuration R1) was -0.40 eV, and the barrier was 0.95 eV.Sorescu et al. 38 reported an activation barrier of 0.90 eV for CO 2 dissociation over O v /TiO 2 , while Ji and Luo 42 found a barrier of 0.73 eV.Our calculated activation barrier was comparable to these literature results.We expect that for Cu far from the O v (R4) the activation barrier will be similar to R1, given their similar adsorption energies, geometries, and dissociation energies.The effect of single metal atoms and O v on CO 2 reactivity is unknown, and we applied the CI-NEB method to calculate activation barriers for CO 2 dissociation starting with the R2 and R3 configurations.Figure 7 shows the two pathways for CO 2 dissociation over these surfaces.In both cases, the CO 2 dissociates to fill the O v and pushes the Cu out or away from the O v .The barriers are very low in both cases.For the R2 configuration, the process is energetically downhill with a small activation barrier of 0.1 eV (energy from the local minimum in image 3 to image 4).If the energy is not fully dissipated to the surrounding surface as the CO 2 molecule transitions from image 1 to the lower energy image 3 state, then CO 2 dissociation may be barrier-less.The R3 configuration has an activation barrier of only 0.19 eV.Both the R2 and R3 dissociation pathways are similar.But the R2 configuration, as we discussed in Section 3.2, was less stable than the R3 configuration.This corresponds to a dip in the energy path from image 1 to 3 (shown in Figure 7a) where the CO 2 molecule reaches a state similar to the R3 configuration.The slightly different geometry contributes to the difference in the activation barrier of 0.09 eV between the R2 and R3 cases. These results show that a single Cu atom and O v lowers the barrier for CO 2 reactivity sub-9 20,34 observed experimentally that CO 2 species spontaneously dissociated into CO even in the dark on a reduced Cu/TiO 2 surface.In their proposed CO 2 dissociation mechanism CO 2 dissociated and healed the oxygen vacancy and formed a Cu-CO complex.Our CI-NEB results confirm this mechanism as we have shown the activation barrier is very low and promotes CO 2 dissociation significantly. Our results show that CO 2 dissociation in an O v has a high barrier (0.95 eV) , while dissociation in or near Cu/O v is much smaller ( 0.2 eV).The role of Cu can be further understood by analyzing the CO 2 charges and geometries.In the R1 case, where CO 2 filled the O v , the surface excess electrons transferred to both O atoms.The O atoms in CO 2 had charges of -0.37 e -, while the carbon remained neutral.Analysis of the TiO 2 charges indicates that these electrons on O came predominantly from reduced Ti atoms.However, in the case of Cu near O v (R3) the O atom in CO 2 that interacted with the surface had a charge of -0.57e -, while the other O atom had a charge of -0.35 e -.The C atom in the R3 case had a charge of 0.28 e -.Furthermore the CO 2 charge distributions in R1 and R3 also mirrored the C-O bond distances.The CO 2 in R1 was symmetric with C-O bond distances of 1.26 A, while the CO 2 in R3 had C-O bond distances of 1.22 A and 1.33 A (summarized in Table S1).The O atom that interacted with Ti in R3 had an elongated C-O bond compared to R1, indicating that this molecule could be in a preactivated state.Indeed, the activation barrier to break this bond is much lower for R3 compared to R1, as our CI-NEB calculations show. In order to analyze the possible effect of photoexcited electrons, we modeled both Cu and CO 2 adsorption in the presence of an unpaired electron, similar to the method used by He et al. 37 A hydrogen atom was placed on the surface, away from the CO 2 adsorption site, and served to donate an electron to the surface.Further details on the hydrogen atom position can be found in the Supporting Information.This extra electron could transfer to adsorbates and 10 mimicked a photoexcited electron.This model of course does not fully simulate a photoexcited electron, and we would expect photoexcited electrons to be in higher energy states.Any charge transfer from a photoexcited electron is therefore likely to be more energetic compared to our approach.Rather this approach is a quick method to determine any potential effect of such electrons, such as if adsorbates will accept photoexcited electrons.More complicated methods, such as time-dependent DFT, can better describe photoexcited electrons, but at much greater computational cost.Yang et al. recently used this photoexcited electron model with hydrogen atoms on the surface to mimic the injection of electrons into TiO 2 . 61We note that surface models with an net -1 charge (essentially one extra electron in the system), rather than an added hydrogen atom as an elec-tron donor, performed similarly in modeling the effect of a photoexcited electron. 37Rodriguez et al. for example studied CO 2 reduction on the brookite TiO 2 (210) surface after introducing an extra electron. 97igure 8a shows adsorption energies of Cu atoms when such an electron was present compared to the case of no extra electron present, and Figure 8b shows similar results for adsorption of bent CO 2 .For Cu on the stoichiometric surface or away from the O v , the adsorption energy either did not change or was slightly destabilized by 0.1 eV.In the presence of an extra electron the Cu binding to TiO 2 with O v was strengthened by 0.43 eV (R2) and 0.44 eV (R3).Since the Cu atom was more stabilized in an O v when an excited electron was present, this may favor the migration or adsorption of Cu atoms into O v sites under photocatalytic conditions.The charges of the Cu atoms in Figure 8a can be found in Table S2 in the Supporting Information.We also modeled the effect of photoexcited electrons on linear CO 2 adsorption as summarized in Figure S10.We found the adsorption trends were the same compared to the no extra electron case, in that bent CO 2 was preferred over the reduced surfaces and linear CO 2 was preferred stoichiometric surfaces.The linear CO 2 adsorption energy for Cu in an O v (R2) and for Cu near an O v became more exothermic by 0.31 eV and 0.07 eV, respectively, in the presence of an extra electron.Other linear CO 2 adsorption energies did not change in the presence of the extra electron. We also determined the effect of the hydrogen atom position on the bent CO 2 adsorption energy by placing the hydrogen atom at four different positions relative to the adsorbed CO 2 .All adsorption energies were within 0.1 eV of each other, which indicates that the hydrogen position has little effect when donating an electron for this model.We discuss more details on this issue in the Supporting Information. For bent CO 2 adsorption in every case (except over stoichiometric TiO 2 ) the adsorption energies became stronger when an extra electron was present (see Figure 8b).The adsorption energies became more negative by 0.05 to 0.28 eV.We calculated the charges of CO 2 over 11 the surfaces with an unpaired electron present, and summarize them in Table S3.We found that the charges of CO 2 did not change significantly when the electron was present.Since the charges of bent CO 2 were the same regardless of whether an unpaired electron was present, we attribute the stronger adsorption energies to the ease of electron transfer from the surface to CO 2 .There is an energy cost for removing charge from the surface to the CO 2 molecule, and when an extra electron is present, this cost is diminished.The extra electron more readily transfers to CO 2 compared to the surface without an electron present.These results suggest that photoexcited electrons, along with Cu atoms and O v , may further stabilize activated, bent CO 2 and lead to efficient CO 2 photoreduction. We also considered the effect of photoexcited holes as previous work 98,99 showed cases where photogenerated holes could promote organic molecule dissociation on TiO 2 surfaces.Wanbayor et al. 100 also found CO oxidation could occur in the presence of holes.We placed an electron-withdrawing group, a hydroxyl, on the surface to mimic a hole, similar to previous DFT work. 99,101,102Figure S12 shows the positions of hydroxyls on the surface.The adsorption energies of bent CO 2 over the stoichiometric surfaces became 0.10 and 0.06 eV more positive for S1 and S2, respectively, when the hydroxyl was present.For the R1 case, the adsorption energy of bent CO 2 became endothermic in the presence of a hydroxyl group (1.06 eV).These results indicate that the photoexcited hole did not contribute to stabilizing activated CO 2 on both the stoichiometric and reduced TiO 2 surfaces.Intuitively these results make sense since CO 2 activation and dissociation proceeds through reduction (gaining electrons) rather than an oxidation process. We also modeled CO 2 dissociation in the presence of the unpaired electron.Results are shown in Table 1.Over stoichiometric TiO 2 (S1) the presence of the electron had a slight effect and the reaction energy was more exothermic by 0.11 eV, but overall the reaction was still quite endothermic at 1.39 eV.In the case of Cu/TiO 2 (S2) the effect was quite dramatic. The reaction energy dropped by 1.08 eV and becomes -0.50 eV, which is reasonably exothermic.Further NEB modeling of this reaction gave a barrier of 0.49 eV (see Figure S8 for NEB pathways), which indicates that photoexcited electrons may very strongly enable CO 2 adsorption and reactivity over Cu/TiO 2 .For the reduced surfaces where Cu did not interact with the CO 2 molecule (R1 and R4), the extra electron did not change the reaction energies significantly.The calculated reaction barriers with an photoexcited electron for Cu in an O v (R2) and Cu near an O v (R3) were 0.09 eV and 0.08 eV higher than barriers with no extra electron, indicating this extra electron did not have a positive role in dissociating CO 2 like for other cases (e.g.S2 or Cu/TiO 2 ).The photoexcited electron therefore had a more substantial effect for CO 2 dissociation on Cu/TiO 2 (S2) than on O v (R1) and Cu/O v (R2,R3).The reduced surfaces already had unpaired electrons, so further unpaired electrons did not improve CO 2 dissociation kinetics. Highly dispersed Cu sites on TiO 2 were prepared via a simple adsorption method, in which Cu 2 cations were adsorbed onto TiO 2 nanoparticles suspended in an aqueous solution of CuCl 2 .The synthesized sample was thermally treated under H 2 (to produce oxygen vacancies) or under O 2 .See the Methodology for further details.Quantification with elemental analysis indicated a loading of 20.5 mol Cu per gram TiO 2 , corresponding to a coverage of 1 Cu atom per 5 nm 2 surface area on TiO 2 . 62Examination with microscopy confirmed the absence of Cu aggregates or nanoparticles in the synthesized Cu/TiO 2 material (Figure S13).Thermal treatment with H 2 resulted in the formation of oxygen vacancies in Cu/TiO 2 , as shown by its optical spectrum (Figure S14, trace b).Further characterization with X-ray photoelectron spectroscopy revealed the presence of both Cu 2 and Cu on the synthesized Cu/TiO 2 that was not thermally treatment, but only Cu on the same sample thermally treated in the presence Detailed in the supplementary information section, the model determines a coverage of 2.6 of a copper monolayer from the Cu 2p 3/2 -to-Ti 2p 3/2 peak area ratio of 0.053 for the experimentally representative data in Figure S16.Considering that this coverage is well below that of a single monolayer, we interpret the results to imply that the surface is dominated by single copper atoms rather than dimers or small clusters.Moreover, theoretical results indicate Cu dimer formation over TiO 2 is unfavorable, 63 reinforcing this view.Further investigation of the copper adlayer morphology remains the subject of ongoing study.In our study using Fourier transform infrared (FTIR) spectroscopy, the formation of bent CO 2 molecules adsorbed on TiO 2 was observed in the presence of oxygen vacancies and/or surface Cu sites.TiO 2 or Cu/TiO 2 placed in an in situ infrared cell 103 were annealed at 300 o C prior to CO 2 adsorption and light irradiation.Figure 9 shows spectra of species formed upon CO 2 adsorption on different TiO 2 samples.In addition to multiple carbonate peaks, a band at 1638 cm -1 associated with surface-adsorbed bent CO 2 molecules 104 is clearly distinguished in the spectrum of H 2 -treated TiO 2 (Figure 9a).This peak is absent from the spectrum of untreated TiO 2 , which does not contain oxygen vacancies, after CO 2 adsorption (Figure S16).The peak at 1638 cm -1 is also present, with greater intensity, in the spectrum of H 2 -treated Cu/TiO 2 (Figure 9b).In comparison, this peak 13 is much less intense in the spectrum of O 2treated Cu/TiO 2 (Figure 9c).The presence of bent CO 2 molecules on O 2 -treated Cu/TiO 2 is likely due to the fact that surface Cu sites stabilize the formation of bent CO 2 , as indicated in our prior work 62 and current work.We conclude therefore based these experimental spectra and peak intensities that bent CO 2 forms with the following intensities: Cu/O v TiO 2 O v TiO 2 Cu/TiO 2 TiO 2 .This is in agreement with our DFT calculations. In order to further validate the formation of activated bent CO 2 we calculated vibrational frequencies of bent CO 2 on various TiO 2 surfaces using DFT.Our calculated vibrational frequencies for the relevant stretching mode of adsorbed bent CO 2 were 1834 (S1), 1670 (S2), 1696 (R1), 1665 (R2), 1670 (R3), and 1676 (R4) cm -1 .The calculated vibrational frequency of S2 compares well with our previous reported value of 1685 cm -1 . 63Our calculated vibrational frequency for S1 (1834 cm -1 ) and R1 (1696 cm -1 ) also agree well with the DFT results by Sorescu et al.: 38 1796 cm -1 (S1) and 1700 cm -1 (R1).He et al. 37 also obtained similar magnitudes: 1776 cm -1 (S1) and 1704 cm -1 (R1).He et al. attributed the large difference in vibrational frequency between the S1 and R1 cases to the large differences in bonding and geometry between the two sites.Our calculated vibrational frequencies for most adsorption modes (1665 to 1696 cm -1 ) are in good agreement with our experimental FTIR value of 1638 cm -1 for bent CO 2 , indicating that bent CO 2 indeed formed on these various surfaces.The DFT frequencies for bent CO 2 are slightly higher than the experimental value, but it is known that DFT frequencies are often higher than experimental frequencies, and scaling factors may be used to get better agreement such as in He et al. 37 Bent CO 2 over the stoichiometric surface (S1) however had a calculated vibrational frequency ( 1800 cm -1 ) not observed in the experimental FTIR data.Bent CO 2 interacting with the TiO 2 surface alone does not bind strongly, as our DFT results show, and accordingly this peak was not observed in the experimental results.At higher pressures and lower temperatures, binding of bent CO 2 to the bare TiO 2 surface may occur, so that the 1800 cm -1 peak could appear.Both experiment and theory indicated that bent CO 2 was not formed over pure TiO 2 , but that bent CO 2 formed over surfaces with Cu atoms and O v . In our photochemical studies, thermally treated TiO 2 or Cu/TiO 2 was subject to irradiation with UV light in the presence of gaseous CO 2 .Difference FTIR spectra were obtained by subtracting infrared spectra after light irradiation from corresponding spectra before light irradiation.A peak at 2111 cm -1 is clearly seen in the difference spectrum of H 2treated Cu/TiO 2 , indicating the formation of CO adsorbed on Cu sites upon light irradiation (Figure 10b).This peak is also observed in the spectrum of O 2 -treated Cu/TiO 2 but with much lower intensity (Figure 10c).Since a much greater amount of bent CO 2 molecules were produced by H 2 -treated Cu/TiO 2 than O 2 -treated Cu/TiO 2 (Figure 9), the comparison between the spectra shown in Figure 10b and 10c suggests that the increased number of bent CO 2 molecules promoted photoinduced dissociation of CO 2 on the TiO 2 materials.CO 2 dissociation may also have been facilitated by lower barriers, as our calculations show, over H 2 -treated Cu/TiO 2 which would presumably have more O v .Formation of CO by photoinduced dissociation of CO 2 likely occurred on H 2 -treated TiO 2 as well, but was not observed in the spectrum shown in Figure 10a due to the absence of surface sites (such as Cu ) for strong CO adsorption.These results, again in agreement with our DFT results, indicate that O v and Cu may increase CO 2 reduction activity.We also analyzed CO formation in the dark over our catalysts, but no adsorbed CO was detected, unlike previous work. 64Our Cu loadings were small, which could limit CO 2 dissociation in the absence of light. We also calculated CO stretching vibrational frequencies using DFT to compare with our experimental FTIR data.In the Supporting Information we show optimized structures for adsorbed CO in Figure S17.Our calculated gas phase vibrational frequency of CO was 2161 cm -1 .CO was weakly bound to the pure TiO 2 surface (S1 case) with an adsorption energy of -14 0.02 eV and the CO vibrational was 2178 cm -1 , only a small shift from the gas phase value.On the other hand, CO adsorbed on Cu (S2) or Cu with oxygen vacancy (R2/R3) resulted in a CO stretch frequency of 2089 (S2) and 2065 (R2/R3) cm -1 , as well as corresponding strong binding energies of -0.91 eV (S2) and -0.58 eV (R2/R3).CO adsorbed in an oxygen vacancy (R1) resulted in much stronger shifted value of 1929 cm -1 and very strong adsorption energy of -1.72 eV.Our calculations indicate that in the presence of Cu atoms and/or oxygen vacancies, the CO vibrational frequencies are shifted compared to the gas phase CO stretching frequency of 2161 cm -1 .Our experimental results displayed a peak at 2111 cm -1 for the Cu/TiO 2 and Cu/O v /TiO 2 catalysts, attributed to CO adsorbed on Cu (see Figure 10).No vibrational peaks for CO in an oxygen vacancy were observed, likely due to the filling of oxygen vacancies upon CO 2 dissociation.The DFT frequency for CO over Cu (2089 cm -1 ) is within 20 cm -1 of the experimental value, or in good general agreement.Our theoretical and experimental results demonstrate that CO 2 photodissociation occurs predominantly in the presence of Cu and/or oxygen vacancies on the surface.We mention that our CO stretch frequencies of 2178 (S1) and 1929 cm -1 (R1) are comparable with the values of Lustemberg and Scherlis at 2178 (S1) and 1936 cm -1 (R1). 105ther DFT work also provides similar values for the S1 CO vibrational frequency: Scaranto and Giorgianni 106 reported 2192 cm -1 , Mino et al. 107 reported 2185 cm -1 and Setvin et al. 108 reported 2182 cm -1 . An important consideration for the CO 2 reduction cycle is the fate and regeneration of O v .Our results show that O v are likely healed as CO 2 dissociates to fill the O v .For a catalytic cycle involving O v to occur, oxygen vacancies must form after being healed.After exposure of CO 2 to the H 2 -treated Cu/TiO 2 catalyst and irradiation, adsorbed CO was observed in the difference FTIR spectrum (see Figure 10).We then purged the catalyst, and again exposed the catalyst to CO 2 and UV light.We again detected CO, but the appropriate FTIR peak was greatly diminished, suggesting that O v in our catalysts had healed.Creating catalysts with defects is a challenge and ongoing area of research. 91,109Viable strategies for O v creation or regeneration include hydrogen treatment, thermal treatment, doping, and possibly other methods.We have demonstrated that atomic Cu and O v can work together to enable CO 2 photoreduction, and future work may concentrate on modifying the TiO 2 nanoparticles, such as changing particle size or doping the particles, so that O v can be readily regenerated during a catalytic cycle. While we have focused on Cu/TiO 2 catalysts, we also briefly consider Pt atoms adsorbed on TiO 2 .Pt is a prototypical catalyst and has been studied for CO 2 reduction using small clusters. 29,5960611110 Our analysis could provide insight on how different metals may perform as supported single atom catalysts for CO 2 reduction.In Figure 11a, the adsorption energies of Pt are shown over stoichiometric and reduced surfaces, as well as for comparison results of Cu.Corresponding geometries can be found in Figure S17.Pt atoms bound substantially stronger to all of the four sites compared to Cu.The Pt adsorption energy over the stoichiometric surface was -3.3 eV, while the adsorption energy was -5. 4 In Figure 11b, we give the adsorption energies of linear and bent CO 2 .In contrast to Cu, over the stoichiometric surface with Pt (S2) bent CO 2 was preferred over linear CO 2 by 0.21 eV.Notice also that for Pt, the S2 configuration has a close adsorption energy (near -0.64 eV) to that of the R2 and R3 configurations, indicating that Pt/O v did not promote CO 2 activation as well as Cu/O v did.Over the Pt/reduced TiO 2 surfaces, the bent CO 2 binding geometries to the surface (R2, R3, R4 configuration) are nearly identical to the Cu case (see Figure S18).The bent CO 2 adsorbed more strongly (in the range of 0.38 eV to 0.53 eV) than linear CO 2 , which was the same trend we observed for the Cu/reduced TiO 2 case.However, comparing Pt and Cu, bent CO 2 in the R2 and R3 configurations was more strongly bound over Cu/TiO 2 compared to Pt/TiO 2 .This difference could be a result of the Pt charges (negative), where Pt was -0.51 e -and Cu was 0.02 e -for the R2 case.The two anions (Pt and CO 2 ) could have more repulsion compared to the Cu/O v /TiO 2 case, since Cu was positively charged, leading to stronger CO 2 adsorption over Cu/O v /TiO 2 . We also considered CO 2 reactivity over Pt/TiO 2 surfaces.Table 1 contains a summary of CO 2 dissociation energies for Pt over TiO 2 .The reaction energy for dissociation of CO 2 was exothermic for the Pt/TiO 2 (S2) case compared to an endothermic reaction energy for Cu/TiO 2 .However, the activation energies over Pt and Cu were nearly the same over these catalysts, being 0.83 eV (Cu-S2) and 0.85 (Pt-S2).When Pt was in the O v (R2) the CO 2 dissociation energy was -1.08 eV, which was less exothermic than the Cu-R2 case (-1.71 eV ).The dissociation barrier was 0.43 eV, which is about twice the barrier for the Cu case (0.19 eV).The Pt-R2 and Pt-R3 configurations had similar reaction energies and activation barriers due to the similarity in geometries.These results show that Pt over stoichiometric surfaces may be a more promising catalyst compared to Cu, but that the strong synergy between metal atom and O v is largely absent for Pt, while such strong synergy occurs for Cu.In this work, we did not model Pt/TiO 2 with photoexcited electrons.However, in recent work by Yang et al., 61 a Pt tetramer with multiple photoexcited electrons on a TiO 2 surface was shown to have a lowered barrier for CO 2 reduction.We therefore could expect that photoexcited electrons could have a stabilizing effect for single Pt atoms, just like for Cu atoms."
  },
  {
    "title": "Conclusions",
    "content": "In this work, we systematically investigated the effect of defects and excited electrons on CO 2 reduction using TiO 2 supported single atom metal photocatalysts.We first found using DFT that Cu binds strongly to both the sto- ichiometric and reduced TiO 2 surfaces, indicating that single site Cu catalysts maybe stable over TiO 2 .Activation of CO 2 occurs as bent CO 2 forms from the linear CO 2 structure.Cu atoms in/near an oxygen vacancy were highly selective towards bent CO 2 CO 2 formation, in contrast to Cu over stoichiometric TiO 2 .Furthermore, the Cu/O v complex can lower the reaction barrier for CO 2 dissociation (CO 2 CO O) to very low values (0.10 -0.19 eV), which gives high catalytic production of CO.This spontaneous dissociation of CO 2 also agrees with experimental results. 20,34ur own experimental work showed that bent CO 2 formed over Cu/TiO 2 samples with measured adsorption intensities of Cu/O v /TiO 2 O v /TiO 2 Cu/TiO 2 TiO 2 , in agreement with our theoretical calculations.Our photochemical studies also indicate CO 2 dissociation most readily occurs on Cu/O v /TiO 2 surfaces. We also confirmed that a photoexcited electron may be beneficial in stabilizing bent CO 2 on both Cu/TiO 2 and Cu/O v surfaces.Significant decreases in the reaction energy (1 eV) and barrier (0.26 eV) were calculated when an electron was present for Cu over stoichio-metric TiO 2 .Such an effect was not observed over reduced surfaces since such surfaces already had unpaired electron(s) present.These results imply that photocatalytic activity over activity over Cu/TiO 2 should be higher than thermal catalytic activity, and details the direct role of photoexcited electrons in reducing CO 2 .We also modeled Pt as an alternative to Cu, and found that Pt bound much stronger to TiO 2 than Cu.Pt/O v also showed selectivity to adsorbed bent CO 2 over linear CO 2 , which was similar to Cu/O v .Reaction barriers for CO 2 dissociation were low for the Pt/O v surface (0.43 eV), although the strong synergy for Cu/O v (reaction barriers 0.1 to 0.19 eV) was not observed.We have summarized our calculated reaction results in Figure 12.This figure shows that several catalysts may enable facile reduction of CO 2 , and that O v and photoexcited electrons may assist single atoms significantly in this process.Our work on single atomic catalysts for CO 2 reduction highlights promising ways to tailor the catalyst, such as controlling surface defects or increasing photoexcitation yield, and further motivates research on a variety of supported single atom 17 photocatalysts. Figure 1: The supercell used in this work, being a (2x4) representation of the anatase (101) surface.The slab had 288 (fully stoichiometric) or 287 (one oxygen vacancy) atoms.Indicated are different atom types and an oxygen vacancy (O v ).The subscripts indicate the coordination number of the atoms, e.g., O 2c is a two-coordinated oxygen atom.O v indicates an oxygen vacancy. Figure 2: Cu adsorption over TiO 2 anatase (101) surfaces.Shown is Cu adsorption over a (a) a stoichiometric surface, (b) in an oxygen vacancy, (c) near an oxygen vacancy, and (d) far from the oxygen vacancy.The Cu atom is depicted in orange.Given are adsorption energies while numbers in parentheses are calculated Cu charges. due to the O v near -0.7 eV which is composed of Ti electrons.Overlap between the Cu and TiO 2 gap states suggest strong interactions, such as Cu in an O v ( -0.7 eV) and Cu near an O v (between -0.4 eV to 0 eV).Indeed electron transfer occurs from the O v to Cu, with Cu having a -0.35 charge when in the O v .When an O v forms two unpaired electrons are left in TiO 2 (O 2- O v 1 2 O 2 2e -) which may reduce two Ti atoms.The two reduced Ti atoms near the O v had charges of 1.93 e - and 1.83 e -, compared to the average charge of 2.42 e -for the other Ti atoms.After Cu adsorbed in an O v , one of the reduced Ti atoms had a charge of 2.19 e -while the other reduced Ti atom had a charge of 1.73 e -, indicating a net transfer of electrons to the Cu atom from the two Ti atoms.After the charge transfer occurred from TiO 2 to Cu, the O v gap states hybridized with the Cu states, as shown in Figure 3d and e.For Cu far from an O v both gap states for Cu and TiO 2 are seen, but since the Cu does not interact with the O v , these states are largely independent of each other and have little overlap. Figure 3: Projected density of states plots for adsorbed Cu.The zero energy level is set at the conduction band edge.The filled curves represent occupied states, while unfilled curves represent unoccupied states. Figure 4: Summary of CO 2 adsorption over over TiO 2 and Cu/TiO 2 .(a) The adsorption energies of CO 2 of the most stable linear and bent configurations are given.(b) The calculated charges of the most stable adsorbed CO 2 are also shown.Geometries for the most stable bent configurations are given in Figure 5. Figure 5: Most stable bent CO 2 adsorption geometries over TiO 2 and Cu/TiO 2 surfaces.Shown is CO 2 adsorption over several surfaces: a stoichiometric surface (S1), a stoichiometric surface with a Cu adatom (S2), a reduced surface with oxygen vacancy (R1), a reduced surface with a Cu adatom in an oxygen vacancy (R2), a surface with Cu near an oxygen vacancy (R3), and a surface with Cu far from the oxygen vacancy (R4).The CO 2 adsorption energies are given. Figure 6: Projected density of states plots for adsorbed bent CO 2 .The zero energy level is set at the conduction band edge for each plot.The filled areas represent occupied energy states. Figure 7: The calculated climbing image nudged elastic band pathways for CO 2 dissociation over (a) Cu in an O v (R2) and (b) Cu near an O v (R3). Figure 8: Adsorption energies of (a) Cu adatoms and (b) bent CO 2 over various surfaces in the presence of an extra electron.The extra electron was modeled using a hydrogen atom, similar to the work of He et al.37 Figure 9: FTIR spectra of species formed upon CO 2 adsorption on (a) H 2 -treated TiO 2 , (b) H 2treated Cu/TiO 2 , and (c) O 2 -treated Cu/TiO 2 in the spectral region between 1500 cm -1 and 1800 cm -1 .The spectra are fitted to individual bands with Lorentzian line-shapes.The fitted peak at 1638 cm -1 , corresponding to bent CO 2 , is indicated by distinct coloring for each sample. Figure 10: Difference FTIR spectra of (a) H 2treated TiO 2 , (b) H 2 -treated Cu/TiO 2 , and (c) O 2 -treated Cu/TiO 2 after photochemical CO 2 reduction for 1 h. Figure 11: Results from modeling Pt/TiO 2 surfaces.(a) Adsorption energies of Pt adatoms compared to Cu adatoms.(b) Adsorption energies of bent and linear CO 2 over Pt/TiO 2 surfaces. Figure 12: A summary of possible CO 2 dissociation pathways as calculated by DFT.Given are reaction and activation energies.The dotted line suggests a \"cut-off\" activation energy ( 0.6 eV), where activation energies below this line are expected to proceed reasonably fast.Several surfaces are good catalysts for CO 2 reduction: Cu/TiO 2 with photoexcited electron, Pt/O v /TiO 2 , Cu/O v /TiO 2 , and Cu/O v /TiO 2 with photoexcited electron. Summary of reaction energies and select activation barriers for bent CO 2 dissociation, CO 2 CO O.All numbers are in eV.compared to just stoichiometric or reduced TiO 2 surfaces or Cu/TiO 2 .Importantly, our work confirms experimental work, where it was shown that Cu and O v could lead to spontaneous CO 2 dissociation even under dark conditions.Liu et al. stantially 88 for Pt in an O v and Pt near the O v , and -3.1 eV for Pt away from an O v .Similar results were obtained by Gong et al.50who reported an adsorption energy of -4.71 eV for Pt in an O v .Our calculations were at the PBED3U level, while Gong et al. used PBE only, which could explain the slight difference in adsorption energies.In any case, Pt binds much stronger to the surface than Cu.Since Pt interacts differently than Cu with the TiO 2 surface, it could influence the formation of O v differently than Cu.We found Cu to have no real effect on O v formation (see Section 3.1).In contrast, the O v formation energy decreased by 2.13 eV and 2.24 eV when a Pt atom was present in/near O v respectively, and increased by 0.13 eV when Pt was away from O v (similar to the case of Cu away from the O v ).This indicates that Pt could potentially increase the 15 number of O v , which may have a strong effect on surface reactivity.Experimental work has shown for instance that Rh atoms can enable O v formation.88 ACS Paragon Plus Environment Acknowledgement The authors thank XSEDE for providing computational resources (TG-CTS170005).The authors also thank the WPI high-performance computing staff, especially Spencer Pruitt, for providing support and computational resources.This work was supported by the National Science Foundation through grants CBET-1511672 and CBET-1510810. Additional details on the theoretical and experimental work."
  }
]