[
  {
    "title": "Doi",
    "content": "10.1016/j.apcata.2015.11.001"
  },
  {
    "title": "Article_Title",
    "content": "Enhanced CO2 photoreduction activity of black TiO2−coated Cu nanoparticles under visible light irradiation: Role of metallic Cu"
  },
  {
    "title": "Abstract",
    "content": "Nanosized metallic copper could be a replacement of noble metals for improving photoactivity of TiO 2 -based photocatalysts, but it tends to be oxidized by oxygen in surroundings.To avoid this, black TiO 2 -coated Cu nanoparticles (denoted as CuTiO 2 ) were constructed in the present work, and their photoactivity for the photoreaction of CO 2 with H 2 O vapor under visible-light irradiation was explored.X-ray diffraction, transmission electron microscopy and selected area electron diffraction analysis for the used CuTiO 2 confirm the hierarchical structure of CuTiO 2 and oxygen resistance of metallic Cu.The photocatalytic activity for CuTiO 2 (4Cu) reaches 1.7 times of that for its counterpart, bared black TiO 2 .The improved photoactivity is attributed to the embedded metallic Cu, which promotes the formation of oxygen vacancies in TiO 2 through the metal-oxide interaction, thus increasing the visiblelight absorption of CuTiO 2 and the adsorption of CO 2 on their surface.Furthermore, the metallic Cu increases photoinduced charge-separation of TiO 2 through trapping electrons as evidenced by transient photocurrent measurements.The present work sheds light on developing new type of metal-oxide based visible-light-driven photocatalysts."
  },
  {
    "title": "Experimental",
    "content": "Cu nanoparticles (NPs) were synthesized through an approach using Al 2 O 3 as dispersing agent.CuO/Al 2 O 3 (CuO/Al 2 O 3 1/4, w/w) was firstly prepared by co-precipitation.Specifically, 11.7 g of Al(NO 3 ) 3 9H 2 O and 1.20 g of Cu(NO 3 ) 2 3H 2 O were dissolved in 100 mL of distilled water to form a solution (I).Then, 6.1 g of Na 2 CO 3 (AR) was dissolved in 100 mL of distilled water to form another solution (II).The two solutions were simultaneously dropwise added into a beaker containing 200 mL distilled water at 353 K under vigorous stirring.As-formed precipitate was washed thoroughly with distilled water.The filter cake was dried at 353 K and then calcinated at 723 K.The obtained CuO/Al 2 O 3 composite was dispersed into 4 M NaOH solution to obtain CuO NPs, which were further washed with distilled water, and then dried at 353 K.After that, the pure CuO NPs were reduced to CuNPs at 553 K in H 2 (99.999). A desired amount of Cu NPs (0, 20, 40 or 80 mg) was dispersed into 3 mL of ethanol containing 0.2 g water and hydrogen chloride (H 2 O/HCl/C 2 H 5 OH, pH 3).Following that, 0.84 g of Ti(OC 4 H 9 ) 4 was dissolved in 3 mL of ethanol and dropwise added into Cu NPs suspension under ultrasonic wave.The mixture was transformed into gel after about 40 min.The gel was heated to 150 C to remove ethanol, butanol and HCl.The above steps carried out under the protection of H 2 flow.Finally, the sample was annealed at 450 C for 2 h under high vacuum.The obtained photocatalysts with specific Cu content were denoted as TiO 2 , 1 CuTiO 2 , 2 CuTiO 2 and 4 CuTiO 2 , respectively. The chemical compositions of photocatalysts were analyzed by an ARL-9800 X-ray fluorescence spectrometer (XRF).The surface area and pore size were determined using a Micromeritics ASAP2020 autosorption analyzer.Experiments were carried out at 77.3 K using N 2 as an adsorbate.The samples were degassed at 473 K for 2 h before the measurements.X-ray diffraction (XRD) patterns of samples were collected in ambient atmosphere by a Bruker D8 powder diffractometer with Cu Ka radiation ( 1.5408A) generated at 40 kV and 30 mA.Diffraction intensities were recorded from 20 to 80 at a rate of 2 /min.Transmission electron microscopy (TEM) characterization was performed on a JEOL-JEM 2100 electron microscope.Absorption spectra of the photocatalysts were recorded via a ShimadzuSolidSpec-3700DUV spectrophotometer equipped with a diffuse reflectance attachment with a spectraloncoated integrating sphere against spectralon reference.The EPR measurements were carried out on a Bruker E500 instrument operating in the X-band and equipped with an Oxford cryostat working in the temperature range of 4-298 K.The samples (20 mg) were placed into a spectroscopically pure quartz cell and sent into the ESR cavity with fixed depth.All the spectra were recorded at 100 K. g-Values were determined by calibration with DPPH (Bruker spectrometer) standard.X-ray photoelectron spectroscopy (XPS) study was performed using a VG Microtech MT500 with an Mg-K Xray source.All binding energies were referenced to carbon (1s) at 285.6 eV. Adsorption of CO 2 was carried out on a home-made volumetric adsorption system at room temperature.The catalysts were evacuated at 423 K for 2 h before the measurements.After cooling the catalysts to room temperature, doses of CO 2 were admitted sequentially and the coverage of CO 2 was measured until the equilibrium pressure reached about 9 kP a .The uptake of CO 2 for the saturation coverage on a photo-catalyst surface was determined by extrapolating the coverage of isotherm to P CO 2 0. The photocurrent was measured with a CHI660E instrument using a three-electrode system.The samples (50 mg) were loaded on conductive surface of ITO glass and 0.05 M Na 2 SO 4 solution was used as electrolyte.500 W Xenon lamp equipped with UV cut-off filter ( 400 nm) was used as light source, standard calomel electrode (SCE) as reference electrode, and Pt slice as counter electrode. The photocatalytic reduction of CO 2 with H 2 O vapor was carried out in a reactor connected with mechanical vacuum pump.The powder of photocatalysts (20 mg) was evenly deposited on a circular quartz plate with diameter of 50 cm and then located inside the photo-reactor perpendicular to the light beam.A 500 W Xe lamp (Oriel) coupled with UV cut-off filter was used as light source with light intensity of 0.220 W cm -2 .Thus, the wavelengths of light were mainly located between 400 and 800 nm.Gaseous CO 2 of 8 kP a was in site produced in reactor by a reaction of NaHCO 3 (Analytical Grade) with 0.5 mol/L H 2 SO 4 solution.The products of O 2 , CO and CH 4 were analyzed in situ by a gas chromatograph (Agilent Technology 4890 GC) with a TCD equipped with Porapark Q and Molsieve 5 A column with H 2 as carrier gas.The possible prod-Table 1 Composition, specific surface area and pore structure of the TiO2, 1 CuTiO2, 2 CuTiO2 and 4 CuTiO2 photocatalysts calcinated under vacuum at 723 K. Catalyst ucts of C 2 -C 5 hydrocarbons and methanol were detected with a FID detector equipped with an HP-5capillary column."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The Cu NPs (without TiO 2 ) were firstly obtained in synthesis procedure of CuTiO 2 photocatalysts.Fig. 1 shows the XRD patterns of Cu/Al 2 O 3 and Cu NPs reduced in H 2 at 523 K.The diffraction peaks at 43.2, 50.3 and 73.9 are assigned to (1 1 1), (2 0 0) and (2 2 0) planes of face-centered-cubic copper, respectively 15.These diffraction peaks are more intensive for Cu NPs than for Cu/Al 2 O 3 , implying the removal of Al 2 O 3 leads to larger copper crystallites.According to the peak width of (1 1 1) planes and Debye-Scherrer equation, the average copper crystallite sizes of the Cu/Al 2 O 3 and Cu NPs are calculated to be about 6.5 and 12 nm, respectively.Note that alumina in Cu/Al 2 O 3 presents in the amorphous state. Furthermore, the as-prepared photocatalysts were characterized by XRF and N 2 adsorption-desorption.Table 1 lists their compositions, BET surface areas and pore structure parameters.The surface area is 4.2, 2.5, 1.1 and 3.0 for TiO 2 , 1 TiO 2 , 2 CuTiO 2 and 4 CuTiO 2 , respectively.Clearly, the surface area of photocatalyst decreases with an increase in Cu content and reaches minima at 2 Cu, probably due to structural damage of gel (precursor of photocatalyst) by the Cu nanoparticles.Then, it begins to increase upon the further increase of Cu content (4 Cu), which might be caused by the dispersion to TiO 2 by more Cu nanoparticles.Total pore volume of photocatalysts decreases with increaseing Cu content. Taking into consideration of evidence for the oxygen resistance of metallic Cu under CO 2 photoreduction, we supplied the XRD and TEM analysis for the used photocatalysts.Specifically, the 4 CuTiO 2 was used for four cycles under the photoreduction of CO 2 with H 2 O.The XRD patterns of the used photocatalysts are shown in Fig. 2. The diffraction peaks of metallic copper appear in the used 1 CuTiO 2 , 2 CuTiO 2 and 4 CuTiO 2 samples, and their intensity increases with increasing of copper content in the photocatalysts.The average copper crystallite size is calculated to be 30.9,31.2 and 32 nm for 1 CuTiO 2 , 2 CuTiO 2 and 4 CuTiO 2 , respectively (shown in Table 1), indicating the Cu content has little effect on the size of copper crystallites in CuTiO 2 photocatalysts.It should be noted that the average size of copper crystallites in CuTiO 2 photocatalysts is larger than that of Cu NPs.This is because annealing temperature for the photocatalysts (at 723 K) is higher than that of the reduction for Cu NPs.Titanium dioxide in all samples presents in anatase phase state (PDF no.21-1272) 26,27.As can be seen from Fig. 3A andB, Copper particles in the used 4 CuTiO 2 were coated by titanium dioxide, which is further confirmed by SAED pattern corresponding to the region highlighted by the dashed box in Fig. 3B.The size of Cu particles under TiO 2 coating is about 300 nm, significantly larger than that calculated from XRD, suggesting these consist of multiple copper crystallites.Clearly, TiO 2 -coated Cu nanoparticles with oxygen resistance were fabricated in the work as supported by the XRD and TEM results (Fig. 2 and3).Fig. 3C shows the image of HRTEM for 4 CuTiO 2 .The crystallite with an interplanar spacing of about 0.35 nm corresponds to the (1 0 1) lattice spacing of anatase TiO 2 crystal, which appears to be surrounded by amorphous layers.Similar phenomenon was observed for black TiO 2 by Chen et al. 28. Fig. 4A displays the UV-vis diffuse reflectance spectra for as-prepared TiO 2 , 1 CuTiO 2 , 2 CuTiO 2 and 4 CuTiO 2 photocatalysts.The photocatalysts exhibit strong absorption in the wavelength range from 200 to 800 nm and continuously increase with increasing of Cu content.The inset of Fig. 4A shows the photograph of photocatalysts.The four photocatalysts are black, further supporting the results of UV-vis diffuse reflectance.Anatase in fact shows oxygen depletion upon annealing under vacuum, resulting in band-gap narrowing of TiO 2 , and thus high absorption of visible light 293031.On the other hand, it is well known that the copper nanoparticles could generate localized surface plasmon resonance (LSPR) under visible-light irradiation with wavelength of about 570 nm 13.However, the LSPR absorption of Cu at about 570 nm is not observed for CuTiO 2 photocatalysts in this work.Therefore, the enhanced visible-light absorption of the photocatalysts with metallic copper here cannot be explained in terms of the LSPR effect by Cu. To better elucidate the enhanced visible-light absorption of photocatalysts with metallic copper nanoparticles, we performed electron paramagnetic resonance (EPR) investigations for the photocatalysts.The EPR spectra taken at 100 K with the equivalent weight of samples are shown in Fig. 4B.Isotropic signals at gtensor values of about 2 typically ascribed to trapped electron on oxygen vacancies appear for TiO 2 , 1 CuTiO 2 , 2 CuTiO 2 and 4 CuTiO 2 3233343536.The signal intensity for the photocatalysts is increased with increasing the content of metallic Cu.The g value is 1.996 for TiO 2 and has little change in the presence of metallic Cu.The results suggest the presence of metallic Cu does increase the amount of oxygen vacancies but not change the environment of trapped electron on oxygen vacancies 37.In addition, the EPR signals for Cu 2 or Cu are not observed 38. Fig. 5 shows the Ti 2p, O 1s and Cu 2p core level XPS spectra of the TiO 2 and 4 CuTiO 2 photocatalysts.As shown in Fig. 5A, the two boarder peaks at about 458.4 and 464.6 eV correspond to binding energies of Ti 2p 3/2 and Ti 2p 1/2 , respectively 39.The peak for Ti 2p 3/2 could be deconvoluted into two peaks at about 458.6 and 457.8 eV.The peak at 458.6 is assigned to Ti 4 in TiO 2 lattice 40.Furthermore, the peak at 457.8 eV is attributed to the Ti -( 4, represents O vacancy).The relative intensity of the Ti peak is larger for 4 CuTiO 2 than for TiO 2 .The atomic ratio of Ti relative to Ti plus Ti 4 is derived to be 27 and 54 for TiO 2 and 4 CuTiO 2 , respectively (shown in Table 2).The results indicate more Ti - on the surface of 4 CuTiO 2 .O 1s XPS spectra of TiO 2 and 4 CuTiO 2 are shown in Fig. 5B; the single O1 speak can be resolved into four peaks at about 528.8, 529.6, 531.2 and 532.2 eV.The two peaks between 528 and 530 eV could be assigned to oxygen in the anatase TiO 2 crystal lattice (O L1 and O L2 ) 40.The peak at 531.2 eV corresponds to the oxygen bound to Ti , and its relative intensity is larger for 4 CuTiO 2 than for TiO 2 , further confirming more oxygen vacancies on the surface of 4 CuTiO 2 .The peak at 532.2 eV can be attributed to Ti OH species 41,42.For 4 CuTiO 2 , the Cu 2p XPS spectrum was also recorded.As shown in Fig. 5C, the binding energies of Cu 2p 1/2 at 952.2 eV and Cu 2p 3/2 at 932.3 eV, respectively, can be attributed to the Cu states ( 0 or 1) 43.It is difficult to distinguish Cu and Cu 0 because of a very small difference in binding energy between them.Thus, the Cu auger spectrum was also recorded, and the result shows in the inset of Fig. 5C.The modified Auger parameters are displayed in Table 2 44,45.The intensity of Cu Auger peaks is very weak, due to very low Cu atomic fraction on the surface of 4 CuTiO 2 .The kinetic energies of Cu LMM are about 916.5 and 918.3 eV, and the modified Auger parameters are 1848.8and 1850.6,showing the existence of Cu and Cu 0 on the surface of 4 CuTiO 2 .Satellite peak at 940-950 eV is not observed, suggesting no copper oxide on the surface of 4 CuTiO 2 .The atomic fraction of copper relative to Ti and O is about 0.8, and lower than theoretical value of 1.8, indicating copper atoms mainly stayed in the bulk of 4 CuTiO 2 .This is in line with the structural features of 4 CuTiO 2 .According to the results of EPR and XPS analysis, it can be concluded that the metallic Cu could promote the formation of oxygen vacancies, thus increasing the visible-light absorption of the photocatalysts. The metal-oxide interactions can change the electronic properties of metal and/or oxide at the interface 46,47.Georgi N. Vayssilov et al. found two types of Pt-CeO 2 interfacial interaction: (1) electron transfer from the Pt nanoparticles to CeO 2 , and (2) oxygen reverse spillover.Albert Bruix et al. found large electronic perturbations for small Pt particles in contact with ceria 48.It was also reported that Cu-TiO 2 interaction controlled the growth mode of copper on TiO 2 (110) 49.Recently, Yang and co-workers found electron transfer from the Cu nanoparticles to TiO 2 was monitored by two-photon photoemission spectroscopy.The highest occupied molecular orbital (HOMO) and the lowest unoccupied molecular orbital (LUMO) of TiO 2 are mainly composed of O 2p orbitals and Ti 3d orbitals, respectively.Electron transfer from Cu into TiO 2 LUMO with anti-bonding characteristics would weaken the bond of Ti-O, thus facilitating departure of the interfacial oxygen, which explain the increased oxygen vacancies in TiO 2 with metallic Cu The adsorption of reactants play a key role in catalysis/photocatalysis 1,505152.Suitable strength of adsorption bonds might be the key factor determining the reaction rates.In general, The CO 2 molecules could bind to the Ti 5f , oxygen vacancies and oxygen atoms through oxygen atoms, carbon atoms in CO 2 molecules, respectively 53.Binding energy of CO 2 on the oxygen vacancies is larger than that on the other two sites 54.From the results of EPR and XPS, the addition of metallic Cu increases the amounts of oxygen vacancies.In view of this, the adsorption of CO 2 on the surface of the photocatalysts was studied.Fig. 6 shows coverage vs. pressure of CO 2 on TiO 2 , 1 CuTiO 2 , 2 CuTiO 2 and 4 CuTiO 2 at room temperature.The uptakes of CO 2 increase with pressure.At pressure of about 9 kP a , which is almost equivalent to the pressure of CO 2 for the photoreduction, the uptake of CO 2 is about 77, 102, 95 and 121 mol/g for TiO 2 , 1 CuTiO 2 , 2 CuTiO 2 and 4 CuTiO 2 , respectively.The saturation coverage of CO 2 , obtained by extrapolating the coverage of isotherm to P CO 2 0, is 29, 47, 41 and 71 mol/g for TiO 2 , 1 CuTiO 2 , 2 CuTiO 2 and 4 CuTiO 2 , respectively.The saturation coverage for the 2 CuTiO 2 is lower than that for 1 CuTiO 2 and 4 CuTiO 2 due to its lower specific surface area.Obviously, the adsorption of CO 2 on the surfaces of photocatalysts is increased with the presence of metallic Cu nanoparticles. The transient photocurrent curves for TiO 2 , 1 CuTiO 2 , 2 CuTiO 2 and 4 CuTiO 2 under visible-light illumination (400 nm) are shown in Fig. 7 It is clear that the photocurrent density increases with the increase of Cu content in the photocatalysts.It is 0.2A cm -2 for TiO 2 , and increases to be about 1.1, 1.7 and 2.8 A cm -2 for 1 CuTiO 2 , 2 CuTiO 2 and 4 CuTiO 2 , respec-Fig.6. Coverage vs. pressure of CO2 on TiO2, 1 CuTiO2, 2 CuTiO2 and 4 CuTiO2 at room temperature.Fig. 7. Transient photocurrent curves in Na2SO4 aqueous solution (0.05 M) under visible light at -0.675 V vs. saturated calomel electrode (SCE) for the TiO2(a), 1 CuTiO2 (b), 2 CuTiO2 (c) and 4 CuTiO2 (d) photocatalysts. tively.It can be calculated that the transient photocurrent density for 4 CuTiO 2 is about 14-times of that for TiO 2 .The results suggest the higher efficiency of the separation of photogenerated electron-hole pairs in the CuTiO 2 .The enhanced electron-hole separation should be through trapping electrons by the metallic Cu with low Fermi energy level 55.In addition, the presence of a little Cu on the surface of CuTiO 2 might also have a positive effect on photogenerated charge separation 12, due to the possible formation of p-n heterojunctions between Cu 2 O and TiO 2 12.At the same time, it is assumed that the Cu is not main factor for the enhanced charge separation, since the atomic fraction of Cu on the surface of CuTiO 2 is very low. 3.5.Photoreduction of CO 2 in CO 2 /H 2 O (g) Fig. 8 shows the results for the photoreduction of CO 2 with H 2 O (g) on TiO 2 , 1 CuTiO 2 , 2 CuTiO 2 and 4 CuTiO 2 under visible-light irradiation.For comparison, commercial P25 was also used to photocatalystic reduction of CO 2 .In addition to oxygen, carbon monoxide and methane were the main products for the photoreduction of CO 2 under visible-light irradiation in this work.The yields of CO and CH 4 increase with irradiation time from 1 to 6 h.The yields of CO and CH 4 at irradiation time of 1 h were close for the four photocatalysts, and the difference in them gets larger with time.At 6 h, the yield of CO was monitored to be 0.1, 0.57, 0.62, 0.72 and 0.97 mol, and the yield of CH 4 was about 0.03, 0.09, 0.12, 0.14 and 0.16 mol for P25, TiO 2 , 1 CuTiO 2 , 2 CuTiO 2 and 4 CuTiO 2 , respectively.When normalized to measured BET surface areas of the photocatalysts, the CO yield on TiO 2 , for example, is half of that on 1 CuTiO 2 , fifth of that on 2 CuTiO 2 and threesevenths of that on 4 CuTiO 2 at 6 h photoreaction of CO 2 .Clearly, the metallic Cu nanoparticles in TiO 2 have a positive effect on the photoreduction of CO 2 under visible-light irradiation.Defect-free anatase TiO 2 has little photocatalystic activity under visible-light irradiation due to its large band gap.In 2011, Chen et al. reported \"black\" TiO 2 , which exhibits high activity for water splitting under visible-light irradiation 28.Based on this finding, seemingly identical black TiO 2 were produced through TiO 2 reduction treatment, such as vacuum annealing, electrochemical reduction, Ar/H 2 reduction, and so on 565758.In our work, the vacuum annealing was used to avoid the oxidation of metallic Cu in synthesis procedure of the TiO 2 and CuTiO 2 .Thus, the black TiO 2 with amounts of oxygen vacancies is obtained and has photoactivity for CO 2 reduction under visible-light irradiation.On the other hand, the vacuum annealing for TiO 2 and CuTiO 2 allowed us to monitor promotion of metallic Cu to the formation of oxygen vacancies in TiO 2 , leading to stronger visible-light absorption of CuTiO 2 and adsorption of CO 2 on their surfaces.It is generally accepted that the stronger light absorption, the more photogenerated electron-hole pairs 59.Therefore, the enhanced visible-light absorption must be a reason for increased photoactivity of CuTiO 2 for CO 2 reduction.Moreover, the reactant adsorption is sometimes the rate-limiting step in catalysis.The uptake of CO 2 on 1 CuTiO 2 is higher than that on 2 CuTiO 2 , but the case is reverse for the yields of CO and CH 4 on the two photocatalysts.Based on the results, we assume that the adsorption of CO 2 might not be a key factor on the photoreduction of CO 2 in this work. In addition to the generation of electron-hole pairs, their separation also plays a key role in photocatalysis.Scheme 1 shows possible transfer of photogenerated electron between metallic Cu and TiO 2 .Femri level of Cu locates at -4.65 eV, and the potential of conduction band edges of anatase TiO 2 is -4.21 eV.Thus, the photogenerated electrons of anatase TiO 2 can surmount the Schottky barrier and transfer to the metallic Cu under light irradiation.Meanwhile, more potential energy would be needed if the transferred electrons come back to conduction band of TiO 2 .As the number of transferred electrons in Cu increases, the Femri level of Cu would gradually increases and reaches a maxima, which ultimately results in an equilibrium of electron transfer between metallic Cu and TiO 2 .Based on the analysis, it could be said that the presence of metallic Cu facilitates photo-generated electron-hole pairs separation in CuTiO 2 , as evidenced by transient photocurrent measurement.Therefore, the increased photo-generated charge separation in the work should be another reason for the enhanced activity of CuTiO 2 for the reduction of CO 2 . Stability of a catalyst is an important criterion for evaluating its superiority.The activity of 4 CuTiO 2 was monitored for four successive cycles.As shown in Fig. 9, slight decrease in activity is observed.In addition, two control experiments were performed: (1) visible light irradiation in the absence of catalyst, and (2) irradiation of catalyst and H 2 O vapor with visible light in the absence of Fig. 8.The yields of CO (A) and CH4 (B) products under visible light irradiation for the TiO2, 1 CuTiO2, 2 CuTiO2 and 4 CuTiO2 photocatalysts in CO2/H2O(g).CO 2 .CO and CH 4 products were not monitored by gas phase analysis in the two experiments, confirming the photocatalytic conversion of CO 2 ."
  },
  {
    "title": "Conclusions",
    "content": "In summary, black TiO 2 -coated Cu nanoparticles (CuTiO 2 ) were fabricated in the work.The TiO 2 coating protects the metallic Cu nanoparticles from oxygen oxidation under the photocatalytic reaction condition.TiO 2 annealed under vacuum shows strong absorption in visible-light region, while the addition of metallic Cu nanoparticles further enhances the visible-light absorption of TiO 2 .Electron paramagnetic resonance and X-ray photoelectron spectroscopy analyses reveal a large amount of oxygen vacancies presents in the bulk and on the surface of TiO 2 .The metallic Cu nanoparticles promote the formation of oxygen vacancies in TiO 2 through the metal-oxide interaction, which accounts for the enhanced visible-light absorption of CuTiO 2 .Moreover, the enhanced amounts of oxygen vacancies lead to an increase in the adsorption of CO 2 on the surface of CuTiO 2 as compared to black TiO 2 .Transient photocurrent measurements indicate the addition of the metallic Cu effectively increases the separation of photogenerated electron-hole pairs of TiO 2 through trapping electron.The photocatalytic activity for CuTiO 2 (4 Cu) reaches 1.7 times of that for its counterpart, bared black TiO 2 , which is attributed to the charge-separation and the visible-light absorption enhancements in CuTiO 2 nanoparticles.The present work provides a new and efficient strategy for protection of metallic Cu against oxidation, leading to improved photocatalytic activity. Fig. 1.The XRD patterns of Cu/A2lO3 (a) and Cu NPs (b) reduced in H2 at 523 K.The reduced samples were immersed in paraffin liquid without exposing to air before the XRD measurements. Fig. 2.The XRD patterns of the used TiO2 (a), 1 CuTiO2 (b), 2 CuTiO2 (c) and 4 CuTiO2 (d) photocatalysts. Fig. 3. TEM and HRTEM images of the used 4 CuTiO2 (SAED pattern corresponding to the region highlighted by the dashed box in (B)). Fig. 4. (A) UV-vis diffuse reflectance and (B)EPR spectra for the TiO2, 1 CuTiO2, 2 CuTiO2 and 4CuTiO2 photocatalysts (the inset of Fig.4Ashows the photograph of photocatalysts). Fig. 5. (A) Ti 2p, (B) O 1s and (C) Cu 2P core level XPS spectra of the TiO2 and 4CuTiO2 photocatalysts.The inset of Fig.5Cshows the Cu spectrum for 4 CuTiO2 photocatalyst. Scheme 1. possible transfer of photogenerated electron in CuTiO2 under light irradiation. Fig.9.The photocatalytic stability of 4 CuTiO2 in four cycles. Summary of the XPS data for the TiO2 and 4 CuTiO2 photocatalysts. 44 h (KE CuLMM -KE Cu 2p3/2)44. Financial support by the National Nature Science Foundation of China (Grant No. 21173261), the CAS/SAFEA International Partnership Program for Creative Research Teams, the \"Western Light\" Program of Chinese Academy of Sciences (XBBS201408) and the Excellent Youth Foundation of Xinjiang Uygur Autonomous Region (2013711004) is gratefully acknowledged."
  }
]