[
  {
    "title": "Doi",
    "content": "10.1039/b613098d"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic reduction of carbon dioxide using sol-gel derived titania-supported CoPc catalysts"
  },
  {
    "title": "Abstract",
    "content": "CoPc loaded titania was synthesized by an improved sol-gel method using a homogeneous hydrolysis technique.The grain size of TiO 2 and CoPc-TiO 2 was uniform and average diameters were less than 20 nm.Both catalysts had two crystal phases, of which rutile accounted for about 28.When they were used for the photoreduction of CO 2 in NaOH solution under ambient conditions, the formate yield was significantly higher than that of the others, such as formaldehyde, methanol and so on.In order to increase the activity of the photocatalysts some factors were optimized, including the quantity of CoPc-TiO 2 catalyst, concentration of Na 2 SO 3 hole scavenger, concentration of the NaOH solution and irradiation time.Under the optimal conditions, the gross photocatalytic reduction of CO 2 was 1032 lmol (g cat) -1 .Furthermore, the yield of CH 4 did not increase in the presence of CH 3 OH or HCHO, showing that the generation of CH 4 from CO 2 did not proceed via methanol as an intermediate under these conditions."
  },
  {
    "title": "Experimental",
    "content": "Catalysts were prepared at room temperature using a sol-gel method, as illustrated in Fig. 1.The precursor was titanium(IV) butoxide (Ti(OC 4 H 9 ) 4 , 97).Ti(OC 4 H 9 ) 4 was dissolved in anhydrous ethanol, and then mixed with acetic acid and a little hydrochloric acid under stirring.To avoid precipitation during polycondensation and the formation of unstable colloidal sols, the hydrolyzing water was homogeneously released by the esterification of ethanol and acetic acid. 13CoPc was added into Fig. 1 The procedure for the preparation of the catalysts. the transparent solution during stirring for well-proportioned dispersion on the surface of TiO 2 .The transparent solution was stirred at room temperature for 8 h to stabilize it, and then left at room temperature for aging for 24 h.Subsequently the transparent sol was dried at 150 C, and calcined to burn off hydrocarbons.The obtained sample was finally grounded into powder in a mortar.The BH-1 titania powder was obtained from Beijing titania powder factory and used in the comparison experiments. In order to determine the crystal phase of TiO 2 photocatalysts, X-ray diffraction (XRD) measurements were carried out on a Rigaku 2304 diffractometer with CuKa radiation (Ni-filtered).The specific surface area of the catalysts (S BET ) was also measured. The photocatalytic reaction was carried out in a Pyrex cell (the volume of the solution was 100 ml).The catalyst powder was suspended in 100 ml of NaOH solution.Illumination was performed with a 500 W tungsten-halogen lamp.The reactor was tightly closed during the reaction and the reaction mixture stirred continuously using a magnetic stirring bar to prevent sedimentation of the catalyst; CO 2 was then bubbled through the reactor for at least 30 min to purge air and to saturate the solution.Formate, formaldehyde and methanol were indirectly estimated by UV-VIS spectrophotometry.The yield of CH 4 and CO were analyzed in a GC-TCD equipped with a 2 m carbon molecular sieve column, while the minor components such as H 2 , O 2 were not detected. A blank reaction was conducted to ensure that hydrocarbon production was due to the photoreduction of CO 2 , and to eliminate surrounding interference.The first blank test was illuminated using visible light without the catalyst, the second was kept in the dark in the presence of the catalyst and CO 2 under the same experimental conditions.The third was illuminated using visible light in the presence of the catalyst, while flowing N 2 rather than CO 2 .No product was detected in all of the above three blank tests.This showed that the reaction demanded catalyst and illumination, and that the products were obtained by the photocatalytic reduction of carbon dioxide in NaOH solution."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The crystallinity of as prepared samples was examined by XRD analysis.This showed that calcinated samples mainly crystallized in the anatase phase and the rutile form was present only in a small quantity, as depicted in Fig. 2. The peaks at 2h values of 24.88, 37.42, 47.66, 53.49, 54.51, 62.29, 68.55, 69.97 and 74.69 were identified by comparison with literature data and confirmed that the particles were polycrystalline with anatase structure corresponding to the diffractions of (1 0 1), (0 0 4), (2 0 0), (1 0 5), (2 1 1), (2 0 4), (1 1 6), (2 2 0), and (2 1 5), respectively.It is noteworthy that the diffractograms of the samples did not present signals of CoPc.The absence of CoPc peaks could be attributed to lower loading quantity or completely dispersion of CoPc onto TiO 2 .From the hydrolysis process of titanium butoxide shown in Fig. 3 it can be seen that some of CoPc could be encapsulated in TiO 2 particles.Also, as it can be seen from Fig. 2, the rutile phase was found both in sol-gel TiO 2 and in CoPc-TiO 2 catalysts at lower temperature (400 C), with more rutile phase observed in CoPc-TiO 2 than in TiO 2 .The reason may be that the dispersive CoPc could cause lattice disfigurement in TiO 2 in which the rutile phase was much more prior to grow than the anatase phase. The influence of the catalysts.Fig. 4 shows the photocatalytic activity of TiO 2 , titania-supported CoPc prepared using the modified sol-gel method, and TiO 2 (BH-1) for the photocatalytic reduction of carbon dioxide in NaOH aqueous medium at ambient conditions under 10 h of irradiation.TiO 2 particles (this work) with CoPc show a higher photocatalytic activity than undoped TiO 2 and TiO 2 (BH-1), and the optimal CoPc loading was found to be 0.5 wt.The products of the photoreduction of CO 2 in NaOH solution exhibited a dependence on the catalyst.The formation of formic acid was found to be much more pronounced on supported CoPc-TiO 2 catalysts.At the same time, carbon monoxide, methane, formaldehyde and methanol were generated, but their quantities were smaller than that of formic acid.Table 1 shows that the titania-supported CoPc has a smaller crystallite size and larger surface area (S BET ).Zhang et al. suggested that pure TiO 2 grains with a diameter rank from 11 to 21 nm exhibit the maximum photocatalytic efficiency. 14When the particle size was less than 5-10 nm, the surface recombination of electron-hole pairs becomes significant, resulting in low photocatalytic efficiency.The specific surface area of sol-gel derived catalysts was larger than that of commercial TiO 2 (BH-1), that of 0.5 wt CoPc-TiO 2 up to nearly 91 m 2 g -1 . Similar to the description by Jin, 15 the crystal lattice disfigurement of TiO 2 increased in the presence of FePc being the larger diameter, which goes against the growth of TiO 2 crystallites.However, much more FePc might turn into polymers, which benefit the crystallization of TiO 2 on them, and then their sizes could grow further.Therefore, 0.5 wt CoPc-TiO 2 had a smaller crystallite size and a larger specific surface area (S BET ) than unloaded TiO 2 while 1.0 wt CoPc-TiO 2 had a larger crystallite size and less specific surface area (S BET ) than 0.5 wt CoPc-TiO 2 .On the other hand, sol-gel TiO 2 and CoPc-TiO 2 catalysts were composed of two crystal phases and contained some rutile phase.Generally, the presence of two phases might benefit to the separation of photogenerated electrons and holes, which results in high photocatalytic activity. 16The modified homogeneous hydrolysis process may also produce uniform crystallites and enhance the photocatalytic activity of the prepared TiO 2 powders.The contact of TiO 2 and CoPc generally involves redistribution of electric charge.Because the oxidation potential of S 1 of CoPc is higher than the conduction band (CB) of TiO 2 , while the energy of T 1 is lower than the conduction band of TiO 2 , it is thermodynamically possible that CoPc transfers electron to the conduction band of TiO 2 ; at the same time CoPc is oxidized to CoPc .This process can be shown as follows: CoPc(S 1 ) TiO 2 (CB) CoPc rapidly transfers excited electrons to TiO 2 , and then CO 2 adsorbed on the TiO 2 surface can be reduced by accepting electrons.This significantly promotes the separation of holes and electrons, and then greatly enhances the photoreduction efficiency of CO 2 in H 2 O. Fig. 5 illustrates the photocatalytic reduction of carbon dioxide in NaOH aqueous medium (100 ml) as the CoPc-TiO 2 quantity was varied in the range of 0-0.3 g in order to optimize the catalyst loading during the irradiation process.As can be seen, there was a rapid increase in the yield of photoreduced products when the TiO 2 loading increased up to 0.25 g.Above this value, the decrease of photoreduction products may be attributed to the scattering effect of light caused by the high concentration of TiO 2 , which may prevent light from reaching each particle and increase the probability of recombination of holes and electrons.Under dark conditions, the formation of photoreduced products was not detected, indicating that the reaction proceeded photocatalytically. The influence of NaOH.The effect of NaOH was significant in the photoreduction of CO 2 . 17Firstly, OH -ions provided by NaOH in aqueous solution could act as a strong hole scavenger and form OH radicals, thereby reducing the recombination of hole-electron pairs.The longer decay time of surface electrons would facilitate the reduction of CO 2 .Secondly, caustic NaOH solution can dissolve more CO 2 than pure water because dissolved CO 2 and OH -ions can transform into CO 3 2-, and further into HCO 3 -in the CO 2 saturated system.Therefore, in caustic NaOH solution, CO 2 exists in many forms, namely HCO 3 -, CO 3 2-and CO 2 .Notably, the photoreduction may be accelerated by the high concentration of HCO 3 -.This phenomenon was also shown by Tseng et al. 18 .The remarkably increase in the yield of HCOOH, HCHO, and so on with the addition of NaOH in this work, can be ascribed to the above two reasons.Fig. 6 indicates that the yield of the photoreduction of CO 2 increased when the concentration of NaOH increased up to 0.15 M. The decrease of photoreduced products for NaOH 0.25 M may be due to the greater amount of OH radicals which can oxidize the species in the reactor. Fig. 6 The influence of NaOH concentration on the photocatalytic reduction of carbon dioxide. In order to improve the efficiency of the photocatalytic reaction, Kamat 19 reported the necessity of scavenging one of the charge carriers to accumulate the counter charge carrier within the semiconductor particles.Though some reports 17,18,20,21 suggested that organic compounds such as 2propanol and oxalic acid possess a higher efficiency than other hole scavengers for the photoreduction system, in view of the possible interference with the detection of the products, Na 2 SO 3 was selected as the hole scavenger in the present investigation.The effect of Na 2 SO 3 in the concentration range of 0.04-0.24M in NaOH was investigated and the dominant products obtained were formic acid along with Na 2 SO 4 due to the corresponding oxidation of Na 2 SO 3 .The influence of Na 2 SO 3 on the yield of the photoreduced products is shown in Fig. 7.However, the photocatalytic reduction of carbon dioxide was not efficient in the absence of Na 2 SO 3 .Also, it is clear that the formation of photoreduced products increased with the concentration of the hole scavenger.In this process, there was the appearance of H Fig. 7 The influence of Na 2 SO 3 concentration on the photocatalytic reduction of carbon dioxide. when photoexcited positive holes (h ) can be absorbed by the hole scavenger Na 2 SO 3 , and then H is further reduced to H , which can hydrogenate the species of CO 2 .However, the yield of photoreduced products was almost constant when the Na 2 SO 3 concentration exceeded 0.1 M. The reason may be that the excess of electrons derived from Na 2 SO 3 exceed the need of holes in NaOH solution. In order to determine the optimal irradiation time, the effect of the irradiation time on the formation of the photoreduced products was investigated over a period of 6-50 h and the results are illustrated in Fig. 8.The gross yield in the CO 2 saturated system increased rapidly with the photolysis time at early stage, as more photo-electrons were generated with increasing time of light exposure.After 20 h irradiation, the gross yield approached its limit.A similar trend was also observed for HCOOH and CO.This can be attributed to the saturation of the adsorption sites on the surface of TiO 2 with intermediate products.The yield of formaldehyde continued to decrease after 20 h due to its consumption as an intermediate product.At the same time, the yield of CH 4 and CH 3 OH continued to increase to some extent because CH 4 and CH 3 OH, as the upper deoxidized species in the photocatalytic reduction of CO 2 , could not be consumed.In such a system, the photoactivity is usually presented by product yield, e.g.lmol (g cat) -1 , while the quantum efficiency or photonic efficiency is not accessible because of scattering/reflection of the incident light by TiO 2 semiconductor particles. 22So we do not report the quantum yield of the reduction products in the present study.Under the optimal conditions, i.e., 0.15 mol l -1 (100 ml) NaOH, CoPc-TiO 2 0.25 g, 0.1 M Na 2 SO 3 , 20 h of irradiation time, the gross yield of photocatalytic reduction of CO 2 was 1032 lmol (g cat) -1 . From the above results and literature reports, a reaction scheme for the photocatalytic reduction of carbon dioxide in NaOH solution is proposed as follows.Photoexcited electrons (e -) and positive holes (h -) are produced when incident photons are absorbed in CoPc-TiO 2 , and then transfer to TiO 2 and CoPc respectively (eqn (4)).Therefore, the photoexcited electrons and holes in the lattices are separated and trapped by appropriate sites of CoPc-TiO 2 to avoid recombination.CO 2 molecules adsorbed on the surface of TiO 2 gain electrons and are reduced to CO, CH 4 , HCOOH, HCHO, CH 3 OH, and so on.At the same time, photoexcited positive holes (h ) can be converted by the hole scavenger Na 2 SO 3 to H (eqn (5)), which is reduced to H by e -, and then hydrogenates the species of CO 2 . CoPc(S 0 ) hm CoPc(S 1 ) CoPc(S 1 ) TiO 2 (CB) h (CoPc/VB) e -(TiO 2 /CB) (4) Furthermore, it is suggested that the interaction of CO 2 molecules with the excited state of CoPc-TiO 2 leads to the formation of CO 2 anion radicals, which are reduced further to HCOO -or CO (eqn (7)-( 9)).However, the yield of HCOO -exceeded that of CO in our present work.Possible explanations are: (i) the CO 2 anion radical formed in solvents of high dielectric constant such as water exhibits weak interaction with the photocatalyst surface, but is greatly stabilized by solvents, then the carbon atom of CO 2 tends to give formate, as described by Liu et al.; 23 (ii) the overpotential of CO 2 /HCOOH is lower than that of CO 2 /CO, consequently, HCOOH is more easily available by reduction (eqn (10) and ( 11)).Therefore, the predominant HCOO -in the solution can be further transformed into HCHO and CH 3 OH, as shown in eqn (12) and eqn (13). CO 2 -(ad) H e - HCOO - CO 2 -(ad) H e - CO OH - or CO 2 -(ad) CO 2 e - CO CO 2- 3 ( 9) HCOO - 2H 2e - HCHO ( 12) The photoreduction of CO 2 with H 2 O proceeds through CO 2 -HCOO -/HCOOH-HCHO-CH 3 OH-CH 4 , as reported elsewhere. 2,18,24-27If so, it should be possible to produce methane by a two-electron reduction of methanol because methanol is an intermediate for methane formation from CO 2 .Likewise, CH 3 OH could also enhance the yield of CH 4 when HCHO is added.Hence, we performed some experiments to validate the present mechanism in the presence of CoPc-TiO 2 .The results obtained are listed in Table 2.As can be seen, the yield of CH 4 remained almost unchanged in the presence of CH 3 OH.However, the increase in the yield of HCHO and HCOOH is thought to be due to the degradation of CH 3 OH with OH in NaOH solution.Similarly, the presence of HCHO had almost no influence on CH 4 but had a significant effect on HCOOH and CH 3 OH, which were gained through the redox process.These results suggested that methanol may not be an intermediate in the reduction of CO 2 under those conditions in accordance with the mechanism reported by Dey et al. 28 It is probable that CH 4 was obtained from C radicals by a methanation process rather than from HCO 3 -or CO 3 2-. 1,29However, the detailed and exact mechanism needs to be examined further."
  },
  {
    "title": "Conclusions",
    "content": "CoPc loaded TiO 2 prepared using a modified sol-gel method was found to be highly active towards the photoreduction of CO 2 in NaOH solution under mild conditions of normal pressure and room temperature.Formic acid, formaldehyde, methanol, methane and carbon monoxide were favourably produced on TiO demonstrated that the homogeneous hydrolysis of titanium(IV) butoxide via the improved sol-gel route is a promising technique for preparing photocatalysts with uniform nanoparticles.CoPc loaded titania was a highly efficient photocatalyst for CO 2 reduction since photoconductive CoPc is prone to transfer electron to TiO 2 under irradiation, and able to reduce the recombination of electron-hole pairs.OH -and Na 2 SO 3 in aqueous solution were found to be powerful hole scavengers, enhancing the photocatalytic reactivity.The CO 2 reduction did not occur in the absence of light and occurred to a less extent in the absence of a hole scavenger.However, an excess of OH -would decrease the products owning to its oxidation.It is suggested that the methane is formed in this system through a C generation mechanism rather than CO 2 -HCOO -/HCOOH-CH 3 OH-CH 4 . Fig. 2 XRD spectra of TiO 2 and CoPc-TiO 2 .(a) CoPc; (b) 1.0 wt CoPc-TiO 2 ; (c) 0.5 wt CoPc-TiO 2 ; (d) TiO 2 (this work); (e) TiO 2 (BH-1). Fig. 3 Processes involved in titanium butoxide hydrolysis. Fig. 4 The influence of various catalysts on the photoreduction of CO 2 .(A) TiO 2 (BH-1), (B) TiO 2 (this work), (C) 0.5 wt CoPc-TiO 2 , (D) 1.0 wt CoPc-TiO 2 . Fig.5 The influence of the catalyst amount on the photocatalytic reduction of carbon dioxide. Fig.8 The influence of the irradiation time on the photocatalytic reduction of carbon dioxide. Photochem.Photobiol.Sci., 2007, 6, 695-700 699 The structure parameters of nanosized TiO 2 30/m 2 g -1 Anatase crystallite size/nm Rutile phase component b () Reduction gross products/lmol (g cat) -1 a Estimated from FWHM of XRD using the Scherrer equation.bCalculated from the relative peak intensity of anatase and rutile forms.30 The yield of the photoreduction of CO 2 Reaction conditions: 0.1M NaOH solution (100 ml), 0.15 g CoPc-TiO 2 , 10 h. a b -indicates not detected."
  }
]