[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2017.10.053"
  },
  {
    "title": "Article_Title",
    "content": "Enhancement of CO2 reduction activity under visible light irradiation over Zn-based metal sulfides by combination with Ru-complex catalysts"
  },
  {
    "title": "Abstract",
    "content": "Hybrid photocatalysts composed of metal sulfide semiconductors combined with various Ru-complex catalysts were synthesized for use during visible light-driven CO 2 reduction with powder suspension systems.A variety of Zn-based sulfides, including Ni-doped ZnS, (CuGa) 0.8 Zn 0.4 S 2 and (AgIn) 0.22 Zn 1.56 S 2 , were adopted by conducting the CO 2 reduction reaction in acetonitrile containing an electron donor.The photocatalytic activities were found to be largely dependent on the basic characteristics of the Ru-complex and the metal sulfide.The results demonstrate that several of these sulfide semiconductors improve the CO 2 reduction selectivity when employed in the semiconductor/metal-complex system, and that (AgIn) 0.22 Zn 1.56 S 2 or Ni (0.2 mol)-doped ZnS combined with a neutral Ru-complex incorporating a phosphonate ligand Ru(4,4-diphosphonate-2,2-bipyridine) (CO) 2 Cl 2 exhibit the highest CO 2 photoconversion activity when synthesizing formic acid, with a turnover number above 100, which catalysts were stable for 16 h irradiation.These results suggest that metal sulfides are potential candidates for use in powdered semiconductor/metal-complex systems for selective CO 2 photoreduction."
  },
  {
    "title": "Experimental",
    "content": "Ni-doped ZnS (0.2 mol Ni) 21 was prepared by mixing an aqueous solution of Zn(NO 3 ) 2 and Ni(NO 3 ) 2 with an aqueous solution of Na 2 S at room temperature.The resulting precipitate was washed with distilled water, filtered and dried in air, then heated at 773 K for 2 h under an Ar flow.Non-doped ZnS was also prepared using an aqueous Zn(NO 3 ) 2 solution and employing the same method.(CuGa) 0.8 Zn 0.4 S 2 24 and (AgIn) 0.22 Zn 1.56 S 2 25,26 were prepared according to previously reported procedures. Ru(4,4-dicarboxy-2,2-bipyridine) 2 (CO) 2 2 (Ru(dcbpy) 2 ) 5, (4,4-diphosphonate-2,2-bipyridine)(CO) 2 2 (Ru(dpbpy)-(bpy)) 6, Ru (4,4-diphosphonate-2,2-bipyridine)(CO) 2 Cl (Ru(dpbpy)) 32, Ru (4,4-dicarboxy-2,2-bipyridine)(CO) 2 Cl (Ru(dcbpy)) 32, Ru(2,2-bipyridine) and Ru4,4-di(1H-pyrrolyl-3-propyl carbonate)-2,2-bipyridine(CO)(MeCN)Cl 2 (Ru(pypcbpy)) 33 were synthesized according to previously reported methods. Hybrid photocatalysts consisting of a Ru-complex (Ru(dcbpy) 2 , Ru(dpbpy)(bpy), Ru(dpbpy), or Ru(dcbpy)) and a metal sulfide were prepared by adsorption of the Ru-complex.A mixture of the metal sulfide powder (200 mg) and a solution of the Ru-complex (0.4 mg) in methanol (5 mL) was stirred overnight under dark conditions.The solution was subsequently filtered, washed with methanol and dried under vacuum at 313 K.The absorption spectra of these solutions after filtration were acquired using a UV/vis spectrophotometer (Shimadzu, UV-3600) and the amount of Ru-complex adsorbed on the metal sulfide was calculated from each spectrum. A hybrid photocatalyst consisting of Ru(pypcbpy) and ZnS:Ni was prepared by photopolymerization of the Ru-complex.A mixture of ZnS:Ni powder and Ru(pypcbpy) (0.4 mg) in acetonitrile (5 mL) was stirred overnight under fluorescent lamp irradiation.The post-processing method was the same as that described above for the adsorption method. The crystal structures of the samples were assessed using X-ray diffraction (XRD, Rigaku, Ultima IV) with Cu K radiation at 40 kV and 40 mA.Surface areas were determined by BET measurement (Coulter, SA3100).The chemical structures of the hybrid photocatalysts were characterized using diffuse reflectance infrared Fourier transform spectroscopy (DRIFTS; JASCO, JNM-LA500).Diffuse reflection spectra were obtained using a UV-vis-NIR spectrometer (JASCO, V-780) and were converted from reflectance to absorbance by the Kubelka-Munk method.X-ray photoelectron spectroscopy (XPS; Ulvac-Phi Quantera SXM) was also conducted, with monochromated Al K radiation. The photocatalytic activity of each hybrid photocatalyst was measured under ambient pressure in an 8 mL test tube containing 4 mL of a dry acetonitrile (MeCN)-triethanolamine (TEOA) mixture (5:1 by volume) and 8 mg of the photocatalyst.After purging with CO 2 for 15 min, the suspension was irradiated in a rotating apparatus using a 500 W Xe lamp (Ushio UXL-500SX), equipped with filters to produce visible light in the range of 390 750 nm at 31 mW/cm 2 for 16 h at room temperature, in the same manner as reported in a previous study 6.The amount of product obtained was determined by gas chromatography (Shimadzu, GC-14A) and ion exchange chromatography (Dionex, ICS-2000). To detect the formation of H 13 COOH, an ion chromatograph interfaced with a time-of-flight mass spectrometer (IC-TOFMS, JEOL JMS-T100LP) was used, with MeOH as the mobile phase."
  },
  {
    "title": "Results_and_Discussion",
    "content": "To investigate the feasibility of using metal sulfide semiconductors in hybrid photocatalysts, the visible light photoactive n-type material Ni (0.2 mol)-doped ZnS ZnS:Ni (0.2) 21, with an energy gap of 2.3 eV, was selected.The crystalline structure and morphology of the ZnS:Ni were confirmed by X-ray diffraction (XRD) and field emissionscanning electron microscopy (FE-SEM).The material was found to consist of a mixture of zinc-blende and a small amount of wurtzite, with cubic particles having diameters in the range of 30-100 nm (Figs.S1 andS2).The BET surface area of the material was also estimated to be 6.4 m 2 /g.Although the energy level of the conduction band minimum of this semiconductor (E CBM -1.3V vs. NHE), composed of Zn 4s4p orbitals 16, is sufficient to promote the transfer of electrons from the conduction band to the Ru-complex catalyst, CO 2 photoreduction did not proceed in MeCN/TEOA solutions in a previous study using Ru (dcbpy) 2 /ZnS:Ni 4.In the present work, ZnS:Ni in powder form was synthesized according to the solution method reported by Kudo et al. 21. The optimal combination of ZnS:Ni and a Ru-complex was ascertained by investigating five different Ru-complex catalysts with various anchors (phosphonate or carboxylate), charges (neutral or cationic), and CO 2 reduction potentials (-1.0 to -0.6 V vs. NHE, 5) (Fig. 1 and Table 1).The potentials of catalytic CO 2 reduction were measured by cyclic voltammograms in MeCN purged with CO 2 .All these factors are known to affect the efficiency of electron transfer during the CO 2 reduction reaction over the complexes. The chemical structures of the hybrid catalysts prepared by adsorption of Ru-complex onto ZnS:Ni were characterized using DRIFTS and successful modification of Ru-complex were confirmed (Fig. S3).The amounts of loaded Ru-complex catalysts on ZnS:Ni were also calculated to be 0.05-0.07wt as shown in Table 2.The UV-vis diffuse reflectance spectra of before and after modification of Ru-complex onto the semiconductor were almost same, because the absorption peaks of Ru-complex were completely overlapped with ZnS:Ni due to low amount of the Ru-complex (Fig. S4).These results indicate that ZnS:Ni plays a significant role as the light absorber of these hybrid photocatalysts. CO 2 photoreduction over each ZnS:Ni/Ru-complex hybrid photocatalyst was performed in a MeCN solution containing TEOA as an electron donor under visible light irradiation ( 390 nm) for 16 h, similar to the approach used with previous N-Ta 2 O 5 and C 3 N 4 and other powdered systems 56713,14,30,34.It was reported that solubility of CO 2 in MeCN was more than eight times higher than that in aqueous solution 35, and it is considered to be effective solvent for CO 2 reduction.To clarify the effect of the modification of Ru-complex, the Rucomplex catalyst turnover number (TON) was calculated on the basis of the product produced by Ru-complex (deducted from the amount of the product produced by the originated semiconductor).As shown in Table 2, unmodified ZnS:Ni was found to promote H 2 evolution by proton reduction but not CO 2 photoreduction (entry 1).In this case, the proton source for the synthesis of H 2 is believed to have been the TEOA, judging from previous results reported in the literature 5.In addition, the Ru-complex alone did not show photocatalytic activity (entry 2).The use of a cationic Ru-complex with carboxylate groups (Ru (dcbpy) 2 ), which has been reported to be highly effective in conjunction with N-Ta 2 O 5 5, generated very little photocatalytic CO 2 reduction but produced more H 2 than unmodified N-Ta 2 O 5 (entry 3), which was consistent with the previous study 36.A Ru-complex with a similar structure, Ru(4,4-dicarboxy-2,2-bipyridine)-(2,2-bipyridine) (CO) 2 2 , did not yield CO 2 reduction products, in keeping with previously reported results 5.These data indicate that the combination of cationic Ru-complexes having carboxylate anchors with ZnS:Ni does not photoreduce CO 2 .The CO 2 reduction potential at the Ru-complex is important because the activity is determined by the extent to which the Ru-complex receives electrons from the photoexcited semiconductor in the semiconductor/metal-complex hybrid 5,6,9,10.Interestingly, even though the CO 2 reduction potential (-0.8 V vs. NHE) was unchanged from that of Ru(dcbpy) 2 (Table 1), the substitution of a phosphonate anchor for a carboxylate group on one of the bipyridine ligands (that is, the use of Ru(dpbpy)(bpy)) greatly enhanced the rate of CO 2 reduction to produce HCOOH and CO (entry 4).The neutral Ru (dpbpy) complex possessing phosphonate anchors generated the highest TON (equal to the HCOOH/Ru(dpbpy) ratio) among the photocatalysts evaluated in this work.A TON value of 104 was obtained after 16 h of irradiation, indicating greatly improved selectivity for HCOOH and CO as opposed to H 2 , even though the Ru(dpbpy) had the most negative CO 2 reduction potential (-1.0 V) (entry 5).These results suggest that the photocatalytic activity might be dependent on the nature of the Ru-complex, such as its charge state, because in a control experiment under dark conditions, no products were generated (entry 6).The replacement of the phosphonate anchor with a carboxylate group decreased the CO 2 reduction activity, such that the TON for HCOOH decreased from 104 for Ru(dpbpy)/ZnS:Ni to 26 for Ru (dcbpy)/ZnS:Ni (entry 7).Assessing the effect of the charges of Rucomplexes with the same phosphonate anchors, the TON for HCOOH obtained from the neutral Ru-complex (Ru(dpbpy)/ZnS:Ni) was approximately three times that of the cationic Ru(dpbpy)(bpy)/ZnS:Ni.However, ZnS:Ni modified with the neutral Ru-complex possessing the most positive CO 2 reduction potential of -0.6 V vs. NHE (Ru (pycbpy)) showed a TON of only 23 for HCOOH generation (entry 8), similar to the values obtained from Ru(dpbpy)(bpy) and Ru(dcbpy).This result is discussed in more detail further on. Fig. 2 shows the progress of CO 2 reduction over a Ru(dpbpy)/ ZnS:Ni hybrid photocatalyst under visible light irradiation.The catalyst maintained its photoactivity over an irradiation time span of 16 h.Xray photoelectron spectroscopy (XPS) analyses of the photocatalyst before and after the reaction demonstrated that there was only minimal change in the oxidation state of S 2-ions and Ru ions in the ZnS:Ni after the photoreaction (Fig. S5).We also confirmed that the Ru-complex did not form Ru polymer 37 during photocatalytic reaction by measurement of UV-vis diffuse reflectance spectroscopy (Fig. S6).These results indicate that the hybrid photocatalyst was stable over this length of time.Assuming a monolayer modification of Ru(dpbpy) on the surface of ZnS:Ni, coverage of Ru(dpbpy) was estimated to be only 4.It is wort noting that the slight amounts of Ru-complex molecular catalyst works efficiently as CO 2 reduction site on semiconductor surface. Isotope tracer analyses using 13 CO 2 also confirmed that the HCOOH was produced from CO 2 molecules dissolved in the solutions (Fig. 3).In the case of a photocatalytic reaction under 12 CO 2 , a clear peak at m/ z 45 due to formate ions containing 12 C is observed.In contrast, under a 13 CO 2 atmosphere, the peak appears at m/z 46 as the result of formate ions containing 13 C. Therefore, the carbon source for HCOOH was CO 2 molecules dissolved in the solution, suggesting that ntype ZnS:Ni is indeed viable as a component of hybrid photocatalysts for CO 2 reduction under visible light irradiation. As described in a previous report concerning Ru-complex/N-Ta 2 O 5 hybrid photocatalysts, the enhanced CO 2 reduction activity can be explained primarily by two factors.The first is the direct connection between the semiconductor and the Ru-complex, and the second is the greater G between the E CBM of the semiconductor and the CO 2 reduction potential typically almost equal to the lowest unoccupied molecular orbital (LUMO) of the Ru-complex 5.These points are important with regard to the enhancement of the electron transfer rate from the semiconductor to the Ru-complex.In this study, a neutral Ru (dpbpy) complex with phosphonate anchors was found to be the most at ambient temperature.Suspensions were irradiated using a 500 W Xe lamp with filters to produce light in the range 390 750 nm over16 h.Product concentrations were determined by gas chromatography and ion-exchange chromatography.More than three runs were performed and the average values were calculated using them (within 4 error).b Turnover numbers (TON) were calculated on the basis of the mass of metal complex used.c Using the same amount of Ru(dpbpy) as for entry 5. effective in combination with ZnS:Ni despite having the highest (that is, the most negative) CO 2 reduction potential of -1.0 V vs. NHE among the Ru-complexes, and so the smallest G.Accordingly, the order of activity of these Ru-complex/ZnS:Ni hybrid photocatalysts must be explained by considering not only the driving force for electron transfer (G) but also presumably the strength of bonding (in terms of nonadiabatic coupling and quantum coherence) between the Ru-complex and ZnS:Ni.Nonadiabatic molecular dynamics simulations for N-Ta 2 O 5 /Ru-complex materials have predicted that the anchoring groups determine the tilt angle of the complex on the semiconductor surface, which in turn is crucial for determining the electron transfer rate to the catalytic center 9.In order to evaluate the effect of the Ni doping of ZnS, undoped ZnS The above results demonstrate that ZnS:Ni materials with a sufficiently negative E CBM are active for CO 2 reduction upon combining with Ru-complex catalysts, suggesting that sulfides should also be applicable to powdered hybrid systems for CO 2 reduction under visible light ) x Zn 2(1-x) S 2 is well known to be a unique luminescent material 38,39 and it is thought that the long photoexcited state lifetime of this semiconductor enhanced the efficiency of the electron transfer from the semiconductor to the Ru-complex, resulting in the observed excellent CO 2 reduction photoactivity.In the case of the Ru-bpy/N-Ta 2 O 5 powdered system, the anchoring groups in the Ru-complex that link to the semiconductor surfaces also have a significant effect in terms of generating higher CO 2 photoreduction rates and TONs.This has been demonstrated by both experimental work and nonadiabatic molecular dynamics simulations 5,6,8,9.Hence, the electronic structure in the vicinity of the semiconductor-complex interface could also explain the high TON observed in the present work.The carbon source for the formic acid evolved in the reaction over Ru(dpbpy)/(AgIn) 0.22 Zn 1.56 S 2 was again confirmed to be CO 2 based on 13 CO 2 analyses (Fig. S8). Here, we discuss CO 2 photoreduction over solid solution sulfide/Rucomplex systems.The conduction bands of (CuGa) 0.8 Zn 0.4 S 2 and (AgIn) 0.22 Zn 1.56 S 2 are primarily composed of Zn4s4p Ga 4s4p 24 and Zn4s4p In 5s5p orbitals 26, respectively.The conduction band formed by Zn 4s4p orbitals is located at a position more negative than that of the Ga 4s4p and In 5s5p orbitals 24,26.Therefore, the E CBM levels of these materials are in the order of: ZnS:Ni ( CuGa) 0.8 Zn 0.4 S 2 (AgIn) 0.22 Zn 1.56 S 2 .On a thermodynamic basis, ZnS:Ni is thus considered to possess the best E CBM for electron transfer to the LUMO of the Ru-complex among these sulfide semiconductors.However, order of CO 2 reduction rates were of (Cu-Ga) 0.8 Zn 0.4 S 2 ZnS:Ni (AgIn) 0.22 Zn 1.56 S 2 .In our previous study using a metal oxide semiconductor 5, it was proposed that p-type N-Ta 2 O 5 is favorable for the construction of hybrid systems.In contrast, the present work demonstrates that n-type semiconductors such as ZnS:Ni and (AgIn) 0.22 Zn 1.56 S 2 are effective.These results strongly indicate that the CO 2 photoreduction efficiency of the hybrid photocatalyst is not determined only by the G associated with the E CBM and the conduction type.Hence, other critical factors, such as the nature of the semiconductor (the extent of light absorption, defects and crystallinity among others) and the linkage (coupling, quantum coherence, etc.) between the Ru-complex and the semiconductor are suggested.It is widely accepted that HCOOH/CO selectivity at the metal complexes is dependent on electronic state of central metal governed by ligand species and solvent, although details of the reaction mechanism have not yet been clarified 40.The HCOOH/CO ratios generated at the Ru-complex over these sulfide semiconductors linked with Ru(dpbpy) in the aprotic solvent were 3.6, 2.7, 4.3 for ZnS:Ni, (CuGa) 0.8 Zn 0.4 S 2 , and (AgIn) 0.22 Zn 1.56 S 2 , respectively.This reproducible fact suggested possible difference in electronic structure of the Ru(dpbpy) linked with the semiconductors, which could modify a balance of reaction pathway to form CO and HCOOH involving reaction with electrons and protons 40. CO 2 reduction to HCOOH over Ru(bpbpy)/(AgIn) 0.22 Zn 1.56 S 2 was found to proceed for 8 h under visible light irradiation (Fig. S9), after which the reaction rate gradually decreased.XPS analysis following 16 h of the photocatalytic reaction showed that the evident deactivation was not due to deterioration of the semiconductor, such as via changes in the chemical states of the S or Ag (Fig. S7), but rather because of the elimination of approximately 80 of the Ru-complex from the (AgIn) 0.22 Zn 1.56 S 2 surface, judging from changes in the Ru/Zn and Ru/S atomic ratios (Table S1).The stability of this material could potentially be improved by obtaining a more stable interface between the Ru-complex and (AgIn) 0.22 Zn 1.56 S 2 . N-Ta 2 O 5 and C 3 N 4 are recognized as relatively inert semiconductors for both H 2 generation and CO 2 reduction 5,13,35, and enhancement of CO 2 reduction selectivity has clearly been observed by the linkage with metal-complex catalysts, in which C 3 N 4 -based system showed a very high turnover number of greater than 1000 5,13.In addition, it was reported that solvents and sacrificial reagents largely affect photocatalytic activity of C 3 N 4 -based hybrid catalyst such as efficiency and selectivity 37, because of the difference in ability of their reaction parameters including electron transfer rate, acidity/basicity, and CO 2 concentration, etc. While, Reisner group demonstrated that selectivity for CO generation over CdS, a relatively active photocatalyst for CO 2 photoreduction 41, was highly enhanced by an appropriate conjugation with a metal-complex 30.These results suggest that further improvement of various sulfide-based semiconductor/metal-complex systems is expected by means of improving catalyst coverage, electron transfer associated with electronic structure by solvents and conjugation, etc."
  },
  {
    "title": "Conclusions",
    "content": "This work demonstrated powdered photocatalysts for CO 2 reduction, employing various Zn-based metal sulfide semiconductors hybridized with Ru-complex catalysts under visible light irradiation in the presence of electron donor.The photocatalytic activities were found to be largely dependent on the basic characteristics of the Ru-complex and the metal sulfide, such as polarity and the photoexcited state lifetime.Combinations of a neutral Ru-complex containing phosphonate anchors and n-type (AgIn) 0.22 Zn 1.56 S 2 or Ni-doped ZnS showed highly enhanced a Reaction conditions: catalyst (8 mg) in CO 2 -saturated MeCN/TEOA (5/1, v/v) (4 mL) at ambient temperature.Solutions ware irradiated using a 500 W Xe lamp with filters to produce light in the range 390 750 nm over 16 h.Product concentrations were determined by gas chromatography and ion-exchange chromatography.b Turnover numbers (TON) were calculated on the basis of the mass of metal complex used. TON values for HCOOH.Metal sulfides should therefore be applicable to the fabrication of metal complex/semiconductor hybrid systems for CO 2 reduction.The data show that the degree of CO 2 reduction activity is not explained by the strength of the interaction or by the energy difference between the semiconductor and Ru-complex, as was proposed in a previous study using metal oxide semiconductors.Our results also suggest that further study could potentially improve the activity of these hybrid photocatalysts and it is expected that metal sulfides will be applicable to future powdered Z-scheme systems utilizing water as an electron donor and proton source. Fig. 1.(a) CO 2 reduction under visible light using a hybrid photocatalyst composed of a Ru-complex and metal sulfide semiconductor, and (b) the chemical structures of various Rucomplexes. ZnS:Ni were assessed when modified with the Ru(dpbpy) catalyst.As shown in Figs.4 and S7 , the Ni doping of ZnS creates a new energy level (due to the Ni 3d orbital) in the ZnS bandgap such that the energy gap is narrowed21.We initially irradiated the catalysts with wavelengths longer than 330 nm, which can activate both undoped and Ni-doped ZnSs21.As shown in Table3, bare samples of undoped and Ni-doped ZnS evolved only H 2 , and the amount of H 2 evolved over the ZnS:Ni was 4.4 times that produced by the undoped ZnS, due to the greater amount of photons absorbed by the doped material21 (entries 9 and 11).In contrast, both undoped ZnS and ZnS:Ni, when modified with Ru(dpbpy), generated HCOOH and CO when exposed to wavelengths greater than 330 nm.Thus, both materials exhibited CO 2 photoreduction activity, suggesting electron transfer proceeded from the conduction bands of the photoexcited ZnS or ZnS:Ni to the Ru(dpbpy) as proposed in our previous study (Fig.4)5.Ru(dpbpy)/ZnS generated HCOOH and CO because the E CBM of ZnS formed by the Zn 4s4p orbitals is located at a sufficiently negative position (-1.3V vs. NHE) to transfer electrons to Ru(dpbpy).Under visible light irradiation, only Ru(dpbpy)/ZnS:Ni showed activity for photocatalytic CO 2 reduction.Therefore, it appears that the combination with Ru(dpbpy) imparts light-induced CO 2 reduction ability to both ZnS and ZnS:Ni, and so it should be possible to promote CO 2 reduction under visible light using many of the sulfide semiconductors reported to date. Photocatalytic CO 2 reduction by ZnS-based solid solutions ((GuGa) 0.8 Zn 0.4 S 2 and (AgIn) 0.22 Zn 1.56 S 2 ) coupled with Ru-complexes Fig. 2. CO 2 reduction in an organic solvent over a Ru(dpbpy)/ZnS:Ni hybrid powdered photocatalyst under visible light irradiation ( 390 nm).Conditions: catalyst (8 mg) in CO 2 -saturated MeCN/TEOA (5/1, v/v) (4 mL) in a Pyrex glass test tube.More than three runs were performed and the average values were calculated using them (within 5 error). Fig. 3. ESI-MS spectra of the products (HCOO -) in a liquid phase by photocatalytic reactions utilizing (a) 12 CO 2 and (b) 13 CO 2 over Ru(dpbpy)/ZnS:Ni under visible light irradiation ( 390 nm).Conditions: catalyst (10 mg) in 12 CO 2 or 13 CO 2 -saturated MeCN/TEOA (5/1, v/v) (4 mL) in a Pyrex glass test tube, 6 h. Fig. 4. Mechanism for the photoreduction of CO 2 by Ru-complex catalysts coupled with Ni-doped ZnS to produce hybrid photocatalysts. 3 2-under visible light irradiation, even without a metal cocatalyst.Doping with metals produces a new energy level in the band gap of ZnS due to the Ni 3d, Cu 3d, or Pb 3d orbitals.In addition, solid solutions based on ZnS such as (CuGa) 1-x Zn 2x S 2 Properties of various Ru-complexes. fThe reduction potential could not be determined because of low solubility in MeCN. Photocatalytic reduction of CO 2 in an organic solvent by Ru-complex/ZnS:Ni hybrid photocatalysts under visible light irradiation.a 26,27talytic reduction of CO 2 in an organic solvent by Ru(dpbpy)/ZnS and ZnS:Ni (0.2) hybrid photocatalysts under UV and visible light irradiation.aSolutionswareirradiatedusinga500 W Xe lamp with filters to produce light in the ranges 330 nm or 390 nm over 16 h.Product concentrations were determined by gas chromatography and ion-exchange chromatography.irradiation.To enhance the CO 2 photoreduction activity of such systems, we therefore prepared a hybrid photocatalyst composed of Ru (dpbpy) and Zn-based sulfide solid solution semiconductors, (CuGa) 0.8 Zn 0.4 S 2 (p-type)24and (AgIn) 0.22 Zn 1.56 S 2 (n-type)26,27, with band gaps of 2.2 and 2.4 eV, respectively (Fig.S7).Table 4 summarizes the results of photocatalytic CO 2 reduction reactions under visible light irradiation.(CuGa) 0.8 Zn 0.4 S 2 and (AgIn) 0.22 Zn 1.56 S 2 possessed CO 2 photoreduction activity and produced HCOOH even when not modified with Ru(dpbpy).In contrast, modification with Ru (dpbpy) induced CO formation, which suggested Ru(dpbpy) acted as CO 2 reduction catalyst.Accordingly, HCOOH formation rate greatly improved by the linkage with Ru(dpbpy).It is noteworthy that H 2 was the major product over the Ru(dpbpy)/(CuGa) 0.8 Zn 0.4 S 2 .In contrast, the Ru(dpbpy)/(AgIn) 0.22 Zn 1.56 S 2 exhibited the highest photocatalytic activity for the reaction of CO 2 to HCOOH among the hybrid photocatalysts assessed in this work.The TON for HCOOH after 16 h irradiation obtained from this system was 126, a value that exceeds the TON observed for (Ru(dpbpy)/ZnS:Ni). (AgIn a Reaction conditions: catalyst (8 mg) in CO 2 -saturated MeCN/TEOA (5/1, v/v) (4 mL) at ambient temperature. Photocatalytic reduction of CO 2 in an organic solvent by Ru(dpbpy)/(CuGa) 0.8 Zn 0.4 S 2 and (AgIn) 0.22 Zn 1.56 S 2 hybrid photocatalysts under visible light irradiation.a T.M.S., S.S. and T.M. were partially supported by the Advanced Catalytic Transformation Program for Carbon Utilization (ACT-C) of the Japan Science and Technology Agency (JST).The authors thank Mr. Akira Ikeda, Mr. Tomotaka Yamamoto, Mr. Ikko Honma, Mr. Takeshi Miyazono, Mr. Shunya Yoshino and Mr. Ikoma Narita for experimental assistance.The authors also thank Ms. Naoko Takahashi and Mr. Kousuke Kitazumi (XPS analyses) and Dr. Soichi Shirai (quantum chemical calculation). Supplementary data associated with this article can be found, in the online version, at http://dx.doi.org/10.1016/j.apcatb.2017.10.053."
  }
]