[
  {
    "title": "Doi",
    "content": "10.1016/j.cej.2015.10.033"
  },
  {
    "title": "Article_Title",
    "content": "Performance analysis of nanostructured NiO–In2O3/TiO2 catalyst for CO2 photoreduction with H2 in a monolith photoreactor"
  },
  {
    "title": "Abstract",
    "content": "h i g h l i g h t sNickel and indium based TiO 2 monolithic catalysts tested for CO 2 reduction with H 2 .CO yield over NiO-In 2 O 3 /TiO 2 5.6 and 207 more than In/TiO 2 and TiO 2 , respectively.The performance of monolith photoreactor was 14-fold higher than cell type reactor.Quantum efficiency in co-doped catalysts was much higher than previously reported.NiO-In 2 O 3 /TiO 2 catalyst exhibited higher stability in RWGS reaction for cyclic runs.g r a p h i c a l a b s t r a c t 3.5 In 2 O 3 /TiO 2"
  },
  {
    "title": "Experimental",
    "content": "Tetra-isopropyl-orthotitanate (TTIP) (98, Merck), iso-propanol (99.99,Merck), acetic acid (99.98,QReC), indium (III) nitrate hydrate (InN 3 O 9 AH 2 O, Molekula), nickel nitrate hexahydrate (99.99,Merck) were used as raw materials.Modified sol-gel method was applied to synthesize Ni and In co-doped TiO 2 based monolithic catalysts.Typically, 20 mL of TTIP added in 60 mL isopropanol was hydrolyzed with a mixture of 15 mL 1 M acetic acid and 20 mL isopropanol.The hydrolysis process was kept stirring for 24 h at room temperature.Next, specified amount of In(NO 3 ) 3 -A3H 2 O and Ni(NO 3 ) 2 A6H 2 O dissolved in isopropanol were added to the titanium sol under vigorous stirring, and aged for 12 h to get clear sol.The sol obtained was transferred into a glass container for monolith dip-coating. The dimension of the cylindrical monolith is 60 mm diameter and 20 mm long.The cell density of the cordierite ceramic monoliths with square channels, purchased from the Pingxiang Meitao Company China, is 100 and 200 CPSI (cells per square inch).Before coating, the monoliths were washed with acetone and isopropanol to remove any organic materials and then dried at 80 C for 12 h.Next, the dried monoliths were immersed into the sol.Any excess sol was blown off using hot compressed air.The coating procedure was repeated to ensure constant loading.The coated monolith was dried at 80 C for 12 h before calcination at a rate of 5 C min A1 up to 500 C, held for 5 h.The catalyst loading was calculated by subtracting coated monolith weight from the initial bare monolith weight.For every coating, three readings were recorded for both bare and coated monoliths with their average values reported.Different In and Ni doping levels were prepared by varying the quantity of In(NO 3 ) 3 A3H 2 O and Ni(NO 3 ) 2 A3H 2 O.The amounts of In-used were 1 wt., 2 wt., 3.5 wt., and 5 wt..Similarly, in co-loading of In 2 O 3 /TiO 2 catalysts, nickel doping levels were 0.5 wt., 1 wt. and 2 wt. at fixed In-doping (3.5 wt.).For comparison, pure TiO 2 was prepared by employing the same procedure without metal doping. X-ray powder diffraction patterns of the catalyst samples were obtained from Bruker D8 advance diffractometer (Cu-Ka radiation, wavelength k 1.54 A, operated at 40 kV and 40 mA).The scanning rate was 1.2min A1 from 10 to 70of 2h.The crystalline phases were identified based on powder diffraction data (JCPDS-ICSD) reference.Meanwhile, Scherrer equation was applied to calculate TiO 2 crystal size.The scanning electron microscopy (SEM) was carried out with JEOL JSM6390 LV SEM instrument.The Brunauer-E mmett-Teller (BET) specific surface area and pore size of the cata-lysts was measured by N 2 adsorption-desorption isotherms at 77 K using a Micrometrics ASAP 2020 Surface Area and Porosity Analyzer.The XPS measurement was performed using Omicron DAR 400 analyzer.The photocatalyst was fixed to the sample holder using carbon tape.The pass energy used was 20 eV while the instrument was operated at 15 kV.The survey spectra were recorded in the range of 0-1400 eV.The binding energies were calibrated against the C1s signal (284.6 eV) as the internal standard.Ultraviolet-visible (UV-vis) diffuse reflectance absorbance spectra of the samples were determined using UV-vis spectrophotometer (Agilent, Cary 100) equipped with an integrated sphere.Initially, blank runs were conducted to correct the base line.The absorbance spectra were analyzed at ambient temperature in the wavelength range of 200-800 nm.The band gap energies of the photocatalysts were determined from the extrapolation of Tauc plot to the abscissa of photon energy.The photoluminescence (PL) spectra were measured using PerkinElmer LS 55 Luminescence Spectrometer. The monolith photoreactor system for photocatalytic CO 2 reduction with H 2 consisted of a cylindrical stainless steel chamber with 5.5 cm length and a total volume of 150 cm 3 as previously described 8.The catalyst-coated monolith was placed inside the cylindrical stainless steel chamber with a quartz window for passing light irradiations.The light source for UV irradiation was a 200 W Hg reflector lamp.The lamp was equipped with cooling fans to remove heat from the lamp.The straight square cordierite monolith channels were illuminated with the flux of the reflected light source.An optical process monitor ILT OPM-1D and a SED008/ W sensor were placed above the upper surface of the monolith to measure the light intensity entering into the channels.The total light influx passing at the top of the reactor was measured to be 150 mW cm A2 .The reactor was covered with aluminum foil to ensure lights for the reactions came through the quartz window only.In case of the cell type photoreactor, the reactor chamber and the light source were the same as that of the monolith reactor.However, 50 mg of catalyst powder was suspended uniformly at the bottom of the reactor to ensure light is distributed over the catalyst surface. Before feeding, the reactor was purged with helium (He).A mixture of gases (CO 2 , H 2 and He, purity 99.99) was passed through the reactor for a specific time to saturate the catalysts at room temperature and atmospheric pressure.The performance of NiO-In 2 O 3 /TiO 2 monolith photoreactor was investigated in a batch and continuous mode.In a batch mode operation of monolith photoreactor, H 2 concentration was fixed at 20 mol, while CO 2 concentrations of 10, 20, 30 and 40 mol were used to control the CO 2 /H 2 ratios at 0.5, 1.0, 1.5 and 2.0, respectively.He gas was used to culminate the mole balance to 100 mol.The pressure inside the reactor was set to 0.40 bar using a pressure controller for batch mode study.In a continuous monolith photoreactor, the CO 2 /H 2 ratio of 1.0 was adjusted at a feed rate of 20 mL/min and the products were continuously analyzed over the entire irradiation time. A minimum reaction temperature of 100 C was selected for catalyst screening in the RWGS reaction.The effect of reaction temperatures (100, 120 and 140 C) was investigated for determining if the process was thermal, photo-thermal or photocatalysis.The temperature inside the reactor was controlled with a temperature controller. The products were analyzed using an on-line gas chromatograph (GC-Agilent Technologies 6890N, USA) equipped with thermal conductivity detector (TCD) and a flame ionized detector (FID).Furthermore, FID detector was connected with a HP-PLOT Q capillary column (Agilent, length 30 m. ID 0.53 mm, film 40 lm) for separation of C 1 -C 6 paraffin and olefins hydrocarbons, alcohols and oxygenated compounds.The TCD detector was connected to UCW982, DC-200, Porapak Q and Mol Sieve 13X columns.C 1 -C 2 , C 3 -C 5 compounds and light gasses (H 2 , O 2 , N 2 , CO) were separated using Porapak Q, DC-200 and MS-13X column, respectively."
  },
  {
    "title": "Results_and_Discussion",
    "content": "3.1.Crystalline structure and morphology of catalysts Fig. 1S presents the XRD patterns of TiO 2 , In 2 O 3 /TiO 2 and NiO-In 2 O 3 /TiO 2 samples calcined at 500 C.The crystalline and anatase phases of TiO 2 were observed in all samples.However, peaks ascribed to Ni and In in metal or oxides states were not detected.This was possibly due to low NiO and In 2 O 3 contents, which were below the detection limit of XRD or the species were dispersed well over the TiO 2 surface.Compared to TiO 2 , the peaks of In nanoparticle and electron dispersion having value about 0.35 nm that clearly relates to anatase phase TiO 2 . N 2 adsorption-desorption isotherms of TiO 2 , In 2 O 3 /TiO 2 and NiO-In 2 O 3 co-doped TiO 2 samples are presented in Fig. 3. Obviously, the isotherms of TiO 2 and metal-doped TiO 2 reveal the typical type IV hysteresis loops, characteristics of mesoporous materials.More significantly, both capillary and condensation reflections of In 2 O 3 /TiO 2 are the same as TiO 2 .By co-doping NiO and In 2 O 3 into TiO 2 , similar trends were observed, representing mesoporous materials with capillary condensation process. The surface area, pore volume and pore size of the un-doped TiO 2 and various In 2 O 3 and NiO-doped TiO 2 catalysts are listed in Table 2.The BET specific surface area of TiO 2 (43 m 2 g A1 ) increased to 62, 84, 98 m 2 g A1 for 2, 3.5 and 5 wt.In 2 O 3 -contents, respectively.The increase in surface area was due to reduced crystal size.However, a slight increase in surface area was observed in NiO and In 2 O 3 co-doped TiO 2 samples as compared to 3.5 wt.In 2 O 3 /TiO 2 sample.The BJH adsorption surface area for NiO and In 2 O 3 doped TiO 2 samples were much larger than TiO 2 , confirming larger mesoporous structures in metal-doped TiO 2 samples.Similar trends were observed with pore volume increments.Thus, welldeveloped mesoporous structure with larger pore volume and smaller particle size could enhance molecular transportation rates of reactants and products to increase photoactivity. The chemical states of the component elements of the NiO-In 2 O 3 /TiO 2 catalyst were analyzed by X-ray photoelectron spectroscopy (XPS).The XPS analysis revealed the presence of Ti, In, Ni, O and C species as summarized in Table 3.The Ti 2p binding energies (BE) are located at 458.04 eV (2p 3/2 ) and 463.78 eV (2p 1/2 ), both of which are attributed to Ti 4 oxidation state.The In-3d spectrum peaks with BE region are centered at 444.22 eV (3d 5/2 ) and 451.79 eV (3d 3/2 ), respectively, indicating indium in In 3 species or In 2 O 3 .The binding energy peaks for Ni 2p are at 855.24 (2p 3/2 ) and 873.15 eV (2p 1/2 ) which are characteristics of Ni 2 or NiO 23.The spectrum of O 1s reveals two peaks centered at 529.25 and 531.12 eV.The BE value of 529.25 eV is attributed to the lattice oxygen O 2A in TiO 2 , In 2 O 3 and NiO and is in agreement with the reported values 34.The oxygen peaks at around 531.12 is possibly due to H 2 O or the free hydroxyl group (O-H) on the surface.The C 1s peaks with binding energy located at 284.60 and 585.97 eV correspond to C-C, and C-O, respectively.The presence of carbon may be recognized as the carbon from carbon tap used for sample analysis.ues of all the In 2 O 3 /TiO 2 catalysts samples are listed in Table 2.The increase in the band gap energy can be attributed to the higher indium oxide (In 2 O 3 ) band gap energy (E bg 3.7 eV) 35.The shift in TiO 2 band gap energy towards UV region has been reported in the literatures for In 2 O 3 /TiO 2 nanoparticles 36.The band gaps of NiO-In 2 O 3 /TiO 2 samples were 3.05 and 3.02 for 1 and 2 wt.NiO-contents.Obviously, there was a gradual decrease in the band gap energy with NiO doping.Fig. 2S exhibits the photoluminescence (PL) spectra of TiO 2 , In 2 O 3 /TiO 2 and NiO-In 2 O 3 /TiO 2 samples.Pure TiO 2 and metaldoped TiO 2 samples exhibit a wide and strong PL signal in the range of 450-550 nm with the excited wavelength of 350 nm.The spectral peak positioned at 458 nm relates to anatase TiO 2 , whereas the two peaks at 483 and 527 nm are attributed to the transition from the oxygen vacancies with two trapped electrons and one trapped electrons in the valence band of TiO 2 , respectively.Moreover, a reduction in PL intensity was observed in different weight of doped TiO 2 samples compared to pure TiO 2 .However, a significant reduction in PL intensity could be seen in NiO-In 2 O 3 /TiO 2 samples, obviously due to electron trapping by these metals.From the PL results it can be envisaged that co-metals doped TiO 2 catalysts are more capable to enhance TiO 2 photoactivity for CO 2 reduction applications. Preliminary testings of photocatalytic CO 2 reduction with H 2 as the reducing agent in the presence of UV-irradiations at 100 C in a batch monolith photoreactor were performed in the cases of (a) un-coated monolith helium, (b) catalyst coated monolith helium, and (c) H 2 helium catalyst coated monoliths.In any case carbon containing compounds was not produced.From the tests, it is confirmed catalysts and monoliths were cleaned and carbon containing compounds, if any, were not produced from organic residues in the catalyst.Therefore, any carbon containing compounds formed was derived from CO 2 through photocatalysis process. Fig. 5 illustrates the effect of reducing agents (H 2 , H 2 O) on TiO 2 photoactivity for CO 2 reduction to CO at different irradiation time. For CO 2 reduction with H 2 O vapors, CO 2 was bubbled through the water saturator based on the method described previously 34.It is evident that the reducing agent contributed significantly to enhance CO 2 reduction to CO, which is higher in the case of H 2 .CO yield was 1.35-fold higher using H 2 as a reductant compared to H 2 O vapors.Generally since the interfacial contact rates between water vapors and catalyst surface are less formidable than H 2 and catalyst surface, lower CO production in the presence of H 2 O vapors could be attributed to less competition between CO 2 and H 2 O. Besides, H 2 O is not an efficient reductant its standard reduction potential is than CO 2 as discussed previously.Therefore, during photocatalytic CO 2 reduction with H 2 O, H 2 O splitting to H 2 also occurred in addition to CO 2 reduction 37.Thus, H 2 is a more efficient reducing agent and should be explored further using single and co-doped TiO 2 based nanocatalysts. The effect of In 2 O 3 and NiO doping on TiO 2 photoactivity for CO 2 reduction with H 2 to CO and hydrocarbons with products selectivity are presented in Table 4. Un-doped TiO 2 has smaller CO 2 reduction efficiency, but is significantly enhanced in metal-doped TiO 2 samples.Doping In 2 O 3 into TiO 2 effectively promotes the formation of CO, the main product detected in gaseous mixture, over all the In 2 O 3 /TiO 2 samples.The CO production increased remarkably up to an optimum 3.5 wt.In 2 O 3 -content, and then gradually decreased.Therefore, 3.5 wt.In 2 O/TiO 2 is the most effective loading over which amount of evolved CO reached to 1805 lmol gcatal A1 after 2 h of irradiation time, 19 times more than TiO 2 catalyst.The significant improvements in In 2 O 3 /TiO 2 activity were due to the ability of In-metal to trap photo-generated charges as evidenced by PL analysis.The enhanced photoactivity was also due to efficient charge transfer, higher surface area and improved adsorption-desorption process owing to the mesoporous structure of the In 2 O 3 /TiO 2 sample.However, excess amount of In 2 O 3 loading reduced the TiO 2 photoactivity possibly attributed to the establishment of charge recombination centers over TiO 2 surface 15. It is evident that NiO is more efficient for CO 2 reduction than In 2 O 3 and a maximum yield of CO observed over 2.0 NiO/TiO 2 was 7306 lmol g-catal A1 , four-fold higher than In 2 O 3 and 77 times more than TiO 2 catalyst.The selectivity of CO production over NiO/ TiO 2 catalyst was higher than In 2 O 3 /TiO 2 .The increase in the photoactivity of TiO 2 in the presence of NiO compared to In 2 O 3 was possibly due to its oxidation and reduction during photocatalysis process, resulting in more production and capturing of electrons for CO 2 reduction.Efficient adsorption and desorption process over Ni active sites as discussed previously could also attribute to the improved photoactivity. Similarly, NiO and In 2 O 3 co-metal ions doped into TiO 2 revealed a notable increase in CO concentration with an optimum NiOcontent of 1 wt. and 3.5 wt.In 2 O 3 .A larger increase in CO production in the presence of NiO is likely due to hindered recombination of charges and possibly due to increase in the surface area with smaller crystal size and higher adsorption-desorption processes.The decrease in CO yield beyond 1 wt.NiO was possibly due to excessive dopant concentration.The excess dopant possibly formed charge recombination centers and/or shielded TiO 2 surface active sites, preventing its contact with the reactants and reducing the light absorption of TiO 2 38.The maximum production of CO over 1.0 NiO-3.5In 2 O 3 /TiO 2 catalyst was 11,325 lmol gcatal A1 , 1.6, 6.3 and 119 fold higher than NiO/TiO 2 , In 2 O 3 /TiO 2 and un-doped TiO 2 , respectively.With the encouraging performance of the co-doped catalysts, the effect of CO 2 /H 2 feed ratio, reaction temperature, irradiation time and performances of reactors on selective CO 2 reduction was further investigated over 1 NiO and 3.5 In 2 O 3 co-doped TiO 2 catalyst. The influence of initial feed concentration on the performance of 1 NiO-3.5In 2 O 3 co-doped TiO 2 photocatalyst was investigated by using different CO 2 /H 2 molar feed ratios at 100 C.Fig. 3S(a) presents the evolution of CO during photocatalytic CO 2 reduction with H 2 over NiO-In 2 O 3 co-doped TiO 2 at different CO 2 /H 2 molar feed ratios.Obviously, generation of CO was increased gradually by varying the initial CO 2 concentration until it reached to 30 mol CO 2 at a fixed H 2 i.e. 20 mol and balance helium (He 50).The optimum CO 2 /H 2 feed ratio was found to be 1.5, where the concentration of CO was the highest over the entire irradiation time.Lower CO 2 concentration favored higher CH 4 production (Fig. 3S(b)).Having more CO 2 in the feed stream (high CO 2 /H 2 feed ratios) gave higher CO.This phenomenon is likely due to the adsorption competition between CO 2 and H 2 molecules over the catalyst during photoreduction process.Increasing CH 4 yield rate at lower CO 2 /H 2 feed ratios (higher H 2 concentration) was seemingly due to higher H 2 adsorption over the catalyst, resulting in an effective CO 2 reduction to CH 4 .Therefore, the concentrations of both reactants would have to be optimized for maximum conversion.Similar observations have been reported previously 39. The effect of reaction temperature on the performance of 1.0 NiO-3.5In 2 O 3 /TiO 2 catalyst for selective CO 2 reduction to CO and hydrocarbons is demonstrated in Fig. 6 and Table S1.In the absence of light irradiations (lamp off) and under the same reaction conditions, CO 2 reduction products were not detected.However, a substantial increase in the CO and CH 4 production was observed as the temperature increased from 100 to 120 C, possibly due to higher CO 2 photo-reduction (Fig. 6).The charge transfer excited state species and reactant molecules collided more often at higher temperature resulting in higher photoactivity.However, a gradual decrease in CO yield was observed at elevated temperature (140 C).As the temperature increased there was effective adsorption-desorption process over the photo-active sites allowing more CO 2 to adsorb on the surface and be reduced to CO and hydrocarbons.The decrease in CO production at 140 C was possibly due to higher desorption rate of reactants (CO 2 and H 2 ) over the catalyst surface 33.Recently, it has been reported that nickel in TiO 2 increased the interaction between catalyst and CO 2 and reduced nickel is suitable for efficient H 2 and CO 2 adsorption 40,41. A gradual increase in the hydrocarbons yield was detected with temperature as more CO 2 was converted to hydrocarbons (Table S1).This could probably be due to the carbon species, produced over the catalyst active sites, being converted to hydrocarbons by reacting with hydrogen.Therefore, it can be deduced that CO 2 reduction process is through photo-thermal and is dependent on efficient adsorption-desorption process over the catalyst surface. Photocatalytic CO 2 reduction with H 2 to CO over TiO 2 and cometal doped TiO 2 samples at irradiation times of 0-8 h are presented in Fig. 7.Over TiO 2 , the amount of CO was very small but significantly increased with 3.5 In 2 O 3 -loading.The yield of CO produced was much higher than 3.5 In 2 O 3 /TiO 2 and TiO 2 catalysts when 1 NiO-3.5In 2 O 3 /TiO 2 catalyst was used.Three zones (I, II and III) are apparent over the irradiation time in TiO 2 based monolithic catalysts.For the initial time of 0-1 h, CO production was slower over NiO-In 2 O 3 /TiO 2 in zone I.However, in zone II at the irradiation time of 1-4 h, CO production was relatively faster over all types of catalysts.In zone III after 4 h of irradiation time, called the gradual CO production stage, continuous production of CO prevailed particularly for NiO co-doped compared to In 2 O 3 /TiO 2 catalyst.The evolution of CO over NiO-In 2 O 3 /TiO 2 monolithic catalyst was 5.9 times higher than In 2 O 3 /TiO 2 and 207 times higher than TiO 2 .The much higher CO production over NiO-In 2 O 3 /TiO 2 catalysts is possibly due to higher electrons mobility with hindered recombination rate and efficient adsorption-desorption process over the mesoporous catalyst surface supported over monolith micro-channels. The result of irradiation time on photocatalytic CO 2 reduction to CH 4 over 1 NiO-3.5In 2 O 3 /TiO 2 is shown in Fig. 8(a).Apparently, CH 4 yield increased very quickly over TiO 2 , but its production was gradual over co-doped TiO 2 catalysts.Also, the yield of CH 4 over TiO 2 catalyst was much higher compared to other doped and codoped TiO 2 samples.Furthermore, there was no significant difference in CH 4 face area with increased mesoporosity and hindered recombination of photo-generated charges, resulting in higher mobility of charges, more light absorption and efficient mass transfer. The CO 2 conversion over NiO-In 2 O 3 /TiO 2 (10.2) was much higher than In 2 O 3 /TiO 2 (6.42) and pure TiO 2 (1.7).On the other hand, H 2 conversion over TiO 2 was initially 2.3, but improved to 5.48 and 16.40 over 3.5 In 2 O 3 /TiO 2 and 1 NiO-3.5In 2 O 3 / TiO 2 respectively.Similarly, selectivity of CO over TiO 2 was 44.58, but surged to 98.36 and 99.70 over In 2 O 3 /TiO 2 and NiO-In 2 O 3 /TiO 2 catalysts, respectively.The larger conversion has also increased CO selectivity as more CO 2 was converted to CO.Therefore, the role of NiO and In 2 O 3 is prominent in TiO 2 to maximize both conversion and selectivity while using the monolithic support. It is remarkable to note conversion of H 2 is much higher.According to stoichiometric reactions in Eqs. ( 1) and (2), one and four moles of H 2 are required to produce one mole of CO and one mole of CH 4 , respectively. As the selectivity of CO is about 99.70 (Table 4), Eq. ( 1) is more favorable, indicating consumption of H 2 and CO 2 would be approximately much closer.Thus, conversion of H 2 should be expected closer to CO 2 conversion.As illustrated by XPS results, nickel was present over TiO 2 as NiO.Therefore, a much higher H 2 conversion was registered possibly due to higher consumption of H 2 for NiO reduction and described in Eqs. ( 3)-( 6) 38. Eq. ( 3) presents the reduction of NiO with H 2 to produce Ni.During photocatalytic CO 2 reduction over NiO-In 2 O 3 /TiO 2 catalyst, generation of Ni ions takes place through the oxidation of Ni metal by photogenerated holes (Eq.( 4)).Eqs. ( 5) and ( 6) illustrate the redox cycle of Ni 2 /Ni that may be played over the TiO 2 matrix.The Ni species could be oxidized to Ni by ions of H and/or O 2 present in the system.Due to rapid transfer of excited electrons to the Ni particles, the separations between electrons and holes pairs are enhanced resulting in higher photocatalytic activity for CO 2 reduction. The performance of nanostructured 1 NiO-3.5In 2 O 3 /TiO 2 catalyst was evaluated in cell type and monolith photoreactor and the results are presented in Fig. 9. Using NiO-In 2 O 3 /TiO 2 catalyst, CO was observed as the main product in both cell and monolith photoreactors.The yield rate of CO observed was 852 lmol gcatal.A1 h A1 and 12,028 lmol g-catal.A1 h A1 for cell and monolith batch photoreactors, respectively over the NiO-In 2 O 3 /TiO 2 catalyst.The performance comparison of NiO-In 2 O 3 /TiO 2 catalyst for CO production in the batch monolith and cell type photoreactor revealed a 14.13-fold higher productivity in the batch monolith photoreactor than the cell type reactor under the identical reaction conditions.Significantly higher efficiency of monolith photoreactor was primarily due to a larger illuminated surface area, efficient light distribution and utilization over the NiO-In 2 O 3 /TiO 2 catalyst surface and enhanced adsorption-desorption process 31.On the other hand, the performance of the batch monolith photoreactor is 1.90-fold higher than continuous process.The higher yield rate in a batch process was obviously due to an accumulation of products in the reactor chamber with irradiation time.Conversely, a lower yield in continuous process was due to continual feed and products removal during CO 2 reduction process.By comparing the yield rates from the batch and continuous process, it is apparent that more CO 2 per unit time could be reduced because of continuous removal of CO with the feed stream. In order to compare the performance of CO 2 photoreduction in different photocatalysis systems, the quantum efficiencies are measured.Two electrons are needed to transform CO 2 into CO.If one electron-hole pair is generated by one photon activation, then the quantum efficiency of CO 2 photoreduction can be defined as the ratio of production rate (mole per sec) with photonic flux (mole per sec) as illustrated in Eq. ( 7) 27.Therefore, the quantum efficiency can be estimated by the CO production rate and the total photon input of the reactor. 2 A moles of CO rate mols moles of photon flux mols A 100 The moles of photon could be calculated from the UV-light input energy to the reactor and the wavelength.The quantum efficiency of CO 2 reduction over various types of catalysts and photoreactor systems is summarized in Table 6.The quantum efficiencies calculated for CO production over NiO-In 2 O 3 /TiO 2 were 0.053, 1.04 and 0.48 for cell type reactor, monolith batch process and monolith continuous process, respectively.These results revealed higher performance of both batch and continuous monolith photoreactor than the cell type reactor.The improved efficiency was obviously due to hindered recombination of charges in the presence of NiO and In 2 O 3 co-doped ions into TiO 2 . The quantum efficiency increased using H 2 as the reducing agent compared to water vapours.We reported quantum efficiency of 0.10 for CO production over In 2 O 3 /TiO 2 catalyst during photocatalytic CO 2 reduction with H 2 O vapours 30.Liou et al. 29 studied photocatalytic CO 2 reduction with H 2 O to CH 3 OH over 1 wt.Pt/TiO 2 and 1 wt.NiO/InTaO 4 and quantum efficiencies calculated were 0.0072 and 0.012 in optical fibers and internally illuminated monolith photoreactor, respectively.By comparing the performance of NiO-In 2 O 3 /TiO 2 catalyst and monolith photoreactor, it could be impart that significantly higher quantum efficiency was obtained in this study.Previously, we reported a quantum efficiency of 0.65 over copper and indium co-doped TiO 2 catalyst during photocatalytic CO 2 reduction with H 2 in a microchannel monolith photoreactor 33.However, the quantum efficiency over NiO-In 2 O 3 /TiO 2 catalyst is 1.6-fold higher than Cu-In/TiO 2 under the same operating conditions.Obviously, higher quantum efficiency prevailed in nickel than copper modified catalysts.It is perceived that nickel metal is more efficient than copper to reduce CO 2 to CO through RWGS reaction.These results confirmed reducing agent and co-doping with TiO 2 contributed significantly to enhance photoreactor performance. The stability of 1 NiO-3.5In 2 O 3 /TiO 2 catalyst was investigated in a continuous monolith photoreactor since the catalyst active sites were utilized more for CO 2 reduction over the irradiation time than the batch process.Besides, commercially continuous processes are preferable for fuel production.In order to investigate the stability of NiO-In 2 O 3 /TiO 2 catalyst in a continuous monolith photoreactor, all the experiments were repeated three times under identical conditions on the recycled catalyst-coated monoliths.The stability test for photocatalytic CO 2 reduction with H 2 to CO and CH 4 for NiO-In 2 O 3 /TiO 2 catalyst is presented in Fig. 10.After each cycle, the monolith was removed from the reactor and placed in open air before starting the next run.Apparently, the CO yield was decreased gradually in the cyclic runs as shown in Fig. 10(a).It could be observed that in the second cyclic run, the CO production increased significantly at the start of the run and then decreased gradually over the irradiation times.The higher CO production could be attributed to conversion of carbon deposited over the catalyst surface to CO.However, in the third cyclic run, the NiO-In 2 O 3 /TiO 2 catalyst photoactivity decreased rapidly. The performance of NiO-In 2 O 3 /TiO 2 for CH 4 production in each cyclic run is illustrated in Fig. 10(b).Compared to the first cyclic run, CH 4 production rate decreased in the second cyclic run.However, in third cyclic run, CH 4 yield increased and then decreased over the irradiation time.Apparently, the intermediate species deposited over the catalyst surface could have been converted to CH 4 .The color of the NiO-In 2 O 3 /TiO 2 catalysts was unchanged even after the third cyclic run, which confirmed carbon species were not deposited over NiO-In 2 O 3 /TiO 2 catalyst.This also revealed that nickel metal resists coke production.On the other hand, significant coke production was seen over Cu-In/TiO 2 catalysts during CO 2 reduction with H 2 in a monolith photoreactor as reported previously 33.Using Cu-In/TiO 2 , the yield of CO decreased in every cyclic runs, but productions of hydrocarbons were significantly increased.These results confirmed that nickel provides more stability to TiO 2 , than copper metal and improved productivity. In order to investigate the loss in photo-activity of 1 NiO-3.5In 2 O 3 /TiO 2 catalyst, the characterization analysis of fresh and used catalysts were conducted.XRD peaks of fresh and recycled catalysts in Fig. 4S have identical peaks revealing the catalyst remained stable at prolonged irradiation time in cyclic runs.Also XRD peaks other than TiO 2 were not detected, which confirmed that the catalyst had no impurities.The active metal states were investigated with XPS after the cyclic runs as depicted in Fig. 5S, indicating all the peaks of species are identical in fresh and used catalysts.Besides, a distinct peak at 453.20 eV was detected as TiO 2 was possibly being reduced to metal state (Ti o ) at long-term UV-light irradiations in the cyclic runs.CO production yield gradually decreased in the subsequent runs due to catalyst deactivation.One of the possible reasons is the saturation of the adsorption active sites.Recently similar observations have also been reported 41.Therefore, the loss in photoactivity of NiO-In 2 O 3 /TiO 2 involved the deactivation of catalyst due to the coverage of reaction intermediates on the active sites. In this study, CO and CH 4 were identified as the main photoreduction products during photocatalytic CO 2 reduction with H 2 over In 2 O 3 /TiO 2 and NiO-In 2 O 3 /TiO 2 monolithic catalysts.Photocatalytic CO 2 reduction is a multi-electron process, which involves photo-excited electron (e A ) and hole (h ) generation over the semiconductor surface with light energy as well as transfer of charges, O-C-O bonds breaking, and formation of C-O, and C-H bonds.The reaction in Eqs. ( 8)-( 18) may express the pathways of CO 2 photoreduction to CO and hydrocarbons. Eqs. ( 8)-( 10) reveal photo-excited electron-hole pair production and their trapping by Ni and In metals, thus increasing the lifetime of charges to precede oxidation and reduction processes.CO 2 reduction by electrons and H 2 oxidation with holes is illustrated in Eqs.(11) and (12).Reactions in Eqs. ( 13) and ( 14) divulge reduction of CO 2 to CO and CH 4 through utilization of H ions and electrons.The reactions for C 2 -C 3 hydrocarbons are illustrated in Eqs. ( 15)- (18).The evolution of CO was much higher which confirmed effective reverse water-gas shift reaction in the presence of NiO-In 2 O 3 co-doped TiO 2 monolithic catalysts.Fig. 11 illustrates the simple mechanism of CO 2 photoreduction with H 2 over NiO-In 2 O 3 /TiO 2 supported over monolith micro-channels.When light strikes over the TiO 2 surface, electron-hole are photo-generated to initiate a photocatalytic reaction.The electrons migrate to the NiO and In 2 O 3 cluster, while holes spread on the TiO 2 surface.H 2 molecule is dissociated to H ions while CO 2 is reduced to CO and hydrocarbons by accepting the trapped electrons and H ions."
  },
  {
    "title": "Conclusions",
    "content": "Nanostructured nickel and indium co-doped TiO 2 photocatalysts with different doping levels and calcination temperature and H 2 as a reducing agent for photocatalytic CO 2 reduction were tested for the first time in a monolith photoreactor.Using calcination temperature of 500 C, pure crystalline and anatase phase TiO 2 was produced.Loading NiO and In 2 O 3 metals into TiO 2 produced mesoporous TiO 2 of high surface area and increased pore volume.Both NiO-In 2 O 3 co-doping in TiO 2 has no significant effect on the band gap energy, but promoted the separation of the photogenerated electrons and holes efficiently.Significant enhancement of CO 2 photoreduction to CO was observed through RWGS reaction over NiO-In 2 O 3 co-doped TiO 2 in a monolith photoreactor.The formation of CO during CO 2 photo-reduction depended on higher photo-activity of NiO and In 2 O 3 co-metals doped into TiO 2 , higher quantum efficiency of monolith photoreactor and H 2 as reductant.More importantly, the higher CO evolution was probably due to improved charge separation in TiO 2 supported monolith microchannels in the presence of Ni and In ions, which served as electron traps and suppressed electron-hole recombination.The quantum efficiency for CO production was significantly enhanced over NiO-In 2 O 3 /TiO 2 catalysts in the monolith photoreactor due to efficient light distribution and harvesting inside micro-channels channels.The stability test revealed yield rates and selectivity of CO partially decreased with more cycles.The new photocatalytic system could improve the CO 2 photoreduction to fuels applications towards one step closer to commercializing photo-technology. Fig.1Spresents the XRD patterns of TiO 2 , In 2 O 3 /TiO 2 and NiO-In 2 O 3 /TiO 2 samples calcined at 500 C.The crystalline and anatase phases of TiO 2 were observed in all samples.However, peaks ascribed to Ni and In in metal or oxides states were not detected.This was possibly due to low NiO and In 2 O 3 contents, which were below the detection limit of XRD or the species were dispersed well over the TiO 2 surface.Compared to TiO 2 , the peaks of In 2 O 3 / TiO 2 and NiO-In 2 O 3 /TiO 2 became broader suggesting smaller TiO 2 crystal size.The average crystalline size of the samples are listed in Table1.Obviously, a gradual decrease in the crystallite sizes could be seen with NiO and In 2 O 3 loading15,21.The cell parameters and cell volumes of TiO 2 , In 2 O 3 /TiO 2 and NiO-In 2 O 3 /TiO 2 samples are also listed in Table1.Both cell parameters and cell volumes are compared with those reported in JCPDS-ICSD (89-4921) standards for anatase TiO 2 i.e. a b 3.777 A, c 9.501 A, and v 135.54A 3 .It can be seen NiO and In 2 O 3 co-loading did not alter the cell structure of fully developed tetragonal crystal shape of anatase TiO 2 .Fig. 1 exhibits high magnification SEM images and EDX mappings of pure TiO 2 and 1 NiO-3.5In 2 O 3 /TiO 2 catalysts.The uniform and spherical nanoparticles of TiO 2 with mesoporous structure are obvious in Fig. 1(a).The EDX mapping analysis in Fig. 1(b) and (c) shows the presence of Ti and O elements in TiO 2 .Meanwhile, it can be observed, that NiO and In 2 O 3 doped TiO 2 nanoparticles have a smaller particle size, more mesoporous structure compared with TiO 2 as shown in Fig. 1(d) and (g).However, agglomerate formations can be seen in both types of samples.The EDX mapping analysis in Fig. 1(e) and (f) reveals uniform distribution of In 2 O 3 over TiO 2 surface.The EDX analysis of NiO-In 2 O 3 /TiO 2 sample is presented in Fig. 1(h) and (i), confirming the presence of NiO and In 2 O 3 in TiO 2 .Noticeably, both metals (NiO and In 2 O 3 ) were evenly distributed over the TiO 2 surface.Fig. 2 exhibits the TEM micrographs of the mesoporous NiO-In 2 O 3 /TiO 2 catalyst coated over monolith channels.From Fig. 2 (a), the TEM image reveals the uniform distribution of NiO-In 2 O 3 /TiO 2 nanoparticles with mesoporous structure.Fig. 2(b) displays the particle size distribution of NiO-In 2 O 3 /TiO 2 catalyst in the range of 6-18 nm with a mean value of 13.40 nm.Thus, distinct nanoparticle size and mesoporosity prevailed in NiO-In 2 O 3 /TiO 2 catalyst.Fig. 2(c) and (d) exhibit the lattice fringe spacing of TiO 2 Fig. 4(a) displays the diffuse reflectance absorbance spectra of the TiO 2 , In 2 O 3 /TiO 2 and NiO-In 2 O 3 /TiO 2 samples.Compared to pure TiO 2 , a shifting in absorption edges towards UV-region was Fig. 1.SEM micrographs and EDX analysis of TiO 2 , In 2 O 3 /TiO 2 and NiO-In 2 O 3 /TiO 2 samples: (a) SEM image of TiO 2 , (b) and (c) EDX mapping of TiO 2 and elemental analysis, (d) SEM image of 3.5 In 2 O 3 /TiO 2 , (e) and (f) EDX mapping of 3.5 In 2 O 3 /TiO 2 and elemental analysis, (g) SEM image of 1.0 NiO-3.5In 2 O 3 /TiO 2 , (h) and (i) EDX mapping and elemental compositions of 1.0 NiO-3.5In 2 O 3 /TiO 2 . Photon energy (eV) Fig. 5. Effect of reducing agent on photocatalytic CO 2 reduction over TiO 2 at at 100 C and irradiation time of 2 h. Fig.6.Effect of reaction temperatures (100, 120 and 140 C) on CO 2 photoreduction with H 2 to CO and CH 4 over 1.0 NiO-3.5In 2 O 3 /TiO 2 at CO 2 /H 2 1.5 in a monolith photoreactor. Photocatalysts Fig.9.Performance evaluation of cell type and monolith photoreactor for CO 2 photoreduction with H 2 over 1.0 NiO-3.5In 2 O 3 /TiO 2 catalyst at CO 2 /H 2 ratio 1.5 and 120 C. Fig. 10.Stability test on photoactivity of 1.0 NiO-3.5In 2 O 3 /TiO 2 catalyst for CO 2 photoreduction with H 2 to CO in a continuous monolith photoreactor at 120 C and CO 2 /H 2 ratio 1.5. 2 O 3 / TiO 2 and NiO-In 2 O 3 /TiO 2 became broader suggesting smaller TiO 2 crystal size.The average crystalline size of the samples are listed in Table 1.Obviously, a gradual decrease in the crystallite sizes could be seen with NiO and In 2 O 3 loading 15,21.The cell parameters and cell volumes of TiO 2 , In 2 O 3 /TiO 2 and NiO-In 2 O 3 /TiO 2 samples are also listed in Table 1.Both cell parameters and cell volumes are compared with those reported in JCPDS-ICSD (89-4921) standards for anatase TiO Cell parameters, crystallite sizes and crystallinity of pure TiO 2 and metal-doped TiO 2 samples. a Crystallite sizes calculated using Scherrer equation. Summary of physiochemical characteristics of TiO 2 and modified TiO 2 samples. XPS analysis summary of NiO-In 2 O 3 /TiO 2 nanocatalyst. 30,33 of yield of products and selectivity over TiO 2 and metal-doped TiO 2 catalysts.This was probably due to the oxidation of hydrocarbons with produced O 2 to CO 2 at prolonged irradiation time.The conversion of CO 2 and H 2 over TiO 2 was 1.7 and 2.4, respectively over un-doped catalyst and surged to 10.2 and 16.4 over the 1 NiO-3.5In 2 O 3 /TiO 2 catalyst, as illustrated in Fig.8(c).Fig.8(d)showsselectivity of CO and CH 4 over TiO 2 , In 2 O 3 /TiO 2 and NiO-In 2 O 3 /TiO 2 catalysts.It could be seen that CO production selectivity significantly increased for In 2 O 3 /TiO 2 and NiO-In 2 O 3 /TiO 2 catalysts probably due to marked increase in the conversion of CO 2 over metal-doped TiO 2 catalysts.These results revealed that In 2 O 3 / TiO 2 and NiO-In 2 O 3 /TiO 2 catalysts favored RWGS shift CO 2 reduction.We also reported similar observations previously30,33.Table5summarizes conversion, yield rates and selectivity of different products over various TiO 2 based catalysts during photocatalytic CO 2 reduction with H 2 as reducing agent under optimum operating conditions.The products observed were CO, CH 4 , C 2 H 4 , C 2 H 6 , C 3 H 6 and C 3 H 8 over TiO 2 , and metal-doped TiO 2 monolithic catalysts.The yield rate for CO production over NiO-In 2 O 3 /TiO 2 was 12,029 lmol g-catal.A1 h A1 .Meanwhile, the yield rates were 2028 lmol g-catal.A1 h A1 and 58 lmol g-catal.A1 h A1 for In 2 O 3 / TiO 2 and pure TiO 2 , respectively.The significantly enhanced photoactivity of metal-doped TiO 2 catalysts was due to the larger sur- Summary of products produced during photocatalytic CO 2 reduction with H 2 using TiO 2 and metal-doped TiO 2 catalysts coated over monolith channels.Products yield rates calculated on 8 h irradiation basis, CO 2 /H 2 feed ratio 1.5 and temperature 120 C. a Summary of operating parameters used for TiO 2 and doped TiO 2 catalysts and calculated quantum efficiencies.NiO-In 2 O 3 /TiO 2 NiO-In 2 O 3 /TiO 2 NiO-In 2 O 3 /TiO 2 a Optical fiber reactor.bInternallyilluminated monolith reactor.c Microchannel monolith reactor.d Cell type batch reactor.e Microchannel monolith reactor-batch process.f Microchannel monolith reactor-continuous process.g Quantum efficiency (number of electrons A moles of production rate)/(moles of UV photon flux). M. Tahir, N.A.S. Amin / Chemical Engineering Journal 285 (2016) 635-649 The authors would like to extend their deepest appreciation to the Ministry of Education (MOE) -Malaysia and Universiti Teknologi Malaysia (UTM) -Malaysia for the financial supports of this research under NanoMITE LRGS (Long Term Research Grant Scheme, Vot 4L839), RUG (Research University Grant, Vot 02G14) and FRGS (Fundamental Research Grant Scheme) (Vot 4F404). Supplementary data associated with this article can be found, in the online version, at http://dx.doi.org/10.1016/j.cej.2015.10.033."
  }
]