[
  {
    "title": "Doi",
    "content": "10.1039/d0nj05082b"
  },
  {
    "title": "Article_Title",
    "content": "Plasma-induced black bismuth tungstate as a photon harvester for photocatalytic carbon dioxide conversion"
  },
  {
    "title": "Abstract",
    "content": "The photocatalytic conversion of carbon dioxide into fuels and valuable chemicals is a promising avenue to address the challenge of environmental change.Plasma treatment as a popular and effective method to prepare and modify materials based on its ultra-high energy and efficiency has attracted significant attention.In this study, abundant Bi quantum dots (Bi QDs) are reduced in situ on the surface of black Bi 2 WO 6 nanosheets using an effective dielectric barrier discharge (DBD) plasma technology.The reduction of Bi QDs leads to the generation of a large number of unsaturated coordination atoms, which improves the light absorption performance of Bi 2 WO 6 .Benefiting from the unique interface design, black Bi 2 WO 6 shows superior CO generation rate, roughly threefold higher than that of pristine Bi 2 WO 6 nanosheets.Our work provides new insights and can be a reference in plasma modification engineering of catalyst surfaces and photoreduction of CO 2 ."
  },
  {
    "title": "Experimental",
    "content": "All chemicals including sodium tungstate dihydrate (Na 2 WO 4 A 2H 2 O), bismuth nitrate pentahydrate (Bi(NO 3 ) 3 A5H 2 O), hexadecyl trimethyl ammonium bromide (CTAB), absolute ethyl alcohol, acetonitrile, and triethanolamine were purchased and used without further purification. The Bi 2 WO 6 ultrathin nanosheets were prepared by a one-pot hydrothermal method.A typical experiment is as follows: 1 mmol Na 2 WO 4 A2H 2 O, 2 mmol Bi(NO 3 ) 3 A5H 2 O, and 0.1 g CTAB were added in a 100 mL beaker and dissolved in 80 mL of deionized water by a magnetic stirrer.The mixed solution was stirred at room temperature for 40 min.Subsequently, the solution was transformed into a 100 mL Teflon-lined autoclave.The autoclave was sealed into a steel tank and transferred into an oven, and treated at 120 1C for 24 h.In the end, the precipitate was collected and washed several times with deionized water and ethanol by centrifugation.Finally, the collected samples were dried at 60 1C for 12 h. Subsequently, the as-prepared Bi 2 WO 6 ultrathin nanosheets were treated by DBD plasma.Firstly, Bi 2 WO 6 ultrathin nanosheets (50 mg) were fixed to a quartz plate and placed in a discharge reactor.Secondly, the discharge reactor was vacuumed.The atmosphere mixture of Ar and 5 H 2 was bubbled into the reactor as the reaction gas, and a gas flow rate of 200 mL min A1 was maintained.Under 50 W input power at room temperature, the Bi 2 WO 6 powder was treated by DBD plasma for 3, 6, and 9 min.Finally, the resulting products were collected and named as X-BT (X 3, 6, and 9)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "In order to clarify the possible impact on the chemical composition and lattice structure caused by the Ar-H 2 plasma treatment, indicating the presence of elemental Bi in X-BT.Since there are no other Bi sources except for Bi 2 WO 6 , it can be inferred that Bi 3 in Bi 2 WO 6 photocatalysts is reduced to Bi after the Ar-H 2 plasma treatment, and a large number of unsaturated coordination atoms are produced simultaneously.Furthermore, with the extension of the treatment duration, the peak intensities of Bi also increased, suggesting that the amount of reduced elemental bismuth gradually increases. 48o investigate the influence of the plasma treatment on the surface structure, scanning electron microscopy (SEM) was performed on the samples while in the morphological state.The SEM images in Fig. 2b andc show that both Bi 2 WO 6 and 6-BT catalysts present a petal-like structure and demonstrate a thin sheet morphology with an average length of around 1 mm.Notably, nearly no change in 6-BT was observed by the in situ reduction treatment using plasma as compared to pristine Bi 2 WO 6 (Fig. 2c), which suggests that the plasma treatment did not change the pristine morphological structure of photocatalysts.The transmission electron microscopy (TEM) was carried out to further reveal the morphological structure of 6-BT.To our surprise, a spectacular difference was observed using TEM as a reference (Fig. 2d ande), which presented small granular protrusions on 6-BT.These granular protrusions were mainly formed by aggregated nanoparticle units during the reduction process.To further observe the surface microstructure of the as-prepared catalyst and clarify the granular protrusions, high-resonance transmission electron microscopy (HRTEM) was performed.Two different lattice spacings are observed in the HRTEM image of 6-BT (Fig. 2f).The 0.272 nm d-spacing is assigned to the (200) facet of the orthorhombic Bi 2 WO 6 crystal phase, and the 0.328 nm lattice spacing (Fig. 2f) is attributed to the (012) facet of metallic Bi with the rhombohedral crystal phase, 18,31 which is in accordance with the XRD results.Interestingly, the metallic Bi particles are well separated from each other and spread out on the surface of nanosheets.Moreover, the size of metallic Bi particle units was in the range of 4.0-8.0nm, which could be regarded as Bi QDs (Fig. S5,ESI ).The SAED image (inset of Fig. 2e) indicates that 6-BT possesses a polycrystalline structure with a high crystallization degree, as evidenced by the bright diffraction rings.Combined with the previous XRD patterns, these results strongly suggest that Bi QDs were successfully reduced in Bi 2 WO 6 nanosheets by the plasma-enhanced treatment. X-Ray photoelectron spectroscopy (XPS) was further used to identify whether Bi QDs were reduced on the black Bi 2 WO 6 surface.The survey spectrum (Fig. S1,ESI ) indicates the existence of Bi, W, and O elements.In order to investigate the difference between Bi 2 WO 6 and 6-BT, all peaks were put into the same chart and compared.New peaks were not observed in the 6-BT curve, indicating that the Ar-H 2 plasma process did not alter the elemental composition of photocatalysts.However, some changes were observed in the XPS spectrum of each element.The Bi 4f spectrum exhibits two distributions, 4f 7/2 and 4f 5/2 , located at 159.35 eV and 164.60 eV (Fig. 3a), which can be assigned to Bi 3 species.When referring to the peaks of 6-BT, in addition to these peaks, two new peaks of 6-BT appeared at 156.75 eV and 162.05 eV, which could be attributed to the presence of elemental bismuth.This result is consistent with the conclusion obtained by analyzing XRD, which proved the existence of Bi in 6-BT.Moreover, it can be observed that the Bi 4f peaks of the 6-BT spectrum shifted significantly (159.30eV and 164.55 eV), which provides evidence about the interaction between Bi and Bi 2 WO 6 species. Furthermore, the XPS spectrum of W 4f contains two individual peaks situated at 35.56 eV and 37.70 eV, corresponding to the W 4f 7/2 and W 4f 5/2 , which can be assigned to W 6 species (Fig. 3c).In contrast, the positions of W in the 6-BT spectrum shifted to the lower wavenumber (35.40 eV and 37.54 eV).Thus, we could infer that Bi precipitation stimulates the reduction of Bi 3 coordination, leading to the absorption of more electrons in W 6 .Simultaneously, the peak of O 2p (Fig. S2, ESI ) can be fitted into two peaks.Strikingly, the peaks located at 530.18 eV and 531.68 eV could be assigned to O 2p 3/2 and O 2p 1/2 , respectively.The first peak represents the lattice oxygen in the Bi 2 WO 6 crystal, while the second peak belongs to the hydroxyl oxygen adsorbed on the surface of the catalyst.Due to the reduction of Bi 3 in 6-BT to Bi, the increase in Bi and decrease in Bi 3 leads to more defects and adsorption of more hydroxyl groups.Therefore, more hydroxyl groups are adsorbed on the surface of 6-BT, which is consistent with the increase in O 2p 1/2 .The above XPS results are consistent with XRD and TEM results, unequivocally illustrating the successful synthesis of Bi and the generation of a large number of unsaturated coordination atoms. Based on the above conclusions, the solar-driven CO 2 photoreduction activities are evaluated under visible light irradiation and suitable conditions (10 1C, 70 kPa).Fortunately, it is observed that the CO 2 photoreduction activities of X-BT samples significantly improved compared to those of pristine Bi 2 WO 6 (Fig. 4a).Among them, Bi 2 WO 6 with a treatment time of 6 min exhibits the highest photocatalytic reduction activity with the increase in the CO yield rate from 16.8 mmol g A1 h A1 (untreated) to 56.5 mmol g A1 h A1 (6-BT), which is about threefold.At the same time, the production of CH 4 increases from 0 (undetected) to 6.95 mmol g A1 h A1 (6-BT).It follows from the analysis of reaction kinetics that it may be due to the accumulation of a large amount of CO, leading to further CO 2 conversion reaction. 49Thus, a small amount of CH 4 is produced.The obvious performance amelioration of samples with appropriate plasma treatment duration could be ascribed to the formation of Bi QDs.In order to exclude the influence of experimental factors, further control experiments were carried out, and the results are shown in Fig. 4b.Columns 2 and 3 display that no CO yield was detected when the reaction was carried out without a catalyst or in a dark environment, and the photocatalytic activity of Bi-Bi 2 WO 6 (6-BT) is significantly suppressed, verifying the crucial role of catalysts and light as driving forces in the CO 2 reduction.In addition, no product has been detected when Ar replaced CO 2 (column 4), demonstrating that CO and CH 4 are derived from CO 2 .The above control experiments demonstrate that Bi-Bi 2 WO 6 can effectively reduce CO 2 to CO (even CH 4 ) in the presence of light.Considering that stability also plays a very important role in photocatalytic reactions, we conducted a 12 hours photocatalytic experiment on Bi-Bi 2 WO 6 (6-BT).It can be seen from Fig. 4c that the CO and CH 4 outputs of the Bi-Bi 2 WO 6 photocatalyst show a steady increase, indicating the high stability of the sample.The XRD pattern and SEM image of Bi-Bi 2 WO 6 before and after the reaction showed that the catalyst morphology and structure did not change (Fig. S6 and S7, ESI ).As expected, the introduction of Bi QDs greatly enhances the solar-driven photochemical reduction performance of CO 2 into valuable fuels. It is worth noting that the color of Bi 2 WO 6 and 6-BT changed from white to black after the plasma treatment, which helps to improve the light absorption capacity of the catalyst.The ultraviolet-visible diffuse reflectance spectra (DRS) shown in Fig. 5a confirm this phenomenon.It is obvious that Bi 2 WO 6 exhibits the absorption edge at around 450 nm, while the absorption edge of the 6-BT catalyst in the visible light range has a significant red-shift to 490 nm.Moreover, the ability of photo-absorption is enhanced with the increase in the plasmatreated duration outside the range of 450 nm.The conversion diagram of the Kubelka-Munk function and light energy is shown in Fig. 5b.Compared with the pristine Bi 2 WO 6 , whose bandgap is 3.01 eV, the bandgap of X-BT narrows down to 2.86 eV, 2.76 eV, and 2.30 eV for X 2, 3, 6 respectively (Fig. S3, ESI ).The enhanced visible light absorption of the photocatalyst and the bandgap reduction would contribute to the enhancement of the photocatalytic activity.With the plasma treatment time increases, the content of Bi QDs also increases.Compared to pristine Bi 2 WO 6 , the 6-BT curve shows that the samples after being doped with Bi QDs can harvest more light, which is attributed to the increase in the elemental Bi content reflected in the XRD spectrum.Based on the above-mentioned results, we can conclude that Bi QDs can effectively regulate the bandgap structure and improve the optical absorption of Bi 2 WO 6 , moreover, we can see the potential of Bi QDs as an aid for the reduction of photocatalytic CO 2 . Brunner-Emmett-Teller (BET) measurements by N 2 adsorption isotherms of both Bi 2 WO 6 (Fig. 6a) and 6-BT (Fig. 6b) show typical type-IV N 2 adsorption and desorption isotherms, with a small H 1 hysteresis loop in the range of 0.8-1.0under relative pressure (P/P 0 ).The BET surface area of 6-BT (25.76 m 2 g A1 ) is lower than that of pristine Bi 2 WO 6 (34.53 m 2 g A1 ), which may be attributed to a partial deposition of Bi QDs into the Bi 2 WO 6 pores.Furthermore, the pore size of pristine Bi 2 WO 6 could be observed in the range of 2-16 nm, but that of 6-BT decreased to 15 nm.According to the IUPAC classification, both catalysts have typical mesoporous structures, usually related to fissure pores. 50,51The decrease in the pore size and specific surface area could be attributed to the blocking by Bi.To evaluate the potential of Bi QDs for CO 2 reduction, it is necessary to conduct optoelectronic or electrochemical experiments of photocatalysts.The steady-state photoluminescence (PL) analysis reveals the role of Bi QDs in the separation of photogenerated electron-hole pairs.From the PL spectrum of two catalysts (Fig. 7a), excited by a specific wavelength of 300 nm, it can be inferred that the emission peak intensity of the 6-BT catalyst decreases significantly in the range of 380-680 nm compared with that of pristine Bi 2 WO 6 , indicating that it had a strong inhibitory effect on the carrier recombination.This result indicates that the separation efficiency of 6-BT has been significantly improved due to the presence of Bi QDs.Simultaneously, the photocurrent response of Bi 2 WO 6 and 6-BT is further studied under visible-light irradiation, and the related analysis is shown in Fig. 7b.The curve of 6-BT is significantly higher than that of Bi 2 WO 6 , which is consistent with the analysis results of PL, indicating that the separation efficiency of the photogenerated carriers of 6-BT is prominently improved.It is further proved that Bi QDs could inhibit photogenerated electron-hole pair recombination. Furthermore, according to the electrochemical impedance spectra (EIS) shown in Fig. 7c, the minimum arc radius of the 6-BT Nyquist curve is smaller than that of the untreated Bi 2 WO 6 , indicating that photogenerated electrons are more easily diffused and transferred in 6-BT.The result above manifests that Bi QDs, as a good conductor of electrons, are more conducive to carrier transfer from the interior to the surface of the catalyst.Consequently, after the Ar-H 2 plasma treatment, the bismuth quantum dots could enhance the lightabsorption of the photocatalyst and simultaneously improve the separation efficiency of photogenerated electrons and holes. The Fourier transform infrared spectroscopy (FT-IR) measurement is carried out in situ to obtain deeper insights into the process of CO 2 photoreduction on Bi 2 WO 6 and 6-BT photocatalysts.It is found that the intermediates for CO 2 conversion exhibit some changes.As shown in Fig. 8, several peaks were observed in the range from 2000 cm A1 to 1100 cm A1 .Peaks located at 1385 cm A1 and 1216 cm A1 are attributed to bicarbonate (HCO 3 A ) groups, peaks at 1619 cm A1 and 1458 cm A1 belong to the bidentate carboxylate (CO 2 ) groups, peak at 1657 cm A1 is attributed to the H 2 O molecule adsorbed by the catalyst, and other peaks are attributed to carbonate groups. 52Among them, the asymmetric OQCQO stretch of (b-CO 3 ) groups is at 1355 cm A1 and that of monodentate carbonate (m-CO 3 2A ) groups it is at 1298 cm A1 . 53With the extension of irradiation time to 30 min, all these peak intensities also enhanced.By comparing the FT-IR spectra of untreated Bi 2 WO 6 and 6-BT, the concentrations of the two active intermediates, b-CO 3 2A at 1355 cm A1 and CO 2 A at 1619 cm A1 , increase rapidly with the increase in the reaction time and is the fastest among all peaks.These results indicate that 6-BT produces more CO 2 A and b-CO 3 2A intermediates in the process of photocatalytic CO 2 reduction, which effectively improves the activity of the solar-driven CO 2 reduction.Based on the above experimental results, we propose a possible photocatalytic CO 2 reduction mechanism of the X-BT photocatalyst (Fig. 9).Under light irradiation, Bi 2 WO 6 would be excited to produce photo-generated carriers (electrons and holes).Since Bi QDs have good conductivity, they can significantly enhance the visible light absorption capacity of Bi 2 WO 6 to generate more electron-hole pairs and conduct the photogenerated electrons.The excited electrons would transfer to Bi QDs immobilized on the surface of Bi 2 WO 6 , leaving a hole in the VB.Then, the photo-induced electrons would react with CO 2 to form CO. In this whole process, Bi QDs serve as an electron trap to induce the efficient separation of photogenerated electrons and holes.The photocatalytic CO 2 reduction activity of X-BT is finally improved by reducing the photogenerated electron-hole recombination, thus increasing the utilization efficiency of photogenerated electrons and holes."
  },
  {
    "title": "Conclusions",
    "content": "In summary, we successfully synthesized Bi 2 WO 6 nanomaterials with tunable Bi QDs using an efficient and simple DBD plasma-enhanced approach.Under the interaction of high-energy particles and H 2 , Bi 3 ions in Bi 2 WO 6 are reduced to Bi QDs and attached to the surface of the nanosheet.The as-prepared X-BT samples exhibited promising photocatalytic stability and performance in the reduction of CO 2 .The CO evolution rate of 6-BT was up to 56.5 mmol g A1 h A1 , which is roughly three times that of the pristine Bi 2 WO 6 .The remarkable enhancement mainly originated from the self-doping of Bi QDs and the formation of a large number of unsaturated coordination atoms, resulting in the photo-absorption enhancement, narrower bandgap, and ameliorative separation efficiency of photogenerated carriers.This work not only opens new possibilities in the emerging field of non-noble metal doping but also provides an insightful understanding of the plasma surface-modification engineering in the solar-driven CO 2 conversion. Fig. 1 Schematic of the synthetic procedure of X-BT ultrathin nanosheets. Fig. 2 The XRD patterns (a) of pristine Bi 2 WO 6 and X-BT (X 3, 6, and 9).The SEM images of pristine Bi 2 WO 6 (b) and 6-BT (c).The TEM images (d and e) and HRTEM image (f) of 6-BT.Inset of (e): SAED image. Fig.3The XPS high-resolution spectra of Bi 4f (a and b) and W 4f (c). Fig. 4 The photocatalytic activity (a) of original Bi 2 WO 6 and X-BT.The photocatalytic activity of Bi-Bi 2 WO 6 (6-BT) (b) under different test conditions.The photocatalytic stability (c) of Bi-Bi 2 WO 6 (6-BT). Fig.5The UV-vis diffuse reflection spectrum (a) of BT and 6-BT, and the inset is the photograph of BT and 6-BT in the aqueous solution.The Tauc plots (b) of BT and 6-BT. Fig.6The N 2 adsorption-desorption isotherms and pore size distribution curves of Bi 2 WO 6 (a) and 6-BT (b). Fig. 7 The photoluminescence (PL) spectrum (a), photocurrent response (b), and electrochemical impedance spectrum (c) of original Bi 2 WO 6 and 6-BT. Fig. 8 The in situ infrared spectrum of the photocatalytic reduction of CO 2 : original Bi 2 WO 6 (a) and 6-BT (b). This journal is The Royal Society of Chemistry and the Centre National de la Recherche Scientifique 2021 Fig.9The mechanism of solar-driven CO 2 photoreduction for X-BT (X 3, 6, and 9). This study was supported by National Natural Science Foundation of China (2207051017), Jiangsu Fund for Distinguished Young Scientists (BK20190045), High-tech Research Key Laboratory of Zhenjiang (SS2018002), Key Laboratory of Electrochemical Energy Storage and Energy Conversion of Hainan Province (KFKT2019002), and the High Performance Computing Platform of Jiangsu University. There are no conflicts to declare."
  }
]