[
  {
    "title": "Doi",
    "content": "10.1007/s12274-018-2240-4"
  },
  {
    "title": "Article_Title",
    "content": "Single titanium-oxide species implanted in 2D g-C3N4 matrix as a highly efficient visible-light CO2 reduction photocatalyst"
  },
  {
    "title": "Abstract",
    "content": "A visible-light-response, efficient and robust photo-catalyst for CO 2 reduction is highly desirable.Herein, we demonstrate that single titanium-oxide species implanted in two-dimensional (2D) graphitic carbon nitride (g-C 3 N 4 ) matrix (2D TiO-CN) can efficiently photo-catalyze the reduction of CO 2 to CO under the irradiation of visible light.The synergistic interaction between single titanium oxide species and g-C 3 N 4 in 2D TiO-CN not only enhances the separation of photo-excited charges, but also results in visible light response of single titanium-oxide species, realizing high activity of CO 2 photo-reduction with extremely high CO generation rate of 283.9 molh -1 g -1 , 5.7, 6.8 and 292.2 times larger than those of TiO 2 /CN hybrid material, CN and commercial TiO 2 , respectively.Time-resolved fluorescence and electron spin resonance spectroscopy revealed the catalytic mechanism of the fabricated 2D TiO-CN photocatalysts for CO 2 reduction."
  },
  {
    "title": "Experimental",
    "content": "Dicyandiamide (DCDA, Sinopharm Chemical), titanium tetrachloride (TiCl4, Aladdin), cobalt chloride hexahydrate (CoCl26H2O, General-Reagent), 2,2'-bipyridine (Adamas Reagent), triethanolamine (TEOA, General-Reagent), and commercial TiO2 (P25, General-Reagent) are commercially available.All the other reagents were purchased from General-Reagent with analytical grade and were used directly without further purification. The X-ray powder diffraction (XRD) of all the materials were carried out by using a Smart X-ray diffractometer (SmartLab 9 KW, Rigaku, Japan) with Cu K radiation ( 1.54178A).X-ray photoelectron spectra (XPS) were carried out by an X-ray spectrometer (ESCALAB 250 Xi spectrometer, Thermo Scientific, USA) with Al K as the excitation source.The transmission electron microscopy (TEM) images were acquired on a Transmission Electron Microscope with a LaB6 Gun (Tecnai G2 Spirit TWIN, FEI, USA) at an acceleration voltage of 120 kV.The scanning electron microscopy (SEM) images were acquired on an Environmental Scanning Electron Microscope with FEG (Quanta FEG 250, FEI, USA).Energy-dispersive X-ray spectroscopy (EDS) mapping images were taken on a High-Resolution Transmission Electron Microscope with FEG (Talos F200X, FEI, USA).The photoluminescence (PL) spectra were performed by a fluorescence spectrophotomer (F-7000, Hitachi, Japan).The timeresolved fluorescence (TRF) results were tested by another fluorescence spectrophotomer (Horiba FL-3, HORIBA Scientific, USA).The electron spin resonance (ESR) spectroscopy was carried out on an EPR spectrometer (EXMplus6-1, Bruker, Germany).The content of titanium in TiO-CN was quantified by an inductively coupled plasma mass spectrometry (NEXION300, PerkinElmer, USA).The ultravioletvisible diffuse reflectance spectra (UV-vis DRS) were obtained by a UV-vis spectrophotometer (UV-3600, Shimadzu, Japan).The liquid phase of the reaction system was analyzed by an ion chromatograph (DX-600, Dionex, USA). According to the literature 29, 1 mL of TiCl4 was added in 300 mL aqueous solution of 25 g of NH4Cl at room temperature.Simultaneously, 1 g of DCDA and 5 g of NH4Cl were dissolved in deionized water at 50 C, then cooled down to room temperature, followed by the addition of 7 mL of the above aqueous solution of TiCl4.The formed solution was subjected to freeze-drying for 48 h.Subsequently, the freeze-dried powder was placed in a covered crucible under air and heated at 550 C for 4 h with a heating rate of 3 C/min.The cooled powder was then washed by deionized water and ethanol, and then dried in an oven at 60 C for 24 h. The CN was synthesized through the same process with 2D TiO-CN but without adding the aqueous solution of TiCl4. The time-resolved fluorescence experiments for 2D TiO-CN and CN suspensions under different conditions were carried out by successively adding equivalents of Co(bpy)3Cl2 (bpy bipyridine) (co-catalyst), TEOA (sacrificial agent) into the suspension of 2D TiO-CN or CN dispersing in MeCN/H2O (v:v 3:1) under argon atmosphere, respectively. The photocatalytic CO2 reduction was carried out in a quartz tube (17.5 mL) in which 3 mg catalyst powder was ultrasonically dispersed in a solution of acetonitrile (3 mL), deionized water (1 mL), triethanolamine (1 mL), CoCl26H2O (0.25 mol), and bipyridine (15 mg).The mixture was bubbled with argon for 30 min and then with CO2 for another 30 min under stirring.The reaction temperature was maintained at 25 C through circulating a flow of water.The photocatalytic reaction was illuminated by a 300 W Xe lamp with a 420 nm cutoff filter under vigorous stirring.The produced gases (CO, CH4 and H2) were detected at one time by a gas chromatography (GC-2014ATF, 230C, Shimadzu, Japan) equipped with two automated gas sampling valves, which contain a thermal conductivity detector (TCD) and a flame ionization detector (FID).The carrier gas used in GC-2014ATF, 230C was argon. The photocurrent measurements were performed using an electrochemical workstation (CHI760E) with a standard threeelectrode photoelectrochemical cell, where the prepared fluoride tin oxide (FTO) coated with samples, platinum wire and Ag/AgCl act as the working, auxiliary, and reference electrode, respectively.The electrodes were immersed in a sodium sulfate electrolyte solution (0.5 M, pH 6.8), which was purged with N2 for 30 min before the test.The working electrodes were prepared as follows: First, FTO glasses were washed sequentially with acetone and ethanol in an ultrasonic bath for 20 min.Next, 2 mg of photocatalyst was dispersed in a mixed solution of ethanol (0.75 mL), deionized water (0.25 mL) and Nafion (5 L) with ultrasonic treatment for 2 h.Then the solution was ground to obtain slurry and uniformly coated onto the 1 cm 2 cm FTO.The coated FTO were dried at room temperature for 6 h.The photocurrent was measured at -0.4 V (vs.Ag/AgCl) with a 300 W Xe lamp by intermittent irradiation. The ESR experiments were performed at room temperature by the following steps: 3 mg of 2D TiO-CN was ultrasonically dispersed in the solution of MeCN (3 mL), TEOA (1 mL) and H2O (1 mL) to get a uniform suspension, and then bubbled with argon for 30 min and sealed.At the same time, the test tube of ESR was also bubbled with argon and sealed.Next, after 30 min of irradiation (300 W Xe lamp with a 420 nm cutoff filter), a certain amount of the suspension was transfered through capillary action to a specialized ESR capillary tube which was then quickly sealed in the ESR test tube under the argon flow.Afterwards, the ESR test was initiated by the in-situ irradiation of another Xe lamp (300 W with a 420 nm cutoff filter).The quenching spectra caused by Co(bpy)3Cl2 (TEOA) were carried out through in the same procedure except for additionally injecting 1 mL of Co(bpy)3Cl2 (TEOA) solution (0.1 M) dissolved in MeCN and H2O (v:v 3:1 ) after 30 min of irradiation."
  },
  {
    "title": "Results_and_Discussion",
    "content": "In this study, 2D TiO-CN nanosheets were synthesized by a simple dicyandiamide-blowing method 29, whereby ammonia chloride and titanium chloride were utilized as precursors, and the synthesis details are given in the Experimental section.The structural information of 2D TiO-CN nanosheets were obtained from XRD and XPS.As shown in Fig. 1(h), after the incorporation of titanium oxides in CN matrix, its XRD pattern is similar to that of CN, and no peaks ascribed to TiO2 or other titanium oxides can be observed, indicating the original structure of CN was maintained and no Ti particles/ clusters formed after incorporation of titanium oxides.The XPS spectra were further used to understand the coordination environments of titanium in CN.As shown in Fig. 1(i), for Ti 2p, the two main peaks correspond to the characteristic peaks of Ti 2p3/2 and Ti 2p1/2, respectively.These two main peaks can be divided into four peaks at 458.1, 463.8, 459.0 and 464.8 eV, which can be ascribed to the co-existence of Ti-N (458.1 and 463.8 eV) and Ti-O (459.0 and 464.8 eV) bonds in 2D TiO-CN 293031.What's more, the ratio of Ti-N and Ti-O is calculated to be 6:1 according to the area of their corresponding peaks, inferring that the single titanium oxide species are anchored in the nitrogen pots of CN as O-Ti-N6 coordination 29.The O 1s region in 2D TiO-CN shows the binding energy at 530.1 and 531.7 eV, of which the first peak could be ascribed to the O in the N-Ti-O bonds, while the peak located at 531.7 eV is attributed to O2 absorbed at the surface of CN (Fig. S4 in the Electronic Supplementary Material (ESM)).The above results clearly demonstrate that abundant single titanium oxide species are successfully implanted in the matrix of CN nanosheets. The morphology and composition of 2D TiO-CN nanosheets were evaluated by TEM and atomic resolution high angle annular dark-field scanning transmission electron microscopy (HAADF-STEM).As shown in Fig. 1 With the single titanium oxide species incorporated in CN matrix, there is an obvious improvement in visible-light absorption, as shown in the UV-visible absorption spectra as exhibited in Fig. 2(a).To verify the electron-hole separation in single titanium oxide sites and the CN support, PL spectra and TRF were performed.The PL spectra of 2D TiO-CN collected at room temperature show significantly damped emission compared with that of pristine CN, demonstrating more efficient charge separation at 2D TiO-CN 32.To further comprehend photophysical characteristics of photoexcited carriers of 2D TiO-CN and CN, the TRF spectra were recorded (Fig. 2(c)).As exhibited in Table S1 in the ESM, the average radiative lifetime obtained from the TRF spectra for 2D TiO-CN and CN is 6.440 and 3.442 ns, respectively, demonstrating a much higher separation efficiency of electrons and holes in 2D TiO-CN than that in CN, and bringing big potential application in the photocatalytic reaction 33.In addition, an increased photocurrent for 2D TiO-CN is generated as shown in Fig. 2(d), which is about four times larger than that of CN, further confirming the improvement of the separation efficiency of photoinduced carriers in 2D TiO-CN 34, consistent well with the results from the PL and TRF spectra.Therefore, enhanced visible-light absorption and higher separation efficiency of photoinduced carriers would promote performance of 2D TiO-CN in photocatalytic CO2 reduction. To evaluate the performance of 2D TiO-CN for CO2 photo-reduction, we have investigated its catalytic behavior in a MeCN/H2O/TEOA (v:v:v 3:1:1) solution 35.The experiment details are given in the Experimental section.As a result, this photocatalytic system could evolve H2 and CO as gaseous products, and no liquid products were detected in the reaction mixture by ion chromatography.As shown in Fig. 3(a), the ratio of CO and H2 can be engineered by adjusting the amount of Co(bpy)3Cl2 co-catalyst.In view of the amount and selectivity of CO production, we added 0.25 mol co-catalyst in our study system to perform further photo-reduction of CO2.To study the synergistic effect of single titanium oxides and CN, the activity of photocatalytic CO2 reduction of 2D TiO-CN, TiO2/CN hybrid nanocomposites, CN and commercial TiO2 were tested.As exhibited in Fig. 3(b), 2D TiO-CN shows the highest CO generation rate of 283.9 molh -1 g -1 within 6 h irradiation, which is 5.7 (49.4 molh -1 g -1 ), 6.8 (41.5 molh -1 g -1 ) and 292.2 times larger than those of TiO2/CN hybrid material, CN and commercial TiO2, respectively.As shown in Fig. 3(b), the yield of CO was increased with increasing of the reaction time and the CO production rate has an obvious decrease after reacting for 6 h.This phenomenon was ascribed to the partial deactivation of co-catalyst during the photocatalysis (Fig. S6 in the ESM).By comparing 2D TiO-CN with some well-developed CO2 photocatalysts based on CN, it can be seen that the 2D TiO-CN displays a much higher activity for CO2 photo-reduction over these materials based on CN (Fig. 3(d) and Table S2 in the ESM) 232425353637383940.Moreover, 2D TiO-CN shows good stability in recycling tests, as only 9 of activity loss was observed after 5 runs (Fig. 3(c)).The morphology and structure of 2D TiO-CN after photocatalysis were maintained, as determined by the TEM and XRD measurements (Figs.S7 and S8 in the ESM).Overall, these results confirm that the single titanium oxide species implanted in CN realize the high performance of photocatalytic CO2 reduction under visible light, much better than the bare CN and TiO2/CN hybrid materials. To develop highly active photocatalysts for CO2 reduction, understanding the catalytic mechanism is necessary.Firstly, the CO2 adsorption isotherms of 2D TiO-CN and CN were measured (Fig. S9 in the ESM), which demonstrates that the amount of CO2 adsorption is hardly changed after the incorporation of single titanium oxides species in CN, indicating the improved performance in photo-reduction of CO2 of 2D TiO-CN is not derived from the enhancement of CO2 adsorption.To verify the change of 2D TiO-CN during catalytic process, TRF and ESR spectra were performed.It was found that when a suspension of 2D TiO-CN in MeCN/H2O/TEOA (v:v:v 3:1:1) solution was irradiated under visible light in argon, the color of the suspension changed from yellow to green (Figs.4(b) and 4(c)), which can be attributed to the reduction of Ti 4 to Ti 3 by photo-induced electrons in 2D TiO-CN 14.In addition, the ESR spectra confirmed the presence of Ti 3 in green suspension (Fig. 4(c)). Once the co-catalyst (Co(bpy)3 2 ) was added to this suspension, the green color was quickly changed back to yellow (Fig. 4(d)), indicating the efficient one electron transferred from Ti 3 to Co(bpy)3 2 , and Co 2 was reduced to Co in Co(bpy)3 2 , which can subsequently reduce CO2 to CO.The TRF spectra also demonstrated the dynamic transfer of photo-excited charges in this reaction system.As shown in Figs.4(e) and 4(f), an enhanced excitation dissociation were observed when TEOA and co-catalysts (Co(bpy)3 2 ) were added, which may be caused by the separation of electron-hole pairs.In addition, more obvious excitation dissociation was realized by adding TEOA than that by adding co-catalysts, indicating the hole transfer is a rate-determining step during the separation of photo-induced electrons and holes in our reaction system.A schematic representation of the reaction mechanism was illustrated in Fig. 4(g).Under visible light irradiation, the electron-hole pairs are produced in CN matrix, in which the holes are quenched by TEOA, and the electrons transfer the single titanium oxide species and reduce Ti 4 to Ti 3 .Ti 3 changes back to Ti 4 by an one electron transfer to Co(bpy)3 2 , and the in-situ produced Co(bpy)3 can subsequently catalyze the conversion of CO2 to CO."
  },
  {
    "title": "Conclusions",
    "content": "In summary, we have demonstrated a visible-light-response SAC with single titanium oxide species implanted in CN (2D TiO-CN) for efficient CO2 photo-reduction for the first time.It is shown that the synergistic interaction between single titanium oxide species and CN in 2D TiO-CN has greatly enhanced the separation of photoexcited charges and brought about visible-light-response single titanium-oxide species, realizing extremely high activity of photoreduction of CO2 to CO. TRF and ESR spectra have revealed the catalytic mechanism of the fabricated 2D TiO-CN photocatalysts for CO2 reduction.This work will open new perspectives for rational design of SACs applied in photocatalytic reactions with high performance. (a), and Figs.S1 and S2 in the ESM, the TEM images of 2D TiO-CN show the sheet-like morphology with clean surface, and no titanium oxide nanoparticles or nanoclusters are observed.As demonstrated in Fig. 1(b), the HAADF-STEM images display abundant bright dots, which were in atomic size, as highlighted by the circles in Fig. 1(c).Those bright dots correspond to the heavy titanium atoms, which were homogeneously implanted in CN nanosheets.Furthermore, the element mappings of 2D TiO-CN nanosheets confirm the uniform dispersion of carbon, nitrogen, titanium and oxygen, respectively (Figs. 1(d)-1(g)).These results indicate that single titanium oxide species were homogeneously incorporated in CN structure. Figure 1 (a) The TEM image of 2D TiO-CN nanosheet.(b) and (c) HAADF-STEM images of 2D TiO-CN nanosheet at low (b) and high (c) magnifications.(d)-(g) The elemental mapping images for C element (d), N element (e), Ti element (f) and O element (g).(h) XRD patterns for 2D TiO-CN and CN nanosheets.The insets show the structures of 2D TiO-CN and CN, respectively.(i) XPS spectra of Ti 2p for 2D TiO-CN nanosheets. Figure 2 (a) UV-vis absorption spectra for 2D TiO-CN and CN.(b) PL spectra for 2D TiO-CN and CN.(c) TRF spectra for 2D TiO-CN and CN.(d) The comparison of photocurrent responses for CN and TiO-CN in 0.5 M Na2SO4 electrolyte. Figure 3 (a) The CO selectivity of 2D TiO-CN with different amount of co-catalyst.(b) Time dependent CO evolution over 2D TiO-CN, TiO2/CN, CN and commercial TiO2 under Xe lamp (300 W) with a long-pass cutoff filter ( 420 nm).(c) 5 runs of production yields of CO and H2 after 10 h irradiation over 2D TiO-CN as a measure of reproducibility.(d) The CO generation rate of some well-developed photocatalysts based on CN 23-25, 35-40. Figure 4 (a) The schematic illustration for the production of the transfer of Ti 3 -Ti 4 in 2D TiO-CN in our photocatalytic system.(b)-(d) The ESR spectra and photos of 2D TiO-CN suspensions under different conditions.(b) The fresh 2D TiO-CN suspensions in MeCN, H2O and TEOA (v:v:v 3:1:1).(c) 2D TiO-CN suspensions under visible light.(d) 2D TiO-CN suspensions after the introduction of the co-catalyst.(e) and (f) TRF spectra for 2D TiO-CN suspensions under different conditions.(g) The schematic representation of CO formation mechanism over 2D TiO-CN. This work was supported by the National Key RD Program of China (No. 2017YFA0700104), the National Natural Science Foundation of China (Nos.21790052, 21331007 and 21805207), and 111 Project of China (No. D17003). Electronic Supplementary Material: Supplementary material (the images of TEM, XPS, XRD and CO2 absorption additional materials characterization, Tables for radiative lifetime and CO2 reduction activity comparison of 2D TiO-CN) is available in the online version of this article at https://doi.org/10.1007/s12274-018-2240-4."
  }
]