[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2015.06.053"
  },
  {
    "title": "Article_Title",
    "content": "Heterostructured AgX/g-C3N4 (X = Cl and Br) nanocomposites via a sonication-assisted deposition-precipitation approach: Emerging role of halide ions in the synergistic photocatalytic reduction of carbon dioxide"
  },
  {
    "title": "Abstract",
    "content": "In this work, visible-light-active silver halide AgX(X Cl and Br) deposited on the protonated graphitic carbon nitride (pCN) photocatalyst was developed by a sonication-assisted deposition-precipitation route at room temperature.The surface morphology, phase structure, chemical composition, optical property and electronic band structures of the AgX-hybridized pCN (AgX/pCN) hybrid nanocomposites were systematically characterized.Subsequently, the photocatalytic performance of the AgX/pCN was evaluated by the reduction of CO 2 to CH 4 in the presence of H 2 O vapor under a low-power energy-saving daylight bulb at atmospheric pressure and ambient temperature.The optimal 30AgBr/pCN presented the highest photocatalytic activity, achieving a total CH 4 evolution of 10.92 mol g catalyst -1 , which was 34.1 and 4.2 times greater than those of single-phase AgBr and pCN, respectively.Furthermore, by comparing different halide ions, the photoactivity of 30AgBr/pCN was higher (by a factor of 1.3) than that of the optimal 30AgCl/pCN.The enhanced photocatalytic activity was accredited to (1) the surface plasmon resonance (SPR) effect from Ag and (2) the formation of heterojunction structure between pCN and AgBr in the AgBr/pCN hybrid photocatalysts for efficient charge transfer and separation to retard the recombination process as evidenced by the photoluminescence analysis.The effective charge separation was attributed to the matching of electronic band potentials of pCN and AgBr, exhibiting the Type II heterojunction, in comparison to that of AgCl/pCN (Type I heterojunction).Lastly, the plasmon-enhanced photocatalytic mechanisms associated with both Ag/AgBr/pCN and Ag/AgCl/pCN hybrid nanoarchitectures were critically discussed."
  },
  {
    "title": "Experimental",
    "content": "All chemical reagents were of analytical grade and used without further purification.Deionized (DI) water (18.2M cm resistivity) was employed in the experiment.Bulk g-C 3 N 4 was synthesized based on our previous reported thermal polymerization approach 15,16,22.Briefly, 3 g of urea was put into a ceramic crucible with a cover.The crucible was heated at 520 C for 2.5 h at a heating rate of 10 C min -1 .The yielded light yellow product was ground into powder form.This was followed by the chemical refinement and protonation of the developed g-C 3 N 4 as reported in our recent published communication 22.Specifically, 1 g of the bulk g-C 3 N 4 was ultrasonically treated for 1 h in 200 mL of 0.5 mol L -1 HCl aqueous solution.After sonication treatment, the exfoliated g-C 3 N 4 in the acid suspension was further stirred magnetically at room temperature for 4 h.Finally, the mixture was constantly washed with DI water to remove excess HCl until the pH of the filtrate water became neutral and then dried at 70 C for 12 h.The protonated g-C 3 N 4 was denoted as pCN. The AgX/pCN samples were prepared via a sonication-assisted deposition-precipitation technique.Typically, 0.5 g of the asobtained pCN was added into 50 mL of DI water and sonicated for 30 min.Next, a solution of AgNO 3 with a concentration of 0.01 g/mL was added drop wise to the suspension.The mixture was stirred magnetically for 1 h to allow adsorption of Ag ions on the surface of pCN.Then, the respective aqueous solutions of sodium halides NaX (X Cl and Br) were added dropwise into the suspension with an excess amount of 10 to ensure that the amount of halide ions from NaX was more than adequate to precipitate Ag on the g-C 3 N 4 surface.The dropwise addition of NaX was necessary to avoid rapid nucleation process of the Ag and X -on the pCN in the solution.The resulting mixture was further stirred vigorously at room temperature for 3 h.The product was obtained by washing with ethanol and DI water for three times and then dried at 70 C for 12 h.Following this facile method, a series of AgX/pCN with different mass ratio of AgNO 3 to pCN(10, 30, 50 and 70) was developed.The samples were denoted as yAgX/pCN where y 10, 30, 50 and 70, and X represented Cl or Br.Upon the light irradiation, the formation of Ag on the surface of AgX due to its photoreduction process was observed during the catalytic reactions.The spent photocatalysts were known as Ag/AgX/pCN after the end of reaction.For comparison, pure AgCl and AgBr crystals fabricated without the incorporation of pCN were also prepared under the similar experimental conditions.Also, a physically mixed AgBr and pCN with the similar loading of AgBr as the 30AgBr/pCN sample (denoted as 30AgBr/pCN-M) was synthesized by grinding both AgBr and g-C 3 N 4 in an agate mortar for 15 min. Zeta potential measurements were performed using the Zetasizer Nano ZS (Malvern Instruments) based on the dynamic light-scattering analysis.Prior to the analysis, 20 mg of the sample was placed in 50 mL of DI water followed by sonication for 15 min at room temperature.The surface morphology of the assynthesized samples was analyzed using field emission scanning electron microscopy (FESEM) (Hitachi SU8010) equipped with an Oxford-Horiba Inca XMax 50 energy dispersive X-ray (EDX) and transmission electron microscopy (TEM) (JEOL JEM-2100F).The TEM images were obtained at an accelerating voltage of 200 kV.The crystallographic structure was investigated using powder Xray diffraction (XRD) (Bruker D8 Discover X-ray Diffractometer) using Cu K radiation ( 0.154056 nm) with a Ni filter operated at 40 kV and 40 mA.The XRD patterns were collected in the diffraction angle (2A) ranging from 5 to 90 at a scan rate of 0.02 s -1 .The Fourier transform infrared (FTIR) spectra of the samples were performed using Thermo-Nicolet iS10 spectrometer at room temperature using a standard KBr pellet method with a resolution of 4 cm -1 in the range of 4000-400 cm -1 .The absorption spectra of the samples were measured by a Cary 100 Ultraviolet-visible (UV-vis) spectrophotometer equipped with an integrated sphere using BaSO 4 as a reference standard.The X-ray photoelectron spectroscopy (XPS) analysis was carried out with a Kratos Axis-Ultra DLD instrument using the Al K X-ray radiation (1486.6 eV) operated at 200 W and a pass energy of 20 eV under the ultra-vacuum environment (7.6 10 -9 Torr).All the binding energies were calibrated with the C 1 s peak at 284.6 eV based on the adventitious carbon.The XPS spectra were acquired using the vision software, comprising both vision processing and vision manager.High resolution XPS peaks were deconvoluted by means of Gaussian-Lorentzian functions after a Shirley background subtraction.The photoluminescence (PL) spectra were evaluated by a 325 nm He-Cd laser as the excitation light source at room temperature using Renishaw in Via Raman Microscope.The PL emission spectra were measured from 350 to 750 nm. The reduction of CO 2 was conducted in a homemade, continuous gas-phase photoreactor at ambient temperature and atmospheric pressure as described in our previous communications 5,15,16,23,24.A low-power 15 W energy-saving daylight lamp (Model: Philips, TORNADO 15 W WW E27 220-240 V 1CT) was utilized and its light spectrum was shown in the previous works 5,23,25.High purity of CO 2 (99.99) was passed through a water bubbler to form a mixture of water vapor and CO 2 .Before turning on the light source, a flow rate of 5 mL/min of wet CO 2 measured using a mass flow controller was purged in the reactor for 30 min, which was loaded with coated photocatalysts of 100 mg.This was aimed to evacuate the air in the reactor system and simultaneously to attain complete adsorption of gas molecules on the catalyst surface.The light was switched on after 30 min of purging.A thermometer attached to a digital temperature reader was used to closely monitor the temperature in the system.The accumulated light intensity of 8.5 mW cm -2 was measured using a pyranometer (Kipp and Zonen type CMP 6) with a distance of 5 cm from the light source to the reactor.The concentration of product gas was determined by a gas chromatography (GC) (Agilent 7890A, Hayesep Q and mol sieve column) equipped with both flame ionized detector (FID) and thermal conductivity detector (TCD).The concentration of CH 4 was measured based on the peak area of the GC spectrum by employing the standard reference technique.The reactor was placed in a black box to avoid the light interference from the surroundings.The reactions were performed at least twice under similar experimental conditions to ensure the reproducibility of the photocatalysts.Consistent results with percentage errors less than 5 were achieved in all cases.Four consecutive cycles of reaction were carried out to determine the stability of the photocatalyst.The total CH 4 evolu-tion after 10 h of reaction was calculated using Eq.(1).To verify the visible-light-activity of the optimized photocatalyst, the photoreduction of CO 2 experiment was conducted under the irradiation of a 500 W Xenon arc lamp (Model no.: CHF XM500 W) equipped with a UV cut-off filter to remove UV light ( 400 nm) for 10 h as shown in Figs.S5 and S6 in Supplementary material. Total CH 4 evolution total amount of CH 4 produced (mol) amount of photocatalyst used (gcatalyst) (1)"
  },
  {
    "title": "Results_and_Discussion",
    "content": "The protonation of g-C 3 N 4 could be evidenced by the zeta potential analysis in which the surface charge of g-C 3 N 4 was modified from -15.4 to 14.0 mV (Fig. S1 in Supplementary material), implying successful protonation by HCl.Prior to the addition of AgNO 3 and NaX, pCN underwent sonication to delaminate stacked layers of pCN.The presence of abundant amine groups served as a good ligand (Lewis base) for Ag , resulting in a strong coordination between Ag and pCN 20,26.This was followed by the formation of AgX (X Cl and Br) nanocrystals through in situ nucleation mechanism by a deposition-precipitation method at room temperature.The synthesis routes of the formation of AgX/pCN hybrid nanocomposites were depicted in Fig. 1. To study the microscopic and structural morphology of pure AgX and AgX/pCN samples, FESEM and TEM analyses were performed.From Fig. 2a andb, the morphologies of pure AgBr and AgCl were of irregular spheres with diameters ranging from 1 to 3 m.Upon the incorporation of pCNas a support, all AgX crystals ripened to form nanoparticles on the pCN surface (Fig. 2c-h).This clearly showed that pCN acted as a nucleation site to reduce the agglomeration of AgX 18,27.Moreover, AgX crystals exhibited a nano-sized structure on the pCN surface.Evidently, the average particle sizes of pure AgBr crystals and 30AgBr/pCN hybrid nanocomposites reduced drastically from 1689 to 44 nm (insets of Fig. 2a andd).In comparison to AgCl and 30AgCl/pCN, the mean diameters were found to be 1886 and 58 nm, respectively (insets of Fig. 2b andh).It is expected that the formation of nanocrystals is integral for the enhancement of CO 2 reduction to favor more reactive sites.Additionally, AgBr/pCN with various loadings of AgBr was used as a representative model to demonstrate the AgX/pCN nanocomposites.It could be observed from Fig. 2c-f that increasing loading of AgBr on the pCN led to an increase in the particle size and more clumps due to the agglomeration of AgBr particles.The elemental mapping by EDX analysis showed that the C, N, Ag, Br and Cl elements were detected in the AgBr/pCN and AgCl/pCN samples with all elements distributed over the hybrid nanocomposites (Fig. 3). The XRD patterns of the as-developed AgX/pCN with various loadings of AgX were depicted in Fig. 4. The XRD pattern of pCN was almost similar to that of pure g-C 3 N 4 with a pronounced peak at 27.2 ascribed to the (0 0 2) diffraction plane of a graphitic structure at an interlayer distance of 0.325 nm, implying that g-C 3 N 4 was made up of densely stacked layers 16.In addition, a peak at 13 corresponding to a distance of 0.675 nm represented the in-plane structural packing motif of tri-s-triazine units (JCPDS 087-1526) 28.This claimed that the original nature of g-C 3 N 4 in the pCN upon chemical refinement by HCl was well-preserved.The FTIR spectra of pure g-C 3 N 4 , pCN and AgX/pCN samples were illustrated in Fig. 5 and S2 (Supplementary material).For pCN sample, the absorption bands were almost similar to that of pure g-C 3 N 4 reported in our previous works 15,28, implying that chemical refinement from the acid pretreatment process did not markedly affect the atomic structures of pure g-C 3 N 4 .Evidently, the strong absorption peaks in the region of 1200-1650 cm -1 , centered at 1635, 1572, 1416, 1325 and 1249 cm -1 , were attributed to the typical stretching vibration of C N and C N heterocycles 30.Additionally, the breathing mode of tri-s-triazine units was observed at 812 cm -1 .In the case of AgX/pCN nanocomposites, it was noticed that the main peaks of g-C 3 N 4 in the 1200-1650 cm -1 were still present without distinct blue shift or red shift upon the hybridization of AgX nanoparticles.Interestingly, the characteristic band of tri-s-triazine ring was slightly red shifted from 812 to ca. 807 cm -1 (Fig. 5B), revealing that interactions were formed between the \"nitrogen pots\" of pCN and Ag species of AgBr.This phenomenon was in accordance with a recent report on SnS 2 /g-C 3 N 4 nanocomposites by Zhang et al. 31. The chemical composition and bonding configuration of the as-prepared pCN, 30AgBr/pCN and 30AgCl/pCN were characterized by XPS analysis (Fig. 6).As shown in the survey XPS spectra (Fig. 6a), all the samples were composed of C, N and O elements.A small amount of oxygen was ascribed to the adsorption of oxygen from the atmosphere during the preparation, which was consistent with the reported literatures 32,33.In addition to C, N and O elements, the presence of Ag 3p, Ag 3d, Br 3p, Br 3d and Br 3s was detected from the 30AgBr/pCN sample.Meanwhile, for 30AgCl/pCN sample, the peaks of Ag 3p, Ag 3d, Cl 2p and Cl 2s were observed.Based on Fig. 6b, the high resolution C 1s spectra could be deconvoluted into three peaks centered at ca. 284.6, 286.0 and 288.1 eV, being attributed to the standard reference sp 2 graphitic carbon (C C bonding), sp 2 -bonded in the s-triazine units (N C N) and sp 3 -hybridized carbon atoms (C (N) 3 ) in the g-C 3 N 4 lattice, respectively 34,35.In addition, four fitted peaks located at binding energies of ca.398.6, 400.0, 401.1 and 404.2 eV were observed in the high resolution N 1s spectra (Fig. 6c).The dominant peak at ca. 398.6 eV corresponded to the sp 2 -bonded nitrogen (pyridine-N) in the triazine rings (C N C) 36.The C N C served as the main carbon and nitrogen elements in the skeleton, which was regarded as the building block of the conjugated system.The emerging peak at ca. 400.0 eV belonged to the tertiary nitrogen bonded to carbon atoms (pyrrolic-N) in the form of N (C) 3 37.Both pyridine-N and pyrrolic-N along with N C N formed the heptazine heterocyclic ring units, which were the elementary substructure of g-C 3 N 4 .The peak at ca. 401.1 eV was assigned to the presence of amino groups (graphitic-N, C N H) 38.The contribution at 404.2 eV was originated from the positive charge effect in the heterocycles owing to the protonation of g-C 3 N 4 39.Interestingly, after the deposition of AgX on the pCN, the binding energies of both pyrrolic-N and graphitic-N in the AgX/pCN samples shifted to lower and higher binding energies, respectively.From the literature, a slight shift in the binding energy can be inferred by the electron transfer and interfacial interaction between pCN and AgX as a result of different electron concentration, forming a hybrid heterojunction.This was concordant with other reported hybrid nanomaterials such as TiO 2 /g-C 3 N 4 and CdS/g-C 3 N 4 40,41.The high resolution Ag 3d spectra were delineated in Fig. 6d.The peaks of Ag 3d were positioned at binding energies of ca.367.6 and 373.6 eV, which were accredited to the Ag 3d 5/2 and Ag 3d 3/2 , respectively.Particularly, the two peaks centered at 367.6 and 373.6 eV belonged to Ag ions of AgBr and AgCl, whereas another pair of peaks located at ca. 368.6 and 374.3 eV was assigned to the metallic Ag o species.Similar results were also reported by other researchers 42.In this case, the presence of metallic Ag o was due to the photocorrosion of the sample during the XPS analysis since AgX is a highly photosensitive material.Similarly, two individual peaks at 68.1 and 69.1 eV correlated well with the Br 3d 5/2 and Br 3d 3/2 (Fig. 6e), showing the existence of Br - 18.On top of that, the double peaks of Cl 2p 3/2 and Cl 2p 1/2 with binding energies of 197.7 and 199.5 eV, respectively, were shown in Fig. 6f, implying the presence of Cl -.As a whole, the XPS data further confirmed the successful synthesis of AgX/pCN hybrid heterostructures, which was in agreement with the FESEM, TEM, XRD and FTIR results. The UV-vis absorption spectra of the as-developed pCN, AgBr/pCN and AgCl/pCN samples were displayed in Fig. 7.The pCN sample demonstrated an absorption edge at ca. 440 nm, which was similar to that of pure g-C 3 N 4 .The band gap energy of both samples was estimated to be 2.8 eV, which coincided well with the reported literatures 30,43,44.Surprisingly, with the incorporation of AgX nanoparticles on pCN, the absorption edge of AgX/pCN did not vary notably.The absorption intensities of AgX/pCN in the visible light region were slightly improved with increasing AgX loadings, which were in concord with the color changing from light yellow to gray (inset of Fig. 7).Meanwhile, the absorption edge of pure AgBr was found to be ca.480 nm, corresponding to the band gap energy of 2.6 eV.In comparison to pure AgBr, the band gap energy of pure AgCl was larger (3.2 eV) (Fig. S3 in Supplementary material).As a result, pure AgBr and AgBr/pCN photocatalysts could absorb more visible light as compared to those of AgCl and AgCl/pCN photocatalysts.Therefore, the improved visible light absorption of AgBr/pCN over AgCl/pCN nanocomposites is anticipated to produce more electronhole pairs, resulting in a higher photocatalytic performance.This postulation was confirmed by performing the CO 2 photoreduction under visible light irradiation at ambient conditions. The photocatalytic reduction of CO 2 to CH 4 in the presence of water vapor was performed at ambient conditions under a low-power 15 W energy-saving daylight bulb.A series of control experiments was performed such as (1) in the dark, (2) without photocatalysts, (3) without H 2 O vapor and (4) under the flow of N 2 and H 2 O vapor.It was found that no considerable evolution of CH 4 was detected in all cases (Fig. S4 in Supplementary material), signifying that catalysts, light and water vapor were essential for the CO 2 reduction to CH 4 .Importantly, when CO 2 was replaced with N 2 gas, there was no detectable CH 4 product, claiming that CH 4 was not evolved from the decomposition of pCN.Thus, this proved that the evolution of CH 4 was originated from the photocatalytic reduction of CO 2 with H 2 O in the presence of light. As indicated in Fig. 8, the incorporation of AgX on the pCN plays a significant influence on the photocatalytic reduction of CO 2 .In the absence of AgX, pure g-C 3 N 4 exhibited a low CH 4 evolution of 2.55 mol g catalyst -1 due to the rapid recombination of charge carriers.The pCN showed similar photoactivity to the pure g-C 3 N 4 , attaining a total CH 4 evolution of 2.58 mol g catalyst -1 . By hybridizing AgBr with pCN, the photocatalytic activity of 30AgBr/pCN hybrid heterostructure was the highest as compared to other AgBr/pCN samples, achieving a maximum CH 4 evolution of 10.92 mol g catalyst -1 .This exemplified a walloping 34.1-and 4.2fold enhancement in the CH 4 production over bare AgBr and pCN, respectively.Undoubtedly, there exists an optimal AgX content on the pCN surface to obtain the maximum photoactivity, which is basically similar to any dopants or co-catalysts such as metal, nonmetal or metal oxide 31,45,46.In this work, when the loading of AgBr exceeded 30, the total CH 4 evolution was deteriorated as shown in the 50AgBr/pCN (9.52 mol g catalyst -1 ) and 70AgBr/pCN samples (8.62 mol g catalyst -1 ).This was attributed to the fact that excessive AgBr loading caused a severe aggregation on the pCN surface. From the GC analysis, the sole hydrocarbon product from the photoreduction of CO 2 was CH 4 .The formation of products is related to the band potentials of the photocatalyst and the redox potentials of the reaction products 32.The CB potential of pCN was found to be -1.15eV vs. NHE, while the reduction potentials of the possible products were: CO 2 /CH 4 : -0.24 V 47; CO 2 /CH 3 OH: -0.38 V 1; CO 2 /CO: -0.52 V 48; CO 2 /HCOOH: -0.61 V 49.Since the reduction potential for the CH 4 evolution from CO 2 was lower than that required for HCOOH, CO and CH 3 OH, CO 2 was preferably reduced to CH 4 over the AgX/pCN samples.Furthermore, H 2 molecules were not identified by GC.This was possibly because the photogenerated H radicals and H 2 were competitively consumed by CO 2 in the reaction.Similar observation has also been reported by Liu et al. 50, Yu et al. 51, Wang et al. 52 and also in our previous published works 5,15,16,22232453.In order to further examine the interfacial contact between AgBr and pCN as well as the separation efficiency of photogenerated electron-hole pairs in the AgBr/pCN samples, PL analysis was conducted as divulged in Fig. 9A.The PL emission intensity followed the order: pCN 10AgBr/pCN 70AgBr/pCN 50AgBr/pCN 30AgBr/pCN.The sequence in the degree of PL intensity agreed well with our photocatalytic results of AgBr/pCN samples.Among all the samples, the 30AgBr/pCN sample manifested the most diminished PL intensity, accentuating that it had the most effective inhibition of recombination of electron-hole pairs in the hybrid system.This was benefitted from the synergistic efficient shuttling of charge carriers between pCN and AgBr at the optimum loading across the heterojunction interface to retard the recombination process. Additionally, to validate the formation of intimate heterojunction interface of AgBr/pCN for the improved photocatalytic activity, than that of 30AgBr/pCN (10.92 mol g catalyst -1 ) despite exhibiting similar mass ratio of AgBr in both samples.This clearly revealed the significance of well-developed coupling heterojunction interface between pCN and AgBr for efficient charge transfer and separation.This observation could also be corroborated by the PL spectra (Fig. 9B), where the PL emission peak of 30AgBr/pCN was lower than that of 30AgBr/pCN-M, which was in accordance with our photocatalytic results.Hence, it can be concluded that the effective photoinduced charge transfer across the well interconnection of heterojunction is of utmost importance for the enhanced photoactivity of AgBr/pCN photocatalysts. To examine the photostability and recyclability of the photocatalyst, 30AgBr/pCN was employed as a representative sample to conduct four successive photocatalytic reactions (total duration of 40 h).As illustrated in Fig. 10, the 30AgBr/pCN sample maintained its high catalytic activity toward the CO 2 photoreduction process without a significant reduction in the CH 4 evolution after four successive cycles under identical experimental conditions, signifying a high photostability and reusability.After four successive photocatalytic runs, the spent 30Ag/AgBr/pCN and 30Ag/AgCl/pCN photocatalysts were analyzed using XPS analysis (Fig. 11) to check for the presence of metallic Ag o .Based on Fig. 11c andd (Ag 3d spectra), the intensities of the peaks located at ca. 368.6 and 374.4 eV, which were ascribed to the metallic Ag o species, were increased after four cycles of reactions in comparison to those before the photocatalytic reactions.This clearly implied that a small amount of AgBr and AgCl was reduced to metallic Ag o under the irradiation of daylight bulb.As presented in our previous works 5,16,23, there was a small fraction of UV light (2) present in the energysaving daylight bulb.Therefore, the large band gap of AgCl could still be excited under the daylight bulb, generating charge carriers.Overall, under the illumination of light, AgX (X Cl and Br) was first excited to produce electrons at the CB of the AgX.The photogenerated electrons from the CB of AgX reacted with Ag to form Ag o .According to the XPS results, the mole fractions of Ag o to total Ag were calculated to be 0.26 and 0.38 in the spent 30Ag/AgBr/pCN and 30Ag/AgCl/pCN samples, respectively after the photocatalytic reactions as compared to those of 0.08 and 0.07 in the 30AgBr/pCN and 30AgCl/pCN, respectively before the reactions based on the curve fittings of the Ag 3d region.Furthermore, the decrease in the intensity of the Ag in the Ag 3d (Fig. 11c andd), Br 3d (Fig. 11e) and Cl 2p peaks (Fig. 11f) of the spent samples after photocatalytic reactions also confirmed that the amount of metallic Ag o became greater, inferring the transformation of some Ag ions to Ag o during the photocatalytic process. On top of that, similar photocatalytic trends could also be observed for the AgCl/pCN samples (Fig. 8B).The optimal AgCl loading on the pCN was determined to be 30.By comparing different halide ions, the total CH 4 evolution of pure AgBr was higher (0.32 mol g catalyst -1 ) than that of pure AgCl (0.16 mol g catalyst -1 ). This could be verified by the UV-vis absorption spectra as illustrated in Fig. 7. Since the band gap energy of pure AgBr was measured to be 2.6 eV, which was lower than that of pure AgCl (3.2 eV), this readily rendered a wider range of visible light absorption harvested by AgBr, resulting in a higher catalytic activity.This was also another major reason why the optimal 30AgBr/pCN reported a higher catalytic performance than 30AgCl/pCN.This was due to the ease of photoexcitation of electrons from AgBr in the AgBr/pCN samples upon the light irradiation.Other detailed reasons why 30AgBr/pCN possessed an overwhelmingly better performance in the CH 4 generation as compared to 30AgCl/pCN were systematically discussed as follows: Based on the XPS analysis as discussed earlier (Fig. 11), the formation of metallic Ag on the surface of AgX plays an influential role in the SPR effect by harvesting the visible light and transforming the plasmonic energy of incoming photons into localized SPR oscillations, thus generating electron-hole pairs 545556.When Ag was anchored on the AgX due to photoreduction process upon the light irradiation, a Schottky barrier was created at the interface of Ag/AgX owing to the difference in work functions 57.This caused the transfer of electrons from a material with a lower work function to another material with a higher work function to equilibrate and generate a new Fermi level 58.Since the work functions of AgBr and AgCl are greater than that of Ag ( A gBr 5.3 eV, AgCl 4.8 eV and Ag 4.25 eV) 58,59, and the Fermi levels of AgBr and AgCl are lower than that of Ag, the transfer of photogenerated electrons can easily occur from the plasmonic Ag to the CB of AgX 18,20,606162.Meanwhile, in the hybridization of AgX nanoparticles with pCN, the heterojunction interface was developed when these two semiconductor photocatalysts with different VB and CB potentials were coupled together.It is anticipated that the enhancement in the photoactivity is principally influenced by the efficient charge transfer across the heterojunction and also the band alignments with respect to the desired reduction potential 63.Possible photocatalytic reaction mechanisms on the AgBr/pCN and AgCl/pCN hybrid nanocomposites were discussed below.From Fig. 12, photoinduced charge carriers were transferred across the heterojunction in both AgBr/pCN and AgCl/pCN systems.The band edge (VB and CB) positions of each semiconductor were calculated using the Mulliken electronegativity theory as exemplified below 9,42,64. where E CB and E VB are the CB minimum and VB maximum relative to the normal hydrogen electrode (NHE), E c is the energy of free electrons on hydrogen scale taken as 4.5 eV, E g is the band gap energy of the semiconductor and X is the geometric mean of the absolute electronegativity of the constituent atoms, which is the arithmetic mean of the atomic electron affinity and ionization energy.Based on Eq. ( 2), the positions of VB and CB edge of AgBr and AgCl were at 1.70 and -0.90 eV, and 2.00 and -1.20 eV, respectively.Meanwhile, for pCN, the VB and CB potentials were determined to be 1.65 and -1.15 eV, respectively.In this case, the CB potential of pCN was more negative than that of AgBr, but less negative than that of AgCl.On the other hand, the VB potential of pCN was less positive than that of AgBr and AgCl.As a result, the resulting hybrid heterojunction could be classified into two different types (denoted as Type I and Type II) when pCN was in direct contact with (1) AgCl and (2) AgBr, as schematically presented in Fig. 12. Upon light irradiation, both pCN and AgX in the hybrid heterostructures generated electron-hole pairs and then the charge transfer across the heterojunction would follow either Type I or Type II.For the Type I heterojunction (Fig. 12a), which was demonstrated by the Ag/AgCl/pCN sample, the VB and CB potentials of AgCl enveloped both the VB and CB potentials of pCN.Due to the SPR effect from metallic Ag and the fact that the CB edge of AgCl (-1.20 eV) was more negative than that of pCN (-1.15 eV), the excited electrons were transferred from Ag and AgCl to the CB of pCN.Additionally, the photogenerated holes were transported from AgCl to pCN to oxidize H 2 O to protons (H ).On account of the relative negative CB potential of pCN (-1.15 eV vs. NHE) to CO 2 /CH 4 (-0.24V vs. NHE), the stored electrons on the CB of pCN could readily convert CO 2 to CH 4 in the presence of H .However, the drawback of Type I heterojunction system was that the charge carriers from pCN and AgCl were accumulated in the pCN, resulting in a higher recombination rate and impairing the photocatalytic activity.Thus, no overall improvement in the separation efficiency of charge carriers could be achieved in the Ag/AgCl/pCN hybrid nanostructures (upon photoreduction). In contrary, for the Type II heterojunction (Fig. 12b), which was exhibited by the Ag/AgBr/pCN sample, the photogenerated electrons and holes were spatially separated by migrating the charge carriers apart from each semiconductor.In other words, the SPRexcited electrons from Ag and the photogenerated electrons from the CB of pCN were injected to the CB of AgBr, whereas the holes were transported from the VB of AgBr to that of pCN.This promoted the efficient separation of electron-hole pairs due to the well-matched energy bands of pCN, Ag and AgBr.Hence, the wellcontacted interface between pCN and plasmonic Ag/AgBr (upon photoreduction) in the heterostructured nanocomposites would hinder the recombination process of charge carriers, leading to an improved photoactivity.Evidently, based on the thermodynamic viewpoint, the CB of AgBr was more negative (-0.90 eV vs. NHE) than that of the potential CO 2 /CH 4 (-0.24V vs. NHE).This rendered the enriched electrons on the CB of AgBr to reduce CO 2 in the presence of H to CH 4 .The H was originated from the H 2 O oxidation by the accumulated holes on the pCN.Furthermore, in terms of reaction kinetic, which is expressed by the thermodynamic driving force ( E) between the reduction potential of CO 2 /CH 4 and the CB potential of the semiconductor upon electron transfer, it was found that the E of the Ag/AgCl/pCN was greater (0.91 eV) than that of Ag/AgBr/pCN (0.66 eV).It is known that a larger E favors a higher reaction rate 40.However, in this situation, the photocatalytic results of 30Ag/AgBr/pCN and 30Ag/AgCl/pCN did not display such a trend due to the fact that Ag/AgCl/pCN possessed the Type I heterojunction structure, which would in turn increase the recombination rate of electron-hole pairs, resulting in a lower CH 4 evolution.As seen in Fig. 12a, the photogenerated charge carriers were accumulated in the pCN instead.As a result, the benefit of a larger E in Ag/AgCl/pCN was compensated.This phenomenon was concordant with the PL results (Fig. 9B), in which the PL intensity of 30AgBr/pCN was lower than that of 30AgCl/pCN. The main reaction steps involved in the CO 2 photoreduction were summarized by Eqs. ( 3)- (11).Overall, it can be concluded that the high photocatalytic activity of Ag/AgBr/pCN over the Ag/AgCl/pCN hybrid nanoarchitectures was attained owing to the synergistic interactions of the SPR effect from Ag due to photoreduction of some AgBr nanoparticles as well as well-aligned band potentials in the hybrid nanocomposites for effective interfacial charge transfer across the heterojunction.Therefore, the manipulation of semiconductor heterojunctions by incorporating pCN with AgX of appropriate VB and CB edges is of crucial importance for improved catalytic activity."
  },
  {
    "title": "Conclusions",
    "content": "In summary, AgX/pCN(X Cl and Br) heterojunction photocatalysts were successfully synthesized at room temperature via a sonication-assisted deposition-precipitation strategy.The asprepared AgX/pCN photocatalysts showed enhanced reduction of CO 2 to CH 4 under a low-power energy-saving daylight bulb at ambient temperature and atmospheric pressure.The results demonstrated that the optimal 30AgBr/pCN sample showed the highest photocatalytic performance, which manifested a noteworthy 34.1-and 4.2-fold enhancement in the CH 4 evolution over pure AgBr and pCN, respectively.Additionally, by comparing different halide ions, the photocatalytic activity of 30AgBr/pCN was higher (by a factor of 1.3) than that of the optimal 30AgCl/pCN.Such a remarkable improvement in the photocatalytic performance of 30AgBr/pCN was mainly ascribed to the enhanced separation efficiency of photogenerated electron-hole pairs at the heterojunction interface of AgBr/pCN hybrid nanostructures.This was attributed to the well-matched overlapping band potentials of pCN and AgBr, which possessed Type II heterojunction (as supported by PL studies).Additionally, the formation of metallic Ag upon reduction of some AgBr nanoparticles during the photocatalytic process (as evidenced by XPS analysis) played a prominent role in the localized SPR effect by absorbing the visible light, thus generating electron-hole pairs.This further promoted the interfacial charge transfer across the Ag/AgBr interface by providing more free electrons for the CO 2 reduction to take place.More importantly, the as-developed 30AgBr/pCN photocatalyst exemplified a high photostability and recyclability after four successive cycles without an obvious decrease in the total CH 4 production.As a whole, the present work provides a new doorway on the development of plasmon-based g-C 3 N 4 heterojunction nanocomposites with efficient charge transfer and separation toward diverse photoredox applications for environmental remediation and solar energy conversion. Fig. 1.Synthesis strategy of the AgX/pCN hybrid nanocomposites via a sonication-assisted deposition-precipitation technique. Fig. 2. FESEM images of (a) pure AgBr, (b) pure AgCl, (c) 10AgBr/pCN, (d) 30AgBr/pCN, (e) 50AgBr/pCN and (f) 70AgBr/pCN hybrid nanocomposites.(g) TEM image of 30AgBr/pCN sample.(h) FESEM image of 30AgCl/pCN sample.Insets of (a)-(f) and (h) show the particle size distribution of AgX. Fig. 3. EDX mapping of C, N, Ag, Br and Cl elements for (a) AgBr/pCN and (b) AgCl/pCN samples.Insets of (a) and (b) show the corresponding FESEM images of AgBr/pCN and AgCl/pCN samples for elemental mapping. Fig. 4. XRD patterns of (A) AgBr/pCN ((a) pure g-C3N4, (b) pCN, (c) pure AgBr, and (d-g) 10, 30, 50 and 70 of AgBr) and (B) AgCl/pCN ((a) pure g-C3N4, (b) pCN, (c) pure AgCl, and (d-g) 10, 30, 50 and 70 of AgCl) hybrid nanocomposites.Triangle, square and circle symbols represent the reflections of g-C3N4, AgBr and AgCl, respectively. Fig. 5. (A) FTIR spectra of (a) pure g-C3N4, (b) pCN, (c) 10AgBr/pCN, (d) 30AgBr/pCN, (e) 50AgBr/pCN and (f) 70AgBr/pCN nanocomposites.(B) Enlarged FTIR spectra corresponding to the dotted rectangle from the image (A). Fig. 6.(a) XPS survey spectra of the pCN, 30AgBr/pCN and 30AgCl/pCN photocatalysts.High resolution XPS spectra of (b) C 1s, (c) N 1s, (d) Ag 3d, (e) Br 3d and (f) Cl 2p of pCN, 30AgBr/pCN and 30AgCl/pCN samples. Fig. 8. (a-b) Total production of CH4 from the CO2 photoreduction over pure g-C3N4, AgBr/pCN and AgCl/pCN hybrid nanocomposites.(c) Time dependence of the rate of CH4 production over pure g-C3N4, 30AgBr/pCN and 30AgCl/pCN samples. Fig. 9. (A) PL spectra of pCN and AgBr/pCN hybrid heterostructures.(B) PL spectra of 30AgBr/pCN, 30AgBr/pCN-M and 30AgCl/pCN samples. Fig. 10.Recycle test for the photoreduction of CO2 to CH4 in the presence of 30AgBr/pCN photocatalysts under the light irradiation. Fig. 11.XPS survey spectra of the (a) 30AgBr/pCN and (b) 30AgCl/pCN samples before and after the photocatalytic reactions for four times.High resolution XPS spectra of (c) Ag 3d and (e) Br 3d of 30AgBr/pCN sample before and after the photocatalytic reactions.High resolution XPS spectra of (d) Ag 3d and (f) Cl 2p of 30AgCl/pCN sample before and after the photocatalytic reactions. Fig. 12. Schematic illustration of the band structures of (a) Ag/AgCl/pCN and (b) Ag/AgBr/pCN hybrid nanocomposites for the photoreduction of CO2 with H2O to CH4 under the light irradiation. VB ) H 2 O Ag/AgBr/pCN 2H VB ) H 2 O Ag/AgCl/pCN 2H CB )/pCN CO 2 8H Ag/AgBr/pCN CH 4 2H 2 O (10) Ag/AgCl/pCN(8e - CB ) CO 2 8H Ag/AgCl/pCN CH 4 2H 2 0 This work was funded by the Ministry of Education (MOE) Malaysia under the NanoMITe grant scheme (Ref.no.: 203/PJKIMIA/6720009) and Fundamental Research Grant Scheme (FRGS) (Ref.no.: FRGS/1/2013/TK05/MUSM/02/1). Supplementary data associated with this article can be found, in the online version, at http://dx.doi.org/10.1016/j.apcatb.2015.06.053"
  }
]