[
  {
    "title": "Doi",
    "content": "10.1016/j.jphotochem.2019.111933"
  },
  {
    "title": "Article_Title",
    "content": "CO2 adsorption and its visible-light-driven reduction using CuO synthesized by an eco-friendly sonochemical method"
  },
  {
    "title": "Abstract",
    "content": "One alternative to mitigate the high CO 2 concentration in the atmosphere is its conversion into value addedproducts or solar fuels by heterogeneous photocatalysis.However, in these reactions, the CO 2 fixation remains a challenge due to the inert nature of greenhouse gas.Thus, it is necessary to propose materials that presented good performances in both processes: CO 2 adsorption and its photocatalytic conversion to solar fuels.Copper oxide is a potential material that could exhibit high efficiencies for both processes if it is prepared by adequate synthesis methods.In this work, CuO was obtained by a sonochemical method using an eco-friendly surfactant (Na 3 C 6 H 5 O 7 ), low sonochemical time (15 min) and low temperatures (80 C).The materials were evaluated in a combined process that involves CO 2 adsorption and its photocatalytic conversion to liquid fuels (CH 3 OH) under LED visible-light at 25 C.CuO particles were characterized by X-ray powder diffraction, Scanning Electronic Microscopy, N 2 physisorption, FTIR spectroscopy, Diffuse Reflectance Spectroscopy, and X-ray photoelectron spectroscopy.CuO pure showed the best efficiencies for CO 2 adsorption: 318 mg CO2 g -1 and CH 3 OH production: 3.7 mol g -1 h -1 , which was associated with it's the high number of active sites.Bohem titrations were used to calculate the active: acid/basic sites in the samples, which results demonstrated a higher contribution of basic sites (2.4 mmol).These active sites favored the formation of monodentate bonds between CO 2 and CuO, which promoted its photoconversion to solar fuels such as CH 3 OH.Additionally, CuO/Cu(OH) 2 mixtures with the high surface area were identified at higher concentrations of Na 3 C 6 H 5 O 7 .However, these mixtures did not show high efficiencies for both processes.A mechanism of combined CO 2 adsorption and its photocatalytic conversion to methanol under visible light was proposed.The stability and recyclability of CuO as CO 2 adsorbent and as a photocatalyst was demonstrated after three consecutive cycles without compromise its efficiency in the combined process."
  },
  {
    "title": "Experimental",
    "content": "All chemicals were used as received without further purification. Copper acetate hydrate (Fermont, 99) (Cu(CH 3 COO) 2 xH 2 O), sodium citrate (Na 3 C 6 H 5 O 7 , Fermont 99), and sodium hydroxide (NaOH, Fermont 99) were used for the synthesis of CuO. CuO samples were synthesized by a sonochemical method considering the following three factors: i) the eco-friendly surfactant (Na 3 C 6 H 5 O 7 ), ii) reaction time (15-60 min), and iii) the precursor concentration (Cu(CH 3 COO) 2 xH 2 O).The combinations shown in Table 1 were selected according to a previous design of experiments.The sonochemical method implied the preparation of two solutions.In the first solution, different amounts of copper acetate were dissolved in 40 mL of distilled water under vigorous stirring at 50 C to obtain a final concentration of 0.07, 0.23, and 0.40 M.After a complete dissolution, sodium citrate was added as an eco-friendly surfactant (0, 0.03, 0.07, 0.12 and 0.20 M), considering a molar ratio between Cu and Na of 0, 0.5, and 1.0.A second solution of stoichiometric amounts of NaOH regarding Cu was added dropwise into the first one accompanied by a color changed from dark to sky-blue.After that, the mixture was exposed to a sonochemical treatment by means of ultrasonic probe model Hielscher's UP200Ht at 100 W, using capacitance and an amperage of 50 and 20, respectively.After the sonochemical treatment, the resulting brown suspension was washed with distilled water and methanol, to remove the by-products of the materials.Finally, the powders were dried at 80 C overnight.Table 1 shows the synthesis conditions of the six samples prepared. For the identification of crystalline phase composition, the samples were characterized by X-ray powder diffraction using a diffractometer Bruker AXS D8 Advance with Cu K radiation 40 kV and 30 mA.The percentage () of CuO phase was calculated based on the normalized ratios of relative intensities, according to the Eq. ( 1): Where w CuO is the weight percent of CuO phase () and A CuO and A Cu(OH)2 are the area (in arbitrary units) of the highest diffraction of CuO and Cu(OH) 2 , respectively.The surface area was measured by N 2 physisorption in a Bel-Japan Minisorp II, with a previous step of degasification at 200 C for 3 h.The surface groups in the samples were identified by using ATR-FTIR using a Thermo FTIR Nicolet iS50 in a range of 525-4000 cm -1 .The morphology of materials was performed by scanning electron microscopy (SEM) by using a JEOL JSM-6490LV microscope with an accelerating voltage of 20 kV.The particle size was evaluated from 3 different SEM images with an average of 50 particles using the Image J software.The amount of acid and basic surface groups was determined using the Boehm titration method according to the procedure suggested by Goertzen 46. CO 2 adsorption experiments were carried out in a stainless column of 100 mL.The system employed consisted of an adsorption column, a packed bed, a pressure gauge, sampling uptake, and a system of analysis (GC/TCD).The mass of the sorbent was fixed to 0.1 g and it was laid in a packed bed.In a beginning, N 2 was passed through the column to purge for 20 min.Later, 0.4 bar of 50-50 N 2 -CO 2 was put in contact with the material for 30 min at room temperature.The CO 2 concentration was quantified by gas chromatography using a Trace 1310 Thermo Scientific, equipped with a TCD detector.The efficiency for CO 2 adsorption was reported in mg CO2 g -1 .a) Adsorption isotherm For the CO 2 adsorption isotherm experiments, seven different mixtures of N 2 -CO 2 were put into contact with the material for 30 min at the same experimental conditions described before.The adsorption isotherm was carried out with the best CO 2 capture performance considering seven different mixtures of CO 2 and N 2 .The data was adjusted to the Sips model showed.The general form of Sips model is shown in Eq. ( 2) 47. Where q ads denotes the mass adsorbent of CO 2 by unit mass of adsorbent (mg CO2 g -1 ), q ms is the maximum adsorption capacity in Sips model (mg g -1 ), K s is the Sips constant to equilibrium (L mg -1 ) m s an exponent (dimensionless).The Sips model has been used to describe well the process of adsorption between metal oxides and CO 2 molecules, which are adsorbed on the sorbent surface with heterogeneous coverage 30,48,49. The photocatalytic reactions were carried out in a cylindrical quartz reactor of 250 mL at 20 C and 0.1 bar of CO 2 .The mass used of the photocatalytic materials was 0.1 g, and it was suspended in 200 mL of deionized water with vigorous agitation.The test consisted in saturated the system with CO 2 for 15 min and then, irradiated the suspension with 2 LED visible-light lamps of 20 W each one.The reaction product (CH 3 OH) was analyzed after 1 h of the photocatalytic reaction using the complexation of methanol with sodium nitroprusside followed by a UV-vis spectrophotometer (Cary 5000) 50.The scheme of the combined process for CO 2 capture and its photocatalytic conversion is shown in Supplementary Fig. 1."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The XRD patterns of the six synthetized samples are shown in Fig. 1.The presence of monoclinic-CuO was observed in the six samples, according to JCPDS card 45-0937.In addition, a second phase: Cu(OH) 2 was also identified in two samples (1 and 4) according to the JCPDS card 13-0420.Table 2 shows a summary of the phases detected in each sample.From these data, it seems that the formation of the second phase (Cu(OH) 2 ) was favored at high Na 3 C 6 H 5 O 7 concentration and low reaction time.Under these conditions, the stabilization of Cu 2 ions in the second phase was promoted due to Na 3 C 6 H 5 O 7 concentration was higher than its critical micellar value 51. SEM images of the six synthesized materials are shown in Fig. 2, and the particle size obtained from these images are summarized in Table 2.In general, a variety of morphologies were obtained by modifying the synthesis conditions.Particularly, a morphology of rectangular bars was obtained by the first time using a sonochemical method (Fig. 2e).The bars obtained in sample 5 had an average length of 1.8 m and wide around 630 nm.The formation of CuO bars was associated with the following factors: i) short reaction times, ii) absence of surfactant and iii) a high concentration of precursor.The morphology of the particles of 5 sample showed the presence of edges, mainly in the rectangular bars, which can provide active sites for effective CO 2 adsorption 52.When the reaction time increased from 15 to 25 min, the bars tended to be dispersed into well-distributed particles of length around 360 nm (Fig. 2f). On the other hand, in the samples 1, 3, and 4 was observed a notable agglomeration among their particles, finding big agglomerates ( 1 m) (Fig. 2a,c-d).Sample 2 also showed irregular particles, however, their size was up to 7.5 times lower than the sample 1.This fact was associated with the synthesis conditions under the lowest precursor concentration that promote the formation of particles of a smaller radius in sample 2. The specific surface area of the materials synthesized is summarized in Table 2.The material with the highest surface area was obtained with the sample 2 (351 m 2 g -1 ), which value was up to 7 times higher than previous reports 17,22,37383953.The addition of sodium citrate as a green surfactant during the synthesis of CuO had an important effect in obtaining high surface areas.This fact could be associated to that citrate anion possesses three carboxylic and one hydroxyl groups that provide coordinating sites to form stable tri-protonated citrate Cu 2 complexes (Cu 2 (H -1 cta) 2 dimers) stabilizing the crystal growth of 1 Average particle size calculated from Image J software. 2 Calculated from BJH analysis. CuO particles 54. Regarding to N 2 isotherms, all materials exhibited Type-IV isotherm, according to the IUPAC classification.This profile is characteristic of mesoporous materials (Fig. 3).A BJH analysis was performed to calculate the mean pore radius, which results evidences the presence of pores of radius from 1.6 to 22.2 nm, which the highest value was obtained with sample 5 that exhibited rectangular bars in its morphology. The optical properties of the CuO samples were analyzed by UV-vis spectroscopy.The band gap energy values of copper oxide were estimated using the Kubelka-Munk remission function considering a direct transition (Supplementary Figure S2).The band gap values of CuO samples were around 1.2-1.5 eV, which indicates their activation under visible light from the solar spectrum.It is worth mentioning that the presence of the second phase Cu(OH) 2 had not a notable effect in the modification of the band gap energy of CuO since the values obtained were very close among them. CuO samples were put into contact with a mixture of N 2 -CO 2 50-50 for 30 min to evaluate their uptake CO 2 capacity at 25 C, which results are shown in Fig. 4. The error bars were obtained by sample standard deviation for tree measurements for each experiment.As it can be seen, the best performance for CO 2 adsorption was obtained with the sample 5 (326 mg CO2 g -1 ), which exhibited CuO as the only phase, a morphology of rectangular bars, and the highest pore radius (22.2 nm).Sample 6 showed slightly lower performance than the sample 5 (318 mg CO2 g -1 ), probably due to the lack of more energetic surfaces and a minor pore radius. The highest adsorption was up to 24 times higher than previous reports of CuO at 25 C 17,1920212223.On the other hand, sample 4 presented the lowest CO 2 adsorption (75 mg CO2 g -1 ), which was associated to the presence of a second phase (Cu(OH) 2 ) in the material that could inhibit the fixation of the gas due to the electrostatic impediments. The samples with the highest (5 and 6) and lowest CO 2 adsorption (4) were characterized by FTIR, which spectra are shown in Fig. 5.In the materials after CO 2 capture, a series of bands were presented at 3570, 3300, and 1650 cm -1 related to the symmetric and anti-symmetric stretching and bending vibrational modes of water, which can be attributed to a small percentage of humidity in the CO 2 gas 55,56.The bands related to the presence of CO 2 on CuO surface were observed at 1550-1560 and 1410 cm -1 associated with CeO stretching and symmetry OeCeO vibrational modes, assignment for monodentate carbonate species 57,58.In addition, bidentate carbonate bands related to CeO stretching and OeCeO symmetry can be seen at 1340 and 1020 cm -1 24,59. An analysis of the area under the curve of bidentate and monodentate signals showed that sample 6 exhibited a higher presence of bidentate and monodentate species (Supplementary Table S1).This higher affinity for CO 2 can also be related to the presence of a higher number of active sites in this sample.To corroborate this, a potentiometric Bohem titration was performed to quantify the basic and acid sites in 4, 5 and 6 samples.The sample 5 showed up to 1.6 times more basic sites (4.1 mmol g -1 ) in comparison and sample 4 with the lowest efficiency.The higher quantity of basic sites on sample 5 can be attributed to their morphology with edges that act as effective active sites for CO 2 adsorption and favors the formation of bidentate species on CuO surface.The basic sites obtained with sample 5 were up to two times higher than previous reports of CuO and well-known sorbents such as MgO and activated carbon 60,61.On the other hand, acid sites in samples 4 and 5 were 2.3, 3.3 mmol g -1 , respectively.As it can be noted, sample 4 showed a similar quantity of basic and acid sites, which could generate electrostatic impediments that avoid the CO 2 capture probably by the presence of the mixture CuO/Cu(OH) 2 . The experimental data obtained with the sample 6 was adjusted by Sips isotherm model to confirm the mechanism of adsorption.According to the adjustment of data shown in Fig. 6, the adsorption of CO 2 was heterogeneous and only occurs in some places (or active sites) on CuO-surface.The inhomogeneity of the adsorption process can be described by the parameter ms in the Sips model, which value obtained (0.74) indicated that there was heterogeneity during the adsorption of CO 2 on CuO.The ms value obtained was higher than previous works of activated carbon modified with Ca and Mg ( 0.66) 48 and zeolite ( 0.5) 62.Reports using the Sips model in CuO were not found. The methanol production from the photocatalytic CO 2 reduction using CuO synthesized by a sonochemical method is shown in Fig. 7.The samples that exhibited only the CuO phase (2, 5, and 6) and morphology with lower agglomeration presented the better performance for CH 3 OH generation.Sample 5 and 6 adsorbed more amounts of CO 2 (325 and 318 mg CO2 g -1 ) than the other samples.The highest photocatalytic methanol production: 3.7 mol g -1 h -1 was obtained with the sample 6. Sample 5 showed slightly higher efficiencies for CO 2 adsorption than sample 6, however its photocatalytic activity was lower.This fact was associated with its higher particle size.In this context, a low particle size favors the photocatalytic activity since the efficiency of the charge transfer can be improved 63,64. The photoreduction of CO 2 is a multistep process involving mainly three steps: i) the CO 2 adsorption, ii) its activation through the transfer of photogenerated electrons from the photocatalyst surface to CO 2 , and iii) the dissociation of CeO bond 79, 80.As the adsorption is the first step of a heterogeneous reaction, an adequate CO 2 fixation on CuO could be the key step for more effective conversion of the gas.As it was shown in the FTIR spectra, sample 6 showed higher intensities in the monodentate bands.These types of bonds can favor the conversion of CO 2 to CH 3 OH, since its energy bonds allowed its further desorption to the reaction medium at the temperature of the reaction.Then, the CO 2 adsorbed is able to react with protons (H ) promoting its photoreduction to solar fuels 666768.Thus, the adsorption and photoconversion mechanism proposed is shown in (Fig. 8a).It is worth mentioning that the desorption of bidentate species is not favored due to the high energy that is required for their desorption and they broke their bonds 69.The bidentate species can play in the photoreduction CO 2 , however in a minor proportion.Once, CO 2 was fixed on the surface, CuO is irradiated with visible light to promote electrons (e -) from its valence band (VB) to the conduction (CB), producing holes (h ) in the first band (Eq.( 3)).Then, the holes interact with the water molecule, promoting its oxidation to H and O 2 (Eq.( 4)).The mono and bidentate species react with two electrons and holes to produce CO by means of CO bond break (Eq.( 5), Fig. 8b), which constant addition of electrons and holes allowed the protonation of this molecule until the formation of formaldehyde (HCOH) (Eq.( 6), Fig. 8c).The subsequent addition of protons promoted the formation of methoxy (CH 3 O), which, is desorbed from the surface of the CuO to be finally transformed to CH 3 OH, which is a promising solar fuel (Eq.( 7), Fig. 8d-e).First, CO 2 is converted to CO, which constant addition of electrons and holes allowed the protonation of the CO 2 molecule until the formation of formaldehyde (HCOH), methoxy (CH 3 O), which is transformed to CH 3 OH (Fig. 8b-d). visible light CB VB (3) (5) The stability and recyclability of the materials in the combined process: CO 2 adsorption and its photocatalytic conversion to solar fuels, is one of the most important concerns to assure good efficiencies in this application.Thus, to evaluate the recyclability of the material, CuO was summited to different temperatures: 60, 100, 150 and 200 C for 3 h to remove the mono and bidentate carbonate species.The FTIR spectra showed that it was possible to remove the CO 2 -species until 200 C, which indicated that the material obtained can be cataloged as a material of low regeneration temperature (Supplementary Figure S3) 16. After the CuO-reactivation at 200 C, three continues adsorption and photocatalytic tests were performed to evaluate the recyclability of the material.As can be seen in Fig. 9, the CO 2 adsorption slightly decreases ( 20) after 3 consecutive cycles, possibly because the bidentate species cannot be desorbed under these conditions.On the other hand, when CuO was reused three times as photocatalyst, the activity of the material remains, with a partial decrement of 38.which could be attributed to partial carbonation and a loss of identity of CuO.After the CO 2 adsorption and photoconversion experiments, the sample was characterized by XRD and XPS to investigate its chemical stability.In the diffractograms shown in Fig. 10 was not observed the presence of additional phases such as CuCO 3 , thus was inferring that the monoclinic CuO-phase remain stable after three consecutive tests in the bulk of the material, considering the detection level of this technique.Thus, it was necessary to analyze the sample by XPS analysis to detect by-products of both process. In general, the survey spectrum of sample 6 showed the presence of C 1s, O 1s, and Cu 2p as is shown in Supplementary Figure S4.The C 1s spectrum of the reference sample was deconvoluted in three components related to CeC, CeO, and CO in binding energies at 284.5, 285.7, 287.8 eV, respectively (Fig. 11a) 707172.After performing the CO 2 adsorption appears an additional signal related to hydrocarbonates (HeOeC) bonds at 289.9 eV (Fig. 11b) 73.This band suggests the partial carbonation of the sample after the experiments.The O 1s spectra was deconvoluted in two components related to CuO and carbonates (i.e.CuCO 3 ) at 529.0 eV and 530.6 eV, respectively (Fig. 11c-d) 74,75.After the CO 2 capture tests, an increase in the carbonate species was detected, which was attributed to chemisorbed CO 2 on CuO. On the other hand, the spectra of Cu 2p was separated in three main components related to CuO (933.1 eV), Cu(OH) 2 (933.5 eV), and CuCO 3 (934.9eV) (Fig. 11e) 767778.In addition, two shake-up satellites of Cu 2 around 7 and 9 eV higher binding energy than the main peak was observed.Interestingly, the band assigned to Cu(OH) 2 was converted completely to CuCO 3 after the CO 2 adsorption experiments (Fig. 11f), which could favor the passivation of the CuO surface, decreasing eventually its efficiency for both processes, as it was shown in Fig. 9. Thus, slight passivation of CuO by means of CuCO 3 deposition was corroborated by the XPS technique."
  },
  {
    "title": "Conclusions",
    "content": "CuO was obtained by an eco-friendly sonochemical method with a variety of morphologies, high surface area, and mesoporous nature.The performance of CuO particles was evaluated for the first time in a combined CO 2 capture and its photocatalytic conversion to methanol at 25 C.According to the results, the best performance for CO 2 capture and CH 3 OH production was 326 mg CO2 g -1-1 and 3.7 mol g -1 h -1 , respectively, whose were attributed to the presence of CuO as purephase and morphology not agglomerated with a high number of edges and basic sites.The adsorption of CO 2 favored the conversion of methanol by means of the formation of monodentate and bidentate species on CuO, whose can react with the photogenerated electrons and protons to produce liquid solar fuels such as methanol.A mechanism based on CO 2 adsorption by monodentate species and its further protonation until CH 3 OH generation was proposed.The efficiency of CuO decreased less than 20 after being recycled three times due to the partial carbonation of CuO.The good results obtained indicate that the obtained materials are promising for their use in diluted streams in post-combustion and atmospheric systems. Fig. 1.XRD patterns of synthetized materials. Fig. 2. SEM images of samples: a.1, b. 2, c. 3, d. 4, e. 5, and f. 6. Fig. 4. CO 2 capture on CuO using 0.4 bar of 50-50 N 2 -CO 2 at 25 C.The error bars were obtained by sample standard deviation. Fig. 5. FTIR spectra of samples 4, 5, and 6 after performing the CO 2 -adsorption tests. Fig. 6.CO 2 isotherm using CuO (sample 5) at 25 C.The error bars were obtained by sample standard deviation. Fig. 7. CH 3 OH production by CuO particles after 1 h of reaction under LED visible-light. Recyclability of CuO material in the combined process Fig. 9. Stability of sample 6 after 3 cycles of CO 2 adsorption and its photoreduction to CH 3 OH under LED visible-light after 1 h of reaction.The error bars were obtained by sample standard deviation. Fig. 10.XRD patterns of a. sample 6 after b. 1, c. 3 cycles of CO 2 adsorption at 25 C. Fig. 11.XPS of a-b.C 1s, c-d.O 1s, and e-f.Cu 2p of sample 6 before and after the experiments. Sonochemical synthesis conditions to prepare CuO. Physicochemical properties of synthesized materials. The authors wish to thank CONACYT for financial support for this research through the following projects: Catedras CONACYT1060, CONACYT-CB-2014-237049, CONACYT-PDCPN-2015-487, CONACYT-NRF-2016-278729, PAIFIC/2018-9, PAIFIC/2018-5, PROFIDES-25292.In addition, the authors want to thank to Dr. David Avellaneda for his valuable help in the XPS analysis.Manuel Alejandro Avila Lopez wants to thank CONACYT for the PhD scholarship. Supplementary material related to this article can be found, in the online version, at doi:https://doi.org/10.1016/j.jphotochem.2019. 111933."
  }
]