[
  {
    "title": "Doi",
    "content": "10.1016/j.apsusc.2019.03.333"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic CO2 reduction activity of Z-scheme CdS/CdWO4 catalysts constructed by surface charge directed selective deposition of CdS"
  },
  {
    "title": "Abstract",
    "content": "Rational construction of Z-scheme photocatalysts and deep exploration of Z-scheme transfer mechanism are highly desirable for improving the activity of CO 2 reduction photocatalysts but remains a significant challenge.Herein, we synthesized a series of heterostructured CdS/CdWO 4 materials by selectively depositing CdS nanoparticles on the edges of CdWO 4 nanoplates.Selective deposition mechanism of CdS and the formation of the composites were studied in detail.The photocatalytic CO 2 reduction activities of the synthesized materials were investigated and the results show that CdS/CdWO 4 materials exhibit higher photocatalytic activity than pure CdS and CdWO 4 .We suggest that the enhanced photoreduction CO 2 activity is attributed to Z-scheme charge transfer mechanism based on the analyses of the products of CO 2 reduction and the band structure of CdS and CdWO 4 .Kelvin probe force microscope on CdWO 4 nanoplates shows that the photogenerated electrons, driven by electric field forces, would migrate to the edge of CdWO 4 .The charge transfer direction, coupling with the selective deposition of CdS nanoparticles, facilitates CdS/CdWO 4 composites following Z-scheme transfer.In-situ Pt photodeposition tests provide strong experimental support to the charge transfer mechanism.The results gained herein are expected to provide some useful insights into the structure-oriented rational design of Zscheme photocatalysts for CO 2 reduction."
  },
  {
    "title": "Experimental",
    "content": "All reagents are analytical grade and used without further purification.Tungsten trioxide (WO 3 ) was synthesized by a template-free hydrothermal method 48.The detailed preparation process of WO 3 is described in Supporting Information and regular WO 3 cuboid nanoplates were obtained (Fig. S1). Cadmium tungstate (CdWO 4 ) was produced via chemical conversion method by the as-prepared WO 3 nanoplates reacting with cadmium acetate.Briefly, 1.62 mmol WO 3 and 3.24 mmol cadmium acetate (Cd (CH 3 COO) 2 2H 2 O) were dispersed in 250 mL redistilled water.The suspensions were stirred at atmospheric pressure and heated to 90 C.After continuous stirring for 4 h, the products were centrifuged, washed and dried at 70 C overnight.The obtained products with different reaction time (5 min, 20 min, 30 min, 1 h, 2 h and 4 h) were characterized by XRD, as shown in Fig. S2.After reacting for 4 h, the precursor WO 3 nanoplates with monoclinic structure (PDF No. 01-083-0951) were converted into CdWO 4 with monoclinic wolframite structure. The synthesis of CdS/CdWO 4 composites was performed in a flask with mild magnetically stirring through chemical deposition method.The weight ratios of CdS to (CdWO 4 CdS) are designed to 30, 40 50, 60, and 70, respectively.Typically, 0.10 g (0.278 mmol) of the as-prepared CdWO 4 powder was first dispersed into 50 mL water by ultrasonic treatment for 20 min, and appropriate amounts of cadmium acetate (Table S1, Supporting Information) and corresponding amounts of thiourea (with moles equal to cadmium acetate) were added to the suspension.After stirred for 30 min, the mixture was heated to 70 C and stirred for 2.5 h.Finally, the yellow products were centrifuged, washed and dried at 70 C overnight.The corresponding samples are labeled as C30, C40, C50, C60, and C70, respectively, according to the nominal weight ratios. To verify the transfer mechanism of the photogenerated electronhole pairs, Pt/CdS/CdWO 4 were further synthesized via photodeposition method.0.1 g C50 powder was first dispersed into 50 mL Na 2 SO 3 solution (1 M), and 1.05 mL H 2 PtCl 6 solution (10 mg/mL) was added to the suspension.After being stirred for 1 h, the suspension was illuminated by a xenon lamp for 2 h.The gray product was centrifuged, washed and dried at 70 C overnight. Powder X-ray diffraction (XRD; PANalytical X'pert PRO) was employed to characterize the crystal structure.Scanning electron microscopy (SEM; Carl Zeiss Sigma 500) and transmission electron microscopy (TEM; FEI Tecnai G 2 F20-S-TWIN) were used to observe the morphologies of catalysts.UV-vis diffuse reflectance spectra (DRS; Cary 5000) were obtained to investigate the light-harvesting ability and the band gap of the catalysts.X-ray photoelectron spectroscopy (XPS; PerkinElmer PHI 5300) was adopted to characterize the valence state and chemical environment of elements on the surface of catalysts.Ultraviolet photoelectron spectroscopy (UPS; PerkinElmer PHI 5300) results were obtained with He I (21.22 eV) to explore the position of VB.Photoluminescence (PL; F7000) spectra were measured to evaluate the separation efficiency of photogenerated charges.Photoelectrochemical test were recorded by electrochemical workstation (CHI 660E).The surface potential distribution of CdWO 4 nanoplate was detected by Kelvin probe force microscope (KPFM; SmartSPM). The photocatalytic CO 2 reduction performance of materials was evaluated in gaseous phase in a stainless-steel reactor (CEL-HPR100, Beijing China Education Au-light Co., Ltd) equipped with a quartz window for passing light irradiation.The catalyst powders (0.02 g) were dispersed on a circular glass substrate uniformly.Prior to photoreduction experiments, the reaction setup was vacuum-treated and then, high purity CO 2 gas (99.995) as purging and reaction gas was introduced into the reaction system for five times.The compressed CO 2 gas was passed through a humidifier to generate a mixture of CO 2 and H 2 O vapor.The light source was a 300 W xenon lamp (PLS-SXE300, Beijing Perfectlight Co., Ltd.).The gaseous products from the reactor were identified by gas chromatograph (Agilent 7890A)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "CdWO 4 was prepared by chemical conversion method using the asprepared WO 3 nanoplates as precursor.The pH values of reaction systems were monitored (Table S2) and the conversion mechanism can be deduced accordingly.When WO 3 nanoplates were dispersed into water, WO 3 would combine with H 2 O to generate H 2 WO 4 , which may release trace WO 4 2-and generate H to pull down the pH value of the solution 49.After adding cadmium acetate to the reaction system, the conversion process of WO 3 to WO 4 2-will be promoted due to the alkalescent property of cadmium acetate solution and violent precipitation reaction of WO 4 2-with Cd 2 .The whole reaction can be generalized as Eq. ( 1). (1) Since acetic acid was produced, the pH values decreased in the process of reaction.Similar situations were happened on different reaction systems (Table S2).To investigate the process of CdWO 4 generation, XRD patterns were recorded on reaction products at different stages of the synthetic process (Fig. S2).After heating for 20 min, the diffraction peaks of WO 3 disappear and new diffraction peaks emerge, which can be ascribed to the formation of tetragonal CdWO 4 .Since tetragonal CdWO 4 has no corresponding PDF card but has similar diffraction peaks with CaWO 4 (PDF No 01-077-2237), tetragonal CdWO 4 is generally considered as an isostructural phase of CaWO 4 31.With the increase of reaction time, tetragonal CdWO 4 gradually turned into thermodynamically stable CdWO 4 with monoclinic wolframite structure (PDF No 01-088-0181).After four hours, the process of CdWO 4 conversion from tetragonal scheelite phase to monoclinic wolframite phase finished completely. The morphology of the obtained monoclinic CdWO 4 was observed by SEM and representative images are shown in Fig. 1a.Typical CdWO 4 appears cymbiform shape with length 0.5-1.5 m, width 100-400 nm and thickness 20-80 nm.Further investigation of the microstructure was carried out by using TEM and the basal plane of CdWO 4 nanoplate can be identified as (010) (Fig. S3).In addition, the CdWO 4 nanoplate is grown along the 100 direction, which is consistent with Ling's report 50. The CdS/CdWO 4 composites were prepared by depositing CdS on cymbiform CdWO 4 nanoplates.When the solution of cadmium acetate was added into the suspension of CdWO 4 , Cd 2 ions preferentially adsorbed onto the edges of cymbiform CdWO 4 nanoplates driven by electrostatic force 23,51.As thiourea was added, the thiourea molecules CH 3 CSNH 2 will react with Cd 2 ions and form complex compound.It is known that the CH 3 CSNH 2 molecules can be decomposed at 70 C and S 2-ions would be released in alkalescent suspension 52.Thus, CdS deposited selectively on the edge of CdWO 4 nanoplates.The formation process can be schematically illustrated in Scheme 1. Typical SEM images of C30, C50 and C70 are shown in Fig. 1b-d.For C30, CdS nanoparticles with the particle size of 10-20 nm are observed to be well dispersed on the edge of CdWO 4 .It is generally acknowledged that the thiourea not only functions as the slow-release sulfur source but also acts as complexing agent of Cd 2 .So, the CdS nanoparticles formed by thiourea decomposition have uniform particle sizes.With the increase of CdS content (C50), CdS nanoparticles become denser but still well-scattered on the edge of CdWO 4 (Fig. 1c).Further increase of the loaded dose (C70), CdS nanoparticles are observed not only on the edges but also full of crystal surface of CdWO 4 (Fig. 1d). The crystal structures of the fabricated materials were examined by XRD measurement. To further investigate the morphological and structural features of the CdS/CdWO 4 composites, transmission electron microscopy (TEM) technique was employed and a typical TEM image of C50 is displayed in Fig. 3a.It can be clearly seen that the composite presents semishuttle with decorative border, i.e., a CdWO 4 nanoplate is dotted with CdS nanoparticles on its border.Moreover, the overwhelming majority of CdS nanoparticles are distributed on the edge of CdWO 4 , which is consistent with the observations of SEM. To observe the heterojunction more clearly, high-resolution TEM of C50 was carried out and shown in Fig. 3b.A lattice spacing of 0.336 nm is determined, which can be assigned to the (002) spacing plane of hexagonal CdS.Another resolved d spacing of 0.231 nm may be attributed to (210) facet of monoclinic CdWO 4 .More crystal lattice fringes cannot be detected in the HRTEM image due to weak crystallinity.To further determine the specific distribution of Cd, W and S elements, EDS mappings of C50 were conducted and shown in Fig. S4.The Cd, W and S elements are distributed homogeneously throughout the whole testing region.The intimate contact between CdS and CdWO 4 is conducive to the transmission of photo-generated charge carriers across the interface, as shown below. In the process of CdS deposition, the first step is the successful adsorption of Cd 2 on substrate 23,51.The formation of CdS deposition is centered on the nucleus of CdS, which produced by electrostatic force between Cd 2 and S 2-ions at the Cd 2 adsorption sites.According to previous reports 49,53 XPS measurements were carried out to elucidate the surface composition and the chemical states of the elements.The survey XPS spectrum of the representative C50 indicates that the main constituent elements of the composite include Cd, W, S and O, which are well consistent with the chemical compositions (Fig. S5).In the high-resolution Cd 3d spectra of C50 (Fig. 5a), two distinct peaks at binding energies of 405.0 eV for Cd 3d 5/2 and 411.7 eV for Cd 3d 3/2 are observed 20.The binding energies of Cd 3d in C50 shift to low position in comparison with pristine CdS, but shift to high energy when compared to CdWO 4 . For the W 4f spectra (Fig. 5b), C50 exhibits two peaks at 35.3 and 37.4 eV.The first peak can be ascribed to W 4f 7/2 and the second one is ascribed to W 4f 5/2 50.Both peaks have about 0.3 eV shift to high binding energies when compared with those of pure CdWO 4 .Analogously, the peak shifts are also found out in S 2p spectra of C50 (Fig. 5c).The O 1 s peak of C50 (Fig. 5d) can be deconvoluted into three components, which center at 530.3, 531.7 and 533.0 eV, respectively.The peaks at around 531.7 and 533.0 eV are related to hydroxyl group and absorbed H 2 O molecule on the surface, 24 while the binding energy at 530.3 eV is assigned to the W -O bond of CdWO 4 54.It is noteworthy that all the binding energies have 0.4 eV shifts to high binding energies compared with those of CdWO 4 .The peak shifts for binding energies may be attributed to the intense interaction between CdS and CdWO 4 , further demonstrating the formation of heterojunctions in C50 25. To study the light-harvesting ability and energy band structure of the catalysts, the samples were characterized by UV-vis diffuse reflectance spectra (DRS), valence band X-ray photoelectron spectroscopy (VB XPS) and Mott-Schottky plots.Fig. 6a displays UV-vis diffuse reflectance spectra of CdWO 4 , C50, and CdS.The absorption edge of CdWO 4 is at around 310 nm, while that of CdS at 550 nm.The light absorption of C50 is promoted evidently by loading CdS.The band gap of the CdWO 4 and CdS can be estimated according to the Kubelka-Munk function (Eq.( 2)). (2) where hv, , A, and E g are light energy, absorption index, constant value, and band gap energy of semiconductor, respectively.The n relies on the semiconductor's transition type.In this work, the index n can be set as 4 for CdS with direct band gap, and 1 for CdWO 4 with indirect band gap, respectively 28,51.The band gap of CdWO 4 and CdS are thus calculated to be 3.94 eV and 2.26 eV (the inset of Fig. 6a), respectively.The calculated results are consistent well with the reported values 23,29. The VB XPS spectra of CdWO 4 and CdS are shown in Fig. 6b and Fig. 6c.For CdWO 4 , the valence band maximum (VBM) is at about 3.85 eV, while the band tail may be resulted from the defect or impurity of tetragonal CdWO 4 31,55.Combined with the results of DRS, the conduction band minimum (CBM) of CdWO 4 is calculated to be -0.09eV.For CdS, the VBM and CBM are at about 1.80 eV and -0.46 eV, respectively.In addition, the band structure obtained by UPS (Fig. S6) and calculated by concepts of electronegativity also perform similar results (Table S3), indicating that the VBM and CBM positions of CdWO 4 and CdS are believable. The Mott-Schottky plots are shown in Fig. 6d and Fig. 6e.The flat potentials of n-type semiconductor CdWO 4 and CdS are -0.21 and -0.39 V vs. the Ag/AgCl electrode, which are equivalent to 0.01 and -0.17 V vs. the normal hydrogen electrode (NHE), respectively.For ntype semiconductors, flat potentials could be regarded as the fermi level (E f ) 56.Therefore, the E f of CdWO 4 is lower than that of CdS, while the work function of CdWO 4 is higher than that of CdS.Based on the above analysis, the energy band structure of CdWO 4 and CdS can be schemed respectively, as shown in Fig. 6f.More discussion on the band structure of CdS/CdWO 4 composites will be given in Section 3.8. The photocatalytic activities for CO 2 reduction of CdWO 4 , CdS, C30, C40, C50, C60, and C70 were evaluated in gaseous phase with H 2 O vapor as electron donor.Fig. 7a shows the yields of products CO and CH 4 for different samples under ultraviolet and visible light irradiation for 3 h.Pure CdWO 4 and CdS exhibit low photocatalytic activity, which may be resulted from unsuitable energy band level 20 and fast recombination of photogenerated carriers 23.By contrast, all the CdS/ CdWO 4 nanocomposites exhibit higher photocatalytic activity than pure CdWO 4 and CdS.Moreover, the production of CO increase with the increasing CdS content in CdS/CdWO 4 and reach a maximum of 4.16 mol g -1 for C50, roughly 4.9 and 5.4 times higher than those of CdWO 4 (0.71 mol g -1 ) and CdS (0.65 mol g -1 ), respectively.Further increasing the CdS loading dosage as C60 and C70, the CO yields decreases instead, which may be attributed to excess CdS nanoparticles occupying the active sites of water oxidation on CdWO 4 and/or hindering the light absorption of CdWO 4 20,23.The photocatalytic CO 2 reduction performance of the C50 reaches 1.39 mol g -1 h -1 for CO production.The value is at a moderate level, when compare with other Z-scheme catalysts for CO 2 reduction, as shown in Table S4.The continuous yields of CO and CH 4 for CdWO 4 , CdS, and C50 for 5 h are illustrated in Fig. 7b.The yields of CO and CH 4 for CdWO 4 , CdS and C50 increase with the light irradiation time.Moreover, the yields of CO and CH 4 for C50 have a great increase compared to those of pure CdWO 4 and CdS. Fig. 7c shows the yields of products for C50 under various reaction conditions.Under the typical conditions (Fig. 7c, column 1), CO 2 molecules are photoreduced into CO and CH 4 with the yields of 4.16 mol g -1 and 0.35 mol g -1 , respectively.However, once without photocatalyst C50 in the system (Fig. 7c, column 2), the yield of CO substantially decreases to 0.1 mol g -1 and no CH 4 is detected.When the CO 2 reduction reactions are performed in dark (Fig. 7c, column 3), there are no CO or CH 4 detected, suggesting that the CO 2 conversion should be driven by light irradiation.The control experiment using N 2 as the feedstock gas (Fig. 7c, column 4) demonstrates that only a small amount of CO (0.2 mol g -1 ) is generated.The control experiments indicate that the products CO and CH 4 are mainly originated from the CO 2 reactant, not the organic impurities on the surface of the photoreactor or catalysts. Reproducibility and durability are critical issues for the long-term use of a catalyst in practical application.In the durability tests, the photoreduction CO 2 of the typical C50 catalyst was repeated for five times, as shown in Fig. 7d.The yields of CH 4 and CO for C50 decreased slightly after four cycles.By contrast, the activity of photoreduction CO 2 for CdS under the same condition decreased quickly with recycle times (Fig. S7).The results indicate that, compared with pure CdS, the photostability of the prepared CdS/CdWO 4 composites is improved greatly.The good photostability of photocatalysts C50 has also been verified by XRD, SEM and Infrared spectrum of C50 before and after illumination for 20 h (Fig. S8, S9 and S10).The reason for enhanced photostability should be attributed to the formation of heterojunctions and the Z-type charge transfer mode, as discussed in Section 3.8. Based on the results of the photocatalytic CO 2 reduction (Fig. 7) and the band structure of CdS and CdWO 4 (Fig. 6f), the enhanced photocatalytic CO 2 activity can be deduced as follows.When CdS and CdWO 4 contact each other, the heterojunction will form at the interfacial phase.The electrons of CdS with smaller work function will transfer to CdWO 4 with higher work function until their Fermi levels arranged in a line.As a result, built-in electric fields, space charge region and surface band bending are formed at the phase interface 17181957.Combined with the model of heterojunction, 58 the energy band structure of CdS/ CdWO 4 could be inferred, as shown in Fig. 8a andb.Since the Fermi level of CdS is higher than CdWO 4 , a positive shift in the Fermi energy level of the CdWO 4 and a negative shift in the Fermi energy level of the CdS would be expected.Accompanying with the movement of Fermi levels, the CBM and VBM for both CdS shift downward, respectively.Specifically, for CdS in CdS/CdWO 4 , the VBM and CBM are at about 1.98 eV and -0.28 eV, respectively.Meanwhile, the VB and CB of CdS would bend upwards. In the CdS/CdWO 4 heterojunction, the photogenerated charge transfer pathways may adopt either conventional type-II mode or Zscheme mode (Fig. 8a andb).If the charge transfer mode of CdS/ CdWO 4 composite is type-II, photogenerated electrons in the CB of CdS would migrate to the CB of CdWO 4 and CdWO 4 would be positioned at the site of CO 2 reduction.However, the conduction band minimum of CdWO 4 (-0.09V vs. NHE) is not powerful enough to reduce CO 2 to the products of CO and CH 4 43.Therefore, we speculate that the charge transfer across the interfacial phase of the CdS/CdWO 4 composite is Zscheme mode in consideration of the enhanced photocatalytic activity of CdS/CdWO 4 . Besides, the photogenerated charge transfer mode could be analyzed by the direction of band bending and built-in electric field, according to the energy band theory 17.The CB bending of CdS sets up a potential barrier, which would hinder the photogenerated electrons in CB of CdS transfer to CdWO 4 under illumination.A driving force are also provided by the built-in electric fields to promote the photogenerated electrons transfer from CdWO 4 to CdS, which agrees with the Z-scheme mechanism (Fig. 8b). To verify the Z-scheme mechanism experimentally, we examined the deposition of Pt nanoparticles on the surface of CdS/CdWO 4 .Under light irradiation, Pt nanoparticles will be deposited at the sites with higher electrons density 59.TEM results (Figs. 8c andd) show that Pt nanoparticles are selectively deposited on CdS nanoparticles.The results indicate that CdS has higher electron density than CdWO 4 , under illumination, i.e., the above speculation on Z-scheme transfer mode is verified experimentally. To explore the separation of the photoinduced electron-holes on the cymbiform CdWO 4 nanoplates, surface potential distribution on CdWO 4 nanoplates was characterized by Kelvin probe force microscope (KPFM) and the results are shown in Fig. 9. KPFM can be applied for measuring contact potential difference (CPD) between a conducting tip and the sample 60.The high CPD value indicates high surface potential and low surface work function 61.Fig. 9a andb show the topographic image of CdWO 4 on Si substrate and the corresponding dark state KPFM image.The corresponding height (Fig. 9a) and potential (Fig. 9b To further provide convincing evidence for the separation of photogenerated electron-hole pairs, the transient photocurrent response of CdWO 4 , CdS, and C50 have been tested (Fig. S11).The photocurrent density of C50 electrode is about 3-fold and 1.5-fold higher than that of CdWO 4 and CdS electrode, respectively.The enhanced photocurrent responses suggest higher separation efficiency of electron-hole pairs.Besides transient photocurrent, the results of photoluminescence (PL) emission spectra also provide strong support for the enhanced separation of electron-hole pairs (Fig. S12) 141516.The higher separation efficiency of electron-hole pairs may be originated from the built-in electric fields induced by Z-Scheme heterojunction and spatial variation in work function of CdWO 4 nanoplates."
  },
  {
    "title": "Conclusions",
    "content": "A series of CdS/CdWO 4 photocatalysts were synthesized by selectively depositing CdS nanoparticles on the edges of the cymbiform CdWO 4 nanoplates directed by surface charge difference.The content of CdS in the composites was optimized in terms of their photoreduction CO 2 properties and the optimal composite C50 exhibits more efficient photocatalytic activity than pure CdWO 4 and CdS.The enhanced photoactivity is mainly attributed to Z-scheme charge transfer mode that is established by analyzing the products of photoreduction CO 2 and the band structure of CdS and CdWO 4 .The surface potential distribution of CdWO 4 nanoplates detected by Kelvin probe force microscope indicates that the photogenerated electrons would migrate to the edge of CdWO 4 .The charge transfer direction on CdWO 4 nanoplates, coupling with the selective deposition of CdS nanoparticles, can synergistically facilitate CdS/CdWO 4 composites following Z-scheme transfer.Subsequent Pt photodeposition experiment provides powerful support to the charge transfer mechanism.The results obtained in this work may be helpful for rationally designing new Z-scheme photocatalyst for CO 2 reduction. Fig. 1.SEM morphology of CdWO 4 (a), C30 (b), C50 (c) and C70 (d). Y.-Y.Li, et al.Applied Surface Science 483 (2019) 442-452of CdS phase in the composites can be confirmed by the appearance of the diffraction peaks around 24.8and 26.5, which correspond to (100) and (002) plane of hexagonal CdS (PDF No 01-080-0006).For C30, C40, C50, C60 and C70, the diffraction peaks of CdS become strong gradually, indicating the increase of CdS content (Fig.2). Scheme 1. Schematic view of the synthetic process for CdS/CdWO 4 . Fig. 3. TEM (a) and HRTEM (b) images of C50. Fig. 5. High-resolution XPS spectra of Cd 3d (a), W 4f (b), S 2p (c) and O 1 s (d) for CdWO 4 , C50, and CdS. Fig. 6.(a) UV-vis diffuse reflectance spectra of CdWO 4 , C50 and CdS (Inset: Plots of the (h) 2 vs photon energy (h) for CdWO 4 and CdS); Valence-band XPS spectra of CdWO 4 (b) and CdS (c); Mott-Schottky plots of pure CdWO 4 (d) and CdS (e) film electrode at frequency of 1000 Hz in an aqueous solution of Na 2 SO 4 (0.1 M); (f) Diagram of the energy band structure of CdWO 4 and CdS. ) cross section profiles are shown in Fig. 9c.Compared with the basal plane, more positive surface potential was observed on the edge of CdWO 4 nanoplate.It indicates that the CdWO 4 nanoplate shows spatial variation in work function.This phenomenon may be derived from a lateral pseudoheterostructure based on inhomogeneous strain distribution Fig. 7. (a) Yields of CO and CH 4 for CdWO 4 , CdS, C30, C40, C50, C60 and C70 under light irradiation for 3 h; (b) Yields of CO and CH 4 for CdWO 4 , CdS and C50 under light irradiation for 5 h; (c) Yields of CO and CH 4 under various conditions under light irradiation for 3 h; (d) Cycling tests of photocatalytic CO 2 reduction for C50 under light irradiation for 5 h. . The spatial variation in work function favors the separation of photoexcited charge carriers under ultraviolet light irradiation.As shown in Fig.9d, the direction of built-in electric field is from the edge to basal plane, which is inferred from surface potential distribution.When the CdWO 4 illuminated by ultraviolet light, the photogenerated electrons would migrate to the edge of CdWO 4 driven by electric field forces, while the holes would migrate to the basal plane.In CdS/CdWO 4 composites, the enriched photogenerated electrons on the edge of CdWO 4 nanoplates would be easily recombined with the holes of CdS to form Z-scheme transfer mode.If CdS nanoparticles are deposited on the basal plane, the photogenerated electrons enriched on the edge are hard to recombine with the holes of CdS on basal plane.Thus, spatial variation in work function of CdWO 4 nanoplates, coupling with the selective deposition of CdS nanoparticles, synergistically promote the Zscheme transfer of the photogenerated charges of CdS/CdWO 4 composites. Fig. 9. Topographic image of CdWO 4 on Si substrate (a); Dark state KPFM image of CdWO 4 (b); Their corresponding height and potential cross section profile (c); A scheme to describe the built-in electric field and behaviors of photogenerated carriers migration in single CdWO 4 nanoplate (d). We would like to thank the financial supports of National Natural Science Foundation of China (Nos.21671176 and 21471133), and National Training Program of Innovation and Entrepreneurship for Fig. 8. Schematic diagram of photoinduced electron-hole separation processes: Type II (a) and Z-scheme (b); TEM image of C50 (c) and Pt/C50 (d) synthesized via photodeposition method. Supplementary data to this article can be found online at https:// doi.org/10.1016/j.apsusc.2019.03.333."
  }
]