[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2017.01.035"
  },
  {
    "title": "Article_Title",
    "content": "Grain boundary engineered metal nanowire cocatalysts for enhanced photocatalytic reduction of carbon dioxide"
  },
  {
    "title": "Abstract",
    "content": "The combination of metal cocatalysts with light-harvesting semiconductors is a promising route to improving the photocatalytic performance in CO 2 reduction reaction.However, owing to the high H 2 O activation ability of metal surface, the H 2 evolution from water as a side reaction greatly decreases the activity and selectivity for CO 2 reduction.Herein, we demonstrate that the photocatalytic performance in CO 2 reduction can be promoted by grain boundaries (GBs) on metal cocatalysts.In this work, metal (Rh and Pd) nanowires with high density of GB were loaded on TiO 2 nanosheets, which acting as cocatalysts effectively reduce the H 2 evolution and greatly enhance the photocatalytic performance in CO 2 reduction as compared with the corresponding metal nanoparticle cocatalysts without GBs.Two effects are believed to contribute to this enhancement: (1) nanowire structure facilitates the interfacial electron transfer from TiO 2 to metal cocatalysts; (2) the GB terminations on the surface of metal cocatalysts are catalytically active sites for CO 2 reduction reaction.This work highlights the rational architectural design of cocatalyst for enhanced photocatalytic performance."
  },
  {
    "title": "Experimental",
    "content": "Sodium hexachlororhodate(III) (Na 3 RhCl 6 , Aldrich, 206288), poly(vinyl pyrrolidone) (PVP, M.W. 55000, Aldrich, 856568), sodium iodide (NaI, Aladdin, S104084) and sodium tetrachloropalladate(II) (K 2 PdCl 4 , Aladdin, P106044) were used in the synthesis.All other chemicals were of analytical grade and purchased from Sinopharm Chemical Reagent Co., Ltd.All the chemicals were used as received without further purification.The water used in all experiments was de-ionized (DI). The TiO 2 nanosheets were synthesized by modifying a method in literature with hydrofluoric acid as a capping agent 27.Caution!Hydrofluoric acid is extremely corrosive and toxic, and should be handled with extreme care. In a typical synthesis, Na 3 RhCl 6 (10 mg), NaI (75 mg), sodium ascorbate (NaAA, 40 mg) and PVP (160 mg) were dissolved in a mixture of 5 mL ethylene glycol (EG) and 1 mL H 2 O suspension containing 100 mg TiO 2 nanosheets.The mixture was sonicated for around 5 min and heated at 170 C for 5 min and 30 min to obtain TiO 2 nanosheets supported short and long Rh nanowires, respectively 28.The as-obtained products were collected by centrifugating and washing several times with acetone, water and ethanol, and drying at 45 C in vacuum.TiO 2 nanosheets supported Rh nanoparticles was prepared under the same experimental conditions as the TiO 2 supported Rh nanowires except without use of NaI, which was heated at 170 C for 30 min.The TiO 2 nanosheets supported long Rh nanowires was further annealed at 280 C under Ar protection for 3 h to obtain the annealed TiO 2 -Rh nanowires. In a typical synthesis of TiO 2 supported Pd nanowires, K 2 PdCl 4 (7.6 mg) and PVP (800 mg) were dissolved in 10 mL of aqueous suspension containing 100 mg TiO 2 nanosheets.The resulting homogeneous suspension was transferred to a 20-mL Teflon-lined stainless-steel autoclave and then heated at 200 C for 4 h before it was cooled to room temperature.The as-obtained products were collected by centrifugating and washing several times with acetone, water and ethanol, and drying at 45 C in vacuum.As for the synthesis of TiO 2 supported Pd nanoparticles, PVP (120 mg) were dissolved in 8 mL EG suspension of TiO 2 nanosheets (100 mg), which was injected into a 50-ml flask, and pre-heated under magnetic stirring at 160 C. Then 3 mL of EG solution containing K 2 PdCl 4 (7.6 mg) was then added into the flask, and the reaction was allowed to proceed at 160 C for 3 h.The product was collected and dried at 45 C in vacuum.The TiO 2 nanosheets supported Pd nanowires was further annealed at 280 C under Ar protection for 3 h to obtain the annealed TiO 2 -Pd nanowires. Transmission electron microscopy (TEM) and high-resolution TEM (HRTEM) images were taken on a JEOL JEM-2100F fieldemission high-resolution transmission electron microscope operated at 200 kV.Powder X-ray powder diffraction (XRD) patterns were recorded by using a Philips X'Pert Pro Super X-ray diffractometer with Cu-K radiation ( 1.5418A).X-ray photoelectron spectra (XPS) were collected on an ESCALab 250 X-ray photoelectron spectrometer, using nonmonochromatized Al-K X-ray as the excitation source.UV-vis-NIR diffuse reflectance data were recorded in the spectral region of 200-800 nm with a Shimadzu SolidSpec-3700 spectrophotometer.Photoluminescence (PL) spectra were recorded on a HITACHI F-7000 Spectrofluorometer.The molar ratios of metal to TiO 2 were measured as follows: the samples were dissolved with a mixture of HCl and HNO 3 (3:1, volume ratio), which was then diluted with 1 HNO 3 .The concentrations of metal were then measured with a Thermo Scientific PlasmaQuad 3 inductively-coupled plasma mass spectrometry (ICP-MS).The weight ratios of metal to TiO 2 were determined by sample weighing prior to the dissolution of metal for the ICP-MS measurements. 3.0-mg as-synthesized products were dispersed in a mixture of 10-L ethanol and 10-L nafion, which were then uniformly spin dropped onto a 1 cm 1 cm indium tin oxide (ITO)-coated glass by a spin coater (SC-1B, China).Subsequently, the ITO-coated glass was heated at 80 C in a vacuum oven for 1 h.The photocurrents were measured on a CHI 660D electrochemical station (Shanghai Chenhua, China) in ambient conditions under irradiation of a 300-W Xe lamp (Solaredge 700, China).UV light was used as the illumination source, which was realized by using a 400-nm cutoff filter (short-wave-pass).The power density of UV light was measured to be 2.7 mW cm -2 .Standard three-electrode setup was used with the ITO coated glass as photoelectrode, a Pt foil as counter electrode, and a Ag/AgCl electrode as reference electrode.The three electrodes were inserted in a quartz cell filled with 0.5-M Na 2 SO 4 electrolyte.The photoresponse of the prepared photoelectrodes (i.e., I-t) was operated by measuring the photocurrent densities under chopped light irradiation (light on/off cycles: 60 s) at a bias potential of 0.4 V vs. Ag/AgCl for 400 s.The electrochemical impedance spectroscopy (EIS) was carried out in the frequency range of 10 -1 -10 5 Hz with an AC voltage amplitude of 10 mV at a bias potential of 0.4 V vs. Ag/AgCl. CO 2 photocatalytic reduction reaction was typically conducted in a 100 mL reactor (Perfect Light Company, Beijing).To remove possible trace organic contaminants, all the samples were treated at 160 C for 3 h in air.The heat treatment at 160 C can not influence the morphology of the samples with the reason that the TiO 2 -Rh and TiO 2 -Pd samples were synthesized at the same or a higher temperature.In a typical process, 15 mg of photocatalyst was dispersed on the flat glass plate on the bottom of the reactor.And 1 mL H 2 O was added and surrounded the plate.The reactor loaded with photocatalysts was first purged with high purity CO 2 for 30 min.The pressure of CO 2 was regulated to 0.15 MPa.Then the light-irradiation experiment was performed by using a 300 W Xe lamp with UV light as the illumination source.The power density of UV light ( 400 nm) was measured to be 2.7 mW cm -2 .The photocatalytic reaction was typically performed for 4 h.During the irradiation, 1 mL gas and 1 L liquid were sampled from the glass chamber at a given time intervals (1 h).The amounts of gaseous products evolved were determined using gas chromatography (GC-2014, Shimadzu).The H 2 and CH 4 were determined using a thermal conductivity detector (TCD) and flame ionization detectors (FID), respectively.The CO was converted to CH 4 by a methanation reactor and then analyzed by the FID.The C 2 H 5 OH in liquid phase was determined by a FID using gas chromatography (GC-2010 Plus, Shimadzu).During the stability test, the photocatalysts were collected after each run and then reused for the CO 2 reduction reaction.The photocatalysts were heat-treated at 160 C for 3 h after the runs before its reusing.The apparent quantum efficiency (AQE) was measured under the same reactive condition, except for the use of a 365 nm band-pass filter instead of 400-nm cutoff filter.The AQE was calculated according to the following Equation: number of incident photons 100 (1)"
  },
  {
    "title": "Results_and_Discussion",
    "content": "The work begins with the choice of single-crystalline TiO 2 nanosheets as a semiconductor model, which was synthesized through a hydrothermal procedure according to previous report 27.As shown in the TEM images (Fig. S1a andb), the edge length of the TiO 2 nanosheets is above 200 nm and the thickness is below 5 nm.According to the size of the nanosheets, the area percentage of the top and bottom flat faces is over 95.The large flat surface of the TiO 2 nanosheets facilitates the loading of cocatalysts in various dimensions, while the low thickness shortens the distance of electron transfer to the cocatalyst in reducing the possibility of electron-hole recombination in the bulk semiconductor.According to the XRD pattern, the as-synthesized TiO 2 nanosheets are in anatase phase (JCPDS 21-1272) (Fig. S2).As indicated by the HRTEM images, the flat surface of the TiO 2 nanosheets is exposed with (001) facet (Fig. S1c andd). Then Rh nanocrystals were in-situ grown on TiO 2 nanosheets by reducing Na 3 RhCl 6 with NaAA using EG as solvent.The work function of TiO 2 (4.8 eV) is smaller than that of Rh (5.0 eV), ensuring the photogenerated electron transfer from TiO 2 to Rh 29.Based on the different experimental conditions, Rh nanocrystals in different morphologies were synthesized (Fig. S3) 28.Rh nanowires and nanoparticles were grown on TiO 2 nanosheets with and without NaI as structure-directing agent, respectively.Furthermore, the length of the Rh nanowires could be tailored through tuning the reaction time.Longer Rh nanowires were obtained on the TiO 2 nanosheets with a longer reaction time.Accordingly, three samples including TiO 2 -supported Rh nanoparticles (TiO 2 -Rh NPs), TiO 2supported short Rh nanowires (TiO 2 -Rh SWs) and TiO 2 -supported long Rh nanowires (TiO 2 -Rh LWs) were synthesized. From the TEM images of as-synthesized TiO 2 -Rh NPs sample (Fig. 1a andb), it could be seen that Rh nanoparticles with an average size of 2 nm are uniformly distributed on the flat surface of TiO 2 nanosheets.As shown in the HRTEM image (Fig. 1c), the lattice fringes with interplanar spacing of 0.22 nm are indexed to the (111) plane of face-centered cubic (fcc) Rh crystals.In contrast to the TiO 2 -Rh NPs sample, Rh nanoparticles in TiO 2 -Rh SWs and TiO 2 -Rh LWs were attached to each other to form nanowires on the flat surface of TiO 2 nanosheets.As shown in the TEM images of TiO 2 -Rh SWs (Fig. 1d ande), short Rh nanowires with an average length in the range of 4-10 nm and diameter of about 2 nm are loaded on the surface of TiO 2 nanosheets.The corresponding HRTEM image also indicates the lattice spacing of 0.22 nm, consistent with the (111) plane of fcc Rh (Fig. 1f).The Rh nanowires are not in monocrystalline structure, as revealed by the discontinuous lattice fringes, which is resulted from the GBs formed on the joints of the attached Rh nanoparticles.It could be also seen that a small amount of Rh nanoparticles are coexisted with the nanowires in the TiO 2 -Rh SWs sample, revealing that not all the nanoparticles were attached to each other in forming the nanowires.Different from the TiO 2 -Rh SWs, all the Rh nanoparticles were interconnected to form longer nanowires in the TiO 2 -Rh LWs sample.As shown in TEM images (Fig. 1g andh), the flat surface of TiO 2 nanosheets are decorated with wavy Rh nanowires in higher aspect ratio (10).In the HRTEM image of the TiO 2 -Rh LWs (Fig. 1i), it could be seen that the lattice fringes with 0.22 nm spacing are also broken off by the GBs.As a long Rh nanowire can be considered as the connections of several short nanowires, the density of GB in TiO 2 -Rh LWs is higher than that in TiO 2 -Rh SWs as more GBs are formed on the new connected joints.Based on the HRTEM images, the surface densities of GB in TiO 2 -Rh NPs, TiO 2 -Rh SWs and TiO 2 -Rh LWs were determined to be 0, 0.15 and 0.42 nm -1 , which were calculated by dividing the sum of all the GB surface lengths by the sum of the nanowire surface area according to the schematic illustration and equation in Fig. S4. The composition of the as-obtained TiO 2 -Rh samples was further confirmed by XPS spectra.The survey XPS spectrum in Fig. 2a shows the Ti, O and Rh peaks in the TiO 2 -Rh LWs hybrid structure.In the high-resolution spectrum of Ti2p (Fig. 2b), the peaks with binding energies of 459.0 eV and 464.7 eV are attributed to Ti2p 3/2 and Ti2p 1/2 for Ti(IV) of the surface titania, respectively.And the peaks located at 530.0 eV and 531.6 eV in the high-resolution spectrum of O1s are assigned to O Ti of TiO 2 and O H of adsorbed OH groups on the TiO 2 surface, respectively (Fig. 2c).As for the spectrum of Rh3d (Fig. 2d), the binding energies of 307.2 eV (Rh3d 5/2 ) and 311.9 eV (Rh3d 3/2 ) are in good agreement with the zero valence of Rh, while trace amount of Rh (III) chemical states is also detected and shown as the doublets (308.5 and 313.2 eV), respectively, which are typical features for solution-phase synthesized Rh nanocrystals 30.In the XRD pattern of TiO 2 -Rh LWs (Fig. S2), besides of the peaks of TiO 2 , the additional weak peaks are assigned to fcc Rh (JCPDS 01-1214). To investigate the charge kinetics of the TiO 2 -Rh samples, the loading amounts of Rh in the TiO 2 -Rh samples were kept the same as detected by ICP-MS (Table S1).The light absorption ability of the samples was firstly investigated by UV-vis-NIR diffuse reflectance spectra.As shown in Fig. 3a, bare TiO 2 , TiO 2 -Rh NPs, Having confirmed the charge kinetics of the TiO 2 -Rh samples, we further investigated their photocatalytic performance in CO 2 reduction under UV light irradiation.The photocatalytic activity was measured in a gas-closed quartz reactor with high purity CO 2 and gaseous H 2 O reactants for 4 h.The gaseous and aqueous products were continually taken from the reactor at a given interval (1 h) for quantitative analysis.H 2 , CO and CH 4 were found to be the gaseous products for CO 2 reduction, while O 2 was also detected as the product of H 2 O oxidation.Besides, C 2 H 5 OH was also detected as the liquid phase product, confirming the occurrence of this reaction: 2CO 2 12H 12e - C 2 H 5 OH 3H 2 O.Control photocatalytic experiment under the same condition but in the absence of CO 2 atmosphere was also performed, in which no carbonaceous product was detected.Fig. 4 shows the evolution of the produced H 2 , CO, CH 4 and C 2 H 5 OH as functions of irradiation time.It could be seen that the yield of products increases upon prolonged light irradiation for all the tested samples.In comparison with bare TiO 2 , all the TiO 2 -Rh samples exhibit significantly higher activity in the production of H 2 , CO, CH 4 and C 2 H 5 OH, confirming the cocatalyst roles of Rh nanocrystals in the photocatalytic reaction.More importantly, for TiO 2 -Rh samples, Rh cocatalysts with different morphologies lead to different photocatalytic activities.As shown in Fig. 4a, the H 2 yield is in the order of TiO 2 -Rh NPs TiO 2 -Rh SWs TiO 2 -Rh LWs, while the CO, CH 4 and C 2 H 5 OH yields are in the reverse order (Fig. 4b-d).The TiO 2 -Rh LWs achieves the highest CO (13.5 mol g -1 h -1 ), CH 4 (4.5 mol g -1 h -1 ) and C 2 H 5 OH (12.1 mol g -1 h -1 ) average production rate, but the lowest H 2 average production rate (10.6 mol g -1 h -1 ) during the 4 h reaction.As a result, the selectivity of TiO 2 -Rh LWs (ca.90.8) for CO 2 reduction is significantly higher than those of TiO 2 -Rh NPs (ca.53.1) and TiO 2 -Rh SWs (ca.76.0), which is calculated through the equation according to the numbers of electrons required to produce CO, CH 4 , C 2 H 5 OH and H 2 : where v(H 2 ), v(CO), v(CH 4 ) and v(C 2 H 5 OH) stand for the average formation rates for H 2 , CO, CH 4 and C 2 H 5 OH, respectively.The AQE of the TiO 2 -Rh LWs was measured to be 0.32 at 365 nm, higher than those of the TiO 2 -Rh NPs (0.18) and TiO 2 -Rh SWs (0.26).The higher solar-to-chemical energy conversion efficiency of TiO 2 -Rh LWs is in agreement with the charge kinetics result that Rh long nanowires can extract more electrons for photocatalytic reduction reactions.Furthermore, the enrichment of electron density on Rh nanowires also enhance the probability of the eight electron reaction to CH 4 as well as the twelve electron reaction to C 2 H 5 OH, in contrast to the two electron reactions to CO and H 2 34.The photocatalytic selectivity of CH 4 and C 2 H 5 OH formation for TiO 2 -Rh NPs, TiO 2 -Rh SWs and TiO 2 -Rh LWs samples are 44.3, 65.1 and 79.0, respectively, which is calculated through the equation: As the H 2 yield is not increased in the TiO 2 -Rh LWs as compared with TiO 2 -Rh NPs and TiO 2 -Rh SWs, the boosted photocatalytic selectivity for CO 2 reduction may be attributed to not only the promoted interfacial electron transfer from TiO 2 to Rh nanowires, but also the enhanced adsorption and activation ability of CO 2 molecules on the surface of Rh nanowires.Considering the same (111) planes on the surface of Rh nanoparticles and nanowires, the unique GBs on Rh nanowires may contribute to the enhancement of photocatalytic performance.As GB is a kind of two-dimensional defect with their terminations on the surface of the crystals, there are many terraces, steps, kinks, adatoms, and vacancies on the GB surface terminations, which may act as highly active reaction sites for the adsorption and activation of CO 2 molecules. To verify this possibility, we further reduced the density of GB on the surface of long Rh nanowires through annealing treatment of the TiO 2 -Rh LWs at 280 C under Ar atmosphere, in which atomic rearrangement was realized to obtain a more thermodynamically favorable state in minimizing the total surface energy with the reason that the GB is a kind of defect in higher surface energy.As shown in the TEM and HRTEM images of the annealed TiO 2 -Rh LWs (A-TiO 2 -Rh LWs) (Fig. 5a,b), the number of GB terminations on the surface of long Rh nanowires significantly decreases in spite that the nanowire shape is well maintained on the TiO 2 nanosheets.The GB density of A-TiO 2 -Rh LWs has decreased from 0.42 to 0.11 nm -1 after the annealing treatment.In comparison with TiO 2 -Rh LWs, there is an obvious enhancement in the photocurrent response of A-TiO 2 -Rh LWs (Fig. 5c).The reason is that the annealing treatment further increases the interfacial contact between TiO 2 and Rh nanowires for electron transfer, which could also be confirmed by the further enhanced quench degree of the PL spectra (Fig. S5).However, after the annealing treatment, the CO, CH 4 and C 2 H 5 OH average production rates decrease obviously, while the H 2 production rate increases for the A-TiO 2 -Rh LWs sample (Fig. 5d).As a result, the selectivity for CO 2 reduction declines from 90.8 to 70.9.The results confirm the vital function of GB terminations in promoting the photocatalytic CO 2 reduction reaction.Similarly, the recent studies have also confirmed the role of GB surface terminations as reaction active sites in the electrocatalytic reduction of CO 2 and CO 35,36.As the similar role of electrocatalysts and cocatalysts in extracting electrons for reduction reactions on the surface 37,38, the GB terminations on the surface of Rh cocatalyst are considered to be the catalytically active sites for CO 2 reduction reaction.Based on the data of TiO 2 -Rh NPs, TiO 2 -Rh SWs and TiO 2 -Rh LWs samples, the correlation between the GB surface density and average production rate of CO, CH 4 and C 2 H 5 OH was given in Fig. S6.It was found that the density of GB is not proportional to the photocatalytic activity in CO production as they should be in electrocatalysis though both the edge of electrocatalysts and cocatalysts act as electron donor and catalytically active sites for CO 2 reduction.However, the density of GB is in proportion to the CH 4 and C 2 H 5 OH production rate.The possible reason is that the CO is an important intermediate in the reduction of CO 2 to CH 4 (CO 6H 6e - CH 4 H 2 O) 4.As a result, the actual yield of CO is not only dependent on the production rate, but also the consumption rate, which leads to the more complicated relationship between the actual CO production rate and GB surface density, rather than a proportional one.Furthermore, the TiO 2 -Rh LWs samples with higher and lower Rh loading were also synthesized, which were named as TiO 2 -Rh LWs(H) and TiO 2 -Rh LWs(L), respectively (Fig. S7a-c).As determined by the ICP-MS (Table S1), the loading amounts of Rh in TiO 2 -Rh LWs(H) and TiO 2 -Rh LWs(L) are about half and double of the original TiO 2 -Rh LWs sample, respectively.The photocatalytic performance of the TiO 2 -Rh LWs with different loading amounts of Rh was compared in Fig. S7d.In comparison with TiO 2 -Rh LWs, it was found that both the TiO 2 -Rh LWs(H) and TiO 2 -Rh LWs(L) exhibit lower CO, CH 4 , C 2 H 5 OH and H 2 production rate, confirming that there is an optimal Rh loading amount in obtaining the maximal photocatalytic CO 2 reduction activity of TiO 2 -Rh LWs, which is in agreement with previous reports 13,15,39.The possible reason is that too small amount of Rh can not effectively suppress the recombination of electron-hole pairs, while excess Rh cocatalysts not only serve as the recombination centers in decreasing the photocatalytic activity, but also mask the TiO 2 surface and reduce the light absorption.It should be noted that there is no significant difference in the photocatalytic selectivity for CO 2 reduction between the TiO 2 -Rh LWs samples with different Rh loading, revealing that the photocatalytic selectivity for CO 2 reduction is not greatly dependent on the loading amount of Rh cocatalysts. To further confirm the role of GB terminations on the surface of metal cocatalysts in the photocatalytic CO 2 reduction reaction, Pd nanoparticles and nanowires were also in-situ grown on TiO 2 nanosheets to form TiO 2 -Pd NPs and TiO 2 -Pd NWs samples, respectively (Fig. S8).The photo-induced electrons generated in TiO 2 can also transfer to Pd owing to the larger work function of Pd (5.1 eV) as compared with that of TiO 2 40.As illustrated in the TEM images of as-obtained TiO 2 -Pd NPs (Fig. 6a andb), Pd nanoparticles with an average diameter of 3 nm are uniformly deposited on the surface of TiO 2 nanosheets.In the HRTEM image (Fig. 6c), the lattice fringes with interplanar spacing of 0.22 nm are consistent with the (111) planes of fcc Pd.In the TEM images of TiO 2 -Pd NWs (Fig. 6d ande), wavy Pd nanowires with an average diameter of 4 nm and aspect ratio larger than 10 are deposited on the TiO 2 nanosheets.From the HRTEM image in Fig. 6f, it could be clearly seen that the lattice fringes with 0.22 nm interplaner spacing are also broken by GB terminations on the surface of Pd nanowires.The GB surface density is 0 and 0.32 nm -1 for TiO 2 -Pd NPs and TiO 2 -Pd NWs, respectively.The XPS spectra of the as-obtained TiO 2 -Pd NWs indicate the Ti, O and Pd elements in the as-obtained TiO 2 -Pd NWs sample (Fig. S9a).Among them, the Ti and O peaks are much similar to those in the XPS spectra of TiO 2 -Rh LWs (Fig. S9b,c), while Pd peaks at 335.0 eV (Pd3d 5/2 ) and 340.3 eV (Pd3d 3/2 ) are in good agreement with the zero valence of Pd, and the satellite doublets at 336.2 and 341.8 eV correspond to the trace amount of Pd(II) (Fig. S9d), which are typical features for the Pd nanocrystals synthesized in solution 41. Similar to the TiO 2 -Rh photocatalysts, the charge kinetics of the TiO 2 -Pd samples were also studied with bare TiO 2 as a reference sample.The loading amounts of Pd in the TiO 2 -Pd samples were also kept the same and similar to the values of TiO 2 -Rh samples as detected by ICP-MS (Table S1).According to the UV-vis-NIR diffuse reflectance spectra (Fig. 7a), TiO 2 -Pd samples exhibit the comparable UV light absorption with bare TiO 2 in generating photo-induced charge carriers.In comparison with TiO 2 -Pd NPs, the larger photocurrent response of TiO 2 -Pd NWs in Fig. 7b reveals the superior electron extraction ability of Pd nanowires.The higher electron transfer ability on the interface between TiO 2 nanosheets and Pd nanowires is also confirmed by a smaller arc radius in the EIS spec-tra as well as a larger quench degree in the PL spectra of the TiO 2 -Pd NWs sample (Fig. 7c andd).The charge kinetics study further confirms the key role of metal nanowire cocatalyst in realizing the high-efficient electron-hole separation in semiconductor. The photocatalytic performance of the TiO 2 -Pd samples in CO 2 reduction reaction was shown in Fig. 8.It could be clearly seen that the TiO 2 -Pd NWs exhibit higher CO, CH 4 and C 2 H 5 OH yields but lower H 2 production in comparison with TiO 2 -Pd NPs.The enhanced photocatalytic selectivity in CO 2 reduction (ca.51.8 of TiO 2 -Pd NPs vs. ca.84.2 of TiO 2 -Pd NWs) further confirms that the GB terminations on the surface of metal cocatalyst act as catalytically active sites in improving the photocatalytic performance in CO 2 reduction.It should be noted that in comparison with TiO 2 -Rh samples, the TiO 2 -Pd samples exhibit higher H 2 evolution rate, but relatively lower production rate for CO, confirming the surface composition of metal cocatalysts also plays an important role in the photocatalytic activity and selectivity in CO 2 reduction reaction. The TiO 2 -Pd NWs was also annealed at 280 C under Ar protection for 3 h to obtain the annealed TiO 2 -Pd NWs (A-TiO 2 -Pd NWs).Different from the TiO 2 -Rh LWs sample, there is a significant change in the morphology of Pd nanowires after the annealing treatment.As shown in Fig. S10a andb, the Pd nanowires has changed into nanoparticles after the treatment.This difference may be resulted from the higher thermal stability of Rh in comparison with that of Pd.The similarity with TiO 2 -Pd NWs sample is that the GB surface density decreases from 0.32 to 0.07 nm -1 after the annealing treatment of the TiO 2 -Pd NWs (Fig. S10c).As a result, the average H 2 evolution rate increases while the CO, CH 4 and C 2 H 5 OH rate decreases, leading to the drop of selectivity for CO 2 reduction from 84.2 to 65.1 (Fig. S10d).Similar to TiO 2 -Rh LWs, the TiO 2 -Pd NWs samples with higher and lower loading amounts of Pd were also synthesized (Fig. S11a-c).Different from the TiO 2 -Rh LWs, the TiO 2 -Pd NWs(H) with higher Pd loading shows higher photocatalytic activity than TiO 2 -Pd NWs and TiO 2 -Pd NWs(L) (Fig. S11d), revealing that the optimum loading amount of cocatalyst varies with different cocatalysts.But the similarity is the approximate selectivity for CO 2 reduction between the TiO 2 -Pd NWs samples with different Pd loading, further confirming the selectivity for CO 2 reduction is mainly dependent on the GB surface density. As another important parameter of photocatalysts, the photocatalytic stability of the as-synthesized TiO 2 -Rh LWs and TiO 2 -Pd NWs in the CO 2 reduction reaction was also investigated.The photocatalysts were recollected after each run and reused for three times.As shown in Fig. 9a andb, both the TiO 2 -Rh LWs and TiO 2 -Pd NWs maintain good photocatalytic stability during the successive cycles.As compared with those of fresh sample, the CO, CH 4 and C 2 H 5 OH average production rates in the fourth run reduces by 14.1, 24.4 and 16.5 for TiO 2 -Rh LWs, respectively.Moreover, during the cycle process, resulted from more significant decrease in H 2 evolution rate, the selectivity for CO 2 reduction increases by 2.6 in the fourth run in comparison with the initial value.As for TiO 2 -Pd NWs, the CO evolution rate increases by 16.3, while CH 4 and C 2 H 5 OH evolution rate decreases by 15.0 and 8.5 after four cycles, respectively.In contrast to TiO 2 -Rh LWs sample, a significant increase in the H 2 production rate is taken place on the TiO 2 -Pd NWs along the cyclic process.As a result, the CO 2 reduction selectivity of TiO 2 -Pd NWs maintains 90.5 in the fourth run.The different change trends between TiO 2 -Rh LWs and TiO 2 -Pd NWs in the evolution rate of products and selectivity for CO 2 reduction in the cycles further confirm the important function of surface composition in the photocatalytic reaction.The high catalytic stability may be attributed to the outstanding structural stability of the samples.As shown in Fig. S12a andc, after the photocatalytic cycles, there is no obvious change in the TEM images of TiO 2 supported metal nanowire structures compared with the fresh one.Nevertheless, it was calculated that the GB density decreased by 9.9 and 6.3 for TiO 2 -Rh LWs and TiO 2 -Pd NWs samples respectively, based on the HRTEM images after the stability measurement (such as Fig. S12b andd), which gives a good explanation to the slight change in the catalytic activity after a few recycles."
  },
  {
    "title": "Conclusions",
    "content": "In summary, GB engineering was performed on the metal nanowire cocatalyst for enhanced photocatalytic performance in CO 2 reduction reaction.Rh and Pd nanowires with high density of GB were in situ grown on TiO 2 nanosheets to form semiconductor nanosheet supported metal nanowire cocatalyst hybrid structures.In comparison with the corresponding metal nanoparticles, the nanowire structure of metal realizes the charge flow between the interconnected nanoparticles and promotes the electron transfer from TiO 2 to cocatalysts.On the other hand, the GB terminations on the surface of metal nanowire cocatalysts act as highly active reaction sites for the CO 2 reduction reaction.As a result, in comparison with TiO 2 supported metal nanoparticles, the designed structure of GB enriched metal nanowires loaded by TiO 2 not only exhibits higher photocatalytic activity in the reduction of CO 2 to CO, CH 4 and C 2 H 5 OH, but also effectively reduces the formation of H 2 and increases the selectivity for CO 2 reduction.This work represents an important advancement towards GB engineering on cocatalysts for enhanced photocatalytic performance. Fig. 1.TEM and HRTEM images of (a-c) TiO2-Rh NPs, (d-f) TiO2-Rh SWs and (g-i) TiO2-Rh LWs. Fig. 2. XPS spectra of TiO2-Rh LWs: (a) survey spectrum, (b) Ti2p, (c) O1s and (d) Rh3d high-resolution spectra. Fig. 3. (a) UV-vis-NIR diffuse reflectance spectra of TiO2, TiO2-Rh NPs, TiO2-Rh SWs and TiO2-Rh LWs; (b) photocurrent vs. time (I-t) curves and (c) EIS Nyquist plots of TiO2, TiO2-Rh NPs, TiO2-Rh SWs and TiO2-Rh LWs at 0.4 V vs. Ag/AgCl under UV light ( 400 nm) irradiation; (d) PL spectra of TiO2, TiO2-Rh NPs, TiO2-Rh SWs and TiO2-Rh LWs excited at 310 nm. Fig. 4. Time-dependent (a) H2, (b) CO, (c) CH4 and (d) C2H5OH generated on bare TiO2, TiO2-Rh NPs, TiO2-Rh SWs and TiO2-Rh LWs in photocatalytic CO2 reduction reaction. Fig. 5. (a) TEM and (b) HRTEM images of A-TiO2-Rh LWs; (c) photocurrent vs. time (I-t) curves and (d) average production rate of H2, CO, CH4 and C2H5OH for A-TiO2-Rh LWs in comparison with TiO2-Rh LWs. Fig. 6.TEM and HRTEM images of (a-c) TiO2-Pd NPs and (d-f) TiO2-Pd NWs. Fig. 7. (a) UV-vis-NIR diffuse reflectance spectra of TiO2, TiO2-Pd NPs and TiO2-Pd NWs; (b) photocurrent vs. time (I-t) curves and (c) EIS Nyquist plots of TiO2, TiO2-Pd NPs and TiO2-Pd NWs at 0.4 V vs. Ag/AgCl under UV light ( 400 nm) irradiation; (d) PL spectra of TiO2, TiO2-Pd NPs and TiO2-Pd NWs excited at 310 nm. Fig. 8. Time-dependent (a) H2, (b) CO, (c) CH4 and (d) C2H5OH generated on bare TiO2, TiO2-Pd NPs and TiO2-Pd NWs in photocatalytic CO2 reduction reaction. Fig. 9. Stability studies of CO, CH4 and C2H5OH evolution rates as well as the selectivity for CO2 reduction over (a) TiO2-Rh LWs and (b) TiO2-Pd NWs in photocatalytic CO2 reduction reaction. This work was financially supported by National Natural Science Foundation of China (No. 21603191), Zhejiang Provincial Natural Science Foundation of China (No. LQ16B010001), Public Welfare Technology Application Research Plan Project of Zhejiang Province (Analysis Test Item, No. 2017C37024), and National Training Program of Innovation and Entrepreneurship for Undergraduates (No. 201610345014). Supplementary data associated with this article can be found, in the online version, at http://dx.doi.org/10.1016/j.apcatb.2017.01.035."
  }
]