[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2019.04.068"
  },
  {
    "title": "Article_Title",
    "content": "Sacrificing ionic liquid-assisted anchoring of carbonized polymer dots on perovskite-like PbBiO2Br for robust CO2 photoreduction"
  },
  {
    "title": "Abstract",
    "content": "The semiconductor-mediated solar-driven the conversion of CO 2 into the value-added fuels is considered as an ideal strategy for sustainable development.However, conventional semiconductors usually suffer from unsatisfactory photocatalytic performance due to the low efficiency of photo-induced carrier separation and sluggish interface adsorption/desorption equilibrium of reactants/products.Herein, novel carbonized polymer dots (CPDs)/PbBiO 2 Br heterojunction photocatalysts have been prepared via self-sacrificing ionic liquid, which not only act as the template and reactant to induce the formation of PbBiO 2 Br material, but also act as the glue to in situ anchor CPDs on the surface of PbBiO 2 Br material to form composites through hydrogen bond.Without sacrificial reagent, the obtained CPDs/PbBiO 2 Br materials synthesized with ionic liquid exhibit a high selectivity, stability and enhanced CO evolution rate in water.The introduction of CPDs not only effectively promote the light absorbance and separation efficiency of photogenerated electrons, but also adjust the adsorption/desorption equilibria of reactants/products on the CPDs/PbBiO 2 Br catalyst surface, such as boosting CO 2 adsorption capacity, proton affinity and CO liberation.The reaction mechanism has been proposed with in situ FT-IR spectrometry.The strategy for the preparation of high-performance CO 2 photoreduction catalysts can be extended to design and tune other advanced photocatalytic materials."
  },
  {
    "title": "Experimental",
    "content": "All of reagents are analytical grade and are used as received.The CPDs solid was prepared based on the reported literature and then handled by freeze-drying 40.5 mmol citric acid and 335 L ethylenediamine were dissolved into 10 mL deionized water.After being stirred for 30 min, the mixed solution was added into 25 mL Teflonlined autoclave and subsequently heated at 200 C for 5 h.After the autoclaves cool down to room temperature, the acquired product was subjected to dialysis for 24 h in order to obtain the CPDs solution.The CPDs solution was further freeze-dried to obtain CPDs solid. In a typical procedure of pure PbBiO 2 Br and CPDs/PbBiO 2 Br materials, 1 mmol Bi(NO 3 ) 3 5H 2 O, 1 mmol Pb(NO 3 ) 2 and x g CPDs were dissolved into 10 mL acetic acid aqueous solution, which defined as solution A. 1 mmol ionic liquid C 16 mimBr was dissolved into 10 mL ethanol to obtain solution B. Then solution B was dropwise added into solution A with stirring continuously.After stirring for 30 min, the mixed solution was poured into 25 mL Teflon-lined autoclave and subsequently heated at 180 C for 24 h.After autoclave cool to room temperature, the precipitate was collected and washed with ethanol and deionized water for several times.The final products were dried at 60 C for 12 h.The added contents of CPDs in CPDs/PbBiO 2 Br materials were 1, 3, 5, and 8 wt , respectively.Pure PbBiO 2 Br was prepared without adding CPDs. For comparison, PbBiO 2 Br-KBr and CPDs/PbBiO 2 Br-KBr were prepared via similar methods, merely replacing C 16 mimBr by KBr. The powder X-ray diffraction (XRD) pattern is measured on a Shimadzu XRD-6000X-ray diffractometer with monochromatized Cu-K radiation ( 0.15418 nm).The X-ray photoelectron spectroscopy (XPS) measured on a PHI5300 with a monochromatic Mg K source.The Fourier transform spectrophotometer (FT-IR, Nexus 470, Thermo Electron Corporation) is analyzed using the standard KBr disk method.The morphology of the samples is investigated by scanning electron microscope (SEM) (JEOL JSM-7001 F) and transmission electron microscopy (TEM) (JEOL-JEM-2010) equip with an energy dispersive Xray spectroscope.The specific surface area and particle size of the photocatalysts are obtained via Brunauer-Emmett-Teller (BET) method based on the N 2 adsorption-desorption isotherms (Micromeritics Instrument Corporarion, USA).CO 2 adsorption isotherms measurements for the samples are carried out a CO 2 adsorption apparatus (Micromeritics Instrument Corporarion, USA).The UV-vis spectra is detected by UV-vis spectrometer on an UV-2450 spectrophotometer (Shimadzu Corporation, Japan) with BaSO 4 powder as the reference.The photoluminescence spectra analysis (PL) is detected by a Varian Cary Eclipse spectrometer.The in-situ FT-IR spectra were obtained using in-situ diffuse reflectance infrared Fourier transform spectroscopy (Thermo fisher Nicolet iZ10, USA).Zeta potential measurements were conducted with a Brookhaven Instruments Zeta Potential Analyzer.The photocurrent is measured in phosphate buffer solution (0.1 M PBS, pH 7.0).The electrochemical impedance spectroscopy (EIS) is tested in a 0.1 M KCl solution containing 5 mM Fe(CN) 6 3-/Fe(CN) 6 4-.The photocurrent and EIS testing results are recorded with the CHI 760E electrochemical system.The Mott-Schottky plots is measured in 0.1 M KCl solution, which is recorded with the Zahner Zennium CIMPS system based on an IM6x electrochemical workstation.The fluorescence life time spectra were recorded on a spectrophotometer (FS5, Edinburgh Instruments Ltd.).Decay curves were analyzed at the emission of 468 nm in prepared materials under 360 nm excitation.The decay curves for samples can be fitted based on the following formula: , where N is a number of discrete emissive species, B is a baseline correction, Ai and i are pre-exponential factors. For multi-exponential decays, the average lifetime, , can be formulated as: where ai is the contribution of the decay component. Typically, 100 mg of photocatalyst and 100 mL of H 2 O are added into a reactor made of quartz glass (Perfect Light Company, Beijing, China).Then, high purity CO 2 was introduced into the reactor.A xenon (Xe) lamp (300 W, PLS-SXE 300C (BF), Perfectlight, China) was used as light source to trigger the photocatalytic reaction.The reaction temperature was kept at 10 C by a low-temperature thermostat bath system.After each reaction, the gas products were analyzed using a gas chromatography (Shanghai KeChuang Chromatograph Instruments Co., Itd.GC-2002) equipped with a FID detector and a capillary column.The isotope labeling was carried out using 13 CO 2 as carbon source, and 13 CO was identified by gas chromatography-mass spectrometry (Agilent 6890 N/5973I, Agilent Corp., USA)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The CPDs material is prepared based on reported literature from citric acid by the hydrothermal process (Fig. S1) 40.The CPDs/ PbBiO 2 Br composite photocatalysts have been synthesized via self-sacrificing ionic liquid glue C 16 mimBr assisted solvothermal process (Fig. 1a).The 0D CPDs are evenly distributed on the surface of 3D flower like PbBiO 2 Br material constructed by ultrathin nanosheets.The XRD analysis indicates all characteristic peaks be assigned to the tetragonal PbBiO 2 Br (JCPDS card no.38-1008) (Figs.S2a andS3a).But the typical diffraction peaks of CPDs cannot be found in the XRD pattern.The similar phenomena have also appeared in other previous literatures 41,42.In FT-IR spectra (Figs.S2b andS3b), the absorption bands at 1462 cm -1 , 1532 cm -1 and 1575 cm -1 are observed at CPDs/PbBiO 2 Br samples which belongs to typical stretching modes of -COO-, CO and NeH, respectively 43.The FT-IR analysis can signify the existence of CPDs in CPDs/PbBiO 2 Br material, which is further shown by corresponding Raman spectra (Fig. S4), XPS spectra (Fig. S5) and EDS analysis (Figs. S9b andS11). SEM and TEM images of pure PbBiO 2 Br exhibit 2D ultrathin nanosheets structure (Fig. S6), which are similar with PbBiO 2 Br-KBr (Fig. S7a-b).Afte 0D CPDs are introduced, the CPDs with abundant surface functional groups can act as nucleation sites, which induce assembly of 2D PbBiO 2 Br nanosheets to 3D porous flower-like structure (Fig. 1b-c) (Figs.S7c-d, S8 and S10).From Figs.S9a andS10b, it can be found that numerous dark dots are dispersed on nanosheets, which signifies 0D CPDs have been introduced to PbBiO 2 Br uniformly.However, the loading amount of the CPDs in 5 wt CPDs/PbBiO 2 Br-KBr is obviously less than that of 5 wt CPDs/PbBiO 2 Br.The EDS analysis indicate that CPDs content is about 4.9 wt and 4.0 wt in 5 wt CPDs/PbBiO 2 Br and 5 wt CPDs/PbBiO 2 Br-KBr materials, respectively.This demonstrate that more CPDs can be anchored on PbBiO 2 Br surface using ionic liquids as reaction source when the same CPDs are introduced.This is attributable to the hydrogen bonds formed between the hydrogen atoms at the position 2 in imidazolum ring of ionic liquids and act on the surface carboxyl groups of CPDs 44.In the HRTEM image (Fig. 1d), the lattice fringe spacing of 0.21 nm and 0.28 nm are in accordance with the (100) crystal plane of CPDs and the (110) crystallographic planes of PbBiO 2 Br crystallites, respectively 45.These two crystal plane of CPDs and PbBiO 2 Br have tight mutual contaction, which prove that CPDs/PbBiO 2 Br heterojunction composite photocatalysts have been prepared successfully, and the CPDs and PbBiO 2 Br crystallites have constructed excellent combination. As shown in Figs.1e and Fig. S12, the BET specific surface area and porosity size increase gradually with the enhanced amount of CPDs, which can be conducive to adsorb more CO 2 on the surface of the photocatalysts 46.The result of surface area and pore diameter distribution analysis are consistent with SEM and TEM analysis.The UV-vis diffuse reflection spectra reveal that the absorption onset of CPDs is about 1400 nm (Fig. S15a), and the absorption edge of CPDs/ PbBiO 2 Br is gradually red-shifted with increasing CPDs amount comparison with pure PbBiO 2 Br (Fig. 1f).The (E photon ) 1/2 vs E photon curves of pure PbBiO 2 Br and CPDs sample calculated by the classical Tauc approach (Figs.S13 andS15b).The band gap energy (E g ) of the PbBiO 2 Br and CPDs materials are determined to be nearly 2.17 and 0.67 eV, respectively.The total density of states of valence band (VB) can be determined in valence-band XPS spectra with the Fermi level (E f ) of semiconductors is 0 eV (Figs.S14 andS15c).The VB of CPDs is about 0.64 eV.The VB of both pure PbBiO 2 Br and 5 wt CPDs/ PbBiO 2 Br are 1.62 eV, which indicate the electronic density of states of PbBiO 2 Br cannot be affected after CPDs modified PbBiO 2 Br materials. The positive slopes of Mott-Schotty plots demonstrate both PbBiO 2 Br and CPDs are n-type semiconductor characteristics (Figs.1g andS15d).According to the extrapolation of X intercept in the Mott-Schotty curves, the flat band potential of PbBiO 2 Br and CPDs are ca.-0.75 and -1.20 V vs NHE (pH 7), respectively.As for the n-type semiconductors, the Fermi level is close to flat band potential 47.Therefore, the VB of PbBiO 2 Br and CPDs are 0.87 and -0.56 V vs NHE, respectively.Based on the formula E CB E VB -E g , the CB minimum of PbBiO 2 Br and CPDs materials occur at about -1.30 and -1.23 V vs NHE, respectively, which confirms the suitable redox potentials of PbBiO 2 Br and CPDs to drive CO 2 reduction reaction 48. The CO 2 photoreduction experiments are carried out in water without sacrificial reagent in the temperature about 10 C under a 300 W Xe lamp, and predominant reaction product analyzed by gas chromatography is CO.As shown in Fig. 2a, pure PbBiO 2 Br exhibits the weakest CO yield, and the performance of x wt CPDs/PbBiO 2 Br (x 1-5) for CO 2 reduction increase first, then decrease along with loading content of 8 wt CPDs, which is similar with other photocatalytic systems 37,38.This indicates that the introduction of excess CPDs will inhibit photocatalytic activity of the PbBiO 2 Br catalyst.After six hours of illumination, the CO production rates of 5 wt CPDs/ PbBiO 2 Br (8.28 mol h -1 g -1 ) hybrid is 6.68-fold enhancement compared to original PbBiO 2 Br (1.24 mol h -1 g -1 ) (Fig. 2b).Meanwhile, the CO evolution rate of 5 wt CPDs/PbBiO 2 Br-KBr is greatly lower than that of 5 wt CPDs/PbBiO 2 Br (Fig. S16).The effective bonding ability between CPDs and PbBiO 2 Br lead to the 5 wt CPDs/PbBiO 2 Br shows the strongest visible light absorbability (Fig. S17a), the lowest PL intensity (Fig. S17b), the highest photocurrent strength (Fig. S17c) and the minimum impedance value (Fig. S17d).All these test results certify that the separation efficiency of photogenerated carriers of 5 wt CPDs/PbBiO 2 Br is higher than that of 5 wt CPDs/PbBiO 2 Br-KBr.The introduction of self-sacrificing ionic liquid glue plays an important role in this system.Moreover, compared with the WO 3 -based, TiO 2based, ZnO-based and other Bi-based photocatalysts, the CPDs/ PbBiO 2 Br sample exhibit good photocatalytic CO 2 conversion performance (Table S1). Control experiments demonstrate that the CO 2 photoreduction performance of the physical mixture (PbBiO 2 Br and 5 wt CPDs) is lower than that of 5 wt CPDs/PbBiO 2 Br composite photocatalyst (Fig. 2c, column 2), which indicate that the importance of intimate interfacial contact and strong interactions in the heterostructures between CPDs and PbBiO 2 Br for the catalytic reaction 49.During the CO 2 reduction reaction process, if no light irradiation or photocatalyst are provided, there will be no CO generation (Fig. 2c, column 3 and 4), which suggest the specific photocatalytic reaction nature 10.In addition, no obvious CO 2 -to-CO conversion reaction is detected without CO 2 or using Ar as the reaction gas, indicating that CO product originates from splitting of CO 2 molecules (Fig. 2c, column 5 and 6) 50.Moreover, the 13 C isotope labelling experiment is performed over 5 wt CPDs/PbBiO 2 Br material using 13 CO 2 as substrate to explore carbon source of the evolved CO.As shown in Fig. 2d, the peak at m/z 29 in the mass spectra can be assigned to 13 CO, which provides strong evidence that the produced CO originates from the photocatalytic reduction of CO 2 molecules.In the Fig. 2e, the wavelength-dependent CO 2 photoreduction reactions for 5 wt CPDs/PbBiO 2 Br has been explored, revealing the trend of CO evolution corresponds well with the optical absorption spectrum of the CPDs/PbBiO 2 Br material 49,51.It can indicate the excellent CO 2 photoreduction performance actually induced by the light excitation CPDs/PbBiO 2 Br composite photocatalyst.The stability of 5 wt CPDs/PbBiO 2 Br composite material has been investigated by four consecutive runs with each run of 4 h under irradiation (Fig. 2f).It can been found that the 5 wt CPDs/PbBiO 2 Br hybrid exhibits good stabilization and light resistance with the potential for long-term photocatalytic applications.Fig. S18 show the characterization of 5 wt CPDs/PbBiO 2 Br materials after stability testing.After four consecutive runs, the color of catalyst did not change significantly from the digital photographs (Fig. S18a).Meanwhile, the invariable XRD patterns of the 5 wt CPDs/PbBiO 2 Br materials before and after the cycling photocatalytic experiments could further confirm the stability of composite photocatalysts (Fig. S18b).In Fig. S18c-d, the 5 wt CPDs/PbBiO 2 Br maintains its original microscopic morphology with a porous sphere-like structure after CO 2 photoreduction stability test.All these tests can effectively demonstrate that the 5 wt CPDs/PbBiO 2 Br catalyst possesses superior durability. To clarify the role of CPDs on enhancing CO 2 photoreduction efficiency of CPDs/PbBiO 2 Br heterojunction photocatalyst, the photoluminescence and photoelectrochemical characterizations are further conducted.As shown in Fig. 3a, the decay curves could be fitted well with a tri-exponential function and the calculated average lifetime values were 5.4 ns for PbBiO 2 Br and 8.1 ns for 5 wt CPDs/PbBiO 2 Br composite.Compared with pure PbBiO 2 Br, CPDs/PbBiO 2 Br photocatalyst exhibits increased the radiative lifetime of the charge carriers, which is attributable to the effective transfer of photoelectrons from the conduction band of PbBiO 2 Br to CPDs 52.Furthermore, the steadystate photoluminescence (PL) spectra clarifies that the PL intensity of the CPDs modified PbBiO 2 Br hybrid materials decreased to a lower level than that of the pristine PbBiO 2 Br (Fig. S19).The CPDs with conjugated structure loaded on the surface of PbBiO 2 Br nanosheet can provide an additional energy-transfer pathway in addition to the intrinsic radiative channel for excited-state electron transfer, thus effectively transfer electrons and inhibit the recombination of the photogenerated charge carriers 39.The electrochemical impedance spectroscopy (EIS) is further carried out to insight the charge-transport behaviors of these two samples, and the result is shown in Fig. 3b.The diameter of Nyquist semicircle arc of 5 wt CPDs/PbBiO 2 Br/ITO electrode reveals is smaller than that of PbBiO 2 Br/ITO electrode at high frequencies, suggesting a lower charge-transfer resistance in the CPDs/ PbBiO 2 Br composite catalyst that permits fast transport and separation of photoinduced charges 53.Meanwhile, the transient photocurrent spectra with repeatable upon cycling light on and off demonstrates that CPDs/PbBiO 2 Br exhibits a higher photocurrent response compared with the pure PbBiO 2 Br (Fig. 3c), which manifests the promoted generation and transfer of photogenerated electron-hole pairs in CPDs/PbBiO 2 Br photocatalyst 54.All these PL and photoelectrochemical characterizations demonstrate that CPDs/PbBiO 2 Br photocatalyst can effectively promote generation, transport, and separation of photoinduced charges through the unique CPDs/PbBiO 2 Br heterojunction photocatalyst, thereby rendering the higher efficiency of CO 2 photoreduction performance.Moreover, during the CO 2 photoreduction process, the CO 2 adsorption capacity is also generally regarded as another prerequisite 55.As shown in Fig. 3d, 5 wt CPDs/PbBiO 2 Br hybrid photocatalyst exhibit a maximum CO 2 uptake of 1.28 cm 3 g -1 at 10 C under 1 atm, much higher than that of original PbBiO 2 Br material (0.62 cm 3 g -1 ), which indicate CPDs/PbBiO 2 Br composite possosses a pronounced advantage in CO 2 adsorption/concentration and suggests its great potential for CO 2 conversion catalysis.Furthermore, the zeta potential value of 5 wt CPDs/PbBiO 2 Br is measured to be -4.92mV when dispersed in deionized water as compared to that of 9.59 mV for pristine PbBiO 2 Br (Fig. S20).Because the electronegativity of oxygen is stronger than that of carbon, the carbon is partially positively charged.Therefore, the CPDs/PbBiO 2 Br with negative charged surface is conducive to binding carbon element in CO 2 molecules.In addition, it is widely accepted that water can be used as the proton source during the CO 2 photoreduction reaction, thus the close contact between photocatalyst and water will be beneficial to the CO 2 photoreduction activity.For this purpose, the static water contact-angle measurements have been examined (Fig. 3e), which display that 5 wt CPDs/PbBiO 2 Br presents a smaller contact angle of 110.8than that of the pure PbBiO 2 Br sample with a contact angle of 125.7.The smaller water contact angle demonstrates a higher surface hydrophilicity in favour of the surface electron more efficiently transfer to participate the following CO 2 photoreduction reactions 56,57.Moreover, the CO is the final product of the CO 2 photocatalytic reduction reaction, thus the CO desorption capacity also is a key factor to influence the whole CO 2 reduction processes.From the CO temperature-programmed desorption (TPD) measurements can be found that the lower CO onset desorption temperature and the higher amount of detected CO for the 5 wt CPDs/PbBiO 2 Br indicate the formed CO molecules can desorb from the surface more easily than that of the pure PbBiO 2 Br (Fig. 3f) 58.Consequently, all the above results powerfully illustrated that the CPDs modified PbBiO 2 Br heterostructure hybrid photocatalyst completely optimize the vital processes in CO 2 photoreduction reaction, including enhanced photoabsorption, separation and transport of photon-generated carriers, CO 2 adsorption, proton affinity and CO desorption, thus leading to the greatly promoted CO 2 photoreduction performances. In order to further investigate the CO 2 photoreduction process of the CPDs/PbBiO 2 Br, in situ Fourier-transform infrared spectroscopy (FT-IR) measurement is performed to gain an in-depth understanding (Fig. 4a). To clean the adsorbents on catalyst surface, 5 wt CPDs/PbBiO 2 Br material is first treated at 120 C under helium atmosphere.After temperature drops to room temperature, CO 2 and H 2 O vapor are introduced into the dark environment.When the adsorption desorption equilibrium is maintained, the background can be measured.Subsequently, the FT-IR spectrum will be collected at different light irradiation time.There are a series of IR peaks emerge with increasing irradiation time from 0 to 120 min.The absorption peaks at 1275 and 1583 cm -1 are assigned to the bidentate carbonate (b-CO where \"\" represents the corresponding adsorption state on the catalyst surface. Based on the above results, the CO 2 photoreduction reaction process diagram of CPDs/PbBiO 2 Br photocatalyst is proposed in Fig. 4b.Under the light irradiation, the electrons in VB of both PbBiO 2 Br and CPDs can be excited to their CB, then form the photogenerated electron-hole pairs.Compared with the CB of PbBiO 2 Br (E CB -1.30V), the CB of CPDs is slightly smaller than that of PbBiO 2 Br.Therefore, the photoelectrons of PbBiO 2 Br can transfer to the CB of CPDs, which contributes to the effective separation of photoinducded electron-hole pairs.The electron on CPDs will take part in the further process of CO 2 transformation to CO.The adsorbed CO 2 molecules interact with the surface protons will generate the COOH intermediate gradually, which can transform into CO via the further protonation process.In this photocatalytic system, the introduced CPDs play a crucial role, which act as the electron transfer and photocatalytic reaction centers, thus greatly improved the photocatalytic CO 2 photoreduction activity of CPDs modified PbBiO 2 Br."
  },
  {
    "title": "Conclusions",
    "content": "In summary, novel CPDs/PbBiO 2 Br heterogeneous composite photocatalysts have been synthesized in the presence of self-sacrificing ionic liquid glue via a facile solvothermal method.The introduction of ionic liquids as reaction source is conducive to anchoring more CPDs on the surface of the PbBiO 2 Br nanosheets with tight junctions.The CPDs/ PbBiO 2 Br materials exhibit improved photocatalytic CO 2 reduction activities under ight irradiation, which attributed to enhanced light capture capability, electron transfer and separation ability, CO 2 molecule adsorption, hydrophilia and CO desorption.In situ FTIR spectrometry analysis disclosed that formic acid is a major intermediate.The possible photocatalytic mechanisms have been proposed.This strategy can provide a valuable inspiration to develop other advanced CPDsbased composite photocatalyst materials. Fig. 1.(a) Illustration for the formation of CPDs/PbBiO 2 Br composite material.(b) SEM, (c) TEM and (d) HR-TEM images of 5 wt CPDs/PbBiO 2 Br materials.(e) Nitrogen adsorption-desorption isotherm and (f) UV-vis diffuse reflection spectra of the pure PbBiO 2 Br and CPDs/PbBiO 2 Br materials.(g) Mott-Schottky plots of the PbBiO 2 Br. Fig. 2. (a) Time courses of photocatalytic CO evolutions.(b) The CO production rates for six hours under light irradiation.(c) CO 2 reduction performance of the 5 wt CPDs/PbBiO 2 Br under various conditions.(d) mass spectra of 13 CO (m/z 29) produced over 5 wt CPDs/PbBiO 2 Br materials.(e) CO production of the 5 wt CPDs/PbBiO 2 Br under light irradiation with different wavelengths.(f) Cycling runs for the CO 2 photoreduction in the presence of 5 wt CPDs/PbBiO 2 Br materials. Fig. 3. (a) Time-resolved transient PL decay curve, (b) EIS spectra, (c) transient photocurrent spectra, (d) CO 2 adsorption isotherms, (e) static water contact-angle measurements, (f) CO TPD spectra of PbBiO 2 Br and 5 wt CPDs/PbBiO 2 Br. Fig. 4. (a) In situ FTIR spectra for the simulated solar-driven CO 2 reduction process on the 5 wt CPDs/PbBiO 2 Br.(b) Schematic of the separation and transfer of photogenerated charges in the CPDs/PbBiO 2 Br heterogeneous photocatalyst during CO 2 photoreduction process. This work was financially supported by the National Natural Science Foundation of China (No. 21676128, 21576123, 21476098), and Postgraduate Research Practice Innovation Program of Jiangsu Province (KYCX171792). Appendix A. Supplementary data Supplementary material related to this article can be found, in the online version, at doi:https://doi.org/10.1016/j.apcatb.2019.04.068."
  }
]