[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2020.119006"
  },
  {
    "title": "Article_Title",
    "content": "2D/2D/0D TiO2/C3N4/Ti3C2 MXene composite S-scheme photocatalyst with enhanced CO2 reduction activity"
  },
  {
    "title": "Abstract",
    "content": "Herein, two-dimensional (2D) TiO 2 mesoporous nanosheets with three to four C 3 N 4 layers grown in situ are employed to design a core-shell 2D/2D van der Waals heterojunction (TiO 2 /C 3 N 4 ).Edge-terminated zero-dimensional (0D) Ti 3 C 2 MXene quantum dots (TCQD) are subsequently integrated in the C 3 N 4 surface via electrostatic interactions.The constructed 2D/2D/0D TiO 2 /C 3 N 4 /Ti 3 C 2 composite heterojunction photocatalyst exhibits enhanced CO 2 reduction activity compared to TiO 2 , C 3 N 4 , TiO 2 /C 3 N 4 , C 3 N 4 /Ti 3 C 2 for CO and CH 4 production.A step-scheme (S-scheme) charge transfer mechanism operates for the prepared samples during CO 2 reduction, as authenticated by in situ X-ray photoelectron spectroscopy and electron paramagnetic resonance analysis.This study provides a paradigm of a rational structural design for regulating the number and type of heterointerfaces and further insights into the mechanism of multijunction photocatalysts."
  },
  {
    "title": "Experimental",
    "content": "Synthesis of 2D TiO 2 nanosheets with single-layered mesopores: 2D mesoporous TiO 2 (T) nanosheets were synthesized via hydrothermalinduced solvent-confined monomicelle self-assembly 33.The detailed steps are given in Supporting Information. Synthesis of mesoporous TiO 2 /C 3 N 4 core-shell nanosheets and TCQD-modified TiO 2 /C 3 N 4 nanosheets: Ultrathin C 3 N 4 coating was deposited onto the surface of TiO 2 nanosheets through the thermal condensation of urea, forming TiO 2 /C 3 N 4 core-shell nanosheets, which were denoted as T-CN.Subsequently, terminated TCQD were electrostatically assembled with the C 3 N 4 shell, producing the TiO 2 /C 3 N 4 / Ti 3 C 2 (T-CN-TC) composite.The process is described in Supporting Information. Synthesis of TCQD: Ti 3 AlC 2 bulk was selectively etched into Ti 3 C 2 MXene with HF (48 ) for 24 h 30.The obtained powder was washed with ultrapure water until its pH was close to 6 and then dried for storage.Then, 1 g of Ti 3 C 2 MXene was dispersed into 100 mL of dimethyl sulfoxide (DMSO) and then sonicated for 12 h in an N 2 -protected environment.The suspension was centrifuged and washed with ultrapure water three times to remove residual DMSO.Subsequently, the precipitant was redispersed in 100 mL of ultrapure water, and the pH of the mixture was adjusted to 9 with ammonia.After vigorous ultrasonication for 1 h, the mixer was transferred to a Teflon-lined autoclave and held at 100 C for 6 h.The Ti 3 C 2 MXene quantum dots solution was obtained after the resulting suspension was filtered with the membrane (200 nm) and stored prior to use, which was labeled as TCQD.The precipitate was denoted as Ti 3 C 2 bulk. The details of characterization are available in Supporting Information. CO 2 photoreduction experiments are described in detail in Supporting Information. Computational details are available in Supporting Information."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The overall synthesis process of the T-CN-TC hybrids is illustrated in Fig. 1a.This process involved the separate preparation of mesoporous TiO 2 /C 3 N 4 core-shell nanosheets and TCQD, followed by the Fig. 1.Schematic of the synthesis of ultrathin TCQD anchored TiO 2 /C 3 N 4 core-shell nanosheets. interfacial assembly of TCQD on TiO 2 /C 3 N 4 core-shell nanosheets.In brief, 2D TiO 2 nanosheets with single-layered mesopores were synthesized via hydrothermal-induced solvent-confined monomicelle self-assembly with the amphiphilic Pluronic triblock copolymer F127 as a bridging agent and glycerol as a specific structure-directing agent.The nanosheets were subsequently calcined for crystallization.Then, an ultrathin C 3 N 4 shell was deposited on the TiO 2 surface by using urea as a precursor via calcination based on the given pretreatment to ensure that urea molecules were already anchored and trapped by the mesoporous nanosheets.Water-soluble TCQD were obtained via a facile twostep approach.First, bulk layered Ti 3 C 2 MXene was synthesized by selectively etching Al layers from Ti 3 AlC 2 with hydrofluoric acid (HF) 34.Next, functionalized TCQD (terminated with eOH, eNH, O, eF) were obtained and passivated in ammonia solution through ultrasonication under a N 2 -protected atmosphere and a facial hydrothermal process.During the amino-hydrothermal treatment, ammonia reacts with epoxy groups to generate primary and secondary amine groups via nucleophilic substitution 35.This reaction was corroborated by the following analyses.With the assistance of a mechanical force, welldefined TCQD were produced through the bond scission of surrounding oxygen groups and the simultaneous direct bonding of amine groups with Ti 3 C 2 edges.T-CN-TC composites were successfully prepared by assembling TCQD on the C 3 N 4 surface via electrostatic interactions with the assistance of sonication and prolonged stirring because of the enriched termination of TCQD. Field-emission scanning electron microscopy (SEM), transmission electron microscopy (TEM), and atomic force microscope (AFM) observations were performed to characterize the microstructure and morphological characteristics of the samples.In Fig. 2a, slightly curved slices were stacked randomly and composed of tiny nanoparticles with uniform mesopores.Consistent with AFM analysis results, the TEM image (Fig. 2b) showed that the sizes of well-crystallized TiO 2 nanoparticles were 4-5 nm (Figs.3a,b).The average mesopore size was 4 nm, which was similar to the thickness of sheets.This result indicated that the 2D nanosheets are comprised of only a single mesoporous layer.The lattice spacing of 0.35 nm was assigned to the (1 0 1) crystal plane of anatase TiO 2 .The ultrathin C 3 N 4 coating was grown in situ on the surface of mesoporous TiO 2 nanosheets to construct sandwich-like core-shell 2D structures.In Fig. 2c, the deposition of C 3 N 4 partially masked the porous surfaces of TiO 2 nanosheets but did not obviously influence their overall morphology.The high-resolution TEM (HRTEM) image of TiO 2 /C 3 N 4 (Fig. 2d) showed that the seamless contact between TiO 2 and C 3 N 4 was conducive to the formation of a 2D/2D van der Waals heterojunction.Elemental mapping revealed the even and moderate coating of C 3 N 4 (Figs.2e-i).As confirmed by AFM analysis (Figs. 3c,d), the height profile of T-CN on a single AFM scan exhibited distinct height stages.The basic heights of 4.0 and 3.9 nm corresponded to the mean thickness of TiO 2 nanosheets with single-layered mesopores, whereas the heights of 1.0 and 0.9 nm were attributed to the C 3 N 4 thickness, which corresponded approximately to three molecular layers.Ultrathin C 3 N 4 was exfoliated from TiO 2 nanosheets because of ultrasonication in AFM sample preparation.The thickness of the C 3 N 4 deposit increased when the amount of urea increased (Fig. S1). The morphological characteristics, sizes, and microstructures of the andb).The lateral size of the TCQD was directly measured to be 3 nm (insert in Fig. 4a).The HRTEM image in the Fig. 4b insert showed that TCQD were well crystallized with a lattice spacing of 0.26 nm assigned to the (0110) facet of Ti 3 C 2 MXene.The UV-vis spectra (Fig. S4a) of the as-prepared TCQD displayed two characteristic absorption peaks at 260 and 320 nm 30; the TCQD also exhibited an excitation-dependent photoluminescence (PL) behavior because of size effects and surface defects 36 (Fig. S4b).The Fourier transform infrared (FTIR) spectra (Fig. S5) and Raman spectra (Fig. S6) of the as-prepared Ti 3 AlC 2 , Ti 3 C 2 MXene, Ti 3 C 2 bulk, and TCQD indicated that TCQD still maintained the structure of MXene. The randomly stacked nanosheets of T-CN-TC that formed cracked pieces after assembly are shown in Figs.4c,d The Raman spectra of the as-prepared samples are provided in Fig. 5b.In terms of T, T-CN, and T-CN-TC, several characteristic peaks assigned to E g (139 cm -1 ), B 1g (396 cm -1 ), A 1g (515 cm -1 ), and E g (638 cm -1 ) modes of anatase TiO 2 were observed and consistent with previously reported peaks 37.Given the strong fluorescence effect of C 3 N 4 , the Raman spectra of CN, T-CN, and T-CN-TC exhibited no obvious bands attributed to C 3 N 4 .For Ti 3 C 2 MXene, four typical bands located at ca. 148, 266, 405, and 604 cm -1 were ascribed to 1 , 2 , 3 , and 4 Raman-active phonon vibration modes 8.Notably, the 4 mode of TCQD in T-CN-TC was present and blue shifted compared with that of Ti 3 C 2 MXene, demonstrating the good maintenance and integration of TCQD in T-CN-TC. The FTIR spectra shown in Figs.5c andd further revealed the constituents of the samples.In particular, the broad band of T centered at 518 cm -1 was due to the special vibration of TiO 2 , whereas the weak band from 3300 cm -1 to 3600 cm -1 was assigned to the stretching and bending vibrations of physically adsorbed water.For the CN sample, the intense bands ranging from 1200 cm -1 to 1700 cm -1 were derived from the stretching vibration of C-N aromatic rings.Additionally, the sharp band at 811 cm -1 corresponded to the typical breathing mode of tri-s-triazine units.The broad band at 3000-3500 cm -1 originated from the amino and surface hydroxyl groups.The bands ascribed to TiO 2 and C 3 N 4 were present in the spectrum of T-CN.The stretching vibrations of TieC at 482 cm -1 , TieO at 576 cm -1 , TieF at 733 cm -1 , CeO at 1040 cm -1 , and C-F at 1111 cm -1 were identified for TCQD, suggesting the superior efficiency and safety of ammonia-mediated bond scission.Although the strong TieC bond was partially broken, the host Density functional theory calculations were adopted to directly evaluate work functions and charge densities and to further understand the interfacial charge separation and transfer of T-CN-TC.The calculated electrostatic potentials of the TiO 2 (101) surface, the C 3 N 4 (001) surface, and the Ti 3 C 2 (001) surface are shown in Fig. 7.The theoretical work functions of TiO 2 , C 3 N 4 , and TCQD were 6.87, 4.34, and 4.52 eV, respectively.The Fermi level of C 3 N 4 was higher than those of TiO 2 and TCQD.The difference in Fermi levels forced electrons to transfer from C 3 N 4 to TCQD and TiO 2 upon contact until they were aligned.As a result, interfacial built-in electric fields were formed directly from C 3 N 4 to TiO 2 and C 3 N 4 to TCQD.The three-dimensional charge density difference was also explored as depicted in Fig. S10, which was complementary to our results.The yellow and cyan regions mainly distributed around the TiO 2 /C 3 N 4 interface represent the accumulation and deficit of net electrons, respectively 40.Electrons were extracted from the surface of C 3 N 4 to TiO 2 .Bader charge analysis revealed that the amount of charge transfer was 0.057 e.This charge transfer resulted in the construction of an interfacial built-in electric field, which was helpful to the isolation of charge carriers and reactive sites.In addition, the built-in electric field markedly enhanced because of the in situ grown ultrathin 2D structure. Fig. 8 shows the nitrogen (N 2 ) physisorption isotherms and the pore size distribution curves (inset) of the obtained samples.All the N 2 adsorption-desorption isotherms were identified as a combination of types IV and II, suggesting the presence of mesopores and macropores.Moreover, the hysteresis loops did not exhibit any confining adsorption at high P/P 0 and were characteristics of the type H3 loop.This result implied that slit-shaped pores stemmed from the random stacking of nanosheets.The Barret-Joyner-Halenda pore-size distribution curves showed that all the samples displayed bimodal pore size distribution 41; that is, the smaller pores were centered at about 4 nm, which was consistent with TEM characterization.The presence of single-layered mesopores was favorable to mass diffusion/transfer and multiple light reflections, which could improve solar light harvesting.The obtained textural properties of the prepared samples are summarized in Table 1.S BET of T-CN-TC was similar to that of T-CN, but V pore and D pore of the former slightly increased and greatly exceeded those of T and CN.This enhancement was assigned to the improved dispersity of C 3 N 4 and TCQD and the re-creation of macropores.Thus, mass diffusion is facilitated in photocatalytic reactions. UV-vis diffuse reflectance spectroscopy was conducted to investigate the light absorption properties of the as-synthesized samples.As shown in Fig. S11a, the intrinsic absorption edge of CN was located at 433 nm, indicating its narrow bandgap of 2.86 eV 42.By contrast, pure TiO 2 exhibited inherent absorbance at approximately 407 nm in accordance with its bandgap of 3.05 eV 43,44.After the C 3 N 4 deposition, the light absorption of the T-CN composite enhanced in the visible-light range ( 400 nm).The absorbance edges of TiO 2 /C 3 N 4 slightly red shifted as the C 3 N 4 content increased (Fig. S11b).For T-CN-TC, the introduction of TCQD did not alter the absorption edge of T-CN, but the absorption slightly improved at ca. 400 nm. Time-resolved PL decay characterization was also carried out to further reveal the electron transfer dynamics.In Fig. 9a, the PL spectra of CN, T-CN, and T-CN-TC could be well fitted to the three-exponential model.The fitting parameters are summarized in Table 2.The short lifetime 1 was attributed to the radiative recombination of carriers, that is, the relaxation of electrons from the excited state to the ground state; recombination decrease suggests the high utilization of photoexcited electrons or holes 45.The long lifetimes 2 and 3 reflect the nonradiative transfer of charge carriers 46,47.The emission lifetimes ( 1 , 2 , 3 , and av ) of T-CN remarkably decreased compared with those of CN.T-CN-TC was characterized by the shortest 1 , 2 , 3 , and av lifetimes.The data corroborated that the constructed heterojunction between TiO 2 and C 3 N 4 distinctly suppressed photogenerated carrier recombination.Together with the heterostructure, the TCQD of T-CN-TC acted as an electron channel and provided effective transfer pathways for the accumulated photoexcited electrons. PL emission spectra were recorded (Fig. 9b) to explore the separation and migration tendency of the photogenerated carriers.The samples of CN, T-CN, and T-CN-TC exhibited similar emission spectra with a broad peak centered at 436 nm, which corresponded to the band gap transition of C 3 N 4 .Nevertheless, the intensity of T-CN luminescence was distinctly lower than that of CN, suggesting a lower probability of direct recombination of carriers due to the heterojunction between TiO 2 and C 3 N 4 .Furthermore, the PL intensity of T-CN-TC was considerably lower than that of T-CN.This results also supported the hypothesis on the effective funneling of photogenerated electrons to TCQD sites acting as electron sinks. The CO 2 photoreduction performance of the obtained samples was examined in an anaerobic environment under irradiation with a xenon lamp.The controlled experiments indicated that hydrocarbon signals were undetectable in the absence of either photocatalysts, CO 2 , or light.Fig. 10a presents the yields of the main photocatalytic products (CO and CH 4 ) of five samples after irradiation for 1 h.The yields of CH 3 OH and C 2 H 5 OH were too low to compare with those of CO and CH 4 and hence neglected.As presented, pure T and CN shared similar and low CO and CH 4 production rates, which were mainly due to the high recombination rates.After C 3 N 4 was deposited on TiO 2 nanosheets, the yield of CO of the optimized TiO 2 /C 3 N 4 composite increased to 3.14 mol g -1 h -1 , which was more than twice that of T and CN.CH 4 production also drastically increased.The results revealed the superiority of lowering the carrier recombination rate in the TiO 2 /C 3 N 4 heterojunction composite compared with those in individual components.Moreover, the ultrathin mesoporous nanosheet structure and the tight contact attributed to the in situ thermal condensation approach instead of the weakly adhered mechanical mixture favored the fast charge transfer across the heterointerface.Notably, the CO 2 reduction performance of the TiO 2 / C 3 N 4 samples fluctuated as the C 3 N 4 deposit thickened (Fig. S12).When the amount of urea was low, the thin and scattered C 3 N 4 layers limited the photocatalytic reduction efficiency.However, an excessive amount of urea resulted in the stacking of thick C 3 N 4 bulk, which shielded light from the TiO 2 /C 3 N 4 van der Waals heterostructure and hindered the bulk-to-surface charge transfer. The CO and CH 4 production rates of T-CN-TC reached the maxima of 4.39 and 1.20 mol g -1 h -1 , which were more than three and eight times higher than the production rates observed for T. In accordance with the previous analysis, the performance enhancement could be attributed to the following features.First, functional TCQD were favorable to the acceptance, transfer, and transport of photoinduced electrons from C 3 N 4 , whose cooperation with the TiO 2 /C 3 N 4 heterojunction collectively accelerated the spatial separation of charge carriers with a relatively strong redox ability, because of a low Fermi level and the intense physical and electronic coupling.The electron reservoir characteristic of TCQD was supported by the higher CO 2 reduction activity of CN-TC than that of pure CN (Fig. 10a).Second, the enriched termination groups of TCQD guaranteed the substantial surface catalytic and active sites for reduction reactions and increased the specific surface area 30,35.In addition, the collection of the photoexcited electrons on TCQD was beneficial to multielectron CO 2 reduction reactions. In situ diffuse reflectance infrared Fourier transform spectroscopy (DRIFTS) was conducted to identify the CO 2 adsorption and conversion of T-CN-TC (Fig. 11).Without the introduction of CO 2 and H 2 O, no absorption peaks were observed except for the stretching vibrations of CeN aromatic rings from 1200 cm -1 to 1800 cm -1 (line a).Initially, at 1413 and 1463 cm -1 ), and carboxylate (CO 2 -, 1670 cm -1 ).Upon illumination, new peaks associated with the reaction intermediates were observed (lines e-g).The peaks at 1566, 1730, 1855, and 1879 cm -1 were assigned to the generation of formate (HCOO-), whereas the peak at 1076 cm -1 was attributed to the stretching vibrations of methoxy group (CH 3 O).Moreover, the bands at 1128, 1506 and 1757 cm -1 belonged to the vibrations of formaldehyde (HCHO) 48.A non-polar CH 4 molecule is silent in infrared spectroscopy, so the typical peak of CH 4 was undetectable after irradiation 22,49.The results revealed that CO 2 adsorbed on the surface of T-CN-TC converted to a series of intermediate products during multielectron reduction under illumination. Transient photocurrent measurements were carried out to elucidate the charge excitation and separation within the studied samples.On the basis of a linear sweep voltammetry test, we determined the initial bias voltage of -0.2 V in the photocurrent response test.In Fig. 12a, the four samples exhibited stable and smooth photocurrents in four on-off cycles.Nevertheless, the transient photocurrent density of T-CN was stronger than those recorded for T and CN, proving the high separation efficiency of photoexcited carriers at the TiO 2 /C 3 N 4 interface.As predicted, the photocurrent density of T-CN-TC was higher than that of T-CN.This result further confirmed that the integration of TCQD favored the efficient transfer and utilization of the photogenerated electrons.Notably, T-CN, T, and CN behaved similarly when light was turned on and off.Upon irradiation, the three curves displayed anodic photocurrent spikes because of the spatial separation of the photoinduced electron-hole pairs at the interfaces of the electrode/electrolyte 50,51.Upon switching off the light, the photocurrents decreased steeply to 0. Interestingly, in contrast to the photocurrent curves of the three other samples, the photocurrent curve of T-CN-TC increased gradually when the light was turned on and decreased smoothly when the light was turned off.This phenomenon was attributed to the excellent charge drawing and transporting ability of TCQD with a low Fermi level and abundant functional groups 5,52. Electrochemical impedance spectra (EIS) characterization was conducted to assess electron transfer capability.In Fig. 12b, the Nyquist plot of T-CN-TC exhibited a relatively smaller semicircle radius than those of the other samples; this difference demonstrated the low charge transfer resistance and thus high separation and transfer efficiencies of photoexcited carriers 53,54. The band structures of T and CN were investigated to analyze the photocatalytic mechanism.As displayed in Figs.13a andb, the positive slopes derived from the Mott-Schottky (MS) plots of T and CN indicated the typical characteristics of n-type semiconductors 55.The extrapolated flat band potentials of T and CN were -0.19 and -0.85 V (vs NHE, pH 0), respectively.Generally, the CB edge potentials of n-type semiconductor oxides are more negative by approximately -0.1 V to -0.3 V than the corresponding flat band potentials because of the absence of the exact doping concentration 56,57.Given this analysis, the CB edge potentials of T and CN were approximately -0.39 and -1.05 V (vs NHE, pH 0), respectively.Thus, the valence band (VB) potentials of T and CN were 2.66 and 1.81 V based on their band gap energies originating from the UV-vis spectra, respectively.Hence, the band structures of T, CN, and TCQD are summarized in Fig. 13c. Electron paramagnetic resonance (EPR) analysis was conducted to monitor hydroxyl radical (OH) generation during photocatalytic reactions.In an aqueous solution, 5,5-dimethyl-L-pyrroline N-oxide (DMPO) can capture OH and generate DMPO-OH adducts under irradiation; these adducts can be easily detected by EPR apparatus 58,59.As shown in Fig. 13d The formation of the S-scheme heterostructure and the charge transfer across dual heterointerfaces upon irradiation over T-CN-TC are illustrated in Fig. 14.XPS and work function analyses revealed that the Fermi level of CN was higher than those of T and TCQD (Fig. 14a).Upon contact, the electrons tended to migrate spontaneously from CN to T and TCQD until their Fermi levels reached equilibrium.The charge redistribution resulted in the bending of the band edge and the formation of an internal electric field (IEF) at the interfaces of T/CN and CN/TCQD (Fig. 14b) 62,63.Under simulated solar irradiation, electrons were excited individually from the VB to the CB of T and CN.With IEF, band bending, and Coulomb force, the photoinduced electrons in the CB of T preferred to recombine with the holes in the VB of CN.Relatively useful electrons in the CB of CN were prone to migrating to conductive TCQD driven by potential difference.The process expedited the spatial separation and extraction of photoexcited carriers with a superior redox capacity, and the accumulated electrons on the TCQD surface were advantageous for multielectron CO 2 reduction 646566. In situ XPS characterization was conducted under light irradiation to directly authenticate the charge migration pathway.As depicted in Figs.6a andb S9d) belonging to TCQD negatively shifted under irradiation.Together with energy band configuration, the result illustrated that upon excitation TCQD could draw electrons from CN and act as an electron sink.Therefore, the charge transfer mechanism was well evidenced."
  },
  {
    "title": "Conclusions",
    "content": "In a nutshell, a unique 2D van der Waals heterostructure, TCQD decorated TiO 2 /C 3 N 4 core-shell nanosheets with a good dispersion, are constructed via interfacial self-assembly.CO and CH 4 yields resulting from the CO 2 photoreduction in the presence of T-CN-TC exceed the yields offered by T or CN by three and eight times, respectively.Experimental and theoretical results reveal that the constructed dualheterojunctions (the S-scheme heterojunction at the TiO 2/ C 3 N 4 interface and the Schottky heterojunction at the C 3 N 4 /TCQD interface) play major roles in the enhanced photocatalytic activity and jointly expedite the separation, migration, and utilization of photogenerated charge carriers with strong redox capacities.The edge modification of TCQD with amine groups favors intimate coupling with C 3 N 4 , improves catalytic reactivity, and provides additional surface reaction active sites.The ultrathin 2D-2D van der Waals structure of TiO 2 /C 3 N 4 provides a large contact interface and short electron transfer routes.This work elucidates the elaborate design and provides a strong proof supporting multijunction photocatalysts.Such a multijunction design protocol is anticipated to be extended to the fabrication of other photocatalysts.TCQD also act as an electron sink that can be used as a potential cocatalyst in photocatalysis. All authors (Fei He, Bicheng Zhu, Bei Cheng, Jiaguo Yu, Wingkei Ho, and Wojciech Macyk) declare that no competing financial interests or personal relationships influence the work reported in this manuscript (TiO 2 /C 3 N 4 /Ti 3 C 2 composite nanosheet S-scheme heterojunctions with an enhanced photocatalytic CO 2 reduction activity). Fig. 2. SEM and TEM images of (a, b) T, (c, d) T-CN; (e-i) elemental mappings of Ti, O, C, and N of the selected area. . As shown by the TEM image (Fig. 4e), TCQD were uniformly immobilized on C 3 N 4 /TiO 2 shell-core nanosheets with an intimate contact.The HRTEM image (Fig. 4f) exhibited typical C 3 N 4 and clear lattice fringes with d-spacings of 0.26 and 0.35 nm, corresponding to the (0110) plane of TCQD and the (1 0 1) plane of TiO 2 , respectively.These results provided evidence for the successful construction of TCQD that were closely attached to the TiO 2 /C 3 N 4 core-shell structure through strong interfacial van der Waals interactions.X-ray diffraction (XRD), Raman, and FTIR spectra were collected to verify the crystal structure of the as-synthesized samples.The XRD patterns of T, CN, T-CN, T-CN-TC, and T-CN4 are presented in Fig. 5a.The well-defined diffraction peaks of T corresponded to anatase TiO 2 (JCPDS file No. 21-1272) and rutile TiO 2 (JCPDS file No. 21-1276) 14.In the case of T-CN and T-CN-TC, the weak diffraction peaks of the ultrathin C 3 N 4 layer were covered with the strong diffraction peaks of TiO 2 4.The XRD pattern of T-CN4 was acquired to further confirm the structure of the C 3 N 4 -capped TiO 2 nanosheets.The characteristic graphite structure of g-C 3 N 4 can be distinguished by peaks at 27.7and 13.Notably, no diffraction peaks of TCQD were observed in T-CN-TC because of the low content of TCQD and the high dispersity. Fig. 3. AFM images and height cutaway views of (a, b) T and (c, d) T-CN. Fig. 4. (a,b) TEM images of TCQD; insert in (a) shows the lateral size distribution of TCQD; insert in (b) shows the HRTEM image; (c,d) SEM, (e) TEM, and (f) HRTEM images of T-CN-TC; and insert in (e) is a magnified region. Fig. 5. XRD, Raman, and FTIR spectra of the as-prepared samples. Fig. 7. Electrostatic potentials of TiO 2 (101) surface, C 3 N 4 (001) surface, and Ti 3 C 2 (001) surface along the Z-axis direction.E F and E V refer to the Fermi level and the vacuum energy level, respectively.(For interpretation of the references to colour in this figure legend, the reader is referred to the web version of this article). Fig. 8. N 2 physisorption isotherms and corresponding pore size distribution curves (inset) of T, CN, T-CN, and T-CN-TC. Fig. 9. Time-resolved PL (a) and PL (b) spectra of the samples. under the adsorption condition (lines b-d), the molecules adsorbed onto the sample, resulting in the formation of bidentate carbonate (b-CO 3 2-, at 1307 and 1607 cm -1 ), monodentate carbonate (m-CO 3 2- Fig. 10.(a) Photocatalytic CO 2 reduction performance of the prepared samples after irradiation for 1 h and (b) the stability test of CO 2 reduction over T-CN-TC. Fig. 11.In situ DRIFTS spectra of T-CN-TC: (a) without the introduction of CO 2 /H 2 O in the dark; (b-d) in the presence of CO 2/ H 2 O for 20, 40, and 60 min in the dark; and (e-g) under irradiation for 20, 40, and 60 min. , the strongest DMPO-OH signal was observed for T, because of the strong oxidation potential of the photoexcited holes in the VB of TiO 2 .Considering that the VB edge of C 3 N 4 (1.81 V) was higher than the redox potential of H 2 O/OH (2.37 V) or OH -/OH (1.99 V) 60,61, the holes in the VB of C 3 N 4 could not directly oxidize H 2 O or OH -into OH.However, as shown in Fig. 13d, pure C 3 N 4 exhibited a weak and unnoticeable EPR signal, which resulted from O 2 transformation to hydroxyl radicals (Eqs.1-3).Additionally, the strong DMPO-OH signals recorded in the presence of T-CN and T-CN-TC indicated that holes efficiently remained in the VB of TiO 2 after excitation instead of migrating to the VB of C 3 N 4 or recombining with photoexcited electrons.This phenomenon indicated that the charge transfer between TiO 2 and C 3 N 4 did not comply with the conventional type II mechanism.Alternatively, the novel S-scheme heterojunction mechanism could well explain the enhanced CO 2 reduction property of T-CN-TC. e Fig. 12.(a) Transient photocurrent response and (b) EIS spectra of T, CN, T-CN, and T-CN-TC. Fig. 13.MS plots of (a) T and (b) CN; (c) band structures of T, CN, and TCQD; and (d) EPR spectra of DMPO-OH in an aqueous dispersion of T, CN, T-CN, and T-CN-TC under 120 s of irradiation. , the BEs of Ti 2p and O 1s of T-CN shifted positively by 0.1-0.2eV upon irradiation.Conversely, the N 1s and C 1s XPS peaks of T-CN after illumination (Figs.6c and d) shifted drastically toward a low value.The shifts consistently revealed the electron depletion of T and the accumulation of CN under illumination.Intriguingly, with regard to T-CN-TC, the NeH peak of N 1s (402.2 eV) (Fig. Writing -original draft.Bicheng Zhu: Software.Bei Cheng: Project administration.Jiaguo Yu: Conceptualization, Data curation, Formal analysis, Funding acquisition.Wingkei Ho: Writing -review editing.Wojciech Macyk: Writing -review editing, Funding acquisition. Fig. 14.The S-scheme heterojunction of TiO 2 /C 3 N 4 /Ti 3 C 2 quantum dots: (a) before contact, (b) after contact, and (c) after contact upon irradiation and charge migration and separation. BET specific surface area (S BET ), pore volume (V pore ), and average pore diameter (D pore ) of the prepared samples. Calculated PL decay lifetimes and the corresponding magnitude factors determined from a three-exponential model. This work was supported by NSFC (51961135303, 51932007, U1905215, 21871217, and U1705251), the National Key Research and Development Program of China (2018YFB1502001), and the National Postdoctoral Program for Innovative Talents (BX20180231) and Innovative Research Funds of SKLWUT (2017-ZD-4).WM thanks the National Science Center, Poland, for the support within the grant no.2018/30/Q/ST5/00776. Supplementary material related to this article can be found, in the online version, at doi:https://doi.org/10.1016/j.apcatb.2020.119006."
  }
]