[
  {
    "title": "Doi",
    "content": "10.1016/j.jallcom.2021.159045"
  },
  {
    "title": "Article_Title",
    "content": "Self-assembled g-C3N4 nanotubes/graphdiyne composite with enhanced photocatalytic CO2 reduction"
  },
  {
    "title": "Abstract",
    "content": "In this work, g-C 3 N 4 nanotubes (CNtb) with sheet-like graphdiyne (GDY) composite are successfully prepared through a simple self-assembly method.The composite is proved to significantly improve the separation efficiency of photogenerated carriers and the conductivity of the material, which consequently leads to enhanced performance towards photocatalytic CO 2 reduction.For the composite, the yields for CO and CH 4 are increased by 18-20 times, compared with pure CNtb.This work provides a new idea for the preparation of efficient g-C 3 N 4 photocatalysts in the future."
  },
  {
    "title": "Experimental",
    "content": "The preparation of g-C 3 N 4 nanotubes is based on a published literature with some modification 40.All of the reagents were used without further treatment.In a typical preparation process, 4 g of melamine was dispersed in 80 mL of deionized water under vigorously stirring for 2 h.After that, the mixture was transferred to a 100 mL Teflon lined autoclave and kept at 200 C for 12 h.The white precursor was washed several times with deionized water and dried in air at 60 C.Subsequently, the precursor was placed in a crucible, heated to 550 C at a rate of 2 C/min in air and kept for 4 h to obtain the sample. The graphdiyne is obtained from Changshui Huang's group, Qingdao Institute of Biomass Energy and Bioprocess Technology, Chinese Academy of Sciences.The g-C 3 N 4 nanotubes/graphdiyne composite is obtained through a simple self-assemble process under ultrasonication.In brief, a certain amount of GDY was dispersed in 40 mL of N-methylpyrrolidone, and then exposed to ultrasonic irradiation for 30 min, which was named as solution A. A certain amount of CNtb was dispersed in 20 mL of N-methylpyrrolidone, ultrasonically dispersed for 30 min, and named as solution B; Solution B was added dropwise to solution A under stirring.The mixed solution was first further exposed to ultrasonic irradiation for 8 h, and then continuously mechanical stirring at 50 C for 12 h.The obtained sample was washed several times with deionized water and ethanol, and finally dried under vacuum at 60 C overnight.The obtained sample is named GDYCNtb-x, where x represents the mass ratio of GDY to CNtb. The X-ray diffraction pattern (XRD) of the synthesized sample was determined by an X-ray powder diffractometer with Cu-K Xray radiation (XRD Bruker AXS D8), and the diffraction angle range was 10-90.The microscopic morphology was measured by the field emission scanning electron microscope (Hitachi S-4800) and the field emission transmission electron microscope (JEM-2100F).UV-vis diffuse reflection absorption (DRS) is measured by Shimadzu UV-2600 spectrophotometer equipped with an integrating sphere using BaSO 4 as the reference.The photoluminescence spectra (PL) are obtained by fluorescence spectrometer (FLS-980).The Brunauer-Emmett-Teller (BET) surface areas of the samples were measured by a Micromeritics ASAP Kubo X1000 analyzer at liquid nitrogen temperature.The X-ray photoelectron spectra (XPS) were obtained by the ThermoFisher ESCALAB 250 spectrometer.Fourier transform infrared (FT-IR) spectra was performed on a NEXUS 670 spectrometer, the scanning range is 400-4000 cm -1 .The surface potential of the samples was determined by measuring the Zeta potential (Zetasizer Nano ZS ZEN3600). The photoelectrochemical properties of the samples were investigated using an electrochemical workstation (CHI660E C18532, Chen Hua Instrument Co., Ltd.Shanghai), with platinum wire and Ag/AgCl (in saturated KCl) as the counter electrode and reference electrode, respectively, and phosphate buffer solution as the electrolyte.Usually, 1 mg of sample powder is dispersed into 1 mL of isopropanol solution, 10 L of Nafion solution is added, and then the mixture is sonicated for 3 h.50 L of above mixed solution was dripcoated onto a 1 1 cm FTO sheet, and form a working electrode after drying.The photocurrent test was performed at a constant voltage of 0.7 V, and the impedance test was performed at a voltage of 0 V. The experiment was carried out in an 80 mL closed quartz reactor.Generally, 20 mg catalyst was placed in the reactor, 100 L of deionized water was added, and the mixture of catalyst powder and water was stirred to spread the powder evenly onto the bottom of the reactor in order to maximize the interaction area with CO 2 .Then, the reactor was purged with CO 2 for 30 min to remove the other gases.After that, the reaction was carried out under the irradiation of a 300 W Xe lamp equipped with a 420 nm filter.0.5 mL of gas was extracted from the reactor every 1 h.CO and CH 4 were measured by a GC-7920 gas chromatograph (equipped with FID detector and N 2 as carrier gas), and H 2 was measured by a GC-7806 gas chromatograph (equipped with TCD detector and Ar as carrier gas)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The crystal structures of all the samples are first characterized by X-ray diffraction analysis (XRD), as shown in Fig. 1a.It can be seen that the diffraction peaks at 13.1 and 27.4 belong to the (100) and (002) planes of pure CNtb, which correspond to the in-plane structure stacking and interlayer stacking of aromatic systems, respectively 40.Moreover, GDY displays a broad diffraction peak at 21.3 47.The XRD patterns of GDYCNtb retains the characteristic peaks of CNtb, suggesting that the addition of GDY does not damage the crystal structure of CNtb.Due to the poor crystallinity and low content in the composite, the diffraction peak of GDY cannot be detected.Nevertheless, the following characterizations suggest the successful preparation of GDYCNtb. The specific surface area of CNtb and GDYCNtb-0.07 is determined by nitrogen adsorption and desorption isotherms.As shown in Fig. 1b, the BET surface area of the pre-prepared GDYCNtb-0.07 is about 40.2 m 2 g -1 , which is slightly higher than that of pure CNtb (32.9 m 2 g -1 ).At the same time, it can be seen from the inset of Fig. 1b that the pore sizes of GDYCNtb-0.07 and CNtb are mainly 30-80 nm. The morphologies are further characterized by scanning electron microscope (SEM) and transmission electron microscope (TEM), as shown in Fig. 2. It can be seen from Fig. 2a and 2b that GDY displays a flake-like morphology with a rough surface, while CNtb is nanotube-like 40,52.For GDYCNtb-0.07, the CNtb after ultrasonic treatment evenly covers the surface of GDY (Fig. 2c), indicating that CNtb and GDY are successfully combined together.The diameter of the nanotubes is about 70 nm, which is also consistent with the pore size distribution in Fig. 1b.In addition, the TEM image (Fig. 2d) for GDYCNtb-0.07 further demonstrates the nanotube structure of CNtb with a diameter of 80 nm, which agrees with the SEM image.The combination of GDY and CNtb is reasonable considering the fact that the zeta potential (Fig. S2) of CNtb is 9.23 mV, while that for GDY is -24.8 mV.It is easy for them to assemble via static electric interaction.Besides static interaction, - interaction is also believed to promote the assemble between GDY and CNtb. The chemical composition of the sample is measured by X-ray photoelectron spectra (XPS).As shown in Fig. 3a, CNtb has a typical C 1s spectra at 288.3 eV, which is attributed to the typical aromatic N-C-N coordination.The peak at 284.8 eV is due to the C-C sp 2 hybridization of amorphous carbon at the CNtb surface.Compared with pure CNtb, GDYCNtb-0.07 has four typical GDY peaks at 284.5, 285.1, 286.3, and 287.9 eV, which are ascribed to the CC(sp 2 ), CRC(sp), CO and C-O bonds, respectively 50.In addition, it can be found that the N-C-N peak for GDYCNtb-0.07 exhibits a significantly lower binding energy than pure CNtb, indicating a strong interaction between GDY and CNtb due to the - interaction.In addition, the shift mentioned above also suggests that the photogenerated holes generated by CNtb is very likely transferred to GDY, considering the fact that GDY is a typical hole transporting material.This hole transfer would promote the separation of photo-generated carriers and consequently improve the photocatalytic performance.The high-resolution N 1s spectra (Fig. 3b) of GDYCNtb-0.07 can be divided into three peaks at 398.6, 399.8, and 401.1 eV, which are assigned to the sp 2 hybridized nitrogen atom (CN-C), bridged nitrogen atom (N-(C) 3 ) and C-N-H bond of CNtb, respectively.The weak peak at 404.5 eV is due to the charging effect caused by the bond excitation 30, which is basically consistent with the pure CNtb.Similar to the C 1s spectra, the N 1s spectra of GDYCNtb-0.07 also exhibits a shift towards lower binding energy, further suggesting the strong interaction between GDY and CNtb.In summary, the analysis of XPS results proves that the GDYCNtb composites are successfully constructed. In order to study the light absorption capacity of the photocatalyst, the UV-vis diffuse reflectance spectra (DRS) are investigated, as shown in Fig. 3c.It can be seen that, the absorption onset at around 450 nm is due to the presence of g-C 3 N 4 nanotubes.The introduction of GDY greatly increases the absorption in the visible light region.In addition, it is found that the band edge of CNtb in the composite displays a certain blue shift relative to pure CNtb, which may be attributed to the size quantum effect 30.As GDYCNtb are prepared under ultrasonication, the band gap increases as the particle size decreases, which can be seen from Fig. S1d.According to Kubelka-Munk equation: (h) n A(h-E g ), where , h, A, and E g represent the absorption index, Planck constant, constant, optical frequency and band gap width, respectively, and n 2, considering that CNtb is a direct semiconductor 53.The band gap of pure CNtb and the CNtb in GDYCNtb-0.07 are determined to be 2.79 and 2.96 eV, respectively.(Fig. S1d).In order to investigate the interface charge transfer and photo-generated carrier separation efficiency of the as-prepared sample, the photoluminescence spectra with the excitation wavelength of 350 nm are measured, as shown in Fig. 3d.Pure CNtb displays a strong broad peak at about 470 nm.In obvious contrast, the PL intensity of GDYCNtb-0.07 decreases significantly, suggesting that the introduction of GDY significantly improves the separation efficiency of photogenerated carriers 50. To further study the transfer and separation efficiency of photogenerated electron-hole pairs, transient photocurrents are carried out, as shown in Fig. 4a.For the six cycles of switching the light source periodically, the photocurrent of GDYCNtb-0.07 is significantly higher than that of pure CNtb.The increased photocurrent proves that more free electrons/holes can be generated over GDYCNtb-0.07 than that over pure CNtb.In addition, electrochemical impedance spectra (EIS) Nyquist plots are also measured (Fig. 4b).GDYCNtb-0.07 exhibits a smaller arc radius than pure CNtb as expected, which proves that the introduction of GDY is beneficial to enhance the conductivity.The fitted equivalent circuit is shown in the inset of Fig. 4b.R sr and R ctr represent the electrolyte resistance (PBS, phosphate buffer solution) and the charge transfer resistance of the working electrode, respectively, and CPE is a constant phase element.The calculated R ctr for CNtb and GDYCNtb-0.07 are 320.3k and 67.6 k, respectively.Obviously, GDYCNtb-0.07 exhibits a much smaller charge transfer resistance, which further verifies that the introduction of GDY is beneficial for improving the conductivity and the separation of photo-generated carriers. The photocatalytic activity of CNtb and GDYCNtb is evaluated in terms of CO 2 reduction under visible light irradiation.First of all, it can be seen from Fig. 5a-b that the introduction of GDY can significantly improve the photocatalytic CO 2 reduction efficiency and CO and CH 4 are the main products.At the same time, nearly no H 2 was detected, which may be due to the low amount.In addition, the CO 2 reduction activity of GDYCNtb increases gradually with increasing the content of GDY, which reaches the highest when the mass ratio of GDY to CNtb is 0.07.Specifically, the generation rate for CO and CH 4 after 4 h reaction reaches 29.33 mol/g and 7.71 mol/g, respectively.Compared with pure CNtb, GDYCNtb-0.07 displays an increase of 18-20 times for CO and CH 4 evolution, which is also competitive in other g-C 3 N 4based semiconductors reported recently (Table S1).However, further increasing the GDY content, the yields of evolved CO and CH 4 decrease.Therefore, an optimum value for the composite can be obtained.Subsequently, the cyclic stability of GDYCNtb-0.07 under long-term illumination is carried out.As shown in Fig. 5d, after four cycles, the CO and CH 4 output still shows a linear increase with time, and no significant decrease is found, which proves the stability of the composite.FT-IR, XRD and micro-morphology images also show that there is no obvious crystal structure change or bond breakage for all samples after the reaction (Fig. S5). In order to verify that the product is obtained from CO 2 reduction rather than from the catalyst itself or factors of the reactor, control experiments either in N 2 atmosphere or in the absence of catalyst is carried out, as shown in Fig. S3.No CO or CH 4 is detected, proving that the product is indeed due to the photocatalytic reaction.The effect of the size of CNtb on the photocatalytic performance is further investigated.As shown in Fig S4 , for sample CNtbNS (pure CNtb is treated under sonication without adding GDY under the same conditions with GDYCNtb), the yields of CO and CH 4 is higher than that of pure CNtb, but lower than that over GDYCNtb.This result indicates that decreasing the size of CNtb indeed increases the activity to some extent due to the increased specific surface area.Nevertheless, the improvement due to large BET surface area is limited, and the introduction of GDY is believed to be the main reason for the better performance of GDYCNtb. GDYCNtb displays better photocatalytic CO 2 reduction ability than pure CNtb, which may be attributed to the following two reasons: the excellent hole transport ability of GDY and the enhancement of the electrical conductivity of the material, both of which are beneficial for the separation efficiency of photogenerated carriers.However, increasing the content of graphdiyne means decreasing the g-C 3 N 4 content.In the composite, it is g-C 3 N 4 that absorb photons to generate electrons and holes.Therefore, decreased g-C 3 N 4 would lead to less photogenerated electrons and holes, thereby reducing its photocatalytic CO 2 ability.Therefore, GDY exhibits two competing effects.That is the reason why sample GDYCNtb-0.07 displays the best activity. Based on the above relevant characterizations, the photocatalytic mechanism is proposed as follows, as is shown in Scheme 1.Under light illumination, CNtb absorbs photons to generate photo-generated electrons and holes.As GDY is a good hole transporter, the photo-generated holes are more inclined to transfer from CNtb to GDY, and oxidize H 2 O adsorbed giving rise to O 2 .At the same time, the photogenerated electrons stay at the conduction band of CNtb, react with CO 2 to generate CO and CH 4 with the assistance of proton.This effective charge transfer significantly promotes the separation efficiency of photo-generated carriers 50 as evidenced by the PL and photocurrent spectra.In addition, it can also be seen from EIS Nyquist plots that the introduction of GDY significantly improve the conductivity of the composite, which is also beneficial for the photogenerated charge separation."
  },
  {
    "title": "Conclusions",
    "content": "In summary, GDYCNtb composite are prepared using a simple self-assembly method.By introducing GDY, the absorption of the GDYCNtb in the visible light region is significantly enhanced.In addition, the addition of GDY enhances the conductivity of the material.At the same time, the good carrier mobility of GDY is conducive to promote the separation of photogenerated carriers, thereby improving the photocatalytic CO 2 reduction ability.After four cycles, the photocatalytic activity of the composite does not decrease significantly, proving the good stability of the composite.This work is also the first report to combine powder CNtb with GDY under a simple ultrasonication and stirring process, which provides a new idea for the preparation of other g-C 3 N 4 -based materials in the future. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Fig. 1.(a) XRD patterns of photocatalysts GDY, CNtb and GDYCNtb, (b) Nitrogen adsorption/desorption isotherms of CNtb and GDYCNtb-0.07.Inset: pore size distribution for CNtb and GDYCNtb-0.07. Fig. 3.The high resolution XPS spectra of (a) C 1s and (b) N 1s for CNtb and GDYCNtb-0.07;(c) UV-visible DRS spectra, (d) the PL spectra of CNtb and GDYCNtb-0.07. Fig. 4. (a) The photocurrent responses and (b) EIS Nyquist plots for CNtb and GDYCNtb-0.07. Fig. 5.The CO (a) and CH 4 (b) evolution as a function of irradiation time over pure CNtb and GDYCNtb composites with different GDY to CNtb mass ratios.(c) further comparison of CO and CH 4 yield over different samples after 4 h of illumination ( 420 nm); and (d) cyclic photocatalytic performance of GDYCNtb-0.07 under long-term illumination with 420 nm filter. Conceptualization, Methodology, Formal analysis, Writing -original draft.Yuanyuan Liu: Resources, Writing -review editing, Supervision.Zeyan Wang: Validation, Investigation.Peng Wang: Resources, Investigation.Zhaoke Zheng: Formal analysis.Hefeng Cheng: Validation, Investigation.Xiaoyan Qin: Project administration, Investigation.Xiaoyang Zhang: Validation, Project administration.Ying Dai: Formal analysis, Software.Baibiao Huang: Resources, Writing -review editing, Supervision, Project administration. Journal of Alloys and Compounds 868 (2021) 159045 Scheme 1. Proposed mechanism of photocatalytic CO 2 reduction over GDYCNtb.C. Sun, Y. Liu, Z. Wang et al.Journal of Alloys and Compounds 868 (2021) 159045 This work was financially supported by the National Natural Science Foundation of China (grant numbers U1832145, 51972195, 21832005, 21972078, 11374190, and 51321091), Young Scholars Program of Shandong University (20506WLJH16, and 2020QNQT012), Taishan Scholar Foundation of Shandong Province, China, The Key Research and Development Program of Shandong Province (2019GGX103026), Project for Scientific Research Innovation Team of Young Scholar in Colleges and Universities of Shandong Province (2019KJA009).The authors also thank Professor Changshui Huang for kindly providing us the graphdiyne. Supplementary data associated with this article can be found in the online version at doi:10.1016/j.jallcom.2021.159045."
  }
]