[
  {
    "title": "Doi",
    "content": "10.1016/j.jcat.2021.11.007"
  },
  {
    "title": "Article_Title",
    "content": "Effect of ionic liquid in a pressurized reactor to enhance CO2 photocatalytic reduction at TiO2 modified by gold nanoparticles"
  },
  {
    "title": "Abstract",
    "content": "This work describes the synergic effect of gold nanoparticles as co-catalyst on TiO 2 nanotubes (TNT/ AuNP) in aqueous medium containing the ionic liquid (IL) 1-Butyl-3-methylimidazolium tetrafluoroborate, in a pressurized photocatalytic reactor, as a good strategy to enhance CO 2 conversion into valueadded products.The surface plasmon resonance of the gold NPs improve the photoexcitation under visible light and slightly change the TNT band gap from 3.2 to 2.9 eV.Methanol production using TNT/AuNP in aqueous medium containing 2 (v/v) BMIM-BF4, 1 g L A1 Na 2 SO 3 as a hole scavenger, under 5 atm pressure and solar irradiation, produce up to 279.6 mM (mmol L A1 ) of methanol and 98.8 mM of methane, with the quantum yield of 1.12 at 440 nm.Isotope-labeled studies by GC/MS proved that 13 CO 2 is the source for photoproduction of 13 CH 3 OH.The results indicate that the combination of the Au co-catalyst size, high pressure, and IL can provide efficient modulation of CO 2 conversion."
  },
  {
    "title": "Experimental",
    "content": "TNT catalysts were prepared electrochemically by anodizing titanium foils (Realum, Sao Paulo, Brazil), as described previously 11,47.The decoration of the TNTs with Au NPs was performed by the chemical reduction of a chloroauric acid solution with citric acid, adapted from the method of Turkevich et al. 48.Firstly, the TNT catalyst was immersed for 5 min in a solution of HAuCl 4 (1 mM, Sigma-Aldrich) heated at 100 C, under constant agitation.After this period, the heating was turned off and lime juice (-Citrus A latifolia) was added to the solution to form a violetcolored suspension, which confirmed the formation of gold NPs.The TNT catalyst was left in this suspension for 48 or 72 h, followed by washing in ultrapure water and drying in a gentle flow of N 2 . Morphological characterization of the TNT catalysts was performed by FEG-SEM, using a 7500F microscope (JEOL, Tokyo, Japan).TEM images were obtained with a TECNAI G2F20 system (FEI, Hillsboro, OR, USA) equipped with a scanning transmission electron microscope (STEM) and energy dispersive X-ray analyzer (EDX).The size of gold particles was measured using a Zetasizer Nano ZS90 (Malvern Instruments, Worcestershire, UK).X-ray photoelectron spectroscopy (XPS) analyses were performed using a UNI-SPECS UHV system (SPECS, Berlin, Germany) equipped with an Mg Ka X-ray source (h 1253.6eV).The spectra were acquired at a pressure of 10 -7 Pa.The analyzer pass energy was 10 eV and the accuracy of the peak positions was 0.1 eV.The XPS data were corrected using the C1s calibration energy of 284.8 eV.The crystal structure of the catalyst was investigated by X-ray powder diffraction, using a D5000 instrument (Siemens, Munich, Germany) with Cu Ka radiation. A Cary 60 UV-Vis spectrophotometer (Agilent Technologies, Santa Clara, CA, USA) equipped with a Barrelino TM diffuse reflectance accessory (Harrick Scientific, Pleasantville, NY, USA) was used to calculate the optical band gap values of the catalysts.Raman spectra were acquired with a LabRAM HR 800 Raman spectrophotometer (Horiba Jobin Yvon, Longjumeau, France) equipped with a CCD detector (DU420A-OE-325) and a He-Ne laser (632.81 nm).The spectra were obtained between 100 and 1000 cm A1 , with acquisition time of 50 s and 2 cycles.Attenuated total reflectance infrared (ATR-IR) spectra were obtained in the spectral range from 4000 to 400 cm A1 , using a Vertex 70 spectrometer (Bruker, Ettlingen, Germany) equipped with a diamond attenuated total reflectance accessory. Chronoamperometry measurements was performed by the use of a three electrode, with a Pt wire, an Ag/AgCl (4 M) and TNT/ AuNP as the counter-electrode, reference electrode and working electrode, respectively.The transient photocurrent responses were performed in an Autolab PGSTAT 128 N potentiostat/galvanostat (Metrohm, Herisau, Switzerland) using a 300 W Xe arc lamp with solar filter AM1.5G.The electrochemical impedance spectra (EIS) measurement was performed using an Autolab PGSTAT 302 N potentiostat (Metrohm, Herisau, Switzerland).5.0 mM Fe(CN) 6 3A / 4- A in 0.1 M KCl was used as an electrochemical probe.An Ag/AgCl and a Pt wire was used as reference electrode and counter electrode, respectively.The frequency range employed was from 10 kHz to 0.03 Hz, with a 5 mV rms sinusoidal modulation at 0.22 V vs. Ag/AgCl.Mott-Schottky analysis was performed to obtain the conduction band position from the impedance potential mode at a fixed frequency of 10 Hz in 0.1 M phosphate buffer at pH 7. Photocatalytic experiments were performed using a onecompartment stainless steel reactor with internal capacity of 250 mL (Fig. SM1), filled with 150 mL of Na 2 SO 3 solution (1 g L A1 ) containing CO 2 dissolved by bubbling this gas (Oxi-Ara, Sao Paulo, Brazil) for 20 min, at a flow rate of 1 L min A1 (pH 4.5 after CO 2 bubbling).After bubbling, the reactor was sealed and pressurized with CO 2 , at pressures from 1 to 5 atm.The ILs 1-butyl-3methylimidazolium tetrafluoroborate (BMIM-BF4) (97) and 1ethyl-3-methylimidazolium diethyl phosphate (EMIM-DEP) (98), both purchased from Sigma-Aldrich (St. Louis, MO, USA), were used at 1-4 v/v to increase the solubility of CO 2 in water.Na 2 SO 3 was used as a hole scavenger, with its consumption estimated by iodometric titration.Control experiments using nitrogen gas were performed following the same conditions described above.Besides that, isotope labelling experiments were conducted using NaH 13 CO 3 (Sigma-Aldrich, St. Louis, MO, USA) as C13 source.In this case, a solution of NaH 13 CO 3 was placed in the reactor with H 2 SO 4 to form 13 CO 2 in situ at approximately 0.033 M (the maximum solubility of CO 2 gas in water at ambient pressure).After that, 2 v/v of BMIM-BF4 was added to the bicarbonate solution and the reactor was sealed. The surface of the catalyst was irradiated using a solar simulator composed of a 300 W Xe arc lamp (type 69911, Newport-Oriel Instruments, Stratford, CT, USA), a lamp housing (type 67005, Newport), and solar filter (type 81094, Newport).The solar simulator produced 30 mW cm A2 of irradiance in the range of 280-400 nm, measured using a radiometer (PMA 2100, Solar Light Co., Glenside, PA, USA).The emission spectrum of the solar simulator system was measured with a USB4000 spectrometer (Ocean Optics, Dunedin, FL, USA) (Fig. SM2).In order to evaluate the plasmonic effect of gold NPs, control experiments were performed using TNT/AuNP catalyst under UV irradiation (280-400 nm), using a visible filter (type 66216, Newport) or under irradiation of commercial green light LEDs with 3.0 mW cm A2 of irradiance at the maximum emission of 525 nm (Power Meter, Model 2935-C, Newport).The spectrum of green LEDs was measured using a Horiba Jobin Yvon spectrofluorometer (Model Fluorolog-3 FL3-122, Japan) with a laser excitation in 360 nm (Fig. SM2). After 3 h of the experiment, a gastight syringe (Hamilton, Reno, NV, USA) was used to obtain a sample of the headspace gas and inject it into the gas chromatography system.The liquid content was collected and analyzed by gas chromatography, ion chromatography, and mass chromatography. Alcohols were analyzed by GC-FID (GC 2010, Shimadzu, Kyoto, Japan) after solid phase microextraction using a fiber coated with divinylbenzene/polydimethylsiloxane (DVB/PDMS) (type 57329-U, Supelco, Saint Quentin Fallavier, France), as reported previously 11.Briefly, a 0.5 mL aliquot of the solution was transferred to a vial and heated for 7 min in a water bath (type HB 0.5, IKA, Sao Paulo, Brazil).The fiber was then exposed to the vapor for 5 min and inserted into the GC.A Stabilwax column (30 m A 0.25 mm, 25 lm; Restek, Bellefonte, PA, USA) was used for separation.The carrier gas was N 2 at a flow rate of 1.0 mL min A1 .The injector and detector temperatures were set at 250 C.The heating ramp was from 40 to 46 C at 2 C min A1 , followed by an increase to 170 C at 45 C min A1 , maintaining the final temperature for 3 min.The detection limit for methanol was 11.2 lM. The gas phase products were analyzed by GC-TCD (CO and H 2 ) and GC-FID (CH 4 ), using a Carboxen-1010 PLOT fused silica capillary column (30 m A 0.53 mm, 0.30 lm; Supelco, Bellefonte, PA, USA) and an SH-Rt O -Q-BOND column (30 m A 0.53 mm, 20 lm; Shimadzu, USA), respectively, in a GC 2010 Plus instrument (Shimadzu, Kyoto, Japan).The samples were injected using a twoposition valve (Valco Instruments Co. Inc., Houston, TX, USA).The initial oven temperature was adjusted to 35 C, with a holding time of 7 min.After this period, the temperature was increased to 170 C at 24 C min A1 , with the final temperature maintained for 5 min.The injector temperature was 250 C and the detector temperatures were 200 C (FID) and 180 C (TCD).The carrier gases were Ar (GC-TCD) and N 2 (GC-FID) at flow rates of 3.0 and 96.0 mL min A1 , respectively. Formic acid was analyzed using an ion chromatograph with a conductivity detector (930 Compact IC Flex, Metrohm, Herisau, Switzerland), coupled to an autosampler (type 863 Compact IC).Separation was achieved using a Metrosep Organic Acids column (250 mm A 7.8 mm, 8 mm; Metrohm, Herisau, Switzerland).Isocratic elution at 0.5 mL min A1 was performed using 0.4 mM H 2 SO 4 as the mobile phase. Labeling carbon 13 products were identified using a GCMS QP2020 system (Shimadzu, Kyoto, Japan) coupled to an AOC 6000 autosampler.The separation was performed using an Zebron ZB-WAX capillary column (15 m A 0.25 mm, 0.25 lm; Phenomenex, Torrance, CA, USA).The carrier gas was helium at a flow rate of 1.0 mL min A1 .The injector temperature and heating ramp were the same as used for the GC-FID analysis.The mass spectrometric detector was operated in multiple reaction monitoring mode with ionization energy of 70 eV, quadrupole temperature of 150 C, and scanning from m/z 20 to 80. The Au NPs deposited on the TNT substrate were quantified by inductively coupled plasma optical emission spectrometry (ICP-OES), using an iCAP 7000 instrument (Thermo Fisher, Madison, WI, USA).The ICP-OES spectrometer operating conditions were as follows: applied radio frequency (RF) power of 1.15 kW; plasma gas flow rate of 12.0 L min A1 (Ar, 99.996; White Martins Praxair, Sao Paulo, Brazil); auxiliary gas flow rate of 0.5 L min A1 ; and nebulizer gas flow rate of 0.5 L min A1 .The Au emission lines used were at 242.8 and 208.2 nm, in axial viewing mode.A calibration curve with linearity from 0.5 to 30.0 mg L A1 was obtained using dilutions of a 1000 mg L A1 stock standard solution of Au in 0.1 mol L A1 HNO 3 .The samples were prepared by chemical pickling, where the TNT/ AuNP catalyst with area of 4.0 cm 2 was immersed in 1.0 mL of 1.0 mol L A1 HNO 3 solution for 15 min, followed by transfer to a 10 mL volumetric flask and completion of the volume with deionized water. The possible mineralization of BMIM-BF4 and EMIM-DEP after the photocatalytic reduction of CO 2 was evaluated by measuring the decay of total organic carbon (TOC), using a TOC-VCPN instrument (Shimadzu, Kyoto, Japan)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Scanning electron microscopy images of the TNT catalyst with and without Au NPs are shown in Fig. 1.The micrograph shown in Fig. 1A revealed that the TiO 2 nanotubes deposited on the Ti substrate by the electrochemical anodizing method were highly ordered, with average diameter of around 100 nm, tube thickness of 30 nm and length of 2.0 lm, as reported previously 11.The TNT/AuNP catalyst prepared by the chemical deposition of gold using citric acid showed a uniform distribution of Au NPs on the surfaces and within the TNTs with no indication of agglomeration of Au NPs. (Fig. 1B).The EDS elemental mapping for the TNT/AuNP catalyst is shown in Fig. 1C.The qualitative analysis of the distributions of the elements Ti, O, and Au on the surface clearly indicated that the Au was evenly spread over the entire surface of the material. The size of Au NPs was investigated by TEM and showed NPs with size in the range of 2-11 nm (Fig. 1D), with the average diameter of 4.5 nm (Fig. 1E).Furthermore, the size distribution of Au NPs in aqueous suspensions was measured using DLS.The average size of Au NPs was 10 nm (Figure SM3) i.e., larger than that determined by TEM analysis.This can be attributed to either the aggre- gation of Au NPs in solution or to the DLS technique which considers the hydrodynamic diameter, that is the diameter of a hypothetical hard sphere diffusing at the same hydrodynamic friction as the particle of interest. Fig. 2A shows the EDS analysis of the TNT material, revealing the presence of O and Ti.The presence of gold in the TNT/AuNP catalyst was shown by a peak at 2.3 keV.Fig. 2B shows a comparison of the X-ray diffraction patterns of the TNT and TNT/AuNP catalysts.As can be seen, the peaks indicated formation of the anatase phase after annealing of the TNT catalyst, with the shapes of the Xray diffraction peaks being similar for the undecorated and decorated materials, due to the small amount of Au, relative to the amount of TNT.The diffraction peaks at 2h of 25.5, 48.1, 54.2, and 55.2corresponded to the (1 0 1), (2 0 0), (1 0 5), and (2 1 1) reflections, respectively, of the crystal faces of anatase TiO 2 (JCPDS card no.21-1272). The TNT and TNT/AuNP catalysts presented five Raman peaks (Fig. 2C), as identified previously by Ohsaka et al. 49, at (cm A1 ) 144 (Eg), 197 (Eg), 399 (B1g), 513 (A1g), and 639 (Eg), attributed to photonic modes 6, 4, 2, and 3, respectively 49,50.FTIR-ATR spectra of the TNT and TNT/AuNP catalysts are shown in Fig. 2D.Line 2 shows absorption bands at 1652 and 1540 cm A1 , attributed to m as (COO-) stretching, while bands in the range between 3073 and 2859 cm A1 could be attributed to m(C-H) stretching, and a band at 3295 cm A1 was due to m(O-H) stretching 51.These bands corresponded to the citric acid present in the juice of Persian lime (Citrus A latifolia) used in preparation of the gold NPs.This approach was based on the classical synthesis of gold nanoparticles using sodium citrate as a reducing agent. The XPS spectrum of TNT/AuNP showed the presence of O1s, Ti2p, N1s, C1s, and Au4f transitions (Fig. SM4).The XPS scanning analysis revealed the presence of gold in the TNT catalyst, with peaks in the Au4f spectrum corresponding to Au 4f5/2 and Au 4f7/2, at around 87.0 and 83.9 eV, respectively, attributed to the binding energy of the metallic Au state (Fig. 3A), confirming the presence of gold on the catalyst surface.In addition, the Ti2p spectrum presented the twin Ti 2p3/2 and Ti 2p1/2 peaks at 458.5 and 464.3 eV, respectively, attributed to Ti(IV) in anatase TiO 2 (Fig. 3B).Fig. 3C and 3D presents the peaks referring to O1s and C1s, respectively. The UV-Vis absorbance spectra of the TNT and TNT/AuNP materials are compared in Fig. 4. As expected, the TNT spectrum presented strong absorption in the UV region (line 1), which could be attributed to charge transfer from the TNT valence band to the conduction band 52 (Fig. 4A).It is worth noting that the TNT catalyst absorption in the visible region is due to the light scattering effect caused by cracks or pores on the surface of the TNT nanotubes 53,54.On the other hand, a slight red shift was observed in the TNT/AuNP spectrum (line 2), due to the gold nanoparticles deposited on the TNT surface.In addition, the TNT/ AuNP spectrum showed a clear band between 450 and 650 nm, in the visible region, which could be attributed to the surface plasmon resonance of the gold NPs 30,55. In order to investigate the effect of the Au NPs on the TNT band gap, Tauc plots 56 were obtained for the materials (Fig. 4B), using the Kubelka-Munk equation (Eq.(1)): where, a is the absorption coefficient, R is the reflectance, and c is the power coefficient, assumed to be 2 (indirect allowed electronic transition), which is most appropriate for use with a titania semiconductor.The band gaps of the TNT and TNT/AuNP samples were calculated to be 3.2 and 2.9 eV, respectively (Fig. 4B).Therefore, the deposition of the Au NPs on the TNT surface resulted in a notable improvement in the visible light response of the catalyst, as shown by the reduction of the band gap value 57.Considering that the radiation source used in this work was a solar simulator system employing an AM 1.5G filter, which blocked a large part of the UV radiation, an increase in CO 2 photoreduction was expected when the TNTs were decorated with Au NPs, since, Au NPs can enhance the light absorption capacity and also improve the charge transport, consequently decreasing the charge recombination rate 58. The work function of noble metals, as gold, are higher than TiO 2 work function 59, therefore, when Au NPs are in contact with TiO 2 nanotubes, the conduction band of the semiconductor will bend up to the Fermi energy level of both materials are aligned, forming a Schottky barriers that provides an effective electron trap, avoiding the electron-hole recombination, thus increasing the lifetime of the electron (Fig. SM5A).In order to understand the effect of gold nanoparticles acts during the interfacial charge transfer resistance (RCT), measurements of electrochemical impedance spectroscopy were employed using a 5.0 M Fe(CN) 6 3A/4A probe in a 0.1 M KCl supporting electrolyte.As can be seen in Figure SM5B, the semicircle diameter of the modified TNT catalyst (line 2) is much smaller compared to bare TNT (line 1), due to easier electron transference from TNT/AuNP surface to the Fe(CN) 6 3A/4A redox couple.The RCT values estimate for TNT and TNT/AuNP was 380 kX and 40.5 kX, respectively, demonstrating that the separation of generated charges is favored in the Schottky barriers.Mott-Schottky analysis was carried out to estimate the flat band potential of the catalysts.As can be seen in Figure SM5C, the curves for both materials showed positive slopes in C A2 vs. V plot at a frequency of 10 Hz (this is typical behavior of n-type semiconductor), therefore, the flat band potential and conduction band potential are well matched.The flat band potential for TNT was A0.175 V vs. NHE, while for the new catalyst, TNT/AuNP, the band position reached approximately A0.385 V vs. NHE.Thus, it is important to highlight that the potential of the conduction band on the modified catalyst has changed, being sufficiently aligned to promote the reduction of CO 2 to methanol and methane, for example. The CO 2 photoreduction performances of the TNT and TNT/ AuNP catalysts were investigated using 1 g L A1 sodium sulfite solution, previously saturated with CO 2 (pH 4.5) by bubbling CO 2 for 20 min.The experiments were performed at 1 atm pressure, under irradiation by the solar simulator.A hole scavenger (Na 2 SO 3 ) was used in the experiments, since its absence resulted in low generation of CO 2 reduction products (data not shown).In the presence of sodium sulfite, methanol generation at the TNT/AuNP catalyst reached 57.6 mM (mmol L A1 ) after 180 min (Fig. 5A).This value was much higher than obtained using the bare TNT catalyst (below quantification limit).The results showed that the addition of a hole scavenger was essential in the process, since it was necessary for electrons to be available on the TNT surface.In the absence of a hole scavenger, as reported previously by Fujishima et al. 60, the timescale favors recombination of the charge carriers, since the absorption of a photon by TiO 2 (generating the electron-hole pair) occurs in femtoseconds, while the migration of this electron to the surface of the catalyst occurs in picoseconds, and the reduction reaction of the species adsorbed on the catalyst occurs in microseconds 60.Hence, the presence of sodium sulfite decreased recombination of the charge carriers and allowed the reduction of CO 2 by the photogenerated electrons.Sodium sulfite was selected, because it is easily oxidized to sulfate by the photogenerated holes, without interfering in the process. Methanol and methane were the main products obtained in all the experiments, with hydrogen being detected in some cases, at concentrations lower than the quantification limit.Other products such as formic acid and carbon monoxide were not detected by the chromatographic techniques employed in this work. The findings demonstrated the significant effect of incorporation of the gold NPs on the TNT catalyst surface, resulting in higher CO 2 photoreduction (Fig. 5A).This could be explained by the fact that the NPs improved the photoexcitation of the catalyst, since there was greater absorption of the radiation from the light source in the visible light region.It is important to note that the reduction process was not favored using unmodified TNTs as the catalyst, since the TNT conduction band is located at A0.175 V vs. NHE (Fig. SM5C), which does not provide a suitable match for the generation of CO 2 reduction products such as methanol (CO 2 /CH 3 OH A0.38 V vs. NHE), methane (CO 2 /CH 4 A0.24V vs. NHE), or formic acid (CO 2 /HCOOH A0.61V vs. NHE), because the conduction band edge of the semiconductor must lie at a more negative potential than the CO 2 reduction potential.In addition, TNT has a high band gap value, so it was almost transparent to the radiation provided by the solar simulator, which further decreased the catalytic efficiency of the material. However, when the TNT surface was modified by NPs, the material could absorb visible light (Fig. 4A), which comprised the greatest portion of the light emitted by the solar simulator operating with an AM 1.5G cut-off filter.This was due to the SPR phenomenon, which consists of free electron oscillation, creating a charge density on the surface when the metal is of nanometric size, consequently greatly increasing the generation of methanol.In addition, the nanoparticles of noble metals such as Au deposited on semiconductors have high Schottky barrier levels and can act as electron traps, facilitating charge carrier separation and decreasing the effect of electron-hole pair recombination 45.This favors the process of interfacial charge transfer, consequently improving multi-electron transfer from the TNT/AuNP catalyst to CO 2 molecules.When the noble metal nanoparticle is in contact with the semiconductor surface, there is overlap between the Fermi levels of the gold nanoparticles and the semiconductor, with a quasi-Fermi level region acting as a reservoir for the photogenerated electrons, hence extending the charge carrier lifetime 61. These results were in agreement with the findings of Hou et al. 62, who observed that the illumination of Au NPs deposited on anatase TiO 2 , using monochromatic light at 532 nm in the visible range, resulted in the production of methane with a rate constant 24-fold higher than obtained with bare TiO 2 .The higher CH 4 formation was attributed to the intense local electromagnetic fields created by SPR of Au NPs, which enhanced sub-band gap absorption on the TiO 2 .Tahir et al. 63 showed that in comparison to a bare TiO 2 catalyst, Au NPs deposited over TiO 2 nanowires enhanced the generation of CO and methanol during CO 2 photoreduction with H 2 , due to the effect of SPR on photoexcitation by visible light.In addition, it was found that increase of the quantity of Au NPs (between 0.2 and 0.7) on the surface of the TiO 2 resulted in higher methanol generation and lower methane formation.In another work, the generation of formic acid was observed during the photoconversion of bicarbonate solution in a glycerol medium, using a gold-TiO 2 composite 64.The generation of formate was 7 mM g A1 cat h A1 , which was much higher than obtained using TiO 2 alone (0.9 mM g A1 cat h A1 ), employing a solar simulator (AM 1.5G) as the light source.However, in our work, there was no formation of formic acid at detectable concentrations. Under UV irradiation (SPR effect of Au NP is absent), the generation of methanol was 81.2 lM (Fig. SM6).The Xe arc lamp emits UV irradiation at around 300 nm 65, making it possible to excite the electrons from the valence band to conduction band of TiO 2 .In this case, the Au NPs can effectively stock the photogenerated electrons to drive the photoreduction of CO 2 31.According to Park et al. 66, UV irradiation causes the equilibrium in the Fermi level between TiO 2 and Au through the charge distribution, thereby shifting it to lower levels.On the other hand, when the TNT/AuNP catalyst was irradiated with the green light LED, only Au NPs absorbs photons due to SPR, leading to the generation of lower amounts of methanol (12.8 lM). In this situation, the plasmon-excited electrons are transferred from Au NPs to the conduction band of TiO 2 through the Schottky junction 34 and the semiconductor uses the electrons to drive the photoreduction of CO 2 to methanol.However, stronger SPR of Au NPs does not guarantee greater efficiency during photoreduction 67, since the excitation of catalyst by higher energy photons would allow more electrons to move into TiO 2 conduction band. It is worth noting that in our work, enhancing the deposition time of Au NPs from 48 h to 72 h did not have any significant effect on methanol generation (data not shown).In this case the amount of Au present on the TNT/AuNP catalyst only increased from 13.6 and 13.8 mg cm A2 (after chemical pickling with HNO 3 ) for the catalysts prepared for 48 h and 72 h, respectively. The low solubility of carbon dioxide in water at room temperature and pressure is one of the limitations of using the photocatalytic method for CO 2 reduction 68.The photocatalytic reaction mainly occurs with the CO 2 adsorbed on the immobilized catalyst surface.Consequently, the low solubility of CO 2 substantially decreases the amount available for the reduction reaction, which could be accelerated by increasing the pressure in the photocatalytic reactor. Fig. 5B shows the effect of pressure during CO 2 photoreduction using the TNT/AuNP catalyst.A pressure of 1 atm resulted in the generation of 57.6 mM of methanol.When the pressure was increased to 3 and 5 atm, the generation of methanol increased to 94.8 and 151.2 mM, respectively, due to the higher pressure in the system, which increased the dissolution of CO 2 in water. Table SM1 summarizes the consumption of the Na 2 SO 3 used as a hole scavenger, after 3 h of CO 2 photoreduction using the TNT/ AuNP and TNT catalysts in water at different conditions using solar simulator.For the bare TNT catalyst, the consumption was only 8.3 at 1 atm.However, for the TNT/AuNP catalyst, the consumption of Na 2 SO 3 increased to 25.8.The results confirmed the formation of methanol, observed previously.Under applied pressures of 3 and 5 atm, CO 2 photoreduction increased, with concomitant hole scavenger consumptions reaching 38.5 and 50.2, respectively. Mizuno et al. 69 showed that a continuous increase of the CO 2 pressure led to increased formation of gaseous products, as well as the formation of C2 products (C 2 H 4 and C 2 H 6 ) at 2.5 MPa, using a TiO 2 suspension.Methanol generation increased rapidly up to 1 MPa, but further increase of the pressure to 2.5 MPa resulted in a sudden decrease of methanol generation, for reasons that were not clearly understood.In other work, the use of isopropyl alcohol (1 M) as a positive hole scavenger during CO 2 photoreduction using TiO 2 powder, at 2.8 MPa, produced 1.2 mM g A1 (Ti) of methane 70.In the absence of the alcohol, methane was not produced.Bahadori et al. 37 reported high generation of methanol using a 0.5 wt Au/TiO 2 powder suspension as catalyst, with application of 7 bar pressure, under irradiation from a medium pressure Hg vapor lamp.No methanol or CH 4 were observed when bare TiO 2 was used. Therefore, further studies were carried out using a pressure of 5 atm, in order to improve the solubility of CO 2 in the aqueous solution and/or improve the adsorption of CO 2 on the TNT/AuNP catalyst. It is known that alkanolamines, including monoethanolamine, can be employed as good scavengers of CO 2 , due to the formation of carbamate/carbonate 71.However, disadvantages of the use of such solvents include the loss of amine during the process, the formation of corrosive and volatile byproducts, and difficulty of regeneration 71,72.Another way to capture CO 2 is to use ionic liquids (ILs).Blanchard et al. 73 showed, for the first time, that CO 2 is highly soluble in ILs based on imidazolium.ILs have negligible vapor pressures, together with high thermal and chemical stabilities.The mixing of CO 2 with BMIM-BF4 and BMIM-PF6 (1-nbutyl-3-methylimidazolium hexafluorophosphate) showed favorable interactions between CO 2 and the IL anions, acting as Lewis acid and base, respectively 74.Therefore, a good strategy could be the use of an IL to increase the concentration of CO 2 in the aqueous medium, consequently increasing the conversion of CO 2 at the TNT/AuNP catalyst. In this work, two imidazolium-based ILs, BMIM-BF4 and EMIM-DEP, were selected to enhance the solubility of CO 2 in water, in order to increase the CO 2 photoreduction.Fig. 6 shows the generation of methanol and methane in the presence of ILs at 2 v/v, with pressure of 5 atm, using the TNT/AuNP catalyst and the solar simulator.In the absence of an IL (w/o IL), the methanol generation was 151.2 mM, while values of 215.6 and 279.2 mM were obtained in the presence of EMIM-DEP and BMIM-BF4, respectively.It should be noted that in the control experiments performed in the absence of CO 2 and in the presence of IL, no methanol was detected.The generation of methane followed the same profile, with higher generation of methane in the presence of BMIM-BF4 and EMIM-DEP, with values of 98.8 and 81.2 mM, respectively (Fig. 6).In the absence of IL, the generation of methane was only 10.4 mM.It is noteworthy that during the photocatalytic process, in the absence of dissolved CO 2 , the removal of total organic carbon from both ILs was negligible when using the TNT/AuNP catalyst, showing that the ILs were not degraded during the process (Fig. SM7). In order to clarify if the imidazole group present in both IL could be an effective source of carbon for the generation of methanol or methane, a series of control experiments were conducted.When the photocatalysis experiment (TNT/AuNP with 2 v/v of BMIM-BF4 or EMIM-DEP) was carried out in the presence of nitrogen gas (5 atm) (absence of CO 2 ), no trace of methanol or methane was detected, as can be seen in Figure SM8.However, by replacing the nitrogen gas by carbonic gas, well defined peaks of methanol (Tr 2.4 min, (Fig. SM8A)) and methane (Tr 3.47 min) were observed in the chromatograms of Figure SM8B.Therefore, as no methanol and methane were detected from IL purging N 2 , it was confirmed that hydrocarbons were exclusively originate in presence of dissolved CO 2 via photocatalytic reduction. In addition, an in-depth assessment of the origin of products generated during the photocatalytic process was carried out by GC/MS technique using isotope-labeled carbon 13.In experiment performed only in the presence of 2 v/v of BMIM-BF4 there was no methanol generation.In presence of 13 CO 2 , instead, methanol was detected (Tr 1.59 min) as demonstrated by GC/MS total ion chromatogram (Fig. SM9).As shown in mass spectrum presented in Fig. 7A, the peak at m/z 33 can be attributed to 13 CH 3 OH, which is a strong evidence that carbon dioxide is the only carbon source for the generation of methanol.On the other hand, in experiments carried out with a 12 CO 2 source the mass spectrum showed the molecular ion peak at m/z 32 (Fig. 7B). The results clearly showed that the presence of the ILs increased the generation of both methanol and methane, with higher values obtained using BMIM-BF4, compared to EMIM-DEP.These anions significantly influence the absorption of CO 2 , with anions containing the fluorine atom exhibiting higher affinity towards CO 2 43. Sudhir et al. 75 reported the following order of CO 2 solubility, considering the effect of the anion: In other work, the following order of increasing CO 2 solubility was found: Shiflett and Yokozeki 77 reported an approximately 10 molar fraction of CO 2 in pure BMIM-BF4, at a pressure of 0.5 MPa (5 atm) and 298 K.Besides the effect of the anion, cations play a secondary role in CO 2 solubility, with increase of the alkyl chain length causing the CO 2 solubility to increase 75.Therefore, given that BMIM-BF4 possesses a fluorinated anion and has a longer alkyl chain, compared to EMIM-DEP, greater generation of products was expected in the presence of BMIM-BF4. Lin et al. 78 studied the photoreduction of CO 2 to CO under ambient conditions and visible light, in the presence of EMIM-BF4 (1-ethyl-3-methylimidazolium tetrafluoroborate).The reaction was performed in a Schlenk flask, mixing EMIM-BF4/H 2 O, Ru (BPY) 3 (light sensitizer), CoCl 2 AH 2 O (electron mediator), and triethanolamine (electron donor).The CO and H 2 generation rates were 15.5 and 2.1 mM h A1 , respectively.The essential role of EMIM-BF4 was confirmed when the IL was substituted by HBF 4 (tetrafluoroboric acid), which resulted in no products being found.In this case, the IL enhanced the CO 2 reduction, decreasing the potential for CO 2 formation during the redox reaction.The use of CO 2saturated ILs as a strategy to increase CO 2 solubility was shown by molecular dynamics simulations 79.According to the literature, the solubility of CO 2 in an IL is not due to direct CO 2 -ion interactions, but instead to a strong correlation between the ratio of unoccupied space in the IL and its ability to absorb CO 2 . The effect of the BMIM-BF4 percentage (v/v) in water was studied for CO 2 photoreduction using the TNT/AuNP catalyst, under 5 atm pressure and solar simulator irradiation (Fig. 6).As mentioned above, in the absence of BMIM-BF4, the methanol generation was 151.2 mM.When the percentage of BMIM-BF4 was increased from 1 to 4, the methanol generation increased from 186.8 to 320.8 mM and methane from 67.6 to 159.2 mM, respectively.This was due to the higher proportion of the IL in water and the greater solubility of CO 2 .Table SM1 shows the consumption of Na 2 SO 3 in the presence of the ILs, with the highest consumption (80.4) observed in the presence of 4 v/v of BMIM-BF4. Quantum yield measurements gives important knowledge about the efficiency of photocatalytic reactions.Potassium ferrioxalate was used as chemical actinometer to determine the number of incident photons employed to drive the photocatalytic CO 2 reduction 80.The absorbed photon flux (N) in the systems was estimated using Equation (2). where N is the photon flux (Einstein s A1 ), nFe 2 is the number of moles of Fe 2 generated after irradiation, / is the quantum yield and t is the irradiation time (s).The quantum yield of CO 2 photo-conversion was calculated during the best catalytic condition, using TNT/AuNP catalyst with 4 v/v of BMIM-BF4 at 5 atm pressure.The Equations ( 3) and (4) represents the methanol and methane conversion, when six and eight electrons are required to convert CO 2 to CH 3 OH or CH 4 , respectively. A 100 The fluxes of absorbed photons were 1.5 A 10 A6 Einstein s A1 (Fig. SM10), using the solar simulator system as irradiation source.The quantum yield calculated based on the average peak production rates for methanol and methane generation over TNT/AuNP catalyst was 0.60 and 0.52, respectively, and total quantum yield was 1.12 at 440 nm for CO 2 photocatalytic reduction.The performance of 0.5 Au NPs incorporated on TiO 2 nanowires was evaluated during the CO 2 photoreduction into CO, methane and methanol, with quantum yields of 0.283, 0.012 and 0.010 (total quantum yield 0.305), in the absence of pressure and IL 63.NPs composed of an alloy of Au and Ag and supported on TiO 2 nanowires showed a synergistic effect in the localized SPR excitation using visible light, increasing the photoreduction of CO 2 to CO with selectivity of 97.7 and quantum yield of 0.11 32.In another case, gold-TiO 2 composite was used during the photocatalytic reduction of bicarbonate, using glycerol as hole scavenger, with 2.4 of apparent quantum efficiency for formate production at 365 nm irradiation 64.However, in this case, there was a synergism between CO 2 photoreduction and glycerol oxidation that enhanced the acid generation and probably enhanced the quantum yield. Based on the Yu and Jain 46 findings, the complexation of CO 2 by the cationic part of IL containing the imidazole group promotes a restructuring of the CO 2 moiety for electron acceptance.Therefore, the addition of 1 e -to the complex generated BMIM-CO 2 (Eq.5-6) is far more favorable as compared with the addition of 1 e A directly to CO 2 molecule.The authors reported that the higher the concentration of the activated EMIM-CO 2 complex, the greater is the rate of CO 2 conversion, with the most optimal performance achieved at 5 mol EMIM-BF4. The findings indicated that different synergic effects amplify the photoreduction of dissolved CO 2 to products in aqueous medium, as represented in Fig. 8.Under solar irradiation (UV portion), the photogenerated electrons on TiO 2 are produced and are trapped by the gold NPs, because the Fermi energy levels of noble metals are typically lower than that of titania.In this case, the nanoparticles are as smaller as 10 nm, which have a narrow band gap and are photoexcited after absorbing visible light.Hence, there is a higher driving force of electron transfer from the Au NPs to the TiO 2 conduction band.In addition, the Au NPs could act as co-catalysts by providing active sites for the adsorption and activation of CO 2 .Therefore, these two effects of Au enhance the CO 2 photoreduction.The process is favored because this electron transfer facilitates the separation of charge carriers, so more electrons are available to reduce the CO 2 adsorbed at the co-catalyst.Simultaneously, the holes photogenerated in the TiO 2 under UV irradiation (part of the solar simulator emission) are consumed by the sulfite hole scavenger, which retards recombination of the e A /h pairs."
  },
  {
    "title": "Conclusions",
    "content": "The findings of this work constitute the first demonstration of photocatalytic reduction of CO 2 to methanol and methane, with high efficiency, using TiO 2 modified by gold nanoparticles, a high-pressured reactor, and aqueous solution containing ionic liquid at a low ratio (up to 4 v/v), under solar simulator irradiation.The gold nanoparticles were deposited according to a simple and green method, using Persian lime as a citric acid source.The use of a pressure of around 5 atm, together with up to 4 (v/v) of BMIM-BF4 in the solution, increased the solubility of CO 2 in the bulk solution and/or the adsorption of CO 2 onto the TNT/AuNP catalyst surface, achieving production of 320.8 and 159.2 mM of methanol and methane, with 0.60 and 0.52 quantum yield at 440 nm, respectively.The use of imidazolium-based cations (BMIM) with long alkyl chain lengths and BF4 as the hydrophobic anion, with different sizes and weak ion cohesion, favored the accommodation of CO 2 on the structure, consequently improving the performance of the catalyst in the process of CO 2 reduction. Fig. 1.FEG-SEM images of the TNT (A) and TNT/AuNP (B) catalysts.(C) EDS elemental mapping obtained from FEG-SEM analysis in the selected region of the TNT/AuNP catalyst.(D) TEM image of TNT/AuNP catalyst.(E) Particle size distribution histograms of Au NPs over TNT. Fig. 2. (A) EDS spectra, (B) XRD diffractograms, (C) Raman spectra, and (D) IR spectra for the TNT and TNT/AuNP catalysts.(1) TNT and (2) TNT/AuNP catalysts. Fig. 3. (A) Au4f, (B) Ti2p, (C) O1s and (D) C1s XPS spectra for the TNT/AuNP catalyst. Fig. 4. (A) UV-Vis absorption spectra of the TNT (1) and TNT/AuNP (2) catalysts.(B) Tauc plots showing the band gaps of the TNT (1) and TNT/AuNP (2) catalysts. Fig. 5. (A) Effect of catalyst type on CO 2 photocatalytic reduction during 180 min at 1 atm pressure, using the TNT and TNT/AuNP catalysts.(B) Effect of initial pressure on CO 2 photocatalytic reduction during 180 min using the TNT/AuNP catalyst.Na 2 SO 3 1 g L A1 ; solar simulator light source. Fig. 6.Effect of the presence of EMIM-DEP (2 v/v) and BMIM-BF4 (1-4 v/v) on the photocatalytic reduction of CO 2 carried out during 180 min at 5 atm pressure, using the TNT/AuNP catalyst.Na 2 SO 3 1 g L A1 ; solar simulator light source; w/o IL: without ionic liquid. Fig.7.Mass spectra of methanol generated after 180 min photocatalytic reduction of (A)13 CO 2 or (B)12 CO 2 , using the TNT/AuNP catalyst.Na 2 SO 3 1 g L A1 ; BMIM-BF4 2 v/v; solar simulator light source. Fig. 8. Representation of electron transfer from the Au NPs into the TiO 2 nanotubes, reduction of CO 2 to methanol, and capture of holes by sulfite. Joao Angelo Lima Perini, K. Irikura, Lilian D. Moura Torquato et al.Journal of Catalysis 405 (2022) 588-600 The authors are grateful to FAPESP (grant number 2014/50945-4) and CNPq (grant number 465571/2014-0) for support of this work.J.A.L. Perini, K. Irikura, and L.D.M. Torquato received scholarships from FAPESP (grant numbers 2014/50945-4, 2016/18057-7, 2017/12790-7, and 2019/00463-7).J.B.S. Flor received scholarships from CNPq (grant number 465571/2014-0, and 168961/2017-2).The authors would like to thank Professor Edenir R.P. Filho for the ICP-OES analyses. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://doi.org/10.1016/j.jcat.2021.11.007."
  }
]