[
  {
    "title": "Doi",
    "content": "10.1016/j.apsusc.2017.05.117"
  },
  {
    "title": "Article_Title",
    "content": "Photo-induced CO2 reduction by CH4/H2O to fuels over Cu-modified g-C3N4 nanorods under simulated solar energy"
  },
  {
    "title": "Abstract",
    "content": "Copper modified polymeric graphitic carbon nitride (Cu/g-C 3 N 4 ) nanorods for photo-induced CO 2 conversion with methane (CH 4 ) and water (H 2 O) as reducing system under simulated solar energy has been investigated.The nanocatalysts, synthesized by pyrolysis and sonication, were characterized by XRD, FTIR, Raman analysis, XPS, SEM, N 2 adsorption-desorption and PL spectroscopy.The presence of Cu 2 ions over the g-C 3 N 4 structure inhibited charge carriers recombination process.The results indicated that photoactivity and selectivity of Cu/g-C 3 N 4 photo-catalyst for CO 2 reduction greatly dependent on the type of CO 2 -reduction system.CO 2 was efficiently converted to CH 4 and CH 3 OH with traces of C 2 H 4 and C 2 H 6 hydrocarbons in the CO 2 -water system.The yield of the main product, CH 4 over 3 wt.Cu/g-C 3 N 4 was 109 mole g-cata.-1 h -1 under visible light irradiation, significantly higher than the pure g-C 3 N 4 catalyst (60 mole/g.cat).In photo-induced CO 2 -CH 4 reaction, CO and H 2 were detected as the main products with smaller amount of hydrocarbons.The highest efficiency was detected over 3 wt.Cu-loading of g-C 3 N 4 and at optimal CH 4 /CO 2 feed ratio of 1.0.The maximum yield of CO and H 2 detected were 142 and 76 mole g-catal.-1 h -1 , respectively at selectivity 66.6 and 32.5, respectively.Significantly enhanced CO 2 /CH 4 reduction over Cu/g-C 3 N 4 was attributed to its polymeric structure with efficient charge transfer property and inhibited charges recombination rate.A proposed photo-induced reaction mechanism, corroborated with the experimental data, was also deliberated."
  },
  {
    "title": "Experimental",
    "content": "All reagents used for the preparation of catalyst were of analytical grade and used as received without additional purification.The scheme for the preparation of polymeric g-C 3 N 4 and Cu-modified g-C 3 N 4 is shown in Fig. 1.The g-C 3 N 4 was prepared by thermal treatment of melamine using alumina crucible.Typically, 5 g of melamine precursor (Sigma Aldrich AR 99) was put in a crucible with cover and heated to 550 C for 2 h at 10 C/min heating rate in a Muffle Furnace.Finally, a light yellow bulk powder consisting of polymeric g-C 3 N 4 was obtained and grounded to fine powder.Next, samples were sonicated for 60 min with nitric acid (0.1 M), magnetically stirred for 24 h and finally washed with distilled water to remove any adsorbed residual alkaline species on the sample surface (e.g.ammonia).After this, it was dried at 80 C for 12 h under air flow.Cu-loaded g-C 3 N 4 were prepared using sonicated assisted wet-impregnation method.Briefly, 0.5 g of g-C 3 N 4 powder was dispersed in 50 mL methanol.After 60 min sonication, a certain amounts of Cu (NO 3 ) 2 3H 2 O precursor solution was added dropwise into the sample and stirred for 12 h before sonication to get Cu-promoted g-C 3 N 4 catalyst.The samples were then oven dried at 80 C overnight and stored in air tight sampling bottles. X-ray diffraction (XRD) patterns were recorded on a powder diffractometer Bruker Advance D8 with Cu K irradiation source ( 0.154 nm) at 40 kV and 40 mA with scan range of 2 5-60 , step size 0.05 and counting time 5s.Fourier transform infrared (FTIR) spectroscopy was performed using Thermo Nicolet Avatar 360 FTIR spectrometer.The morphology and structure of the samples was inspected on a field emission scanning electron microscopy (FESEM JEOL model JSM-6700F, Japan).N 2 adsorption-desorption isotherms were measured at 77 K on Micrometrics ASAP 2020 after the samples were degassed at 250 C for 4 h.An investigation of surface component elemental state was analysed using X-ray photoelectron spectroscopy (XPS, Axis Ultra DLD Shimadzu) and C1s signal at 284.60 eV was used as the internal standard to calibrate binding energies.Ultraviolet-visible (UV-vis) diffuse reflectance absorbance spectra were carried out on a Cary 100 Agilent UV-vis spectrophotometer equipped with an integrated sphere in the wavelength range of 200-800 nm.Raman spectroscopy was performed using a model Lab RAM HR Evolution (HORIBA) Raman Spectrometer with a 532 nm emitting laser as an excitation source.Similarly photoluminescence (PL) measurements of the samples were acquired using Raman Spectrometer at room temperature and excitation wavelength 325 nm. Photocatalytic CO 2 reduction using CH 4 and H 2 O reductants was carried out in a stainless steel photoreactor as shown in Fig. 2. The reactor consists of cylindrical vessel with a length of 5.5 cm and total volume of 150 cm 3 , equipped with a quartz window for passing light irradiations.The source of light irradiation was a simulated sunlight using a solar simulator LCS-100 (Newport) integrated with UV-cut filters with light intensity equal to one solar spectrum.The solar simulator was located at the top of the reactor equipped with a quartz window of 8 mm thickness for passing of light irradiations.In the CO 2 reduction system, 15 mg powder photo-catalyst was evenly dispersed inside the reactor chamber at the bottom surface.Before irradiation, the reactor was thoroughly purged using helium gas. Mass flow controllers (MFC) were used to regulate compressed CO 2 and CH 4 gases (purity 99.999) retained in gas tanks.In the case of CO 2 reduction with H 2 O, CO 2 with flow rate 20 mL/min was continuously passed through the water bubbler to carry moisture.The mixture of gases (CO 2 , H 2 O) flowing through the water saturator was passed through the reactor for 30 min before starting experiments to purge and saturate the catalyst.Thereafter, gauge pressure inside the photo reactor was raised up to 0.20 bar by closing outlet valve and batch experiment started by turning on the solar simulator.On the other hand, in photo-induced CO 2 reduction with CH 4 experiments, a total flow rate of 40 mL/min was regulated into the reactor for the gases (CO 2 and CH 4 ) with molar feed ratio CH 4 /CO 2 1.0 for 30 min to purge and saturate the catalyst.Similarly, as discussed above, the outlet valve was closed and gauge pressure inside the photo reactor increased to 0.20 bar, then the inlet valve was closed for the batch experiment study.The experiments were conducted at different CH 4 /CO 2 molar feed ratios e.g., 0.5, 1.0, 1.5 and 2.0 by varying the CH 4 feed flow rates of 10-40 mL/min at fixed CO 2 feed flow rate of 20 mL/min.The temperature of the reactor was controlled with temperature controller and pressure was measured using pressure gauge. On-line gas chromatograph (GC-Agilent Technologies 6890 N, USA) was used to quantify reaction products.The GC was equipped with thermal conductivity detector (TCD) and a flame ionized detector (FID).Besides, HP-PLOT Q capillary column (Agilent, length 30 m, ID 0.53 mm, film 40 m) connected with FID detector was used for the separation of C 1 -C 6 paraffin and olefins hydrocarbons, alcohols and oxygenated compounds.Similarly, Porapak Q and Mol Sieve 5A columns connected to TCD detector were used for the analysis of CH 4 , CO and H 2 compounds."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The XRD patterns of the pure g-C 3 N 4 and Cu-modified g-C 3 N 4 samples are presented in Fig. 3(a).Two peaks centered at 13 and 28 are clearly observed for both the pure g-C 3 N 4 and Cu/g-C 3 N 4 samples corresponds to the (100) and (002) plans (JCPDS 87-1526).The less intense peak at 13 is due to intra-planar reflection, whereas peak at 28 attributes to graphitic like interlayer stacked of aromatic system.The peaks pertaining to copper are not detected in all the XRD patterns, perhaps, due to the lower Cu-contents, below the equipment detection limit or most of the copper species are coordinated directly to g-C 3 N 4 structure 57.The Raman spectra of the pure g-C 3 N 4 and Cu-modified g-C 3 N 4 are presented in Fig. 3(b).In both the samples, several characteristics peaks located at 307, 481, 705, 768, 981, 1117, 1255, 1477and 1624 cm -1 are detected, indicating the formation of polymeric structure of g-C 3 N 4 58. Fig. 4 exhibits the morphology of pure and Cu-modified g-C 3 N 4 samples.From Fig. 4(a), it is evident that g-C 3 N 4 layers have obvious lamellar and irregular folding structures like nanorods, in which layers are stacked together due to sonication and stirring for elongated time.Fig. 4(b) depicts nanorods of 3 Cu/g-C 3 N 4 sample, with controlled structure.The successful formation of g-C 3 N 4 nanorods with uniform Cu-dispersion is possibly due to effective stirring and sonication during metal impregnation of Cu/g-C 3 N 4 sample.The existence of Cu on g-C 3 N 4 structure is confirmed by EDX analysis as depicted in Fig. 4(c).The Cu contents of 0.52, 1.40 and 2.34 wt. are identified in 1, 3 and 5 wt.Cu-modified g-C 3 N 4 /TiO 2 samples. XPS analysis is performed to determine the chemistry of the atoms in the composite catalyst of Cu-loaded g-C 3 N 4 sample and the results are shown in Fig. 5. From Fig. 5(a) the peaks of N1s can be marked at 398.22 eV and 400.63 eV.The former peak is assigned to the C N C while the latter is assigned to the C NH 2 from the precursor of g-C 3 N 4 , respectively.The peaks of C1 s as seen in Fig. 5(b) are observed at 284.60 eV and 288.01 eV.The peak at 288.01 eV ascribed to the N C N functional group present in graphitic carbon nitride.The other peak at 284.60 eV corresponds to C C, typically identified as surface carbon from the instrument 34.Fig. 5(c) depicts peaks of Cu 2p 3/2 and Cu 2p 1/2 centred at 936.12 eV and 957.05 eV, respectively, with binding energy difference of 20.93 eV, attributed to the presence of copper as Cu 2 chemical state 57.More over the shake-up satellite peaks of the Cu2p 3/2 and Cu2p 1/2 with binding energies 946.18 eV and 965.25 eV, respectively, confirmed the formation of CuO over the g-C 3 N 4 surface 59. FTIR analysis is conducted to evaluate the chemical structure of the elements in the samples as depicted in Fig. 6.Three main absorption regions in the FTIR spectra can be identified and similar observations have been reported recently 55.The broad peak at 3155 cm -1 is attributed to the stretching vibration of N H and surface absorbed water molecules.The N H stretches of the heterocyclic amines present in the g-C 3 N 4 structure are identified by the bands at 1220-1543 cm -1 .The band located at 1623 cm -1 can be attributed to the stretching vibration band of the C N of amines in g-C 3 N 4 .The absorption bands at 801 and 880 cm -1 are associated with the bending nodes of the parent structure of g-C 3 N 4 in both the samples 60.These observations have confirmed that modification of g-C 3 N 4 with Cu did not influence its structure. The BET surface areas of polymeric g-C 3 N 4 and Cu-modified g-C 3 N 4 are determined by nitrogen adsorption isotherms.The adsorption-desorption isotherms of g-C 3 N 4 and the Cu-modified g-C 3 N 4 samples are presented in Fig. 7.The existence of mesoporous structure in the catalyst samples is verified by the curves of isotherms classified as type IV with H3 hysteresis loops.The specific surface areas and pore volumes of all the samples are calcu- lated as tabulated in Table 1.Obviously, there is only a small change in the surface area and pore volume of Cu-modified g-C 3 N 4 compared with the pure g-C 3 N 4 sample.These observations agree well with the previous work 34.The introduction of copper renders no change in the microstructure of g-C 3 N 4 .Therefore, the increment in CO 2 reduction over Cu/g-C 3 N 4 would probably be due to hindered charges recombination rate by copper.UV-vis diffuse reflectance absorbance spectra of the pure g-C 3 N 4 and Cu-modified g-C 3 N 4 samples are shown in Fig. 8(a).Compared with pure g-C 3 N 4 , optical absorbance of Cu-modified g-C 3 N 4 sample increases in the visible region.The band gap energy is calculated according to the plot of (hv) 2 versus photon energy (eV) as depicted in Fig. 8(b).The band gap of g-C 3 N 4 is determined to be 2.70 eV, which is consistent with the previous results 60.The band gap of Cu-modified g-C 3 N 4 is 2.67 eV, which is closer to the band gap of the pure g-C 3 N 4 .Accordingly, Cu has no significant effect on the band gap of g-C 3 N 4 but it could enhance g-C 3 N 4 photo-activity by preventing charges recombination rate. PL spectra is measured to examine insights into the electronhole recombination rate in the pure g-C 3 N 4 and Cu-loaded g-C 3 N 4 samples.Fig. 9 presents PL spectra of the pure and Cu-loaded g-C 3 N 4 samples with an excitation wavelength of 325 nm.Noticeably, PL emission intensity for the Cu/g-C 3 N 4 photo-catalyst is lower than the pure g-C 3 N 4 sample, suggesting a decrease in the charge carrier density or reticence of the charge carrier's recombination process in Cu-modified g-C 3 N 4 sample.Similar observation has been reported previously 46. Before photocatalytic CO 2 reduction experiments, quality control analysis were conducted to confirm products originated during photo-reduction of CO 2 /CH 4 only.All the catalysts were tested in gas phase system for 2 h using high purity helium and no carbon containing compounds were detected by the catalyst samples under simulated solar energy.Therefore, all the products in the experiments must be produced from CO 2 by CH 4 /H 2 O reductants through photocatalytic reaction.Furthermore, initially experiments were conducted using water as a reducing agent to understand the role of Cu in g-C 3 N 4 photo-catalyst.Next photoinduced reactions of CO 2 -CH 4 system over different Cu-loading g-C 3 N 4 photo-catalyst under visible light irradiations were critically discussed. The effects of Cu loading on the activity of g-C 3 N 4 for CO 2 reduction with H 2 O to CH 4 and CH 3 OH under visible light irradiations are presented in Fig. 10(a).With pure g-C 3 N 4 , the yield of CH 4 is lower, but gradually increases with Cu loading until it attained an optimum yield at 3 wt.Cu.With increasing Cu loading the yield decreases gradually.This can be attributed to higher rates of charge recombination centres, resulting in reduced photo-activity.The effectiveness of Cu-loading is much appreciable for CH 4 production than CH 3 OH.These observations revealed that Cu-loading to the pure catalyst (g-C 3 N 4 ) makes it very efficient for CH 4 production.This is evidently due to hindered recombination rate of electron and hole pairs by Cu.Fig. 10(b) depicts the effects of Cu onto g-C 3 N 4 performance for CO 2 photo-reduction to hydrocarbons (C 2 H 4 and C 2 H 6 ).Obviously, hydrocarbons are detected over all types of photo-catalysts.However, Cu-loaded g-C 3 H 4 deliberates much considerable effect of hydrocarbons production due to more trapping and transport of electrons over Cu/g-C 3 N 4 structure.Among the hydrocarbons, the yield of C 2 H 6 is much higher compared to C 2 H 4 and similar observation could be seen in all type of samples.This development confirms Cu-loaded g-C 3 N 4 as a constructive approach for visible light responsive CO 2 reduction with H 2 O to CH 4 , CH 3 OH and hydrocarbons. Since the reduction potential of CO 2 /CH 3 OH (-0.38 V) and CO 2 /CH 4 (-0.24V) are less than the conductance band of g-C 3 N 4 (-1.23 V), formation of these products are feasible.As discussed previously, g-C 3 N 4 is favourable for CH 3 OH production but Cu has proven to be the preferred metal in the photo-reduction of CO 2 to CH 4 as it demonstrates some level of selectivity for CH 4 production.This significant improvement in the photoactivity of g-C 3 N 4 photo-catalysts can be ascribed to charge transfer property and inhibited charges recombination process by Cu-metal.To sum up, Cu-metal loaded into g-C 3 N 4 enhances CO 2 reduction efficiency for CH 4 production while the pure g-C 3 N 4 is promising for both CH 4 and CH 3 OH production. The performance of Cu-loaded g-C 3 N 4 photo-catalyst was further investigated using CO 2 -CH 4 system under the same operating conditions.The effects of Cu loading on the activity of g-C 3 N 4 for CO 2 reduction with CH 4 to CO and H 2 is presented in Fig. 11(a).Using all types of photo-catalysts, CO and H 2 are detected as the main products compared to CO 2 -H 2 O system in which CH 4 and CH 3 OH are the main products.The photocatalytic activity of pure g-C 3 N 4 catalyst registers smaller amount of CO and H 2 , which gradually improves with Cu-loading up to the optimal 3 wt.Cu.The yields of CO and H 2 gradually decrease as the Cu-loading increases from 3 to 5 wt..The decrease in photo-activity at higher Culoading is probably due to the formation of charges recombination centres over the g-C 3 N 4 surface.Thus, the amount of Cu species in the structure of g-C 3 N 4 plays an important role in the photocatalytic performance of catalyst 57. The effects of Cu-loading onto g-C 3 N 4 performance for CO 2 photo-reduction with CH 4 to hydrocarbons is shown in Fig. 11(b).The production of hydrocarbons such as C 2 H 4 , C 2 H 6 , C 3 H 6 and C 3 H 8 could be seen over all types of photo-catalysts.Using pure g-C 3 N 4 sample, C 3 H 8 is detected in appreciable amount, yet Cu-loaded g-C 3 N 4 samples favours production of C 2 H 6 .Higher hydrocarbons (C 2 H 6 and C 3 H 8 ) are detected over all types of Cu-loaded g-C 3 N 4 photo-catalysts with marginal effects conferred by 1 wt.Cu-loading.The result indicates that the loading of pure catalyst (g-C 3 N 4 ) with Cu metal becomes more efficient for C 2 H 6 production, evidently due to hindered recombination rate of electron and hole pairs and ultimately increases the product yield.This development confirms Cu-loaded g-C 3 N 4 as a favourable photo-catalyst for CO, H 2 and hydrocarbons production during CO 2 photo reduction with CH 4 . In order to further investigate the relationship between the structural characteristics and photocatalytic performances, the effect of CH 4 /CO 2 feed ratio on the activity and selectivity of Cu/g-C 3 N 4 catalyst is investigated.The effect of initial CH 4 /CO 2 molar feed ratio on the photo-activity of Cu/g-C 3 N 4 for CO 2 reduction to different products is demonstrated in Fig. 12(a).Using CH 4 /CO 2 feed ratio of 1.0, the amounts of CO and H 2 produced are the highest.On the other hand, the yield of C 2 H 6 constantly increases with the increase of CH 4 concentration over the catalyst surface at higher CH 4 /CO 2 feed ratios.The selectivity of H 2 and C 2 H 6 relatively increases with larger concentration of CH 4 adsorbed over the Cu/g-C 3 N 4 surface at higher CH 4 /CO 2 feed ratios as depicted in Fig. 12(b).However, after using higher or lower CH 4 /CO 2 feed ratios than the optimum value, the production of CO and H 2 decreases.At lower CH 4/ CO 2 feed ratio (0.50), there is less concentration of CH 4 present over the catalyst surface to react with CO 2 , thus photo-activity deteriorates.Contrariwise, at much higher feed ratio (higher CH 4 concentration), the slower reduction rate is probably due to the catalyst surface saturated with CH 4 and consequently adsorbed CH 4 molecules have to compete to react with CO 2 molecules.Therefore, an optimum concentration of both the reactants (CO 2 and CH 4 ) is critical to render photo-catalyst at its highest activity and to obtain maximum yield rates of products.Previously, we reported similar trends during photocatalytic CO 2 reduction with H 2 O vapours 61. The photocatalytic reduction of CO 2 with CH 4 over 3 Culoaded g-C 3 N 4 nanorods at CH 4 /CO 2 feed ratio of 1.0 at different irradiation times is presented in Fig. 13.The yields of all the products increase initially and much higher activity is detected for CO evolution.However, H 2 yield reaches steady-state after 3 h of irradiation time and then the yield rate gradually decreases.Among the hydrocarbons, C 2 H 6 yield is appreciable and its production is continuous over the entire reaction time.The mesoporous structure of g-C 3 N 4 within the sample promoted by Cu probably contributes to the enhanced photo-activity and selectivity of products.Therefore, efficient reduction of both stable molecules (CO 2 and CH 4 ) at normal operating conditions under simulated solar energy can be attributed to effective utilization of visible light, hindered recombination rate of photo-generated electron-hole pairs and adsorption of reactants over photo-catalyst mesoporous structure.The photo-activity and selectivity of g-C 3 N 4 and Cu-modified g-C 3 N 4 photo-catalysts for CO 2 reduction to fuels has been investigated under different reducing systems and the results are presented in Table 2. Using CO 2 -H 2 O system, CO 2 is efficiently converted to CH 4 and CH 3 OH with smaller amounts of C 2 H 4 and C 2 H 6 hydrocarbons.The yield of CH 4 evolution as the main product over 3 wt.Cu/g-C 3 N 4 is 109 mole g cat -1 h -1 under visible light irradiation, significantly higher than the amount of CH 4 produced over the pure g-C 3 N 4 catalyst (60 mole g cat -1 h -1 ).Similarly, the yield of CH 3 OH over Cu-promoted g-C 3 N 4 is 20 mole g cat -1 h -, lesser than the amount produced over pure g-C 3 N 4 (23 mole g cat -1 h -1 ).The selectivity of CH 4 yield over g-C 3 N 4 is 71.38, increases to 83.12.This development confirms that pure g-C 3 N 4 promotes the production of CH 3 OH, but Cu-loaded g-C 3 N 4 enhances yield and selectivity toward CH 4 production. In the case of CO 2 -CH 4 system, yield of CO over Cu-modified g-C 3 N 4 is 142 mole g-catal. - h -1 , 1.33 times more than using pure g-C 3 N 4. The production of H 2 detected over Cu/g-C 3 N 4 is 76 mole g-catal. - h -1 , 1.85 times higher than the amount of H 2 produced over pure g-C 3 N 4 photo-catalyst.The selectivity of CO over g-C 3 N 4 is 68.7, decreases to 66.6 over Cu-g-C 3 N 4 photocatalyst.However, H 2 selectivity increases from 26.5 to 32.5 using Cu-modified g-C 3 N 4 photo-catalyst compared to pure g-C 3 N 4 .It is remarkable to see that the Cu-promoted g-C 3 N 4 is favourable for the production of H 2 to achieve H 2 /CO of 1.0 which is important in the production of liquid fuels (e.g.methanol).However, ratio of H 2 /CO is less than one, perhaps, due to favourable reverse water gas shift (RWGS) reaction for CO production as discussed in our previous work 8,62,63.On the other hand, decreased in CO selectivity over Cu/g-C 3 N 4 catalyst was probably due to more production of electrons, resulting in promoting water gas shift (WGS) reaction.However, further investigations are required to understand CO 2 -CH 4 reaction system under simulated solar energy. By comparing the performance of Cu-modified g-C 3 N 4 photocatalyst, it is evident that CH 4 is detected as the main products in CO 2 -H 2 O system, while synthesis gas (CO and H 2 ) is produced in the CO 2 -CH 4 system.The total yield of all the products produced in the presence of CO 2 -water system is 131 mole g-catal. - h -1 , while the amounts of products in the presence of CO 2 -methane system reaches to 220 mole g-catal. - h -1 .These observations 20.The main products detected were CO and H 2 but in traces amount although high temperature (400-700 C) was employed.Recently, photocatalytic transformation of CO 2 -CH 4 system was investigated in the presence of titanium nanotubes (TNTs) modified by gold and rhodium.The main products detected were CO and H 2 using cell type photo-reactor at high temperature 19.Although, in previous reports, reaction was conducted at elevated temperature, the yield rate reported was not much appreciable.In addition, smaller amount of H 2 was reported compared to CO production.However, in current study, CO 2 -CH 4 is efficiently converted to both CO and H 2 at normal temperature under simulated solar energy.This can be attributed to the polymeric structure of g-C 3 N 4 and hindered charges recombination rate by Cu. The multi-step reaction pathway of the process splits into three parts: the formation of the CO 2 and CH 4 radical, water splitting and formation of CO, H 2 , CH 3 OH and hydrocarbons.The feasible reaction pathway for this process is given by reactions in Eqs. ( 1)- (11). CO 2 e -CO - In the case of visible light irradiations, the photo-generated electrons and holes are produced over g-C 3 N 4 photo-catalyst.Eqs. (1) and (2) reveal photo-excited electron-hole pair production and their trapping by Cu-metal, resulting in prolonged lifetime of charges to precede oxidation and reduction process.The holes are used for oxidation of H 2 O and CH 4 while electrons are consumed by CO 2 for its reduction as explained in Eqs.(3)- (5).Reactions in Eqs. ( 6) and ( 7) divulged production of C 2 H 6 and H 2 through oxidation of methane.The multiple reactions in Eqs. ( 8)-( 11) divulge the production of CH 4 , CH 3 OH and hydrocarbons through utilization of H ions and electrons in multi-step process via CO 2 reduction.The photocatalytic activity is related to the band structure and the mechanism for the production of these products over Cu/g-C 3 N 4 photo catalyst is explained in Fig. 14.Under the light irradiations, VB electrons of g-C 3 N 4 can transfer to Cu-metal, which causes electron-hole pair separation.This is due to the possibility of electron trapping by the copper ions as a result of the difference in reduction potential of Cu 2 which is more positive than the conduction band edge of g-C 3 N 4 (-1.23 V vs. NHE).Therefore, significantly enhanced photo-activity over Cu-promoted g-C 3 N 4 photo-catalyst was due to hindered charges recombination rate with their mobility over g-C 3 N 4 polymeric structure under visible light irradiations."
  },
  {
    "title": "Conclusions",
    "content": "Cu-loaded g-C 3 N 4 nanorods are developed for gas phase photocatalytic CO 2 reduction by CH 4 and H 2 O under visible light irradiation.Using CO 2 -H 2 O system, the rate of CO 2 reduction increases significantly over Cu-loaded g-C 3 N 4 catalyst.The yield rate of CH 4 as the key product over Cu/g-C 3 N 4 is increased significantly, which is 1.82 fold higher compares with pure g-C 3 N 4 photo Fig. 1.Schematics for the preparation of polymeric g-C3N4 and Cu-modified g-C3N4 catalysts. Fig. 2. Schematic presentation of experimental setup for photocatalytic CO2 reduction with CH4 and H2O as reductants under simulated solar energy. Fig. 4. SEM images of g-C3N4 and 3 Cu-loaded g-C3N4 samples; (a) SEM image of g-C3N4, (b) SEM image of 3 Cu/g-C3N4 and (c) EDX analysis of Cu-modified g-C3N4 sample. Fig. 5. XPS analysis of 3 Cu-modified g-C3N4 sample: (a) N1s, (b) C1s, (c) Cu2p. Fig.6.FTIR spectra of the g-C3N4 and 3 Cu-modified g-C3N4 samples. Fig. 8. (a) UV-vis absorbance spectra of g-C3N4 and Cu-modified g-C3N4 samples, (b) band gap energy calculation of corresponding samples. Fig. 9. Comparison of photoluminescence (PL) spectra of pure g-C3N4 and 3 Cumodified g-C3N4 samples. Fig. 10.Photo reduction of CO2 to CO, CH3OH and hydrocarbons using H2O reductant over Cu-loaded g-C3N4: (a) Yield of CO and CH3OH production, (b) Yield of hydrocarbons production. Fig. 11.Photocatalytic CO2 reduction with CH4 over Cu-loaded g-C3N4 at CO2/CH4 feed ratio 1.0, temperature 100 C and irradiation time 2 h: (a) Production of CO and H2, (b) Production of hydrocarbons. Fig. 12.Effect of feed ratio on the photo activity of Cu-modified g-C3N4 photo catalyst; (a) yield of products, (b) selectivity of products. Fig.13.Effect of reaction time on the photo activity of 3 Cu-modified g-C3N4 photo catalyst in CO2-CH4 reaction system at 100 C and CH4/CO2 molar ratio of 1.0. Performance analysis of Cu/g-C 3 N 4 catalyst using CH 4 or H 2 O reductants Fig. 14.Schematic presentation of photocatalytic CO2 reduction with H2O/CH4 over Cu-loaded g-C3N4 photocatalyst under simulated solar energy irradiations. The summary of surface area and pore volume of g-C3N4 and Cu-modified g-C3N4 samples. Summary of yield rate and selectivity for photocatalytic CO2 reduction with CH4 and H2O to cleaner fuels under simulated solar energy.thatCu-promoted g-C 3 N 4 photo-catalysts is more efficient for selective photocatalytic CO 2 reforming of CH 4 towards synthesis gas production under simulated solar energy.In order to examine the performance of Cu-modified g-C 3 N 4 catalyst for photo-induced CO 2 -CH 4 conversion under simulated solar energy, the results are further compared with the work reported by many researchers as presented in Table 3.The single step photoreduction of CO 2 and CH 4 over semiconductor Cu/CdS-TiO 2 /SiO 2 catalyst was performed at temperature range of 30-150 C. The products detected were CH 3 COOH, CH 3 CH 3 , CH 3 OCH 3 and CO with very low conversion 17.The photo-reduction of CO 2 with CH 4 was reported with production of CO and H 2 in smaller amounts over Ga 2 O 3 photo-catalyst.The other products detected in traces amount were C 2 H 4 , C 2 H 6 , C 3 H 6 and C 3 H 8 at elevated reaction temperature (314-674 K) 64.Similarly, visible light responsive CO 2 reforming of CH 4 has been reported over Pt-loaded TiO 2 catalyst a Products obtained were from CO2-H2O system.b Products obtained were from CO2-CH4 system.reveals 6H 6e -CH 3 OH H 2 O (8) CO 2 8H 8e -CH 4 2H 2 O (9) 2CO 2 12H 12e -C 2 H 4 4H 2 O(10)2CO 2 14H 14e -C 2 H 6 4H 2 O (11) We would like to express our sincere gratitude to the Ministry of Higher Education (MOHE), Malaysia for the financial support of this work made available through the Nanomite Long Term Research Grant Scheme (Nanomite LRGS) Project Vot 4L839. Additional products like CH3CH3 and CO are also produced at lower and higher temperatures.All products were in traces amounts 17 catalyst.Besides, significant amount of CH 3 OH with appreciable amounts of C 2 hydrocarbons are detected in the product mixture. On the other hand, using CO 2 -CH 4 system, CO and H 2 are detected as the main products over g-C 3 N 4 and Cu-modified g-C 3 N 4 photocatalysts.The effect of CH 4 /CO 2 feed ratio reveals maximum yield of CO and H 2 are detected at feed ratio of 1.0.The yield of CO over Cumodified g-C 3 N 4 is 1.33 times more than using pure g-C 3 N 4. On the other hand, production of H 2 detected over Cu/g-C 3 N 4 is 1.85 times higher than the amount of H 2 produced over pure g-C 3 N 4 photocatalyst.The total yield of all products produced in the presence of CO 2 -H 2 O system are much higher than the amounts of products produced in the presence of CO 2 -CH 4 system It is concluded that Cu-promoted g-C 3 N 4 photo-catalysts are more efficient for photocatalytic CO 2 reforming of CH 4 to cleaner fuels production under simulated solar energy."
  }
]