[
  {
    "title": "Doi",
    "content": "10.1016/j.jallcom.2021.158836"
  },
  {
    "title": "Article_Title",
    "content": "KCa2Nb3O10/ZnIn2S4 nanosheet heterojunctions with improved charge separation efficiency for efficient photocatalytic CO2 reduction"
  },
  {
    "title": "Abstract",
    "content": "Construction of heterojunctions with face-to-face contact is an excellent strategy for highly efficient photocatalytic CO 2 reduction system.Herein, ZnIn 2 S 4 /KCa 2 Nb 3 O 10 (ZnIn 2 S 4 /KCNO) 2D/2D nanosheet heterojunctions are fabricated via an in-situ solution-processed method, and the optimal 20-ZnIn 2 S 4 /KCNO heterojunction shows a significantly enhanced photocatalytic activity with the CO production rate of 4.69 mol g -1 h -1 , which is about 12.31 and 1.95 times higher than that of bare ZnIn 2 S 4 and KCa 2 Nb 3 O 10 under simulated sunlight irradiation.The as-prepared ZnIn 2 S 4 /KCNO nanosheet heterojunctions exhibit tremendously improved charge transfer and separation efficiency.The ultrathin structure KCNO is conducive to the rapid transmission of photogenerated electrons, while the nanoflower-like structure ZnIn 2 S 4 is conducive to the full contact with the reactants to produce more protons, resulting in significantly boosted CO production performance.This work gives a new strategy to construct 2D/2D nanosheet heterojunctions for photocatalytic CO 2 conversion, which can offer significant inspirations for other 2D hybrid systems."
  },
  {
    "title": "Experimental",
    "content": "Glycerol, indium(III) chloride tetrahydrate (InCl 3 4H 2 O), zinc chloride (ZnCl 2 ), thioacetamide (TAA), potassium carbonate (K 2 CO 3 ), calcium carbonate (CaCO 3 ), niobium(IV) oxide (Nb 2 O 5 ), potassium chloride (KCl), tetrabutylammonium hydroxide solution 10 (TBAOH 10 wt), nitric acid (HNO 3 ) and absolute ethanol were bought from SCR, Shanghai.No purifying was conducted over all reagents.Deionized water was utilized throughout the experiments. KCNO nanosheets were synthesized on the basis of reported literatures 27,28.The typical procedures are as follows: K 2 CO 3 , CaCO 3 and Nb 2 O 5 (K/Ca/Nb 1.1:2:3) were placed in a mortar and sufficiently grinded with a pestle.The above mixture was put in a tube furnace at 1200 C for 12 h to obtain KCNO bulk material.The KCNO bulk material was dispersed in 200 mL HNO 3 aqueous solution (5 M) to conduct protonation.After stirring for 72 h, the white precipitate was washed with absolute ethanol and deionized water alternatively for several times, and placed in a vacuum oven at 60 C overnight to get HCa 2 Nb 3 O 10 (HCNO) powder.Exfoliation process of the protonation product was carried out with TBAOH 10 wt solution.In detail, 0.1 g HCNO powder was added into 100 mL deionized water and 500 L TBAOH 10 wt mixed solution under stirring vigorously for 7 days.In addition, ultrasonic treatment was conducted twice every day over the above suspension.The obtained translucent colloid was added into KCl aqueous solution (2 M) drop by drop.The ultimate white precipitate was collected and washed with absolute ethanol and deionized water, and dried in a vacuum oven at 60 C overnight to get KCNO nanosheets. The ZnIn 2 S 4 /KCNO heterojunction photocatalysts were prepared by following a protocol in literature 29.Typically, 100 mg KCNO nanosheets, 4 mL glycerol and 16 mL H 2 O were added into a roundbottom flask keeping sonication and stirring for 30 min.Afterwards, 12.81 mg ZnCl 2 , 27.56 mg InCl 3 4H 2 O, and 14.21 mg TAA were added into above suspension and stirred for 5 min.Then the obtained mixture was put into an oil bath at 80 C for 2 h with stirring.The light yellow product was collected, washed with ethanol for three times, and dried in a vacuum oven at 60 C overnight to get 20-ZnIn 2 S 4 /KCNO (ZnIn 2 S 4 content of 20 wt).The other ZnIn 2 S 4 content samples including 10 wt, 30 wt and 40 wt were prepared by varying amount of ZnCl 2 , InCl 3 4H 2 O and TAA with otherwise conditions unchanged, and the products were denoted as 10-ZnIn 2 S 4 / KCNO, 30-ZnIn 2 S 4 /KCNO and 40-ZnIn 2 S 4 /KCNO.The pure ZnIn 2 S 4 nanosheets were prepared following the same reaction conditions in the absence of KCNO nanosheets. The crystalline phase of as-prepared samples was tested by Xray diffractometer (XRD-6100Lab, The Japan Shimadzu Company).The photoluminescence spectra and the time-resolved fluorescence decay spectra of as-prepared samples were obtained by QuantaMaster TimeMaster spectrofluorometer (QuantaMasterTM 40, Photon Technology International, Inc.).The transient photocurrent response and electrochemical impedance analysis of as-prepared samples were performed by an electrochemical workstation (CHI760E, The Shanghai Chenhua Instrument Company).The morphology of as-prepared samples was examined by transmission electron microscopy (TEM, Tecnai 12, The Dutch Philips Company) and high-resolution transmission electron microscopy (HRTEM, Tecnai G2 F30 S-TWIN, The American FEI Company).The atomic valence state and surface element compositions of as-prepared samples were tested by X-ray photoelectron spectroscopy (250 Xi, The American Thermo Fisher Scientific Company).The optical absorption property of as-prepared samples was examined by UV-Vis-NIR spectrophotometer (UV-3600Plus, The Japan Shimadzu Company).The N 2 adsorption-desorption isotherms of as-prepared samples were obtained by surface area and porosity analyzer (TriStar II 3020, The American Micromeritics Instrument Company). The photocatalytic CO 2 reduction experiments of as-prepared samples were conducted using a homemade quartz reactor (280 mL in capacity) under room temperature and atmospheric pressure.The simulated sunlight was provided by a 300 W Xe lamp (HSX-F300, Beijing NBET Technology Co., Ltd).In detail, before the experiments, 50 mg of the as-prepared samples was mixed with 4 mL absolute ethanol and kept ultrasonic treatment for 30 min.The obtained suspension was then dropwise added into the quartz reactor.And the reactor was put into the oven at 70 C for 2 h to evaporate the absolute ethanol.The quartz reactor was sealed using rubber stoppers after formation of a thin film of the solid sample at the bottom of the reactor.The air in the reactor was eliminated by blowing N 2 for 20 min to create an anaerobic condition.The carbon source and hydrogen source (CO 2 and H 2 O) in the reactor were produced by allowing NaHCO 3 (0.084 g, which was added into the reactor before sealing it off) and 2 M sulfuric acid solution (0.9 mL, which was injected into the reactor using a syringe) to react for 10 min before switching on the Xe lamp.The Xe lamp was positioned 7 cm away from the quartz reactor.During the photocatalytic reaction, the generated gas products in the reactor were analyzed by gas chromatograph (GC-7920, Beijing CEAULIGHT Technology Co., Ltd) equipped with a flame ionization detector (FID).Control experiments were also conducted with the above reactor in the absence of CO 2 , photocatalysts or light irradiation."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Fig. 1a schematically shows the formation process of the ZnIn 2 S 4 /KCNO by exfoliation and oil bath.The TEM image of bulk KCNO is shown in Fig. S1, and a large layered bulk structure can be observed.Interestingly, the KCNO after exfoliation exhibits flat and smooth nanosheet shape (Fig. 1b).The ultrathin nanosheet structure is conducive to the rapid migration of photocarriers.Different from the KCNO nanosheets, the ZnIn 2 S 4 exhibits nanoflower-like structure with wrinkled edges which is beneficial for the interaction with the reactants fully (Fig. 1c).Fig. 1d shows the morphology of the 20-ZnIn 2 S 4 /KCNO.It can be found that two types of nanosheet composed the heterojunctions and formed a 2D/2D nanosheet heterojunction.The interface of the heterojunction is investigated by the HRTEM.As shown in Fig. 1e, a distinct interface can be observed between the two nanosheets.The lattice space of 0.280 nm is in good agreement with the (110) plane of KCNO nanosheets 27, and the lattice spaces of 0.324 and 0.411 nm are in accordance with the (102) plane and (006) plane of ZnIn 2 S 4 nanosheets 29.In addition, the SAED pattern (Fig. 1f) further confirmed the results of HRTEM.The diffraction rings can be assigned to the (102) and ( 110 2a.It can be seen that the bulk KCNO and HCNO show good crystallinity and purity.After the exfoliation process, the three-dimensional order of original KCNO is disappeared and the KCNO nanosheets show a typical 2D characteristic diffraction peaks, which is in accordance with the previously reports 22,23.It can be found that the main distinct peaks located at 20.96, 27.48, 30.73, 47.30, 52.33 and 55.85 are attributed to (006), (102), (104), (110), ( 112) and (202) crystal facets of hexagonal-phase ZnIn 2 S 4 30, and there is no other impurity can be observed, indicating the high purity of the as-synthesized ZnIn 2 S 4 .The diffraction peaks of ZnIn 2 S 4 /KCNO samples are consisting of both ZnIn 2 S 4 and KCNO, and with increasing the content of ZnIn 2 S 4 , the diffraction peak intensity of ZnIn 2 S 4 is heightened.When the loading amount of ZnIn 2 S 4 reached to 40, the diffraction peaks of ZnIn 2 S 4 can be seen clearly, and no new peak was appeared.This demonstrates that after the reaction, only ZnIn 2 S 4 /KCNO heterojunction product was generated rather than new material. To investigate the chemical composition and valence state of the as-prepared samples, XPS analysis was performed.As shown in Fig. 2b, the XPS survey spectrum reveals that the 20-ZnIn 2 S 4 /KCNO is mainly composed of O, Ca, Nb, Zn, In and S, which is consistent with the results of the above EDX analysis.Two main peaks at 445.1 eV and 452.6 eV of In 3d spectrum of ZnIn 2 S 4 and 20-ZnIn 2 S 4 / KCNO (Fig. 2c) are ascribed to the In 3d 5/2 and In 3d 3/2 31.The O 1s peaks in Fig. 2d can be divided into two groups, i.e., lattice oxygen (530.4 eV) and surface hydroxyl (532.2 eV) 32.The surface hydroxyl peak intensity of 20-ZnIn 2 S 4 /KCNO is greater than that of KCNO may be due to the dissociation of water and the formation of surface hydroxyl groups during the synthesis process 333435.The Nb 3d peaks of KCNO located at 206.5 eV and 209.3 eV (Fig. 2e) originates from the Nb 3d 5/2 and Nb 3d 3/2 , respectively 36.Compared with the pristine KCNO, the Nb 3d peaks of 20-ZnIn 2 S 4 /KCNO are shifted to the higher binding energy.Interestingly, the S 2P characteristic peaks of 20-ZnIn 2 S 4 /KCNO are assigned to 161.60 eV (S 2p 3/2 ) and 162.74 eV (S 2p 1/2 ) 37, which are shifted to the lower binding energy compared with the pure ZnIn 2 S 4 (Fig. 2f).The shift of binding energy can be explained in terms of electronegativity 38.Specifically, S element shows greater electronegativity than Nb element, which leads to the transfer of charge from Nb to S and the change of their electric screening of inner shells 39,40.This electron interaction between ZnIn 2 S 4 and KCNO further demonstrates the formation of the interface 41. The optical properties of the as-prepared samples were investigated by UV-vis diffuse reflectance spectra (DRS).As exhibited in Fig. 3a, the bulk KCNO and KCNO nanosheets show UV light response, while the ZnIn 2 S 4 can effective absorb the visible light.On the basis of the DRS spectra, the band gaps (E g ) of the ZnIn 2 S 4 and KCNO were investigated.According to the Kubelka-Munk formula 42, the E g of ZnIn 2 S 4 and KCNO were calculated to be 2.65 eV and 3.38 eV by the plots of (h) 2 and (h) 1/2 versus h, respectively.This result is consistent with previous works 23.In addition, all of the ZnIn 2 S 4 /KCNO heterojunctions present visible light absorption, and with the increase of ZnIn 2 S 4 content, the absorption edge of the sample shifts to the larger wavelength.This may be due to that the introduction of narrow band gap ZnIn 2 S 4 has a great impact on the band structure of ZnIn 2 S 4 /KCNO, which is closely related to the optical absorption of ZnIn 2 S 4/ KCNO 43,44.This result is consistent with previous reports 454647. The photocatalytic activity measurements for CO 2 reduction were carried out under simulated sunlight irradiation.When the photocatalytic reaction performed under the light irradiation with CO 2 atmosphere, as shown in Fig. 4a, the KCNO nanosheets exhibit much higher photocatalytic CO production rate than bulk KCNO, which might be attributed to the higher BET surface area and more exposed active sites.Since the ZnIn 2 S 4 /KCNO II-type heterostructure generated, photogenerated electrons and holes are allowed to transfer to the surface of KCNO and ZnIn 2 S 4 , respectively.This can effectively promote the separation of photogenerated electrons and holes 48.Moreover, the ultrathin structure KCNO facilitates the rapid migration of photogenic electrons, while the nanoflower-like structure ZnIn 2 S 4 facilitates the full contact with the reactants and produces more protons by oxidizing water 49.This is conducive to the rapid activation of CO 2 and the continuous formation of reaction intermediates.Therefore, the CO production rate of photocatalysts improved evidently when the contents of ZnIn 2 S 4 are 10 and 20.Specially, the CO production rate of 20-ZnIn 2 S 4 /KCNO (4.69 mol g -1 h -1 ) is up to 1.95 fold and 12.31 fold as high as that of pure KCNO nanosheets (2.40 mol h -1 g -1 ) and ZnIn 2 S 4 nanosheets (0.38 mol h -1 g -1 ) (Fig. 4c).However, an excess ZnIn 2 S 4 content was observed to decrease the photoactivity of the ZnIn 2 S 4 /KCNO.This is due to a large number of reduction active sites on KCNO were covered by ZnIn 2 S 4 50.In addition, ZnIn 2 S 4 may shadow the incident light on the surface of KCNO, leading to insufficient light exposure of KCNO 51.These result in a decrease of photocatalytic activity of 30-ZnIn 2 S 4 /KCNO, and even 40-ZnIn 2 S 4 /KCNO photocatalytic activity is lower than that of bare KCNO.We also investigated the photocatalytic CO 2 reduction activity of physical mixture of ZnIn 2 S 4 and KCNO with 20 wt of ZnIn 2 S 4 .It is clearly that the CO production rate of physical mixture sample is quite lower than that of 20-ZnIn 2 S 4 / KCNO (Fig. S3), demonstrating the synergistic effect of the formed 2D/2D heterojunction would accelerate photoinduced charge carriers separation and endow 20-ZnIn2S4/KCNO heterojunction with enhanced CO-production activity 52.The selectivity of the sample was also investigated systematically (Fig. 4d), and the results showed that the by-product was mainly H 2 .Specifically, Although KCNO with ultrathin nanosheet structure is beneficial to photoelectron migration, it cannot effectively improve CO selectivity.Surprisingly, the formation of ZnIn 2 S 4 /KCNO heterojunctions effectively inhibited the production of H 2 (Fig. 4b).This is due to the effective separation of photoperiod holes.Protons are generated on the surface of ZnIn 2 S 4 , while electrons and CO 2 are concentrated on the surface of KCNO.This spatial separation of protons and electrons effectively inhibits the production of H 2 and improves the selectivity of CO 53.As a result, the selectivity of 20-ZnIn 2 S 4 /KCNO for CO production are 85.42, which is the highest of all photocatalysts.The stability of the photocatalyst is another crucial criterion to evaluate the photocatalyst.As shown in Fig. 5a, after five cycles, the 20-ZnIn 2 S 4 /KCNO exhibit a high photocatalytic activity of 4.25 mol h -1 g -1 , which is 90.71 as high as the initial activity (4.69 mol h -1 g -1 ).This result shows that 20-ZnIn 2 S 4 /KCNO has good cyclic stability.Furthermore, this result was also confirmed by the XRD pattern of the reused photocatalyst.As exhibited in Fig. 5b, there is no obvious change can be observed from the XRD patterns between fresh and recycled 20-ZnIn 2 S 4 /KCNO.In addition, the TEM image of reused 20-ZnIn 2 S 4 /KCNO shows that the 20-ZnIn 2 S 4 / KCNO was still composed of ultrathin structure KCNO and nanoflower-like structure ZnIn 2 S 4 after photocatalytic reduction of CO 2 for 25 h (Fig. 5c).These results indicate the remarkable stability of the present 20-ZnIn 2 S 4 /KCNO photocatalysts.The control experiments are shown in Fig. 5d, and the contamination of the reactor was excluded by the group A test.No products were detected in group B and group C, which suggests that light source and photocatalyst are indispensable in the process of photocatalytic reduction of CO 2 .Almost no products were detected in the anhydrous Group D, indicating that the production of CO requires H 2 O to provide necessary protons to promote the formation of intermediates.There seems to be no CO was collected in the system without CO 2 , suggesting that CO is the reduction product of CO 2 , and the generation of H 2 indicates that 20-ZnIn 2 S 4 /KCNO has excellent water oxidation ability.Therefore, light, catalyst, water and CO 2 are necessary for photocatalytic CO 2 reduction. To explore the mechanism of the enhanced photocatalytic CO 2 reduction performance of the ZnIn 2 S 4 /KCNO 2D/2D nanosheet heterojunctions, transient photocurrent response, electrochemical impedance spectroscopy (EIS), steady-state PL spectra and time-resolved transient PL decay spectra were carried out.We first investigated the kinetics of photoinduced charge transfer of the asprepared photocatalyst by transient photocurrent response and EIS.As shown in Fig. 6a, the transient photocurrent response for KCNO nanosheets, ZnIn 2 S 4 nanosheets and 20-ZnIn 2 S 4 /KCNO were measured with light-on and light-off cycle mode under simulated sunlight irradiation.It can be seen that 20-ZnIn 2 S 4 /KCNO exhibits the highest photocurrent intensity compared with KCNO nanosheets and ZnIn 2 S 4 nanosheets, suggesting the fast transfer of the charges at the interface between ZnIn 2 S 4 nanosheets and KCNO nanosheets 54.EIS Nyquist plots of the above samples are shown in Fig. 6b.Generally, a smaller arc in an EIS Nyquist plot means the lower charge-transfer resistance on the electrode surface.It is clearly that the arc radius of 20-ZnIn 2 S 4 /KCNO is smaller than KCNO nanosheets, which means the stronger electronic conductivity compared with KCNO nanosheets, indicating the efficient charge separation after construction of the heterojunction structure.PL performance was further used to study the process of charge separation and recombination.As shown in Fig. 6c, the emission peaks around 545 nm can be observed in the PL spectra of the KCNO nanosheets, ZnIn 55, which is consistent with the other results.In addition, the specific surface areas of as-prepared samples were investigated using the nitrogen adsorption-desorption isotherms (Fig. S4).The specific surface areas of bare KCNO and ZnIn 2 S 4 are 26.46 m 2 g -1 and 192.02 m 2 g -1 , respectively.Compared to ZnIn 2 S 4 , the BET surface area of 20-ZnIn 2 S 4 /KCNO is decreased to 81.10 m 2 g -1 owing to the combination of KCNO with low BET surface area.Based on the above results, it can be concluded that the enhanced photocatalytic activity of 20-ZnIn 2 S 4 /KCNO is mainly ascribed to the improved charge carriers separation efficiency caused by the formed 2D/2D heterojunction.Based on the above experimental and theoretical results, a possible photocatalytic CO-production mechanism over ZnIn 2 S 4 /KCNO 2D/2D nanosheet heterojunction photocatalysts is illustrated in Fig. 7a andb.First, on the basis of the DRS, XPS valence band spectra (Fig. S5) and the previous reports 22, the E CB and E VB of KCNO nanosheets and ZnIn 2 S 4 were determined to be -0.83,2.55 V, and -0.98, 1.63 V, respectively.Both of the KCNO nanosheets and ZnIn 2 S 4 nanosheets can be excited by the simulated solar light, and the photoinduced electrons are transited from the valence bands (VBs) of KCNO and ZnIn 2 S 4 to the conduction bands (CBs).The electrons will be further transferred from the ZnIn 2 S 4 to the KCNO due to the more negative CB potential of ZnIn 2 S 4 , and the holes will be transferred from KCNO nanosheets to ZnIn 2 S 4 nanosheets due to the more positive VB potential of KCNO, respectively.In consequence, the typical II-type heterostructure is formed between ZnIn 2 S 4 nanosheets and KCNO nanosheets.It can be found that the CB edge potential of KCNO nanosheets (-0.83 V) is more negative than the potential of CO 2 /CO (-0.52 V vs. NHE), indicating the feasibility of occurring of surface reduction reaction.More importantly, KCNO with ultrathin structure can effectively induce the rapid migration of photogenerated electrons, thus improving the reaction kinetics of CO 2 reduction.Furthermore, the VB edge potential of ZnIn 2 S 4 nanosheets (1.63 V) is more positive than that of H 2 O/O 2 (0.82 V vs. NHE), indicating the feasibility of occurring of surface oxidation reaction 56.It is worth noting that ZnIn 2 S 4 with nanoflower-like structure has a large interaction surface with the reactants, which is conducive to the production of protons and promotes the rapid formation of reaction intermediates.As a result, the formation of II-type heterostructure not only can increase the number of higher energy electrons involved in reduction reaction, but also can form a space isolation of electrons and holes, which can effectively inhibit recombination, and thus enhance photocatalytic activity 57."
  },
  {
    "title": "Conclusions",
    "content": "In summary, we fabricate the 2D/2D ZnIn 2 S 4 /KCNO nanosheet heterojunction photocatalysts by an in-situ solution-processed method for highly efficient photocatalytic CO 2 reduction.A series of characterization results reveal that the enhanced photocatalytic The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. ) planes of ZnIn 2 S 4 nanosheets, and the (110) and (100) planes of KCNO nanosheets, respectively.In addition, HAADF-STEM image and the corresponding elemental mapping images and EDS spectrum (Figs.1g and S2) reveal the Ca, Nb, O, Zn, In and S elements are uniformly distributed in the ZnIn 2 S 4 /KCNO, indicating the ZnIn 2 S 4 nanosheets are homogeneously anchored on the surface of KCNO. Fig. 1.(a) Schematic description of synthetic process of the ZnIn 2 S 4 /KCNO photocatalyst.TEM images of (b) KCNO nanosheets, (c) ZnIn 2 S 4 nanosheets, (d) 20-ZnIn 2 S 4 /KCNO.(e, f) HRTEM image and corresponding SAED pattern of 20-ZnIn 2 S 4 /KCNO.(g) HAADF-STEM image and the corresponding elemental mapping of 20-ZnIn 2 S 4 /KCNO. Fig. 2. (a) XRD patterns of bulk KCNO, HCNO, KCNO nanosheets, ZnIn 2 S 4 and ZnIn 2 S 4 /KCNO heterojunctions with different contents of ZnIn 2 S 4 .XPS spectra of the KCNO nanosheets, ZnIn 2 S 4 and 20-ZnIn 2 S 4 /KCNO: (b) survey spectrum, high resolution spectra of (c) In 3d, (d) O 1s, (e) Nb 3d and (f) S 2p. Fig. 3. (a) UV-vis diffuse reflectance absorption spectra (DRS) of as-prepared samples; (b) plots of (h) 2 and (h) 1/2 versus h for the band gap energy of ZnIn 2 S 4 and KCNO nanosheets. Fig. 4. Time-dependent production of (a) CO, (b) H 2 in photocatalytic CO 2 reduction by the samples.(c) Photocatalytic activity of the as-prepared samples.(d) Photocatalytic H 2 selectivity of the samples. Fig. 5. (a) Cycling measurements for CO 2 photoreduction over the 20-ZnIn 2 S 4 /KCNO.(b) XRD patterns of the 20-ZnIn 2 S 4 /KCNO sample before and after the cycles.(c) TEM image of the recycled 20-ZnIn 2 S 4 /KCNO sample.(d) Photocatalytic CO 2 reduction performance under different reaction conditions over 20-ZnIn 2 S 4 /KCNO. Fig. 6.(a) Transient photocurrent response, (b) electrochemical impedance spectroscopy, (c) steady-state PL spectra and (d) time-resolved transient PL decay spectra of ZnIn 2 S 4 nanosheets, KCNO nanosheets and 20-ZnIn 2 S 4 /KCNO. 2 S 4 nanosheets and 20-ZnIn 2 S 4 /KCNO under an excitation wavelength of 360 nm.It can be seen that the PL intensity of the 20-ZnIn 2 S 4 /KCNO is quite lower than the KCNO nanosheets and ZnIn 2 S 4 nanosheets, indicating that the charge recombination could be effectively suppressed.The dynamic electron migration process of the charges was studied by time-resolved transient PL spectra.As shown in Fig.6d, the average decay lifetime of KCNO nanosheets, ZnIn 2 S 4 nanosheets and 20-ZnIn 2 S 4 /KCNO are 2.81, 3.87 and 2.41 ns, respectively.The shortest fluorescence lifetime of 20-ZnIn 2 S 4 /KCNO indicates the fast migration and separation of photoinduced charge carriers in the heterojunction Journal of Alloys and Compounds 865 (2021) 158836 This work was supported by the financial supports of National Natural Science Foundation of China (21878130), and China Postdoctoral Science Foundation (2018M642180). Supplementary data associated with this article can be found in the online version at doi:10.1016/j.jallcom.2021.158836."
  }
]