[
  {
    "title": "Doi",
    "content": "10.1016/j.jcis.2018.10.094"
  },
  {
    "title": "Article_Title",
    "content": "Non-additional carbon source one-step synthesis of Bi2O2CO3-based ternary composite for efficient Z-scheme photocatalysis"
  },
  {
    "title": "Abstract",
    "content": "Bi 2 O 2 CO 3 -based ternary composite materials are generally synthesized by two-or multi-step method and special precursor of CO 3 2A is usually utilized in synthesis of Bi 2 O 2 CO 3 , which are time-consuming, laborious and relatively costly.In this paper, for the first time, a facile one-step solvothermal method is used to fabricate Z-scheme Bi 2 O 2 CO 3 /Bi/Bi 2 WO 6 ternary composites.Interestingly, ethylene glycol not only acts as solvent for the reaction system, but also reduced Bi 3 into metallic Bi and itself is oxidized to CO 3 2A , which could construct Bi 2 O 2 CO 3 .On this occasion, Bi 2 O 2 CO 3 /Bi/Bi 2 WO 6 ternary composites are obtained after one-step method.High resolution transmission electron microscopy clearly reveals each component in composites.The as-prepared samples could be applied in various photocatalytic activities.Under solar light irradiation, Bi 2 O 2 CO 3 /Bi/Bi 2 WO 6 composites exhibited prominent photodegradation performances for both ciprofloxacin and bisphenol A. Meanwhile, these composites could also be used in efficient photoreduction of CO 2 .The efficient photocatalytic activity could be mainly ascribed to Z-scheme electron transfer mechanism in ternary composites, which is determined by surface redox reactions, active species trapping experiment, electron spin resonance spectrum."
  },
  {
    "title": "Experimental",
    "content": "All the reagents were purchased from Sinopharm Chemical Reagent Co., Ltd (China) and used directly without any further purification.Z-scheme Bi 2 O 2 CO 3 /Bi/Bi 2 WO 6 composites were synthesized by a facile one-step solvothermal method (Fig. 1).Typically, 5 mmol of Bi(NO) 3 was dissolved in 55 mL EG, then 1.5 mmol of Na 2 WO 4 was added.After being stirred for 30 min, 5 mL of NaOH (2 M) was introduced into the above solution under vigorous stirring.After 30 min, the suspension was transferred into 100 mL of Teflon-lined stainless steel autoclaves and kept at 180 C for 12 h, then cooled to room temperature naturally.The precipitate was collected by filtration and washed five times with deion-ized water.At last, synthesized sample was dried at 60 C for 12 h.Bi 2 O 2 CO 3 /Bi/Bi 2 WO 6 composites with 0.5, 1, 1.5, 2 and 2.5 mmol of Na 2 WO 4 dosages were fabricated and marked as BOCW-1, BOCW-2, BOCW-3, BOCW-4, BOCW-5, respectively. CIP and BPA photodegradation reactions of samples were studied under simulated sunlight light irradiation (300 W Xe lamp without cut-off filter).Typically, 50 mg of as-prepared catalysts were introduced into 100 mL of CIP (10 mg/L) and BPA (10 mg/L) aqueous solution.Before irradiation, the suspensions were vigorously stirred for 1 h in darkness to obtain adsorption-desorption equilibrium between samples and target pollutants.During solar light irradiation, 5 mL of the dispersions were taken out at a certain interval and obtained supernatants by centrifugation.Concentrations of CIP and BPA were determined by ultraviolet-visible (UV-Vis) spectrophotometer (TU-1810). Photocatalytic CO 2 reduction test was investigated in a Schlenk flask reactor system connected to a vacuum pump.A 300 W Xe lamp was used as the light source without cut-off filter under magnetic stir.For each experiment, 0.1 g of as-prepared catalysts and 100 mL of deionized water were introduced into reactor.Then high purity CO 2 was inflated into the reactor system with a partial pressure of 80 kpa.The photocatalytic activity was carried out at 278 K for 6 h in each run.The yields of products were analyzed at a 1 h interval by the gas chromatograph (Agilent Technology 7900 GC). First-principles calculation was implemented by the well-tested Cambridge Serial Total Energy Package code based on density functional theory 29.The band structures were calculated by the generalized gradient approximation within the scheme of Perdew-Burke-Ernzerhof. Brillouin zone integration was represented adopting the K-point sampling scheme of 3 A 4 A 4 Monkhorst-Pack grids.The convergence criterion for the self-consistent field was set to 1.0 A 10 A6 eV/atom in this process."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Phase structures of samples are studied by XRD patterns.As shown in Fig. 2, both diffraction peaks of Bi 2 O 2 CO 3 and Bi 2 WO 6 could be clearly observed, which are attributed to orthorhombic Bi 2 O 2 CO 3 (JCPDS 84-1752) and Bi 2 WO 6 (JCPDS 39-0256), respec- tively.No traces of metallic Bi can be found in samples, indicating that the content of Bi in composite is relatively low.Besides, diffraction signal intensities of Bi 2 WO 6 at 28.3, 32.7, 47.1and 55.8obviously enhance with the increase of Na 2 WO 4 contents, while the peaks intensity ascribing to Bi 2 O 2 CO 3 gradually decrease (Fig. 2a-d).When molar ratio of Bi 3 and WO 4 2A is 2:1, only Bi 2 WO 6 phase could be seen (Fig. 2e).The reason is that Bi 2 WO 6 is prepared by raw materials of Bi 3 and WO 4 2A and their molar ratio is 2:1, therefore all of Bi 3 would react with WO 4 2A to generate Bi 2 WO 6 and no residual Bi 3 exists in system.Furthermore, Bi 2 WO 6 is more stable than Bi(OH) 3 and OH A could not replace WO 4 2A to generate Bi (OH) 3 then to Bi 2 O 3 .In addition, the results also suggest that EG could not reduce Bi 3 in Bi 2 WO 6 to metallic Bi.Therefore Bi 3 reduction might generate in ions exchange process between WO 4 2A and OH A .Additionally, XPS analysis is investigated to further determine surface chemical composition and chemical states of samples.In Fig. 3a, main elements including Bi, W, O and C could be clearly seen in BOCW-3 and BOCW-5.Fig. 3b-d provide high resolution XPS spectra of W 4f, Bi 4f and C 1s, respectively.In Fig. 3b, peaks of W 4f 5/2 and W 4f 7/2 in BOCW-3 locate at 37.25 and 35.12 eV, respectively, which are the characters of W species in the WO 6 octahedron 30,31.However, as for BOCW-5, its peaks of W 4f move to the direction of high energy by about 0.10 eV in comparison with that of BOCW-3.As shown in Fig. 3c, BOCW-5 presents two Bi peaks at 164.27 and 159.96 eV, which are corresponded to Bi 4f 5/2 and Bi 4f 7/2 , respectively.However, as for BOCW-3, there are four peaks for Bi element.Two peaks at 164.25 and 159.95 eV are attributed to Bi 4f 5/2 and Bi 4f 7/2 , respectively, corresponding to Bi 3 in Bi 2 O 2 CO 3 and Bi 2 WO 6 32.Besides, the other two peaks centered at 162.1 and 156.78 eV, which are ascribed to metallic Bi 33.The C1s spectrum of BOCW-3 sample in Fig. 3d 34 and O-bearing bonding (CAOH) 35, respectively.As for the peak at 284.55 eV, it should be belonged to internal reference from XPS measurement 36.While in the O 1s spectrum of BOCW-5, only one peak at 284.89 eV could be clearly seen, which is considered as the calibration standard.This result suggests Bi 2 O 2 CO 3 is absent in BOCW-5 sample, consisting with the XRD analysis. Bi 2 O 2 CO 3 is formed by simple redox process and ion exchange method, which use Bi(NO) 3 as Bi source and EG as solvent, reductant and precursor of CO 3 . The possible reaction mechanism is that EG is firstly oxidized to glyoxal then to oxalic acid (Eqs.( 1) and ( 2)).Oxalic acid is relatively unstable and can transform to CO 3 2A through the split of CAC bond (Eq.( 3)).Besides, Bi 2 WO 6 is prepared by raw materials of Bi 3 and WO 4 2A and their molar ratio is 2:1 (Eq.( 4)).When Bi 3 is redundant, OH A would react with Bi 3 to generate Bi(OH) 3 (Eq.( 5)), which further transform to Bi 2 O 3 during hydrothermal process (Eq.( 6)).Finally, Bi 2 O 3 reacted with obtained CO 3 2A to produce Bi 2 O 2 CO 3 (Eq.( 7)).Because Bi 2 O 2 CO 3 is synthesized through the oxidation of EG, a reduction reaction could occur in this system.Therefore, metallic Bi might generate by the reduction of Bi 3 (Eq.( 8)). 3.3.Morphology and microstructure characteristics Fig. 4a presents SEM image of BOCW-3 sample, which is composed of 3D hierarchical microspheres as well as some irregular nanosheets distributed among them.The size of the microsphere ranges from 3 to 4 lm and the thickness of nanosheets is about 30 nm.The morphologies of BOCW-1, BOCW-2 and BOCW-4 are similar to BOCW-3, as demonstrated by Fig. S2.HR-TEM image of BOCW-3 is depicted in Fig. 4b.Lattice spacings of 0.29 and 0.32 nm are ascribed to (1 6 1) plane of B 2 O 2 CO 3 and (1 3 1) plane of Bi 2 WO 6 , respectively, consisting well with the result of XRD analysis.In addition, lattice spacing of 0.34 nm suggests the (0 1 2) plane of metallic Bi NPs.In Fig. 4c, the selected area electron diffraction (SAED) pattern presents well-defined rings, suggesting the polycrystalline characteristic crystal planes of BOCW-3 composite.SEM-mapping is utilized to determine elemental distribution in material.As shown in Fig. 4d-g, these elements including C, Bi, W and O are homogeneously distributed throughout the microsphere.Besides, it is clear that abundant C element is covered in the surface of microsphere, confirming that C element not only exists in Bi 2 O 2 CO 3 , but round the composite in the form of C substance.When molar ratio of Bi 3 and WO 4 2A is 2:1, only Bi 2 WO 6 is obtained, and its morphology is very different to other samples.In Fig. 4h, it can be seen that the as-prepared sample is composed of many 2D nanoplatelet and they have nearly same thickness as other composites. Optical absorption characters of samples are studied via UV-Vis diffuser reflectance spectra.As shown in Fig. 5, absorption edges of all samples locate at about 450 nm, suggesting that they are all visible light active catalysts.The optical band gaps of five samples are determined by the formula (ahv) n A(hv A E g ), where a, h, v, A and E g represent the absorption coefficient, Planck constant, light frequency, proportionality constant and band gap, respectively 37.The n values are 1/2 and 2 for direct and indirect inter-band transition semiconductors 38.In Fig. 6a andb, the calculated band gaps of both pure Bi 2 WO 6 and Bi 2 O 2 CO 3 present the direct interband transition character.Therefore, experimental optical band gaps of Bi 2 WO 6 and Bi 2 O 2 CO 3 are calculated by the plot (ahv) 1/2 against (hv), which are determined to be 2.31, 2.45, 2.48, 2.57 and 2.28 eV for BOCW-1, BOCW-2, BOCW-3, BOCW-4, BOCW-5, respectively (inset of Fig. 5). Photocatalytic activity of BOCW composites is studied in this section choosing CIP (10 mg/L) as the model organic pollutant under simulated sunlight irradiation.In Fig. 7a, photocatalytic activities of BOCWs gradually improve with the decrease of Bi (NO) 3 and Na 2 WO 4 mole ratios from 10:1 to 3.3:1.When their ratios lower 3.3:1, photocatalytic abilities of BOCW samples decrease.As shown in Fig. 7a, compared with other composites, BOCW-3 exhibits the highest CIP photodegradation performance and 97.3 of CIP could be decomposed within 90 min.Fig. 7b provides the corresponding kinetic constants of five composites for CIP photodegradation, which are determined to be 0.029, 0.032, 0.039, 0.020 and 0.014 min A1 for BOCW-1, BOCW-2, BOCW-3, BOCW-4, and BOCW-5, respectively.In addition, BPA (10 mg/L) is also utilized as target pollutant.Fig. 7c shows the BPA degradation curves under simulated solar irradiation.Similarly, BOCW-3 presents the highest degradation efficiency in comparison with other samples and 92.4 of BPA could be degraded within 120 min.Corresponding kinetic constants are determined and depicted in Fig. 7d, which are calculated to be 0.014, 0.016, 0.021, 0.012 and 0.011 min A1 for BOCW-1, BOCW-2, BOCW-3, BOCW-4, and BOCW-5, respectively. Fig. 7e and f present TOC degradation curves of BOCW-3 during CIP and BPA photodegradation process under solar light, respectively, which could be always utilized to analyze the mineralization degree of organic pollutant.In Fig. 7e andf, TOC concentration continuously decreases with the increase of reaction time, confirming that pollutants are steadily mineralized.After 90 and 120 min, the TOC degradation efficiencies could reach to 78.6 and 81.5 for CIP and BPA, respectively.This result demonstrates that BOCW-3 composite could efficiently degrade and mineralize organic contaminants under simulated solar light illumination. The influence of the BOCW-3 dosages (from 0 to 2 g/L) on degradation efficiencies of CIP and BPA is investigated.As shown in Fig. 8a andb, the concentrations of contaminant change little when no sample is introduced into reaction system, suggesting that the self-degradations of CIP and BPA are almost negligible under solar light irradiation.With the increase of BOCW-3 dosage, both of the degradation efficiencies of CIP and BPA gradually improve because more active sites could be provided.However, when photocatalyst dosage is increased to 2 g/L, the photocatalytic activities enhance a little.The reason is that catalyst is aggregated and the light scattering by the aggregation would largely lower the light intensity. The effect of initial pollutants concentration (5-20 mg/L) on photodegradation activity of BOCW-3 are also studied under solar light irradiation.As can be seen from Fig. 8c andd, both CIP and BPA degradation efficiencies decrease with the increase of initial pollutants concentration under the same conditions.The results indicate that BOCW-3 composite is suitable for the advanced treatment of low-concentration organic contaminants.However, when initial concentration is too high, intermediate products would accumulate on catalyst surface and its active sites would be occupied, resulting in the decrease of adsorption of CIP and BPA. In order to obtain better insight into the photocatalytic activity of samples, CO 2 photoreduction performance of BOCW is investigated under mild reaction conditions.Fig. 9 presents the yields of CO and CH 4 under simulated solar irradiation.All samples exhibit the more yield of CH 4 than that of CO.As for CO, its yield improves with the decrease of mole ratio of Bi(NO) 3 and Na 2 WO 4 to 3.3:1, below which the CO yield starts to decline.This is similar to that for CH 4 production, which suggests that BOCW-3 sample shows the best photocatalytic activity for CO 2 photoreduction to CO and CH 4 in comparison with other samples and its total CO and CH 4 yields are 4.91 and 15.22 lmol/g within 6 h, respectively. Fig. S2a exhibits the N 2 adsorption-desorption isotherms of the obtained samples.All catalysts present type IV isotherms with a typical H3 hysteresis loop based on the Brunauer-Dening-Dening-Teller classification, suggesting the existence of mesopores 39.Barrett-Joyner-Halenda pore-size distribution curves of samples are shown in Fig. S2b, which indicate that the pore diameters mainly distributed in the range of 3-20 nm, further confirm the mesopores structure.The mesoporous structure is beneficial to the adsorption and transition of organic pollutants or its intermediates during their degradation process.Large surface areas of materials play an important role in the improvement of photocatalytic activities via providing more active sites and increasing the contact area between the samples and small organic molecules.As can be seen from Table S1, Brunauer-Emmett-Teller specific surface areas of samples gradually decrease with the increase of Na 2 WO 4 contents, which is not consistent with the photocatalytic activities of materials.Therefore, it is reasonably inferred that specific surface area and porosity are not decisive factors in association with photocatalytic activity. Photoluminescence (PL) measurement is a desirable strategy for studying the separation and transfer of photoinduced charge carriers in semiconductors because PL emission primarily results from the recombination of photogenerated electrons and holes 36.Fig. 10a depicts the PL spectra of as-prepared samples in the range of 320-700 nm excited at 280 nm.It can be observed that only Bi 2 -WO 6 sample (BOCW-5) presents the strongest emission peaks.However, heterojunction construction and metallic Bi decoration significantly quench the excitonic emission and BOCW-3 sample exhibits the lowest peak in comparison with other composites.The weaker peak intensity implies the faster separation and migration of photogenerated electron-hole pairs.The interfacial charge migration dynamics in photocatalytic activity could be also investigated via electrochemical impedance spectroscopy (EIS) 40.Fig. 10b shows the typical Nyquist curves of the obtained samples simulate solar light irradiation.These plots match well to the equivalent circuit of R s (QR f )(QR ct ) (in inset of Fig. 10b); where R s , Q, R f and R ct represent electrolyte resistance, constant phase element, samples layer resistance and charge transfer resistance, respectively.Typically, a smaller semicircle arc indicates a lower electron-transfer resistance value, meaning faster interfacial charge carriers transfer efficiency.Compared with other BOCW samples, diameter of arc on the Nyquist plot of BOCW-3 composite is the smallest.Therefore, BOCW-3 could possess the best migration efficiency of photoinduced electrons and holes. To determine the main active species in organic pollutants photodegradation over BOCWs, trapping experiment is implemented.As shown in Fig. 10c andd, it is clearly that introduction of EDTA-2Na and BQ into photocatalytic system could largely inhibit photodegradation for CIP and BPA, suggesting holes (h ) and superoxide radical ( A O 2A ) play crucial roles in degradation process.However, when isopropanol is added, photodegradation efficiency nearly remains unchanged. Based on the above results, a possible Z-scheme mechanism could occur in BOCW composite.According to the reported articles, band edge potentials of CB and VB are A0.59 and 3.45 V (vs.NHE) for Bi 2 O 2 CO 3 , respectively 8,41, while those are A0.65 and 2.24 V (vs.NHE) for Bi 2 WO 6 , respectively 27.Besides, the Fermi level of Bi is A0.17 V (vs.NHE) 28, together with those of Bi A O 2A is confirmed to be one of the active species during photocatalytic activity.On the basis of the typical charge migration theory, metallic Bi would play a key role in constructing a cross-linking bridge for two semiconductors.On the one hand, because the CB potential of Bi 2 O 2 CO 3 is more negative than the Fermi level value of Bi (A0.17 V vs. NHE), thus photogenerated electrons on CB of Bi 2 O 2 CO 3 may migrate to metallic Bi (electron migration I: Bi 2 O 2 CO 3CB ?Bi) via Schottky barrier at the metal-semiconductor interface.On the other hand, the Fermi level of metallic Bi is more negative than the VB value of Bi 2 WO 6 , thus holes on the VB of rutile may also migrate to metallic Bi (electron migration II: Bi ?Bi 2 WO 6VB ).Under the circumstances, simultaneous electron transfer routes I and II (Bi 2 O 2 CO 3CB ?Bi ?Bi 2 WO 6VB ) could enhance separation of holes on VB of Bi 2 O 2 CO 3 and electrons on the CB of Bi 2 WO 6 , as well as maintaining higher redox potentials. CO 2 photoreduction reaction could also confirm the Z-scheme electron migration mechanism in BOCW composite.As shown in Fig. 11, the potentials of CO/CO 2 and CH 4 /CO 2 are A0.53 and A0.24 V (vs.NHE), respectively, which are more negative than Fermi level value of Bi.Therefore, photoinduced electrons on the CB of Bi 2 WO 6 and Bi 2 O 2 CO 3 could not transfer to metallic Bi, further react with CO 2 to form CO or CH 4 .In this case, Z-scheme electron migration mechanism might occur in BOCW composites. In Cycling tests of BOCW-3 for photodegradation of CIP and BPA are utilized under same experimental condition to evaluate the photocatalytic stability of samples.In Fig. 13a, after five cycles, BOCW-3 composite still exhibits without obvious decrease for both CIP and BPA, indicating the obtained photocatalysts possess the high stability and can be used repeatedly.In addition, as can be seen from Fig. 13b, the crystal structure of BOCW-3 still remains unchanged after five cycles, which is advantageous for practical applications."
  },
  {
    "title": "Conclusions",
    "content": "In summary, a facile one-pot solvothermal method is utilized to constructed Z-scheme BOCW ternary composites for the first time.In this process, ethylene glycol not only acts as solvent for the reaction system, but also reduces Bi 3 into metallic Bi and itself is oxidized to CO 3 2A , which could construct Bi 2 O 2 CO 3 .On this occasion, BOCW ternary composites are obtained after one-step method.Under solar light irradiation, BOCW composites could be applied in various photocatalytic activities such CIP and BPA degradation, as well as CO 2 reduction.The enhanced photocatalytic activity is ascribed to Z-scheme electron transfer mechanism in ternary composites, which is confirmed by surface redox reactions, active species trapping experiment and electron spin resonance spectrum.This work provides a novel one-step strategy to fabricate Bi 2 O 2 CO 3 -based ternary composites for efficient Z-scheme photocatalysis. Fig. 1.Controlled fabrication process for BOCW composite. Fig. 2. XRD patterns of as-prepared BOCW composites with different contents of Na 2 WO 4 . Fig. 3. XPS spectra of (a) Bi 4f, (b) W 4f, (c) O 1s and (d) C 1s in BOCW-3 and BOCW-5 composites. Fig. 4. (a) SEM image, (b) HR-TEM image and (c) SAED pattern of BOCW-3; elemental mapping images of (d) C, (e) Bi, (f) W and (g) O in BOCW-3 composite.(h) SEM image of BOCW-5. Fig. 5. UV-Vis diffuse reflection spectra of as-prepared samples. photodegradation for CIP and BPA, suggesting holes (h ) and superoxide radical ( A O 2A ) play crucial roles in degradation process.However, when isopropanol is added, photodegradation efficiency nearly remains unchanged.Based on the above results, a possible Z-scheme mechanism could occur in BOCW composite.According to the reported articles, band edge potentials of CB and VB are A0.59 and 3.45 V (vs.NHE) for Bi 2 O 2 CO 3 , respectively8,41, while those are A0.65 and 2.24 V (vs.NHE) for Bi 2 WO 6 , respectively27.Besides, the Fermi level of Bi is A0.17 V (vs.NHE)28, together with those of Bi 2 O 2 CO 3 and Bi 2 WO 6 are shown in Fig.11.Under simulant solar light illumination, both Bi 2 O 2 CO 3 and Bi 2 WO 6 are excited and produce photoinduced charge carriers, where electrons and holes are in their CB and VB, respectively.As for Bi 2 O 2 CO 3 and Bi 2 WO 6 , photogenerated electrons on their CB could not transfer to metallic Bi, further react with O 2 to form A O 2A because the Fermi energy value of Bi is more positive than the potential of O 2 / A O 2A (A0.33 V vs. NHE).However, Fig. 7. Photodegradation curves of (a) CIP, (b) BPA and (c, d) their corresponding apparent rate constants of five different samples under simulated solar irradiation; TOC removal efficiencies during (e) CIP and (f) BPA photodegradation process over BOCW-3 composite. order to further demonstrate the Z-scheme mechanism in BOCW composite, electron spin resonance (ESR) spin-trap technique with 5, 5-Dimethyl-1-pyrroline-N-oxide (DMPO) in methanol solution (for DMPO-A O ) was implemented.As can be seen from Fig. 12, six DMPO-A O 2 A signals could be clearly seen after 5 min solar light irradiation, whose intensities would enhance with the increase of irradiation time to 10 min.Because the Fermi energy value of Bi is more positive than the potential of O 2 / A O 2A (A0.33 V vs. NHE).Therefore, photogenerated electrons on the CB of Bi 2 O 2 CO 3 and Bi 2 WO 6 could not transfer to metallic Bi, further react with O 2 to form A O 2A , suggesting Z-scheme electron migration might occur in BOCW system. Fig. 8. Effect of catalysts dosage (a, b) and contaminants concentration (c, d) on the photodegradation efficiency of CIP and BPA under solar light irradiation. Fig. 9. Yields of CO and CH 4 products for CO 2 photoreduction under simulated solar irradiation. Fig. 10.(a) PL spectra of the as-prepared samples under 280 excitation; (b) EIS Nyquist plots of photocatalysts under simulated solar irradiation and corresponding schematic (inset) of the equivalent circuit obtained by fitting the EIS results; (c) CIP and (d) BPA photodegradation curves of BOCW-3 sample under simulated sunlight irradiation in the existence of different scavengers. Fig. 11.Possible mechanism for organic pollutants photodegradation of BOCW composite under simulated solar irradiation.Fig. 12. DMPO spin-trapping ESR spectra of BOCW-3 under dark and simulate solar light irradiation for DMPO-A O 2 A in methanol dispersion. Fig. 11.Possible mechanism for organic pollutants photodegradation of BOCW composite under simulated solar irradiation.Fig. 12. DMPO spin-trapping ESR spectra of BOCW-3 under dark and simulate solar light irradiation for DMPO-A O 2 A in methanol dispersion. This work was supported by Doctoral Foundation of Natural Science Foundation of Shandong Province, (ZR2017BEM013) and Primary Research Development Plan of Shandong Province, (2017GNC13110). Supplementary data to this article can be found online at https://doi.org/10.1016/j.jcis.2018.10.094."
  }
]