[
  {
    "title": "Doi",
    "content": "10.1016/j.apsusc.2013.05.003"
  },
  {
    "title": "Article_Title",
    "content": "Mesoporous In(OH)3 for photoreduction of CO2 into renewable hydrocarbon fuels"
  },
  {
    "title": "Abstract",
    "content": "Indium hydroxide (In(OH) 3 ) with mesoporous structure has been synthesized via a sol-gel hydrothermal treatment.The phase compositions, optical properties, and morphologies of the photocatalysts were systematically investigated via powder X-ray diffraction, UV-visible absorption spectroscopy, scanning electron microscopy and energy-dispersive X-ray spectroscopy, chemisorption analyzer and transmission electron microscopy.The theoretical calculation based on density functional theory demonstrated that the potentials of valence band and conduction band of In(OH) 3 are both suitable for CO 2 photoreduction.The photocatalytic efficiencies of the samples were characterized by testing the photoreduction of CO 2 to CH 4 under full-arc Xe lamp irradiation.The sample modified with mesoporous structure is about 20 times higher in efficiency than that of sample without mesoporous structure, which is attributed to the outstanding structure characteristics in higher surface area and strong adsorption of the mesoporous structure."
  },
  {
    "title": "Experimental",
    "content": "The photocatalysts were prepared by a sol-gel hydrothermal synthesis (see Scheme S1).All of the reagents were analytical grade and used without further purification.In a typical synthesis, 5 mmol of In(NO 3 ) 3 4.5H 2 O was mixed with 30 mL of ethylene glycol (EG) (99,Wako Co., Japan).After stirring for 10 min, 20 mL of isopropanol (Wako, 99) was dropped into the solution and then the solution was heated it at 80 C until totally volatilized to obtain a white gel.After milling the gel completely, the obtained powders were mixed with 80 mL distilled water, and then the mixture was poured into 120 mL of Teflon-lined stainless steel autoclave.This autoclave was heated up to 180 C and kept for 36 h.The obtained precipitate was washed with distilled water for several times and dried at room temperature overnight. X-ray diffraction (XRD) patterns were characterized by a RIGAKU Rint-2000 X-ray diffractometer equipped with graphite monochromatized Cu-K radiation ( 1.54178A).Scanning electron microscopy images and energy-dispersive X-ray spectroscopy patterns were recorded with a JEOL 6700F field emission scanning electron microscopy.Transmission electron microscopy and high-resolution were performed with a JEOL 2100F field emission transmission electron microscopy operated at 200 kV.The pulsed adsorption of CO 2 was recorded with a Micromeritics AutoChem II 2930 chemisorption analyzer.Here the powder samples were pretreated at 150 C in Ar for 1 h before the pulsed adsorption of CO 2 .UV-visible diffuse reflectance spectrum was recorded with a Shimadzu UV-2500 Spectrophotometer.The measurements of surface area were carried out in a BELSORP II Surface Area Analyzer. The electrical structure was calculated by the DFT with the CASTEP program.Electronic structure of the In(OH) 3 was investigated via the plane-wave-pseudopotential approach based on the density functional theory (DFT).Geometry optimization model was performed to determine the most stable structure.Then its electronic structure was calculated using a standard Cambridge serial total energy package (CASTEP) code 3,4.The electron-core interaction was represented via ultrasoft pseudopotentials with a plane-wave basis cutoff energy of 340 eV.The electronic exchangecorrelation energy was treated within the frame-work of the local density approximation (LDA).The self-consistent field (SCF) tolerance was all 1 10 -6 eV/atom. A 300 W Xe arc lamp was used as the light source.The reaction was performed in a gas-closed system with a gas-circulated pump (see Fig. S4).The volume of the reaction system was about 360 mL.In a typical process, In(OH) 3 powder (0.2 g) loaded with Pt (0.5 wt.) by the in situ photo-deposition method 8 was uniformly dispersed in a glass reactor with an area of 8.5 cm 2 .Deionized water (2-3 mL) was injected into the reaction system as reductive agent.The reaction system was vacuum-pumped and washed with high purity CO 2 gas for several times.Then high purity CO 2 gas was introduced into the reaction system to achieve 80 KPa.During the irradiation, about 0.5 mL of gas was sampled from the reaction system at given intervals for subsequent CH 4 concentration analysis with a gas chromatograph (GC-14B, Shimadzu Corp., Japan)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The XRD pattern of the as-prepared In(OH) 3 is shown in Fig. 1.The indexed diffraction peaks can be assigned to a pure cubic phase of In(OH) 3 which is in accordance with the reported data (JCPDS file No:73-1810).The strong and sharp diffraction peaks reveal that the product was well-crystallized.The energy-dispersive X-ray spectroscopy (EDS) pattern indicates the only presence of indium and oxygen elements (Fig. S1).The scanning electron microscope (SEM) image (Fig. 2a) shows that the particles of In(OH) 3 with cubic and rectangular shapes were about several hundred nanometers in size.The microstructure was further investigated by transmission electron microscopy (TEM).A representative high-resolution TEM (HRTEM) image (Fig. 2b) of a small crystallite (inset of Fig. 2b) reveals that the crystallite is single crystal with a lattice space measured about 0.37 nm, which corresponds to the spacing of (2 0 0) lattice plane of In(OH) 3 .With a lower magnification, the TEM image of a nanocube (Fig. 2c) shows the contrast between dark edge and light center indicates the existence of pores.Furthermore, the Nitrogen adsorption-desorption isotherms (Fig. 2d) indicates that the hysteresis loop is approximately in accord with a type H 3 loop which is always observed with aggregates of plate-like particles giving rise to slit-shaped pores 22.The distribution of pore sizes (inset of Fig. 2d) calculated through the Barrett-Joyner-Halenda (BJH) method shows the presence of pores with average pore size of 9.5 nm.The surface area of the sample calculated from the linear region of the plot is about 64.5 m 2 g -1 .Moreover, as shown in Fig. 2(e-g), the SEM images of samples obtained at different reaction times, such as 1 h, 10 h, and 36 h, indicate the growth process of In(OH) 3 . The mechanism of growth process can be explained as follows: At first, the colloidal suspensions of In(NO) 3 4.5H 2 O were dissolved through the hydrolyzation process to form hydrolyzed complexes, which is determined by the charge of the cation and pH value of the solution 23.In this work, the pH value of the solution was about 3-4 and the chemical valence of indium iron was 3, which therefore induced to generate the hydration complex In (H 2 O) 6 3 .After the dissolution, the hydration complex was converted to In(OH) 3 as follows: The obtained crystallites of In(OH) 3 containing kinks with maximum bending energy took the role as the sediment cores 24.Other basic cations were adsorbed on the surface of the cores to make the crystallites grow up.Meanwhile, the crystallites tended to gather together to decrease surface energy.As a result, the selfassembled In(OH) 3 with mesoporous structure was obtained (as shown in Fig. 3). A UV-visible absorption spectrum of the as-synthesized In(OH) 3 shows that the optical absorbance edge is about 240 nm and the band gap is 5.17 eV (see Fig. S2).The optical absorption property of a photocatalyst is largely dependent on the band structure, thus the theoretical calculation of the band structure helps understanding its photophysical and photocatalytic properties 25.As shown in Fig. 4, the energy-band structure (Fig. 4a) indicates that In(OH) 3 is a direct band-gap semiconductor.The dispersion of the density of states is advantageous for the electrons generation and transmission.The density of states (Fig. 4b) reveals that the conduction band minimum and the valence band maximum are dominated by In 5s and O 2p, respectively.The band edge of valence band (E VB ) of In(OH) 3 is estimated to be 4.24 eV (vs NHE) from the equation E VB X -E e 0.5 E g where X is the absolute electronegativity of the semiconductor, E e is the energy of free electrons on the hydrogen scale, E VB is the VB edge potential and E g is the band gap of the semiconductor 10.The potential of VB of In(OH) 3 is more positive than that of Fig. 5a shows the CH 4 evolution over mesoporous In(OH) 3 under full arc Xe lamp irradiation.In order to investigate the effects of porous structure, the activity of sample with non-mesoporous structure (named as n-In(OH) 3 ), which was synthesized via hydrothermal treatment in aqueous solution of ammonia, was also characterized.The evolution rate of CH 4 over the mesoporous In(OH) 3 is about 0.8 mol(g h) -1 , which is 20 times higher than that of n-In(OH) 3 (0.04 mol(g h) -1 ).The reason may be due to the mesoporous structure that can enlarge the surface area and enhance the gas adsorption of the sample.As shown in Fig. 5b, the particle of n-In(OH) 3 (inset SEM (i)) is about several micrometers in size and even aggregated together.Furthermore, compared with the Nitrogen adsorption-desorption isotherms of mesoporous sample (see curve (ii)), there is no hysteresis loop in that of the n-In(OH) 3 , indicating that no pores exists inside (see curve (i)).More details have been provided in Fig. S5.As a result, the surface area of the n-In(OH) 3 is only 9.7 m 2 g -1 , which is much less than that of mesoporous sample (64.5 m 2 g -1 ).Further more, the pulsed adsorptions of CO 2 on different samples were also investigated to clarify the reason for the different activities.As shown in Fig. 6, the totally adsorption of CO 2 on mesoporous In(OH) 3 is about 0.479 cm 3 g -1 which is about 4 times higher than that of n-In(OH) 3 (0.113 cm 3 g -1 ).Moreover, due to the higher surface area and higher average pore size, the mesoporous In(OH) 3 needs more cycles to get adsorption equilibration than the non-mesoporous sample.Therefore, it took longer time to get adsorption equilibration.All in all, the mesoporous In(OH) 3 obtained higher adsorption ability of CO 2 which is advantageous for the photocatalytic activity. The contrast experiments without photocatalyst, CO 2 source, H 2 O and light irradiation were carried out respectively to confirm that the CH 4 was obtained from photocatalytic reaction indeed.There was no O 2 evolution detected in the CO 2 photoreduction processes, which is similar with previous reports 262728.According to these previous reports, the produced O 2 was suggested to be consumed in several processes, such as chemical or physical adsorptions on the surface of photocatalysts.Furthermore, some other kinds of hydrocarbons and organics were obtained, such as aldehyde, acetone and etc.But the amounts of these products are very small and can be ignored."
  },
  {
    "title": "Conclusions",
    "content": "A facile and effective approach was developed to synthesize In(OH) 3 with mesoporous structure which achieved enhanced activity in CO 2 photoreduction.As-prepared In(OH) 3 samples loaded with co-catalysts could efficiently convert CO 2 into CH 4 under UV light irradiation.The evolution rate of CH 4 over the mesoporous In(OH) 3 is about 0.8 mol(g h) -1 , which is 20 times higher than that of n-In(OH) 3 (0.04 mol(g h) -1 ).Moreover, the totally adsorption of CO 2 on mesoporous In(OH) 3 is about 0.479 cm 3 g -1 which is about 4 times higher than that of n-In(OH) 3 (0.113 cm 3 g -1 ).It's proved that the mesoporous structure is advantageous for the photocatalytic activities of CO 2 reduction.Furthermore, the theoretical calculation of the band structure shows that the dispersion of the density of states is advantageous for the electrons generation and transmission.The mesoporous In(OH) 3 for photoreduction of CO 2 into renewable hydrocarbon fuels is reported for the first time.This work will provide useful information for further study on morphology controlling to enhance the photocatalytic efficiency of photocatalysts. Fig. 1.XRD pattern of mesoporous In(OH)3 (i); The standard data for In(OH)3 (JCPDS NO. 73-1810) (ii). Fig. 2. (a) SEM image;(b,c) High and low magnification of HRTEM image of mesoporous In(OH)3; (d) nitrogen adsorption-desorption isotherms and pore size distribution (inset); (e-g) FE-SEM images of In(OH)3 obtained at 180 C for (e) 1 h, (f) 10 h,and (g) 36 h. 93 V, vs. NHE, pH 5 9.The conduction band (CB) position can be deduced by E CB E VB -E g .Therefore, the band edge of conduction band (E CB ) is -0.93 eV (vs NHE).Moreover, the potential of CB of In(OH) 3 is more negative than that of E 0 (CO 2 /CH 4 ) CO 2 8e - 8H CH 4 2H 2 O E 0 (CO 2 /CH 4 ) -0.24 V, vs. NHE, pH 5.As above analysis, the photogenerated electrons and holes can react with the adsorbed CO 2 and H 2 O to produce CH 4 . Fig. 3. SEM images of assembled crystals during in the synthesis process (a,b) 1 h, (c,d) 3 h and (e) the schematic diagram of growth process of mesoporous structure. Fig. 4. DFT calculation of In(OH)3: (a) energy band dispersion and (b) density of states. Fig. 5. (a) CH4 evolution over In(OH)3 with various co-catalysts under full-arc Xe lamp irradiation.(co-catalysts: Pt, 0.5 wt.);(b) SEM images and nitrogen adsorption-desorption isotherms of In(OH)3 synthesized from aqueous solution of ammonia (inset SEM (i) and curve (i)) and mesoporous In(OH)3 (inset SEM (ii) and curve (ii));. Fig. 6.The Pulsed Adsorption of CO2 on (a) mesoporous In(OH)3 and (b) nonmesoporous In(OH)3 (n-In(OH)3). This work was partially supported by World Premier International Research Center Initiative (WPI), MEXT, Japan. Supplementary data associated with this article can be found, in the online version, at http://dx.doi.org/10.1016/j.apsusc.2013.05.003."
  }
]