[
  {
    "title": "Doi",
    "content": "Doi not found"
  },
  {
    "title": "Article_Title",
    "content": "Fabrication of hierarchical ZnIn 2 S 4 @CNO nanosheets for photocatalytic hydrogen production and CO 2 photoreduction"
  },
  {
    "title": "Abstract",
    "content": "Photocatalytic H2 production and CO2 reduction have attracted considerable attention for clean energy development.In this work, we designed an efficient photocatalyst by integrating lamellar oxygen-doped carbon nitride (CNO) nanosheets into ZnIn2S4 (ZIS) microflowers by a one-step hydrothermal method.A well-fitted 2D hierarchical hybrid heterostructure was fabricated.Under visible light irradiation, the ZISCNO composite with 40 wt CNO (ZC 40) showed the highest hydrogen evolution rate from water (188.4molh -1 ), which was approximately 2.1 times higher than those of CNO and ZIS (88.6 and 90.2 molh -1 , respectively).Furthermore, the selective CO production rates of ZC 40 (12.69 molh -1 ) were 2.2 and 14.0 times higher than those of ZIS (5.85 molh -1 ) and CNO (0.91 molh -1 ), respectively, and the CH4 production rate of ZC 40 was 1.18 molh -1 .This enhanced photocatalytic activity of CNOZIS is due mainly to the formation of a heterostructure that can promote the transfer of photoinduced electrons and holes between CNO and ZIS, thereby efficiently avoiding recombination of electron-hole pairs."
  },
  {
    "title": "Experimental",
    "content": "All of the materials were purchased from Sinopharm Chemical Reagent Co., Ltd.(Shanghai, China) and used as received without further purification. In a typical experiment, 4 g of dicyandiamide, 4 g of urea, and 3.2 g of oxalic acid were dissolved in 20 mL of ultrapure water.After 30 min of stirring at room temperature, followed by oil bath evaporation, the solid was obtained for further use.The product was then ground to a powder, placed in a crucible with a cover, heated at 550 C for 2 h at a ramp rate of 5 C/min, and naturally cooled to room temperature.The collected product (CNO) was heated at 550 C for another 2 h without a cover to obtain thinner nanosheets.CN was prepared under identical conditions without oxalic acid. A target amount of CNO was dissolved in 80 mL of ultrapure water and sonicated for 4 h, 1.5 mmol Zn(CH3COO)22H2O and 3 mmol InCl3 were added.After 30 min of stirring, 8 mmol thioacetamide was added, and stirring continued for 30 min.The mixed solution was transferred to a Teflon-lined stainless-steel autoclave and held at 120 C for 10 h in an electric oven.After naturally cooling to room temperature, the products were collected, washed several times with ethanol and deionized water, and finally dried in an electric oven at 60 C overnight.The as-synthesized ZnIn2S4CNO samples with 20, 30, 40, and 50 wt CNO are labeled ZC 20, ZC 30, ZC 40, and ZC 50, respectively.For comparison, ZnIn2S4 (ZIS) was prepared under identical conditions without the addition of CNO. The powder XRD patterns of the samples were measured using a Bruker D8 Advance diffractometer with Cu K radiation ( 0.1541 nm).The morphology of the samples was observed by SEM (Nova Nano SEM 230) and TEM (JEOL JEM-2100).The specific surface area and pore size distribution of the products were measured using a JW-BK122W instrument and analyzed by the BET method.Ultraviolet-visible (UV-vis) diffuse reflectance spectroscopy (DRS) was performed using a UV-vis spectrophotometer (UV-2550, SHIMADZU).XPS was conducted using a Thermo ESCALAB 250Xi spectrometer with Mg K radiation as the excitation source.Photoluminescence (PL) emission spectra were recorded on a QuantaMaster TM fluorescence spectrometer.Electrochemical experiments were performed on a CHI660D workstation. The photocatalytic activity was evaluated by observing the photocatalytic hydrogen evolution from water and CO2 photoreduction reactions under visible light irradiation ( 400 nm). The photocatalyst powder (50 mg) was dispersed in 100 mL of an aqueous solution containing 10 (v/v) of triethanolamine (TEOA), and 100 L of an aqueous solution of chloroplatinic acid (H2PtCl66H2O, 0.04 g/mL) was added to the above solu-tion and stirred for 30 min.After evacuation, a 300 W xenon lamp source (400 nm cutoff filter) was used for illumination, and 3 (w/w) of Pt was photodeposited on the surface of the catalyst.The amount of H2 produced was automatically sampled online by gas chromatography (thermal conductivity detector, with N2 as the carrier gas) every 20 min. The photocatalyst powder (50 mg), 20 mg of bpy, a solvent (6 mL, acetonitrile:H2O 2:1), TEOA (1 mL), and CoCl2 (1 mol) were added to a gas-closed quartz glass reactor (200 mL in volume).The reaction system was filled with high-purity CO2 gas (1 atm).A 300 W Xe lamp was used as the light source (400 nm cutoff filter).The reaction temperature was kept at 40 C by water cooling.During photocatalysis, the reaction system was stirred vigorously.After the reaction, the generated gaseous products (CO and CH4) were sampled and quantified by gas chromatography (flame ionization detector, with N2 as the carrier gas)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The XRD patterns of the as-synthesized CN, CNO, ZIS, and ZC composites are shown in Fig. 1.CN and CNO had the same characteristic structure, where the (100) peak at 12.9 indicates the typical in-plane repeating motifs of continuous heptazine frameworks 23,24.The (002) peak of CNO (27.3, d 0.328 nm) showed a slight downshift compared with that of CN (27.6, d 0.321 nm).This finding suggests that O doping results in a larger graphite layer spacing, which favors the formation of shredded CNO nanosheets.At the same time, the significant decrease in intensity indicates that O doping reduces the long-range order of the stack structure between the catalyst layers, which is attributed to the introduction of structural defects 25.The diffraction peaks of ZnIn2S4 are identical to those of the hexagonal phase (JCPDS No. 65-2023) 26.The XRD pattern of ZC shows the diffraction peaks of both ZnIn2S4 and CNO, where the feature peaks of ZnIn2S4 (27.5) and CNO (27.3) are very close and overlap each other.With increasing CNO loading, the intensity of the diffraction peaks of CNO increased.The results show that ZIS and CNO coexist in the composite materials. SEM images are shown in Fig. 2. In Fig. 2(a), CN prepared by the thermal polymerization method shows a typical block distribution, which is formed by stacking of tight sheets.The particle packing density of CNO after O doping is significantly reduced, and the nanosheets constituting the catalyst are smaller, which is consistent with the XRD result that O doping increased the CN layer spacing.The pure ZIS exhibits a distinct agglomerated structure consisting of many smaller ZIS nanocrystals, as shown in Fig. 2(b).When CNO was loaded on the ZIS microspheres, several nanosheets markedly adhered to the surface of ZIS (Fig. 2(c)).Fig. 2(d) clearly shows that the CNO nanosheets (relatively thin and small) were well combined with ZIS nanosheets, which indicates that heterojunctions formed. To further confirm the formation of junctions, TEM images of the microstructure of the samples are shown in Fig. 2(e) and (f).The CNO sample was randomly combined with \"velvety\" nanosheets, in which porous ZIS microspheres are well embedded.The tight junctions could serve as transport media to accelerate the transport of photogenerated charge carriers.A high-resolution TEM image of ZC 40 is presented in Fig. 2(f); the lattice spacing is 0.328 nm, which corresponds well to the (002) plane of CNO.The marked lattice spacings of 0.32 and 0.41 nm are in good agreement with the (102) and (006) planes of hexagonal ZIS, respectively 27, which are tightly attached to CNO to form the heterojunction.The ZC heterojunctions with close contact between ZIS and CNO nanosheets are indeed fabricated by the in-situ growth process and may facilitate photoinduced interfacial charge transfer between the nanosheets, enhancing the photocatalytic activity of the catalysts.Furthermore, as shown in Fig. 2(g), the elemental mapping images clearly reveal the uniform spatial distribution of many elements, including carbon, nitrogen, oxygen, sulfur, indium, and zinc, indicating that flat CNO nanosheets are uniformly distributed on the surfaces of ZIS, strongly supporting the SEM and TEM observations. Increasing the surface area and porosity of the catalyst are particularly important for heterogeneous photocatalysis.The textural properties of the CN, CNO, and ZC 40 samples were analyzed using a nitrogen adsorption-desorption spectrometer. As illustrated in Fig. 3(a), all the photocatalysts exhibit typical IV N2 adsorption-desorption isotherms with an H3-type hysteresis loop, indicating the presence of mesopores 28.The specific surface area and pore volume of CNO were 58 m 2 /g and 0.202 cm 3 /g, respectively, which were larger than those of CN (23 m 2 /g, 0.115 cm 3 /g).This result verifies the lower degree of polymerization of CNO with abundant porosity.The porous structure with an increased specific surface area provides more active sites for the catalytic reaction and more contact points for the formation of the ZC heterojunction.The specific surface area and pore volume of ZC 40 (50 m 2 /g, 0.128 cm 3 /g) are larger than those of pure ZIS (17 m 2 /g, 0.042 cm 3 /g), probably because of the combination of ZIS and CNO. To further investigate the chemical states of typical ele-ments in the ZC 40 composite samples, XPS profiles were obtained.The C 1s spectrum (Fig. 4 high-resolution S 2p spectrum of ZC 40 has two peaks at 161.2 eV (S 2p3/2) and 162.4 eV (S 2p1/2) for S 2- 32.The In 3d XPS profile (Fig. 4(e)) has two peaks at 444.9 eV (In 3d5/2) and 452.4 eV (In 3d3/2), suggesting the presence of In 3 33.The Zn 2p XPS profile of (Fig. 4(f)) can be divided into two independent peaks centered at 1021.8 and 1044.8 eV and associated with Zn 2 (2p3/2 and 2p1/2, respectively) 34.These results, along with the SEM, TEM, and BET results, suggest that ZIS was hybridized with CNO by the successful formation of heterojunctions, which provide suitable channels for photoinduced charge transfer between them. The photocatalytic H2 production activity of the prepared samples was evaluated in a conventional closed-circulation system under visible light ( 400 nm) irradiation using TEOA and 3 wt of chloroplatinic acid as the sacrificial reagent and co-catalysts, respectively.As shown in Fig. 5(a), the H2 evolution rate of CNO (88.6 mol/h) is approximately 3.9 times that of CN (22.6 mol/h).The photocatalytic H2 generation activity of ZIS is close to that of CNO, and 90.2 mol H2 was detected after 1 h of irradiation.After hybridization of CNO and ZIS, the photocatalytic activity for H2 generation on the composite material improved significantly.This finding implies that in-situ growth of ZIS nanosheets on CNO nanosheets could noticeably enhance the photocatalysis activity for H2 production.The rate of H2 evolution over the ZC composites increases with increasing CNO content, reaching a maximum of 188.4 mol/h for the ZC 40 sample (where the CNO content is 40 wt), which is approximately 2.1 times higher than those of ZIS and CNO.The quantum efficiency of H2 evolution by CNO, ZIS, and ZC 40 measured at 420 nm was 0.96, 0.98, and 2.04, respectively.Compared to that in various reports on the use of NiS or MoSx as co-catalysts, the photocatalytic activity enhancement in our work is significant (Table S1) 353637.A further increase in the CNO content results in a decrease in photocatalytic activity, which is probably attributable to the fact that the active sites on the surface of ZIS were covered by an excessive amount of CNO 38.Therefore, an appropriate amount of CNO loading is criti-cal to enhancing the photocatalytic activity of the ZIS photocatalyst. In addition, H2 production catalyzed by ZC 40 was performed for five cycles to evaluate the stability and reusability (Fig. 5(b)).After repeated use of the catalyst for several cycles, the H2 yield remained stable, indicating that the catalyst has good hydrogen production stability and strongly confirming the stability of the ZC 40 heterojunction nanosheets for use as a photocatalyst.The slight decrease in the rate of H2 production at the beginning of the reaction may be due to hydration of the catalytic surface and a decrease in the number of active sites.When the liquid-solid interface reached an equilibrium state, very stable activity was maintained. Photocatalytic CO2 reduction to CO and CH4 under visible light ( 400 nm) irradiation was observed.Fig. 6(a) shows the photocatalytic CO and CH4 evolution rates of CN, CNO, ZIS, and ZC 40.The pure CN or CNO nanosheets clearly exhibit poor photoreduction activity.However, the ZC composite photocatalyst exhibits greatly improved CO and CH4 generation.It is clear that ZC 40 shows the strongest reducing activity, which is consistent with its photocatalytic H2 evolution performance.The CO production rate of ZC 40 (12.69 mol/h) is 2.2 and 14.0 times those of ZIS (5.85 mol/h) and CNO (0.91 mol/h), respectively.Additionally, the measured CH4 production rates of CNO and ZIS are only approximately 0.64 and 0.82 mol/h, respectively, whereas the CH4 production rate of ZC 40 (1.18 mol/h) is much higher.The amount of CH4 and CO production under light irradiation increased with time, although the rate gradually decreased.In summary, the enhanced photoreduction activity of the ZC composite materials for H2 generation from H2O and selective CO generation from CO2 is thought to result mainly from the formation of well-designed charge transfer nanochannels, which contribute to the high photoinduced charge separation and migration efficiency 39. The optical absorption properties of the CN, CNO, ZIS, and ZC 40 composites were examined by UV-vis DRS, as shown in Fig. 7(a).The light absorption band of CN is near 450 nm.For CNO, the light absorption band is distinctly red-shifted to nearly 480 nm, and the absorbance of light is also significantly improved after O doping.ZIS has an absorption edge with a longer wavelength than those of the other catalysts.An increase in CNO content caused a slight blue shift of the absorption edge of the ZC composites.In particular, although the light utilization of the composite catalyst may be slightly lower than that of ZIS, ZC 40 exhibited a high absorption capacity in visible light, which may result in generation of sufficient photoinduced electron-hole pairs.The band gaps of the CN, CNO, ZIS, and ZC 40 composites can be estimated using the Kubelka-Munk function 40, and the results are shown in Fig. 7(b).The band gap of CN is 2.92 eV, and that of CNO is distinctly shifted to a lower position (2.82 eV), promoting the transition of photogenerated carriers under wide visible light illumination.The band gap difference between the ZIS and ZC samples is comparatively small, suggesting that the optical properties of ZIS are not markedly changed by hybridization with CNO.The lower band gaps of the ZC composites compared to that of CNO plays a crucial role in charge generation and thus directly affects their photocatalytic performance 41. The separation efficiency of photogenerated charges is an important factor affecting photocatalysis performance.The PL emission spectrum can provide useful information about charge carrier trapping and recombination.Fig. 8(a) shows the steady-state PL spectra of the CN, CNO, ZIS, and ZC 40 sam-ples at an excitation wavelength of 320 nm.It can be seen that pure CN has a strong PL emission peak at 440-470 nm, which results from band-edge fluorescence caused by light excitation.Clearly, the PL emission peak of CNO appears at the same position but at a much lower intensity, indicating that O doping greatly inhibits the recombination of photogenerated electron-hole pairs.For the composite samples, the PL intensity of ZC 40 is weak, predicting much more efficient separation of photocarriers in the ZnIn2S4-CNO samples 42.Similar results were observed by other groups in ZnS/g-C3N4 43, ZnFe2O4/g-C3N4 44, and Mo2CC/2D g-C3N4 45 heterojunction systems. In addition, time-resolved transient PL spectroscopy was performed at room temperature to obtain further information on the photoinduced interfacial charge transfer process (Fig. 8(b)).Pure ZIS exhibited very little fluorescence emission, so its decay lifetime can be ignored.By fitting the decay spectra using double-exponential kinetics, the intensity-averaged lifetimes () of CNO and ZC 40 are 1.81 and 1.88 ns, respectively.The slightly longer lifetime of ZC 40 indicates that the radiative lifetime for charge carriers was effectively extended by combining CNO and ZnIn2S4, which could be beneficial for photocatalytic reactions. The generation efficiency of photoinduced electrons for photocatalytic reduction was evaluated by photocurrent measurements.At the same time, electrochemical impedance spectroscopy (EIS) was also used to visually represent the charge transport properties of the semiconductors.Fig. 9(a) shows the photocurrent transient response for CN, CNO, ZIS, and ZC 40 electrodes under visible light irradiation.As the light was switched on and off repeatedly, all the samples responded quickly to the photocurrent, demonstrating their excellent photoelectric conversion properties.The photocurrent response of CNO was much higher than that of CN, indicating that O doping facilitates the generation of photogenerated charges.Compared to CNO and ZIS, the ZC 40 sample exhibits the highest photocurrent transient response under visible light irradiation, implying improved intensity of photoinduced electrons.The enhanced photocurrent of ZC 40 could be attributed to the efficient heterojunction interaction between ZIS and CNO 46.As shown in Fig. 9(b), the diameter of the semicircular portion of the Nyquist plot of CNO is significantly smaller than that of pure CN, indicating that O doping reduces the transmission resistance.Furthermore, for the ZC 40 sample, the semicircular portion has a smaller diameter than those of the CNO and ZIS samples, suggesting that the hybrid composite has a lower charge transfer resistance than either semiconductor alone. The PL and photoelectrochemical results confirm that the ZC 40 composite photocatalyst exhibits superior charge production, transfer, and recombination inhibition.These features are responsible for the enhanced photocatalytic activity and are consistent with the fact that the ZC 40 composite exhibits the highest photocatalytic performance owing to its efficient separation of electron-hole pairs in the heterostructure formed between CNO and ZIS. The Mott-Schottky analysis was employed to determine the flat potential close to the conduction band (CB) of the prepared samples 47.The results are shown in Fig. 10(a); the plot slopes are positive for all the samples, indicating that they exhibit n-type behavior.The CBs of the CNO and ZIS are determined to be at -1.32 and -1.10 eV, respectively.By combining this information with the band gap values obtained from the UV-vis plot, the valence band (VB) positions of the samples were determined.As illustrated in Fig. 10(b), type-I binary heterojunction interfaces are formed owing to the suitable CB and VB positions of the CNO and ZIS nanosheets, providing the conditions for generation of a heterojunction with high-speed charge transfer nanochannels.Under visible light illumination, both the CNO and ZIS nanosheets could be excited to produce many photogenerated electron-hole pairs 48. The photoinduced electrons and holes on CNO would move thermodynamically to the CB and VB of the ZIS nanosheets, respectively, via the heterojunction interfaces.As a result of the photosynergistic effect of the ZC heterojunction, the recombination of photoinduced charge carriers in CNO can be effectively inhibited, and because of the photoinduced interfacial charge transfer, the number of photoinduced charge carriers on ZIS increases remarkably.Consequently, more reductive electrons would accumulate in the CB of ZIS, resulting in enhanced photocatalytic reduction activity for generation of H2 and CO.The photogenerated holes on the VBs of the CNO and ZIS nanosheets are quickly quenched by the sacrificial electron donor (TEOA).The charge migration distance and transfer time are greatly decreased by these charge transfer nanochannels afforded by the heterojunction, significantly increasing the charge transport and separation efficiency, and ultimately leading to remarkable photocatalytic activity."
  },
  {
    "title": "Conclusions",
    "content": "In conclusion, ZIS/CNO (ZC) heterojunction nanosheets were successfully synthesized by in-situ growth of CNO on ZnIn2S4 nanosheets.The resulting heterojunctions provide abundant charge transfer channels in the ZC composites, which contribute to the relatively high efficiency of photoinduced charge generation, separation, and migration, ultimately leading to remarkably enhanced visible-light-driven activity for photocatalytic reduction.The best-performing as-synthesized composite, ZC 40 (with a CNO content of 40), exhibited enhanced visible-light-driven photocatalytic H2 generation (188.4 mol/h), which is 2.1 times those of ZIS and CNO.The measured quantum efficiencies of H2 evolution for CNO, ZIS, and ZC 40 are 0.96, 0.98, and 2.04, respectively.ZC 40 also exhibited excellent efficient and selective visible-light photocatalytic activity for CO2 reduction to CO at a rate of 12.69 mol/h, which is 2.2 and 14.0 times higher than those of ZIS and CNO, respectively.Therefore, this study offers a new insight for designing and preparing high-efficiency visible-light-responsive composite semiconductors with highly efficient photocatalytic reduction activity. Fig. 1.XRD patterns of CN, CNO, ZIS, and ZC samples. Fig. 2. SEM images of CN and CNO (a), ZIS (b), ZC 40 (c, d); TEM images of CNO and ZC 40 (d, e), and elemental mapping images of ZC 40 (g). (a)) for the ZC 40 composite can be deconvoluted into three peaks.The weak peak at 284.6 eV can be interpreted as C-C coordination of the surface adventitious carbon.The peak at 286.3 eV can be attributed to C-O bonds and indicates the doping of O atoms in the hybrid unit.The main peak centered at 288.4 eV is attributed to sp 2 -bonded carbon (N-CN) in the composite29.The peaks at binding energies of 398.8, 399.6, and 401.3 eV in the N 1s region (Fig.4(b)) correspond to sp 2 -hybridized nitrogen in C-NC bonds, tertiary nitrogen N-(C)3 groups, and C-N-H amino groups, respectively30.In the O 1s XPS profile (Fig.4(c)), the peak at 532.8 eV corresponds to the adsorption of water or oxygen on the surface of the catalyst, and the peak at 531.5 eV suggests the generation of N-C-O/C-O bonds resulting from the incorporation of O31.Fig. Fig. 4. High-resolution XPS profiles of ZC 40.(a) C 1s, (b) N 1s, (c) O 1s, (d) S 2p, (e) In 3d, (f) Zn 2p. Fig. 5. Photocatalytic H2 production of catalysts.(a) Cumulative amount of H2 versus light irradiation time; (b) H2 production stability of ZC 40. Fig. 6.Photocatalytic CO2 reduction of catalysts.(a) CO and CH4 production rates of CN, CNO, ZIS, and ZC 40; (b) gas production stability of ZC 40. Fig. 8. Steady-state PL emission spectra of CN, CNO, ZIS, and ZC 40 (a) and time-resolved PL decay spectra of CNO, ZIS, and ZC 40 (b). Fig. 9. EIS (a) and photocurrent spectra (b) of CN, CNO, ZIS, and ZC 40. Structural parameters and photocatalytic activities of samples. This work was supported by the National Natural Science Foundation of China (21503096, 21407067), the Natural Science Foundation of Educational Committee of Anhui Province (KJ2018A0387), China, and Project of Anhui Province for Excellent Young Talents in Universities (gxyq2019029), China."
  }
]