[
  {
    "title": "Doi",
    "content": "10.1016/j.jcou.2017.04.009"
  },
  {
    "title": "Article_Title",
    "content": "Green synthesis of plasmonic Ag nanoparticles anchored TiO 2 nanorod arrays using cold plasma for visible-light-driven photocatalytic reduction of CO 2"
  },
  {
    "title": "Abstract",
    "content": "A novel method employing atmospheric pressure dielectric barrier discharge (DBD) cold plasma has been developed to reduce supported Ag nanoparticles (AgNPs) without the use of any environmentally and biologically hazardous reducing chemicals.X-ray photoelectron spectroscopy and UV-vis absorption spectra show that the supported metal ions are completely reduced to the metallic state within a short time (30 s).The morphology and dispersion of the AgNPs were characterized by scanning electron and transmission electron microscopy.The results show that the AgNPs are homogeneously distributed with an average particle size of less than 6 nm, which brings the effect of localized surface plasmon resonance (LSPR).The AgNPs-modified samples show remarkable improvement for reducing CO 2 to CO and CH 4 under visible light compared to pristine TiO 2 .The formation mechanism of the method for the reduction and stabilization of AgNPs is also discussed."
  },
  {
    "title": "Experimental",
    "content": "The oriented single-crystalline TiO 2 nanorod arrays on FTO glass were synthesized as described in Liu et al. 59.Briefly, deionized water was mixed with concentrated hydrochloric acid (36.5-38 by weight, AR, Sinopharm Chemical Reagent Co., Ltd.) at a volume ratio of 1:1 to reach a total volume of 50 mL.The solution was then stirred for 15 min before addition of 1.67 mL of tetrabutyl titanate (TBT, AR, Sinopharm Chemical Reagent Co., Ltd.).After vigorous stirring for 1 h, two pieces of FTO glass (F:SnO 2 , Heptachroma Co., Ltd.), ultrasonically cleaned for 60 min, were placed at an angle against the wall of the Teflon liner.The hydrothermal synthesis then proceeded at 120 C for 24 h.After synthesis, the FTO substrates were rinsed extensively with deionized water and dried in ambient air. The AgNPs were deposited on the TiO 2 nanorod arrays by a twosteps deposition method.A schematic diagram of the preparation procedure is shown in Fig. 1 Subsequently the samples were reduced using the dielectric barrier discharge plasma.Fig. 1(b) presents the schematic diagram of the DBD cold plasma device.A mixture of argon and hydrogen with the ratio of 1:1 was pumped into the reactor (90 mm in outer diameter, 65 mm in inner diameter and 5 mm in height) at a flow rate of 50 mL/min.The selected mixed gases and flow rate were optimized to achieve desired performance as well as protect the reactor from overheating producing during the plasma process.The DBD plasma treatment conducted for only 30 s.The power source supply a bipolar sine wave output with 45-200 W at a frequency of 10-20 kHz.The weight of silver nitrate was controlled to be variously 0.005 g, 0.010 g, 0.015 g and 0.020 g, and the corresponding resulting samples were labeled as AT1, AT2, AT3 and AT4, respectively. Morphologies of the prepared samples were obtained by an S-4800 (HITACHI, Japan) electron microscope.The dispersion of elements (Ag, Ti, and O) on the Ag/TiO 2 samples was analyzed by energy dispersive spectrometer (EDS).X-ray diffraction (XRD) patterns of the samples were recorded via a D/Max2550pc X-ray diffractometer with Cu K radiation ( 1.54056A) at a scan rate of 4/min in the range 20-80.The morphologies were observed by TEM and HRTEM (JEOL-2000EX).X-ray photoelectron spectroscopy (XPS) measurements were conducted on a VG ESCALAB MARK II spectrometer with a Mg K (1253.6 eV) Xray source and collected spectral data were calibrated by the C 1s peak at 284.6 eV.UV-vis diffuse reflectance spectra of samples were obtained using an UV-vis spectrophotometer (Shimadzu UV-3600, Japan).BaSO 4 was used as a reflectance standard in the UV-vis diffuse reflectance experiments.The photoluminescence emission spectra were measured at room temperature on a FLS920 fluorescence spectrometer (Edinburgh Instruments Ltd.) using 325 nm laser as the light source. The experiments of CO 2 photoreduction with H 2 O vapor were carried out in a self-assembled reactor (capacity 4500 mL) reported in our previous study 60.The as-prepared samples were placed at the center of the reactor under the illumination of two 300 W xenon lamps simulated visible light source with a light filter cutting the light below 420 nm.Before illumination, ultra-pure CO 2 (Air Products, 99.99) was pumped into the reactor at a flow rate of 300 mL/min for 1 h to purge residual air.The water vapor was introduced into the reactor by bubbling of CO 2 in a water bath.After purging, the CO 2 flow was stopped, illumination commenced.The gaseous products generated from the CO 2 photoreduction process were taken from the reactor periodically by the injection syringe and analyzed by gas chromatography (GC/FID, Thermo-Fisher, Trace GC).The error of measurement is 0.5 mol g -1 .The room temperature remained at 30 C during the testing."
  },
  {
    "title": "Results_and_Discussion",
    "content": "XRD patterns of samples AT1, AT2, AT3 and AT4 after plasma treatment are shown in Fig. 2a.The diffraction patterns exhibited correspond to rutile phase TiO 2 with peaks at 36.1, 39.1, 41.2, 54.3, 62.7, 69.0, and 69.9respectively (JCPDS 21-1276).The other peaks appearing can readily be indexed to SnO 2 (JCPDS46-1088).Additionally, there are no diffraction peaks for Ag identified in any of the patterns, which may be due to the fact that the AgNPs in small diameter with undetectable low concentrations were distributed homogeneously on the surface of the TiO 2 nanorods 59,616263.EDS (Fig. 2b) and XRD were used to characterize the Ag loaded on the TiO 2 nanorods.The elemental copper originates from the TEM holding grid.Definite Ag, Ti and O peaks are detected for sample AT4, as evident in Fig. 2b, and the spectrum illustrates that the present method for depositing AgNPs guarantees the exclusion of impurity elements.Furthermore, the real amounts of AgNPs in the samples are estimated by the EDS, which are shown in Table 1. SEM and TEM images were used to investigate the morphologies of the Ag/TiO 2 composites.Fig. 3a-d show the cross-sectional SEM images of the as-prepared TiO 2 nanorods after deposition with AgNPs.From these images, it is revealed that the tetragonal TiO 2 nanorods with lengths of approximately 1.5 m grew uniformly in the direction perpendicular to the FTO glass substrate surface.Furthermore, the silver in the form of particles of small size (typically smaller than 10 nm) are distributed homogeneously on the surface of the TiO 2 nanorods instead of on the substrate surface.The density of the AgNPs on the nanorod surfaces becomes higher with the progressive increase of the concentration of the AgNO 3 solution, which is consistent with the results of Fig. 3h.A single AgNPs deposited TiO 2 nanorod of sample AT1 was further investigated by TEM as shown in Fig. 3e, and Fig. 3g presents the corresponding high-resolution TEM image of Fig. 3e.These figures clearly show the homogeneous distribution of the AgNPs on the surface of the TiO 2 nanorods.The average particle size of the AgNPs is 5.8 nm (Fig. 3f) which is slightly less than that prepared by cold plasma at low pressure on P25 particles (7.4 nm) 45, and also much smaller than that prepared by conventional H 2 -reduction (ca.17.5 nm) 36.This indicates that atmospheric pressure cold plasma is more favorable than conventional reduction methods for enhancing the distribution of the metal nanoparticles.Fig. 3e clearly shows the lattice fringes of 0.24 nm that can be well-indexed to the (111) plane of Ag.In addition, it is worth mentioning that the content of the AgNPs remains stable even after 30 min of ultrasonic processing which is due to the effect of the H 2 plasma, which firmly anchors to the substrate surface 64.Fig. 3h shows photos of the pristine TiO 2 nanorod substrate and corresponding supported AgNPs samples.It is apparent that the color of the samples gradually darkens to black as the concentration of the AgNO 3 solution increases.The properties of the TiO 2 nanorod arrays loaded with dispersed AgNPs are closely related to the following two aspects of the two-steps method: Firstly, in the operation of impregnation of the AgNPs onto the surface of the TiO 2 nanorods, the interaction between AgNO 3 and NH 3 H 2 O effectively controls the size distribution of the AgNPs within a narrow range, with the average diameter being 5.8 nm.Furthermore, it contributes to the homogeneous distribution of the AgNPs on the TiO 2 surfaces.It is also the morphological foundation of the LPSR effect of the AgNPs.Secondly, in the processing of the in situ reduction of silver, employing the contactless H 2 plasma instead of conventional chemical reducing agents brings the advantages of being environmentally and biologically friendly as well as purity, being inclusion-free.It therefore follows the increasingly stringent requirements of green chemistry.In particular, the operational period of preparing the samples by this method is much shorter than by the other reduction approaches utilizing noble metals.In the procedure employed in the present work, it took only 30 s to reduce Ag to Ag 0 .The high speed and efficiency resulted from the use of the combination of the heterogeneous nucleation impregnation and H 2 plasma reduction.All these virtues indicate that this technique is a very promising and straightforward strategy to prepare metal nanoparticles on substrate surfaces.In addition, we are expanding this method to synthesize other metal nanoparticles such as Cu, Pt and Pd NPs.With the virtues of this method, the metal nanoparticles with the size of several nanometers will anchor various and diverse substrates to form active nanocomposites with the enhanced LSPR effect in many application areas including catalysis, lithium-ion batteries, antibacterial agents, self-cleaning and analytical science and sensors. In order to further verify the existence of metallic Ag, XPS analysis was performed on the samples.As can be seen from Fig. 4a , peaks identified as Ti, O, Ag and C are present, which is similar to the EDS analysis indicating the pure existence of the pure elements.To obtain more detailed information, the resulting high-resolution resulting XPS spectra of Ti 2p and Ag 3d are shown in Fig. 4b andc respectively.For the Ti 2p spectrum in Fig. 4b, peaks centered at 458.4 eV and 464.1 eV were observed, which were conform to the Ti 2p 3/2 and Ti 2p 1/2 respectively with the spin energy separation of 5.7 eV.This indicates that Ti element is stable under H 2 plasma treatment and TiO 2 is also constant throughout the plasma process.In Fig. 4c, two symmetrical peaks at 367.9 eV and 373.9 eV are evident in both spectra which can be attributed to Ag 3d 5/2 and 3d 3/2 binding energies, respectively.No other peaks were deconvoluted.The spin energy separation is 6.0 eV, which indicates that Ag exists in its metallic state 65666768. The UV-vis absorption spectra of pristine TiO 2 nanorod films and Ag loaded TiO 2 nanorod films with different Ag contents are displayed in Fig. 5a.From these spectra it is apparent that the deposited AgNPs expand the spectral response range of TiO 2 within 400 nm to the visible region.Compared to the pristine TiO 2 , the absorption edge of the Ag modified TiO 2 nanorods indicates that the energy bandgap of the materials is slightly red-shifted, which results from the silver clusters giving rise to localized energy levels in the bandgap of TiO 2 into which valence band electrons of TiO 2 are excited at wavelengths longer than 380 nm 69,70.The band gaps of all the samples are presented in Table 1.Furthermore, a broad absorption band covering the range of 460-600 nm with a peak at about 540 nm appears in the spectra of Ag deposited TiO 2 , which is attributed to the LSPR effect of metallic AgNPs 25,41,71.In addition, the absorbance at the visible wavelength range increases with increasing silver concentration, which agrees well with the results of the color changes of samples in Fig. 3h and the SEM images in Fig. 3a-d.Compared with the typical plasmon peak of AgNPs at 400 nm, the absorption peaks of samples AT1-4 show a large red-shift which might be due to the polydisperse particle size distribution of AgNPs and interaction between Ag and TiO 2 41,63,72.The ripples in the spectra are related to the interference of the light 73.These results, consistent with the results of the XPS spectra, confirm that the DBD cold plasma successfully reduced the supported Ag ions to their metallic states completely in situ. Additionally, the photoluminescence (PL) spectra of the samples AT1-AT4 which were investigated to confirm the behavior of photogenerated charge carriers are presented in Fig. 5b.The PL spectra of AT1-AT4 are similar, with a wide peak in the range of 390-420 nm which is consistent with previous works 74.The presence of AgNPs does not result in any new peaks intensity.It is obvious that the PL intensity decreases with increasing silver concentration from sample AT1 to AT4.This indicates that the recombination of photo-generated electron-hole pairs is restrained which is attributed to the presence of the supported AgNPs on the surface of the TiO 2 nanorods.The reduced recombination of photo-generated electron-hole pairs lead to more electrons and holes directly involving into the photocatalytic reactions.These results, combined with the UV-vis spectra of the samples, indicate that the TiO 2 nanorod arrays decorated with AgNPs will possess enhanced photocatalytic activity. Fig. 6 shows the CO 2 photoreduction activity of AgNPs modified TiO 2 nanorod arrays in the presence of H 2 O vapor under simulated sunlight.Before the photocatalysis experiments, blank tests are presented to ensure that the hydrocarbon production was synthesized during the process of CO 2 photoreduction and to eliminate the surrounding interference 75.The blank tests are light-illuminated of CO 2 H 2 O without the photocatalyst, without of light -illuminated only CO 2 H 2 O with the photocatalyst in the dark, light-illuminated photocatalyst in H 2 O without the CO 2 , respectively.The results show that there is no target product detected in the above tests. In the case of photocatalytic reduction of CO 2 with water vapor, carbon monoxide (CO) is found to be the major product with a minor amount of methane (CH 4 ).It is obvious that all the modified samples exhibit much higher CO and CH 4 yields than those from pristine TiO 2. The yields of CO and CH 4 increase with increasing the concentration of the Ag.The highest CO and CH 4 production rates are about 72 mol g -1 and 6.8 mol g -1 respectively.The product yields tend to stabilize with longer irradiation times, which conform to the kinetic model for photosynthesis through catalytic reduction of carbon dioxide with water vapor 76. The probable mechanism for the observed enhanced photocatalytic activity of the TiO 2 anchored by plasmonic AgNPs is proposed as follows (Fig. 7a).The AgNPs deposited on the surface of the TiO 2 nanorods are excited under simulated sunlight due to the LSPR effect, which facilitate the excitation of the surface electrons (Eq.( 1)).The photo-excited electron flow injects into the conduction band (CB) of TiO 2 from the silver, causing separation between electrons and holes, which is assigned to the Schottky barrier between TiO 2 and AgNPs 77787980.Additionally, the local electronic field resulting from LSPR effect can promote interfacial charge transfer and therefore restrain recombination of the electron-hole pairs 20,79,81.Thus, AgNPs play a critical role as the engine of this photocatalytic process.The TiO 2 is the electron acceptor and the 3D nanostructures of the TiO 2 nanorod arrays can supply larger surface area for adsorbing the reactants, H 2 O and CO 2 . During the photocatalytic process, the photogenerated electrons transfer from the AgNPs to the CB of the adjacent TiO 2 nanorods with the holes appearing under visible light.The 2-dimensional structure of the TiO 2 nanorods is in favor of the migration of the photoinduced electrons to the reactants with larger areas of the TiO 2 nanorods.Simultaneously, the CO 2 molecule adsorbed on the TiO 2 nanorods surface take reactions with the electrons to produce an anion radical CO 2 -(Eqs.( 2)) 82.Protons (H ) and hydroxyl radicals (OH) are generated from water with the effect of the holes (Eq.( 3)) 82.In the case of TiO 2 , the reactions of H and OH formations are proceed as Eqs.( 4)-( 7) 83.The produced H transforms to H with photogenerated electron (Eqs.( 8)).The formation of product CO and CH 4 from CO 2 -is possible through CO 2 - CO CO - C CH 3 CH 4 chain reactions (Eqs.( 9)-( 13)) as proposed in Fig. 7b.CO is not only the first product but also the reactant of CH 4 .Thus, the higher yield of CO rather than HCOOH results in the fact that the final product is CH 4 instead of CH 3 OH 75,84.In generally, the generation of CH 4 consumes more hydrogen and electrons (8H 8h ) than that of CO(2H 2 h ) (Eqs. ( 14) and ( 15)) 83.On the other hand, CO is intermediates in the chain formation reactions of CH 4 .These are reasons why the yield of CO is much higher than that of CH 4 .As a result, the enhanced photocatalytic activity of CO 2 reduction can be observed with Ag NPs supported on TiO 2 nanorod arrays. AgNPs h AgNPs h e - H e - H (8) CO e - CO -"
  },
  {
    "title": "Conclusions",
    "content": "We have demonstrated a green, facile and efficient two-steps synthesis method for modifying TiO 2 nanorod arrays on FTO glass surface with AgNPs.Atmospheric pressure DBD cold plasma was used as the reducing agent to realize the complete and rapid conversion of Ag to Ag 0 .The AgNPs with average diameter of 5.8 nm were deposited uniformly on the substrate surface.Significantly, the Ag/ TiO 2 nanocomposites exhibited a high activity for reduction of CO 2 to CO and CH 4 under visible light, due to the LSPR effect of the AgNPs.The highest CO and CH 4 production rates are about 72 mol g -1 and 6.8 mol g -1 respectively.The plasmonic AgNPs play the dual role of not only assisting the separation of photogenerated electron-hole pairs from recombination in TiO 2 but also the absorption of energy of visible light required to achieve the enhanced photocatalytic activity.These results indicate that atmospheric pressure DBD cold plasma reduction has very promising prospects for application in the environmentally friendly preparation of metal nanoparticles and supported metal catalysts. (a).The as-prepared FTO substrates with TiO 2 nanorod arrays were immersed into the AgNO 3 (AR, Sinopharm Chemical Reagent Co., Ltd.) solution with volume of 40 mL.Next, 0.1 M NH 3 H 2 O (AR, Sinopharm Chemical Regent Co., Ltd.) was added dropwise into the solution with magnetic stirring until the color of the substrate changed from brown to white and then dried in air. Fig. 1.Schematic for (a) decorating AgNPs on TiO 2 nanorod arrays; (b) the atmospheric pressure DBD cold plasma device. Fig. 2. (a) XRD patterns of samples AT1, AT2, AT3, AT4; (b) EDS spectra of AT4. Fig. 3. SEM images of samples (a) AT1, (b) AT2, (c) AT3, (d) AT4 and (e) TEM (f) histogram of AgNPs and (g) HRTEM images of sample AT1; (h) photos of AT1, AT2, AT3, AT4. Fig. 4. (a) XPS survey spectra and (b) high-resolution XPS spectra of Ti of all the samples, (c) Ag of samples AT1, AT2, AT3 and AT4. Fig. 5. (a) UV-vis spectra and (b) photoluminescence spectra of samples of pristine TiO 2 , and AT1, AT2, AT3, and AT4. Fig. 6.Evolution of (a) CO and (b) CH 4 yields of pristine TiO 2 , AT1, AT2, AT3 and AT4. Fig. 7. Schematic of (a) mechanism for enhanced photocatalytic activity of AgNPs decorated TiO 2 and (b) reaction mechanism of gaseous phase photocatalysis of CO 2 H 2 O. O-Ti h H 2 O Ti-OHO-TiH (4) Ti-OHO-Ti Ti-O-O-Ti H (5) Ti-O-O-Ti H 2 O Ti-O-OHHO-Ti(6)Ti-O-OHHO-Ti Ti-OHO-Ti OH Amount of AgNPs in samples and band gaps of all samples. This work was supported by the National Natural Science Foundation of China No. 50772098."
  }
]