[
  {
    "title": "Doi",
    "content": "10.1016/s1872-2067(20)63566-5"
  },
  {
    "title": "Article_Title",
    "content": "Tunable localized surface plasmon resonances in MoO3−-TiO2 nanocomposites with enhanced catalytic activity for CO2 photoreduction under visible light"
  },
  {
    "title": "Abstract",
    "content": "The photocatalytic reduction of CO2 with H2O to fuels and chemicals using solar energy is one of the most attractive but highly difficult routes.Thus far, only a very limited number of photocatalysts has been reported to be capable of catalyzing the photocatalytic reduction of CO2 under visible light.The utilization of the localized surface plasmon resonance (LSPR) phenomenon is an attractive strategy for developing visible-light photocatalysts.Herein, we have succeeded in synthesizing plasmonic MoO3-x-TiO2 nanocomposites with tunable LSPR by a simple solvothermal method.The well-structured nanocomposite containing two-dimensional (2D) molybdenum oxide (MoO3-x) nanosheets and one-dimensional (1D) titanium oxide nanotubes (TiO2-NT) showed LSPR absorption band in the visible-light region, and the incorporation of TiO2-NT significantly enhanced the LSPR absorption band.The MoO3-x-TiO2-NT nanocomposite is promising for application in the photocatalytic reduction of CO2 with H2O under visible light irradiation."
  },
  {
    "title": "Experimental",
    "content": "The synthesis of TiO2-NT was performed according to the previously reported method 34,35.In the preparation process, 0.2 g TiO2-NP (Degussa P25) was added into 60 mL NaOH aqueous solution (10 mol/L) in a hydrothermal autoclave and kept at 200 C for 48 h.The precipitate was filtered off, washed with distilled water until pH 7, and finally dried at 400 C for 4 h.MoO3-x nanosheets and MoO3-x-TiO2 nanocomposites were prepared by solvothermal method.For the preparation of MoO3-x nanosheets, 0.19 g (2 mmol) of Mo metal powder was added into 60 mL of ethanol, then 3.0 mL of hydrogen peroxide (H2O2, 30) was introduced and magnetically stirred for about 1 h to obtain Mo complex precursor.The precursor was heated and maintained at 160 C for 6 h.The precipitate was collected by centrifugation, rinsed with ethanol for 3 times and finally dried at vacuum.For the preparation of MoO3-x-TiO2 nanocomposites, 0.048 g (0.6 mmol) TiO2 powder (TiO2-NT or TiO2-NP) was added into the above Mo complex precursor before solvothermal treatment, then the same solvothermal conditions and precipitate treating processes were used.The Mo/Ti molar ratio was 10/3 in the MoO3-x-TiO2 nanocomposites.MoO3 was prepared by calcinating MoO3-x nanosheets in air at 500 C for 4 h. Transmission electron microscopy (TEM) and High resolution TEM (HRTEM) measurements were performed on a Philips Analytical FEI Tecnai 20 electron microscopy and were operated at an acceleration voltage of 200 kV.Actomic force microsopy AFM was performed with an Agilent 5500 ILM.X-ray diffraction (XRD) patterns were recorded on a Panalytical X'pert Pro diffractometer using Cu K radiation (40 kV, 30 mA).Diffuse reflectance UV-vis spectroscopic measurements were performed on Varian-Cary 5000 spectrophotometer equipped with a diffuse reflectance accessory.Electron spin resonance (ESR) spectroscopic measurements were performed at room temperature using a Bruker EMX-10/12 ESR spectrometer operated at X-band frequency.The parameters for ESR measurements were as follows: microwave frequency 9.8 GZ, microwave power 20 mW, modulation frequency 100 kHz, attenuator 10 dB.The XPS measurements were performed on a Quantum 2000 Scanning ESCA Microprobe (Physical Electronics) using Al K radiation (1846.6 eV) as the X-ray source. Photocatalytic reactions were carried out in a stainless-steel reactor (volume, 100 cm 3 ) with a quartz window on the top of the reactor.The reactor design was reported in our previous paper 13.The light source was a 300 W Xe lamp with a UV cut-off filter ( 420-780 nm).The light intensity was 500 mW cm -2 .The photocatalytic reaction was performed in a gas-solid heterogeneous reaction mode.The powdery photocatalyst (10 mg) was placed on a glass catalyst holder in the upper region of the reactor.Distilled water with a volume of 4.0 cm 3 was pre-charged in the bottom of the reactor.The pressure of CO2 was typically regulated at 0.2 MPa.The temperature of the reactor was kept at 50 C.The reaction system was connected to an on-line gas chromatograph (GC) through valves.The products (CO, CH4, H2) were analyzed by an Agilent Micro GC3000 (Micro GC) equipped with a Molecular Sieve 5A column and a high-sensitivity thermal conductivity detector (TCD).Liquid products such as CH3OH, HCHO and HCOOH possibly formed and dissolved in water were also analyzed carefully by gas chromatography or high-performance liquid chromatography, but no such products were detected under our reaction conditions."
  },
  {
    "title": "Results_and_Discussion",
    "content": "In the present work, the MoO3-x nanosheets and TiO2 nanotubes nanocomposite (MoO3-x-TiO2-NT) was synthesized by a facile solvothermal method, which showed strong LSPR absorption in the visible-light region (Scheme 1).Firstly, pure Mo metal powder was added into an ethanol solution containing of H2O2.The Mo powder was dissolved by the oxidation of H2O2 and a transparent yellow solution was obtained.In this synthetic process, the solution-soluble precursor Mo complex compound MoO2(OH)(OOH) was formed easily 25,28.The TiO2 nanotubes (TiO2-NT) was synthesized by a hydrothermal method, in which TiO2 nanoparticles (TiO2-NP) was treated chemically with NaOH aqueous solution for 48 h at 200 C (Scheme 1) 34,35.Then, the obtained TiO2-NT was added into the above Mo complex precursor, and treated for 6 h at 160 C in a solvothermal condition to form the MoO3-x-TiO2-NT nanocomposite (Scheme 1).Additionally, the MoO3-x-TiO2-NP nanocomposite was also synthesized with the same method by replaced the TiO2-NT with TiO2-NP.The pure MoO3-x nanosheets was synthesized with similar method without adding of TiO2-NT. TEM and AFM images revealed that the obtained nanostructures of MoO3-x showed sheet-like morphology with diameters from hundreds of nanometers to several micrometers (Fig. 1(a),(b)).The average thickness of these nanosheets was measured to be about 4.3 nm by AFM, corresponding to 3 fundamental MoO6 octahedra double layers (Fig. 1(c)) 30,32.The mean diameter of TiO2-NT was 8 nm, and the length was about 100-200 nm (Fig. 1d).In the MoO3-x-TiO2-NT nanocomposite, MoO3-x maintained the nanosheet morphology and TiO2-NT is well dispersed on the MoO3-x nanosheets, the 2D MoO3-x nanosheets contacted well with 1D TiO2 nanotubes (Fig. 1(e),(f)).For comparison, TiO2-NP with a diameter of 20-40 nm was also combined with MoO3-x nanosheets to form the MoO3-x-TiO2-NP nanocomposite (Fig. 1(g),(h)).From the XRD pattern (Fig. S1), no obvious phase structure changes were found between the MoO3-x and MoO3-x-TiO2 nanocomposites.MoO3 (3.1 eV).The MoO3-x nanosheets displays a broad absorption over the entire visible wavelength range and its absorption peak is located at approximately 752 nm, showing a dramatic difference compared with that of MoO3.The strong absorption peak is associated with the LSPR effect.Moreover, the MoO3-x-TiO2-NP and MoO3-x-TiO2-NT nanocomposites display stronger optical response in the visible region than MoO3-x, with a prominent LSPR absorption peak at approximately 710 and 670 nm, respectively.The dramatic difference lies in their optical response indicates that we succeeded in adjusting the LSPR absorption of the MoO3-x by controlling the TiO2 species in MoO3-x-TiO2 nanocomposites. In order to investigate the reason for the change of optical response, ESR and X-ray photoelectron spectroscopy (XPS) characterizations were conducted to probe the difference in molybdenum oxidation states between plasmonic MoO3-x nanosheets and MoO3-x-TiO2 nanocomposites.As seen in Fig. 3, the MoO3-x nanosheets and MoO3-x-TiO2 nanocomposites show strong ESR signal at g 1.93 and g 2.00, which is a direct evidence for the existence of a single electron bringing from Mo 5 and oxygen vacancies in MoO3-x, respectively 29,36.No signal was observed for the MoO3 sample.The signal intensity of Mo 5 increased in the following sequence: MoO3 MoO3-x MoO3-x-TiO2-NP MoO3-x-TiO2-NT. Furthermore, XPS analysis of Mo 3d spectra (Fig. 4) shows that MoO3-x nanosheets and MoO3-x-TiO2 nanocomposites display two sets of doublets, one being ascribed to Mo 6 (236.2 and 233.0 eV corresponding to 3d3/2 and 3d5/2 of Mo 6 ), the other to Mo 5 (234.9 and 231.8 eV corresponding to 3d3/2 and 3d5/2 of Mo 5 ) 27,28.The Mo 5 concentration increased in the following sequence: MoO3 MoO3-x MoO3-x-TiO2-NP MoO3-x-TiO2-NT (Fig. 4).This was consistent with the observation from ESR.By calculating the ratio of 3d3/2 peak area of Mo 5 to that of Mo 6 , the percentage of Mo 5 in Mo of MoO3-x was found to be 7.4.Only Mo 6 existed in the MoO3.The percentage of Mo 5 in Mo of MoO3-x-TiO2-NP and MoO3-x-TiO2-NT nanocomposites were 10 and 25, respectively.Higher Mo 5 concentration means higher free carrier concentration in MoO3-x, which can benefit to LSPR effect and increase visible light harvesting. For a specific plasmonic system, the composite structure can affect the LSPR 37.Here we give a simple estimation: before contact, the Fermi level of TiO2 is Ef(Ti) -0.23 eV vs. NHE (pH 7) and the Fermi level of MoO3-x is Ef(Mo) 1.04 eV 38,39.After contact, the electrons flow from TiO2 to MoO3-x and build up a new equilibrium state, then the Fermi level of TiO2 is equalized to the Fermi level of MoO3-x (Fig. 5).This process can increase the electron density of MoO3-x, and enhance the LSPR effect of MoO3-x 40,41.Thus, MoO3-x-TiO2 nanocomposites show stronger and blueshift of LSPR absorption compared with MoO3-x.Moreover, the contact between MoO3-x and TiO2-NT was better than the contact between MoO3-x and TiO2-NP (Fig. 1), which will benefit for the transfer of electrons from TiO2 to MoO3-x.This might be the main reason why MoO3-x-TiO2-NT shows stronger LSPR absorption than MoO3-x-TiO2-NP.The photocatalytic results displayed in Table 1 suggest that the LSPR plays a key role in determining the catalytic activity.TiO2-NP, TiO2-NT and MoO3 were inactive under visible light irradiation.MoO3-x and MoO3-x-TiO2 nanocomposites showed very high selectivity for photocatalytic reduction of CO2 and suppressed the production of H2.MoO3-x-TiO2-NT produced a significantly larger amount of (CO CH4) than MoO3-x.The correlation of the LSPR absorption with the catalytic activity (Table 1) suggests that the visible-light absorption ability is the activity-determining factor in our system.Further studies were performed with the MoO3-x-TiO2-NT catalyst.When the reaction was carried out under N2 atmosphere instead of CO2 atmosphere, almost no CH4 and only trace CO were detected under N2 atmosphere, confirming that CO and CH4 were formed from CO2 (Fig. 6).The control experiments with heating condition also confirmed that CO and CH4 were formed from photocatalytic reduction of CO2 (Fig. S2).Furthermore, the present MoO3-x-TiO2-NT nanocomposite was stable during the reaction (Fig. 6).The CO and CH4 amounts increased nearly linearly within 12 h.After each 12 h, the reactor was degassed and CO2 was re-introduced.No obvious deactivation was observed in the three recycling experiments."
  },
  {
    "title": "Conclusions",
    "content": "We have succeeded in synthesizing the MoO3-x-TiO2-NT nanocomposite containing MoO3-x nanosheets and TiO2 nanotubes by a simple solvothermal method.The MoO3-x nanosheets showed LSPR absorption band in the visible-light region and the incorporation of TiO2-NT significantly enhanced the LSPR absorption band.The MoO3-x-TiO2-NT nanocomposite is an promising candidate for the photocatalytic reduction of CO2 with H2O under visible light.This work has expanded the possibility of catalyst design using LSPR for the development of highly efficient visible-light responsive photocatalysts for photocatalytic reduction of CO2. Photocatalytic behaviors of the MoO3-x-TiO2 nanocomposites for the reduction of CO2 under visible light. Formation rate/mol g -1 h -1 LSPR peak and intensity a /nm (a.u. Scheme 1. Schematic illustration for the fabrication of MoO3-x-TiO2-NT nanocomposite. Fig. 1.(a) TEM image of MoO3-x; (b) AFM image of MoO3-x; (c) The AFM-measured height profile of MoO3-x for lines in b; (d) TEM image of TiO2-NT; (e) TEM image of MoO3-x-TiO2-NT; (f) HRTEM image of MoO3-x-TiO2-NT; (g) TEM image of MoO3-x-TiO2-NP; (h) HRTEM image of MoO3-x-TiO2-NP. Fig. 2. Diffuse reflectance UV-vis spectra of MoO3, MoO3-x, MoO3-x-TiO2-NP and MoO3-x-TiO2-NT. Fig. 3. ESR analysis of MoO3, MoO3-x, MoO3-x-TiO2-NP and MoO3-x-TiO2-NT. Fig. 4. XPS spectra of MoO3, MoO3-x, MoO3-x-TiO2-NP and MoO3-x-TiO2-NT. Fig. 5. Energy diagrams of the plasmonic MoO3-x-TiO2 materials in different states (before contact and after contact). PhotocatalystFormation rate/mol g -1 h -1 LSPR peak and intensity a /nm (a.u.)Mo 5 /(Mo 5 Mo 6 ) b / CO CH4 H 2 TiO2 -NP 0 0 0 --TiO2-NT 0 0 0 --MoO3 0 0 0 -0 MoO3-x 2.8 0 0 752 (9.5) 0.074 MoO3-x-TiO2-NP 6.8 0 0 710 (12) 0.10 MoO3-x-TiO2-NT 12 0.91 0 670 (18) 0.25 Reaction conditions: catalyst 0.010 g, CO2 pressure 0.2 MPa, H2O 4.0 mL, light source Xe lamp ( 420-780 nm), irradiation time 4 h.a The data was collected from UV-vis spectra.b The data was calculated from the peak area of XPS spectra. Fig. 6.Repeated uses of the MoO3-x-TiO2-NT catalyst for the photocatalytic reduction of CO2 with H2O vapour under CO2 or N2 atmosphere.Reaction conditions: catalyst 0.010 g, CO2 or N2 pressure 0.2 MPa, H2O 4 mL, light source Xe lamp ( 420-780 nm).After each 12 h, the catalyst was degassed and CO2 or N2 was re-introduced into the reactor. This work was supported by the National Key Research and Development Program of Ministry of Science and Technology (2017YFB0602201), the National Natural Science Foundation of China (21433008, 91545203, 21503176), and the China Postdoctoral Science Foundation (2015M570555, 2016T90597)."
  }
]