[
  {
    "title": "Doi",
    "content": "10.1021/acs.energyfuels.1c00439"
  },
  {
    "title": "Article_Title",
    "content": "Noble-Metal-Free Bi/g-C<sub>3</sub>N<sub>4</sub> Nanohybrids for Efficient Photocatalytic CO<sub>2</sub> Reduction under Simulated Irradiation"
  },
  {
    "title": "Abstract",
    "content": "In this study, novel Schottky-junction photocatalysts Bi-metal-deposited g-C 3 N 4 were constructed via a one-step solvothermal process for photocatalytic CO 2 reduction under simulated irradiation.The photocatalytic performance illustrated that the nanohybrid catalysts have extreme activity and excellent stability.The maximum CO yield of 3.78 mol h -1 g -1 was reached on the BiCN-0.6 hybrid, which was about 3 times as much as that of pure g-C 3 N 4 .The phase, microstructure, and optical and photoelectrochemical properties were demonstrated by related characterization methods.The improvement mechanism could be ascribed to the enhanced photon absorption capacity and the decreased recombination rate of photoinduced carriers arising from the Schottky barrier in the system.This work may provide a meaningful approach to enhance the photocatalytic activity through a simple and green strategy."
  },
  {
    "title": "Experimental",
    "content": "Detailed explanations involving the characterization instruments, photoelectrochemical tests, and photocatalytic activity evaluation related to this study are given in the Supporting Information. 2.1.Materials.Urea (H 2 NCONH 3 ), bismuth nitrate pentahydrate Bi(NO 3 ) 3 5H 2 O, ethylene glycol (EG), polyvinylpyrrolidone (PVP), and nitric acid (HNO 3 ) were purchased from Sinopharm Chemical Reagent Corp., China.All chemicals were of analytically pure grade and used without further purification. 2.2.Synthesis.2.2.1.Synthesis of g-C 3 N 4 .g-C 3 N 4 was synthesized through the polymerization of urea under a high temperature.Appropriate urea was annealed in an alumina crucible at 520 C for 4 h with a ramp of 4 C/min. 45The light yellow powder was acquired after cooling to room temperature naturally. 2.2.2.Synthesis of Bi-g-C 3 N 4 .The nanohybrids were prepared through a one-step solvothermal process.First, 0.364 g of Bi(NO 3 ) 3 5H 2 O was dissolved in 10 mL of HNO 3 solution (1 M) under magnetic stirring, followed by adding 55 mL of EG and stirring for 30 min.Then, 0.6 g of PVP was introduced to the above mixture under vigorous stirring to obtain homogeneous solution.Subsequently, the obtained g-C 3 N 4 powders with different masses (0.10, 0.30, 0.60, 0.80, and 1.00 g) were added to the above mixture and disposed by ultrasonication for 2 h.Then, the admixture was transferred to a 100 mL Teflon liner stainless-steel autoclave and treated at 160 C for 12 h.At last, the sediments were collected by centrifugation, laved with EG and deionized (DI) water several times, and dried in vacuum at 60 C for 10 h to obtain the Bi-g-C 3 N 4 samples.The as-obtained catalysts with different g-C 3 N 4 masses were marked as BiCN-x, where x (x 0.1, 0.3, 0.6, 0.8, and 1.0) represented the mass amounts of g-C 3 N 4 ."
  },
  {
    "title": "Results_and_Discussion",
    "content": "X-ray diffraction (XRD) was conducted to identify the phase structures.As shown in Figure S1 of the Supporting Information, the characteristic peak at 27.5in the pattern of g-C 3 N 4 corresponds to the (002) plane, which is in accordance with the interplanar stacking of aromatic planes.Another peak could be observed at 13.1caused by the in-planar structure of tri-striazine units. 46The diffraction intensity of BiCN samples (Figure 1) exhibits characteristic peaks of Bi metal Joint Committee on Powder Diffraction Standards (JCPDS) powder diffraction file (PDF) 44-1246 without other impurity peaks, indicating the co-existence of Bi and g-C 3 N 4 in BiCN hybrids.The pointed diffraction peak at 27.5revealed (012) planes of rhombohedral-phase Bi and (002) planes of g-C 3 N 4 . 47Further observation indicates that the diffraction intensities of Bi metal tend to become slightly weaker with the increase of the g-C 3 N 4 content for the BiCN hybrid.Noticeably, no obvious chemical shift of Bi metal in the BiCN composite is detected, illustrating that the structure of Bi in the hybrid is well-maintained. The microstructure of as-obtained materials were observed by scanning electron microscopy (SEM) and transmission electron microscopy (TEM).As shown in Figure 2a, pristine g-C 3 N 4 exhibits a lamellar property with an irregular curly edge.In terms of the BiCN-0.6 nanohybrid (Figure 2b), the morphology has changed to uniform folded layers containing some looming nanospheres of Bi metals.More insights into the morphology could be observed from TEM images.As displayed in Figure 3a, pristine g-C 3 N 4 displays a two-dimensional (2D) layered structure with a smooth edge, matching well with the SEM results shown above. 48TEM of the BiCN-0.6 nanohybrid (panels b and c of Figure 3) displays Bi spheres with a diameter of about 200 nm enwrapped with g-C 3 N 4 species, further revealing that the synthesized Bi nanospheres are deposited on the surface of g-C 3 N 4 .Moreover, the crystal lattice fringes with spacing (0.328 nm) can be obtained in Figure 3d, which is in good agreement with the (021) crystal plane of Bi metal.These images provide strong evidence that a close contact between the metal and semiconductor is formed within BiCN composites.In addition, the energy-dispersive X-ray spectroscopy (EDS) mapping images of C, N, Bi, and O for the BiCN-0.6 sample were carried out to confirm the elemental distribution.As exhibited in Figure 3e, a uniform distribution of expected elements can be observed, illustrating the fact that Bi nanospheres are anchored on g-C 3 N 4 in BiCN-0.6. The surface chemical status and elemental composition for g-C 3 N 4 and BiCN-0.6 complex were elucidated through X-ray photoelectron spectroscopy (XPS) analyses.As shown in Figure S2 of the Supporting Information, the signals representing C 1s, N 1s, and O 1s are observed in g-C 3 N 4 and BiCN-0.6,while major elemental states of Bi 4d, 4p, and 5d are observed in the spectrum of BiCN-0.6.Two peaks centered at 284.8 and 288.3 eV (Figure 4a) can be detected in the C 1s pattern of g-C 3 N 4 and BiCN-0.6,matching with the C-C and N-CN bonds. 49The former peak may be caused by environmental factors and the existence of defect-containing sp 2 -hybridized carbon atoms.The latter can be associated with sp 3 -bonded C of graphitic carbon nitride. 50Figure 4b displays the N 1s spectra for g-C 3 N 4 and BiCN-0.6.The peak at 398.7 eV is associated with sp 2hybridized N bound to C (CN-C), 51 while the intensities of 400.8 and 404.3 eV are attributed to N-(C) 3 and excitations, respectively. 52,53In terms of the high-resolution XPS spectra of BiCN-0.6, the Bi 4f curve in Figure 4c could be deconvolved into four peaks.The intensities of 156.7 and 162.3 eV belong to Bi-Bi bonds of elemental Bi, while the Bi 4f intensities of 157.3 and 164.3 eV are ascribed to Bi ions of bismuth oxides. 54The dominated intensities at 531.2 and 529.8 eV arising from the adsorbed species (H 2 O) with higher energy and Bi-O bonds with lower binding energy can be observed in the O 1s spectrum (Figure 4d). 55The existence of the Bi-O layer covering the Bi sphere can prevent Bi suffering from further oxidation.XRD, SEM, TEM, and XPS consequences verify the successful synthesis of BiCN nanohybrsids with strong interaction and intimate combination. Figure 5 exhibits the N 2 adsorption-desorption isotherms of pristine g-C 3 N 4 and BiCN-0.6 nanohybrids.All adsorption-desorption isotherms show type IV curves with a hysteresis loop based on the BDDT sort, illustrating the existence of the slit-like mesoporous structure arising from the aggregation of plate-like particles within the samples. 56Furthermore, the isotherm of the BiCN-0.6 sample displays the highest adsorption at the value of relative pressure (P/P 0 ) close to 1.0, implying the existence of large meso-and macropores.Detailed data of the textural parameters are given in Table 1 for comparison.It can be seen that the BiCN-0.6 sample possesses the largest specific surface area (90.43 m 2 g -1 ), bigger than g-C 3 N 4 (59.72 m 2 g -1 ).Bi nanoparticles are discretely anchored on the surface of g-C 3 N 4 to achieve a larger specific surface area as well as provide more surface active sites, which is helpful to promote photocatalytic CO 2 reduction. The optical absorption behaviors of all of the fabricated catalysts were examined by ultraviolet (UV) and presented in Figure 6a.For undoped g-C 3 N 4 , a absorption edge at ca. 490 nm is distinctly observed, which means that the optical bandgap energy is 2.53 eV.The charge migration of g-C 3 N 4 originated from the valence band (VB) formed by N 2p orbitals to the conduction band (CB) populated by C 2p orbitals. 57pparently, the absorption intensities of the BiCN nanohybrids show surprising enhancement from the visible light to nearinfrared (NIR) region (450-2500 nm) with the increase of the Bi-depositing content, arising from background absorption and a charge-transfer transition through the interface. 58Thus, the boosted light harvesting of BiCN nanohybrids plays a major role in photogenerating more charge carriers to accelerate the reaction of CO 2 photoreduction.In addition, no significant absorption edge shift of BiCN photocatalysts is detected in comparison to g-C 3 N 4 , illustrating that Bi metal is only deposited on the surface of g-C 3 N 4 .In addition, the band gap of g-C 3 N 4 and BiCN nanohybrids are reckoned through the equation h A(h -E g ) n/2 , where , h, , A, and E g are the absorbance, Planck's constant, frequency of light, constant related to the chemical, and corresponding band gap energy, respectively.Especially, n relies on the transition type of the semiconductor (n 1 and 4 corresponding to the direct and indirect semiconductors, respectively).According to the forenamed information, the band gap energy of g-C 3 N 4 is 2.55 eV (Figure 6b), while the variation of the band gap of BiCN catalysts is in the sequence of Bi-depositing content.BiCN-0.6 possesses the highest photocatalytic performance, with a band gap of 1.78 eV.Therefore, Bi nanoparticles promote the light harvesting that can act as an antenna for light trapping. 59,60hotocatalytic CO 2 reduction reactions of all as-fabricated samples under simulated light irradiation were performed and presented in Figure 7.According to the control experimental results, no hydrocarbon products were detected in the dark environment or without catalyst, demonstrating that the light irradiation and catalysts were all essential for photocatalysis.Figure 7a displays the CO evolution with time.The CO production over BiCN-0.6 attains the maximum of 26.42 mol g -1 during 7 h of illumination, which is about 2.9 times that of pure g-C 3 N 4 .In Figure 7b, the major product is CO, while only a small amount of CH 4 is produced in the photoreduction process.Furthermore, O 2 is also detected as the oxidation product by gas chromatography (GC) (Table 2).Obviously, the BiCN nanohybrids exhibit extremely increased photocatalytic activity for CO 2 reduction, while pure g-C 3 N 4 exhibits a lacking yield of CO and CH 4 , which is attributed to the fast recombination of photoexcitons in pure g-C 3 N 4 and its poor light-harvesting ability.Therefore, this phenomenon may be conjectured that the incorporation of Bi metal facilitates charge transfer and reduces the recombination rate as a result of the formation of a built-in electric field caused by the SPR effect. 61However, an excessive increase of Bi for the compound would restrain the production of CO, which is associated with the blocked light harvesting and the increased recombination centers.Moreover, the photocatalytic stability of the BiCN-0.6 sample was assessed through three sequent tests of photocatalytic CO 2 reduction for 21 h (Figure 7c).Each test was carried out under unanimous requirements, and the gaseous products were discharged by vacuum treatment at the end of each test.The yield of CO displays no obvious change during three cyclic tests, illustrating that the performances of the obtained BiCN samples are stable.The apparent quantum efficiencies (AQEs) for CO 2 reduction at a 420 nm (10 nm) wavelength were estimated via the following equation: For the BiCN-0.6 sample, the quantum yield of CO based on the average production yield was calculated to be 0.198, which was much higher than that of g-C 3 N 4 (0.079).In addition, Table S1 of the Supporting Information summarizes the information about g-C 3 N 4 -based catalysts for photocatalytic CO 2 reduction. For the purpose of further confirming the reliability of the above-mentioned inferences, the separation efficiency of photoexciton was characterized by photoluminescence (PL).As displayed in Figure 7d, g-C 3 N 4 exhibits an intensive fluorescence emission peak located at about 450 nm, caused by the n- electronic migrations of the lone pair of nitrogen atoms in g-C 3 N 4 . 62In terms of BiCN nanohybrids, especially for BiCN-0.6, the PL intensity significantly quenches as a result of the electron accumulation of Bi metal, similar to the Mott-Schottky effect, confirming the efficient separation of phooinduced charge carriers.Apparently, BiCN-0.6 possesses the lowest PL emission intensity, corresponding to the best activity among the activity assessment.In addition, the time-resolved PL decay were carried out to study the lifetime of photoexcitons quantitatively (Figure 7e).Decay curves of g-C 3 N 4 and BiCN-0.6 samples were fitted with a double-exponential decay function, and the lifetime () could be calculated by the following function: 63,64 where A 1 , A 2 , 1 , and 2 are shown in the inset of Figure 7e.The lifetime () of g-C 3 N 4 is 10.5 ns, which declines to 9.47 ns for the BiCN-0.6 nanohybrid, suggesting the increased mobility of photoinduced electron-hole pairs, which can be captured more effectively by the reactants after coupling of g-C 3 N 4 and Bi Meanwhile, photoelectrochemical measurements involving photocurrent and electrochemical impedance spectroscopy (EIS) further illustrate the excitation and transmission of photoexciton in g-C 3 N 4 and BiCN catalysts.Figure 8a exhibits the photocurrent response pattern under irradiation of simulated sunlight in 5 repeated light on-off cycles.BiCN hybrids inherit the carrier transfer properties of pure g-C 3 N 4 and display higher photocurrent intensities.Among them, BiCN-0.6 exhibits the strongest current intensity, implying the fast separation of electrons and holes.To confirm this conclusion, the EIS test was performed and presented in Figure 8b.The semicircular Nynquist pattern of all as-obtained catalysts were recorded to investigate the resistance of charge carrier migration.The semicircle radius of the BiCN-0.6 sample is smaller than that of pristine g-C 3 N 4 , revealing that the resistance in charge transfer of BiCN-0.6 is lower, which also means that the charge migration in the hybrid is faster. 65Thus, the obtained results confirm the increased separation rate and limited recombination of photoinduced charge carriers in this BiCN nanohybrid.Moreover, the band energies of g-C 3 N 4 and BiCN-0.6 were estimated by the Mott-Schottky approach (panels c and d of Figure 8).The flat-band potentials of g-C 3 N 4 and BiCN-0.6 were obtained through extrapolating to C -2 0 with the frequencies of 500 and 1000 Hz.The ordinate C -2 is a function of electrochemical potentials, where the capacitance C is acquired by the impedance measurement.As exhibited in panels c and d of Figure 8, the negative slop in both pure g-C 3 N 4 and BiCN-0.6 illustrates the n-type semiconductor characteristics.Evidently, the flat potentials of g-C 3 N 4 and BiCN-0.6 are -0.65 and -0.93 V versus the Ag/AgCl electrode. 66It is widely accepted that the CB potential of the n-type semiconductor is approximately equal to its flat-band potential (0-0.2 eV more negative). 67,68Thus, the CB positions for g-C 3 N 4 and BiCN-0.6 are about -0.65 and -0.93 eV, respectively, and the VB potentials for them can be calculated from the known band gap, which are about 1.9 and 0.28 eV, respectively.Consequently, the proper band arrangements provide an efficient pathway for electron transmission during the process of CO 2 reduction. In view of the above characterization and analysis, the possible reaction mechanism of efficient photocatalytic CO 2 reduction over Bi metal depositing g-C 3 N 4 catalysts is elaborated in Scheme 1.The promoted photocatalytic performance is mainly ascribed to the introduction of Bi.When the Bi spheres are exposed to visible light, the collective oscillation of electrons on the surface of Bi spheres is generated by the SPR effect to form a strong electric field, which can propel g-C 3 N 4 to capture more photons. 69Meanwhile, a Schottky barrier is formed because of the difference of the work function between g-C 3 N 4 and Bi spheres, implying that Bi could act as an electron-acceptor candidate in the hybrids for CO 2 photoreduction. 70The detailed reaction process is ascribed as follows: Under light illumination, the abundant photoexcited electrons accumulated on the CB of g-C 3 N 4 will be transferred to the Bi metal as a result of the Fermi level of Bi metal -0.17 eV versus normal hydrogen electrode (NHE) being much more positive than that of CB of g-C 3 N 4 , resulting in the effective spatial charge separation. 71Afterward, the holes on the VB of g-C 3 N 4 will react with H 2 O to produce H and O 2 because the oxidation potential of H 2 O to O 2 (1.23 V) is more positive than that of the VB position of g-C 3 N 4 .The survived photogenerated electrons on Bi spheres will react with CO 2 and reduce it to CO and CH 4 on the basis of the reduction potentials of CO 2 /CO (-0.53 V versus NHE) and CO 2 /CH 4 (-0.24V versus NHE).This markedly suppressed recombination of photogenerated charge carriers lead to an expected great performance of photocatalytic CO 2 reduction compared to pure g-C 3 N 4 .The specific reaction processes are as follows: Bi (e ) g C N (h ) 3 4 (2) (3) (4) The relative charge balance details are listed in Table 2."
  },
  {
    "title": "Conclusions",
    "content": "In summary, the non-noble metal Bi was deposited in g-C 3 N 4 through a facile one-step solvothermal approach to fabricate Bi metal/g-C 3 N 4 nanohybrids.The obtained BiCN-0.6 catalyst had the highest activity for photocatalytic CO 2 reduction, with a maximum CO yields of 3.78 mol h -1 g -1 , which was about 2.9 times as high as that of pristine g-C 3 N 4 .The remarkable improvement of the photocatalytic performance is predominantly ascribed as follows: (i) The formation of a Schottky barrier between the metal and semiconductor system could effectively promote the continuous transition of photoinduced charge carriers.(ii) The introduction of a direct plasmonic Bi Scheme 1. Proposed Reaction Mechanism of Photocatalytic CO 2 Reduction on the BiCN Hybrid Energy Fuels metal with SPR effect could promote the light-harvesting capacity.(iii) The larger specific surface area brings more active sites.This work highlights the advantage of metal-semiconductor nanohybrids and provides some meaningful help for exploring g-C 3 N 4 -related catalysts with good photocatalytic efficiency for CO 2 reduction. s Supporting Information The Supporting Information is available free of charge at https://pubs.acs.org/doi/10.1021/acs.energyfuels.1c00439. Characterization, photoelectrochemical measurements, photocatalytic activity evaluation, XRD patterns of g-C 3 N 4 (Figure S1), XPS survey spectra of g-C 3 N 4 and BiCN-0.6 (Figure S2), and g-C 3 N 4 -based composites studied for CO 2 photocatalytic reduction (Table S1) (PDF) REFERENCES Figure 1.XRD patterns of BiCN nanohybrids. Figure 2. SEM pictures of (a) pure g-C 3 N 4 and (b) BiCN-0.6 sample. Figure 3. TEM images of (a) pristine g-C 3 N 4 and (b and c) BiCN-0.6,(d) high-resolution transmission electron microscopy (HRTEM) image of BiCN-0.6, and (e) EDS mapping images of BiCN-0.6. Figure 4. High-resolution XPS of (a) C 1s and (b) N 1s of g-C 3 N 4 and BiCN-0.6 and high-resolution XPS of (c) Bi 4f and (d) O 1s of BiCN-0.6. Figure 5. N 2 adsorption-desorption isotherms for pure g-C 3 N 4 and BiCN catalysts. Figure 6.(a) Ultraviolet-visible (UV-vis) diffuse reflection spectroscopy (DRS) spectra of as-prepared catalysts and (b) (h) 1/2 for the band gap energies of all studied photocatalysts. Figure 7. (a)CO evolution amount in the unit time, (b) CO and CH 4 yield spectra of g-C 3 N 4 and BiCN nanohybrids, (c) cycle characteristic diagram for the BiCN-0.6 sample, (d) PL spectra of all-fabricated samples, and (e) time-resolved PL decay pattern for g-C 3 N 4 and BiCN-0.6 nanohybrid. Figure 8.(a) Transient photocurrent density and (b) EIS of all as-prepared catalysts and Mott-Schottky plots collected for (c) pure g-C 3 N 4 and (d) BiCN-0.6 at 500 and 1000 Hz. metal.The PL and time-resolved PL decay tests show strong evidence of the promoted electron migration in BiCN-0.6. Textural Characteristics for Pristine g-C 3 N 4 and BiCN Catalysts Generation Rate of the Reduction and Oxidation Products of g-C 3 N 4 and BiCN-0.6Catalysts Zhang, Z.-w.; Guo, R.-t.; Tang, J.-y.; Miao, Y.-f.; Gu, J.-w.; Pan, W.g. Fabrication of Bi-BiOCl/MgIn 2 S 4 heterostructure with step-scheme mechanism for carbon dioxide photoreduction into methane.J. CO2 Util.2021, 45, 101453.Highly efficient and ultrafast removal of Cr(VI) in aqueous solution to ppb level by poly(allylamine hydrochloride) covalently cross-linked amino-modified graphene oxide.J. Hazard.Mater.2021, 409, 124470.(8) Jiang, Z.; Wan, W.; Li, H.; Yuan, S.; Zhao, H.; Wong, P. K. A hierarchical Z-scheme -Fe 2 O 3 /g-C 3 N 4 hybrid for enhanced photocatalytic CO 2 reduction.Adv.Mater.2018, 30, 1706108.(9) Shi, H.; Chen, G.; Zhang, C.; Zou, Z. Polymeric g-C 3 N 4 coupled with NaNbO 3 nanowires toward enhanced photocatalytic reduction of CO 2 into renewable fuel.ACS Catal.2014, 4, 3637-3643.(10) Handoko, A. D.; Tang, J. Controllable proton and CO 2 photoreduction over Cu 2 O with various morphologies.Int.J. Hydrogen Energy 2013, 38, 13017-13022.(11) Cao, S.; Liu, X.; Yuan, Y.; Zhang, Z.; Liao, Y.; Fang, J.; Loo, S. C. J.; Sum, T. C.; Xue, C. Solar-to-fuels conversion over In 2 O 3 /g-C 3 N 4 hybrid photocatalysts.Appl.Catal., B 2014, 147, 940-946.(12) Yu, J.; Jin, J.; Cheng, B.; Jaroniec, M. A noble metal-free reduced graphene oxide-CdS nanorod composite for the enhanced visible-light photocatalytic reduction of CO 2 to solar fuel.J. Mater.Chem.A 2014, 2, 3407-3416.(13) Chen, J.; Qin, S.; Song, G.; Xiang, T.; Xin, F.; Yin, X. Shapecontrolled solvothermal synthesis of Bi 2 S 3 for photocatalytic reduction of CO 2 to methyl formate in methanol.Dalton Trans.2013, 42, 15133-15138.(14) Baran, T.; Wojtya, S.; Dibenedetto, A.; Aresta, M.; Macyk, W. Zinc sulfide functionalized with ruthenium nanoparticles for photocatalytic reduction of CO 2 .Appl.Catal., B 2015, 178, 170-176.(15) Hsu, H.-C.; Shown, I.; Wei, H.-Y.; Chang, Y.-C.; Du, H.-Y.; Lin, Y.-G.; Tseng, C.-A.; Wang, C.-H.; Chen, L.-C.; Lin, Y.-C.; Chen, K.-H.Graphene oxide as a promising photocatalyst for CO 2 to methanol conversion.Nanoscale 2013, 5, 262-268.(16) Wang, H.; Sun, Z.; Li, Q.; Tang, Q.; Wu, Z. Surprisingly advanced CO 2 photocatalytic conversion over thiourea derived g-C 3 N 4 with water vapor while introducing 200-420 nm UV light.J. CO2 Util.2016, 14, 143-151.Fabrication of Bi 2 O 2 (OH)NO 3 /g-C 3 N 4 nano- (7) Bao, S.; Yang, W.; Wang, Y.; Yu, Y.; Sun, Y. (17) Qin, H.; Guo, R.; Liu, X.; Pan, W.; Wang, Z.; Shi, X.; Tang, J.; Huang, C. Z-Scheme MoS 2 /g-C 3 N 4 heterojunction for efficient visible light photocatalytic CO 2 reduction.Dalton Trans.2018, 47, 15155.(18) Liu, X.; Guo, R.; Qin, H.; Wang, Z.; Shi, X.; Pan, W.; Tang, J.; Jia, P.; Miao, Y.; Gu, J. https://doi.org/10.1021/acs.energyfuels.1c00439EnergyFuels 2021, 35, 10102-10112 Energy Fuels Corresponding Authors Rui-tang Guo -School of Energy Source and Mechanical Engineering, Shanghai University of Electric Power, Shanghai 200090, People's Republic of China; Shanghai Engineering Research Center of Power Generation Environment Protection, Shanghai 200090, People's Republic of China; orcid.org/0000-0002-5646-5099; Email: grtazju.edu.cnWei-guo Pan -School of Energy Source and Mechanical Engineering, Shanghai University of Electric Power, Shanghai 200090, People's Republic of China; Shanghai Engineering Research Center of Power Generation Environment Protection, Shanghai 200090, People's Republic of China; Email: pweiguo163.comAuthors Jing-wen Gu -School of Energy Source and Mechanical Engineering, Shanghai University of Electric Power, Shanghai 200090, People's Republic of China; Shanghai Engineering Research Center of Power Generation Environment Protection, Shanghai 200090, People's Republic of China Yu-fang Miao -School of Energy Source and Mechanical Engineering, Shanghai University of Electric Power, Shanghai 200090, People's Republic of China; Shanghai Engineering Research Center of Power Generation Environment Protection, Shanghai 200090, People's Republic of China Yuan-zhen Liu -School of Energy Source and Mechanical Engineering, Shanghai University of Electric Power, Shanghai 200090, People's Republic of China; Shanghai Engineering Research Center of Power Generation Environment Protection, Shanghai 200090, People's Republic of China Gui-lin Wu -School of Energy Source and Mechanical Engineering, Shanghai University of Electric Power, Shanghai 200090, People's Republic of China; Shanghai Engineering Research Center of Power Generation Environment Protection, Shanghai 200090, People's Republic of China Chao-peng Duan -School of Energy Source and Mechanical Engineering, Shanghai University of Electric Power, Shanghai 200090, People's Republic of China; Shanghai Engineering Research Center of Power Generation Environment Protection, Shanghai 200090, People's Republic of China Complete contact information is available at: https://pubs.acs.org/10.1021/acs.energyfuels.1c00439Notes The authors declare no competing financial interest. ACKNOWLEDGMENTS This work was financially supported by the National Key RD Program of China (2018YFB0605002)."
  }
]