[
  {
    "title": "Doi",
    "content": "10.1016/j.jcis.2020.02.108"
  },
  {
    "title": "Article_Title",
    "content": "Amine-functionalized graphitic carbon nitride decorated with small-sized Au nanoparticles for photocatalytic CO2 reduction"
  },
  {
    "title": "Abstract",
    "content": "h i g h l i g h t sAmine-functionalized graphitic carbon nitride decorated with Au nanoparticles was prepared.CN/Au exhibited enhanced photocatalytic activity for CO 2 reduction.Time-of-flight secondary ion mass spectrometry confirmed the introduction of amino groups.The introduced amino group improved the adsorption capacity of CN/Au for CO 2 .g r a p h i c a l a b s t r a c t Amine-functionalized graphitic carbon nitride decorated with small-sized Au nanoparticles exhibited the enhanced photocatalytic activity for CO 2 reduction under visible-light irradiation."
  },
  {
    "title": "Experimental",
    "content": "Melamine (99), urea (99) and chloroauric acid, (HAuCl 4 A3H 2 -O, !99.9) were analytical grade and provided by Shanghai Aladdin Biochemical Technology Co., Ltd. The synthesis method of pristine g-C 3 N 4 is consistent with previous reports.Melamine and urea were mixed at a molar ratio of 1:1 and heated to 550 C at a rate of 5 C/min for 4 h.The resulting yellow powders were labeled as CN-0. CN/Au was prepared by N 2 radio frequency plasma treatment of g-C 3 N 4 impregnated with HAuCl 4 A3H 2 O. First, 1.5 g prepared g-C 3 N 4 powders were added to a 36.4 mL solution of HAuCl 4 .3H 2 O (4.2 A 10 A3 mol/L), stirred for 30 min, and then dried at 100 C for 24 h.The entire process was performed under dark conditions.The dried powders were ground and treated with N 2 plasma at room temperature for 30-40 min.The gas flow rate was 20 sscm, and the power was set to 1400 W. The obtained sample was CN/ Au (2.0 wt).With the introduction of amino groups in CN/Au, CN1 was prepared by plasma treatment of g-C 3 N 4 under N 2 -H 2 (1:1) atmosphere without changing the other conditions for comparison.The purpose was to introduce the amino groups into CN1 and to highlight the effect of plasmonic Au nanoparticles on enhancing photocatalytic activity by comparing the photocatalytic activities of CN1 and CN/Au. Fourier-transform infrared (FTIR) spectrum was acquired from Thermo Fisher Nicolet Is10.X-ray diffraction pattern (XRD) was recorded using a Bruker D8 ADVANCE with CuKa as a radiation source at 10 C/min.CO 2 -temperature-programmed desorptionmass spectroscopy (CO 2 -TPD-MS) was performed on AutoChem II 2920 (CO 2 -TPD) equipped with Cirrus 2 (MS).The temperature was raised to 800 C at a heating rate of 10 C/min under He atmosphere.TOF-SIMS was achieved through ION TOF-SIMS 5. Bi was used as an ion source, and the test conditions were: 30 keV, 1.0 pA.Prior to measurement, the equipment was vacuumed to 5 A 10 A9 MPa to remove air.Solid-state 13 C NMR spectra were obtained using a Bruker 400 MHz.Transmission electron microscopy (TEM) images were obtained using FEI Tecnai G2 F20, with an accelerating voltage of 200 kV.Scanning TEM (STEM) images, high-resolution TEM (HRTEM) images, and energy dispersive spectrometry (EDS) were obtained using Tecnai G2 F20 S-Twin TMP.UV-visible diffuse reflectance spectra (UV-vis DRS) were obtained using a PE Lambda 650 s (UV-vis spectrophotometer) with scanning range of 250-800 nm.X-ray photoelectron spectroscopy (XPS) was performed using Axis Supra.Scanning electron microscopy (SEM) images were captured using FEI Inspect F50 (FSEM).Time-resolved photoluminescence (TRPL) was tested using FLSP920 (Edinburgh instrument) under an excitation wavelength of 375 nm and emission wavelength of 460 nm. Under the Xe lamp irradiation, the photoreduction of CO 2 was completed using a photocatalytic online analysis system (Perfect Light Labsolar 6A).Briefly, 30 mg sample and 3 mL ethanol were placed in a shallow dish and sonicated for 5 min.Then, 0.5 mL deionized water was added after drying.Prior to the introduction of CO 2 , the closed glass reactor was vacuumed to remove air.Gas chromatography (FULI 979011) was used to detect the product of photoreduction of CO 2 every 30 min. The characteristics of transient photocurrent response and electrochemical impedance spectra (EIS) of the samples under Xe lamp irradiation were tested on an electrochemical workstation CHI660E (Shanghai Chenhua Co., Ltd., China) equipped with a three-electrode system.Ag/AgCl and Pt wire were used as reference and counter electrodes, respectively.The working electrode was prepared as follows: 30 mg polyethylene glycol and 30 mg sample were mixed and ground with 0.5 mL ethanol.The resulting slurry was coated on a conductive glass with a coating area of 1 cm 2 and then dried at 100 C for 2 h.The electrolyte was 0.5 M Na 2 SO 4 ."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Fig. 1 shows the preparation process of CN/Au.g-C 3 N 4 impregnated with HAuCl 4 A3H 2 O was treated by N 2 plasma, and highenergy electrons were used as reducing agents in the reduction of Au 3 ions to well-dispersed small-size Au nanoparticles (approximately 4.05 nm) supported on g-C 3 N 4 nanosheets.In addition, the H ions in HAuCl 4 A3H 2 O were reduced to H atoms and combined with N atoms ionized by the working gas, thereby introducing amino groups into the CN/Au system. The photocatalytic activity of the prepared catalysts was evaluated by the photoreduction of CO 2 in the absence of cocatalysts and sacrificial agents.Fig. 2a andb show the time-course generation of CO and CH 4 produced by photoreduction of CO 2 over CN/Au, CN1, and CN0.The yields of CO and CH 4 over all the prepared catalysts increased with time, and CN/Au showed the most significant increase in the yield of CO and CH 4 .Fig. 2c andd present the evolution rates of CO and CH 4 over the prepared samples.CN1 showed the lowest activity, which may be due to the competion of proton and carbon species for electrons to generate side reactions during CO 2 reduction.Notably, CN/Au exhibited enhanced activity among the prepared samples.The CO and CH 4 evolution rates of CN/Au measured 28.3 and 1.3 lmolAh A1 Ag A1 , respectively, which were 7.6 and 2.6 times higher than those of CN0.Notably, the selectivity of CN/Au for the conversion of CO 2 to CO reached 85.The enhanced activity of CN/Au for CO 2 photoreduction can be explained as follows.On the one hand, the introduction of amino groups enhanced the adsorption of CN/Au for CO 2 ; on the other hand, the local surface plasmon resonance effects of Au nanoparticles broadened the visible-light response range of g-C 3 N 4 . TOF-SIMS was used to verify the introduction of amino groups in the plasma process as depicted in Fig. 3. Fig. 3a andb display the spectra of positive and negative ions of the CN/Au and CN0, respectively.By bombarding the target with an ion beam, N, H, and the surrounding atoms on the surface of CN/Au were excited to form amino-containing ion fragments, which were detected and analyzed by a mass spectrometer based on the specific mass-to-charge ratio.In the positive ion spectra of CN/Au, a large number of amino-containing ion fragments were detected; these fragments included NH in Fig. 4a) shows lattice stripes with a lattice spacing of 0.235 nm, corresponding to the (1 1 1) plane of Au 29.The size distribution of Au nanoparticles (Fig. 4c) showed an average size of approximately 4.05 nm.The reason for producing Au nanoparticles with small particle size and good dispersion is related to the plasma reduction process.The Coulomb interaction of high-energy electrons with positively charged metal ions caused the crystals to quickly nucleate, whereas the low gas temperature of the cold plasma provided a low-temperature environment for crystal growth 30.The TEM image of g-C 3 N 4 (Fig. 4d) exhibited a typical flaky morphology.The STEM image and corresponding EDS element distributions (Fig. 4e-h) of CN/Au showed that C, N, and Au were evenly distributed. The 13 C solid-state NMR spectra of the samples CN/Au and CN0 in Fig. 5a were used to infer the possible positions of the introduced amino groups.CN/Au and CN0 showed two peaks at chemical vibrations of 156.2 (CN 3 ) and 164.5 ppm (CN 2 (NH 2 )), respectively 31.Compared with that of CN0, the chemical shift and signal shape of the C atoms in CN/Au have not changed significantly, which indicates that the chemical environment around the C atoms has not been destroyed 32, thereby eliminating the possibility that the introduced amino groups formed bonds with C atoms.The XRD patterns of CN/Au, CN1, and CN0 in Fig. 5b determine the lattice structure of the samples.The characteristic peaks of g-C 3 N 4 at 13.1and 27.1were detected in all samples, corresponding to the crystal planes (1 0 0) and (0 0 2), respectively 33.In addition, the detected diffraction peaks at 38.3and 44.5i n CN/Au were attributed to the (1 1 1) and (2 0 0) planes of Au, respectively, confirming that Au nanoparticles were loaded on g-C 3 N 4 34,35.Fig. 5c displays the optical absorption spectra of CN/Au, CN1, and CN0.Compared with that of CN1 and CN0, the optical absorption of CN/Au was enhanced, and the light response range extended to the infrared region.In addition, an additional absorption peak observed in the DRS of the CN/Au at approximately 550 nm was attributed to the plasmon resonance absorption of Au nanoparticles 36, proving the possibility of hot electron generation in CN/Au.Fig. 5d shows the FTIR spectra of CN/Au, CN1, and CN0.The samples all showed similar chemical structures, and this finding proves that plasma reduction caused no damaging effect on the sample structure.The peaks between 3000 and 3300 cm A1 were associated with the stretching vibration of the amino group 37. XPS was conducted to further determine the possible positions of the amino groups introduced in CN/Au.The survey spectra (Fig. 6a) of CN/Au indicated the presence of C, N, Au, and O in the sample.The Au 4f spectra (Fig. 6b) of CN/Au can be fitted with two peaks at binding energies of 88.1 (Au 4f 5/2 ) and 84.4 eV (Au 4f 7/2 ) 38, consistent with the characteristic peaks of Au.As shown in Fig. 6c, the C1s spectra of CN/Au, CN1, and CN0 can be divided into two peaks at 287.9 (C-(N) 3 ) and 284.8 eV (CAC) 39.The N1s spectra (Fig. 6d) of the samples can be divided into three peaks: at 400.8 (NAH), 400.1 (NA(C) 3 ), and 398.5 eV (CNAC) 40.Particularly, the area ratios of CN/Au, CN1, and CN0 at 400.8 eV were 0.18, 0.13, and 0.12, further confirming the introduction of amino groups.In addition, the area ratios of these samples at 398.5 eV (CNAC) were 0.48, 0.62, and 0.58, which indicate that high-energy electrons destroyed CN bonds of CN/Au, so the introduced amino groups formed bonds with N atoms, thereby forming C 2 ANANH 2 . Based on the above discussion, a mechanism of enhanced photocatalytic activity for CO 2 reduction over CN/Au was proposed (Fig. 7).When the catalyst entered the plasma region, high- According to Schottky-Mott theory, Schottky junctions are formed when Au nanoparticles contact with g-C 3 N 4 .g-C 3 N 4 is an n-type semiconductor, and the work function of g-C 3 N 4 (W g- C3N4 4.3 eV) 41 is considerably lower than that of Au (W Au 5.3-eV) 42,43.Therefore, when g-C 3 N 4 is excited by visible light to generate electron-hole pairs, the electrons on the g-C 3 N 4 conduction band will be transferred to the Au nanoparticles (step 1) until their Fermi levels become consistent 44,45; the holes remaining on the valence band are consumed by the reaction with H 2 O to generate O 2 and H ions.In addition, the energy band of the semiconductor side is bent, which prevents electrons from flowing back and improving electron transfer efficiency.In this process, the Au nanoparticles act as electron receivers, and the Schottky junction causes the electrons to be transferred directionally, inhibiting the recombination of carriers. For small-sized Au nanoparticles, non-radiative decay of plasmons will form hot electron-hole pairs 22.High-energy hot electrons transfer energy to surrounding electrons through electronelectron or electron-phonon scattering, which activates the surrounding electrons and causes the local temperature rise 46.As shown in step 2, the hot electrons transferred energy to the electrons transferred from g-C 3 N 4 to the Au nanoparticles.The electrons were captured by the adsorbed CO 2 molecules and reacted with the H 2 O molecules present in the environment to generate CO and CH 4 (step 3).The activation of hot electrons increased the efficiency of photoreduction of CO 2 . Further characterizations were performed to verify the proposed mechanism for the enhanced photocatalytic activity of CN/ Au.The adsorption of CO 2 on the catalyst surface is an important step in the photoreduction of CO 2 .Fig. 8a andb show the CO 2 -TPD-MS curves of CN/Au and CN0.A broad desorption peak of CO 2 appeared between 383 C and 491 C (Fig. 8a) due to the chemical adsorption between the alkaline sites and the desorption amount of CO 2 of CN/Au was larger than that of CN0 at 455 C (Fig. 8b).This finding proves that the adsorption capacity of CN/ Au for CO 2 was enhanced after the introduction of amino groups.Fig. 8c shows the lifetime and migration of carriers for CN/Au in the TRPL spectroscopy.The average lifetime of CN/Au (6.53 ns) is longer than that of CN0 (6.32 ns).Long average lifetime implies the high possibility of electrons being captured by reactants to participate in the reduction reaction of CO 2 47,48.The transient photocurrent response (Fig. 8d) and electrochemical impedance (inset of Fig. 8d) of CN/Au and CN0 support the improved carrier separation and migration of CN/Au.The photocurrent density of CN/Au is higher than that of CN0 and the arc radius is smaller than that of CN0.This indicates that the carrier separation of CN/Au is improved.49505152.Therefore, we confirmed that the Schottky junction in CN/Au improves carrier migration, thereby improving the activity of CO 2 photoreduction."
  },
  {
    "title": "Conclusions",
    "content": "Amine-functionalized g-C 3 N 4 decorated with Au nanoparticles (CN/Au) were prepared by N 2 plasma treating g-C 3 N 4 powders impregnated with HAuCl 4 A3H 2 O. CN/Au showed enhanced CO 2 photoreduction activity under visible-light irradiation.The enhanced photocatalytic activity was inseparable from the synergistic effects of the introduction of amino groups, activation of hot electrons, and Schottky junction between Au and g-C 3 N 4 .Plasma reduction of metal particles may introduce new groups, which is rarely studied.Modification of the catalyst by amino functional groups can enhance the adsorption and activation of CO 2 by catalyst and further improve the photocatalytic activity of the catalyst in CO 2 reduction.Therefore, we hypothesized that during the reduction of Au nanoparticles by N 2 plasma, amino groups were introduced into the CN/Au system.The introduction of amino groups was confirmed by TOF-SIMS spectra and the possible position of the amino groups was inferred from Solid-state 13 C NMR spectra.Compared with previous reports of amino-modified photocatalysts 18,21,53, this work further discusses the formation mechanism of amino groups and their bonding with catalysts.This work provides insights for designing highly efficient semiconductor-metal photocatalysts modified with specific functional groups. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Fig.1.Illustration of the synthesis of CN/Au by treating g-C 3 N 4 powders impregnated with HAuCl 4 A3H 2 O using N 2 plasma.Well-dispersed Au nanoparticles with a small particle size (approximately 4.05 nm) were deposited on g-C 3 N 4 nanosheets.In addition, the amino groups were introduced into the CN/Au system because the H ions in HAuCl 4 A3H 2 O were reduced to H atoms by high-energy electrons and combined with N atoms ionized by the working gas. Fig. 2. (a) Time evolutions of CO and (b) CH 4 over CN/Au, CN1, and CN0.(c) Rates of CO and (d) CH 4 production by the reduction of CO 2 over CN/Au, CN1, and CN0 under 300 W Xe lamp irradiation. Fig. 3. (a) Positive and (b) negative TOF-SIMS spectra of CN0 and CN/Au.(c) TOF-SIMS images of amino-containing species of CN/Au (50 lm A 50 mm). Fig. 4. (a) TEM and HRTEM images of CN/Au.(b) STEM image of CN/Au.(c) Size distribution of Au nanoparticles for CN/Au.(d) TEM image of CN0.(e-h) STEM image and corresponding EDS element distributions of CN/Au. Fig. 5. (a) Solid-state 13 C NMR spectra of CN/Au and CN0, (b) XRD patterns, (c) UV-Vis DRS spectra, and (d) FTIR spectra of CN/Au, CN1, and CN0. Fig. 6.(a) XPS survey spectra of CN/Au, CN1, and CN0; (b) high-resolution XPS spectra of Au 4f for CN/Au, and (c) high-resolution XPS spectra of C 1s, (d) N1s, and (e) O1s for CN/Au, CN1, and CN0. Fig. 7. Proposed mechanism for the photocatalytic reduction of CO 2 by CN/Au, the synergistic effects of the introduced amino groups, activation of hot electrons, and Schottky junction between Au and g-C 3 N 4 enhance the photocatalytic activity of CN/Au. Fig. 8. (a, b) CO 2 -TPD-MS data, (c) TRPL spectra, (d) transient photocurrent response, and EIS Nyquist plots (inset) of CN/Au and CN0. . Li et al. / Journal of Colloid and Interface Science 570 (2020) 11-19 Methodology, Visualization, Writing -original draft, Investigation.Haiping Zhou: Investigation, Methodology, Data curation.Jiajie Fan: Data curation, Conceptualization.Quanjun Xiang: Supervision, Writing -review editing, Methodology, Funding acquisition. F. Li et al. / Journal of Colloid and Interface Science 570 (2020) 11-19 This work was partially supported by the National Natural Science Foundation of China under Grant No. 51672099 and 21403079, Sichuan Science and Technology Program under No. 2019JDRC0027, Fundamental Research Funds for the Central Universities under No. 2017-QR-25. Supplementary data to this article can be found online at https://doi.org/10.1016/j.jcis.2020.02.108."
  }
]