[
  {
    "title": "Doi",
    "content": "Doi not found"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic reaction of H20+CO2 over pure and doped Rh/TiO2"
  },
  {
    "title": "Abstract",
    "content": "In the photocatalytic reduction of carbon dioxide to formic acid, formaldehyde and methanol in aqueous suspensions of TiO2 and Rh/TiO2, the effects of doping the TiO2 with W 6 were investigated."
  },
  {
    "title": "Experimental",
    "content": "Catalyst powder (0.3 g) was suspended in triply distilled water in a pyrex glass cell.Highly purified CO2 gas was bubbled at 120 ml per min through a watersuspended catalyst by means of a peristaltic pump.The suspension was illuminated through the pyrex window by a 500 W high pressure Xe lamp.The reaction temperature was set by a surrounding water jacket in which the temperature of circulating water was regulated by an ultra thermostat.Chemical actinometry showed that the radiation power entering the reactor vessel from the lamp used was 680 lxW per cm 2. The exit gas from the reaction flask was led into traps cooled to 273 K, each containing about 10 ml of distilled water.The content of the reaction flask and the traps were filtered, and the liquid was analysed.Formic acid and formaldehyde were analysed by Grant's method 12, while methanol was determined by a Hewlett Packard gas chromatograph using a 2.5 ml long column of Porapak QS."
  },
  {
    "title": "Results_and_Discussion",
    "content": "First, the effects of two TiO2 samples from different suppliers (MCB and BDH) on the reaction between H20 and CO2 were examined.A well-measurable photoreaction was observed at 333 K, but there was a significant difference between the catalytic effects of the two samples.On the more effective TiO2 (MCB), both HCHO and HCOOH were produced, whereas on the other sample (BDH), only HCHO was detected, and in a smaller amount.Evacuation and mild reduction of the catalysts slightly increased the amount of HCHO, and traces of CH3OH were then also observed. Doping of the TiO2 (BDH) with even a very small amount (0.1 mol) of WO3 greatly enhanced the production of HCHO, without the formation of other products. A significant change in the product distribution occurred when Rh (1) was deposited on the TiOz.The amount of HCHO formed was half of that measured on TiOa alone, but HCOOH and CH3OH were also produced.The total amount of products was higher than on TiOa alone. Deposition of Rh on TiOz containing 2 WO3 further increased the amount of HCOOH formed.When the Rh/TiOa was preliminarily reduced, the yield of photolysis became higher and the product distribution changed.The major compound formed was now CHaOH; HCHO and HCOOH were detected only in traces.Characteristic results for different samples are shown in table 1. In the interpretation of the results obtained it should be taken into account that TiOa is an n-type semiconductor, the electric conductivity of which is greatly increased when it is doped with the higher-valent W 6 3,13.The fact that this doping enhanced the rate of photolysis may suggest that the predominant step in the photocatalytic reaction is the generation of photoelectrons and formation of the radical anion CO 2: e- C02 CO 2 .This step is promoted by increase of the electron concentration in the TiO2. Further steps involve the protonation of CO 2 by H20 and an additional electron transfer to give HCOOH 7: CO 2 H20 ,-HCO2 OH-HC02 e- HCOO-HCOO- H HCOOH.This is followed by further reduction to HCHO. As the total yield of organic compounds was greatly increased in the presence of Rh, it may be concluded that CO2 is activated more easily on Rh/TiOz than on TiO2.This leads to a very effective catalyst for the catalysis of CO2 hydrogenation, even in the dark 1.Another important factor in this phenomenon, however, is the electronic interaction between Rh and TiO2 due to the different work functions (the work function of Rh is 5.6 eV, and that of reduced TiO2 is 4.6 eV); other supported Rh catalysts (Rh/SiO2, Rh/MgO, Rh/A1203) are much poorer catalysts than Rh/TiO2 1.It is important to mention that recent spectroscopic evidence revealed that the presence of electron-donating additives on Rh surfaces promotes formation of the radical anion CO 14.Illumination of an adsorbed layer containing neutral CO2 further increased the surface concentration of CO both on Rh(111) 15 and on Rh/TiO2 16. In the presence of Rh however, the photoinduced splitting of H20 and the formation of active hydrogen should also be taken into account.An analogous phenomenon was clearly demonstrated when Pt was deposited on SrTiO3 17.As a result, CH3OH appeared as a product of photoreduction.The formation of CH3OH was particularly favoured on the reduced Rh/TiO2 catalyst, which exhibited the highest photoactivity (table 1).The fact that the amount of HCHO formed is much less on Rh/TiO2 than on TiO2 may be due to its fast decomposition on Rh 18 as compared with the decompositions of HCOOH and CHaOH 19,20."
  },
  {
    "title": "Conclusions",
    "content": "(i) An increase in the electron concentration of TiO2 enhances the production of organic compounds from the reaction CO2 H20 on both TiO2 and Rh/TiO2 as catalysts.(ii) Deposition of Rh on TiO2 also enhanced the yield of photolysis, and preliminary reduction of the catalyst led to the formation of CH3OH. Solymosi, L Tombitcz / Photocatalytic CO 2 reduction over Rh/ Ti02 H20 CO2 photoassisted reactions over TiO2 and Rh/TiO2, T 333 K The values presented are steady state values determined in 5 h.The formation of organic compounds occurred even after 20 h of irradiation.The activity of the catalysts decreased only by about 10.Note that under buffered conditions the amounts of organic compounds were somewhat higher. This laboratory is a part of the Center for Catalysis, Surface and Material Science at the University of Szeged.9 J.C. Baltzer AG, Science Publishers"
  }
]