[
  {
    "title": "Doi",
    "content": "10.1016/j.jcis.2021.09.014"
  },
  {
    "title": "Article_Title",
    "content": "Dye-Sensitized Fe-MOF nanosheets as Visible-Light driven photocatalyst for high efficient photocatalytic CO2 reduction"
  },
  {
    "title": "Abstract",
    "content": "Dye-sensitized system holds great potential for the development of visible-light-responsive photocatalysts not only because it can enhance the light absorption and charge separation efficiency of the systems but also because it can tune the band structure of catalysts.Herein, two-dimensional (2D) Fe-MOF nanosheets (Fe-MNS) with a LUMO potential of 0.11 V (vs.RHE) was prepared.Interestingly, it has been found that when the 2D Fe-MNS catalyst was functionalized with visible-light-responsive Ru(bpy) 3 2 as a dye-sensitizer, the electrons from the Ru(bpy) 3 2 can effectively inject into the 2D Fe-MNS, which resulted in a negative shift of the LUMO potential of the 2D Fe-MNS to A0.15 V (vs.RHE).Consequently, the Ru(bpy) 3 2 /Fe-MNS catalytic system exhibits a sound photocatalytic CO 2 -to-CO activity of 1120 lmol g -1 h A1 under visible-light-irradiation. The photocatalytic CO production was further ameliorated by regulating the electronic structure of the 2D Fe-MNS by doping Co ions, achieving a remarkable photocatalytic activity of 1637 lmol g -1 h A1 .This work further supports that the dyesensitized system is an auspicious strategy worth exploring with different catalysts for the development of visible-light-responsive photocatalytic systems."
  },
  {
    "title": "Experimental",
    "content": "All the chemical reagents used in this manuscript were analytical grade and used as received without additional purification, and 18.2 MO deionized water was used for the preparation of the aqueous solutions.N, N-dimethylformamide (DMF, 99.8, Aladdin), ethanol (99.5, Aladdin), 1,4-terephthalic acid (H 2 BDC, 99, Aladdin), triethylamine (TEA, 99.5, Meryer), Fe(NO 3 ) 3 A9H 2 O (99, Aladdin), and Co(NO 3 ) 2 (99, Aladdin), were used as raw materials for the preparation of the 2D Fe-MNS and 2D Co-Fe-MNS samples.Na 2 SO 4 (98, Sigma-Aldrich) was used as an electrolyte precursor.Acetonitrile (greater than99, Aladdin), triethanolamine (TEOA, 98, Aladdin) were used as a solvent and sacrificial reagent, respectively.Ruthenium bipyridine (Ru(bpy) 3 2 , 95, Aladdin) was used as a dye-sensitizer. The 2D Fe-MNS was synthesized according to the previous report 30.Typically, 32 mL of N, N-dimethylformamide (DMF), 2 mL of ethanol, 2 mL of deionized water (DI), and 0.75 mmol of 1,4-terephthalic acid (H 2 BDC) were added in a 50 mL beaker.Then, the solution was fully dispersed by sonication.To the above dispersion solution, a 0.375 mmol of Fe(NO 3 ) 3 A9H 2 O was added.After stirring for 5 min, a 0.8 mL of triethylamine (TEA) was added and further stirred for an additional 10 min.Finally, a uniform colloidal suspension was collected by centrifugation at 8500 rpm and washed 3 times with ethanol and freeze-drying.The 2D Codoped Fe-MNS was prepared by following the same protocol as that of the synthesis of the 2D Fe-MNS except adding the desired amount of Co(NO 3 ) 2 together with Fe(NO 3 ) 3 A9H 2 O.As a comparison, 2D Co-MOF nanosheets (2D Co-MNS) were prepared using the same protocol as that of the 2D Fe-MNS, in which the Fe(NO 3 ) 3 -A9H 2 O as a Fe precursor was replaced by Co(NO 3 ) 2 as a Co precursor. Scanning electron microscope (SEM) was examined using Hitachi S-4800 SEM.Transmission electron microscopy (TEM) was studied on a JEOL 2010F TEM.X-ray diffraction measurements (XRD) were carried out at room temperature using a Philips X' Pert Pro X-ray diffractometer equipped with a Cu Ka radiation.UV-vis diffuse reflectance spectra (DRS) were recorded using an Agilent-Cary 5000 spectrometer equipped with an integrating sphere.Xray photoelectron spectroscopy (XPS) and valence band spectra were measured on an ESCA Lab MKII X-ray photoelectron spectrometer equipped with Al-Ka X-ray radiation.Steady-state photoluminescence (PL) spectra were recorded on a Hitachi H-4600 spectrometer equipped with a Xe lamp.Time-resolved PL decay spectra were recorded (FLS980, Edinburgh Instruments Ltd) with the time-correlated single-photon counting (TCSPC) mode. The working electrode was prepared by dip-coating method and 0.5 mol/L of Na 2 SO 4 solution (pH 6.8) was used as the electrolyte.Typically, 1 mg of the catalyst was dispersed into 0.5 mL of ethanol and 10 mL of Nafion solution to form a slurry.Then, the slurry was dip-coated on the clean FTO conductive glass with an exposure area of 1 cm 2 .Subsequently, the film was dried in a vacuum oven at 60 C.Mott-Schottky (MAS) plots, photocurrent, and electrochemical impedance spectroscopy (EIS) measurements were performed on a CHI 660D electrochemical workstation (Shanghai Chenhua, China) with a three-electrode system using the sample-coated ITO glass as photoelectrode, Pt foil as a counter electrode, and Ag/AgCl electrode as reference electrode, respectively. The photocatalytic CO 2 reduction reaction experiments were studied in the Pyrex cell with a side irradiation window and equipped with the circulation water system.The temperature was controlled at room temperature (20 C).A 300-W Xe lamp (Solar edge 700, set at 100 mW cm A2 ) covered with a 420 nm cut-off filter was used as a light source.In a typical experiment, 5 mg of catalyst was suspended in a mixed solution of 5 mL of acetonitrile, 1 mL of triethanolamine (TEOA), and 20 mg of Ru (bpy) 3 . Before the photocatalytic reaction, the reaction cell was evacuated and refilled with high-purity CO 2 three times to remove O 2 and other possible gases.Then, the CO 2 -saturated solution was irradiated under visible light irradiation.The produced amount of gas was quantified by gas chromatography (GC7820A, Agilent).To test the stability of photocatalysts, four consecutive photoreaction runs (3 h each) were conducted using recycling catalysts, keeping other parameters constant."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The morphology and phase purity of the synthesized 2D Fe-MNS sample were investigated by SEM, TEM, and XRD patterns.The SEM images in (Fig. 1A and1B) with different magnifications together with the TEM image in (Fig. 1C) reveal that the synthesized Fe-MNS sample is composed of some 2D sheet-like particles.The XRD pattern in (Fig. 1D) shows that the diffraction peaks of these 2D Fe-MNS are well-matched with the simulated peaks.No other impurity peaks were observed, indicating that the synthesized sample is some phase-pure of Fe-MOF crystals, which is well-matched with the previous report 30.All the above characterizations together confirm that the 2D Fe-MNS with a sheet-like morphology was successfully prepared.Generally, such kind of 2D nanosheets possesses a large surface area, which can provide more catalytic active sites for photocatalytic reaction. The optical properties and band structure of the 2D Fe-MNS sample were studied by UV-vis DRS and MAS plots, respectively.The DRS result in (Fig. 2A) shows that the 2D Fe-MNS catalyst has a good absorption feature in the visible-light region.The bandgap of the 2D Fe-MNS sample was calculated using Tauc plots (inset of Fig. 2A), which is estimated to be ca.2.72 eV.The MAS plot in (Fig. 2B) indicates that the 2D Fe-MNS is an n-type semiconductor material with a flat-band potential (E fb ) located at 0.11 V (vs.RHE).Since the flat-band potentials of MOF materials are very close to their LUMO position.Hence, the LUMO position of the 2D Fe-MNS is estimated to be located at 0.11 V (vs.RHE).From the measured bandgap (2.72 eV) and LUMO position (0.11V) of the 2D Fe-MNS, therefore, the HOMO potential of the 2D Fe-MNS is estimated to be located at 2.83 V (vs.RHE) as depicted in (Fig. 2C), which is well-matched with the previous report 24. Theoretically, for an ideal semiconductor material to drive photocatalytic CO 2 -to-CO reduction it should have a conduction band (CB) or LUMO potential located at a more negative potential than that of the CO 2 /CO (-0.10 V vs. RHE) 31.Of note, the LUMO potential of the 2D Fe-MNS catalyst is lower than the theoretical reduction potential of CO 2 /CO.Interestingly, it has been found that the E fb of the 2D Fe-MNS catalyst in the functionalized Dye/Fe-MNS sample is negatively shifted to about A0.15 V (vs.RHE) (see Fig. 2B).Accordingly, its LUMO position is estimated to be located at A0.15 V (vs.RHE) as schematically depicted in Fig. 2D, which straddles well to the theoretical reduction potential for CO 2 /CO under visible light irradiation.It has been reported that the Ru (bpy) 3 2 dye has a LUMO and HOMO located at A0.9 and 1.59 V (vs.RHE), respectively 32.Hence, we speculate the possible reason for the negatively shifted LUMO potential of the 2D Fe-MNS in the functionalized Dye/Fe-MNS sample is that under the sensitization of the Ru(bpy) 3 2 dye molecules, the photogenerated electrons from Ru(bpy) 3 2 can effectively be injected to the LUMO of the 2D Fe-MNS.Under the non-equilibrium condition of light irradiation, the continuously injected electrons will increase the charge-occupied state of the 2D Fe-MNS 33.As a result, the Fermi level of the 2D Fe-MNS will be raised to a high quasi-Fermi energy level, and thus the LUMO potential of the 2D Fe-MNS can be raised to a more negative potential than the reduction potential of CO 2 / CO. The photocatalytic potentials of the pure 2D Fe-MNS and the functionalized Dye/Fe-MNS samples were examined for photocatalytic CO 2 reduction under visible-light irradiation (k !420 nm).The photocatalytic CO 2 reduction was carried out in saturated CO 2 with TEOA as an electron-donating reagent.The detailed information and reaction conditions are given in the experimental section. As expected, the result in (Fig. 3A) indicates that no photocatalytic CO production was observed in the case of using pure 2D Fe-MNS as a photocatalyst, which might be presumably due to its insufficient LUMO potential for photocatalytic CO generation.While a CO production rate of 105 lmol g -1 h A1 was achieved when merely pure Ru(bpy) 3 2 dye was used as a photocatalyst.Significantly, a pronounced photocatalytic CO production of 1120 lmol g -1 h A1 was achieved when the 2D Fe-MNS catalyst was functionalized with Ru(bpy) 3 2 dye with an optimum amount of the Ru (bpy) 3 2 dye ca.20 mg as shown in Fig. 3B, demonstrating that the dye-sensitized system is an effective approach for the high efficient photocatalytic CO 2 reduction under visible light irradiation.Moreover, the CO production rate of the Dye/Fe-MNS under different single-wavelength irradiation (10 nm) were also tested (see Fig. S1).The profile of CO production rate is well-consistent with the absorption spectrum of the Ru(bpy) 3 2 dye, demonstrating that the main light absorber in the photocatalytic system is mainly due to the contribution of the strong visible-light-response from the Ru(bpy) 3 2 dye. It is worth mentioning here that in the heterogeneous photocatalytic systems, light-harvesting, charge separation and transfer, and charge utilization are playing crucial roles in boosting the efficiency of photocatalytic systems 34,35.Among these, the charge separation efficiency is the key determining factor 36,37.Generally, bulk or surface doping foreign elements, forming solid solutions, and loading cocatalysts are always desirable for enhancing the charge separation efficiency and boosting the photocatalytic activity of the semiconductor photocatalysts 38.To further ameliorate the photocatalytic CO production of the Dye/Fe-MOF catalyst, therefore, the electronic structure of the 2D Fe-MNS catalyst was further engineered by doping Co ions (termed as Co-Fe-MNS).Interestingly, the result in (Fig. 3A) indicates that the photocatalytic CO production of the Dye/Co-Fe-MNS is remarkably increased, achieving a noteworthy activity of 1637 lmol g -1 h A1 with a Co-doping concentration of 1.5 as shown in (Fig. 3C).Moreover, time-dependent activity in (Fig. 3D) indicates that the photocatalytic CO production of both Dye/Co-Fe-MNS and Dye/ Fe-MNS are steady-state increased.This result demonstrating that the proposed system is efficient and stable for photocatalytic CO 2 reduction under visible-light irradiation. To identify the origin of the photocatalytic CO 2 reduction, a series of control experiments were carried out under the same experimental condition.The result in Table S1 indicates that when merely using Dye/Fe-MNS without light, Dye/Fe-MNS without CO 2 and light, or CO 2 without Dye/Fe-MNS, no gas product was detected, implying that the photocatalytic product of CO gas is certainly originated from the photocatalytic CO 2 reduction using Dye/ Fe-MNS as a photocatalyst. The Co-doped 2D Fe-MNS catalyst was further examined by TEM, XRD pattern, and XPS.The TEM image in (Fig. 4A) shows that the Co-Fe-MNS still maintains the same 2D sheet-like morphology as that of the 2D Fe-MNS, and the XRD pattern (Fig. 4B) also shows that Co-doping does not alter the crystal structure of the 2D Fe-MNS.In addition, the MAS plot of Co-Fe-MNS sample was measured (see Fig. S2), indicating that Co doping in the 2D Fe-MNS does not change its LUMO position.The surface compositions and binding energies of the Co-Fe-MNS sample were investigated by the high-resolution XPS spectrum.The XPS survey spectrum in Fig. S3 shows the presence of the Co, Fe elements, confirming the successful doping of Co ions into 2D Fe-MNS catalyst.The XPS spectra of Fe 2p in the 2D Fe-MNS and Co-Fe-MNS samples were comparatively investigated in (Fig. 4C).The XPS spectrum of Fe 2p in pure 2D Fe-MNS shows binding energies of Fe 2p 1/2 and Fe 2p 3/2 at 710.76 and 724.01 eV, respectively, while the XPS spectrum of Fe 2p in the Co-doped Fe-MNS sample shows binding energies of Fe 2p 1/2 and Fe 2p 3/2 at 710.93 and 724.13 eV.The result indicates that the binding energies of the Fe 2p 1/2 and Fe 2p 3/2 in the Co-doped Fe-MNS sample are positively shifted to high binding energies by about 0.17 eV and 0.12 eV, respectively than that of the Fe 2p in pristine 2D Fe-MNS, implying that the electron cloud density around Fe ions is decreased.Besides, the high-resolution XPS spectra of the Co 2p in Co-doped 2D Fe-MNS and Co-MNS samples were also comparatively studied to further elucidate the effect of Co-doping in manipulating the electronic structure of the 2D Fe-MNS.The XPS spectrum of Co 2p in the Co-Fe-MNS sample exhibits binding energies at 780.86 and 796.40 eV, corresponding to Co 2p 1/2 and Co 2p 3/ 2, respectively (Fig. 4D).In contrast, the XPS spectrum of Co 2p in the Co-MNS sample shows binding energies at 780.79 and 796.62 eV.This result reveals that the binding energies of the Co 2p 1/2 and Co 2p 3/2 in the Co-Fe-MNS sample are negatively shifted to lower binding energies by about 0.11 eV and 0.18 eV, respectively, demonstrating that the electron cloud density around Co ions is increased.As already discussed in the previous section, the photocatalytic CO production is remarkably increased after the successfully doping of Co ions into the 2D Fe-MNS catalyst.Interestingly, the high-resolution XPS analyses indicate that the electronic structure of the 2D Fe-MNS is optimized after the Co-doping, which benefits the charge separation and transfer efficiencies.This result further supported that the remarkable photocatalytic CO production rate of the Dye/Co-Fe-MNS catalyst is attributed to the engineering of the electronic structure of the 2D Fe-MNS 39. Furthermore, the photocatalytic stability of the Dye/Co-Fe-MNS catalyst was assessed by repeating the photocatalytic experiment in four consecutive runs.The result in Fig. S4 exhibits that no obvious activity decay was observed, demonstrating the good stability of the Dye/Co-Fe-MNS catalyst under the photocatalytic condition.Likewise, the TEM and XRD after four runs were also tested (see Fig. S5).The result showed that no morphology and crystal structure changes were observed in the catalyst, which further confirms the good stability of the developed Dye/Co-Fe-MNS hybrid catalyst. To elucidate the essential reason for the remarkable photocatalytic CO production rate of the Dye/Fe-MNS and Dye/Co-Fe-MNS catalysts, it is important to study the kinetics of charge separation efficiencies of the pure Ru(bpy) where i corresponds to the i th component of a given multiexponential decay process.The corresponding rate constant (K et ) of which can be obtained by: The fitting parameters are shown in Table1.The result in (Fig. 5B) shows that the fluorescence decay spectrum of the Ru (bpy) 3 2 exhibits a single exponential decay with an average lifetime of about 14.32 ns.While the functionalized Dye/Fe-MNS and Dye/Co-Fe-MNS samples indicate that the average lifetime of the Ru(bpy) 3 2 is significantly reduced to 2 and 1.73 ns, respectively, enlightening that the excited electrons from the Ru (bpy) 3 2 dye were effectively transferred to the surface of the catalysts, particularly, to the surface of the Co-Fe-MNS sample.Moreover, the photocurrent measurements of the 2D Fe-MNS, Dye/Fe-MNS, and Dye/Co-Fe-MNS samples were also carried out in (Fig. 5C).As expected, the Dye/Co-Fe-MNS catalyst exhibits a higher photocurrent response than that of the Dye/Fe-MNS and 2D Fe-MNS, respectively.This result further confirms that the high efficient charge separation and transfer of the Co-doped 2D Fe-MNS sample.EIS spectra of samples in (Fig. 5D) show that the Dye/Co-Fe-MNS sample has a small semispherical radius than those of the Dye/Fe-MNS and 2D Fe-MNS samples, respectively, implying a superior charge separation and transfer of the Dye/ Co-Fe-MNS.Additionally, the examination of the PL spectra, photocurrent measurement, EIS of the optimized amount of the Dye/ Co-Fe-MNS catalyst system in Fig. S6, implying the consistent of the results with the photocatalytic result in (Fig. 3 C).All above PL, EIS, and photocurrent measurement results together implied that Co-doped 2D Fe-MNS catalyst can significantly facilitate the charge separation and transfer.Hence, the remarkable photocatalytic CO production of the Dye/Co-Fe-MNS sample can be under-stood due to the synergetic effect of bimetallic Co-Fe for facilitating the charge separation and transfer, providing more catalytic active sites on the surface for the photocatalytic reaction, and enhancing the absorption and desorption energy of the intermediate product. It is important to understand the reaction mechanism of the photosensitized system.Therefore, the possible mechanism of the Dye/Fe-MNS catalytic system was schematically proposed in Fig. 6.During the photocatalytic reaction of the Dye/Fe-MNS system, the Ru(bpy) 3 2 dye can absorb visible light, which resulted in photogenerated electrons and holes at its LUMO and HOMO, respectively.Via intersystem transition, the excited electrons from Ru(bpy) 3 2 are relaxed to the Ru(bpy) 3 2 and then injected into the surface of the 2D Fe-MNS catalyst, which caused the photocatalytic reduction reaction of CO 2 -to-CO 40.Meanwhile, the photogenerated holes at HOMO of the Ru(bpy) 3 2 will be effectively consumed by the electrons donating sacrificial reagent (TEOA)."
  },
  {
    "title": "Conclusions",
    "content": "In summary, an efficient and stable visible-light-driven photocatalytic system over a dye-sensitized 2D Fe-MNS catalyst for photocatalytic CO 2 reduction was demonstrated.In which, a visible-light responsive dye-sensitizer Ru(bpy) 3 2 was functionalized with the 2D Fe-MNS catalyst.The mechanism investigation of the Dye/Fe-MNS system indicates that during the photosensitizing processes the electrons from the Ru(bpy) 3 2 dye can be effectively injected into the 2D Fe-MNS, which resulted in the negative shift of the LUMO potential of the 2D Fe-MNS catalyst to fit for the theoretical thermodynamic reduction potential of CO 2 /CO.As a proof of concept, the Dye/Fe-MNS system exhibits a significant photocatalytic CO production rate of 1120 lmol g -1 h A1 under visible-light irradiation (k !420 nm).Furthermore, the photocatalytic activity of the 2D Fe-MNS was further ameliorated by regulating its electronic structure by Co-doping, achieving a remarkable photocatalytic CO production rate of 1637 lmol g -1 h A1 .This work provides a simple strategy for tuning the band structures of MOF-based photocatalysts and designing high efficient photocatalytic systems. Ahmed Mahmoud Idris: Investigation, Writing -original draft.Xinyan Jiang: Investigation, Methodology.Jun Tan: Investigation, Formal analysis.Zhenzhi Cai: Investigation.Xiaodan Lou: Investigation.Jin Wang: Software, Supervision.Zhengquan Li: Conceptualization, Writing -review editing. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Scheme 1. Scheme diagram of the preparation of 2D Fe-MNS and dye-sensitized system. Fig. 1. (A, B) SEM images of 2D Fe-MNS in different magnifications; (C) Typical TEM image of 2D Fe-MNS; (D) XRD patterns of the prepared 2D Fe-MNS. Fig. 2. (A) DRS spectrum and corresponding Tauc plots (inset) of 2D Fe-MNS; (B) MAS plots of 2D Fe-MNS and Dye/Fe-MNS; (C and D) band diagram of 2D Fe-MNS and Dye/ Fe-MNS, respectively. Fig. 3. (A) Photocatalytic CO production of 2D Fe-MNS, Dye, Dye/Fe-MNS, and Dye/Co-Fe-MNS; (B) Optimizing the amount of dye in the Dye/Fe-MNS catalyst (keeping 5 mg Fe-MNS constant); (C) Optimizing the Co-doping amount in the Co-Fe-MNS catalyst; (D) Time-dependent photocatalytic activities over different samples. Fig. 4. (A) TEM image of the Co-Fe-MNS catalyst.(B) XRD patterns of the 2D Fe-MNS and Co-Fe-MNS catalyst.(C and D) Comparison of the high-resolution XPS spectra of Fe 2p between Co-Fe-MNS and 2D Fe-MNS; XPS spectra of Co 2p between Co-Fe-MNS and Co-MNS. Fig. 5. (A) PL spectra of pure Dye, Dye/Fe-MNS, and Dye/Co-Fe-MNS; (B) Transient PL spectra of the Ru(bpy) 3 2 , Dye/Fe-MNS, and Dye/Co-Fe-MNS samples; (C-D) Photocurrent density and EIS of the 2D Fe-MNS, Dye/Fe-MNS, and Dye/Co-Fe-MNS. Fig. 6.The proposed mechanism of the Ru(bpy) 3 2 dye-sensitized 2D Fe-MNS system for the visible-light-driven photocatalytic CO 2 -to-CO reduction. Fitting parameters of TRPL curves for the Ru(bpy) 3 2 , Dye/Fe-MNS, and Dye/Co-Fe-MNS samples. Journal of Colloid and Interface Science 607 (2022) 1180-1188 The authors acknowledge financial support from the National Nature Science Foundation of China(nos 21975223 and Supplementary data to this article can be found online at https://doi.org/10.1016/j.jcis.2021.09.014."
  }
]