[
  {
    "title": "Doi",
    "content": "10.1039/c4cy01201a"
  },
  {
    "title": "Article_Title",
    "content": "Barium zirconate: a new photocatalyst for converting CO<sub>2</sub> into hydrocarbons under UV irradiation"
  },
  {
    "title": "Abstract",
    "content": "In this study, photocatalytic activities of BaZrO 3 for CO 2 reduction were investigated in detail.BaZrO 3 samples were successfully obtained via a Pechini process at different temperatures.The prepared samples were characterized by X-ray diffraction (XRD), BET surface area measurement, UV-vis absorption spectroscopy, scanning electron microscopy (SEM) and transmission electron microscopy (TEM).The effects of the deposition of various metal nanoparticles on the surface of BaZrO 3 were also discussed.The results proved that the highly dispersed silver nanoparticles play a crucial role in improving the photocatalytic activities of BaZrO 3 ."
  },
  {
    "title": "Experimental",
    "content": "The BaZrO 3 samples were prepared using the same method as that reported by our previous paper. 26Stoichiometric amounts of ZrIJNO 3 ) 4 J5H 2 O and BaIJNO 3 ) 2 (both are of analytical reagent grade) were initially prepared in a beaker.Then, a mixture of 60 wt citric acid monohydrate IJC 6 H 8 O 7 , purity 99.9) and 40 wt ethylene glycol IJC 2 H 6 O 2 , purity 99.9) (the molar ratio of citric acid to total cations was fixed at 2 : 1) was added to the beaker.Subsequently a solution was acquired by adding distilled water to the beaker.This solution was homogenized by stirring at room temperature for about 1 h.Then the prepared clear solution was evaporated in a baking oven at 343 K until a brown resin was formed.The obtained resin was heated for 6 h at 673 K to remove the majority of the organics.After that, the obtained solid was ground using an agate mortar, and finally thermally sintered at different temperatures (1173, 1273, 1373, 1473 K) for 10 h under air atmosphere. Noble metals (Ag, Au, Pt) were deposited on the surface of BaZrO 3 as the different cocatalysts through liquid phase chemical reduction according to a reported method. 19A cation solution (AgNO 3 , HAuCl 4 , H 2 PtCl 6 ) of 0.1 mol L -1 was added to 30 ml of an aqueous suspension containing 0.2 g of BaZrO 3 .After adding an equimolar amount of NaH 2 PO 2 (0.4 mol L -1 ) with respect to the cation in the suspension, the mixture was stirred at 333 K for 1 h.The obtained mixture was washed with distilled water and dried at 343 K in air.Then the sample was annealed at 573 K for 1 h. 29he deposition of Cu and Ru cocatalysts was carried out via an impregnation method.The corresponding cation solution (CuCl 2 , IJNH 4 ) 2 RuCl 6 ) and calcination at 723 K for 1 h were selected as the conditions of the impregnation method. The reduction treatment was carried out under H 2 gas flow at 573 K for 2 h. The data of the crystal structure and the phase purity were collected by a powder X-ray diffractometer (Ultima III, Rigaku, Japan) using Cu K radiation.The acceleration voltage was 40 kV, and the emission current was 40 mA.The diffractograms were recorded in the 2 range of 20to 80at a scan rate of 10min -1 .The UV-vis reflectance spectra were recorded with a UV-vis spectrophotometer (UV-2550, Shimadzu, Japan) using BaSO 4 as the background.The specific surface area of the BaZrO 3 samples was determined by BET measurement (TriStar-3000, Micromeritics, USA) using nitrogen adsorption at 77 K. Transmission electron microscopy (JEOL 3010) was employed to characterize the surface morphologies of BaZrO 3 powder and silver nanoparticles.The gas products were detected using a gas chromatograph with a double-FID (GC-2014, Shimadzu, Japan). The photocatalytic reaction was executed in a cylindrical quartz cell.A plate glass loader filled with the fresh sample (0.1 g) was placed in the cell.The reaction system was connected with a traditional vacuum system and stabilized at ambient temperature by flowing cool water.After the sample was loaded, the reaction system was evacuated to about 1 mTorr using a mechanical pump and then sealed.Carbon dioxide (99.99 pure) was transmitted into the reaction system until the pressure reached 93.5 kPa.Before adding 0.4 ml of distilled water into the reaction system, the distilled water was heated at 100 C in order to drive out the dissolved O 2 .Then, the sample absorbed CO 2 and water vapor for 8 h in the dark with the gas circulator working.Before illumination, 1 ml of the gas sample was withdrawn and injected into the gas chromatograph by using a gas-tight syringe (1 ml) and the analysis was used as the reference. In the experiments, a 300 W Xe lamp (PE 300BUV) was used as the light source.The whole reaction system was tightly closed during the irradiation.According to the analysis using the gas chromatograph, methane was the major hydrocarbon in all these experiments.Therefore, the direct measure of activity toward CO 2 photoreduction was referenced to the methane yield.To make sure that the hydrocarbon products were attributed to the photoreduction of CO 2 , three contrast tests were carried out.The first one was UV-illuminated without the catalyst, the second one was the dark reaction under the same experimental conditions and the third one was illuminated with the photocatalyst in the absence of CO 2 .All the reactions have been repeated more than five times to confirm the reproducibility and consistency of the photocatalytic experiment."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The crystal structures of the samples prepared from 1173 to 1473 K were detected by XRD measurement, as shown in Fig. 1.The sample prepared at higher temperature showed a higher intensity and narrower diffraction peaks, indicating the improvement of the crystallinity.For the sample prepared at 1173 K, the XRD diffraction patterns of BaCO 3 could be found, which should be attributed to the relatively low calcination temperature in the synthesis process.According to the XRD patterns, the lattice parameter of BaZrO 3 prepared at 1273 K could be calculated as 4.18 A, which is consistent with other reports. 30Pure BaZrO 3 could also be obtained via the solid state reaction at relatively high temperature about 1873 K. 31 The UV-vis and BET surface data have been acquired.The specific surface area of BaZrO 3 obtained at 1273 K was 2.30 m 2 g -1 .And the absorption edge of BaZrO 3 is located at about 260 nm, which indicates that BaZrO 3 is a wide-band gap semiconductor.The band gap of BaZrO 3 is estimated to be 4.8 eV, which is obtained by processing the UV-vis spectra data of BaZrO 3 using the Kubelka-Munk method.The calculated band gap of BaZrO 3 has been reported to be 3.2 eV, 26 which is less than the experimental value, due to one electron approximation. Just as depicted in Fig. 2, no hydrocarbons were detected in the above blank experiments.The three blank reactions illustrated that both the photocatalyst and the light irradiation were indispensable for the CO 2 photoreduction process.Fig. 2 also depicts the amount of CH 4 produced from the above photocatalytic system containing different photocatalysts prepared at different temperatures under UV-light irradiation for 8 h.It could be found that the BaZrO 3 samples prepared at different temperatures show similar photoreduction activity.All the BaZrO 3 samples showed relatively low photocatalytic activity, which should be ascribed to the low BET surface and the low efficiency of the electron-hole separation.The experimental results also showed that CH 4 was the primary product in the gaseous photocatalytic CO 2 reduction system using BaZrO 3 as the photocatalyst.The selective formation of CH 4 rather than other hydrocarbons (such as CH 3 OH and CO) might be attributed to the redox potential of CH 4 /CO 2 E 0 IJCH 4 /CO 2 ) -0.24V versus NHE, pH 7.00 which is much lower than that of CO/CO 2 E 0 (CO/CO 2 ) -0.53V versus NHE, pH 7.00 or CH 3 OH/CO 2 E 0 IJCH 3 OH/CO 2 ) -0.38V versus NHE, pH 7.00. 32,33o confirm the effect of the cocatalyst on the photocatalytic activities, various noble metal particles were deposited on the surface of BaZrO 3 prepared at 1273 K. Au, Pt, and Ag nanoparticles were obtained by the liquid chemical reduction method, while the Cu and Ru particles were prepared by an impregnation method.The CH 4 evolution rates over the BaZrO 3 samples with different cocatalysts deposited (BaZrO 3 -0.5 wt Pt, BaZrO 3 -0.5 wt Ag, BaZrO 3 -0.5 wt Cu, BaZrO 3 - 0.5 wt Au, BaZrO 3 -0.5 wt Ru) under illumination for 6 hours are shown in Fig. 3. According to the results shown in Fig. 3, three samples (BaZrO 3 -0.5 wt Pt, BaZrO 3 -0.5 wt Ag, BaZrO 3 -0.5 wt Au) exhibited higher photoactivity than the pure BaZrO 3 (1273 K) shown in Fig. 2, whereas the other two samples (BaZrO 3 -0.5 wt Cu, BaZrO 3 -0.5 wt Ru) showed a much lower photoactivity than the pure BaZrO 3 .The sample BaZrO 3 -0.5 wt Ag exhibited the highest photocatalytic efficiency.The coverage and adsorption of CO 2 may be more feasible to carry out on the surface of BaZrO 3 -0.5 wt Ag, which would result in a better photoreduction activity in contrast to the other samples.To find the optimal deposition amount of Ag nanoparticles, BaZrO 3 samples with various weight ratios of Ag (0.5 wt, 0.3 wt, 0.1 wt) deposited were chosen for further investigation, and the results are shown in Fig. 4. The Ag deposition can increase the methane yield owing to the increasing amount of active sites.As shown in Fig. 4, BaZrO 3 -0.3wt Ag showed higher photoactivity than BaZrO 3 -0.1 wt Ag.The BaZrO 3 -0.5 wt Ag sample exhibited relatively lower photoactivity than BaZrO 3 -0.3wt Ag, which should be attributed to the excess Ag deposition that covered the surface of BaZrO 3 and hampered the light absorption, depressing the photogenerated e --h separation efficiency. The BaZrO 3 powder with 0.3 wt Ag deposited was investigated by SEM, TEM and HRTEM (Fig. 5).The Ag nanoparticles could be found from the SEM microphotograph, as shown in Fig. 5(a).The TEM image in Fig. 5(b) clearly displayed that the silver nanoparticles aggregate on the BaZrO 3 surface with an average size of about 5 nm, which agreed with the report before. 19The enlarged high resolution transmission electron microscopy (HRTEM) image of the selected area (Fig. 5(c)) exhibited well-defined lattice fringes with an interplanar spacing of 0.29 nm corresponding to the (110) plane of BaZrO 3 .The adjacent lattice fringes also have a lattice spacing of 0.24 nm which coincided with the (111) plane of silver.The continuity of lattice fringes between BaZrO 3 and Ag verified the formation of a Schottky barrier between them.Under the observed projections, other particles with diameters of about 15 nm were found on the edge of BaZrO 3 particles.Since their sizes were much smaller than that of BaZrO 3 , it may be attributed to the excessive aggregation of the silver particles.The SEM, TEM and HRTEM images proved that silver nanoparticles dispersed on the surface of the BaZrO 3 uniformly.These silver nanoparticles changed at the beginning stage of the photocatalytic reduction which results in the increase of the photocatalytic activities.Under UV light irradiation, the electrons in the valence band (VB) are excited by the photon to the conduction band (CB).The CO 2 or intermediate molecules adsorbed on the surface of BaZrO 3 could be reduced by the photogenerated electrons.Due to the large band gap of BaZrO 3 , the utilization of irradiation light is limited, which may lead to relatively low photocatalytic activity.However, the deposition of silver on the surface of BaZrO 3 enhanced the photocatalytic efficiency.In the case of silver deposited BaZrO 3 , the photogenerated electrons are trapped by silver nanoparticles under UV light, which leads to a better interfacial charge transfer and a sharp decrease in the recombination rate.This is attributed to its E F level which is lower than the CB of BaZrO 3 . 34When this semiconductor-metal composite is exposed to UV light, the photogenerated electrons in BaZrO 3 transfer to silver nanoparticles and this continues until they attain equilibrium, which shifts the Fermi level of the semiconductor-metal composite upward and increases the negative potential of silver. 34,35This negative shift in E F leads to better charge separation and more reductive power for the catalyst system.At the interface of silver and BaZrO 3 , a Schottky barrier is formed, which would promote the separation of the charge carriers through accumulating electrons in silver and remaining holes in BaZrO 3 . 3,36373839"
  },
  {
    "title": "Conclusions",
    "content": "The photocatalytic properties of BaZrO 3 as a new photocatalyst for CO 2 reduction have been investigated.The BaZrO 3 samples obtained at 1273 K with 0.3 wt Ag nanoparticles deposited showed the highest photocatalytic activities.Under UV light irradiation, the Ag nanoparticle deposited BaZrO 3 showed higher photocatalytic activities than the samples with other metal nanoparticles deposited.The deposition of Ag nanoparticles on BaZrO 3 results in more efficient separation of the photogenerated electron-hole pairs, and the electron transmission mechanism should be further investigated in detail to enhance the photocatalytic activity of BaZrO 3 . Fig. 1 XRD patterns of BaZrO 3 synthesized at 1173, 1273, 1373 and 1473 K. Fig. 2 The products were detected in three blank reactions and the CH 4 yield of pure BaZrO 3 prepared at different temperatures (1273, 1373 and 1473 K). Fig. 3 CH 4 yields of BaZrO 3 deposited with different cocatalysts (Ru, Cu, Au, Pt, Ag) having the same apparent amount. Fig. 4 CH 4 yields of BaZrO 3 with different amounts of Ag deposition. Fig. 5 (a) SEM microphotograph of BaZrO 3 deposited with 0.3 wt Ag.(b) TEM pattern and (c) HRTEM pattern of 0.3 wt Ag deposited BaZrO 3 . This journal is The Royal Society of Chemistry 2015 This work is supported by the National Basic Research Program of China (973 Program, 2013CB632404), a project funded by the Priority Academic Program Development of Jiangsu Higher Education Institutions, New Century Excellent Talents in University (NCET-12-0268), the National Natural Science Foundation of China (no.51272102 and 21103070), and the Open Research Fund of Hunan Key Laboratory of Applied Environmental Photocatalysis (ccsu-KF-1404), Changsa University."
  }
]