[
  {
    "title": "Doi",
    "content": "10.1039/x0xx00000x"
  },
  {
    "title": "Article_Title",
    "content": "Boosting Photocatalytic CO 2 Reduction of Metal-Organic Frameworks by Encapsulating Carbon Dots"
  },
  {
    "title": "Abstract",
    "content": "Photocatalytic CO 2 reduction is a promising technology to mitigate the global warming and enrich energy supply.Metalorganic frameworks (MOFs) are prospective photocatalysts for CO 2 reduction, but severe charge recombination and limited visible light response largely restrain their applications.As carbon dots (CDs) can act as both electron receptors and photosensitizers, here we propose to develop CD-hybridized MOF photocatalysts for improving their activity for CO 2 reduction.In particular, because of the small size of CDs, we have managed to encapsulate CDs inside MOF particles and found these CDMOFs exhibit hugely improved photocatalytic activity compared with CD-decorated MOFs or pristine MOFs.Our investigations suggest that placing small CDs cocatalyst near the internal metal-oxo clusters of MOFs can help efficient charge transfer and separation in the hybrid photocatalysts, due to the formation of many small heterojunctions among MOFs.The developed CD-hybridized MOFs catalysts have been characterized in detail and their working mechnism is explored.This work may demostrate a novel strategy to develop MOF-based hybrid photocatalyst with enhanced photocatalytic activity."
  },
  {
    "title": "Experimental",
    "content": "The protocol for the preparation of CDs is adapted from a previous report by Yang et al with slight modifications in the batch volume and sample collection. 24In a typical experiment, 1.05 g citric acid monohydrate (5 mmol) and ethylenediamine (335 L) were dissolved in 25 mL deionized (DI) water under magnetic stirring.The solution was then transferred to a Teflon-lined autoclave (50 mL) and heated at 200 oC for 5 h.After cooled down to room temperature, the product was obtained by centrifuging with a speed of 8 000 rpm. Washed with DI water twice, the product was dispersed in 10 mL DI water for further use.The concentration of obtained CDs solution is about 28.6 mg/mL. NH 2 -UiO-66 particles were prepared by solvothermal method according to a previous report, but the detailed condition has been slightly modified. 22At the beginning, 40.6 mg ZrCl 4 (0.174 mmol) and 23.5 mg 2-aminoterephthalic acid (H 2 ATA, 0.130 mmol) were dissolved in 30 mL N,N-dimethylformamide (DMF).Next, 3.6 mL of acetic acid (HAc) was added into above solution under vigorous stirring for controlling the growth rate of MOF nanoparticles.Then, the mixed solution was transferred into a 50-mL Teflon-lined autoclave and heated at 120 oC for 24 h.After cooled down to room-temperature, the product was collected by centrifuging with a speed of 8 000 rpm. Washed with DMF and ethanol twice, respectively, the product was dried at 60 oC in vacuum overnight. In a typical synthesis, 40.6 mg ZrCl 4 (0.174 mmol) and 23.5 mg H 2 ATA (0.130 mmol) were dissolved in 30 mL DMF under vigorous stirring.Next, 3.6 mL HAc and 70 L of the above prepared CDs (28.6 mg/mL) were added to the solution.The mixed solution was subsequently transferred to a 50-mL Teflon-lined autoclave and heated at 120 oC for 36 h.After cooled down to room-temperature, the product was collected by centrifuging with a speed of 6 000 rpm and washed with DMF and ethanol twice, respectively.Finally, the product was dried at 60 oC in vacuum overnight.The as-synthesized product was composed of CD-embedded NH 2 -UiO-66 particles and denoted as CDNH 2 -UiO-66. Typically, 25 mg of the as-synthesized NH 2 -UiO-66 particles were dispersed in 5 mL ethanol under ultrasonic treatment.Then, 70 L of the prepared CDs solution (28.6 mg/mL) were added into the MOF solution and the mixed solution was stirred overnight.Next, the solution was put on a water-bath and the solvent was slowly evaporated till a solid product was formed.The as-prepared product was composed of CD-decorated NH 2 -UiO-66 particles and denoted as CD/NH 2 -UiO-66. Transmission electron microscopy (TEM) was performed on a JEOL 2010F TEM.Steady-state photoluminescence spectra were recorded on a Hitachi H-4600 spectrometer equipped with a Xe lamp.Raman spectra were tested using Raman Microscope equipped with a 532-nm laser beam (Thermo Please do not adjust margins Please do not adjust margins Fisher Scientific DXR).Scanning electron microscope (SEM) was performed on a Hitachi S-4800 SEM.Fourier transform infrared (FTIR) spectra were recorded on a Nicolet NEXUS670 spectrometer using KBr pellets method.X-ray powder diffraction (XRD) patterns were recorded on a Philips X'pert X-ray diffractometer with Cu K radiation.UV-Vis diffuse reflectance spectra (DRS) were recorded on an Agilent-Cary 5000 spectrometer equipped with an integrating sphere.Mott-Schottky plots, photocurrent and electrochemical impedance spectroscopy (EIS) were performed on a CHI 660D electrochemistry workstation (Shanghai Chenhua, China) with a three-electrode system using the sample-coated FTO glass as photoelectrode, Pt foil as counter electrode, and Ag/AgCl electrode as reference electrode, respectively.Photoluminescence decay curves were acquired on an Edinburg FLS920 spectrometer equipped with a nanosecond flashlamp. The photocatalytic CO 2 reduction was carried out in a 35-mL optical reaction vessel under magnetic stirring at ambient temperature with a branch pipe for vacuum and gas input.The irradiation light source is a Xe lamp (set at 100 mW cm -2 ) equipped with a UV cutoff filter to obtain visible light (420 nm).In a typical procedure, 5 mg catalyst was dispersed in 5 mL CH 3 CN and 1 mL triethanolamine (TEOA, sacrificial agent).Prior to light irradiation, the suspension was sealed and treated by evacuating and flowing with high purity CO 2 gas for 15 min for removing air.After repeating the process of evacuation and CO 2 flow twice, the solution was irradiated by the Xe lamp to initiate the photocatalytic reaction.The reduction products in gas phase were measured by gas chromatography (GC, Agilent 7820A, Ar gas) equipped with a thermal conductivity detector (TCD) and a flame ionization detector (FID).The concentration of gas products was determined using a standard curve which has been calibrated by the standard gas."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Small and high-quality CDs were prepared by polymerization of citric acid and ethylenediamine and followed by carbonization, a classic protocol developed by Yang et al. 24 Fig. 1A displays a typical TEM image of the prepared CDs, in which uniform and dispersive dot-like nanoparticles can be observed.Size analysis of these dots suggests that the prepared CDs have a narrow size distribution with an average diameter of 3.2 nm (Fig. 1B).Clear lattice fringes can be distinguished on these CDs, showing their crystalline nature.The interplanar spacing is about 2.4 A (inset of Fig. 1 A), in good consistent with the (100) plane of graphitic carbon. 25ig. 1C gives the excitation-dependent PL spectra of the sample, a characteristic PL feature of CDs due to their rich in surface states. 26These CDs exhibit a sharp and strong emission peak at 430 nm under the excitation of 340 nm.Fig. 1D is a typical Raman spectrum of the prepared CDs in which two obvious peaks centered at 1350 cm -1 and 1585 cm -1 were observed, corresponding to the characteristic D band and G band of carbon materials. 27A high intensity in the G band indicates that plenty of carbon atoms are in sp 2 configuration, which enabling them with high electron conductivity.The D band is associated with the structural defects which are originated from disordered sp 2 carbon atoms among crystals or on the surface. 28hese defects are able to supply trap states in the CDs, which can be employed to trap and reserve photogenerated electrons during photocatalysis. 18o utilize above prepared CDs as cocatalysts for MOF photocatalysts, two hybridizing strategies are proposed, namely decorating and encapsulating, respectively (see Scheme 1).When the MOF photocatalysts (i.e., NH 2 -UiO-66) were synthesized, the pre-synthesized CDs could be mixed with MOF particles in solution.Owing to the different surface potentials of two types of materials (see Fig. S1), negatively charged CDs can be facilely absorbed on positively charged NH 2 -UiO-66 particles, resulting in the formation of CDdecorated MOF particles (i.e., CD/NH 2 -UiO-66). One the other hand, once small CDs were employed as heterogeneous seeds in the starting reagents for growing NH 2 -UiO-66 particles, they could participate in the sequential self-assembly of MOF units under solvothermal condition (see Scheme S1).Following a bottle-around-ship strategy, 29,30 these CDs would be encapsulated in the MOF matrixes, leading to the production of CD-embedded MOF particles (i.e., CDNH 2 -UiO-66). Typical TEM and SEM images of CD/NH 2 -UiO-66 are shown in Fig. 2A and 2B, respectively.The prepared CD/NH 2 -UiO-66 particles are uniform in size with an average diameter of 180 nm.Each particle displays an octahedral appearance, similar to the pre-synthesized NH 2 -UiO-66 particles (Fig. S2).Under high-resolution TEM mode (Fig. 2C), many tiny dot-like particles of 3-4 nm could be observed on the MOF surface, confirming the presence of surfacedecorated CDs.When the CDs were encapsulated among MOF particles, the prepared CDNH 2 -UiO-66 particles display a similar octahedron morphology but their average size is about 150 nm (Fig. 2D and2E), a little smaller than pristine NH 2 -UiO-66 particles synthesized without the CD seeds (Fig. S2).Meanwhile, a few black dots were observed under the MOF shells (Fig. 2F).The smaller size of CDNH 2 -UiO-66 should be resulted by the introduction of CDs as seeds during the synthesis (Scheme S1), since heterogeneous seeds generally lead to fast nucleation of MOF crystals and lower the monomer concentration for subsequent growth. 31Despite the slight variation in size, the main difference between CD/NH 2 -UiO-66 and CDNH 2 -UiO-66 is the location of CDs in the hybrid particles. To confirm the presence of CDs, FTIR spectra and XRD patterns were used to characterize pristine NH 2 -UiO-66 and two hybrid samples.In the FTIR spectra (Fig. 3A), two peaks at 1569 cm -1 and 1258 cm -1 became intensified in the CDhybridized samples, corresponding to the stretching vibration of -COOH and the shear vibration of -C-NH-groups. 23The increased signals should come from the integrated CDs (Fig. S3) because they were synthesized by the polymerization of citric acid and ethylenediamine. 24The XRD patterns of three samples can all be indexed to standard NH 2 -UiO-66 crystal, and no obvious peaks from CDs were observed due to their ultrasmall sizes (Fig. 3B).Note that the peak intensity of CDNH 2 -UiO-66 is obviously lower than that of pristine NH 2 -UiO-66.This is attributed to the fact that the encapsulated CDs among MOF crystals can reduce the periodicity of crystal lattices of MOFs to some extend. 32For directly verifying the encapsulated CDs in the CDNH 2 -UiO-66 particles, we also managed to dissolve the NH 2 -UiO-66 framework by 1M KOH solution and collected the residual colloids in solution.Both TEM image and excitationdependent PL spectra confirm that the collected colloids are fluorescent CDs (see Fig. S4), showing that the preencapsulated colloids were indeed the CDs seeds. Pristine NH 2 -UiO-66 particles exhibit an absorption edge around 440 nm, lacking obvious light response in the visible range (Fig. 4A).Owing to the abundant surface groups with strong - and n- transitions, CDs display a wide range of light absorption in the visible range. 21When coupled with CDs, two hybrid samples also exhibit obvious light response in the visible range.In particular, the visible-light response become intensified when the CDs were encapsulated inside NH 2 -UiO-66 particles, because the incident light was scattered inside MOF pores and could be multiply absorbed by internal CDs. 22Corresponding Tauc plots of the absorption spectra (Fig. 4B) also indicate that the absorption of CD-hybridized NH 2 -UiO-66 particles shifts toward the lower energy direction, confirming the additional visible light absorption of CDs.Fig. 4C gives the Mott-Schottky measurements of samples for determining their conduction band (i.e., E cb ).The result indicates that the addition of CDs did not change the E cb position of NH 2 -UiO-66 particles.However, the lower slop of CD-hybridized samples discloses a higher concentration of electron donor (N D ), 33 implying that CDs may play as electron Please do not adjust margins Please do not adjust margins donors in the system under light irradiation.The E cb position of NH 2 -UiO-66 is about -0.69 V (vs.NHE, pH0), which is sufficiently negative to the reduction potential of CO 2 to CO (- 0.52 V vs. NHE, pH0), satisfying the thermodynamic requirement for CO 2 photoreduction (Fig. 4D). After above preliminary thermodynamic analysis, we are now in a position to evaluate the photocatalytic CO 2 reduction of pristine NH 2 -UiO-66 and two CD-hybridized samples.The test was conducted in CH 3 CN solution using TEOA as sacrificial agent under visible light irradiation (400780 nm), and each photocatalytic parameter was confirmed by control experiments (see Fig. S5).Identified by GC, we only detected CO in the gas product and no obvious H 2 signal was observed.Control experiment using isotopic 13 CO 2 as gas source confirmed that the CO product in this system was indeed from the input CO 2 (Fig. S6).The production rate of CO was about 3.5 mol g cat -1 h -1 with pristine NH 2 -UiO-66 catalyst, and the rate was slightly improved to 4.0 mol g cat -1 h -1 with CD/NH 2 -UiO-66 (Fig. 5A and5B).Strikingly, the CO production was hugely enhanced to 16.6 mol g cat -1 h -1 with CDNH 2 -UiO-66, which is about 4.7 times higher than that of pristine NH 2 -UiO-66.This result indicates that the embedded CDs can play a more positive effect than the decorated ones on MOF surface, showing that the location of CDs greatly affect the photocatalytic activities of MOF photocatalysts. The activity of CDNH 2 -UiO-66 can also be regulated by the embedding amount of CDs (Fig. 5C).Working as cocatalysts, it is known that CDs can serve as electron receptors to help charge separation of the main photocatalysts. 21herefore, the photocatalytic activity of CDNH 2 -UiO-66 can be improved as the increase of CDs amount.However, excessive CDs as cocatalysts may also serve as recombination centers which in turn do harm to their photocatalytic activity. 34r this reason, we found that the CDNH 2 -UiO-66 prepared with 70 L of CDs solution (28.6 mg/mL, 4 wt. in final sample) show the optimal performance (Fig. 5C).The hybrid CDNH 2 -UiO-66 catalyst also displays excellent stability during photocatalytic experiments.There is no obvious decrease in activity after ten runs, and the catalyst can well maintain its phase and morphology after collection, as determined by the SEM and XRD measurements (Fig. S7). To understand why the location of CDs plays a determining role in MOF photocatalysts, photocurrents and EIS measurements were performed to investigate the charge separation and transfer in these samples.Compared with pristine NH 2 -UiO-66, the photocurrent was improved after CDs decoration, indicating the formation of heterojunction enhanced the charge separation (Fig. 6A).With the same amount of CDs, the embedded sample displays a remarkably higher photocurrent.This result implies that encapsulating cocatalysts inside MOFs can separate the charges carriers more efficiently than decorating them on the MOF surface.In NH 2 -UiO-66 particles, since photogenerated electrons and holes are generated from the Zr-oxo clusters (photocatalytic units), 9 internal CDs directly connecting these clusters will in situ build lots of small heterojunctions for charge separation.As a result, photogenerated electrons from Zr-oxo clusters can be swiftly transferred to nearby CDs in the CDNH 2 -UiO-66 particles.In contrast, the electrons need to migrate to the MOF surface and subsequently reached the decorated CDs in the CD/NH 2 -UiO-66 particles. In EIS data, pristine NH 2 -UiO-66 displays a large charge transfer resistance due to the low electron conductivity of MOF materials (Fig. 6B).Integration of conductive CDs to NH 2 -UiO-66 can enhance their electron conductivity, and thus the CD-hybridized samples show obviously reduced charge transfer round the MOF surface.Above photocurrents and EIS data also confirm that CDs are good electron receptors for charge transfer and separation when coupled with MOF photocatalysts. Besides serving as electron receptors, it is known that CDs may simultaneously play as photosensitizers in photocatalytic systems for their wide light harvesting capability. 21To explore this possibility, we also assessed the photocatalytic activity of CDNH 2 -UiO-66 under long-wavelength light irradiation (e.g, 47510 nm with band-pass filter) for avoiding the absorption of NH 2 -UiO-66 (440 nm).Obvious photocatalytic activity could be observed under this condition, showing that CDs can indeed act as photosensitizers in our system.Meanwhile, obvious photocurrent could be detected under this condition, confirming that CDs can harvest long visible light and generate electron-hole pairs.When the experiment was carried out under 42010 nm band irradiation, both NH 2 -UiO-66 and CDs being excited, we also found that the encapsulation of CDs could significantly enhance the activity and photocurrent of NH 2 -UiO-66 (Fig. S8).Under such condition, because shortwavelength light (42010 nm) are mainly absorbed by NH 2 -UiO-66 (see Fig. S9), this giant enhancement should attribute to the charge separation capability of CDs, not relying on the light harvesting of CDs. Previously, a few reports also suggested that CDs could harvest near-infrared (NIR) light for photocatalysis because of their up-converted photoluminescence (UCPL). 21However, we did not find obvious photocatalytic activity under the NIR light in our system (7802500 nm of the Xe lamp).Although weak PL emission could be indeed observed under long wavelength excitation of Xe lamp, but this emission became dismissed after adding a filter (see Fig. S10).We supported the argument that such 'UCPL' feature may be resulted by the excitation of half-wavelength incident light (/2) of Xe lamp, other than real upconversion process. 35Fig. 7 (A) PL spectra of pristine CDs, CD/NH 2 -UiO-66 and CDNH 2 -UiO-66 ( ex 340 nm); (B) luminescence decays of NH 2 -UiO-66, CD/NH 2 -UiO-66 and CDNH 2 -UiO-66 ( ex 340 nm, em 430 nm); (C) luminescence decay of pristine CDs ( ex 340 nm, em 430 nm). As fluorescent CDs have strong PL emission, both steadyand transient-state PL spectra were further utilized to explore the inner charge transfer status in the hybrid samples (Fig. 7A).The steady-state PL emissions of CDs were reduced when they were hybridized with NH 2 -UiO-66, confirming the photosensitizing role of CDs as their excited electrons could be transferred to the MOFs.The lower PL emission in CDNH 2 -UiO-66 confirms that the encapsulated CDs can transfer electrons more efficiently than the decorated ones.In the luminescence decay spectra (Fig. 7B), pristine NH 2 -UiO-66 exhibits a very short lifetime of 0.97 ns, which means that the excited electrons are prone to recombine with the holes at valence band if they were not separated in time.After CDs hybridization, average decay times in two hybrid samples were significantly prolonged, showing a longer lifetime of charge carriers.The lifetimes in hybrid samples are also longer than that of pristine CDs before hybridization (9.37 ns, Fig. 7C).We speculate that such long lifetimes may be originated from the rich surface states of CDs and inner electron transfer between CDs and NH 2 -UiO-66. 19Namely, some transferred electrons were temporarily trapped by the defect states of CDs, leading to a longer lived time for the excited electrons to reach the ground state.are beneficial for multi-electron photoredox reactions such as CO 2 reduction. 36n the basis of above experimental evidences, photocatalytic mechanism of the prepared CDNH 2 -UiO-66 particles are proposed (Scheme 2).Under the irradiation of shortwavelength light (440 nm), NH 2 -UiO-66 absorb the incident light and generate electron-hole pairs on the Zr-O clusters.The embedded CDs near these clusters can serve as electron receptors to separate the short-lived electrons in MOFs for CO 2 reduction.Irradiated under long-wavelength light (440 nm), the CDs will play another role as photosensitizers and inject electrons to the MOFs.The injected electrons can reduce CO 2 molecules at the MOF sites.Owing to the special energy band structure and high electron conductivity, CDs can simultaneously play dual roles when coupled with the MOF photocatalysts.Judging from the activity of samples under two different irradiation bands (420 nm vs. 475 nm), the role of electron receptor should be dominant in the CD-hybridized samples (Fig. S8).The use of sacrificial agent TEOA is to rapidly consume photogenerated holes, thus establishing a steady channel for the electrons to reduce CO 2 molecules. Recently, Zhang et al brought forward an in situ generation strategy to prepared CDs in a few MOFs using their regular pores as templates. 37To know if this route is valid for preparing CD-encapsulated MOFs photocatalysts with higher activity, we also synthesized CDNH 2 -UiO-66 with a similar protocol as documented (denoted as CDNH 2 -UiO-66-G, see S1. Experimental and Fig. S11).Our result suggests that these in situ generated CDs can also enhance the photocatalytic activity of NH 2 -UiO-66 particles, but the sample activity is lower than the CDNH 2 -UiO-66 particles (Fig. S12).We infer that this result may attribute to the relatively poor quality of CDs which were generated from polymerization of glucose molecules in MOF pores. 18As indicated by the PL spectrum, these in situ generated CDs exhibit an obviously low PL emission, a direct evidence for the quality of fluorescent CDs.Above results enlighten us that the use of high-quality CDs is also important for the development of CD-embedded MOF photocatalysts. The encapsulating strategy has an inherent merit of directly utilizing pre-synthesized cocatalysts with high quality."
  },
  {
    "title": "Conclusions",
    "content": "In summary, we have successfully synthesized both CDdecorated and CD-embedded NH 2 -UiO-66 particles and explored their photocatalytic activity for CO 2 reduction.Our results reveal that the location of CDs can greatly affect the photocatalytic activity of NH 2 -UiO-66 particles, and particularly the embedded CDs can hugely improve their activity.Charge kinetic investigations reveal that the embedded CDs are more favorable for charge separation and transfer in MOFs than the surface-decorated CDs, because they can directly contact the internal Zr-O clusters and built many small heterojunctions.Besides serving as electron receptors, CDs can also act as photosensitizers in the hybrid MOF photocatalyst under long-wavelength light irradiation.The working mechanism of these CD-hybridized MOF particles have been explored and illustrated.This work may present a new strategy to develop MOF-based photocatalysts with enhanced photocatalytic activity through creating small cocatalysts in the MOF matrixes. March 2020.Downloaded by National University of Singapore on 3/19/2020 10:38:29 PM.View Article Online DOI: 10.1039/D0NR01696A Fig. 1 Characterizations of the prepared CDs by solvothermal route: (A) TEM image (inset scale bar: 2 nm); (B) Size analysis diagram of the prepared CDs; (C) excitation-dependent PL spectra; (D) Raman spectrum. Scheme 1 Schematic illustration of two synthetic routes toward CD-decorated NH 2 -UiO-66 particle and CD-embedded NH 2 -UiO-66 particle, respectively.The decorating strategy is based on different surface charges, and encapsulating strategy is based on using CDs as seeds. Fig. 2 TEM, SEM and high-resolution TEM characterizations of two prepared CDhybridized NH 2 -UiO-66 particles: (A, B, C) CD-decorated NH 2 -UiO-66 particles; (D, E, F) CD-embedded NH 2 -UiO-66 particles. Fig. 3 (A) FTIR spectra and (B) XRD patterns of pristine NH 2 -UiO-66, CD-decorated NH 2 -UiO-66 and CD-embedded NH 2 -UiO-66. March 2020.Downloaded by National University of Singapore on 3/19/2020 10:38:29 PM.View Article Online DOI: 10.1039/D0NR01696A Fig. 4 Characterizations of light absorption and band structure of CDNH 2 -UiO-66, CD/NH 2 -UiO-66 and NH 2 -UiO-66: (A) UV-Vis DRS profiles; (B) Corresponding Tauc plots; (C) Mott-Schottky plots.(D) Illustration of band diagram of CDNH 2 -UiO-66 (the potential is vs. NHE, pH0). Fig. 5 (A) Photocatalytic activities of pristine NH 2 -UiO-66, CD/NH 2 -UiO-66 and CDNH 2 -UiO-66 for CO 2 reduction; (B) Average CO production rates; (C) CO production rate of CDNH 2 -UiO-66 prepared with different volumes of CDs seeds (28.6 mg/mL, in 25 mg NH 2 -UiO-66); (D) Photocatalytic stability tests of CDNH 2 -UiO-66. Fig. 6 (A) Photocurrents and (B) EIS measurements of pristine NH 2 -UiO-66, CD/NH 2 -UiO-66 and CDNH 2 -UiO-66. Scheme 2 Schematic illustration of the electron transfer process and photocatalytic mechanism of two samples for CO 2 reduction.The reduction potential is vs. NHE, pH0. This journal is The Royal Society of Chemistry 20xx J. Name., 2013, 00, 1-3 5 This journal is The Royal Society of Chemistry 20xx J. Name., 2013, 00, 1-3 7 The authors acknowledge financial support from Natural Science Foundation of Zhejiang Province (No R15B010001) and National Natural Science Foundation of China (No 21701143)."
  }
]