[
  {
    "title": "Doi",
    "content": "10.1016/j.catcom.2013.11.011"
  },
  {
    "title": "Article_Title",
    "content": "Cu2O/TiO2 heterostructure nanotube arrays prepared by an electrodeposition method exhibiting enhanced photocatalytic activity for CO2 reduction to methanol"
  },
  {
    "title": "Abstract",
    "content": "2 O/TiO 2 heterostructures Electrodeposition CO 2 photocatalytic reduction to methanol Degradation of organic pollutants (dyes) Cu 2 O/TiO 2 composite nanotube arrays demonstrating enhanced photocatalytic performance were synthesized using an electrodeposition method to impregnate the p-type Cu 2 O into the n-type titanium dioxide nanotube arrays (TNTs).The morphological results confirmed that the TNTs are wrapped by the Cu 2 O nanoparticles and the UV-Vis absorption spectra showed that the Cu 2 O/TNTs display a better ability for visible light absorption compared to the pure TNTs.CO 2 photocatalytic reduction experiments carried out by using Cu 2 O/TNT nanocomposites proved that Cu 2 O/TNTs exhibit high photocatalytic activity in conversion of CO 2 to methanol, while pure TNT arrays were almost inactive.Furthermore, Cu 2 O/TNTs also exhibited augmented activity in degradation of target organic pollutant like acid orange (AO) under visible light irradiation.The ultra enhanced photocatalytic activity noticed by using Cu 2 O/TNTs in CO 2 reduction and degradation of organic pollutant could be attributed to the formation of Cu 2 O/TiO 2 heterostructures with higher charge separation efficiency."
  },
  {
    "title": "Experimental",
    "content": "Well-ordered TNTs were prepared by the anodization of Ti foil, as reported earlier 25.The Cu 2 O/TNT composites were prepared using a simple electrodeposition method (the preparation process in detail has been presented in the supplementary material).The morphology of the prepared samples was studied with scanning electronic microscopy (SEM, HITACHI-S4800).The crystal structure of the samples was examined by means of X-ray diffraction analysis (XRD, Bruker D8 ADVANCE with Cu-K radiation, 1.5418A).UV-Vis absorption spectra of the Cu 2 O/TNT composites were obtained using a UV-Vis spectrometer (Shimadzu UV-3600). 2.2.Photocatalytic reduction of CO 2 500 watt collimated xenon mercury (Xe Hg) broadband lamp (Oriel, USA) was used as the light source of excitation in this study.Catalyst was loaded in 100 mL distilled water in the reaction cell which could sustain 50 psi pressure without leaking.High purity CO 2 gas (99.99) was introduced to the reactor and the reactor pressure was maintained at 50 psi.After a predetermined irradiation time, the liquid samples were withdrawn from the reactor by using syringe and were subjected to GC analysis.(The photocatalytic reduction process in detail has been presented in the supplementary material)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The phase structure of the Cu 2 O/TNT samples was confirmed by the XRD results, as depicted in Fig. 1.The diffraction peaks of TNTs at In Fig. 2a andb, SEM images illustrate that the TNTs are compact and the average inner diameter is approximately 80 nm having the length 800 nm.From the top view (Fig 2c, e andg), the Cu 2 O nanoparticles can be clearly noticed which are formed on the surface of the TNT arrays and the average side length of these Cu 2 O nanoparticles with a polyhedral shape is about 80-100 nm.From the cross-sectional image view (Fig 2d, f andh), it is evident that the entire TNTs including the top, inner and outer walls of the TNTs are wrapped by the Cu 2 O nanoparticles.By increasing the deposition charge from 0.5 to 1.0 C, the nanotube walls become rougher and rougher and the amount of the particles embedded into the structure seems also to be increasing.When the electrodeposition charges reach to 1.5 C, a large amount of Cu 2 O nanoparticles arranges so compactly that they almost cover all the nanotube pores. From Fig. 3a it can be noticed that the adsorption intensity of the Cu 2 O/TNT samples is clearly stronger than bare TNTs through the entire UV and visible light region, which demonstrate that the light absorption performance has been improved greatly due to the deposition of the Cu 2 O nanoparticles.It also can be noticed that with the electrodeposition charge increasing, the adsorption intensity of the Cu 2 O/TNT samples is increasing.However, the absorption intensity decreases when the electrodeposition charge reached 1.5 C, which could be attributed to the covered TiO 2 nanotubes with too much Cu 2 O nanoparticles, which lead to the enhancement of the light reflection and the reduction of the light penetration into the TiO 2 nanotubes. From the photoelectrochemical results (see Fig. 3b), one can see that there is no significant current in the dark, however, in the visible light illumination, the photocurrents of all the Cu 2 O/TNT samples increase significantly while the bare TNTs showed negligible photoresponse.One can draw the conclusion that the photocurrent of Cu 2 O/TNTs is greatly enhanced as compared with the TNTs, which may be ascribed to the photo-generated carrier separation efficiency of the Cu 2 O/TNTs by taking the advantage of the formation of heterostructure.Therefore, it can be clearly inferred that the heterostructure construction is an effective way to improve the photoelectric performance. In order to evaluate the photocatalytic activity of converting CO 2 into hydrocarbon fuels by TNTs and Cu 2 O/TNTs, the conversion process was investigated by using high power pulsed laser as the light source.It is worth mentioning that laser excitation was a quite selective process for the end product like CH 3 OH which is considered to be a future fuel in the CO 2 photocatalytic reduction.We selected the 1.0 C Cu 2 O/TNTs, which exhibited the best photocatalytic activity in the CO 2 photocatalytic reduction process.Comparative tests demonstrated that very little product was found by using TNTs as photocatalysts, which is probably due to the low conductive band edge potential of TiO 2 . Gas chromatography (GC) peak positions using standard methanol and the calibration curve of methanol concentration vs GC peak area are depicted in Fig. S-1.As shown in Fig. 4a, after every 2 h irradiation for the Cu 2 O/TNT sample, the GC peaks of methanol from CO 2 photoreduction are obtained.All the GC peaks appear at exactly 2.46 min retention time and no other GC peaks were detected, suggesting that the methanol is the only obtained product through the photocatalytic reduction of CO 2 .Fig. 4a also depicts that as the irradiation time increase to 6 h, the GC methanol peak areas continuously grow to reach a maximum, which also indicates that the Cu 2 O/TNT samples exhibit better photocatalytic activity than that of the TNTs.Fig. 4b depicts the concentration and conversion efficiency trend of CO 2 photoreduction into methanol as a function of irradiation time.It demonstrates that the concentration of methanol increases with the irradiation time and reaches to its maximum (55.15 M/100 mL) at 6 h. The efficiency for CO 2 conversion into methanol using Cu 2 O/TNTs was also calculated.In a typical experiment, an amount of CO 2 dissolved in 1 L distilled water at atmospheric pressure is 34 mmol, as calculated by Henry's law.The CO 2 pressure in our experiments was 50 psi (3.4 atm), so the amount of CO 2 dissolved in 100 mL water would be 11.56 mmol.The CO 2 conversion efficiency can be estimated by the ratio of the methanol concentration to CO 2 concentration.As depicted in Fig. 4b, the maximum concentration of methanol is 55.15 uM/100 mL and the maximum CO 2 conversion efficiency is about 0.48 after 6 h irradiation.Moreover, the photonic efficiency of CO 2 conversion into methanol using Cu 2 O/TNTs was also investigated.The number of methanol molecules can be calculated from the product molar concentration and Avogadro number.The photon number can be calculated to be 4.286 10 19 photons/min.The maximum rate of methanol production is 1.2366 10 17 molecules/min at the irradiation time interval from 4 to 6 h.As a single methanol molecule needs 6 photogenerated electrons, the maximum photonic efficiency of CO 2 photoreduction can be computed 6 1.2366 10 17 / 4.286 10 19 to be about 1.731.To the best of our knowledge, the high photonic efficiency of Cu 2 O/TNTs may be due to the construction of Cu 2 O/TNT heterojunction. In order to further prove the construction of Cu 2 O/TiO 2 heterojunction, the photocatalytic activity of the samples was evaluated by the degradation of AO.The Cu 2 O/TNT samples exhibit enhanced catalytic activity that 90 of the AO was photocatalytically degraded using the"
  },
  {
    "title": "Conclusions",
    "content": "In summary, Cu 2 O/TNTs have been prepared successfully through the electrodeposition method.The Cu 2 O/TNT composites exhibit much higher photocatalytic activity than bare TNTs for the CO 2 conversion into methanol and degradation of AO under light irradiation, which may be due to the formation of Cu 2 O/TiO 2 heterostructure and higher charge separation efficiency.Furthermore, such nanocomposite material may bring a new insight into the design and applications of highly efficient photocatalysts. Fig. 1.XRD pattern of the prepared TNTs and Cu 2 O/TNTs (A: Anatase, R: Rutile, C: Cu 2 O, T: Ti substrate). Fig. 3. UV-Vis DR spectra of the TNTs and Cu 2 O/TNTs with different electrodeposition charges (a); Photocurrent density profiles of the TNTs and Cu 2 O/TNTs at a bias potential of 0.0 V (vs.Ag/AgCl) under visible light (b). Cu 2 O/TNTs and only 20 of the AO was decolorized by the bare TNTs after 2 h of visible light irradiation.The photocatalytic results of using Cu 2 O/TNT samples with different electrodeposition charges and the repeated photocatalytic degradation with 1.0 C Cu 2 O/TNTs are depicted in Fig. S-2 to S-6. Possible mechanism for the improved photocatalytic property of Cu 2 O/TNTs For the Cu 2 O/TiO 2 composite system under visible light irradiation, only the electrons in Cu 2 O are excited to the conduction band.In the excitation process, as the Cu 2 O potentials of both conduction band and valence band are more negative than that of TiO 2 , the photogenerated electrons in the conduction band of Cu 2 O particles transfer to the TiO 2 , leading to the spatial separation of the photo-generated holes and electrons.Under the irradiation of ultraviolet-visible light, the electrons both in Cu 2 O and TiO 2 are excited to the conduction band.Photo-generated electrons in conduction band of Cu 2 O particles quickly transfer to TiO 2 particles, whereas photo-generated holes in valence band of TiO 2 particles migrate to the surface of Cu 2 O particles.The separation of electrons and holes reduces the charge recombination rate and thus promotes eventually the photocatalytic activity.The schematic charge separation in the Cu 2 O/TiO 2 heterojunction structure is depicted in Fig. 5. Fig. 4. GC peaks of methanol taken after every 2 h interval irradiation with a laser pulse energy of 40 mJ/pulse at 355 nm radiation and catalyst in 100 mL distilled water, with 50 psi CO 2 pressure (a); Concentration and conversion efficiency of produced CH 3 OH (b). Fig. 5.A schematic of the charge separation in Cu 2 O/TiO 2 heterojunction structure catalysts under visible light irradiation (a); ultraviolet-visible light irradiation (b). With the deposition charge increases from 0.5 C to 1.5 C, the intensities of the Cu 2 O characteristic peaks were also increased, which is resulted from the larger amount of the nanocrystalline Cu 2 O deposited onto the nanotubes. 25.3and 48.0can be assigned to (101) and (200) planes of TiO 2 having anatase phase (JCPDS Card No. 84-1286) and the diffraction peaks at 40.2and 53.0are indexed to the (101) and (102) planes of Ti substrate (JCPDS Card No. 44-1294), respectively.From the XRD curve of the Cu 2 O/TNTs, it can be seen that the diffraction peaks at 27.4could be assigned to (110) planes of TiO 2 of rutile phase (JCPDS Card No. 78-2485), suggesting that Cu 2 O/TNT samples are consisted of anatase predominantly and a small amount of rutile.The diffraction peaks with 2 values of 36.4 and 42.3 can be indexed to (111) and (200) planes of Cu 2 O (JCPDS Card No.05-0667) respectively. J. Wang et al. / Catalysis Communications 46 (2014) 17-21 The work is financially supported by the National Natural Science Foundation of China (No. 51172109) and Jiangsu province Natural Science Foundation (No. BK2010497).Prof. Gondal is thankful to KFUPM for supporting this work under project RG1011-1/2. Appendix A. Supplementary data Supplementary data to this article can be found online at http://dx. doi.org/10.1016/j.catcom.2013.11.011."
  }
]