[
  {
    "title": "Doi",
    "content": "10.1021/jp040345u"
  },
  {
    "title": "Article_Title",
    "content": "CO<sub>2</sub> Splitting by H<sub>2</sub>O to CO and O<sub>2</sub> under UV Light in TiMCM-41 Silicate Sieve"
  },
  {
    "title": "Abstract",
    "content": "The 266-nm light-induced reaction of CO 2 and H 2 O gas mixtures (including isotopic modifications 13 CO 2 , C 18 O 2 , and D 2 O) in framework TiMCM-41 silicate sieve was monitored by in situ FT-IR spectroscopy at room temperature.Carbon monoxide gas was observed as the sole product by infrared, and the growth depended linearly on the photolysis laser power.H 2 O was confirmed as the stoichiometric electron donor.The work identifies CO as the single-photon, 2-electron-transfer product of CO 2 at framework Ti centers with H 2 O acting as an electron donor, which has not been established before.O 2 was detected as coproduct by mass spectrometric analysis of the photolysis gas mixture.These results are explained by single UV photon-induced splitting of CO 2 by H 2 O to CO and surface OH radical."
  },
  {
    "title": "Experimental",
    "content": "TiMCM-41 sieve was prepared following a modified method for MCM-41 synthesis, 15 but now including a Ti precursor in the synthesis gel.Briefly, 2.2 g of CTAB template (cetyltrimethylammonium bromide, Aldrich) were dissolved in 52 mL of water at 40 C.Ammonium hydroxide (Aldrich, 26 mL) was then added under stirring.Addition of 10 mL of tetraethoxysilane (Fluka, puriss.)and 0.03 g of Ti tetrabutoxide to the solution was followed by continued stirring for 3 h at room temperature.The gel was transferred to a Teflon-lined autoclave and held at 110 C for 48 h.Filtration and washing with distilled H 2 O gave the product.Template removal was typically conducted by heating at 300 C for 2 h followed by calcination under O 2 flow at 550 C for 12 h.Template removal in some 10.1021/jp040345u CCC: 27.50 2004 American Chemical Society Published on Web 10/29/2004 cases was also done by the ion exchange method, using 0.2 M (NH 4 ) 2 SO 4 in an ethanol-H 2 O 1:1 solution. 16As-synthesized TiMCM-41 (100 mg) was dispersed in 30 mL of solution and stirred at 65 C for 30 min, filtered while hot, and washed with cold ethanol.The procedure was repeated 3 times and followed by additional washing with water and ethanol to remove excess ammonium sulfate.The product was dried at 100 C for 12 h before use.Chemical analysis indicated at Ti/Si ratio of 0.020 ( 0.001.Powder XRD measurements (Siemens model D500 Cu KR) of the sieve showed the same well-known Bragg peaks of neat MCM-41. 17No extra peak or phase was detected.The parent MCM-41 material was prepared by the same procedure as TiMCM-41 without the Ti source.XANES spectra of the Ti K-edge of pressed wafers of TiMCM-41 recorded at beamline 9.3.1 at the Advanced Light Source showed a sharp, intense preedge peak at 4968 eV (for experimental details of the X-ray absorption measurement, see ref 18).The band, shown in Figure 1a, is attributed to the A 1 -T 2 absorption of tetrahedrally coordinated Ti centers.Its height relative to that of the K-edge is a measure of the fraction of Ti in tetrahedral coordination. 19Comparison with literature XANES spectra of TiMCM-41confirmed the high yield of tetrahedrally substituted Ti centers. 20Furthermore, the UV diffuse reflectance spectra of the material (Shimadzu model UV-2100 spectrometer equipped with an integrating sphere model ISR-260) exhibit an absorption with an onset at 330 nm (Figure 1b).The short wavelength onset of the band shows that it originates from the LMCT transition of tetrahedrally coordinated Ti, in agreement with literature spectra. 21or photochemical experiments, 10 mg of TiMCM-41 powder was pressed into a self-supporting wafer.The wafer was mounted in a miniature infrared vacuum cell equipped with CaF 2 windows. 22Dehydration of the sieve was accomplished by room temperature evacuation (turbomolecular pump Varian model V-70) prior to a 3-fold exchange with D 2 O vapor (12 Torr).Reactants were loaded into the molecular sieve from the gas phase through a vacuum manifold.Chemistry was monitored in situ by FT-IR spectroscopy at 0.25-cm -1 resolution (Bruker models IFS88 or IFS66V equipped with LN 2 cooled MCT detectors model Kolmar KMPV8-1-J2 with an 8 m band gap).Photolysis was conducted at room temperature, using the 266nm emission of a pulsed Nd:Yag laser at 10 Hz (Quanta Ray model DCR2A with GCR3 upgrade).For monitoring of O 2 formation, the gas phase of the infrared cell was probed before and after photolysis by a quadrupole mass spectrometer Pfeiffer model Omnistar 422.CO 2 (Matheson, 99.995), 13 CO 2 (ISOTEC, 99 13 C), C 18 Loading of 12 Torr of H 2 O (D 2 O) into the miniature infrared cell containing a TiMCM-41 wafer gave rise to a very broad water stretching absorption with a maximum at 3300 cm -1 (2500 cm -1 ) and a bending mode at 1630 cm -1 .D 2 O was chosen in many experiments to keep the 1600-1700-cm -1 range free of reactant absorption.Possible CO 2 reduction products such as formic acid or formate ion 23 would be difficult to detect in the presence of H 2 O with its strong bending mode absorption.Subsequent addition of 700 to 750 Torr of 12 CO 2 , 13 CO 2 , or 12 C 18 O 2 resulted in gas-phase infrared bands reported previously. 23No peaks due to carbon dioxide adsorbed on the sieve were observed except for a small band at 1381 cm -1 ( 13 CO 2 , 1366 cm -1 ; C 18 O 2 , 1334 cm -1 ), assigned to the 1 symmetric stretch of CO 2 . 24While infrared-forbidden for the gas-phase molecule, the mode is induced by interaction with the nanopore environment in the case of the adsorbed CO 2 . When irradiating the loaded TiMCM-41 sieve with 266-nm light at room temperature, growth of gas-phase CO was detected by its ro-vibrational bands in the 2200-2000-cm -1 region.At room temperature, CO generated in the silicate pores desorbs instantly into the gas phase.Figure 2 shows the infrared difference spectrum upon irradiation of a cell containing 705 Torr of CO 2 and 10 Torr of D 2 O for 230 min at 100 mW cm -2 .Aside from CO (trace b), the only additional growth was observed in the fingerprint region (trace c) at 1420 cm -1 and is due to HDO, presumably the result of continued slow exchange of D 2 O with residual Si-OH groups of the pore surface.No other products were detected by infrared in the 4000-1300cm -1 region.Specifically, no bands grew in the 2300-2200cm -1 range (trace a) where C-D stretch modes of possible methanol 25 or methane 26 products would absorb.Likewise, no absorbance growth was noticed in the carbonyl stretching region (Figure 2c) where formic acid (DCO 2 D, 1695 cm -1 ), 23 formate (DCO 2 -, 1565 cm -1 ), 23 or carbonate (CO 3 2-, 1440 cm -1 ; HCO 2 -, 1600 cm -1 ) 27 are known to absorb.In a series of experiments with 13 CO 2 (740 Torr) D 2 O (12 Torr) mixtures, the gas content of the infrared cell (3.4 cm 3 volume) was transferred to a quadrupole mass spectrometer for analysis before and after photolysis.Figure 3 shows the average signal observed at mass 32 in four experiments, each conducted with a new TiMCM-41 wafer.Trace a is the spectrum before photolysis; the small signal at mass 32 is due to O 2 generated by 13 CO 2 fragmentation in the mass spectrometer.Figure 3b shows that O 2 is produced by photolysis of 13 CO 2 H 2 O at 266 nm.While well above background for each run, the signal fluctuated from experiment to experiment by as much as a factor of 4. These fluctuations can be understood on the basis of the proposed mechanism of O 2 generation, namely dismutation of surface OH radicals, discussed in Section 4. We conclude that gas-phase CO and O 2 are the only products formed upon 266-nm photolysis (200 mW cm -2 , 5 h) of CO 2 and H 2 O in TiMCM-41 at room temperature. Carbon monoxide is only produced when water is present as donor.Figure 4b shows the infrared absorbance growth of a single ro-vibrational line of CO at 2173 cm -1 upon irradiation of a CO 2 H 2 O mixture in TiMCM-41 for 75 min at 194 mW cm -2 .Trace a of Figure 4 is the spectrum observed when repeating the same photolysis experiment without added H 2 O. We can only speculate at this point about the possible source of the small CO growth in Figure 4a, which occurs only during the initial 30 min of irradiation.One possibility is the residual H 2 O present in the sieve.It would imply that water molecules regenerated upon dismutation of the primary products (see Figure 6) are no longer accessible for continued reaction at the redox sites, which is reasonable to assume because of the presence of 1 atm of CO 2 . Infrared monitoring of 13 CO 2 H 2 O photolysis revealed the formation of some 12 CO gas along with the 13 CO product, with the 12 CO growth fluctuating erratically between experiments.This points to the presence of small amounts of carboneous residues that react with oxidizing intermediates formed during the photochemical reaction.Such carboneous residues are known to be difficult to remove completely from the high-surface-area mesoporous silicates. 28,29The origin of 12 CO was confirmed experimentally by our finding that the 12 CO yield decreased by a factor of 2 when conducting the experiment with a C 18 O 2 H 2 16 O mixture instead of the 13 C 16 O 2 H 2 16 O sample.The result demonstrates that half of the O atoms of the 12 CO impurity produced by the photochemical reaction originate from CO 2 , the other half from H 2 O. Therefore, the carboneous residues in the sieve act as a trap for transient oxygen species that otherwise would react to form O 2 . To determine whether single or multiple photons are required for the CO production, we examined the laser power dependence of the 13 CO absorbance in 13 CO 2 D 2 O experiments.Figure 5a shows the growth of the ro-vibrational line of 13 CO at 2117 cm -1 that was used for the analysis.As can be seen from the bands measured after consecutive photolysis periods, the fwhm is constant in the growth range used for the analysis, permitting the use of peak absorbances.Experiments were conducted by measuring the growth of the 2117-cm -1 peak for 16 consecutive photolysis periods of 5 min duration, alternating between 80 and 160 mW cm -2 laser power.Absorbance growth data for each of the two power levels were averaged.Calibration of the 2117-cm -1 band intensity in terms of 13 CO pressure by using an authentic 13 CO sample allowed us to determine the quantity of 13 CO produced in the IR cell.As can be seen from Figure 5b, the carbon monoxide growth depends linearly on the photolysis laser intensity.The slightly less than doubling of the growth at 160 mW cm -2 is consistent with the additional thermal heating by a few degrees caused by the increased laser power, resulting in slightly less adsorption of reactants.Since saturation effects can be ruled out at the modest photolysis light intensities used, the linear dependence implies that CO is produced by a single photon process. The essential results of the spectroscopic study of the photolysis of carbon dioxide and water in TiMCM-41 sieve are the establishment of CO as single-photon 2-electron-transfer product, and O 2 as coproduct under reaction conditions at room temperature.Water is confirmed as the stoichiometric electron donor.Both CO and O 2 were already detected previously by Anpo and co-workers as trace products by GC measurements. 6,7he importance of the work reported here is the finding that single-photon excitation of the Ti-O LMCT chromophore results in splitting of CO 2 to CO with H 2 O acting as the direct electron donor, which has not been established before.The oxidizing fragments generated by the H 2 O oxidation and CO 2 dissociation react to produce O 2 . On the basis of these observations, the mechanism shown in Figure 6 In this UV photolysis experiment it is not possible to determine whether hydrogen peroxide is formed because, according to our study of H 2 O 2 interacting with Ti silicate, it can react with Ti centers to yield TiOOH moieties.The latter photodissociates to H 2 O and oxygen at wavelengths shorter than 500 nm. 30Figure 6 indicates the free energies associated with the formation of the stable products.The only speculative energy is that of the surface OH radicals.The free energy of the reaction CO 2 H 2 O f CO 2 OH, with all species in the gas phase, is 139.7 kcal mol -1 . 31The maximum energy available in a single-photon process with 266-nm quanta is 107 kcal mol -1 .This implies that the OH species must be stabilized by interaction with the silica pore surface by at least 16 kcal mol -1 per radical, which is plausible.In light of the long lifetime of even very small radicals in a room temperature molecular sieve due to random walk (hundreds of microseconds for HCO in zeolite Y), 32 it is not surprising that, even at a very low concentration, carboneous residues offer a significant trapping mechanism for OH radicals. It is interesting to note the difference in the 2-electron-transfer product of CO 2 reduction on a Ti silicate sieve depending on whether H 2 O or CH 3 OH is used as donor.We have previously found that CO 2 photoreduction in Ti silicalite when using methanol as donor generates HCO 2 H, not CO, as the primary reduction product. 23 With CO 2 splitting identified as the key activation step, redox centers can be explored that may afford the reduction of CO 2 by H 2 O with photons at longer wavelengths. O 2 (ICON, 98.7 18 O), CO (Matheson, 99.99), and 13 CO (Matheson, 99 13 C) were used as received.Triply distilled H 2 O and D 2 O (Aldrich, 99.96D) were degassed by 4 freeze-pumpthaw cycles before use. Figure 1.Spectroscopic characterization of framework TiMCM-41.(a) XANES spectrum of Ti K-edge.The A1-T2 preedge peak position (4968 eV) is taken as the origin of the energy scale.(b) UV-vis diffuse reflectance spectrum of calcined TiMCM-41 in a vacuum.R ) reflectance, BaSO4 as the reference. Figure 2. FT-IR difference spectrum upon 266-nm irradiation of TiMCM-41 loaded with 705 Torr of CO2 and 10 Torr of D2O for 230 min at 100 mW cm -2 .The negative ro-vibrational bands in parts a and b are due to depletion of 13 CO2 (natural abundance in 12 CO2). Figure 3. Mass spectrum of a 13 CO2 (740 Torr) H2O (12 Torr) mixture contained in the miniature IR cell (a) before photolysis and (b) after 266-nm irradiation for 300 min at 160 mW cm -2 .The signal is the average of four photolysis experiments, each conducted with a fresh TiMCM-41 wafer. Figure 4. H2O dependence of CO2 photoreduction.(a) CO absorbance growth at 2173 cm -1 upon 266-nm irradiation of TiMCM-41 loaded with 1 atm of CO2 for 75 min at 194 mW cm -2 .(b) Same photolysis experiment as in part a with TiMCM-41 loaded with 1 atm of CO2 and 12 Torr of H2O. Figure 5. Laser power dependence of 13 CO2 photoreduction by D2O.(a) Spectra of the 13 CO band at 2117 cm -1 recorded after 30 and 80 min of photolysis.(b) Laser power dependence of 13 CO absorbance growth.Each data point represents the average of 8 measurements. is proposed.Excitation of the Ti-O LMCT transition of Ti centers leads to transient Ti III and a hole on a framework oxygen.Electron transfer from Ti III to CO 2 splits the molecule into CO and O -.The latter is spontaneously protonated by a Si-OH group, or H co-generated upon H 2 O oxidation to yield a surface OH radical.Another such surface OH radical is formed as a result of the concurrent H 2 O oxidation by the framework oxygen hole.The OH radicals either combine to yield H 2 O 2 or dismutate to give O 2 and H 2 O. This is most probably due to the fact that one-electron oxidation of CH 3 OH by the hole on framework O produces the CH 2 OH radical, a H atom donor that can reduce transient CO 2 -to HCO 2 H.By contrast, no H atom donor is generated upon H 2 O oxidation that would quench CO 2 -, resulting in spontaneous splitting of the transient.In fact, the lack of accumulation of highly reactive reducing radicals constitutes an advantage of photochemical CO 2 splitting by H 2 O over other photosynthetic reactions because back reaction of reduced and oxidized transient radicals does not occur.The reduced species formed by CO 2 splitting (CO) desorbs from the reactor, leaving behind the same oxidizing species (OH) generated by photooxidation of the donor. Figure 6.Proposed mechanism for UV light-induced CO2 reduction by H2O at tetrahedral framework Ti centers.Energies are accurate except for surface-stabilized OH radicals (see text). J. Phys.Chem.B, Vol.108, No. 47, 2004 Lin et al. Acknowledgment.This work was supported by the Director, Office of Science, Office of Basic Energy Sciences, Division of Chemical, Geological and Biosciences of the U.S Department of Energy under contract No. DE-AC03-76SF00098."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Loading of 12 Torr of H 2 O (D 2 O) into the miniature infrared cell containing a TiMCM-41 wafer gave rise to a very broad water stretching absorption with a maximum at 3300 cm -1 (2500 cm -1 ) and a bending mode at 1630 cm -1 .D 2 O was chosen in many experiments to keep the 1600-1700-cm -1 range free of reactant absorption.Possible CO 2 reduction products such as formic acid or formate ion 23 would be difficult to detect in the presence of H 2 O with its strong bending mode absorption.Subsequent addition of 700 to 750 Torr of 12 CO 2 , 13 CO 2 , or 12 C 18 O 2 resulted in gas-phase infrared bands reported previously. 23No peaks due to carbon dioxide adsorbed on the sieve were observed except for a small band at 1381 cm -1 ( 13 CO 2 , 1366 cm -1 ; C 18 O 2 , 1334 cm -1 ), assigned to the 1 symmetric stretch of CO 2 . 24While infrared-forbidden for the gas-phase molecule, the mode is induced by interaction with the nanopore environment in the case of the adsorbed CO 2 . When irradiating the loaded TiMCM-41 sieve with 266-nm light at room temperature, growth of gas-phase CO was detected by its ro-vibrational bands in the 2200-2000-cm -1 region.At room temperature, CO generated in the silicate pores desorbs instantly into the gas phase.Figure 2 shows the infrared difference spectrum upon irradiation of a cell containing 705 Torr of CO 2 and 10 Torr of D 2 O for 230 min at 100 mW cm -2 .Aside from CO (trace b), the only additional growth was observed in the fingerprint region (trace c) at 1420 cm -1 and is due to HDO, presumably the result of continued slow exchange of D 2 O with residual Si-OH groups of the pore surface.No other products were detected by infrared in the 4000-1300cm -1 region.Specifically, no bands grew in the 2300-2200cm -1 range (trace a) where C-D stretch modes of possible methanol 25 or methane 26 products would absorb.Likewise, no absorbance growth was noticed in the carbonyl stretching region (Figure 2c) where formic acid (DCO 2 D, 1695 cm -1 ), 23 formate (DCO 2 -, 1565 cm -1 ), 23 or carbonate (CO 3 2-, 1440 cm -1 ; HCO 2 -, 1600 cm -1 ) 27 are known to absorb.In a series of experiments with 13 CO 2 (740 Torr) D 2 O (12 Torr) mixtures, the gas content of the infrared cell (3.4 cm 3 volume) was transferred to a quadrupole mass spectrometer for analysis before and after photolysis.Figure 3 shows the average signal observed at mass 32 in four experiments, each conducted with a new TiMCM-41 wafer.Trace a is the spectrum before photolysis; the small signal at mass 32 is due to O 2 generated by 13 CO 2 fragmentation in the mass spectrometer.Figure 3b shows that O 2 is produced by photolysis of 13 CO 2 H 2 O at 266 nm.While well above background for each run, the signal fluctuated from experiment to experiment by as much as a factor of 4. These fluctuations can be understood on the basis of the proposed mechanism of O 2 generation, namely dismutation of surface OH radicals, discussed in Section 4. We conclude that gas-phase CO and O 2 are the only products formed upon 266-nm photolysis (200 mW cm -2 , 5 h) of CO 2 and H 2 O in TiMCM-41 at room temperature. Carbon monoxide is only produced when water is present as donor.Figure 4b shows the infrared absorbance growth of a single ro-vibrational line of CO at 2173 cm -1 upon irradiation of a CO 2 H 2 O mixture in TiMCM-41 for 75 min at 194 mW cm -2 .Trace a of Figure 4 is the spectrum observed when repeating the same photolysis experiment without added H 2 O. We can only speculate at this point about the possible source of the small CO growth in Figure 4a, which occurs only during the initial 30 min of irradiation.One possibility is the residual H 2 O present in the sieve.It would imply that water molecules regenerated upon dismutation of the primary products (see Figure 6) are no longer accessible for continued reaction at the redox sites, which is reasonable to assume because of the presence of 1 atm of CO 2 . Infrared monitoring of 13 CO 2 H 2 O photolysis revealed the formation of some 12 CO gas along with the 13 CO product, with the 12 CO growth fluctuating erratically between experiments.This points to the presence of small amounts of carboneous residues that react with oxidizing intermediates formed during the photochemical reaction.Such carboneous residues are known to be difficult to remove completely from the high-surface-area mesoporous silicates. 28,29The origin of 12 CO was confirmed experimentally by our finding that the 12 CO yield decreased by a factor of 2 when conducting the experiment with a C 18 O 2 H 2 16 O mixture instead of the 13 C 16 O 2 H 2 16 O sample.The result demonstrates that half of the O atoms of the 12 CO impurity produced by the photochemical reaction originate from CO 2 , the other half from H 2 O. Therefore, the carboneous residues in the sieve act as a trap for transient oxygen species that otherwise would react to form O 2 . To determine whether single or multiple photons are required for the CO production, we examined the laser power dependence of the 13 CO absorbance in 13 CO 2 D 2 O experiments.Figure 5a shows the growth of the ro-vibrational line of 13 CO at 2117 cm -1 that was used for the analysis.As can be seen from the bands measured after consecutive photolysis periods, the fwhm is constant in the growth range used for the analysis, permitting the use of peak absorbances.Experiments were conducted by measuring the growth of the 2117-cm -1 peak for 16 consecutive photolysis periods of 5 min duration, alternating between 80 and 160 mW cm -2 laser power.Absorbance growth data for each of the two power levels were averaged.Calibration of the 2117-cm -1 band intensity in terms of 13 CO pressure by using an authentic 13 CO sample allowed us to determine the quantity of 13 CO produced in the IR cell.As can be seen from Figure 5b, the carbon monoxide growth depends linearly on the photolysis laser intensity.The slightly less than doubling of the growth at 160 mW cm -2 is consistent with the additional thermal heating by a few degrees caused by the increased laser power, resulting in slightly less adsorption of reactants.Since saturation effects can be ruled out at the modest photolysis light intensities used, the linear dependence implies that CO is produced by a single photon process."
  },
  {
    "title": "Conclusions",
    "content": "The essential results of the spectroscopic study of the photolysis of carbon dioxide and water in TiMCM-41 sieve are the establishment of CO as single-photon 2-electron-transfer product, and O 2 as coproduct under reaction conditions at room temperature.Water is confirmed as the stoichiometric electron donor.Both CO and O 2 were already detected previously by Anpo and co-workers as trace products by GC measurements. 6,7he importance of the work reported here is the finding that single-photon excitation of the Ti-O LMCT chromophore results in splitting of CO 2 to CO with H 2 O acting as the direct electron donor, which has not been established before.The oxidizing fragments generated by the H 2 O oxidation and CO 2 dissociation react to produce O 2 . On the basis of these observations, the mechanism shown in Figure 6 In this UV photolysis experiment it is not possible to determine whether hydrogen peroxide is formed because, according to our study of H 2 O 2 interacting with Ti silicate, it can react with Ti centers to yield TiOOH moieties.The latter photodissociates to H 2 O and oxygen at wavelengths shorter than 500 nm. 30Figure 6 indicates the free energies associated with the formation of the stable products.The only speculative energy is that of the surface OH radicals.The free energy of the reaction CO 2 H 2 O f CO 2 OH, with all species in the gas phase, is 139.7 kcal mol -1 . 31The maximum energy available in a single-photon process with 266-nm quanta is 107 kcal mol -1 .This implies that the OH species must be stabilized by interaction with the silica pore surface by at least 16 kcal mol -1 per radical, which is plausible.In light of the long lifetime of even very small radicals in a room temperature molecular sieve due to random walk (hundreds of microseconds for HCO in zeolite Y), 32 it is not surprising that, even at a very low concentration, carboneous residues offer a significant trapping mechanism for OH radicals. It is interesting to note the difference in the 2-electron-transfer product of CO 2 reduction on a Ti silicate sieve depending on whether H 2 O or CH 3 OH is used as donor.We have previously found that CO 2 photoreduction in Ti silicalite when using methanol as donor generates HCO 2 H, not CO, as the primary reduction product. 23 With CO 2 splitting identified as the key activation step, redox centers can be explored that may afford the reduction of CO 2 by H 2 O with photons at longer wavelengths. O 2 (ICON, 98.7 18 O), CO (Matheson, 99.99), and 13 CO (Matheson, 99 13 C) were used as received.Triply distilled H 2 O and D 2 O (Aldrich, 99.96D) were degassed by 4 freeze-pumpthaw cycles before use. Figure 1.Spectroscopic characterization of framework TiMCM-41.(a) XANES spectrum of Ti K-edge.The A1-T2 preedge peak position (4968 eV) is taken as the origin of the energy scale.(b) UV-vis diffuse reflectance spectrum of calcined TiMCM-41 in a vacuum.R ) reflectance, BaSO4 as the reference. Figure 2. FT-IR difference spectrum upon 266-nm irradiation of TiMCM-41 loaded with 705 Torr of CO2 and 10 Torr of D2O for 230 min at 100 mW cm -2 .The negative ro-vibrational bands in parts a and b are due to depletion of 13 CO2 (natural abundance in 12 CO2). Figure 3. Mass spectrum of a 13 CO2 (740 Torr) H2O (12 Torr) mixture contained in the miniature IR cell (a) before photolysis and (b) after 266-nm irradiation for 300 min at 160 mW cm -2 .The signal is the average of four photolysis experiments, each conducted with a fresh TiMCM-41 wafer. Figure 4. H2O dependence of CO2 photoreduction.(a) CO absorbance growth at 2173 cm -1 upon 266-nm irradiation of TiMCM-41 loaded with 1 atm of CO2 for 75 min at 194 mW cm -2 .(b) Same photolysis experiment as in part a with TiMCM-41 loaded with 1 atm of CO2 and 12 Torr of H2O. Figure 5. Laser power dependence of 13 CO2 photoreduction by D2O.(a) Spectra of the 13 CO band at 2117 cm -1 recorded after 30 and 80 min of photolysis.(b) Laser power dependence of 13 CO absorbance growth.Each data point represents the average of 8 measurements. is proposed.Excitation of the Ti-O LMCT transition of Ti centers leads to transient Ti III and a hole on a framework oxygen.Electron transfer from Ti III to CO 2 splits the molecule into CO and O -.The latter is spontaneously protonated by a Si-OH group, or H co-generated upon H 2 O oxidation to yield a surface OH radical.Another such surface OH radical is formed as a result of the concurrent H 2 O oxidation by the framework oxygen hole.The OH radicals either combine to yield H 2 O 2 or dismutate to give O 2 and H 2 O. This is most probably due to the fact that one-electron oxidation of CH 3 OH by the hole on framework O produces the CH 2 OH radical, a H atom donor that can reduce transient CO 2 -to HCO 2 H.By contrast, no H atom donor is generated upon H 2 O oxidation that would quench CO 2 -, resulting in spontaneous splitting of the transient.In fact, the lack of accumulation of highly reactive reducing radicals constitutes an advantage of photochemical CO 2 splitting by H 2 O over other photosynthetic reactions because back reaction of reduced and oxidized transient radicals does not occur.The reduced species formed by CO 2 splitting (CO) desorbs from the reactor, leaving behind the same oxidizing species (OH) generated by photooxidation of the donor. Figure 6.Proposed mechanism for UV light-induced CO2 reduction by H2O at tetrahedral framework Ti centers.Energies are accurate except for surface-stabilized OH radicals (see text). J. Phys.Chem.B, Vol.108, No. 47, 2004 Lin et al. Acknowledgment.This work was supported by the Director, Office of Science, Office of Basic Energy Sciences, Division of Chemical, Geological and Biosciences of the U.S Department of Energy under contract No. DE-AC03-76SF00098."
  }
]