[
  {
    "title": "Doi",
    "content": "10.1016/j.cej.2021.128889"
  },
  {
    "title": "Article_Title",
    "content": "Fullerene modified CsPbBr3 perovskite nanocrystals for efficient charge separation and photocatalytic CO2 reduction"
  },
  {
    "title": "Abstract",
    "content": "Halide perovskite nanocrystals (NCs) are regarded as potential candidates for photocatalytic CO 2 reduction owing to their appropriate band structure and outstanding visible-light harvesting abilities.Nevertheless, the intrinsic radiative recombination and the structural instability of these materials have always been the obstacles to their practical applications in CO 2 photoreduction.Herein, we demonstrate the design and fabrication of a fullerenes C 60 /CsPbBr 3 composite, which is applied as an efficient and stable photocatalyst for visible-lightdriven CO 2 reduction.C 60 with highly delocalized bond structure serves as electron acceptors to acquire photo-generated electrons from CsPbBr 3 , thus facilitating the charge separation in this composite photocatalytic system.Consequently, largely improved CO 2 photoreduction activity is achieved for the C 60 /CsPbBr 3 catalytic system, with an average electron consumption rate 1.9 times that of the pristine counterpart.Our work has provided an effective strategy for the construction of halide perovskite-based composite systems with enhanced photocatalytic performance, which have potential applications in artificial photosynthesis."
  },
  {
    "title": "Experimental",
    "content": "2.1.1.2.Synthesis of the C 60 /CsPbBr 3 composite.The C 60 /CsPbBr 3 composite was synthesized by a facile in-situ self-assembly process as follows: appropriate amount of C 60 was added into 20 mL of toluene and sonicated for half an hour for the well dispersion of C 60 .Then, the asprepared CsPbBr 3 NCs (100 mg) were added into the above mixture, which was subsequently stirred overnight at ambient temperature.After centrifugation, the obtained precipitate was with acetone for three times, and dried under vacuum at 60 C for 10 h.In this composite, the loading amount of C 60 was 2 wt. The phase structure of the products was analyzed using a D/max 2200PC X-ray diffractometer with Cu-K irradiation.TEM and HRTEM images were obtained from an FEI tecnaiG2F30 microscope at 200 kV.Energy dispersive X-ray spectroscopy (EDX) was equipped on the same instrument and used to test the element mapping of the products.The optical absorption of the products were characterized on a PE Lambda 900 UV-vis spectrometer.The Fourier transform infrared spectra (FT-IR) were measured on a Nicolet iN10 Frontier spectrometer.X-ray photoelectron spectroscopy (XPS, PerkinElmer) was used to determine the chemical states of the products.The steady-state photoluminescence (PL) and time-resolved photoluminescence (TRPL) spectra were recorded on an FluoroMax-4 photoluminescence spectrometer under 365 nm excitation. The photoelectrochemical tests were carried out on a CHI 650E electrochemical analyzer.CsPbBr 3 NCs and C 60 /CsPbBr 3 composite centrifugally deposited on F-doped SnO 2 (FTO) glass were used as the working electrodes.Ag/AgCl (in saturated KCl) and Pt wire functioned as the reference and counter electrode, respectively.The electrolyte was prepared by dissolving appropriate amount of tetrabutylammonium tetrafluoroborate (TBAPF 6 ) into ethyl acetate to form a solution (0.1 M). The photocatalytic CO 2 reduction was conducted in an air-tight reaction vessel.Typically, the as-prepared photocatalysts (8 mg), deionized water (100 L) and acetonitrile (30 mL) were added in a sealed Pyrex bottle, which was completely evacuated to remove the air inside and refilled with CO 2 .Then the air-tight system was irradiated with a 300 W Xe lamp with 420 nm cut-off filter at a light intensity of 150 mW cm -2 .The CO 2 -reduction products were detected by gas chromatograph (GC9700, Fuli Analytical Instrument Co., Ltd.)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The fabrication procedure of the C 60 /CsPbBr 3 composite has been depicted in Fig. 1(a).In brief, C 60 was dispersed into toluene to form a purple suspension, followed by the addition of appropriate amount of the as-prepared CsPbBr 3 NCs.After stirring overnight, a dark-yellow mixture was formed (Fig. 1(b)).Finally, the C 60 /CsPbBr 3 composite can be obtained by centrifugation and drying.As indicated by X-ray diffraction (XRD) patterns in Fig. 1(c), both the as-prepared C 60 /CsPbBr composite and pristine CsPbBr 3 NCs were of orthorhombic phase (JCPDS No. 18-0364).The absence of additional impurity peaks indicated the well preservation of the phase structure of CsPbBr 3 NCs during the self-assembly process.Fig. 2(a) presented the transmission electron microscopy (TEM) image of CsPbBr 3 NCs, which exhibited nanocube morphology with good monodispersity.According to the size distribution statistics (Fig. S1(a)), the CsPbBr 3 nanocubes have an average size of 10 2 nm.The clear lattice spacing observed in the high-resolution TEM (HRTEM) image (Fig. 2(b)), being 0.58 nm, corresponded to the (1 1 0) facets of orthorhombic CsPbBr 3 .As displayed by the TEM image of the C 60 /CsPbBr 3 composite (Fig. 2(c)), the morphology or crystallinity of CsPbBr 3 NCs were not altered by the modification of C 60 .However, the average particle sizes of the NCs became larger after modifying with C 60 , to approximately 15 2 nm, according to the size distribution statistics (Fig. S1(b)).Moreover, the HRTEM image of the C 60 /CsPbBr 3 composite (Fig. 2(d)) indicated that the NCs retained its crystallinity and lattice structure, which was consistent with the result of XRD (Fig. 1(c)).Careful observation showed that there was a cladding layer with noncrystal structure on the surface of the nanocubes, which could be ascribed to the successful integration of C 60 with CsPbBr 3 NCs.Moreover, the energy-dispersive X-ray spectroscopy (Fig. S2) and the elemental mapping (Fig. 2(e)) of the C 60 /CsPbBr 3 composite indicated the existence of Cs, Pb, Br and C elements. UV-vis absorption spectra was used to study the spectral nature of the as-prepared CsPbBr 3 NCs and the C 60 /CsPbBr 3 composite, as shown in Fig. 3.For pristine CsPbBr 3 NCs, the absorption band edge was 545 nm, which was similar with that of reported CsPbBr 3 NCs 46.Correspondingly, the band gap of CsPbBr 3 NCs was calculated to be 2.3 eV by the equation of E g 1240/ g .Compared with pristine CsPbBr 3 NCs, the C 60 /CsPbBr 3 composite exhibited higher absorption intensity in the visible wavelength region.This observation was consistent with the deeper color of the C 60 /CsPbBr 3 composite, as presented in the inset of Fig. 3.The strong light-harvesting capacity of the C 60 /CsPbBr 3 composite makes it a potential visible-light-induced photocatalyst for CO reduction. Fourier transform infrared spectroscopy (FTIR) characterizations were performed to further confirm the successful modification of C 60 , as shown in Fig. 4(a).The FTIR features of pristine CsPbBr 3 NCs was similar to that of previous reports 47.The signals at 2852 and 2915 cm -1 corresponded to the -CH 3 antisymmetric stretching modes, and the two bands at 1411 and 1537 cm -1 were assigned to the COO -stretching modes.In the FTIR spectrum of C 60 , four peaks at 530, 573, 1182 and 1430 cm -1 could be observed, which were ascribed to the internal modes of C 60 44.Moreover, the Raman spectra of C 60 (Fig. S3) exhibited two peaks at 1576 cm -1 and 1471 cm -1 , corresponding to the Hg (8) and Ag (2) mode of C 60 , respectively 40.For the C 60 /CsPbBr 3 composite, besides the characteristic peaks from CsPbBr 3 NCs, typical bands from C 60 could be observed, which were mark with a black circle in Fig. 4(a).From the enlarged FTIR spectra of C 60 and the C 60 /CsPbBr 3 composite (Fig. 4(b)), it can be observed that the band at 530 and 573 cm -1 in C 60 shifted to higher wavenumbers in the C 60 /CsPbBr 3 composite.The shift of the band position indicated the occurrence of interaction between C 60 and CsPbBr 3 NCs, which can benefit the electron transfer from CsPbBr 3 to C 60 . X-ray photoelectron spectroscopy (XPS) were measured to determine the surface composition and chemical state of the samples.As shown in the survey spectra in Fig. 5(a), both the C 60 /CsPbBr 3 composite and CsPbBr 3 NCs showed the existence of Cs, Pb, Br and C elements.The decreased peak intensity in the C 60 /CsPbBr 3 composite could be attributed to the shielding effect brought by the encapsulation of C 60 layer.As shown in Fig. 5b-d, the binding energies of Cs 3d, Pb 4f, and Br 3d shifted to lower positions.The Cs 3d XPS spectra (Fig. 5(b)) showed the Cs 3d 3/2 and Cs 3d 5/2 peaks in the C 60 /CsPbBr 3 composite shifted to lower energies of 737.62 and 723.63 eV, respectively.Similarly, the Pb 4f 5/2 and Pb 4f 7/2 peaks also showed a negative shift of 0.08 eV (Fig. (c)).The shift of Br 3d binding energy was more evident, by a margin of 0.12 and 0.18 eV for the Br 3d 3/2 and Br 3d 5/2 peaks, respectively (Fig. (d)).The shift of binding energies for these elements indicated the existence of electron transfer between CsPbBr 3 NCs and C 60 48.Fig. 5(e) showed the C 1s XPS spectra, which could be fitted into three peaks.The peaks at 284.2 and 284.4 eV could be identified as C--C and C -C bond from the C 60 molecule, while the peak at 288.12 could be ascribed to C--O bonded carbon.Combined with the results of TEM, UV-vis absorption and FTIR spectra, the XPS measurement further verified the successful integration of C 60 with CsPbBr 3 NCs. The as-prepared C 60 /CsPbBr 3 composite and CsPbBr 3 NCs were subsequently explored for CO 2 photoreduction in a sealed gascirculation system.A mixture of acetonitrile/water was used as the reaction medium, since the polarity of acetonitrile is mild and CO 2 has a high solubility in acetonitrile 16.For both the pristine CsPbBr 3 NCs and C 60 /CsPbBr 3 composite, CO and CH 4 were the major products, without the detection of other side products, such as H 2 .Control about 0.9 times than that of pristine CsPbBr 3 NCs (46.9 mol g -1 h -1 ). In addition, cycling runs of CO 2 photoreduction was carried out to assess the recyclability and stability of the C 60 /CsPbBr 3 composite.As shown in Fig. 6(b), no obvious decay of CH 4 and CO production yields could be perceived after four cycles, demonstrating the desirable photostability of the composite.Moreover, the recycled photocatalyst was characterized by XRD, FTIR, TEM and XPS to further evaluate the stability.As shown in Fig. 7(a), no perceptible phase change for the photocatalyst occurred after being used for 4 times.The characteristic chemical functional groups of the C 60 /CsPbBr 3 composite showed no obvious changes after stability test (Fig. 7(b)), implying the composite was quite stable during the photocatalytic reaction.Moreover, TEM image (Fig. 7(c)) demonstrated that the morphology of the spent photocatalyst was well preserved after cycled experiments.XPS characterizations (Fig. S5) further showed that the surface elemental compositions and chemical states kept constant compared with the freshly prepared photocatalyst.It was believed that the C 60 coating layer can not only increase the carrier separation and transfer, but also can protect the CsPbBr 3 NCs from degradation and enhance their stability. To elucidate the role of C 60 in enhancing the CO 2 photoreduction performance, photoluminescence (PL) characterizations were preliminary conducted to study the electron-transfer properties of the C 60 / CsPbBr 3 composite.The steady-state PL spectra of the C 60 /CsPbBr composite compared with CsPbBr 3 NCs were shown in Fig. 8(a).A strong emission at 523 nm was observed for CsPbBr 3 NCs, which arised from the intrinsic radiative recombination of the electron-hole pairs for pristine CsPbBr 3 NCs.After modifying with C 60 , the PL intensity was weakened, which could also be noticed by naked eye (inset of Fig. 8(a)).The decreased PL intensity was indicative of a retarded electron-hole recombination rate for the C 60 /CsPbBr 3 composite, which could be attributed to the introduction of an additional energy-transfer pathway provided by C 60 .Due to the highly-conductive nature of C 60 , photoinduced electrons of CsPbBr 3 NCs will transfer to C 60 rapidly, which led to the quenched PL intensity.Then, the time resolved photoluminescence (TRPL) spectra was characterized to probe the charge transfer dynamics of the samples.As shown in Fig. 8(b), the normalized TRPL decay plots verified the rapid charge separation of the C 60 / CsPbBr 3 composite.A triexponential decay kinetics was applied to fit the decay curves, with the parameters listed in Table 1.The average lifetime for the C 60 /CsPbBr 3 composite was 6.1 ns, which decreased sharply compared with that of pristine CsPbBr 3 (15.8 ns).The distinctly faster decay for the C 60 /CsPbBr 3 composite could be ascribed to the electronaccepting ability of C 60 , which served as an electron reservoir and accelerated the charge transfer from CsPbBr 3 to C 60 .Based on the results of steady-state and time resolved PL spectra, modifying with C 60 can be an efficient strategy to promote the charge separation of CsPbBr 3 NCs, thus partially addressing the serious carrier recombination issues in pristine NCs. To further clarify the charge transfer behavior in the C 60 /CsPbBr composite, photoelectrochemical (PEC) performances of the samples were measured.The amperometric It curve of the C 60 /CsPbBr composite in comparison with pristine CsPbBr 3 was illustrated in Fig. (a), which demonstrated that the photocurrent responses of both samples were highly repeatable upon on/off cycling of the light.However, the photocurrent response for the C 60 /CsPbBr 3 composite achieved an enhancement of 62 than that of the pristine counterpart, implying an On account of the abovementioned analysis, a probable charge separation and transfer mechanism of the C 60 /CsPbBr 3 composite photocatalyst was proposed, as illustrated in Fig. 10.Upon visible irradiation, CsPbBr 3 was excited to produce electronhole pairs.For pristine CsPbBr 3 NCs, the majority of photoinduced carriers will recombine, leaving only a small fraction of electrons to participate in the photocatalytic reactions.However, when CsPbBr 3 NCs were modified with C 60 , the photo-generated electrons can rapidly transfer from CsPbBr 3 to C 60 with the highly delocalized conjugated structure 49,50, due to the strong interfacial interaction between the two components and super electron acceptability of C 60 .By this means, the photo-generated electron-hole pairs were separated effectively in the C 60 /CsPbBr 3 composite, while their recombination was retarded, as confirmed by the aforementioned PL and PEC characterizations.The separated electrons subsequently participated in the CO 2 reduction process, which finally resulted in the boosted photocatalytic CO 2 convertion efficiency."
  },
  {
    "title": "Conclusions",
    "content": "In conclusion, a C 60 /CsPbBr 3 composite photocatalyst was fabricated by an in-situ self-assembly method.The resulting C 60 /CsPbBr 3 composite revealed enhanced activity toward photocatalytic CO 2 reduction, with an electron consumption rate of 90.2 mol g -1 h -1 , which was 1.9 fold that of pristine CsPbBr 3 .The PL and PEC analysis corroborated that the electron extraction capability of conductive C 60 facilitated the charge separation and migration rate, which was responsible for the photocatalytic enhancement of CO 2 reduction.Moreover, modification with C 60 greatly improved the stability of CsPbBr 3 NCs, with the phase structure, morphology and chemical composition unchanged after 4 times of stability tests.Our study has provided a useful guide in the design of stable and efficient photocatalyst systems based on lead halide perovskites, thus promoting their applications in photochemical CO 2 conversion. Fig. 1.(a) Illustration of the fabrication process of the C 60 /CsPbBr 3 composite; (b) Photographs of pristine CsPbBr 3 and the C 60 /CsPbBr 3 composite in toluene; (c) XRD patterns of the obtained CsPbBr 3 NCs and the C 60 /CsPbBr 3 composite. Fig. 2. (a) TEM and (b) HRTEM images of CsPbBr 3 NCs; (c) TEM and (d) HRTEM images of the C 60 /CsPbBr 3 composite; (e) EDX elemental mappings of Cs, Pb, Br and C elements in the C 60 /CsPbBr 3 composite. Fig. 3. (a) UVvis absorption spectra of CsPbBr 3 NCs and the C 60 /CsPbBr 3 composite.Inset: Photographs of the obtained CsPbBr 3 and C 60 / CsPbBr 3 powders. Fig. 4. (a) FTIR spectra of C 60 , CsPbBr 3 NCs and the C 60 /CsPbBr 3 composite; (b) Enlarged FTIR spectra with the wavenumber ranging from 450 to 900 cm -1 . Fig. 5. (a) Survey XPS spectra of CsPbBr 3 NCs and the C 60 /CsPbBr 3 composite; High-resolution XPS spectrum of (b) Cs 3d, (c) Pb 4f, (d) Br 3d and (e) C 1 s. Fig. 6.(a) Yield of the CO 2 reduction products by CsPbBr 3 NCs and the C 60 /CsPbBr 3 composite after 4 h of photochemical reaction; (b) Recycling test of the C 60 / CsPbBr 3 composite with CO 2 refilled every 4 h. Fig. 7. (a) XRD patterns and (b) FTIR spectra of the C 60 /CsPbBr 3 composite before and after the photochemical reaction; (c) TEM image of the C 60 /CsPbBr 3 composite after the photochemical reaction. Fig. 8. (a) Steady-state PL and (b) time-resolved PL decay spectra of CsPbBr 3 NCs and the C 60 /CsPbBr 3 composite.The inset is photographs of CsPbBr 3 NCs and the C 60 /CsPbBr 3 composite under UV excitation.Excitation wavelength: 365 nm. Fig. 9. (a) Chopped light amperometric I-t curves and (b) EIS Nyquist plots of CsPbBr 3 NCs and the C 60 /CsPbBr 3 composite under visible light illumination. PL decay parameters of CsPbBr 3 NCs and the C 60 /CsPbBr 3 composite. The authors are grateful for the National Natural Science Foundation of China (51972213). The authors declare that they have no known competing financial interests in connection with the work submitted. Supplementary data to this article can be found online at https://doi. org/10.1016/j.cej.2021.128889."
  }
]