[
  {
    "title": "Doi",
    "content": "10.1557/jmr.2017.271"
  },
  {
    "title": "Article_Title",
    "content": "In situ preparation of Z-scheme MoO3/g-C3N4 composite with high performance in photocatalytic CO2 reduction and RhB degradation"
  },
  {
    "title": "Abstract",
    "content": "This research was designed for the first time to investigate the photocatalytic activities of MoO 3 /g-C 3 N 4 composite in converting CO 2 to fuels under simulated sunlight irradiation.The composite was synthesized using a simple impregnation-heating method and MoO 3 nanoparticles was in situ decorated on the g-C 3 N 4 sheet.Characterization results indicated that the introduction of MoO 3 nanoparticles into g-C 3 N 4 fabricated a direct Z-scheme heterojunction structure.The effective interfacial charge-transfer across the heterojunction significantly promoted the separation efficiency of charge carriers.The optimal CO 2 conversion rate of the composite reached 25.6 lmol/(h g cat ), which was 2.7 times higher than that of g-C 3 N 4 .Additionally, the synthesized MoO 3 /g-C 3 N 4 also presented excellent photoactivity in RhB degradation under visible-light irradiation."
  },
  {
    "title": "Experimental",
    "content": "All chemicals were purchased from Beijing Entrepreneur Corp (Beijing, China) and used without further purification.Pure MoO 3 was prepared by heating ammonium molybdate (99.0) at 400 C for 4 h.Pure g-C 3 N 4 powders were prepared by directly calcining urea (99.0) at 550 C for 4 h.The MoO 3 /g-C 3 N 4 composites were prepared via an impregnation method.Typically, different amounts of ammonium molybdate (NH 4 ) 6 Mo 7 O 24 were dissolved in 2 mL deionized water, after which, 0.15 g of g-C 3 N 4 was added.The resulting mixture was allowed to keep at room temperature for 4 h.After the water in the solution was evaporated at 60 C, the obtained solid powders were dried and then calcined at 400 C for 2 h.Through this method, samples with different MoO 3 to g-C 3 N 4 wight ratios (i.e., 1 wt, 3 wt, 5 wt, and 7 wt MoO 3 /g-C 3 N 4 ) were obtained and labeled as 1 wt MC, 3 wt MC, 5 wt MC, and 7 wt MC, respectively. The specific surface areas were measured on Autosorb-1 (Quantachrome Instruments, Boynton Beach, Florida) by the BET method.The powder X-ray diffraction (XRD; Philips PW3040/60, Philips, Amsterdam, the Netherlands) was used to record the diffraction patterns of photocatalysts employing Cu K a radiation (40 kV/40 mA).Fourier transform-infrared (FT-IR) spectra of the samples were obtained by a Nicolet Nexus670 FT-IR spectrometer (Thermo Fisher Scientific, Waltham, Massachusetts) with a resolution of 4.0 cm A1 , using KBr as the reference sample.A JEM-2010F transmission electron microscope (JEOL USA, Inc., Peabody, Massachusetts) was used to observe the morphology of the catalysts.The XPS measurements were performed with a Quantum 2000 Scanning ESCA Microprobe instrument (Physical Electronics, Eden Prairie, Minnesota) using AlKa.The C1s signal was set in a position of 284.6 eV.The UV-vis diffuse reflectance spectra (DRS) of catalysts were recorded on a UV-vis spectrometer (Lambda900, PerkinElmer, Waltham, Massachusetts) equipped with an integrating sphere.The PL spectra were collected on FLS-920 spectrometer (Edinburgh Instruments Ltd, Livingston, United Kingdom), using a Xe lamp (excitation at 365 nm) as the light source.Electrochemical impedance spectroscopy (EIS) was carried out in the frequency range of 10 A1 to 10 4 Hz at a bias potential of 0 V versus Ag/AgCl. The photocatalytic CO 2 reduction was carried out in a stainless-steel reactor with a quartz window on the top of the reactor (Fig. S1).The light source is a 500 W Xe lamp.20 mg of solid catalyst was placed on a Teflon catalyst holder in the upper region of the reactor.4 mL water was preinjected into the bottom of the reactor.Prior to the light irradiation, the above system was thoroughly purged by CO 2 to remove air in the reactor.During reaction, the pressure of CO 2 was kept to be 0.3 MPa and the photoreaction temperature was kept at 80 C.After light irradiation for 4 h, the gas product was analyzed by a gas chromatograph (GC-950) with an FID and a TCD detector.Only the products of CO, CH 4 , and CH 3 OH were detected. The photocatalytic degradation of RhB solution (20 mg/L) under visible-light was carried out in an outer irradiation-type photoreactor.A spherical Xe lamp (350 W) equipped with a UV cut and an IR cut filters (800 nm .k .420 nm) was used as the visible-light source.The catalyst amount is 0.1 g.The concentration of aqueous RhB was determined by measuring its absorbance of the solution at 554 nm using a UV-vis spectrophotometer.Prior to irradiation, the RhB solution containing photocatalysts was kept stirring an hour in the dark to ensure the adsorption-desorption equilibrium.The reactive species trapping experiment was as same as the photodegradation process except the addition of different scavengers into the RhB solution."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The structure of MoO 3 /g-C 3 N 4 composite was characterized via XRD and FT-IR.The result of XRD analysis is shown in Fig. 1.One pronounced peak is found in g-C 3 N 4 at 27.4, which can be assigned to the characteristic interplanar staking peaks of aromatic systems. 22urthermore, the XRD patterns reveal that the prepared MoO 3 /g-C 3 N 4 composites consist of MoO 3 and g-C 3 N 4 phases except the 1 wt MC sample Fig.1(a).For 1 wt MC sample, only g-C 3 N 4 is observed due to the low content and good dispersal of MoO 3 .With the increase of MoO 3 content, the MoO 3 peak intensities increase gradually, while the g-C 3 N 4 peaks weaken.3(a), the existence of g-C 3 N 4 greatly decreases MoO 3 particles size, 23 which results in a shorter migration distance of charge carriers and subsequently leads to a higher separation rate.Figure 3(b) shows the high resolution TEM image of MoO 3 /g-C 3 N 4 composite.A clear lattice fringe of 0.3826 nm is observed in the dark area, which can be assigned to the (110) planes of MoO 3 .The neighbor area may be the g-C 3 N 4 species since the color of it is lighter than that of MoO 3 and no clear lattice fringe is observed.Considering that the sample was ultrasonicated for 10 min before TEM analysis, the result in Fig. 3 indicates that tight contact exists between the in situ formed MoO 3 and g-C 3 N 4 . Figure 4 shows the XPS spectra of g-C 3 N 4 , MoO 3 , and 3 wt MoO The VB edge of g-C 3 N 4 and MoO 3 is determined to be 1.59 and 3.2 eV, respectively, consistent with the previous results. 12,14,15e performance of the MoO 3 /g-C 3 N 4 composite in photocatalytic CO 2 reduction under simulated sunlight irradiation is shown in Fig. 5(a).The blank experiment indicates that both photocatalyst and light irradiation are necessary for photocatalytic CO 2 reduction.Methane, methanol, and CO are the detected products, and their distribution is not significantly influenced by the photocatalysts.MoO 3 exhibits no photoactivity in CO 2 reduction, while g-C 3 N 4 shows a CO 2 reduction rate of 9.4 lmol/(h g cat ), which is higher than P25 (TiO 2 ).MoO 3 /g-C 3 N 4 hybrids exhibit much higher photocatalytic activity than pure g-C 3 N 4 .With the increase of MoO 3 concentration from 1 to 7 wt, the photocatalytic activity first increases and then decreases.Sample 3 wt MC exhibits the highest CO 2 reduction rate of 25.6 lmol/(h g cat ), which is 2.7 times higher than that of g-C 3 N 4 .Figure 5(b) shows the cycling run of 3 wt MoO 3 /g-C 3 N 4 composite in photocatalytic CO 2 reduction under simulated sunlight irradiation.For each run, the sample was dried and then irradiated by a Xe lamp for 4 h.It can be seen that there is a slight decrease in the CO 2 reduction rate over the first two cycling runs.After that, rate changes little.So is the products' distribution.The result in Fig. 5(b) indicates that the synthesized MoO 3 /g-C 3 N 4 composite is stable in photocatalytic CO 2 reduction. In addition to the photocatalytic CO 2 reduction, the MoO 3 /g-C 3 N 4 composite also shows high activity in RhB degradation under visible-light irradiation.As shown in Fig. 5(c), all the MoO 3 /g-C 3 N 4 composites show worse ability in RhB adsorption than pure g-C 3 N 4 .However, the degradation efficiency of the composites is better.The 3 wt MC sample is still the best photocatalyst.The degradation rate reaches 0.185 min A1 , which is nearly three times of pure g-C 3 N 4 .Considering that the previous MoO 3 /g-C 3 N 4 composite which is synthesized via mixing-calcination method (MoO 3 /g-C 3 N 4 -MC) just presented a degradation rate of 004 min A1 , 21 it is no doubt that the in situ decoration of MoO 3 on porous g-C 3 N 4 (MoO 3 /g-C 3 N 4 -ID) generates a more efficient photocatalyst.Additionally, the MoO 3 /g-C 3 N 4 -ID sample present good stability in photocatalytic degradation of dye solution.As shown in Fig. 5(d), with the increase of cycling run times, the degradation efficiency decreases slightly.Based on the previous literature, the decrease in activity can be ascribed to the loss of photocatalyst and the dissolution of MoO 3 in water solution. 21For the fifth cycling run, the degradation efficiency is 86.3, which reaches 87 of the original photocatalytic activity.However, for the MoO 3 /g-C 3 N 4 -MC composite, only 55 of the initial activity was obtained after four recycling runs. 21This result confirms the better stability of MoO 3 /g-C 3 N 4 -ID composite.It may be ascribed to that the in situ decoration method strengthens the contact between MoO 3 and g-C 3 N 4 , which not only promotes the charge-transfer between the two semiconductors, but also increases the adhesion of MoO 3 in the composite.Clearly, the MoO 3 /g-C 3 N 4 -ID composite is a better photocatalyst both in terms of photoactivity and stability.The surface area of a photocatalyst is usually associated with the activity because a high surface area is required for the satisfactory adsorption of reactant, which benefits the photocatalytic reaction.Hence, the BET surface area of the synthesized MoO 3 /g-C 3 N 4 was investigated.The N 2 adsorption/desorption isotherms exhibit the characteristics of type IV-like isotherm, indicating the mesoporous nature of the pure g-C 3 N 4 and MoO 3 /g-C 3 N 4 samples (Fig. S2).The deposition of MoO 3 on g-C 3 N 4 decreases the specific surface area.The BET values of g-C 3 N 4 , 1 wt MC, 3 wt MC, 5 wt MC, and 7 wt MC are determined to be 63, 55, 51, 52, and 50 m 2 /g, respectively.This result is consistent in their performance in RhB adsorption Fig.5(c).However, no correlation consistency between specific surface area and photocatalytic activity is observed, indicating that the specific surface area is not a major factor in affecting the photocatalytic activity.The superior photocatalytic activity of MoO 3 /g-C 3 N 4 composites should be attributed to the efficient separation of photo-generated carriers in composites, as other g-C 3 N 4 based composites. 25262728293031 Based on the equation of E CB 5 E VB A E g and the results of VB XPS and DRS, the CB and VB edge potentials of MoO 3 are determined to be 0.40 and 3.15 eV, respectively.For g-C 3 N 4 , the two values are A1.04 and 1.59 eV.Therefore, the two semiconductors have suitable band potentials to construct a Z-scheme heterojunction structure.Driven by the inner electric field in the composite, the photogenerated electrons on the CB of MoO 3 would annihilate the holes on the VB of g-C 3 N 4 , leading the accumulation of electron and holes on the CB of g-C 3 N 4 and VB of MoO 3 , respectively (Fig. 6).It causes an efficient separation of photogenerated electrons and holes to enhance the photocatalytic activity.The radical trapping experiments were performed to prove the Z-scheme mechanism of MoO 3 / g-C 3 N 4 .Figure 7 shows the first-order kinetics plot of the photocatalytic RhB degradation in the presence of 3 wt MoO 3 /g-C 3 N 4 composite with three different scavengers, i.e., benzoquinone (BQ, O 2 A scavenger), KI (KI, OH and h 1 scavenger), and isopropanol (IPA, a quencher of OH). 32,33It can be seen that the order of the retarding effect of the three scavengers is BQ .KI .IPA, indicating the most important reactive species is O 34,35 this result indicates that the photogenerated electrons accumulate on the CB of g-C 3 N 4 .In other words, the data in Fig. 7 confirms that the migration of photoexcited electron and holes in the MoO 3 /g-C 3 N 4 composite follows a direct Z-scheme mechanism, just as shown in Fig. 6.The result of photocatalytic CO 2 reduction provides another powerful proof.The CB edge of MoO 3 is positive than the reduction potential of CO 2 E CO 2 CO 14 A0:11 V A A , 2 indicating that the photogenerated electrons cannot reduce CO 2 to fuels, as proven in Fig. 5. Therefore, if the MoO 3 / g-C 3 N 4 composites follow the type-II mechanism, the photogenerated electron would be enriched on the CB of MoO 3 .In other words, the introduction of MoO 3 to g-C 3 N 4 cannot significantly promote CO 2 reduction, which is contrary to the experimental result. On the basis of the above analysis, it can be deduced that the decoration of MoO 3 on g-C 3 N 4 promotes the separation efficiency of charge carriers, and subsequently increases the photocatalytic activity.The PL experiment was thus performed to confirm the inference.In general, a strong PL emission represents fast recombination of electrons and holes.As Fig. 8(a) shows, pure g-C 3 N 4 exhibits a strong emission in the range of 400-550 nm, according well with the previous result. 12The addition of MoO 3 significantly weakens the PL peak, indicating that the recombination of electron-hole pairs is greatly inhibited. 363773839 Meanwhile, it can be noted that the 3 wt MC sample presents the weakest PL peak, which is consistent with the data in Fig. 5.In addition to PL analysis, EIS was also performed on g-C 3 N 4 and the 3 wt MC photoelectrodes to examine the chargetransfer resistance and separation efficiency of the photogenerated electrons and holes.The result shown in Fig. 8 subsequently improve the separation efficiency of charge carriers.This result is perfectly consisted with the PL experiment."
  },
  {
    "title": "Conclusions",
    "content": "MoO 3 /g-C 3 N 4 composite was prepared via a simple impregnation method.A small amount of MoO 3 nanoparticles grown onto g-C 3 N 4 surfaces leads to considerable improvement on the photocatalytic activities for CO 2 reduction and RhB degradation, which is ascribed to the improved separation efficiency of electron-hole pairs via a direct Z-scheme mechanism.This study might provide a new insight to address the low photoactivity of pristine g-C 3 N 4 for water purification and CO 2 reduction. FIG. 1. XRD patterns (a) and FT-IR spectra (b) of MoO 3 /g-C 3 N 4 composites. . Feng et al.: In situ preparation of Z-scheme MoO 3 /g-C 3 N 4 composite particles are in situ formed and attached onto the surface of g-C 3 N 4 , thus forming MoO 3 /g-C 3 N 4 composite.Compared with the pure MoO 3 inset of Fig. 3 /g-C 3 N 4 composite.All signals of C, N, Mo, and O are detected in the survey XPS spectrum of the MoO 3 /g-C 3 N 4 composite Fig.4(a), indicating its hybrid structure, which is consistent with the XRD and TEM experiments.Pure g-C 3 N 4 has two C1s signals at 284.6 and 288.0 eV Fig.4(b), corresponding to the adventitious carbon and the sp 2 -bonded carbon of g-C 3 N 4 , 24 respectively, while MoO 3 shows one peak at 294.6 eV.The MoO 3 /g-C 3 N 4 composite also shows two C1s peaks, indicating its hybrid structure.Meanwhile, a slight shift from 288.0 to 287.8 eV is observed in the C1s peak of 3 wt MC due to the coupling of MoO 3 .This kind of effect can also be observed in the N1s and Mo3d XPS spectra Figs.4(c) and 4(d), suggesting the strong interaction between MoO 3 and g-C 3 N 4 in the composite, and accords well with the TEM result.Such interaction can benefit the formation of MoO 3 /g-C 3 N 4 heterojunctions and the smooth charge-transfer between the two semiconductors, which subsequently promotes the separation of electron-hole pairs in the composites. e) shows the VB XPS spectra of g-C 3 N 4 and MoO 3 . FIG. 3. TEM (a) and high resolution TEM (b) images of 3 wt MoO 3 /g-C 3 N 4 composite (the inset is pure MoO 3 ). FIG. 4. XPS spectra of 3 wt MoO 3 /g-C 3 N 4 composite (a) survey spectra; (b) C1s; (c) N1s; (d) Mo3d; (e) valence band XPS. FIG. 5. Photocatalytic activities of MoO 3 /g-C 3 N 4 composite for CO 2 reduction (a) and RhB degradation (c), and the cycling run of 3 wt MoO 3 / g-C 3 N 4 in CO 2 reduction (b) and RhB degradation (d). FIG. 7. The first-order kinetics plot of the photocatalytic RhB degradation in the presence of 3 wt MoO 3 /g-C 3 N 4 composite with different scavengers. FIG. 6. Scheme for electron-hole separation and transport at the interface of MoO 3 /g-C 3 N 4 composite. J. Mater.Res., 2017 https://www.cambridge.org/core/terms.https://doi.org/10.1557/jmr.2017.271Downloaded from https://www.cambridge.org/core.Columbia University Libraries, on 19 Jul 2017 at 02:56:21, subject to the Cambridge Core terms of use, available at J. Mater.Res., 2017 https://www.cambridge.org/core/terms.https://doi.org/10.1557/jmr.2017.271Downloaded from https://www.cambridge.org/core.Columbia University Libraries, on 19 Jul 2017 at 02:56:21, subject to the Cambridge Core terms of use, available at This work was financially supported by Natural Science Foundation of Zhejiang Province in China (LY16B030002). To view supplementary material for this article, please visit https://doi.org/10.1557/jmr.2017.271."
  }
]