[
  {
    "title": "Doi",
    "content": "10.1021/acs.energyfuels.1c00820"
  },
  {
    "title": "Article_Title",
    "content": "Platinum Nanoparticles with Low Content and High Dispersion over Exfoliated Layered Double Hydroxide for Photocatalytic CO<sub>2</sub> Reduction"
  },
  {
    "title": "Abstract",
    "content": "In this study, improving the dispersion of Pt nanoparticles (Pt NPs) was proposed to reduce the quantity of noble metal cocatalyst in a CO 2 photocatalytic reaction.A low content of Pt NPs was loaded over exfoliated layered double hydroxide (ex-LDH) by electrostatic interaction for the preparation of a highly dispersed Pt-loaded photocatalyst.Transmission electron microscopy (TEM) images indicate that Pt/ex-LDH shows a better dispersion of Pt NPs compared with Pt-loaded initial LDH.Experimental results show that 0.1 Pt-loaded ex-LDH shows the highest photocatalytic activity with a CO evolution rate of 2.64 molg -1 h -1 , which is about 8.52 and 2.20 times higher than those of 1 Pt-loaded ex-LDH and 0.1 Pt-loaded initial LDH.Characterization results show that the high photocatalytic activity of 0.1 Pt-loaded ex-LDH originates from the enhanced charge separation efficiency by highly dispersed Pt NPs and the combination center caused by a high content of Pt species accounts for the decrease of photocatalytic activity when the Pt content is high."
  },
  {
    "title": "Experimental",
    "content": "The details of materials characterization and photoelectrochemical measurement are described in the Supporting Information. 2.1.Synthesis of Exfoliated Mg-Al LDH Nanosheets.MgCl 2 6H 2 O (0.02 mol) and AlCl 3 6H 2 O (0.01 mol) were dissolved in deionized water (30 mL).NaOH solution (2 mol/L) was added into the mixed solution drop by drop until the pH reached 12.With the addition of NaOH solution, a large amount of white flocculent precipitation was observed.Then, the suspension was aged in the autoclave at 100 C for 36 h.The solid product was filtered and washed with deionized water and anhydrous ethanol.After that, the obtained samples were dried at 60 C and Mg-Al carbonate LDH was obtained. The ion exchange process of LDH was realized by a salt-acid method to obtain Mg-Al nitrate LDH. 35Mg-Al carbonate LDH (1 g) was put into a solution (1 L) containing nitric acid (0.005 mol) and sodium nitrate (1.5 mol).The mixed solution was stirred continuously for 12 h under a nitrogen atmosphere at room temperature.The solid product was filtered, washed, and then dried in a vacuum.The exfoliation of the obtained Mg-Al nitrate LDH was carried out by the mechanical oscillation method.Mg-Al nitrate LDH (100 mg) was mixed with 100 mL of formamide, and the mixture was stirred vigorously for 48 h under a nitrogen atmosphere at room temperature.Finally, the transparent colloidal suspension with a certain amount of LDH nanosheets was obtained. 2.2.Loading of Pt NPs on Exfoliated Mg-Al LDH Nanosheets.The loading of Pt precursor over exfoliated Mg-Al LDH nanosheets was realized by electrostatic attraction.H 2 PtCl 6 6H 2 O aqueous solution (10 mmol/L) was added into 100 mL of exfoliated Mg-Al LDH colloidal suspension (1 g/L), and then, the mixture was stirred for 30 min.A certain amount of NaBH 4 was added into the mixed suspension, and then, the mixture was vigorously stirred for 6 h.After that, solid product was obtained by high-speed centrifugation (14 000 rpm) and then washed with anhydrous ethanol.Finally, in order to maintain the exfoliation state of samples as much as possible, dried samples were obtained by freeze-drying.By adjusting the added quantity of H 2 PtCl 6 6H 2 O solution, the mass fraction of Pt in the corresponding products was calculated as 0.1 and 1, which are denoted as 0.1-Pt/ex-LDH and 1-Pt/ex-LDH, respectively. 2.3.Loading of Pt NPs on Initial Mg-Al LDH.Pt metal was loaded over initial LDH by a chemical reduction method.Briefly, Mg-Al LDH (100 mg) was dispersed in 100 mL of deionized water and H 2 PtCl 6 6H 2 O aqueous solution was added into the mixture.The mass fraction of Pt was calculated as 0.1.After 30 min of stirring, NaBH 4 was added into the suspension, and the reduction reaction continued for 6 h under vigorous stirring.The product was filtered, washed, and dried at 60 C, which is denoted as 0.1-Pt/LDH. 2.4.CO 2 Photoreduction Reaction.A photocatalytic activity test was performed in a sealed off-line reactor reported in our previous research. 36In brief, the dosage of catalyst for each experiment was 20 mg, and ultrapure CO 2 was fed into the reactor after mixing with deionized water by a bubbling system.UV light was provided by a 300 W xenon lamp (PLS-SXE300, Perfectlight) with a filter.During the Energy Fuels reaction process, 1 mL of gas sample was taken ceaselessly for the product measurement.The reaction product was detected by gas chromatography (GC9790II, Fuli, China) with a thermal conductivity detector (TCD) and a flame ionization detector (FID).The reaction temperature was kept at 20 C by a thermostat bath (DC-0506, Perfectlight)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "3.1.Characterization of Catalysts.The crystal structure of the catalysts was detected by X-ray diffraction (XRD) as shown in Figure 1.The diffraction peaks of the (003), (006), and (012) crystal faces belonging to a typical hydrotalcite-like structure can be observed in the pattern of LDH-carbonate, indicating the hexagonal lattice of LDH. 37The XRD pattern of LDH-nitrate was obtained after the salt-acid treatment of LDH-carbonate.Obviously, the diffraction peaks of the ( 003) and (006) crystal faces for the CO 3 2-form disappear, and new diffraction peaks appear at lower 2 angles, indicating the successful decarbonation and the formation of highly crystalline LDH-nitrate. 38According to Bragg's Law, the basal spacing of LDH increases from 0.77 to 0.89 nm after the incorporation of NO 3 -.This indicates that the interlayer spacing increases accordingly due to the incorporation of NO 3 -, which promotes the exfoliation of LDH.The weak diffraction peaks of the ( 003) and (006) crystal faces for the CO 3 2-form can also be observed in the XRD of Pt/ex-LDH samples, which can be ascribed to the structure reassembly of LDH layers in the process of solvent removing and the exposure to CO 2 in the air. 39The weak diffraction peaks for Pt/ex-LDH show a decrease of LDH crystallinity and the transformation to amorphous phase, indicating the successful process of exfoliation.The XRD pattern of 0.1-Pt/LDH is similar to that of initial LDH-carbonate.The main diffraction peaks of LDH-carbonate remain almost constant after Pt loading, which indicates that the original layered structure remained during the impregnation of Pt.No characteristic peak of Pt species was observed in all XRD patterns, which may be ascribed to the low content or high dispersion of Pt species in the samples. 40,41he exfoliation of LDH was realized by mechanical oscillation after the replacement of interlayer water by formamide, which leads to the rapid swelling of the LDH layer. 38After 2 days of exfoliation, translucent gel (1 g/L) formed from exfoliated LDH-nitrate in formamide was obtained in Figure 2a, in which an obvious Tyndall effect was observed.Inductively coupled plasma atomic emission spectroscopy (ICP-AES) was used to determine the actual Pt content in the catalysts.As shown in Table S1 (Supporting Information), the Pt content of 0.1-Pt/LDH, 0.1-Pt/ex-LDH, and 1-Pt/ex-LDH was measured as 0.13, 0.04, and 0.31 wt , which shows the loss of Pt in formamide. 32 potential was used to expound the electrostatic interaction between exfoliated LDH nanosheets and PtCl 6 2-by the measurement Figure 3 shows the atomic force microscopy (AFM) image and height profiles of exfoliated LDH in formamide.The thickness of ex-LDH is about 1.5-2.0nm, which indicates the successful exfoliation of LDH and ex-LDH built up by several single layers. 42The morphology of catalysts observed by TEM was verified by AFM images in Figure S1 (Supporting Information), which shows the layer structure stacked up with each other.Because of the aggregation and overlap of sample particles, the thin edge area of particle group, which is stacked up with several units of lamellar structure, was chosen to measure the height.The corresponding AFM height profiles of 0.1-Pt/LDH and 0.1-Pt/ex-LDH, scanning along the red line in Figure S1, show that the thicknesses of the samples are both about 60 nm.This indicates that the structure reassembly has occurred in the process of solvent removal after the exfoliation.The N 2 adsorption-desorption isotherms of catalysts are shown in Figure S2 (Supporting Information), which are all attributed to Type IV pattern and indicate the existence of numerous mesopores of catalysts.The calculated surface areas of catalysts are also shown in Figure S2.When Pt was directly loaded on the initial LDH, the specific surface area of the sample decreased slightly.When Pt was loaded on the exfoliated LDH, the specific surface area of the sample increased, which may be attributed to the expansion of layer structure by exfoliation.The surface areas of catalysts are generally close to each other, indicating that the difference in the photocatalytic activity of the catalysts is not due to physical adsorption. Figure 4 shows the Fourier-transform infrared spectroscopy (FTIR) spectra of LDH, Pt/LDH, and Pt/ex-LDH.The broad band at the range 3400-3500 cm -1 in the spectra of all samples is ascribed to the OH stretching of LDH. 37The peak at 1368 cm -1 in the spectra of all samples is ascribed to the stretching band of CO 3 2-. 43In the FTIR spectra of LDHcarbonate and 0.1-Pt/LDH, the peak at 1631 cm -1 is attributed to the bending motion of interlayer H 2 O 44 and the shoulder at 3000 cm -1 is attributed to the hydrogen bonded stretching of interlayer H 2 O. 45 However, the above phenomena caused by interlayer water molecules disappeared in the FTIR spectra of Pt/ex-LDH.Instead, the peaks at 1690 and 1600 cm -1 , belonging to stretching vibrations of CO and -NH 2 in formamide, 46,47 can be observed, suggesting that the water is removed by formamide during the rapid swelling.When the colloidal system is destroyed in the process of Energy Fuels solvent removing, nanosheets can partly reassemble and a small amount of formamide remains in the interlayer channel.The peaks at the low frequency range (about 670 and 447 cm -1 ) are ascribed to the metal-oxygen vibration of the LDH layer. 48he replacement of interlayer molecules indicates the successful exfoliation of LDH. The chemical composition and status of the surface element were detected by X-ray photoelectron spectroscopy (XPS).Figure 5a shows the high-resolution spectra of Pt 4f and Al 2p. The peak located at the range 73.9-75.2eV is observed in the spectra of all samples, which is symmetrical and can be attributed to the characteristic peak of Al 3 species in the form of Al-OH. 49,50Two weak peaks at 74.7 and 71.7 eV, belonging to Pt 4f 5/2 and Pt 4f 7/2 , indicate the existence of metallic Pt species on the surface of the samples. 51,52From the O 1s spectra of the samples in Figure 5b, the single peak at 532.1 eV in the spectra of Pt/ex-LDH is ascribed to the lattice oxygen species of hydroxyl groups. 53In addition, a peak located at 535.0 eV in the spectra of 0.1-Pt/LDH can be observed, which originates from interlayer water. 54Correspondingly, the peak belonging to water molecules cannot be observed in the spectra of Pt/ex-LDH, indicating that water molecules were replaced by formamide.This phenomenon is consistent with the FTIR results, which proves the exfoliation process of LDH.6a, the optical properties of catalysts were detected by diffuse reflectance UV-vis spectroscopy.The pure LDH exhibits weak absorption in the measured wavelength range.Compared with the pure LDH, other samples exhibit an enhanced absorption in the range 200-800 nm, which indicates that the addition of Pt NPs improved the absorption performance of all samples. 55The strong absorption in the range 200-250 nm can be attributed to the absorption of the bulk MgAl LDH, which indicates that the calculated band gap energies of all catalysts are close to 5 eV and are consistent with previous reports. 56Both 0.1-Pt/ex-LDH and 1-Pt/ex-LDH exhibit an absorption band around 400 nm in Figure 5a, which may be effected by formamide molecules in the interlayer channel. 57The band gap energy (Eg) of catalysts was calculated by classical Tauc formula expressed as follow: where is the absorption coefficient, h is Planck's constant, is the frequency, Eg is the band gap energy, and A is a constant.Beyond that, n depends on the type of optical transition of the semiconductor.LDH is considered to be a direct-gap semiconductor, and n is considered to be equal to 1/2 in this calculation.Then, the plot of (h) 2 versus hv is given in Figure 6b, and the band gap energy was acquired by extending the straight line to the horizontal axis and obtaining the intercept.The calculated band gap energies of samples were 5.71, 5.19, 5.00, and 4.82 eV, belonging to pure LDH, 0.1-Pt/ LDH, 0.1-Pt/ex-LDH, and 1-Pt/ex-LDH, respectively.A high content of Pt and a high dispersion of Pt NPs obtained by exfoliation can both narrow the band gap of catalysts.The results show that the loading of Pt NPs over LDH can expand the optical absorption range and enhance the photochemical property of LDH.For the further investigation of the band changes of catalysts, the valence band (VB) XPS spectra are shown in Figure 7a.The VB positions of pure LDH, 0.1-Pt/ LDH, 0.1-Pt/ex-LDH, and 1-Pt/ex-LDH were measured to be 3.2,3.1, 3.3, and 3.2 V, respectively.The results show that the loading of Pt and the exfoliation process have no effect on the VB potential of catalysts and the conduction band (CB) potential is mainly affected by the band gap energy.The VB and CB potential values of catalysts are summarized in Figure 7b, which all have the thermodynamic potential for the CO 2 reduction reaction. The transfer behaviors of photogenerated electron and hole were investigated by photoluminescence spectra (PL).The photoluminescence spectra of pure LDH in Figure 8 shows two PL emission peaks at around 430 and 530 nm, which is ascribed to the short-lived excitons on the surface formed by the binding of charge carriers and the defect sites of LDH. 58fter the loading of Pt NPs over initial LDH, the quenching effect of fluorescence intensity is observed in the spectra of 0.1-Pt/LDH, which is attributed to inhibition effect of Pt NPs for the recombination of electron and hole pairs.The spectral shape and PL emission peak position of 0.1-Pt/LDH are similar to those of pure LDH, which indicates that the PL emission mechanism is not changed.Correspondingly, the spectral shapes of 0.1-Pt/ex-LDH and 1-Pt/ex-LDH are quite different from those of pure LDH and 0.1-Pt/LDH, with a strong emission peak only at 475 nm, indicating that the PL emission mechanism may be different.Compared with that of pure LDH and 0.1-Pt/LDH, the fluorescence intensity of 0.1-Pt/ex-LDH and 1-Pt/ex-LDH is significantly higher, which is attributed to the molecular interaction between LDH and the organic solvent (formamide). 59This also accounts for the difference in the PL emission mechanism of samples, and a similar fluorescence phenomena has been observed for other metal oxide nanoparticles. 60,610.1-Pt/ex-LDH shows a lower fluorescence intensity than 1-Pt/ex-LDH, indicating a conspicuous suppression of electron and hole recombination.A high fluorescence intensity was observed in the spectra of 1-Pt/ex-LDH, which is due to the high content of Pt NPs leading to a recombination center and the rapidly enhanced recombination rate. 62This can be attributed to that fact that the average distance between electron trap sites decreases with a high Pt NPs loading quantity.These facts support the reduction of the recombination rate and the enhanced charge separation efficiency after the loading of Pt NPs with improved photocatalytic activity.Under the premise that both are interfered by molecular interactions between LDH and formamide, 0.1-Pt/ex-LDH shows a better capability of charge carrier separation than 1-Pt/ex-LDH, and the high content of Pt species reduces separation efficiency.PL results show that the extremely high dispersion of Pt NPs with a low Pt content could achieve a higher charge separation efficiency compared with the catalyst with high Pt content. To further directly understand the effect of Pt NPs for charge separation, the transient on/off photocurrent response of catalysts is shown in Figure 9. Compared with pure LDH, other catalysts all show a higher photocurrent density, indicating a higher charge separation efficiency obtained by Energy Fuels the loading of Pt NPs.0.1-Pt/ex-LDH shows a higher photocurrent density than 0.1-Pt/LDH, indicating that a high dispersion of Pt NPs obtained by the exfoliation process can effectively improve the charge separation efficiency.1-Pt/ ex-LDH shows a pretty poor photocurrent density, which indicates that a high content of Pt NPs loading reduces the charge separation efficiency.It should be attributed to the formation of a recombination center, which was verified by PL spectra. Reduction.The CO 2 photoreduction experiment of samples was performed under UV light irradiation.CO is the main product for all catalysts, and a small amount of CH 4 is formed during the reaction.The experiment was conducted at normal pressure and temperature for 3 h, with no other energy input except for the light source.As shown in Figure 10a, the pure LDH exhibited the worst photocatalytic activity with a CO evolution of 0.22 mol g -1 . In the case of other catalysts, the addition of Pt improved all of Energy Fuels the CO 2 photocatalytic performances compared with that of pure LDH.When Pt was loaded on the surface of initial LDH by a chemical reduction method, 0.1-Pt/LDH showed significantly increased photocatalytic activity with a CO evolution of 3.60 mol g -1 , which is ascribed to the decreased recombination rate of the charge carrier.When Pt was loaded over exfoliated LDH, the highest photocatalytic CO 2 reduction activity was observed in the case of 0.1-Pt/ex-LDH with a CO evolution of 7.92 mol g -1 .From the photocurrent results, 0.1-Pt/ex-LDH showed a higher photocatalytic activity than 0.1-Pt/LDH, which is ascribed to the enhanced charge separation efficiency caused by the high dispersion of Pt NPs.The photocatalytic activity of 1-Pt/ex-LDH decreased sharply with a CO evolution of 0.93 mol g -1 with the high Pt content.This phenomenon is mainly due to the increased recombination rate of the charge carrier, which is caused by the recombination center being formed from the high Pt content.It is worth noting that the photocatalytic activity of 1-Pt/ex-LDH is much lower than that of 0.1-Pt/LDH, indicating that the recombination center caused by high Pt content has a great influence on the photocatalytic activity. In summary, Figure 10b shows the product evolution rates of CH 4 and CO by catalysts.Except for a small amount of CH 4 , the evolution rate of CO by 0.1-Pt/ex-LDH (2.64 mol g -1 h -1 ) is about 37.7 and 2.20 times higher than those of pure LDH (0.07 mol g -1 h -1 ) and 0.1-Pt/LDH (1.20 mol g -1 h -1 ) after 3 h of UV light irradiation.In addition, the evolution rate of CO by 0.1-Pt/ex-LDH is about 8.52 times higher than that of 1-Pt/ex-LDH (0.31 mol g -1 h -1 ), which was effected by the recombination center caused by high Pt content.Hence, the beauty of this study is the higher CO 2 photocatalytic activity with a low content of highly dispersed Pt NPs achieved by the exfoliation process. Considering the characteristics of exfoliated LDH, the carbon product in the experiment may be derived from the interlayer carbonates and formamide.For ruling out the possibility, a blank experiment of 0.1-Pt/ex-LDH was performed, in which ultrapure CO 2 was replaced by Ar (99.999).From the experimental results in Figure S3 (Supporting Information), almost no CH 4 and about 5 of CO comes from other carbon sources excluding carbon dioxide, which indicates that the catalysis of photocatalyst is mainly aimed at CO 2 molecules. 3.4.Mechanism of CO 2 Photocatalytic Reduction.From the results and characterization, 0.1-Pt/ex-LDH exhibits the highest photocatalytic activity for CO 2 photocatalytic reduction into CO.The high activity achieved by low Pt content is ascribed to the high dispersion of Pt NPs obtained by the exfoliation process, which facilitates the charge separation efficiency.From the UV-vis spectra, the loading of Pt by the exfoliation process and direct addition can narrow the band gap of catalysts but the difference between the catalysts is small.PL spectra and photocurrent results show that the decisive factor to improve the photocatalytic activity is the charge separation efficiency. The mechanism for the effect of Pt NPs on charge separation in CO 2 photocatalytic reduction is illustrated in Figure 11a.When Pt NPs were loaded over exfoliated LDH, uniform and highly dispersed Pt/ex-LDH nanocomposites were obtained by the electrostatic attraction between PtCl 6 2and positively charged LDH nanosheets.The uniform but too dense Pt NPs can be obtained when the content of Pt is high.When Pt NPs were directly loaded over initial LDH, Pt NPs with an uneven size could be observed, indicating the aggregation of Pt NPs during preparation.0.1-Pt/ex-LDH shows the highest photocatalytic activity due to the suppression of electron hole recombination with highly dispersed Pt NPs as electron trap sites.However, the high content of Pt NPs over exfoliated LDH leads to the recombination center and enhanced recombination rate, which is attributed to the decreased average distance between electron trap sites, and the photocatalytic activity of 1-Pt/ex-LDH is therefore drastically reduced.In the case of 0.1-Pt/ LDH, the aggregation of Pt NPs leads to less active sites and electron trap sites, which reduces the photocatalytic activity.The photoluminescence (PL) behavior proves the increased charge carrier recombination rate of 1-Pt/ex-LDH caused by the recombination center formed from high Pt content compared with that of 0.1-Pt/ex-LDH, and photocurrent results show that the high dispersion of Pt NPs obtained by the exfoliation process can effectively improve the charge separation.The reaction mechanism of CO 2 photocatalytic reduction over 0.1-Pt/ex-LDH is succinctly exhibited in Figure 11b.In addition, the photocatalytic activity of reported Pt-loaded photocatalysts is listed in Table 1 to prove that the Pt content used in this study is quite low.Compared with conventional Pt/TiO 2 and many Pt-loaded novel materials (LaPO 4 , C 3 N 4 , and MOFs) reported in other researches, the Pt content of 0.1-Pt/ex-LDH in this study is much lower or even lower by 2 orders of magnitude.Meanwhile, 0.1-Pt/ex-LDH shows fairly high photocatalytic activity among the Pt-loaded photocatalysts.This result indicates that the highly dispersed Pt NPs over ex-LDH formed by the electrostatic interaction can achieve high photocatalytic activity with a low Pt content."
  },
  {
    "title": "Conclusions",
    "content": "In brief, the highly dispersed Pt NPs over exfoliated LDH with a low Pt content was synthesized by electrostatic interaction and used for CO 2 photocatalytic reduction.The influence of Pt NPs dispersion on the photocatalytic activity under the conditions of low Pt content was clarified, and this study is of great significance for reducing the cost of noble metals with maintaining high photocatalytic activity.The main conclusions are as follows: (1) The highest photocatalytic activity was obtained by 0. Figure 1.XRD patterns of LDH, Pt/LDH, and Pt/ex-LDH. Figure 2. (a) Tyndall effect shown by exfoliated LDH dispersed in formamide (1 g/L).(b) TEM image of LDH-carbonate.(c) TEM image and (d) HAADF-STEM image of 0.1-Pt/LDH.(e) TEM image of 0.1-Pt/ex-LDH.(f) HAADF-STEM image and (g and h) HRTEM images of 1-Pt/ ex-LDH. Figure 3. (a) AFM image and (b and c) height profiles of exfoliated LDH in formamide. Figure 4. FTIR spectra of LDH, Pt/LDH, and Pt/ex-LDH. Figure 5. XPS analysis of (a) Pt 4f and Al 2p and (b) O 1s for Pt/ LDH and Pt/ex-LDH. Figure 6.(a) UV-vis spectra and (b) band gap energy calculated from the DRS of LDH, Pt/LDH, and Pt/ex-LDH. Figure 7. (a) Valence band (VB) XPS spectra and (b) position of the CB and VB potentials vs vacuum of LDH, Pt/LDH, and Pt/ex-LDH. Figure 8. Photoluminescence spectra of LDH, Pt/LDH.and Pt/ex-LDH. Figure 9. Transient photocurrents of LDH, Pt/LDH, and Pt/ex-LDH. Figure 10.(a) Production of CO and (b) evolution rate for 3 h of CH 4 and CO over LDH, Pt/LDH, and Pt/ex-LDH. Figure 11.Schematic illustration for (a) the effect of Pt NPs on the charge separation and (b) the reaction mechanism of 0.1-Pt/ex-LDH in CO 2 photocatalytic reduction. The present work indicates that the highly dispersed Pt NPs loaded over exfoliated LDH can achieve high photocatalytic activity by using a low content of Pt.This strategy has proposed a novel method for the application of LDH and noble metals in the photocatalytic region, which reduces the cost of noble metals, and we think it is instructive for the future utilization of solar energy.Discussions of materials characterization and photoelectrochemical measurement, tables of Pt content of catalysts revealed by ICP-AES analysis and potential, and figures of AFM images, height profiles, N 2 adsorption-desorption isotherms, and blank controlled experiment of 0.1-Pt/ex-LDH under high-purity Ar (PDF) State Key Laboratory of Coal Combustion, Huazhong University of Science and Technology, Wuhan 430074, China; orcid.org/0000-0003-3970-1309;Phone: 86 2787546631; Email: xwliuhust.edu.cnState Key Laboratory of Coal Combustion, Huazhong University of Science and Technology, Wuhan 430074, China Zijian Zhou -State Key Laboratory of Coal Combustion, Huazhong University of Science and Technology, Wuhan 430074, China Lidan Deng -State Key Laboratory of Coal Combustion, Huazhong University of Science and Technology, Wuhan 430074, China Lei Liu -State Key Laboratory of Coal Combustion, Huazhong University of Science and Technology, Wuhan 430074, China Minghou Xu -State Key Laboratory of Coal Combustion, Huazhong University of Science and Technology, Wuhan 430074, China; orcid.org/0000-0001-5180-279XComplete contact information is available at: https://pubs.acs.org/10.1021/acs.energyfuels.1c00820This work was supported by the National Natural Science Foundation of China (51922045 and 51906078) and the China Postdoctoral Science Foundation Funded Project (2020M672350).The Analytical and Testing Center at Huazhong University of Science Technology is appreciated for providing analysis and characterization results.Activity Comparison of Pt-Loaded Catalysts for CO 2 Photoreduction s Supporting InformationThe Supporting Information is available free of charge at https://pubs.acs.org/doi/10.1021/acs.energyfuels.1c00820.AuthorsJie Xu -NotesThe authors declare no competing financial interest.ACKNOWLEDGMENTS https://doi.org/10.1021/acs.energyfuels.1c00820Energy Fuels 2021, 35, 10820-10831 Downloaded via CALIFORNIA INST OF TECHNOLOGY on August 13, 2021 at 12:37:21 (UTC).See https://pubs.acs.org/sharingguidelines for options on how to legitimately share published articles. https://doi.org/10.1021/acs.energyfuels.1c00820EnergyFuels 2021, 35, 10820-10831 Energy Fuels"
  }
]