[
  {
    "title": "Doi",
    "content": "10.1016/j.jcis.2020.06.103"
  },
  {
    "title": "Article_Title",
    "content": "Facile polyol-triggered anatase–rutile heterophase TiO2-x nanoparticles for enhancing photocatalytic CO2 reduction"
  },
  {
    "title": "Abstract",
    "content": "Solar-driven CO 2 photoreduction into fuels has great potential in addressing the environmental and energy crisis.Heterophase TiO 2 has attracted increasing attention in photoenergy applications owing to its fascinating properties, but much more attention has been paid on photodegradation and photocatalytic water splitting than that of photocatalytic CO 2 reduction.Herein, anatase-rutile heterophase TiO 2 nanoparticles with oxygen vacancy (TiO 2-x ) were successfully synthesized by involving proper amounts of polyols (EG, DEG, TEG, etc.) into the reaction system.The heterophase TiO 2-x nanoparticles could accelerate the electron-hole separation and exhibit superior photocatalytic activity for reducing CO 2 into methane.This work offers an alternative approach to simply fabricate TiO 2-x -based heterophase photocatalyst towards efficient CO 2 photoreduction."
  },
  {
    "title": "Experimental",
    "content": "The synthesis process of heterophase TiO 2-x was performed according to previous report in fabrication of anatase TiO 2 with major modification 16.In a typical synthesis, 0.7 g K 2 TiO(C 2 O 4 ) 2 -A2H 2 O was firstly dissolved in 30 mL H 2 O and 10 mL ethylene glycol with sonication.Then the above homogeneous solution was transferred into a 50 mL Teflon-lined autoclave and maintained at 180 C for 12 h.After cooling down to room temperature, the obtained precipitate was centrifuged and washed thoroughly with deionized water and ethanol for seven times, and finally dried at 60 C overnight.The obtained product was denoted as TiO 2 -EG10.The samples synthesized in 40 mL H 2 O and 10 mL H 2 O-30 mL EG were denoted as TiO 2 -EG0 and TiO 2 -EG30, respectively."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The XRD pattern (Fig. 1a) of the obtained TiO 2 -EG10 product could index well with the anatase (JCPDS No. 1-562) and rutile (JCPDS No. 1-1292) phase.It suggests the TiO 2 -EG10 sample was composed of these two phases of rutile and anatase.As displayed in Fig. 1b, the Raman spectra of the TiO 2 -EG10 sample has characteristic band at 147, 396, 513, and 639 cm A1 , corresponding to the typical vibrational modes of the anatase phase 17.At the same time, the typical Raman modes of the rutile phase can also be found at 444 cm A1 , indicating a mixed phase of the product, which was also consistent with the XRD result.SEM image in Fig. S1 shows that the TiO 2 -EG10 sample consists of many small nanoparticles.TEM and HRTEM were further employed to confirm the structure of the TiO 2 -EG10 sample.As shown in Fig. 1c, many small nanoparticles attached each other was obtained.It was also observed that clear lattice fringe in Fig. 1d, and the d-spacing of 0.35 and 0.32 nm corresponded to the (1 0 1) and (1 1 0) crystal plane of anatase and rutile TiO 2 , respectively.This result further revealed that heterophase TiO 2 nanoparticles were successfully synthesized in this reaction system. Interestingly, when the reaction system did not involve the EG molecules, as shown in the XRD patterns in Fig. 2a, only anatase TiO 2 (TiO 2 -EG0 sample) was fabricated.When the volume of the EG increased to 30 mL in the reaction system, the final product (TiO 2 -EG30) was also composed of anatase TiO 2 .As displayed in Fig. 2b, the characteristic bands located at 147, 396, 513, and 639 cm A1 corresponded well to the typical Raman modes of the anatase.However, the TiO 2 -EG0 and TiO 2 -EG30 samples showed different structures.Fig. 2c and Fig. S2 reveals the TiO 2 -EG0 sample had nanoparticulate structure, while the TiO 2 -EG30 sample (Fig. 2d and Fig. S3) exhibited aggregated ball-like structure. On the basis of the above results, as illustrated in Fig. 3, the volume of EG in the reaction system had significant influence on the crystal phase and structure.In the water-containing reaction system, the hydrolysis and condensation of K 2 TiO(C 2 O 4 ) 2 A2H 2 O could lead to the formation of titanium oligomers.With increasing of the reaction time, the titanium oligomers would form anatase through the nucleation and growth processes.With involving of EG into the reaction system, Ti 4 would coordinates with the water and EG molecular and cause the formation of partially hydrolyzed Ti(H 2 O) m (EG) n 2-(m n 6) octahedral.17,18 When no EG or much more EG molecules were involved into the reaction system, the crosslinking Ti(H 2 O) m (EG) n 2-octahedral would favor the nucleation and growth processes of anatase.At the same time, much more EG molecules could also facilitated the formation of the ball-like nanoparticle aggregates by the confinement of the -OH groups.Even if at the shorten reaction time, ball-like nanostructures were also obtained (Fig. S4 and Fig. S5).In contrast, when a proper volume of EG was employed, most of the resultant anatase and rutile nanocrystals with randomly orient through the nucleation and growth processes had a lattice-matching relationship and would come into contact easily (Fig. S6).17 When replacing the EG molecules with DEG (Fig. S7 and Fig. S8) and TEG (Fig. S9 and Fig. S10), the results also confirmed that much more polyol molecular was beneficial for the formation of ball-like anatase nanostructures, while proper amounts of polyol could lead to the construction of anatase-rutile heterophase nanoparticles. In addition, the EG also could tailor the oxygen vacancy of the TiO 2 nanostructures.In the EPR spectra (Fig. 4a and Fig. S11), the signal at g 2.001 corresponds to oxygen vacancy.19 It was found the signal of TiO 2 -EG0 sample was a little weaker than that of TiO 2 -EG10 sample, but it was much weaker than that of the TiO 2 -EG30 sample.It indicated the TiO 2 -EG0 sample possessed small amount of crystal defects while the TiO 2 -EG30 sample had much one.As shown in Fig. S12, the Ti 2p peaks of TiO 2 -EG0, TiO 2 -EG10, and TiO 2 -EG30 gradually shift to low binding energies, indicating the formation of Ti 3 caused by oxygen vacancies.Similar oxygen vacancy tuning was also achieved for BiOBr, 20 Bi 2 O 2 CO 3 , 21 and Bi 2 WO 6 22 by tailoring the volume of polyol through a solvothermal approach.As displayed in Fig. 4b, the UV A Vis diffuse reflectance spectroscopy shows that the adsorption edges of both of TiO 2 -EG0 and TiO 2 -EG30 samples were close to 430 nm, and prefer to absorb violet and ultraviolet light.While the adsorption edge of TiO 2 -EG10 exhibited a red-shift to longer wavelength (450 nm), indicative of a narrowed band gap and enhanced absorption in the visible light region.From the transformed Kubelka-Munk plots (inset in Fig. 4b), the calculated band gap values were 2.84, 2.77, and 2.81 eV for TiO 2 -EG0, TiO 2 -EG10, and TiO 2 -EG30 samples, respectively.Fig. 4c shows the N 2 adsorption-desorption isotherms of the three samples.They reveal the typical characteristics of porous materials because they all displayed a distinct hysteresis loop.The calculated BET surface area the TiO 2 -EG0, TiO 2 -EG10, and TiO 2 -EG30 samples are 164.9,151.4,and 121.7 m 2 /g, respectively, which corresponds to the average pore sizes of the 20.8, 12.3, and 3.2 nm (Fig. 4d), respectively.The above results indicated that the tuning of the involved EG molecules not only influences the crystal phase and oxygen vacancy concentration, but also has significant impact on the pore structure. The photocatalytic activity of the TiO 2 -EG0, TiO 2 -EG10, and TiO 2 -EG30 samples were evaluated through the solar-driven CO 2 photoreduction using H 2 O as reducing agent under a 300 W Xe lamp irradiation.Fig. 5a shows the yield of CH 4 with irradiation time from 1 to 4 h except for P25.During the photoreduction process, the yields of CH 4 over the TiO 2 -EG0 and TiO 2 -EG30 photocatalysts are similar.However, the TiO 2 -EG10 sample increases drastically and the yield is much more than that of both of the other two samples at the same reaction time except for at 1 h.At 4 h, the yield of CH 4 upon TiO 2 -EG0, TiO 2 -EG10, and TiO 2 -EG30 sample are monitored to be 41.1, 172.6, and 32.5 lmol/g, respectively.Fig. 5b shows the photocatalytic CO 2 reduction performances over the TiO 2 -EG0, TiO 2 -EG10, and TiO 2 -EG30 samples.The production rate of CH 4 was significantly enhanced for the rutile-anatase heterophase TiO 2-x nanoparticles (TiO 2 -EG10) with a reached value of 43.2 lmol g -1 h A1 , which is much higher than that of commercial P25 (0.8 lmol g -1 h A1 ) under the same conditions.In contrast, the anatase TiO 2 products with nanoparticulate (TiO 2 -EG0) and aggregated ball-like (TiO 2 -EG30) morphologies showed relatively lower rates of 10.2 and 7.9 lmol g -1 h A1 , respectively. On the basis of band gaps and valence band X-ray photoelectron spectroscopy (VB-XPS) curves (Fig. S13), the conduction band (CB) position of TiO 2 -EG0, TiO 2 -EG10, and TiO 2 -EG30 samples were A1.83, A1.66, and A1.61 eV, respectively (Fig. S14).All the E CB values are well-matched with the potential energy values of CO 2 reduction into CH 4 (CO 2 /CH 4 , A0.24 V NHE ).As a matter of fact, the photogenerated electrons during the photocatalysis were required for the photocatalytic CO 2 reduction.However, in a general, the electrons and holes could recombine rapidly for pure semiconductor and result in low separation efficiency.In the fluorescence spectra (Fig. S15), the TiO 2 -EG10 sample exhibited lower emission intensity than that of TiO 2 -EG0 and TiO 2 -EG30 samples, suggested that the recombination of photogenerated carriers is effectively inhibited.23 To further confirm the interfacial charge transfer efficiency of TiO 2 -EG0, TiO 2 -EG10, and TiO 2 -EG30 samples upon the photocatalytic CO 2 reduction, photoelectrochemical and electrochemical measurements were also performed.As shown in Fig. 5c, the TiO 2 -EG10 sample showed higher photocurrent intensity than that of TiO 2 -EG0 and TiO 2 -EG30 samples, reflecting it had a lower charge recombination under light irradiation 24.Fig. 5d shows the electrochemical impedance (EIS) spectra of the three samples.It can be found that the TiO 2 -EG10 sample shows smaller arc radius than other two samples, which suggests a smaller resistance would exist at the interface region and facilitate a rapid transfer of the charge for the TiO 2 -EG10 sample.On the basis of this result, it was proposed that the intimately contacting anatase-rutile phase junctions in the TiO 2 -EG10 sample could improve the charge separation and transportion 17, and it would generate more electrons to take participation in reacting with the surface adsorption CO 2 and protons to produce more final product of CH 4 ."
  },
  {
    "title": "Conclusions",
    "content": "In summary, anatase-rutile heterophase TiO 2 mesoporous nanoparticles with oxygen vacancy were fabricated by a facile polyol-mediated solvothermal method.It was found that the involving of proper amounts of polyol (EG, DEG, and TEG etc.) was beneficial for the formation of such heterophase TiO 2-x .Pure anatase phase TiO 2-x nanoparticulate and ball-like nanostructures could also be obtained by tailoring the volume ration of water to EG.Compared to the two different single anatase phase TiO 2-x nanostructures, the anatase-rutile heterophase TiO 2-x mesoporous nanoparticles exhibited much higher photocatalytic capability for CO 2 reduction due to its efficient separation efficiency of photogenerated electron-hole pairs. Fig. 1.(a) XRD pattern, (b) Raman spectrum, (c) TEM, and (d) HRTEM image of TiO 2 -EG10 sample. Fig. 2. (a) XRD patterns, (b) Raman spectra, TEM images of (c) TiO 2 -EG0 and (d) TiO 2 -EG30 samples. Fig. 3. Illustration for engineering of TiO 2 nanostructures in polyol-H 2 O system. Fig. 4. (a) EPR spectra, (b) UV-Vis diffuse reflectance spectra, (c) N 2 adsorption-desorption isotherms and (d) pore size distribution of TiO 2 -EG0, TiO 2 -EG10, and TiO 2 -EG30 samples.The inset in (c) is Kubelka-Munk plots transformed from UV-Vis diffuse reflectance spectra. J. Xiong et al. / Journal of Colloid and Interface Science 579 (2020) 872-877 This work was supported by Hubei Provincial Natural Science Foundation (2019CFB386). Jinyan Xiong and Gang Cheng: Designed the methodology, arranged the experiment, processed and discussed the data, ensured the descriptions are accuracy and agreed by all authors.Mengmeng Zhang: Conducted the experiment, partial of the data collection and processing. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://doi.org/10.1016/j.jcis.2020.06.103."
  }
]