[
  {
    "title": "Doi",
    "content": "10.1016/j.solener.2020.09.054"
  },
  {
    "title": "Article_Title",
    "content": "Pt nanoparticles decorated Bi-doped TiO2 as an efficient photocatalyst for CO2 photo-reduction into CH4"
  },
  {
    "title": "Abstract",
    "content": "TiO 2 photocatalysts with different Bi (0-5 wt) and Pt (0-2 wt) contents were prepared by a two-step sol-gel and photo-deposition technique and were used in photo-reduction of CO 2 .The synthesized catalysts were characterized by X-ray powder diffraction (XRD), UV-Vis diffuse reflectance spectroscopy (DRS), scanning and transmission electron microscopy (SEM and TEM), nitrogen sorption measurement (BET), Raman spectroscopy, Electron paramagnetic resonance (EPR) spectroscopy and photoluminescence spectroscopy (PL).CO 2 photoreduction results revealed that the introduction of Bi into TiO 2 structure and subsequent loading of Pt on its surface significantly increased the methane yield.Modified TiO 2 with 3 wt of Bi and 1.5 wt of Pt resulted in the highest methane yield (20.6 mol/g) that was about 6.2 times greater than pure TiO 2 .Enhanced CO 2 adsorption on Bi-containing phases along with efficient charge separation caused by Pt nanoparticles was responsible for the superior activity in converting CO 2 into methane."
  },
  {
    "title": "Experimental",
    "content": "All the precursors, solvents, and chemicals used in this investigation were of reagent grade and were used as received without any additional purification.Titanium isopropoxide (TiP) as a precursor for TiO 2 was purchased from Sigma-Aldrich.Bismuth (III) nitrate pentahydrate Bi (NO 3 ) 3 5H 2 O, chloroplatinic acid hexahydrate (H 2 PtCl 6 6H 2 O), isopropyl alcohol, anhydrous glacial acetic acid, and methanol were obtained from Merck.Deionized water was used in all experiments. TiO 2 and Bi-doped TiO 2 (Bi-T) were prepared by alcohol-based sol gel method.10 ml of TiP was first added to 30 ml of isopropanol and the resulting solution (solution A) was kept under vigorous stirring for 30 min.The second solution (solution B) was prepared by mixing 7 ml aqueous solution of diluted acetic acid (1 M) with 10 ml isopropanol and stirred for 30 min.Solution B was then added dropwise to solution A in order to hydrolyze the TiP with the resulting white sol continuously stirred overnight.An appropriate amount of Bi(NO 3 ) 3 5H 2 O was dissolved in 10 ml of isopropanol followed by 30 min of stirring to prepare solution C which was added dropwise to the white sol in order to form the final solution that was subsequently stirred for one day followed by 12 h of drying at 80 C and 2 h of calcination at 500 C. The resulting powder was called yBi-T (y 1, 3 and 5) where T and y indicate TiO 2 and wt of Bi, respectively. The Pt-modified samples were synthesized by the photo-deposition method presented by Ma et al. (2018) and were designated as xPt-T (x 1, 1.5 and 2) where T and x indicate TiO 2 and wt of Pt, respectively.Typically, 0.5 g of TiO 2 was suspended into 200 ml of 20 vol aqueous solution of methanol in a sealed glass cell followed by adding the appropriate amount of H 2 PtCl 6 solution (4 g/l).Inert N 2 gas was then purged into the cell for 1 h to eliminate dissolved oxygen before illumination.After 4 h of UV light irradiation by 250 W Hg lamp, the browncolored solids were collected by centrifuging at 3000 rpm for 10 min.The precipitate was then rinsed several times with distilled water to remove surface adsorbed ions and then dried at 90 C for 12 h.The xPt-T and yBi-T samples were used in CO 2 photo-reduction experiments to determine the optimum amounts of Bi and Pt that were subsequently used to synthesize the bi-modified-TiO 2 . The crystalline phase and structure of the catalyst samples were identified by XRD patterns obtained from a PANalytical XPert Pro MPD diffractometer with an accelerating voltage of 40 kV at 2 scan range of 10-80 with a resolution of 0.026 .Morphological aspects of the nanostructures were observed by taking field emission scanning electron microscopy (FESEM) images using a Mira III Tescan microscope and, simultaneously, EDXS and corresponding elemental mapping were performed to evaluate the composition and dispersion of different elements in the samples.Electron microscopy micrographs of the photocatalysts were obtained by TEM using a ZEISS EM900 microscope.Porosity and specific surface area of the samples were analyzed by BET isotherm using N 2 adsorption-desorption data obtained from a Belsorpmini II apparatus.The optical absorption of the catalysts was measured by recording their reflectance using a Avaspec-2048-TEC spectrometer in the range of 300-900 nm.The reflectance data were then converted to absorbance by the Kubelka-Munk analysis.Photoluminescence emission spectra of the samples were obtained by Agilent g9800a apparatus with excitation wavelength of 325 nm.Raman spectrum of catalysts were collected using TakRam N1-541 spectrometer with 532 nm laser.Electron paramagnetic resonance (EPR) spectroscopy was performed using Bruker EMS-104 spectrometer with X-band (9.8 GHz) microwave irradiation. Photo-reduction experiments were conducted in a batch gas-solid mode photo-reactor that consisted of a glass-made cylindrical container with a quartz window on top to efficiently allow UV light transmission from the lamp to the bottom of the reactor where the powdered catalyst was placed.The reactor was equipped with Hg lamp 365 nm, (125, 250 and 400 W) as the light source and had four ports: one for inlet, one for outlet, one for sampling, and one for the temperature sensor.Prior to each experiment, 0.2 g of photocatalyst was dispersed in 20 ml isopropanol that was poured into the reactor and heated to 80 C for 2 h to form a thin photocatalyst layer.Pure CO 2 was then introduced to reactor in order to purge out the air.CO 2 flowrate was then adjusted to the desired value and introduced to a water bubbler to saturate the feed gas with water vapor prior to entering the reactor.After 30 min of feed flow into the reactor, inlet and outlet ports were sealed and the lamp was turned on to start the reaction.The products were collected in a gas bag after the completion of the reaction and injected into a GC, Agilent model 7890A equipped with an HP-5 capillary column, a thermal conductivity detector (TCD) and a flame ionization (FID) detector, to determine the product concentrations.CH 4 yield was calculated according to the Eq. ( 1). CH 4 yield Molar amounts of methane produced weight of photocatalyst To assure the reliability of the results and determine the accuracy of measured CH 4 yields, each photo-catalytic test was repeated 3 times under the same conditions.The presented data are mean values with error bars representing confidence level of 95.The detailed information about the statistical analysis is provided in supplementary file.A set of blank experiments in the condition of (I) the presence of catalyst and light irradiation without CO 2 (N 2 atmosphere), (II) presence of catalyst and CO 2 without light irradiation, and (III) presence of CO 2 and light irradiation without photocatalyst conducted to ensure that the generated products were solely from CO 2 photo-reduction."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The XRD patterns of TiO 2 , yBi-T and 1.5Pt3Bi samples are presented in Fig. 1.The diffraction peaks of both anatase and rutile phases were observed in the pattern of pure TiO 2 indicating that some of the anatase phase was converted to rutile during the high temperature calcination process.With increasing content of Bi, however, the intensity of the diffraction peak at 27.5 associated with the rutile phase had decreased and the peak totally disappeared for 3Bi-T and 5Bi-T samples indicating that Bi doping can delay the phase transition of meta-stable anatase phase to thermodynamically favored rutile phase.The shortening and widening of the anatase (1 0 1) diffraction peaks for the Bi-T samples would suggest the inhibitory effect of Bi towards crystallinity and particle growth as Bi ions at the surface of the particles contend for rearrangement and diffusion of Ti 4 and O 2-thus diminishing the crystal growth (Bagwasi et al., 2013b).The reduction in the size of crystallites, up to some extent, could enhance photo-catalytic activity through increasing accessible surface active sites and also reduction of the bulk charge carrier recombination.However, excessive shrinking in the particle size would increase surface recombination of charges and hinders photo-catalytic activity (Zhang et al., 1998).Scherrer equation was used to determine the crystallite size of samples based on (1 0 1) crystallographic plane of TiO 2 and the results are given in Table 1.The size of crystals were in the order of 5Bi-T 3Bi-T 1Bi-T TiO 2 , which were 11.09, 12.05, 14.75, and 24.6 nm, respectively. The positions of peaks in Bi-T samples were consistent with the anatase peaks listed in JCPDS 21-1272 and did not shift to lower or higher inter-planar distances indicating that Bi had not incorporated into the lattice structure of samples.The much larger ionic radius of Bi 3 (0.103 nm) compared with that of Ti 4 (0.061 nm) would prevent Bi ion accommodation into the TiO 2 unit cell.This implies that another crystalline phase containing Bi had probably formed (Murcia-Lopez et al., 2011).No diffraction peaks related to the Bi 2 O 3 or bismuth titanate solid solution phases were detected in 1Bi-T and 1.5Pt3Bi-T samples.This observation does not rule out the possibility of the formation of other phases because these crystals may have formed in very low amounts and dispersed thoroughly to be undetectable by XRD.Similarly, there was no diffraction peak related to Pt for 1.5Pt3Bi-T as a result of low Pt content with high dispersion of Pt nanoparticles.A slight diffraction peak at 30 emerged for 5Bi-T sample which may be attributed to Bi 2 Ti 2 O 7 .The presence of Bi 2 Ti 2 O 7 at Bi contents greater than 4.0 mol has also been reported elsewhere (Wu et al., 2017). The BET sorption isotherms and the BJH pore size distributions are presented in Fig. 2. Based on the IUPAC classification, all nanostructured catalysts exhibited type IV isotherm indicating the mesoporous structure of the samples.The narrow hysteresis loop in N 2 isotherm of samples is indicative of the capillary condensation for catalysts which is associated with the mesoporous structures.The BJH pore size distributions indicated that the majority of the pores had pore diameters between 2 and 20 nm.The BET surface area, pore volume, and average pore diameter of the samples are reported in Table 1 indicating an initial increase followed by a decrease in the surface area with increasing Bi content.The increase in surface area with initial increase of bismuth content is due to the formation of fine crystals contributing to a higher surface area.The reduction in surface area for 5Bi-T may be ascribed to the formation of bismuth clusters at high Bi concentration (Reddy et al., 2011) which is consistent with the XRD patterns for 5Bi-T.When 1.5 wt of Pt was deposited on 3Bi-T sample, the BET surface area slightly decreased which may be due to the particle size growth and deposition of Pt nanoparticles within the pores of 3Bi-T (Xiong et al., 2017;Zhang et al., 2009). Light absorption is the first and the vital step in photo-catalytic reactions.UV-Vis DRS absorption spectra give worthy insight into optical properties and light absorption of photocatalysts.The UV-Vis analyses for the catalysts are presented in Fig. 3.A broad peak at the UV region for all samples is attributed to the light absorption from the conduction band (CB) to the valence band (VB) of TiO 2 .As would be expected, only UV photons can excite CB electrons in TiO 2 , resulting in the steep decrease of light absorption in the vicinity of 400 nm (Fig. 3A).In contrast, Bi-modified TiO 2 samples showed a shallow absorption beyond 400 nm due to new energy levels generated by Bi modification near the band edge of TiO 2 (Reddy et al., 2011).For quantitative comparison of light absorption for Bi-doped catalysts, their optical bandgap were evaluated using the tangent line approach by Tauc plot (Fig. 3B).Bi- doped TiO 2 samples had smaller bandgap than TiO 2 with the bandgap decreasing with increasing Bi content (Table 1). For Pt-containing catalysts, high absorption within the entire UV spectra and the visible region was observed.This behavior was due to the presence of Pt nanoparticles (Compton et al., 2008;Hakamizadeh et al., 2014;Yang et al., 2007).However, this observation does not imply that photons in the visible region can be absorbed by Pt to create charge carriers.In addition, too small of a distance between Pt nanoparticles can restrict the photonic absorption of TiO 2 due to the light-shielding effect.The uniform dispersion of Pt nanoparticles plays an influential role in the optical properties of platinized photocatalysts (Wenderich and Mul, 2016). FESEM micrographs of TiO 2 , 3Bi-T and 1.5Pt3Bi-T samples are presented in Fig. 4. All samples contained semi-spherical agglomerates of TiO 2 nanoparticles.By Detailed examination of these images suggests a relative reduction in the size of the agglomerates in 3Bi-T and 1.5Pt3Bi-T samples indicating the positive effect of Bi doping on the separation of small nanoparticles subsequently resulting in an increase in the surface area.EDX and Bi elemental mapping of 1.5Pt3Bi-T are also displayed in Fig. 4 showing the uniformity of Bi dispersion within the TiO 2 structure.To explore the microstructure of particles in more detail, TEM images of TiO 2 , 3Bi-T, and 1.5Pt3Bi-T are presented in Fig. 4(D)-(F), respectively.All nanoparticles mainly exhibited spherical shapes.The mean size of TiO 2 and 3Bi-T nanoparticles that were obtained from the size measurement of at least 60 nanoparticles was 21.1 and 14.9 nm, respectively.Mean particle sizes were close to those predicted by XRD for crystallite sizes.Interestingly, the presence of Pt nanoparticles in TEM images was not observed.However, the SEM image of 1.5Pt3Bi-T (Fig. 4G) collected by backscatter detector that was sensitive to the atomic weight of elements, showed some brightcolor particles (Fig. 4G) that were an indication of agglomerated Pt particles.This phenomenon was also reported elsewhere indicating the non-homogenous dispersion of Pt nanoparticles on TiO 2 (Tasbihi et al., 2019). Although light absorption is an important step for photocatalytic CO 2 reduction, the quenching of photo-created charge carriers restricts the efficient utilization of absorbed photons by TiO 2 .Photoluminescence spectroscopy is a technique based on the recombination of electron and holes and was used to compare the recombination of charge carriers for different photocatalysts.Fig. 5 illustrates the PL spectra of photocatalysts.All samples showed a broad peak at around 380 nm that is attributed to their band gap.Compared with the peak intensity of TiO 2 , a slight decrease in the intensity of Bi-T was observed.The intensity of peaks had the order of TiO 2 5Bi-T 1Bi-T 3Bi-T indicating that Bi dopant had reduced the recombination process with Bi content only up Fig. 4. FESEM micrographs of (A) TiO 2 , (B) 3Bi-T, (C) 1.5Pt3Bi-T; TEM image of (D) TiO 2 , (E) 3Bi-T, (F) 1.5Pt3Bi-T; (G) backscatter SEM image of 1.5Pt3Bi-T; (H-J) elemental mapping of 3Bi-T; and (K) EDX spectrum of 3Bi-T.to 3 wt.This observation that was in excellent agreement with results presented elsewhere (Sood et al., 2014;Xu et al., 2011) suggested that 3Bi-T had the optimum Bi content to most efficiently reduce the undesired recombination thus increasing the life time of charge carriers which in turn would result in improved CO 2 photo-conversion.It has been proposed that trapping of electrons within Bi-O sites was the reason for charge separation enhancement at low Bi content, whereas at higher Bi contents, these sites act as recombination centers (Bagwasi et al., 2013a;Rengaraj et al., 2006).After modification with Pt, a tangible decrease in PL emission can be seen in comparison with both TiO 2 and Bi-T.This behavior is in line with the superior ability of Pt for trapping photo-created electrons. Raman spectroscopy as a very sensitive tool for detection of local structural changes of materials used to investigate the changes in host TiO 2 owing to the incorporation of bismuth dopant.Fig. 6 represents the Raman spectrum of TiO 2 , 3Bi-T and 1.5Pt3Bi-T.According to tetragonal structure of anatase with space group of I41/amd, five Raman peaks at around 141, 198, 397, 513, and 640 cm -1 has been discerned in the spectrum of three catalysts, which are attributed to the various Raman active phonons of anatase (E g mode from stretching vibration, A 1g mode from antisymmetric bending vibration and B 1g mode from symmetric bending vibration of O-Ti-O) (Prajapati et al., 2017).For 3Bi-T and 1.5Pt3Bi-T, the Raman bands slightly widened and their intensity decreased as compared with pure TiO 2 , due to the reduction in crystallite size (Luo et al., 2011).This observation was in excellent agreement with the XRD analysis.Additionally, the peak of TiO 2 at 141 cm -1 positively shifted to 147 cm -1 for 3Bi-T that could be related to the oxygen vacancy formation (Bian et al., 2009;Gul et al., 2020). EPR spectroscopy is a valuable technique for the identification of unpaired electrons.Raman analysis results showed the possibility of the oxygen vacancy formation in Bi-doped catalysts.Since oxygen vacancies can detect with EPR spectroscopy, this analysis was performed to further investigate oxygen vacancy creation upon Bi-doping.EPR spectrum of TiO 2 , 3Bi-T and 1.5Pt3Bi-T are represented in Fig. 7.As can be seen, no EPR signal appeared for pure TiO 2 , whereas an obvious signal at g 2.004 discerned for 3Bi-T and 1.5Pt3Bi-T.These signals are ascribed to the oxygen vacancy generation upon Bi doping (Alam et al., 2017;Zhang et al., 2020). CO 2 photo-reduction experiments were conducted to evaluate the performance the synthesized photocatalysts.To elucidate the possibility of organic residue contribution to the CH 4 formation, blank experiments were conducted in the absence of light, CO 2 , and photocatalyst, which revealed no CH 4 formed in all these experiments.As a result, the real carbon source of generated CH 4 was reactant CO 2 , and organic residue could not exist in the photocatalysts because organic matters act as a carbon source for hydrocarbon production (khalilzadeh and Shariati, 2019; Olivo et al., 2017;Ovcharov et al., 2014).Raman spectroscopy also revealed the absence of organic matters in the catalysts because no peak related to the vibration of organic molecules in the range of 1000-2250 cm -1 was observed for prepared catalysts (see Fig. 6) (Souza et al., 2018).Therefore, the observed methane production in this study was due to the real activity of prepared catalysts.Gas phase photoreduction of CO 2 results in the formation of CO and CH 4 as major products (Moustakas and Strunk, 2018).Pure TiO 2 would produce CO as the major product with only small amounts of CH 4 .Based on many published reports in the literature (Ma et al., 2018;Tasbihi et al., 2018bTasbihi et al., , 2018a)), when Pt is introduced in TiO 2 , the trend of selectivity would reverse and CH 4 had become the major product.On the basis of CO 2 redox potential, CH 4 (which is the most reduced form of single-carbon product) requires 8 electrons and thus has the least negative potential.It is therefore reasonable that Pt nanoparticles, which act as an electron trap and also have less negative reduction potential than the CB of TiO 2 , tend to complete the reduction of CO 2 to CH 4 (Li et al., 2012).In this investigation, CH 4 yield was chosen as a criterion for comparing the photo-activity of the prepared samples and the results are presented in Fig. 8.The uncertainty in CH 4 yield was in the range of 3-7 of the measured value suggesting appropriate reliability (Wang et al., 2018) (Table S1). CH 4 yield for pure TiO 2 after reaction time of 10 h was only 3.3 mol/g.For the catalyst containing 3 wt of Bi and 1.5 wt of Pt (1.5Pt3Bi-T), the methane yield had increased to 20.6 mol/g.For the Pt modified TiO 2 catalysts, the optimum amount of Pt was 1.5 wt.It is believed that excessive concentration of Pt nanoparticles would reduce the photocatalytic activity by hindering photonic absorption capability of the photocatalyst through light scattering and by increasing the probability of electron-hole recombination (Hakamizadeh et al., 2014;Li et al., 2012;Tan et al., 2015).Moreover, the sample with 3 wt of Bi showed maximum activity among Bi-T samples.Thus, 1.5Pt3Bi-T was chosen for further investigation.The CH 4 yield for 1.5Pt3Bi-T (20.6 mol/g) was higher than both 1.5Pt-T (15.8 mol/g) and 3Bi-T (16.9 mol/g) indicating a synergistic effect of Pt and Bi incorporation onto TiO 2 .A number of explanations could be suggested for the promotional effect of Pt and Bi towards CO 2 photo-reduction.The co-catalytic effect of Pt nanoparticles in trapping the photo-generated electrons and donating them for CO 2 photo-reduction has also been reported elsewhere (Dong et al., 2018;Mao et al., 2014;Wang et al., 2010).It is reported that when the photo-deposition method is applied for Pt introduction on TiO 2 , the Pt nanoparticles are formed on those surface sites of TiO 2 where photo-generated electrons are more favorable to reach (Jiang et al., 2018).In other words, Pt nanoparticles do not disperse randomly and spread uniformly over the surface of TiO 2 for better extraction of electrons from CB of TiO 2 .Meanwhile, the introduction of basic Bi on the surface of TiO 2 would result in enhanced chemisorption of CO 2 that is a crucial first step in CO 2 photo-reduction. As evidenced by XRD patterns of 5Bi-T sample, Bi 2 Ti 2 O 7 might be present and uniformly dispersed in Bi-modified samples.This phase could stabilize CO 2 by forming carbonate species (Walker et al., 2016).It is generally accepted that alkaline modification results in better adsorption of acidic CO 2 for subsequent photo-reduction to value-add chemicals (Feng et al., 2018;Meng et al., 2014).In addition, experimental and theoretical studies suggest that when an element with oxidation number less than that of host elements (4 for Ti 4 in TiO 2 ) is doped in TiO 2 , it would create an oxygen vacancy to compensate electrical charge (Takata and Domen, 2009;Wu et al., 2012).In this study, Raman and EPR spectroscopy demonstrated the creation of oxygen vacancies in Bi-doped samples.Oxygen vacancy is a common defect in metal oxides that intrinsically exist in TiO 2 .Owing to the existence of localized electrons in the vicinity of oxygen vacancy, they are highly active sites for CO 2 photo-reduction.Moreover, CO 2 can donate one of its oxygen atoms to fill the oxygen vacancy, alleviating the cleavage of C O bond (Ji and Luo, 2016;Li et al., 2018;H. Zhao et al., 2017).All of the aforementioned explanations could contribute to the observed enhancement of CO 2 photo-reduction upon modification of TiO 2 with Pt and Bi.Fig. 9 represents the proposed mechanism of CO 2 photoreduction on 1.5Pt3Bi-T. The absorption of photons leads to the creation of electrons and holes in CB and VB of TiO 2 , respectively.Some of the photo-generated electrons are extracted by Pt nanoparticles and directly transferred to CO 2 or its intermediates on the surface of Pt particles while others reach the surface of TiO 2 to react with CO 2 already adsorbed on Bi sites.Holes that are left at the VB accept electrons from water molecules to produce oxygen.The elementary reactions involved during CO 2 photo-reduction to methane are summarized by reactions (2) to (10) (Habisreutinger et al., 2013): Fig. 9. CO 2 photo-reduction mechanism on 1.5Pt3Bi-T. CO e - CO - (4) C H e - CH (6) CH 3 H e - CH 4 (9) A comparison of methane yield for different Pt and/or Bi-containing TiO 2 catalysts summarizing the results of current and past investigations works is presented in Table 2 indicating that 1.5Pt3Bi-T with the best photo-catalytic performance among all reported samples in this study, has a comparatively good photo-catalytic activity due to the appropriate and rational modifications applied in the current work. Due to the importance of photocatalytic properties appraisement for practical and full-scale industrial applications, perfect consideration must be allocated to the investigation of reusability and lifetime aspects of the photocatalyst.Thus, 1.5Pt3Bi-T was subjected to the consecutive photocatalytic tests.As shown in Fig. 10, at sixth test only 13 of the initial methane yield was lost, verifying that 1.5Pt3Bi-T is a rather stable photocatalyst for the conversion of CO 2 into CH 4 . The effect of light intensity on the CH 4 yield over 1.5Pt3Bi-T sample was studied by applying three different Hg lamps with the nominal power of 125, 250 and 400 W. According to the spectroradiometer measurement, the corresponding light intensity of light sources were 14, 28 and 45 mW/cm 2 in the UV region.Photocatalytic tests showed that CH 4 yield increased in the order of 13.8 20.6 24.7 mol/g for 14, 28 and 45 mW/cm 2 light irradiation, respectively.The increase in light intensity in the range of 14-45 mW/cm 2 results in higher hydrocarbon production since the higher light intensity generates more electron-hole pairs, providing more redox agents for photocatalytic reduction of CO 2 .According to the previous studies (Dilla et al., 2017;Sauer et al., 2002), the influence of light intensity on photocatalytic reactions can be classified into three ranges: (I) at relatively low light intensity portion, the photo-catalytic reaction rate is linearly proportional to the light intensity, (II) at an intermediate range of light intensity, the photo-catalytic reaction rate is proportional to the square root of light intensity owing to the enhanced rate of electron-hole recombination by second-order dependence to light intensity, (III) at a sufficiently high light intensity, mass transfer restrains the rate of photocatalytic reactions and a further increase in light intensity have no promotional effect on the reaction rate.Based on the results plotted in Figs.11,1.5Pt3Bi-Tsample showed the linear relationship between the square root of light intensity and CH 4 yield that belonged to the intermediate region of light intensity."
  },
  {
    "title": "Conclusions",
    "content": "TiO 2 catalysts modified with 1, 3, and 5 wt of Bi and with 1, 1.5, and 2 wt of Pt were synthesized by the sol-gel and photo-deposition methods, respectively.The synthesized catalysts were used in the photo-conversion of CO 2 .The best performance was obtained for the catalyst with optimal loading of 1.5 and 3 wt of Pt and Bi, respectively.The incorporation of both Pt and Bi into TiO 2 at optimum loadings led to the highest CH 4 production (20.6 mol/g) that was 6.2 times greater than that for pure TiO 2 .Physicochemical features of the synthesized photocatalysts indicated that suppression of the recombination of charge carriers, improvement of CO 2 adsorption, oxygen vacancy formation upon Bi doping and co-catalytic features of Pt nanoparticles, enhanced the CO 2 photo-conversion efficiency.The results from this investigation demonstrated that Pt and Bi co-modified TiO 2 was an affordable way of developing CH 4 -selective photocatalyst for CO 2 photoreduction.Moreover, the stability test showed the optimal catalyst (1.5Pt3Bi-T) could preserve 87 of the initial methane yield after six successive runs.Besides, a linear correlation between the square root of light intensity and CH 4 yield was found.The product yield of the current photocatalysts for CO 2 conversion, however, is still very low, suggesting that sensible approaches must be employed in the design of novel photocatalysts for CO 2 photo-reduction. Fig. 1.XRD patterns of photocatalysts. Fig. 2. N 2 sorption isotherms of modified TiO 2 and their corresponding BJH pore size distribution. Fig. 3. (A) Light absorption spectra of samples and (B) their corresponding Tauc plot. Fig. 5. Photoluminescence spectra of Pt and Bi modified TiO 2 . Fig. 8. CH 4 yield over different catalysts after 10 h of reaction. Fig. 10.CH 4 yield of 1.5Pt3Bi-T during consecutive photo-catalytic tests. Fig. 11.Effect of CO 2 photo-reduction under different light intensities.Linear correlation between the square root of light intensity and methane yield. Physiochemical properties of TiO 2 photocatalysts modified by Pt and Bi. CH 4 yield in CO 2 photo-reduction using Pt and/or Bi-containing catalysts.CH4 yield of 1.5Pt3Bi-T (20.6 mol/g) divided by reaction time (10 h).  The authors would like to thank the Iran National Science Foundation (INSF) for funding this work by grant No. 97022392. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://doi. org/10.1016/j.solener.2020.09.054."
  }
]