[
  {
    "title": "Doi",
    "content": "10.1016/j.jcou.2015.02.005"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic reduction of carbon dioxide with water on InVO4 with NiO cocatalysts"
  },
  {
    "title": "Abstract",
    "content": "InVO 4 was synthesized by solid-state reaction method using In 2 O 3 and V 3 O 4 as the starting materials.NiO was added as the cocatalyst.The catalysts were characterized by powder X-ray diffraction, scanning electron microscope, and ultraviolet-visible spectroscopy.The photocatalytic reduction of CO 2 with water was carried out in a Pyrex reactor with KHCO 3 aqueous solution bubbled with CO 2 gas under visible light illumination.Many pinholes were observed on the InVO 4 particles after loading with NiO cocatalyst.The band gap of NiO/InVO 4 was lower than that of InVO 4 due to the formation of subband in valence band by creating more defect sites on the surface of InVO 4 .Both NiO/InVO 4 and InVO 4 can reduce CO 2 to methanol under visible light irradiation.The reaction rate increased with an increase of the loading of NiO cocatalysts."
  },
  {
    "title": "Experimental",
    "content": "The polycrystalline InVO 4 was synthesized by solid-state reaction method, as reported in literature 26.The pre-dried In 2 O 3 and V 2 O 5 were used as starting materials.The stoichiometric amounts of precursors were mixed and reacted in an aluminum crucible in air at 900 8C for 12 h.The solid mixture was taken out from oven, then grounded and mixed at least 3 times during heating process to ensure homogeneous distribution of In 2 O 3 and V 2 O 5 and enhance solid reaction to obtain InVO 4 .NiO co-catalyst was loaded by incipient-wetness impregnation method with aqueous solution of Ni(NO 3 ) 2 on InVO 4 .The samples were calcined at 350 8C for 2 h in air to decompose nitrate and form NiO. Before reaction, the sample was irradiated by UVC light (220 W) overnight to activate the catalyst.The sample was denoted as NiO-InVO 4 . The XRD experiments were performed using a Siemens D-500 powder diffractometer with Cu-K a radiation (40 kV, 41 mA), 0.0248 step size and 1 s step time from 58 to 808.The Bragg-Brentano focusing geometry was employed with an automatic divergence slit (irradiated sample length was 12.5 nm), a receiving slit of 0.1 nm, a fixed slit of 48 and a proportional counter as a detector. A conventional N 2 sorption method was used to measure the BET surface area of the samples at 77 K on an ASAP2020 instrument. The shapes of InVO 4 and NiO-InVO 4 were examined by field emission scanning electron microscopy (SEM, Zeiss Supra 35 SEM).Samples for SEM analysis were prepared by drop-coating the sample suspensions (2 mL) on a glass cover-slip.The samples were coated with carbon (thermal vapor deposition) to avoid charging of the sample area under observation.SEM images were acquired at an accelerating potential of 5 kV and a working distance of 4-9 mm. The diffuse reflectance UV-vis was measured with a Cary 300 Bio UV-visible spectrophotometer.Powder samples were loaded in a quartz cell with Suprasil windows, and the spectra were collected in the range from 300 nm to 800 nm against quartz standard. Photocatalytic reactions were carried out in a continuous flow reactor.The catalyst powder (0.14 g) was dispersed in a reactant solution (50 ml) in a down-window type irradiation cell made of Pyrex glass (75 ml).0.2 M potassium bicarbonate aqueous solution was employed as an absorbent for CO 2 .CO 2 was fed continuously into the reactor for 1 h to remove oxygen in water in the dark for 30 min before reaction.Using the cooling system combined with water pump, the temperature of the reactor was maintained at room temperature.The reaction setup is shown in Fig. 2. The light source was a 500 W halogen lamp (Ever bright; H-500) with a light filter cutting the light below 400 nm providing visible light with vertical irradiation.During the photoreaction, samples were collected at a time interval of every 2 h for analysis.The reaction solution was centrifuged to separate the reaction products from the catalyst, and then drawing out 10 mL of the upper stratum for analyzing the constitution.The amount of methanol was determined by a gas chromatography (China Chromatography; GC-8900, Poropack QS column, FID)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "As shown in Fig. 1, methanol could be produced from carbon dioxide, which existed in water as CO 2 (g), H 2 CO 3 , CO 3 2A etc. with different potentials.The potentials of conduction band of InVO 4 is more negative than those of methanol yield, while the potential of valence band of InVO 4 is more positive than those of methanol yield and the formation of methanol can occur without electric power.The process for photocatalysis of semiconductors is considered as the direct absorption of a photon by band gap of the materials and generation of electron band gap of the materials and generation.The excitation of an electron from the valence band to the conduction band is initiated by light absorption with energy equal to or greater than the band gap of the semiconductor 293031.The information of band structure is definitely important for understanding of the photocatalytic reaction. Fig. 3 shows the XRD patterns of the as-prepared InVO 4 with various loadings of NiO cocatalyst.The crystal lattice parameters of XRD patterns as shown in Fig. 3 are refined as follows: a 5.7531(1)A , b 8.5201(1)A and c 6.5781(2)A .The indexed result is in agreement with the InVO 4 -III phase (JCPDS 33-0628).The XRD pattern of InVO 4 sample was well consistent with the pattern of orthorhombic InVO 4 -III phase 25,32 with space group C mcm , indicating that the sample was fully crystallized InVO 4 and no amorphous compound present in the solid product (Fig. 3a).This is prerequisite because the amorphous compound does not have semiconductor property and will not have photocatalytic activity.Moreover, it would decrease the activity of InVO 4 crystal by enhancing electron-hole recombination.No other species such as V 2 O 5 , V 2 O 3 , or In 2 O 3 , was detected, indicating that the starting materials were fully mixed and the solid-solid reaction was complete at such high temperature.If the starting materials did not mix well, some residual would be present in the final product.The heating temperature used in this study (900 8C) was significantly higher than the temperature of 680 8C required to convert InVO 4 powders to the orthorhombic phase, as reported by Touboul et al. 32.Enache et al. 33,34 showed that it is possible to obtain phase-pure orthorhombic InVO 4 films by pyrolyzing an amorphous complex precursor at 500 8C.Our temperature was much high than those reported in literature. Ye et al. 25 reported the structure of InVO 4 .InVO 4 compound belongs to the orthorhombic system, space group C mcm , a 5.7542(1), b 8.5229( 1) and c 6.5797(1)A .The structure is composed of two kinds of polyhedra: InO 6 octahedron and VO 4 tetrahedron.The InO 6 octahedron connects to each other by sharing edge to form chains along 0 0 1 direction, which is linked together by the VO 4 tetrahedral.The band structure of oxides is generally defined by d-level and O 2p-level, as confirmed by the theoretical calculations based on the first principles method for InVO 4 photocatalysts 33.Fig. 3 also shows the XRD patterns of NiO-loaded InVO 4 samples with 0.5 and 1.0 wt. NiO.An additional XRD peak appeared near 55.8618 (0 0 4) was observed, which is due to crystalline distortion induced by NiO loadings, as reported by Touboul et al. 32.No characteristic peaks of NiO were detected, which is in agreement with other researches.It indicates that NiO might incorporate in the crystalline structure of InVO 4 , or the NiO was very few and highly dispersed on the InVO 4 . Since InVO 4 was fully crystallized at 900 8C, the BET surface area was low, only 11 m 2 /g.Adding NiO did not change the surface area because the amount of NiO was very little. Fig. 4 shows the SEM photographs of the InVO 4 with various amounts of NiO cocatalyst.Fig. 4a shows the micrograph of InVO 4 sample.InVO 4 sample was assembled by a lot of tiny particles.The particle diameters of InVO 4 samples were about 1 mm.The particles agglomerated in irregular shape with ca.3-6 mm.In the micrographs of InVO 4 catalysts with 0.5 wt. NiO and 1.0 wt. NiO, some small NiO particles and pin-holes were observed on NiO-InVO 4 particles.The surface of InVO 4 was very smooth, indicating that it was fully crystallized, in consistent with the XRD results.It was expected because InVO 4 was prepared at high temperature, resulting in highly crystalline solid. Fig. 4b andc shows the micrographs of InVO 4 samples loaded with 0.5 wt. and 1.0 wt. NiO, respectively.Some small particles were observed on these two samples.The small particles on the top of InVO 4 were NiO particles, as confirmed by EDS.NiO particles were in nano size and were deposited on the surface of InVO 4 .Some pin-holes were observed on the surface of InVO 4 .The small pin holes on the surface of InVO 4 were unusual, none of the literature has reported this phenomena.The creation of pin holes was due to the reaction of NiO with InVO 4 at high temperature.NiVO 4 was formed and was vaporized.The pin holes created more kink and defect sites on the InVO 4 surface, which were the active sites for photoreaction. Fig. 5 shows the UV-vis spectra of InVO 4 and NiO-InVO 4 .The InVO 4 compound showed obvious absorption in visible light range up to 704 nm.The main absorption feature started at around 450 nm (2.8 eV).The results are the same as those in literature 25,33.The very broad UV-vis spectra (200-700 nm range) with no clear absorption edges indicate the difficulty to calculate the band gap in this material.Ye et al. 25 reported that the band gap of InVO 4 was 1.9 eV.The actual band gap of InVO 4 has been reported to be 3.2 eV in several experimental as well as theoretical studies 33,34.As discussed in these articles, the absorbance of InVO 4 at 3.0 eV arises due to energy transitions inbetween the closely spaced sub-band trapping states.Enache et al. 33 reported that InVO 4 has an indirect bandgap of 3.2 eV with a pronounced sub-bandgap absorption starting at 2.5 eV.The visible light absorption of InVO 4 powder was attributed to the presence of ionized deep donors in the space charge region of the material, which explained why InVO 4 powders showed a strong visible light absorption.This result showed that InVO 4 powder is a good catalyst to be active by visible light irradiation.The presence of empty donor states in the depletion layer is believed to be responsible for the sub-bandgap absorption of InVO 4 .0.5 wt. NiO-InVO 4 sample showed obvious absorption in visible light region up to ca. 760 nm, as shown in Fig. 5.For 1.0 wt. NiO-InVO4, a broad and weak band at ca. 745 nm was observed, corresponding to octahedral Ni 2 , as in NiO 26.The results indicated that NiO-InVO 4 had higher absorption than InVO 4 in visible light range.The UV-vis spectra show that loading NiO significant increased the absorption of visible light.The 1 NiO/ InVO 4 showed the highest absorbance in visible light region among three samples.Enache et al. 33 reported the electronic structures of InVO 4 .The band gap of bulk InVO 4 was approximately 3.1 eV.The improved photocatalytic activity by loading NiO cocatalyst has been reported by Domen et al. 28 for SrTiO 3 catalyst.By reduction at 500 K and reoxidation at 473 K, a metallic Ni layer within surface NiO was formed on SrTiO 3 surface which was indispensable for water splitting.Kudo et al. 35 reported that activity of orthorhombic BaTa 2 O 6 was drastically increased about 19 times by loading 0.3 wt. NiO without pretreatment.They reported that the metallic Ni layer was not necessary while the conduction band level of the photocatalyst was high enough for electrons transferring from catalysts to NiO surface. The NiO/InVO 4 catalysts exhibited a greater absorbance than the InVO 4 catalyst.The as-prepared InVO 4 sample was yellowish, while the NiO/InVO 4 samples were gray.The strong absorption in visible region results in deeper color for samples with NiO cocatalyst.The extension of the absorption of light from the UV to the visible range is associated with the presence of NiO cocatalyst from such local states to the conduction band, in consistent with the absorption edge of the UV-vis spectrum.Moreover, the almost parallel absorption edges of InVO 4 indicate the characteristic of band-to-band excitation.The band gap could be narrowed after NiO loading, inducing a phenomenon for a red shift in absorption wavelengths.In principle, the narrowed band gap could give rise to parallel movements of absorption edge, however the resulting local states in the band gap or the cocatalyst bound to the InVO 4 semiconductor surfaces cause absorption tails.Homogeneous deposition of cocatalytic particles on the surface of InVO 4 induced the efficient transfer of electrons transfer significantly.Apparently, adding NiO increased both the wavelength and the amount of light absorbance. From defect-chemical considerations, it would be quite difficult to dope a ternary metal oxide with a binary metal oxide.Part of NiO may dissolve into InVO 4 and formed NiVO 4 which is volatile to form pin-holes on the surface of InVO 4 .The formation of ternary Ni x In 1Ax VO 4Ax in the kink site depends on the solubility limits of the individual compounds, which in turn depends on the energy required to form compensating defects versus the energy required to form a second phase.For Ni x In 1Ax VO 4Ax , the sub-bandgap photoresponse was attributed to internal d-d transitions in the Ni ion.The results suggest that oxygen vacancies acting as deep donors, as suggested by Enache et al. 33 provides an explanation for the observed visible-light photoresponse in NiO-doped InVO 4 . The rate of the reaction product increased linearly with the visible light-irradiation time, and the reaction stopped immediately when the irradiation was ceased.The formation of the reaction product was not detected under dark conditions.The reaction rate varied with the species of photocatalyst.The activities of carbon dioxide reduction on InVO 4 samples with various NiO loadings are shown in Fig. 6.All catalysts produced methanol from the photoreduction of CO 2 under visible light irradiation.No other products were detected in gas phase and liquid phase.A comparison of the total rates of methanol formation showed that the photocatalytic activity depends on the photocatalysts in the following order: InVO 4 0.5 wt. NiO-InVO 4 1.0 wt. NiO/InVO 4 .The methanol yield of InVO 4 was 1.102 mmol h A1 g catal.A1 whereas 1.0 wt. Ni-InVO 4 showed the highest yield of 1.526 mmol h A1 g catal.A1 .The results showed that NiO-InVO 4 was more active than InVO 4 by 30 increase.It should be noted that KHCO 3 was used an absorbent to absorb CO 2 , CO 2 was in the form of H 2 CO 3 in aqueous solution.H 2 CO 3 is easier to reduce to form methanol than gaseous CO 2 as shown in the energy diagram in Fig. 1. Among these photocatalysts, the 1.0 wt. NiO/InVO 4 exhibited the highest rate of formation of methanol.The NiO cocatalyst not only provides reaction centers, which effectively transfer the electrons from the surface of catalysts, but also enhances the light absorbance. It should be noted that for dry InVO 4 , all the donor states are occupied and no optical transitions from the valence band to the donor state can occur.However, when immersed in water, partial depletion (i.e., ionization) of the donor states will occur.This leads to band bending and the formation of a depletion layer, as reported in literature 33,34.The ionized donor states can be filled through optical excitation of valence band electrons, which explains the sub-bandgap optical absorption of InVO 4 and high photoactivity of InVO 4 in liquid phase reduction of CO 2 . Ye et al. 25 reported that the bottom of conduction band of V 3d is about A0.1 eV, which is lower than conduction band level of NiO (A0.96 eV).Accordingly, the conduction band level of the NiO/InVO 4 is not high enough for electrons transfer cross InVO 4 and NiO interface.However, the theoretical calculations showed that the electronic structure of InVO 4 in thin film is strongly different from bulk structure affected by the surface configuration of the oxygen and vanadium ions.Enache et al. 33 reported that InVO 4 powder was more active than InVO 4 thin film.The ionic radius of sixfold coordinated In 3 is 80 pm, which is larger than the ionic radii for Ni 2 (69 pm).In contrast, the ionic radius of sixfold coordinated V 5 is 36 pm, significantly less than the corresponding radii for Ni 2 .Hence, Ni 2 are presumably located on the In 3 sites, especially when one considers that the formation of singly charged acceptor defects is energetically much more favorable than the formation of the triply charged defects that would be formed if any Ni would substitute for V 5 .As shown in Fig. 6, it is clear that adding NiO did improve activity.Since NiO was added after formation of full crystallite of InVO 4 .NiO did not dissolve into InVO 4 crystal in this study.Alternatively, NiO was on the external surface of InVO 4 crystal.Nevertheless, the formation of tertiary compound of Ni x InVO 4Ax in the interface could not be ruled out. It is believed that the cocatalyst formed an electron trapper, and the surface became a Schottky barrier to suppress the recombination of electron and holes.The results showed that the photocatalytic reduction was induced by the absorption of visible light. Quantum efficiency is an essential factor to evaluate a photoexcited reaction.Eq. ( 4) was used to determine the quantum efficiency.6 mol of electrons are required to produce 1 mol of methanol from CO 2 .The energy efficiency evaluates the transformation of the photon energy into chemical energy (Eq.( 5)).The quantum efficiency and energy efficiency were 2.82 and 2.12, respectively, on 1.0 wt. NiO-InVO 4 catalyst. Surface area of catalyst is not a key factor in photocatalyst.If InVO 4 is not well-crystalline, it does not have semiconductor properties and will not have photocatalytic properties.In this study, InVO 4 had a highly crystalline structure, it had semiconductor properties.The improved activity of NiO-InVO 4 over unmodified one is attributed to the distribution of photogenerated electrons by loading NiO and the extensive active kinks offered by the pin-holes on NiO-InVO 4 particles.These pin holes create more active sites, and suppressed electron-hole recombination, resulting in high photocatalytic activity. In the photoreaction, the carbon source is CO 2 , H 2 CO 3 , and CO 3 2A , which reacts with H 2 O to form CH 3 OH.The valence band is composed of O 2p orbitals and excited electrons migrate to the surface of the photocatalysts to function as reductants.NiO cocatalyst is designed to transfer electrons more efficiently as active center.Photogenerated electrons migrate from the surface of the catalyst to the cocatalytic nanoparticles and interact with the carbon source."
  },
  {
    "title": "Conclusions",
    "content": "InVO 4 catalyst was prepared by solid-state reaction method.NiO was loaded by incipient-wetness impregnation, followed by heating at 300 8C.The XRD patterns showed that InVO 4 catalysts were fully crystallized.There was no change in XRD patterns of InVO 4 catalysts with NiO cocatalysts after calcination.The particle diameters of InVO 4 samples were about 1 mm.The particles agglomerated in irregular shape with ca.3-6 mm.SEM micrographs of InVO 4 catalysts with 0.5 wt. NiO and 1.0 wt. NiO showed some small NiO particles and pin-holes.All catalysts showed high activities for CO 2 reduction under visible light irradiation. The methanol yield of InVO 4 was 1.102 mmol h A1 g catal.A1 , and 1.526 mmol h A1 g catal.A1 for 1 wt.NiO-InVO 4 .The improved activity of NiO-InVO 4 over unmodified one was attributed to the distribution of photogenerated electrons by loading NiO and the extensive active kinks offered by the pin-holes on NiO-InVO 4 particles.These pin holes create more active sites for reaction. Fig. 1.Band structures of InTaO 4 , InNbO 4 , and InVO 4 . Fig. 2. The photoreaction setup. Fig. 3. XRD patterns of InVO 4 with various amount of NiO cocatalyst.(a) InVO 4 , (b) 0.5 wt. NiO-InVO 4 and (c) 1.0 wt. NiO-InVO 4 . Fig. 4. SEM micrographs of InVO 4 with various amount of NiO cocatalyst.(a) InVO 4 , (b) 0.5 wt. NiO-InVO 4 and (c) 1.0 wt. NiO-InVO 4 . Fig. 5. UV-vis spectra of InVO 4 prepared with various amount of NiO cocatalyst.(a) InVO 4 , (b) 0.5 wt. NiO-InVO 4 and (c) 1.0 wt. NiO-InVO 4 . moles of methanol yield mole of visible light photon absorbed by catalyst (4) Energy efficiency 14 heat of combustion A moles of methanol yield radiation energy of visible light absorbed by catalyst (5) Fig. 6.Photocatalytic activity of CO 2 reduction on NiO-InVO 4 under visible light irradiation.Catalyst: 0.14 g; volume of the 0.2 N KHCO 3 aqueous solution: 50 ml. D.-S.Lee, Y.-W.Chen / Journal of CO 2 Utilization 10 (2015) 1-6 This research was supported by National Science Council, Taiwan."
  }
]