[
  {
    "title": "Doi",
    "content": "10.21577/0103-5053.20180026"
  },
  {
    "title": "Article_Title",
    "content": "ETS‑10 Modified with CuxO Nanoparticles and Their Application for the Conversion of CO2 and Water into Oxygenates"
  },
  {
    "title": "Abstract",
    "content": "Photocatalytic reactions to convert CO 2 and H 2 O into solar fuels using only solar irradiation have been investigated in this work.For this purpose, titanosilicate ETS-10 was decorated with Cu 2 O and CuO nanoparticles and their properties were analyzed by different techniques.The final materials were applied in photoreduction of CO 2 in gas phase under 20 h of solar irradiation.In the final, the products oxygen, acetic acid, formaldehyde and methanol were detected by chromatographic techniques.Photoluminescence and electrochemical studies indicate the interaction between Cu x O nanoparticles and Ti-O-Ti-O on the surface of ETS-10, corroborating with the results obtained in the photocatalytic experiments.The best CO 2 photoconversion efficiencies into methanol were obtained when using ETS-10/Cu x O compared to pure ETS-10.Another important finding in this study is the fact that the reactions were carried out in the gas phase and no scavenge donors were employed."
  },
  {
    "title": "Experimental",
    "content": "Titanium trichloride (TiCl 3 ) 14. The synthesis of ETS-10 microporous titanosilicate followed the literature. 49The titanium source was titanium trichloride and the silicon source was sodium silicate.The following molar ratios were adopted: Si/Ti 5.5; H 2 O/Si 22 and Na/(Na K) 0.76.The final pH was adjusted to 10.4 by the addition of an aqueous solution of NaOH 0.5 mol L -1 .Hydrothermal crystallization was carried out in an autoclave at 473 K for 48 h.The solid was filtered and washed several times with distilled water, dried for 24 h at 373 K, grounded and size-sieved at 32 mesh. Cu 2 O and CuO nanoparticles were prepared following the literature. 50,51For the synthesis of Cu 2 O nanoparticles, 0.4 g Cu(CH 3 COO) 2 was dissolved in 30 mL of distilled water under vigorous stirring at room temperature for 30 min.Then, 40 mL of NaOH 0.2 mol L -1 aqueous solution and 20 mL of 0.1 mol L -1 ascorbic acid aqueous solution were added into the solution and it was kept at 323 K for 30 min.Finally, the precipitated Cu 2 O was centrifuged, washed with distilled water and dried at 373 K. CuO nanoparticles were synthesized as follows: 300 mL of 0.02 mol L -1 Cu(CH 3 COO) 2 aqueous solution was mixed with 1 mL of glacial CH 3 COOH in a 500 mL beaker.Next, 0.8 mg of NaOH was added until pH 7 resulting in the formation of a black precipitate.The material was centrifuged and washed with distilled water and dried in oven at 373 K for 24 h.Before the photocatalytic reactions, the materials were dried at 423 K at heating rate 1 K min -1 for 12 h under N 2 atmosphere. After the materials were prepared, titanosilicate ETS-10 and copper oxide nanoparticles (5 wt. Cu 2 O or CuO) were mixed in ca. 5 mL of isopropyl alcohol 99, under sonication for 30 min.Then, the solvent was evaporated at room temperature and the material was dried at 423 K at heating rate 1 K min -1 for 12 h under N 2 atmosphere. The structures and properties of these materials were characterized by several techniques.X-ray diffractograms of the powder samples were obtained through a Shimadzu XRD7000 diffractometer using Cu K radiation (0.154 nm) at 40 kV and 30 mA in the range of 1.4 to 70.The slits used were 0.5, 0.5 and 0.3 mm for output, reception and divergence, respectively, and scan rate of 2 min -1 , at room temperature. The diffuse reflectance spectroscopy (DRS) measurements were obtained using a spectrophotometer Agilent Cary 5000 in the region from 200 to 800 nm at room temperature.The spectra were normalized by the intensity of the strongest band. Raman spectroscopy measurements were carried out in a Renishaw Raman Microprobe Imaging System 3000 equipment coupled to an optical microscope with spatial resolution of 1.5 m and spectral resolution of 2 cm -1 .The excitation was made by Ar laser ( 514 nm) with estimated power of 8 mW. Photoluminescence (PL) measurements were obtained in an Edinburg Analytical Instruments FL 900 spectrofluorimeter model MCP-PMT (Hamamatsu R3809U-50) with a pulsed diode operating at excitation of 290 nm (model EPLED-290, with a band width of 5 nm, 815 ps) where ETS-10 was excited preferably.The instrument response was calibrated using Ludox silica samples. Nitrogen physisorption measurements were carried out at -77 K in the relative pressure range from 10 -6 to 1 P/P 0 using a Quantachrome Nova 4200e instrument.Prior to the analysis, the samples were outgassed (residual pressure p 10 -7 mbar) at 523 K for 15 h. Low resolution images were acquired by a scanning electron microscopy measurement and carried out in a FEI Quanta 250 scanning-transmission electron microscopy detector (STEM) for high vacuum application.The powders were dispersed in carbon tape coated with Au on metallic sample holder (Cu/Zn). High-resolution images of the materials were obtained in high resolution transmission electron microscopy JEOL 3010 equipment operated at 300 kV with LaB6 filament.The samples were sonicated in ca. 10 mL of isopropyl alcohol.The suspensions were deposited in grids with ultrathin C film on holey carbon support film, 300 mesh, Au. The photocatalytic system comprises a stainless steel reactor with 50 mL volume and 3 bar of total pressure irradiated by a solar simulator (Solsim class AAA) 1.5 AM, as shown in Figure S1 (Supplementary Information (SI) section).In order to start the reactions, 50 mg of catalyst, 300 L of water and 2 bar of CO 2 were added into the reactor.It is important to emphasize that catalyst and water were maintained in different compartments and the photocatalytic reaction occur on gas phase.The mixture remained in the solar simulator for a period of 20 h where the temperature attained a maximum of 333 K.The gas phase was analyzed using a gas chromatography (GC) with thermal conductivity detector (TCD) to determine O 2 , CO and CO 2 using Q-plot and Carboxen 1006 columns, in sequence.The columns can also separate CH 4 and H 2 .At the end of this period, the liquid phase was collected in a vial crimp seal and analyzed by gas chromatography in a Shimadzu 2010 with flame ionization detector (FID) coupled to an automatic injector equipped with column DB 624 (0.25 mm 60 m 1.40 m) for methanol.The analytical curves are shown in Figure S2 (SI section).The analysis of acids were performed in a gas chromatograph HP 7890 coupled with a mass spectrometer Saturn 2100D-Varian with column DB FFAP (0.20 mm 30 m 0.33 m).The measurements were made by automatic injection of 1 L liquid sample.Finally, formaldehyde analysis was performed after derivatization using 2,4-dinitrophenylhydrazine in acid media and toluene 52,53 in a GC HP 7890 coupled to a mass spectrometer Saturn 2100D-Varian with column HP-5MS (0.25 mm 30 m 0.25 m).The analysis was carried out in SIM mode for 79 and 210 m/z.The reaction mixture was yellow and contained an aqueous and an organic phase.The organic containing formaldehyde-2,4-dinitrophenylhydrazone was analyzed. The decorated materials were deposited onto fluorine-doped tin oxide substrates (FTO, Hartford) previously treated by immersion in a solution of poly(diallyldimethylammonium chloride). 54The samples were prepared adding 0.1 g of ETS-10-based material, 0.5 mL water/ethanol 1:1 (v/v) solution, 40 L Triton X-100 and 10 L acetylacetone, ground until a paste was obtained following the reference. 55The photoelectrochemical experiments were carried out in an Eco Chimie-Autolab PGSTAT 12 potentiostat.Chronoamperometric measurements were performed using a three-electrode configuration cell (Ag/AgCl as reference electrode, the synthesized semiconductors and the decorated materials films as working electrodes and a platinum wire as counter electrode) at room temperature.The electrolyte was a mixture of 0.35 mol L -1 Na 2 SO 3 0.25 mol L -1 Na 2 S aqueous solutions.The photoelectrochemical cells were placed in an optical bench consisting of an Oriel Xe 250 W lamp coupled with an AM 1.5 filter (Oriel), collimating lenses and a water filter (Oriel)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The crystalline structures of the materials were studied by powder X-ray diffraction (XRD).The XRD patterns of titanosilicate ETS-10, Cu 2 O and CuO nanoparticles and titanosilicate ETS-10 decorated with 5 wt. of Cu 2 O nanoparticles are shown in Figure 1. Figure 1a displays the diffraction of the titanosilicate ETS-10 sample, which is consistent with the profiles found in the literature. 49The peaks at 2 7 and 14 (marked with asterisks) correspond to a small amount of ETS-4.The diffractogram presented in Figure 1b shows all the peaks corresponding to the cubic phase of Cu 2 O nanoparticles (JCPDS 05-0667).Using the Scherrer equation, the average size of crystallite was calculated as 28.3 nm by means of (111), ( 200) and (220) peak areas.The phase (111) Cu 2 O is believed to facilitate the adsorption of reaction intermediates (CO, COH, CHO, etc.) on the surface of the catalyst, which favors the formation of methanol. 56,57The size value is different from the ones observed by HRTEM images (Figure S3a, SI section), where particles of ca.50 nm were observed.An important fact to be mentioned is that, even nanocrystallites are agglomerated to form nanoparticles.In Figure 1c, the diffractogram presents peaks corresponding to CuO with monoclinic phase (JCPDS 05-0661).The sizes of the crystallites were found to be 19 nm using the area of the (002,111), ( 111) and (202) peaks as references.This result is in agreement with HRTEM images of the sample (Figure S3b, SI section).Figure 1d shows the diffractograms of the titanosilicate decorated with Cu 2 O nanoparticles, however, it was not possible to observe the peaks corresponding to the Cu 2 O phase due to the low mass ratio (20:1 ETS-10:Cu 2 O nanoparticles). Based on these considerations, one expects that the ETS-10 internal area is not affected by the presence of nanoparticles on the surface.The effective pore sizes of ETS-10 are 0.76 0.49 nm, while the nanoparticles have between 20-50 nm, not allowing their entrance into the pores.However, CO 2 (kinetic diameter 0.33 nm) In order to evaluate the most promising photocatalytic material, with suitable UV-Vis absorption, DRS analyses were carried out.The spectra are shown in Figure 2. The spectrum of the Cu 2 O nanoparticles (Figure 2, blue up triangle) showed a maximum absorption at ca. 350 nm, which extends across the visible region.A band gap (Eg) 2.2 eV was estimated from the intercept of the straightline portion in the graphic obtained by Tauc equation, as shown in Figure S4. 58,59This value is in accordance with the value reported for bulk Cu 2 O.However, the spectrum of the CuO nanoparticles (Figure 2, orange circle) shows a band at 290 nm tailing over all visible region; the Eg was estimated to be 2.3 eV in agreement with the literature value.The high value for the bang gap in comparison to bulk CuO (1.2 eV) is due to the quantum confinement of these nanoparticles. 60itanosilicate ETS-10 spectrum (Figure 2, black left triangle) consists of two overlapping bands: the first absorption band is associated with the localized charge transfer transitions in the Ti-O-Si groups at ca. 212 nm, 61 and the second band, with maximum of 350 nm corresponds to a charge transfer between O (2p) Ti(3d) at Ti-O-Ti wire; Eg value was estimated to be 3.8 eV. 62ter the incorporation of Cu 2 O and CuO nanoparticles (Figure 2, pink diamond and green down triangle curves, respectively), we observe an increase in the absorption of ETS-10 at longer wavelengths and a small shift of their Eg values: ETS-10/Cu 2 O 3.6 eV and ETS-10/CuO 3.7 eV, possibly as a consequence of an energetic coupling between the two semiconductors, ETS-10 and Cu x O.It is interesting to emphasize that these band gap variations are already observed even with a small amount of nanoparticles (5 wt.) dispersed on the surface of titanosilicate.The increase in the ETS-10 absorption towards the visible is one of the most important contributions from the copper oxide nanoparticles, favoring the application in photocatalytic reactions using sunlight. The Raman spectra of the pure titanosilicate ETS-10 and the decorated materials ETS-10/Cu 2 O and ETS-10/CuO are shown in Figure 3. The spectrum of ETS-10 presents a main band with a maximum at 732 cm -1 , attributed to the octahedra Ti-O-Ti stretching along the chains.The small peak in 640 cm -1 corresponds to the degenerated Eg active mode of anatase TiO 2 , probably in a very small concentration to be detected by XRD. 63,64After the Cu 2 O and CuO nanoparticles decoration, the maximum of the peak is displaced by 7 cm -1 to lower frequencies, while the low frequency side of the peak presents a 16 cm -1 difference between the curves corresponding to ETS-10 and decorated ETS-10 (see Figure 3) corresponding to an enlargement of the peaks.These effects can be associated with the interaction between the Cu x O nanoparticles and Ti-O-Ti wires in the framework, promoting local electronic change in the ETS-10 titanate chains. 65o additionally investigate the interaction between the copper oxide nanoparticles and the ETS-10 matrix, we carried out photoluminescence analysis (PL) of the titanosilicate ETS-10, ETS-10/CuO, ETS-10/Cu 2 O materials.The results are discussed in the next section. Photoluminescence (PL) is a non-destructive technique that probes the electronic structure (band gap determination, charge recombination, excited states) and other properties as defects and surface structure in semiconductors. Figure 4 shows the photoluminescence spectra of titanosilicate ETS-10 (black left triangle), ETS-10/CuO (green down triangle), ETS-10/Cu 2 O (pink diamond) and Cu 2 O (blue up triangle) and CuO nanoparticles (orange circle). The ETS-10 spectrum (black left triangle) shows a peak with maximum at 350 nm associated to electronic transitions (O -Ti 3 O 2-Ti 4 ) of ETS-10 matrix, the excited state being stable due to oxygen (O 2-) to titanium (Ti 4 ) charge transfer. 66The Cu 2 O spectrum (blue up triangle) showed a luminescence between 350-550 nm, with an emission maximum at 470 nm associated with artifacts (scattering phenomena occurring at the surface of the solid), which were decreased in this spectrum with the use of filters.Photoluminescence is very sensitive to surface effects/ adsorbed species of semiconductors particles and thus can be used as a probe of electron-hole surface processes.The bands at 406 and 440 nm in the Cu 2 O spectrum are related to crystal defects introduced during the growth of the nanoparticles. 66fter the decoration of ETS-10 with 5 wt.Cu 2 O nanoparticles (pink diamond), the most pronounced effect is the displacement of ETS-10 first peak located at 350 to 371 nm.The ETS-10/Cu 2 O interaction and disturbance can be the origin of the 21 nm peak displacement to higher wavenumbers, indicating the effect caused by the charge relocation of Cu 2 O nanoparticles in the (O -Ti 3 O 2-Ti 4 ) network of ETS-10.A similar phenomenon was observed by Lin et al. 66 where Eu 3 ETS-10 doped was analyzed by PL technique.The results showed that the insertion of rare earth on ETS-10 decreased the electron-hole recombination occurring in the ETS-10 matrix, contributing to an increase of the probability of energy transfer from ETS-10 to the Eu 3 ions. A difference on profile was observed between 400-470 nm after their incorporation of Cu 2 O into the ETS-10 support, and this modification is related to charge transfer from Cu 2 O conduction band to the valence band of Ti-O-Ti in ETS-10, that is, electron and hole were separated in different materials.Between 370-450 nm, bands already observed in pure Cu 2 O nanoparticles are still present.After 470 nm, the spectrum shows the positions of peaks are similar to those presented in isolated Cu 2 O nanoparticles, indicating that in this region the emission is less influenced by the Ti-O-Ti present in ETS-10 framework. Pure CuO nanoparticles spectrum (orange circle) exhibits four principal emission peaks: in 336 nm as a result of the electron-hole recombination; 398 and 490 nm were associated with the presence of oxygen vacancies; 437 nm is related to the blue region emission and the last important peak in 468 nm is associated with near band edge emission of CuO. 67,68nother spectrum profile was observed in the ETS-10/ CuO sample (green down triangle).This solid presented a PL spectrum which is very different from that of the pure ETS-10: there is a displacement of the ETS-10 band from 350 to 360 nm, probably due to the fact that the band gap of the nanocomposite is smaller than pure ETS-10 (corresponding to a band displacement of 10 nm). 66,69The bands observed at 398 and 490 nm are originally from CuO. 70 The peaks displacements and the increased intensity of the PL spectra of ETS-10/CuO in the 380-500 nm, in relation to the isolated semiconductors, indicate that there is an effective interaction between the species in the nanocomposite and that these promote an increased emission in the visible region.The modifications observed here are in agreement with Raman spectroscopy already discussed. The results of surface area analysis are presented in Table 1.Titanosilicate ETS-10 exhibits a total surface area of 252 m 2 g -1 , 71,72 which allows a good dispersion of nanoparticles.The surface area of Cu 2 O and CuO nanoparticles are in agreement with the particles size observed by HRTEM technique (second column).Scanning electron micrographs of as-synthesized titanosilicate ETS-10 samples are shown in Figure 5a.The particles crystallized as sharp twinned cuboids with ca.7 m of diameter.Figure 5b shows the titanosilicate ETS-10 decorated with Cu 2 O particles, which are adhered in all surface of the particles.The same morphology was observed for ETS-10 decorated with Cu 2 O nanoparticles (Figure 5c). In order to confirm the size of Cu 2 O and CuO nanoparticles, high resolution images (HRTEM) were obtained.In Figure S3a (SI section), an agglomerate of Cu 2 O nanoparticles with average size of 50 nm was observed.These values were different from the ones estimated for crystals by Scherrer equation (28.3 nm) because of the presence of agglomerates.In Figure S3b (SI section), the CuO nanoparticles presented a better dispersion when compared to Cu 2 O nanoparticles with average size of 20 nm, confirming the size estimated by Scherrer equation (19.3 nm). At the end of the photocatalytic experiments, the liquid phase was analyzed, and the following products were detected: formaldehyde, acetic acid and methanol.The gaseous phase was analyzed during the experiments and only O 2 was detected; no CO or CH 4 were observed, as shown in Figure S7 (SI section).The formation of formaldehyde and acetic acid were detected, but not quantified due to the difficulty of simultaneous quantification, as shown in Figures S2 andS8 (SI section).This fact can be explained by the process of the preparation of samples, as demonstrated in Photocatalytic reactions sub-section. Figure 6 shows the production of methanol after 20 h, where its values were expressed by total mol of product per mol of photocatalyst (TiO 2 , CuO or Cu 2 O) present in the ETS-10, to directly compare the activity of the pure nanoparticles and that of the metal sites in the nanocomposite.The total CO 2 conversion () into methanol for each catalyst is presented in Table 2. Contrarily to the most studied oxides like TiO 2 and SrTiO 3 , pristine titanosilicate ETS-10 showed good photoactivity response in the UV region of 1.22 mol product mol catalyst -1 h -1 of CH 3 OH, as shown in Table 2.This result was attributed to suitable energy levels provided by the dispersion of wires Ti-O-Ti in ETS-10 structure compared to TiO 2 , coupled with good adsorption and stabilization of CO 2 and H 2 O on the surface.The capacity of CO 2 and H 2 O molecules to absorb onto the ETS-10 surface was shown by Howe and co-workers 73 in catalytic oxidation reactions. Methanol formation using the composite ETS-10/Cu 2 O showed a catalytic active value of 5.97 mol product mol catalyst -1 h -1 , or ca. 5 times more efficient than pure ETS-10 and 3.8 times more efficient than pure Cu 2 O nanoparticles, 1.56 mol product mol catalyst -1 h -1 .We propose that the new interface between ETS and Cu x O nanoparticles is more photoactive for CO 2 photoconversion than the pure counterparts.The synergy found between the TiO 2 wires present on framework and the Cu x O nanoparticles on the surface has account for the overall gain in CO 2 photoconversion.For example, the position of the energy levels of ETS and Cu x O nanoparticles favors an electron transfer from ETS to Cu x O and further reduction of CO 2 /CH 3 OH pair (Figure 7).CO 2 photorreduction is expected to occur at this surface, but we cannot neglect the direct reduction by the ETS itself.Several authors have reported the positive effect of copper as electron trap in interfaces with metal oxides, decreasing electron-hole recombination. 46,56,76,77In our study, the formation of Cu (0) species upon visible light irradiation in Cu 2 O nanoparticles may explain why the yield for methanol production was even higher using this oxide.Cu (0) species are well-known catalyst to reduce organic compounds such as nitric compounds 78,79 or CO 2 . 16,78,8081182 Water oxidation to form dioxygen is expected to occur through the whole nanocomposite due to the same energy of the valence band (shown in Figure 7).It is also important to point out the importance of the nanoparticles dispersion on the surface of ETS-10 as the Cu x O nanoparticles alone could not achieved the same photoconversion efficiency. Electrochemical studies were carried out to confirm the photoconversion efficiency of the nanocomposites prepared in this work.The materials were analyzed by cyclic voltammetry, chronoamperometry and photocurrent measurements (Figures 8 and9).The solid lines are the The cyclic voltammogram (Figure 8) of ETS-10 shows a small and similar response during the measurements in the dark and under illumination.These performances were associated to the -O-Ti-O- species present in both materials.After the incorporation of Cu 2 O and CuO nanoparticles, it was observed an increase in the current.These results were attributed to the increase of charge transfer between the ETS-10 and the nanoparticles.ETS-10/Cu 2 O shows a better response under light than ETS-10/CuO, corroborating with the photocatalytic results. Chronoamperometry measurements (Figure 9a) were performed to evaluate the stability in aqueous media under illumination.As expected, ETS-10/CuO is more stable after light soaking, but ETS-10/Cu 2 O showed a better initial response, with a decay and further stabilization after 1500 s of irradiation.Analogous behaviors were observed in photocurrent experiment (Figure 9b).All samples exhibited an anodic photocurrent, indicating that these nanocomposites behave as n type semiconductors, as expected due to the presence of ETS-10."
  },
  {
    "title": "Conclusions",
    "content": "In this study, various ETS-10-based materials were used for CO 2 photoreduction in the presence of water under visible light irradiation.After 20 h of reaction, oxygen, acetic acid, formaldehyde and methanol were detected.The combination of ETS-10 and Cu 2 O/CuO nanoparticles created a new interface for charge generation and separation.The good dispersion of the Cu x O nanoparticles onto ETS-10 surface is responsible for the high yield of CO 2 conversion in comparison to the nanoparticles alone.The good alignment between the energy levels may promote an efficient electron transfer from Ti-O-Ti on ETS-10 and Cu x O nanoparticles, where the CO 2 photoreduction is expected to occur.Copper species are well-known good electron trapping sites, minimizing charge recombination.Besides, the formation of Cu (0) species upon radiation in Cu 2 O may explain the higher photoconversion values and the best photocurrent values.These results show that the materials are effective in converting CO 2 water into solar fuels using only solar irradiation. 2h (BV) 12O 2 2H (1) CO 2 2H 2e -(BC) HCOOH (2) HCOOH 2H 2e -(BC) HCHO H 2 O (3) HCHO 2H 2e -(BC) CH 3 OH (4) CH 3 OH 2H 2e -(BC) CH 4 H 2 O(5) Figure 1.Powder XRD patterns of (a) titanosilicate ETS-10; (b) cubic Cu 2 O nanoparticles and (c) monoclinic CuO nanoparticles; (d) titanosilicate ETS-10 decorated with Cu 2 O (5 wt.). Figure 2. Normalized UV-Vis spectra of ETS-10 (black left triangle), Cu 2 O nanoparticles (blue up triangle), CuO nanoparticles (orange circle), ETS-10/CuO (green down triangle) and ETS-10/Cu 2 O (pink diamond).BaSO 4 was used as a blank (cyan square). Figure 3. Raman spectra of titanosilicate ETS-10 (square), ETS-10/Cu 2 O (circle) and ETS-10/CuO (triangle) obtained using laser at 514 nm.All the spectra were normalized to the maximum intensity. Figure 4. Photoluminescence emission spectra at room conditions of the photocatalysts: ETS-10 (black left triangle), Cu 2 O nanoparticles (blue up triangle), CuO nanoparticles (orange circle), ETS-10/CuO (green down triangle) and ETS-10/Cu 2 O (pink diamond).The slit open size was 2 mm with filter and exc 290 nm. Figure 5. Scanning electron micrographs of (a) titanosilicate ETS-10; (b) titanosilicate ETS-10 decorated with Cu 2 O nanoparticles and (c) titanosilicate ETS-10 decorated with CuO nanoparticles. of catalyst, 0.3 mL of H 2 O, 2 bar of CO 2 , 20 h of irradiation; b calculated by n mol of photoactive material present on catalyst expressed in (TOF (turnover frequency) in mol product mol catalyst -1 h -1 ), an example is shown in the SI section.It is important to emphasize that we can be comparing just the based material, in order to exclude possible confusion; c percentage of CO 2 consumed during CH 3 OH production. Figure 6.Conversion rate of CO 2 into CH 3 OH relating methanol production and active catalyst present in the reaction vessel.Conditions: 2 bar CO 2 , 300 L of H 2 O, 50 mg of material, under solar irradiation (100 mW cm 2 ) for 20 h at 333 K. Figure 7. Band energy diagram of titanosilicate ETS-10, Cu 2 O and CuO nanoparticles in vacuum level.Black line corresponds to the potential for reduction of CO 2 to CH 3 OH (adapted from references 42, 74 and 75). Figure 8. Cyclic voltammograms of materials in the form of a film deposited on FTO conducting substrates.Conditions: visible light irradiation in aqueous solution containing 0.35 mol L -1 Na 2 SO 3 0.25 mol L -1 Na 2 S, final pH 13. Figure 9. (a) Chronoamperometry measurements under visible light irradiation without potential application during 3600 s; (b) photocurrent measurement carried out at short circuit conditions.Both experiments were carried out in aqueous solution within 0.35 mol L -1 Na 2 SO 3 0.25 mol L -1 Na 2 S (pH 13). 5-15.5, Merck; sodium silicate (Na 2 SiO 3 ) 29.15 SiO 2 , Aldrich; sodium hydroxide (NaOH) 99, Synth; copper acetate (Cu(CH 3 COO) 2 ), ACS 98, Aldrich; ascorbic acid (C 6 H 8 O 6 ), 99, Aldrich; potassium hydroxide (KOH), 99.9, Merck; potassium fluoride (KF) 99, Merck; isopropyl alcohol (C 3 H 8 O), 99, Synth, were used as received without further modification. Textural properties of titanosilicate ETS-10, Cu 2 O and CuO nanoparticles Values of conversion of CO 2 and H 2 O into methanol Vol. 29, No. 7, 2018 The Fundacao de Amparo a Pesquisa no Estado de Sao Paulo is acknowledged for the financial support (FAPESP 2012/08904-3).The authors are grateful to the National Center for Energy and Materials Research (CNPEM) for the use of the high-resolution transmission electron microscopy (HRTEM) facilities at LNNano (Project No. 18412 and 20109). Supplementary data (design of photocatalytic reactor, analytical curves of methanol, HRTEM images, band gap estimations, gas phase analysis and mechanism of products produces) are available free of charge at http://jbcs.sbq.org.br as PDF file."
  }
]