[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2015.12.037"
  },
  {
    "title": "Article_Title",
    "content": "Zn-Cu promoted TiO2 photocatalyst for CO2 reduction with H2O under UV light"
  },
  {
    "title": "Abstract",
    "content": "Highlights TPD-CO2 results for TiO2 samples have recorded different strengths of CO2 adsorption Cu 1 and Cu 2 species coexist in CT and CZT photocatalysts CH4 production achieved the range of 126-184mol/g after 24 hour-irradiation period CH4 formation has increased in the following order: TiO2 (P-25"
  },
  {
    "title": "Experimental",
    "content": "TiO2 was prepared by slow hydrolysis of titanium isopropoxide -Ti(OCH(CH3)2)4 (97, SIGMA-ALDRICH).Due to the reagent instability, the reaction was carried out in inert atmosphere, using a plastic chamber previously filled with N2.The precipitate obtained was filtered and washed, dried in an oven at 120C overnight and submitted to calcination at 550C for 6h using airflow (30 mL/min) 29.TiO2 resulting from this procedure was used in the preparation of the other photocatalysts.2CuO/TiO2 catalyst (CT) was prepared by the impregnation method employing Cu(NO3)2.3H2O(99.5, MERCK) to give the copper oxide.After impregnation, the material was dried in an oven at 120C for 24h, and then, it underwent calcination at 500C for 3 hours in the presence of air flow (30 mL/min).2CuO-19ZnO/TiO2 (CZT) was prepared by co-precipitation deposition method 30, using Cu(NO3)2.3H2O(99.5, MERCK), Zn(NO3)2.6H2O(98, VETEC) as precursor salts and a solution of 1M Na2CO3 (99.5, VETEC) as precipitation agent. The nominal content of copper and zinc oxides was 2 and 20 (wt/wt), respectively.After co-precipitation, the material was filtered, washed and dried in an oven at 120C for 24h and then subjected to calcination at 500C for 3 h in air flow (30 mL/min). One of the most employed photocatalysts in related researches is the TiO2 based photocatalyst (P-25) manufactured by Degussa, which has about 80 anatase crystalline phase and 20 rutile in its structure 7.Thus, that material was used as reference for comparison with TiO2 prepared in this study. Specific surface area (BET method), pore volume and average pore size (BJH method) of the samples were measured by N2 adsorption analysis at -196oC, using ASAP 2010 Micromeritics equipment.First, the samples were pretreated under vacuum at 300oC for 12 hours.After cooling, the volumetric method was used to proceed obtaining the isotherms. The X-ray fluorescence (XRF) analysis was carried out in a RIX-3100 RIGAKU instrument, using Rh source, 50 kV and 80 mA.CT and CZT photocatalysts were analyzed in order to compare the oxide actual content to its nominal, and thus, detect possible impurities from the preparation methods. A Miniflex TG RIGAKU instrument (Cu K 1.54178A, 30 kV and 15 mA) was used for X-ray diffraction analysis.The step-scans were taken over the range of 2 from 10 to 90 in steps of 0.05, and the intensity data for each step was collected for 1s.By analyzing the X-ray diffraction patterns, it was possible to identify the crystalline phases present in the material and the Fullproof software was used to quantify them.Sample morphology was studied by a scanning electron microscope with field emission gun (FEG-SEM) (FEI Company, model QUANTA 400).In addition, elemental mappings were detected by an energy dispersive X-ray spectrometer (EDS) attached to the SEM. The X-ray photoelectron spectra were obtained using Al K radiation with a Thermo Scientific (ESCALAB 250Xi), using C (1s) as energy reference (284.6 eV). UV-vis diffuse reflectance spectroscopy enabled the study of the UV absorption profile of the photocatalysts and the calculation of their energy bandgap.The spectra were obtained by a Cary 5 UV-vis-NIR (VARIAN) spectrometer, using BaSO4 as reference. The reflectance spectra of the samples were analyzed under ambient conditions in the wavelength range of 200 to 800 nm.Reflectance was converted to F(R) values using the Kubelka-Munk function Eq. (1): in which R is the absolute reflectance, k is the molar absorption coefficient and s is the scattering coefficient.The bandgaps were obtained from the plot of F(R) h 1/2 against the photon energy (E). For the purpose of verifying the behavior of the photocatalysts in the presence of CO2, all materials were analyzed by temperature programmed CO2 desorption (TPD-CO2). This technique enables to analyze the amount and types of sites that are present in the materials.To this end a multipurpose unit equipped with an on-line quadrupole mass detector QUADSTAR 422 (QMS 200,BALZERS) was used.First, the sample (100 mg) was placed into a quartz tube reactor, which was heated under ultra-high purity helium flow (60 mL/min) up to 200C at 10C/min for 1h and then it was cooled to room temperature.After pretreatment, CO2 flow (30 mL/min) passed through the catalyst bed for 30 min, subsequently the sample was flushed by He flow (60 mL/min) for 60 min. Then, the TPD analysis was performed under He flow (60 mL/min) by heating the sample at a rate of 20C/min up to 1000C.The effluent gases were monitored by online mass detector (m/e 2, 4, 28, 30, 32, 44 and 46). Photocatalytic reduction of CO2 with H2O was conducted in liquid phase at a constant temperature of 25C and atmospheric pressure.The photocatalyst previously dried at 120C (concentration of 1g/L) was suspended in 600 mL of 0.2M NaOH.The alkaline solution was used for two reasons: to raise CO2 solubility in the aqueous medium and to enhance the formation of OH radicals 28.Figure 1 Samples of the gaseous and liquid phases were taken regularly throughout the 28hprocess in order to monitor the reaction.Aliquots of 1 mL of the suspension were analyzed using a gas chromatograph (CP-3380, Varian), equipped with thermal conductivity and flame ionization detectors, employing a Poraplot-Q column.The gas samples were analyzed on a gas chromatograph (CP-3800, Varian) equipped with a methanetor, thermal conductivity and flame ionization detectors, using Molsieve 5A and Porabond columns. Blank tests both, without UV irradiation and in the absence of CO2 reagent were performed to certify that all products were generated from the photocatalytic reduction of CO2 with H2O. Quantum yield of the CO2 photoconversion (24h reaction) can be calculated by equations 2 and 3. Two and eight electrons are required to convert CO2 to CO and CH4, respectively 27. The number of moles of photons absorbed by photocatalyst (MPAP) during 24 hours was calculated by Equation 4and was approximately 125.5mmol."
  },
  {
    "title": "Results_and_Discussion",
    "content": "XRD pattern of photocatalysts in Figure 2 shows the anatase and brookite phases of TiO2 with peaks of greater intensity in 2 25.28 and 2 25.34,respectively.As those peaks overlap, brookite phase identification was made by the second highest peak intensity at 2 30.81.The quantification of crystalline phases was estimated as 79 of anatase and 21 of brookite phases. Regarding CT photocatalyst, no characteristic peak of either copper oxide (2 35.5and 36.4o for CuO and Cu2O, respectively) or metallic copper (2 43.3o)was detected. This result is in agreement with a previous report on Cu content below 5 8.As well as the anatase and brookite phases, characteristic peaks corresponding to zincite phase (ZnO, 2 31.77,36.25,56.60o, 67.96o) were also identified on CZT patterns. In order to investigate the role of the impregnation of CuO in the structure of the starting material, the surface morphologies of those samples were analyzed by scanning electron microscopy (FEG-SEM) with energy dispersive X-rays detector (EDS).Figure The chemical composition from XRF and the basic textural characterizations of the samples are summarized in Table 1, as well as the phases identified by XRD.The specific surface area (SBET) of TiO2 was 52 m 2 /gcat, which is consistent with the values (50-80 m 2 /gcat) found in previous reports 15,31,32.The SBET value of CT, 36 m 2 /gcat, presented a decrease in relation to TiO2, also consistent with the literature 33.In relation to CZT sample, it is important to point out that the co-precipitation method used in that preparation has probably prevented a major decrease 34 on the specific surface area value found of 43 m 2 /gcat.eV, respectively, 39. DRS patterns of the photocatalysts are presented in Figure 7. TiO2 spectrum shows an absorption band with maximum around 350 nm associated to the process of charge transferring, O 2-(2p) Ti 4 (3d) 9. The surface modification of TiO2 using CuO and ZnO affected the absorption properties of the catalysts.When CuO was added, the TiO2 photocatalyst absorbed the energy in the visible range around 380 to 500 nm.According to the literature 40, the band at 210 to 270 nm is attributed to the ligand-to-metal charge transfer transition of O 2-(2p) Cu 2 (3d), occurring in isolated Cu 2 sites.Additionally, the presence of (Cu-O-Cu) 2 clusters highly dispersed is indicated by the band at 350 nm.In relation to ZnO, the energy absorption spectrum presents a wavelength absorption maximum near to 400 nm similar to TiO2 41.CZT photocatalyst spectrum presented a wider band than the spectra of the other photocatalysts, suggesting higher photocatalytic activity. TiO2 prepared in this study has shown similar bandgap energy to commercial TiO2 (P-25).However, the addition of copper and zinc oxides to TiO2 has provided a decrease in its original value.CT photocatalyst presented a bandgap of 2.95 eV which is corroborated by literature 15.The bandgap change indicates that the insertion of copper oxide modified the material, causing a redistribution of its electrical charge. Copper acts as a hole scavenger resulting in a longer separation between the electronhole pairs generated by increasing material photoefficiency.Slamet et al. (2005) 15 observed that the bandgap value is inversely proportional to CuO content in the photocatalyst.They achieved values of about 3.05 and 2.88 eV for 0.5CuO/TiO2 and 3.0CuO/TiO2, respectively.As it was expected, ZnO did not promote a decrease of the bandgap energy for CZT photocatalyst since its bandgap value is similar to that of TiO2 42.The bandgap values shown in Table 2 were estimated by extrapolation of the linear part of the DRS spectrum in Figure 8 31. TPD-CO2 profiles obtained for all photocatalysts are presented in Figure 9.The desorbed CO2 amount was determined by the measurements/integration of signal m/e 44 area and corrected by the gas sensitivity factor obtained by injection pulses of a known amount of gas.The amount of CO2 desorbed (qmax CO2) by photocatalysts are presented in Table 2. The profiles of TiO2 and TiO2 (P-25) show CO2 desorption at low temperature, with Tmax equal to 111C and 115oC, respectively, indicating low interaction between CO2 and the photocatalyst.However, this interaction is probably higher for TiO2P-25 due to the desorption range between 300C and 600C.CT and CZT profiles show a modification of CO2 adsorption sites.They present higher desorption peak at temperatures 123, 288, 534C and 135, 408, 462, 622 and 710C, respectively.CZT has chemisorbed a more expressive amount of CO2 than the other materials, indicating an increase in the photocatalyst affinity.Nevertheless, the alkalinity due to ZnO addition has also contributed to the increase of CO2 adsorption capacity 43. On the basis of our experimental results, some considerations should be pointed out. (TiO2 P-25, Degussa).This result enables an assessment of the brookite phase photoactivity in the studied reaction.CuO and ZnO are dispersed on the surface of their respective photocatalysts.These oxides could play a role in the inhibition of the deactivation by recombination of hole-electron pairs.Bandgap values suggest that CZT photocatalyst will present enhanced photocatalytic activity.The samples have exhibited different affinities of CO2-photocatalyst which could be assessed in the photocatalytic reduction of CO2 with water.The characterization results suggest that CZT photocatalyst can present a better photocatalytic activity compared to that of TiO2 and CT due to higher probability of obtaining the radical CO2. All blank tests presented no products or precipitate in aqueous medium.The analysis of gas samples indicated the formation of CH4 and CO as the only products of CO2 photoreduction reaction.Liquid phase analysis showed no products. Increasing formation of CH4 was observed during the 28 hours of continuous irradiation as shown in Figure 10.CO presented a different behavior reaching maximum concentration after around 6 hours of test which gradually decreased afterwards.This behavior may be a strong indication that CO is an intermediate of CH4 formation in CO2 photocatalytic reduction, as suggested by several researchers 7,31. CH4 formation increased during the tests with all the photocatalysts, in the following order: TiO2 (P-25) TiO2 CT CZT, and total CH4 production in 24 hours was 126, 128, 153 and 184 mol/gcat, respectively.The highest CH4 formation exhibited by CZT photocatalyst confirms the prediction by DRS UV-vis results that this sample should show the best photoactivity. CH4 formation for both TiO2, prepared and commercial (P-25, Degussa), was nearly the same, meaning similar photocatalytic activity.This is a great result, taking into account that the composition (anatase and rutile) of commercial TiO2 (P-25) is considered a reference in photoreactions.It is noteworthy that TiO2 photocatalyst prepared by slow hydrolysis of titanium isopropyl oxide resulted in a material containing 79 anatase phase and 21 brookite phase.While several researchers have investigated the photocatalytic ability of anatase-rutile, only few studies have employed brookite phase 44.Due to the lack of studies up to this moment, the brookite phase has always been considered a less photoactive crystalline structure 45.The results shown in the present study have evidenced that deeper investigations should be conducted on brookite photoactivity and also on the combination of anatase and brookite phases. Table 3 shows the results for CH4 and CH3OH formation obtained in the literature.It is important to point out that those values were obtained employing different methodologies, including the analysis of the reaction mediumgas or liquid.According to Tseng et al. ( 2002) 28, product formation in the photocatalytic reduction of CO2 can be substantially modified by the reaction conditions, such as: UV intensity, UV wavelength, additives of reaction media and reactor configuration.Our results of the analysis of the liquid phase, show no formation of CH3OH, which can be explained by the presence of both cations, Cu 1 and Cu 2 , in the surface of the photocatalysts CT and CZT, as showed by XPS results.Many studies have discussed the role of these cations in the production of CH3OH in this reaction 10,27.Slamet et al. (2005) 15 studied the influence of Cu 0 , Cu 1 and Cu 2 in CH3OH formation.Those authors noted that CuO is the most active dopant when compared with the other species, but they did not verify the coexistence of more than one promoter in the photocatalysts.Therefore, the presence of Cu 1 and Cu 2 species in CT and CZT photocatalysts could not have favored the formation of CH3OH. In relation to TPD-CO2 analysis, it could also be asserted that CO2 affinity for the photocatalyst is a highly influential factor in the studied reaction.Some variables of photocatalysis have already been investigated such as: intensity and maximum spectral wavelengths of the UV source 21,31,50,51; however, CO2-photocatalyst interaction has not been pointed out yet as an important variable in the CO2 photocatalytic reduction with H2O.Liu et al. 2012 52, using in situ diffuse reflectance infrared Fourier transform spectroscopy have demonstrated that CO2-species are spontaneously dissociated into CO even in the dark on partially oxygen depleted Cu(I)/TiO nanoparticles.They confirmed that the CO produced was derived from CO2.Moreover, the surface Cu species may facilitate destabilizing adsorbed CO2-and enhance its subsequent dissociation into CO. The use of NaOH solution enabled a major CO2 concentration in aqueous medium. Species such as HCO3 -and CO3 2-were involved in this type of reaction and the equilibrium is represented in Equations ( 6) and ( 7) 53: It is interesting to point out that all products obtained in the photoreduction of CO2 were derived from CO2 -radical and not from CO3 54, the precipitation of those species occurs at higher NaOH concentrations, above 4-5 (w/w).In order to evaluate the efficiency in absorbing photons and generating products, the quantum yields were calculated for all the photocatalysts and are shown in Table 4. Quantum yield calculation involves variables such as external area of the photoreactor, irradiation time and amount of photons absorbed by the photocatalyst.The variables involved had the same value for all the photocatalysts.Only the amount of absorbed photons, the amount of obtained product and the number of electrons had modifications. The amount of absorbed photons did not show great variation between the photocatalysts.This does not directly indicate that one photocatalyst will be less or more efficient than another, because the ability to absorb photons is not related to the ability to keep the electron-hole pair photoactive.Therefore, the quantum yield results presented the variation related to the amount of product. Values between 0.48-0.70were obtained for CH4 formation and are consistent with the literature 28,55.Li et al. (2010) 27 found 0.85 and 0.56 for CO and CH4, respectively; and total quantum yield was 1.41.As can be seen, CT and CZT grew 20 and 44, respectively, in the quantum yield for CH4 in comparison with TiO2 and TiO2 (P-25).CT and CZT photocatalysts showed similar total quantum yield.However, CZT was more efficient for the production of CH4.Despite the fact that TiO2 (P-25) showed the highest T, this result was mainly due to the highest efficiency on CO formation. This means that the commercial photocatalyst presented lower performance if compared to the prepared photocatalysts in the conversion of CO to CH4."
  },
  {
    "title": "Conclusions",
    "content": "The physicochemical characterization has shown that copper oxide is found dispersed on TiO2 independent of the preparation method, co-precipitation or impregnation.Coprecipitation deposition caused the formation of filamentous structures on CZT surface, in which the zincite phase (ZnO) has been identified.Addition of copper and zinc oxides to TiO2 has promoted a decrease in specific area if compared to pure TiO2.DRS UV-vis spectra have indicated that CZT photocatalyst increases the photocatalytic activity if compared to the other materials.The TPD-CO2 results revealed that both CT and CZT samples have CO2 stronger interaction than that evidenced on pure TiO2. Besides, the amount of CO2 chemisorbed/desorbed on CZT was higher, indicating a higher number of interaction sites. schematically illustrates the reaction unit.The batch quartz reactor had an internal volume of 1,180 mL (outer surface area of the reactor 816.6 cm 2 ) and was illuminated by Hg vapor UVC lamp, low pressure (Puritec 18W -254 nm, OSRAM) located in the center of the reactor.The gas inlet was made by a tube that went from the top to the bottom of the reactor.CO2 with high purity (99.99,LINDE) was used to avoid hydrocarbon contamination.Before turning on the lamp, CO2 was bubbled at constant flow (100 mL/min) through the suspension during 40 minutes to clean the environment and saturate the solution.To avoid photocatalyst sedimentation, a magnetic stirrer was employed.A cooling bath (Proline PR 854, LAUDA) was used to maintain a constant temperature in the reaction medium.Temperature and pH were continuously monitored and measured by Schott pH meter (ProLab 2000, SCHOTT).The flux of the absorbed photons was measured by International Light Technologies radiometer (ILT1700) and calculated according to Tseng et al. (2002) 28. Figures4 and 5show the surface analysis from EDS on CT and CZT samples, respectively.Those analyses confirm the XRD results, indicating that CuO is well dispersed on TiO2 surface in both photocatalysts.Regarding ZnO, EDS indicates a homogeneous dispersion all over the study area.The formation of crystals modified the surface but did not cause a total covering of TiO2. photocatalysts was responsible for the lack of CH3OH production.Similar amounts of CH4 produced using prepared TiO2 and commercial TiO2 (P-25, Degussa) suggest that the crystalline brookite phase has good activity in photocatalysis.Finally, the high photoactivity presented by Cu-Zn based photocatalysts in relation to reference P-25 (Degussa) is a guarantee that these materials are efficient photocatalysts with potential use in the photoreduction of CO2 with H2O. Figure 1.Experimental setup of the photocatalytic unit. Figure 2. XRD patterns of the photocatalysts. Figure 3. SEM microphotographs of photocatalysts (a) TiO2, (b) CT, (c) CZT. Figure 4. SEM image and elemental mapping of CT. Figure 5. SEM image and elemental mapping of CZT. Figure 6.XPS spectra of Cu 2p of CT and CZT photocatalysts. Figure 7. DRS patterns of UV-vis photocatalysts. Figure 8. Determination of bandgap from DRS spectra. Figure 9. TPD-CO2 profiles for TiO2 based photocatalysts. Figure 10.Time dependence of product formation -CH4 and CO. 37,38Cu 2p3/2 and Cu 2p1/2 spin orbital splitting photoelectrons at binding energies of 932.8 and 952.8 eV, respectively were assigned to the compound Cu2O36.However, the major characteristic of Cu 2 is the presence of the shake-up peak at 941.8 eV37,38.Therefore, XPS analyses of Cu 2p indicate that Cu 2 and Cu species coexist in both samples.The quantitative analyses showed that CT sample 2-and HCO3 -.No precipitation of Na2CO3 or NaHCO3 was observed in all the tests, including the blank tests.According to Yoo et al. (2013) Chemical composition (XRF), structural (XRD) and textural characterization of a Estimated from XRF b Estimated from XRD.A anatase; B brookite; R rutile; Z zincite CO2 adsorption capacities and bandgap energies for the photocatalysts. Comparison of products obtained after 24h of photoreaction. A anatase; R rutile; B brookite; NT nanotube, NP nanoparticle. Quantum yields of CH4 and CO production after 24 hour-irradiation. The authors would like to thank The National Council for Scientific and Technological Development (CNPq) for financial support.The authors also thank M.Sc.Carlos Andre C. Perez (NUCAT), Dr. Fabio Barboza Passos and M.Sc.Hugo A. Oliveira (RECAT/ Universidade Federal Fluminense) for XPS analyses."
  }
]