[
  {
    "title": "Doi",
    "content": "10.1039/d0ra08246e"
  },
  {
    "title": "Article_Title",
    "content": "Synthesis of SrTiO<sub>3</sub> submicron cubes with simultaneous and competitive photocatalytic activity for H<sub>2</sub>O splitting and CO<sub>2</sub> reduction"
  },
  {
    "title": "Abstract",
    "content": "Single crystalline strontium titanate (SrTiO 3 ) submicron cubes have been synthesized based on a molten salt method.The submicron cubes showed superior photocatalytic activity towards both water splitting and carbon dioxide reduction, in which methane (CH 4 ) and hydrogen (H 2 ) were simultaneously produced.The average production rate of methane up to 8 h is 4.39 mmol g A1 h A1 but drops to 0.46 mmol g A1 h A1 .However, the average production rate of hydrogen is 14.52 before 8 h but then increases to 120.23 mmol g A1 h A1 after 8 h.The rate change of the two processes confirms the competition between the H 2 O splitting and CO 2 reduction reactions.Band structure and surface characteristics of the SrTiO 3 submicron cubes were characterized by diffuse reflective UV-Vis spectroscopy, Mott-Schottky analysis, X-ray photoelectron spectroscopy (XPS) and Fourier transform infrared spectroscopy (FTIR).The results reveal that the simultaneous and competitive production of methane and hydrogen is due to a thermodynamics factor, as well as the competition between the adsorption of carbon dioxide and water molecules on the surface of the faceted SrTiO 3 .This work demonstrates that SrTiO 3 photocatalysts are efficient in producing sustainable fuels via water splitting and carbon dioxide reduction reactions."
  },
  {
    "title": "Experimental",
    "content": "SrCO 3 (AR, 99.8), H 2 PtCl 6 6H 2 O (AR, Pt 37.5), triethanolamine and ethanol (AR, 99.5) were purchased from Sinopharm Chemical Reagent Company.P25 TiO 2 (AR, 99.8), NaCl (AR, 99.5) and KCl (AR, 99.5) were purchased from Aladdin Reagent Company.All chemicals were used as received without any further purication. SrTiO 3 submicron cubes were prepared by the molten salt synthesis method as reported previously. 37In the typical synthesis of SrTiO 3 submicron cubes, SrCO 3 , TiO 2 , NaCl and KCl were mixed in an overall stoichiometric ratio of 1 : 1: 50 : 50.Then the mixture was put into the mortar and grinded thoroughly for 30 min.Next, the mixture was put into an alumina crucible and then heated to 700 C at a rate of 5 C min A1 in a muffle furnace and maintained at this temperature for 5 h.Aer cooling down to room temperature, the sample was washed with deionized water (18.25 MU cm) several times to remove NaCl and KCl.Then washed with diluted hydrochloric acid (0.05 M) to remove unreacted impurity of SrCO 3 .Finally, dried in an oven at 60 C for 12 h. Pt nanoparticles loaded SrTiO 3 submicron cubes were prepared in a traditional method of photodeposition. 38In a typical experiment, 100 mg as-prepared SrTiO 3 submicron cubes sample was dispersed in 100 mL of deionized water containing 20 mL of triethanolamine (TEOA) by sonication for 10 min.The prepared solution H 2 PtCl 6 (20 mmol L A1 ) were added into the above dispersion solution with the mass ratio of Pt/SrTiO 3 3.The solution was then sealed and evacuated with a vacuum pump to remove oxygen from the solution and stirred in dark for SrTiO 3 submicron cubes fully adsorbing metal ions.Aer 30 min, the solution was irradiated from the top by a 300 W Xe lamp (PLS-SXE 300, Beijing Trusttech Co. Ltd, China) with simulated sunlight for 4 h.The sample was collected by centrifugation and washed with deionized water and ethanol.Then, dried in a vacuum drying oven oven at 60 C for 12 h.The as-obtained samples were marked as STO-Pt. The X-ray diffraction (XRD, 2q 14 3 min A1 , 2 h 14 10-90 , D/ MAX2500V, Rigaku Corporation, Japan) analyses were performed to characterize the crystal structure.The microstructure of the SrTiO 3 nanocrystal was investigated by scanning electron microscopy (SEM, SU8020, HITACHI, Ltd., Japan).The valence states of the elements in the SrTiO 3 nanocrystals were analyzed using an ESCALAB250 spectrometer equipped with an Al Ka (1486.6 eV) radiation source.Transmission electron microscopy (TEM) analysis with selected-area diffraction was carried out on a JEOL 2100F eld-emission transmission electron microscope operated at 200 kV.The UV-Vis absorption spectra were recorded on a UV-3600 UV-Vis-NIR scanning spectrophotometer (Shimadzu). 50 mg of photocatalyst STO-Pt was placed into an aqueous triethanolamine (TEOA) solution (100 mL, 10 vol) in a closed gas circulation system (Perfect Light Company Labsolar-III (AG)).The CO 2 (99.99) gas ow rate into the reactor was controlled at 10 mL min A1 for 45 min using a mass ow controller (D08-3F, Sevenstar, China).UV-Vis light and visible light irradiation were obtained from a 300 W Xe lamp (PLS-SXE 300, Beijing Trusttech Co. Ltd, China) with Simulated sunlight.The evolved gases were detected in situ using an online gas chromatograph (GC-7890B, Agilent) equipped with a thermal conductivity detector (TCD) and ame ionization detector (FID).In addition, a control experiment of water splitting was carried out under the same conditions but in the absence of carbon dioxide. SrTiO 3 thin lm photoelectrodes were prepared by electrophoretic deposition on the FTO substrate as reported previously. 39n a typical process, FTO glasses (3 cm A 1 cm A 0.22 cm) were ultrasonically cleaned sequentially with acetone, ethanol and water for 30 minutes each.Electrophoretic deposition was carried out in 70 mL acetone solution containing 30 mg iodine.The FTO electrode, with 1 cm 2 deposition area immersed into the solution, was parallel to the Pt electrode.The distance between two electrodes was 80 mm.A 40 V bias was applied for 3 min between two electrodes using a potentiostat (ITECH IT6834).The deposited SrTiO 3 electrodes were dried in the air at room temperature and subjected to calcination at 350 C for 30 min.Mott-Schottky experiments were carried out in a threeelectrode electrochemical setup in 0.5 mol L A1 Na 2 SO 4 electrolyte.The deposited SrTiO 3 electrode, the platinum electrode and silver/silver chloride electrode (Ag/AgCl) were used as a working, counter and reference electrode, respectively."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The crystallite structure of the as-prepared sample was characterized by X-ray diffraction.The morphology of the SrTiO 3 sample was observed by the scanning electron microscopy (SEM).Fig. 2(a) and (b) show that as-synthesized SrTiO 3 sample has a cubic shape.Fig. 2(c) and (d) shows the particle size distribution and high resolution TEM images of SrTiO 3 , respectively.TEM images reveal that the side average length of the cubes is about 79 nm, which have been shown in Fig. S2. The grain size calculated by the Scherrer's formula, D 14 Kg/B cos q, is 83 nm.These two values are very similar.So, it is proved that the prepared cubes have single crystal nature with a clear lattice fringe spacing of 0.28 nm in the direction of ( 110) and ( 110) and a lattice fringe spacing of 0.19 nm for (200) and (020).In addition, HRTEM characterization shown in Fig. 2(d) suggests the faceted shape of the cubic particle, which is enclosed with (200) planes at the edge and planes at the corner.The single crystal nature of SrTiO 3 cubes can be conrmed by the selected area electron diffraction (SAED) pattern as shown in Fig. 2(e).Furthermore, Fig. 2(f)-(h) show TEM and HRTEM images of the SrTiO 3 submicron cubes loaded with Pt nanoparticles of 2-4 nm in size. X-ray photoelectron spectroscopy (XPS) was used to characterize the elemental surface composition of the photocatalyst.All XPS spectra were tted using a Shirley-type background subtraction method.The background functions were tted using 80 Gaussian and 20 Lorentzian functions. 40Fig. 3(a) shows that titanium is present in the Ti 4 state in the SrTiO 3 sample, which is tted out using two peaks at 458.2 and 463.9 eV, corresponding to Ti 4 2p 3/2 and Ti 4 2p 1/2 , respectively.However, the XPS peaks of titanium in the Pt loaded SrTiO 3 sample are shied positively to 458.51 and 464.26 eV (Fig. 3(a)).This shows that part of the electrons on the Ti element are surface, which may be benecial for photocatalytic water splitting and photocatalytic reduction of carbon dioxide. 41,42The two peaks are also shied positively to 529.66 and 531.83 eV, respectively for Pt loaded sample.Notably, the signicant increase of the peak attributing to O 2A in the oxygen defects -OH indicate the more absorption site for H 2 O, which is conducive to the photocatalytic reaction.The peak at 530.48 eV corresponds to Pt-O.Fig. S3 shows the higher resolution XPS spectra of Pt.It can be seen that platinum has three valence states, which is tted using six peaks at 70.8 and 74.42 eV corresponding to Pt 0 , 71.34 and 75.98 eV corresponding to Pt 2 and 72.27 and 78.08 eV corresponding to Pt 4 , respectively.The appearance of high-valence Pt may be due to oxidation of part of Pt during photodeposition by the high activity holes.It conrmed that the Schottky junction is formed at the interface between SrTiO 3 and Pt nanoparticles. 43The Tauc plot of SrTiO 3 samples is shown in Fig. S4. The optical bandgap of SrTiO 3 is about 3.23 eV. Photocatalytic activity of the SrTiO 3 submicron cubes was investigated for CO 2 reduction and water splitting.Our experimental results indicate that the submicron cubes show superior activity for a simultaneous production of CH 4 and H 2 .Fig. 4 shows the production rate of CH 4 and H 2 over SrTiO 3 loaded with 3 wt Pt under UV-Vis light (300 W Xe lamp) using 20 vol triethanolamine (TEOA) as sacricial agent.From the plots, it can be seen that the SrTiO 3 submicron cubes exhibit superior activity towards both CO 2 reduction and water splitting.As known, crystal facets play a crucial role in photocatalysis due to their different surface energy.As discussed in the HRTEM and SAED characterization section (Fig. 2), the obtained SrTiO 3 submicron cubes are enclosed with (100) plane at the edge and (110) plane at the corner of the SrTiO 3 cubes.The SrTiO 3 (100) surface is the most thermodynamically stable facet, which can be terminated by a SrO or TiO 2 plane with a similar surface energy of 6.85 eV nm A2 . 4445546 For the (110) facet, there are two alternating layers of SrTiO 4 and O 2 , forming an unbalanced dipole with a high surface energy of 20.02 eV nm A2 . 46,47The terminal plane of the two facets is shown in Fig. S5. Directional separation of photogenerated electron-hole pairs is due to differences in surface energy, which is conducive to the separation of photogenerated carriers 484950 thereby enhancing the photocatalytic activity of the submicron cubes for the CO 2 reduction and water splitting. Quantitively analysis on the photocatalytic activity of the submicron cubes indicated that for the CO 2 reduction, the production of CH 4 increases rapidly with an average production rate of 4.39 mmol g A1 h A1 at the rst 8 h as shown in Fig. 4(b), then the CH 4 amount tends to reach a plateau with the average CH 4 production rate down to 0.46 mmol g A1 h A1 when 8 t 28 h.On the other hand, the rate of H 2 production by photocatalytic water splitting increases gradually at the rst 8 h with an average rate of 14.52 mmol g A1 h A1 , then the H 2 production rate increases rapidly to 120.23 mmol g A1 h A1 from the 8 th to the 28 th hrs.Interestingly, a negative correlation between the production of CH 4 and H 2 can be observed in Fig. 4(a), demonstrating a clear competitive relationship between the two reactions.In addition, the competitive correlation is altered with the reaction time.From the results of the third repetitive test of photocatalytic reduction of CO 2 on the same sample (Fig. S6 ), it can be obviously seen that the law of the production of CH 4 and H 2 is almost the same as the results in the rst round test.Therefore, it can be inferred that the surface chemistry evolution during the photocatalytic reaction is recoverable.Nevertheless, there is a certain attenuation of the production rates of CH 4 and H 2 , which may be caused by possible property fading of the catalysts aer the long-time reaction.Some references have been listed for comparison with our experiments in the ESI (Table S1 ).Based on the information in the table, it can be seen that the material we prepared has a good performance of photocatalytic reduction of carbon dioxide with simultaneous photocatalytic water splitting, demonstrating that our method is a rational strategy to design Ti-based photocatalysts for photocatalytic reduction of CO 2 . To determine whether the generated CH 4 and H 2 come from the photocatalytic decomposition of the scarifying reagent of triethanolamine in water, two comparative experiments have been implemented.First one is to control for all other conditions the same except for the absence of carbon dioxide.The results are shown in the Fig. S7. The H 2 production rate is 426.41 mmol g A1 h A1 , but no methane is produced.The other one was performed in pure phase triethanolamine with all other conditions the same, but no gaseous products were detected.Based on the above results, it suggests that the generated CH 4 and H 2 are not supposed to come from the photocatalytic decomposition of the scarifying reagent of triethanolamine in water. To get insight into the correlation between the CH 4 and H 2 production, the band structure characteristics of the obtained SrTiO 3 submicron cubes were investigated by the Mott-Schottky measurement.This approach is as a powerful and widely used tool to determine capacitance, carrier density and at band potential. 51The presented 1/C 2 obtained from impedance spectroscopy at three frequencies, 1000, 2000 and 5000 Hz, shown in Fig. 5.The at-band potential of the semiconductor could be extracted from the x-axis intersection.As illustrated in Fig. 5(a), the at band potential of the prepared SrTiO 3 sample measured at three different frequencies is almost identical at approximately A0.14 vs. RHE, which is in agreement with the reported values. 5253354 Combined with the measured band gap value (Fig. S4 ), the band structure of prepared SrTiO 3 sample has been obtained in Fig. 5(b).A proper equivalent circuit (Fig. S8 ) has been used to t the EIS plots for further understanding the conductivity of the photocatalysts.R ct can be assigned to the charge-transfer resistance in the photocatalyst.The charge-transfer resistances for SrTiO 3 submicro cubes is 104 590 U, which is smaller than that of SrTiO 3 commercial powder, 118 170 U.This proves the more effective separation and transportation of photo-generated carriers in SrTiO 3 submicro cubes.As we all know, the thermodynamic condition of the photocatalytic reduction reaction is that the conduction band edge of the semiconductor is higher than the standard reduction potential of the reactant, and the photocatalytic oxidation reaction occurs only when the valence band edge of the semiconductor is lower than the standard oxidation potential of the reactant.As shown in Fig. 5(b), the potential of H /H 2 (0 V vs. NHE at pH 7) for the redox reaction is more negative than that of CO 2 /CH 4 (0.21 V vs. NHE at pH 7), resulting in easier production of methane than hydrogen. 7Therefore, from the perspective of thermodynamics, the photo-reduction of CO 2 to CH 4 is more likely to occur than H 2 O to H 2 . To conrm the reason for the selectivity changes, SrTiO 3 with different Pt loadings were used to test the performance of photocatalytic reduction of CO 2 .When no Pt NPs are loaded, the signal of CH 4 and H 2 cannot be detected in the gas chromatography.This is due to the characteristics of SrTiO 3 that can only respond in the ultraviolet region and the high recombination efficiency of photogenerated carriers.So, the samples with 1 wt and 5 wt Pt loaded were used for the photocatalytic CO 2 reduction test (Fig. 6).No obvious inection point was found for the amount of hydrogen generated in the sample loaded 1 wt.However, the pattern similar to the sample with 3 wt Pt loaded has been found for the sample 5 wt Pt loaded.Therefore, this selectivity change may be closely related to Pt.The production rate of CH 4 and H 2 have an obvious dependence on the load amount of Pt.The production rate of CH 4 is arranged in order as 3 wt Pt 1 wt Pt 5 wt Pt; for H 2 is 3 wt Pt 5 wt Pt 1 wt Pt.During the reactions, the appropriate Pt NPs loading can improve the separation efficiency of photogenerated electron-hole pairs and act as a catalytic site for water splitting.When the loading amount of Pt NPs is low, the water splitting efficiency and carrier separation are relatively low.However, when the loading amount is too large, Pt NPs will increase the recombination efficiency of carriers, which is not conducive to the progress of the photocatalytic reaction.And also reduce the utilization efficiency of the Pt.Additionally, the photocatalytic reduction of CO 2 performance over STO-Pt under simulated sunlight with 10 and 100 volume ratio of TEOA as sacricial agent have been tested.The results tested in 10 volume ratio of TEOA has been obtained in Fig. S9, which are similar to the performance tested in the reaction solution containing 20 volume ratio of TEOA.No gas is generated in the system of 100 volume ratio of TEOA.These results demonstrate that the selectivity changes are not necessarily related to TEOA. As is known, when the Pt NPs are loaded onto the SrTiO 3 , the surface electron density of SrTiO 3 increases because of the lower Fermi energy of Pt NPs and the surface nanojunctions of Pt-SrTiO 3 are formed.Aer Pt NPs were loaded, the photocatalytic performance was signicantly improved, as shown in Fig. 4 and6.The formed nanojunctions at the interface of Pt NPs and SrTiO 3 maybe a crucial factor in performance improvement.For the water splitting reaction, Pt itself is a good hydrogenation and dehydrogenation catalyst, and it has good adsorption and desorption of hydrogen.It is reasonable to deduce that the reaction sites of water splitting are mainly on the surface of Pt NPs.However, the sites of CO 2 reduction on Pt loaded materials are not clear because of the divergent research conclusions that have been reported. 555665758 It should be noted that both hydrogen generation and methane production occurred simultaneously in our experiments, however, it looks that the evolution of methane suppressed the production of hydrogen.While the evolution of methane declined, production of hydrogen was obviously enhanced.The reaction process may be as follows: in the early stage of the reaction, the concentration of CO 2 molecules adsorbed on the surface of SrTiO 3 was sufficiently high, which is the main reason for the high rate of CH 4 generation during this period; however, as the reaction proceeded, surface chemistry or microstructure of the adsorption site of CO 2 might change, making it more inclined to promote the hydrogen production.This can be conrmed by the repetitive experiments results (Fig. S6 ) and subsequent X-ray photoelectron spectroscopy tests (Fig. 7).That is the reason why the competitive mechanism between the two reactions was proposed. To conrm our assumption, changes of the surface chemistry and the electronic structure of the samples vs. reaction time were determined by XPS as shown in Fig. 7.In this gure, STO-Pt-2h and STO-Pt-15h correspond to the samples of STO-Pt aer 2 h and 15 h reaction, respectively.The XPS peaks of Ti in STO-Pt-15h are negatively shied from 458.51 and 464.26 eV, to 458.21 and 463.9 eV, respectively (Fig. 7(a)).This peak shi also occurs for the Sr and O.The Sr 2 3d 5/2 and 3d 3/2 peaks, shown in Fig. 7 Sr-O/Ti-O (octahedron bending), respectively.The absorption peak of Ti-O bond is widened probably due to the presence of several Sr-Ti-O absorption peak. 59Notably, the absorption peak derived from the adsorption of water on the surface is apparently stronger for the sample STO-Pt-15h than STO-Pt-2h, which also conrms the assumption that adsorption of water onto the surface of SrTiO 3 submicron cubes is favored over CO 2 adsorption as the reaction proceed at the surface chemical modication of the photocatalyst take place with time."
  },
  {
    "title": "Conclusions",
    "content": "In this work, SrTiO 3 submicron cubes were successfully prepared by a molten salt synthesis method.A simultaneous and competitive photocatalytic generation of CH 4 and H 2 were observed on the submicron cubes originated from the reduction of CO 2 and water splitting.The generation of CH 4 is higher in the rst 8 h with the average production rate of 4.39 mmol g A1 h A1 , then gradually reaches a plateau area between 8 and 28 hours with the average production rate of 0.46 mmol g A1 h A1 .On the contrary, evolution of H 2 is evidently suppressed in the rst 8 h and increases signicantly between 8 to 28 hours, with the average production rate increase from 14.52 mmol g A1 h to 120.23 mmol g A1 h A1 .The investigated surface chemistry and electronic structure of SrTiO 3 submicron cubes, photoreduction reaction thermodynamic conditions and competing relationship of reactant molecular adsorption on the surface of SrTiO 3 are proposed as the main causes of product rate changes.The current work expands our understanding of the application of photocatalyst for photocatalytic reduction of carbon dioxide and water.support from the 111 Project \"New Materials and Technology for Clean Energy\" (B18018). Fig. 1 shows strong peaks are very similar to purchased SrTiO 3 commercial powders, which correspond to cubic SrTiO 3 phase (JCPDS no.86-0179) with space group Pm 3m (221).No additional diffraction peaks are observed, suggesting the high purity of the obtained SrTiO 3 crystals.Fig. S1 presents the XRD Rietveld renement patterns of the SrTiO 3 crystal.The renement of the sample yields c 2 , wR p and R p values of 1.817, 6.54 and 5.8, respectively, indicating close agreements with the experimental data.The crystal cell parameter of the prepared SrTiO 3 is 3.10931 (15) A, and the unit cell volume is 59.379 (7) A3 .Based on the experimental and calculated results, it was conrmed that the synthesized sample has a perovskite structure. Fig.1XRD pattern of the as-prepared SrTiO 3 synthesized by molten salt method. Fig. 2 (a and b) SEM of SrTiO 3 , (c) low resolution TEM of SrTiO 3 , (d) high resolution TEM of SrTiO 3 lattice fringes, (e) selected area electron diffraction pattern of SrTiO 3 , (f, g) TEM of STO-Pt, (h) high resolution TEM of STO-Pt lattice fringes. Fig. 3 High resolution XPS spectra of (a) Sr 3d, (b) Ti 2p, (c) O 1s in SrTiO 3 sample. Fig. 4 (a) Photocatalytic reduction of CO 2 over STO-Pt with under simulated sunlight with 20 volume ratio of triethanolamine (TEOA) as sacrificial agent, (b) production rate change before and after eighth hour. Fig. 5 Band structure of SrTiO 3 nanocrystals.(a) The Mott-Schottky curves of SrTiO 3 electrodes measured in Na 2 SO 4 solution.(b) The scheme of the band structure of SrTiO 3 nanocrystals. Fig. 6 (a) Photocatalytic reduction of CO 2 over SrTiO 3 loaded with 1 wt Pt under simulated sunlight with 20 volume ratio of triethanolamine (TEOA) as sacrificial agent, (b) photocatalytic reduction of CO 2 over SrTiO 3 loaded with 5 wt Pt under simulated sunlight with 20 volume ratio of triethanolamine (TEOA) as sacrificial agent. This journal is The Royal Society of Chemistry 2020 This journal is The Royal Society of Chemistry 2020 RSC Adv., 2020, 10, 42619-42627 42627 This project is supported by Key Project of Changfeng-HFUT Industrial Innovation Guidance Funds (JZ2020YDZJ0122), the National Natural Science Foundation of China (Grant No. 51772072, 51672065, U1810204), Fundamental Research Funds for the Central Universities (PA2019GDQT002, PA2019GDZC0096).We also would like to thank the nancial There are no conicts to declare."
  }
]