[
  {
    "title": "Doi",
    "content": "10.1016/j.cej.2016.01.032"
  },
  {
    "title": "Article_Title",
    "content": "Facet-dependent photocatalytic reduction of CO2 on BiOI nanosheets"
  },
  {
    "title": "Abstract",
    "content": "h i g h l i g h t sFacet controllable synthesis of BiOI nanosheets.Facet-dependent photocatalytic property for CO 2 reduction on BiOI nanosheets.BiOI-001 have better separation efficiency, higher CB position, more adsorption of CO 2 . g r a p h i c a l a b s t r a c tWe first report the facet controllable synthesis of BiOI nanosheets with exposed 0 0 1 (BiOI-001) and 1 0 0 (BiOI-100) facets by adjusting reaction time of hydrothermal process.Photocatalytic results revealed the facet-dependent photocatalytic property for CO 2 reduction on BiOI nanosheets."
  },
  {
    "title": "Experimental",
    "content": "2.1.Synthesis of BiOI-100 and BiOI-001 20 mL KI (0.5 mol/L) solution was added into the 20 mL Bi (NO 3 ) 3 A5H 2 O (0.5 mol/L) ethanol solution drop by drop with continuously magnetic stirring.After stirring 1 h, the solution was transferred into Teflon-lined stainless steel autoclaves (50 mL).The autoclaves were kept at 180 C for 2 h.After reaction, the precipitate was obtained by centrifugation, then washed successively with ethanol and distilled water three times.Finally, it was dried at 80 C.This sample was called BiOI-100.BiOI-001 was synthesized at 180 C for 24 h, and other conditions were same with that of BiOI-100. Bruker D8 advance X-ray diffractometer was used to test X-ray diffraction patterns (XRD) spectrum of BiOI-100 and bulk BiOI-001 at room temperature using Cu Ka radiation.FEI Emission Scanning Electron Microscope (QUANTA200) was used to record scanning electron microscope (SEM) images.Transmission electron microscopy (TEM) and high-resolution TEM images were analyzed by a JEOL JEM-2100F Field Emission Electron Microscope.GBC UV/VIS 916 spectrophotometer (GBC Company, Australia) was used to record the UV-vis diffuse reflectance spectra (DRS) with BaSO 4 as a reference.Cary eclipse spectrouorophotometer was used to test photoluminescence (PL) spectra of BiOI samples at k exc 400 nm.ESCALAB 250XI X spectrometer (Thermo Electron Corporation) was used to test X-ray photoelectron spectroscopy (XPS) measurements with an Ar Ka X-ray source, and the spectra calibrated to the C 1s peak at 284.6 eV.The Brunauer-Emmett-Teller (BET) surface areas were measured using quantachrome autosorb-IQ automated gas sorption systems. The photocatalytic reduction activities for CO 2 conversion was done in Labsolar-III AG closed gas system (PLS-SXE300, Beijing Perfect light Technology Co. Ltd.China).The volume of the reaction system was 500 mL 1.712 g NaHCO 3 was added firstly.Then 0.05 g of the BiOI-100 or BiOI-001 were uniformly dispersed onto a watch-glass with an area of 28.26 cm 2 , and then the watch-glass was put in a reaction cell.Prior to the light irradiation, the above system was thoroughly vacuum-treated to remove the air completely, and then 5 mL 4 M H 2 SO 4 was injected into the reactor to react with NaHCO 3 .Then, 1 atm CO 2 gas was achieved.After that, the reactor was irradiated from the top by a 300 W high pressure xenon lamp (PLS-SXE300, Beijing Perfect light Technology Co. Ltd.China), and the photoreaction temperature was kept at 20 C by DC-0506 low-temperature thermostat bath (Shanghai Sunny Hengping Scientific Instrument Co. Ltd.China).During the irradiation, about 1 mL of gas was taken from the reaction cell for subsequent qualitative analysis by GC9790II gas chromatography (GC, Zhejiang Fuli Analytical Instrument Co. Ltd.China) equipped with a flame ionization detector (FID, GDX-01 columns).The quantification of the production yield was based on a calibration curve.The outlet gases were determined to be CO, CH 4 and CO 2 . The photocurrent behaviors of BiOI-100 and BiOI-001 were investigated on a CHI630E electrochemical analyzer with a three electrode (Pt wire, Pt plate, and Ag/AgCl as working, counter, and reference electrode, respectively) system immersed in the suspension containing 10 mL of catalyst (1 g L A1 ), 5 mg of methyl viologen (MV), and 1.0 M NaOH solution, which was continuously purged by N 2 to remove O 2 before irradiation 37,38. The projector augmented wave (PAW) method 39 based Vienna Ab initio Simulation Package (VASP) 40 was used to perform the density of states (DOS) calculations.The electronic exchange-correlation energy calculation was dealt with the generalized gradient approximation (GGA) method in the form of Perdew and Wang (PW91) 41.The Monkhorst-Pack method 42 was used for sampling the Brillouin zone k-point mesh.A 3 A 3 A 1 k-point mesh was used for geometry optimization, while a 5 A 5 A 1 k-point mesh was used for DOS calculations.For the plane wave basis, we used a 550 eV kinetic-energy cutoff.The conjugate gradient algorithm was used for calculating the ground state geometry until the self-consistent total energy converges to within 1.0 A 10 A4 eV and the residual forces were within 0.01 eV/A."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The XRD patterns of BiOI-100 and BiOI-001 were showed in Fig. 1.It can be seen that the XRD patterns are in agreement with previous reported results 24, which can be indexed with the standard tetragonal BiOI structure (JCPDS 00-010-0445, unit cell parameters: a b 0.3984 nm, and c 0.9128 nm).More importantly, it can be seen that the (0 0 4), (0 0 5) and (0 0 6) peaks of BiOI-001 are much higher than that of BiOI-100.It implies that the BiOI-001 have a higher percentage of 0 0 1 facets.The surface areas of BiOI-001 and BiOI-100 were 9.7 m 2 /g and 9.3 m 2 /g, respectively.Fig. 2 showed the XPS spectra of BiOI-100 and BiOI-001, and the all peaks of BiOI-001 and BiOI-100 are at the same position (Fig. 2a).The two peaks of the Bi region at 159.1 and 164.5 eV are assigned to Bi 4f 7/2 and Bi 4f 5/2 respectively (Fig. 2b).The two peaks located at 618.9 and 630.4 eV correspond to I 3d 5/2 and I 3d 3/2 .They are related to the Bi 3 and I 1A in BiOI layered structure, respectively 22,24.The O 1s region can be deconvoluted into two peaks at 529.9 and 531.3 eV as shown in Fig. 2c.The bigger peak at 529.9 eV belongs to O 2A in Bi-O bond 22,24.The peak at 531.3 eV can be attributed to the hydroxyl groups on the surface of sample. Fig. 3a andb were the SEM and TEM images of BiOI-100, respectively.It can be seen that BiOI-100 are nanosheets and the size are about 500 nm and 40 nm in width and thickness, respectively.According to the crystal structure of BiOI, the dominant exposed facets of BiOI-100 should be 1 0 0 facets, which proved by highresolution transmission electron microscopy (HRTEM) and fastfourier transform (FFT) patterns.As shown in Fig. 3c, the top view HRTEM image of BiOI-100 nanosheet shows three clear lattice spacings (0.14 nm, 0.18 nm, 0.20 nm), which can be indexed to 0 A1 6, 0 A2 2 and 0 1 4 facets, respectively.The angles of 0 A1 6/0 A2 2 and 0 A1 6/0 1 4 are 45.9and 50.4, which agree well with theoretical angles (45.5and 50.7).The inset picture of Fig. 3c is the corresponding FFT pattern.The angles of 0 A1 6/0 A2 2 (45.6), 0 A1 6/0 1 4 (50.5) and 0 A2 2/0 1 4 (96.2) also agree well with the theoretical angles (45.5, 50.7and 96.2).It indicates that the crystal axis of BiOI-100 nanosheet is 1 0 0.The side view HRTEM image of BiOI-100 nanosheet (Fig. 3d) reveals two clear lattice spacings (0.20 nm, 0.30 nm), which can be indexed to 2 0 0 and 0 2 2 facets, respectively.The corresponding FFT pattern (the inset picture of Fig. 3d) shows the angles of 2 0 0/2 1 2 (33.2) and 0 1 2/2 1 2 (56.3) are in agreement with the theoretical angles (33.5and 56.2).Summarizing the above data, it can be concluded that dominant exposed facets of BiOI-100 are 1 0 0 facets.Fig. 3e displays the atomic structure of 1 0 0 facet, and the model BiOI-100 nanosheets was showed in Fig. 3f.The morphology and crystal structure of BiOI-001 also were analyzed.The width and thickness also are about 500 nm and 40 nm, respectively (Fig. 3g andh).The top view HRTEM image of BiOI-001 nanosheet reveals two clear lattice spacings (0.28 nm, 0.28 nm), which can be indexed to 1 1 0 and 1 A1 0 facets, respectively.The angles of 1 1 0/1 A1 0 is 90.1, which is agree well with theoretical angles (90.0).The corresponding FFT pattern (the inset picture of Fig. 3i) displays the angles of 1 1 0/2 0 0 (45.1) and 1 1 0/1 A1 0 (90.0) also agree well with the theoretical angles (45.0and 90.0).It indicates that the crystal axis of BiOI-001 nanosheet is 0 0 1.The side view HRTEM image of BiOI-001 nanosheet (Fig. 3j) reveals clear lattice spacings (0.91 nm), which can be indexed to 0 0 1 facets.Summarizing the above data, it can be concluded that dominant exposed facets of BiOI-001 are 0 0 1 facets.Fig. 3k displays the atomic structure of 0 0 1 facet, and the model BiOI-001 nanosheets was showed in Fig. 3l.In order to survey the HRETM image and the corresponding FFT pattern clearly, the Fig. 3c,d, l and j were enlarged as shown in Fig. S1.In order to confirm the transformation process form BiOI-010 to BiOI-001, the BiOI sample with 12 h reaction time was prepared.And the TEM and HRTEM (top view) images were showed in Fig. S2.It can be seen that the lattice spacings (0.28 nm for 1 A1 0 facets of BiOI-001, 0.18 nm for 0 A2 2 facets of BiOI-010) were appeared.Therefore, with the reaction time increasing, BiOI-010 can be transformed to BiOI-001. Control experiments showed that no detectable C1 or C2 products were detected without either photocatalyst or light irradiation.It indicates that both the photocatalyst and light are necessary for the photocatalytic CO 2 conversion.Fig. 4 showed the comparison of the quantity of CO and CH 4 under UV-visible irradiation over BiOI-100 and BiOI-001.It can be seen that the generation of CO and CH 4 over BiOI-001 were about 0.259 and 0.089 lmol h A1 , which are much more than the generation of CO (0.076 lmol h A1 ) and CH 4 (0.075 lmol h A1 ) over BiOI-100.It indicated that the 0 0 1 facets exposure of BiOI can improve the photocatalytic activity of BiOI for conversion.On the other hand, after 4 h light off, BiOI-100 and BiOI-001 also showed same photocatalytic activity for CO 2 conversion when light on.It indicated that BiOI is a steady photocatalyst for photoreduction of CO 2 .Furthermore, we found that BiOI-001 selectively photoreduce CO 2 to produce more CO than CH 4 was.The selectivity of BiOI-001 was much more than that of bulk BiOI.The main reasons about the photocatalytic selectivity of BiOI-001 may be derived from few-layered structure of BiOI-001 and a large number oxygen vacancy on 0 0 1 facets 43.Fig. S3 showed the stability of BiOI-001 during the photocatalytic CO 2 reduction.It can be seen that BiOI-001 displayed stable photoreactivity for CO 2 reduction. The influencing factors for photocatalytic CO 2 conversion on semiconducting photocatalysts included carrier separation efficiency and conduction band (CB) position.Fig. 5 showed the comparison of carrier separation efficiency between BiOI-001 and BiOI-100.As shown in Fig. 5a, the higher PL peak intensity of BiOI-100 reflects the higher recombination efficiency.In contrast, the PL peaks intensity of BiOI-001 was about twice less than that of BiOI-100.Thus, the separation efficiency of photo-generated electrons and holes of BiOI-001 should be better than BiOI-100.Except for PL spectrum, photocurrent spectra also can be used to analyze the carrier separation efficiency of pure photocatalysts 37,38.As shown in Fig. 5b, BiOI-001 exhibits higher photocurrent response under UV-vis irradiation, indicating more fast and efficient photo-generated carriers separation for BiOI-001.For explaining the different carriers separation efficiency, the direction model of the internal electric field BiOI-001 and BiOI-100 based on the 1 0 0 and 0 0 1 atomic structure (Figs.5e and3k) were showed in Figs.5c and6d.It can be seen that the self-induced internal electric fields are perpendicular to the nanosheets of BiOI-001 but parallel to those of BiOI-100.Therefore, the charge separation and transfer assisted by the internal electric fields are more favorable in BiOI-001, with a shorter diffusion distance of photoinduced charge carriers than that in the BiOI-100.Then, higher carrier separation efficiency of BiOI-001 was revealed. The CB position decides the photocatalytic reduction activity of photocatalyst, and higher CB position results in higher activity.Fig. 6 showed the comparison of CB position via experiment data and theoretical analysis.The energy gaps (Eg) of BiOI-001 and BiOI-100 were tested by DRS spectra (Fig. 6a), and they were 1.88 and 1.93 eV, respectively.The valence band (VB) of BiOI-001 and BiOI-100 were tested by valence-band XPS spectra (Fig. 6b), and they were 1.41 and 1.52 eV, respectively.Therefore, the CB position of BiOI-001 (A0.47 eV) was more negative than that of BiOI-100 (A0.41 eV).In order to confirm above experiment results, the total DOS and partial DOS of BiOI-001 and BiOI-100 were showed in Fig. 7a andb, respectively.It can be seen that the VB of BiOI-001 was lower than BiOI-100, but the CB of BiOI-001 was higher than BiOI-100.Obviously, the theoretical analysis was in agreement with the experiment data.Based on the CB and VB positions, the mechanism of facet-dependent photocatalytic reduction of CO 2 of BiOI nanosheets was showed in Fig. 8.It can be seen that the CB positions of BiOI-001 and BiOI-100 were higher than E 0 (CO 2 /CO) (A0.07 eV vs NHE) and E 0 (CO 2 /CH 4 ) (0.17 eV vs NHE) 44.Therefore, under light irradiation, the photoinduced electrons of BiOI-001 and BiOI-100 can react with CO 2 to generate CH 4 and CO.Furthermore, due to the higher CB position, BiOI-001 showed higher photocatalytic activity than BiOI-100 for CO 2 reduction."
  },
  {
    "title": "Conclusions",
    "content": "The facet controllable synthesis of BiOI nanosheets with exposed 0 0 1 (BiOI-001) and 1 0 0 (BiOI-100) facets was reported for the first time.The photocatalytic results showed that BiOI-001 display much higher photocatalytic activity for CO 2 conversion than BiOI-100.PL, DRS, XPS, valence-band XPS spectra and theoretical calculation results revealed that BiOI-001 had better separation efficiency of photo-induced carriers, higher CB position, and more adsorption of CO 2 molecules.These positive factors resulted in the 0 0 1-dependent photocatalytic activity of CO 2 conversion on BiOI nanosheets. Fig. 1.XRD patterns of BiOI-100 and BiOI-001. Fig. 3. SEM image (a), TEM image (b), HRETM image along top view (inset picture is the corresponding FFT pattern) (c), HRETM image along side view (inset pictures are the corresponding FFT pattern and TEM image) (d), 1 0 0 atomic structure (e) and model (f) of BiOI-100; SEM image (g), TEM image (h), HRETM image along top view (inset picture is the corresponding FFT pattern) (i), HRETM image along side view (inset pictures are the corresponding FFT pattern and TEM image) (j), 1 0 0 atomic structure (k) and model (l) of BiOI-001. Fig. 4. The quantity of CO (a) and CH 4 (b) under irradiation over BiOI-100 and BiOI-001.(0-4 h: xenon lamp on; 4-8 h: xenon lamp off; 8-12 h: xenon lamp on). Fig. 5. (a) PL spectrum of BiOI-100 and BiOI-001; (b) photocurrent-time curves of BiOI-100 and BiOI-001; (c) model showing the direction of the internal electric field in BiOI-100; and (d) model showing the direction of the internal electric field in BiOI-001. Fig. 6.(a) Plots of (ahm) 1/2 versus photon energy (hm) of BiOI-100 and BiOI-001 (the inset picture is UV-vis DRS spectra); (b) valence-band XPS spectra of BiOI-100 and BiOI-001. Fig. 7. (a) Total DOS and partial DOS of BiOI-001; (b) total DOS and partial DOS of BiOI-100. Fig. 8.The photocatalytic mechanism of facet-dependent photocatalytic activity of BiOI nanosheets for CO 2 photoreduction. This work was supported by the National Natural Science Foundation of China (Nos.51502146, U1404506), Natural Science Foundation of Henan Department of Science Technology (No. 142102210477), Natural Science Foundation of Henan Department of Education (No. 14A150021) and Natural Science Foundation of Nanyang Normal University (No. ZX2014039). Supplementary data associated with this article can be found, in the online version, at http://dx.doi.org/10.1016/j.cej.2016.01.032."
  }
]