[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2014.12.022"
  },
  {
    "title": "Article_Title",
    "content": "Role of chlorophyll in Spirulina on photocatalytic activity of CO 2 reduction under visible light over modified N-doped TiO 2 photocatalysts"
  },
  {
    "title": "Abstract",
    "content": "The combination of TiO 2 nanoparticles and chlorophyll molecules is promising to provide potential new composite materials for improving photocatalytic CO 2 reduction by merging the ability and features of both material types.In this research, the visible light reactive N-doped TiO 2 (N-TiO 2 ) catalysts were synthesized using a simple sol-gel method, and chlorophyll in Spirulina was consequently loaded onto the N-doped TiO 2 catalysts (Sp/N-TiO 2 ) in an attempt to enhance the photocatalytic efficiency.The effects of nitrogen and chlorophyll in Spirulina, and their loading amount on CO 2 photoreduction with water under visible light of Sp/N-TiO 2 catalysts were investigated.The activities of catalysts were in the order undoped TiO 2 N-TiO 2 Sp/N-TiO 2 .The addition of Spirulina was found to significantly improve the photocatalytic stability and C 2 (C 2 H 4 and C 2 H 6 ) product selectivity.The 0.5Sp/10N-TiO 2 catalyst exhibited approximately 21.3 times and 1.9 times higher total production yield compared with undoped TiO 2 and 10N-TiO 2 , respectively.This outstanding photocatalytic activity could be attributed to the enhancement in visible light harvesting, the surface oxygen vacancies (V O ) facilitating reactants adsorption and dissociation, and the synergistic effect between N-TiO 2 and chlorophyll in Spirulina."
  },
  {
    "title": "Experimental",
    "content": "A two-step process was used to prepare Spirulina-modified Ndoped TiO 2 catalysts.The first step was the synthesis of N-doped TiO 2 through a sol-gel method modified from the work reported by Collazzo et al. 46.In this work, titanium (IV) isopropoxide (Ti(OCH(CH 3 ) 2 ) 4 : Aldrich, 97 purity) was used as a TiO 2 precursor.A certain volume of ammonia solution (QReC, 28 w/w) was added dropwise into titanium (IV) isopropoxide solution at a rate of 1 ml min -1 to initiate the hydrolysis process, and then the obtained mixture was vigorously stirred for 30 min.After that, the mixture was dried at 100 C for 2 h and calcined in air at 400 C for 2 h with a heating rate of 2 C min -1 .The yellow powder catalyst was obtained.The nitrogen concentrations based on titanium in the catalyst were varied in the range of 5-15 wt N. The second step was the modification of N-doped TiO 2 by commercial Spirulina using incipient wetness impregnation method.Briefly, Spirulina pellets (the biological and chemical composition of Spirulina are shown in Table S1) were ground and dissolved in deionized water and then added onto N-TiO 2 catalyst.The loading amount of Spirulina was based on chlorophyll a in Spirulina, which can be calculated from Eq. ( 1) 47: where A 645 and A 663 are absorbances at 645 and 663 nm, respectively, measured by using a UV-vis spectrophotometer.The obtained mixture was continuously stirred at 40 C overnight until water was completely evaporated.The percentages of chlorophyll a in Spirulina-modified TiO 2 catalysts used in this study were 0.1, 0.5, and 1.0 wt.The obtained catalysts was labeled as xSp/yN-TiO 2 , where x and y are the weight percentages of chlorophyll a in Spirulina and nitrogen, respectively.For comparison, the undoped TiO 2 was also prepared by titanium (IV) isopropoxide hydrolysis with deionized water using the same procedure as that of N-doped catalyst. Nitrogen sorption isotherms of the catalysts were measured at -196 C using a Quantachrome Autosorp-1C instrument.Prior to sorption measurements, the catalysts were degassed at 200 C. The specific surface area of the catalysts was obtained by using Brunauer-Emmert-Teller (BET) analysis in the relative pressure (P/P 0 ) range between 0.05 and 0.3.Pore size distribution was calculated by using Barrett-Joyner-Halenda (BJH) method.The specific pore volumes were measured at a relative pressure of 0.995. The crystalline phase of TiO 2 catalysts was analyzed by X-ray diffraction spectroscopy (XRD: Bruker D8 Advance) operated with monochromated Cu K radiation (40 kV to 40 mA) at room temperature.TiO 2 crystallite size was calculated by means of the Scherrer equation. The morphology, size, and lattice structure of the catalysts were examined by using high-resolution transmission electron microscopy (HR-TEM: JEOL JEM-2010 instrument) with an acceleration voltage of 200 kV. Field emission scanning electron microscopy (FE-SEM: JEOL, JSM-7600F) with energy dispersive X-ray spectroscopy (EDS: OXFORD, X-Max N ) operated at 15 keV with Pt-coated was performed to examine the catalyst morphologies and to map surface elements of the catalysts. The functional groups of the catalysts were examined by using Fourier transform infrared spectroscopy (FT-IR: Bruker TENSOR 27) equipped with a DTGS detector in the range of 4000-400 cm -1 . The optical property and band gap energy of the catalysts were recorded with UV-vis diffuse reflectance spectroscopy (UV-vis DRS: JASCO, V-670) using BaSO 4 as a reflectance standard.To obtain the band gap energy, the original reflectance spectra were transformed to the plot of ( h ) 1/2 as a function of photon energy (h ) to be in accordance with the theoretical equation as shown below: where is the absorption coefficient, A is a constant, and E g is the band gap energy.The band gap energy was determined from the cross point of the tangent line through the maximum slope with its lower curve baseline. X-ray photoelectron spectroscopy (XPS), carried out at beamline 3.2a of the synchrotron light research institute (SLRI), Thailand, was used to identify the surface atomic concentrations and chemical states of the catalysts.The photoelectron spectra were collected through a Thermo VG Scientific Alpha110 energy analyzer with the maximum photon energy of 600 eV and the energy step of 0.1 eV.The C 1s peak at 284.6 eV was used as a reference peak for all binding energies. Photoluminescence spectroscopy (PL: AvaSpec-2048TEC, Avantes) was carried out at room temperature in the range of 300-700 nm using an excitation wavelength of 255 nm to examine the charge transfer process of catalysts. The local geometry of Ti in the modified-TiO 2 catalysts was examined by using X-ray absorption near-edge structure (XANES) at beamline 8 of the SLRI, Thailand.A Ge (220) double crystal monochromator was used for photon energy selection.XANES spectra were recorded at room temperature in the transmission mode using ionization chambers with the energy range of 4940-5050 eV and the step of 0.2 eV.Titanium metallic foil was used for calibration at the Ti k-edge at 4966 eV.The obtained spectra were corrected for background absorptions and normalized by Athena program. The experiments on CO 2 photoreduction with water over the modified TiO 2 catalysts were carried out in a photoreactor system as shown in Fig. 1.The compact fluorescent integrated bulbs (Philips Tornado: 6 bulbs, 13 watt) located around a continuous flow stirred slurry reactor (CFSSR) were used as the visible light source.The light intensity at the catalyst zone was approximately 0.37 0.05 mW cm -2 , and wavelengths were in the range of 400-800 nm.Prior to experiment, 0.25 g of each catalyst was loaded into the CFSSR which contained 250 ml distilled water.The catalyst concentration was fixed as 1 g-dm -3 to avoid the effect of light scattering and achieve the maximum ability of light to reach every catalyst particle 28,48,49.A magnetic stirrer placed at the bottom of the reactor vessel helped to generate a continuously-stirred slurry system, resulting in the uniform distribution of catalyst particles in the slurry.CO 2 (99.9purity) was continuously introduced into the CFSSR by using a mass flow controller at a flow rate of 60 ml min -1 for 1 h to purge air and saturate the solution.After that, the flow rate of CO 2 was decreased and maintained at 10 ml min -1 throughout the experiment.The photocatalytic reaction was started by turned on the light from the compact fluorescent integrated bulbs, and irradiation was continued for 6 h.The effluent gaseous products were analyzed by using a Shimadzu GC-2014 gas chromatograph equipped with a thermal conductivity detector (TCD) and a Unibead-C column for H 2 , CO, CO 2 , and CH 4 analysis, as well as a Shimadzu GC-8A gas chromatograph equipped with a flame ionization detector (FID) and a Porapak-Q column for hydrocarbon analysis."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The XRD patterns at 2A of 25.3 and the normalized Ti L-edge XANES spectra shown in Fig. 2 and Fig. S1, respectively, evidently confirmed the existence of anatase phase of all catalysts.For Ndoped TiO 2 catalysts, the peak intensities increased compared to that of undoped TiO 2 ; this indicated that nitrogen dopants could enhance the crystallinity of TiO 2 particles.However, the amount of nitrogen dopants was not enough to cause a structural phase transition.For Spirulina-modified TiO 2 catalysts (Fig. 2e-g), the diffraction peaks were similar to that of N-doped TiO 2 catalyst (Fig. 2c).It should be noted that the heavy metal in Spirulina was not observed by XRD due to its trace amount in Spirulina.The TiO 2 crystallite sizes estimated from XRD patterns by using the Scherrer equation are listed in Table 1.The crystallite sizes of modified TiO 2 catalysts were increased with increasing amounts of nitrogen dopants (as will be reported later in inset of Fig. 8A), as 10N-TiO 2 catalyst exhibited the largest crystallite size (14.9 nm).However, the crystallite size was hardly changed after Spirulina loading.Pore characteristics of undoped TiO 2 and modified TiO 2 catalysts analyzed by nitrogen sorption technique are shown in Fig. 3, and the specific surface area, total pore volume, and pore size are listed in Table 1.All the isotherms in Fig. 3A show the typical structure of type IV isotherm with well-defined H1 hysteresis loop, indicating the characteristic of capillary condensation within uniform mesoporous structures 50.These results confirmed that the mesoporous structures were well retained after nitrogen doping and Spirulina loading.The mean pore sizes of TiO 2 catalysts, as shown in Fig. 3B and Table 1, were slightly increased with increasing amounts of nitrogen dopants (Fig. 3B: c andd), while they were decreased with increasing amounts of Spirulina loading (Fig. 3B: g).The specific surface area and total pore volume of undoped TiO 2 catalyst were 114 m 2 /g and 0.35 cm 3 /g, respectively. With increasing amounts of nitrogen dopant, a decrease in the specific surface area was observed, while the total pore volume was unchanged.Similar decreases in surface area of N-doped TiO 2 were also observed by Liu and Syu 51 and Gurkan et al. 52.This could be attributed to the higher crystallite sizes of N-doped TiO 2 catalysts caused by nitrogen dopants in the form of interstitial N (Ti O N or Ti N O) or substitutional N (Ti N), since N 3-ion has a larger ionic radius (0.171 nm) than that of O 2-ion (0.140 nm) 53. Moreover, the specific surface areas of the catalysts were significantly decreased by 1.1 to 1.5 times when the loading of chlorophyll in Spirulina was increased from 0.1 to 1.0 wt chl a.A similar trend was observed with the total pore volume of Spirulina-modified TiO 2 catalysts, except that the 0.5Sp/10N-TiO 2 catalyst exhibited the highest total pore volume among all the catalysts (0.38 cm 3 /g).The decrease of specific surface area and pore volume of Spirulinamodified TiO 2 catalysts was possibly due to the addition of large Spirulina particles with nonporous surface (Fig. S2) onto the modified TiO 2 catalysts. Fig. 4 shows TEM and HRTEM images of undoped TiO 2 , 10N-TiO 2 , and 0.5Sp/10N-TiO 2 catalysts.TEM image of undoped TiO 2 (Fig. 4a) displayed an agglomeration of TiO 2 nanoparticles with the crystallite size in the range of 8-12 nm.The morphologies of 10N-TiO 2 and 0.5Sp/10N-TiO 2 catalysts (Fig. 4c ande) were similar to the undoped TiO 2 catalyst except that the crystallite sizes were in the range of 12-20 nm, which are in good agreement with the average size calculated from the Scherrer equation.In addition, the presence of Spirulina was not observed in the TEM image of 0.5Sp/10N-TiO 2 catalyst, as shown in Fig. 4e (TEM images of pure Spirulina are shown in Fig. S2a andb).The HRTEM images (Fig. 4b, d, andf) exhibited clear lattice fringes within individual nanocrystals, with interplanar spacings of 0.350 and 0.243 nm, corresponding to (1 0 1) and (1 0 3) planes of anatase in accordance with the XRD results 54,55, respectively. The apparent morphologies of undoped TiO 2 , 10N-TiO 2 , and 0.5Sp/10N-TiO 2 catalysts were further examined by FE-SEM as shown in Fig. 5. Without nitrogen dopants, it was observed that tiny and uniform TiO 2 nanoparticles (Fig. 5a) agglomerated into an irregular spherical shape.The interparticle mesopores created between closely packed particles were clearly seen in the inset of Fig. 5a.A higher degree of particle aggregation was found in the case of 10N-TiO 2 catalyst (Fig. 5b), and mesopores with larger pore size than that of undoped TiO 2 resulted from assemble particles were evidently observed (inset of Fig. 5b).In the case of 0.5Sp/10N-TiO 2 catalyst (Fig. 5c), Spirulina was partially covered by N-doped TiO 2 (SEM images of pure Spirulina are shown in Fig. S2c andd).It should be noted that the surface of Spirulina-modified TiO 2 catalyst was rougher than that of N-doped TiO 2 catalyst (Fig. 5b) due to the fact that some of chlorophylls or other compounds in Spirulina might dissolve in water and disperse on N-doped TiO 2 catalyst.FE-SEM/EDS mapping images of 0.5Sp/10N-TiO 2 catalyst in Fig. S3 also exhibited the well dispersions of C, O, N, and Mg atoms in chlorophyll on the catalyst. The functional groups of undoped TiO 2 and modified TiO 2 catalysts were examined by using FT-IR spectroscopy (Fig. 6).All catalysts (Fig. 6a-c) displayed the typical features of TiO 2 , including O H stretching mode of Ti OH on TiO 2 surface and water molecules at 3406 cm -1 , O H bending mode of hydroxyl group on Ti OH and water molecules at 1624 cm -1 , and broad peak O Ti O stretching adsorption band around 800-400 cm -1 .Comparing to the spectral profile of undoped TiO 2 , 10N-TiO 2 catalyst (Fig. 6b) shows the small peak at 1380 cm -1 , corresponding to the species containing CN bonds or nitrogen oxide species 56.In addition, 0.5Sp/10N-TiO 2 catalyst (Fig. 6c) shows the peaks originating from CH stretching of methyl, methylene or methine group at 2920 cm -1 , C O stretching in conjugated ketone and carbonyl groups at 1655 cm -1 , and C N stretching in chlorophyll around 1540 cm -1 57,58, similar to Spirulina spectra (Fig. 6d).Accordingly, these observations clearly confirm the presence of chlorophyll in the Spirulinamodified TiO 2 catalysts. UV-vis diffuse reflectance spectra of undoped TiO 2 and modified TiO 2 catalysts are shown in Fig. 7.The undoped TiO 2 catalyst exhibited absorption only in the UV region with the absorption edge around 400 nm.For the N-doped TiO 2 catalysts (Fig. 7b-d), the absorptions were extended to the visible region.The band gap energies (E g1 ) of the N-doped TiO 2 catalysts listed in Table 1 were slightly narrower than that of the undoped TiO 2 (3.09 eV).Sub-band gap energies (E g2 ) related to impurity energy level of continuous N O states above the maximum valence band of O 2p valence were observed in N-doped TiO 2 catalysts, which is similar to the results reported by Shao et al. 59 and Li et al. 60.Among all the N-doped TiO 2 catalysts, 10N-TiO 2 (Fig. 7c) exhibited the highest visible light absorption in the range of 400-500 nm with the lowest sub-band gap energy of 2.18 eV.This sub-band gap energy consequently led to the visible light response 61,62.The Spirulina-modified TiO 2 catalysts (Fig. 7e-g) had strong absorption capacity in the visible light region (400-800 nm), corresponding to the characteristic absorption pattern of Spirulina (Fig. 7h).The broad absorption bands around 400-500 and 600-750 nm originating from chlorophyll could harvest visible light and create a color center 63.As a result, the visible light absorption capacity of catalysts was increased, while the band gap energy (in Table 1) was slightly decreased with increasing Spirulina loading. The electronic properties and bonding of nitrogen dopants of the undoped and N-doped TiO 2 catalysts were examined through N 1s core level spectra of XPS technique.As shown in Fig. 8A, the undoped TiO 2 rarely shows any peaks of N 1s, while N-doped TiO 2 catalysts exhibited broad peak centered at 399.8 eV (for 5N-TiO 2 ), 399.8 eV (for 10N-TiO 2 ), and 400.6 eV (for 15N-TiO 2 ).In the case of 5N-TiO 2 and 10N-TiO 2 catalysts, the peaks observed were attributed to a N atom replacing an O atom in the TiO 2 crystal lattice to form the Ti N O linkage 64,65.A higher intensity peak was observed from 10N-TiO 2 , indicating an increase in the electron density of N atom upon nitrogen dopants in the TiO 2 lattice.In the case of 15N-TiO 2 , the N 1s peak was 0.8 eV shifted to higher binding energy; this might be due to the signals of the absorbed molecular nitrogen species (N 2 ) or nitroxide species (e.g., NO and NO 2 ) (400.3 eV) 66.After background subtraction and curve fitting, the amounts of N dopants (inset of Fig. 8A) were calculated from the areas of Ti 2p, N 1s, and O 1s photoemission peaks and weighted by the atomic sensitivity factors of each atomic level.It was found that approximately 2.91 at. of nitrogen was successfully doped onto the 10N-TiO 2 catalyst.The amounts of nitrogen dopants on the catalysts were in good agreement with the increase in the visible light absorption capacity observed from the UV-DRS result.Fig. 8B shows XPS spectra of Ti 2p core levels of undoped TiO 2 and modified TiO 2 catalysts.The respective spin orbits of Ti 2p 3/2 and Ti 2p 1/2 were clearly seen in all Ti 2p spectra, this indicated that the oxidation state of titanium atoms in the catalysts were in the form of Ti 4 .The binding energy of Ti 2p 3/2 in 10N-TiO 2 (458.9 eV) and 0.5Sp/10N-TiO 2 catalysts (458.6 eV) were lower than that of undoped TiO 2 (459.2eV), indicating an increase in the electron density around titanium atoms.This result confirmed the presence of N atoms in the form of interstitial N in TiO 2 lattice due to the fact that the electronegativity of nitrogen is less than that of oxygen 24.Compared with the undoped TiO 2 spectrum (inset of Fig. 8B), the spectra of N-doped and Spirulina-modified TiO 2 exhibited a shoulder at the lower band gap energy of Ti 2p 3/2 , which were ascribed to Ti 3 oxidation state 67.This indicated the occurrence of V O on the surface of TiO 2 catalysts 68. The survey spectrum of 0.5Sp/10N-TiO 2 catalyst in Fig. 8C obviously indicated the characteristic peaks of Ti 2p, O 1s, and C 1s together with a small peak of N 1s.In the case of the Spirulina-modified TiO 2 catalysts, the amounts of hydroxyl group or chemisorbed oxygen, nitrogen, and carbon observed on the surface of the catalysts were greater than those of the undoped and N-doped TiO 2 catalysts and were increased with the loading percentages of chlorophyll a in Spirulina.This indicated that Spirulina on the catalysts could be exposed to light irradiation, confirming the appearance of Spirulina in SEM result (Fig. 5c).However, the peaks of other metals in Spirulina were not found due to their trace amounts in Spirulina. Prior to each experiment, blank tests were performed to ensure that the products were originated from photocatalytic reaction.The results show that without photocatalyst or visible light irradiation, no H 2 and hydrocarbon products were observed.Moreover, when the photocatalyst was replaced by pure Spirulina with the presences of CO 2 and water in the reactor, no products were detected under visible light irradiation.This result confirmed that Spirulina alone could not function as a photocatalyst. The performances of undoped and N-doped TiO 2 catalysts in photocatalytic CO 2 reduction were tested in order to investigate the effect of nitrogen doping on photocatalysts, and the H 2 production as a function of irradiation time is shown in Fig. 9A.Undoped TiO 2 catalyst rarely shows activity under visible light irradiation, which corresponds well with the inability of visible light absorption shown in Fig. 7.In contrast, all N-doped TiO 2 catalysts demonstrated higher H 2 production than that of undoped TiO 2 despite of their lower specific surface areas.This enhancement could be attributed to nitrogen dopants and V O in the N-doped catalysts.Nitrogen dopants in a form of interstitial N species (as was confirmed by N 1s of the XPS results) were proposed to create impurity energy levels of N O unit above TiO 2 valence band 17,25,68.Accordingly, Peng et al. 69 reported that the highest impurity energy level of interstitial N above the TiO 2 maximum valence band (0.73 eV) was more favorable for visible light response than that of the substitutional N (0.14 eV).Meanwhile V O formed on the surface was considered to be active adsorption sites for As shown in Fig. 9A, amounts of H 2 products were decreased after 4-5 h time on stream of photoreaction, indicating the gradual deactivation of catalysts; similar observation was reported elsewhere in the literature 49,72.The possible reasons of deactivation are the saturation of adsorption sites on TiO 2 surface by intermediate products or backward reaction that potentially converts some products to intermediates and reactants 49,73,74.It was found that H 2 production of N-doped catalysts followed the order 5N-TiO 2 15N-TiO 2 10N-TiO 2 .This was likely due to the lowest band gap energy, the highest visible light response as well as surface nitrogen concentration of 10N-TiO 2 , as confirmed by UV-vis DRS and XPS analyses in Fig. 7 and the inset of Fig. 8A. To further examine the effect of chlorophyll in Spirulina on photocatalytic performance, TiO 2 with the optimum nitrogen doping amount (10N-TiO 2 ) was selected to load various concentrations of chlorophyll in Spirulina (0.1, 0.5 and 1.0 wt chl a).From the amount of H 2 production as shown in Fig. 9B, all Spirulina-modified TiO 2 catalysts could notably enhance the activity of 10N-TiO 2 catalyst.The maximum H 2 production of 29.93 mol g -1 h -1 was obtained from 0.5Sp/10N-TiO 2 catalyst at time on stream of 1 h.A possible reason is that high Spirulina loading (1.0 wt) causes significant decrease in the specific surface area of catalysts, as shown in Table 1.In addition, this high loading might lead to the formation of recombination centers due to large population of photo-induced electron-hole pairs 31,60,75.In terms of catalyst stability, the Spirulina-modified TiO 2 catalysts exhibited higher H 2 production at early reaction stage, and then appeared to remain constant for the rest of irradiation times, indicating longer-term stability compared to those of N-doped TiO 2 catalysts.All these results indicated that chlorophyll in Spirulina had an important role in photocatalytic activity.As mentioned in the result of UV-vis DRS, Spirulina-modified TiO 2 catalysts show high absorption of photons with different wavelengths in the visible light regime, these photons could excite electrons in chlorophyll to excited states.In order to clarify the photoexcited electron transfer process between 10N-TiO 2 catalyst and chlorophyll in Spirulina, PL spectroscopy was performed and PL spectra as shown in Fig. 10 exhibited the broad PL emission band with peaks at 412 and 478 nm for all catalysts.It was found that PL intensities of 10N-TiO 2 catalysts were decreased with Spirulina loading, indicating the efficient contact and occurrence of the charge transfer between 10N-TiO 2 catalyst and chlorophyll in Spirulina 38.Since both of 10N-TiO 2 catalyst and chlorophyll in Spirulina can absorb the light in UV region (as shown in Fig. 7c andh), the direction of the charge transfers then need to be confirmed by the energy levels of 10N-TiO 2 catalyst and chlorophyll in Spirulina.Accordingly, Kathiravan et al. 76 reported that the oxidation potential of excited state of chlorophyll is -1.27 vs. SCE, while the conduction band potential of TiO 2 is -0.1 vs. SCE.Based on these information, electrons then transferred from excited state of chlorophyll to the conduction band of 10N-TiO 2 due to the energetically higher excited states of chlorophyll.In addition, the PL intensities of 10N-TiO 2 catalysts were continuously decreased with the increase in Spirulina loading, suggesting the higher degree of electron transfer with respect to chlorophyll contents.Furthermore, the electron transfer from excited state of chlorophyll to the conduction band of TiO 2 was also confirmed by Kathiravan et al. 76 using fluorescence lifetime measurement since the chlorophyll adsorbed on TiO 2 had the shorter fluorescence lifetime than that of the unadsorbed TiO 2 .There have been few literature 40,41 proposed on the electron transfer process from pure chlorophyll to photocatalysts as well.Therefore, chlorophyll in Spirulina could potentially act as a photosensitizer or electron donor, and as a result, the additional electrons from chlorophyll help improve the photocatalytic reaction efficiency by reducing more adsorbed molecules, such as CO 2 and other intermediates, on the catalyst surface. The cumulative productions over TiO 2 and modified TiO 2 catalysts for the time on stream of 6 h were calculated by integrating the production rate with irradiation time, and the results are summarized in Table 2.It was found that the cumulative H 2 production over 10N-TiO 2 and 0.5Sp/10N-TiO 2 catalysts were approximately 12 times and 22 times higher than that of undoped TiO 2 , respectively.Similar to those reported elsewhere 77787980, besides H 2 , C 2 H 4 and C 2 H 6 as the desired products, as well as CH 4 as the undesired product, were also detected in this work.The Considering the product selectivity of CO 2 reduction, the addition of chlorophyll in Spirulina could significantly increase the selectivity of the C 2 products (C 2 H 4 and C 2 H 6 ), which are the green and potentially applicable products.This suggested that the increase in available electrons from chlorophyll in Spirulina likely promoted the response for chain growth probability of hydrocarbon products.Among all the catalysts, 0.5Sp/10N-TiO 2 catalyst gave the highest desired product selectivity of 0.60 (Table 2).Moreover, due to the fact that similar products were observed when both N-doped TiO 2 and Spirulina-modified TiO 2 catalysts were applied, this evidently implied that the products reported in Table 2 were obtained as the result of CO 2 reduction (not from degradation of Spirulina itself). The photocatalytic activity of 0.5Sp/10N-TiO 2 catalyst for 24 h was carried out in order to study the decomposition of Spirulina.As shown in Fig. S4, the rate of H 2 production remains constant at the early reaction stage (1-7 h) and then gradually decreased while the rate of CH 4 production decreased after reaching their maximum values.The decrease in the production rate exhibited a gradual deactivation of the catalyst.The possible reasons of deactivation could be attributed to the saturation of adsorption sites on TiO 2 surface, backward reactions 49,73,74, or the decomposition of Spirulina itself. The FT-IR spectra of 0.5Sp/10N-TiO 2 catalysts (inset of Fig. S5) confirmed the partial decomposition of Spirulina during the reaction time since the peak intensities originating from the functional groups of chlorophyll in Spirulina of the catalyst after 24-h reaction (Fig. S5b) slightly decreased compared to that of the catalyst before reaction (Fig. S5a).The color of the catalyst after 24-h reaction (Fig. S4) also faded from that of the catalyst before reaction, indicating the decomposition of Spirulina.The decomposition of Spirulina was further investigated by using UV-vis spectroscopy to examine the reaction solution.As shown in Fig. S5, UV-vis spectrum of the reaction solution collected after 24-h reaction (Fig. S5b) exhibited a higher absorbance intensity around 190-300 nm compared to that of the catalyst before reaction (Fig. S5a).These results demonstrated that decomposed compounds from Spirulina could potentially dissolve into the reaction solution. In order to compare the result of this work to those previously published on the basis of a mole of photon from light irradiation absorbed by the catalyst, the total quantum yield ( T otal ) of desired products from CO 2 reduction was calculated by using Eqs.( 3)-( 5) and reported in Table 2: where n e is number of electrons required to transform CO Based on the information regarding electron paramagnetic resonance (EPR) spectroscopy and diffuse reflectance infrared Fourier transform spectroscopy (DRIFTS) that has been reported 81828384, CO 2 -and CH 3 were found to be major intermediates for CH 4 production in a solid-liquid reaction system, while HCO 3 -and C were the intermediates for hydrocarbon production in a solid-gas reaction system.Accordingly, the possible reaction pathways of CO 2 reduction for the formation of hydrogen and hydrocarbon products in this present work are deduced as follows, and the reaction mechanism is illustrated in Fig. 11.As shown in the schematic in Fig. 11 and (R1), chlorophyll (chl) primarily absorbs light energy, which excites an electron from a ground state to an excited singlet state ( 1 chl ), and some electrons undergo intersystem crossing (ISC) to theirs triplet state ( 3 chl ). In the excited state, an electron can readily release and transfer to TiO 2 , while chlorophyll ( 1 chl , 3 chl ) simultaneously converts to its cationic form (chl in (R2)) which can be regenerated back to chlorophyll (chl) by receiving electron from an electron donor (ED) in Spirulina or react with some decomposed compounds from Spirulina as shown in (R3).At the same time, TiO 2 creates electron-hole pairs on its surface by absorbing sufficient light energy (R4).For H 2 formation, water consecutively reacts with holes on the catalysts and produces H 2 through the formation of H ions and H radicals as shown in (R5)-(R7).The formation pathways of hydrocarbon products shown in (R8)-(R13) are more complicated than those of H 2 since more electrons and protons are incorporated.CO 2 firstly reacts with electron in (R8) or Ti 3 in (R9) to form CO 2 -, which can be further reduced to surface HCO 3 -(R10).After that HCO 3 -then reacts with an electron in (R11) to form C (ads) radicals, which possibly convert to CH 4 , C 2 H 4 , and C 2 H 6 in (R11)-(R13) by reacting with H radicals.Due to the complexity of the reaction mechanism for hydrocarbon productions, future study using EPR and DRIFTS will be helpful to confirm this proposed mechanism and reaction intermediates."
  },
  {
    "title": "Conclusions",
    "content": "Spirulina-modified N-doped TiO 2 (Sp/N-TiO 2 ) catalysts were successfully synthesized and found to significantly influence the catalytic performance for CO 2 photoreduction under visible light.The photocatalytic activities of TiO 2 catalysts were increased by doping nitrogen into TiO 2 lattice and further enhanced by loading Spirulina onto the catalysts.Nitrogen dopants in the form of interstitial N that generated impurity energy levels of N O states above the TiO 2 maximum valence band and the surface V O as the active adsorption sites of reactants and intermediates were responsible for the increase in visible light activity of the N-TiO 2 catalysts.For Sp/N-TiO 2 catalysts, the chlorophyll in Spirulina helps improve the photocatalytic efficiency by acting as a photosensitizer and donates electrons to N-TiO 2 catalysts.Moreover, these additional electrons also improve the stability of photocatalysts and promote the chain growth probability of C 2 H 6 , resulting in the increase of C 2 product selectivity.The highest C 2 product selectivity was observed from 0.5Sp/10N-TiO 2 catalyst, for which the selectivity is approximately 7.5 times and 4.6 times higher than those of undoped TiO 2 and 10N-TiO 2 catalysts, respectively.However, it should be noted that the activities of the catalysts were decreased with high percentages of modifiers as their use possibly led to the formation of electron-hole pair recombination. Fig. 1.Schematic of experimental system for CO2 photoreduction. Fig. 2. XRD patterns of (a) TiO2, (b) 5N-TiO2, (c) 10N-TiO2, (d) 15N-TiO2, (e) 0.1Sp/10N-TiO2, (f) 0.5Sp/10N-TiO2, and (g) 1.0Sp/10N-TiO2 catalysts (A anatase). Fig. 3. (A) Nitrogen adsorption-desorption isotherm and (B) pore size distribution of TiO2 and modified TiO2 catalysts: (a) TiO2, (b) 5N-TiO2, (c) 10N-TiO2, (d) 15N-TiO2, (e) 0.1Sp/10N-TiO2, (f) 0.5Sp/10N-TiO2, and (g) 1.0Sp/10N-TiO2. Fig. 4. TEM (A) and HRTEM (B) images of TiO2 (a, b), 10N-TiO2 (c, d), and 0.5Sp/10N-TiO2 (e, f) catalysts (A anatase). Fig. 5. FE-SEM images of (a) TiO2, (b) 10N-TiO2, and (c) 0.5Sp/10N-TiO2 catalysts. Fig. 6.FT-IR spectra of (a) TiO2, (b) 10N-TiO2, (c) 0.5Sp/N-TiO2 catalysts, and (d) Spirulina. Fig. 7. UV-vis diffuse reflectance spectra of TiO2 and modified TiO2 catalysts: (a) TiO2, (b) 5N-TiO2, (c) 10N-TiO2, (d) 15N-TiO2, (e) 0.1Sp/10N-TiO2, (f) 0.5Sp/10N-TiO2, (g) 1.0Sp/10N-TiO2, and (h) Spirulina. Fig. 8. High resolution XPS spectra of (A) N 1s, (B) Ti 2p of TiO2 and modified TiO2 catalysts, and (C) survey spectrum of 0.5Sp/10N-TiO2 catalyst. Fig. 9. Production rate of H2 as a function of irradiation time over TiO2 and modified TiO2 catalysts. Fig. 10.PL spectra of (a) 10N-TiO2, (b) 0.1Sp/10N-TiO2, (c) 0.5Sp/10N-TiO2, and (d) 1.0Sp/10N-TiO2 catalysts (excitation at 255 nm). Fig. 11.Proposed mechanism for photoreduction of CO2 with water on Spirulina-modified N-TiO2 catalyst. Crystallite size, BET surface area, pore volume, pore size, and band gap of TiO2 and modified TiO2 catalysts. a Calculated from the Scherrer equation. 71nts of photoreduction products, product selectivity, and quantum yield under visible light irradiation for 6 h.Selectivity of CO2 reduction products is defined as the number of moles of desired products (C2H4 and C2H6) per the number of moles of undesired product (CH4).b total is the sum of quantum yield of desired products (C2H4 and C2H6) from CO2 reduction.amounts of products from CO 2 reduction were normally in an order C 2 H 4 C 2 H 6 CH 4 H 2 .Since a large amount of H 2 was generated, it is implied that water splitting reaction was more favorable than CO 2 reduction.As previously reported by He et al.71, the binding energy on the vacant site of H 2 O was 0.64 eV higher than that of CO 2 , as a result the adsorption of CO 2 could be potentially hindered by H 2 O.However, hydrogen was simultaneously consumed during CO 2 reduction to produce hydrocarbon products.As shown in Table2, the maximum amounts of C 2 H 4 and C 2 H 6 were obtained from 0.5Sp/10N-TiO 2 catalysts (0.17 and 0.12 mol g -1 , respectively), while the maximum amount of CH 4 was obtained from 10N-TiO 2 catalyst (0.93 mol g -1 ). a 2 to products (12 and 14 electrons for C 2 H 4 and C 2 H 6 , respectively), M i is mole of each product (C 2 H 4 and C 2 H 6 ), M p is mole of photon absorbed by catalyst, I is light intensity (0.37 mW cm -2 ), S is area exposed to light (170.91 cm 2 ), N A is Avogadro's number (6.022 10 23 mol -1 ), and E is photon energy (3.61 10 -19 J at 555 nm).The total quantum yields of desired products obtained from undoped TiO 2 and 0.5Sp/10N-TiO 2 catalysts under visible light irradiation ranged from 0.005 to 0.060. This work was financially supported by grants from the Thailand Research Fund through the Royal Golden Jubilee Ph.D. Program (Grant No. PHD/0074/2554), the Center for Advanced Studies in Nanotechnology for Chemical, Food and Agricultural Industries, Rayong Institute of Science and Technology Foundation, and the Kasetsart University Research and Development Institute (KURDI).The authors would like to thank the support from the Synchrotron Light Research Institute (Public Organization), SLRI, Thailand for XPS and XAS measurements. Supplementary data associated with this article can be found, in the online version, at http://dx.doi.org/10.1016/j.apcatb.2014.12.022."
  }
]