[
  {
    "title": "Doi",
    "content": "10.1016/j.jcat.2020.09.038"
  },
  {
    "title": "Article_Title",
    "content": "Rational one-step synthesis of cobalt clusters embedded-graphitic carbon nitrides for the efficient photocatalytic CO2 reduction under ambient conditions"
  },
  {
    "title": "Abstract",
    "content": "Metal clusters catalyst embedded in semiconductors is the key factor for an efficient photocatalyst toward photocatalytic CO 2 reduction.However, developing a simple method to synthesize such photocatalyst with these features has remained challenging.Herein, a rational one-step synthesis of cobalt clusters embedded in g-C 3 N 4 layers is developed for an enhanced photocatalytic CO 2 reduction.The tiny cobalt clusters are embedded into the g-C 3 N 4 structure and stabilized through the interaction with NH 2 -bpy moieties.Besides, the ligands of cobalt complex can copolymerize with urea during the synthesis owing to the presence of amino groups, thus providing a direct electron transfer between carbon nitride and cobalt clusters, which act as the light harvester and active reduction site, respectively.Consequently, a volcano relationship between the CO generation rate and the cobalt clusters incorporated into the carbon nitride matrix was found.Under optimized conditions, representative C 3 N 4 -0.5CoOx exhibits the very high CO generation rate of 2.6 lmol.hA1 .Its apparent quantum yield of 3.2 at 420 nm and 1.0 at 460 nm, which is one of the highest values reported so far.The finding offers new opportunities for designing metal clusters catalysts toward photocatalytic CO 2 reduction based on the judicious use of the metal complex."
  },
  {
    "title": "Experimental",
    "content": "4,4 0 -diamino-2,2 0 -bipyridine (NH 2 -bpy) were purchased from Toronto Research Chemicals.Urea (99) was purchased from Oakwood Chemical.Cobalt(II) chloride hexahydrate (reagent grade), acetonitrile (anhydrous, 99.8), triethanolamine (TEOA, !99.0), dicyandiamide (99), melamine (99), and 2,2 0 -bipyridine (bpy, reagentplus O , !99) were purchased from Sigma-Aldrich.All reagents were used directly without any purification. The cobalt complex was synthesized with the same procedure in the literature with a slight modification 25.Typically, 150 lmol of NH 2 -bpy (28.0 mg) was dissolved in 10.0 ml of methanol in a three-neck rounded bottom flask fitted with a reflux condenser and heated to 70-75 C under continuous stirring.After that, 50 lmol of CoCl 2 A6H 2 O (11.9 mg) dissolved in 5.0 ml of methanol was added drop by drop to this solution.The mixed solution was refluxed at 75 C for 24 h. In a typical synthesis, 10 g of urea was dissolved in 100 ml of anhydrous ethanol with continuous stirring at 70 C.Then, 5 ml of methanol contained several lmol of cobalt complex (1-20 lmol) was added drop by drop to this solution, followed by drying at 70-75 C.The obtained solid was subjected to calcination in a semiclose crucible with the temperature profiles as follow: holding the temperature at 135 C (at the melting point temperature of urea) for 2 h (ramping rate 5 C/min), then at 500 C for 2 h with a ramping rate 5 C/min.This material was denoted as C 3 N 4 -mCoO x with 'm' is the weight percent of cobalt in the material.The calculated concentrations of cobalt in the synthesized materials are 0.1, 0.25, 0.5, 1.0 wt when using 1, 5, 10, 20 lmol of cobalt complex, respectively.The bulk g-C 3 N 4 was synthesized under the same condition without the addition of cobalt complex. For comparison, several control samples were also prepared in the same manner as the following: C 3 N 4 -mCoB was synthesized using cobalt complex without -NH 2 group in the ligands, C 3 N 4 -0CoO x was prepared by adding just NH 2 -bpy ligand (without cobalt) with the same amount as in C 3 N 4 -0.5CoOx .Both C 3 N 4 -mCoO x -D and C 3 N 4 -mCoO x -M were also synthesized in the same manner as that of C 3 N 4 -mCoO x using dicyandiamide and melamine as precursor instead of urea, respectively. N 2 adsorption-desorption isotherms were obtained at A196 C using a Quantachrome Autosorb-1 MP analyzer, and the samples were outgassed under vacuum for 4 h at 120 C before the measurements.X-ray diffraction (XRD) patterns were recorded on a Bruker SMART APEX II X-ray diffractometer equipped with a Cu Ka radiation source with k 1.5418A. UV-vis spectra were recorded on a Cary 300 Bio UV-vis spectrophotometer.Transmission electron microscopy (TEM) images and elemental mapping were obtained using a JEOL 6360 instrument at 155 kV.X-ray photoelectron spectroscopy (XPS) was performed in the ion-pumped chamber (9-10 Torr) of a photoelectron spectrometer (Kratos Axis Ultra), the light source was X-ray (Al Ka; hm 1486.6eV), and the adventitious C peak located at 284.5 eV was used for the internal calibration.Fourier transform infrared (FT-IR) absorption spectra were measured with an FTS 45 IR spectrophotometer with KBr as a reference. The spray-coating technique was used for the preparation of a working electrode.Typically, 5 mg of the photocatalyst was dispersed in 5 ml of ethanol and sonicated to obtain a homogeneous dispersion of slurry materials.This slurry was then spray-coated onto an area of 2 cm 2 of hot F-doped SnO 2 (FTO) glass, followed by drying overnight at 80 C.The transient photocurrent response was recorded on a three-electrode system using an electrochemical workstation.The as-prepared electrode, a Pt wire electrode, and a saturated calomel electrode were utilized as working, counter, and reference electrode, respectively.The photocurrent as a function of time was recorded as the light was switched on and off every 10 s.The electrochemical impedance was also recorded on the same system with a frequency range from 0.1 MHz to 0.1 Hz.All photoelectrochemical measurements were carried out in a threeelectrode system (Autolab PGSTAT204) with 0.5 M Na 2 SO 4 as the electrolyte and irradiated with simulated solar light (150 W Xe lamp).The photocurrent was measured at a bias voltage of 0.0 V under solar light irradiation (150 W Xe lamp) with 10 s light onoff cycle.The electrolyte was purged with Argon for 20 min before any photoelectrochemical measurements. In a typical photocatalytic reaction, a specific amount of photocatalyst was dispersed in a mixture of 9 ml acetonitrile, and 1 ml triethanolamine (TEOA) in a 40 ml quartz test tube.Before photocatalytic testing, the reaction solution was bubbled with CO 2 (99.9,Praxair) in the dark for 20 min and then sealed with a rubber septum.The reaction was then irradiated with solar light irradiation (ABET SN103 Model 11,002 SunLite TM Solar Simulators, 150 W Xe lamp, AM 1.5G, 100mW.cmA2 ).For visible-light irradiation, a long-pass filter was used (Thorlabs, FGL420 -25 mm).For Apparent Quantum Yield calculation, bandpass filters were used (Thorlabs, FB420-10, or FL460-10) to transmit wavelength band of light at 420 nm and 460 nm.The headspace above the reaction solution was sampled with a gas-tight syringe at different time intervals for product analysis using GC equipped with a TCD detector and a Carboxen TM 1010 PLOT column.CO is detected as the major reduction component with a minor amount of H 2 . The Apparent quantum yield (AQY) is defined by the following equation: Since two electrons are involved in the conversion of CO 2 to CO, AQE for CO can be calculated as the following equation: The number of evolved CO molecules The number of incident photons A 100 The photon flux was measured with Newport's power meter (1918-C Optical Power Meter) equipped with a thermopile optical detector.The AQY at 420 nm was calculated from the experimental data as follows.The photon flux at 420 nm is 2.12 A 10 14 photon.s A1 .cmA2 .A 7 cm 2 area of the sample was irradiated for 7.5 h.Therefore, the number of incident photons was calculated as follows: N incident photons 14 2:12 A 10 14 photon:s For CO 2 reduction, one photon generates one electron, so two photons are required to produce one CO molecule.The molar of generated CO under 420 nm for 7.5 h was determined to be 1.1 lmol.Therefore, the AQY was calculated as follows: 4:0 A 10 19 A 100 14 3:2 The similar calculation was applied for AQY at 460 nm, with the photon flux of 3.57 A 10 14 photon.sA1 .cmA2 , a 7 cm 2 area of the sample was irradiated for 8.5 h, the molar of generated CO under 460 nm for h was 0.65 lmol.Thus, the AQY at 460 nm was calculated to be 1.0."
  },
  {
    "title": "Results_and_Discussion",
    "content": "A series of CoO x /g-C 3 N 4 samples with different cobalt loadings was prepared using urea as a precursor for g-C 3 N 4 and cobalt complex for cobalt cluster, in which 4,4 0 -diamino-2,2 0 -bipyridine (NH 2bpy) is the ligand.The sample was denoted as C 3 N 4 -mCoO x , where 'm' is wt. of Co. Herein, the cobalt cluster CoO x is composed of two forms; (i) primarily the Co 2 coordinated with nitrogen atoms of NH 2 -bpy moieties and (ii) small amount of cobalt oxide (as proved by XPS later).The synthetic procedure is illustrated in Fig. 1, which has two different temperature stages in the calcination process.In the first two hours, the mixture was held at 135 C, at the melting point temperature of urea, followed by increasing the temperature to 500 C and keeping it for 2 h for the formation of C 3 N 4 -mCoO x . Urea was found as an effective precursor that features several advantages in comparison to dicyandiamide and melamine.Since the melting point temperature of urea (around 135 C) is lower than the decomposition temperature of the cobalt complex (around 180 C) (Fig. S1), the mixture of urea and cobalt complex will melt and turn to viscous before reaching the decomposition temperature of the cobalt complex during the thermal treatment.This viscous mixture is essential for stabilizing the cobalt complex, thus preventing them from decomposition.Further, it also facilitates a homogenous distribution of the cobalt clusters CoO x and enhances the copolymerization between NH 2 -bpy of complex and urea. As dicyandiamide and melamine possess higher melting points (210 and 345 C, respectively) than urea, they were also used as precursors to validate the advantage of using urea in our approach.The synthesized materials using dicyandiamide and melamine as the precursors are denoted as C 3 N 4 -mCoO x -D and C 3 N 4 -mCoO x -M, respectively.Under the same synthetic conditions and Co loading, the color of C 3 N 4 -0.5CoOx was found to be brown, whereas both the C 3 N 4 -0.5CoOx -D and C 3 N 4 -0.5CoOx -M were appeared to be yellow (Fig. S2), inferring a significant modification in the structure and optical properties of C 3 N 4 -0.5CoOx .This change could be ascribed to the copolymerization between urea and NH 2 -bpy through amino groups, which is also in agreement with the result from the literature 13. Different characterizations were performed to obtain more information about the influence of the nature of carbon nitride precursors in our developed approach.The UV-Vis spectra of the samples prepared from various precursors exhibit different absorption behaviors (Fig. S3a).In particular, C 3 N 4 -0.5CoOx shows a stronger absorption peak at 220 nm, which is assigned to the ligand-toligand charge transfer (LLCT) of the NH 2 -bpy ligands in the cobalt complex 25.Note that this peak appears only in C 3 N 4 -0.5CoOx , thus further confirming that only the partial NH 2 -bpy moieties in the coordination sphere of cobalt complex were stabilized when urea was used as the precursor.Besides, the C 3 N 4 -0.5CoOx possesses higher absorption ability in the visible light region in comparison to that of C 3 N 4 -0.5CoOx -D and C 3 N 4 -0.5CoOx -M, indicating the enhanced ability to be operated under the visible light irradiation.The Fourier-transform infrared (FT-IR) spectra of these three materials exhibit similar characteristic bands, referring to the formation of carbon nitride structure (Fig. S3b). Furthermore, the BET specific surface area of C 3 N 4 -0.5CoOx was estimated to be 197 m 2 /g, which is 32.8 and 10 times higher than that of C 3 N 4 -0.5CoOx -D (6 m 2 /g) and C 3 N 4 -0.5CoOx -M (19 m 2 /g), respectively (Fig. S3c).The photocatalytic CO 2 reduction experiments proved that C 3 N 4 -0.5CoOx -D and C 3 N 4 -0.5CoOx -M are likely inactive for CO 2 photoreduction, whereas C 3 N 4 -0.5CoOx gave a CO evolution rate of 2.6 lmol.hA1 under the same reaction conditions (Fig. S3d).The above results proved that urea could be an excellent precursor in this approach. Fig. 2a shows the UV-Vis spectra of the series of C 3 N 4 -mCoO x samples prepared from urea as the precursor with different cobalt loadings.All materials have an intrinsic absorption edge around 440 nm, which is assigned to the energy required to excite the electrons from the valence to conduction band of g-C 3 N 4 .Upon the introduction of the cobalt clusters, the absorption edge tends to extend towards 800 nm (red shift).In addition, the absorption intensity is also qualitatively increased in the visible-light region with the increase of amount of cobalt cluster, which is also consistent with the color change (Fig. 2c).This also indicates that the intrinsic band-gap energy of C 3 N 4 is being influenced by the incorporation of cobalt clusters, which can be essentially attributed to the copolymerization between urea and ligand of the cobalt complex.More importantly, the relative intensity of the absorption band at 220 nm, which is assigned to the LLCT of NH 2 -bpy, is also found to be increasing linearly with the loading of cobalt complex.Thus, it can be inferred that the NH 2 -bpy moieties in the coordination sphere of cobalt complex have been stabilized and incorporated into the carbon nitride structure.The crystallinity of C 3 N 4 -mCoO x materials was also investigated by X-ray diffraction (XRD) as seen in Fig. 2b.The XRD patterns of all materials reveal the typical graphitic layered structure with two characteristic peaks at around 13.0and 27.5, corresponding to the intralayer structural packing motif and interlayer stacking of conjugated aromatic segments, respectively 26,27.In addition, the observed changes in the intensity and broadening of both characteristic peaks indicated that there are slight changes in the structure of C 3 N 4 -mCoO x with the loading of cobalt clusters. FTIR provided information about the structural properties of the C 3 N 4 -mCoO x materials (Fig. S4).All the materials exhibit similar profiles, implying the incorporation of the cobalt complex does not significantly change in the basic framework of g-C 3 N 4 structure.The peak around 810 cm A1 could be assigned to the out-ofplane bending mode of heptazine rings 26,28.Strong bands in the region from 900 to 1700 cm A1 are the typical stretching mode of CN heterocycles, thus confirming the unaffected basic structure of C 3 N 4 29.The peaks located in the region from 3000 to 3500 cm A1 could be attributed to either -NH or -OH stretching vibration modes 26,28. The transmission electron microscopy (TEM) images of C 3 N 4 -0.5CoOx show the wrinkled-like nanosheets with curly boundaries (Fig. 3a and Fig. S5).Besides, the transparent appearance of these nanosheets reveals their ultrathin thickness.However, TEM images did not reveal any black spots attributed to cobalt clusters, which is most probably because of their subtle dispersion at the atomic cluster level.The energy-dispersive X-ray (EDX) spectra obtained during TEM analysis show the co-existence of C, N, and Co in C 3 N 4 -0.5CoOx over five different selected areas (Fig. 3b) (the signal for Cu is originated from the copper grid).The elemental mappings prove the homogeneous distribution of C and N over the entire selected area.Moreover, the fine dispersion of Co is indicated by the tiny spots of Co, as shown in Fig. 3c. The photocatalytic CO 2 reduction under solar light irradiation was performed to investigate the correlation between the cobalt loadings and photocatalytic activity (Fig. 4a).The optimized amount (5 mg) of C 3 N 4 -0.5CoOx photocatalyst was used since it produced the highest amount of CO and enhanced the selectivity toward the CO product (Fig. S6).It should be noted that the C 3 N 4 sample (without cobalt) produced only H 2 , indicating the lack of active site for photocatalytic CO 2 reduction.As the concentration of cobalt clusters CoO x increases, a rapid CO production rate was found, whereas the H 2 production rate was significantly suppressed.The optimum loading of the cobalt (Co 0.5 wt) as in C 3 N 4 -0.5CoOx showed the maximum CO production rate of 2.6 lmol.hA1 .Moreover, C 3 N 4 -0,5CoO x still exhibits the highest photocatalytic activity under visible light irradiation with the CO production rate of 0.85 lmol.hA1 (Fig. S7).The results further confirmed that the enhanced light absorption in the visible light region has a significant contribution to the superior photocatalytic activity of C 3 N 4 -0.5CoOx.The photocatalytic CO 2 reduction as a function of time over the C 3 N 4 -0.5CoOx sample is displayed in Fig. S8.The amount of CO increases significantly with the irradiation time, reaching a maximum of 13.3 lmol in 8 h.Although the rate of H 2 generation also increases with time, the selectivity for photocatalytic CO 2 reduction is still nearly 90 after 8 h.These results prove that the cobalt clusters incorporated in the g-C 3 N 4 structure act as the active sites for the photocatalytic CO 2 reduction. A series of controlled experiments were conducted to study the role of each component in the reaction media (Table S1).No product was formed when the reaction was carried out in the dark or without a photocatalyst, revealing that the reduction of CO 2 is really driven by photocatalyst and light irradiation.Moreover, in the case when argon was used instead of CO 2 , no CO was detected, validated that the formation of CO was indeed originated from the photocatalytic CO 2 reduction.Also, CO was not generated in the absence of TEOA, revealing that TEOA works as a sacrificial agent for the photocatalytic CO 2 reduction.Photocatalytic CO 2 reduction at a single wavelength was investigated to further confirm the excellent photocatalytic activity of C 3 N 4 -0.5CoOx by calculating the apparent quantum yield (AQY) at 420 nm and 460 nm.The C 3 N 4 -0.5CoOx sample possesses an apparent quantum yield of 3.2 at 420 nm and even 1.0 at a higher wavelength (460 nm) (Fig. 4b), which represents one of the highest AQY values that have been reported for photocatalytic CO 2 reduction as far as we concern (see Table S2). The stability of the C 3 N 4 -0.5CoOx sample was also examined by five consecutive cycles with each cycle in 2 h under the same reaction conditions (Fig. S9).C 3 N 4 -0.5CoOx exhibits reusable photocatalytic activity over five cycles, with no significant decrease in the rate of photocatalytic CO 2 reduction, revealing the high reusability of this material. To elucidate the reason for the high photocatalytic activity of the C 3 N 4 -0.5CoOx sample, two controlled materials were also synthesized and denoted as follow: (i) no -NH 2 group in the ligand of the cobalt complex, denoted as C 3 N 4 -0.5CoB and (ii) with only NH 2 -bpy ligand, however, without Co in the complex, denoted as C 3 N 4 -0CoO x . Firstly, it was observed that the color of C 3 N 4 -0.5CoB is yellow, whereas both of C 3 N 4 -0.5CoOx and C 3 N 4 -0CoO x are brown (Fig. S10).The results further confirmed that the amino groups in ligands of the cobalt complex play a decisive role in the copolymerization of cobalt complex with urea during the synthesis.UV-Vis spectra of three materials indicate the presence of LLCT peak at around 220 nm, which is ascribed to the presence of bipyridine ligands (Fig. S11).Besides, the photocatalytic activity of C 3 N 4 -0.5CoOx is much higher than that of C 3 N 4 -0.5CoB and C 3 N 4 -0CoO x (Fig. S12).The lower activity of C 3 N 4 -0.5CoB could be attributed to the lack of intimate contact between carbon nitride and cobalt reduction sites.On the other hand, the lack of active site is the main reason for the inactivity of C 3 N 4 -0CoO x toward photocatalytic CO 2 reduction. Solid-state carbon-13 nuclear magnetic resonance ( 13 C NMR) spectra of the samples were obtained to provide an overview of the carbon type in the structure of C 3 N 4 -0.5CoOx , C 3 N 4 -0.5CoB, and C 3 N 4 -0CoO x materials (Fig. S13).In the spectra, the C 3 N 4 -0.5CoBexhibits two peaks centered at 164.61 and 156.91 ppm, which could be assigned to the chemical shift of C-N Hx and NCAN in the heptazine units of g-C 3 N 4 , respectively.The position of these peaks is in good agreement with the result in the literature 30, confirming the presence of heptazine-based structure in carbon nitride.Note that these peaks are also found in C 3 N 4 -0CoO x and C 3 N 4 -0.5CoOx , however with lower chemical shift and the shoulder peak in the profile of both C-N Hx and NCAN.These results imply that there is a formation of new carbon type, which is different from C-N Hx and NCAN in both C 3 N 4 -0.5CoOx and C 3 N 4 -0CoO x , most possibly from NH 2 -bpy through the copolymerization between carbon nitrile and cobalt complex during the synthesis. X-ray photoelectron spectroscopy (XPS) was employed to obtain an in-depth understanding of the difference between the structure of C 3 N 4 -0.5CoOx and those of C 3 N 4 -0CoO x and C 3 N 4 -0.5CoB (Fig. 5a-c).The survey spectra confirm the presence of carbon, nitrogen, with a small amount of oxygen in all three samples (Fig. S14). The high-resolution XPS spectra of C 1s are displayed in Fig. 5a, and their respective peak positions are listed in Table S3.The positions of C sp 2 atom in NACN are almost similar in all the three materials, while there is a difference in the binding energy of C atoms in the C-N Hx group.Comparing to C 3 N 4 -0.5CoB, the binding energy of C-N Hx in C 3 N 4 -0CoO x is shifted by 0.18 eV to the lower binding energy region, whereas the peak is shifted by 0.2 eV to higher binding energy in the case of C 3 N 4 -0.5CoOx .Thus, indicating a higher electron density around C atom of C-N Hx in C 3 N 4 -0CoO x and lower electron density around C atoms of C-N Hx in C 3 N 4 -0.5CoOx as compared to that of C 3 N 4 -0.5CoB. The direction of the peak shift could be ascribed to the interaction of cobalt with nitrogen atoms in the aromatic ring of NH 2 -bpy ligand.Note that the tri-s-triazine based-structure of carbon nitride is extended with NH 2 -bpy ligand through C-N Hx groups in both C 3 N 4 -0CoO x and C 3 N 4 -0.5CoOx as a result of the copolymerization between NH 2 -bpy and urea.In C 3 N 4 -0CoO x , the nitrogen atoms in NH 2 -bpy groups can donate electrons to the tri-striazine subunits of carbon nitride.Thus, the binding energy of C-N Hx is expected to be shifted to lower binding energy as a result of electron donation.In contrast, as the nitrogen atom in NH 2bpy of C 3 N 4 -0.5CoOx is in coordination with cobalt atom, the electron density around this nitrogen atom would be deficient and tend to withdraw p-electron from the tri-s-triazine subunits of carbon nitride.As a result, the C-N Hx peak in C 3 N 4 -0.5CoOx is found to be shifted to higher binding energy. The high-resolution XPS spectra N 1s of three materials can be deconvoluted into three peaks (Fig. 5b), details of the position of these peaks are given in Table S4.In both C 3 N 4 -0.5CoOx and C 3 N 4 -0.5CoB, the binding energies of N atom in the CANC peak are almost similar.However, in C 3 N 4 -0CoO x , the CANC peak is shifted by 0.2 eV to lower binding energy region.This shift indi- cates a higher electron density around N atom in the CANC peak of C 3 N 4 -0CoO x as compared to that of C 3 N 4 -0.5CoOx and C 3 N 4 -0.5CoB,due to the lack of coordination with cobalt atoms, which is in good agreement with the shifting direction of C-N Hx peaks discussed above.Therefore, it is further consolidated that the Co atoms in C 3 N 4 -0.5CoOx are in coordination interaction with N atoms in NH 2 -bpy ligand. Based on the high-resolution XPS results of C 1s and N 1s, it could be proposed that the copolymerization of NH 2 -bpy with carbon nitride is evidenced by the shift in the binding energy of C-N Hx peak.In contrast, the direction of the shift is governed by the interaction of cobalt atoms with the nitrogen atoms in NH 2 -bpy ligand. High-resolution XPS spectra of Co 2p in C 3 N 4 -0.5CoOx can be deconvoluted into four peaks (Fig. 5c).Two peaks at 781.27 and 796.6 eV can be assigned to the Co 2p 3/2 and Co 2p 1/2 , while the two remaining peaks could be assigned to satellite peaks.Note that the binding energy of Co 2p 3/2 is higher than the binding energy of Co 2 in cobalt oxide 31, but it resembles the binding energy of cobalt in the N-heterocycles coordination, similar to the result found in the literature 32.These results further indicate that the cobalt atoms in C 3 N 4 -0.5CoOx are in the Co 2 oxidation state and stabilized by the interaction with nitrogen atoms in NH 2 -bpy. The proposed structure of C 3 N 4 -0CoO x and C 3 N 4 -0.5CoOx are illustrated in Fig. 5d ande, respectively.In C 3 N 4 -0.5CoOx , the cobalt Photoelectrochemical characterization is performed to validate the superior photocatalytic activity of C 3 N 4 -0.5CoOx .To enhance photocurrent, the transient photocurrent responses were recorded via six on-off cycles for the duration of 140 s, using Na 2 SO 4 0.5 M as electrolyte and TEOA 0.1 M as sacrificial agent (Fig. 6a).The photocurrent response of the C 3 N 4 -0.5CoOx was 8 lA/cm A2 , corresponding to 4.4 and 10 times enhancements as compared to those of C 3 N 4 -0.5CoB(1.8 lA/cm A2 ) and C 3 N 4 -0CoO x (0.8 lA/ cm A2 ), respectively.As a result, C 3 N 4 -0.5CoOx exhibited higher photocatalytic activity than the C 3 N 4 -0CoO x and C 3 N 4 -0.5CoBsamples due to their higher rate of electron generation in the system.Electrochemical impendence spectroscopy was also employed to probe the charge transport characteristics of the two materials.As seen in Fig. 6b, the charge-transfer resistance for the C 3 N 4 -0.5CoOx sample is decreased as compared to that of C 3 N 4 -0CoO x and C 3 N 4 -0.5CoB, as evidenced by the smaller semicircle arc at the given frequency range.The lower charge-transfer resistance in C 3 N 4 -0.5CoOx provides a faster electron transfer, which is beneficial for efficient separation of electron-hole pairs during the photocatalytic CO 2 reduction.Both the higher photocurrent response and lower charge-transport resistance further validated the superior photocatalytic properties of the C 3 N 4 -0.5CoOx system.A plausible five-step reaction mechanism for photocatalytic CO 2 reduction is shown in Fig. 7.In step 1, Co II is reduced to the active Co I species by one-electron injection from the excited C 3 N 4 33.Then, the adsorbed CO 2 can bind to the active Co I species through carbon atom (g 1 -CO 2 coordination) to form Co-CO 2 adduct.This coordination is favored by the presence of electron-donating groups (-NH 2 ) on the 4,4 0 positions of the NH 2 -bpy ligands as well as the electron-rich property of Co I centers 33,34.Note that the structure of C 3 N 4 -0.5CoOx holds free amino groups from both the carbon nitride structure and NH 2 -bpy moieties (Fig. 5E).These amino groups play a critical role in enhancing the CO 2 adsorption, which is a crucial step for CO 2 reduction 35363738.Since the amino groups in NH 2 -bpy moieties are the nearest activating groups to the reductive cobalt center, it provides the shortest pathway for the adsorbed CO 2 molecules to migrate to the reductive center.The next three consecutive steps involve the proton-coupled electron-transfer process to form CO and regenerate Co II species (eq.2-4).The photogenerated hole is consumed equivalently by the sacrificial agent TEOA (eq.5-6) 39.Note that TEOA can act as both electron donor and proton donor in the photocatalytic CO 2 reduction process (eq.7)."
  },
  {
    "title": "Conclusions",
    "content": "A simple one-step synthesis of cobalt clusters embedded carbon nitride system using urea and cobalt complex has been demonstrated.Our approach facilitated the interaction of cobalt with nitrogen on NH 2 -bpy moieties, thus stabilizing and enabling them as small clusters, which was further confirmed by UV-Vis, 13 C NMR, and XPS techniques.The homogenous distribution of cobalt clusters was confirmed by elemental mapping.Moreover, a thorough investigation using the high-resolution XPS of C 1s, N 1s, and Co 2p revealed that the amino groups on NH 2 -bpy ligand could act as an anchoring site to facilitate the copolymerization of cobalt complex with urea, thus establishing an efficient electron-transfer pathway between carbon nitride and cobalt clusters.The abundance of the active sites of cobalt is highly dispersed in the form of clusters, improved the light absorption as well as increased the separation of charge carriers, which synergistically enhanced the overall photocatalytic activity of C 3 N 4 -0.5CoOx with the AQY of 3.2 at 420 mm.This work demonstrated that the meticulous use of metal complex could provide an interesting and excellent metal clusters embedded photocatalyst with the abundance of active sites to achieve an enhanced photocatalytic CO 2 reduction under ambient conditions. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Fig. 1.Schematic illustration depicts the one-step process for the synthesis of C 3 N 4 -mCoO x materials with the two-stage temperature profile: (1) holding the temperature at 135 C for 2 h, (2) increasing it to 500 C and keeping it for 2 h. Fig. 2. (a) UV-Vis absorption spectra, (b) XRD patterns, and (c) the photographic images of C 3 N 4 -mCoO x samples. Fig. 3. (a) TEM image, (b) EDS in five different regions, and (c) STEM image with elemental mappings of carbon, nitrogen, and cobalt in the selected region of the C 3 N 4 -0.5CoOx sample. Fig. 4. (a) The performance of different C 3 N 4 -mCoO x samples in photocatalytic CO 2 reduction, (b) The apparent quantum yield of C 3 N 4 -0.5CoOx at different wavelengths (420 nm and 460 nm). Fig. 5.The high-resolution XPS spectra of (a) C 1s, (b) N 1s, (c) Co 2p, and the proposed structures of (d) C 3 N 4 -0CoO x , (e) C 3 N 4 -0.5CoOx materials. Fig. 6.(a) Photocurrent-time profiles, and (b) Nyquist plots of C 3 N 4 -0CoO x , C 3 N 4 -0.5CoOx , and C 3 N 4 -0.5CoB. Fig. 7. Proposed possible mechanism for the photocatalytic CO 2 reduction over C 3 N 4 -0.5CoOx photocatalyst. Duc-Trung Nguyen, Chinh-Chien Nguyen and Trong-On Do Journal of Catalysis 392 (2020) 88-96 This work was performed within the framework of the Natural Science and Engineering Research Council of Canada through Collaborative Research and Development, Strategic Project, and Discovery Grants. Supplementary data to this article can be found online at https://doi.org/10.1016/j.jcat.2020.09.038."
  }
]