[
  {
    "title": "Doi",
    "content": "10.1016/j.mtnano.2021.100157"
  },
  {
    "title": "Article_Title",
    "content": "Single atomic Pt on amorphous ZrO2 nanowires for advanced photocatalytic CO2 reduction"
  },
  {
    "title": "Abstract",
    "content": "The photocatalytic reduction of CO 2 is a reaction that involves multi-electron and multiconversion processes, and its efficiency is strongly affected by the electron transport pathways on the surface of the catalytic material.Here, Pt single-atom-anchored amorphous ZrO 2 nanowires (Pt SA/ZrO 2 ) are fabricated as an efficient photocatalyst for CO 2 reduction.The co-catalyst exhibited a superior CO yielding rate (16.61 mmol/g/h) and selectivity (97.6), outperforming counterparts and most of previously reported ZrO 2 -based photocatalysts.The amorphous nature endows the material with inherent abundant defects (e.g.oxygen vacancies), and ZrOPt charge bridges allow rapid photoelectron transfer, jointly contributing to the enhanced CO 2 reduction performance.We anticipate that design strategies based on anchoring single atoms on amorphous nanosubstrates will inspire further development of advanced photocatalysts."
  },
  {
    "title": "Experimental",
    "content": "The raw materials used in the experiment are all analytically pure (99), such as zirconium oxychloride octahydrate (Beijing Chemical Plant), polyvinylpyrrolidone (Beijing Chemical Plant), absolute ethanol (Beijing Chemical Plant), and chloroplatinic acid (Western Long Chemical Industry), and the water used in the whole process of this research is self-made deionized water. First, 0.7 g polyvinylpyrrolidone (PVP) was dissolved in 60 mL mixture of deionized water and ethanol at the ratio of 1:59, and the solution system was dispersed by ultrasonication for 15 min.Second, zirconium oxychloride octahydrate (0.15 mmol) was added, and the solution was ultrasonicated for 30 min.Third, this solution system was kept at 30 C for 2 h under vigorous stirring.Finally, the precipitate was collected by centrifugation and carefully washed with deionized water to clean out the remnant salt.Then, the precipitate was freeze dried in the lyophilizer for 48 h. The zirconia nanowire precursors were placed in a crucible, and the crucible was placed in a muffle furnace for heat treatment.Amorphous zirconia (AeZrO 2 ) nanowires were obtained by raising the temperature to 200 C at a heating rate of 5 C/min and holding it for 2 h after natural cooling.When the temperature rises to 700 C and the temperature is held for 2 h, the natural cooling results in crystalline zirconia (CeZrO 2 ) nanowires. First, AeZrO 2 powder was dispersed into an aqueous solution, and ultrasound treatment for 10 min, stirring for 30 min, then ultrasound treatment again for 10 min to realize ZrO 2 aqueous solution (0.4 mg/mL).Prepare 50 mL of HPtCl 4 aqueous solution with a concentration of 3.88 A 10 A5 mol/mL was prepared and dropped into AeZrO 2 aqueous solution at a drop rate of one drop controlled within 3e4 s by a drop funnel.After that, the mixture was stirred for 2 h.The precipitate was collected by centrifugation and freeze dried in the lyophilizer for 48 h.The obtained powder was calcined at 200 C for 2 h under an inert atmosphere (5H 2 /95N 2 ) to obtain Pt SA/ZrO 2 . The morphology and structure of ZrO 2 were observed by JEOL 7500F scanning electron microscope (SEM).The surface composition was analyzed by energy-dispersive X-ray spectroscopy (EDS).The samples were dispersed on silicon platelets for testing.Transmission electron microscope (TEM) and high-resolution TEM (HRTEM) images were obtained with Corrected Titan G2 TEM at 300 kV acceleration voltage.The phase structure of the sample was characterized by Shimadzu X-ray diffraction (XRD) XRD-6000 diffractometer.The scanning rate was 0.03 per second in the range of 10e80 (2q).All X-ray photoelectron spectroscopy (XPS) results were obtained using the Thermo Scientific Escalab 250XI instrument, using a monochrome Al KR X-ray source.Inductively coupled plasma atomic emission spectrometry was used to determine the precise content of each element.Electron paramagnetic resonance uses A300-10/12 German Bruker company to detect the oxygen vacancy of AeZrO 2 and CeZrO 2 .Raman further analyzed the coordination of AeZrO 2 , CeZrO 2 , and Pt SA/ZrO 2 ; The ultravioletevisible (UVeVis) diffuse reflectance spectra of samples were recorded on a Shimadzu UV-2600 spectrophotometer; to further study the charge recombination and separation behavior of the prepared samples, we conducted photoluminescence (PL) spectroscopy; X-ray absorption spectroscopy (XAFS) analysis revealed the local doping of the Pt atom center on Pt SA/ZrO 2 location and space coordination environment.The X-ray absorption near-edge structure (XANES) spectrum shows the characteristics of Pt SA/ZrO 2 at the position of the L3-edge absorption edge of Pt.Electrochemical impedance spectroscopy (EIS) and MotteSchottky (MeS) measurements were taken using an electrochemical analyzer (CHI660e Instruments) in a standard three-electrode system in which a Pt piece and Ag/AgCl (saturated Na 2 SO 4 ) were set as the counter electrode and reference electrode, respectively.All applied potentials were converted to that of a reversible hydrogen electrode (RHE): E(RHE) 14 E(Ag/AgCl) 0.6 V. The photocatalytic CO 2 reduction is carried out in a closed reaction.First, 0.02 g of photocatalyst was ultrasonically dispersed and coated on a quartz plate, and 3 mL water was placed in the container.Then the CO 2 gas is pumped into the sealed container and cleans it with CO 2 gas three times.The light source is a xenon lamp with a power of 300 W, which simulates sunlight.The reaction temperature is controlled by circulating water and kept at 20 C. The product was detected by gas chromatography (CO and CH 4 ) after light exposure (GC-9560, Shanghai Huaai Chromatographic Analysis Technology Co. Ltd.).The photocatalytic time was 2 h, and the cycle was four times, each time 2 h."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The synthesis procedure of Pt SA/ZrO 2 is illustrated in Fig. 1a.The precursor was prepared by PVP-assisted synthesis in a mixture of ethanol and water, and amorphous ZrO 2 (AeZrO 2 ) nanowire was obtained after heat treatment at 200 C. Uniformly distributed nanowires were observed by scanning electron microscope (SEM); their diameter is 150 nm and length is 15 mm (Fig. 1b).The detailed morphology and amorphous structure of the ZrO 2 nanowires are demonstrated in Fig. S1.The surface of ZrO 2 with amorphous structure can expose defects to ensure effective loading of SAs.Subsequently, Pt SAs were anchored on the AeZrO 2 nanowires by mixing HPtCl 4 with AeZrO 2 in liquid and annealing their complex.The morphology of the nanowires was maintained on the reaction, as shown in the SEM and TEM images (Fig. 1c andd).The selected area electron diffraction and HRTEM proved that the AeZrO 2 nanowire was still amorphous after the Pt loading (Fig. 1d ande).The atomic-resolution structure of Pt SA/ZrO 2 (Fig. 1f) was further investigated with spherical aberration-corrected TEM.As expected, we can observe individual bright spots less than 1 nm on the surface of the AeZrO 2 nanowires, and no Pt nanoparticles could be noted in Fig. 1f, indicating that Pt was atomically dispersed.The EDS mapping of Pt SA/ZrO 2 is shown in Fig. 1g, which highlights the existence of Pt, O, and Zr elements and further demonstrates the even distributions of Pt SAs on ZrO 2 (Fig. 1g).The Pt content of the Pt SA/ZrO 2 was examined with an ICP spectrometer and found to be 1.97 (Table S1). We performed X-ray absorption spectroscopy and XPS analysis to clarify the coordination environment and chemical state of the Pt atoms on the Pt SA/ZrO 2 catalysts.From the Pt L 3 -edge XANES spectra in Fig. 2a, it can be found that the white line peak intensity of Pt SA/ZrO 2 is weaker than that of PtO 2 powder but higher than that of Pt foil, indicating that the Pt atoms are oxidized 24,25.The extended X-ray absorption fine structure (EXAFS) spectrum shows a prominent peak at 1.6 A for Pt SA/ZrO 2 corresponding to PteO coordination and no significant PtePt bond signal between 2.5 and 3.0 A, suggesting Pt species on the ZrO 2 are in an atomically dispersed state (Fig. 2b) 26e28.EXAFS fitting results (Fig. S2 and Table S2) demonstrate that Pt SA/ZrO 2 exhibits analogous PteO bond distance (2.01 A) to PtO 2 but lower coordination number (3.4 0.7).The surface chemical states of the Pt SA/ZrO 2 are further analyzed by XPS.As shown in Fig. 2c, the 4f 7/2 peak of Pt in Pt SA/ ZrO 2 locates at 72.3 eV higher than Pt 0 (71.6 eV) but lower than PtO (73.0 eV) and PtO 2 (74.6 eV), suggesting Pt SAs have an oxidation state that does not reach 4 29,30. Moreover, the Raman spectra of AeZrO 2 and Pt SA/ZrO 2 were compared to investigate the chemical connection of the SAs with the matrix.The AeZrO 2 has four broad characteristic peaks at 223 cm A1 , 347 cm A1 , 475 cm A1 , and 640 cm A1 , which are consistent with the reported data for amorphous ZrO 2 and confirm the amorphous nature of the matrix (Fig. 2d) 31.Some Raman peaks of Pt SA/ZrO 2 were shifted after the loading of Pt on the AeZrO 2 surface (Fig. 2d), indicating that the Pt atoms were embedded in the matrix and formed new PteO bonds 32.These results suggest that the O atoms of amorphous ZrO 2 anchor the Pt SAs. The photocatalytic CO 2 reduction performances were evaluated to demonstrate the availability of Pt SAs on the amorphous matrix surface and confirm the efficiency of photoelectron transfer under simulated solar light.Before that, we conducted Fourier transform infrared spectroscopy to exclude the existence of PVP, which may have an impact on the catalytic results (Fig. S3) and prepared crystal ZrO 2 nanowires (CeZrO 2 ) as a counterpart to highlight the advantages of the amorphous matrix in the photocatalytic system (Fig. S4).As expected, the photocatalytic efficiency of AeZrO 2 (12.86 mmol/g/h) was much higher than that of CeZrO 2 (6.02 mmol/ g/h; Fig. 3a), which can be attributed to the intrinsic features of the amorphous phase, such as its appropriate band structure and abundant reactive sites.When Pt SAs were anchored on AeZrO 2 , the photocatalytic reduction rate of CO 2 to CO increased to values as high as 16.61 mmol/g/h.This reduction rate is outstanding among the cases of the previously reported ZrO 2 -based CO 2 reduction photocatalysts (Table S3).Four cycle experiments were carried out to investigate the stability of the Pt SA/ZrO 2 , and the photocatalytic reduction rate is only slightly reduced (Fig. 3b).This may be because of a small amount of active oxygen vacancies being occupied during the catalytic process 7,33.We found that the activity can be restored by simple vacuum drying 7,34.Meanwhile, constructing surface oxygen vacancies as stable sites can prevent the leaching and aggregation of isolated metal atoms (Fig. S5).Thus, Pt SAs can still be observed on the surface of AeZrO 2 nanowires after the photocatalysis test (Fig. S6).On the other hand, the Pt SA/ZrO 2 exhibited a superior catalytic selectivity of 97.6 than counterparts (Fig. 3c), indicating that the SA loading positively affects selectivity. As selectivity is an important criterion for further application, we reconfirmed it by more cycles and found the selectivity has not changed (Fig. S7).In addition, as a competitive product, hydrogen is negligible in our catalysis system.These results should stem from special atomic configuration of our catalyst and well-built gasesolid reactive interface that suppresses the evolution of byproducts.Furthermore, the CO production yield kept increasing for 4 h and reached values up to 54.0 mmol/g (Fig. 3d) apparently larger than those of counterparts.The previously mentioned results indicate that the synergistic effect of the amorphous matrix and Pt SAs is beneficial for improving the photocatalytic reduction of CO 2 . Three main processes should be considered to conceptualize a plausible mechanism explaining the high photocatalytic transformation efficiency and CO product selectivity of Pt SA/ZrO 2 : light absorption, photogenerated carrier migration, and interfacial CO 2 transformation 35.First, the light absorption capacities of AeZrO 2 , CeZrO 2 , and Pt SA/ZrO 2 were evaluated using diffuse reflectance spectroscopy.The introduction of oxygen vacancies on the AeZrO 2 surface could improve the utilization of light, in contrast with CeZrO 2 (Fig. S5) 36.In particular, the light absorption capacity of Pt SA/ZrO 2 was further enhanced after introducing the Pt SAs.It exhibits a noticeable trailing phenomenon throughout the test waveband, which involves the transition from O2p to Pt4f and the energy level of the intermediates (Fig. 4a) 11.Moreover, the band gaps of Pt SA/ZrO 2 were 4.71 eV as per Tauc plots (Fig. 4b), which are narrower than those of CeZrO 2 (5.20 eV) and AeZrO 2 (4.92 eV).In general, a narrower band gap is beneficial to the improvement of photocatalytic activity. In addition, the flat band potentials (Fb) of AeZrO 2 , CeZrO 2 , and Pt SA/ZrO 2 were calculated using MotteSchottky curves (Fig. 4c) 37.The Fb of AeZrO 2 and CeZrO 2 vary with the degree of crystallization, and the newly introduced metal SAs readjust the structure of the energy level.Hence, the Fb of Pt SA/ZrO 2 was moved forward (A1.27V to A1.15 V vs. Ag/AgCl).This positive Fb shift indicates that the introduction of the Pt SACs improves the conductivity of the photocatalyst and reduces the photocatalytic overpotential 11.Generally, the Fb of an n-type semiconductor is close to the conduction band (CB; lower than approximately 0.1 V) 12, and it can be controlled by the electron effective mass and carrier concentration.The CBs of AeZrO 2 , CeZrO 2 , and Pt SA/ZrO 2 are A0.67 V, A1.09 V, and A0.55 V vs. E(NHE) (E(NHE) 14 E (Ag/ AgCl) 0.6 V), respectively.The band gaps, the energy band structures of various samples, and the redox potential of partial reactions are shown in Fig. 4d.Although the CB of Pt SA/ZrO 2 is shifted to higher value compared with that of AeZrO 2 , it still satisfies the thermodynamic requirements for the reduction reactions of CO 2 /CO (A0.53 V) and CO 2 /CH 4 (A0.24V) 38.According to the photocatalytic performance reported in Fig. 3a, the decrease of CB for Pt SA/ZrO 2 did not negatively impact the catalytic efficiency, demonstrating that the outstanding CO 2 reduction performance is related to the introduction of Pt SAs and is independent of the CB of these materials. The separation efficiency of the photogenerated electron (e A )e hole (h ) pairs was studied by PL tests to understand the underlying roles of the Pt SAs in the electron transfer process.The PL intensity of AeZrO 2 was found to be lower than that of CeZrO 2. The PL intensity of Pt SA/ZrO 2 decreased after the introduction of the Pt SAs (Fig. 4e), indicating that the defect sites and the presence of SAs can significantly decrease the recombine efficiency of the photogenerated e A eh pairs 39,40.Based on these results, it can be assumed that the Pt SAs are responsible for the formation of bridges between the amorphous matrix and the reactant that promote the photogenerated e A transfers.Furthermore, Pt SA/ZrO 2 demonstrates lowest arc radius in EIS spectra, suggesting introduction of Pt SAs can effectively reduce the charge transfer resistance (Fig. 4f) 41.The low recombination efficiency of the photogenerated e A eh pairs and low transport resistance of the charge carriers favor the catalytic reaction, which leads to better photocatalytic activity of Pt SA/ZrO 2 for CO 2 reduction compared with CeZrO 2 and AeZrO 2 . Finally, the reaction mechanism diagram is shown in Fig. 5.It describes the particular electron migration path for CO 2 adsorption and activation during the photoreduction process and the structures of the reaction intermediates.The mechanism of CO 2 reduction is composed of the CO 2 adsorption at the active sites, CO 2 reduction by photogenerated e A , and CO desorption 11,21,42.The high affinity of AeZrO 2 matrix and its abundant oxygen vacancies lead to the adsorption of large amounts of CO 2 , providing the necessary reactants for the photocatalytic reduction processes 21.When CO 2 is adsorbed by the oxygen vacancies of the photocatalyst, it is immediately converted to CO 2 , which is the first step of the CO 2 activation process.Then, under irradiation by a 300 W xenon lamp, the Pt SA/ZrO 2 promotes the decomposition of water to form photogenerated protons (H ), which react with the CO 2 intermediate products to generate COOH.In this process, the AeZrO 2 matrix provides abundant photogenerated e A , and the Pt SAs can ensure the rapid transformation of photogenerated e A , which significantly improves the catalytic efficiency.The We believe that the reported AeZrO 2 has abundant defect sites and special surface chemical states that can easily absorb CO 2 molecules (Figs.S8e10 and Table S4).Furthermore, PteOeZr bridge can be built when the Pt SAs connect to the amorphous matrix, which will promote the transfer of the photogenerated e A .Finally, the conversion of CO 2 is completed at the SACs sites 42.Therefore, we proved that the synergistic effect of the amorphous matrix and SAs could improve the efficiency of CO 2 conversion."
  },
  {
    "title": "Conclusions",
    "content": "In summary, a Pt SA/ZrO 2 hybrid catalyst was successfully synthesized by anchoring Pt SAs onto amorphous ZrO 2 nanowires.The amorphous ZrO 2 nanowires have abundant oxygen defects that can coordinate and stabilize the Pt SAs.These defects also facilitate the formation of PteOeZr charge bridges, effectively improving the light absorption capacity of the material and photogenerated electron transport efficiency.These properties significantly increase the effective utilization of photoelectrons, enhance the formation of intermediate products, and promote CO desorption.As a result, the CO yield and selectivity of the Pt SA/ZrO 2 can reach 16.61 mmol/g/h and 97.6, respectively, which are higher than those of AeZrO 2 and CeZrO 2 and are outstanding in the previously reported ZrO 2 -based photocatalysts.This study provides a novel and informative method to design a model of amorphous base SAC and build new surface electron transport pathways that significantly enhance the activity, selectivity, and durability of photocatalysts. Fig. 1.(a) Preparation of AeZrO 2 and loading process of Pt SA.(b) SEM image of AeZrO 2 and the inset is relevant high magnification SEM image of AeZrO 2 .(c) SEM of Pt SA/ZrO 2 and the inset is relevant high magnification SEM image.(d) TEM image of Pt SA/ZrO 2 , the inset image is corresponding SAED.(e) HRTEM image of Pt SA/ZrO 2 .(f) ACTEM of Pt SA/ZrO 2 .(g) EDS mapping of a single Pt SA/ZrO 2 nanowire. Fig. 2. (a) Pt L 3 -edge XANES and (b) k 3 -weighted FT-EXAFS spectra for Pt SA/ZrO 2 , whereas Pt foil and PtO 2 are used as references.(b) Pt L3-edge EXAFS spectra in R space for Pt SA/ ZrO 2 , Pt foil, and PtO 2 were used as reference.(c) Pt 4f 7/2 XPS of Pt SA/ZrO 2 .(d) Raman spectra of AeZrO 2 and Pt SA/ZrO 2 . Fig. 3. Catalytic performance.(a) Photocatalytic products of CO 2 reduction over AeZrO 2 , CeZrO 2 , and Pt SA/ZrO 2 under visible light illumination for 2 h.(b) Photocatalytic stability of CO production over Pt SA/ZrO 2 under visible-light irradiation for four cycles and the vacuum drying activity recovery process.(c) Selectivity of AeZrO 2 , CeZrO 2 , and Pt SA/ZrO 2 toward CO and CH 4 .(d) Photocatalytic process of CO production over AeZrO 2 , CeZrO 2 , and Pt SA/ZrO 2 under visible-light irradiation for 4 h. Fig. 4. (a) UVevis DRS spectra.(b) Tauc plots.(c) MotteSchottky.(d) Photoelectron transfer path diagram under different systems.(e) PL emission spectra.(f) EIS spectra. Fig. 5. Photocatalytic CO 2 conversion schematic diagram of Pt SA/ZrO 2 system under visible-light irradiation. This work was supported by the National Natural Science Foundation of China (51772011, 51802010, 52073008, 52102360), the National Key RD Program of China (2020YFA0710403), China Postdoctoral Science Foundation Funded Project (2019TQ0020, 2019M660398, BX20200025, 2021M690282, 2019TQ0013 and 2020M670088).S.D., W.L., and S.L. contributed equally to this work. Authors' contribution L.G., H.Z., and S.D. designed this work.W.L., J.L., S.L., F.L., J.H., R.H., and X.B. prepared the samples and performed the morphology and structure analysis.L.G., H.Z., S.D., J.L., W.L., and S.L. wrote the article.All authors discussed the results and provided useful feedback on the manuscript.S.D. contributed to conceptualization.W.L. contributed to data curation and writing.S.L. contributed to formal analysis.F.L. contributed to visualization.J.H. contributed to investigation.R.H. and X.B. contributed to resources.H.Z., J.L., and L.G. contributed to supervision. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://doi.org/10.1016/j.mtnano.2021.100157."
  }
]