[
  {
    "title": "Doi",
    "content": "10.1016/j.cplett.2016.03.027"
  },
  {
    "title": "Article_Title",
    "content": "Enhancement of photocatalytic activity in reducing CO2 over CdS/g-C3N4 composite catalysts under UV light irradiation"
  },
  {
    "title": "Abstract",
    "content": "The polymeric graphite-like carbon nitride (g-C 3 N 4 ) and CdS/g-C 3 N 4 composites of different mass fractions were synthesized via polycondensation and hydrothermal methods, respectively.XRD, SEM-EDS, TEM, UV-vis and PL were applied to characterize the structure, morphology and optical properties of the as-prepared CdS/g-C 3 N 4 composites.The photocatalytic activities of the catalysts were evaluated by the reduction of CO 2 in methanol solution to form methyl formate.The results indicated that the photocatalytic activities of the CdS/g-C 3 N 4 composites were improved significantly compared with that of the pure CdS and g-C 3 N 4 .The highest activity appeared at mass ratio 1:2 of CdS:g-C 3 N 4 ."
  },
  {
    "title": "Experimental",
    "content": "All of the reagents, urea, cadmium nitrate (Cd(NO 3 ) 2 4H 2 O), thioacetamide, and methanol were commercially available and used without further purification. The polymeric graphite-like carbon nitride (g-C 3 N 4 ) was synthesized by simple pyrolysis of urea without the assistance of a template 32.In a typical synthesis, 15 g of urea powder in a quartz crucible with a cover were dried at 80 C for 4 h, then heated at 550 C for 3 h at a rate of 10 C min -1 in a muffle furnace.After the muffle furnace naturally cooled down to room temperature, the product of light yellow in the crucible was collected and ground into powder for further use. The CdS/g-C 3 N 4 photocatalysts were synthesized by a facile hydrothermal progress.First, 0.1 g of g-C 3 N 4 powder was added into a 100 mL round-bottomed flask containing 30 mL deionized water and magnetically stirred for 1 h.Then, 7 mL of 0.1 M Cd(NO 3 ) 2 4H 2 O aqueous solution and 7 mL of 0.15 M thioacetamide aqueous solution were transferred into the suspension containing g-C 3 N 4 powder, then, the round bottomed flask was connected to circulating water, and the seam was sealed with teflon thin films.Subsequently, the CdS/g-C 3 N 4 composite with the mass ratio of 1:1 was obtained under continuous stirring for 5 h at 90 C. Finally, the product was centrifuged, washed with deionized water and ethanol respectively for several times and dried at 60 C for 24 h.In the same procedure, the CdS/g-C 3 N 4 photocatalysts with various mass ratios of 1:2, 1:3, 1:4, 1:5 were synthesized.The pure CdS was prepared under the same condition except adding g-C 3 N 4 . The crystalline phases of CdS/g-C 3 N 4 composites were analyzed by powder X-ray diffraction (XRD, D/Max-2500, Rigaku with Cu X-ray radiation) at a scanning speed of 4 min -1 in range of 2A 10 -75 .The morphologies and structure were examined by field emission scanning electron microscope (FE-SEM, ZEISS-Merlin compact), and transmission electron microscopy (TEM, Tecnai G2 F20).The chemical composition of the samples was determined by a SEM energy dispersion spectrum (EDS).The UV-vis diffuse reflectance spectra were captured by Shimadzu UV-2550 spectrophotometer using BaSO 4 as a reference in wavelength of 200-800 nm.Photoluminescence (PL) spectra of the samples were measured on the Fluorescence Spectphotometer (Hitachi F-7000).The samples were excited at a wavelength of 325 nm to measure the emission spectrum.The wavelength and strength of light source was measured by spectrum analyzer (Taiwan UPRtek MK350). The photocatalytic activity of the CdS/g-C 3 N 4 with various mass ratios was evaluated by photocatalytic reduction of CO 2 in a batch slurry reactor 33, where light transmitted a quartz window from above and cooling water circulated in jacket, and also two connectors for bubbling CO 2 into the catalyst suspended methanol solution to saturation.The reaction temperature was controlled at 20 3 C by using a thermostatic water bath.And the reactor was illuminated by a 250 W lamp with the main wavelength of 365 nm.In one test, 20 mg photocatalyst and 20 mL methanol were added into the reactor.CO 2 was bubbled into the slurry of photocatalyst and methanol at a flow rate of 200 mL/min for 30 min under magnetic stirring. Then the reactor was totally sealed, and the lamp was turned on.10 h later, the clear solution was separated centrifugally from the slurry and analyzed by hydrogen flame detector (FID) of GC (SCION 456-GC).Blank tests were carried out under the same condition except for no ultraviolet radiation or no catalysts."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Figure 1 shows the XRD patterns of the pure g-C 3 N 4 , CdS and CdS/g-C 3 N 4 composites with various mass ratios.The XRD pattern of pure g-C 3 N 4 exhibited two peaks at 27.5 and 13.1 , corresponding to the (002) and the (100) diffraction planes respectively 34.And the XRD pattern of the pure CdS presents six main peaks at 26.4 , 30.6 , 43.9 , 52.0 , 54.5 , 63.8 , 70.3 , which could be exactly indexed as the monoclinic structure (JCPDS: 65-2887).The highangle peak at 26.4 was characteristic of CdS, which was indexed to the (111) peak corresponding to the average interlayer distance of d 0.337 nm.It could be clearly seen that CdS maintained its crystal pattern in the CdS/g-C 3 N 4 composite.With the increase of g-C 3 N 4 proportion in the CdS/g-C 3 N 4 , the intensities of the peak at about 27.5 were strengthened, but peaks of g-C 3 N 4 at 13.1 were hardly observed in the CdS/g-C 3 N 4 composites, which meant (100) facet of g-C 3 N 4 to be decreased or weakened by CdS addition. Figure 2 shows the SEM images of g-C 3 N 4 , CdS, CdS/g-C 3 N 4 (1:2) and the EDS spectrum of the CdS/g-C 3 N 4 (1:2) composite.In Figure 2a, the flaky morphology of pure g-C 3 N 4 was observed clearly.Figure 2b displays nanospheres of pure CdS with the sizes of about 200 nm.In Figure 2c andd, some bright nanospheres of CdS were dispersed on the g-C 3 N 4 and kept almost the same size as that in Figure 2b.Furthermore, the SEM-EDS test indicated C, N, Cd, S elements to be detected. The TEM images of the CdS/g-C 3 N 4 (1:2) composites are shown in Figure 3.The sizes of the dark color CdS spheres were about 200 nm, and g-C 3 N 4 looked like two-dimensional flake.Moreover, the spherical CdS closely attached to the g-C 3 N 4 , suggested the heterojunction being formed, which was crucial for electron transfer inter-particle of two semiconductors.Figure 3c shows the HR-TEM image of CdS/g-C 3 N 4 photocatalysts.The lattice fringes had a spacing of 0.338 nm, which corresponded to the (111) crystallographic planes of CdS (JCPDS: 65-2887).The light gray part was ascribed to g-C 3 N 4 , which had been evidenced by some reports in HRTEM 9,35,36.Based on the analysis above, we were firmly certain that the CdS and g-C 3 N 4 nanocrystal heterojunction was synthesized in the composite. The optical properties of the as-prepared CdS/g-C 3 N 4 composites were measured in by UV-vis spectroscopy and shown in Figure 4, the pure g-C 3 N 4 of Figure 4A shows the maximum adsorption wavelength being 460 nm.The composite catalysts all had absorption to ultraviolet light, and the adsorption edges of CdS/g-C 3 N 4 composites located in the visible region, between those of g-C 3 N 4 and CdS.With the relative contents of CdS in the CdS/g-C 3 N 4 composites increasing, the adsorption edges exhibited red shifts, Therefore, the CdS/g-C 3 N 4 composites could absorb much more visible light. The optical band gap (Eg) of a semiconductor could be calculated from the equation of h A(h -Eg) n/2 , where h was the photon energy, Eg was the band gap energy, was the absorption coefficient, and A was a constant relative to the material.Moreover, n was either 1 (for a direct transition) or 4 (for an indirect transition), which depended on the type of the transition in a semiconductor.For CdS and pure g-C 3 N 4 , n were equal to 1 and 4, respectively.In Figure 4A, we could rough estimate that the direct band gap of pure CdS showed a red shift compared to the typical band gap of the CdS crystal (2.42 eV).Generally speaking, this might be influenced by many factors such as particle size, morphology, size distribution and charge density, etc. 37.Accordingly, as shown in Figure 4B, the band gap of pure g-C 3 N 4 was around 2.70 eV, and it was consistent with the value reported before 38.The band gaps of the CdS/g-C 3 N 4 composites were kept between 2.15 eV and 2.30 eV as shown in Figure 4B. The photocatalytic activities of the CdS/g-C 3 N 4 composites were evaluated by photocatalytic reduction of CO 2 in methanol to form methyl formate (MF).Figure 5 shows the mean reaction rates on various mass ratios of catalysts under the ultraviolet radiation for 10 h under CO 2 atmosphere and the corresponding control experiments under Ar atmosphere.It could be clearly seen the CdS/g-C 3 N 4 composites possessing higher photocatalystic activities than those of pure CdS and pure g-C 3 N 4 at the same catalyst dosages, which attributed to the heterojunction restraining the recombination of photogenerated electrons and holes.In addition, with increase of the mass ratio of CdS in the CdS/g-C 3 N 4 composites, the mean reaction rates appeared maximal 1352.07 mol/h/g cat at the mass ratio of CdS/g-C 3 N 4 to be 1:2.The much higher CdS content would decline the mean reaction rate due to agglomeration of CdS nanospheres on the g-C 3 N 4 39. The contrasting experiments were carried out without ultraviolet radiation or no catalysts besides the other conditions unchanged, no MF was detected.Such blank tests certified photocatalytic reaction did occur.Second comparative experiments by replacing CO 2 to Ar showed the mean appearance rates of MF slowing down in Figure 5, which indicated the MF mainly from CO 2 .Meanwhile, in the condition of bubbling Ar, the rates of MF were almost the same, thus deducing that catalysts had little effect during these control experiments.Through the above analysis, we believed that CO 2 indeed was reduced to MF in methanol solution. The PL emission is induced by the recombination of photogenerated electrons and holes.The higher PL peaks partly mean the higher recombination probability of photogenerated electrons and holes, in other words, the photogenerated electrons and holes are difficult to be separated, which will lead to lower photocatalytic activity.In order to further confirm the photocatalytic reduction of CO 2 to be proceed, the PL of pure g-C 3 N 4 and the CdS/g-C 3 N 4 composites were analyzed and their spectra at an excitation wavelength of 325 nm are shown in Figure 6.It was clearly seen that the emission peak of the g-C 3 N 4 appeared at around 460 nm which was consistent with that of UV-vis analysis.Moreover, for three different mass ratios of CdS on g-C 3 N 4 , with the increase of mass ratio, the intensity of emission declined obviously.The CdS/g-C 3 N 4 (1:2) showed weakest intensity of emission peak, which indicated the recombination of photogenerated electrons and holes to be largely inhibited.Therefore, the CdS/g-C 3 N 4 (1:2) expressed the highest formation rate in Figure 5.By now we convince that the heterojunction plays an important role in enhancing the photocatalytic activity. In practical applications, a good stability would prolong the life time of catalysts.The stability of CdS/g-C 3 N 4 in photocatalytic reduction of CO 2 was evaluated by reusing CdS/g-C 3 N 4 after each batch without any treatment.In Figure 7a the CdS/g-C 3 N 4 was used three times, its activity had slowly decline, but the formation rate of MF was maintained around 1200 mol/h/g cat .Figure 7b exhibited the XRD patterns of CdS/g-C 3 N 4 (1:2) composite before and after being used three times.There were some slight peak changes in the XRD patterns of CdS/g-C 3 N 4 (1:2), but the main peaks were detected and remained unchanged, demonstrating that CdS/g-C 3 N 4 composite was stable during the photocatalytic reaction process. The as-prepared CdS/g-C 3 N 4 photocatalysts exhibited enhanced photocatalytic activity for the reduction of CO 2 in methanol under illumination.Based on the above characterizations and analyses, the enhanced photocatalytic performance was mainly attributed to restraining the recombination of photogenerated electron-hole pairs and extending wavelength range of light absorption 40.The reaction mechanism of photocatalytic reduction of CO 2 to MF in methanol is suggested in Figure 8. The potentials of conduction band E CB and the valence band E VB of the as-prepared CdS and g-C 3 N 4 were calculated by the empirical equations 41: E CB X -Ec -0.5Eg; E VB E CB Eg where X was the absolute electronegativity of the semiconductor, Ec was the energy of the free electrons under standard hydrogen electrode potential (4.5 eV) and Eg was the band gap energy.The CB flat band potential and the VB flat band potential of CdS were -1.0 V and 1.4 V vs. normal hydrogen electrode (NHE) at pH 7 42, respectively, and the CB and VB flat band potentials of g-C 3 N 4 were -1.13 V and 1.57V vs. normal hydrogen electrode (NHE) at pH 7 35, respectively.Both CdS and g-C 3 N 4 could be easily excited by ultraviolet illumination (365 nm, 3.4 eV) and generate photoelectrons and holes. Since the E CB of g-C 3 N 4 (-1.13V) was more negative than that of CdS (-1.0 V), the photoinduced electrons on the g-C 3 N 4 were easily shifted to CdS via the well built heterojunction between CdS and g-C 3 N 4 .Some of the photoinduced electrons on the g-C 3 N 4 could also neutralize the holes on the CdS, thus promoting the separation of photoinduced electrons and holes in CdS.The consumption of holes protests CdS from corrosion, prolonging the service life of CdS/g-C 3 N 4 .Meanwhile, the photoelectrons on CdS were more negative than E 0 (CO 2 /HCOOH) (-0.61 V) and E 0 (CO 2 /HCHO) (-0.48 V) 42, which made the reduction of CO 2 to formic acid and formaldehyde to be possible.Here, methanol acted as sacrificing agent to balance holes on VB of g-C 3 N 4 and as reactant to react with the produced formic acid to form MF by esterification.The MF could also be produced from dimerization of formaldehyde via Tishchenko reaction 43.Moreover, the valence band potential of the g-C 3 N 4 was more positive than E 0 (CH 3 OH/ CH 2 OH) (0.927 V), whose hole oxidized methanol to formaldehyde.MF could be produced by methanol dehydrogenation, but the yield was much lower than that by the reduction of CO 2 as the control group results shown in Figure 5.This might explain why MF was produced in the absence of CO 2 .Through our analysis about the photocatalystic mechanism, we concluded the main mechanism in reaction equations as follows: Photo excitation of catalyst: g-C 3 N 4 Reactions on conduction band: CO"
  },
  {
    "title": "Conclusions",
    "content": "The g-C 3 N 4 synthesized by the polycondensation method was combined with CdS by a simple hydrothermal method without using any templates, the obtained CdS/g-C 3 N 4 composites consisted of flaky g-C 3 N 4 and uniformly loaded CdS nanospheres.After evaluating their activities of photocatalytic reduction of CO 2 and comparing with pure CdS and pure g-C 3 N 4 , we found the photocatalytic activities of the composites to be significantly improved by forming heterojunction.When the mass ratio of CdS:g-C 3 N 4 was 1:2, the photocatalytic activity reached the highest value of 1352.07 mol/h/g cat .Notably, the CdS/g-C 3 N 4 composite photocatalyst showed sufficient stability under illumination, and it could be at least reused for 3 times.Photogenerated electrons transferred from CB of g-C 3 N 4 to neutralize the holes at the VB of CdS, protecting CdS from being oxidatively etched, thus, enhancing the stability of the composites.Conventional band gap theory was used to explain the reaction mechanism. Figure 1.XRD patterns of catalysts: (a) pure g-C3N4, (b) pure CdS, (c) CdS/g-C3N4 (1:1), (d) CdS/g-C3N4 (1:2), (e) CdS/g-C3N4 (1:5). Figure 2. SEM images of (a) pure g-C3N4, (b) pure CdS, (c, d) CdS/g-C3N4 (1:2), (e) EDS spectrum of the selected area of CdS/g-C3N4 (1:2) sample. Figure 3. TEM images of (a) CdS/g-C3N4 (1:5), (b) CdS/g-C3N4 (1:2), (c) HRTEM image of CdS/g-C3N4 (1:2). Figure 4. (A) UV-vis diffuse reflectance spectra.(B) ( h ) 1/2 versus the photon energy.(a) CdS/g-C3N4 (1:1), (b) CdS/g-C3N4 (1:2), (c) CdS/g-C3N4 (1:3), (d) CdS/g-C3N4 (1:4) and (e) CdS/g-C3N4 (1:5). photoca tal ysts Figure 6.Photoluminescence (PL) spectra of (a) g-C3N4, (b) CdS/g-C3N4 (1:5), (c) CdS/g-C3N4 (1:3) and (d) CdS/g-C3N4 (1:2). Figure 7. Reuse times of CdS/g-C3N4 (1:2) composite and XRD patterns of fresh and reused CdS/g-C3N4 (1:2) composite. Figure 8. Mechanism of the photocatalytic reduction of CO2 in methanol over the CdS/g-C3N4 composites. CH 3 OH HCOOH HCOOCH 3 H 2 O 2 4e - 4H HCHO H 2 O (4)Reaction on valence band:CH 3 OH h VB CH 2 OH H (5) CH 2 OH h VB HCHO H (6)Total reaction of generating MF: We genuinely appreciate financial support by the National Natural Science Foundation of China (NSFC, No. 21176192)."
  }
]