[
  {
    "title": "Doi",
    "content": "10.1016/j.ijhydene.2021.01.024"
  },
  {
    "title": "Article_Title",
    "content": "Synthesis of Au/UiO-66-NH2/Graphene composites as efficient visible-light photocatalysts to convert CO2"
  },
  {
    "title": "Abstract",
    "content": "h i g h l i g h t s g r a p h i c a l a b s t r a c t Synergy of Au/UiO-66-NH 2 /GR nanocomposite in photocatalytic CO 2 reduction.Au-NPs enhanced the light absorption due to its surface plasmon resonance effect.Graphene suppressed the recombination of photogenerate e A /h pairs.Heterostructures accelerate the photocatalytic CO 2 reduction reaction rate.The possible reduction mechanism of the nanocomposites was discussed."
  },
  {
    "title": "Experimental",
    "content": "2-amino-terephthalic acid and zirconium (IV) chloride were purchased from Sigma-Aldrich, Reagent-grade N, N-dimethylformamide (DMF) and methanol were obtained from the Sinopharm Chemical Reagent Co., Ltd and used without treatment.Chloroauric Acid was also purchased from the Sinopharm Chemical Reagent Co., Ltd.Graphene was got from the Nanjing XFNANO Materials Tech Co.,Ltd. The composite photocatalyst UiO-66-NH 2 /GR was fabricated according reported solvothermal method 43.In a typical synthesis, before the experiment, 50 mL N, N-dimethylformamide (DMF) was prepared firstly in a jar bottle, then 2.0 graphene (2.0 mg graphene) was added in the bottle.The solution was stirred and ultrasonicated for 30 min respectively, then the 90 mg 2-amino-terephthalic acid and 120 mg zirconium (IV) chloride were dissolved in the DMF, along with stirring for 15 min and ultrasonication for another 15 min.The formed mixed solution is then transferred to a 100 mL Teflonlined stainless-steel autoclave.The autoclave was heated in a hot oven at 120 C for 24 h.After cooling down to room temperature, the sample was washed and centrifugated through methanol, DMF and ethanol for several times and put it in the vacuum oven for 12 h at 60 C. The as-obtained composite photocatalyst was named as UiO-66-NH 2 /GR. Preparation of photocatalysts Au/UiO-66-NH 2 /GR and Au/ UiO-66-NH 2 First, the HAuCl 4 aqueous solution was prepared.The 1 g of HAuCl 4 solid was dissolved in 500 mL deionized water with stirring (concentration of the solution is 2 g/L).The solution was then transferred to 500 mL brown volume bottle, wrapped in tinfoil paper on the outer wall and carefully placed in 4 C refrigerator (prevented oxidation discoloration). A quantity of the composite photocatalyst mentioned above was weighed and dispersed in a complex solution containing 40 mL water and 10 mL of methanol (reducing agent).Afterwards, different content of the as prepared HAuCl 4 solution (Theoretical load volume is 2e10, The specific quantity is 2 14 1.255 mL; 4 14 2.51 mL; 6 14 3.765 mL; 8 14 5.02 mL; 10 14 6.275 mL; the weight of UiO-66-NH 2 /GR is 60 mg) was added in the complex solution.The mixture was degassed under nitrogen for 15 min in the ice water bath.After that, the air intakes and vents are closed, then it was put under visible light with stirring for different time.The illumination time range is 15 mine90 min respectively.The obtained sample was then centrifuged and washed with water and ethanol for 3 times respectively.The final product was dried under vacuum drying oven at 80 C for 24 h.The as-obtained composite photocatalyst was named as Au/UiO-66-NH 2 /GR. As a reference, the Au/UiO-66-NH 2 was obtained through the first procedure of fabricating the UiO-66-NH 2 , then the 60 mg UiO-66-NH 2 was adopted to deposite the Au nanoparticles, the experimental parameters were kept identical with previous. X-Ray Diffraction (XRD) patterns of the samples were collected on X'pert MPDPro (Panalytical Co.) diffractometer using Cu Ka radiation (40 kV, 40 mA) to analyze the crystal phase of the samples, 2 theta varied from 5 to 80 .Surface electronic states of the samples were performed by X-ray photoelectron spectroscopy (XPS, Thermo Scientific EscaLab 250Xi, Al-Ka), the binding energy values were calibrated using C 1s 14 284.6 eV as a reference.Morphologies of the products were studied through the field emission scanning electron microscopy (SEM), instrument: HITACHI SU6600 (Japan).More detailed information on the morphologies and energy dispersive spectrometer (EDS) spectra were acquired from a JEOL JEM2100 (Japan) high resolution transmission electron microscopy (HRTEM).The Brunauer Emmett Teller specific surface areas (BET) were studied on a Micromeritics ASAP 2020 device (USA) operating at liquid nitrogen temperature of A196 C. UVevisible (UVevis) diffused reflectance spectroscopies (DRS) were tested on a HITACHI UV4100 spectrometer (800 nm200 nm), reference: BaSO 4 .The apparent quantum yield was measured on Edinburgh FLS9 (China), Excitation range: 373 nme391 nm; Luminescence range: 392 nme801 nm. The electrochemical measurements were conducted on an electrochemical workstation (CHI 660D) in a three-electrode system.The photocatalyst was mixed with polyethylene glycol (PEG, MW 20000) and ethanol, then coated on the conductive surface of the FTO (active area of ca.4.0 cm 2 ) and served as the working electrode, before used, the coated FTO conductive glasses were dried at room temperature and calcined in a tube furnace (200 C, 2 h, N 2 atmosphere).The Platinum sheet was used as a counter electrode, a 500 W Xe lamp (l 400 nm) was employed as the light source, 0.50 mol/L Na 2 SO 4 aqueous solution was used as the electrolyte. The experiments were done under visible light irradiation using 500 W xenon lamp with cutoff filter (l 400 nm) by dispersing 0.02 g photocatalyst in a mixed solution (40 mL DMF, 5 mL triethanolamine-TEOA and 3 mL H 2 O).The homemade glass reactor was filled with mixture solution and bubbled with the mixing gas (Ar: CO 2 14 1:1) for 30 min.Then the reactor was exposed to the visible light illumination for 4 h at ambient temperature.The CO 2 reduction amount was calculated based on the following equation: CO 2 reduction amount 14 CeC 0 , where C 0 and C refer to the CO 2 amount determined before and after the reaction.\" The CO 2 was analyzed through gas chromatograph (Agilent Technologies: 6890N) with TCD detector (5A molecular sieve columns).Helium (99.999) was used as the carrier gas.The amount of H 2 was also determined on this gas chromatograph using N 2 as the carrier gas. The liquid product of formic acid was detected by ion chromatography.Ion chromatography (IC-1100) is equipped with CD detector, RFC-30 on-line electrolytic leaching fluid generator, Dionex ionpac AS18 4 A 250 mm chromatographic column."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Fig. 1(a) shows the XRD patterns of the as-synthesized samples.The diffraction peak of graphene appears at 2q 14 24.6 (002), indicating that it is reduced graphene.The characteristic peaks of UiO-66-NH 2 demonstrate the cube structure of nanoparticles 52, and all the diffraction peaks are sharp and strong, which portend its good crystallinity 53.The diffraction peak of graphene is undetected in the composite samples, due to its small loading content or overlapped with the peak of the UiO-66-NH 2 at 25.68 (224).New peaks at 38.3 (111), 44.5 (200), 64.7 (220), 77.8 (311) are well indexed to the cubic crystal phase of Au nanoparticles (JCPDS No. 04-0784) 54.Besides, the Au (111) plane is the most exposed facet in the photocatalysts system.According to the previous reports, the photocatalytic performance of Au-NPs decorated composites is dominated by the close-packed (111) planes, thus leading to the improved photocatalytic selectivity of CO 2 reduction 55.Moreover, the intensity of the diffraction peaks become stronger with increasing the Au loading content, as shown in Fig. S1(a).Notably, the peak position of UiO-66-NH 2 /GR has no noticeable change, suggesting the successful preparation of the composites.According the Scherrer's formula, the Au crystallite size distributions of samples from 2 Au to 10 Au are 18.9 nm, 22.2 nm, 23.5 nm, 23.7 nm and 23.9 nm, respectively 56.Besides, Raman spectra of different samples are illustrated in Fig. 1(b), where the D band peak and G band peak of reduced graphene are 1336 cm A1 and 1590 cm A1 respectively, in accordance with the previous report 57.After combining with the UiO-66-NH 2 and Au, the D band peak and G band peak are broadened, which illustrate that there is a strong interaction among the GR, UiO-66-NH 2 and Au during the synthesis process.The composites of UiO-66-NH 2 /GR and 6 Au/UiO-66-NH 2 /GR display similar peaks, but the intensity ratio of I(D)/I(G) has significantly changed, indicating that during the hydrothermal synthesis process, the size of the sp 2 domains decreased 58,59.The peak becomes broader and weaker after loading the Au, indicating the crystalline defects increased within the framework, and such defects may facilitate to capture the photoinduced electrons and inhibit charge recombination 60,61.This phenomenon can be easily found in the Raman spectra (Fig. S1(b)) from the Au content increased from 2 to 6.The tight contact through in situ growth process plays an important role in enhancing photocatalytic activity, this is dued to the increased contact area between GR and UiO-66-NH 2 with a face-to face orientation, which could support the charge separation, therefore leading to the excellent photocatalytic performance 62. Fig. 2(a) presents the SEM images of UiO-66-NH 2 /GR synthesized through the hydrothermal method.It shows UiO-66-NH 2 nanocrystals have high dispersibility after introducing GR than the pure UiO-66-NH 2 (Fig. S2) 43.Fig. 2(b) shows that the Au nanoparticles with high density are loaded on the UiO-66-NH 2 /GR composite, where the smaller and brighter particles are Au nanoparticles.It is further demonstrated by TEM images (Fig. 2(c andd)), it can be found that the Au-NPs are indeed unevenly dispersed on the UiO-66-NH 2 as well as GR, nevertheless, the composite still shows superior photocatalytic performance, as the Au-NPs deposited on the graphene, the Au-NPs could accelerate the transition of electrons, while as the Au-NPs deposited on the UiO-66-NH 2 , they could facilitate the reduction process.The low magnification of Au/ UiO-66-NH 2 /GR can be also clearly seen in Fig. S3(a andb).In order to get more microstructure information of the Au/UiO-66-NH 2 /GR nanocomposites, HRTEM and EDX mappings were performed.As shown in Fig. 2(e), the HRTEM image reveals clear lattice fringes with an interplane distance of 0.223 nm corresponding to the (111) lattice space of metallic Au nanoparticles 63.The more HRTEM images of ternary nanocomposite are presented in Fig. S3(c andd).In detail, according to the particle size distribution of 6 Au/UiO-66-NH 2 /GR sample (Fig. S4), it is found that the spherical Au-NPs with a diameter of 3e33 nm anchor on the surface of the UiO-66-NH 2 and GR.More information is found in the HRTEM and EDX element mapping images (Fig. S3(eej)), which clearly illustrates that the composite photocatalyst is consisted of C, N, O, Zr and Au element, it also demonstrates the successful combination of Au, UiO-66-NH 2 and GR.XPS measurements were carried out to ascertain the detail of surface chemical state of the samples.The survey spectrum (Fig. 3(a)) indicates that the composite sample is composed of C, N, O, Zr, Au.The curves of Zr 3d region (Fig. 3(b)) can be deconvoluted into two peaks for Zr 3d 5/2 (182.8 eV) and Zr 3d 3/2 (185.2 eV), which demonstrates the existence of Zr 4 52,64.The little shift indicates the strong interaction of the Au and GR on the UiO-66-NH 2 .The C 1s spectrum of UiO-66-NH 2 and UiO-66-NH 2 /GR (Fig. 3(c)) can be deconvoluted into three peaks located at 284.5, 285.1 and 288.5 eV 65.These three peaks can be assigned to the carbon components on the benzene ring, CC/CeC, CeNH 2 species and carboxylate (OeCO) groups respectively 39,66.As a result of the modification of Au, the C 1s spectra of 6 Au/UiO-66-NH 2 /GR shows a noticeable decrease in the relative intensity of the functional groups containing carboxylate (OeCO) group.Even more interesting, there is a slightly attenuation of CC peak in 6 Au/ UiO-66-NH 2 /GR composite, which may ascribed to the interfacial charge transfer from UiO-66-NH 2 to GR.The C 1s shifts a little and this indicates the vigorous interaction between the materials and generates the interfacial electric fields, also, the formed structure could accelerate the transition of electrons, therefore increasing the electron density of catalytically active sites 67,68. The N 1s (Fig. 3(d)) of 6 Au/UiO-66-NH 2 /GR is located at 399.0 eV, where no significant difference has been observed compared with that of UiO-66-NH 2 , suggesting that the NH 2 groups on the organic linkers can be retained after the hydrothermal processing 39.The high-resolution XPS spectrum of O 1s orbital can be fitted by two peaks at binding energies around 531.5 eV (Fig. 3(e)), which are attributed to the oxygen components on the carboxylate groups of the ATA linkers and the ZreO bonds of UiO-66-NH 2 .The O 1s of UiO-66-NH 2 /GR are located at 533.0 eV and 531.5 eV, while the O 1s of UiO-66-NH 2 and 6 Au/UiO-66-NH 2 /GR peaks are only located at 531.5 eV.It is inferred that the surface adsorption water had been replaced by the Au NPs 69.Fig. 3(f) shows two peaks at 87.6 and 84.0 eV, which are corresponding to Au 4f 5/2 and Au 4f 7/2 , respectively 70, verifying the formation of metallic Au.The detailed data of XPS results is summarized in Table S1, besides, the weight percentages of the elements in the optimal photocatalyst are obtained (seen in Table 1).The higher carbon and oxygen composition are founded in the composites which ascribed to the abundant existence of functional groups on the surface of GR sheets.It can further demonstrate that the UiO-66-NH 2 and Au nanoparticles are introduced into the system successfully. N 2 adsorptionedesorption isotherms and pore size distributions present the porous structure of the obtained composites.As Fig. 4(a) shown, the materials show type IV(a) isotherms 71, suggesting a mesoporous structure of composite materials 72.And they have a nearly H1 hysteresis loop, which is related to a compact structure of aggregated particles with uniform size and high connectivity between pores 73.Such a porous structure of composites could not only accelerate the mass transfer rate of reactants in photocatalytic process, but also give a high BET surface area.The UiO-66-NH 2 /GR nanocomposite has a relatively higher BET specific surface area (636.6 m 2 /g) than that of UiO-66-NH 2 (448.7 m 2 /g), but there is a decrease in the surface area of 6 Au/UiO-66-NH 2 /GR (604.0 m 2 /g), which was attributed to the loading of metal nanoparticles in the pores as well as on the surface of UiO-66-NH 2 74.The different samples are existed with mesopores (Fig. 4(b)), the various samples show the similar N 2 adsorptionedesorption isotherms and pore size distributions (Fig. S5(a andb)), which deduce that using the photo deposited method to deposite Au-NPs cannot alter the structure of UiO-66-NH 2 /GR.It is also found that the obtained samples belongs to the mesoporous materials.The detailed description and information of BET tests are given in Text S1 and Table S2.The surface area of composites could affect the photocatalytic activity and selectivity because the charge density of per unit area has been influenced and thus leads to superior photocatalytic performance.The UVeVis diffuse reflectance absorption spectra (DRS) of the samples are shown in Fig. 5(a).The UiO-66-NH 2 /GR absorbs the visible light around 420 nm, while the 6 Au/UiO-66-NH 2 /GR nanocomposites have significantly enhanced light absorption in the visible region and a new broadband peak appeared at 540 nm 50.It has been reported that SPR absorption of Au noble metal appears in near UVevis 75, and near or mid-infrared (IR) regions 76.The SPR is produced by the collective oscillations of extremely energetic electrons on the surface of Au.Therefore, the broad absorption band in the wavelength range around 520e610 nm is attributed to SPR effect of Au on UiO-66-NH 2 /GR 77,78.The bandgap of the samples is obtained according to the UVeVis DRS spectra (Fig. 5(b)), the bandgaps of UiO-66-NH 2 , UiO-66-NH 2 /GR and 6 Au/UiO-66-NH 2 /GR (Au content is 6) are calculated as 2.99 eV, 2.96 eV and 2.88 eV respectively.The improvement of visible-light absorption demonstrates that the Au-NPs could make full use of the visible light by the SPR effect and thus enhance the performance of photocatalytic reduction.The UVeVis DRS of the UiO-66-NH 2 /GR nanocomposites with various Au content are shown in Fig. S6.As the loading content of Au-NPs gradually increases, the light absorption is gradually improved dued to the strong SPR effect. The detailed data about the samples prepared with various loading content of Au are displayed in Table 2.When the loading content of Au is small, the SPR effect of Au-NPs cannot act on the overall photocatalyst.While the high content of Au-NPs could enhance the radiative recombination of long-lived SPR charge pairs 79,80.It is also likely that the excessive Au-NPs may seriously block the pore structure of UiO-66-NH 2 .The similar phenomena can be also found in previous report 81.As seen in Fig. 6(a), the activity and selectivity of the 6 Au/UiO-66-NH 2 /GR sample are much higher than that of UiO-66-NH 2 and UiO-66-NH 2 /GR.In addition, the composite samples prepared with different photoreduction time are shown in Table S3.The optimal time of photoreduction process is 60 min in this work.At the same time, the composite based on the UiO-66-NH 2 and Au nanoparticles was also fabricated.The comparable data are listed in Table S4 and the TEM image of Au/UiO-66-NH 2 is presented in Fig. S7.It is obvious that the UiO-66-NH 2 nanoparticles are aggregated together and the Au nanoparticles are deposited on the surface of UiO-66-NH 2 .The low dispersion of UiO-66-NH 2 results in weak interaction with CO 2 and leads to inferior CO 2 absorption.The ternary composites exhibit high photocatalytic performance.This is mainly caused by GR as an electron acceptor with superior conductivity, which could improve electron transfer and inhibit the recombination of photoinduced electron-hole pairs.Besides, the graphene could improve the dispersibility of UiO-66-NH 2 so as to expose more active sites and strengthen the absorption of CO 2 .The introduction of GR could also strengthen the contact effect and synergy effect among different samples.Moreover, Au nanoparticles could act as antenna and capture visible light efficiently because of SPR effect.To further demonstrate this result, the photocatalytic activity of the different samples were measured under the l 14 450 nm and l 14 550 nm.As shown in Table S5, the 6Au/UiO-66-NH 2 /GR exhibits photoactivity of CO 2 reduction, while the UiO-66-NH 2 has no activity over the photocatalytic reduction of CO 2 .The results confirm that visible light capture efficiency is enhanced due to the surface plasmon resonance generated by Au nanoparticles and therefore boost the photocatalytic performance.The photocatalytic performance of the obtained composite is compared with the previous graphene-based photocatalysts (Table 3).Compared to other materials, the photocatalytic performance of the obtained photocatalyst in this work far outweighs the others. The reduction of CO 2 and hydrogen evolution of different samples are shown in Fig. 6(b).The CO 2 reduction and H 2 generation are competitive process.Through the parallel analysis, it is fascinating to see that the obtained composites could effectively enhance the CO 2 reduction and inhibit the H 2 generation.Both reach their own peak when the Au content is 6, the hydrogen production is minimal (12.5 mmol) while the reduction of carbon dioxide is maximum (49.9 mmol).The apparent quantum yield of 6 Au/UiO-66-NH 2 /GR nanocomposites is 6.19, which is almost 4.5 times higher than UiO-66-NH 2 (1.45). The photo-stability of the sample 6 Au/UiO-66-NH 2 /GR was evaluated by performing the recycled experiments under identical conditions (see Fig. 6(c)).The composite exhibits workable photocatalytic performance after seven recycles without any noticeable loss in the CO 2 reduction.The morphology and structure of photocatalyst after the reusability test show no clearly change, as shown in Figs.S8 andS9, the Au and UiO-66-NH 2 particles are still deposited on the surface of graphene and the morphologies are well maintained.These outcomes indicate that the as-prepared photocatalyst has excellent stability and reusability. Further measurements were carried out for understanding the mechanism of the enhanced charge separation properties.The PL spectra and time-resolved PL spectra were employed to directly and qualitatively elucidate the recombination rate of photogenerated electrons and holes 88.The PL spectra of samples are shown in Fig. 7(a).The emission peaks at about 475 nm can be attributed to the transition from p-LP states 89.The PL emission intensity sharply decreased after loading Au-NPs.The 6 Au/UiO-66-NH 2 /GR exhibits the lowest signal, which indicates the efficient charge separation of photoinduced e A -h pairs and thus improves the photocatalytic performance 90.The results are also confirmed by the timeresolved PL spectra in Fig. 7(b).Its properties governing three major processes in photocatalytic reactions (that is, light absorption, charge separation and transfer, and surface redox reactions) 89.In comparison to UiO-66-NH 2 /GR, 6 Au/UiO-66-NH 2 /GR shows an increased long (t1), short (t2), and increased intensity-average (t) PL lifetimes, the detailed data of time-resolved PL results is summarized in Table S6, indicating that the introducing of Au-NPs and GR can effectively suppress the charge recombination, elongate the lifetime of charge carriers and enhance the separation of long-lived SPR charge pairs 91.This is dued to the following reasons: (1) the decorated Au-NPs can capture the transferred photoelectrons and promote the charge separation, it could absorb the light with wavelength longer than 470 nm, so as to extend the visible-light responses.In addition, as the Au-NPs deposited on the UiO-66-NH 2 /GR, a Schottky junction will be formed owing to their different work functions, which will cause the bending of energy band and thus suppress the recombination of electrons and holes 49,92; (2) the GR is favorable for the UiO-66-NH 2 nanocrystals with high dispersity and high conductivity which facilitate the transmission of photoelectrons.Except for the measurements mentioned above, the charge pair recombination and photocatalytic activity of the composite samples can be further demonstrated through the Photoelectrochemical (PEC) test.Fig. 7(c) shows the photocurrent of the as-prepared samples.The photocurrent value alternatively increases to maximum and decreases to minimum corresponding to the light turn-on and turn-off, which could be attributed to the instinct properties of all the semiconductors.The photocurrent intensity of 6 Au/UiO-66-NH 2 / GR is much higher than that of the UiO-66-NH 2 /GR and UiO-66-NH 2 .It implies the highest electron transport efficiency under the visible light irradiation 93.Notably, the photocurrent has a little attenuation in the subsequent illuminations than the former cycles, which is attributed to the sluggish regeneration of Au based composites, thus the charge separation rate is decreased and the photocurrent becomes lower 94.In addition, the charge separation and transfer progression can be also confirmed through the Electrochemical Impedance Spectra (EIS) measurement (Fig. 7(d)).The 6 Au/UiO-66-NH 2 /GR sample exhibits smaller arcs than the UiO-66-NH 2 /GR and UiO-66-NH 2 in the Nyquist plots, which indicates that the lower charge transfer resistances and effective charge separation of the ternary composite.This result further supports the role of GR and Au nanoparticles, to be specific, the introduction of GR could transfer the charge efficiently.When the UiO-66-NH 2 combined with the Au and GR together, the arc radius is the smallest, indicating that the fastest charge transporting and the longest service life of charge carriers.Namely, the ternary composite can absorb more photons in the visible light region, it can efficient transfer the charge across the interface and therefore improve the photocatalytic activity 95.The EIS results are in line with the PL and photocurrent response studies. To further study the mechanism of samples, the Mott-Schottky plots were recorded based on the impedance measurements (Fig. 8(a andb)).The positive slop indicates that the obtained composites are n-type semiconductors.The Fermi level of 6 Au/UiO-66-NH 2 /GR is about A0.50 eV, so the conduction band (CB) is A0.70 eV, as the CB of n-type semiconductors is 0.20 eV negative than the Fermi level 96, while the CB of pure UiO-66-NH 2 is A0.35 eV.The band gap between the samples was calculated according to the modified Kubelka-Munk function of absorbed light E 97, and the band gap of 6 Au/UiO-66-NH 2 /GR is 2.88 eV.Based on the results mentioned above, the electronic energy band and plasma excitation scheme are shown in Fig. 8(c).When the photocatalyst of 6 Au/UiO-66-NH 2 /GR is exposed to visible light, the photoexcited electron-hole pairs are generated in UiO-66-NH 2 and the electrons are transferred to the CB of UiO-66-NH 2 , while the holes reserved in the VB of UiO-66-NH 2 .The electrons are further transferred to the surface of GR and take part in the photocatalysis process.To shed light on electrons transfer from UiO-66-NH 2 and load on graphene, we carried out density functional theory (DFT) calculations of their density of states 98,99.The computational details are presented in Text.S2.As Fig. S10 shown, HOMOs of both UiO-66-NH 2 and graphene are near Fermi level, while LUMO of graphene is much closer to Fermi level than that of UiO-66-NH 2 . The results indicate that electron transfer preferentially takes place from UiO-66-NH 2 to graphene, in accordance with experimental observations.The reduction of CO 2 can be expected to conduct via a multi-electron transfer process assisted with the H protons, the direct reduction of CO 2 to HCOOH through 2-electron mechanism, which is easier than the formation of other products.The CB position of 6 Au/ UiO-66-NH 2 /GR is higher than the reduction potential of CO 2 / HCOOH (A0.61 eV) 100.It provides a stronger ability for photo-reducing CO 2 , and the Au-NPs could efficiently conduct the electrons to CO 2 and have the ability to facilitate the CO 2 reduction even at low overpotentials which has been reported in the groups of Cuenya 101,102.In this photocatalytic system, the TEOA plays the vital role of the sacrificial reductant in CO 2 reduction 103.Because of these advantages, the asobtained composite photocatalysts have superior performance of reducing CO 2 . Based on the above experiments and discussions, a possible working mechanism is proposed.The catalyst has three absorption models of CO 2 -, O-Lewis alkaline; C-Lewis acid and CO-Lewis acid bases.The different bonding configurations may lead to various reaction mechanisms and pathways, in this case, the selectivity of products is thus influenced.In terms of HCOOH, the O of CO 2 tends to react with Lewis acid, while the C of CO 2 reacts with H atoms and formed HCOO A , then the HCOO A combines with protons to generate the HCOOH.As the CeO bond of CO 2 is not easily broken up, so the final product is HCOOH.The detailed probable procedures of HCOOH generation are shown as following formulas.One electron is transferred from UiO-66-NH 2 to CO 2 and form the bent CO 2 bidentate firstly.Then followed by an electron and a proton transfer to the C atom and form HCOO A .A second proton transfer then completes the formation of HCOOH, where one OeZr bond is broken and the O atom is protonated 104. As a typical MOF, UiO-66-NH 2 nanoparticles have abundant Lewis acid sites as well as large surface area, pore volume and bulkier functional groups 34,105,106.These merits allow UiO-66-NH 2 have superior ability to capture CO 2 , the abundant Lewis acid will react with the O of CO 2 and the C of CO 2 would react with H atoms and formed HCOO A , in this case, the HCOOH is efficient formed and the selectivity is enhanced.In addition, the density of photogenerated electrons on the surface of photocatalysts can dynamically influence the rate of surface catalytic reactions, and then affect the product selectivity of the overall reaction.The density of surface photogenerated electrons mainly depends on the separation efficiency of photogenerated electrons and holes in photocatalysts 3.Enhancing the charge separation efficiency in photocatalysts is also an important tool to improve the product selectivity. The graphene can improve the dispersibility of UiO-66-NH 2 so as to expose more active sites and thus enhance the absorption of CO 2 .It could also increase the probability of electrons to be transported to the interface of composites attributed to its high charge carrier mobility and huge surface area, therefore accelerating the generation of HCOOH 103.As the Au-NPs deposited on the UiO-66-NH 2 /GR, a Schottky junction will be formed owing to their different work functions (UIO-66-NH 2 is 4.8 eV 107; pure Au is 5.3 eV 74; graphene is 5.0 eV 108, which will cause the bending of energy band and thus can suppress the recombination of electrons and holes 49,92.Specifically, the difference between the Fermi energy of the combined system and the vacuum level becomes the work function.E f 14 E vac -W F., where E F is the Femi Level of the material, Evac is the energy level under vacuum, W F is the work function.In photoexcitation, the electrons will transport from UIO-66-NH 2 to graphene.More electrons are accumulated on the GR rather than the Au-NPs dued to the change of Fermi-level.In this nanocomposite, UiO-66-NH 2 is the primary photocatalytic material, the Au-NPs could give rise to the visible light capture dued to the SPR effect.Under exposure of solar light, the electrons are transferred to the CB of UiO-66-NH 2 and the holes are consumed by the sacrificial agent.Upon the formation of ternary composite, hot electrons will transfer via the interface between the UiO-66-NH 2 , Au and GR driven by the difference of band alignments 109.In this case, the transportation of electrons would lead to the decrease of the electronic density of UiO-66-NH 2 and the increase on the surface of GR.As a result, an internal electric field was formed between the UiO-66-NH 2 and GR.The built-in electric field can facilitate the transition of electrons and thus suppress the recombination of electrons and holes.Given the analysis above, the photocatalytic selectivity and activity are enhanced significantly.This work inspires more enthusiasm to construct photocatalysts based on MOFs and be utilized for effectively reducing CO 2 to other valuable chemicals."
  },
  {
    "title": "Conclusions",
    "content": "In summary, Au/UiO-66-NH 2 /GR nanocomposites were successfully prepared first via the hydrothermal method to introduce the GR and then followed a photoreduction process to deposit the Au-NPs.A strong visible light absorption and Raman spectra shift of composite were presented owing to the characteristic SPR effect of Au nanoparticles.The composites exhibited excellent photocatalytic performance over CO 2 reduction under visible-light.Particularly, the 6 Au/UiO-66-NH 2 /GR exhibited the highest CO 2 activity and selectivity among different samples.The improvement of photocatalytic performance was ascribed to the UiO-66-NH 2 has high specific surface area and large pore volume; the Au-NPs have plasma excitation, which could extend visible light-absorption range and enhance the harvesting intensity of visible light; GR sheets could accept and transfer electrons superbly, the charge separation could be promoted attributing to the fast transportation of charge carriers on the GR, besides, the GR could also enhance the dispersibility of UiO-66-NH 2 and thus lead to the superior capture of CO 2 ; A strong junction and synergetic effect among different materials were strengthened and thus lead to superior photocatalytic performance.This work provides a promising method to fabricate highly efficient photocatalyst, which could be also used in the field of clean energy production, solar water splitting and other photocatalytic systems. Fig. 1 e XRD patterns (a) and Raman spectra (b) of the as-synthesized samples. Fig. 2 e SEM, TEM, HRTEM and mappings images of composites of UIO-66-NH 2 /GR synthesized through hydrothermal method and Au/UiO-66-NH 2 /GR at different magnification; SEM images of UiO-66-NH 2 /GR synthesized through hydrothermal method (a), Au/UiO-66-NH 2 /GR (b); TEM images of UiO-66-NH 2 /GR synthesized through hydrothermal method (c), Au/UiO-66-NH 2 /GR (d), HRTEM of interface in the composites (e). Fig. 3 e XPS survey spectra of different samples (a), high resolution spectra of Zr 3d (b), C 1s (c), N 1s (d), O 1s (e) and Au 4f (f). Fig. 4 e N 2 adsorption/desorption curves (a) and pore size distributions (b) of the as-prepared samples. Fig. 6 e The evolution and selectivity of formic acid under visible-light (l 400 nm) irradiation (a); The reduction of CO 2 and hydrogen evolution of different samples (b); The reduction of CO 2 over sample 6 Au/UiO-66-NH 2 /GR after seven cycles (c). Fig. 7 e PL spectra (a); Time-resolved PL spectra (b); Photocurrent spectra (c) and Electrochemical impedance spectroscopy (d) of UiO-66-NH 2 , UiO-66-NH 2 /GR and 6 Au/UiO-66-NH 2 /GR. Fig. 8 e Mott-Schottky plots according to impedance measurements (aeb); The schematic diagram for electrons transfer mechanism for photocatalytic CO 2 reduction over photocatalysts (c). Element composition (). The activity of the samples prepared with various of loading content of Au. Photoreduction of CO 2 over graphene-based photocatalysts. i n t e r n a t i o n a l j o u r n a l o f h y d r o g e n e n e r g y 4 6 ( 2 0 2 1 ) 1 1 6 2 1 e1 1 6 3 5 This work was supported by National Natural Science Foundation of China (51978569, 51908458), China Postdoctoral Science Foundation (2019M650264), and Xi'an Beilin District Science and Technology Plan Project of China (GX2019).Y. Su acknowledge the \"Young Talent Support Plan\" of Xi'an Jiaotong University and the supercomputing facilities supported by HPC Platform, Xi'an Jiaotong University. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://doi.org/10.1016/j.ijhydene.2021.01.024. i n t e r n a t i o n a l j o u r n a l o f h y d r o g e n e n e r g y 4 6 ( 2 0 2 1 ) 1 1 6 2 1 e1 1 6 3 5"
  }
]