[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2017.08.016"
  },
  {
    "title": "Article_Title",
    "content": "Well-designed 3D ZnIn2S4 nanosheets/TiO2 nanobelts as direct Z-scheme photocatalysts for CO2 photoreduction into renewable hydrocarbon fuel with high efficiency"
  },
  {
    "title": "Abstract",
    "content": "The 3D ZnIn2S4/TiO2 composite photocatalyst is prepared by two steps for CO2 reduction. The CH4 production rate of ZnIn2S4/TiO2 is about 38-times higher than pure ZnIn2S4. The supposed mechanism of the excellent performance is due to a Z-Scheme system."
  },
  {
    "title": "Experimental",
    "content": "Fabrication of TiO2 nanobelts: TiO2 nanobelts were obtained using a previously reported procedure. 27Typically, P25 (0.4 g) was immersed in NaOH solution (80 mL, 10 M) and stirred for half hour.After sonication for another half hour, the suspension was transferred into a 100 mL Teflon container in a steel keeping at 180 C for 48 hours.The resulting gel was filtered, washed repeatedly with deionized water, and then dissolved in HCl (0.1 M) solution for 48 hours, and H2Ti3O7 nanobelts obtained.The H2Ti3O7 nanobelts were then dispersed in a 100 mL Teflon container containing solution of H2SO4 (0.02 M) and kept at 100 C for 12 hours in an electric oven. Finally, the as-synthesized sample was collected, washed thoroughly with deionized water and finally sintered at 600 C for 2 hours, resulting in TiO2 nanobelts. Synthesis of ZnIn2S4/TiO2: In a typical experiment, ZnIn2S4 nanosheets were synthesized by the modified method reported previously, 37 and the ZnIn2S4/TiO2 heterostructures at various mole ratios (0.25:1, 0.33:1, 0.50:1 and 1:1) were synthesized.Specifically, ZnCl2 (0.25-1 mmol), and InCl34H2O (0.5-2 mmol) and thioacetamide (TAA, 1-4 mmol) were dissolved in 20 mL ethylene glycol and stirred half hour at room temperature, to which an appropriate amount (1 mmol) of asprepared TiO2 nanobelts was dispersed by sonication for another half hour.The above mixture was maintained in the autoclave with a capacity of 25 mL and heated to 120 C for 2 hours.At last, the products were washed with water and absolute ethanol and dried at 70C.Products with different amounts of ZnIn2S4 ranging from 0.25 to 1 mmol were denoted as ZIS-0.25/TO,ZIS-0.33/TO,ZIS-0.50/TO and ZIS-1/TO, respectively.For comparison, bare ZnIn2S4 nanosheets were also prepared following a similar procedure in the absence of TiO2 nanobelts. Characterizations: X-ray diffraction (XRD) data of the as-synthesized samples were recorded by a Bruker D8A A25X X-ray diffractometer system using Cu K ( 0.15406 nm) radiation.The morphologies of the prepared samples were performed using a HITACHI S-4800 instrument.High-resolution transmission electron microscopy (HR-TEM) and energy-dispersive X-ray spectroscopy (EDS) were applied to investigate the microstructure using a JEOL JEM-2010 instrument (HR-TEM operated at 200 kV).The UV-Vis diffuse reflectance spectra (DRS) of the samples were tested on a TU-1901 double beam spectrophotometer.The photoluminescence (PL) spectra were measured on a high-resolution multi-function imaging spectrometer (FLS 980) and time-resolved photoluminescence (TRPL) measurements were conducted on a Fluorolog-3 Transient State Fluorescence Spectrometer.X-ray photoelectron spectroscopy (XPS) was performed on an K-Alpha spectrometer (THERMO FISHERSCIENTIFIC).Measurement of Photocatalytic CO2 conversion: Photocatalytic CO2 reduction was investigated under simulated sun-light.A 300 W Xe lamp was used as light source with the electric current at 10 A. The measurements were performed in a gastight system.First, high purity of CO2 gas was injected into the vacuumed reaction system.Then 0.4 mL of deionized water was added into the reactor.Before light irradiation, CO2 and H2O gases were occupied for several hours for the equilibrium of CO2 and H2O gases and make sure the adsorption-desorption equilibrium between the photocatalyst (about 0.1 g samples) and gases.The gas products from photocatalytic reactions were periodically monitored and analyzed using gas chromatography (GC-2014, Shimadzu Corp, Japan)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The XRD patterns of the as-synthesized ZnIn2S4/TiO2 samples with different amounts of ZnIn2S4 are shown in Figure 1.The crystallographic structure of bare ZnIn2S4 and TiO2 are also given for comparison.The X-ray peaks of the TiO2 powder are in good agreement with anatase phase (JCPDS, No. 21-1272), while the diffraction peaks of ZnIn2S4 are identical to that of the hexagonal-phase (JCPDS No. 65-2023). 36,37 oth TiO2 and ZnIn2S4 phases are observed in the ZnIn2S4/TiO2 composites.Moreover, with the increase in ZnIn2S4 loadings, the intensity of the diffraction peaks of ZnIn2S4 increased, along with the appearance of some impurity peaks.These results confirm the co-existence of ZnIn2S4 and TiO2 in the composites materials. The scanning electron microscopy (SEM) images of TiO2 with different molar ratios of ZnIn2S4 and TiO2 can be seen in Supplementary Information.Figure S1a indicates that the surface-coarsened TiO2 nanobelts with several micrometers in length provide abundant nucleation sites that can be used for assembling another material.The ZnIn2S4 synthesized with the hydrothermal self-assemble method consists of monodispersed uniform microspheres with flower-like morphologies (Figure S1b).After growing with layered ZnIn2S4 ultrathin nanosheets, the 3D ZnIn2S4/TiO2 structures with fibrous morphology are formed, which is expected to facilitate the transfer of electrons between these two semiconductor materials.The composite photocatalysts with different molar ratios are presented in Figure S1c-f.The transmission electron microscope (TEM) images of the final synthesized powder materials are shown in Figure 2(a-c).It can be seen that the 2D ZnIn2S4 nanosheets grow uniformly on the surface-coarsened 1D TiO2 nanobelts.The HR-TEM images further confirm the close linkage between ZnIn2S4 nanosheets and TiO2 nanobelts.The marked lattice spaces of 0.30 and 0.36 nm are in good agreement with the (102) plane and (101) planes of hexagonal ZnIn2S4 and anatase TiO2, respectively. 3839940 Besides, the selected area electron diffraction (SAED) image shows two kinds of characteristic spots, which corresponds to the (102) planes of hexagonalphase ZnIn2S4, and the (101) planes of tetragonal anatase TiO2 (Figure 2d).The TEM image in Figure 2e displays scaly ZnIn2S4/TiO2 composite photocatalyst.A large number of ZnIn2S4 nanosheets of 100-200 nm in width are well distributed on the surface of TiO2 nanobelts.The ZnIn2S4 nanosheets can improve the visible-light absorption in ZnIn2S4/TiO2 composite.Moreover, the 3D structures could shorten the charge transfer time and distance and lead to higher photo-electric conversion efficiency. 26The ZnIn2S4/TiO2 composite structure can be further confirmed in the EDS mappings analysis (see inset of Figure 2(f)).The corresponding elemental mappings of Ti are virtually identical with O, which is clear formed the TiO2 substrates structure.Furthermore, the uniformly distributed elemental mappings of Zn, In, S are similar to each other, and no other elements were detected, which confirms the coexistence of ZnIn2S4 and TiO2.In addition, the chemical composition of the ZnIn2S4/TiO2 composite is supported by energy disperse spectroscopy (EDS) (see Supplementary Figure S2).The TEM analysis of TiO2 nanobelts and ZnIn2S4/TiO2 composite with different molar ratios are shown in Supplementary Information (Figure S3). The X-ray photoelectron spectra (XPS) spectra of TiO2, ZnIn2S4 and ZnIn2S4/TiO2 are show in Figure 3.All signals attributable to Ti, O, Zn, In and S are observed for the ZIS-0.33/TiO2nanocomposite.In addition, a weak peak for all samples located at 283.5 eV may be attributed to adventitious carbon derived from the atmospheric CO2 on the sample surface or from the carbon tape utilized during sample preparation.The survey XPS spectra of other samples with different molar ratios are similar to ZIS-0.33/TiO2 (see Supplementary Figure S4).To thoroughly investigate the interaction between TiO2 and ZnIn2S4 in the ZnIn2S4/TiO2 nanocomposites, high resolution XPS spectrum were obtained as shown in Figure 4. Compared with bare TiO2, the binding energy of as-fabricated nanocomposites is neither changed for Ti2p region, nor for O1s.The characteristic peaks for binding energies located at 1022.5 (Zn2p3/2), 452.4 (In3d3/2), 445.2 (In3d5/2), 161.9 (S2p3/2) and 162.8 eV (S2p1/2) can be found from the pristine ZnIn2S4 in Figure 4(ce), which are fully consistent with values reported in literature 31,41,42 and illustrate the existence of valence states of Zn 2 , In 3 and S 2-, respectively. 43However, after modification with ZnIn2S4, binding energies of Zn, In and S elements show a slight shift towards lower binding energy, indicating that the binding energies of the core level electrons of these metal and sulfide ions are changed.The results seem to suggest relatively strong interaction between TiO2 and ZnIn2S4. UV-Vis DRS of TiO2, ZnIn2S4/TiO2 and ZnIn2S4 are given in Figure S5.The absorption edge of pure TiO2 nanobelts and ZnIn2S4 nanosheets was 380 nm and 467 nm, respectively.According to Tauc formula h A(h -Eg) n/2 , the band gap of TiO2 and ZnIn2S4 are estimated to 3.26 and 2.65eV, respectively.Upon the growth of thin ZnIn2S4 nanosheets on the surface of TiO2 nanobelts, a redshift DRS of ZnIn2S4/TiO2 composite was observed obvious, and the color of the composite photocatalyst becomes light yellow, which is mainly due to the intrinsic band gap absorption of ZnIn2S4 nanosheets. 44 understand the role between ZnIn2S4 nanosheets and TiO2 nanobelts, the surface area and porosity of bare ZnIn2S4, TiO2 and ZnIn2S4/TiO2 composites have been investigated, as displayed in Figure S6.The BET surface areas of ZnIn2S4/TiO2 composite materials are measured to be 45.6 m 2 g -1 , higher than that of TiO2 nanobelts (39.9 m 2 g -1 ) and ZnIn2S4 nanosheets (23.0 m 2 g -1 ) (see Supplementary Table 1).This kind of porous 3D heterostructure is supposed to be not only beneficial for incident light absorption and photogenerated electron mobility, but also more sites on the surface for adsorption and photoreduction of CO2, which improving the photocatalytic CH4 evolution activities. The photocatalytic measurements for CO2 reduction into CH4 were performed under simulated sunlight irradiation.Figure 5a displays the photocatalytic CH4 evolution using TiO2, ZnIn2S4 and ZnIn2S4/TiO2 composite with different molar ratios.The pristine TiO2 nanobelts or ZnIn2S4 nanosheets clearly exhibit poor photoreduction activities.For the ZnIn2S4/TiO2 composite photocatalyst, there is great improvement of CH4 generation.After 8 hours of UV-visible light irradiation, the CH4 yield is 1.69, 9.08, 4.01 and 0.90 molg -1 for ZIS-0.25/TO,ZIS-0.33/TO,ZIS-0.50/TO and ZIS-1/TO, respectively.The corresponding CH4 production rate of individual ZnIn2S4 nanosheets is measured only about 0.029 molg -1 h -1 .While the CH4 production rate of ZIS-0.33/TO(1.135 mol g -1 h -1 ) is 39-times higher than that of pristine ZnIn2S4 under UV-visible light irradiation (Figure 5b).The significantly enhanced photocatalytic activity of the ZnIn2S4/TiO2 composite may be the result of improved light and absorption and more effective separation of photoexcited electrons and holes pairs. 4546647 It was also observed that the amount of ZnIn2S4 affects the CH4 evolution activity, partly because the content of ZnIn2S4 has great influence on the light absorption as well as charge transfer with TiO2. Meanwhile, in the photoreaction proceeded, the CO production is apparent, but the H2 yield is hardly detected (see Supplementary Figure S7).Therefore, it could be inferred that the production of CH4 and CO is from CO2 photoreduction over ZnIn2S4 loaded on TiO2.However, no oxidative product is detected can be attributed to that O2 stops at the status of adsorbed O2 -(a form of -Ti-O-O-Ti-), which coincides with the previous study. 48 further understand the mechanism of enhanced of photocatalytic activity of ZnIn2S4/TiO2 composite, the PEC measurements of all samples were performed.As shown in Figure 6a, the ZIS-0.33/TOcomposite photocatalysts exhibit enhanced photocurrents (35 A/cm 2 ) compared with ZnIn2S4 nanosheets (8 A/cm 2 ) or TiO2 nanobelts (16 A/cm 2 ).This is in accordance with the highest photocatalytic reduction of CO2 into CH4 under UV-visible light.This trend is attributed to the intimate interfacial contacts between ZnIn2S4 and TiO2 in the nanocomposites that facilitates interfacial charge transfer and enhances charge separation.In addition, a reasonable current signal is also observed under the visible-light irradiation (Figure 6b).The above photocurrent results suggest that ZnIn2S4 materials can effectively generate photoinduced electrons and without recombining with holes in ZnIn2S4/ TiO2 composite material In order to investigate the transfer mechanism of electrons (e -) and holes (h ) between TiO2 and ZnIn2S4, the bandedge positions of conduction band (CB) and valence band (VB) of the two semiconductor were measured by Mott-Schottky measurement, which can directly probe the energy positions of TiO2 and ZnIn2S4. From Figure 6c,d, the CB and VB edges of TiO2 nanobelts are found to be -0.12eV and 3.14 eV (vs.NHE), and the CB and VB edges of ZnIn2S4 nanosheets are -0.65 eV and 2 eV (vs.NHE), respectively.The X-ray photoelectron spectroscopy (VB-XPS) results further confirm band position, which consistent with Mott-Schottky results (see Supplementary Figure S8 and Table 2).In general, the transfer of the photogenerated electrons or holes between these two semiconductors is regarded as the type-II heterostructure mechanism due to the energy match of TiO2 and ZnIn2S4.Both TiO2 and ZnIn2S4 can be excited and generate the electrons/holes pairs under UV-visible light irradiation.The ECB of ZnIn2S4 (-0.65 eV) is more negative than that of TiO2 (-0.12 eV), thus the excited electrons in ZnIn2S4 could directly be injected into the CB of TiO2 (see Supplementary Figure S9).Meanwhile, the photogenerated holes in TiO2 could easily be transferred to the VB of ZnIn2S4 since the VB position of ZnIn2S4 is much lower than that of TiO2.However, for CO2 and H2O photoreduction reaction, the lowest reduction potential required for CO2 to be converted into CH4 is E -0.24 eV vs normal hydrogen electrode (NHE) ( CO 2 8e - 8H CH 4 2H 2 O ). 21If the photogenerated electrons in ZnIn2S4 are injected into the CB of TiO2, the accumulated electrons in the CB of TiO2 could not reduce CO2 into CH4 because the CB position of TiO2 has a reduction potential (-0.12 eV) lower than that required for the reduction of CO2.Hence, we infer that it is impossible for the ZnIn2S4/TiO2 type-II heterostructure photocatalyst to induce direct reduction of CO2 into CH4. The charge transfer mechanism of the present ZnIn2S4/TiO2 composite for the CO2 photoreduction can be proposed based on a direct Z-scheme photocatalytic system, as shown in Figure 7.When the ZnIn2S4/TiO2 heterojunction is irradiated by light, the electrons in TiO2 with a relatively low CB edge may recombine with the holes in ZnIn2S4 nanosheets that have a relatively high VB at the solid heterostructure interface.Consequently, more reductive electrons and oxidative holes would accumulate in the CB of ZnIn2S4 and VB of TiO2, thereby resulting in enhanced photocatalytic activity for reduction of CO2.To further elucidate the formation and transfer/transport dynamics of photoinduced charge carriers in the Z-scheme ZnIn2S4/TiO2 system, we carried out photoluminescence (PL) and time-resolved photoluminescence (TRPL) measurements on the samples excited at 266 nm by laser. As observed in Figure S10, the PL decay traces of ZnIn2S4 and TiO2 show short PL lifetime of 0.275 and 0.43 ns, respectively.However, the ZnIn2S4/TiO2 composite sample shows much longer PL decay lifetime, 1.212 ns.The prolonged decay lifetime suggests that the electron-hole recombination could be effectively prohibited for ZnIn2S4/TiO2, so the quantum efficiency of the samples is improved. 47Further research as shown in Figure S11a, it could be clearly seen that the TiO2 nanobelts show a wide peak at 470 nm, which possibly demonstrates that the excitonic PL mainly results from surface oxygen vacancies and defects, and several excitonic PL peaks can illustrate that the surface states or defects are abundant. 50The ZnIn2S4 nanosheets also exhibit four strong emission peaks at 470 nm, 560nm, 650 nm and 680nm, respectively.The PL peak at 470nm is attributed to band edge free exciton, and that at 560 nm, 650 nm and 680nm might due to the excitonic PL process resulting from defects. 51,52 oreover, it is very interesting that the shape of PL spectra of ZnIn2S4/TiO2 heterostructures is different from both TiO2 nanobelts and ZnIn2S4 nanosheets on the same condition.The band edge free exciton peak of ZnIn2S4 unchanged but the defects peaks disappeared.Besides, a new peak at 580 nm is appeared, which may be the outcome of combing with TiO2 nanobelts.More detailed information excited by 500 nm shown in Figure S11b, it can be seen that the emission peak of ZnIn2S4/TiO2 are shifted to 581 nm, which is almost equal to the band gap energy between VB of ZnIn2S4 and the CB of TiO2 nanosheets (2.12 eV). These results are consistent with the proposal that electrons in the CB of TiO2 nanosheets recombine with the holes in the VB of ZnIn2S4 in a Z scheme system. 23"
  },
  {
    "title": "Conclusions",
    "content": "In summary, a solar light-driven 3D Z-scheme photocatalyst by assembling ultrathin 2D ZnIn2S4 nanosheets onto 1D TiO2 nanobelts has been successfully demonstrated for photocatalytic reduction of CO2 into CH4.This artificial Z-scheme system shows a CH4 production rate up to 1.135 molg -1 h -1 , which is about 39-times higher than that of bare ZnIn2S4 (0.029 molg -1 h -1 ) nanosheets.This special 3D interfacial structure was shown to effectively promote the recombination of the photogenerated electrons of TiO2 nanosbelt with the holes of ZnIn2S4 nanosheets, resulting in an enrichment of photogenerated electrons in the conduction band of ZnIn2S4 and consequently higher photocatalytic reduction property.This study also provides new insight into the design and underlying mechanism of direct Z-scheme for enhanced photocatalysis. Photoelectrochemical measurements: Electrochemical and photoelectrochemical Fig.1 Fig.2 Fig.2 (a-b) TEM images of ZIS-1/TO (ZnIn2S4/TiO2 mol ratio 1:1); (c) HRTEM image of ZIS-0.50/TO(ZnIn2S4/TiO2 mol ratio 0.5: 1) and corresponding SAED pattern (d); (e-f) Selected area for elemental mapping images of Zn, In, S, Ti, and O elements of the ZIS-0.50/TO(ZnIn2S4/TiO2 mol ratio 0.5: 1) composite material. Fig.3 Fig.3 XPS survey spectra of the as-fabricated TiO2, ZnIn2S4 and ZIS-0.33/TO Fig.4 Fig.4 High resolution XPS spectra of the TiO2, ZnIn2S4 and ZIS-0.33/TO(ZnIn2S4/TiO2 mol ratio 0.33: 1) nanocomposites at different regions: (a) Ti2p, (b) O1s, (c) Zn2p, (d) In3d and (e) S2p Fig.5 Fig.5 Evolution activities (a) and CH4 generation velocity (b) over (1) ZnIn2S4 nanosheets; (2) ZIS-0.25/TO(ZnIn2S4/TiO2 mol ratio 0.25: 1); (3) ZIS-0.33/TO(ZnIn2S4/TiO2 mol ratio 0.33: 1); (4) ZIS-0.50/TO(ZnIn2S4/TiO2 mol ratio 0.50: 1); (5) ZIS-1/TO (ZnIn2S4/TiO2 mol ratio 1: 1); (6) TiO2 nanobelts This work is supported by the National Natural Science Foundations of China (Grant No.21577132), the Fundamental Research Funds for the Central Universities (Grant No. 2652015225)"
  }
]