[
  {
    "title": "Doi",
    "content": "10.1016/j.solmat.2016.07.001"
  },
  {
    "title": "Article_Title",
    "content": "Size-dependent role of gold in g-C3N4/BiOBr/Au system for photocatalytic CO2 reduction and dye degradation"
  },
  {
    "title": "Abstract",
    "content": "Surface plasmon resonance (SPR) and Z-scheme bridge are the most important roles of noble metal nanoparticles for photocatalysis.In this study, the size-dependent role of gold (Au) in Au/g-C 3 N 4 /BiOBr system was studied for photocatalytic CO 2 reduction and dye degradation.The results revealed that big Au nanoparticles mainly displayed Z-scheme bridge role, and g-C 3 N 4 /BiOBr/Au-B showed higher photocatalytic activity than g-C 3 N 4 /BiOBr under 380 nm monochromatic light irradiation.Small Au nanoparticles mainly displayed SPR role, and g-C 3 N 4 /BiOBr/Au-S showed higher photocatalytic activity than g-C 3 N 4 /BiOBr under 550 nm monochromatic light irradiation.The size-dependent role of Au nanoparticles for photocatalytic system should be due to the SPR effect of small Au nanoparticles and electron transfer center of big Au nanoparticles.This finding can guide us to prepare high photocatalytic activity noble metal loaded photocatalysts."
  },
  {
    "title": "Experimental",
    "content": "Bi(NO 3 ) 3 A 5H 2 O, KBr, thiourea, sodium citrate, AuCl 3 , KIO 3 , ethanol, methanol, AgNO 3 , p-benzoquinone (BQ), isopropanol (IPA), triethanolamine (TEOA), nitroblue tetrazolium (NBT) were analytically pure and purchased from Sinopharm Chemical Reagent Co., Ltd (Shanghai, China). g-C 3 N 4 : A classical synthesis procedure was carried out. 2 g of thiourea was put into a crucible with the cover.Then, it was annealed at 823 K for 3 h with a heating rate of 5 K min A 1 . BiOBr: It was prepared by previous methods 36.g-C 3 N 4 /BiOBr: 0.12 g Bi(NO 3 ) 3 A 5H 2 O was dissolved in 50 mL deionized water (pH 143, adjusting by adding HNO 3 ).0.064 g g-C 3 N 4 was dispersed in 50 mL cetyltrimethyl ammonium bromide (CTAB) solution (8 A 10 A 3 mol/L).Then Bi(NO 3 ) 3 A 5H 2 O solution were dropped in g-C 3 N 4 suspension.The suspension was stirred and heated in water bath at 353 K for 3 h.After completion of the reaction, the suspension was filtered.The precipitate was washed by absolute ethanol and deionized water for three times and transferred to oven to dry at 353 K for 24 h.g-C 3 N 4 /BiOBr/Au-B: 50 mg of g-C 3 N 4 /BiOBr were added into 100 mL of 0.08 AuCl 3 solution, and 5 mL methanol was added.Then, the suspension was irradiated by a by a 300 W, high-pressure xenon lamp (PLS-SXE300C, Beijing Perfect light Technology Co., Ltd China) under continuous stirring.After 2 h, the suspension was washed with deionized water and ethanol for several times, and dried at 353 K. g-C 3 N 4 /BiOBr/Au-S: 50 mg of g-C 3 N 4 /BiOBr were added into 100 mL of 0.08 AuCl 3 and 0.01 M sodium citrate solution was added.Then, the suspension was irradiated by a 300 W, highpressure xenon lamp (PLS-SXE300C, Beijing Perfect light Technology Co., Ltd China) under continuous stirring.After 2 h, the suspension was washed with deionized water and ethanol for several times, and dried at 353 K. X-ray diffraction patterns (XRD) of the samples were recorded at room temperature by a Bruker D8 advance X-ray diffractometer, using Cu K radiation and 2 scan rate of 6 min A 1 .Diffraction patterns were taken over the 2 range at 5-70 C.Transmission electron microscopy (TEM), high-resolution transmission electron microscopy (HRTEM) images and element mapping were obtained by a JEOL JEM-2100F (UHR) field emission transmission electron microscopy.X-ray photoelectron spectroscopy (XPS) measurements were carried out by Thermo ESCALAB 250XI X-ray Photoelectron Spectrometer (Al Ka, 150W, C 1s 284.8 eV).UV-vis diffuse reflectance spectra (DRS) were obtained using an UV-Vis spectrophotometer (Perkin Elmer, Lambda 650s, BaSO 4 as a reference). The photocatalytic activities of the samples were determined by measuring the degradation of RhB solution under visible light irradiation by a 300 W high-pressure xenon lamp (PLS-SXE300C, Beijing Perfect light Technology Co., Ltd China), with a 380 (710) or 550 (710) nm band filter to ensure the desired 380 and 550 monochromatic light.The typical photocatalytic degradation process is arranged as follows: 100 mL of 10 mg/L RhB aqueous solution was placed in a quartz glass beaker, and 20 mg of photocatalysts was added.Prior to light irradiation, the suspension was sonicated for 20 min and then magnetically stirred in the dark for 30 min to reach desorption-adsorption equilibrium.The suspension was kept under constant air-equilibrated conditions during irradiation.The suspension was vigorously stirred for continuous mixing during the process.At given time intervals, 4 mL of suspensions were sampled and centrifuged using a TGL-16G centrifuge (Shanghai Anting Scientific Instrument Factory, China) at 10,000 rpm for 15 min to remove the particles.The supernatant was analyzed by recording the maximum absorption band (554 nm for RhB) using a 721 spectrophotometer (Shanghai youke, China). The photocatalytic reduction of CO 2 was carried out in Labsolar-III AG closed gas system (Beijing Perfectlight Technology Co., Ltd China).0.10 g samples were uniformly dispersed onto a glass sheet with an area of 28.26 cm 2 , and then the glass sheet was put in a reaction cell (Pyrex glass).The volume of the reaction system was 350 mL.Prior to the light irradiation, the above system was thoroughly vacuum-treated to remove the air completely.Subsequently, 5 mL H 2 SO 4 (4 M) was injected into the reactor to react with 1.3 g NaHCO 3 to achieve 1 atm CO 2 gas.After that, the reactor was irradiated from the top by a 300 W high pressure xenon lamp (PLS-SXE300C, Beijing Perfectlight Technology Co., Ltd China) maintaining the photoreaction temperature at 15 C with DC-0506 low-temperature thermostat bath (Shanghai Sunny Hengping Scientific Instrument Co., Ltd China).At each time interval, about 1 mL of gas was taken from the reaction cell with subsequent qualitative analysis by GC9790II gas chromatography (GC, Zhejiang Fuli Analytical Instrument Co., Ltd China) equipped with a flame ionization detector (FID, GDX-502 columns).The quantification of CO and CH 4 was based on a calibration curve. For detecting the active species during photocatalytic activity tests, hydroxyl radicals (OH), superoxide radical (O 2 A ) and holes (h ) were investigated by adding 1.0 mM IPA (a quencher of OH), ) and 1 mM TEOA (a quencher of h ) 34,35, respectively.Replacing RhB solution in photocatalytic activity tests, NBT solution (2.5 A 10 A 5 mol/L, exhibiting an absorption maximum at 259 nm) was used to determine the amount of O 2 A generating from BiOBr-g-C 3 N 4 , g-C 3 N 4 /BiOBr/Au-B and g-C 3 N 4 /BiOBr/Au-S photocatalytic system.The production of O 2 A was quantitatively analyzed by detecting the concentration of NBT with a Lambda 650 s UV-vis spectrophotometer."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The X-ray diffraction patterns of g-C 3 N 4 /BiOBr, g-C 3 N 4 /BiOBr/ Au-B and g-C 3 N 4 /BiOBr/Au-S samples are showed in Fig. 1.Most of the XRD peaks are corresponding to BiOBr peaks.The peak observed at 2 around 27.8revealed the presence of g-C 3 N 4 on g-C 3 N 4 /BiOBr, g-C 3 N 4 /BiOBr/Au-B and g-C 3 N 4 /BiOBr/Au-S 36,37.Two peaks at 2 around 38.3(111) and 44.6(200) revealed the presence of metallic gold particles on g-C 3 N 4 /BiOBr 38,39.In addition, it was found that the half band widths (XRD peaks) of Au nanoparticles of g-C 3 N 4 /BiOBr/Au-S were larger than that of g-C 3 N 4 /BiOBr/Au-B.As shown in Fig. 1b, the half band width (2 at 38.3) of g-C 3 N 4 /BiOBr/Au-S and g-C 3 N 4 /BiOBr/Au-B were about 0.1and 0.8, respectively.Based on the Scherrer equation, the size of Au-B and Au-S should be 84 and 10 nm, respectively.It indicated that the Au size of g-C 3 N 4 /BiOBr/Au-S was smaller than that of g-C 3 N 4 /BiOBr/Au-B. Fig. 2a showed the TEM image of g-C 3 N 4 /BiOBr/Au-B.The BiOBr (red region), Au (blue region) and g-C 3 N 4 (other region) were shown clearly.The size of Au nanoparticles was 100-150 nm.For confirming the BiOBr, Au and g-C 3 N 4 , HRTEM images and element mapping were showed in Fig. 2b-d.The clear lattice fringe of 0.74 nm can be attributed to the (001) facets of BiOBr, and the amorphous region was g-C 3 N 4 (Fig. 2b).The clear lattice fringe of 0.23 nm can be attributed to the (111) facets of Au (Fig. 2c) 38,39.In Fig. 2d, element mapping of g-C 3 N 4 /BiOBr/Au-B displayed the uniform distribution of N and Bi element, while Au element was only appeared in one region with 100 nm in size.The results also indicated that the uniform Au nanoparticles in g-C 3 N 4 /BiOBr/Au-B were big nanoparticles. Fig. 3a showed the TEM image of g-C 3 N 4 /BiOBr/Au-S.The size of Au nanoparticles were 10-20 nm, which was much smaller than the Au size in g-C 3 N 4 /BiOBr/Au-B.In order to confirm the BiOBr, Au and g-C 3 N 4 , HRTEM images and element mapping were also showed in Fig. 3b-d.The clear lattice fringe of 0.74 nm can be attributed to the (001) facets of BiOBr, and the amorphous region was g-C 3 N 4 (Fig. 3b).This result was similar to the g-C 3 N 4 /BiOBr/ Au-B.The clear lattice fringe of 0.23 nm can be attributed to the (111) facets of Au (Fig. 3c).However, it also showed that the size of Au in g-C 3 N 4 /BiOBr/Au-S was much smaller than that of g-C 3 N 4 /BiOBr/Au-B.Element mapping of g-C 3 N 4 /BiOBr/Au-S also displayed that N and Bi element are in uniform distribution, while the distribution of Au element was different to that in g-C 3 N 4 /BiOBr/ Au-B.It was observed that Au element was in uniform distribution which was in agreement with the corresponding STEM image.The results indicated that the uniform Au nanoparticles in g-C 3 N 4 /BiOBr/Au-S were small nanoparticles. Fig. 4 showed the XPS spectra of g-C 3 N 4 /BiOBr, g-C 3 N 4 /BiOBr/ Au-B and g-C 3 N 4 /BiOBr/Au-S.The peak positions in all of the XPS spectra were calibrated with C 1s at 284.6 eV.The survey XPS spectra indicated that the product consists of C, N, Bi, O, and Br elements (Fig. 4a).However, there was no Au signal in the survey XPS spectra due to the low content of Au loaded on g-C 3 N 4 /BiOBr.The high resolution XPS spectra of Au 4f were showed in Fig. 4b.For g-C 3 N 4 /BiOBr, there was no Au signal.For g-C 3 N 4 /BiOBr/Au-B and g-C 3 N 4 /BiOBr/Au-S, clear Au signals were found.The core lines were fixed at 83.5 eV (Au 4f7/2) and the spin orbit separations () were 3.7 eV (Fig. 4a).These results showed that the oxidation state of Au on g-C 3 N 4 /BiOBr was Au (0) 40.Moreover, on the basis of the XPS analysis, the surface content of Au of g-C 3 N 4 /BiOBr/Au-B was calculated to be 0.31 mol, and that of g-C 3 N 4 /BiOBr/Au-S was 0.29 mol.The similar contents of Au implied that the different photocatalytic activities of g-C 3 N 4 /BiOBr/Au-B and g-C 3 N 4 /BiOBr/ Au-S should be irrelevant of the Au content on the surface of g-C 3 N 4 /BiOBr. The UV-vis diffuse reflectance absorption spectra of g-C 3 N 4 /BiOBr, g-C 3 N 4 /BiOBr/Au-B and g-C 3 N 4 /BiOBr/Au-S were shown in Fig. 5.It was clearly shown that the loading of Au nanoparticles affected the optical property of g-C 3 N 4 /BiOBr significantly.g-C 3 N 4 /BiOBr has an absorbance edge at 470 nm and the color was yellow.The loading of Au nanoparticles leads to the continuous absorption band in the range of 470-800 nm and the color was gray purple, which was resulted from the surface plasmon absorption of Au nanoparticles.Furthermore, the DRS spectra of g-C 3 N 4 /BiOBr/Au-B and g-C 3 N 4 /BiOBr/Au-S showed a broad peak between 500 and 600 nm depending on the surrounding dielectric properties.And Fig. 5b showed that the absorption peak of Au in g-C 3 N 4 /BiOBr/Au-S and g-C 3 N 4 /BiOBr/Au-B were 520 and 535 nm, respectively. Recently, our group studied the photocatalytic activity of BiOX (X 14 Br and I) for CO 2 conversion 414243.We found ultrathin and bismuth-rich strategies can improve the photocatalytic CO 2 reduction activity.Herein, the photocatalytic CO 2 reduction over g-C 3 N 4 /BiOBr/Au-B and g-C 3 N 4 /BiOBr/Au-S also studied as shown in Fig. 6.Under 380 nm monochromatic light (Fig. 6a), it can be found that g-C 3 N 4 /BiOBr/Au-S (CO: 2.63 mmol g A 1 h A 1 ; CH 4 : 0.52 m mol g A 1 h A 1 ) did not display obvious enhancement for CO 2 reduction comparing with g-C 3 N 4 /BiOBr (CO: 2.49 mmol g A 1 h A 1 ; CH 4 : 0.47 mmol g A 1 h A 1 ).However, g-C 3 N 4 /BiOBr/Au-B (CO: 6.67 m mol g A 1 h A 1 ; CH 4 : 0.92 mmol g A 1 h A 1 ) showed much higher activity for CO 2 reduction than that of g-C 3 N 4 /BiOBr.Under 550 nm monochromatic light (Fig. 6b), g-C 3 N 4 , BiOBr and g-C 3 N 4 /BiOBr did not show obvious activity for CO 2 reduction due to their nonsuitable band gap.After Au deposition, g-C 3 N 4 /BiOBr/Au-S and g-C 3 N 4 /BiOBr/Au-B displayed activity under 550 nm light irradiation. Furthermore, g-C 3 N 4 /BiOBr/Au-S (CO: 0.39 m mol g A 1 h A 1 ; CH 4 : 0.05 mmol g A 1 h A 1 ) displayed much higher activity for CO 2 reduction than that of g-C 3 N 4 /BiOBr/Au-B (CO: 0.08 mmol g A 1 h A 1 ; CH 4 : 0.02 mmol g A 1 h A 1 ).The above photocatalytic data implied that big Au nanoparticles and small Au nanoparticles played different roles for g-C 3 N 4 /BiOBr/Au system.In order to confirm this phenomenon, the dye degradation experiment also was done as following. In this study, RhB was chosen as the target pollutant to test the photocatalytic activity of g-C 3 N 4 , BiOBr, g-C 3 N 4 /BiOBr, g-C 3 N 4 /BiOBr/Au-B and g-C 3 N 4 /BiOBr/Au-S under 380 nm or 550 nm monochromatic light.For 380 nm monochromatic light, the photocatalytic degradation (PCD) experiments of RhB were comparatively performed as shown in Fig. 7a.The g-C 3 N 4 /BiOBr/Au-B composites showed higher photocatalytic activity than g-C 3 N 4 , BiOBr, g-C 3 N 4 /BiOBr, and g-C 3 N 4 /BiOBr/Au-S.Fig. 7b showed that the photocatalytic degradation of RhB on different catalysts was fitted into pseudo-first-order kinetics, ln(C/C 0 )14 Akt, where C is the concentration of the RhB at time t, C 0 is the initial concentration of the RhB solution, and the slope k is the apparent reaction rate constant.The PCD constant of g-C 3 N 4 /BiOBr/Au-B (4.51 h A 1 ) was found to be about 3.8 times that of g-C 3 N 4 /BiOBr/ Au-S (1.18 h A 1 ), and 5.8 times that of g-C 3 N 4 /BiOBr (0.777 h A 1 ).For 550 nm monochromatic light, the PCD experiments of RhB were comparatively performed (Fig. 7c).The g-C 3 N 4 /BiOBr/Au-S composites showed higher photocatalytic activity than g-C 3 N 4 , g-C 3 N 4 /BiOBr, g-C 3 N 4 /BiOBr/Au-B.Fig. 7d showed that the photocatalytic degradation of RhB on different catalysts was fitted into pseudo-first-order kinetics.The PCD constant of g-C 3 N 4 /BiOBr/Au-S (0.408 h A 1 ) was found to be about 2.2 times that of g-C 3 N 4 /BiOBr/Au-B (0.186 h A 1 ), and 3.2 times that of g-C 3 N 4 /BiOBr (0.129 h A 1 ). Based on the above characterizations and photocatalytic data, it can be concluded that big Au nanoparticles enhanced the photocatalytic activity of g-C 3 N 4 /BiOBr/Au under ultraviolet range (380 nm), and small Au nanoparticles enhanced the photocatalytic activity of g-C 3 N 4 /BiOBr/Au under visible light range (550 nm).However, investigations are needed on the mechanism for metallic Au nanoparticles to enhance the photocatalytic activity of g-C 3 N 4 /BiOBr/Au photocatalytic system and the role of size of Au on the g-C 3 N 4 /BiOBr/Au photocatalytic system.The photogenerated active species in g-C 3 N 4 /BiOBr/Au-B and g-C 3 N 4 /BiOBr/ Au-S were investigated under 380 nm or 550 nm monochromatic light, respectively. Fig. 8a showed the results of the trapping experiment of active species during the photocatalytic reactions of g-C 3 N 4 /BiOBr/Au-B under 380 nm monochromatic light.It was observed that the photocatalytic degradation of RhB was not affected by the addition of 1 mM IPA (a quencher of OH) and AgNO 3 (a quencher of e A ). On the contrary, the photocatalytic degradation of RhB was decreased obviously with the addition TEOA (a quencher of h ) and BQ (a quencher of O 2 A ).It indicated that the main active species of g-C 3 N 4 /BiOBr/Au-B in aqueous solution under ultraviolet range (380 nm) irradiation were h and O 2 A rather than e -or OH.In addition, a colorless molecular probe, NBT was chosen to quantify the O 2 A concentration of g-C 3 N 4 , BiOBr, g-C 3 N 4 /BiOBr, g-C 3 N 4 /BiOBr/Au-B and g-C 3 N 4 /BiOBr/Au-S.It was found that the generation of O 2 A was sharply increased after loading the big Au nanoparticles on g-C 3 N 4 /BiOBr (Fig. 8c), while that was just slightly increased after loading the small Au nanoparticles.Under 380 nm monochromatic light, Au nanoparticles did not show its SPR role because of their sharper absorption peak between 500 and 600 nm.Therefore, the enhanced photocatalytic activity of g-C 3 N 4 /BiOBr/Au-B under ultraviolet range (380 nm) should be due to the improved separation of photo-induced carriers via Z-Scheme.Fig. 8b showed the results of the trapping experiment of active species during the photocatalytic reaction of g-C 3 N 4 /BiOBr/Au-S under 550 nm monochromatic light.It was observed that the photocatalytic degradation of RhB was not affected by the addition of 1 mM IPA, AgNO 3 and BQ.On the contrary, the photocatalytic degradation of RhB was decreased obviously with the addition TEOA.Therefore, it indicated that h was the main active species of g-C 3 N 4 /BiOBr/Au-S in aqueous solution rather than O 2 A , e A or OH.In addition, it was found that the generation of O 2 A was sharply increased after loading the small Au nanoparticles on g-C 3 N 4 /BiOBr (Fig. 8d).However, there few O 2 A was detected for g-C 3 N 4 /BiOBr, and the generation of O 2 A just slightly increased after loading the big Au nanoparticles on g-C 3 N 4 /BiOBr.Because g-C 3 N 4 /BiOBr can't be excited by 550 nm light.The enhanced photocatalytic activity of g-C 3 N 4 /BiOBr/Au-S under visible light range (550 nm) should be due to SPR role rather than Z-Scheme. The photocatalytic mechanism diagrams were showed in Fig. 9.As shown in Fig. 9a, under 380 nm monochromatic, both g-C 3 N 4 and BiOBr were excited, and the photo-generated h and e A were in their valence band (VB) and conduction band (CB), respectively.On one hand, CB-e A of BiOBr could easily flow into big Au nanoparticles (electron transfer I: BiOBr CB -big Au) through the Schottky barrier because the CB potential of BiOBr was more negative than the Fermi level of the loaded big Au nanoparticles.On the other hand, since the Fermi level of big Au nanoparticles was more positive than the VB of g-C 3 N 4 , VB-holes of g-C 3 N 4 could also easily flow into big Au nanoparticles (electron transfer II: big Aug-C 3 N 4VB ), which was faster than the electron-hole recombination between the VB and CB of g-C 3 N 4 30.Therefore, simultaneous electron transfer I and II (BiOBr CB -big Au-g-C 3 N 4VB ) enhanced the separation of VB-holes (BiOBr) and CB-electrons (g-C 3 N 4 ).As a result, g-C 3 N 4 /BiOBr/Au-B photocatalyst showed improved photocatalytic activity under ultraviolet range (380 nm) due to the Z-scheme bridge role of the big Au nanoparticles.And then, the photocatalytic activities for CO 2 reduction and dye degradation were enhanced. Under 550 nm monochromatic light, g-C 3 N 4 and BiOBr were not excited.The small Au nanoparticles could display its SPR role.Therefore, the enhanced photocatalytic activity of g-C 3 N 4 /BiOBr/ Au-S under visible range (550 nm) should be due to the improved photon absorption efficiency via SPR.As shown in Fig. 9b, the visible light was absorbed by the small Au nanoparticles, and the absorbed photon would be efficiently separated to an electron and a hole.Then, electrons were transferred to the CB of g-C 3 N 4 and then further to the CB of BiOBr.This electrons transfer process could reduce the recombination of charges.As a result, g-C 3 N 4 /BiOBr/Au-S displayed enhanced photocatalytic activity for CO 2 reduction and dye degradation under 550 nm monochromatic light. Based on the above photocatalytic mechanism discussion, metallic Au nanoparticles of different sizes enhanced the photocatalytic activity of g-C 3 N 4 /BiOBr/Au via different roles.Big Au nanoparticles acted as the Z-scheme bridge while small Au nanoparticles acted as the SPR center.Therefore, g-C 3 N 4 /BiOBr/Au-B showed improved UV (380 nm) induced photocatalytic activity, while g-C 3 N 4 /BiOBr/Au-S showed enhanced visible light (550 nm) induced photocatalytic activity."
  },
  {
    "title": "Conclusions",
    "content": "In this work, g-C 3 N 4 /BiOBr/Au-B and g-C 3 N 4 /BiOBr/Au-S were prepared.TEM images showed the size of big Au and small Au nanoparticles were 100-150 nm and 10-20 nm, respectively.The photocatalytic CO 2 reduction and RhB degradation results showed that g-C 3 N 4 /BiOBr/Au-B had a higher and lower activity than g-C 3 N 4 /BiOBr/Au-S under 380 nm and 550 nm monochromatic light, respectively.The active species trapping and superoxide radical quantification experiments revealed that the big and small Au nanoparticles played roles of Z-scheme bridge and SPR center, respectively.These findings could deepen our understanding about the correlation between the size and role of noble metal for photocatalysis. Fig. 1.(a) XRD patterns of g-C 3 N 4 /BiOBr, g-C 3 N 4 /BiOBr/Au-B and g-C 3 N 4 /BiOBr/Au-S; (b) enlarged XRD patterns of Au (111) peak in (a). Fig. 2. (a) TEM of g-C 3 N 4 /BiOBr/Au-B, (b and c) HRTEM image of g-C 3 N 4 /BiOBr/Au-B with different region, and (d) STEM image and element mapping of g-C 3 N 4 /BiOBr/Au-B.(For interpretation of the references to color in this figure, the reader is referred to the web version of this article.) Fig. 4. XPS spectrum of g-C 3 N 4 /BiOBr, g-C 3 N 4 /BiOBr/Au-B and g-C 3 N 4 /BiOBr/Au-S: (a) survey XPS spectrum, and (b) high resolution XPS spectra of Au 4f.Fig. 5. (a) UV-vis diffuse reactance absorption spectra of g-C 3 N 4 /BiOBr, g-C 3 N 4 /BiOBr/Au-B and g-C 3 N 4 /BiOBr/Au-S; (b) enlarged SPR range (500-600 nm) in (a). Fig. 4. XPS spectrum of g-C 3 N 4 /BiOBr, g-C 3 N 4 /BiOBr/Au-B and g-C 3 N 4 /BiOBr/Au-S: (a) survey XPS spectrum, and (b) high resolution XPS spectra of Au 4f.Fig. 5. (a) UV-vis diffuse reactance absorption spectra of g-C 3 N 4 /BiOBr, g-C 3 N 4 /BiOBr/Au-B and g-C 3 N 4 /BiOBr/Au-S; (b) enlarged SPR range (500-600 nm) in (a). Fig. 6.Photocatalytic CO 2 reduction rate over g-C 3 N 4 , BiOBr, g-C 3 N 4 /BiOBr, g-C 3 N 4 /BiOBr/Au-B and g-C 3 N 4 /BiOBr/Au-S with 2 h: (a) 380 nm; and (b) 550 nm. Fig. 7. PCD percentage and pseudo-first-order reaction kinetics of RhB for g-C 3 N 4 , BiOBr, g-C 3 N 4 /BiOBr, g-C 3 N 4 /BiOBr/Au-B and g-C 3 N 4 /BiOBr/Au-S: (a, b) 380 nm; and (c, d) 550 nm. Fig. 8. Photocatalytic mechanism studies for g-C 3 N 4 /BiOBr/Au-B and g-C 3 N 4 /BiOBr/Au-S: (a) trapping experiment of g-C 3 N 4 /BiOBr/Au-B under 380 nm, (b) trapping experiment of g-C 3 N 4 /BiOBr/Au-S under 550 nm, and transformation percentage of NBT concentration by g-C 3 N 4 , BiOBr, g-C 3 N 4 /BiOBr, g-C 3 N 4 /BiOBr/Au-B and g-C 3 N 4 /BiOBr/ Au-S under 380 nm (c) and 550 nm (d). Fig. 9. Photocatalytic mechanism diagrams for CO 2 reduction and dye degradation: (a) g-C 3 N 4 /BiOBr/Au-B under 380 nm, and (b) g-C 3 N 4 /BiOBr/Au-S under 550 nm. This work was supported by the National Natural Science Foundation of China (Nos.51502146, U1404506), Natural Science Foundation of Henan Department of Science Technology (No. 142102210477), Natural Science Foundation of Henan Department of Education (No. 14A150021), Natural Science Foundation of Nanyang Normal University (No. ZX2014039), Scientific Research Starting Project of SWPU (No.2015QHZ001) and Young Scholars Development Fund of SWPU (No.201499010100)."
  }
]