[
  {
    "title": "Doi",
    "content": "10.1016/j.apcata.2013.07.056"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic CO2 reduction and kinetic study over In/TiO2 nanoparticles supported microchannel monolith photoreactor"
  },
  {
    "title": "Abstract",
    "content": "In this study, a microchannel monolith photoreactor was investigated for photocatalytic CO 2 reduction with H 2 O in gaseous phase using TiO 2 and indium doped TiO 2 nanoparticles.Effects of operating parameters such as monolith geometry, reaction temperature, indium loading and feed ratios were investigated to maximize yield rates.CO and CH 4 were the main products with maximum yield rates being 962 and 55.40 mol g-catal.-1 h -1 , respectively and selectivity being 94.39 and 5.44, respectively.The performance of the photoreactor for CO production was in the order of In/TiO 2 -monolith (962 mol g-catal.-1 h -1 ) TiO 2 -monolith (43 mol g-catal.-1 h -1 ) TiO 2 -SS cell (5.2 mol g-catal.-1 h -1 ).More importantly, the quantum efficiency in microchannel monolith reactor was much higher (0.10) than that of the cell type reactor (0.0005) and previously reported internally illuminated monolith reactor (0.012).The significantly improved quantum efficiency indicated photon energy was efficiently utilized in the microchannel monolith reactor.A simple kinetic model based on Langmuir-Hinshelwood model, developed to incorporate coupled effect of adsorptive photocatalytic reduction and oxidation process, fitted-well with the experimental data."
  },
  {
    "title": "Experimental",
    "content": "Fig. 1 describes the procedure of catalyst synthesis and coating on monolith channels.The sol-gel single step method was used to prepare mesoporous TiO 2 and In/TiO 2 nanoparticles.The precursory of titanium solution was prepared with molar ratios: Ti (C 4 H 9 O) 4 :15C 2 H 5 OH:2CH 3 COOH (1 M).Typically, 30 ml of isopropanol was added into 10 ml of titanium tetra iso-propoxide and stirred well for 30 min.The controlled hydrolysis was conducted by adding drop wise a mixture of 6.37 ml acetic acid (1 M) and 10 ml isopropanol under vigorous stirring.The mixture was continuously stirred for 24 h at 30 C. Subsequently, indium(III) nitrate dissolved in isopropanol was added drop-wise and stirred for another 12 h until clear sol was produced.The sol obtained was poured into a glass container for monolith coating. The monolith was initially washed with acetone and isopropanol to remove any organic material, and then dried at 80 C for 12 h.The SHIMADZU analytical balance ATY-224 with specifications: Max 220 g, Min 10 mg, d 0.1 mg, e 1 mg was used to measure the weight of the monoliths.For every sample, three readings were noted for bare monolith as well as coated monoliths and their average values are reported.For example, the weight of the 2 cm 100 CPSI bare monolith was 46.8219 g, aggregated from three different readings, i.e.(a) 46.8214 g, (b) 46.8225 g, and (c) 46.5218 g.After the weight of the dried monolith was recorded, it was immersed slowly into the indium loaded TiO 2 sol and kept for a few minutes.The excess sol from the channels was blown off using compressed air and dried with an air drier.To increase the film thickness and catalyst loading, the monolith was dipped for the second time using the same procedure.The coated monolith was then put into the oven, dried at 80 C for 12 h and finally calcined in a muffle furnace at a rate of 5 C min -1 up to a maximum of 500 C and held for 5 h.After calcination, the average weight of the coated monolith was 47.3532 g calculated from three readings (a) 47.3539 g, (b) 47.3531 g, and (c) 47.3526 g.Therefore, the catalyst coated over monolith channels was 0.5313 g calculated by subtracting coated monolith weight (47.3532 g) from un-coated monolith weight (46.8219 g).In/TiO 2 sol was dried and calcined with the same procedure as explained above to obtain In/TiO 2 powder.For comparison, bare TiO 2 nanoparticles were also similarly prepared and coated inside the microchannels of the monolith. In order to determine the structure and crystallinity of the photocatalysts, powder X-ray diffraction (XRD) was performed on Bruker D8 advance diffractometer (Cu K radiation, wavelength 1.54 A, operated at 40 kV and 40 mA).The surface morphology was examined using scanning electron microscopy (SEM) with JEOL JSM6390 LV SEM instrument.The particle size and lattice structure of the individual crystals was visualized by high resolution transmission electron microscope (HR-TEM) carried out with FEI-Tecni G2 Transmission Electron Microscope (TEM) at EFGO Scientific, Kulim, Kedah, Malaysia.Textural characterization of the samples was carried out with a Micromeritics ASAP 2020.The nitrogen adsorption-desorption properties were examined at 77 K.The specific surface area (S BET ) of monolayer coverage was determined using Brunauer-Emmett-Teller (BET) method.The pore size distribution was calculated using the adsorption branch of the isotherm by means of Barrett-Joyner-Halenda (BJH) method.Meanwhile, the UV-vis absorption spectra of the samples were measured with UV-Vis-NIR spectrophotometer, Shimadzu UV 3101pc. The schematic photocatalytic reaction system for reduction of CO 2 with H 2 O in gaseous phase is illustrated in Fig. 2. The reactor consisted of a stainless steel cylindrical vessel with 5.5 cm length and a total volume of 150 cm 3 .The monoliths were supplied by Pingxiang Meitao Chemical Packing Co., Ltd., China.The dimensions of the monolith are as follows: diameter 6 cm; length from 0.50 to 10 cm, channels per square inch (CPSI) 100 and 400.After coating with about 50 mg catalyst the monolith was placed at the center of the cylindrical stainless steel reactor, equipped with a quartz window for passing light irradiations from the reflector lamp located above the reactor.The reactor temperature was adjusted using heating and cooling jackets.The light source used to activate the photocatalytic reactions was a 200 W mercury lamp for UV irradiations source, having non-collimated irradiations with maximum intensity at 252 nm.The lamp was equipped with a cooling fan at the top and sides to remove lamp heat.The light intensity was measured with an online optical process monitor ILT OPM-1D and a SED008/W sensor.The average irradiation intensity passing through the top of the reactor was 150 mW/cm 2 .The reactor was covered with aluminum foil to ensure lights for reactions came through the quartz window only.In case of the cell type photoreactor, the reactor chamber and the light source was the same with the monolith reactor.Furthermore, 50 mg of nanocatalyst powder was suspended uniformly at the bottom of the reactor to ensure the light was efficiently distributed over the catalyst surface. Prior to feeding, both reactors were purged using helium (He) flow to remove air as well as to check for leakage under 2 bar pressure for 10 h.Pure CO 2 (purity 99.995) was bubbled through deionized water saturator for 1 h to remove dissolved oxygen and air.The temperature inside the water bubbler was controlled using a temperature controller.The compressed CO 2 regulated by a mass flow controller (MFC), was bubbled through the deionized water and its concentration was adjusted with helium regulated by the MFC.The partial pressure of H 2 O vapors was adjusted by changing the temperature of the water saturator.The gases, CO 2 , He and H 2 O mixed well inside the gas mixer, continuously passed through the reactor containing powdered catalyst or coated monolith for about 1 h prior to switching on the lamp.The pressure inside the reactor was adjusted to 0.20 bars above atmospheric pressure while temperature inside the reactor was controlled using a heating jacket. The products were analyzed using an on-line gas chromatograph (GC-Agilent Technologies 6890N, USA) equipped with thermal conductivity detector (TCD) and flame ionized detector (FID).The gaseous products from the reactor were also taken using gastight syringe (Agilent, 1000 l) for offline analysis using the same volume as in the online analysis.Furthermore, the FID detector was connected with a HP-PLOT Q capillary column (Agilent, length 30 m. ID 0.53 mm, film 40 m) for separation of C 1 -C 6 paraffins and olefins hydrocarbons, alcohols and oxygenated compounds.The TCD detector was connected to UCW982, DC-200, Porapak Q and Mol Sieve 13X columns.The UCW-982 was used for back flush and reversed flow to ensure C 6 and higher compounds could be detected earlier in the chromatogram.Meanwhile, C 1 -C 2 , C 3 -C 5 compounds and light gasses (H 2 , O 2 , N 2 , CO) were separated using Porapak Q, DC-200, and MS-13X columns, respectively."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The X-ray diffraction (XRD) patterns of bare TiO 2 and In/TiO 2 coated monolith samples are shown in Fig. 3.All the TiO 2 peaks corresponded to pure crystalline and anatase phases calcined at 500 C for 5 h.The XRD data do not infer any presence of indium.However, the anatase peaks become wider while the intensities also increase with indium loadings, with no shifts in the anatase peaks observed.The wider anatase In/TiO 2 peaks indicate the crystallite size of TiO 2 decreases with indium loading.In order to confirm bulk compositions of each sample, the XRD peaks are compared with the JCPDS-ICSD standards for anatase (89-4921).The diffraction peaks for TiO 2 and In/TiO 2 are essentially equivalent, exhibiting 2A peaks at 25.54 (1 0 1), (0 0 4), (2 0 0), (1 0 5), (2 1 1) and(2 0 4) planes associated with tetragonal anatase.The average crystallite sizes of TiO 2 and In/TiO 2 nanoparticles were calculated using Scherer's equation (Eq.( 1)) according to the (1 0 1) peak 45,46. where L is the thickness of crystallite (nm), k is a constant depending on the crystallite shape (0.90 for this study), is the X-ray wavelength (nm), is full peak width at half max in radians and A is Bragg's angle of the 2A peak.The calculated crystallite sizes of TiO 2 , 10 In/TiO 2 and 20 In/TiO 2 samples were 18.73, 13.8 and 11.32 nm, respectively.It was observed that the size of the TiO 2 nanoparticles decreased gradually, possibly due to indium controlling the crystal growth in TiO 2 . The SEM micrographs of monoliths are depicted in Fig. 4. The pore morphology of the bare and coated monolith is shown in Fig. 4(a) and (b), respectively.It is obvious that catalyst was entirely coated over the monolith channels with no broken layer observed.catalyst layer investigated at 10 m of SEM magnification over the monolith surface.At magnification of 1 m, it is identified that the catalyst nanoparticles are uniformly distributed on the monolith surface, as shown in Fig. 4(d).It is also observed that the indium-loaded TiO 2 mesoporous particles are uniform in size. The TEM micrographs of mesoporous In/TiO 2 catalyst are shown in Fig. 5. From Fig. 5(a), TEM image revealed mesoporous anatase TiO 2 nanoparticles consisted of average particle size with diameter less than 13 nm.The particle size is close to the estimated crystallite size by Scherrer equation.It can be observed that the nanoparticles have interparticle mesoporous structure.The growth and aggregation of the small particles probably caused interparticle mesoporosity.The HR-TEM image in Fig. 5(b) confirms the morphology of TiO 2 nanoparticles where 0.35 nm aligned anatase phase grown along 1 0 1 directions is observed, as already confirmed with XRD.These results are in good agreement with previous reports 4,47. Fig. 6 exhibits the N 2 adsorption and desorption isotherms and Barrett-Joyner-Halenda (BJH) pore-size distribution of TiO 2 and In/TiO 2 samples.It is obvious from Fig. 6(a) that the hysteresis loops increase with increasing indium loading, resulting obvious increase in the N 2 volume adsorbed.The isotherms of the samples are similar to type IV curves with hysteresis loops, corresponding to mesoporous materials 19. Furthermore, the initial part of the isotherms (at low P/P o ) is related to monolayer-multilayer adsorption on the internal surface.However, at higher P/P o , there was a steep increment in the adsorption volume, attributed to capillary condensation, then pores saturated with liquid.The monolayer-multilayer is more dominant in TiO 2 in which capillary action starts at P/P o 0.60.Both capillary and condensation processes are more obvious in In/TiO 2 samples and eminent at P/P o of 0.55. The pore size distribution of the samples is presented in Fig. 6(b).The pore size distribution, calculated from adsorption branch, is based on the BJH model.The BJH adsorption isotherms show that the interparticle pore size diameter falls in the range of 2.5-25 and 2.4-14 nm for TiO 2 and In/TiO 2 samples, respectively. The BET surface area, pore volume and pore size of bare TiO 2 and In/TiO 2 samples are summarized in Table 1.Obviously, the indium loading into TiO 2 influences the surface area, pore volume and pore size.The BET surface areas for indium doped TiO 2 samples are larger than bare TiO 2 .Besides this, the t-plot external and BJH adsorption surface areas also increased significantly.The increase in surface area was probably due to suppression of TiO 2 crystal growth by indium and also due to increase in mesoporosity.Furthermore, the BJH adsorption pore volume also increased with indium loading.Conversely, the pore diameter gradually decreased with indium loading.The increase in the pore volume with reduced pore diameter is attributed to higher sample mesoporosity.The well-developed mesopores, larger surface area and higher pore volume could enhance molecular transportation rates of reactants and products to increase CO 2 conversion efficiency. The UV-vis absorbance spectra of the TiO 2 nanoparticles and In/TiO 2 samples are depicted in Fig. 7.The absorption band edge of TiO 2 is located at 400 nm, which indicates obvious red shift in wavelength of TiO 2 compared to standard anatase TiO 2 ( 380 nm) .The peaks identified for 5, 10, 15 and 20 wt. In/TiO 2 are located at 401, 402, 403 and 404 nm respectively.It can be seen that indium has no significant effect on shifting TiO 2 band edge.The band gap of the samples was calculated according to Eq. ( 2). where E g is the band gap energy (eV), h is the Planks constant, c is the light velocity, and the wavelength (m).The E bg estimated were 3.105, 3.098, 3.090, 3.082 and 3.075 for TiO 2 and 5, 10, 15 and 20 wt. indium doped TiO 2 samples, respectively.It is identified that loading indium into TiO 2 decreased the band gap but not red shift was observed as compared to TiO 2 nanoparticles. Initially, a series of preliminary tests were conducted in the absence of CO 2 and H 2 O under UV irradiations for 2 h at 373 K for the following cases; (1) empty reactor with helium, (2) reactor with monolith without coating and helium, (3) reactor with TiO 2 coated monolith and helium and (4) monolith coated with In/TiO 2 catalyst with helium.In all cases, no reaction products were detected.This confirmed that no products were due to photodecomposition of organic residues in catalyst, if any.In addition, other preliminary tests were also conducted using H 2 O vapors and helium in presence of photocatalyst.The results again confirmed in either case no carbon containing compounds were produced.Therefore, it can be reiterated that photocatalytic reduction process require all three components, i.e. catalyst coated monolith and/or catalyst, feed (CO 2 , H 2 O), and light source.Meanwhile any carbon containing compounds should be produced from CO 2 through photocatalytic reactions.Furthermore, all the experiments were repeated three to five times and aggregated results have been reported. The effect of cell density on photocatalytic CO 2 reduction over different irradiation time is illustrated in Fig. 8(a).Higher CH 4 yield rate observed over TiO 2 using monolith with cell density of 100 compared to 400 CPSI.The higher yield rate was probably due to efficient harvesting and utilization of light irradiations inside 100 CPSI channels compared to very dense channels (400 CPSI) 43.Conversely, further increase in yield rates possibility exist over 150 and/or 200 CPSI channels, as smaller apertures support more illuminated surface area to volume ratio of reactor granting further investigation for optimum channel aperture. Fig. 8(b) shows the effect of monolith channel lengths on photocatalytic CO 2 reduction over TiO 2 photocatalyst at different irradiation times.It was found that CO 2 reduction with H 2 O vapors to CH 4 improved using longer monolith.As the channel length increased beyond 2 cm, a gradual reduction in CH 4 yield was observed.Although the same amount of irradiation penetrated inside the channels yet only small portion of light probably passes through longer channels because of non-collimated light source.Besides, there is higher catalyst loading and lower CO 2 mass transfer on the catalyst surface at prolonged monolith length, resulting in lower yield rate 44.Furthermore, only the front part of the monolith was efficiently irradiated and after a certain length there was probably inefficient light being distributed over the catalyst required for photocatalysis.Therefore, the monolith geometry is vital and optimum monolith dimensions are critical to enhance CO 2 reduction efficiency.Based on such observations, it is obvious that photon flux distribution inside reactor is very important, since it directly influences reactor performance 48. Fig. 9 illustrates the effect of reaction temperature on photocatalytic CO 2 reduction at three different temperatures (70, 80 and 100 C) using 10 wt. In/TiO 2 catalyst.In all the three temperatures investigated, the reaction rate exhibits similar behavior, which is slow initially for CO production, but becomes considerably faster after 2 h of irradiations.The other products observed were CH 4 and traces of C 2 -C 3 alkanes and alkenes (figure not shown).The increased in yield rates at elevated temperature can be explained on the basis of adsorption-desorption phenomenon.In heterogeneous photocatalysis process, especially in gaseous phase, simultaneous adsorption and desorption processes occurred over the catalyst surface.The rate of reaction depends on the efficiency of these processes.Therefore, at elevated temperature, the CO 2 mass transfer rate on the catalyst surface can be increased, thus the probability of CO 2 adsorption increases which can result in higher reaction rate 41.Furthermore, at higher reaction temperature, the possibility of species desorption at the catalyst surface increased.In this way, the chances of efficient collisions between the charge transfer excited state species and reactant molecules also increased 10.Besides this, the increase in reaction rate at higher temperature may be possibly due to a decrease in activation energy during the course of reaction.Similar observations have been reported in other studies during the investigations of the effect of temperature on the reduction of CO 2 with H 2 O in gaseous phase 19,49.Fig. 10 illustrates the effect of indium loading on TiO 2 photocatalytic activity for transformation of CO 2 with H 2 O to CO and CH 4 .By using un-doped TiO 2 nanoparticles, small amount of CO was produced, while CO yield increased significantly by the dispersion of indium into the TiO 2 structure.The higher yield rate is an evidence that photocatalytic activity of TiO 2 can be enhanced by increasing indium content to an optimum loading of 10 wt..Beyond the 10 wt. loading, the CO 2 reduction rate slowed down probably due to increase in recombination rate of charges.The difference in the photocatalytic activity of bare TiO 2 with doped TiO 2 may be attributed to reduced crystal size and increased surface area, resulting in efficient charge production and separations over the mesoporous In/TiO 2 samples.Similar observations are reported in literature using doped TiO 2 catalysts 13,35,50. The effects of partial pressure of CO 2 and irradiation time for photocatalytic CO 2 reduction over 10 wt. indium doped TiO 2 supported microchannel monolith are investigated for a period of 0-10 h as depicted in Fig. 11.There is continuous production of CO and CH 4 over the entire irradiation period.CO was identified as the major product and its higher yield over In/TiO 2 catalyst confirmed higher CO 2 reduction efficiency using this process.Initially CO yield was very low, but gradually increased over the time.The lower yield rate at the start of reaction was supposedly due to higher CO 2 adsorption and lower CO desorption.The yield of CH 4 increased continuously with irradiation time; due to surface reaction and efficient desorption of hydrocarbon based products.Trace distribution of C 2 H 4 , C 2 H 6 , and C 3 H 6 with time was also observed in the product mixture.However, yield of CH 4 was lower than CO and this was probably attributed to the conductance band (CB) of the thermodynamic reduction potential. Furthermore, the concentrations of CO and CH 4 increased with increasing CO 2 partial pressure at fixed water vapor pressure (0.074 bar) (Fig. 11).This phenomenon is likely due to adsorption competition between CO 2 and H 2 O molecules on the active sites of In/TiO 2 catalyst during photoreduction process.At lower CO 2 concentration, large amount of H 2 O molecules could adsorb over the catalyst surface to react with CO 2 resulting in higher CO 2 photoreduction.However, at higher CO 2 concentration, it covers supposedly maximum active sites and H 2 O would have to compete with CO 2 for the active sites resulting in lower reaction rate.Therefore, an optimum concentration of both reactants would be favorable for higher CO 2 conversion.Similar findings have been reported in literature during photocatalytic CO 2 with H 2 O vapors using various TiO 2 based photocatalysts 19,51.The photocatalytic performance of In/TiO 2 supported over microchannels with respect to the product yield is in the following order (mol g-catal. - ): CO CH 4 C 2 H 6 C 2 H 4 C 3 H 6 .The higher yield of CO and hydrocarbons was likely due to significant increase in the number of electron-hole pairs and inhibited recombination times over In/TiO 2 supported microchannels. Fig. 12 compares photocatalytic CO 2 reduction with H 2 O vapors using stainless steel (SS) cell and monolith photoreactor.Interestingly, the yield rate of CO obtained was much higher over In/TiO 2 supported microchannels and this reveals indium enhances rate of reaction for CO production.Under the same experimental conditions, the CO yield rate over indium modified TiO 2 was 962 mol g-catal. - h -1 22.4-fold higher compared to TiO 2 supported monolith photoreactor and 185-fold higher compared to SS cell reactor.Overall, the presence of monolith enhanced the photoactivity of TiO 2 .These results confirmed indium is efficient to inhibit recombination of electrons-hole pairs.Furthermore, in TiO 2 coated monolith, the CO yield was 8.3 times higher than cell type reactor.This was also probably due to increased light irradiation utilization and better contact efficiency between reactants and catalyst coated monolith due to the microchannels.Basically, honeycomb configuration of monolith provides a higher geometrical surface area to support catalyst over microchannels and to increase mass transfer; thus, higher reactor volume could be used for photocatalytic reactions.It is also inferred that electrons produced were immediately utilized over thin film coated microchannel, thus reducing the rate of electron-hole pair recombination as similarly observed previously 52. The product compositions of photoreactors are usually quantified based on quantum efficiency.efficiency, calculated for each experiment, as the ratio of product rate (mol per s) with photonic flux (mol per s) 38.The quantum efficiency of the microchannel monolith photoreactor coated with In/TiO 2 for CO production was 0.10, 24 times higher than that of TiO 2 coated monolith and 198 times higher than catalyst suspended cell type photoreactor.Liou et al. 37 reported quantum efficiency of internally illuminated monolith photoreactor for methanol production during CO 2 reduction with H 2 O vapors which was 0.012, 8.33 times lower than the value reported above for CO production.Significantly higher quantum efficiency was observed using microchannel monolith photoreactor, which may be attributed to higher photons absorption inside the microchannels due to larger illuminated active surface area.The significant improvement in the performance of the monolith is due to more catalyst being exposed to incoming irradiation flux.In this way, a much larger fraction of the reactor volume was effectively used to convert CO 2 to products, thus resulting in higher quantum efficiency.The lower efficiency in TiO 2 is related to higher probability of electron-holes recombination over TiO 2 where large number of photons remained unproductive.a The dimensions of monolith were length 2 cm, CPSI 100, diameter 6 cm.b Yield rates were calculated at 10 h irradiation basis, PH 2 O 0.074 bar and PCO 2 0.040 bar.c Quantum efficiency (number of electrons moles of production rate)/(moles of UV photons flux) 100. Table 3 summarizes the yields over various catalysts used in cell type and monolith photoreactor with 10 h irradiation time.The presence of mesoporous In/TiO2 and microchannel monolith played important roles and CO 2 reduction was obviously increased.The performance of the photoreactor for CO production was in the order of In/TiO 2 -monolith (962 mol gcatal. ).Similarly, the yield rates of CH 4 produced were 55.4, 78.0 and 7.7 mol g-catal. - h -1 , for In/TiO 2monolith, TiO 2 -monolith and TiO 2 cell type, respectively.In addition, less concentrations of C 2 H 4 , C 2 H 6 , and C 3 H 6 were also produced over TiO 2 and In/TiO 2 coated monoliths.Based on these results, it is obvious that mesoporous In/TiO 2 catalyst with higher surface area and lower particle size is more favorable for efficient reduction of CO 2 to CO.In general, higher efficiency of the catalysts and reactors may be attributed to the followings: (1) Larger illuminated surface area, higher light utilization, efficient adsorption-desorption process and higher catalyst interparticle mesoporosity are probably the important factors to improve the yield rates in monolith photoreactor.Conversely, in cell type photoreactor, there is lower light utilization and mass transfer rates. (2) Indium in TiO 2 controls the crystal growth, increases the mesoporosity and the surface area, and reduced the particle size.Indium doped TiO 2 catalysts with smaller particle sizes coated over microchannels have higher photocatalytic activity because electrons are more mobile over the photocatalysts.Furthermore, indium trapped electrons and hindered recombination of electrons-hole pairs during TiO 2 photocatalysis, and possibly enhanced TiO 2 photocatalytic activity. During photocatalytic CO 2 reduction with water vapors the first step was the production of electrion-holes pairs when light striked on the TiO 2 surface.The electrons (e -) were transferred from the conduction band of TiO 2 for the photoreduction of CO 2 yielding In CO CH 3 Since all the above products were detected experimentally, therefore, CH 4 was confirmed to be produced from methyl radicals ( CH 3 ) through Eq. ( 8).Similarly, CO was probably produced according to Eq. ( 6).The higher yield rate of CO production also confirmed that there were significant productions of electrons which were efficiently trapped by indium and then transferred to CO 2 for its reduction to CO.However, there are many possible routes for the production of C 2 -C 3 hydrocarbons and most possible routes are explained in Eqs. ( 9)- (11).According to above reaction mechanism, all the possible products are dependent on the production of intermediate product, CO and its further reduction to C 1 -C 3 hydrocarbons through Eqs. ( 7)- (11).The possibility for production of C 2 -C 3 compounds enhanced if there are series of reaction taking place over catalyst surface.Similar observations have been reported in other studies using TiO 2 based photocatalysts 19,49.The reaction scheme for the production of CO, CH 4 and higher hydrocarbons using In-loaded TiO 2 is elaborated further in Fig. 13(a).The photocatalytic CO 2 transformation to CO and CH 4 as main products over In/TiO 2 catalyst could be further explained using energy band theory, which is based on the relative positions of conductance band, valance band and oxidation potentials.In general, photo-excited electrons could consume effectively, if the reduction potential of reaction is lower than the conductance band potential of the semiconductor 54.The mechanims for photocatalytic CO 2 reduction in terms of thermodynamic reduction potentials versus normal hydrogen electrode (NHE) at pH 7 is explained in Fig. 13(b) 17.The possible reactions that can occur during photocatalytic CO 2 with H 2 O to produce CO and CH 4 in terms of thermodynamic reduction potentials versus normal hydrogen electrode (NHE) at pH 7 can be described by reactions ( 12)-( 15) 11,55,56. The conductance band potential of TiO 2 is E CB -0.50V at pH 7, which is higher than reduction potential of E o (CO 2 /CO) -0.48V, thus reduction of CO 2 to CO is possible.On the other hand, production of CH 4 was also posisble because of lower reduction potential difference (E o (CO 2 /CH 4 ) -0.24V).However, higher production rate of CO is possible since two electrons are required for CO production compared to eight electrons to produce CH 4 .Besides, there was possible higher production of electrons than holes due to indium loading which enhanced CO production.On the other hand, traces amount C 2 to C 3 were possible due to a series of reaction that occured ove rthe catalyst surface.Using bare TiO 2 , CH 4 was found as the major product which revealed TiO 2 coated over microchannel is more feasible for CH 4 production than CO.Thus, the CO production over In/TiO 2 was probably due to a more negative conductance band and possibility of CH 4 reduction to CO.However, further investigations are needed to find out the exact reaction mechanism of CO and hydrocarbons production.In other studies, CO was also observed as the main product during CO 2 reduction with H 2 O vapors using TiO 2 and the modified TiO 2 catalysts 13,14. In heterogeneous photocatalytic processes, rates are usually proportional to adsorption of reactants with efficient desorption of products on the catalyst surface.When the two reactants competitively adsorbed on the same catalyst surface active sites, but with different adsorption and desorption rate constants, and undergoes a reaction to yield different products, the reaction could be represented by Langmuir-Hinshelwood mechanism, as explained by Eq. ( 16) 44. where A A and A B represent the fractional surface coverage of each reactant while P A and P B are the partial pressures of each species.The rate constant k and adsorption equilibrium constant parameters K A and K B are all temperature dependent.If the adsorption is random, the probability of adsorption would be taken as the fraction of the surface not covered (1 -A) and desorption taken as the surface covered A.By employing these assumptions, the kinetic model for photocatalytic CO Some of the products would photo-adsorb on the catalyst surface, blocked the active sites and slowed down the CO 2 reduction process.There is also possibility some of these products recombined in a reversed reaction.For example, when CO and oxygen produced were not effectively desorbed from the catalyst surface, these products would undergo photo-oxidation back to CO 2 in the reversed reaction.The kinetic model is developed using these assumptions to investigate the coupled effect of adsorptive photocatalytic reduction and oxidation processes.By assuming reactants and products are adsorbed on same active sites, rate of reaction can be explained by using Langmuir-Hinshelwood mechanism as described in Eq. ( 18). where 'k' is the rate constant, I is UV light flux intensity for which kinetic constants is evaluated, 'a' is the reaction order of light intensity, having value 1 or less depending on the light intensity 57. A simple kinetic model incorporating the coupled effect of the adsorptive photocatalytic reduction and oxidation could be developed using the modified Langmuir-Hinshelwood model (Eq.( 19)) using the following assumptions: (1) The surface reactions occurred at the outer surface of the monolith channel where the catalyst is coated as thin layer.(2) The reduction of CO 2 on the surface produced CO, which strongly adsorbed and overall rate of reaction may be limited by the rate of CO desorption.(3) Initially reaction rate was very fast but the rate decreased as CO accumulated on the surface, strongly adsorbed and the surface was nearly completely covered by CO, i.e.K CO P CO 1 K CO 2 P CO 2 . The rate of reduction in Eq. ( 19) is simplified to Eq. (20). where k 1 (k red I a ) is the photoreduction rate constant affected by temperature and light intensity.The rate of formation of the products is dependent on CO conversion and/or desorption over the catalyst surface.During photocatalytic CO 2 reduction, when CO entirely covers the catalyst surface, it also undergoes partial oxidation with oxygen.The Langmuir-Hinshelwood model could also be used to evaluate rate of photo-oxidation.When CO oxidation reaction with oxygen undergoes dissociative adsorption process, the L-H mechanism could be written as in Eq. ( 21) 44.The rate of product formation can be obtained by subtracting rate of oxidation from rate of reduction as explained in Eq. ( 22) where, k 2 (k oxd I a ) is dependent on reaction temperature and light intensity factor. Under constant temperature and pressure, partial pressure of CO 2 and H 2 O vapors will be constant.Similarly, partial pressures of CO and oxygen would be proportional to partial pressure of desired product, i.e.P CO P O 2 P. Based on these assumptions, product formation Eq. ( 22) in simplified form can be expressed by Eqs. ( 23) and (24). where The differential equation (Eq.( 24)) was solved using integral approach as shown in Eq. ( 25). where Eq. ( 27) is known as the kinetic equation and it could be used to evaluate experimental data.However, it is further simplified by applying assumption that k 5 (k 7 (k 8 /P 1/2 ) (k 9 /P)) as described in Eq. (28). Eq. ( 28) is the simplified kinetic model equation while, k 5 and k 6 are constants related to reaction rate constants, adsorption-desorption ratio constants, light intensity, and experimental conditions.By assuming ideal gas law, P can be assumed to be the yield of the Fig. 1. Preparation of In/TiO2 nanoparticles and In/TiO2 coated over monolith. Fig. 2. Schematic of experimental set-up using monolith photoreactor for photocatalytic CO2 reduction with H2O vapors. c) indicates smooth and thoroughly distributed uniform Fig. 3. XRD patterns of anatase TiO2 nanoparticles and In/TiO2 catalysts. Fig. 4. SEM micrographs of bare monolith and In/TiO2 coated monolith at different magnifications; (a) bare monolith channels, (b) catalyst coated monolith channels, (c) top view image at magnification 1000 and scale 10 m, and (d) mesroprous structure of coated catalyst at magnification 15,000 and scale 1 m. Fig. 5. TEM and HR-TEM images of In/TiO2 sample. Fig. 6.(a) N2 adsorption-desorption isotherms of TiO2 nanoparticles and In/TiO2 samples and (b) BJH pore size distribution of corresponding samples. Fig. 7. UV-vis absorption spectra of TiO2 and In/TiO2 samples. Fig. 8. Effects of channel length on performance of monolith photoreactor for photocatalytic CO2 reduction with H2O vapors.overTiO2 catalyst (T 373 K, PH 2 O 0.074 bar and PCO 2 0.020 bar). Fig. 9. Effect of reaction temperature on yield rate of CO (L 2 cm, CPSI 100, 10 In-TiO2, CO2 0.02 bar, PH 2 O 0.074 bar). Fig. 10.Effect of indium loading into TiO2 for photocatalytic CO2 reduction over monolith keeping all the parameters fixed (L 2 cm, CPSI 100, T 373 K, PH 2 O 0.074 bar, PCO 2 0.02 bar). Fig. 11.Photocatalytic CO2 reduction with H2O over 10 In/TiO2 catalyst at different irradiations time and CO2 partial pressures (L 2 cm, CPSI 100, In 10 wt., T 373 K, and PH 2 O 0.074 bar). Fig. 12.Comparison of photocatalytic CO2 reduction with H2O using cell type and monolith photoreactor (V 150 cm 3 , T 373 K, PH 2 O 0.074 bar, PCO 2 0.04 bar). Fig. 13.(a) Schematic reaction scheme for photocatalytic CO2 reduction and H2O oxidation to hydrocarbons using CO as intermediate over In/TiO2 and (b) thermodynamic reduction based mechanism of CO2 reduction with H2O vapors to CO and CH4 over In/TiO2 catalyst. condition (t t o , P o 0), constant C could be calculated, where, t o is the reaction start up time or time delay of photo-activities due to transient state at which P o 0.After inserting the value of C in Eqs.(25) and (26) is obtained which was further simplified to get Eq.(27)tt o - , 38.02 , 48.26 , 55.29 , and 62.90 , which are consistent with the Summary of physiochemical characteristics of TiO2 and In/TiO2 samples. Table 2 highlights the operating parameters used in both type of reactors to calculate quantum Summary of operating parameters used for cell type and microchannel monolith photoreactor and calculated quantum efficiencies. 53 2 radicals.On the other hand, holes (h ) were transferred to H 2 O initiating its photooxidation yielding hydrogen ions (H ) and hydroxyal radical ( OH) and further oxidized with OH radicals for the production of O 2 and H 53.The H radicals originated during reduction of proton were reacted with carbon radicals on the catalyst surface to produce intermediate CH 2 , CH 3 and finally CH 4 and higher hydrocarbons (C 2 H 4 , C 2 H 6 and C 3 H 6 ).All possible reaction steps during photocatalytic CO 2 reduction with H 2 O are explained by Eqs.(3)-(11). Summary of products from photocatalytic CO2 reduction with H2O for different type of reactors and catalysts. 2 0.040 bar, PH 2 O 0.074 bar, T 373 K. a Yield rates calculated on 10 h irradiation basis. (17)uction with H 2 O could be developed.The results from previous section could enable kinetic model development for photocatalytic reduction of CO 2 and H 2 O.In general, the CO 2 with H 2 O was photocatalytically reduced to CH 4 and CO as the main products through the following reaction scheme as illustrated in Eq.(17). and K CH 4 are the ratios of adsorption to desorption equilibrium rate constants for H 2 O, CO 2 , CO, O 2 and CH 4 , respectively.During photocatalytic CO 2 reduction over the catalyst surface the rate equation can be determined with the assumptions: (a) reaction rate is proportional to the fraction of surface covered by CO 2 ; (b) H 2 O, CH 4 and O 2 are weakly adsorbed over the catalyst; (c) while CO 2 and CO are moderately adsorbed, then the rate equation becomes Eq.(19) 44.Rate of reduction kI a K H 2 O K CO 2 (P H 2 O P CO 2 ) (1 K CO 2 P CO 2 K CO P CO ) 2 k 2 K O 2 P O 2 (K CO P CO ) (21) Rate of formation k 1 K H 2 O P H 2 O K CO 2 P CO 2 (K CO P CO ) k 2 K O 2 P O 2 K CO P CO The authors would like to extend their deepest appreciation to the Ministry of Higher Education (MOHE), Malaysia and Universiti Teknologi Malaysia for financial support of this research under LRGS (Long-term Research Grant Scheme) and RUG (Research University Grant). desired product at any interval of time t.This kinetic model would be suitable for most of the photocatalytic CO 2 reduction processes in gaseous phase in which there will be strong movement of electrons at the catalyst surface and efficient conversion of CO to other products or desorption of CO from the catalyst surface.The kinetic equation should be useful for optimization purposes and can also be used to deduce the rate and product yield at any particular reaction time. The curves representing the profiles of CO production could be generated as a function of irradiation time using the proposed kinetic model (Eq.( 28)) to fit with the experimental data using the values of k 5 and k 6 as summarized in Table 4. CO and CH 4 formation profiles for proposed model and experimental data are illustrated in Figs. 14 and15.After inserting the constants, the model fittedwell with the experimental data.The good fitting of the model with experimental data confirmed CO to be strongly adsorbed over the catalyst surface as compared to other products.It may also be attributed to the possibility of strong mobility of electrons, and efficient desorption of products over the catalyst coated monolith surface."
  },
  {
    "title": "Conclusions",
    "content": "A microchannel monolith photoreactor with catalysts coated as very thin film on the walls of the channels is presented for higher CO 2 reduction rate.By doping TiO 2 with indium, pure anatase phase of TiO 2 was achieved with smaller particle size, larger surface area and mesoporous structure.The geometric of the monolith profoundly improved product yield rates.Furthermore, the effect of temperature, catalyst loading and partial pressure of CO 2 were also investigated.CO and CH 4 were observed as the main products with yield rate 962 and 55.4 mol g-catal. - h -1 , respectively and selectivity of 94.39 and 5.44, respectively over 10 wt. indium doped TiO 2 supported over microchannels at 373 K and 0.20 bars.The other products observed were C 2 H 4 , C 2 H 6 , and C 3 H 6 .The performance comparison between the photoreactors revealed 183-fold higher yield of CO in the monolith compared to cell type reactor.The quantum efficiency achieved in the cell type reactor was also much lower (0.0005) compared to the microchannel monolith reactor (0.10).More importantly, the quantum efficiency was significantly improved using microchannels compared to internally illuminated monolith as reported previously.The higher efficiency of the monolith photoreactor was supposedly due to higher illuminated surface area, higher photon energy consumption and better utilization of reactor volume.The kinetic equation based on L-H mechanism could effectively estimate the reaction rate and product formation during photocatalytic CO 2 reduction with H 2 O. Therefore, a new monolith photoreactor design is eminent in the photocatalytic reactor research field while indium doped TiO 2 is a highly efficient catalyst for maximizing CO yield rates and selectivity."
  }
]