[
  {
    "title": "Doi",
    "content": "10.1039/c6ce00248j"
  },
  {
    "title": "Article_Title",
    "content": "Synthesis of hierarchical flower-like Bi<sub>2</sub>MoO<sub>6</sub>microspheres as efficient photocatalyst for photoreduction of CO<sub>2</sub>into solar fuels under visible light"
  },
  {
    "title": "Abstract",
    "content": "Hierarchical flower-like Bi 2 MoO 6 microspheres were successfully synthesized via a facile hydrothermal approach, employing PVP as the crystal growth modifier.The building units of the hierarchical flower-like Bi 2 MoO 6 were constructed by two-dimensional thin flakes, which intercrossed with each other and aggregated together to form the three-dimensional flower-like structure.The PVP amount and hydrothermal duration played crucial roles in the formation of the Bi 2 MoO 6 architectures with evolving morphologies.The Bi 2 MoO 6 samples were first evaluated for the photocatalytic reduction of CO 2 into methanol and ethanol as solar fuels under visible-light irradiation.It has been found that the hierarchical flower-like Bi 2 MoO 6 exhibits highly efficient photocatalytic activity.After 4 hours of irradiation, the yields of methanol and ethanol were 24.8 and 18.8 mol g cat -1 respectively, higher than those obtained over previously-reported Bi 2 WO 6 hollow microspheres.This demonstrates that the hierarchical flower-like Bi 2 MoO 6 is a simple, efficient and promising visible-light-driven photocatalyst for the photoreduction of CO 2 into solar fuels."
  },
  {
    "title": "Experimental",
    "content": "All the reagents were analytical grade and used without further purification.Hierarchical flower-like Bi 2 MoO 6 microspheres were synthesized by the following procedure: 1.94 g Bi(NO 3 ) 3 5H 2 O, 0.484 g Na 2 MoO 4 2H 2 O and 0.3 g PVP were each dissolved in 20 mL of 1 M HNO 3 solution to obtain solutions A, B and C, respectively.Then, solutions B and C were added into solution A under vigorous stirring to obtain a suspension.After an additional agitation for 30 min at room temperature, the as-obtained colloidal suspension was transferred into a 100 mL Teflon-lined autoclave and heated at 180 C for 24 h.After that, the autoclave was cooled down to room temperature naturally.The precipitate was collected by centrifugation, washed with distilled water and absolute ethanol several times, and dried at 80 C under ambient air for 12 h. For the mechanistic study, different sets of hydrothermal reactions carried out for different time intervals (0, 1, 6, 12, 24 and 36 h) and using different PVP amounts (0, 0.05, 0.1, 0.2 and 0.3 g), using identical reaction conditions, were set up for the synthesis of Bi 2 MoO 6 . The X-ray diffraction (XRD) of powder samples was examined using a Bruker AXS-D8 Advance X-ray diffractometer with Cu K radiation in the 2 range of 10-70.Field-emission scanning electron microscopy (FESEM) was carried out on a Nova NanoSEM 450 microscope.Energy-dispersive X-ray spectroscopy (EDS) was obtained with the INCA 250 accessory of the Nova NanoSEM 450.Transmission electron microscopy (TEM) observations were performed on a JEOL JEM-2100 TEM.UV-vis diffuse reflectance spectra (DRS) were recorded using a Hitachi U-3900H UV-vis spectrophotometer using an integrating sphere accessory.The photoluminescence (PL) spectra were measured at room temperature using a Hitachi F4500 fluorescence spectrophotometer. Electrochemical measurements were carried out on an electrochemical analyzer (CHI 660D Instruments) in a standard three-electrode system, with the synthesized Bi 2 MoO 6 samples as the working electrodes with an active area of catalyst of 1.0 cm 2 , graphite as the counter electrode and a SCE (saturated calomel electrode) as a reference electrode.The Mott-Schottky measurement was performed at a fixed frequency of 1000 Hz with 5 mV amplitude.As for the photocurrent measurements, a 300 W Xe lamp equipped with an ultraviolet cut-off filter to provide visible light ( 420 nm) served as the visible light source.A 0.5 M Na 2 SO 4 aqueous solution was used as the electrolyte. 50 mg of Bi 2 MoO 6 powder were suspended in 50 mL of deionized water under stirring in a closed vessel at 4 C.A 300 W Xe arc lamp (PLS-SXE300) equipped with an ultraviolet cutoff filter to provide visible light ( 420 nm) was used as the light source.Prior to irradiation, the above suspension was thoroughly degassed to remove air, and high purity CO 2 gas (99.995) was bubbled into the solution for 30 min to expel dissolved oxygen in the reaction system.After beginning irradiation, 2 mL of suspension were sampled at certain time intervals and centrifuged to remove the photocatalyst particles.The products were qualitatively analyzed by an Agilent Technologies 7890A gas chromatograph (FID detector, DB-WAX column) through observing and comparing the chromatographic peaks with those for the authentic methanol and ethanol standard.During the whole photoreduction process, CO 2 gas was continuously bubbled through the solution at a rate of 50 mL min -1 .According to further analysis, the atomic molar ratio of Bi : Mo is approximately 2.1 : 1, which is close to the stoichiometric proportion of Bi 2 MoO 6 (2 : 1).Furthermore, the excess oxygen, as well as the carbon and nitrogen in the examined as-prepared catalysts, possibly originated from an organic contaminant and/or residual PVP."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The morphology and microstructure of BM-HFMS were observed by SEM and TEM.The panoramic image (Fig. 2a) shows that the BM-HFMS product is hierarchical flower-like microspheres with a diameter of ca.20-30 m.The highmagnification SEM image in Fig. 2b clearly reveals that the hierarchical flower-like microstructure is built by twodimensional thin flakes with a length of ca. 3 m and a thickness of ca.55 nm.These flakes are intercrossed with each other and aggregated together, constructing a threedimensional flower-like structure.The results indicate that the morphology and microstructure of the as-synthesized BM-HFMS are very different from those of other reported flower-like Bi 2 MoO 6 microspheres. 27,28Additionally, there are many pores with large diameter sizes among the flakes, which can serve as transport paths for small molecules. Further information about the BM-HFMS was obtained by TEM images.The image shown in Fig. 2c further confirms that the BM-HFMS is assembled from a large quantity of thin flakes, which interweave in the surface of the micro-solid Bi 2 MoO 6 (Fig. 2c andd).These results agree well with those observed by the SEM images.A high-resolution TEM (HRTEM) image (Fig. 2d) taken from the edge of the individual microsphere in Fig. 2c demonstrates the single-crystalline nature and clarifies the particular orientation of the flake.The lattice interplanar spacing is determined as 0.315 nm, corresponding to that of the (131) planes of orthorhombic Bi 2 MoO 6 .The selected area electron diffraction (SAED) pattern (inset of Fig. 2d) further clearly exhibits the singlecrystalline nature of the flake and can be indexed to the orthorhombic Bi 2 MoO 6 . N 2 -sorption measurements were carried out to determine the surface area and the pore structure of the BM-HFMS.Fig. 3 presents the adsorption-desorption isotherms and BJH pore distribution curve (in the inset).As per IUPAC classification, the N 2 isotherm of the BM-HFMS was a characteristic type III isotherm with a H3-type hysteresis loop, which is usually obtained over solid materials consisting of aggregates or agglomerates of particles forming slit-shaped pores (plates or edged particles), with a non-uniform size and/or shape. 39,40evertheless, the specific surface area (6.3 m 2 g -1 ), pore volume (0.022 cm 3 g -1 ) and pore size are relatively small, which may be attributed to the large particle size and open flower-like structure of the BM-HFMS.It can be seen that the BET results are well consistent with those of SEM and TEM. To understand the growth mechanism of the flower-like Bi 2 MoO 6 microspheres, the influence of the hydrothermal duration and PVP amount on the morphology and crystalline phase composition of Bi 2 MoO 6 were investigated by SEM (Fig. 4 and5) and XRD (Fig. 6a andb) in detail.First, a series of time-dependent experiments were performed, employing 0.3 g of PVP as the crystal growth modifier.The intermediate products at different intervals of ageing time were collected and characterized.As shown in Fig. 4a, before hydrothermal treatment, the starting precursors were almost spherical colloids formed by the agglomerated nanoparticles (Fig. 4a).The broad and weak peaks in the XRD pattern (Fig. 6a, 0 h) indicate the amorphous characteristics.After 1 h of hydrothermal reaction, a product comprised of irregular flakes and particles (Fig. 4b) was obtained.The corresponding XRD pattern, shown as the 1 h pattern in Fig. 6a, exhibits the crystal phases of Bi 2 Mo 3 O 12 and Bi 2 MoO 6. Upon increasing the reaction time to 6 h, most irregular particles disappeared and smooth nanoflakes were formed.The nanoflakes aggregated to construct a flocculent structure (Fig. 4c).As shown in Fig. 4d, when the reaction time was extended to 12 h, the flocculent products further grew and intercrossed microstructures began to form at the cost of small particles.As depicted by the XRD patterns of the products obtained at 6 h and 12 h in Fig. 6a, the crystalline phases of the products were Bi 2 MoO 6 as well as a small proportion of Bi 2 Mo 3 O 12 .Notably, increasing the hydrothermal time from 1 to 12 h resulted in the decrease of the Bi 2 Mo 3 O 12 phase and increase of the Bi 2 MoO 6 phase.This demonstrates that the Bi 2 Mo 3 O 12 phase could transform to Bi 2 MoO 6 during the hydrothermal treatment process.Upon further prolonging the reaction time to 24 h, well-defined hierarchical flower-like microspheres assembled by the microflakes were obtained (Fig. 4e).It is noted that the crystalline phase of the product was indexed as pure orthorhombic Bi 2 MoO 6 , and the Bi 2 Mo 3 O 12 phase disappeared (Fig. 1a; Fig. 6a,24 h).After hydrothermal treatment for 36 h, the flakes grew into much thicker plates with truncated corners and irregular outlines, which resulted in a bloated and tight flower-like morphology (Fig. 4f).However, a reaction time longer than 24 h did not affect the Bi 2 MoO 6 crystalline phase (Fig. 6a, 36 h).As a result, 24 h is the optimum hydrothermal treatment duration. PVP has been used for the synthesis of several photocatalysts with special morphologies, such as nest-like Bi 2 WO 6 , 37 flower-like BiOBr, 41 flower-like Bi 2 O 2 CO 3 42 and so on.In order to elucidate the role of PVP during the growth of the BM-HFMS, a series of Bi 2 MoO 6 products were synthesized by hydrothermal treatment for 24 h and adding different amounts of PVP.It was found that the morphologies of the as-synthesized Bi 2 MoO 6 products highly depended on the amount of PVP introduced in the synthesis reaction (Fig. 5). In the absence of PVP, the products were irregular and dispersed flakes (Fig. 5a).With a low amount of PVP (0.05 g), the product was composed of irregular flakes which assembled together (Fig. 5b).When 0.1 g PVP was added, the product was also assembled by irregular flakes, among which, however, partial ones intercrossed to form a sub-hierarchical microstructure (Fig. 5c).As the PVP amount was increased to 0.2 g, more flakes intercrossed together to form a hierarchical semi-flower-like Bi 2 MoO 6 microstructure (Fig. 5d).Further increasing the PVP amount to 0.3 g resulted in the welldefined flower-like Bi 2 MoO 6 architecture (Fig. 5e andf).Fig. 6b shows the XRD patterns of the above-mentioned Bi 2 MoO 6 samples synthesized by adding different amounts of PVP. The diffraction peaks of all the samples can be indexed to be pure orthorhombic Bi 2 MoO 6 phase without any impurity.Nevertheless, there are significant differences in the relative intensities of the (020), ( 131), ( 200), ( 002) and ( 006) peaks for all the samples, indicating the possibility of different prefer-ential orientation growth determined by the variable PVP amount.The XRD pattern of the product synthesized without using any PVP (Fig. 6b, 0 g) shows a remarkably strong (060) peak, displaying that the crystals have a strong preferential tendency to grow along the (060) direction.When PVP was added, the (060) peaks were observably suppressed, but the (200) peaks were enhanced to different extents (Fig. 6b, 0.05-0.3g).It was noted that the intensities of the (200) peaks decreased with the PVP amount increasing from 0.05 to 0.3 g.In addition, for the samples prepared by adding PVP amounts from 0.05 to 0.3 g, the ratio of intensity of the (131)/ (200) peaks is 2.03, 2.79, 2.39 and 2.67 respectively, which are much lower than those for the product synthesized without using PVP (4.49) and for the standard data (5.92,JCPDS file card No. 72-1524).These results demonstrate that the obtained samples are preferentially oriented along the (200) plane, and restrained along the (131) plane.It is well known that PVP can selectively absorb on some particular planes, thus resulting in the anisotropic structure and morphology of the products. 41ET analysis was also performed to get a better insight into the surface structure of the as-synthesized Bi 2 MoO 6 samples.The adsorption-desorption isotherms and BJH pore distribution curves (in the insets) of those samples are shown in Fig. S1 andS2. It can be seen that all samples exhibit the type III isotherm with type H3 hysteresis loops according to the IUPAC classification, which is in good agreement with their morphologies and microstructures.The obtained surface areas, pore volumes and pore diameters are tabulated in Table S1. Using 0.3 g PVP as the crystal growth modifier, the specific surface area of the Bi 2 MoO 6 samples decreased from 12.2 to 5.2 m 2 g -1 (entries 1-3, Table S1 ) with the hydrothermal duration extending from 0 to 6 h.However, when the time was prolonged to 24 h, an increase from 5.2 to 6.3 m 2 g -1 was obtained (entries 3-5, Table S1 ).It is well known that the specific surface area of nanoparticles is much higher than that of flakes with a large size.Hence, this phenomenon may be attributed to the gradual disappearance of the nanoparticles (0 h) and the formation of the hierarchical flowerlike microstructure (24 h).Nevertheless, when the hydrothermal time was increased to 36 h, there was a slight decrease of the specific surface area (entry 6, Table S1 ).This may be due to its bloated and tight flower-like morphology.Furthermore, upon increasing the PVP amount from 0 to 0.3 g, the specific surface area of the Bi 2 MoO 6 samples increased from 2.9 to 6.3 m 2 g -1 (entries 7-11, Table S1 ), which is due to the gradual assembly and intercrossing of the flakes.Obviously, the results of BET analysis are well consistent with the SEM data.The morphology and sizes of the Bi 2 MoO 6 samples are summarized and indicated in Table S1. It is believed that the crystal anisotropy and the faceinhibitor function of PVP play important roles in the formation of the flower-like microstructure. 33,42Before hydrothermal treatment, the starting precursors were also spherical colloids formed by agglomeration of nanoparticles without using PVP.These aggregated nanoparticles prefer to grow into a two-dimensional flake-like structure under the hydrothermal conditions, due to the high intrinsic anisotropic properties of Bi 2 MoO 6 . 28,43It is well known that the shape of nanostructures is strongly dependent on the relative chemical potential.The growth of two-dimensional Bi 2 MoO 6 flakes occurs only if the chemical potential of two surfaces is much higher than others.Nevertheless, PVP can be preferentially adsorbed onto the negative crystal face and inhibit its growth. 28,43Hence, while adding PVP in the synthesis process, the polymer molecules could preferentially adsorb on the primary nanoflakes and function as potential crystal face inhibitors in the system.The polymer interlayers formed on the nanoflakes are beneficial for the formation of oriented nucleation, which further results in the construction of hierarchical flower-like architecture built with well-ordered and oriented flakes.When the amount of PVP is small (0.05 and 0.1 g) in the reaction, the obtained Bi 2 MoO 6 crystals form assembled flakes (Fig. 5b) and a partially intercrossed flake structure (Fig. 5c), respectively.This phenomenon can be interpreted as there not being enough PVP serving as the soft template to induce the nanoflake assembly.With the amount of PVP being increased, the nanoflakes can assemble into a hierarchical conglomeration through molecular interaction between PVP molecules, and then transform into threedimensional flower-like microstructures driven by the minimization of surface energy. 42ased on the above results, the possible growth pattern and formation mechanism of the BM-HFMS is proposed in Scheme 1.In the initial stage, the precursors are amorphous nanoparticles which tend to aggregate together, driven by reducing their surface energy.Then the crystal growth follows.During the early period of hydrothermal treatment, twodimensional nanocrystal flakes are formed due to the growth habit of Bi 2 MoO 6 , at the cost of the nanoparticles.As the reaction continues, irregular nanoparticles vanish, and nanoflakes grow and interweave to form a three-dimensional flocculent microstructure.Upon further prolonging the hydrothermal time, a dissolution-recrystallization process (Ostwald ripening) takes place, which leads to the disappearance of the smaller Bi 2 MoO 6 flakes but the growth of the bigger ones.Finally, well-defined hierarchical flower-like Bi 2 MoO 6 crystals are formed through the mass diffusion and Ostwald ripening process.During the growth process of the flakes, PVP is adsorbed on the specific crystal plane to inhibit its growth and introduce the nanoflake assembly. The optical properties of semiconductors, which are relevant to their electronic structural features, are recognized as important factors to evaluate their photocatalytic activity.According to the UV-vis spectra (Fig. 7), the Bi 2 MoO 6 samples show intense photoabsorption properties from the UV light region to the visible light region with wavelength shorter than 500 nm, suggesting that they could be photoexcited under visible-light irradiation.The steep shape of the spectra indicates that the visible light absorption is due to the bandgap transition rather than the transition from the impurity level. 28,44It is notable that a slight red shift of the absorption band edge of the Bi 2 MoO 6 samples (from 2.66 to 2.42 eV) can be observed with the increase of the PVP amount from 0 to 0.3 g and hydrothermal time from 0 to 36 h, which may be associated with the gradually completed flower-like morphology and the self-assembled structure.Such an enhancement in the visible-light absorbance of Bi 2 MoO 6 is beneficial for the increase of photo-generated electrons and holes. The electron-hole separation efficiency of photocatalysts is a determining factor for the photocatalytic activity.PL spectra, owing to recombination of free carriers, can reveal the migration, transfer and recombination processes of the photogenerated electron-hole pairs in semiconductors. 45,46he PL emission spectra of the Bi 2 MoO 6 samples were measured with an excitation light of 300 nm, and the results are shown in Fig. 8.The spectra clearly indicate that the PL emission intensities of the Bi 2 MoO 6 samples decrease with the increasing PVP amount from 0 to 0.3 g (Fig. 8a) and hydrothermal time from 0 to 24 h (Fig. 8b).The decreased emission intensity suggests that the recombination of charge carriers is hindered effectively, which may be beneficial to the photocatalytic ability.Upon further prolonging the hydrothermal time to 36 h, there is an increase of the PL emission intensity, which can be ascribed to the crystal defects caused by the long ageing time.As shown in Fig. 8, the BM-HFMS exhibit the best separation efficiency of photogenerated electron-hole pairs, which may be attributed to the well-defined hierarchical flower-like morphology and structure. Photoelectrochemical measurement is another available methodology to determine the formation and transfer of photogenerated electrons from a semiconductor under light illumination.As shown in Fig. 9, it can be seen that obvious anodic photocurrents are obtained over the Bi 2 MoO 6 samples under visible light.The transient photocurrent responses are quite rapid, reversible and stable during four intermittent onoff irradiation cycles.These results confirm that the Bi 2 MoO 6 electrodes behave photoactively and also give a steady photoelectrochemical performance under visible-light illumination.It is noted that the photocurrent intensities of the Bi 2 MoO 6 samples increase with the increase of the PVP amount (0-0.3 g; Fig. 9a) and hydrothermal time (0-24 h; Fig. 9b).Further increasing the hydrothermal time to 36 h caused a slight decline of the photocurrent responses.Obviously, the photocatalyst BM-HFMS shows the highest photocurrent, indicating that this sample may achieve more effective charge separation and photocatalytic activity than the other Bi 2 MoO 6 samples.This results are consistent with those from the PL spectra. As far as we know, there has been no report about Bi 2 MoO 6 being used as a photocatalyst for the photoreduction of CO 2 .In this study, we evaluated the photocatalytic activity of the as-synthesized Bi 2 MoO 6 samples for the photoreduction of CO 2 with H 2 O under visible light ( 420 nm) irradiation.It was found that methanol and ethanol were yielded as the major products, and no obvious other products such as HCHO and HCOOH were detected in the liquid phase.Furthermore, there were also no gas products such as CH 4 and CO captured.Control experiments indicated that no appreciable reduction products were detected in the absence of either photocatalyst or light irradiation, suggesting that the CO 2 reduction proceeded via photocatalytic reaction on the photocatalyst.In addition, no kinds of products were found by introducing N 2 instead of CO 2 into the photocatalyst suspension under visible-light irradiation.This demonstrates that the photocatalysts and their residual intermediates do not contribute the organic products, and that CO 2 is the only source in the photoreduction process. Fig. 10 shows the production of methanol and ethanol over the as-synthesized Bi 2 MoO 6 samples as a function of the PVP amount (Fig. 10a andb) and hydrothermal time (Fig. 10c andd).As the data in Fig. 10a andb show, the BM-HFMS photocatalyst prepared by adding 0.3 g of PVP exhibited the best activity in photocatalytic CO 2 reduction towards the generation of methanol and ethanol as a valuable solar fuel.After 4 h of irradiation, the yields of methanol and ethanol were 24.8 and 18.8 mol g cat -1 , respectively.The combination of the well-defined hierarchical flower-like morphology and self-assembled structure of the BM-HFMS were responsible for its superior photocatalytic performance.Compared with the other Bi 2 MoO 6 samples, the hierarchical flower-like framework of the BM-HFMS endows it with a Fig. 8 The photoluminescence spectra ( excitation 300 nm) of the Bi 2 MoO 6 samples: (a) prepared using different amounts of PVP, and (b) prepared using different reaction times.higher interlayer and surface loading ability, acting as both light-harvesting centers and active adsorption centers, which contributes to the higher photocatalytic CO 2 reduction activity.On the other hand, a suitable hydrothermal time is also important for the photocatalytic activity of the Bi 2 MoO 6 samples.As shown in Fig. 10c andd, the methanol and ethanol yields first increased with increasing the hydrothermal time up to 24 h, and then slightly reduced with further increasing the hydrothermal time to 36 h.The XRD and SEM results (Fig. 4 and6a) demonstrate that the hydrothermal time significantly affected the crystallographic characteristics (including the crystal polymorph and crystallinity), textural features (including morphology and structure) and interlayer and surface guest incorporation (affecting light harvesting and reactant adsorption) of the Bi 2 MoO 6 samples, which were crucial in tuning the photocatalytic CO 2 reduction properties.Obviously, the superior photocatalytic activity of the BM-HFMS is attributed to its single-crystalline nature, well-defined hierarchical flower-like morphology and ordered structure.Moreover, the order of photocatalytic efficiency in CO 2 reduction over the as-synthesized Bi 2 MoO 6 samples is consistent with the results of photoabsorption performance, and the recombination rate of photogenerated electron-hole pairs, which further demonstrates that the photocatalytic performance of Bi 2 MoO 6 photocatalysts highly depends on the crystallinity, morphology and architecture. In order to further elucidate the important role of the hierarchical flower-like morphology and self-assembled structure for the photocatalytic reduction of CO 2 , Bi 2 MoO 6 nanoparticles 47 and nanoplates 48 were prepared and evaluated for the photoreduction of CO 2 .As shown in Table 1, it can be seen that the yields of methanol and ethanol over Bi 2 MoO 6 nanoparticles (entry 1, Table 1) and nanoplates (entry 2, Table 1) were only 16.1 and 11.5 mol g cat -1 , and 13.3 and 10.2 mol g cat -1 , respectively, which are much lower than those over the BM-HFMS (24.8 and 18.8 mol g cat -1 ; entry 4, Table 1).In addition, Cheng et al. 25 reported that Bi 2 WO 6 hollow microspheres displayed high visible-light photocatalytic conversion of CO 2 into methanol.For comparison, we synthesized Bi 2 WO 6 hollow microspheres and evaluated the photocatalytic activity for CO 2 reduction under the same reaction conditions adopted in this study.It was found that methanol and ethanol were also the main products, and the corresponding yields were 17.4 and 10.5 mol g cat -1 , respectively (entry 3, Table 1), lower than those observed over the BM-HFMS (24.8 and 18.8 mol g cat -1 ; entry 4, Table 1).It is apparent that the BM-HFMS shows a much better photocatalytic performance, and has promising potential to be further improved. Furthermore, the electrochemical properties of the BM-HFMS were studied using a standard three-electrode cell.Fig. 11 shows the Mott-Schottky plot with BM-HFMS being the working electrode (with 0.5 M Na 2 SO 4 with a pH of 7 used as the electrolyte).The flat band potential of BM-HFMS is calculated to be -0.50 eV vs. SCE (equivalent to -0.26 eV vs. NHE).Based on the above data, the conduction band of BM-HFMS is calculated to be at -0.46 eV vs. NHE.It was reported that the potential of CO 2 being changed into methanol is -0.38 eV (vs.NHE at pH 7.0) and that of CO 2 being changed into ethanol is -0.33 eV (vs.NHE at pH 7.0). 49,50Therefore, the conduction band level of the Bi 2 MoO 6 photocatalyst is more negative than those of the CO 2 /reduced-product redox couples, which produces enough driving force for the photocatalytic reduction of CO 2 into solar fuels.Bi 2 MoO 6 is a simple, efficient and promising photocatalyst for the photoreduction of CO 2 into solar fuels."
  },
  {
    "title": "Conclusions",
    "content": "Structure and morphology characterizationHierarchical flower-like Bi 2 MoO 6 microspheres (denoted as BM-HFMS) were directly synthesized by hydrothermal treatment for 24 h with 0.3 g of PVP as the crystal growth modifier.The crystalline phase and purity of the BM-HFMS was analyzed by XRD.It can be seen that all the sharp reflection peaks in the XRD pattern (Fig.1a) can be indexed as the pure orthorhombic phase of Bi 2 MoO 6 , with lattice constants of a 5.506 A, b 16.226A and c 5.487 A, consistent with the standard values (JCPDS file card No. 72-1524).No peaks of any other phases or impurities were detected in this pattern.Additionally, an EDS analysis was carried out to further investigate the composition of the BM-HFMS.The EDS result, shown in Fig. 1b, reveals the obvious signals of O, Bi and Mo elements. Fig. 1 (a) XRD pattern and (b) EDS spectrum of the hierarchical flower-like Bi 2 MoO 6 microspheres. Fig. 2 (a, b) SEM and (c, d) TEM images of the hierarchical flower-like Bi 2 MoO 6 microspheres. Fig. 3 N 2 adsorption-desorption isotherm and BJH pore distribution curve of the hierarchical flower-like Bi 2 MoO 6 microspheres. Fig. 4 SEM images of Bi 2 MoO 6 samples prepared under different hydrothermal times in the presence of 0.3 g PVP: (a) 0 h, (b) 1 h, (c) 6 h, (d) 12 h, (e) 24 h and (f) 36 h. Fig. 5 SEM images of Bi 2 MoO 6 samples prepared by hydrothermal treatment for 24 h in the presence of different amounts of PVP: (a) 0 g, (b) 0.05 g, (c) 0.1 g, (d) 0.2 g and (e, f) 0.3 g. Fig. 6 XRD patterns of Bi 2 MoO 6 samples: (a) prepared under different hydrothermal times, and (b) prepared using different amounts of PVP. Scheme 1 Schematic representation of the formation mechanism of the hierarchical flower-like Bi 2 MoO 6 microspheres. Fig. 7 UV-visible diffuse reflectance spectra of the Bi 2 MoO 6 samples: (a) prepared using different amounts of PVP, and (b) prepared using different hydrothermal times. Fig. 9 Photocurrent of the Bi 2 MoO 6 samples: (a) prepared using different amounts of PVP, and (b) prepared using different hydrothermal times. Fig. 10 Photocatalytic activity of the Bi 2 MoO 6 samples: (a, b) prepared using different amounts of PVP, and (c, d) prepared using different hydrothermal times. Hierarchical flower-like Bi 2 MoO 6 microstructures built by intercrossed two-dimensional thin flakes were successfully synthesized by a facile and economical method, with the assistance of PVP.The formation mechanism and the effects of the PVP amount and hydrothermal time were investigated in detail.It is believed that the crystal anisotropy and the faceinhibitor function of PVP play important roles during the crystal growth of the hierarchical flower-like microstructures.The resulting hierarchical flower-like Bi 2 MoO 6 crystals show good photoabsorption performance, separation efficiency of photogenerated electron-hole pairs and photocatalytic activity for the photoreduction of CO 2 into methanol and ethanol under visible-light irradiation.It is noted that the fabricated flower-like Bi 2 MoO 6 exhibits superior photocatalytic activity over Bi 2 MoO 6 nanoparticles and nanoplates, as well as Bi 2 WO 6 hollow microspheres.This work demonstrates that Fig. 11 Mott-Schottky plot of the hierarchical flower-like Bi 2 MoO 6 microspheres. Photocatalytic activity of different Bi 2 MoO 6 and Bi 2 WO 6 samples under visible-light irradiation a Bi 2 MoO 6 nanoparticles and nanoplates, as well as Bi 2 WO 6 hollow microspheres, were prepared according to ref.25, 47 and 48, respectively. This work was financially supported by the National Natural Science Foundation of China (Grant No. 51572119, 51238002 and 51272099), Natural Science Foundation of Jiangxi Province (Grant No. 20151BAB203012), and Natural Science Foundation of Jiangxi Provincial Department of Education (Grant No. GJJ14537 and GJJ14516)."
  }
]