[
  {
    "title": "Doi",
    "content": "Doi not found"
  },
  {
    "title": "Article_Title",
    "content": "Surface Characteristics of ZnS Nanocrystallites Relating to Their Photocatalysis for CO 2 Reduction 1"
  },
  {
    "title": "Abstract",
    "content": "Hexagonal ZnS nanocrystallites (ZnS-DMF(OAc); ca. 2 nm in diameter) prepared in N,N-dimethylformamide (DMF) using Zn(CH3COO)22H2O (Zn(OAc)22H2O) as the Zn 2 source and H2S as the sulfur source catalyzed selective photoreduction of CO2 to HCOO -in the presence of triethylamine as an electron donor.When excess zinc acetate was added to the system, the efficiency increased while still keeping the product selectivity.The photocatalytic behavior of ZnS-DMF(OAc) is in contrast to that of ZnS-DMF-(ClO4) prepared using Zn(ClO4)26H2O as the Zn 2 source, where both HCOO -and CO were produced, especially when excess zinc perchlorate was added into the system.FT-IR analysis of the ZnS-DMF(OAc) system revealed the presence of SH groups on the surface, explaining the gradual growth of the size with the addition of excess zinc acetate into the system.Extended X-ray absorption fine structure analysis revealed the correlation between the photocatalysis and the microscopic surface structure change of the ZnS nanocrystallites induced by the addition of Zn 2 to the nanocrystallite systems.The intimately interacting acetate ions to Zn atoms should prevent the formation of sulfur vacancies as catalytic sites of CO production, contributing to the enhanced photocatalytic activity for production of HCOO -due to the formation of the DMF-coordinated nanocrystallites."
  },
  {
    "title": "Experimental",
    "content": "Preparation of Colloidal ZnS Photocatalysts.Colloidal ZnS nanocrystallites (ZnS-DMF) were prepared from a 20 mM, deaerated DMF (spectral grade, Dojin Chemical Laboratories) solution of Zn(ClO4)26H2O (reagent grade, Mituwa) or Zn(OAc)2 2H2O (reagent grade, Wako Pure Chemicals) by introducing H2S (99.9,Sumitomo Pure Chemicals) gas under stirring on an ice bath at 0 C. 10ZnS-DMF was purged with nitrogen for 1.5 h to remove unreacted H2S before use.The effect of excess Zn 2 was evaluated using the system prepared by adding a DMF solution of Zn(ClO4)26H2O or Zn(OAc)22H2O into the starting ZnS-DMF solution.The ZnS-DMF solutions with the addition of excess Zn 2 were stirred for 30 min after the addition of Zn 2 ions on an ice bath at 0 C.The ZnS-DMF prepared from Zn-(ClO4)26H2O and Zn(OAc)22H2O are abbreviated to ZnS-DMF-(ClO4) and ZnS-DMF(OAc), respectively.In addition, the systems containing a 0.2 or 0.4 molar ratio of excess Zn 2 to ZnS-DMF are abbreviated as ZnS-DMF/Zn0.2and ZnS-DMF/ Zn0.4,respectively. Procedure for ZnS-DMF-Catalyzed Photoredox Reactions and Analysis.A DMF solution (2 mL) containing 10 mM (diatomic) of ZnS nanocrystallites as a photocatalyst and 1 M of distilled TEA as an electron donor was saturated with CO2 for photoredox reactions.The solution in a closed Pyrex tube (8mm diameter) was irradiated with a 500-W high-pressure Hg lamp using a optical filter ( 290 nm) under cooling on a water bath (25 C). Gas analysis of CO and H2 was carried out in the same run using gas chromatography (GC-12A chromatograph, Shimadzu Co. Ltd.) with an active carbon column (3 mm 3 m) at 100 C.Formic acid analyses were performed using ion exchange chromatography with a TSK gel SCX(H ) column (7.8 mm 30 cm, TOSOH) at 40 C and a UV detector (Model UV-8011, TOSOH).An aqueous 2 mM phosphate solution was used as an eluent at 0.8 mL/min. Material Characterization.UV-vis spectra were measured with a UV spectrophotometer U-3300 (Hitachi Ltd.).All optical characterizations were carried out at room temperature. The infrared spectra were obtained using a dry-air-purged Perkin-Elmer System-2000 FT-IR spectrometer and a Spectra-Teck ATR attachment with a ZnSe rod cell.All spectra were measured by averaging 32 scans at a spectral resolution of 4 cm -1 .Difference infrared spectra were obtained by subtracting a reference spectrum from the sample spectra.DMF solution was used for measurement of a reference spectrum. EXAFS Measurement and Analysis.Zn K-edge (9660 eV) EXAFS measurements were performed on the BL-12C at the Photon Factory of the National Laboratory for High Energy Physics.The details of these analyses are described elsewhere. 19ata were collected at room temperature in the fluorescence mode.A short ionization chamber filled with nitrogen gas was used to monitor the intensity of the incident beam.The fluorescence intensity was measured using a fluorescent ion chamber detector filled with argon gas.A copper filter (6-m thick) was used to reduce elastically and inelastically scattered X-rays.The X-ray energy was scanned with an integration time of 2 s in the region from 9160 to 9760 eV (225 data points), with 4 s in the region from 9760 to 10160 eV (161 data points), and with 10 s in the region from 10160 to 10500 eV (247 data points).The energy calibration was carried out by measuring Cu K-edge (8980 eV) XANES spectrum of a copper foil (6-m thick).The concentration of zinc ions in solution for in situ EXAFS measurements was 10 mM.A polyethylene bag was used as a cell for EXAFS measurements of solution.A few milliliters of sample solution were transferred to the cell just before use.For powder samples, pellets of Zn compounds (ca 1 wt ) mixed with polyethylene as a binder were used.Bulk ZnS powder (99.99,Aldrich) and an aqueous solution of Zn(ClO4)26H2O were used as standard samples to determine reference parameters for the first shell of Zn-S and Zn-O, respectively. The EXAFS data were analyzed according to a previously described standard procedure. 18,19,2223324 Background spectra were separately measured with each pure solvent or polyethylene without Zn compounds and then were subtracted from sample spectra.The EXAFS spectra were extracted with normalization of the edge step, interpolation onto a photoelectron momentum vector, and subtraction of the postedge background.The resulting EXAFS oscillations were multiplied by k 3 and Fourier-filtered with Hamming windows.The Fourier-filtered data were analyzed by nonlinear least-squares curve-fitting techniques. Reduction.ZnS-catalyzed photoreduction of CO 2 was carried out in DMF for 5 h under UV irradiation using ZnS-DMF(OAc) or ZnS-DMF(ClO 4 ) as a photocatalyst and TEA as a sacrificial electron donor.Figure 1a,b shows that the photocatalytic activity and selectivity largely depends on the source of Zn 2 ions, Zn(OAc) 2 2H 2 O or Zn(ClO 4 ) 2 6H 2 O, and the quantity of excess Zn 2 in the reaction systems.The formation of HCOO -increased from 33 to 86 mol by the addition of 0.4 equiv of excess Zn 2 into the ZnS-DMF(ClO 4 ) system (Figure 1a).Further, the addition of more than 0.4 equiv of excess Zn 2 led to a decrease of the production of HCOO -with the competitive formation of CO, as reported previously. 10As the amount of excess Zn 2 increased, the formation of CO was increased from 3.8 to 87 mol with increasing H 2 evolution.On the other hand, excess Zn 2 affected the formation of HCOO -and CO when ZnS-DMF(OAc) was used as a photocatalyst.The amount of photoformed HCOO - increased from 17 to 77.0 mol and CO increased from 1.0 to 9.0 mol as excess Zn 2 increased to a 0.4 equiv ratio (Figure 1b).The formation of HCOO -and CO tends to level off around more than 0.4 equiv of excess Zn 2 .The enhancement of CO production due to excess Zn 2 is a modest increase compared to that of the ZnS-DMF(ClO 4 ) system, indicating that the photocatalytic activity and selectivity depends on the choice of the counteranion in the starting zinc salt. In situ Observation of Surface Structures of ZnS Nanocrystallites.IR Measurements.To prove the surface structure of ZnS nanocrystallites, FT-IR analysis was undertaken for some DMF solutions of related species.Figure 2 shows difference infrared spectra of DMF solutions with H 2 S, ZnS-DMF(ClO 4 ) (10 mM), and ZnS-DMF(OAc) (10 mM), respectively.The DMF solution of H 2 S was prepared by purging with N 2 after saturating with H 2 S gas.In Figure 2a, the broad band observed at 2538 cm -1 is assigned to a S-H stretching vibration of SH -formed by the dissociation of H 2 S due to moisture in DMF.ZnS-DMF(ClO 4 ) showed this band slightly, but no other band was observed.On the other hand, a new band at 2593 cm -1 emerged in the spectrum of ZnS-DMF(OAc).This band can be assigned to the S-H stretching vibration of the SH group on the surface of ZnS-DMF(OAc) nanocrystallites.The relatively strong band at 2593 cm -1 reflects the higher density of SH groups on the ZnS nanocrystallites prepared from Zn(OAc) 2 2H 2 O compared to that of nanocrystallites prepared from Zn-(ClO 4 ) 2 6H 2 O. UV-vis Spectra. Figure 3a,b shows effects of adding Zn 2 to ZnS-DMF solutions on the absorption spectra of ZnS-DMF(ClO 4 ) and ZnS-DMF(OAc).The absorption onset of both ZnS-DMF just prepared from respective zinc salts and H 2 S were the same.However, a crucial difference in the absorption spectra was observed when excess Zn 2 was added into the ZnS-DMF systems.The addition of excess Zn 2 did not affect the absorption spectrum of ZnS-DMF(ClO 4 ) (Figure 3a), indicating no size growth by the addition of excess Zn 2 to ZnS-DMF-(ClO 4 ).On the other hand, the addition of excess Zn 2 to the ZnS-DMF(OAc) system induced a red shift of the absorption onset (Figure 3b).The onset shifted to a lower wavelength until 0.8 equiv of excess Zn 2 was added.The red shift was about 10 nm in the absorption spectrum for ZnS-DMF(OAc), indicating that excess Zn 2 leads to a size growth of ZnS-DMF(OAc) by the reaction of the added excess Zn 2 with the surface of ZnS-DMF(OAc).On the basis of the effective mass approximation, 252627 this red shift reflects a size growth of about 2 A.Comparing the increase in the radius by 2 A with the Zn-S bond length (2.342 A), 28 the addition of excess Zn 2 appear to result in one monolayer growth of ZnS-DMF(OAc). 29XAFS Measurement.Figure 4a,b shows phase-uncorrected Fourier transforms of k 3 -weighted EXAFS for standard samples (bulk ZnS powder and an aqueous solution of zinc perchlorate).The dashed and solid lines in EXAFS figures represent an intensity of the imaginary part and the absolute value in Fourier transforms of k 3weighted EXAFS, respectively.The peak at 1.95 A in the Fourier transform (Figure 4a) for bulk ZnS powder can be assigned to a four coordination of sulfur atoms in the ZnS crystal lattice.For an aqueous solution of zinc (29) The increase in the photo activity induced by the initial addition of excess Zn 2 to the ZnS-DMF(OAc) system may be attributed to the increment in light absorption because the effective light absorption could be expected at 313 nm of the line spectrum of the used highpressure Hg lump.perchlorate, the observed peak at 1.65 A in the Fourier transform (Figure 4b) was assigned to a six coordination of oxygen atoms of water molecules solvated to Zn 2 ions. 3031132 The Fourier-filtered k 3 (k) of bulk ZnS powder and an aqueous zinc perchlorate solution were fitted well by using the reported bond lengths of Zn-S (2.342 A) 28 and Zn-O (2.08 A), 30 respectively (Table 1).Reference parameters were derived from the fitting procedure. Figure 5a shows phase-uncorrected Fourier transform of k 3 -weighted EXAFS for ZnS-DMF(ClO 4 ).The main peak at 1.92 A in the transform of ZnS-DMF(ClO 4 ) is broader than that in bulk ZnS powder (Figure 4a).This greater transform may be attributed to the superposition of a different coordination shell around the zinc atoms.Since the oxygen atom of a DMF molecule can coordinate to a Zn 2 ion as mentioned in a previous paper, 19 the different coordination may be due to the oxygen atoms of DMF molecules solvating to zinc atoms on the surface of ZnS nanocrystallites.A two-shell fitting for Fourierfiltered k 3 (k) of ZnS-DMF(ClO 4 ) was performed to interpret quantitatively the coordination in the system.As shown in Table 1, the best fitting was achieved with a two-shell fit of Zn-S and Zn-O.A one-shell fit of Zn-S gave no acceptable fitting results.Thus, these curvefitting results indicate that zinc atoms on the surface of ZnS nanocrystallites should be coordinated not only by the sulfur atoms in ZnS nanocrystallites but also by the oxygen atoms of solvating DMF molecules.Figure 5b,c shows phase-uncorrected Fourier transforms of k 3weighted EXAFS for ZnS-DMF(ClO 4 )/ZnX (X ) 0.2 and 0.4) solution, respectively.The increase of intensity in the magnitude as well as the imaginary part at 1.65 A was clearly observed.This result suggests that the contribution to the scattering due to the solvating DMF oxygen increased as the amount of excess Zn 2 increased. Figure 6 shows the phase-uncorrected Fourier transform of k 3 -weighted EXAFS for ZnS-DMF(OAc)/ZnX (X ) 0.0, 0.2, and 0.4).The transforms of ZnS-DMF(OAc) were quite different from those of ZnS-DMF(ClO 4 ).The magnitude around 1.7 A in the transforms of ZnS-DMF-(OAc) was smaller than that in ZnS-DMF(ClO 4 ), suggesting a lower contribution to the scattering by oxygen atoms of DMF molecules (Figure 6a).This result suggests that the contributions of oxygen atoms in ZnS-DMF(OAc) are much smaller than in ZnS-DMF(ClO 4 ).In addition, evolution of the Zn-O component at 1.65 A by the addition of excess Zn 2 was not observed clearly for ZnS-DMF- (OAc) compared with that of ZnS-DMF(ClO 4 ).A twoshell fitting for Fourier-filtered k 3 (k) was performed.Excellent fits were obtained with a two-shell fit of Zn-S and Zn-O (Table 1) but not with a one-shell fit of Zn-S, indicating that DMF molecules solvating to the ZnS nanocrystallite surfaces exist in both systems. The coordination number (CN) for the Zn-O shell of ZnS-DMF(ClO 4 ) (1.66) was larger than that of ZnS-DMF-(OAc) (1.02).This fact indicates that the number of DMF molecules adsorbed on ZnS-DMF(OAc) is smaller than that of ZnS-DMF(ClO 4 ).In addition, the CN of the Zn-S shell in ZnS-DMF(OAc) (4.40) was significantly greater than that of ZnS-DMF(ClO 4 ) (3.66).The larger CN of the Zn-S shell and the smaller CN of the Zn-O shell in ZnS-DMF(OAc) suggest that the surface zinc atoms should be terminated more by sulfur atoms and solvated less by DMF molecules than those in ZnS-DMF(ClO 4 ). Figure 7 shows the effect of excess Zn 2 on the CN of Zn-O and Zn-S shells determined by EXAFS analysis of ZnS-DMF(ClO 4 ) and ZnS-DMF(OAc), respectively.The changes of CN values by the addition of excess Zn 2 are very similar in both systems.As excess Zn 2 increased, CN Zn-S decreased and CN Zn-O increased.We have also reported similar changes of CNs for Cd-S and Cd-O bonding in CdS nanocrystallites with excess Cd 2 in a previous paper.This was attributed to the adsorption of excess Cd 2 solvated by DMF molecules onto the surface of CdS nanocrystallites. 1 These changes of CN for Zn-S and Zn-O bondings indicate that the adsorption of excess Zn 2 solvated by DMF molecules occurred on the ZnS-DMF nanocrystallites surface. 19The values of CN of ZnS-DMF(ClO 4 ) and those of ZnS-DMF(OAc) are quite different before the addition of excess Zn 2 into the systems.It is interesting to note that the CN values in the system of ZnS-DMF(OAc)/Zn0.4 are quite close to those of the ZnS-DMF(ClO 4 ) system.This fact suggests that the addition of 0.4 equiv excess Zn 2 into the ZnS-DMF(OAc) should give a bonding sphere (Zn-O and Zn-S bonds) which is comparable with that of ZnS-DMF(ClO 4 ).Actually, the selectivity (i.e., the ratio of CO to HCOO -) is almost the same in the photocatalysis using both nanocrystallites, although the activity is different in both cases.The difference in the activity may be explained as due to the difference in their particle size. When the estimated error by using Sakane's method is taken into account, 24 the bond length and the value of the square of the Debye-Waller factor for the Zn-S shell in ZnS-DMF(ClO 4 ) (r, 2.34 A; 2 , 0.080 A 2 ) and ZnS-DMF-(OAc) (r, 2.34 A; 2 , 0.083 A 2 ) were comparable to those in bulk ZnS powder (r, 2.34 A; 2 , 0.079 A 2 ).This fact implies that a crystalline lattice of ZnS nanocrystallites as well as surface Zn-S structure is not affected by the choice of the coexistent counteranions.In contrast, the Zn-O bond length in ZnS-DMF(OAc) (2.03 A) was shorter than that in ZnS-DMF(ClO 4 ) (2.06 A). The present FT-IR and EXAFS analyses have revealed that the surface characteristics of ZnS nanocrystallites in DMF are influenced by the zinc salts used as a Zn 2 source at in situ preparation.The ZnS nanocrystallites, ZnS-DMF(OAc) and ZnS-DMF(ClO 4 ), were analyzed after elimination of excess H 2 S from the prepared nanocrystallite system.ZnS-DMF(OAc) prepared using Zn(OAc) 2 2H 2 O has been found to have SH sites on the ZnS surface.The SH-rich microscopic surface structure was also supported by the small CN of Zn-O and large CN of Zn-S in the EXAFS analysis of ZnS-DMF(OAc).However, ZnS-DMF(ClO 4 ) prepared similarly using Zn(ClO 4 ) 2 6H 2 O was characterized as fully DMF-solvated nanocrystallites with few SH sites. Both ZnS nanocrystallite systems show interesting photocatalysis for the CO 2 reduction using TEA as an electron donor.It is believed that DMF-solvated Zn atoms on ZnS nanocrystallites should work as reaction sites in the photoreduction of CO 2 to HCOO -.The formation of HCOO -was more effective in using ZnS-DMF(ClO 4 ) than ZnS-DMF(OAc), because Zn atoms on the ZnS nanocrystallites surface were covered with sulfur species in ZnS-DMF(OAc).The formation of HCOO -was enhanced when the ZnS-DMF(OAc) system was treated with excess Zn 2 .In the EXAFS analysis of ZnS-DMF(OAc), the CN Zn-O increased with the addition of excess Zn 2 , which explains not only the elimination of SH sites but also solvation of DMF molecules as a result of the adsorption of excess Zn 2 on the ZnS surface.The effective formation of HCOO -can be rationalized as due to the increment of DMF-solvated Zn atoms on the ZnS nanocrystallites as active sites for the production of HCOO -. In the preceding paper, 33 we reported an interaction of DMF molecules with ZnS nanocrystallites prepared in acetonitrile (AN).The DMF molecules on ZnS-AN(ClO 4 ) prepared from Zn(ClO 4 ) 2 6H 2 O in AN should be wellsolvated via the polarized structure ((CH 3 ) 2 N CHO -) of DMF molecules, suggesting that perchlorate anions associate loosely with the surface Zn atoms of ZnS nanocrystallites.The system of ZnS-AN(OAc) prepared from Zn(OAc) 2 2H 2 O demonstrated a relatively stronger interaction with DMF molecules than ZnS-AN(ClO 4 ), although DMF molecules on the ZnS nanocrystallites were weakly bound in both cases.These observations indicate that acetate anions tend to interact intimately with ionic Zn species in DMF and AN.In fact, the acetate anion was reported to interact with Zn 2 in water, giving a disordered octahedral solvated structure between the Zn 2 ion and H 2 O molecules. 30The shorter bond length in the Zn-O shell observed in the EXAFS analysis of the ZnS-DMF-(OAc) system might result from such intimate interaction of acetate anions with Zn atoms on the nanocrystallites, leading to the change in the solvating structure of DMF molecules on the surface. The formation of SH sites in the ZnS-DMF(OAc) system may be due to the interaction of the acetate anion with Zn atoms on the initially formed ZnS nanocrystallites.When the interaction of the acetate anion interferes with the solvation of ZnS nanocrystallites by DMF molecules is taken into account, the surface SH groups can be (33) Fujiwara, H.; Murakoshi, K.; Wada, Y.; Yanagida, S. Langmuir, in press.explained by the reaction of the acetate-interacting Zn atoms on the surface with SH -species.Surface Zn atoms which are not fully solvated may be allowed to react with excess H 2 S in DMF; these might give the ZnS nanocrystallites having SH groups on the surface.Excess Zn 2 added to the resulting nanocrystallite system can react with surface SH groups, leading to the formation of the SH-free ZnS nanocrystallites and the red shifts in the UV-vis absorption spectra owing to the monolayer growth of the ZnS nanocrystallites.These characteristics of the surface resulted in the fact that the bonding sphere composed of Zn-O and Zn-S bonds in ZnS-DMF(OAc)/ Zn 0.4 is quite comparable with that of ZnS-DMF(ClO 4 ) as determined by EXAFS analysis.Acetate anions interacting intimately with the ZnS surface may prevent the formation of sulfur vacancies even in the presence of excess Zn 2 , leading to the selective photoreduction of CO 2 to HCOO -.With these facts in mind, we propose here processes of surface structure change of ZnS-DMF(OAc) in Scheme 1a. On the other hand, loosely interacting perchlorate anions enhance the stoichiometric formation of ZnS nanocrystallites through the favorable solvation of DMF molecules.In other words, the surface Zn atoms of ZnS-DMF(ClO 4 ) should be coordinated by DMF oxygen without participation of perchlorate anions.Such a surface should readily react with excess Zn 2 , resulting in the formation of sulfur vacancies on the surface of ZnS-DMF(ClO 4 ) as shown in Scheme 1b.As proposed in the photocatalysis of CdS nanocrystallites, 1 sulfur vacancies should contribute to the competitive formation of CO in the ZnS-DMF(ClO 4 ) system. In the photoreduction of CO 2 catalyzed by ZnS nanocrystallites in DMF, microscopic surface structures play a crucial role in product selectivity and efficiency.Surface DMF-solvated Zn atoms contribute to the efficient HCOO - formation.The counteranions of the zinc salts used as the Zn 2 source in in situ preparation also play an important role in the construction of surface structures of the nanocrystallite photocatalysts such as the density of surface sulfur species.The effects of excess Zn 2 on the photoreduction depend on the characteristics of their surface structure.The addition of excess Zn 2 into the ZnS-DMF(ClO 4 ) produces surface sulfur vacancies, inducing the change in the product distribution without losing photocatalytic activity.The acetate ions, intimately interacting with Zn atoms, should prevent the formation of sulfur vacancies as catalytic sites of CO production, contributing to the enhanced photocatalytic activity for the production of HCOO -due to the formation of the DMFcoordinated nanocrystallites.These findings are relevant for designs of semiconductor photocatalysts aiming at high activity and desirable selectivity. Figure 1.Effect of the addition of excess Zn 2 on products of the (a) ZnS-DMF(ClO4) and (b) ZnS-DMF(OAc)-catalyzed CO2 reduction: (b) CO, (2) HCOO -, and (9) H2. Figure 2. Difference IR Spectra of (a) H2S, (b) ZnS-DMF-(ClO4), and (c) ZnS-DMF(OAc) in DMF solution. Figure 3.Effect of the addition of excess Zn 2 on absorption spectra of (a) ZnS-DMF(ClO4) and (b) ZnS-DMF(OAc).Amounts of added excess Zn 2 were 0.2, 0.4, and 0.8 (1.0) equivalent ratio to ZnS nanocrystallites.Spectral shift to longer wavelength due to the addition was shown in ZnS-DMF(OAc). Figure 4. Phase-uncorrected Fourier transforms of k 3 (): (a) bulk ZnS powder and (b) Zn 2 in water.The k space data ranges used in the transforms were (a) 3.2-12.85and (b) 3.5-12.8A -1 .A Hamming window of 5 of the k-ranges was used. c CN d 2 /A 2 e R/ f a Curve fitting was performed over a range of of 3.6-12.8A -1 .b The window for the inverse Fourier tansform.Hamming window ) 0.04 A -1 .c Atomic distance.d Coordination number.e The square of the Debye-Waller factor.f Quality of the fit, defined as (k 3 obs k 3 cald) 2 /(k 3 obs) 2 1/2 .g One-shell fit.h Fixed parameter.i The reduction factor is 0.907.j The reduction factor is 0.863.k Twoshell fit.Standard deviations of one-shell fit: r, (0.01; CN, (0.9; 2 , (0.0013 for the Zn-O shell; r, (0.003; CN, (0.3; 2 , (0.0008 for the Zn-S shell.Standard deviations of two-shell fit: r, (0.02; CN, (1.0; 2 , (0.006 for the Zn-O shell; r, (0.009; CN, (0.7; 2 , 0.0029 for the Zn-S shell. Figure 5. Phase-uncorrected Fourier transforms of k 3 (): (a) ZnS-DMF(ClO4), (b) ZnS-DMF(ClO4)/Zn0.2, and (c) ZnS-DMF(ClO4)/Zn0.4.The k space data ranges used in the transforms were (a) 3.55-14.2,(b) 3.4-12.5,and (c) 3.4-12.5A -1 .A Hamming window of 5 of the k-ranges was used. Figure 6.Phase-uncorrected Fourier transforms of k 3 (): (a) ZnS-DMF(OAc), (b) ZnS-DMF(OAc)/Zn0.2, and (c) ZnS-DMF-(OAc)/Zn0.4.The k space data ranges used in the transforms were (a) 3.65-12.8,(b) 3.65-13.25,and (c) 3.65-14.2A -1 .A Hamming window of 5 of the k-ranges was used. Figure 7.The effect of excess Zn 2 addition on the CN of the Zn-O and Zn-S shells obtained by EXAFS measurement of (a) ZnS-DMF(ClO4) and (b) ZnS-DMF(OAc). (30) Ohtaki, H.; Yamaguchi, T.; Maeda, M. Bull.Chem.Soc.Jpn.1976, 49, 701.(31) Marcus, Y. Chem.Rev. 1988, 88, 1475.(32) Ohtaki, H.; Radnai, T. Chem.Rev. 1993, 93, 1157. Langmuir, Vol.14, No. 18, 1998 Fujiwara et al. Langmuir, Vol.14, No. 18, 1998 Fujiwara et al. Acknowledgment.We gratefully acknowledge the technical assistance of Drs.M. Nomura and A. Oyama at the National Laboratory for High Energy Physics for the EXAFS measurements.This work was supported in part by the \"Research for the Future\" Program of the Japan Society for the Promotion of Science (JSPS).Partial financial aid is given by Grants-in-Aid for Scientific Research from the Ministry of Education, Science, Sports, and Culture, Japan and by a Research Fellowship for Young Scientists from JSPS (to H.F.)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Reduction.ZnS-catalyzed photoreduction of CO 2 was carried out in DMF for 5 h under UV irradiation using ZnS-DMF(OAc) or ZnS-DMF(ClO 4 ) as a photocatalyst and TEA as a sacrificial electron donor.Figure 1a,b shows that the photocatalytic activity and selectivity largely depends on the source of Zn 2 ions, Zn(OAc) 2 2H 2 O or Zn(ClO 4 ) 2 6H 2 O, and the quantity of excess Zn 2 in the reaction systems.The formation of HCOO -increased from 33 to 86 mol by the addition of 0.4 equiv of excess Zn 2 into the ZnS-DMF(ClO 4 ) system (Figure 1a).Further, the addition of more than 0.4 equiv of excess Zn 2 led to a decrease of the production of HCOO -with the competitive formation of CO, as reported previously. 10As the amount of excess Zn 2 increased, the formation of CO was increased from 3.8 to 87 mol with increasing H 2 evolution.On the other hand, excess Zn 2 affected the formation of HCOO -and CO when ZnS-DMF(OAc) was used as a photocatalyst.The amount of photoformed HCOO - increased from 17 to 77.0 mol and CO increased from 1.0 to 9.0 mol as excess Zn 2 increased to a 0.4 equiv ratio (Figure 1b).The formation of HCOO -and CO tends to level off around more than 0.4 equiv of excess Zn 2 .The enhancement of CO production due to excess Zn 2 is a modest increase compared to that of the ZnS-DMF(ClO 4 ) system, indicating that the photocatalytic activity and selectivity depends on the choice of the counteranion in the starting zinc salt. In situ Observation of Surface Structures of ZnS Nanocrystallites.IR Measurements.To prove the surface structure of ZnS nanocrystallites, FT-IR analysis was undertaken for some DMF solutions of related species.Figure 2 shows difference infrared spectra of DMF solutions with H 2 S, ZnS-DMF(ClO 4 ) (10 mM), and ZnS-DMF(OAc) (10 mM), respectively.The DMF solution of H 2 S was prepared by purging with N 2 after saturating with H 2 S gas.In Figure 2a, the broad band observed at 2538 cm -1 is assigned to a S-H stretching vibration of SH -formed by the dissociation of H 2 S due to moisture in DMF.ZnS-DMF(ClO 4 ) showed this band slightly, but no other band was observed.On the other hand, a new band at 2593 cm -1 emerged in the spectrum of ZnS-DMF(OAc).This band can be assigned to the S-H stretching vibration of the SH group on the surface of ZnS-DMF(OAc) nanocrystallites.The relatively strong band at 2593 cm -1 reflects the higher density of SH groups on the ZnS nanocrystallites prepared from Zn(OAc) 2 2H 2 O compared to that of nanocrystallites prepared from Zn-(ClO 4 ) 2 6H 2 O. UV-vis Spectra. Figure 3a,b shows effects of adding Zn 2 to ZnS-DMF solutions on the absorption spectra of ZnS-DMF(ClO 4 ) and ZnS-DMF(OAc).The absorption onset of both ZnS-DMF just prepared from respective zinc salts and H 2 S were the same.However, a crucial difference in the absorption spectra was observed when excess Zn 2 was added into the ZnS-DMF systems.The addition of excess Zn 2 did not affect the absorption spectrum of ZnS-DMF(ClO 4 ) (Figure 3a), indicating no size growth by the addition of excess Zn 2 to ZnS-DMF-(ClO 4 ).On the other hand, the addition of excess Zn 2 to the ZnS-DMF(OAc) system induced a red shift of the absorption onset (Figure 3b).The onset shifted to a lower wavelength until 0.8 equiv of excess Zn 2 was added.The red shift was about 10 nm in the absorption spectrum for ZnS-DMF(OAc), indicating that excess Zn 2 leads to a size growth of ZnS-DMF(OAc) by the reaction of the added excess Zn 2 with the surface of ZnS-DMF(OAc).On the basis of the effective mass approximation, 252627 this red shift reflects a size growth of about 2 A.Comparing the increase in the radius by 2 A with the Zn-S bond length (2.342 A), 28 the addition of excess Zn 2 appear to result in one monolayer growth of ZnS-DMF(OAc). 29XAFS Measurement.Figure 4a,b shows phase-uncorrected Fourier transforms of k 3 -weighted EXAFS for standard samples (bulk ZnS powder and an aqueous solution of zinc perchlorate).The dashed and solid lines in EXAFS figures represent an intensity of the imaginary part and the absolute value in Fourier transforms of k 3weighted EXAFS, respectively.The peak at 1.95 A in the Fourier transform (Figure 4a) for bulk ZnS powder can be assigned to a four coordination of sulfur atoms in the ZnS crystal lattice.For an aqueous solution of zinc (29) The increase in the photo activity induced by the initial addition of excess Zn 2 to the ZnS-DMF(OAc) system may be attributed to the increment in light absorption because the effective light absorption could be expected at 313 nm of the line spectrum of the used highpressure Hg lump.perchlorate, the observed peak at 1.65 A in the Fourier transform (Figure 4b) was assigned to a six coordination of oxygen atoms of water molecules solvated to Zn 2 ions. 3031132 The Fourier-filtered k 3 (k) of bulk ZnS powder and an aqueous zinc perchlorate solution were fitted well by using the reported bond lengths of Zn-S (2.342 A) 28 and Zn-O (2.08 A), 30 respectively (Table 1).Reference parameters were derived from the fitting procedure. Figure 5a shows phase-uncorrected Fourier transform of k 3 -weighted EXAFS for ZnS-DMF(ClO 4 ).The main peak at 1.92 A in the transform of ZnS-DMF(ClO 4 ) is broader than that in bulk ZnS powder (Figure 4a).This greater transform may be attributed to the superposition of a different coordination shell around the zinc atoms.Since the oxygen atom of a DMF molecule can coordinate to a Zn 2 ion as mentioned in a previous paper, 19 the different coordination may be due to the oxygen atoms of DMF molecules solvating to zinc atoms on the surface of ZnS nanocrystallites.A two-shell fitting for Fourierfiltered k 3 (k) of ZnS-DMF(ClO 4 ) was performed to interpret quantitatively the coordination in the system.As shown in Table 1, the best fitting was achieved with a two-shell fit of Zn-S and Zn-O.A one-shell fit of Zn-S gave no acceptable fitting results.Thus, these curvefitting results indicate that zinc atoms on the surface of ZnS nanocrystallites should be coordinated not only by the sulfur atoms in ZnS nanocrystallites but also by the oxygen atoms of solvating DMF molecules.Figure 5b,c shows phase-uncorrected Fourier transforms of k 3weighted EXAFS for ZnS-DMF(ClO 4 )/ZnX (X ) 0.2 and 0.4) solution, respectively.The increase of intensity in the magnitude as well as the imaginary part at 1.65 A was clearly observed.This result suggests that the contribution to the scattering due to the solvating DMF oxygen increased as the amount of excess Zn 2 increased. Figure 6 shows the phase-uncorrected Fourier transform of k 3 -weighted EXAFS for ZnS-DMF(OAc)/ZnX (X ) 0.0, 0.2, and 0.4).The transforms of ZnS-DMF(OAc) were quite different from those of ZnS-DMF(ClO 4 ).The magnitude around 1.7 A in the transforms of ZnS-DMF-(OAc) was smaller than that in ZnS-DMF(ClO 4 ), suggesting a lower contribution to the scattering by oxygen atoms of DMF molecules (Figure 6a).This result suggests that the contributions of oxygen atoms in ZnS-DMF(OAc) are much smaller than in ZnS-DMF(ClO 4 ).In addition, evolution of the Zn-O component at 1.65 A by the addition of excess Zn 2 was not observed clearly for ZnS-DMF- (OAc) compared with that of ZnS-DMF(ClO 4 ).A twoshell fitting for Fourier-filtered k 3 (k) was performed.Excellent fits were obtained with a two-shell fit of Zn-S and Zn-O (Table 1) but not with a one-shell fit of Zn-S, indicating that DMF molecules solvating to the ZnS nanocrystallite surfaces exist in both systems. The coordination number (CN) for the Zn-O shell of ZnS-DMF(ClO 4 ) (1.66) was larger than that of ZnS-DMF-(OAc) (1.02).This fact indicates that the number of DMF molecules adsorbed on ZnS-DMF(OAc) is smaller than that of ZnS-DMF(ClO 4 ).In addition, the CN of the Zn-S shell in ZnS-DMF(OAc) (4.40) was significantly greater than that of ZnS-DMF(ClO 4 ) (3.66).The larger CN of the Zn-S shell and the smaller CN of the Zn-O shell in ZnS-DMF(OAc) suggest that the surface zinc atoms should be terminated more by sulfur atoms and solvated less by DMF molecules than those in ZnS-DMF(ClO 4 ). Figure 7 shows the effect of excess Zn 2 on the CN of Zn-O and Zn-S shells determined by EXAFS analysis of ZnS-DMF(ClO 4 ) and ZnS-DMF(OAc), respectively.The changes of CN values by the addition of excess Zn 2 are very similar in both systems.As excess Zn 2 increased, CN Zn-S decreased and CN Zn-O increased.We have also reported similar changes of CNs for Cd-S and Cd-O bonding in CdS nanocrystallites with excess Cd 2 in a previous paper.This was attributed to the adsorption of excess Cd 2 solvated by DMF molecules onto the surface of CdS nanocrystallites. 1 These changes of CN for Zn-S and Zn-O bondings indicate that the adsorption of excess Zn 2 solvated by DMF molecules occurred on the ZnS-DMF nanocrystallites surface. 19The values of CN of ZnS-DMF(ClO 4 ) and those of ZnS-DMF(OAc) are quite different before the addition of excess Zn 2 into the systems.It is interesting to note that the CN values in the system of ZnS-DMF(OAc)/Zn0.4 are quite close to those of the ZnS-DMF(ClO 4 ) system.This fact suggests that the addition of 0.4 equiv excess Zn 2 into the ZnS-DMF(OAc) should give a bonding sphere (Zn-O and Zn-S bonds) which is comparable with that of ZnS-DMF(ClO 4 ).Actually, the selectivity (i.e., the ratio of CO to HCOO -) is almost the same in the photocatalysis using both nanocrystallites, although the activity is different in both cases.The difference in the activity may be explained as due to the difference in their particle size. When the estimated error by using Sakane's method is taken into account, 24 the bond length and the value of the square of the Debye-Waller factor for the Zn-S shell in ZnS-DMF(ClO 4 ) (r, 2.34 A; 2 , 0.080 A 2 ) and ZnS-DMF-(OAc) (r, 2.34 A; 2 , 0.083 A 2 ) were comparable to those in bulk ZnS powder (r, 2.34 A; 2 , 0.079 A 2 ).This fact implies that a crystalline lattice of ZnS nanocrystallites as well as surface Zn-S structure is not affected by the choice of the coexistent counteranions.In contrast, the Zn-O bond length in ZnS-DMF(OAc) (2.03 A) was shorter than that in ZnS-DMF(ClO 4 ) (2.06 A). The present FT-IR and EXAFS analyses have revealed that the surface characteristics of ZnS nanocrystallites in DMF are influenced by the zinc salts used as a Zn 2 source at in situ preparation.The ZnS nanocrystallites, ZnS-DMF(OAc) and ZnS-DMF(ClO 4 ), were analyzed after elimination of excess H 2 S from the prepared nanocrystallite system.ZnS-DMF(OAc) prepared using Zn(OAc) 2 2H 2 O has been found to have SH sites on the ZnS surface.The SH-rich microscopic surface structure was also supported by the small CN of Zn-O and large CN of Zn-S in the EXAFS analysis of ZnS-DMF(OAc).However, ZnS-DMF(ClO 4 ) prepared similarly using Zn(ClO 4 ) 2 6H 2 O was characterized as fully DMF-solvated nanocrystallites with few SH sites. Both ZnS nanocrystallite systems show interesting photocatalysis for the CO 2 reduction using TEA as an electron donor.It is believed that DMF-solvated Zn atoms on ZnS nanocrystallites should work as reaction sites in the photoreduction of CO 2 to HCOO -.The formation of HCOO -was more effective in using ZnS-DMF(ClO 4 ) than ZnS-DMF(OAc), because Zn atoms on the ZnS nanocrystallites surface were covered with sulfur species in ZnS-DMF(OAc).The formation of HCOO -was enhanced when the ZnS-DMF(OAc) system was treated with excess Zn 2 .In the EXAFS analysis of ZnS-DMF(OAc), the CN Zn-O increased with the addition of excess Zn 2 , which explains not only the elimination of SH sites but also solvation of DMF molecules as a result of the adsorption of excess Zn 2 on the ZnS surface.The effective formation of HCOO -can be rationalized as due to the increment of DMF-solvated Zn atoms on the ZnS nanocrystallites as active sites for the production of HCOO -. In the preceding paper, 33 we reported an interaction of DMF molecules with ZnS nanocrystallites prepared in acetonitrile (AN).The DMF molecules on ZnS-AN(ClO 4 ) prepared from Zn(ClO 4 ) 2 6H 2 O in AN should be wellsolvated via the polarized structure ((CH 3 ) 2 N CHO -) of DMF molecules, suggesting that perchlorate anions associate loosely with the surface Zn atoms of ZnS nanocrystallites.The system of ZnS-AN(OAc) prepared from Zn(OAc) 2 2H 2 O demonstrated a relatively stronger interaction with DMF molecules than ZnS-AN(ClO 4 ), although DMF molecules on the ZnS nanocrystallites were weakly bound in both cases.These observations indicate that acetate anions tend to interact intimately with ionic Zn species in DMF and AN.In fact, the acetate anion was reported to interact with Zn 2 in water, giving a disordered octahedral solvated structure between the Zn 2 ion and H 2 O molecules. 30The shorter bond length in the Zn-O shell observed in the EXAFS analysis of the ZnS-DMF-(OAc) system might result from such intimate interaction of acetate anions with Zn atoms on the nanocrystallites, leading to the change in the solvating structure of DMF molecules on the surface. The formation of SH sites in the ZnS-DMF(OAc) system may be due to the interaction of the acetate anion with Zn atoms on the initially formed ZnS nanocrystallites.When the interaction of the acetate anion interferes with the solvation of ZnS nanocrystallites by DMF molecules is taken into account, the surface SH groups can be (33) Fujiwara, H.; Murakoshi, K.; Wada, Y.; Yanagida, S. Langmuir, in press.explained by the reaction of the acetate-interacting Zn atoms on the surface with SH -species.Surface Zn atoms which are not fully solvated may be allowed to react with excess H 2 S in DMF; these might give the ZnS nanocrystallites having SH groups on the surface.Excess Zn 2 added to the resulting nanocrystallite system can react with surface SH groups, leading to the formation of the SH-free ZnS nanocrystallites and the red shifts in the UV-vis absorption spectra owing to the monolayer growth of the ZnS nanocrystallites.These characteristics of the surface resulted in the fact that the bonding sphere composed of Zn-O and Zn-S bonds in ZnS-DMF(OAc)/ Zn 0.4 is quite comparable with that of ZnS-DMF(ClO 4 ) as determined by EXAFS analysis.Acetate anions interacting intimately with the ZnS surface may prevent the formation of sulfur vacancies even in the presence of excess Zn 2 , leading to the selective photoreduction of CO 2 to HCOO -.With these facts in mind, we propose here processes of surface structure change of ZnS-DMF(OAc) in Scheme 1a. On the other hand, loosely interacting perchlorate anions enhance the stoichiometric formation of ZnS nanocrystallites through the favorable solvation of DMF molecules.In other words, the surface Zn atoms of ZnS-DMF(ClO 4 ) should be coordinated by DMF oxygen without participation of perchlorate anions.Such a surface should readily react with excess Zn 2 , resulting in the formation of sulfur vacancies on the surface of ZnS-DMF(ClO 4 ) as shown in Scheme 1b.As proposed in the photocatalysis of CdS nanocrystallites, 1 sulfur vacancies should contribute to the competitive formation of CO in the ZnS-DMF(ClO 4 ) system."
  },
  {
    "title": "Conclusions",
    "content": "In the photoreduction of CO 2 catalyzed by ZnS nanocrystallites in DMF, microscopic surface structures play a crucial role in product selectivity and efficiency.Surface DMF-solvated Zn atoms contribute to the efficient HCOO - formation.The counteranions of the zinc salts used as the Zn 2 source in in situ preparation also play an important role in the construction of surface structures of the nanocrystallite photocatalysts such as the density of surface sulfur species.The effects of excess Zn 2 on the photoreduction depend on the characteristics of their surface structure.The addition of excess Zn 2 into the ZnS-DMF(ClO 4 ) produces surface sulfur vacancies, inducing the change in the product distribution without losing photocatalytic activity.The acetate ions, intimately interacting with Zn atoms, should prevent the formation of sulfur vacancies as catalytic sites of CO production, contributing to the enhanced photocatalytic activity for the production of HCOO -due to the formation of the DMFcoordinated nanocrystallites.These findings are relevant for designs of semiconductor photocatalysts aiming at high activity and desirable selectivity. Figure 1.Effect of the addition of excess Zn 2 on products of the (a) ZnS-DMF(ClO4) and (b) ZnS-DMF(OAc)-catalyzed CO2 reduction: (b) CO, (2) HCOO -, and (9) H2. Figure 2. Difference IR Spectra of (a) H2S, (b) ZnS-DMF-(ClO4), and (c) ZnS-DMF(OAc) in DMF solution. Figure 3.Effect of the addition of excess Zn 2 on absorption spectra of (a) ZnS-DMF(ClO4) and (b) ZnS-DMF(OAc).Amounts of added excess Zn 2 were 0.2, 0.4, and 0.8 (1.0) equivalent ratio to ZnS nanocrystallites.Spectral shift to longer wavelength due to the addition was shown in ZnS-DMF(OAc). Figure 4. Phase-uncorrected Fourier transforms of k 3 (): (a) bulk ZnS powder and (b) Zn 2 in water.The k space data ranges used in the transforms were (a) 3.2-12.85and (b) 3.5-12.8A -1 .A Hamming window of 5 of the k-ranges was used. c CN d 2 /A 2 e R/ f a Curve fitting was performed over a range of of 3.6-12.8A -1 .b The window for the inverse Fourier tansform.Hamming window ) 0.04 A -1 .c Atomic distance.d Coordination number.e The square of the Debye-Waller factor.f Quality of the fit, defined as (k 3 obs k 3 cald) 2 /(k 3 obs) 2 1/2 .g One-shell fit.h Fixed parameter.i The reduction factor is 0.907.j The reduction factor is 0.863.k Twoshell fit.Standard deviations of one-shell fit: r, (0.01; CN, (0.9; 2 , (0.0013 for the Zn-O shell; r, (0.003; CN, (0.3; 2 , (0.0008 for the Zn-S shell.Standard deviations of two-shell fit: r, (0.02; CN, (1.0; 2 , (0.006 for the Zn-O shell; r, (0.009; CN, (0.7; 2 , 0.0029 for the Zn-S shell. Figure 5. Phase-uncorrected Fourier transforms of k 3 (): (a) ZnS-DMF(ClO4), (b) ZnS-DMF(ClO4)/Zn0.2, and (c) ZnS-DMF(ClO4)/Zn0.4.The k space data ranges used in the transforms were (a) 3.55-14.2,(b) 3.4-12.5,and (c) 3.4-12.5A -1 .A Hamming window of 5 of the k-ranges was used. Figure 6.Phase-uncorrected Fourier transforms of k 3 (): (a) ZnS-DMF(OAc), (b) ZnS-DMF(OAc)/Zn0.2, and (c) ZnS-DMF-(OAc)/Zn0.4.The k space data ranges used in the transforms were (a) 3.65-12.8,(b) 3.65-13.25,and (c) 3.65-14.2A -1 .A Hamming window of 5 of the k-ranges was used. Figure 7.The effect of excess Zn 2 addition on the CN of the Zn-O and Zn-S shells obtained by EXAFS measurement of (a) ZnS-DMF(ClO4) and (b) ZnS-DMF(OAc). (30) Ohtaki, H.; Yamaguchi, T.; Maeda, M. Bull.Chem.Soc.Jpn.1976, 49, 701.(31) Marcus, Y. Chem.Rev. 1988, 88, 1475.(32) Ohtaki, H.; Radnai, T. Chem.Rev. 1993, 93, 1157. Langmuir, Vol.14, No. 18, 1998 Fujiwara et al. Langmuir, Vol.14, No. 18, 1998 Fujiwara et al. Acknowledgment.We gratefully acknowledge the technical assistance of Drs.M. Nomura and A. Oyama at the National Laboratory for High Energy Physics for the EXAFS measurements.This work was supported in part by the \"Research for the Future\" Program of the Japan Society for the Promotion of Science (JSPS).Partial financial aid is given by Grants-in-Aid for Scientific Research from the Ministry of Education, Science, Sports, and Culture, Japan and by a Research Fellowship for Young Scientists from JSPS (to H.F.)."
  }
]