[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2014.12.046"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic CO 2 reduction with H 2 O over LaPO 4 nanorods deposited with Pt cocatalyst"
  },
  {
    "title": "Abstract",
    "content": "LaPO 4 nanorods synthesized by hydrothermal method were applied as a novel catalyst for photocatalytic reduction of CO 2 with H 2 O under mild conditions (20 C and 1 atm CO 2 ).The prepared LaPO 4 nanorods exhibited relatively negative E CB of -0.63 V vs. NHE pH 7 and superior CO 2 adsorption capability of 16.3 mg g -1 .The yield rate of the main reduction products, CH 4 and H 2 , were 0.11 and 0.08 mol/h, respectively.The deposition of Pt cocatalyst improved the photocatalytic performance and enhanced the selectivity of CO 2 conversion to CH 4 production.The highest photocatalytic efficiency was observed over LaPO 4 -1 wtPt, with an apparent quantum yield (AQY) enhanced by 5 times as compared to bare LaPO 4 , and the selectivity for CH 4 production reached 100 at 3 wtPt loading.A possible mechanism of photocatalytic CO 2 reduction over LaPO 4 and LaPO 4 -Pt was proposed that the Pt cocatalyst functioned as an excellent electron transfer mediator and adsorber for CO 2 ."
  },
  {
    "title": "Experimental",
    "content": "LaPO 4 samples were synthesized by hydrothermal method.All reagents were of analytical purity and used without further purification.3 mmol La(NO 3 ) 3 6H 2 O and 3 mmol (NH 4 ) 2 HPO 4 were dissolved in 35 mL of deionized water with stirring, respectively.Then (NH 4 ) 2 HPO 4 solution was added into the La(NO 3 ) 3 solution dropwise under vigorous stirring.After stirring for 1 h, the mixture was transferred into a 100 mL Teflon liner.The autoclaves were heated at 180 C for 24 h, and then cooled to ambient temperature naturally.The precipitates were washed with distilled water several times before it was dried at 60 C to obtain the final product.LaPO 4 -Pt samples were prepared via impregnating LaPO 4 powder in H 2 PtCl 6 aqueous solution followed by NaBH 4 reduction 13. The powder X-ray diffraction (XRD) was analyzed on a Bruker D8 Advance X-ray diffractometer.Scanning electron microscopy (SEM) images were collected on a Nova NanoSEM 230 microscopy (FEI Corp).Transmission electron microscopy (TEM) was obtained using a JEOL JEM 2010F microscope.Fourier transformed infrared (FTIR) spectra were recorded using a Nicolet Magna 670 FTIR spectrometer in KBr at a concentration of ca.1wt.UV-vis diffuse reflectance spectra (UV-vis DRS) were measured on a Varian Cary 500 Scan UV-vis-NIR spectrophotometer.Zeta potential of sample was determined by dynamic light scattering analysis (Zeta sizer 3000HSA) at 20 C. X-ray photoelectron spectroscopy (XPS) measurements were performed on an ESCALAB 250 photoelectron spectroscope system.The Brunauer-Emmett-Teller (BET) specific surface area and CO 2 adsorption were measured with an ASAP2020M apparatus.Mott-Schottky measurement was performed with a Zennium electrochemical workstation (Zahner Elektrik, Germany), using Pt plate and Ag/AgCl electrode as the counter electrode and reference electrode, respectively.The working electrode was made by dip-coating catalyst slurry (5 mgmL -1 in EtOH) on fluorine-doped tin oxide (FTO) glasses, the area of which was controlled as 0.25 cm 2 , and followed by air-drying.0.2 M of Na 2 SO 4 solution was used as electrolyte. According to Clausius-Clapeyron empirical equations that the data are modeled with a virial-type expression composed of parameters a i and b i that are independent of temperature: 22 where, P is pressure, N is the amount adsorbed (or uptake), T is temperature, and m and n determine the number of terms required to adequately describe the isotherm.For CO 2 adsorption, it is measured at 273 and 298 K using unity weights.The parameters a i and b i are achieved from global fitting of the 273 and 298 K data.Based on the above results, the isosteric heat of adsorption (Q st ) is calculated according to: where, R is the universal gas constant. The photocatalytic reduction of CO 2 was evaluated at 1 atm CO 2 partial pressure in a 200 ml reactor with an inner irradiation quartz reaction cell.The reactor was kept at 20 C as controlled by cooling water.A 125 W high-pressure Hg lamp (GGZ125, Shanghai Yaming Lighting Co., Ltd with a maximum emission at about 365 nm) was used as light source.Typically 50 mg photocatalyst was suspended in 70 mL H 2 O. Before irradiation, the whole reaction system was first evacuated by a mechanical pump to ensure the air was eliminated.Secondly, CO 2 (99.999 purity) was filled into the reactor for 1 h with stirring to get a CO 2 -saturated aqueous solution.The gas products were analyzed by GC (Agilent 6890 N).The apparent quantum yield (AQY) is also measured under the same photocatalytic reaction conditions.The incident light intensity of high pressure mercury lamp is measured by SpectriLight ILT950.The total number of incident photons is measured using a calibrated silicon photodiode.The AQY is calculated according to the following Eqs.: number of reacted electrons number of incident photons 100 number ofCH4 molecules 8 number of H2 molecules 2 number of incident photons 100 (3)"
  },
  {
    "title": "Results_and_Discussion",
    "content": "The photocatalytic property of the prepared samples was carried out in the saturated CO 2 aqueous solution dispersing catalyst powers under mild conditions.In the control experiments no any gas but CO 2 was detected in the reaction system without irradiation or catalysts, indicating that the CO 2 reduction requires the procedure of photocatalysis.Besides, reduction product was only H 2 when the high purity N 2 replaced CO 2 in the reaction system.This result proved that the formed hydrocarbons were originated from CO 2 but not contamination. CH 4 and H 2 are the two main reduction products.Fig. 2a and b displays the evolution of the reaction products generated from the LaPO 4 promoted CO 2 reduction system as a function of irradiation time.The generation of CH 4 and H 2 increases almost linearly with the irradiation time.After 5 h of irradiation, the accumulated yield of CH 4 and H 2 increases to 0.51 and 0.36 mol, respectively, corresponding to the production rates of 0.11 and 0.08 mol/h (Fig. 2c).Except for trace amount of CO, other products such as CH 3 OH, HCHO, and HCOOH were not detected during the reaction.Taking the solubility of the potential reduced compounds into consideration, both insoluble CH 4 and H 2 are easy to overflow from the aqueous solution, while all of CH 3 OH, HCHO, and HCOOH are soluble and difficult to separate from the reaction solution.So that the intermediates produced during the reduction tend to favor the formation of CH 4 and H 2 instead of CH 3 OH, HCHO, and HCOOH.Furthermore, the strong oxidation power of photogenerated holes (or OH radicals) could react with those soluble intermediates and products of CO 2 conversion in reactions, 23 making the net yield negligible. The photocatalytic activities for CO 2 reduction can be significantly enhanced by loading Pt as co-catalyst as shown in Fig. 2. The photocatalytic activity increases with increasing Pt content to a maximum at about 1 wt, that the CH 4 and H 2 production rates reach the highest value of 0.62 and 0.23 mol/h, respectively, which was 5.6 and 2.8 times as high as that of LaPO 4 (Fig. 2c).And the apparent quantum yield (AQY) is enhanced by 5 times.With the further increase of Pt content to 3 wt, the lower CH 4production rate is observed and no H 2 is detected, but the AQY is still 3.6 times higher than bare LaPO 4 .Obviously, the platinization leads to an increase in the formation of CH 4 which is much superior to H 2 formation.As shown in Table 1, the selectivity for CH 4 production increases from the original 58.6 for LaPO 4 to 100 for LaPO 4 -3 wtPt.Because both H 2 and CH 4 are formed via proton-assisted multielectron transfer reactions, and the formation of CH 4 (-0.24V vs. NHE) is thermodynamically more feasible than the formation of H 2 (-0.41 V vs. NHE) when the supply of adsorbed CO 2 , protons and electrons are high enough.The results of superior CH 4 selectivity indicate that the platinization would enhance both electron transfer and CO 2 adsorption in our protonenriched system.Moreover, the repeated experiment is performed over LaPO 4 -1 wtPt sample and the results show that there is no significant decrease in CH 4 and H 2 evolution rate after 4 times repeated reaction cycles (Fig. S1), indicating the good stability of LaPO 4 -1 wtPt sample. In order to evaluate the charge balance, the amount of O 2 formed during the photocatalytic CO 2 reduction was also quan- tified.For LaPO 4 -1 wtPt sample, the amount of O 2 detected was 5.92 mol after 5 h of reaction, and the amounts of H 2 and CH 4 formed were 1.15 and 3.24 mol, respectively.Providing that the oxidation of H 2 O to O 2 is the sole reaction to consume the photogenerated holes and that the photogenerated electrons are used for the formations of CH 4 and H 2 , the stoichiometric molar ratio of O 2 /(4CH 4 H 2 ) should be 1/2.The molar ratio of O 2 /(4CH 4 H 2 ) calculated from our results is 0.42, which is close to the stoichiometric ratio. The XRD patterns of LaPO 4 and LaPO 4 -Pt samples are shown in Fig. 3.It is shown that all the diffraction peaks of the prepared LaPO 4 sample can be indexed to the hexagonal phase LaPO 4 (JCPDS: 04-0635) with lattice constants a 7.04 A, b 7.04 A, c 6.45 A.The strong and sharp diffraction peaks demonstrate high crystallinity of the products.The average crystal size of the sample is estimated to be about 11.5 nm from the (2 0 0) peak at around 29.0 by using the Scherrer equation.The diffraction peaks of LaPO 4 -1 wtPt sample only ascribes to hexagonal phase LaPO 4 .No diffraction peaks for Pt are observed in the LaPO 4 -1 wtPt sample, which may owe to the low amount.FT-IR spectra of pure LaPO 4 and the LaPO 4 -1 wtPt are shown in Fig. S2.No great difference can be found in the spectra of the two samples.The strong absorption peaks at 1022 cm -1 correspond to the asymmetric stretching ( 3 ) vibration and the bands at 598 and 544 cm -1 are due to the asymmetric bending vibrations ( 4 ) of -PO 4 group 24.The absorptions at 3450 and 1620 cm -1 observed in the two samples can be assigned to the -OH stretching and H-O-H bending vibrations, respectively, of lattice water in pure LaPO 4 and LaPO 4 -1 wtPt 25.There are no other functional groups detected in these products.These results indicate that Pt deposition does not alter the phase and structure of LaPO 4 . The composition and chemical states of elements in the prepared samples were further investigated by X-ray photoelectron spectroscopy (XPS).The peak positions in all the XPS spectra were calibrated with C 1s peak at 284.60 eV.The survey XPS spectrum of the prepared LaPO 4 -1 wtPt sample (Fig. 4a) indicates that the catalyst consists of La, O, P, and Pt, in accord with the result of EDX (Fig. 5d).Fig. 4b shows the Pt 4f XPS spectrum of the prepared sam-ple.Two peaks emerging at binding energies of 70.9 and 74.4 eV correspond to Pt 4f7/2 and Pt 4f5/2, respectively, which indicates that Pt deposited on the LaPO 4 is metallic 26.The XPS of La 3d (Fig. S3a) shows that the main peaks (3d 0 4f 0 configuration) of La 3d5/2 and La 3d3/2 at 835.1 and 851.9 eV with the shake-up peaks (3d 0 4f 1 configuration) located at 838.8 and 855.3 eV, respectively, correspond to La(III) oxidation state 27,28.The peaks located at 133.6 eV of P 2p XPS (Fig. S3b) and 531.4 eV of O 1s XPS (Fig. S3c) are attributed to the P O bonds in PO 4 3-chemical environment 29,30. The structure and morphology of the samples were further characterized by SEM and HRTEM.As shown in the SEM (Fig. 5a), the prepared LaPO 4 sample consists of straight, smooth, and homogeneous nanorods with a uniform diameter of about 16 nm The SBET, the CO2 adsorbed amounts, and the isosteric heat of CO2 adsorption (Qst) on LaPO4 and LaPO4-1 wtPt samples. SBET(m and length of up to several tens micrometers.The TEM of the LaPO 4 -1 wtPt sample (Fig. 5b) shows the existing of numerous randomly organized one-dimensional nanorods with surface deposition of irregular Pt nanoparticles with a diameter of about 3-7 nm. The HRTEM image of LaPO 4 -1 wtPt (Fig. 5c) shows that the Pt nanoparticles on the LaPO 4 nanorods are well distributed and the lattice spacing of LaPO 4 is 0.285 nm, corresponding to the (1 0 2) planes.The obtained EDX pattern corresponding to Fig. 5d shows that the sample is composed of La, P, O, and Pt elements (Cu peaks arise from TEM grid). The BET specific surface area (S BET ) of as-prepared LaPO 4 and LaPO 4 -1 wtPt was measured to be 110 and 104 m 2 g -1 , respectively (Fig. 6a).The decrease in S BET can be accounted for the partial surface coverage of LaPO 4 by the deposited Pt nanoparticles 31.However, the CO 2 adsorption amounts increase from the original 16.3 mg g -1 for LaPO 4 to 18.5 mg g -1 for LaPO 4 -1 wtPt (Fig. 6b).There is no significant difference in the CO 2 adsorption between LaPO 4 photocatalysts treated with NaBH 4 or not, which suggests the Pt cocatalysts work as CO 2 adsorption sites, excluding the effect of NaBH 4 reduction, just as the report that the Pt(1 0 0) surface prefers CO 2 adsorption by (thh) site 32.Moreover, the calculated isosteric heat of CO 2 adsorption (Q st ) on LaPO 4 -1 wtPt sample is lower than that on bare LaPO 4 (as listed in Table 2), indicating that the loaded Pt cocatalyst functions as CO 2 adsorption sites.Both the larger CO 2 adsorption amount and lower isosteric heat of CO 2 adsorption on LaPO 4 -1 wtPt sample lead to higher CO 2 reduction activity. In order to better understand the intrinsic electronic properties of LaPO 4 and LaPO 4 -Pt samples, the band structure of LaPO 4 has been evaluated based on the combination of the flat-band potential and band gap 33.As shown in Fig. 7, the flat-band potential of LaPO 4 determined from Mott-Schottky plots is ca.-0.73 V vs. Ag/AgCl at pH 7 (equivalent to -0.53 V vs. NHE at pH 7).Pt deposition does not alter the flat-band potential of LaPO 4 as that the Mott-Schlttky plots of LaPO 4 and LaPO 4 -1 wtPt are found to converge to a common point on the potential axis (Fig. 7).It is found that the slopes of the plots are positive, suggesting that LaPO 4 is n-type semiconductor 34.For n-type semiconductor, the conduc- tion band lies very close to the flat-band potentials 35.Therefore, the redox potential of conduction band (E CB ) of LaPO 4 is -0.63 V vs. NHE at pH 7. The band gap of the as-prepared LaPO 4 was determined from the UV-vis absorption spectrum (Fig. S4) to be 4.5 eV.So the edge of the valence band E VB of LaPO 4 is calculated to be 3.87 V vs. NHE at pH 7, which is more positive than E A (H 2 O/O 2 ) (0.82 V vs. NHE at pH 7).This indicates that holes photogenerated on irradiation of LaPO 4 can react with H 2 O to produce O 2 . Fig. 8a shows the transient photocurrent responses under intermittent UV-vis illumination.It is clearly seen that, with the introduction of Pt, the transient photocurrents of LaPO 4 -1 wtPt sample are remarkably higher than that of bare LaPO 4 , suggesting the more efficient separation and longer lifetime of photogenerated charge carriers 36 than that of bare LaPO 4 .Fig. 8b shows the photoluminescence (PL) spectra of the LaPO 4 and LaPO 4 -1 wtPt samples.Two distinct emission bands at 355 and 443 nm are observed due to the d-f transition of La 3 ions 37.The PL intensity obtained from LaPO 4 -1 wtPt is diminished as compared to that of LaPO 4 , demonstrating the more efficient inhibition of charge carriers recombination in the LaPO 4 -1 wtPt sample, and thus reflecting the superior electron transfer ability of Pt cocatalyst, which is consistent well with the results of the transient photocurrent responses.All the observations highlight the function of Pt cocatalyst for enhancing charge transfer, leading to the higher photocatalytic efficiency. Based on the results of the above reaction and characterizations, we propose the mechanism of CO 2 reduction with H 2 O over LaPO 4 .When light with photon energy higher or equal to the band gap of LaPO 4 is incident on the catalyst, electrons and holes are generated in the CB and VB, respectively.(Eq.( 4)) The CB edge, which is mainly formed by the La 5d states 38, has a higher energy level than CO 2 /CH 4 and H 2 /H 2 O potential, thus the photogenerated electrons on the CB are transferred to the absorbed CO 2 and H to produce CH 4 or H 2 (Eqs.( 5) and ( 6)).While the VB edge of LaPO 4 , mainly formed by the O 2p states 38, is positive enough to oxidize water.(Eq.( 7)) The Pt nanoparticles deposited on the LaPO 4 is a key factor for the photocatalytic CO 2 reduction, which influences the efficiency and the selectivity of photocatalytic CO 2 conversion.With the high electrical conductivity of the deposited Pt and the abundant Schottky barriers formed at the interface between LaPO 4 and Pt, the deposited Pt acts as a cocatalyst which facilitates the photoexcited electrons transfer from LaPO 4 to Pt nanoparticles, and prevents the recombination of photoexcited electrons and holes.This is confirmed experimentally as shown in Fig. 8.The better charge separation enhances the efficiency of photocatalytic CO 2 conversion.Moreover, the Pt cocatalyst functions not only as photogenerated electron sink but also as CO 2 adsorber, since the LaPO 4 -Pt sample shows larger CO 2 adsorption amounts, lower isosteric heat of CO 2 adsorption, although smaller specific surface area than bare LaPO 4 , which thus accelerates the eight-electron reduction of CO 2 with H 2 O into CH 4 (Eq.( 5)) to proceed, and enhances the conversion selectivity of CO 2 reduction into CH 4 .A detailed illustration of this mechanism is shown in Scheme 1."
  },
  {
    "title": "Conclusions",
    "content": "In summary, hexagonal LaPO 4 nanorods have been successfully synthesized by hydrothermal method.The prepared LaPO 4 samples showed superior photocatalytic performance for CO 2 reduction with H 2 O under mild conditions, and the main reduction products were CH 4 and H 2 .The deposited Pt cocatalyst improved the photocatalytic activity and the selectivity for CH 4 formation.The maximum CH 4 and H 2 production rates were observed for LaPO 4 -1 wtPt, which was 5.6 and 2.8 times as high as that of LaPO 4 respectively, with the apparent quantum yield (AQY) increased by 5 times, and the selectivity for CH 4 formation achieved 100 as Pt content increased to 3 wt.The enhanced photocatalytic activity and selectivity of Pt-deposited LaPO 4 can be attributed to the outstanding ability of the deposited Pt nanoparticles as an excellent electron transfer mediator and adsorber for CO 2 .This work introduces LaPO 4 as a novel photocatalyst to convert CO 2 into chemicals, and indicates that the deposition of Pt is a good strategy to improve the activity and selectivity of LaPO 4 for photocatalytic CO 2 reduction. Fig. 1.Zeta potential ( ) of LaPO4 aqueous dispersion (pH7).Inset: LaPO4 colloid image. Fig. 2. Production of CH4(a) and H2(b) formed as a function of irradiation time, and (c) generation rates of CH4 and H2 over the prepared LaPO4 and LaPO4-Pt samples. Fig. 3. XRD patterns of LaPO4 and LaPO4-1 wtPt samples. Fig. 4. XPS spectra of LaPO4-1 wtPt sample: (a) survey spectra, (b) Pt 4f. Fig. 5. (a) SEM image of the LaPO4 sample; (b) TEM image, (c) HRTEM image, (d) EDX pattern of the LaPO4-1 wtPt sample. Fig. 6.(a) N2 adsorption/desorption isotherms (77 K), and (b) CO2 adsorption isotherms (1 atm, 273 K) of LaPO4 and LaPO4-1 wtPt samples. Fig. 7. Mott-Schottky plots of the prepared LaPO4 and LaPO4-1 wtPt samples. Fig. 8. (a) The transient photocurrent responses with an applied potential of 0.1 V, and (b) the photoluminescence (PL) spectra under 270 nm excitation of LaPO4 and LaPO4-1 wtPt samples. Scheme 1. Proposed mechanism of the photocatalytic CO2 reduction over LaPO4 photocatalyst with Pt cocatalyst in the presence of H2O. Effects of Pt cocatalyst on the photocatalytic activity and the selectivity of CO2 reduction. a Catalyst CH4 (mol) H2(mol) CH4 H2(mol) Sel.CH4 b () AQY () a Reaction conditions: photocatalyst (50 mg), H2O (70 mL), CO2 pressure (1 atm), T (20 C), irradiation time (5 h).b Sel.CH4() nCH4/n (CH4 H2) 100. This work is financially supported by the NSFC (Grants Nos.20873022, U1305242, 21173044, and 21373050) and the National Key Basic Research Program of China (973 Program: 2013CB632405, 2014CB239303 and 2014CB260410). Supplementary data associated with this article can be found, in the online version, at http://dx.doi.org/10.1016/j.apcatb.2014.12.046."
  }
]