[
  {
    "title": "Doi",
    "content": "10.1016/j.jcou.2019.09.008"
  },
  {
    "title": "Article_Title",
    "content": "Enhancing TiO2 activity for CO2 photoreduction through MgO decoration"
  },
  {
    "title": "Abstract",
    "content": "Herein we report on the influence of MgO's basic character in the photoactivity of MgO:TiO 2 nanocomposites for the CO 2 reduction reaction.TiO 2 nanoparticles, decorated with MgO in different mass proportions, were synthesized by the physical mixing of pre-synthesized oxides followed by calcination.The decorated samples presented enhanced photocatalytic activity with higher selectivity for CO, while CH 4 was also produced, as well as HCOOH and CH 3 COOH in a liquid medium in lower proportions.The results indicate that the beneficial MgO influence is only effective at low amounts, whilst a high MgO amount favors an insulating behavior instead of semiconducting, reducing the nanocomposite performance for CO 2 photoreduction."
  },
  {
    "title": "Experimental",
    "content": "MgO was obtained by annealing treatment of the MgO(NO 3 ) 2 .6H 2 O (Synth/P.A.) at 500 C for 2 h with a heating rate of 3 C min -1 .TiO 2 nanorices were obtained using a two-step hydrothermal method.In the first step, TiO 2 P25 (Degussa) was dispersed in alkaline solution of NaOH (10 mol L -1 ), placing the capsule in an autoclave, while the hydrothermal treatment was performed at 140 C for 24 h.Thereafter, the produced sodium titanate was subjected to a second hydrothermal process at 200 C for 12 h.Finally, the produced TiO 2 nanorices were centrifuged, washed and dried at 50 C overnight.For the synthesis of the TiO 2 /MgO nanocomposite, the two oxides previously obtained were mixed in different mass proportions of 1.0, 2.0 and 5.0 (w/w) and then calcined at 150 C for 2 h at a heating rate of 3 C min -1 , which were referred to as TiO 2 /MgO 1, TiO 2 /MgO 2 and TiO 2 /MgO 5, respectively. The morphology of the samples was obtained by field emission gun scanning electron microscopy (FEGSEM) JEOL JSM 6701 F. The crystalline phase of TiO 2 and nanocomposites powder were characterized by X-ray diffraction (XRD) using CuK radiation in the 2 range from 20 to 80, employing a Shimadzu XRD-6000 diffractometer.Raman measurements were obtained with an FT-Raman spectrometer (Bruker RAM II with a Ge detector) equipped with an Nd:YAG.All spectra were acquired at an excitation wavelength of 1064 nm, generating a power of 100 mW at a resolution of 2 cm -1 .The formation of nanocomposites was verified using high resolution transmission electron microscopy (HRTEM) employing the TECNAI G2 F20 microscope (FEI), operated at 200 kV.Colloid suspensions were dripped onto wetting carbon-coated copper grids and then dried in the air to obtain the images.The microscopy integrated with X-ray energy-dispersive spectroscopy (XEDS) was also employed for elementary characterization of the nanocomposite containing 1 magnesium (TiO 2 /MgO 1).Diffuse reflectance spectra (DRS) in the ultraviolet-visible region were recorded between 200 and 800 nm, at room temperature, using a Cary 5 G instrument (Varian) operated in diffuse reflectance mode to determine the band gap of the materials.The zeta potentials of the TiO 2 /MgO 1 nanocomposite and TiO 2 pure were determined with a Zeta Sizer nano-ZS instrument (Malvern Instruments) in the pH range from 9 to 2, with the pH adjusted by adding 0.1 mol L -1 HCl or 0.1 mol L -1 NaOH.The surface composition and elemental chemical state of the co-obtained sample were investigated by X-ray photoelectron spectroscopy (XPS) using a K-Alpha XPS instrument (Thermo Fisher Scientific, UK).The incident radiation used was Al K X-rays, 10 -8 mbar of vacuum, and with charge compensation during the measurements.Surveys and highresolution spectra were recorded using a pass energy of 1 eV, with 5 scans and 0.1 eV with 50 scans, respectively.The binding energy was referenced to the C 1s peak at 284.7 eV.A data analysis was performed using Casa XPS software.The specific surface area values were calculated using the Brunauer-Emmett-Teller (BET) method and pore size distribution were determined from the adsorption branch of the isotherm using the Barrett-Joyner-Halenda (BJH) method.Samples were previously degassed at 80 C under vacuum until a degassing pressure 10 mHg and N 2 adsorption-desorption isotherms were measured with a Micromeritics ASAP 2020 analyzer at 77 K. Diffuse reflectance infrared Fourier transform spectroscopy (DRIFTS) for in situ adsorption of carbon dioxide (CO 2 ) were obtained in a Thermo Nicolet 4700 Nexus FT-IR Spectrophotometer with MCT-B Detector (Mercury Teluride Cadmium) using a DRIFTS cell from Harrick Scientific with a CaF 2 window.The spectra were collected with 30 scans and 4 cm -1 resolution.Initially, samples were pretreated with a flow of 40 mL min -1 N 2 for 30 min at 25 C.Then, the in situ adsorption step was commenced with a flow of 15 mL min -1 of CO 2 at 25 C collecting spectra every 1 min.After complete saturation of the medium with CO 2 , the desorption of the species was carried out with 40 mL min -1 of N 2 at room temperature until the signal stabilized, collecting the spectra every 1 min up to 5 min. The CO 2 photoreduction reaction occurred in a 225 mL-capacity cylindrical steel reactor, covered with borosilicate glass under UVC light (PHILIPS 5 W), with a maximum wavelength of 253.7 nm (0.167 mW/cm 2 ) (Fig. S1).Samples of 100 mg of the nanocomposites or pure TiO 2 were dispersed in 100 mL of distilled water or in 100 mL of NaOH (0.1 mol L -1 ) solution that was constantly stirred.Before starting the reaction, high-purity CO 2 gas was bubbled for 20 min to saturate the reactor and ensure that all the oxygen had been eliminated. The reactor used in photoreduction is surrounded by a heat exchanger so that it allows temperature control that was kept constant at 25 C throughout the reaction period.Since the solubility of a gas is temperature dependent, where at high temperatures they have reduced solubility 18, this setup was chosen to keep reactions at low temperatures ensuring higher CO 2 solubility in water. At determined time intervals, aliquots of 200 L of the gas phase were collected and analyzed to evaluate the progress of the reaction.For this, a gas chromatograph (model CP-3800, Varian) equipped with a thermal conductivity detector (TCD) and flame ionization detector (FID), as well as a packed column (HayeSep N (0.5 m 1.8)) was used.The gas flow rates were 30 mL min -1 for H 2 , 300 mL min -1 for air and 30 mL min -1 for N 2 .The injector temperature was 150 C, 200 C for the TCD detector and 150 C for the FID detector.The quantification of products and yield of the reactions was calculated using injections of standard gaseous mixtures. To evaluate the products formed in the liquid phase, high performance liquid chromatography (HPLC-LC-20AD, Shimadzu) was used.After 24 h of reaction, aliquots of 20 L were injected into an Aminex HPX-87H column (300 x 7.8 mm) and kept at a constant temperature of 40 C capable of analyzing carboxylic acids and alcohols, in dilute H 2 SO 4 solution (0.33 mmol L -1 ) as a mobile phase at 0.6 mL min -1 .The experiment of CO 2 reduction over 48 h was performed with the TiO 2 /MgO 1 nanocomposite and aliquots were withdrawn for the liquid phase analysis over this period.This chromatograph is equipped with a differential refractive index detector (RID-10A) suitable for alcohols, while a UV-vis detector (SPD-20A, 210 nm) with deuterium lamp suitable for carboxylic acids."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The morphological characteristics of the isolated semiconductors (MgO and TiO 2 ) and nanocomposites are shown in Fig. 1, and for comparison purposes, the morphology of Na 2 TiO 3 (the precursor to TiO 2 ) can also be seen (Fig. S2).The Na 2 TiO 3 obtained in the first hydrothermal treatment step has an undefined shape (Fig. S2a), whereas after the second hydrothermal treatment, the TiO 2 nanorices are clearly observed (Fig. 1a).MgO, on the other hand, shows agglomerated micrometric particles (Fig. S2b), with some denser regions.After the physical mixing and calcination of TiO 2 with MgO at different mass ratios, a slight change in TiO 2 nanorices morphology can be observed (Fig. 1b-d).These materials exhibit similar morphologies to pristine TiO 2 , but with some irregular particles on its surface attributed to MgO. 116), ( 220) and (215), in agreement with the standard data.In the nanocomposite containing, 1 of MgO, it was not possible to observe any change in TiO 2 crystalline phase, probably due to the high dispersion and low MgO content on the TiO 2 surface 20,21.However, at higher loadings of MgO (i.e., TiO 2 /MgO 2 and TiO 2 /MgO 5), a new peak at 42.8is observed, referring to the cubic MgO periclase phase JCPDS 87-0653 22. Raman spectroscopy was used as an additional technique to X-ray diffraction to confirm the medium-range structure.The spectra evolution for the different samples are shown in the Fig. 3a, the enlarged spectrum of the region from 500 cm -1 to 150 cm -1 can be verified at Fig. 3b.Synthesized TiO 2 shows essentially four peaks, being 144 cm -1 , 399 cm -1 , 515 cm -1 and 639 cm -1 , attributed to E g , B 1g , A 1g and E g active vibrations of anatase TiO 2 , respectively 14,23.All of the nanocomposites showed characteristic peaks of the TiO 2 anatase phase, as well as peculiar peaks to the brookite phase shown in the enlarged spectrum, which corroborates the data collected in X-ray diffraction, indicating that brookite and anatase phases were obtained under the synthesis conditions used.Despite the well-known performance of the TiO 2 anatase phase in photocatalytic reactions, the presence of the brookite phase plays an important role in the semiconductor performance, considering the synergistic effect between these two phases, which can improve the efficiency of the reactions 14.For the brookite phase, six active vibrations in the enlarged Raman spectrum were identified at 214 cm -1 (B 1g ), 247 cm -1 (A 1g ), 287 cm -1 (B 1g ), 322 cm -1 (B 1g ), 366 cm -1 (B 2g ) and 452 cm -1 (B 2g ).However, when MgO content increases to 2 and 5, the brookite TiO 2 changes to anatase, probably by surface diffusion.As the transformation brookite to anatase is topotactic, small surface modifications can easily induce transformation to the most stable phase 14,19,24. In order to study the TiO 2 /MgO 1 microstructure in detail, HRTEM and the element mapping analyses were performed (Fig. 4).The HRTEM image shows a TiO 2 anatase phase in the nanocomposite with 0.35 nm interplanar spacing, corresponding to the (101) plane 8,21.It is possible to confirm the presence of MgO particles on the TiO 2 surface, with an interplanar spacing of the 0.21 nm ((200) plane), indicating the formation of nanocomposite between these two oxides 13,21.Other evidence of the presence of MgO on the surface of TiO 2 was obtained from the elemental X-ray mapping results.These results suggest that the Mg species are evenly dispersed on the TiO 2 surface (Fig. 4c). The determination of the optical properties of photocatalysts is closely related to their efficiency in photocatalytic reactions.Thus, these properties were determined for all samples obtained using UV-vis diffuse reflectance spectroscopy (UV-vis DRS).Absorption edges (Eg) were determined by means of the Tauc method (Fig. S3) 25,26.The absorption edge was identical between the TiO 2 semiconductor and the nanocomposites containing 1 and 2 MgO (3.3 eV), whereas for the nanocomposite containing 5, the value identified was close to 3.4 eV.These results suggest that smaller MgO additions do not significantly interfere in photoactivation (as the absorption edge is similar to the TiO 2 band gap), but in higher contents (i.e., 5) modify the optical property, shifting to more insulating behavior, which can be deleterious for the photocatalytic activity of the nanocomposites.Considering the MgO contents, this effect is probably associated with the oxide coverage, leading to a fully covered TiO 2 . An XPS analysis was performed to investigate the surface composition and chemical state of the elements in TiO 2 /MgO 1, TiO 2 and the MgO as-obtained samples, as can be seen in Fig. 5. From the survey spectra for the TiO 2 /MgO 1 sample (Fig. 5a), Ti, Mg, O and C (this was used as an internal reference) were confirmed, without the presence of any contamination.The high-resolution spectra of the Ti 2p region for the TiO 2 sample pristine exhibited two characteristic peaks around 458.3 eV and 464.0 eV, which are indexed to Ti 2p 3/2 and Ti 2p 1/2 , respectively.On other hand, the TiO 2 /MgO 1 nanocomposite exhibited a positive shift in these peaks for 458.7 eV and 464.5 eV, which is indicative of the heterojunction formation, as it is expected that the interaction between the phases changes the chemical environmental.The high-resolution spectra of the region of O1 s for pristine TiO 2 exhibit a wide and slightly asymmetrical peak, indicating that other oxygen species are present in the surface region, and that these oxygen species might be hydroxyl oxygen and adsorbed oxygen on the surface of the as-obtained samples.TiO 2 /MgO 1 nanocomposite exhibits a small positive shift in these peaks.On the other hand, the MgO sample exhibits a more symmetrical peak with strong positive shift 21,272829.Finally, in the Mg 1 s, high-resolution spectra confirm that MgO and TiO 2 /MgO 1 exhibited the same profile, which is indicative that the method was efficient for the deposition of MgO on the TiO 2 samples, even at the low concentration.An estimation of the Mg content by XPS data (by peak integration) indicates a molar relationship of 0.116 Mg/Ti, higher than what was expected by the synthesis stoichiometry (0.02 Mg/Ti).As XPS is more sensitive to surface atoms, this result indicates that MgO was not incorporated but actually dispersed over the TiO 2 surface. The textural properties of the samples were evaluated by N 2 adsorption-desorption and all materials presented a higher amount of mesopores, and as expected, the surface area decreased slightly after the MgO addition to the TiO 2 surface, from 23 m 2 g -1 for pure TiO 2 to 15 m 2 g -1 for MgO-decorated samples.Thus, it is attributed to the improved adsorption of CO 2 molecules to the addition of MgO on the TiO 2 surface, rather than to the adsorption process, given the small surface area of the materials.However, the reduction in surface area indicates that the increase in photocatalytic activity for decorated samples is correct, not an artifact of different surface areas. The photocatalytic performance of pure TiO 2 and TiO 2 /MgO nanocomposites in water and NaOH basic solution (0.1 M) are shown in Fig. 6.The maximum amount of methane produced during all the reactions of CO 2 photoreduction carried out in NaOH-solution were higher than those in the aqueous medium (Fig. 6b).This phenomenon can be explained by the higher solubility of CO 2 molecules in NaOH solution compared to pure water.In fact, before the photoreaction the NaOH solution had stabilized in pH 6.74 (after 20 min of CO 2 bubbling), while the aqueous system had reached pH 4.18, indicating that the reaction in the NaOH system was carried on over HCO 3 -ions instead of soluble CO 2 .The local acidity also reveals the consumption of CO 2 during the reaction: after 6 h, pH in an aqueous medium system rises to 4.61, while in the NaOH system it reaches 7.24.In both cases, the acidity is defined by the effective amount of CO 2 in the solution, with the rising pH indicating the extension of CO 2 photoconversion 10. According to the fundamentals of photocatalysis, as a semiconductor is photoexcited by irradiation with energy equal to or greater than the band gap energy, an electron is transferred from the valence band (VB) to conduction band (CB), forming an electron-hole pair (e -/ h ).Semiconductors with high valence band potential, as in the case of TiO 2 (E VB 2.95 V vs. NHE) 16,17,30, have holes with high oxidizing power which, in our case, are involved in O 2 evolution from water.As in the case of the TiO 2 /MgO samples presented in this manuscript, MgO acted mainly in the intensification of the CO 2 molecules adsorption process due to its basic character, while the reaction medium water molecules were oxidized in the valence band of TiO 2 (H 2 O/O 2 0.82 V). Aside from the difference in performance with respect to the reaction medium, it is observed that the nanocomposite containing 1 of MgO showed a higher production of CH 4 in relation to the other analyzed samples (Fig. 6b).We assume that, as CO 2 is likely to adsorb over MgO layer at TiO 2 surface, metastable magnesium carbonate species are formed 10.However, with higher amounts of MgO (TiO 2 /MgO 2 and 5), the catalytic efficiency diminishes, suggesting that the insulating effect of the MgO particles prevails.As high amounts of MgO species can fully cover the TiO 2 surface, this can prevent the migration of the photogenerated charge carriers at the TiO 2 surface and thus leads to reduced activity 21. In addition, some studies reveal that the adsorption of CO 2 in TiO 2 / MgO-type nanocomposites may lead to the formation of bidentate carbonate (b-CO 3 2-) and bicarbonates (HCO 3 -), which is in accordance with our findings in in situ FTIR (Fig. 8).The generated HCO 3are possible intermediates for the formation of CO and C1 fuels, unlike the b-CO 3 2-species, which can accumulate on the surface of the catalysts, leading to a decrease in efficiency, which may also explain the reduction in methane production by the nanocomposites with higher MgO content 9 as evinced by HRTEM and element mapping, MgO is uniformly distributed on the TiO 2 surface.A second product present in higher quantities in the CO 2 photoreduction compared to CH 4 was CO (Fig. 7), which corroborates the results obtained in previous studies 31.However, for CO formation, no significant difference was observed amongst the samples.This indicates that the MgO content does not alter the CO formation pathway, and that the reduction process starts in any case at the TiO 2 surface 9.Some authors suggest possible pathways based on the main products, CO, CH 4 and CH 3 OH.CO, for example, may be formed from the decomposition of HCOOH by irradiation (HCOOH hv CO) 10.With CH 4 , in turn, although different pathways are proposed in the literature, the most cited is its synthesis, having the CO itself as an intermediate 10,31,32. During the CO 2 photoreduction process, after physisorption of this molecule, numerous reactions with different intermediate compounds can be formed, depending on the semiconductor characteristics and reaction conditions.One of the ways proposed in the literature for CH 4 production, goes through CO as discussed.However, CH 4 can also be produced by reducing CO 2 , which requires eight electrons and eight protons (CO 2 8H 8e - CH 4 2H 2 O).Therefore, CO reduction to CH 4 is thermodynamically and kinetically more favorable than the reduction of CO 2 for CH 4 33343536.Thus, the production of CH 4 may be related to both CO 2 adsorption on the semiconductor surface and the ability to reduce CO to CH 4 .The latter in turn needs CO adsorbed on the catalyst surface or the same solubilized in the aqueous medium. Considering that for CO production only two protons and two electrons are required (CO 2 2H 2e - CO H 2 O), its formation is more favorable compared to CH 4 , which requires eight protons and eight electrons (CO 2 8H 8e - CH 4 2H 2 O) 21.Thus, it is inferred that the lower production of CH 4 compared to CO may be related to this condition, but is also influenced by the surface affinity for CO 2 , requiring higher electron transference.These results were confirmed in another photoreduction setup with similar trends in CO 2 photoreduction, despite the difference in relation to reactor design and reaction conditions (as seen in Fig. S5).Fig. 8 shows a comparison of CH 4 and CO production by different samples. In addition to the products obtained in the gas phase, two products were detected in the liquid phase (Table 1), namely formic acid (HCOOH) and acetic acid (CH 3 COOH).We can observe that the trend of photoactivity for CO 2 conversion for HCOOH and CH 3 COOH was similar to the results in the gas phase, where the nanocomposite containing 1 of MgO showed better performance.From this, we confirmed that smaller amounts of basic oxides on the surface of TiO 2 are more effective for CO 2 photoreduction.It is important to note that the formation of acetic acid requires eight electrons and eight protons (2CO 2 8e - 8H CH 3 COOH), as well as for the production of methane, unlike the formic acid, which in turn requires two protons and two electrons (CO 2 2e - 2H HCOOH) 1,2,37.In addition, HCOOH is one of the intermediates in the production of CO 10 that also infers that this intermediate is rapidly consumed in successive reactions for the consequent production of CO. Several studies in the literature demonstrate that CO is one of the main intermediates in CH 4 formation, as discussed in the manuscript 383940.During CO production only two electrons are required, unlike CH 4 that needs eight electrons.Thus, we noticed that CH 4 production, in any condition, is very below the CO production, as also observed for the production of acetic acid, which, similar to methane, requires eight electrons for its production (2CO 2 8e - 8H CH 3 COOH).Therefore, based on the results exhibited, we propose that products such as methane (CH 4 ) and acetic acid (CH 3 COOH) are more difficult to form in this system since they need more electrons. As discussed above, the formation of CH 4 can follow two main pathways, one having CO as intermediate , and the other by direct reduction of CO 2 (CO 2 8H 8e - CH 4 2H 2 O).Thus, the higher CH 4 /CO ratio presented by the TiO 2 /MgO 1 (49.80) sample may be related to the formation of CH 4 by the direct reduction of CO 2 .On the other hand, the other samples have practically the same CH 4 /CO ratio (20), as seen in Table 1, suggesting that the production of CH 4 by them preferably passes through the formed CO. Another important aspect in the process of CO 2 photoreduction is the surface potential of the semiconductor as it relates to its stability in the aqueous suspension.The zeta potential of TiO 2 and TiO 2 /MgO 1 decreased considerably with the increasing pH of the suspension, while the isoelectric point was 3.01 and 3.56, respectively (Fig. S4).At the point of zero charge, the particle surface is neutral which favors its aggregation in suspension.However, as the CO 2 photoreaction reactions were conducted at a higher pH than the isoelectric point, this medium favored its dispersion in the solution. Also, as the TiO 2 has the isoelectric point at 3.01 and since the reaction is performed in NaOH solution (pH 6.4) the catalyst has a predominantly negative surface, which does not favor CO 2 adsorption.In addition, according to the equilibrium diagram of CO 2 in water 41, HCO 3 -prevails in equilibrium at this pH.However, MgO has isoelectric point at 10.0 42, therefore the surface charge of MgO sites is positive.This favors the adsorption of HCO 3 -species, consequently increasing their activity in the CO 2 photoreduction process by contact.Diffuse reflectance spectroscopy in the infrared region with a Fourier transform of the adsorbed CO 2 (DRIFTS-CO 2 ) was associated with the desorption technique with N 2 , while a flow purge was performed and the results obtained confirm what was previously discussed.The spectra obtained for TiO 2 and TiO 2 /MgO 1 are similar, with band characteristic of carbonate (CO 3 2-: 1319, 1363, 1378, 1520 and 1522 cm -1 ) 12 and bicarbonate (HCO 3 -: 1228, 1448, 1626, 1650, 1682 cm -1 ) 9,12,43,44 species adsorbed on the surface of these materials when subjected to CO 2 flow (Fig. 9). Species of type HCO 3 -produced by the CO 2 reaction with superficial OH groups 18 are possible intermediates in CO formation 9, and it is noteworthy that these species are better seen in TiO 2 , especially in 1228 cm -1 and 1443 cm -1 (Fig. 9a).The presence of MgO on the surface of TiO 2 in TiO 2 /MgO intensifies the adsorption process of CO 2 molecules by their basic character.MgO may bind to CO 2 to form Mg carbonate species 45, which is possible in a small amount, as suggested by a small peak at 1473 cm -1 related to MgCO 3 (Fig. 9b). Although the mechanism of CO 2 photoreduction has not yet been fully clarified, it is known that the first step of the process may be the formation of the CO 2 -anion by electrons originated from the defective surface of the semiconductor 16,37, evinced at 1670 cm -1 in both semiconductors.These species are rapidly formed and gradually diminish over time 32.However, for MgO-decorated material, the HCO 3 -adsorption, is much more expressive, as seen by the peak at 1682 cm -1 (Fig. 9b), suggesting that the CO 2 coordination is performed in hydrated form (carbonate anion).When the CO 2 flux is interrupted and N 2 introduced, the adsorbed species are rapidly desorbed, as shown Fig. 9., indicating a process of physisorption of the different species at the surface of the materials.This is an advantage from the point of view of catalysis, as reaction intermediates are produced and quickly desorbed, preventing the blocking of reaction sites.However, again, HCO 3 -species are more persistent in the MgO-decorated sample, suggesting this coordination path.The peak at 1716 cm -1 (Fig. 9a) is characteristic of HeOeH bending vibration band 46 of water molecules that may have adsorbed on the surface of TiO 2. In addition to CO 2 adsorption, the desorption process in N 2 atmosphere was also analyzed (Fig. 10).As is well known, CO 2 is an acidic molecule and MgO in nanocomposite could irreversibly react, forming MgCO 3 , ceasing any catalytic process 11,43,47.However, desorption profiles (Fig. 10) suggest that CO 2 adsorption is reversible, despite being favored by MgO decoration: after two minutes of CO 2 flow, there is saturation of this gas, as can be observed in the spectrum at 2349 and 2370 cm -1 .In one minute (2340 and 2360 cm -1 ), it is clear that the adsorption of CO 2 is preferential on the surface of TiO 2 /MgO 1 compared to pure TiO 2 , confirming that the presence of MgO favors the process of CO 2 adsorption.As the adsorption is favored by the presence of MgO, in the desorption process, CO 2 remains longer on the TiO 2 / MgO 1 surface, i.e., the desorption is slower in this material despite taking place, as desired."
  },
  {
    "title": "Conclusions",
    "content": "In summary, we have shown how basic metal oxides such as MgO positively influence the catalytic activity of nanocomposites for CH 4 production by CO 2 photoreduction.This effect is only observed in small amounts of MgO, while in large amounts the insulating character of this oxide prevails, reducing the performance of semiconductors.The CO 2 photoreduction by TiO 2 /MgO nanocomposites formed in the gaseous phase CH 4 and CO, suggesting that the production of the latter has CO as the intermediary, while the HCOOH and CH 3 COOH were formed in the liquid phase.The high performance of these materials justifies their application to this proposal; however, it should be further explored for a better understanding of all the mechanisms involved. There are no conflicts to declare. shows the XRD patterns of pure TiO 2 and MgO, as well as the different composition of MgO on TiO 2 .The anatase TiO 2 planes are observed in the XRD patterns, as is a characteristic peak of the brookite phase that was identified at 30.9in the synthesized TiO 2 and relates to the plane (211) JCPDS 75-1582 19.The nanocomposites containing 1, 2 and 5 of MgO exhibit diffraction peaks corresponding to the tetragonal anatase phase of TiO 2 , with Bragg diffraction at 2 25.3,37.9, 48.1, 53.9, 55.0, 62.7, 68.8, 70.3and 75.1, respectively, assigning to the diffraction planes (101), (004), (112), (200), (105), (211), (204), ( Fig. 1.SEM images of the TiO 2 (a) and TiO 2 /MgO prepared at different mass proportions; (b) TiO 2 /MgO 1; (c) TiO 2 /MgO 2; and (d) TiO 2 /MgO 5. Fig. 2. Full XRD patterns for TiO 2 , MgO and nanocomposites obtained by the physical mixing of the respective oxides at 1, 2 and 5 of MgO ( Anatase TiO 2 ; Brookite TiO 2 and MgO periclase). Fig. 3. Full and enlarged Raman spectra for TiO 2 , MgO and nanocomposites obtained by the physical mixing of the respective oxides at 1, 2 and 5 of MgO. Fig. 5. (a) Survey spectra and high-resolution spectra of the (b) Ti 2p region; (c) O 1s region; (d) Mg 1s region of the samples as obtained. Fig. 6.Photocatalytic reduction of CO 2 to CH 4 in pure water (a) and in 0.1 M NaOH solution (b) with the TiO 2 and nanocomposites with different proportions of MgO, 1, 2 and 5. Fig. 7. Photocatalytic reduction of CO 2 to CO in 0.1 M NaOH solution with the TiO 2 and nanocomposites with different proportions of MgO, 1, 2 and 5. Fig. 8. Photocatalytic reduction of CO 2 to CO and CH 4 in 0.1 M NaOH solution with the TiO 2 and nanocomposites with different proportions of MgO, 1, 2 and 5 after 24 h reaction. Fig. 9.In situ DRIFTS spectra of the CO 2 molecules adsorbed on (a) TiO 2 and (b) TiO 2 /MgO 1. Fig. 10.Absolute area of adsorbed and desorbed CO 2 molecules on TiO 2 and TiO 2 /MgO 1 at different times under N 2 flow (adsorbed molecules and desorbed molecules).Inset graph: in situ DRIFTS spectra. Amounts of HCOOH, CH 3 COOH, CH 4 and CO formed after 24 h of CO 2 photoreduction catalyzed by the as-synthesized samples in the NaOH-solution and CH 4 /CO ratio. The authors are grateful to the Ministry of Science, Technology, and Innovation (through SisNANO Program -National System of Laboratories in Nanotechnology), the National Council for Scientific and Technological Development (CNPq, Brazil China Virtual Center in Nanotechnology Project and grant 402.287/2013-4),Coordination for the Improvement of Higher Education Personnel (CAPES -Finance Code 001), Sao Paulo Research Foundation (FAPESP grants 15/14330-8, 16/21515-7), and Embrapa Rede AgroNano for their financial support.We thank the Brazilian Nanotechnology Laboratory for Research in Energy and Materials (LNNano) and the Structural Characterization Laboratory (LCE) for technical support during the X-ray photoelectron spectroscopy (grant 13839) and transmission electron microscopy experiments, respectively.Caue Ribeiro also acknowledges Chinese Academy of Sciences (CAS) President's International Fellowship Initiative (PIFI) by financial support and CAPES -Alexander von Humboldt Foundation (Experienced Researchers Fellowship, CAPES Finance Code 001 -CAPES Process 88881.145566/2017-1). Supplementary material related to this article can be found, in the online version, at doi:https://doi.org/10.1016/j.jcou.2019.09.008."
  }
]