[
  {
    "title": "Doi",
    "content": "10.1016/j.jcis.2021.01.009"
  },
  {
    "title": "Article_Title",
    "content": "A step-by-step synergistic stripping approach toward ultra-thin porous g-C3N4 nanosheets with high conduction band position for photocatalystic CO2 reduction"
  },
  {
    "title": "Abstract",
    "content": "h i g h l i g h t sA step-by-step synergistic stripping strategy was developed to prepare ultra-thin porous g-C 3 N 4 (THCN) with high conduction band position.The THCN exhibits the best excellent separation and utilization efficiency of photo-generated carriers, supporting excellent conversion efficiency from CO 2 to CH 4 and CO fuels.Our work provides a reference for preparation of other two-dimensional ultra-thin materials."
  },
  {
    "title": "Experimental",
    "content": "All reagents are of analytical grade and used without further purification.which were named as BCN and HCN, respectively 22.Preparation of g-C 3 N 4 from thermal stripping/etching which is named as TCN 24: A ceramic crucible with 0.2 g BCN was placed in a tube furnace with firebricks on both sides in steady state air, and heated to 520 C at a heating rate of 5 C/min.After keeping the BCN for 2 h at 520 C, it was cooled naturally to room temperature.Preparation of THCN: The synthetic method of THCN is the same as TCN, only replacing BCN with HCN. The following is described in detail in the supplementary information: Sample characterization, photocatalytic hydrogen production, photocatalytic CO 2 reduction, photocatalytic degradation of Rhodamine B, and photocurrent response and electrochemical impedance spectroscopy."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The BCN prepared by thermal polymerization is assembled by strong acting interlayer forces.Due to the strong cohered acting force between layers, it is difficult to obtain ultra-thin g-C 3 N 4 nanosheets by a single stripping method.The TEM was used to observe the surface morphology and thickness of the samples.As shown in Fig. 1a, b and Fig. 1Sa,b, HCN exhibits thinner nanosheets after HCl-assisted hydrothermal stripping compared with BCN, and there is no apparent pore formation on its surface.The TCN prepared by thermal stripping/etching for BCN not only exhibits layer's structure, but also has rich pore on the surface.However, the only g-C 3 N 4 prepared by HCl-assisted hydrothermal stripping or thermal stripping/etching in air still exhibits thicker nanosheets, respectively.Compared with BCN, HCN and TCN, the THCN would become more transparent and presents a winkled and ultra-thin nanosheets with abundant pore on the surface after further thermal stripping/etching of HCN.The knitting of wrinkled, ultra-thin and surface-porous THCN nanosheets can shorten the distance from the body to the surface diffuse migration of photogenerated charges, thus inhibiting the photo-generated charges in the internal recombination.The element mapping images exhibit homogeneous distribution of C, N and O atoms in THCN (Fig. S1e-i).The XRD was used to characterize the crystal structure of the samples.In the XRD of all the samples, there are two distinct 100 and 002 peaks around 12.6 and 27.1 , which represent the inplane structural packing motif and the inter layer stacking of the conjugated aromatic systems, respectively 26.All samples exhibit similar the peak sites, indicating that the THCN remains crystal structure of g-C 3 N 4 after two-step stripping.Compared with BCN, HCN and TCN, the peak strength of THCN is the weakest in Fig. 1e andf, and the 001 peak is obviously shifted to the right, which indicates that the stacking distance between layers is obviously enlarged 24.The increase of the distance between layers results in the expansion of the volume of THCN (Fig. 1g).In order to reflect the layer spacing changes with the stripping process, we calculated the crystal spacing of all samples according to the Bragg equation (1): where d is the spacing between the crystal planes, h is the Angle between the incident X ray and the corresponding crystal plane, k is the wavelength of X ray, and n is the diffraction series.The calculated results indicate that THCN has an obviously minimum d value (Table S1) and the change of d value is positively correlated with the layer thickness of g-C 3 N 4 nanosheets.This means that the THCN is more capable of occurring photogenerated charges transfer and separation than BCN, HCT and TCN. The XPS was used to analyze the surface chemical states and compositions of the samples 30.Figure S2a-d the structure of triazine after HCl stripping and thermal/etching in air.As showed in Fig. S2i-l, the four high resolution N1s peaks at around 398.89 eV, 400.20 eV, 401.27 eV and 404.68 eV represent sp 2 N atoms involved in tris-triazine rings (C-NC), tertiary nitrogen (N-(C) 3 ), bonded with H atoms (CANAH) groups and charging effect in triazine rings.We found that compared with HCN, the peak position of THCN representing CANAH groups shifted significantly in the direction of larger bond energy after thermal stripping/etching, which also was weakly observed in BCN and TCN.This means that CANAH is fractured, release NH 3 and further oxidized to CO in air atmosphere, which would introduce rich porous structure to the surface of g-C 3 N 4 .In summary, compared with BCN and HCN, the C-OH and CANAH group of g-C 3 N 4 can be partially oxidized to CO group after thermal stripping/etching in air.The possible structure of the transition from BCN to HCN, and then to THCN is shown in Scheme S1.The polarization in CO in g-C 3 N 4 will lead to uneven charges distribution, which is beneficial to the adsorption of more CO 2 molecules. The Fig. 2a and Fig. S3 show the nitrogen adsorption-desorption and pore size distribution curves of all the samples.The BET of THCN are 55, 3.6 and 3.45 times those of BCN, HCN and TCN, respectively (Fig. S4a).Correspondingly, the THCN also exhibits a larger pore volume compared with BCN, HCN and TCN (Fig. S4b).The pore sizes of HCN and BCN are almost the same, which means that the surface of g-C 3 N 4 don't exist obvious holes after HClassisted hydrothermal stripping.Furthermore, comparing with HCN and BCN, both TCN and THCN show bigger pore volumes, demonstrating that the holes on the surface of g-C 3 N 4 can be formed by thermal/etching in air, which is consistent with TEM results.The large specific surface area and abundant pore structure of THCN can provide active sites and adsorption sites for CO 2 reduction. The Fig. 2b,c shows the FTIR spectra of all samples.The strong peak at 809 represents the tri-s-triazine rings units of g-C 3 N 4 .The broad peaks at 1200-1700 represent the CAN heterocycle, and the broad peaks at 2900-3500 represent the NAH bond and the water molecules adsorbed on the g-C 3 N 4 surface 272829.However, the peak position of CO at around 1600 cm A1 is similar to CAN heterocycle, so it is very difficult to characterize formation of CO group which is introduced by thermal stripping/etching in air.As showed in Fig. 2c, the enhanced peak strength of THCN at 2900-3500 indicates that THCN has a better capacity for water absorption than BCN, HCN and TCN.The enhanced absorption of water molecules can provide additional H for the conversion of CO 2 to CH 4 .The peak of all samples in the same position indicates that the main structure of g-C 3 N 4 is still well maintained after twostep stripping and etching, which is consistent with the XRD results. According to UV-vis DRS Spectra, the THCN obtained after twostep exfoliation still shows strong visible light absorption capability, with a maximum absorption wavelength of 475 nm (Fig. 3a).The corresponding band gaps of BCN, HCN, THCN and TCN are calculated to be 2.61 eV, 2.63 eV, 2.66 eV and 2.56 eV, respectively (Fig. 3b).Compared with other samples, the THCN shows the widest band gap.In order to further study the effect of different stripping modes on the valence band electronic structure, the XPS valence band spectra were analyzed (Fig. 3c).The corresponding valence band minimum (VBM) values for BCN, HCN, THCN and TCN are 2.09 eV, 2.37 eV, 2.02 eV and 2.12 eV, respectively.Combining the results of UV-vis DRS, which reckoned on the basis of Tauc formula (aht) A(ht A Eg) n/2 21, the corresponding conduction band maximum (CBM) values for BCN, HCN, THCN and TCN are A0.52 eV, A0.26 eV, A0.64 eV and A0.44 eV, respectively.The band structure of the samples is given in Fig. 3d, which shows that the THCN has the strongest reduction ability.The widest band gap and the strongest reduction ability of THCN will be more beneficial to photocatalytic CO 2 reduction.The PL spectrum was used to reflect thickness and band gap variation of g-C 3 N 4 by step-bystep synergistic stripping (Fig. S5) 31.The THCN shows a strongest fluorescence intensity and it's peak position presents the most obvious blue shift than BCN, HCN and TCN, which indicates the successful introduction of a larger band gap and thinner nanosheets in THCN compared to BCN, HCN and TCN by a twostep stripping method. Fig. 4a shows the linear sweep voltammetry curve of light response for all samples.The two-step stripping of THCN results in a higher anodic current compared to other samples, which is attributed to the shorter diffused migration path of photogenerated charges due to it's ultra-thin structure, this further weakens the internal recombination of electrons and holes, which is consistent with excellent CO 2 reduction properties.To further explore the ability of photocharges separation and transfer, photocurrent response and electrochemical impedance spectroscopy were tested 32.Compared with other samples, the two-step stripped THCN exhibits the highest photocurrent density, and the smallest hysteresis loop (Fig. 4b,c).This further indicates that As shown in Fig. 4f, the THCN can produce 9.17, 1.56 and 2.26 times as much hydrogen as BCN, HCN and TCN, respectively.The highest hydrogen production of THCN indicates that more electrons can be involved in photocatalytic CO 2 reduction. Because of its unique surface structure, the THCN would be a good photocatalyst for CO 2 reduction.Thus, the photocatalytic conversion of CO 2 under visible light was used to evaluate the performance of all samples.As shown in Fig. 5a andb, the methane (CH 4 ) and carbon monoxide (CO) gas produced by the different catalysts as function of time.Compared with BCN, HCN and TCN, the THCN not only shows the highest amount of CO gas, but also the highest amount of CH 4 gas.This is attributed that the unique ultra-thin nanosheets and porous structure of THCN enhances the separation and utilization efficiency of photo-generated charges, apart from that provides more adsorption and activation sites for CO 2 molecules.Furthermore, the high conduction potential of THCN is the key to its excellent CO 2 reduction ability.The HCN exhibits more excellent photo-generated charges separation and utilization efficiency and high hydrogen production compared with TCN, but the relatively low conduction potential of HCN leads to weaker the conversion of CO 2 to CH 4 than that TCN.The Fig. 5c shows the cyclic stability of photocatalytic conversion CO 2 to CO over THCN.There's no significant decay for CO evolutions under illumination for 12 h, which is attributed to g-C 3 N 4 's intact structure and excellent stability after undergoing HCl-assisted hydrothermal stripping and thermal stripping/etching.As shown in Scheme S2, we propose a possible photocatalytic CO 2 reduction mechanism of THCN 34,35: Firstly, the photogenerated electrons are excited from the CBM of THCN under visible light, then migrate to H 2 O and CO 2 adsorbed on the surface of THCN to trigger the reduction reaction, where THCN with a strong reduction ability (A0.64 V (vs NHE)) can realize CO 2 -to-CO (A0.52 V) and CO 2 -to-CH 4 (A0.24V) conversions.At the same time, the photogenerated holes are excited from the VBM of THCN under visible light and participate in the triethanolamine (TEOA) oxidation, which can provide electrons to the photocatalytic system. To achieve excellent pollutant degradation performance, the photocatalysts usually require a high specific surface area and a wide band gap which corresponds to a strong redox potential 36.The THCN satisfies all the above characteristics, indicating that the THCN can also be used as an excellent photocatalytic degradation of pollutants.As a common dye pollutant, the RhB is often used to evaluate the photocatalytic degradation of pollutants because of its obvious color change and structure stability 37.The Fig. 5d shows a comparison of the RhB degradation performance of the all samples.As expected, the THCN demonstrates the best photocatalytic degradation performance, only requiring 30 min of visible light exposure to achieve complete bleaching of RhB (Fig. 5d).The photocatalytic degradation rates for RhB of THCN to were 9.26, 2.28 and 4.35 times of BCN, HCN and TCN, respectively (Fig. 5e).There is no decline in its ability to degrade RhB over THCN after 10 cycles of degradation (Fig. 5f), which is caused by the structural stability of THCN after undergoing HCl-assisted hydrothermal stripping and thermal stripping/etching.In order to detect the active species which are responsible for photocatalytic degradation of RhB, the radical trapping experiments of EPR were carried out 38.As can be seen from the Fig. S6a-c, the photogenerated electrons in the conduction band will reduce oxygen molecules to produce superoxide radicals ( O 2 -) and the valence band will produce holes by adding the corresponding sacrificial agents in the presence of the photocatalyst, and the signal value can be significantly enhanced in visible light.Interestingly, the hydroxyl radicals ( OH) are also produced under visible light.when O 2 -and holes radicals are captured by corresponding free radical trapping agents, the photocatalytic degradation of RhB by g-C 3 N 4 can be significantly inhibited 39,40.At the same time, due to its strong oxidation ability, OH radicals can degrade all kinds of organic pollutants, including RhB 41.Therefore, the main active species responsible for the degradation of RhB for THCN are O 2 -, OH and holes radicals."
  },
  {
    "title": "Conclusions",
    "content": "In summary, a step-by-step synergistic stripping method was developed to prepare ultra-thin porous g-C 3 N 4 with high conduction band position.The two-step stripping strategy resolves problem of uneven stripping, and introduced more pores into the ultrathin nanosheets by thermal stripping/etching.This resulted in the apparent larger specific surface area for g-C 3 N 4 .Moreover, this unique property also endowed g-C 3 N 4 with high conduction band position, which was in favor of CO 2 adsorption, activation and further reduction.At the same time, the existence of ultra-thin and wrinkled nanosheets shortened the diffused migration distance of photo-generated charges from the inner side to the surface, so Scheme 1. Schematic representation of preparation of THCN by hydrochloric acid assisted exfoliation and thermal stripping/etching method. Fig. 1.The TEM of BCN (a), HCN (b), THCN (c) and TCN (d); The XRD spectra (e) and corresponding magnified image (f) of BCN, HCN, THCN and TCN; (g) A physical picture of all samples with the same quality. Fig. 2. (a) The nitrogen adsorption-desorption curves of BCN, HCN, THCN and TCN; (b) The FTIR spectra and (c) corresponding FTIR's magnified image of BCN, HCN, THCN and TCN. Fig. 3. (a) UV-vis diffuse reflectance spectra; (b) the band gap values; (c) XPS valence band spectra; (d) schematic band structures obtained according to the results in (b) and (c) of BCN, HCN, THCN and TCN. Fig. 4. (a) Linear sweep voltammetry curve, (b) photocurrent response and (c) electrochemical impedance spectroscopy of of BCN, HCN, THCN and TCN; EPR spectra under light (d) and dark (e) of BCN, HCN, THCN and TCN; (f) Photocatalytic H 2 evolution over BCN, HCN, THCN and TCN under visible light (k !420 nm). Fig. 5.The CH 4 (a) and CO (b) evolutions over BCN, HCN, THCN and TCN under visible light (k !420 nm); (c) The cyclic stability of CO evolutions over THCN; (d) Photocatalytic degradation curves of RhB and (e) corresponding kinetic curves over BCN, HCN, THCN and TCN under visible light (k !420 nm); (f) The cyclic stability of photocatalystic degradation of RhB over THCN. B. Yang, J. Zhao, W. Yang et al.Journal of Colloid and Interface Science 589 (2021) 179-186 This study was supported by the National Natural Science Foundation of China (U1703351, 52073179, 51663021), Bingtuan Excellent Young Scholars (CZ027205) and Bingtuan Science Technology Nova Program.We wish to thank the Analysis and Testing Center of Shihezi University for the microscopy and microanalysis of our specimens. that more photo-generated charges could participate in the conversion of CO 2 into CO and CH 4 .Further, the THCN shows excellent pollutant degradation performance due to its unique physical and chemical structure.Nonetheless, our work showed that the high CO 2 conversion efficiency to CO and CH 4 could be achieved by designing and regulating the thickness and surface structure of g-C 3 N 4 nanosheets.Meanwhile, the top-down collaborative stripping strategy is expected to be used in the preparation of other two-dimensional ultra-thin materials for CO 2 reduction. Bin Yang: Conceptualization, Methodology, Investigation, Writing -original draft, Visualization.Jiaojiao Zhao: Investigation.Wenda Yang: .Xiyin Sun: Investigation.Rongjie Wang: Investigation, Writing -original draft.Xin Jia: Formal analysis, Validation, Resources, Funding acquisition, Writing -review editing, Supervision. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://doi.org/10.1016/j.jcis.2021.01.009."
  }
]