[
  {
    "title": "Doi",
    "content": "10.1016/j.jece.2018.10.043"
  },
  {
    "title": "Article_Title",
    "content": "A highly selective Cr/ZrO2 catalyst for the reverse water-gas shift reaction prepared from simulated Cr-containing wastewater by a photocatalytic deposition process with ZrO2"
  },
  {
    "title": "Abstract",
    "content": "Here, we report the preparation of a Cr/ZrO2 composite catalyst for the reverse watergas shift reaction (RWGS) that shows excellent low-temperature CO2 conversion and 100 CO selectivity.The catalyst was prepared from Cr-containing wastewater by photoreduction.Zirconia was used as a wide bandgap photocatalyst to photoreduce Cr(VI) under UV irradiation and immobilize the Cr species on the catalyst surface, resulting in a high dispersion.The results show that the obtained 1wtCr/ZrO2 can catalyze the RWGS to reach the thermodynamic limit at 600 C.The CO yield at"
  },
  {
    "title": "Experimental",
    "content": "ZrO2 nanoparticles were prepared by a typical sol-gel method.The particle size of the ZrO2 nanoparticles was less than 0.15 mm after screening with a 100-mesh sieve. Particles of this size were selected to eliminate inner diffusion effects.A 50 mg L -1 K2Cr2O7 solution (Cr content) was used as the chromium source.A 500-W mercury lamp was employed as the UV light source.The photoreduction process was carried out in a 50-mL quartz tube with 20 mL K2Cr2O7 solution, 100 mg ZrO2, and 2 mL methanol as the hole scavenger.All materials were added to the tube simultaneously and placed in the dark for 40 min to reach adsorption equilibrium.Subsequently, the suspension was exposed to UV light for 4 h.The obtained by-product of photoreduction, Cr/ZrO2, was separated centrifugally from the aqueous solution and dried by vacuum freeze drying without any further treatment.The final product is denoted U-Cr/ZrO2.As a comparison, the U-Cr/ZrO2 sample after calcination in air at 650 C for 2 h is denoted C-Cr/ZrO2 and that after reduction at 500 C with hydrogen for 2 h is denoted R-Cr/ZrO2.Another comparative sample, I-Cr/ZrO2, is that prepared by the volumetric impregnation method using chromium nitrate as the chromium source containing 1 wt Cr followed by calcination at 650 C for 2 h. In addition, a simulated Catofin catalyst (Cr/Al2O3) containing 17 Cr and prepared by a volumetric impregnation method was prepared as a comparison. A c c e p t e d M a n u s c r i p t X-ray diffraction (XRD) measurements were carried out using glancing angle Xray diffraction (X'Pert ProMPD, The Netherlands) with a Cu K 40 kV/40 mA X-ray source.The Brunauer-Emmett-Teller (BET) were carried out with Micromeritics Instrument 2460.Scanning electron microscopy (SEM) was carried out with a JSM-7500F field-emission scanning electron microscope (JEOL).Ultraviolet-visible Diffuse Reflectance Spectrum (UV-vis DRS) was acquired by using a UV-vis spectrophotometer (TU-1901, Ge Beijing Spectrometer, China) to acquire the band gap of samples.The chromium content in the ZrO2 composite was determined by using inductively coupled plasma optical emission spectrometry (ICP-OES, Vista Axial, Varian).X-ray photoelectron spectroscopy (XPS) measurements were carried out on a Thermo Fisher Scientific ESCALAB 250XI with monochrome Al K (hv 1486.6eV).Temperature programmed desorption (TPD) and reduction (TPR) were carried out on a Micromeritics Instrument Corporation Auto Chem II 2920 and Boynton Beach FL33426 of Quantachrome, respectively.In Situ Raman Tests was carried by DXR Microscope (Thermo Fisher) using an excitation wavelength of 455nm with a power of 6 mW.The dispersion of Cr species was detected by transmission electron microscopy (TEM) mapping with Tecnai G2 F20 of FEI.X-ray Fluorescence Spectrometer (XRF-1800, Shimadazu) was employed to determined Cr content loaded. About 0.15 g of the catalyst was placed in a quartz tube with an inner diameter of 4 mm in a continuous-flow fixed-bed reactor.The reactant stream consisting of H2, N2 (employed as internal standard gas), and CO2 (H2: CO2: N2 1:1:0.2) was introduced into the reactor at a flow rate of 55 mL min -1 at atmospheric pressure after eliminating internal and external diffusion.The reaction temperature ranged between 400 and 800 C.The products were analyzed by gas chromatography (Fuli Instruments, FL9790II) with a TDX-01 column connected to a thermal conductivity detector (TCD). The conversion of CO2 and selectivity of CO or CH4 are defined as: Here, CO2(in) and N2(in) are the concentrations of CO2 and N2 at the inlet, respectively, and N2(out), CO(out), and CH4(out) are the concentrations of N2, CO, and CH4 at the outlet, respectively."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The total chromium removal rate is shown in Fig. 1-a wastewater by photoreduction. The catalytic performance of the Cr/ZrO2 obtained from the photoreduction process, U-Cr/ZrO2, and the samples after reduction and calcination, denoted R-Cr/ZrO2 and C-Cr/ZrO2, were assessed for the RWGS, and the results are shown in Fig. 1-b.Pure Cr2O3 and ZrO2, as well as 1wtCr/ZrO2(I-Cr/ZrO2) and 17wtCr/Al2O3 prepared by means of impregnation, were used for comparison, as shown in Fig. 1-c.Promisingly, the determined CO selectivities of all samples were 100 over the whole tested temperature range, although the CO2 conversion of each sample varied.No by-products, such as methane, methanol, or coke, were detected, in accordance with previous reports, suggesting that only CO2 conversion must be considered to assess the RWGS catalytic performance of the samples. We found that the RWGS activities of the Cr/ZrO2 catalysts are significantly higher than those of pure ZrO2 and Cr2O3, as well as 17Cr/Al2O3, although the latter three 11 can also catalyze the RWGS to some extent.A sharp CO2 conversion increase was observed between 400 and 600 C in all Cr/ZrO2 catalysts, both photoreduced and impregnated.The performance of C-Cr/ZrO2 is significantly higher than others including U-Cr/ZrO2 and R-Cr/ZrO2, reaching the maximum RWGS thermodynamic limit of 38.4 at 600 C.In contrast, the CO2 conversion of pure ZrO2 and Cr2O3 increased slowly before 600 C and then rose sharply after 600 C.For 17Cr/Al2O3, the CO2 conversion increased proportionally with increasing temperature between 400 and 800 C.This result suggests that photoreduced Cr/ZrO2 has an excellent RWGS catalytic activity and thermal pre-treatment can further improve its performance. The stability of C-Cr/ZrO2 was assessed at 500 C, 0.1 MPa, CO2:H2 1:1, and GHSV 22000 mL g -1 h -1 ).In this test, the system was intentionally shut down and restarted twice to evaluate the operational stability.The results of the continuous operations are shown in Fig. 1-d, demonstrating that there was only a slight loss in catalytic performance of C-Cr/ZrO2 from 28 CO2 conversion to 24 after 72 h continuous operation with two reaction halts at 500 C.However, in a single cycle, the performance was stable.In conclusion, the service life of C-Cr/ZrO2 is promising for future industrial applications. To determine the mechanism resulting in the superb performance of C-Cr/ZrO2, we investigated the morphology, structure, and components of the catalysts before and after use.I-Cr/ZrO2 was used as a comparison sample. The XRD analysis results are shown in Fig. 2-a, showing that only peaks characteristic of ZrO2 (2 28.199,31.486,50.377, and 50.711) were observed for all Cr/ZrO2 samples, that is, pure monoclinic ZrO2 at 28.199 and 31.486 and tetragonal ZrO2 at 50.377 and 50.711.No significant changes to the crystal structure were observed for fresh and used C-Cr/ZrO2 and I-Cr/ZrO2, indicating that the performance difference between these catalysts is not due to the structure of the photocatalyst carriers.Furthermore, it can be reasonably assumed that the Cr species on the ZrO2 surface are amorphous and highly disperse because no peaks corresponding to Cr species were observed. The Brunauer-Emmett-Teller (BET) results for the five samples are shown in Table 1.The specific surface area of ZrO2 decreased from 62 to 45 m 2 g -1 after photoreduction and calcination and further to 18 m 2 g -1 after use.The impregnated samples, I-Cr/ZrO2, had relatively greater surface areas and pore volumes than C-Cr/ZrO2 at the same stage but similar pore diameters.However, after use, the specific surface area and pore volume of I-Cr/ZrO2 and C-Cr/ZrO2 both decreased to the same extent, although their pore sizes increased synchronously.Thus, the effect of surface area and porosity on the catalytic performance difference between C-Cr/ZrO2 and I-Cr/ZrO2 can be excluded because the activity of the former was always better than that of the latter. The UV-vis diffuse reflectance spectroscopy (DRS) results of I-Cr/ZrO2, C-Cr/ZrO2, U-Cr/ZrO2, pure ZrO2, and pure Cr2O3 are compared in Fig. 2-b.The peak at 228 nm is assigned to ZrO2 and the peaks at 384, 450, and 600 nm are assigned to Cr2O3 22 in agreement with the results for pure ZrO2 and pure Cr2O3, respectively.The determined The peak at 384 nm assigned to Cr2O3 was observed for both samples.However, for C-Cr/ZrO2, the peak at 600 nm disappeared, and the intensity of the peak at 384 nm was reduced compared with that of U-Cr/ZrO2, confirming the transformation of Cr species after calcination. XPS analysis of Cr on the photoreduced Cr/ZrO2 was carried out to identify its transformation after calcination and after use.As shown in Fig. 3-a, the co-existence of Cr(0) and Cr(III) in fresh U-Cr/ZrO2 was confirmed because the peaks at 583.50 and 574.20 eV, assigned to Cr(0) 23, and at 586.30 and 576.81 eV, assigned to Cr(III) of Cr2O3 24, were observed simultaneously.This fact confirmed that the photoreduced product of Cr(VI) with ZrO2 was a multivalent Cr mixture.After calcination in air at 650 C, new peaks at 588. Because a change in the Cr valence is a possible factor resulting in the difference in catalytic performance between I-Cr/ZrO2 and C-Cr/ZrO2, TPO and TPR analysis were conducted to investigate the co-existence of different Cr species and possible interconversion between them. As shown in Fig. 5-a, a significant oxidation peak at about 160 C was detected in the TPO curve for U-Cr/ZrO2.This narrow, sharp peak was ascribed to the oxidation of Cr(0) to Cr(III), although the oxidation of metallic Cr occurred at 300 C.This activation of Cr(0) could be ascribed to its high dispersion.In addition, two small and smooth peaks at about 343 and 454 C were detected, which were assigned to the partial oxidization of Cr(III) to Cr(VI) according to the XPS results.This result confirmed the valence change of the Cr species of U-Cr/ZrO2 on calcination and indicates that Cr(III) can produce oxygen vacancies at relatively low temperatures. Subsequently, H2-TPR measurements were conducted on U-Cr/ZrO2, I-Cr/ZrO2, and C-Cr/ZrO2, and the results are shown in Fig. 5-b.For U-Cr/ZrO2, only one reduction peak at about 460 C in the range of 25 to 800 C was detected, which is ascribed to the reduction of Cr(III) to Cr(0) 26.The activation of Cr(III) reaffirmed the high dispersion state of the Cr species because of the significant decrease in the Cr2O3 reduction temperature from 1200 C as a pure substance to 460 C in the composite 27. However, for C-Cr/ZrO2, peaks at 282 and 312 C, assigned to the two forms of Cr(VI), were observed, which is in agreement with the TPO results.A peak at 445 C assigned to the reduction of Cr(III) to Cr(0) was also observed.Thus, the above results reaffirm the co-existence of multivalent Cr species of photoreduced Cr/ZrO2. However, for I-Cr/ZrO2, only a peak at 453 C, assigned to the reduction of Cr(III) to Cr(0), was detected, confirming the existence of pure Cr2O3, which is in agreement with the XPS results.Notably, the reduction temperature of Cr(III) to Cr (0) of C-Cr/ZrO2, 445 C, is lower than those of U-Cr/ZrO2 and I-Cr/ZrO2.This result indicates A c c e p t e d M a n u s c r i p t that the Cr(III) on C-Cr/ZrO2 has a stronger association capability for hydrogen than in the other two catalysts, which indicates a better dehydrogenation ability. The chemisorption state of the reactant CO2 on the surface of ZrO2, Cr2O3, C-Cr/ZrO2, and I-Cr/ZrO2 were determined by CO2-TPD, and the results are shown in Fig. 5-c.The amount of chemically adsorbed CO2 is listed in Table 2. Two strong desorption peaks of pure ZrO2 at 150 C, assigned to the physical adsorption of CO2, and a later desorption at 596 C, which was ascribed to the acidbase interaction of CO2 with the support, were observed.The strong CO2 adsorption of ZrO2 (317.66 moL g -1 ) is disadvantageous for the dissociation of CO bonds. However, for pure Cr2O3, only a weak peak at 412 C was detected.This low CO2 capacity (34.95 moL g -1 ) is also unfavorable for the RWGS, although the low desorption temperature is favorable.This also explains the better RWGS catalytic activity of Cr2O3 than ZrO2. For the Cr-loaded samples, the peaks at 135 C for I-Cr/ZrO2 and at 141 C for C- The CO-TPD analysis of the four samples is shown in Fig. 5-d, and their CO chemical adsorption capacities are shown in Table 2.Only a desorption peak at 570 C for ZrO2 was detected, and the associated capacity is 101.54 moL g -1 .For pure Cr2O3, two extremely strong CO desorption peaks at 500 and 582 C were detected.Although the first CO desorption temperature is relatively low, the adsorption capacity is high (843.10moL g -1 ), and the second desorption will worsen the Cr2O3 catalytic performance.However, after loading on the ZrO2 surface, the CO desorption was weakened significantly.For I-Cr/ZrO2, only a peak at 523 C was detected, corresponding to a CO adsorption capacity of 331.41 moL g -1 .This significant weakening and shift in the CO adsorption peak could be ascribed to the interaction of the Cr2O3 and ZrO2 carrier.For C-Cr/ZrO2, the CO adsorption capacity was significantly reduced to 95.59 moL g -1 without an observable desorption peak.This reduction in CO adsorption means that the CO product can leave the catalyst surface Although the better activity of C-Cr/ZrO2 can be explained by the TPD results, it is necessary to investigate the occurrence of the RWGS with C-Cr/ZrO2 as a catalyst to obtain a deep understanding and further improvement.Thus, Raman analysis of ZrO2, Cr2O3, and C-Cr/ZrO2 was conducted, and the results are shown in Fig. 6-a.For pure ZrO2, peaks at 212, 300, 325, 374, 466, 529, 550, 608, and 628 cm -1 belonging to the monoclinic phase and a peak at 256 cm -1 belonging to the tetragonal phase 28 were observed.For pure Cr2O3, only three low-intensity peaks at 295, 334, and 534 cm -1 were detected. After loading the Cr on ZrO2, the tetragonal ZrO2 was covered by loaded Cr species and the peaks disappeared because of the relatively high photocatalytic activity of ZrO2 as the support.However, the characteristic peaks of Cr2O3 were not observed, but these could be masked by the strong reflections of monoclinic ZrO2.However, the slight shift in the peaks corresponding to monoclinic ZrO2 confirm the interaction between the carrier and active components.New peaks at 862 and 1004 cm -1 , assigned to Cr-O-Cr bonds and the terminal CrO bond of polychromate, and at 1031 cm -1 , assigned to the terminal CrO bond of monochromate 29, were observed.Thus, the presence of Cr(VI) was reaffirmed. In situ Raman analysis of the C-Cr/ZrO2 sample was carried out by heating the sample to 400 C in a nitrogen atmosphere and to 700 C in the presence of a hydrogen Subsequently, the sample was reheated from 36 to 400 C after flushing with N2, followed by refeeding H2 into the system from 400 to 500 C.As shown in Fig. 6-d H2 was then replaced with CO2 at 500 C, and time-dependent in situ Raman analysis was carried out.The results are shown in Fig. 7-a.Then, H2 was reintroduced into the CO2 flux, and peaks corresponding to the hydrides (1335 and 1577 cm -1 ) reappeared, and the peaks corresponding to Cr(VI) disappeared.Thus, it can be deduced that there is an interchange between Cr(IV) and hydrides on alternately feeding H2 or CO2. Then, a new C-Cr/ZrO2 sample was used to carry out the Raman analysis under N2 and CO2 atmospheres from room temperature to 600 C to exclude the possible influence of the hydrogenated catalyst.The results in Fig. 7-b show the emergence of two peaks at 1368 and 1581 cm -1 at room temperature and their disappearance at 500 C. These peaks arise from pure CO2 and could be ascribed to the symmetric and asymmetric vibrations of CO in the formates generated from the adsorbed CO2 30which are similar to the peaks assigned to the metal hydrides.The two new peaks should differ from the peaks ascribed to Cr-H at 1585 cm -1 and Zr-H at 1350 cm - 1 although their shapes are similar and the peaks are close together.However, the two peaks of CO in formates disappeared at temperatures beyond 500 C.This instability made it possible to distinguish the characteristic peaks of hydrides and formates. Then, the RWGS reaction with C-Cr/ZrO2 was carried out at 400 C by switching the feed to a mixture of H2, CO2, and N2.In situ Raman results shown in Fig. 7-c show that the peaks corresponding to polychromate at 849 and 1007 cm -1 disappeared at 400 C with the hydrogen feed, but the peak corresponding to monochromate at 1026 c c e p t e d M a n u s c r i p t A Highly Selective Cr/ZrO2 Catalyst for the Reverse Water-Gas Shift Reaction Prepared from Cr-containing Wastewater by a Photocatalytic Deposition Process with ZrO2 About 90 of the soluble Cr species in the water was eliminated within 60 min.After 240 min, the Cr(VI) in solution was considered to have been entirely eliminated because the residual Cr concentration was 0.0413 mgL -1 , which meets the strictest standards for drinking water (0.05 mgL - 1 , as regulated by WHO).The Cr content on the ZrO2 increased with increasing irradiation time, and the total amount of loaded Cr was in accordance with the amount A c c e p t e d M a n u s c r i p t A Highly Selective Cr/ZrO2 Catalyst for the Reverse Water-Gas Shift Reaction Prepared from Cr-containing Wastewater by a Photocatalytic Deposition Process with ZrO2 10 removed from the water, confirming the successful immobilization of the dissolved Cr species.The photographs in Fig. 1-a (IIV) show the color change of the solution and the ZrO2 powder before and after photoreduction.The solution changes from yellow to colorless and transparent, and the ZrO2 powder changes from white to light green, which visually confirms the removal of Cr(VI) from the solution and the capture of Cr by ZrO2 in the photoreduction process.This result confirmed the success of Cr loading on the ZrO2 surface, suggesting that this is a promising method to treat Cr(VI) Highly Selective Cr/ZrO2 Catalyst for the Reverse Water-Gas Shift Reaction Prepared from Cr-containing Wastewater by a Photocatalytic Deposition Process with ZrO2 p t e d M a n u s c r i p t absorption edge of pure ZrO2 and U-Cr/ZrO2 were both 287 nm, corresponding to a band gap of 4.32eV.However, peaks at 384 and 600 nm were observed for of U-Cr/ZrO2, and these peaks are assigned to Cr2O3 with octahedral symmetry, confirming the existence of Cr2O3 after photoreduction.However, for I-Cr/ZrO2 and C-Cr/ZrO2, the absorption edge shifted to 364 and 375 nm, which might be due to changes in the particle sizes and interactions between Cr species and ZrO2 carriers during calcination. 2 and 578.3 eV, ascribed to Cr(VI) of CrO325, were detected, but those of Cr(0) disappeared while those of Cr(III) remained.About 31.2Cr(VI) was generated on C-Cr/ZrO2 after calcination.However, after use, only Cr(III) was observed.Comparatively, the XPS results of I-Cr/ZrO2 before and after use are shown in Fig. 3-b.Only characteristic peaks of Cr(III) of Cr2O3 were detected in bothA c c e p t e d M a n u s c r i p t samples.This result indicates that the valence transformation of Cr was the key factor for the improvement in the catalytic performance of C-Cr/ZrO2.The SEM results in Figs.4a-4d show the morphology of I-Cr/ZrO2 and C-Cr/ZrO2 before and after use.The aggregation of grains on the surface of the large support particles can be seen.The size of the grains deposited on the C-Cr/ZrO2 was significantly smaller than that on I-Cr/ZrO2 at the same stage.The grain size also increased after use in both I-Cr/ZrO2 and C-Cr/ZrO2.The differences in morphology confirms the different dispersions of the two samples.For further understanding the high dispersion of photoreduced Cr on ZrO2, a Highangle annular darkfield scanning transmission electron microscopy (HAADFSTEM) test of C-Cr/ZrO2 was conducted and shown as Fig.4e-4g.The wide distribution and uniform dispersion of Cr atoms marked in cyan on surface of ZrO2 support can be observed.However, the relatively sparse distribution density of Cr element confirmed its limited amount, which was accordance to the assumption that photoreduced Cr elements immobilized on ZrO2 surface with high dispersion and low toplimit.The XRF results determined was only about 0.35wt, reaffirming the low content of Cr. Cr/ZrO2 are due to the physical adsorption of CO2, but the peaks at 455 and 526 C for I-Cr/ZrO2 and at 471 and 524 C for C-Cr/ZrO2 are due to CO2 chemisorption with a strong adsorption capacity.The shift in the CO2 adsorption peaks of the two samples confirms the interaction between loaded Cr species and the ZrO2 support, excluding the mechanical mixing of pure ZrO2 and Cr2O3.The CO2 chemical adsorption capacity of the composite was significantly enhanced after the immobilization of Cr species on the ZrO2 surface, showing a slightly increased desorption temperature compared to that of A c c e p t e d M a n u s c r i p t pure Cr2O3.The CO2 adsorption capacity of C-Cr/ZrO2 was the highest, suggesting that it has better CO2 catalytic activity.This favorable improvement in the CO2 chemisorption on Cr/ZrO2 is beneficial for the RWGS reaction.Furthermore, a noteworthy fact is that the CO2 adsorption peak area at 471 C ascribed to the Cr2O3 component of C-Cr/ZrO2 is significantly greater than that at 455 C of I-Cr/ZrO2, but the peak at 524 C assigned to the ZrO2 support of C-Cr/ZrO2 is similar to that at 526 C in I-Cr/ZrO2.This result indicates the improved low-temperature CO2 adsorption capacity and activity of C-Cr/ZrO2 compared to I-Cr/ZrO2. immediately after generation, effectively improving the catalytic performance of C-Cr/ZrO2. p t e d M a n u s c r i p t feed, and the results are shown in Fig. 6-b.The three new peaks at 862, 1004, and 1031cm -1 vanished immediately after the introduction of H2, confirming the reduction of Cr(IV) to Cr(III).However, two new peaks at 1350 and 1585 cm -1 appeared at the same time.Their intensity strengthened and position gradually shifted from 1350 to 1318 cm - 1 and 1585 to 1568 cm -1 with increasing time and temperature.These two peaks arising after the introduction of H2 could correspond to Zr-H and Cr-H hydride bonds, respectively.In addition, the corresponding peaks of ZrO2 were enhanced at 400 C.This enhancement after the introduction of hydrogen indicates the interactions betweenZrO2 and the reduced Cr(III) from Cr(VI) by hydrogen.On cooling the sample from 700 to 36 C in the presence of an N2 and H2 mixture, the In situ Raman results shown in Fig.6-c exhibited a consecutive strengthening of the two new peaks corresponding to the Zr-H and Cr-H bonds.This result indicates that the hydrogenation of Zr and Cr increased with increasing reduction time despite the reduction temperature decreasing, which is beneficial for successive CO2 hydrogenation in the RWGS.Another unexpected observation was the reappearance of peaks ascribed to Cr(VI) at 862, 1004, and 1031 cm -1 under a reductive atmosphere at 36 C. the peaks assigned to Cr-H and Zr-H, disappeared, and the peaks corresponding to Cr(VI) at 400 C in N2 increased.This fact confirms the role of hydrogen in forming an intermediate with metal hydrogen bonds.However, the corresponding peaks of metal A c c e p t e d M a n u s c r i p t A Highly Selective Cr/ZrO2 Catalyst for the Reverse Water-Gas Shift Reaction Prepared from Cr-containing Wastewater by a Photocatalytic Deposition Process with ZrO2 20 hydrides reappeared, and the Cr(VI) peaks disappeared again on the reintroduction of H2. photoreduction process were the key species affecting the catalytic performance for the Figure Captions Fig. 2. Characterization of pure ZrO2, pure Cr2O3, I-Cr/ZrO2 C-Cr/ZrO2, U-Cr/ZrO2: a) Fig. 4. SEM of fresh and used of I-Cr/ZrO2 and C-Cr/ZrO2: a) SEM of I-Cr/ZrO2 before Fig. 6.In-Situ Raman Test of C-Cr/ZrO2:a) Raman Test of C-Cr/ZrO2, pure ZrO2 and Fig. 8. Sketch map of mechanism of RWSG at C-Cr/ZrO2. BET results of pure ZrO2, fresh and used C-Cr/ZrO2 and I-Cr/ZrO2 This work was supported by the National Natural Science Foundation of China (No. 21676168 No. 21476146) and the Outstanding Young Scholar Fund of Sichuan University (No. 2015SCU04B06) CO2 strongly, as shown by the CO2 TPD results.Subsequently, the adsorbed H2 and CO2 react with each other and release the products: CO and H2O. These two stages occur simultaneously for the RWGS reaction with C-Cr/ZrO2 as the catalyst.The catalyst induction caused by the Cr(VI) species increases the catalysis by Cr(III) in the main stage.It has also been reported that Cr(VI) interacts with nearby Cr(III) species and the metal oxide support surfaces, consequently forming Cr(VI)-Cr(III) pair sites that promote the redox catalytic activity of chromia 31.This mechanism effectively explains the high catalytic activity of C-Cr/ZrO2 because of the co-existence of Cr2O3, monochromate, and polychromate on the surface.The coexistence of Cr(III) and Cr(VI) species originated from the active Cr species because of the high dispersion when Cr(VI) was reduced and captured during the photoreduction by ZrO2."
  },
  {
    "title": "Conclusions",
    "content": "In this study, a high-performance catalyst for the RWGS reaction, Cr/ZrO2, was obtained by a simple photoreduction process.The Cr(VI) in solution was photoreduced by ZrO2 under UV light irradiation and immobilized to form a Cr/ZrO2 composite.The obtained 1wtCr/ZrO2 composite after calcination can effectively catalyze the RWGS reaction with 100 CO selectivity from 400 to 800 C, reaching the thermodynamic limit at 600 C and 38.34 CO yield.The stability of this 1wtCr/ZrO2 catalyst was excellent, showing no significant performance decay after 72 h continuous operation at 500 C."
  }
]