[
  {
    "title": "Doi",
    "content": "10.1039/x0xx00000x"
  },
  {
    "title": "Article_Title",
    "content": "Please do not adjust margins Please do not adjust margins"
  },
  {
    "title": "Abstract",
    "content": "In this work, we demonstrated the polyvinylpyrrolidone-assisted solvothermal synthesis of three-dimensional (3D) flowerlike Mn0.8Cd0.2Smicrospheres assembled by nanosheets.The as-synthesized products were characterized by using various methods including powder X-ray diffraction, scanning electron microscopy, transmission electron microscopy, high-resolution transmission electron microcopy/selected area electron diffraction, elemental mapping, X-ray photoelectron spectroscopy, inductively-coupled plasma emission spectroscopy, N2 adsorption-desorption, UV-vis diffuse reflectance spectra, photoluminescence spectroscopy and photoelectrochemical experiments.The possible formation mechanism for the unique structures was discussed.The resultant 3D flowerlike Mn0.8Cd0.2Sarchitectures exhibit more excellent photocatalytic activities for H2 evolution and CO2 reduction under visible light irradiation than the Mn0.8Cd0.2Snanoparticles.A hydrogen evolution rate of 3560.3 molg -1 h -1 and a CH3OH production rate of 10.7 molg -1 h -1 are achieved on the flowerlike Mn0.8Cd0.2Smicrospheres.Several possible reasons for enhanced photocatalytic activity of the Mn0.8Cd0.2Shierarchical microspheres have been taken into consideration.In addition, the Mn0.8Cd0.2Smicrospheres are stable during the reaction and can be used repeatedly."
  },
  {
    "title": "Experimental",
    "content": "Manganese acetate tetrahydrate (Mn(CH 3 COO) The flowerlike Mn 0.8 Cd 0.2 S microspheres (MCS-F) were synthesized by a simple solvothermal method.In detail, 0.613 g Mn(CH 3 COO) 2 4H 2 O and 0.167 g Cd(CH 3 COO) 2 2H 2 O were dissolved in 25 mL of DMF solution with 1.0 g PVP.0.230 g TAA was dissolved in another 25 mL DMF.After separately constant stirring for 15 min at room temperature, the PVP solution was added slowly into the TAA solution and stirred further for 60 min.Then the suspension was transferred to a 100 mL Teflonlined autoclave and maintained at 180 C for 24 h.The final products were washed with distilled water and ethanol, and dried at 60 C for 24 h under vacuum. For comparison, the Mn 0.8 Cd 0.2 S nanoparticles (MCS-P) were synthesized by a hydrothermal method according to the literature. The crystal structures of Mn 0.8 Cd 0.2 S were evaluated by X-ray diffraction (XRD, D/MAX-2550, Cu K, 0.15418 nm).The morphologies and microstructures of the prepared sample were analyzed by scanning electron microscope (SEM, JSM-6700F) with an energy-dispersive X-ray (EDS) spectrometer, transmission electron microscopy (TEM, JEOL 200CX), highresolution transmission electron microscopy/selected area electron diffraction (HRTEM/SEAD, JEM-2010F).The high angle annular dark field scanning transmission electron microscopy (HAADF-STEM) and elemental mapping analysis were conducted by using a JEM-ARM 200F scanning transmission electron microscope.The particle size distributions of Mn 0.8 Cd 0.2 S were examined with a Mastersizer 3000 laser diffraction particle size analyzer.The absorbance properties of the samples were obtained on an UV-vis spectrophotometer (Hitachi U-3010) using BaSO 4 as a reference.The compositions of the samples were evaluated by X-ray photoelectron spectroscopy (XPS, PHI ESCA-5000C) and inductively-coupled plasma emission spectroscopy (ICP, PERKINE 7300DV).Photoluminescence (PL) spectra were measured using a Hitachi F-7000 fluorescence spectrophotometer at room temperature.The Brunauer-Emmett-Teller (BET) specific surface areas of the samples were analyzed by nitrogen adsorption using a Micromeritics ASAP 2020 nitrogen adsorption apparatus. The photocatalytic hydrogen evolution experiments were carried out at room temperature in a closed 100 mL quartz photoreactor using a 300 W Xe lamp (PLS-SXE300C, Beijing Perfectlight Co. Ltd., China) coupled with a UV cut-off filter ( 420 nm).In each experiment, 0.05 g of photocatalyst powder was dispersed in 100 mL of aqueous solution containing 0.1 M Na 2 S and 0.1 M Na 2 SO 3 .The reaction vessel was evacuated for 30 min to remove dissolved oxygen before photocatalytic experiments.The reaction cell was kept at room temperature with cooling water.H 2 gas was analyzed by an online gas chromatograph (GC7900, N 2 carrier, 5A molecular sieve column, TCD detector). The photocatalytic CO 2 reduction experiments were conducted in a continuous-flow reactor system equipped with a 300 W Xe lamp combined with a 420 nm cut-off filter as a light source.In each run, 0.1 g of photocatalyst was dispersed in 100 mL aqueous solution containing 0.1 M NaOH.All experiments were carried out at room temperature.Before irradiation, CO 2 (99.995) gas was passed through the solution for at least 30 min until the CO 2 concentration reached saturation.Then the suspension was exposed to visible light irradiation under magnetic stirring.At given time interval, about 1 mL suspensions were collected and centrifuged to remove the photocatalyst particles.The products in the solution were analyzed using a GC7900 gas chromatography equipped with a FID detector and a capillary column (TM-PLOT U, 30 m 0.53 mm 20 m). The apparent quantum efficiency (AQE) for H 2 evolution and CO 2 reduction were also measured under the same photocatalytic reaction conditions, only with a band-pass filter of 420 nm.The average intensity of irradiation was measured as 15.0 mWcm -2 (PL-MW2000 spectro-radiometer) and the irradiation area was controlled at 28.26 cm 2 .The AQE was calculated according to following equation: where R H2 , R CH3OH and I represent the H 2 evolution rate and CH 3 OH evolution rate at 420 nm (molecules h -1 ), and the rate of absorption of incident photons, respectively. Photocurrent measurements were performed on a CHI660E electrochemical workstation (Chenhua Instrument, Shanghai, China) with a standard 3-electrode system.The Ag/AgCl (saturated KCl) and Pt foil were used as the reference electrode and counter electrode, respectively.A 300W Xe arc lamp with a UV-cut off filter ( 420 nm) severed as a light source.A 0.5 M Na 2 SO 4 aqueous solution was used as the electrolyte.The working electrode was prepared as follows: 10 mg of the as-prepared photocatalyst was suspended in 1 mL ethanol to produce a slurry, which was then dip-coated onto a indium tin oxide (ITO) glass electrode.The coated area on the ITO glass was controlled to be 0.283 cm 2 .The film was dried in air and subsequently calcined at 120 C for 6 h.Electrochemical impedance spectroscopy (EIS) measurements were determined at an AC voltage magnitude of 5 mV with the frequency range of 106 to 0.01 Hz with the initial potential (0 V) in 0.01 M Na 2 SO 4 .The morphology and microstructure of the as-prepared Mn 0.8 Cd 0.2 S solid solution were characterized by SEM, TEM, HRTEM and HAADF-STEM, as shown in Fig. 2. The overall SEM image (Fig. 2a) shows that the obtained sample has uniform microspheric morphology with a diameter of 3.0 m.The particle size distribution histogram of Mn 0.8 Cd 0.2 S microspheres is displayed in Fig. S1.Most of the particle size is distributed around 3 m, which is close to the size shown by SEM.The magnified view (Fig. 2b) shows that the individual Mn 0.8 Cd 0.2 S microsphere consists of numerous ultra-thin nanosheets architectures as building blocks.These nanosheets link and tangle with together to form 3D flowerlike structures.Fig. 2c and2d shows the TEM images of the final product.The TEM images are in good agreement with the morphology as presented in the SEM pictures.The well-defined lattice fringes of the Mn 0.8 Cd 0.2 S nanocrystal in the HRTEM image demonstrate its highly crystalline nature (Fig. 2e).The spacing of the lattice fringes is about 0.349 nm, corresponding to the (100) plane of Mn 0.8 Cd 0.2 S. The corresponding SAED pattern of flowerlike Mn 0.8 Cd 0.2 S (Fig. 2e inset) shows a polycrystalline structure.The EDS spectrum (Fig. 2f) of the sample clearly confirms the presence of Mn, Cd and S elements.The molar ratio of Mn: Cd: S is estimated to be 0.78: 0.19: 1 by the results of EDS and ICP, which is close to the stoichiometric ratio of Mn 0.8 Cd 0.2 S. In addition, the HAADF-STEM and elemental mapping images of individual Mn 0.8 Cd 0.2 S microsphere (Fig. 2g-j) and a single bunch of flower (Fig. S2) clearly illustrate the homogeneous distribution of Mn, Cd and S species in the flowerlike sample.For comparison, the conventional Mn 0.8 Cd 0.2 S nanoparticles were also prepared by the hydrothermal method.The XRD pattern and SEM image of MCS-P are shown in Fig. S3."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The surface chemical compositions of the as-obtained flowerlike Mn 0.8 Cd 0.2 S microspheres were analyzed by XPS.The survey spectrum (Fig. 3a) demonstrates that the sample is composed of S, Mn and Cd, which is in good agreement with the EDS results.The main binding energy peaks located at 640.4 eV (Mn 2p 3/2 ), 651.7 eV (Mn 2p 1/2 ), 404.6 eV (Cd 3d 5/2 ), 411.3 eV (Cd 3d 3/2 ), 161.0 eV (S 2p 3/2 ) and 162.2 eV (S 2p 1/2 ) can be observed from the high resolution spectra of the flowerlike Mn 0.8 Cd 0.2 S in Fig. 3b-d, respectively, indicating that the valence states of Mn, Cd and S are 2, 2 and -2, respectively. To reveal the growth process of the flowerlike Mn 0.8 Cd 0.2 S microspheres, time-dependent experiments were carried out and the resulting products collected at different stages were analyzed by SEM and XRD.As shown in Fig. 4a, irregular nanoplates are obtained at an early stage (2 h).After reaction for 8 h, these Mn 0.8 Cd 0.2 S nanoplates begin to oriented aggregate to form multi-layered hierarchical structures (Fig. 4b).With the reaction time extends to 12 h, these nanosheests have been assembled into flowerlike structures (Fig. 4c).Further increasing the reaction time to 18 h, the flowerlike structures become more compact with a larger size of 2.5 m (Fig. 4d).Until the reaction time is 24 h (Fig. 4e), the lamellaes cross-link with each other, and uniform 3D flowerlike microspheres are formed eventually.The corresponding XRD patterns confirm that all the products are hexagonal phase of Mn 0.8 Cd 0.2 S. (Fig. 4f).With the increase of reaction time, the crystallinity of the sample increases gradually. On the basis of the above SEM observation and XRD analysis, the possible formation process of Mn 0.8 Cd 0.2 S hierarchical microspheres can be explained by a self-assembly mechanism (Fig. 5).During the initial stage of synthesis, Mn-PVP and Cd-PVP complexes are formed through coordinative bonding with the carbonyl oxygen of the PVP.It is well-known that a surfactant is crucial for the controlled synthesis of nanostructured materials, 26-30 so the influence of PVP has also been studied.Fig. 6 shows SEM images of the Mn 0.8 Cd 0.2 S products obtained with different amount of PVP (from 0 to 1.5 g).Only irregular nanoparticle aggregates are obtained when there is no PVP used (Fig. 6a), which indicates that PVP is very important for the formation of Mn 0.8 Cd 0.2 S flowerlike hierarchical structures.When 0.5 g of PVP was added, loose flowerlike structures constructed by nanosheets can be obtained (Fig. 6b).When the amount of PVP was increased to 1.0 g, uniform flowerlike microspheres are formed (Fig. 6c).Further increasing the amount of PVP to 1.5 g, however, the flowerlike microspheres are destroyed (Fig. 6d), which implies that excess PVP is unfavorable for the formation of flowerlike microspheres.Fig. S4 gives out the corresponding XRD patterns of the products synthesized with different amount of PVP.The XRD patterns clearly reveal that all diffraction peaks match well with the pure phase of Mn 0.8 Cd 0.2 S, and no obvious peaks resulting from impurities are observed.However, the corresponding intensities of diffraction peaks of the products are dissimilar in some cases. As the amount of PVP increased, the major diffraction peaks of Mn 0.8 Cd 0.2 S become narrow and sharp.This dissimilarity may be attributed to the difference in their microstructures.31,32 In our experiments, PVP may play three main roles in the formation of Mn 0.8 Cd 0.2 S flowerlike microspheres. 26-30One is to prevent the aggregation of Mn 0.8 Cd 0.2 S nanoparticles during the initial growth stage of Mn 0.8 Cd 0.2 S nanosheets.The other is selective adsorption on some certain facets of Mn 0.8 Cd 0.2 S crystals and the kinetic control of growth rates of these facets. And another is to promote the self-assembly of Mn 0.8 Cd 0.2 S nanosheets to flowerlike hierarchical structures. The N 2 adsorption-desorption measurement was carried out to study the specific surface area and porosity of the asprepared samples and the results are shown in Fig. 7 and Table 1.The Mn 0.8 Cd 0.2 S microspheres and Mn 0.8 Cd 0.2 S nanoparticles exhibit type IV isotherms with a H3 hysteresis loop, confirming the presence of mesoporous structure.33,34 The pore-size distributions of the samples are estimated using the Barrett-Joyner-Halenda (BJH) method from the desorption branches, as shown in the inset of Fig. 7.The pore size distribution of flowerlike Mn 0.8 Cd 0.2 S reveals a major pore at 3.7 nm.Brunauer-Emmett-Teller (BET) analysis reveals that the flowerlike Mn 0.8 Cd 0.2 S possesses a high specific surface area of 225.6 m 2 g -1 greatly larger than Mn 0.8 Cd 0.2 S nanoparticles (23.9 m 2 g -1 ).The enhanced specific surface area of the flowerlike Mn 0.8 Cd 0.2 S can offer more active sites, which will be beneficial to the photocatalytic performance. Please do not adjust margins Please do not adjust margins The absorbance properties of the as-prepared flowerlike Mn 0.8 Cd 0.2 S microspheres and Mn 0.8 Cd 0.2 S nanoparticles were measured by UV-vis diffuse reflectance spectroscopy.It can be seen from the Fig. 8a that the light absorption edge of Mn 0.8 Cd 0.2 S nanoparticales is about 566 nm, and the light absorption edge of the flowerlike Mn 0.8 Cd 0.2 S sample is obviously red shift.This red shift might suggest that the Mn 0.8 Cd 0.2 S microspheres can absorb more visible light, which may result in generation of more electronhole pairs.The bandgap width of the samples can be calculated by the following equations: ( ) where , h, , E g and A represent the absorption coefficient, planck constant, optical frequency, band gap and constant, respectively.The value of n is related to the property of the semiconductor (n 1 for direct transition and n 4 for indirect transition).For Mn 0.8 Cd 0.2 S, the value of n is 1 for the direct transition.14,15,21 Therefore, as can be seen from Fig. 8b, the corresponding band gap values of the flowerlike Mn 0.8 Cd 0.2 S microspheres and Mn 0.8 Cd 0.2 S nanoparticles are found to be 2.29 and 2.36 eV, respectively.Compared with the Mn 0.8 Cd 0.2 S nanoparticles, the band gap of the flowerlike Mn 0.8 Cd 0.2 S sample is obviously reduced. The photocatalytic hydrogen evolution activities over the asprepared samples were evaluated under visible light irradiation using Na 2 S and Na 2 SO 3 as sacrificial agents to consume the photoinduced holes.As seen from Fig. 9, the MCS-P sample shows a modest photocatalytic H 2 -production rate of 1318.5 molg -1 h -1 .Notably, the flowerlike Mn 0.8 Cd 0.2 S (MCS-F) sample exhibits a high H 2 evolution rate of 3560.3 molg -1 h -1 and the corresponding apparent quantum efficiency is 3.9 at 420 nm.The H 2 -production rate of MCS-F is about 2.70 times higher than that of MCS-P.The photocatalytic activities of the Mn 0.8 Cd 0.2 S nanoparticles and flowerlike Mn 0.8 Cd 0.2 S microspheres were also evaluated by using them for the photoreduction of CO 2 dissolved in NaOH solutions under visible-light irradiation (Fig. 10).Only methanol is detected as a product using Mn 0.8 Cd 0.2 S as photocatalysts.It can be observed that the Mn 0.8 Cd 0.2 S nanoparticles shows a low photocatalytic activity for CO 2 reduction, in which the CH 3 OH production rate is only 3.31 molg - (with an apparent quantum efficiency of 0.036 at 420 nm) during vsible-light irradiation, which is about 3.20 times higher than that of the Mn 0.8 Cd 0.2 S nanoparticles.Considering NaOH as NaHCO 3 precursor, we also tested the CO 2 photoreduction in CO 2 -saturated NaHCO 3 aqueous solution (0.1 M) as a comparison.The results are illustrated in Fig. S5.As expected, no obvious difference in CH 3 OH production is observed when NaHCO 3 was used as a solution media directly. The stability of photocatalyst is another important issue for its practical application.The recycling experiment was undertaken to check the stability and catalytic activity of the flowerlike Mn 0.8 Cd 0.2 S sample.In this work, flowerlike Mn 0.8 Cd 0.2 S sample was recycled six times for the same photocatalytic reactions.After irradiation in each cycle, the photocatalyst was separated from the aqueous suspension by filtration, washed with deionized water and ethanol, and dried.As show in Fig. 11, both the H 2 evolution rate and the activity of photocatalytic CO 2 reduction do not show a significant decrease.The flowerlike Mn 0.8 Cd 0.2 S samples after six consecutive cycles were further certified by XRD, XPS and HAADF-STEM analyses (Fig. S6 andS7).No apparent change in the crystalline structure is observed before and after the reaction.The XPS analysis shows that the binding energies of Mn 2p, Cd 3d and S 2p of the used Mn 0.8 Cd 0.2 S are nearly the same as those of the fresh Mn 0.8 Cd 0.2 S, implying the valence states of Mn, Cd and S elements have no change.Moreover, the HAADF-STEM analyses demonstrate that the distribution of Mn, Cd and S in the used sample is still very uniform.These observations clearly indicate that the flowerlike Mn 0.8 Cd 0.2 S has good photocatalytic stability, reusability and antiphotocorrosion capability during the photocatalytic reaction under visible light.It is well known that the photocatalytic activity of a photocatalyst is related to many factors.In order to clarify the factors of the enhancement of photocatalytic activity of the flowerlike Mn 0.8 Cd 0.2 S architectures, PL spectroscopy measurements to analyze the charge recombination of semiconductor were investigated.Fig. 12a shows the PL emission spectra of MCS-F and MCS-P excited at 335 nm.As can be seen from Fig. 12a, the MCS-P sample has a strong fluorescence peak at 468 nm.The fluorescence intensity of the flowerlike Mn 0.8 Cd 0.2 S is much lower than that of Mn 0.8 Cd 0.2 S nanoparticles, indicating that the flowerlike Mn 0.8 Cd 0.2 S has a lower recombination rate of electrons and holes under visiblelight irradiation.The interface charge separation efficiency the as-synthesized photocatalysts can be further investigated by the photoelectrochemical technique.Fig. 12b shows that the photocurrent intensity of Mn 0.8 Cd 0.2 S nanoparticles is low due to its rapid recombination of photogenerated charge.35,36 The MCS-F sample shows higher photocurrent intensity than MCS-P, indicating that the flowerlike Mn 0.8 Cd 0.2 S has higher charge transfer and separation ability.Fig. 12c displays the electrochemical impedance spectroscopy (EIS) Nyquist plots of the two samples.The diameter of the Nyquist semicircle for the flowerlike Mn 0.8 Cd 0.2 S is smaller than that of Mn 0.8 Cd 0.2 S nanoparticles, which indicates that the flowerlike Mn 0.8 Cd 0.2 S has a lower resistance than that of nanoparticles.Based on the above results, several factors have been addressed to explore the remarkable photocatalytic performance of the flowerlike Mn 0.8 Cd 0.2 S microspheres.Firstly, the 3D flowerlike Mn 0.8 Cd 0.2 S microspheres have larger specific surface areas than that of the randomly aggregated Mn 0.8 Cd 0.2 S nanoparticles, which can offer more active sites and absorb more active species and reactants on their surfaces. 19, 39 Secondly, the unique hierarchical microstructure of Mn 0.8 Cd 0.2 S microspheres, which consist of numerous interlaced nanosheets, is more favorable for spatial transfer of the photoexcited carriers conduce to higher separation efficiency of the photoinduced charge carriers.Lastly, there are multiple reflecting and scattering effects within the interior layer structures of 3D Mn 0.8 Cd 0.2 S microspheres which results in even greater light-harvesting capacities.19,40,41 On the basis of the above analysis, it can be assumed that the enhanced photocatalytic activities of Mn 0.8 Cd 0.2 S microspheres can be due to synergistic effects, including the higher BET surface area, faster inter facial charge transfer rate and increased light-harvesting capacities. Fig. 1 shows the XRD pattern of the flowerlike Mn 0.8 Cd 0.2 S sample, together with the standard diffraction patterns of hexagonal wurtzite MnS (JCPDS Card No. 40-1289) and CdS (JCPDS Card No. 65-3414).The diffraction peak of the Mn 0.8 Cd 0.2 S sample exhibit an obvious left-shift compared to the standard hexagonal MnS due to the formation of Mn 0.8 Cd 0.2 S solid solution.14, 21 No impurity peaks are observed, indicating a high purity of the product. Fig. 1 XRD pattern of the flowerlike Mn 0.8 Cd 0.2 S sample. Fig. 2 (a, b) SEM images, (c, d) TEM images, (e) HRTEM image and SAED pattern (inset), (f) EDS spectrum , (g) HAADF-STEM image and (h-j) elemental mapping images of the flowerlike Mn 0.8 Cd 0.2 S. Fig. 3 XPS spectra of the flowerlike Mn 0.8 Cd 0.2 S sample: (a) survey spectrum, (b) Mn 2p, (c) Cd 3d, (d) S 2p. Fig. 4 SEM images of the obtained products after reaction for (a) 2 h, (b) 8 h, (c) 12 h, (d) 18 h and (e) 24 h, (f) XRD patterns of products synthesized with different reaction time. Fig. 5 Schematic illustration of the proposed formation mechanism of Mn 0.8 Cd 0.2 S microspheres. Fig. 6 SEM images of the Mn 0.8 Cd 0.2 S products synthesized with different amount of PVP: (a) 0 g, (b) 0.5 g, (c) 1.0 g, (d) 1.5 g Fig. 7 N 2 adsorption-desorption isotherms of (a) MCS-P and (b) MCS-F; Inset: the corresponding pore size distribution. Fig. 8 (a) UV-Vis diffuse reflectance spectra and (b) band gap energies of the as-prepared samples. Fig. 9 (a) Plots of photocatalytic H 2 evolution amount vs. irradiation time and (b) comparison of H 2 evolution rate for assynthesized samples. Fig. 10 (a) Plots of photocatalytic CO 2 reduction amount vs. irradiation time and (b) comparison of CH 3 OH production rate for assynthesized samples. Fig. 11 Cycle runs of (a) photocatalytic H 2 production and (b) CO 2 reduction over the flowerlike Mn 0.8 Cd 0.2 S. Fig. 12 (a) PL spectra, (b) transient photocurrent response and (c) electrochemical impedance spectroscopy of MCS-F and MCS-P. 2 Na 2 S9H 2 O) and sodium sulfite (Na 2 SO 3 ) were obtained from Aladdin Reagent Co., Ltd.All chemicals used in the experiments were of analytical grade and were used without further purification. Summary of textural properties and photocatalytic activities of the as-prepared samples. Published on 26 July 2017.Downloaded by University of Windsor on 26/07/2017 06:59:00.View Article Online DOI: 10.1039/C7CY01102D The authors gratefully acknowledge the National Natural Science Foundation of China (11472164) and Innovative Research Team (IRT13078) for financial support.The authors also thank Lab for Microstructure, Instrumental Analysis and Research Center, Shanghai University, for materials characterizations. This journal is The Royal Society of Chemistry 20xx J. Name., 2013, 00, 1-3 10 Please do not adjust margins Please do not adjust margins"
  },
  {
    "title": "Conclusions",
    "content": "In summary, 3D flowerlike Mn 0."
  }
]