[
  {
    "title": "Doi",
    "content": "Doi not found"
  },
  {
    "title": "Article_Title",
    "content": "INFLUENCE OF OPERATIONAL PARAMETERS ON THE PHOTOCATALYTIC ACTIVITY OF POWDERED TiO 2 FOR THE REDUCTION OF CO 2"
  },
  {
    "title": "Abstract",
    "content": "In this report, the results from a study on the influence of operational parameters on TiO 2 photocatalytic activity for CO 2 reduction under an ultraviolet-visible (UV-vis) illumination are presented.The results indicated that the TiO 2 was found to be active for CO 2 reduction with CH 3 OH as the major products, while other minor products (CO, CH 4 , and C 2 H 4 ) were also detected.In addition, the formation of such reduction products was obviously influenced by the operational parameters.Under this study, the optimum operational parameters for CO 2 reduction at 298 K were determined to be: NaOH concentration 0.2 M, TiO 2 dosage 2 g/L, volume of the reaction media 75 mL, the pressure of system 800 kPa.It was also found that the increase in UV-vis illumination time have increased the yield of product formation.A possible reaction pathway for the formation of the reduction products is also discussed."
  },
  {
    "title": "Experimental",
    "content": "The TiO 2 used in this study was taken from the same batch with the TiO 2 used in our previous study 17, and its physicochemical characteristic is provided in Table 1.Double distillate water produced from a NanoPure purification system (Millipore Corp., 17.5 Mcm) was used throughout the experiments.All other chemicals along with their use were outlined elsewhere in this report. The XRD analysis was conducted on a Rigaku X-ray diffractometer operated at 40 kV and 30 mA with Cu (k 1.5406A) irradiation.The Band gap energy was determined by Kubelka-Munk plot method 18, using the DR-UV-Vis data taken on a Shimadzu UV2450 spectrophotometer.The specific surface area (S BET ) data were calculated from a multipoint BET analysis of the nitrogen adsorption isotherm at -169 C using a Micromeritics ASAP 2010 surface area analyzer.The transmission electron microscopic (TEM) images were recorded on aTecnai G2 F20 TEM operated at 200 kV.The oxidation state of Titanium was examined using a Thermo VG Scientific-Sigma Probe X-ray photoelectron spectroscopy (XPS) with mono-chromated Al K radiation and operating pressure in the sampling chamber was below 5 10 Torr.The reduction product carbon monoxide (CO) in gas phase was identified using an Agilent 7890A gas chromatographythermal conductivity detector (GC-TCD) with a molecular sieve 5A column, while both methane (CH 4 ) and ethylene (C 2 H 4 ) were identified using GC-flame ionization detector (GC-FID) with an activated-alumina column.The methanol (CH 3 OH) as the product in liquid phase was determined using a Hewlett-Packard (HP) GC-FID 1530A with an HP5-MS column. The batch stainless steel type reactor (Fig. 1) was employed to conduct the photocatalytic reaction.Typically, a fresh of TiO 2 was transferred into the reactor.Prior to UV-Vis illumination with 100 W Hg lamp, ultra high purity of CO 2 99.999 was bubbled with constant flow (160 mL/min) for 60 min passing through the reaction media to obtained CO 2 -saturated and air-free suspension.After bubbling, the reactor was immediately closed and photocatalytic reaction was then started by switching on the UV-vis lamp.Blank tests were also carried to ensure that a photocatalytic reduction of CO 2 is only occurred in the presence of light illumination, but not took place in the dark with TiO 2 photocatalyst or under light illumination without TiO 2 . The reduction products both in the liquid and gas phase were taken regularly at a series of time interval.The gaseous samples were collected using a gas-tight syringe (Hamilton, Nevada-U.S.A).The concentration of carbon monoxide (CO) in gaseous phase was analyzed using a GC-TCD instrument.Methane (CH 4 ) and ethylene (C 2 H 4 ) concentrations were measured on GC-FID instrument.The GC instrument was calibrated before each analysis run using certified reference material (CRM) for gas mixture (CO, CH 4 and C 2 H 4 ) with maximum 0.1 uncertainty level.The concentration of CH 3 OH in liquid phase was measured using A GIC-FID instrument.The peak area of corresponding sample was used to estimate the CH 3 OH content in liquid sample by converting the peak area to its concentration using a calibration curve.The calibration curve was obtained by plotting the peak area Determined by BET surface area method 17 b Investigated by XRD and compared to the JCPDS Card No. 21-1272 17 c Determined by XRD Scherrer's method 17 d Determined by Kubelka-Munk plotting method 17 e Investigated using XPS 17 Physicochemical characteristic of the TiO 2 is listed in Table 1.In addition, Fig. 3 shows typical morphology of the TiO 2 .It can be observed from the bright field image (Fig. 3a) that the particles were presence in round shaped with the average diameter of every single crystal is of about 20 nm.No shuttle-like morphology for rutile phase can be observed which indicates that the TiO 2 exists in anatase phase 19.A selected area-electron diffraction (SAED) pattern of the TiO 2 (Fig. 3b) shows distinct concentric rings instead of sharp spots, ascribing small in size of the TiO 2 crystals 20.In addition, Fig. 3c shows high resolution TEM of the TiO 2 , where its lattice fringes images (Fig. 3d) indicates the TiO 2 is in good crystalline nature 21. The performance of the TiO 2 was evaluated for its activity for the reduction of CO 2 .In the preliminary experiment, it was found that the reduction products involved gas phase of CO and CH 4 , C 2 H 4 , and liquid For the photocatalytic reduction of CO 2 with H 2 O over TiO 2 -based materials, the reduction pathway generally includes the following steps, i.e., the adsorption of reactants on the catalyst, activation of the adsorbed reactants by the photo-generated charge carriers, formation of surface intermediates, and conversion of intermediates to products 22.According to these common steps, many researchers 23242526 have proposed various reaction schemes for the photocatalytic reduction of CO 2 by H 2 O over TiO 2based photocatalyst. Taking into account the identified product species under this study and other related literatures 23242526, the possible reaction pathway for the formation of CO, CH 4 , C 2 H 4 , and CH 3 OH during the photocatalytic CO 2 reduction with H 2 O over pure-TiO 2 is suggest (Eqs.123456789101112131415.When a photon in the form of light having energy equal or higher than the band gap energy of the TiO 2 semiconductor, the electrons jump to the conduction band (CB) leaving a positively charged hole in the valence band (VB) (Eq.1).After the creation and excitation of the electron-hole, part of the excited electrons and holes recombined together and radiated out heat during the process (Eq.2), this is a main limiting factor for the low efficiency of CO 2 conversion 22.While other non-recombined photo-generated electrons-holes would take part in other reactions.A reaction between holes and H 2 O adsorbed on the TiO 2 surface produces HO 131415.The CH 4 was confirmed to be produced via reaction between CH 3 and H according to Eq. 13.The C 2 H 4 may be produced by the reaction between CH 3 and CH according to Eq. 14.The CH 3 OH was yielded by the reaction between CH 3 and OH (Eq.15).The reaction scheme for the formation of CO, CH 4 , C 2 H 4 and CH 3 OH using pure TiO 2 is elaborated further in Fig. 5. Similar reaction pathway through the formation of surficial carbon (C) and methyl radical (CH 3 has been proposed earlier by Anpo et al. 23 and Koci et al. 24 for a photocatalytic reduction on a solid-liquid reaction system involving dissolved CO 2 in aqueous solution. In this study, sodium hydroxide (NaOH) aqueous solution was chosen as a liquid medium for the photocatalytic activity testing because the NaOH demonstrated a significant contribution on the photocatalytic process by increasing the yield of reduction products 12,24.It has been reported that the OH ions in aqueous solution, which is provided by NaOH, could act either as strong hole scavenger which can inhibit the recombination of electron-hole pairs.The longer decay time of electron-hole pairs would facilitate the more effective of the photocatalytic process 28.And also, the OH ions can form OH radicals (OH).The involvement of OH in the photocatalytic process is explained in next section.Moreover, the NaOH could increase the solubility of CO 2 in aqueous solution 4, which contribute to increase the availability of the CO 2 as reactant in the solution.To investigate the influence of NaOH concentration on the photocatalytic reduction of CO 2 , the NaOH concentration was varied from 0 to 0.4 M, while other experimental parameters were kept the same.From the results obtained, it was found that reduction products including CO, CH 4 and C 2 H 4 in gas phase and CH 3 OH in liquid product were obviously detected.Fig. 6 presents dependence of product yields on the NaOH concentration.As can be seen in Fig. 6, the yield of photo reduction products increased with the increased of NaOH concentration up to 0.2 M and decreased after the NaOH concentration higher than 0.2 M.This might be due to the number of hole scavenger (OH -) formation under 0.2 M NaOH are optimum for a contribution to the inhibition of the electron-hole recombination.On the other hand, increasing the concentration of NaOH above 0.2 M demonstrates a detrimental effect because excess OH radical (OH) formed may oxidize the species in the reactor. It has been well known that photocatalytic reactions take place on TiO 2 surface active site, where the dosage of TiO 2 play a key role in the photocatalytic process.Thus, the dosage is a crucial point, which needs to be optimized.The study on the influence of photocatalyst dosage on the reduction of CO 2 was conducted ranging from 0 to 4 g/L, and the result is shown in Fig. 7.As can be seen, the yields of products were found to increase with increasing the dosage of the TiO 2 and achieved its optimum level at 2 g/L and then decrease when TiO 2 dosage exceeds 2 g/L.This The influence of CO 2 pressure on the yield of photocatalytic products may be attributed to the fact that high TiO 2 dosage can scatter the light due to opacity of the suspension, which prevents the light to reach every particle of the photocatalyst 3,12,24.In addition, the high TiO 2 dosage may also become a favorable condition for surface agglomeration and diminishing the surface active sites, which further declined the rate of product formation 29. In a photocatalytic process, the volume of the reaction media is an important key and it has to be optimized to obtain an appropriate volume of the reaction media for an optimum photocatalytic process because the volume can influence the effectiveness of the UV-vis light energy supply.When the energy light is not sufficiently provided, the process of the electron excitation on the TiO 2 surface may not occurred at optimum condition.When the energy light is over supplied, it will be wasted in the form of heat.One way to be done to avoid such insufficient or over supplied of the energy light during the photocatalytic process is by optimizing the volume of the reaction media because the reaction media could be used to maintenance the supply of the energy light at an adequate level.In the present study, the dependency of the product yield on volume of the reaction media (NaOH suspension) was evaluated and the result is shown in Fig. 8.As can be seen in Fig. 8, the volume of the reaction media has obviously influenced the yield of reduction products.The yields of product increase with increasing the volume of the reaction media and achieving its optimum level at 75 mL.The yield of products decreased when the volume of the reaction media was larger than 75 mL.In the present experimental study, when the volume of the reaction media is small ( 75 mL of NaOH), the UV-vis light energy is over supplied and wasted as heat, which is presumably the reason for the lower product yield.While at a large volume ( 75 mL of NaOH), insufficient mixing is suggested for the reason of the decrease in the product yield, where the TiO 2 particles cannot be maintained in uplift and the TiO 2 particles tend to fall down and located at the bottom part of the reactor, resulting in non uniform of the particle distribution 30.The nonuniformity in particle distribution at a large of volume of the reaction media since the particle might be agglomerated which reduce the number of active site at the TiO 2 surface active, thus decrease the TiO 2 activity.In addition, the higher volume of NaOH used (100 mL for example), it corresponds to a situation where the quartz glass window for light transmission from the light source to the TiO 2 particles is covered by the suspension.Under this condition, the light cannot be well-transmitted to entire suspension in the reactor so that hinder the light to reach every particle of the photocatalyst. The concentration of CO 2 in water at ambient pressure is very small because of its low solubility property.One can be done to increase the solubility of the CO 2 in water is by elevating its pressure in a gaswater interface 3132.To investigate the influence of CO 2 pressure on the photocatalytic reduction of CO 2 , the pressure was varied from 100 kPa to 1000 kPa and the results are presented in Fig. 9.As can be seen from Fig. 9, a small decreased in the yield of reduction product was observed with increasing the pressure up to 400 kPa, although the reason for this is not completely clear.Moreover, the yield of reduction product has significanlty increased with increasing the pressure up to 800 kPa.The accumulation of reduction product at 800 kPa was found to be 5.89, 0.52, 0.02, and 0.011 mol/g cat., for CH 3 OH, CO, CH 4 and C 2 H 4 , respectively.The yield increase of those reduction products was probably due to the following two reasons: Firstly, elevating the CO 2 pressure consequently increased the solubility of CO 2 in the reaction media and thus increase the number of TiO 2 surface-contacted CO 2 molecules which further converts to important incipient CO 2 radicals (CO 2 ) for the product formation.The possible involvement of the CO 2 during the photocatalytic reaction is schematically illustrated in Fig. 5. Secondly, in the present study, the photocatalytic was conducted in alkaline solution (NaOH).At concentration optimum (0.2M) of NaOH used, the estimated pH value 12.Saturating the solution with CO 2 brought the pH of the solution to value of about 7-9.Based on the carbonate equilibrium system 25, the carbonate species in the reaction system was dominated by bicarbonate ion (HCO 3 -).The presence of this HCO 3 in the OH --CO 2 saturated system may accelerate the photocatalytic reduction process 28.Moreover, the yield of products gradually decreased by increasing the CO 2 pressure over 800 kPa.Tseng et al. 12 and Mizuno et al. 32 suggested that conversion of lower hydrocarbon to higher molecular weight under high pressure condition could probably be the reason for decreasing the yield of the reduction product.However, the higher molecular weight than all indentified products could not be detected under instrument conditions of the present study. In a TiO 2 photocatalytic process at under ambient temperature, photon radiation is the primary source of energy for the formation of electron-hole pair because the band gap energy of TiO 2 is relatively high for thermal excitation to overcome 33.On the other hands, thermal energy supply in the form of temperature heat to increase the rate of photo reaction is required because the thermal energy could induce the collision frequency of molecule in solution 34.Fig. 10 presents a temperature dependence of the reduction products.As can be seen in Fig. 10, the product yield was a little increased with small variation of the reaction temperature (from 303 K to 313 K).Fox and Dulay 35 reported that the majority of the photocatalytic reaction is not sensitive to small temperature variations.However, further significant increase of the yield of product can be observed at large temperature variations (from 313 to 338 K).For example, the yield of CH 3 OH increased significantly by increasing the temperature up to 338 K and then decreased.In case of C 2 H 4 , no significant change was found for the yield during the course of reaction.Moreover, the yield of CO decreased while CH 4 increased when the temperature increase above 338 K.Kohno, et al. 36 reported that a drastic decrease in the CO formation followed by increasing the yield of CH 4 occurred at temperature reaction above 523 K.They assumed that the increase of the yield CH 4 might be due to the photocatalyst used was present at the reduced state at higher temperature condition, leading to shift the product selectivity from CO to CH 4 .A similar phenomenon was observed in the present study, where the yield of CH 4 was found to increase while the yield of CO decreased at higher temperature process.Thus, we suggested that the reaction temperature has shifted the product selectivity in a similar manner. The study on the influence of illumination time on the product formation was conducted for a period of 0-17.5 h, and the result is presented in Fig. 11.From Fig. 11, it can be seen that the yield of CH 3 OH increased rapidly with illumination time at first 10 h, because more photo-electron are generated with increasing the illumination time 28.Small increase in the yield of the CH 3 OH was observed after 10 h illumination.The change in the rate of product formation after certain period of illumination can be attributed to increasing the chance for photocatalyst particles to aggregate, lesser strength of the surface adsorption power of photocatalysts and increasing in the number of active sites occupied by intermediate products, which are supposed to be a constructive condition for weakening the photocatalytic performance 3.In addition, a small increased of the yield of CO, CH 4 and C 2 H 4 can only be observed along with illumination time. In summary, it was found that the CO 2 could be reduced through photocatalytic reaction over TiO 2 under UV-vis illumination.The reduction products including CH 3 OH, CO, CH 4 , and C 2 H 4 were detected.The operational parameters employed have remarkably influenced the rate of product formation, implying that optimization of reaction condition is important.Optimization of the operational parameters would offer an efficient of the photocatalytic process. Fig 1.Schematic of experimental setup for CO 2 photocatalytic reduction Fig 3. Typical morphology images of TiO 2 : (a) brightfield-TEM, (b) Selected area electron diffraction (SAED), (c) high resolution TEM, and (d) enlarged lattice fringes Fig 4. The typical chromatogram of the standard and detected products: (a) CO, (b) CH 4 and C 2 H 4 , and (c) CH 3 OH electron leads to the formation of hydrogen radicals (H) (Eq.4), while reaction between OH and holes produced hydroxyl radical (OH)27 (Eq.5).At the same time, the excited electrons (e -) were transferred from the CB of TiO 2 for the reduction of CO 2 Fig 5.A reaction pathway for the product formation on TiO2 surface during the photocatalytic CO 2 reduction Fig 7. The influence of photocatalyst dosage on the yield of photocatalytic products Fig 10.The influence of temperature on the yield of photocatalytic products This study was founded by the Korea Research Council of Fundamental Science and Technology (KRCF) through the National Agenda Project 'Development of measurement technology solving climate change for J.S.K.The co-support from DGHE Republic of Indonesia through \"International Research Collaboration and Scientific Publication\" scheme for J.G. is also acknowledged.The author's thanks goes also to all people in the Gas Analysis Laboratory at the KRISS, who have delivered valuable insight and help with all types of technical problems throughout this study."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Physicochemical characteristic of the TiO 2 is listed in Table 1.In addition, Fig. 3 shows typical morphology of the TiO 2 .It can be observed from the bright field image (Fig. 3a) that the particles were presence in round shaped with the average diameter of every single crystal is of about 20 nm.No shuttle-like morphology for rutile phase can be observed which indicates that the TiO 2 exists in anatase phase 19.A selected area-electron diffraction (SAED) pattern of the TiO 2 (Fig. 3b) shows distinct concentric rings instead of sharp spots, ascribing small in size of the TiO 2 crystals 20.In addition, Fig. 3c shows high resolution TEM of the TiO 2 , where its lattice fringes images (Fig. 3d) indicates the TiO 2 is in good crystalline nature 21. The performance of the TiO 2 was evaluated for its activity for the reduction of CO 2 .In the preliminary experiment, it was found that the reduction products involved gas phase of CO and CH 4 , C 2 H 4 , and liquid For the photocatalytic reduction of CO 2 with H 2 O over TiO 2 -based materials, the reduction pathway generally includes the following steps, i.e., the adsorption of reactants on the catalyst, activation of the adsorbed reactants by the photo-generated charge carriers, formation of surface intermediates, and conversion of intermediates to products 22.According to these common steps, many researchers 23242526 have proposed various reaction schemes for the photocatalytic reduction of CO 2 by H 2 O over TiO 2based photocatalyst. Taking into account the identified product species under this study and other related literatures 23242526, the possible reaction pathway for the formation of CO, CH 4 , C 2 H 4 , and CH 3 OH during the photocatalytic CO 2 reduction with H 2 O over pure-TiO 2 is suggest (Eqs.123456789101112131415.When a photon in the form of light having energy equal or higher than the band gap energy of the TiO 2 semiconductor, the electrons jump to the conduction band (CB) leaving a positively charged hole in the valence band (VB) (Eq.1).After the creation and excitation of the electron-hole, part of the excited electrons and holes recombined together and radiated out heat during the process (Eq.2), this is a main limiting factor for the low efficiency of CO 2 conversion 22.While other non-recombined photo-generated electrons-holes would take part in other reactions.A reaction between holes and H 2 O adsorbed on the TiO 2 surface produces HO 131415.The CH 4 was confirmed to be produced via reaction between CH 3 and H according to Eq. 13.The C 2 H 4 may be produced by the reaction between CH 3 and CH according to Eq. 14.The CH 3 OH was yielded by the reaction between CH 3 and OH (Eq.15).The reaction scheme for the formation of CO, CH 4 , C 2 H 4 and CH 3 OH using pure TiO 2 is elaborated further in Fig. 5. Similar reaction pathway through the formation of surficial carbon (C) and methyl radical (CH 3 has been proposed earlier by Anpo et al. 23 and Koci et al. 24 for a photocatalytic reduction on a solid-liquid reaction system involving dissolved CO 2 in aqueous solution. In this study, sodium hydroxide (NaOH) aqueous solution was chosen as a liquid medium for the photocatalytic activity testing because the NaOH demonstrated a significant contribution on the photocatalytic process by increasing the yield of reduction products 12,24.It has been reported that the OH ions in aqueous solution, which is provided by NaOH, could act either as strong hole scavenger which can inhibit the recombination of electron-hole pairs.The longer decay time of electron-hole pairs would facilitate the more effective of the photocatalytic process 28.And also, the OH ions can form OH radicals (OH).The involvement of OH in the photocatalytic process is explained in next section.Moreover, the NaOH could increase the solubility of CO 2 in aqueous solution 4, which contribute to increase the availability of the CO 2 as reactant in the solution.To investigate the influence of NaOH concentration on the photocatalytic reduction of CO 2 , the NaOH concentration was varied from 0 to 0.4 M, while other experimental parameters were kept the same.From the results obtained, it was found that reduction products including CO, CH 4 and C 2 H 4 in gas phase and CH 3 OH in liquid product were obviously detected.Fig. 6 presents dependence of product yields on the NaOH concentration.As can be seen in Fig. 6, the yield of photo reduction products increased with the increased of NaOH concentration up to 0.2 M and decreased after the NaOH concentration higher than 0.2 M.This might be due to the number of hole scavenger (OH -) formation under 0.2 M NaOH are optimum for a contribution to the inhibition of the electron-hole recombination.On the other hand, increasing the concentration of NaOH above 0.2 M demonstrates a detrimental effect because excess OH radical (OH) formed may oxidize the species in the reactor. It has been well known that photocatalytic reactions take place on TiO 2 surface active site, where the dosage of TiO 2 play a key role in the photocatalytic process.Thus, the dosage is a crucial point, which needs to be optimized.The study on the influence of photocatalyst dosage on the reduction of CO 2 was conducted ranging from 0 to 4 g/L, and the result is shown in Fig. 7.As can be seen, the yields of products were found to increase with increasing the dosage of the TiO 2 and achieved its optimum level at 2 g/L and then decrease when TiO 2 dosage exceeds 2 g/L.This The influence of CO 2 pressure on the yield of photocatalytic products may be attributed to the fact that high TiO 2 dosage can scatter the light due to opacity of the suspension, which prevents the light to reach every particle of the photocatalyst 3,12,24.In addition, the high TiO 2 dosage may also become a favorable condition for surface agglomeration and diminishing the surface active sites, which further declined the rate of product formation 29. In a photocatalytic process, the volume of the reaction media is an important key and it has to be optimized to obtain an appropriate volume of the reaction media for an optimum photocatalytic process because the volume can influence the effectiveness of the UV-vis light energy supply.When the energy light is not sufficiently provided, the process of the electron excitation on the TiO 2 surface may not occurred at optimum condition.When the energy light is over supplied, it will be wasted in the form of heat.One way to be done to avoid such insufficient or over supplied of the energy light during the photocatalytic process is by optimizing the volume of the reaction media because the reaction media could be used to maintenance the supply of the energy light at an adequate level.In the present study, the dependency of the product yield on volume of the reaction media (NaOH suspension) was evaluated and the result is shown in Fig. 8.As can be seen in Fig. 8, the volume of the reaction media has obviously influenced the yield of reduction products.The yields of product increase with increasing the volume of the reaction media and achieving its optimum level at 75 mL.The yield of products decreased when the volume of the reaction media was larger than 75 mL.In the present experimental study, when the volume of the reaction media is small ( 75 mL of NaOH), the UV-vis light energy is over supplied and wasted as heat, which is presumably the reason for the lower product yield.While at a large volume ( 75 mL of NaOH), insufficient mixing is suggested for the reason of the decrease in the product yield, where the TiO 2 particles cannot be maintained in uplift and the TiO 2 particles tend to fall down and located at the bottom part of the reactor, resulting in non uniform of the particle distribution 30.The nonuniformity in particle distribution at a large of volume of the reaction media since the particle might be agglomerated which reduce the number of active site at the TiO 2 surface active, thus decrease the TiO 2 activity.In addition, the higher volume of NaOH used (100 mL for example), it corresponds to a situation where the quartz glass window for light transmission from the light source to the TiO 2 particles is covered by the suspension.Under this condition, the light cannot be well-transmitted to entire suspension in the reactor so that hinder the light to reach every particle of the photocatalyst. The concentration of CO 2 in water at ambient pressure is very small because of its low solubility property.One can be done to increase the solubility of the CO 2 in water is by elevating its pressure in a gaswater interface 3132.To investigate the influence of CO 2 pressure on the photocatalytic reduction of CO 2 , the pressure was varied from 100 kPa to 1000 kPa and the results are presented in Fig. 9.As can be seen from Fig. 9, a small decreased in the yield of reduction product was observed with increasing the pressure up to 400 kPa, although the reason for this is not completely clear.Moreover, the yield of reduction product has significanlty increased with increasing the pressure up to 800 kPa.The accumulation of reduction product at 800 kPa was found to be 5.89, 0.52, 0.02, and 0.011 mol/g cat., for CH 3 OH, CO, CH 4 and C 2 H 4 , respectively.The yield increase of those reduction products was probably due to the following two reasons: Firstly, elevating the CO 2 pressure consequently increased the solubility of CO 2 in the reaction media and thus increase the number of TiO 2 surface-contacted CO 2 molecules which further converts to important incipient CO 2 radicals (CO 2 ) for the product formation.The possible involvement of the CO 2 during the photocatalytic reaction is schematically illustrated in Fig. 5. Secondly, in the present study, the photocatalytic was conducted in alkaline solution (NaOH).At concentration optimum (0.2M) of NaOH used, the estimated pH value 12.Saturating the solution with CO 2 brought the pH of the solution to value of about 7-9.Based on the carbonate equilibrium system 25, the carbonate species in the reaction system was dominated by bicarbonate ion (HCO 3 -).The presence of this HCO 3 in the OH --CO 2 saturated system may accelerate the photocatalytic reduction process 28.Moreover, the yield of products gradually decreased by increasing the CO 2 pressure over 800 kPa.Tseng et al. 12 and Mizuno et al. 32 suggested that conversion of lower hydrocarbon to higher molecular weight under high pressure condition could probably be the reason for decreasing the yield of the reduction product.However, the higher molecular weight than all indentified products could not be detected under instrument conditions of the present study. In a TiO 2 photocatalytic process at under ambient temperature, photon radiation is the primary source of energy for the formation of electron-hole pair because the band gap energy of TiO 2 is relatively high for thermal excitation to overcome 33.On the other hands, thermal energy supply in the form of temperature heat to increase the rate of photo reaction is required because the thermal energy could induce the collision frequency of molecule in solution 34.Fig. 10 presents a temperature dependence of the reduction products.As can be seen in Fig. 10, the product yield was a little increased with small variation of the reaction temperature (from 303 K to 313 K).Fox and Dulay 35 reported that the majority of the photocatalytic reaction is not sensitive to small temperature variations.However, further significant increase of the yield of product can be observed at large temperature variations (from 313 to 338 K).For example, the yield of CH 3 OH increased significantly by increasing the temperature up to 338 K and then decreased.In case of C 2 H 4 , no significant change was found for the yield during the course of reaction.Moreover, the yield of CO decreased while CH 4 increased when the temperature increase above 338 K.Kohno, et al. 36 reported that a drastic decrease in the CO formation followed by increasing the yield of CH 4 occurred at temperature reaction above 523 K.They assumed that the increase of the yield CH 4 might be due to the photocatalyst used was present at the reduced state at higher temperature condition, leading to shift the product selectivity from CO to CH 4 .A similar phenomenon was observed in the present study, where the yield of CH 4 was found to increase while the yield of CO decreased at higher temperature process.Thus, we suggested that the reaction temperature has shifted the product selectivity in a similar manner. The study on the influence of illumination time on the product formation was conducted for a period of 0-17.5 h, and the result is presented in Fig. 11.From Fig. 11, it can be seen that the yield of CH 3 OH increased rapidly with illumination time at first 10 h, because more photo-electron are generated with increasing the illumination time 28.Small increase in the yield of the CH 3 OH was observed after 10 h illumination.The change in the rate of product formation after certain period of illumination can be attributed to increasing the chance for photocatalyst particles to aggregate, lesser strength of the surface adsorption power of photocatalysts and increasing in the number of active sites occupied by intermediate products, which are supposed to be a constructive condition for weakening the photocatalytic performance 3.In addition, a small increased of the yield of CO, CH 4 and C 2 H 4 can only be observed along with illumination time."
  },
  {
    "title": "Conclusions",
    "content": "In summary, it was found that the CO 2 could be reduced through photocatalytic reaction over TiO 2 under UV-vis illumination.The reduction products including CH 3 OH, CO, CH 4 , and C 2 H 4 were detected.The operational parameters employed have remarkably influenced the rate of product formation, implying that optimization of reaction condition is important.Optimization of the operational parameters would offer an efficient of the photocatalytic process. Fig 1.Schematic of experimental setup for CO 2 photocatalytic reduction Fig 3. Typical morphology images of TiO 2 : (a) brightfield-TEM, (b) Selected area electron diffraction (SAED), (c) high resolution TEM, and (d) enlarged lattice fringes Fig 4. The typical chromatogram of the standard and detected products: (a) CO, (b) CH 4 and C 2 H 4 , and (c) CH 3 OH electron leads to the formation of hydrogen radicals (H) (Eq.4), while reaction between OH and holes produced hydroxyl radical (OH)27 (Eq.5).At the same time, the excited electrons (e -) were transferred from the CB of TiO 2 for the reduction of CO 2 Fig 5.A reaction pathway for the product formation on TiO2 surface during the photocatalytic CO 2 reduction Fig 7. The influence of photocatalyst dosage on the yield of photocatalytic products Fig 10.The influence of temperature on the yield of photocatalytic products This study was founded by the Korea Research Council of Fundamental Science and Technology (KRCF) through the National Agenda Project 'Development of measurement technology solving climate change for J.S.K.The co-support from DGHE Republic of Indonesia through \"International Research Collaboration and Scientific Publication\" scheme for J.G. is also acknowledged.The author's thanks goes also to all people in the Gas Analysis Laboratory at the KRISS, who have delivered valuable insight and help with all types of technical problems throughout this study."
  }
]