[
  {
    "title": "Doi",
    "content": "10.1016/j.jphotochem.2020.112763"
  },
  {
    "title": "Article_Title",
    "content": "Visible light assisted photocatalytic reduction of CO2 to methanol using Fe3O4@N-C/Cu2O nanostructure photocatalyst"
  },
  {
    "title": "Abstract",
    "content": "Copper oxide (I) nanoparticles decorated on nitrogen-doped carbon (N-C) rod-shaped core-shell nanostructure have been successfully prepared.The nanostructures have been developed by the reduction of Cu 2 with ascorbic acid over Fe 3 O 4 N-C rod-shaped core-shell nanostructure followed by aerobic oxidation of copper nanoparticles.Furthermore, the photocatalytic activity of Fe 3 O 4 N-C/Cu 2 O nanostructure was evaluated in selective CO 2 reduction and methanol was observed as the main product over Fe 3 O 4 N-C/Cu 2 O.The photocatalytic activity of Fe 3 O 4 N-C/Cu 2 O for CO 2 reduction was found to be about four times higher than that of Fe 3 O 4 Cu 2 O photocatalyst, which might be due to the enhancement of visible light absorption and facilitating the separation of photogenerated electron-hole pairs."
  },
  {
    "title": "Experimental",
    "content": "In a typical experimental procedure,1 mL of HCl (37 wt ) was added into 400 mL preheated deionized water at 70 C, and FeCl 3 .6H 2 O (2.16 g) was dissolved in this hot solution.The above solution was stirred for 24 h.Then, the obtained orange-colored mixtures were cooled to room temperature, and the resulting material was washed three times with deionized water and ethanol and dried at 80 C overnight.-FeOOH was placed in a furnace and heated at the rate of 2 C min -1 up to 250 C and maintained for 2 h under static conditions. Fe 2 O 3 rods (80 mg) was added into 100 mL tris buffer solution and the mixture was sonicated for 30 min.After 30 min, dopamine hydrochloride (40 mg) was added slowly into the mixture and sonicated for 50 min; then, the mixture stirred vigorously for 4 h.Tris buffer is incorporated in the polydopamine shell by covalent reaction between its primary amine and dopamine which especially is true at low concentration of dopamine 31.The resulting materials was washed with deionized water and ethanol several times and then dried at 70 C overnight.The reduction of Fe 2 O 3 PDA to Fe 3 O 4 N-C rod-shaped core-shell nanostructures was performed under a continuous flow Ar:H 2 (9:1 as v/v) at 360 C with a heating rate of 3 C min -1 and held for 5 h.The generated products were naturally cooled down to room temperature. Fe 3 O 4 N-C (0.1 g) was added to 100 mL of distilled water and stirred with an overhead mechanical stirrer for 1 h.After 1 h, CuSO 4 .5H 2 O (0.1, 0.2, and 0.4 mmol) was added, and the samples were labeled as Fe 3 O 4 N-C/Cu 2 O a , Fe 3 O 4 N-C/Cu 2 O b and Fe 3 O 4 N-C/ Cu 2 O c , respectively, and stirred for 1 h.Then, NaOH (2 eq.) was added to the mixture, and stirred for 1 h.After that, ascorbic acid (3 eq.) was slowly added to mixture and then stirred for 5 h.The resulting mixture was washed with deionized water and ethanol several times and then dried at 70 C overnight. Fe 3 O 4 (0.1 g) was added to 100 mL of distilled water and stirred with an overhead mechanical stirrer for 1 h.After 1 h, CuSO 4 .5H 2 O (0.2 mmol) was added, and was stirred for 1 h.Then, NaOH (2 eq.) was added to the mixture, and stirred for 1 h.After that, ascorbic acid (3 eq.) was slowly added to mixture and then stirred for 5 h.The resulting mixture was washed with deionized water and ethanol several times and then dried at 70 C overnight. Cylindrical vessel (25 mL) was charged with a mixture of N,N-dimethylformamide (DMF) (13.5 mL) and water (1.5 mL), and then the solution was degassed by continuous purging of nitrogen for 20 min.Subsequently, CO 2 gas was purged into the solution under constant stirring to saturate the solution with CO 2 for 1 h, then, the photocatalyst (10 mg) was added to the reaction mixture.The vessel was tightly closed during the photocatalytic reaction and stirred continuously by a magnetic stirring bar.Reaction vessel was irradiated to light by using a 5 W Xenon HID lamp with an irradiance of 12.5 mW cm -2 , and the reaction temperature was controlled by a thermostatic water bath at 25 3 C.The reaction progress was monitored by using Trace GC ultra from the Thermo Company equipped with FID detector and Rtx -1 capillary column. X-ray diffraction (XRD) is used to investigate the crystalline phases structures of the as-synthesized hybrids (Fig. 1).The XRD pattern of -FeOOH showed diffraction peaks positions at 2 11, 16, 26, 33, The morphology and structure of the nanohybrids were monitored by transmission electron microscope (TEM) (Fig. 2).Fe 3 O 4 N-C C-S nanohybrid showed a rod-shaped core-shell nanostructure with the average shell thickness of N-C shell layer is 5 nm (Fig. 1a andb).The doping of electron-rich nitrogen in the carbon layer increases the hydrophilicity.These species are essential to improve the dispersibility of the magnetic core and to hinder them from agglomeration in liquid media.However, the nitrogen moieties on the carbon layer serve as anchoring sites to better the dispersion of Cu species.It can be seen that abundant dark dots are deposited on the N-C layer, which confirm that the adsorbed Cu 2 ions were reduced by ascorbic acid. Nitrogen sorption isotherm was measured to evaluate the textual properties of the nanohybrids (Fig. 3).All sorption isotherms of nanohybrids revealed a type IV behavior and showed a distinct hysteresis loop, which is associated with the capillary condensation taking place in mesopores 33.The specific surface area of Fe 4b).In Fig. 4c, the N 1s XPS spectrum shows four peaks with the binding energies of 398.52, 400.14, 401.69, and 403.54 eV, corresponding to pyridinic N, pyrrolic N, graphitic N, and NO x , respectively 35.The presence of different bonding configurations of N dopants may lead to produce different activation regions 36.The graphitic N works as an electron-mobility activation region for the rapid and effective transfer of photogenerated electrons from the CB of semiconductor (Cu 2 O) 37,38.Also, pyridinic N and pyrrolic N act as the CO 2 reduction active sites to improve the interfacial photocatalytic activity 39.According to Fig. 4d, the Cu 2p 3/2 peak of Cu 2 O could be fitted into two peaks at the binding energies of 932.94 and 932.52 eV, which are ascribed to Cu/Cu I and Cu II , respectively 40.Analysis of the copper LMM Auger spectrum shows binding energy at 570.62 eV, confirming the existence of Cu I 41.Therefore, the peak at 932.94 eV is ascribed to Cu 2 O.In the high-resolution Fe2p XPS spectrum, the peaks of Fe 2p 3/2 and Fe 2p 1/2 at 710.52 and 724.01 eV are the characteristic positions of Fe 3 O 4 , indicating the successful transformation from Fe 2 O 3 to Fe 3 O 4 (Fig. 5e) 42. It is believed that the photocatalytic activity is closely related to the optical absorption of the nanohybrids.Thus, the optical properties of the as-synthesized Fe The photocatalytic reduction experiments were carried out under ambient conditions in a DMF/water mixture as a solvent.After 3 h of visible light illumination in the presence of a nanohybrids, methanol was produced as the major product of CO 2 photoreduction.The methanol yield was calculated and plotted in Fig. 6 The reduction of CO 2 did not advance without using photocatalyst and under dark conditions which indicated that methanol was solely formed by the photocatalytic reduction of CO 2 .Additionally, in order to demonstrate that the formation of methanol originated from the photocatalytic reduction of CO 2 and not from DMF, the photoreduction of CO 2 was done in another polar aprotic solvent (acetonitrile) (Fig. 7).The yield of methanol in acetonitrile (410 mol g cat -1 ) was found to be analogous to that obtained in DMF.Furthermore, the photoreaction was carried out by using DMF and photocatalyst in the absence of CO 2 .In this condition, methanol did not form, confirming exclusive methanol generation by the CO 2 photoreduction.A plausible mechanism for the CO 2 photoreduction to methanol using Fe 3 O 4 N-C/Cu 2 O as catalysts is illustrated in Fig. 8.Under visible light irradiation, the Cu 2 O could be prone to create photogenerated electron-hole pairs in its conduction band (CB) and valence band (VB), respectively.The electron on Cu 2 O nanoparticles can be quickly and efficiently transferred to the catalytic sites of N-C layer.Thus, this electron transfer efficiently separates photogenerated electrons and holes, and the recombination process of the electron-hole pairs is inhibited.Eventually, the active valence band holes oxidized water molecules to produce O 2 and H .Then, H and the CB electrons would reduce the surface adsorbed CO 2 and form methanol. To assess the possibility of the catalyst in practical applications, the recyclability of the photocatalyst also needs to be studied.In this consequence, as well as to find out if the accumulation of the product in a continuous experiment can repress the further methanol photogeneration, the Fe 3 O 4 N-C/Cu 2 O nanohybrid was reused after 3 h, separated by using the external magnetic field, rinsed with water, and desiccated.Four recycles were carried out, where the reactant fluid was changed in each experiment, and a 3 h illumination was applied in each case (Fig. 9).After reusing for four cycles, the photocatalyst had a stable performance with repeatable methanol yield and the methanol yield in the fourth recycle was 90.9 of the initial yield.Also, after four runs, the accumulative methanol yield was 1684 mol g cat -1 , which was upper than the yield of a 12 h continuous reaction (996 mol g cat -1 ).This result indicates that in a continuous experiment under the same conditions, as CO 2 consumption or accumulation of methanol becomes relatively constant, further photogeneration of methanol will be inhibited.Another possibility is that the reaction cell design may contain defects, and some of the produced methanol is lost during the continuous experiment. The catalytic performance of Fe 3 O 4 N-C/Cu 2 O nanohybrid was further compared with the results reported by previous researchers, as demonstrated in Table 1.It is not easy to provide a direct comparison to the other photocatalysts due to various experimental conditions (such as light source, time, additive, and solvents).However, the Fe 3 O 4 N- In this work, we have successfully developed copper oxide (I) nanoparticles decorated on nitrogen-doped carbon (N-C) rod-shaped coreshell nanostructure.The photocatalytic activity of Fe 3 O 4 N-C/Cu 2 O nanostructure was evaluated in selective CO 2 reduction into methanol with high yield (146.7 mol g -1 h -1 ).The photocatalytic activity of Fe 3 O 4 N-C/Cu 2 O for CO 2 reduction was found to be about four times higher than that of Fe 3 O 4 Cu 2 O photocatalyst.After reusing for four cycles, the photocatalyst has a stable performance with repeatable methanol yield, and the methanol yield in the fourth recycle is 90.9 of the initial yield.Furthermore, nanocomposite material may bring new insight into the design and applications of highly efficient photocatalysts. Scheme 1. Schematic illustration of the strategy for the fabrication of Fe 3 O 4 N-C/Cu 2 O. 3 O 4 N-C, Fe 3 O 4 N-C/Cu 2 O a , Fe 3 O 4 N-C/Cu 2 O b , Fe 3 O 4 N-C/Cu 2 O c were estimated to be 61.26,57.95, 104.07, and 76.13 m 2 g -1 , respectively.After immobilizing Cu 2 O NPs on the surface of Fe 3 O 4 N-C structures in Fe 3 O 4 N-C/Cu 2 O a , the S BET decreases due to the blocking of pores by Cu 2 O NPs.Moreover, the S BET increases by rising Cu 2 O content (Fe 3 O 4 N-C/Cu 2 O b ); therefore, Cu 2 O NPs serve as the spacer to between nanostructures and prevent them from agglomeration 34.The increase in S BET not only facilitates the absorption sites and utilization of sunlight, but also improves the contact of photocatalysts with CO 2 , and leads to the enhancement in photocatalytic rate.However, a further increase in Cu 2 O content (Fe 3 O 4 N-C/Cu 2 O c ) led to a decrease in S BET due to the aggregation of Cu 2 O nanoparticles in high Cu 2 O loading of Fe 3 O 4 N-C/Cu 2 O c .X ray photoelectron spectroscopy (XPS) analysis was used to determine the surface chemical states of the Fe 3 O 4 N-C/Cu 2 O b nanohybrid.Fig. 4a shows the XPS survey spectrum, which expresses the presence of C, N, O, Fe, and Cu.The high-resolution C1 s XPS spectrum indicated three deconvoluted peaks at 284.54, 286.63, and 288.94 eV, which are related to CC, C-N/C-O, and CO bonds, respectively (Fig. Fig. 1.XRD patterns of -FeOOH, Fe 2 O 3 , Fe 3 O 4 N-C, Fe 3 O 4 N-C/Cu 2 O a , Fe 3 O 4 N-C/Cu 2 O b , Fe 3 O 4 N-C/Cu 2 O c nanohybrids. 3 O 4 N-C, Fe 3 O 4 N-C/Cu 2 O a , Fe 3 O 4 N-C/ Cu 2 O b , Fe 3 O 4 N-C/Cu 2 O c , and Fe 3 O 4 /Cu 2 O nanohybrids were evaluated by the UV-vis diffuse reflection spectroscopy (DRS) (Fig. 5a).All the nanohybrids with N-C layer show strong absorbance in the visible light region.Among the nanohybrids, the Fe 3 O 4 N-C/Cu 2 O a shows the highest visible absorption.The Fe 3 O 4 N-C/Cu 2 O b and Fe 3 O 4 N-C/ Cu 2 O c show low visible absorptions that may be ascribed to the agglomeration of Cu 2 O NPs on surface of N-C layer.Similar to black photocatalysts, it is difficult to determine the optical band gap by UV-vis DRS spectra 43.Fig. 5b shows the PL spectra of Fe 3 O 4 N-C, Fe 3 O 4 N-C/Cu 2 O a , Fe 3 O 4 N-C/Cu 2 O b , Fe 3 O 4 N-C/Cu 2 O c , and Fe 3 O 4 Cu 2 O c nanohybrids with the excitation wavelength of 325 nm.As can be seen, the five samples displayed a similar emission spectrum.Nevertheless, the emission peak intensity of Fe 3 O 4 N-C/Cu 2 O b was comparatively lower than that of the other two as-synthesized nanohybrids, signifying the decreased radiative recombination and high separation efficiency of the electron-hole pairs.In contrast, the higher PL intensity of Fe 3 O 4 /Cu 2 O demonstrated that the N-C layer could successfully inhibit the recombination rate of the photogenerated electrons. Fig. 2. TEM images of a-b) Fe 3 O 4 N-C, c-d) Fe 3 O 4 N-C/Cu 2 O a , e-f) Fe 3 O 4 N-C/Cu 2 O b , g-h) Fe 3 O 4 N-C/Cu 2 O c nanohybrids. Fig. 3. Nitrogen adsorption-desorption isotherms of Fe 3 O 4 N-C, Fe 3 O 4 N-C/Cu 2 O a , Fe 3 O 4 N-C/Cu 2 O b , Fe 3 O 4 N-C/Cu 2 O c nanohybrids. Fig. 4. XPS spectra of Fe 3 O 4 N-C/Cu 2 O b nanohybrid: a) survey, high-resolution b) C 1s, c) N 1s, d) Cu 2p and d) Fe 2p. Fig. 5. a) UV-vis DRS spectra and b) PL spectra of Fe 3 O 4 N-C, Fe 3 O 4 N-C/Cu 2 O a , Fe 3 O 4 N-C/Cu 2 O b , Fe 3 O 4 N-C/Cu 2 O c , Fe 3 O 4 /Cu 2 O nanohybrids. Fig. 6.Photocatalytic methanol evolution over 3 h time course for Fe 3 O 4 N-C/Cu 2 O, Fe 3 O 4 N-C, and Fe 3 O 4 /Cu 2 O photocatalysts under visible light irradiation. Fig. 7. Comparative experiments of the CO 2 photoreduction under diff ;erent conditions. Fig. 8.A proposed mechanism for photocatalytic reduction of CO 2 catalyzed by Fe 3 O 4 N-C/Cu 2 O. Fig. 9. Methanol yield as a function of time. Comparative study with previous reports for photoreduction of CO 2 into methanol.Cu 2 O/ nanoscale cellulose crystal-nanoscale cellulose crystal.b Carbon Quantum Dots/Cu 2 O. a c Reduced graphene oxide-CuO. We gratefully thank financial support from the Research Council of Shahid Beheshti University and the Iranian National Science Foundation (Proposal No: 96016966). Appendix A. Supplementary data We the undersigned declare that this manuscript is original, has not been published before and is not currently being considered for publication elsewhere. We confirm that the manuscript has been read and approved by all named authors and that there are no other persons who satisfied the criteria for authorship but are not listed.We further confirm that the order of authors listed in the manuscript has been approved by all of us. We declare that we have no competing financial, professional or personal interests. Supplementary material related to this article can be found, in the online version, at doi:https://doi.org/10.1016/j.jphotochem.2020. 112763."
  },
  {
    "title": "Results_and_Discussion",
    "content": "X-ray diffraction (XRD) is used to investigate the crystalline phases structures of the as-synthesized hybrids (Fig. 1).The XRD pattern of -FeOOH showed diffraction peaks positions at 2 11, 16, 26, 33, The morphology and structure of the nanohybrids were monitored by transmission electron microscope (TEM) (Fig. 2).Fe 3 O 4 N-C C-S nanohybrid showed a rod-shaped core-shell nanostructure with the average shell thickness of N-C shell layer is 5 nm (Fig. 1a andb).The doping of electron-rich nitrogen in the carbon layer increases the hydrophilicity.These species are essential to improve the dispersibility of the magnetic core and to hinder them from agglomeration in liquid media.However, the nitrogen moieties on the carbon layer serve as anchoring sites to better the dispersion of Cu species.It can be seen that abundant dark dots are deposited on the N-C layer, which confirm that the adsorbed Cu 2 ions were reduced by ascorbic acid. Nitrogen sorption isotherm was measured to evaluate the textual properties of the nanohybrids (Fig. 3).All sorption isotherms of nanohybrids revealed a type IV behavior and showed a distinct hysteresis loop, which is associated with the capillary condensation taking place in mesopores 33.The specific surface area of Fe 4b).In Fig. 4c, the N 1s XPS spectrum shows four peaks with the binding energies of 398.52, 400.14, 401.69, and 403.54 eV, corresponding to pyridinic N, pyrrolic N, graphitic N, and NO x , respectively 35.The presence of different bonding configurations of N dopants may lead to produce different activation regions 36.The graphitic N works as an electron-mobility activation region for the rapid and effective transfer of photogenerated electrons from the CB of semiconductor (Cu 2 O) 37,38.Also, pyridinic N and pyrrolic N act as the CO 2 reduction active sites to improve the interfacial photocatalytic activity 39.According to Fig. 4d, the Cu 2p 3/2 peak of Cu 2 O could be fitted into two peaks at the binding energies of 932.94 and 932.52 eV, which are ascribed to Cu/Cu I and Cu II , respectively 40.Analysis of the copper LMM Auger spectrum shows binding energy at 570.62 eV, confirming the existence of Cu I 41.Therefore, the peak at 932.94 eV is ascribed to Cu 2 O.In the high-resolution Fe2p XPS spectrum, the peaks of Fe 2p 3/2 and Fe 2p 1/2 at 710.52 and 724.01 eV are the characteristic positions of Fe 3 O 4 , indicating the successful transformation from Fe 2 O 3 to Fe 3 O 4 (Fig. 5e) 42. It is believed that the photocatalytic activity is closely related to the optical absorption of the nanohybrids.Thus, the optical properties of the as-synthesized Fe The photocatalytic reduction experiments were carried out under ambient conditions in a DMF/water mixture as a solvent.After 3 h of visible light illumination in the presence of a nanohybrids, methanol was produced as the major product of CO 2 photoreduction.The methanol yield was calculated and plotted in Fig. 6 The reduction of CO 2 did not advance without using photocatalyst and under dark conditions which indicated that methanol was solely formed by the photocatalytic reduction of CO 2 .Additionally, in order to demonstrate that the formation of methanol originated from the photocatalytic reduction of CO 2 and not from DMF, the photoreduction of CO 2 was done in another polar aprotic solvent (acetonitrile) (Fig. 7).The yield of methanol in acetonitrile (410 mol g cat -1 ) was found to be analogous to that obtained in DMF.Furthermore, the photoreaction was carried out by using DMF and photocatalyst in the absence of CO 2 .In this condition, methanol did not form, confirming exclusive methanol generation by the CO 2 photoreduction.A plausible mechanism for the CO 2 photoreduction to methanol using Fe 3 O 4 N-C/Cu 2 O as catalysts is illustrated in Fig. 8.Under visible light irradiation, the Cu 2 O could be prone to create photogenerated electron-hole pairs in its conduction band (CB) and valence band (VB), respectively.The electron on Cu 2 O nanoparticles can be quickly and efficiently transferred to the catalytic sites of N-C layer.Thus, this electron transfer efficiently separates photogenerated electrons and holes, and the recombination process of the electron-hole pairs is inhibited.Eventually, the active valence band holes oxidized water molecules to produce O 2 and H .Then, H and the CB electrons would reduce the surface adsorbed CO 2 and form methanol. To assess the possibility of the catalyst in practical applications, the recyclability of the photocatalyst also needs to be studied.In this consequence, as well as to find out if the accumulation of the product in a continuous experiment can repress the further methanol photogeneration, the Fe 3 O 4 N-C/Cu 2 O nanohybrid was reused after 3 h, separated by using the external magnetic field, rinsed with water, and desiccated.Four recycles were carried out, where the reactant fluid was changed in each experiment, and a 3 h illumination was applied in each case (Fig. 9).After reusing for four cycles, the photocatalyst had a stable performance with repeatable methanol yield and the methanol yield in the fourth recycle was 90.9 of the initial yield.Also, after four runs, the accumulative methanol yield was 1684 mol g cat -1 , which was upper than the yield of a 12 h continuous reaction (996 mol g cat -1 ).This result indicates that in a continuous experiment under the same conditions, as CO 2 consumption or accumulation of methanol becomes relatively constant, further photogeneration of methanol will be inhibited.Another possibility is that the reaction cell design may contain defects, and some of the produced methanol is lost during the continuous experiment. The catalytic performance of Fe 3 O 4 N-C/Cu 2 O nanohybrid was further compared with the results reported by previous researchers, as demonstrated in Table 1.It is not easy to provide a direct comparison to the other photocatalysts due to various experimental conditions (such as light source, time, additive, and solvents).However, the Fe 3 O 4 N-"
  },
  {
    "title": "Conclusions",
    "content": "In this work, we have successfully developed copper oxide (I) nanoparticles decorated on nitrogen-doped carbon (N-C) rod-shaped coreshell nanostructure.The photocatalytic activity of Fe 3 O 4 N-C/Cu 2 O nanostructure was evaluated in selective CO 2 reduction into methanol with high yield (146.7 mol g -1 h -1 ).The photocatalytic activity of Fe 3 O 4 N-C/Cu 2 O for CO 2 reduction was found to be about four times higher than that of Fe 3 O 4 Cu 2 O photocatalyst.After reusing for four cycles, the photocatalyst has a stable performance with repeatable methanol yield, and the methanol yield in the fourth recycle is 90.9 of the initial yield.Furthermore, nanocomposite material may bring new insight into the design and applications of highly efficient photocatalysts. Scheme 1. Schematic illustration of the strategy for the fabrication of Fe 3 O 4 N-C/Cu 2 O. 3 O 4 N-C, Fe 3 O 4 N-C/Cu 2 O a , Fe 3 O 4 N-C/Cu 2 O b , Fe 3 O 4 N-C/Cu 2 O c were estimated to be 61.26,57.95, 104.07, and 76.13 m 2 g -1 , respectively.After immobilizing Cu 2 O NPs on the surface of Fe 3 O 4 N-C structures in Fe 3 O 4 N-C/Cu 2 O a , the S BET decreases due to the blocking of pores by Cu 2 O NPs.Moreover, the S BET increases by rising Cu 2 O content (Fe 3 O 4 N-C/Cu 2 O b ); therefore, Cu 2 O NPs serve as the spacer to between nanostructures and prevent them from agglomeration 34.The increase in S BET not only facilitates the absorption sites and utilization of sunlight, but also improves the contact of photocatalysts with CO 2 , and leads to the enhancement in photocatalytic rate.However, a further increase in Cu 2 O content (Fe 3 O 4 N-C/Cu 2 O c ) led to a decrease in S BET due to the aggregation of Cu 2 O nanoparticles in high Cu 2 O loading of Fe 3 O 4 N-C/Cu 2 O c .X ray photoelectron spectroscopy (XPS) analysis was used to determine the surface chemical states of the Fe 3 O 4 N-C/Cu 2 O b nanohybrid.Fig. 4a shows the XPS survey spectrum, which expresses the presence of C, N, O, Fe, and Cu.The high-resolution C1 s XPS spectrum indicated three deconvoluted peaks at 284.54, 286.63, and 288.94 eV, which are related to CC, C-N/C-O, and CO bonds, respectively (Fig. Fig. 1.XRD patterns of -FeOOH, Fe 2 O 3 , Fe 3 O 4 N-C, Fe 3 O 4 N-C/Cu 2 O a , Fe 3 O 4 N-C/Cu 2 O b , Fe 3 O 4 N-C/Cu 2 O c nanohybrids. 3 O 4 N-C, Fe 3 O 4 N-C/Cu 2 O a , Fe 3 O 4 N-C/ Cu 2 O b , Fe 3 O 4 N-C/Cu 2 O c , and Fe 3 O 4 /Cu 2 O nanohybrids were evaluated by the UV-vis diffuse reflection spectroscopy (DRS) (Fig. 5a).All the nanohybrids with N-C layer show strong absorbance in the visible light region.Among the nanohybrids, the Fe 3 O 4 N-C/Cu 2 O a shows the highest visible absorption.The Fe 3 O 4 N-C/Cu 2 O b and Fe 3 O 4 N-C/ Cu 2 O c show low visible absorptions that may be ascribed to the agglomeration of Cu 2 O NPs on surface of N-C layer.Similar to black photocatalysts, it is difficult to determine the optical band gap by UV-vis DRS spectra 43.Fig. 5b shows the PL spectra of Fe 3 O 4 N-C, Fe 3 O 4 N-C/Cu 2 O a , Fe 3 O 4 N-C/Cu 2 O b , Fe 3 O 4 N-C/Cu 2 O c , and Fe 3 O 4 Cu 2 O c nanohybrids with the excitation wavelength of 325 nm.As can be seen, the five samples displayed a similar emission spectrum.Nevertheless, the emission peak intensity of Fe 3 O 4 N-C/Cu 2 O b was comparatively lower than that of the other two as-synthesized nanohybrids, signifying the decreased radiative recombination and high separation efficiency of the electron-hole pairs.In contrast, the higher PL intensity of Fe 3 O 4 /Cu 2 O demonstrated that the N-C layer could successfully inhibit the recombination rate of the photogenerated electrons. Fig. 2. TEM images of a-b) Fe 3 O 4 N-C, c-d) Fe 3 O 4 N-C/Cu 2 O a , e-f) Fe 3 O 4 N-C/Cu 2 O b , g-h) Fe 3 O 4 N-C/Cu 2 O c nanohybrids. Fig. 3. Nitrogen adsorption-desorption isotherms of Fe 3 O 4 N-C, Fe 3 O 4 N-C/Cu 2 O a , Fe 3 O 4 N-C/Cu 2 O b , Fe 3 O 4 N-C/Cu 2 O c nanohybrids. Fig. 4. XPS spectra of Fe 3 O 4 N-C/Cu 2 O b nanohybrid: a) survey, high-resolution b) C 1s, c) N 1s, d) Cu 2p and d) Fe 2p. Fig. 5. a) UV-vis DRS spectra and b) PL spectra of Fe 3 O 4 N-C, Fe 3 O 4 N-C/Cu 2 O a , Fe 3 O 4 N-C/Cu 2 O b , Fe 3 O 4 N-C/Cu 2 O c , Fe 3 O 4 /Cu 2 O nanohybrids. Fig. 6.Photocatalytic methanol evolution over 3 h time course for Fe 3 O 4 N-C/Cu 2 O, Fe 3 O 4 N-C, and Fe 3 O 4 /Cu 2 O photocatalysts under visible light irradiation. Fig. 7. Comparative experiments of the CO 2 photoreduction under diff ;erent conditions. Fig. 8.A proposed mechanism for photocatalytic reduction of CO 2 catalyzed by Fe 3 O 4 N-C/Cu 2 O. Fig. 9. Methanol yield as a function of time. Comparative study with previous reports for photoreduction of CO 2 into methanol.Cu 2 O/ nanoscale cellulose crystal-nanoscale cellulose crystal.b Carbon Quantum Dots/Cu 2 O. a c Reduced graphene oxide-CuO. We gratefully thank financial support from the Research Council of Shahid Beheshti University and the Iranian National Science Foundation (Proposal No: 96016966). Appendix A. Supplementary data We the undersigned declare that this manuscript is original, has not been published before and is not currently being considered for publication elsewhere. We confirm that the manuscript has been read and approved by all named authors and that there are no other persons who satisfied the criteria for authorship but are not listed.We further confirm that the order of authors listed in the manuscript has been approved by all of us. We declare that we have no competing financial, professional or personal interests. Supplementary material related to this article can be found, in the online version, at doi:https://doi.org/10.1016/j.jphotochem.2020. 112763."
  }
]