[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2017.03.018"
  },
  {
    "title": "Article_Title",
    "content": "Visible-light reduction CO 2 with dodecahedral zeolitic imidazolate framework ZIF-67 as an efficient co-catalyst"
  },
  {
    "title": "Abstract",
    "content": "The nanomorphology of ZIFs strongly influences or even improves chemical properties of the metalorganic materials.Nanosized rhombic dodecahedral ZIF-67 crystals were successfully synthesized through a simple co-precipitation method at room temperature, and fully characterized by XRD, FT-IR, DRS, XPS, TEM, SEM, TGA and N 2 /CO 2 sorption measurements.The as-prepared ZIF-67 material was applied to be an efficient heterogeneous co-catalyst for the photocatalytic CO 2 reduction by cooperating with a ruthenium-based dye as a photosensitizer under mild reaction conditions.Under the optimal reaction conditions, the photocatalytic CO 2 reduction system achieved a superior catalytic performance with a CO generation rate of 37.4 mol/30 min, which was much higher than that of other types of MOFs.The carbon source of the evaluated CO was confirmed by 13 CO 2 isotopic experiment.The stability and reusability of the ZIF-67 co-catalyst in the reaction system were also examined.The present work provides new insights in the developments of nanoscale ZIFs materials for photocatalytic application."
  },
  {
    "title": "Experimental",
    "content": "The chemicals used for synthesizing the material and participating in the reaction included Co , triethanolamine (TEOA) and acetonitrile (MeCN).All the chemical reagents were used without further purification.The carbon dioxide was supplied by Fuzhou Lianzhong Industrial Gases Co. Ltd (99.999).The 13 CO 2 gas, 98 enriched, was purchased from Hess chemical gas center in Beijing. The ZIF-67 sample was prepared following a previous reported literature 48 with a slight modification.Firstly, 2 mmol Co(NO 3 ) 2 6H 2 O and 12 mmol 2-methylimidazole were dissolved in 30 ml and 10 ml methanol, respectively.Then, with vigorous stirring, the solution of 2-methylimidazole was added into the Co(NO 3 ) 2 6H 2 O solution slowly.As a mixture of the two solutions, the purple precipitates were formed.After the two solutions were mixed completely, put the mixture solution at room temperature for 24 h.Finally, the purple powders were separated out by centrifugation and washed repeatedly in ethanol and then vacuum dried at 60 C overnight.The proposed synthesis process of ZIF-67 was illustrated in Scheme 1. Scheme 1.The proposed synthesis process of the ZIF-67 material. X-ray diffraction (XRD) measurement was measured on a Bruker D8 Advance diffractometer with Cu K1 radiation.A Hitachi New Generation SU8010 field emission scanning electron microscope (FESEM) was employed to obtain the morphologies of the samples.Transmission electron microscope (TEM) was conducted on a JEOL model JEM 2010 EX instrument.N 2 adsorption-desorption and CO 2 adsorption isotherms were measured on a Micromeritics ASAP2020 equipment.Thermal gravimetrical analysis with a heating rate of 10 C min -1 from 20 C to 1000 C was conducted on a Netzsch Thermoanalyzer STA 449 F3 instrument.Fourier transformed infrared (FT-IR) spectra were measured on a Nicolet Magna 670 fourier transform infrared spectrometer.A Thermo ESCALAB250 instrument with a monochromatized Al Ka line source (200 W) was used for X-ray photoelectron spectroscopy (XPS) measurements.The UV-vis diffuse reflectance spectra (DRS) of the samples were measured on a Varian Cary 500 Scan UV-vis spectrophotometer with barium sulfate as the reference.The produced gases after the reaction were analyzed on an Agilent 7820A gas chromatography equipped with a thermal conductivity detector (TCD) and a TD-1 packed column.A HP 5973 gas chromatography-mass spectrometry (GC-MS) was employed to detect the 13 CO generated from the 13 CO 2 isotopic experiment. Typically, 8 mg photosensitizer Ru(bpy) 3 Cl 2 6H 2 O and 1 mg co-catalyst ZIF-67 were dispersed in a solution of triethanolamine (TEOA)/water/acetonitrile (1 mL/2 mL/3 mL).The suspension was purged with CO 2 to drive away the air in the Schlenk flask reactor, and then the reactor was full of CO 2 to conduct the reaction.With vigorous stirring, a 300 W xenon lamp with 420 nm cut-off filter was utilized as the light source and the circulation cooling water was employed to maintain the reaction temperature.After illumination for 30 min, the produced gases were analyzed by a gas chromatography."
  },
  {
    "title": "Results_and_Discussion",
    "content": "XRD characterization was first carried out to investigate the crystallographic structure and phase purity of the as-prepared ZIF-67 sample.As shown in Fig. 1, the collected XRD pattern matches well with the simulated one, corresponding to a sodalite structure of pure cubic ZIF-67 with a SOD topology as given in the inset of Fig. 1.The sharp and strong characteristic peaks reflect the high crystallinity of the ZIF-67 material prepared with the synthesizing protocol applied. To study the morphology and microstructure of the as-prepared ZIF-67 sample, the field emission scanning electron microscope (FESEM) was recorded on the sample.Fig. 2a is the typical lowmagnification FESEM image of the ZIF-67 sample, which presents the morphology of uniform and monodispersed rhombic dodecahedral nanocrystals with a diameter of ca.500 nm (Fig. 2b).The TEM image of a single dodecahedron (Fig. 2c) reveals its solid texture without discernible porosity, and the corresponding selected area electron diffraction (SAED) mirrors the perfect crystalline nature of the as-prepared ZIF-67 sample (Fig. 2d), which is consistent with the results of XRD characterization. The BET surface area and pore structure of the prepared ZIF-67 samples were investigated using N 2 adsorption-desorption measurements.Fig. 3a shows the N 2 adsorption-desorption isotherms for ZIF-67 sample, which is categorized as type-I hysteresis loops according to the IUPAC classification, indicating the microporous characteristics of the ZIF-67 sample.The prepared sample hold a high BET surface area of 1325 m 2 g -1 and a high Langmuir surface area of 2023 m 2 g -1 .The Barrett-Joyner-Halenda (BJH) pore size distribution curve (Fig. 3b) further reveals the microporous nature of the ZIF-67 sample.Such favorable microstructure with high surface area and microporous property cannot only provide the efficient transport pathways for interfacial charge carrier transferring and trapping, but also confine reactants in nanospace, which are both beneficial for photocatalytic reaction 49.The adsorption isotherm of CO 2 for the as-prepared ZIF-67 was also measured.As shown in Fig. 3c, the ZIF-67 sample presents a high adsorption ability for CO 2 (ca.34 cm 3 g -1 ), which endows a priority for heterogeneous CO 2 redox reactions.Additionally, the thermogravimetric analysis (TGA) of the ZIF-67 sample (Fig. 3d) shows the decomposition temperature located at about 350 C in air and 555 C in N 2 , which ensure the high thermal stability of ZIF-67 in our mild reaction system. Results of XPS measurements revealed the chemical composition and states of the as-prepared material.All the binding energies obtained in the XPS analysis were calibrated using the C 1s peak at 284.6 eV.Fig. S2 displays a full survey of ZIF-67 involving C 1s, N 1s, O 1s, and Co 2p peaks.For the high-resolution spectrum of Co 2p (Fig. 4a), two main peaks at 780.9 and 796.6 eV, separated by about 15 eV, are assigned to Co 2p 3/2 and Co 2p 1/2 , respectively 50.Two distinguishable satellite peaks of the Co 2p 3/2 main peak are located at about 786.1 eV (Sat.a) and 791.0 eV (Sat.b) and the intensity of Sat.a is much higher than that of Sat.b.It is generally accepted that the judgement of the oxidation states of Co cations is rather difficult, and the energy gap between the Co 2p main peaks and the satellite peaks can serve as an important standard, namely that the energy gap of Co(II) cation corresponds to ca. 6.0 eV, while the Co(III) cation typically features the energy gap to 9-10 eV 51,52.In this regard, Co(II) is the main form existing in the as-prepared ZIF-67 material. To further explore the coordination situation between cobalt ions and 2-methylimidazole ligand in the as-prepared ZIF-67 sample, the characterization of ultraviolet visible diffuse reflectance spectra (UV-vis DRS) was conducted.As shown in Fig. 4b, there are three adsorption peaks at 539, 564 and 585 nm, namely the spin coupling triplet peaks, which are attributed to the 4 A 2 (F) 4 T 1 (P) transition of tetrahedral coordinated Co(II) 53,54, and it suggests no octahedral coordinated Co(II) because of no any peaks at 480 and 506 nm 55.Combining the analysis results of XPS and DRS, it can be concluded that the cobalt species of ZIF-67 are assigned to the tetrahedral coordinated Co(II), similar to previous literature reported by others 53,54. The surface chemical structures of the as-prepared ZIF-67 nanocrystals were studied by Fourier transformed infrared (FT-IR) characterization.The FT-IR spectra of the ligand 2-methylimidazole and the ZIF-67 material are displayed in Fig. S3.It is clearly shown that the peaks of ZIF-67 are mainly ascribed to the ligand 2-methylimidazole.The observed peaks at 600-1500 cm -1 are related to the stretching and bending modes of the imidazole ring, whereas the peak at 1580 cm -1 corresponds to the stretching mode of C N bond in the ligand 2-methylimidazole.Moreover, the peaks at 2929 and 3135 cm -1 are assigned to the stretching mode of C H from the aromatic ring and the aliphatic chain in 2-methylimidazole, respectively 56,57. The catalytic property of the prepared ZIF-67 sample was evaluated in the saturated CO 2 solution with dispersed catalyst powers under visible light irradiation at mild reaction conditions.CO and H 2 are the two main reduction products.As shown in Fig. 6, with 0.1 mg ZIF-67 added, the production rates of both CO and H 2 are significantly enhanced to 37.4 and 13 mol/30 min, respectively.The production of CO and H 2 are suppressed dramatically when ZIF-67 is absent from the system (Entry 2, Table S1), suggesting that ZIF-67 solid remarkably promotes the photocatalytic CO 2 reduction, as a heterogeneous co-catalyst. The studies on the CO generation from the ZIF-67 catalyzed CO 2 reduction system as a function of reaction time were performed.As shown in Fig. 5, in the initial 30 min, the amount of CO increases dramatically with the prolonging of the irradiation time.After operating the reaction up to 1 h, the generation rate of the product diminishes gradually.It may be attributed to the exhaustion of the dye after long time operations under the reaction conditions 58,59.In order to confirm this speculation, fresh dye is further added into the reaction system after 1.5 h irradiation, and the reaction proceeds again as expected.The insert graph in Fig. 5 shows that the yield of CO does not reduce in the following 1.5 h reaction, and the same phenomenon appears in the later several cycles.This result reveals the super stability of the co-catalyst ZIF-67 in such a mild system. The effect of the adding amount of ZIF-67 for the photocatalytic CO 2 reaction was also investigated.As shown in Fig. 6, even with a tiny amount (0.05 mg) of ZIF-67 added, the chemical system achieves the CO production of 32.7 mol and H 2 evolution of 11 mol.When 0.1 mg ZIF-67 is included, the yield of CO reaches a maximum value of 37.4 mol together with a H 2 evolution of 13 mol, giving a high catalytic turnover number (TON) of 112 and 4.7 for the chemical system, based on ZIF-67 and Ru, respectively (Fig. S4), with an apparent quantum yield (AQY) of 1.55.Further increasing the amount of ZIF-67, the production of H 2 increases still, but the evolution of CO reduces obviously, which thus disclose the different reaction pathways for CO and H 2 formations.Based on these observations, it is concluded that the mass transfer (the adsorption and diffusion) of the reactants to the catalytic centers is the main factor that determine the reaction rate when the co-catalyst is less than 0.1 mg in the catalytic system.While the co-catalyst is more than 0.1 mg, it is the electron-transfer kinetics that largely limits the reaction rate 60. The photocatalytic performance of such a hybrid system was evaluated under light irradiation with different incident wavelength.As presented in Fig. 7, the trend of the products is coincident with the light-absorbed spectrum of the Ru(bpy) 3 Cl 2 6H 2 O photosensitizer, rather than that of the ZIF-67 material.This result suggests that the CO 2 photoreduction reaction is indeed motivated by the photoexcitation of dye photosensitizer, generating excited electrons to implement tandem redox reactions, wherein the ZIF-67 co-catalyst effectively mediates the electron transport to reduce the pre-absorbed CO 2 molecules to CO. To highlight the superior function of the cobalt species spatially linked together by imidazolate motifs in ZIF-67 in promoting CO 2 conversion catalysis, we further synthesized the ZIF-8 material using the same ligand (2-methylimidazole) and zinc ions as the precursors, and the catalytic performance of ZIF-8 for boosting CO 2 reduction reaction was evaluated.As listed in Table 1, when ZIF-8 is utilized as a co-catalyst, no prominent co-catalytic effect is observed as compared to the cocatalyst-free system (Entry 2, Table S1).Additionally, some other typical MOFs (e.g.Cu-HKUST-1, Zr-UiO-66-NH 2 , Fe-MIL-101-NH 2 ) are also prepared and examined as co-catalysts for the photocatalytic CO 2 reduction system, but the CO 2 -to-CO reaction is not evidently supported.All these results underline that the cobalt species of ZIF-67 are essentially indispensable for promoting electron transport and then the CO 2 photoreduction catalysis in the current system. The flat band potential of ZIF-67 was determined to be ca.-0.73 V (vs.NHE, pH 7.0) (Fig. S5), which ensured its suitable redox ability to accept the excited electrons from the photosensitizer to operate CO 2 -to-CO transformation 61,62.The mechanism of the CO 2 photoreduction reaction was proposed as follows, under visible light irradiation, electrons photoinduced by the photosensitizer Ru-dye transferred to the ZIF-67 cocatalyst, and then the CO 2 molecules absorbed on ZIF-67 surface were reduced into CO.Meanwhile, the protons presented in the system could also be reduced by the excited electrons and produced H 2 .The excited state of the Ru-dye was quenched by TEOA serving as the sacrificial electron donor. A series of blank experiments were performed to demonstrate the essential of all components for the photoreduction of CO 2 reaction (Table S1).No CO or H 2 produces either in the dark (Entry 4, Table S1) or in the absence of dye (Entry 3, Table S1), indicating that the CO 2 reduction reaction is driven by visible light excitation of the photosensitizer.When the catalytic system is manipulated in Ar atmosphere (Entry 5, Table S1) under otherwise identical conditions, no any CO is detected, suggesting that the formed CO is originated from the reactant CO 2 , not the carbon-sources in the reaction system.This is further confirmed by 13 C-labelled isotropic experiment under the identical photoreaction conditions.As shown in Fig. 8, after reaction for 30 min, the peak at 3.3 min with the m/z value of 29 in the results of GC-MS analysis is assigned to 13 CO, validating that the carbon origin of the generated CO is the CO 2 feedstock."
  },
  {
    "title": "Conclusions",
    "content": "The rhombic dodecahedral microporous crystalline ZIF-67 was successfully synthesized through a simple co-precipitation method at the room temperature.The as-prepared zeolite imidazole framework ZIF-67 was used as a novel and efficient heterogeneous cobalt-based co-catalyst for the photocatalytic CO 2 reduction reaction.Under the optimal conditions, a high TON of 112 for the photocatalytic CO 2 reduction system were achieved after 30 min illumination.The 13 CO 2 isotropic experiments confirmed that the produced CO was originated from CO 2 .Intergrading the excellent electron-mediating function of cobalt species spatially confined by imidazolate motifs in the heterogeneous crystalline scaffolds of the MOFs, the ZIF-67 co-catalyst presented superb promotional effect for CO 2 photoreduction catalysis than other typical MOFs.Furthermore, the ZIF-67 sample showed superior activity stability.This work may bring some insights into the target-directed design of highly efficient catalysts/co-catalysts assembled from catalytically active metals with functional organic ligands for CO 2 photofixation and artificial photosynthesis. Fig. 1.XRD patterns of the as-prepared ZIF-67 sample.Inset: the sodalite topology of cubic ZIF-67. Fig. 2. SEM images (a, b), TEM image (c) and SAED pattern (d) of the ZIF-67 sample. Fig. 3. (a) N2 adsorption-desorption isotherms at 77 K, (b) the pore size distribution curve, (c) CO2 adsorption isotherm at 273 K and (d) TGA curves of the ZIF-67 sample. Fig. 4. (a) Co 2p high-resolution XPS and (b) UV-vis DRS spectra of the ZIF-67 sample. Fig. 5. Time-production plot of the CO generated from the photocatalytic CO2 reduction system.Insert: the stability test of the CO2 photoreduction system for eight repeated operations. Fig. 6.The influence of the ZIF-67 amount on the evolution of CO and H2. Fig. 7.The dependence of the wavelength of incident light on the evolution of CO and H2. Fig. 8. Gas chromatography and mass spectra (m/z 29) analyses of the carbon source of the generated CO in the photochemical reduction of 13 CO2. Photocatalytic CO2 reduction performance promoted with various MOFs. This work is financially supported by the National Basic Research Program of China (2013CB632405), the National Natural Science Foundation of China (21425309 and 2161101090), the National Key Technologies RD Program of China (2014BAC13B03), the Specialized Research Fund for the Doctoral Program of Higher Education (20133514110003) and the 111 project. Supplementary data associated with this article can be found, in the online version, at http://dx.doi.org/10.1016/j.apcatb.2017.03.018."
  }
]