[
  {
    "title": "Doi",
    "content": "10.1016/j.cattod.2017.09.025"
  },
  {
    "title": "Article_Title",
    "content": "Effect of Ag co-catalyst on CO2 adsorption states over Ga2O3 photocatalyst"
  },
  {
    "title": "Abstract",
    "content": "Ag species in the Ag loaded Ga 2 O 3 (Ag/Ga 2 O 3 ) photocatalysts were investigated with regard to changes in their structures and the chemical states before and after the photocatalytic CO 2 reduction with water.Ag clusters with the size of around one nanometer in as prepared 0.1 wt Ag/Ga 2 O 3 sample became larger metallic Ag nanoparticles with the size of several nanometers after the reaction.In the 1.0 wt Ag/Ga 2 O 3 sample, Ag nanoparticles having the AgGaO 2 interface structure decomposed to aggregated Ag metal particles after the reaction.Such transition in the morphology and chemical states of Ag species could explain the variations in photocatalytic activities of these samples during the reaction, and suggested that at least metallic Ag particles would function as effective co-catalysts.In-situ FT-IR measurements of the Ag/Ga 2 O 3 samples before and after the reaction, we could not detect CO 2 molecules adsorbing on metallic Ag nanoparticles in dark.Under light irradiation, however, the absorption bands originated from the photo-adsorbed CO 2 species on Ag metal nanoparticles appeared.Thus, we detected the interaction of CO 2 molecules and metallic Ag nanoparticles as the effective co-catalysts for CO 2 reduction."
  },
  {
    "title": "Experimental",
    "content": "Ag/Ga 2 O 3 samples were prepared by an impregnation method and a photodeposition method as reported previously 23.For the impregnation method, a mixture of a Ga 2 O 3 powder (Kojundo Chemical Laboratory Co. Ltd. purity 99.99) and an aqueous solution of AgNO 3 (Kishida Chemical Co. Ltd. purity 99.8) was magnetically stirred and dried up, followed by calcination at 673 K for 2 h, which provided the Ag/Ga 2 O 3 samples.The loading amounts of Ag were 0.1 and 1.0 wt.We also prepared Ga 2 O 3 samples loading metallic Ag nanoparticles by a photodeposition method.For the photodeposition method, a mixture of a Ga 2 O 3 powder and an aqueous solution of AgNO 3 with about 12 vol of methanol was magnetically stirred and photoirradiated with a 300 W Xe lamp for 3 h, followed by filtration.The loading amounts of Ag were 1.0 and 2.0 wt. In the HRTEM measurements, samples were mounted directly on a carbon covered copper mesh.A Cs-corrected S/TEM (JEOL, JEM-ARM 200F Cold) equipped with a thermal field-emission gun was operated at 200 kV.HAADF-STEM images were taken at almost just focus at a resolution of 1024 1024 pixels (0.021 0.021 nm 2 pixel -1 ). XAFS measurements were carried out at the beam line 6N1 at the Aichi Synchrotron Radiation Center as previously reported 23.Ag L 3edge XANES spectra of the samples were measured using a two crystal Ge(111) monochromator at room temperature in an atmospheric chamber with He gas.The data were recorded in a fluorescence X-ray yield mode with a silicon drift detector (Vortex Electronics) and in a total electron yield mode. Powder X-ray diffraction (XRD) patterns were recorded at room temperature on a MiniFlex600 (Rigaku) using Cu K as the radiation source with an operating voltage of 40 kV and current of 15 mA. Diffuse reflectance (DR) UV-visible spectrum was recorded at room temperature on a JASCO V-670 equipped with an integrating sphere covered with BaSO 4 , where the BaSO 4 was used as the reference. 2.6.In situ FT-IR measurements FT-IR spectra were recorded with a FT/IR-6100 (JASCO) in a transmission mode at room temperature.A sample (ca.20 mg) was pressed into a disk (diameter: 10 mm) at 50 MPa and placed in an insitu IR cell equipped with CaF 2 windows.The cell allowed us to obtain the spectra of the samples in a CO 2 atmosphere as well as under light irradiation.Before the measurements, the samples were evacuated at room temperature for 2 h.For each spectrum, the data from 6 scans were accumulated at a resolution of 4 cm -1 . Reaction tests for photocatalytic CO 2 reduction with water were conducted in a specially designed gas-liquid-solid three phase reactor as follows: Before the reaction test, the Ag/Ga 2 O 3 powder (0.1 g) in the reactor was irradiated from a 300 W Xe lamp for one hour under CO 2 gas with a flow rate of 3.0 mL/min, where the light intensity measured in the range of 254 10 nm was 11 mW/cm 2 .Then 10 mL of 1.0 M NaHCO 3 aqueous solution was added to this reactor cell in dark.After one hour, the background was measured with an online gas chromatograph with thermal conductivity detector (GC-TCD, Shimadzu GC-8APT).Subsequently, photocatalytic reduction of CO 2 under photoirradiation was started and CO, H 2 and O 2 production rates were measured every hour with the GC-TCD up to five repetitions.Selectivity for CO in the reduced products was defined as follows: CO selectivity () 100 (production rate of CO)/(Sum of production rates of CO and H 2 )."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The prepared 0.1 wt Ag/Ga 2 O 3 and 1.0 wt Ag/Ga 2 O 3 samples were examined for the photocatalytic reduction of CO 2 with water.The products observed in the present study were CO, H 2 and O 2 , where CO was the reduction product from CO 2 and H 2 was produced by water splitting as a competitive reaction 9,10.Fig. 1 shows the time courses of CO, H 2 and O 2 production rates over the 0.1 wt Ag/Ga 2 O 3 sample.The evolution of O 2 was lower than a half of total rates of H 2 and CO.However, the production rates of O 2 was higher than that produced by water splitting, supporting that photocatalytic CO 2 reduction using water as the electron donor actually proceeded.Oxygen might be dissolved in the aqueous solution or adsorbed on the surface of the photocatalyst in the present reaction condition.As shown in Fig. 1, CO production rate gradually decreased while the production rates of H 2 and O 2 gradually increased with reaction time, and they became almost constant after 5 h.Fig. 2 shows the time courses of the photocatalytic activities of the 1.0 wt Ag/Ga 2 O 3 photocatalyst.All the production rates of CO, H 2 and O 2 were lower than those for the 0.1 wt Ag/Ga 2 O 3 sample.These production rates increased gradually to constant values with reaction time.Thus, the production rates of CO, H 2 and O 2 and the corresponding CO selectivities for both 0.1 wt Ag/Ga 2 O 3 and 1.0 wt Ag/Ga 2 O 3 samples changed in the initial stage of reaction and became almost constant after 5 h.These results would derive from the change in the structural and chemical state of the Ag co-catalysts during the reaction. In our previous study, we reported the results of HRTEM and XAFS measurements for the as prepared Ag/Ga 2 O 3 photocatalysts as follows 23; in the 0.1 wt Ag/Ga 2 O 3 sample prepared by the impregnation method, Ag clusters with the size of around one nanometer were loaded on a Ga 2 O 3 photocatalyst.In the 1.0 wt Ag/Ga 2 O 3 sample, Ag nanoparticles with the size of several nanometers were predominantly observed, although a few Ag clusters also existed.Among the Ag nanoparticles, we found several flat particles having a large interface with the Ga 2 O 3 support.On the other hand, the curve-fitting analysis for Ag K-edge EXAFS of the 0.1 wt Ag/Ga 2 O 3 sample showed that small Ag clusters are metallic since the distance of the AgeAg bond was the same as that of a metal Ag reference sample.As for the 1.0 wt Ag/Ga 2 O 3 sample, the curve-fitting analysis revealed the coexistence of Ag metal and AgGaO 2 structures, therefore, we concluded the Ag-Ga composite oxide (AgGaO 2 ) corresponded to the interface between Ag species and the Ga 2 O 3 support. In the present study, we investigated structures of Ag co-catalyst after the photocatalytic reduction of CO 2 with water for 5 h.Fig. 3 shows the HAADF-STEM images of the Ag/Ga 2 O 3 photocatalysts after the reaction as examples.The Ag particles with the size of several nanometers were predominantly observed in the 0.1 wt Ag/Ga 2 O 3 photocatalyst (Fig. 3(a)), suggesting that Ag clusters increased in size by several nanometers after the reaction.In the case of 1.0 wt Ag/ Ga 2 O 3 photocatalyst, Ag particles aggregated and became larger particles to the size of hundreds of nanometers after the reaction.However, some of the flat particles observed before the reaction still remained, as shown in Fig. 3(b).After the reaction, size distributions of Ag particles were obviously shifted to the larger particle size in addition to the conformation of several large particles which could not be seen before the reaction both in the 0.1 wt and 1.0 wt samples. We also investigated the change in the chemical states of Ag cocatalysts before and after the reaction by Ag L 3 -edge XANES analysis, since L 3 -edge XANES arises mainly from the excitation of the 2p 3/2 core level electron into the unoccupied states of d character above the Fermi level, which sensitively reflects the electronic states of Ag species. Fig. 4 shows the XANES spectra of the 0.1 wt Ag/Ga 2 O 3 photocatalysts before and after the reaction together with reference samples.The XANES spectrum of the sample before the reaction resembled the spectrum measured for small Ag clusters 24, which corresponds to the result obtained by the HRTEM measurements.In the XANES spectrum, fine structures at 3370-3400 eV characteristics of a bulk Ag reference sample (Ag foil) were not observed, and we also confirmed that the broad XANES feature could not be reproduced by simply imposing the spectra of several Ag reference samples.On the other hand, XANES spectrum of the sample after the reaction was very similar to that of an Ag foil, indicating that Ag species were almost metallic after the reaction. Fig. 5 shows the Ag L 3 -edge XANES spectra of the 1.0 wt Ag/ Ga 2 O 3 photocatalysts before and after the reaction.The spectrum of the sample before the reaction was similar to that of an Ag foil except a part of the edge around 3350 eV.This XANES feature exhibited that the Ag species partially consisted of Ag-Ga composite oxide like an AgGaO 2structure, because this spectrum could be reproduced by imposing the spectra of Ag foil and AgGaO 2 samples.After the reaction, XANES spectrum of the sample was consistent with that of an Ag foil, suggesting that most of the Ag species turned metallic after the reaction. In addition, we could confirm such changes in the morphology and chemical states of Ag co-catalysts for the 1.0 wt Ag/Ga 2 O 3 photocatalyst by other characterization methods.Fig. 6 shows DR UV-visible spectra of the 1.0 wt Ag/Ga 2 O 3 samples before and after the reaction.The large absorption with an onset at ca. 280 nm is due to the band gap transition of the Ga 2 O 3 support.Note that shoulder bands at 270-330 nm due to Ag clusters and/or small nanoparticles were found before the reaction while a broad band around 450 nm assignable to a localized surface plasmon resonance (LSPR) of metallic Ag nanoparticles was observed after the reaction.Fig. 7 shows XRD patterns of the 1.0 wt Ag/Ga 2 O 3 samples before and after the reaction together with reference sample of -Ga 2 O 3 .In addition to the diffraction peaks due to the -Ga 2 O 3 support, a small diffraction peak at 28.9assigned to -AgGaO 2 crystal phase was observed for the as prepared sample.This peak almost disappeared and the shoulder peaks at 38.1 and 44.2of a metallic silver crystal phase appeared after the reaction.These results supported the coexistence of Ag-Ga composite oxide and small Ag nanoparticles/clusters in the as-prepared 1.0 wt Ag/Ga 2 O 3 sample and the formation of larger Ag particles after the reaction. Here, based on the characterization mentioned above, the transition in the morphology and chemical states of the Ag co-catalyst during the reaction is summarized and illustrated in Figs. 8 and9.In the 0.1 wt Ag/Ga 2 O 3 sample, small Ag clusters of around 1 nm mainly existed before the reaction while they aggregated and became larger metallic nanoparticles after the reaction.In the 1.0 wt Ag/Ga 2 O 3 sample, Ag nanoparticles/clusters and flat nanoparticles partially consisting of Ag-Ga composite oxide existed before the reaction.After the reaction, they turned into large metallic particles, although a small amount of the flat particles would still remain. Such transition in the morphology and chemical states of the Ag cocatalyst during the reaction might explain the change in the activity and selectivity for CO production of the Ag/Ga 2 O 3 samples during the reaction.In the 0.1 wt Ag/Ga 2 O 3 sample, CO production rate gradually decreased and H 2 production rate gradually increased with reaction time.The decrease of CO production rate seems to relate to the aggregation of Ag clusters and the increase of H 2 production rate would be owing to the subsequent exposure of the Ga 2 O 3 surface, which is likely the active site for H 2 production.In addition, some workers reported that aggregated Ag nanoparticles would promote H 2 O reduction rather than CO 2 reduction 9,25.As for the 1.0 wt Ag/Ga 2 O 3 sample, it is speculated that the gradual increase of both CO and H 2 productions derived from the decomposition of Ag-Ga composite oxide which is likely the inactive component for CO and H 2 productions.That is, photogenerated holes and electrons would be initially consumed to decompose the composite oxide to metallic Ag nanoparticles, and simultaneously the Ga 2 O 3 surface was exposed.Although in the present study, we did not discuss which sizes of Ag nanoparticles were effective for the CO production from our HRTEM measurements, we can conclude that at least metallic Ag clusters and nanoparticles would function as effective co-catalysts for CO production. The characterization of Ag co-catalyst mentioned above indicated that the reaction mechanism might change during the reaction.Therefore, the analysis for the adsorbed CO 2 species in Ag/Ga 2 O 3 samples after the reaction should be necessary for understanding the mechanism of CO production from CO 2 in detail.Here, we compared the chemical states of adsorbed CO 2 species in Ag/Ga 2 O 3 samples before and after the reaction by in-situ FT-IR measurements.Fig. 10 shows difference IR spectra of the adsorbed species after the introduction of 45 Torr of CO 2 .These spectra were obtained by subtracting the background spectrum of the sample before the introduction of CO 2 .The bands at 1635 and 1420 cm -1 are assigned to asymmetric CO 3 stretching vibration and symmetric CO 3 stretching vibration modes of monodentate bicarbonate species 26272829.And the bands at 1590 and 1320 cm -1 are ascribed to asymmetric and symmetric CO 3 stretching vibration modes of bidentate carbonate species 262728.These bands were observed in all of the spectra, indicating that CO 2 molecules would adsorb on Ga 2 O 3 to form these species.CO 2 molecules would react with the surface hydroxyl group and the surface lattice oxygen of Ga 2 O 3 to form the bicarbonate and carbonate species, respectively 30,31.On the other hand, the bands around 1510 and 1350 cm -1 are assigned to asymmetric and symmetric CO 3 stretching vibration modes of monodentate carbonate species 26,323334.These bands were observed only for the 1.0 wt Ag/Ga 2 O 3 sample before the reaction.This species would be formed on Ag-Ga composite oxide.After the reaction (Fig. 10(d-f)), only the monodentate bicarbonate and bidentate carbonate species which adsorbed on Ga 2 O 3 were observed.Considering the results reported by Stuve et al. that the pre-adsorption of O 2 molecules was required for the CO 2 adsorption on a clean surface of an Ag single crystal 35, CO 2 molecules might not adsorb on metallic Ag nanoparticles in a similar manner.As mentioned above, since Ag species were almost metallic after the reaction, we could not detect CO 2 molecules adsorbing preferentially on metallic Ag nanoparticles in the present samples. From the results for the photocatalytic reaction tests, the active species for CO 2 reduction to CO seems to be Ag metal nanoparticles.Supposing the reduction of CO 2 proceeded on the Ag metal nanoparticles, it is naturally expected that CO 2 species were adsorbed on the Ag metal nanoparticles during the reaction.However, adsorbed CO 2 species on Ag metal nanoparticles were not observed in the FT-IR measurements in dark.Therefore, we attempted to detect the adsorbed CO 2 species on Ag metal nanoparticles by conducting in-situ FT-IR measurement under light irradiation.For this experiment, we prepared Ag/Ga 2 O 3 samples by photodeposition method which can load metallic Ag nanoparticles simply on Ga 2 O 3 supports regardless of the Ag loading amount. Fig. 11 shows difference IR spectra of the adsorbed species on the 1.0 wt Ag/Ga 2 O 3 photocatalyst under UV light irradiation in a CO 2 atmosphere of 45 Torr.These spectra were obtained by subtracting the spectrum before the irradiation from those at different irradiation times.The absorption band at 1640 cm -1 , which is assigned to deformation vibration of H 2 O, decreased with the light irradiation time.However, this band increased as it was sometime after stopping light irradiation.Therefore, the decrease of the band at 1640 cm -1 would correspond to a temporal desorption of H 2 O molecules by the optical heating.The band around 1420 cm -1 also decreased with the light irradiation time but did not increase after stopping light irradiation.In addition, the decrease of the band at 1635 cm -1 was confirmed after stopping light irradiation, although this was not obvious due to the decrease of the large band of H 2 O at 1640 cm -1 under light irradiation.The bands at 1635 cm -1 and 1420 cm -1 , which are assigned to the vibration modes of monodentate bicarbonate species, decreased with light irradiation and did not recover even when light irradiation was stopped.Monodentate bicarbonate species would convert to another species such as bidentate formate species at their adsorption sites, otherwise the hydroxyl groups adsorbing monodentate bicarbonate species decreased by light irradiation.On the other hand, a broad band increasing gradually toward lower wavenumber was recognized.The band was due to the infrared absorption of the excited free electrons in the conduction bands of Ga 2 O 3 or the shallowly trapped electrons below the conduction bands 36,37.These changes in FT-IR spectra mentioned above were observed for both Ga 2 O 3 and Ag/Ga 2 O 3 samples. Fig. 12 compares difference IR spectra of the adsorbed species on the bare Ga 2 O 3 , 1.0 wt Ag/Ga 2 O 3 and 2.0 wt Ag/Ga 2 O 3 photocatalysts under continuous UV light irradiation for 30 min in a CO 2 atmosphere of 45 Torr.Note that the absorption bands around 1500 and 1300 cm -1 increased with the irradiation time for Ag/Ga 2 O 3 photocatalysts.The increase of the absorption bands around 1500 and 1300 cm -1 was not observed for the bare Ga 2 O 3 photocatalyst.Furthermore, the absorption bands in this wavenumber region were larger for the 2.0 wt Ag/Ga 2 O 3 photocatalyst than the 1.0 wt Ag/Ga 2 O 3 photocatalyst.We also found this increasing in the absorption did not occur in the absence of CO 2 in the system and depended on the partial pressure of CO 2 .Therefore, the absorption bands must be originated from the CO 2 species adsorbed on Ag metal nanoparticles under UV light irradiation.At the present stage, this photo-adsorbed CO 2 species would be roughly assigned to CO 3 species based on the wavenumber of the bands.Thus, we first succeeded in detecting the interaction of CO 2 molecules and metallic Ag nanoparticles as the effective co-catalysts for CO 2 reduction."
  },
  {
    "title": "Conclusions",
    "content": "In the present study, we investigated structures and the chemical states of Ag species in Ag/Ga 2 O 3 photocatalysts after the photocatalytic reduction of CO 2 with water.HRTEM measurements revealed that Ag species aggregated and became larger nanoparticles in both the 0.1 wt Ag/Ga 2 O 3 and the 1.0 wt Ag/Ga 2 O 3 photocatalysts after the reaction.Ag L 3 -edge XANES measurements revealed that these aggregated Ag nanoparticles were metallic. Such transition in the morphology and chemical states of the Ag cocatalyst during the reaction would affect the activity and selectivity for CO 2 reduction over the Ag/Ga 2 O 3 samples during the reaction.The time course of the photocatalytic activity for the 0.1 wt Ag/Ga 2 O 3 photocatalyst indicated that CO production rate gradually decreased by the aggregation of Ag nanoparticles, while H 2 production rate gradually increased by the promotion of H 2 O reduction due to the exposed Ga 2 O 3 surface and/or the aggregated Ag nanoparticles.As for the 1.0 wt Ag/ Ga 2 O 3 photocatalyst, on the other hand, CO and H 2 production rates increased as a result of the gradual decomposition of Ag-Ga composite oxide.These results demonstrated that the reaction mechanism might change during the reaction and at least metallic Ag particles function as effective co-catalysts for CO production. In the FT-IR measurements of the Ag/Ga 2 O 3 photocatalysts before and after the reaction, we could not detect CO 2 molecules adsorbing preferentially on metallic Ag nanoparticles in dark.However, the absorption bands around 1500 and 1300 cm -1 increased under light irradiation only for metallic Ag loaded Ga 2 O 3 photocatalysts, not for the bare Ga 2 O 3 .This photo-adsorbed CO 2 species would be assigned to CO 3 species, while the details of the adsorption states and adsorption mechanisms of the photo-adsorbed CO 2 species are unclear at the present stage.These are important research topics in our future works to really understand the functions of Ag co-catalysts for the photocatalytic reduction of CO 2 with water. Fig. 1.The time courses of CO, H 2 and O 2 production rates in the photocatalytic reduction of CO 2 with water over the 0.1 wt Ag/Ga 2 O 3 photocatalyst. Fig. 2. The time courses of CO, H 2 and O 2 production rates in the photocatalytic reduction of CO 2 with water over the 1.0 wt Ag/Ga 2 O 3 photocatalyst. Fig. 3. HAADF-STEM images of the (a) 0.1 wt Ag/Ga 2 O 3 photocatalyst after the reaction and (b) 1.0 wt Ag/Ga 2 O 3 photocatalyst after the reaction. Fig. 4. Ag L 3 -edge XANES spectra of the 0.1 wt Ag/Ga 2 O 3 photocatalyst before and after the reaction together with reference samples.Fig. 5. Ag L 3 -edge XANES spectra of the 1.0 wt Ag/Ga 2 O 3 photocatalyst before and after the reaction together with reference samples. Fig. 6.DR UV-visible spectra of the 1.0 wt Ag/Ga 2 O 3 photocatalysts (a) before and (b) after the reaction. Fig. 7. XRD patterns of (a) Ag (JCPDS Card No. 4-783), (b) -AgGaO 2 (JCPDS Card No. 01-070-9348), (c) -Ga 2 O 3 and 1.0 wt Ag/Ga 2 O 3 photocatalysts (d) before and (e) after the reaction. Fig. 8. Schematic diagram of the changes in the Ag species on the 0.1 wt Ag/Ga 2 O 3 photocatalyst during the reaction. Fig. 9. Schematic diagram of the changes in the Ag species on the 1.0 wt Ag/Ga 2 O 3 photocatalyst during the reaction. Fig. 10.Difference FT-IR spectra of the (a) Ga 2 O 3 before the reaction, (b) 0.1 wt Ag/ Ga 2 O 3 before the reaction, (c) 1.0 wt Ag/Ga 2 O 3 before the reaction, (d) Ga 2 O 3 after the reaction, (e) 0.1 wt Ag/Ga 2 O 3 after the reaction and (f) 1.0 wt Ag/Ga 2 O 3 after the reaction. Fig. 11.Difference IR spectra of the adsorbed species on the 1.0 wt Ag/Ga 2 O 3 photocatalyst under light irradiation in a CO 2 atmosphere of 45 Torr.These spectra were recorded at the light irradiation times of 1, 5, 10, 20 and 30 min. Fig. 12. Difference IR spectra of the adsorbed species on the (a) bare Ga 2 O 3 , (b) 1.0 wt Ag/Ga 2 O 3 and (c) 2.0 wt Ag/Ga 2 O 3 photocatalysts under continuous light irradiation for 30 min in a CO 2 atmosphere of 45 Torr. This work was supported by a Grant-in-Aid for Scientific Research (No. 16J06079 and H15H00871) from the Japan Society for the Promotion of Science (JSPS).Synchrotron experiments were carried out at the Aichi Synchrotron Radiation Center (No. 201603005).HRTEM measurements were supported by Nagoya University microstructural characterization platform as a program of \"Nanotechnology Platform\" of the Ministry of Education, Culture, Sports, Science and Technology (MEXT), Japan."
  }
]