[
  {
    "title": "Doi",
    "content": "10.1016/j.jcou.2020.101262"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic CO2 reduction over postcalcinated atomically thin TiO2 nanosheets: Residual carbon removal and structure transformation"
  },
  {
    "title": "Abstract",
    "content": "Postcalcination has usually been used to remove organic residues from atomically thin two-dimensional (2D) semiconductor materials for CO 2 photoreduction, while the effect of calcination on their structure and photocatalytic activity has remained unclear yet.In this work, the structure transformation of atomically thin 2D TiO 2 (B) nanosheets during calcination was analyzed, and the structure-function relationship was studied.The results show that after calcination at 350 C in air for 10 h, hierarchical assembly of 2D TiO 2 (B) nanosheets was collapsed into a uniform structure and the TiO 2 (B) nanosheets were decomposed into interconnected highcrystallinity anatase nanoparticles.The morphology/phase transformation enhanced the chemical binding and activation of CO 2 , and promoted the transfer/separation of photogenerated charges, resulting in the improved CO 2 photoreduction activity.This work aimed to show the importance of precise control over the postcalcination treatment for atomically thin 2D materials."
  },
  {
    "title": "Experimental",
    "content": "Ultrathin 2D TiO 2 nanosheets, with atomic thickness, were prepared through a solvothermal approach reported elsewhere 20.Typically, 2.1 g of titanium isopropoxide was added to 1.48 g concentrated HCl solution under vigorous magnetic stirring (solution A).Then, 0.4 g of polyethylene oxide-polypropylene oxide-polyethylene oxide (PEO20-PPO70-PEO20, Pluronic P123) was dissolved in 6 g ethanol (solution B) and stirred for 15 min.Next, solution A was dropped into solution B under stirring for another 30 min.Afterwards, 5 mL of the mixed solution was transferred into a 100 mL autoclave together with 40 mL of ethylene glycol, which was heated at 150 C for 20 h.The solid products of the solvothermal reaction were separated by centrifugation and washed with deionized water and ethanol several times.Finally, after drying at 80 C for 24 h, the obtained white powder was collected and denoted as TiO 2 -0. A series of conditioned calcinations at different temperatures, gas atmospheres and treatment durations were adopted to remove ethylene glycol and other possible carbon species from the TiO 2 -0 sample (Table S1).All treatments were performed in a tube furnace under a 200 mL/ min gas flow with a heating rate of 1 C/min.On the premise of organic residue removal, three samples treated at 350 C for different durations and gas atmospheres were selected as photocatalysts.To simplify the presentation, the samples treated under the conditions of 350 C/O 2 / 2 h, 350 C/Air/4 h and 350 C/Air/10 h were denoted as TiO 2 -2, TiO 2 -4 and TiO 2 -10, respectively. For all TiO 2 -X (X 0, 2, 4, and 10) samples, X-ray diffraction was performed on an Empyrean diffractometer using Cu K radiation ( 0.1542 nm) in the range of 10-80.Raman spectroscopy and photoluminescence (PL) spectroscopy were both performed on a confocal laser LabRAM HR800 instrument at ambient temperature.The N 2 and CO 2 adsorption-desorption isotherms were both tested on an ASAP 2020 instrument from Micromeritics.Transmission electron microscopy (TEM) images were recorded on a FEI Talos F200X instrument.Scanning electron microscopy (SEM) images were obtained on a Zeiss Gemini 300 instrument.X-ray photoelectron spectra (XPS) were obtained by using Shimadzu/KRATOS AXIS-ULTRA DLD-600W equipment with Al/Mg K radiation.The electrochemical impedance spectra (EIS) were acquired in a three-electrode quartz cell with a 0.1 mol/L Na 2 SO 4 electrolyte solution, a platinum wire was used as the counter electrode, an Ag/AgCl electrode was used as the reference electrode, and ITO glass (1 cm 1 cm) coated with the dispersed sample served as the working electrode. Temperature programmed CO 2 desorption (TPD-CO 2 ) was performed to study the interaction between catalysts and CO 2 .In detail, a quartz tube reactor with 100 mg of catalyst loaded was first heated up to 300 C (15 C min -1 ) for 1 h under ultra-high purity He flow (30 mL min -1 ) and then cooled to ambient temperature.After that, CO 2 flow (30 mL min -1 ) passed through the catalyst bed for 1 h, followed by He flow (30 mL min -1 ) flushed for 1 h.The TPD analysis was finally performed under He flow (30 mL min--1 ) with the reactor heating up to 750 C at 10 C min -1 .The effluent gas flow was monitored by a TCD detector. A Nicolet iS50 spectrometer (Thermo Fisher) with a Praying Mantis DRIFTS accessory was used to perform in situ the diffuse reflectance infrared Fourier-transform spectroscopy (DRIFTS) of CO 2 and H 2 O coadsorption as well as the reaction intermediates on the catalysts (Fig. S1).The IR reaction chamber (Harrick Scientific, HVC-DRP) was equipped with two ZnSe windows and a quartz window for IR-and UVlight transmission.A 300 W Xe arc lamp was used as the UV-light source.In a typical process, after outgassing the internal air with ultrapure N 2 flux at a flow rate of 150 mL/min for 1 h, the IR spectrum was first collected as the background and was subtracted from the subsequent data collection.Afterwards, a mixture of CO 2 and H 2 O vapor was introduced to the IR reaction chamber for 60 min in the dark to investigate CO 2 and H 2 O adsorption.The photocatalytic activation/ conversion of adsorbed CO 2 species was studied under UV-light irradiation subsequently. Photocatalytic CO 2 reduction experiments were performed at 120 C under UV-light irradiation in a continuous-flow reactor, as reported in our previous work 29.A 300 W Xe lamp was employed to obtain the UV light (300 nm 400 nm, 5.0 mW/cm 2 ).Typically, 20 mg of the catalyst was transferred to a Petri dish (diameter, 35 mm), dispersed ultrasonically by 5 mL of deionized water, and dried at 100 C to evaporate water.Prior to the experiment, the samples were exposed to ambient air and irradiated under UV-light overnight to remove any possible trace of contamination on the samples.Ultrapure CO 2 (99.999 ) was passed through a water bubbler to generate a mixture of CO 2 and water vapor.Prior to illumination, the reactor was first purged with the CO 2 and H 2 O mixture at a flow rate of 300 mL min -1 for 1 h to outgas the air, and then, at 5 mL min -1 for another 30 min to stabilize the flow.Afterwards, the Xe lamp was turned on to start the experiment.A GC equipped with a flame ionization detector (FID), a thermal conductivity detector (TCD), and a methanizer was employed to analyze the concentrations of H 2 , CO, and hydrocarbons in the exhausting gas every 30 min. Before the experiment of TiO 2 -X (X 2, 4, and 10), a blank control group was examined to exclude any carbon source in the system other than CO 2 during the photocatalytic reaction.First, a mixture of CO 2 and water vapor, as the reaction gases, was employed using: an (1) empty reactor and (2) reactor with an empty Petri dish to conduct the test.In these two cases, no carbon-containing compounds were detected, whether in the dark or under UV irradiation, which demonstrated that the photocatalyst was necessary for CO 2 reduction to proceed.Second, the reaction gases were replaced by a mixture of N 2 (instead of CO 2 ) and water vapor in the presence of each photocatalyst.Similarly, no carbon-containing compounds were detected under UV irradiation, indicating that the CO 2 served as the only carbon source.To exemplify the influence of organic residues for CO 2 photoreduction, the control experiment of TiO 2 -0 had also been conducted only with the supply of the mixture of water vapor and nitrogen rather than the mixture of water vapor and CO 2 ."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Fig. S2 gives the results of TiO 2 -0 under UV light irradiation with the supply of the mixture of N 2 and water vapor for 16 h.The production rates of CO and CH 4 on TiO 2 -0 reached their highest points at over 5.5 mol g -1 h -1 and 1.5 mol g -1 h -1 within the second hour, respectively, and then declined at a decreasing rate.After 8 h irradiation, both of the production rates of CO and CH 4 decreased to less than 50 of their utmost, and after 16 h irradiation, the production rates, far less than their utmost, remained about 1.0 mol g -1 h -1 for CO and about 0.1 mol g -1 h -1 for CH 4 , respectively, the results suggested that it was very difficult to remove the organic substances through UV light irradiation, and the remarkable yields of CO and CH 4 under the CO 2 free condition indicated that the products on TiO 2 -0 were indeed derived from organic residues.Therefore, to exclude the misinformation, postcalcination with several different conditions were performed, and from which three catalysts with organic residues eliminated were selected for further study. Fig. S3 shows the colors of the TiO 2 samples after the calcination under different conditions.The white TiO 2 -0 sample turned black after being treated at 500 C in a N 2 atmosphere for 4 h, which indicated that the surface carbon species could hardly be removed in a N 2 atmosphere (Fig. S3a-b).The transformation of the carbon species in the TiO 2 -0 sample under increasing temperature was analyzed by in situ DRIFTS in a N 2 atmosphere (see Fig. S4a).The bands at 2948 cm -1 and 2881 cm -1 were assigned to the symmetric vibrations of HeCeH species 30, while those at 1723 cm -1 and between 1590-1380 cm -1 were derived from (CO) and as (COO) and s (COO), respectively 31,32.The IR spectra of the samples treated at 350 C varied from those treated below 350 C; probably transformed from the CeO in ethylene glycol, the CO species appeared at 250 and 300 C but were absent at and over 350 C together with as (CH 2 ), suggesting the sufficient dehydrogenation of HeCeH and the oxygenation of CO species. After treatment in an air or O 2 atmosphere at a temperature below 350 C, the TiO 2 -0 samples exhibited various colors, suggesting the insufficient removal of surface carbon species (Fig. S2c-f).While after being treated at 350 C in O 2 for 2 h or in air for 4 h, the samples recovered to white (Fig. S3g-i), the TGA (thermogravimetric analysis) curve (Fig. S4b) and the mass loss (Table S1) also verified the heavy oxidation of the carbon species at 350 C in O 2 for 2 h or in air for longer.Based on the results of the IR spectra, TGA curve, and mass and color variations of the samples calcined under different conditions, it could be concluded that the organic residues on the TiO 2 -0 sample were sufficiently removed after calcination at 350 C/O 2 /2 h, 350 C/Air/4 h, and 350 C/Air/10 h, respectively.Fig. 1a shows the schematic diagram of the transformation of atomically thin TiO 2 nanosheets during calcination.The SEM and TEM images in Fig. S4a show that the TiO 2 -0 sample was hierarchically assembled by ultrathin 2D TiO 2 nanosheets and exhibited a flower-like morphology.The HR-TEM images in Fig. 1b show that these TiO 2 nanosheets, with a size of 100-200 nm, consisted of stacks of several TiO 2 monolayers, and the distance between the monolayers was confirmed to be 0.68 nm from the edge wrinkles of the nanosheet.The exposed facets of these TiO 2 -0 nanosheets were TiO 2 (B) 1-1 0 according to the lattice fringes 33.TiO 2 -2 and TiO 2 -4 samples also exhibited flower-like morphologies, despite the nanosheets being thickened and crimped due to the surface torsion effect (Fig. S5c-f).As plotted by red circle, anatase of small areas could be identified on TiO 2 -2 and TiO 2 -4 nanosheets in the HR-TEM images (Fig. 1c-d), suggesting the 3D growth and partial phase transformation from TiO 2 (B) to anatase proceeded during calcination 25.Additionally, the perpendicular lattice fringes of anatase 101 and 1 0-1 elucidated the mainly exposure of its 010 facet.However, a substantial number of anatase nanoparticles and nanorods plotted in the TiO 2 -10 sample (Fig. 1e and Fig. S5h) corresponding to the XRD and Raman analysis that the TiO 2 -10 was primarily constituted by anatase transformed from TiO 2 (B).Although the sheet-like morphology was mainly kept in TiO 2 -10, the nanosheets were no longer hierarchically assembled into the flower structure but decomposed into nanorods and interconnected nanoparticles (Fig. S5g-h), and the meso-macroporous structure of TiO 2 -0 was broken down.In brief, the atomically thin TiO 2 (B) nanosheets finally transformed into the interconnected nanoparticles and nanorods through a 3D growth and phase transformation. The textural properties of the samples including the BET surface area, pore volume, and pore size were characterized by using N 2 adsorption, and the results are shown in Fig. 3 and summarized in Table 1.All of the samples showed the type IV N 2 adsorption-desorption isotherm curves with H3 strip hysteresis loops (Fig. 2a), which demonstrated the disordered porous structure and broad pore size distribution of the samples 34.Fig. 2b gives the corresponding pore size distribution curves for the TiO 2 samples.TiO 2 -0 exhibited a meso-macroporous structure with two characteristic pores approximately 45 nm and 90 nm in size, and combined with the SEM images, these features were assigned to the gaps among the hierarchical nanosheets and the flower nanostructures, respectively.TiO 2 -2 and TiO 2 -4 exhibited pore structures similar to that of TiO 2 -0, while TiO 2 -10 showed a homogeneous pore distribution in the range of 10-160 nm.The average pore volume of TiO 2 -10 decreased drastically to 0.37 cm 3 g -1 , approximately one-third that of the other samples, indicating the collapse of the TiO 2 nanosheet pore structure.As summarized in Table 1, the BET surface areas of TiO 2 -2 and TiO 2 -4 were both lower than that of TiO 2 -0, and TiO 2 -10 exhibited the lowest specific surface area with only approximately a quarter of TiO 2 -0, which meant that prolonged calcination induced the decreased BET surface area.The results could be attributed to the morphology change of the nanosheets including the collapse, split and aggregation of the TiO 2 nanosheets discussed above; meanwhile the phase transformation from the open-channel-structure TiO 2 (B) to the compact anatase phase could cause the decrease in specific surface area 14. The XRD patterns of the samples are shown in Fig. 2c.The pattern of TiO 2 -0 was consistent with that of the TiO 2 (B) phase, and the peaks attributed to other TiO 2 phases could hardly be observed 35.TiO 2 (B) is well-known as a metastable phase that could be transformed into anatase at thermal treatments over 200 C 25.Compared with TiO 2 -0, several new peaks corresponding to the anatase phase appeared at 2 37.8, 53.9, 55.1, 62.7and 75.1in the TiO 2 -2 sample, indicating a phase transformation from TiO 2 (B) to anatase during the calcination process 14.TiO 2 -4 exhibited a negligible difference in phase composition when compared with that of TiO 2 -2.Next to the other TiO 2 samples, the anatase peaks of TiO 2 -10 were enhanced sharply in intensity, indicating a high crystallinity and greatly increased anatase proportion.As shown in the magnified XRD patterns (Fig. 2d), the peak at 24.8of TiO 2 -0 was shifted toward the higher angle of 25.2f or TiO 2 -10, which demonstrated the increase in the proportion of anatase phase with prolonged calcination. The phase compositions of the samples were further distinguished by Raman spectra (Fig. S6a).The spectrum of TiO 2 -0 was consistent with that of TiO 2 (B) in terms of 2D morphology, and no peaks corresponding to 3D TiO 2 (B) at 123 cm -1 and 145 cm -1 were observed due to the dimensional confinement effect 25,35.Compared with TiO 2 -0, several new bands occurred in the TiO 2 -2 spectrum.The bands at 123 cm -1 and 250 cm -1 were assigned to the B g vibrations of 3D TiO 2 (B), while the bands at 145 cm -1 and 197 cm -1 originated, respectively, from the superposition of the E g vibration of anatase and the A g vibration and from the integration of the anatase E g and TiO 2 (B) B g vibrations 36.The results demonstrated that the phase transformation from TiO 2 (B) to anatase as well as the 3D growth of ultrathin nanosheets proceeded during 2 h of the calcination process of TiO 2 -0.The only difference between the TiO 2 -2 and TiO 2 -4 spectra laid in the relative intensity of the band at 145 cm -1 to the band at 197 cm -1 , which was due to the higher anatase phase proportion in TiO 2 -4 37.Moreover, with distinctly enhanced peak intensity, TiO 2 -10 exhibited an almost identical spectrum to that of anatase except for the weak band at 123 cm -1 (Fig. S6b), suggesting that the vast majority of TiO 2 (B) had transformed into a well-crystallized anatase phase after 10 h calcination.The above results were agreed well with the XRD analysis that 2e, compared with TiO 2 -0, a shift of approximately 0.1-0.2eV toward higher binding energy could be observed for the samples after calcination, indicating the stronger electron transfer from Ti to O atoms in the latter.This effect probably resulted from the crystal structure of the surface-dominated 2D TiO 2 -0 nanosheets differing from that of the calcined samples containing bulk atoms 38,39.Contrary to the Ti 2p spectra, the binding energy of O 1s exhibited a negative shift with the extended calcination (Fig. 2f), and this also indicated the electron transfer from titanium atoms to surrounding oxygen atoms.The high-resolution O 1s XPS of all the samples could be deconvoluted into two peaks, the one with lower energy (approximately 530.3 eV) was ascribed to lattice oxygen (Ti-O-Ti, O L ) and the other (531.8eV) resulted from the superficial oxygen of hydroxyl species (-OH, O H ) 40.As is widely accepted, the superficial hydroxyl groups on TiO 2 tend to enhance CO 2 adsorption and thus improve the activity of photocatalysts 414243.As shown in Table 1, from TiO 2 -0 to TiO 2 -10, the area ratio of O H /O L first decreased from 0.71 (TiO 2 -0) to 0.51 (TiO 2 -2), but it ultimately increased to 0.76 from TiO 2 -2 to TiO 2 -10.The decrease in the concentration of superficial hydroxyls may have resulted from the removal of organic residues, such as glycols, from the TiO 2 -0 surface, while the following increase can be attributed to the consecutive formation of interconnected anatase nanoparticles, which can provide more sites for the generation of surface hydroxyl groups 44. As illustrated in part 3.1, organic residues could be effectively removed under calcination at 350 C in O 2 for 2 h or in air for longer, therefore, on the premise of eliminating the influence of organic residues during CO 2 reduction, TiO 2 -2, TiO 2 -4, and TiO 2 -10 were selected elaborately to perform the UV-light irradiated CO 2 photoreduction with the aim of figuring out the dependence between consecutive morphology/phase transformation and photocatalytic activity.It should be emphasized that the organic residues couldn't be eliminated at 350 C for 2 h in air, hence, we chose the sample calcined at 350 C in O 2 for 2 h as TiO 2 -2 to conduct the experiments together with the other two samples calcined in air.For all the samples, CO and CH 4 were determined to be the main products, and no other gaseous carbon-containing products were detected.The solvothermal synthesis route we adopted may induce substantial surface carbon residues on TiO 2 -0 nanosheets due to the use of organic compounds, thus the CO and CH 4 produced on TiO 2 -0 may mainly transformed from organic residues on TiO 2 -0 rather than CO 2 photocatalytic reduction.To verify this, the control experiment of TiO 2 -0 was conducted under ultra-violet irradiation without the supply of CO 2 and only with the mixture of N 2 and water vapor, the results of which proved our suspect.Therefore, the CO production rate on TiO 2 -0 listed in Table 2 couldn't be compared with those on TiO 2 -2/4/10, and the effects of calcination on the photocatalytic activity of TiO 2 nanosheets could only be compared among TiO 2 -2, TiO 2 -4 and TiO 2 -10 catalysts.Fig. S8 shows that the yields of CO and CH 4 from the TiO 2 nanosheets increased nearly linearly during the photoreduction process.Fig. 3a and Table 2 shows the average production rates of CH 4 and CO per unit mass of the postcalcinated catalyst within 10 h, CO yields on per unit mass of the three catalysts were almost identical despite the significant lower specific surface area of TiO 2 -10.Generally, a larger specific surface area would provide more sites for reactants adsorption and the subsequent photoreduction, and this should suggest a higher activity of the sites on TiO 2 -10. Fig. 3b shows the integrated yields of CO and CH 4 , as well as their average production rates per unit surface area of the catalysts.Negligible difference could be observed between TiO 2 -2 and TiO 2 -4, both of the two samples exhibited substantially lower activities than those of TiO 2 -10.The yields of CO and CH 4 on TiO 2 -10 were, respectively, approximately 2.6 and 3.5 times those on TiO 2 -2 and TiO 2 -4, the results can be attributed to the structure transformation occurred during the subsequent heat treatment, which could change the interaction between CO 2 and the catalysts as well as charge transfer/recombination properties of the catalysts.The X-ray photoelectron spectroscopy showed that TiO 2 -10 exhibited high concentration of surface hydroxyl groups, which can enhance the chemical adsorption/activation of CO 2 42,45.Table 2 gives the selectivity of CO and CH 4 on the postcalcinated catalysts 4, of all three postcalcinated catalysts, CO yields took the majority as their selectivity were all about 85 .Fig. S9 shows the cycle performance of the three postcalcinated catalysts, the used catalysts in the former cycle was collected and the same experimental process was repeated.The similar yields of CH 4 and CO in the second and the third cycle to those in the first cycle suggested that the three catalysts were all of good stability under our reaction conditions. To determine the underlying promotion effects, PL spectra and an EIS analysis were employed to investigate the separation efficiency of electron-hole pairs and the charge transfer characteristics (Fig. 3c-d). Considering that a decreased fluorescence intensity signifies a reduced recombination of photogenerated electron-hole pairs 46, the lowest PL intensity of TiO 2 -10 among the three samples indicated the promoted separation of photogenerated charges in TiO 2 -10, the results could be attributed to the formation a heterophase junction between TiO 2 (B) and anatase, as revealed by the XRD and Raman analyses 14,15.EIS measurements were performed to study the influence of the phase and morphology transformations on the charge transfer.Fig. 3d shows the Nyquist plots of all the sample electrodes under dark conditions.The diameter of the arc radius in the Nyquist plot of TiO 2 -10 was the smallest among all the samples, indicating a high conductivity of TiO 2 -10 compared with that of the others 47.It is noteworthy that the other three samples, despite their different phase compositions, exhibited similar larger diameter arc radii in the Nyquist plots, suggesting a lower charge transfer efficiency.Therefore, we speculated that the higher efficiency of the charge transfer in TiO 2 -10 was mainly associated with the improved connection between the crystallized nanoparticles formed during the calcination process 48. The CO 2 adsorption properties on the catalysts were further investigated by CO 2 adsorption-desorption and Temperature programmed CO 2 desorption.As shown in Fig. 3e, the most quantity of CO 2 adsorbed on TiO 2 -10 under low pressure (less than 20 of barometric pressure) indicated the most intense interaction and binding force between the catalyst and CO 2 .In the followed stage, the quantity of CO 2 adsorbed on TiO 2 -2 and TiO 2 -4 increased nearly linearly as the pressure went up, while that on TiO 2 only increased slightly, the phenomena can be attributed to the smallest specific surface area of TiO 2 -10, which was less than 40 of both the other two samples, note that the quantity of CO 2 adsorbed on per unit area of TiO 2 -10 at atmospheric pressure was still far more than those adsorbed on the other two catalysts.Fig. 3f shows the TPD-CO 2 results, compared with TiO 2 -4 and TiO 2 -10, TiO 2 -2 exhibited the least active interaction with the CO 2 adsorbed for the reason that the most part of CO 2 adsorbed on its surface desorbed below 250C, and its two T max at 164 C and 372 C were both the lowest among the three catalysts.The much lower CO 2 desorption intensity at 174 C and the higher at 398 C for TiO 2 -4 than those for TiO 2 -2 suggested the much stronger interaction between TiO 2 -4 and the CO 2 adsorbed.For TiO 2 -10, its two former T max at 196 C and 446 C were both higher than those of TiO 2 -4 substantially with an additional T max found at 573 C, the results demonstrated the strongest chemical binding and interaction between CO 2 and TiO 2 -10 and unlike the former twos, the majority of CO 2 on TiO 2 -10 not adsorbed in the form of CO 2 molecules, but of HCO 3 -and CO 3 2-species, as it was well accepted that CO 2 molecules usually desorbed below 180 C, and the other converted species desorbed only occurred at higher temperature 49,50.The strongest chemical binding and the interaction between TiO 2 -10 and the CO 2 adsorbed can mainly be attributed to, as revealed by XPS analysis, the highest surface hydroxyl concentrations for the reason that the CO 3 2and HCO 3 -usually converted from the capture of CO 2 by anionic Ti-OH -, and Ti-O 2-sites 16,51.Combing the results of CO 2 adsorption and TPD-CO 2 , it can be concluded that the quantity of CO 2 adsorbed on TiO 2 -10 per unit mass was a little less due to its much smaller specific surface area in spite of strong CO 2 adsorption per unit area, while the chemical binding and the interaction between CO 2 and TiO 2 -10 were substantially strengthened. To verify whether the photoactivity would be improved further with prolonged calcination duration, the catalyst with 14 h postcalcination as the same atmosphere and temperature as TiO 2 -10 underwent was conducted, which was denoted as TiO 2 -14.The results of N 2 adsorptiondesorption tests revealed that the specific surface area of TiO 2 -14 still retained about 90 m 2 g -1 , additionally, as shown in Fig. S10.The photocatalytic activity per unit surface area of TiO 2 -14 was close to that of TiO 2 -10, therefore, the extended 4 -h after 10 -h of postcalcination couldn't give rise to the perceptible changes to the photoactivity of the catalysts.This may be because the structure transformation of TiO 2 had already been finished within the first 10 h of calcination at 350C. In situ DRIFTS was conducted to study the intermediates on the surface of the TiO 2 samples.Fig. 4a shows IR spectra of the CO 2 and H 2 O interactions with the TiO 2 samples in the dark for 60 min.The peaks intensity for CO 3 2-and HCO 3 -species on TiO 2 -4 was relatively stronger than those on TiO 2 -2, suggesting the stronger chemical binding of CO 2 adsorbed on TiO 2 -4 52.The results were in well agreement with CO 2 -TPD analysis as the stronger intensities of CO 3 2-and HCO 3on TiO 2 -4 may converted from the reaction of the CO 2 adsorbed with surface hydroxyl groups 49,53.HCO 3 -and CO 3 2-species could then be converted into the surface CO 2 -species, which served as a important intermediate in CO 2 reduction 52.The difficulty in further enhancement of adsorbed CO 2 species intensities on TiO 2 -10 may resulted from the little less CO 2 adsorption due to its smaller specific surface area, even with much facilitated chemical binding of CO 2 adsorbed.Fig. 4b shows that, compared with the adsorption stage, the IR spectra for H 2 O and CO 2 species on TiO 2 -2 remained nearly unchanged upon subsequent UV irradiation, which could be attributed to the weak adsorption of CO 2 on the TiO 2 -2 surface.For TiO 2 -4, although with a relatively stronger CO 2 binding, distinct changes in the IR spectra under illumination can also be barely observed (Fig. 4c), implying the difficulty in activation and conversion of CO 2 adsorbed.This led to the inferior performance of TiO 2 -4 in spite of its relatively strong CO 2 binding.Unlike TiO 2 -2 and TiO 2 -4, the IR intensity of m-CO 3 2-(1564-1529 cm -1 ) and b-CO 3 2-(1601, 1375, and 1347 cm -1 ) on TiO 2 -10 (Fig. 4d) decreased significantly with prolonged irradiation time, the phenomenon demonstrated the significantly facilitated binding, activation and conversion of CO 2 adsorbed on TiO 2 -10. It has been widely accepted that surface hydroxyl groups were crucial for CO 2 photoreduction, which can enhance CO 2 adsorption.Similarly, in our work, the surface hydroxyl groups can easily form on the coordination-unsaturated surface Ti 4 ions, and then react with CO 2 molecules to form species such as HCO 3 -, which are important intermediates of CO 2 reduction.The adsorbed CO 2 species can accept photogenerated electrons to be reduced into CO and CH 4 .Therefore, the active sites may be surface Ti 4 ions with hydroxyl groups.As illustrated in Fig. 5, since the conduction band and valence band of TiO 2 (B) are both higher than those of anatase 54, the photogenerated electrons tend to migrate from the conduction band of TiO"
  },
  {
    "title": "Conclusions",
    "content": "Atomically thin TiO 2 (B) nanosheets were synthesized via a solvothermal method and calcined under several different conditions, and it had been proved that the calcination at 350 C in oxygen for 2 h or in air for 4 h could effectively remove the organic residuals in the TiO 2 (B) nanosheets and prolonged calcination time could induce great structural transformation.After calcination at 350 C in air for 10 h, the 2D structured TiO 2 nanosheets were decomposed into interconnected nanoparticles, followed by nanoparticle growth and a crystallinity enhancement.Meanwhile, the TiO 2 (B) phase transformed into anatase, and the porous structure of the TiO 2 nanosheets collapsed and aggregated.The structure change induced a high concentration of surface hydroxyl groups and the formation of anatase-TiO 2 (B) phase junction, which contributed to the stronger chemical binding and activation of CO 2 and the efficient charge transfer and separation, resulting in the Fig. 1.Schematic diagram of the transformation of atomically thin TiO 2 -0 nanosheets during post calcination (a), HR-TEM images of TiO 2 -0 (b), TiO 2 -2 (c), TiO 2 -4 (d), and TiO 2 -10 (e) samples. 2 and TiO 2 -4 were mainly composed of TiO 2 (B), while TiO 2 -10 mainly consisted of the anatase phase with a higher crystallinity.The surface chemical states of Ti and O in the samples were analyzed by XPS.As shown in Fig. Fig. 2. Nitrogen adsorption-desorption isotherms (a), pore size distribution curves (b), XRD patterns (c-d), and high-resolution Ti 2p (e), O 1s (f) XPS spectra of the samples. Fig. 3. CO and CH 4 production rate per unit mass catalysts (a), and per unit surface area catalysts (b), PL spectra (c), and electrochemical impedance spectroscopy (EIS) Nyquist plots (d) of the samples, CO 2 adsorption and desorption isotherms (e), and TPD-CO 2 profiles (f) of the three catalysts. photogenerated electrons on the conduction band of anatase to be reduced into CO and CH 4 .Besides, holes tend to migrate from the valence band of anatase to the valence band of TiO 2 (B), and consequently oxidize the adsorbed H 2 O or hydroxyl groups into oxygen.The mutual migration effect can accelerate the transfer and strengthen the separation of photogenerated electron-hole pairs, improving the production rates of CO and CH 4 per unit surface area of the catalysts.Briefly, the postcalcination induced the transformation of atomically thin TiO 2 nanosheets into interconnected high-crystallinity anatase nanoparticles and the formation of TiO 2 (B)/anatase heterophase junction, which significantly enhanced the chemical binding and activation of CO 2 and promoted the separation/transfer of photogenerated charges, resulting in enhanced CO 2 photocatalytic reduction. Fig. 4. In-situ DRIFTS comparison of TiO 2 -X (X 2,410) catalysts (a), and photoreduction spectra of TiO 2 -2 (b), TiO 2 -4 (c), TiO 2 -10 (d) catalysts. Textural properties of the samples. SamplesBET surface area (m 2 g -1 ) Pore volume (cm 3 g -1 ) Photocatalytic CO 2 reduction activities of TiO 2 -2, TiO 2 -4, and TiO 2 -10 catalysts. This project was supported by the National Natural Science Foundation of China (U1610110 and 51706082) and the Fundamental Research Funds for the Central Universities, HUST (2019kfyXJJS111).The authors acknowledge the Analysis and Test Center of Huazhong University of Science Technology. There is no financial interest to report.We certify that the submission is not under review at any other publication. Supplementary material related to this article can be found, in the online version, at doi:https://doi.org/10.1016/j.jcou.2020.101262."
  }
]