[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2017.11.011"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic reduction of CO2 on Cu2O-loaded Zn-Cr layered double hydroxides"
  },
  {
    "title": "Abstract",
    "content": "Highlights Cu2O nanoparticles were loaded on Zn-Cr LDHs via a soft-chemical in situ reduction process. Cu2OZn-Cr LDHs exhibited dramatically enhanced photocatalytic performance for CO2 reduction in pure water. Cu2O nanoparticles are considered good electron traps and reaction sites for CO2 reduction."
  },
  {
    "title": "Experimental",
    "content": "ZnCl2 was purchased from Kanto Chemical Co., Inc., and the other chemicals were commercially available reagents from Wako Pure Chemical Industries, Ltd.Ultrapure water was produced by Milli-Q Advantage A10 water purification system.The bare Zn2Cr binary and Cu2xZn2-2xCr ternary LDH (x 0.05, 0.10, 0.20, and 0.40) were synthesized by the co-precipitation method 29.In detail, 20x mmol (x 0, 0.05, 0.10, 0.20, and 0.40) of CuCl22H2O, 20 -20x mmol of ZnCl2, and 10 mmol of CrCl36H2O were dissolved in 15 mL water to form a solution (Solution A).A mixed aqueous solution (Solution B) of NaOH-Na2CO3 (2:1 molar ratio, Na 4 mol/L) was prepared. Solution A and Solution B were added dropwise into 20 mL of ultrapure water via variable-flow peristaltic pumps (Fisher Scientific) with rapid stirring to form purple or blue slurries.The pH was maintained at 8.9-9.1 by controlling the speed of addition. After co-precipitation, the slurry was aged in a water bath at 333 K for 24 h.Then the precipitate was centrifuged and washed with water repeatedly (at least three times).The LDH powder was obtained by grinding the precipitate after drying at 353 K in an oven overnight. Cu2O-loaded Zn-Cr LDHs were synthesized by performing the in situ reduction of the Cu2xZn2-2xCr LDH (x 0.05, 0.10, 0.20, and 0.40) precursor, which was prepared as described previously.Note that the precursor should be washed but not dried.The wet precipitate was dispersed in 50 mL water, and added dropwise to 50 mL of a 0.1 mol/L ascorbic acid aqueous solution of which the pH had been adjusted to 8.9-9.1 with a NaOH-Na2CO3 mixed solution (2:1 molar ratio, Na 4 mol/L).The suspension was continuously stirred for 2 h at room temperature.Then the product was centrifuged and washed with water repeatedly (at least three times).The powder sample was obtained by grinding the precipitate after drying at 353 K in an oven overnight.The as-prepared Cu2O loaded LDHs are denoted 'xCu2OZn2-2xCr LDH', where x 0.05, 0.10, 0.20, or 0.40. The crystallographic phases of the as-prepared samples were investigated by X-ray diffraction analysis (XRD) using a Rigaku Ultima IV diffractometer with Cu K radiation (K1 1.540598 A, K2 1.544426A, K2/K1 0.4970) and a D/teX Ultra detector.Fourier transform infrared (FT-IR) spectra of the samples were measured using a JEOL JIR-7000 at room temperature in the range of 400-4000 cm -1 .Samples were prepared in KBr pellets, and the spectrum of an empty KBr pellet was used as a reference.The morphology of the catalysts was observed using a JEOL-7600F scanning electron microscope (SEM) and Hitachi H8100 transmission electron microscope (TEM).The N2 adsorption-desorption isotherms at 77 K were determined using a BELSORP 18 gas sorption analyzer.The optical absorption properties of powders in the wavelength range of 200-800 nm were recorded using the diffuse reflectance (DRS) method and a Hitachi U-3310 UV-vis spectrophotometer. The photocatalytic properties for CO2 reduction were evaluated by liquid-phase reaction under UV irradiation if not stated otherwise.In detail, 200 mg of catalyst was dispersed in 50 mL pure water in a glass reactor with 290 mL dead volume covered by a quartz plate.After being degassed by a vacuum pump for 10 min, CO2 gas was bubbled through the water and purged into the reactor for 15 min.Then, the sealed reactor was placed beneath one of the two branched guidance fibers connected to a 200-W Hg-Xe lamp (LA-310UV, Hayashi Watch-works) and irradiated for 24 h.The yields of carbon-containing compounds were detected by a gas chromatograph with a flame ionization detector (GC-FID; Shimadzu GC-2014AF equipped with 1-m ShinCarbon ST 50/80 column and a methanizer unit).The yield of H2 was detected by a chromatograph with thermal conductivity detector (GC-TCD; Shimadzu GC-2014AE equipped with a 6-m ShinCarbon ST 50/80 column).The control experiments were performed by using Ar gas instead of CO2 gas under the same reaction conditions.The effect of additives on the photocatalytic properties was investigated by using 0.1 mol/L aqueous Na2SO4, Na2CO3, and NaCl solutions and a commercial CO2 ultra-fine bubble (UFB) solution instead of pure water.To verify the oxygen production and distinguish it from the carbon source, isotope tests were performed in a 1-cm quartz cuvette with a threaded cap.The isotope reagents were purchased from Sigma-Aldrich Co., LLC.Briefly, 50 mg 0.1Cu2OZn1.8CrLDH was impregnated with 1 mL H2 18 O, and 13 CO2 gas was bubbled through the suspension for 20 min.Then the cuvette was sealed and irradiated with UV light for 24 h.The gas in the headspace before, during, and after irradiation was analyzed by a gas chromatography-mass spectrometry system (GC-MS; Shimadzu GCMS-QP2010).LDHs belong to the 3R polytype 30.The calculated results for parameter c are in agreement with those of CO3 2--type LDHs reported previously 31.is 1 pm smaller than Zn 2 and because the Jahn-Teller effect of Cu(OH)6 octahedral units can further shorten the Cu-O bond length on the xy plane, the incorporation of Cu 2 is accompanied by a decrease in the cation-cation distance 27,32.A schematic diagram of structural and composition changes to the LDHs before and after the in situ reduction is shown in Fig. S1.33 The Cu2O phase formed after the Cu-Zn-Cr LDHs were reacted with ascorbic acid, and the amount of Cu2O increased with increasing x, as did the crystallinity.In addition, the LDH phases remain after the reactions.However, a large amount of Cu 2 was separated out, and the intensity of the diffraction peaks decreased and became broad, reflecting the decrease in the crystallinity of the LDH phase.After reduction, the (110) and (113) peaks attributed to LDH phases were generally still coincided with the reflections of the ternary LDH matrixes.Due to the same valence number of Cu 2 and the interlayer counter ion CO3 2-, LDHs can maintain the charge balance as well as the crystal structure by dissociating a Cu 2 and a CO3 2- simultaneously during the in situ reduction.Lattice defects of LDH backbones possibly generated in the process."
  },
  {
    "title": "Results_and_Discussion",
    "content": "To confirm how the separating out of Cu 2 affected the surface area of the photocatalyst, the N2 adsorption-desorption isotherms of 0.1Cu2OZn1.8CrLDH and the corresponding Cu0.2Zn1.8CrLDH were measured and plotted, as shown in Fig. S2. Both samples show hysteresis loops typical of mesoporous materials, but the adsorption volume (Va) at the same p/p0 of 0.1Cu2OZn1.8Cr is obviously lower in the high-pressure area.Using the Kelvin equation, we found that the pore size decreased slightly after the in situ reduction.The specific surface area calculated by the Brunauer-Emmett-Teller (BET) method before and after the in situ reduction were 133 and 123 , respectively.Although the specific surface area decreased with increasing separation of Cu 2 , the value is still within the normal range of LDHs 2. As shown in the TEM images in Fig. 2, the samples have a morphology consisting of accumulated sheet-like structures.The shape of the brucite-like layers is maintained after the in situ reduction, but some independent particles are observed.The high resolution TEM images D2 and E2 show the distinct lattice fringes with a d-spacing of 0.29 nm, which is corresponding to the (110) lattice planes of cubic crystal structured Cu2O 19,34.The Cu2O particle size at both x 0.10 and x 0.20 is lower than 30 nm, while agglomerated particles were observed at x 0.40.With a lower Cu content, the growth of Cu2O nuclei in the reduction reaction was restricted because of the surrounding brucite-like layers; consequently, the particles were quite small and highly dispersed in the LDH frameworks.In contrast, with an excessive Cu content, large numbers of Cu2O nuclei separated out in the reduction reaction, gathering and growing into large crystals.Fig. 3 shows the FT-IR spectra of several representative samples.All the spectra show broad and intense bands at about 3400 cm -1 , attributed to the stretching modes of the hydroxyl groups in the LDH host layers and interlayer water molecules.The band at 1640 cm -1 is assigned to the bending vibration of water.According to the symmetry group characteristics of the carbonate ion, the bands observed around 1350 and 770 cm -1 are, respectively, the 3 antisymmetric stretch and 2 out-of-plane bend 35.In the low-frequency region, the fingerprints are attributed to the lattice vibrations from the LDH host layers.A weak band was also observed at 630 cm -1 for the 0.4Cu2OZn1.2CrLDH sample, and this is assigned to the Cu-O lattice vibration from the loaded Cu2O particles 17,34.The adsorbed organic contaminants derived from ascorbic acid in the in situ reduction process had a negative effect on the accuracy of CO2 photoreduction performance tests because they can easily decompose to C1 compounds under UV irradiation.However, here, the absence of stretching vibration bands corresponding to carbon-hydrogen (2960-2850 cm -1 ) and carbonyl bonds (1820-1650 cm -1 ) in the spectra suggests that the alkaline reaction condition effectively suppressed the ion exchange adsorption of ascorbic-acid-derived species on the LDHs 36.Fig. 4 shows the UV-vis diffuse reflection spectra of some representative LDHs before and after the in situ reduction.The spectra were converted using the Kubelka-Munk function (F(R)) from the reflectivity data.In the UV region, the pristine Zn2Cr LDH displays the intrinsic absorption bands, which are attributed to the ligand-metal charge transfer (LMCT) from the O-2p orbital to the Zn-4s and Cr-3d-eg orbitals.The absorption band at 264-318 nm in the spectrum is attributed to metal-metal charge transfer (MMCT) from Cr-3d-t2g to Zn-4s 22,37.The absorption edge observed at 318 nm is corresponding to an approximate band gap (Eg) of 3.9 eV.In the visible-light region, the adsorption peaks at 410 and 570 nm correspond to the 4 A2g 4 T1g(F) and 4 A2g 4 T2g(F) d-d transitions of the Cr 3 ions, respectively 38.The absorption spectra of the Cu-Zn-Cr ternary LDHs from 200-500 nm are complex but mainly consist of overlapped LMCT, MMCT, and Cr 3 4 A2g 4 T1g(F) d-d transitions.The overlap of the Cr 3 4 A2g 4 T1g(F) and Cu 2 2 Eg 2 T2g(D) d-d transitions redshifts the peaks around 570 nm gradually with increasing Cu 2 content 39.After the in situ reduction, the change of absorption characteristics in the UV region is attributed to the overlap of the intrinsic absorption of Cu2O.Around 570 nm, the influence of the Cu 2 d-d transition disappeared, and the absorption peaks around 570 nm were blue-shifted to the same positions as those of the pristine Zn2Cr LDH.This indicates that Cu 2 is not involved in the band structure of the LDHs after its reduction to Cu2O. Fig. 5 shows a comparison of the photocatalytic activity among 0.1Cu2OZn1.8CrLDH, ternary Cu0.2Zn1.8CrLDH, and the pristine Zn2Cr LDH under a CO2 atmosphere. The LDHs not loaded with Cu2O exhibited limited activity.The CO released after 24 h was approximately 0.1 mol, and a trace amount of H2 in the pure water was observed. In contrast, 0.1Cu2OZn1.8CrLDH exhibited a CO yield of up to 6.3 mol, and 3.9 mol of H2 was generated simultaneously.To identify the activation effect of the Cu2O with a 400-nm cutoff filter (SC 40, Fujifilm Corporation).The generation of H2 and CO was not observed.Thus, the light harvesting material for the photocatalytic reaction is LDH, whereas Cu2O tends to act as the cocatalyst, accelerating the reaction.A series of control tests was carried out to verify whether CO is derived from CO2 by repeating the UV irradiation of 0.1Cu2OZn1.8CrLDH under an Ar atmosphere.Considering that the interlayer CO3 2-ions are also a possible carbon source because they can transform to CO2 via hydrolysis, a portion of the 0.1Cu2OZn1.8CrLDH was decarbonized via an ion-exchange process in a NaH2PO4 aqueous solution prior to the irradiation tests in Ar. The amount of CO generated on the CO3 2--type and decarbonized samples were 3.1 and 1.3 mol, respectively (Fig. 5(b)).This indicates that almost 80 of the CO production is assigned to the reduction of CO2 but not the incomplete oxidation product of the surface-adsorbed organic contaminants.The isotope analysis result shows the obvious and ever-increasing mass spectra peaks of 18 O2 (m/z 36) and 13 CO (m/z 29) after irradiating the 0.1Cu2OZn1.8CrLDH impregnated with H2 18 O under a 13 CO2 atmosphere with UV light (Fig. 6).We confirmed that the photogenerated electrons reduced CO2 to CO and the holes oxidized water to oxygen simultaneously.Evidently, after the modification of Cu2O nanoparticles on the LDH surface, the photocatalytic performance was enhanced significantly.This result indicates that Cu2O can serve as an electron trap, reducing the recombination of photogenerated electrons and holes and increasing the photocatalytic efficiency.Meanwhile, Cu2O nanoparticles are probably quite sensitive to CO2, and they can function as reaction sites, promoting the conversion of CO2 to CO (Fig. 7). The effect of the Cu content on the photocatalytic activity is shown in Fig. 8.All the Cu2O-decorated samples showed activity for the reduction of CO2 to CO, accompanied by water splitting, generating H2 as a side reaction.The production of CO increased linearly with the irradiation time.The 0.1Cu2OZn1.8CrLDH sample exhibited the highest yields of CO and H2, but the selectivity toward CO generation was only 62.3.The 0.2Cu2OZn1.4CrLDH displayed the highest selectivity of 82.3, but the yield of CO (4.1 mol) was inferior to that of the 0.1Cu2OZn1.8CrLDH.The 0.4Cu2OZn1.4CrLDH, which has the highest Cu2O content, showed the lowest yields of both CO (2.3 mol) and H2 (0.5 mol).This suggests that excess Cu2O loading may reduce the synergism between LDHs and Cu2O because of the formation of large particles and the poor dispersion of Cu2O in the LDH frameworks.In addition, a large quantity of Cu2O particles can mask the LDH surface, reducing the photoexcitation of the LDHs and suppressing the photocatalytic efficiency 40. The effect of additives on the photocatalytic activity of the 0.1Cu2OZn1.8CrLDH was also studied.As shown in Fig. 9, the addition of Na2SO3 severely suppressed the formation of CO but increased the generation of H2, which increased to 41.2 molgcat -1 after 24-h irradiation, 11.8 times higher than the case without any additive.The addition of Na2CO3 also suppressed the generation of CO.SO3 2-is an ideal hole scavenger and promotes the water splitting reaction.The reason for the decreased CO generation is probably that CO3 2-and SO3 2-occupied the CO2 adsorption sites and then inhibited the adsorption and reduction reactions on the surface of the photocatalyst.The addition of NaCl weakened both the CO2 reduction and water splitting reactions slightly but improved the selectivity toward CO generation.Notably, using a CO2 UFB solution instead of water can improve both the CO production and the selectively, indicating that the increase in CO2 solubility significantly increases the photocatalytic activity for CO2 reduction. The chemical stability of Cu2O-loaded LDH was investigated.During the photocatalytic reaction, it was observed the photocatalyst turned black gradually.The redox potential of CuO/Cu2O is 0.193V (vs.SHE, pH 7), within the region between the valence band (VB) top and conduction band (CB) bottom of Cu2O 41.This is possibly because part of the Cu I was self-oxidized to Cu II under UV irradiation, forming mixed-valance CuxO species, which might be the active species, resulting in enhanced 42.Gunjakar et al. 43 suggested a charge transfer mode from Zn-Cr LDH to other semiconductors such as layered titanate.Zn-Cr LDHs can be regarded as wide band semiconductor-like species, whose CB bottom and interstate bands are sufficiently negative to afford electron transfer to the CB of layered titanate. In contrast, Cu2O has a quite negative CB, which is unlikely able to accept the photogenerated electrons from the Zn-Cr LDHs.However, the self-oxidation of Cu I under UV irradiation resulted in the Fermi level shifting in the positive direction and the formation of unoccupied Cu-3d orbitals below the CB of Cu2O.These changes probably allow the electron transfer from the CB of Zn-Cr LDHs to the unoccupied Cu-3d orbitals of the surface-loaded Cu2O nanoparticles, which are also highly active reaction sites for CO evolution from CO2 in aqueous solution.The XRD patterns of the representative planes in 0.1Cu2OZn1.8CrLDH before and after the CO2 photoreduction reaction are also recorded for the further analysis of its chemical stability.Fig. S3(a) shows LDH phase are well preserved, and its crystallinity has not been changed.However, as shown in Fig. S3(b), the diffraction peaks of both Cu2O and Cu existed after the reaction, indicating part of Cu2O was self-reduced by photoelectrons.It does not imply that the photocatalyst will be out of activity, because Cu can also serve as a reaction site for CO2 photoreduction 444546.Fig. S4 shows the average formation rate of CO on Cu2O-loaded Zn-Cr LDHs at different time in CO2 photoreduction reaction in pure water.In the initial stage, the formation rate of CO decreased along with the gradual reduction of Cu I to Cu 0 , attesting the fact Cu2O is more effective than Cu, which is consistent with the previous report 47.The change between Cu I and Cu 0 was reversible and probably close to equilibrium after 4 hours when the formation rate of CO turned into stable."
  },
  {
    "title": "Conclusions",
    "content": "The incorporation of copper oxides with LDHs is considered an effective approach to improve the activity of photocatalysts for the reduction of CO2.In this work, a series of of stacked layered clay materials, have aroused widespread attention for their unique and Cu2O shell provided sites for the preferential conversion of CO2 to CH4 and CO. Fig. 1(a) shows the XRD patterns of all the as-prepared samples including bare Zn2Cr LDH, bare Cu2O, Cu-Zn-Cr ternary LDHs, and Cu2O-loaded Zn-Cr LDHs.Characteristic of stacked layered structures, intense diffraction peaks around 2 11.6 and 23.3 were present in all the LDH samples and were assigned to the (003) and (006) lattice planes, respectively.The d003 value represents the interlayer spacing, and parameter c can be calculated using the equation c 3d003 because typical Zn-based Fig. 1(b) shows the detailed scan from 58-62, containing the diffraction peaks corresponding to the (110) and (113) planes, of which the position depends on the radius particles as narrow bandgap semiconductors, 0.1Cu2OZn1.8CrLDH was also irradiated with visible light using a 200-W Xe lamp (LA-410UV, Hayashi Watch-works) Figure Captions Fig. 3 FT-IR spectra of representative Cu2xZn2-2xCr LDHs (x 0.10, 0.40), the corresponding xCu2OZn2-2xCr LDH (x 0.10, 0.40), bare Zn2Cr LDH, and bare Cu2O. Fig. 4 UV-Vis DRS spectra of Cu2xZn2-2xCr LDH (x 0.10, 0.20, 0.40), and the corresponding xCu2OZn2-2xCr LDH (x 0.10, 0.20, x 0.40). Fig.5(a) Time course of CO evolution in CO2 or Ar and (b) total amount of CO and H2 generated after 24 h for the photocatalytic reaction in pure water over 0.1Cu2OZn1.8CrLDH, decarbonated 0.1Cu2OZn1.8CrLDH, Cu0.2Zn1.8CrLDH, and bare Zn2Cr LDH. Fig.6 Mass chromatography spectra of (a) 18 O2 (m/z 36) and (b)13 CO (m/z 29) generated on 0.1Cu2OZn1.8CrLDH impregnated with H218 O under a 13 CO2 atmosphere. Fig. 7 Estimated electron transfer mode from Zn-Cr LDH to Cu2O. Fig. 2 TEM images of Cu2xZn2-2xCr LDH: A: x 0.10, B: x 0.20, C: x 0.40, and the corresponding xCu2OZn2-2xCr LDH: D1, D2: x 0.10, E1, E2, E3: x 0.20, where E3 is the image of two dimensional fast Fourier transform; and F: x 0.40.A C C E P T E D M A N U S C R I P T Fig. 4 UV-Vis DRS spectra of Cu2xZn2-2xCr LDH (x 0.10, 0.20, 0.40), and the corresponding xCu2OZn2-2xCr LDH (x 0.10, 0.20, x 0.40). Fig.5(a) Time course of CO evolution in CO2 or Ar and (b) total amount of CO and H2 generated after 24 h for the photocatalytic reaction in pure water over 0.1Cu2OZn1.8CrLDH, decarbonated 0.1Cu2OZn1.8CrLDH, Cu0.2Zn1.8CrLDH, and bare Zn2Cr LDH. Fig. 6 Mass chromatography spectra of (a) 18 O2 (m/z 36) and (b) 13 CO (m/z 29) generated on 0.1Cu2OZn1.8CrLDH impregnated with H2 18 O under a 13 CO2 atmosphere. Fig. 7 Estimated electron transfer mode from Zn-Cr LDH to Cu2O. Fig.8(a) Time course of CO evolution and (b) the total amount generated after 24 h from the water dispersion of Cu2OZn-Cr LDHs with different Cu content under CO2 atmosphere. The authors are grateful to Prof. Y. Kitamoto (Tokyo Institute of Technology, Japan) for the provision of TEM instrument.This work was supported in part by \"Grant-in-Aid for Young Scientists (A; 25708037)\" from Japan Society for the Promotion of Science (JSPS)."
  }
]