[
  {
    "title": "Doi",
    "content": "10.1016/j.ijhydene.2018.07.193"
  },
  {
    "title": "Article_Title",
    "content": "Reinforced photocatalytic reduction of CO2 to fuel by efficient S-TiO2: Significance of sulfur doping"
  },
  {
    "title": "Abstract",
    "content": "The photocatalytic reduction of CO 2 to valuable chemicals and fuels is an efficient approach to control the ever-rising CO 2 level in the atmosphere.The present paper describes a significant improvement in photoreduction of carbon dioxide (CO 2 ) using sulfur (S) doped titania (S-TiO 2 ) nanoparticles as a photocatalyst under UV-A and visible light irradiation.The sulfur doping was done by following a simple sonothermal method, and a series of photocatalysts were synthesized with the varied amount of S doping.Various characterization techniques were employed for the photocatalysts such as XRD, surface area, UVeVisible, SEM, TEM, and XPS.The XPS reveals that S is predominantly present as S 4 in S-TiO 2 .The electronic structure for S-TiO 2 anatase was calculated with the Vienna ab initio simulation package (VASP) code in the framework of spin-polarized density functional theory.Additional states closer to the valence band are produced inside the band gap as a result of doping.In situ reductive reaction conditions can partially reduce the catalyst, and results in the shift of Fermi level into the conduction band.It is suggested that Sdoping increases catalyst surface conductivity, improves the charge transfer rate and the rate of photocatalytic reactions.The prepared series of catalysts have shown excellent activity under UV-A and visible light for photocatalytic reduction of CO 2 .The effect of the different base including K 2 CO 3 , Na 2 CO 3 , NaOH and KOH; catalyst amount; sulfur doping amount; and light wavelength were monitored.Methane, ethylene, propylene, and propane were observed as reaction products.In 24 h, S-TiO 2 exhibited the highest photoactivity in KOH aqueous solution with a maximum yield of 6.25 mmol g A1 methane, 2.74 mmol g A1 of ethylene, 0.074 mmol g A1 of propylene and 0.030 mmol g A1 of propane under UV-A irradiation.The catalysts were active in visible light and able to generate methane and methanol in acetonitrile-H 2 O mixture with/without TEOA as sacrificial donor producing 846.5 mmol g A1 of methane and 4030 mmol g A1 of methanol for the former and 167.6 mmol g A1 of methane and 12828.4mmol g A1 of methanol for the latter case.An estimate demonstrates that mass transfer does not limit the CO 2 reaction."
  },
  {
    "title": "Experimental",
    "content": "Sulfur powder (SP) from Thomas Baker, tetrabutyl orthotitanate (TBOT) from Aldrich; methanol (CH 3 OH), nitric acid (HNO 3 ), triethanolamine (TEOA) and sodium hydroxide (NaOH) from Merck; ethanol (C 2 H 5 OH) from Fischer Chemicals; acetonitrile (ACN) for HPLC spectroscopy from Sd Fine-Chem limited; sodium carbonate anhydrous (Na 2 CO 3 ) from HiMedia; potassium carbonate (K 2 CO 3 ) from Loba Chemie; potassium hydroxide (KOH) from RFLC; CO 2 (99.9995) from Sigma Gases; methane, ethylene, propylene and propane gases (99.9995) from Sigma gases; and HPLC grade water (H 2 O) were used as chemicals.All chemicals were analytical grade and were used without further purification. A series of sulfur-doped TiO 2 photocatalysts were prepared with variable sulfur doping level.The sulfur powder was ball milled for 15 min to get the homogeneous sulfur powder.In a typical synthesis procedure, 0.4 g of ball milled SP was added into 60 ml of H 2 O and ethanol mixture (1:1 v/v) followed by ultrasonication for 30 min at 70 C. Then 10 g of TBOT dissolved in 50 ml ethanol was dropwise added to the sulfur suspension under ultrasonication at 70 C.The ultrasonication of the resulting mixture was continued for 1 h at the same temperature.The obtained precipitate was separated by centrifugation and dried in an air oven at 80 C followed by calcination under air at 450 C for 3 h with a ramp rate of 5 C min A1 .After cooling to room temperature, the obtained powder was ball milled for 15 min to get a homogeneous S-TiO 2 -2 powder.The similar method was applied by using 0.35 g and 0.50 g of SP to get S-TiO 2 -1 and S-TiO 2 -3 respectively.The bare TiO 2 powder was also prepared for comparison by the same procedure. The crystalline structure and phase transformation in the photocatalysts were identified by X-ray diffraction (XRD) patterns on a Bruker D8 Advance X-ray diffractometer using monochromatic Cu Ka (l 14 1.5418 A) radiation in the 2q range from 20 to 80 with a step size 0.02 s A1 .The crystallite size was estimated by applying the Scherrer's equation to the full width at half-maximum (FWHM) of the (101) peak of anatase 21. where K 14 0.9 is a shape factor for spherical particles, l is the wavelength of the incident radiation (l 14 1.54056 A), q is half of the diffraction angle (rad), and b is the line width at halfmaximum height (rad).Textural characterization of the samples was done with a Micromeritics ASAP 2010.The N 2 adsorption-desorption properties were examined at A196 C. Specific surface area of monolayer coverage was determined using Bru-nauereEmmetteTeller (BET) method.The pore size distribution was measured from the desorption branch of the isotherm using BarretteJoynereHalenda (BJH) method.The total pore volume was taken at the saturation of pores around P/P 0 14 0.99. Morphological information of the catalyst particles was investigated by FEI Quanta 200F scanning electron microscope (SEM) system equipped with energy-dispersive X-ray (EDX) spectroscopy.Both Transmission electron microscopic (TEM) and High Resolution-TEM analyses were performed on JEM-2100 instrument (JEOL, Japan).The accelerating voltage was 200 kV, and the resolution was 1.4 A. The catalyst particles were loaded on the carbon coated copper grid via dispersion in ethyl alcohol using the ultrasonic processor.The elemental mapping in HR-TEM was measured by an energy-dispersive spectrometer (EDX) produced by Phoenix using Si (Li) detector with an energetic resolution of 130 eV. The solid-state UVevis diffuse reflectance spectra were recorded with a Shimadzu 2600 UV/Vis-NIR spectrophotometer, equipped with an integrated sphere in the wavelength range of 200e800 nm, using BaSO 4 as the total reflecting standard.With the assumption of an indirect optical transition, the band gap energies of the photocatalysts were determined from the extrapolation of the Tauc plot to the abscissa of photon energy 34,35.Perkin Elmer Clarus 680 equipped with FID and TCD detector, plot-Q, shin carbon columns were used to analyze the gas samples.The quantification of the production yield was based on a calibration curve. Chemical composition determined from X-ray photoelectron spectroscopy (XPS) analysis of materials was carried out on model S/N-10001 (Prevac Poland) with a VG Scienta-R3000 hemispherical energy analyzer. The electronic structure for S-TiO 2 anatase TiO 2 was calculated with the Vienna ab initio simulation package (VASP) code in the framework of the spin-polarized density functional theory (DFT) 36,37.The exchange-correlation interaction was treated with the generalized gradient approximation of Perdew-Burke-Ernzerhof (GGA-PBE) 38 in conjunction with the on-site Coulomb correction on Ti 3d orbitals (the effective U 14 3.3 eV) 39.The on-site Coulomb correction alleviates the self-interaction error occurring in standard DFT 40 and improves the calculated band gap for anatase TiO 2 (from 2.0 eV without correction to 2.6 eV with correction in comparison to the experimental value of 3.2 eV).Projector augmented wave (PAW) potentials were used to describe the interaction between valence electrons and cores 41.The electronic wave function was expanded in a plane wave basis set with the energy cutoff of 400 eV.The valence configurations of O 2s 2 2p 4 , S 3s 2 3p 4 , and Ti 3d 3 s 1 were adopted in the current calculations. A large 3 A 3 A 1 supercell (including 36 Ti and 72 O atoms, shown in Fig. 6a) was used to simulate the low concentration of S in the TiO 2 lattice in accord with the experimental data.Both cationic and anionic sites (the Ti and O atoms highlighted in yellow in Fig. 6a) were inspected to determine the preferred substitution site for S doping.The effect of hydrogenation was also considered since it is expected that hydrogenation can change the electrical properties dramatically.A 3 A 3 A 3 k-point mesh grid was used to sample the Brillouin zone in the geometry optimization and a 5 A 5 A 5 mesh grid for the density of states (DOS). The photocatalytic reduction of carbon dioxide was carried out in a closed gas recirculation quartz reactor of 50 cm 3 internal volume.The quartz cylindrical reactor has ID 2.5 cm, OD 3.0 cm, and length of 12 cm.The reaction setup was equipped with a gas inlet, outlet, gas sampling port, and liquid sampling facility.The required amount of catalyst was suspended either in the 0.2 M base containing an aqueous solution, or ACN -H 2 O mixture with and without TEOA and ultrasonicated for 10 min for obtaining a homogeneous dispersion.The reaction mixture was preconditioned by repeated evacuation and purging with nitrogen to remove any dissolved gases followed by CO 2 purging for 30 min to get CO 2 saturated reaction mixture.The photocatalytic system was illuminated by an 8 W UVeA lamp (PEN-RAY lamp, 350 nm, 2.13\", Cole-Parmer, 120 mW cm A2 ) or 20 W visible light white cold LED lamp (Siska LED 20 mW cm A2 ) to drive the reaction.The distance from the quartz reactor to the light source was 0.2 cm, and 20 ml of the liquid catalyst suspension filled 4.5 cm of the reactor.A small aliquot of gas and liquid sample were taken out at regular time intervals, and the reaction progress was traced by a gas chromatograph Perkin Elmer Clarus 680 equipped with an FID and a TCD detector, and plot-Q shin carbon columns.The experimental set up for the photocatalytic reduction of CO 2 is shown in Fig. 1. To ascertain that the formed products were from the photoreduction of CO 2 , a series of blank experiments were performed in a preconditioned reactor under the following conditions: a) in the dark without CO 2 in the presence of the catalyst, b) in the dark with CO 2 in the presence of the catalyst, c) UVeilluminated in the absence of both CO 2 and the catalyst d) UVeilluminated in the presence of CO 2 and absence of the catalyst.No carbonaceous product was detected in the above blank tests.Similar blank tests were performed for the ACN -H 2 O mixture with and without TEOA in the absence of the catalyst under visible light and there also no carbonaceous products were observed in blank experiments. The quantum efficiency (QE) of the formation of the major product methanol was calculated as follows."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The XRD patterns of the prepared series of catalysts are shown in Fig. 2a.The major diffraction peaks observed in all samples can be indexed to the TiO 2 anatase crystalline phase (JCPDS 21-1272).However, a weak diffraction peak (2q 14 27.4 ) in bare TiO 2 corresponds to the rutile phase (JCPDS 76-1940).The bare TiO 2 exhibited anatase and rutile phases in the ratio of 92:8.The disappearance of the rutile peak with the increase in the amount of sulfur in sulfur-doped TiO 2 indicated that sulfur doping might have prevented the phase transformation from anatase to rutile 24.However, no significant characteristic peak corresponding to sulfur was detected for all sulfur-doped samples, suggesting that there is no crystalline elemental sulfur present in the prepared catalysts.Yet, Sdoped samples have shown broader peaks than the bare TiO 2 sample, as it can be seen in Fig. 2a (inset).Additionally, in comparison to pure TiO 2 , the position of major anatase peak at 2q 14 25.35 shifts to 25.53 , 25.61 and 25.90 for S-TiO 2 -1, S-TiO 2 -2, and S-TiO 2 -3, respectively, suggesting a distortion in the crystal lattices of S-doped TiO 2 by insertion of sulfur species.A decrease in the average crystalline size with an increase in sulfur doping amount was also observed by taking the plane (101) into consideration (Table 1).The sulfur doping suppresses the growth of TiO 2 nanoparticles and also suggest the incorporation of sulfur into the TiO 2 lattice 42. Nitrogen adsorption-desorption isotherms of complete series of S-TiO 2 photocatalysts are found to be of type IV, indicating the mesoporous nature of the material (Fig. 2b). Besides this, a steep increase in the hysteresis loop at P/P 0 0.99 as well as the pore size distribution indicates the presence of macropores (Fig. 2c).The isotherms confirm a bimodal pore size distribution, having two different hysteresis loops at different P/P 0 range.The hysteresis loop in all sulfur-doped catalysts meets at lower P/P 0 with higher volume in comparison to bare TiO 2 (Fig. 2b).The hysteresis loops in S-TiO 2 catalysts indicate that S doping helps to widen the pore size distribution range with increased mesopore volume by controlling the growth of TiO 2 nanoparticles (Fig. 2b, c, andd). The first peak in pore size distribution curve (Fig. 2c) in the vicinity of 3 nm corresponds to hysteresis loop between P/P 0 0.4e0.8 (Fig. 2b) and the second peak which starts from 50 nm corresponds to the hysteresis loop between P/P 0 0.8e0.9.Also, the surface area of TiO 2 increases (2 folds) as the amount of sulfur doping increases (Table 1).Noteworthy, the surface area of the S-doped TiO 2 in the paper is higher than most reported forms of sulfur-doped TiO 2 (Table 2).The UVeVis diffuse reflectance spectra of bare TiO 2 and Sdoped TiO 2 catalysts are shown in Fig. 3a.The absorption band edge of TiO 2 and S-doped TiO 2 samples are located at around 422 nm.The sulfur doping has not affected much the electronic properties of TiO 2, and it has similar electronic spectra.The band gap energy of the samples calculated using Tauc plot of F(R)hv 1/2 versus (hv) were found to be in the range of 2.95e3.04eV as shown in Fig. 3b. The morphology of bare TiO 2 and sulfur-doped TiO 2 are revealed by SEM micrographs.As shown in Fig. S1, all the catalysts have similar morphologies.There is not much difference between bare TiO 2 and S doped TiO 2, and the particles are of highly homogeneous size.Agglomeration is clearly observed and may be due to the interaction of smaller size particles.EDX analysis of the S-doped TiO 2 confirmed the presence of S, O, and Ti as illustrated in Figs.S2eS5.However, for the bare TiO 2 , only O and Ti were confirmed by EDX analysis 46. TEM images of TiO 2 and S-doped TiO 2 are shown in Fig. 4. TEM results show that prepared catalysts are of various shapes and the crystal facets are not well-formed.The particles size of bare TiO 2 is in the range of 10e26 nm with a mean of 17.9 nm.The sulfur doping helps to reduce the particle size 47.Here, the similar pattern is observed, and the particle size gradually decreases with an increase in sulfur doping amount.To understand the chemical state and composition of S in TiO 2 nanoparticles, XPS measurements of the prepared TiO 2 and S-TiO 2 -2 were performed.Fig. 5a shows XPS survey spectra of bare TiO 2 and S-TiO 2 samples.The presence of S2p peak only in the spectrum of S-TiO 2 indicates the successful doping of S in TiO 2 .The observed C1s in spectra arises from the impurity of the XPS instrument itself.As shown in Fig. 5b, the high-resolution XPS spectrum of the pure TiO 2 nanoparticles displays peaks at 458.3 and 464.1 eV, which are assigned to Ti2p 3/2 and Ti2p 1/2 of Ti 4 state 28.After the incorporation of S, the peaks position of Ti2p 3/2 and Ti2p 1/2 were slightly shifted to 458.1 and 464.0 eV as compared to the undoped TiO 2 (Fig. 5c).In addition, these peak areas become broadened.The changing peak position and the widened peak area of the S doped TiO 2 indicate an influence of S addition on the electronic state of Ti element; probably some of the Ti 4 ions get substituted with S 4 ions in the lattices forming Ti-O-S structure. The high-resolution spectrum of O1s of the bare TiO 2 is shown in Fig. 5d, which was deconvoluted into two peaks.The peaks observed at 529.6 and 531.6 eV are attributed to lattice oxygen and non-lattice oxygen (adsorbed OH groups), respectively 27.Similarly, the spectrum of O1s was fitted with two peaks for the doped TiO 2 (S-TiO 2 -2) as shown in Fig. 5e.The binding energy of lattice oxygen (O in TiO 2 ) shifted from 529.6 eV to 529.3 eV and its area decreases by 12.These shifts and reduction in the area suggest that Ti ions may have been replaced by S ions.Also, the binding energy of nonlattice oxygen (adsorbed OH group) shifted from 531.6 eV to 531.0 eV as well its area increases by 61 suggest the possibility of the formation of oxygen vacancies in the lattice. The high-resolution spectrum of S 2p peak of S-TiO 2 -2 reveals the presence of two peaks after deconvolution.As shown in Fig. 5f, the peak at 167.8 and 168.8 eV are assigned to the chemical states of S 4 and S 6 respectively.These states confirm the successful doping of S in TiO 2 .The peak located at 167.8 eV shows the presence of Ti-O-S bond in the lattice of TiO 2 28.Meanwhile, the peak ascribed to 168.8 eV indicates the presence of SO 4 2A ions on the titania surface 25,32,48.It is worthy to note that no peak corresponding to S 2A was observed; suggesting no formation of Ti-S-Ti bond as a result of S 2A replacing O in the lattice of TiO 2 48.To determine whether the cationic or anionic site is preferred for S substitutional doping, their formation energy is calculated according to the following formula.) where E(D) and E 0 are the energies of the systems with and without an S substitutional defect, m a is the chemical potential for species a, and n a is the number of that species.For our case n S 14 A1 and n Ti 14 1 or n O 14 1 for the substitution in cationic and anionic position, respectively.Among them, the Ti and O chemical potentials are restricted by the relation which is valid for bulk TiO 2 in thermodynamic equilibrium. According to the procedure developed for the preparation of S-TiO 2 anatase photocatalysts in the current experiment, S and O-rich conditions are assumed.As a result, the S reservoir is taken as the S elemental crystal 50, and the O reservoir is the O 2 molecule.The formation energies are A1.05 and 4.30 eV for S substituting for Ti and O, respectively.Obviously, the S doping at the cationic site is more stable than at the anionic site.This conclusion is consistent with the observation from the XPS results and experimental conclusion made by Ohno et al. 32.Substitution of S for Ti changes the local structure around the dopant.The dopant moves along (001) and (100) directions, as shown in Fig. 6b, leaving two O atoms about 2.5 A far from the dopant.Accordingly, the electronic structure is also altered by the S doping at the cationic site.An occupied bandgap state occurs about 0.3 eV above the valence band maximum, as shown in Fig. 6c.This electronic impurity level is a hybridized state contributed by O p orbitals, S p orbitals, and Ti d orbitals.Hydrogenation that may occur during the photocatalytic reaction dramatically changes the electrical property from insulating to metallic nature, as shown in Fig. 6d.The Fermi level crosses the lower part of the conduction band, and meanwhile, the impurity level gets closer to the valence band.It is expected that the improvement on the electrical conductivity will facilitate charge carriers transfer in the bulk of S-TiO 2 anatase particles and hence enhance the photocatalytic ability. The prepared photocatalysts TiO 2 , S-TiO 2 -1, S-TiO 2 -2, and S-TiO 2 -3 were tested in the photocatalytic reduction of CO 2 .A series of blank experiments were carried out to confirm that the resulting products were originated from the photocatalytic reduction of CO 2 .Each experiment was performed and repeated twice; maximum ca.5 error was observed, and the error bars were included in the experimental results. Initially, S-TiO 2 -2 was taken as a representative for the elucidation of the effect of the different base, catalyst amount, catalyst comparison and light source.These parameters were varied in order to get suitable reaction condition for optimum photocatalytic reduction of CO 2 .The effect of four different bases while keeping other parameters constant (5 mg catalyst, and UV-A) was measured and after 24 h of reaction time the products were analyzed by GC.As illustrated in Fig. 7a, KOH has performed the best and yielded methane in concentration 1330.5 ppm, 794.5 ppm of ethylene, 32.3 ppm of propylene and 11.2 ppm of propane.The activity trend observed was KOH z K 2 CO 3 NaOH.Na 2 CO 3 .The obtained results suggest that KOH is a suitable base to carry out the photocatalytic reduction of CO 2 in aqueous solution under UV-A.However, an increase in the amount of catalyst resulted in a decrease in product formation rate due to the shadow effect of the catalyst (Fig. 7b).The similar phenomenon was also reported in the literature 51,52.The effect of the amount of S in S-TiO 2 was investigated for S contents of 0, 0.35, 0.40 and 0.5 wt utilizing TiO 2 , S-TiO 2 -1, S-TiO 2 -2 and S-TiO 2 -3 photocatalysts at optimum reaction conditions.As illustrated in Fig. 7c, the product yield was found to be increased when S content increased from 0.35 to 0.40 wt; however, further increase in sulfur doping amount resulted in a significant decrease of products yield which might be due to the recombination of charges at the surface 53. CO 2 has a higher solubility in ACN compared to H 2 O. Therefore, the photocatalytic reduction of CO 2 was performed using ACN-H 2 O mixture as a solvent with or without the sacrificial agent (TEOA) under visible light.Since the prepared TiO 2 and S-TiO 2 absorb light at l 400 nm (Fig. 3) and hence may have visible light activity.TiO 2 was able to generate 1.9 mmol g A1 of methane and 2642.9 mmol g A1 of methanol while S-TiO 2 -2 has performed much better and yielded 846.5 mmol g A1 of methane and 4030.6 mmol g A1 of methanol in the ACN-H 2 O mixture as a solvent during the 24 h of reaction time (Fig. 7d).This indicates that S in TiO 2 has a positive effect on the electron conductivity and hence resulted in increased methane and methanol formation in comparison with pure TiO 2 .The presence of the sacrificial donor TEOA has a strong positive effect on the reaction and raised the methanol formation to 9833.8 mmol g A1 and methane to 4.3 mmol g A1 with pure TiO 2 ; while with S-TiO 2 -2 methanol formation reached 12828.4mmol g A1 with quantum efficiency of 5.53 and methane to 167.6 mmol g A1 in 24 h of reaction time. Since using TEOA as electron donor allowed obtaining relatively high reaction rate and about 13 mmol CH 3 OH was produced under visible light during the 24 h irradiation, it was important to understand if external or internal mass transfer played any role in preventing to obtain still higher methanol yields.In order to perform mass transfer limitation estimations, the concentration of CO 2 dissolved in reaction media was measured, and it turned out to be as high as 0.2 mol L A1 .It was also important to know the diameter of the catalyst particle in suspension which we took as 2 mm representing the largest particle estimate in accord with the literature 54,55.CO 2 diffusion coefficient was estimated as 0.510 A8 m 2 /s 56.First, we provide an estimate of the effect of external diffusion on the reaction rate.Due to the spherical symmetry of a particle in suspension, the rate of conversion W (mole s A1 ) depends on the diffusion according to the first Fick's law as shown in Eq. (1) below. where r is the radius, D is the diffusion coefficient of CO 2 (m 2 s A1 ), C is the CO 2 concentration (mol m A3 ).Integration of Eq. (1) in limits of concentration from bulk C 0 to concentration of CO 2 at the suspension particle surface C s , radius from infinity to suspension particle radius r s gives the following Eq.( 2). here, we imply that CO 2 concentration is large and according to Langmuir-Hinshelwwood equation, the rate does not depend on the CO 2 concentration.Assuming complete light absorption in each irradiated suspension particle and the irradiated area equal to the half surface of suspension in the quartz reactor, the rate of conversion per each particle is 6.210 A19 mol s A1 .From Eq. ( 2) we estimated the concentration change in the diffusion layer as small as 9.910 A6 mol m A3 .Therefore, external mass transfer due to the external diffusion to the photocatalyst particle in suspension cannot have any influence on the reaction rate.Second, we need to estimate a possible effect of internal diffusion in the catalyst pores on the reaction rate.Assuming that all the reaction proceeds at particle depth r 14 r s /2 and integrating Eq. (1), we obtain the following relation. where C r is the CO 2 concentration at the place of reaction (mol m A3 ), D eff is the effective diffusion coefficient computed as 0.110 A8 m 2 s A1 assuming pore volume 0.11 cm 3 g A1 , tortuosity 2, density 4 g cm A3 .The estimate using Eq. ( 3) results in internal concentration drop of about 510 A5 mol m A3 .This is a very small value in comparison with the high concentration of CO 2 in solution.Therefore, neither external nor internal mass transfer limits the rate of CO 2 photoreduction under the conditions providing the highest rate. Correlation of photocatalytic activities for the formation of hydrocarbons by TiO 2 and S-TiO 2 samples with physicochemical properties Hydrocarbons methane and ethylene were the main products for all the samples.Overall, the yield of both products increased remarkably after S doping to an optimum level and then decreased.Noticeably, S-TiO 2 -2 has exhibited the highest photocatalytic performance (6.25 mmol g A1 of methane and 2.74 mmol g A1 of ethylene) closely followed by S-TiO 2 -1.S-TiO 2 -2 showed the maximum conversion value of CO 2 possibly due to the maximal mesopore volume range (2e10 nm) with the absolute value 0.0523 cm 3 g A1 (Table 3).This also suggests that S-TiO 2 -2 sample (medium sulfur content) provides better diffusion conditions for methane and ethylene.This indicates that, apart from sulfur contribution, 2e10 nm are optimum pores for methane and ethylene.It is worthy to conclude that the samples prepared by sonothermal method here exhibited that 50 of the total pore volume lies below 20 nm pores irrespectively of their total pore volume.In other words, half of the total pore volume lies below 20 nm is not affected by the change in total volume.However, absolute values may be different depending upon total pore volume. The selectivity of S-TiO 2 -1 towards methane may be due to the presence of pores in the range of 2e10 nm (0.0465) and the range greater than 50 nm (0.0064).S-TiO 2 -2 selectivity towards ethylene may be due to larger pore volume in the range of 2e10 nm (0.0523) and the range greater than 50 nm (0.011) as compared to S-TiO 2 -1 (Table 3).Since ethylene is larger in size in comparison with methane, larger pores will favor its production.The lower activity of S-TiO 2 -3 towards both methane and ethylene can be explained by the range 2e10 nm (0.085) and greater than 50 nm (0.0337) which resembles the pore size distribution of the bare TiO 2 which has lower activity towards methane and ethylene.As seen as the bare TiO 2 and S-TiO 2 -3 have almost equal volume in the range of 2e10 nm and greater than 50 nm range and equal total pore volume.Therefore, these two samples (bare TiO 2 and S-TiO 2 -3) have almost similar activities.This study reveals that pore texture plays a vital role in CO 2 conversion.A small change in the range of 2e10 nm and greater than 50 nm plays a vital role in controlling the conversion and selectivity towards methane and ethylene. In the lights of the experimental results, characterization and computational studies, it was confirmed that sulfur doping in anatase TiO 2 enhanced the photocatalytic activity for CO 2 reduction which is most likely due to the improved electrical conductivity and facile charge carriers transfer in S-TiO 2 nanoparticles (Scheme 1).The oxidation state of sulfur also plays a significant role in the electron-hole pair separation.The S 4 can replace the Ti 4 in the lattice of TiO 2 which was proved by both XPS and theoretical calculation as the substitution of Ti 4 by S 4 is more exothermic than the substitution of O 2A (formation energy A1.05 and 4.30 eV for S substituting for Ti and O, respectively) 27,57. At pH 7, the reaction mixture contains an excess of OHi ons, which can participate in the photocatalytic reaction as hole scavengers.The higher concentration of OHions may lead to more availability of electrons for better CO 2 reduction and reduced the chances of further oxidation of intermediate species 58.It is known that CO 2 exists in aqueous solution in the form of hydrated CO 2 (CO 2 H 2 O), bicarbonate (HCO 3 ) and carbonate (CO 3 2 ) ions depending on the pH of the solution.Consequently, the reduction potential required for these species in aqueous solution is different from that for CO 2 at each particular pH.The reduction potentials of HCO 3 and CO 3 2 are known to be more positive in comparison to the CO 2 reduction at various pH, suggesting that less energy may be involved in the conversion of carbonate ions into reduction products 59e62.Additionally, HCO 3 and CO 3 2 can act as hole scavengers 63.A possible reaction pathway for the formation of different products from CO 2 in the aqueous medium is shown in Scheme 1.Some reduction products namely methane, ethylene, propylene, and carbon monoxide were obtained during the photoreduction in an aqueous medium under optimized experimental conditions.Though Habisreutinger et al. provided a comprehensive detail on the mechanistic carbene pathway for CO 2 to CO, CH 3 OH and CH 4 conversion 64.The carbonate ions present in the solution accept one electron and transform to CO 3 3 , which subsequently converts to CO 2 after the loss of oxygen radical 65.This is followed by the attachment of a hydrogen radical H with the cleavage of the bond between the carbon atom and oxygen atom leading to the formation of CO, which was detected in a trace amount in the products.The CO immediately accepts one electron and H to form carbon residue (C) at the surface of the photocatalyst.Further, C abstracts one H to form a CH radical, which serves as the link to all products.CH 4 is then formed after CH radical combine with three H .In case of visible light mediated photoreduction CO 2 in ACN-H 2 O mixture, higher conversion and selectivity towards methanol was obtained which is due to the higher solubility of CO 2 in polar aprotic solvents such as DMF, DMSO, and ACN 68."
  },
  {
    "title": "Conclusions",
    "content": "In conclusion, we have demonstrated the first successful application and insight of sulfur-doped TiO 2 as an improved photocatalyst for the reduction of CO 2 to hydrocarbon products under UV-A and visible light irradiation with or without sacrificial electron donor.The XPS reveals that S is predominantly present as S 4 in S-TiO 2 , which could help delay the e Ah recombination.A significant enhancement in the photocatalytic CO 2 reduction using S-TiO 2 was observed as compared to the bare TiO 2 .The presence of the base in aqueous medium played a significant role and afforded hydrocarbon products such as methane, ethylene, and propylene; whereas, in ACN-H 2 O mixture, methane and methanol were selectively formed with the 846.5 mmol g A1 of methane (17.4) and 4030.6 mmol g A1 of methanol (82.6).The addition of TEOA as sacrificial donor further enhanced the methanol formation by 3 fold with the selectivity of 98.7.The DFT calculation further supports that sulfur doping improves the electrical conductivity and facilitates the charge transfer in the bulk of S-TiO 2 anatase particles and hence enhances the photocatalytic activity. Fig. 1 e Schematic diagram of the experimental setup used for the photocatalytic activity measurements. MEOH ; 14 6 x moles of product x electrons required for reduction moles of the incident photon x 100:i n t e r n a t i o n a l j o u r n a l o f h y d r o g e n e n e r g y x x x ( 2 0 1 8 ) 1 e1 4 Fig. 2 e (a) XRD patterns (b) N 2 adsorption-desorption isotherms (c) Pore size distribution curve and (d) Desorption cumulative pore volume curve of bare TiO 2 , S-TiO 2 -1, S-TiO 2 -2 and S-TiO 2 -3 photocatalysts. i n t e r n a t i o n a l j o u r n a l o f h y d r o g e n e n e r g y x x x ( 2 0 1 8 ) 1 e1 4The obtained particle sizes are aligned with the XRD results.S-TiO 2 -1 has a particle size in the range of 7e21 nm with a mean of 12.7 nm, S-TiO 2 -2 in the range of 7e15 nm with a mean of 8.4 nm and S-TiO 2 -3 in the range of 5.8e11 nm with a mean of 7.63 nm.HR-TEM images in Fig.4have d-spacing 3.50 A corresponding to (101) planes of anatase TiO 2 and the presence of clear lattice fringes indicate the crystalline nature of the catalysts.The TEM elemental mapping confirms the presence of sulfur (Figs.S7eS9) but bare TiO 2 does not have sulfur content (Fig. S6). Fig. 3 e (a) UVeVis spectra (b) Tauc plot for bare TiO 2 , S-TiO 2 -1, S-TiO 2 -2 and S-TiO 2 -3 photocatalysts. Fig. 6 shows optimized structures for pristine TiO 2 anatase and S-TiO 2 doped via isomorphic substitution of Ti for S and density of states for S-TiO 2 .The optimized crystallographic Fig. 5 e (a) XPS survey spectra of bare TiO 2 and S-TiO 2 -2, (b, c) High resolution XPS spectra of Ti2p in bare TiO 2 and S-TiO 2 -2, (d, e) High resolution XPS spectra of O1s in bare TiO 2 and S-TiO 2 -2, (f) High resolution XPS spectra of S2p in S-TiO 2 -2. Fig. 6 e The 3 3 1 supercells for (a) the ideal lattice with a Ti and O atom highlighted in yellow and (b) the defective lattice with S substituting for Ti and meanwhile H binding to O (the Ti, O, S, and H atoms are depicted in blue, red, yellow and white, respectively); density of states for the system with S doping at the cationic site (c) before and (d) after hydrogenation.(For interpretation of the references to color/colour in this figure legend, the reader is referred to the Web version of this article.) Fig. 7 e (a) Effect of the base on photocatalytic reduction of CO 2 in 24 h under UVeA light.(b) Effect of catalyst amount on photocatalytic reduction of CO 2 in 24 h under UVeA light.(c) Effect of doping amount in the gas phase on photocatalytic reduction of CO 2 in 24 h under UV-A irradiation.(d) Effect of the sacrificial agent TEOA on photocatalytic reduction of CO 2 in ACN and H 2 O mixture in 24 h under visible light irradiation. Scheme 1 e Main reaction routes of photogenerated electrons and holes in S-doped TiO 2 . Physico-chemical properties of the bare TiO 2 , S-TiO 2 -1, S-TiO 2 -2 and S-TiO 2 -3 photocatalysts. 2/g) Pore volume (cm 3 /g) Average Pore width (nm) Pore Maxima (nm) Comparison of our prepared sulfur-doped TiO 2 catalysts with previous studies. Percentage of volume in pores of different diameter (nm) for bare TiO 2 , S-TiO 2 -1, S-TiO 2 -2 and S-TiO 2 -3 photocatalysts. i n t e r n a t i o n a l j o u r n a l o f h y d r o g e n e n e r g y x x x ( 2 0 1 8 ) 1 e1 4 Please cite this article in press as: Olowoyo JO, et al., Reinforced photocatalytic reduction of CO 2 to fuel by efficient S-TiO 2 : Significance of sulfur doping, International Journal of Hydrogen Energy (2018), https://doi.org/10.1016/j.ijhydene.2018.07.193 Authors are grateful to Director, CSIR-IIP for his kind permission to publish the results.Umesh Kumar is thankful for Council of Industrial Scientific Research, India (CSIR) for research funding (CSC-117/WP-1).Authors are thankful to ASD, CSIR-IIP for their analytical support. Supplementary data related to this article can be found at https://doi.org/10.1016/j.ijhydene.2018.07.193.r e f e r e n c e s"
  }
]