[
  {
    "title": "Doi",
    "content": "10.1016/j.jcis.2021.08.135"
  },
  {
    "title": "Article_Title",
    "content": "The covalent Coordination-driven Bi2S3@NH2-MIL-125(Ti)-SH heterojunction with boosting photocatalytic CO2 reduction and dye degradation performance"
  },
  {
    "title": "Abstract",
    "content": "h i g h l i g h t sThe assembly of Bi 2 S 3 NH 2 -MIL-125 (Ti)-SH heterojunction is coordination-driven.The introduction of Bi 2 S 3 into NH 2 -MIL-125 can lead to n-scheme heterojunction.x-Bi 2 S 3 NH 2 -MIL-125-SH photocatalyze CO 2 reduction and degradation of MB efficiently. g r a p h i c a l a b s t r a c tThe novel x-Bi 2 S 3 NH 2 -MIL-125-SH composites explore an effective n-scheme heterojunction charge dynamics oriented mechanistic approach towards photocatalytic CO 2 reduction and photodegrade methylene blue."
  },
  {
    "title": "Experimental",
    "content": "Typically, the NH 2 -MIL-125 nanocrystals were synthesized according to the literature 34.Briefly, titanium isopropoxide (0.6 mL, 3.16 mmol) and NH 2 -BDC (0.572 mg, 3.16 mmol) were added in the mixed solution (DMF : MeOH 4:1).The mixture was mixed with stirring and then transferred into a Teflon-lined steel autoclave.The oven kept at 110 C for 72 h.After cooling to room temperature, the solid powders were isolated by filtration and thoroughly washed with MeOH and deionized water several times, then dried at 60 C under vacuum for 24 h. In order to tune the surface chemistry of MOFs, the synthesized NH 2 -MIL-125 were firstly treated by sodium 3mercaptopropanesulphonate, forming the mercapto functionalized NH 2 -MIL-125 (named as MIL-125-S) as shown in Scheme 1.The 100 mg NH 2 -MIL-125 nanocrystals were mixed in 50 mL of sodium 3-mercaptopropanesulphonate / methanol solution (c 4 mg/mL) and sonicated for 30 min.The obtained mixture was stirred for 24 h at room temperature.The solid products were collected by filtration and thoroughly washed with MeOH and ethanol three times, then dried at 60 C for 12 h in the vacuum drying oven. Typically, 100 mg MIL-125-S samples were mixed and sonicated in 40 mL deionized water.12 mg of Bi(NO 3 ) 3 A5H 2 O was added into the obtained suspension with constant stirring, followed by the dose of 3.75 mg of TAA.Then, the mixture was sonicated for 1 h.The products were dispersed in 50 mL of DMF after the centrifugation and abstersion.The obtained mixture was added in a Teflon-lined stainless steel autoclave and kept in an oven at 160 C for 4 h. Furthermore, the various proportions of products were termed to x-BM-S, where A is the mass of Bi(NO 3 ) 3 A5H 2 O (x 12, 18, and 24).For comparison, the Bi 2 S 3 NH 2 -MIL-125 (BM) samples were synthesized in the consistent conditions previously without sodium 3-mercaptopropanesulphonate.Simultaneously, Bi 2 S 3 NPs were synthesized in the same conditions without NH 2 -MIL-125. Powder X-ray diffraction (PXRD) patterns were collected on a Bruker D8 Advance X-ray diffractometer with Cu Ka radiation in the 2h range of 5-50(k 1.5418A, 40 kV, 40 mA).Scanning electron microscopy (SEM) was performed on S-4800 II microscope (Hitachi).Transmission electron microscopy (TEM) and highresolution transmission electron microscopy (HRTEM) were conducted on FEI JEM-2100.UV-vis diffuse reflectance spectra were obtained on Agilent Cary 5000 spectrophotometer over a range of 200-800 nm, using BaSO 4 as reflectance standard.Photoluminescence spectra were investigated on a Varian Cary Eclipse spectrometer (Hitachi F-7000).X-ray photoelectron spectroscopy (XPS) was performed on a Physical Electronics PHI-5702 system with a monochromatic Al Ka source and a charge neutralizer.Electronspin-resonance spectra were recorded on a Bruker ESP 300 E electron paramagnetic resonance spectrometer at room temperature with the signals of radicals trapped by 5,5-dimethyl-1-pyrroline N-oxide (DMPO). To investigate the electrochemical and photoelectrochemical behavior of the as-prepared samples, a standard three-electrode system with Ag/AgCl, Pt foil, and the samples coated on nickel foam electrode were used as standard electrode, counter electrode, and working electrode respectively.The transient photocurrent response curves were recorded using a CHI instruments electrochemical workstation (model 660D) in a 0.5 M Na 2 SO 4 solution under visible-light irradiation.A 500 W xenon lamp with a highpass filter (420 nm) was used as the light source.The working electrodes were fabricated according to the following steps: the photocatalysts were adhered to a 10 A 30 mm nickel foam.The assynthesized samples, super P, and Teflon emulsion were mixed at a weight ratio of 16:2:1.Then, the homogeneous mixtures were added to the nickel foam.Moreover, the Electrochemical Impedance Spectroscopy (EIS) tests were carried out using open circuit potential over the frequency range between 10 5 and 10 -1 Hz.Linear sweep voltammetry (LSV) was conducted in the electrolyte of Na 2 -SO 4 aqueous solution with a scan rate of 5 mV s A1 under irradiation. The photocatalytic reactions were performed in Perfect Light, Lab solar-IIIAG photoreactor (d 4 cm) with a condensate circulating water filter to shield the photothermal effect.Firstly, photocatalysts (100 mg) were scattered in MeCN (4 mL) and TEOA (1 mL).Pure CO 2 gas was injected into the closed system with condenser circulation pump in the evacuation reaction system.A 300 W xenon arc lamp was used as the light source, and the gas products were monitored by gas chromatography (GC-9700).All photocatalytic data were repeated at least three times.Recycling experiments were performed under similar conditions by using the collected catalyst instead of the fresh one. The photocatalytic degradation of MB was performed to investigate the photocatalytic performance of photocatalysts under visible-light irradiation.In a typical process, 20 mg of the photocatalyst was well dispersed in 60 mL of MB solution (80 mg L A1 ) in a condensation beaker, and the obtained suspension was then irradiated under a 300 W xenon lamp fitted with a 420 nm cutoff filter.Prior to irradiation, the suspension was stirred under dark condition for 60 min to reach an adsorption-desorption equilibrium.During the photodegradation process, stirring was maintained to keep the mixture as a suspension.4 mL of the supernatant was removed from the vessel at different time intervals and centrifuged to monitor the reaction process using UV-vis spectroscopy at 665 nm."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The PXRD patterns of all samples are displayed in Fig. 1a, which confirm the presence of NH 2 -MIL-125 and Bi 2 S 3 .For pure Bi 2 S 3 NPs, the characteristic diffraction peaks of 22.3, 25, 28.6and 31.7c an be corresponding to the (2 2 0), (1 3 0), (2 1 1), and (2 2 1) planes (JCPDS no.17-0320), respectively 35,36.It is noted that the signals of peaks of Bi 2 S 3 for all x-BM-S samples are slightly weak.It indicates that the Bi 2 S 3 NPs existed in x-BM-S are uniformly distribute or small-size.Furthermore, the PXRD patterns show typical diffraction peaks of NH 2 -MIL-125, which can match the data in reported literature 37,38.In addition, with the increasing ratio of Bi 2 S 3 , the peak signals of NH 2 -MIL-125 gradually decrease while those of Bi 2 S 3 increase.Simultaneously, no significant shift and excess peaks are observed, manifesting that the NH 2 -MIL-125 sustains the crystalline structure after load of Bi 2 S 3 .In addition, the FT-IR spectra of the samples are depicted in Fig. 1b.In the region of 3300-3600 cm A1 there is regared as the amino m N-H 39.The absorption range from 1400 to 1700 cm A1 is typical vibrational bands attributed to the carboxylate groups of the linkers 40.Moreover, the absorption peak around 1537 cm A1 is assigned to the m CC skeletal vibration of the benzene ring, and the absorption peak at around 1259 cm A1 belongs to the m C-N stretching vibration from the aromatic amines in NH 2 -MIL-125 34.The absorption bands between 500 and 800 cm A1 are ascribed to the characteristic O-Ti-O vibrations 22.Moreover, no obvious structural variation is observed between x-BM-S and NH 2 -MIL-125, which verifies that the introduction of Bi 2 S 3 does not break the structure of The scanning electron microscopy analysis was carried out to investigate the morphology and macrostructure of the prepared samples.Fig. S1a shows that the pristine NH 2 -MIL-125 performs uniform disk-shaped morphology with an average particle size of 500 nm.Compared to NH 2 -MIL-125, The MIL-125-S nanocrystals retain structural features in Fig. S1b.It means that the morphology of NH 2 -MIL-125 remains original structure during the postsynthetic modifications with the sodium 3mercaptopropanesulphonate.As displayed in Fig. S1c, the obvious aggregation can be observed for the pristine Bi 2 S 3 NPs.For all x-BM-S composites with different ratio of Bi 2 S 3 (Fig. S2a-c), it is noticed that the surface of NH 2 -MIL-125 became rough, but the morphological characteristics can be maintained after postsynthetic modifications with sulfydryl groups.Moreover, the high magnification SEM image in Fig. S2d can further verify that Bi 2 S 3 homogeneous distribution on the surface of NH 2 -MIL-125 without apparent aggregation. The detailed morphology and microstructure of the samples were investigated by the TEM.The typical morphology of NH 2 -MIL-125 with the smooth surface and decent crystallinity is further verified in Fig. S3a, which include C, N, O and Ti elements.Moreover, compared to NH 2 -MIL-125, the MIL-125-S samples retain structural features and involve C, N, O, Ti and S elements (Fig. S3b).It is attributed to the -SO 3 group in sodium 3-mercaptopropanesulphonate reacts with the -NH 2 in NH 2 -MIL-125.Observably, the sulfydryl (-SH) groups grafted on the surface of MOFs by covalent coupling reaction can contribute to the further assembly process and the uniform dispersion of Bi 2 S 3 NPs.As depicted in Fig. 2, it is can be explained that the 3mercaptopropanesulphonate binder possesses one sulfoacid group for covalent bonding with the -NH 2 in the MOF and the sulfydryl group as a docking site to anchor Bi ions, and the precise coordination has been constructed.Fig. 3 show the TEM images of x-BM-S, which reveal that the NH 2 -MIL-125 nanocrystals for 18-BM-S are homogeneously encapsulated by Bi 2 S 3 campared with 12-BM-S and 24-BM-S samples.Moreover, the resolved lattice fringes of 0.312 nm in Fig. 3e can be observed, corresponding to (2 1 1) plane of orthorhombic Bi 2 S 3 .Moreover, the element mapping analysis of 18-BM-S was provided and exhibited the evenly intersperse of Bi and S elements.in Table 1.For the NH 2 -MIL-125 nanocrystals, the N 2 adsorption isotherm presents the typical I isotherm without any hysteresis loop, and the BET specific surface area is 959.9 m 2 g A1 .Due to the porous nature of NH 2 -MIL-125 and its large specific surface area, the BET surface area of the 18-BM-S composites dramatically increase from 22.2 m 2 g A1 to 432.8 m 2 g A1 compared to the pristine Bi 2 S 3 .Moreover, the N 2 adsorption isotherm is still typical I isotherm, but the presence of small hysteresis loops at high relative pressure indicates the existence of mesopores from the heaping of the Bi 2 S 3 NPs 41.Generally, the adsorption of photocatalysts for CO 2 is crucial for photocatalytic CO 2 reduction 42.As shown in Fig. 4b, the CO 2 adsorption behavior of these photocatalysts is also investigated, and the 18-BM-S composites exhibit relatively large amounts CO 2 uptakes.The maximum CO 2 uptake capacities of samples follow the order (Table 1): NH 2 -MIL-125 (3.22 mmol/g) 18-BM-S (2.92 mmol/g) Bi 2 S 3 (2.37 mmol/g).Due to that the existed Bi 2 S 3 in NH 2 -MIL-125 occupies some active sites of CO 2 adsorption, it can be observed that 18-BM-S samples display slightly lower CO 2 uptake compared with NH 2 -MIL-125 nanocrystals.As a comparison, 18-BM-S reveals 1.23 times higher CO 2 uptake than that of Bi 2 S 3 .Notably, the outstanding specific surface area and CO 2 adsorption capacities of x-BM-S can provide more reactive sites during the photocatalytic CO 2 reduction.Moreover, the FT-IR spectra over the 18-BM-S phototcatalysts were texted filled with the gas of CO 2 .As depicted in Fig. 4c, the absorption peak of CO 2 molecule at around 2349 cm A1 can be clearly observed.As absorption time goes on, the peak gradually weakens, which further indicating the CO 2 molecule can be captured by phototcatalysts. The photocatalytic activity of CO 2 reduction over 18-BM-S was quantified in a closed reactor filled with CO 2 under irradiation.Simultaneously, photocatalytic CO 2 reduction experiments were measured in the absence of CO 2 or catalysts.As no product can be observed in the reactor, the reaction of photocatalytic CO 2 reduction only occurs for the conditions of existence of CO 2 and photocatalyst, instead of the sample breaking down to generate product.As shown in Fig. 5a, CO molecule, as the major reduced product, can be detected along with a little product of CH 4 for all samples under irradiation.Due to the strong heterojunction, the production rate is significantly enhanced.Particularly, the CO production rate of 18-BM-S is 12.46 lmol g A1 h A1 , which is 1.87 times of Bi 2 S 3 and 13.60 times of NH 2 -MIL-125.Furthermore, it is comparable or higher than some reported photocatalysts (Table S1).These results confirm that 18-BM-S composites are more effective in obtaining high photocatalytic activity for CO 2 reduction and improving the physicochemical properties of materials by constructing the strong heterojunction of Bi 2 S 3 and NH 2 -MIL-125.Moreover, it's worth noting that the introduction of Bi 2 S 3 NPs in NH 2 -MIL-125 improves the photocatalytic activity of CO 2 reduction and conduces to high CO selectivity.As exhibited in Fig. 5b, the 18-BM-S surely obtains the higher CO selectivity during photocatalytic CO 2 reduction (98.89 ) than pristine NH 2 -MIL-125 (81.79 ).Notably, the high CO selectivity of 18-BM-S contributes to the preparation of high purity CO by improving the utilization of electrons.As displayed in Fig. 5c, TEOA is regarded as a proton and electron donor in the CO 2 reduction reaction, offering 2e A and 8e A for photoreduction products of CO and CH 4 , respectively.The R electron of the 18-BM-S composites is 26.04 lmol g A1 h A1 , which is comparable or higher than some reported photocatalysts (Table S1).It is noteworthy that 18-BM-S displayed favorable durability after five cycles, and the photocatalytic activity sustained about 90.2 compared with the initial test (Fig. 5d).Moreover, based on the analysis of PXRD, FT-IR and TEM, no significant differ- ence for used 18-BM-S (used after 5 cycles) can be observed compared with fresh one (Fig. S4).These results further reveal that x-BM-S heterojunction has outstanding stability during photocatalytic CO 2 reduction. To further determine the influence of the interfacial modification of sulfhydrylation for the synthesis of heterostructure, photocatalytic degradation reaction under visible-light irradiation at room temperature was utilized and diaplayed in Fig. 6a.The methylene blue (MB) in aqueous solution (80 mg/L) was regard as model substrate during the photodegradation experiments.As comparison, the contrast experiments with other photocatalysts were also tested under the similar conditions, such as commercial P25, BM, pure Bi 2 S 3 and NH 2 -MIL-125 samples.The NH 2 -MIL-125 nanocrystals show the highest adsorption (34.7 ) among all samples, and it is 38.6 times to that of Bi 2 S 3 .It is also attributed to the high specific surface area and ordered pore size distribution, which is well in agreement with BET results.Generally, the MB molecule in high concentration is basically stable under visible light irradiation, and the blank experiment without any photocatalysts confirms the result.Furthermore, all the x-BM-S heterostructures exhibit more excellent photodegradation activities than that of the commercial Degussa P25 sample.More importantly, the 18-BM-S composites display the highest degradation effect, and the photodegradation activities increase from 3.5 (observed for the pristine Bi 2 S 3 ) to 96.5 after 150 min.Interestingly, the 18-BM-S composites also show higher photocatalytic efficiency than that of the 18-BM samples, indicating the observably advantage of the modification of sulfhydrylation to reinforce the interfacial interactions between the NH 2 -MIL-125 and Bi 2 S 3 nanoparticles. Moreover, the kinetic behaviors of photodegradation MB over different samples were investigated under visible light irradiation.Based on ln(C 0 /C) kt, the photodegradation curves of photocatalysts can match the pseudofirst-order kinetic model as described in Fig. 6b.In the equation, the C 0 is regard as the initial concentration of MB, C refers to the concentration of MB after some certain reaction time (t), and k is consider as the relative reaction rate constant 43.The values of k can be determined from the slope of the linear plot based on the Langmuir-Hinshelwood model.The values of k of samples follow the order (Fig. 6c S2).Notably, the value of k of 18-BM-S is uppermost, being 150.6 times higher than that of pristine Bi 2 S 3 and 160.7 times of commercial P25.More importantly, the value of k of 18-BM-S composites is about 1.88 times higher than that of 18-BM without Meanwhile, to evaluate the cyclic stability of the photocatalyst after reaction, the samples were reused for the next photodegradation reaction after the centrifugation and abstersion.As depicted in Fig. 6d, the photodegradation activity of 18-BM-S is maintained with only about a 6.3 loss after five cycles, and the photodegradation efficiency sustains at least 90 , which indicates its outstanding stability.Nevertheless, the photodegradation activities of 18-BM decreased from 88.2 to 79.8 , with about an 8.4 loss.Therefore, it is reasonable to demonstrate that the strong heterostructure based on the influence of the interfacial modification is responsible for the favorable photostability. Inspired by the enhanced photocatalytic activity, we studied its optical and electrochemical properties of photocatalysts in depth.The XPS analysis was firstly measured in order to investigate elemental composition and the chemical states of photocatalysts.In Fig. 7a, The survey XPS spectrum of 18-BM-S reveals that the elemental compositions are primarily consisted of C, N, O, Ti, Bi and S elements, which is highly coincident with the elemental mapping results.For Bi 2 S 3 , the two distinct peaks at 158.0 eV and 163.3 eV observed for Bi 4f are regard as the Bi 4f 7/2 , Bi 4f 5/2 , while the peaks at 159.6 eV and 160.8 eV observed for S 2p belong to S 2p 3/2 and S 2p 1/2 transitions, respectively (Fig. 7b).The chemical states of Bi and S can be regard as Bi 3 and S 2A due to the calculated spin orbit separations of 5.3 eV for Bi 4f and 1.2 eV for S 2p 44.Compared with pure Bi 2 S 3 , the obvious shift to high binding energy for Bi 4f and S 2p in the 18-BM-S can be observed, which is attributed to the largely decreased electron cloud density of Bi 2 S 3 centers due to the strong interaction between Bi 2 S 3 and NH 2 -MIL-125-125.As depicted in Fig. 7c, it can be observed that the binding energy of Ti 2p for 18-BM-S displays slightly higher values (458.9 eV for Ti 2p 3/2 , 464.6 eV for Ti 2p 1/2 ) than those of pure NH 2 -MIL-125-125 (458.6 eV for Ti 2p 3/2 , 464.3 eV for Ti 2p 1/2 ).In Fig. 7d, the peaks observed in the N 1 s spectra are located at 399.6 eV and 401.9 eV.These results further confirm that interfacial modification of sulfhydrylation can contribute to the formation of close interaction between the Bi 2 S 3 and NH 2 -MIL-125. As exhibited in Fig. 8a, UV-vis diffuse reflectance spectra are examined.For NH 2 -MIL-125 samples, the two absorption peaks around 300 and 400 nm belong to the absorption of Ti-oxo clusters and ligand 45.The absorption range of pure Bi 2 S 3 involves the UV and visible light region, manifesting its favorable optical response.It is generally believed that energy band structures are dominant roles to the feasibility of photocatalytic reaction.The Kubelka-Munk function is utilized to identify the band gap energies of photocatalysts 46.Accordingly, the band gap energies can be calculated to be 1.51, 2.68, 2.62, 2.57, and 2.74 eV for Bi 2 S 3 , 12-BM-S, 18-BM-S, 24-BM-S, and NH 2 -MIL-125.The result is shown in in Fig. 8b as a (ahv) 2 vs. hv plot.Furthermore, the Mott-Schottky plots were investigated to confirm the band position of samples.As dis- In addition, steady PL spectral measurements were also examined to investigate photogenerated carriers separation properties.As displayed in Fig. 9a, all samples show certain fluorescence at 468 nm under the excitation wavelength of 325 nm.It's worth noting that the lowest intensity of fluorescence proves that the photoinduced carriers cannot recombine easily 51.Moreover, the PL signals of x-BM-S decrease tremendously with the introduction of Bi 2 S 3 NPs.the lowest intensity of PL for 18-BM-S can attribute to the establishment of an efficient electron transfer path between NH 2 -MIL-125 and Bi 2 S 3 , which confirms that 18-BM-S can achieve the efficient carriers separation and fast surface reaction dynamics.The effective electronic interactions of all samples were carried out and investigated by the transient photocurrent under on-off simulated irradiation (Fig. 9b).Bi 2 S 3 NPs show lowest photocurrent density owing to the rapid recombination of photogeneration car-riers.Notably, the 18-BM-S composites promptly yield a conspicuously enhanced photocurrent density compared with the pure Bi 2 S 3 and NH 2 -MIL-125.More importantly, the stable photogenerated current value observed for 18-BM-S composites is 1.29 times over the 18-BM composites under the same conditions.The favorable photocurrent indicates that the separation efficiency of the photoinduced carriers for 18-BM-S heterostructures can be significantly improved by constructing the strong interaction of Bi 2 S 3 and NH 2 -MIL-125, which is responsible for outstanding photocatalytic activities 52.Moreover, the EIS Nyquist plot of the NH 2 -MIL-125, Bi 2 S 3 , and x-BM-S were carried out and displayed in Fig. 9c and Table 2.The Nyquist plot of 18-BM-S composites shows the smallest semicircular at high frequency, and the charge transfer resistance (R ct ) of 18-BM-S is the lowest among that of all samples, indicating the excellent electron transfer of 18-BM-S during photocatalytic CO 2 reduction 53.In other words, compared with 18-BM composites, the 18-BM-S composites can form a stronger interaction and further remarkably drive rapid surface reaction dynamics.Furthermore, LSV curves of samples are studied.The current density of 18-BM-S is the highest, indicating that the introduction of Bi 2 S 3 into NH 2 -MIL-125 significantly improves the current density (Fig. 9d).This result strongly verifies that the 18-BM-S significantly induce electron-hole separation and boosts the transportation of photogenerated charges.Based on these results and analysis mentioned above, the strong interaction between the Bi 2 S 3 and NH 2 -MIL-125 can observably restrain carriers recombination, accelerate electron transfer, and achieve low impedance to enhance the photocatalytic activity for CO 2 reduction.In addition, to verify the reactive species during the photodegradation process, the reactive species trapping experiments were measured and described in Fig. 10a.It is generally believed that superoxide anion radicals ( O 2 A ), hydroxyl radicals ( OH) and holes (h ), are the major active species during photodegradation reaction 25.The scavengers such as para-benzoquinone (p-BQ), isopropyl alcohol (IPA), and ethylenediaminetetraacetic acid disodium (EDTA-Na) are utilized for the photoinduced O 2 A , OH, and h , respectively 54.Photodegradation efficiency of MB observably decreases after the addition of p-BQ, while only a slight effect is seen after adding IPA.The result verifies the crucial role of O 2 A towards photodegradation of MB instead of OH.Due to the direct interaction between photoinduced electron and absorbed O 2 molecules on the surface of photocatalyst, the free electrons can create O 2 A and further react with dye molecules.Moreover, the ESR experiments were also tested to give direct evidence of O 2 A free radical utilizing the DMPO as trapping agents for free radicals Furthermore, it is well in agreement with reactive species trapping experiments. Based on these results and analysis mentioned above, the plausible mechanism for photocatalytic reaction was propose as described in Fig. 11.Upon irradiation, Bi 2 S 3 and NH 2 -MIL-125 were excited simultaneously.Moreover, the CB potentials for Bi 2 S 3 (-0.99eV vs. NHE) had more negative potential compared to the LUMO of NH 2 -MIL-125 (-0.72 eV vs. NHE).The electrons were inclined to migrate from the CB of Bi 2 S 3 to the LUMO of NH 2 -MIL-125 after the formation of a heterojunction.Therefore, the electron density of Bi 2 S 3 decreases, which is well consistent with the results from the XPS results.In addition, the HOMO of NH 2 -MIL-125 (2.02 eV vs. NHE) was more positive potential than the VB of Bi 2 S 3 (0.52 eV vs. NHE).Thus, the produced h from VB of Bi 2 S 3 could migrate to the HOMO of NH 2 -MIL-125 via their intimate interfacial contact. Therefore, the conceivable mechanism for photocatalytic CO 2 reduction was carried out.In the first place, the x-BM-S can adsorb and trap CO 2 molecular due to the favorable specific surface area and ordered pore size distribution.According to energy band structures, the photogenerated electrons concentrated on the CB of Bi 2 S 3 NPs transfer to the NH 2 -MIL-125 via the close interface The simulated internal resistance (calculated equivalent series resistance, R ESR ), charge transfer resistane (R ct ) based on the Nyquist plots in Fig. 9c, and the photoelectric conversiton efficiency (ICPE). Bi between two components.Considering that the redox potential of CO/CO 2 is about A0.53 eV and the redox potential of CO/CH 4 is about A0.24 eV, the photogenerated electrons can transfer from NH 2 -MIL-125 (-0.72 eV vs. NHE) to CO 2 and achieve photocatalytic CO 2 reduction 56,57.In addition, the plausible reaction mechanism for the photodegradation of MB was proposed.The LUMO of NH 2 -MIL-125 (-0.72 eV vs. NHE) had more negative potential compared to O 2 A /O 2 (-0.33 eV vs. NHE) 58,59.Therefore, it can trap the adsorbed O 2 in solution and generate the highly active O 2 , which can further react with MB molecules.On the other hand, due to the more positive potential at the HOMO of NH 2 -MIL-125 (2.02 eV vs. NHE) compared with the VB of Bi 2 S 3 (0.52 eV vs. NHE), the h at Bi 2 S 3 can further react with MB molecules.The favorable photocatalytic performance of 18-BM-S heterojunction can attribute to the excellent separation and transfer of photogenerated carriers via the strong interaction between the Bi 2 S 3 and NH 2 -MIL-125."
  },
  {
    "title": "Conclusions",
    "content": "Herein, we have accurately designed and successfully synthesized the well-dispersed Bi 2 S 3 on NH 2 -MIL-125 as a highly active photocatalyst for photocatalytic CO 2 reduction with high CO selectivity and photodegrade MB.The strong interaction of Bi 2 S 3 and NH 2 -MIL-125 can possess unusual photocatalytic activity and outstanding stability compared with pure NH 2 -MIL-125, Bi 2 S 3, and BM-S composites.Notably, the highly photocatalytic efficiency can be attributed to the interfacial modification of sulfhydrylation based on tuning the surface chemistry of MOFs.This work provides a common design route of heterostructure that is conducive to the construction of intimate contacted interfaces in photocatalysts. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Materials 2-aminoterephthalic acid (NH 2 -BDC), titanium isopropoxide (C 12 H 28 O 4 Ti), bismuth nitrate pentahydrate (Bi(NO 3 ) 3 A5H 2 O), thioacetamide (C 2 H 5 NS, TAA), sodium 3-mercaptopropanesulphonate (C 3 H 7 NaO 3 S 2 ), N, N-dimethylformamide (DMF), and methanol (CH 3 OH, MeOH) are analytical reagents that can be used without further purification.Moreover,deionized water was used throughout the experiment. Fig. 1.(a) The PXRD patterns; (b) FT-IR spectra over the prepared phototcatalysts. Fig. 2. Synthesis route to Bi 2 S 3 NH 2 -MIL-125(Ti)-SH heterostructures. For the 18-BM-S composites, C, N, O, and Ti elements are dispersed in the circular region belonging to the NH 2 -MIL-125, and the strong signals of Bi and S are homogeneously distributed on the surface of MOFs, which are well coincident with SEM analysis results.It can further confirm that NH 2 -MIL-125 nanocrystals serving as the supporting matrix maintain the structural feature and are homogeneously decorated by highly uniform Bi 2 S 3 .Fig. 4a shows the nitrogen adsorption-desorption isotherms of NH 2 -MIL-125, Bi 2 S 3 and 18-BM-S.The results of the BET specific surface areas and pore volumes of photocatalysts are summarized Fig. 3. TEM images of 12-BM-S (a), 18-BM-S (b) and 24-BM-S (c); (d-e) the HRTEM of 18-BM-S; and the elemental mapping analysis of 18-BM-S. Fig. 5. (a) The photocatalytic CO 2 production rate; (b) the selectivity over photocatalysts; (c) the effective photoelectrons of the samples for CO and CH 4 under irradiation after 4 h; (d) Recycle tests of the 18-BM-S. Fig. 4. (a) The N 2 adsorption-desorption isotherms of samples; (b) CO 2 uptake curves of samples; (c) the FT-IR spectra over the 18-BM-S phototcatalysts filled with the gas of CO 2 . Fig. 6.(a) The photodegradation activities; (b) the corresponding kinetics of MB degradation; (c) The rate constant k of over different samples; (d) the stability of the 18-BM-S over 5 cycles. ): 18-BM-S(2.41A 10 A2 min A1 ) 12-BM-S (1.79 A 10 A2 min A1 ) 24-BM-S (1.66 A 10 A2 min A1 ) 18-BM (1.28 A 10 A2 min A1 ) NH 2 -MIL-125 (2.99 A 10 A3 min A1 ) Bi 2 S 3 (1.60 A 10 A4 min A1 ) P25 (1.50 A 10 A4 min A1 ).The x-BM-S heterostructures show better photodegradation activity compared with other samples (Table Fig. 7.The XPS spectra of 18-BM-S: (a) survey scan, (b) Bi 4f and S 2p (c) Ti 2p, (d) N 1 s. Fig. 8. (a) UV-Vis spectra; (b) the calculated band gap energies; Mott-Schottky plots collected for Bi 2 S 3 (c) and NH 2 -MIL-125 (d). Fig. 9. (a) PL spectra; (b) The transient photocurrent responses; (c) EIS Nyquist plots, and the fitted Nyquist plots (inset Fig. 9c); (d) LSV curves over samples. . As exhibited in Fig. 10b, the typical peaks of O 2 A are detected under visible-light irradiation, whereas no signal can be observed under dark condition with the existence of DMPO, indicating the presence of O 2 A during photodegradation reaction.Simultaneously, the intensity of O 2 A peaks decrease distinctly when the MB as reaction substrate is dispersed into the suspension, proving the determinant factor of O 2 A during the photodegradation process. Fig. 10.(a) The reactive species trapping experiments under visible-light irradiation; (b) ESR profiles under the condition of dark and visible-light irradiation (BM-S and BM-S/MB). Fig. 11.Schematic illustration of the proposed mechanism over the x-BM-S heterostructures under irradiation. Conceptualization, Methodology, Investigation.Qing Zhang: Conceptualization, Methodology, Investigation.Jia-Jia Li: Validation.Jian-Yong Zhang: Data curation, Writing-original draft.Yufeng Liu: Writing -review editing.Min Zhou: Writing -review editing.Na Zhang: Data curation, Writing-original draft.Yong-Zheng Fang: Supervision.Qinfei Ke: Supervision. The physical characterization and CO 2 uptake capacities of various samples. This work is supported by the National Natural Science Foundation of China (51472162 and 21707093), the Foundation of Science and Technology Commission of Shanghai Municipality (18090503600 and 20190503300). The manuscript was written through contributions of all authors.All authors have given approval to the final version of the manuscript. Supplementary data to this article can be found online at https://doi.org/10.1016/j.jcis.2021.08.135."
  }
]