[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2020.118870"
  },
  {
    "title": "Article_Title",
    "content": "Promoting visible-light photocatalytic activities for carbon nitride based 0D/2D/2D hybrid system: Beyond the conventional 4-electron mechanism"
  },
  {
    "title": "Abstract",
    "content": "Photocatalysis is regarded as one of promising technology for future clean and sustaniable energy applications.Herein, we have fabricated Au-modified reduced graphene oxide coupled with carbon nitride (Au/rGO/g-C 3 N 4 ) as novel 0D/2D/2D photocatalytic nanocomposites.The optimized sample 2Au/0.6rGO/g-C 3 N 4 exhibits exceptional visible-light activity for water splititng and CO 2 reduction with quantum efficiency of 3.82 and 1.98 , respectively.Electrochemistry and ultraviolent photoemission are combined to determine the band alignments and elaborate associated water splitting path-way mechanism.It is validated that due to intrinsic deep valence band position of g-C 3 N 4 , the obtained nanocomposites exhibit unusual two-step two-electron way of water oxidization through intermediate H 2 O 2 catalyzed by rGO addition.The exceptional photoactivities are attributed to dual functions of enhanced charge separation and two-electron water oxidization facilitated by rGO and surface plasmon effect of decorated Au.Our work provides illuminations for low cost and high efficiency photocatalytic water splitting and CO 2 reduction applications."
  },
  {
    "title": "Experimental",
    "content": "All the reagents were directly used as received without further purification. To prepare g-C 3 N 4 , approximately 10 g of urea was directly annealed in a muffle furnace at 550 C (0.5 C min -1 ) for 4 h, and then crushed into fine powder. To fabricate rGO/g-C 3 N 4 nanocomposites, 2 g of the fabricated g-C 3 N 4 was dispersed into a mixture of de-ionized H 2 O and ethanol (1:4).The suspensions were kept under stirring for 2 h, and then 0.2, 0.4 and 0.6 g (10 wt , 20 wt and 30 wt ) of rGO was added to each suspension and vigorously stirred for 2 h.The suspensions were dried in at 85 C and then annealed at 450 C for 2 h to obtain different proportion rGO/g-C 3 N 4 nanocomposites. Different wt.percentage (i.e.0.5 , 1.0 , 2.0 , and 4.0 ) of Au was photo-deposited on the photocatalysts surfaces.The required amount of Au solution (HAuCl 4 4H 2 O) was mixed with 50 mL de-ionized H 2 O.After that, 1 g of the rGO/g-C 3 N 4 composites was dispersed in 50/50 (100) mL water/methanol contained in a 250 mL beaker.Then, the appropriate amount of Au solution was added to each composite mixture and irradiated under visible-light irradiation for 2 h with continuous stirring.The samples were then centrifuged and dried at 85 C.The obtained slightly dark photocatalysts were labeled, according to the composition, as 0.5Au/ 0.6rGO/g-C 3 N 4 , 1Au/ 0.6rGO/g-C 3 N 4 , 2Au/ 0.6rGO/g-C 3 N 4 and 4Au/0.6rGO/g-C 3 N 4 , respectively. X-ray powder diffraction (XRD) patterns of the photocatalysts were obtained with Bruker D8 (Germany), using Cu K radiation source.The TEM images were captured with a JEOL-JEM-2100 transmission electron microscope.The SEM images were captured with Hitachi-S-4800 Scanning electron microscope (Tokyo, Japan) 67,68.The FT-IR spectra were taken with a Bruker Equinox-55 spectrophotometer.The XPS analysis was carried out with a Kratos-Axis Ultra DLD X-ray photoelectron spectroscope with Al (mono) X-ray source.The adventitious carbon (binding energy 284.6 eV) was used as a reference for samples calibration.The DRS spectra were obtained with UV-2550 (Shimadzu, Japan) UV-vis diffuse reflectance spectrophotometer.The photoluminescence (PL) spectra were obtained at 420 nm excitation wavelength, using a PE-LS-55 spectro-fluoro-photometer 697071. The H 2 production experiments were performed in an online quartz cylindrical cell with area 6.5 cm 2 and volume 250 mL, linked to a closed gas circulatory system, where the evolved gases are detected with an online gas chromatograph TCD (Tech, GC-7900, N 2 gas carrier).For photocatalytic experiment, about 0.1 g of photocatalyst was dispersed in a mixture of 80 mL de-ionized H 2 O and 20 mL methanol (Note: in overall H 2 O splitting 100 mL pure H 2 O was used).The reaction system was evacuated for 30 min and then irradiated under visible-light ( 420 nm) with a 300 W Xe-lamp.The amount of H 2 gas was measured at regular time interval of 1 h. In the photocatalytic CO 2 reduction process, for each experiment, 0.1 g of a sample was dispersed in 50 mL water in a cylindrical steel reactor with 100 mL volume and glass surface area 6 cm 2 .A 300 W xenon arc lamp was used as the light source with a cut off filter of 420 nm.Highly pure CO 2 gas was entered into the reaction setup for reaching ambient pressure.The used photocatalyst was allowed to equilibrate in the CO 2 /H 2 O system for 1 h.During irradiation, about 0.5 mL of gas products were continually taken from the reaction cell at a given time interval for subsequent CH 4 , CO, H 2 and O 2 concentration analysis by using a gas chromatograph (TCD and FID both). To measure the OH amount, about 0.05 g of photocatalyst was dispersed in a quartz reactor containing 40 mL of 0.001 M coumarin aqueous solution.The reactor was stirred for 30 min to attain the adsorption equilibrium.After that, the photocatalyst was irradiated under visible-light for 1 h and then centrifuged.A certain amount was taken into a Pyrex glass cell for the fluorescence measurement of 7-hydroxycoumarin at excitation wavelength of 420 nm, through a spectrofluorometer (Perkin-Elmer LS 55). To confirm the presence of H 2 O 2 as a reaction intermediate, 0.05 g sample was mixed with 40 mL deionized water by magnetic stirrer for 10 min in the absence of light, in order to keep the reactive system uniform adsorption equilibrium.After that the sample is exposed under light irradiation for 1 h and then centrifuged.The H 2 O 2 measurements test were performed in 2.0 mL reaction solution after the irradiation/ centrifuged with 0.5 mL of 1 o-tolidine in 0.1 M HCl.After 2 min, 1 M HCl (2 mL) was added to the above solution and the absorption spectrum of the solution was immediately recorded. For PEC studies, approximately 0.05 g of photocatalyst was dispersed in 2 mL isopropyl alcohol and stirred for 1 h.Then, 0.025 g of Macrogol-6000 was grinded into fine powder and added to the suspension.The suspension was kept in ultrasonic bath for 30 min, and then stirred for 1 h.After that, 0.05 mL of acetyl acetone was drop wise added to the suspension and stirred for 72 h.The cleaned conductivefluorine-doped tin-oxide (FTO) coated glasses were used as substrates for the preparation of photocatalysts films.The films were prepared by a doctor blade method-using Scotch tape as a spacer.The prepared photocatalysts films were dried in air for 30 min.The FTO glasses with films were cut into 1.0 cm 3.0 cm pieces.The films surface area was 1.0 cm 1.0 cm.For photoelectrode preparation, an electrical connection was made with FTO substrate using silver conducting paste linked to a copper-wire and enclosed in a glass tube.The working arithmetic surface area of the thin film was kept as 0.5 cm 0.5 cm and the extra area was covered with epoxy resin 53,54.The cyclic voltammetry (CV) and electron transfer number (n) experiments were performed in a three electrode configuration cell connected to a computer controlled CHI 920C work-station.The Pt and Ag/AgCl electrodes were used as the counter-electrode and the reference electrode, respectively.A glassy carbon (GC) electrode was clearly washed with Al 2 O 3 .After that, 7 L of the 0.5 wt Nafion solution was dropped onto the GC electrode surface.Then, 20 L of the catalyst solution having 1.5 mg mL -1 pasted on the surface of GC electrode and dried in oven at 40C.Before the test, the working electrode was immersed in the electrolyte solution and activated for 30 min to keep it stable.The CV curves were carried out in 0.1 M BMIMPF 6 solution (de-ionized water) in the presence of N 2 -environment with a 50 mV/s scan rate.The Xelamp with 420 nm cut-off filter was used as the irradiation source.The electron-transfer number was recorded with a rotating disk-ring electrode (RRDE).The RRDE collection tests for 2Au/0.6rGO/CNwere carried out in N 2 -saturated ultrapure water a scan rate of 100 mV/s and rotation speed of 1600 rpm.The disk potential was set at open circuit potential.The ring-potential was set at 0.9 V vs the SCE.The Xe-lamp (300 W) was kept at a distance of 10 cm from the working electrode."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The crystal structure of as-prepared photocatalysts were investigated by XRD.As shown in SI-Fig.1A, the strong interlayer peak in g-C 3 N 4 located at 27.7(002-facet) corresponds to the highly crystalline phase.The diffraction peaks of rGO are absence in the rGO/g-C 3 N 4 composites, which is possibly due to its small content.Fig. 1A shows that the diffraction peaks of Au appeared in Au/rGO/g-C 3 N 4 composites 141516.Optical properties of the photocatalysts were investigated by UV-vis diffuse reflectance spectra (DRS).From SI-Fig.1B, it is clear that g-C 3 N 4 exhibit a threshold at wavelength of 460 nm, corresponding to a band gap of 2.7 eV. Further, it is also clear after coupling rGO, the absorption threshold of g-C 3 N 4 is essentially unaffected.Fig. 1B demonstrates that after photodeposition of Au nanoparticles, an additional broad band in the range of 500-650 nm (centring at 580 nm) appears, reflecting the SPR effect of Au nanoparticles.We have also measured the EDX for the optimized sample 2Au/0.6rGO/g-C3N4as shown SI-Fig.2, indicating the obtained sample is close to the nominal composition. The morphology of as-prepared photocatalysts was investigated by SEM.As presented in SI-Fig.3A, g-C 3 N 4 exhibits typical sheets-like morphology.However, due to severe restacking of sheets, it is difficult to identify a single nanosheet.Further, the restacking phenomenon of g-C 3 N 4 in rGO/g-C 3 N 4 (SI-Fig.3B) is significantly alleviated due to the self-assembly of g-C 3 N 4 overlaid on top of rGO.This structure helps not only to reduce carrier scattering among stacked sheets but also maximize the coherent interface between g-C 3 N 4 and rGO to ensure efficient charge transfer as discussed in the following sections.Furthermore, SI-Fig.3C illustrates that after photodeposition of Au nanoparticles, the morphology of rGO/g-C 3 N 4 nanocomposite is slightly changed. Fig. 2A shows the TEM image of as-synthesized g-C 3 N 4 , which shows sheets-like structure, consistent with the SEM result (SI-Fig.3A). The TEM image of rGO/g-C 3 N 4 in Fig. 2B photocatalysts is also shifted toward lower energy side due to aforementioned electron delocalization effect.The high resolution Au 4f XPS spectrum of 2Au/0.6rGO/g-C 3 N 4 photocatalyst (Fig. 4D) is fitted into two peaks located at 84 and 88 eV, corresponds to the splitting orbital's of 4f 7/2 and 4f 5/2 respectively.To further investigate the chemical composition of the photocatalysts, FTIR spectra were obtained as expressed in SI-Fig.4. The peaks in the range of 1200-1600 cm -1 correspond to the CeN hetero-cycles stretching modes.The peak at 810 cm -1 is attributed to the triazine unit's vibration mode.The peaks in the range of 3000-3600 cm -1 are ascribed to the NeH stretchingmode, and the adsorbed OH-species in CeN.These results demonstrate that rGO and Au are successfully coupled with g-C 3 N 4 . In order to characterize the microstructure and porous properties of the photocatalysts, here we also measured BET.The Nitrogen adsorption-desorption isotherms of g-C 3 N 4 , 0.6rGO/g-C 3 N 4 and 2Au/ 0.6rGO/g-C 3 N 4 are shown in SI-Fig.5A.It can be seen clearly that CN exhibit hysteresis loops, which are characteristics of porous structure.The BET surface area of 2Au/0.6rGO/g-C 3 N 4 is estimated to be 95 m 2 g -1 , which is much higher than the g-C 3 N 4 (32 m 2 g -1 ).The pore size distributions of 2Au/0.6rGO/g-C 3 N 4 are obtained from desorption branch by the Barrett-Joyner Halenda (BJH) method as shown in SI-Fig.5B.At relatively low pressures, the isotherm exhibits like a sharp capillary condensation rung, which is due to the small size pores ranging between 10 and 15 nm.The hysteresis loop formed at high relatively pressures are assigned to the large size pores above 10 nm.This difference in the surface area and pore structure would be reasonable for high photocatalytic performance. Based on above discussed XRD, UV-vis DRS, TEM/HRTEM, EDS mapping, XPS and BET characterizations, it has been cleared that the novel photocatalytic nanostructures with visible-light response have been successfully synthesized. It is a great challenge to explore the photogenerated charge separation of semiconductors during photocatalytic process, especially for nano-scale materials with the relative small band bending.For this, we have combined several spectroscopic techniques, e.g.photoluminescence, coumarin fluorescence and electrochemical impedance to unveil the underlying charge transport.First of all, we use photoluminescence (PL) measurement to quantitatively understand the charge carrier recombination characteristics and the obtained PL spectra of the photocatalysts as shown in Fig. 5A and SI-Fig.6A.From SI-Fig.6A, it can be seen that g-C 3 N 4 exhibits a strong PL response with peak centring at 460 nm, reflecting the optical band gap of 2.7 eV.This reveals that in bare g-C 3 N 4 the charge carrier's recombination is rather fast due to inferior charge transport efficiency and limited conduction channels.To suppress carrier recombination and promote efficient charge separation, it is necessary to create extra pathway for electronhole pairs to transport.From this point of view, hybridization with rGO is a perfect strategy to realize these extra charge transport channels to guide the photogenerated carriers to flow with longer time intervals thus ensure efficient charge separation with suppressed recombination.This is evidenced in SI-Fig.6A that the PL intensity of g-C 3 N 4 gradually decreased with the increase in rGO addition reflecting less carrier recombination.The lowest PL intensity peak is detected for the amount optimized 0.6rGO/g-C 3 N 4 sample.Moreover, from Fig. 5A, it can be seen that the PL intensity peak of the optimized 0.6rGO/g-C 3 N 4 composite is further decreased after depositing Au, and the lowest intensity peak is observed for the 2Au/0.6rGO/g-C 3 N 4 photocatalyst.These results demonstrate that the charge carrier's recombination is greatly reduced due to the combinatorial effect of both Au and rGO addition. Here we note that further increasing Au concentration, for example from 2Au/0.6rGO/g-C 3 N 4 to 4Au/0.6rGO/g-C 3 N 4 lead to increased PL intensity.This indicates the extra amount of Au has resulted in undesired growth and aggregation of Au nanoparticles, thus leading to enhanced carrier recombination. To further confirm the charge carrier's separation in the photocatalysts, we conduct coumarin fluorescent spectroscopy to analyse the OH radical amount related to fluorescence spectra as depicted in Fig. 5B and SI-Fig.6B.In coumarin fluorescent method, the fluorescence peak at 457 nm is attributed to the luminescent 7-hydroxycoumarin formed as a result of the reaction between coumarin and OH.Thus, the strong fluorescent signal reveals large amount of OH.From SI-Fig.6B, it is obvious that g-C 3 N 4 produced low amount of OH.However, the amount of OH is greatly enhanced after coupling with rGO and the highest amount is detected for the optimized 0.6rGO/g-C 3 N 4 composite.Moreover, the amount of OH for the optimized 0.6rGO/g-C 3 N 4 composite is further enhanced after depositing Au, and the 2Au/0.6rGO/g-C 3 N 4 photocatalyst shows the best result, as shown in Fig. 5B. To further prove the SPR effect of Au, the OH related fluorescence spectra of the samples is also measured after irradiation with longer wavelength (520 nm) as shown in Fig. 5B inset.It is obvious that the samples even exhibit OH related fluorescence peak at SPR wavelength.However, the amount of OH produced at 520 nm is much lower compared to that produced under visible-light irradiation.Obviously, the obtained OH amount at SPR wavelength further supports the charge carriers separation.To further confirm the enhanced carrier separation, we have also measured photoelectrochemical I-V curves of the samples in 0.5 M Na 2 SO 4 solution under visible-light irradiation as shown in Fig. 5C.The photocurrent density of g-C 3 N 4 is obviously improved after coupling rGO and Au nanoparticles. Moreover, we also measure electrochemical impedance spectra (EIS) of the samples under visible-light irradiation as shown in Fig. 5D.The amount-optimized sample of 2Au/0.6rGO/g-C 3 N 4 exhibits the smallest arc radii, indicating more effective electron-hole pairs separation efficiency and improved charge transfer.Overall, there is well agreement among photoluminescence, fluorescence, PEC I-V, and EIS results.Therefore, it is clearly demonstrated that the synthesized Au coupled rGO/g-C 3 N 4 with 0D/2D/2D nanostructural co-catalyst-free photocatalyst exhibits excellent visible-light response and enhanced photo-generated charge carrier separation, which are desirable for visible photocatalytic activity. The visible-light photocatalytic activities ( 420 nm) of as-prepared g-C 3 N 4 , rGO/g-C 3 N 4 and Au/0.6rGO/g-C 3 N 4 photocatalysts are evaluated for water splitting manifested in Fig. 6A, B and SI-Fig.7. From SI-Fig.7, it is clear the g-C 3 N 4 exhibits the lowest photocatalytic activity for H 2 evolution (10 mol g -1 h -1 ).However after rGO-coupling, the amount of H 2 evolution enhanced is obviously enhanced, especially for the amount-optimized 0.6rGO/g-C 3 N 4 nanocomposite (45 mol g -1 h -1 ).In addition, we also study 2Au/g-C 3 N 4 sample for photocatalytic H2 evolution.The 2Au/g-C 3 N 4 demonstrates good photocatalytic activity (73 mol g -1 h -1 as given SI-Fig.7) for H 2 evolution as compared to 0.6rGO/g-C 3 N 4 .Notably, as shown in Fig. 6A, the photocatalytic activity of 0.6rGO/g-C 3 N 4 composite for H 2 evolution is further improved after depositing Au nanoparticles, and the maximum photoactivity is observed for the optimized 2Au/0.6rGO/g-C 3 N 4 composite (320 mol g -1 h -1 ).Compared with other mainstream photocatalysts, the obtained visible-light driven activity is excellent (SI-Table .1).Thus, the simpler material synthesis, all-bio-compatible elements and unique hybrid design strategy (0D Au coupling and 2D rGO warping) render the current system attractive for next generation of low-cost, scalable, sustainability required energy, environmental, and biomedical applications. In terms of practical applications, the overall photocatalytic water splitting is preferred than the half-cell H 2 or O 2 evolution.Although, thermodynamically possible (by proper band alignment with suitable conduction and valence band energy levels), the efficient overall water splitting process is not easy to achieve in consideration of dynamic process of electrochemical/photochemical reactions which requires a high free energy of 113.38 kcal/mol.The reason is related to both physical nature of carrier transport and chemical nature of subsequent half-reactions.Generally, the carrier recombination in conventional semiconductors leads to very short life-time of excited holes, making them not easy to oxidize water.This is further hampered by the fact that the oxygen evolution reaction (OER) is a very slurry process with series of elemental chemical reactions that are not fast enough to consume the extra holes to keep a high yield of oxygen production as compared to the hydrogen evolution reactions (HER).In majority cases, hole/electron sacrificial reagents are utilized to promote the other half -electron/ hole reaction but only H 2 or O 2 can be obtained. In this work, the introduction of rGO can facilitate the OER halfreaction without affecting the HER process.The underlying mechanism is related to the nature of rGO that the higher electron mobility enable fast transport of electrons, which helps to spatially separate photogenerated electron-hole pairs.Thus, the remaining holes can have prolonged life-time, as reflected by the above-mentioned PL, fluorescence, PEC I-V, and EIS results (Fig. 5).Meanwhile, in rGO/g-C 3 N 4 hybrid system, the 2D nature of both materials ensures a coherent connection with large interfacial area (as evidenced from TEM results in Fig. 2).This unique artificial nanostructure would further create extra pathways for photogenerated electron-hole separation and transport.Thus, the obtained system shows much higher effective photocarrier activity than pure g-C 3 N 4 and other doped g-C 3 N 4 photocatalysts. Following the physics of the hole generation, another obstacle for OER is the challenge of breaking the H-O bond and formation of diatomic OeO bond, which typically involves a four-electron process (2H 2 O 4H O 2 4e -).Generally, the OER half-reaction in this process (at energy cost of 1.23 eV) is kinetically limited by the high desorption energy of product O 2 , which significantly slows down the four-electron reaction process.At certain conditions, the water splitting can also occur via a step wise two-electron/two-electron process by forming the intermediate H 2 O 2 , which then decomposes into O 2 and H 2 O, thus allowing a much higher efficiency as this process is exothermic.In order to distinguish whether the O 2 evolution in this hybrid catalyst is two or four electrons process, we measure the amount of H 2 O 2 in different reaction conditions (SI-Fig.8).The presence of significant H 2 O 2 directly confirms the two-step pathway through H 2 O 2 production and then decomposition into O 2 and H 2 O.In addition, we also investigate the effect of rGO on the H 2 O 2 formation, by comparing the data with pure g-C 3 N 4 , 0.6rGO/g-C 3 N 4 and 2Au/0.6rGO/g-C 3 N 4 as illustrated in the SI-Fig.8.The pure g-C 3 N 4 produces large amount of H 2 O 2 which causes deactivation of the photocatalyst, but after coupling with rGO, the produced H 2 O 2 quickly decomposes into O 2 and H 2 O. Thus rGO not only improves the photogenerated charge separation but also shields photocatalyst from deactivation. To further understand the underlying mechanism, we determine the highest occupied molecular orbital (HOMO) and the lowest unoccupied molecular orbital (LUMO) of 2Au/0.6rGO/g-C 3 N 4 by cyclic voltammetry (CV) measurement as displayed in the SI-Fig.9A.The HOMO/ LUMO positions are then calculated from the onset of oxidation and reduction potential as measured by CV.Ferrocene is used for the reference of energy level.(4.8 eV below than vacuum level) according to the following equations: The calculated HOMO/LUMO energy level positions are -6.21/-3.45eV, from which the band alignment of the 2Au/0.6rGO/g-C 3 N 4 hybrid catalyst verse reversible hydrogen electrode (RHE) potential can be extracted, as shown in SI-Fig.9B.To further prove the band alignment, we also determine the ultraviolent photoelectron spectroscopy (UPS, in SI-Fig.9C), which yields a similar valence band position (21.2-17.5 2.5 6.2 eV), thus confirming the suitable valence band position for H 2 O 2 evolution.The number of electrons transfer has been determined by the following Eq.( 4).n 4I disk / (I disk I ring /N) ( Where, n is the number of electrons transfer during water splitting, I disk is the disk current, I ring is the applied current and N is collection coefficient that determined experimentally as 0.35.After that, the n values are calculated as 1.94 for 2Au/0.6rGO/g-C 3 N 4 , indicating the reaction is through two-electron process.Therefore, the combination of H 2 O 2 presence and favourable H 2 O 2 /H 2 O potential confirms that the oxygen evolution in this 0D/2D/2D hybrid catalyst occurs in an unconventional two-step two-electron pathway.Furthermore, we also measure the overall water splitting activities of 0.6rGO/g-C 3 N 4 and (x) Au/0.6rGO/g-C 3 N 4 composites under visible-light irradiation ( 420 nm) as shown Fig. 6B.It is obvious that the amount-optimized 2Au/0.6rGO/g-C 3 N 4 photocatalyst shows enhanced photocatalytic activity for overall water splitting with both H 2 and O 2 evolution of 32 mol g -1 h -1 and 16 mol g -1 h -1 respectively.These overall water splitting activities are 2 to 3-times higher than other related works (SI-Table 1).To confirm the influence of Au SPR on the photocatalytic activity of the 0.6rGO/g-C 3 N 4 composite for overall water splitting, we also measure the photoactivity under wavelength of 520 nm (related to Au SPR) as shown in inset of Fig. 6B.It is clearly verified that with the coupling of Au, the hybrid photocatalysts show increased activity at the wavelength of 520 nm.However, it should be noted that the hourly amount of H 2 evolved under single wavelength of 520 nm is rather lower than the H 2 evolved under continues visiblelight irradiation (Fig. 6A).The calculated quantum efficiency of the amount-optimized 2Au/0.6rGO/g-C 3 N 4 photocatalyst for H 2 evolution at wavelength 420 nm is 3.82 .The obtained H 2 evolution is much better than that of recently reported carbon-doped BN 72.To understand the plamonic effect of Au/rGO/g-C 3 N 4 composites, we perform photocatalytic experiments for H 2 production under single wavelength irradiation (365-520 nm) as shown in SI-Fig.10A It is obvious that 0.6rGO/g-C 3 N 4 photocatalyst exhibits high photocatalytic activity for H 2 production below 450 nm irradiation wavelength, while it shows weak photocatalytic activity above 470 nm irradiation wavelength.These suggest the photoactivity of intrinsic g-C 3 N 4 or rGOmodified g-C 3 N 4 are still limited by the fundamental band gap of g-C 3 N 4 , thus these materials are not apporproate for visible light applications.Interestingly, with the addition of Au, the Au/rGO/g-C 3 N 4 nanocomposites even show high photoactivity upto wavelength 520 nm, indicating the coupled Au has efffectively extented the photocatalytic activity of the hybrid system into the visible-light range, which is attributed to the SPR effect of Au nanoparticles. To check the long term stability of 2Au-0.6rGO/g-C 3 N 4 nanocomposite for H 2 evolution, photocatalytic repeatible experiment is performed as shown in SI-Fig.10B.The nanocomposite produces 1900 mol H 2 in 6 h.Further, the photocatalysts do not show Fig. 6.Visible-light ( 420 nm) photocatalytic activities (A) H 2 evolution (20 Methanol 80 pure water) and (B) overall water splitting of g-C 3 N 4 , 0.6rGO/g-C 3 N 4 , 0.5Au/0.6rGO/g-C3 N 4 , 1Au/0.6rGO/CN,2Au/ 0.6rGO/g-C 3 N 4 and 4Au/0.6rGO/g-C 3 N 4 photocatalysts.Inset of (B) shows photocatalytic activities at extrication wavelength of 520 nm.(C) The photocatalytic CO 2 conversion for CH 4 and (D) for all gas-phase detected products of 0.05Au/0.6rGO/g-C 3 N 4 , 1Au/0.6rGO/g-C 3 N 4 , 2Au/0.6rGO/g-C 3 N 4 and 4Au/0.6rGO/g-C 3 N 4 .photocorrosion even after 6 photocatalytic cycles (each cycle of 6 h), indicatingthat the fabricated composite is highly stable. Further to support the photocatalytic activities of Au/rGO/g-C 3 N 4 , here we also evaluate the photocatalytic activities for CO 2 reduction.As shown in Fig. 6C,D Based on the above results, a schematic illustration of the mechanism for charge transfer and separation in Au/rGO/g-C 3 N 4 nanocomposite has been proposed as illustrated in Fig. 7. g-C 3 N 4 has a band gap of approximately 2.7 eV, corresponding to the light absorption threshold of 470 nm.The inclusion of Au with its SPR significantly extends the photoactivity into visible light region.Meanwhile, rGO acts as the conductive channels to transport electrons and shielding the photocatalyst from deactivation.Under visible-light irradiation, the intimate contact among g-C 3 N 4 , Au, and rGO ensures the photoexcited electrons of g-C 3 N 4 and Au to be transferred to rGO, which further reduces H 2 O to evolve H 2 .As a result, holes left in the valance band of g-C 3 N 4 .Moreover, both electrochemical and UPS have demonstrated the suitable energy positions for both conduction and valence bands of the Au/rGO/g-C 3 N 4 hybrids, i.e.HOMO/LUMO of -6.21/-3.45eV, corresponding to the RHE of 1.8 and -1.0 valence band for valence and conduction band edges, respectively.These values are favourable for hydrogen reduction (2H 2e - H 2 ) and water oxidization by holes through an unconventional two-electron two-step oxygen evolution pathway(2H 2 O H 2 O 2 2H 2e -, H 2 O 2 1/2O 2 H 2 O).As a result, the charge carrier's separation will be greatly enhanced leading to the improved visible-light photoactivities.Overall, the coaddition of rGO and Au promotes visible-light absorption, catalytic stability, electron mobility, and charge separation, thus leading to enhanced efficiency for overall water splitting and CO 2 reduction in the visible-light range."
  },
  {
    "title": "Conclusions",
    "content": "In this work, Au/rGO/g-C 3 N 4 composites as novel 0D/2D/2D hybrid photocatalyst has successfully been fabricated via hydrothermal and photo-deposition methods.The amount optimized 2Au/0.6rGO/g-C 3 N 4 composite exhibits enhanced visible-light activity for H 2 evolution/CO 2 reduction with apparent quantum efficiency of 3.82/1.98 at 420 nm.We demonstrate by combined electrochemical CV, RRDE and UPS measurements that water oxidization in this hybrid system occurs via an unconventional two-electron two-step pathway through intermediate H 2 O 2 formation.This process is well known for fast reaction speed, leading to enhanced photocatalytic efficiency.The dual functions of rGO for both efficient charge transfer and decomposition of intermediate H 2 O 2 is shown to be critical to realize this performance enhancement.Overall, the merits of rGO, combined with SPR effect of Au, promote visible-light absorption, catalytic stability, electron mobility, and charge separation of the low-dimensional hybrid system, thus leading to enhanced water splitting efficiency in the visible-light range.This work will provide new directions for the rational design of visible-light active g-C 3 N 4 -based photocatalysts for solar fuel production. Here we are submitting the revised manuscript entitle of \"Promoting Visible-Light Photocatalytic Activities for Carbon Nitride Based 0D/2D/2D Hybrid System: Beyond the Conventional 4-Electron Mechanism\".There is no any conflict of co-authors.I am responsible for this paper. Our work provides feasible routes for the rational design of the visible-light responsive low-dimensional CN-based highly efficient hybrid photocatalysts for solar fuel production.Therefore, we believe our results are important and can be helpful for the relevant research community. The current energy crisis and environmental problem are big issue which we are facing.Thus solar energy harvesting and conversion into useful chemical energy with the aid of semiconductor photocatalysts is a promising technique to solve both energy and environmental issues.However, it is a great challenge to develop abundant and stable photocatalysts that is effective under visible-light.Although the star material carbon nitride (CN) has many merits, the efficiency of CN is still not satisfactory for practical applications owing to the fast recombination rate of photogenerated charges and limited visible-light absorption. Fig. 1.The XRD patterns (A) and DRS spectra (B) of 0.6rGO/g-C 3 N 4 , 0.5Au/0.6rGO/g-C3 N 4 , 1Au/0.6rGO/g-C 3 N 4 , 2Au/0.6rGO/g-C 3 N 4 and 4Au/0.6rGO/g-C 3 N 4 composites. Fig. 3.The elemental mappings images (A) of 2Au/0.6rGO/g-C3N4,(B) of Carbon, (C) of Nitrogen, (D) of Oxygen, and (E) of Au elements.(F) EDX spectrum of 2Au/ 0.6rGO/g-C3N4 composite.The elemental mappings clearly show that all the elements are equally distributed. Fig. 4. XPS survey spectra (A) of g-C 3 N 4 , 0.6rGO/g-C 3 N 4 and 2Au/0.6rGO/g-C 3 N 4 composites.The magnified XPS spectra (B) of N1 s, (C) of C1 s, and (D) of Au4f elements. Fig. 5. Photoluminescence spectra (A), further to confirm the charge separation mechanism here we also measured fluorescence spectra by using coumarin (B) inset single wavelength (520 nm) fluorescent spectra to investigate the plasmonic effect of Au (C) photocurrent density spectra (PEC performance was measured in 0.5 mol L -1 NaOH electrolyte solution.A three electrode cell was used with the testing film as the working electrode, an Ag/AgCl (saturated KCl solution) as a reference electrode, and Pt plate was used as counter electrode) and (D) electrochemical impedance spectra Nynquist plots of 0.6rGO/g-C 3 N 4 , 0.5Au/0.6rGO/g-C3 N 4 , 1Au/0.6rGO/g-C 3 N 4 , 2Au/0.6rGO/g-C 3 N 4 and 4Au/0.6rGO/g-C 3 N 4 photocatalysts. photocorrosion even after 6 photocatalytic cycles (each cycle of 6 h), indicatingthat the fabricated composite is highly stable.Further to support the photocatalytic activities of Au/rGO/g-C 3 N 4 , here we also evaluate the photocatalytic activities for CO 2 reduction.As shown in Fig.6C, D and SI-Fig.11,similar photoactivity results are demonstrated for g-C 3 N 4 , rGO/g-C 3 N 4 and Au/rGO/g-C 3 N 4 during the photocatalytic reduction of CO 2 .It is confirmed that different gas-phase products such as CH 4 , CO, and very negligible amount of H 2 and O 2 are detected as a result of CO 2 photo-reduction in the presence of H 2 O as the reducing agent.It is worth noting that the CH 4 rate for 2Au/rGO/g-C 3 N 4 sample is quilt linear with time with nearly 6 mol/g/h.The aforementioned results demonstrate much higher visible-light photoactivity for CO 2 conversion as compared with pristine g-C 3 N 4 (3 mol).It should be noticed from Fig.6C,D, that the amounts of produced H 2 and CH 4 after 8 h of photocatalytic reactions still keep a constant increasing trend in the photocatalytic performance, indicating high stability of CO 2 reduction for the photocatalyst7374757677. Fig. 7. Proposed photocatalytic mechanism i.e. light adsorption, charge transfer, and redox reactions of chemical species and charge recombination for Au/rGO/CN hybrids under visible light illumination. Acknowledgements L.Q. was supported by the National Natural Science Foundation of China (Grant No. 11774044) and the Chinese Government 1000-Young Talent Program.The work was financially supported by the Specialized Research Fund for the Doctoral Program of Higher Education (20133514110003), the China Postdoctoral Science Foundation under Grant no.2017M622404 and 2018M640906 .National Natural Science Foundation of China (No. 21850410460).J.Yi thanks the fund support from Australian Research Council Future FellowshipFT160100205. Supplementary material related to this article can be found, in the online version, at doi:https://doi.org/10.1016/j.apcatb.2020.118870."
  }
]