[
  {
    "title": "Doi",
    "content": "10.1016/j.jcis.2021.05.131"
  },
  {
    "title": "Article_Title",
    "content": "Rational construction of Ni(OH)2 nanoparticles on covalent triazine-based framework for artificial CO2 reduction"
  },
  {
    "title": "Abstract",
    "content": "Artificial photoreduction of CO 2 to chemical fuel is an intriguing and reliable strategy to tackle the issues of energy crisis and climate change simultaneously.In the present study, we rationally constructed a Ni (OH) 2 -modified covalent triazine-based framework (CTF-1) composites to serve as cocatalyst ensemble for superior photoreduction of CO 2 .In particular, the optimal Ni(OH) 2 -CTF-1 composites (loading ratio at 0.5 wt) exhibited superior photocatalytic activity, which surpassed the bare CTF-1 by 33 times when irradiated by visible light.The mechanism for the enhancement was systematically investigated based on various instrumental analyses.The origin of the superior activity was attributable to the enhanced CO 2 capture, more robust visible-light response, and improved charge carrier separation/transfer.This study offers an innovative pathway for the fabrication of noble-metal-free cocatalysts on CTF semiconductors and deepens the understanding of photocatalytic CO 2 reduction."
  },
  {
    "title": "Experimental",
    "content": "All chemicals and reagents were analytical reagent (AR) grade without further purification and obtained from Sinopharm Chemical Reagent Co. Ltd.The synthetic procedure for CTF-1 was in accordance with our previous report 26.In brief, 10 mL Trifluoromethanesulfonic acid was slowly introduced into 1.28 g 1,4dicyanobenzene in a flask with continuous stirring at 0C.The obtained solution was then kept at 30C for 3 d, and then rinsed by dichloromethane and NH 3 AH 2 O solution (50 vol), respectively.The resulted product was collected and dispersed into NH 3 AH 2 O solution (50 vol) under stirring.After repeatedly washing with distilled water and methanol, the precipitate was refluxed by methanol and dichloromethane for 12 h, respectively, and vacuum-dried at 80C for 12 h.Finally, the light yellow solid was ground to obtain CTF-1. The Ni(OH) 2 was deposited on CTF-1 via a facile precipitation process.Typically, the prepared CTF-1 powders (0.2 g) were evenly suspended in ultrapure water (20 mL), then a certain amount of 10 mg/mL NiCl 2 solution (20 mL, 100 mL, 200 mL, and 400 mL) was progressively added under stirring, respectively.After 1.5 h, a solution with an excess amount of NaOH was instilled.Then the mixed solution underwent vigorous stirring at room temperature for another 6 h.Subsequently, the sample was collected by centrifugation, and repeatedly washed with distilled water and ethanol.Finally, the resultant precipitates were dried at 80C.The obtained samples were denoted as Ni 0.1 -CTF-1, Ni 0.5 -CTF-1, Ni 1 -CTF-1, and Ni 2 -CTF-1, representing the various loading ratio of 0.1, 0.5, 1, and 2 wt, respectively.The preparation route for the samples is presented in Fig. 1. Scanning electron microscopy (SEM) and transmission electron microscopy (TEM) images of the samples were obtained using a Nova Nano SEM 230 microscopy (FEI Corp.) and a TECNAI G2 F20 TEM (FEI Corp.), respectively.The pore volumes were recorded with an ASAP 2020 apparatus (Micromeritics Instrument Corp.) and the Brunauer-Emmett-Teller (BET) method was used to calculate the specific surface areas (S BET ).Powder X-ray diffraction patterns (PXRD) of the samples were performed on a Rigaku MiniFlex 600 X-ray diffractometer with Ni-filtered Cu Kairradiation (a 1.5406 A).The 2h range was set from 5 to 80.Fourier transform infrared (FT-IR) analyses of the samples were conducted on a Thermo Scientific Nicolet iS10 spectrometer using KBr pellets at a resolution of 4 cm A1 .X-ray photoelectron spectroscopy (XPS) spectra of the samples were recorded on a PHI Quantum 2000 XPS system equipped with a monochromatic Al Ka X-ray source.The C 1s peak (284.6 eV) of the surface adventitious were referenced as standard binding energy.The solid-state UV-vis diffuse reflectance spectra (UV-vis DRS) were carried out on a Varian Cary 500 Scan UV-vis-NIR spectrophotometer.The photoluminescence (PL) spectra were recorded using an Edinburgh FL/FS 900 spectrophotometer with the excitation wavelength set at 420 nm.Thermogravimetric analysis (TGA) was conducted on a NETZSCH STA 449C thermogravimetric analyzer with the heating rate set as 10C/min. The photocurrent analyses and Mott-Schottky tests were obtained via an electrochemical system (CHI 650E, Shanghai Chenhua Instrument Co. Ltd.China) equipped with a standard three-electrode system.A 0.2 M Na 2 SO 4 solution was used as electrolyte.An Ag/AgCl electrode and a platinum plate electrode were used as the reference electrode and counter electrode, respectively.The working electrode was prepared according to our previous report.Electrochemical impedance spectroscopy (EIS) plots of the samples were obtained using a Zahner PP211 electrochemical workstation with a 10 mM K 3 Fe(CN) 6 /0.1 M KCl mixed aqueous solution as electrolyte. The photocatalytic CO 2 reduction experiments were performed in a closed reactor.A 300 W Xenon lamp with a 420 nm cut-off filter was used as the light source.In a typical experiment, 10 mg of the as-prepared sample and 7 mg photosensitizer Ru(bpy) 3 Cl 2 -A6H 2 O were dispersed in the reactor containing a solution of triethanolamine (TEOA)/distilled water/acetonitrile (150 mL/300 mL/450 mL).Then the reaction mixture was subjected to continuous magnetic stirring.Prior to illumination, the gas in the reactor was evacuated by a vacuum pump for 2 min and then filled with CO 2 for 20 min.After illumination for 4 h, 400 mL of the gas was sampled with a syringe and then injected into a gas chromatography (GC-7890B) for the measurement of CH 4 and CO.Three consecutive photocatalytic CO 2 reduction cycles were conducted to verify the stability of Ni(OH) 2 -CTF-1.After the first photocatalytic CO 2 reduction, Ni 0.5 -CTF-1 photocatalyst was centrifuged by deionized water and ethanol for several times, respectively, then dried at 80C overnight.The afresh obtained Ni 0.5 -CTF-1 was used for the following photocatalytic CO 2 reduction under the same experimental condition."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The morphological and microstructural aspects of the prepared samples were observed by SEM.As shown in Fig. 2a and b, Ni 0.5 -CTF-1 showed a looser layered structure than CTF-1.This indicated that the layered stack structure was still retained.This observation was consistent with the TEM images (Fig. 2c andd).Closer observation of the interplanar spacings in HRTEM could discern the (1 0 1) and (0 0 2) crystal planes of Ni(OH) 2 , verifying that the Ni (OH) 2 nanoparticles were successfully loaded on the surface of CTF-1.The Energy-disperse X-ray (EDX) elemental mapping (Fig. 2e) unveils the composition of C, N, O, H, Ni elements in the Ni x -CTF-1, demonstrating Ni(OH) 2 was well-dispersed on CTF-1. The BET surface areas, pore volume, and pore size distribution of the as-prepared photocatalysts and pure CTF-1 were characterized by nitrogen adsorption.As displayed in Fig. S1, nitrogen sorption isotherms of CTF-1 and Ni x -CTF-1 were similar, with the characteristic pattern being the type IV isotherms, which indicated that the samples were mostly mesoporous structures.Table S1 lists the BET surface area, average pore volume and average pore size of the samples.Compared with CTF-1, the specific surface area was enlarged slightly with the increasing loading ratio of Ni(OH) 2 , suggesting that the loading of Ni(OH) 2 might enhance the exposure to CO 2 molecular and provide extra active sites for reaction. Adsorption is a crucial step for the proceeding of CO 2 photoreduction.The CO 2 adsorption isotherm results (Fig. 3) showed that both CTF-1 and Ni modified CTF-1 samples (0.5 wt) possess good CO 2 uptake ability with the maximum CO 2 adsorption achieving 10.87 cm 3 g A1 and 9.67 cm 3 g A1 for Ni 0.5 -CTF-1 and CTF-1, respectively.The superior CO 2 adsorption ability for CTF-1 could be due to the porous structure and nitrogen-rich functionalities with strong Lewis basicity, which can be conducive to CO 2 activation 39.A higher CO 2 adsorption capacity for Ni 0.5 -CTF-1 could be explained by the alkalinity of Ni(OH) 2 38.Due to the increased interaction between the photocatalyst and CO 2 molecule, the improvement of Ni 0.5 -CTF-1 in CO 2 uptake might contribute to the process of CO 2 conversion. The crystal phases of the samples were identified by the XRD analysis.As illustrated in Fig. S2, the XRD patterns of CTF-1 and Ni x -CTF-1 (x 0.1, 0.5, 1, 2) exhibited three main diffraction peaks at 15-30, suggesting CTF-1 maintained the crystal structure after Ni(OH) 2 deposition.The obvious signal at 26.9was related to stacking conjugated aromatics 40,41.The characteristic signal for Ni(OH) 2 can hardly be found for all Ni x -CTF-1 composites.This could be due to the fact that considerable low loading amount and high distribution of Ni(OH) 2 on the surface of CTF-1. The FT-IR spectra of Ni x -CTF-1 composites (Fig. 4a) exhibited similar peaks to CTF-1, demonstrating that the introduction of Ni (OH) 2 did not exert a significant impact on the triazine ring structure of CTF-1.Specifically, the peaks centered at 1357 cm A1 and 1508 cm A1 were ascribed to the typical stretching vibration of CAN bonds in the triazine ring 42.Besides, a prominent peak located at around the 2900-3700 cm A1 was attributed to the stretching of OH bonds, which could be originated from the free water of the ambient environment during the process of measurement 43. XPS analysis was conducted to get insight into the surface chemical compositions and chemical status of the samples.Fig. 4b presented the high resolution of C 1s XPS spectrum of the Ni 0.5 -CTF-1 sample.It can be observed that two prominent peaks centered at 284.6 eV and 287.3 eV, which were attributed to sp 2hybridized CAC bonds of the aromatic carbon or exogenous carbon in benzene ring and CAN bonds in triazine ring, respectively 44,45.In N 1s spectra (Fig. 4c), the peak centered at 399.2 eV was due to the sp 2 -hybridized nitrogen (CNAC) 45, which further corroborated the conclusion that the structure of triazine ring structure in CTF-1 was maintained after the introduction of Ni (OH) 2 .As presented in the XPS spectra of Ni 2p (Fig. 4d), the peaks located at 856.4 eV and 874.1 eV were corresponding to Ni 2p 3/2 hybridization and Ni 2p 1/2 hybridization, respectively, which were indicative of the presence of Ni(OH) 2 464748. The thermal stability of the samples was investigated by TGA analysis (Fig. S3).The TGA curves showed similar patterns for Ni 0.5 -CTF-1 sample to CTF-1, implying that the introduction of Ni (OH) 2 did not exert an impact on the thermal stability of CTF-1.Specifically, both CTF-1 and Ni 0.5 -CTF-1 were thermally stable below a comparatively high temperature up to 250C, suggesting superior thermal stability of the samples, which can be attributed to the triazine moiety and high degree of polymerization in the conjugated network structures.Meanwhile, a steep decrease was discovered at 250-400C in terms of CTF-1 and Ni 0.5 -CTF-1.This decrease could be explained by the evaporation of the adsorbed water and gas from the surface of catalysts under the high temperature.The samples were weightless completely at more than 700C and the residual quantity could be derived from C and Ni of the samples. The light absorbance capability of the as-prepared samples was measured by UV-vis-DRS.Generally, as displayed in Fig. 5, CTF-1 and Ni(OH) 2 -CTF-1 samples exhibited similar optical semiconduc- tor absorption shapes, indicating the intrinsic semiconducting nature of CTF-1 was kept after the modification of Ni(OH) 2 .However, the spectra of the Ni x -CTF-1 samples exhibited a small absorption shoulder at 450 nm, which can be rationalized by the presence of d-d transition of Ni (II), further evidencing the successful introduction of Ni(OH) 2 49.Hence, it could be inferred that the modification of Ni(OH) 2 could broaden the absorption of visible-light spectrum over CTF-1, which was beneficial for boosting photocatalytic performance and better solar energy utilization.The PL spectra (Fig. S4) were obtained via the exciting wavelength set at 420 nm.After Ni(OH) 2 modification, the PL signals generally decreased, implying that the introduction of Ni(OH) 2 could lead to more efficient electron-hole pairs separation/transfer, which will be beneficial to the enhancement of CO 2 photoreduction capacity under visible-light 50.Specifically, the Ni 0.5 -CTF-1 sample exhibited the weakest emission peak, possibly suggesting an optimal loading ratio of 0.5 wt. Fig. 6a shows the transient photocurrent responses subjected to visible light irradiation under several on-off cycles.Overall, all the samples exhibited a consistent and rapid photocurrent response upon light on-off test, whereas the intensities of Ni(OH) 2 loaded samples were significantly higher than that of CTF-1.Notably, the Ni 0.5 -CTF-1 exhibited the strongest intensity among all the samples, implying the highest efficiency of charge transfer at this loading ratio, which coincided with the PL results.EIS was performed to get insight into the charge transfer process.As presented in Fig. 6b, a smaller semicircle diameter was observed for Ni 0.5 -CTF-1 composite compared to that of pure CTF-1, indicating the introduction of Ni(OH) 2 could reduce electric charge migration resistance, accelerate the electron-hole separation/transfer, and consequently increasing the photocurrent 51,52.Through the above analyses, it could be postulated that CTF-1 modified by Ni (OH) 2 might exhibit a better performance for CO 2 photoreduction. The photocatalytic CO 2 reduction activities of the as-prepared samples were compared under visible-light irradiation (k 420 nm).The products of CH 4 and CO were measured, while only CO was detected for all the samples (Fig. 7).Ni x -CTF-1 samples showed a higher CO evolution rate than that of CTF-1, suggesting the activity improved with the introduction of Ni(OH) 2 .The optimal photocatalyst was Ni 0.5 -CTF-1 with a maximum CO evolution rate of 38.66 lmol h A1 g A1 , which was approximately 33 times higher than that of bare CTF-1.These findings are in well accordance of the above instrumental characterization and can be explained by the accelerated charge carrier separation/transfer, broaden visible-light absorption, and enhanced CO 2 adsorption after the modification of Ni(OH) 2 .Nevertheless, it is worth note that the optimal loading amount of Ni(OH) 2 was 0.5 wt and the photocatalytic activity turned out to the trend of decrease with the excessive deposition of Ni(OH) 2 .This could be explained by the reason that excessive amount of Ni(OH) 2 may act as recombination centers for charge carriers, shielding the active sites during the reduction process.In order to further explore the impact of various factors on the performance of CO 2 photoreduction photocatalytic reduction, various control experiments were conducted (Table S2).CO was not detected under dark environment and without the presence of photocatalysts, suggesting the photocatalytic nature of the CO 2 reduction process.Under the condition where N 2 was purged into the reaction atmosphere to replace the CO 2 , no appreciable CO can be detected, evidencing that the carbon element in the evolved CO was derived from atmospheric CO 2 molecular instead of the carbon-containing material (CTF-1).Meanwhile, the hole scavenger (TEOA) and photosensitizer (Ru (bpy) 3 2 ) also played crucial roles in the reaction system.Furthermore, the CO evolution rate was a bit less when the MeCN was absent.This can be attributed to Lewis acid-base action between the heteroatom of MeCN and CO 2 , which is conducive to the CO 2 dissolution.In summary, the mentioned reagents and conditions were equally indispensable for the high-performance photocatalytic CO 2 reduction in this reaction.High stability is a vital property for the application of photocatalyst in practical operation 53.The photocatalytic stability of the Ni 0.5 -CTF-1 composite was assessed by three consecutive CO 2 photoreduction cycles.As can be seen in Fig. 8a, the CO evolution performance maintain constant through the three cycles and only a slight decrease occurred at the third cycle, indicating that Ni 0.5 -CTF-1 possessed satisfactory stability.To gain more information regarding the stability of the prepared sample, the DRS spectra of fresh and used Ni 0.5 -CTF-1 was recorded (Fig. 8b).A highintensity peak was discovered from 400 to 600 nm, which could arise from the characteristic peak of Ru(bpy) 3 2 54.Moreover, the fresh and used samples exhibited similar optical absorption properties, suggesting that Ni 0.5 -CTF-1 showed excellent stability, which was consistent with cyclic experiment results. To probe the mechanism of CO 2 photoreduction over Ni x -CTF-1, the band alignments of pure CTF-1 and Ni 0.5 -CTF-1 were explored by Mott-Schottky analysis (Fig. 9).The flat-band potentials of CTF-1 and Ni 0.5 -CTF-1 were determined as A1.23 and A1.42 V (vs.Ag/ AgCl), respectively, which were equivalent to A1.03 and A1.22 V vs. the normal hydrogen electrode (NHE) 55.The introduction of Ni(OH) 2 could render CTF-1 a more negative CB potential, which is much higher than the potential for CO 2 reduction to CO (A0.53 V).Meanwhile, combined with the band gap values, the VB potential for CTF-1 and Ni 0.5 -CTF-1 could be defined as 1.91 and 1.44 V, respectively. Based on the above analysis, the mechanism of photocatalytic CO 2 reduction could be proposed, as illustrated in Fig. 10.When subjected to visible light irradiation, the Ru(bpy) 3 2 as a photosensitizer was transformed into the excited state, which can be quenched by TEOA to generate a reduced photosensitizer.The product transferred the electrons to photocatalyst, which was conducive to the following CO 2 reduction 56.Meanwhile, CTF-1 could harvest light for the generation of electrons and holes.With the loading of Ni(OH) 2 nanoparticles, the electrons of CTF-1 in CB Remarkably, once the loading amount was beyond the optimal condition, the active sites would be covered and the generation rate of CO can be suppressed significantly.Thus, it is noteworthy that the modification process should proceed with a suitable amount of Ni(OH) 2 ."
  },
  {
    "title": "Conclusions",
    "content": "In summary, we rationally constructed the Ni(OH) 2 nanoparticles loaded on CTF-1 as cocatalysts by a facile precipitation process.The cocatalyst-semiconductor interfacial interaction provided an efficient conductive path for photoinduced electrons from CTF-1 to Ni(OH) 2 and thus leading to boosting photoreduction of CO 2 .Compared with bulk CTF-1, the Ni(OH) 2 -CTF-1 samples showed remarkable improvement and the sample with the loading ratio of 0.5 wt exhibited an optimum CO evolution rate, corresponding to 38.66 mmol h A1 g A1 .The superiority of the as-prepared sample was assigned to efficient charge carriers separation/transfer after the modification of Ni(OH) 2 .Moreover, the introduction of Ni (OH) 2 nanoparticles could result in increased specific surface area, improved CO 2 adsorption and enhanced visible light absorption.Compared with previous works where noble-and/or rare-metal compounds were used as cocatalysts 29303132, this work showcases that the earth-abundant metal hydroxide, that is, Ni(OH) 2 may serve as a good additive to boost the photocatalytic activity.The Fig. 1.Illustration of the preparation route for CTF-1 and Ni(OH) 2 /CTF-1 composites. Fig. 2. SEM and TEM images of CTF-1 (a and c) and Ni 0.5 /CTF-1 (b and d) and Elemental mapping images of Ni 0.5 /CTF-1 (e). Fig. 3. CO 2 adsorption curve of CTF-1 and Ni 0.5 -CTF-1. Fig. 4. (a) FT-IR spectra of CTF-1 and Ni x /CTF-1 (x 0.1, 0.5, 1, 2), (b) C 1s, (c) N 1s XPS spectra of CTF-1 and Ni 0.5 /CTF-1, (d) Ni 2p XPS spectra of Ni 0.5 /CTF-1. Fig. 6.(a) The transient photocurrent response of CTF-1 and Ni x -CTF-1 electrodes under visible light (k !420 nm), and (b) EIS nyquist plots of CTF-1 and Ni 0.5 -CTF-1. Fig. 8. (a) The stability evaluations of Ni 0.5 -CTF-1, and (b) UV-Vis DRS of the Ni 0.5 -CTF-1 before and after reactions. Fig. 9. Mott-Schottky plots for (a) pure CTF-1 and (b) Ni 0.5 -CTF-1. Fig. 10.Illustration of the photocatalytic CO 2 reduction mechanism over Ni(OH) 2 / CTF-1. Journal of Colloid and Interface Science 602 (2021) 23-31 This work was financially supported by the National Natural Science Foundation of China (51672047, 21707173), the National Natural Science Foundation of Fujian Province (2019J01648, 2019J01226), and the Youth Talent Support Program of Fujian Province (00387077). current progress offers a promising perspective for the development of CTF-based materials for efficient CO 2 photoreduction. Tiansu Zhao: Formal analysis, Writing -review editing.Qing Niu: Formal analysis.Guocheng Huang: Methodology, Supervision.Qiaoshan Chen: Investigation.Yanxin Gao: Investigation, Formal analysis.Jinhong Bi: Methodology, Funding acquisition, Writing -review editing, Supervision.Ling Wu: Investigation, Formal analysis. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://doi.org/10.1016/j.jcis.2021.05.131."
  }
]