[
  {
    "title": "Doi",
    "content": "10.1039/c7ce00566k"
  },
  {
    "title": "Article_Title",
    "content": "Amino acid-assisted controlling the shapes of rutile, brookite for enhanced photocatalytic CO<sub>2</sub> reduction"
  },
  {
    "title": "Abstract",
    "content": "TiO 2 nanoparticles with a controlled crystalline phase, size, shape and surface structure have been synthesized by a facile hydrothermal method using a water-soluble titanium complex and amino acid as the structure-directing and shape-controlling agents.The titania phases of rutile or brookite can be easily tuned by using different amino acid additives.Rutile nanorods with a high aspect ratio have been obtained in the presence of glutamic acid.Small nano-sized and well-faceted brookite can be synthesized using lysine as a pH-adjusting and shape-controlling agent.Amino acids play crucial roles in determining the crystalline phase as well as size and shape of the synthesized nanoparticles.The synthesized TiO 2 rutile and brookite with different shapes have been evaluated for photocatalytic activity by means of the reduction of carbon dioxide to methanol.The investigation results reveal that the methanol yield on rutile and brookite strongly depends on the crystalline phase, size, shape and surface structure of the synthesized nanocrystals.Among the rutile nanocrystals, the photocatalytic activity increases with an increasing percentage of the 111 surface.Brookite with exposed 210 facets exhibits a notable photocatalytic activity for CO 2 reduction presumably due to its specific surface structure with a spatial separation of reductive and oxidative sites.Our studies demonstrate the abilities of shape-control and facet-selectivity in determining photocatalytic activity, representing a critical step forward in the designing of high performance nanostructures for the reduction of CO 2 ."
  },
  {
    "title": "Experimental",
    "content": "TiO 2 was synthesized according to a previously reported method with an amino acid additive. 16177181920 Briefly, a yellowish transparent peroxo-titanic acid solution was prepared by the addition of an ammonia solution (2 cm 3 , 28, Kanto Chemicals Co., Inc.) and a hydrogen peroxide solution (10 cm 3 , 30, Kanto Chemicals Co., Inc.) to titanium metal powder (2 mmol, Wako Pure Chemical Industries Ltd.).Glycolic acid (3 mmol, Kanto Chemicals Co., Inc.) was added to the yellowish solution of peroxo-titanic acid, as a result of which the solution color changed from yellowish to pale red.Heat treatment at 353 K was carried out to remove excess ammonia and hydrogen peroxide.Finally, a stable titanium complex solution of a yellow-red color was obtained.Then, amino acid (Table S1, 2 mmol, Kanto Chemicals Co., Inc.) was added to the complex solution.The solution of the complex was diluted to 20 cm 3 using distilled water, placed in a Teflon-lined reactor and sealed in stainless steel autoclaves.The autoclave was heated at 473 K for 24 h for the hydrothermal treatment of the complexes.After that, the autoclave was allowed to cool down to room temperature.The resultant powders were separated by centrifugation and washed with distilled water until the obtained solution had a neutral pH. All the catalyst samples dispersed again in distilled water and were irradiated by UV light from a high-pressure mercury lamp to eliminate organic residues on the TiO 2 surface prior to the photocatalytic test.Finally, the obtained specimen was dried at 353 K for 1 day. Pt nanoparticles as cocatalysts were deposited on TiO 2 by a photodeposition method in a closed system.Typically, a suspension containing TiO 2 (100 mg) and 5 mol H 2 PtCl 6 in methanol solution (10 mL/40 mL) was irradiated with light from a 500 W Xe lamp for 1 h with stirring to obtain 1 wt Pt/TiO 2 .Generally, it is accepted that a limited amount of H 2 PtCl 6 will be deposited completely on the catalyst upon the light irradiation.The obtained precipitate was separated by centrifugation, washed repeatedly with fresh water, and dried in air at room-temperature overnight.Finally, the obtained powder was dried at 60 C for 12 h, yielding Pt/TiO 2 . The crystalline phase of the samples was characterized using powder X-ray diffraction (XRD; Rigaku RINV-2200, 40 kV and 30 mA) with CuK radiation ( 1.5406A).Data were collected in the 2- scanning mode with a scan speed of 4m in -1 and a step size of 0.02.The morphology of the particles was observed using a field-emission scanning electron microscope (FE-SEM, Hitachi S-4800) at an accelerating voltage of 5 kV.Transmission electron microscopy (TEM Hitachi H-7650, 100 kV) and High Resolution TEM (HR-TEM, Hitachi HF-2000) were conducted.Nanocrystals were dispersed in ethanol and then dropped onto a Cu microgrid coated with a holey carbon film, followed by vacuum evaporation at 60 C.IR spectra were recorded with a Jasco spectrometer within the range of 400-4000 cm -1 .Samples in the solid state were measured in KBr matrix pellets obtained with a hydraulic press under 40 kN pressure.DRS spectra of the solid samples were evaluated in the range of 200-800 nm with a spectrophotometer instrument (Shimadzu, UV 2450).N 2 adsorption and desorption isotherms were measured at 77 K (Micromeritics ASAP 2010) to yield the Brunauer-Emmett-Teller (BET) specific surface area. The photocatalytic reduction of CO 2 was carried out in an aqueous system under UV-vis irradiation according to our previous reports. 23,24In brief, 50 mg of catalyst was dispersed in 30 ml of distilled water containing sodium bicarbonate (NaHCO 3 , 0.1 M).Ultrahigh purity CO 2 (99.99) was pursed continuously into the reactor at a rate of 0.1 L min -1 for 0.5 h to remove oxygen in the water, and saturate carbon dioxide in the solution.The solution was prepared in a 30 cm 15 cm 5 cm reactor.The reaction system was initially tested to afford the optimal catalyst concentration of 1.65 g dm -3 .A fixed catalyst concentration was used in all the experiments, aiming to eliminate uncertainties associated with light reflection and reactor geometry.The solution was stood in the dark for 30 min until reaching adsorption-desorption equilibrium.The solution temperature was kept constant by a water bath.UV-vis light irradiation was provided by a 500 W high-pressure Xe lamp placed above the reactor.A Pyrex glass was placed on top of the reactor to cut off light with wavelengths 300 nm.The photocatalytic reaction was continued for up to 9 h and at every 1 h interval, the solution in the reactor was sampled.The sample solution was centrifuged and analyzed by GC-FID for CH 3 OH with a 2 m Porapak Q column.The rate of CH 3 OH evolution was defined as the total amount of evolved CH 3 OH divided by the reaction time. The photoreduction of CO 2 by various catalysts has been extensively studied. 1234567891025,26 The following reaction was proposed for the selective production of CH 3 OH: Prior to the photocatalytic reaction, the TiO 2 catalyst was dispersed in distilled water and irradiated by UV light from a high-pressure mercury lamp for 5 h, aiming to remove any organic residues on the TiO 2 surface.We carried out control experiments in the dark first and no CH 3 OH was detected for all the tested catalysts.Similarly, no CH 3 OH was detected for control experiments under light irradiation but without a catalyst.Preliminarily results from these control experiments indicate that both light irradiation and catalysts are indispensable for CO 2 photoreduction into CH 3 OH."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Hydrothermal treatment of the titanium-glycolate complex yielded single-phase rutile and brookite at pH 6.0 and 10.0, respectively (Fig. S1 ). 16XRD patterns of the particles obtained by hydrothermal treatment of the water-soluble titanium glycolate complex with different amino acid are shown in Fig. 1.The XRD patterns indicate that all the samples consist of crystalline titanium oxide without impurity.Anatase is crystalline phase obtained by the treatment of the complex with Asp and Tyr, while a single-phased rutile was formed in the presence of Ala, Gly, Pro, Glu, Ser, Thr, Cys, or Met.Interestingly, the addition of Lys or Arg to the complex solution resulted in the production of brookite as a major phase (70-80 of brookite) (Fig. 1g andh).The existence of brookite is clearly evident from the presence of a characteristic peak at 2 30.81whereno overlapping by those of anatase or rutile is present (Fig. S1 ).A mixture phase of rutile/brookite was obtained in the case of using His.To obtain single phase of brookite, an increasing amount of Lys (3 mmol) was further introduced into the complex solution before the hydrothermal treatment.Fig. S1q reveals that single-phased brookite has been synthesized in the presence of Lys.We used the method proposed by Banfield et al. 27 to estimate the phase composition of ru-tile (R) and brookite (B) of a sample synthesized using His as follows: (2) where I R and I B represent the XRD peak intensity of the rutile (110) and brookite (121), respectively. 27Similarly, the phase composition of anatase (A) and brookite (B) of the sample synthesized using Lys or Arg could also be estimated. 27The polymorph composition of all the samples is listed in Table S1. Moreover, based on the XRD patterns and the Scherrer equation, the crystallite size of different phases could also be calculated, as given in Table S1. The crystallite size of rutile synthesized in the presence of amino acids is readily reduced with respect to that of rutile particles obtained without amino acid.A similar tendency is also observed for brookite-type particles. The crystalline structures were also confirmed using Raman spectroscopy.As shown in Fig. 2, anatase obtained with Asp as the additive has characteristic bands at 400 cm -1 (optical mode: B1g), 522 cm -1 (A1g) and 642 cm -1 (Eg(3)), while rutile prepared using Glu (hereafter denoted as R Glu ) shows two peaks at 448 cm -1 (Eg) and 612 cm -1 (A1g).Generally, Raman spectroscopy is an efficient characterization method to clarify the appearance of brookite phases. 19,28As shown in Fig. 2c, the single-phased brookite synthesized with Lys (hereafter denoted as B Lys ) has the Raman shift peaks of brookite with one strong Raman peak at 156 cm -1 (A1g) and 13 weak peaks at ca. 126, 197, 215, 245, 287, 320, 365, 414, 460, 502, 548, 589, and 637 cm -1 . 19These shift peaks indicate that brookite is the only phase present in the synthesized particles due to the absence of shift peaks inherent in anatase (400 cm -1 and 522 cm -1 ) and rutile (448 cm -1 and 612 cm -1 ). The effect of amino acid on the size and shape of the obtained particles in the present study was also investigated by SEM and TEM.As shown in Fig. 3 and Fig. S2-S4, all the samples consist of nano-sized particles.The synthesized rutile and brookite in the absence of amino acid are composed of mainly nanorod particles with low aspect ratios (Fig. 3a andb).Rutile obtained by hydrothermal treatment in the presence of Glu (R Glu ) comprises 20-150 nm rod-like particles which have a much higher aspect ratio compared to that of rutile obtained without additive (Fig. 3c ande).Fig. S4 shows electron microscopic images of the anatase-brookite particles obtained by hydrothermal treatment of the complex with Lys.The synthesized anatase-brookite particles disperse uniformly and display a mainly spherical morphology with an average diameter of 10 nm.The single-phased brookite-type particles synthesized in the presence of Lys (B Lys ) are composed of well-faceted nanocrystals of different shapes with sizes in the range of 10-30 nm (Fig. 3d andf).These brookite nanoparticles are smaller than the usual size of brookite reported in a previous study. 16igh-resolution TEM analysis is performed to examine the detailed structure of rutile and brookite.The HRTEM images of rutile and R Glu are shown in Fig. 4a andc.The selectedarea electron diffraction pattern in Fig. 4b taken from the branch of rutile can be indexed to the 1-10 zone axis of single-crystal tetragonal TiO 2 .A HRTEM image of a nanorod branch of R Glu indicates the growth of the rutile along the 001 direction (Fig. 4d).The exposed side surface and the end of the nanorod are attributed to 110 and 111 facet, respectively.The HRTEM image of B Lys is present in Fig. 4e.The crystallographic structure is identified as brookite TiO 2 by characteristic spacing and angles of the lattice fringes.The B Lys particle is imaged along the -12-1 B zone axis, and it is bound by (210) B , with a lattice spacing of 0.35 nm; (111) B , 0.35 nm; and (-110) B , 0.45 nm.The exposed surface facets could not be simply confirmed by HRTEM, so further investigation on SAED and STEM image is needed. On the basis of the above results, it is clear that amino acids play a critical role in controlling the crystalline structure and shape of TiO 2 .As demonstrated previously, pH is a crucial factor in determining the crystalline phase synthesized from a titanium-complex. 16Amino acid is also a pH-adjusting agent through its dissociation in an aqueous solution.Thus, anatase, rutile, and brookite are, respectively, obtained in acidic, neutral, and basic solutions of Asp, (Ala, Gly, Pro, Phe, Ser, Thr, Cys, Met) and (Lys, Arg, His), respectively.While pH is crucial in almost all cases, it is not so for Glu and Tyr.Therefore, another factor should be taken into account, namely the capping effect, in which the adsorption of amino acid on the particle interface changes the crystal growth habit of titania, resulting in the formation of different phases and shapes. It is well-known that a capping strategy is particularly efficient to control the growth of nanocrystals in desired surface structures or shapes. 19,20The additives may provide a chemical bond to the dangling atom on the particle surface, and thus reduce the interface tension and stabilize the adsorbed surfaces.The interface tension of different facets of anatase nanocrystals can be altered by selective adsorption of amino acid additives such as Glu or Asp. 21As a result of this, high energy 001 facets can be gradually eliminated during the crystal growth, leading to the growth of a high aspect ratio ellipsoid nanocrystals. 21It has been found that amino acids such as Glu may selectively adsorb on the 101 facets of anatase, resulting in the formation of rod-like nanocrystals with preferential growth in the 001 direction. 21On the other hand, the possible adsorption configuration of the rutile 110 surface is similar to that of the anatase 101 surface.Thus, it is reasonable that Glu is also selectively adsorbed on the 110 facets of rutile, favoring the growth of the rutile nanorod in the 001 direction with a high aspect ratio (Fig. 5a). In order to verify the above discussion, FTIR spectra of the as-prepared TiO 2 samples were investigated.Fig. S5a shows the FTIR spectra of glutamic acid functionalized TiO 2 (R Glu ) in comparison with those of glutamic acid and a TiO 2 commercial product (P25).According to the spectra, the peaks around 1680 cm -1 can be assigned to the stretching vibrations of the hydroxyl group surface of titanium oxide.Besides that, the peaks at 1405 cm -1 and 1540 cm -1 are attributed to the asymmetric and symmetric stretching vibrations of -COO -, which can be observed in R Glu .The S IJCOO -) stretching frequency observed in the FTIR of the synthesized particles indicates that the carboxyl group is deprotonated due to the chelation to surface titanium ions.Furthermore, the presence of a band at around 1710 cm -1 corresponding to the stretching vibration of COOH group implies that one of the carboxyl groups has not been deprotonated.And the peak at 1100 cm -1 is attributed to the stretching vibrations of C-N from glutamic acid.This result further indicated that glutamic acid molecules were adsorbed on the surface of TiO 2 and may play an important role in the formation of the high aspect ratio rod-like nanostructures. The formation of nano-sized well-faceted brookite particles can also be explained by the capping effect.Lys may provide a specific interaction with the brookite surface through its functional groups, and thus restrain the growth of larger crystals (Fig. 5b).It should be mentioned that brookite obtained under the alkaline conditions of ammonia or urea, 29,30 where no capping effect is pronounced, forms very large crystallites of rod-like, snowflake-like or multineedle shape.In the presence of an additive such as an oleate anion, however, a nano-sized brookite of pseudocubic crystal shape could be grown due to the selective adsorption of the additive on brookite surface. 19In the present system, the presence of Lys on the surface of brookite is evidenced from the FT-IR analysis as shown in Fig. S5b. Thus, it can be concluded that Lys with its amine and carboxyl groups may form a complexation with Ti on the particle interface, thus providing the capping effect (Fig. 5b).The selective chelation of Lys on a specific brookite surface may be attributed to the growth of well-faceted nanocrystals as shown in Fig. 3d andf.The study on these selective facets and their growth is under progress. The optical properties study only refers to rutile and brookite whose photocatalytic activity is discussed later.Diffuse reflectance spectra of the synthesized TiO 2 in comparison with that of Degussa P25 are shown in Fig. 6A.It is obvious that absorption band of the synthesized particles somewhat shifts toward longer wavelengths with respect to that of the commercial product P25.The absorption intensity of the rutile particles dominates that of the P25 or brookite particles.The absorption in the visible-light region increases in the order P25 brookite rutile. In order to gain insight into the optical properties of titania powder, the band gap energies of the synthesized materials were studied in detail.The band gap energies can be determined by plotting the modified Kubelka-Munk function FIJR)E 1/2 calculated from the optical absorption spectrum vs. the energy of the exciting light (Fig. 6B).The values are given in Table 1.The band gap of brookite synthesized with Lys is at around 3.20 eV, whereas that of rutile is about 3.00 eV. The photocatalytic activities of the synthesized TiO 2 rutile and brookite were evaluated in terms of photocatalytic CO 2 reduction from aqueous solution under UV-vis ( 300 nm) irradiation.The results of the photocatalytic study only refer to rutile and brookite, whose photocatalytic CO 2 reduction were less reported.Table 1 lists the methanol yields, specific BET surface areas and other physical properties of the corresponding samples.The rutile samples include whisker particle R Whisker , 18 nanorod R Glu (Fig. 3c ande), rutile (Fig. 3a) and flowerlike particles with exposed high-index facets R Flower . 20Under the irradiation of light, brookite samples exhibited a higher activity than those of rutile (Fig. 7).The methanol yields on the brookite samples are in range of 7.08-9.22mol g -1 , whereas those on rutile are in the range of 3.14-5.12mol g -1 .R Glu (Fig. 3c ande) showed a lower activity with respect to that of the rutile sample (Fig. 3a).Especially, B Lys (Fig. 3d andf) exhibited a remarkable photoactivity with a methanol yield of 9.22 mol g -1 , that is 1.30 times higher than that on the brookite sample (Fig. 3b). All the brookite TiO 2 samples exhibited a significantly higher photocatalytic activity than those of the rutile samples, which may be attributed to the nature of crystalline brookite.It has been reported that brookite had a higher photocatalytic activity than those of rutile and anatase. 31Li et al. also reported that the photocatalytic CO 2 reduction activity of a pure brookite suspension was higher than that of pure anatase or rutile, despite the former having a lower surface area. 31Our results suggest that the brookite-type TiO 2 has a higher activity than that of rutile with the same morphology and specific BET surface area (Table 1).This may be due to the fact that brookite TiO 2 shows the highest reduction ability, from the evaluation of the conduction band po-tential. 30The more negative flat band potential is beneficial for CO 2 reduction.We performed the examination of brookite particles after the photocatalytic reaction.The XRD pattern of brookite after the catalytic reaction with light irradiation in Fig. S6 reveals that a phase transformation does not occur. The different activity of different rutile samples can be understood from their surface structures.All of the rutile TiO 2 with different shapes investigated in the present study were well-crystallized and well-faceted as shown in Fig. 3 and4, which was, indeed, the result of a slow growth from a stable titanium-complex.In particular, it has been proved that rutile synthesized from titanium-glycolate grows in the 001 direction with the predominant exposure of 110 facets and 111 facets. 18,20It is observed that the surface area percentage of 111 facets increases in the order R Glu R Whisker Rutile R Flower , whereas the specific BET surface areas increase in the opposite order (Fig. 8, Table 1).On the basis of the investigation, it is found that that photocatalytic CO 2 reduction activity increases with an increased surface area percentage of 111 facets.For instance, R Glu showed a lower activity compared to that of rutile presumably due to the fact that the former possesses a higher aspect ratio with a smaller percentage of 111 facets.Thus, the methanol yield was found to be strongly dependent on the percentage of the 111 surface. Ohno et al. reported that crystal faces on TiO 2 particles are particularly important to the photocatalytic properties. 323333435 This is due to the fact that oxidation and reduction occur simultaneously on each particle.Because of their different atomic arrangements, the well-developed facets on TiO 2 provide both oxidation and reduction sites, leading to an enhanced efficiency of the electron-hole separation. 32The selective photodeposition of Pt and PbO 2 indicates that the (110) face provides reductive sites and that the (111) face provides oxidative sites. 33In this study, it was also observed that Pt particles were deposited on the 110 facets of rutile, as revealed from TEM images of particles after the photodeposition of platinum (Fig. 9a andb).As mentioned above, the photocatalytic activity increases with an increased Fig. 8 The correlation between properties and methanol yield on rutile and brookite.We also observed that brookite B Lys showed a great improvement (1.3 times higher) in the photocatalytic CO 2 reduction compared to that of conventional brookite particles.This enhancement may be attributed to its well-grown exposed facets (Fig. 4e).The brookite nanocrystals are bound by 210, 111, and 110 facets.These facets induce the effective suppression of recombination rates of photogenerated electrons and holes by providing separated oxidative and reductive sites. 3637738 Such exposed facets have been found to be beneficial to the photoreduction of CO 2 . 39,40 In order to enhance the quantum yield and selectivity from CO 2 reduction, a co-catalyst was used as the reductive sites and improve multi-electron reduction. 4142243 In this work, Pt was used as the co-catalyst, which plays a role as an electron trap to prevent the electron-hole combination.Fig. 9 shows TEM images of a Pt/TiO 2 rutile nanocrystals indicating the deposition of Pt nanoparticles of 1 nm in size on the surface of TiO 2 .Fig. 10 shows methanol yields on rutile and brookite with a Pt loading in comparison with samples without loading.The increase in methanol yield on Pt/TiO 2 was presumably due to the suppression of the electron-hole recombination.The photogenerated electron will be trapped at the Pt islands followed by the multi-electron reduction of CO 2 . We tested the photocatalytic activity of all the synthesized TiO 2 catalysts upon visible light ( 400 nm) irradiation. 24owever, only a small amount of methanol (less than 1 mol g -1 ) was detected, as shown in Fig. S7."
  },
  {
    "title": "Conclusions",
    "content": "In summary, well-defined titania nanostructures have been synthesized by a facile hydrothermal method with amino acids as the shape-controlling agent.The titania phases of anatase, rutile or brookite can be easily tuned by using different kinds of amino acid.High aspect ratio rod-like rutile has been synthesized by using a glutamic acid additive.Brookite with a small size and well-faceted surface can be obtained in the presence of lysine.Amino acids play versatile roles as pHadjusting and capping agents for controlling the crystalline structure, size and shape of the synthesized nanoparticles.Among the rutile samples, the photocatalytic activity increases with increasing 111 surface percentage.Brookite with exposed 210 facets exhibited a notable photocatalytic reduction of CO 2 to methanol, presumably due to its specific surface structure with spatial separation of the reductive and oxidative sites.Our studies demonstrate the abilities of sizecontrol and facet-selectivity in determining photocatalytic activity, representing a critical step forward in the designing of high performance nanostructures for the photocatalytic reduction of CO 2 to methanol. Fig. 1 XRD patterns of the particles synthesized by hydrothermal treatment of titanium-glycolate in the presence of different amino acids.A: Anatase, B: brookite, R: rutile. Fig. 3 TEM images of the synthesized particles from titaniumglycolate at pH (a) 6.0, rutile (b) 10.0, brookite.SEM (c and d) and TEM (e and f) images of the synthesized particles using (c and e) Glu, rutile and (d and f) Lys, 100 brookite. Fig. 2 Raman spectra of the particles synthesized using: (a) Asp (anatase), (b) Glu (rutile), and (c) Lys (100 brookite). Fig. 5 (a) A possible model of glutamic acid adsorption on the 110 face of rutile.Surface hydroxyl groups are omitted for clarify.(b) Schematic representation of the formation mechanism of brookite with different morphologies: (top) a growth process in the absence of amino acid; (bottom) in the presence of amino acid. Fig. 4 TEM images of the synthesized particles from titaniumglycolate at pH (a) 6.0, rutile.(b) SAED pattern of rutile branch in (a).(c) TEM image of the synthesized particles using Glu, rutile.(d) HRTEM image of the rutile nanorod in (c).(e) HRTEM image of the synthesized particles using Lys, single-phased brookite. Fig. 6 (A) UV-vis DRS spectra of the synthesized particles (a) rutile, (b) R Glu , (c) brookite, (d) B Lys , and (e) P25.(B) Plot of the Kubelka-Munk function versus the energy of light absorbed. Fig.7The time course of methanol evolution on the synthesized particles. Fig.9TEM images of Pt-deposited rutile TiO 2 particles synthesized at pH 6 (a) and rutile whiskers obtained in the presence of glycolic acid (b).18 Fig.9TEM images of Pt-deposited rutile TiO 2 particles synthesized at pH 6 (a) and rutile whiskers obtained in the presence of glycolic acid (b).18 Fig. 10 Methanol yields over bare (violet) and Pt co-catalyst loaded (red) rutile and brookite TiO 2 . Chemical and physical properties and H 2 evolution rate on the TiO 2 catalysts a Estimated according to the Scherrer equation: D (hkl) (K)/( cos ) where K is the shape factor, the wavelength of the Cu K radiation, the full width at half-maximum (fwhm) of the (hkl) peak, and the diffraction angle.b Ref. 18. c Ref.20. Published on 10 July 2017.Downloaded by University of Windsor on 19/07/2017 14:46:06.View Article Online The authors wish to thank Professor Masato Kakihana at Tohoku University for fruitful discussion.This work was partly supported by a Grant-in-Aid for Basic Research from the Vietnam National University."
  }
]