[
  {
    "title": "Doi",
    "content": "10.1039/d0qi01410a"
  },
  {
    "title": "Article_Title",
    "content": "Two novel nickel cluster substituted polyoxometalates: syntheses, structures and their photocatalytic activities, magnetic behaviors, and proton conduction properties"
  },
  {
    "title": "Abstract",
    "content": "Two novel nickel cluster substituted polyoxometalates (POMs), H 7 Na 19 (H 2 O) 26 Ni 12 (OH) 9 (PO 4 ) 4 (A-SiW 9 O 34 )W 4 O 10 (OH)(PO 2 (OH) 2 ) 2 (A--SiW 9 O 34 ) 2 4C 2 H 8 N27H 2 O (1) and H 26.5 K 2.5 Na(H 2 O) 16 Ni 6 (OH)diethylenetriamine), have been successfully prepared.1 is a Ni 12 -substituted POM comprised of a novel Ni 12 (OH) 9 (PO 4 ) 4 core, an A--SiW 9 O 34 unit and an uncommon W 4 O 10 (OH)PO 2 (OH) 2 2 (A--SiW 9 O 34 ) 2 fragment.2 is a Ni 6 -substituted sandwich-type POM constructed from two B--SiW 10 O 37 units and an unusual boat-like Ni 6 (OH)(BO 3 ) 2 (dien) 2 cluster.Photocatalytic study reveals that 2 shows a moderate catalytic activity in visible-light-driven CO 2 reduction reactions.Additionally, the magnetic behaviors and the proton conduction performances of the compounds were investigated."
  },
  {
    "title": "Experimental",
    "content": "All chemical reagents were purchased and directly used without purification.Na 10 A--SiW 9 O 34 18H 2 O was synthesized according to the literature method. 37IR spectra were recorded on an Opus Vertex 70 FT-IR infrared spectrophotometer in the range of 4000-500 cm -1 .Inductively coupled plasma atomic emission spectrometry (ICP-AES) was performed on an Ultima2 spectrometer.Elemental analyses of C, H, and N were conducted on a Vario EL III elemental analyzer.Powder X-ray diffraction (PXRD) patterns were collected on a Philips X'Pert-MPD diffractometer with CuK radiation ( 1.54056A).Thermogravimetric analysis was conducted on a Mettler Toledo TGA/SDTA 851 e analyzer under an air-flow atmosphere with a 10 C min -1 heating rate in the temperature of 30-800 C.UV-vis diffuse reflection spectra were collected using a PerkinElmer Lambda 35 spectrophotometer.Magnetic properties analyses (Variable temperature susceptibility measurements) were carried out on monocrystalline samples with a Quantum Design PPMS-9T magnetometer within the temperature range of 1.99-300 K in a magnetic field of 0.1 T. The experimental susceptibilities were corrected for Pascal's constants.NaH 2 PO 4 (aq).After one hour of stirring, the pH value of the resulting solution was adjusted to 9 by 3 mol L -1 NaOH (2 mL).And then the mixture was sealed in a glass vial (20 mL) and heated at 100 C for 96 h.The pH value after reaction was 7.After the reaction was cooled to room temperature, green block crystals were obtained.The phase purity of 1 was confirmed by PXRD (Fig. S1 (20 mL) and heated at 80 C for 6 days.The pH values before and after reaction were 7 and 7, respectively.After the reaction was cooled to room temperature, the filtrate was left to evaporate slowly at room temperature.Green block crystals were obtained three weeks later.The phase purity of 2 was confirmed by PXRD (Fig. S3, ESI ).Yield: 11.82 based on Ni(Ac) 2 4H 2 O. Elemental analysis calcd (found ) for 2: C, 1.58 (1.34); H, 1.33 (1.23); N, 1.39 (1.31).ICP analyses (based on dried sample) calcd (found ) for 2: B, 0.35 (0.21); K, 0.80 (0.91); Na, 0.19 (0.22); Si, 0.92 (0.84); Ni, 5.82 (5.69); W, 60.83 (60.28).IR (solid ATR, /cm -1 ): 3327(m), 1634(vs), 1345(vs), 1128(w) 1076(w), 985(s), 937(m), 871(w), 766(m), 658(w), 459(s) (Fig. S4, ESI ). Single-crystal X-ray diffraction data for 1 and 2 was collected on a Bruker APEX II diffractometer at 175 K equipped with a fine focus, 2.0 kW sealed tube X-ray source (MoK radiation, 0.71073 A) operating at 50 kV and 30 mA.The program SADABS was used for absorption correction.The structures were solved by the direct method and refined on F 2 by fullmatrix least-squares methods using the SHELX-2013 program package.All hydrogen atoms attached to carbon atoms were generated geometrically.The residual electron density that could not be sensibly modeled as solvents or anions were removed via the application of the SQUEEZE function in PLATON.The final formulas of 1 and 2 were determined by the combination of single-crystal X-ray diffractions with the elemental analyses, the thermogravimetric analyses, and charge balance.Crystallographic data for the structures reported in this work have been deposited in the Cambridge Crystallographic Data Center with CCDC 1585405, 2043277 for 1, 2 respectively.Crystallographic data and structure refinements for 1 and 2 are summarized in Table 1."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Single crystal X-ray diffraction analysis indicates that compound 1 crystallizes in the monoclinic P2 1 /m space group.As shown in Fig. 1a, the polyanion of 1 consists of a trilacunary Keggin-type A--SiW 9 O 34 (A-SiW 9 ) (Fig. 1b) unit, an unprecedented W 4 O 10 (OH)PO 2 (OH) 2 2 (A--SiW 9 O 34 ) 2 (A-P 2 Si 2 W 22 ) (Fig. 1c) fragment and a central Ni 12 (OH) 9 (PO 4 ) 4 (Ni 12 , Fig. 1d) core.The A-P 2 Si 2 W 22 fragment comes from an in situ structural transformation from the starting A-SiW 9 units and plays an important role in the construction of 1.The A-P 2 Si 2 W 22 moiety is composed of two A-SiW 9 units bridged by an additional belt- 1e) unit, which has never been found before.The P 2 W 4 unit can be viewed as a W 4 O 10 (OH) subunit consisting of four corner-sharing WO 6 octahedra further decorated by two PO 4 tetrahedra in the gaps at both ends.These additional WO 6 octahedra should be generated from in situ degradation of the starting A-SiW 9 units under the basic condition.So far, isopolyoxotungstate fragments based on a number of WO 6 octahedra which serve as a linker to construct novel multilacunary POM fragments are still rare.A representative example is a Sb 2 W 20 O 73 fragment comprised of two SbW 9 O 34 units and an isopolytungstate fragment based on two WO 6 octahedra. 38Therefore, the A-P 2 Si 2 W 22 subunit can be considered as an interesting multi-dentate oxo ligand to incorporate with the Ni 12 cluster.The central Ni 12 (Fig. 1f) cluster can be described as three tetrahedral Ni 4 (OH) 3 (Fig. 1g) building blocks connected by a 3 -PO 4 tetrahedron and three 4 -PO 4 tetrahedra.In other words, the whole polyanion of 1 can also be understood as a Ni 3 (PO 4 ) 4 core enveloped by three (NiOH) 3 (A--SiW 9 O 34 ) units, in which the Ni 3 (PO 4 ) 4 core displays a Ni 3 O 4 (Fig. 1h) quasicubane structure, and an extra P 2 W 4 cluster further anchors two trilacunary subunits.All the nickel ions in the Ni 12 Single crystal X-ray diffraction analysis reveals that 2 crystallizes in the trigonal P3 2 21 chiral space group.The asymmetric unit of 2 contains two identical Ni 6 -substituted polyanions (Fig. 2a andb), each of which is composed of two dilacunary B--SiW 10 O 37 (B-SiW 10 ) units and a hexa-nuclear nickel cluster Ni 6 (OH)(BO 3 ) 2 (dien) 2 (Ni 6 , Fig. 2c).The B-SiW 10 (Fig. 2d) comes from in situ structural transformation from the starting A-SiW 9 units.The central Ni 6 cluster can be regarded as a boat-like structure consisting of six nickel ions and is further stabilized by two dien ligands (Fig. 2e) and two BO 3 units (Fig. 2f ).The four Ni atoms situated at the bottom of the boat are coordinated by five O atoms and one OH group.The other two Ni atoms at the bow and stern of the boat are coordinated by three N atoms from a dien ligand and three O atoms, respectively (Fig. 2g).All the nickel atoms in this Ni 6 cluster adopt a distorted octahedral coordination geometry with the Ni-O bond lengths in the range of 1.956(19)-2.332(18) A and the Ni-N bond lengths in the ranges of 2.022-2.100A.The BO 3 units is from the depolymerization of the starting Li 2 B 4 O 7 and K 2 B 10 O 16 8H 2 O, and the B-O bond lengths of the BO 3 segment are in the range of 1.313-1.438A.Up to now, the boron species have been seldom found in POM chemistry, 39 and such a Ni 6 cluster decorated by two BO 3 units has not been found before.BVS calculations manifested that all the nickel ions are in the 2 oxidation state and partial O atoms are in the -1 valence state (Table S5, ESI ).Although Gd (NO 3 ) 3 does not crystallize in the structure, it may show subtle influence in adjusting the ionic strength or the pH value of the reaction system, which is crucial for the formation of compound 2. Interestingly, the boat-like Ni 6 cluster in 2 is different from other previously reported hexa-nuclear nickel cluster in POM chemistry such as cross-type (Fig. 3a), 41 S-shaped (Fig. 3b), 42 hexagonal ring (Fig. 3c), 43 plane triangle (Fig. 3d) 36 and Z type Ni 6 cluster (Fig. 3e). 44Therefore, 2 represents an important new member of hexa-nuclear nickel cluster incorporated TMSPs. The bandgaps (E g ) of 1 and 2 were calculated by UV-vis diffuse reflection measurements and the Tauc plots of (ahv) 1/2 .The E g values for 1 and 2 were 2.78 eV and 2.57 eV (Fig. S5, ESI ), respectively, suggesting that they are potential semiconductive materials.The photocatalytic activities of 1 and 2 were initially evaluated by a photocatalytic system of visible-light-driven CO 2 reduction with Ru(bpy) 3 Cl 2 6H 2 O and triethanolamine (TEOA) as the photosensitizer and the electron donor, respectively. 4546647 The gas products of CO and H 2 were monitored by gas chromatography.Under continuously visible light irradiation, the production of CO and H 2 for 1 and 2 increased as time went by.The yields of CO and H 2 for 1 within 1 h irradiation were 1950 and 410 mol g -1 (TON 23.71),respectively (Fig. 4a).Different from 1, the yields of CO and H 2 for 2 within the same time reached to 6988 and 1315 mol g -1 (TON 83.03),respectively, indicating that 2 is more active than 1 in photocatalytic reduction of CO 2 (Fig. 4a).Hence, the photocatalytic performance of 2 was further studied in detail in this work.As shown in Fig. 4b, the yield of CO increased at a constant speed in the first 40 min, but leveled off after 60 min. The subsequent drop in performance may be due to the partial decomposition of Ru(bpy) 3 Cl 2 6H 2 O.To illuminate the origin of CO, an isotope tracer experiment involving 13 CO 2 was carried out.The peaks at 2.7 min and the signal at m/z 29 were assigned to 13 CO, demonstrating that CO originates from CO 2 reduction (Fig. S7,ESI ). In order to further understand the role of components in photocatalytic system, a series of control experiments were performed (Table S6, ESI ).When the reactions were carried out in dark or nitrogen conditions, there was no CO or H 2 generated.When the experiments were conducted in the absence of photosensitizer or electron donor, the production was negligible, implying that Ru(bpy) 3 Cl 2 6H 2 O, TEOA are all indispensable for the reaction system.Without 2 as a catalyst, only a trace amount of CO and H 2 were detected, indicating that 2 plays an important role in photoreduction system.In addition, when Ni(Ac) 2 4H 2 O was used to replace 2 as a catalyst, there was no H 2 produced and only a few CO was detected (TON 8.02).Meanwhile, the photoreduction activity of the other reaction starting materials, such as Na 10 A--SiW 9 O 34 , were also explored, and there were only negligible CO/H 2 detected.UVvis spectrum of 2 (1.7 10 -5 M) was recorded in the solution with different aging time (0-10 h).The UV-vis curves of 2 remain unchanged during the aging course (Fig. S8,ESI ), which indicates the stability of 2 during the process of CO 2 photoreduction.The proposed mechanism of 2 in the photoreduction of CO 2 is presented in Fig. S9, ESI. The Ru(bpy) 3 2 is excited from the ground state to the excited state under the irradiation of visible light, and then, it interacts with TEOA to form the reductive photosensitizer.The reductive photosensitizer reverts to the ground state after transferring electrons to 2. The process can effectively restrain the recombination of the electron-hole pair.Afterward, 2 provides active sites for CO 2 reduction.Ultimately, CO and H 2 are released from the system. 25,27,45 Variable-temperature magnetic susceptibilities of 1 and 2 were measured between 1.99 and 300 K with an applied magnetic field of 1000 Oe.As shown in Fig. 5, the m T value of 1 at 300 K is 16.89 cm 3 K mol -1 .The value is slightly higher than the theoretical value of 12 cm 3 K mol -1 for twelve spin-only Ni 2 ions (S 1 and g 2.0), which is attributed to the strong orbital contribution of the high-spin octahedral Ni 2 .The m T value declined gradually with the decreasing temperature and reached to a minimum of 12.91 cm 3 K mol -1 at 45 K. Below 45 K, the m T versus T curve increased quickly to reach to a maximum of 16.04 cm 3 K mol -1 at about 6.44 K and then rapidly dropped to 14.84 cm 3 K mol -1 at 1.99 K.The decrease of m T value from room temperature might be associated with the characteristic spin-orbit coupling of the single Ni 2 .Upon further cooling, the sharp upturn of m T reveals the presence of ferromagnetic interactions within the Ni 12 spin core.Finally, the decrease of m T below 6.44 K is probably ascribed to the existence of magnetic anisotropy of Ni 2 ions (zero-field splitting of the ground state) or weak intramolecular antiferromagnetic interactions. 4849950 Although possessing a simple Heisenberg model, it also impossible to model the susceptibility due to the presence of different intramolecular magnetic interactions of the compound and the low symmetry of the Ni 12 center. 51Hence, it indicates that antiferromagnetic interactions should be in competition with ferromagnetic ones within the cores. As shown in Fig. 6, the m T value of 2 at 300 K is 13.61 cm 3 K mol -1 .This value is also slightly higher than the theoretical value of 12 cm 3 K mol -1 for twelve spin-only Ni II ions (S 1 and g 2.0), which originated from the strong orbital contri-Fig.5 The temperature dependence of m T for 1 between 1.99 to 300 K. bution of the high-spin octahedral Ni 2 .Upon further cooling, the m T product displayed a sustaining decrease smoothly from 300 K to a minimum of 4.09 cm 3 K mol -1 at 1.99 K.This phenomenon shows that there are definitely antiferromagnetic interactions between the Ni 2 ions in 2. Furthermore, alternating current magnetic susceptibilities of 1 and 2 with frequencies between 111 and 2311 Hz were collected under H AC 3 Oe, and no frequency dependance was observed (Fig. S10 and S11, ESI ). The presence of large amounts of Na , delocalized H , and H 2 O molecules within 1 prompts us to evaluate its proton conduction performance.Firstly, the relative humidity (RH) dependence on 1 was measured in the range of 55-98 RH at 25 C.As shown in Fig. 7a, the conductivity () increased from 3.74 10 -4 S cm -1 to 7.33 10 -3 S cm -1 when the RH increased from 55 to 98, indicating the entry of more water into the structure as mobile proton transfer sites under high humidity conditions. 52,53Meanwhile, the temperature-dependence conduction behavior of 1 was tested between 25 and 50 C under 98 RH (Fig. 7b).The Nyquist plots reveal that the conductivity value shows a continuous increase and reaches to the maximum value of 1.89 10 -2 S cm -1 at 98 RH as the temperature rises to 50 C, indicating that the temperature is more effective than RH in promoting the conductivity.The enhancement of the conductivity as the temperature rises should be attributed to the accelerated transfer of protons in the channel as the temperature increases.The conductivity of 1 at 50 C under 98 RH is comparable to some reported POM-based proton conductive materials. 5455556 Finally, according to Arrhenius fomula (T 0 exp(-E a /k b T ), the activation energy of 0.33 eV was estimated by linear regression analysis, indicating that it belongs to the Grotthuss mechanism (0.4 eV) (Fig. 7c). 57The PXRD characterization confirms that the structure of 1 remains intact after proton conductivity experiments (Fig. 7d)."
  },
  {
    "title": "Conclusions",
    "content": "In summary, two novel nickel cluster substituted POMs have been successfully synthesized and fully characterized.Interestingly, 1 is a novel Ni 12 -substituted POM, in which a brand-new A-P 2 Si 2 W 22 fragment is found for the first time.And 2 is an uncommon sandwich-type TMSP structure with a boat-like Ni 6 core.CO 2 photoreduction experiments reveal that 2 exhibits a moderate catalytic activity.Moreover, the proton conduction experiments suggest that 1 may be a potential proton conduction material.This work not only enriches the structural diversity of nickel cluster substituted POM materials, but also extends the applications of TM cluster substituted POMs.Fig. 6 The temperature dependence of m T for 2 between 1.99 to 300 K. Fig. 1 (a) Combined polyhedral/ball-and-stick representation of the polyanion in 1.(b) The trilacunary Keggin polyanion A-SiW 9 .(c) The A-P 2 Si 2 W 22 fragment.(d) The connection diagram of the Ni 12 core and four PO 4 .(e) The belt-like P 2 W 4 unit.(f ) The Ni 12 core.(g) The Ni 4 (OH) 3 (A--SiW 9 O 34 ) unit.(h) View of the Ni 3 O 4 quasi-cubane structure.Color legend: WO 6 , red octahedra; Ni II , green balls; NiO 6 , green octahedra; SiO 4 , yellow tetrahedron; PO 4 , purple tetrahedron. Fig. 2 (a) Ball-and-stick representation of 2. (b) Combined polyhedral/ ball-and-stick representation of compound 2. (c) The Ni 6 cluster.(d) The dilacunary Keggin polyanion B-SiW 10 .(e) Coordination view of the Ni atom with dien.(f ) The BO 3 group.(g) The Ni 6 polyhedron. Fig. 3 (a) cross-type Ni 6 cluster.(b) S type Ni 6 cluster.(c) hexagonal ring Ni 6 cluster cluster.(d) plane triangle Ni 6 cluster.(e) Z type Ni 6 cluster. Fig. 4 (a) The yield of CO and H 2 of photoreduction using 1 and 2 as catalysts for 1 h.(b) The effect of the reaction time on the evolution of CO and H 2 from the CO 2 photoreduction.Reaction conditions: compounds (0.1 mol), Ru(bpy) 3 Cl 2 6H 2 O (0.01 mmol) TEOA (1 mL), H 2 O (1 mL) and acetonitrile (MeCN, 4 mL).The reaction setup was alternately vacuum degassed and purged with CO 2 three times, after which highpurity CO 2 was purged again for 30 min, 420 nm, 30 C, 1 h. Fig. 7 (a) Nyquist plots for 1 at different RHs and T 25 C.(b) Nyquist plots for 1 at different temperatures and 98 RH.(c) Arrhenius plots of the conductivity of 1.(d) The PXRD patterns of the as-synthesized sample and the sample after proton conductivity test for 1. As part of our continuous work in this area, we have successfully prepared another two TMSPs incorporating/ containing different large nickel clusters: H 7 Na 19 (H 2 O) 26 Ni 12 -(OH) 9 (PO 4 ) 4 (A--SiW 9 O 34 )W 4 O 10 (OH)(PO 2 (OH) 2 ) 2 (A--SiW 9 O 34 ) 2 4C 2 H 8 N27H 2 O (1) and H 26.5 K 2.5 Na(H 2 O) 16 Ni 6 (OH)(BO 3 ) 2 (dien) 2 -(B--SiW 10 O 37 ) 2 2 24H 2 O (2).As far as we know, 1 is a brand new nickel-based TMSP in which a twelve-nuclear nickel cluster was stabilized by an A--SiW 9 O 34 unit and an unprecedented W 4 O 10 (OH)PO 2 (OH) 2 2 cluster display a distorted octahedral coordination geometry, and the Ni-O bond lengths are in the range of 1.947(19)-2.230(18)A.Bond valence sum (BVS) calculations manifest that all the nickel ions are in the 2 oxidation state and partial O atoms are in the -1 valence state (Tables S2-S4, ESI ).It is noteworthy that such a Ni 12 cluster is different from those reported nickel clusters containing twelve nickel ions in reported compounds including Ni 12 (OH) 9 WO 4 (W 7 O 26 (OH))(PW 9 O 34 ) 3 25-, 39 Ni 12 (OH) 9 (CO 3 ) 3 (PO 4 ) (SiW 9 O 34 ) 3 24-, 25 and (BO 3 ) 3 PO 4 Ni 12 O 9 (SiW 9 O 34 ) 3 36-. 40The Ni 12 cluster in 1 was stabilized by four PO 4 tetrahedra besides the POM units, while the nickel clusters in reported examples were decorated by WO 4 tetrahedra or CO 3 /BO 3 triangles mixed PO 4 with tetrahedra.3.2 Crystal structure of H 26.5 K 2.5 Na(H 2 O) 16 Ni 6 (OH) Crystal data and structure refinements for compounds 1-2 Na 19 Ni 12 O 199 P 6 Si 3 W 31 H 160.5 B 4 C 16 N 12 O 202 K 2.5 NaNi 12 W 40 Published on 06 January 2021.Downloaded by RUTGERS STATE UNIVERSITY on 5/15/2021 5:23:53 PM. This journal is the Partner Organisations 2021 Inorg.Chem.Front., 2021, 8, 1303-1311 1305 This work is financially supported by the National Natural Science Foundation of China (No. 21671040, 21773029 and 21831001), and the Natural Science Foundation of Fujian Provice (No. 2020J01438). The authors declare no conflicts of interest."
  }
]