[
  {
    "title": "Doi",
    "content": "10.1021/acsami.1c09119"
  },
  {
    "title": "Article_Title",
    "content": "Surface Basicity of Metal@TiO<sub>2</sub> to Enhance Photocatalytic Efficiency for CO<sub>2</sub> Reduction"
  },
  {
    "title": "Abstract",
    "content": "Photocatalytic reduction of CO 2 to valuable chemical fuels is of broad interest, given its potential to activate stable greenhouse CO 2 using renewable energy input.We report how to choose the right metal cocatalysts in combination with the surface basicity of TiO 2 to enhance their photocatalytic efficiency for CO 2 photoreduction.Uniform ligand-free metal nanoparticles (NPs) of Ag, Cu, Au, Pd, and Pt, supported on TiO 2 , are active for CO 2 photoreduction using water as an electron donor.The group XI metals show a high selectivity to CO and Ag/TiO 2 is most active to produce CO at a rate of 5.2 mol g -1 h -1 .The group X metals, e.g., Pd and Pt, mainly generate hydrocarbons including methane and ethane, and Pd/TiO 2 is slightly more active in methane production at a rate of 2.4 mol g -1 h -1 .The activity of these photocatalysts can be enhanced by varying the surface basicity of TiO 2 with primary amines.However, proton reduction selectivity is greatly enhanced in the presence of amine except amine-modified Ag/TiO 2 , which shows an activity enhancement by 2.4 times solely for CO 2 photoreduction as compared to that without amines without switching its selectivity to proton reduction.Using in situ infrared spectroscopy and CO stripping voltammetry, we demonstrate that the improvement of electron density and the low proton affinity of metal cocatalysts are of key importance in CO 2 photoreduction.As a systematic study, our results provide a guideline on the right choice of metals in combination of the surface functionality to tune the photocatalytic efficiency of supported metal NPs on TiO 2 for selective CO 2 photoreduction."
  },
  {
    "title": "Experimental",
    "content": "2.1.Chemicals and Materials.Gold(III) chloride (HAuCl 4 ), sodium tetrachloropalladate (Na 2 PdCl 4 ), potassium hexachloroplatinate (K 2 PtCl 6 ), copper nitrate trihydrate (Cu(NO 3 ) 2 3H 2 O), (3aminopropyl)triethoxysilane (APTES), sulfuric acid (H 2 SO 4 ), sodium hydroxide (NaOH), and ethanol were purchased from Sigma-Aldrich.Silver nitrate (AgNO 3 ), sodium borohydride (NaBH 4 ), and succinic anhydride were purchased from Alfa Aesar.Aeroxide TiO 2 P25 was a gift from Evonik Industries.All chemicals were used without further purification.Deionized water (high-Q, Inc. 103S Stills) with a resistivity of 10.0 M was used in all experiments. 2.2.Synthesis of Metal/TiO 2 Catalysts.Metal NPs supported on TiO 2 were synthesized through the deposition-precipitation method as reported previously with some modifications. 36In a typical synthesis, various metal salts were physically adsorbed on TiO 2 at pH 11.5 under which the surface hydroxyl groups are mostly deprotonated.Taking AgTiO 2 as an example, 3.9 mg of AgNO 3 (2.5 wt of Ag relative to TiO 2 ) was mixed with 100 mg of TiO 2 powder in 15 mL of water.The solution pH was tuned to 11.5 using ammonia (28 in water).The mixture was sonicated for 10 min and further stirred for 1 h at room temperature.The solution was then heated to 85 C to evaporate water.The as-resultant powders were redispersed into 10 mL of water, followed by adding 5 mL of freshly prepared ice-cold NaBH 4 solution (2 mg mL -1 ).After stirring for another 1 h at room temperature, the sample was washed with water once and ethanol twice by centrifugation. 2.3.Amine and Acid Modification of M/TiO 2 -N and M/TiO 2 -COOH.Amine-modified TiO 2 (TiO 2 -N) was prepared by surface hydrolysis of APTES on TiO 2 . 37Briefly, 1 g of TiO 2 was first dispersed into 120 mL of ethanol by sonication.Then, 1.5 mL of APTES was added into the solution under stirring.After 10 min, 0.8 mL of ammonia (28 in water) as a catalyst for the hydrolysis of APTES was added into the mixture.The solution was heated to 50 C and stirred for 8 h under air.The as-prepared sample was collected via centrifugation and washed with ethanol before drying in a vacuum oven. The surface amines of TiO 2 -N were further capped with carboxylic acids (-COOH) to study the role of amines in CO 2 photoreduction.Succinic anhydride was used to cap the surface amines through esterification to prepare TiO 2 -COOH. 38Briefly, 1 g of TiO 2 -N was dispersed into 100 mL of anhydrous THF under sonication.Then, 2 g of succinic anhydride was added into the solution under ice bath.The reaction was carried out at 0 C for 2 h and then kept stirring overnight at room temperature.The final product was washed with ethanol twice before drying under vacuum. The growth of metals TiO 2 -N and TiO 2 -COOH was similar to that of MTiO 2 , while using TiO 2 -N and TiO 2 -COOH to replace TiO 2 . 2.4.Characterization.Transmission electron microscopy (TEM) and high-angle annular dark-field TEM (HAADF-STEM) were carried out on a Talos F200X Atomic Resolution Analytical Microscope.X-ray diffraction (XRD) was recorded on a Bruker D2 phaser.Fourier transform infrared spectroscopy (FT-IR) was conducted using a Bruker Platinum Attenuated total reflection (ATR).Diffuse reflectance infrared Fourier transform spectroscopy (DRIFTS) was examined on a Thermo Nicolet 6700 FT-IR spectrometer.The sample was annealed at 150 C for 1 h under argon before any test.For CO 2 adsorption, CO 2 balanced with argon was purged for 30 min prior to measurements.For CO adsorption, annealed samples were purged with CO and then argon at room temperature prior to spectrum collection.X-ray photoelectron spectroscopy (XPS) results were collected on a Quantum 2000 Scanning ESCA Microprobe spectrometer with Al K radiation.The UV-vis spectra were measured on a Shimadzu UV 2450 equipped with a single monochromatic system.The sample was mixed with barium sulfate to form a uniform pellet.Fluorescence spectroscopy was recorded on a Cary Eclipse fluorescence spectrophotometer.The emission spectrum was collected in the range of 300-425 nm under excitation at 200 nm.The scan rate was 600 nm min -1 .In the CO stripping voltammetry, a fixed potential of -0.8 V (vs saturated calomel electrode) was applied to the working electrolyte in 0.1 M NaOH under CO bubbling for 20 min to form the saturated CO adsorption layer.Then, the electrode was transferred to another 0.1 M NaOH electrolyte saturated with N 2 .The CO stripping voltammetry was collected at a scan rate of 20 mV s -1 . 2.5.Photocatalysis.For photochemical CO 2 reduction, 10 mg of catalyst was dispersed into 10 mL of 0.1 M NaHCO 3 in a quartz cell.The mixture solution was degassed and bubbled with CO 2 for 20 min before photoreduction.Then, the cell was irradiated with a 100 W mercury lamp with a filter of 320-390 nm (OmniCure S1500 Spot UV Curing System).The gas products were analyzed on a Shimadzu gas chromatograph (GC-2014) equipped with a packed column (60/ 80 Carboxen 1000) and a thermal conductive detector (TCD) for H 2 and CO detection.The hydrocarbon products were measured on a HP 6890 GC equipped with a Carboxen 1010 PLOT column and a flame ionization detector (FID).The liquid phase products were analyzed on a Bruker Avance 400 MHz spectrometer after 5 h of reaction."
  },
  {
    "title": "Results_and_Discussion",
    "content": "3.1.Synthesis and Characterization of Catalysts.Metal NPs supported on TiO 2 (commercial P25) were prepared via the deposition-precipitation method.The physical adsorption of various metal precursors on TiO 2 was achieved by varying the surface charge of TiO 2 .When the pH was above the point of zero charge (pH 6) of TiO 2 , the deprotonation of surface hydroxyl groups would lead to the formation of negatively charged species like Ti-O -.At pH 11.5, TiO 2 adsorbed a variety of metal cations through electrostatic interaction as reported previously. 39Such interaction allows the reasonable dispersity of metal cations on TiO 2 , and, therefore, small metal NPs upon reduction.Using sodium borohydride, 36 group X and XI metal NPs, such as Au, Ag, Cu, Pd, and Pt, could be prepared on TiO 2 in the absence of any surfactant.The average sizes of metal NPs are in the range of 1-4 nm supported on spherical TiO 2 NPs (25 nm in diameter) as confirmed by dark-field scanning transmission electron microscopy (STEM) (Figure 1 and bright-field TEM images in Figure S1). The XRD pattern shows the mixed rutile (20) and anatase (80) phases of P25 TiO 2 (Figure 2a). 14No obvious XRD peaks from supported metal NPs can be seen regardless of the type of metal.This is presumably due to the small size of NPs that usually do not have sharp diffraction peaks. 40We used a similar method to grow metal NPs on silica (nanopower,10 nm, 99.5, Sigma-Aldrich) where very broad XRD peaks from metal NPs were observed, indicating the formation of ultrasmall NPs on those oxide supports (Figure S2).The loading amount of all metals estimated from SEM elementary mapping was measured to be 2 wt , close to the feeding ratio of metals (Table S1).The diffuse reflectance UV-vis spectra of all metalTiO 2 are given in Figure 2b.The strong absorption peak in the UV range below 400 nm is from the band gap excitation of TiO 2 (Figure 2b).The weak and broad localized surface plasmon resonance (LSPR) peaks can be seen in the case of Au/TiO 2 (500-600 nm) and Ag/TiO 2 (400-500 nm) due to the existence of NPs with 2 nm. Surface modification of TiO 2 was carried out to vary the surface basicity since the surface basicity plays an important role in tuning the catalytic performance of CO 2 reduction.We carried out surface modification of TiO 2 first using APTES to generate basic sites (TiO 2 -N) prior to the growth of metal NPs to minimize the direct change on the surface of metal NPs.The triethoxysilane moiety of APTES can hydrolyze on the surface of TiO 2 , while retaining its primary amine to provide basic sites.Fourier transform infrared spectroscopy (FT-IR) was used to confirm the surface functional groups of TiO 2 -N (Figure 3).The peak at 2927 cm -1 was assigned to the C-H stretching of -CH 2species of APTES. 33A broad peak at around 1582 cm -1 , assigned to the bending vibration of -NH 2 species, 38 was also observed for TiO 2 -N. As a comparison, the surface amine groups were quenched with succinic anhydride.The capped amine groups existed as amides, while the other acid group of succinic anhydrides remained as carboxylic acids (TiO 2 -COOH).After capping, new peaks appeared at 1727 and 1422 cm -1 corresponding to the stretching vibration band of free CO and C-O-H. 38he two peaks at 1635 and 1551 cm -1 are assigned to amide I and II bands, known as the CO stretching and N-H bending of amides, respectively. 38FT-IR spectroscopy confirms the successful surface modification of TiO 2 with basic and acidic sites.The successful surface modification of TiO 2 was further confirmed by XPS as shown in Figure 3c.In the presence of primary amines, Ag/TiO 2 -N shows the characteristic peak at 399.3 eV for -NH 2 and 401.4 eV for -NH 3 . 41After converting primary amines to amides with succinic anhydride, the N 1s peak shifted to 400.3 eV. 42Using this modified TiO 2 as substrate, metal NPs can be synthesized through similar synthetic approaches.For example, with TiO 2 -N as the support, uniform metal NPs of Au, Ag, Cu, Pd, and Pt were grown on the surface of TiO 2 -N with average diameters of 1-3 nm (Figure S3). 3.2.CO 2 Photoreduction Using Different Metal Cocatalysts on TiO 2 .Photoreduction was carried out in a CO 2 -saturated NaHCO 3 solution (0.1 M) with a light irradiation provided by a mercury lamp with a broad-band filter of 320-390 nm.To better compare the results, 10 mg of catalyst was used in each experiment.As shown in Figure 4a, Ag/TiO 2 , Cu/TiO 2 , and pure TiO 2 showed the CO 2 reduction toward CO, without detectable H 2 or other liquid products.As for the first 1 h, Ag/TiO 2 exhibited the highest CO production of 5.1 0.4 mol g -1 h -1 , which is 4 and 1.8 times higher than that of pristine TiO 2 (1.2 0.2 mol g -1 h -1 ) and Cu/TiO 2 (2.8 0.1 mol g -1 h -1 ), respectively.Au/TiO 2 showed a CO production rate of 2.6 0.1 mol g -1 ; however, a large amount of H 2 of 21.6 2.6 mol g -1 h -1 was seen (Figure S4).This suggests that Au as a cocatalyst is less selective for CO 2 reduction.On the other hand, the group X metals, like Pd/ TiO 2 and Pt/TiO 2 catalysts, generate hydrocarbons, e.g., CH 4 and C 2 H 6 .No CO was detected when using Pd/TiO 2 and Pt/ TiO 2 (Figure 4c,d).The production rate of CH 4 using Pd/ TiO 2 and Pt/TiO 2 was comparable in the range of 2.1-2.4 mol g -1 h -1 .This in part is due to strong adsorption of CO intermediates on group X metals where the deep reduction of CO 2 occurs as compared to the group XI metals.Interestingly, we note that Pt/TiO 2 is not selective to reduce CO 2 .The S1). formation rate of H 2 reached 19.7 mol g -1 h -1 , roughly nine times faster than that of CH 4 , as a result of the high affinity of protons to Pt. The kinetic curves of CO and CH 4 are displayed in Figure 4b,d, respectively.The group XI metals are reasonably stable in terms of the formation rate of CO.Ag/TiO 2 exhibited an average CO production rate of 4.3 mol g -1 h -1 in 5 h, slightly lower than the initial rate.The difference in the catalytic activity to produce CO between Cu/TiO 2 and Au/TiO 2 is minimum where the kinetic curves almost overlapped (Figure 4b).Pd/TiO 2 and Pt/TiO 2 were less stable as compared to group XI metals (Figures 4d andS5).There is a fast decay in the formation of CH 4 and C 2 H 6 , while the formation of H 2 over Pt/TiO 2 shows a linear increase along with the reaction time.This presumably is due to the surface coverage of group X metals by the CO intermediates, which blocks the active sites for further CO 2 reduction and only promotes the reduction of protons to form H 2 . 3.3.Surface Basicity to Improve CO 2 Photoreduction.The surface basic sites have proven to enhance the CO 2 reduction performance thermochemically, 41 electrochemically, 31 and photochemically. 43Surface basic sties show strong bonding to electrophilic CO 2 by forming carbamate species. 32,33We investigated the impact of the surface basicity of M/TiO 2 catalysts in photochemical CO 2 reduction in terms of their activity and selectivity (competing with protons and among different CO 2 reduction products). 31,44The surface modification of TiO 2 was carried out prior to the growth of metal NPs to avoid the surface blocking by those molecular species.As a control, we also examined the activity of pristine TiO 2 and TiO 2 -N.The photoreduction results are summarized in Figure 5. First of all, for TiO 2 without metal cocatalysts, there is a clear activity enhancement over CO 2 photoreduction.As for the first 1 h, TiO 2 -N showed a CO production rate of 2.5 0.4 mol g -1 h -1 , approximately two times higher than that of TiO 2 .This enhancement completely resulted from the surface basic sites.For metals supported on TiO 2 -N, a similar trend was observed.Ag/TiO 2 -N produced CO with a rate of 12.3 1.0 mol g -1 h -1 , 2.4-fold faster than that of Ag/TiO 2 .Cu/TiO 2 -N produced CO with a rate of 4.5 0.2 mol g -1 h -1 , about 1.6 times more active than Cu/TiO 2 .Interestingly, we noted that the activity enhancement was not solely for CO 2 photoreduction.In case of Cu/TiO 2 -N, the H 2 production reached 53.5 mol g -1 h -1 that was 11.9 times higher than the production rate of CO (Figure 5b).Since the proton reduction to H 2 and the reduction of CO 2 to CO both involve 2e - transfer, the selectivity of protons is 11.9 times more than CO 2 .Similar results were observed for Au/TiO 2 -N where H 2 was the main reduction product, roughly seven times more than CO (Figure S6).Ag/TiO 2 -N is the only photocatalyst that shows basicity-enhanced activity for CO 2 photoreduction, while being not selective to proton reduction.The kinetic curves of TiO 2 -N, Ag/TiO 2 -N, and Cu/TiO 2 -N are summarized in Figure 5ce.The drop in their activity is likely due to the formation of larger metal NPs during the reaction, as confirmed in Ag/ TiO 2 -N (see Figure S7). To further investigate whether the catalytic enhancement of metal/TiO 2 is a result of the surface basicity, we capped the surface amines using succinic anhydride (see Section 2 for details).Succinic anhydride converted primary amines to amides, while retaining one -COOH group on the surface of TiO 2 .Interestingly, the catalytic performance showed a quick drop very close to its original performance without any surface modification.For example, for TiO 2 -COOH, the formation rate of CO is 1.4 0.1 mol g -1 h -1 , similar to that of TiO 2 .Ag/TiO 2 -COOH has a CO formation rate of 6.6 0.5 mol g -1 h -1 , close to that of Ag/TiO 2 , 5.1 0.4 mol g -1 h -1 .The capping of amines also significantly reduced the selectivity of proton reduction.The H 2 generation was also depressed dramatically in Cu/TiO 2 -COOH (Figure 5f).The H 2 production of Cu/TiO 2 -N was 198.3 mol g -1 over 5 h and it decreased to 86.3 mol g -1 for Cu/TiO 2 -COOH.As such, the surface amines on TiO 2 indeed are responsible for the activity enhancement and selectivity control of metal/TiO 2 for photocatalytic CO 2 reduction. Interestingly, both Pd/TiO 2 -N and Pt/TiO 2 -N showed dramatically enhanced production of C 2 H 6 (Figure 6).The production of CH 4 over Pd/TiO 2 -N was slightly suppressed, while the production of CH 4 and C 2 H 4 over Pt/TiO 2 -N was not affected by the amine sites.Pd/TiO 2 -N and Pt/TiO 2 -N S1).generated 9.2 and 8.3 mol g -1 h -1 of C 2 H 6 , respectively.These are close to 40 times higher than Pd/TiO 2 (0.21 mol g -1 h -1 ) and Pt/TiO 2 (0.23 mol g -1 h -1 ).However, H 2 production was significantly enhanced for Pd/TiO 2 -N, which is comparable with that of Pt/TiO 2 -N.These results clearly show that the surface basicity can alter the catalytic performance of metal NP catalysts supported on TiO 2 for CO 2 photoreduction, while it would vary the catalytic selectivity simultaneously. 3.4.Mechanism of CO 2 Photoreduction.The microenvironment of metal/TiO 2 is of critical importance to vary its catalytic activity and selectivity.For CO 2 photoreduction catalyzed by metal/TiO 2 , the band gap excitation of TiO 2 accounts for the generation of excited electrons and holes.The first question we address is whether water is the electron donor to replenish the holes, while CO 2 gets reduced on either metal cocatalyst or TiO 2 .We used the kinetic isotope effect (KIE) to examine the photooxidation half-reaction.Water as a sacrificial electron donor would be oxidized to form oxygen, known as 2H 2 O -4e - O 2 4H .Water also acts as a proton source to carry out proton-assisted CO 2 reduction.If water is replaced with deuterium oxide (D 2 O), the overall rate of CO 2 photoreduction will be varied. 45Given that deuterium is heavier than the proton, a slower reduction rate would be expected in D 2 O. Using Ag/TiO 2 as an example, the CO production rate decreased to 3.2 0.2 mol g -1 h -1 in D 2 O, as compared to 5.1 0.4 mol g -1 h -1 in water (Figure 7).The KIE is 1.6, indicating the presence of O-H bond breakage in photoreduction.The large KIE factor indicates that water participates in CO 2 photoreduction likely to provide electrons and protons to reduce CO 2 . We further examined the electronic states of the metal and TiO 2 surfaces, i.e., whether the surface basicity changed the metal-support interaction. 46High-resolution Ag 3d and Ti 2p spectra of Ag/TiO 2 , Ag/TiO 2 -N, and Ag/TiO 2 -COOH are given in Figure S8.No significant difference in the binding energy of Ti 2p and Ag 3d among the three samples was observed, suggesting that the bulking electronic structures of Ag and Ti are not varied in the course of surface modification.Therefore, the change in the surface basicity does not vary the metal-support interaction. With amine modification on TiO 2 , the surface basic sites favor the adsorption of electrophilic CO 2 on oxides and possibly on metal catalysts as well. 31We first used DRIFTS to characterize CO 2 adsorption.Figure 8a shows the DRIFTS results of CO 2 adsorption on pristine TiO 2 and TiO 2 -N.Without primary amines, TiO 2 after purging with CO 2 has a strong peak at 1645 cm -1 assigned to the surface bicarbonate species. 47Two peaks appearing at 1594 and 1329 cm -1 are assigned to bidentate carbonate species on TiO 2 . 48The peaks at around 1516 and 1410 cm -1 are attributed to the monodentate carbonate species. 48,49With surface amines, TiO 2 -N also displayed similar carbonate species, which were located at 1515, 1396, and 1330 cm -1 .However, a new peak at around 1679 cm -1 is seen, likely arising from the carbonyl groups from surface-bound carbamate species in the form of -NH 2 COOH or -NH 3 COO -. 41 The new peak at 1623 cm -1 is presumably from the bending vibration of NH 3 species. 41The CO 2 adsorption confirms the different adsorption modes of CO 2 on TiO 2 in the presence of amines. Although the absolute adsorption cannot be quantified, more binding models of CO 2 are indicative of a stronger affinity and stabilization of CO 2 that is beneficial for better performance.We further used DRIFTS to monitor the in situ CO 2 photoreduction with trace amount of moisture (Figure S9).Using Ag/TiO 2 as an example, the peak at 1566 cm -1 raised dramatically under light irradiation, which refers to monodentate carbonate species. 50Another peak appeared at 1688 cm -1 , which was assigned to surface bicarbonate species. 47On the contrary, Ag/TiO 2 -N exhibited a peak at 1695 cm -1 , which was assigned to surface-bound carbamate species. 41These different surface species formed during the reactions are key to affect the activity and selectivity.The carbamate species in metal/TiO 2 -N seems to be favorable for the CO 2 activation and reduction, as seen in the case of Ag/TiO 2 -N, Cu/TiO 2 -N, and Pd/TiO 2 -N.For Cu/TiO 2 -N and Pd/TiO 2 -N, both samples with a high selectivity to proton reduction showed a new peak around 1700 cm -1 for carbonyl groups.Although the assignment of this new peak is unclear, it is possibly the deprotonated form of surface-bound carbamate species.The protons that are also strongly electrophilic can be reduced to form H 2 that competes with CO 2 .The formation of these deprotonated carbamate species indicates the reduction of localized protons that varies the overall selectivity. The surface basicity of TiO 2 can vary the electron density of the supported NPs to vary the affinity of CO 2 to metal NPs.Using CO as a probe molecule, we examined the change of CO vibrational frequency to identify the surface charge density of metal NPs using DRIFTS (Figure 8b).For Ag/TiO 2 , there are three new peaks as a result of the CO adsorption on Ag.The peak at 2029 cm -1 is assigned to the linear bound (atop sites) CO on Ag(0) and the other two broad peaks at 1953 and 1904 cm -1 are from the bridge bound CO.When TiO 2 -N was used as the support, a clear shift from 2029 to 2017 cm -1 can be seen for the linear bound CO mode. 51,52Similar results on the DRIFTS spectra of adsorbed CO were observed on Pt and Cu NPs (Figure S10).These results indicate that the metallic NPs become more negatively charged in the presence of surface amines; as such, the binding of electrophilic CO 2 is presumable favorable on metal NPs.In addition, we cross-compared the electronic states of metal NPs using CO stripping voltammetry (Figure 8c-d).The adsorption of CO monolayer, e.g., on Pd, showed different oxidative potentials when modifying the surface of TiO 2 with amines.Pd/TiO 2 has an oxidation peak at -0.18 V (vs saturated calomel electrode) at pH 13, while the oxidation peak shifts to -0.09 V for Pd/TiO 2 -N.The positive shift of CO oxidative potentials confirms that the amine functionalization of TiO 2 increases the surface charge density of supported metal NPs. 53here are three essential steps in CO 2 photoreduction, including light absorption, charge separation, and the surface catalytic process. 54In view of our catalysts, we minimize the differences in the band gap of semiconductors and the interfacing of surface ligands on metal NPs.Therefore, the differences in catalytic performance are attributed to the charge separation and catalytic process caused by different supported NPs.Using metal NPs as a cocatalyst allows the efficient charge separation of the band gap excitation of TiO 2 .The increase of CO 2 reduction products, i.e., CO from group X metals and hydrocarbon from group XI metals, is mainly attributed to the increase of charge separation, regardless of the surface basicity.Among different metals, Ag is the most active cocatalyst where Ag/TiO 2 is four times more active than TiO 2 and Ag/TiO 2 -N is five times more active than TiO 2 -N.The surface basicity provided by primary amines shows enhanced affinity to CO 2 .The activity of CO 2 photoreduction to CO using group X metals supported on TiO 2 shows 2-fold increase as compared to those without surface amines.However, other than Ag, the activity enhancement toward proton reduction is much more pronounced in comparison to CO 2 photoreduction.The hydrogen adsorption energy on metals may play a role in the switch of the selectivity.Ag shows the lowest hydrogen adsorption energy among group X and XI metals; 55 therefore, the binding of protons to Ag very unlikely occurs when competing with CO 2 .The surface-bound carbamate species are likely responsible to improve the activity of CO 2 photoreduction, given the increase of localized concentration of CO 2 , while the deprotonation of those carbamate species likely varies the selectivity of photocatalysts, i.e., increasing proton reduction."
  },
  {
    "title": "Conclusions",
    "content": "To summarize, we report a systematic study on how the metal cocatalysts and surface basicity improve the photocatalytic efficiency of supported metal cocatalysts on TiO 2 for CO 2 reduction using water as an electron donor.Our key finding is that, although the surface basic sites in the form of amines enhance the activity of metalTiO 2 photocatalysts, there is a large decrease in the selectivity toward CO 2 reduction over proton reduction for most of the metal cocatalysts other than Ag-supported TiO 2 .Using the deposition-precipitation method, ligand-free and ultrasmall metal NPs were grown on commercial TiO 2 powders with different surface functionalities.All metal NPs supported on TiO 2 showed an improved activity for CO 2 photoreduction, while group XI metals varied the reduction products from CO to hydrocarbons.Ag/TiO 2 is the most active photocatalyst to produce CO at a rate of 5.2 mol g -1 h -1 , four times more active than pristine TiO 2 .The group X metals, e.g., Pd and Pt, mainly generated hydrocarbons including methane and ethane and Pd/TiO 2 is slightly more active in methane production at a rate of 2.4 mol g -1 h -1 .Surface modification with primary amines on TiO 2 showed the activity enhancement regardless of metal cocatalysts.Ag/TiO 2 -N was 2.4-fold more active to produce CO as compared to Ag/TiO 2 .With surface basic sites, other metals supported on TiO 2 showed different selectivity in comparison with their counterpart without surface modification.The high selectivity toward proton reduction was seen in the cases of Au, Cu, Pd, and Pt.We used DRIFTS and CO stripping voltammetry to confirm the enhanced adsorption of CO 2 and the increase of surface charge density of metal NPs due to the surface basicity on TiO 2 .The surface-bound carbamate species on basic sites likely improves the activity.As a systematic comparison, our study provides a general guideline on the choice of metals in combination with the surface functionality to tune the photocatalytic efficiency for CO 2 photoreduction. The Supporting Information is available free of charge at https://pubs.acs.org/doi/10.1021/acsami.1c09119. Figure 1.Dark-field TEM images and size distribution of (a-c) Ag/TiO 2 , (d-f) Cu/TiO 2 , (g-i) Au/TiO 2 , (j-l) Pd/TiO 2 , and (m-o) Pt/TiO 2 . Figure 2. (a) XRD patterns and (b) UV-vis spectra of M/TiO 2 catalysts.The standard patterns are rutile (black, JCPDS 00-001-1292) and anatase (red, JCPDS 00-064-0863) TiO 2 at the bottom of (a). Figure 3. FT-IR spectra of TiO 2 , TiO 2 -N, and TiO 2 -COOH in the ranges of (a) 2200-3800 cm -1 and (b) 1900-1100 cm -1 .The characteristic feature peaks proved the successful surface modification with basic and acidic sites, respectively.(c) XPS results on the N 1s peaks of Ag/TiO 2 -N and Ag/TiO 2 -COOH to confirm the grafting of succinic anhydrides. Figure 4. CO 2 reduction performance of TiO 2 , Ag/TiO 2 , Cu/TiO 2 , Au/TiO 2 , Pd/TiO 2 , and Pt/TiO 2 under UV light (320-390 nm).(a) Average production rate in 1 h.(b) Kinetic curves of CO production of TiO 2 , Ag/TiO 2 , Cu/TiO 2 , and Au/TiO 2 in 5 h.(c) Average production rate in 1 h.(d) Kinetic curves of CH 4 production of Pd/ TiO 2 and Pt/TiO 2 in 5 h.The standard deviations are calculated from three independent measurements.Catalytic conditions: 10 mg of catalyst in 10 mL of NaHCO 3 (0.1 M).The loading amount of metals on TiO 2 was 2 wt (TableS1). Figure 5. Catalytic performance of TiO 2 , Ag/TiO 2 , and Cu/TiO 2 with basic and acidic sites in the photocatalytic reduction of CO 2 under UV light (320-390 nm) irradiation.(a) Average production rate of CO in 1 h.(b) Average production rate of H 2 in 1 h.(c-e) Kinetic curves of CO production in 5 h.(f) Kinetic curves of H 2 production in 5 h.H 2 was only detected using Cu/TiO 2 with surface modification.Test conditions: 10 mg of catalyst in 10 mL of NaHCO 3 (0.1 M).The loading amount of each metal was 2 wt (TableS1). Figure 6.Photocatalytic performance of Pd/TiO 2 -N and Pt/TiO 2 -N in CO 2 reduction under UV light irradiation.(a) Average production rate of each product in 1 h.(b) Kinetic curves of CH 4 production in 5 h. Figure 7. CO production rates of Ag/TiO 2 using D 2 O and H 2 O as sacrificial electron donors. Figure 8.(a) DRIFTS results of CO 2 adsorption on TiO 2 and TiO 2 -N.(b) DRIFTS results of CO adsorption on Ag/TiO 2 and Ag/TiO 2 -N.(c,d) CO stripping voltammetry of (c) Pd/TiO 2 and (d) Pd/TiO 2 -N measured in 0.1 M NaOH. https://doi.org/10.1021/acsami.1c09119ACS Appl.Mater.Interfaces 2021, 13, 38595-38603 Downloaded via TSINGHUA UNIV on September 1, 2021 at 02:32:22 (UTC).See https://pubs.acs.org/sharingguidelines for options on how to legitimately share published articles. https://doi.org/10.1021/acsami.1c09119ACS Appl.Mater.Interfaces 2021, 13, 38595-38603 https://doi.org/10.1021/acsami.1c09119 J.H. is grateful for the support from the U.S. National Science Foundation under grants 1705566 and 1936228.G.L. acknowledges the support from the U.S. National Science Foundation under grant 1705528.SEM/TEM studies were performed using the facilities in the UConn/FEI Center for Advanced Microscopy and Materials Analysis (CAMMA).This work was also partially supported by the Green Emulsions Micelles and Surfactants (GEMS) Center of the University of Connecticut. Additional XRD, TEM, photochemical CO 2 reduction results, and DRIFTS spectra (PDF)"
  }
]