[
  {
    "title": "Doi",
    "content": "10.1016/j.micromeso.2020.110539"
  },
  {
    "title": "Article_Title",
    "content": "One-step in-situ synthesis of porous Fe3+-doped TiO2 octahedra toward visible-light photocatalytic conversion of CO2 into solar fuel"
  },
  {
    "title": "Abstract",
    "content": "Here, hollow Fe 3 doped TiO 2 (Fe-TiO 2 ) octahedra were obtained via one-step hydrothermal method with MIL-101(Fe) as the template as well as the iron ion source.By introducing Ti precursor onto MIL-101(Fe) followed by HF etching and hydrothermal treatment, Fe-doped TiO 2 with high porosity and hollow structure was obtained.The as-synthesized Fe-TiO 2 octahedra consist of numerous small nanoparticles with particle sizes between 10 and 20 nm and possess a high specific surface area of 275 m 2 g -1 together with uniform mesopores of 3.7 nm in pore diameter.After heat treatment in air at 500 C (named Fe-TiO 2 -500), the BET surface area and the mesopore size of the sample were changed to 202 m 2 g -1 and 3.9 nm, respectively.Compared to other Fe-doping methods, this method reported here favors better and more uniform Fe doping into the TiO 2 lattice and improves the porosity and specific surface area.As a result of the Fe doping, the bandgaps of Fe-TiO 2 and Fe-TiO 2 -500 were about 2.75 eV and 2.42 eV, respectively.Fe-TiO 2 -500 shows excellent photocatalytic activity due to its special structure, high BET surface area and porosity.The yield of CH 4 is about 7.73 mol g -1 after loading of Pt within 12 h of reaction time under visible light illumination ( 420 nm)."
  },
  {
    "title": "Experimental",
    "content": "Synthesis of MIL-101(Fe): FeCl 3 6H 2 O (0.5 g) and terephthalic acid (0.15 g) were dissolved in DMF (12 mL).The resulting suspension was dispersed by ultrasound, then moved to a Teflon autoclave liner, and heated at 130 C for 24 h.The products were collected by centrifugation at 10,000 rpm for 2 min, washed with DMF and ethanol three times.Finally, the synthesized MIL-101(Fe) was dried overnight at 60 C. Synthesis of Fe-TiO 2 , Fe-TiO 2 -500 and pure TiO 2 : MIL-101(Fe) (5.0 mg) was dissolved in ethanol (10 mL), followed by adding tetrabutyl titanate (50 L) into the solution.The mixture was dispersed homogeneously by magnetic stirring for 20 min.Subsequently, 700 L of deionized water and 20 L of HF were mixed with constantly stirring for 10 min.Finally, it was transferred into a 25 mL Teflon-lined stainless steel autoclave and heated for 20 h at 180 C. The sample was separated from the solution by centrifugation and washed with deionized water and absolute ethanol repeatedly, then dried under vacuum at 60 C for 24 h.The obtained powder was named as Fe-TiO 2 .In order to remove residual MIL-101 and organic solvents before the CO 2 reduction cycle starts, Fe-TiO 2 was calcined at 500 C in air atmosphere for 6 h, the resultant product was named as Fe-TiO 2 -500.The synthesis of pure TiO nanoparticles is very similar to that of Fe-TiO 2 , except the remove of MIL-101(Fe) (5.0 mg)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Scheme 1 illustrates the typical synthesis process of Fe-TiO 2 and Fe-TiO 2 -500 octahedra.Firstly, MIL-101(Fe) octahedra were prepared by a solvothermal method.Then, MIL-101(Fe) octahedra were treated with HF and tetrabutyl titanate to form Fe-TiO 2 .In order to remove the residual MIL-101(Fe), Fe-TiO 2 was calcined in air at 500 C for 6 h, and got the Fe-TiO 2 -500 sample.The hydrothermal reaction of tetrabutyl titanate and HF aqueous solution without MIL-101 resulted in pure TiO particles (Fig. S1 and Fig. 1).The XRD patterns of Fe-TiO 2 and Fe-TiO 2 -500 are similar, only slightly increasing in intensity.The characteristic peaks associated with iron-related phase were not observed.A specific comparison of the (101) diffraction peak in the range of 24 -27 shifted slightly toward a higher 2 value after calcination (Fig. 1b), indicating that more Ti 4 ions of Fe-TiO 2 have been replaced by Fe 3 .Fig. 1c displays the Raman spectra of these samples.The Raman spectrum of TiO 2, Fe-TiO 2 and Fe-TiO 2 -500 are very similar, there are four peaks at 144.8, 396.3, 513.2 and 636.7 cm -1 in low frequency region, which are characteristic of anatase phase TiO 2 .The characteristic peaks corresponding to MIL-101 (Fe) precursor or carbon were not observed in Fe-TiO 2 and Fe-TiO 2 -500 samples, thus confirming that there was no carbon or MIL-101(Fe) in the Scheme 1. Schematic illustration of the synthesis process of Fe-TiO 2 and Fe-TiO 2 -500 octahedra. M. Xu et al. Fig. 2 shows the morphology of prepared MIL-101 and Fe-TiO 2 samples.The as-obtained MIL-101 precursor shows well-defined octahedral morphology with smooth surface and an average particle size of 300-500 nm (Fig. 2a and Fig. S2).SEM image of Fe-TiO 2 sample (Fig. 2b) reveals that the octahedral shape of the MIL-101 precursor is well retained, and octahedra particle size increase to 1-2 m.The surface of Fe-TiO 2 becomes rougher (Fig. 2c), which can provide more active sites for the subsequent photocatalytic reaction and enhance its photocatalytic property.A high magnification SEM image of a single Fe-TiO 2 octahedron (the inset of Fig. 2c) reveals that each octahedron was composed of nanoparticles, which provides TiO 2 photocatalyst with a large specific surface area.After annealing at 500 C in air, there was no apparent change in the morphology and the size of octahedra (Fig. 2d), indicating the high stability of Fe-TiO 2 . Further microstructure and morphology analysis of the as-prepared Fe-TiO 2 was performed using transmission electron microscopy (TEM), as shown in Fig. 3. Fe-TiO 2 sample appears as rhombic or cubic in shape by TEM observation of octahedral structure (Fig. 3a andb).A closer examination of the Fe-TiO 2 octahedra shows obvious contrast between the dark edges and the bright center, which demonstrates the hollow texture of Fe-TiO 2 octahedra.The inset of Fig. 3b shows the corresponding selected-area electron diffraction (SAED) pattern of a Fe-TiO 2 octahedron, which indicates the polycrystalline nature of octahedra.Each Fe-TiO 2 octahedron is composed of numerous small nanoparticles with a size of 10-20 nm (Fig. 3c).The high-resolution transmission electron microscopy (HRTEM) image clearly shows lattice fringes with an interplanar distance of ca.0.356 nm, corresponding to the (101) planes of anatase TiO 2 , as shown in the inset of Fig. 3c.The elemental mapping by energy-dispersive X-ray spectroscopy (EDS) indicates the uniform distribution of Ti, O and Fe species in the Fe-TiO sample (Fig. 3d-g).The contents of Fe, Ti and O are determined to be 6.8, 32.0 and 61.2 wt, respectively.The atomic ratio of Ti and O elements is found to be 1.9, which is close to the theoretical atomic ratio of TiO 2 .The Fe element comes from MIL-101(Fe) precursor.An interesting observation is that there are no TiO 2 deposition in solution when adding It's obvious that the peak of TiO 2 at 403.12 cm -1 is caused by Ti-O-Ti stretching vibration 37.MIL-101(Fe) has two main peaks at 1387.37 cm -1 and 1603.86 cm -1 which are caused by asymmetric and symmetric vibration of COO -ion in MIL-101(Fe) are consistent with those reported in the literature 38.The FT-IR spectra of Fe-TiO 2 octahedrons is similar to TiO 2 and there is no MIL-101(Fe) peaks, suggesting that MIL-101(Fe) no longer exists.In addition, the peaks at 1638.65 cm - and 3451.80 cm -1 , which should be assigned to the bending and stretching vibrations of the adsorbed water molecules 39.The TG and FT-IR results indicate that there are no MIL-101(Fe) in the prepared Fe-TiO 2 .Vibrations of Fig. 5 shows the N2 adsorption/desorption isotherm and the pore-size distribution (inset) of Fe-TiO 2 and Fe-TiO 2 -500.The two samples exhibit type H3 hysteresis loops according to the Brunauer-Deming-Deming-Teller (BDDT) classification, implying the presence of mesoporous structures.According to the BET method, the specific surface areas of Fe-TiO 2 and Fe-TiO 2 -500 are and 202 m 2 g -1 , respectively, which is much higher than that of prepared pure TiO 2 (43 m 2 g -1 ).Their pore size distribution was calculated using the Barrett-Joyner-Halenda (BJH) method, which is about 3.7 nm for Fe-TiO 2 and 3.9 nm for Fe-TiO 2 -500, respectively.The volatilization of the adsorbed organic solvent and decomposition of residual MIL-101 (Fe) by calcination lead to the increase of pore size.The decrease of BET surface areas of Fe-TiO 2 -500 was attributed to the crystal growth of TiO 2 nanoparticles and the increase of pore size under high temperature treatment. X-ray photoelectron spectroscopy (XPS) analysis demonstrates the presence of Ti, O, and Fe in the synthesized Fe-TiO 2 octahedra (Fig. 6a).Ti 2p peaks appeared at about 458.5 eV and 464.2 eV (Fig. 6b), which is the characteristic signal of the Ti 2p 3/2 and Ti 2p 1/2 for TiO 2 , respectively.The two main peaks for Fe at about 711.3 eV and 725.0 eV are belong to Fe 2p 3/2 and Fe 2p 1/2 of Fe 3 ion (Fig. 6c).Compared to the Fe 2 O 3 (710.7eVfor Fe 2p 3/2 ), a slight shift of the Fe 2p toward higher binding energies was observed in the case of Fe-TiO 2 , which indicates that some Fe 3 replace Ti 4 of the TiO 2 to form Fe-O-Ti bonds 40.In addition, there are two peaks at 719.6 eV and 733.6 eV, which are the satellite structure of Fe 3 41.The O 1s XPS spectra can be deconvoluted into two main peaks (Fig. 6d).The peak centered at 529.8 eV could be attributed to the lattice oxygen for TiO 2 42.Another O 1s peak at 531.4 eV belongs likely to the chemisorbed oxygen (i.e., OH, H 2 O) in the surface groups 43.The atom Fe, Ti and O contents of on the surface of octahedra were calculated to be 7.0, 30.9 and 62.1 wt , respectively, which is very similar to the EDS results.Fig. 7 shows UV-Vis spectral of all samples.The absorption threshold of the MIL-101(Fe) is located at about 600 nm.The Fe-TiO 2 octahedra have a great enhancement in the light absorption at wavelengths of 400-600 nm compared to that of the pure anatase TiO 2 .Heat treatment leads to a red shift of the absorption edge.The optical band gap energy of the pure TiO 2 , MIL-101(Fe), Fe-TiO 2 and Fe-TiO 2 -500 are about 3.3 eV, 2.80 eV, 2.75 eV and 2.42 eV calculated from the intercept of the tangents to the plots (Fig. 7b).When Fe is doped into TiO 2 , the band gap of TiO 2 is decreased.The color of pure TiO 2 is white whereas Fe-TiO 2 is yellow.The smaller band gap indicates the stronger response to visible light, thus Fe-TiO 2 octahedrons with excellent photocatalytic activity are expected. Using photoreduction 44, electrochemical reduction 45 or methanation 46 to convert CO 2 into valuable fuels provides a hopeful method to alleviate global energy crisis and environmental issues.In this paper, the prepared Fe-TiO 2 octahedrons were applied for the photocatalytic reduction of CO 2 with water.The photoreduction experiments were performed in a gas solid system containing water and CO 2 under visible-light ( 420 nm).Fig. 8a displays that the Fe-TiO 2 octahedrons 8c.The strongest peak of both samples appears at g 1.99, which can be attributed to Fe 3 substituted for Ti 4 in the TiO 2 lattice 48.This result confirms that Fe 3 ions are successfully doped into the TiO 2 lattice.The above EPR signal is enhanced obviously after 500 C heat treatment, which is due to more Fe 3 ions were incorporated into TiO 2 lattice after heat treatment.The photoluminescence (PL) spectra are presented in Fig. 8d to provide additional evidence for improving charge carriers transport.Compared to Fe-TiO 2 , a slight decrease in PL intensity can be observed in Fe-TiO 2 -500, suggested the longer lifetime of photo-generated charge carriers compared to Fe-TiO 2 . A schematic illustration of the modification of band structure of TiO due to Fe doping is shown in Fig. 9.The effects of Fe doping on the photocatalytic activity of TiO 2 can be explained as follows: (1)The dopant energy level (Fe 2 /Fe 3 ) is lower than that of the conduction band of TiO 2 , which makes the conduction band moving down and narrows the band gap of TiO 2 .(2) Fe doping also induced an acceptor state by hybridization between the Fe 3d, O 2p and Ti 3d orbitals, which lead to the a variation of valence band and then narrows bandgap.(3) Fe doping will induce an additional defect center in the band gap of TiO 49, which can act as both hole and electron traps to enhance their lifetimes.So Fe-TiO 2 samples can be activated by visible light and generate more photogenerated electrons to reduce CO 2 .Moreover, using Scheme 1 illustrates the typical synthesis process of Fe-TiO 2 and Fe-TiO 2 -500 octahedra.Firstly, MIL-101(Fe) octahedra were prepared by a solvothermal method.Then, MIL-101(Fe) octahedra were treated with HF and tetrabutyl titanate to form Fe-TiO 2 .In order to remove the residual MIL-101(Fe), Fe-TiO 2 was calcined in air at 500 C for 6 h, and got the Fe-TiO 2 -500 sample.The hydrothermal reaction of tetrabutyl titanate and HF aqueous solution without MIL-101 resulted in pure TiO particles (Fig.S1and Fig.1).Fig. 1 displays the XRD patterns of MIL-101(Fe), TiO 2 , Fe-TiO 2 and Fe-TiO 2 -500.It can be found that the diffraction peaks of MIL-101(Fe) precursor is in good agreement with the previously reported results 36.After treated with tetrabutyl titanate and HF aqueous solution at 180 C for 20 h, the characteristic peaks of MIL-101 disappeared and the typical peaks of Fe-TiO 2 at 25.28, 37.92, 48.06, 53.98, 55.1 and 62.74 are corresponded to the (101), (004), (200), (105), (211) and (204) lattice planes of anatase TiO 2 (JCPDS No. 21-1272), which is similar to that of the pure TiO 2 nanoparticled prepared without MIL-101(Fe).Moreover, compared with pure TiO2, the diffraction peaks of Fe-TiO are significantly broadened, suggesting the smaller size of Fe-TiO 2 .The disappear of characteristic peaks of MIL-101 in the XRD pattern of Fe-TiO 2 indicates completely transformation from MIL-101 to Fe-TiO 2 .The XRD patterns of Fe-TiO 2 and Fe-TiO 2 -500 are similar, only slightly increasing in intensity.The characteristic peaks associated with iron-related phase were not observed.A specific comparison of the (101) diffraction peak in the range of 24 -27 shifted slightly toward a higher 2 value after calcination (Fig.1b), indicating that more Ti 4 ions of Fe-TiO 2 have been replaced by Fe 3 .Fig.1cdisplays the Raman spectra of these samples.The Raman spectrum of TiO 2, Fe-TiO 2 and Fe-TiO 2 -500 are very similar, there are four peaks at 144.8, 396.3, 513.2 and 636.7 cm -1 in low frequency region, which are characteristic of anatase phase TiO 2 .The characteristic peaks corresponding to MIL-101 (Fe) precursor or carbon were not observed in Fe-TiO 2 and Fe-TiO 2 -500 samples, thus confirming that there was no carbon or MIL-101(Fe) in the Fig. 1.(a) XRD patterns, (b) comparison of the (101) plane of TiO 2 in the range of 2 24-27 , and (c) Raman spectra of prepared samples. Fig. 2. SEM images of prepared samples: (a) MIL-101, the inset in (a) is TEM image of MIL-101; (b) (c) Fe-TiO 2 , the inset in (c) is SEM image of a single Fe-TiO octahedron; (d) Fe-TiO 2 -500. Fig. 3. (a-c) TEM images (inset of b: SAED pattern; inset of c: HRTEM image), (d-g) EDS elemental mapping images of the prepared Fe-TiO 2 octahedra. Fig. 4. (a) TG curves and (b) FT-IR spectra of prepared samples. Fig. 5. Nitrogen adsorption-desorption isotherms of the prepared samples: (a) Fe-TiO 2 , (b) Fe-TiO 2 -500.Inset: the pore size distribution. Fig. 7. (a) UV-vis absorption spectra of prepared samples.(b) the corresponding plot of Kubelka-Munk function versus photon energy of these samples. Fig. 8. (a) Photocatalytic CH 4 evolution amounts and (b) Comparation of the average product formation rates for prepared samples, (c) EPR and (d) PL spectra of the Fe-TiO 2 octahedrons before and after heat treatment. Fig. 9. Schematic illustration of the band structure and photocatalysis mechanism over Fe-TiO2 sample. This work was financially supported by Natural Science Foundation of Anhui Province (No.2008085ME132), the key Project of Anhui Provincial Department of Education (No. KJ2019A0157), Talent Project of Anhui Province (Z175050020001) and Tianjin Natural Science Foundation (15JCYBJC21200)."
  },
  {
    "title": "Conclusions",
    "content": "In summary, Fe 3 doped TiO 2 (Fe-TiO 2 ) octahedra were successfully prepared by a one-step hydrothermal method, using MIL-101(Fe) both as the template and the iron ion source.The formation of TiO 2 and the etching of MIL-101(Fe) occur simultaneously driven by fluorine ion.The obtained Fe-TiO 2 show uniformly Fe doping with a high specific surface area before and after the heat treatment (Fe-TiO 2 : 274 m 2 g -1 , Fe-TiO 2 -500:202 m 2 g -1 ).At last, the Fe-TiO 2 -500 octahedra show excellent photocatalytic activity, and the yield of CH 4 is about 7.73 mol g -1 after loading of Pt within 12 h of reaction time under visible light illumination.This work provides a convenient way for designing and preparing novel mental doped nanomaterials with high photocatalytic properties. Miao Xu: Writing -original draft, preparation.Heng wu: Investigation.Yawen Tang: Investigation.Guobing Mao: Methodology, Writing -review editing.Gang Wang: Project administration.Li Zhang: Funding acquisition.Qi Liu: Conceptualization, Supervision. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://doi. org/10.1016/j.micromeso.2020.110539."
  }
]