[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2018.06.019"
  },
  {
    "title": "Article_Title",
    "content": "Unveiling the interplay between light-driven CO2 photocatalytic reduction and carbonaceous residues decomposition: A case study of Bi2WO6-TiO2 binanosheets"
  },
  {
    "title": "Abstract",
    "content": "Highlights the interplay between photocatalytic CO2 reduction and carbonaceous residues decomposition (82 characters) the necessity of removing organic residues from photocatalysts for photocatalytic CO2 reduction (85 characters) the importance of carefully analysing the origin of products during photocatalytic CO2 reduction (85 characters) the rational construction of Z-scheme heterostructures with high selectivity for CH4 formation (84 characters"
  },
  {
    "title": "Experimental",
    "content": "Cetyltrimethyl ammonium bromide (CTAB) was supplied by Sigma-Aldrich.Tetrabutyl titanate (Ti(OBu)4, 98), hydrofluoric acid (47), sodium tungstate dihydrate (Na2WO42H2O), bismuth nitrate pentahydrate (Bi(NO3)35H2O), 3-aminopropyl-triethoxysilane (C9H23NO3Si, APTES), ethanol (C2H5OH), were obtained from Sinopharm Chemical Reagent Co., Ltd. (Shanghai, China).All materials were used as received without further purification.Deionized (DI) water used in the synthesis process was obtained from local sources. Anatase TiO2 nanosheets (denoted as TNS) were synthesized according to our previously reported method 42,43.Typically, 5 ml of Ti(OBu)4 and 1 ml of hydrofluoric acid solution were mixed in a dried Teflon autoclave with a capacity of 50 ml, and then kept at 453 K for 24 h.Caution!Hydrofluoric acid is extremely corrosive and toxic, and should be handled with extreme care.After being cooled to room temperature, the white powder was separated by centrifugation and washed with ethanol and DI water for several times.To functionalize the surface of TNS with positive charge, 0.4 g of the as-obtained TNS was first dispersed in 200 ml of ethanol by sonication for 30 min, followed by addition of 2 ml of APTES.Then, the mixture was kept at 333 K for 4 h with stirring.Afterwards, APTES functionalized TNS (A-TNS) were sufficiently rinsed with ethanol to remove the remaining APTES moiety and then dried at 333 K in an electronic oven for further use. Bi2WO6 nanosheets (denoted as BWO) were synthesized by the reported method 44.Typically, 1 mmol Na2WO42H2O, and 2 mmol Bi(NO3)35H2O and 0.05 g CTAB were added in 80 ml deionized water.After 30 min stirring, the mixed solution was poured into a 100 ml Teflon-lined autoclave.Then the autoclave was sealed into a stainless steel tank and treated at 393 K for 24 h.After being cooled to room temperature, the product was collected and washed several times with DI water and dried at 333 K in air for 10 h. Bi2WO6-TiO2 binanosheets (denoted as B-T) were prepared using an electrostatic self-assembly Typically, BWO aqueous suspension (0.5 mg ml -1 ) was added dropwise into A-TNS aqueous solution (1 mg ml -1 ) using a pipette under vigorous magnetic stirring.After being kept stirring at room temperature for 1 h, the B-T photocatalysts were isolated by filtration, washed with DI water and dried in an oven overnight at 333 K.The weight ratio of BWO in the B-T composite was 10.For comparison, the sample of physically mixed A-TNS and BWO was prepared by mixing them with a mortar keeping the weight addition ratio of BWO as 10. Zeta potentials () measurements of the samples were determined by dynamic light scattering analysis (Zeta sizer 3000HSA) at room temperature.The X-ray diffraction (XRD) patterns of the samples were collected on a Bruker D8 Advance X-ray diffractometer with Ni-filtered Cu K radiation at 40 kV and 40 mA in the 2 ranging from 15 to 80 with a scan rate of 0.02 per second.Field-emission scanning electron microscopy (FE-SEM) was used to characterize the morphology of the samples on a FEI Nova NANOSEM 230 spectrophotometer.Transmission electron microscopy (TEM), high-resolution transmission electron microscopy (HRTEM) images and elemental mapping results were obtained by a JEOL model JEM 2010 EX instrument at an acceleration voltage of 200 kV.The optical properties of the samples were analyzed by UV-vis diffuse reflectance spectroscopy (DRS) using a UV-vis spectrophotometer (Cary 500, Varian Co.), in which BaSO4 was employed as the internal reflectance standard.The electrochemical analysis was conducted in a conventional three-electrode cell, which uses a Pt plate as the counter electrode and an Ag/AgCl electrode as the reference electrode.The working electrode was prepared on fluorine doped tin oxide (FTO) glass that was cleaned by sonication in ethanol and dried at 353 K for 2 h.The boundary of FTO glass was protected using Scotch tape.The 5 mg sample was fully dispersed in 0.5 ml of DMF by sonication to get slurry.The slurry was spread onto the pre-treated FTO glass.After air drying, the working electrode was further dried at 393 K for 2 h to improve adhesion.Then, the Scotch tape was unstuck, and the uncoated part of the electrode was isolated with epoxy resin.The exposed area of the working electrode was 0.25 cm 2 .The photocurrent measurement was taken on a BAS Epsilon workstation with bias of 0.5 V under UV-vis light irradiation and the electrolyte was 0. Instrument F900 spectrophotometer with an excitation wavelength of 340 nm.To ensure the comparability of the PL spectra, the experimental parameters, including the excitation wavelength, slit width, and the amount of the samples, were identical. The photocatalytic reduction of CO2 was performed in a gas-solid heterogeneous reaction mode in a quartz reactor (volume, 25 ml).The loading mass of the photocatalyst sample was 20 mg. This system was evacuated by a mechanical pump and filled with pure CO2 gas.The evacuationfilling operation was repeated five times.0.5 ml of evacuated water was introduced finally with a syringe via the septum into the sample cell (5 ml) hanging in the quartz reactor.The reactor was kept in dark for 1 h to establish the adsorption-desorption equilibrium before the irradiation. A 300W Xe arc lamp (PLS-SXE 300C, Beijing Perfect light Co., Ltd.), emitting UV-vis light (320 nm 780 nm) with an energy output of 0.8 W cm -2 measured by a Thorlabs PM100 optical power and energy meter, was placed at a distance of approximate 5 cm from the reactor to be the irradiation source to trigger the photocatalytic reaction.The temperature of the reactor was kept at 298 K with an electronic fan.At certain irradiation time interval during the experiment, 1 ml of reactive gas was taken from the reactor with a syringe for analysis.The amounts of the products were analyzed by gas chromatography (GC 2014C) fitted with a highsensitivity thermal conductivity detector (TCD) detector for quantifying the amounts of H2 formed from H2O photoreduction and a flame ionization detector (FID) detector for quantifying the amounts of CO and CH4 formed from CO2 photoreduction.After the effluents were separated by the PN pre-column and 5A molecular sieve column, H2 and O2 were analyzed by the TCD detector.CH4 was analyzed by the FID detector.CO was further converted to CH4 by a methanation reactor and then analyzed by the FID detector.The detection limits of our analytic method for CH4 and CO were both 0.002 mol.The detection limits for H2 was 0.004 mol. Argon was used as the carrier gas.The contrast activity tests were conducted by replacing CO2 with N2 under other reaction conditions identical."
  },
  {
    "title": "Results_and_discussion",
    "content": "Fig. 1a schematically displays the flowchart for the fabrication of Bi2WO6-TiO2 binanosheets (B-T).Firstly, the hydrothermally prepared TiO2 nanosheets (TNS) were functionalized by 3-aminopropyl-triethoxysilane (APTES) to be positively charged (A-TNS); while Bi2WO6 nanosheets (BWO) were born to be negatively charged due to the introduction of Br -ions to BWO layer surfaces during the hydrothermal process (Fig. 1b) 44.The electrostatic interaction force between A-TNS (39 mV of Zeta potential) and BWO (-20 mV of Zeta potential) then allows the fabrication of B-T composite through an electrostatic self-assembly approach.Field-emission scanning electron microscopy (SEM) and transmission electron microscopy (TEM) were employed to examine the morphology information and microscopic structures of the samples.Fig. 1c andd show the SEM and TEM images of bare TNS, respectively, both of which display the well-defined two-dimensional (2D) sheet structures of TNS.In the high-resolution TEM (HRTEM) image in the inset of Fig. 1d, the lattice spacing determined as 0.352 nm belongs to the (101) plane of TNS 42.The SEM and TEM images in Fig. 1e and f demonstrate the sheet-shaped structures of BWO, and the marked interplanar spacing of 0.273 nm in the HRTEM image (inset of Fig. 1f) corresponds to (200) plane of BWO 35,44.Fig. 1g discloses the TEM image of B-T composite, manifesting the compact interfacial contact between TNS and BWO.From the HRTEM image in Fig. 1h, both the marked interplanar spacing of 0.375 nm corresponding to (111) plane of BWO 45, and that of 0.189 nm corresponding to (200) plane of TNS can be clearly distinguished 46.The results illustrate the successful incorporation of BWO into TNS, and the good interfacial interaction formed between them. X-ray diffraction (XRD) was employed to investigate the crystal phase structure of the samples.).As for B-T, both the typical diffraction peaks of TNS and BWO can be observed in the composite.Fig. 2b shows the UV-vis diffuse reflectance spectroscopy (DRS) data, which directly reflects the optical property of the samples.The absorption edge of bare TNS located at around 400 nm corresponds to the intrinsic absorption of anatase TiO2 47.BWO shows a absorption edge around 450 nm, correlating with the intrinsic bandgap absorption of Bi2WO6 44.Compared with pure TNS, the B-T composite exhibits a slightly red-shifted absorption threshold around 420 nm, which can be assigned to the introduction of BWO 43. In the next, we evaluated the efficiency of the sample for photocatalytic CO2 reduction with H2O in gas phase under UV-vis light irradiation.Considering the possible carbonaceous residues on the photocatalyst, which may decompose into small molecules such as CO and CH4 during photocatalysis, causing overestimation of the catalytic activity 18192021, a contrast test in N2 atmosphere instead of CO2 under otherwise identical conditions was simultaneously conducted to confirm whether the possible carbonaceous residues contribute to the carbon-containing products formation.As shown in Fig. 2c, we can see that large amount of CO and CH4 were produced from the reaction system under N2, which should be released from the carbonaceous residues within the sample; however, once N2 was replaced with CO2, the detected amount of CO/CH4 is significantly decreased, where it seems that not only photocatalytic CO2 reduction has not been efficiently proceeded but also the carbonaceous residues decomposition have been largely inhibited.Clearly, the results imply a competitive relationship between the light-driven carbonaceous residues decomposition and CO2 photocatalytic reduction.In this regard, we propose that as for studies on photocatalytic CO2 reduction, the recommended contrast test of activity in N2 atmosphere instead of CO2, aiming to exclude the participation of catalyst associated carbonaceous residues in the formation of products, might sometimes lead to underestimation of the true activity.It is because that carbonaceous residues decomposition under N2 atmosphere might be inhibited under CO2 atmosphere, as reflected in the case study of the as-prepared B-T sample. The CO and CH4 produced under N2 atmosphere should stem from the carbonaceous residues remaining within the sample, which was introduced during the synthetic process and hardly cleared up through conventional washing procedures 18,21.In order to track out the origin of the carbonaceous residues, we have monitored the behavior of each single component of the B-T composite, including bare BWO, bare TNS, and APTES modified TNS (A-TNS), under N2 atmosphere and UV-vis light irradiation.As shown in Fig. 2d, only a little amount of CO/CH4 was detected over bare BWO and TNS.By contrast, as much as 40 mol g -1 of CO with a small amount of CH4 was obtained within only 1 h light irradiation over A-TNS, and further increasement can be observed when lengthening the reaction time to 2 h.The results indicate that it is the process of modifying TNS with APTES that results in abundant carbonaceous residues within the final A-TNS and B-T samples, which then decompose into CO/CH4 under UV-vis light irradiation and N2 atmosphere. The products yields over TNS and A-TNS in the CO2 atmosphere have also been analyzed and summarized in Table 1.The comparation study between A-TNS in the CO2 and N2 atmosphere further confirms that CO2 can suppress the decomposition of carbonaceous residues. As for TNS, the suppression is not obvious, which is because that only small amount of carbonaceous residues exist over TNS and the intrinsic decomposition is slight.Therefore, we can conclude that the carbonaceous residues decomposition can be greatly suppressed under CO2 atmosphere when large amount of carbonaceous residues exist in the samples.On the other hand, the products yields comparation between TNS and A-TNS under CO2 atmosphere indicate that since the intrinsic photoactivity of TNS for CO2 reduction is low, the existence of the carbonaceous residues on the TNS sample disturbs the real activity measurement for CO2 photocatalytic reduction, and the degree of the influence highly depends on the amount of the carbonaceous residues.We believe that if the photocatalyst exhibits high efficiency and good stability for CO2 reduction, the influence of carbonaceous residues decomposition on the activity test will be negligible since the carbonaceous residues will become less and less due to the decompositon (as reflected in Fig. 3) while the true activity from CO2 reduction is consistent.Therefore, it is vital to devote more efforts to further improve the intrinsic activity of the photocatalysts for CO2 reduction. More intriguing phenomenon is that under N2 atmosphere, the obtained amount of CH4 over B-T continually increases with the reaction time, which gradually exceeds the released amount of CO (Fig. 3a); while the products over A-TNS is mainly occupied by CO, although detectable increasement of CH4 can also be observed (Fig. 3b).It can be concluded that the addition of BWO into A-TNS changed the products distribution by accelerating further transformation of CO to CH4.Controlled experiments have been conducted for in-depth investigation of the undergoing reactions.Fig. 3c displays the light-driven behavior of B-T under N2 atmosphere and UV-vis light irradiation, but without the addition of H2O.It can be found that further transformation of CO to CH4 was failed to happen without H2O, which is in accordance with the reaction mechanism of photocatalytic CO2 reduction.That is, H2O is indispensable in the reduction of CO2/CO to CH4, which plays the role of to be oxidized to provide proton H to paticipate in the reaction 12,13,18.Obviously, the results show an integrative relationship between light-driven carbonaceous residues decomposition and CO2 photocatalytic reduction.Specifically, the released CO from the carbonaceous residues decomposition can be further reduced to CH4, which is one of the key reaction steps in photocatalytic CO2 reduction 12,13,18.Fig. 3d shows the products distribution of the sample consisted of physically mixed A-TNS and BWO (denoted as A-TNSBWO).We can see that CO is the major product with negligible CH4 formation, which suggests that the compact interfacial contact between TNS and BWO, the critical factor to interfacial charge transfer, plays an important role in boosting further reduction of CO to CH4.The slight difference of the CO yield between the samples of A-TNS and A-TNSBWO might be because that the addition of the BWO component possibly changed the adsorbing behavior of the samples over the intermediate and/or final products during the reaction process, since it has been reported that the high oxygen affinity of Bi enables strong adsorption of CO on the Bi surface 48,49.The above results suggest that, as compared to A-TNS, the enhanced H2O oxidation was obtained over B-T composite and subsequently more proton H was achieved to result in enhanced transformation of CO to CH4.In addition, a trace amount of H2 was also detected over the B-T sample after 8 h light irradiation under N2 atmosphere (Table 1), which is because that the accumulated proton H also leads to the In order to figure out the mechanisms for the higher H2O oxidation efficiency over B-T than bare TNS, the relative band positions of BWO and TNS are firstly identified.According to the Mott-Schottky results (Fig. 4a andb), the flat-band potential of TNS and BWO are estimated to be around -0.9 V and -0.23 V versus Ag/AgCl (pH 6.8, for 0.2 M Na2SO4 electrolyte), respectively 50,51.Since both BWO and TNS show the characteristic behavior of n-type semiconductor, as observed from the positive slope of the linear plots 51, their conduction band edges (CB) are considered to be very close to their flat-band potentials 51.Therefore, the CB of TNS and BWO are calculated to be -0.28V and 0.39 V vs. normal hydrogen electrode (NHE, pH 0), respectively.According to the Kubelka-Munk function based on the DRS spectra (Fig. 2b), the bandgap energy of TNS and BWO are calculated to be 3.2 eV and 2.7 eV, respectively, from the intercept of the tangents to the plots of hv 1/2 versus photon energy (hv), since both TiO2 and Bi2WO6 are indirect bandgap semiconductors (Fig. 4c) 24,44.The valence band (VB) of TNS and BWO are then determined as 2.92 V and 3.09V using the formula ECB EVB-Eg .Based on the matchable energy band between TNS and BWO, two possible charge transfer routes are proposed: conventional type II and direct Z-scheme heterojunction mechanisms.If the B-T composite follow the conventional type II charge transfer mechanism (Fig. 4d), under UV-vis irradiation, the photogenerated holes would tend to transfer from the VB of BWO to the VB of TNS, while the electrons from the CB of TNS to the CB of BWO, through which the oxidation ability of holes would be reduced 52.It is clearly not consistent with the experimental results of enhanced H2O oxidation.Therefore, it is considered that B-T composite should follow the Z-scheme charge transfer mechanism 17,43.As shown in Fig. 4e, the combination of electrons from the CB of BWO and the holes from the VB of TNS leads to more effective holes on the VB of BWO for the oxidation of H2O, which provides more proton H to produce CH4 53,54. The enhanced charge carrier transfer through Z-scheme mechanism within B-T as compared to bare BWO and TNS was further confirmed by photoelectrochemistry and photoluminesence As shown in Fig. 4h, the PL profile of B-T is similar to that of TNS and obviously different from bare BWO.This is because of the relatively low amount of BWO in the B-T composite, and it is reasonable to conclude that the PL emission peak for B-T is mainly attributed to that of TNS 56.Notably, the PL intensity of B-T is much lower than that of pure TNS, suggesting the more efficient inhibition of radiative recombination of electron-hole pairs in the B-T composite 57.As a result, the enhanced charge transfer in the Z-scheme manner within B-T composite leads to enhanced H2O oxidation and subsequently more proton H , which ultimately further transforms CO as the major product for A-TNS to CH4, as schematically illustrated in Fig. 4i. These results provide some enlightenment on designing more efficient photocatalysts for CO2 reduction, where the rationally designed Z-scheme based composites without the disturbance of carbonaceous residues would be of great potential for achieving high selectivity for CH4 formation."
  },
  {
    "title": "Conclusions",
    "content": "Bi2WO6-TiO2 (B-T) binanosheets have been prepared through an electrostatic self-assembly between positively charged A-TNS and negatively charged BWO, based on which we have unveiled the interplay, i.e., the co-existence of a competition and an interaction between lightdriven CO2 photocatalytic reduction and carbonaceous residues decomposition, as schematically shown in Fig. 4i.Although the true activity of as-fabricated B-T for photocatalytic CO2 reduction is hard to be confirmed, some enlightenment on the future researches in the filed of gas-phase photocatalytic CO2 reduction are highlighted.Firstly, the photoactive materials is better to be synthesized avoiding introduction of large amounts of carbon containing reagents, such as surfactant or polymer, which could complicate accurate evaluation of the true photoactivity; and/or post-treatment such as UV-irradiation or thermal activation in air can be employed to remove possible residues on the condition of not destroying the structure and properties of the materials.Secondly, the contrast test of activity under inert gas instead of CO2 to exclude the contribution of carbonaceous residues to the products formation might lead to underestimation of the true activity, since CO2 molecules could play a role in suppressing the carbonaceous residues decomposition.At last, the enhanced Z-scheme charge transfer between BWO and TNS can reduce more CO released from the carbonaceous residues to CH4, and thus it is reasonable to propose that more rationally designed Z-scheme based composites without the disturbance of carbonaceous residues would be a promising material to obtain higher selectivity for CH4 formation in photocatalytic CO2 reduction. time unveil the co-existence of a competition and an interaction relationship between lightdriven carbonaceous residues decomposition and photocatalytic CO2 reduction, which further emphasizes the necessity of removing organic residues from photocatalysts and carefully analysing the origin of carbon-containing products to estimate the photocatalytic performance towards CO2 reduction in a more accurate way.Moreover, this work could provide some enlightenment on designing and/or synthesising more efficient photocatalysts for CO2 reduction with high selectivity for CH4 formation, where rational construction of Z-scheme heterostructures is highlighted.Keywords: light-driven; CO2 photoreduction; carbonaceous residues decomposition; photoluminescence spectra (PL) for powder samples were analyzed on an Edinburgh Analytical Fig. 2a depicts the XRD patterns of TNS, BWO and B-T composite.It is clear to see that all the diffraction peaks of pure TNS are ascribed to the anatase phase of TiO2 (JCPDS No. 21-1272) and those of BWO are attributed to the orthorhombic Bi2WO6 phase (JCPDS No. 73-2020 photocatalytic CO2 reduction with H2O3,12. characterizations.As shown in Fig.4f, significantly improved photocurrent values can be observed over B-T as compared to bare BWO and TNS, demonstrating the more efficient charge transfer achieved within B-T composite34.The electrochemical impedance spectroscopy (EIS) Nyquist plots were measured to gain insight into the charge transfer process on the sample electrodes as well as the contact interface between electrode and electrolyte55.As displayed in Fig.4g, the Nyquist diagrams of B-T electrodes show depressed semicircle as compared to bare BWO and TNS, indicating that the introduction of BWO contributes to enhanced charge transfer.The photoluminesence (PL) spectrum of the samples conducted under 340 nm monochromatic light excitation was employed to study the recombination of electron-hole pairs. Fig. 1.Flowchart for the fabrication of A-TNS and B-T (a); Zeta potentials for A-TNS and BWO (b); SEM and TEM images for TNS (c, d) and BWO (e, f), respectively; insets of (d) and (f) are the HRTEM images of TNS and BWO, respectively; TEM and HRTEM images for B-T composite (g, h). Fig. 2. XRD patterns of TNS, BWO, and B-T composite (a); DRS of TNS, BWO and B-T, inset is the enlarged DRS ranges from 320-510 nm (b); the products distribution after 1 h light irradiation over B-T composite under N2 and CO2 atmosphere, respectively (c); products distribution over BWO, TNS and A-TNS under N2 atomophere within 2 h light irradiation (d).Reaction conditions: 20 mg of catalysts, 0.5 mL of water, under UV-vis light irradiation.Note that the error bars represent the photoactivity standard deviation values calculated from triplicate experiments.A C C E P T E D M A N U S C R I P T Fig. 3.The products distribution over B-T composite (a), A-TNS (b), B-T composite without H2O addition to the reaction system (c), and physically mixed A-TNS and BWO (d) during 8 h light irradiation.Reaction conditions: 20 mg of catalysts, 0.5 ml of water, under N2 atmosphere, and UV-vis light irradiation.Note that the error bars represent the photoactivity standard deviation values calculated from triplicate experiments. Fig. 4. Mott-Schottky plots for TNS (a) and BWO (b); the estimated energy bandgap by the plot based on the Kubelka-Munk function versus the energy of light for TNS and BWO based on the DRS spectra in Fig. 2b (c); schematic illustrating the relative energy band levels of TNS and BWO, and the possible charge transfer mechanism between them: type II charge transfer (d), and Z-scheme charge transfer (e); photocurrent density under UV-vis light irradiation (f), EIS Nyquist plots (g), and PL emission spectra with an excitation wavelength of 340 nm (h) for the samples of bare BWO, bare TNS and B-T composite; schematic diagram of the reaction process (i). Yields of H2, CH4 and CO as a result of the photoreaction over different samples under N2 or CO2 atmosphere.Reaction conditions: 20 mg of catalysts, 0.5 ml of water, and UV-vis light irradiation. The support from the National Natural Science Foundation of China (NSFC) (U1463204, 21173045), the Award Program for Minjiang Scholar Professorship, the Natural Science Foundation (NSF) of Fujian Province for Distinguished Young Investigator Rolling Grant (2017J07002), the Independent Research Project of State Key Laboratory of Photocatalysis on Energy and Environment (NO.2014A05), and the 1st Program of Fujian Province for Top Creative Young Talents is gratefully acknowledged."
  }
]