[
  {
    "title": "Doi",
    "content": "10.1016/j.jcis.2018.12.022"
  },
  {
    "title": "Article_Title",
    "content": "Preparation of TiO2 microspheres with tunable pore and chamber size for fast gaseous diffusion in photoreduction of CO2 under simulated sunlight"
  },
  {
    "title": "Abstract",
    "content": "TiO 2 microsphere with tunable pore and chamber size are prepared by a simple solventhermal method and used as catalyst for the photocatalytic CO 2 reduction.It is found that the hollow microsphere with relative lower surface area of 73.8 m 2 g -1 exhibits increased pore size of 18.1 nm and cavity structure, leading to higher CO 2 diffusion coefficient of 5.4010 -5 cm 2 s -1 compared with the solid and yolk/shell microspheres.Therefore, the hollow microsphere possesses more accessible sites for CO 2 adsorption, which finally gives rise to the enhanced CO production rate of 10.90.7 molg -1 h -1 under simulated sunlight, which is respectively 1.6 and 1.4 times higher than that of solid and yolk/shell microspheres.Electron dynamic study further demonstrates that hollow microsphere shows the highest photocurrent density and the lowest charge recombination among three microspheres structure, which is attributed to the swift CO 2 diffusion providing fresh CO 2 molecules to rapidly scavenge the photo-generated electrons and finally leading to the excellence catalytic reduction performances.This method could be adopted as a general strategy to prepare high performance TiO 2 catalysts with desirable structural qualities for the photocatalytic CO 2 reduction under nature sunlight."
  },
  {
    "title": "Experimental",
    "content": "In a typical procedure, 0.65g of P25 (Degussa) was dispersed in a mixture solution of 87.5 mL hydrogen peroxide (H 2 O 2 , 30 wt) and 12.5 mL ammonia (NH 3 H 2 O, 26-28 wt) and then stirred at room temperature until the suspension was converted to a clear light yellow solution.Afterwards, 20 mL the yellow precursor was mixed with 20 mL distilled water and 40 mL absolute ethanol.Finally, the mixture was transferred into a 100 mL Teflon container and sealed tightly with a stainless jacket and then heated at 160 oC for 2h, 4h and 6h to obtain the intermediate products.Subsequently, 0.2 g intermediate products were dispersed in 80 mL distilled water and sealed in a 100 mL Teflon-lined autoclave and then treated at 180 oC for 4h, 2h, and 1h, respectively.After being centrifuged and washed with water and ethanol, the final products were obtained and named as solid, yolk/shell and hollow MSs, respectively. Scanning electron microscope (SEM) was performed at QUANTA 250 FEG equipped with OCTANE PRO.The samples were characterized by X-ray powder diffraction (XRD, Bruker D diffractometer) with Cu K radiation (1.5406A) and high resolution transmission electron microscopy (HRTEM, JEOL, JSM-2100).X-ray photoelectron spectroscopy (XPS) measurements were carried out on a Thermo Fisher ESCALAB 250 instrument, using monochrome Al K (300.0 eV) as the excitation source.The BET surface areas were ascertained by cryogenic N 2 adsorption Micromeritics BEL sorp surface analyzer at 77 K.The samples were degassed at 353 K for 10 h under vacuum and by using the nitrogen flux.Prior to the measurements, the samples were dry on the oven to remove moisture.The Brunauer-Emmett-Teller (BET) surface area and pore diameters were calculated from the adsorption branch of isotherms according to BJH method.Raman measurement was carried out using a Renishaw in Via Raman spectroscopy with the laser excitation was 532nm and a CCD detector.CO 2 adsorption was measured using BEL sorp carbon dioxide adsorption apparatus at 298K.UV-vis diffuse reflectance spectra (UV-vis DRS) of samples were measured by using a UV-vis spectrometer (Perkin-Elmer Lambd 950 UV-vis spectrometer), in which BaSO 4 was used as the reflectance standard. Photocurrent and electrochemical impedance were implemented on a CHI 660D workstation (Shanghai Chenhua).The three-electrode cell comprises a work electrode, an Ag/AgCl (saturated KCl) reference electrode and a platinum sheet counter electrode immersed in Na 2 SO 4 (0.5 M) aqueous electrolyte.A simulated AM 1.5 sunlight with an output power of 100 mW cm -2 produced by a solar simulator (Newport 69920) was utilized as the light source and a metal mask with 0.16 cm 2 window was applied to define the active area of each device.A 500 W mercury vapor lamp was used as the UV light source (390 nm). The photocatalytic reduction of CO 2 was carried out in a home-made gas-closed circulation system. For each test, the catalyst films were prepared according to previous literature 41 and the loading amount of the catalyst is 10 mg on the glass substrate.Then, the film was put in the glass reaction cell with a total volume of 100 mL.Before light irradiation, the photoreactor system was thoroughly vacuum-treated to remove air and then ultra-pure CO 2 gas were passed through the water to blown mixture gaseous of CO 2 and H 2 O vapor at least 30 min to further exclude other gases.Finally, the reactor was sealed and encased on a self-contained water jacket with a circulating water bath at 25 oC. A 500 W mercury vapor lamp was used as the UV light source (390 nm).A 300 W Xe lamp with a standard AM1.5 filter was used as the simulated sunlight source.The photocatalytic reaction was typically performed at 298K by recirculating cooling water system for 3 hours.During irradiation, 2 mL gas was taken from the reactor at regular intervals (1h) and analyzed by a gas chromatography (GC-4000A, Beijing, China) equipped with both a thermal conductivity detector (TCD) and flame ionization detector (FID).The produced gases were calibrated with a standard gas mixture and determined using the retention time.Furthermore, each experiment was repeated 5 times in parallel to obtain an average value."
  },
  {
    "title": "Results_and_discussion",
    "content": "Scheme1.Formation processes for the selective preparation of solid, yolk/shell and hollow TiO 2 MSs. As depicted in Scheme 1, the strategy for the selective preparation of TiO 2 MSs involves three distinguished steps.Firstly, the commercial P25 powder is dissolved in solution containing H 2 O 2 and NH 3 H 2 O to form a solvable Ti complex.Secondarily, uniform amorphous microspheres consisting of unsolvable Ti complex are generated by the hydrolytic and non-hydrolytic condensation processes occurred in the water/ethanol solvethermal system 41.Afterward, a layer of TiO 2 nano-spindles were form on the surface of the spheres taking advantage of the shape regulation of the NH 4 ions 42.With the continuous dissolving of the gel microspheres (prolonged reaction times from 2 to 4, 6 hours), yolk/shell and hollow MSs could be subsequently generated.It should be mentioned that the inner part of the intermediate solid MS and core sphere of the yolk/shell MS are amorphous at this stage. Subsequently, the gel spheres could be in-situ crystallized to form mesoporous TiO 2 MSs with solid, yolk/shell and hollow architectures and tunable pore size distribution via the further crystallization.It is noticed that the oxidization effect of the H 2 O plays the crucial role to crystallization and control the pore size during the high temperature hydrothermal treatment. Fig. 2 shows the SEM images of the MSs with different structures.The as-prepared TiO 2 solid MS presents spherical morphology with the diameter of 450 nm (Fig. 2a 1 ).The high-resolution SEM image shows that solid MS is assembled by nanoparticles and nanospindles with the length from 50 to 150 nm (Fig. 2a 2 ).For yolk/shell MS, it shows the mean diameter 560 nm because of the outwards growth of the inner particles as we described previously 41.Fig. 2b 2 shows the yolk/shell MS is composed of nanospinedles with increased length and width.In addition, a small core sphere assembled from nanoparticles is found embedded in the chamber.The as-prepared hollow structure (Fig. 2c 1 -c 2 ) possesses mean diameter of 660 nm.Furthermore, the length of nanospindles increases to 50200 nm and diameter remains almost the same compared with that of solid MS.The TEM images were adopted to further determine the detailed structures of MSs.Fig. 2a 3 shows the solid MS is embedded with numerous nanospindles, which is in accord with the observation of Fig. 2a 2 .In addition, from the HRTEM of solid MS (Fig. 2a 4 ), clear crystal lattice fringes of the individual nanospindle and the interplant distance could be measured as 0.48 nm corresponding to (002) planes of anatase TiO 2 .Moreover, for the yolk/shell MS, the shell thickness is 80 nm and the diameter of yolk is 300 nm (Fig. 2b 3 ).As depicted in Fig. 2c 3 , the shell thickness of hollow MS reaches to 120 nm with the growth of the nanospindles.The HRTEM images unfold distinct and well-defined lattice fringes of nanospindles indicating the improved crystal quality with enhanced reaction times (Fig. 2b 4 and c 4 ).The inter-planar spacing of the crystal lattices equals to 0.35 nm corresponding to the (101) planes of anatase TiO 2 , which proves the spindle is growing along the 001 direction.and the result is shown in Table .1 43.To reveal the vibrational and structural properties of different TiO 2 MSs, Raman spectroscopy was measured and shown in Fig. 3b.The Raman active modes of three samples featured similar peaks at approximately 142 (E g ), 394 (B 1g ), 514 (A 1g ), and 636 (E g ) cm -1 , which are consistent with the spectrum of the typical anatase TiO 2 phase and no other impurity related modes are detected.It is distinct that hollow MS shows the highest E g peaks, which is caused by symmetric stretching vibration and bending vibration of O-Ti-O 20.In addition, the peaks intensity of the hollow MS is obviously higher than the others, which proves the well-crystallized structure 35,36.APS: average pore size; PV: pore volume; CA: CO2 adsorption quantity corresponding to a P/P0 of 0.02 44 .Fig. 4a shows the nitrogen adsorption-desorption isotherms and the corresponding pore size distribution curves of the MSs.All samples show IV type isotherm indicating the presence of mesopores 13.Moreover, the isotherms present high adsorption at high relative pressure (P/P 0 ) range implying the formation of large mesopores and macropores.As shown in the inset of Fig. 4a, the Barrett-Joyner-Halenda (BJH) pore size distribution shows a wide pore size distribution of 550nm. For the solid MS, the observed H2 hysteresis loop suggests the presence of ink-bottle pores with narrow necks and wider bodies, and an average pore diameter could be determined as 13.2 nm.While, the hollow MS shows H3 hysteresis loop indicating the formation of slit-like pores.The summary of BET surface area, pore volume and pore diameter of the solid, yolk/shell and hollow MSs are depicted in Table .1.The specific surface area (SSA) of the solid MS is 108.3 m 2 g -1 , which is higher than that of yolk/shell (90.6 m 2 g -1 ) and hollow MSs (73.8 m 2 g -1 ).While, the hollow MS owns the largest average pore size of 18.1 nm among the three samples, which could provide effective pathways for the CO 2 diffusion 45,46.In addition, the CO 2 adsorbed on the catalyst surface is also the prerequisite for their effective participation in the photocatalytic conversion of CO 2 .As displayed in Fig. 4b, the CO 2 adsorption isotherms indicates that the hollow MS possesses the highest CO 2 adsorption amount of 23.97 cm 3 g -1 , which is 1.8 and 2.4 times higher compared with yolk/shell (13.17 cm 3 g -1 ) and solid MSs (9.78 cm 3 g -1 ) (Table.1).(using N 2 instead of the CO 2 ), and no reduction product was generated in all these cases confirming the as-produced CO was not derived from the organic residues in the catalyst or the reaction medium but from the photocatalytic conversion of CO 2 .S2) and the CO production reaches to 45.43.6 molg -1 after irradiation 3 h, which are 1.2 and 1.3 folds higher than that of yolk/shell and hollow MSs.The production rate of CO on solid MS is 17.70.8molg -1 h -1 , which is 1.2 and 1.6 times higher than that of yolk/shell and hollow MSs (Fig. S2b).UV-vis diffuse reflectance spectra are adopted to investigate the optical absorption properties and the results are shown in Fig. S3.Although the absorption edges of three TiO 2 MSs remain at the same position, while the intensity of solid MS is significantly higher compared with that of the other samples in UV light region, which leads to the higher photocatalytic performances of the solid MS under UV light 47.Under simulated sunlight, the photocatalytic activity was decreased due to the low visible light absorption for whole samples.Whereas, hollow MS shows the photocatalytic CO 2 reduction activity of 34.02.3mol g -1 after 3 h irradiation under simulated sunlight, which is 1.6 and 1.4 times higher than that of solid and yolk/shell MSs (Fig. 5a and5b).In addition, the stability test shown in Fig. S4 indicates the CO production exhibits no obvious decrease and the amount of CO remains nearly 84 of the initial after four-cycle reuse.Furthermore, the morphology and structure of the catalyst remained unchanged after the photocatalytic reaction indicating high structural stability of the catalysts (Fig. S5 andS6).To investigate the influence of structures for CO 2 diffusion in photocatalysis, the effective diffusion coefficient of CO 2 and CO molecules in solid, yolk/shell and hollow MSs were calculated by Knudsen diffusion equations.The scheme for CO 2 diffusion in the single sphere is shown in Fig. 6.According to Eqn.1, where is the diffusion mean-free path of gas molecules, p is the pressure.The /d values of the MSs could be calculated as 758, 662 and 552 for solid, yolk/shell and hollow MSs, indicating the CO 2 diffusion in the MSs obey the Knudsen diffusion law 48.According to the same method, it is found that the diffusion of CO also follows the Knudsen diffusion law. the diffusion mean-free path of CO 2 and CO could be respectively calculated as 10.0 and 7.7 m when the pressure is 1atm. Based on Eqn.2, where D k is the diffusion coefficient of gas molecules, r a is the average pore radius size, T is the thermodynamic temperature and M is the molecular mass of corresponding gas. The value of diffusion coefficient of carbon dioxide molecules (D k ) could be calculated as 1.6710 -4 , 1.9110 -4 and 2.2910 -4 cm 2 s -1 for the solid, yolk/shell and hollow MSs, respectively.Based on Eqn.3, where D e is the effective diffusion coefficient of gas molecules in solid MS, p is porosity and the value is 0.366 for solid MS and the portion of solid with yolk/shell and hollow MSs. m is tortuosity factor with the value of 4 in the calculated model.The effective diffusion coefficient of CO 2 could be calculated as 1.510 -5 cm 2 s -1 for solid MS.Based on Eqn.3, the effective diffusion coefficient of CO 2 molecules is 2.110 -5 cm 2 s -1 and 1.610 -5 cm 2 s -1 for the hollow and yolk/shell MSs. However, it should be noticed that the yolk/shell and hollow MSs possess the cavity in the inner structure.From Fig. 2, the diameter of the hollow microsphere is 660 nm and the shell thickness is 120 nm.For yolk/shell MS, the mean diameter is 560 nm and the shell thickness is 80 nm. Therefore, based on Eqn.4,where R s is the radius of cavity, R is the radius of the microsphere; v represents the cavity volume fraction which is calculated as 0.258 for the hollow and 0.08 for the yolk/shell MS.Finally, based on Eqn.5, where D p is the average effective diffusion coefficient of gas molecules; D f is a constant particle gap diffusion coefficient (0.164 cm 2 s -1 ).Therefore, the D p of CO 2 in single hollow and yolk/shell MSs could be determined as 2.8310 -5 cm 2 s -1 and 1.7410 -5 cm 2 s -1 . As described in the experimental section, the MSs are loaded on glass substrate as a film layer to form a catalytic bed.Based on Eqn.6, where D b is the average effective diffusion coefficient of CO 2 molecules in films, b is the porosity between microsphere particles and the value is 0.476.The average effective diffusion coefficient of CO 2 in the films made of solid, yolk/shell and hollow MSs could be calculated as 2.8610 -5 , 3.3210 -5 and 5.4010 -5 cm 2 s -1 .Based on the same calculated method, the average effective diffusion coefficient of CO in solid, yolk/shell and hollow MSs films could be determined as 3.6510 -5 , 4.1910 -5 and 6.7610 -5 cm 2 s -1 , respectively.Due to the higher diffusion coefficient of hollow MS, the CO 2 molecules could be easily transferred to the active sites for reduction. Meanwhile, the CO product could rapidly be detached from the catalyst surface and diffuse outside the MSs for the regeneration of the active sites.The transient photocurrent response was further performed to understand the high performance of hollow MS.As shown in Fig. 7a, the photocurrent increases immediately as turning on the light.On the contrary, the photocurrent rapidly decreases to zero as switching off.Furthermore, the transient photocurrent density of hollow MS is higher than solid and yolk/shell MSs, demonstrating the photo-induced electrons and holes in hollow MS could be effectively separated and transferred 18,28. To further illustrate the electron dynamic performances, the EIS (Fig. 7b) and Mott-Schottky plots (Fig. 7c) were measured.The Nyquist plots shows that the hollow MS exhibits the smallest impedance arc radius, implying the recombination of photo-induced charge carriers are greatly suppressed.The Mott-Schottky curves show that all the samples possess positive slope, which is consistent with the n-type nature of the TiO 2 .Importantly, the hollow MS shows the smallest slopes of the Mott-Schottky plot compared with solid MS and yolk/shell MS, suggesting a faster charge transfer 49.In addition, the flat potential (V fb ) calculated from the x intercepts of the linear region equals to the Fermi level (E f ) for an n-type semiconductor.The hollow MS exhibits a more negative E f , indicating higher conduction band position compared with that of the solid and yolk/shell MSs, which is thermodynamically favorable to promote the reduction of CO 2 50.Compared with the full spectrum, the transient photocurrent responses and Nyquist plots were also measured under ultraviolet and the results are shown in Fig. S7.The current densities for all the samples under UV light are much higher than simulated sunlight due to the high input energy density of the UV lamp.The solid MS shows the highest photocurrent density among three catalysts under UV light, which is derived from the enhanced light harvesting efficiency in the UV region 18.The Nyquist plots (Fig. S7b) shows that the solid MS exhibits the smallest impedance arc radius compared with that of hollow and yolk/shell MSs, indicating the highest separation efficiency of photo-generated electron-hole pairs.These results explain the excellent catalytic performance of solid MS under UV light.The results about Transient photocurrent and EIS within UV-vis light are very different compared with that under UV light.This is because the light absorption dominates the photoreduction process in the high UV light intensity resulting that the solid MS with high light absorption shows the highest efficiency.However, at the low UV light (UV-vis light), the mass transfer and electron transport acts as rate-determining step in reduction reaction.The hollow MS with high crystal quality and enhanced pore size results to the enhanced mass diffusion and electron transport.Furthermore, there is slightly improved visible-light absorption for hollow MS, implying the strong light scattering effect among three samples (Fig. S3).Therefore, hollow MS win the competition among three samples. According to the above analysis, a mechanism is proposed to describe the photocatalytic process under simulated sunlight (Fig. 7d).As described in Fig. S8, the UV light merely takes up a small portion of the incident light.Therefore, the dynamic CO 2 adsorption and CO desorption process would govern the overall photocatalytic CO 2 reduction process under the condition with weak UV light input.Under this situation, the hollow MS possesses much higher CO 2 adsorption (23.97 cm 3 g -1 ) than solid MS (9.78 cm 3 g -1 ), implying more CO 2 molecules could be adsorbed and activated on the TiO 2 surface.In addition, the small mass transfer resistance (both for the CO 2 and CO molecules) leads to the fast CO 2 migration to the active sites and CO desorption from the surface to regenerate the active sites.By the effective CO 2 supply for the active sites, the photo-generated electrons could be quickly scavenged and the recombination of charge carriers is inhibited, which results in the higher photocatalytic activity of the hollow MS.Although the UV light only takes up 5 of the energy in the sunlight spectrum, the photo-catalysis carried out under the real natural sunlight is the most energy economic process."
  },
  {
    "title": "Conclusions",
    "content": "TiO 2 solid, yolk/shell and hollow MSs were selectively prepared as high performance catalysts for photocatalytic CO 2 reduction by a general strategy.Based on the Knudsen diffusion calculation, the hollow MS shows higher average effective diffusion coefficient of 5.4010 -5 cm 2 s -1 and 6.7610 -5 cm 2 s -1 for CO 2 and CO compared with other MSs, which is derived from the increased pore size and unique hollow structure.Hence, it owns more accessible active sites for adsorption and conversion of CO 2 molecules, which gives rise to the reduced surface recombination and high transient photocurrent. Therefore, the hollow MS demonstrates a high CO production rate of 10.90.7 molg -1 h -1 under simulated sunlight, which is much improved than that of yolk/shell and solid MSs.In addition, owing to its high structural integrity, the hollow MS exhibits high cycling stability for reuse, which permits its potential commercialization. Fig.2.SEM and TEM images of the as prepared TiO 2 : (a 1 -a 4 ) solid MS; (b 1 -b 4 ) yolk/shell MS and (c 1 -c 4 ) hollow MS.The insets in (a 1 ), (b 1 ) and (c 1 ) are the corresponding diameter distribution histograms. Fig.3.(a) XRD patterns and (b) Raman spectroscopy; (c) Ti 2p and (d) O1s XPS spectra of the MSs. Fig.3a shows the XRD patters of solid MS, yolk/shell MS and hollow MS.The peaks at 25.25, 36.88,37.72, 38.53, 48.03, 53.91, 54.99, 62.69 and 68.76 are assigned to the (101), (103), (004), (112), (200), (105), (211), (204) and (116) crystal planes of anatase TiO 2 (PDF21-1272), respectively.The hollow MS has the sharpest and strongest diffraction peaks in the three products, confirming that the well-crystallized anatase structure.Further, the diffraction peaks become narrower from solid MS to hollow MS indicating the increased crystal size and crystallinity quality43.According to the full width at half-maximum (FWHM) of the (101) diffraction peak that of solid, yolk/shell and hollow MSs, the crystallite sizes of three samples could be calculated based on the Scherrer formula ( 2 sin d ) Determined by XRD using Scherrer equation with the (101) diffraction peak.The TiO 2 MSs are investigated by XPS spectra and the full survey of the TiO 2 reveals the presence of Ti and O, and C signals (Fig.S1).Fig.3c presents Ti 2p binding energy of 458.9 eV (Ti 2p 3/2 ) and 464.7 eV (Ti 2p 1/2 ), which are corresponding to Ti 4 of TiO 2 .Fig.3d shows the O 1s spectrum ascribing to the lattice oxygen of Ti-O bonding (529.9 eV) and the H 2 O or free hydroxyl group (O-H) on the TiO 2 surface (531.4 eV).The Ti 2p and O 1s high-resolution spectra of three samples are very close, suggesting the similar bonding environment of Ti and O atoms. Fig.4.(a) Nitrogen adsorption-desorption isotherms (the inset is their corresponding pore size distribution curves) and (b) CO 2 adsorption isotherms (1 atm, 273K) of the MSs.The photocatalytic CO 2 reduction activities of the samples were conducted under UV light (300 W high pressure Hg lamp) and simulated sunlight (300W Xe lamp, with AM 1.5 filter).Commercial P25 was selected as reference catalyst in photocatalytic CO 2 reduction.Before the photocatalytic activity test, a series of contrast tests were conducted in the absence of photocatalysts, light irradiation, or CO 2 Fig.5.Photocatalytic CO 2 reduction activity (a) and production rate (b) of P25, solid, yolk/shell and hollow MSs under simulated sunlight (300W Xe lamp, with AM 1.5 filter).The photocatalytic CO 2 reduction based on different TiO 2 MSs and various light sources are shown in Fig.5 and Fig.S2.Obviously, the as-prepared TiO 2 MSs exhibit enhanced photocatalytic performances compared with commercial P25.Under UV light, solid MS shows the highest photocatalytic activity (Fig.S2) and the CO production reaches to 45.43.6 molg -1 after irradiation 3 h, Fig.6.Scheme of molecules diffusion process in single solid, yolk/shell and hollow MSs. Fig.7.(a) Transient photocurrent response, (b) Nyquist plots and (c) Mott-Schottky curves of the Comparison of physicochemical characterization of the as-prepared MSs a . This work is supported by National Natural Science Foundation of China (61176004, 61204078, U1304505,21671059 and 51772078), Program for Changjiang Scholars and Innovative Research Team in University (IRT-17R36), Innovation Scientists and Technicians Troop Construction Projects of Henan Province (154200510009), Program for Innovative Research Team and Individuals (in Science and Technology) in University of Henan Province (18IRTSTHN002, 15HASTIT006, 18HASTIT015). Additional information such as SEM, XRD and XPS patterns, photocatalytic activity and electrochemical measurements of samples associated with this article can be found in the Supplementary data."
  }
]