[
  {
    "title": "Doi",
    "content": "Doi not found"
  },
  {
    "title": "Article_Title",
    "content": "Photoreduction of CO 2 using sol-gel derived titania and titania-supported copper catalysts"
  },
  {
    "title": "Abstract",
    "content": "Carbon dioxide was photocatalytically reduced to produce methanol in an aqueous solution using 254 nm UV irradiation.Titania and Cu-loaded titania were synthesized by an improved sol-gel method using a homogeneous hydrolysis technique.The grain size of TiO 2 and Cu/TiO 2 were uniform and average diameters were approximately 20 nm.Photocatalytic reduction was conducted in a quartz reactor with a UV lamp irradiating at the center.XPS analysis reveals that Cu 2p 3/2 is 933.4 eV indicating primary Cu 2 O species on the TiO 2 supports.EDX and XPS revealed that most copper clusters were on the TiO 2 surface.The optimum amount of copper loading was 2.0 wt. for the highest dispersion among catalysts.The methanol yield of 2.0 wt. Cu/TiO 2 was 118 mol/g following 6 h of UV illumination.The yield was much higher than those of sol-gel TiO 2 and Degussa P25, whose yields were 4.7 and 38.2 mol/g, respectively.The methanol yield reached a steady-state 250 mol/g after 20 h of irradiation.Experimental results indicated that the methanol yield was significantly increased by adding NaOH.The caustic solution dissolved more CO 2 than did pure water.In addition, the OH -in aqueous solution also served as a strong hole scavenger.The redistribution of the electric charge and the Schottky barrier of Cu and TiO 2 facilitates electron trapping via supported Cu.The photocatalytic efficiency of Cu/TiO 2 was markedly increased because of the lowering the re-combination probability for hole-electron pairs.The highest quantum and energy efficiencies achieved were 10 and 2.5, respectively."
  },
  {
    "title": "Experimental",
    "content": "Catalysts were prepared via the sol-gel route illustrated in Fig. 1.The precursor was titanium(IV) butoxide (Ti(OC 4 H 9 ) 4 , 97 in n-butanol), as purchased from Aldrich (USA).The hydrolysis process was performed in a glove box maintained at a relative humidity under 25 by purging with tank nitrogen.To avoid rapid precipitation during polycondensation and the formation of unstable colloidal sols, the hydrolyzing water was homogeneously released by the esterification of butanol and acetic acid 5.The basic aim was to provide the appropriate stoichiometric quantity of water to hydrolyze titanium butoxide during hydrolysis.A typical batch contained 0.02 mol titanium butoxide, 0.08 mol anhydrous butanol (minimum 99.8) and 0.08 mol glacial acetic acid (minimum 99.7).The clear solution was stirred for 8 h at which time the pH value became stabilized.The final pH value of the solution approached 3.56.The transparent sol was dried from room temperature to 150 C in an oven, then transferred to a furnace and calcined at 500 C to burn off hydrocarbons.The sample was crushed into powder in a mortar.The JRC-2 and P25 titania powders were obtained from Fuji Titan (Japan) and Degussa (Germany), respectively, for comparison.Copper-loaded titania (Cu/TiO 2 ) and P25 (Cu/P25) were impregnated by adding CuCl 2 during the sol-gel process and incipient wetness method, respectively.Following calcination similar to that of TiO 2 , Cu-loaded titania was reduced under a flow of 5 H 2 /Ar mixture at 300 C for 3 h. The specific surface area and pore size distribution of catalysts were measured by N 2 adsorption in a Micromeritics ASAP 2000.A diffusive reflective UV-VIS spectrophotometer (Hitachi U-3410) was employed to measure the UV-VIS absorption and estimate the bandgap of the catalysts.The particle size distribution in aqueous solution was obtained using a Coulter LS230 particle size analyzer.Transmission electron microscopy (TEM) and scanning electron microscopy with energy dispersive X-ray spectrometer (SEM-EDX, Philips XL30, EDAX DX4) were used to observe the morphology of catalysts and estimate the elemental ratio.The crystalline phase was identified by X-ray diffraction (MAC MO3XHF).The chemical status and shift of the catalyst surface were analyzed by X-ray photoelectron spectroscopy (XPS).XPS measurements were taken on a VG Microtech MT500 spectrometer, operated with a constant pass energy of 50 eV and with Mg K radiation as the excitation source (h 1253.6eV).The catalyst was pressed into a pellet, and then adhered on sample holder by carbon tape.Oxygen (1 s, 530.7 eV for TiO 2 ) 6 and carbon (1 s, 284.5 eV) were taken as internal standards for binding energy calibration.The fluorescence spectra of catalysts were measured by a Jasco FP-777 fluorescence spectrophotometer at an excitation wavelength of 370 nm. The copper dispersion of Cu/TiO 2 was measured using the method of Chang et al. 7.The Cu/TiO 2 catalyst was reduced in a 5 H 2 /Ar stream at 300 C for 3 h.The catalyst was purged and cooled to 80 C in Ar, and the oxidation was then performed using N 2 O at that temperature.Only surface copper was selectively oxidized by N 2 O when the oxidation temperature was under less than 100 C. The decomposition of N 2 O on the Cu surface generated the chemisorbed oxygen atoms as shown in Eq. ( 2) 8.Following oxidation, the catalyst was again purged in Ar and cooled to 25 C. Hydrogen temperature programmed reduction (TPR) was performed from 25 to 400 C at 10 C/min in a 5 H 2 /Ar stream.The consumption of H 2 was measured from TPR and the dispersion of copper was calculated. Fig. 2 schematically illustrates the reactor system.The system was illuminated by an 8 W Hg lamp with a peak light intensity at 254 nm in the center of the quartz reactor.The entire system was shielded by a metal case during the reaction to prevent interference from outside light.Catalyst powder (0.15-0.6 g) was suspended in 300 ml of 0.2 N NaOH aqueous solutions for typical batches.Supercritical-fluid grade CO 2 was purchased from Air Products (USA) to avoid any hydrocarbon contamination.It was certified maximum hydrocarbons less than 20 ppb.CO 2 was bubbled through the reactor for at least 30 min to purge air and to saturate the solution.The reactor was tightly closed during the reaction, and the CO 2 pressure was maintained in the range of 101.3-135.6 kPa.A magnetic stirrer agitated the catalyst-suspended solution at the The release of O 2 during the reaction would constitute direct evidence of CO 2 photoreduction (Eq.( 1)).An oxygen sensor (Mettler Toledo InPro 6000 series) was placed in the reactor to monitor the concentration of dissolved O 2 during the photoreduction.The sensor was calibrated using the dual point mode before measuring O 2 concentration.The O 2 sensor was inserted into oxygen-free gel until the \"ready\" sign was on, to fix the zero point.Then, the sensor was put into O 2 -saturated solution, until \"ready\" and the value was attuned to a verified concentration (8.2 ppm, 25 C).A needle-type probe was inserted in the reactor to extract samples.The liquid sample (0.5 ml) was collected in a vial wrapped in aluminum foil to reduce interference from the indoor fluorescent light before analysis.After the catalyst's sedimentation, 1-10 l liquid sample was withdrawn and analyzed in a GC/FID equipped with a 3 m long Porapak Q column.Analysis results indicated that methanol was the dominant hydrocarbon.Formic acid, formaldehyde and ethanol were detected from some catalytic reactions, in amounts much less than that of methanol. An UVC probe (Oriel instrument, Goldilux model 70239) was attached on the outer wall of the quartz reactor, and the energy flux (W/cm 2 ) was indicated by a lumen meter (Oriel instrument, Goldilux model 70235) connected to the probe.The photon flux was obtained by dividing the energy flux by the energy of a photon with a wavelength of 254 nm.The energy flux was first measured for the reactor filled with water only.The energy flux was then measured for the reactor containing the catalyst and CO 2 during the reaction.The difference between those energy fluxes was the photo energy absorbed in photoreduction. Blank reactions were conducted to ensure that hydrocarbon production was due to the photoreduction of CO 2 , and to eliminate surrounding interference.One blank was UV-illuminated without the catalyst, and another was in the dark with the catalyst and CO 2 under the same experimental conditions.An additional blank test was UV-illuminated with the catalyst filling N 2 rather than CO 2 .No hydrocarbon was detected in the above three blank tests."
  },
  {
    "title": "Results_and_discussion",
    "content": "The XRD spectra in Fig. 3 verified the anatase phase of JRC-2, P25, TiO 2 and Cu/TiO 2 .A previous investigation has indicated that anatase TiO 2 is the most active phase for photocatalytic reaction 9.Two small Cu diffraction peaks appeared near 2 43.3 and 52 on 6.7 wt. Cu/TiO 2 .No Cu peak was observed on 2.0 wt. Cu/TiO 2 , perhaps due to the slight Cu loading or the extremely small Cu clusters.The grain sizes of all sol-gel derived TiO 2 were nearly 20 nm, as calculated from the Scherrer equation.The particle sizes were consistent with the TEM observation displayed in Fig. 4. As shown in Fig. 4(a), the particles of sol-gel derived TiO 2 were uniform and the diameter was between 10 and 25 nm.Fig. 4(b) reveals that copper clusters were well dispersed on the surface of TiO 2 .Copper clusters were expected to be present on the surface of the TiO 2 particle because the CuCl 2 was added after hydrolysis of titanium butoxide during the preparation (Fig. 1).Zhang et.al. suggested that pure TiO 2 grain sizes with a diameter ranging from 11 to 21 nm were of a size that maximized photocatalytic efficiency 10.When the particle size was less than 5-10 nm, the surface recombination of electron-hole pairs becomes significant, resulting in low photocatalytic efficiency.Fig. 5 shows the actual particle size distributions of catalysts in an aqueous suspension.For TiO 2 and 2 wt.Cu/TiO 2 , the median particle sizes were near 70 and 50 nm, respectively.P25 exhibited two modes of particle size distribution, near 45 and 75 nm. The bandgap can be estimated by extrapolating the rising portion of the UV spectrum to the abscissa at zero absorption 11.Table 1 summarizes the properties of the catalysts.The bandgaps of JRC-2 and Notably, the bandgap is governed by the crystalline structure and the defects in the TiO 2 network.A related investigation suggested that small bandgaps were caused by the stoichiometric deficiency of Ti/O from the sol-gel processes 11.The specific surface area of sol-gel derived catalysts ranged from 25 to 63 m 2 /g.The specific surface area of sol-gel TiO 2 was larger than that of commercial JRC-2 or P25.Table 2 lists the elemental ratio of Cu/Ti estimated from XPS and EDX.The bulk ratio of Cu/Ti was the molar ratio of Cu and Ti in the sol-gel preparation (Fig. 1).The discrepancy between the Cu/Ti ratio obtained by EDX and XPS indicated that most Cu was on the surface of the TiO 2 support.The source of these two kinds of probes, X-ray and electron, with different incident energies, 50 eV and 15 keV, indicates that elements were detected with different depths, 10 nm and 1 m, from the surface 12.Accordingly, the quantitative results of XPS show the outmost surface of catalyst, while those of EDX give the deep structural layers and represent near bulk property. Fig. 6 displays the XPS spectra of TiO 2 , P25, JRC-2 and 2 wt.Cu/TiO 2 .The binding energies of Ti 2p 3/2 and 2p 1/2 of 2 wt.Cu/TiO 2 are the same as those of pure titania at 459.4 and 465.3 eV, respectively, indicating the integrity of the TiO 2 structure, which was not modified by copper impregnation.Fig. 7 shows the XPS spectra of the hydrogen-reduced Cu/TiO 2 catalysts.The binding energies of Cu 2p 3/2 and 2p 1/2 were 933.4 and 954.3 eV, respectively.The shapes of the XPS spectra reveal that the copper species on TiO 2 are major Cu 2 O and minor Cu 0 13. Fig. 8 shows the dependence of methanol formation on illumination time.Various yields of methanol were obtained in a period depending on the catalysts.In all cases, the concentration of methanol was too small to be measured by GC for nearly initial 180 min.The formation of methanol was found much more effective on supported Cu-titania catalyst 14.Methane, formic acid and other hydrocarbons might have been generated, but in quantities too low to be detected.The results showed that the sol-gel derived Cu/TiO 2 outperformed P25, JRC-2, and 2 wt.Cu/P25.Table 3 summarizes the methanol yields of various catalysts under 6 h irradiation.The presence of copper plays an important role, while specific surface area is obviously not a main factor in photocatalytic reactions 15.Contact between TiO 2 and metal generally involves a redistribution of electric charge.In the presence of copper clusters, electrons are enriched owing to the alignment of Fermi levels of the metal and the semiconductor, that is the Schottky barrier 9.Copper then serves as an electron trapper and prohibits the recombination of hole and electron.In addition, the rapid transfer of excited electrons to the copper cluster enhances the separation of holes and electrons 4, significantly promoting photoefficiency.The formation of methanol was more efficient than that of other hydrocarbons in the presence of supported Cu on TiO 2 from the CO 2 and H 2 O system 14. Fig. 9 presents the fluorescence spectra of P25, Cu/P25 and 2 wt.Cu/TiO 2 .The fluorescence intensity of Cu/P25 is much less than that of P25; and 2 wt.Cu/TiO 2 gives an even lower intensity.The fluorescence of titania is caused by the recombination of electrons and holes 16.The decline in fluorescence intensity is due to the reduced number of recombination sites on the TiO 2 surface.Fewer recombination sites on the surface lead to slower recombination of electrons and holes, thus a higher photocatalytic activity 17.The copper-loaded titania effectively provides the electron traps and gives lower fluorescence intensity resulting in higher methanol yield. Quantum efficiency is an essential factor to evaluate a photoexcited reaction, especially in solar energy utilization.Eq. ( 3) is proposed to determine the quantum efficiency.Six moles of electrons are required to produce 1 mol of methanol from CO 2 (Eq.( 1)).All methanol yields of catalysts were compared at 6 h of UV illumination.The total moles of photons were calculated from the 6 h period of photon flux.The energy efficiency (Eq.( 4)) evaluates the transformation of the photon's energy into chemical energy.Theoretically, the chemical energy is the formation of methanol from CO 2 and H 2 O.The equation is the reverse of Eq. ( 1), so the chemical energy is equal to the heat of methanol combustion.The photon energy is the radiation energy absorbed by the catalyst, and is measured by the lumen meter.Table 3 lists the calculated quantum and energy efficiencies.The highest quantum and energy efficiencies achieved 10 and 2.5, respectively, on the 2.0 wt. Cu/TiO 2 catalyst.quantum efficiency () 6 moles of methanol yield moles of UV photon absorbed by catalyst 100 energy efficiency () heat of combustion moles of methanol yield radiation energy of UV absorbed by catalyst 100 The effects of Cu loading and dispersion on methanol yields are shown in Fig. 10.The methanol yields increase with Cu loading, but then decrease when the Cu loading exceeds 2 wt..The Cu dispersions of Cu/TiO 2 increased slightly to 40 for Cu loading below 2 wt., then decreased with further Cu loading.The turnover frequency (TOF) of Cu/TiO 2 catalyst can be estimated if we assume that entire photoreduction occurs on Cu active sites.The catalyst, 2 wt.Cu/TiO 2 , was chosen for further studying the long-term reaction and the influence of experimental conditions.Fig. 11 shows the time dependency of methanol yields with long irradiation periods of up to 35 h.The reactions were repeated twice to confirm the reproducibility and consistency using two different batches of catalysts with the same Cu loading.A steady-state methanol yield was around 250 mol/g following nearly 20 h of irradiation.Halmann suggested that the oxidation of hydrocarbons could occur on the anodic site on TiO 2 particles 18.The rate of methanol re-oxidation eventually caught up with that of methanol generation from CO 2 reduction, thus reaching a steady-state methanol concentration.Another explanation of limited yields involves the deactivation of catalysts due to the coverage of reaction intermediates on active sites.Methanol can possibly be converted to other hydrocarbons during a long-term reaction, but in quantities that might be too low to be confirmed. Oxygen is expected as a product of the CO 2 reduction (Eq.( 1)).Fig. 12 shows that the time dependency of oxygen generation approximately matches that of the methanol yield.By and large, the ratio of methanol to oxygen is near constant, 3-1.Free O 2 was suggested as being adsorbed on the surface of TiO 2 in the presence of water 14.Consequently, the oxygen sensor detected only part of dissolved oxygen in these experiments.The O 2 evolution also plateaued after 16-18 h of reaction, revealing O 2 consumption by methanol re-oxidation.NaOH solution was crucial in the photoreduction of CO 2 19.The methanol yield substantially increased with the addition of NaOH in our experiments, perhaps due to the following two reasons.First, the high concentration of OH -; ions in aqueous solution could act as strong hole-scavengers and form OH radicals, thereby reducing the recombination of hole-electron pairs.The longer decay time of surface electrons would certainly facilitate the reduction of CO 2 .Second, caustic NaOH solution dissolves more CO 2 than does pure water.The initial pH value of 0.2 N NaOH solution was approximately 13.3, and decreased to nearly 7.3 after bubbling CO 2 in the reactor.Notably, photoreduction may have been accelerated by the high concentration of HCO 3 -.The high yields of methanol can be obtained at the elevated CO 2 pressure of the reactor for the same reason.As shown in Fig. 13, the methanol yield clearly increased with the pressure of CO 2 up to 125 kPa, but decreased with further increases of pressure.Mizuno et al. also observed similar phenomena 20.Higher molecular-weight hydrocarbons, such as ethanol, might be converted from methanol at higher CO 2 pressures.A trace of ethanol was detected in the reaction at the two higher pressures, but was too small to be quantified.Fig. 14 shows that the methanol first increases then decreases with the amount of catalyst charged in the reactor.A higher concentration of catalyst is expected to correspond to greater absorption of UV energy, and thus a higher methanol yield.However, the yields of methanol begin to decline when the concentrations of catalyst exceed 1 g/l.The penetration of UV light is cloaked in the reactor by the large quantity of catalyst in aqueous solution.The UV absorption of the outer catalyst is thus reduced, but the re-oxidation rate of methanol increases with the charge of the catalyst in the reactor.Consequently, the overall methanol yield decreases with excess catalyst. Based on the above results, a photocatalytic mechanism is proposed and illustrated in Fig. 15 to describe the reduction of CO 2 with H 2 O. Molecules of CO 2 (or HCO 3 -) and H 2 O interact with trapped electrons on the Cu cluster.The reduction of CO 2 and the decomposition of H 2 O proceed competitively, and methanol is formed.The OH radicals are produced from OH - by scavenging holes on the TiO 2 surface, and these radicals may react with the carbon species formed from CO 2 to produce methanol.Free oxygen is also generated from the oxidation of OH -with holes, then can be partially consumed by the re-oxidation of methanol."
  },
  {
    "title": "Conclusions",
    "content": "Methanol was favorably produced on TiO 2 and Cu/TiO 2 catalysts in a CO 2 /NaOH aqueous solution under UV irradiation.Experimental results demonstrated that the homogeneous hydrolysis of titanium(IV) butoxide via the improved sol-gel route was a promising technique for preparing photocatalysts with uniform nanoparticles.An optimal Cu-loaded titania is a highly efficient photocatalyst for CO 2 reduction since copper is an effective electron trapper, able to reduce the recombination of electron-hole pairs.The OH -in aqueous solution is a powerful hole scavenger, enhancing the photocatalytic reactivity.Although the quantum and energy efficiencies so far are not much higher than those of natural photosynthesis in this study, the catalytic reduction of CO 2 has great advantage over green plants of not having to support a living system.Ideally, the transformation of photo to chemical energy by a non-living catalyst should be more efficient than that by a life-supporting one.The photocatalytic reduction of CO 2 is still in its infancy.There are still many opportunities for improvement.A highly efficient catalyst is the key to this field. Fig. 1.The procedure of catalysts preparation. Fig. 2. Schematic of photocatalytic reaction. Fig. 3. XRD spectra of TiO 2 and Cu/TiO 2 .(a) 6.7 wt. Cu/ TiO 2 ; (b) 2.0 wt. Cu/ TiO 2 ; (c) TiO 2 ; (d) P25; (e) JRC-2. Fig. 4. TEM photographs (a) TiO 2 , (b) 3.3 wt. Cu/TiO 2 . Fig. 6.XPS spectra of Ti2p of catalysts. Fig. 7. XPS spectra of Cu2p of catalysts. Fig. 8. Time dependence on the methanol yields of various catalysts. Photon flux absorbed by catalyst (measured photon flux without catalyst) -(measured photon flux with catalyst in reactor) 138 W/cm 2 .Outer surface area of reactor 346.4cm 2 .Each photon energy hc/ (6.6262 10 -34 )(3 10 8 )/(2.54 10 -7 ) 7.826 10 -19 J.Total photons absorbed by catalyst in reactor absorbed photon flux (W/cm 2 ) outer surface area of reactor, (cm 2 ) radiation time (s)/each photon energy, (J)/6.02 10 23 2189 mol. Fig. 9.The fluorescence spectra of catalysts. Fig. 10.Effect of Cu loading amount on copper dispersion and methanol yield under 6 h UV irradiation.(CO 2 pressure: 125 kPa). Fig. 11.Methanol yields of two 2.0 wt. Cu/TiO 2 catalysts under long-term UV irradiation (CO 2 pressure: 125 kPa). Fig. 12.The dissolved O 2 of two 2.0 wt. Cu/TiO 2 catalysts during reaction. Fig. 13.Effect of CO 2 pressure on methanol yields at 6 h in 2.0 wt. Cu/TiO 2 . Fig. 15.Mechanism of CO 2 photocatalytic reduction on Cu/TiO 2 . The properties of catalysts a Estimated from FWHM of XRD by Scherrer equation.b Estimated from UV-VIS spectra.c From manufacturer. The element molar ratio of catalysts calculated from XPS and EDX analysis P25 are 3.27 and 3.47 eV, respectively, while those of sol-gel TiO 2 and Cu/TiO 2 are nearby 3.00 eV. The methanol yield, energy efficiency ( E ), quantum efficiency ( Q ) and turnover frequency (for Cu site) of catalysts lists the TOFs of Cu/TiO 2 catalysts for known Cu dispersion.The TOF of 0.6 wt. Cu/TiO 2 catalysts gave the highest value near 58, and TOFs decrease with increasing Cu loadings.Obviously, more Cu loading can increase methanol yield because of the amount of active sites.However, the photoactivity (TOF) of each Cu site declines with more Cu loading on TiO 2 surface.Therefore, catalysts with more than 2 wt.Cu loading cannot further increase the methanol yield due to the decreasing TOF.Furthermore, excess Cu loading can mask the TiO 2 surface, reducing the photoexciting capacity of TiO 2 .There exists an optimum amount of copper loading, around 2 wt. under the experimental conditions of this work. The authors would like to thank the China Petroleum Corporation and the National Science Council of the Republic of China for financially supporting this research under contract no.NSC 87-CPC-E-002-007."
  }
]