[{"title": "Doi", "content": "10.1016/j.molcata.2015.10.034"}, {"title": "Article_Title", "content": "Effect of ligand derivatization at different positions on photochemical properties of hybrid Re(I) photocatalysts"}, {"title": "Abstract", "content": "Hybrid CO 2 -reduction photocatalysts based on Re(bpy)(CO) 3 Cl, where bpy is 2,2 -bipyridine, were synthesized in order to investigate the effect of different ligand derivatization strategies on photochemical properties of the hybrid Re(I) systems.Derivatization of the bpy ligand was carried out at the 4,4 -and 5,5 -positions with electron-withdrawing amide groups.The derivatized ligands were grafted on mesoporous silica via a dipodal silane coupling agent and were further coordinated with Re(I).The synthesized hybrid photocatalysts were studied using spectroscopic techniques, including UV-visible, in situ infrared and electron paramagnetic resonance (EPR) spectroscopy, and tested in photochemical CO 2 reduction.An interesting light-induced color change was observed for the hybrid photocatalyst involving derivatization of the bpy ligand at the 5,5 -positions.Combined UV-visible and EPR studies indicated that in the reduced form of this hybrid photocatalyst electron density was more localized on the bpy ligand than on the Re(I) center.Further studies with in situ infrared spectroscopy demonstrated possible formation of a carbonate-bridged binuclear Re(I) species on this hybrid photocatalyst.Our results are particularly relevant to developing new molecular and hybrid photocatalytic systems which involve extensive derivatization of coordinating ligands with functional groups for improved solar energy conversion."}, {"title": "Experimental", "content": "Hydrochloric acid, 2,2 -bipyridine-4,4 -dicarboxylic acid (98), thionyl chloride (99.5), dichloromethane (DCM), toluene, diethyl ether, dimethylformamide (DMF, 99.5), triethanolamine (TEOA, 99), pentacarbonylchlororhenium(I) (98), tris(2,2 -bipyridine) dichlororuthenium(II) hexahydrate (99.95 trace metals basis, denoted \"Ru(bpy) 3 2 \") were obtained from Sigma-Aldrich.2,2 -Bipyridine-5,5 -dicarboxylic acid (98) was obtained from TCI America. N,N-bis 3-(trimethoxysilyl)propylethylenediamine (EDTMS, 95) was obtained from Gelest.All reagents were used without further purification. Mesoporous silica (SiO 2 ) was synthesized according to previous work by Zhao et al. 35.Two diimine-tricarbonyl Re(I) complexes (4 and 5, Fig. 1) and a dipodal silane coupling agent (EDTMS, denoted \"D\", Fig. 1) were utilized to synthesize hybrid Re(I) photocatalysts by grafting the Re(I) complexes on mesoporous SiO 2 surfaces.The Re(I) complexes feature two derivatized bpy ligands, 2,2 -bipyridine-4,4 -dicarboxylic acid and 2,2 -bipyridine-5,5 -dicarboxylic acid.In a typical synthesis of hybrid Re(I) photocatalysts, 100 mg of mesoporous SiO 2 was dried at 100 C for 2 h and dispersed in 50 ml of dry toluene, to which 75 l EDTMS were added under constant stirring and refluxed for 48 h under nitrogen.The surface functionalized SiO 2 was washed with toluene, diethyl ether, and DCM before collected by centrifugation.In a separate solution, 25 mg 2,2 -bipyridine-4,4 -dicarboxylic acid or 2,2 -bipyridine-5,5 -dicarboxylic acid were dissolved in 10 ml of thionyl chloride.This solution was then refluxed for 12 h and dried under vacuum.The resulting solid was dispersed in 10 ml DCM and was added drop wise under nitrogen to the functionalized SiO 2 which was dispersed in 30 ml of DCM.The combined solution was then refluxed for 12 h and washed with toluene, diethyl ether, and DCM.The resulting product was dispersed in 40 ml of dry toluene, to which 50 mg of pentacarbonylchlororhenium(I) were added.This final solution was refluxed for 12 h under nitrogen and again washed with toluene, diethyl ether, and DCM.The resulting hybrid photocatalyst, denoted as \"4-D-SiO 2 \" or \"5-D-SiO 2 \", was then collected as a yellow powder. Homogenous Re(I) complexes were synthesized according to previous work by Wang et al. 36.The synthesis of 4 started with 1 mmol of 2,2 -bipyridine-4,4 -dicarboxylic acid dispersed in 40 ml of toluene, to which 1 mmol of pentacarbonylchlororhenium(I) was added.The resulting mixture was refluxed for 6 h under nitrogen, and was then stored at 0 C for 1 h.The mixture was purified by filtration and was concentrated under reduced pressure to give 4. The synthesis of 5 was achieved via the same method by mixing 1 mmol 2,2 -bipyridine-5,5 -dicarboxylic acid in 40 ml of m ethanol with 1 mmol of pentacarbonylchlororhenium(I). Optical spectra of synthesized samples were obtained using a Cary 50 Bio spectrophotometer outfitted with both a transmission cell (for homogeneous solutions) and a Barrelino diffuse reflectance probe (for powder samples).DRIFTS spectra were collected on a Nicolet 6700 FTIR spectrometer equipped with a Harrick Praying Mantis diffuse reflectance accessory.Elemental analysis of the synthesized hybrid photocatalysts was performed via acid digestion utilizing a Varian Vista AX inductively coupled plasma atomic emission spectrometer.EPR spectra were collected on an X-band (9.5 GHz) Bruker ELEXSYS E-500 cw-EPR/ENDOR spectrometer at room temperature. In photocatalytic testing, a certain amount of 4-D-SiO 2 or 5-D-SiO 2 was dispersed in an air-tight pyrex test tube containing 4 ml of DMF and TEOA (volume ratio 3:1).The loading of Re(I) catalysts was controlled to be 0.8 mol in the reaction solution by adjusting the mass of the hybrid photocatalysts.In some experiments, 3 mg of Ru(bpy) 3 2 was added as a photosensitizer to enhance light harvesting in the visible region.The reaction solution was purged with CO 2 (Airgas, 99.999) for 30 min prior to photocatalysis.A Xe arc lamp equipped with a water filter and an AM 1.5 optical filter was used as the light source.For all testing, the light intensity was fixed at 30 mW/cm 2 .While the reaction solution was constantly stirred under light irradiation, the head space was sampled using a gas tight syringe for product analysis using an Agilent 7820 GC equipped with a TCD detector and a 60/80 Carboxen 1000 column."}, {"title": "Results_and_discussion", "content": "In this study, a dipodal silane coupling agent (D, Fig. 1) was utilized to graft the diimine-tricarbonyl Re(I) catalyst on SiO 2 surfaces following a procedure similar to that in our previous studies, where amide bonds were formed on surfaces to serve as covalent linkages 17,25,26.Each dipodal molecule has two NH groups available for further functionalization with bpy ligands.Elemental analysis of the synthesized hybrid photocatalysts shows that the amounts of rhenium are 2.8 mol and 0.7 mol per 10 mg of 5-D-SiO 2 and 4-D-SiO 2 , respectively.It is unclear why exactly the loadings are different for these two samples.One contributing factor is the different orientation of the two derivatized bpy ligands upon surface immobilization.In 5-D-SiO 2 , the derivatized bpy groups are likely perpendicular to the SiO 2 surface upon the formation of amide bonds in which one 2,2 -bipyridine-5,5 -dicarboxylic acid only reacted with one surface NH group.In contrast, each 2,2bipyridine-4,4 -dicarboxylic acid moiety could form amide bonds with two adjacent surface NH groups in 4-D-SiO 2 , and the derivatized bpy groups in this sample are likely in parallel to the SiO 2 surface 25. In previous studies, we have utilized spectroscopic techniques to thoroughly characterize molecular Re(I) catalysts grafted on silica surfaces to ensure structural integrity of the Re(I) centers 17,25,26.In this work, the presence of diimine-tricarbonyl Re(I) units in the hybrid photocatalysts was monitored using a diffuse reflectance UV-visible probe and DRIFTS.Both 5-D-SiO 2 and 4-D-SiO 2 exhibit a strong absorption band around 400 nm (Fig. 2), which is associated with the metal-to-ligand charge transfer (MLCT) transition of the diimine-tricarbonyl Re(I) units.In comparison with the MLCT band of Re(bpy)(CO) 3 Cl at 370 nm,this represents a 30 nm shift in the MLCT band as a result of derivatizing the bpy ligand with electron-withdrawing amide groups 25.The results shown in Fig. 2 indicate that derivatization at the 4,4 -and 5,5 -positions with COOH groups had the same effect on the MLCT band of the Re(I) compound. Fig. 3 shows the DRIFTS spectra of 4-D-SiO 2 and 5-D-SiO 2 mixed with KBr.Two intense Re(I)-carbonyl bands at 2035 cm -1 and 1930 cm -1 are seen in both spectra, together with other absorptions (not labeled).These absorption features are similar to those in the DRIFTS spectra of other hybrid Re(I) photocatalysts reported in our previous studies 17,25,26.Therefore, diimine-tricarbonyl Re(I) units are present in both 4-D-SiO 2 and 5-D-SiO 2 , mostly in the form of covalently attached molecular catalysts.Since both hybrid photocatalysts were thoroughly washed with solvents during synthesis, the presence of physically adsorbed Re(I) compound is very unlikely.The synthesized hybrid photocatalysts were tested in CO 2 reduction in the presence of triethanolamine (TEOA) as a sacrificial electron donor under simulated solar irradiation.Under the experimental conditions employed this study, CO was observed as the major product in CO 2 reduction using the hybrid photocatalysts; no significant formation of H 2 or formic acid was observed.In the presence of Ru(bpy) 3 2 as a photosensitizer, turnover numbers for CO production of 12.7 and 8.8 were obtained for 4-D-SiO 2 and 5-D-SiO 2 , respectively, after photocatalysis for 4 h (Fig. 4).In the absence of Ru(bpy) 3 2 , the amount of CO produced was negligible for both 4-D-SiO 2 and 5-D-SiO 2 .These numbers are relatively lower than those obtained using similar hybrid Re(I) photocatalysts reported in our previous studies 25, likely due to the low light intensity employed in this study.We are also mindful that molecular diffusion of Ru(bpy) 3 2 in the mesopores could be significant in 4-D-SiO 2 and 5-D-SiO 2 with different catalyst loadings.However, the same comparison in activity was observed using similar hybrid photocatalysts prepared by grafting 4 and 5 on a non-porous silica, in which molecular diffusion does not significantly affect photocatalysis. An interesting observation on the synthesized hybrid photocatalysts is the color change of 5-D-SiO 2 during photocatalytic CO 2 reduction in the absence of the Ru(bpy) 3 2 photosensitizer.Upon light irradiation, the color of a reaction solution containing 5-D-SiO 2 quickly changed from light yellow to green.At room temperature, the green color gradually decayed in a few hours after the light was turned off, and re-appeared when light irradiation resumed.Control experiments indicated that the photocatalyst, TEOA (or other amine-based electron donor), CO 2 and light irradiation were all necessary for the color change to occur, and that the color change was associated with the Re(I) complex on 5-D-SiO 2 .In addition, the color change was immediately reversed as soon as the reaction solution was exposed to air or purged with Ar, even in the presence of continuous light irradiation.Such color change was not observed for 4-D-SiO 2 . Close examination of spectroscopic results indicated that the green color of 5-D-SiO 2 upon light irradiation is associated with two absorption bands around 450 nm and 620 nm.To study this phenomenon, color change of the hybrid photocatalyst was monitored using a UV-visible spectrophotometer in the transmission mode.Specifically, a small amount of the reaction solution containing well-dispersed 5-D-SiO 2 , TEOA and CO 2 in a sealed quartz cuvette was exposed to simulated solar irradiation for 5 min.Optical spectra of the solution was collected before and after the light irradiation (Fig. 5).Collection of spectra continued after the light irradiation was removed.Difference spectra were obtained by subtracting the initial spectrum (before light irradiation) from subsequent ones (Fig. 5, inset).From the spectra shown in Fig. 5, it is clearly seen that the two absorption bands around 450 nm and 620 nm appeared upon light irradiation and that the two bands gradually decayed when the irradiated sample was placed in dark (Fig. 5,inset).In contrast, formation of neither band was observed for 4-D-SiO 2 under the same experimental conditions (Fig. 6). In order to probe possible reasons for the observed color change, homogenous samples of derivatized Re(I) compounds, 4 and 5 (see Fig. 1 for molecular structures), were synthesized and tested in a similar manner.Specifically, the homogeneous samples in DMF were each mixed with TEOA and saturated with CO 2 prior to light irradiation.Optical spectra of the solutions were collected before and after irradiation with simulated sunlight (Fig. 7).The color of the solution containing 5 immediately turned green upon light irradiation.Two broad peaks around 450 nm (as a shoulder) and 620 nm appeared in the optical spectrum of the solution of 5 collected after exposure to light, while the intensity of the MLCT band around 400 nm decreased significantly (Fig. 7b).In contract, no noticeable green color was observed in the solution of 4 upon light irradiation, nor did the 450 nm and 620 nm peaks show up in its optical spectrum collected after light irradiation (Fig. 7a).In addition, the MLCT band of 4 disappeared completely, likely due to the Light-induced redox processes in the hybrid photocatalysts were further probed with EPR spectroscopy at room temperature.Specifically, 4-D-SiO 2 or 5-D-SiO 2 in powder form was mixed with TEOA and purged with CO 2 prior to collecting EPR spectra.Fig. 8 shows EPR spectra of 4-D-SiO 2 and 5-D-SiO 2 under continuous light irradiation.A broad resonance centered at g 2 is seen in both spectra (Fig. 8).The intensity of this signal continued to increase upon prolonged light irradiation.For both samples, this EPR signal was not observed without light irradiation.These observations indicate that paramagnetic, one-electron reduced Re(I) species formed in both 4-D-SiO 2 and 5-D-SiO 2 photochemically in the presence of TEOA and CO 2 .As mentioned earlier in the text, the presence of both an electron donor (TEOA in this study) and CO 2 is required for the light-induced color change observed for 5 and 5-D-SiO 2 .The detection of this paramagnetic species with room-temperature EPR suggests that binding of CO 2 to the Re(I) center in the presence of TEOA contributed to the stabilization of the one-electron reduced Re(I) species. In addition, the spectrum of 4-D-SiO 2 (Fig. 8a) shows some resonance features originated from hyperfine interactions between unpaired electrons with Re(I) nuclei 39, which is similar to the observations in our previous EPR studies of a hybrid Re(I) photocatalyst 25.Less significant hyperfine coupling features are seen in the spectrum of 5-D-SiO 2 .This comparison supports our conclusion that the electron density in reduced 5-D-SiO 2 is more localized on the bpy ligand while in reduced 4-D-SiO 2 the electron density is more localized on the Re(I) center. In a study by Argazzi et al., Ru(II) polypyridyl complexes were derivatized with COOH groups for use in dye-sensitized solar cells 40.The researchers found that moving the carboxylate moieties from the 4,4 -positions to the 5,5 -positions lowered the energy of the bpy ligand 40.Subsequently, the Ru(II) photosensitizers based on 2,2 -bipyridine-5,5 -dicarboxylic acid were less efficient at converting photons into electrons because of more significant nonradiative decay of the excited states of the Ru(II) sensitizers 40.In this present study, derivatizing the bpy ligand at different positions resulted in difference in charge density distribution in the reduced hybrid photocatalysts.This might partially account for the different photocatalytic activity of 4-D-SiO 2 and 5-D-SiO 2 shown in Fig. 4. The surface chemistry and photo-induced events of 4-D-SiO 2 and 5-D-SiO 2 were further investigated with in situ DRIFTS spectroscopy in the presence of TEOA and CO 2 .Six overlapping Re(I)-carbonyl bands are clearly seen in the DRIFTS spectra of both samples collected prior to light irradiation (Fig. 9), indicating the presence of two different surface Re(I) species.Based on previous studies 26, the three carbonyl bands at 2021, 1919 and 1897 cm -1 are associated with the CO 2 -bound Re(I) adduct, Re(Lbpy)(CO) 3 (OOC-OCH 2 CH 2 NR 2 ).Another set of carbonyl bands at 1995, 1876 and 1851 cm -1 have been assigned to a Re(I) hydroxyl species, Re(L-bpy)(CO) 3 (OH). It should be noted that an infrared band around 2005 cm -1 is present in the spectrum of 5-D-SiO 2 (Fig. 9b) but not in the spectrum of 4-D-SiO 2 (Fig. 9a).Although we lack sufficient data for definitive assignment of this peak, it is likely associated with the CO 2 -bound Re(I) adduct, Re(L-bpy)(CO) 3 (OOC-OCH 2 CH 2 NR 2 ), in the reduced form since peaks at 2005, 1894 and 1878 cm -1 were observed in the infrared spectrum of a reduced Re(I) catalyst 41.Formation of this reduced Re(I) species in 5-D-SiO 2 likely occurred when the sample was exposed to ambient light conditions while being loaded into the DRIFTS cell.The comparison shown in Fig. 9 clearly indicates that certain features of 5-D-SiO 2 , particularly ligand derivatization at the 5,5 -positions, facilitated the formation of this reduced Re(I) species under ambient light conditions.Further formation of this Re(I) species upon light irradiation was observed on both 5-D-SiO 2 and 4-D-SiO 2 , as will be discussed in the following paragraphs.In the DRIFTS cell, the hybrid photocatalysts were irradiated with simulated solar light under a CO 2 atmosphere and spectra were collected after light irradiation for various times.Difference spectra were obtained by subtracting spectra collected prior to light irradiation (i.e., the spectra in Fig. 9) from corresponding ones collected after light irradiation.Fig. 10 shows the difference spectra of 4-D-SiO 2 and 5-D-SiO 2 , which provide important information regarding photo-induced events on the two samples.In the difference spectra shown in Fig. 10, negative peaks are present around 2025, 1920 and 1900 cm -1 (not labeled) indicating the photochemical conversion of Re(L-bpy)(CO) 3 (OOC-OCH 2 CH 2 NR 2 ) on both 4-D-SiO 2 and 5-D-SiO 2 .This CO 2 -bound Re(I) adduct was suggested to be the real catalyst in many CO 2reduction systems using diimine-tricarbonyl Re(I) photocatalysts 38.The peak at 2005 cm -1 and two broad absorptions around 1876 cm -1 and 1689 cm -1 quickly appeared in the spectra of both samples upon light irradiation (Fig. 10).The peaks at 2005 and 1876 cm -1 are likely associated with the reduced CO 2 -bound Re(I) adduct, as discussed earlier.We attribute the absorption at 1689 cm -1 to the formation of a tertiary carbamate 42 as a product in the reaction between TEOA and CO 2 , both of which are present in large excess in the DRIFTS cell used in this study. We notice that the negative peak around 2025 cm -1 in Fig. 10b became less negative after t 5 min, suggesting the formation of a new Re(I)-carbonyl species on 5-D-SiO 2 under continued light irradiation.Three additional absorptions at 1994, 1843 and 1720 cm -1 are present in the difference spectra of 5-D-SiO 2 only and these three peaks started to appear as light irradiation continued after t 5 min (Fig. 10b).The DRIFTS spectra were further analyzed using another set of difference spectra which were obtained by subtracting spectra collected after light irradiation for t 5 min from corresponding ones collected after light irradiation for t 15, 30, and 60 min.These new difference spectra shown in Fig. 11 are used to describe changes on the hybrid photocatalysts after continued light irradiation beyond t 5 min. The difference spectra shown in Fig. 11a are very similar to those shown in Fig. 10a, indicating that no new photochemical events occurred on 4-D-SiO 2 after t 5 min.In Fig. 11a, the negative peaks observed around 2025, 1920 and 1900 cm -1 (not labeled) are related to photochemical conversion of Re(L-bpy)(CO) 3 (OOC-OCH 2 CH 2 NR 2 ).However, the difference spectra shown in Fig. 11b are different from those in Fig. 10b.Continued light irradiation (after t 5 min) resulted in (i) disappearance of the reduced CO 2bound Re(I) adduct associated with the absorptions at 2005 and 1894 cm -1 ; and (ii) further formation of the Re(I) hydroxyl species characterized by the bands at 1994 and 1843 cm -1 in 5-D-SiO 2 (Fig. 11b).Significant formation of the Re(I) hydroxyl species was not observed in 4-D-SiO 2 under continued light irradiation (Fig. 11a).Photochemical production of Re(L-bpy)(CO) 3 (OH) from Re(L-bpy)(CO) 3 (OOC-OCH 2 CH 2 NR 2 ) was previously observed on a similar hybrid system and was suggested to be a possible deactivation pathway for Re(I)-based photocatalysts 26.Therefore, formation of the Re(I) hydroxyl species in 5-D-SiO 2 might account for its lower photocatalytic activity than 4-D-SiO 2 in CO 2 reduction (Fig. 4). The appearance of two additional infrared bands around 2025 and 1720 cm -1 was also observed in the spectra shown in Fig. 11b.The band at 2025 cm -1 should be more intense than it appears in Fig. 11b due to concurrent photochemical conversion of Re(Lbpy)(CO) 3 (OOC-OCH 2 CH 2 NR 2 ) which resulted in a negative peak in the same position (see Fig. 10b).We attribute this Re(I)-carbonyl band at 2025 cm -1 and the other absorption at 1720 cm -1 (C O in the carbonate bridge) to possible formation of a carbonate-bridged binuclear Re(I) complex, (CO) 3 (L-bpy)Re-OCO 2 -Re(L-bpy)(CO) 3 , in 5-D-SiO 2 .The absorption at 1720 cm -1 would be associated with the C O stretching mode of the carbonate bridge.Two other Re(I)carbonyl bands at 1893 and 1852 cm -1 were expected for this binuclear complex 43, but were not clearly seen in Fig. 11b due to the overlapping and subtraction of multiple carbonyl bands in this region.According to the theoretical studies by Agarwal et al., this binuclear, carbonate-bridged Re(I) complex is a byproduct in CO 2 reduction following a binuclear pathway which produces one CO molecule from two Re(I) centers and two CO 2 molecules 33.In 5-D-SiO 2 , the close proximity of Re(I) centers on the dipodal silane coupling agent likely promoted this binuclear pathway.Further spectroscopic studies using isotope labeling are underway to fully explore the binuclear chemistry of hybrid CO 2 -reduction photocatalysts including 5-D-SiO 2 ."}, {"title": "Conclusions", "content": "In summary, two hybrid CO 2 -reduction photocatalysts based on Re(bpy)(CO) 3 Cl have been successfully synthesized and characterized with UV-visible, in situ DRIFTS and EPR spectroscopies.Synthesis of the hybrid photocatalysts involved derivatization of the bpy ligand with amide groups and grafting on mesoporous silica via a dipodal silane coupling agent.In this study, derivatization of the bpy ligand at the 5,5 -positions resulted in an interesting color change of the hybrid photocatalyst upon light-induced reduction, presumably due to localization of electron density on the bpy ligand.In comparison, electron density was found to be localized more on the Re(I) center in the reduced hybrid photocatalyst featuring ligand derivatization at the 4,4 -positions.Such differences in electron density distribution, as well as the difference in proximity and geometry of the Re(I) catalysts on surfaces, are likely correlated with photochemical events relevant to CO 2 -reduction catalysis observed in the hybrid photocatalysts.In addition, our results using in situ DRIFTS spectroscopy demonstrated possible formation of a carbonate-bridged binuclear Re(I) species on the hybrid photocatalyst prepared by derivatizing the bpy ligand at the 5,5 -positions under light irradiation and in the presence of an electron donor and CO 2 . Fig. 1.Molecular structures of two diimine-tricarbonyl Re(I) complexes, 4 and 5, and the dipodal silane coupling agent. Fig. 2. Diffuse reflectance UV-visible spectra of (a) 4-D-SiO2 and (b) 5-D-SiO2 in powder form.Barium sulfate was used as the background. Fig. 3. DRIFTS spectra of (a) 4-D -SiO2 and (b) 5-D-SiO2 mixed with KBr. Fig. 4. CO production in photocatalytic CO2 reduction using 4-D-SiO2 (a, c) and 5-D-SiO2 (b, d) under simulated solar irradiation.In testing (a) and (b), Ru(bpy)3 2 was added as an additional photosensitizer.Light intensity was fixed at 30 mW/cm 2 for all photocatalytic testing. Fig. 5. Optical spectra of a solution containing 5-D-SiO2, TEOA and CO2 before (a, black line) and after (b, blue line) light irradiation for 5 min.Additional spectra were collected every 15 min after the light was turned off in order to obtain difference spectra (inset) which demonstrate the decay of the blue color in dark.(For interpretation of the references to colour in this figure legend, the reader is referred to the web version of this article.). Fig. 6.Optical spectra of a solution containing 4-D-SiO2, TEOA and CO2 before (a, black line) and after (b, red line) light irradiation for 5 min.Similar to Fig. 5, difference spectra (inset) were obtained by subtracting the spectrum before light irradiation.(For interpretation of the references to colour in this figure legend, the reader is referred to the web version of this article.). Fig. 7. Optical spectra of (a) 4 and (b) 5 in the presence of TEOA and CO2 after light irradiation.Corresponding spectra before light irradiation are also included (black lines).Catalyst concentration was 0.45 mM for both samples. Fig. 8. EPR spectra of (a) 4-D-SiO2 and (b) 5-D-SiO2 under light irradiation.The powder samples used in EPR studies were mixed with TEOA and purged with CO2 prior to light irradiation.Spectra were collected at room temperature. Fig. 9. DRIFTS spectra of (a) 4-D-SiO2 and (b) 5-D-SiO2 in the presence of TEOA and CO2.The spectra were collected prior to light irradiation at room temperature. Fig. 10.Difference DRIFTS spectra of (a) 4-D-SiO2 and (b) 5-D-SiO2 in the presence of TEOA and CO2.The difference spectra were obtained by subtracting spectra collected prior to light irradiation (t 0) from corresponding spectra collected after light irradiation for different times (5, 15, 30 and 60 min). Fig. 11.Difference DRIFTS spectra of (a) 4-D-SiO2 and (b) 5-D-SiO2 in the presence of TEOA and CO2.The difference spectra were obtained by subtracting spectra collected at t 5 min from corresponding spectra collected at t 15, 30 and 60 min. This material is based upon work supported by the U.S. National Science Foundation under a CAREER Award (CHE-1352437).We are grateful to Chao Liu and Dr. Roy Planalp for helpful discussions and assistance in various aspects of experiments."}]