[{"title": "Doi", "content": "10.1016/j.cattod.2011.02.055"}, {"title": "Article_Title", "content": "Photocatalytic reduction of CO2 to hydrocarbons using AgBr/TiO2 nanocomposites under visible light"}, {"title": "Abstract", "content": "Urgent development of effective and low-cost technologies for reduction CO 2 is needed to address global warming caused by atmospheric CO 2 and the depletion of fossil fuels.In this investigation, an effective photocatalytic reduction of CO 2 using AgBr/TiO 2 photocatalyst under visible light ( 420 nm) was studied.The nanostructured AgBr/TiO 2 photocatalyst was prepared by the deposition-precipitation method in the presence of cetyltrimethylammonium bromide (CTAB), and characterized by X-ray diffraction (XRD), diffuse reflectance spectra (DRS), scanning electron microscopy (SEM) and transmission electron microscopy (TEM).Their photocatalytic activities were evaluated by the reduction yield in the presence of CO 2 and water.The experiment results showed that 23.2 AgBr/TiO 2 had relatively high reduction yields under visible-light irradiation for 5 h, with a methane yield of 128.56, methanol yield of 77.87, ethanol yield of 13.28, and CO yield of 32.14 mol g -1 , respectively.The highly efficiently photocatalytic activities of AgBr/TiO 2 in the reduction process of CO 2 is attributed to its strong absorption in the visible-light region.In addition, it was found that AgBr/TiO 2 photocatalyst was stable in the repeated uses under visible light irradiation, due to the transfer of photoexcited electrons from the conduction band of well-dispersed AgBr to that of TiO 2 ."}, {"title": "Experimental", "content": "TiO 2 (Degussa P25) powder with an average particle size of 30 nm and surface area of 50 m 2 g -1 was purchased from Degussa AG Company as a regular TiO 2 catalyst.CO 2 gas (99.99) was obtained from Foshan Ruike Gas Co., Ltd. in China.Cetyltrimethylammonium bromide (CTAB, C 16 H 33 N (CH 3 ) 3 Br -; purity: 98) was purchased from Tianjing Fuchen Chemical Reagent Co., Ltd. in China.AgNO 3 with analytical grade was purchased from Guangdong Guanhua Chemical Co., Ltd. in China.Other chemicals with analytical grade were obtained as reagents and used without further purification.Deionized water was used throughout this study. AgBr/TiO 2 was prepared by the deposition-precipitation method in the presence of cation surfactant of CTAB 13.An appropriate amount of TiO 2 (P25) based on TiO 2 content in the sample was added to 100 mL of CTAB aqueous solution with a concentration of 0.01 M (10 times above the CMC of CTAB 9.8 10 -4 M) 21, and the suspension was sonicated for 30 min and then stirred magnetically for 30 min.Then 0.0012 mol of AgNO 3 in 2.3 mL of amomonia hydroxide (25 wt. NH 3 ) was quickly added to the suspension.In this process, cationic surfactant CTAB was adsorbed onto the surface of TiO 2 at alkaline condition to limit the number of nucleation sites for the formation of AgBr aggregates, leading to well-dispersed AgBr on TiO 2 support.In addition, the amount of bromide ion from CTAB is more than sufficient to precipitate Ag from the added The prepared AgBr/TiO 2 powders were first analyzed by Xray diffraction (XRD) method using a diffractometer (Bruker AXS, Germany) with radiation of Cu target (K , 1.54059A).Scanning electron microscopy (SEM) images were obtained with a JSM-6330F field emission scanning electron microscope (JEOL, Japan) using an acceleration voltage of 20 kV.The content of AgBr in the catalyst was determined by SEM-EDS-EBSD thermal field emission scanning electron microscopy (JEOL, Japan).The AgBr/TiO 2 powders were then examined by a transmission electron microscope (TEM, JEM-2010HR).X-ray photoelectron spectroscopy (XPS) data was recorded with the AlK line at 100 W using a Perkin-Elmer PHI-5600ci.The catalysts were further examined by a spectrophotometer (Shimadzu UV-PC3101PC) with an integrating sphere (Specular Reflectance ATT.5DEG) to record their diffuse reflectance spectra (DRS), in which a baseline was corrected by using a calibrated sample of barium sulfate.Zeta potential measurements were performed using a ZetaPALS analyzer (Brookhaven, USA). Photocatalysis reduction was carried out in a stainless steel vessel with valves for evacuation and gas feeding as shown in Fig. 1, in which an O-ring sealed glass window was placed at the top for admitting light irradiation.A 150 W Xe lamp (Shanghai Aojia Lighting Appliance Co., Ltd.) with UV cutoff filter (providing visible light with 420 nm) was used for irradiation.In a typical batch, 0.5 g of prepared AgBr/TiO 2 powder was suspended in 100 ml of 0.2 M KHCO 3 solution in the vessel.The pH value was adjusted by NaOH and HCl to the definite values before the experiment and not controlled during the reaction.Prior to the irradiation, pure CO 2 (99.99), via a flow controller, was passed through the solution for 30 min to remove the oxygen, and then closed maintaining a pressure of 7.5 MPa inside the reactor.During reaction, the powders were continuously agitated to prevent the sedimentation of the catalyst by a magnetic stirrer, and the photocatalytic reaction lasted for 5 h at room temperature.After illumination, small aliquots of the suspension were withdrawn by syringe, filtered through Millipore membranes, and then analyzed.Gas samples were performed with a gas-tight syringe through a septum.Reaction products in liquid phase were analyzed using a gas chromatograph (Agilent HP6890N) equipped with a flame ionization detector (FID) and a HP-5 capillary column (30 m 320 m 0.50 mm).The product in gas phase was analyzed by GC/MS Hewlett-Packard (HP) 6890 gas chromatography with a HP 5973 mass detector.A 60 m length 0.32 mm I.D. 1.8 m film thickness HP-VOC column (Agilent Scientific, USA) was used.The oven was programmed as following rates, the initial temperature of the column was 40 C hold for 2 min, followed by a ramp of 5 C min -1 to 120 C (1 min hold), injection model splitless, for 1 L sample."}, {"title": "Results_and_discussion", "content": "The prepared fresh AgBr/TiO 2 was first examined by XRD as shown in Fig. 2a.The XRD results showed that both anatase and rutile were present in the AgBr/TiO 2 catalyst.In the meantime, the crystalline AgBr was found in the fresh AgBr/TiO 2 at around 2A 26.7 , 30.9 , 44.3 , and 55.0 (Fig. 2b), indicating a hexagonal structure for the synthesized AgBr according to the report by Rodrigues and Uma et al. 20.No XRD peaks attributed to metallic Ag were observed in the spectrum of AgBr/TiO 2 .In our synthesis process, the metallic Ag was not observed, and all of the silver species can be precipitated and deposed by CTAB.In addition, we found that the XRD pattern of used AgBr/TiO 2 after 5 h visiblelight irradiation with a 150 W Xe lamp (Fig. 2c) was almost the same as that of fresh AgBr/TiO 2 , no diffraction peaks assigned to metallic Ag (38.2 , 44.4 , 64.4 and 77.4 ) 23 were detected in the used AgBr/TiO 2 sample.XRD results indicated that AgBr maintained stable after 5 h visible-light irradiation. The used AgBr/TiO 2 was further characterized by XPS measurement.Fig. 3 and 3d 3/2 were observed at 369.5 eV and 375.5 eV.Because the Ag3d photoelectron peaks are relatively insensitive to oxidation state changes, it is impossible to distinguish between Ag(0) metal and Ag(I) 24.However, an Auger parameter analysis using the Ag MNV Auger peak at 1140.0 eV on the binding energy scale clearly indicates that the Ag is in a mono-valent state 24.XPS ananlysis indicated that AgBr maintained stable after 5 h visible-light irradiation. According to earlier studies, we noticed that irradiation led to the coexistence of AgBr and metallic Ag by the combination of interstitial ions with electrons 13,14, although there are some reports related to photostability without any formation of Ag for AgCl/TiO 2 15 and AgI/TiO 2 12 photocatalyst as well.For example, 1.2 wt. Ag was formed after 14 h irradiation in AgBr/TiO 2 14, which is different from our results of no metalic Ag.This might be ascribed to the difference of photocatalytic reduction process by consuming electron in our present study.In addition, recently, Zang et al. reported that dispersing AgBr on TiO 2 to form smaller particles might inhibit the formation of larger cluster and delay AgBr decomposition 14.Therefore, AgBr with a small size would be stabilized by the surrounding support of TiO 2 while AgBr/TiO 2 was applied in the photocatalytic reduction of CO 2 .However, further experiment is necessary to elucidate the stability of AgBr/TiO 2 . The AgBr/TiO 2 catalysts before irraditation were examined by SEM as showed in Fig. 4a.It can be seen from that the prepared fresh AgBr/TiO 2 was spherical particles and the particle size was relatively uniform around 50 m.Although the SEM results did not provide clear information about the size distribution of AgBr on TiO 2 particulates, EDS analysis of AgBr in AgBr/TiO 2 demonstrated that AgBr was uniformly dispersed on TiO 2 surface (Fig. 4b).The mass ratio of AgBr:TiO 2 obtained in the powder was almost closed to the theoretical calculated value of AgBr/TiO 2 , for example, AgBr/TiO 2 with calculated value of 22.0 AgBr content was determined to be 23.2. Fig. 5 showed TEM images of AgBr/TiO 2 .It can be seen that AgBr nanoparticles (black image) with a size of c.a. 5 nm contacted with TiO 2 nanoparticles (Fig. 5a), indicating that AgBr nanoparticles were well dispersed on the surface of TiO 2 nanoparticles.To further obtain the structure information on the interface of TiO 2 and AgBr nanoparticle, the interface of TiO 2 and AgBr nanoparticle was charaterized by HRTEM (Fig. 5b).The interplanar spacing on TiO 2 (0.344 nm) corresponded to the (1 0 1) planes of anatase, while the interplanar spacing on AgBr (0.288 nm) corresponded to the (2 0 0) planes of AgBr, further confirming the contact between the interface of TiO 2 and AgBr nanoparticles.Such a direct contact between the two particles would be crucial for improving the photocatalytic activity of the catalyst. Considering the excellent photosensitive performance of AgBr, AgBr/TiO 2 catalysts were analyzed by UV-vis absorption spectra in the wavelength range of 250-800 nm and the absorption spectra of TiO 2 and AgBr/TiO 2 catalysts were shown in Fig. 6.It can be seen that AgBr/TiO 2 shows an absorption edge at 432 nm.The absorption was attributed to the contribution of AgBr since TiO 2 has no absorption at around this wavelength (Fig. 6a).Compared to TiO 2 catalysts, all AgBr/TiO 2 catalysts had a substantial red shifting of the absorption edge due to dispersed AgBr as well as a better optical absorption generally in the visible region of 400-700 nm with the increasing amounts of AgBr.The plot of the transformed Kubelka-Munch function versus the energy of light illustrates a bandgap of 2.9 eV (432 nm) for 23.2 AgBr/TiO 2 (Fig. 6b).In addition, a broad significant absorption shoulder occurred in the region of 450-700 nm corresponding to the indirect band gap of AgBr 12, consequently, AgBr/TiO 2 is sensitive to the whole visible light region.Thus, it is believed that the extension of light absorbance of AgBr/TiO 2 is an essential condition and would be beneficial to conduct photocatalytic reduction of CO 2 with water to hydrocarbon under visible light irradiation. The photocatalytic reaction activity of prepared photocatalysts was evaluated by reduction of CO 2 with water under the visible light irradiation for 5 h.The gas chromatograph graphs of the photocatalytic products on the prepared AgBr/TiO 2 predominated showed the formation of methane and CO in gas phase, methanol and ethanol in liquid phase.Other products such as formic acid, formaldehyde and hydrogen were not detectable in our GC analysis.In contrast, these products (methanol, ethanol, methane and CO) were neither detected in the dark nor without the presence of photocatalysts, indicating that the presence of both the visible-light irradiation and photocatalyst are indispensable for the photocatalytic reduction of CO 2 with water.Fig. 7a shows the effect of AgBr content on the yield of photocatalytic product using TiO 2 and prepared AgBr/TiO 2 under visible-light irradiation.It can be seen that the product yield is dependent on the content of AgBr.In a batch reaction, the product yield increased with the increase of AgBr content, then decreased as AgBr content exceeded 23.2.The maximum yield of methane, methanol, ethanol, and CO using 23.2 AgBr/TiO 2 under visible light for 5 h reached 128.56, 77.87, 13.28, and 32.14 mol g -1 , respectively.In this study, the experimental results showed that the photocatalytic reduction activity of AgBr/TiO 2 with AgBr content up to 23.2 achieved an effective performance.Evidently, the presence of AgBr plays an important role and can increase the photocatalytic yields of hydrocarbon under visible-light irradiation.However, the excessive AgBr dispersed on the TiO 2 will lead to the aggregation of AgBr, the photogenerated electrons are difficult to be transferred to that of TiO 2 , consequently leading to a relatively lower activity.Therefore, an appropriate ratio of AgBr to TiO 2 can greatly improve the visible-light activity of catalyst. The experimental results in Fig. 7b demonstrate that the calcination temperature also slightly affects the photocatalytic yield of hydrocarbon.It seems that the AgBr/TiO 2 prepared at 500 C achieved the highest yield of hydrocarbon in the reduction of CO 2 due to the good crystallization during the calcination process.It is believed that the high calcination temperature of 700 C resulted in large particles due to the aggregation of nanoparticles, which could reasonably explain the decreased yield of hydrocarbon. The photoreduction process of CO 2 involved H radicals and carbon dioxide anion radicals formed by electron transfer from the conduction band 3,9,10, therefore, the pH value was crucial in the photoreduction of CO 2 .Fig. 7c showed the effect of pH value on the yield of photocatalytic products on AgBr/TiO 2 .It was found that the product yield increased with the pH value to 8.5, and then decreased upon the further increase in the pH value.Obviously, the neutral and weak alkaline pH value is beneficial to the photoreduction of CO 2 .This can be explained by the following reasons: (1) The OH -ions in aqueous solution could act as strong holescavengers and reduce the recombination of hole-electron pairs 9,25,26, beneficial to facilitate the reduction of CO 2 .In contrast, H in aqueous solution could be involved in the electron competition with CO 2 reduction (i.e.H e - H), leading to the less yields of hydrocarbons.(2) More CO 2 can be dissolved in basic solution to form HCO 3 -ions (i.e.CO 2 OH - HCO 3 -) than pure water or acidic solution 27, resulting in a higher yields of hydrocarbons in the photoreduction process.(3) The neutral and weak alkaline pH value is beneficial to the adsorption of CO 2 on the catalyst from the zeta potential result of AgBr/TiO 2 (Fig. 8).It can be seen that the electrostatic force existed between CO 2 and the catalyst due to positively charged catalyst at pH 5.4, while the electrostatic repulsive force existed between CO 2 and the catalyst due to negatively charged at pH 5.4.Therefore, a relatively higher photocatalytic reduction activity was achieved in the neutral and weak alkaline pH range, representing the overall combined effect of the higher concentration of OH -ions but lower electrostatic repulsive force. For the practical application of such a photocatalytic reduction reaction process, not only the photocatalytic activity of a catalyst is important, but its stability is also critical, since AgBr as a component of AgBr/TiO 2 is a photosensitive semiconductor material.Alternatively, both of AgBr/TiO 2 and AgBr were tested for their repeated uses and stability for CO 2 photocatalytic reduction in aqueous solution.As shown in Fig. 9a, it can be seen that AgBr/TiO 2 retained its yield of methane, methanol, ethanol, and CO in 5 repeated uses at 123.67 4.24, 73.42 3.29, 9.50 2.67 and 28.02 3.73 mol/g, respectively.The total yields of the photocatalytic products on AgBr/TiO 2 after the 5 repeated uses remained about 86 of the first run.The results indicated that AgBr/TiO 2 is an effective and chemical-stable catalyst.However, AgBr demonstrated a significant decline of product yield after 3 repeated uses from 36.73 to 0 mol g -1 for methane, 32.16-3.71mol g -1 for methanol, 6.49-1.46mol g -1 for ethanol, and 9.18-0 mol g -1 for CO, respectively (Fig. 9b).The total yields of the photocatalytic products on AgBr after the 3 repeated uses decreased to about 6 of the first run.Furthermore, the used AgBr and AgBr/TiO 2 after repeated uses were examined by XRD measurement.Fig. 10 showed the XRD patterns of the fresh and used AgBr.It can be seen clearly that the crystalline Ag can be found in the used AgBr at around 2A 38.2 (Fig. 10b) compared to that of fresh AgBr (Fig. 10a), indicating a formation of metallic Ag through the photographic process under visible light irradiation.This result indicated that the decreased activity of pure AgBr is ascribed to the decomposition of the catalyst.However, with respect to AgBr/TiO 2 , the XRD results show that AgBr/TiO 2 after repeated use appeared to display no changes as before (not given here), indicating that AgBr nanoparticles well-dispersed on TiO 2 can maintain their stability and photocatalytic activity.In this photocatalytic process, the transfer of photoexcited electrons from the conduction band of well-dispersed AgBr on catalysts to that of TiO 2 is beneficial for the stability of AgBr 14.Therefore in practice, the stability of AgBr/TiO 2 would be a significant advantage for CO 2 photocatalytic reduction under visible light. The mechanism to account for photo-reduction of CO 2 involves the initial photoexcitation of the catalyst, creating the electron-hole pairs under photoexcitation, followed by their transfer to CO 2 and water 272829.For efficient electron transfer between TiO 2 and the semiconductor with narrow band gap, the conduction band of TiO 2 must be more anodic than the corresponding band of the sensitizer.Under visible irradiation, only the semiconductor with narrow band gap is excited, and electrons generated to their conduction band are injected into inactivated TiO 2 conduction band.If the valance band of the sensitizer is more cathodic than the valance band of TiO 2 , hole generated in the semiconductor remains there and cannot migrate to TiO 2 7.Earlier study reported that the AgBr/TiO 2 photocatalyst can be efficiently exited by visible light to generate electron-hole pairs 121314.Indeed, the conduction band of AgBr which is located at c.a. -1.04 eV versus NHE is more cathodic than the conduction band of TiO 2 (-0.5 eV) 7,30.Generally, the higher the difference between conduction bands of two semiconductors, the higher the driving forces of electron injection are 7.Therefore, under visible light irradiation, only AgBr in AgBr/TiO 2 was excited, and the electron in AgBr exited by visible light can transfer from the conduction band of AgBr to that of TiO 2 .This process of electron transfer is faster than the electron-hole recombination between the VB and CB of AgBr 30, thus, plenty of CB-electrons (AgBr) can be stored in the conduction band of TiO 2 .The absence of metallic Ag in the catalyst after irradiation (Fig. 2c) suggested that interstitial ions failed to capture the photogenerated electrons, which confirmed that the photogenerated electrons in AgBr exited by visible light can transfer to the conduction band of TiO 2 .This also can explain the reason why AgBr/TiO 2 exhibited higher photocatalytic activity and stability than the pure AgBr for the photoreduction of CO 2 .The mechanism of the electron transfer in this system can be illustrated in Fig. 11. Furthermore, the possible reaction mechanism of CO 2 with H 2 O on the catalysts can be proposed in the following way (Eqs. (1)-( 10)).The exited holes reacted with adsorbed water molecules on the catalyst surface to form OH radicals and H (Eq.( 2)) 5,28.Subsequently, the interaction of H ions with the excited electrons led to H radicals (Eq.( 3)).Meanwhile, the charge transferred to the conduction band of TiO 2 reacted with CO 2 to form CO 2 -(Eq.( 4)) 9,31.It has been reported that CO 2 -is metastable and factors such as salvation could change the electron affinity of CO 2 32.In this case, CO 2 -anion radicals were formed in water with high dielectric constant and can be greatly stabilized by the solvent, resulting in weak interaction of the radical with the catalyst surface 33.These radicals reacted with each other to produce CO (Eq.( 5)) 10,34.At the same time, carbon radicals (C) were formed from CO by successive reactions (Eqs.( 6)-( 7)) 5,29,34, then CH 3 radicals were formed (Eq.( 8)) 5,34.The CH 3 radicals tends to react with protons to produce methane (Eq.( 9)) 10,28,33,34, methanol (Eq.( 10)) 10,27,28,32.And ethanol might be converted from methanol at higher CO 2 pressures according to Tseng et al.'s report 27. AgBr/TiO 2 visible light e -(CB) H e - H (3) CO e - CO - (6) C H e - CH 2 CH 3 (8) CH 3 OH CH 3 OH (10)"}, {"title": "Conclusions", "content": "In this contribution, the nanostructured AgBr/TiO 2 photocatalyst was prepared by the deposition-precipitation method in the presence of cetyltrimethylammonium bromide (CTAB).The results of characterization showed that AgBr nanoparticles in the AgBr/TiO 2 were well dispersed on the surface of TiO 2 nanoparticles and stabilized by the surrounding support of TiO 2 .The photocatalytic activities of AgBr/TiO 2 photocatalyst was evaluated by the reduction yield in the presence of CO 2 and water under visible light ( 420 nm).The experiment results showed that AgBr/TiO 2 with a 23.2 AgBr content had relatively high reduction yields under visible light irradiation.Moreover, it was found that AgBr/TiO 2 photocatalyst was stable in the repeated uses under visible light due to the transfer of photoexcited electrons from the conduction band of well-dispersed AgBr to that of TiO 2 .This investigation, using AgBr/TiO 2 photocatalyst to reduce CO 2 under visible light, will enrich the fundamental theory not only for efficient CO 2 conversion and fixation, storage of solar energy, but also for solving environmental problems. Fig. 1.Schematic diagram of photocatalytic reduction system: 1, CO2 gas cylinder; 2, flow meter; 3, pressure digital meter; 4, stainless steel vessel; 5, O-ring glass window; 6, Xe lamp; 7, cooling system; 8, gas sampling; 9, liquid sampling; 10, magnetic stirrer; V1, V2, V3, and V4 are valves. Fig. 2. XRD pattern of (a) TiO2, (b) fresh 23.2 AgBr/TiO2, and (c) used 23.2 AgBr/TiO2 after 5 h visible light irradiation (A: anatase, and B: rutile). Fig. 3. XPS peaks of (a) Ag 3d peaks, and (b) Br 3d for used AgBr/TiO2 after 5 h irradiation. Fig. 4. (a) SEM image, and (b) EDS spectrum of 23.2 AgBr/TiO2 before irraditation. Fig. 5. (a) TEM image of AgBr/TiO2, and (b) HRTEM image of AgBr/TiO2. Fig. 6.UV-vis diffuse reflectance spectra of photocatalysts: (a) absorbance vs. lightabsorbed wavelength, (b) Kubelka-Munch function vs. light-absorbed energy. Fig. 7. Yield of photocatalytic products under 5 h visible light irradiation on (a) AgBr content using AgBr/TiO2 sintered at 500 C in pH 8.5 aqueous media, (b) calcination temperature using 23.2 AgBr/TiO2 in pH 8.5 aqueous media, and (c) pH value using 23.2 AgBr/TiO2 sintered at 500 C. Fig. 8. Zeta potential for suspension of AgBr/TiO2 nanoparticles in the presence of 0.2 M KHCO3 solution. Fig. 9. Yield of photocatalytic products on the number of batch runs for (a) AgBr/TiO2, and (b) AgBr. presents XPS spectrum of Ag3d region and Br 3d region for used AgBr/TiO 2 after 5 h irradiation.Two peaks from Ag 3d 5/2 The authors wish to thank the National Natural Science Foundation of China (No. 20877025), the Fundamental Research Funds for the Central Universities (No. 09lgpy20), the Specialized Research Fund for Doctoral Programs of Higher Education from Education Ministry of China (No. 200805611015), Project from Guangzhou City (2010Z2-C1009) and Ministry of Science and Technology of China (No. 10C26214414753), the Research Fund Program of Guangdong Provincial Key Laboratory of Environmental Pollution Control and Remediation Technology (No. 2011K0003), and the"}]