[{"title": "Doi", "content": "10.1016/j.ijhydene.2013.03.128"}, {"title": "Article_Title", "content": "Controllable proton and CO2 photoreduction over Cu2O with various morphologies"}, {"title": "Abstract", "content": "Simultaneous photocatalytic reduction of water to H 2 and CO 2 to CO was observed over Cu 2 O photocatalyst under both full arc and visible light irradiation (420 nm).It was found that the photocatalytic reduction preference shifts from H 2 (water splitting) to CO (CO 2 reduction) by controlling the exposed facets of Cu 2 O.More interestingly, the low index facets of Cu 2 O exhibit higher activity for CO 2 photoreduction than high index facets, which is different from the widely-reported in which the facets with high Miller indices would show higher photoactivity.Improved CO conversion yield could be further achieved by coupling the Cu 2 O with RuO x to form a heterojunction which slows down fast charge recombination and relatively stabilises the Cu 2 O photocatalyst.The RuO x amount was also optimised to maximise the junction's photoactivity."}, {"title": "Experimental", "content": "Two types of Cu 2 O powders used in this study, cuboid and octahedral-shaped, were prepared using solvothermal method.Typical synthesis of cuboid-shaped Cu 2 O involves the dissolution of Cu(NO 3 ) 2 2.5H 2 O in a PTFE lined hydrothermal reactors containing ethanol-water mixture (64:36 volume ratio), and formic acid (1.3 M).Octahedral-shaped Cu 2 O was synthesised by adding 0.65 M of NH 4 OH.Deep red/ purple precipitates obtained after 2 h reaction at 145 C were washed repeatedly (5e6 times) with copious amount of water (50 ml) and dried in an convection oven (70 C) overnight.Different Cu 2 O-RuO x junctions were prepared by impregnation method using appropriate RuCl 3 xH 2 O concentration in water followed by heat treatment then washed for a final time and let to dry at 70 C before finally heated at 200 C for 3 h. Powder XRD was performed using Panalytical X'Pert powder diffraction system fitted with X'cellerator scanning linear detector in 0.0167 steps, at 10 s acquisition time per step.The incident X-ray is nickel filtered Cu radiation (CuK a1 : 1.540596 A, CuK a2 : 1.544493 A, CuK a1 /CuK a2 ratio ca.65/35).Particle morphology was observed using JEOL-7400 high resolution field emission electron microscope operated at 3 kV accelerating voltage and 10 mA current 0 stage tilt on gold coated powders.TEM measurements were conducted using JEOL-2000-EX-MKII transmission electron microscope (200 kV).Ten points adsorption-desorption tests on the powder samples were performed on Micromeritics O TriStar 3000 with N 2 carrier gas to get an estimate of their surface area using BET calculation method. CO 2 reduction reaction was carried out in photocatalyst suspension system using septa-sealed glass chambers fit with flat borosilicate top window (90 transmittance for l !350 nm).Prior to measurements, Cu 2 O powders and glass chamber were treated at 200 C for 3 h in a convection oven and under 300 W Xe lamp light source for ca. 1 h to remove traces of organic contaminants.A typical photocatalytic experiment is conducted using 0.5 g of photocatalyst in 3 ml of CO 2 saturated deionised H 2 O (Elga Centra).Excess (0.7 M) sodium sulphite was added in each run as hole scavenger while deionised H 2 O was being purged with CO 2 , to achieve close to neutral condition (pH z 7.6) before introducing the Cu 2 O photocatalyst.150 W Xe lamp (Newport) was used as a light source.Various long pass filters (Comar Instruments) were applied to evaluate the visible light activity.The reaction products were monitored by periodical sampling of the gas phase from the glass chambers using a gas tight syringe to a gas chromatograph (Varian GC-450) fit with thermal conductivity detector (TCD) connected to molecular sieve column to detect H 2 , CO 2 , O 2 and N 2 and flame ionization detector (FID) connected to CP-SIL 5CB (Varian) capillary column to detect hydrocarbons.Argon was used as the GC carrier gas.A methaniser was installed to enable the FID to detect CO and CO 2 with 1000A higher sensitivity."}, {"title": "Results_and_discussion", "content": "Representative XRD data of both Cu 2 O powders morphologies are shown in Fig. 1.While all peaks can be matched with the standard Cu 2 O reference 7, octahedral-Cu 2 O (Fig. 1a) displayed much sharper and more intense peaks compared to the cuboid-Cu 2 O (Fig. 1b), suggesting much larger crystallite size.It was also noticed that the intensity ratio between the (111) and ( 002) reflexions for octahedral-Cu 2 O was much higher at 3.3 vs. 2.9 for cuboid-Cu 2 O.This indicates a pronounced 111 preferred orientation on octahedral-Cu 2 O which are not seen on cuboid-Cu 2 O. Fig. 2 shows the different morphologies of as-grown Cu 2 O.In line with the findings from XRD, it was observed that the octahedral-Cu 2 O particles were larger than the cuboid-Cu 2 O (Fig. 2a), in excess of 10 mm (Fig. 2c).Each octahedral displays eight uniform faces, which can be assigned to the Cu 2 O 111 plane according to the preferred orientation found in the XRD data.Cuboid-Cu 2 O on the other hand, tends to form spherical aggregates of approx. 2 mm diameters (Fig. 2a).The BET surface area of the samples was measured, it is ca.0.12 m 2 g A1 for octahedral Cu 2 O and 0.55 m 2 g A1 for cuboid-Cu 2 O. It was also observed using TEM that the individual cuboidshaped Cu 2 O particles were defined as 50e100 nm particles with round edges and corners (Fig. 2b).Electron diffraction data (Fig. 2e) suggested that the six exposed faces of cuboid-Cu trace amounts of CO (Fig. 4a andb), indicating the surface are is not the dominating factor in the studies.Cuboid-Cu 2 O aggregates (100 terminated) on the other hand display a peculiar preference towards CO 2 reduction to CO in expense of reduced H 2 production.As the same photocatalytic reaction conditions were applied on both Cu 2 O shapes, the photoreduction selectivity shift from H 2 to CO can only be attributed to the exposed Cu 2 O facets taking into account the similar UVeVis absorption of the two samples.It has been shown previously that catalytic activity can be altered with varying catalyst shape and sizes 9.The key argument is that the different catalyst shapes dictate the fraction of atom located on the edges, corners, or high-index facets 22.These locations possess much greater density of unsaturated (slightly under-coordinated) steps, and imperfections like ledges, kinks compared to low indexed planes, which can serve as active sites for breaking chemical bonds 10,17,19.In some other oxides like ZnO, higher catalytic activity could also rise from the different polarity of the exposed facets 20,21. Reports on the use of Cu 2 O for photocatalytic water splitting have always been based on tetrapod-shaped Cu 2 O, which consists of mainly 111 exposed facets 5,6.From the different photoreduction products observed in this study, it is proposed the Cu 2 O 111 facets, seen on the octahedral-Cu 2 O may be the dominant surface for proton reduction.The Cu 2 O 100 facets and the irregular edges observed in cuboid-Cu 2 O aggregates on the other hand is likely dominant for CO 2 photoreduction sites.In other words, the low index facets exhibit higher activity for CO 2 photoreduction than high index facets, which is different from the common rules mentioned in the introduction.The possible reason for this might be due to the adsorption of CO 2 on different facets of Cu 2 O.More detailed studies are underway. It was also noticed that the gas evolution rate profile of H 2 and CO were different.H 2 evolution rates for both Cu 2 O morphologies are more or less linear with time (Fig. 4b), while the CO evolution rate, especially in the spherical-shaped Cu 2 O, decreases after the first hour (Fig. 4a).It is possible that this is caused by differing stability of Cu 2 O 111 and 100 facets in presence of aqueous sulphate as reported previously 15.Indeed the cuboid-Cu 2 O was more severely degraded after photocatalytic reactions than octahedral shaped particles (see Supporting Information Figs.S1 andS2), implying that the 111 facets seen on octahedral-shaped Cu 2 O are much more stable and indeed responsible for proton reduction reactions. Rapid charge recombination is the key issue in photocatalytic reactions over many photocatalysts 18.It has preliminarily been observed that a solid-state heterojunction based on CuO 2 can efficiently separates holes from electrons, observed by time resolved spectroscopy 4.Similar phenomenon was also observed on cobalt phosphate coated Fe 2 O 3 photoelectrodes 1.RuO x is a conductive metal oxide with large work function 2,3, which has been proven effective as oxidation catalyst for many substances including water 8,14,24.Different loading amounts of RuO x were therefore investigated in detail herein on cuboid-shaped Cu 2 O aggregates to find out the optimum RuO x loading.The amounts of CO evolved for the first 30 min were plot in Fig. 5a.It is apparent that the photoreduction activity of the RuO x /cuboid-Cu 2 O (100 dominated) junction generally increases with increasing RuO x amount up to 0.25, due to the enhanced insitu charge separation effect.However as shown in the SEM micrograph of 0.25 wt RuO x /CuO 2 sample (Fig. 2d), the CuO 2 surface is nearly fully covered by RuO x , above the amount the light screening effect by the RuO x particulates becomes dominant.The photoactivity decreases after this point onwards until 1.5 wt of the RuO x loading.Furthermore, the stability of the cuboid-Cu 2 O (100 dominated) is relatively enhanced by the surface coating of RuO x layer (see Supporting Information Figs.S1 andS3).It is also noted that the increase of CO production occurs at the expense of H 2 , the H 2 production rate decreases from ca.50 ppm g A1 h A1 for bare cuboid Cu 2 O to around 12 ppm g A1 h A1 for 0.25 RuO x loaded cuboid Cu 2 O.This is likely because the low availability of suitable H 2 evolution sites on the cuboid Cu 2 O surface is further blocked by the RuO x loading. Cu 2 O is a narrow bandgap semiconductor.Its photoactivity was also investigated under visible light.The activities of bare and 0.25 wt RuO x /cuboid-Cu 2 O were observed by filtering wavelengths below 420 nm using a long pass filter (Fig. 5b).The results clearly show that both bare Cu 2 O and RuO x /Cu 2 O junction exhibit visible driven activity for CO 2"}, {"title": "Conclusions", "content": "In summary, we highlighted that the photocatalytic reaction selectivity shifted in favour of CO 2 reduction by tuning the shape and exposed sites of Cu 2 O photocatalyst.Furthermore, different from the many reports in which the facets with high Miller indices show higher photoactivity, e.g. for water splitting, low index facets of Cu 2 O is beneficial for CO 2 photoreduction.It was also found that bulk Cu 2 O instability is a serious issue for photocatalytic CO 2 reduction than H 2 evolution, because the 111 exposed facet that prefers H 2 evolution reaction were found to be much more stable than the 100 in aqueous solution containing sulphates.As expected RuO x loading improves the CO evolution yield under both full arc and visible light irradiation, and the optimum loading for the cuboid-Cu 2 O aggregates were found at 0.25 wt, above which the light blocking effect from RuO x dominates and reduce the overall photocatalytic activity. Fig. 1 e Representative XRD data of (a) octahedral-Cu 2 O and (b) cuboid-Cu 2 O aggregates.All peaks can be matched with standard Cu 2 O reference. Fig. 2 e Different morphologies of as-grown Cu 2 O particles or particle aggregates: (a) FESEM and (b) TEM micrographs of cuboid-Cu 2 O aggregate, showing exposed 100 facets with irregular edges and corners.(c) Octahedral-shaped Cu 2 O particles with exposed 111 on its eight octahedral faces.(d) FESEM and (e) TEM micrographs of RuO x /Cu 2 O heterojunction (f) Electron diffraction data of cuboid-Cu 2 O TEM micrograph shown in b. Fig. 4 e Averaged photocatalytic activity of various Cu 2 O particles or aggregates (a) CO yield, (b) H 2 yield under full arc of 150 W Xe lamp.Test conditions: 0.5 g photocatalyst, 3 ml of CO 2 saturated deionised H 2 O, 0.7 M Na 2 SO 3 scavenger. Fig. 5 e (a) The first 30 min of CO yield of cuboid-Cu 2 O aggregates with different amount of RuO x co-catalyst loading, (b) Activity of cuboid Cu 2 O and the heterojunction under visible light (l 420 nm).Test conditions: 0.5 g photocatalyst, 3 ml of CO 2 saturated deionised H 2 O, 0.7 M Na 2 SO 3 scavenger. i n t e r n a t i o n a l j o u r n a l o f h y d r o g e n e n e r g y 3 8 ( 2 0 1 3 ) 1 3 0 1 7 e1 3 0 2 2 Financial support from the EPSRC (EP/H046380/1) is gratefully acknowledged.The authors thank Dr. M. Ardakani (Imperial College London) for TEM measurements.J. Tang is also thankful for a grant from the Qatar National Research Fund under its National Priorities Research Program award number NPRP 09-328-2-122.Its contents are solely the responsibility of the authors and do not necessarily represent the official views of the Qatar National Research fund."}]