[{"title": "Doi", "content": "10.1016/j.jpcs.2012.01.005"}, {"title": "Article_Title", "content": "Photocatalytic reduction of carbon dioxide with water using InNbO4 catalyst with NiO and Co3O4 cocatalysts"}, {"title": "Abstract", "content": "InNbO 4 was prepared by the solid-state reaction method.Various cocatalysts were added on InNbO 4 by the incipient-wetness impregnation method.The effects of co-catalyst and pretreatment conditions on the photocatalytic activity of InNbO 4 for photoreduction of carbon dioxide were investigated.NiO-InNbO 4 and Co 3 O 4 -InNbO 4 were pretreated by reduction at 500 1C for 2 h and subsequent oxidation at 200 1C for 1 h.The catalysts were characterized by X-ray diffraction, scanning electron microscopy, X-ray photoelectron spectroscopy, and UV-vis diffuse reflectance spectroscopy.The characterization results of NiO-InNbO 4 catalysts after pretreatment showed the presence of highly crystalline NiO and monoclinic Nb 2 O 5 .NiO-InNbO 4 with reduction-oxidation pretreatment exhibited the highest activity due to the presence of core-shell type Ni 0 and NiO on the surface and the presence of a small amount of Nb 2 O 5 as a promoter."}, {"title": "Experimental", "content": "The polycrystalline InNbO 4 catalyst was synthesized by a solid-state reaction method using pre-dried In 2 O 3 and Nb 2 O 5 as starting materials.In a typical synthesis, stoichiometric amounts of the precursors were mixed and reacted in an aluminum crucible in air at 1100 1C for 12 h.During reaction, the mixture was grounded at least 3 times to ensure the mixture was well mixed and the reaction was complete since the solid reaction was mass-transfer limited. The incipient-wetness impregnation method was used to prepare NiO or Co 3 O 4 loaded on InNbO 4 catalysts.An aqueous solution of nickel nitrate was added into InNbO 4 powders with stirring and dried using water bath.The dried powders were calcined at 350 1C for 1 h using hot air oven.NiO co-catalysts were prepared with nickel loadings of 0.5 and 1.0 wt.Ni-loaded photocatalysts were denoted as NiO-InNbO 4 .Co 3 O 4 -InNbO 4 catalyst was prepared using aqueous Co(NO 3 ) 2 solution with a cobalt content of 1.0 wt.Coloaded photocatalyst was calcined at 400 1C for 2 h in air to obtain Co 3 O 4 .Ni-loaded and Co-loaded InNbO 4 photocatalysts were pretreated by reduction at 500 1C for 2 h using H 2 (200 Torr, flow rate: 25 ml/min) and subsequent oxidation at 200 1C for 1 h using O 2 (100 Torr, flow rate: 25 ml/min).The pretreated photocatalysts were denoted as NiO or Co 3 O 4 -InNbO 4 R500-O200. The XRD experiments were preformed on a Siemens D-500 powder diffractometer using CuK a radiation (40 kV, 40 mA), 0.0241 step size at a step time of 1 s from 51 to 901.The Bragg-Brentano focusing geometry was employed with an automatic divergence slit (irradiated sample length was 12.5 nm), a receiving slit of 0.1 nm, a fixed slit of 41, and a proportional counter as a detector. The morphology of the catalysts was characterized by SEM using a Hitachi S-800 field emission microscope with an acceleration voltage of 20 kV.The samples were coated with Au prior to analysis and directly analyzed and recorded at a magnification of 5000 A and 10,000 A .The magnification was calibrated in pixel/nm on the camera.The chemical composition of the samples was determined by X-ray energy dispersion spectrum (EDS) with an accelerating voltage of 20 kV. The UV-vis DRS absorbance was measured with a Cary 300 Bio UV-vis spectrophotometer.The powder samples were loaded in a quartz cell with Suprasil windows, and the spectra were collected in the range of 300-800 nm against quartz standard. The XPS spectra were recorded with a Thermo VG Scientific Sigma Probe spectrometer.The XPS spectra were collected using AlK a radiation at a voltage and a current of 20 kV and 30 mA, respectively.The base pressure in the analyzing chamber was maintained in the order of 10 A 9 Torr.The spectrometer was operated at 23.5 eV pass energy.The binding energy of XPS was corrected by carbon (C 2p 3/2 14285.0 eV).In order to analyze the core of the catalysts, depth-profile analysis was also carried out using Ar etching for 15 min. Photocatalytic reactions were carried out in a continuous flow reactor.Fig. 1 shows the schematic representation of the photoreactor setup.The catalyst powder (0.14 g) was dispersed in a reactant solution (50 ml) in a down-window type irradiation cell made of Pyrex glass (75 ml).A 0.2 M potassium bicarbonate solution was employed as an absorbent of carbon dioxide.Ultra pure CO 2 was passed continuously into the reactor to remove the dissolved oxygen in the reaction medium, and then saturated in the solution of potassium bicarbonate.A cooling system combined with a water pump was used to maintain the temperature of the reactor at room temperature.The reaction mixture was irradiated using 500 W halogen lamp (Everbright; H-500; 143 mW/cm 2 ; l14500-900 nm) as the light source for 20 h.The wavelength-current spectra of 500 W halogen lamp, incident light power probed near reactor were 143 mW/cm 2 as shown in Fig. 2.After 20 h, the reaction mixture was centrifuged to separate the reaction products from the catalyst, and analyzed by a gas chromatography (China Chromatography; GC-8900) equipped with a flame ionization detector and a Porapak QS column.Analysis results indicated that methanol was the only hydrocarbon.Blank reactions were carried out to ensure that hydrocarbon production was solely from the photoreduction of CO 2 .One blank was UV-illuminated without the catalyst, and another was in the dark with the catalyst and CO 2 under the same experimental conditions.No hydrocarbon was detected in the above blank tests.surface and the size of Co species on InNbO 4 was too small to detect.However, the variation in the intensity ratio between (111) and (-111) when compared with bare InNbO 4 could be attributed to the expansion of NbO 6 volume 28,36, and Co species was incorporated into the lattice structure of InNbO 4 ."}, {"title": "Results_and_discussion", "content": "The effect of pretreatment on the crystalline phase of InNbO 4 loaded with NiO and Co 3 O 4 co-catalysts was also studied by XRD.Figs.4b andc show the XRD patterns of InNbO 4 with 0.5 wt and 1.0 wt NiO co-catalysts, respectively, after pretreatment.NiO peaks were observed in the XRD patterns of the both samples; however, the peaks are slightly more intense for 1.0 wt NiO-InNbO 4 than those for 0.5 wt NiO-InNbO 4 .It is interesting to note that, after pretreatment, a peak corresponding to monoclinic Nb 2 O 5 was observed in NiO-InNbO 4 catalysts, which implies the decomposition of InNbO 4 in the pretreatment conditions, mainly caused by the presence of NiO.Furthermore, the XRD pattern of 0.5 wt NiO-InNbO 4 is quite different from that of 1.0 wt NiO-InNbO 4 and InNbO 4 .The peak at 2y 1430.81, corresponding to cubic In 2 O 3 , was observed in all the samples.But, in the case of 0.5 wt NiO-InNbO 4 , cubic In 2 O 3 was transformed to rhombohedral In 2 O 3 along with the disappearance of InNbO 4 peak at 2y 1431.11.The pretreatment improved the crystalline phase of InNbO 4 .The bond length of In-O in In-O-Nb is 2.16 A and the electro negativity difference of In-O bond is 1.9, which makes In-O-Nb bond an easier one to decompose.Moreover, InO 6 chains are highly distorted as they need to accommodate the strain of the defect due to the presence of NiO, which might lead to lattice rotation 37. The sample of 1.0 wt Co 3 O 4 -InNbO 4 after reduction-oxidation pretreatment did not show any significant difference in the XRD patterns.No lines corresponding to oxides of cobalt were observed in the XRD pattern.XRD peaks of the sample before pretreatment were identical to that of after pretreatment, indicating that there might be only small distortion in the crystallinity of InNbO 4 , as it is stable after pretreatment. The surface morphologies of the as-synthesized and pretreated InNbO 4 catalysts were analyzed by SEM.Fig. 5 shows the SEM micrographs of InNbO 4 samples with 1.0 wt NiO and 1.0 wt Co 3 O 4 co-catalysts, respectively.It can be observed from Fig. 5a that InNbO 4 had a layered crystal structure with definite edges and some tiny particles.The tiny particles agglomerated in irregular shape with a particle size of ca. 1 mm.Fig. 5b shows the SEM micrograph of 1.0 wt NiO-InNbO 4 sample.Many NiO pellets were observed on InNbO 4 particles.It should be noted that such NiO particles were not so homogeneously dispersed over InNbO 4 .However, it is difficult to infer from a SEM photograph whether NiO particles were located at the surface or between the layers of InNbO 4 .1.0 wt Co 3 O 4 -InNbO 4 demonstrated a slightly irregular InNbO 4 crystal with many pellets or aggregates on the surface (Fig. 5c).Fig. 6 shows the effect of pretreatment on the surface morphology of InNbO 4 with co-catalysts.After pretreatment of 1.0 wt NiO-InNbO 4 (Fig. 6b), SEM analysis showed the appearance of large segregations of nickel oxide phases on the surface of rod-like InNbO 4 .In Fig. 6c,1.0wt Co 3 O 4 -InNbO 4 R500-O200 shows a stack of interconnected rod-like InNbO 4 particles with few agglomerated pellet shaped oxides.Fig. 6d demonstrates the SEM micrograph of 0.5 wt NiO-InNbO 4 R500-O200.It should be noted that the particles are layered, and agglomerated NiO particles as observed in 1.0 wt NiO-InNbO 4 are not observed in 0.5 wt NiO-InNbO 4 R500-O200.The SEM results are in agreement with the results of XRD measurements. The chemical states and surface composition of InNbO 4 and 0.5 wt NiO-InNbO 4 before and after pretreatment were analyzed by XPS.InNbO 4 consists of InO 6 and NbO 6 octahedron, which are interconnected to form a three dimensional network.Fig. 7 shows In 3d levels of the catalysts along with depth-profile analysis.The In 3d level consists of a doublet of spin-orbit components, In 3d 5/2 and In 3d 3/2 .The XPS peaks at 444.5 and 452.05 eV for InNbO 4 (Fig. 7a) correspond to In 3d 5/2 and In 3d 3/2 , respectively.The sharp peak at 444.5 eV represents the presence of pure In 2 O 3 in InNbO 4 38.In 0.5 wt NiO-InNbO 4 (Fig. 7b), In presence of mixed oxides of niobium.Ar sputtering of NiO-InNbO 4 removed the oxide layer of the surface and the XPS analysis showed peaks corresponding to Nb 2 O 5 and NbO 2 phase (Fig. 8c).In contrast to In 3d spectra, which showed negligible difference between In 3d spectra of NiO-InNbO 4 after Ar sputtering and In 3d spectra of InNbO 4 , Nb 3d level showed an extra NbO 2 phase in the depthprofile analysis of NiO-InNbO 4 when compared with InNbO 4 .Hence, the presence of NiO significantly alters the chemical states of Nb 3d levels.The pretreated NiO-InNbO 4 (Fig. 8d) showed XPS spectra similar to that obtained from Ar sputtering.This confirms that NiO-InNbO 4 has niobium oxides in the form of Nb 2 O 5 and NbO 2 at the surface after pretreatment.In all the cases, metallic niobium was not observed as the reducibility of niobium oxide is feasible only at 1073 K 39.mainly existed as oxides.After Ar etching, the XPS spectrum mainly showed a peak at 852.9 eV, which is a characteristic peak of metallic nickel and a small shoulder at 854.9 eV, corresponding to nickel oxide.XPS of 0.5 wt NiO-InNbO 4 indicates that metallic nickel is covered by nickel oxides with a core-shell structure.After a pretreatment of 0.5 wt NiO-InNbO 4 , the surface of InNbO 4 primarily consists of metallic nickel at 853.1 eV with a small amount of nickel oxide.The shift of about 0.2 eV when compared with Ni 2p 3/2 peak for Ar sputtering could be assigned to the existence of small Ni 0 particles.It can be concluded from Fig. 9 that the surface of NiO-InNbO 4 after reduction and oxidation pretreatment contains well-dispersed small metallic nickel particles covered by a thin layer of nickel oxide.The results are in accordance with that reported by Domen et al. 40,41. Fig. 10a shows the binding energy of O 1s photoelectron peak at 530.22 eV for InNbO 4 .However, the O 1s profile of 0.5 wt NiO-InNbO 4 (Fig. 10b) is broad due to overlapping contribution of oxygen from different oxides viz., NiO, Ni 2 O 3 , NbO 2 , and NbO with those of InNbO 4 .However, the depth-profile analysis of 0.5 wt NiO-InNbO 4 (Fig. 10c) showed a sharp peak at 530.5 eV with a shift of about 0.28 eV from pure InNbO 4 .The blue shift could be assigned to the difference in the environment of O 1s on the surface and in the core structure.After reduction and oxidation pretreatment (Fig. 10d), a sharp peak at 530.58 eV can be observed corresponding to the oxides of InNbO 4 .It may be due to the reduction in the amount of oxide species after pretreatment, which can be confirmed from the XPS spectra of In 3d, Nb 3d, and Ni 2p states. The presence of framework and extra-framework species can be detected by UV-vis.Fig. 11 shows the UV-vis DRS spectra of InNbO 4 samples with various co-catalysts.InNbO 4 compound showed obvious absorption in visible light regime up to 477 nm.The band gap of InNbO 4 was estimated to be about 2.6 eV from the onset of the absorption spectra (Fig. 11a).After loading with 1.0 wt cobalt co-catalyst on InNbO 4 , there was an obvious increase in the absorption of visible light (Fig. 11b).The spectrum was characterized by broad bands around 360, 500, and 730 nm.The broad bands around 360 and 730 nm are characteristic peaks of Co 3 O 4 clusters 42.A distinct shoulder around 500 nm could be assigned to octahedral Co 2 ions.The UV-vis DRS spectra of 1.0 wt NiO-InNbO 4 (Fig. 11c) shows characteristic bands at 320 nm, indicative of Nb 2 O 5 , which is in accordance with the XRD results.The absorbance remained stable after 440 nm and confirms its ability to respond at longer wavelengths. Fig. 12 shows the UV-vis DRS spectra of NiO-InNbO 4 and Co 3 O 4 -InNbO 4 after pretreatment.It can be observed from Fig. 11b, which corresponds to 1.0 wt Co 3 O 4 -InNbO 4 , that the broad bands around 500 and 730 nm disappeared after pretreatment.The characteristic broad band around 360 nm revealed the presence of Co 3 O 4 clusters.The pretreatment modified the environment of Co 3 O 4 clusters and eliminated octahedral Co 2 ions.In addition, the absorbance was increased in the visible regime after pretreatment.Herein, it is worth noting that the absorbance in the visible region is the maximum for 1.0 wt NiO-InNbO 4 R500-O200 (Fig. 11c) catalyst.A characteristic band of Nb 2 O 5 at 330 nm was also observed, which is in accordance with the XRD results.The absorbance of the sample in visible light region increases after the loading of co-catalyst is a reason for the enhanced photocatalytic activity. The photocatalytic activity of InNbO 4 with various amounts of co-catalysts for photoreduction of CO 2 is shown in Fig. 13.There is a slight decrease in the yield of methanol with the addition of 0.5 wt NiO.However, the methanol yield increased with the amount of NiO co-catalyst up to 1.577 mmol h A 1 g catalyst The optimum loading of cocatalyst was 1 wt. The pretreatment has a great effect on the activity of the catalyst.When the potential difference in the conduction band between InNbO 4 and the co-catalyst is negligible, pretreatment is essential for high catalytic activity.Fig. 13 shows the effect of pretreatment on the catalytic activities of NiO-and Co 3 O 4 -InNbO 4 for photoreduction of CO 2 .The difference in the yields of methanol before and after pretreatment on 1.0 wt NiO-and Co 3 O 4 -InNbO 4 is noteworthy.After pretreatment, the yield of methanol decreased in both the catalysts; however, both were higher than pure InNbO 4 .In contrast, 0.5 wt NiO-InNbO 4 showed an enhanced photocatalytic activity after pretreatment. In the case of 1.0 wt NiO-InNbO 4 , most of NiO were loaded as ultra fine particles, which were not observed in SEM analysis.However, after pretreatment, these ultra fine NiO particles aggregated to big particles on InNbO 4 , which leading to a lower activity.Bulk NiO is a p-type semiconductor, which induces the formation of positive holes.On the contrary, for photoreduction of CO 2 , hole scavengers are necessary to facilitate photoreduction; consequently, bulk NiO reduced the photocatalytic activity of 1.0 wt NiO-InNbO 4 catalyst.Therefore, it is necessary to avoid the formation of bulk NiO. The characterization results of 0.5 wt NiO-InNbO 4 photocatalyst showed the presence of core-shell structure with NiO thin shell and metallic Ni in core.XPS results revealed the dispersion of these particles with core-shell structure on the surface of InNbO 4 .The fine dispersion of NiONi particles and the interface of NiO-InNbO 4 play important roles in determining the photocatalytic activity of NiO-InNbO 4 .The metallic nickel acts as a bias for electron transfer from InNbO 4 to NiO layer and the excited electron can migrate easily to the surface to facilitate photoreduction of CO 2 .In general, hole scavengers are necessary to enhance photoreduction of CO 2 ; however, in this case methanol itself acts as a hole scavenger to improve the yield.Moreover, the greater mobility of electron due to core-shell structure further improved the activity of the catalyst.The presence of a small amount of niobium oxide species acted as a promoter 44,45.Since In 2 O 3 was found to exist in the samples, the influences of In 2 O 3 on the photocatalytic activity should be considered.Actually, the photocatalytic activity of all the samples highly depended on the peak intensity of In 2 O 3 in XRD patterns.The enhanced photocatalytic activity can be attributed to the existence of In 2 O 3 . The existence of Nb 2 O 5 , which is an n-type semiconductor acts as a donor of electrons and reduces the positive hole concentration, thereby increasing the yield of methanol.The reducibility of niobium oxide is enhanced by the interaction of niobium with elements such as Ni 45.Furthermore, it can also efficiently substitute Ni 2 ions or occupy the cation vacancies in the NiO lattice 46 and Tamman temperature of Nb 2 O 5 , 893 K 46, is also a suitable condition of a catalyst to promote a liquid-phase reaction.The strong metal-support interactions (SMSI) between Nb 2 O 5 and Ni metal, and the strong acidic property of niobic acid also play important roles 47,48.Another striking feature in the characterization results of 0.5 wt NiO-InNbO 4 R500-O200 was the transformation of In R500-O200 could be attributed to the thin layer of NiO on metallic nickel particles along with the presence of small amounts of Nb 2 O 5 ."}, {"title": "Conclusions", "content": "The present work demonstrated the influence of NiO and Co 3 O 4 co-catalysts and pretreatment on the photocatalytic activity of InNbO 4 for photoreduction of carbon dioxide with water.All the catalysts were pretreated by reducing at 500 1C and oxidizing at 200 1C, respectively.The InNbO 4 and those with cocatalysts were active for photoreduction of CO 2 with water under visible light irradiation.UV-vis DRS confirmed their absorbance in the visible light regime.The absorbance of the sample in visible light region increases after the loading of co-catalyst is a reason for the enhanced photocatalytic activity.1.0 wt NiO-InNbO 4 showed the highest photocatalytic activity due to the presence of tiny NiO particles and a small amount of Nb 2 O 5 .However, these tiny NiO particles aggregated to large particles after pretreatment resulting in the decrease of activity.The results showed that the presence of ultra fine NiO particles is beneficial for activity.The ultra fine NiO particles could be obtained using a small amount of NiO.It was found that 0.5 wt NiO-InNbO 4 after pretreatment gave the highest yield of methanol.The high activity of this sample was due to the small NiO particles with coreshell structure, and the presence of Nb 2 O 5 particles that has SMSI between Nb 2 O 5 and Ni metal.Since In 2 O 3 was found to exist in the samples, the influences of In 2 O 3 on the photocatalytic activity should be considered.Actually, the photocatalytic activity of all the samples highly depended on the peak intensity of In 2 O 3 in XRD patterns.The enhanced photocatalytic activity can be attributed to the existence of In 2 O 3 .The results demonstrated that NiO-InNbO 4 is a promising catalyst for photoreduction of CO 2 under visible light irradiation. Fig.3shows the XRD patterns of the as-synthesized InNbO 4 and NiO and Co 3 O 4 -loaded InNbO 4 catalysts.The XRD patterns of InNbO 4 samples prepared by the solid-state reaction method at 1373 K are well consistent with previously reported monoclinic InNbO 4 pattern and space group P2/c.This indicates that the samples were fully crystallized in the wolframite-type structure Fig. 2. Wavelength-current spectra of 500 W halogen lamp, incident light power probed near reactor were 143 mW/cm 2 . Fig. 4. XRD patterns of InNbO 4 prepared with various co-catalysts after pretreatment (a) InNbO 4 , (b) 0.5 wt NiO-InNbO 4 R500-O200, (c) 1.0 wt NiO-InNbO 4 R500-O200, and (d) 1.0 wt Co 3 O 4 -InNbO 4 R500-O200. Fig. 6.SEM micrographs of InNbO 4 with various co-catalysts after pretreatment (a) InNbO 4 , (b) 1.0 wt NiO-InNbO 4 R500-O200, (c) 1.0 wt Co 3 O 4 -InNbO 4 R500-O200, and (d) 0.5 wt NiO-InNbO 4 R500-O200. shows the XPS spectra of 0.5 wt NiO-InNbO 4 samples in the Ni 2p region.It can be observed from the spectrum of 0.5 wt NiO-InNbO 4 that Ni 2p has two spin-orbit components, Ni 2p 3/2 and Ni 2p 1/2 at 855.32 and 872.10 eV, respectively.Ni 2p 3/2 has a major peak at 855.2 eV along with a shoulder at 860.6 eV, which corresponds to Ni 2 O 3 .Metallic nickel has a characteristic peak at 853.1 eV and the absence of metallic nickel on the surface of InNbO 4 indicates that the nickel cocatalyst Fig. 7. XPS spectra of In 3d region for (a) InNbO 4 , (b) 0.5 wt NiO-InNbO 4 , (c) 0.5 wt NiO-InNbO 4 after Ar sputtering, and (d) 0.5 wt NiO-InNbO 4 R500-O200. Fig. 10.XPS spectra of O 1s region for (a) InNbO 4 , (b) 0.5 wt NiO-InNbO 4 , (c) 0.5 wt NiO-InNbO 4 after Ar sputtering, and (d) 0.5 wt NiO-InNbO 4 R500-O200. Fig. 12. UV-vis spectra of InNbO 4 with various co-catalysts after pretreatment (a) InNbO 4 , (b) 1.0 wt Co 3 O 4 -InNbO 4 R500-O200, and (c) 1.0 wt NiO-InNbO 4 R500-O200. InNbO 4 had fine Co 3 O 4 clusters on the surface and Co 2 ions in the lattice of NbO 6 .After pretreatment, there was a disappearance of Co 2 and some Co 3 O 4 clusters.The yield of methanol on 1.0 wt Co 3 O 4 -InNbO 4 catalyst decreased after pretreatment.The photocatalytic activity of 1.0 wt Co 3 O 4 -InNbO 4 was lower than that of 1.0 wt NiO-InNbO 4 catalyst, due to the redox property of cobalt cations. Contents lists available at SciVerse ScienceDirect journal homepage: www.elsevier.com/locate/jpcsJournal of Physics and Chemistry of Solids 0022-3697/ -see front matter 2012 Elsevier Ltd.All rights reserved.doi:10.1016/j.jpcs.2012.01.005 43The cocatalyst reduced the recombination rate by acting as a sink for the photogenerated electrons, while holes remain on the InNbO 4 surface.The methanol yield on 1.0 wt Co 3 O 4 -InNbO 4 was 1.503 mmol h A 1 g catalyst A 1 , which was lower than that on 1.0 wt NiO loaded catalyst.The high activity of NiO-InNbO 4 was due to the presence of amorphous NiO nanoparticles on the surface of InNbO 4 .The presence of a small amount of Nb 2 O 5 , as shown in XRD and UV-vis DRS results, acted as a promoter to enhance its catalytic activity.Nb 2 O 5 can retard the crystallization of NiO and maintained the ultra fine structure of NiO particles.The difference in the photocatalytic activities between 1.0 wt NiO-InNbO 4 and 1.0 wt Co 3 O 4 -InNbO 4 may be due to the redox property of cobalt cations when compared with that of nickel cations.During photoirradiation, cobalt cations can act as recombination centers, whereas nickel cations are poor recombination centers due to its stable bivalent oxidation number43.It can be concluded that both NiO and Co 3 O 4 co-catalyst promoted the activity of InNbO 4 and Co 3 O 4 was a better cocatalyst than NiO. D.-S. Lee et al. / Journal of Physics and Chemistry of Solids 73 (2012) 661-669 This research was supported by the National Science Council of Taiwan."}]