[{"title": "Doi", "content": "10.1016/j.apcata.2007.11.022"}, {"title": "Article_Title", "content": "Photoreduction of CO2 in an optical-fiber photoreactor: Effects of metals addition and catalyst carrier"}, {"title": "Abstract", "content": "The transformation of CO 2 to hydrocarbons using sunlight is one of best routes to produce renewable energy.Photocatalytic reduction of CO 2 with H 2 O in the gaseous phase is studied by using Cu-Fe/TiO 2 catalyst coated on optical fibers under UVA and UVC irradiation.Catalyst coated optical fibers are assembled in the reactor such that the UV light can enter along the fibers to conduct the photocatalytic reaction on its surface.Methane and ethylene as main products are observed to evolve from this photoreactor.The presence of Fe as a co-dopant in Cu/TiO 2 catalyst is found to synergistically reduce CO 2 with H 2 O to ethylene at the quantum yield and total energy efficiency of 0.024 and 0.016, respectively.This phenomenon is well explained by an efficient charge transfer mechanism between TiO 2 as a support and Cu as well as Fe as co-dopants.Methane is formed more favorably than ethylene on Cu/TiO 2 .Meanwhile, Fe as a co-dopant on Cu/TiO 2 catalyst is found to depress the methane formation.The photo production of ethylene over catalysts supported on optical fibers presents yields that are one order of magnitude higher than that on the glass plate counterpart.For a given amount of catalyst and light energy, the optical-fiber reactor can utilize light energy efficiently.Many photo-driven reactions will have advantage using such optical-fiber system."}, {"title": "Experimental", "content": "Commercial titanium dioxide powder (P25, Degussa) was used as a TiO 2 source.Cu(NO 3 ) 2 A3H 2 O and Fe(NO 3 ) 3 A9H 2 O (Aldrich) were employed as precursors of metal dopants on TiO 2 support.The polymer clad of the optical fiber (ET tone Taiwan) was removed by calcination at 500 8C for 3 h.This step was followed by washing off the remaining residue with 10 M NaOH aqueous solution then distilled water in an ultrasonic bath three times. For the preparation of metal supported TiO 2 thin-film, TiO 2 slurry with corresponding metal salts was prepared by the incremental addition of 2 ml of aqueous polyethylene glycol (Merck, average MW of 20,000) solution with metal salts to 0.5 g of TiO 2 powder in a mortar under vigorous grinding with pestle 19.Each 0.1 ml of the aqueous polyethylene glycol solution was added after the previous mixture had formed a uniform and lump-free paste.Thereafter the prepared uniform slurry was coated on optical fibers by dip coating method or on glass plates by a doctor blade technique.After natural drying at room temperature, the thin film was calcined in static air at 450 8C for 30 min. TiO 2 thin films were characterized with X-ray diffraction (XRD, Phillips, Cu Ka radiation) for crystallinity, scanning electron microscopy with energy dispersive X-ray spectrometer (SEM-EDX, Philips XL30, EDAX DX4) for film thickness and surface morphology, nitrogen adsorption (Micromeritics ASAP 2000) for BET specific surface area, pore size and pore volume.The band-gap energies of TiO 2 films were determined by UVvis diffuse reflectance spectroscopy (UV-vis DRS, Varian Cary 100).The light intensity was measured with a Lumen meter (Exfo).XPS measurements were taken on a VG Microtech MT500 spectrometer, operated with a constant pass energy of 50 eV and with Mg Ka radiation as the excitation source (hn 1253.6eV).The catalyst was pressed into a pellet, and then adhered on the sample holder by carbon tape.Carbon (1 s, 284.5 eV) was used as an internal standard for binding energy calibration. Quantum yield (F) of the reaction is approximately calculated by using Eqs.(1) and (2).Eight or twelve electrons are required to transform CO 2 to methane or ethylene, respectively.Energy efficiency (h) is estimated by Eq. (3), which represents the conversion of photo to chemical energy. where, heat of combustion of methane and ethylene are 802 and 1411 kJ/mole, respectively.The mole of photon absorbed by catalyst was assumed to be equal to that absorbed by the number of optical fibers employed in the reactor.The latter value was estimated on the basis of the outlet energy subtracted from the inlet energy through the optical-fiber reactor 20.In order to avoid the scattering of light out of the aperture of Lumen meter, the total number of optical fibers (typically 216) in the reactor were put in one narrow Pyrex glass tube with a diameter of 5 mm and length same as that of the optical fibers (110 mm).A blank measurement of photon absorbed by the Pyrex glass tube without optical fibers was also measured to get the net value of photon absorbed by the number of optical fibers. The amount of catalyst coated on carriers including glass plate and optical fiber is determined by the difference between the weight of catalyst coated carrier and that of bare carrier.Owing to the very small amount of catalyst coated on one optical fiber, the amount of catalyst coated on this carrier is measured on the basis of the total number of optical fibers in the photoreactor which is 117, 216 or 450 fibers. Photocatalytic reaction was carried out in a continuous circular Pyrex glass reactor (216 cm 3 ) with a quartz window for conduction of light irradiation.Catalyst coated optical fibers were assembled in the reactor such that the light source (high pressure Hg lamp, 150 W) can enter along the fibers to conduct the photocatalytic reaction on its surface as shown in Fig. 1(a) 15.The UVA (320-500 nm) and UVC (250-450 nm) light for different reactions were obtained by using appropriate color filters (Exfo).The light intensity was measured on the quartz window with unit of mW/cm 2 .The reactor was covered with a heating tape connected to a temperature controller with a thermocouple placed at the top of the catalyst bed to maintain the reaction at around 75 8C.The reactor was purged by CO 2 gas bubbling through distilled water for 1 h at 75 8C before and during the reaction.The space velocity of CO 2 gas and H 2 O vapor was maintained at 0.72 h A1 for every experiment.The outlet gases were analyzed at certain periods of time by using GC equipped with FID and porapak Q column. The increase of the number of optical fibers used in the same photoreactor, which does not significantly affect the flow of reactants as well as the diffusion of products from the opticalfiber surface to the gas flow, was done with care to ensure that the fibers are separate from one another.For comparison, the photocatalytic conversion of CO 2 into hydrocarbons on glass plates coated with catalysts was also studied. The specific surface area and band-gap energy of various catalysts are shown in Table 1.As TiO 2 is loaded with 1 wt of Cu and Fe, its specific surface area is slightly decreased from 50.00 to 47.74 m 2 /g.Band-gap energy of Cu (1 wt)-Fe (1 wt)/TiO 2 (2.93 eV) is also observed to decrease in comparison with that of bare TiO 2 (3.11 eV). Fig. 2 depicts the SEM images of metal loaded TiO 2 films coated on glass plate and optical fiber.The thickness of the thin films on glass plate and optical fiber are around 12 mm and 878 nm, respectively.Some cracks are observed on the morphological surface of the TiO 2 thin film coated on glass plate.Meanwhile, continuous and uniform thin film of TiO 2 is obtained when coated on optical fiber.This difference is probably due to the thickness of the former is much higher than that of the latter. X-ray diffraction patterns of different catalysts coated as thin films on glass plates are shown in Fig. 3.There is no difference between the X-ray diffraction pattern of bare TiO 2 and that of metal loaded TiO 2 .The result implies that Cu and Fe are well dispersed on the surface of the TiO 2 support. In order to elucidate the UV and visible light absorption of metal loaded TiO 2 films, UV-vis diffuse reflectance spectroscopy of different catalysts are measured and depicted in Fig. 4. Cu as a dopant on TiO 2 does not significantly affect the light absorption property of bare TiO 2 film as shown in Fig. 4b.Nevertheless, when Fe is supported on TiO 2 either with or without Cu as a co-dopant, the derived catalysts appear to absorb visible light with a small peak at around 500 nm of wavelength (Fig. 4c andd).This result could be due to the visible light absorption of iron oxides with band-gap energies of 2.0-2.3 eV 21. Fig. 5 depicts the XPS spectra of Cu(0.5 wt)-Fe(0.5wt)/ TiO 2 catalyst.The binding energies of Cu 2p 3/2 and 2p 1/2 are 931.9 and 951.2 eV, respectively (Fig. 5a), which could be assigned to Cu 2 O compound on the surface of TiO 2 22.Meanwhile, Fig. 5b shows that the binding energies of Fe 2p 3/2 and 2p 1/2 are 710.3 and 725.1 eV, respectively.These binding energies correspond to Fe 2 O 3 compound on the surface of TiO 2 22. In this study, Cu-Fe/TiO 2 catalysts are observed to photoreduce CO 2 with H 2 O to various kinds of products that include significant amounts of ethylene and methane as well as trace amounts of ethane and methanol.The production rate of ethylene over different catalysts coated on optical fibers according to reaction time is presented in Fig. 6.According to the results, the production rate of main products including methane and ethylene over most catalysts, especially Cu-Fe/ TiO 2 , under different reaction conditions reaches to steadystate at around 4 h after turning on the light source.Consequently, the production rate of main products is determined on the basis of average production rate after a reaction time of 4 h.Table 2 presents the production rate of ethylene over different photocatalysts and carriers under UVC (250-450 nm).TiO 2 shows negligible photocatalytic activity towards ethylene production.When either Cu or Fe is loaded on the TiO 2 support, the derived catalysts appear to reduce CO 2 with H 2 O to ethylene.Moreover, as Cu and Fe are employed as co-dopants on the TiO 2 support, the resulting Cu-Fe/TiO 2 catalyst performs the synergistic effect in terms of CO 2 photoreduction to ethylene.The optimum amount of Cu and Fe loading on TiO 2 are determined to be 0.5 wt for each with the corresponding amount of evolved ethylene at 0.58 mmol/g-cat h as shown in Table 2.The production rate of ethylene, based on per gram catalyst, on optical fibers is found to be one order of magnitude higher than that on glass plate. Production rate of ethylene and methane over different photocatalysts under UVA are shown in Table 3.According to the results in Tables 2 and3, the light source does not substantially affect the production rate of ethylene over the catalyst coated on glass plate.The maximum amount of ethylene at 0.05 mmol/gcat h is observed on the Cu(0.5 wt)-Fe(0.5wt)/TiO 2 coated glass plate, which is similar to that under UVC irradiation.Meanwhile, methane production rate over different catalysts presents different trends.The highest amount of methane at 0.19 mmol/g-cat h is measured on Cu(0.25 wt)-Fe(0.25 wt)/ TiO 2 , whereas methane production rate of ca.0.06 mmol/g-cat h is observed on Fe(1 wt)/TiO 2 , Cu(1 wt)-Fe(1 wt)/TiO 2 and Cu(0.5 wt)-Fe(0.5wt)/TiO 2 catalysts. Production rate of ethylene and methane on Cu(0.5 wt)-Fe(0.5wt)/TiO 2 catalyst under UVA on different carriers are shown in Table 4 for comparison.It is interesting that under UVA irradiation, catalysts supported on optical fibers also produces an amount of ethylene one order of magnitude higher than that on glass plate.Moreover, the amount of produced methane on catalysts supported optical fibers is 15 times higher than that on its glass plate counter part. Quantum yields of ethylene and methane production over different catalysts are presented in Tables 5 and6.The quantum yield under UVA is one order of magnitude higher than that under UVC.Because quantum yield is inversely proportional to molar quantity of photons absorbed on catalysts as shown in Eqs. ( 1) and (2), it is also inversely proportional to the photon energy absorbed by optical fibers.The optical fibers used in this study are made of quartz glass, which show on absorption of UVC light (280 A 10 A3 J s A1 per 216 fibers) stronger than that of its UVA counterpart (17.4 A 10 A3 J s A1 per 216 fibers).Consequently, the quantum yield under UVC is much lower than that under UVA owing to the wasted photons absorbed by optical fibers due to heat. The quantum yields of ethylene and methane production on Cu(0.5 wt)-Fe(0.5wt)/TiO 2 catalyst under UVA are found to be similar at values of 0.024 and 0.025, respectively.The data of quantum yields under UVA are comparable to those reported by Aurian-Blajeni et al. for photoreduction of CO 2 in aqueous solution 23.However, the data of quantum yields under UVC are one order of magnitude higher than those reported by Hofstadler et al. for UVC photominerallization of 4-Chlorophenol using TiO 2 immobilized on fused-silica glass fibers 24.a Methane and ethylene production rate were determined on the basis of average production rate after the reaction time of 4h.The irradiation source was in UVA range (320-500 nm) with the intensity of 225 mW/cm 2 . Effect of carrier on production rate of ethylene and methane under UVA Ethylene production rate (mmol/g h) a Methane production rate (mmol/g h) a Cu(0.5 wt)-Fe(0.5wt)/TiO 2 /glass plate 0.05 0.06 Cu(0.5 wt)-Fe(0.5wt)/TiO 2 /optical fiber 0.58 0.91 a Methane and ethylene production rate were determined on the basis of average production rate after the reaction time of 4 h.The irradiation source was in UVA range (320-500 nm) with the intensity of 225 mW/cm 2 . Quantum yield (F) and energy efficiency (h) of ethylene and methane production over Cu(0.5 wt)-Fe(0.Table 7 presents the comparison between ethylene production rate over Cu(0.5 wt)-Fe(0.5wt)/TiO 2 photocatalysts under UVC and UVA irradiation.The production rate of ethylene on this catalyst is comparable under both UVC and UVA.The same result is also observed on two kinds of carriers, glass plate and optical fiber. The effect of the number of optical fibers on the production rate of ethylene over Cu(1 wt)-Fe(1 wt)/TiO 2 photocatalyst is depicted in Table 8.The higher the number of optical fibers in the same volume of photoreactor as well as the same light irradiation condition, the larger the production rate of ethylene obtained. It was interestingly to find that either Cu or Fe alone as a dopant on TiO 2 catalyst shows a fast decline of photoreduction of CO 2 to ethylene as shown in Fig. 6.Cu(1 wt)/TiO 2 strongly reduces CO 2 at the initial 2 h of reaction and significantly decreases its activity thereafter.Meanwhile, Fe(1 wt)/TiO 2 shows relatively low photoactivity and its deactivation is also observed after 2 h of the reaction.There are a large number of previous reports about the electrochemical reduction of CO 2 at copper electrode 2526272829, which present the selective formation of methane and ethylene as final products of this reaction.On the other hand, Fe metal electrode in aqueous hydrogen carbonate solution was found to only slightly produce methane 25.Accordingly, the data in this present study imply to some extent that the photocatalytic and electrocatalytic activities of copper compounds are consistent with one another in terms of CO 2 reduction with H 2 O to ethylene.Nevertheless, owing to the lack of an efficient ''anode'' to oxidize H 2 O, the photocatalytic activity of Cu(1 wt)/TiO 2 catalyst becomes significantly depressed because of charge recombination as shown in Fig. 6. As Fe is a transition metal that has a set of consecutive oxidation states, typically Fe 2 /Fe 3 , the deliberate employment of Fe as a co-dopant on Cu/TiO 2 catalyst in this study could be a good process to shuttle the holes from TiO 2 to H 2 O. Consequently, photocatalytic activity and stability of Cu-Fe/ TiO 2 are much superior than those of Cu/TiO 2 and Fe/TiO 2 as presented in Table 2 and Fig. 6.Additionally, iron oxide is also well known as a good photocatalyst in terms of visible light absorption 21, which is well supported by the UV-vis DRS spectroscopy in Fig. 4. As a result, the photocatalytic activities of Cu-Fe/TiO 2 catalyst are observed to be comparable under UVA and UVC irradiation (Table 7). It has been reported that the conduction band of iron oxide by Mott-Schottky measurements is slightly above 30,31 and below 32,33 the H /H 2 half-cell potential.The former claims were later confirmed by the report of Somorjai and Damme 21 who measured the flat-band potential of iron oxide varying between A0.9 and A1.1 V (vs.SCE) at pH 13.This value was well supported by the photocatalytic activity of iron oxide to decompose water to hydrogen 21.Based on the flat-band potential of A1.1 V (vs.SCE) and band-gap energy of 2.2 eVof iron oxide 21 along with the band edge structure of TiO 2 34,35 and redox potential of CO 2 /C 2 H 4 29, the synergistic performance of Cu-Fe/TiO 2 catalyst towards photocatalytic reduction of CO 2 to ethylene could be well explained by the charge transfer mechanism as depicted in Fig. 7.The difference of flat-band potential between TiO 2 , A0.42 eV, and iron oxide, A0.39 eV, causes the effective charge separation and the improved photoproduction of ethylene.Since the flat-band potential and valence band of iron oxide are lower and higher than those of TiO 2 , respectively, photo-excited electrons and holes would tend to recombine easily provided that the transfer speeds of electrons and holes from TiO 2 to iron oxide were almost the same.However, the cooperative motion of the holes is an inherently slower process than that of electrons, which is ascribed to the much higher mobility of the latter than the former 36.As a result, the electrons transferred from TiO 2 to iron oxide or copper oxide easily reduce CO 2 to produce ethylene before they recombine with the holes which are moving from TiO 2 to iron oxide or directly taking part in the oxygen formation reaction on the TiO 2 surface.Accordingly, the effective reduction of CO 2 for the production of ethylene is taken place by the electron moved from TiO 2 to iron oxide and to copper oxide.Meanwhile, oxygen seems to be mainly evolved by the holes on TiO 2 itself rather than the holes transferred from TiO 2 to iron oxide, resulting in the improvement of photocatalytic performance due to the reverse flows of electrons and holes as shown in Fig. 7.This phenomenon was also observed in the previous study for the RuS 2 /TiO 2 -SiO 2 catalyst in the reaction of photocatalytic decomposition of water to hydrogen 35. The data in Table 3 for methane production infer that the presence of Fe in Cu/TiO 2 catalyst seems to depress the evolution of methane.It was well known that the electrochemical reduction of CO 2 on single crystal copper electrodes formed various kinds of hydrocarbon products depending on its index planes 28,37,38.Ethylene was formed more favorably than methane on the (1 0 0) electrode whereas methane was predominantly produced on the (1 1 1) surface 38.Cu/TiO 2 in this present study favorably produces methane rather than ethylene, which implies that Cu as a dopant on TiO 2 catalyst might be in the form of (1 1 1) surface to some extent.Meanwhile, Fe/TiO 2 shows relatively low photoactivity to produce methane as compared to the Cu counterpart, which is consistent with a previous study 25.Although Fe as a codopant on Cu/TiO 2 catalyst is observed to give rise to the synergistic performance of CO 2 reduction to ethylene, it substantially decreases the photoactivity towards methane production.High dispersion of metal dopants on supports was widely agreed to enhance the activities of derived catalysts 21.Accordingly, the presence of Fe on Cu/TiO 2 somehow decreases the high dispersion of Cu on TiO 2 resulting in the decline of methane evolution on Cu-Fe/TiO 2 catalyst.This explanation could be supported by the result that the production rate of methane on Cu(0.25 wt)-Fe(0.25 wt)/TiO 2 is higher than those on Cu(0.5 wt)-Fe(0.5wt)/TiO 2 and Cu(1 wt)-Fe(1 wt)/TiO 2 .Owing to the synergistic effect towards ethylene production by using Cu and Fe as co-dopants on the TiO 2 catalyst, the increasing in metal loadings on TiO 2 catalyst that result in their low dispersion on the support could be compensated by the efficient charge transfer mechanism.Consequently, maximum production rate of ethylene is measured on Cu(0.5 wt)-Fe(0.5wt)/TiO 2 with 0.05 and 0.58 mmol/g-cat Ah for glass plate and optical fiber as carriers, respectively. The effect of the number of optical fibers on ethylene production of Cu-Fe/TiO 2 catalyst gives the interesting results shown in Table 8.The more fibers assembled in the reactor, the higher the production rate of ethylene (based per gram catalyst) is measured under the same reaction conditions.The weight of catalyst coated on 117, 216 and 450 optical fibers are 3.5, 6.4 and 13.3 mg, respectively.Accordingly, the higher the amount of catalyst employed in the photoreactor, the higher the production rate of ethylene.In other words, these results imply that the light energy is over supplied in the photoreduction system.Otherwise, the production rate of ethylene could be observed to decrease.There might exist an optimum light intensity to give a maximum quantum yield for a given amount of catalyst in the photoreactor, in which the light energy can be completely utilized.This explanation is well supported by the comparison between the production rate of ethylene over the same catalyst coated on glass plate and optical fiber in Table 7. 72.0 and 6.4 mg of catalyst are measured on the former and latter, respectively.The amount of catalyst coated on glass plate is much higher than that of the optimum value, resulting in the depressed ethylene production rate (on a catalyst weight basis).Meanwhile, 6.4 mg of catalyst coated on 216 optical fibers is not sufficient to give a maximum quantum yield in this photoreduction system.Conclusively, for a given amount of catalyst and light energy, the optical fiber photoreactor is found to be over supplied with light irradiation in our current system, whereas the glass plate counterpart lacks photon adsorption on the catalyst, which gives rise to the superior photoproduction of the former system.Therefore, a higher production rate is expected if more optical fibers can be packed in the current reactor volume.On the other hand, the quantum yield can be increased in our system when less light intensity is supplied. Photoreduction of CO 2 with H 2 O in gaseous phase to methane and ethylene by using optical fibers coated with Cu-Fe/TiO 2 catalyst is reported as the first time in this present study.Optical fiber as a catalyst carrier is found to significantly improve the production rate of ethylene with one order of magnitude higher than that on the glass plate counterpart.Synergistic performance of Cu-Fe/TiO 2 as compared to Cu/ TiO 2 and Fe/TiO 2 catalysts is observed in terms of ethylene production at the quantum yield and total energy efficiency of 0.024 and 0.016, respectively.This result could be ascribed to the efficient charge transfer mechanism between TiO 2 as a support and Cu as well as Fe as co-dopants.Methane is formed more favorably than ethylene on Cu/TiO 2 .Meanwhile, Fe as a co-dopant is found to depress the photoproduction of methane.A rising photo production rate is found by increasing the number of optical fibers under the same light intensity indicating that either the light irradiation is over supplied or more optical fibers can be inserted in the current reactor volume.Light energy can be completely utilized to achieve higher quantum yields with an optimum design.In addition, a higher processing capacity is possible because photocatalyst can be coated on a large external area of optical fibers in a given reactor volume.Therefore, such optical-fiber reactor with commercial scale can be applied to many photoreactions, such as wastewater degradation or bioreactor either in vapor or liquid phase. Fig. 1.Schematic diagram (a) and images (b) of photoreactor with catalyst coated optical fibers. Fig. 2. SEM images of TiO 2 film coated on glass plate (a and b) and on optical fiber (c and d).(a and c) Cross-section and (b and d) surface morphology view. Fig. 3. X-ray diffraction patterns of different catalysts.(a) TiO 2 -P25, (b) Cu(1 wt)/TiO 2 , (c) Fe(1 wt)/TiO 2 and (d) Cu(1 wt)-Fe(1 wt)/TiO 2 . Fig. 4. UV-vis spectroscopy of different catalysts.(a) TiO 2 -P25, (b) Cu(1 wt)/TiO 2 , (c) Fe(1 wt)/TiO 2 and (d) Cu(1 wt)-Fe(1 wt)/TiO 2 . Fig. 6.Production rate of ethylene over various kinds of photocatalysts according to reaction time.() Cu(1 wt)/TiO 2 , () Fe(1 wt)/TiO 2 , () Cu(1 wt)-Fe(1 wt)/TiO 2 .The irradiation source was in UVC range (250-450 nm) with the intensity of 225 mW/cm 2 .Photocatalysts were coated on 216 optical fibers. Cu(1 wt)/TiO 2 0.01 0.24 Fe(1 wt)/TiO 2 0.02 0.08 Cu(1 wt)-Fe(1 wt)/TiO 2 0.04 0.35 Cu(0.5 wt)-Fe(0.5wt)/TiO 2 0.05 0.58 Cu(0.25 wt)-Fe(0.25 wt)/TiO 2 0.03 0.53 a Ethylene production rate was determined on the basis of average production rate after the reaction time of 4 h.The irradiation source was in UVC range (250-450 nm) with the intensity of 225 mW/cm 2 . Fig. 7. Schematic illustration of band edge and charge transfer on Cu-Fe/TiO 2 at pH 5. The thick arrows represent the dominant pathways for hydrogen and oxygen evolution. Specific surface area and band-gap energy of various catalysts Production rate of ethylene over different photocatalysts and carriers under UVC Production rate of ethylene and methane over different photocatalysts under UVA 5 wt)/TiO 2 /optical fiber under UVA a One photon energy at 365 nm is 5.45 A 10 A19 J. Photon energy absorbed by fibers is 17.4 mW (17.4 A 10 A3 J s A1 ).Total numbers of absorbed photon per second are 3.19 A 10 16 . Quantum yield and energy efficiency of ethylene production over different photocatalysts coated on optical fibers under UVC One photon energy at 300 nm is 6.63 A 10 A19 J. Photon energy absorbed by fibers is 280 mW (280 A 10 A3 J s A1 ).Total numbers of absorbed photon per second are 4.22 A 10 17 .Ethylene production rate was determined on the basis of average production rate after the reaction time of 4h.The intensity of irradiation source was 225 mW/cm 2 . a a Production rate of ethylene over Cu(1 wt)-Fe(1 wt)/TiO 2 photocatalyst according to the number of optical fiber Ethylene production rate was determined on the basis of average production rate after the reaction time of 4 h.The irradiation source was in UVC range (250-450 nm) with the intensity of 225 mW/cm 2 . a T.-V.Nguyen, J.C.S. Wu / Applied Catalysis A: General 335 (2008) 112-120 The authors would like to acknowledge the National Science Council of Taiwan for financial supporting of this research under contract no.NSC 96-2911-I-002-323."}, {"title": "Results_and_discussion", "content": "The specific surface area and band-gap energy of various catalysts are shown in Table 1.As TiO 2 is loaded with 1 wt of Cu and Fe, its specific surface area is slightly decreased from 50.00 to 47.74 m 2 /g.Band-gap energy of Cu (1 wt)-Fe (1 wt)/TiO 2 (2.93 eV) is also observed to decrease in comparison with that of bare TiO 2 (3.11 eV). Fig. 2 depicts the SEM images of metal loaded TiO 2 films coated on glass plate and optical fiber.The thickness of the thin films on glass plate and optical fiber are around 12 mm and 878 nm, respectively.Some cracks are observed on the morphological surface of the TiO 2 thin film coated on glass plate.Meanwhile, continuous and uniform thin film of TiO 2 is obtained when coated on optical fiber.This difference is probably due to the thickness of the former is much higher than that of the latter. X-ray diffraction patterns of different catalysts coated as thin films on glass plates are shown in Fig. 3.There is no difference between the X-ray diffraction pattern of bare TiO 2 and that of metal loaded TiO 2 .The result implies that Cu and Fe are well dispersed on the surface of the TiO 2 support. In order to elucidate the UV and visible light absorption of metal loaded TiO 2 films, UV-vis diffuse reflectance spectroscopy of different catalysts are measured and depicted in Fig. 4. Cu as a dopant on TiO 2 does not significantly affect the light absorption property of bare TiO 2 film as shown in Fig. 4b.Nevertheless, when Fe is supported on TiO 2 either with or without Cu as a co-dopant, the derived catalysts appear to absorb visible light with a small peak at around 500 nm of wavelength (Fig. 4c andd).This result could be due to the visible light absorption of iron oxides with band-gap energies of 2.0-2.3 eV 21. Fig. 5 depicts the XPS spectra of Cu(0.5 wt)-Fe(0.5wt)/ TiO 2 catalyst.The binding energies of Cu 2p 3/2 and 2p 1/2 are 931.9 and 951.2 eV, respectively (Fig. 5a), which could be assigned to Cu 2 O compound on the surface of TiO 2 22.Meanwhile, Fig. 5b shows that the binding energies of Fe 2p 3/2 and 2p 1/2 are 710.3 and 725.1 eV, respectively.These binding energies correspond to Fe 2 O 3 compound on the surface of TiO 2 22. In this study, Cu-Fe/TiO 2 catalysts are observed to photoreduce CO 2 with H 2 O to various kinds of products that include significant amounts of ethylene and methane as well as trace amounts of ethane and methanol.The production rate of ethylene over different catalysts coated on optical fibers according to reaction time is presented in Fig. 6.According to the results, the production rate of main products including methane and ethylene over most catalysts, especially Cu-Fe/ TiO 2 , under different reaction conditions reaches to steadystate at around 4 h after turning on the light source.Consequently, the production rate of main products is determined on the basis of average production rate after a reaction time of 4 h.Table 2 presents the production rate of ethylene over different photocatalysts and carriers under UVC (250-450 nm).TiO 2 shows negligible photocatalytic activity towards ethylene production.When either Cu or Fe is loaded on the TiO 2 support, the derived catalysts appear to reduce CO 2 with H 2 O to ethylene.Moreover, as Cu and Fe are employed as co-dopants on the TiO 2 support, the resulting Cu-Fe/TiO 2 catalyst performs the synergistic effect in terms of CO 2 photoreduction to ethylene.The optimum amount of Cu and Fe loading on TiO 2 are determined to be 0.5 wt for each with the corresponding amount of evolved ethylene at 0.58 mmol/g-cat h as shown in Table 2.The production rate of ethylene, based on per gram catalyst, on optical fibers is found to be one order of magnitude higher than that on glass plate. Production rate of ethylene and methane over different photocatalysts under UVA are shown in Table 3.According to the results in Tables 2 and3, the light source does not substantially affect the production rate of ethylene over the catalyst coated on glass plate.The maximum amount of ethylene at 0.05 mmol/gcat h is observed on the Cu(0.5 wt)-Fe(0.5wt)/TiO 2 coated glass plate, which is similar to that under UVC irradiation.Meanwhile, methane production rate over different catalysts presents different trends.The highest amount of methane at 0.19 mmol/g-cat h is measured on Cu(0.25 wt)-Fe(0.25 wt)/ TiO 2 , whereas methane production rate of ca.0.06 mmol/g-cat h is observed on Fe(1 wt)/TiO 2 , Cu(1 wt)-Fe(1 wt)/TiO 2 and Cu(0.5 wt)-Fe(0.5wt)/TiO 2 catalysts. Production rate of ethylene and methane on Cu(0.5 wt)-Fe(0.5wt)/TiO 2 catalyst under UVA on different carriers are shown in Table 4 for comparison.It is interesting that under UVA irradiation, catalysts supported on optical fibers also produces an amount of ethylene one order of magnitude higher than that on glass plate.Moreover, the amount of produced methane on catalysts supported optical fibers is 15 times higher than that on its glass plate counter part. Quantum yields of ethylene and methane production over different catalysts are presented in Tables 5 and6.The quantum yield under UVA is one order of magnitude higher than that under UVC.Because quantum yield is inversely proportional to molar quantity of photons absorbed on catalysts as shown in Eqs. ( 1) and (2), it is also inversely proportional to the photon energy absorbed by optical fibers.The optical fibers used in this study are made of quartz glass, which show on absorption of UVC light (280 A 10 A3 J s A1 per 216 fibers) stronger than that of its UVA counterpart (17.4 A 10 A3 J s A1 per 216 fibers).Consequently, the quantum yield under UVC is much lower than that under UVA owing to the wasted photons absorbed by optical fibers due to heat. The quantum yields of ethylene and methane production on Cu(0.5 wt)-Fe(0.5wt)/TiO 2 catalyst under UVA are found to be similar at values of 0.024 and 0.025, respectively.The data of quantum yields under UVA are comparable to those reported by Aurian-Blajeni et al. for photoreduction of CO 2 in aqueous solution 23.However, the data of quantum yields under UVC are one order of magnitude higher than those reported by Hofstadler et al. for UVC photominerallization of 4-Chlorophenol using TiO 2 immobilized on fused-silica glass fibers 24.a Methane and ethylene production rate were determined on the basis of average production rate after the reaction time of 4h.The irradiation source was in UVA range (320-500 nm) with the intensity of 225 mW/cm 2 . Effect of carrier on production rate of ethylene and methane under UVA Ethylene production rate (mmol/g h) a Methane production rate (mmol/g h) a Cu(0.5 wt)-Fe(0.5wt)/TiO 2 /glass plate 0.05 0.06 Cu(0.5 wt)-Fe(0.5wt)/TiO 2 /optical fiber 0.58 0.91 a Methane and ethylene production rate were determined on the basis of average production rate after the reaction time of 4 h.The irradiation source was in UVA range (320-500 nm) with the intensity of 225 mW/cm 2 . Quantum yield (F) and energy efficiency (h) of ethylene and methane production over Cu(0.5 wt)-Fe(0.Table 7 presents the comparison between ethylene production rate over Cu(0.5 wt)-Fe(0.5wt)/TiO 2 photocatalysts under UVC and UVA irradiation.The production rate of ethylene on this catalyst is comparable under both UVC and UVA.The same result is also observed on two kinds of carriers, glass plate and optical fiber. The effect of the number of optical fibers on the production rate of ethylene over Cu(1 wt)-Fe(1 wt)/TiO 2 photocatalyst is depicted in Table 8.The higher the number of optical fibers in the same volume of photoreactor as well as the same light irradiation condition, the larger the production rate of ethylene obtained. It was interestingly to find that either Cu or Fe alone as a dopant on TiO 2 catalyst shows a fast decline of photoreduction of CO 2 to ethylene as shown in Fig. 6.Cu(1 wt)/TiO 2 strongly reduces CO 2 at the initial 2 h of reaction and significantly decreases its activity thereafter.Meanwhile, Fe(1 wt)/TiO 2 shows relatively low photoactivity and its deactivation is also observed after 2 h of the reaction.There are a large number of previous reports about the electrochemical reduction of CO 2 at copper electrode 2526272829, which present the selective formation of methane and ethylene as final products of this reaction.On the other hand, Fe metal electrode in aqueous hydrogen carbonate solution was found to only slightly produce methane 25.Accordingly, the data in this present study imply to some extent that the photocatalytic and electrocatalytic activities of copper compounds are consistent with one another in terms of CO 2 reduction with H 2 O to ethylene.Nevertheless, owing to the lack of an efficient ''anode'' to oxidize H 2 O, the photocatalytic activity of Cu(1 wt)/TiO 2 catalyst becomes significantly depressed because of charge recombination as shown in Fig. 6. As Fe is a transition metal that has a set of consecutive oxidation states, typically Fe 2 /Fe 3 , the deliberate employment of Fe as a co-dopant on Cu/TiO 2 catalyst in this study could be a good process to shuttle the holes from TiO 2 to H 2 O. Consequently, photocatalytic activity and stability of Cu-Fe/ TiO 2 are much superior than those of Cu/TiO 2 and Fe/TiO 2 as presented in Table 2 and Fig. 6.Additionally, iron oxide is also well known as a good photocatalyst in terms of visible light absorption 21, which is well supported by the UV-vis DRS spectroscopy in Fig. 4. As a result, the photocatalytic activities of Cu-Fe/TiO 2 catalyst are observed to be comparable under UVA and UVC irradiation (Table 7). It has been reported that the conduction band of iron oxide by Mott-Schottky measurements is slightly above 30,31 and below 32,33 the H /H 2 half-cell potential.The former claims were later confirmed by the report of Somorjai and Damme 21 who measured the flat-band potential of iron oxide varying between A0.9 and A1.1 V (vs.SCE) at pH 13.This value was well supported by the photocatalytic activity of iron oxide to decompose water to hydrogen 21.Based on the flat-band potential of A1.1 V (vs.SCE) and band-gap energy of 2.2 eVof iron oxide 21 along with the band edge structure of TiO 2 34,35 and redox potential of CO 2 /C 2 H 4 29, the synergistic performance of Cu-Fe/TiO 2 catalyst towards photocatalytic reduction of CO 2 to ethylene could be well explained by the charge transfer mechanism as depicted in Fig. 7.The difference of flat-band potential between TiO 2 , A0.42 eV, and iron oxide, A0.39 eV, causes the effective charge separation and the improved photoproduction of ethylene.Since the flat-band potential and valence band of iron oxide are lower and higher than those of TiO 2 , respectively, photo-excited electrons and holes would tend to recombine easily provided that the transfer speeds of electrons and holes from TiO 2 to iron oxide were almost the same.However, the cooperative motion of the holes is an inherently slower process than that of electrons, which is ascribed to the much higher mobility of the latter than the former 36.As a result, the electrons transferred from TiO 2 to iron oxide or copper oxide easily reduce CO 2 to produce ethylene before they recombine with the holes which are moving from TiO 2 to iron oxide or directly taking part in the oxygen formation reaction on the TiO 2 surface.Accordingly, the effective reduction of CO 2 for the production of ethylene is taken place by the electron moved from TiO 2 to iron oxide and to copper oxide.Meanwhile, oxygen seems to be mainly evolved by the holes on TiO 2 itself rather than the holes transferred from TiO 2 to iron oxide, resulting in the improvement of photocatalytic performance due to the reverse flows of electrons and holes as shown in Fig. 7.This phenomenon was also observed in the previous study for the RuS 2 /TiO 2 -SiO 2 catalyst in the reaction of photocatalytic decomposition of water to hydrogen 35. The data in Table 3 for methane production infer that the presence of Fe in Cu/TiO 2 catalyst seems to depress the evolution of methane.It was well known that the electrochemical reduction of CO 2 on single crystal copper electrodes formed various kinds of hydrocarbon products depending on its index planes 28,37,38.Ethylene was formed more favorably than methane on the (1 0 0) electrode whereas methane was predominantly produced on the (1 1 1) surface 38.Cu/TiO 2 in this present study favorably produces methane rather than ethylene, which implies that Cu as a dopant on TiO 2 catalyst might be in the form of (1 1 1) surface to some extent.Meanwhile, Fe/TiO 2 shows relatively low photoactivity to produce methane as compared to the Cu counterpart, which is consistent with a previous study 25.Although Fe as a codopant on Cu/TiO 2 catalyst is observed to give rise to the synergistic performance of CO 2 reduction to ethylene, it substantially decreases the photoactivity towards methane production.High dispersion of metal dopants on supports was widely agreed to enhance the activities of derived catalysts 21.Accordingly, the presence of Fe on Cu/TiO 2 somehow decreases the high dispersion of Cu on TiO 2 resulting in the decline of methane evolution on Cu-Fe/TiO 2 catalyst.This explanation could be supported by the result that the production rate of methane on Cu(0.25 wt)-Fe(0.25 wt)/TiO 2 is higher than those on Cu(0.5 wt)-Fe(0.5wt)/TiO 2 and Cu(1 wt)-Fe(1 wt)/TiO 2 .Owing to the synergistic effect towards ethylene production by using Cu and Fe as co-dopants on the TiO 2 catalyst, the increasing in metal loadings on TiO 2 catalyst that result in their low dispersion on the support could be compensated by the efficient charge transfer mechanism.Consequently, maximum production rate of ethylene is measured on Cu(0.5 wt)-Fe(0.5wt)/TiO 2 with 0.05 and 0.58 mmol/g-cat Ah for glass plate and optical fiber as carriers, respectively. The effect of the number of optical fibers on ethylene production of Cu-Fe/TiO 2 catalyst gives the interesting results shown in Table 8.The more fibers assembled in the reactor, the higher the production rate of ethylene (based per gram catalyst) is measured under the same reaction conditions.The weight of catalyst coated on 117, 216 and 450 optical fibers are 3.5, 6.4 and 13.3 mg, respectively.Accordingly, the higher the amount of catalyst employed in the photoreactor, the higher the production rate of ethylene.In other words, these results imply that the light energy is over supplied in the photoreduction system.Otherwise, the production rate of ethylene could be observed to decrease.There might exist an optimum light intensity to give a maximum quantum yield for a given amount of catalyst in the photoreactor, in which the light energy can be completely utilized.This explanation is well supported by the comparison between the production rate of ethylene over the same catalyst coated on glass plate and optical fiber in Table 7. 72.0 and 6.4 mg of catalyst are measured on the former and latter, respectively.The amount of catalyst coated on glass plate is much higher than that of the optimum value, resulting in the depressed ethylene production rate (on a catalyst weight basis).Meanwhile, 6.4 mg of catalyst coated on 216 optical fibers is not sufficient to give a maximum quantum yield in this photoreduction system.Conclusively, for a given amount of catalyst and light energy, the optical fiber photoreactor is found to be over supplied with light irradiation in our current system, whereas the glass plate counterpart lacks photon adsorption on the catalyst, which gives rise to the superior photoproduction of the former system.Therefore, a higher production rate is expected if more optical fibers can be packed in the current reactor volume.On the other hand, the quantum yield can be increased in our system when less light intensity is supplied."}, {"title": "Conclusions", "content": "Photoreduction of CO 2 with H 2 O in gaseous phase to methane and ethylene by using optical fibers coated with Cu-Fe/TiO 2 catalyst is reported as the first time in this present study.Optical fiber as a catalyst carrier is found to significantly improve the production rate of ethylene with one order of magnitude higher than that on the glass plate counterpart.Synergistic performance of Cu-Fe/TiO 2 as compared to Cu/ TiO 2 and Fe/TiO 2 catalysts is observed in terms of ethylene production at the quantum yield and total energy efficiency of 0.024 and 0.016, respectively.This result could be ascribed to the efficient charge transfer mechanism between TiO 2 as a support and Cu as well as Fe as co-dopants.Methane is formed more favorably than ethylene on Cu/TiO 2 .Meanwhile, Fe as a co-dopant is found to depress the photoproduction of methane.A rising photo production rate is found by increasing the number of optical fibers under the same light intensity indicating that either the light irradiation is over supplied or more optical fibers can be inserted in the current reactor volume.Light energy can be completely utilized to achieve higher quantum yields with an optimum design.In addition, a higher processing capacity is possible because photocatalyst can be coated on a large external area of optical fibers in a given reactor volume.Therefore, such optical-fiber reactor with commercial scale can be applied to many photoreactions, such as wastewater degradation or bioreactor either in vapor or liquid phase. Fig. 1.Schematic diagram (a) and images (b) of photoreactor with catalyst coated optical fibers. Fig. 2. SEM images of TiO 2 film coated on glass plate (a and b) and on optical fiber (c and d).(a and c) Cross-section and (b and d) surface morphology view. Fig. 3. X-ray diffraction patterns of different catalysts.(a) TiO 2 -P25, (b) Cu(1 wt)/TiO 2 , (c) Fe(1 wt)/TiO 2 and (d) Cu(1 wt)-Fe(1 wt)/TiO 2 . Fig. 4. UV-vis spectroscopy of different catalysts.(a) TiO 2 -P25, (b) Cu(1 wt)/TiO 2 , (c) Fe(1 wt)/TiO 2 and (d) Cu(1 wt)-Fe(1 wt)/TiO 2 . Fig. 6.Production rate of ethylene over various kinds of photocatalysts according to reaction time.() Cu(1 wt)/TiO 2 , () Fe(1 wt)/TiO 2 , () Cu(1 wt)-Fe(1 wt)/TiO 2 .The irradiation source was in UVC range (250-450 nm) with the intensity of 225 mW/cm 2 .Photocatalysts were coated on 216 optical fibers. Cu(1 wt)/TiO 2 0.01 0.24 Fe(1 wt)/TiO 2 0.02 0.08 Cu(1 wt)-Fe(1 wt)/TiO 2 0.04 0.35 Cu(0.5 wt)-Fe(0.5wt)/TiO 2 0.05 0.58 Cu(0.25 wt)-Fe(0.25 wt)/TiO 2 0.03 0.53 a Ethylene production rate was determined on the basis of average production rate after the reaction time of 4 h.The irradiation source was in UVC range (250-450 nm) with the intensity of 225 mW/cm 2 . Fig. 7. Schematic illustration of band edge and charge transfer on Cu-Fe/TiO 2 at pH 5. The thick arrows represent the dominant pathways for hydrogen and oxygen evolution. Specific surface area and band-gap energy of various catalysts Production rate of ethylene over different photocatalysts and carriers under UVC Production rate of ethylene and methane over different photocatalysts under UVA 5 wt)/TiO 2 /optical fiber under UVA a One photon energy at 365 nm is 5.45 A 10 A19 J. Photon energy absorbed by fibers is 17.4 mW (17.4 A 10 A3 J s A1 ).Total numbers of absorbed photon per second are 3.19 A 10 16 . Quantum yield and energy efficiency of ethylene production over different photocatalysts coated on optical fibers under UVC One photon energy at 300 nm is 6.63 A 10 A19 J. Photon energy absorbed by fibers is 280 mW (280 A 10 A3 J s A1 ).Total numbers of absorbed photon per second are 4.22 A 10 17 .Ethylene production rate was determined on the basis of average production rate after the reaction time of 4h.The intensity of irradiation source was 225 mW/cm 2 . a a Production rate of ethylene over Cu(1 wt)-Fe(1 wt)/TiO 2 photocatalyst according to the number of optical fiber Ethylene production rate was determined on the basis of average production rate after the reaction time of 4 h.The irradiation source was in UVC range (250-450 nm) with the intensity of 225 mW/cm 2 . a T.-V.Nguyen, J.C.S. Wu / Applied Catalysis A: General 335 (2008) 112-120 The authors would like to acknowledge the National Science Council of Taiwan for financial supporting of this research under contract no.NSC 96-2911-I-002-323."}]