[{"title": "Doi", "content": "10.1039/c7ra00765e"}, {"title": "Article_Title", "content": "La<sub>2</sub>Sn<sub>2</sub>O<sub>7</sub> enhanced photocatalytic CO<sub>2</sub> reduction with H<sub>2</sub>O by deposition of Au co-catalyst"}, {"title": "Abstract", "content": "La 2 Sn 2 O 7 (LSO) micro/nanospheres, synthesized by a hydrothermal method, exhibited photocatalytic performance for CO 2 reduction.The evolution rate of the main reduction products (CH 4 and CO) was 0.20 and 0.10 mmol h A1 , respectively.Loading of Au co-catalyst over La 2 Sn 2 O 7 efficiently enhanced the photocatalytic activity of CO 2 reduction.The highest photocatalytic efficiency was obtained over 1 wt Au/La 2 Sn 2 O 7 with an apparent quantum yield (AQY) of 2.54.Characterization techniques including SEM, TEM, XRD, XPS, DRS, PL, and electrochemical analysis were applied and the physicochemical properties of La 2 Sn 2 O 7 and Au/La 2 Sn 2 O 7 samples are discussed.A possible mechanism of photocatalytic CO 2 reduction over Au/La 2 Sn 2 O 7 is proposed."}, {"title": "Experimental", "content": "La 2 Sn 2 O 7 was fabricated via a hydrothermal method.In a typical experiment, 2 mmol La(NO 3 ) 3 6H 2 O and 2 mmol Na 2 SnO 3 were dissolved in 40 mL DI water at room temperature with stirring to form a homogeneous solution.Then, Na 2 SnO 3 solution was added into the La(NO 3 ) 3 solution drop by drop with vigorous stirring.The resulting suspension was transferred into a 100 mL Teon-lined stainless steel autoclave and hydrothermally treated at 200 C for 12 h, and then cooled naturally.The precipitate was collected by centrifugation and washed several times with distilled water before drying at 60 C to obtain the nal product.Au nanoparticles were deposited on the surface of La 2 Sn 2 O 7 (Au/La 2 Sn 2 O 7 ) by a NaBH 4 reduction method.The La 2 Sn 2 O 7 powders were dissolved in 100 mL H 2 O by ultrasonic dispersion and an appropriate volume of HAuCl 4 solution (5 mg Au mL A1 ) was added.Aer vigorous stirring for 12 hours, the resulting mixture was reduced with NaBH 4 solution (0.1 M), then centrifuged and washed thoroughly with distilled water, and dried at 60 C for 12 h.The gold contents of the samples were estimated by precursor feeding.The values for the actual Au loading of the synthesized catalysts were obtained by using an inductively coupled plasma mass spectrometer (ICP-MS, OPTIMA 8000), and summarized in Table S1. Powder X-ray diffraction (XRD) data was collected using a Bruker D8 Advance instrument (Cu Ka1 irradiation, 141.5406 A).Morphological images of the surfaces and transmission electron micrographs were obtained using a Nova NanoSEM 230 microscope (FEI Corp) and a JEOL JEM 2010F microscope.UV-vis diffuse reectance spectra (DRS) were measured using a Varian Cary 500 Scan, with BaSO 4 as a reference.X-ray photoelectron spectroscopy (XPS) measurements were performed on an ESCALAB 250 photoelectron spectroscope system.Brunauer-Emmett-Teller (BET) specic surface area and CO 2 adsorption were recorded using an ASAP2020M apparatus.Electrochemical experiments were performed in a three-electrode cell made of quartz.A Pt plate and Ag/AgCl electrode served as the counter electrode and reference electrode, respectively.The working electrode was made by dip-coating a catalyst slurry (10 mg mL A1 in EtOH) on uorine-doped tin oxide (FTO) glasses, whose area was set as ca.0.5 cm A 0.5 cm, and then was air-dried naturally.Electrochemical experiments were determined by a Zennium electrochemical workstation (Zahner Elektrik, Germany).The Mott-Schottky experiments and photocurrent response behaviors were conducted on a Precision PARC workstation.A 0.2 M Na 2 SO 4 aqueous solution was used as the electrolyte for the two experiments.A 300 W Xe lamp (CEL-S500/350) was utilized as the light source for the photocurrent response behavior test.Electrochemical impedance spectroscopy (EIS) experiments were conducted on a CHI660D workstation (CH instrument) in an electrolyte of 0.5 M KCl aqueous solution containing 0.01 M K 3 Fe(CN) 6 /K 4 Fe(CN) 6 (1 : 1).Photoluminescence (PL) spectra were carried out on an Edinburgh instrument FLS980 spectrophotometer at ambient conditions. Photocatalytic reactions for CO 2 reduction were carried out at 1 atm CO 2 partial pressure in a 200 mL reactor, with an irradiation quartz reaction cell inside of it.50 mg photocatalyst was added into the quartz reactor and dispersed in 140 mL H 2 O.A 125 W high-pressure mercury lamp (GGZ125, Shanghai Yaming Lighting Co, Ltd with a maximum emission at about 365 nm) was used as the light source and the reactor was kept invariably at 20 C by owing cooling water during the reaction process.The whole reaction system was rst evacuated by a mechanical pump to remove air before irradiation, then CO 2 (99.999 purity) was introduced into the reactor for 40 minutes to establish an adsorption-desorption balance and provide the necessary reaction gas.Gas products were detected by GC (Agilent 6890N) and the apparent quantum yield (AQY) was also measured under the same photocatalytic reaction conditions.The incident light intensity of a high pressure mercury lamp was measured by Spectri Light ILT950.The total number of incident photons was collected by a calibrated silicon photodiode. The apparent quantum yield (AQY) was calculated from the following equations: AQY 14 number of reacted electrons number of incident photons A 100"}, {"title": "Results_and_discussion", "content": "of metal loading and homogenous dispersion of Au on the La 2 Sn 2 O 7 . Morphology and sizes of the samples were characterized by SEM and TEM.The La 2 Sn 2 O 7 sample shows micro/nanospheres with diameters that varied from 300 to 500 nm, assembled by densely arranged nanoparticles (Fig. 2a).The TEM of the 1 wt Au/La 2 Sn 2 O 7 sample indicates few Au NPs dispersed on the La 2 Sn 2 O 7 surface (Fig. 2b).The HRTEM image of the 1 wt Au/ La 2 Sn 2 O 7 sample (Fig. 2c) shows a lattice spacing of ca.0.234 nm, corresponding to the (111) planes of Au NPs, 30,31 and the size of the Au particle is about 5-7 nm.Meanwhile, the lattice spacing of the La 2 Sn 2 O 7 structure is ca.0.309 nm, corresponding to the (222) plane of cubic La 2 Sn 2 O 7 .Furthermore, the obtained EDX pattern corresponding to Fig. 2d shows the presence of La, Sn, O, Au, and Cu elements (Cu peaks arise from TEM grid), and the obtained EDX-mapping (Fig. S1 ) shows uniform distribution of the elements. An X-ray photoelectron spectroscopy (XPS) survey spectrum of the prepared 1 wt Au/La 2 Sn 2 O 7 sample (Fig. S2 ) indicates the presence of La, Sn, O, and Au.No other element signal is found except for a C signal (attributed to adventitious carbon), in accord with the results of EDX (Fig. 2d).In the high resolution XPS spectrum of Au 4f (Fig. 3a), two main peaks located at 82.7 and 86.4 eV correspond to Au 0 4f 7/2 and Au 0 4f 5/2 . 32And the Au 0 4f 7/2 negative binding energy shi of 1.4 eV, compared with that of bulk metallic Au 0 (84.1 eV), indicates strong interactions between Au and La 2 Sn 2 O 7 . 33With regard to La 3d (Fig. 3b), the binding energies of La 3d 5/2 and La 3d 3/2 peaks are present at 836.1 and 853.2 eV with the shake-up peaks located at 840.2 and 857.3 eV, respectively, consistent with the reported results of La 3 in a La(III) oxidation state. 34The Sn 3d XPS spectra (Fig. 3c) show two main peaks at 486.2 eV (Sn 3d 5/2 ) and 494.7 eV (Sn 3d 3/2 ) with the shake-up peaks located at 488.3 and 496.7 eV, 35 which may be assigned to the characteristic of Sn 4 .As for O 1s XPS spectra (Fig. 3d), the O 1s signal could be t into two peaks, and the peaks located at 528.7 and 531.2 eV are ascribed to the crystal lattice oxygen and surface hydroxyl, respectively. 36e UV-vis diffused reection spectra of the samples are shown in Fig. 4. Onset of the absorption edge for the La 2 Sn 2 O 7 is at about 315 nm.The corresponding bandgap energy (E g ) is estimated to be 3.93 eV, as determined by equation E 14 1240/l.Compared to bare La 2 Sn 2 O 7 materials, the absorption edge of Au/ La 2 Sn 2 O 7 samples does not change, suggesting that Au is only loaded on the surface of La 2 Sn 2 O 7 rather than being incorporated into the lattice of La 2 Sn 2 O 7 . 37Meanwhile, an intense absorption band is centered at 531 nm, which could be assigned to the SPR of the Au NPs. 38It can be seen that Au loading enhances the light absorption of La 2 Sn 2 O 7 samples, and the absorption intensity heightens along with increased Au doping amounts. The BET surface area (S BET ) of the prepared samples was investigated by N 2 adsorption-desorption measurements.The S BET of the as-prepared La 2 Sn 2 O 7 and 1 wt Au/La 2 Sn 2 O 7 were measured to be 75.6 and 70.6 m 2 g A1 (Fig. S3 ), respectively.The wide pore size distribution curves (Fig. S4 ) indicate stacking among the small La 2 Sn 2 O 7 nanoparticles.Meanwhile, CO 2 adsorption over the samples was also measured and results are shown in Fig. 5.The CO 2 adsorption amounts of the La 2 Sn 2 O 7 and 1 wt Au/La 2 Sn 2 O 7 samples are 11.65 and 10.07 cm 3 g A1 (Fig. 5), respectively.1 wt Au/La 2 Sn 2 O 7 shows a lower CO 2 adsorption capability compared to La 2 Sn 2 O 7 , which may be due to some surface CO 2 adsorption sites, such as La species over La 2 Sn 2 O 7 , that are covered with deposited Au nanoparticles. 39s shown in Fig. 6, the at-band potential of La 2 Sn 2 O 7 determined from Mott-Schottky plots is ca.A0.89 V vs. Ag/AgCl at pH 7 (equivalent to A0.69 V vs. NHE at pH 7).The positive slopes of these plots suggest that La 2 Sn 2 O 7 is an n-type semiconductor. 40With regard to the n-type semiconductor, the conduction band lies very close to the at-band potentials. 41herefore, the conduction band (E CB ) of La 2 Sn 2 O 7 is A0.79 V vs. NHE at pH 7, which is more negative than the redox potential of CO 2 /CO (A0.53 V vs. NHE), CO 2 /CH 4 (A0.24V vs. NHE), and H 2 O/H 2 (A0.41 V vs. NHE).So, it is thermodynamically possible that the photogenerated electrons in the prepared La 2 Sn 2 O 7 reduce CO 2 with H 2 O to CO, CH 4 , and H 2 . Photocatalytic CO 2 reduction activities of the samples were investigated under mild conditions without any sacricial reagents.As shown in Fig. 7a, the samples exhibited photocatalytic performance for CO 2 reduction with H 2 O, and CH 4 , CO, and H 2 are the main reduction products; other products such as CH 3 OH, HCHO, and HCOOH were not detected during the reaction.The output products of CH 4 , CO, and H 2 , over bare La 2 Sn 2 O 7 were 0.60, 0.31, and 6.90 mmol aer 3 h irradiation, corresponding to the evolution rates of 0.20, 0.10, and 2.30 mmol h A1 , respectively, with an apparent quantum yield (AQY) of 0.89, which is superior to the P25 sample with a AQY of 0.68 (Table S2 ).Aer loading Au, the samples exhibited better photocatalytic CO 2 reduction activities.The evolution rate of the main products increased with addition of Au.When the loading amount of Au reached 1.0 wt, the evolution rate of CH 4 , CO, and H 2 increased to the max of 0.43, 0.37, and 6.98 mmol h A1 , respectively (Fig. 7b), which was 2.2, 3.7, and 3.0 times as high as that of bare La 2 Sn 2 O 7 .The generation of H 2 , CH 4 , and CO over 1.0 wt Au/La 2 Sn 2 O 7 increased almost linearly with irradiation time (Fig. 7b), and their outputs are 2.05, 1.74, and 33.08 mmol aer 5 h irradiation, respectively, with an apparent quantum yield (AQY) (2.54) enhanced by 3 times more than the La 2 Sn 2 O 7 sample. The amount of O 2 formed was also measured to determine charge balance during the photocatalytic reaction.Aer a 5 h photocatalytic reaction over the 1.0 wt Au/La 2 Sn 2 O 7 sample, the amount of O 2 was 21.08 mmol.Supposing that the oxidation of H 2 O to O 2 is the only reaction to expend the photogenerated holes, and the photogenerated electrons are used to form CH 4 , CO, and H 2 , then the stoichiometric molar ratio of O 2 /(4CH 4 H 2 CO) should be 0.5.The molar ratio of O 2 /(4CH 4 H 2 CO) calculated from our results is 0.49, which is reasonably close to the stoichiometric ratio. Stability is very important for practical photocatalytic systems; thus cyclic testing of the photocatalytic CO 2 reduction activities was performed to investigate stability.During the 4 times repeated reaction cycles of a 1 wt Au/La 2 Sn 2 O 7 sample (Fig. S5 ), there was no distinct decrease in H 2 , CH 4 , and CO evolution rates, thus demonstrating that the 1 wt Au/La 2 Sn 2 O 7 sample shows considerable photostability. Control experiments were also carried out.No product was detected in the reaction system in the dark or without catalyst, indicating that the CO 2 reduction requires presence of a photocatalyst.Only H 2 was detected when CO 2 was replaced by high purity N 2 in the reaction system.This result suggests that the formed reduced products originated from CO 2 and not from other sources of contamination. Transient photocurrent responses of the La 2 Sn 2 O 7 and 1 wt Au/La 2 Sn 2 O 7 samples were measured under intermittent UV-vis illumination.As shown in Fig. 8a, the transient photocurrent of a 1 wt Au/La 2 Sn 2 O 7 sample was much higher than that of the bare La 2 Sn 2 O 7 , indicating a more efficient separation and longer lifetime of photogenerated charge carriers with the loading of Au. 42 It has been proven that a smaller arc radius in a Nyquist plot implies a more effective charge separation of electron-hole pairs and a faster interfacial charge transfer. 43,44he impedance arc of 1 wt Au/La 2 Sn 2 O 7 is much smaller than that of La 2 Sn 2 O 7 (Fig. 8b), corresponding to its higher speed of charge separation of electron-hole pairs and interfacial charge transfer, which agrees well with their photocatalytic performances as discussed above.Meanwhile, photoluminescence spectra of the La 2 Sn 2 O 7 and 1 wt Au/La 2 Sn 2 O 7 samples with an excitation wavelength of 310 nm are shown in Fig. 9.A strong PL emission spectrum centered around 410 nm is observed over the La 2 Sn 2 O 7 , which comes from a trap-state emission, originating from the anion (O 2A ) or cation (La 3 and Sn 4 ) vacancy defects, and other crystallographic defects. 45Aer loading Au on La 2 Sn 2 O 7 , the emission intensity remarkably decreases, indicating enhancement of the separation and transfer of photogenerated electrons and holes.This result also is in accordance with the photocurrent performance.All the observations above highlight the function of the Au co-catalyst for enhancing charge transfer, leading to a higher photocatalytic efficiency. The mechanism for CO 2 reduction with H 2 O over Au/ La 2 Sn 2 O 7 is proposed as shown in Fig. 10.When light with photon energy higher or equal to the band gap of La 2 Sn 2 O 7 is incident on the sample, then electrons and holes are generated in the CB and VB, respectively.Photogenerated electrons on the CB are transferred to the absorbed CO 2 and H to produce CH 4 , CO or H 2 on the surface of La 2 Sn 2 O 7 .Simultaneously, holes on the VB edge of La 2 Sn 2 O 7 are positive enough to oxidize water to form O 2 .The deposited Au acts as a co-catalyst which facilitates transfer of photoexcited electrons and prevents the recombination of photoexcited electrons and holes."}, {"title": "Conclusions", "content": "Fig. 1 XRD patterns of the La 2 Sn 2 O 7 and Au/La 2 Sn 2 O 7 samples. Fig. 2 (a) SEM image of the La 2 Sn 2 O 7 sample; (b) TEM image; (c) HRTEM image; (d) EDX pattern of the 1 wt Au/La 2 Sn 2 O 7 sample. Fig. 3 XPS spectra of the 1 wt Au/La 2 Sn 2 O 7 sample: (a) Au element; (b) La element; (c) Sn element; and (d) O element. Fig. 4 The UV-vis diffused reflection spectra of La 2 Sn 2 O 7 and Au/ La 2 Sn 2 O 7 samples. Fig. 5 CO 2 adsorption isotherms of La 2 Sn 2 O 7 and 1 wt Au/La 2 Sn 2 O 7 samples. Fig. 7 (a) The output of CH 4 , CO, and H 2 over La 2 Sn 2 O 7 and Au/ La 2 Sn 2 O 7 samples under irradiation for 3 h; (b) CH 4 , CO, and H 2 formed as a function of irradiation time over 1 wt Au/La 2 Sn 2 O 7 samples. Sn 2 O 7 micro/nanospheres were successfully synthesized by a facile hydrothermal method and Au nanoparticles were deposited on La 2 Sn 2 O 7 via H 2 AuCl 6 impregnation followed by NaBH 4 reduction.The prepared La 2 Sn 2 O 7 sample showed photocatalytic CO 2 reduction activities and CH 4 , CO, and H 2 were the main reduction products.Deposition of an Au cocatalyst signicantly improved photocatalytic performance.The highest evolution rates of CH 4 , CO, and H 2 were observed over 1.0 wt Au/La 2 Sn 2 O 7 samples with 0.43, 0.37, and 6.98 mmol h A1 , respectively.The apparent quantum yield (AQY) was 2.54, which was enhanced by 3 times in contrast to bare La 2 Sn 2 O 7 .An Au co-catalyst plays an excellent role as an electron transfer mediator.Our results indicate promising application of the La 2 Sn 2 O 7 photocatalyst for CO 2 reduction.Moreover, Au nanoparticles could be superior candidates for a co-catalyst to enhance CO 2 reduction activities.Notes and references 1 L. Yuan and Y. J. Xu, Appl.Surf.Sci., 2015, 342, 154-167. Fig. 8 (a) Transient photocurrent response; (b) Nyquist plots of La 2 Sn 2 O 7 and 1 wt Au/La 2 Sn 2 O 7 samples. Fig. 9 Photoluminescence (PL) spectra of La 2 Sn 2 O 7 and 1 wt Au/ La 2 Sn 2 O 7 samples collected at the excitation wavelength of 310 nm. Fig. 10 Proposed mechanism of photocatalytic CO 2 reduction over La 2 Sn 2 O 7 with Au co-catalyst. This journal is The Royal Society of Chemistry 2017 This work was nancially supported by the NSFC (Grants No. U1305242, 21373050), the National Key Basic Research Program of China (973 Program: 2013CB632405, 2014CB239303, 2014CB260410, 2014BAC13B03)."}]