[{"title": "Doi", "content": "10.1016/j.cattod.2012.12.022"}, {"title": "Article_Title", "content": "Effect of copper on the performance of ZnO and ZnO1−xNx oxides as CO2 photoreduction catalysts"}, {"title": "Abstract", "content": "The photocatalytic conversion of carbon dioxide using water as electron donor to produce fuels, frequently known as artificial photosynthesis (AP), has a great interest due to its potential to reduce anthropogenic CO 2 emissions.In this paper, ZnO-based materials have been investigated as photocatalysts for the AP process.Different synthesis approaches have been studied in order to improve the physicochemical properties of ZnO-based materials.The effect of a variety of chemical and morphological modifications has been explored as a way to enhance the photocatalytic properties of this semiconductor: a) N-doping to produce changes in the band structure, b) use of a porogen agent to improve the textural properties, leading to a mesoporous ZnO, and c) Cu deposition and doping to induce a decrease of the electrons-holes recombination rate and also to act as co-catalyst.The best results have been obtained with the Cu addition over the mesoporous ZnO, resulting in an enhancement of the CO 2 conversion and leading to the formation of CO, H 2 , CH 4 and CH 3 OH as main products."}, {"title": "Experimental", "content": "The synthesis of ZnO doped with N and Cu was performed by SC method using Zn(NO 3 ) 2 6H 2 O and urea as zinc and nitrogen precursors, respectively.The reagents were placed, with a Zn:urea molar ratio of 1, in a 250 ml beaker with 10 ml of distilled water, and the mixture was stirred vigorously for homogenizing.Then, the beaker was placed into a furnace for 15 min at 723 K. Within 1 min, the water was evaporated and subsequently the thermal decomposition of urea started leading to an exothermic self-propagating redox reaction of Zn salts and urea (fuel).The material obtained after 15 min is a yellow-orange solid and the sample is termed as ZNO. Copper catalysts were prepared using two methodologies: In the first one, Cu and N were incorporated at the same time during SC method.Zn:urea molar ratio of 1 was employed, while the amount of Cu(NO 3 ) 2 3H 2 O corresponded with 1.5 wt of Cu in the resultant material.The preparation was carried out in a furnace for 15 min at 723 K and the material is named as Cu-ZNU.In the second preparation method, Cu was deposited over the ZNO sample by wet impregnation using a rotavapor.As in the previous case, Cu(NO 3 ) 2 3H 2 O was selected as Cu precursor to deposit a Cu charge of 1.5 wt (1.5Cu/ZNO).After that, the solid was dried overnight at 373 K and calcined at 673 K for 4 h. A mesoporous zinc oxide catalyst was prepared under hydrothermal conditions using Pluronic-123 as porogen reagent (ZnO-M).A solution with Zn(CH 3 COO) 2 2H 2 O (0.015 mol) and CO(NH 2 ) 2 (0.15 mol) was prepared in deionized water (210 ml) at room temperature and then Pluronic-123 (0.015 10 -3 mol) was added with magnetic stirring to yield a transparent solution.The pH value of the solution was adjusted to 5 by addition of acetic acid.After stirring for another 2 h, the resulting solution was transferred into a hydrothermal kettle and treated at 373 K for 24 h.The solid product was filtered off, washed with deionized water several times to neutral, and dried in an oven at 353 K overnight, followed by calcination in air under static conditions at 673 K for 4 h.Subsequently, Cu impregnation was performed by wet impregnation using a rotavapor and Cu(NO 3 ) 2 3H 2 O as precursor.Cu loadings selected were 0.5 wt, 1.5 wt and 3 wt, respectively.Subsequently, the solid was dried overnight at 373 K and calcined at 673 K for 4 h. Specific surface areas of the samples were calculated from N 2 adsorption-desorption isotherms at 77 K that were measured on a QUADRASORB instrument.The samples were also characterized by X-ray powder diffraction (XRD) with a Philips PW 3040/00 X'Pert MPD/MRD diffractometer using Cu K radiation ( 1.54178A) at a scanning rate of 0.2 s -1 .A Philips Tecnai 20 Transmission Electron Microscope, operating with a tungsten filament working at 200 kV, was used to obtain microimages.Optical measurements were performed with a DRS UV/Vis/NIR PerkinElmer Lambda 1050 spectrometer, while photoluminescence experiments were carried out using a Fluorescence Spectrometer PerkinElmer LS 55, with an excitation wavelength of 280 nm using a cut-off filter at 350 nm.Metallic content of photocatalysts has been quantified by Induced Coupled Plasma Atomic Emission Spectrometer (ICP-AES, PerkinElmer 2300 DV).The nitrogen content of the samples was determined by CHNOS analysis using a Vario EL III analyzer with temperatures in the oven and in the reduction coil of 1423 and 1123 K, respectively, equipped with a thermal conductivity detector. CO 2 photoreduction experiments were conducted in a homemade batch reactor system.The gas-phase photoreactor cell was made of steel with an effective volume of 22 ml.The catalyst (0.01 g) was deposited on a glass microfiber filter.It was illuminated by one 8 W fluorescent tube (Philips, Actinic BL) with a maximum spectrum intensity at 369 nm that were placed over the reactor and close to the reactor window in order to maximize the photocatalyst irradiation.The lamp irradiance (average intensity 7 mW/cm 2 ) was measured using a StellarNet Inc. spectrometer. Compressed CO 2 (99.98,Air Liquid) and water, controlled by mass flow controllers, were passed through a controller evaporator mixer (CEM) at a molar ratio of 6.7 (CO 2 :H 2 O) to generate a mixture of CO 2 and water vapour.The reactor was tightly closed and maintained at a pressure of 2 bar and a temperature of 323 K.After 12 h of illumination the reaction mixture was analyzed in a gas chromatograph equipped with three columns (Hayesep, Molecular sieve and CP-Sil 5) and three detectors (a TCD and two FID).H 2 , CH 4 , CO and CH 3 OH were detected as the main reaction products. The quantum yield index (QYI) was defined according to Eq. ( 1) to evaluate the photoactivity by comparing the synergetic effect of copper with respect to bare ZnO-M semiconductor: where AQY (apparent quantum yield) is defined as follows: AQY product yield number of electrons implied number of photons (2)"}, {"title": "Results_and_discussion", "content": "Two different methods have been selected to modify the structural, morphological, optical and photocatalytic properties of ZnO.One method consists of the introduction of a non-metal (nitrogen) in the ZnO structure.In the second method, copper has been selected as a co-catalyst and doped to improve the photocatalytic properties of bare ZnO. 3.1.1.Structural and morphological characterization 3.1.1.1.Samples prepared by the solution combustion method.The N-doped catalyst has been prepared by means of the solution combustion (SC) method using the amino group in the urea as nitrogen source with a Zn:urea ratio of 1 30.The reaction that take place is as follows: e Calculated from DRS UV-Vis spectra (ZnO bulk Eg 3.37 18; Lattice parameters for pure ZnO: (a 3.25 A and c 5.205 A) 31. The N content of the as-prepared sample was measured using elemental analysis (Table 1).Taking this result into account, the estimated stoichiometry for the sample is ZnO 0.988 N 0.012 , assuming that nitrogen is substituting oxygen atoms in the crystal structure.Moreover, with the objective of studying the Cu effect, two types of materials were prepared: a) Cu was deposited using wet impregnation over the ZNO sample (1.5Cu/ZNO) and b) Cu and N were incorporated at the same time during the SC method (Cu-ZNU).In the last case, the amount of N was higher than in ZNO, reaching a molar content of 0.25 for N and 1.5 for Cu.All SC samples present very low surface area (around 1 m 2 /g), indicating a lack of porosity in these materials. Structural properties of these samples were studied by X-ray diffraction.XRD profiles show, in all cases, the characteristics peaks of ZnO with wurtzite structure, whereas no additional peaks were observed that could be derived from N and Cu introduction into the framework.Lattice parameters do not undergo any significant change with respect to the bare ZnO 31, probably due to the low amount of N and Cu incorporated (Table 1).Crystal size calculations show higher values for Cu-ZNU sample compared with ZNO. The structural characterization was completed by Raman analysis (Fig. 1a-g).The ZNO sample (Fig. 1a) exhibits all the characteristics Raman active phonon frequencies of ZnO: 203 cm -1 (2TA; 2E 2 (low)), 330 cm -1 (E 2 (high)-E 2 (low)), 377 cm -1 (A 1 (TO)), 419 cm -1 (E 1 (TO)) and 437 cm -1 (E 2 (high)).Likewise, the small band centred around 581 cm -1 is ascribed to a superposition of the A 1 (LO) mode (574 cm -1 ) and E 1 (LO) mode (590 cm -1 ) 32.Moreover, three additional peaks are detected.The one at 582 cm -1 is attributed to the E 2 (Zn-N) mode that coincide with A 1 (LO) and E 1 (LO) peaks.Besides, two small peaks at 507 and 642 cm -1 , assigned to local vibrational modes of Zn-N bonds, are distinguished 30.The strong intensity of these peaks indicates the high crystallinity of this material. In the case of the copper-containing samples (Fig. 1b c), a redshift of the band, as well as a peak broadening, is observed.These changes are associated with an expansion in the lattice parameter that induces lattice strain and changes in the band structure, leading to an increase in the phonon modes intensity 33. Morphological characterization of the samples was performed by SEM (Fig. 2).The ZNO material consists of highly uniform micrometre-sized crystals with triangular and hexagonal-prismshaped and an edge average of 2-4 m.In this case the triangular structure dominates over the prismatic one (Fig. 2A andB).The formation of pyramidal agglomerates may be due to the exposure of smaller particles to hot-spot regions during the combustion process 34. 3.1.1.2.Samples prepared by the hydrothermal method.A mesoporous zinc oxide sample (ZnO-M) was prepared by hydrothermal synthesis using urea and Pluronic-123 as surfactants to generate the mesoporosity.This material shows a remarkable improvement in the surface area (around 30 m 2 /g) compared to the samples prepared by SC and it has a mean pore diameter of 32 nm.Different loadings of copper were supported over the ZnO-M sample using the wet impregnation method, which leads to a decrease of the surface area (Table 1).The XRD pattern confirms clearly the presence of the ZnO hexagonal crystal structure.In this case, the crystallite size is smaller than in the samples prepared using the SC method.A diffraction peak, due to CuO, appears at 2A 38.6 , with a low intensity indicating that Cu particles show a small crystal size. Mesoporous samples (Cu(x)/ZnO-M) exhibit the same Raman modes previously mentioned for the ZnO (Fig. 1d).However, in the case of the Cu(x)/ZnO-M samples a number of peaks (203 cm (2TA; 2E 2 (low)), 330 cm -1 (E 2 (high)-E 2 (low)), 419 cm -1 (E 1 (TO)) and 437 cm -1 (E 2 (high))) possess a higher intensity and a red-shift (Fig. 1e-g), pointing out the effect of the Cu oxide electrical density on the ZnO phonon modes 33.Morphological characterization by SEM of the ZnO-M sample shows the presence of micrometric spheres with a mean diameter of 25 m composed by flakes of very thin ZnO layers, resulting in a mesoporous structure (Fig. 2C andD). Opto-electronic properties of prepared materials were measured by means of UV/Vis DR spectroscopy (Fig. 3).In the case of the samples prepared by SC, ZNO material depicts a broad band in the visible region, which starts around 700 nm and displays a maximum at 495 nm (Fig. 3a).This change in the light absorption suggests that the N introduction into the ZnO framework has really occurred, leading to the formation of a new intermediate state (deep level acceptor) within the band-gap.Thus, the obtained band-gap is 2.9 eV, a value that is lower than that obtained for bare ZnO-M (Fig. 3d).This has been also included in the figure for comparison.Copper deposition (Cu1.5/ZNO)leads to an increase in the light absorption in all the visible range (Fig. 3b), but the band-gap edge does not change.DRS-UV/Vis of the sample Cu-ZNU (Fig. 3c) exhibits a broad band absorption along the visible range, a red-shift in the absorption cut-off edge and a decrease in the band-gap value compared with ZNO sample (E g 2.7 eV).This behaviour indicates that Cu atoms were added to the ZnO structure. On the other hand, the ZnO-M material (Fig. 3d) exhibits an absorption cut-off edge around 400 nm.The band-gap for this sample was calculated assuming a direct transition and reveals a lower value (E g 3.2 eV) than the expected one for bare ZnO 18.This behaviour may indicate that a small amount of N would have been incorporated into the ZnO framework during the synthesis (Table 1). The copper addition to the ZnO-M samples enhances the absorption in the visible region, showing a broad band that it is increased for higher copper loadings (Fig. 3 e-g).This higher intensity is mainly due to the absorption of visible light by Cu oxide (d-d transition).The deposition of copper over mesoporous ZnO does not change the band-gap values (Table 1). Photoluminiscence (PL) analyses of all samples are depicted in Fig. 4. Zinc oxide samples show the emission band due to the transition between the energy levels generated by the intrinsic ZnO defects 35.Thus, in the case of ZNO sample, the band centred at 408 nm is due to the transitions from conduction band (CB) to Zn vacancy (V Zn ) levels; whereas the 422 nm peak corresponds to the emission from the interstitial Zn (Zn in ) level to the top of valency band (VB).The bands at 531 nm and at 543 nm correspond to electronic transitions from the top of the VB to the interstitial oxygen (O i ) level and from the bottom of the CB to the antisite oxygen O Zn level, respectively 35,36.Due to the experimental conditions, the direct band to band recombination peaks around 365 nm, and the band attributed to donor-bound excitations of nanocrystals are not observed 37.Copper deposition decreases the PL intensity in all peaks (Fig. 4b).Taking into account that one of the factors that govern the PL is the e -/h recombination, this behaviour can be explained as a decrease of the recombination rate due to the electrons transfer processes between Cu oxide nanoparticles and ZnO 38.In the case of Cu-ZNU sample (Fig. 4c), the PL profile includes differences at lower wavelengths possible due to the inclusion of isolated Cu atoms in the ZnO framework.The emission band starts at lower energy, which could be related to the inclusion of Cu into the ZNO framework leading to variations in the band structure as a consequence of the inclusion of a new trapping level near to the CB 38. Photoluminiscence profile of ZnO-M catalyst exhibits the same contribution as that of ZNO sample but slightly shifted to lower energies.Otherwise, Cu(x)/ZnO-M catalysts present a lowering of the intensity of the emission bands that is more conspicuous with increasing the Cu loading (Fig. 4d-g).These results suggest that deposition of copper over the ZnO surface lead to electron transfer reaction between both phases that results in a decrease in the electron-hole recombination rate. The materials prepared in this work have been investigated as catalysts in the gas phase CO 2 photoreduction reaction using H 2 O as electron donor.Two control photocatalytic reactions were performed: 1) without any catalyst under UV-vis illumination, 2) with catalyst under dark conditions.In both cases no product formation were observed.These behaviour indicate that the presence of both catalyst and irradiation were necessary for the photocatalytic reduction of CO 2 .Regarding to backward reactions, previous studies performed by Yang et al. 39 pointed out that, hydrocarbon oxidation to CO and CO 2 in helium atmosphere and under UV light is possible. In the case of SC catalysts (Fig. 5), the ZNO sample presents the lower CO 2 conversion under UV irradiation, and the obtained products are H 2 (0.09 mol/g cat /h), CO (0.04 mol/g cat /h), CH 4 (0.01 mol/g cat /h) and CH 3 OH (0.03 mol/g cat /h).This poor activity is probably due to the low surface area of this material and to the high rate of the recombination process.When Cu is deposited over ZNO (1.5Cu/ZNO) there is a clear improvement on H 2 (0.29 mol/g cat /h) and CO (0.49 mol/g cat /h), pointing out that copper act as an effective co-catalyst that increases also the electronic processes probably due because Cu act as trap of electron or holes arising from ZnO.The same effect is observed for the Cu-ZNU catalyst that leads to an improvement in the CO 2 conversion mainly due to CO formation (0.49 mol/g cat /h) and the H 2 (0.51 mol/g cat /h) production.Methanol production is almost the same in both cases (0.02 mol/g cat /h) and lower than in the case of ZNO.This behaviour is different to the results reported by Tseng et al. 40, where Cu-doped TiO 2 catalyst was more efficient for CH 3 OH formation than Cu supported over titania.Regarding to overall CO 2 conversion, the low production values are in agreement with the calculated quantum yield index, (Table 2) that has been calculated using as reference the ZnO-M results.All SC catalysts presented QYI values lower or equal than 1, which mean it that for these catalysts a lesser amount of electrons are involved in the CO 2 photoreduction process.These lower values are probably due to the low surface area of these samples and a poor Cu dispersion over the ZnO matrix. In the case of ZnO-M, a higher CO 2 conversion is obtained compared with ZNO sample, mainly due to the CO production (0.73 mol/g cat /h).Taking into account that these samples have been prepared using an organic based porogen, a control study to evaluate the effect of surface carbon contamination in the CO 2 photoreduction was performed.Thus, ZnO-M catalyst was tested using UV-vis irradiation and H 2 O leading to a negligible formation of CO, CH 4 and CH 3 OH.This behaviour corroborates the studies performed by others authors 28,41 showing that although surface carbon impurities can act as carbon source by means reverse Boudouard reaction, photoactivated CO 2 is essential for CH 4 and CH 3 OH formation in this reaction.However, further studies are necessaries to evaluate the role of the surface carbon in the CO 2 photoreduction processes. On the other hand, the metal content plays an important role in the catalytic behaviour inducing different effects on the photoactivity as a function of the metal loading.After copper deposition over ZnO-M catalyst an increase in the CO 2 photoconversion and an improvement in the multielectronic reaction to CH 4 and CH 3 OH, with the subsequent decrease in the H 2 production, are observed (see Fig. 5).In the case of methanol, this behaviour is more marked and the production increases with the Cu loading (0.27 mol/g cat /h for 3.0Cu/ZnO-M).However, an excess of copper oxide on the surface of bare ZnO may result in masking the semiconductor surface area, decreasing the photoexcitation capacity 42.This causes a reduction in the light absorption in ZnO and, therefore, in CO 2 photoconversion, as it occurs in the case of Cu (3.0)/ZnO-M catalyst.This behaviour is in agreement with the studies performed by Tseng et al. that found for methanol production an optimal copper loading of 2 in a Cu/TiO 2 catalyst using a UV source of 254 nm 26.On the other hand, mesoporous catalysts, with the exception of 0.5Cu/ZnO-M, present QYI values greater than 1, being the highest QYI value obtained for 1.5Cu/ZnO-M (Table 2).These data confirming the strong effect in the CO 2 conversion and in the multielectronic reactions when copper is introduced in supports with a significant mesoporous surface area.The performance comparison with published works is difficult due to the large variability in the operation conditions, mainly in the light sources properties, type of reactor and CO 2 /H 2 O ratios. The effect in the CO 2 photoreduction of Cu as co-catalyst, mainly in Cu/TiO 2 systems, has been studied in previous works; however a clear explanation about its influence has not been well established.The studies performed by Tseng et al. 25,26, using Cu/TiO 2 catalysts, suggested that the active sites for CO 2 photoreduction and methanol production were predominantly well-dispersed Cu species, while Cu 0 is involved in the hydrocarbon production.On the other hand, the studies carried out by Slamet et al. 27,40, with Cu/TiO 2 catalysts, reveal the existence of a relationship between Cu oxidation state and methanol production, but in this case, an increase in the CH 3 OH production is observed in this order: Cu 2 ; Cu , Cu 0 .Moreover, in situ IR characterization studies have also corroborated that methanol is produced on these Cu active sites through formate and methoxy-intermediates 43.Moreover, Cu has been defined as an enhancer of the CO 2 multielectronic photoreduction process, due to its capabilities to facilitate the photoexcited electron and holes traps processes and decreasing the recombination rate facilitating the electron transfer from the catalyst to the reagents and vice versa 28.However, the specific role of the Cu is not clearly determined; therefore further specific studies to elucidate the changes in valence state under reaction conditions are necessaries to understand its performance in CO 2 photoreduction."}, {"title": "Conclusions", "content": "A variety of N-and Cu-modified ZnO photocatalysts, synthesized by two different methods, have shown to be active in CO 2 photoreduction under UV light using H 2 O in gas phase as electron donor.The activity results demonstrate that bare ZnO is a suitable candidate for CO 2 photoreduction although activity should be enhanced.While N-doping does not seem to have an important influence on the photocatalytic behaviour, the existence of a cooperative effect between Cu and the ZnO semiconductor has been confirmed by means of different characterization techniques.This effect leads to an improvement in the photocatalytic activity, which is more evident for the ZnO-M samples, where the formation of a mesoporous structure improves the textural properties of ZnO and favours the dispersion and interaction with copper species.Regarding the product distribution, CO and H 2 are the main products obtained with the catalysts exhibiting the highest activity, followed by methane and methanol.The latter is specially favoured over the catalysts with Cu observing an enhancement in the hydrocarbon production mainly methanol.This improvement in the CO 2 multielectronic photoreduction process is probably due to the cooperative effect between Cu particles and ZnO, which facilitate both photoexcited electron and holes traps processes and decreasing the recombination rate. Fig. 1.Raman spectra of the catalysts: a) ZNO, b) 1.5Cu/ZNO, c) Cu-ZNU, d) ZnO-M, e) 0.5Cu/ZnO-M, f) 1.5Cu/ZnO-M and g) 3.0Cu/ZnO-M. Fig. 2. A) B) SEM micrographs of ZNO and C) D) ZnO-M catalysts. Fig. 3. UV-vis spectra of the catalysts: a) ZNO, b) 1.5Cu/ZNO, c) Cu-ZNU, d) ZnO-M, e) 0.5Cu/ZnO-M, f) 1.5Cu/ZnO-M and g) 3.0Cu/ZnO-M. Fig. 4. PL spectra of the catalysts: a) ZNO, b) 1.5Cu/ZNO, c) Cu-ZNU, d) ZnO-M, e) 0.5Cu/ZnO-M, f) 1.5Cu/ZnO-M and g) 3.0Cu/ZnO-M. Fig. 5. Catalytic activity and product distribution in the CO2 photoreduction: a) ZNO, b)1.5Cu/ZNO, c) Cu-ZNU, d) ZnO-M, e)0.5Cu/ZnO-M, f) 1.5Cu/ZnO-M and g) 3.0Cu/ZnO-M. Physicochemical properties of prepared materials. a Cu content (wt) measured by ICP-OES.b N content (referred to the support weight) measured by Elemental analysis.c BET surface area.d Crystal size Williamson-Hall. Product selectivity, CO2 conversion and QYI factor for AP under UV radiation. a CO2 converted, defined as (HC yield n carbons).bQuantumyieldindexcalculated from apparent quantum yield (see Eqs. (1) and (2)). Financial support from the Spanish Ministry of Economy and Competitiveness (project ENE2009-09432) is gratefully acknowledged.V.A.P.O. and P.J. thank funding support from the grants received of the \"Ramon y Cajal\", and \"Juan de la Cierva\" programmes, respectively."}]