[{"title": "Doi", "content": "10.1016/j.jcat.2018.04.020"}, {"title": "Article_Title", "content": "Insights into the role of MgAl layered double oxides interlayer in Pt/TiO2 toward photocatalytic CO2 reduction"}, {"title": "Abstract", "content": "The representative TiO 2 loaded with cocatalyst (e.g., Pt) have been used extensively for the photocatalytic CO 2 reduction in solar-to-chemical energy conversion.However, it still suffers from low efficiency, due to the weak adsorption/activation of CO 2 .In this work, an MgAl layered double oxides (MgAl-LDO) was successfully introduced into the interface of Pt/TiO 2 , by in-situ deposition of MgAl layered double hydroxides and subsequent high temperature calcination.The structure, optical property and the photocatalytic activity for CO 2 reduction of as-fabricated Pt/MgAl-LDO/TiO 2 were experimentally investigated.Especially, the roles of MgAl-LDO during the CO 2 reduction process were highlighted.It concluded MgAl-LDO possessed Lewis acidic and Lewis basic bifunctional roles that enhanced the performance of the photocatalytic CO 2 reduction.The optimal yields of CO and CH 4 of Pt/MgAl-LDO/TiO 2 exhibited ca. 2 and 11 times as high as that of Pt/TiO 2 , respectively.The adsorption states of CO 2 and the adsorbed species in the course of photoreduction of CO 2 with H 2 O vapor on Pt/MgAl-LDO/TiO 2 were examined by insitu infrared spectroscopy.Monodentate carbonate (m-CO 3 2A) and monodentate bicarbonate (m-HCO 3 A ) were found to be the main surface species that adsorbed.In the presence of H 2 O, m-CO 3 2A species could be readily converted to active m-HCO 3 A intermediate, which was subsequently transformed into surface CO 2 A. This was attributed to the fact that MgAl-LDO contains much more strong Lewis basic sits for CO 2 adsorption to produce m-CO 3 2A and the Lewis acid sites for the dissociation of H 2 O into H and OH groups.Moreover, photoluminescence spectra further indicated that oxygen vacancy existed in the interface of MgAl-LDO/TiO 2 , which facilitated the photogenerated charges separation and also contributed to the enhanced photocatalytic performance.As a result, the Lewis acidic-basic characteristics of MgAl-LDO, as well as the improved charges separation, should be responsible for the increased photocatalytic activity of Pt/MgAl-LDO/TiO 2 toward CO 2 reduction."}, {"title": "Experimental", "content": "TiO 2 nanorods were prepared by a modified hydrothermal method.Typically, 6 mL HCl was dropped into 15 mL titanium isopropoxide in a 100 mL Teflon-lined autoclave at room temperature, and then the mixture was sealed and kept at 180 C for 36 h.After being cooled to room temperature, the resulting white precipitates were filtered out and washed with diluent NaOH solution followed by water until the filtrate became neutral.The products were finally dried overnight in vacuum at 80 C. For preparing MgAl-LDH colloidal solution, glycine intercalated MgAl-LDH (Gly-MgAl-LDH) was first fabricated.Typically, 60 mL aqueous solution containing Mg(NO 3 ) 2 A6H 2 O and Al(NO 3 ) 3 A9H 2 O (Mg 2 Al 3 0.5 mol L A1 , Mg/Al 3:1) was added dropwise into 100 mL glycine (0.5 mol L A1 ) under continuous Ar flow.At same time, 2 mol L A1 NaOH was used to maintain the solution's pH at 10.After Mg-Al solution was completely added, the mixture was kept pH at 10 under vigorous stir for another 6 h.The slurry was then aged for 12 h, followed by centrifuged at 12,000 rpm.The obtained precipitates were washed with water for five times and dried overnight at 80 C.MgAl-LDH colloidal solution was obtained by exfoliation of Gly-MgAl-LDH.In typical, 0.5 g Gly-MgAl LDH was dispersed into 100 mL water (pH 4, adjusted by 0.1 mol L A1 HCl) and then was stirred vigorously at room temperature for 24 h, and finally centrifuged at 5000 rpm to exclude the residual. MgAl-LDH/TiO 2 was first fabricated by in-situ deposition method.Typically, the desired volumes (1, 2, 5 and 10 mL) of MgAl-LDH colloidal solution was added into 5 mL water containing 0.1 g TiO 2 .The mixture was then dried at 80 C with continuous stirring.The final particles were subsequently calcined in air at 450 C for 4 h to prepare MgAl-LDO/TiO 2 .The as-prepared MgAl-LDO/TiO 2 was marked as MgAl-LDO/TiO 2 -n, where n 1, 2, 5 and 10, corresponding to the added volumes of MgAl LDH colloidal solution. For comparison, MgO/TiO 2 , Al 2 O 3 /TiO 2 and MgO-Al 2 O 3 /TiO 2 were prepared by using impregnation method.Typically, 0.1 g TiO 2 was immersed in a given amount of 5 mmol L A1 Mg(NO 3 ) 2 with ultrasonic and stir, and then dried at 80 C under stirring.The sample was finally calcined in air at 450 C for 4 h, thus MgO/TiO 2 was received.Instead of Mg(NO 3 ) 2 with Al(NO 3 ) 3 or Mg(NO 3 ) 2 -Al(NO 3 ) 3 , Al 2 O 3 /TiO 2 and MgO-Al 2 O 3 /TiO 2 were also obtained.The loading amounts of MgO and Al 2 O 3 were referenced to that of MgAl-LDO/TiO 2 -2, in which the amounts of MgO and Al 2 O 3 were 1.9 wt and 0.73 wt (form ICP-AES results) respectively.MgAl-LDO/TiO 2 -mix was prepared by mechanically mixing TiO 2 and MgAl-LDO derived from MgAl-LDH under 450 C. Cocatalysts of 1 wtPt were loaded on TiO 2 -based samples by an in-situ photodeposition method, using H 2 PtCl 6 A6H 2 O as precursors.Taking Pt/TiO 2 as an example, 0.1 TiO 2 was suspended in 25 mL H 2 PtCl 6 solution containing 0.01 molAL A1 methanol as hole scavenger.The suspension was irradiated with a 300 W Xe lamp for 1 h.The sample was then recovered by filtration, followed by washed repeatedly with water and dried at 80 C overnight. The crystalline phases were characterized by X-ray powder diffraction (XRD) on a Bruker D8 Advance powder diffractometer using Cu Ka radiation (operating voltage: 40 kV, operating current: 20 mA, scan rate: 5/min).UV-visible diffuse reflectance spectra (UV-vis DRS) were recorded on a UV-vis 2600 spectrophotometer (SHIMADZA) and calibrated with Kubelka-Munk method.The morphology was examined by a JSM-7610F scanning electron microscopy (SEM) at an accelerating voltage of 15 kV.Elemental analysis was collected by energy dispersive spectroscopy (EDS, OXFORD X-act) on the SEM (accelerating voltage: 20 kV, probe current: 0.02 mA, Time: 300 s).Transmission electron microscopy (TEM) and high resolution TEM (HRTEM) were performed on a JEOL JEM-2010 TEM (Japan) with the accelerating voltage of 200 kV.The contents of metal elements were determined by an inductively coupled plasma-atomic emission spectrometer (ICP-AES, Optima DV2100, PerkinElmer, USA).Steady-state photoluminescence (PL) spectra were carried out on a FLS980 fluorescence spectrometer (Edinburgh, excitation source, 450 W Xe lamp; excitation wavelength, 350 nm).Specific surface area was analyzed by nitrogen adsorption-desorption at 77 K using Brunauer-Emmett-Teller (BET) method (Micromeritics, ASAP 2020).Infrared (IR) spectra were recorded on a Bruker VERTEX 70 spectrometer in 4000-400 cm A1 using pressed KBr pellet method. The infrared spectra of CO 2 adsorption were recorded with a resolution of 4 cm A1 using 16 scans on a Fourier transform infrared spectrometer (Nicolet NEXUS 470) with a MCT detector.The experiments were carried out using a special IR cell in conjunction with a vacuum system.Typically, 20 mg of catalyst was first pressed into a self-supporting thin wafer (15 mm diameter) and then was transferred to the sample holder in the special IR cell.The wafer was evacuated at 350 C for 2 h to remove the adsorbed molecules, and then cooled down to room temperature for recording the background spectrum of the sample.CO 2 was introduced to the cell and followed by degassing before recording the IR spectrum of adsorbed CO 2 .The pretreatment of sample for IR spectra with pyridine adsorption was similar to that of IR for CO 2 adsorption.Typically, 20 mg of the sample was evacuated at 350 C for 1 h to remove the impurities in the cell, and then the background spectrum of the sample was recorded.After introducing the pyridine vapor for 15 min followed by being degassed under vacuum at 150 C for 30 min, the spectrum was recorded. In-situ IR spectra for the coadsorption of CO 2 and H 2 O before and after UV irradiation were recorded with a Nicolet (NEXUS 470) spectrophotometer in the range 4000-1000 cm A1 with a resolution of 4 cm A1 .The pretreatment of sample was identical to IR of CO 2 adsorption.The wafer was evacuated at 350 C for 1 h to remove the adsorbed molecules, and then was cooled down to room temperature for recording the background spectrum.Subsequently, CO 2 and H 2 O were introduced to IR cell at room temperature and followed by degassing for 1 h and subsequently under UV irradiation for 1 h at room temperature to record the corresponding spectra.Spectra of the adsorbed species were obtained by subtracting the catalyst spectrum. The photocatalytic reduction of CO 2 with H 2 O was carried out using gas-solid mode in a Pyrex reaction cell connected to a closed gas circulation and evacuation system.The light source was a topirradiated 300 W Xe lamp (LS-SXE300 CUV, Beijing Perfectlight Technology Co. Ltd).Typically, 20 mg of catalyst was evenly dis-persed onto a glass-sheet (1.5 cm A 2 cm), and then was placed on the holder in the upper region of the reactor, in which 40 mL water was charged on the bottom in advance.The light intensity at the location of catalyst was 4.3 mW cm A2 for 260-400 nm measured by an UV irradiatometer with a Si photodiode (Shenzhen Linshang).The reactor was sealed and degassed for 30 min, and then CO 2 was bubbled slowly till the pressure up to 1 atm.Finally, the reaction was conducted under light irradiation at 20 C for 8 h.The generated CO and CH 4 , as well as H 2 and O 2 , were determined by an on-line GC 7900 gas chromatograph (Shanghai Tianmei) equipped with methanator, flame ionization detector (FID) and thermal conductivity detector (TCD), and the relative standard deviations for the amounts of H 2 , CO and CH 4 formed were 5."}, {"title": "Results_and_discussion", "content": "MgAl-LDO/TiO 2 samples were prepared by a facile two-step route (Scheme S1), namely in-situ deposition of the colloid of glyphosate intercalated MgAl-LDH (Gly-MgAl-LDH) on TiO 2 surface followed by high temperature calcination at 450 C.To improve the efficiency of photogenerated charge separation, noble metal (Pt) nanoparticles were further loaded on MgAl-LDO/TiO 2 to prepare Pt/MgAl-LDO/TiO 2 photocatalyst.The structures and morphologies of MgAl-LDH and MgAl-LDO/TiO 2 precursors were characterized by XRD, FTIR and TEM (Fig. S1-4).Fig. 1a shows XRD patterns of MgAl-LDO/TiO 2 -n, as well as that of TiO 2 .All MgAl-LDO/TiO 2 -n samples exhibit almost identical to rutile TiO 2 .No diffraction peaks of MgO or Al 2 O 3 or other impurities are detected, which might also be attributed to the highly dispersed MgAl-LDO species or the low loading LDO beyond the detection limitation.The effect of MgAl-LDO on the optical properties of TiO 2 is examined by UV-vis diffuse reflectance spectra (UV-vis DRS).As show in Fig. 1b, all samples display the same steep absorption edge located at ca. 400 nm, which could be assigned to the Ti-O bond, indicating negligible effects from MgAl-LDO on light absorption of TiO 2 .For further investigation, the mass fractions for MgO and Al 2 O 3 in MgAl-LDO/TiO 2 -n and the specific surface area for TiO 2 and MgAl-LDO/TiO 2 -n were determined and listed in Table S1.Molar ratios of Mg/Al for all MgAl-LDO/TiO 2 -n were then calculated as ca.3.3, which was well in agreement with that from the exfoliated MgAl-LDH solution.Specific surface area (Table S1) was shown with no significant changes but slight increase with the increasing MgAl-LDO content, suggesting MgAl-LDO would not change the textural property of TiO 2 nanorods. The morphology of rutile TiO 2 , MgAl-LDO/TiO 2 -n and Pt/MgAl-LDO/TiO 2 -2 were first investigated by scanning electron microscopy (SEM).Fig. 2a shows a typical nanorod shape with smooth surface of rutile TiO 2 .The size of such TiO 2 is ca.50 nm in width and 200-400 nm in length.After being deposited with MgAl-LDO, the nanorods are well maintained, however, the surface of TiO 2 becomes slightly rough.The roughness is observed to be enhanced gradually as the increased loading amount of MgAl-LDO (Fig. 2be).For example, MgAl-LDO/TiO 2 -10 exhibits clear aggregations on TiO 2 surface (Fig. 2e).Energy dispersive X-ray spectroscopy (EDS) analysis of MgAl-LDO/TiO 2 -2 (Fig. S5) further reveals the existence of Mg and Al with the molar ratio of 4.1/1 (Mg/Al), which is close to ICP-AES analysis.Light spots in Fig. 2f verifies Pt has been successfully deposited.The morphology of MgAl-LDO/TiO 2 -2 loaded with Pt were further examined by transmission electron microscopy (TEM, Fig. 2g).High resolution TEM (HRTEM) image recorded from the edge of the nanorod clearly confirms a typical heterojunction between TiO 2 and MgAl-LDO, and the thickness of MgAl-LDO is 5-8 nm (Fig. 2h).The clear lattice fringes with an inter-planar spacing of ca.0.32 nm is consistent with (1 1 0) plane of rutile TiO 2 nanorod, while the lattice fringes with a spacing of ca.0.21 nm could be indexed to the (2 2 0) plane of Mg(Al)O cubic phase 25.According to the formation mechanism of hydrotalcitederived mixed oxides, Al 2 O 3 species should also be formed, however, it showed no any lattice fringe HRTEM images, indicating an amorphous forms 26,27.Fig. 2g andi show Pt nanoparticles with a diameter of ca. 4 nm are well dispersed on MgAl-LDO/ TiO 2 .TEM results have demonstrated MgAl-LDO as an intercalary layer between TiO 2 catalyst and as-deposited Pt cocatalyst.Such kind of heterojunction was expected to facilitate the transfer and separation of photogenerated charges at the interfaces, thereby enhance the photocatalytic activity. The basic properties of MgAl-LDO/TiO 2 was investigated by means of a FTIR spectroscopy with CO 2 adsorption at room temperature.For comparison, IR spectrum for CO 2 /TiO 2 was also collected under the same condition.Fig. 3a presents IR spectra in the m(OCO) frequency region (2000-1000 cm A1 ) of adsorbed species formed on CO 2 /MgAl-LDO/TiO 2 and CO 2 /TiO 2 .Comparing with that of TiO 2 , IR spectrum for MgAl-LDO/TiO 2 shows two obvious band at 1632 cm A1 and 1384 cm A1 .The broad band at 1632 cm A1 could be assigned to the antisymmetric m as (OCO) of m-HCO 3 A (Scheme 1a), which was formed via the reaction of CO 2 with surface OH (a Lewis base OH A sites) 28,29.The strong band at 1384 cm A1 could be attributed to the symmetric OACAO stretching vibration of m-CO 3 2A (Scheme 1b), while a weak shoulder peak at 1356 cm A1 could be assigned to b-CO 3 2A (Scheme 1c) 23,29.m-CO 23,31.Except for Lewis basic sites, some Lewis acid sites in MgAl-LDO were also proposed 23.In order to verify the existing of the surface acidic sites in MgAl-LDO/TiO 2 , IR spectra for pyridine adsorption experiments were performed (Fig. 3b).Obviously, pyridine has been hardly adsorbed on rutile TiO 2 , indicating few Lewis or Brnsted acidic adsorption sites exposed on the surface of rutile TiO 2 .In contrast, four obvious peaks at 1445, 1491, 1575 and 1607 cm A1 appeared in IR spectrum of MgAl-LDO/TiO 2 .The peaks at 1445 and 1607 cm A1 could be indexed to the coordinated pyridine adsorbed on Lewis acid sites.However, the peaks at 1575 and 1491 cm A1 could be assigned to the vibrations of pyridine adsorbed on either Brnsted acid sites or Lewis acidic sites 32.Given the both peaks were related to the Brnsted acidic sites, another peak at 1540 cm A1 , which was the characteristic band of pyridine adsorbed on Brnsted acidic sites, should also be observed in IR spectrum of MgAl-LDO/TiO 2 .Thus, it could deduce acidic sites in MgAl-LDO/TiO 2 are mainly in Lewis acidic form.Such Lewis acidic sites has been proved to be from the coordinately unsaturated Al 3 cations (Al 3 -O 2A pairs) in MgAl-LDO/TiO 2 23,33,34.The Lewis acid sites in MgAl-LDO would enhance the surface acidity of the catalyst, which will be beneficial for H 2 O adoption and dissociation.In summary, FTIR demonstrate that large amounts of Lewis basic sites and Lewis acidic sites exist in MgAl-LDO/TiO 2 .Such Lewis basic sites and Lewis acidic sites will enhance the adsorption of CO 2 , as well as the adsorption and dissociation of H 2 O, thus facilitate the photocatalytic reduction of CO 2 on TiO 2 in the presence of H 2 O vapor. To reveal the separation and recombination of photogenerated electron-hole pairs, photoluminescence (PL) was performed among TiO 2 , MgAl-LDO/TiO 2 and Pt/MgAl-LDO/TiO 2 .As shown in Fig. 4, all PL spectra exhibit two peaks at 420 and 450 nm.Such peaks can be assigned to the band edge of free excitons and the indirect transition 1a to C 1b (related to the exciton recombination in shallow trapped surface states), respectively 35363738.The highest PL intensity of bare TiO 2 is indicative of the maximum recombination of electrons and holes.After being loaded with MgAl-LDO, the PL intensity is sharply decreased.This result indicated that the interaction existed between MgAl-LDO and TiO 2 , which might cause the formation of oxygen vacancy, and thus suppressed the recombination rate of excited electrons and holes 19,20,39.Further loading with Pt as cocatalyst, the PL emissions of MgAl-LDO/TiO 2 was almost completely quenched, indicating Pt cocatalyst was essential and effective for the transfer of photogenerated electrons. The photocatalytic reduction of CO 2 over MgAl-LDO/TiO 2 was performed by using solid-gas interface reaction mode, where CO and CH 4 were found to be the major products.In the mode, water molecules was oxidized to generate O 2 , H and e 40.Control experiment shows slightly detectable CO and CH 4 in the absence of light or catalyst, confirming CO and CH 4 were actually derived from the photocatalytic reduction of CO 2 on TiO 2 based photocatalysts.Fig. 5a In another experi-ment, we note that MgAl-LDO/TiO 2 without Pt deposition exhibits slight photocatalytic activity toward CO 2 reduction, which might be owe to that MgAl-LDO itself is not the reactive catalytic site for CO 2 reduction.Thus, we speculate that the enhanced activity should come from the multi-synergistic effect of Pt and MgAl-LDO.First, MgAl-LDO enhances the adsorption of CO 2 19,20, thus decrease the activation energy of CO 2 toward its reduction products, and accelerate photocatalytic reduction reactions 41424344. Secondly, the thin structure of MgAl-LDO layer allows for the transfer of photogenerated electrons from TiO 2 to Pt by tunneling effect 17,45.As for the third, Pt loaded with electrons acts active sites to accelerate the reduction reactions.Due to the more negative conduction band of LDO than the fermi level of Pt, electrons on Pt are inhibited to return to TiO 2 , where the recombination of electrons and holes commonly occurs.Fig. 5a also indicates that the activity for the photocatalytic reduction of CO 2 exhibits a typical volcano-type dependence on the content of MgAl-LDO, with the maximum CO and CH 4 productivity for MgAl-LDO/TiO 2 -2.The excess MgAl-LDO might enhance the adsorption of CO 2 , whereas it causes detrimental to the photocatalytic activity, mainly due to the relative thicker layer which hinders the migration and transfer of photogenerated charges 12,13,45,46.Unless otherwise specified, the following discussions are carried out with the sample of MgAl-LDO/TiO 2 -2.Additionally, the ratio of CH 4 /CO is observed to be significantly increased after decorating TiO 2 with MgAl-LDO.It might be resulted from the basic sites provided by MgAl- LDO, which is favorable for the preferential stabilization of CO 2 into chemisorbed species and the hydrogenation of CO 2 .The quantum efficiency (Q.E.) of Pt/MgAl-LDO/TiO 2 -2 for the formation of CH 4 and CO was calculated to be 0.35, while that over Pt/TiO 2 was calculated as 0.05 (see Supplementary Material, for calculation).Such improvement on photocatalytic reactivity clearly indicated an efficient role of MgAl-LDO layer for the photocatalytic CO 2 reduction over TiO 2 . As a comparison, the photocatalytic performance toward CO 2 reduction over MgO/TiO 2 , Al 2 O 3 /TiO 2 , MgO-Al 2 O 3 /TiO 2 and the mechanical mixture of MgAl-LDO and TiO 2 (MgAl-LDO/TiO 2 -mix) was investigated under the same conditions (Fig. 5b).The morphology of MgO/TiO 2 , Al 2 O 3 /TiO 2 and MgO-Al 2 O 3 /TiO 2 before and after the deposition of Pt are shown in Figs.S6-S8, exhibiting no significant difference from each other.XRD patterns (Fig. S9) for such samples displays no difference from each other, similar to that of TiO 2 , which might also be attributed to the little loading amount of such oxides.To verify the existing forms of such oxides, pure MgO and Al 2 O 3 , as well as MgO-Al 2 O 3 and MgAl-LDO, were prepared by the calcination of the corresponding nitrates solution, mixed nitrates solution and MgAl-LDH under the same conditions.Fig. S9 suggests MgO is in a cubic phase and Al 2 O 3 is in amorphous form, while MgO-Al 2 O 3 and MgAl-LDO exhibite similar patterns to that of MgO, which could be assigned to Al 2 O 3 in amorphous form 47,48. Fig. 5b shows Al 2 O 3 /TiO 2 with a lower activity than bare TiO 2 , suggesting Al-O spices should not serve as CO 2 adsorption/ activation sites.In contrast, all MgO-containing photocatalysts display higher activity, indicating Mg-O could act as adsorption/activation sites toward CO 2 reduction.The slightly lower yields of CO and CH 4 for MgO-Al 2 O 3 /TiO 2 than that of MgO/TiO 2 further confirming Al-O spices are not favorable for photocatalytic reduction of CO 2 .The higher activity of MgAl-LDO/TiO 2 than MgO/TiO 2 could be related to the synergistic effect of MgO and Al 2 O 3 in MgAl-LDO that Lewis basic sites of low coordination O 2A in Mg-O for CO 2 adsorption/activation, as well as Lewis acid sites of unsaturated coordination Al 3 spices enhancing H 2 O adsorption/dissociation. Comparing with MgO-Al 2 O 3 /TiO 2 , the promoting of photocatalytic performance of MgAl-LDO/TiO 2 further confirms that such synergistic effect is only existed MgAl-LDO but is not present in isolated MgO and Al 2 O 3 mixed oxides.The above results further demonstrate that the enhanced photocatalytic activity of CO 2 reduction over Pt/MgAl-LDO/TiO 2 is highly depended on the unique structure of MgAl-LDO that Al 3 is highly distributed into the MgO lattice.To insight the effect of the heterostructure, the photocatalytic performance of MgAl-LDO/TiO 2 was compared with that of MgAl-LDO/ TiO 2 -mix.It shows that the average evolution rates of CO and CH 4 on Pt/MgAl-LDO/TiO 2 are ca.3.4 and 3.6 times as high as that of MgAl-LDO/TiO 2 -mix, conforming the necessity of heterojunction between MgAl-LDO and TiO 2 . The stability for the photocatalysts was examined by using Pt/ MgAl-LDO/TiO 2 for three consecutive 8 h cycles.Before each cycle, the system was degassed with vacuum and then bubbled with CO 2 to atmospheric pressure.Fig. 5c shows the amount of CO and CH 4 versus reaction time during the photocatalytic reduction of CO 2 .The amounts of CO and CH 4 increase almost linearly with the reaction time, indicating the formations of both CO and CH 4 over Pt/ MgAl-LDO/TiO 2 is in a steady-state manner but not a transient manner.Similar activities, without significant decrease of the amounts, for CO and CH 4 formation are observed in the second and the third runs, suggesting the prepared photocatalyst possesses excellent stability.For the further investigation, the amount of O 2 generated form the photocatalytic reduction of CO 2 was also quantified for Pt/MgAl-LDO/TiO 2 .For example, after the first 8 h of reaction, O 2 was detected to be 0.902 lmol.At the same time, the amounts of CO and CH 4 were 0.246 and 0.364 lmol, respectively. Given that the water oxidation to O 2 is the sole reaction to con-sume the photogenerated holes, the molar ratio of O 2 /(CO 4CH 4 ) should be calculated as 0.50 theoretically.The ratio of O 2 / (CO 4CH 4 ) for our results is calculated as 0.53, with slightly higher than the theoretical one.Such deviation might be related to the slightly incomplete vacuum degassing and the generation of the minor undetectable H 2 .This suggests CO and CH 4 are the main products from the photocatalytic reduction of CO 2 over our proposed photocatalysts.coordinated with H and transformed to HCO 3 ).The enhanced peak intensity of m-HCO 3 A and the relatively low peak of OH groups on TiO 2 confirmed the dissociation of adsorbed H 2 O was significantly enhanced on Lewis acid sites in MgAl-LDO (Fig. S10).In addition, a very weak peak at 1255 cm A1 , which can be assigned to the symmetric OCO stretching of carbonate (CO 2 A ) 29 was observed in MgAl-LDO/TiO 2 with Fig. 6.In-situ IR spectra of before (green line) and after CO 2 -H 2 O coadsorption on Pt/MgAl-LDO/TiO 2 in the dark (red line) and subsequently under UV irradiation for 60 min (blue line) at room temperature. exposure in CO 2 -H 2 O.However, it was not detected in TiO 2 that exposed in CO 2 -H 2 O (Fig. S10).According to previous literatures, CO 2 A species would be formed in the coadsorption of CO 2 with H 2 O, depending on the surface properties of catalysts 49. After being irradiated with UV light for 1 h, the peak intensity of CO 2 A species on MgAl-LDO/TiO 2 in CO 2 -H 2 O was obviously increased (Fig. 6), indicating that the formation of CO 2 A species on MgAl-LDO/TiO 2 surfaces was facilitated by illumination.However, in the absence of H 2 O, the peak intensity of CO 2 A species was still very weak (Fig. S11).This result suggests CO 2 A species on MgAl-LDO/TiO 2 should not be directly derived from m-CO 3 2A species but the assistance with H 2 O.After 1 h illumination, the peaks for m-HCO 3 A species slightly increased, while that for m-CO was considered as a rate-determining step in the process of photocatalytic CO 2 reduction.Theoretically, the energy barrier for the transfer of m-HCO 3 A to CO 2 A is about 0.27 eV (vs.NHE), while that of linear CO 2 to CO 2 A is about A1.9 V vs. NHE.Thus, the ease formation of m-HCO"}, {"title": "Conclusions", "content": "In summary, we have demonstrated a facile process to fabricate MgAl-LDO/TiO 2 with abundant Lewis basic and acidic sites, which exhibited significant enhancement toward the photocatalytic reduction of CO 2 in the presence of H 2 O.The in-situ FTIR analysis on CO 2 and/or H 2 O adsorption and the photoreduction process revealed the predominant carbonate species were m-CO 3 2A and m-HCO 3 A on MgAl-LDO/TiO 2 .Unlike b-CO 3 , m-CO 3 2A species could be readily converted to active m-HCO 3 A and then transformed to surface CO 2 , which ultimately was reduced to the products of CO and/or CH 4 in the presence of H 2 O under UV irradiation.Moreover, the photogenerated charge separation efficiency was obviously enhanced in MgAl-LDO/TiO 2 , as evidenced by PL spectra.The essential roles of MgAl-LDO were attributed to the enhanced adsorption of CO 2 and the ease adsorption/dissociation of H 2 O (decrease the energy barrier of the rate-limiting step CO 2 /CO 2 A ), as well as the increased oxygen vacancy (promote the photogener-ated charge separation) in MgAl-LDO/TiO 2 , consequently enhanced the photocatalytic CO 2 reduction efficiency.This work, for the first time, demonstrates MgAl-LDO possesses Lewis acidic and Lewis basic sites for photocatalytic CO 2 reduction in the presence of H 2 O.It is believed that the interface engineering of semiconductor and cocatalyst with the compounds containing Lewis acidic and Lewis basic sites would significantly enhance the CO 2 reduction efficiency, which should be received great interests in future. Fig. 2. SEM images of (a) TiO 2 , (b-e) MgAl-LDO/TiO 2 -n photocatalysts n (b) 1, (c) 2, (d) 5 and (e) 10 and (f) Pt/MgAl-LDO/TiO 2 -2; TEM image Pt/MgAl-LDO/TiO 2 -2 (g) and HRTEM images of MgAl-LDO/TiO 2 -2 (h) and Pt/MgAl-LDO/TiO 2 -2 (i). Fig. 1.(a) XRD patterns and (b) UV-vis DRS of TiO 2 and MgAl-LDO/TiO 2 . Fig. 3. IR spectra of (a) CO 2 and (b) pyridine adsorption on TiO 2 and MgAl-LDO/TiO 2 -2. Scheme 1. Adsorbed CO 2 species on MgAl-LDO/TiO 2 .Species a, monodentate bicarbonate (m-HCO 3 A ); Species b, monodentate bicarbonate (m-CO 3 2A ); and, Species c, bidentate formate (b-CO 3 2A ). Fig. 4. PL spectra of TiO 2 , MgAl-LDO/TiO 2 -2, and Pt/MgAl-LDO/TiO 2 -2. Fig. 5. (a) CO and CH 4 evolution over TiO 2 and various MgAl-LDO/TiO 2 photocatalysts; (b) CO and CH 4 evolution over TiO 2 and TiO 2 coating with various species and (c) Three consecutive 8 h cycles of CO and CH 4 evolution over MgAl-LDO/TiO 2 -2 with Pt cocatalyst for the photocatalytic reduction of CO 2 in the presence of H 2 O vapor.Conditions: photocatalyst, 0.02 g; co-catalyst, 1 wt Pt; CO 2 pressure: 1 atm; light source, 300 W xenon lamp; reaction temperature, 20 C; and, reaction time, 8 h.For Fig.5c, after each 8 h, the system was degassed, and then CO 2 was reintroduced into the reactor. 12 H 28 O 4 Ti, 97) were purchased form Alfa Aesar.Glycine (C 2 H 5 NO 2 , 99.5-100.5),Hexachloroplatinic acid (H 2 PtCl 6 A6H 2 O, Pt !37.0), Sodium hydroxide (NaOH, !96.0) and Hydrochloric acid (HCl, 36-38) were furnished by Sinopharm Chemical Reagent Co. Ltd (Shanghai, 2.1.Chemicals Magnesium nitrate hexahydrate (Mg(NO 3 ) 2 A6H 2 O, ACS, 98.0-102.0),Aluminum nitrate nonahydrate (Al(NO 3 ) 3 A9H 2 O, ACS, 98.0-102.0)and Titanium(IV) isopropoxide (C 3 2A species are formed via the coordination of CO 2 with O 2A in MgAl-LDO.b-CO 3 2A is formed via the reaction of CO 2 with Lewis acid-base pairs (Mg 2 -O 2A ).The observed three CO 2 adsorbed species suggest that MgAl-LDO/TiO 2 contains three kinds of surface Lewis basic sites, namely OH A groups, O in Mg 2 -O 2A pairs and low coordination O 2A anions.According to the literatures, the basic strength for such surface sites is in the order of low-coordination O 2A anions O in Mg 2 -O 2A pairs OH groups 30.The higher adsorption of m-CO 3 2A in MgAl-LDO/TiO 2 than those of m-HCO 3 A and b-CO 3 2A bands suggested the low-coordination O 2A sites dominated in MgAl-LDO/TiO 2 .This result supported MgAl-LDO could not only enhance the strength but also increase the numbers of the strong base sites of TiO 2 simultaneously.Such strong base sites in MgAl-LDO could be attributed to the partial diffusion of Al 3 into the lattice of MgO, which resulted in generating a positive charge.In order to compensate such positive charge, the adjacent O 2A ions became coordinatively unsaturated while CO 2 was reduced by accepting H and e A to formCO and CH 4 To insight the mechanism for the photocatalytic reduction of CO 2 with H 2 O over Pt/MgAl-LDO/TiO 2 , in-situ FTIR was used to characterize CO 2 adsorbed species and intermediates during the reaction process.Fig.6displaysIR spectra for the coadsorption of CO 2 and H 2 O on the surface of Pt/MgAl-LDO/TiO 2 photocatalysts before and after light irradiation.After exposing MgAl-LDO/TiO 2 in CO 2 -H 2 O mixture, a broad band at 3440 cm A1 , which can be assigned to the OH stretching, is isolated.It indicated surface hydroxyl group was generated, which might be from the dissociative adsorption of H 2 O on MgAl-LDO/TiO 2 . A species in the presence of H 2 O.A possible reason for these differences might be attributed to the dissociation of adsorbed H 2 O (H 2 O !H OH A ) on the surface Lewis acid sites (coordinately unsaturated Al 3 ) and thus formed Al-OH group, and then m-CO 3 2A Illustration of the mechanism toward the enhanced photocatalytic CO 2 reduction over Pt/MgAl-LDO/TiO 2 in the presence of H 2 O vapor. 3 2A distinctly decreased, indicating m-CO 3 2A species might participate in Scheme 3. Scheme 2. A possible reaction pathway for photocatalytic reduction of CO 2 with H 2 O on Pt/MgAl-LDO/TiO 2 . 505152lated to decrease the energy barrier for CO 2 reduction505152.The enhanced CO 2 reduction on Pt/MgAl-LDO/TiO 2 photocatalyst could be explained by considering the larger number of Lewis acidic and Lewis basic sites in MgAl-LDO, which catalyzed the rate-limiting step in the CO 2 reduction process.A new peak appeared at 2922 cm A1 assigned to vibration of C-H, which may be generated from the product of CH 4 via a multistep reduction.Moreover, the peak intensity of OH groups was obviously decreased, suggesting that H 2 O oxidation reaction occurred.Unfortunately, the characteristic FTIR peaks for other possible intermediates, such as CO, HCOOH, CH 2 O and CH 3 OH, were not distinguished, which might be owing to the low amount without the detection limit of FTIR instrumentation.Based on the above results, a possible route for the conversion of surface m-CO 3 2A to CO 2 A species in the presence of H 2 O are proposed (Scheme 2), that is, the adsorbed H 2 O molecule was dissociated to form surface OH A and H , followed by m-CO 3 2A species coordinated with the dissociated H to form the active reaction intermediate of m-HCO 3 A .As the CAO bond of m-HCO 3 A could be weaken via hydrogen bonding interaction, CAO bond would be easily cleaved to form CO 2 A species with the assistance of photogenerated electrons.Also, a mechanism for the photocatalytic reduction of CO 2 with H 2 O over Pt/MgAl-LDO/TiO 2 was proposed, as shown in Scheme 3. TiO 2 adsorbs light to generate electron-hole pairs, which are then separated to be electrons and holes.The electrons transfer through MgAl-LDO layer by tunneling effect to Pt cocatalysts and participate in CO 2 reduction reaction.Meanwhile, CO 2 is chemisorbed on MgAl-LDO layered TiO 2 to form m-A species.The chemisorbed CO 2 A is mainly reduced to be adsorbed CO via one-electron transfer process.Adsorbed CO subsequently is desorbed to produce CO or further reduced and protonated by electrons and atomic H from H 2 O with a successive electron-transfer process to generate CH 4 .On other hand, the holes in the valence band is trapped by water to generate O 2 . R. Chong et al. / Journal of Catalysis 363 (2018) 92-101 R. Chong et al. / Journal of Catalysis 363 (2018) 92-101 The authors are grateful for the financial support from the National Natural Science Foundation of China (51502078), the Major Project of Science and Technology, Education Department of Henan Province (17B610003), Henan University (YQPY20170013 and 2015YBZR005). Supplementary data associated with this article can be found, in the online version, at https://doi.org/10.1016/j.jcat.2018.04.020."}]