[{"title": "Doi", "content": "10.1039/x0xx00000x"}, {"title": "Article_Title", "content": "Photocatalytic CO 2 Reduction of C/ZnO Nanofibers Enhanced by Ni-NiS Cocatalyst"}, {"title": "Abstract", "content": "Photocatalytic reduction of CO 2 into valuable hydrocarbon fuel via solar energy is a promising strategy for carbon utilization.In the present paper, a hierarchical Ni-NiS/C/ZnO photocatalyst was prepared via the in situ photodeposition of compact Ni-NiS nanosheets onto C/ZnO electrospun nanofibers.The existence of metallic Ni and NiS was confirmed by Xray photoelectron spectroscopy.Photoluminescence (PL) and time-resolved PL spectroscopy revealed that the cocatalyst Ni-NiS enhances the charge separation efficiency of C/ZnO nanofibers.The as-prepared Ni-NiS/C/ZnO showed enhanced CO 2 reduction activity with CO and CH 4 production rates 10 and 15 times greater than those of pristine C/ZnO under 350 W visible light illumination.The intermediates of CH 3 O -, HCHO, and HCOO -were detected by in situ Fourier transform infrared spectroscopy and confirmed that CO 2 reduction is a complex reaction with multiple steps.The 13 C isotopic tracer method proved that CH 4 and CO are obtained from the reduction of CO 2 rather than other carbon species in the environment.The amorphous carbon in C/ZnO could promote optical absorption, improve conductivity and reduce the interfacial charge transport resistance.Ni-NiS improved the electron-hole-pair separation of C/ZnO nanofibers.The observed enhancement in photocatalytic activity was largely attributed to higher light utilization and effective electron-hole separation.This work proves that Ni-NiS is a promising cocatalyst to ZnO for photocatalytic CO 2 reduction."}, {"title": "Experimental", "content": "Ni-NiS/C/ZnO composite photocatalysts were prepared by in situ photochemical deposition.In detail, 100 mg of C/ZnO nanofibers was added to a mixture solution of 5 mL of Ni(CH 3 COO) 2 aqueous solution (0.05 mol L -1 ), 5 mL of thiourea aqueous solution (0.5 mol L -1 ), and 40 ml of a mixed solution of H 2 O and ethanol (volume ratio 1:1).Then, the resultant suspension was bubbled with high purity N 2 for 40 min to remove air.Irradiation was carried out for a given period (20-120 min) with a 350 W Xe arc lamp (UV-visible light, average light intensity10117 W/cm 2 ) at room temperature (see Electronic Supplementary Information Fig. S1).Finally, the ash-black products were collected by suction filtration, washed repeatedly with H 2 O and alcohol, and dried in a 60 C vacuum oven for 24 h.The content of Ni-NiS in the samples was controlled by adjusting the photodeposition time.The asprepared Ni-NiS/C/ZnO nanomaterials were designated C-ZNNS20, C-ZNNS60, and C-ZNNS120 to indicate deposition times of 20, 60, and 120 min, respectively.C-Z and NNS represent pristine C/ZnO nanofibers and Ni-NiS respectively.The precise contents of each element in C-ZNNS20, C-ZNNS60, and C-ZNNS120 were measured by inductively coupled plasma-atomic emission spectrometry (ICP-AES) (Table 1).Besides, the Ni/NiS mass ratio for samples C-ZNNS20, C-ZNNS60 and C-ZNNS120 were presented in Electronic Supplementary Information Table S1. The actual elemental contents of C-ZNNS20, C-ZNNS60, and C-ZNNS120 were determined through ICP-AES.X-ray diffraction (XRD) patterns were recorded on a D/Max-RB Xray diffractometer (see Electronic Supplementary Information, Fig. S2).Sample morphologies were observed on a JSM 7500F field emission scanning electron microscope (FESEM).Transmission electron microscopy (TEM) and energy dispersive X-ray (EDX) spectrometry were conducted on a Titan G2 60-300 electron microscope.N 2 /CO 2 adsorptiondesorption data were recorded on a Micromeritics ASAP 3020 N 2 adsorption apparatus (USA) at 423.15 K. Pore size distributions were determined by using desorption data via the Barret-Joyner-Halenda method.The ultraviolet-visible (UV-Vis) diffuse reflectance spectra of samples were recorded on a Shimadzu UV-2600 spectrophotometer.X-ray photoelectron spectroscopy (XPS) measurements were conducted on a Thermo ESCALAB 250Xi instrument with Al K X-ray radiation.In situ Fourier transform infrared spectroscopy (FTIR, Nicolet iS50, TMO, USA) was used to monitor the photocatalytic CO 2 reaction process online. Electrochemical impedance spectroscopy (EIS) and Mott-Schottky (M-S) measurements were measured by using an electrochemical analyzer (CHI660C Instruments) in a standard three-electrode system in which a Pt wire and Ag/AgCl (saturated KCl) were set as the counter electrode and reference electrode, respectively.EIS measurements were carried out by applying a bias of 10 mV and recording over the frequency range of 0.01-10 5 Hz.All applied potentials were converted to that of a normal hydrogen electrode (NHE), NHE Ag/AgCl .0.197 V Photocatalytic reduction of CO 2 was carried out in a 200 mL home-made Pyrex reactor according to our previously reported method.A 350 W simulated solar Xe arc lamp (Zhenjian Silver Jewelry Chemical, China) was used as the light source in photocatalytic reduction of CO 2 (visible light, average light intensity10117 W/cm 2 ).Blank experiments were carried out in the absence of CO The instrument was equipped with a flame ionization detector (FID).N 2 was used as carrier gas during the test.The photocatalytic products were taken from the photocatalytic reactor by a 100 uL sampler and then injected into the instrument for detection.The morphologies of the samples were explored by using FESEM and TEM, and the results are shown in Fig. 1.Pristine C-Z had smooth nanofibers with an average diameter of 400 nm (Fig. 1a andinset).Numerous Ni-NiS nanosheets grew out of the C-Z nanofibers upon photodeposition (Fig. 1b andinset).The optical properties of the materials were studied to determine their optical absorption properties, 48 and the results are shown in Fig. 2. Compared with commercial ZnO, C-Z could absorb UV and some near-infrared light due to its carbon content. 49The absorption of C-ZNNS60 was greatly improved compared with that of pristine C-Z due to the dark color and narrow band gap of Ni-NiS. 50Among the samples studied, NNS possessed the best absorption properties, which is mainly due to its black coloration and photothermal effects.Moreover, the higher the cocatalyst loading, the better the absorbance observed (see Electronic Supplementary Information, Fig. S3).These results indicate that adding carbon and loading with the cocatalyst favor absorption and could effectively improve the photocatalytic activity of the photocatalysts. 51he surface area (S BET ), pore volume (V p ) and average pore size (d p ) of the resultant samples were measured by N 2 sorption technique.The N 2 adsorption-desorption isotherms of C-Z, NNS, C-ZNNS20, C-ZNNS60 and C-ZNNS120 were presented in Fig. 3a.The isotherms of five samples can be considered to be type IV isotherm.In addition, we can observe H3 type hysteresis rings from their characteristics, which generally means that there are a lot of lamellar materials forming slit holes.The pore size distributions of different samples are illustrated in the inset of Fig. 3a.Compared with C-Z, the composites possessed more mesopores around 3 nm, which caused by the tiny slits accumulated by Ni-NiS nanosheets."}, {"title": "Results_and_discussion", "content": "The S BET , V p and d p of all the samples are listed in Table 2, indicating that the specific surface areas of composite decrease toward C-Z.The V p and d p of the composite samples also decreased compared with the pristine C-Z, implying that loading of Ni-NiS changed the pore structure of the samples.Usually, the decrease of S BET will reduce the active sites of photocatalysts and their photocatalytic performance.However, S BET is not the only factor affecting photocatalytic activity. CO 2 adsorption isotherms (Fig. 3b) of NNS, C-Z, and C-ZNNS60 were examined to evaluate their CO 2 adsorption capability because adsorption is an initial and indispensable step for the complex CO 2 reduction process.As the relative pressure reached atmospheric pressure, NNS, C-Z, and C-ZNNS60 showed maximum CO 2 adsorption values of 0.019, 0.078, and 0.341 mmol g -1 , respectively.C-ZNNS60 clearly exhibits CO 2 adsorption capacity superior to those of pristine C-Z and NNS, which could be attributed to the hierarchical structure built by C-Z and NNS in the catalyst.Ni and Ni 2 could also provide abundant coordination, activation, and reduction sites for CO 2 molecules.Lewis acid-base neutralization between NiS and CO 2 is a factor that must be considered. 52Chemical adsorption facilitates CO 2 enrichment and enhances the photocatalytic activity for CO 2 reduction; these concepts will be discussed in detail later in this paper.Besides, S peaks became much less noticeable for C-ZNNS60, due to the too low content of the Ni-NiS deposited on C/ZnO nanofibers.In fact, S element still exists according to the S 2p high-resolution spectrum of C-ZNNS60 (Fig. 4e). 4 The O 1s XPS spectra of C-Z and C-ZNNS60 in Fig. 4c illustrates two peaks at 529.6 and 531.5 eV, which correspond to the lattice and hydroxyl oxygen atoms in C-Z and C-ZNNS60, respectively.In Fig. 4d, which shows the Ni 2p XPS spectrum, two chemical states of Ni, namely, Ni 0 (853.8 and 871.1 eV) and Ni 2 (857.5 and 874.8 eV), could be observed; these states directly indicate the generation of NiS and metallic Ni.In addition, two peaks located at 862 and 880.5 eV could be ascribed to the satellite peaks of Ni 2 2p 3/2 and Ni 2 2p 1/2 , respectively. The slope of the straight line in the M-S plot of C-Z is positive, thus indicating that it is an n-type semiconductor.The flat-band potential (E fb ) of C-Z could be obtained from the M-S measurements in Fig. 5a.The conduction band (CB) minimum of n-type semiconductors is approximately equal to its E fb .Thus, the CB level of C-Z is -0.7 V versus NHE at pH7.Given that the potentials of CO 2 /CO (-0.53 V) and CO 2 /CH 4 (-0.24V) at pH7 are lower than the CB level of C-Z, the e CB-in the CB can migrate to Ni-NiS and effectively reduce CO 2 to CO and CH 4 . EIS was performed to study the carrier-migration rate in photocatalysts (Figure 5b).In general, charge transport becomes more efficient as the semicircle in the Nyquist diagram becomes smaller.As shown in Fig. 5b, C-Z has a smaller arc radius relative to that of commercial ZnO; this result could be ascribed to the introduction of carbon and improvements in conductivity, which is vital evidence of the ability of carbon to reduce the interfacial charge transport resistance of the materials.NNS possesses a smaller arc radius compared with C-Z and C-ZNNS60 because of its good conductivity.In addition, the arc radius of C-ZNNS60 is smaller than that of C-Z, which indicates that in situ deposition of NNS reduces the interfacial electron-transfer resistance and promotes the migration ability of photogenerated e CB-.The photocatalytic CO 2 reduction performance of the samples was evaluated under 350 W xenon lamp illumination.Fig. 6a shows the CO and CH 4 production rates of C-Z, C-ZNNS20, C-ZNNS60, C-ZNNS120, and NNS.Control experiments showed that the target products are not produced in the absence of a photocatalyst, carbon source, or illumination.Pristine C-Z and NNS showed very low production rates of CO and CH 4 due to rapid e CB--h VB recombination.However, the photocatalytic yields of CO and CH 4 were greatly enhanced after the combination of C-Z and NNS.In addition, as the NNS loading increased, the yields of CO and CH 4 first increased and then decreased, peaking at 5.86 and 1.14 mol g -1 h -1 , respectively.This result could be attributed to the ability of the cocatalyst to enhance the charge separation efficiency of the system at an appropriate loading content.However, overloading Ni-NiS could shield the absorption of C-Z, which is harmful to CO 2 reduction. An isotope experiment of the photocatalytic-reduction reaction containing 13 CO 2 ( 12 CO 2 as a reference) was conducted by using GC-MS (Fig. 6b) to prove that the products CO and CH 4 originate from the CO 2 reduction reaction rather than other carbon species in the environment.When NaH 13 CO 3 was used as the carbon source, 13 CH 4 and 13 CO with m/z17 and m/z29, respectively, were the major products formed.Conversely, 12 CH 4 and 12 CO with m/z16 and m/z28, respectively, were the major products formed when NaH 12 CO 3 was used as the carbon source.These results strongly confirm that the carbon in the photocatalytic products comes from the decomposition of NaHCO 3 rather than the pollution carbon in the environment.Cycling stability is an important factor to consider for a catalyst.Fig. 6c shows that the decline in catalyst activity is nearly negligible after four cycles of usage, which indicates the good stability of C-ZNNS60.In order to further study the charge recombination and separation behaviors of the as-prepared samples, photoluminescence (PL) spectra were conducted, and the results are shown in Figure 8a. 58061 The peak at 449 nm is generated by bound excitons.Moreover, the peak at 485 nm could be attributed to Zn vacancies. 62The PL fluorescence intensity of the composites decreased significantly compared with that of C-Z, thus indicating that the former has a lower e CB--h VB recombination rate.The minimal fluorescence intensity of C-ZNNS60 also indicates that this sample presents the best photocatalytic performance among the catalysts.These results prove that Ni-NiS could boost the separation and transfer of charge carriers as a cocatalyst, thereby leading to high photocatalytic activity. To explore the carrier lifetimes and decay dynamics in Ni-NiS/C/ZnO nanofibers, Time-resolved PL (TRPL) spectra of C-Z, NNS and C-ZNNS60 were taken (Figure 8b), and the average lifetimes obtained from three-exponential fitting are presented in Table 3.The average lifetime of C-ZNNS60 was the shortest among the three samples, likely because of higher non-radiation transitions in this sample.The cocatalyst Ni-NiS serves as an electron sink and accelerates the separation of e CB-from C/ZnO to Ni-NiS and then to CO 2 .Thus, e CB--h VB recombination in C/ZnO is effectively inhibited, and the photocatalytic reduction activity of CO 2 is efficiently improved.According to the M-S curve, the CB potential of C/ZnO is -0.7 V versus NHE at pH7 (Fig. 5a) but the redox potential of Ni 2 /Ni 0 is only -0.64 V (versus NHE).Thus, e CB-on the CB of C/ZnO possess enough reduction capacity to reduce Ni 2 to Ni 0 directly.First, e CB-and h VB gather at the surface when C/ZnO is illuminated.Then, some of the Ni 2 and ethanol is reduced/oxidized to Ni 0 and acetic acid by e CB-and h VB , respectively.The remaining Ni 2 reacts with the S 2-produced by the decomposition of thiourea to form NiS, which eventually forms a hierarchical structure of Ni-NiS/C/ZnO.Ni-NiS acts as a cocatalyst to promote the separation and transfer of e CB-from the C/ZnO CB to itself, during which CO 2 molecules are reduced to CO and CH 4 . Based on the above results, we propose the photocatalytic mechanism shown in Fig. 9.Although the CB edge of C/ZnO (-0.7 V) is more negative than the reduction potentials of CO 2 /CO (-0.53 V) and CO 2 /CH 4 (-0.24V), pristine C/ZnO reduces CO 2 with fairly low efficiency due to the rapid recombination of e CB-and h VB and its poor CO 2 adsorption.When C/ZnO is modified by Ni-NiS, e CB-migrate from ZnO to the electron storage carbon and cocatalyst Ni-NiS.Optimization of the charge transport pathway effectively suppresses the recombination of e CB-and h VB , thereby efficiently improving CO 2 photoreduction activity.However, increasing the concentration of cocatalyst (mass ratio Ni/NiS0.39)from 4.75 to 6.68 is harmful to the photocatalytic activity due to the shielding effect of Ni-NiS."}, {"title": "Conclusions", "content": "Photocatalytic reduction of CO 2 was carried out in a 200 mL home-made Pyrex reactor according to our previously reported method.A 350 W simulated solar Xe arc lamp (Zhenjian Silver Jewelry Chemical, China) was used as the light source in photocatalytic reduction of CO 2 (visible light, average light intensity10117 W/cm 2 ).Blank experiments were carried out in the absence of CO 2 or light irradiation to confirm that CO 2 Fig. 1.FESEM images of (a) C-Z and (b) C-ZNNS60.Insets: Corresponding enlarged images.(c) TEM and (d) HRTEM images of C-ZNNS60.(e) EDX elemental mapping of C-ZNNS60. Fig. 1c reveals the existence of Ni-NiS nanosheets and confirms that Ni-NiS is tightly attached to the C-Z surface.The highresolution TEM (HRTEM) image in Fig. 1d shows lattice spacings of 0.106 and 0.16 nm, which respectively correspond to hexagonal ZnO (110) and rhombohedral NiS (211) facets.These results agree with the XRD results and demonstrate that Ni-NiS is indeed uniformly deposited on the C-Z nanofibers.The EDX elemental mapping of C-ZNNS60 (Fig. 1e) proves that the sample contains Zn, O, Ni, S, and C elements, thus confirming the existence of C/ZnO and Ni-NiS. Fig. 2. UV-vis diffuse reflectance spectra of commercial ZnO, C-Z, C-ZNNS60, and NNS. Fig. 3. (a) N 2 adsorption-desorption isotherms and pore size distribution curves (inset) of C-Z, NNS, C-ZNNS20, C-ZNNS60, and C-ZNNS120.(b) CO 2 adsorption isotherms of NNS, C-Z, and C-ZNNS60. Fig. 4. (a) XPS survey spectra of C-Z and C-ZNNS60.high-resolution XPS spectra of (b) Zn 2p, (c) O 1s of C-Z and C-ZNNS60, (c) Ni 2p and (d) S 2p of NNS and C-ZNNS60. March 2020.Downloaded by University of Reading on 3/11/2020 7:57:13 AM.View Article Online DOI: 10.1039/C9NR10451HThis journal is The Royal Society of Chemistry 2020 Nanoscale, 2020, 00, 0-0 5 Please do not adjust margins Please do not adjust margins Fig. 5. (a) Mott-Schottky curves of C-Z.(b) Nyquist plots of commercial ZnO, C-Z, C-ZNNS60, and NNS. Fig. 6.(a) Photocatalytic CO 2 reduction performance of all samples.(b) CO and CH 4 mass spectra of C-ZNNS60.(c) Cyclic CO 2 reduction curves for CO and CH 4 yield (350 W, NaHCO 3 1 mmol). Fig. 7.In situ FTIR spectra of C-ZNNS60: (a) In the absence of CO 2 and H 2 O in dark, after adsorption of CO 2 and H 2 O for (b) 30 min and (c) 60 min in the dark, and under light irradiation for (d) 30 min and (e) 60 min. Fig. 9. Schematic diagram of photogenerated electron transfer paths in Ni-NiS/C/ZnO. March 2020.Downloaded by University of Reading on 3/11/2020 7:57:13 AM.View Article Online DOI: 10.1039/C9NR10451H Zinc acetate (C 4 H 8 O 4 Zn, 99.0), commercial ZnO, N,Ndimethylformamide (DMF, 99.5), thiourea (CH 4 N 2 S, 99.0), nickel acetate (C 4 H 6 NiO 4 4H 2 O, 98.0), absolute ethanol (C 2 H 5 OH), and Na 2 SO 4 (99.0) were purchased from Sinopharm Chemical Reagent Co. Ltd.Polyvinyl pyrrolidone (PVP, M n 1,300,000, K88-96) and Nafion perfluorinated resin solution were purchased from Sigma-Aldrich.All reagents were used without further purification. Average fluorescence lifetimes of the samples. This work was supported by the National Key Research and Development Program of China (2018YFB1502001), the NSFC (51961135303, 51932007, 21871217, U1905215 and U1705251), the National Postdoctoral Program for Innovative Talents (BX20190259), the Innovative Research Funds of SKLWUT (2017-ZD-4), China Postdoctoral Science Foundation (2019M660189) and the Fundamental Research Funds for the Central Universities (WUT: 2019IVA111). Published on 05 March 2020.Downloaded by University of Reading on 3/11/2020 7:57:13 AM. View Article Online DOI: 10.1039/C9NR10451H In this work, a hierarchical Ni-NiS/C/ZnO photocatalyst was prepared by photodepositing Ni-NiS nanosheets onto electrospun C/ZnO nanofibers.We found that Ni-NiS can remarkably enhance the photocatalytic CO 2 reduction activity of C/ZnO nanofibers when applied as a cocatalyst.Ni-NiS/C/ZnO favored the adsorption of CO 2 due to chemical adsorption between the cocatalyst and CO 2 molecules.Furthermore, part of the Ni 2 is reduced by e CB-and the cocatalyst Ni-NiS is formed during sample preparation; this cocatalyst serves as an electron sink and suppresses the rapid recombination of e CB-and h VB during the photocatalytic process.Hence, the functions of Ni-NiS are confirmed to increase the adsorption of CO 2 on the cocatalyst Ni-NiS surface and promote e CB-migration from C/ZnO nanofibers to the Ni-NiS nanosheets to CO 2 molecules.Amorphous carbon functions as an electron storage and electron enrichment center due to its good electrical conductivity.Besides, it can effectively remedy the poor light utilization of ZnO by improving its absorbance and broadening its wavelength range.Moreover, the exist of amorphous carbon could reduce the interfacial charge transport resistance and promote the migration ability of photogenerated electrons.Our work provides new insights into approaches to enhance the photocatalytic CO 2 reduction activity of ZnO by addition of carbon and loading with the transition metal cocatalyst Ni-NiS. The authors have no conflicts of interest to declare."}]