[{"title": "Doi", "content": "10.1016/j.apsusc.2016.06.148"}, {"title": "Article_Title", "content": "Enhanced selective photocatalytic CO 2 reduction into CO over Ag/CdS nanocomposites under visible light"}, {"title": "Abstract", "content": "Photocatalytic reduction of carbon dioxide can convert chemically inert carbon dioxide into useful chemical fuel in a mild manner.Herein, Ag-CdS nanocomposites were prepared by photodeposition method and examined for photocatalytic CO 2 reduction under visible light.Meanwhile, the nanocomposites were characterized by XRD, SEM, TEM, XPS, DRS and PL in detail.The results show that, the deposition of Ag improves the photocatalytic performance of CdS, especially in the selectivity of CO 2 -to-CO.The highest photocatalytic activity is achieved over 1.0 wt. Ag/CdS, with an increase by 3 times in comparison to CdS.In this reaction system, Ag can serve as electron trap as well as active site for CO 2 reduction, which is probably responsible for the enhanced activity and selectivity of CO 2 to CO over Ag/CdS.The possible mechanism of CO 2 photoreduction over Ag/CdS was proposed in view of the abovementioned analysis."}, {"title": "Experimental", "content": "Cadmium sulfide (CdS) and silver nitrate (AgNO 3 ) were purchased form Aladdin Chemical Company, triethanolamine (TEOA) and N,N-Dimethylformamide (DMF) were provided by Sinopharm Chemical Reagent Co., Ltd.All the chemical reagents for the photocatalytic reactions were used without further purification.For the synthesis of Ag/CdS, CdS (20 mg) was dispersed in the mixture of H 2 O (16 mL) and TEOA (4 mL), a certain volume of 50 mmol/L AgNO 3 solution (the weight ratio of Ag to CdS for Ag/CdS is 0.5, 1.0, 3.0, or 5.0 wt.) was added into the mixture, then it was irradiated under visible light ( 420 nm) for one hour.The mixture was filtered and the solids were cleaned with D.I. water.Finally, the obtained Ag/CdS was dried in a vacuum oven at 60 C overnight.The value for the actual Ag loading of the synthesized catalysts obtained by using inductively coupled plasma mass spectrum (ICP-MS), which is summarized in Table 1. Powder X-ray diffraction (XRD) was collected on a Bruker D8 Advance instrument (Cu Ka1 irradiation, 1.5406A).Scanning electron microscope (SEM) images were taken on a field emission scanning electron microscope (Hitachi, SU8010).Transmission electron microscopy (TEM) images were obtained on a FEI Tencai 20 microscope.X-ray photoelectron spectra (XPS) were collected on a PHI Quantum 2000 XPS system with the C1s peak (284.6 eV) as a reference.UV-vis diffuse reflectance spectra (DRS) was measured on a Varian Cary 500 Scan, with BaSO 4 as a reference.Photoluminescence (PL) spectra were carried out on an Edinburgh FL/FS900 spectrophotometer at ambient condition.The Brunauer-Emmett-Teller (BET) specific surface area and CO 2 adsorption were measured with an ASAP2020M apparatus.After degassing in vacuum, the nitrogen adsorption and desorption isotherms for the samples were measured at 77 K, and CO 2 adsorption isotherms were measured at 273 K.The CO produced from 13 CO 2 isotopic experiment was carried out on an HP 5973 gas chromatographymass spectrometer (GC-MS). Typically, to investigate the photocatalytic CO 2 reduction performance for the catalysts, CdS or Ag/CdS (5 mg), H 2 O (4 mL), and TEOA (2 mL) were added into a Schlenk flask reactor (80 mL).Then pure CO 2 was introduced to the reactor with a partial pressure of 1.0 atm.A 300 W Xe lamp with a 420 nm cutoff filter was used as the light source.During the photocatalytic reaction, the reaction solution was vigorously stirred with a magnetic stirrer.After photocatalytic reaction for one hour, the formed products were sampled and quantified by the Shimadzu (GC-2014) gas chromatograph, equipped with a thermal conductivity detector (TCD), flame ionized detector (FID) and methanizer."}, {"title": "Results_and_discussion", "content": "The crystal phase of the samples was examined by XRD.As shown in Fig. 1, all the samples exhibit the characteristic diffraction peaks for CdS (PDF41-1049).When the loading of Ag is lower than 1, no characteristic diffraction peaks belonging to Ag are observed, this is due to the low content and/or high dispersion of Ag in Ag/CdS samples.When the loading of Ag increases from 1 to 5, the diffraction peak at 2 38 corresponding to the (111) plane diffraction of Ag emerges and gradually becomes sharper (PDF04-0783).However, no evident shift in peak positions is observed among the samples, suggesting that Ag is probably attached on the surface of CdS rather than incorporated into the lattice of CdS. The structure and morphology of the samples were further characterized with SEM and TEM.As shown in Fig. 2, both two samples exist in the form of nanoparticles, and the introduction of Ag has not changed the morphology CdS nanoparticles.The microstructure of Ag/CdS was investigated by HRTEM.In Fig. 3, it is clear to observe interplanar spacing of 0.34 nm and 0.24 nm, these could be assigned to the (002) lattice plane of CdS and the (111) lattice plane of Ag, respectively 15,41.This further indicates that Ag nanoparticles are deposited onto the surface of CdS and thus form the intimate contacts between CdS and Ag.Such contacts will facilitate electron transfer from CdS nanoparticles to the Ag, which will lead to the enhancement of the photogenerated electron-hole pairs separation. The chemical composition and chemical state of elements in Ag/CdS was investigated by X-ray photoelectron spectroscopy (XPS).As shown in Fig. 4, the survey spectrum presents elemental peaks of C, O, Cd, S and Ag.The inevitable existence of C and O peaks are derived from adventitious carbon species and the adsorbed oxygen.In the XPS spectrum of Cd3d, two main peaks are observed at 405.1 eV (Cd3d 5/2 ) and 411.8 eV (Cd3d 3/2 ), consistent with the reported results of Cd 2 in CdS 44,45.The spectrum of S2p indicates that the peak can be deconvoluted into two peaks, located at 161.3 eV (S2p 3/2 ) and 162.1 eV (S2p 1/2 ) respectively, corresponding to S 2-in CdS 25.Additionally, the XPS spectrum of Ag displays two peaks of 367.8 eV (Ag3d 5/2 ) and 373.9 eV (Ag3d 3/2 ), implying that Ag is of metallic nature 46.This is consistent with the XRD and TEM measurement results. N 2 -sorption measurements were conducted to study the pore structure of the samples.The isotherms shown in Fig. 5 are identified as type IV, indicative of mesoporous materials 15.Combined with SEM and TEM results, it can be concluded that the pores most likely arise from the stacking among the small nanoparticles.The textural parameters derived from N 2 -sorption isotherm data are summarized in Table 2.The BET specific surface area (S BET ) of CdS and Ag/CdS were 79.9 and 77.4 m 2 /g, respectively.The slight decrease in S BET and pore volume may be resulted from the partial surface coverage of CdS by the deposited Ag nanoparticles.Moreover, CO 2 adsorption over CdS and 1.0 wt. Ag/CdS was also measured and the result is shown in Fig. 6.Interestingly, Ag/CdS (7.40 mg g -1 ) shows a higher adsorption capability toward CO 2 compared to CdS (6.93 mg g -1 ), this might be because the loaded Ag functions as CO 2 adsorption sites 47,48.The enrichment of the adsorption capability toward CO 2 may boost its photocatalytic performance for CO 2 reduction, this is because the CO 2 adsorption is vital step for CO 2 reduction 41. The optical absorption for the samples were characterized by UV-vis diffuse reflectance spectroscopy.As shown Fig. 7, the samples display a sharp edge at around 525 nm 15, corresponding to the excitation of electrons from the VB to the CB of CdS.After photodepositing Ag, the absorption edge of the composites does not change, indicating that Ag is only supported on the surface of CdS rather than incorporated into the lattice of CdS, which is consistent with the XRD results.It is noted that, there is an enhanced absorbance in the wavelength larger than 550 nm, and the intensity increases with the increase of Ag content in the samples.This is in harmony with the color change of the Ag/CdS nanocomposites from orange to dark green with the increasing Ag amount.Bind ing ene rgy (eV) Intensity (a.u.) Photocatalytic CO 2 reduction experiments were carried out by using TEOA as a sacrificial agent (hole scavenger) under visible-light illumination for one hour, and the results are shown in Fig. 8.In this reaction system, besides CO and H 2 , no other hydrocarbon as potential products is detected.For CdS, it exhibits a low photocatalytic activity, with CO and H 2 production amounts of 0.43 mol and 8.85 mol, respectively.After loading Ag, the produced amounts for both CO and hydrogen increase, and the photocatalytic performance of CdS is strongly dependent on the loading amount of Ag.The amounts of the produced CO and H 2 increase at the outset and then attains an optimum when the loading amount of Ag is 1.0 wt..The amount of CO production over 1.0 wt. Ag/CdS is about 3 times higher than that over CdS.Further increase Ag loading in Ag/CdS brings bout a decrease in their photocatalytic CO and H 2 produc-tion.The decrease in the activity of Ag/CdS catalysts with a high loading of Ag could be ascribed to the light blocking effect. The control experiments were also carried out and the results are summarized in Table S1.No products were detected when the reaction was performed in the dark, without catalyst or without TEOA, suggesting that the CO 2 -to-CO conversion reaction is proceeded by photocatalysis.In order to confirm the involvement of CO 2 in the reaction, we replaced CO 2 with high purity Ar atmosphere.After reaction under otherwise identical conditions, only H 2 gas was detected, without any CO production.Furthermore, a 13 C-labeled isotropic experiment by using 13 CO 2 in place of 12 CO 2 , and the CO produced then analyzed by GC-MS.The result (Fig. S1) shows that, 13 CO (m/z 29) is detected when 13 CO 2 is the reactant.All these results undoubtedly confirm that CO produced is derived from the CO 2 reactant.The stability is very important for practical photocatalytic system, thus the stability test over 1.0 wt. Ag/CdS was carried out.The results (Fig. S2) show that, during the cyclic runs, hydrogen production has a slight decrease in three subsequent runs, but CO evolution is very stable in the four runs.It has been reported that the photocatalytic activity and CO selectivity are significantly influenced by reaction media in the photoctalytic CO 2 reduction system.Thus we also investigated the effect of the volumetric ratio of H 2 O/TEOA on the catalytic performance over Ag/CdS photocataysts.As displayed in Fig. 9, it exhibits a low photocatalytic activity and selectivity in the mixture of H 2 O/TEOA with ratio of 1/5.When the volume ratio of H 2 O to TEOA increases to 4/2, it causes a decreased viscosity of the reaction media, which together with the decreased steric hindrance limits catalytic kinetics 4, thus the highest catalytic perform for CO 2 reduction reaction is achieved in this study.If the reaction is carried out in TEOA-dominant mixed solutions (volume ratio of H 2 O to TEOA 5:1), the resultant lower activity could be explained by the poor chemical affinity of water toward CO 2 molecules 37. To reveal the reasons for the enhanced photocatalytic CO 2 reduction performance over Ag/CdS, its behaviors of photogenerated-carriers were investigated.The dynamic behavior of the charge carriers was monitored by measuring open circuit potential (OCP) decay in a typical three-electrode cell 49 (see the Supporting Information for details).As shown in Fig. 10, when the illumination light is off, Ag/CdS shows a much stronger response potential than CdS, implying that the charge transfer rate in Ag/CdS is more faster than that in CdS.Furthermore, we also investigated their photocurrent response behavior under visible light irradiation.As shown in Fig. 11, steady photocurrent response is found in the light-dark cycles, indicative of good stability for the samples.Importantly, Ag loading obviously improves the photocurrent response of CdS.This also confirms the promotional effect of Ag on the charge separation.Photoluminescence (PL) spectra were also examined to investigate the migration, transfer, and recombination processes of the photogenerated charge carriers over CdS and Ag/CdS samples.As displayed in Fig. 12, a broad-band peak at 640 nm, which is assigned to the radiative recombination at deep trap sites derived from lattice imperfection at the surface 50,51.The quenching of emission peak intensity for Ag/CdS implies that Ag cocatalyst can effectively prohibit the recombination of photogenerated charge carries on CdS, resulting in the high photocatalytic efficiency. Based on the above results, a possible reaction mechanism for photocatalytic CO 2 reduction over Ag/CdS photocatalyst was proposed.As illustrated in Scheme 1, upon visible light irradiation, electrons and holes are generated in the conduction band (CB) and valence band (VB) over CdS, respectively.The photo-generated carriers migrate to the surface of CdS, the holes oxidize the TEOA, and the electrons reduce protons or CO 2 to produce H 2 or CO.When Ag nanoparticles as cocatalysts are deposited on the surface of CdS, thus forming abundant intimate contact between CdS and Ag, which will play some important roles in the photocatalytic CO 2 reduction.On one hand, such intimate contact can improve the separation of the photoexcited electrons and holes; On the other hand, Ag nanoparticles can act as active catalysts for CO 2 reduction.As a result, an enhanced photocatalytic CO 2 reduction performance is achieved over Ag/CdS."}, {"title": "Conclusions", "content": "Ag/CdS nanocomposites were successfully prepared by photodeposition of Ag tightly attached to CdS.The obtained Ag/CdS were effective as photocatalysts for the CO 2 reduction reaction, and 13 CO 2 isotope experiment confirmed that CO 2 was the carbon source to produce CO.The activity of CO 2 to CO over CdS is increased by up to 3 times when CdS is loaded with 1.0 wt. of Ag.This is because Ag can serve as electron trap as well as active site for CO 2 reduction.This work demonstrates a possibility for the use of silver as a cocatalyst in the photocatalytic CO 2 reduction under visible light. Fig. 1.X-ray diffraction patterns of CdS and Ag/CdS samples (CdS: PDF41-1049; Ag: PDF04-0783). Fig. 2. FESEM images of CdS (A) and 1.0 wt. Ag/CdS (B). Fig. 3. TEM images of 1.0 wt. Ag/CdS. Fig. 4. XPS survey spectrum of 1.0 wt. Ag/CdS (A), high-resolution spectra of Cd3d (B), S2p (C) and Ag3d (D). Fig. 5. N2 adsorption-desorption isotherms and corresponding pore size distribution curves (inset) of CdS and 1.0 wt. Ag/CdS. Fig. 8. Photocatalytic production of H2 and CO over Ag/CdS with the different amounts of Ag loading. Fig. 9.The effect of the volumetric ratio of H2O/TEOA on the phtocatalytic performance. Scheme 1. Proposed mechanism of the photocatalytic CO2 reduction over Ag/CdS. Fig. 11.Transient photocurrent response of CdS and 1.0 wt. Ag/CdS in 0.2 M Na2SO4 aqueous solution containing 5 TEOA under visible light irradiation. Fig. 12.The photoluminescence (PL) spectra of CdS and 1.0 wt. Ag/CdS. The loading amount of Ag in the catalysts. The SBET, pore size, pore volume, and the CO2 adsorbed amounts on CdS and 1.0 wt. Ag/CdS. APSUSC-33518; No. of Pages 8 The work was supported by 973 Program (2014CB260406), NSFC (21203030), Program for New Century Excellent Talents in University of Fujian Province (JA13020), Natural Science Foundation of Fujian Province (2014J01041) and the Award Program for Qishan Scholar of Fuzhou University (XQS1401). Supplementary data associated with this article can be found, in the online version, at http://dx.doi.org/10.1016/j.apsusc.2016.06.148."}]