[{"title": "Doi", "content": "10.1039/c8ta09302d"}, {"title": "Article_Title", "content": "Carbon-vacancy modified graphitic carbon nitride: enhanced CO<sub>2</sub> photocatalytic reduction performance and mechanism probing"}, {"title": "Abstract", "content": "The obstacles to achieving high CO 2 photoreduction performance on graphitic carbon nitride (GCN) are commonly ascribed to its weak CO 2 activation capability and low charge carrier concentration.To overcome these obstacles, here we report a new class of GCN with C vacancies intentionally introduced by heat treatment in an NH 3 atmosphere.GCN with enriched C vacancies exhibits more than two times higher CO 2 -to-CO conversion rate than pristine GCN.Our detailed characterization reveals that the improved CO 2 reduction performance of this carbon-vacancy modified GCN is attributed to the enhanced CO 2 adsorption/activation, upshifted conduction band and elevated charge carrier concentration and lifetime.Moreover, we discover that the introduction of C vacancies into GCN could attenuate the exciton-effect and favor the charge carrier generation.These results not only provide insights on regulating the structure of GCN to promote its CO 2 photoreduction performance, but also pave the way to tune the exciton effect and charge carrier concentration in GCN to facilitate photoinduced electron-hole separation and charge-carrier-involved photocatalytic reaction."}, {"title": "Experimental", "content": "Synthesis of pristine graphitic carbon nitride (GCN).Pristine GCN was prepared by heating urea (about 20 g) in a crucible with a cover to 550 C for 2 h at a ramp rate of 5 C min A1 in a muffle furnace.Aer being cooled to room temperature naturally, the obtained light yellow product was ground into powder and designated as GCN. Synthesis of graphitic carbon nitride with C vacancies (GCN510).According to a previous report, 18 a modied method was used to prepare GCN incorporated with C vacancies.0.8 g of GCN was heated in a tube furnace under a N 2 ow to 510 C at a ramp rate of 5 C min A1 , then under an NH 3 ow (200 mL min A1 ) for another 1 h (Caution: please check the channel carefully before the experiment and keep watch for the leakage of NH 3 ), and nally cooled to room temperature under a N 2 ow.The as-prepared GCN with C vacancies was denoted as GCN510. X-ray diffraction measurement (XRD) was carried out on a Rigaku D/MAX 2250 PC diffractometer with Cu Ka radiation (l 14 0.154056 nm) in the 2q range of 10-80 at a scanning rate of 4 min A1 .Transmission electron microscopy (TEM) images were collected on a JEOL 200CX electron microscope operated at 200 kV.Fourier transform infrared (FTIR) spectroscopy was performed on a Nicolet iS10 FTIR spectrometer using the KBr technique.Electron spin resonance (ESR) measurements were performed on a JEOL FA200 ESR spectrometer at room temperature.The UV-Vis absorption spectra and diffuse reectance spectra (DRS) were collected on a UV-3600 Shimadzu spectrophotometer.Photoluminescence spectra (PL) were measured with a Hitachi F4600 uorescence spectrophotometer under an excitation wavelength of 360 nm at room temperature.CO 2 temperature programmed desorption (CO 2 -TPD) was performed on a Micromeritics Chemisorption Analyser.Aer being pretreated at 200 C in helium for 1 h and cooled to room temperature, the samples were purged under high purity CO 2 for 30 min, and then the physically adsorbed CO 2 was isothermally removed with helium at a ow rate of 30 mL min A1 until the baseline was at.Finally, the temperature was gradually increased to 400 C at a ramp rate of 5 C min A1 .N 2 adsorptiondesorption isotherms at 77 K were carried out on a Micromeritics ASAP2020 system.All samples were degassed at 150 C for more than 6 h before the analysis.The surface area and pore size distribution of each sample were calculated by the Brunauer-Emmett-Teller (BET) method from the adsorption branch acquired in the relative pressure range of 0.01-0.1 and the Barrett-Joyner-Halenda (BJH) method, respectively.X-ray photoelectron spectroscopy (XPS) measurements were conducted on a Thermo Scientic ESCALAB 250 spectrometer with Al Ka radiation as the excitation source.Binding energies were calibrated by setting C 1s to 284.6 eV. Electron spin resonance (ESR) trapping measurement.20 mg of the photocatalysts were uniformly dispersed in 10 mL of deionized water to obtain 2 g L A1 photocatalyst aqueous suspensions.For each O 2 c A ESR trapping test, 50 mL of the aqueous suspension of the photocatalyst was mixed with 500 mL of a 5,5-dimethyl-1-pyrroline-N-oxide (DMPO, 50 mM) solution.For each 1 O 2 ESR trapping test, 50 mL aqueous suspension of the photocatalyst was mixed with a 500 mL 2,2,6,6-tetramethylpiperidine (TEMP, 50 mM) solution.Aer being illuminated by a xenon lamp for 3 min, the mixture was tested using a JEOL FA200 ESR spectrometer at room temperature.The control tests were conducted under the same conditions but without photocatalysts. Photoelectrochemical measurement.20 mg of the photocatalysts and 40 mg of iodine were ground together and added into 40 mL acetone in a test tube, followed by sonication for 1 h to get a homogeneous ink.Subsequently, the dispersion was transferred into a 20 mL beaker with two pieces of Fluorinedoped Tin Oxide (FTO) conductive glass.A voltage of 10 V was applied to deposit the photocatalysts onto the FTO glass.Finally, a homogeneous lm was obtained on the FTO glass aer heat treatment at 200 C for 5 h.Photoelectrochemical measurements were conducted on a CHI 660A electrochemical work station (Chenhua Instrument, Inc.) with a three-electrode conguration system consisting of a FTO working electrode, a Pt wire counter electrode and a Ag/AgCl reference electrode.0.2 M Na 2 SO 4 aqueous solution was chosen as the electrolyte.The photocurrent was tested using a 300 W xenon lamp as the light source (light intensity was 300 mW cm A2 , tested by FieldMaxII-TO, Coherent) and a voltage of 0.4 V vs. Ag/AgCl.Electrochemical Impedance Spectroscopy (EIS) was recorded at a potential of A0.4 V vs. Ag/AgCl in the dark. Photocatalytic CO 2 reduction.The CO 2 reduction performance of the GCN and GCN510 photocatalysts was evaluated in an air-tight static reactor by using a Pyrex cell reactor.The reactor with an optical quartz window at the top had a volume of about 500 mL.In a typical process, 30 mg of the photocatalyst was uniformly deposited on a quartzose plate with a xed area of 2.5 cm A 2.5 cm and placed at the bottom centre of the reactor.Then the reactor was ushed with a N 2 ow for 20 min to remove the residual air in the container.Then high-purity CO 2 was bubbled through deionized water to generate a mixture of CO 2 and water vapour into the photoreactor to reach ambient pressure.The dispersed photocatalysts were allowed to equilibrate in the CO 2 and water vapour atmosphere for 30 min.A 300 W xenon lamp (Aulight CEL-HX, Beijing) without any lter was used as the light source, and the light intensity was 300 mW cm A2 (tested by FieldMaxII-TO, Coherent).The carbonaceous gas products were analyzed using a gas chromatograph (GC2060, Fuli Corp., China) with a ame ionization detector (FID).The temperature of the photoreactor was kept at 15 C through cooling water circulation.No co-catalysts or sacricial agents were used. DFT calculation.DFT calculations were performed using the Vienna ab initio simulation package (VASP) 19,20 with the projected-augmented-wave (PAW) method. 21,22The Perdew-Burke-Ernzerhof (PBE) 23 of the Local Density Approximation (LDA) was used as the exchange-correlation functional.The GCN surface was modelled using a two-layer slab, where the upper layer was fully relaxed and the bottom was xed.In surface calculations, the Brillouin zone was sampled using a gamma-centred k-point mesh from the Monkhorst-Pack method.The vacuum region of the slab was 15 A.A CO 2 molecule was placed only on one side of the slab; thus a dipole correction along the z direction was applied to remove spurious contributions arising from the asymmetry.An energy cut-off of 500 eV and a k-point mesh of 3 A 2 A 1 were used to perform geometry optimization.The energy and force convergence criteria were set at 1.0 A 10 A5 eV per atom and A0.03 eV AA1 , respectively. The adsorption energies were calculated using the equation: , where E adsslab is the total energy of the slab with CO 2 , E slab is the energy of the slab, and E gas is the energy of CO 2 in the gas phase."}, {"title": "Results_and_discussion", "content": "As mentioned above, urea derived pristine graphitic carbon nitride is denoted as GCN, whereas the GCN treated at 510 C in an NH 3 atmosphere to introduce C vacancies is labelled as GCN510.Their X-ray diffraction (XRD) patterns are shown in Fig. 1a, and clearly exhibit two typical diffraction peaks at around 12.8 (corresponding to the (100) plane, le inset in Fig. 1a) and 27.8 (related to the (002) plane, right inset in Fig. 1a), 24 reecting the periodic arrangement of an in-plane tris-triazine motif linked by nitrogen and the interlayer stacking of GCN, respectively.No obvious deviation of these two peak positions can be detected between GCN and GCN510, suggesting that GCN510 still retained a similar periodic molecule structure to GCN.It is noted that the intensity of the (002) peak of GCN510 decreases, demonstrating its partially exfoliated layer structure.Meanwhile, the less pronounced (100) peak of GCN510 might be attributed to the slight destruction of the conjugated aromatic rings during the selective etching of C atoms by NH 3 .The Fourier transform infrared (FTIR) spectra of both samples are presented in Fig. 1b.GCN and GCN510 show similar IR absorption features, indicating that GCN510 inherited the basic structure of GCN.The characteristic absorption bands at about 810 cm A1 , 900-1700 cm A1 and 3000-3500 cm A1 originate from the typical stretching and bending vibrations of the tri-s-triazine ring structure, stretching modes of carbon nitride heterocycles, and O-H or N-H of the uncondensed amine groups, respectively. 25Further characterization of the micro-morphology of GCN and GCN510 was carried out by transmission electron microscopy (TEM) (Fig. 2).GCN510 was revealed to have a much thinner and more porous layer structure.Holes can be recognized in GCN510, and this might be ascribed to the loss of C atoms due to NH 3 etching.These holes were generally in the nanometre size range, similar to the results demonstrated in the pore-size distribution in Fig. S2-2. As is illustrated in Fig. S4, if the C atoms in the red circles were etched, the whole triazine heterocycle might be lost, leaving nanometer-scale holes in the GCN layers.Therefore, the loss of atoms in GCN510 resulted in its local structure destruction, which is in consistent with the XRD results. To understand the chemical structure of the photocatalysts and conrm the existence of C vacancies in GCN510, X-ray photoelectron spectroscopy (XPS) was carried out (Fig. 3).Three obvious peaks at about 288, 399 and 532 eV are C 1s, N 1s and O 1s signals, respectively (Fig. 3a).The O 1s peak could be assigned to surface adsorbed CO 2 or H 2 O (Fig. S1 ). 11In Fig. 3b, the high resolution C 1s spectra of both the GCN and GCN510 samples show two peaks centred at 284.6 eV and 287.9 eV.The former peak originates from adventitious carbon species (sp 3 C-C), and the latter one corresponds to sp 2 C bonded with N atoms in the aromatic triazine heterocycles.Note that for the GCN510 sample, the peak at about 287.9 eV shis toward higher binding energy, which reveals the decreased electron density around the C atoms in the heptazine rings resulting from the missing C atoms in this covalently bonded structure. 10The N 1s high resolution spectra of both the GCN and GCN510 samples can be tted into three peaks, which correspond to the CN-C (398.4 eV), N-C 3 (399.8eV) and N-H (400.9 eV) groups, respectively. 11he N-H groups originate from the incomplete condensation of heptazine substructures. 11It is noted that the area fraction of this peak in GCN510 (8.55) is larger than that in GCN (7.56).The additional N-H groups in GCN510 are probably attributed to the C atom loss by NH 3 etching, which broke the covalently bonded CN heterocycles, leaving behind C vacancies and extra amino groups. 17,26Similar to the C 1s spectrum, the N 1s high resolution spectrum of GCN510 also exhibits a well-marked binding energy shi of the peak centred at 398.4 eV toward higher energy.This further conrms the phenomenon of C atom loss which causes the formation of extra N-H in the covalently bonded structure, excluding the condition of N doping in GCN. To further conrm the formation of C vacancies in GCN, electron spin resonance (ESR) spectroscopy has been carried out and the results are displayed in Fig. 3d.It is known that in ideal at p-conjugated GCN, there should be no paramagnetic centres to generate ESR signals.However, from the ESR spectra, we can see that the pristine GCN shows a very strong ESR signal.This is usually ascribed to the local stress and bond-angle disorder in the connective structure.And the unpaired electrons are usually considered to originate from C atom sites according to several previous reports on the paramagnetic centre description in carbon nitride materials. 27,28For the GCN510 sample, the intensity of this ESR signal decreases, which can be reasonably attributed to the fewer unpaired electrons caused by the C atom loss.This further veries the formation of C vacancies in GCN by NH 3 treatment. The photocatalytic CO 2 reduction activities of the photocatalysts were evaluated in an airtight static reactor system.Details have been described above.Controlled experiments were also carried out, suggesting that without any one of the conditions including CO 2 with H 2 O vapour, photocatalysts or light irradiation, no carbon containing products could be detected in the rst hour.Thus, the carbon containing products are veried to be derived from CO 2 photocatalytic reduction rather than from the residual carbon or carbon contaminations in the catalysts (Fig. 4a).CO is the only carbonaceous product that can be detected by our GC during the whole reaction process on both photocatalysts (Fig. 4b).The CO evolution rate on GCN510 is about 4.18 mmol g A1 h A1 , nearly 3.3 times that on GCN (z1.28 mmol g A1 h A1 ) in the rst hour.And the photocatalytic performance under UV-cut light (l 420 nm) illumination is shown in Fig. S3. The increase of the CO evolution rate between GCN510 and GCN is not as much as that under full spectrum light illumination.This might be consistent with the light absorption property of GCN510 whose absorption edge blue-shis.Further, to make sure that the enhanced photocatalytic CO 2 reduction performance of GCN510 is not mainly achieved by its enlarged surface area (Fig. S2-1 ), we prepared a sample, denoted as GCN-BET, by a heat treatment process in a muffle furnace using the pristine GCN (the BET surface area of pristine GCN is 74.90 m 2 g A1 ).Some structure characterization results of GCN-BET are shown in Fig. S6 and S7, which demonstrate that GCN-BET's basic structure changes a little, compared with that of GCN.However, the GCN-BET sample has a higher BET surface area (155.16m 2 g A1 ) than GCN510 (135.66 m 2 g A1 ) but shows a much lower CO evolution rate (2.04 mmol g A1 h A1 ) than GCN510 (Fig. 4b).This is similar to the work of Schlenker et al., 29 in which they concluded that though exfoliated GCN had a higher surface area and exposed more active sites, it could not sustain the generation of sufficient photoinduced charge carriers, and thus showed low photocatalytic performance.Based on the above results, we can reasonably conclude that the incorporated C vacancies do play an essential role in promoting the CO 2 reduction performance of GCN510. To gure out the effects of C vacancies on GCN and their roles in the CO 2 photocatalytic reduction reaction, we tried to compare the CO 2 adsorption/activation, light-harvesting, and charge separation and transfer abilities of the pristine GCN catalysts and GCN catalysts incorporated with carbon vacancies.First, we know that the satisfactory adsorption/activation ability of CO 2 on the photocatalyst is one of the vital factors to achieve high CO 2 conversion performance.However, on pristine GCN, there are not enough active sites for CO 2 adsorption/activation.As depicted in Fig. 5, the CO 2 temperature-programmed desorption (CO 2 -TPD) results show only one peak centred at around 80 C for the GCN sample, while two peaks centred at 85 and 330 C for the GCN510.The peak at the lower desorption temperature reects the CO 2 physical adsorption, whose desorption temperature is slightly higher on GCN510 than on GCN.The other desorption peak of GCN510 centred at 330 C can be assigned to CO 2 chemisorption, 30 which might be caused by the improved basic sites originating from the increased N-H groups in GCN incorporated with carbon vacancies.And this is already veried by the above XPS characterization.In addition, DFT calculations were carried out to analyse the adsorption energies of CO 2 molecules on GCN and carbon-vacancy modi-ed GCN.As shown in Fig. S5 and Table 1, two stable adsorption congurations were obtained aer optimizing the initial structures.The calculation results suggest that GCN with C vacancies shows higher CO 2 adsorption energy (E ads 14 A0.463 eV) than pristine GCN (E ads 14 A0.183 eV).This is in accordance with the CO 2 -TPD results.Furthermore, the initial CO bond length of a CO 2 molecule is 1.169 A. Aer optimization, the CO bond of a CO 2 molecule adsorbed on the surface of GCN with C vacancies is lengthened to 1.177 A, while that on the GCN surface is only 1.170 A.Therefore, we can safely deduce that GCN with C vacancies (GCN510) exhibits relatively stronger CO 2 affinity and activation ability than pristine GCN, which is an essential prerequisite for the improvement of the performance of GCN510 for CO 2 photocatalytic reduction. The light absorption properties of GCN and GCN510 were investigated by UV-Vis diffuse reectance spectroscopy (DRS) (Fig. 6a).The intrinsic absorption edge of GCN510 slightly blue-shis and the visible light absorption is enhanced compared with that for GCN, which is in consistent with the previously Fig. 5 The CO 2 -TPD curves of the GCN and GCN510 samples.reported GCN with C vacancies. 18,26Meanwhile, Tauc plots were acquired from the DRS data using the Kubelka-Munk function, and the bandgaps of GCN and GCN510 are determined to be 2.57 eV and 2.79 eV, respectively (Fig. 6b).Together with the results from the XPS valence band spectra (Fig. 6c), their schematic energy band positions were calculated and displayed in Fig. 6d.Some important reaction potentials with reference to the reversible hydrogen electrode (RHE) are also labelled in Fig. 6d.We can see that the widened band gap of GCN510 is caused by a very slight alternation of the valence band (VB) position and a relatively large up-shi of the conduction band (CB).Hence, a higher driving force for CO 2 conversion on GCN510 can be achieved by the higher reduction potential of the exited electrons on the CB of GCN510.This is another key factor that ensures the improved performance of CO 2 photoreduction on GCN510.Photoluminescence (PL) spectra are effective in demonstrating the separation and recombination of charge carriers in semiconductors.In Fig. 7a, a blue shi of the PL emission peak of GCN510 can be observed, which is consistent with its widened band gap.Besides, the PL intensity of GCN510 is higher than that of GCN.Here it is reasonable to point out that this is not directly ascribed to the high recombination rates of photoinduced electrons and holes, but is probably due to the much improved concentration of charge carriers in GCN510 with C vacancies.This is also in good agreement with the onand-off photocurrent responses of GCN and GCN510 presented in Fig. 7b.GCN510 exhibits a strengthened photoresponse compared to GCN, suggesting that the introduction of C vacancies could boost the photoinduced charge carrier generation. To acquire a deeper understanding of the origin of the improved charge carrier concentration in GCN with C vacancies, the ESR experiment was conducted again to detect the type of reactive oxygen species (ROS), including singlet oxygen ( 1 O 2 ) and superoxide radicals (O 2 c A ), to explore the state of charge carrier and exciton in GCN and GCN510 during light illumination.As known, excitons are formed by strong Coulomb interactions between photoinduced electrons and holes, while charge carriers are generated by separated electrons and holes located at the CB and VB.It is also acknowledged that the identication of ROS is a commonly accepted method to evaluate the generation of excitons or charge carriers in photocatalysts under illumination. 31,32Specically, 1 O 2 is produced through the energy transfer from excitons to O 2 molecules at the ground state, while O 2 c A is generated through reactions involving photoinduced charge carriers.To identify these two ROS species, 5,5-dimethyl-1-pyrroline-N-oxide (DMPO) and 2,2,6,6-tetramethylpiperidine (TEMP) were selected to act as trapping agents for O 2 c A and 1 O 2 , respectively.As displayed in Fig. 7c, the ESR signal of DMPO-OOH, derived from DMPO-O 2 c A , is much stronger on GCN510 than on GCN, indicating the enhanced O 2 c A generation (i.e.charge carrier generation) in GCN510.In Fig. 7d, a typical 1 : 1 : 1 triplet signal is displayed, consistent with that of 2,2,6,6-tetramethylpiperidine-N-oxyl (TEMPO) derived from 1 O 2 .The GCN510 photocatalyst shows a much weaker TEMPO EPR signal than GCN, indicating a signicant suppression of 1 O 2 generation (i.e.exciton generation) in GCN510.Summing up the EPR results of the ROS tests, in pristine GCN, the detection of negligible O 2 c A but larger amount of 1 O 2 implies that a conspicuous exciton effect exists but a low amount of photoinduced charge carriers are generated; in contrast, in carbon-vacancy modied GCN, a higher amount of O 2 c A but diminished 1 O 2 suggests an obviously suppressed exciton-effect and promoted charge carrier generation.These intriguing experimental results give us an inspiring method for dissociating excitons into charge carriers by introducing C vacancies in GCN, which will benet charge-carrierinvolved photocatalytic reactions, like CO 2 photoreduction in this work. Electrochemical impedance spectroscopy (EIS) was performed to evaluate the charge transport property of the photocatalysts (Fig. 7e).GCN510 exhibits a smaller diameter of the semicircular Nyquist curve, implying lowered charge transfer resistance and improved charge carrier separation efficiency in GCN510.In addition, time-resolved uorescence spectra were collected and determined by a double-exponential tting (Fig. 7f) to study the PL decay of the charge carriers.The inset table in Fig. 7f summarizes the carrier lifetime in GCN and GCN510.It can be found that the average lifetimes of charge carriers in GCN and GCN510 are 42.91 ns and 55.72 ns, respectively.The shorter lifetime of PL decay in GCN might be related to the promoted nonradioactive intersystem crossing process, forming more singlet excitons which are further converted into triplet excitons; 33 however, the lifetime of PL decay is longer in GCN510, possibly due to the enhanced exciton dissociation and the subsequently improved charge carrier concentration in the presence of C vacancies."}, {"title": "Conclusions", "content": "In summary, graphitic carbon nitride with C vacancies has been developed by the heat treatment of GCN in an NH 3 ow and its photocatalytic activity in CO 2 reduction has been investigated.The introduction of C vacancies in GCN enhances the CO 2 -to-CO photocatalytic conversion performance, with a CO evolution rate of 4.18 mmol g A1 h A1 , which is 2.3 times higher than that of pristine GCN in the absence of any co-catalyst or sacri-cial agent.The presence of C-vacancy sites promotes the CO 2 molecule adsorption/activation on GCN.Moreover, aer the introduction of C vacancies in GCN, its conduction band level upshied, endowing the photocatalyst with an elevated reduction potential, i.e., enhanced reductive ability.More intriguingly, an attenuated exciton-effect and improved charge carrier generation have been discovered in GCN with C vacancies, resulting in improved charge carrier concentration.This work not only sheds light on the comprehensive understanding of the effects of C vacancies on GCN and the important roles of C vacancies in the CO 2 photoreduction reaction, but also provides a novel way of defect engineering (i.e.C vacancy introduction) to attenuate exciton generation and favour charge-carrier involved photocatalytic reactions. Scheme 1 Schematic illustration of the promoted CO 2 photoreduction activity on carbon-vacancy modified GCN. Fig. 1 (a) XRD patterns and (b) FTIR spectra of the pristine graphitic carbon nitride (GCN) and carbon-vacancy modified GCN (GCN510). Fig. 2 TEM images of samples (a) and (b) GCN, and (c) and (d) GCN510. Fig. 3 (a) XPS survey spectra; high resolution XPS (b) C 1s, (c) N 1s, and (d) ESR spectra of the GCN and GCN510 samples. Fig. 4 (a) CO evolution on the GCN and GCN510 photocatalysts over 5 h.The twice-repeated experiments were performed independently (n 14 2); data are mean AE s.d.(b) CO evolution rate in the first hour on GCN, GCN-BET, and GCN510. Fig. 6 (a) UV-Vis diffuse reflectance spectra, (b) plots of (ahn) 1/2 versus photon energy, (c) XPS valence band spectra and (d) band alignments of GCN and GCN510 versus the reverse hydrogen electrode (RHE) (VB: valence band; CB: conduction band). Fig. 7 (a) Photoluminescence (PL) spectra, (b) transient photocurrent response, ESR spectra (the spectra of control tests have been deducted) in the presence of (c) DMPO and (d) TEMP, (e) electrochemical impedance spectra (EIS), and (f) time resolved PL spectra of GCN and GCN510. We acknowledge the nancial support from the National Natural Science Foundation of China (51872317, 21835007). There are no conicts to declare."}]