[{"title": "Doi", "content": "10.1016/j.jcis.2010.12.034"}, {"title": "Article_Title", "content": "Photocatalytic reduction of CO2 in methanol to methyl formate over CuO–TiO2 composite catalysts"}, {"title": "Abstract", "content": "Photocatalytic reduction of CO 2 on CuO-TiO 2 composite catalysts in the presence of methanol to prepare methyl formate had been investigated.Methanol was used as sacrificial reagent to react with the photogenerated holes in the valence band, and CO 2 was reduced by the electrons in the conduction band.CuO-TiO 2 was optimized for CuO loading, preparation method and calcination temperature.The catalyst of 1.0CuO-TiO 2 , calcined at 450 C and CTAB as a dispersant showed the highest overall activity.The heterojunction between CuO and TiO 2 demonstrated with HRTEM played an important role in enhancing the photocatalytic activity."}, {"title": "Experimental", "content": "All the reagents were of analytical purity and purchased from Tianjin Benchmark Chemical Reagent Company.TBOT (tetrabutyl titanate) and CTAB were dissolved in absolute ethanol by sonicating for 15 min and followed by stirring for 15 min respectively.The two solutions were mixed under stirring for 30 min to form a transparent solution.Cu(NO 3 ) 2 5H 2 O was dissolved under stirring in absolute ethanol, then the solution of Cu(NO 3 ) 2 was added dropwise to the TBOT CTAB solution.After stirring for 30 min, the mixture was aged at room temperature for 12 h, then dried at 100 C overnight.To remove organics, the as-synthesized sample was calcined by temperature program increase of 2 C/min from room temperature to 450 C and kept for 6 h.The molar ratio of TBOT Cu(NO 3 ) 2 : CTAB was 1:0.12.The catalysts were assignated as xCuO-TiO 2 , where ''x'' represented the weight percentage of CuO in the catalyst.For comparison, the CuO-TiO 2 samples were also prepared in the above method without adding CTAB or calcinated at different temperatures. The catalysts were investigated by X-ray diffraction (XRD, Bruke/D8-Advance, Cu Ka) at a scan rate of 0.02s A1 .The operation voltage and current were maintained at 40 kV and 40 mA, and the particle size was estimated using the Scherrer equation.The microstructures were observed by a high-resolution transmission electron microscopy (HRTEM: Tecnai G2 F20; accelerating voltage, 200 kV).Light absorbance was measured by UV-vis diffuse reflectance spectroscopy (Shimadzu UV-2550) in wavelength of 190-800 nm by using BaSO 4 as a reference. The photocatalytic reduction of CO 2 under UV light was carried out in a slurry reactor system (Fig. 1).A flat top cover of the vessel was made of Pyrex.The reactor vessel was irradiated, from top of the reactor, by a 250 W high pressure mercury lamp with the radiation peak at about 365 nm.The reaction temperature was 25 3 C controlled by thermostatic waterbath.Reaction suspension was prepared by using 30 ml of methanol solution and 30 mg of catalyst powders.The reactor was tightly closed during the reaction and a magnetic stirrer agitated the suspension at the bottom to prevent sedimentation of the catalyst.CO 2 (99.99 purity) was bubbled through the reactor at a rate of 100 ml/min for 30 min to purge air and saturate the suspension.The products were qualified by GC-MS (Agilent 5975C) and quantified by GC-FID equipped with HJ.10 capillary column.The activities of different catalysts were compared by the average formation rate of methyl formate (MF) in a period of 6 h.The blank tests consisted of a reaction under light without the catalysts and a reaction in the dark with the catalysts, and there were no products formed."}, {"title": "Results_and_discussion", "content": "As shown in Fig. 2, both position and shape of the diffractive peaks of 1.0CuO-TiO 2 were quite similar to pure anatase TiO 2 , which indicated that loading small amount of CuO almost did not change the crystalline phase of TiO 2 .The diffraction peak of crystal plane 1 0 1 was selected to estimate the crystallite size of the sample by the Debye-Scherrer equation.The mean particle size was nearly 13.8 nm.CuO was not found due to a bit of CuO loading and perfect dispersion. The 1.0CuO-TiO 2 catalyst was also characterized with TEM and HRTEM to investigate the interfacial structures between CuO and TiO 2 .In Fig. 3a, the morphology of particles was uniform and the diameter was about 14 nm, which was consistent with the calculation from XRD pattern.In Fig. 3b the lattice fringes of CuO and TiO 2 clearly showed the surface-phase junction of the composite catalyst.The 1 1 0 lattice fringe of monoclinic CuO was 0.275 nm, and the 1 0 1 lattice fringe of anatase was 0.35 nm 13,14.The formation of the surface-junction could promote the interparticle charge migration and facilitate the photo-generated electron transfer from conduction band of the TiO 2 to the valence band of CuO (Fig. 8), thereby improving the charge separation efficiency and enhancing the photocatalytic activity. In Fig. 4, UV-vis DRS spectra revealed that TiO 2 displayed no significant absorbance for visible light due to the large energy gap of TiO 2 (3.2 eV).The CuO-TiO 2 showed spectral response in the visible region (k 400-800 nm), and the absorption intensity increased with the increase in the amount of CuO loading in the visible region.In theory, when the absorption intensity increases, the formation rate of electron-hole pairs on the photocatalyst surface also increases, resulting in the photocatalyst exhibiting higher photocatalytic activity. Fig. 5 showed the activities of various catalysts during photocatalytic reduction of CO 2 under irradiation.The catalysts were formed using CTAB as the dispersant and calcined at 450 C.Modification of TiO 2 with CuO loading resulted in abrupt increase of the photocatalytic activity because CuO and TiO 2 formed composite catalysts and the recombination of photo-generated electron and hole was restrained.However, higher CuO content (CuO weight percentage 1.0)was harmful for the activity because of the agglomeration of the CuO particles 15.It was also seen that the photocatalytic activity was strongly dependent on the amount of CuO loading.The photocatalytic activity increased with the increase in the amount of CuO loading up to 1.0.When the amount was higher than 1.0, the photocatalytic activity decreased.From Figs. 4 and5, we could see that there is no evident relationship between the photocatalytic activity of CuO-TiO 2 and the absorption intensity.Namely, the high absorption intensity did not increase photocatalytic activity in the experimental condition. From Fig. 6, the CuO-TiO 2 obtained via CTAB exhibited higher activities than the CuO-TiO 2 obtained without CTAB.Since each pair of catalysts exhibited nearly the same crystallinity of anatase at the same calcination temperature, the higher activities of CuO-TiO 2 via CTAB could be attributed to their suitable particle size.The crystallite size plays an important role in nanocrystalline TiO 2 based photocatalysts.Koci et al. prepared pure TiO 2 anatase particles with a crystallite diameters ranging from 4.5 to 29 nm, and the optimum particle size corresponding to the highest yields of products was 14 nm.From Figs. 2 and3, the mean size of the particle was 14 nm, which was close to the optimum size, and the high photocatalytic activity was owing to competing effects of specific surface area, charge-carrier dynamics and light absorption efficiency 3. Considering the effect of calcination temperature, one could see from Fig. 7 that the 1.0CuO-TiO 2 calcined at 450 C exhibited higher activity than that calcined at 350 C and 550 C.The catalysts were made with CTAB as a dispersant.An important reason was that the 1.0CuO-TiO 2 calcined at 450 C had better crystallization degree than that calcined at 350 C 16.The high crystallinity of anatase facilitated the rapid transfer of photoelectrons from bulk to the surface, and this could effectively inhibit the recombination between photoelectrons and holes, so the quantum efficiency was enhanced 17.However, calcination of 1.0CuO-TiO 2 at high temperature (550 C) caused an abrupt decrease in activity because of the sintering of the catalyst. Fujishima et al. studied electrochemical reduction of CO 2 with high current density in CO 2 -methanol medium with changing the pressure of the system from 1 to 60 atm, and CO 2 was reduced to CO, CH 4 , C 2 H 4 , and methyl formate at a Cu electrode 18,19.Ulagappan et al. studied the photoreduction of gaseous CO 2 in Ti silicalite molecular sieve using methanol as electron donor and the initial products were monitored by in situ FT-IR spectroscopy, where HCOOH, CO, and HCOOCH 3 were the observed products 20.In Fig. 8, CO 2 can be reduced to formic acid and formaldehyde during the photocatalytic reaction.The potential of conduction band of CuO (E cb A0.78V) is more negative than those of formic acid and formaldehyde yield, and the potential of valence band of TiO 2 was more positive than those of methanol oxidation 212223.The potential of methanol oxidation by a hole to ACH 2 OH is E 0 CH 3 OHCH 2 OH 0.927 V 24,25.Methyl formate can be produced through the esterification of formic acid and methanol and dimerization of formaldehyde via Tishchenko reaction 26.In a comparison experiment, 1.0CuO-TiO 2 was used to investigate the effect of CO 2 .In the presence of CO 2 , MF formation rate was 1602 lmol/g/h, while in the presence of N 2 , MF formation rate was 638 lmol/g/h. If CO 2 was substituted for N 2 , methanol was dehydrogenated to ACH 2 OHand HCHO in the VB and the produced H was reduced to H 2 in the CB.MF was formed through dimerization of formaldehyde but the amount was less than in the presence of CO 2 .This suggested that CO 2 was photocatalytic reduced to HCOOH and HCHO and made a main contribution to the formation of MF. As one of the effective methods for photo-generated electronhole separation, semiconductor combination is of increasing interest.The method constructs a heterojunction interface between the semiconductors with matching band potentials.Some excited electrons in TiO 2 with a lower CB could recombine with the holes in CuO with a VB close to the CB of TiO 2 (Fig. 8).More powerful excited electrons and holes can be retained on different counterparts.The most obvious merit of these two mechanisms lies in the fact that stronger oxidative holes and reductive electrons can be isolated on TiO 2 and CuO, followed by directly quenching the weaker oxidative holes and reductive electrons in the solid heterostructure intrinsic interfaces. For efficient carrier separation across the CuO and TiO 2 heterojunction, the CuO should be uniformly distributed and in close/direct contact with the TiO 2 nanoparticles.Fig. 3b showed the HRTEM image of CuO-TiO 2 and demonstrated the heterostructure.In a reference experiment, a mixture of CuO and TiO 2 by mixing with the same ratio as that in the 1.0CuO-TiO 2 heterostructure demonstrated the similar photocatalytic activity as pure TiO 2 ."}, {"title": "Conclusions", "content": "The photocatalytic reduction of CO 2 could be enhanced by CuO-TiO 2 composite catalysts by using methanol as sacrificial reagent, and methyl formate was produced.The optimal catalyst was 1.0 wt CuO loading on TiO 2 , CTAB as dispersant, and calcined at 450 C.The heterojunction between CuO and TiO 2 was found for improving photocatalytic reduction rate of CO 2 .The reaction mechanism was also explained by the conventional band theory of charge transfer at the semiconductor materials. Fig. 1.The scheme of the photocatalytic reaction system: (1) CO 2 steel cylinder, (2) steady flow valve, (3) flowmeter, (4) CO 2 inlet valve, (5) reactor cell, (6) Hg lamp, (7) CO 2 outlet valve, (8) magnetic stirrer, (9) circulating pump, (10) thermostatic waterbath. Fig. 2. XRD pattern of 1.0CuO-TiO 2 (CTAB, 450 C). Fig. 4. UV-vis DRS spectra of CuO-TiO 2 (CTAB, 450 C). Fig. 3. TEM (a) and HRTEM (b) image of 1.0CuO-TiO 2 (CTAB, 450 C). Fig. 7.The effect of calcination temperature on MF formation rate. We gratefully acknowledge financial support by the National Natural Science Foundation of China (NSFC) 20876109 and 21046006."}]