[{"title": "Doi", "content": "10.1016/j.jcou.2018.02.006"}, {"title": "Article_Title", "content": "Enhanced CO2 photocatalytic reduction through simultaneously accelerated H2 evolution and CO2 hydrogenation in a twin photoreactor"}, {"title": "Abstract", "content": "The photocatalytic reduction of CO 2 utilizes solar energy to mitigate CO 2 emissions and is a promising technology for renewable fuel production.In this study, a novel twin reactor was developed to hydrogenate CO 2 into hydrocarbons by using H 2 directly produced from photocatalytic water splitting.The twin reactor was further modified to simultaneously perform the CO 2 hydrogenation and water splitting reactions in the gas and liquid phases, respectively.Moreover, two photocatalysts, Pt/TiO 2 and Cu/TiO 2 , were used to improve the photohydrogenation performance in the reactor.The results indicate that the H 2 produced from water splitting effectively enhanced the CO 2 hydrogenation in the gas phase, and we found that the highest CO 2 reduction activity was achieved by using Pt/TiO 2 and Cu/TiO 2 as the H 2 -generating and CO 2 hydrogenation photocatalysts, respectively, which promoted H 2 evolution and CO 2 hydrogenation and resulted in enhanced CO 2 photoreduction."}, {"title": "Experimental", "content": "TiO 2 (P25) and WO 3 (99.9)were commercial products purchased from Degussa and Hayashi Pure Chemical, respectively.The metal species (Pt or Cu) were loaded on the P25 and WO 3 through the reduction of aqueous NaBH 4 using a method similar to that reported by Nie et al. 23.In a typical preparation process, 1 g TiO 2 was added into 100 mL of a H 2 PtCl 6 methanol solution under magnetic stirring for 1 h.Then, 2.5 mL of an aqueous solution of mixed NaBH 4 (0.1 mol/L) and NaOH (0.5 mol/L) were dropped slowly into the suspension under vigorous stirring.After stirring for 0.5 h, the solid samples were collected by centrifugation, then washed with deionized water three times, and finally dried overnight in an oven at 60 C.Similarly, Cu/TiO 2 was prepared using Cu(CH 3 COO) 2 as a metal precursor, and Pt/WO 3 was synthesized by a similar route using WO 3 instead of TiO 2 . The X-ray diffraction (XRD) patterns of the prepared Pt/TiO 2 and Cu/TiO 2 were identified on a PANalytical X'Pert PRO diffractometer using Cu K radiation ( 0.1542 nm) at a scan rate of 1min -1 .The specific surface area of the prepared samples was estimated by N 2 adsorption-desorption isotherms at 77 K using a Micrometrics ASAP 2020 surface area and porosity analyzer.The surface morphology of the catalysts was investigated using a field-emission scanning electron microscope (FE-SEM, FEI Nova NanoSEM 450).X-ray photoelectron spectroscopy (XPS) measurements were conducted on a Shimadzu/ KRATOS AXIS-ULTRA DLD-600 W equipped with Al/Mg K radiation.The UV-vis absorption spectra of the catalysts were obtained with a UV-vis spectrophotometer (Perkin Elmer, Lambda 950).The photoluminescence (PL) spectra of the catalysts were recorded at room temperature on a confocal laser Raman microscope (Horiba JobinYvon, LabRAM HR800).A 325-nm He-Cd laser source was used to excite the material in the PL test. The photocatalytic hydrogenation of CO 2 was carried out in a modified twin reactor (as shown in Fig. 1).Details of the reactor have been described elsewhere in the cited literature 11,17.First, 200 mL of a 2 mM Fe 2 (SO 4 ) 3 and a 2 mM FeSO 4 solution were adjusted to a pH of 2.6 by adding concentrated H 2 SO 4 , and then placed in the O 2 -generation and CO 2 -hydrogenation sides, respectively.A Nafion membrane (Nafion 117) was used to divide and connect the two compartments.Pt/WO 3 (300 mg) was dispersed in the Fe 2 (SO 4 ) 3 solution as an O 2 -photocatalyst.Metal (Pt or Cu)-loaded TiO 2 (20 mg) was suspended in the FeSO 4 solution as a H 2 -photocatalyst and spread on an elevated rectangular quartz plate (6 cm 2 ) in the gaseous phase as a CO 2 -photocatalyst.The aqueous phase of both sides was under agitation during the reaction.Prior to irradiation, ultra-pure Ar (99.9995) and CO 2 (99.9992) were bubbled into the solutions of O 2 -generation and CO 2hydrogenation compartments, respectively.Two 300 W xenon lamps (Newport, Model 66902) with AM 1.5G filters installed were placed on the side of the reactors and utilized as the light source in this study.The measured light irradiance was approximately 90 mW/cm 2 , and the irradiation time was 4 h. The gas samples were taken at 1 h intervals using a 1 mL gas-tight syringe.The oxygen, nitrogen, and hydrogen were analyzed by a gas chromatograph equipped with a thermal conductivity detector (TCD) and a Molecular Sieve 5A column.The CO and hydrocarbons were analyzed by another gas chromatograph equipped with a flame ionization detector (FID), a methanizer, and a Porapak QS packed column. The photocatalytic H 2 production and CO 2 hydrogenation with H 2 was also performed in a batch cylindrical reactor (internal volume: 275 mL, Fig. 2), which was illuminated by a 9 W Hg lamp ( 254 nm, UVP, Pen-Ray 11SC-1) located in the center of a quartz tube.In the case of the hydrogen evolution (Fig. 2A), 20 mg of the catalyst was suspended in deionized water (100 mL) under magnetic stirring.Prior to irradiation, the solution was pre-purged by ultra-pure Ar for 30 min to expel the air from the reactor. In the case of CO 2 reduction with H 2 and water, the catalyst was placed in a 25-mL beaker and set at the bottom of the reactor (Fig. 2B).H 2 was injected into the reactor by using a syringe, and the concentration of H 2 was analyzed by GC-TCD to ensure that 1 vol. of H 2 was in the reactor.Deionized water (5 mL) was added in the region between the beaker and the reactor.The analytical method was the same as that used in the twin reactor.No water was added in the reactor in the case of CO 2 reduction with H 2 in the absence of water,"}, {"title": "Results_and_discussion", "content": "XRD was used to investigate the crystalline structure of the as-prepared catalysts.As illustrated in Fig. 3, all the peaks of the Cu/TiO 2 and Pt/TiO 2 catalysts are assigned to the anatase (JCPDS, No. 21-1272) and rutile TiO 2 phases of P25.For Pt/WO 3 , the XRD pattern was similar to that of the orthorhombic WO 3 phase (JCPDS, No. .No peaks corresponding to Pt can be observed in the XRD patterns of all samples due to the low loading content and the fine dispersion of Pt on the supported surface 17,23. N 2 adsorption-desorption was applied to explore the textual properties of the prepared catalysts.The specific surface area, S BET , was calculated based on the classical Brunauer-Emmett-Teller (BET) theory and are summarized in Table 1.We observed that the loading of Pt and Cu had no significant influence on the surface area of P25, indicating that P25 is stable during the reduction process in an aqueous solution of NaBH 4 . Fig. 4 shows the FE-SEM images of the P25, Cu/TiO 2 and Pt/TiO 2 catalysts.The TiO 2 particles of all samples were uniformly distributed, and the average particle size was approximately 25 nm.This indicates that the metal loading has no obvious influence on the particle size of TiO 2 .In all images, no metal or metal oxide particles were observed, which was attributed to the high dispersion or low loading content of the metallic species. XPS was conducted to analyze the chemical states of the Pt and Cu loaded on TiO 2 .As shown in Fig. 5A, the Pt 4f region can be resolved into two pairs of XPS peaks.The peaks at 70.5 and 74.1 eV are ascribed to Pt metal, while those at 71.4 and 75.6 eV are attributed to Pt(II) oxides 22,24, which may be cause by the oxidation of the Pt nanoparticles 25,26.Fig. 5B shows the Cu 2p XPS spectrum of Cu/TiO 2 catalyst.There were four peaks in the Cu 2p region, which were located at 932.7, 935.8, 952.4,and 955.5 eV.The two peaks with the low binding energies correspond to the Cu 2p 3/2 and Cu 2p 1/2 peaks of Cu(I) 27.The others with the high binding energies are ascribed to the peaks of Cu(II) 28,29.Since no shake-up satellite peak was observed, these Cu species are considered to be Cu 2 O and CuO 30.The ratio of Cu(I)/Cu(II) was calculated to be 1.38, indicating that Cu 2 O was more dominant on the surface of P25. Fluorescence of a semiconductor is caused by the recombination of photogenerated electron-hole pairs.The PL spectra of the catalysts are exhibited in Fig. 6.The PL intensities of Cu/TiO 2 and Pt/TiO 2 were much lower than that of P25, indicating that the recombination of electron-hole pairs in TiO 2 were effectively suppressed by the loaded metal.Based on the literature 28,31, the Pt and Cu species can function as electron traps to prevent the recombination of photogenerated charges.In addition, Pt/TiO 2 had a low PL intensity than Cu/ TiO 2 , which demonstrates the stronger electron capture capacity of Pt.Fig. 7 shows the UV-vis absorption spectra of the catalysts.The strong UV absorption ( 400 nm) was ascribed to the band gap absorption of TiO 2 (3.2 eV) 31.The light absorption of Cu/TiO 2 shifted to the visible light region compared to that of P25, resulting from the lower band gap of Cu 2 O (2.1 eV) 32, which responds to visible light.Unlike P25 and Cu/TiO 2 , the UV-vis spectrum of Pt/TiO 2 exhibits a significant background in the visible light region due to Pt inter-band transitions from Pt 5d to 6 s and within the 6 sp band 33, which is a characteristic optical property of Pt/TiO 2 composite materials 34,35. The H 2 production from the Cu/TiO 2 and Pt/TiO 2 photocatalysts is illustrated in Fig. 8 and Table 2.The H 2 productivity of P25 was comparably low, while the loading of either Cu or Pt enhanced the evolution of H 2 .The significant difference in the photocatalytic activity was not caused by the effect of surface areas because the values of three catalysts were almost identical.A more persuasive explanation is that the Pt and Cu species on the surface of TiO 2 suppress the recombination of the photogenerated electron-hole pairs 33,36,37.Since the work function of Pt is larger than that of TiO 2 31, the excited electrons in the conduction band (CB) of TiO 2 tend to transfer to the Pt nanoparticles, resulting in the effective separation of the excited charges.For Cu/TiO 2 , the XPS results show that Cu existed in two forms, namely, Cu 2 O and CuO.Based on the reported literature 37,38, both CuO and Cu 2 O can also capture excited electrons, hindering electron-hole pair recombination.It is notable that the enhancement of the H 2 yield was much more significant in the case of Pt/TiO 2 , which was in good agreement with the results shown in the references 38,39.This suggests that Pt/TiO 2 is a better H 2 -photocatalyst than Cu/TiO 2 .In addition, the H 2 production increased first and then decreased after reaching a maximum value for both the Pt/TiO 2 and Cu/TiO 2 catalysts, which may be attributed to the reverses reaction between H 2 and O 2 . To understand the roles of H 2 and water in the photocatalytic reduction of CO 2 , photocatalytic CO 2 hydrogenation with H 2 in the absence/presence of H 2 O were performed over Cu/TiO 2 and Pt/TiO 2 catalysts in the single reactor.Fig. 9 and Table 2 show the production of CO and CH 4 from CO 2 hydrogenation with H 2 in the absence/presence of H 2 O.The yield of the products varied markedly with the co-catalysts and reductant species used.In the absence of water, the CO yield of the Cu/TiO 2 and Pt/TiO 2 catalysts was 1206.5 and 843.4 mol g -1 , respectively, after 4 h of irradiation.This indicates that the loaded Cu was more effective towards the reduction of CO 2 to CO with H 2 .Compared to the CO yield, the CH 4 yield of both catalysts were very low (Cu/TiO 2 : 0.05 mol g -1 ; Pt/TiO 2 : 1.39 mol g -1 ), revealing that the H 2 could reduce CO 2 to CO easily but could not easily hydrogenate CO to form CH 4 under low humidity. In the case of CO 2 hydrogenation with H 2 and H 2 O, the CO yields of both the Cu/TiO 2 and Pt/TiO 2 catalysts decreased while the CH 4 yield was remarkably enhanced compared with those in the absence of water.This indicates that the presence of water promotes the conversion of CO to CH 4 .In addition, the CH 4 yield of Pt/TiO 2 was three times higher than that of Cu/TiO 2 , which indicates a higher activity of Pt/TiO 2 for the conversion of CO to CH 4 . The possible reaction mechanism of the CO 2 photoreduction with H 2 and water has been proposed in various papers 404142.In general, the electrons are excited to the CB of TiO 2 , and the holes remain in the valence band (VB) when TiO 2 is under UV light irradiation.CO 2 can react with the photogenerated electrons to form CO 2 -radicals, and H 2 O/H 2 will be oxidized to O 2 and H .Subsequently, the CO 2 -radicals react with electrons and H to produce hydrocarbons.As we know, two protons and electrons are required to reduce one CO 2 molecule to form CO, and six protons and electrons are required for the hydrogenation of CO to form CH 4 .Thus, CH 4 formation is more preferable if sufficient protons and electrons are provided 25.In the case of CO 2 hydrogenation with H 2 , H can only originate from the oxidation of H 2 by photogenerated holes, which may not provide enough hydrogen for the hydrogenation of CO to form CH 4 .After the introduction of water in the reaction, the dissociation of water can efficiently supply more H , which might be responsible for the enhanced production of CH 4 . To investigate the effects of the H 2 production and CO 2 hydrogenation on the overall CO 2 photocatalytic reduction, the Cu/TiO 2 and Pt/TiO 2 catalysts were placed in a twin reactor, and seven cases were thoroughly studied as follows: The surface area, pore volume, and pore size of as-prepared samples. BET surface area/m 2 g -1 Pore volume/cm (l) without the CO 2 -photocatalyst.The \"g\" denotes the catalyst being placed in the gas phase (on the elevated quartz plate), while \"l\" represents suspension of the catalyst in the liquid phase (FeSO 4 solution).H 2 , CO and CH 4 were the main products in the gas phase, and no other hydrocarbons were detected.Fig. 10 and Table 3 show the yield of H 2 , CH 4 and CO after 4 h of light irradiation.When the Cu/TiO 2 and/ or Pt/TiO 2 catalysts were dispersed in the liquid phase in the absence of the CO 2 photocatalysts (Case 1, 6, and 7), the CO 2 reduction efficiencies were very low compared with those of the other cases.This is because the surface of the catalyst in the solution was mainly covered by water rather than CO 2 due to the considerably low solubility of CO 2 in the acidic solution 43.The higher H 2 production in case 6 than that in case 7 indicates that Pt/ TiO 2 was a more efficient H 2 -photocatalyst than Cu/ TiO 2 , which is in line with the results from the single reactor.When the water splitting and CO 2 hydrogenation were performed in the liquid phase and gas phase, respectively, the location of the catalyst greatly influenced the activity and selectivity of the CO 2 reduction.When Pt/TiO 2 was the H 2 -photocatalyst in the liquid phase (Cases 4 and 5), the H 2 , CH 4 , and CO yields were all higher than those in Case 2 and Case 3, in which Cu/TiO 2 was the H 2 -photocatalyst.The higher H 2 yield in Case 4 and Case 5 can be ascribed to the greater H 2 production of the Pt/TiO 2 catalyst than of the Cu/TiO 2 .The higher production of CO and CH 4 indicated that the greater H 2 production from water splitting could enhance CO 2 hydrogenation in the gaseous phase.This is in line with the results from the single reactor, which indicated that H 2 effectively hydrogenates CO 2 through a gas-solid interfacial reaction. It is notable that, in the case of Cu/TiO 2 as the CO 2 -photocatalytst (Case 3 and Case 5), the CO yield was higher than the CH 4 yield.However, if the Pt/TiO 2 catalyst acted as the CO 2 -photocatalytst (Case 2 and Case 4), the CH 4 yield was higher than the CO yield.This is explained well by the results of single reactor experiment, which show that the CO yield from the CO 2 hydrogenation on Cu/TiO 2 was much higher than that on Pt/TiO 2 , while the CH 4 yield showed the opposite result.In brief, Cu/TiO 2 was more effective for the reduction of CO 2 to CO, while Pt/TiO 2 more effectively promoted the production of CH 4 . The H 2 consumed by the hydrogenation of CO 2 was also calculated (Table 3), and the results show that, as more H 2 was produced, more H 2 was consumed by the CO 2 hydrogenation reaction, and a higher quantum efficiency in the CO 2 reduction could be achieved over the same CO 2 -photocatalyst.In addition, it was found that the amount of H 2 consumed was less than the stoichiometry of the CO and CH 4 production reaction.This is because a portion of the hydrogen was provided by water, as shown in the results of the single reactor experiments. Quantum efficiencies (QE) were calculated to evaluate the solar energy utilization efficiency of each photocatalyst combination, and they are listed in Table 3.In the absence of the CO 2 -photocatalyst (cases 6 and 7), the QEs for CO 2 reduction were lower than those in the other cases, indicating the importance of the CO 2 -photocatalyst for CO 2 reduction.In the twin reactor system with both H 2 -and CO 2 -photocatalysts, the QE of Pt/TiO 2 (l) Cu/TiO 2 (l) was the lowest among all cases, which can be attributed to the low solubility of CO 2 in water.It is notable that the QE of Pt/TiO 2 (l) Cu/TiO 2 (g) was the highest, which demonstrated that placing Pt/TiO 2 and Cu/TiO 2 in the suitable phases obviously enhanced the reduction of CO 2 , which was attributed to the simultaneously improved H 2 production and CO 2 hydrogenation over the photocatalysts in different phases. The generation of O 2 in the twin reactor was also investigated.Although GC was used to measure the concentration of O 2 in the reactor, it was difficult to determine the amount of O 2 generated during the photocatalytic reaction because background residual air (i.e.O 2 and N 2 within a few hundred ppm) existed in the reactor even after it was purged by ultra-pure Ar for several hours before the reaction.The residual O 2 in the reactor greatly interfered the determination of the O 2 yield. Therefore, a better indicator of the O 2 produced by the catalyst during the photoreaction is the molar ratio of O 2 /N 2 in the reactor, as suggested in the literatures 30,44.In this work, the ratio of O 2 /N 2 in the twin reactor during photocatalytic reaction was calculated and shown in Fig. 11 O 2 through the oxidation of H 2 O by photogenerated holes.This O 2 generation process was greater than the previously mentioned concurrent O 2 consumption process, and thus, the net result was that the O 2 /N 2 ratio increased gradually with time and, in the end, was higher than the original O 2 /N 2 ratio.This result verified that there was O 2 generated during the photocatalytic CO 2 reduction process."}, {"title": "Conclusions", "content": "In this study, a modified twin reactor was utilized for the photoreduction of CO 2 into solar fuels using the H 2 produced from photocatalytic water splitting.The most dominant advantage of the twin reactor was that CO 2 hydrogenation was separated from water splitting in different phases, which enabled us to control the CO 2 hydrogenation and water splitting reactions independently by using two different photocatalysts, i.e., Cu/TiO 2 and Pt/TiO 2 .The results from the single reactor showed that Pt/TiO 2 had a higher H 2 production than Cu/TiO 2 .For CO 2 hydrogenation, Cu/TiO 2 was more effective toward the reduction of CO 2 to CO, while Pt/TiO 2 tended to promote the production of CH 4 .Finally, the results in the twin reactor system indicate that the existence of the H 2 -photocatalyst and the CO 2 -photocatalyst in different phases significantly promoted CO 2 reduction.The highest CO 2 reduction activity was achieved by using Pt/TiO 2 as the H 2 -photocatalyst and Cu/TiO 2 as the CO 2 -photocatalyst.Consequently, the high QE was attributed to the simultaneous enhancement of H 2 evolution and CO 2 hydrogenation. Fig. 1.Schematic diagram of the twin reactor system. Case 1, Cu (l) Pt (l); Case 2, Cu (l) Pt (g); Case 3, Cu (l) Cu (g); Case 4, Pt (l) Pt (g); Case 5, Pt(l) Cu(g); Case 6, Pt/TiO 2 (l) without the CO 2 -photocatalyst; and Case 7, Cu/TiO 2 Fig. 2. Single reactor for water splitting (A) and CO 2 hydrogenation (B). Fig. 3. XRD patterns of as-prepared catalysts. Fig. 4. FE-SEM images of P25 (A), Cu/TiO 2 (B) and Pt/TiO 2 (C) catalysts. Fig. 5. Pt 4f XPS spectrum of Pt/TiO 2 (A) and Cu 3d XPS spectrum of Cu/TiO 2 catalyst (B). Fig. 6.PL spectra of as-prepared catalysts. Fig. 7. UV-vis absorption spectra of as-prepared catalysts. Fig. 8. H 2 yield of Pt/TiO 2 and Cu/TiO 2 catalyst. Fig. 9. CO yield (A) and CH 4 yield (B) of photocatalytic hydrogenation of CO 2 with H 2 in the presence/absece of water. . The results show that the O 2 /N 2 ratio dramatically decreased in the first 1 h and then gradually increased thereafter.This sharp decrease is possibly caused by the consumption of residual O 2 in the reactor through the reaction with photogenerated electrons O 2 e - O 2 -and their consecutive reactions.The gradual increase in the O 2 /N 2 ratio after 1 h light irradiation suggested the generation of Fig. 10.Time dependent H 2 (A), CO (B), and CH 4 (C) yield and total yields (D) of CO 2 photoreduction after 4 h irradiation in the twin reactor. 3 g -1 Photocatalytic H 2 production and CO 2 hydrogenation activity of the catalysts in the single reactor after 4 h light irradiation. Photocatalytic H 2 production and CO 2 reduction activity of the catalysts in the twin reactor after 4 h ligh irradiation. a Amount of H 2 reacted with CO 2 H 2 production in the presence of H 2 -photocatalyst only -H 2 yield in the presence of both H 2 -photocatalyst and CO 2 -photocatalyst.b QE, quantum efficiency 100 number of electrons mole of average yield of products/mole of photon reached photocatalyst.Number of electrons: 8 for CH 4 and 2 for CO. This project was supported by the National Natural Science Foundation of China (51706082, U1610110), the Foreign Science and Technology Cooperation of Hubei Province (2016AHB021), China Postdoctoral Science Foundation (2017M620319), and Taiwan MOST (105-2221-E-002-206-MY3).The authors acknowledge the Analysis and Test Center of Huazhong University of Science Technology."}]