[{"title": "Doi", "content": "10.1016/j.solener.2018.02.063"}, {"title": "Article_Title", "content": "Photoreduction of CO2 over heterogeneous modified TiO2 nanoparticles under visible light irradiation: Synthesis, process and kinetic study"}, {"title": "Abstract", "content": "In this study, Fe-doped, N-doped and Fe-N-codoped TiO 2 were synthesized and the effects of dopants, the partial pressure of CO 2 and H 2 O were investigated on the performance of CO 2 photoreduction.The synthesized nanoparticles were characterized by XRD, BET, FE-SEM, EDS, TEM, UV-Vis DRS and XPS analysis.A decrease in particle size and an increase in surface area of modified samples were observed by XRD and BET analysis.XPS results have indicated the presence of Fe 3 and substitutional nitrogen in TiO 2 lattice.DRS analysis has revealed that absorption spectra of doped samples significantly extended to the visible light region.The partial pressure of CO 2 and H 2 O was systematically varied and investigated in order to indicate the most suitable conditions for achieving high photoreduction activity.The highest production rate of methane and methanol, 28.15 mol/g cat h and 1.24 mol/g cat h, respectively, was observed over the 0.12Fe-0.5Nsample with total flow rate 13 ml/min under 70 w visible light irradiation at optimum partial pressure of reactants (P CO2 75.8kPa, P H2O 15.5 kPa).The methane rate of the best catalyst (0.12Fe-0.5N)under optimum condition was 51 times higher than pure TiO 2 at fixed P CO2 75.8kPa, P H2O 15.5 kPa.A new kinetic model was developed based on Sips isotherm over non-homogenous (heterogeneous) catalyst.The kinetic parameters such as reaction rate constant and affinity coefficients of CO 2 and H 2 O were predicted experimentally.The reaction rate constant as well as CO 2 and H 2 O affinity coefficients were predicted 6.47 mol/g cat h, 22.74 bar -1 and 145.2 bar -1 , respectively."}, {"title": "Experimental", "content": "Our precursor agent, titanium tetraisopropoxide (TTIP)(Ti(i-C 3 H 7 O 2 ) 4 ) from Panreac with 97 purity, titanium dioxide (P25) was purchased from Evonik chemical company, acetic acid (CH 3 COOH, Merck, 100 (glacial) pure), urea (NH 2 CONH 2 , Merck, 99.5 assay), ferric nitrate (Fe(NO 3 ) 3 9H 2 O, Merck, 99 assay) and isopropanol (CH 3 CH(OH)CH 3 , Merck, 99.8 pure) were all prepared and used without any further purification.Deionized water (DI-H 2 O) was used in all experiments. The modified sol-gel method was used to synthesize mesoporous N-TiO 2 , Fe-TiO 2 and co-doped Fe-N-TiO 2 nanoparticles.First, 60 ml of isopropanol was added into 20 ml of titanium tetra iso-propoxide (TTIP) and stirred well for 30 min (solution A).In order to control the rate of hydrolysis a mixture of 12 ml acetic acid (1M) and 20 ml isopropanol, instead of water, was added drop-wise into solution A under vigorous stirring during 24 h at 25 C (solution B).Subsequently, the appropriate amount of urea and ferric nitrate dissolved in isopropanol was added drop-wise to solution B (forming solution C) and continuously stirred for another 16 h until clear sol was produced.The sol is then put into the oven, dried at 80 C for 14 h and finally calcined during 2 h in a furnace at a rate of 5 C min -1 up to a maximum of 500 C.N-doped TiO 2 and Fe-doped TiO 2 samples with different mass ratios 0.25, 0.5, 0.75, 1.25 for N/TiO 2 and 0.06, 0.12, 0.25, 0.5 for Fe/TiO 2 were prepared.After that, Fe-N-TiO 2 sample was prepared at best mass ratio of N/TiO 2 and Fe/TiO 2 according to the results.For comparison, pure TiO 2 was also prepared using the same procedure without adding the urea and ferric nitrate. The inner surface of the reactor was coated with catalyst powder in order to increase both the light irradiation efficiency and the contact area between feed stream and catalyst.First, 0.3 g of prepared catalyst was dissolved in 10 ml isopropanol under stirring during 20 min.Then, this solution was poured into Pyrex cylinder glass.The cylinder glass was rotated thoroughly to coat a uniform layer of the catalyst on the inner surface.Finally, the coated glass dried at 100 C during 4 h. The crystal structure of prepared nanoparticles was identified by Xray diffraction (XRD) patterns using an X'Pert Pro diffractometer (Panalytical company) with Cu K radiation in angular domain of 10 2 80 and k 0.15406 nm.The BET surface areas of the nanoparticles were determined by the Brunauer-Emmett-Teller (BET) technique (Nova Station B) based on the adsorption isotherms.UV-visible light diffuse reflectance spectroscopy (UV-Vis DRS) was conducted to measure the absorbance data of the photocatalysts using a UV-Vis spectrophotometer (model Avaspec-2048-TEC), and BaSO 4 was used as a reference.The morphology of the nanoparticles was characterized using a SIGMA VP-500 field emission scanning electron microscope (FESEM) and attached Energy Dispersive X-ray spectroscopy (EDS) was used for elemental analysis of modified samples.Transmission electron microscopy (TEM) was carried out in a Zeiss-EM10C-100 kV instrument, to obtain crystal structure and morphology of samples.The elemental chemical state and composition of the synthesized samples were carried out with an X-ray photoelectron spectroscopy (Thermofisher Scientific K-Alpha XPS spectrometer.),using Al K radiation. The experimental setup for the gas phase photoreactor system is presented in Fig. 1.This set-up includes a photoreactor, connectors, two mass flow controllers (Alicat), two water bubblers and a 70 W mercury lamp with light intensity of 85 mW/cm 2 . The set-up also includes a CO 2 gas cylinder (99.999), a Nitrogen (N 2 ) gas cylinder, a gas chromatograph (GC, Young Lin YL-6500) equipped with a capillary column, a flame ionization detector (FID) and a thermal conductivity detector (TCD). The photoreactor for reduction of CO 2 is subdivided into two main components: the Pyrex vessel where contact between the reactants (CO 2 and H 2 O), light irradiation and photocatalysts occurs and second the quartz tube in which a light source can be installed.The dimensions of the Pyrex reactor are 6 cm 15 cm (diameter and height) with ports for gas inlet, products outlet and measuring the temperature.Light source is placed in middle of quartz tube with cooling circulation to cool the heat produced from light. A photocatalytic reaction was performed under visible light irradiation in the reactor, which contained 0.3 0.01 g of photocatalyst coated on the entire inner surface of reactor.The spectrum of Hg lamp was detected in the range of 350-600 nm.Therefore, for the photocatalytic experiments under visible light irradiation, a circulating water including sodium nitrite 2.0 M was used to remove the UV wavelengths below 400 nm (as shown in Fig. 2) as well as heat generated from the Hg lamp.The temperature in the photoreactor was checked with a thermocouple attached to a digital temperature reader. Before switching the light source on, wet CO 2 was passed through the photoreactor at 45 ml/min for 40 min to remove any excess air or impurities and to ensure the complete adsorption of gas molecules.Then the Hg lamp was switched on and pure CO 2 gas or mixed with N 2 gas was continuously introduced into the reactor after having passed through the two water bubblers in order to saturate the photocatalysts with CO 2 and H 2 O. The products of the reaction were analyzed by detecting output stream concentration by means of a GC in order to determine the quantity of hydrocarbons generated from the photochemical reaction.Throughout the fixed duration of 1 h, steady condition, the product gas was analyzed at 10 min intervals.Blank photocatalytic reactions were carried out with and without the light irradiation in the presence and absence of the photocatalyst to ensure that fuel productions are due to CO 2 photoreduction. The process parameters investigated in this work included the type of catalyst, doping ratio, the partial pressure of CO 2 and the partial pressure of water vapor (H 2 O).First, the best percent of each dopant was found for Fe-doped and N-doped samples at constant partial pressure of CO 2 (P CO2 ) and H 2 O (P H2O ).Commercial TiO 2 -P25 (Degussa, Evonik) as a benchmark catalyst due to the its high activity in many photocatalytic reaction systems (Deiana et al., 2016;Shiraishi et al., 2017) was also evaluated under same condition to compare with synthesized samples.Then the effect of P CO2 and P H2O were investigated on photocatalytic fuel production of Fe-N-codoped TiO 2 sample with the best percent of Fe/TiO 2 and N/TiO 2 chosen from above mentioned experiments. The partial pressure of CO 2 (P CO2 ) was varied in the range of 0-101.3kPa at five level of 0, 27.5, 55.1, 75.8 and 101.3 kPa in the photocatalytic experiments, which was achieved by regulating the flow ratio of CO 2 to N 2 gas.The total flow rate of feed entering the reactor was held constant at 13 ml/min throughout the duration of all photocatalytic experiments.Meanwhile, the partial pressure of water (P H2O ) entering the photoreactor was varied by regulating the temperature of the water bubbler at five level of 4.3, 9.5, 15.5, 25 and 31 kPa. To investigate the effect of loading different amounts of dopants (Fe and N) on the CO 2 photoreduction performance, single and co-doped TiO 2 photocatalysts with different amount of Fe (0.06-0.5 wt) and N (0.25-1.25 wt) were prepared by the modified sol-gel method under similar experimental conditions.Amongst the single doped photocatalysts, 0.12 wt Fe and 0.5 wt N gave the best activity, and so, these ratios were then used for co-doping.Figs. 3 and4 show the XRD patterns of different samples for the metal (Fe) loaded nanoparticles, non-metal (N) loaded nanoparticles and co-doped (0.12Fe-0.5N)sample. It is seen that all diffraction peaks had Anatase (A) structure.Iron and nitrogen peaks were not observed in the XRD patterns due to the high dispersion of dopant species in titanium structure or because the doping contents were too low for XRD detection.Moreover, no peaks of the Fe and N indicate that the dopant ions were successfully incorporated into TiO 2 structure (Khan and Swati, 2016) in agreement with XPS results. The mean crystallite size of all nanoparticles calculated from XRD data from the Scherrer equation was within the range of 16.3-24.9nm.Mean crystallite size and d-spacing of A (1 0 1) planes are listed in Table 1.According to results, d-space of (1 0 1) planes remained almost constant, which indicates that nanoparticles have similar crystallinity and that Fe and N atoms are incorporated into the lattice of titanium dioxide without changing the average dimension of the unit cell.The diffraction peaks show that the catalysts are well crystallized and the mean crystallite size of the single-doped and co-doped catalysts decreased compared to mean crystallite size of pure TiO 2 (Table 1). The Fe 3 ionic radii (0.064 nm) was smaller than the Ti 4 ionic radii (0.068 nm).When Fe 3 enters TiO 2 structure, it won't break the crystal structure and will inhibit the crystal grain growth.So, with increasing of Fe doping content, the mean crystallite size for Fe doped-TiO 2 nanoparticles decreases.When nitrogen atom is substituted in place of oxygen in TiO 2 structure, it forms the new bond Ti-N.The ionic radius of nitrogen is larger than the Fe 3 radius.Hence, this may be the reason for the particle size of Fe doped-TiO 2 smaller than N doped-TiO 2 nanoparticles.The BET specific surface areas of single and co-doped photocatalysts are shown in Table 1.These results demonstrate the effect of doping on the specific surface area of the nanoparticles.It is obvious from Table 1 that doping of Fe and N influences the textural properties of nanoparticles.The surface areas of the nanoparticles were within the range of 55.1-86.9m 2 /g.An increase in BET surface area occurs for TiO 2 doped with Fe and N atoms.An increase in dopant loading suppresses the particle size growth due to its incorporation in the TiO 2 lattice.Therefore, the specific surface area of nanoparticles increases with an increase in Fe and N concentration that confirm the results of XRD analysis. Detailed morphological information of the 0.12Fe-0.5Nsample was shown by FESEM and TEM images (Fig. 5(a) and (b), respectively), in which approximately spherical, well-crystallized and uniform particles are observed with mean particle size about of 20 nm.The average particle size analyzed by FESEM was in good agreement with the result determined by XRD analysis.Moreover, aggregates of spherical nanoparticles of homogeneous shapes were observed from the transmission electron microscopy (TEM) image. To indicate the existence of the Fe and N atoms in titanium dioxide, EDX analysis of the 0.12Fe-0.5Nsample was carried out and is shown in Fig. 5(c).EDX is a chemical micro analysis technique used together with FESEM analysis.The signal at around 0.4 keV is ascribed to N atoms, whereas the signals at around 6.4 and 7.1 keV are ascribed to Fe atoms.The EDX spectra clearly validate the existence of Fe and N in the 0.12Fe-0.5Nsample along with the main constituents of Ti and O atoms, further no impurities were observed in EDX spectra, the peaks observed for Au was due to the sample holder. The absorption spectra for the single and co-doped TiO 2 photocatalysts with different amount of Fe and N atoms are presented in Fig. 6(a) and (b).As shown by these figures, the absorption of pure-TiO 2 is limited only to ultraviolet (UV) light region, but the light absorption characteristics of photocatalysts are shifted towards the visible region after single and co-doping. The Kubelka-Munk (K-M) equation was used to determine the band gap of the synthesized photocatalysts (Kim et al., 1993).The tangent line in the plots of the square root of the (K-M) equations against the photon energy, which was extrapolated to F(R).h 1/2 0, estimated the band gaps of the nanoparticles, as shown in Fig. 7(a) and (b), where Kubelka function is The band gap energies (eV) and the absorption edges (nm) of the synthesized photocatalysts were presented in Table 2.The band gap energy of the all modified samples with Fe an N atoms is lower than that of pure TiO 2 (3.2 eV). Nitrogen doped by oxygen atoms in TiO 2 lattice resulted in the narrowing of the band gap energy through the mixing of the N 2p and O 2p states (Asahi et al., 2001).Also, the incorporation of Fe 3 ions in the lattice of titanium dioxide is responsible for the shift of optical absorption towards the visible range due to the excitation of 3d orbitals electrons of Fe 3 to TiO 2 conduction band and the charge transfer transition between interaction Fe 3 ions (Ola and Maroto-Valer, 2016).The absorption spectra for both of the Fe-doped and N-doped TiO 2 photocatalysts showed increased shift in the visible light region with increased dopant loading content, in consistency with the changes in the color of the powders. For the Fe-N-co-doped TiO 2 sample, the presence of Fe and N atoms together also further decreased the band gap energy when compared to single doped and pure TiO 2 . This result confirms that doping with Fe and N atoms into TiO 2 as a single doped or co-doped can improve the absorbance in visible region and enhance the photo-activity of the photocatalysts under visible light irradiation. The elemental chemical states and concentrations of the Fe, N, Ti and O atoms in 0.12Fe-0.5Nsample were investigated through the XPS analysis as shown in Fig. 8.The energy range was calibrated by shifting the main C-C peak to 284.6 eV.As shown in Fig. 8a, in the Fe 2p spectra of 0.12Fe-0.5Nsample, the peaks at around 710.1 and 725.2 (eV) correspond to the 2p 3/2 and 2p 1/2 of Fe 3 , respectively.Fig. 8b shows three peaks at around 397.0, 398.4 and 400.6 (eV) in the N 1s XPS spectra of the sample.The peaks at around 400.6 and 398.4 (eV) were ascribed to the interstitial nitrogen and N atoms from adsorbed Ncontaining compounds (e.g., NH 3 and NO x ) (Li et al., 2005).The peak at around 397.0 eV was mainly attributed to substitutional nitrogen in the TiO 2 lattice as Ti-N bond.In Fig. 8c, the peak at 458.1 eV is ascribed to the Ti 2p 3/2 of TiO 2 while the peak at around 464.3 eV is assigned to the Ti 2p 1/2 of TiO 2 , respectively.The binding energy at 458.1 eV was lower than the standard Ti 2p peak.This indicated that Fe and N codoping reduced the band gap and optical absorption shifted towards the visible region that coincided with the DRS analysis.In the Fig. 8d, the XPS spectra of the O 1s region indicates that oxygen exists in two forms with the binding energies of 530.3 and 532.2 eV.The intense peak at 530.3 eV can be assigned to the Ti-O band while the other peak at 532.2 eV can be attributed to the surface hydroxyl groups (OH). Initially, a series of blank photocatalytic reactions were carried out to confirm that the CO 2 photoreduction process for fuel production required all elements including the presence of photocatalyst, light irradiation, and both of reactant feed (CO 2 and H 2 O).The blank reactions were conducted under following conditions: (1) without light source with the presence of photocatalyst and the both of reactant feed, ( 2 formation was observed.This proved that the fuel productions were produced through the photoreduction of CO 2 process.First, in order to indicate the photocatalytic activity of different synthesized samples and choose the best dopant loading, photoreduction of CO 2 was conducted in a continuous flow reactor under 70 W visible light irradiation with light intensity 85 mW/cm 2 .The photocatalytic experiments were conducted at a constant total flow rate (N 2 / CO 2 ) of 13 ml/min at ambient condition.The best amount of Fe and N loading on TiO 2 was found to be 0.12 wt and 0.5 wt for the single Fe and N doped photocatalyst, respectively.The highest production rate of methane, 23.53 mol/g cat h and 15.55 mol/g cat h was observed over the 0.12 Fe and 0.5 N samples, respectively, using the continuous reactor under 70 w visible light irradiation.Meanwhile, the maximum production rate of methanol, 1.21 mol/g cat h and 1.68 mol/g cat h was observed for the 0.12 Fe and 0.5 N samples, respectively. The increased surface area and visible light absorption are two key factors that improved the performance of various modified nanoparticles under visible light compared to pure TiO 2 .The increase in the specific surface area can be improve the photocatalytic activity and fuel production.Compared with the pure TiO 2 , doped samples have a larger surface area (Table 1), which increases the photoreduction rate because of the large amounts of reactant feed (CO 2 and H 2 O) can be adsorbed on the catalyst surface and easily reacted by photogenerated charge carriers.After Fe and N doping in TiO 2 structure, the optical absorption characteristics of the modified photocatalysts extended towards the visible light region, which shows that the 0irradiation. Furthermore, doping with a low dopant content can act as a charge trap to prevent recombination of electron-hole pairs and improve the interfacial charge transfer to reduction of CO 2 .Decreased fuel production was observed after the optimal doping ratio exceeded the 0.12 for Fe and 0.5 for N. The decrease in activity could be due to the coverage of the surface of TiO 2 with the excess of Fe and N atoms.The excessive TiO 2 surface coverage with the Fe and N atoms may inhibit interfacial charge transfer since there is less TiO 2 surfaces to be activated by the light energy.Moreover, the excessive Fe and N atoms may act as charge recombination centers for photogenerated electron and hole pairs resulting the reduction in photocatalytic activity. Therefore, the optimal loading ratios (0.12 Fe/TiO 2 and 0.5 N/ TiO 2 ) were chosen to synthesize 0.12Fe-0.5Ncodoped sample to determine if the photocatalytic activity could be further improved.As shown in Fig. 9, methane and methanol production was increased for 0.12Fe-0.5Ncodoped sample under 70 w visible light irradiation and fixed CO 2 and H 2 O partial pressures of 75.8 and 15.5 kPa, respectively.Increased performance can be due to the facilitated charge transfer induced by the dopant Fe and N atoms, the higher surface area of 0.12Fe-0.5Nsample compared with 0.5N and 0.12Fe samples (Table 1), as well as the lower band gap of codoped sample compared with 0.5N and 0.12Fe (Table 2). Also, the effect of CO 2 and H 2 O partial pressure were investigated on photocatalytic fuel production over 0.12Fe-0.5Ncodoped sample. Fig. 10(a) shows the effect of CO 2 partial pressure on photoreduction of CO 2 over 0.12Fe-0.5Ncodoped sample under 70 w visible light irradiation and fixed H 2 O partial pressure of 15.5 kPa.The results show that methane and methanol production increased with P CO2 , reaching a maximum value of 28.15 mol/g cat h at 75.8 kPa for methane and a maximum value of 1.24 mol/g cat h at 75.8 kPa for methanol production.After production reached a maximum value, it decreased with a further increment of P CO2 for both of methane and methanol.This result is probably indicating a competitive adsorption between reactants, CO 2 and H 2 O molecules, on the active sites of catalyst surface during the photoreduction process.At lower concentrations of CO 2 , a large amount of H 2 O molecules can be adsorbed on the catalyst surface, occupied the active sites, and consequently reduced the activity of catalyst.Also, at extremely high CO 2 concentrations, the CO 2 molecules would compete with H 2 O molecules for the active sites of photocatalyst, leading to reduction of fuel production. The effect of H 2 O partial pressure on photoreduction activity over 0.12Fe-0.5Ncodoped sample was shown in Fig. 10(b).The experiments were carried out under 70 w visible light irradiation and constant CO 2 partial pressure of 75.8 kPa with total flow rate 13 ml/ min.From Fig. 10(b), the results show that methane and methanol production was increased with P H2O until reaching a maximum value of 28.15 mol/g cat h at 15.5 kPa for methane and a maximum value of 1.24 mol/g cat h at 15.5 kPa for methanol production.Further increment of P H2O reduced fuel production for both of methane and methanol. This phenomenon, similar to the case of CO 2 partial pressure, was due to the competitive adsorption between CO 2 and H 2 O on the active sites of catalyst surface during the photoreduction process.The existence of H 2 O in photoreduction process is required due to its role in producing sufficient supply of H ions and OH for formation of fuel products.Although, extremely high H 2 O concentrations would occupy the photocatalyst active sites and consequently reduce the CO 2 molecules on the catalyst surface, leading to poor activity. Therefore, an optimum concentration of both reactants, CO 2 and H 2 O, exists for achieving high fuel production.The maximum methane yield of 28.15 mol/g cat h was found over 0.12Fe0.5Nat P CO2 75.8kPa, P H2O 15.5 kPa under 70 w visible light irradiation with flow rate of 13 ml/min. When the two reactants competitively adsorbed on the same type of active sites in surface of catalyst with different adsorption and desorption rate constants, the rate of reaction for uniform surface (homogeneous surface) could be represented by Langmuir-Hinshelwood mechanism (Delavari and Amin, 2016;Harriott, 2002). However, the Langmuir mechanism cannot predict rate of reaction for the case of heterogeneous surfaces, those with energetically different sites.For a heterogeneous surface like catalysts synthesized in this work, due to doping of different elements into lattice of TiO 2 , the Sips isotherm can be used to obtain the kinetics of adsorption (Sips, 1948).For multicomponent system, Sips model can be described as follows in Eq. (1) (Sips, 1948). where i is the fractional saturation of each reactant, P i is the partial pressures of each component, b i represents the affinity coefficients of the pure component i, and n (heterogeneity factor) represents the deviation from an ideal homogeneous surface and is assumed to be independent of temperature. In photocatalytic process, when two reactants competitively adsorbed on the same catalyst surface active sites, rate of reaction can be described as follows in Eq. ( 2): where k represents the rate constant of each product, I is light intensity and is the reaction order of the light intensity, having value one or less depending on light intensity.adsorbed on the catalyst surface while all products desorbed immediately after photocatalytic reaction, the rate of reaction can be explained as described in Eq. ( 3) and can be more simplified to Eq. ( 4).Moreover, the reaction was assumed to be irreversible because the partial pressures of the products were very low. The constants of the kinetic model (k, , b CO2 , b H2O and n) can be determined by correlating it with experimental data of P CO2 , P H2O , light intensity (fixed at 85 mW/cm 2 ) and the CH 4 production rate, using MATLAB software by minimization of the difference between the model and experimental methane rate results as the following objective function: where Rate model is the calculated reaction rate of methane and Rate exp is the experimental reaction rate of methane, which as defined as below: where Q is the total flow rate (l min -1 ), W is the weight of photocatalyst 3. The model is fitted well and showed high degree of precision with an R-squared value of 0.9754.By incorporating the predicted values of the kinetic constants, the resulting rate model for the photoreduction of CO 2 over 0.12Fe-0.5Nsample was presented in Eq. ( 7).where P CO2 and P H2O are partial pressure of CO 2 and H 2 O (bar).Depending on predicted parameters in Table 3, it can be seen that affinity coefficient of water (b H2O ) is much higher than affinity coefficient of CO 2 (b CO2 ).Predicted weaker adsorption of CO 2 than that of H 2 O could be related to super hydrophilicity of TiO 2 when irradiated by light (Sirghi and Hatanaka, 2003;Tan et al., 2017), which supports possibility of H 2 O boundary layer formation around surface of TiO 2 .The heterogeneity factor (n 1.23) was found greater than unity which indicated deviation from ideal homogenous surface. An agreement between predicted and experimental rate of methane was shown in Fig. 11.As shown in Fig. 11, the results of the predicted model were in a good agreement with experimental results. The transferability and validity of the derived kinetic model was tested by applying the model to a different partial pressure of H 2 O and CO 2 (P H2O 12 kPa and P CO2 60 kPa) over 0.12Fe-0.5Nsample.The calculated rate of methane by proposed model, 25.56 mol/g cat h, is in a good agreement with the experimental value of methane, 27.12 mol/g cat h, at P H2O 12 kPa and P CO2 60 kPa. Fe-doped, N-doped and Fe-N-codoped samples with different loading ratio were synthesized to enhance photoreduction of CO 2 under visible light irradiation.Doping with Fe and N increased specific surface area and visible light absorption, which contributed to an improvement of the fuel production.The optimal loading ratios of 0.12 Fe and 0.5 N were found to synthesize 0.12Fe-0.5Ncodoped sample.The effect of process parameters including the partial pressure of CO 2 and the partial pressure of H 2 O on photoreduction performance was investigated in order to find optimum conditions.The partial pressure of CO 2 and H 2 O which gave the highest fuel production was found to be 75.8kPa and 15.5 kPa, respectively.The combination of these process parameters resulted in a total methane rate of 28.15 mol/g cat h over the 0.12Fe-0.5Nsample with total flow rate 13 ml/min.The experimental data obtained was fitted into the new developed kinetic model based on Sips isotherm over heterogeneous catalyst and kinetic parameters was predicted with high degree of precision (R 2 0.9754). Table 3 The constants of the kinetic model estimated using experimental data over 0.12Fe-0.5Nsample at light intensity of 85 mW/ cm 2 . Predicted value k (mol/g cat h) 6.47 b CO2 (bar) Fig. 1.Schematic diagram of photocatalytic reaction system set-up for CO 2 reduction. Fig. 2. Effect of 2.0 M sodium nitrite on Hg lamp irradiation, (a) without filter, (b) with sodium nitrite filter. Fig. 3. XRD patterns of different Fe-doped and Fe-N co-doped photocatalysts calcined at 500 C. Fig. 4. XRD patterns of different N-doped and Fe-N co-doped photocatalysts calcined at 500 C. Fig. 5. Morphological information of the 0.12Fe-0.5Nsample (a) FESEM image, (b) TEM micrograph and (c) EDX analysis (inset: magnification of the scale from 0 to 0.8 keV). (a) and (b) shows the yield of methane and methanol over commercial (P25) and synthesized TiO 2 catalysts during continuous photocatalytic experiments at steady state condition (after 60 min) under fixed CO 2 and H 2 O partial pressures of 75.8 and 15.5 kPa, respectively.The experiments clearly indicate that the photocatalytic activity of TiO 2 under visible light irradiation can be greatly improved by incorporating Fe and N atoms in the TiO 2 structure. Fig. 7. Kubelka-Munk plot for band gap estimate of the (a) different Fe-doped and Fe-N co-doped photocatalysts, (b) different N-doped and Fe-N co-doped photocatalysts. Fig. 8. XPS spectra of 0.12Fe-0.5Nsample; (a) Fe 2p, (b) N 1s, (c) Ti 2p and (d) O 1s. g), C CH i 4 and C CH e 4 are the input and output concentration of methane, respectively.The constants of the kinetic model (k, , b CO2 , b H2O and n) were predicted and shown in Table Fig. 11.Agreement between predicted and experimental reaction rate. Crystallite size and surface area of nanoparticles from XRD and BET analysis. The band gap and absorption edge of different photocatalysts. Now, the new kinetic model could be developed for photocatalytic CO 2 reduction with H 2 O over non homogenous surface based on Sips isotherm.In photoreduction process, the CO 2 with H 2 O was reduced to CH 4 , CO, CH 3 OH, HCHO and etc.By assuming only CO 2 and H 2 O are"}, {"title": "Results_and_discussion", "content": "To investigate the effect of loading different amounts of dopants (Fe and N) on the CO 2 photoreduction performance, single and co-doped TiO 2 photocatalysts with different amount of Fe (0.06-0.5 wt) and N (0.25-1.25 wt) were prepared by the modified sol-gel method under similar experimental conditions.Amongst the single doped photocatalysts, 0.12 wt Fe and 0.5 wt N gave the best activity, and so, these ratios were then used for co-doping.Figs. 3 and4 show the XRD patterns of different samples for the metal (Fe) loaded nanoparticles, non-metal (N) loaded nanoparticles and co-doped (0.12Fe-0.5N)sample. It is seen that all diffraction peaks had Anatase (A) structure.Iron and nitrogen peaks were not observed in the XRD patterns due to the high dispersion of dopant species in titanium structure or because the doping contents were too low for XRD detection.Moreover, no peaks of the Fe and N indicate that the dopant ions were successfully incorporated into TiO 2 structure (Khan and Swati, 2016) in agreement with XPS results. The mean crystallite size of all nanoparticles calculated from XRD data from the Scherrer equation was within the range of 16.3-24.9nm.Mean crystallite size and d-spacing of A (1 0 1) planes are listed in Table 1.According to results, d-space of (1 0 1) planes remained almost constant, which indicates that nanoparticles have similar crystallinity and that Fe and N atoms are incorporated into the lattice of titanium dioxide without changing the average dimension of the unit cell.The diffraction peaks show that the catalysts are well crystallized and the mean crystallite size of the single-doped and co-doped catalysts decreased compared to mean crystallite size of pure TiO 2 (Table 1). The Fe 3 ionic radii (0.064 nm) was smaller than the Ti 4 ionic radii (0.068 nm).When Fe 3 enters TiO 2 structure, it won't break the crystal structure and will inhibit the crystal grain growth.So, with increasing of Fe doping content, the mean crystallite size for Fe doped-TiO 2 nanoparticles decreases.When nitrogen atom is substituted in place of oxygen in TiO 2 structure, it forms the new bond Ti-N.The ionic radius of nitrogen is larger than the Fe 3 radius.Hence, this may be the reason for the particle size of Fe doped-TiO 2 smaller than N doped-TiO 2 nanoparticles.The BET specific surface areas of single and co-doped photocatalysts are shown in Table 1.These results demonstrate the effect of doping on the specific surface area of the nanoparticles.It is obvious from Table 1 that doping of Fe and N influences the textural properties of nanoparticles.The surface areas of the nanoparticles were within the range of 55.1-86.9m 2 /g.An increase in BET surface area occurs for TiO 2 doped with Fe and N atoms.An increase in dopant loading suppresses the particle size growth due to its incorporation in the TiO 2 lattice.Therefore, the specific surface area of nanoparticles increases with an increase in Fe and N concentration that confirm the results of XRD analysis. Detailed morphological information of the 0.12Fe-0.5Nsample was shown by FESEM and TEM images (Fig. 5(a) and (b), respectively), in which approximately spherical, well-crystallized and uniform particles are observed with mean particle size about of 20 nm.The average particle size analyzed by FESEM was in good agreement with the result determined by XRD analysis.Moreover, aggregates of spherical nanoparticles of homogeneous shapes were observed from the transmission electron microscopy (TEM) image. To indicate the existence of the Fe and N atoms in titanium dioxide, EDX analysis of the 0.12Fe-0.5Nsample was carried out and is shown in Fig. 5(c).EDX is a chemical micro analysis technique used together with FESEM analysis.The signal at around 0.4 keV is ascribed to N atoms, whereas the signals at around 6.4 and 7.1 keV are ascribed to Fe atoms.The EDX spectra clearly validate the existence of Fe and N in the 0.12Fe-0.5Nsample along with the main constituents of Ti and O atoms, further no impurities were observed in EDX spectra, the peaks observed for Au was due to the sample holder. The absorption spectra for the single and co-doped TiO 2 photocatalysts with different amount of Fe and N atoms are presented in Fig. 6(a) and (b).As shown by these figures, the absorption of pure-TiO 2 is limited only to ultraviolet (UV) light region, but the light absorption characteristics of photocatalysts are shifted towards the visible region after single and co-doping. The Kubelka-Munk (K-M) equation was used to determine the band gap of the synthesized photocatalysts (Kim et al., 1993).The tangent line in the plots of the square root of the (K-M) equations against the photon energy, which was extrapolated to F(R).h 1/2 0, estimated the band gaps of the nanoparticles, as shown in Fig. 7(a) and (b), where Kubelka function is The band gap energies (eV) and the absorption edges (nm) of the synthesized photocatalysts were presented in Table 2.The band gap energy of the all modified samples with Fe an N atoms is lower than that of pure TiO 2 (3.2 eV). Nitrogen doped by oxygen atoms in TiO 2 lattice resulted in the narrowing of the band gap energy through the mixing of the N 2p and O 2p states (Asahi et al., 2001).Also, the incorporation of Fe 3 ions in the lattice of titanium dioxide is responsible for the shift of optical absorption towards the visible range due to the excitation of 3d orbitals electrons of Fe 3 to TiO 2 conduction band and the charge transfer transition between interaction Fe 3 ions (Ola and Maroto-Valer, 2016).The absorption spectra for both of the Fe-doped and N-doped TiO 2 photocatalysts showed increased shift in the visible light region with increased dopant loading content, in consistency with the changes in the color of the powders. For the Fe-N-co-doped TiO 2 sample, the presence of Fe and N atoms together also further decreased the band gap energy when compared to single doped and pure TiO 2 . This result confirms that doping with Fe and N atoms into TiO 2 as a single doped or co-doped can improve the absorbance in visible region and enhance the photo-activity of the photocatalysts under visible light irradiation. The elemental chemical states and concentrations of the Fe, N, Ti and O atoms in 0.12Fe-0.5Nsample were investigated through the XPS analysis as shown in Fig. 8.The energy range was calibrated by shifting the main C-C peak to 284.6 eV.As shown in Fig. 8a, in the Fe 2p spectra of 0.12Fe-0.5Nsample, the peaks at around 710.1 and 725.2 (eV) correspond to the 2p 3/2 and 2p 1/2 of Fe 3 , respectively.Fig. 8b shows three peaks at around 397.0, 398.4 and 400.6 (eV) in the N 1s XPS spectra of the sample.The peaks at around 400.6 and 398.4 (eV) were ascribed to the interstitial nitrogen and N atoms from adsorbed Ncontaining compounds (e.g., NH 3 and NO x ) (Li et al., 2005).The peak at around 397.0 eV was mainly attributed to substitutional nitrogen in the TiO 2 lattice as Ti-N bond.In Fig. 8c, the peak at 458.1 eV is ascribed to the Ti 2p 3/2 of TiO 2 while the peak at around 464.3 eV is assigned to the Ti 2p 1/2 of TiO 2 , respectively.The binding energy at 458.1 eV was lower than the standard Ti 2p peak.This indicated that Fe and N codoping reduced the band gap and optical absorption shifted towards the visible region that coincided with the DRS analysis.In the Fig. 8d, the XPS spectra of the O 1s region indicates that oxygen exists in two forms with the binding energies of 530.3 and 532.2 eV.The intense peak at 530.3 eV can be assigned to the Ti-O band while the other peak at 532.2 eV can be attributed to the surface hydroxyl groups (OH). Initially, a series of blank photocatalytic reactions were carried out to confirm that the CO 2 photoreduction process for fuel production required all elements including the presence of photocatalyst, light irradiation, and both of reactant feed (CO 2 and H 2 O).The blank reactions were conducted under following conditions: (1) without light source with the presence of photocatalyst and the both of reactant feed, ( 2 formation was observed.This proved that the fuel productions were produced through the photoreduction of CO 2 process.First, in order to indicate the photocatalytic activity of different synthesized samples and choose the best dopant loading, photoreduction of CO 2 was conducted in a continuous flow reactor under 70 W visible light irradiation with light intensity 85 mW/cm 2 .The photocatalytic experiments were conducted at a constant total flow rate (N 2 / CO 2 ) of 13 ml/min at ambient condition.The best amount of Fe and N loading on TiO 2 was found to be 0.12 wt and 0.5 wt for the single Fe and N doped photocatalyst, respectively.The highest production rate of methane, 23.53 mol/g cat h and 15.55 mol/g cat h was observed over the 0.12 Fe and 0.5 N samples, respectively, using the continuous reactor under 70 w visible light irradiation.Meanwhile, the maximum production rate of methanol, 1.21 mol/g cat h and 1.68 mol/g cat h was observed for the 0.12 Fe and 0.5 N samples, respectively. The increased surface area and visible light absorption are two key factors that improved the performance of various modified nanoparticles under visible light compared to pure TiO 2 .The increase in the specific surface area can be improve the photocatalytic activity and fuel production.Compared with the pure TiO 2 , doped samples have a larger surface area (Table 1), which increases the photoreduction rate because of the large amounts of reactant feed (CO 2 and H 2 O) can be adsorbed on the catalyst surface and easily reacted by photogenerated charge carriers.After Fe and N doping in TiO 2 structure, the optical absorption characteristics of the modified photocatalysts extended towards the visible light region, which shows that the 0irradiation. Furthermore, doping with a low dopant content can act as a charge trap to prevent recombination of electron-hole pairs and improve the interfacial charge transfer to reduction of CO 2 .Decreased fuel production was observed after the optimal doping ratio exceeded the 0.12 for Fe and 0.5 for N. The decrease in activity could be due to the coverage of the surface of TiO 2 with the excess of Fe and N atoms.The excessive TiO 2 surface coverage with the Fe and N atoms may inhibit interfacial charge transfer since there is less TiO 2 surfaces to be activated by the light energy.Moreover, the excessive Fe and N atoms may act as charge recombination centers for photogenerated electron and hole pairs resulting the reduction in photocatalytic activity. Therefore, the optimal loading ratios (0.12 Fe/TiO 2 and 0.5 N/ TiO 2 ) were chosen to synthesize 0.12Fe-0.5Ncodoped sample to determine if the photocatalytic activity could be further improved.As shown in Fig. 9, methane and methanol production was increased for 0.12Fe-0.5Ncodoped sample under 70 w visible light irradiation and fixed CO 2 and H 2 O partial pressures of 75.8 and 15.5 kPa, respectively.Increased performance can be due to the facilitated charge transfer induced by the dopant Fe and N atoms, the higher surface area of 0.12Fe-0.5Nsample compared with 0.5N and 0.12Fe samples (Table 1), as well as the lower band gap of codoped sample compared with 0.5N and 0.12Fe (Table 2). Also, the effect of CO 2 and H 2 O partial pressure were investigated on photocatalytic fuel production over 0.12Fe-0.5Ncodoped sample. Fig. 10(a) shows the effect of CO 2 partial pressure on photoreduction of CO 2 over 0.12Fe-0.5Ncodoped sample under 70 w visible light irradiation and fixed H 2 O partial pressure of 15.5 kPa.The results show that methane and methanol production increased with P CO2 , reaching a maximum value of 28.15 mol/g cat h at 75.8 kPa for methane and a maximum value of 1.24 mol/g cat h at 75.8 kPa for methanol production.After production reached a maximum value, it decreased with a further increment of P CO2 for both of methane and methanol.This result is probably indicating a competitive adsorption between reactants, CO 2 and H 2 O molecules, on the active sites of catalyst surface during the photoreduction process.At lower concentrations of CO 2 , a large amount of H 2 O molecules can be adsorbed on the catalyst surface, occupied the active sites, and consequently reduced the activity of catalyst.Also, at extremely high CO 2 concentrations, the CO 2 molecules would compete with H 2 O molecules for the active sites of photocatalyst, leading to reduction of fuel production. The effect of H 2 O partial pressure on photoreduction activity over 0.12Fe-0.5Ncodoped sample was shown in Fig. 10(b).The experiments were carried out under 70 w visible light irradiation and constant CO 2 partial pressure of 75.8 kPa with total flow rate 13 ml/ min.From Fig. 10(b), the results show that methane and methanol production was increased with P H2O until reaching a maximum value of 28.15 mol/g cat h at 15.5 kPa for methane and a maximum value of 1.24 mol/g cat h at 15.5 kPa for methanol production.Further increment of P H2O reduced fuel production for both of methane and methanol. This phenomenon, similar to the case of CO 2 partial pressure, was due to the competitive adsorption between CO 2 and H 2 O on the active sites of catalyst surface during the photoreduction process.The existence of H 2 O in photoreduction process is required due to its role in producing sufficient supply of H ions and OH for formation of fuel products.Although, extremely high H 2 O concentrations would occupy the photocatalyst active sites and consequently reduce the CO 2 molecules on the catalyst surface, leading to poor activity. Therefore, an optimum concentration of both reactants, CO 2 and H 2 O, exists for achieving high fuel production.The maximum methane yield of 28.15 mol/g cat h was found over 0.12Fe0.5Nat P CO2 75.8kPa, P H2O 15.5 kPa under 70 w visible light irradiation with flow rate of 13 ml/min. When the two reactants competitively adsorbed on the same type of active sites in surface of catalyst with different adsorption and desorption rate constants, the rate of reaction for uniform surface (homogeneous surface) could be represented by Langmuir-Hinshelwood mechanism (Delavari and Amin, 2016;Harriott, 2002). However, the Langmuir mechanism cannot predict rate of reaction for the case of heterogeneous surfaces, those with energetically different sites.For a heterogeneous surface like catalysts synthesized in this work, due to doping of different elements into lattice of TiO 2 , the Sips isotherm can be used to obtain the kinetics of adsorption (Sips, 1948).For multicomponent system, Sips model can be described as follows in Eq. (1) (Sips, 1948). where i is the fractional saturation of each reactant, P i is the partial pressures of each component, b i represents the affinity coefficients of the pure component i, and n (heterogeneity factor) represents the deviation from an ideal homogeneous surface and is assumed to be independent of temperature. In photocatalytic process, when two reactants competitively adsorbed on the same catalyst surface active sites, rate of reaction can be described as follows in Eq. ( 2): where k represents the rate constant of each product, I is light intensity and is the reaction order of the light intensity, having value one or less depending on light intensity.adsorbed on the catalyst surface while all products desorbed immediately after photocatalytic reaction, the rate of reaction can be explained as described in Eq. ( 3) and can be more simplified to Eq. ( 4).Moreover, the reaction was assumed to be irreversible because the partial pressures of the products were very low. The constants of the kinetic model (k, , b CO2 , b H2O and n) can be determined by correlating it with experimental data of P CO2 , P H2O , light intensity (fixed at 85 mW/cm 2 ) and the CH 4 production rate, using MATLAB software by minimization of the difference between the model and experimental methane rate results as the following objective function: where Rate model is the calculated reaction rate of methane and Rate exp is the experimental reaction rate of methane, which as defined as below: where Q is the total flow rate (l min -1 ), W is the weight of photocatalyst 3. The model is fitted well and showed high degree of precision with an R-squared value of 0.9754.By incorporating the predicted values of the kinetic constants, the resulting rate model for the photoreduction of CO 2 over 0.12Fe-0.5Nsample was presented in Eq. ( 7).where P CO2 and P H2O are partial pressure of CO 2 and H 2 O (bar).Depending on predicted parameters in Table 3, it can be seen that affinity coefficient of water (b H2O ) is much higher than affinity coefficient of CO 2 (b CO2 ).Predicted weaker adsorption of CO 2 than that of H 2 O could be related to super hydrophilicity of TiO 2 when irradiated by light (Sirghi and Hatanaka, 2003;Tan et al., 2017), which supports possibility of H 2 O boundary layer formation around surface of TiO 2 .The heterogeneity factor (n 1.23) was found greater than unity which indicated deviation from ideal homogenous surface. An agreement between predicted and experimental rate of methane was shown in Fig. 11.As shown in Fig. 11, the results of the predicted model were in a good agreement with experimental results. The transferability and validity of the derived kinetic model was tested by applying the model to a different partial pressure of H 2 O and CO 2 (P H2O 12 kPa and P CO2 60 kPa) over 0.12Fe-0.5Nsample.The calculated rate of methane by proposed model, 25.56 mol/g cat h, is in a good agreement with the experimental value of methane, 27.12 mol/g cat h, at P H2O 12 kPa and P CO2 60 kPa."}, {"title": "Conclusions", "content": "Fe-doped, N-doped and Fe-N-codoped samples with different loading ratio were synthesized to enhance photoreduction of CO 2 under visible light irradiation.Doping with Fe and N increased specific surface area and visible light absorption, which contributed to an improvement of the fuel production.The optimal loading ratios of 0.12 Fe and 0.5 N were found to synthesize 0.12Fe-0.5Ncodoped sample.The effect of process parameters including the partial pressure of CO 2 and the partial pressure of H 2 O on photoreduction performance was investigated in order to find optimum conditions.The partial pressure of CO 2 and H 2 O which gave the highest fuel production was found to be 75.8kPa and 15.5 kPa, respectively.The combination of these process parameters resulted in a total methane rate of 28.15 mol/g cat h over the 0.12Fe-0.5Nsample with total flow rate 13 ml/min.The experimental data obtained was fitted into the new developed kinetic model based on Sips isotherm over heterogeneous catalyst and kinetic parameters was predicted with high degree of precision (R 2 0.9754). Table 3 The constants of the kinetic model estimated using experimental data over 0.12Fe-0.5Nsample at light intensity of 85 mW/ cm 2 . Predicted value k (mol/g cat h) 6.47 b CO2 (bar) Fig. 1.Schematic diagram of photocatalytic reaction system set-up for CO 2 reduction. Fig. 2. Effect of 2.0 M sodium nitrite on Hg lamp irradiation, (a) without filter, (b) with sodium nitrite filter. Fig. 3. XRD patterns of different Fe-doped and Fe-N co-doped photocatalysts calcined at 500 C. Fig. 4. XRD patterns of different N-doped and Fe-N co-doped photocatalysts calcined at 500 C. Fig. 5. Morphological information of the 0.12Fe-0.5Nsample (a) FESEM image, (b) TEM micrograph and (c) EDX analysis (inset: magnification of the scale from 0 to 0.8 keV). (a) and (b) shows the yield of methane and methanol over commercial (P25) and synthesized TiO 2 catalysts during continuous photocatalytic experiments at steady state condition (after 60 min) under fixed CO 2 and H 2 O partial pressures of 75.8 and 15.5 kPa, respectively.The experiments clearly indicate that the photocatalytic activity of TiO 2 under visible light irradiation can be greatly improved by incorporating Fe and N atoms in the TiO 2 structure. Fig. 7. Kubelka-Munk plot for band gap estimate of the (a) different Fe-doped and Fe-N co-doped photocatalysts, (b) different N-doped and Fe-N co-doped photocatalysts. Fig. 8. XPS spectra of 0.12Fe-0.5Nsample; (a) Fe 2p, (b) N 1s, (c) Ti 2p and (d) O 1s. g), C CH i 4 and C CH e 4 are the input and output concentration of methane, respectively.The constants of the kinetic model (k, , b CO2 , b H2O and n) were predicted and shown in Table Fig. 11.Agreement between predicted and experimental reaction rate. Crystallite size and surface area of nanoparticles from XRD and BET analysis. The band gap and absorption edge of different photocatalysts. Now, the new kinetic model could be developed for photocatalytic CO 2 reduction with H 2 O over non homogenous surface based on Sips isotherm.In photoreduction process, the CO 2 with H 2 O was reduced to CH 4 , CO, CH 3 OH, HCHO and etc.By assuming only CO 2 and H 2 O are"}]