{"DOI": "10.1039/x0xx00000x", "paper_title": "Synergism of surface strain and interfacial polarization on Pd@Au core-shell cocatalysts for highly efficient photocatalytic CO 2 reduction over TiO 2 †", "human validator": "hybrid annotator", "annotation": {"catalyst": [{"llm generation": "TiO 2", "source": "Synergism of surface strain and interfacial polarization on Pd@Au core-shell cocatalysts for highly efficient photocatalytic CO 2 reduction over TiO 2 †", "context": "Synergism of surface strain and interfacial polarization on Pd@Au core-shell cocatalysts for highly efficient photocatalytic CO 2 reduction over TiO 2 †"}, {"llm generation": "photocatalysts", "source": "This study can be viewed as a means of designing photocatalysts via the simultaneous control of surface catalytic reactivity and interfacial charge transfer in cocatalysts.", "context": "Solar driven conversion of CO 2 into carbonaceous chemicals is a promising strategy to mitigate greenhouse gas emission and simultaneously store renewable energy.Rational construction of heterostructured cocatalysts represents an efficient method to improve the photocatalytic activity and selectivity in CO 2 reduction.In this work, with PdAu core-shell nanostructures with tunable Au thickness as model cocatalysts, we demonstrate the synergism of surface strain and interfacial polarization for enhanced photoreduction of CO 2 into CO.According to our experimental analysis and theory simulation, resulted from the mismatch in lattice parameters between Pd core and Au shell, compressive strain on the Au surface elevates the d-band center and improves the adsorption of key intermediate COOH.Meanwhile, charge polarization, driven by the difference in electronegativity between Pd and Au, accelerates the interfacial charge transfer and increases the electron density on Au surface.It is found that both effects are dependent on the thickness of Au shell.As a result, three-atom-thick Au shell dramatically boosts the overall efficiency in CO 2 -to-CO conversion with an impressive activity of 166.3 mol g cat -1 h -1 and selectivity of 90.6.This study can be viewed as a means of designing photocatalysts via the simultaneous control of surface catalytic reactivity and interfacial charge transfer in cocatalysts."}, {"llm generation": "TiO 2 -based photocatalysts", "source": "To investigate the photocatalytic activities of TiO 2 -based photocatalysts for CO 2 reduction, 15 mg of photocatalysts were dispersed on the flat glass plate at the bottom of photocatalytic reactor.", "context": "Please do not adjust margins Please do not adjust margins In a typical synthesis of TiO 2 -PdAu, a solution was firstly prepared in a vial as follows: 9.625 mL aqueous solution containing 0.32 g cetyltrimethylammonium chloride (CTAC), 10 L aqueous solution of NaBr (0.01 M), 80 L aqueous solution of HAuCl 4 (10 mM) and 90 L aqueous solution of ascorbic acid (AA, 0.04 M) were mixed at 30 C to obtain a colorless solution.Subsequently, a certain amount of TiO 2 -Pd was added into the mixed solution.The solution in the vial was left undisturbed for 15 min to complete the Au growth.The resultant product was separated by centrifugation, washed with water for four times, and dried at 45 C in a vacuum.TiO 2 -PdAu samples with different Au shells were obtained through altering the amounts of TiO 2 -Pd used, including 4.5, 1.5 and 0.5 mg for the synthesis of TiO 2 -PdAu-1, TiO 2 -PdAu-2 and TiO 2 -PdAu-3, respectively. 3.0 mg as-synthesized products were dispersed in a mixture of 10 L ethanol and 10 L Nafion, which were then uniformly spin-dropped onto at a 1 cm 1 cm indium tin oxide (ITO)-coated glass by a spin coater (SC-1B, China).Subsequently, the ITO-coated glasses were heated at 80 C in a vacuum oven for 1 h.The photocurrents were measured on a CHI 760E electrochemical station (Shanghai Chenhua, China) in ambient conditions under irradiation of a 300 W Xe lamp (Solaredge 700, China).UV light (320 420 nm) was used as the illumination source, which was realized in the presence of a short-wave-pass 420 nm cutoff filter.The power density of the light was measured to be 2.7 mW cm -2 .A three-electrode cell was used to perform the electrochemical measurements.The working electrode was the ITO-coated glass.A Ag/AgCl electrode and Pt foil were used as the reference electrode and counter electrode, respectively.The three electrodes were inserted in a quartz cell filled with 0.5 M Na 2 SO 4 electrolyte.The photoresponse of the prepared photoelectrodes (i.e., I-t) was operated by measuring the photocurrent density under chopped light irradiation (light on/off cycles: 60 s) at a bias potential of 0.4 V vs. Ag/AgCl for 400 s.Electrochemical impedance spectroscopy (EIS) was performed in the 10 -1 to 10 5 Hz frequency range with an AC voltage amplitude of 10 mV at an applied potential of 0.4 V vs. Ag/AgCl.The transient open-circuit voltage decay (OCVD) was measured for a total of 800 s under UV light irradiation, and the light was switched on and off 100 and 400 s from the start, respectively.The average lifetime of the photogenerated carriers ( n ) was obtained according to the OCVD using the following equation: where K B is the Boltzmann constant, T is the temperature (in Kelvin), and q is the unsigned charge of an electron. To investigate the photocatalytic activities of TiO 2 -based photocatalysts for CO 2 reduction, 15 mg of photocatalysts were dispersed on the flat glass plate at the bottom of photocatalytic reactor.And 5 mL H 2 O was added and surrounded the plate.Prior to the test, the reactor loaded with catalyst was first purged with high purity CO 2 (0.15 MPa) for 20 min.Then the light-irradiation experiment was performed by using a 300 W Xe lamp with UV light as the illumination source.The power density of UV light (320 420 nm) was measured to be 2.7 mW cm -2 .The photocatalytic reaction was performed under irradiation of UV light with stirring at 300 rpm for 4 h.After completion of the reaction, the gaseous mixture was analyzed using a gas chromatograph (GC-2014, Ar carrier, Shimadzu) with Ar as the carrier gas.The amount of H 2 and O 2 was determined using a thermal conductivity detector (TCD).The amount of CH 4 was measured by using a flame ionization detector (FID).The amount of CO was converted to CH 4 by using a methanation reactor and then analyzed by using the FID.After the reaction was completed, the sample was collected by centrifugation at 8000 rpm for 5 min.During the stability test, the photocatalyst with the best performance was collected after each run and then reused for photoreduction of CO 2 .The photocatalyst was heat treated at 160 C for 3 h after the runs before its reusing.The isotope-labeling experiments were performed using 13 CO 2 instead of 12 CO 2 , and the products were analyzed using gas chromatographymass spectrometry (7890B/5977A, Agilent).Visible photocatalytic performance was measured under the same experimental condition except that both long-wave-pass 420-nm and short-wave-pass 780nm cutoff filters (420 780 nm ) were used instead of shortwave-pass 420 nm ( 420 nm) cutoff filter."}, {"llm generation": "TiO2", "source": "In the proof-of-concept design, TiO 2 nanosheets were used as a model semiconductor, which were synthesized according to a literature procedure (Fig. S1).", "context": "In the proof-of-concept design, TiO 2 nanosheets were used as a model semiconductor, which were synthesized according to a literature procedure (Fig. S1). 42As revealed by transmission electron microscopy (TEM) and high-resolution TEM (HRTEM) images, TiO 2 nanosheets with an edge length of approximately 200 nm and thickness below 10 nm are monocrystalline structure dominated with (001) facet (Fig. S2).The large flat surface of the nanosheets facilitates the loading of cocatalyst, while low thickness shortens the electron migration distance to cocatalysts.Secondly, Pd nanocrystals were in situ grown on TiO 2 by reducing K 2 PdCl 4 with ascorbic acid (AA) (Fig. S1).With KBr as a facet-selective capping agent, cubic Pd nanocrystals with an average edge length of 10.6 nm are uniformly distributed on the flat surface of TiO 2 (Fig. S3a,b). 43s revealed by TEM image with a standing-up TiO 2 nanosheet, Pd nanocubes are integrated with TiO 2 nanosheets through facet-tofacet contact (Fig. S3c).As a result, TiO 2 -Pd interfaces with large area guarantee the stability of the supported structure and efficiency of interfacial charge transfer.HRTEM image of Pd shows continuous lattice fringes with a spacing of 1.95 A, implying monocrystalline nanostructures enclosed by six (100) facets (Fig. S3d). In the third step, Pd nanocubes were coated by Au shell with tunable thickness via the reduction of HAuCl 4 with AA (Fig. S1). 29iven the larger lattice mismatch between Pd and TiO 2 , Au selectively wet the Pd surface through an epitaxial growth mode to minimize the interfacial energy. 44Fig. 1a andb show TEM images of as-obtained TiO 2 -PdAu-1 with smaller Au/TiO 2 -Pd ratio.It can be clearly seen that PdAu core-shell nanostructures dispersed on TiO 2 nanosheets inherit the cubic profile shape with truncated corners.Especially, resulted from the higher electron density of Au than that of Pd, there is an image contrast between inner grey black Pd and exterior deep black Au.The Au shell is determined to be around 0.6 nm in thickness, which is also a piece of single crystal enclosed by (100) facets as revealed by HRTEM image, forming perfect Pd(100)-Au(100) interfaces with existing Pd core (Fig. 1c).The number of Au atomic layers is three and the interatomic spacing of the Au-Au pairs is 1.96 A, 4.35 smaller than that of pure Au (2.05 A), suggesting that compressive residual strains are developed in the 0.6 nm thick Au shell.This argument is further supported by the aberration-corrected high-angle annular dark-field scanning TEM (HAADF-STEM) images taken from an individual core-shell nanocube (Fig. 2a,b).The elemental distributions in the as-obtained a N.D. not detected. together with corresponding energy-dispersive spectroscopy (EDS) mapping profiles (Fig. 2c). With the further increase of Au/TiO 2 -Pd ratio, TiO 2 -PdAu samples with higher thicknesses of Au shell were obtained.As shown in Fig. 1d,e,g,h, the shell thickness of deep black Au increases to around 3 nm for TiO 2 -PdAu-2 and then to 7 nm for TiO 2 -PdAu-3 on average.As the shell thickness increases, the corner of PdAu core-shell nanocrystals becomes more round and the morphology tends to be more irregular.According to HRTEM images (Fig. 1f andi), the planes of Au shell also share the same orientation with Pd cores, contributing to the construction of PdAu core-shell nanostructure with Au(100) surfaces and Pd(100)-Au(100) interfaces.The numbers of Au atomic layers are estimated to be 15 and 34, and lattice spacings in Au shell are measured to be 2.01 and 2.05 A for the TiO 2 -PdAu-2 and TiO 2 -PdAu-3, respectively.The above results imply that the compressive strains along the directions parallel to the exposed (100) planes of Pd nanocrystals gradually reduce as the Au thickness increases.For TiO 2 -PdAu-2, 3 nm Au shell is also under compression with a 1.93 lattice strain.When the shell thickness becomes greater than 7 nm, the compressive strain on the Au shell reduces to the level of that of bulk Au.The morphological evolution of PdAu nanocrystals along with the increase of Au thickness could also be clearly seen from STEM images and EDS mapping profiles (Fig. 2d ande).It should be noted that as one plane of Pd nanocubes in the TiO 2 -PdAu samples is in intimate contact with TiO 2 , only five planes are covered by Au to form stack structures, which can be verified by the TEM images with standing-up TiO 2 nanosheets (inset of Fig. 1b,e,h).Additionally, with the deposition of single crystalline Au nanocubes enclosed by (100) planes on TiO 2 nanosheets via facet-tofacet contact, TiO 2 -Au is also fabricated as a reference sample (Fig. S4). The structures of as-obtained samples were further characterized by X-ray powder diffraction (XRD) patterns.As shown in Fig. 3a, in addition to the peaks of anatase phase of TiO 2 (JCPDS no.21-1272), all other peaks can be ascribed to face-centered cubic (fcc) Pd (JCPDS no.65-2867) and Au (JCPDS no.65-2870).In comparison with the pattern of TiO 2 -Pd, no additional Au peak can be observed in TiO 2 -PdAu-1, except a slight leftward broadening of Pd peaks.These results indicate that the lattice parameter of ultrathin Au layers is similar to that of Pd, further suggesting the compression of Au lattice. 33As the Au thickness increasing, characteristic peaks of Au appear in TiO 2 -PdAu-2 and TiO 2 -PdAu-3, and the intensities of which gradually increase while the positions shift to lower angles, implying the increased lattice spacing of Au shell.The positions of Au peaks in TiO 2 -PdAu-3 are close to those in TiO 2 -Au, again proving that Au is nearly free from residual strain. X-ray photoelectron spectra (XPS) were then used to collect the surface composition information of the samples.Survey spectra further confirm the presence of Pd and Au, along with Ti and O in the TiO 2 -PdAu samples (Fig. S5).In the spectrum of Pd3d and This journal is The Royal Society of Chemistry 20xx Please do not adjust margins Please do not adjust margins with zero-valence Pd and Au, respectively, while small amounts of Pd (II) states are also detected and shown as doublets (336.6/342.0eV), which are typical features for solution-synthesized Pd (Fig. 3b andc).It is worth noting that Au4d 5/2 signal at 335.4 eV is overlapped with Pd3d spectrum (Fig. 3b and Fig. S5).Owing to the limited detection depth of XPS, with the increase of Au shell thickness, Au4d and Au4f signals become stronger while Pd3d signal gradually weakens.More importantly, Pd3d and Au4d/Au4f peaks shift to higher and lower binding energy compared with those of TiO 2 -Pd and TiO 2 -Au, respectively, suggesting electron-deficient Pd and electron-rich Au. 29,45 What's more, more obvious shifts occur when Au shell of TiO 2 -PdAu is thinner, suggesting more significant charge re-distribution between them. Upon acquiring the structure and composition information of the samples, we are in a position to investigate their photocatalytic performance in CO 2 reduction.The TiO 2 based samples were used as photocatalysts in the mixed vapor of CO 2 and H 2 O under UV light irradiation (320 420 nm), and the products were analyzed by gas chromatography.As shown in Fig. 4a, it can be clearly seen that the loading of metal significantly improves the photocatalytic activity of TiO 2 .Moreover, the yields of reduction products show a strong correlation with the type of metal, which should be related to the functions of cocatalysts.The reduction product over TiO 2 -Pd is dominant H 2 with trace amounts of CO and CH 4 .With the further deposition of Au on Pd, the side reaction of H 2 evolution is effectively inhibited, while CO yield is remarkably improved.According to previous reports, 35,46 water splitting prefers to occur on Pd(100) plane, while Au exhibits high activity and selectivity in conversion of CO 2 to CO due to the weak Au-CO binding energy.More importantly, the average CO production rates are greatly dependent on the thickness of Au shell.With the thinnest Au shell, TiO 2 -PdAu-1 achieves an impressive value of 166.3 mol g cat -1 h -1 , 97.8 and 75.6-fold times higher than those of TiO 2 and TiO 2 -Pd, respectively (Table 1).With the increase of Au thickness, CO evolution rate falls to 38.4 and 14.8 mol g cat -1 h -1 for TiO 2 -PdAu-2 and TiO 2 -PdAu-3, respectively, superior to that of TiO 2 -Au.For TiO 2 -PdAu samples, the selectivity for CO production follows a same order as the CO evolution rate (Fig. 4a), which is calculated according to the average evolution rates of reduction products as well as the electrons required to generate products using the following equation: CO selectivity() 2(CO)/2(H 2 ) 2(CO) 8(CH 4 ) 100 TiO 2 -PdAu-1 exhibits the highest selectivity of 90.6, which drops to 68.9 for TiO 2 -PdAu-2, and then to 53.8 for TiO 2 -PdAu-3, almost close to that of TiO 2 -Au (52.9) (Table 1). The photocatalytic performance of TiO 2 -PdAu-1 also outperforms those of reported state-of-the-art Au cocatalysts supported by TiO 2 measured under comparative conditions (Table S1). 29,47488495051 Moreover, after five 4 h of cycling test, TiO 2 -PdAu-1 still maintain efficient activity and selectivity in CO evolution (Fig. 4b).As revealed by the TEM, XRD and XPS of TiO 2 -PdAu-1 after long-term testing, the excellent durability can be ascribed to the well-maintained structure and composition of the catalyst (Fig. S6 andS7).It should be noted that O 2 as an oxidation product was also detected in the photocatalytic reaction, suggesting the occurrence of H 2 O 2h 1/2O 2 2H (Table 1).Moreover, no low-carbon product was detected in the control experiments including without photocatalyst, in the dark or in Ar atmosphere, confirming that CO Please do not adjust margins Please do not adjust margins was actually originated from photoreduction of CO 2 rather than adsorbed carbon species (Table 1).To further confirm this, the 13 C Fig. 6 Differential charge density determined by first-principles simulations for the Au(100) shells on Pd(100) substrates in the presence of one additional electron (subtracting the charges in the neutral case (Fig. S8) from this system).The Au shell thickness is altered from 1 to 4 layers.The olive and cyan colors represent an increase and decrease in electron density, respectively.isotope labeling experiment was performed over TiO 2 -PdAu-1 using 13 CO 2 as a substrate to explore the source of carbon.As shown in Fig. 4c, the strong signal at m/z 29 can be assigned to 13 CO, suggesting that the carbon source of CO is derived from the used CO 2 .Besides of CO, CH 4 evolution rate of TiO 2 -PdAu gradually increases with the reduction of Au thickness, while H 2 production rate gradually decreases, suggesting that it is possible to totally suppress H 2 evolution when the Au shell is further shrunk into monolayer (Table 1). 9,52,53hen the photocatalytic performance of TiO 2 -PdAu samples was measured under visible light irradiation (420 780 nm), no obvious product was detected for TiO 2 -PdAu-1, while TiO 2 -PdAu-2 and TiO 2 -PdAu-3 produced trace amounts of H 2 and CO.The main reason is that the plasmonic absorption of three-atom-thick Au shell in TiO 2 -PdAu-1 is too weak to generate hot electrons and inject them into the conduction band of TiO 2 for surface reduction reaction through AuTiO 2 and AuPdTiO 2 routes. 54,55otocatalytic mechanism study It is natural to ask what factor is responsible for the Au thicknessdependent photocatalytic performance?To decode the underlying mechanism, charge kinetics is first taken into consideration, which plays a key role in the photocatalytic processes. 56,57As the driven force of photocatalysis, light harvesting behaviors of the samples were evaluated by UV-vis diffuse reflectance spectra.As shown in Fig. 5a, the loading of metal does not alter the light absorption of TiO 2 in UV region.The varied visible absorption behaviors are mainly attributed to plasmonic band of Au as well as interband absorption of nonplasmonic Pd. 43,58,59 Given the comparable light absorption in UV region, photocurrent response offers an informative evaluation of the electron-hole separation efficiency.As indicated by photocurrent versus time (I-t) curves in Fig. 5b, the addition of metal significantly boosts the photocurrent density of TiO 2 , confirming the role of cocatalyst in preventing charge recombination in TiO 2 .Moreover, various metal cocatalysts show obviously different photocurrent enhancement, which turns out to be in the order: TiO 2 -Pd TiO 2 -Au TiO 2 -PdAu-3 TiO 2 -PdAu-2 TiO 2 -PdAu-1, demonstrating that low thickness of Au shell is beneficial to charge separation.This statement is also confirmed by electrochemical impedance spectra (EIS) and photoluminescence (PL) emission spectra (Fig. 5c andd).Along with the decrease of Au thickness, reducing arc radii of Nyquist plot indicate lower interfacial charge transfer resistances, while increasing PL quenching degrees of TiO 2 suggest more effective prevention of charge recombination through radiative pathways.The augmented charge separation inevitably contributes to prolonged carrier lifetimes.As indicated by transient open-circuit voltage decay (OCVD) measurements (Fig. 5e), the average lifetimes of the photogenerated carriers ( n ) were estimated according to the open-circuit voltage (V oc ) decay in the dark as the electron-hole recombination gradually occurred when the light illumination was turned off.As expected, the average lifetime of the carriers follows the same sequence as photocurrent, which is in good agreement with photocatalytic results in CO 2 -to-CO conversion (Fig. 5f). The next question arose as to what in-depth mechanism results in Au thickness dependent charge kinetics behavior.Considering the encapsulation of cubic Pd core with TiO 2 supporter and Au shell in the TiO 2 -PdAu samples, photoexcited electrons in TiO 2 migrate to the surface of Au cocatalyst in larger work function for CO 2 reduction reaction through both TiO 2 PdAu and TiO 2 Au pathways. 60Given the same TiO 2 (001)-Pd(100), Pd(100)-Au(100) and TiO 2 (001)-Au(100) interfaces for electron transfer, the effect of interface structures on photocatalytic properties could be excluded.In addition to the diffusion of photogenerated electrons, previous studies have shown that charge transfer from Pd to Au occurs even without the assistance of external light excitation because of the larger electronegativity of Au (2.5) than that of Pd (2.2), which is in line with the charge re-distribution revealed by XPS results. 6162263 The efficiency of electron migration from Pd to Au may be related to the thickness of Au shell, which may explain the varied charge kinetics behaviors.Previous reports on PdPt core-shell nanostructures This journal is The Royal Society of Chemistry 20xx Please do not adjust margins Please do not adjust margins have revealed that Pt shell dependent interfacial polarization effect steers the flow of electrons from Pd to Pt. 37,38 To confirm the possible mechanism behind this process, we employed firstprinciples simulation to examine the Au thickness dependent charge transfer between Pd and Au.As revealed by the charge density difference (Fig. S8), when Au is in 1 atomic layer, distinct interfacial polarization occurs, leading to the accumulation of a certain number of electrons on the exposed Au surface.However, this interfacial polarization effect dramatically decays with the increase of Au thickness.Given the migration of photogenerated electrons through Pd-Au interface during the photocatalysis process, Fig. 6 illustrates the charge density differences in the presence of one additional electron as a function of Au thickness.It can be clearly seen that the negative charge accumulation on the Au surface follows the same thickness dependence as in the neutral state.Nevertheless, the dependence of the surface electron accumulation on the Au thickness is reduced when a photoelectron is added into Pd.Additional electrons remain on the Au surface as the shell thickness increases from 1 to 4 atomic layers, which explains the superior charge transfer and separation efficiency of TiO 2 -PdAu-1.The interfacial polarization effect serves as an additional driving force for the migration of photo-induced electrons from Pd to unoccupied 5d orbitals of Au.However, there is no denying that the effect of interfacial polarization still becomes weaker with the increase of Au thickness to a certain extent, which cannot well explain the superior photocatalytic activity of TiO 2 -PdAu-2 with 15-layer Au atoms in comparison with those of TiO 2 -PdAu-3 and TiO 2 -Au, implying other factors may also contribute to the Au thickness dependent catalytic performance. Aside from charge separation, surface reactivity is another key factor determining the photocatalytic performance.In comparison with photocurrent response, the difference in photocatalytic activity appears to be more obvious, implying that tunable shell thickness also mediates the surface reaction.Given the exposure of same Au(100) facet, the influence of surface structure of cocatalyst on the catalytic reactivity could be excluded.The only difference in surface strain should be the dominant factor responsible for the enhanced CO 2 -to-CO conversion.To gain an intrinsic understanding of the surface strain on CO 2 -reduction activity, we calculated the Gibbs free energy diagrams for CO 2 reduction into CO under different surface strains.As shown in Fig. 7a and Table S2, the formation of intermediate COOH on Au(100) is the key step in the CO 2 -to-CO conversion, which is associated with an increase in free energy of 0.42 eV under a compressive strain of -4.35.While in the cases under strain of 0 and -1.93, the free energy increases to 0.55 and 0.49 eV, respectively, suggesting the surface compressive strain is beneficial to the formation of COOH.According to the projected d-density of states (PDOS) of surface atoms on Au (100) surfaces (Fig. 7b), d-band center shifts from -3.30 eV to -3.23 eV and then to -3.14 eV with the increase of surface strain from 0 to -1.93 and then to -4.35.The upward shift of d-band center toward the Fermi level results in higher surface electron density and stronger adsorbate bonding of Au (Fig. S9).The changes of Gibbs free energy for the formation of CO are analogous to that of COOH.The hydrogenation of COOH to CO is more favorable on cocatalyst with high surface strain (-0.63 eV) as compared with those with low strain (-0.55 eV) and without strain (-0.51 eV) (Fig. 7a and Table S2).From the viewpoint of reactive kinetics, the energy barriers were calculated to investigate the relationship between surface strain and CO 2 reduction reaction (Fig. S10 andS11).It can be seen that the barrier for the hydrogenation of CO 2 to COOH on Au(100) surface without strain is 1.74 eV, which decreases to 1.49 and 1.20 eV under strain of -1.93 and -4.35, respectively.Furthermore, for the further hydrogenation of COOH to CO, the barriers experience a gradual decline from 0.52 to 0.54 and to 0.47 eV when the strains increase from 0 to -1.93 and to -4.35.Taken together, both the thermodynamic and kinetic analyses confirm the positive correlation between compressive strain and surface reactivity."}, {"llm generation": "TiO 2", "source": "The photocatalytic performance of PdAu cocatalysts integrated with TiO 2 turns out to have a strong correlation with the Au shell thickness.", "context": "In summary, we have demonstrated the synergistic interplay between surface strain and interfacial polarization in photocatalytic CO 2 reduction with PdAu core-shell cocatalyst as a well-defined platform.The photocatalytic performance of PdAu cocatalysts integrated with TiO 2 turns out to have a strong correlation with the Au shell thickness.Remarkably, by substantially reducing the Au thickness into three atomic layers, TiO 2 -PdAu-1 achieves a high selectivity of 90.6 for CO production with an average rate of 166.3 mol g cat -1 h -1 .The combination of experimental analyses and theory simulations reveals that the compressive strain on the Au surface shifts up the d-band center and strengthens the adsorption of key intermediate COOH, while charge polarization promotes interfacial electron transfer from Pd to Au.This work not only offers a method of collaborative utilization of surface strain and interfacial polarization in photocatalysis, but also enables the design of more active and highly selective photocatalysts toward solardriven CO 2 conversion at atomic precision based on the united engineering on surface and interface of cocatalyst. Fig.2(a) High-magnification and (b) Atomic-resolution HAADF-STEM images of a PdAu core-shell nanocrystal in TiO 2 -PdAu-1; (c-e) HAADF-STEM images and corresponding EDS mapping profiles of (c) TiO 2 -PdAu-1, (d) TiO 2 -PdAu-2 and (e) TiO 2 -PdAu-3. Fig. 3 (a) XRD patterns of TiO 2 based samples; (b,c) XPS spectra of TiO 2 based samples: (b) Pd3d Au4d, (c) Au4f high-resolution spectra. Fig. 4 (a) Comparison of the H 2 , CO and CH 4 production rate as well as selectivity for CO production over TiO 2 based photocatalysts under UV light irradiation; (b) activity and selectivity for CO production over TiO 2 -PdAu-1 photocatalyst in five successive cycles; (c) mass spectrum of 13 CO produced over TiO 2 -PdAu-1 under UV light irradiation. Fig. 5 (a) UV-vis diffuse reflectance spectra of TiO 2 based samples; (b) I-t curves of TiO 2 based samples under UV light irradiation; (c) EIS Nyquist plots; (d) PL spectra at 315 nm; (e) transient OCVD measurements after exposure to UV light; (f) average lifetimes of the photogenerated charge carriers ( n ) obtained from transient OCVD measurements. Fig. 7 (a) Free energy change of each elementary step on Au(100) under different surface strains; (b) PDOS of surface atoms on Au(100) surfaces under different surface strains.The calculated d-band centers are marked with black lines. Photocatalytic H 2 , CO, CH 4 and O 2 production rate as well as selectivity for CO production over TiO 2 based photocatalysts under UV light irradiation. This work is supported by the National Natural Science Foundation of China (No. 21603191, 21872125) and Zhejiang Provincial Natural Science Foundation of China (No. LY20B030003, LQ16B010001). There are no conflicts of interest to declare."}], "co-catalyst": [{"llm generation": "Pd@Au core-shell", "source": "Synergism of surface strain and interfacial polarization on Pd@Au core-shell cocatalysts for highly efficient photocatalytic CO 2 reduction over TiO 2 †", "context": "Synergism of surface strain and interfacial polarization on Pd@Au core-shell cocatalysts for highly efficient photocatalytic CO 2 reduction over TiO 2 †"}, {"llm generation": "PdAu core-shell nanostructures", "source": "In this work, with PdAu core-shell nanostructures with tunable Au thickness as model cocatalysts, we demonstrate the synergism of surface strain and interfacial polarization for enhanced photoreduction of CO 2 into CO.", "context": "Solar driven conversion of CO 2 into carbonaceous chemicals is a promising strategy to mitigate greenhouse gas emission and simultaneously store renewable energy.Rational construction of heterostructured cocatalysts represents an efficient method to improve the photocatalytic activity and selectivity in CO 2 reduction.In this work, with PdAu core-shell nanostructures with tunable Au thickness as model cocatalysts, we demonstrate the synergism of surface strain and interfacial polarization for enhanced photoreduction of CO 2 into CO.According to our experimental analysis and theory simulation, resulted from the mismatch in lattice parameters between Pd core and Au shell, compressive strain on the Au surface elevates the d-band center and improves the adsorption of key intermediate COOH.Meanwhile, charge polarization, driven by the difference in electronegativity between Pd and Au, accelerates the interfacial charge transfer and increases the electron density on Au surface.It is found that both effects are dependent on the thickness of Au shell.As a result, three-atom-thick Au shell dramatically boosts the overall efficiency in CO 2 -to-CO conversion with an impressive activity of 166.3 mol g cat -1 h -1 and selectivity of 90.6.This study can be viewed as a means of designing photocatalysts via the simultaneous control of surface catalytic reactivity and interfacial charge transfer in cocatalysts."}, {"llm generation": "PdAu core-shell", "source": "In summary, we have demonstrated the synergistic interplay between surface strain and interfacial polarization in photocatalytic CO 2 reduction with PdAu core-shell cocatalyst as a well-defined platform.", "context": "In summary, we have demonstrated the synergistic interplay between surface strain and interfacial polarization in photocatalytic CO 2 reduction with PdAu core-shell cocatalyst as a well-defined platform.The photocatalytic performance of PdAu cocatalysts integrated with TiO 2 turns out to have a strong correlation with the Au shell thickness.Remarkably, by substantially reducing the Au thickness into three atomic layers, TiO 2 -PdAu-1 achieves a high selectivity of 90.6 for CO production with an average rate of 166.3 mol g cat -1 h -1 .The combination of experimental analyses and theory simulations reveals that the compressive strain on the Au surface shifts up the d-band center and strengthens the adsorption of key intermediate COOH, while charge polarization promotes interfacial electron transfer from Pd to Au.This work not only offers a method of collaborative utilization of surface strain and interfacial polarization in photocatalysis, but also enables the design of more active and highly selective photocatalysts toward solardriven CO 2 conversion at atomic precision based on the united engineering on surface and interface of cocatalyst. Fig.2(a) High-magnification and (b) Atomic-resolution HAADF-STEM images of a PdAu core-shell nanocrystal in TiO 2 -PdAu-1; (c-e) HAADF-STEM images and corresponding EDS mapping profiles of (c) TiO 2 -PdAu-1, (d) TiO 2 -PdAu-2 and (e) TiO 2 -PdAu-3. Fig. 3 (a) XRD patterns of TiO 2 based samples; (b,c) XPS spectra of TiO 2 based samples: (b) Pd3d Au4d, (c) Au4f high-resolution spectra. Fig. 4 (a) Comparison of the H 2 , CO and CH 4 production rate as well as selectivity for CO production over TiO 2 based photocatalysts under UV light irradiation; (b) activity and selectivity for CO production over TiO 2 -PdAu-1 photocatalyst in five successive cycles; (c) mass spectrum of 13 CO produced over TiO 2 -PdAu-1 under UV light irradiation. Fig. 5 (a) UV-vis diffuse reflectance spectra of TiO 2 based samples; (b) I-t curves of TiO 2 based samples under UV light irradiation; (c) EIS Nyquist plots; (d) PL spectra at 315 nm; (e) transient OCVD measurements after exposure to UV light; (f) average lifetimes of the photogenerated charge carriers ( n ) obtained from transient OCVD measurements. Fig. 7 (a) Free energy change of each elementary step on Au(100) under different surface strains; (b) PDOS of surface atoms on Au(100) surfaces under different surface strains.The calculated d-band centers are marked with black lines. Photocatalytic H 2 , CO, CH 4 and O 2 production rate as well as selectivity for CO production over TiO 2 based photocatalysts under UV light irradiation. This work is supported by the National Natural Science Foundation of China (No. 21603191, 21872125) and Zhejiang Provincial Natural Science Foundation of China (No. LY20B030003, LQ16B010001). There are no conflicts of interest to declare."}], "light source": [{"llm generation": "Solar", "source": "Solar driven conversion of CO 2 into carbonaceous chemicals is a promising strategy to mitigate greenhouse gas emission and simultaneously store renewable energy.", "context": "Solar driven conversion of CO 2 into carbonaceous chemicals is a promising strategy to mitigate greenhouse gas emission and simultaneously store renewable energy.Rational construction of heterostructured cocatalysts represents an efficient method to improve the photocatalytic activity and selectivity in CO 2 reduction.In this work, with PdAu core-shell nanostructures with tunable Au thickness as model cocatalysts, we demonstrate the synergism of surface strain and interfacial polarization for enhanced photoreduction of CO 2 into CO.According to our experimental analysis and theory simulation, resulted from the mismatch in lattice parameters between Pd core and Au shell, compressive strain on the Au surface elevates the d-band center and improves the adsorption of key intermediate COOH.Meanwhile, charge polarization, driven by the difference in electronegativity between Pd and Au, accelerates the interfacial charge transfer and increases the electron density on Au surface.It is found that both effects are dependent on the thickness of Au shell.As a result, three-atom-thick Au shell dramatically boosts the overall efficiency in CO 2 -to-CO conversion with an impressive activity of 166.3 mol g cat -1 h -1 and selectivity of 90.6.This study can be viewed as a means of designing photocatalysts via the simultaneous control of surface catalytic reactivity and interfacial charge transfer in cocatalysts."}, {"llm generation": "UV light", "source": "UV light (320 420 nm) was used as the illumination source, which was realized in the presence of a short-wave-pass 420 nm cutoff filter.", "context": "Please do not adjust margins Please do not adjust margins In a typical synthesis of TiO 2 -PdAu, a solution was firstly prepared in a vial as follows: 9.625 mL aqueous solution containing 0.32 g cetyltrimethylammonium chloride (CTAC), 10 L aqueous solution of NaBr (0.01 M), 80 L aqueous solution of HAuCl 4 (10 mM) and 90 L aqueous solution of ascorbic acid (AA, 0.04 M) were mixed at 30 C to obtain a colorless solution.Subsequently, a certain amount of TiO 2 -Pd was added into the mixed solution.The solution in the vial was left undisturbed for 15 min to complete the Au growth.The resultant product was separated by centrifugation, washed with water for four times, and dried at 45 C in a vacuum.TiO 2 -PdAu samples with different Au shells were obtained through altering the amounts of TiO 2 -Pd used, including 4.5, 1.5 and 0.5 mg for the synthesis of TiO 2 -PdAu-1, TiO 2 -PdAu-2 and TiO 2 -PdAu-3, respectively. 3.0 mg as-synthesized products were dispersed in a mixture of 10 L ethanol and 10 L Nafion, which were then uniformly spin-dropped onto at a 1 cm 1 cm indium tin oxide (ITO)-coated glass by a spin coater (SC-1B, China).Subsequently, the ITO-coated glasses were heated at 80 C in a vacuum oven for 1 h.The photocurrents were measured on a CHI 760E electrochemical station (Shanghai Chenhua, China) in ambient conditions under irradiation of a 300 W Xe lamp (Solaredge 700, China).UV light (320 420 nm) was used as the illumination source, which was realized in the presence of a short-wave-pass 420 nm cutoff filter.The power density of the light was measured to be 2.7 mW cm -2 .A three-electrode cell was used to perform the electrochemical measurements.The working electrode was the ITO-coated glass.A Ag/AgCl electrode and Pt foil were used as the reference electrode and counter electrode, respectively.The three electrodes were inserted in a quartz cell filled with 0.5 M Na 2 SO 4 electrolyte.The photoresponse of the prepared photoelectrodes (i.e., I-t) was operated by measuring the photocurrent density under chopped light irradiation (light on/off cycles: 60 s) at a bias potential of 0.4 V vs. Ag/AgCl for 400 s.Electrochemical impedance spectroscopy (EIS) was performed in the 10 -1 to 10 5 Hz frequency range with an AC voltage amplitude of 10 mV at an applied potential of 0.4 V vs. Ag/AgCl.The transient open-circuit voltage decay (OCVD) was measured for a total of 800 s under UV light irradiation, and the light was switched on and off 100 and 400 s from the start, respectively.The average lifetime of the photogenerated carriers ( n ) was obtained according to the OCVD using the following equation: where K B is the Boltzmann constant, T is the temperature (in Kelvin), and q is the unsigned charge of an electron. To investigate the photocatalytic activities of TiO 2 -based photocatalysts for CO 2 reduction, 15 mg of photocatalysts were dispersed on the flat glass plate at the bottom of photocatalytic reactor.And 5 mL H 2 O was added and surrounded the plate.Prior to the test, the reactor loaded with catalyst was first purged with high purity CO 2 (0.15 MPa) for 20 min.Then the light-irradiation experiment was performed by using a 300 W Xe lamp with UV light as the illumination source.The power density of UV light (320 420 nm) was measured to be 2.7 mW cm -2 .The photocatalytic reaction was performed under irradiation of UV light with stirring at 300 rpm for 4 h.After completion of the reaction, the gaseous mixture was analyzed using a gas chromatograph (GC-2014, Ar carrier, Shimadzu) with Ar as the carrier gas.The amount of H 2 and O 2 was determined using a thermal conductivity detector (TCD).The amount of CH 4 was measured by using a flame ionization detector (FID).The amount of CO was converted to CH 4 by using a methanation reactor and then analyzed by using the FID.After the reaction was completed, the sample was collected by centrifugation at 8000 rpm for 5 min.During the stability test, the photocatalyst with the best performance was collected after each run and then reused for photoreduction of CO 2 .The photocatalyst was heat treated at 160 C for 3 h after the runs before its reusing.The isotope-labeling experiments were performed using 13 CO 2 instead of 12 CO 2 , and the products were analyzed using gas chromatographymass spectrometry (7890B/5977A, Agilent).Visible photocatalytic performance was measured under the same experimental condition except that both long-wave-pass 420-nm and short-wave-pass 780nm cutoff filters (420 780 nm ) were used instead of shortwave-pass 420 nm ( 420 nm) cutoff filter."}, {"llm generation": "UV", "source": "The TiO 2 based samples were used as photocatalysts in the mixed vapor of CO 2 and H 2 O under UV light irradiation (320 420 nm), and the products were analyzed by gas chromatography.", "context": "In the proof-of-concept design, TiO 2 nanosheets were used as a model semiconductor, which were synthesized according to a literature procedure (Fig. S1). 42As revealed by transmission electron microscopy (TEM) and high-resolution TEM (HRTEM) images, TiO 2 nanosheets with an edge length of approximately 200 nm and thickness below 10 nm are monocrystalline structure dominated with (001) facet (Fig. S2).The large flat surface of the nanosheets facilitates the loading of cocatalyst, while low thickness shortens the electron migration distance to cocatalysts.Secondly, Pd nanocrystals were in situ grown on TiO 2 by reducing K 2 PdCl 4 with ascorbic acid (AA) (Fig. S1).With KBr as a facet-selective capping agent, cubic Pd nanocrystals with an average edge length of 10.6 nm are uniformly distributed on the flat surface of TiO 2 (Fig. S3a,b). 43s revealed by TEM image with a standing-up TiO 2 nanosheet, Pd nanocubes are integrated with TiO 2 nanosheets through facet-tofacet contact (Fig. S3c).As a result, TiO 2 -Pd interfaces with large area guarantee the stability of the supported structure and efficiency of interfacial charge transfer.HRTEM image of Pd shows continuous lattice fringes with a spacing of 1.95 A, implying monocrystalline nanostructures enclosed by six (100) facets (Fig. S3d). In the third step, Pd nanocubes were coated by Au shell with tunable thickness via the reduction of HAuCl 4 with AA (Fig. S1). 29iven the larger lattice mismatch between Pd and TiO 2 , Au selectively wet the Pd surface through an epitaxial growth mode to minimize the interfacial energy. 44Fig. 1a andb show TEM images of as-obtained TiO 2 -PdAu-1 with smaller Au/TiO 2 -Pd ratio.It can be clearly seen that PdAu core-shell nanostructures dispersed on TiO 2 nanosheets inherit the cubic profile shape with truncated corners.Especially, resulted from the higher electron density of Au than that of Pd, there is an image contrast between inner grey black Pd and exterior deep black Au.The Au shell is determined to be around 0.6 nm in thickness, which is also a piece of single crystal enclosed by (100) facets as revealed by HRTEM image, forming perfect Pd(100)-Au(100) interfaces with existing Pd core (Fig. 1c).The number of Au atomic layers is three and the interatomic spacing of the Au-Au pairs is 1.96 A, 4.35 smaller than that of pure Au (2.05 A), suggesting that compressive residual strains are developed in the 0.6 nm thick Au shell.This argument is further supported by the aberration-corrected high-angle annular dark-field scanning TEM (HAADF-STEM) images taken from an individual core-shell nanocube (Fig. 2a,b).The elemental distributions in the as-obtained a N.D. not detected. together with corresponding energy-dispersive spectroscopy (EDS) mapping profiles (Fig. 2c). With the further increase of Au/TiO 2 -Pd ratio, TiO 2 -PdAu samples with higher thicknesses of Au shell were obtained.As shown in Fig. 1d,e,g,h, the shell thickness of deep black Au increases to around 3 nm for TiO 2 -PdAu-2 and then to 7 nm for TiO 2 -PdAu-3 on average.As the shell thickness increases, the corner of PdAu core-shell nanocrystals becomes more round and the morphology tends to be more irregular.According to HRTEM images (Fig. 1f andi), the planes of Au shell also share the same orientation with Pd cores, contributing to the construction of PdAu core-shell nanostructure with Au(100) surfaces and Pd(100)-Au(100) interfaces.The numbers of Au atomic layers are estimated to be 15 and 34, and lattice spacings in Au shell are measured to be 2.01 and 2.05 A for the TiO 2 -PdAu-2 and TiO 2 -PdAu-3, respectively.The above results imply that the compressive strains along the directions parallel to the exposed (100) planes of Pd nanocrystals gradually reduce as the Au thickness increases.For TiO 2 -PdAu-2, 3 nm Au shell is also under compression with a 1.93 lattice strain.When the shell thickness becomes greater than 7 nm, the compressive strain on the Au shell reduces to the level of that of bulk Au.The morphological evolution of PdAu nanocrystals along with the increase of Au thickness could also be clearly seen from STEM images and EDS mapping profiles (Fig. 2d ande).It should be noted that as one plane of Pd nanocubes in the TiO 2 -PdAu samples is in intimate contact with TiO 2 , only five planes are covered by Au to form stack structures, which can be verified by the TEM images with standing-up TiO 2 nanosheets (inset of Fig. 1b,e,h).Additionally, with the deposition of single crystalline Au nanocubes enclosed by (100) planes on TiO 2 nanosheets via facet-tofacet contact, TiO 2 -Au is also fabricated as a reference sample (Fig. S4). The structures of as-obtained samples were further characterized by X-ray powder diffraction (XRD) patterns.As shown in Fig. 3a, in addition to the peaks of anatase phase of TiO 2 (JCPDS no.21-1272), all other peaks can be ascribed to face-centered cubic (fcc) Pd (JCPDS no.65-2867) and Au (JCPDS no.65-2870).In comparison with the pattern of TiO 2 -Pd, no additional Au peak can be observed in TiO 2 -PdAu-1, except a slight leftward broadening of Pd peaks.These results indicate that the lattice parameter of ultrathin Au layers is similar to that of Pd, further suggesting the compression of Au lattice. 33As the Au thickness increasing, characteristic peaks of Au appear in TiO 2 -PdAu-2 and TiO 2 -PdAu-3, and the intensities of which gradually increase while the positions shift to lower angles, implying the increased lattice spacing of Au shell.The positions of Au peaks in TiO 2 -PdAu-3 are close to those in TiO 2 -Au, again proving that Au is nearly free from residual strain. X-ray photoelectron spectra (XPS) were then used to collect the surface composition information of the samples.Survey spectra further confirm the presence of Pd and Au, along with Ti and O in the TiO 2 -PdAu samples (Fig. S5).In the spectrum of Pd3d and This journal is The Royal Society of Chemistry 20xx Please do not adjust margins Please do not adjust margins with zero-valence Pd and Au, respectively, while small amounts of Pd (II) states are also detected and shown as doublets (336.6/342.0eV), which are typical features for solution-synthesized Pd (Fig. 3b andc).It is worth noting that Au4d 5/2 signal at 335.4 eV is overlapped with Pd3d spectrum (Fig. 3b and Fig. S5).Owing to the limited detection depth of XPS, with the increase of Au shell thickness, Au4d and Au4f signals become stronger while Pd3d signal gradually weakens.More importantly, Pd3d and Au4d/Au4f peaks shift to higher and lower binding energy compared with those of TiO 2 -Pd and TiO 2 -Au, respectively, suggesting electron-deficient Pd and electron-rich Au. 29,45 What's more, more obvious shifts occur when Au shell of TiO 2 -PdAu is thinner, suggesting more significant charge re-distribution between them. Upon acquiring the structure and composition information of the samples, we are in a position to investigate their photocatalytic performance in CO 2 reduction.The TiO 2 based samples were used as photocatalysts in the mixed vapor of CO 2 and H 2 O under UV light irradiation (320 420 nm), and the products were analyzed by gas chromatography.As shown in Fig. 4a, it can be clearly seen that the loading of metal significantly improves the photocatalytic activity of TiO 2 .Moreover, the yields of reduction products show a strong correlation with the type of metal, which should be related to the functions of cocatalysts.The reduction product over TiO 2 -Pd is dominant H 2 with trace amounts of CO and CH 4 .With the further deposition of Au on Pd, the side reaction of H 2 evolution is effectively inhibited, while CO yield is remarkably improved.According to previous reports, 35,46 water splitting prefers to occur on Pd(100) plane, while Au exhibits high activity and selectivity in conversion of CO 2 to CO due to the weak Au-CO binding energy.More importantly, the average CO production rates are greatly dependent on the thickness of Au shell.With the thinnest Au shell, TiO 2 -PdAu-1 achieves an impressive value of 166.3 mol g cat -1 h -1 , 97.8 and 75.6-fold times higher than those of TiO 2 and TiO 2 -Pd, respectively (Table 1).With the increase of Au thickness, CO evolution rate falls to 38.4 and 14.8 mol g cat -1 h -1 for TiO 2 -PdAu-2 and TiO 2 -PdAu-3, respectively, superior to that of TiO 2 -Au.For TiO 2 -PdAu samples, the selectivity for CO production follows a same order as the CO evolution rate (Fig. 4a), which is calculated according to the average evolution rates of reduction products as well as the electrons required to generate products using the following equation: CO selectivity() 2(CO)/2(H 2 ) 2(CO) 8(CH 4 ) 100 TiO 2 -PdAu-1 exhibits the highest selectivity of 90.6, which drops to 68.9 for TiO 2 -PdAu-2, and then to 53.8 for TiO 2 -PdAu-3, almost close to that of TiO 2 -Au (52.9) (Table 1). The photocatalytic performance of TiO 2 -PdAu-1 also outperforms those of reported state-of-the-art Au cocatalysts supported by TiO 2 measured under comparative conditions (Table S1). 29,47488495051 Moreover, after five 4 h of cycling test, TiO 2 -PdAu-1 still maintain efficient activity and selectivity in CO evolution (Fig. 4b).As revealed by the TEM, XRD and XPS of TiO 2 -PdAu-1 after long-term testing, the excellent durability can be ascribed to the well-maintained structure and composition of the catalyst (Fig. S6 andS7).It should be noted that O 2 as an oxidation product was also detected in the photocatalytic reaction, suggesting the occurrence of H 2 O 2h 1/2O 2 2H (Table 1).Moreover, no low-carbon product was detected in the control experiments including without photocatalyst, in the dark or in Ar atmosphere, confirming that CO Please do not adjust margins Please do not adjust margins was actually originated from photoreduction of CO 2 rather than adsorbed carbon species (Table 1).To further confirm this, the 13 C Fig. 6 Differential charge density determined by first-principles simulations for the Au(100) shells on Pd(100) substrates in the presence of one additional electron (subtracting the charges in the neutral case (Fig. S8) from this system).The Au shell thickness is altered from 1 to 4 layers.The olive and cyan colors represent an increase and decrease in electron density, respectively.isotope labeling experiment was performed over TiO 2 -PdAu-1 using 13 CO 2 as a substrate to explore the source of carbon.As shown in Fig. 4c, the strong signal at m/z 29 can be assigned to 13 CO, suggesting that the carbon source of CO is derived from the used CO 2 .Besides of CO, CH 4 evolution rate of TiO 2 -PdAu gradually increases with the reduction of Au thickness, while H 2 production rate gradually decreases, suggesting that it is possible to totally suppress H 2 evolution when the Au shell is further shrunk into monolayer (Table 1). 9,52,53hen the photocatalytic performance of TiO 2 -PdAu samples was measured under visible light irradiation (420 780 nm), no obvious product was detected for TiO 2 -PdAu-1, while TiO 2 -PdAu-2 and TiO 2 -PdAu-3 produced trace amounts of H 2 and CO.The main reason is that the plasmonic absorption of three-atom-thick Au shell in TiO 2 -PdAu-1 is too weak to generate hot electrons and inject them into the conduction band of TiO 2 for surface reduction reaction through AuTiO 2 and AuPdTiO 2 routes. 54,55otocatalytic mechanism study It is natural to ask what factor is responsible for the Au thicknessdependent photocatalytic performance?To decode the underlying mechanism, charge kinetics is first taken into consideration, which plays a key role in the photocatalytic processes. 56,57As the driven force of photocatalysis, light harvesting behaviors of the samples were evaluated by UV-vis diffuse reflectance spectra.As shown in Fig. 5a, the loading of metal does not alter the light absorption of TiO 2 in UV region.The varied visible absorption behaviors are mainly attributed to plasmonic band of Au as well as interband absorption of nonplasmonic Pd. 43,58,59 Given the comparable light absorption in UV region, photocurrent response offers an informative evaluation of the electron-hole separation efficiency.As indicated by photocurrent versus time (I-t) curves in Fig. 5b, the addition of metal significantly boosts the photocurrent density of TiO 2 , confirming the role of cocatalyst in preventing charge recombination in TiO 2 .Moreover, various metal cocatalysts show obviously different photocurrent enhancement, which turns out to be in the order: TiO 2 -Pd TiO 2 -Au TiO 2 -PdAu-3 TiO 2 -PdAu-2 TiO 2 -PdAu-1, demonstrating that low thickness of Au shell is beneficial to charge separation.This statement is also confirmed by electrochemical impedance spectra (EIS) and photoluminescence (PL) emission spectra (Fig. 5c andd).Along with the decrease of Au thickness, reducing arc radii of Nyquist plot indicate lower interfacial charge transfer resistances, while increasing PL quenching degrees of TiO 2 suggest more effective prevention of charge recombination through radiative pathways.The augmented charge separation inevitably contributes to prolonged carrier lifetimes.As indicated by transient open-circuit voltage decay (OCVD) measurements (Fig. 5e), the average lifetimes of the photogenerated carriers ( n ) were estimated according to the open-circuit voltage (V oc ) decay in the dark as the electron-hole recombination gradually occurred when the light illumination was turned off.As expected, the average lifetime of the carriers follows the same sequence as photocurrent, which is in good agreement with photocatalytic results in CO 2 -to-CO conversion (Fig. 5f). The next question arose as to what in-depth mechanism results in Au thickness dependent charge kinetics behavior.Considering the encapsulation of cubic Pd core with TiO 2 supporter and Au shell in the TiO 2 -PdAu samples, photoexcited electrons in TiO 2 migrate to the surface of Au cocatalyst in larger work function for CO 2 reduction reaction through both TiO 2 PdAu and TiO 2 Au pathways. 60Given the same TiO 2 (001)-Pd(100), Pd(100)-Au(100) and TiO 2 (001)-Au(100) interfaces for electron transfer, the effect of interface structures on photocatalytic properties could be excluded.In addition to the diffusion of photogenerated electrons, previous studies have shown that charge transfer from Pd to Au occurs even without the assistance of external light excitation because of the larger electronegativity of Au (2.5) than that of Pd (2.2), which is in line with the charge re-distribution revealed by XPS results. 6162263 The efficiency of electron migration from Pd to Au may be related to the thickness of Au shell, which may explain the varied charge kinetics behaviors.Previous reports on PdPt core-shell nanostructures This journal is The Royal Society of Chemistry 20xx Please do not adjust margins Please do not adjust margins have revealed that Pt shell dependent interfacial polarization effect steers the flow of electrons from Pd to Pt. 37,38 To confirm the possible mechanism behind this process, we employed firstprinciples simulation to examine the Au thickness dependent charge transfer between Pd and Au.As revealed by the charge density difference (Fig. S8), when Au is in 1 atomic layer, distinct interfacial polarization occurs, leading to the accumulation of a certain number of electrons on the exposed Au surface.However, this interfacial polarization effect dramatically decays with the increase of Au thickness.Given the migration of photogenerated electrons through Pd-Au interface during the photocatalysis process, Fig. 6 illustrates the charge density differences in the presence of one additional electron as a function of Au thickness.It can be clearly seen that the negative charge accumulation on the Au surface follows the same thickness dependence as in the neutral state.Nevertheless, the dependence of the surface electron accumulation on the Au thickness is reduced when a photoelectron is added into Pd.Additional electrons remain on the Au surface as the shell thickness increases from 1 to 4 atomic layers, which explains the superior charge transfer and separation efficiency of TiO 2 -PdAu-1.The interfacial polarization effect serves as an additional driving force for the migration of photo-induced electrons from Pd to unoccupied 5d orbitals of Au.However, there is no denying that the effect of interfacial polarization still becomes weaker with the increase of Au thickness to a certain extent, which cannot well explain the superior photocatalytic activity of TiO 2 -PdAu-2 with 15-layer Au atoms in comparison with those of TiO 2 -PdAu-3 and TiO 2 -Au, implying other factors may also contribute to the Au thickness dependent catalytic performance. Aside from charge separation, surface reactivity is another key factor determining the photocatalytic performance.In comparison with photocurrent response, the difference in photocatalytic activity appears to be more obvious, implying that tunable shell thickness also mediates the surface reaction.Given the exposure of same Au(100) facet, the influence of surface structure of cocatalyst on the catalytic reactivity could be excluded.The only difference in surface strain should be the dominant factor responsible for the enhanced CO 2 -to-CO conversion.To gain an intrinsic understanding of the surface strain on CO 2 -reduction activity, we calculated the Gibbs free energy diagrams for CO 2 reduction into CO under different surface strains.As shown in Fig. 7a and Table S2, the formation of intermediate COOH on Au(100) is the key step in the CO 2 -to-CO conversion, which is associated with an increase in free energy of 0.42 eV under a compressive strain of -4.35.While in the cases under strain of 0 and -1.93, the free energy increases to 0.55 and 0.49 eV, respectively, suggesting the surface compressive strain is beneficial to the formation of COOH.According to the projected d-density of states (PDOS) of surface atoms on Au (100) surfaces (Fig. 7b), d-band center shifts from -3.30 eV to -3.23 eV and then to -3.14 eV with the increase of surface strain from 0 to -1.93 and then to -4.35.The upward shift of d-band center toward the Fermi level results in higher surface electron density and stronger adsorbate bonding of Au (Fig. S9).The changes of Gibbs free energy for the formation of CO are analogous to that of COOH.The hydrogenation of COOH to CO is more favorable on cocatalyst with high surface strain (-0.63 eV) as compared with those with low strain (-0.55 eV) and without strain (-0.51 eV) (Fig. 7a and Table S2).From the viewpoint of reactive kinetics, the energy barriers were calculated to investigate the relationship between surface strain and CO 2 reduction reaction (Fig. S10 andS11).It can be seen that the barrier for the hydrogenation of CO 2 to COOH on Au(100) surface without strain is 1.74 eV, which decreases to 1.49 and 1.20 eV under strain of -1.93 and -4.35, respectively.Furthermore, for the further hydrogenation of COOH to CO, the barriers experience a gradual decline from 0.52 to 0.54 and to 0.47 eV when the strains increase from 0 to -1.93 and to -4.35.Taken together, both the thermodynamic and kinetic analyses confirm the positive correlation between compressive strain and surface reactivity."}, {"llm generation": "UV", "source": "Fig. 4 (a) Comparison of the H 2 , CO and CH 4 production rate as well as selectivity for CO production over TiO 2 based photocatalysts under UV light irradiation;", "context": "In summary, we have demonstrated the synergistic interplay between surface strain and interfacial polarization in photocatalytic CO 2 reduction with PdAu core-shell cocatalyst as a well-defined platform.The photocatalytic performance of PdAu cocatalysts integrated with TiO 2 turns out to have a strong correlation with the Au shell thickness.Remarkably, by substantially reducing the Au thickness into three atomic layers, TiO 2 -PdAu-1 achieves a high selectivity of 90.6 for CO production with an average rate of 166.3 mol g cat -1 h -1 .The combination of experimental analyses and theory simulations reveals that the compressive strain on the Au surface shifts up the d-band center and strengthens the adsorption of key intermediate COOH, while charge polarization promotes interfacial electron transfer from Pd to Au.This work not only offers a method of collaborative utilization of surface strain and interfacial polarization in photocatalysis, but also enables the design of more active and highly selective photocatalysts toward solardriven CO 2 conversion at atomic precision based on the united engineering on surface and interface of cocatalyst. Fig.2(a) High-magnification and (b) Atomic-resolution HAADF-STEM images of a PdAu core-shell nanocrystal in TiO 2 -PdAu-1; (c-e) HAADF-STEM images and corresponding EDS mapping profiles of (c) TiO 2 -PdAu-1, (d) TiO 2 -PdAu-2 and (e) TiO 2 -PdAu-3. Fig. 3 (a) XRD patterns of TiO 2 based samples; (b,c) XPS spectra of TiO 2 based samples: (b) Pd3d Au4d, (c) Au4f high-resolution spectra. Fig. 4 (a) Comparison of the H 2 , CO and CH 4 production rate as well as selectivity for CO production over TiO 2 based photocatalysts under UV light irradiation; (b) activity and selectivity for CO production over TiO 2 -PdAu-1 photocatalyst in five successive cycles; (c) mass spectrum of 13 CO produced over TiO 2 -PdAu-1 under UV light irradiation. Fig. 5 (a) UV-vis diffuse reflectance spectra of TiO 2 based samples; (b) I-t curves of TiO 2 based samples under UV light irradiation; (c) EIS Nyquist plots; (d) PL spectra at 315 nm; (e) transient OCVD measurements after exposure to UV light; (f) average lifetimes of the photogenerated charge carriers ( n ) obtained from transient OCVD measurements. Fig. 7 (a) Free energy change of each elementary step on Au(100) under different surface strains; (b) PDOS of surface atoms on Au(100) surfaces under different surface strains.The calculated d-band centers are marked with black lines. Photocatalytic H 2 , CO, CH 4 and O 2 production rate as well as selectivity for CO production over TiO 2 based photocatalysts under UV light irradiation. This work is supported by the National Natural Science Foundation of China (No. 21603191, 21872125) and Zhejiang Provincial Natural Science Foundation of China (No. LY20B030003, LQ16B010001). There are no conflicts of interest to declare."}], "lamp": [{"llm generation": "Xe lamp", "source": "The photocurrents were measured on a CHI 760E electrochemical station (Shanghai Chenhua, China) in ambient conditions under irradiation of a 300 W Xe lamp (Solaredge 700, China).", "context": "Please do not adjust margins Please do not adjust margins In a typical synthesis of TiO 2 -PdAu, a solution was firstly prepared in a vial as follows: 9.625 mL aqueous solution containing 0.32 g cetyltrimethylammonium chloride (CTAC), 10 L aqueous solution of NaBr (0.01 M), 80 L aqueous solution of HAuCl 4 (10 mM) and 90 L aqueous solution of ascorbic acid (AA, 0.04 M) were mixed at 30 C to obtain a colorless solution.Subsequently, a certain amount of TiO 2 -Pd was added into the mixed solution.The solution in the vial was left undisturbed for 15 min to complete the Au growth.The resultant product was separated by centrifugation, washed with water for four times, and dried at 45 C in a vacuum.TiO 2 -PdAu samples with different Au shells were obtained through altering the amounts of TiO 2 -Pd used, including 4.5, 1.5 and 0.5 mg for the synthesis of TiO 2 -PdAu-1, TiO 2 -PdAu-2 and TiO 2 -PdAu-3, respectively. 3.0 mg as-synthesized products were dispersed in a mixture of 10 L ethanol and 10 L Nafion, which were then uniformly spin-dropped onto at a 1 cm 1 cm indium tin oxide (ITO)-coated glass by a spin coater (SC-1B, China).Subsequently, the ITO-coated glasses were heated at 80 C in a vacuum oven for 1 h.The photocurrents were measured on a CHI 760E electrochemical station (Shanghai Chenhua, China) in ambient conditions under irradiation of a 300 W Xe lamp (Solaredge 700, China).UV light (320 420 nm) was used as the illumination source, which was realized in the presence of a short-wave-pass 420 nm cutoff filter.The power density of the light was measured to be 2.7 mW cm -2 .A three-electrode cell was used to perform the electrochemical measurements.The working electrode was the ITO-coated glass.A Ag/AgCl electrode and Pt foil were used as the reference electrode and counter electrode, respectively.The three electrodes were inserted in a quartz cell filled with 0.5 M Na 2 SO 4 electrolyte.The photoresponse of the prepared photoelectrodes (i.e., I-t) was operated by measuring the photocurrent density under chopped light irradiation (light on/off cycles: 60 s) at a bias potential of 0.4 V vs. Ag/AgCl for 400 s.Electrochemical impedance spectroscopy (EIS) was performed in the 10 -1 to 10 5 Hz frequency range with an AC voltage amplitude of 10 mV at an applied potential of 0.4 V vs. Ag/AgCl.The transient open-circuit voltage decay (OCVD) was measured for a total of 800 s under UV light irradiation, and the light was switched on and off 100 and 400 s from the start, respectively.The average lifetime of the photogenerated carriers ( n ) was obtained according to the OCVD using the following equation: where K B is the Boltzmann constant, T is the temperature (in Kelvin), and q is the unsigned charge of an electron. To investigate the photocatalytic activities of TiO 2 -based photocatalysts for CO 2 reduction, 15 mg of photocatalysts were dispersed on the flat glass plate at the bottom of photocatalytic reactor.And 5 mL H 2 O was added and surrounded the plate.Prior to the test, the reactor loaded with catalyst was first purged with high purity CO 2 (0.15 MPa) for 20 min.Then the light-irradiation experiment was performed by using a 300 W Xe lamp with UV light as the illumination source.The power density of UV light (320 420 nm) was measured to be 2.7 mW cm -2 .The photocatalytic reaction was performed under irradiation of UV light with stirring at 300 rpm for 4 h.After completion of the reaction, the gaseous mixture was analyzed using a gas chromatograph (GC-2014, Ar carrier, Shimadzu) with Ar as the carrier gas.The amount of H 2 and O 2 was determined using a thermal conductivity detector (TCD).The amount of CH 4 was measured by using a flame ionization detector (FID).The amount of CO was converted to CH 4 by using a methanation reactor and then analyzed by using the FID.After the reaction was completed, the sample was collected by centrifugation at 8000 rpm for 5 min.During the stability test, the photocatalyst with the best performance was collected after each run and then reused for photoreduction of CO 2 .The photocatalyst was heat treated at 160 C for 3 h after the runs before its reusing.The isotope-labeling experiments were performed using 13 CO 2 instead of 12 CO 2 , and the products were analyzed using gas chromatographymass spectrometry (7890B/5977A, Agilent).Visible photocatalytic performance was measured under the same experimental condition except that both long-wave-pass 420-nm and short-wave-pass 780nm cutoff filters (420 780 nm ) were used instead of shortwave-pass 420 nm ( 420 nm) cutoff filter."}], "reaction medium": [{"llm generation": "Liquid", "source": "The three electrodes were inserted in a quartz cell filled with 0.5 M Na 2 SO 4 electrolyte.", "context": "Please do not adjust margins Please do not adjust margins In a typical synthesis of TiO 2 -PdAu, a solution was firstly prepared in a vial as follows: 9.625 mL aqueous solution containing 0.32 g cetyltrimethylammonium chloride (CTAC), 10 L aqueous solution of NaBr (0.01 M), 80 L aqueous solution of HAuCl 4 (10 mM) and 90 L aqueous solution of ascorbic acid (AA, 0.04 M) were mixed at 30 C to obtain a colorless solution.Subsequently, a certain amount of TiO 2 -Pd was added into the mixed solution.The solution in the vial was left undisturbed for 15 min to complete the Au growth.The resultant product was separated by centrifugation, washed with water for four times, and dried at 45 C in a vacuum.TiO 2 -PdAu samples with different Au shells were obtained through altering the amounts of TiO 2 -Pd used, including 4.5, 1.5 and 0.5 mg for the synthesis of TiO 2 -PdAu-1, TiO 2 -PdAu-2 and TiO 2 -PdAu-3, respectively. 3.0 mg as-synthesized products were dispersed in a mixture of 10 L ethanol and 10 L Nafion, which were then uniformly spin-dropped onto at a 1 cm 1 cm indium tin oxide (ITO)-coated glass by a spin coater (SC-1B, China).Subsequently, the ITO-coated glasses were heated at 80 C in a vacuum oven for 1 h.The photocurrents were measured on a CHI 760E electrochemical station (Shanghai Chenhua, China) in ambient conditions under irradiation of a 300 W Xe lamp (Solaredge 700, China).UV light (320 420 nm) was used as the illumination source, which was realized in the presence of a short-wave-pass 420 nm cutoff filter.The power density of the light was measured to be 2.7 mW cm -2 .A three-electrode cell was used to perform the electrochemical measurements.The working electrode was the ITO-coated glass.A Ag/AgCl electrode and Pt foil were used as the reference electrode and counter electrode, respectively.The three electrodes were inserted in a quartz cell filled with 0.5 M Na 2 SO 4 electrolyte.The photoresponse of the prepared photoelectrodes (i.e., I-t) was operated by measuring the photocurrent density under chopped light irradiation (light on/off cycles: 60 s) at a bias potential of 0.4 V vs. Ag/AgCl for 400 s.Electrochemical impedance spectroscopy (EIS) was performed in the 10 -1 to 10 5 Hz frequency range with an AC voltage amplitude of 10 mV at an applied potential of 0.4 V vs. Ag/AgCl.The transient open-circuit voltage decay (OCVD) was measured for a total of 800 s under UV light irradiation, and the light was switched on and off 100 and 400 s from the start, respectively.The average lifetime of the photogenerated carriers ( n ) was obtained according to the OCVD using the following equation: where K B is the Boltzmann constant, T is the temperature (in Kelvin), and q is the unsigned charge of an electron. To investigate the photocatalytic activities of TiO 2 -based photocatalysts for CO 2 reduction, 15 mg of photocatalysts were dispersed on the flat glass plate at the bottom of photocatalytic reactor.And 5 mL H 2 O was added and surrounded the plate.Prior to the test, the reactor loaded with catalyst was first purged with high purity CO 2 (0.15 MPa) for 20 min.Then the light-irradiation experiment was performed by using a 300 W Xe lamp with UV light as the illumination source.The power density of UV light (320 420 nm) was measured to be 2.7 mW cm -2 .The photocatalytic reaction was performed under irradiation of UV light with stirring at 300 rpm for 4 h.After completion of the reaction, the gaseous mixture was analyzed using a gas chromatograph (GC-2014, Ar carrier, Shimadzu) with Ar as the carrier gas.The amount of H 2 and O 2 was determined using a thermal conductivity detector (TCD).The amount of CH 4 was measured by using a flame ionization detector (FID).The amount of CO was converted to CH 4 by using a methanation reactor and then analyzed by using the FID.After the reaction was completed, the sample was collected by centrifugation at 8000 rpm for 5 min.During the stability test, the photocatalyst with the best performance was collected after each run and then reused for photoreduction of CO 2 .The photocatalyst was heat treated at 160 C for 3 h after the runs before its reusing.The isotope-labeling experiments were performed using 13 CO 2 instead of 12 CO 2 , and the products were analyzed using gas chromatographymass spectrometry (7890B/5977A, Agilent).Visible photocatalytic performance was measured under the same experimental condition except that both long-wave-pass 420-nm and short-wave-pass 780nm cutoff filters (420 780 nm ) were used instead of shortwave-pass 420 nm ( 420 nm) cutoff filter."}, {"llm generation": "Gas", "source": "Prior to the test, the reactor loaded with catalyst was first purged with high purity CO 2 (0.15 MPa) for 20 min.", "context": "Please do not adjust margins Please do not adjust margins In a typical synthesis of TiO 2 -PdAu, a solution was firstly prepared in a vial as follows: 9.625 mL aqueous solution containing 0.32 g cetyltrimethylammonium chloride (CTAC), 10 L aqueous solution of NaBr (0.01 M), 80 L aqueous solution of HAuCl 4 (10 mM) and 90 L aqueous solution of ascorbic acid (AA, 0.04 M) were mixed at 30 C to obtain a colorless solution.Subsequently, a certain amount of TiO 2 -Pd was added into the mixed solution.The solution in the vial was left undisturbed for 15 min to complete the Au growth.The resultant product was separated by centrifugation, washed with water for four times, and dried at 45 C in a vacuum.TiO 2 -PdAu samples with different Au shells were obtained through altering the amounts of TiO 2 -Pd used, including 4.5, 1.5 and 0.5 mg for the synthesis of TiO 2 -PdAu-1, TiO 2 -PdAu-2 and TiO 2 -PdAu-3, respectively. 3.0 mg as-synthesized products were dispersed in a mixture of 10 L ethanol and 10 L Nafion, which were then uniformly spin-dropped onto at a 1 cm 1 cm indium tin oxide (ITO)-coated glass by a spin coater (SC-1B, China).Subsequently, the ITO-coated glasses were heated at 80 C in a vacuum oven for 1 h.The photocurrents were measured on a CHI 760E electrochemical station (Shanghai Chenhua, China) in ambient conditions under irradiation of a 300 W Xe lamp (Solaredge 700, China).UV light (320 420 nm) was used as the illumination source, which was realized in the presence of a short-wave-pass 420 nm cutoff filter.The power density of the light was measured to be 2.7 mW cm -2 .A three-electrode cell was used to perform the electrochemical measurements.The working electrode was the ITO-coated glass.A Ag/AgCl electrode and Pt foil were used as the reference electrode and counter electrode, respectively.The three electrodes were inserted in a quartz cell filled with 0.5 M Na 2 SO 4 electrolyte.The photoresponse of the prepared photoelectrodes (i.e., I-t) was operated by measuring the photocurrent density under chopped light irradiation (light on/off cycles: 60 s) at a bias potential of 0.4 V vs. Ag/AgCl for 400 s.Electrochemical impedance spectroscopy (EIS) was performed in the 10 -1 to 10 5 Hz frequency range with an AC voltage amplitude of 10 mV at an applied potential of 0.4 V vs. Ag/AgCl.The transient open-circuit voltage decay (OCVD) was measured for a total of 800 s under UV light irradiation, and the light was switched on and off 100 and 400 s from the start, respectively.The average lifetime of the photogenerated carriers ( n ) was obtained according to the OCVD using the following equation: where K B is the Boltzmann constant, T is the temperature (in Kelvin), and q is the unsigned charge of an electron. To investigate the photocatalytic activities of TiO 2 -based photocatalysts for CO 2 reduction, 15 mg of photocatalysts were dispersed on the flat glass plate at the bottom of photocatalytic reactor.And 5 mL H 2 O was added and surrounded the plate.Prior to the test, the reactor loaded with catalyst was first purged with high purity CO 2 (0.15 MPa) for 20 min.Then the light-irradiation experiment was performed by using a 300 W Xe lamp with UV light as the illumination source.The power density of UV light (320 420 nm) was measured to be 2.7 mW cm -2 .The photocatalytic reaction was performed under irradiation of UV light with stirring at 300 rpm for 4 h.After completion of the reaction, the gaseous mixture was analyzed using a gas chromatograph (GC-2014, Ar carrier, Shimadzu) with Ar as the carrier gas.The amount of H 2 and O 2 was determined using a thermal conductivity detector (TCD).The amount of CH 4 was measured by using a flame ionization detector (FID).The amount of CO was converted to CH 4 by using a methanation reactor and then analyzed by using the FID.After the reaction was completed, the sample was collected by centrifugation at 8000 rpm for 5 min.During the stability test, the photocatalyst with the best performance was collected after each run and then reused for photoreduction of CO 2 .The photocatalyst was heat treated at 160 C for 3 h after the runs before its reusing.The isotope-labeling experiments were performed using 13 CO 2 instead of 12 CO 2 , and the products were analyzed using gas chromatographymass spectrometry (7890B/5977A, Agilent).Visible photocatalytic performance was measured under the same experimental condition except that both long-wave-pass 420-nm and short-wave-pass 780nm cutoff filters (420 780 nm ) were used instead of shortwave-pass 420 nm ( 420 nm) cutoff filter."}, {"llm generation": "Gas", "source": "The TiO 2 based samples were used as photocatalysts in the mixed vapor of CO 2 and H 2 O under UV light irradiation (320 420 nm), and the products were analyzed by gas chromatography.", "context": "In the proof-of-concept design, TiO 2 nanosheets were used as a model semiconductor, which were synthesized according to a literature procedure (Fig. S1). 42As revealed by transmission electron microscopy (TEM) and high-resolution TEM (HRTEM) images, TiO 2 nanosheets with an edge length of approximately 200 nm and thickness below 10 nm are monocrystalline structure dominated with (001) facet (Fig. S2).The large flat surface of the nanosheets facilitates the loading of cocatalyst, while low thickness shortens the electron migration distance to cocatalysts.Secondly, Pd nanocrystals were in situ grown on TiO 2 by reducing K 2 PdCl 4 with ascorbic acid (AA) (Fig. S1).With KBr as a facet-selective capping agent, cubic Pd nanocrystals with an average edge length of 10.6 nm are uniformly distributed on the flat surface of TiO 2 (Fig. S3a,b). 43s revealed by TEM image with a standing-up TiO 2 nanosheet, Pd nanocubes are integrated with TiO 2 nanosheets through facet-tofacet contact (Fig. S3c).As a result, TiO 2 -Pd interfaces with large area guarantee the stability of the supported structure and efficiency of interfacial charge transfer.HRTEM image of Pd shows continuous lattice fringes with a spacing of 1.95 A, implying monocrystalline nanostructures enclosed by six (100) facets (Fig. S3d). In the third step, Pd nanocubes were coated by Au shell with tunable thickness via the reduction of HAuCl 4 with AA (Fig. S1). 29iven the larger lattice mismatch between Pd and TiO 2 , Au selectively wet the Pd surface through an epitaxial growth mode to minimize the interfacial energy. 44Fig. 1a andb show TEM images of as-obtained TiO 2 -PdAu-1 with smaller Au/TiO 2 -Pd ratio.It can be clearly seen that PdAu core-shell nanostructures dispersed on TiO 2 nanosheets inherit the cubic profile shape with truncated corners.Especially, resulted from the higher electron density of Au than that of Pd, there is an image contrast between inner grey black Pd and exterior deep black Au.The Au shell is determined to be around 0.6 nm in thickness, which is also a piece of single crystal enclosed by (100) facets as revealed by HRTEM image, forming perfect Pd(100)-Au(100) interfaces with existing Pd core (Fig. 1c).The number of Au atomic layers is three and the interatomic spacing of the Au-Au pairs is 1.96 A, 4.35 smaller than that of pure Au (2.05 A), suggesting that compressive residual strains are developed in the 0.6 nm thick Au shell.This argument is further supported by the aberration-corrected high-angle annular dark-field scanning TEM (HAADF-STEM) images taken from an individual core-shell nanocube (Fig. 2a,b).The elemental distributions in the as-obtained a N.D. not detected. together with corresponding energy-dispersive spectroscopy (EDS) mapping profiles (Fig. 2c). With the further increase of Au/TiO 2 -Pd ratio, TiO 2 -PdAu samples with higher thicknesses of Au shell were obtained.As shown in Fig. 1d,e,g,h, the shell thickness of deep black Au increases to around 3 nm for TiO 2 -PdAu-2 and then to 7 nm for TiO 2 -PdAu-3 on average.As the shell thickness increases, the corner of PdAu core-shell nanocrystals becomes more round and the morphology tends to be more irregular.According to HRTEM images (Fig. 1f andi), the planes of Au shell also share the same orientation with Pd cores, contributing to the construction of PdAu core-shell nanostructure with Au(100) surfaces and Pd(100)-Au(100) interfaces.The numbers of Au atomic layers are estimated to be 15 and 34, and lattice spacings in Au shell are measured to be 2.01 and 2.05 A for the TiO 2 -PdAu-2 and TiO 2 -PdAu-3, respectively.The above results imply that the compressive strains along the directions parallel to the exposed (100) planes of Pd nanocrystals gradually reduce as the Au thickness increases.For TiO 2 -PdAu-2, 3 nm Au shell is also under compression with a 1.93 lattice strain.When the shell thickness becomes greater than 7 nm, the compressive strain on the Au shell reduces to the level of that of bulk Au.The morphological evolution of PdAu nanocrystals along with the increase of Au thickness could also be clearly seen from STEM images and EDS mapping profiles (Fig. 2d ande).It should be noted that as one plane of Pd nanocubes in the TiO 2 -PdAu samples is in intimate contact with TiO 2 , only five planes are covered by Au to form stack structures, which can be verified by the TEM images with standing-up TiO 2 nanosheets (inset of Fig. 1b,e,h).Additionally, with the deposition of single crystalline Au nanocubes enclosed by (100) planes on TiO 2 nanosheets via facet-tofacet contact, TiO 2 -Au is also fabricated as a reference sample (Fig. S4). The structures of as-obtained samples were further characterized by X-ray powder diffraction (XRD) patterns.As shown in Fig. 3a, in addition to the peaks of anatase phase of TiO 2 (JCPDS no.21-1272), all other peaks can be ascribed to face-centered cubic (fcc) Pd (JCPDS no.65-2867) and Au (JCPDS no.65-2870).In comparison with the pattern of TiO 2 -Pd, no additional Au peak can be observed in TiO 2 -PdAu-1, except a slight leftward broadening of Pd peaks.These results indicate that the lattice parameter of ultrathin Au layers is similar to that of Pd, further suggesting the compression of Au lattice. 33As the Au thickness increasing, characteristic peaks of Au appear in TiO 2 -PdAu-2 and TiO 2 -PdAu-3, and the intensities of which gradually increase while the positions shift to lower angles, implying the increased lattice spacing of Au shell.The positions of Au peaks in TiO 2 -PdAu-3 are close to those in TiO 2 -Au, again proving that Au is nearly free from residual strain. X-ray photoelectron spectra (XPS) were then used to collect the surface composition information of the samples.Survey spectra further confirm the presence of Pd and Au, along with Ti and O in the TiO 2 -PdAu samples (Fig. S5).In the spectrum of Pd3d and This journal is The Royal Society of Chemistry 20xx Please do not adjust margins Please do not adjust margins with zero-valence Pd and Au, respectively, while small amounts of Pd (II) states are also detected and shown as doublets (336.6/342.0eV), which are typical features for solution-synthesized Pd (Fig. 3b andc).It is worth noting that Au4d 5/2 signal at 335.4 eV is overlapped with Pd3d spectrum (Fig. 3b and Fig. S5).Owing to the limited detection depth of XPS, with the increase of Au shell thickness, Au4d and Au4f signals become stronger while Pd3d signal gradually weakens.More importantly, Pd3d and Au4d/Au4f peaks shift to higher and lower binding energy compared with those of TiO 2 -Pd and TiO 2 -Au, respectively, suggesting electron-deficient Pd and electron-rich Au. 29,45 What's more, more obvious shifts occur when Au shell of TiO 2 -PdAu is thinner, suggesting more significant charge re-distribution between them. Upon acquiring the structure and composition information of the samples, we are in a position to investigate their photocatalytic performance in CO 2 reduction.The TiO 2 based samples were used as photocatalysts in the mixed vapor of CO 2 and H 2 O under UV light irradiation (320 420 nm), and the products were analyzed by gas chromatography.As shown in Fig. 4a, it can be clearly seen that the loading of metal significantly improves the photocatalytic activity of TiO 2 .Moreover, the yields of reduction products show a strong correlation with the type of metal, which should be related to the functions of cocatalysts.The reduction product over TiO 2 -Pd is dominant H 2 with trace amounts of CO and CH 4 .With the further deposition of Au on Pd, the side reaction of H 2 evolution is effectively inhibited, while CO yield is remarkably improved.According to previous reports, 35,46 water splitting prefers to occur on Pd(100) plane, while Au exhibits high activity and selectivity in conversion of CO 2 to CO due to the weak Au-CO binding energy.More importantly, the average CO production rates are greatly dependent on the thickness of Au shell.With the thinnest Au shell, TiO 2 -PdAu-1 achieves an impressive value of 166.3 mol g cat -1 h -1 , 97.8 and 75.6-fold times higher than those of TiO 2 and TiO 2 -Pd, respectively (Table 1).With the increase of Au thickness, CO evolution rate falls to 38.4 and 14.8 mol g cat -1 h -1 for TiO 2 -PdAu-2 and TiO 2 -PdAu-3, respectively, superior to that of TiO 2 -Au.For TiO 2 -PdAu samples, the selectivity for CO production follows a same order as the CO evolution rate (Fig. 4a), which is calculated according to the average evolution rates of reduction products as well as the electrons required to generate products using the following equation: CO selectivity() 2(CO)/2(H 2 ) 2(CO) 8(CH 4 ) 100 TiO 2 -PdAu-1 exhibits the highest selectivity of 90.6, which drops to 68.9 for TiO 2 -PdAu-2, and then to 53.8 for TiO 2 -PdAu-3, almost close to that of TiO 2 -Au (52.9) (Table 1). The photocatalytic performance of TiO 2 -PdAu-1 also outperforms those of reported state-of-the-art Au cocatalysts supported by TiO 2 measured under comparative conditions (Table S1). 29,47488495051 Moreover, after five 4 h of cycling test, TiO 2 -PdAu-1 still maintain efficient activity and selectivity in CO evolution (Fig. 4b).As revealed by the TEM, XRD and XPS of TiO 2 -PdAu-1 after long-term testing, the excellent durability can be ascribed to the well-maintained structure and composition of the catalyst (Fig. S6 andS7).It should be noted that O 2 as an oxidation product was also detected in the photocatalytic reaction, suggesting the occurrence of H 2 O 2h 1/2O 2 2H (Table 1).Moreover, no low-carbon product was detected in the control experiments including without photocatalyst, in the dark or in Ar atmosphere, confirming that CO Please do not adjust margins Please do not adjust margins was actually originated from photoreduction of CO 2 rather than adsorbed carbon species (Table 1).To further confirm this, the 13 C Fig. 6 Differential charge density determined by first-principles simulations for the Au(100) shells on Pd(100) substrates in the presence of one additional electron (subtracting the charges in the neutral case (Fig. S8) from this system).The Au shell thickness is altered from 1 to 4 layers.The olive and cyan colors represent an increase and decrease in electron density, respectively.isotope labeling experiment was performed over TiO 2 -PdAu-1 using 13 CO 2 as a substrate to explore the source of carbon.As shown in Fig. 4c, the strong signal at m/z 29 can be assigned to 13 CO, suggesting that the carbon source of CO is derived from the used CO 2 .Besides of CO, CH 4 evolution rate of TiO 2 -PdAu gradually increases with the reduction of Au thickness, while H 2 production rate gradually decreases, suggesting that it is possible to totally suppress H 2 evolution when the Au shell is further shrunk into monolayer (Table 1). 9,52,53hen the photocatalytic performance of TiO 2 -PdAu samples was measured under visible light irradiation (420 780 nm), no obvious product was detected for TiO 2 -PdAu-1, while TiO 2 -PdAu-2 and TiO 2 -PdAu-3 produced trace amounts of H 2 and CO.The main reason is that the plasmonic absorption of three-atom-thick Au shell in TiO 2 -PdAu-1 is too weak to generate hot electrons and inject them into the conduction band of TiO 2 for surface reduction reaction through AuTiO 2 and AuPdTiO 2 routes. 54,55otocatalytic mechanism study It is natural to ask what factor is responsible for the Au thicknessdependent photocatalytic performance?To decode the underlying mechanism, charge kinetics is first taken into consideration, which plays a key role in the photocatalytic processes. 56,57As the driven force of photocatalysis, light harvesting behaviors of the samples were evaluated by UV-vis diffuse reflectance spectra.As shown in Fig. 5a, the loading of metal does not alter the light absorption of TiO 2 in UV region.The varied visible absorption behaviors are mainly attributed to plasmonic band of Au as well as interband absorption of nonplasmonic Pd. 43,58,59 Given the comparable light absorption in UV region, photocurrent response offers an informative evaluation of the electron-hole separation efficiency.As indicated by photocurrent versus time (I-t) curves in Fig. 5b, the addition of metal significantly boosts the photocurrent density of TiO 2 , confirming the role of cocatalyst in preventing charge recombination in TiO 2 .Moreover, various metal cocatalysts show obviously different photocurrent enhancement, which turns out to be in the order: TiO 2 -Pd TiO 2 -Au TiO 2 -PdAu-3 TiO 2 -PdAu-2 TiO 2 -PdAu-1, demonstrating that low thickness of Au shell is beneficial to charge separation.This statement is also confirmed by electrochemical impedance spectra (EIS) and photoluminescence (PL) emission spectra (Fig. 5c andd).Along with the decrease of Au thickness, reducing arc radii of Nyquist plot indicate lower interfacial charge transfer resistances, while increasing PL quenching degrees of TiO 2 suggest more effective prevention of charge recombination through radiative pathways.The augmented charge separation inevitably contributes to prolonged carrier lifetimes.As indicated by transient open-circuit voltage decay (OCVD) measurements (Fig. 5e), the average lifetimes of the photogenerated carriers ( n ) were estimated according to the open-circuit voltage (V oc ) decay in the dark as the electron-hole recombination gradually occurred when the light illumination was turned off.As expected, the average lifetime of the carriers follows the same sequence as photocurrent, which is in good agreement with photocatalytic results in CO 2 -to-CO conversion (Fig. 5f). The next question arose as to what in-depth mechanism results in Au thickness dependent charge kinetics behavior.Considering the encapsulation of cubic Pd core with TiO 2 supporter and Au shell in the TiO 2 -PdAu samples, photoexcited electrons in TiO 2 migrate to the surface of Au cocatalyst in larger work function for CO 2 reduction reaction through both TiO 2 PdAu and TiO 2 Au pathways. 60Given the same TiO 2 (001)-Pd(100), Pd(100)-Au(100) and TiO 2 (001)-Au(100) interfaces for electron transfer, the effect of interface structures on photocatalytic properties could be excluded.In addition to the diffusion of photogenerated electrons, previous studies have shown that charge transfer from Pd to Au occurs even without the assistance of external light excitation because of the larger electronegativity of Au (2.5) than that of Pd (2.2), which is in line with the charge re-distribution revealed by XPS results. 6162263 The efficiency of electron migration from Pd to Au may be related to the thickness of Au shell, which may explain the varied charge kinetics behaviors.Previous reports on PdPt core-shell nanostructures This journal is The Royal Society of Chemistry 20xx Please do not adjust margins Please do not adjust margins have revealed that Pt shell dependent interfacial polarization effect steers the flow of electrons from Pd to Pt. 37,38 To confirm the possible mechanism behind this process, we employed firstprinciples simulation to examine the Au thickness dependent charge transfer between Pd and Au.As revealed by the charge density difference (Fig. S8), when Au is in 1 atomic layer, distinct interfacial polarization occurs, leading to the accumulation of a certain number of electrons on the exposed Au surface.However, this interfacial polarization effect dramatically decays with the increase of Au thickness.Given the migration of photogenerated electrons through Pd-Au interface during the photocatalysis process, Fig. 6 illustrates the charge density differences in the presence of one additional electron as a function of Au thickness.It can be clearly seen that the negative charge accumulation on the Au surface follows the same thickness dependence as in the neutral state.Nevertheless, the dependence of the surface electron accumulation on the Au thickness is reduced when a photoelectron is added into Pd.Additional electrons remain on the Au surface as the shell thickness increases from 1 to 4 atomic layers, which explains the superior charge transfer and separation efficiency of TiO 2 -PdAu-1.The interfacial polarization effect serves as an additional driving force for the migration of photo-induced electrons from Pd to unoccupied 5d orbitals of Au.However, there is no denying that the effect of interfacial polarization still becomes weaker with the increase of Au thickness to a certain extent, which cannot well explain the superior photocatalytic activity of TiO 2 -PdAu-2 with 15-layer Au atoms in comparison with those of TiO 2 -PdAu-3 and TiO 2 -Au, implying other factors may also contribute to the Au thickness dependent catalytic performance. Aside from charge separation, surface reactivity is another key factor determining the photocatalytic performance.In comparison with photocurrent response, the difference in photocatalytic activity appears to be more obvious, implying that tunable shell thickness also mediates the surface reaction.Given the exposure of same Au(100) facet, the influence of surface structure of cocatalyst on the catalytic reactivity could be excluded.The only difference in surface strain should be the dominant factor responsible for the enhanced CO 2 -to-CO conversion.To gain an intrinsic understanding of the surface strain on CO 2 -reduction activity, we calculated the Gibbs free energy diagrams for CO 2 reduction into CO under different surface strains.As shown in Fig. 7a and Table S2, the formation of intermediate COOH on Au(100) is the key step in the CO 2 -to-CO conversion, which is associated with an increase in free energy of 0.42 eV under a compressive strain of -4.35.While in the cases under strain of 0 and -1.93, the free energy increases to 0.55 and 0.49 eV, respectively, suggesting the surface compressive strain is beneficial to the formation of COOH.According to the projected d-density of states (PDOS) of surface atoms on Au (100) surfaces (Fig. 7b), d-band center shifts from -3.30 eV to -3.23 eV and then to -3.14 eV with the increase of surface strain from 0 to -1.93 and then to -4.35.The upward shift of d-band center toward the Fermi level results in higher surface electron density and stronger adsorbate bonding of Au (Fig. S9).The changes of Gibbs free energy for the formation of CO are analogous to that of COOH.The hydrogenation of COOH to CO is more favorable on cocatalyst with high surface strain (-0.63 eV) as compared with those with low strain (-0.55 eV) and without strain (-0.51 eV) (Fig. 7a and Table S2).From the viewpoint of reactive kinetics, the energy barriers were calculated to investigate the relationship between surface strain and CO 2 reduction reaction (Fig. S10 andS11).It can be seen that the barrier for the hydrogenation of CO 2 to COOH on Au(100) surface without strain is 1.74 eV, which decreases to 1.49 and 1.20 eV under strain of -1.93 and -4.35, respectively.Furthermore, for the further hydrogenation of COOH to CO, the barriers experience a gradual decline from 0.52 to 0.54 and to 0.47 eV when the strains increase from 0 to -1.93 and to -4.35.Taken together, both the thermodynamic and kinetic analyses confirm the positive correlation between compressive strain and surface reactivity."}], "reactor type": [], "operation mode": [{"llm generation": "Batch", "source": "Moreover, after five 4 h of cycling test, TiO 2 -PdAu-1 still maintain efficient activity and selectivity in CO evolution (Fig. 4b).", "context": "In the proof-of-concept design, TiO 2 nanosheets were used as a model semiconductor, which were synthesized according to a literature procedure (Fig. S1). 42As revealed by transmission electron microscopy (TEM) and high-resolution TEM (HRTEM) images, TiO 2 nanosheets with an edge length of approximately 200 nm and thickness below 10 nm are monocrystalline structure dominated with (001) facet (Fig. S2).The large flat surface of the nanosheets facilitates the loading of cocatalyst, while low thickness shortens the electron migration distance to cocatalysts.Secondly, Pd nanocrystals were in situ grown on TiO 2 by reducing K 2 PdCl 4 with ascorbic acid (AA) (Fig. S1).With KBr as a facet-selective capping agent, cubic Pd nanocrystals with an average edge length of 10.6 nm are uniformly distributed on the flat surface of TiO 2 (Fig. S3a,b). 43s revealed by TEM image with a standing-up TiO 2 nanosheet, Pd nanocubes are integrated with TiO 2 nanosheets through facet-tofacet contact (Fig. S3c).As a result, TiO 2 -Pd interfaces with large area guarantee the stability of the supported structure and efficiency of interfacial charge transfer.HRTEM image of Pd shows continuous lattice fringes with a spacing of 1.95 A, implying monocrystalline nanostructures enclosed by six (100) facets (Fig. S3d). In the third step, Pd nanocubes were coated by Au shell with tunable thickness via the reduction of HAuCl 4 with AA (Fig. S1). 29iven the larger lattice mismatch between Pd and TiO 2 , Au selectively wet the Pd surface through an epitaxial growth mode to minimize the interfacial energy. 44Fig. 1a andb show TEM images of as-obtained TiO 2 -PdAu-1 with smaller Au/TiO 2 -Pd ratio.It can be clearly seen that PdAu core-shell nanostructures dispersed on TiO 2 nanosheets inherit the cubic profile shape with truncated corners.Especially, resulted from the higher electron density of Au than that of Pd, there is an image contrast between inner grey black Pd and exterior deep black Au.The Au shell is determined to be around 0.6 nm in thickness, which is also a piece of single crystal enclosed by (100) facets as revealed by HRTEM image, forming perfect Pd(100)-Au(100) interfaces with existing Pd core (Fig. 1c).The number of Au atomic layers is three and the interatomic spacing of the Au-Au pairs is 1.96 A, 4.35 smaller than that of pure Au (2.05 A), suggesting that compressive residual strains are developed in the 0.6 nm thick Au shell.This argument is further supported by the aberration-corrected high-angle annular dark-field scanning TEM (HAADF-STEM) images taken from an individual core-shell nanocube (Fig. 2a,b).The elemental distributions in the as-obtained a N.D. not detected. together with corresponding energy-dispersive spectroscopy (EDS) mapping profiles (Fig. 2c). With the further increase of Au/TiO 2 -Pd ratio, TiO 2 -PdAu samples with higher thicknesses of Au shell were obtained.As shown in Fig. 1d,e,g,h, the shell thickness of deep black Au increases to around 3 nm for TiO 2 -PdAu-2 and then to 7 nm for TiO 2 -PdAu-3 on average.As the shell thickness increases, the corner of PdAu core-shell nanocrystals becomes more round and the morphology tends to be more irregular.According to HRTEM images (Fig. 1f andi), the planes of Au shell also share the same orientation with Pd cores, contributing to the construction of PdAu core-shell nanostructure with Au(100) surfaces and Pd(100)-Au(100) interfaces.The numbers of Au atomic layers are estimated to be 15 and 34, and lattice spacings in Au shell are measured to be 2.01 and 2.05 A for the TiO 2 -PdAu-2 and TiO 2 -PdAu-3, respectively.The above results imply that the compressive strains along the directions parallel to the exposed (100) planes of Pd nanocrystals gradually reduce as the Au thickness increases.For TiO 2 -PdAu-2, 3 nm Au shell is also under compression with a 1.93 lattice strain.When the shell thickness becomes greater than 7 nm, the compressive strain on the Au shell reduces to the level of that of bulk Au.The morphological evolution of PdAu nanocrystals along with the increase of Au thickness could also be clearly seen from STEM images and EDS mapping profiles (Fig. 2d ande).It should be noted that as one plane of Pd nanocubes in the TiO 2 -PdAu samples is in intimate contact with TiO 2 , only five planes are covered by Au to form stack structures, which can be verified by the TEM images with standing-up TiO 2 nanosheets (inset of Fig. 1b,e,h).Additionally, with the deposition of single crystalline Au nanocubes enclosed by (100) planes on TiO 2 nanosheets via facet-tofacet contact, TiO 2 -Au is also fabricated as a reference sample (Fig. S4). The structures of as-obtained samples were further characterized by X-ray powder diffraction (XRD) patterns.As shown in Fig. 3a, in addition to the peaks of anatase phase of TiO 2 (JCPDS no.21-1272), all other peaks can be ascribed to face-centered cubic (fcc) Pd (JCPDS no.65-2867) and Au (JCPDS no.65-2870).In comparison with the pattern of TiO 2 -Pd, no additional Au peak can be observed in TiO 2 -PdAu-1, except a slight leftward broadening of Pd peaks.These results indicate that the lattice parameter of ultrathin Au layers is similar to that of Pd, further suggesting the compression of Au lattice. 33As the Au thickness increasing, characteristic peaks of Au appear in TiO 2 -PdAu-2 and TiO 2 -PdAu-3, and the intensities of which gradually increase while the positions shift to lower angles, implying the increased lattice spacing of Au shell.The positions of Au peaks in TiO 2 -PdAu-3 are close to those in TiO 2 -Au, again proving that Au is nearly free from residual strain. X-ray photoelectron spectra (XPS) were then used to collect the surface composition information of the samples.Survey spectra further confirm the presence of Pd and Au, along with Ti and O in the TiO 2 -PdAu samples (Fig. S5).In the spectrum of Pd3d and This journal is The Royal Society of Chemistry 20xx Please do not adjust margins Please do not adjust margins with zero-valence Pd and Au, respectively, while small amounts of Pd (II) states are also detected and shown as doublets (336.6/342.0eV), which are typical features for solution-synthesized Pd (Fig. 3b andc).It is worth noting that Au4d 5/2 signal at 335.4 eV is overlapped with Pd3d spectrum (Fig. 3b and Fig. S5).Owing to the limited detection depth of XPS, with the increase of Au shell thickness, Au4d and Au4f signals become stronger while Pd3d signal gradually weakens.More importantly, Pd3d and Au4d/Au4f peaks shift to higher and lower binding energy compared with those of TiO 2 -Pd and TiO 2 -Au, respectively, suggesting electron-deficient Pd and electron-rich Au. 29,45 What's more, more obvious shifts occur when Au shell of TiO 2 -PdAu is thinner, suggesting more significant charge re-distribution between them. Upon acquiring the structure and composition information of the samples, we are in a position to investigate their photocatalytic performance in CO 2 reduction.The TiO 2 based samples were used as photocatalysts in the mixed vapor of CO 2 and H 2 O under UV light irradiation (320 420 nm), and the products were analyzed by gas chromatography.As shown in Fig. 4a, it can be clearly seen that the loading of metal significantly improves the photocatalytic activity of TiO 2 .Moreover, the yields of reduction products show a strong correlation with the type of metal, which should be related to the functions of cocatalysts.The reduction product over TiO 2 -Pd is dominant H 2 with trace amounts of CO and CH 4 .With the further deposition of Au on Pd, the side reaction of H 2 evolution is effectively inhibited, while CO yield is remarkably improved.According to previous reports, 35,46 water splitting prefers to occur on Pd(100) plane, while Au exhibits high activity and selectivity in conversion of CO 2 to CO due to the weak Au-CO binding energy.More importantly, the average CO production rates are greatly dependent on the thickness of Au shell.With the thinnest Au shell, TiO 2 -PdAu-1 achieves an impressive value of 166.3 mol g cat -1 h -1 , 97.8 and 75.6-fold times higher than those of TiO 2 and TiO 2 -Pd, respectively (Table 1).With the increase of Au thickness, CO evolution rate falls to 38.4 and 14.8 mol g cat -1 h -1 for TiO 2 -PdAu-2 and TiO 2 -PdAu-3, respectively, superior to that of TiO 2 -Au.For TiO 2 -PdAu samples, the selectivity for CO production follows a same order as the CO evolution rate (Fig. 4a), which is calculated according to the average evolution rates of reduction products as well as the electrons required to generate products using the following equation: CO selectivity() 2(CO)/2(H 2 ) 2(CO) 8(CH 4 ) 100 TiO 2 -PdAu-1 exhibits the highest selectivity of 90.6, which drops to 68.9 for TiO 2 -PdAu-2, and then to 53.8 for TiO 2 -PdAu-3, almost close to that of TiO 2 -Au (52.9) (Table 1). The photocatalytic performance of TiO 2 -PdAu-1 also outperforms those of reported state-of-the-art Au cocatalysts supported by TiO 2 measured under comparative conditions (Table S1). 29,47488495051 Moreover, after five 4 h of cycling test, TiO 2 -PdAu-1 still maintain efficient activity and selectivity in CO evolution (Fig. 4b).As revealed by the TEM, XRD and XPS of TiO 2 -PdAu-1 after long-term testing, the excellent durability can be ascribed to the well-maintained structure and composition of the catalyst (Fig. S6 andS7).It should be noted that O 2 as an oxidation product was also detected in the photocatalytic reaction, suggesting the occurrence of H 2 O 2h 1/2O 2 2H (Table 1).Moreover, no low-carbon product was detected in the control experiments including without photocatalyst, in the dark or in Ar atmosphere, confirming that CO Please do not adjust margins Please do not adjust margins was actually originated from photoreduction of CO 2 rather than adsorbed carbon species (Table 1).To further confirm this, the 13 C Fig. 6 Differential charge density determined by first-principles simulations for the Au(100) shells on Pd(100) substrates in the presence of one additional electron (subtracting the charges in the neutral case (Fig. S8) from this system).The Au shell thickness is altered from 1 to 4 layers.The olive and cyan colors represent an increase and decrease in electron density, respectively.isotope labeling experiment was performed over TiO 2 -PdAu-1 using 13 CO 2 as a substrate to explore the source of carbon.As shown in Fig. 4c, the strong signal at m/z 29 can be assigned to 13 CO, suggesting that the carbon source of CO is derived from the used CO 2 .Besides of CO, CH 4 evolution rate of TiO 2 -PdAu gradually increases with the reduction of Au thickness, while H 2 production rate gradually decreases, suggesting that it is possible to totally suppress H 2 evolution when the Au shell is further shrunk into monolayer (Table 1). 9,52,53hen the photocatalytic performance of TiO 2 -PdAu samples was measured under visible light irradiation (420 780 nm), no obvious product was detected for TiO 2 -PdAu-1, while TiO 2 -PdAu-2 and TiO 2 -PdAu-3 produced trace amounts of H 2 and CO.The main reason is that the plasmonic absorption of three-atom-thick Au shell in TiO 2 -PdAu-1 is too weak to generate hot electrons and inject them into the conduction band of TiO 2 for surface reduction reaction through AuTiO 2 and AuPdTiO 2 routes. 54,55otocatalytic mechanism study It is natural to ask what factor is responsible for the Au thicknessdependent photocatalytic performance?To decode the underlying mechanism, charge kinetics is first taken into consideration, which plays a key role in the photocatalytic processes. 56,57As the driven force of photocatalysis, light harvesting behaviors of the samples were evaluated by UV-vis diffuse reflectance spectra.As shown in Fig. 5a, the loading of metal does not alter the light absorption of TiO 2 in UV region.The varied visible absorption behaviors are mainly attributed to plasmonic band of Au as well as interband absorption of nonplasmonic Pd. 43,58,59 Given the comparable light absorption in UV region, photocurrent response offers an informative evaluation of the electron-hole separation efficiency.As indicated by photocurrent versus time (I-t) curves in Fig. 5b, the addition of metal significantly boosts the photocurrent density of TiO 2 , confirming the role of cocatalyst in preventing charge recombination in TiO 2 .Moreover, various metal cocatalysts show obviously different photocurrent enhancement, which turns out to be in the order: TiO 2 -Pd TiO 2 -Au TiO 2 -PdAu-3 TiO 2 -PdAu-2 TiO 2 -PdAu-1, demonstrating that low thickness of Au shell is beneficial to charge separation.This statement is also confirmed by electrochemical impedance spectra (EIS) and photoluminescence (PL) emission spectra (Fig. 5c andd).Along with the decrease of Au thickness, reducing arc radii of Nyquist plot indicate lower interfacial charge transfer resistances, while increasing PL quenching degrees of TiO 2 suggest more effective prevention of charge recombination through radiative pathways.The augmented charge separation inevitably contributes to prolonged carrier lifetimes.As indicated by transient open-circuit voltage decay (OCVD) measurements (Fig. 5e), the average lifetimes of the photogenerated carriers ( n ) were estimated according to the open-circuit voltage (V oc ) decay in the dark as the electron-hole recombination gradually occurred when the light illumination was turned off.As expected, the average lifetime of the carriers follows the same sequence as photocurrent, which is in good agreement with photocatalytic results in CO 2 -to-CO conversion (Fig. 5f). The next question arose as to what in-depth mechanism results in Au thickness dependent charge kinetics behavior.Considering the encapsulation of cubic Pd core with TiO 2 supporter and Au shell in the TiO 2 -PdAu samples, photoexcited electrons in TiO 2 migrate to the surface of Au cocatalyst in larger work function for CO 2 reduction reaction through both TiO 2 PdAu and TiO 2 Au pathways. 60Given the same TiO 2 (001)-Pd(100), Pd(100)-Au(100) and TiO 2 (001)-Au(100) interfaces for electron transfer, the effect of interface structures on photocatalytic properties could be excluded.In addition to the diffusion of photogenerated electrons, previous studies have shown that charge transfer from Pd to Au occurs even without the assistance of external light excitation because of the larger electronegativity of Au (2.5) than that of Pd (2.2), which is in line with the charge re-distribution revealed by XPS results. 6162263 The efficiency of electron migration from Pd to Au may be related to the thickness of Au shell, which may explain the varied charge kinetics behaviors.Previous reports on PdPt core-shell nanostructures This journal is The Royal Society of Chemistry 20xx Please do not adjust margins Please do not adjust margins have revealed that Pt shell dependent interfacial polarization effect steers the flow of electrons from Pd to Pt. 37,38 To confirm the possible mechanism behind this process, we employed firstprinciples simulation to examine the Au thickness dependent charge transfer between Pd and Au.As revealed by the charge density difference (Fig. S8), when Au is in 1 atomic layer, distinct interfacial polarization occurs, leading to the accumulation of a certain number of electrons on the exposed Au surface.However, this interfacial polarization effect dramatically decays with the increase of Au thickness.Given the migration of photogenerated electrons through Pd-Au interface during the photocatalysis process, Fig. 6 illustrates the charge density differences in the presence of one additional electron as a function of Au thickness.It can be clearly seen that the negative charge accumulation on the Au surface follows the same thickness dependence as in the neutral state.Nevertheless, the dependence of the surface electron accumulation on the Au thickness is reduced when a photoelectron is added into Pd.Additional electrons remain on the Au surface as the shell thickness increases from 1 to 4 atomic layers, which explains the superior charge transfer and separation efficiency of TiO 2 -PdAu-1.The interfacial polarization effect serves as an additional driving force for the migration of photo-induced electrons from Pd to unoccupied 5d orbitals of Au.However, there is no denying that the effect of interfacial polarization still becomes weaker with the increase of Au thickness to a certain extent, which cannot well explain the superior photocatalytic activity of TiO 2 -PdAu-2 with 15-layer Au atoms in comparison with those of TiO 2 -PdAu-3 and TiO 2 -Au, implying other factors may also contribute to the Au thickness dependent catalytic performance. Aside from charge separation, surface reactivity is another key factor determining the photocatalytic performance.In comparison with photocurrent response, the difference in photocatalytic activity appears to be more obvious, implying that tunable shell thickness also mediates the surface reaction.Given the exposure of same Au(100) facet, the influence of surface structure of cocatalyst on the catalytic reactivity could be excluded.The only difference in surface strain should be the dominant factor responsible for the enhanced CO 2 -to-CO conversion.To gain an intrinsic understanding of the surface strain on CO 2 -reduction activity, we calculated the Gibbs free energy diagrams for CO 2 reduction into CO under different surface strains.As shown in Fig. 7a and Table S2, the formation of intermediate COOH on Au(100) is the key step in the CO 2 -to-CO conversion, which is associated with an increase in free energy of 0.42 eV under a compressive strain of -4.35.While in the cases under strain of 0 and -1.93, the free energy increases to 0.55 and 0.49 eV, respectively, suggesting the surface compressive strain is beneficial to the formation of COOH.According to the projected d-density of states (PDOS) of surface atoms on Au (100) surfaces (Fig. 7b), d-band center shifts from -3.30 eV to -3.23 eV and then to -3.14 eV with the increase of surface strain from 0 to -1.93 and then to -4.35.The upward shift of d-band center toward the Fermi level results in higher surface electron density and stronger adsorbate bonding of Au (Fig. S9).The changes of Gibbs free energy for the formation of CO are analogous to that of COOH.The hydrogenation of COOH to CO is more favorable on cocatalyst with high surface strain (-0.63 eV) as compared with those with low strain (-0.55 eV) and without strain (-0.51 eV) (Fig. 7a and Table S2).From the viewpoint of reactive kinetics, the energy barriers were calculated to investigate the relationship between surface strain and CO 2 reduction reaction (Fig. S10 andS11).It can be seen that the barrier for the hydrogenation of CO 2 to COOH on Au(100) surface without strain is 1.74 eV, which decreases to 1.49 and 1.20 eV under strain of -1.93 and -4.35, respectively.Furthermore, for the further hydrogenation of COOH to CO, the barriers experience a gradual decline from 0.52 to 0.54 and to 0.47 eV when the strains increase from 0 to -1.93 and to -4.35.Taken together, both the thermodynamic and kinetic analyses confirm the positive correlation between compressive strain and surface reactivity."}]}}