{"DOI": "10.1039/c2jm31736b", "paper_title": "Synthesis of Ag@AgBr/AgCl heterostructured nanocashews with enhanced photocatalytic performance via anion exchange", "human validator": "hybrid annotator", "annotation": {"catalyst": [{"llm generation": "Ag@AgBr/AgCl heterostructured nanocashews", "source": "Synthesis of Ag@AgBr/AgCl heterostructured nanocashews with enhanced photocatalytic performance via anion exchange", "context": "Synthesis of Ag@AgBr/AgCl heterostructured nanocashews with enhanced photocatalytic performance via anion exchange"}, {"llm generation": "Heterostructured AgAgBr/AgCl nanophotocatalyst", "source": "Interestingly, the novel heterostructured AgAgBr/AgCl nanophotocatalyst also shows efficient visible light conversion of CO 2 to energetic fuels, e.g.methanol/ethanol.", "context": "Heterostructured AgAgBr/AgCl nanocashews have been synthesized by an anion-exchange reaction between AgCl nanocubes and Br A ions followed by photoreduction.Compared to polyhedral AgAgBr nanoparticles, the obtained nanostructures exhibit enhanced photocatalytic activity towards decomposition of organic pollutants, i.e., rhodamine-B (RhB).For example, only 2 min is taken to completely decompose RhB molecules with the assistance of these novel heterostructured nanoparticles under visible light irradiation.Furthermore, the as-synthesized nanocatalyst can be reused 20 times without losing activity, showing its high stability.Interestingly, the novel heterostructured AgAgBr/AgCl nanophotocatalyst also shows efficient visible light conversion of CO 2 to energetic fuels, e.g.methanol/ethanol.Therefore, the present route opens an avenue to achieve highly efficient visible-light-driven nanophotocatalysts for applications in environmental remediation and resourceful use of CO 2 ."}, {"llm generation": "AgAgBr/AgCl, polyhedral AgAgBr, commercial TiO 2 (P25)", "source": "For comparison, investigations without photocatalyst, and with polyhedral AgAgBr and commercial TiO 2 (P25) were also carried out.", "context": "Silver nitrate (AgNO 3 ), sodium chloride (NaCl), sodium bicarbonate (NaHCO 3 ), sodium bromide (NaBr), ethylene glycol (EG), polyvinylpyrrolidone (PVP), and rhodamine-B (RhB) were purchased from Sinopharm Chemical Reagent Co., Ltd (Shanghai, China).All the reagents were used as received without further purification. The AgBr/AgCl nanocomposite was synthesized by an anionexchange reaction of Br A ions with AgCl nanocubes, which could be easily achieved using our reported method. 14In a typical procedure, AgCl nanocubes were firstly dispersed in 10 mL of deionized water in the presence of PVP (27.1 mg).After an aqueous solution of NaBr (0.61 mM, 10 mL) was rapidly added, the reaction was continued under vigorous magnetic stirring for about 10 h.The obtained product was rinsed with de-ionized water several times and dispersed in 10 mL of de-ionized water.Then the dispersion was irradiated under visible light for 30 min to convert some Ag ions on the surface region of AgBr/AgCl to Ag 0 species.The solution color changed gradually from light yellow to bluish violet, indicating the production and assembly of Ag nanoparticles on the surfaces of AgBr/AgCl.For comparison, polyhedral AgAgBr nanoparticles were also prepared by a similar process except without the anion-exchange reaction. The crystal structure of the samples was examined by X-ray powder diffraction (XRD) on a Philips X'Pert diffractometer with Cu Ka radiation (l 14 0.15418 nm).The morphology was observed with a Hitachi S-4800 field emission scanning electronic microscopy (FESEM) instrument.The absorbance spectra of the catalyst were measured by a UV-vis spectrometer (UV-2550, Shimadzu) in a range of 230 to 1000 nm.The content of Ag species in the AgAgBr/AgCl surface was confirmed by X-ray photoelectron spectra (XPS), recorded on a Perkin-Elmer PHI-5300 spectrometer, using non-monochromatized Mg Ka radiation as excitation source in a vacuum of 10 A7 Pa.The charge shift correction was made and the C 1s electron binding energy of 284.6 eV was used for calibration of the instrument.The XPS spectra were fitted using a combined polynomial and Shirley-type background function. The photocatalytic performance of AgAgBr/AgCl was evaluated through degradation of RhB dye and reduction of CO 2 using a 300 W Xe arc lamp (PLS-SXE300/300UV) equipped with a UV cut-off filter as the source of visible light. For degradation of RhB, 10 mL of a water dispersion of the asprepared AgAgBr/AgCl nanocashews was transferred to an aqueous solution of RhB (10 mL, 20 mg L A1 ).The dispersion was kept in the dark for 1 h under magnetic stirring to reach the adsorption-desorption equilibrium.The degradation of RhB was monitored by UV-vis spectra.After the reaction was completed, centrifuging the solution enabled the AgAgBr/ AgCl nanoparticles to be collected to catalyze subsequent reactions.For comparison, investigations without photocatalyst, and with polyhedral AgAgBr and commercial TiO 2 (P25) were also carried out. The reduction of CO 2 was performed in a self-made photocatalytic reactor as shown in the ESI (Fig. S1 ).Two portions of AgAgBr/AgCl nanoparticles were dispersed in 50 mL of sodium bicarbonate aqueous solution (0.1 M) with magnetic stirring in the vessel.Prior to irradiation, CO 2 with a purity of 99 was bubbled through the solution with a rate of 0.7 L min A1 for 10 min to remove air and saturate the solution.The reaction was then performed under visible light irradiation (l 400 nm), and the temperature was kept at 0 C by an ice-bath so as to increase the solubility of CO 2 .Centrifugation (10 000 rpm) of the reaction mixtures enabled the catalyst to be easily separated from the liquid solution of the samples.The catalyst was collected for use in triggering new reactions.The product in the solution was first qualitatively analyzed by an Agilent GC7890A (FID detector, CP-WAX58 FFAP columns) through observing the chromatographic peaks related to the elution of alcohol and then comparing them with those for an authentic ethanol standard.This identification was then confirmed by a GC/MS-5975C (Agilent, DB-1 capillary columns).The content of alcohol in the products was determined by an Agilent GC7890A.Blank tests under visible light irradiation without the photocatalyst and in the dark with the photocatalyst under the same experimental conditions were also conducted."}, {"llm generation": "commercial TiO 2 (P25)", "source": "However, the degradation of RhB under the same conditions by commercial TiO 2 (P25) and without any photocatalyst was almost nonexistent, confirming the crucial role of AgAgBr/AgCl nanoparticles in the bleaching of organic pollutant molecules.", "context": "Crystalline phase and surface composition were investigated by X-ray powder diffraction (XRD) and X-ray photoelectronic spectra (XPS), respectively.Fig. 1(A) shows that the sample consists of face-centred cubic (fcc) AgBr (JCPDS card no.79-0149) and a small amount of AgCl (JCPDS card no.31-1238), which is caused by incomplete replacement of AgCl by Br A .Fig. 1(B) demonstrates that metallic Ag nanoparticles (JCPDS card no.87-0717) have been generated on the surfaces of AgBr/ AgCl after photoreduction.The elemental composition, chemical status, and silver content of AgAgBr/AgCl were further determined by means of XPS (Fig. 2).Before visible light irradiation, XPS analyses indicate that AgBr/AgCl contained the elements Ag, Cl, Br, and C. The carbon peak is due to adventitious hydrocarbon from the XPS instrument.The elements Ag, Cl, and Br come from the AgBr/AgCl sample.In Fig. 2(A), the two peaks at approximately 367 eV and 373 eV can be ascribed to the binding energies of Ag 3d 5/2 and Ag 3d 3/2 , respectively. 23,25,26he 3d 5/2 and Ag 3d 3/2 peaks can be further divided into two different bands, 367.1 eV, 368.2 eV, 373.1 eV, and 374.3 eV, respectively.The bands at 367.1 eV and 373.1 eV are attributed to Ag , and those at 368.2 eV and 374.3 eV are attributed to metallic Ag 0 .The calculated content of surface Ag 0 for the corresponding sample is 7.83 mol.The spectra of Cl 2p and Br 3d are shown in Fig. 2(B).The binding energies of Cl 2p 1/2 and Cl 2p 3/2 are about 199.0 eV and 197.3 eV, respectively.The spectrum of Br 3d shows that the binding energies of Br 3d 3/2 and Br 3d 5/2 are 68.7 and 67.7 eV, in agreement with previous reports. 25It is noted that the binding energies of both Cl 2p for Cl A and Ag 3d for Ag shift 0.6 eV to lower energy, which may be caused by strong interactions between AgCl and AgBr in the as-prepared heterostructures.The calculated surface atomic ratio for Cl, Br, and Ag is 1 : 5.35 : 7.52.Fig. 3(A) presents typical SEM images of the as-prepared AgCl and AgAgBr/AgCl nanoparticles.The AgCl nanoparticles (inset image) display a cubic shape with smooth surfaces.After the ion exchange, highly symmetrical cubic AgCl nanoparticles bound by 100 facets are destroyed.The novel shape of the obtained AgBr/AgCl nanocomposite is that of nanocashews with diameters of 150-300 nm (ESI, Fig. S2 ).SEM-EDAX mapping of the sample shown in Fig. 3(A Further photoreduction produces plasmonic AgAgBrAgCl nanophotocatalyst, which replicates the same shape as pristine nanoparticles, implying small size and even distribution of the Ag nanoparticles on the surfaces of AgBr/AgCl.Due to the surface plasmonic resonance (SPR) effect of the Ag nanograins, the AgAgBr/ AgCl nanocashews exhibit a stronger response in the visible region than pristine AgCl nanocubes (Fig. 3(B)). Based on the SEM investigation of the samples at different stages (Fig. 4), a possible growth mechanism for the conversion of AgCl nanocubes to AgBr/AgCl nanocashews is proposed.At the initial nucleating stage, the anion-exchange reaction was initiated at the corners of the host AgCl nanocubes (Fig. 4b, marked in red circle) due to their high reaction activity.After the AgBr nuclei were produced, they gradually grew up along the near edges of AgCl nanocubes.Then AgBr crystals were slowly wrapped around the host AgCl nanoparticles as the reaction proceeded (Fig. 4c), and the host AgCl nanocubes were transformed into ''nanocashews'' with the composition of AgBr/AgCl (Fig. 4d).The heterostructured AgBr/AgCl nanostructures with smooth surfaces finally formed through an Ostwald ripening process (Fig. 4e).It can be seen that every nanocashew has a quasi-cubic space surrounded by the backbone structure which should be the trace amount of the host AgCl cubes. As is known, appropriate adsorption capacity of pollutant molecules on photocatalysts is crucial for the enhancement of catalytic activity. 272882930 Compared to polyhedral AgAgBr and commercial TiO 2 (P25), the cashew-like AgAgBr/AgCl nanoparticles show a relatively strong adsorption capacity of RhB molecules (ESI, Fig. S4 ), which is beneficial for enhancing their photocatalytic activity.Spectral analyses (ESI, Fig. S5 ) indicate that 32.9 of RhB molecules are adsorbed on the photocatalyst.Fig. 5(A) shows the evolution of the absorption spectra of RhB with reaction time.The color of RhB solution gradually changes from initially pink to transparent as the reaction proceeds (ESI, Fig. S6 ).Therefore, RhB molecules can be decomposed steadily with the assistance of AgAgBr/AgCl nanoparticles.However, the degradation of RhB under the same conditions by commercial TiO 2 (P25) and without any photocatalyst was almost nonexistent, confirming the crucial role of AgAgBr/AgCl nanoparticles in the bleaching of organic pollutant molecules.Meanwhile, RhB can be completely decomposed within 2 min when catalyzed by AgAgBr/AgCl nanocashews, whereas only 94 is decomposed with AgAgBr polyhedrons.The relationship between ln(C 0 /C) and irradiation time (t) in Fig. 5(B) is linear, indicating that the reaction follows first-order kinetics with the rate constant determined to be 2.68 min A1 . For practical purposes, a photocatalyst should be also stable under repeated use.To evaluate the stability of the present photocatalyst, the AgAgBr/AgCl nanoparticles were collected by centrifuging the solution so as to catalyze a new reaction.Fig. 6 shows the degradation kinetics of RhB for 20 reaction runs using the same batch of nanophotocatalyst.The result verifies that the photocatalyst can keep a high efficiency under recycling reactions even though the activity slightly reduces.To a certain extent, the gradual decrease of activity can be attributed to the unavoidable loss of catalyst during the process of sampling and collecting of the photocatalyst.An SEM image of the used photocatalyst (ESI, Fig. S7 ) also demonstrates that the microstructure of the nanoparticles is retained well after circulation.Therefore, the as-prepared AgAgBr/AgCl nanocashews can be used as a class of highly efficient and stable photocatalyst under visible light irradiation. Since the amount of carbon dioxide (CO 2 ) in the global atmosphere has increased as the human race has advanced technologically, there has been growing interest in the development of novel artificial methods that capture and concentrate large quantities of atmospheric CO 2 for subsequent conversion into fuels.Of the many different methods developed so far, the reduction of CO 2 with H 2 O through irradiation of aqueous suspension systems is regarded as a potential avenue to facilitate CO 2 conversion into useful energy fuels, 31,32 involving a variety of catalytically active semiconductor powders to generate methanol or other organic compounds.However, the pioneering of visible-light-driven photocatalysts for highly efficient CO 2 reduction is still a challenging mission.Herein, we have also evaluated the ability of the present AgAgBr/AgCl nanostructure to reduce CO 2 in aqueous solution under visible light irradiation of our self-made system.After reacting for 5 h, GC-MS and GC analyses show that the major products for the reduction of CO 2 are methanol and ethanol.Fig. 7 gives the yield of the photocatalytic products in five reaction runs.The average yields of methanol and ethanol are 226.68 and 329.18 mmol g A1 , respectively, which are higher than reported values. 33,34For each run, the yields of the products do not reduce greatly.Thus the AgAgBr/AgCl nanocashews can be applied as a potential candidate for the visible-light reduction of CO 2 with improved efficiency.The high activity of the as-prepared AgAgBr/AgCl for CO 2 reduction is attributed to the strong response in the visible region due to the SPR contribution of metallic Ag 0 .In addition, the enhanced adsorption capacity may also strengthen the adsorption of CO 2 or CO 3 2A , which is helpful for the reduction reaction.Of course, the detailed mechanism is still unclear.A detailed study is needed to give further insight into the conversion pathway.On the basis of the aforementioned results and analyses, a possible mechanism is proposed to explain the high activity and stability of the as-prepared AgAgBr/AgCl nanophotocatalyst.The plasmonic absorption of the Ag nanograins (or nanoparticles) in the visible region makes the asprepared AgAgBr/AgCl present an enhanced visible-light response. 17Under visible light irradiation, the AgBr component with an absorption band at 400-750 nm can be excited by the visible light and produces photogenerated carriers. 35As a sink for these photoinduced charges, the Ag species on the surfaces of AgBr/AgCl prevents the recombination of photogenerated charges, and thus improves the efficiency of the charge transfer process.Additionally, the well-defined interfaces between Ag and AgBr/AgCl can also improve the rate of interfacial charge transfer.As a result, the photoexcited electrons can be accepted by O 2 adsorbed on the surface of AgAgBr/AgCl and formO 2 A , OH and other reactive oxygen species, which would then oxidize RhB molecules. 36,37The holes will transfer to the surface of AgBr/AgCl to decompose the RhB molecules directly, or oxidize Br A ions to Br 0 atoms which are also reactive radical species to decompose RhB molecules. 17,38n the process for the degradation of RhB,O 2 A ,OH and h are supposed to be the main active species.To further elucidate the photocatalytic mechanism and examine the roles of radicals, radical and hole scavengers, including HCO 3 A , t-butanol and pbenzoquinone, were introduced into the system.As shown in Fig. 8, the degradation of RhB is significantly depressed by the O 2 A scavenger p-benzoquinone, leading to only 80.7 removal of RhB.However, HCO 3 A , a scavenger of h and the adsorbed OH, has no obvious influence.Similarly, no significant changes in the degradation are observed with the addition of 0.1 M t-butanol Fig. 6 The degradation curves of RhB solution for 20 successive reactions catalyzed with the same batch of AgAgBr/AgCl nanoparticles (as shown in Fig. 1) under visible light irradiation.which predominantly scavenges OH in the solution.Hence the O 2 A radical is the main reactive species in the reaction.The possible process of the degradation of RhB can be proposed as follows.Under visible light irradiation, both the plasmoninduced Ag nanograins and the excited AgBr/AgCl can generate e A -h pairs.The photoexcited electrons will transfer to the Ag nanograins rather than to the Ag ions of the AgCl lattice, and then the photogenerated electrons will be trapped by O 2 in the solution to form O 2 A and other oxygen species for the degradation of RhB.Meanwhile, the fast migration of electrons to the surface protects AgBr/AgCl from reduction to Ag, ensuring the high stability of AgAgBr/AgCl."}, {"llm generation": "AgAgBr/AgCl", "source": "In summary, we have demonstrated a facile anion-exchange process for the synthesis of a cashew-like plasmonic AgAgBr/ AgCl nanophotocatalyst.", "context": "In summary, we have demonstrated a facile anion-exchange process for the synthesis of a cashew-like plasmonic AgAgBr/ AgCl nanophotocatalyst.The as-prepared photocatalyst exhibits a relatively strong adsorption for dye molecules, which is beneficial for enhancing its photocatalytic activity.RhB molecules can be decomposed completely within 2 min under visible light irradiation.The photocatalyst can be reused 20 times without much decrease of its activity.Furthermore, radical trapping tests confirm that O 2 A is the main active species in the reaction.In addition, this shaped photocatalyst also displays high activity towards visible-light conversion of CO 2 into fuels, i.e. methanol/ ethanol.Therefore, the novel cashew-like shape, intrinsic high adsorption, and excellent photocatalytic performance of the heterostructured AgAgBr/AgCl photocatalyst make it a promising material in environmental remediation, water disinfection, and resourceful utilization of CO 2 . ) (ESI, Fig. S3 ) confirms the presence of Ag, Br and Cl elements and their distributions in the sample, showing the sample consists of heterostructured nanocashews. Fig.1XRD patterns of (A) AgBr/AgCl and (B) AgAgBr/AgCl. Fig. 2 XPS spectra of the obtained AgAgBr/AgCl: (A) Ag 3d; (B) Br 3d and Cl 2p. Fig.3(A) SEM images of the as-prepared AgAgBr/AgCl and (inset) AgCl.(B) UV-vis absorption spectra of AgCl and AgAgBr/AgCl. Fig. 4 SEM images for the shape evolution of the samples at different reaction stages: (a) 0 min, (b) 20 min, (c) 60 min, (d) 180 min, and (e) 600 min. Fig. 5 (A) The change of UV-visible spectra for RhB with the reaction time.(B) The normalized concentration of RhB as a function of reaction time with both linear and logarithmic scales.C 0 is the concentration of RhB before irradiation; C is the concentration of RhB at the reaction time t. Fig. 7 Yields of photocatalytic products with the number of reaction runs under 5 h visible light irradiation with the same batch of AgAgBr/ AgCl nanocashews. Fig. 8 Photodegradation kinetics of RhB in AgAgBr/AgCl water dispersion under visible light irradiation with different scavengers (10 mM NaHCO 3 , 5 mM p-benzoquinone, 0.1 M t-butanol). This journal is a The Royal Society of Chemistry 2012 Downloaded by Stanford University on 16 June 2012 Published on 27 April 2012 on http://pubs.rsc.org doi:10.1039/C2JM31736BView Online J. Mater.Chem., 2012, 22, 13153-13158 13155 Downloaded by Stanford University on 16 June 2012 Published on 27 April 2012 on http://pubs.rsc.org doi:10.1039/C2JM31736BView Online Downloaded by Stanford University on 16 June 2012 Published on 27 April 2012 on http://pubs.rsc.org doi:10.1039/C2JM31736BView Online J. Mater.Chem., 2012, 22, 13153-13158 13157 Downloaded by Stanford University on 16 June 2012 Published on 27 April 2012 on http://pubs.rsc.org doi:10.1039/C2JM31736BView Online This work is financially supported by the National Natural Science Foundation of China (grant no.21001116) and the Fundamental Research Funds for the Central Universities (10CX04025A)."}], "co-catalyst": [{"llm generation": "Ag", "source": "Then the dispersion was irradiated under visible light for 30 min to convert some Ag ions on the surface region of AgBr/AgCl to Ag 0 species.", "context": "Silver nitrate (AgNO 3 ), sodium chloride (NaCl), sodium bicarbonate (NaHCO 3 ), sodium bromide (NaBr), ethylene glycol (EG), polyvinylpyrrolidone (PVP), and rhodamine-B (RhB) were purchased from Sinopharm Chemical Reagent Co., Ltd (Shanghai, China).All the reagents were used as received without further purification. The AgBr/AgCl nanocomposite was synthesized by an anionexchange reaction of Br A ions with AgCl nanocubes, which could be easily achieved using our reported method. 14In a typical procedure, AgCl nanocubes were firstly dispersed in 10 mL of deionized water in the presence of PVP (27.1 mg).After an aqueous solution of NaBr (0.61 mM, 10 mL) was rapidly added, the reaction was continued under vigorous magnetic stirring for about 10 h.The obtained product was rinsed with de-ionized water several times and dispersed in 10 mL of de-ionized water.Then the dispersion was irradiated under visible light for 30 min to convert some Ag ions on the surface region of AgBr/AgCl to Ag 0 species.The solution color changed gradually from light yellow to bluish violet, indicating the production and assembly of Ag nanoparticles on the surfaces of AgBr/AgCl.For comparison, polyhedral AgAgBr nanoparticles were also prepared by a similar process except without the anion-exchange reaction. The crystal structure of the samples was examined by X-ray powder diffraction (XRD) on a Philips X'Pert diffractometer with Cu Ka radiation (l 14 0.15418 nm).The morphology was observed with a Hitachi S-4800 field emission scanning electronic microscopy (FESEM) instrument.The absorbance spectra of the catalyst were measured by a UV-vis spectrometer (UV-2550, Shimadzu) in a range of 230 to 1000 nm.The content of Ag species in the AgAgBr/AgCl surface was confirmed by X-ray photoelectron spectra (XPS), recorded on a Perkin-Elmer PHI-5300 spectrometer, using non-monochromatized Mg Ka radiation as excitation source in a vacuum of 10 A7 Pa.The charge shift correction was made and the C 1s electron binding energy of 284.6 eV was used for calibration of the instrument.The XPS spectra were fitted using a combined polynomial and Shirley-type background function. The photocatalytic performance of AgAgBr/AgCl was evaluated through degradation of RhB dye and reduction of CO 2 using a 300 W Xe arc lamp (PLS-SXE300/300UV) equipped with a UV cut-off filter as the source of visible light. For degradation of RhB, 10 mL of a water dispersion of the asprepared AgAgBr/AgCl nanocashews was transferred to an aqueous solution of RhB (10 mL, 20 mg L A1 ).The dispersion was kept in the dark for 1 h under magnetic stirring to reach the adsorption-desorption equilibrium.The degradation of RhB was monitored by UV-vis spectra.After the reaction was completed, centrifuging the solution enabled the AgAgBr/ AgCl nanoparticles to be collected to catalyze subsequent reactions.For comparison, investigations without photocatalyst, and with polyhedral AgAgBr and commercial TiO 2 (P25) were also carried out. The reduction of CO 2 was performed in a self-made photocatalytic reactor as shown in the ESI (Fig. S1 ).Two portions of AgAgBr/AgCl nanoparticles were dispersed in 50 mL of sodium bicarbonate aqueous solution (0.1 M) with magnetic stirring in the vessel.Prior to irradiation, CO 2 with a purity of 99 was bubbled through the solution with a rate of 0.7 L min A1 for 10 min to remove air and saturate the solution.The reaction was then performed under visible light irradiation (l 400 nm), and the temperature was kept at 0 C by an ice-bath so as to increase the solubility of CO 2 .Centrifugation (10 000 rpm) of the reaction mixtures enabled the catalyst to be easily separated from the liquid solution of the samples.The catalyst was collected for use in triggering new reactions.The product in the solution was first qualitatively analyzed by an Agilent GC7890A (FID detector, CP-WAX58 FFAP columns) through observing the chromatographic peaks related to the elution of alcohol and then comparing them with those for an authentic ethanol standard.This identification was then confirmed by a GC/MS-5975C (Agilent, DB-1 capillary columns).The content of alcohol in the products was determined by an Agilent GC7890A.Blank tests under visible light irradiation without the photocatalyst and in the dark with the photocatalyst under the same experimental conditions were also conducted."}, {"llm generation": "metallic Ag nanoparticles", "source": "Fig. 1(B) demonstrates that metallic Ag nanoparticles (JCPDS card no.87-0717) have been generated on the surfaces of AgBr/ AgCl after photoreduction.", "context": "Crystalline phase and surface composition were investigated by X-ray powder diffraction (XRD) and X-ray photoelectronic spectra (XPS), respectively.Fig. 1(A) shows that the sample consists of face-centred cubic (fcc) AgBr (JCPDS card no.79-0149) and a small amount of AgCl (JCPDS card no.31-1238), which is caused by incomplete replacement of AgCl by Br A .Fig. 1(B) demonstrates that metallic Ag nanoparticles (JCPDS card no.87-0717) have been generated on the surfaces of AgBr/ AgCl after photoreduction.The elemental composition, chemical status, and silver content of AgAgBr/AgCl were further determined by means of XPS (Fig. 2).Before visible light irradiation, XPS analyses indicate that AgBr/AgCl contained the elements Ag, Cl, Br, and C. The carbon peak is due to adventitious hydrocarbon from the XPS instrument.The elements Ag, Cl, and Br come from the AgBr/AgCl sample.In Fig. 2(A), the two peaks at approximately 367 eV and 373 eV can be ascribed to the binding energies of Ag 3d 5/2 and Ag 3d 3/2 , respectively. 23,25,26he 3d 5/2 and Ag 3d 3/2 peaks can be further divided into two different bands, 367.1 eV, 368.2 eV, 373.1 eV, and 374.3 eV, respectively.The bands at 367.1 eV and 373.1 eV are attributed to Ag , and those at 368.2 eV and 374.3 eV are attributed to metallic Ag 0 .The calculated content of surface Ag 0 for the corresponding sample is 7.83 mol.The spectra of Cl 2p and Br 3d are shown in Fig. 2(B).The binding energies of Cl 2p 1/2 and Cl 2p 3/2 are about 199.0 eV and 197.3 eV, respectively.The spectrum of Br 3d shows that the binding energies of Br 3d 3/2 and Br 3d 5/2 are 68.7 and 67.7 eV, in agreement with previous reports. 25It is noted that the binding energies of both Cl 2p for Cl A and Ag 3d for Ag shift 0.6 eV to lower energy, which may be caused by strong interactions between AgCl and AgBr in the as-prepared heterostructures.The calculated surface atomic ratio for Cl, Br, and Ag is 1 : 5.35 : 7.52.Fig. 3(A) presents typical SEM images of the as-prepared AgCl and AgAgBr/AgCl nanoparticles.The AgCl nanoparticles (inset image) display a cubic shape with smooth surfaces.After the ion exchange, highly symmetrical cubic AgCl nanoparticles bound by 100 facets are destroyed.The novel shape of the obtained AgBr/AgCl nanocomposite is that of nanocashews with diameters of 150-300 nm (ESI, Fig. S2 ).SEM-EDAX mapping of the sample shown in Fig. 3(A Further photoreduction produces plasmonic AgAgBrAgCl nanophotocatalyst, which replicates the same shape as pristine nanoparticles, implying small size and even distribution of the Ag nanoparticles on the surfaces of AgBr/AgCl.Due to the surface plasmonic resonance (SPR) effect of the Ag nanograins, the AgAgBr/ AgCl nanocashews exhibit a stronger response in the visible region than pristine AgCl nanocubes (Fig. 3(B)). Based on the SEM investigation of the samples at different stages (Fig. 4), a possible growth mechanism for the conversion of AgCl nanocubes to AgBr/AgCl nanocashews is proposed.At the initial nucleating stage, the anion-exchange reaction was initiated at the corners of the host AgCl nanocubes (Fig. 4b, marked in red circle) due to their high reaction activity.After the AgBr nuclei were produced, they gradually grew up along the near edges of AgCl nanocubes.Then AgBr crystals were slowly wrapped around the host AgCl nanoparticles as the reaction proceeded (Fig. 4c), and the host AgCl nanocubes were transformed into ''nanocashews'' with the composition of AgBr/AgCl (Fig. 4d).The heterostructured AgBr/AgCl nanostructures with smooth surfaces finally formed through an Ostwald ripening process (Fig. 4e).It can be seen that every nanocashew has a quasi-cubic space surrounded by the backbone structure which should be the trace amount of the host AgCl cubes. As is known, appropriate adsorption capacity of pollutant molecules on photocatalysts is crucial for the enhancement of catalytic activity. 272882930 Compared to polyhedral AgAgBr and commercial TiO 2 (P25), the cashew-like AgAgBr/AgCl nanoparticles show a relatively strong adsorption capacity of RhB molecules (ESI, Fig. S4 ), which is beneficial for enhancing their photocatalytic activity.Spectral analyses (ESI, Fig. S5 ) indicate that 32.9 of RhB molecules are adsorbed on the photocatalyst.Fig. 5(A) shows the evolution of the absorption spectra of RhB with reaction time.The color of RhB solution gradually changes from initially pink to transparent as the reaction proceeds (ESI, Fig. S6 ).Therefore, RhB molecules can be decomposed steadily with the assistance of AgAgBr/AgCl nanoparticles.However, the degradation of RhB under the same conditions by commercial TiO 2 (P25) and without any photocatalyst was almost nonexistent, confirming the crucial role of AgAgBr/AgCl nanoparticles in the bleaching of organic pollutant molecules.Meanwhile, RhB can be completely decomposed within 2 min when catalyzed by AgAgBr/AgCl nanocashews, whereas only 94 is decomposed with AgAgBr polyhedrons.The relationship between ln(C 0 /C) and irradiation time (t) in Fig. 5(B) is linear, indicating that the reaction follows first-order kinetics with the rate constant determined to be 2.68 min A1 . For practical purposes, a photocatalyst should be also stable under repeated use.To evaluate the stability of the present photocatalyst, the AgAgBr/AgCl nanoparticles were collected by centrifuging the solution so as to catalyze a new reaction.Fig. 6 shows the degradation kinetics of RhB for 20 reaction runs using the same batch of nanophotocatalyst.The result verifies that the photocatalyst can keep a high efficiency under recycling reactions even though the activity slightly reduces.To a certain extent, the gradual decrease of activity can be attributed to the unavoidable loss of catalyst during the process of sampling and collecting of the photocatalyst.An SEM image of the used photocatalyst (ESI, Fig. S7 ) also demonstrates that the microstructure of the nanoparticles is retained well after circulation.Therefore, the as-prepared AgAgBr/AgCl nanocashews can be used as a class of highly efficient and stable photocatalyst under visible light irradiation. Since the amount of carbon dioxide (CO 2 ) in the global atmosphere has increased as the human race has advanced technologically, there has been growing interest in the development of novel artificial methods that capture and concentrate large quantities of atmospheric CO 2 for subsequent conversion into fuels.Of the many different methods developed so far, the reduction of CO 2 with H 2 O through irradiation of aqueous suspension systems is regarded as a potential avenue to facilitate CO 2 conversion into useful energy fuels, 31,32 involving a variety of catalytically active semiconductor powders to generate methanol or other organic compounds.However, the pioneering of visible-light-driven photocatalysts for highly efficient CO 2 reduction is still a challenging mission.Herein, we have also evaluated the ability of the present AgAgBr/AgCl nanostructure to reduce CO 2 in aqueous solution under visible light irradiation of our self-made system.After reacting for 5 h, GC-MS and GC analyses show that the major products for the reduction of CO 2 are methanol and ethanol.Fig. 7 gives the yield of the photocatalytic products in five reaction runs.The average yields of methanol and ethanol are 226.68 and 329.18 mmol g A1 , respectively, which are higher than reported values. 33,34For each run, the yields of the products do not reduce greatly.Thus the AgAgBr/AgCl nanocashews can be applied as a potential candidate for the visible-light reduction of CO 2 with improved efficiency.The high activity of the as-prepared AgAgBr/AgCl for CO 2 reduction is attributed to the strong response in the visible region due to the SPR contribution of metallic Ag 0 .In addition, the enhanced adsorption capacity may also strengthen the adsorption of CO 2 or CO 3 2A , which is helpful for the reduction reaction.Of course, the detailed mechanism is still unclear.A detailed study is needed to give further insight into the conversion pathway.On the basis of the aforementioned results and analyses, a possible mechanism is proposed to explain the high activity and stability of the as-prepared AgAgBr/AgCl nanophotocatalyst.The plasmonic absorption of the Ag nanograins (or nanoparticles) in the visible region makes the asprepared AgAgBr/AgCl present an enhanced visible-light response. 17Under visible light irradiation, the AgBr component with an absorption band at 400-750 nm can be excited by the visible light and produces photogenerated carriers. 35As a sink for these photoinduced charges, the Ag species on the surfaces of AgBr/AgCl prevents the recombination of photogenerated charges, and thus improves the efficiency of the charge transfer process.Additionally, the well-defined interfaces between Ag and AgBr/AgCl can also improve the rate of interfacial charge transfer.As a result, the photoexcited electrons can be accepted by O 2 adsorbed on the surface of AgAgBr/AgCl and formO 2 A , OH and other reactive oxygen species, which would then oxidize RhB molecules. 36,37The holes will transfer to the surface of AgBr/AgCl to decompose the RhB molecules directly, or oxidize Br A ions to Br 0 atoms which are also reactive radical species to decompose RhB molecules. 17,38n the process for the degradation of RhB,O 2 A ,OH and h are supposed to be the main active species.To further elucidate the photocatalytic mechanism and examine the roles of radicals, radical and hole scavengers, including HCO 3 A , t-butanol and pbenzoquinone, were introduced into the system.As shown in Fig. 8, the degradation of RhB is significantly depressed by the O 2 A scavenger p-benzoquinone, leading to only 80.7 removal of RhB.However, HCO 3 A , a scavenger of h and the adsorbed OH, has no obvious influence.Similarly, no significant changes in the degradation are observed with the addition of 0.1 M t-butanol Fig. 6 The degradation curves of RhB solution for 20 successive reactions catalyzed with the same batch of AgAgBr/AgCl nanoparticles (as shown in Fig. 1) under visible light irradiation.which predominantly scavenges OH in the solution.Hence the O 2 A radical is the main reactive species in the reaction.The possible process of the degradation of RhB can be proposed as follows.Under visible light irradiation, both the plasmoninduced Ag nanograins and the excited AgBr/AgCl can generate e A -h pairs.The photoexcited electrons will transfer to the Ag nanograins rather than to the Ag ions of the AgCl lattice, and then the photogenerated electrons will be trapped by O 2 in the solution to form O 2 A and other oxygen species for the degradation of RhB.Meanwhile, the fast migration of electrons to the surface protects AgBr/AgCl from reduction to Ag, ensuring the high stability of AgAgBr/AgCl."}], "light source": [{"llm generation": "visible light", "source": "For example, only 2 min is taken to completely decompose RhB molecules with the assistance of these novel heterostructured nanoparticles under visible light irradiation.", "context": "Heterostructured AgAgBr/AgCl nanocashews have been synthesized by an anion-exchange reaction between AgCl nanocubes and Br A ions followed by photoreduction.Compared to polyhedral AgAgBr nanoparticles, the obtained nanostructures exhibit enhanced photocatalytic activity towards decomposition of organic pollutants, i.e., rhodamine-B (RhB).For example, only 2 min is taken to completely decompose RhB molecules with the assistance of these novel heterostructured nanoparticles under visible light irradiation.Furthermore, the as-synthesized nanocatalyst can be reused 20 times without losing activity, showing its high stability.Interestingly, the novel heterostructured AgAgBr/AgCl nanophotocatalyst also shows efficient visible light conversion of CO 2 to energetic fuels, e.g.methanol/ethanol.Therefore, the present route opens an avenue to achieve highly efficient visible-light-driven nanophotocatalysts for applications in environmental remediation and resourceful use of CO 2 ."}, {"llm generation": "Visible", "source": "The photocatalytic performance of AgAgBr/AgCl was evaluated through degradation of RhB dye and reduction of CO 2 using a 300 W Xe arc lamp (PLS-SXE300/300UV) equipped with a UV cut-off filter as the source of visible light.", "context": "Silver nitrate (AgNO 3 ), sodium chloride (NaCl), sodium bicarbonate (NaHCO 3 ), sodium bromide (NaBr), ethylene glycol (EG), polyvinylpyrrolidone (PVP), and rhodamine-B (RhB) were purchased from Sinopharm Chemical Reagent Co., Ltd (Shanghai, China).All the reagents were used as received without further purification. The AgBr/AgCl nanocomposite was synthesized by an anionexchange reaction of Br A ions with AgCl nanocubes, which could be easily achieved using our reported method. 14In a typical procedure, AgCl nanocubes were firstly dispersed in 10 mL of deionized water in the presence of PVP (27.1 mg).After an aqueous solution of NaBr (0.61 mM, 10 mL) was rapidly added, the reaction was continued under vigorous magnetic stirring for about 10 h.The obtained product was rinsed with de-ionized water several times and dispersed in 10 mL of de-ionized water.Then the dispersion was irradiated under visible light for 30 min to convert some Ag ions on the surface region of AgBr/AgCl to Ag 0 species.The solution color changed gradually from light yellow to bluish violet, indicating the production and assembly of Ag nanoparticles on the surfaces of AgBr/AgCl.For comparison, polyhedral AgAgBr nanoparticles were also prepared by a similar process except without the anion-exchange reaction. The crystal structure of the samples was examined by X-ray powder diffraction (XRD) on a Philips X'Pert diffractometer with Cu Ka radiation (l 14 0.15418 nm).The morphology was observed with a Hitachi S-4800 field emission scanning electronic microscopy (FESEM) instrument.The absorbance spectra of the catalyst were measured by a UV-vis spectrometer (UV-2550, Shimadzu) in a range of 230 to 1000 nm.The content of Ag species in the AgAgBr/AgCl surface was confirmed by X-ray photoelectron spectra (XPS), recorded on a Perkin-Elmer PHI-5300 spectrometer, using non-monochromatized Mg Ka radiation as excitation source in a vacuum of 10 A7 Pa.The charge shift correction was made and the C 1s electron binding energy of 284.6 eV was used for calibration of the instrument.The XPS spectra were fitted using a combined polynomial and Shirley-type background function. The photocatalytic performance of AgAgBr/AgCl was evaluated through degradation of RhB dye and reduction of CO 2 using a 300 W Xe arc lamp (PLS-SXE300/300UV) equipped with a UV cut-off filter as the source of visible light. For degradation of RhB, 10 mL of a water dispersion of the asprepared AgAgBr/AgCl nanocashews was transferred to an aqueous solution of RhB (10 mL, 20 mg L A1 ).The dispersion was kept in the dark for 1 h under magnetic stirring to reach the adsorption-desorption equilibrium.The degradation of RhB was monitored by UV-vis spectra.After the reaction was completed, centrifuging the solution enabled the AgAgBr/ AgCl nanoparticles to be collected to catalyze subsequent reactions.For comparison, investigations without photocatalyst, and with polyhedral AgAgBr and commercial TiO 2 (P25) were also carried out. The reduction of CO 2 was performed in a self-made photocatalytic reactor as shown in the ESI (Fig. S1 ).Two portions of AgAgBr/AgCl nanoparticles were dispersed in 50 mL of sodium bicarbonate aqueous solution (0.1 M) with magnetic stirring in the vessel.Prior to irradiation, CO 2 with a purity of 99 was bubbled through the solution with a rate of 0.7 L min A1 for 10 min to remove air and saturate the solution.The reaction was then performed under visible light irradiation (l 400 nm), and the temperature was kept at 0 C by an ice-bath so as to increase the solubility of CO 2 .Centrifugation (10 000 rpm) of the reaction mixtures enabled the catalyst to be easily separated from the liquid solution of the samples.The catalyst was collected for use in triggering new reactions.The product in the solution was first qualitatively analyzed by an Agilent GC7890A (FID detector, CP-WAX58 FFAP columns) through observing the chromatographic peaks related to the elution of alcohol and then comparing them with those for an authentic ethanol standard.This identification was then confirmed by a GC/MS-5975C (Agilent, DB-1 capillary columns).The content of alcohol in the products was determined by an Agilent GC7890A.Blank tests under visible light irradiation without the photocatalyst and in the dark with the photocatalyst under the same experimental conditions were also conducted."}, {"llm generation": "Visible light", "source": "RhB molecules can be decomposed completely within 2 min under visible light irradiation.", "context": "In summary, we have demonstrated a facile anion-exchange process for the synthesis of a cashew-like plasmonic AgAgBr/ AgCl nanophotocatalyst.The as-prepared photocatalyst exhibits a relatively strong adsorption for dye molecules, which is beneficial for enhancing its photocatalytic activity.RhB molecules can be decomposed completely within 2 min under visible light irradiation.The photocatalyst can be reused 20 times without much decrease of its activity.Furthermore, radical trapping tests confirm that O 2 A is the main active species in the reaction.In addition, this shaped photocatalyst also displays high activity towards visible-light conversion of CO 2 into fuels, i.e. methanol/ ethanol.Therefore, the novel cashew-like shape, intrinsic high adsorption, and excellent photocatalytic performance of the heterostructured AgAgBr/AgCl photocatalyst make it a promising material in environmental remediation, water disinfection, and resourceful utilization of CO 2 . ) (ESI, Fig. S3 ) confirms the presence of Ag, Br and Cl elements and their distributions in the sample, showing the sample consists of heterostructured nanocashews. Fig.1XRD patterns of (A) AgBr/AgCl and (B) AgAgBr/AgCl. Fig. 2 XPS spectra of the obtained AgAgBr/AgCl: (A) Ag 3d; (B) Br 3d and Cl 2p. Fig.3(A) SEM images of the as-prepared AgAgBr/AgCl and (inset) AgCl.(B) UV-vis absorption spectra of AgCl and AgAgBr/AgCl. Fig. 4 SEM images for the shape evolution of the samples at different reaction stages: (a) 0 min, (b) 20 min, (c) 60 min, (d) 180 min, and (e) 600 min. Fig. 5 (A) The change of UV-visible spectra for RhB with the reaction time.(B) The normalized concentration of RhB as a function of reaction time with both linear and logarithmic scales.C 0 is the concentration of RhB before irradiation; C is the concentration of RhB at the reaction time t. Fig. 7 Yields of photocatalytic products with the number of reaction runs under 5 h visible light irradiation with the same batch of AgAgBr/ AgCl nanocashews. Fig. 8 Photodegradation kinetics of RhB in AgAgBr/AgCl water dispersion under visible light irradiation with different scavengers (10 mM NaHCO 3 , 5 mM p-benzoquinone, 0.1 M t-butanol). This journal is a The Royal Society of Chemistry 2012 Downloaded by Stanford University on 16 June 2012 Published on 27 April 2012 on http://pubs.rsc.org doi:10.1039/C2JM31736BView Online J. Mater.Chem., 2012, 22, 13153-13158 13155 Downloaded by Stanford University on 16 June 2012 Published on 27 April 2012 on http://pubs.rsc.org doi:10.1039/C2JM31736BView Online Downloaded by Stanford University on 16 June 2012 Published on 27 April 2012 on http://pubs.rsc.org doi:10.1039/C2JM31736BView Online J. Mater.Chem., 2012, 22, 13153-13158 13157 Downloaded by Stanford University on 16 June 2012 Published on 27 April 2012 on http://pubs.rsc.org doi:10.1039/C2JM31736BView Online This work is financially supported by the National Natural Science Foundation of China (grant no.21001116) and the Fundamental Research Funds for the Central Universities (10CX04025A)."}], "lamp": [{"llm generation": "Xenon", "source": "The photocatalytic performance of AgAgBr/AgCl was evaluated through degradation of RhB dye and reduction of CO 2 using a 300 W Xe arc lamp (PLS-SXE300/300UV) equipped with a UV cut-off filter as the source of visible light.", "context": "Silver nitrate (AgNO 3 ), sodium chloride (NaCl), sodium bicarbonate (NaHCO 3 ), sodium bromide (NaBr), ethylene glycol (EG), polyvinylpyrrolidone (PVP), and rhodamine-B (RhB) were purchased from Sinopharm Chemical Reagent Co., Ltd (Shanghai, China).All the reagents were used as received without further purification. The AgBr/AgCl nanocomposite was synthesized by an anionexchange reaction of Br A ions with AgCl nanocubes, which could be easily achieved using our reported method. 14In a typical procedure, AgCl nanocubes were firstly dispersed in 10 mL of deionized water in the presence of PVP (27.1 mg).After an aqueous solution of NaBr (0.61 mM, 10 mL) was rapidly added, the reaction was continued under vigorous magnetic stirring for about 10 h.The obtained product was rinsed with de-ionized water several times and dispersed in 10 mL of de-ionized water.Then the dispersion was irradiated under visible light for 30 min to convert some Ag ions on the surface region of AgBr/AgCl to Ag 0 species.The solution color changed gradually from light yellow to bluish violet, indicating the production and assembly of Ag nanoparticles on the surfaces of AgBr/AgCl.For comparison, polyhedral AgAgBr nanoparticles were also prepared by a similar process except without the anion-exchange reaction. The crystal structure of the samples was examined by X-ray powder diffraction (XRD) on a Philips X'Pert diffractometer with Cu Ka radiation (l 14 0.15418 nm).The morphology was observed with a Hitachi S-4800 field emission scanning electronic microscopy (FESEM) instrument.The absorbance spectra of the catalyst were measured by a UV-vis spectrometer (UV-2550, Shimadzu) in a range of 230 to 1000 nm.The content of Ag species in the AgAgBr/AgCl surface was confirmed by X-ray photoelectron spectra (XPS), recorded on a Perkin-Elmer PHI-5300 spectrometer, using non-monochromatized Mg Ka radiation as excitation source in a vacuum of 10 A7 Pa.The charge shift correction was made and the C 1s electron binding energy of 284.6 eV was used for calibration of the instrument.The XPS spectra were fitted using a combined polynomial and Shirley-type background function. The photocatalytic performance of AgAgBr/AgCl was evaluated through degradation of RhB dye and reduction of CO 2 using a 300 W Xe arc lamp (PLS-SXE300/300UV) equipped with a UV cut-off filter as the source of visible light. For degradation of RhB, 10 mL of a water dispersion of the asprepared AgAgBr/AgCl nanocashews was transferred to an aqueous solution of RhB (10 mL, 20 mg L A1 ).The dispersion was kept in the dark for 1 h under magnetic stirring to reach the adsorption-desorption equilibrium.The degradation of RhB was monitored by UV-vis spectra.After the reaction was completed, centrifuging the solution enabled the AgAgBr/ AgCl nanoparticles to be collected to catalyze subsequent reactions.For comparison, investigations without photocatalyst, and with polyhedral AgAgBr and commercial TiO 2 (P25) were also carried out. The reduction of CO 2 was performed in a self-made photocatalytic reactor as shown in the ESI (Fig. S1 ).Two portions of AgAgBr/AgCl nanoparticles were dispersed in 50 mL of sodium bicarbonate aqueous solution (0.1 M) with magnetic stirring in the vessel.Prior to irradiation, CO 2 with a purity of 99 was bubbled through the solution with a rate of 0.7 L min A1 for 10 min to remove air and saturate the solution.The reaction was then performed under visible light irradiation (l 400 nm), and the temperature was kept at 0 C by an ice-bath so as to increase the solubility of CO 2 .Centrifugation (10 000 rpm) of the reaction mixtures enabled the catalyst to be easily separated from the liquid solution of the samples.The catalyst was collected for use in triggering new reactions.The product in the solution was first qualitatively analyzed by an Agilent GC7890A (FID detector, CP-WAX58 FFAP columns) through observing the chromatographic peaks related to the elution of alcohol and then comparing them with those for an authentic ethanol standard.This identification was then confirmed by a GC/MS-5975C (Agilent, DB-1 capillary columns).The content of alcohol in the products was determined by an Agilent GC7890A.Blank tests under visible light irradiation without the photocatalyst and in the dark with the photocatalyst under the same experimental conditions were also conducted."}], "reaction medium": [{"llm generation": "Liquid", "source": "For degradation of RhB, 10 mL of a water dispersion of the asprepared AgAgBr/AgCl nanocashews was transferred to an aqueous solution of RhB (10 mL, 20 mg L A1 ).", "context": "Silver nitrate (AgNO 3 ), sodium chloride (NaCl), sodium bicarbonate (NaHCO 3 ), sodium bromide (NaBr), ethylene glycol (EG), polyvinylpyrrolidone (PVP), and rhodamine-B (RhB) were purchased from Sinopharm Chemical Reagent Co., Ltd (Shanghai, China).All the reagents were used as received without further purification. The AgBr/AgCl nanocomposite was synthesized by an anionexchange reaction of Br A ions with AgCl nanocubes, which could be easily achieved using our reported method. 14In a typical procedure, AgCl nanocubes were firstly dispersed in 10 mL of deionized water in the presence of PVP (27.1 mg).After an aqueous solution of NaBr (0.61 mM, 10 mL) was rapidly added, the reaction was continued under vigorous magnetic stirring for about 10 h.The obtained product was rinsed with de-ionized water several times and dispersed in 10 mL of de-ionized water.Then the dispersion was irradiated under visible light for 30 min to convert some Ag ions on the surface region of AgBr/AgCl to Ag 0 species.The solution color changed gradually from light yellow to bluish violet, indicating the production and assembly of Ag nanoparticles on the surfaces of AgBr/AgCl.For comparison, polyhedral AgAgBr nanoparticles were also prepared by a similar process except without the anion-exchange reaction. The crystal structure of the samples was examined by X-ray powder diffraction (XRD) on a Philips X'Pert diffractometer with Cu Ka radiation (l 14 0.15418 nm).The morphology was observed with a Hitachi S-4800 field emission scanning electronic microscopy (FESEM) instrument.The absorbance spectra of the catalyst were measured by a UV-vis spectrometer (UV-2550, Shimadzu) in a range of 230 to 1000 nm.The content of Ag species in the AgAgBr/AgCl surface was confirmed by X-ray photoelectron spectra (XPS), recorded on a Perkin-Elmer PHI-5300 spectrometer, using non-monochromatized Mg Ka radiation as excitation source in a vacuum of 10 A7 Pa.The charge shift correction was made and the C 1s electron binding energy of 284.6 eV was used for calibration of the instrument.The XPS spectra were fitted using a combined polynomial and Shirley-type background function. The photocatalytic performance of AgAgBr/AgCl was evaluated through degradation of RhB dye and reduction of CO 2 using a 300 W Xe arc lamp (PLS-SXE300/300UV) equipped with a UV cut-off filter as the source of visible light. For degradation of RhB, 10 mL of a water dispersion of the asprepared AgAgBr/AgCl nanocashews was transferred to an aqueous solution of RhB (10 mL, 20 mg L A1 ).The dispersion was kept in the dark for 1 h under magnetic stirring to reach the adsorption-desorption equilibrium.The degradation of RhB was monitored by UV-vis spectra.After the reaction was completed, centrifuging the solution enabled the AgAgBr/ AgCl nanoparticles to be collected to catalyze subsequent reactions.For comparison, investigations without photocatalyst, and with polyhedral AgAgBr and commercial TiO 2 (P25) were also carried out. The reduction of CO 2 was performed in a self-made photocatalytic reactor as shown in the ESI (Fig. S1 ).Two portions of AgAgBr/AgCl nanoparticles were dispersed in 50 mL of sodium bicarbonate aqueous solution (0.1 M) with magnetic stirring in the vessel.Prior to irradiation, CO 2 with a purity of 99 was bubbled through the solution with a rate of 0.7 L min A1 for 10 min to remove air and saturate the solution.The reaction was then performed under visible light irradiation (l 400 nm), and the temperature was kept at 0 C by an ice-bath so as to increase the solubility of CO 2 .Centrifugation (10 000 rpm) of the reaction mixtures enabled the catalyst to be easily separated from the liquid solution of the samples.The catalyst was collected for use in triggering new reactions.The product in the solution was first qualitatively analyzed by an Agilent GC7890A (FID detector, CP-WAX58 FFAP columns) through observing the chromatographic peaks related to the elution of alcohol and then comparing them with those for an authentic ethanol standard.This identification was then confirmed by a GC/MS-5975C (Agilent, DB-1 capillary columns).The content of alcohol in the products was determined by an Agilent GC7890A.Blank tests under visible light irradiation without the photocatalyst and in the dark with the photocatalyst under the same experimental conditions were also conducted."}, {"llm generation": "Liquid", "source": "Fig. 8 Photodegradation kinetics of RhB in AgAgBr/AgCl water dispersion under visible light irradiation with different scavengers (10 mM NaHCO 3 , 5 mM p-benzoquinone, 0.1 M t-butanol).", "context": "In summary, we have demonstrated a facile anion-exchange process for the synthesis of a cashew-like plasmonic AgAgBr/ AgCl nanophotocatalyst.The as-prepared photocatalyst exhibits a relatively strong adsorption for dye molecules, which is beneficial for enhancing its photocatalytic activity.RhB molecules can be decomposed completely within 2 min under visible light irradiation.The photocatalyst can be reused 20 times without much decrease of its activity.Furthermore, radical trapping tests confirm that O 2 A is the main active species in the reaction.In addition, this shaped photocatalyst also displays high activity towards visible-light conversion of CO 2 into fuels, i.e. methanol/ ethanol.Therefore, the novel cashew-like shape, intrinsic high adsorption, and excellent photocatalytic performance of the heterostructured AgAgBr/AgCl photocatalyst make it a promising material in environmental remediation, water disinfection, and resourceful utilization of CO 2 . ) (ESI, Fig. S3 ) confirms the presence of Ag, Br and Cl elements and their distributions in the sample, showing the sample consists of heterostructured nanocashews. Fig.1XRD patterns of (A) AgBr/AgCl and (B) AgAgBr/AgCl. Fig. 2 XPS spectra of the obtained AgAgBr/AgCl: (A) Ag 3d; (B) Br 3d and Cl 2p. Fig.3(A) SEM images of the as-prepared AgAgBr/AgCl and (inset) AgCl.(B) UV-vis absorption spectra of AgCl and AgAgBr/AgCl. Fig. 4 SEM images for the shape evolution of the samples at different reaction stages: (a) 0 min, (b) 20 min, (c) 60 min, (d) 180 min, and (e) 600 min. Fig. 5 (A) The change of UV-visible spectra for RhB with the reaction time.(B) The normalized concentration of RhB as a function of reaction time with both linear and logarithmic scales.C 0 is the concentration of RhB before irradiation; C is the concentration of RhB at the reaction time t. Fig. 7 Yields of photocatalytic products with the number of reaction runs under 5 h visible light irradiation with the same batch of AgAgBr/ AgCl nanocashews. Fig. 8 Photodegradation kinetics of RhB in AgAgBr/AgCl water dispersion under visible light irradiation with different scavengers (10 mM NaHCO 3 , 5 mM p-benzoquinone, 0.1 M t-butanol). This journal is a The Royal Society of Chemistry 2012 Downloaded by Stanford University on 16 June 2012 Published on 27 April 2012 on http://pubs.rsc.org doi:10.1039/C2JM31736BView Online J. Mater.Chem., 2012, 22, 13153-13158 13155 Downloaded by Stanford University on 16 June 2012 Published on 27 April 2012 on http://pubs.rsc.org doi:10.1039/C2JM31736BView Online Downloaded by Stanford University on 16 June 2012 Published on 27 April 2012 on http://pubs.rsc.org doi:10.1039/C2JM31736BView Online J. Mater.Chem., 2012, 22, 13153-13158 13157 Downloaded by Stanford University on 16 June 2012 Published on 27 April 2012 on http://pubs.rsc.org doi:10.1039/C2JM31736BView Online This work is financially supported by the National Natural Science Foundation of China (grant no.21001116) and the Fundamental Research Funds for the Central Universities (10CX04025A)."}], "reactor type": [{"llm generation": "Slurry", "source": "Two portions of AgAgBr/AgCl nanoparticles were dispersed in 50 mL of sodium bicarbonate aqueous solution (0.1 M) with magnetic stirring in the vessel.", "context": "Silver nitrate (AgNO 3 ), sodium chloride (NaCl), sodium bicarbonate (NaHCO 3 ), sodium bromide (NaBr), ethylene glycol (EG), polyvinylpyrrolidone (PVP), and rhodamine-B (RhB) were purchased from Sinopharm Chemical Reagent Co., Ltd (Shanghai, China).All the reagents were used as received without further purification. The AgBr/AgCl nanocomposite was synthesized by an anionexchange reaction of Br A ions with AgCl nanocubes, which could be easily achieved using our reported method. 14In a typical procedure, AgCl nanocubes were firstly dispersed in 10 mL of deionized water in the presence of PVP (27.1 mg).After an aqueous solution of NaBr (0.61 mM, 10 mL) was rapidly added, the reaction was continued under vigorous magnetic stirring for about 10 h.The obtained product was rinsed with de-ionized water several times and dispersed in 10 mL of de-ionized water.Then the dispersion was irradiated under visible light for 30 min to convert some Ag ions on the surface region of AgBr/AgCl to Ag 0 species.The solution color changed gradually from light yellow to bluish violet, indicating the production and assembly of Ag nanoparticles on the surfaces of AgBr/AgCl.For comparison, polyhedral AgAgBr nanoparticles were also prepared by a similar process except without the anion-exchange reaction. The crystal structure of the samples was examined by X-ray powder diffraction (XRD) on a Philips X'Pert diffractometer with Cu Ka radiation (l 14 0.15418 nm).The morphology was observed with a Hitachi S-4800 field emission scanning electronic microscopy (FESEM) instrument.The absorbance spectra of the catalyst were measured by a UV-vis spectrometer (UV-2550, Shimadzu) in a range of 230 to 1000 nm.The content of Ag species in the AgAgBr/AgCl surface was confirmed by X-ray photoelectron spectra (XPS), recorded on a Perkin-Elmer PHI-5300 spectrometer, using non-monochromatized Mg Ka radiation as excitation source in a vacuum of 10 A7 Pa.The charge shift correction was made and the C 1s electron binding energy of 284.6 eV was used for calibration of the instrument.The XPS spectra were fitted using a combined polynomial and Shirley-type background function. The photocatalytic performance of AgAgBr/AgCl was evaluated through degradation of RhB dye and reduction of CO 2 using a 300 W Xe arc lamp (PLS-SXE300/300UV) equipped with a UV cut-off filter as the source of visible light. For degradation of RhB, 10 mL of a water dispersion of the asprepared AgAgBr/AgCl nanocashews was transferred to an aqueous solution of RhB (10 mL, 20 mg L A1 ).The dispersion was kept in the dark for 1 h under magnetic stirring to reach the adsorption-desorption equilibrium.The degradation of RhB was monitored by UV-vis spectra.After the reaction was completed, centrifuging the solution enabled the AgAgBr/ AgCl nanoparticles to be collected to catalyze subsequent reactions.For comparison, investigations without photocatalyst, and with polyhedral AgAgBr and commercial TiO 2 (P25) were also carried out. The reduction of CO 2 was performed in a self-made photocatalytic reactor as shown in the ESI (Fig. S1 ).Two portions of AgAgBr/AgCl nanoparticles were dispersed in 50 mL of sodium bicarbonate aqueous solution (0.1 M) with magnetic stirring in the vessel.Prior to irradiation, CO 2 with a purity of 99 was bubbled through the solution with a rate of 0.7 L min A1 for 10 min to remove air and saturate the solution.The reaction was then performed under visible light irradiation (l 400 nm), and the temperature was kept at 0 C by an ice-bath so as to increase the solubility of CO 2 .Centrifugation (10 000 rpm) of the reaction mixtures enabled the catalyst to be easily separated from the liquid solution of the samples.The catalyst was collected for use in triggering new reactions.The product in the solution was first qualitatively analyzed by an Agilent GC7890A (FID detector, CP-WAX58 FFAP columns) through observing the chromatographic peaks related to the elution of alcohol and then comparing them with those for an authentic ethanol standard.This identification was then confirmed by a GC/MS-5975C (Agilent, DB-1 capillary columns).The content of alcohol in the products was determined by an Agilent GC7890A.Blank tests under visible light irradiation without the photocatalyst and in the dark with the photocatalyst under the same experimental conditions were also conducted."}, {"llm generation": "Slurry", "source": "Of the many different methods developed so far, the reduction of CO 2 with H 2 O through irradiation of aqueous suspension systems is regarded as a potential avenue to facilitate CO 2 conversion into useful energy fuels, 31,32 involving a variety of catalytically active semiconductor powders to generate methanol or other organic compounds.", "context": "Crystalline phase and surface composition were investigated by X-ray powder diffraction (XRD) and X-ray photoelectronic spectra (XPS), respectively.Fig. 1(A) shows that the sample consists of face-centred cubic (fcc) AgBr (JCPDS card no.79-0149) and a small amount of AgCl (JCPDS card no.31-1238), which is caused by incomplete replacement of AgCl by Br A .Fig. 1(B) demonstrates that metallic Ag nanoparticles (JCPDS card no.87-0717) have been generated on the surfaces of AgBr/ AgCl after photoreduction.The elemental composition, chemical status, and silver content of AgAgBr/AgCl were further determined by means of XPS (Fig. 2).Before visible light irradiation, XPS analyses indicate that AgBr/AgCl contained the elements Ag, Cl, Br, and C. The carbon peak is due to adventitious hydrocarbon from the XPS instrument.The elements Ag, Cl, and Br come from the AgBr/AgCl sample.In Fig. 2(A), the two peaks at approximately 367 eV and 373 eV can be ascribed to the binding energies of Ag 3d 5/2 and Ag 3d 3/2 , respectively. 23,25,26he 3d 5/2 and Ag 3d 3/2 peaks can be further divided into two different bands, 367.1 eV, 368.2 eV, 373.1 eV, and 374.3 eV, respectively.The bands at 367.1 eV and 373.1 eV are attributed to Ag , and those at 368.2 eV and 374.3 eV are attributed to metallic Ag 0 .The calculated content of surface Ag 0 for the corresponding sample is 7.83 mol.The spectra of Cl 2p and Br 3d are shown in Fig. 2(B).The binding energies of Cl 2p 1/2 and Cl 2p 3/2 are about 199.0 eV and 197.3 eV, respectively.The spectrum of Br 3d shows that the binding energies of Br 3d 3/2 and Br 3d 5/2 are 68.7 and 67.7 eV, in agreement with previous reports. 25It is noted that the binding energies of both Cl 2p for Cl A and Ag 3d for Ag shift 0.6 eV to lower energy, which may be caused by strong interactions between AgCl and AgBr in the as-prepared heterostructures.The calculated surface atomic ratio for Cl, Br, and Ag is 1 : 5.35 : 7.52.Fig. 3(A) presents typical SEM images of the as-prepared AgCl and AgAgBr/AgCl nanoparticles.The AgCl nanoparticles (inset image) display a cubic shape with smooth surfaces.After the ion exchange, highly symmetrical cubic AgCl nanoparticles bound by 100 facets are destroyed.The novel shape of the obtained AgBr/AgCl nanocomposite is that of nanocashews with diameters of 150-300 nm (ESI, Fig. S2 ).SEM-EDAX mapping of the sample shown in Fig. 3(A Further photoreduction produces plasmonic AgAgBrAgCl nanophotocatalyst, which replicates the same shape as pristine nanoparticles, implying small size and even distribution of the Ag nanoparticles on the surfaces of AgBr/AgCl.Due to the surface plasmonic resonance (SPR) effect of the Ag nanograins, the AgAgBr/ AgCl nanocashews exhibit a stronger response in the visible region than pristine AgCl nanocubes (Fig. 3(B)). Based on the SEM investigation of the samples at different stages (Fig. 4), a possible growth mechanism for the conversion of AgCl nanocubes to AgBr/AgCl nanocashews is proposed.At the initial nucleating stage, the anion-exchange reaction was initiated at the corners of the host AgCl nanocubes (Fig. 4b, marked in red circle) due to their high reaction activity.After the AgBr nuclei were produced, they gradually grew up along the near edges of AgCl nanocubes.Then AgBr crystals were slowly wrapped around the host AgCl nanoparticles as the reaction proceeded (Fig. 4c), and the host AgCl nanocubes were transformed into ''nanocashews'' with the composition of AgBr/AgCl (Fig. 4d).The heterostructured AgBr/AgCl nanostructures with smooth surfaces finally formed through an Ostwald ripening process (Fig. 4e).It can be seen that every nanocashew has a quasi-cubic space surrounded by the backbone structure which should be the trace amount of the host AgCl cubes. As is known, appropriate adsorption capacity of pollutant molecules on photocatalysts is crucial for the enhancement of catalytic activity. 272882930 Compared to polyhedral AgAgBr and commercial TiO 2 (P25), the cashew-like AgAgBr/AgCl nanoparticles show a relatively strong adsorption capacity of RhB molecules (ESI, Fig. S4 ), which is beneficial for enhancing their photocatalytic activity.Spectral analyses (ESI, Fig. S5 ) indicate that 32.9 of RhB molecules are adsorbed on the photocatalyst.Fig. 5(A) shows the evolution of the absorption spectra of RhB with reaction time.The color of RhB solution gradually changes from initially pink to transparent as the reaction proceeds (ESI, Fig. S6 ).Therefore, RhB molecules can be decomposed steadily with the assistance of AgAgBr/AgCl nanoparticles.However, the degradation of RhB under the same conditions by commercial TiO 2 (P25) and without any photocatalyst was almost nonexistent, confirming the crucial role of AgAgBr/AgCl nanoparticles in the bleaching of organic pollutant molecules.Meanwhile, RhB can be completely decomposed within 2 min when catalyzed by AgAgBr/AgCl nanocashews, whereas only 94 is decomposed with AgAgBr polyhedrons.The relationship between ln(C 0 /C) and irradiation time (t) in Fig. 5(B) is linear, indicating that the reaction follows first-order kinetics with the rate constant determined to be 2.68 min A1 . For practical purposes, a photocatalyst should be also stable under repeated use.To evaluate the stability of the present photocatalyst, the AgAgBr/AgCl nanoparticles were collected by centrifuging the solution so as to catalyze a new reaction.Fig. 6 shows the degradation kinetics of RhB for 20 reaction runs using the same batch of nanophotocatalyst.The result verifies that the photocatalyst can keep a high efficiency under recycling reactions even though the activity slightly reduces.To a certain extent, the gradual decrease of activity can be attributed to the unavoidable loss of catalyst during the process of sampling and collecting of the photocatalyst.An SEM image of the used photocatalyst (ESI, Fig. S7 ) also demonstrates that the microstructure of the nanoparticles is retained well after circulation.Therefore, the as-prepared AgAgBr/AgCl nanocashews can be used as a class of highly efficient and stable photocatalyst under visible light irradiation. Since the amount of carbon dioxide (CO 2 ) in the global atmosphere has increased as the human race has advanced technologically, there has been growing interest in the development of novel artificial methods that capture and concentrate large quantities of atmospheric CO 2 for subsequent conversion into fuels.Of the many different methods developed so far, the reduction of CO 2 with H 2 O through irradiation of aqueous suspension systems is regarded as a potential avenue to facilitate CO 2 conversion into useful energy fuels, 31,32 involving a variety of catalytically active semiconductor powders to generate methanol or other organic compounds.However, the pioneering of visible-light-driven photocatalysts for highly efficient CO 2 reduction is still a challenging mission.Herein, we have also evaluated the ability of the present AgAgBr/AgCl nanostructure to reduce CO 2 in aqueous solution under visible light irradiation of our self-made system.After reacting for 5 h, GC-MS and GC analyses show that the major products for the reduction of CO 2 are methanol and ethanol.Fig. 7 gives the yield of the photocatalytic products in five reaction runs.The average yields of methanol and ethanol are 226.68 and 329.18 mmol g A1 , respectively, which are higher than reported values. 33,34For each run, the yields of the products do not reduce greatly.Thus the AgAgBr/AgCl nanocashews can be applied as a potential candidate for the visible-light reduction of CO 2 with improved efficiency.The high activity of the as-prepared AgAgBr/AgCl for CO 2 reduction is attributed to the strong response in the visible region due to the SPR contribution of metallic Ag 0 .In addition, the enhanced adsorption capacity may also strengthen the adsorption of CO 2 or CO 3 2A , which is helpful for the reduction reaction.Of course, the detailed mechanism is still unclear.A detailed study is needed to give further insight into the conversion pathway.On the basis of the aforementioned results and analyses, a possible mechanism is proposed to explain the high activity and stability of the as-prepared AgAgBr/AgCl nanophotocatalyst.The plasmonic absorption of the Ag nanograins (or nanoparticles) in the visible region makes the asprepared AgAgBr/AgCl present an enhanced visible-light response. 17Under visible light irradiation, the AgBr component with an absorption band at 400-750 nm can be excited by the visible light and produces photogenerated carriers. 35As a sink for these photoinduced charges, the Ag species on the surfaces of AgBr/AgCl prevents the recombination of photogenerated charges, and thus improves the efficiency of the charge transfer process.Additionally, the well-defined interfaces between Ag and AgBr/AgCl can also improve the rate of interfacial charge transfer.As a result, the photoexcited electrons can be accepted by O 2 adsorbed on the surface of AgAgBr/AgCl and formO 2 A , OH and other reactive oxygen species, which would then oxidize RhB molecules. 36,37The holes will transfer to the surface of AgBr/AgCl to decompose the RhB molecules directly, or oxidize Br A ions to Br 0 atoms which are also reactive radical species to decompose RhB molecules. 17,38n the process for the degradation of RhB,O 2 A ,OH and h are supposed to be the main active species.To further elucidate the photocatalytic mechanism and examine the roles of radicals, radical and hole scavengers, including HCO 3 A , t-butanol and pbenzoquinone, were introduced into the system.As shown in Fig. 8, the degradation of RhB is significantly depressed by the O 2 A scavenger p-benzoquinone, leading to only 80.7 removal of RhB.However, HCO 3 A , a scavenger of h and the adsorbed OH, has no obvious influence.Similarly, no significant changes in the degradation are observed with the addition of 0.1 M t-butanol Fig. 6 The degradation curves of RhB solution for 20 successive reactions catalyzed with the same batch of AgAgBr/AgCl nanoparticles (as shown in Fig. 1) under visible light irradiation.which predominantly scavenges OH in the solution.Hence the O 2 A radical is the main reactive species in the reaction.The possible process of the degradation of RhB can be proposed as follows.Under visible light irradiation, both the plasmoninduced Ag nanograins and the excited AgBr/AgCl can generate e A -h pairs.The photoexcited electrons will transfer to the Ag nanograins rather than to the Ag ions of the AgCl lattice, and then the photogenerated electrons will be trapped by O 2 in the solution to form O 2 A and other oxygen species for the degradation of RhB.Meanwhile, the fast migration of electrons to the surface protects AgBr/AgCl from reduction to Ag, ensuring the high stability of AgAgBr/AgCl."}, {"llm generation": "Slurry", "source": "Fig. 8 Photodegradation kinetics of RhB in AgAgBr/AgCl water dispersion under visible light irradiation with different scavengers (10 mM NaHCO 3 , 5 mM p-benzoquinone, 0.1 M t-butanol).", "context": "In summary, we have demonstrated a facile anion-exchange process for the synthesis of a cashew-like plasmonic AgAgBr/ AgCl nanophotocatalyst.The as-prepared photocatalyst exhibits a relatively strong adsorption for dye molecules, which is beneficial for enhancing its photocatalytic activity.RhB molecules can be decomposed completely within 2 min under visible light irradiation.The photocatalyst can be reused 20 times without much decrease of its activity.Furthermore, radical trapping tests confirm that O 2 A is the main active species in the reaction.In addition, this shaped photocatalyst also displays high activity towards visible-light conversion of CO 2 into fuels, i.e. methanol/ ethanol.Therefore, the novel cashew-like shape, intrinsic high adsorption, and excellent photocatalytic performance of the heterostructured AgAgBr/AgCl photocatalyst make it a promising material in environmental remediation, water disinfection, and resourceful utilization of CO 2 . ) (ESI, Fig. S3 ) confirms the presence of Ag, Br and Cl elements and their distributions in the sample, showing the sample consists of heterostructured nanocashews. Fig.1XRD patterns of (A) AgBr/AgCl and (B) AgAgBr/AgCl. Fig. 2 XPS spectra of the obtained AgAgBr/AgCl: (A) Ag 3d; (B) Br 3d and Cl 2p. Fig.3(A) SEM images of the as-prepared AgAgBr/AgCl and (inset) AgCl.(B) UV-vis absorption spectra of AgCl and AgAgBr/AgCl. Fig. 4 SEM images for the shape evolution of the samples at different reaction stages: (a) 0 min, (b) 20 min, (c) 60 min, (d) 180 min, and (e) 600 min. Fig. 5 (A) The change of UV-visible spectra for RhB with the reaction time.(B) The normalized concentration of RhB as a function of reaction time with both linear and logarithmic scales.C 0 is the concentration of RhB before irradiation; C is the concentration of RhB at the reaction time t. Fig. 7 Yields of photocatalytic products with the number of reaction runs under 5 h visible light irradiation with the same batch of AgAgBr/ AgCl nanocashews. Fig. 8 Photodegradation kinetics of RhB in AgAgBr/AgCl water dispersion under visible light irradiation with different scavengers (10 mM NaHCO 3 , 5 mM p-benzoquinone, 0.1 M t-butanol). This journal is a The Royal Society of Chemistry 2012 Downloaded by Stanford University on 16 June 2012 Published on 27 April 2012 on http://pubs.rsc.org doi:10.1039/C2JM31736BView Online J. Mater.Chem., 2012, 22, 13153-13158 13155 Downloaded by Stanford University on 16 June 2012 Published on 27 April 2012 on http://pubs.rsc.org doi:10.1039/C2JM31736BView Online Downloaded by Stanford University on 16 June 2012 Published on 27 April 2012 on http://pubs.rsc.org doi:10.1039/C2JM31736BView Online J. Mater.Chem., 2012, 22, 13153-13158 13157 Downloaded by Stanford University on 16 June 2012 Published on 27 April 2012 on http://pubs.rsc.org doi:10.1039/C2JM31736BView Online This work is financially supported by the National Natural Science Foundation of China (grant no.21001116) and the Fundamental Research Funds for the Central Universities (10CX04025A)."}], "operation mode": [{"llm generation": "Batch", "source": "Furthermore, the as-synthesized nanocatalyst can be reused 20 times without losing activity, showing its high stability.", "context": "Heterostructured AgAgBr/AgCl nanocashews have been synthesized by an anion-exchange reaction between AgCl nanocubes and Br A ions followed by photoreduction.Compared to polyhedral AgAgBr nanoparticles, the obtained nanostructures exhibit enhanced photocatalytic activity towards decomposition of organic pollutants, i.e., rhodamine-B (RhB).For example, only 2 min is taken to completely decompose RhB molecules with the assistance of these novel heterostructured nanoparticles under visible light irradiation.Furthermore, the as-synthesized nanocatalyst can be reused 20 times without losing activity, showing its high stability.Interestingly, the novel heterostructured AgAgBr/AgCl nanophotocatalyst also shows efficient visible light conversion of CO 2 to energetic fuels, e.g.methanol/ethanol.Therefore, the present route opens an avenue to achieve highly efficient visible-light-driven nanophotocatalysts for applications in environmental remediation and resourceful use of CO 2 ."}, {"llm generation": "Batch", "source": "Fig. 6 shows the degradation kinetics of RhB for 20 reaction runs using the same batch of nanophotocatalyst.", "context": "Crystalline phase and surface composition were investigated by X-ray powder diffraction (XRD) and X-ray photoelectronic spectra (XPS), respectively.Fig. 1(A) shows that the sample consists of face-centred cubic (fcc) AgBr (JCPDS card no.79-0149) and a small amount of AgCl (JCPDS card no.31-1238), which is caused by incomplete replacement of AgCl by Br A .Fig. 1(B) demonstrates that metallic Ag nanoparticles (JCPDS card no.87-0717) have been generated on the surfaces of AgBr/ AgCl after photoreduction.The elemental composition, chemical status, and silver content of AgAgBr/AgCl were further determined by means of XPS (Fig. 2).Before visible light irradiation, XPS analyses indicate that AgBr/AgCl contained the elements Ag, Cl, Br, and C. The carbon peak is due to adventitious hydrocarbon from the XPS instrument.The elements Ag, Cl, and Br come from the AgBr/AgCl sample.In Fig. 2(A), the two peaks at approximately 367 eV and 373 eV can be ascribed to the binding energies of Ag 3d 5/2 and Ag 3d 3/2 , respectively. 23,25,26he 3d 5/2 and Ag 3d 3/2 peaks can be further divided into two different bands, 367.1 eV, 368.2 eV, 373.1 eV, and 374.3 eV, respectively.The bands at 367.1 eV and 373.1 eV are attributed to Ag , and those at 368.2 eV and 374.3 eV are attributed to metallic Ag 0 .The calculated content of surface Ag 0 for the corresponding sample is 7.83 mol.The spectra of Cl 2p and Br 3d are shown in Fig. 2(B).The binding energies of Cl 2p 1/2 and Cl 2p 3/2 are about 199.0 eV and 197.3 eV, respectively.The spectrum of Br 3d shows that the binding energies of Br 3d 3/2 and Br 3d 5/2 are 68.7 and 67.7 eV, in agreement with previous reports. 25It is noted that the binding energies of both Cl 2p for Cl A and Ag 3d for Ag shift 0.6 eV to lower energy, which may be caused by strong interactions between AgCl and AgBr in the as-prepared heterostructures.The calculated surface atomic ratio for Cl, Br, and Ag is 1 : 5.35 : 7.52.Fig. 3(A) presents typical SEM images of the as-prepared AgCl and AgAgBr/AgCl nanoparticles.The AgCl nanoparticles (inset image) display a cubic shape with smooth surfaces.After the ion exchange, highly symmetrical cubic AgCl nanoparticles bound by 100 facets are destroyed.The novel shape of the obtained AgBr/AgCl nanocomposite is that of nanocashews with diameters of 150-300 nm (ESI, Fig. S2 ).SEM-EDAX mapping of the sample shown in Fig. 3(A Further photoreduction produces plasmonic AgAgBrAgCl nanophotocatalyst, which replicates the same shape as pristine nanoparticles, implying small size and even distribution of the Ag nanoparticles on the surfaces of AgBr/AgCl.Due to the surface plasmonic resonance (SPR) effect of the Ag nanograins, the AgAgBr/ AgCl nanocashews exhibit a stronger response in the visible region than pristine AgCl nanocubes (Fig. 3(B)). Based on the SEM investigation of the samples at different stages (Fig. 4), a possible growth mechanism for the conversion of AgCl nanocubes to AgBr/AgCl nanocashews is proposed.At the initial nucleating stage, the anion-exchange reaction was initiated at the corners of the host AgCl nanocubes (Fig. 4b, marked in red circle) due to their high reaction activity.After the AgBr nuclei were produced, they gradually grew up along the near edges of AgCl nanocubes.Then AgBr crystals were slowly wrapped around the host AgCl nanoparticles as the reaction proceeded (Fig. 4c), and the host AgCl nanocubes were transformed into ''nanocashews'' with the composition of AgBr/AgCl (Fig. 4d).The heterostructured AgBr/AgCl nanostructures with smooth surfaces finally formed through an Ostwald ripening process (Fig. 4e).It can be seen that every nanocashew has a quasi-cubic space surrounded by the backbone structure which should be the trace amount of the host AgCl cubes. As is known, appropriate adsorption capacity of pollutant molecules on photocatalysts is crucial for the enhancement of catalytic activity. 272882930 Compared to polyhedral AgAgBr and commercial TiO 2 (P25), the cashew-like AgAgBr/AgCl nanoparticles show a relatively strong adsorption capacity of RhB molecules (ESI, Fig. S4 ), which is beneficial for enhancing their photocatalytic activity.Spectral analyses (ESI, Fig. S5 ) indicate that 32.9 of RhB molecules are adsorbed on the photocatalyst.Fig. 5(A) shows the evolution of the absorption spectra of RhB with reaction time.The color of RhB solution gradually changes from initially pink to transparent as the reaction proceeds (ESI, Fig. S6 ).Therefore, RhB molecules can be decomposed steadily with the assistance of AgAgBr/AgCl nanoparticles.However, the degradation of RhB under the same conditions by commercial TiO 2 (P25) and without any photocatalyst was almost nonexistent, confirming the crucial role of AgAgBr/AgCl nanoparticles in the bleaching of organic pollutant molecules.Meanwhile, RhB can be completely decomposed within 2 min when catalyzed by AgAgBr/AgCl nanocashews, whereas only 94 is decomposed with AgAgBr polyhedrons.The relationship between ln(C 0 /C) and irradiation time (t) in Fig. 5(B) is linear, indicating that the reaction follows first-order kinetics with the rate constant determined to be 2.68 min A1 . For practical purposes, a photocatalyst should be also stable under repeated use.To evaluate the stability of the present photocatalyst, the AgAgBr/AgCl nanoparticles were collected by centrifuging the solution so as to catalyze a new reaction.Fig. 6 shows the degradation kinetics of RhB for 20 reaction runs using the same batch of nanophotocatalyst.The result verifies that the photocatalyst can keep a high efficiency under recycling reactions even though the activity slightly reduces.To a certain extent, the gradual decrease of activity can be attributed to the unavoidable loss of catalyst during the process of sampling and collecting of the photocatalyst.An SEM image of the used photocatalyst (ESI, Fig. S7 ) also demonstrates that the microstructure of the nanoparticles is retained well after circulation.Therefore, the as-prepared AgAgBr/AgCl nanocashews can be used as a class of highly efficient and stable photocatalyst under visible light irradiation. Since the amount of carbon dioxide (CO 2 ) in the global atmosphere has increased as the human race has advanced technologically, there has been growing interest in the development of novel artificial methods that capture and concentrate large quantities of atmospheric CO 2 for subsequent conversion into fuels.Of the many different methods developed so far, the reduction of CO 2 with H 2 O through irradiation of aqueous suspension systems is regarded as a potential avenue to facilitate CO 2 conversion into useful energy fuels, 31,32 involving a variety of catalytically active semiconductor powders to generate methanol or other organic compounds.However, the pioneering of visible-light-driven photocatalysts for highly efficient CO 2 reduction is still a challenging mission.Herein, we have also evaluated the ability of the present AgAgBr/AgCl nanostructure to reduce CO 2 in aqueous solution under visible light irradiation of our self-made system.After reacting for 5 h, GC-MS and GC analyses show that the major products for the reduction of CO 2 are methanol and ethanol.Fig. 7 gives the yield of the photocatalytic products in five reaction runs.The average yields of methanol and ethanol are 226.68 and 329.18 mmol g A1 , respectively, which are higher than reported values. 33,34For each run, the yields of the products do not reduce greatly.Thus the AgAgBr/AgCl nanocashews can be applied as a potential candidate for the visible-light reduction of CO 2 with improved efficiency.The high activity of the as-prepared AgAgBr/AgCl for CO 2 reduction is attributed to the strong response in the visible region due to the SPR contribution of metallic Ag 0 .In addition, the enhanced adsorption capacity may also strengthen the adsorption of CO 2 or CO 3 2A , which is helpful for the reduction reaction.Of course, the detailed mechanism is still unclear.A detailed study is needed to give further insight into the conversion pathway.On the basis of the aforementioned results and analyses, a possible mechanism is proposed to explain the high activity and stability of the as-prepared AgAgBr/AgCl nanophotocatalyst.The plasmonic absorption of the Ag nanograins (or nanoparticles) in the visible region makes the asprepared AgAgBr/AgCl present an enhanced visible-light response. 17Under visible light irradiation, the AgBr component with an absorption band at 400-750 nm can be excited by the visible light and produces photogenerated carriers. 35As a sink for these photoinduced charges, the Ag species on the surfaces of AgBr/AgCl prevents the recombination of photogenerated charges, and thus improves the efficiency of the charge transfer process.Additionally, the well-defined interfaces between Ag and AgBr/AgCl can also improve the rate of interfacial charge transfer.As a result, the photoexcited electrons can be accepted by O 2 adsorbed on the surface of AgAgBr/AgCl and formO 2 A , OH and other reactive oxygen species, which would then oxidize RhB molecules. 36,37The holes will transfer to the surface of AgBr/AgCl to decompose the RhB molecules directly, or oxidize Br A ions to Br 0 atoms which are also reactive radical species to decompose RhB molecules. 17,38n the process for the degradation of RhB,O 2 A ,OH and h are supposed to be the main active species.To further elucidate the photocatalytic mechanism and examine the roles of radicals, radical and hole scavengers, including HCO 3 A , t-butanol and pbenzoquinone, were introduced into the system.As shown in Fig. 8, the degradation of RhB is significantly depressed by the O 2 A scavenger p-benzoquinone, leading to only 80.7 removal of RhB.However, HCO 3 A , a scavenger of h and the adsorbed OH, has no obvious influence.Similarly, no significant changes in the degradation are observed with the addition of 0.1 M t-butanol Fig. 6 The degradation curves of RhB solution for 20 successive reactions catalyzed with the same batch of AgAgBr/AgCl nanoparticles (as shown in Fig. 1) under visible light irradiation.which predominantly scavenges OH in the solution.Hence the O 2 A radical is the main reactive species in the reaction.The possible process of the degradation of RhB can be proposed as follows.Under visible light irradiation, both the plasmoninduced Ag nanograins and the excited AgBr/AgCl can generate e A -h pairs.The photoexcited electrons will transfer to the Ag nanograins rather than to the Ag ions of the AgCl lattice, and then the photogenerated electrons will be trapped by O 2 in the solution to form O 2 A and other oxygen species for the degradation of RhB.Meanwhile, the fast migration of electrons to the surface protects AgBr/AgCl from reduction to Ag, ensuring the high stability of AgAgBr/AgCl."}, {"llm generation": "Batch", "source": "Fig. 7 Yields of photocatalytic products with the number of reaction runs under 5 h visible light irradiation with the same batch of AgAgBr/ AgCl nanocashews.", "context": "In summary, we have demonstrated a facile anion-exchange process for the synthesis of a cashew-like plasmonic AgAgBr/ AgCl nanophotocatalyst.The as-prepared photocatalyst exhibits a relatively strong adsorption for dye molecules, which is beneficial for enhancing its photocatalytic activity.RhB molecules can be decomposed completely within 2 min under visible light irradiation.The photocatalyst can be reused 20 times without much decrease of its activity.Furthermore, radical trapping tests confirm that O 2 A is the main active species in the reaction.In addition, this shaped photocatalyst also displays high activity towards visible-light conversion of CO 2 into fuels, i.e. methanol/ ethanol.Therefore, the novel cashew-like shape, intrinsic high adsorption, and excellent photocatalytic performance of the heterostructured AgAgBr/AgCl photocatalyst make it a promising material in environmental remediation, water disinfection, and resourceful utilization of CO 2 . ) (ESI, Fig. S3 ) confirms the presence of Ag, Br and Cl elements and their distributions in the sample, showing the sample consists of heterostructured nanocashews. Fig.1XRD patterns of (A) AgBr/AgCl and (B) AgAgBr/AgCl. Fig. 2 XPS spectra of the obtained AgAgBr/AgCl: (A) Ag 3d; (B) Br 3d and Cl 2p. Fig.3(A) SEM images of the as-prepared AgAgBr/AgCl and (inset) AgCl.(B) UV-vis absorption spectra of AgCl and AgAgBr/AgCl. Fig. 4 SEM images for the shape evolution of the samples at different reaction stages: (a) 0 min, (b) 20 min, (c) 60 min, (d) 180 min, and (e) 600 min. Fig. 5 (A) The change of UV-visible spectra for RhB with the reaction time.(B) The normalized concentration of RhB as a function of reaction time with both linear and logarithmic scales.C 0 is the concentration of RhB before irradiation; C is the concentration of RhB at the reaction time t. Fig. 7 Yields of photocatalytic products with the number of reaction runs under 5 h visible light irradiation with the same batch of AgAgBr/ AgCl nanocashews. Fig. 8 Photodegradation kinetics of RhB in AgAgBr/AgCl water dispersion under visible light irradiation with different scavengers (10 mM NaHCO 3 , 5 mM p-benzoquinone, 0.1 M t-butanol). This journal is a The Royal Society of Chemistry 2012 Downloaded by Stanford University on 16 June 2012 Published on 27 April 2012 on http://pubs.rsc.org doi:10.1039/C2JM31736BView Online J. Mater.Chem., 2012, 22, 13153-13158 13155 Downloaded by Stanford University on 16 June 2012 Published on 27 April 2012 on http://pubs.rsc.org doi:10.1039/C2JM31736BView Online Downloaded by Stanford University on 16 June 2012 Published on 27 April 2012 on http://pubs.rsc.org doi:10.1039/C2JM31736BView Online J. Mater.Chem., 2012, 22, 13153-13158 13157 Downloaded by Stanford University on 16 June 2012 Published on 27 April 2012 on http://pubs.rsc.org doi:10.1039/C2JM31736BView Online This work is financially supported by the National Natural Science Foundation of China (grant no.21001116) and the Fundamental Research Funds for the Central Universities (10CX04025A)."}]}}