{"DOI": "10.1021/acs.jpca.6b07236", "paper_title": "Novel TiO<sub>2</sub>/C<sub>3</sub>N<sub>4</sub> Photocatalysts for Photocatalytic Reduction of CO<sub>2</sub> and for Photocatalytic Decomposition of N<sub>2</sub>O", "human validator": "hybrid annotator", "annotation": {"catalyst": [{"llm generation": "TiO2/C3N4", "source": "Novel TiO<sub>2</sub>/C<sub>3</sub>N<sub>4</sub> Photocatalysts for Photocatalytic Reduction of CO<sub>2</sub> and for Photocatalytic Decomposition of N<sub>2</sub>O", "context": "Novel TiO<sub>2</sub>/C<sub>3</sub>N<sub>4</sub> Photocatalysts for Photocatalytic Reduction of CO<sub>2</sub> and for Photocatalytic Decomposition of N<sub>2</sub>O"}, {"llm generation": "TiO 2 /g-C 3 N 4", "source": "The samples were labelled according to weight ratio of TiO 2 /g-C 3 N 4 as follows: (0.3/1), (0.5/1), (1/1) and (2/1) TiO 2 /g-C 3 N 4 .", "context": "The g-C 3 N 4 was synthesized by simple heating of melamine in the muffle furnace.10 g of melamine powder as precursor were heated to 550 C at a heating rate of 10 C/min in a covered crucible.The temperature was kept at 550 C for 2 h and then cooled down to room temperature. A yellow product of g-C 3 N 4 was obtained and was ground to a fine powder. As a precursor of TiO 2 commercial P25 (Evonik) was used.The TiO 2 /g-C 3 N 4 composites were prepared by mechanical mixture and calcined in a muffle furnace at 450 C for 2 h with temperature increasing at the rate of 10 C/min.The samples were labelled according to weight ratio of TiO 2 /g-C 3 N 4 as follows: (0.3/1), (0.5/1), (1/1) and (2/1) TiO 2 /g-C 3 N 4 . X-ray powder diffraction patterns (XRD) were measured using a Bruker D8 (Bruker AXS) diffractometer equipped by a detector sensitive for the placement (VANTEC 1).The CoK lamp was used as a source of irradiation of wavelength 0.178897 nm.Measurements were done in the conventional Bragg-Brentano setup. Nitrogen physisorption at 77 K was performed on a 3Flex automated volumetric apparatus (Micromeritics Instruments, USA) after degassing of materials at 150 C for more than 24 h under vacuum below 1 Torr.Degassing at low temperature was applied to remove physisorbed water, but having no influence on the porous morphology of the developed materials.The specific surface area was calculated according to the classical Brunauer-Emmett-Teller (BET) theory for the p/p0 range of 0.05-0.30 34.As the specific surface area, S BET , is not a proper parameter in the case of mesoporous solids containing micropores 35 , the mesopore surface area, S meso , and the micropore volume, V micro , were also evaluated based on the t-plot method 36 with the C modif constant 35,37 .The net pore volume, V net , was determined from the nitrogen adsorption isotherm at maximum p/p0 (0.99).The pore-size distribution was evaluated from the adsorption branch of the nitrogen adsorption desorption isotherm by the Barrett-Joyner-Halenda (BJH) method 38 using the de Boer standard isotherm and assuming cylindrical pore geometry. IR spectra of samples were measured by potassium bromide pellets technique.Exactly 1.0 mg of sample was ground with 200 mg dried potassium bromide.This mixture was used to prepare the potassium bromide pellets.The pellets were pressed by 8 tons for 30 seconds under vacuum. The IR spectra were collected using FT-IR spectrometer Nexus 470 (ThermoScientific, USA) with DTGS detector.The measurement parameters were the following: the spectral region of 4000-400 cm -1 , spectral resolution 4 cm -1 ; 64 scans; the Happ-Genzel apodization.Treatment of spectra: polynomial (second order) baseline, subtraction spectrum of pure potassium bromide. A 180 sampling was used as measurement technique of Raman spectroscopy.The Raman spectra were measured at dispersive Raman spectrometer DXR SmartRaman (ThermoScientific, USA) with CCD detector.The measurement parameters were as follows: excitation laser 780 nm, grating 400 lines/mm, aperture 50 m, exposure time 1 second, number of exposures 1000, the spectral region of 1800-50 cm -1 .An empty sample compartment was used for background measurement.Treatment of spectra: fluorescence correction (6 th order). The UV-visible spectra of prepared nanocomposites were recorded using a UV-2600 spectrophotometer with an ISR-2600 integrating sphere attachment (Shimadzu Scientific Co., Japan) from 220 to 1400 nm.Sampling interval was 1 nm and width of slit was 2 nm.Barium sulphate (BaSO 4 ) was used as reference material. Photoluminescence (PL) spectra were measured by a spectrometer FLS920 (Edinburgh Instrument Ltd, UK).The spectrometer was equipped with a 450 W Xenon lamp (Xe900).The excitation wavelength was 325 nm.The width of excitation and emission slits was 0.5 nm. Gas chromatography with isotope ratio mass spectrometry (GC/IRMS) DELTA Advantage (Thermo Scientific, USA) was used for the detection of 13 C in gas samples before and after photocatalytic reaction. X-ray photoelectron spectra (XPS) were recorded using a hemispherical VG SCIENTA R3000 analyzer with constant pass energy of 100 eV, a monochromatized aluminum source Al K (E 1486.6eV) and a low energy electron flood gun (FS40A-PS) to compensate the charge on the surface of nonconductive samples.The base pressure in the analytical chamber was 510 -9 mbar. The binding energies were referenced to C 1s core level (E b 284.6 eV).The composition and chemical surrounding of the sample surface were investigated on the basis of the areas and binding energies of Ti 2p, O 1s, N 1s and C 1s photoelectron peaks.The fitting of high resolution spectra was provided through the Casa XPS software. The morphology of particles was observed on a transmission electron microscope (TEM) JEOL 2010 HC (JEOL Ltd., Japan).The particles were dispersed in ethanol and using an ultrasonic sprayer deposited on a TEM grid with carbon holey support film. Photoelectrochemical measurements were performed using a photoelectric spectrometer equipped with the 150 W Xe lamp and coupled with the P-IF 1.6 potentiostat (Instytut Fotonowy, Poland).The photocurrent responses were recorded using a classical three electrode setup.The platinum wire and Ag/AgCl were used as the auxiliary and reference electrodes, respectively.The working electrode consisted of photocatalyst powder deposited onto indium-tin oxide (ITO) foil coated by polyethylene terephthalate.The 0.1 M KNO 3 was used as an electrolyte solution.The photocurrent spectra were recorded within the range of 240 -500 nm with the step of 10 nm in the potential range of -0.2 to 0.8 V, step 0.1 V. Before the measurement itself the electrolyte was purged by argon to ensure oxygen free environment.The argon purge was also kept constant during the measurement. The photocatalytic reduction of carbon dioxide was carried out in a homemade apparatus ( Figure 1).A cylindrical stirred batch reactor with a photocatalyst spread on the bottom of the reactor was illuminated by an 8 W Hg lamp ( 254 nm; intensity 0.5 mW/cm 2 ) placed in horizontal position on top of the quartz glass visor.The reactor shell was made from stainless steel.The internal volume was 355 cm 3 .The photocatalyst powder loading was 0.1 g.Before the irradiation was turned ON, a supercritical fluid-grade CO 2 with a certified maximum of hydrocarbons less than 1 ppm (SIAD Technical Gases, CZ) to avoid any hydrocarbon contamination was purged through distilled water reservoir to saturate it by humidity (50 rel.). Afterwards the water saturated CO 2 was purged through the reactor in order to displace the air from the reactor.The CO 2 pressure was maintained at 120 kPa through the purging for 20 minutes.The pressure inside the reactor was continuously monitored.The reactor was pressurized to 140 kPa and sealed.The sample at 0 hour was taken and immediately analyzed on barrier discharge ionization detector (GC/BID).The photocatalytic reaction was started by switching on the Hg lamp.Gas samples were discontinuously taken at various times during the irradiation (8 hours).Gas sampling was performed using a gas-tight syringe (10 ml) through a septum.GC/BID equipped by ShinCarbon ST micropacked column was used for the analysis of reaction products in the gas phase.The accuracy of the experiment was verified by a series of repeated measurements, and the relative error of product yields (mol/g cat ) was determined to be less than 10 .Blank tests were carried out to guarantee that the methane production was due to the photocatalytic reduction of CO 2 and to eliminate the surrounding interference.During the first test, the reactor was UV-illuminated without the photocatalyst, the second blank test was conducted in the dark with the photocatalyst under the same experimental conditions, and the third test consisted of irradiating the photocatalyst in the absence of CO 2 .No hydrocarbons were detected in the above blank tests. To double check the products are really coming from the photocatalytic reduction of CO 2 the measurement with CO 2 containing 13 C isotope was conducted.Samples were taken at various times and the increase of 13 C amount in methane was observed with increasing irradiation time. These measurements confirmed that the methane is a product of the CO 2 photocatalytic reduction. The photocatalytic reduction of N 2 O was carried out in a homemade apparatus at ambient temperature with and without the photocatalyst (photocatalysis and photolysis, respectively) 12 . The 0.1 g of photocatalyst was placed on an adhesive tape inserted on the bottom of the batch reactor (635 ml volume).In both photochemical and photocatalytic experiments, the reactor was and the relative error of the N 2 O concentration was determined to be less than 5 ."}, {"llm generation": "g-C3N4", "source": "The specific surface area of mixed photocatalysts increased significantly compared to pure g-C 3 N 4 .", "context": "Results from nitrogen physisorption, UV-Vis DRS and XRD are summarized in Tab. 1.The specific surface area of mixed photocatalysts increased significantly compared to pure g-C 3 N 4 . Due to very organized arrangement of g-C 3 N 4 crystal lattice its specific surface area is very low. Usually the value is somewhere around 10 m 2 /g 21,39 .Excluding pure g-C 3 N 4 all the prepared photocatalysts and TiO 2 Evonik P25 had very similar specific surface area with a value close to 50 m 2 /g. Absorption edge energy is one of the key aspects of the photocatalysis (Tab.1).Graphitic C 3 N 4 has relatively low band gap energy which is one of the reasons why this material attracted great attention of the photocatalytic society.The band gap energy of commercial TiO 2 Evonik P25 is quite high, 3.26 eV in our case and the addition of g-C 3 N 4 decreased the absorption edge energy only slightly (Table 1).The absorption edge energies of photocatalysts were determined from UV-Vis DRS spectra (Figure 2b).Based on the UV-vis DRS spectra the blue shift can be observed after addition of TiO 2 to pure g-C 3 N 4 (Figure 2a).The absorption edges of all TiO 2 /g- The commercial TiO 2 is composed from anatase and rutile phase which was confirmed by Raman spectroscopy (Figure 3a).The Ti-O vibrational modes of anatase are located around 395, 515 and 640 cm -1 .The Ti-Ti vibrational modes of anatase are located at 140 and 195 cm -1 40, 41 . Rutile's Ti-O vibrational modes are located around 445, 610, 825 cm -1 and Ti-Ti vibrational mode of rutile is located around 140 cm -1 41 .Since the rutile phase is representing the minority, the only recognizable peaks were at 445 and 791 cm -1 .The other ones are being overlapped by the anatase vibrational modes.The interpretation of pure g-C 3 N 4 Raman spectra is a little bit more complicated (Figure 3b). Figure 4a shows the Raman spectra of all investigated photocatalysts.The decrease of TiO 2 characteristic peaks intensity and increase of g-C 3 N 4 peaks intensity can be observed with decreasing ratio of TiO 2 /g-C 3 N 4 .Also no peak shifts were observed which means no structural changes occurred during preparation of mixed photocatalysts regarding to pure TiO 2 and g-C 3 N 4 . For better resolution the most intense anatase peak part is shown in Figure 4b. The FT-IR spectra of prepared g-C 3 N 4 , TiO 2 Evonik P25 and TiO 2 /g-C 3 N 4 photocatalysts are shown in Figure 5.In the FT-IR spectra of g-C 3 N 4 the strong band region from 1200 to 1650 cm - 1 can be found.The peak at 1640 cm -1 is attributed to C-N stretching, while three bands at 1555, 1461 and 1405 cm -1 are the result of the typical stretching vibrations of C-N heterocycles 44,45 . The last two bands at 1319 and 1243 cm -1 of the region belong to stretching vibration of connected units of C-NH-C, which is also supported by the broad band at 2900 -3500 cm -1 .This broad band is attributed to N-H and O-H stretches due to the free amino groups and adsorbed hydroxyl species, respectively 45 .The peak at 806 cm -1 is attributed to the characteristic breathing mode of s-triazine 44,45 , which increases with the increase of the g-C 3 N 4 content.All materials.The broad band in the region of 3200 -3600 cm -1 can be assigned to OH stretching modes.The two very small hard recognizable bands at 1600 and 1400 cm -1 are attributed to bending OH modes of hydroxyl groups.The broad band below at 900 cm -1 belongs to Ti-O vibrations 46 .Wavelength (nm) g-C3N4 (0.3/1)TiO2/g-C3N4 (0.5/1)TiO2/g-C3N4 (1/1)TiO2/g-C3N4 (2/1)TiO2/g-C3N4 TiO2 Two main diffraction peaks for g-C 3 N 4 located at around 14.89 and 31.95,were observed and indexed as (100) and (002) planes, respectively (Figure 7).These two diffraction peaks are in good agreement with the g-C 3 N 4 (JCPDS no.87-1526) 50 .Titanium dioxide was identified in composite samples in anatase (JCPDS no.084-1285) and rutile (JCPDS no.079-6029) forms. The crystallite size of the TiO 2 was determined from the half-width of peaks using Scherrer's formula (where K0.89) on the anatase (101) and rutile (110) peaks.The intensity of g-C 3 N 4 peaks in TiO 2 composites was attenuated in a simile way as reported 52 .The presence of g-C 3 N 4 did not have a significant influence on the phase structure of TiO 2 . In Figure 8 which correspond to Ti 4 2 p3/2 and Ti 4 2 p1/2 , respectively 55 .The detectable changes in the peak positions are observed in the high-resolution XPS O 1s spectra for pure TiO 2 and TiO 2 mixed with g-C 3 N 4 .Among two main O 1s components found in pure TiO 2 , attributed to lattice O 2- (529.5 eV) and the O 2-ions/hydroxyl groups (530.6 eV) 56 , the latter one is shifted to 530.9 eV in the case of (0.3/1)TiO 2 /g-C 3 N 4 , confirming the occurrence of interactions between TiO 2 and g-C 3 N 4 in the formed composites.The morphology of the photocatalysts was examined by TEM. Figure 9 shows the TEM images of g-C 3 N 4 , TiO 2 , and (0.3/1)TiO 2 /g-C 3 N 4 .It can be seen that pure g-C 3 N 4 (Figure 9a) indicates a 2D lamellar structure while pure TiO 2 (Figure 9b) shows spherical particles.For The photocurrent measurements were conducted to predict the photocatalytic activity of the prepared photocatalysts (Figure 10).It is evident all the prepared photocatalysts except pure g- The effect of irradiation time on the formation of gaseous products in the photocatalytic reduction of carbon dioxide was studied in the presence of all prepared TiO 2 /g-C 3 N 4 photocatalysts including pure TiO 2 Evonik P25 and g-C 3 N 4 .Figure 11 other hand, rapidly increase in first 2 hours and then are almost constant (Figure 11b).The last detected product was hydrogen which is coming from the photocatalytic water (vapor) splitting (Figure 11c).The highest yields of the three products were reached in the presence of (0.3/1)TiO 2 /g-C 3 N 4 .On the other hand, the lowest products production was achieved over pure g-C 3 N 4 .Time (h) (0.3/1)TiO2/g-C3N4 TiO2 (1/1)TiO2/g-C3N4 (0.5/1)TiO2/g-C3N4 (2/1)TiO2/g-C3N4 g-C3N4 Conditions: 8 W Hg lamp, CO 2 pressure at carbonation of 120 kPa, humidity 50, photocatalyst loading of 0.1 g. The effect of irradiation time on the photochemical and photocatalytic decomposition of The most active photocatalyst in both cases, the photocatalytic reduction of CO 2 and N 2 O, respectively, was the one composed of 0.3/1 ratio of TiO 2 /g-C 3 N 4 .The photocatalytic experiments showed the ratio of TiO 2 and g-C 3 N 4 plays significant role in photocatalysis.It also confirmed pure g-C 3 N 4 is not very active photocatalyst due to its high recombination rate of charge carriers and very low specific surface area 15 .The very high recombination of g-C 3 N 4 also confirms photoluminescence spectra where the g-C 3 N 4 band has the intensity several times higher than the rest of the photocatalysts (Figure 6). Even though both studied reactions are reductions the reaction mechanism is different for each of them.Photocatalytic reduction of carbon dioxide heavily depends on sufficient potentials of photocatalyst's conduction and valence bands.CO 2 molecule is very stable and direct reduction by electron (CO 2 /CO 2 ) is limited by very negative potential (-1.9 V vs. NHE) 6,57 .The main products of the photocatalytic reduction of CO 2 are methane and carbon monoxide and also byproduct hydrogen.Hydrogen is produced from water which is present in the form of vapor. The pure g-C 3 N 4 proved to be the least efficient towards any of the products.This is in agreement with g-C 3 N 4 valence band not having sufficient potential of generated holes for oxidation of water to hydroxyl radicals (5).Only the less effective water oxidation, due to more holes needed to achieve it, can be conducted.Because of this limitation, lower amounts of H are formed and through these lower yields of all products were detected.The pure TiO 2 on the other hand gives the average yields of CH 4 and CO and the higher yields of H 2 . In case of the nitrous oxide reduction the potential of N 2 O/N 2 redox couple is around 1.35 V which fits in between of valence and conduction bands of both, TiO 2 and g-C 3 N 4 as well. Nevertheless, pure TiO 2 and C 3 N 4 , respectively showed no photocatalytic activity, the results were the same as in case of photolysis.The addition of TiO 2 to C 3 N 4 improved the conversion about over 10 . The photocatalytic activity of semiconductor nanomaterials can be influenced by several aspects such as: (i) specific surface area, (ii) adsorption edge energy, (iii) crystallite size and (iv) efficient separation of the charge carriers.All these factors can be significantly influenced by the formation of TiO 2 /g-C 3 N 4 nanomaterials, which are formed by the addition of g-C 3 N 4 to the TiO 2 . For (i), specific surface area of TiO 2 /g-C 3 N 4 has increased with increasing amount of g-C 3 N 4 . The increase of the BET specific surface area of TiO 2 /g-C 3 N 4 could be explained due to TiO 2 nanoparticles embedded in the g-C 3 N 4 lamellar structure leads to the formation of thinner lamellar g-C 3 N 4 (Figure 9).The grinding may lead to the exfoliation of g-C 3 N 4 , which increases the surface areas of the photocatalysts.The similar results were obtained by 50 .The higher specific surface area can offer more available active sites and due to that higher photoactivity.For (ii), all the prepared TiO 2 /g-C 3 N 4 demonstrated lower absorption edge energy (Table 1) and simultaneously suitable position of conduction and valence bands in comparison with pure TiO 2 .The decrease of the absorption edge energy is leading to increased effectivity of electron hole pair generation due to the absorption of lower energy photons. For (iii), crystallinity size of rutile can also influence the photocatalytic activity due to formation of defects.Formation of lattice defects is enhancing electron-hole recombination resulting in lower photocatalytic activity 58 .The (0.3/1)TiO 2 /g-C 3 N 4 proved to have the smallest crystallite size of rutile from all the composites and this fact probably also contributed to the higher photoactivity of this photocatalyst. For (iv), the efficient separation of the charge carriers plays probably key role in photocatalytic activity of TiO 2 /g-C 3 N 4 nanocomposites.The electronic structure of the photocatalyst determines whether the material is going to be active towards specific reaction or not.The conduction band potentials of g-C 3 N 4 and TiO 2 are -1.15V and -0.3 V, respectively.The valence bands of g-C 3 N 4 and TiO 2 have potentials at 1.5 V and 3.0 V, respectively.The quite big difference between electronic bands potentials of g-C 3 N 4 and TiO 2 makes the combination of these two materials very interesting.The electrons that are photogenerated from the semiconductor with a higher CB edge (the g-C 3 N 4 ) migrate to the one with a lower CB edge (TiO 2 ).Furthermore, the photogenerated holes are transported from the low VB of TiO 2 to the high VB of g-C 3 N 4 between the semiconductors 59 .This leads to the accumulation of electrons on TiO 2 semiconductor for a reduction reaction and accumulation of holes in g-C 3 N 4 semiconductor for an oxidation reaction (Figure 13).Therefore, the electrons and holes are spatially separated to effectively repress charge recombination 59 ."}, {"llm generation": "TiO2 Evonik P25", "source": "Excluding pure g-C 3 N 4 all the prepared photocatalysts and TiO 2 Evonik P25 had very similar specific surface area with a value close to 50 m 2 /g.", "context": "Results from nitrogen physisorption, UV-Vis DRS and XRD are summarized in Tab. 1.The specific surface area of mixed photocatalysts increased significantly compared to pure g-C 3 N 4 . Due to very organized arrangement of g-C 3 N 4 crystal lattice its specific surface area is very low. Usually the value is somewhere around 10 m 2 /g 21,39 .Excluding pure g-C 3 N 4 all the prepared photocatalysts and TiO 2 Evonik P25 had very similar specific surface area with a value close to 50 m 2 /g. Absorption edge energy is one of the key aspects of the photocatalysis (Tab.1).Graphitic C 3 N 4 has relatively low band gap energy which is one of the reasons why this material attracted great attention of the photocatalytic society.The band gap energy of commercial TiO 2 Evonik P25 is quite high, 3.26 eV in our case and the addition of g-C 3 N 4 decreased the absorption edge energy only slightly (Table 1).The absorption edge energies of photocatalysts were determined from UV-Vis DRS spectra (Figure 2b).Based on the UV-vis DRS spectra the blue shift can be observed after addition of TiO 2 to pure g-C 3 N 4 (Figure 2a).The absorption edges of all TiO 2 /g- The commercial TiO 2 is composed from anatase and rutile phase which was confirmed by Raman spectroscopy (Figure 3a).The Ti-O vibrational modes of anatase are located around 395, 515 and 640 cm -1 .The Ti-Ti vibrational modes of anatase are located at 140 and 195 cm -1 40, 41 . Rutile's Ti-O vibrational modes are located around 445, 610, 825 cm -1 and Ti-Ti vibrational mode of rutile is located around 140 cm -1 41 .Since the rutile phase is representing the minority, the only recognizable peaks were at 445 and 791 cm -1 .The other ones are being overlapped by the anatase vibrational modes.The interpretation of pure g-C 3 N 4 Raman spectra is a little bit more complicated (Figure 3b). Figure 4a shows the Raman spectra of all investigated photocatalysts.The decrease of TiO 2 characteristic peaks intensity and increase of g-C 3 N 4 peaks intensity can be observed with decreasing ratio of TiO 2 /g-C 3 N 4 .Also no peak shifts were observed which means no structural changes occurred during preparation of mixed photocatalysts regarding to pure TiO 2 and g-C 3 N 4 . For better resolution the most intense anatase peak part is shown in Figure 4b. The FT-IR spectra of prepared g-C 3 N 4 , TiO 2 Evonik P25 and TiO 2 /g-C 3 N 4 photocatalysts are shown in Figure 5.In the FT-IR spectra of g-C 3 N 4 the strong band region from 1200 to 1650 cm - 1 can be found.The peak at 1640 cm -1 is attributed to C-N stretching, while three bands at 1555, 1461 and 1405 cm -1 are the result of the typical stretching vibrations of C-N heterocycles 44,45 . The last two bands at 1319 and 1243 cm -1 of the region belong to stretching vibration of connected units of C-NH-C, which is also supported by the broad band at 2900 -3500 cm -1 .This broad band is attributed to N-H and O-H stretches due to the free amino groups and adsorbed hydroxyl species, respectively 45 .The peak at 806 cm -1 is attributed to the characteristic breathing mode of s-triazine 44,45 , which increases with the increase of the g-C 3 N 4 content.All materials.The broad band in the region of 3200 -3600 cm -1 can be assigned to OH stretching modes.The two very small hard recognizable bands at 1600 and 1400 cm -1 are attributed to bending OH modes of hydroxyl groups.The broad band below at 900 cm -1 belongs to Ti-O vibrations 46 .Wavelength (nm) g-C3N4 (0.3/1)TiO2/g-C3N4 (0.5/1)TiO2/g-C3N4 (1/1)TiO2/g-C3N4 (2/1)TiO2/g-C3N4 TiO2 Two main diffraction peaks for g-C 3 N 4 located at around 14.89 and 31.95,were observed and indexed as (100) and (002) planes, respectively (Figure 7).These two diffraction peaks are in good agreement with the g-C 3 N 4 (JCPDS no.87-1526) 50 .Titanium dioxide was identified in composite samples in anatase (JCPDS no.084-1285) and rutile (JCPDS no.079-6029) forms. The crystallite size of the TiO 2 was determined from the half-width of peaks using Scherrer's formula (where K0.89) on the anatase (101) and rutile (110) peaks.The intensity of g-C 3 N 4 peaks in TiO 2 composites was attenuated in a simile way as reported 52 .The presence of g-C 3 N 4 did not have a significant influence on the phase structure of TiO 2 . In Figure 8 which correspond to Ti 4 2 p3/2 and Ti 4 2 p1/2 , respectively 55 .The detectable changes in the peak positions are observed in the high-resolution XPS O 1s spectra for pure TiO 2 and TiO 2 mixed with g-C 3 N 4 .Among two main O 1s components found in pure TiO 2 , attributed to lattice O 2- (529.5 eV) and the O 2-ions/hydroxyl groups (530.6 eV) 56 , the latter one is shifted to 530.9 eV in the case of (0.3/1)TiO 2 /g-C 3 N 4 , confirming the occurrence of interactions between TiO 2 and g-C 3 N 4 in the formed composites.The morphology of the photocatalysts was examined by TEM. Figure 9 shows the TEM images of g-C 3 N 4 , TiO 2 , and (0.3/1)TiO 2 /g-C 3 N 4 .It can be seen that pure g-C 3 N 4 (Figure 9a) indicates a 2D lamellar structure while pure TiO 2 (Figure 9b) shows spherical particles.For The photocurrent measurements were conducted to predict the photocatalytic activity of the prepared photocatalysts (Figure 10).It is evident all the prepared photocatalysts except pure g- The effect of irradiation time on the formation of gaseous products in the photocatalytic reduction of carbon dioxide was studied in the presence of all prepared TiO 2 /g-C 3 N 4 photocatalysts including pure TiO 2 Evonik P25 and g-C 3 N 4 .Figure 11 other hand, rapidly increase in first 2 hours and then are almost constant (Figure 11b).The last detected product was hydrogen which is coming from the photocatalytic water (vapor) splitting (Figure 11c).The highest yields of the three products were reached in the presence of (0.3/1)TiO 2 /g-C 3 N 4 .On the other hand, the lowest products production was achieved over pure g-C 3 N 4 .Time (h) (0.3/1)TiO2/g-C3N4 TiO2 (1/1)TiO2/g-C3N4 (0.5/1)TiO2/g-C3N4 (2/1)TiO2/g-C3N4 g-C3N4 Conditions: 8 W Hg lamp, CO 2 pressure at carbonation of 120 kPa, humidity 50, photocatalyst loading of 0.1 g. The effect of irradiation time on the photochemical and photocatalytic decomposition of The most active photocatalyst in both cases, the photocatalytic reduction of CO 2 and N 2 O, respectively, was the one composed of 0.3/1 ratio of TiO 2 /g-C 3 N 4 .The photocatalytic experiments showed the ratio of TiO 2 and g-C 3 N 4 plays significant role in photocatalysis.It also confirmed pure g-C 3 N 4 is not very active photocatalyst due to its high recombination rate of charge carriers and very low specific surface area 15 .The very high recombination of g-C 3 N 4 also confirms photoluminescence spectra where the g-C 3 N 4 band has the intensity several times higher than the rest of the photocatalysts (Figure 6). Even though both studied reactions are reductions the reaction mechanism is different for each of them.Photocatalytic reduction of carbon dioxide heavily depends on sufficient potentials of photocatalyst's conduction and valence bands.CO 2 molecule is very stable and direct reduction by electron (CO 2 /CO 2 ) is limited by very negative potential (-1.9 V vs. NHE) 6,57 .The main products of the photocatalytic reduction of CO 2 are methane and carbon monoxide and also byproduct hydrogen.Hydrogen is produced from water which is present in the form of vapor. The pure g-C 3 N 4 proved to be the least efficient towards any of the products.This is in agreement with g-C 3 N 4 valence band not having sufficient potential of generated holes for oxidation of water to hydroxyl radicals (5).Only the less effective water oxidation, due to more holes needed to achieve it, can be conducted.Because of this limitation, lower amounts of H are formed and through these lower yields of all products were detected.The pure TiO 2 on the other hand gives the average yields of CH 4 and CO and the higher yields of H 2 . In case of the nitrous oxide reduction the potential of N 2 O/N 2 redox couple is around 1.35 V which fits in between of valence and conduction bands of both, TiO 2 and g-C 3 N 4 as well. Nevertheless, pure TiO 2 and C 3 N 4 , respectively showed no photocatalytic activity, the results were the same as in case of photolysis.The addition of TiO 2 to C 3 N 4 improved the conversion about over 10 . The photocatalytic activity of semiconductor nanomaterials can be influenced by several aspects such as: (i) specific surface area, (ii) adsorption edge energy, (iii) crystallite size and (iv) efficient separation of the charge carriers.All these factors can be significantly influenced by the formation of TiO 2 /g-C 3 N 4 nanomaterials, which are formed by the addition of g-C 3 N 4 to the TiO 2 . For (i), specific surface area of TiO 2 /g-C 3 N 4 has increased with increasing amount of g-C 3 N 4 . The increase of the BET specific surface area of TiO 2 /g-C 3 N 4 could be explained due to TiO 2 nanoparticles embedded in the g-C 3 N 4 lamellar structure leads to the formation of thinner lamellar g-C 3 N 4 (Figure 9).The grinding may lead to the exfoliation of g-C 3 N 4 , which increases the surface areas of the photocatalysts.The similar results were obtained by 50 .The higher specific surface area can offer more available active sites and due to that higher photoactivity.For (ii), all the prepared TiO 2 /g-C 3 N 4 demonstrated lower absorption edge energy (Table 1) and simultaneously suitable position of conduction and valence bands in comparison with pure TiO 2 .The decrease of the absorption edge energy is leading to increased effectivity of electron hole pair generation due to the absorption of lower energy photons. For (iii), crystallinity size of rutile can also influence the photocatalytic activity due to formation of defects.Formation of lattice defects is enhancing electron-hole recombination resulting in lower photocatalytic activity 58 .The (0.3/1)TiO 2 /g-C 3 N 4 proved to have the smallest crystallite size of rutile from all the composites and this fact probably also contributed to the higher photoactivity of this photocatalyst. For (iv), the efficient separation of the charge carriers plays probably key role in photocatalytic activity of TiO 2 /g-C 3 N 4 nanocomposites.The electronic structure of the photocatalyst determines whether the material is going to be active towards specific reaction or not.The conduction band potentials of g-C 3 N 4 and TiO 2 are -1.15V and -0.3 V, respectively.The valence bands of g-C 3 N 4 and TiO 2 have potentials at 1.5 V and 3.0 V, respectively.The quite big difference between electronic bands potentials of g-C 3 N 4 and TiO 2 makes the combination of these two materials very interesting.The electrons that are photogenerated from the semiconductor with a higher CB edge (the g-C 3 N 4 ) migrate to the one with a lower CB edge (TiO 2 ).Furthermore, the photogenerated holes are transported from the low VB of TiO 2 to the high VB of g-C 3 N 4 between the semiconductors 59 .This leads to the accumulation of electrons on TiO 2 semiconductor for a reduction reaction and accumulation of holes in g-C 3 N 4 semiconductor for an oxidation reaction (Figure 13).Therefore, the electrons and holes are spatially separated to effectively repress charge recombination 59 ."}, {"llm generation": "TiO2/g-C3N4", "source": "The FT-IR spectra of prepared g-C 3 N 4 , TiO 2 Evonik P25 and TiO 2 /g-C 3 N 4 photocatalysts are shown in Figure 5.", "context": "Results from nitrogen physisorption, UV-Vis DRS and XRD are summarized in Tab. 1.The specific surface area of mixed photocatalysts increased significantly compared to pure g-C 3 N 4 . Due to very organized arrangement of g-C 3 N 4 crystal lattice its specific surface area is very low. Usually the value is somewhere around 10 m 2 /g 21,39 .Excluding pure g-C 3 N 4 all the prepared photocatalysts and TiO 2 Evonik P25 had very similar specific surface area with a value close to 50 m 2 /g. Absorption edge energy is one of the key aspects of the photocatalysis (Tab.1).Graphitic C 3 N 4 has relatively low band gap energy which is one of the reasons why this material attracted great attention of the photocatalytic society.The band gap energy of commercial TiO 2 Evonik P25 is quite high, 3.26 eV in our case and the addition of g-C 3 N 4 decreased the absorption edge energy only slightly (Table 1).The absorption edge energies of photocatalysts were determined from UV-Vis DRS spectra (Figure 2b).Based on the UV-vis DRS spectra the blue shift can be observed after addition of TiO 2 to pure g-C 3 N 4 (Figure 2a).The absorption edges of all TiO 2 /g- The commercial TiO 2 is composed from anatase and rutile phase which was confirmed by Raman spectroscopy (Figure 3a).The Ti-O vibrational modes of anatase are located around 395, 515 and 640 cm -1 .The Ti-Ti vibrational modes of anatase are located at 140 and 195 cm -1 40, 41 . Rutile's Ti-O vibrational modes are located around 445, 610, 825 cm -1 and Ti-Ti vibrational mode of rutile is located around 140 cm -1 41 .Since the rutile phase is representing the minority, the only recognizable peaks were at 445 and 791 cm -1 .The other ones are being overlapped by the anatase vibrational modes.The interpretation of pure g-C 3 N 4 Raman spectra is a little bit more complicated (Figure 3b). Figure 4a shows the Raman spectra of all investigated photocatalysts.The decrease of TiO 2 characteristic peaks intensity and increase of g-C 3 N 4 peaks intensity can be observed with decreasing ratio of TiO 2 /g-C 3 N 4 .Also no peak shifts were observed which means no structural changes occurred during preparation of mixed photocatalysts regarding to pure TiO 2 and g-C 3 N 4 . For better resolution the most intense anatase peak part is shown in Figure 4b. The FT-IR spectra of prepared g-C 3 N 4 , TiO 2 Evonik P25 and TiO 2 /g-C 3 N 4 photocatalysts are shown in Figure 5.In the FT-IR spectra of g-C 3 N 4 the strong band region from 1200 to 1650 cm - 1 can be found.The peak at 1640 cm -1 is attributed to C-N stretching, while three bands at 1555, 1461 and 1405 cm -1 are the result of the typical stretching vibrations of C-N heterocycles 44,45 . The last two bands at 1319 and 1243 cm -1 of the region belong to stretching vibration of connected units of C-NH-C, which is also supported by the broad band at 2900 -3500 cm -1 .This broad band is attributed to N-H and O-H stretches due to the free amino groups and adsorbed hydroxyl species, respectively 45 .The peak at 806 cm -1 is attributed to the characteristic breathing mode of s-triazine 44,45 , which increases with the increase of the g-C 3 N 4 content.All materials.The broad band in the region of 3200 -3600 cm -1 can be assigned to OH stretching modes.The two very small hard recognizable bands at 1600 and 1400 cm -1 are attributed to bending OH modes of hydroxyl groups.The broad band below at 900 cm -1 belongs to Ti-O vibrations 46 .Wavelength (nm) g-C3N4 (0.3/1)TiO2/g-C3N4 (0.5/1)TiO2/g-C3N4 (1/1)TiO2/g-C3N4 (2/1)TiO2/g-C3N4 TiO2 Two main diffraction peaks for g-C 3 N 4 located at around 14.89 and 31.95,were observed and indexed as (100) and (002) planes, respectively (Figure 7).These two diffraction peaks are in good agreement with the g-C 3 N 4 (JCPDS no.87-1526) 50 .Titanium dioxide was identified in composite samples in anatase (JCPDS no.084-1285) and rutile (JCPDS no.079-6029) forms. The crystallite size of the TiO 2 was determined from the half-width of peaks using Scherrer's formula (where K0.89) on the anatase (101) and rutile (110) peaks.The intensity of g-C 3 N 4 peaks in TiO 2 composites was attenuated in a simile way as reported 52 .The presence of g-C 3 N 4 did not have a significant influence on the phase structure of TiO 2 . In Figure 8 which correspond to Ti 4 2 p3/2 and Ti 4 2 p1/2 , respectively 55 .The detectable changes in the peak positions are observed in the high-resolution XPS O 1s spectra for pure TiO 2 and TiO 2 mixed with g-C 3 N 4 .Among two main O 1s components found in pure TiO 2 , attributed to lattice O 2- (529.5 eV) and the O 2-ions/hydroxyl groups (530.6 eV) 56 , the latter one is shifted to 530.9 eV in the case of (0.3/1)TiO 2 /g-C 3 N 4 , confirming the occurrence of interactions between TiO 2 and g-C 3 N 4 in the formed composites.The morphology of the photocatalysts was examined by TEM. Figure 9 shows the TEM images of g-C 3 N 4 , TiO 2 , and (0.3/1)TiO 2 /g-C 3 N 4 .It can be seen that pure g-C 3 N 4 (Figure 9a) indicates a 2D lamellar structure while pure TiO 2 (Figure 9b) shows spherical particles.For The photocurrent measurements were conducted to predict the photocatalytic activity of the prepared photocatalysts (Figure 10).It is evident all the prepared photocatalysts except pure g- The effect of irradiation time on the formation of gaseous products in the photocatalytic reduction of carbon dioxide was studied in the presence of all prepared TiO 2 /g-C 3 N 4 photocatalysts including pure TiO 2 Evonik P25 and g-C 3 N 4 .Figure 11 other hand, rapidly increase in first 2 hours and then are almost constant (Figure 11b).The last detected product was hydrogen which is coming from the photocatalytic water (vapor) splitting (Figure 11c).The highest yields of the three products were reached in the presence of (0.3/1)TiO 2 /g-C 3 N 4 .On the other hand, the lowest products production was achieved over pure g-C 3 N 4 .Time (h) (0.3/1)TiO2/g-C3N4 TiO2 (1/1)TiO2/g-C3N4 (0.5/1)TiO2/g-C3N4 (2/1)TiO2/g-C3N4 g-C3N4 Conditions: 8 W Hg lamp, CO 2 pressure at carbonation of 120 kPa, humidity 50, photocatalyst loading of 0.1 g. The effect of irradiation time on the photochemical and photocatalytic decomposition of The most active photocatalyst in both cases, the photocatalytic reduction of CO 2 and N 2 O, respectively, was the one composed of 0.3/1 ratio of TiO 2 /g-C 3 N 4 .The photocatalytic experiments showed the ratio of TiO 2 and g-C 3 N 4 plays significant role in photocatalysis.It also confirmed pure g-C 3 N 4 is not very active photocatalyst due to its high recombination rate of charge carriers and very low specific surface area 15 .The very high recombination of g-C 3 N 4 also confirms photoluminescence spectra where the g-C 3 N 4 band has the intensity several times higher than the rest of the photocatalysts (Figure 6). Even though both studied reactions are reductions the reaction mechanism is different for each of them.Photocatalytic reduction of carbon dioxide heavily depends on sufficient potentials of photocatalyst's conduction and valence bands.CO 2 molecule is very stable and direct reduction by electron (CO 2 /CO 2 ) is limited by very negative potential (-1.9 V vs. NHE) 6,57 .The main products of the photocatalytic reduction of CO 2 are methane and carbon monoxide and also byproduct hydrogen.Hydrogen is produced from water which is present in the form of vapor. The pure g-C 3 N 4 proved to be the least efficient towards any of the products.This is in agreement with g-C 3 N 4 valence band not having sufficient potential of generated holes for oxidation of water to hydroxyl radicals (5).Only the less effective water oxidation, due to more holes needed to achieve it, can be conducted.Because of this limitation, lower amounts of H are formed and through these lower yields of all products were detected.The pure TiO 2 on the other hand gives the average yields of CH 4 and CO and the higher yields of H 2 . In case of the nitrous oxide reduction the potential of N 2 O/N 2 redox couple is around 1.35 V which fits in between of valence and conduction bands of both, TiO 2 and g-C 3 N 4 as well. Nevertheless, pure TiO 2 and C 3 N 4 , respectively showed no photocatalytic activity, the results were the same as in case of photolysis.The addition of TiO 2 to C 3 N 4 improved the conversion about over 10 . The photocatalytic activity of semiconductor nanomaterials can be influenced by several aspects such as: (i) specific surface area, (ii) adsorption edge energy, (iii) crystallite size and (iv) efficient separation of the charge carriers.All these factors can be significantly influenced by the formation of TiO 2 /g-C 3 N 4 nanomaterials, which are formed by the addition of g-C 3 N 4 to the TiO 2 . For (i), specific surface area of TiO 2 /g-C 3 N 4 has increased with increasing amount of g-C 3 N 4 . The increase of the BET specific surface area of TiO 2 /g-C 3 N 4 could be explained due to TiO 2 nanoparticles embedded in the g-C 3 N 4 lamellar structure leads to the formation of thinner lamellar g-C 3 N 4 (Figure 9).The grinding may lead to the exfoliation of g-C 3 N 4 , which increases the surface areas of the photocatalysts.The similar results were obtained by 50 .The higher specific surface area can offer more available active sites and due to that higher photoactivity.For (ii), all the prepared TiO 2 /g-C 3 N 4 demonstrated lower absorption edge energy (Table 1) and simultaneously suitable position of conduction and valence bands in comparison with pure TiO 2 .The decrease of the absorption edge energy is leading to increased effectivity of electron hole pair generation due to the absorption of lower energy photons. For (iii), crystallinity size of rutile can also influence the photocatalytic activity due to formation of defects.Formation of lattice defects is enhancing electron-hole recombination resulting in lower photocatalytic activity 58 .The (0.3/1)TiO 2 /g-C 3 N 4 proved to have the smallest crystallite size of rutile from all the composites and this fact probably also contributed to the higher photoactivity of this photocatalyst. For (iv), the efficient separation of the charge carriers plays probably key role in photocatalytic activity of TiO 2 /g-C 3 N 4 nanocomposites.The electronic structure of the photocatalyst determines whether the material is going to be active towards specific reaction or not.The conduction band potentials of g-C 3 N 4 and TiO 2 are -1.15V and -0.3 V, respectively.The valence bands of g-C 3 N 4 and TiO 2 have potentials at 1.5 V and 3.0 V, respectively.The quite big difference between electronic bands potentials of g-C 3 N 4 and TiO 2 makes the combination of these two materials very interesting.The electrons that are photogenerated from the semiconductor with a higher CB edge (the g-C 3 N 4 ) migrate to the one with a lower CB edge (TiO 2 ).Furthermore, the photogenerated holes are transported from the low VB of TiO 2 to the high VB of g-C 3 N 4 between the semiconductors 59 .This leads to the accumulation of electrons on TiO 2 semiconductor for a reduction reaction and accumulation of holes in g-C 3 N 4 semiconductor for an oxidation reaction (Figure 13).Therefore, the electrons and holes are spatially separated to effectively repress charge recombination 59 ."}, {"llm generation": "TiO 2 /g-C 3 N 4 photocatalysts", "source": "A series of TiO 2 /g-C 3 N 4 photocatalysts with different ratio of TiO 2 to g-C 3 N 4 (from 0.", "context": "A series of TiO 2 /g-C 3 N 4 photocatalysts with different ratio of TiO 2 to g-C 3 N 4 (from 0. Figure 1: The schematic description of the CO 2 photocatalytic reduction apparatus. /He mixture (968 ppm) and irradiated by an 8 W Hg lamp ( 254 nm; intensity 0.5 mW/cm 2 ).Pressure was continuously monitored inside the photoreactor during the experiments.A gas chromatograph equipped by ShinCarbon ST micropacked column and GC/BID was used for the analysis of N 2 O decrease.The concentration of N 2 O was measured before switching on the UV lamp to determine initial concentration and during the reaction.The reproducibility of the photocatalytic experiments was verified by repeated tests in the interval of 0-18 h.The accuracy of the measurement was certified by a series of repeated measurements, Figure 2: a) UV-Vis DRS spectra of TiO 2 /g-C 3 N 4 photocatalysts and b) the determination of the Figure 3: Raman spectra of a) commercial TiO 2 Evonik P25 and b) g-C 3 N 4 . Figure 4: a) Raman spectra of all prepared photocatalysts; b) evolution of the Raman spectra focused on TiO 2 characteristic peak at 143 cm -1 . C 3 N 4 characteristic bands are also present in the mixtures of TiO 2 /g-C 3 N 4 with decreasing intensity as the ratio of TiO 2 /g-C 3 N 4 increase.The following bands are typical for TiO 2 based Figure 5: FT-IR spectra of TiO 2 /g-C 3 N 4 photocatalysts. Figure 6: Photoluminescence spectra of TiO 2 /g-C 3 N 4 photocatalysts. Figure 7: XRD patterns of TiO 2 /g-C 3 N 4 photocatalysts. photoelectron peaks at 458.2-458.3eV and 464.0-464.1 eV, with a peak separation of 5.7-5.8eV, Figure 8: XPS N 1s, O 1s, C 1s and Ti 2p spectra measured for TiO 2 , (0.3/1)TiO 2 /g-C 3 N 4 and g- TiO 2 /g-C 3 N 4 (Figure 9c,d), the TiO 2 particles are embedded in the g-C 3 N 4 lamellar structure.This finding suggests the creation of a heterojunction between TiO 2 and g-C 3 N 4 , which could lead to improved separation of electron and hole. Figure 9: TEM images of g-C 3 N 4 (a), TiO 2 (b), and (0.3/1)TiO 2 /g-C 3 N 4 (c, d). Figure 10: a) Photocurrent generation at electrodes made from the studied photocatalysts and b) photocatalysts including pure TiO 2 Evonik P25 and g-C 3 N 4 .Figure11demonstrates the Figure 11: Time dependence of the a) methane yields, b) carbon monoxide yields and c) was investigated for all TiO 2 /g-C 3 N 4 photocatalysts including pure TiO 2 and g-C 3 N 4 for a time period of 0-16 h.The time dependences of N 2 O conversion for photocatalysis and photolysis are shown in Figure12.A gradual increase of N 2 O conversion with increasing time of irradiation can be noticed.The highest N 2 O conversion of 57 was observed for the (0.3/1)TiO 2 /g-C 3 N 4 catalyst after 16 h.On the other hand, both pure TiO 2 and g-C 3 N 4 photocatalysts exhibited the same N 2 O conversions as during the photolysis experiments.The products of the reaction are oxygen and nitrogen; no other compounds were detected. Figure 12: Time dependence of the N 2 O conversion over TiO 2 /g-C 3 N 4 photocatalysts.Conditions: 8 W Hg lamp, N 2 O (968 ppm)/He mixture, photocatalyst loading of 0.1 g. TiO 2 /g-C 3 N 4 has shown the highest specific surface area (S BET 53 m 2 /g) in comparison with pure g-C 3 N 4 (S BET 11 m 2 /g) and also the highest photoactivity.On the other hand, the decrease of specific surface area with increase of TiO 2 content can be explained by agglomerating of TiO 2 (Figure9c, d). Figure 13: Schematic illustration showing the photogenerated charge separation in TiO 2 /g-C 3 N 4 photocatalysts had enhanced photocatalytic performance compared to their components Specific surface area, absorption edge energy and crystallite size of prepared photocatalysts. ACS Paragon Plus EnvironmentThe Journal of Physical Chemistry This work was supported by the Grant Agency of the Czech Republic (projects.reg.No. 14-35327J and 16-10527S), by the Ministry of Education, Youth and Sports of the Czech Republic within \"National Feasibility Program I\", project LO1404 \"TUCENET\" and by EU structural funding Operational Programme Research and Development for Innovation Project No. CZ.1.05/2.1.00/19.0388."}], "co-catalyst": [], "light source": [{"llm generation": "UV", "source": "A cylindrical stirred batch reactor with a photocatalyst spread on the bottom of the reactor was illuminated by an 8 W Hg lamp ( 254 nm; intensity 0.5 mW/cm 2 ) placed in horizontal position on top of the quartz glass visor.", "context": "The g-C 3 N 4 was synthesized by simple heating of melamine in the muffle furnace.10 g of melamine powder as precursor were heated to 550 C at a heating rate of 10 C/min in a covered crucible.The temperature was kept at 550 C for 2 h and then cooled down to room temperature. A yellow product of g-C 3 N 4 was obtained and was ground to a fine powder. As a precursor of TiO 2 commercial P25 (Evonik) was used.The TiO 2 /g-C 3 N 4 composites were prepared by mechanical mixture and calcined in a muffle furnace at 450 C for 2 h with temperature increasing at the rate of 10 C/min.The samples were labelled according to weight ratio of TiO 2 /g-C 3 N 4 as follows: (0.3/1), (0.5/1), (1/1) and (2/1) TiO 2 /g-C 3 N 4 . X-ray powder diffraction patterns (XRD) were measured using a Bruker D8 (Bruker AXS) diffractometer equipped by a detector sensitive for the placement (VANTEC 1).The CoK lamp was used as a source of irradiation of wavelength 0.178897 nm.Measurements were done in the conventional Bragg-Brentano setup. Nitrogen physisorption at 77 K was performed on a 3Flex automated volumetric apparatus (Micromeritics Instruments, USA) after degassing of materials at 150 C for more than 24 h under vacuum below 1 Torr.Degassing at low temperature was applied to remove physisorbed water, but having no influence on the porous morphology of the developed materials.The specific surface area was calculated according to the classical Brunauer-Emmett-Teller (BET) theory for the p/p0 range of 0.05-0.30 34.As the specific surface area, S BET , is not a proper parameter in the case of mesoporous solids containing micropores 35 , the mesopore surface area, S meso , and the micropore volume, V micro , were also evaluated based on the t-plot method 36 with the C modif constant 35,37 .The net pore volume, V net , was determined from the nitrogen adsorption isotherm at maximum p/p0 (0.99).The pore-size distribution was evaluated from the adsorption branch of the nitrogen adsorption desorption isotherm by the Barrett-Joyner-Halenda (BJH) method 38 using the de Boer standard isotherm and assuming cylindrical pore geometry. IR spectra of samples were measured by potassium bromide pellets technique.Exactly 1.0 mg of sample was ground with 200 mg dried potassium bromide.This mixture was used to prepare the potassium bromide pellets.The pellets were pressed by 8 tons for 30 seconds under vacuum. The IR spectra were collected using FT-IR spectrometer Nexus 470 (ThermoScientific, USA) with DTGS detector.The measurement parameters were the following: the spectral region of 4000-400 cm -1 , spectral resolution 4 cm -1 ; 64 scans; the Happ-Genzel apodization.Treatment of spectra: polynomial (second order) baseline, subtraction spectrum of pure potassium bromide. A 180 sampling was used as measurement technique of Raman spectroscopy.The Raman spectra were measured at dispersive Raman spectrometer DXR SmartRaman (ThermoScientific, USA) with CCD detector.The measurement parameters were as follows: excitation laser 780 nm, grating 400 lines/mm, aperture 50 m, exposure time 1 second, number of exposures 1000, the spectral region of 1800-50 cm -1 .An empty sample compartment was used for background measurement.Treatment of spectra: fluorescence correction (6 th order). The UV-visible spectra of prepared nanocomposites were recorded using a UV-2600 spectrophotometer with an ISR-2600 integrating sphere attachment (Shimadzu Scientific Co., Japan) from 220 to 1400 nm.Sampling interval was 1 nm and width of slit was 2 nm.Barium sulphate (BaSO 4 ) was used as reference material. Photoluminescence (PL) spectra were measured by a spectrometer FLS920 (Edinburgh Instrument Ltd, UK).The spectrometer was equipped with a 450 W Xenon lamp (Xe900).The excitation wavelength was 325 nm.The width of excitation and emission slits was 0.5 nm. Gas chromatography with isotope ratio mass spectrometry (GC/IRMS) DELTA Advantage (Thermo Scientific, USA) was used for the detection of 13 C in gas samples before and after photocatalytic reaction. X-ray photoelectron spectra (XPS) were recorded using a hemispherical VG SCIENTA R3000 analyzer with constant pass energy of 100 eV, a monochromatized aluminum source Al K (E 1486.6eV) and a low energy electron flood gun (FS40A-PS) to compensate the charge on the surface of nonconductive samples.The base pressure in the analytical chamber was 510 -9 mbar. The binding energies were referenced to C 1s core level (E b 284.6 eV).The composition and chemical surrounding of the sample surface were investigated on the basis of the areas and binding energies of Ti 2p, O 1s, N 1s and C 1s photoelectron peaks.The fitting of high resolution spectra was provided through the Casa XPS software. The morphology of particles was observed on a transmission electron microscope (TEM) JEOL 2010 HC (JEOL Ltd., Japan).The particles were dispersed in ethanol and using an ultrasonic sprayer deposited on a TEM grid with carbon holey support film. Photoelectrochemical measurements were performed using a photoelectric spectrometer equipped with the 150 W Xe lamp and coupled with the P-IF 1.6 potentiostat (Instytut Fotonowy, Poland).The photocurrent responses were recorded using a classical three electrode setup.The platinum wire and Ag/AgCl were used as the auxiliary and reference electrodes, respectively.The working electrode consisted of photocatalyst powder deposited onto indium-tin oxide (ITO) foil coated by polyethylene terephthalate.The 0.1 M KNO 3 was used as an electrolyte solution.The photocurrent spectra were recorded within the range of 240 -500 nm with the step of 10 nm in the potential range of -0.2 to 0.8 V, step 0.1 V. Before the measurement itself the electrolyte was purged by argon to ensure oxygen free environment.The argon purge was also kept constant during the measurement. The photocatalytic reduction of carbon dioxide was carried out in a homemade apparatus ( Figure 1).A cylindrical stirred batch reactor with a photocatalyst spread on the bottom of the reactor was illuminated by an 8 W Hg lamp ( 254 nm; intensity 0.5 mW/cm 2 ) placed in horizontal position on top of the quartz glass visor.The reactor shell was made from stainless steel.The internal volume was 355 cm 3 .The photocatalyst powder loading was 0.1 g.Before the irradiation was turned ON, a supercritical fluid-grade CO 2 with a certified maximum of hydrocarbons less than 1 ppm (SIAD Technical Gases, CZ) to avoid any hydrocarbon contamination was purged through distilled water reservoir to saturate it by humidity (50 rel.). Afterwards the water saturated CO 2 was purged through the reactor in order to displace the air from the reactor.The CO 2 pressure was maintained at 120 kPa through the purging for 20 minutes.The pressure inside the reactor was continuously monitored.The reactor was pressurized to 140 kPa and sealed.The sample at 0 hour was taken and immediately analyzed on barrier discharge ionization detector (GC/BID).The photocatalytic reaction was started by switching on the Hg lamp.Gas samples were discontinuously taken at various times during the irradiation (8 hours).Gas sampling was performed using a gas-tight syringe (10 ml) through a septum.GC/BID equipped by ShinCarbon ST micropacked column was used for the analysis of reaction products in the gas phase.The accuracy of the experiment was verified by a series of repeated measurements, and the relative error of product yields (mol/g cat ) was determined to be less than 10 .Blank tests were carried out to guarantee that the methane production was due to the photocatalytic reduction of CO 2 and to eliminate the surrounding interference.During the first test, the reactor was UV-illuminated without the photocatalyst, the second blank test was conducted in the dark with the photocatalyst under the same experimental conditions, and the third test consisted of irradiating the photocatalyst in the absence of CO 2 .No hydrocarbons were detected in the above blank tests. To double check the products are really coming from the photocatalytic reduction of CO 2 the measurement with CO 2 containing 13 C isotope was conducted.Samples were taken at various times and the increase of 13 C amount in methane was observed with increasing irradiation time. These measurements confirmed that the methane is a product of the CO 2 photocatalytic reduction. The photocatalytic reduction of N 2 O was carried out in a homemade apparatus at ambient temperature with and without the photocatalyst (photocatalysis and photolysis, respectively) 12 . The 0.1 g of photocatalyst was placed on an adhesive tape inserted on the bottom of the batch reactor (635 ml volume).In both photochemical and photocatalytic experiments, the reactor was and the relative error of the N 2 O concentration was determined to be less than 5 ."}, {"llm generation": "Hg lamp", "source": "Conditions: 8 W Hg lamp, CO 2 pressure at carbonation of 120 kPa, humidity 50, photocatalyst loading of 0.1 g.", "context": "Results from nitrogen physisorption, UV-Vis DRS and XRD are summarized in Tab. 1.The specific surface area of mixed photocatalysts increased significantly compared to pure g-C 3 N 4 . Due to very organized arrangement of g-C 3 N 4 crystal lattice its specific surface area is very low. Usually the value is somewhere around 10 m 2 /g 21,39 .Excluding pure g-C 3 N 4 all the prepared photocatalysts and TiO 2 Evonik P25 had very similar specific surface area with a value close to 50 m 2 /g. Absorption edge energy is one of the key aspects of the photocatalysis (Tab.1).Graphitic C 3 N 4 has relatively low band gap energy which is one of the reasons why this material attracted great attention of the photocatalytic society.The band gap energy of commercial TiO 2 Evonik P25 is quite high, 3.26 eV in our case and the addition of g-C 3 N 4 decreased the absorption edge energy only slightly (Table 1).The absorption edge energies of photocatalysts were determined from UV-Vis DRS spectra (Figure 2b).Based on the UV-vis DRS spectra the blue shift can be observed after addition of TiO 2 to pure g-C 3 N 4 (Figure 2a).The absorption edges of all TiO 2 /g- The commercial TiO 2 is composed from anatase and rutile phase which was confirmed by Raman spectroscopy (Figure 3a).The Ti-O vibrational modes of anatase are located around 395, 515 and 640 cm -1 .The Ti-Ti vibrational modes of anatase are located at 140 and 195 cm -1 40, 41 . Rutile's Ti-O vibrational modes are located around 445, 610, 825 cm -1 and Ti-Ti vibrational mode of rutile is located around 140 cm -1 41 .Since the rutile phase is representing the minority, the only recognizable peaks were at 445 and 791 cm -1 .The other ones are being overlapped by the anatase vibrational modes.The interpretation of pure g-C 3 N 4 Raman spectra is a little bit more complicated (Figure 3b). Figure 4a shows the Raman spectra of all investigated photocatalysts.The decrease of TiO 2 characteristic peaks intensity and increase of g-C 3 N 4 peaks intensity can be observed with decreasing ratio of TiO 2 /g-C 3 N 4 .Also no peak shifts were observed which means no structural changes occurred during preparation of mixed photocatalysts regarding to pure TiO 2 and g-C 3 N 4 . For better resolution the most intense anatase peak part is shown in Figure 4b. The FT-IR spectra of prepared g-C 3 N 4 , TiO 2 Evonik P25 and TiO 2 /g-C 3 N 4 photocatalysts are shown in Figure 5.In the FT-IR spectra of g-C 3 N 4 the strong band region from 1200 to 1650 cm - 1 can be found.The peak at 1640 cm -1 is attributed to C-N stretching, while three bands at 1555, 1461 and 1405 cm -1 are the result of the typical stretching vibrations of C-N heterocycles 44,45 . The last two bands at 1319 and 1243 cm -1 of the region belong to stretching vibration of connected units of C-NH-C, which is also supported by the broad band at 2900 -3500 cm -1 .This broad band is attributed to N-H and O-H stretches due to the free amino groups and adsorbed hydroxyl species, respectively 45 .The peak at 806 cm -1 is attributed to the characteristic breathing mode of s-triazine 44,45 , which increases with the increase of the g-C 3 N 4 content.All materials.The broad band in the region of 3200 -3600 cm -1 can be assigned to OH stretching modes.The two very small hard recognizable bands at 1600 and 1400 cm -1 are attributed to bending OH modes of hydroxyl groups.The broad band below at 900 cm -1 belongs to Ti-O vibrations 46 .Wavelength (nm) g-C3N4 (0.3/1)TiO2/g-C3N4 (0.5/1)TiO2/g-C3N4 (1/1)TiO2/g-C3N4 (2/1)TiO2/g-C3N4 TiO2 Two main diffraction peaks for g-C 3 N 4 located at around 14.89 and 31.95,were observed and indexed as (100) and (002) planes, respectively (Figure 7).These two diffraction peaks are in good agreement with the g-C 3 N 4 (JCPDS no.87-1526) 50 .Titanium dioxide was identified in composite samples in anatase (JCPDS no.084-1285) and rutile (JCPDS no.079-6029) forms. The crystallite size of the TiO 2 was determined from the half-width of peaks using Scherrer's formula (where K0.89) on the anatase (101) and rutile (110) peaks.The intensity of g-C 3 N 4 peaks in TiO 2 composites was attenuated in a simile way as reported 52 .The presence of g-C 3 N 4 did not have a significant influence on the phase structure of TiO 2 . In Figure 8 which correspond to Ti 4 2 p3/2 and Ti 4 2 p1/2 , respectively 55 .The detectable changes in the peak positions are observed in the high-resolution XPS O 1s spectra for pure TiO 2 and TiO 2 mixed with g-C 3 N 4 .Among two main O 1s components found in pure TiO 2 , attributed to lattice O 2- (529.5 eV) and the O 2-ions/hydroxyl groups (530.6 eV) 56 , the latter one is shifted to 530.9 eV in the case of (0.3/1)TiO 2 /g-C 3 N 4 , confirming the occurrence of interactions between TiO 2 and g-C 3 N 4 in the formed composites.The morphology of the photocatalysts was examined by TEM. Figure 9 shows the TEM images of g-C 3 N 4 , TiO 2 , and (0.3/1)TiO 2 /g-C 3 N 4 .It can be seen that pure g-C 3 N 4 (Figure 9a) indicates a 2D lamellar structure while pure TiO 2 (Figure 9b) shows spherical particles.For The photocurrent measurements were conducted to predict the photocatalytic activity of the prepared photocatalysts (Figure 10).It is evident all the prepared photocatalysts except pure g- The effect of irradiation time on the formation of gaseous products in the photocatalytic reduction of carbon dioxide was studied in the presence of all prepared TiO 2 /g-C 3 N 4 photocatalysts including pure TiO 2 Evonik P25 and g-C 3 N 4 .Figure 11 other hand, rapidly increase in first 2 hours and then are almost constant (Figure 11b).The last detected product was hydrogen which is coming from the photocatalytic water (vapor) splitting (Figure 11c).The highest yields of the three products were reached in the presence of (0.3/1)TiO 2 /g-C 3 N 4 .On the other hand, the lowest products production was achieved over pure g-C 3 N 4 .Time (h) (0.3/1)TiO2/g-C3N4 TiO2 (1/1)TiO2/g-C3N4 (0.5/1)TiO2/g-C3N4 (2/1)TiO2/g-C3N4 g-C3N4 Conditions: 8 W Hg lamp, CO 2 pressure at carbonation of 120 kPa, humidity 50, photocatalyst loading of 0.1 g. The effect of irradiation time on the photochemical and photocatalytic decomposition of The most active photocatalyst in both cases, the photocatalytic reduction of CO 2 and N 2 O, respectively, was the one composed of 0.3/1 ratio of TiO 2 /g-C 3 N 4 .The photocatalytic experiments showed the ratio of TiO 2 and g-C 3 N 4 plays significant role in photocatalysis.It also confirmed pure g-C 3 N 4 is not very active photocatalyst due to its high recombination rate of charge carriers and very low specific surface area 15 .The very high recombination of g-C 3 N 4 also confirms photoluminescence spectra where the g-C 3 N 4 band has the intensity several times higher than the rest of the photocatalysts (Figure 6). Even though both studied reactions are reductions the reaction mechanism is different for each of them.Photocatalytic reduction of carbon dioxide heavily depends on sufficient potentials of photocatalyst's conduction and valence bands.CO 2 molecule is very stable and direct reduction by electron (CO 2 /CO 2 ) is limited by very negative potential (-1.9 V vs. NHE) 6,57 .The main products of the photocatalytic reduction of CO 2 are methane and carbon monoxide and also byproduct hydrogen.Hydrogen is produced from water which is present in the form of vapor. The pure g-C 3 N 4 proved to be the least efficient towards any of the products.This is in agreement with g-C 3 N 4 valence band not having sufficient potential of generated holes for oxidation of water to hydroxyl radicals (5).Only the less effective water oxidation, due to more holes needed to achieve it, can be conducted.Because of this limitation, lower amounts of H are formed and through these lower yields of all products were detected.The pure TiO 2 on the other hand gives the average yields of CH 4 and CO and the higher yields of H 2 . In case of the nitrous oxide reduction the potential of N 2 O/N 2 redox couple is around 1.35 V which fits in between of valence and conduction bands of both, TiO 2 and g-C 3 N 4 as well. Nevertheless, pure TiO 2 and C 3 N 4 , respectively showed no photocatalytic activity, the results were the same as in case of photolysis.The addition of TiO 2 to C 3 N 4 improved the conversion about over 10 . The photocatalytic activity of semiconductor nanomaterials can be influenced by several aspects such as: (i) specific surface area, (ii) adsorption edge energy, (iii) crystallite size and (iv) efficient separation of the charge carriers.All these factors can be significantly influenced by the formation of TiO 2 /g-C 3 N 4 nanomaterials, which are formed by the addition of g-C 3 N 4 to the TiO 2 . For (i), specific surface area of TiO 2 /g-C 3 N 4 has increased with increasing amount of g-C 3 N 4 . The increase of the BET specific surface area of TiO 2 /g-C 3 N 4 could be explained due to TiO 2 nanoparticles embedded in the g-C 3 N 4 lamellar structure leads to the formation of thinner lamellar g-C 3 N 4 (Figure 9).The grinding may lead to the exfoliation of g-C 3 N 4 , which increases the surface areas of the photocatalysts.The similar results were obtained by 50 .The higher specific surface area can offer more available active sites and due to that higher photoactivity.For (ii), all the prepared TiO 2 /g-C 3 N 4 demonstrated lower absorption edge energy (Table 1) and simultaneously suitable position of conduction and valence bands in comparison with pure TiO 2 .The decrease of the absorption edge energy is leading to increased effectivity of electron hole pair generation due to the absorption of lower energy photons. For (iii), crystallinity size of rutile can also influence the photocatalytic activity due to formation of defects.Formation of lattice defects is enhancing electron-hole recombination resulting in lower photocatalytic activity 58 .The (0.3/1)TiO 2 /g-C 3 N 4 proved to have the smallest crystallite size of rutile from all the composites and this fact probably also contributed to the higher photoactivity of this photocatalyst. For (iv), the efficient separation of the charge carriers plays probably key role in photocatalytic activity of TiO 2 /g-C 3 N 4 nanocomposites.The electronic structure of the photocatalyst determines whether the material is going to be active towards specific reaction or not.The conduction band potentials of g-C 3 N 4 and TiO 2 are -1.15V and -0.3 V, respectively.The valence bands of g-C 3 N 4 and TiO 2 have potentials at 1.5 V and 3.0 V, respectively.The quite big difference between electronic bands potentials of g-C 3 N 4 and TiO 2 makes the combination of these two materials very interesting.The electrons that are photogenerated from the semiconductor with a higher CB edge (the g-C 3 N 4 ) migrate to the one with a lower CB edge (TiO 2 ).Furthermore, the photogenerated holes are transported from the low VB of TiO 2 to the high VB of g-C 3 N 4 between the semiconductors 59 .This leads to the accumulation of electrons on TiO 2 semiconductor for a reduction reaction and accumulation of holes in g-C 3 N 4 semiconductor for an oxidation reaction (Figure 13).Therefore, the electrons and holes are spatially separated to effectively repress charge recombination 59 ."}, {"llm generation": "UV", "source": "The concentration of N 2 O was measured before switching on the UV lamp to determine initial concentration and during the reaction.", "context": "A series of TiO 2 /g-C 3 N 4 photocatalysts with different ratio of TiO 2 to g-C 3 N 4 (from 0. Figure 1: The schematic description of the CO 2 photocatalytic reduction apparatus. /He mixture (968 ppm) and irradiated by an 8 W Hg lamp ( 254 nm; intensity 0.5 mW/cm 2 ).Pressure was continuously monitored inside the photoreactor during the experiments.A gas chromatograph equipped by ShinCarbon ST micropacked column and GC/BID was used for the analysis of N 2 O decrease.The concentration of N 2 O was measured before switching on the UV lamp to determine initial concentration and during the reaction.The reproducibility of the photocatalytic experiments was verified by repeated tests in the interval of 0-18 h.The accuracy of the measurement was certified by a series of repeated measurements, Figure 2: a) UV-Vis DRS spectra of TiO 2 /g-C 3 N 4 photocatalysts and b) the determination of the Figure 3: Raman spectra of a) commercial TiO 2 Evonik P25 and b) g-C 3 N 4 . Figure 4: a) Raman spectra of all prepared photocatalysts; b) evolution of the Raman spectra focused on TiO 2 characteristic peak at 143 cm -1 . C 3 N 4 characteristic bands are also present in the mixtures of TiO 2 /g-C 3 N 4 with decreasing intensity as the ratio of TiO 2 /g-C 3 N 4 increase.The following bands are typical for TiO 2 based Figure 5: FT-IR spectra of TiO 2 /g-C 3 N 4 photocatalysts. Figure 6: Photoluminescence spectra of TiO 2 /g-C 3 N 4 photocatalysts. Figure 7: XRD patterns of TiO 2 /g-C 3 N 4 photocatalysts. photoelectron peaks at 458.2-458.3eV and 464.0-464.1 eV, with a peak separation of 5.7-5.8eV, Figure 8: XPS N 1s, O 1s, C 1s and Ti 2p spectra measured for TiO 2 , (0.3/1)TiO 2 /g-C 3 N 4 and g- TiO 2 /g-C 3 N 4 (Figure 9c,d), the TiO 2 particles are embedded in the g-C 3 N 4 lamellar structure.This finding suggests the creation of a heterojunction between TiO 2 and g-C 3 N 4 , which could lead to improved separation of electron and hole. Figure 9: TEM images of g-C 3 N 4 (a), TiO 2 (b), and (0.3/1)TiO 2 /g-C 3 N 4 (c, d). Figure 10: a) Photocurrent generation at electrodes made from the studied photocatalysts and b) photocatalysts including pure TiO 2 Evonik P25 and g-C 3 N 4 .Figure11demonstrates the Figure 11: Time dependence of the a) methane yields, b) carbon monoxide yields and c) was investigated for all TiO 2 /g-C 3 N 4 photocatalysts including pure TiO 2 and g-C 3 N 4 for a time period of 0-16 h.The time dependences of N 2 O conversion for photocatalysis and photolysis are shown in Figure12.A gradual increase of N 2 O conversion with increasing time of irradiation can be noticed.The highest N 2 O conversion of 57 was observed for the (0.3/1)TiO 2 /g-C 3 N 4 catalyst after 16 h.On the other hand, both pure TiO 2 and g-C 3 N 4 photocatalysts exhibited the same N 2 O conversions as during the photolysis experiments.The products of the reaction are oxygen and nitrogen; no other compounds were detected. Figure 12: Time dependence of the N 2 O conversion over TiO 2 /g-C 3 N 4 photocatalysts.Conditions: 8 W Hg lamp, N 2 O (968 ppm)/He mixture, photocatalyst loading of 0.1 g. TiO 2 /g-C 3 N 4 has shown the highest specific surface area (S BET 53 m 2 /g) in comparison with pure g-C 3 N 4 (S BET 11 m 2 /g) and also the highest photoactivity.On the other hand, the decrease of specific surface area with increase of TiO 2 content can be explained by agglomerating of TiO 2 (Figure9c, d). Figure 13: Schematic illustration showing the photogenerated charge separation in TiO 2 /g-C 3 N 4 photocatalysts had enhanced photocatalytic performance compared to their components Specific surface area, absorption edge energy and crystallite size of prepared photocatalysts. ACS Paragon Plus EnvironmentThe Journal of Physical Chemistry This work was supported by the Grant Agency of the Czech Republic (projects.reg.No. 14-35327J and 16-10527S), by the Ministry of Education, Youth and Sports of the Czech Republic within \"National Feasibility Program I\", project LO1404 \"TUCENET\" and by EU structural funding Operational Programme Research and Development for Innovation Project No. CZ.1.05/2.1.00/19.0388."}], "lamp": [{"llm generation": "Xenon", "source": "The spectrometer was equipped with a 450 W Xenon lamp (Xe900).", "context": "The g-C 3 N 4 was synthesized by simple heating of melamine in the muffle furnace.10 g of melamine powder as precursor were heated to 550 C at a heating rate of 10 C/min in a covered crucible.The temperature was kept at 550 C for 2 h and then cooled down to room temperature. A yellow product of g-C 3 N 4 was obtained and was ground to a fine powder. As a precursor of TiO 2 commercial P25 (Evonik) was used.The TiO 2 /g-C 3 N 4 composites were prepared by mechanical mixture and calcined in a muffle furnace at 450 C for 2 h with temperature increasing at the rate of 10 C/min.The samples were labelled according to weight ratio of TiO 2 /g-C 3 N 4 as follows: (0.3/1), (0.5/1), (1/1) and (2/1) TiO 2 /g-C 3 N 4 . X-ray powder diffraction patterns (XRD) were measured using a Bruker D8 (Bruker AXS) diffractometer equipped by a detector sensitive for the placement (VANTEC 1).The CoK lamp was used as a source of irradiation of wavelength 0.178897 nm.Measurements were done in the conventional Bragg-Brentano setup. Nitrogen physisorption at 77 K was performed on a 3Flex automated volumetric apparatus (Micromeritics Instruments, USA) after degassing of materials at 150 C for more than 24 h under vacuum below 1 Torr.Degassing at low temperature was applied to remove physisorbed water, but having no influence on the porous morphology of the developed materials.The specific surface area was calculated according to the classical Brunauer-Emmett-Teller (BET) theory for the p/p0 range of 0.05-0.30 34.As the specific surface area, S BET , is not a proper parameter in the case of mesoporous solids containing micropores 35 , the mesopore surface area, S meso , and the micropore volume, V micro , were also evaluated based on the t-plot method 36 with the C modif constant 35,37 .The net pore volume, V net , was determined from the nitrogen adsorption isotherm at maximum p/p0 (0.99).The pore-size distribution was evaluated from the adsorption branch of the nitrogen adsorption desorption isotherm by the Barrett-Joyner-Halenda (BJH) method 38 using the de Boer standard isotherm and assuming cylindrical pore geometry. IR spectra of samples were measured by potassium bromide pellets technique.Exactly 1.0 mg of sample was ground with 200 mg dried potassium bromide.This mixture was used to prepare the potassium bromide pellets.The pellets were pressed by 8 tons for 30 seconds under vacuum. The IR spectra were collected using FT-IR spectrometer Nexus 470 (ThermoScientific, USA) with DTGS detector.The measurement parameters were the following: the spectral region of 4000-400 cm -1 , spectral resolution 4 cm -1 ; 64 scans; the Happ-Genzel apodization.Treatment of spectra: polynomial (second order) baseline, subtraction spectrum of pure potassium bromide. A 180 sampling was used as measurement technique of Raman spectroscopy.The Raman spectra were measured at dispersive Raman spectrometer DXR SmartRaman (ThermoScientific, USA) with CCD detector.The measurement parameters were as follows: excitation laser 780 nm, grating 400 lines/mm, aperture 50 m, exposure time 1 second, number of exposures 1000, the spectral region of 1800-50 cm -1 .An empty sample compartment was used for background measurement.Treatment of spectra: fluorescence correction (6 th order). The UV-visible spectra of prepared nanocomposites were recorded using a UV-2600 spectrophotometer with an ISR-2600 integrating sphere attachment (Shimadzu Scientific Co., Japan) from 220 to 1400 nm.Sampling interval was 1 nm and width of slit was 2 nm.Barium sulphate (BaSO 4 ) was used as reference material. Photoluminescence (PL) spectra were measured by a spectrometer FLS920 (Edinburgh Instrument Ltd, UK).The spectrometer was equipped with a 450 W Xenon lamp (Xe900).The excitation wavelength was 325 nm.The width of excitation and emission slits was 0.5 nm. Gas chromatography with isotope ratio mass spectrometry (GC/IRMS) DELTA Advantage (Thermo Scientific, USA) was used for the detection of 13 C in gas samples before and after photocatalytic reaction. X-ray photoelectron spectra (XPS) were recorded using a hemispherical VG SCIENTA R3000 analyzer with constant pass energy of 100 eV, a monochromatized aluminum source Al K (E 1486.6eV) and a low energy electron flood gun (FS40A-PS) to compensate the charge on the surface of nonconductive samples.The base pressure in the analytical chamber was 510 -9 mbar. The binding energies were referenced to C 1s core level (E b 284.6 eV).The composition and chemical surrounding of the sample surface were investigated on the basis of the areas and binding energies of Ti 2p, O 1s, N 1s and C 1s photoelectron peaks.The fitting of high resolution spectra was provided through the Casa XPS software. The morphology of particles was observed on a transmission electron microscope (TEM) JEOL 2010 HC (JEOL Ltd., Japan).The particles were dispersed in ethanol and using an ultrasonic sprayer deposited on a TEM grid with carbon holey support film. Photoelectrochemical measurements were performed using a photoelectric spectrometer equipped with the 150 W Xe lamp and coupled with the P-IF 1.6 potentiostat (Instytut Fotonowy, Poland).The photocurrent responses were recorded using a classical three electrode setup.The platinum wire and Ag/AgCl were used as the auxiliary and reference electrodes, respectively.The working electrode consisted of photocatalyst powder deposited onto indium-tin oxide (ITO) foil coated by polyethylene terephthalate.The 0.1 M KNO 3 was used as an electrolyte solution.The photocurrent spectra were recorded within the range of 240 -500 nm with the step of 10 nm in the potential range of -0.2 to 0.8 V, step 0.1 V. Before the measurement itself the electrolyte was purged by argon to ensure oxygen free environment.The argon purge was also kept constant during the measurement. The photocatalytic reduction of carbon dioxide was carried out in a homemade apparatus ( Figure 1).A cylindrical stirred batch reactor with a photocatalyst spread on the bottom of the reactor was illuminated by an 8 W Hg lamp ( 254 nm; intensity 0.5 mW/cm 2 ) placed in horizontal position on top of the quartz glass visor.The reactor shell was made from stainless steel.The internal volume was 355 cm 3 .The photocatalyst powder loading was 0.1 g.Before the irradiation was turned ON, a supercritical fluid-grade CO 2 with a certified maximum of hydrocarbons less than 1 ppm (SIAD Technical Gases, CZ) to avoid any hydrocarbon contamination was purged through distilled water reservoir to saturate it by humidity (50 rel.). Afterwards the water saturated CO 2 was purged through the reactor in order to displace the air from the reactor.The CO 2 pressure was maintained at 120 kPa through the purging for 20 minutes.The pressure inside the reactor was continuously monitored.The reactor was pressurized to 140 kPa and sealed.The sample at 0 hour was taken and immediately analyzed on barrier discharge ionization detector (GC/BID).The photocatalytic reaction was started by switching on the Hg lamp.Gas samples were discontinuously taken at various times during the irradiation (8 hours).Gas sampling was performed using a gas-tight syringe (10 ml) through a septum.GC/BID equipped by ShinCarbon ST micropacked column was used for the analysis of reaction products in the gas phase.The accuracy of the experiment was verified by a series of repeated measurements, and the relative error of product yields (mol/g cat ) was determined to be less than 10 .Blank tests were carried out to guarantee that the methane production was due to the photocatalytic reduction of CO 2 and to eliminate the surrounding interference.During the first test, the reactor was UV-illuminated without the photocatalyst, the second blank test was conducted in the dark with the photocatalyst under the same experimental conditions, and the third test consisted of irradiating the photocatalyst in the absence of CO 2 .No hydrocarbons were detected in the above blank tests. To double check the products are really coming from the photocatalytic reduction of CO 2 the measurement with CO 2 containing 13 C isotope was conducted.Samples were taken at various times and the increase of 13 C amount in methane was observed with increasing irradiation time. These measurements confirmed that the methane is a product of the CO 2 photocatalytic reduction. The photocatalytic reduction of N 2 O was carried out in a homemade apparatus at ambient temperature with and without the photocatalyst (photocatalysis and photolysis, respectively) 12 . The 0.1 g of photocatalyst was placed on an adhesive tape inserted on the bottom of the batch reactor (635 ml volume).In both photochemical and photocatalytic experiments, the reactor was and the relative error of the N 2 O concentration was determined to be less than 5 ."}, {"llm generation": "Mercury", "source": "A cylindrical stirred batch reactor with a photocatalyst spread on the bottom of the reactor was illuminated by an 8 W Hg lamp ( 254 nm; intensity 0.5 mW/cm 2 ) placed in horizontal position on top of the quartz glass visor.", "context": "The g-C 3 N 4 was synthesized by simple heating of melamine in the muffle furnace.10 g of melamine powder as precursor were heated to 550 C at a heating rate of 10 C/min in a covered crucible.The temperature was kept at 550 C for 2 h and then cooled down to room temperature. A yellow product of g-C 3 N 4 was obtained and was ground to a fine powder. As a precursor of TiO 2 commercial P25 (Evonik) was used.The TiO 2 /g-C 3 N 4 composites were prepared by mechanical mixture and calcined in a muffle furnace at 450 C for 2 h with temperature increasing at the rate of 10 C/min.The samples were labelled according to weight ratio of TiO 2 /g-C 3 N 4 as follows: (0.3/1), (0.5/1), (1/1) and (2/1) TiO 2 /g-C 3 N 4 . X-ray powder diffraction patterns (XRD) were measured using a Bruker D8 (Bruker AXS) diffractometer equipped by a detector sensitive for the placement (VANTEC 1).The CoK lamp was used as a source of irradiation of wavelength 0.178897 nm.Measurements were done in the conventional Bragg-Brentano setup. Nitrogen physisorption at 77 K was performed on a 3Flex automated volumetric apparatus (Micromeritics Instruments, USA) after degassing of materials at 150 C for more than 24 h under vacuum below 1 Torr.Degassing at low temperature was applied to remove physisorbed water, but having no influence on the porous morphology of the developed materials.The specific surface area was calculated according to the classical Brunauer-Emmett-Teller (BET) theory for the p/p0 range of 0.05-0.30 34.As the specific surface area, S BET , is not a proper parameter in the case of mesoporous solids containing micropores 35 , the mesopore surface area, S meso , and the micropore volume, V micro , were also evaluated based on the t-plot method 36 with the C modif constant 35,37 .The net pore volume, V net , was determined from the nitrogen adsorption isotherm at maximum p/p0 (0.99).The pore-size distribution was evaluated from the adsorption branch of the nitrogen adsorption desorption isotherm by the Barrett-Joyner-Halenda (BJH) method 38 using the de Boer standard isotherm and assuming cylindrical pore geometry. IR spectra of samples were measured by potassium bromide pellets technique.Exactly 1.0 mg of sample was ground with 200 mg dried potassium bromide.This mixture was used to prepare the potassium bromide pellets.The pellets were pressed by 8 tons for 30 seconds under vacuum. The IR spectra were collected using FT-IR spectrometer Nexus 470 (ThermoScientific, USA) with DTGS detector.The measurement parameters were the following: the spectral region of 4000-400 cm -1 , spectral resolution 4 cm -1 ; 64 scans; the Happ-Genzel apodization.Treatment of spectra: polynomial (second order) baseline, subtraction spectrum of pure potassium bromide. A 180 sampling was used as measurement technique of Raman spectroscopy.The Raman spectra were measured at dispersive Raman spectrometer DXR SmartRaman (ThermoScientific, USA) with CCD detector.The measurement parameters were as follows: excitation laser 780 nm, grating 400 lines/mm, aperture 50 m, exposure time 1 second, number of exposures 1000, the spectral region of 1800-50 cm -1 .An empty sample compartment was used for background measurement.Treatment of spectra: fluorescence correction (6 th order). The UV-visible spectra of prepared nanocomposites were recorded using a UV-2600 spectrophotometer with an ISR-2600 integrating sphere attachment (Shimadzu Scientific Co., Japan) from 220 to 1400 nm.Sampling interval was 1 nm and width of slit was 2 nm.Barium sulphate (BaSO 4 ) was used as reference material. Photoluminescence (PL) spectra were measured by a spectrometer FLS920 (Edinburgh Instrument Ltd, UK).The spectrometer was equipped with a 450 W Xenon lamp (Xe900).The excitation wavelength was 325 nm.The width of excitation and emission slits was 0.5 nm. Gas chromatography with isotope ratio mass spectrometry (GC/IRMS) DELTA Advantage (Thermo Scientific, USA) was used for the detection of 13 C in gas samples before and after photocatalytic reaction. X-ray photoelectron spectra (XPS) were recorded using a hemispherical VG SCIENTA R3000 analyzer with constant pass energy of 100 eV, a monochromatized aluminum source Al K (E 1486.6eV) and a low energy electron flood gun (FS40A-PS) to compensate the charge on the surface of nonconductive samples.The base pressure in the analytical chamber was 510 -9 mbar. The binding energies were referenced to C 1s core level (E b 284.6 eV).The composition and chemical surrounding of the sample surface were investigated on the basis of the areas and binding energies of Ti 2p, O 1s, N 1s and C 1s photoelectron peaks.The fitting of high resolution spectra was provided through the Casa XPS software. The morphology of particles was observed on a transmission electron microscope (TEM) JEOL 2010 HC (JEOL Ltd., Japan).The particles were dispersed in ethanol and using an ultrasonic sprayer deposited on a TEM grid with carbon holey support film. Photoelectrochemical measurements were performed using a photoelectric spectrometer equipped with the 150 W Xe lamp and coupled with the P-IF 1.6 potentiostat (Instytut Fotonowy, Poland).The photocurrent responses were recorded using a classical three electrode setup.The platinum wire and Ag/AgCl were used as the auxiliary and reference electrodes, respectively.The working electrode consisted of photocatalyst powder deposited onto indium-tin oxide (ITO) foil coated by polyethylene terephthalate.The 0.1 M KNO 3 was used as an electrolyte solution.The photocurrent spectra were recorded within the range of 240 -500 nm with the step of 10 nm in the potential range of -0.2 to 0.8 V, step 0.1 V. Before the measurement itself the electrolyte was purged by argon to ensure oxygen free environment.The argon purge was also kept constant during the measurement. The photocatalytic reduction of carbon dioxide was carried out in a homemade apparatus ( Figure 1).A cylindrical stirred batch reactor with a photocatalyst spread on the bottom of the reactor was illuminated by an 8 W Hg lamp ( 254 nm; intensity 0.5 mW/cm 2 ) placed in horizontal position on top of the quartz glass visor.The reactor shell was made from stainless steel.The internal volume was 355 cm 3 .The photocatalyst powder loading was 0.1 g.Before the irradiation was turned ON, a supercritical fluid-grade CO 2 with a certified maximum of hydrocarbons less than 1 ppm (SIAD Technical Gases, CZ) to avoid any hydrocarbon contamination was purged through distilled water reservoir to saturate it by humidity (50 rel.). Afterwards the water saturated CO 2 was purged through the reactor in order to displace the air from the reactor.The CO 2 pressure was maintained at 120 kPa through the purging for 20 minutes.The pressure inside the reactor was continuously monitored.The reactor was pressurized to 140 kPa and sealed.The sample at 0 hour was taken and immediately analyzed on barrier discharge ionization detector (GC/BID).The photocatalytic reaction was started by switching on the Hg lamp.Gas samples were discontinuously taken at various times during the irradiation (8 hours).Gas sampling was performed using a gas-tight syringe (10 ml) through a septum.GC/BID equipped by ShinCarbon ST micropacked column was used for the analysis of reaction products in the gas phase.The accuracy of the experiment was verified by a series of repeated measurements, and the relative error of product yields (mol/g cat ) was determined to be less than 10 .Blank tests were carried out to guarantee that the methane production was due to the photocatalytic reduction of CO 2 and to eliminate the surrounding interference.During the first test, the reactor was UV-illuminated without the photocatalyst, the second blank test was conducted in the dark with the photocatalyst under the same experimental conditions, and the third test consisted of irradiating the photocatalyst in the absence of CO 2 .No hydrocarbons were detected in the above blank tests. To double check the products are really coming from the photocatalytic reduction of CO 2 the measurement with CO 2 containing 13 C isotope was conducted.Samples were taken at various times and the increase of 13 C amount in methane was observed with increasing irradiation time. These measurements confirmed that the methane is a product of the CO 2 photocatalytic reduction. The photocatalytic reduction of N 2 O was carried out in a homemade apparatus at ambient temperature with and without the photocatalyst (photocatalysis and photolysis, respectively) 12 . The 0.1 g of photocatalyst was placed on an adhesive tape inserted on the bottom of the batch reactor (635 ml volume).In both photochemical and photocatalytic experiments, the reactor was and the relative error of the N 2 O concentration was determined to be less than 5 ."}, {"llm generation": "Mercury", "source": "Conditions: 8 W Hg lamp, CO 2 pressure at carbonation of 120 kPa, humidity 50, photocatalyst loading of 0.1 g.", "context": "Results from nitrogen physisorption, UV-Vis DRS and XRD are summarized in Tab. 1.The specific surface area of mixed photocatalysts increased significantly compared to pure g-C 3 N 4 . Due to very organized arrangement of g-C 3 N 4 crystal lattice its specific surface area is very low. Usually the value is somewhere around 10 m 2 /g 21,39 .Excluding pure g-C 3 N 4 all the prepared photocatalysts and TiO 2 Evonik P25 had very similar specific surface area with a value close to 50 m 2 /g. Absorption edge energy is one of the key aspects of the photocatalysis (Tab.1).Graphitic C 3 N 4 has relatively low band gap energy which is one of the reasons why this material attracted great attention of the photocatalytic society.The band gap energy of commercial TiO 2 Evonik P25 is quite high, 3.26 eV in our case and the addition of g-C 3 N 4 decreased the absorption edge energy only slightly (Table 1).The absorption edge energies of photocatalysts were determined from UV-Vis DRS spectra (Figure 2b).Based on the UV-vis DRS spectra the blue shift can be observed after addition of TiO 2 to pure g-C 3 N 4 (Figure 2a).The absorption edges of all TiO 2 /g- The commercial TiO 2 is composed from anatase and rutile phase which was confirmed by Raman spectroscopy (Figure 3a).The Ti-O vibrational modes of anatase are located around 395, 515 and 640 cm -1 .The Ti-Ti vibrational modes of anatase are located at 140 and 195 cm -1 40, 41 . Rutile's Ti-O vibrational modes are located around 445, 610, 825 cm -1 and Ti-Ti vibrational mode of rutile is located around 140 cm -1 41 .Since the rutile phase is representing the minority, the only recognizable peaks were at 445 and 791 cm -1 .The other ones are being overlapped by the anatase vibrational modes.The interpretation of pure g-C 3 N 4 Raman spectra is a little bit more complicated (Figure 3b). Figure 4a shows the Raman spectra of all investigated photocatalysts.The decrease of TiO 2 characteristic peaks intensity and increase of g-C 3 N 4 peaks intensity can be observed with decreasing ratio of TiO 2 /g-C 3 N 4 .Also no peak shifts were observed which means no structural changes occurred during preparation of mixed photocatalysts regarding to pure TiO 2 and g-C 3 N 4 . For better resolution the most intense anatase peak part is shown in Figure 4b. The FT-IR spectra of prepared g-C 3 N 4 , TiO 2 Evonik P25 and TiO 2 /g-C 3 N 4 photocatalysts are shown in Figure 5.In the FT-IR spectra of g-C 3 N 4 the strong band region from 1200 to 1650 cm - 1 can be found.The peak at 1640 cm -1 is attributed to C-N stretching, while three bands at 1555, 1461 and 1405 cm -1 are the result of the typical stretching vibrations of C-N heterocycles 44,45 . The last two bands at 1319 and 1243 cm -1 of the region belong to stretching vibration of connected units of C-NH-C, which is also supported by the broad band at 2900 -3500 cm -1 .This broad band is attributed to N-H and O-H stretches due to the free amino groups and adsorbed hydroxyl species, respectively 45 .The peak at 806 cm -1 is attributed to the characteristic breathing mode of s-triazine 44,45 , which increases with the increase of the g-C 3 N 4 content.All materials.The broad band in the region of 3200 -3600 cm -1 can be assigned to OH stretching modes.The two very small hard recognizable bands at 1600 and 1400 cm -1 are attributed to bending OH modes of hydroxyl groups.The broad band below at 900 cm -1 belongs to Ti-O vibrations 46 .Wavelength (nm) g-C3N4 (0.3/1)TiO2/g-C3N4 (0.5/1)TiO2/g-C3N4 (1/1)TiO2/g-C3N4 (2/1)TiO2/g-C3N4 TiO2 Two main diffraction peaks for g-C 3 N 4 located at around 14.89 and 31.95,were observed and indexed as (100) and (002) planes, respectively (Figure 7).These two diffraction peaks are in good agreement with the g-C 3 N 4 (JCPDS no.87-1526) 50 .Titanium dioxide was identified in composite samples in anatase (JCPDS no.084-1285) and rutile (JCPDS no.079-6029) forms. The crystallite size of the TiO 2 was determined from the half-width of peaks using Scherrer's formula (where K0.89) on the anatase (101) and rutile (110) peaks.The intensity of g-C 3 N 4 peaks in TiO 2 composites was attenuated in a simile way as reported 52 .The presence of g-C 3 N 4 did not have a significant influence on the phase structure of TiO 2 . In Figure 8 which correspond to Ti 4 2 p3/2 and Ti 4 2 p1/2 , respectively 55 .The detectable changes in the peak positions are observed in the high-resolution XPS O 1s spectra for pure TiO 2 and TiO 2 mixed with g-C 3 N 4 .Among two main O 1s components found in pure TiO 2 , attributed to lattice O 2- (529.5 eV) and the O 2-ions/hydroxyl groups (530.6 eV) 56 , the latter one is shifted to 530.9 eV in the case of (0.3/1)TiO 2 /g-C 3 N 4 , confirming the occurrence of interactions between TiO 2 and g-C 3 N 4 in the formed composites.The morphology of the photocatalysts was examined by TEM. Figure 9 shows the TEM images of g-C 3 N 4 , TiO 2 , and (0.3/1)TiO 2 /g-C 3 N 4 .It can be seen that pure g-C 3 N 4 (Figure 9a) indicates a 2D lamellar structure while pure TiO 2 (Figure 9b) shows spherical particles.For The photocurrent measurements were conducted to predict the photocatalytic activity of the prepared photocatalysts (Figure 10).It is evident all the prepared photocatalysts except pure g- The effect of irradiation time on the formation of gaseous products in the photocatalytic reduction of carbon dioxide was studied in the presence of all prepared TiO 2 /g-C 3 N 4 photocatalysts including pure TiO 2 Evonik P25 and g-C 3 N 4 .Figure 11 other hand, rapidly increase in first 2 hours and then are almost constant (Figure 11b).The last detected product was hydrogen which is coming from the photocatalytic water (vapor) splitting (Figure 11c).The highest yields of the three products were reached in the presence of (0.3/1)TiO 2 /g-C 3 N 4 .On the other hand, the lowest products production was achieved over pure g-C 3 N 4 .Time (h) (0.3/1)TiO2/g-C3N4 TiO2 (1/1)TiO2/g-C3N4 (0.5/1)TiO2/g-C3N4 (2/1)TiO2/g-C3N4 g-C3N4 Conditions: 8 W Hg lamp, CO 2 pressure at carbonation of 120 kPa, humidity 50, photocatalyst loading of 0.1 g. The effect of irradiation time on the photochemical and photocatalytic decomposition of The most active photocatalyst in both cases, the photocatalytic reduction of CO 2 and N 2 O, respectively, was the one composed of 0.3/1 ratio of TiO 2 /g-C 3 N 4 .The photocatalytic experiments showed the ratio of TiO 2 and g-C 3 N 4 plays significant role in photocatalysis.It also confirmed pure g-C 3 N 4 is not very active photocatalyst due to its high recombination rate of charge carriers and very low specific surface area 15 .The very high recombination of g-C 3 N 4 also confirms photoluminescence spectra where the g-C 3 N 4 band has the intensity several times higher than the rest of the photocatalysts (Figure 6). Even though both studied reactions are reductions the reaction mechanism is different for each of them.Photocatalytic reduction of carbon dioxide heavily depends on sufficient potentials of photocatalyst's conduction and valence bands.CO 2 molecule is very stable and direct reduction by electron (CO 2 /CO 2 ) is limited by very negative potential (-1.9 V vs. NHE) 6,57 .The main products of the photocatalytic reduction of CO 2 are methane and carbon monoxide and also byproduct hydrogen.Hydrogen is produced from water which is present in the form of vapor. The pure g-C 3 N 4 proved to be the least efficient towards any of the products.This is in agreement with g-C 3 N 4 valence band not having sufficient potential of generated holes for oxidation of water to hydroxyl radicals (5).Only the less effective water oxidation, due to more holes needed to achieve it, can be conducted.Because of this limitation, lower amounts of H are formed and through these lower yields of all products were detected.The pure TiO 2 on the other hand gives the average yields of CH 4 and CO and the higher yields of H 2 . In case of the nitrous oxide reduction the potential of N 2 O/N 2 redox couple is around 1.35 V which fits in between of valence and conduction bands of both, TiO 2 and g-C 3 N 4 as well. Nevertheless, pure TiO 2 and C 3 N 4 , respectively showed no photocatalytic activity, the results were the same as in case of photolysis.The addition of TiO 2 to C 3 N 4 improved the conversion about over 10 . The photocatalytic activity of semiconductor nanomaterials can be influenced by several aspects such as: (i) specific surface area, (ii) adsorption edge energy, (iii) crystallite size and (iv) efficient separation of the charge carriers.All these factors can be significantly influenced by the formation of TiO 2 /g-C 3 N 4 nanomaterials, which are formed by the addition of g-C 3 N 4 to the TiO 2 . For (i), specific surface area of TiO 2 /g-C 3 N 4 has increased with increasing amount of g-C 3 N 4 . The increase of the BET specific surface area of TiO 2 /g-C 3 N 4 could be explained due to TiO 2 nanoparticles embedded in the g-C 3 N 4 lamellar structure leads to the formation of thinner lamellar g-C 3 N 4 (Figure 9).The grinding may lead to the exfoliation of g-C 3 N 4 , which increases the surface areas of the photocatalysts.The similar results were obtained by 50 .The higher specific surface area can offer more available active sites and due to that higher photoactivity.For (ii), all the prepared TiO 2 /g-C 3 N 4 demonstrated lower absorption edge energy (Table 1) and simultaneously suitable position of conduction and valence bands in comparison with pure TiO 2 .The decrease of the absorption edge energy is leading to increased effectivity of electron hole pair generation due to the absorption of lower energy photons. For (iii), crystallinity size of rutile can also influence the photocatalytic activity due to formation of defects.Formation of lattice defects is enhancing electron-hole recombination resulting in lower photocatalytic activity 58 .The (0.3/1)TiO 2 /g-C 3 N 4 proved to have the smallest crystallite size of rutile from all the composites and this fact probably also contributed to the higher photoactivity of this photocatalyst. For (iv), the efficient separation of the charge carriers plays probably key role in photocatalytic activity of TiO 2 /g-C 3 N 4 nanocomposites.The electronic structure of the photocatalyst determines whether the material is going to be active towards specific reaction or not.The conduction band potentials of g-C 3 N 4 and TiO 2 are -1.15V and -0.3 V, respectively.The valence bands of g-C 3 N 4 and TiO 2 have potentials at 1.5 V and 3.0 V, respectively.The quite big difference between electronic bands potentials of g-C 3 N 4 and TiO 2 makes the combination of these two materials very interesting.The electrons that are photogenerated from the semiconductor with a higher CB edge (the g-C 3 N 4 ) migrate to the one with a lower CB edge (TiO 2 ).Furthermore, the photogenerated holes are transported from the low VB of TiO 2 to the high VB of g-C 3 N 4 between the semiconductors 59 .This leads to the accumulation of electrons on TiO 2 semiconductor for a reduction reaction and accumulation of holes in g-C 3 N 4 semiconductor for an oxidation reaction (Figure 13).Therefore, the electrons and holes are spatially separated to effectively repress charge recombination 59 ."}, {"llm generation": "Mercury", "source": "/He mixture (968 ppm) and irradiated by an 8 W Hg lamp ( 254 nm; intensity 0.5 mW/cm 2 ).", "context": "A series of TiO 2 /g-C 3 N 4 photocatalysts with different ratio of TiO 2 to g-C 3 N 4 (from 0. Figure 1: The schematic description of the CO 2 photocatalytic reduction apparatus. /He mixture (968 ppm) and irradiated by an 8 W Hg lamp ( 254 nm; intensity 0.5 mW/cm 2 ).Pressure was continuously monitored inside the photoreactor during the experiments.A gas chromatograph equipped by ShinCarbon ST micropacked column and GC/BID was used for the analysis of N 2 O decrease.The concentration of N 2 O was measured before switching on the UV lamp to determine initial concentration and during the reaction.The reproducibility of the photocatalytic experiments was verified by repeated tests in the interval of 0-18 h.The accuracy of the measurement was certified by a series of repeated measurements, Figure 2: a) UV-Vis DRS spectra of TiO 2 /g-C 3 N 4 photocatalysts and b) the determination of the Figure 3: Raman spectra of a) commercial TiO 2 Evonik P25 and b) g-C 3 N 4 . Figure 4: a) Raman spectra of all prepared photocatalysts; b) evolution of the Raman spectra focused on TiO 2 characteristic peak at 143 cm -1 . C 3 N 4 characteristic bands are also present in the mixtures of TiO 2 /g-C 3 N 4 with decreasing intensity as the ratio of TiO 2 /g-C 3 N 4 increase.The following bands are typical for TiO 2 based Figure 5: FT-IR spectra of TiO 2 /g-C 3 N 4 photocatalysts. Figure 6: Photoluminescence spectra of TiO 2 /g-C 3 N 4 photocatalysts. Figure 7: XRD patterns of TiO 2 /g-C 3 N 4 photocatalysts. photoelectron peaks at 458.2-458.3eV and 464.0-464.1 eV, with a peak separation of 5.7-5.8eV, Figure 8: XPS N 1s, O 1s, C 1s and Ti 2p spectra measured for TiO 2 , (0.3/1)TiO 2 /g-C 3 N 4 and g- TiO 2 /g-C 3 N 4 (Figure 9c,d), the TiO 2 particles are embedded in the g-C 3 N 4 lamellar structure.This finding suggests the creation of a heterojunction between TiO 2 and g-C 3 N 4 , which could lead to improved separation of electron and hole. Figure 9: TEM images of g-C 3 N 4 (a), TiO 2 (b), and (0.3/1)TiO 2 /g-C 3 N 4 (c, d). Figure 10: a) Photocurrent generation at electrodes made from the studied photocatalysts and b) photocatalysts including pure TiO 2 Evonik P25 and g-C 3 N 4 .Figure11demonstrates the Figure 11: Time dependence of the a) methane yields, b) carbon monoxide yields and c) was investigated for all TiO 2 /g-C 3 N 4 photocatalysts including pure TiO 2 and g-C 3 N 4 for a time period of 0-16 h.The time dependences of N 2 O conversion for photocatalysis and photolysis are shown in Figure12.A gradual increase of N 2 O conversion with increasing time of irradiation can be noticed.The highest N 2 O conversion of 57 was observed for the (0.3/1)TiO 2 /g-C 3 N 4 catalyst after 16 h.On the other hand, both pure TiO 2 and g-C 3 N 4 photocatalysts exhibited the same N 2 O conversions as during the photolysis experiments.The products of the reaction are oxygen and nitrogen; no other compounds were detected. Figure 12: Time dependence of the N 2 O conversion over TiO 2 /g-C 3 N 4 photocatalysts.Conditions: 8 W Hg lamp, N 2 O (968 ppm)/He mixture, photocatalyst loading of 0.1 g. TiO 2 /g-C 3 N 4 has shown the highest specific surface area (S BET 53 m 2 /g) in comparison with pure g-C 3 N 4 (S BET 11 m 2 /g) and also the highest photoactivity.On the other hand, the decrease of specific surface area with increase of TiO 2 content can be explained by agglomerating of TiO 2 (Figure9c, d). Figure 13: Schematic illustration showing the photogenerated charge separation in TiO 2 /g-C 3 N 4 photocatalysts had enhanced photocatalytic performance compared to their components Specific surface area, absorption edge energy and crystallite size of prepared photocatalysts. ACS Paragon Plus EnvironmentThe Journal of Physical Chemistry This work was supported by the Grant Agency of the Czech Republic (projects.reg.No. 14-35327J and 16-10527S), by the Ministry of Education, Youth and Sports of the Czech Republic within \"National Feasibility Program I\", project LO1404 \"TUCENET\" and by EU structural funding Operational Programme Research and Development for Innovation Project No. CZ.1.05/2.1.00/19.0388."}], "reaction medium": [{"llm generation": "Gas", "source": "Novel TiO<sub>2</sub>/C<sub>3</sub>N<sub>4</sub> Photocatalysts for Photocatalytic Reduction of CO<sub>2</sub> and for Photocatalytic Decomposition of N<sub>2</sub>O", "context": "Novel TiO<sub>2</sub>/C<sub>3</sub>N<sub>4</sub> Photocatalysts for Photocatalytic Reduction of CO<sub>2</sub> and for Photocatalytic Decomposition of N<sub>2</sub>O"}, {"llm generation": "Gas", "source": "The prepared mixtures along with pure TiO 2 and g-C 3 N 4 were tested for the photocatalytic reduction of carbon dioxide and photocatalytic decomposition of nitrous", "context": "TiO 2 /g-C 3 N 4 photocatalysts with the ratio of TiO 2 to g-C 3 N 4 ranging from 0.3/1 to 2/1 were prepared by simple mechanical mixing of pure g-C 3 N 4 and commercial TiO 2 Evonik P25.All the nanocomposites were characterized by X-ray powder diffraction, UV-vis diffuse reflectance spectroscopy, photoluminescence, X-ray photoelectron spectroscopy, Raman spectroscopy, infrared spectroscopy, transmission electron microscopy, photoelectrochemical measurements and nitrogen physisorption.The prepared mixtures along with pure TiO 2 and g-C 3 N 4 were tested for the photocatalytic reduction of carbon dioxide and photocatalytic decomposition of nitrous"}, {"llm generation": "Gas", "source": "GC/BID equipped by ShinCarbon ST micropacked column was used for the analysis of reaction products in the gas phase.", "context": "The g-C 3 N 4 was synthesized by simple heating of melamine in the muffle furnace.10 g of melamine powder as precursor were heated to 550 C at a heating rate of 10 C/min in a covered crucible.The temperature was kept at 550 C for 2 h and then cooled down to room temperature. A yellow product of g-C 3 N 4 was obtained and was ground to a fine powder. As a precursor of TiO 2 commercial P25 (Evonik) was used.The TiO 2 /g-C 3 N 4 composites were prepared by mechanical mixture and calcined in a muffle furnace at 450 C for 2 h with temperature increasing at the rate of 10 C/min.The samples were labelled according to weight ratio of TiO 2 /g-C 3 N 4 as follows: (0.3/1), (0.5/1), (1/1) and (2/1) TiO 2 /g-C 3 N 4 . X-ray powder diffraction patterns (XRD) were measured using a Bruker D8 (Bruker AXS) diffractometer equipped by a detector sensitive for the placement (VANTEC 1).The CoK lamp was used as a source of irradiation of wavelength 0.178897 nm.Measurements were done in the conventional Bragg-Brentano setup. Nitrogen physisorption at 77 K was performed on a 3Flex automated volumetric apparatus (Micromeritics Instruments, USA) after degassing of materials at 150 C for more than 24 h under vacuum below 1 Torr.Degassing at low temperature was applied to remove physisorbed water, but having no influence on the porous morphology of the developed materials.The specific surface area was calculated according to the classical Brunauer-Emmett-Teller (BET) theory for the p/p0 range of 0.05-0.30 34.As the specific surface area, S BET , is not a proper parameter in the case of mesoporous solids containing micropores 35 , the mesopore surface area, S meso , and the micropore volume, V micro , were also evaluated based on the t-plot method 36 with the C modif constant 35,37 .The net pore volume, V net , was determined from the nitrogen adsorption isotherm at maximum p/p0 (0.99).The pore-size distribution was evaluated from the adsorption branch of the nitrogen adsorption desorption isotherm by the Barrett-Joyner-Halenda (BJH) method 38 using the de Boer standard isotherm and assuming cylindrical pore geometry. IR spectra of samples were measured by potassium bromide pellets technique.Exactly 1.0 mg of sample was ground with 200 mg dried potassium bromide.This mixture was used to prepare the potassium bromide pellets.The pellets were pressed by 8 tons for 30 seconds under vacuum. The IR spectra were collected using FT-IR spectrometer Nexus 470 (ThermoScientific, USA) with DTGS detector.The measurement parameters were the following: the spectral region of 4000-400 cm -1 , spectral resolution 4 cm -1 ; 64 scans; the Happ-Genzel apodization.Treatment of spectra: polynomial (second order) baseline, subtraction spectrum of pure potassium bromide. A 180 sampling was used as measurement technique of Raman spectroscopy.The Raman spectra were measured at dispersive Raman spectrometer DXR SmartRaman (ThermoScientific, USA) with CCD detector.The measurement parameters were as follows: excitation laser 780 nm, grating 400 lines/mm, aperture 50 m, exposure time 1 second, number of exposures 1000, the spectral region of 1800-50 cm -1 .An empty sample compartment was used for background measurement.Treatment of spectra: fluorescence correction (6 th order). The UV-visible spectra of prepared nanocomposites were recorded using a UV-2600 spectrophotometer with an ISR-2600 integrating sphere attachment (Shimadzu Scientific Co., Japan) from 220 to 1400 nm.Sampling interval was 1 nm and width of slit was 2 nm.Barium sulphate (BaSO 4 ) was used as reference material. Photoluminescence (PL) spectra were measured by a spectrometer FLS920 (Edinburgh Instrument Ltd, UK).The spectrometer was equipped with a 450 W Xenon lamp (Xe900).The excitation wavelength was 325 nm.The width of excitation and emission slits was 0.5 nm. Gas chromatography with isotope ratio mass spectrometry (GC/IRMS) DELTA Advantage (Thermo Scientific, USA) was used for the detection of 13 C in gas samples before and after photocatalytic reaction. X-ray photoelectron spectra (XPS) were recorded using a hemispherical VG SCIENTA R3000 analyzer with constant pass energy of 100 eV, a monochromatized aluminum source Al K (E 1486.6eV) and a low energy electron flood gun (FS40A-PS) to compensate the charge on the surface of nonconductive samples.The base pressure in the analytical chamber was 510 -9 mbar. The binding energies were referenced to C 1s core level (E b 284.6 eV).The composition and chemical surrounding of the sample surface were investigated on the basis of the areas and binding energies of Ti 2p, O 1s, N 1s and C 1s photoelectron peaks.The fitting of high resolution spectra was provided through the Casa XPS software. The morphology of particles was observed on a transmission electron microscope (TEM) JEOL 2010 HC (JEOL Ltd., Japan).The particles were dispersed in ethanol and using an ultrasonic sprayer deposited on a TEM grid with carbon holey support film. Photoelectrochemical measurements were performed using a photoelectric spectrometer equipped with the 150 W Xe lamp and coupled with the P-IF 1.6 potentiostat (Instytut Fotonowy, Poland).The photocurrent responses were recorded using a classical three electrode setup.The platinum wire and Ag/AgCl were used as the auxiliary and reference electrodes, respectively.The working electrode consisted of photocatalyst powder deposited onto indium-tin oxide (ITO) foil coated by polyethylene terephthalate.The 0.1 M KNO 3 was used as an electrolyte solution.The photocurrent spectra were recorded within the range of 240 -500 nm with the step of 10 nm in the potential range of -0.2 to 0.8 V, step 0.1 V. Before the measurement itself the electrolyte was purged by argon to ensure oxygen free environment.The argon purge was also kept constant during the measurement. The photocatalytic reduction of carbon dioxide was carried out in a homemade apparatus ( Figure 1).A cylindrical stirred batch reactor with a photocatalyst spread on the bottom of the reactor was illuminated by an 8 W Hg lamp ( 254 nm; intensity 0.5 mW/cm 2 ) placed in horizontal position on top of the quartz glass visor.The reactor shell was made from stainless steel.The internal volume was 355 cm 3 .The photocatalyst powder loading was 0.1 g.Before the irradiation was turned ON, a supercritical fluid-grade CO 2 with a certified maximum of hydrocarbons less than 1 ppm (SIAD Technical Gases, CZ) to avoid any hydrocarbon contamination was purged through distilled water reservoir to saturate it by humidity (50 rel.). Afterwards the water saturated CO 2 was purged through the reactor in order to displace the air from the reactor.The CO 2 pressure was maintained at 120 kPa through the purging for 20 minutes.The pressure inside the reactor was continuously monitored.The reactor was pressurized to 140 kPa and sealed.The sample at 0 hour was taken and immediately analyzed on barrier discharge ionization detector (GC/BID).The photocatalytic reaction was started by switching on the Hg lamp.Gas samples were discontinuously taken at various times during the irradiation (8 hours).Gas sampling was performed using a gas-tight syringe (10 ml) through a septum.GC/BID equipped by ShinCarbon ST micropacked column was used for the analysis of reaction products in the gas phase.The accuracy of the experiment was verified by a series of repeated measurements, and the relative error of product yields (mol/g cat ) was determined to be less than 10 .Blank tests were carried out to guarantee that the methane production was due to the photocatalytic reduction of CO 2 and to eliminate the surrounding interference.During the first test, the reactor was UV-illuminated without the photocatalyst, the second blank test was conducted in the dark with the photocatalyst under the same experimental conditions, and the third test consisted of irradiating the photocatalyst in the absence of CO 2 .No hydrocarbons were detected in the above blank tests. To double check the products are really coming from the photocatalytic reduction of CO 2 the measurement with CO 2 containing 13 C isotope was conducted.Samples were taken at various times and the increase of 13 C amount in methane was observed with increasing irradiation time. These measurements confirmed that the methane is a product of the CO 2 photocatalytic reduction. The photocatalytic reduction of N 2 O was carried out in a homemade apparatus at ambient temperature with and without the photocatalyst (photocatalysis and photolysis, respectively) 12 . The 0.1 g of photocatalyst was placed on an adhesive tape inserted on the bottom of the batch reactor (635 ml volume).In both photochemical and photocatalytic experiments, the reactor was and the relative error of the N 2 O concentration was determined to be less than 5 ."}, {"llm generation": "Gas", "source": "/He mixture (968 ppm) and irradiated by an 8 W Hg lamp ( 254 nm; intensity 0.5 mW/cm 2 ).", "context": "A series of TiO 2 /g-C 3 N 4 photocatalysts with different ratio of TiO 2 to g-C 3 N 4 (from 0. Figure 1: The schematic description of the CO 2 photocatalytic reduction apparatus. /He mixture (968 ppm) and irradiated by an 8 W Hg lamp ( 254 nm; intensity 0.5 mW/cm 2 ).Pressure was continuously monitored inside the photoreactor during the experiments.A gas chromatograph equipped by ShinCarbon ST micropacked column and GC/BID was used for the analysis of N 2 O decrease.The concentration of N 2 O was measured before switching on the UV lamp to determine initial concentration and during the reaction.The reproducibility of the photocatalytic experiments was verified by repeated tests in the interval of 0-18 h.The accuracy of the measurement was certified by a series of repeated measurements, Figure 2: a) UV-Vis DRS spectra of TiO 2 /g-C 3 N 4 photocatalysts and b) the determination of the Figure 3: Raman spectra of a) commercial TiO 2 Evonik P25 and b) g-C 3 N 4 . Figure 4: a) Raman spectra of all prepared photocatalysts; b) evolution of the Raman spectra focused on TiO 2 characteristic peak at 143 cm -1 . C 3 N 4 characteristic bands are also present in the mixtures of TiO 2 /g-C 3 N 4 with decreasing intensity as the ratio of TiO 2 /g-C 3 N 4 increase.The following bands are typical for TiO 2 based Figure 5: FT-IR spectra of TiO 2 /g-C 3 N 4 photocatalysts. Figure 6: Photoluminescence spectra of TiO 2 /g-C 3 N 4 photocatalysts. Figure 7: XRD patterns of TiO 2 /g-C 3 N 4 photocatalysts. photoelectron peaks at 458.2-458.3eV and 464.0-464.1 eV, with a peak separation of 5.7-5.8eV, Figure 8: XPS N 1s, O 1s, C 1s and Ti 2p spectra measured for TiO 2 , (0.3/1)TiO 2 /g-C 3 N 4 and g- TiO 2 /g-C 3 N 4 (Figure 9c,d), the TiO 2 particles are embedded in the g-C 3 N 4 lamellar structure.This finding suggests the creation of a heterojunction between TiO 2 and g-C 3 N 4 , which could lead to improved separation of electron and hole. Figure 9: TEM images of g-C 3 N 4 (a), TiO 2 (b), and (0.3/1)TiO 2 /g-C 3 N 4 (c, d). Figure 10: a) Photocurrent generation at electrodes made from the studied photocatalysts and b) photocatalysts including pure TiO 2 Evonik P25 and g-C 3 N 4 .Figure11demonstrates the Figure 11: Time dependence of the a) methane yields, b) carbon monoxide yields and c) was investigated for all TiO 2 /g-C 3 N 4 photocatalysts including pure TiO 2 and g-C 3 N 4 for a time period of 0-16 h.The time dependences of N 2 O conversion for photocatalysis and photolysis are shown in Figure12.A gradual increase of N 2 O conversion with increasing time of irradiation can be noticed.The highest N 2 O conversion of 57 was observed for the (0.3/1)TiO 2 /g-C 3 N 4 catalyst after 16 h.On the other hand, both pure TiO 2 and g-C 3 N 4 photocatalysts exhibited the same N 2 O conversions as during the photolysis experiments.The products of the reaction are oxygen and nitrogen; no other compounds were detected. Figure 12: Time dependence of the N 2 O conversion over TiO 2 /g-C 3 N 4 photocatalysts.Conditions: 8 W Hg lamp, N 2 O (968 ppm)/He mixture, photocatalyst loading of 0.1 g. TiO 2 /g-C 3 N 4 has shown the highest specific surface area (S BET 53 m 2 /g) in comparison with pure g-C 3 N 4 (S BET 11 m 2 /g) and also the highest photoactivity.On the other hand, the decrease of specific surface area with increase of TiO 2 content can be explained by agglomerating of TiO 2 (Figure9c, d). Figure 13: Schematic illustration showing the photogenerated charge separation in TiO 2 /g-C 3 N 4 photocatalysts had enhanced photocatalytic performance compared to their components Specific surface area, absorption edge energy and crystallite size of prepared photocatalysts. ACS Paragon Plus EnvironmentThe Journal of Physical Chemistry This work was supported by the Grant Agency of the Czech Republic (projects.reg.No. 14-35327J and 16-10527S), by the Ministry of Education, Youth and Sports of the Czech Republic within \"National Feasibility Program I\", project LO1404 \"TUCENET\" and by EU structural funding Operational Programme Research and Development for Innovation Project No. CZ.1.05/2.1.00/19.0388."}], "reactor type": [{"llm generation": "Fixed-bed", "source": "A cylindrical stirred batch reactor with a photocatalyst spread on the bottom of the reactor was illuminated by an 8 W Hg lamp ( 254 nm; intensity 0.5 mW/cm 2 ) placed in horizontal position on top of the quartz glass visor.", "context": "The g-C 3 N 4 was synthesized by simple heating of melamine in the muffle furnace.10 g of melamine powder as precursor were heated to 550 C at a heating rate of 10 C/min in a covered crucible.The temperature was kept at 550 C for 2 h and then cooled down to room temperature. A yellow product of g-C 3 N 4 was obtained and was ground to a fine powder. As a precursor of TiO 2 commercial P25 (Evonik) was used.The TiO 2 /g-C 3 N 4 composites were prepared by mechanical mixture and calcined in a muffle furnace at 450 C for 2 h with temperature increasing at the rate of 10 C/min.The samples were labelled according to weight ratio of TiO 2 /g-C 3 N 4 as follows: (0.3/1), (0.5/1), (1/1) and (2/1) TiO 2 /g-C 3 N 4 . X-ray powder diffraction patterns (XRD) were measured using a Bruker D8 (Bruker AXS) diffractometer equipped by a detector sensitive for the placement (VANTEC 1).The CoK lamp was used as a source of irradiation of wavelength 0.178897 nm.Measurements were done in the conventional Bragg-Brentano setup. Nitrogen physisorption at 77 K was performed on a 3Flex automated volumetric apparatus (Micromeritics Instruments, USA) after degassing of materials at 150 C for more than 24 h under vacuum below 1 Torr.Degassing at low temperature was applied to remove physisorbed water, but having no influence on the porous morphology of the developed materials.The specific surface area was calculated according to the classical Brunauer-Emmett-Teller (BET) theory for the p/p0 range of 0.05-0.30 34.As the specific surface area, S BET , is not a proper parameter in the case of mesoporous solids containing micropores 35 , the mesopore surface area, S meso , and the micropore volume, V micro , were also evaluated based on the t-plot method 36 with the C modif constant 35,37 .The net pore volume, V net , was determined from the nitrogen adsorption isotherm at maximum p/p0 (0.99).The pore-size distribution was evaluated from the adsorption branch of the nitrogen adsorption desorption isotherm by the Barrett-Joyner-Halenda (BJH) method 38 using the de Boer standard isotherm and assuming cylindrical pore geometry. IR spectra of samples were measured by potassium bromide pellets technique.Exactly 1.0 mg of sample was ground with 200 mg dried potassium bromide.This mixture was used to prepare the potassium bromide pellets.The pellets were pressed by 8 tons for 30 seconds under vacuum. The IR spectra were collected using FT-IR spectrometer Nexus 470 (ThermoScientific, USA) with DTGS detector.The measurement parameters were the following: the spectral region of 4000-400 cm -1 , spectral resolution 4 cm -1 ; 64 scans; the Happ-Genzel apodization.Treatment of spectra: polynomial (second order) baseline, subtraction spectrum of pure potassium bromide. A 180 sampling was used as measurement technique of Raman spectroscopy.The Raman spectra were measured at dispersive Raman spectrometer DXR SmartRaman (ThermoScientific, USA) with CCD detector.The measurement parameters were as follows: excitation laser 780 nm, grating 400 lines/mm, aperture 50 m, exposure time 1 second, number of exposures 1000, the spectral region of 1800-50 cm -1 .An empty sample compartment was used for background measurement.Treatment of spectra: fluorescence correction (6 th order). The UV-visible spectra of prepared nanocomposites were recorded using a UV-2600 spectrophotometer with an ISR-2600 integrating sphere attachment (Shimadzu Scientific Co., Japan) from 220 to 1400 nm.Sampling interval was 1 nm and width of slit was 2 nm.Barium sulphate (BaSO 4 ) was used as reference material. Photoluminescence (PL) spectra were measured by a spectrometer FLS920 (Edinburgh Instrument Ltd, UK).The spectrometer was equipped with a 450 W Xenon lamp (Xe900).The excitation wavelength was 325 nm.The width of excitation and emission slits was 0.5 nm. Gas chromatography with isotope ratio mass spectrometry (GC/IRMS) DELTA Advantage (Thermo Scientific, USA) was used for the detection of 13 C in gas samples before and after photocatalytic reaction. X-ray photoelectron spectra (XPS) were recorded using a hemispherical VG SCIENTA R3000 analyzer with constant pass energy of 100 eV, a monochromatized aluminum source Al K (E 1486.6eV) and a low energy electron flood gun (FS40A-PS) to compensate the charge on the surface of nonconductive samples.The base pressure in the analytical chamber was 510 -9 mbar. The binding energies were referenced to C 1s core level (E b 284.6 eV).The composition and chemical surrounding of the sample surface were investigated on the basis of the areas and binding energies of Ti 2p, O 1s, N 1s and C 1s photoelectron peaks.The fitting of high resolution spectra was provided through the Casa XPS software. The morphology of particles was observed on a transmission electron microscope (TEM) JEOL 2010 HC (JEOL Ltd., Japan).The particles were dispersed in ethanol and using an ultrasonic sprayer deposited on a TEM grid with carbon holey support film. Photoelectrochemical measurements were performed using a photoelectric spectrometer equipped with the 150 W Xe lamp and coupled with the P-IF 1.6 potentiostat (Instytut Fotonowy, Poland).The photocurrent responses were recorded using a classical three electrode setup.The platinum wire and Ag/AgCl were used as the auxiliary and reference electrodes, respectively.The working electrode consisted of photocatalyst powder deposited onto indium-tin oxide (ITO) foil coated by polyethylene terephthalate.The 0.1 M KNO 3 was used as an electrolyte solution.The photocurrent spectra were recorded within the range of 240 -500 nm with the step of 10 nm in the potential range of -0.2 to 0.8 V, step 0.1 V. Before the measurement itself the electrolyte was purged by argon to ensure oxygen free environment.The argon purge was also kept constant during the measurement. The photocatalytic reduction of carbon dioxide was carried out in a homemade apparatus ( Figure 1).A cylindrical stirred batch reactor with a photocatalyst spread on the bottom of the reactor was illuminated by an 8 W Hg lamp ( 254 nm; intensity 0.5 mW/cm 2 ) placed in horizontal position on top of the quartz glass visor.The reactor shell was made from stainless steel.The internal volume was 355 cm 3 .The photocatalyst powder loading was 0.1 g.Before the irradiation was turned ON, a supercritical fluid-grade CO 2 with a certified maximum of hydrocarbons less than 1 ppm (SIAD Technical Gases, CZ) to avoid any hydrocarbon contamination was purged through distilled water reservoir to saturate it by humidity (50 rel.). Afterwards the water saturated CO 2 was purged through the reactor in order to displace the air from the reactor.The CO 2 pressure was maintained at 120 kPa through the purging for 20 minutes.The pressure inside the reactor was continuously monitored.The reactor was pressurized to 140 kPa and sealed.The sample at 0 hour was taken and immediately analyzed on barrier discharge ionization detector (GC/BID).The photocatalytic reaction was started by switching on the Hg lamp.Gas samples were discontinuously taken at various times during the irradiation (8 hours).Gas sampling was performed using a gas-tight syringe (10 ml) through a septum.GC/BID equipped by ShinCarbon ST micropacked column was used for the analysis of reaction products in the gas phase.The accuracy of the experiment was verified by a series of repeated measurements, and the relative error of product yields (mol/g cat ) was determined to be less than 10 .Blank tests were carried out to guarantee that the methane production was due to the photocatalytic reduction of CO 2 and to eliminate the surrounding interference.During the first test, the reactor was UV-illuminated without the photocatalyst, the second blank test was conducted in the dark with the photocatalyst under the same experimental conditions, and the third test consisted of irradiating the photocatalyst in the absence of CO 2 .No hydrocarbons were detected in the above blank tests. To double check the products are really coming from the photocatalytic reduction of CO 2 the measurement with CO 2 containing 13 C isotope was conducted.Samples were taken at various times and the increase of 13 C amount in methane was observed with increasing irradiation time. These measurements confirmed that the methane is a product of the CO 2 photocatalytic reduction. The photocatalytic reduction of N 2 O was carried out in a homemade apparatus at ambient temperature with and without the photocatalyst (photocatalysis and photolysis, respectively) 12 . The 0.1 g of photocatalyst was placed on an adhesive tape inserted on the bottom of the batch reactor (635 ml volume).In both photochemical and photocatalytic experiments, the reactor was and the relative error of the N 2 O concentration was determined to be less than 5 ."}], "operation mode": [{"llm generation": "Batch", "source": "A cylindrical stirred batch reactor with a photocatalyst spread on the bottom of the reactor was illuminated by an 8 W Hg lamp ( 254 nm; intensity 0.5 mW/cm 2 ) placed in horizontal position on top of the quartz glass visor.", "context": "The g-C 3 N 4 was synthesized by simple heating of melamine in the muffle furnace.10 g of melamine powder as precursor were heated to 550 C at a heating rate of 10 C/min in a covered crucible.The temperature was kept at 550 C for 2 h and then cooled down to room temperature. A yellow product of g-C 3 N 4 was obtained and was ground to a fine powder. As a precursor of TiO 2 commercial P25 (Evonik) was used.The TiO 2 /g-C 3 N 4 composites were prepared by mechanical mixture and calcined in a muffle furnace at 450 C for 2 h with temperature increasing at the rate of 10 C/min.The samples were labelled according to weight ratio of TiO 2 /g-C 3 N 4 as follows: (0.3/1), (0.5/1), (1/1) and (2/1) TiO 2 /g-C 3 N 4 . X-ray powder diffraction patterns (XRD) were measured using a Bruker D8 (Bruker AXS) diffractometer equipped by a detector sensitive for the placement (VANTEC 1).The CoK lamp was used as a source of irradiation of wavelength 0.178897 nm.Measurements were done in the conventional Bragg-Brentano setup. Nitrogen physisorption at 77 K was performed on a 3Flex automated volumetric apparatus (Micromeritics Instruments, USA) after degassing of materials at 150 C for more than 24 h under vacuum below 1 Torr.Degassing at low temperature was applied to remove physisorbed water, but having no influence on the porous morphology of the developed materials.The specific surface area was calculated according to the classical Brunauer-Emmett-Teller (BET) theory for the p/p0 range of 0.05-0.30 34.As the specific surface area, S BET , is not a proper parameter in the case of mesoporous solids containing micropores 35 , the mesopore surface area, S meso , and the micropore volume, V micro , were also evaluated based on the t-plot method 36 with the C modif constant 35,37 .The net pore volume, V net , was determined from the nitrogen adsorption isotherm at maximum p/p0 (0.99).The pore-size distribution was evaluated from the adsorption branch of the nitrogen adsorption desorption isotherm by the Barrett-Joyner-Halenda (BJH) method 38 using the de Boer standard isotherm and assuming cylindrical pore geometry. IR spectra of samples were measured by potassium bromide pellets technique.Exactly 1.0 mg of sample was ground with 200 mg dried potassium bromide.This mixture was used to prepare the potassium bromide pellets.The pellets were pressed by 8 tons for 30 seconds under vacuum. The IR spectra were collected using FT-IR spectrometer Nexus 470 (ThermoScientific, USA) with DTGS detector.The measurement parameters were the following: the spectral region of 4000-400 cm -1 , spectral resolution 4 cm -1 ; 64 scans; the Happ-Genzel apodization.Treatment of spectra: polynomial (second order) baseline, subtraction spectrum of pure potassium bromide. A 180 sampling was used as measurement technique of Raman spectroscopy.The Raman spectra were measured at dispersive Raman spectrometer DXR SmartRaman (ThermoScientific, USA) with CCD detector.The measurement parameters were as follows: excitation laser 780 nm, grating 400 lines/mm, aperture 50 m, exposure time 1 second, number of exposures 1000, the spectral region of 1800-50 cm -1 .An empty sample compartment was used for background measurement.Treatment of spectra: fluorescence correction (6 th order). The UV-visible spectra of prepared nanocomposites were recorded using a UV-2600 spectrophotometer with an ISR-2600 integrating sphere attachment (Shimadzu Scientific Co., Japan) from 220 to 1400 nm.Sampling interval was 1 nm and width of slit was 2 nm.Barium sulphate (BaSO 4 ) was used as reference material. Photoluminescence (PL) spectra were measured by a spectrometer FLS920 (Edinburgh Instrument Ltd, UK).The spectrometer was equipped with a 450 W Xenon lamp (Xe900).The excitation wavelength was 325 nm.The width of excitation and emission slits was 0.5 nm. Gas chromatography with isotope ratio mass spectrometry (GC/IRMS) DELTA Advantage (Thermo Scientific, USA) was used for the detection of 13 C in gas samples before and after photocatalytic reaction. X-ray photoelectron spectra (XPS) were recorded using a hemispherical VG SCIENTA R3000 analyzer with constant pass energy of 100 eV, a monochromatized aluminum source Al K (E 1486.6eV) and a low energy electron flood gun (FS40A-PS) to compensate the charge on the surface of nonconductive samples.The base pressure in the analytical chamber was 510 -9 mbar. The binding energies were referenced to C 1s core level (E b 284.6 eV).The composition and chemical surrounding of the sample surface were investigated on the basis of the areas and binding energies of Ti 2p, O 1s, N 1s and C 1s photoelectron peaks.The fitting of high resolution spectra was provided through the Casa XPS software. The morphology of particles was observed on a transmission electron microscope (TEM) JEOL 2010 HC (JEOL Ltd., Japan).The particles were dispersed in ethanol and using an ultrasonic sprayer deposited on a TEM grid with carbon holey support film. Photoelectrochemical measurements were performed using a photoelectric spectrometer equipped with the 150 W Xe lamp and coupled with the P-IF 1.6 potentiostat (Instytut Fotonowy, Poland).The photocurrent responses were recorded using a classical three electrode setup.The platinum wire and Ag/AgCl were used as the auxiliary and reference electrodes, respectively.The working electrode consisted of photocatalyst powder deposited onto indium-tin oxide (ITO) foil coated by polyethylene terephthalate.The 0.1 M KNO 3 was used as an electrolyte solution.The photocurrent spectra were recorded within the range of 240 -500 nm with the step of 10 nm in the potential range of -0.2 to 0.8 V, step 0.1 V. Before the measurement itself the electrolyte was purged by argon to ensure oxygen free environment.The argon purge was also kept constant during the measurement. The photocatalytic reduction of carbon dioxide was carried out in a homemade apparatus ( Figure 1).A cylindrical stirred batch reactor with a photocatalyst spread on the bottom of the reactor was illuminated by an 8 W Hg lamp ( 254 nm; intensity 0.5 mW/cm 2 ) placed in horizontal position on top of the quartz glass visor.The reactor shell was made from stainless steel.The internal volume was 355 cm 3 .The photocatalyst powder loading was 0.1 g.Before the irradiation was turned ON, a supercritical fluid-grade CO 2 with a certified maximum of hydrocarbons less than 1 ppm (SIAD Technical Gases, CZ) to avoid any hydrocarbon contamination was purged through distilled water reservoir to saturate it by humidity (50 rel.). Afterwards the water saturated CO 2 was purged through the reactor in order to displace the air from the reactor.The CO 2 pressure was maintained at 120 kPa through the purging for 20 minutes.The pressure inside the reactor was continuously monitored.The reactor was pressurized to 140 kPa and sealed.The sample at 0 hour was taken and immediately analyzed on barrier discharge ionization detector (GC/BID).The photocatalytic reaction was started by switching on the Hg lamp.Gas samples were discontinuously taken at various times during the irradiation (8 hours).Gas sampling was performed using a gas-tight syringe (10 ml) through a septum.GC/BID equipped by ShinCarbon ST micropacked column was used for the analysis of reaction products in the gas phase.The accuracy of the experiment was verified by a series of repeated measurements, and the relative error of product yields (mol/g cat ) was determined to be less than 10 .Blank tests were carried out to guarantee that the methane production was due to the photocatalytic reduction of CO 2 and to eliminate the surrounding interference.During the first test, the reactor was UV-illuminated without the photocatalyst, the second blank test was conducted in the dark with the photocatalyst under the same experimental conditions, and the third test consisted of irradiating the photocatalyst in the absence of CO 2 .No hydrocarbons were detected in the above blank tests. To double check the products are really coming from the photocatalytic reduction of CO 2 the measurement with CO 2 containing 13 C isotope was conducted.Samples were taken at various times and the increase of 13 C amount in methane was observed with increasing irradiation time. These measurements confirmed that the methane is a product of the CO 2 photocatalytic reduction. The photocatalytic reduction of N 2 O was carried out in a homemade apparatus at ambient temperature with and without the photocatalyst (photocatalysis and photolysis, respectively) 12 . The 0.1 g of photocatalyst was placed on an adhesive tape inserted on the bottom of the batch reactor (635 ml volume).In both photochemical and photocatalytic experiments, the reactor was and the relative error of the N 2 O concentration was determined to be less than 5 ."}]}}