{"DOI": "10.1016/j.apcatb.2016.05.071", "paper_title": "Surface heterojunction between (001) and (101) facets of ultrafine anatase TiO2 nanocrystals for highly efficient photoreduction CO2 to CH4", "human validator": "hybrid annotator", "annotation": {"catalyst": [{"llm generation": "anatase TiO2 nanocrystals", "source": "Surface heterojunction between (001) and (101) facets of ultrafine anatase TiO2 nanocrystals for highly efficient photoreduction CO2 to CH4", "context": "Surface heterojunction between (001) and (101) facets of ultrafine anatase TiO2 nanocrystals for highly efficient photoreduction CO2 to CH4"}, {"llm generation": "TiO 2 nanocrystals", "source": "Shape-dependent ultrafine anatase TiO 2 nanocrystals coexposed with ( 001) and ( 101) facets are synthesized in isopropanol by the simple solvothermal strategy.", "context": "Shape-dependent ultrafine anatase TiO 2 nanocrystals coexposed with ( 001) and ( 101) facets are synthesized in isopropanol by the simple solvothermal strategy.Nanotube titanic acid (NTA) was used as the Ti precursor, and hydrofluoric acid was the shape-control reagent.The nanotubular structure of NTA facilitated HF to adsorb on/into NTA, and made the shape-controlled process to be more economical and easier.The ratio of (001) facets of the obtained decahedral TiO 2 nanocrystals can be adjusted from 5 to 51, and the mean diameter of nanoparticles is about 10-30 nm.The samples are characterized by X-ray diffraction, transmission electron microscopy, X-ray photoelectron spectroscope, ultraviolet-visible diffuse reflectance spectrum, N 2 adsorption-desorption isotherms, fluorescence and Raman spectroscopy.The truncated octahedral bipyramid TiO 2 nanocrystals with 51 (001) and 49 (101) facets exposing showed the highest photoactivity for CO 2 reduction to CH 4 .This remarkable photocatalytic efficiency is attributed to the surface heterojunction between (001) and (101) crystal facets, the small size and large surface area of the truncated octahedral bipyramid TiO 2 nanocrystals."}, {"llm generation": "TiO 2, Pt", "source": "After four cycles of reaction, the formation rate of CH 4 of Pt-TiO 2 -0.2HF catalyst reached to 3.15 mol h -1 g -1 .", "context": "The crystal structures of the prepared materials were confirmed by XRD and Raman spectroscopy.Fig. 1a shows the XRD plots of all samples.The peaks at 25.25, 37.72, 48.03, 53.91, and 54.99 Can be assigned to (101), ( 004), ( 200), (105), and (211) crystal planes of anatase TiO 2 (JCPDS 21-1272), respectively 30.Anatase is the unique phase in all samples except for P25-0.2HFwhich shows the presence of anatase and rutile.Apparently, the (004) diffraction peak of TiO 2 -0.2HF becomes broader, which indicates massive appearance of (001) facets 21.Typical anatase phase is revealed from the appearing peaks at about 144 (E g ), 394 (B 1g ), 514 (A 1g ), and 636 cm -1 (E g ) in Fig. 1b.We can easily observe that the E g peaks (144 cm -1 ) of TiO 2 -0.2HF is the lowest.It has been known that E g and B 1g peaks is mainly caused by symmetric stretching vibration and bending vibration of O Ti O, while A 1g peak is caused by anti-symmetric bending vibration of O Ti O 48.The vibration models of anatase TiO 2 (101) and (001) facets were different with that of no (001) facets exposed, and the intensity of the symmetric stretching vibration modes of O Ti O becomes weak when the (001) facets exist 49.In a word, the higher the percentage of (001) facets, the weaker the intensity of the symmetric stretching vibration modes of O Ti O will be, and correspondingly, the intensity of the E g peaks in the Raman spectra decreased.The information provided from Raman spectroscopy is in agreement with the above XRD results, and the enlarged XRD patterns and Raman spectra are shown in Fig. S1. The XPS analysis in Fig. 2 gives the surface composition and chemical status of TiO 2 -0.2HF.Four XPS plots of Ti2p, O1s, F1s, and Pt4f are presented.The binding energy of Ti2p 3/2 and Ti2p 1/2 (Fig. 2a) is located at 458.4 and 464.1 eV 44, indicating the oxidation state of the Ti element is the same as that of bulk TiO 2 .The O1 s peaks consisted of a dominant peak at 529.5 eV and another higher energy peak at 531.9 eV, which can be indexed to Ti-O bonding and surface O H bonding of TiO 2 -0.2HF, respectively (Fig. 2b) 44,50.Simultaneously, the existence of F is detected, and the F 1 s peak at the binding energy of 684.1 eV in Fig. 2c is a typical value for Ti-F species on the TiO 2 surface 17.The existence of fluorine would affect the properties of catalyst, and the role of F for the photoactivity will be discussed in the following section.The binding energy peak of Pt 4f 7/2 and 4f 5/2 can be observed at 71.4 and 74.9 eV in Fig. 2d, which are in accordance with the standard position of Pt 0 40, and indicating Pt 0 nanoparticles were successfully loaded on TiO 2 -0.2HF surfaces by photo-deposition method. The morphology and microstructure of the products were shown in Fig. 3.As can be seen from Fig. 3a, TiO 2 -0.2HF nanocrystals are consisted of highly dispersed truncated octahedral bipyramid nanoparticles.The mean particle size is calculated to be 10-18 nm with more than 100 nanoparticles from TEM images (Fig. S2).The HRTEM image (Fig. 3b) shows that the lattice spacing parallel to the top and bottom facets is ca.0.235 nm, which corresponds to the (001) planes of anatase TiO 2 .Another set of lattice fringes with the spacing of 0.351 nm corresponding with the (101) planes was also clearly revealed from the picture.And the crystal orientation of ( 101) and (001) faces with an interfacial angle of 68.3 , which indicates the top and bottom facets of the truncated octahedral bipyramid TiO 2 are the (001) facets, the lateral isosceles trapezoid corresponds to (101) facet 20.On the basis of the above truncated octahedral bipyramid structural information, the percentage of the (001) facets in TiO 2 -0.2HF was estimated to be 51 as calculated by a reported method 51.As can be seen in Fig. 3c andd of TiO 2 -0HF catalyst, the octahedral bipyramid TiO 2 -0HF nanocrystals exposing with a great deal of (101) facets, and the average particle size is 11-17 nm (Fig. S2).The information further confirms the contribution of F -to the exposure of (001) facets.TEM images of TiO 2 -xHF (x is 0.1, 0.5, 1 and 1.5) are shown in Fig. S3.The dimension of the TiO 2 nanocrystal grew up apparently with the augment of HF.The nanoparticles aggregated seriously to about 30 nm and the proportion of (001) facets decreased to 8 when 1.5 mL was added to the reaction.The amount of HF has a large effect on the morphology and size of the TiO 2 nanocrystals, and the detailed information was listed in the following Table 1. Pt often plays a crucial role for the improvement of the photoactivity, especially for the deep reduction of CO 2 to CH 4 in the photoreduction of CO 2 .Fig. 3e andf showed that Pt 0 nanoparticles were uniformly deposited on the TiO 2 -0.2HF surfaces and the average particle size was 1-2 nm.Highly dispersed Pt 0 nanoparticles are beneficial for the accumulation of electrons, which can promote the separation of electrons and holes, and then further enhance the reduction of CO 2 ; while Pt 0 on the TiO 2 -0HF surfaces aggregates to 4-6 nm as shown in Fig. 3g andh.It is conventional understanding that (101) facets should have more strongly reductive electrons because their bottom of CB in the order (101)(001) 52.Therefore, (101) facets with a Pt-loading are easier to form Pt aggregates on the surfaces due to their different surface electronic structures and reconstructions during the Pt deposition process. Fig. 4 displays N 2 adsorption-desorption isotherms and the corresponding pore size distribution curve for the prepared TiO 2 samples.All of the samples exhibited similar type-IV isotherms with an H3 hysteresis loop at a relative pressure range of 0.7-0.95according to the IUPAC classification, which are typical characters of mesoporous materials 53.Pore size distribution curve (insert) of the TiO 2 -0.2HF sample, with a peak at 8.6 nm, was achieved through BJH analysis.Quantitative details on BET surface areas, pore volume and average pore size of the TiO 2 samples are presented in Table 1.The BET surface areas of catalysts from NTA precursor are larger than P25 and P25-0.2HFexcept TiO 2 -1.5HF.With the increasing of HF from 0 to 1 mL, the surface areas of the samples decreased a little sequentially.However, the specific surface areas of TiO 2 -1.5HF (53 m 2 /g) apparently decreased about two times than that of TiO 2 -0HF (92 m 2 /g), which is caused by plenty of HF, through selectively corroding (001) facets and leading to irreg- ular growth of TiO 2 nanoparticles (TEM images of TiO 2 -1.5HF was shown in Fig. S2).The average pore size of TiO 2 -0.2HF is 8.6 nm larger than any other sample, which is beneficial for adsorption of CO 2 . The UV-vis optical absorption spectra obtained by the diffuse reflectance of as-prepared TiO 2 are shown in Fig. 5.The onset of the absorption edge for TiO 2 -0HF is at ca. 410 nm, which is consistent with the band gap of anatase TiO 2 (3.02 eV).Compared with TiO 2 -0HF, the absorption edge of TiO 2 -xHF has not an obvious shift.Surprisingly, absorption intensity of TiO 2 -0.2HF is significantly higher than that of other samples, which is due to the exposure of abundant (001) facets.The high density of active unsaturated coordination Ti atoms and the presence of enlarged Ti O Ti bond angles on the (001) facets surface, which make the existence of oxygen defects 54.Based on the analysis above, it can be con-cluded that the TiO 2 -0.2HF might result in the efficient utilization of UV-vis light and exhibit high photocatalytic activities. The CO 2 photoreduction performance of the catalysts was shown in Fig. 6.Both reactions under light without the catalysts and in dark with the catalysts were tested as contrast experiment.A very trace amount of CH 4 or CO was detected in the two comparison tests, indicating that the reaction was indeed a photocatalytic process. All of the prepared TiO 2 nanocrystals exhibited photocatalytic activity that was significantly better than the commercial P25, because of the anatase phase structure.The conduction band edge potential of anatase TiO 2 is more negative vs normal hydrogen electrode (NHE) than the CO 2 /CH 4 reduction potential, thus, the anatase TiO 2 can efficiently reduce CO 2 into CH 4 under Hg lamp irradiation 13.Although BET surface area of TiO 2 -0HF was higher, the photoreduction CO 2 activity on TiO 2 nanocrystals with exposed (001) facets was much higher than its except TiO 2 -1.5HF.This indicated (001) facets played a key role in the enhancement of the photoactivity.The photocatalytic activity of these catalyst samples can be rationalized as TiO 2 -0.2HF TiO 2 -0.1HFTiO 2 -0.5HF TiO 2 -0.5HFTiO 2 -1HF TiO 2 -0HF displayed in Fig. 6.Based on the DFT calculations, the (101) and (001) facets of anatase TiO 2 exhibit different band structures and band edge positions 31.Thus, the coexposed (101) and (001) facets of anatase can form a surface heterojunction within a single TiO 2 particle, which is beneficial for the transfer of photogenerated electrons to (101) and holes to (001) facets, respectively 31.TiO 2 -0.2HF has the highest CH 4 production rate of 1.58 mol h -1 g -1 , which was owing to the optimal ratio of the ( 001) and (101) facets.However, the inferior photocatalytic activity of TiO 2 -1.5HF than TiO 2 -0HF was on account of two reasons: one is the smaller specific surface area of the later, and the other is deficiencies appeared on the surface of TiO 2 -1.5HF with the corrosion of HF, which enhanced the recombination of photo-generated carriers and reducing the photoactivity.Considering the impact of fluorine on photoactivity of the catalyst, while defluorination may change the morphology and surface state of TiO 2 , the catalytic activity of P25-0.2HF was tested under the same conditions, and a slightly higher photocatalytic CH 4 production rate (0.21 mol h -1 g -1 ) was obtained than 0.1 mol h -1 g -1 of P25, which indicated the present of appropriate F on the surface was favourable to enhance CO 2 photoreduction.Surface Ti-F electronegative groups can act as trapping sites for photo-generated electrons and facilitate transfer to surface-adsorbed CO 2 molecules 42.It is worth mentioning that a novel anatase TiO 2 was obtained by dehydration of NTA at elevated temperature which contains high concentration of single-electron-trapped oxygen vacancies (Vo ) in our previous study 46,47.Here we also tested single-electrontrapped oxygen vacancies (Vo ) of TiO 2 -0HF and TiO 2 -0.2HF, as shown in Fig. S4.A large amount of Vo exist in the bulk of TiO 2 -0HF, as for TiO 2 -0.2HF samples, there exist a little Vo .This predicts the existence of HF can significantly reduce the defect in the bulk phase of the TiO 2 (Vo ).Consequently, it helps reduce the probability of electron hole recombination in the compound, and prompt charge carriers participating into the photocatalytic redox reaction.Based on the above discussion, the photocatalytic activity of the TiO 2 samples is strongly affected by many factors, including the optimum ratio of the exposed (001) to (101) facets, and surface area, crystal structure of catalyst and appropriate amount of F. Surface heterojunction between (001) and (101) facets of TiO 2 nanocrystals is one of most important reasons (seen from the following PL and EIS spectra). To confirm that CH 4 is formed from CO 2 , we have compared the rates of CH 4 formation in the presence of H 2 O instead of KHCO 3 solution under CO 2 atmospheres, and the formation rate of CH 4 of TiO 2 -0.2HF catalyst reached to 1.56 mol h -1 g -1 , which is equivalent to the production rate of CH 4 (1.58 mol h -1 g -1 ) in KHCO 3 solution.In addition, when the reactor was filled with N 2 (instead of CO 2 ) in KHCO 3 solution, no carbon-containing compounds were detected either (Table 2).The results illustrate that the C species in the photocatalytic products of CH 4 comes from CO 2 .uniformly distributed Pt nanoparticles on the TiO 2 -0.2HF surface, as above mentioned (TEM).The AQE based on CH 4 production over Pt-TiO 2 -0.2HF was calculated to be 0.22 (details displayed in Supporting Information).As shown in inset of Fig. 7, the stability test of Pt-TiO 2 -0.2HF was conducted by cycle reaction, and each cycle was performed for 6 h.After each cycle, CH 4 in the system was degassed by N 2 and then CO 2 was reintroduced into the reactor.The rates of CH 4 formation declined apparently in the second reaction, but it did not show significant change in the subsequent cycles.After four cycles of reaction, the formation rate of CH 4 of Pt-TiO 2 -0.2HF catalyst reached to 3.15 mol h -1 g -1 .Indeed, there are many factors affecting the photocatalytic activities, for this sample, the decrease of photoactivity was possibly attributed to either the inactivation of some active sites or the structural change of the catalyst in the reaction process.IR and XPS experiments were carried out to detect surface species of recycled catalysts, but no apparent change was observed (Fig. S5).We believed that the decrease in activity was typically resulted in the TiO 2 nanoparticles aggregated in aqueous solution after a long time.In order to prove our conjecture, the recycled catalyst is characterized by N 2 adsorption-desorption isotherms, the specific surface areas of the recycled catalyst (75 m 2 /g) decreased apparently compared with that of original catalyst (90 m 2 /g), and the decreased percentage of the specific surface areas is approximately equal with the decline yield of catalytic activity. The feasibility of H 2 and O 2 production is investigated with a gas chromatography (GC 7920, Beijing, China) during the process of photoreduction CO 2 .The formation rate of H 2 of Pt-TiO 2 -0.2HF cat- alyst reached to 0.92 mol h -1 g -1 , which is significantly inferior to the production rate of CH 4 (4 mol h -1 g -1 ).Based on the literature results 55,56, we believe the relatively lower yield of H 2 production in this work is possibly due to the following two reasons: (1) protons or To further evaluate the photocatalytic performance in liquid phase, we examined photocatalytic activity of the as-prepared TiO 2 -xHF samples by methylene blue (MB) degradation.As shown in Fig. S6, TiO 2 -0.2HF also shows the superior photocatalytic activity and the degradation rate is up to nearly 90 within 10 min under Xe arc lamp irradiation.This also further revealed TiO 2 -0.2HF with proper ratio (001) facets has a broad application. In the photocatalytic reactions, the separation of carriers is one of the effective factors to enhance the photocatalytic reactivity, especially in photoreduction CO 2 reactions.The photoluminescence (PL) emission mainly results from the recombination of excited electrons and holes, which can be considered as an effective approach for understanding the separation capacity of the photoinduced carriers.A low PL intensity also indicates the decrease in recombination rate 59,60.Fig. 8 shows the fluorescence spectra of the samples in a wavelength range of 350-550 nm.It can be seen that all the peaks displayed similar shapes, and three main characteristic peaks appeared at 398, 451, and 468 nm, which was corresponding to the energy levels of 3.12, 2.75, and 2.65 eV, respectively.That's to say, fluorescence peaks at 398 attributed to the emission peak towards excitation the band gap of anatase TiO 2 , and the other two fluorescence peaks derived from band-to-band transition of free carriers 61.The TiO 2 -0.2HF sample has the weakest PL emission probably because of the relatively low electrons and holes recombination rate.PL measurement results are in consistent with the order of the photocatalytic activity.EIS spectra is often used for characterizing the conductivity of an electrode, a small circular radius usually shows a lower charge transfer resistance 62.Fig. 9 shows the Nyquist plots of different samples, TiO 2 -1.5HF and TiO 2 -0HF show large semicircles, which is due to the higher percentage of the exposed (101) facets on the TiO 2 sample, which plays the role of recombination centres for photogenerated carriers and thus inhibit the charge separation.The better activity of TiO 2 -0HF than TiO 2 -1.5HF may be on account of the larger surface area.At the same time, it can obviously be seen that semicircles of TiO 2 -1HF, TiO 2 -0.5HF,TiO 2 -0.1HF modified electrodes decreased, which can be mainly attributed to surface heterojunction between (001) and (101) facets of TiO 2 .Interestingly, the impedance arc radius of TiO 2 -0.2HF is the smallest among samples implying that the highest separation efficiency of photogenerated electron-hole pairs was achieved from TiO 2 -0.2HF.This is attributed to the appropriate proportion between (001) and (101) facets, which extremely prevents the direct recombination of electrons and holes. The schematic diagram of proposed mechanism of CO 2 photoreduction process is shown in Fig. 10.When the ultrafine applanate truncated octahedral bipyramid TiO 2 nanocrystals was irradiated by Hg lamp, photo-induced electrons and holes were produced.The photogenerated electrons on the (001) facets could transport to the (101) facets due to their conduction band offset, and then react with the adsorbed CO 2 to generate CH 4 subsequently.Correspondingly, the photogenerated holes on the (101) facets could transfer to the (001) facets, and then react with the adsorbed H 2 O to generate O 2 and H .After loading of Pt nanoparticles, photo-generated electrons can be easily trapped by Pt because of its lower Fermi energy level, improving the separation efficiency of the photo-generated electron-hole pairs, and then the photoreduction rate of CO 2 to CH 4 was accelerated."}, {"llm generation": "TiO 2 nanocrystals", "source": "In brief, ultrafine anatase TiO 2 nanocrystals with controllable coexposed (001) and (101) facets were prepared by a facile solvothermol strategy.", "context": "In brief, ultrafine anatase TiO 2 nanocrystals with controllable coexposed (001) and (101) facets were prepared by a facile solvothermol strategy.1D NTA transformed to applanate truncated octahedral bipyramid TiO 2 nanocrystals, and the percentage of (001) facets can be adjusted from 5 to 51.TiO 2 -0.2HF with 51 of (001) facets and 49 (101) facets exhibited the highest photocatalytic activity in terms of both photoreduction CO 2 and photodegradation of MB.PL and EIS spectra results proved that the efficient surface heterojunctions between (001) and (101) facets are favourable for the separation of photogenerated charge carriers.What is more, the smaller size reduces recombination probability of photocarriers in the bulk.The photoreduction rate of CO 2 to CH 4 reached to 1.58 mol h -1 g -1 on TiO 2 -0.2HF, and the photoactivity increased remarkably to 4.0 mol h -1 g -1 after loaded Pt nanoparticles.In addition, the efficiency could remain nearly 80 after four cycle reactions, indicating the catalyst has a long-term stability.Moreover, little HF dosage is beneficial for subsequent industrial production, and this kind of ultrafine TiO 2 nanocrystals with surface heterojunction is potential for the development of solar cells, optoelectronic devices, sensors and heterogeneous catalysts. Fig. 1.XRD and Raman patterns of the photocatalysts. Fig. 2. XPS spectra of Ti2p (a), O1 s (b), F1 s (c) and Pt4f (d) in Pt-TiO2-0.2HFsample. Fig. 3. TEM and HRTEM images of TiO2-0.2HF(a, b), TiO2-0HF (c, d), Pt-TiO2-0.2HF(e, f), Pt-TiO2-0HF (g, h). Fig. 6.Photocatalytic activity of CH4 production rate of P25, P25-0.2HF and TiO2-xHF samples. Fig. 7. CH4 production rate of Pt-P25, TiO2-0HF and TiO2-0.2HFsamples and the inset displays the stability of Pt-TiO2-0.2HFnanoparticles on CO2 photoreduction in the consecutive four cycles. Fig. 8. PL spectra of the TiO2-xHF photocatalysts (excitated wavelength: 315 nm). Fig. 9. Nyquist plots of the TiO2-xHF samples. Fig. 10.Schematic diagram of mechanism of photocatalytic process. Effect of different volume of HF on the structural of TiO2 nanocystals. H radicals formed by the photodissociation of water are competitively consumed by CO 2 reduction intermediates like CO 2 to produce CH 4 ; (2) the produced H 2 could be consumed by reverse reactions with CO or O 2 .The formation rate of O 2 of Pt-TiO 2 -0.2HF catalyst reached to 5.2 mol h -1 g -1 , which is a little higher than the production rate of CH 4 (4 mol h -1 g -1 ).The production rate of O 2 and CH 4 is not in accordance with the molar ratio, which is possibly caused by the consumption of residual O 2 in the reactor through the reaction with photogenerated electrons: O 2 e - O 2 The authors gratefully acknowledge the support of the National Natural Science Foundation of China (Nos.21103042 and 21471047), Program for Science Technology Innovation Talents (15HASTIT043) and Innovative Research Team (16IRTSTHN015) from the University of Henan Province, and Program for Changjiang Scholars and Innovative Research Team in University from the Ministry of Education of China (PCS IRT1126). The manuscript was written through contributions of all authors.Yuhui Cao carried out the total experiment and wrote the first manuscript.Chen Li and Junli Li participated in the data analysis.Qiuye Li supervised the project.Jianjun Yang provided the facilities and discussions related to them.All authors read and approved the final manuscript. Supplementary data associated with this article can be found, in the online version, at http://dx.doi.org/10.1016/j.apcatb.2016.05.071."}, {"llm generation": "Pt-TiO 2 -0.2HF", "source": "The formation rate of O 2 of Pt-TiO 2 -0.2HF catalyst reached to 5.2 mol h -1 g -1 , which is a little higher than the production rate of CH 4 (4 mol h -1 g -1 ).", "context": "In brief, ultrafine anatase TiO 2 nanocrystals with controllable coexposed (001) and (101) facets were prepared by a facile solvothermol strategy.1D NTA transformed to applanate truncated octahedral bipyramid TiO 2 nanocrystals, and the percentage of (001) facets can be adjusted from 5 to 51.TiO 2 -0.2HF with 51 of (001) facets and 49 (101) facets exhibited the highest photocatalytic activity in terms of both photoreduction CO 2 and photodegradation of MB.PL and EIS spectra results proved that the efficient surface heterojunctions between (001) and (101) facets are favourable for the separation of photogenerated charge carriers.What is more, the smaller size reduces recombination probability of photocarriers in the bulk.The photoreduction rate of CO 2 to CH 4 reached to 1.58 mol h -1 g -1 on TiO 2 -0.2HF, and the photoactivity increased remarkably to 4.0 mol h -1 g -1 after loaded Pt nanoparticles.In addition, the efficiency could remain nearly 80 after four cycle reactions, indicating the catalyst has a long-term stability.Moreover, little HF dosage is beneficial for subsequent industrial production, and this kind of ultrafine TiO 2 nanocrystals with surface heterojunction is potential for the development of solar cells, optoelectronic devices, sensors and heterogeneous catalysts. Fig. 1.XRD and Raman patterns of the photocatalysts. Fig. 2. XPS spectra of Ti2p (a), O1 s (b), F1 s (c) and Pt4f (d) in Pt-TiO2-0.2HFsample. Fig. 3. TEM and HRTEM images of TiO2-0.2HF(a, b), TiO2-0HF (c, d), Pt-TiO2-0.2HF(e, f), Pt-TiO2-0HF (g, h). Fig. 6.Photocatalytic activity of CH4 production rate of P25, P25-0.2HF and TiO2-xHF samples. Fig. 7. CH4 production rate of Pt-P25, TiO2-0HF and TiO2-0.2HFsamples and the inset displays the stability of Pt-TiO2-0.2HFnanoparticles on CO2 photoreduction in the consecutive four cycles. Fig. 8. PL spectra of the TiO2-xHF photocatalysts (excitated wavelength: 315 nm). Fig. 9. Nyquist plots of the TiO2-xHF samples. Fig. 10.Schematic diagram of mechanism of photocatalytic process. Effect of different volume of HF on the structural of TiO2 nanocystals. H radicals formed by the photodissociation of water are competitively consumed by CO 2 reduction intermediates like CO 2 to produce CH 4 ; (2) the produced H 2 could be consumed by reverse reactions with CO or O 2 .The formation rate of O 2 of Pt-TiO 2 -0.2HF catalyst reached to 5.2 mol h -1 g -1 , which is a little higher than the production rate of CH 4 (4 mol h -1 g -1 ).The production rate of O 2 and CH 4 is not in accordance with the molar ratio, which is possibly caused by the consumption of residual O 2 in the reactor through the reaction with photogenerated electrons: O 2 e - O 2 The authors gratefully acknowledge the support of the National Natural Science Foundation of China (Nos.21103042 and 21471047), Program for Science Technology Innovation Talents (15HASTIT043) and Innovative Research Team (16IRTSTHN015) from the University of Henan Province, and Program for Changjiang Scholars and Innovative Research Team in University from the Ministry of Education of China (PCS IRT1126). The manuscript was written through contributions of all authors.Yuhui Cao carried out the total experiment and wrote the first manuscript.Chen Li and Junli Li participated in the data analysis.Qiuye Li supervised the project.Jianjun Yang provided the facilities and discussions related to them.All authors read and approved the final manuscript. Supplementary data associated with this article can be found, in the online version, at http://dx.doi.org/10.1016/j.apcatb.2016.05.071."}], "co-catalyst": [{"llm generation": "Pt nanoparticles", "source": "For further improving the photocatalytic efficiency, 1 wt Pt nanoparticles were loaded on the surface of as-prepared samples as the cocatalyst by the in-situ photoreduction method.", "context": "NTA were synthesized by the hydrothermal process in a concentrated NaOH aqueous solution, a commercial titania P25 was used as the Ti source 46.Typically, 3 g of P25 was mixed with 300 mL of 10 M NaOH aqueous solution, and followed by the hydrother-mal treatment at 120 C in Teflon-lined autoclave for 24 h.The obtained precipitate was washed with deionized water thoroughly until pH 7, and followed by a filtration process.Then the resulting product was put into 300 mL hydrochloric acid aqueous solution (pH 1) and stirring for 8 h.At last, the precipitates were washed with distilled water until no Cl -was detectable.Then, the product was dried in an oven at 100 C for overnight. In a typical synthesis, 1 g of NTA powders were dispersed into 25 mL of absolute isopropanol and stirred for 30 min, and after that, x mL (x is 0, 0.1, 0.2, 0.5, 1 and 1.5) of HF (40 wt) was added slowly to the suspension, respectively.Then, the suspension was transferred into 50 mL Teflon-lined autoclave and kept at 200 C for 24 h.After the solvothermal reaction, the resulting precipitates were collected and washed with ethanol and distilled water for several times.Then, the samples were dried in an oven at 80 C. The obtained samples were denoted as TiO 2 -0HF, TiO 2 -0.1HF,TiO 2 -0.2HF,TiO 2 -0.5HF,TiO 2 -1HF and TiO 2 -1.5HF, respectively.As a reference, the fluorinated P25 was also prepared by the same process in absolute isopropanol adding 0.2 mL of HF (40 wt), which was denoted as P25-0.2HF. For further improving the photocatalytic efficiency, 1 wt Pt nanoparticles were loaded on the surface of as-prepared samples as the cocatalyst by the in-situ photoreduction method.The corresponding products were denoted as Pt-TiO 2 -0HF, Pt-TiO 2 -0.2HF and Pt-P25, respectively. X-ray diffraction (XRD) patterns were measured on a Bruker Apex II diffractometer (CuK radiation, 2A range 20 -80 , step size 0.08 , accelerating voltage 40 kV, applied current 40 mA).Raman measurement was carried out using a Renishaw inVia Raman spectroscopy, the power of the laser was 1, and the laser excitation was 532 nm, wavenumber range (100-800 cm -1 ), and the exposure time was 1 s.The surface area, pore size, and pore volume of the samples were analyzed by nitrogen adsorption at 77 K with the Brunauer-Emmett-Teller (BET) method (Micromeritics, ASAP 2020).Transmission electron microscopic (TEM) images were taken on a JEM-2010 electron microscope at 200 kV.X-ray photoelectron spectroscopy (XPS) measurements were investigated on a Thermo ESCALAB 250Xi with Al K emission at 1486.6 eV, and all of the binding energies were calibrated by C 1 s at 284.8 eV.UV-visible diffuse reflectance spectra (UV-vis DRS) were obtained on a Shimadzu U-3010 spectrometer, using BaSO 4 as a reference.The electron spin resonance (ESR) signals of the samples were tested on a JES FA200 spectrometer at room temperature.The photoluminescence (PL) spectra were recorded on a F-7000 FL spectrophotometer by a typical benchtop fluorimeter (equipped with a 150 W Xe lamp source, using an excitated wavelength of 315 nm). Photoelectrochemical measurements were conducted in a conventional three-electrode system with 1 M Na 2 SO 3 electrolyte on the electrochemical workstation (IM6eX Instruments, ZAHNER, German).The suspension with the obtained sample (0.02 g) and ethanol (0.5 mL) was coated onto a 1 cm 1.1 cm fluorine-tin oxide (FTO) glass as the working electrode, a Pt mesh and an Ag/AgCl electrode (SCE) acting as the counter electrode and reference electrode, respectively.Electrochemical impedance spectroscopy (EIS) experiments were conducted at the bias of 0.4 V and a 250 W Hg lamp was employed as photon source. Photocatalytic activity was conducted in a closed reactor with the inner capacity of 200 mL containing 125 mL 0.1 M KHCO 3 solution.0.1 g catalyst was put into the reactor and then ultrasonic to disperse evenly.The ultrapure gaseous CO 2 was flowed through the solution under stirring for 1 h, until it achieved saturated state.The photocatalytic reaction was typically performed at room temperature for 6 h using a high pressure Hg lamp (250 W).The outputs were analyzed by a gas chromatography (GC 9790, Zhejiang, China)."}, {"llm generation": "Pt", "source": "After loading of Pt nanoparticles, photo-generated electrons can be easily trapped by Pt because of its lower Fermi energy level, improving the separation efficiency of the photo-generated electron-hole pairs, and then the photoreduction rate of CO 2 to CH 4 was accelerated.", "context": "The crystal structures of the prepared materials were confirmed by XRD and Raman spectroscopy.Fig. 1a shows the XRD plots of all samples.The peaks at 25.25, 37.72, 48.03, 53.91, and 54.99 Can be assigned to (101), ( 004), ( 200), (105), and (211) crystal planes of anatase TiO 2 (JCPDS 21-1272), respectively 30.Anatase is the unique phase in all samples except for P25-0.2HFwhich shows the presence of anatase and rutile.Apparently, the (004) diffraction peak of TiO 2 -0.2HF becomes broader, which indicates massive appearance of (001) facets 21.Typical anatase phase is revealed from the appearing peaks at about 144 (E g ), 394 (B 1g ), 514 (A 1g ), and 636 cm -1 (E g ) in Fig. 1b.We can easily observe that the E g peaks (144 cm -1 ) of TiO 2 -0.2HF is the lowest.It has been known that E g and B 1g peaks is mainly caused by symmetric stretching vibration and bending vibration of O Ti O, while A 1g peak is caused by anti-symmetric bending vibration of O Ti O 48.The vibration models of anatase TiO 2 (101) and (001) facets were different with that of no (001) facets exposed, and the intensity of the symmetric stretching vibration modes of O Ti O becomes weak when the (001) facets exist 49.In a word, the higher the percentage of (001) facets, the weaker the intensity of the symmetric stretching vibration modes of O Ti O will be, and correspondingly, the intensity of the E g peaks in the Raman spectra decreased.The information provided from Raman spectroscopy is in agreement with the above XRD results, and the enlarged XRD patterns and Raman spectra are shown in Fig. S1. The XPS analysis in Fig. 2 gives the surface composition and chemical status of TiO 2 -0.2HF.Four XPS plots of Ti2p, O1s, F1s, and Pt4f are presented.The binding energy of Ti2p 3/2 and Ti2p 1/2 (Fig. 2a) is located at 458.4 and 464.1 eV 44, indicating the oxidation state of the Ti element is the same as that of bulk TiO 2 .The O1 s peaks consisted of a dominant peak at 529.5 eV and another higher energy peak at 531.9 eV, which can be indexed to Ti-O bonding and surface O H bonding of TiO 2 -0.2HF, respectively (Fig. 2b) 44,50.Simultaneously, the existence of F is detected, and the F 1 s peak at the binding energy of 684.1 eV in Fig. 2c is a typical value for Ti-F species on the TiO 2 surface 17.The existence of fluorine would affect the properties of catalyst, and the role of F for the photoactivity will be discussed in the following section.The binding energy peak of Pt 4f 7/2 and 4f 5/2 can be observed at 71.4 and 74.9 eV in Fig. 2d, which are in accordance with the standard position of Pt 0 40, and indicating Pt 0 nanoparticles were successfully loaded on TiO 2 -0.2HF surfaces by photo-deposition method. The morphology and microstructure of the products were shown in Fig. 3.As can be seen from Fig. 3a, TiO 2 -0.2HF nanocrystals are consisted of highly dispersed truncated octahedral bipyramid nanoparticles.The mean particle size is calculated to be 10-18 nm with more than 100 nanoparticles from TEM images (Fig. S2).The HRTEM image (Fig. 3b) shows that the lattice spacing parallel to the top and bottom facets is ca.0.235 nm, which corresponds to the (001) planes of anatase TiO 2 .Another set of lattice fringes with the spacing of 0.351 nm corresponding with the (101) planes was also clearly revealed from the picture.And the crystal orientation of ( 101) and (001) faces with an interfacial angle of 68.3 , which indicates the top and bottom facets of the truncated octahedral bipyramid TiO 2 are the (001) facets, the lateral isosceles trapezoid corresponds to (101) facet 20.On the basis of the above truncated octahedral bipyramid structural information, the percentage of the (001) facets in TiO 2 -0.2HF was estimated to be 51 as calculated by a reported method 51.As can be seen in Fig. 3c andd of TiO 2 -0HF catalyst, the octahedral bipyramid TiO 2 -0HF nanocrystals exposing with a great deal of (101) facets, and the average particle size is 11-17 nm (Fig. S2).The information further confirms the contribution of F -to the exposure of (001) facets.TEM images of TiO 2 -xHF (x is 0.1, 0.5, 1 and 1.5) are shown in Fig. S3.The dimension of the TiO 2 nanocrystal grew up apparently with the augment of HF.The nanoparticles aggregated seriously to about 30 nm and the proportion of (001) facets decreased to 8 when 1.5 mL was added to the reaction.The amount of HF has a large effect on the morphology and size of the TiO 2 nanocrystals, and the detailed information was listed in the following Table 1. Pt often plays a crucial role for the improvement of the photoactivity, especially for the deep reduction of CO 2 to CH 4 in the photoreduction of CO 2 .Fig. 3e andf showed that Pt 0 nanoparticles were uniformly deposited on the TiO 2 -0.2HF surfaces and the average particle size was 1-2 nm.Highly dispersed Pt 0 nanoparticles are beneficial for the accumulation of electrons, which can promote the separation of electrons and holes, and then further enhance the reduction of CO 2 ; while Pt 0 on the TiO 2 -0HF surfaces aggregates to 4-6 nm as shown in Fig. 3g andh.It is conventional understanding that (101) facets should have more strongly reductive electrons because their bottom of CB in the order (101)(001) 52.Therefore, (101) facets with a Pt-loading are easier to form Pt aggregates on the surfaces due to their different surface electronic structures and reconstructions during the Pt deposition process. Fig. 4 displays N 2 adsorption-desorption isotherms and the corresponding pore size distribution curve for the prepared TiO 2 samples.All of the samples exhibited similar type-IV isotherms with an H3 hysteresis loop at a relative pressure range of 0.7-0.95according to the IUPAC classification, which are typical characters of mesoporous materials 53.Pore size distribution curve (insert) of the TiO 2 -0.2HF sample, with a peak at 8.6 nm, was achieved through BJH analysis.Quantitative details on BET surface areas, pore volume and average pore size of the TiO 2 samples are presented in Table 1.The BET surface areas of catalysts from NTA precursor are larger than P25 and P25-0.2HFexcept TiO 2 -1.5HF.With the increasing of HF from 0 to 1 mL, the surface areas of the samples decreased a little sequentially.However, the specific surface areas of TiO 2 -1.5HF (53 m 2 /g) apparently decreased about two times than that of TiO 2 -0HF (92 m 2 /g), which is caused by plenty of HF, through selectively corroding (001) facets and leading to irreg- ular growth of TiO 2 nanoparticles (TEM images of TiO 2 -1.5HF was shown in Fig. S2).The average pore size of TiO 2 -0.2HF is 8.6 nm larger than any other sample, which is beneficial for adsorption of CO 2 . The UV-vis optical absorption spectra obtained by the diffuse reflectance of as-prepared TiO 2 are shown in Fig. 5.The onset of the absorption edge for TiO 2 -0HF is at ca. 410 nm, which is consistent with the band gap of anatase TiO 2 (3.02 eV).Compared with TiO 2 -0HF, the absorption edge of TiO 2 -xHF has not an obvious shift.Surprisingly, absorption intensity of TiO 2 -0.2HF is significantly higher than that of other samples, which is due to the exposure of abundant (001) facets.The high density of active unsaturated coordination Ti atoms and the presence of enlarged Ti O Ti bond angles on the (001) facets surface, which make the existence of oxygen defects 54.Based on the analysis above, it can be con-cluded that the TiO 2 -0.2HF might result in the efficient utilization of UV-vis light and exhibit high photocatalytic activities. The CO 2 photoreduction performance of the catalysts was shown in Fig. 6.Both reactions under light without the catalysts and in dark with the catalysts were tested as contrast experiment.A very trace amount of CH 4 or CO was detected in the two comparison tests, indicating that the reaction was indeed a photocatalytic process. All of the prepared TiO 2 nanocrystals exhibited photocatalytic activity that was significantly better than the commercial P25, because of the anatase phase structure.The conduction band edge potential of anatase TiO 2 is more negative vs normal hydrogen electrode (NHE) than the CO 2 /CH 4 reduction potential, thus, the anatase TiO 2 can efficiently reduce CO 2 into CH 4 under Hg lamp irradiation 13.Although BET surface area of TiO 2 -0HF was higher, the photoreduction CO 2 activity on TiO 2 nanocrystals with exposed (001) facets was much higher than its except TiO 2 -1.5HF.This indicated (001) facets played a key role in the enhancement of the photoactivity.The photocatalytic activity of these catalyst samples can be rationalized as TiO 2 -0.2HF TiO 2 -0.1HFTiO 2 -0.5HF TiO 2 -0.5HFTiO 2 -1HF TiO 2 -0HF displayed in Fig. 6.Based on the DFT calculations, the (101) and (001) facets of anatase TiO 2 exhibit different band structures and band edge positions 31.Thus, the coexposed (101) and (001) facets of anatase can form a surface heterojunction within a single TiO 2 particle, which is beneficial for the transfer of photogenerated electrons to (101) and holes to (001) facets, respectively 31.TiO 2 -0.2HF has the highest CH 4 production rate of 1.58 mol h -1 g -1 , which was owing to the optimal ratio of the ( 001) and (101) facets.However, the inferior photocatalytic activity of TiO 2 -1.5HF than TiO 2 -0HF was on account of two reasons: one is the smaller specific surface area of the later, and the other is deficiencies appeared on the surface of TiO 2 -1.5HF with the corrosion of HF, which enhanced the recombination of photo-generated carriers and reducing the photoactivity.Considering the impact of fluorine on photoactivity of the catalyst, while defluorination may change the morphology and surface state of TiO 2 , the catalytic activity of P25-0.2HF was tested under the same conditions, and a slightly higher photocatalytic CH 4 production rate (0.21 mol h -1 g -1 ) was obtained than 0.1 mol h -1 g -1 of P25, which indicated the present of appropriate F on the surface was favourable to enhance CO 2 photoreduction.Surface Ti-F electronegative groups can act as trapping sites for photo-generated electrons and facilitate transfer to surface-adsorbed CO 2 molecules 42.It is worth mentioning that a novel anatase TiO 2 was obtained by dehydration of NTA at elevated temperature which contains high concentration of single-electron-trapped oxygen vacancies (Vo ) in our previous study 46,47.Here we also tested single-electrontrapped oxygen vacancies (Vo ) of TiO 2 -0HF and TiO 2 -0.2HF, as shown in Fig. S4.A large amount of Vo exist in the bulk of TiO 2 -0HF, as for TiO 2 -0.2HF samples, there exist a little Vo .This predicts the existence of HF can significantly reduce the defect in the bulk phase of the TiO 2 (Vo ).Consequently, it helps reduce the probability of electron hole recombination in the compound, and prompt charge carriers participating into the photocatalytic redox reaction.Based on the above discussion, the photocatalytic activity of the TiO 2 samples is strongly affected by many factors, including the optimum ratio of the exposed (001) to (101) facets, and surface area, crystal structure of catalyst and appropriate amount of F. Surface heterojunction between (001) and (101) facets of TiO 2 nanocrystals is one of most important reasons (seen from the following PL and EIS spectra). To confirm that CH 4 is formed from CO 2 , we have compared the rates of CH 4 formation in the presence of H 2 O instead of KHCO 3 solution under CO 2 atmospheres, and the formation rate of CH 4 of TiO 2 -0.2HF catalyst reached to 1.56 mol h -1 g -1 , which is equivalent to the production rate of CH 4 (1.58 mol h -1 g -1 ) in KHCO 3 solution.In addition, when the reactor was filled with N 2 (instead of CO 2 ) in KHCO 3 solution, no carbon-containing compounds were detected either (Table 2).The results illustrate that the C species in the photocatalytic products of CH 4 comes from CO 2 .uniformly distributed Pt nanoparticles on the TiO 2 -0.2HF surface, as above mentioned (TEM).The AQE based on CH 4 production over Pt-TiO 2 -0.2HF was calculated to be 0.22 (details displayed in Supporting Information).As shown in inset of Fig. 7, the stability test of Pt-TiO 2 -0.2HF was conducted by cycle reaction, and each cycle was performed for 6 h.After each cycle, CH 4 in the system was degassed by N 2 and then CO 2 was reintroduced into the reactor.The rates of CH 4 formation declined apparently in the second reaction, but it did not show significant change in the subsequent cycles.After four cycles of reaction, the formation rate of CH 4 of Pt-TiO 2 -0.2HF catalyst reached to 3.15 mol h -1 g -1 .Indeed, there are many factors affecting the photocatalytic activities, for this sample, the decrease of photoactivity was possibly attributed to either the inactivation of some active sites or the structural change of the catalyst in the reaction process.IR and XPS experiments were carried out to detect surface species of recycled catalysts, but no apparent change was observed (Fig. S5).We believed that the decrease in activity was typically resulted in the TiO 2 nanoparticles aggregated in aqueous solution after a long time.In order to prove our conjecture, the recycled catalyst is characterized by N 2 adsorption-desorption isotherms, the specific surface areas of the recycled catalyst (75 m 2 /g) decreased apparently compared with that of original catalyst (90 m 2 /g), and the decreased percentage of the specific surface areas is approximately equal with the decline yield of catalytic activity. The feasibility of H 2 and O 2 production is investigated with a gas chromatography (GC 7920, Beijing, China) during the process of photoreduction CO 2 .The formation rate of H 2 of Pt-TiO 2 -0.2HF cat- alyst reached to 0.92 mol h -1 g -1 , which is significantly inferior to the production rate of CH 4 (4 mol h -1 g -1 ).Based on the literature results 55,56, we believe the relatively lower yield of H 2 production in this work is possibly due to the following two reasons: (1) protons or To further evaluate the photocatalytic performance in liquid phase, we examined photocatalytic activity of the as-prepared TiO 2 -xHF samples by methylene blue (MB) degradation.As shown in Fig. S6, TiO 2 -0.2HF also shows the superior photocatalytic activity and the degradation rate is up to nearly 90 within 10 min under Xe arc lamp irradiation.This also further revealed TiO 2 -0.2HF with proper ratio (001) facets has a broad application. In the photocatalytic reactions, the separation of carriers is one of the effective factors to enhance the photocatalytic reactivity, especially in photoreduction CO 2 reactions.The photoluminescence (PL) emission mainly results from the recombination of excited electrons and holes, which can be considered as an effective approach for understanding the separation capacity of the photoinduced carriers.A low PL intensity also indicates the decrease in recombination rate 59,60.Fig. 8 shows the fluorescence spectra of the samples in a wavelength range of 350-550 nm.It can be seen that all the peaks displayed similar shapes, and three main characteristic peaks appeared at 398, 451, and 468 nm, which was corresponding to the energy levels of 3.12, 2.75, and 2.65 eV, respectively.That's to say, fluorescence peaks at 398 attributed to the emission peak towards excitation the band gap of anatase TiO 2 , and the other two fluorescence peaks derived from band-to-band transition of free carriers 61.The TiO 2 -0.2HF sample has the weakest PL emission probably because of the relatively low electrons and holes recombination rate.PL measurement results are in consistent with the order of the photocatalytic activity.EIS spectra is often used for characterizing the conductivity of an electrode, a small circular radius usually shows a lower charge transfer resistance 62.Fig. 9 shows the Nyquist plots of different samples, TiO 2 -1.5HF and TiO 2 -0HF show large semicircles, which is due to the higher percentage of the exposed (101) facets on the TiO 2 sample, which plays the role of recombination centres for photogenerated carriers and thus inhibit the charge separation.The better activity of TiO 2 -0HF than TiO 2 -1.5HF may be on account of the larger surface area.At the same time, it can obviously be seen that semicircles of TiO 2 -1HF, TiO 2 -0.5HF,TiO 2 -0.1HF modified electrodes decreased, which can be mainly attributed to surface heterojunction between (001) and (101) facets of TiO 2 .Interestingly, the impedance arc radius of TiO 2 -0.2HF is the smallest among samples implying that the highest separation efficiency of photogenerated electron-hole pairs was achieved from TiO 2 -0.2HF.This is attributed to the appropriate proportion between (001) and (101) facets, which extremely prevents the direct recombination of electrons and holes. The schematic diagram of proposed mechanism of CO 2 photoreduction process is shown in Fig. 10.When the ultrafine applanate truncated octahedral bipyramid TiO 2 nanocrystals was irradiated by Hg lamp, photo-induced electrons and holes were produced.The photogenerated electrons on the (001) facets could transport to the (101) facets due to their conduction band offset, and then react with the adsorbed CO 2 to generate CH 4 subsequently.Correspondingly, the photogenerated holes on the (101) facets could transfer to the (001) facets, and then react with the adsorbed H 2 O to generate O 2 and H .After loading of Pt nanoparticles, photo-generated electrons can be easily trapped by Pt because of its lower Fermi energy level, improving the separation efficiency of the photo-generated electron-hole pairs, and then the photoreduction rate of CO 2 to CH 4 was accelerated."}, {"llm generation": "Pt nanoparticles", "source": "The photoreduction rate of CO 2 to CH 4 reached to 1.58 mol h -1 g -1 on TiO 2 -0.2HF, and the photoactivity increased remarkably to 4.0 mol h -1 g -1 after loaded Pt nanoparticles.", "context": "In brief, ultrafine anatase TiO 2 nanocrystals with controllable coexposed (001) and (101) facets were prepared by a facile solvothermol strategy.1D NTA transformed to applanate truncated octahedral bipyramid TiO 2 nanocrystals, and the percentage of (001) facets can be adjusted from 5 to 51.TiO 2 -0.2HF with 51 of (001) facets and 49 (101) facets exhibited the highest photocatalytic activity in terms of both photoreduction CO 2 and photodegradation of MB.PL and EIS spectra results proved that the efficient surface heterojunctions between (001) and (101) facets are favourable for the separation of photogenerated charge carriers.What is more, the smaller size reduces recombination probability of photocarriers in the bulk.The photoreduction rate of CO 2 to CH 4 reached to 1.58 mol h -1 g -1 on TiO 2 -0.2HF, and the photoactivity increased remarkably to 4.0 mol h -1 g -1 after loaded Pt nanoparticles.In addition, the efficiency could remain nearly 80 after four cycle reactions, indicating the catalyst has a long-term stability.Moreover, little HF dosage is beneficial for subsequent industrial production, and this kind of ultrafine TiO 2 nanocrystals with surface heterojunction is potential for the development of solar cells, optoelectronic devices, sensors and heterogeneous catalysts. Fig. 1.XRD and Raman patterns of the photocatalysts. Fig. 2. XPS spectra of Ti2p (a), O1 s (b), F1 s (c) and Pt4f (d) in Pt-TiO2-0.2HFsample. Fig. 3. TEM and HRTEM images of TiO2-0.2HF(a, b), TiO2-0HF (c, d), Pt-TiO2-0.2HF(e, f), Pt-TiO2-0HF (g, h). Fig. 6.Photocatalytic activity of CH4 production rate of P25, P25-0.2HF and TiO2-xHF samples. Fig. 7. CH4 production rate of Pt-P25, TiO2-0HF and TiO2-0.2HFsamples and the inset displays the stability of Pt-TiO2-0.2HFnanoparticles on CO2 photoreduction in the consecutive four cycles. Fig. 8. PL spectra of the TiO2-xHF photocatalysts (excitated wavelength: 315 nm). Fig. 9. Nyquist plots of the TiO2-xHF samples. Fig. 10.Schematic diagram of mechanism of photocatalytic process. Effect of different volume of HF on the structural of TiO2 nanocystals. H radicals formed by the photodissociation of water are competitively consumed by CO 2 reduction intermediates like CO 2 to produce CH 4 ; (2) the produced H 2 could be consumed by reverse reactions with CO or O 2 .The formation rate of O 2 of Pt-TiO 2 -0.2HF catalyst reached to 5.2 mol h -1 g -1 , which is a little higher than the production rate of CH 4 (4 mol h -1 g -1 ).The production rate of O 2 and CH 4 is not in accordance with the molar ratio, which is possibly caused by the consumption of residual O 2 in the reactor through the reaction with photogenerated electrons: O 2 e - O 2 The authors gratefully acknowledge the support of the National Natural Science Foundation of China (Nos.21103042 and 21471047), Program for Science Technology Innovation Talents (15HASTIT043) and Innovative Research Team (16IRTSTHN015) from the University of Henan Province, and Program for Changjiang Scholars and Innovative Research Team in University from the Ministry of Education of China (PCS IRT1126). The manuscript was written through contributions of all authors.Yuhui Cao carried out the total experiment and wrote the first manuscript.Chen Li and Junli Li participated in the data analysis.Qiuye Li supervised the project.Jianjun Yang provided the facilities and discussions related to them.All authors read and approved the final manuscript. Supplementary data associated with this article can be found, in the online version, at http://dx.doi.org/10.1016/j.apcatb.2016.05.071."}], "light source": [{"llm generation": "UV-Vis", "source": "The photocatalytic reaction was typically performed at room temperature for 6 h using a high pressure Hg lamp (250 W).", "context": "NTA were synthesized by the hydrothermal process in a concentrated NaOH aqueous solution, a commercial titania P25 was used as the Ti source 46.Typically, 3 g of P25 was mixed with 300 mL of 10 M NaOH aqueous solution, and followed by the hydrother-mal treatment at 120 C in Teflon-lined autoclave for 24 h.The obtained precipitate was washed with deionized water thoroughly until pH 7, and followed by a filtration process.Then the resulting product was put into 300 mL hydrochloric acid aqueous solution (pH 1) and stirring for 8 h.At last, the precipitates were washed with distilled water until no Cl -was detectable.Then, the product was dried in an oven at 100 C for overnight. In a typical synthesis, 1 g of NTA powders were dispersed into 25 mL of absolute isopropanol and stirred for 30 min, and after that, x mL (x is 0, 0.1, 0.2, 0.5, 1 and 1.5) of HF (40 wt) was added slowly to the suspension, respectively.Then, the suspension was transferred into 50 mL Teflon-lined autoclave and kept at 200 C for 24 h.After the solvothermal reaction, the resulting precipitates were collected and washed with ethanol and distilled water for several times.Then, the samples were dried in an oven at 80 C. The obtained samples were denoted as TiO 2 -0HF, TiO 2 -0.1HF,TiO 2 -0.2HF,TiO 2 -0.5HF,TiO 2 -1HF and TiO 2 -1.5HF, respectively.As a reference, the fluorinated P25 was also prepared by the same process in absolute isopropanol adding 0.2 mL of HF (40 wt), which was denoted as P25-0.2HF. For further improving the photocatalytic efficiency, 1 wt Pt nanoparticles were loaded on the surface of as-prepared samples as the cocatalyst by the in-situ photoreduction method.The corresponding products were denoted as Pt-TiO 2 -0HF, Pt-TiO 2 -0.2HF and Pt-P25, respectively. X-ray diffraction (XRD) patterns were measured on a Bruker Apex II diffractometer (CuK radiation, 2A range 20 -80 , step size 0.08 , accelerating voltage 40 kV, applied current 40 mA).Raman measurement was carried out using a Renishaw inVia Raman spectroscopy, the power of the laser was 1, and the laser excitation was 532 nm, wavenumber range (100-800 cm -1 ), and the exposure time was 1 s.The surface area, pore size, and pore volume of the samples were analyzed by nitrogen adsorption at 77 K with the Brunauer-Emmett-Teller (BET) method (Micromeritics, ASAP 2020).Transmission electron microscopic (TEM) images were taken on a JEM-2010 electron microscope at 200 kV.X-ray photoelectron spectroscopy (XPS) measurements were investigated on a Thermo ESCALAB 250Xi with Al K emission at 1486.6 eV, and all of the binding energies were calibrated by C 1 s at 284.8 eV.UV-visible diffuse reflectance spectra (UV-vis DRS) were obtained on a Shimadzu U-3010 spectrometer, using BaSO 4 as a reference.The electron spin resonance (ESR) signals of the samples were tested on a JES FA200 spectrometer at room temperature.The photoluminescence (PL) spectra were recorded on a F-7000 FL spectrophotometer by a typical benchtop fluorimeter (equipped with a 150 W Xe lamp source, using an excitated wavelength of 315 nm). Photoelectrochemical measurements were conducted in a conventional three-electrode system with 1 M Na 2 SO 3 electrolyte on the electrochemical workstation (IM6eX Instruments, ZAHNER, German).The suspension with the obtained sample (0.02 g) and ethanol (0.5 mL) was coated onto a 1 cm 1.1 cm fluorine-tin oxide (FTO) glass as the working electrode, a Pt mesh and an Ag/AgCl electrode (SCE) acting as the counter electrode and reference electrode, respectively.Electrochemical impedance spectroscopy (EIS) experiments were conducted at the bias of 0.4 V and a 250 W Hg lamp was employed as photon source. Photocatalytic activity was conducted in a closed reactor with the inner capacity of 200 mL containing 125 mL 0.1 M KHCO 3 solution.0.1 g catalyst was put into the reactor and then ultrasonic to disperse evenly.The ultrapure gaseous CO 2 was flowed through the solution under stirring for 1 h, until it achieved saturated state.The photocatalytic reaction was typically performed at room temperature for 6 h using a high pressure Hg lamp (250 W).The outputs were analyzed by a gas chromatography (GC 9790, Zhejiang, China)."}, {"llm generation": "UV", "source": "Fig. 8. PL spectra of the TiO2-xHF photocatalysts (excitated wavelength: 315 nm).", "context": "In brief, ultrafine anatase TiO 2 nanocrystals with controllable coexposed (001) and (101) facets were prepared by a facile solvothermol strategy.1D NTA transformed to applanate truncated octahedral bipyramid TiO 2 nanocrystals, and the percentage of (001) facets can be adjusted from 5 to 51.TiO 2 -0.2HF with 51 of (001) facets and 49 (101) facets exhibited the highest photocatalytic activity in terms of both photoreduction CO 2 and photodegradation of MB.PL and EIS spectra results proved that the efficient surface heterojunctions between (001) and (101) facets are favourable for the separation of photogenerated charge carriers.What is more, the smaller size reduces recombination probability of photocarriers in the bulk.The photoreduction rate of CO 2 to CH 4 reached to 1.58 mol h -1 g -1 on TiO 2 -0.2HF, and the photoactivity increased remarkably to 4.0 mol h -1 g -1 after loaded Pt nanoparticles.In addition, the efficiency could remain nearly 80 after four cycle reactions, indicating the catalyst has a long-term stability.Moreover, little HF dosage is beneficial for subsequent industrial production, and this kind of ultrafine TiO 2 nanocrystals with surface heterojunction is potential for the development of solar cells, optoelectronic devices, sensors and heterogeneous catalysts. Fig. 1.XRD and Raman patterns of the photocatalysts. Fig. 2. XPS spectra of Ti2p (a), O1 s (b), F1 s (c) and Pt4f (d) in Pt-TiO2-0.2HFsample. Fig. 3. TEM and HRTEM images of TiO2-0.2HF(a, b), TiO2-0HF (c, d), Pt-TiO2-0.2HF(e, f), Pt-TiO2-0HF (g, h). Fig. 6.Photocatalytic activity of CH4 production rate of P25, P25-0.2HF and TiO2-xHF samples. Fig. 7. CH4 production rate of Pt-P25, TiO2-0HF and TiO2-0.2HFsamples and the inset displays the stability of Pt-TiO2-0.2HFnanoparticles on CO2 photoreduction in the consecutive four cycles. Fig. 8. PL spectra of the TiO2-xHF photocatalysts (excitated wavelength: 315 nm). Fig. 9. Nyquist plots of the TiO2-xHF samples. Fig. 10.Schematic diagram of mechanism of photocatalytic process. Effect of different volume of HF on the structural of TiO2 nanocystals. H radicals formed by the photodissociation of water are competitively consumed by CO 2 reduction intermediates like CO 2 to produce CH 4 ; (2) the produced H 2 could be consumed by reverse reactions with CO or O 2 .The formation rate of O 2 of Pt-TiO 2 -0.2HF catalyst reached to 5.2 mol h -1 g -1 , which is a little higher than the production rate of CH 4 (4 mol h -1 g -1 ).The production rate of O 2 and CH 4 is not in accordance with the molar ratio, which is possibly caused by the consumption of residual O 2 in the reactor through the reaction with photogenerated electrons: O 2 e - O 2 The authors gratefully acknowledge the support of the National Natural Science Foundation of China (Nos.21103042 and 21471047), Program for Science Technology Innovation Talents (15HASTIT043) and Innovative Research Team (16IRTSTHN015) from the University of Henan Province, and Program for Changjiang Scholars and Innovative Research Team in University from the Ministry of Education of China (PCS IRT1126). The manuscript was written through contributions of all authors.Yuhui Cao carried out the total experiment and wrote the first manuscript.Chen Li and Junli Li participated in the data analysis.Qiuye Li supervised the project.Jianjun Yang provided the facilities and discussions related to them.All authors read and approved the final manuscript. Supplementary data associated with this article can be found, in the online version, at http://dx.doi.org/10.1016/j.apcatb.2016.05.071."}], "lamp": [{"llm generation": "Mercury", "source": "The photocatalytic reaction was typically performed at room temperature for 6 h using a high pressure Hg lamp (250 W).", "context": "NTA were synthesized by the hydrothermal process in a concentrated NaOH aqueous solution, a commercial titania P25 was used as the Ti source 46.Typically, 3 g of P25 was mixed with 300 mL of 10 M NaOH aqueous solution, and followed by the hydrother-mal treatment at 120 C in Teflon-lined autoclave for 24 h.The obtained precipitate was washed with deionized water thoroughly until pH 7, and followed by a filtration process.Then the resulting product was put into 300 mL hydrochloric acid aqueous solution (pH 1) and stirring for 8 h.At last, the precipitates were washed with distilled water until no Cl -was detectable.Then, the product was dried in an oven at 100 C for overnight. In a typical synthesis, 1 g of NTA powders were dispersed into 25 mL of absolute isopropanol and stirred for 30 min, and after that, x mL (x is 0, 0.1, 0.2, 0.5, 1 and 1.5) of HF (40 wt) was added slowly to the suspension, respectively.Then, the suspension was transferred into 50 mL Teflon-lined autoclave and kept at 200 C for 24 h.After the solvothermal reaction, the resulting precipitates were collected and washed with ethanol and distilled water for several times.Then, the samples were dried in an oven at 80 C. The obtained samples were denoted as TiO 2 -0HF, TiO 2 -0.1HF,TiO 2 -0.2HF,TiO 2 -0.5HF,TiO 2 -1HF and TiO 2 -1.5HF, respectively.As a reference, the fluorinated P25 was also prepared by the same process in absolute isopropanol adding 0.2 mL of HF (40 wt), which was denoted as P25-0.2HF. For further improving the photocatalytic efficiency, 1 wt Pt nanoparticles were loaded on the surface of as-prepared samples as the cocatalyst by the in-situ photoreduction method.The corresponding products were denoted as Pt-TiO 2 -0HF, Pt-TiO 2 -0.2HF and Pt-P25, respectively. X-ray diffraction (XRD) patterns were measured on a Bruker Apex II diffractometer (CuK radiation, 2A range 20 -80 , step size 0.08 , accelerating voltage 40 kV, applied current 40 mA).Raman measurement was carried out using a Renishaw inVia Raman spectroscopy, the power of the laser was 1, and the laser excitation was 532 nm, wavenumber range (100-800 cm -1 ), and the exposure time was 1 s.The surface area, pore size, and pore volume of the samples were analyzed by nitrogen adsorption at 77 K with the Brunauer-Emmett-Teller (BET) method (Micromeritics, ASAP 2020).Transmission electron microscopic (TEM) images were taken on a JEM-2010 electron microscope at 200 kV.X-ray photoelectron spectroscopy (XPS) measurements were investigated on a Thermo ESCALAB 250Xi with Al K emission at 1486.6 eV, and all of the binding energies were calibrated by C 1 s at 284.8 eV.UV-visible diffuse reflectance spectra (UV-vis DRS) were obtained on a Shimadzu U-3010 spectrometer, using BaSO 4 as a reference.The electron spin resonance (ESR) signals of the samples were tested on a JES FA200 spectrometer at room temperature.The photoluminescence (PL) spectra were recorded on a F-7000 FL spectrophotometer by a typical benchtop fluorimeter (equipped with a 150 W Xe lamp source, using an excitated wavelength of 315 nm). Photoelectrochemical measurements were conducted in a conventional three-electrode system with 1 M Na 2 SO 3 electrolyte on the electrochemical workstation (IM6eX Instruments, ZAHNER, German).The suspension with the obtained sample (0.02 g) and ethanol (0.5 mL) was coated onto a 1 cm 1.1 cm fluorine-tin oxide (FTO) glass as the working electrode, a Pt mesh and an Ag/AgCl electrode (SCE) acting as the counter electrode and reference electrode, respectively.Electrochemical impedance spectroscopy (EIS) experiments were conducted at the bias of 0.4 V and a 250 W Hg lamp was employed as photon source. Photocatalytic activity was conducted in a closed reactor with the inner capacity of 200 mL containing 125 mL 0.1 M KHCO 3 solution.0.1 g catalyst was put into the reactor and then ultrasonic to disperse evenly.The ultrapure gaseous CO 2 was flowed through the solution under stirring for 1 h, until it achieved saturated state.The photocatalytic reaction was typically performed at room temperature for 6 h using a high pressure Hg lamp (250 W).The outputs were analyzed by a gas chromatography (GC 9790, Zhejiang, China)."}, {"llm generation": "Mercury, Xenon", "source": "The conduction band edge potential of anatase TiO 2 is more negative vs normal hydrogen electrode (NHE) than the CO 2 /CH 4 reduction potential, thus, the anatase TiO 2 can efficiently reduce CO 2 into CH 4 under Hg lamp irradiation 13.", "context": "The crystal structures of the prepared materials were confirmed by XRD and Raman spectroscopy.Fig. 1a shows the XRD plots of all samples.The peaks at 25.25, 37.72, 48.03, 53.91, and 54.99 Can be assigned to (101), ( 004), ( 200), (105), and (211) crystal planes of anatase TiO 2 (JCPDS 21-1272), respectively 30.Anatase is the unique phase in all samples except for P25-0.2HFwhich shows the presence of anatase and rutile.Apparently, the (004) diffraction peak of TiO 2 -0.2HF becomes broader, which indicates massive appearance of (001) facets 21.Typical anatase phase is revealed from the appearing peaks at about 144 (E g ), 394 (B 1g ), 514 (A 1g ), and 636 cm -1 (E g ) in Fig. 1b.We can easily observe that the E g peaks (144 cm -1 ) of TiO 2 -0.2HF is the lowest.It has been known that E g and B 1g peaks is mainly caused by symmetric stretching vibration and bending vibration of O Ti O, while A 1g peak is caused by anti-symmetric bending vibration of O Ti O 48.The vibration models of anatase TiO 2 (101) and (001) facets were different with that of no (001) facets exposed, and the intensity of the symmetric stretching vibration modes of O Ti O becomes weak when the (001) facets exist 49.In a word, the higher the percentage of (001) facets, the weaker the intensity of the symmetric stretching vibration modes of O Ti O will be, and correspondingly, the intensity of the E g peaks in the Raman spectra decreased.The information provided from Raman spectroscopy is in agreement with the above XRD results, and the enlarged XRD patterns and Raman spectra are shown in Fig. S1. The XPS analysis in Fig. 2 gives the surface composition and chemical status of TiO 2 -0.2HF.Four XPS plots of Ti2p, O1s, F1s, and Pt4f are presented.The binding energy of Ti2p 3/2 and Ti2p 1/2 (Fig. 2a) is located at 458.4 and 464.1 eV 44, indicating the oxidation state of the Ti element is the same as that of bulk TiO 2 .The O1 s peaks consisted of a dominant peak at 529.5 eV and another higher energy peak at 531.9 eV, which can be indexed to Ti-O bonding and surface O H bonding of TiO 2 -0.2HF, respectively (Fig. 2b) 44,50.Simultaneously, the existence of F is detected, and the F 1 s peak at the binding energy of 684.1 eV in Fig. 2c is a typical value for Ti-F species on the TiO 2 surface 17.The existence of fluorine would affect the properties of catalyst, and the role of F for the photoactivity will be discussed in the following section.The binding energy peak of Pt 4f 7/2 and 4f 5/2 can be observed at 71.4 and 74.9 eV in Fig. 2d, which are in accordance with the standard position of Pt 0 40, and indicating Pt 0 nanoparticles were successfully loaded on TiO 2 -0.2HF surfaces by photo-deposition method. The morphology and microstructure of the products were shown in Fig. 3.As can be seen from Fig. 3a, TiO 2 -0.2HF nanocrystals are consisted of highly dispersed truncated octahedral bipyramid nanoparticles.The mean particle size is calculated to be 10-18 nm with more than 100 nanoparticles from TEM images (Fig. S2).The HRTEM image (Fig. 3b) shows that the lattice spacing parallel to the top and bottom facets is ca.0.235 nm, which corresponds to the (001) planes of anatase TiO 2 .Another set of lattice fringes with the spacing of 0.351 nm corresponding with the (101) planes was also clearly revealed from the picture.And the crystal orientation of ( 101) and (001) faces with an interfacial angle of 68.3 , which indicates the top and bottom facets of the truncated octahedral bipyramid TiO 2 are the (001) facets, the lateral isosceles trapezoid corresponds to (101) facet 20.On the basis of the above truncated octahedral bipyramid structural information, the percentage of the (001) facets in TiO 2 -0.2HF was estimated to be 51 as calculated by a reported method 51.As can be seen in Fig. 3c andd of TiO 2 -0HF catalyst, the octahedral bipyramid TiO 2 -0HF nanocrystals exposing with a great deal of (101) facets, and the average particle size is 11-17 nm (Fig. S2).The information further confirms the contribution of F -to the exposure of (001) facets.TEM images of TiO 2 -xHF (x is 0.1, 0.5, 1 and 1.5) are shown in Fig. S3.The dimension of the TiO 2 nanocrystal grew up apparently with the augment of HF.The nanoparticles aggregated seriously to about 30 nm and the proportion of (001) facets decreased to 8 when 1.5 mL was added to the reaction.The amount of HF has a large effect on the morphology and size of the TiO 2 nanocrystals, and the detailed information was listed in the following Table 1. Pt often plays a crucial role for the improvement of the photoactivity, especially for the deep reduction of CO 2 to CH 4 in the photoreduction of CO 2 .Fig. 3e andf showed that Pt 0 nanoparticles were uniformly deposited on the TiO 2 -0.2HF surfaces and the average particle size was 1-2 nm.Highly dispersed Pt 0 nanoparticles are beneficial for the accumulation of electrons, which can promote the separation of electrons and holes, and then further enhance the reduction of CO 2 ; while Pt 0 on the TiO 2 -0HF surfaces aggregates to 4-6 nm as shown in Fig. 3g andh.It is conventional understanding that (101) facets should have more strongly reductive electrons because their bottom of CB in the order (101)(001) 52.Therefore, (101) facets with a Pt-loading are easier to form Pt aggregates on the surfaces due to their different surface electronic structures and reconstructions during the Pt deposition process. Fig. 4 displays N 2 adsorption-desorption isotherms and the corresponding pore size distribution curve for the prepared TiO 2 samples.All of the samples exhibited similar type-IV isotherms with an H3 hysteresis loop at a relative pressure range of 0.7-0.95according to the IUPAC classification, which are typical characters of mesoporous materials 53.Pore size distribution curve (insert) of the TiO 2 -0.2HF sample, with a peak at 8.6 nm, was achieved through BJH analysis.Quantitative details on BET surface areas, pore volume and average pore size of the TiO 2 samples are presented in Table 1.The BET surface areas of catalysts from NTA precursor are larger than P25 and P25-0.2HFexcept TiO 2 -1.5HF.With the increasing of HF from 0 to 1 mL, the surface areas of the samples decreased a little sequentially.However, the specific surface areas of TiO 2 -1.5HF (53 m 2 /g) apparently decreased about two times than that of TiO 2 -0HF (92 m 2 /g), which is caused by plenty of HF, through selectively corroding (001) facets and leading to irreg- ular growth of TiO 2 nanoparticles (TEM images of TiO 2 -1.5HF was shown in Fig. S2).The average pore size of TiO 2 -0.2HF is 8.6 nm larger than any other sample, which is beneficial for adsorption of CO 2 . The UV-vis optical absorption spectra obtained by the diffuse reflectance of as-prepared TiO 2 are shown in Fig. 5.The onset of the absorption edge for TiO 2 -0HF is at ca. 410 nm, which is consistent with the band gap of anatase TiO 2 (3.02 eV).Compared with TiO 2 -0HF, the absorption edge of TiO 2 -xHF has not an obvious shift.Surprisingly, absorption intensity of TiO 2 -0.2HF is significantly higher than that of other samples, which is due to the exposure of abundant (001) facets.The high density of active unsaturated coordination Ti atoms and the presence of enlarged Ti O Ti bond angles on the (001) facets surface, which make the existence of oxygen defects 54.Based on the analysis above, it can be con-cluded that the TiO 2 -0.2HF might result in the efficient utilization of UV-vis light and exhibit high photocatalytic activities. The CO 2 photoreduction performance of the catalysts was shown in Fig. 6.Both reactions under light without the catalysts and in dark with the catalysts were tested as contrast experiment.A very trace amount of CH 4 or CO was detected in the two comparison tests, indicating that the reaction was indeed a photocatalytic process. All of the prepared TiO 2 nanocrystals exhibited photocatalytic activity that was significantly better than the commercial P25, because of the anatase phase structure.The conduction band edge potential of anatase TiO 2 is more negative vs normal hydrogen electrode (NHE) than the CO 2 /CH 4 reduction potential, thus, the anatase TiO 2 can efficiently reduce CO 2 into CH 4 under Hg lamp irradiation 13.Although BET surface area of TiO 2 -0HF was higher, the photoreduction CO 2 activity on TiO 2 nanocrystals with exposed (001) facets was much higher than its except TiO 2 -1.5HF.This indicated (001) facets played a key role in the enhancement of the photoactivity.The photocatalytic activity of these catalyst samples can be rationalized as TiO 2 -0.2HF TiO 2 -0.1HFTiO 2 -0.5HF TiO 2 -0.5HFTiO 2 -1HF TiO 2 -0HF displayed in Fig. 6.Based on the DFT calculations, the (101) and (001) facets of anatase TiO 2 exhibit different band structures and band edge positions 31.Thus, the coexposed (101) and (001) facets of anatase can form a surface heterojunction within a single TiO 2 particle, which is beneficial for the transfer of photogenerated electrons to (101) and holes to (001) facets, respectively 31.TiO 2 -0.2HF has the highest CH 4 production rate of 1.58 mol h -1 g -1 , which was owing to the optimal ratio of the ( 001) and (101) facets.However, the inferior photocatalytic activity of TiO 2 -1.5HF than TiO 2 -0HF was on account of two reasons: one is the smaller specific surface area of the later, and the other is deficiencies appeared on the surface of TiO 2 -1.5HF with the corrosion of HF, which enhanced the recombination of photo-generated carriers and reducing the photoactivity.Considering the impact of fluorine on photoactivity of the catalyst, while defluorination may change the morphology and surface state of TiO 2 , the catalytic activity of P25-0.2HF was tested under the same conditions, and a slightly higher photocatalytic CH 4 production rate (0.21 mol h -1 g -1 ) was obtained than 0.1 mol h -1 g -1 of P25, which indicated the present of appropriate F on the surface was favourable to enhance CO 2 photoreduction.Surface Ti-F electronegative groups can act as trapping sites for photo-generated electrons and facilitate transfer to surface-adsorbed CO 2 molecules 42.It is worth mentioning that a novel anatase TiO 2 was obtained by dehydration of NTA at elevated temperature which contains high concentration of single-electron-trapped oxygen vacancies (Vo ) in our previous study 46,47.Here we also tested single-electrontrapped oxygen vacancies (Vo ) of TiO 2 -0HF and TiO 2 -0.2HF, as shown in Fig. S4.A large amount of Vo exist in the bulk of TiO 2 -0HF, as for TiO 2 -0.2HF samples, there exist a little Vo .This predicts the existence of HF can significantly reduce the defect in the bulk phase of the TiO 2 (Vo ).Consequently, it helps reduce the probability of electron hole recombination in the compound, and prompt charge carriers participating into the photocatalytic redox reaction.Based on the above discussion, the photocatalytic activity of the TiO 2 samples is strongly affected by many factors, including the optimum ratio of the exposed (001) to (101) facets, and surface area, crystal structure of catalyst and appropriate amount of F. Surface heterojunction between (001) and (101) facets of TiO 2 nanocrystals is one of most important reasons (seen from the following PL and EIS spectra). To confirm that CH 4 is formed from CO 2 , we have compared the rates of CH 4 formation in the presence of H 2 O instead of KHCO 3 solution under CO 2 atmospheres, and the formation rate of CH 4 of TiO 2 -0.2HF catalyst reached to 1.56 mol h -1 g -1 , which is equivalent to the production rate of CH 4 (1.58 mol h -1 g -1 ) in KHCO 3 solution.In addition, when the reactor was filled with N 2 (instead of CO 2 ) in KHCO 3 solution, no carbon-containing compounds were detected either (Table 2).The results illustrate that the C species in the photocatalytic products of CH 4 comes from CO 2 .uniformly distributed Pt nanoparticles on the TiO 2 -0.2HF surface, as above mentioned (TEM).The AQE based on CH 4 production over Pt-TiO 2 -0.2HF was calculated to be 0.22 (details displayed in Supporting Information).As shown in inset of Fig. 7, the stability test of Pt-TiO 2 -0.2HF was conducted by cycle reaction, and each cycle was performed for 6 h.After each cycle, CH 4 in the system was degassed by N 2 and then CO 2 was reintroduced into the reactor.The rates of CH 4 formation declined apparently in the second reaction, but it did not show significant change in the subsequent cycles.After four cycles of reaction, the formation rate of CH 4 of Pt-TiO 2 -0.2HF catalyst reached to 3.15 mol h -1 g -1 .Indeed, there are many factors affecting the photocatalytic activities, for this sample, the decrease of photoactivity was possibly attributed to either the inactivation of some active sites or the structural change of the catalyst in the reaction process.IR and XPS experiments were carried out to detect surface species of recycled catalysts, but no apparent change was observed (Fig. S5).We believed that the decrease in activity was typically resulted in the TiO 2 nanoparticles aggregated in aqueous solution after a long time.In order to prove our conjecture, the recycled catalyst is characterized by N 2 adsorption-desorption isotherms, the specific surface areas of the recycled catalyst (75 m 2 /g) decreased apparently compared with that of original catalyst (90 m 2 /g), and the decreased percentage of the specific surface areas is approximately equal with the decline yield of catalytic activity. The feasibility of H 2 and O 2 production is investigated with a gas chromatography (GC 7920, Beijing, China) during the process of photoreduction CO 2 .The formation rate of H 2 of Pt-TiO 2 -0.2HF cat- alyst reached to 0.92 mol h -1 g -1 , which is significantly inferior to the production rate of CH 4 (4 mol h -1 g -1 ).Based on the literature results 55,56, we believe the relatively lower yield of H 2 production in this work is possibly due to the following two reasons: (1) protons or To further evaluate the photocatalytic performance in liquid phase, we examined photocatalytic activity of the as-prepared TiO 2 -xHF samples by methylene blue (MB) degradation.As shown in Fig. S6, TiO 2 -0.2HF also shows the superior photocatalytic activity and the degradation rate is up to nearly 90 within 10 min under Xe arc lamp irradiation.This also further revealed TiO 2 -0.2HF with proper ratio (001) facets has a broad application. In the photocatalytic reactions, the separation of carriers is one of the effective factors to enhance the photocatalytic reactivity, especially in photoreduction CO 2 reactions.The photoluminescence (PL) emission mainly results from the recombination of excited electrons and holes, which can be considered as an effective approach for understanding the separation capacity of the photoinduced carriers.A low PL intensity also indicates the decrease in recombination rate 59,60.Fig. 8 shows the fluorescence spectra of the samples in a wavelength range of 350-550 nm.It can be seen that all the peaks displayed similar shapes, and three main characteristic peaks appeared at 398, 451, and 468 nm, which was corresponding to the energy levels of 3.12, 2.75, and 2.65 eV, respectively.That's to say, fluorescence peaks at 398 attributed to the emission peak towards excitation the band gap of anatase TiO 2 , and the other two fluorescence peaks derived from band-to-band transition of free carriers 61.The TiO 2 -0.2HF sample has the weakest PL emission probably because of the relatively low electrons and holes recombination rate.PL measurement results are in consistent with the order of the photocatalytic activity.EIS spectra is often used for characterizing the conductivity of an electrode, a small circular radius usually shows a lower charge transfer resistance 62.Fig. 9 shows the Nyquist plots of different samples, TiO 2 -1.5HF and TiO 2 -0HF show large semicircles, which is due to the higher percentage of the exposed (101) facets on the TiO 2 sample, which plays the role of recombination centres for photogenerated carriers and thus inhibit the charge separation.The better activity of TiO 2 -0HF than TiO 2 -1.5HF may be on account of the larger surface area.At the same time, it can obviously be seen that semicircles of TiO 2 -1HF, TiO 2 -0.5HF,TiO 2 -0.1HF modified electrodes decreased, which can be mainly attributed to surface heterojunction between (001) and (101) facets of TiO 2 .Interestingly, the impedance arc radius of TiO 2 -0.2HF is the smallest among samples implying that the highest separation efficiency of photogenerated electron-hole pairs was achieved from TiO 2 -0.2HF.This is attributed to the appropriate proportion between (001) and (101) facets, which extremely prevents the direct recombination of electrons and holes. The schematic diagram of proposed mechanism of CO 2 photoreduction process is shown in Fig. 10.When the ultrafine applanate truncated octahedral bipyramid TiO 2 nanocrystals was irradiated by Hg lamp, photo-induced electrons and holes were produced.The photogenerated electrons on the (001) facets could transport to the (101) facets due to their conduction band offset, and then react with the adsorbed CO 2 to generate CH 4 subsequently.Correspondingly, the photogenerated holes on the (101) facets could transfer to the (001) facets, and then react with the adsorbed H 2 O to generate O 2 and H .After loading of Pt nanoparticles, photo-generated electrons can be easily trapped by Pt because of its lower Fermi energy level, improving the separation efficiency of the photo-generated electron-hole pairs, and then the photoreduction rate of CO 2 to CH 4 was accelerated."}], "reaction medium": [{"llm generation": "Gas", "source": "Surface heterojunction between (001) and (101) facets of ultrafine anatase TiO2 nanocrystals for highly efficient photoreduction CO2 to CH4", "context": "Surface heterojunction between (001) and (101) facets of ultrafine anatase TiO2 nanocrystals for highly efficient photoreduction CO2 to CH4"}, {"llm generation": "Gas", "source": "The truncated octahedral bipyramid TiO 2 nanocrystals with 51 (001) and 49 (101) facets exposing showed the highest photoactivity for CO 2 reduction to CH 4 .", "context": "Shape-dependent ultrafine anatase TiO 2 nanocrystals coexposed with ( 001) and ( 101) facets are synthesized in isopropanol by the simple solvothermal strategy.Nanotube titanic acid (NTA) was used as the Ti precursor, and hydrofluoric acid was the shape-control reagent.The nanotubular structure of NTA facilitated HF to adsorb on/into NTA, and made the shape-controlled process to be more economical and easier.The ratio of (001) facets of the obtained decahedral TiO 2 nanocrystals can be adjusted from 5 to 51, and the mean diameter of nanoparticles is about 10-30 nm.The samples are characterized by X-ray diffraction, transmission electron microscopy, X-ray photoelectron spectroscope, ultraviolet-visible diffuse reflectance spectrum, N 2 adsorption-desorption isotherms, fluorescence and Raman spectroscopy.The truncated octahedral bipyramid TiO 2 nanocrystals with 51 (001) and 49 (101) facets exposing showed the highest photoactivity for CO 2 reduction to CH 4 .This remarkable photocatalytic efficiency is attributed to the surface heterojunction between (001) and (101) crystal facets, the small size and large surface area of the truncated octahedral bipyramid TiO 2 nanocrystals."}, {"llm generation": "Liquid", "source": "Photocatalytic activity was conducted in a closed reactor with the inner capacity of 200 mL containing 125 mL 0.1 M KHCO 3 solution.", "context": "NTA were synthesized by the hydrothermal process in a concentrated NaOH aqueous solution, a commercial titania P25 was used as the Ti source 46.Typically, 3 g of P25 was mixed with 300 mL of 10 M NaOH aqueous solution, and followed by the hydrother-mal treatment at 120 C in Teflon-lined autoclave for 24 h.The obtained precipitate was washed with deionized water thoroughly until pH 7, and followed by a filtration process.Then the resulting product was put into 300 mL hydrochloric acid aqueous solution (pH 1) and stirring for 8 h.At last, the precipitates were washed with distilled water until no Cl -was detectable.Then, the product was dried in an oven at 100 C for overnight. In a typical synthesis, 1 g of NTA powders were dispersed into 25 mL of absolute isopropanol and stirred for 30 min, and after that, x mL (x is 0, 0.1, 0.2, 0.5, 1 and 1.5) of HF (40 wt) was added slowly to the suspension, respectively.Then, the suspension was transferred into 50 mL Teflon-lined autoclave and kept at 200 C for 24 h.After the solvothermal reaction, the resulting precipitates were collected and washed with ethanol and distilled water for several times.Then, the samples were dried in an oven at 80 C. The obtained samples were denoted as TiO 2 -0HF, TiO 2 -0.1HF,TiO 2 -0.2HF,TiO 2 -0.5HF,TiO 2 -1HF and TiO 2 -1.5HF, respectively.As a reference, the fluorinated P25 was also prepared by the same process in absolute isopropanol adding 0.2 mL of HF (40 wt), which was denoted as P25-0.2HF. For further improving the photocatalytic efficiency, 1 wt Pt nanoparticles were loaded on the surface of as-prepared samples as the cocatalyst by the in-situ photoreduction method.The corresponding products were denoted as Pt-TiO 2 -0HF, Pt-TiO 2 -0.2HF and Pt-P25, respectively. X-ray diffraction (XRD) patterns were measured on a Bruker Apex II diffractometer (CuK radiation, 2A range 20 -80 , step size 0.08 , accelerating voltage 40 kV, applied current 40 mA).Raman measurement was carried out using a Renishaw inVia Raman spectroscopy, the power of the laser was 1, and the laser excitation was 532 nm, wavenumber range (100-800 cm -1 ), and the exposure time was 1 s.The surface area, pore size, and pore volume of the samples were analyzed by nitrogen adsorption at 77 K with the Brunauer-Emmett-Teller (BET) method (Micromeritics, ASAP 2020).Transmission electron microscopic (TEM) images were taken on a JEM-2010 electron microscope at 200 kV.X-ray photoelectron spectroscopy (XPS) measurements were investigated on a Thermo ESCALAB 250Xi with Al K emission at 1486.6 eV, and all of the binding energies were calibrated by C 1 s at 284.8 eV.UV-visible diffuse reflectance spectra (UV-vis DRS) were obtained on a Shimadzu U-3010 spectrometer, using BaSO 4 as a reference.The electron spin resonance (ESR) signals of the samples were tested on a JES FA200 spectrometer at room temperature.The photoluminescence (PL) spectra were recorded on a F-7000 FL spectrophotometer by a typical benchtop fluorimeter (equipped with a 150 W Xe lamp source, using an excitated wavelength of 315 nm). Photoelectrochemical measurements were conducted in a conventional three-electrode system with 1 M Na 2 SO 3 electrolyte on the electrochemical workstation (IM6eX Instruments, ZAHNER, German).The suspension with the obtained sample (0.02 g) and ethanol (0.5 mL) was coated onto a 1 cm 1.1 cm fluorine-tin oxide (FTO) glass as the working electrode, a Pt mesh and an Ag/AgCl electrode (SCE) acting as the counter electrode and reference electrode, respectively.Electrochemical impedance spectroscopy (EIS) experiments were conducted at the bias of 0.4 V and a 250 W Hg lamp was employed as photon source. Photocatalytic activity was conducted in a closed reactor with the inner capacity of 200 mL containing 125 mL 0.1 M KHCO 3 solution.0.1 g catalyst was put into the reactor and then ultrasonic to disperse evenly.The ultrapure gaseous CO 2 was flowed through the solution under stirring for 1 h, until it achieved saturated state.The photocatalytic reaction was typically performed at room temperature for 6 h using a high pressure Hg lamp (250 W).The outputs were analyzed by a gas chromatography (GC 9790, Zhejiang, China)."}, {"llm generation": "Liquid", "source": "To further evaluate the photocatalytic performance in liquid phase, we examined photocatalytic activity of the as-prepared TiO 2 -xHF samples by methylene blue (MB) degradation.", "context": "The crystal structures of the prepared materials were confirmed by XRD and Raman spectroscopy.Fig. 1a shows the XRD plots of all samples.The peaks at 25.25, 37.72, 48.03, 53.91, and 54.99 Can be assigned to (101), ( 004), ( 200), (105), and (211) crystal planes of anatase TiO 2 (JCPDS 21-1272), respectively 30.Anatase is the unique phase in all samples except for P25-0.2HFwhich shows the presence of anatase and rutile.Apparently, the (004) diffraction peak of TiO 2 -0.2HF becomes broader, which indicates massive appearance of (001) facets 21.Typical anatase phase is revealed from the appearing peaks at about 144 (E g ), 394 (B 1g ), 514 (A 1g ), and 636 cm -1 (E g ) in Fig. 1b.We can easily observe that the E g peaks (144 cm -1 ) of TiO 2 -0.2HF is the lowest.It has been known that E g and B 1g peaks is mainly caused by symmetric stretching vibration and bending vibration of O Ti O, while A 1g peak is caused by anti-symmetric bending vibration of O Ti O 48.The vibration models of anatase TiO 2 (101) and (001) facets were different with that of no (001) facets exposed, and the intensity of the symmetric stretching vibration modes of O Ti O becomes weak when the (001) facets exist 49.In a word, the higher the percentage of (001) facets, the weaker the intensity of the symmetric stretching vibration modes of O Ti O will be, and correspondingly, the intensity of the E g peaks in the Raman spectra decreased.The information provided from Raman spectroscopy is in agreement with the above XRD results, and the enlarged XRD patterns and Raman spectra are shown in Fig. S1. The XPS analysis in Fig. 2 gives the surface composition and chemical status of TiO 2 -0.2HF.Four XPS plots of Ti2p, O1s, F1s, and Pt4f are presented.The binding energy of Ti2p 3/2 and Ti2p 1/2 (Fig. 2a) is located at 458.4 and 464.1 eV 44, indicating the oxidation state of the Ti element is the same as that of bulk TiO 2 .The O1 s peaks consisted of a dominant peak at 529.5 eV and another higher energy peak at 531.9 eV, which can be indexed to Ti-O bonding and surface O H bonding of TiO 2 -0.2HF, respectively (Fig. 2b) 44,50.Simultaneously, the existence of F is detected, and the F 1 s peak at the binding energy of 684.1 eV in Fig. 2c is a typical value for Ti-F species on the TiO 2 surface 17.The existence of fluorine would affect the properties of catalyst, and the role of F for the photoactivity will be discussed in the following section.The binding energy peak of Pt 4f 7/2 and 4f 5/2 can be observed at 71.4 and 74.9 eV in Fig. 2d, which are in accordance with the standard position of Pt 0 40, and indicating Pt 0 nanoparticles were successfully loaded on TiO 2 -0.2HF surfaces by photo-deposition method. The morphology and microstructure of the products were shown in Fig. 3.As can be seen from Fig. 3a, TiO 2 -0.2HF nanocrystals are consisted of highly dispersed truncated octahedral bipyramid nanoparticles.The mean particle size is calculated to be 10-18 nm with more than 100 nanoparticles from TEM images (Fig. S2).The HRTEM image (Fig. 3b) shows that the lattice spacing parallel to the top and bottom facets is ca.0.235 nm, which corresponds to the (001) planes of anatase TiO 2 .Another set of lattice fringes with the spacing of 0.351 nm corresponding with the (101) planes was also clearly revealed from the picture.And the crystal orientation of ( 101) and (001) faces with an interfacial angle of 68.3 , which indicates the top and bottom facets of the truncated octahedral bipyramid TiO 2 are the (001) facets, the lateral isosceles trapezoid corresponds to (101) facet 20.On the basis of the above truncated octahedral bipyramid structural information, the percentage of the (001) facets in TiO 2 -0.2HF was estimated to be 51 as calculated by a reported method 51.As can be seen in Fig. 3c andd of TiO 2 -0HF catalyst, the octahedral bipyramid TiO 2 -0HF nanocrystals exposing with a great deal of (101) facets, and the average particle size is 11-17 nm (Fig. S2).The information further confirms the contribution of F -to the exposure of (001) facets.TEM images of TiO 2 -xHF (x is 0.1, 0.5, 1 and 1.5) are shown in Fig. S3.The dimension of the TiO 2 nanocrystal grew up apparently with the augment of HF.The nanoparticles aggregated seriously to about 30 nm and the proportion of (001) facets decreased to 8 when 1.5 mL was added to the reaction.The amount of HF has a large effect on the morphology and size of the TiO 2 nanocrystals, and the detailed information was listed in the following Table 1. Pt often plays a crucial role for the improvement of the photoactivity, especially for the deep reduction of CO 2 to CH 4 in the photoreduction of CO 2 .Fig. 3e andf showed that Pt 0 nanoparticles were uniformly deposited on the TiO 2 -0.2HF surfaces and the average particle size was 1-2 nm.Highly dispersed Pt 0 nanoparticles are beneficial for the accumulation of electrons, which can promote the separation of electrons and holes, and then further enhance the reduction of CO 2 ; while Pt 0 on the TiO 2 -0HF surfaces aggregates to 4-6 nm as shown in Fig. 3g andh.It is conventional understanding that (101) facets should have more strongly reductive electrons because their bottom of CB in the order (101)(001) 52.Therefore, (101) facets with a Pt-loading are easier to form Pt aggregates on the surfaces due to their different surface electronic structures and reconstructions during the Pt deposition process. Fig. 4 displays N 2 adsorption-desorption isotherms and the corresponding pore size distribution curve for the prepared TiO 2 samples.All of the samples exhibited similar type-IV isotherms with an H3 hysteresis loop at a relative pressure range of 0.7-0.95according to the IUPAC classification, which are typical characters of mesoporous materials 53.Pore size distribution curve (insert) of the TiO 2 -0.2HF sample, with a peak at 8.6 nm, was achieved through BJH analysis.Quantitative details on BET surface areas, pore volume and average pore size of the TiO 2 samples are presented in Table 1.The BET surface areas of catalysts from NTA precursor are larger than P25 and P25-0.2HFexcept TiO 2 -1.5HF.With the increasing of HF from 0 to 1 mL, the surface areas of the samples decreased a little sequentially.However, the specific surface areas of TiO 2 -1.5HF (53 m 2 /g) apparently decreased about two times than that of TiO 2 -0HF (92 m 2 /g), which is caused by plenty of HF, through selectively corroding (001) facets and leading to irreg- ular growth of TiO 2 nanoparticles (TEM images of TiO 2 -1.5HF was shown in Fig. S2).The average pore size of TiO 2 -0.2HF is 8.6 nm larger than any other sample, which is beneficial for adsorption of CO 2 . The UV-vis optical absorption spectra obtained by the diffuse reflectance of as-prepared TiO 2 are shown in Fig. 5.The onset of the absorption edge for TiO 2 -0HF is at ca. 410 nm, which is consistent with the band gap of anatase TiO 2 (3.02 eV).Compared with TiO 2 -0HF, the absorption edge of TiO 2 -xHF has not an obvious shift.Surprisingly, absorption intensity of TiO 2 -0.2HF is significantly higher than that of other samples, which is due to the exposure of abundant (001) facets.The high density of active unsaturated coordination Ti atoms and the presence of enlarged Ti O Ti bond angles on the (001) facets surface, which make the existence of oxygen defects 54.Based on the analysis above, it can be con-cluded that the TiO 2 -0.2HF might result in the efficient utilization of UV-vis light and exhibit high photocatalytic activities. The CO 2 photoreduction performance of the catalysts was shown in Fig. 6.Both reactions under light without the catalysts and in dark with the catalysts were tested as contrast experiment.A very trace amount of CH 4 or CO was detected in the two comparison tests, indicating that the reaction was indeed a photocatalytic process. All of the prepared TiO 2 nanocrystals exhibited photocatalytic activity that was significantly better than the commercial P25, because of the anatase phase structure.The conduction band edge potential of anatase TiO 2 is more negative vs normal hydrogen electrode (NHE) than the CO 2 /CH 4 reduction potential, thus, the anatase TiO 2 can efficiently reduce CO 2 into CH 4 under Hg lamp irradiation 13.Although BET surface area of TiO 2 -0HF was higher, the photoreduction CO 2 activity on TiO 2 nanocrystals with exposed (001) facets was much higher than its except TiO 2 -1.5HF.This indicated (001) facets played a key role in the enhancement of the photoactivity.The photocatalytic activity of these catalyst samples can be rationalized as TiO 2 -0.2HF TiO 2 -0.1HFTiO 2 -0.5HF TiO 2 -0.5HFTiO 2 -1HF TiO 2 -0HF displayed in Fig. 6.Based on the DFT calculations, the (101) and (001) facets of anatase TiO 2 exhibit different band structures and band edge positions 31.Thus, the coexposed (101) and (001) facets of anatase can form a surface heterojunction within a single TiO 2 particle, which is beneficial for the transfer of photogenerated electrons to (101) and holes to (001) facets, respectively 31.TiO 2 -0.2HF has the highest CH 4 production rate of 1.58 mol h -1 g -1 , which was owing to the optimal ratio of the ( 001) and (101) facets.However, the inferior photocatalytic activity of TiO 2 -1.5HF than TiO 2 -0HF was on account of two reasons: one is the smaller specific surface area of the later, and the other is deficiencies appeared on the surface of TiO 2 -1.5HF with the corrosion of HF, which enhanced the recombination of photo-generated carriers and reducing the photoactivity.Considering the impact of fluorine on photoactivity of the catalyst, while defluorination may change the morphology and surface state of TiO 2 , the catalytic activity of P25-0.2HF was tested under the same conditions, and a slightly higher photocatalytic CH 4 production rate (0.21 mol h -1 g -1 ) was obtained than 0.1 mol h -1 g -1 of P25, which indicated the present of appropriate F on the surface was favourable to enhance CO 2 photoreduction.Surface Ti-F electronegative groups can act as trapping sites for photo-generated electrons and facilitate transfer to surface-adsorbed CO 2 molecules 42.It is worth mentioning that a novel anatase TiO 2 was obtained by dehydration of NTA at elevated temperature which contains high concentration of single-electron-trapped oxygen vacancies (Vo ) in our previous study 46,47.Here we also tested single-electrontrapped oxygen vacancies (Vo ) of TiO 2 -0HF and TiO 2 -0.2HF, as shown in Fig. S4.A large amount of Vo exist in the bulk of TiO 2 -0HF, as for TiO 2 -0.2HF samples, there exist a little Vo .This predicts the existence of HF can significantly reduce the defect in the bulk phase of the TiO 2 (Vo ).Consequently, it helps reduce the probability of electron hole recombination in the compound, and prompt charge carriers participating into the photocatalytic redox reaction.Based on the above discussion, the photocatalytic activity of the TiO 2 samples is strongly affected by many factors, including the optimum ratio of the exposed (001) to (101) facets, and surface area, crystal structure of catalyst and appropriate amount of F. Surface heterojunction between (001) and (101) facets of TiO 2 nanocrystals is one of most important reasons (seen from the following PL and EIS spectra). To confirm that CH 4 is formed from CO 2 , we have compared the rates of CH 4 formation in the presence of H 2 O instead of KHCO 3 solution under CO 2 atmospheres, and the formation rate of CH 4 of TiO 2 -0.2HF catalyst reached to 1.56 mol h -1 g -1 , which is equivalent to the production rate of CH 4 (1.58 mol h -1 g -1 ) in KHCO 3 solution.In addition, when the reactor was filled with N 2 (instead of CO 2 ) in KHCO 3 solution, no carbon-containing compounds were detected either (Table 2).The results illustrate that the C species in the photocatalytic products of CH 4 comes from CO 2 .uniformly distributed Pt nanoparticles on the TiO 2 -0.2HF surface, as above mentioned (TEM).The AQE based on CH 4 production over Pt-TiO 2 -0.2HF was calculated to be 0.22 (details displayed in Supporting Information).As shown in inset of Fig. 7, the stability test of Pt-TiO 2 -0.2HF was conducted by cycle reaction, and each cycle was performed for 6 h.After each cycle, CH 4 in the system was degassed by N 2 and then CO 2 was reintroduced into the reactor.The rates of CH 4 formation declined apparently in the second reaction, but it did not show significant change in the subsequent cycles.After four cycles of reaction, the formation rate of CH 4 of Pt-TiO 2 -0.2HF catalyst reached to 3.15 mol h -1 g -1 .Indeed, there are many factors affecting the photocatalytic activities, for this sample, the decrease of photoactivity was possibly attributed to either the inactivation of some active sites or the structural change of the catalyst in the reaction process.IR and XPS experiments were carried out to detect surface species of recycled catalysts, but no apparent change was observed (Fig. S5).We believed that the decrease in activity was typically resulted in the TiO 2 nanoparticles aggregated in aqueous solution after a long time.In order to prove our conjecture, the recycled catalyst is characterized by N 2 adsorption-desorption isotherms, the specific surface areas of the recycled catalyst (75 m 2 /g) decreased apparently compared with that of original catalyst (90 m 2 /g), and the decreased percentage of the specific surface areas is approximately equal with the decline yield of catalytic activity. The feasibility of H 2 and O 2 production is investigated with a gas chromatography (GC 7920, Beijing, China) during the process of photoreduction CO 2 .The formation rate of H 2 of Pt-TiO 2 -0.2HF cat- alyst reached to 0.92 mol h -1 g -1 , which is significantly inferior to the production rate of CH 4 (4 mol h -1 g -1 ).Based on the literature results 55,56, we believe the relatively lower yield of H 2 production in this work is possibly due to the following two reasons: (1) protons or To further evaluate the photocatalytic performance in liquid phase, we examined photocatalytic activity of the as-prepared TiO 2 -xHF samples by methylene blue (MB) degradation.As shown in Fig. S6, TiO 2 -0.2HF also shows the superior photocatalytic activity and the degradation rate is up to nearly 90 within 10 min under Xe arc lamp irradiation.This also further revealed TiO 2 -0.2HF with proper ratio (001) facets has a broad application. In the photocatalytic reactions, the separation of carriers is one of the effective factors to enhance the photocatalytic reactivity, especially in photoreduction CO 2 reactions.The photoluminescence (PL) emission mainly results from the recombination of excited electrons and holes, which can be considered as an effective approach for understanding the separation capacity of the photoinduced carriers.A low PL intensity also indicates the decrease in recombination rate 59,60.Fig. 8 shows the fluorescence spectra of the samples in a wavelength range of 350-550 nm.It can be seen that all the peaks displayed similar shapes, and three main characteristic peaks appeared at 398, 451, and 468 nm, which was corresponding to the energy levels of 3.12, 2.75, and 2.65 eV, respectively.That's to say, fluorescence peaks at 398 attributed to the emission peak towards excitation the band gap of anatase TiO 2 , and the other two fluorescence peaks derived from band-to-band transition of free carriers 61.The TiO 2 -0.2HF sample has the weakest PL emission probably because of the relatively low electrons and holes recombination rate.PL measurement results are in consistent with the order of the photocatalytic activity.EIS spectra is often used for characterizing the conductivity of an electrode, a small circular radius usually shows a lower charge transfer resistance 62.Fig. 9 shows the Nyquist plots of different samples, TiO 2 -1.5HF and TiO 2 -0HF show large semicircles, which is due to the higher percentage of the exposed (101) facets on the TiO 2 sample, which plays the role of recombination centres for photogenerated carriers and thus inhibit the charge separation.The better activity of TiO 2 -0HF than TiO 2 -1.5HF may be on account of the larger surface area.At the same time, it can obviously be seen that semicircles of TiO 2 -1HF, TiO 2 -0.5HF,TiO 2 -0.1HF modified electrodes decreased, which can be mainly attributed to surface heterojunction between (001) and (101) facets of TiO 2 .Interestingly, the impedance arc radius of TiO 2 -0.2HF is the smallest among samples implying that the highest separation efficiency of photogenerated electron-hole pairs was achieved from TiO 2 -0.2HF.This is attributed to the appropriate proportion between (001) and (101) facets, which extremely prevents the direct recombination of electrons and holes. The schematic diagram of proposed mechanism of CO 2 photoreduction process is shown in Fig. 10.When the ultrafine applanate truncated octahedral bipyramid TiO 2 nanocrystals was irradiated by Hg lamp, photo-induced electrons and holes were produced.The photogenerated electrons on the (001) facets could transport to the (101) facets due to their conduction band offset, and then react with the adsorbed CO 2 to generate CH 4 subsequently.Correspondingly, the photogenerated holes on the (101) facets could transfer to the (001) facets, and then react with the adsorbed H 2 O to generate O 2 and H .After loading of Pt nanoparticles, photo-generated electrons can be easily trapped by Pt because of its lower Fermi energy level, improving the separation efficiency of the photo-generated electron-hole pairs, and then the photoreduction rate of CO 2 to CH 4 was accelerated."}, {"llm generation": "Gas", "source": "The production rate of O 2 and CH 4 is not in accordance with the molar ratio, which is possibly caused by the consumption of residual O 2 in the reactor through the reaction with photogenerated electrons: O 2 e - O 2", "context": "In brief, ultrafine anatase TiO 2 nanocrystals with controllable coexposed (001) and (101) facets were prepared by a facile solvothermol strategy.1D NTA transformed to applanate truncated octahedral bipyramid TiO 2 nanocrystals, and the percentage of (001) facets can be adjusted from 5 to 51.TiO 2 -0.2HF with 51 of (001) facets and 49 (101) facets exhibited the highest photocatalytic activity in terms of both photoreduction CO 2 and photodegradation of MB.PL and EIS spectra results proved that the efficient surface heterojunctions between (001) and (101) facets are favourable for the separation of photogenerated charge carriers.What is more, the smaller size reduces recombination probability of photocarriers in the bulk.The photoreduction rate of CO 2 to CH 4 reached to 1.58 mol h -1 g -1 on TiO 2 -0.2HF, and the photoactivity increased remarkably to 4.0 mol h -1 g -1 after loaded Pt nanoparticles.In addition, the efficiency could remain nearly 80 after four cycle reactions, indicating the catalyst has a long-term stability.Moreover, little HF dosage is beneficial for subsequent industrial production, and this kind of ultrafine TiO 2 nanocrystals with surface heterojunction is potential for the development of solar cells, optoelectronic devices, sensors and heterogeneous catalysts. Fig. 1.XRD and Raman patterns of the photocatalysts. Fig. 2. XPS spectra of Ti2p (a), O1 s (b), F1 s (c) and Pt4f (d) in Pt-TiO2-0.2HFsample. Fig. 3. TEM and HRTEM images of TiO2-0.2HF(a, b), TiO2-0HF (c, d), Pt-TiO2-0.2HF(e, f), Pt-TiO2-0HF (g, h). Fig. 6.Photocatalytic activity of CH4 production rate of P25, P25-0.2HF and TiO2-xHF samples. Fig. 7. CH4 production rate of Pt-P25, TiO2-0HF and TiO2-0.2HFsamples and the inset displays the stability of Pt-TiO2-0.2HFnanoparticles on CO2 photoreduction in the consecutive four cycles. Fig. 8. PL spectra of the TiO2-xHF photocatalysts (excitated wavelength: 315 nm). Fig. 9. Nyquist plots of the TiO2-xHF samples. Fig. 10.Schematic diagram of mechanism of photocatalytic process. Effect of different volume of HF on the structural of TiO2 nanocystals. H radicals formed by the photodissociation of water are competitively consumed by CO 2 reduction intermediates like CO 2 to produce CH 4 ; (2) the produced H 2 could be consumed by reverse reactions with CO or O 2 .The formation rate of O 2 of Pt-TiO 2 -0.2HF catalyst reached to 5.2 mol h -1 g -1 , which is a little higher than the production rate of CH 4 (4 mol h -1 g -1 ).The production rate of O 2 and CH 4 is not in accordance with the molar ratio, which is possibly caused by the consumption of residual O 2 in the reactor through the reaction with photogenerated electrons: O 2 e - O 2 The authors gratefully acknowledge the support of the National Natural Science Foundation of China (Nos.21103042 and 21471047), Program for Science Technology Innovation Talents (15HASTIT043) and Innovative Research Team (16IRTSTHN015) from the University of Henan Province, and Program for Changjiang Scholars and Innovative Research Team in University from the Ministry of Education of China (PCS IRT1126). The manuscript was written through contributions of all authors.Yuhui Cao carried out the total experiment and wrote the first manuscript.Chen Li and Junli Li participated in the data analysis.Qiuye Li supervised the project.Jianjun Yang provided the facilities and discussions related to them.All authors read and approved the final manuscript. Supplementary data associated with this article can be found, in the online version, at http://dx.doi.org/10.1016/j.apcatb.2016.05.071."}], "reactor type": [], "operation mode": [{"llm generation": "Batch", "source": "The photocatalytic reaction was typically performed at room temperature for 6 h using a high pressure Hg lamp (250 W).", "context": "NTA were synthesized by the hydrothermal process in a concentrated NaOH aqueous solution, a commercial titania P25 was used as the Ti source 46.Typically, 3 g of P25 was mixed with 300 mL of 10 M NaOH aqueous solution, and followed by the hydrother-mal treatment at 120 C in Teflon-lined autoclave for 24 h.The obtained precipitate was washed with deionized water thoroughly until pH 7, and followed by a filtration process.Then the resulting product was put into 300 mL hydrochloric acid aqueous solution (pH 1) and stirring for 8 h.At last, the precipitates were washed with distilled water until no Cl -was detectable.Then, the product was dried in an oven at 100 C for overnight. In a typical synthesis, 1 g of NTA powders were dispersed into 25 mL of absolute isopropanol and stirred for 30 min, and after that, x mL (x is 0, 0.1, 0.2, 0.5, 1 and 1.5) of HF (40 wt) was added slowly to the suspension, respectively.Then, the suspension was transferred into 50 mL Teflon-lined autoclave and kept at 200 C for 24 h.After the solvothermal reaction, the resulting precipitates were collected and washed with ethanol and distilled water for several times.Then, the samples were dried in an oven at 80 C. The obtained samples were denoted as TiO 2 -0HF, TiO 2 -0.1HF,TiO 2 -0.2HF,TiO 2 -0.5HF,TiO 2 -1HF and TiO 2 -1.5HF, respectively.As a reference, the fluorinated P25 was also prepared by the same process in absolute isopropanol adding 0.2 mL of HF (40 wt), which was denoted as P25-0.2HF. For further improving the photocatalytic efficiency, 1 wt Pt nanoparticles were loaded on the surface of as-prepared samples as the cocatalyst by the in-situ photoreduction method.The corresponding products were denoted as Pt-TiO 2 -0HF, Pt-TiO 2 -0.2HF and Pt-P25, respectively. X-ray diffraction (XRD) patterns were measured on a Bruker Apex II diffractometer (CuK radiation, 2A range 20 -80 , step size 0.08 , accelerating voltage 40 kV, applied current 40 mA).Raman measurement was carried out using a Renishaw inVia Raman spectroscopy, the power of the laser was 1, and the laser excitation was 532 nm, wavenumber range (100-800 cm -1 ), and the exposure time was 1 s.The surface area, pore size, and pore volume of the samples were analyzed by nitrogen adsorption at 77 K with the Brunauer-Emmett-Teller (BET) method (Micromeritics, ASAP 2020).Transmission electron microscopic (TEM) images were taken on a JEM-2010 electron microscope at 200 kV.X-ray photoelectron spectroscopy (XPS) measurements were investigated on a Thermo ESCALAB 250Xi with Al K emission at 1486.6 eV, and all of the binding energies were calibrated by C 1 s at 284.8 eV.UV-visible diffuse reflectance spectra (UV-vis DRS) were obtained on a Shimadzu U-3010 spectrometer, using BaSO 4 as a reference.The electron spin resonance (ESR) signals of the samples were tested on a JES FA200 spectrometer at room temperature.The photoluminescence (PL) spectra were recorded on a F-7000 FL spectrophotometer by a typical benchtop fluorimeter (equipped with a 150 W Xe lamp source, using an excitated wavelength of 315 nm). Photoelectrochemical measurements were conducted in a conventional three-electrode system with 1 M Na 2 SO 3 electrolyte on the electrochemical workstation (IM6eX Instruments, ZAHNER, German).The suspension with the obtained sample (0.02 g) and ethanol (0.5 mL) was coated onto a 1 cm 1.1 cm fluorine-tin oxide (FTO) glass as the working electrode, a Pt mesh and an Ag/AgCl electrode (SCE) acting as the counter electrode and reference electrode, respectively.Electrochemical impedance spectroscopy (EIS) experiments were conducted at the bias of 0.4 V and a 250 W Hg lamp was employed as photon source. Photocatalytic activity was conducted in a closed reactor with the inner capacity of 200 mL containing 125 mL 0.1 M KHCO 3 solution.0.1 g catalyst was put into the reactor and then ultrasonic to disperse evenly.The ultrapure gaseous CO 2 was flowed through the solution under stirring for 1 h, until it achieved saturated state.The photocatalytic reaction was typically performed at room temperature for 6 h using a high pressure Hg lamp (250 W).The outputs were analyzed by a gas chromatography (GC 9790, Zhejiang, China)."}, {"llm generation": "Batch", "source": "As shown in inset of Fig. 7, the stability test of Pt-TiO 2 -0.2HF was conducted by cycle reaction, and each cycle was performed for 6 h.", "context": "The crystal structures of the prepared materials were confirmed by XRD and Raman spectroscopy.Fig. 1a shows the XRD plots of all samples.The peaks at 25.25, 37.72, 48.03, 53.91, and 54.99 Can be assigned to (101), ( 004), ( 200), (105), and (211) crystal planes of anatase TiO 2 (JCPDS 21-1272), respectively 30.Anatase is the unique phase in all samples except for P25-0.2HFwhich shows the presence of anatase and rutile.Apparently, the (004) diffraction peak of TiO 2 -0.2HF becomes broader, which indicates massive appearance of (001) facets 21.Typical anatase phase is revealed from the appearing peaks at about 144 (E g ), 394 (B 1g ), 514 (A 1g ), and 636 cm -1 (E g ) in Fig. 1b.We can easily observe that the E g peaks (144 cm -1 ) of TiO 2 -0.2HF is the lowest.It has been known that E g and B 1g peaks is mainly caused by symmetric stretching vibration and bending vibration of O Ti O, while A 1g peak is caused by anti-symmetric bending vibration of O Ti O 48.The vibration models of anatase TiO 2 (101) and (001) facets were different with that of no (001) facets exposed, and the intensity of the symmetric stretching vibration modes of O Ti O becomes weak when the (001) facets exist 49.In a word, the higher the percentage of (001) facets, the weaker the intensity of the symmetric stretching vibration modes of O Ti O will be, and correspondingly, the intensity of the E g peaks in the Raman spectra decreased.The information provided from Raman spectroscopy is in agreement with the above XRD results, and the enlarged XRD patterns and Raman spectra are shown in Fig. S1. The XPS analysis in Fig. 2 gives the surface composition and chemical status of TiO 2 -0.2HF.Four XPS plots of Ti2p, O1s, F1s, and Pt4f are presented.The binding energy of Ti2p 3/2 and Ti2p 1/2 (Fig. 2a) is located at 458.4 and 464.1 eV 44, indicating the oxidation state of the Ti element is the same as that of bulk TiO 2 .The O1 s peaks consisted of a dominant peak at 529.5 eV and another higher energy peak at 531.9 eV, which can be indexed to Ti-O bonding and surface O H bonding of TiO 2 -0.2HF, respectively (Fig. 2b) 44,50.Simultaneously, the existence of F is detected, and the F 1 s peak at the binding energy of 684.1 eV in Fig. 2c is a typical value for Ti-F species on the TiO 2 surface 17.The existence of fluorine would affect the properties of catalyst, and the role of F for the photoactivity will be discussed in the following section.The binding energy peak of Pt 4f 7/2 and 4f 5/2 can be observed at 71.4 and 74.9 eV in Fig. 2d, which are in accordance with the standard position of Pt 0 40, and indicating Pt 0 nanoparticles were successfully loaded on TiO 2 -0.2HF surfaces by photo-deposition method. The morphology and microstructure of the products were shown in Fig. 3.As can be seen from Fig. 3a, TiO 2 -0.2HF nanocrystals are consisted of highly dispersed truncated octahedral bipyramid nanoparticles.The mean particle size is calculated to be 10-18 nm with more than 100 nanoparticles from TEM images (Fig. S2).The HRTEM image (Fig. 3b) shows that the lattice spacing parallel to the top and bottom facets is ca.0.235 nm, which corresponds to the (001) planes of anatase TiO 2 .Another set of lattice fringes with the spacing of 0.351 nm corresponding with the (101) planes was also clearly revealed from the picture.And the crystal orientation of ( 101) and (001) faces with an interfacial angle of 68.3 , which indicates the top and bottom facets of the truncated octahedral bipyramid TiO 2 are the (001) facets, the lateral isosceles trapezoid corresponds to (101) facet 20.On the basis of the above truncated octahedral bipyramid structural information, the percentage of the (001) facets in TiO 2 -0.2HF was estimated to be 51 as calculated by a reported method 51.As can be seen in Fig. 3c andd of TiO 2 -0HF catalyst, the octahedral bipyramid TiO 2 -0HF nanocrystals exposing with a great deal of (101) facets, and the average particle size is 11-17 nm (Fig. S2).The information further confirms the contribution of F -to the exposure of (001) facets.TEM images of TiO 2 -xHF (x is 0.1, 0.5, 1 and 1.5) are shown in Fig. S3.The dimension of the TiO 2 nanocrystal grew up apparently with the augment of HF.The nanoparticles aggregated seriously to about 30 nm and the proportion of (001) facets decreased to 8 when 1.5 mL was added to the reaction.The amount of HF has a large effect on the morphology and size of the TiO 2 nanocrystals, and the detailed information was listed in the following Table 1. Pt often plays a crucial role for the improvement of the photoactivity, especially for the deep reduction of CO 2 to CH 4 in the photoreduction of CO 2 .Fig. 3e andf showed that Pt 0 nanoparticles were uniformly deposited on the TiO 2 -0.2HF surfaces and the average particle size was 1-2 nm.Highly dispersed Pt 0 nanoparticles are beneficial for the accumulation of electrons, which can promote the separation of electrons and holes, and then further enhance the reduction of CO 2 ; while Pt 0 on the TiO 2 -0HF surfaces aggregates to 4-6 nm as shown in Fig. 3g andh.It is conventional understanding that (101) facets should have more strongly reductive electrons because their bottom of CB in the order (101)(001) 52.Therefore, (101) facets with a Pt-loading are easier to form Pt aggregates on the surfaces due to their different surface electronic structures and reconstructions during the Pt deposition process. Fig. 4 displays N 2 adsorption-desorption isotherms and the corresponding pore size distribution curve for the prepared TiO 2 samples.All of the samples exhibited similar type-IV isotherms with an H3 hysteresis loop at a relative pressure range of 0.7-0.95according to the IUPAC classification, which are typical characters of mesoporous materials 53.Pore size distribution curve (insert) of the TiO 2 -0.2HF sample, with a peak at 8.6 nm, was achieved through BJH analysis.Quantitative details on BET surface areas, pore volume and average pore size of the TiO 2 samples are presented in Table 1.The BET surface areas of catalysts from NTA precursor are larger than P25 and P25-0.2HFexcept TiO 2 -1.5HF.With the increasing of HF from 0 to 1 mL, the surface areas of the samples decreased a little sequentially.However, the specific surface areas of TiO 2 -1.5HF (53 m 2 /g) apparently decreased about two times than that of TiO 2 -0HF (92 m 2 /g), which is caused by plenty of HF, through selectively corroding (001) facets and leading to irreg- ular growth of TiO 2 nanoparticles (TEM images of TiO 2 -1.5HF was shown in Fig. S2).The average pore size of TiO 2 -0.2HF is 8.6 nm larger than any other sample, which is beneficial for adsorption of CO 2 . The UV-vis optical absorption spectra obtained by the diffuse reflectance of as-prepared TiO 2 are shown in Fig. 5.The onset of the absorption edge for TiO 2 -0HF is at ca. 410 nm, which is consistent with the band gap of anatase TiO 2 (3.02 eV).Compared with TiO 2 -0HF, the absorption edge of TiO 2 -xHF has not an obvious shift.Surprisingly, absorption intensity of TiO 2 -0.2HF is significantly higher than that of other samples, which is due to the exposure of abundant (001) facets.The high density of active unsaturated coordination Ti atoms and the presence of enlarged Ti O Ti bond angles on the (001) facets surface, which make the existence of oxygen defects 54.Based on the analysis above, it can be con-cluded that the TiO 2 -0.2HF might result in the efficient utilization of UV-vis light and exhibit high photocatalytic activities. The CO 2 photoreduction performance of the catalysts was shown in Fig. 6.Both reactions under light without the catalysts and in dark with the catalysts were tested as contrast experiment.A very trace amount of CH 4 or CO was detected in the two comparison tests, indicating that the reaction was indeed a photocatalytic process. All of the prepared TiO 2 nanocrystals exhibited photocatalytic activity that was significantly better than the commercial P25, because of the anatase phase structure.The conduction band edge potential of anatase TiO 2 is more negative vs normal hydrogen electrode (NHE) than the CO 2 /CH 4 reduction potential, thus, the anatase TiO 2 can efficiently reduce CO 2 into CH 4 under Hg lamp irradiation 13.Although BET surface area of TiO 2 -0HF was higher, the photoreduction CO 2 activity on TiO 2 nanocrystals with exposed (001) facets was much higher than its except TiO 2 -1.5HF.This indicated (001) facets played a key role in the enhancement of the photoactivity.The photocatalytic activity of these catalyst samples can be rationalized as TiO 2 -0.2HF TiO 2 -0.1HFTiO 2 -0.5HF TiO 2 -0.5HFTiO 2 -1HF TiO 2 -0HF displayed in Fig. 6.Based on the DFT calculations, the (101) and (001) facets of anatase TiO 2 exhibit different band structures and band edge positions 31.Thus, the coexposed (101) and (001) facets of anatase can form a surface heterojunction within a single TiO 2 particle, which is beneficial for the transfer of photogenerated electrons to (101) and holes to (001) facets, respectively 31.TiO 2 -0.2HF has the highest CH 4 production rate of 1.58 mol h -1 g -1 , which was owing to the optimal ratio of the ( 001) and (101) facets.However, the inferior photocatalytic activity of TiO 2 -1.5HF than TiO 2 -0HF was on account of two reasons: one is the smaller specific surface area of the later, and the other is deficiencies appeared on the surface of TiO 2 -1.5HF with the corrosion of HF, which enhanced the recombination of photo-generated carriers and reducing the photoactivity.Considering the impact of fluorine on photoactivity of the catalyst, while defluorination may change the morphology and surface state of TiO 2 , the catalytic activity of P25-0.2HF was tested under the same conditions, and a slightly higher photocatalytic CH 4 production rate (0.21 mol h -1 g -1 ) was obtained than 0.1 mol h -1 g -1 of P25, which indicated the present of appropriate F on the surface was favourable to enhance CO 2 photoreduction.Surface Ti-F electronegative groups can act as trapping sites for photo-generated electrons and facilitate transfer to surface-adsorbed CO 2 molecules 42.It is worth mentioning that a novel anatase TiO 2 was obtained by dehydration of NTA at elevated temperature which contains high concentration of single-electron-trapped oxygen vacancies (Vo ) in our previous study 46,47.Here we also tested single-electrontrapped oxygen vacancies (Vo ) of TiO 2 -0HF and TiO 2 -0.2HF, as shown in Fig. S4.A large amount of Vo exist in the bulk of TiO 2 -0HF, as for TiO 2 -0.2HF samples, there exist a little Vo .This predicts the existence of HF can significantly reduce the defect in the bulk phase of the TiO 2 (Vo ).Consequently, it helps reduce the probability of electron hole recombination in the compound, and prompt charge carriers participating into the photocatalytic redox reaction.Based on the above discussion, the photocatalytic activity of the TiO 2 samples is strongly affected by many factors, including the optimum ratio of the exposed (001) to (101) facets, and surface area, crystal structure of catalyst and appropriate amount of F. Surface heterojunction between (001) and (101) facets of TiO 2 nanocrystals is one of most important reasons (seen from the following PL and EIS spectra). To confirm that CH 4 is formed from CO 2 , we have compared the rates of CH 4 formation in the presence of H 2 O instead of KHCO 3 solution under CO 2 atmospheres, and the formation rate of CH 4 of TiO 2 -0.2HF catalyst reached to 1.56 mol h -1 g -1 , which is equivalent to the production rate of CH 4 (1.58 mol h -1 g -1 ) in KHCO 3 solution.In addition, when the reactor was filled with N 2 (instead of CO 2 ) in KHCO 3 solution, no carbon-containing compounds were detected either (Table 2).The results illustrate that the C species in the photocatalytic products of CH 4 comes from CO 2 .uniformly distributed Pt nanoparticles on the TiO 2 -0.2HF surface, as above mentioned (TEM).The AQE based on CH 4 production over Pt-TiO 2 -0.2HF was calculated to be 0.22 (details displayed in Supporting Information).As shown in inset of Fig. 7, the stability test of Pt-TiO 2 -0.2HF was conducted by cycle reaction, and each cycle was performed for 6 h.After each cycle, CH 4 in the system was degassed by N 2 and then CO 2 was reintroduced into the reactor.The rates of CH 4 formation declined apparently in the second reaction, but it did not show significant change in the subsequent cycles.After four cycles of reaction, the formation rate of CH 4 of Pt-TiO 2 -0.2HF catalyst reached to 3.15 mol h -1 g -1 .Indeed, there are many factors affecting the photocatalytic activities, for this sample, the decrease of photoactivity was possibly attributed to either the inactivation of some active sites or the structural change of the catalyst in the reaction process.IR and XPS experiments were carried out to detect surface species of recycled catalysts, but no apparent change was observed (Fig. S5).We believed that the decrease in activity was typically resulted in the TiO 2 nanoparticles aggregated in aqueous solution after a long time.In order to prove our conjecture, the recycled catalyst is characterized by N 2 adsorption-desorption isotherms, the specific surface areas of the recycled catalyst (75 m 2 /g) decreased apparently compared with that of original catalyst (90 m 2 /g), and the decreased percentage of the specific surface areas is approximately equal with the decline yield of catalytic activity. The feasibility of H 2 and O 2 production is investigated with a gas chromatography (GC 7920, Beijing, China) during the process of photoreduction CO 2 .The formation rate of H 2 of Pt-TiO 2 -0.2HF cat- alyst reached to 0.92 mol h -1 g -1 , which is significantly inferior to the production rate of CH 4 (4 mol h -1 g -1 ).Based on the literature results 55,56, we believe the relatively lower yield of H 2 production in this work is possibly due to the following two reasons: (1) protons or To further evaluate the photocatalytic performance in liquid phase, we examined photocatalytic activity of the as-prepared TiO 2 -xHF samples by methylene blue (MB) degradation.As shown in Fig. S6, TiO 2 -0.2HF also shows the superior photocatalytic activity and the degradation rate is up to nearly 90 within 10 min under Xe arc lamp irradiation.This also further revealed TiO 2 -0.2HF with proper ratio (001) facets has a broad application. In the photocatalytic reactions, the separation of carriers is one of the effective factors to enhance the photocatalytic reactivity, especially in photoreduction CO 2 reactions.The photoluminescence (PL) emission mainly results from the recombination of excited electrons and holes, which can be considered as an effective approach for understanding the separation capacity of the photoinduced carriers.A low PL intensity also indicates the decrease in recombination rate 59,60.Fig. 8 shows the fluorescence spectra of the samples in a wavelength range of 350-550 nm.It can be seen that all the peaks displayed similar shapes, and three main characteristic peaks appeared at 398, 451, and 468 nm, which was corresponding to the energy levels of 3.12, 2.75, and 2.65 eV, respectively.That's to say, fluorescence peaks at 398 attributed to the emission peak towards excitation the band gap of anatase TiO 2 , and the other two fluorescence peaks derived from band-to-band transition of free carriers 61.The TiO 2 -0.2HF sample has the weakest PL emission probably because of the relatively low electrons and holes recombination rate.PL measurement results are in consistent with the order of the photocatalytic activity.EIS spectra is often used for characterizing the conductivity of an electrode, a small circular radius usually shows a lower charge transfer resistance 62.Fig. 9 shows the Nyquist plots of different samples, TiO 2 -1.5HF and TiO 2 -0HF show large semicircles, which is due to the higher percentage of the exposed (101) facets on the TiO 2 sample, which plays the role of recombination centres for photogenerated carriers and thus inhibit the charge separation.The better activity of TiO 2 -0HF than TiO 2 -1.5HF may be on account of the larger surface area.At the same time, it can obviously be seen that semicircles of TiO 2 -1HF, TiO 2 -0.5HF,TiO 2 -0.1HF modified electrodes decreased, which can be mainly attributed to surface heterojunction between (001) and (101) facets of TiO 2 .Interestingly, the impedance arc radius of TiO 2 -0.2HF is the smallest among samples implying that the highest separation efficiency of photogenerated electron-hole pairs was achieved from TiO 2 -0.2HF.This is attributed to the appropriate proportion between (001) and (101) facets, which extremely prevents the direct recombination of electrons and holes. The schematic diagram of proposed mechanism of CO 2 photoreduction process is shown in Fig. 10.When the ultrafine applanate truncated octahedral bipyramid TiO 2 nanocrystals was irradiated by Hg lamp, photo-induced electrons and holes were produced.The photogenerated electrons on the (001) facets could transport to the (101) facets due to their conduction band offset, and then react with the adsorbed CO 2 to generate CH 4 subsequently.Correspondingly, the photogenerated holes on the (101) facets could transfer to the (001) facets, and then react with the adsorbed H 2 O to generate O 2 and H .After loading of Pt nanoparticles, photo-generated electrons can be easily trapped by Pt because of its lower Fermi energy level, improving the separation efficiency of the photo-generated electron-hole pairs, and then the photoreduction rate of CO 2 to CH 4 was accelerated."}, {"llm generation": "Batch", "source": "In addition, the efficiency could remain nearly 80 after four cycle reactions, indicating the catalyst has a long-term stability.", "context": "In brief, ultrafine anatase TiO 2 nanocrystals with controllable coexposed (001) and (101) facets were prepared by a facile solvothermol strategy.1D NTA transformed to applanate truncated octahedral bipyramid TiO 2 nanocrystals, and the percentage of (001) facets can be adjusted from 5 to 51.TiO 2 -0.2HF with 51 of (001) facets and 49 (101) facets exhibited the highest photocatalytic activity in terms of both photoreduction CO 2 and photodegradation of MB.PL and EIS spectra results proved that the efficient surface heterojunctions between (001) and (101) facets are favourable for the separation of photogenerated charge carriers.What is more, the smaller size reduces recombination probability of photocarriers in the bulk.The photoreduction rate of CO 2 to CH 4 reached to 1.58 mol h -1 g -1 on TiO 2 -0.2HF, and the photoactivity increased remarkably to 4.0 mol h -1 g -1 after loaded Pt nanoparticles.In addition, the efficiency could remain nearly 80 after four cycle reactions, indicating the catalyst has a long-term stability.Moreover, little HF dosage is beneficial for subsequent industrial production, and this kind of ultrafine TiO 2 nanocrystals with surface heterojunction is potential for the development of solar cells, optoelectronic devices, sensors and heterogeneous catalysts. Fig. 1.XRD and Raman patterns of the photocatalysts. Fig. 2. XPS spectra of Ti2p (a), O1 s (b), F1 s (c) and Pt4f (d) in Pt-TiO2-0.2HFsample. Fig. 3. TEM and HRTEM images of TiO2-0.2HF(a, b), TiO2-0HF (c, d), Pt-TiO2-0.2HF(e, f), Pt-TiO2-0HF (g, h). Fig. 6.Photocatalytic activity of CH4 production rate of P25, P25-0.2HF and TiO2-xHF samples. Fig. 7. CH4 production rate of Pt-P25, TiO2-0HF and TiO2-0.2HFsamples and the inset displays the stability of Pt-TiO2-0.2HFnanoparticles on CO2 photoreduction in the consecutive four cycles. Fig. 8. PL spectra of the TiO2-xHF photocatalysts (excitated wavelength: 315 nm). Fig. 9. Nyquist plots of the TiO2-xHF samples. Fig. 10.Schematic diagram of mechanism of photocatalytic process. Effect of different volume of HF on the structural of TiO2 nanocystals. H radicals formed by the photodissociation of water are competitively consumed by CO 2 reduction intermediates like CO 2 to produce CH 4 ; (2) the produced H 2 could be consumed by reverse reactions with CO or O 2 .The formation rate of O 2 of Pt-TiO 2 -0.2HF catalyst reached to 5.2 mol h -1 g -1 , which is a little higher than the production rate of CH 4 (4 mol h -1 g -1 ).The production rate of O 2 and CH 4 is not in accordance with the molar ratio, which is possibly caused by the consumption of residual O 2 in the reactor through the reaction with photogenerated electrons: O 2 e - O 2 The authors gratefully acknowledge the support of the National Natural Science Foundation of China (Nos.21103042 and 21471047), Program for Science Technology Innovation Talents (15HASTIT043) and Innovative Research Team (16IRTSTHN015) from the University of Henan Province, and Program for Changjiang Scholars and Innovative Research Team in University from the Ministry of Education of China (PCS IRT1126). The manuscript was written through contributions of all authors.Yuhui Cao carried out the total experiment and wrote the first manuscript.Chen Li and Junli Li participated in the data analysis.Qiuye Li supervised the project.Jianjun Yang provided the facilities and discussions related to them.All authors read and approved the final manuscript. Supplementary data associated with this article can be found, in the online version, at http://dx.doi.org/10.1016/j.apcatb.2016.05.071."}]}}