{"DOI": "10.1039/d1se00245g", "paper_title": "Lanthanum bismuth oxide photocatalysts for CO<sub>2</sub>reduction to CO with high selectivity", "human validator": "hybrid annotator", "annotation": {"catalyst": [{"llm generation": "La 0.225 Bi 0.775 O 1.5, La 0.6 Bi 0.4 O 1.5, and La 1.08 Bi 0.92 O 3.03", "source": "Here, three kinds of lanthanum bismuth oxide semiconductors (La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 ) were found to exhibit activity for photocatalytic CO 2 reduction without any sacrificial agent.", "context": "Developing suitable photocatalysts is critical for CO 2 photoreduction processes using solar energy.Here, three kinds of lanthanum bismuth oxide semiconductors (La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 ) were found to exhibit activity for photocatalytic CO 2 reduction without any sacrificial agent.These photocatalysts showed 98 selectivity for CO 2 conversion to CO.Among these photocatalysts, La 0.225 Bi 0.775 O 1.5 exhibited the best performance (33.2 mmol g A1 ) for CO 2 photoreduction, which was approximately twice that of La 0.6 Bi 0.4 O 1.5 and La 1.08 Bi 0.92 O 3.03 .La 0.225 Bi 0.775 O 1.5 had a higher CO 2 adsorption capacity and more negative conduction band position than the other two photocatalysts.Furthermore, time-resolved fluorescence decay spectroscopy showed that La 0.225 Bi 0.775 O 1.5 had a much longer emission lifetime than La 0.6 Bi 0.4 O 1.5 and La 1.08 Bi 0.92 O 3.03 , indicating the reduced recombination of photogenerated electrons and holes in La 0.225 Bi 0.775 O 1.5 .We proposed a lattice oxygen-mediated mechanism for CO 2 photoreduction over La 0.225 Bi 0.775 O 1.5 in this study."}, {"llm generation": "La 0.225 Bi 0.775 O 1.5, La 0.6 Bi 0.4 O 1.5, and La 1.08 Bi 0.92 O 3.03 photocatalysts", "source": "According to Fig. S13 and the absorption spectra, the value of n was determined to be 2, which is more reasonable than 1; therefore, we infer that La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 photocatalysts are direct bandgap semiconductors.", "context": "The XRD patterns of the as-prepared La This journal is The Royal Society of Chemistry 2021 irradiation and H 2 O. 22 To conrm that the present conversion process was a photocatalytic reduction process, control experiments were carried out (Fig. S2a ).When there was no photocatalyst or CO 2 , there was no detectable product.In addition, there was no detectable product in the dark.These results implied that photocatalysts and light irradiation were both essential to photocatalytic CO 2 reduction and that the reduction products originated from the reduction of CO 2 rather than contamination. 23s shown in Fig. 2c and S2b, only a trace amount of CH 4 was detected, and the yield of CO was signicantly higher than that of CH 4 , indicating that CO was the major CO 2 reduction product, and the La-Bi-O samples achieved over 98 selectivity for CO 2 conversion to CO.During the process of photocatalytic CO 2 reduction, two-electron reaction pathways have more favourable kinetics, which means that this reaction is more likely to occur than a multi-electron reaction. 24 XPS spectra were obtained to analyse the surface chemical compositions and oxidation states of the La-Bi-O samples.The survey spectra of the samples in Fig. 3a indicated the presence of Bi, La, and O species, and there were no detectable impurity elements. 25he high-resolution XPS spectra of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 are exhibited in Fig. 3b-d, respectively.Two characteristic peaks at 158.7 eV and 164 eV were detected for all three La-Bi-O samples, which can be ascribed to the Bi 4f 7/2 and Bi 4f 5/2 orbitals of Bi 3 , 26 respectively.The La 3d XPS spectrum in Fig. 3c shows that the spin-orbit splitting between the 3d 3/2 and 3d 5/2 levels was 17 eV, while the separation between the satellite and main peak was approximately 3.6 eV, which agreed with the reported values for La 3 compounds. 27Fig.3d shows the O 1s XPS spectra of all synthesized materials.The O 1s peaks were tted with two peaks; the lower-binding energy peak can be assigned to the oxygen in the crystal lattice, and the higher-binding energy peak may represent the adsorbed oxygen. 28Moreover, Fig. 3d shows that the ratio of lattice oxygen to adsorbed oxygen in La 0.225 Bi 0.775 O 1.5 was signicantly higher than those of La 0.6 Bi 0.4 O 1.5 and La 1.08 Bi 0.92 O 3.03 . 29ig. 4 shows the XPS spectra of the samples aer photocatalytic CO 2 reduction.There is only a slight change in the La Sustainable Energy Fuels signicantly.The decrease in the catalytic activity shown in Fig. 2b may be attributed to the reduction in the ratio of lattice oxygen to adsorbed oxygen (Fig. 4). 30,31There was no characteristic ESR signal of oxygen vacancies observed in the EPR spectra (Fig. S6 ), indicating that there was no oxygen vacancy accumulation in these samples. 32e infer that the Bi-O bond is more active than the La-O bond, and the lattice oxygen of the Bi-O bond is more likely to take part in the photocatalytic reduction process.Compared to La 0.6 Bi 0. Combining the XPS and EPR results, the possible lattice oxygenmediated mechanism of the La 0.225 Bi 0.775 O 1.5 photocatalyst for CO 2 reduction is proposed in Scheme S1. In a complex photocatalytic reaction process involving two molecules of carbon dioxide and water, the general reaction equation is as follows: It is generally believed that the activation processes of the two molecules are carried out at different reaction sites. 29nspired by the lattice oxygen mechanism (LOM) of water oxidation in electrolyzed water for perovskite oxides, oxygen vacancies may be used as common active sites for the two molecules to accelerate the formation of products. 333435 Fig. S7a andb show the Bi 4f and O 1s XPS spectra of La 0.225 Bi 0.775 O 1.5 before and aer the photocatalytic reduction process, respectively.As can be seen from the Bi 4f XPS spectrum, the binding energy shis to a lower position, which means that Bi 2 species are reduced aer the photocatalytic reduction process.On the other hand, the ratio of lattice oxygen to adsorbed oxygen in La 0.225 Bi 0.775 O 1.5 signicantly decreased aer the reaction.Furthermore, aer the photocatalytic reduction process, the ESR signal of oxygen vacancies was observed, as shown in Fig. S7c. As Fig. S7 shows, the XPS spectra of O 1s and Bi 4f and the ESR data of the material aer the photocatalytic reaction of carbon dioxide and water clearly show the signicant reduction of lattice oxygen on the surface of La 0.225 Bi 0.775 O 1.5 , which indicates that lattice oxygen is involved as a reactive species. The structure of La 0.225 Bi 0.775 O 1.5 before the photocatalytic reduction process is shown in Scheme S1a. 36 The CO 2 molecular adsorption process is shown in Scheme S1b. Lattice oxygen on the surface of La 0.225 Bi 0.775 O 1.5 reacts with CO 2 under dark conditions as follows: Under light irradiation, lattice oxygen participates in the photocatalytic reduction process in Scheme S1c as follows: Therefore, we obtain a probable inference of the photocatalytic reduction process over La 0.225 Bi 0.775 O 1.5 .More oxygen vacancies enhance the adsorption of water molecules so that the reaction can proceed continuously.However, this also restrains the adsorption of CO 2 .In that case, there is a balanced relationship between the two processes.The cycle experiment proves that the continuous reduction of lattice oxygen decreases the activity of the photocatalyst.Therefore, aer annealing at 300 C, lattice oxygen of the active reduced material can be supplemented, and the activity of the catalyst is also obviously recovered (Fig. S12 ). The SEM images of La Transmission electron microscopy (TEM) analysis was performed to obtain details about the microstructure of the asprepared samples. 37,38The TEM images in Fig. S8(a-c Fig. 6a 7b were estimated to be 2.8, 2.7 and 2.7 eV, respectively, 41 by using the formula According to Fig. S13 and the absorption spectra, the value of n was determined to be 2, which is more reasonable than 1; therefore, we infer that La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 photocatalysts are direct bandgap semiconductors. 30As shown in Fig. 7c, the valence-band edges of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 were measured to be 1.20, 1.28, and 1.54 eV below the Fermi level estimated by the linear extrapolation method, respectively.The conduction band (CB) potential can be estimated using CO 2 reduction.Cocatalysts may be loaded onto La-Bi-O photocatalysts to improve durability and efficiency since they can offer sites for trapping photoinduced charges and promote charge separation kinetics. 45,46"}, {"llm generation": "La-Bi-O semiconductors (La 0.225 Bi 0.775 O 1.5, La 0.6 Bi 0.4 O 1.5, and La 1.08 Bi 0.92 O 3.03)", "source": "La-Bi-O semiconductors (La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 ) were found to be new photocatalysts for CO 2 reduction.", "context": "La-Bi-O semiconductors (La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 ) were found to be new photocatalysts for CO 2 reduction.La 0.225 Bi 0.775 O 1.5 exhibited the highest photoreduction efficiency and highly selective formation of CO because it exhibited a higher CO 2 adsorption capacity, a more negative CB position and more efficient photoinduced charge transfer and separation than the other two photocatalysts.La-Bi-O semiconductors exhibit great potential in CO 2 reduction. Photocatalytic activityThe photocatalytic activities of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 were assessed by CO 2 reduction with light Fig. 2a shows that La 0.225 Bi 0.775 O 1.5 (33.2 mmol g A1 ) exhibited a higher photocatalytic activity and a much higher CO yield La 0.6 Bi 0.4 O 1.5 (12.5 mmol g A1 ) and La 1.08 Bi 0.92 O 3.03 (13.5 mmol g A1 ).Five cycles of photocatalytic experiments were carried out to assess the stability of the La 0.225 Bi 0.775 O 1.5 sample, and the results are shown in Fig. 2b.CO production decreased by approximately 50 aer ve cycles over La 0.225 Bi 0.775 O 1.5 .Fig. S2c shows that the production of CH 4 slightly increased as CO production in the competitive reaction decreased aer ve cycles.No signicant crystalline structure change was observed (Fig. S3 ), which suggested that these photocatalysts were stable during the process of CO 2 reduction.To study the elemental dispersion in the La-Bi-O catalysts, energy dispersive X-ray spectroscopy (EDX) was carried out.As shown in Fig. S4 and S5, EDS elemental mapping images indicated the uniform distribution of Bi, La, and O in these catalysts before and aer the photocatalytic reaction. 3d and Bi 4f spectra of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 aer photocatalytic CO 2 reduction.There is also no obvious change in the O 1s spectra of La 0.6 Bi 0.4 O 1.5 and La 1.08 Bi 0.92 O 3.03 aer the reaction, while the ratio of lattice oxygen to the adsorbed oxygen of La 0.225 Bi 0.775 O 1.5 decreased Fig. 2 (a) Product yields of CO over La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 .(b) Stability test of CO in five cycles over La 0.225 Bi 0.775 O 1.5 .(c) Selectivity of photocatalytic materials for CO production. Fig. 3 (a) XPS survey spectra of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 and high-resolution (b) Bi 4f, (c) La 3d, and (d) O 1s XPS spectra of the La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 samples. 4 O 1.5 and La 1.08 Bi 0.92 O 3.03 , La 0.225 Bi 0.775 O 1.5 has a larger number of Bi-O bonds.Therefore, we compared the O 1s spectrum of Bi 2 O 3 before and aer photocatalytic CO 2 reduction experiments.As Fig. S11 shows, the ratio of lattice oxygen to the adsorbed oxygen of Bi 2 O 3 decreased signicantly aer the reaction, indicating that the Bi-O bond is active in the photocatalytic reduction process.CO 2 photoreduction mechanism of La 0.225 Bi 0.775 O 1.5 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 are shown in Fig. 5.The as-prepared La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 samples appeared in the form of irregular lumps, with the size of the particles varying from 1 to 10 mm. Fig. 5 SEM images of (a) La 0.225 Bi 0.775 O 1.5 , (b) La 0.6 Bi 0.4 O 1.5 , and (c) La 1.08 Bi 0.92 O 3.03 and HRTEM images of (d) La 0.225 Bi 0.775 O 1.5 , (e) La 0.6 Bi 0.4 O 1.5 , and (f) La 1.08 Bi 0.92 O 3.03 . Band structure and carrier separationAs shown in the UV-vis diffuse reectance spectra of Fig.7a, La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 can all respond to visible light, and their photoabsorption edges are at 466, 512, and 512 nm, respectively. 39The Mott-Schottky plot (Fig. S9, ESI ) suggests that La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 are n-type conducting semiconductors with a positive slope. 40The band gaps of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 in Fig. ) from the calculated E vb and E cb of the samples, and the band positions of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 are displayed in Fig. 7d. 42Obviously, the E cb values of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 were more negative than the CH 4 /CO 2 (A0.24 eV) and CO/CO 2 (A0.53 eV) reduction potentials, and the La 0.225 Bi 0.775 O 1.5 sample had a more negative E cb than the La 0.6 Bi 0.4 O 1.5 and La 1.08 Bi 0.92 O 3.03 samples.Because of the lower position of the CB, electrons in the CB of La 0.225 Bi 0.775 O 1.5 could more easily reduce CO 2 intermediates to CH 4 and CO than those of La 0.6 Bi 0.4 O 1.5 and La 1.08 Bi 0.92 O 3.03 .The Nyquist plots of La 0.225 Bi 0.775 O 1.5 in Fig. S10 exhibited a smaller impedance radius than those of La 0.6 Bi 0.4 O 1.5 and La 1.08 Bi 0.92 O 3.03 , revealing that the photogenerated charge transfer of La 0.225 Bi 0.775 O 1.5 had less electric resistance, indicating that La 0.225 Bi 0.775 O 1.5 had better photoinduced charge transfer, which can be benecial to the photocatalytic CO 2 reduction process. 43,44Moreover, the steady-state PL spectra in Fig. 7e revealed that La 0.225 Bi 0.775 O 1.5 exhibited the lowest recombination rate because it exhibited the weakest emission intensity.Meanwhile, the time-resolved uorescence decay spectra in Fig. 7f and Table S1 show that the average emission lifetime of La 0.225 Bi 0.775 O 1.5 (48.4 ms) is signicantly longer than those of La 0.6 Bi 0.4 O 1.5 (24.2 ms) and La 1.08 Bi 0.92 O 3.03 (29.0 ms), implying that the recombination of photogenerated electrons and holes is much more restrained in La 0.225 Bi 0.775 O 1.5 .The more efficient photoinduced charge transfer and separation of La 0.225 Bi 0.775 O 1.5 can help it become a better photocatalyst for Fig. 6 (a) N 2 adsorption-desorption isotherms and (b) CO 2 adsorption isotherms of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , La 1.08 Bi 0.92 O 3.03 and Bi 2 O 3 . Fig. 7 (a) UV-vis diffuse reflectance spectra, (b) relationship between (ahn) 1/2 and hn, (c) valence-band XPS spectra, (d) band edge arrangement at pH 14 7, (e) steady-state PL spectra, and (f) time-resolved fluorescence decay spectroscopy of the samples. 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 , with Bi 2 O 3 -related structures exhibited photocatalytic performances for CO 2 reduction.The introduction of La may increase the CO 2 adsorption capacity of bismuth-based oxides.La-Bi-O semiconductors may have great potential in CO 2 photoreduction. shows the N 2 adsorption-desorption isotherms of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 .The specic surface areas of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 and La 1.08 Bi 0.92 O 3.03 are 4.5, 1.4 and 0.99 m 2 g A1 , respectively.As shown in Fig. 6b, La 0.225 Bi 0.775 O 1.5 had an obviously higher CO 2 adsorption capacity than La 0.6 Bi 0.4 O 1.5 and La 1.08 Bi 0.92 O 3.03 .On the other hand, La 0.225 Bi 0.775 O 1.5 and La 0.6 Bi 0.4 O 1.5 have higher CO 2 adsorption capacities than Bi 2 O 3 , indicating that the introduction of appropriate amounts of La may increase the CO 2 adsorption capacity of bismuth-based oxides.Among these La-Bi-O photocatalysts, the La 0.225 Bi 0.775 O 1.5 sample had the largest specic surface area and the strongest CO 2 adsorption capacities, which favoured photocatalytic CO 2 reduction. This journal is The Royal Society of Chemistry 2021Sustainable Energy Fuels Sustainable Energy FuelsThis journal is The Royal Society of Chemistry 2021 The authors thank the National Key Research and Development Program of China (No. 2018YFA0209303 and 2020YFA0710302), National Natural Science Foundation of China (No. 22025202 and 51972165), and Natural Science Foundation of Jiangsu Province (BK20202003) for nancial support. There are no conicts to declare."}], "co-catalyst": [], "light source": [{"llm generation": "Solar", "source": "Developing suitable photocatalysts is critical for CO 2 photoreduction processes using solar energy.", "context": "Developing suitable photocatalysts is critical for CO 2 photoreduction processes using solar energy.Here, three kinds of lanthanum bismuth oxide semiconductors (La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 ) were found to exhibit activity for photocatalytic CO 2 reduction without any sacrificial agent.These photocatalysts showed 98 selectivity for CO 2 conversion to CO.Among these photocatalysts, La 0.225 Bi 0.775 O 1.5 exhibited the best performance (33.2 mmol g A1 ) for CO 2 photoreduction, which was approximately twice that of La 0.6 Bi 0.4 O 1.5 and La 1.08 Bi 0.92 O 3.03 .La 0.225 Bi 0.775 O 1.5 had a higher CO 2 adsorption capacity and more negative conduction band position than the other two photocatalysts.Furthermore, time-resolved fluorescence decay spectroscopy showed that La 0.225 Bi 0.775 O 1.5 had a much longer emission lifetime than La 0.6 Bi 0.4 O 1.5 and La 1.08 Bi 0.92 O 3.03 , indicating the reduced recombination of photogenerated electrons and holes in La 0.225 Bi 0.775 O 1.5 .We proposed a lattice oxygen-mediated mechanism for CO 2 photoreduction over La 0.225 Bi 0.775 O 1.5 in this study."}, {"llm generation": "Xenon arc lamp", "source": "Then, the glass cell was put into a glass reactor connected to a closed system, and a 300 W Xenon arc lamp was used as the light source.", "context": "In this study, all chemicals from commercial sources were of analytical grade and were used without further purication.La 0.225 Bi 0.775 O 1.5 powder samples were prepared through the solid-state reaction of Bi 2 O 3 and La 2 O 3 (purities of 99.9) obtained from commercial products.Stoichiometric proportions of the reactants were accurately weighed and milled in an agate mortar.The mixtures of Bi 2 O 3 and La 2 O 3 were preheated at 350 C for 1 h.Aer being thoroughly ground again, the mixtures were heated at 900 C for 24 h.The samples were slowly cooled to room temperature. 17a 0.6 Bi 0.4 O 1.5 and La 1.08 Bi 0.92 O 3.03 powder samples were prepared by the same method, except that the solid reaction conditions aer preheating were changed to 1300 C for 24 h and 1200 C for 48 h, respectively.18,19 Analytical methods Powder X-ray diffraction (XRD) analysis of the La-Bi-O samples was performed on an X-ray diffractometer (Rigaku Ultima III, Japan) with Cu Ka radiation.The morphology and energy dispersive X-ray (EDX) spectra of the as-prepared samples were characterized using scanning electron microscopy (SEM, Carl Zeiss SMT AG, Germany) and transmission electron microscopy (TEM, JEOL JEM 2100, Japan).Fourier transform infrared spectroscopy was performed on a Nexus 870 infrared spectrometer (Nicolet, USA). X-ray photoelectron spectroscopy (XPS) analysis of the samples was performed on a photoelectron spectrometer (PHI5000 Versa Probe, ULVAC-PHI, Japan) with a monochromatized Al Ka radiation source used as the X-ray source.The binding energy of the samples was calibrated with reference to the C 1s peak at 284.8 eV.The UV-vis diffuse reectance spectra of the samples were measured on a Lambda 950 (Per-kinElmer, USA) UV-vis spectrophotometer in the range of 250-1000 nm, and the absorption spectra were transformed from the reectance spectra according to the Kubelka-Munk relationship.The specic surface area and CO 2 adsorption capacities of the La-Bi-O samples were measured on a Brunauer-Emmett-Teller (BET) surface area and porosity analyser (TriStar-3000, Micromeritics, USA).Time-resolved uorescence decay spectroscopy of the samples was performed on a FLS1000 spectrometer with a 375 nm excitation wavelength (Edinburgh, United Kingdom). Nyquist plots were obtained with a typical three-electrode system using 0.1 M NaOH as the electrolyte solution.The working electrode was prepared via electrophoretic deposition to coat powder samples on uorine-doped tin oxide (FTO) glass pieces.Mott-Schottky plots of the as-prepared samples were recorded in the dark by applying potentials at a 1500 Hz frequency. Photocatalytic CO 2 reduction over the samples was performed in a gas-tight system.In this study, 50 mg photocatalyst sample was uniformly dispersed on a glass cell.Then, the glass cell was put into a glass reactor connected to a closed system, and a 300 W Xenon arc lamp was used as the light source.The reaction system with a volume of approximately 230 ml was placed under vacuum several times.For photocatalytic CO 2 reduction, high purity CO 2 was fed into the system to obtain atmospheric pressure, and then, 0.4 ml deionized water was injected into the reactor.Before illumination, the reaction system was put in the dark for 12 h to reach adsorptiondesorption equilibrium with a gas pump to accelerate gas diffusion.During illumination, 1 ml gas sample was extracted at a given interval using a gas-tight syringe for the subsequent analysis of CO 2 reduction products by gas chromatography (GC-2014, Shimadzu, Japan).Five cycles of photocatalytic experiments were carried out, and each cycle lasted 8 h.The reaction system was relled with CO 2 and pure water aer each cycle."}, {"llm generation": "visible light", "source": "As shown in the UV-vis diffuse reectance spectra of Fig.7a, La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 can all respond to visible light, and their photoabsorption edges are at 466, 512, and 512 nm, respectively.", "context": "La-Bi-O semiconductors (La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 ) were found to be new photocatalysts for CO 2 reduction.La 0.225 Bi 0.775 O 1.5 exhibited the highest photoreduction efficiency and highly selective formation of CO because it exhibited a higher CO 2 adsorption capacity, a more negative CB position and more efficient photoinduced charge transfer and separation than the other two photocatalysts.La-Bi-O semiconductors exhibit great potential in CO 2 reduction. Photocatalytic activityThe photocatalytic activities of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 were assessed by CO 2 reduction with light Fig. 2a shows that La 0.225 Bi 0.775 O 1.5 (33.2 mmol g A1 ) exhibited a higher photocatalytic activity and a much higher CO yield La 0.6 Bi 0.4 O 1.5 (12.5 mmol g A1 ) and La 1.08 Bi 0.92 O 3.03 (13.5 mmol g A1 ).Five cycles of photocatalytic experiments were carried out to assess the stability of the La 0.225 Bi 0.775 O 1.5 sample, and the results are shown in Fig. 2b.CO production decreased by approximately 50 aer ve cycles over La 0.225 Bi 0.775 O 1.5 .Fig. S2c shows that the production of CH 4 slightly increased as CO production in the competitive reaction decreased aer ve cycles.No signicant crystalline structure change was observed (Fig. S3 ), which suggested that these photocatalysts were stable during the process of CO 2 reduction.To study the elemental dispersion in the La-Bi-O catalysts, energy dispersive X-ray spectroscopy (EDX) was carried out.As shown in Fig. S4 and S5, EDS elemental mapping images indicated the uniform distribution of Bi, La, and O in these catalysts before and aer the photocatalytic reaction. 3d and Bi 4f spectra of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 aer photocatalytic CO 2 reduction.There is also no obvious change in the O 1s spectra of La 0.6 Bi 0.4 O 1.5 and La 1.08 Bi 0.92 O 3.03 aer the reaction, while the ratio of lattice oxygen to the adsorbed oxygen of La 0.225 Bi 0.775 O 1.5 decreased Fig. 2 (a) Product yields of CO over La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 .(b) Stability test of CO in five cycles over La 0.225 Bi 0.775 O 1.5 .(c) Selectivity of photocatalytic materials for CO production. Fig. 3 (a) XPS survey spectra of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 and high-resolution (b) Bi 4f, (c) La 3d, and (d) O 1s XPS spectra of the La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 samples. 4 O 1.5 and La 1.08 Bi 0.92 O 3.03 , La 0.225 Bi 0.775 O 1.5 has a larger number of Bi-O bonds.Therefore, we compared the O 1s spectrum of Bi 2 O 3 before and aer photocatalytic CO 2 reduction experiments.As Fig. S11 shows, the ratio of lattice oxygen to the adsorbed oxygen of Bi 2 O 3 decreased signicantly aer the reaction, indicating that the Bi-O bond is active in the photocatalytic reduction process.CO 2 photoreduction mechanism of La 0.225 Bi 0.775 O 1.5 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 are shown in Fig. 5.The as-prepared La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 samples appeared in the form of irregular lumps, with the size of the particles varying from 1 to 10 mm. Fig. 5 SEM images of (a) La 0.225 Bi 0.775 O 1.5 , (b) La 0.6 Bi 0.4 O 1.5 , and (c) La 1.08 Bi 0.92 O 3.03 and HRTEM images of (d) La 0.225 Bi 0.775 O 1.5 , (e) La 0.6 Bi 0.4 O 1.5 , and (f) La 1.08 Bi 0.92 O 3.03 . Band structure and carrier separationAs shown in the UV-vis diffuse reectance spectra of Fig.7a, La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 can all respond to visible light, and their photoabsorption edges are at 466, 512, and 512 nm, respectively. 39The Mott-Schottky plot (Fig. S9, ESI ) suggests that La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 are n-type conducting semiconductors with a positive slope. 40The band gaps of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 in Fig. ) from the calculated E vb and E cb of the samples, and the band positions of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 are displayed in Fig. 7d. 42Obviously, the E cb values of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 were more negative than the CH 4 /CO 2 (A0.24 eV) and CO/CO 2 (A0.53 eV) reduction potentials, and the La 0.225 Bi 0.775 O 1.5 sample had a more negative E cb than the La 0.6 Bi 0.4 O 1.5 and La 1.08 Bi 0.92 O 3.03 samples.Because of the lower position of the CB, electrons in the CB of La 0.225 Bi 0.775 O 1.5 could more easily reduce CO 2 intermediates to CH 4 and CO than those of La 0.6 Bi 0.4 O 1.5 and La 1.08 Bi 0.92 O 3.03 .The Nyquist plots of La 0.225 Bi 0.775 O 1.5 in Fig. S10 exhibited a smaller impedance radius than those of La 0.6 Bi 0.4 O 1.5 and La 1.08 Bi 0.92 O 3.03 , revealing that the photogenerated charge transfer of La 0.225 Bi 0.775 O 1.5 had less electric resistance, indicating that La 0.225 Bi 0.775 O 1.5 had better photoinduced charge transfer, which can be benecial to the photocatalytic CO 2 reduction process. 43,44Moreover, the steady-state PL spectra in Fig. 7e revealed that La 0.225 Bi 0.775 O 1.5 exhibited the lowest recombination rate because it exhibited the weakest emission intensity.Meanwhile, the time-resolved uorescence decay spectra in Fig. 7f and Table S1 show that the average emission lifetime of La 0.225 Bi 0.775 O 1.5 (48.4 ms) is signicantly longer than those of La 0.6 Bi 0.4 O 1.5 (24.2 ms) and La 1.08 Bi 0.92 O 3.03 (29.0 ms), implying that the recombination of photogenerated electrons and holes is much more restrained in La 0.225 Bi 0.775 O 1.5 .The more efficient photoinduced charge transfer and separation of La 0.225 Bi 0.775 O 1.5 can help it become a better photocatalyst for Fig. 6 (a) N 2 adsorption-desorption isotherms and (b) CO 2 adsorption isotherms of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , La 1.08 Bi 0.92 O 3.03 and Bi 2 O 3 . Fig. 7 (a) UV-vis diffuse reflectance spectra, (b) relationship between (ahn) 1/2 and hn, (c) valence-band XPS spectra, (d) band edge arrangement at pH 14 7, (e) steady-state PL spectra, and (f) time-resolved fluorescence decay spectroscopy of the samples. 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 , with Bi 2 O 3 -related structures exhibited photocatalytic performances for CO 2 reduction.The introduction of La may increase the CO 2 adsorption capacity of bismuth-based oxides.La-Bi-O semiconductors may have great potential in CO 2 photoreduction. shows the N 2 adsorption-desorption isotherms of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 .The specic surface areas of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 and La 1.08 Bi 0.92 O 3.03 are 4.5, 1.4 and 0.99 m 2 g A1 , respectively.As shown in Fig. 6b, La 0.225 Bi 0.775 O 1.5 had an obviously higher CO 2 adsorption capacity than La 0.6 Bi 0.4 O 1.5 and La 1.08 Bi 0.92 O 3.03 .On the other hand, La 0.225 Bi 0.775 O 1.5 and La 0.6 Bi 0.4 O 1.5 have higher CO 2 adsorption capacities than Bi 2 O 3 , indicating that the introduction of appropriate amounts of La may increase the CO 2 adsorption capacity of bismuth-based oxides.Among these La-Bi-O photocatalysts, the La 0.225 Bi 0.775 O 1.5 sample had the largest specic surface area and the strongest CO 2 adsorption capacities, which favoured photocatalytic CO 2 reduction. This journal is The Royal Society of Chemistry 2021Sustainable Energy Fuels Sustainable Energy FuelsThis journal is The Royal Society of Chemistry 2021 The authors thank the National Key Research and Development Program of China (No. 2018YFA0209303 and 2020YFA0710302), National Natural Science Foundation of China (No. 22025202 and 51972165), and Natural Science Foundation of Jiangsu Province (BK20202003) for nancial support. There are no conicts to declare."}], "lamp": [{"llm generation": "Xenon", "source": "Then, the glass cell was put into a glass reactor connected to a closed system, and a 300 W Xenon arc lamp was used as the light source.", "context": "In this study, all chemicals from commercial sources were of analytical grade and were used without further purication.La 0.225 Bi 0.775 O 1.5 powder samples were prepared through the solid-state reaction of Bi 2 O 3 and La 2 O 3 (purities of 99.9) obtained from commercial products.Stoichiometric proportions of the reactants were accurately weighed and milled in an agate mortar.The mixtures of Bi 2 O 3 and La 2 O 3 were preheated at 350 C for 1 h.Aer being thoroughly ground again, the mixtures were heated at 900 C for 24 h.The samples were slowly cooled to room temperature. 17a 0.6 Bi 0.4 O 1.5 and La 1.08 Bi 0.92 O 3.03 powder samples were prepared by the same method, except that the solid reaction conditions aer preheating were changed to 1300 C for 24 h and 1200 C for 48 h, respectively.18,19 Analytical methods Powder X-ray diffraction (XRD) analysis of the La-Bi-O samples was performed on an X-ray diffractometer (Rigaku Ultima III, Japan) with Cu Ka radiation.The morphology and energy dispersive X-ray (EDX) spectra of the as-prepared samples were characterized using scanning electron microscopy (SEM, Carl Zeiss SMT AG, Germany) and transmission electron microscopy (TEM, JEOL JEM 2100, Japan).Fourier transform infrared spectroscopy was performed on a Nexus 870 infrared spectrometer (Nicolet, USA). X-ray photoelectron spectroscopy (XPS) analysis of the samples was performed on a photoelectron spectrometer (PHI5000 Versa Probe, ULVAC-PHI, Japan) with a monochromatized Al Ka radiation source used as the X-ray source.The binding energy of the samples was calibrated with reference to the C 1s peak at 284.8 eV.The UV-vis diffuse reectance spectra of the samples were measured on a Lambda 950 (Per-kinElmer, USA) UV-vis spectrophotometer in the range of 250-1000 nm, and the absorption spectra were transformed from the reectance spectra according to the Kubelka-Munk relationship.The specic surface area and CO 2 adsorption capacities of the La-Bi-O samples were measured on a Brunauer-Emmett-Teller (BET) surface area and porosity analyser (TriStar-3000, Micromeritics, USA).Time-resolved uorescence decay spectroscopy of the samples was performed on a FLS1000 spectrometer with a 375 nm excitation wavelength (Edinburgh, United Kingdom). Nyquist plots were obtained with a typical three-electrode system using 0.1 M NaOH as the electrolyte solution.The working electrode was prepared via electrophoretic deposition to coat powder samples on uorine-doped tin oxide (FTO) glass pieces.Mott-Schottky plots of the as-prepared samples were recorded in the dark by applying potentials at a 1500 Hz frequency. Photocatalytic CO 2 reduction over the samples was performed in a gas-tight system.In this study, 50 mg photocatalyst sample was uniformly dispersed on a glass cell.Then, the glass cell was put into a glass reactor connected to a closed system, and a 300 W Xenon arc lamp was used as the light source.The reaction system with a volume of approximately 230 ml was placed under vacuum several times.For photocatalytic CO 2 reduction, high purity CO 2 was fed into the system to obtain atmospheric pressure, and then, 0.4 ml deionized water was injected into the reactor.Before illumination, the reaction system was put in the dark for 12 h to reach adsorptiondesorption equilibrium with a gas pump to accelerate gas diffusion.During illumination, 1 ml gas sample was extracted at a given interval using a gas-tight syringe for the subsequent analysis of CO 2 reduction products by gas chromatography (GC-2014, Shimadzu, Japan).Five cycles of photocatalytic experiments were carried out, and each cycle lasted 8 h.The reaction system was relled with CO 2 and pure water aer each cycle."}], "reaction medium": [{"llm generation": "Gas", "source": "For photocatalytic CO 2 reduction, high purity CO 2 was fed into the system to obtain atmospheric pressure, and then, 0.4 ml deionized water was injected into the reactor.", "context": "In this study, all chemicals from commercial sources were of analytical grade and were used without further purication.La 0.225 Bi 0.775 O 1.5 powder samples were prepared through the solid-state reaction of Bi 2 O 3 and La 2 O 3 (purities of 99.9) obtained from commercial products.Stoichiometric proportions of the reactants were accurately weighed and milled in an agate mortar.The mixtures of Bi 2 O 3 and La 2 O 3 were preheated at 350 C for 1 h.Aer being thoroughly ground again, the mixtures were heated at 900 C for 24 h.The samples were slowly cooled to room temperature. 17a 0.6 Bi 0.4 O 1.5 and La 1.08 Bi 0.92 O 3.03 powder samples were prepared by the same method, except that the solid reaction conditions aer preheating were changed to 1300 C for 24 h and 1200 C for 48 h, respectively.18,19 Analytical methods Powder X-ray diffraction (XRD) analysis of the La-Bi-O samples was performed on an X-ray diffractometer (Rigaku Ultima III, Japan) with Cu Ka radiation.The morphology and energy dispersive X-ray (EDX) spectra of the as-prepared samples were characterized using scanning electron microscopy (SEM, Carl Zeiss SMT AG, Germany) and transmission electron microscopy (TEM, JEOL JEM 2100, Japan).Fourier transform infrared spectroscopy was performed on a Nexus 870 infrared spectrometer (Nicolet, USA). X-ray photoelectron spectroscopy (XPS) analysis of the samples was performed on a photoelectron spectrometer (PHI5000 Versa Probe, ULVAC-PHI, Japan) with a monochromatized Al Ka radiation source used as the X-ray source.The binding energy of the samples was calibrated with reference to the C 1s peak at 284.8 eV.The UV-vis diffuse reectance spectra of the samples were measured on a Lambda 950 (Per-kinElmer, USA) UV-vis spectrophotometer in the range of 250-1000 nm, and the absorption spectra were transformed from the reectance spectra according to the Kubelka-Munk relationship.The specic surface area and CO 2 adsorption capacities of the La-Bi-O samples were measured on a Brunauer-Emmett-Teller (BET) surface area and porosity analyser (TriStar-3000, Micromeritics, USA).Time-resolved uorescence decay spectroscopy of the samples was performed on a FLS1000 spectrometer with a 375 nm excitation wavelength (Edinburgh, United Kingdom). Nyquist plots were obtained with a typical three-electrode system using 0.1 M NaOH as the electrolyte solution.The working electrode was prepared via electrophoretic deposition to coat powder samples on uorine-doped tin oxide (FTO) glass pieces.Mott-Schottky plots of the as-prepared samples were recorded in the dark by applying potentials at a 1500 Hz frequency. Photocatalytic CO 2 reduction over the samples was performed in a gas-tight system.In this study, 50 mg photocatalyst sample was uniformly dispersed on a glass cell.Then, the glass cell was put into a glass reactor connected to a closed system, and a 300 W Xenon arc lamp was used as the light source.The reaction system with a volume of approximately 230 ml was placed under vacuum several times.For photocatalytic CO 2 reduction, high purity CO 2 was fed into the system to obtain atmospheric pressure, and then, 0.4 ml deionized water was injected into the reactor.Before illumination, the reaction system was put in the dark for 12 h to reach adsorptiondesorption equilibrium with a gas pump to accelerate gas diffusion.During illumination, 1 ml gas sample was extracted at a given interval using a gas-tight syringe for the subsequent analysis of CO 2 reduction products by gas chromatography (GC-2014, Shimadzu, Japan).Five cycles of photocatalytic experiments were carried out, and each cycle lasted 8 h.The reaction system was relled with CO 2 and pure water aer each cycle."}, {"llm generation": "Gas", "source": "The photocatalytic activities of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 were assessed by CO 2 reduction with light", "context": "La-Bi-O semiconductors (La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 ) were found to be new photocatalysts for CO 2 reduction.La 0.225 Bi 0.775 O 1.5 exhibited the highest photoreduction efficiency and highly selective formation of CO because it exhibited a higher CO 2 adsorption capacity, a more negative CB position and more efficient photoinduced charge transfer and separation than the other two photocatalysts.La-Bi-O semiconductors exhibit great potential in CO 2 reduction. Photocatalytic activityThe photocatalytic activities of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 were assessed by CO 2 reduction with light Fig. 2a shows that La 0.225 Bi 0.775 O 1.5 (33.2 mmol g A1 ) exhibited a higher photocatalytic activity and a much higher CO yield La 0.6 Bi 0.4 O 1.5 (12.5 mmol g A1 ) and La 1.08 Bi 0.92 O 3.03 (13.5 mmol g A1 ).Five cycles of photocatalytic experiments were carried out to assess the stability of the La 0.225 Bi 0.775 O 1.5 sample, and the results are shown in Fig. 2b.CO production decreased by approximately 50 aer ve cycles over La 0.225 Bi 0.775 O 1.5 .Fig. S2c shows that the production of CH 4 slightly increased as CO production in the competitive reaction decreased aer ve cycles.No signicant crystalline structure change was observed (Fig. S3 ), which suggested that these photocatalysts were stable during the process of CO 2 reduction.To study the elemental dispersion in the La-Bi-O catalysts, energy dispersive X-ray spectroscopy (EDX) was carried out.As shown in Fig. S4 and S5, EDS elemental mapping images indicated the uniform distribution of Bi, La, and O in these catalysts before and aer the photocatalytic reaction. 3d and Bi 4f spectra of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 aer photocatalytic CO 2 reduction.There is also no obvious change in the O 1s spectra of La 0.6 Bi 0.4 O 1.5 and La 1.08 Bi 0.92 O 3.03 aer the reaction, while the ratio of lattice oxygen to the adsorbed oxygen of La 0.225 Bi 0.775 O 1.5 decreased Fig. 2 (a) Product yields of CO over La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 .(b) Stability test of CO in five cycles over La 0.225 Bi 0.775 O 1.5 .(c) Selectivity of photocatalytic materials for CO production. Fig. 3 (a) XPS survey spectra of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 and high-resolution (b) Bi 4f, (c) La 3d, and (d) O 1s XPS spectra of the La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 samples. 4 O 1.5 and La 1.08 Bi 0.92 O 3.03 , La 0.225 Bi 0.775 O 1.5 has a larger number of Bi-O bonds.Therefore, we compared the O 1s spectrum of Bi 2 O 3 before and aer photocatalytic CO 2 reduction experiments.As Fig. S11 shows, the ratio of lattice oxygen to the adsorbed oxygen of Bi 2 O 3 decreased signicantly aer the reaction, indicating that the Bi-O bond is active in the photocatalytic reduction process.CO 2 photoreduction mechanism of La 0.225 Bi 0.775 O 1.5 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 are shown in Fig. 5.The as-prepared La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 samples appeared in the form of irregular lumps, with the size of the particles varying from 1 to 10 mm. Fig. 5 SEM images of (a) La 0.225 Bi 0.775 O 1.5 , (b) La 0.6 Bi 0.4 O 1.5 , and (c) La 1.08 Bi 0.92 O 3.03 and HRTEM images of (d) La 0.225 Bi 0.775 O 1.5 , (e) La 0.6 Bi 0.4 O 1.5 , and (f) La 1.08 Bi 0.92 O 3.03 . Band structure and carrier separationAs shown in the UV-vis diffuse reectance spectra of Fig.7a, La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 can all respond to visible light, and their photoabsorption edges are at 466, 512, and 512 nm, respectively. 39The Mott-Schottky plot (Fig. S9, ESI ) suggests that La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 are n-type conducting semiconductors with a positive slope. 40The band gaps of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 in Fig. ) from the calculated E vb and E cb of the samples, and the band positions of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 are displayed in Fig. 7d. 42Obviously, the E cb values of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 were more negative than the CH 4 /CO 2 (A0.24 eV) and CO/CO 2 (A0.53 eV) reduction potentials, and the La 0.225 Bi 0.775 O 1.5 sample had a more negative E cb than the La 0.6 Bi 0.4 O 1.5 and La 1.08 Bi 0.92 O 3.03 samples.Because of the lower position of the CB, electrons in the CB of La 0.225 Bi 0.775 O 1.5 could more easily reduce CO 2 intermediates to CH 4 and CO than those of La 0.6 Bi 0.4 O 1.5 and La 1.08 Bi 0.92 O 3.03 .The Nyquist plots of La 0.225 Bi 0.775 O 1.5 in Fig. S10 exhibited a smaller impedance radius than those of La 0.6 Bi 0.4 O 1.5 and La 1.08 Bi 0.92 O 3.03 , revealing that the photogenerated charge transfer of La 0.225 Bi 0.775 O 1.5 had less electric resistance, indicating that La 0.225 Bi 0.775 O 1.5 had better photoinduced charge transfer, which can be benecial to the photocatalytic CO 2 reduction process. 43,44Moreover, the steady-state PL spectra in Fig. 7e revealed that La 0.225 Bi 0.775 O 1.5 exhibited the lowest recombination rate because it exhibited the weakest emission intensity.Meanwhile, the time-resolved uorescence decay spectra in Fig. 7f and Table S1 show that the average emission lifetime of La 0.225 Bi 0.775 O 1.5 (48.4 ms) is signicantly longer than those of La 0.6 Bi 0.4 O 1.5 (24.2 ms) and La 1.08 Bi 0.92 O 3.03 (29.0 ms), implying that the recombination of photogenerated electrons and holes is much more restrained in La 0.225 Bi 0.775 O 1.5 .The more efficient photoinduced charge transfer and separation of La 0.225 Bi 0.775 O 1.5 can help it become a better photocatalyst for Fig. 6 (a) N 2 adsorption-desorption isotherms and (b) CO 2 adsorption isotherms of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , La 1.08 Bi 0.92 O 3.03 and Bi 2 O 3 . Fig. 7 (a) UV-vis diffuse reflectance spectra, (b) relationship between (ahn) 1/2 and hn, (c) valence-band XPS spectra, (d) band edge arrangement at pH 14 7, (e) steady-state PL spectra, and (f) time-resolved fluorescence decay spectroscopy of the samples. 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 , with Bi 2 O 3 -related structures exhibited photocatalytic performances for CO 2 reduction.The introduction of La may increase the CO 2 adsorption capacity of bismuth-based oxides.La-Bi-O semiconductors may have great potential in CO 2 photoreduction. shows the N 2 adsorption-desorption isotherms of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 .The specic surface areas of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 and La 1.08 Bi 0.92 O 3.03 are 4.5, 1.4 and 0.99 m 2 g A1 , respectively.As shown in Fig. 6b, La 0.225 Bi 0.775 O 1.5 had an obviously higher CO 2 adsorption capacity than La 0.6 Bi 0.4 O 1.5 and La 1.08 Bi 0.92 O 3.03 .On the other hand, La 0.225 Bi 0.775 O 1.5 and La 0.6 Bi 0.4 O 1.5 have higher CO 2 adsorption capacities than Bi 2 O 3 , indicating that the introduction of appropriate amounts of La may increase the CO 2 adsorption capacity of bismuth-based oxides.Among these La-Bi-O photocatalysts, the La 0.225 Bi 0.775 O 1.5 sample had the largest specic surface area and the strongest CO 2 adsorption capacities, which favoured photocatalytic CO 2 reduction. This journal is The Royal Society of Chemistry 2021Sustainable Energy Fuels Sustainable Energy FuelsThis journal is The Royal Society of Chemistry 2021 The authors thank the National Key Research and Development Program of China (No. 2018YFA0209303 and 2020YFA0710302), National Natural Science Foundation of China (No. 22025202 and 51972165), and Natural Science Foundation of Jiangsu Province (BK20202003) for nancial support. There are no conicts to declare."}], "reactor type": [], "operation mode": [{"llm generation": "Batch", "source": "The reaction system was relled with CO 2 and pure water aer each cycle.", "context": "In this study, all chemicals from commercial sources were of analytical grade and were used without further purication.La 0.225 Bi 0.775 O 1.5 powder samples were prepared through the solid-state reaction of Bi 2 O 3 and La 2 O 3 (purities of 99.9) obtained from commercial products.Stoichiometric proportions of the reactants were accurately weighed and milled in an agate mortar.The mixtures of Bi 2 O 3 and La 2 O 3 were preheated at 350 C for 1 h.Aer being thoroughly ground again, the mixtures were heated at 900 C for 24 h.The samples were slowly cooled to room temperature. 17a 0.6 Bi 0.4 O 1.5 and La 1.08 Bi 0.92 O 3.03 powder samples were prepared by the same method, except that the solid reaction conditions aer preheating were changed to 1300 C for 24 h and 1200 C for 48 h, respectively.18,19 Analytical methods Powder X-ray diffraction (XRD) analysis of the La-Bi-O samples was performed on an X-ray diffractometer (Rigaku Ultima III, Japan) with Cu Ka radiation.The morphology and energy dispersive X-ray (EDX) spectra of the as-prepared samples were characterized using scanning electron microscopy (SEM, Carl Zeiss SMT AG, Germany) and transmission electron microscopy (TEM, JEOL JEM 2100, Japan).Fourier transform infrared spectroscopy was performed on a Nexus 870 infrared spectrometer (Nicolet, USA). X-ray photoelectron spectroscopy (XPS) analysis of the samples was performed on a photoelectron spectrometer (PHI5000 Versa Probe, ULVAC-PHI, Japan) with a monochromatized Al Ka radiation source used as the X-ray source.The binding energy of the samples was calibrated with reference to the C 1s peak at 284.8 eV.The UV-vis diffuse reectance spectra of the samples were measured on a Lambda 950 (Per-kinElmer, USA) UV-vis spectrophotometer in the range of 250-1000 nm, and the absorption spectra were transformed from the reectance spectra according to the Kubelka-Munk relationship.The specic surface area and CO 2 adsorption capacities of the La-Bi-O samples were measured on a Brunauer-Emmett-Teller (BET) surface area and porosity analyser (TriStar-3000, Micromeritics, USA).Time-resolved uorescence decay spectroscopy of the samples was performed on a FLS1000 spectrometer with a 375 nm excitation wavelength (Edinburgh, United Kingdom). Nyquist plots were obtained with a typical three-electrode system using 0.1 M NaOH as the electrolyte solution.The working electrode was prepared via electrophoretic deposition to coat powder samples on uorine-doped tin oxide (FTO) glass pieces.Mott-Schottky plots of the as-prepared samples were recorded in the dark by applying potentials at a 1500 Hz frequency. Photocatalytic CO 2 reduction over the samples was performed in a gas-tight system.In this study, 50 mg photocatalyst sample was uniformly dispersed on a glass cell.Then, the glass cell was put into a glass reactor connected to a closed system, and a 300 W Xenon arc lamp was used as the light source.The reaction system with a volume of approximately 230 ml was placed under vacuum several times.For photocatalytic CO 2 reduction, high purity CO 2 was fed into the system to obtain atmospheric pressure, and then, 0.4 ml deionized water was injected into the reactor.Before illumination, the reaction system was put in the dark for 12 h to reach adsorptiondesorption equilibrium with a gas pump to accelerate gas diffusion.During illumination, 1 ml gas sample was extracted at a given interval using a gas-tight syringe for the subsequent analysis of CO 2 reduction products by gas chromatography (GC-2014, Shimadzu, Japan).Five cycles of photocatalytic experiments were carried out, and each cycle lasted 8 h.The reaction system was relled with CO 2 and pure water aer each cycle."}, {"llm generation": "Batch", "source": "Five cycles of photocatalytic experiments were carried out to assess the stability of the La 0.225 Bi 0.775 O 1.5 sample, and the results are shown in Fig. 2b.", "context": "La-Bi-O semiconductors (La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 ) were found to be new photocatalysts for CO 2 reduction.La 0.225 Bi 0.775 O 1.5 exhibited the highest photoreduction efficiency and highly selective formation of CO because it exhibited a higher CO 2 adsorption capacity, a more negative CB position and more efficient photoinduced charge transfer and separation than the other two photocatalysts.La-Bi-O semiconductors exhibit great potential in CO 2 reduction. Photocatalytic activityThe photocatalytic activities of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 were assessed by CO 2 reduction with light Fig. 2a shows that La 0.225 Bi 0.775 O 1.5 (33.2 mmol g A1 ) exhibited a higher photocatalytic activity and a much higher CO yield La 0.6 Bi 0.4 O 1.5 (12.5 mmol g A1 ) and La 1.08 Bi 0.92 O 3.03 (13.5 mmol g A1 ).Five cycles of photocatalytic experiments were carried out to assess the stability of the La 0.225 Bi 0.775 O 1.5 sample, and the results are shown in Fig. 2b.CO production decreased by approximately 50 aer ve cycles over La 0.225 Bi 0.775 O 1.5 .Fig. S2c shows that the production of CH 4 slightly increased as CO production in the competitive reaction decreased aer ve cycles.No signicant crystalline structure change was observed (Fig. S3 ), which suggested that these photocatalysts were stable during the process of CO 2 reduction.To study the elemental dispersion in the La-Bi-O catalysts, energy dispersive X-ray spectroscopy (EDX) was carried out.As shown in Fig. S4 and S5, EDS elemental mapping images indicated the uniform distribution of Bi, La, and O in these catalysts before and aer the photocatalytic reaction. 3d and Bi 4f spectra of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 aer photocatalytic CO 2 reduction.There is also no obvious change in the O 1s spectra of La 0.6 Bi 0.4 O 1.5 and La 1.08 Bi 0.92 O 3.03 aer the reaction, while the ratio of lattice oxygen to the adsorbed oxygen of La 0.225 Bi 0.775 O 1.5 decreased Fig. 2 (a) Product yields of CO over La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 .(b) Stability test of CO in five cycles over La 0.225 Bi 0.775 O 1.5 .(c) Selectivity of photocatalytic materials for CO production. Fig. 3 (a) XPS survey spectra of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 and high-resolution (b) Bi 4f, (c) La 3d, and (d) O 1s XPS spectra of the La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 samples. 4 O 1.5 and La 1.08 Bi 0.92 O 3.03 , La 0.225 Bi 0.775 O 1.5 has a larger number of Bi-O bonds.Therefore, we compared the O 1s spectrum of Bi 2 O 3 before and aer photocatalytic CO 2 reduction experiments.As Fig. S11 shows, the ratio of lattice oxygen to the adsorbed oxygen of Bi 2 O 3 decreased signicantly aer the reaction, indicating that the Bi-O bond is active in the photocatalytic reduction process.CO 2 photoreduction mechanism of La 0.225 Bi 0.775 O 1.5 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 are shown in Fig. 5.The as-prepared La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 samples appeared in the form of irregular lumps, with the size of the particles varying from 1 to 10 mm. Fig. 5 SEM images of (a) La 0.225 Bi 0.775 O 1.5 , (b) La 0.6 Bi 0.4 O 1.5 , and (c) La 1.08 Bi 0.92 O 3.03 and HRTEM images of (d) La 0.225 Bi 0.775 O 1.5 , (e) La 0.6 Bi 0.4 O 1.5 , and (f) La 1.08 Bi 0.92 O 3.03 . Band structure and carrier separationAs shown in the UV-vis diffuse reectance spectra of Fig.7a, La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 can all respond to visible light, and their photoabsorption edges are at 466, 512, and 512 nm, respectively. 39The Mott-Schottky plot (Fig. S9, ESI ) suggests that La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 are n-type conducting semiconductors with a positive slope. 40The band gaps of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 in Fig. ) from the calculated E vb and E cb of the samples, and the band positions of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 are displayed in Fig. 7d. 42Obviously, the E cb values of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 were more negative than the CH 4 /CO 2 (A0.24 eV) and CO/CO 2 (A0.53 eV) reduction potentials, and the La 0.225 Bi 0.775 O 1.5 sample had a more negative E cb than the La 0.6 Bi 0.4 O 1.5 and La 1.08 Bi 0.92 O 3.03 samples.Because of the lower position of the CB, electrons in the CB of La 0.225 Bi 0.775 O 1.5 could more easily reduce CO 2 intermediates to CH 4 and CO than those of La 0.6 Bi 0.4 O 1.5 and La 1.08 Bi 0.92 O 3.03 .The Nyquist plots of La 0.225 Bi 0.775 O 1.5 in Fig. S10 exhibited a smaller impedance radius than those of La 0.6 Bi 0.4 O 1.5 and La 1.08 Bi 0.92 O 3.03 , revealing that the photogenerated charge transfer of La 0.225 Bi 0.775 O 1.5 had less electric resistance, indicating that La 0.225 Bi 0.775 O 1.5 had better photoinduced charge transfer, which can be benecial to the photocatalytic CO 2 reduction process. 43,44Moreover, the steady-state PL spectra in Fig. 7e revealed that La 0.225 Bi 0.775 O 1.5 exhibited the lowest recombination rate because it exhibited the weakest emission intensity.Meanwhile, the time-resolved uorescence decay spectra in Fig. 7f and Table S1 show that the average emission lifetime of La 0.225 Bi 0.775 O 1.5 (48.4 ms) is signicantly longer than those of La 0.6 Bi 0.4 O 1.5 (24.2 ms) and La 1.08 Bi 0.92 O 3.03 (29.0 ms), implying that the recombination of photogenerated electrons and holes is much more restrained in La 0.225 Bi 0.775 O 1.5 .The more efficient photoinduced charge transfer and separation of La 0.225 Bi 0.775 O 1.5 can help it become a better photocatalyst for Fig. 6 (a) N 2 adsorption-desorption isotherms and (b) CO 2 adsorption isotherms of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , La 1.08 Bi 0.92 O 3.03 and Bi 2 O 3 . Fig. 7 (a) UV-vis diffuse reflectance spectra, (b) relationship between (ahn) 1/2 and hn, (c) valence-band XPS spectra, (d) band edge arrangement at pH 14 7, (e) steady-state PL spectra, and (f) time-resolved fluorescence decay spectroscopy of the samples. 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 , with Bi 2 O 3 -related structures exhibited photocatalytic performances for CO 2 reduction.The introduction of La may increase the CO 2 adsorption capacity of bismuth-based oxides.La-Bi-O semiconductors may have great potential in CO 2 photoreduction. shows the N 2 adsorption-desorption isotherms of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 , and La 1.08 Bi 0.92 O 3.03 .The specic surface areas of La 0.225 Bi 0.775 O 1.5 , La 0.6 Bi 0.4 O 1.5 and La 1.08 Bi 0.92 O 3.03 are 4.5, 1.4 and 0.99 m 2 g A1 , respectively.As shown in Fig. 6b, La 0.225 Bi 0.775 O 1.5 had an obviously higher CO 2 adsorption capacity than La 0.6 Bi 0.4 O 1.5 and La 1.08 Bi 0.92 O 3.03 .On the other hand, La 0.225 Bi 0.775 O 1.5 and La 0.6 Bi 0.4 O 1.5 have higher CO 2 adsorption capacities than Bi 2 O 3 , indicating that the introduction of appropriate amounts of La may increase the CO 2 adsorption capacity of bismuth-based oxides.Among these La-Bi-O photocatalysts, the La 0.225 Bi 0.775 O 1.5 sample had the largest specic surface area and the strongest CO 2 adsorption capacities, which favoured photocatalytic CO 2 reduction. This journal is The Royal Society of Chemistry 2021Sustainable Energy Fuels Sustainable Energy FuelsThis journal is The Royal Society of Chemistry 2021 The authors thank the National Key Research and Development Program of China (No. 2018YFA0209303 and 2020YFA0710302), National Natural Science Foundation of China (No. 22025202 and 51972165), and Natural Science Foundation of Jiangsu Province (BK20202003) for nancial support. There are no conicts to declare."}]}}