[{"title": "Doi", "content": "10.1016/j.cej.2020.127145"}, {"title": "Article_Title", "content": "Interfacial facet engineering on the Schottky barrier between plasmonic Au and TiO2 in boosting the photocatalytic CO2 reduction under ultraviolet and visible light irradiation"}, {"title": "Abstract", "content": "Hybrid photocatalytic nanostructures composed of plasmonic metal and wide-band-gap semiconductor components have been widely developed, in which metal not only acts as a cocatalyst to trap the photogenerated electrons from semiconductor for improved charge separation and provide highly active sites for accelerated reaction kinetics, but also serves as a light-harvesting antennae to extend the light absorption region based on the injection of plasmonic hot electrons into the semiconductor.In both circumstances, rational design of metal/ semiconductor interface is highly desirable to smooth the migration of electrons and promote the separation of carriers.Herein, based on the deposition of Au on TiO 2 nanocrystals with different exposed facets, it is found that the formation of Au/TiO 2 (1 0 1) interface lowers the height of Schottky barrier in comparison with Au/ TiO 2 (0 0 1) interface, enhancing the transfer of conduction band (CB) electrons from TiO 2 to Au cocatalysts under ultraviolet light irradiation and promoting the hot electron injection from plasmonic Au into the CB of TiO 2 with the excitation of Au by visible light.The more efficient interfacial charge transfer and separation enable more electrons participating in the conversion of CO 2 to CO and CH 4 .As a result, at both excitation wavelengths, the Au-TiO 2 sample with exclusive Au/TiO 2 (1 0 1) interfaces significantly ameliorates the photocatalytic activities in CO and CH 4 production compared to other samples containing Au/TiO 2 (0 0 1) interfaces.The interfacial facet engineered Schottky barrier may open a new window to rationally designing metal-semiconductor hybrid structures for photocatalysis."}, {"title": "Experimental", "content": "In a typical synthesis of TiO 2 octahedra 48, potassium titanate precursor (0.01 g, preparation method in Supplementary data) and hexamethylenetetramine (0.70 g, 5 mmol) were sequentially dispersed in the mixed solvent of ethanol and water (6 mL, v/v 1:2) under ultrasonic treatment.The resulting solution was then transferred into a 20 mL Teflon-lined stainless-steel autoclave and was kept at 200 C for 48 h.TiO 2 truncated octahedra were synthesized under the same experimental conditions as TiO 2 octahedra except the use of water (6 mL) instead of ethanol/water mixture.In a typical synthesis of TiO 2 sheets 49, 10 mL of tetrabutyl titanate (Ti(OBu) 4 ) and 2.5 mL of hydrofluoric acid solution were mixed in a 50 mL Teflon-lined stainless-steel autoclave and then kept at 200 C for 24 h.After being cooled to room temperature, the as-obtained white powder was separated by centrifugation and washed with ethanol and water for several times, and finally dried at 45 C for 24 h. The Au-TiO 2 samples were obtained by depositing Au nanoparticles on TiO 2 nanocrystals through a ligand-exchange method 50.In brief, TiO 2 samples (10 mg) were dispersed in 5 mL of an aqueous solution containing 150 L 3-mercaptopropionic acid (MPA) and 150 L NH 3 H 2 O (28) through sonication.Then 400 L of aqueous dispersion of Au nanoparticles (preparation method in Supplementary data, 1.64 mg mL -1 ) was added under sonication for 10 min.The as-obtained mixture was kept static for precipitation, centrifuged and washed with water for several times, and finally annealed at 200 C to remove the MPA and increase the contact between Au and TiO 2 . 3.0 mg products were dispersed in a mixture of 15 L ethanol and L Nafion, which were then uniformly spin-dropped onto at a 1 cm cm indium tin oxide (ITO)-coated glass by a spin coater.Subsequently, the ITO-coated glasses were heated at 80 C in a vacuum oven for 1 h.The photoelectrochemical measurements were performed on a CHI 760E electrochemical station (Shanghai Chenhua, China) in ambient conditions under irradiation of a 300 W Xe lamp (PLS-SXE 300D/300DUV, Beijing Perfectlight, China).UV and visible lights were used as the illumination source, which were realized in the presence of a shortwave-pass 420 nm cutoff filter (320 420 nm) and a long-wavepass 420 nm cutoff filter (420 780 nm), and the power densities were measured to be 33 and 100 mW cm -2 , respectively.A threeelectrode cell was used to perform the electrochemical measurements with the ITO-coated glass, Ag/AgCl electrode and Pt foil used as the working electrode, reference electrode and counter electrode, respectively.The three electrodes were inserted in a quartz cell filled with 0.5 M Na 2 SO 4 electrolyte.The photocurrent density was measured under chopped light irradiation (light on/off cycles: 30 s) at a bias potential of 0.4 V versus Ag/AgCl for 600 s under both visible and UV light irradiation.Electrochemical impedance spectroscopy (EIS) was performed in the 10 -1 to 10 5 Hz frequency range with an AC voltage amplitude of mV at an applied potential of 0.1 V versus Ag/AgCl under UV light irradiation.Transient open-circuit voltage decay (OCVD) was measured for a total of 800 s under visible light irradiation, and the light was switched on and off after 100 and 400 s from the start, respectively. The photocatalytic experiments were carried out in a 100 mL reactor purchased from Beijing Perfectlight Company (China) under atmospheric pressure at ambient temperature (298 K), in which 10 mg of the photocatalysts were dispersed in 1 mL H 2 O at the bottom.Prior to the test, the reactor loaded with the catalyst was first purged with high purity CO 2 for 20 min.Then the light-irradiation experiment was performed by using a 300-W Xe lamp (PLS-SXE 300D/300DUV, Beijing Perfectlight, China) with UV and visible light as the illumination source, respectively.The UV and visible light was realized in the presence of a short-wave-pass 420 nm cutoff filter (320 420 nm) and a longwave-pass 420 nm cutoff filter (420 780 nm), and the power densities of which were measured to be 33 and 100 mW cm -2 , respectively.After the photocatalytic reaction for 4 h, the products were analyzed using a gas chromatograph (GC-2014, Shimadzu) with Ar as the carrier gas.The amount of CH 4 was measured by using a flame ionization detector (FID).CO was converted to CH 4 using a methanation reactor and then analyzed using the FID.The O 2 was also detected using a thermal conductivity detector (TCD).During the stability test, the photocatalyst with the best catalytic activity was collected after each run and then reused for the reduction of CO 2 .Isotope-labeling experiments were performed using 13 CO 2 , and the products were analyzed using gas chromatography-mass spectrometry (7890B/5977A, Agilent)."}, {"title": "Results_and_discussion", "content": "As a proof-of-concept demonstration, well-defined TiO 2 nanocrystals with tailored exposed facets, including octahedra (tetragonal bipyramids) enclosed by (1 0 1) facets, truncated octahedra (truncated tetragonal bipyramids) co-exposed with (1 0 1) and (0 0 1) facets, and sheets with dominant (0 0 1) facets (with a high percentage up to 95) were firstly synthesized by hydrothermal processes according to previous reports, which are denoted as TiO 2 (O), TiO 2 (T) and TiO 2 (S), respectively (Fig. S1) 48,49.Then spherical Au nanoparticles with an average size of 10.9 nm were deposited on the surface of TiO 2 (O), TiO 2 (T) and TiO 2 (S) through a ligand-exchange method followed by annealing treatment (Fig. S2) 50,51.As shown in transmission electron microscopy (TEM) images in Fig. 1a andb (also Fig. S3a), Au nanoparticles are uniformly distributed on the eight (1 0 1) facets of TiO 2 (O) to fabricate the Au-TiO 2 (O) heterostructure.Induced by the high-temperature annealing treatment, some spherical Au nanocrystals are deformed or agglomerated, resulting in the increase of the average size (Fig. S4).High-resolution TEM (HRTEM) image suggests that the monocrystalline Au and TiO 2 are in intimate contact with each other during the formation of Au/TiO 2 (1 0 1) interfaces owing to the deformation of Au nanospheres (Fig. 1c).When TiO 2 (T) is used as the semiconductor supporter, Au nanoparticles are dispersed on both the top and bottom (0 0 1) facets and eight lateral (1 0 1) facets with both Au/ TiO 2 (0 0 1) and Au/TiO 2 (1 0 1) interfaces involved in the as-obtained Au-TiO 2 (T) (Fig. 1d-f and Fig. S3b).As for TiO 2 (S), Au nanoparticles are exclusively loaded on the top and bottom (0 0 1) facets, leading to the formation of Au/TiO 2 (0 0 1) interfaces in the Au-TiO 2 (S) (Fig. 1g-i and Fig. S3c). The crystal structures of the Au-TiO 2 samples were determined by the X-ray diffraction patterns (XRD).As shown in Fig. 2a, all the peaks can be indexed to anatase TiO 2 (JCPDS no.21-1272) and face-centered cubic (fcc) Au (JCPDS no.65-2870).The difference is that the intensities of TiO 2 peaks in Au-TiO 2 (S) are much weaker as compared with those in Au-TiO 2 (O) and Au-TiO 2 (T).Especially, the intensity of (0 0 4) diffraction peak is significantly reduced and its full width at half-maximum is broadened with the reason that the thickness of the TiO 2 (S) in the 0 0 1 direction is decreased, leading to the disappearance of (1 0 3) and (1 1 2) peaks.Moreover, different Raman spectra are also observed for the Au-TiO 2 samples, which is caused by the different Raman scattering intensities on TiO 2 (1 0 1) and (0 0 1) facets 52.As shown in Fig. 2b, with the increase of the percentage of (0 0 1) facets from Au-TiO 2 (O) to Au-TiO 2 (T) and then to Au-TiO 2 (S), the intensity of the E g peaks at 144 and 636 cm -1 reduces gradually, while the intensity of the B 1g peak at 394 cm -1 and A 1g peak at 514 cm -1 increases simultaneously, which is consistent with previous reports 53.The surface composition information of the Au-TiO 2 samples was further characterized by X-ray photoelectron spectra (XPS).The survey spectra confirm the presence of Ti, O and Au in the three samples (Fig. S5a).Ti2p peaks with binding energies of 459.0 and 464.5 eV are attributed to the Ti2p 3/2 and Ti2p 1/2 of TiO 2 , while O1s peaks located at 530.0 and 531.6 eV originate from O-Ti of TiO 2 and O-H of surface adsorbed OH groups, respectively (Fig. S5b andc).The Au4f 7/2 and Au4f 5/2 doublets around 83.3 and 87.0 eV correspond to zero-valence Au, which slightly shift to lower value from Au-TiO 2 (O) to Au-TiO 2 (T) and then to Au-TiO 2 (S), suggesting an increase of the number of electrons accumulated in Au upon the hybridization with TiO 2 (Fig. 2c) 40.Based on Brunauer-Emmett-Teller (BET) nitrogen adsorption measurement, the specific surface areas of Au-TiO 2 (O), Au-TiO 2 (T) and Au-TiO 2 (S) were determined to be 15.3, 7.2 and 61.3 m 2 g -1 , respectively.In comparison with TiO 2 (O), Au-TiO 2 (O) exhibits significantly higher CO 2 uptake, confirming the role of Au cocatalyst in adsorption and activation of CO 2 molecules (Fig. S6a).Moreover, the CO 2 adsorption behaviors of the Au-TiO 2 samples are in the order of Au-TiO 2 (S) Au-TiO 2 (O) Au-TiO 2 (T), which are in accordance with the BET surface areas (Fig. S6b). With the same loading amount of Au (Table S1), the photocatalytic performance of as-obtained TiO 2 and Au-TiO 2 samples were measured under UV light (320 420 nm) irradiation.CO and CH 4 were detected as the two main CO 2 reduction products, while the formation of H 2 and O 2 was also observed (Fig. S7), suggesting the occurrence of the following reductive and oxidative reactions: (c,d) Mass spectra of (c) 13 CO (m/z 29) and (d) 13 CH 4 produced over Au-TiO 2 (O) in the photocatalytic reduction of 13 CO 2 under UV light irradiation. TiO 2 (T) as well as 14.9 and 3.0 mol g cat -1 h -1 for Au-TiO 2 (S).The Au-TiO 2 (O) also exhibits excellent photocatalytic stability over 16 h.As shown in Fig. 3b, the CO and CH 4 production rates reduced by about 8.7 and 15.7 of its initial values respectively after repeating the above 4 h reaction process for three cycles.TEM images, XRD pattern and XPS spectra indicate that the size, morphology, crystalline structure and chemical states of Au-TiO 2 (O) could be well-maintained after the cyclic process, highlighting the good recyclability of the photocatalyst (Figs.S8-S10).No low-carbon product was detected in the control experiments including without catalysts, in the dark and in the Ar atmosphere instead of CO 2 , confirming that the reduction products actually originate from the photoreduction of CO 2 rather than adsorbed carbon species.The carbon sources of the produced CO and CH 4 were also confirmed by the 13 C isotope labeling experiment over Au-TiO 2 (O), in which the signals at m/z 29 and m/z 17 in the gas chromatographymass spectrometry can be assigned to 13 CO and 13 CH 4 , respectively (Fig. 3c,d). The different orders of the Au-TiO 2 samples in photocatalytic activity and CO 2 adsorption imply that the surface reactivity is not the only factor determining the CO 2 conversion efficiency.The light absorption abilities of the TiO 2 based samples were then evaluated by UV-vis diffuse reflectance spectra.As shown in Fig. 4a, bare TiO 2 (O), TiO 2 (T) and TiO 2 (S) exhibit comparable light absorption in UV region with distinct absorption edges at wavelength around 390 nm, corresponding to the intrinsic bandgaps of them.The UV absorption properties are not altered by the further loading of Au, excluding the influence of the photoexcited charge generation ability on the photocatalytic performance.With TiO 2 acting as the light-harvesting component, the electron-hole separation abilities of the samples were analyzed by the photocurrent responses 54.As indicated by the photocurrent versus time (I-t) curves under UV light irradiation (Fig. 4b), bare TiO 2 samples exhibit different photocurrent densities, which are in the following order: TiO 2 (T) TiO 2 (O) TiO 2 (S).The addition of Au significantly boosts the photocurrent responses, confirming its role as a cocatalyst in preventing the charge recombination.Au-TiO 2 (O), Au-TiO 2 (T) and Au-TiO 2 (S) achieve 2.6, 1.6 and 4.1-folds increases in the photocurrent density, respectively, implying the different contributions of Au to the charge transfer and separation.Resultantly, the photocurrent densities turn out to be in the sequence of Au-TiO 2 (O) Au-TiO 2 (T) Au-TiO 2 (S).The photoluminescence (PL) spectra are in well agreement with the photocurrent results.As shown in Fig. 4c, the introduction of Au leads to the PL quenching of TiO 2 , indicating that the radiative electronhole recombination is significantly suppressed.The PL quenching degree is in consistence with the photocurrent enhancement, while the PL intensity and photocurrent density are in the opposite order for different TiO 2 and Au-TiO 2 samples, further confirming that the charge separation ability is greatly dependent on the geometry of TiO 2 . To gain an in-depth insight into the geometry-dependent charge kinetics, the electronic structures of TiO 2 samples were determined by the combination of UV-vis diffuse reflectance spectra, valence-band XPS spectra and Mott-Schottky plots.Considering the exposed facet of TiO 2 is the main variable between different TiO 2 and Au-TiO 2 samples, the band configurations of TiO 2 (O) and TiO 2 (S) were investigated to reveal the CB and valence band (VB) positions of the exposed TiO 2 (1 0 1) and (0 0 1) facets, respectively.As revealed by the UV-vis diffuse reflectance spectra (Fig. 4a), the bandgaps of TiO 2 (O) and TiO 2 (S) were determined by using the equation: where is the absorption coefficient, hv is the light energy, A is a constant, E g is the optical bandgap, and n is equal to 1/2 for an indirect bandgap and 2 for a direct bandgap.Given that TiO 2 is known as an indirect semiconductor, according to the curve plots for (hv) 1/2 versus hv in Fig. 5a, the bandgaps are calculated to be 3.According to the above results, the band levels of TiO 2 (1 0 1) and (0 0 1) facets were drawn in Fig. 5d.It can be clearly seen that both the CB and VB of TiO 2 (0 0 1) are higher than those of TiO 2 (1 0 1), which is in line with previous reports 56,57.With the similar light absorption ability, the Type-II staggered band alignment between TiO 2 (1 0 1) and (0 0 1) well explains the superior CO 2 photoreduction performance of TiO 2 (T) in comparison with those of TiO 2 (O) and TiO 2 (S), in which spatial charge separation is achieved with photo-induced electrons and holes transferring to (1 0 1) and (0 0 1) facets, respectively (Fig. 5e) 58.Moreover, it has been reported that photogenerated electrons in TiO diffuse along the (1 0 1)-axis faster than the (0 0 1)-axis, which also facilitates the migration of electrons to the TiO 2 (1 0 1) facets for CO reduction 59.This statement is confirmed by the lower charge transfer resistance in TiO 2 (O) photoanode compared to that in TiO 2 (S) photoanode as revealed by the smaller arc radius in the electrochemical impedance spectroscopy (EIS) Nyquist plot (Fig. S11).On the contrary, spatial separation of photogenerated electrons and holes cannot take place in the TiO 2 (O) and TiO 2 (S).Nevertheless, owing to the limited penetration depth of photons, photoexcited electrons generated in the subsurface region of TiO 2 (O) also migrate to the exposed TiO 2 (1 0 1) facets for CO 2 reduction in high speed and short distance, also guaranteeing the smooth transfer and separation of carriers (Fig. 5e).In contrast, photoelectrons generated in the bulk/subsurface regions of TiO 2 (S) must diffuse along the (1 0 1)-axis for a long distance to the lateral edges of the nanosheets, inevitably increasing the possibility of charge recombination loss (Fig. 5e). With the further deposition of Au on the surface of TiO 2 , Schottky junctions are formed at the Au/TiO 2 interfaces with the creation of electron depletion layers.As illustrated in Fig. 5f, given the work function of Au is larger than those of TiO 2 , the electrons in the TiO 2 diffuse to Au at the lower energy level and the energy band of TiO 2 bends upward to build up an equilibrium state between the Fermi level between TiO 2 and Au, forming Schottky barriers.Due to the higher Fermi level of TiO 2 (0 0 1) in comparison with that of TiO 2 (1 0 1), more serious band bending occurs when in contact with Au, resulting in a higher height of Schottky barrier, which is in agreement with the increased electron accumulation in Au from Au-TiO 2 (O) to Au-TiO 2 (T) and Au-TiO 2 (S) when integrated with TiO 2 (Fig. 2c).With the excitation of TiO 2 by UV light, photogenerated electrons must overcome the Schottky barriers during their migration from the CB of TiO 2 to Au cocatalysts 60.The interfacial electron transfer mainly occurs through the thermionic emission and the efficiency of which is greatly dependent on the height of the barriers.Compared with Au/TiO 2 (0 0 1) interface, the smaller barrier height at Au/TiO 2 (1 0 1) interface favors the efficient transfer of photoexcited electrons from TiO 2 to Au cocatalysts, promoting the electron-hole separation 61,62. Considering the comparable light absorption of TiO 2 as well as the same active sites of Au cocatalysts exposed for surface reactions, the barrier height-dependent interfacial charge transfer efficiency greatly influences the catalytic activities of the Au-TiO 2 samples in CO photoreduction.As illustrated in Fig. 5g, given the lower energy position of the Fermi level of Au compared to the CBs of TiO 2 (0 0 1) and (1 0 1), Au cocatalysts accept the CB electrons from TiO 2 for CO 2 reduction whichever facets they are loaded on.Namely, electron migration occurs across the Au/TiO 2 (1 0 1) and Au/TiO 2 (0 0 1) interfaces in Au-TiO 2 (O) and Au-TiO 2 (S), respectively, while both the Au/TiO 2 (1 0 1) and Au/ TiO 2 (0 0 1) interfaces are involved in the charge transfer in Au-TiO 2 (T).Enabled by the different electron transfer efficiencies between Au/ TiO 2 (1 0 1) and Au/TiO 2 (0 0 1) interfaces, the charge separation abilities are in the sequence of Au-TiO 2 (O) Au-TiO 2 (T) Au-TiO 2 (S), which is consistent with the photocatalytic results.Despite the worst interfacial electron transfer efficiency in the case of Au-TiO 2 (S), the loading of Au cocatalyst on TiO 2 (0 0 1) facets turns the direction of photogenerated electron migration from along the (1 0 1)-axis into along the (0 0 1)-axis, which greatly shortens the average migration distance of them when the low thickness of TiO 2 (S) is taken into consideration, contributing to more significant enhancements in the charge separation and resulting photocatalytic performance. In the next stage of our work, the photocatalytic behaviors of asobtained Au-TiO 2 samples were evaluated under visible light (420 780 nm) irradiation, and the results are shown in Fig. 6a.The average CO and CH 4 production rates over the different samples follow Moreover, no obvious deactivation of Au-TiO 2 (O) can be observed after four cycles within 16 h under visible light irradiation, further confirming the stability of the photocatalyst during the recycling tests (Fig. S12).In the absence of Au, the formation of CO and CH 4 is negligible for bare TiO 2 samples, confirming the critical role of Au in the visible photocatalytic activity.According to the UV-vis diffuse reflectance spectra (Fig. 4a), the introduction of Au results in an additional light harvesting in the visible region with a peak maximum at 539 nm, which is ascribed to the plasmon absorption band of Au nanoparticles, indicating the excitation of Au rather than TiO 2 during the visible-light-driven reactions.Owing to the approximate loading amounts of Au, the light absorption properties of the Au-TiO 2 samples in visible region are similar.Fig. 6b shows the CO evolution rates over Au-TiO 2 (O) as a function of source wavelength.The similarity between the CO production rate and light absorption spectrum of Au nanoparticles further confirms that the visible light activity is attributed to the surface plasmon excitation of Au. Given the comparable plasmonic absorption intensities of the Au-TiO 2 samples, the photocurrent response under visible light irradiation offers an informative evaluation of the charge separation efficiency 63,64.As shown in Fig. 7a, the photocurrent densities of Au-TiO samples are apparently higher than that of bare Au, confirming the role of TiO 2 in promoting the separation of hot electrons and holes.Especially, much similar to the cases under UV light irradiation, visible photocurrents are also in the order of Au-TiO n - where n represents the average lifetime, V oc is open-circuit voltage, k B is the Boltzmann constant, T is the temperature (in Kelvin), q is the unsigned charge of an electron, and t is the time after the light is turned off.As shown in Fig. 7c, the average lifetimes of hot electrons are gradually shortened from Au-TiO 2 (O) to Au-TiO 2 (T) and to Au-TiO 2 (S). Upon the excitation of Au-TiO 2 samples by visible light, high energy hot electrons in plasmonic Au are transiently generated up to 0.5 to 3 eV higher than the Fermi energy, which are then injected into the CB of TiO 2 for CO 2 reduction, while the Schottky barrier prevents the backward flow of the injected hot electrons, contributing to the separation of hot electrons and holes 60.Given that the kinetic energy of the hot electrons must be greater than the Schottky barrier for the injection to happen, an appropriate height of Schottky barrier plays a vital role in prolonging the lifetimes of hot electrons and making them capable of facilitating the photoreduction reactions 656667.Large barrier height suppresses the hot electron injection from Au to TiO 2 while too small barrier height cannot prevent the back-flow of hot electrons 68.As illustrated in Fig. 7d, for both Au/TiO 2 (0 0 1) and Au/TiO 2 (1 0 1) interfaces, effective Schottky barriers can be formed to prevent the backflow of hot electrons from TiO 2 to Au.The difference is that the smaller Schottky barrier height of Au/TiO 2 (1 0 1) interface compared to that of Au/TiO 2 (0 0 1) with larger band bending, making more hot electrons with energy greater than the barrier height transfer cross the interface, increasing the charge injection efficiency.During the plasmonic mediated photocatalytic reactions, the hot electrons migrate from Au to TiO 2 for reduction reactions through the interfaces between them (Fig. 7e).Consequently, Au-TiO 2 (O) with exclusive Au/TiO 2 (1 0 1) interfaces involved exhibits superior separation efficiency of hot charge carriers in comparison with Au-TiO 2 (T) and Au-TiO 2 (S) containing Au/TiO 2 (0 0 1) interfaces, enabling more hot electrons participating in the conversion of CO 2 to CO and CH 4 .It should be noted that the influence of photothermal effect of plasmonic Au on the photocatalytic CO 2 reduction performance can be excluded given that TiO 2 (O) and Au-TiO 2 (O) aqueous suspensions experience approximate temperature increase under visible light irradiation, which may be resulted from the relatively low loading amount of Au (Fig. S13)."}, {"title": "Conclusions", "content": "In summary, we demonstrate the rational interface design of Au-TiO 2 heterostructures to boost the photocatalytic performance in CO 2 reduction based on the choice of suitable facets of TiO 2 nanocrystals in depositing Au.It is found the Au-TiO 2 (O) outperforms Au-TiO 2 (T) and Au-TiO 2 (S) in CO and CH 4 production under both UV and visible light irradiation owing to the formation of only Au/TiO 2 (1 0 1) interfaces rather than Au/TiO 2 (0 0 1) ones.Our investigation uncovers that the height of Schottky barrier created at the Au/TiO 2 (1 0 1) interface is smaller than that at the Au/TiO 2 (0 0 1) interface owing to the lower Fermi level of TiO 2 (1 0 1) facet compared to that of TiO 2 (0 0 1).The decrease of the Schottky barrier height not only enhances the transfer of CB electrons from TiO 2 to Au cocatalysts upon UV excitation of TiO 2 , but also facilitates the migration of hot electrons from plasmonic Au to TiO 2 when exposed to visible light.The smooth interfacial electron transfer promotes the separation of the photogenerated charge carriers, contributing to more efficient CO 2 photoreduction.This work highlights the importance of interfacial facet design during the fabrication of metal-semiconductor hybrid photocatalysts. Fig. 1.TEM, HRTEM images and schematic illustrations (inset) of (a-c) Au-TiO 2 (O), (d-f) Au-TiO 2 (T) and (g-i) Au-TiO 2 (S). According to the results shown in Fig.3a, it can be clearly seen that the photocatalytic activities of the TiO 2 samples are strongly affected by their shapes.Both the average CO and CH 4 production rates have been demonstrated to have an ordering of TiO 2 (T) TiO 2 (O) TiO 2 (S).With the further loading of Au, the photocatalytic performance in CO and CH 4 production is significantly improved.Especially, more significant enhancements in the catalytic activity are achieved by Au-TiO 2 (O) and Au-TiO 2 (S) in comparison with Au-TiO 2 (T), resulting in the change of the sequence of photocatalytic activity.The Au-TiO 2 (O) produced the largest amounts of CO (25.9 mol g cat -1 h -1 ) and CH 4(5.3 mol g cat --1 ), compared with 16.5 and 4.0 mol g cat -1 h -1 for Au- Fig. 2. (a) XRD patterns, (b) Raman spectra and (c) high-resolution Au4f XPS spectra of Au-TiO 2 samples. Fig. 3. (a) Comparison of the average CO and CH 4 production rates over TiO 2 and Au-TiO 2 samples under UV light irradiation.(b) Cycling production of CO and CH over Au-TiO 2 (O) under UV light irradiation.(c,d) Mass spectra of (c) 13 CO (m/z 29) and (d) 13 CH 4 produced over Au-TiO 2 (O) in the photocatalytic reduction of 13 CO 2 under UV light irradiation. 18 and 3.14 eV for TiO 2 (O) and TiO 2 (S), respectively.According to the Mott-Schottky plots (Fig. 5b), both TiO 2 (O) and TiO 2 (S) exhibit n-type semiconductor characteristics with positive slopes for the curves of 1/C 2 versus potential, and their flat band potentials are determined to be -0.63 and -0.82 V versus the Ag/AgCl electrode, respectively, which is equivalent to -0.43 and -0.62 V versus the normal hydrogen electrode (vs NHE) according to the equation: E NHE E Ag/AgCl 0.1976 (25 C).The valence-band XPS spectra further indicate that the energy gap between the VB and Fermi level are 2.72 and 2.54 eV for TiO 2 (O) and TiO 2 (S), respectively (Fig. 5c) 55.Given the flat band potential is the Fermi level for n-type semiconductor, the VB positions of TiO 2 (O) and TiO 2 (S) are calculated to be 2.29 and 1.92 V (vs NHE), respectively.Then based on the bandgap, the CB positions of TiO 2 (O) and TiO 2 (S) are -0.89 and -1.22 V (vs NHE), respectively. Fig. 4. (a) UV-vis diffuse reflectance spectra of TiO 2 based samples.(b) Photocurrent versus time (I-t) curves at 0.4 V versus Ag/AgCl under UV light irradiation.(c) PL spectra excited at 315 nm. Fig. 5. (a) Tauc plots, (b) Mott-Schottky plots and (c) valence-band XPS spectra of TiO 2 (O) and TiO 2 (S).(d) Schematic illustrating the relative energy band levels of TiO 2 (O) and TiO 2 (S).(e) Schematic illustrating the charge flow in bare TiO 2 samples under UV light irradiation.(f) Schematic illustrating the band alignments of Au/ TiO 2 (1 0 1) and Au/TiO 2 (0 0 1) interfaces for photogenerated electron transfer under UV light irradiation.(g) Schematic illustrating the charge flow in Au-TiO samples under UV light irradiation. 2 (O) Au-TiO 2 (T) Au-TiO 2 (S), indicating the different separation efficiencies of hot charge carriers.The charge kinetics results were further confirmed by the opencircuit voltages while selectively exciting Au by visible light.As presented in Fig. 7b, the photovoltages of Au-TiO 2 follow the same sequence as photocurrents, implying more hot electrons accumulated in Fig. 6.(a) Comparison of the average CO and CH 4 production rates over Au-TiO 2 samples under visible light irradiation.(b) CO production rate over Au-TiO 2 (O) as a function of excitation wavelength (the solid curve is the light absorption spectrum of Au nanoparticles). Fig. 7. (a) Photocurrent versus time (I-t) curves of Au and Au-TiO 2 samples at 0.4 V versus Ag/AgCl under visible light irradiation.(b) Photovoltages of Au-TiO samples under visible light irradiation and (c) calculated average lifetimes of photogenerated carriers from photovoltage decays.(d) Schematic illustrating the band alignments of Au/TiO 2 (1 0 1) and Au/TiO 2 (0 0 1) interfaces for hot electron transfer under visible light irradiation.(e) Schematic illustrating the charge flow in Au-TiO 2 samples under visible light irradiation. This work was financially supported by National Natural Science Foundation of China (No. 21603191), Zhejiang Provincial Natural Science Foundation of China (No. LY20B030003 and LQ16B010001), Public Welfare Technology Application Research Plan Project of Zhejiang Province (Analysis Test Item, No. 2017C37024), and National Training Program of Innovation and Entrepreneurship for Undergraduates (No. 201810345026). The authors declare that they have no known competing financial interest or personal relationships that could have influenced the work reported in this paper. Supplementary data to this article can be found online at https://doi.org/10.1016/j.cej.2020.127145."}]