[{"title": "Doi", "content": "10.1016/j.cattod.2015.09.004"}, {"title": "Article_Title", "content": "Photocatalytic reduction of carbon dioxide in alkaline medium on La modified sodium tantalate with different co-catalysts under UV–Visible radiation"}, {"title": "Abstract", "content": "Lanthanum doped sodium tantalate (Na (1-x) La x TaO (3x) ) with Pt, Ag, Au, CuO, NiO and RuO 2 as co-catalysts, have been prepared and characterized by XRD, DRS, photoluminescence spectroscopy, SEM and TEM.Photocatalytic reduction of CO 2 on these catalysts in alkaline medium under UV-Visible radiation yields methanol and ethanol as major products with traces of methane, ethane, ethylene, etc. Maximum apparent quantum yield (AQY) for CO 2 reduction is achieved on the formulation with 0.2 wt NiO, followed by 1 wt CuO as co-catalysts.DRS studies reveal that the addition of co-catalysts brings about reduction in band gap energy of NaTaO 3 and its light absorption onset edge is extended into the visible region.Coupling of the conduction band bottom energy levels of NiO and CuO with that of Na (1-x) La x TaO (3x) shows that they facilitate easy transfer of photo-generated electrons from the doped tantalate to NiO/CuO, wherein these electrons participate in simultaneous hydrogen generation by water splitting and CO 2 photoreduction processes.Other co-catalysts, like, Pt, Ag, Au and RuO 2 act as electron traps, resulting in charge separation, which, in turn, leads to improvement in photo-catalytic activity.Besides, significant reduction in the intensity of photoluminescence lines observed for Na (1-x) La x TaO (3x) with different co-catalysts also indicates longer life time of the charge carriers.Used catalysts retain the cubic perovskite structure of the fresh catalyst during the reaction for 20 h and stable activity is displayed for three cycles.The alkaline medium plays multiple roles, acting as scavenger of holes, increasing the solubility of CO 2 and stabilization of NiO.NaTaO 3 based catalysts could become viable alternatives to titania for this application."}, {"title": "Experimental", "content": "NaTaO 3 and 2.0 w/w lanthanum promoted catalysts were prepared by hydrothermal route 23,24.To prepare NaTaO 3 , 0.6 g of NaOH dissolved in 20 ml of water (0.75 M) and 0.442 g of Ta 2 O 5 were added into a Teflon lined stainless steel autoclave.After hydrothermal treatment at 140 C for 12 h, the precipitate was collected, washed with deionized water and ethanol.The catalyst was finally washed several times with water and dried at 80 C for 5 h.La modified NaTaO 3 (Na (1-x) La x TaO (3x) with x 0.00014 for 2.0 w/w of La) was prepared by the same procedure, by adding 0.0117 g of La 2 O 3 along with NaOH and Ta 2 O 5 in the autoclave.NiO (0.2 w/w) as co-catalyst was loaded on to the synthesized Na (1-x) La x TaO (3x) powder by wet impregnation from an aqueous solution of Ni(NO 3 ) 2 6H 2 O, drying at 100 C followed by calcination in air at 270 C for 2 h.Loading of La and NiO was based on the optimization study carried out by Kato et al. 18.Similarly, 0.15 w/w Pt (as H 2 PtCl 6 ) and 1 wt each of Au (as HAuCl 4 ), Ag (as AgNO 3 ), CuO (as Cu(NO 3 ) 2 6H 2 O) and RuO 2 (as RuCl 3 XH 2 O) were loaded on Na (1-x) La x TaO (3x) by wet impregnation and dried.Pt and Au salts were reduced in hydrogen at 450 and 200 C for 2 h, respectively, prior to use.Ag, RuO 2 and CuO loaded samples were calcined in air at 300 C, prior to use. The crystal phase of the catalysts was analyzed by X-ray diffractometer (Rigaku-MiniFlex-II) using Cu K radiation ( 1.54056A) with the scan range of 2A 5-90 at a scanning rate of 3 /min.The crystallite sizes were calculated by the Scherrer's formula, t K / cos A, where t is the crystallite size, K is the constant dependent on crystallite shape (0.9 for this case) and 1.54056A, is the FWHM (full width at half maximum) and A is the Bragg's angle. Diffuse reflectance absorption spectra of the catalysts in the UV-Visible region were recorded using a Thermo Scientific Evolution 600 spectrophotometer equipped with a Praying Mantis diffuse reflectance accessory. Photoluminescence spectra were recorded under the excitation with a 450 W Xenon lamp and the spectra were collected using Jobin Yvon Fluorolog-3-11 spectrofluorimeter. Surface area and pore volume of the catalysts were measured using Micromeritics ASAP 2020 analyser.Samples were degassed at 373 K for 2 h and at 423 K for 3 h.Pure nitrogen at liquid nitrogen temperature (77 K) was used for adsorption. Transmission electron micrographs were recorded using JEOL 3010 model.Few milligrams of the samples (1-2 mg) were dispersed in few ml (1-2 ml) of ethanol by ultra-sonication for 15 min and a drop of the dispersion was placed on a carbon coated copper grid and allowed to dry in air at room temperature. Scanning electron micrographs were recorded using FEI, Quanta 200, equipped with EDXA attachment for elemental analysis.The samples in the powder form were taken on the carbon tape and mounted on the SEM sample holder. Activity of the catalysts in UV visible region (300-700 nm) was evaluated in batch mode using jacketed all glass reactor (620 ml) 25 fitted with quartz window (5 cm dia) and filled with 400 ml of aqueous 0.2 mol L -1 NaOH solution.Besides increasing the solubility of CO 2 , alkaline solution acts as scavenger of holes.0.4 g of catalyst was dispersed in the alkaline solution with vigorous stirring (400 rpm).Increasing the stirring rate beyond 400 rpm did not affect the conversion, indicating that under the present experimental conditions, the mass transfer limitations are overcome at this speed.Aqueous alkaline solution (pH 13.0) was saturated with CO 2 by continuous bubbling for 30 min after which pH turned to 8.0.Reactor in-let and out-let valves were then closed and irradiation with Hg lamp with 77 W power (WACOM HX-500 lamp house, Japan) was started.Gas and liquid phase samples were taken out at periodic intervals with gas-tight/liquid syringes and analyzed by GC.Liquid phase products (hydrocarbons) were analyzed on PoroPlot Q capillary column with FID and gas phase products on Molecular Sieve 13X column with TCD.Potassium ferric oxalate was used as standard for actinometry.Apparent quantum yield (AQY) was calculated based on the quantities of different products formed per hour per gram of the catalyst and using the formula Blank experiments (reaction with irradiation without catalyst and reaction in dark with catalyst) were conducted to ensure that the products formed were due to photo-reduction of CO 2 .When the solution with dispersed catalyst was purged, saturated with nitrogen and irradiated, small quantities of methanol, possibly due to the conversion of residual carbon on catalyst surface, was observed (Fig. S4).However, on purging and saturation with CO 2 , increasing amounts of methanol in large quantities, up to 20 h and beyond could be observed, thus establishing that the products are actually due to photo-catalytic reduction of CO 2 .Based on these observations, with each catalyst composite, the solution saturated with nitrogen was first irradiated for 12 h to remove hydrocarbons formed from carbon residues and then saturated with CO 2 so that photo-catalytic reduction of CO 2 on clean catalyst surface could be followed further for 20 h."}, {"title": "Results_and_discussion", "content": "XRD patterns of all the catalysts (Fig. S1) showed characteristic d-lines that can be attributed to orthorhombic phase of NaTaO 3 (JCPDS-25-0863) and no diffraction peaks due to the raw material Ta 2 O 5 was found.Addition of La and co-catalysts like, NiO, Pt and Au, being 2 w/w maximum, did not result in any significant change in the XRD pattern of the parent material.However, as reported in literature 18 substitution of Na (1.39 A) by La 3 (1.36 A in 12 coordinated site) in the lattice of NaTaO 3 resulted in small shift in d-lines as shown in Fig. S2. Surface area of Na (1-x) La x TaO (3x) as measured by BET method was 2.9 m 2 /g and no significant changes in the texture were observed on impregnation of the co-catalysts. Diffuse reflectance spectra for NaTaO 3 based catalysts recorded in UV-Visible region are shown in Fig. 1.With respect to pure NaTaO 3 , all modified formulations display small shifts in band gap values that could accordingly extend light absorption edge towards visible region.In the case of Au/Na (1-x) La x TaO (3x) a prominent surface plasmon resonance band due to nano size Au is observed at 525 nm, which could possibly influence the photo-activity of the catalyst.Values of band gap, calculated by standard method and 1. Cubic morphology of Na (1-x) La x TaO (3x) is clearly observed in the scanning electron micrograph presented in Fig. 2a.TEM (Fig. 2b) further confirms the cubic architecture of the Na (1-x) La x TaO (3x) .SAED (Fig. 2c) shows the highly crystalline nature of NaTaO 3 nano cubes, and d-value of 0.389 nm measured from HRTEM (Fig. 2d) corresponds to (0 0 2) planes of orthorhombic phase of NaTaO 3 .STEM-EDS elemental mapping of Na(K), Ta(L), La(L), Ni(K), O(K) shown in Fig. S3, and EDAX data presented in Fig. S6a confirm the incorporation of La and co-catalyst NiO on the tantalate matrix. All the experiments were carried out up to 20 h.Trends in the formation of major products, methanol and ethanol, with respect to time of irradiation, up to 20 h, are given in Figs. 3 and4.Besides hydrogen and oxygen, methane, ethylene, ethane and acetaldehyde were formed in small quantities (0.1-10 mol g -1 ) and hence not considered in the plots.CO and formic acid were detected at trace levels and hence could not be quantified.As shown in Fig. S4, large amounts of methanol is formed when the aqueous alkaline solution is saturated with carbon dioxide compared to very small quantities formed after saturation with nitrogen, indicating that the observed methanol/products were obtained from CO 2 photoreduction and not from surface carbon impurities on the catalyst surface.Rates of formation of products are high during initial 6-8 h beyond which the product formation tends to slow down.Based on the initial rates (mol g -1 h -1 ) for the formation of different products, and the number of photo-electrons involved in each case, apparent quantum yields (AQY) for all the catalysts have been calculated and presented in Table 2 and Fig. 5. Please cite this article in press as: V.It is observed from Table 2 that lanthanum and various cocatalysts incorporated in NaTaO 3 significantly influence the overall quantum yield as well as selectivity to various products.Addition of lanthanum and NiO separately to NaTaO 3 results in marginal increase in quantum yield.In the presence of both La and NiO, quantum yield increased by seven times with respect to neat NaTaO 3 . Amongst the co-catalysts employed, NiO and CuO display maximum increase in activity and relatively higher selectivity towards alcohols.Based on the data presented in Table 2, in terms of both AQY and selectivity for alcohols and hydrocarbons, NiO is a better co-catalyst than CuO.Other co-catalysts like, Pt, Ag, Au and RuO 2 do promote CO 2 photoreduction but are not as effective as NiO and CuO.Initially methanol is formed at a higher rate and later, the rate tapers off, once ethanol formation by coupling of surface C 1 species picks up. In general, when reduction is carried out in gas phase, CO and methane are the major products and in aqueous phase, mainly methanol, methane and in some cases ethanol and other C 2 hydrocarbons are reported, depending on the catalyst/co-catalyst used and reaction conditions like the medium (pure water or alkaline solution) and pressure 26,27. In aqueous alkaline medium, at pH 8-9, bicarbonate/carbonate species are dominant.Since the reduction potential of these species are lower than that for CO 2 28 they undergo facile reduction, mainly to methanol and methane.As the concentration of C 1 hydrocarbon species on the surface increases, C 2 products like ethylene, ethane and ethanol are formed by coupling of C 1 species.Similar reaction pathways for the formation of ethanol have been proposed earlier 293031323334.Formation of ethanol starts only after a time lag, so that monomeric species, .CH 3 and .CH 2 , responsible for the formation of ethanol, get sufficiently accumulated on the surface 31.Hence the formation of ethanol continues after that stage.Methanol formation tends to slow down due to the competitive formation of ethanol and slow catalyst deactivation due to the carbonaceous species on the surface 353637. Photoluminescence spectra of all the catalysts are presented in Fig. 6.With respect to neat NaTaO 3 , all formulations modified by the addition of La and co-catalysts display perceptible decrease in the intensity of photoluminescence, indicating increase in life time of the charge carriers. As indicated by DRS and photoluminescence data, it is clear that the two factors responsible for the observed improvement in activity are: (i) Increase in life time of charge carriers by decreased recombination rates.(ii) Extension of light absorption edge towards visible region. Lanthanum doped NaTaO 3 has been studied extensively in view of its promoting effect on splitting of water under UV radiation.According to Kato et al. 18,22 doping of lanthanum increases the crystallinity and induces nano level step sites on the surface, which help to retard charge carrier recombination.With an increase in the band gap value (3.9-4.1 eV) on lanthanum doping, the conduction band energy level becomes more negative (Fig. S5), thus favouring increase in activity towards CO 2 reduction.Finely dispersed NiO crystallites act as efficient centres for hydrogen generation.Such changes lead to increase in activity for water splitting as well as CO 2 photoreduction.As shown in Fig. 7, the relative location of the bottom of the conduction band of NiO (at -0.96 V) with respect to that of NaTaO 3 (at -1.06 V) facilitates easy transfer of photo-generated electrons from Na (1-x) La x TaO (3x) (at -1.26 V) to the conduction band of NiO 22. Increase in the availability of photo-generated electrons in the conduction band of NiO facilitates deeper reduction of CO 2 to alcohols.Similarly, the location of the conduction band energy level of Na (1-x) La x TaO (3x) is favourable for charge transfer to the conduction band of CuO.Hence, higher activity is also observed with CuO as co-catalyst. Other co-catalysts, Pt, Ag, Au and RuO 2 act as effective electron traps which help in hydrogen gas generation and CO 2 reduction (Fig. 8).However, these are not as effective as NiO/CuO.While H 2 formation is favoured by Pt as co-catalyst, CuO and NiO favour methanol formation and Ag and Au favour CO, CH 4 .This trend is also supported by electrochemical reduction of CO 2 with these co-catalysts 4. In the present case, major pathway for hydrocarbons is through the facile reduction of bicarbonate species.Hence, formation of CO is remote and not identified in the products.H 2 generation with Pt co-catalyst is less due to the reverse reaction to form water 17, carbonaceous deposits on the surface and consumption of protons for hydrocarbon formation.Wang et al. 36 could not detect hydrogen during photocatalytic reduction of CO 2 on nano size Pt supported on single crystal TiO 2 , since hydrogen generated was used for methane formation.Surface plasmon resonance (SPR) band due to nano size Au observed at 525 nm in Au/Na (1-x) La x TaO (3x) induces additional light absorption in visible region resulting in perceptible improvement in activity compared to neat NaTaO 3 , but less than that achieved with NiO/CuO as co-catalysts.Based on SPR maximum, Au crystallite size works out to 22 nm 38, which may be due to the method of preparation adopted in this work.Larger crystallite size of 22 nm and lower energy associated with visible light could be responsible for the moderate activity improvement observed with Au, as compared to NiO/CuO as co-catalysts.Zhou et al. 17 have reported that, when Au is used as co-catalyst with SrTiO 3 for photocatalytic reduction of CO 2 , the formulation with Au crystallite size of 2 nm shows higher activity compared to the one with the size of 5-7 nm.The difference in the crystallite size is attributed to the methods adopted for deposition of Au on SrTiO 3 . In aqueous media, electroreduction of CO 2 to CO 4,39 is observed with Au, Ag, Zn, Pd and Ga as co-catalysts.Formic acid is generated during reduction with Pb, Hg, In, Sn, Bi, Cd and Tl materials.Metals such as, Ti, Nb, Ta, Mo, Mn and Al heavily favour hydrogen evolution.Cu-Cu oxide electrodes are highly efficient for electro-chemical reduction of CO 2 yielding hydrocarbons like methane, ethane, ethylene besides hydrogen.Reduction activity and product selectivity are governed by a variety of factors like, pH, CO 2 concentration, nature of the supporting electrolyte, electrode material and the nature of the catalyst 40,41.For instance, changing the supporting electrolyte from NaHCO 3 , to Na 2 CO 3 or NaHCO 3 Na 2 CO 3 significantly alters the selectivity towards methanol/ethanol 41. While Teramura et al. 11 observed that photocatalytic reduction of CO 2 on neat NaTaO 3 with H 2 as reductant under UV radiation proceeds up to CO (0.45 mol g -1 ) with no hydrocarbon being formed, in the present investigation on neat NaTaO 3 , methanol and ethanol along with small amount of methane (Table 2) are observed when water is used as reductant.It is to be noted that Teramura et al. 11 studied the process in gas phase within a closed circulating system (with 150 mol of CO 2 and 50 mol of H 2 ), while in the present case, the reaction was conducted in aqueous alkaline medium and in batch mode, with very high proportion of water (as source for active hydrogen) and relatively limited quantity of CO 2 .Such a situation implies availability of relatively large quantity of active hydrogen by splitting of water, which is conducive for reduction of CO 2 beyond CO in the present case.When external hydrogen is used as reductant, CO 2 photo-reduction on NaTaO 3 may follow a mechanism similar to the one proposed for oxides like ZrO 2 , TiO 2 , Ga 2 O 3 and MgO 12,424344. In the present case, it is observed that the reaction medium (0.2 mol L -1 NaOH at pH 13 initially) on saturation with CO 2 attains pH 8.0.Under these conditions, CO 2 in solution exists as bicarbonate (HCO 3 -) species 45, which on irradiation, undergoes further reduction to hydrocarbons through several intermediate species. Formation of surface formate from adsorbed bicarbonate 44,46 and directly from adsorbed CO 2 47 are known to occur on irradiation of titania dispersed in aqueous or alkaline solutions and also in presence of water vapour 48.Ability of NaTaO 3 to adsorb and activate CO 2 is expected to facilitate such surface transformations in the present case.Subsequently, the formate species are converted to methyl and methoxy radicals 47,48 by the active hydrogen atoms formed by water splitting and ultimately result in the formation of methane and methanol respectively.Ethanol is formed by dimerization of surface C 1 species 30.Formation of traces of ethane also supports this as one of the possible reaction pathways.According to Dimitrijevic et al. 47 in the course of these transformations, water plays dual role, acting as both proton donor as well as an electron acceptor.H 2 O:CO 2 ratio influences the efficiency of photocatalytic reduction of CO 2 , increasing with the increase in ratio and the optimum ratio for methane formation is found to be 5 49.Hence water as reductant plays multiple roles during photocatalytic reduction of CO 2 .OH -ions in the medium act as hole scavengers, form OH radicals, and reduce the electron-hole recombination rate.Increase in lifetime of photo-generated electrons would facilitate the reduction of CO 2 50.Besides, alkaline medium increases the solubility of CO 2 .Kato and Kudo 18,22 observed the deactivation of NiO/Na (1-x) La x TaO (3x) during photo-catalytic splitting of water due to solubilization of NiO and the consequent deactivation of the catalyst.In the present case, alkaline solution prevents the solubilization of NiO and catalyst deactivation is arrested.This aspect is confirmed by the qualitative EDXA spectral data presented in Fig. S6b. Like water, alkali also plays multiple roles, as hole scavenger, increasing solubility of CO 2 and arresting the solubilization of NiO.XRD and SEM data (Fig. S7) for NiO/Na (1-x) La x TaO (3x) used for 20 h reveal that the perovskite structure, cubic morphology and amount of NiO present on the surface (Fig. S6b) have been retained, indicating the stability of the catalyst.SEM for used catalyst indicates slight surface attrition due to continuous agitation.The used catalyst was centrifuged, dried and pre-treated at 573 K in air for 3 h to test the recyclability of the catalyst.The quantity of methanol formed, the major product, remained nearly constant over three cycles at 59.6, 54.5 and 55.5 mol g -1 h -1 indicating the stability of the catalyst. A recent report by Li et al. 21 on CO 2 photoreduction on KTaO 3 nanoflakes surface using pure water as reductant, with UV light irradiation, indicates formation of CO and H 2 as major products with traces of methane.This is in contrast to our studies, wherein, aqueous alkaline solution at pH 8.0 as the medium and UV-visible range radiation, are employed.Bicarbonate (HCO 3 -), as the active species, undergoes facile photo-reduction beyond CO to yield different hydrocarbon products as observed in the present case, while CO is the major product observed by Li et al.As shown in Fig. 7, relative location of the bottom of the conduction band energy levels of NaTaO 3 and of the co-catalysts, NiO and CuO are favourable for the facile transfer of photoelectrons and hence increase in activity is observed in the present case.This is not feasible with KTaO 3 , since the location of the corresponding conduction band energy levels are not suitable for such transfer of photo-electrons 51.Yields are higher with KTaO 3 since high energy UV radiation is used.We do observe an increase in activity with Ag as co-catalyst for Na (1-x) La x TaO (3x) .Unique matching of energy levels in the conduction bands of NaTaO 3 is not observed with other tantalates (Li and K) or with cocatalysts other than NiO and CuO.Thus, two distinct mechanisms, coupling of conduction band energy levels of the semi-conductors and trapping of photo-electrons, both leading to efficient light absorption in visible region and increase the lifetime of excitons because of effective charge separation, are operative in the promoting action of co-catalysts with Na (1-x) La x TaO (3x).Adsorption and activation of CO 2 by NaTaO 3 is a common additional factor for all the formulations, which contributes towards observed increase in activity for photo-catalytic reduction of CO 2 ."}, {"title": "Conclusions", "content": "Lanthanum doped NaTaO 3 formulations in conjunction with different co-catalysts display significant activity for the photoreduction of CO 2 with water as reductant, leading to the formation of methanol and ethanol as major products.The relative location of the bottom of the conduction band of NiO/CuO with respect to that of Na (1-x) La x TaO (3x) facilitates easy transfer of photo-generated electrons from Na (1-x) La x TaO (3x) to the conduction band of NiO/CuO, wherein these electrons participate in simultaneous hydrogen generation (by water splitting) and CO 2 photo-reduction processes.Other co-catalysts, Pt, Ag, Au and RuO 2 display marginal improvements in activity vis-a-vis neat NaTaO 3 .Bicarbonate species present in the reaction medium get reduced to surface formate species, which undergoes further reduction to yield products like methane, methanol and ethanol.Water as reductant is more efficient than external hydrogen, since water splitting generates active hydrogen atoms that facilitate further conversion of surface formate/CO to hydrocarbons.OH -ions in alkaline reaction medium act as hole scavengers, increase solubility of CO 2 and stability of the catalyst by arresting solubilization of NiO.NaTaO 3 based catalysts could become viable alternatives to titania for this crucial application. reacted electrons Number of incident photons 100 Please cite this article in press as: V. Jeyalakshmi, et al., Photocatalytic reduction of carbon dioxide in alkaline medium on La modified sodium tantalate with different co-catalysts under UV-Visible radiation, Catal.Today (2015), http://dx.doi.org/10.1016/j.cattod.2015.09.004 Fig. 1.Diffuse reflectance spectra of neat and modified NaTaO3 catalysts.(a) Na (1-x) LaxTaO (3x) , (b) NaTaO3, (c) NiO/Na (1-x) LaxTaO (3x) , (d) Pt/Na (1-x) LaxTaO (3x) , (e) NiO/NaTaO3, (f) Au/Na (1-x) LaxTaO (3x) , (g) Ag/Na (1-x) LaxTaO (3x) , (h) CuO/Na (1-x) LaxTaO (3x) , (i) RuO2/Na (1-x) LaxTaO (3x). Fig. 2. Morphology of Na (1-x) LaxTaO (3x) .(a) SEM image, (b) TEM image (c) SAED (d) HRTEM. Fig. 3. Trends in photocatalytic activity for CO2 reduction with alkaline medium -time on stream plots -(a) NaTaO3, (b) Na (1-x) LaxTaO (3x) . Fig. 4. Trends in photocatalytic activity for CO2 reduction with alkaline medium -time on stream plots (a) NiO/NaTaO3, (c) 0.2 wt NiO/Na (1-x) LaxTaO (3x). Fig. 5. Comparison of activity of neat and modified NaTaO3 catalysts: (a) NaTaO3, (b) NiO/NaTaO3, (c) Na (1-x) LaxTaO (3x) , (d) Au/Na (1-x) LaxTaO (3x).(e) Ag/Na (1-x) LaxTaO (3x) , (f) RuO2/Na (1-x) LaxTaO (3x) , (g) Pt/Na (1-x) LaxTaO (3x) , (h) CuO/Na (1-x) LaxTaO (3x) , (i) NiO/Na (1-x) LaxTaO (3x). Fig. 6.Photoluminescence spectra for neat and modified NaTaO3 catalysts.(a) NaTaO3, (b) Na (1-x) LaxTaO (3x) , (c) NiO/NaTaO3, (d) CuO/Na (1-x) LaxTaO (3x) , (e) NiO/Na (1-x) LaxTaO (3x) , (f) Ag/Na (1-x) LaxTaO (3x) , (g) Pt/Na (1-x) LaxTaO (3x) , (h) RuO2/Na (1-x) LaxTaO (3x) , (i) Au/Na (1-x) LaxTaO (3x). Fig. 7. Facile charge transfer between conduction band energy levels of Na (1-x) LaxTaO (3x) and metal oxides (CuO, NiO). Fig. 8. Role of co-catalysts Pt, Ag and Au as electron traps towards charge separation. Crystallite size and band gap energy data for neat and modified NaTaO3 catalysts. crystallite size, calculated by adopting Scherrer's formula, are tabulated in Table Products distribution and quantum yield data for neat and modified NaTaO3 catalysts. Jeyalakshmi, et al., Photocatalytic reduction of carbon dioxide in alkaline medium on La modified sodium tantalate with different co-catalysts under UV-Visible radiation, Catal.Today (2015), http://dx.doi.org/10.1016/j.cattod.2015.09.004 Authors gratefully acknowledge the Department of Science Technology, Govt. of India for the grant towards establishing NCCR at IIT Madras and M/s Hindustan Petroleum Corporation Limited, Mumbai for funding the project on photocatalytic conversion of CO 2 . Supplementary data associated with this article can be found, in the online version, at http://dx.doi.org/10.1016/j.cattod.2015.09.004."}]