[{"title": "Doi", "content": "10.1016/j.apcata.2010.03.059"}, {"title": "Article_Title", "content": "CO2 photoreduction using NiO/InTaO4 in optical-fiber reactor for renewable energy"}, {"title": "Abstract", "content": "The photocatalytic reduction of CO 2 into fuels provides a direct route to produce renewable energy from sunlight.NiO loaded InTaO 4 photocatalyst was prepared by a sol-gel method.Aqueous-phase CO 2 photoreduction was performed in a quartz reactor to search for the highest photoactivity in a series of NiO/InTaO 4 photocatalysts.Thereafter, the best NiO/InTaO 4 was dip coated on optical fibers and calcined at 1100 C. A uniform NiO/InTaO 4 layer of 0.14 m in thickness was observed on the optical fiber.An optical-fiber photoreactor, comprised of 216 NiO/InTaO 4 -coated fibers, was designed to transmit and spread light uniformly inside the reactor.The UV-vis spectra of powder InTaO 4 as well as NiO loaded InTaO 4 prepared via the same procedure indicated that both photocatalysts could absorb visible light.XRD confirmed that InTaO 4 was in single phase.Vapor-phase CO 2 was photocatalytically reduced to methanol using the optical-fiber reactor under visible light and real sunlight irradiation in a steady-state flow system.The rate of methanol production was 11.1 mol/g h with light intensity of 327 mW/cm 2 at 25 C. Increasing the reaction temperature to 75 C increased the production rate to 21.0 mol/g h.Methanol production rate was 11.30 mol/g h by utilizing concentrated sunlight which was comparable to the result of using artificial visible light.The quantum efficiencies were estimated to be 0.0045 and 0.063 in aqueous-phase and optical-fiber reactors, respectively, per gram NiO/InTaO 4 photocatalyst.The quantum efficiency increased due to the superior light-energy utilization of NiO/InTaO 4 thin film in the optical-fiber reactor."}, {"title": "Experimental", "content": "Fig. 1 displays the procedure of photocatalyst preparation.Photocatalysts were prepared by aqueous sol-gel method.InTaO 4 was prepared by mixing equimolar amounts of In(NO 3 ) 3 H 2 O and Ta(OC 4 H 9 ) 5 .First, 1.2 mmol (0.4685 g) of In(NO 3 ) 3 H 2 O was completely dissolved in 50 ml of methanol.1.0 ml of conc.HNO 3 was added to maintain the solution at pH 2, then 1.2 mmol (0.5 ml) of Ta(OC 4 H 9 ) 5 was added.After the solution was stirred for 30 min, 3 ml of acetic acid was added and the mixture was continuously stirred slowly in a glove box maintained 40 humidity at 25 C for 24 h.Calculated amount of Ni(NO 3 ) 2 6H 2 O was added for 1 wt.Ni loading and PEG (polyethylene glycol) solution (0.5 ml) was added into the above InTaO 4 sol to increase viscosity and to prevent cracking during drying.The mixed NiO/InTaO 4 sol was stirred for an Optical fibers were obtained from the E-Tone Technology Company of Taiwan.It is a commercial communication fiber of OD 250 m (catalog number SM/125/250) with pure silica core and Cl-doped silica cladding, which can be withstood to above 1200 C. The polymeric shield on the optical fiber was burned off in a furnace for 3 h at 500 C. The remaining silica possessed a diameter of 112 m.The fibers were treated by a 5 M NaOH solution in an ultrasonic cleaner to increase the amount of hydroxyl on the surface, then rinsed in de-ionized water 5 times and dried before applying dip-coating procedure.This step enhanced the adhesion between the optical fiber and the coated NiO/InTaO 4 film during calcination.The bare fiber was immersed vertically into the above NiO/InTaO 4 sol for 5 min, and then pulled up by a step motor.The rate of pulling-up was 30 mm/min.The NiO/InTaO 4 fiber was dried at 80 C then heated at a rate of 3 C/min from the ambient temperature to 1100 C, and maintained at that temperature for an additional 12 h. A diffusive reflectance UV-vis spectrophotometer (Varian Cary 100) was used to measure the UV-vis absorption and to estimate the bandgap of the photocatalysts.Powder X-ray diffraction (XRD) analysis of the photocatalysts was performed on a Philips X'Pert instrument.The X-ray (wavelength 1.5405A) tube was equipped with a copper target operated at 40 kV and 30 mA.The scanning rate was 3 /min from 20 to 70 .The crystal size was calculated using Scherrer's equation.X-ray photoelectron spectroscopy (XPS) was carried out on a Thermo Theta Probe instrument.The photocatalyst was pressed into a pellet and then stuck to the sample holder using carbon tape.Carbon (1s, 284.5 eV) was used as an internal standard for binding energy correction.The specific surface area of photocatalysts was measured on a Micromeritics ASAP 2000/C5-05 system.Field emission-scanning electron microscopy (FE-SEM) was carried out on a Hitachi model S-800 instrument.The photocatalyst was sputtered with a thin film of gold to prevent surface charging and to protect the surface material from thermal damage by the electron beam. The photocatalytic activities of InTaO 4 and NiO/InTaO 4 photocatalysts were first evaluated by CO 2 photoreduction in aqueous solution.The photocatalytic reaction was carried out in a cylindrical quartz reactor with light irradiating from outside at room temperature.The light source was a circular fluorescent lamp with major wavelengths at 452, 543 and 611 nm.The influx of visible light was measured to be 146 mW/cm 2 on the irradiation surface of the reactor.The reactor was thoroughly cleaned by 5 M NaOH solution before filling with water.300 ml of de-ionized water and 2.4 g of NaOH were put in the reactor and stirred to compose 0.2 M NaOH solution.A caustic NaOH solution dissolved more CO 2 .The OH -ions in aqueous solution also act as strong hole-scavengers to reduce the recombination of hole-electron pairs, thus facilitating CO 2 photoreduction.0.3 g of InTaO 4 or NiO/InTaO 4 photocatalyst was placed and suspended in the solution.Ultra pure CO 2 was infused into the reactor to purge out air and continued for at least 4 h till CO 2 saturated the solution prior to the photocatalytic CO 2 reaction 5.The reactor was tightly closed by an acrylic cover during the reaction.The partial pressure of CO 2 was maintained slightly above 101 kPa.During the photoreaction, 1 L of solution was withdrawn for GC analysis of products at regular intervals. Vapor-phase photocatalytic reaction was carried out in a continuous circular Pyrex glass reactor (216 cm 3 ) with a quartz window for conduction of light irradiation as shown in Fig. 2. Photocatalystcoated optical fibers were assembled in the reactor such that the light source (halogen lamp, 100 W) can enter along the fibers to induce the photocatalytic reaction on its surface.The wavelength distribution of the halogen lamp ranged from 400 to 1100 nm with highest intensity at 620 nm.The influx of visible light was measured to be 327 mW/cm 2 on the quartz window.The reactor was covered with aluminum foil and a heating tape to maintain constant temperature by a temperature controller.The reactor was purged by CO 2 gas bubbling through distilled water for 1 h before and during the reaction.The partial pressure of water vapor is near 2.4 kPa.The retention time of CO 2 gas and saturated H 2 O vapor was maintained at 5000 s for every run.The total pressure was maintained at 120 kPa to prevent leakage from outside.The products were analyzed by an on-line sampling loop (5 ml) at certain periods of time.The GC was equipped with FID and 2 m long porapak QS column.Methanol was found to be the major product.Other hydrocarbons, such as methane or ethane were observed, but the amount is little and unstable.Three blank tests were performed in different conditions namely under light irradiation without photocatalyst, in the dark with photocatalyst, and under light irradiation with photocatalyst in He flow.No hydrocarbon was found in the above three conditions. The photocatalytic reduction of CO 2 was also performed under real sunlight.Concentrated natural sunlight was collected using a solar concentrator (Himawari, Japan).The UV and infrared lights were eliminated by the chromatic aberration of lens in the solar concentrator.Near 40 sunlight intensity was lost by guide cable during light transmission.The sun auto-tracking was controlled by a module consisted of sunlight sensor, timing program and a precision motor.The senor was used to detect direct sunlight.If the sun was covered by cloud, the timing program was activated to calculate the trajectory of sun.Thus the position of sun can be instantaneously tracked and the maximum sunlight intensity can be obtained during a day.The solar concentrator equipped with 6 lenses could collect sunlight, and was able to track the sun trajectory by precision motor.The concentrated sunlight was transmitted via an optical cable and projected on the window of the optical-fiber reactor.The light intensity was then measured at the window of the reactor."}, {"title": "Results_and_discussion", "content": "The specific surface area and crystal size of InTaO 4 are 1.35 m 2 /g and 69.3 nm, respectively.The specific surface area of Ni/InTaO 4 decreased to 0.78 m 2 /g and its crystal size was increased to 73.8 nm.The bandgap for InTaO 4 was calculated to be 2.6 eV based on UV-vis spectrum.This value was within the typical range of values reported for InTaO 4 in the literature 9.Fig. 3 shows SEM photos of NiO/InTaO 4 layer on optical fiber.From the top view in Fig. 3 Methanol production of CO2 photoreduction in aqueous solution. Average rate (mol/g h) a InTaO4 (950 a GC sampling at the end of 10 h reaction at 25 C. The light intensity is 146 mW/cm 2 . Table 1 summarizes the average rates of methanol production of CO 2 photoreduction on InTaO 4 and NiO/InTaO 4 in aqueous solution under light irradiation for 10 h.Pure InTaO 4 gave very small methanol rate while NiO/InTaO 4 significantly increased the rates indicating that loading nickel oxide on the surface of InTaO 4 photocatalyst enhanced its photocatalytic activity.The role of NiO is to attract electrons and provide additional active sites thus enhancing CO 2 photoreduction 11.The influence of calcination temperature on the photocatalytic activity is also revealed in Table 1.The methanol rates increased from 1.61 to 2.80 mol/g h when calcination temperatures were raised from 850 to 1100 C. The improved methanol rate was due to the pure crystalline phase of InTaO 4 at a higher calcination temperature (Fig. 4).The sol-gel method also improved the uniformity of particles by the well-mixed Ta(OC 4 H 9 ) 5 and In(NO 3 ) 3 solutions.Thus the calcination temperature was chosen at 1100 C for the preparation of NiO/InTaO 4 coated on optical fiber.The performance of photocatalytic CO 2 reduction in the optical-fiber reactor under real sunlight is shown in Fig. 8.The experiment started at 11 am till 5 pm on 22 June 2008 at Taipei, Taiwan, and the actual time is labeled in the x-axis of Fig. 8.The uniform distribution of sunlight by optical fibers provides an efficient utilization of solar energy inside the reactor.As shown in Fig. 8, the rate of methanol production increased with the intensity of sunlight in the morning, and reached a maximum rate of 11.3 mol/g h at 3 pm.The production rate quickly decreased due to the sunset in the afternoon.In addition, the reaction temperature was also an important factor.The higher the temperature, the higher the rate of methanol production was.The reactor did not require additional heating source.The IR portion of sunlight would raise the reactor temperature. The influence of reaction temperature was further investigated on the photocatalytic activities under artificial light irradiation.Fig. 9 shows the rate of methanol production in the optical-fiber reactor under visible-light irradiation after reaching steady state in 4 h.The rate monotonically increased from 11.1 mol/g h at 25 C, and achieved 21.0 mol/g h at 75 C, possible due to the increased desorption rate of methanol.Although higher reaction temperature may be applied, the adsorption of CO 2 on catalyst could be decreased resulting in the declination of reaction rate. The systems of aqueous-phase reactor and optical-fiber reactor were entirely different.In order to compare the performance of CO 2 photoreduction in these two reaction systems, their quantum efficiencies were estimated.Six electrons are required to transform CO 2 into CH 3 OH according to Eq. ( 1).If we assume an electron-hole pair to be generated by one photon activation, then the quantum efficiency of CO 2 photoreduction can be defined in Eq. ( 2).Thus, the quantum efficiency can be estimated by the methanol production rate and the total photon input of the reactor.The mole of photon could be calculated by the visible-light energy input of the reactor and the wavelength 5,20.As listed in Table 1 and shown in Fig. 9, the maximum methanol rates were 2.8 mol/g h and 11.1 mol/g h in aqueous-phase and optical-fiber reactors, respectively, at 25 C. The quantum efficiencies were calculated to be 0.0045 and 0.063 in aqueous-phase and optical-fiber reactors, respectively, based on per gram NiO/InTaO 4 photocatalyst.The quantum efficiency of optical-fiber reactor was 14 times higher than that of the aqueousphase reactor.Obviously the quantum efficiency increased due to the improved light-energy utilization of NiO/InTaO 4 film coated on the optical fiber."}, {"title": "Conclusions", "content": "Carbon is used as energy carrier in nature since the life began on the Earth.Photocatalytic reduction of CO 2 is one of the promising routes to realize renewable energy, which is similar to the bioprocess, photosynthesis.The advantage is clearly benefited from the unlimited solar energy.Furthermore, the photoreduction of CO 2 can be carried out under severe environment, e.g. in unproductive desert. The visible-light photocatalyst, InTaO 4 , can fully utilize the largest part of photo energy in sunlight.InTaO 4 with pure crystalline phase is the main reason for the high photoactivity.Our sol-gel procedure provides a technique to synthesize InTaO 4 thin film on optical fibers, which is impossible by conventional solid-state fusion.Loading of NiO significantly improves the photocatalytic activity of InTaO 4 for CO 2 photoreduction.Unlike traditional reactor, the optical-fiber reactor solves the difficulty of photon-energy delivery, especially for large-scale design.Under our experimental conditions, loading of 1 wt. nickel was suitable for CO 2 photoreduction.A steady rate of methanol production was 11.1 mol/g h with light intensity of 327 mW/cm 2 at 25 C. Increasing the reaction temperature further increased the production rate to 21.0 mol/g h at 75 C.Under real sunlight, the methanol production rate can achieve 11.3 mol/g h.The quantum efficiency of optical-fiber reactor was 14 times higher than that of the aqueous-phase reactor because NiO/InTaO 4 film on fiber had superior light-energy utilization. Fig. 1.Procedure of photocatalyst preparation.additional 48 h.The final NiO/InTaO 4 sol was split into two parts.The powder form was obtained by calcined at 1100 C for 12 h after drying sol at 80 C. The other part of sol was used for optical-fiber coating.Optical fibers were obtained from the E-Tone Technology Company of Taiwan.It is a commercial communication fiber of OD 250 m (catalog number SM/125/250) with pure silica core and Cl-doped silica cladding, which can be withstood to above 1200 C. The polymeric shield on the optical fiber was burned off in a furnace for 3 h at 500 C. The remaining silica possessed a diameter of 112 m.The fibers were treated by a 5 M NaOH solution in an ultrasonic cleaner to increase the amount of hydroxyl on the surface, then rinsed in de-ionized water 5 times and dried before applying dip-coating procedure.This step enhanced the adhesion between the optical fiber and the coated NiO/InTaO 4 film during calcination.The bare fiber was immersed vertically into the above NiO/InTaO 4 sol for 5 min, and then pulled up by a step motor.The rate of pulling-up was 30 mm/min.The NiO/InTaO 4 fiber was dried at 80 C then heated at a rate of 3 C/min from the ambient temperature to 1100 C, and maintained at that temperature for an additional 12 h.A diffusive reflectance UV-vis spectrophotometer (Varian Cary 100) was used to measure the UV-vis absorption and to estimate the bandgap of the photocatalysts.Powder X-ray diffraction (XRD) analysis of the photocatalysts was performed on a Philips X'Pert instrument.The X-ray (wavelength 1.5405A) tube was equipped with a copper target operated at 40 kV and 30 mA.The scanning rate was 3 /min from 20 to 70 .The crystal size was calculated using Scherrer's equation.X-ray photoelectron spectroscopy (XPS) was carried out on a Thermo Theta Probe instrument.The photocatalyst was pressed into a pellet and then stuck to the sample holder using carbon tape.Carbon (1s, 284.5 eV) was used as an internal standard for binding energy correction.The specific surface area of photocatalysts was measured on a Micromeritics ASAP 2000/C5-05 system.Field emission-scanning electron microscopy (FE-SEM) was carried out on a Hitachi model S-800 instrument.The photocatalyst was sputtered with a thin film of gold to prevent surface charging and to protect the surface material from thermal damage by the electron beam. Fig. 2. Optical-fiber photoreactor. (a), the NiO/InTaO 4 exhibits the size of particles ranged from 0.1 to 0.3 m.The layer thickness was approximately 0.14 m as shown in the cross section of Fig. 3(b).The layer was uniformly coated on the surface of optical fiber.Fig. 4 shows the XRD patterns of InTaO 4 calcined at temperature ranging from 850 to 1100 C. Below 950 C, some other diffraction peaks were observed indicating the minor defect of InTaO 4 crystalline phase.At calcined temperature of 1100 C, the increase intensity showed the growth of particle size.Furthermore, no other diffraction peaks except those of InTaO 4 were observed revealed that the pure InTaO 4 crystalline phase was fully formed.The XRD patterns of In 2 O 3 , Ta 2 O 5 , InTaO 4 and NiO/InTaO 4 are compared in Fig. 5.In 2 O 3 and Ta 2 O 5 are the commercial products purchased from the Riedel Company.No diffraction peaks of In 2 O 3 and Ta 2 O 5 were observed in InTaO 4 , indicating that InTaO 4 consisted of a single phase because of homogeneous mixing in the sol-gel process.Comparison of XRD for InTaO 4 and NiO/InTaO 4 reveals the same diffraction patterns.The NiO loading did not affect the crystalline of InTaO 4 .The main characteristic peak of NiO (at 44.95 ) was not observed indicating that NiO clusters were dispersed well and much smaller than InTaO 4 particles.Fig. 6 shows the UV-vis spectra of InTaO 4 and NiO/InTaO 4 photocatalysts.The photocatalysts show absorption in the visible-light region with absorption edge beyond 400 nm.A single absorption band was observed for InTaO 4 that is attributed to a pure InTaO 4 phase.The absorption edge for InTaO 4 is near 460 nm.A small absorption band in the visible region was observed near 650 nm for NiO/InTaO 4 .This band is attributed to the d-d transition band of nickel.The presence of nickel did not lead to any changes in the absorption bands for pure InTaO 4 .The XPS spectrum of NiO x /InTaO 4 shown in Fig. 7 reveals the chemical status of nickel on the surface of InTaO 4 after the calcination.The binding energy peaks for Ni 2p are at 855.8 and 873.6 eV corresponding to NiO 2p 3/2 and 2p 1/2 , respectively 22. Fig. 3. SEM (a) top view and (b) cross section of NiO/InTaO4 layer on optical fiber. Fig. 4. XRD of InTaO4 photocatalysts calcined at various temperatures. Fig. 6.UV-vis spectra of InTaO4 and NiO/InTaO4 photocatalysts. Fig. 7. Ni 2p XPS of NiO/InTaO4. Fig. 8. Rate of methanol production under real sunlight on 22 June 2008 in Taipei, Taiwan. Fig. 9.The effect of temperature on the rate of methanol production (halogen lamp, 327 mW/cm 2 ). Fig. 10 illustrates a simple mechanism of CO 2 photoreduction on the NiO/InTaO 4 .As well-known in photocatalysis, electron-hole pairs are photogenerated in InTaO 4 under UV irradiation to initiate a photocatalytic reaction.The electron migrates to the NiO cluster and hole spreads on InTaO 4 surface.Water molecule is first dissociated into H and OH -ions.Hydrogen atom is produced from H by accepting an electron and adsorbed on the NiO surface.The OH -donates an electron to hole and becomes OH radical on InTaO 4 , which subsequently reacts with another OH radical to form H 2 O 2 .H 2 O 2 receives a hole to give super oxygen (O 2 -) and two H .One oxygen molecule is released after O 2 -donates an electron to a hole.The O 2 generation is completed by the above procedure.Surface adsorbed hydrogen is used to reduce adsorbed CO 2 to methanol.Starting from the adsorbed CO 2 on NiO, format (HCOO) is formed by accepting an electron and adding one hydrogen atom.Dioxymethylene (H 2 COO) is formed from the format by adding one hydrogen atom, then form formaldehyde (H 2 CO) by accepting one electron.In this step, one oxygen is detached from dioxymethy- Fig. 10.The proposed mechanism of CO2 photoreduction. The authors acknowledge the financial support from the National Science Council of Taiwan under contract NSC 97-2911-I-002-008 and the Ministry of Economic Affairs of Taiwan under grant 97-EC-17-A-09-S1-019."}]