[{"title": "Doi", "content": "10.1016/j.apsusc.2020.145952"}, {"title": "Article_Title", "content": "Deep and selective photoreduction of CO2 to CH4 over ultrafine Pt nanoparticles-decorated SiC nanosheets"}, {"title": "Abstract", "content": "Photocatalytic reduction of CO 2 into hydrocarbon fuels, such as CH 3 OH or CH 4 , represents one of the most promising strategies to storage renewable energy and reduce the excessive CO 2 emissions.One considerable challenge remains in designing efficient photocatalysts with controllable products selectivity.Herein, we described the synergistic effects within Pt nanoparticles (NPs)-decorated SiC nanosheets (NSs) for significant improvements of CO 2 -to-CH 4 conversion efficiency (13.6 vs 3.4 umol h -1 g -1 ) and selectivity (88.3 vs 69.3 in the total products) than that of pure SiC NSs.The ultrafine Pt NPs (1.8 nm) could trap and accumulate photogenerated electrons from SiC NSs, facilitating the CH 4 formation by 8-electron reaction.Moreover, the produced CO by 2-electron reaction could be chem-absorbed on Pt NPs, while the energetic electrons provided by SiC NSs possessed strong enough potential to trigger the further reduction of Pt-CO for CH 4 generation.The deep reduction of CO 2 and CO to CH 4 not only retarded the possibility of CO poisoning on Pt cocatalyst, but also boosted the CH 4 generation rate.This work provides a fresh insight into the role of cocatalysts and highlights the importance of controlling the reaction intermediates for selective CO 2 reduction."}, {"title": "Experimental", "content": "Graphene oxide (GO) was self-synthesized by a modified Hummers method 21.Chloroplatinic acid hydrate (H 2 PtCl 6 xH 2 O) was purchased from Sigma-Aldrich.All other reagents (analytical grade) were purchased from Sinopharm Chemical Co., Ltd.. and used as received. SiC NSs were synthesized via a template-assisted carbonthermal process 22.In a typical procedure, GO solution (5 mg mL -1 ) was hydrothermally treated and freeze-dried to obtain reduced GO (rGO) monoliths, which was thereby loaded on a graphite sieve in a corundum crucible.Excessive Si powder was previously added at the crucible bottom.The crucible was subsequently heated at 1400 C for 3 h under Ar atmosphere in a heating rate of 5 Cmin -1 .The products were further heated at 700 C in air to remove residual carbon, treated with KOH solution to remove surface SiO 2 , washed repeatedly with water and then dried at 70 C to obtain the final SiC NSs. Ultrafine Pt NPs were deposited on SiC NS via a facile acid-basemediated alcohol reduction method 16.Typically, 30 mL ethylene glycol (EG) and 50 mg SiC were mixed in a three-neck flask and sonicated for 15 min, then H 2 PtCl 6 6H 2 O-EG solution (5 mg mL -1 ) was added to the flask.After 30 min stirring, 0.25 M NaOH-EG solution was injected subsequently to adjust the pH in the range of 12-13.The flask was then heated at 433 K for 3 h, after which, the mixture was thoroughly washed with acetone and H 2 O respectively, to remove the supernatant.And finally the sample were dried in vacuum oven overnight at 60 C. X-ray diffraction (XRD) spectra were recorded on a Bruker AXS D8 Advance device using Cu-K radiation ( 1.5418A).The scanning electron microscope (SEM) and transmission electron microscope (TEM) images were observed using HITACHI S-4800 and Titan G2 60-300 machine, respectively.The elemental status were analyzed by X-ray photoelectron spectroscopy (XPS), conducted on a Thermo Scientific ESCALAB 250Xi machine with an Al K source.The N 2 adsorptiondesorption isotherms were measured on an ASAP2020M apparatus at 77 K.The steady and time-resolved Photoluminescence (PL) spectra were obtained on a FM-4P-TCSPC spectrophotometer (HORIBA JobinYvon) under the excitation of 300 nm and probed at 460 nm.The Fourier transform infrared (FTIR) spectra were collected on a Nicolet Nexus 6700 spectrometer by using KBr pellets.The transient photocurrent responses were performed in a standard three-electrode system using an electrochemical workstation (CHI660e, Shanghai).The working electrode was fabricated on fluorine-doped tin oxide coated (FTO) substrates by a facile drop-casting method (0.4 mg cm -2 ).A Pt wire and a Ag/AgCl electrode was used as the counter electrode and reference electrode, respectively.A 300 W Xe lamp (CEL-HXF300, Beijing Aulight Co.,) was used as the source of simulated solar light to provide chopped irradiation from a horizontal quartz window in the cell.The electrochemical impedance spectra (EIS) measurement was performed over a frequency from 100 mHz to 1 MHz with an amplitude of 5 mV at 0.5 V bias potential. Photocatalytic reduction of CO 2 was carried out in a 60 mL homemade cylinder reactor with a quartz cover.For a typical test, 10 mg sample was dispersed into deionized water under sonication to get a homogeneous ink, which was then dried on a petri dish to obtain a catalyst film.This petri dish was put into the reactor and supported by a glass holder.After sealing, the photoreactor was vacuumed at -0.1 MPa (relative pressure) and purged by CO 2 (99.999) for 5 times.After that, 100 L ultrapure H 2 O was injected into the reactor via the silicone rubber septum and dispersed homogeneously on the bottom.A 300 W CEL-HXF300 Xe lamp 10 cm away from the reactor was used as the light source.Each test was typically performed for 4 h irradiation.During the test, the temperature in reactor was kept constant by cooling water.Certain amount of gases mixture would be taken and analyzed by a gas chromatography (GC, SP6890) equipped with a flame ionized detector (FID) and methanizer.The produced gases were calibrated with a standard gas mixture and the identity was determined by the retention time."}, {"title": "Results_and_discussion", "content": "The process of loading ultrafine Pt NPs on SiC NSs is schematically illustrated in Fig. 1a.To be specific, the abundant eOH groups originating from alkali treatment could act as the nucleation sites of Pt NPs.Accordingly, the dissociated PtCl 2 6-anions from Pt precursor would be absorbed on the surface of SiC, followed by a ligand-exchange process with OH -in basic media (pH 12-13) to form PtCl 6-x (OH) x 2-complexes.In alkaline solution, SiC NSs possessed more eOH sites, thus the Pt complexes were easier to be reduced to form more nuclei, resulting in uniform and smaller Pt NPs. The ultrathin feature of SiC NSs was proved by the TEM image in Fig. 1b, and the loading of Pt NPs had very little impact on the morphology (Fig. S1).This ultrathin nanostructure would facilitate the fast migration of photogenerated electrons towards the Pt/SiC interface.Besides, the light-adsorption property of SiC NSs was described in our previous publication 20, which exhibited obvious absorption in visible range with an absorption edge at about 470 nm.The clear lattice fringes with an interplanar spacing of 0.25 nm were observed from the HRTEM image in Fig. 1c, matching well with the 1 1 1 planes of cubic SiC.The superb crystal quality of SiC NSs would help to reduce the possibility of carriers' recombination in the grain boundaries.Seen from Fig. 1d, the Pt NPs presented uniform size and dispersed homogeneously on the surface of SiC NS.The average size of Pt NPs was 1.75 nm with a narrow size distribution obtained from the statistic histogram.It was claimed that smaller sizes and more uniform dispersion of Pt NPs would lead to stronger trapping electrons ability and offer numerous active sites.In addition, the interface formed by SiC and the Pt (1 1 1) facet could also be clearly observed in Fig. 1e, indicating an intimate contact and an easy charge transfer at the interface. XRD patterns were firstly used to check the crystalline phases of SiC NSs with or without the loading of Pt NPs.The SiC spectrum in Fig. 2a presents the characteristic peaks at 35.6, 41.4, 60.0 and 71.7, matching well with the (1 1 1), (2 0 0), (2 2 0) and (3 1 1) crystal planes of cubic SiC phase (JCPDS: 29-1129), respectively.The characteristic peaks of Pt were not clearly observed in the loading range of 1-3 wt, implying the highly dispersed state of Pt NPs.Notably, the peaks intensity of SiC decreased with the increase of Pt loading on the surface (1-3 wt), mainly due to the partial shielding effect of the surface Pt NPs.From the XPS elemental spectra in Fig. 2b, one can see that Pt element was also detected in Pt/SiC besides Si, C and O. Thus the effective loading of Pt The XPS spectra of Pt/SiC NSs were carefully fitted to analyze the bonding states of each atom.The Si spectra in Fig. 3a could be fitted into two main peaks at 101.2 and 101.9 eV, corresponding to the Si-C bond of SiC and the interface Si-OH group respectively 23.The C spectra in Fig. 3 b exhibited two main peaks at 283.3 and 284.3 eV as well as a weak peak near 286.5 eV, ascribing to the C-Si bond in SiC, CeC bond in C x CSi 4-x phase and Si 3 CeOH chemical bond on the surface, respectively 24.The O spectra in Fig. 3c included a strong peak at 532.1 eV and two weak peaks near 530.3 and 533.8 eV, which belonged to the surface SieOH, CeO and eOePt chemical bonds, respectively.These results indicated a robust heterojunction between Pt and SiC through the interface PteO bonds.The surface chemical states of Pt NPs were further characterized by Pt 4f spectrum in Fig. 3d.Generally, three sets of peaks associated with Pt 4f7/2 and Pt 4f5/2 could be observed with the increase of binding energy, contributed by the metallic Pt 0 and partially oxidized Pt species, respectively.The ratio (area fraction calculated from peak integration) of Pt 0 was calculated to be around 67.6 in the sum of the Pt 0 and Pt peaks, suggesting the ultrafine Pt NPs were mainly in metallic state with a small proportion of oxidation state such as Pt(OH) 2 and Pt(OH) 4 .The metallic Pt would promote the charge separation and transfer as well as enhance the adsorption and reduction of CO 2 molecules 25,26. The above results demonstrated that ultrafine Pt NSs were successfully loaded on SiC NSs to construct a robust Pt/SiC heterojunction, which should facilitate the rapid transfer of photogenerated electrons, and have important impacts on the photocatalysis performance.In order to elucidate this point, photocatalytic CO 2 reduction experiments were performed through a gas-solid reaction model.Fig. 4a presented the GC signals of the products over 4 h photocatalysis experiment.After qualitative comparison with the retention time of a standard gas mixture, the products were identified as CO and CH 4 , in accordance with previous reports using a similar method 272829.The generating rates of CO and CH 4 over pure SiC NSs were 1.51 and 3.42 umol h -1 g -1 , respectively (Fig. 4b).After loading with Pt NPs, the CH 4 formation rate increased significantly and reached 13.60 umol h -1 g -1 over 2 wt Pt/SiC NSs, 3 times higher than that of pure SiC NSs.Although we would like to highlight why the synergistic effects between Pt NPs and SiC NSs boost such a selective conversion of CO 2 -to-CH 4 , the conversion efficiency here actually achieved a comparable value with the latest SiC-based photocatalysts of Pt/SiC hollowsphere (16.8 umol h -1 g -1 ) 30 and 3D-SiC2D-MoS 2 (14.4 umol h -1 g -1 ) 31 (Table S1).By further increasing the content of Pt to 3 wt , the CH 4 formation rate decreased a bit, because excessive Pt NPs might shield the light absorption of SiC NSs and thus reduced the number of photogenerated electrons.Interestingly, the CO formation rate did not change obviously, indicating that the Pt/SiC NSs could not only improve the CO 2 conversion efficiency but also selectively promote the formation of CH 4 .The recyclability of Pt/SiC NSs was also investigated by 4 times cycling tests.As shown in Fig. S2a, there was no obvious loss of the CH 4 generation in four successive cycles, proving that the Pt/SiC NSs have good recyclability of photocatalytic activity.Moreover, the XPS spectra of Si, C and Pt in Fig. S2b, c and d reveal that the composition and structure of Pt/SiC almost kept consistent.Therefore, the Pt/SiC NSs also demonstrate good structural stability.Of note, the SiC and Pt/SiC NSs presented very similar N 2 adsorption-desorption isotherms with close surface area (24.3 vs 21.2 m 2 g -1 ) (Fig. S3).Thus the improved CO 2 conversion efficiency should be contributed by the synergistic effects between Pt and SiC, which were then studied in detail.In Pt/SiC NSs, the electron trapping ability of Pt NPs was a vital factor affecting its photocatalytic performance.As for SiC semiconductor, the main contribution of its CB was from the p orbital of Si.Thus we analyzed the change of Si 2p spectrum of SiC NSs before and after loading Pt NPs.In Fig. 5a, the characteristic peak of Pt/ SiC NSs underwent an obviously positive shift than that of pure SiC, suggesting the migration of electrons from SiC to Pt.Since the work function of Pt (5.65 eV) 10 is higher than that of SiC (4.0 eV) 32,33, when Pt NPs are loaded on SiC NSs, the CB of SiC will bend upward until the Fermi levels of both are consistent.Consequently, the formed Schottky heterojunction will serve as an efficient electron trap preventing electron-hole recombination in photocatalysis. To prove this point in our case of Pt/SiC NSs, the EIS spectra as well as the steady and time-resolved PL spectra of pure SiC and Pt/SiC NSs were recorded.As depicted in Fig. 5b, Pt/SiC NSs exhibited a much lower electrochemical impedance than that of pure SiC NSs under irradiation, demonstrating its faster and easier transfer of photogenerated carriers.Moreover, the PL emission intensity of Pt/SiC in Fig. S4 significantly decreased compared with that of pure SiC, suggesting that the carriers recombination was effectively suppressed.The PL attenuation of Pt/SiC NSs (Fig. 6a) was significantly weaker than that of pure SiC in the same time range, implying the elongated lifetime of free carriers 34.In addition, the transient photocurrent response of Pt/SiC NSs in Fig. 6b presented an obviously higher value than that of pure SiC NSs.All these results credibly proved the boosting of electrons transfer from SiC to Pt NPs, which certainly contributed to the improved photocatalytic CO 2 reduction. It was believed that when using Pt NPs as the co-catalyst for photocatalytic CO 2 reduction, the produced CO, even in a trace amount, would form a stable chemical adsorption with Pt and thus block the active sites 17.In our case of Pt/SiC NSs, to illustrate whether the CO poisoning effect existed or not, CO was used as a probe molecule for IR spectroscopy 29.As shown in Fig. 7a, an absorption band near 2050 cm -1 was observed, which could be ascribed to the linear adsorption state of CO on Pt surface.In addition, the absorption signals at 2160 and 2120 cm -1 corresponding to the stretching vibration of gaseous CO molecules, were caused by CO gas around the sample.These results confirmed the stable adsorption state of Pt-CO.On the other hand, the stability test over Pt/SiC NSs exhibited a stable CH 4 generation in four successive cycles.In order make this point clear, photocatalytic experiments were carried out in CO/Ar atmosphere instead of CO 2 .As expected, the CH 4 product could be detected as shown in the inset image of Fig. 7b.The adsorption state of CO on Pt nanoparticles could further be reduced into CH 4 and thereby reduced the possibility of CO poisoning on Pt NPs. Based on the above experimental results, a plausible mechanism for selective CO 2 to CH 4 over Pt/SiC NSs was schematically illustrated in Fig. 8.The hydrogenation of CO required to overcome a very high energy barrier, and thus relied on the driving force of charge transfer from the excited state of electrons donor.In our case of Pt/SiC NSs, the ultrathin SiC preferred to provide energetic electrons with strong reduction potential, while the Pt NPs acted as both the electron trapping agent and the active sites in CO 2 reduction reaction.Accordingly, the Pt/SiC NSs could provide sufficient electrons with strong reduction potential to promote the deep reduction of CO to generate CH 4 , which not only reduced the possibility of CO poisoning on Pt, but also boosted the CH 4 generation efficiency. Fig. 1.(a) Schematic illustration of the process for loading Pt NPs to prepare Pt/SiC NS, (b) TEM and (c) HRTEM images of SiC NS, (d) TEM and (e) HRTEM images of Pt/SiC NS (inset in d in the corresponding size-distribution of Pt NPs). Fig. 2. (a) XRD and (b) XPS survey spectra of pure SiC and Pt/SiC NSs. Fig. 3.The elemental XPS spectra of Pt/SiC NSs for (a) Si 2p, (b) C 1s, (c) O 1s and (d) Pt 4f. Fig. 4. (a) The GC records of the products from photocatalytic CO 2 reduction and (b) the average generation rates of CH 4 and CO over 4 h for pure SiC and Pt/SiC NSs. Fig. 5. (a) The compared Si 2p and (b) EIS spectra of pure SiC and Pt/SiC NSs. Fig. 6.(a) Time-resolved PL spectroscopy excited by an incident light of 300 nm and (b) transient photocurrent measurements of pure SiC and Pt/SiC NSs. Fig. 7. (a) FTIR spectra of Pt/SiC NSs after absorbing CO, (b) GC record of the products in CO/Ar atmosphere instead of CO 2 . Fig. 8. Schematic illustration of a plausible mechanism for the deep photoreduction of CO 2 or CO to CH 4 over Pt/SiC NSs. This work was financially supported by the National Natural Science Foundation of China (51773226, 61701514) and the Natural Science Foundation of Hunan Province (2018JJ3603)."}, {"title": "Conclusions", "content": "To sum up, ultrafine Pt NPs (1.8 nm) were deposited on SiC NSs via a facile base-mediated alcohol reduction method.The synthesized Pt/SiC NSs exhibited significant improvements on the CH 4 generation rate (13.6 vs 3.4 umol h -1 g -1 ) and selectivity (88.3 vs 69.3) from photocatalytic CO 2 reduction than that of pure SiC NSs.To be more specific, the Pt/SiC NSs could provide sufficient electrons with strong reduction potential to implement the deep reduction of CO 2 or CO for efficient and selective CH 4 formation.Such synergistic effects within Pt/SiC NSs also reduced the possibility of CO poisoning on Pt cocatalyst.We believe this work will inspire the design of novel photocatalytic systems to control the reaction intermediates for selective CO 2 reduction. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper."}]