[{"title": "Doi", "content": "10.1039/c5cp00647c"}, {"title": "Article_Title", "content": "Photocatalytic reduction of CO<sub>2</sub> with H<sub>2</sub>O to CH<sub>4</sub> on Cu(<scp>i</scp>) supported TiO<sub>2</sub> nanosheets with defective {001} facets"}, {"title": "Abstract", "content": "Highly dispersed Cu 2 O clusters loaded on TiO 2 nanosheets with dominant exposed 001 facets are prepared by a hydrothermal treatment followed by photodeposition.The physicochemical properties of the as-prepared samples are characterized carefully.The deposition position and chemical state of the Cu 2 O clusters are characterized by X-ray diffraction, transmission electron microscopy, UV-vis diffuse reflectance spectroscopy, EPR spectroscopy, and in situ CO-adsorbed FTIR spectroscopy, respectively.The results show that in situ Cu deposition leads to in situ formation of abundant oxygen vacancies (V o ) on the surface of the TiO 2 nanosheets.Interestingly, the co-existence of V o and Cu 2 O clusters could promote the photoactivity of CO 2 reduction efficiently.The surface V o play a significant role in the reduction of CO 2 .Meanwhile, the deposited Cu(I) species serve also as active sites for the formation of CH 4 , and then protect CH 4 from degradation by generated oxidation species.For the photoreduction of CO 2 to CH 4 , it is found that the content level of Cu 2 O has a significant influence on the activity.Cu-TiO 2 -1.0 shows the highest photocatalytic activity, which is over 30 times higher than that of the parent TiO 2 .This great enhancement of photocatalytic activity may be contributed by high CO 2 adsorption capacity, high electron mobility, and high concentration of V o .However, the effect of the surface area of the samples on the activity is negligible.All of this evidence is obtained by CO 2 -sorption, electrochemistry, in situ FTIR spectroscopy, in situ ERP techniques, etc.The reaction intermediates are detected by in situ FTIR spectroscopy.Finally, a probable mechanism is proposed based on the experimental results.It is hoped that our work could render one of the most effective strategies to achieve advanced properties over photofunctional materials for solar energy conversion of CO 2 ."}, {"title": "Experimental", "content": "Tetrabutyl titanate (Ti(OBu) 4 , 98), hydrofluoric acid (47), methanol and copper sulfate pentahydrate (CuSO 4 A5H 2 O) were purchased from Sinopharm Chemical Reagent Co. Ltd.All of the reagents were of analytical grade and used without any further purification. Anatase TiO 2 nanosheets with exposed 001 facets (designated as TiO 2 ) were synthesized as described in our previous report. 21In a typical procedure, 25 ml of Ti(OBu) 4 and 3 ml of hydrofluoric acid solution (47 wt) were mixed at ambient temperature in a dry teflon-lined autoclave with a capacity of 100 ml.The mixture was stirred at room temperature for 30 min, and then treated hydrothermally at 180 1C for 24 h.After being cooled to room temperature, the white precipitate was centrifuged and washed several times with water and ethanol.Finally, the resulting sample was dried overnight at 80 1C in a vacuum oven. The Cu-TiO 2 composite was prepared by a simple photodeposition method.The as-prepared TiO 2 was dispersed in an aqueous solution of CuSO 4 A5H 2 O.After the evacuation of O 2 and addition of 2 ml methanol, the suspension was irradiated with a Xe lamp for 5 h to deposit Cu species onto the TiO 2 .The final product was washed with deionized water and dried under vacuum overnight.The content of Cu was regulated by varying the dosages of CuSO 4 A 5H 2 O.The obtained samples were denoted as Cu-TiO 2 -x, where x stands for the weight percentage of the Cu species (x 0.5, 0.75, 1.0, 1.5, and 2.0).Finally, all the samples were calcined in air at 200 1C for 2 h in order to transform copper to copper oxide. X-ray diffraction (XRD) measurements were performed on a Bruker D8 Advance X-ray diffractometer using Cu Ka 1 radiation (l 1.5406A).The amounts of Cu in the products were measured by an inductively coupled plasma optical emission spectrometer (ICP-OES) (Ultima2, Jobin Yvon Co., France).Transmission electron microscopy (TEM) images were recorded using a JEOL model JEM 2010 EX microscope at an accelerating voltage of 200 kV.The samples were supported on a carbon film coated on a fine-mesh molybdenum grid.Brunauer-Emmett-Teller (BET) surface area and CO 2 adsorption were measured with an ASAP2020M apparatus (Micromeritics Instrument Corp., USA).Nitrogen adsorption and desorption isotherms were measured at 77 K, and CO 2 adsorption isotherms were measured at 273 K. Diffuse reflection spectra (DRS) of the samples were recorded on a Varian Cary-500 spectrophotometer.X-ray photoelectron spectroscopy (XPS) measurements were performed on a PHI Quantum 2000 XPS system with a monochromatic Al-Ka source and a charge neutralizer.Electron paramagnetic resonance (EPR) signals were recorded on a Bruker ESP 300 E electron paramagnetic resonance spectrometer at 77 K.In situ CO-adsorbed FTIR experiments were carried out on a Nicolet 670 FTIR spectrometer at a resolution of 4 cm A1 and 32 scans.FTIR experiments were performed in a home-made IR cell in conjunction with a vacuum system. 23,41he catalyst powders were first pressed into self-supporting disks (18 mm diameter, 20 mg), and then each disk was placed in a sample cell, which allowed the disk to move vertically along the cell tube.Prior to the FTIR measurements, the disks were treated under a dynamic vacuum (10 A4 Torr) at 473 K for 2 h.After cooling the disks to room temperature, different contents of CO were introduced into the cell via the septum with a syringe.The infrared spectra of both the solid sample and the gas phase were recorded regularly. The photocatalytic reduction of CO 2 was performed in a gassolid heterogeneous reaction mode under atmospheric pressure at ambient temperature.A 40 ml Schlenk flask with a silicone rubber septum was used as a reactor.The loading mass of the photocatalyst sample was 20 mg.This system was evacuated by a mechanical pump and filled with pure CO 2 gas.The evacuationfilling operation was repeated three times.A bar of CO 2 and 6 ml of liquid water were introduced finally with a syringe via the septum.A 300 W commercial Xe lamp was used as an irradiation resource and vertically placed outside the reactor.The temperature of the reactor was kept at 298 K with an electronic fan.After 4 h of irradiation, 0.5 ml of reactive gas was taken from the reactor with a syringe and analyzed by a GC-7890A gas chromatograph equipped with a flame ionized detector (FID) and a chromatographic column (GASPRO). Indium-tin oxide (ITO) glass pieces were used for preparation of the working electrode, which was cleaned in turn by sonication in cleanout fluid, acetone and ethanol for 10 min.5 mg of photocatalyst powder was dispersed into 0.5 ml of dimethylformamide under sonication for 6 h to form a slurry.The slurry was spread onto the conductive surface of the ITO glass to form a photocatalyst film with an area of 0.25 cm 2 .The uncoated parts of the ITO glass were isolated with epoxy resin.The photocurrent was measured by a conventional three-electrode electrochemical cell.A platinum foil counter electrode, a saturated Ag/AgCl electrode as reference, and the working electrode were immersed in a sodium sulfate electrolyte solution (0.2 M) and irradiated by a 300 W Xe lamp (l 320-780 nm).The light/dark short circuit photocurrent response was recorded with a BAS Epsilon workstation.Electrochemical impedance spectroscopy (EIS) was determined on a ZENNIUM electrochemical workstation (Zahner, Germany) and operated in a frequency range of 200 kHz to 5 mHz at an amplitude of 10 mV in DC potential after a 10 min delay."}, {"title": "Results_and_discussion", "content": "The XRD patterns of the parent TiO 2 and Cu-TiO 2 -x with different Cu contents are shown in Fig. S1 (ESI ).For TiO 2 , all diffraction peaks can be well indexed to the anatase phase (JCPDS No. 21-1272).The introduction of Cu does not lead to a change in the numbers or the positions of the diffraction peaks, and no relative diffraction of a Cu oxide species is observed.This shows that Cu-TiO 2 -x keeps the anatase structure, and the Cu species is highly dispersed on the TiO 2 surface. The TEM and HRTEM images of the parent TiO 2 and Cu-TiO 2 -1.0 samples are shown in Fig. 1.It can be seen that these two samples show a nanosheet stacking structure with an average thickness of 6 nm versus 50 nm in lateral size (Fig. 1a andc).For TiO 2 , the clear lattice fringes indicate the good crystallinity of the samples, and the 0.35 nm spacing is in accordance with the d-spacing of the (101) facet of anatase TiO 2 (Fig. 1b andd).According to the symmetries of anatase TiO 2 , 42 the exposed two flat square surfaces of the nanosheets are ascribed to 001 facets of the anatase phase.It can be seen from the enlarged view of Fig. 1b andd that lots of black dots are present on the 001 facets.When the figures are further enlarged, these black dots should be assigned to the defect sites rather than TiO 2 or Cu species particles (Fig. S2,ESI ).These defects are attributed to V o based on the EPR results, which will be discussed later (Fig. 5).Compared with the parent TiO 2 , the Cu-TiO 2 -1.0 samples have more V o sites.These V o may be generated by the in situ photodeposition process using CH 3 OH as a sacrificial agent. 43The difference between the two samples in microstructure can be explained by the chemical state of the copper species and its stabilization action for the surface V o . Consistent with the XRD result, no nanoparticles corresponding to the Cu species are observed from the TEM or HRTEM images of the Cu-TiO 2 -1.0 sample (Fig. 1c, d and2a).However, the EDX analysis shows two strong fluorescence signals (Fig. 2b), indicating the presence of Cu.In order to clarify the distribution of the Cu species on the TiO 2 surface, X-ray elemental mapping analysis was conducted, as shown in Fig. 2c-e.The result demonstrates strongly that the Cu species are highly dispersed on the surface of TiO 2 .The Cu contents of the samples were also measured by an ICP-OES method.As shown in Table 1, we can see that the experimental values are close to the predicted values.According to the photodeposition mechanism, the copper cluster produced by the method does not lead to a change of TiO 2 structure.Based on the above mentioned results, we suggest that Cu is not doped into the TiO 2 lattice as ions but that it may be highly dispersed as oxide clusters on the surface of the TiO 2 nanosheets.This journal is the Owner Societies 2015 The diffuse reflectance spectra of the bare TiO 2 and Cu-TiO 2 -x are shown in Fig. S3 (ESI ).The optical absorption thresholds are almost unchanged before and after deposition of the Cu species, further indicating that the Cu species only deposits on the TiO 2 surface instead of doping into the crystal lattice of TiO 2 . The nitrogen adsorption-desorption isotherms and the corresponding pore-size distribution curves of the bare TiO 2 and the Cu-TiO 2 -x samples are shown in Fig. S4 (ESI ).All the isotherms are of type IV and have similar loop rings (Fig. S4a, ESI ), which indicates the presence of mesopores in the samples. 44Fig. S4b (ESI ) shows that all the samples exhibit bimodal pore size distributions.The variations of pore size distribution curves may be due to the blocking of some pores of TiO 2 by the deposition of the Cu species.The BET surface areas for the Cu-TiO 2 -x samples are similar to that of the parent TiO 2 , as shown in Table 1. In situ FTIR spectroscopy of CO adsorption.To determine the oxidation state of the Cu species in the Cu-TiO 2 -x samples, in situ FTIR spectroscopy using CO as a probe molecule was carried out.It is well-known that CO adsorbed onto Cu(I) sites shows a vibration peak at 2128 cm A1 in the FTIR spectrum, while the vibration peaks of Cu 2 -CO species and free CO are at 2200 and 2142 cm A1 , respectively. 45,46That is, the in situ CO-sorption FTIR spectra can be used for clearly identifying the chemical states of copper species. 47Fig. 3a shows the It can be seen that the peak intensity of CO at 2128 cm A1 increases with the increased loading of Cu, further proving the existence of the Cu(I) species over TiO 2 nanosheets.Furthermore, on all of the as-prepared samples there is no Cu(II) species.Based on an important role of the Cu(I) species in the reduction of CO 2 , the as-prepared Cu-TiO 2 -x samples may be used as promising photocatalysts for the reduction of CO 2 . X-ray photoelectron spectroscopy.To illustrate the surface composition and chemical state of the samples, XPS measurements were carried out.The XPS survey spectrum of Cu-TiO 2 -1.0 confirmed the existence of Cu, Ti, and O in the sample.No obvious peaks for impurities, except for C, were observed in any samples.As shown in Fig. 4A, the binding energies (BE) of Cu 2p 3/2 and Cu 2p 1/2 are equal to 932.1 and 951.9 eV, respectively.Furthermore, no clear ''shake-up'' satellite peaks contributed by the paramagnetic chemical state of Cu 2 were observed.These results demonstrate that the chemical state of Cu on the sample is Cu , 48,49 which is in agreement with the in situ FTIR results.In contrast, no signal was found in the TiO 2 sample.Fig. 4B andC show the high-resolution XPS spectra of Ti 2p and O 1s.The core level peaks at ca. 458.7 and 529.6 eV are attributed to typical Ti 2p 3/2 and O 1s, respectively. 21A higher BE peak of O 1s (531.4 eV) could also be observed, which is assigned to surface adsorbed oxygen, such as the hydroxyl species. 21Compared with the parent TiO 2 , we can clearly see that the BE value of the Ti 2p peaks over Cu-TiO 2 -1.0 are slightly shifted to a lower energy region (B0.2 eV) and that the BE value of O 1s is not changed.In other words, the electron density of Ti is increased. 50This indicates that abundant oxygen vacancies are created over the TiO 2 nanosheet after the modification by the Cu 2 O clusters.It is in line with the results of TEM and EPR.Fig. 4D shows the high-resolution XPS spectra of C 1s.The C element is visible due to the adventitious hydrocarbon present in the XPS instrument itself and the residual carbon from the sample.It should be noted that most of the organic carbon introduced from the precursor is removed during the preparation process of the samples. EPR spectroscopy.Fig. 5 shows the EPR spectra of the TiO 2 and Cu-TiO 2 -x catalysts at 77 K in air and in a CO 2 atmosphere before and after simulated solar light irradiation.With and without irradiation, the two signals attributed to Ti 3 and V o are observed for the TiO 2 and Cu-TiO 2 -1.0 samples.The peak with a g factor of 1.99 could be assigned to Ti 3 . 51The peak with a g factor of 2.003 could be assigned to V o . 52As shown in Fig. 5a, the intensity of Ti 3 decreases significantly in the dark and in an air atmosphere, but it is found that the intensity of V o increases after loading with the Cu 2 O species.Under simulated solar light irradiation, the intensities of Ti 3 and V o dramatically increase in the air atmosphere due to the surface redox reactions of the photogenerated electron-hole pairs.Fig. 5b shows the EPR spectra of the Cu-TiO 2 -1.0 sample both in air and in CO 2 atmospheres.In the case of darkness, nearly no Ti 3 signal is observed for Cu-TiO 2 -1.0 in either of the two atmospheres, indicating the inhibition by the Cu species of Ti 3 formation in the CO 2 system.Accordingly, we suggest that the raw Cu 2 species are nicely attached on the site of Ti 3 and then are reduced into Cu species through an oxidation-reduction reaction, Cu 2 Ti 3 -Cu Ti 4 . 52,53As a result, the Cu(I) species is strongly bonded on the surface of TiO 2 by the powerful chemical interaction, which is beneficial for the migration rate of photogenerated electrons and suppresses the recombination rate of electron-hole pairs. In order to provide evidence for the variations of photoelectric response before and after decoration by Cu 2 O species on TiO 2 nanosheets, transient photocurrent responses of pure TiO 2 nanosheets and Cu-TiO 2 -x sample electrodes were recorded over several on-off irradiation cycles.Fig. S5a (ESI ) shows a comparison of the I-t curves for the as-prepared samples over several on-off cycles of intermittent irradiation without any bias potential.Compared with the bare TiO 2 sample, all the Cu-TiO 2 -x samples exhibit an increase in the photocurrent.The Cu-TiO 2 -1.0 sample shows the highest photocurrent.Fig. S5b (ESI ) shows the Nyquist plots of TiO 2 and Cu-TiO 2 -x electrodes under dark conditions.The diameter of the arc radius on the Nyquist plots of the Cu-TiO 2 -x electrodes is smaller than that of the bare TiO 2 electrode.Results from the photocurrent spectra and impedance spectra indicate that the Cu-TiO 2 -x electrodes have higher conductivity than the bare TiO 2 electrode.The enhanced conductivity may be derived from the formation of an internal electric field between Cu 2 O and TiO 2 . 54High conductivity may promote the separation rate of the photogenerated electron-hole pairs and then prolong the lifetime of charge carriers at the semiconductor interface. Since the conduction band potential of TiO 2 is more negative than the reduction potential of CO 2 /CH 4 (A0.24eV vs. NHE, pH 7.0), 55 it is energetically favorable for electrons from the conduction band of TiO 2 to transfer to CO 2 to initiate the reduction of CO 2 with H 2 O, producing CH 4 .Fig. 6 shows the accumulative yields of CH 4 during the photoreduction of CO 2 in the presence of H 2 O vapor over the parent TiO 2 nanosheet and the Cu-TiO 2 -x samples under simulated solar light irradiation for 4 h.Only methane is detected as a product in the gas mixture of CO 2 with H 2 O vapor with the TiO 2 or the Cu-TiO 2 -x nanocomposites as photocatalysts, which is in line with the previous published work that CH 4 is the main product of CO 2 photoreduction with water vapor.The Cu 2 O content has a significant influence on the photocatalytic activity of the TiO 2 nanosheets.In the absence of Cu 2 O, the bare TiO 2 shows the lowest photocatalytic activity for CO 2 reduction and CH 4 production.When the TiO 2 nanosheets have been modified by Cu 2 O through a photodeposition method, the photogenerated electrons and holes are transferred quickly from the bulk TiO 2 to the interface for the photoreduction of CO 2 due to the formation of an internal electric field.Thereafter, all Cu-TiO 2 -x samples exhibit a superior photocatalytic activity for reduction of CO 2 compared with the parent TiO 2 .Furthermore, Cu 2 O clusters grafted onto the surface of TiO 2 could increase the surface alkalinity of the samples efficiently, and thus, the products will adsorb more CO 2 molecules to promote the mass transfer process in the photocatalytic reaction.This may be another reason for the superior activities of the Cu-TiO 2 -x nanocomposites.To rule out the effect of surface area on the photocatalytic activities, we normalized the photocatalytic reduction rates with respect to the surface areas (Table 1).It can be seen that the order of the normalized rates is the same as the original order.Therefore, the increased activity may be contributed by the physicochemical properties of the samples, such as the enhancement of alkalinity, the enhanced adsorption of CO 2 on Cu , the higher mass transfer efficiency of CO 2 , and the high separation rate of the photogenerated charge carriers.Among the Cu modified samples, the CH 4 evolution rate follows the order: Cu-TiO 2 -1.0 4 Cu-TiO 2 -1.5 4 Cu-TiO 2 -0.75 4 Cu-TiO 2 -0.5 4 Cu-TiO 2 -2.0 4 TiO 2 .With an increasing Cu 2 O cluster amount from 0 to 1.0 wt in the composite, the yields of CH 4 are increased gradually because of the enhancement of photocurrent and adsorption capacities for CO 2 molecules.The Cu-TiO 2 -1.0 sample shows the highest activity, reaching 8.68 mmol h A1 g A1 , which is over 30 times higher than that of the parent TiO 2 .However, when the Cu content is higher than 1.0 wt, the photocatalytic activity is decreased.This may be due to the integrative effects of the Cu 2 O cluster aggregation, the covering of active sites by the excess nanoparticles, and the recombination of charge carriers, even if Cu-TiO 2 -1.5 and Cu-TiO 2 -2.0 have higher CO 2 adsorption capacities. Furthermore, a set of control experiments was carried out to confirm the photocatalytic process in the photoreduction of CO 2 .As shown in Fig. 7, no appreciable products were detected in the absence of either photocatalyst or light irradiation.It can be clearly found that there is a dramatic decrease in catalytic activity when the reaction is carried out in an anhydrous CO 2 atmosphere, and an inactivation in an N 2 atmosphere.All of these findings illustrate that the reactions over Cu-TiO 2 -x samples are photocatalytic processes.To understand the role of V o , we prepared Cu 2 O-TiO 2 nanosheet hybrid composite samples with a very low concentration of V o through the postannealing of the Cu-TiO 2 -1.0 sample in an air atmosphere.The photocatalytic activity was greatly reduced.In comparison, the difference of the Cu-TiO 2 -1.0 sample with a high concentration of V o before and after the post-annealing process in an N 2 atmosphere was negligible.Additionally, due to the fact that most of the surface V o were produced by the in situ photodeposition process, when the reduction of CO 2 was performed over the Cu 2 O-TiO 2 nanosheet sample prepared by a physical mixture method, it is no surprise that the production rate of CH 4 just reached 0.57 mmol h A1 g A1 .However, if the TiO 2 nanosheet sample was reduced under a H 2 atmosphere to enhance the concentration of V o before mixing with Cu 2 O, it is found that the as-prepared Cu 2 O-TiO 2 nanosheet sample exhibited relatively high activity (2.78 mmol h A1 g A1 ).Moreover, using commercial TiO 2 nanoparticles without surface V o as the catalyst (Table 1), no CH 4 was produced although it can adsorb CO 2 molecules.These results strongly indicate that V o plays a significant role in the reduction of CO 2 . It is considered that the mass transfer of CO 2 on the catalyst is a preceding step to its photoreduction and plays a key role in affecting the photocatalytic activity.To study the CO 2 adsorption ability of the catalysts, we tested the CO 2 adsorption isotherms of the TiO 2 and Cu-TiO 2 -x samples, as shown in Fig. 8 and Table 1.The comparison of CO 2 adsorption isotherms over the TiO 2 and Cu-TiO 2 -1.0 samples shows that the Cu-TiO 2 -1.0 sample has a much higher adsorption capability for CO 2 than does the TiO 2 sample.The maximum CO 2 uptake for Cu-TiO 2 -1.0 is 8.2 cm 3 g A1 at 1 atm, whereas TiO 2 shows poor adsorption of CO 2 molecules.As seen in Table 1, at 1 atm and 273 K, the CO 2 adsorption capacity of the Cu-TiO 2 -x composite samples increases with increasing Cu 2 O content.By normalizing with respect to surface area, we can see that the increased CO 2 adsorption capacity of the composite samples is not caused by the increase in the specific surface area, but by the content of Cu 2 O species.The Cu 2 O species could enhance the alkalinity of the sample to adsorb more acidic CO 2 molecules, and the formation of Cu 2 O by the photoreduction and in situ photodeposition process could create more V o over TiO 2 nanosheets.The enhanced alkalinity and formed V o could co-promote the adsorption of CO 2 .An increase of adsorption capability for CO 2 over Cu-TiO 2 -x can therefore facilitate the mass transfer process and play an important role in the higher CO 2 photoreduction activity. In order to investigate the photoreduction CO 2 reaction intermediates, in situ FTIR was carried out.Fig. 9 displays the FTIR spectra of adsorbed CO 2 at the surface of Cu-TiO 2 -1.0 before and after simulated solar light irradiation.As shown in Fig. 9, in the dark, CO 2 and H 2 O co-adsorbed on Cu-TiO 2 -1.0 result in the formation of carboxylate (CO 2 A , 1267 cm A1 ) and H 2 O (1640 cm A1 ). 29,56The formation of CO 2 A indicates that an electron could be spontaneously attached to CO 2 from the defective anatase even in the dark.It should be noted that CO 2 is a rather inert molecule with a positive electron affinity and the process CO 2 e A CO 2 A is an energetically unfavorable reaction.However, the theoretical calculation results show that CO 2 can be strongly adsorbed on V o on the surface of TiO 2 and the activation barrier of CO 2 reduction can be greatly reduced. 30Our in situ EPR experiment has proved this prediction.When CO 2 is introduced into the system instead of air, we can see that the intensity of V o is decreased, while the intensity of Ti 3 does not change (Fig. 5b).That is, the surface V o can serve as reactive sites for the formation of CO 2 A on the surface of TiO 2 . Immediately upon photo-irradiation for 20 min, the peak of surface H 2 O (1640 cm A1 ) was obviously reduced and that of the CO 2 A species was increased.Upon increasing the photoirradiation time, the intensity of the H 2 O peak gradually decreased, while that of CO 2 A further increased.These spectral changes in Fig. 9 suggest that the CO 2 A species may be the predominant intermediate on our sample's surface during the CO 2 photoreduction process, and that H 2 O participates in the reaction with CO 2 by donating electrons or scavenging holes. Based on the above experimental results and analysis, a possible mechanism for the photocatalytic reduction of CO 2 over Cu-TiO 2 -x may be proposed, and is illustrated in Fig. 10.Firstly, CO 2 molecules and H 2 O vapors introduced into the system may be adsorbed on the surface of Cu-TiO 2 -x.Under simulated solar light irradiation, the valence band (VB) electrons (e A ) of the TiO 2 nanosheets are excited to the conduction band (CB), creating holes (h ) in the VB.The excited electrons transfer to the surface of TiO 2 and promote the reduction of adsorbed protons on the surface of TiO 2 . 57The formed atomic hydrogen then migrates to the Cu species.The partial electron may also transfer to the interfacial Cu species and then reduce the protons to form atomic hydrogen on the Cu species.At the same time, h may be quenched at another titania surface by the oxidation of adsorbed hydroxyl species.In addition, CO 2 molecules are adsorbed on V o and activated by dark electrons and photogenerated electrons, and then the activated CO 2 molecules are reduced to form CO 2 . Finally, the activated CO 2 A transform into CH 4 through reacting with the formed atomic hydrogen on the Cu(I) species via a photogenerated electron-induced multistep reduction process involving electron and proton transfer, C-O bond breaking, and C-H bond formation.Because the formed CH 4 has a poor interaction with the active Cu(I) species site and the oxidation species are formed on the TiO 2 surface, CH 4 could be produced without degradation.It is worth mentioning that the fast desorption of CO 2 A from V o , the fast desorption of CH 4 from the active Cu(I) species site, and the continuous production of V o and CO 2 A under light irradiation are the main contributing factors to the completion of the photocatalytic oxidation cycle and to the stability of the photocatalyst.The photocatalytic reduction of CO 2 to CH 4 on the V o surface of Cu-TiO 2 -x may be described as follows:"}, {"title": "Conclusions", "content": "In summary, for the first time, a series of Cu-TiO 2 -x has been developed for the photocatalytic reduction of CO 2 to CH 4 through a simple photodeposition treatment, by which highly dispersed Cu 2 O clusters are deposited on the TiO 2 with defective 001 facets.The content of Cu(I) has a significant influence on the activity.The optimal Cu(I) content was determined to be 1.0 wt and the corresponding CH 4 -production rate was 8.68 mmol h A1 g A1 .This is because the Cu(I) species not only enhances the adsorption of CO 2 molecules, but also accelerates the migration rate of photoinduced charge carriers and serves as a reactive site for the formation of CH 4 .Thus the CO 2 reduction performance is enhanced over the Cu-TiO 2 -x composite photocatalysts.Notably, surface V o play a very important role in the activation and dissociation of CO 2 molecules on the surface of TiO 2 .Our present work may illuminate the role of V o Fig. 10 The possible mechanism for photoreduction of CO 2 over Cu-TiO 2 -x. experimentally and offers promising prospects for the development of highly efficient photocatalysts for the reduction of CO 2 to CH 4 via a heterogeneous photocatalytic process. Fig. 1 TEM and HRTEM images of the samples with loading of 1 wt Cu species (c) and (d) and without Cu species (a) and (b). Fig. 2 TEM images (a), EDX spectra (b), and ''O'' (c), ''Ti'' (d) and ''Cu'' (e) elemental mapping images of the Cu-TiO 2 -1.0 sample. Fig. 3 Change in the IR spectra of CO adsorption on the Cu-TiO 2 -1.0 with different CO content (a); the Cu-TiO 2 -x photocatalysts after adsorption of CO for 35 min at room temperature (b). Fig. 4 High-resolution XPS of parent TiO 2 (a) and Cu-TiO 2 -1.0 (b). Fig. 5 (a) EPR spectra of the TiO 2 and Cu-TiO 2 -1.0 catalysts under vacuum at 77 K before and after simulated solar light irradiation; (b) EPR spectra of the Cu-TiO 2 -1.0 sample in the presence of air and CO 2 . Fig. 6 Comparison of the photocatalytic CH 4 -production rate of the bare TiO 2 and Cu-TiO 2 -x samples under simulated solar light irradiation. Fig. 7 The reduction of CO 2 under different conditions.The reaction was carried out (A) in the absence of photocatalyst; (B) in the darkness; (C): under an anhydrous CO 2 atmosphere; (D) under an N 2 atmosphere; (E) over the Cu-TiO 2 -1.0 sample, prepared by a post-annealing process in an air atmosphere; (F) over the Cu-TiO 2 -1.0 sample, prepared by a postannealing process in an N 2 atmosphere; (G) over a 1 Cu 2 O-TiO 2 nanosheet hybrid composite sample, prepared by a physical mixture method; (H) over a TiO 2 nanosheet, pre-reduced in an H 2 atmosphere, and a 1 Cu 2 O-TiO 2 nanosheet hybrid composite sample, prepared by a physical mixture method. Fig. 8 CO 2 adsorption isotherms (1 atm, 273 K) of TiO 2 and Cu-TiO 2 -1.0 samples. V o e A -CO 2 A o H-Cu(I) ---CH 4 OH A Cu(I) (5) OH A h ---O 2 H (6) Phys.Chem.Chem.Phys., 2015, 17, 9761--9770 9769 This journal is the Owner Societies 2015 The work is financially supported by the National Natural Science Foundation of China (Grants No. 21173044, 21303019, U1305242), and the Natural Science Foundation of Fujian Province (2014J05016). Electronic supplementary information (ESI) available: The crystal structure, enlarged HRTEM images, photoabsorption performance, pore structure, photoelectrical properties of the as-prepared samples.See"}]