[{"title": "Doi", "content": "10.1016/j.apcatb.2014.01.048"}, {"title": "Article_Title", "content": "Photocatalytic reduction of CO2 over exposed-crystal-face-controlled TiO2 nanorod having a brookite phase with co-catalyst loading"}, {"title": "Abstract", "content": "Photocatalytic reduction of carbon dioxide (CO 2 ) was carried out using exposed-crystal-face-controlled titanium(IV) oxide (TiO 2 ) having a brookite phase.Methanol (CH 3 OH) was detected as the main product, and trace amounts of formic acid, carbon monoxide, methane, and hydrogen were also detected in some cases.The prepared nanorod-shaped brookite TiO 2 with large 2 1 0 and small 2 1 2 exposed crystal faces showed larger CH 3 OH generation than that of commercial brookite TiO 2 powder (Kojundo Chemical Laboratory Co., Ltd.).The activity of a brookite TiO 2 nanorod for CO 2 reduction depended on its aspect ratio because the 2 1 0 crystal faced worked as a reduction site, whereas an oxidation site was assigned to 2 1 2 crystal faces.Photodeposition of gold (Au) or silver (Ag) nanoparticles on the nanorod-shaped brookite TiO 2 induced a dramatic increase in CH 3 OH production because the deposited metal particles work as reductive sites for multi-electron reduction of CO 2 .Among the co-catalyst-loaded brookite TiO 2 nanorods, nanorod-shaped brookite TiO 2 loaded with Ag showed higher activity.The source of carbon of CH 3 OH obtained by CO 2 reduction is discussed on the basis of results of a labeling experiment using 13 CO 2 ."}, {"title": "Experimental", "content": "A titanium precursor (titaniumethoxide) was purchased from Sigma-Aldrich.Hydrogen peroxide (30), ammonia, glycolic acid, polyvinyl alcohol (PVA), and polyvinyl pyrolidone (PVP) were purchased from Wako Pure Chemical Industries, Ltd.Glycolic acid was used to control the crystallinity and morphology of brookite TiO 2 particles.Commercial brookite TiO 2 powder was obtained from Kojundo Chemical Laboratory Co., Ltd.Other chemical reagents used in the present study were commercial products without further treatment. Morphology-controlled brookite TiO 2 with 2 1 0 and 2 1 2 exposed crystal faces was prepared by hydrothermal synthesis 52,555657. The procedure for preparation of morphology-controlled TiO 2 without an aspect ratio control reagent such as PVA is as follows. Milli-Q water (3.0 cm 3 ) was added to 10 cm 3 of titanium(IV) ethoxide and 50 cm 3 of ethanol with vigorous stirring, and the mixture was stirred for 30 min at room temperature.The resulting precipitate was centrifugally separated from the solution and dried under reduced pressure.The obtained amorphous titanium hydroxide particles (12.5 mmol) were dispersed in 30 hydrogen peroxide (40.0 cm 3 ).Then 25 ammonia (10.0 cm 3 ) and glycolic acid (18.75 mmol) were added, and yellow peroxo titanic acid (PTA) solution was obtained.After stirring the solution at ca. 60 C for 6 h to remove excess amounts of hydrogen peroxide and ammonia, an orange gelled compound was obtained.The gelled compound was dispersed in Milli-Q water (3.0 cm 3 ) and pH of the solution was adjusted to 10 by addition of ammonia.Then the volume of the solution was adjusted (50.0 cm 3 ) by addition of Milli-Q water, and the solution in a Teflon bottle sealed with a stainless jacket (Sanaikagaku Co., HU-100) was heated at 200 C for 48 h in an oven.After hydrothermal treatment, the residue in the Teflon bottle was washed with Milli-Q water until ionic conductivity of the supernatant was 10 S cm -1 .The particles were dried under reduced pressure at 60 C for 12 h. Milli-Q water (3.0 cm 3 ) was added to 10 cm 3 of titanium(IV) ethoxide and 50 cm 3 of ethanol with vigorous stirring, and the mixture was stirred for 30 min at room temperature.The resulting precipitate was centrifugally separated from the solution and dried under reduced pressure.The obtained amorphous titanium hydroxide particles (25.0 mmol) were dispersed in 30 hydrogen peroxide (40.0 cm 3 ).Then 25 ammonia (10.0 cm 3 ) and glycolic acid (50.0 mmol) were added, and yellow peroxo titanic acid (PTA) solution was obtained.An aqueous solution containing an appropriate amount of PVA or PVP was added to the PTA solution.After stirring the solution at room temperature for 6 h to remove excess amounts of hydrogen peroxide and ammonia, an orange gelled compound was obtained.The gelled compound was dispersed in Milli-Q water (3.0 cm 3 ) and pH of the solution was adjusted to 10 by addition of ammonia.Then the volume of the solution was adjusted (50.0 cm 3 ) by addition of Milli-Q water, and the solution in a Teflon bottle sealed with a stainless jacket (Sanaikagaku Co., HU-100) was heated at 200 C for 48 h in an oven.After hydrothermal treatment, the residue in the Teflon bottle was washed with Milli-Q water until ionic conductivity of the supernatant was 10 S cm -1 .The particles were dried under reduced pressure at 60 C for 12 h. For photodeposition of Au, an aqueous suspension consisting of brookite TiO 2 particles (200 mg) and 50 mL of an ethanol solution (8 vol) containing an appropriate amount of hydrogen tetrachloroaurate(III) tetrahydrate was photoirradiated with a light-emitting diode (Nichia, NCCU033), which emitted light at a wavelength of ca.365 nm and an intensity of 0.3 mW cm -2 , under a nitrogen atmosphere with vigorous magnetic stirring for 24 h.For photodeposition of Ag, an aqueous suspension consisting of TiO 2 particles (200 mg) and 50 mL of Milli-Q water containing an appropriate amount of silver nitrate was photoirradiated under the same conditions.After irradiation, photodeposited samples were obtained by washing with water several times and drying.The net amount of Au or Ag on the TiO 2 surface was estimated by analysis of the filtrate with inductively coupled plasma optical emission spectroscopy (ICPOES; Shimadzu, ICPS-8000).ICP analysis revealed that the net molar amounts of Au and Ag compounds photodeposited on the brookite TiO 2 by photodeopsition were more than 99 of the provided molar amounts of Au and Ag. Crystal structures of the TiO 2 powders were characterized by using an X-ray diffractometer (Rigaku, MiniFlex II) with Cu K radiation ( 1.5405A).Primary particle sizes of the prepared samples were estimated from peaks at 37 which are attributed to brookite 1 2 1 in XRD patterns using the Scherrer equation: d 0.9 /cosA, where is the wavelength of X-rays, A is the Bragg angle and is the full width at half maximum. was estimated by fitting the XRD patterns with a superposition of Lorentz functions for peaks attributed to brookite.Diffuse reflectance (DR) spectra were measured using a UV-VIS spectrometer (Shimadzu, UV-2500PC and 2600) equipped with an integrating sphere unit (ISR-240A and ISR-2600plus).Specific surface area (S BET ) of the particles was determined with a surface area analyzer (Quantachrome, Nova 4200e) by using the Brunauer-Emmett-Teller equation.The morphology of prepared TiO 2 particles was observed by using a scanning electron microscope (SEM; JEOL, JSM-6701FONO) and a transmission electron microscope (TEM; Hitachi, H-9000NAR).X-ray photoelectron spectroscopy (XPS) spectra were obtained by using Kratos AXIS NOVA equipped with an Al K X-ray source of the dual anode.The shift of binding energy was corrected using the C 1s level at 284.6 eV as an internal standard.The net amounts of Au or Ag compounds on the hybrid photocatalysts were estimated by analysis of the filtrate with inductively coupled plasma optical emission spectroscopy (ICP-OES; Shimadzu, ICPS-8000). Before evaluation of the photocatalytic activity, each sample was irradiated with UV light using black light (UVP, XX-15BLB) for one day in order to remove organic compounds on the sample. 1 O 2 (15 mM) treatment of the photocatalysts was performed for 2 h by using 1 O 2 generator (EKBIO-1100, Ebara Jitsugyo Co. Ltd) just before photocatalytic reduction of CO 2 experiments.Photocatalytic reduction of CO 2 was carried out under ambient pressure.A light-emitting diode (Nichia, NCCU033), which emitted light at a wavelength of ca.365 nm and an intensity of 0.3 mW cm -2 , was used as the light source for photocatalytic evaluation, and a test tube containing 5 mg of TiO 2 and 5 mL of 0.2 mol L -1 KHCO 3 aqueous solution saturated with CO 2 was photoirradiated with stirring for 24 h.Reaction products in liquid and gas phases were analyzed by gas chromatography (Hitachi G-3500, FID detector) with DB-WAXETR columns, gas chromatography (GL Science 490-GC, micro TCD detector) with MS-5A columns, and ion chromatography (Dionex, ICS-900) with IonPac AS-12A columns.Spherical shaped brookite TiO 2 was used as commercial brookite TiO 2 powder. Apparent quantum efficiency (QE) was defined by the following equation because of a 6-hole process for production of CH 3 OH as a main product from CO 2 reduction.Photodeposition of Pt and PbO 2 were carried out to determine reduction and oxidation sites on TiO 2 particles, respectively 58.For determination of reduction sites, exposed crystal surface photodeposition of Pt was performed.An aqueous brookite TiO 2 nanorod suspension (2 g L -1 ) containing 0.52 M 2-propanol and 1 mM hexachloroplatinic acid (H 2 PtCl 6 6H 2 O) was irradiated with a 300 W mercury UV lamp (WACOM Model XDS-501S) for 24 h.N 2 gas was vigorously purged through the suspension prior to UV irradiation.The light intensity was about 1 mW cm -2 .After irradiation, the color of the powder changed from white to silver, and the suspension was centrifuged and washed with distilled water and then collected as powder after drying for 5 h at 60 C under reduced pressure. PbO 2 nanoparticles were deposited as a result of Pb 2 ion oxidation in order to identify oxidation sites on the surface of brookite TiO 2 nanorods.This reaction was carried out in an aqueous brookite TiO 2 nanorod suspension (2 g L -1 ) containing 0.1 M Pb(NO 3 ) 2 under an aerated condition.The pH of the solution for this reaction was adjusted to 1.0 by the addition of nitric acid according to the literature 58.After photoreaction for 24 h using a 500 W Hg lamp (USHIO Co. Ltd., SX-UI501HQ), the color of the powder changed from white to brown, indicating that PbO 2 had been deposited on the surface.The light intensity was about 0.1 W cm -2 .Pt and PbO 2 particles deposited on TiO 2 were observed in SEM, EDX and TEM images."}, {"title": "Results_and_discussion", "content": "Fig. 1 shows an XRD pattern of the prepared TiO 2 .The structure of prepared sample was attributed to single-phase brookite TiO 2 .Fig. 2 shows a TEM image of the prepared TiO 2 .Rod-like morphology with a length of 115 nm and width of 35 nm, which were agreed with the primary particle size estimated from the XRD pattern.Assignment of these exposed crystal faces was confirmed by SEM (Fig. 3), TEM (Fig. 2) and selected area electron diffraction (SAED) analyses.The prepared TiO 2 showed a nanorod shape with large 2 1 2 and small 2 1 0 exposed crystal faces, indicating that the nanorod-shaped particles were single crystals.S BET of the prepared TiO 2 was 45 m 2 g -1 . To determine the role of PVA or PVP in the reaction, we conducted a series of syntheses by varying the concentration of PVA or PVP.TEM and SEM images showed that addition of the PVA or PVP polymer resulted in control of the shape of TiO 2 nanorods.Fig. 2(a andb) shows TEM images of brookite TiO 2 nanorods obtained after hydrothermal treatment with different PVA or PVP concentrations.TEM images without a polymer (Fig. 2(c)) showed a rod-like shape with an aspect ratio of 2.7 and single crystalline quality of the brookite TiO 2 nanorod. The aspect ratio of brookite TiO 2 nanorods was decreased by addition of PVA or PVP.The effect of aspect ratio control for a brookite TiO 2 nanorod by addition of PVA was greater than that by addition of PVP as shown in Fig. 2(a-b).These results indicate that addition of 50 mg of PVA was sufficient to prepare brookite TiO 2 particles with a small aspect ratio (Fig. S1).The aspect ratio of a brookite TiO 2 nanorod with specific exposed crystal faces is sensitive to photocatalytic activity for CO 2 reduction, as discussed in a later section.The ratio of exposed reduction sites to oxidation sites on the surface of a brookite TiO 2 nanorod should be controlled in order to improve CO 2 reduction.Under the optimized conditions, reduction sites on the surface of a brookite TiO 2 nanorod should be predominantly exposed. In order to determine reactivity such as oxidation or reduction on the exposed crystal surface of brookite TiO 2 , photodeposition of Pt and PbO 2 was carried out.The colors of TiO 2 powder after UV irradiation in the presence of H 2 PtCl 6 and Pb(NO 3 ) 2 aqueous solutions changed to gray and brown, respectively 58.These color change in brookite TiO 2 suggested that Pt and PbO 2 were deposited on the TiO 2 surface.Furthermore, the presence of Pt and Pb elements was confirmed by XPS analysis.Pt particles were efficiently deposited on the exposed crystal surface assigned to reduction site because of Pt 4 reduction.The oxidation site of exposed crystal surface was assigned to PbO 2 deposition because Pb 4 was oxidized to produce PbO 2 nanoparticles.Fig. 4 shows TEM images of Ptand PbO 2 -deposited brookite TiO 2 nanorods that were prepared by 48 h of hydrothermal treatment with PTA solution containing glycolic acid without a polymer.Small particles were observed on the specific exposed face of the brookite TiO 2 nanorod.Small particles were assigned by TEM with EDX analysis to Pt or PbO 2 deposited on the reductive or oxidative crystal surface of the brookite TiO 2 nanorod (Fig. 4).Pt nanoparticles of ca. 10 nm in size were mainly observed on the 2 1 0 face of a brookite TiO 2 nanorod, while large PbO 2 particles with sizes of more than 100 nm were deposited on the 2 1 2 face of a brookite TiO 2 nanorod.These smaller particles were not observed on TiO 2 particles before the photodeposition procedure (Fig. 4). As described in a later section, a correlation was found between photocatalytic activity and surface structure of TiO 2 particles, and photocatalytic activity increased with increase in the aspect ratio of brookite TiO 2 nanorods, which indicate the ratio of 2 1 0 to 2 1 2 exposed crystal faces.This result suggests that brookite TiO 2 nanorods with a small surface area of 2 1 2 and large surface area of 2 1 0 are suitable for photocatalytic CO 2 reduction.The highest photocatalytic activity of a brookite TiO 2 nanorod prepared by 48 h of hydrothermal treatment in the absence of a polymer was mainly due to the larger surface areas of reduction sites on the nanorod TiO 2 structure with the largest aspect ratio. In this study, amounts of the gas phase products are a trace (under the detection limit of Gas chromatography) over photoirradiation of co-catalyst loaded brookite TiO 2 .When bare brookite TiO 2 was used, amounts of H 2 , CO, CH 4 products are about 8, 3, 0 nmol, respectively.And amount of HCOOH is 35 nmol under ionic chromatography.Eventually, CH 3 OH is a main product for the CO 2 reduction by using prepared brookite TiO 2 photocatalysts without co-catalyst.Photocatalytic reductions of CO 2 in our systems were performed in an aqueous suspension of prepared brookite TiO 2 at pH 7.3.Under the condition, the ionic forms of CO 2 in aqueous media should be a mixture of HCO 3 -, H 2 CO 3 .Redox potentials of CO 3 2-, H 2 CO 3 are 0.209,0.044 V vs NHE for methanol formation from CO 2 reduction, respectively 59.In addition, redox potentials of HCO 3 -might be placed between 0.209 and 0.044 V vs NHE.Fig. 5 shows CH 3 OH generation for the prepared brookite TiO 2 nanorod and commercial brookite TiO 2 , which are non shapecontrolled particles with S BET of 27 m 2 g -1 .CH 3 OH production by the prepared brookite TiO 2 nanorod was 2-times greater than that by spherical shaped commercial brookite TiO 2 .This result indicated that a shape-controlled brookite TiO 2 nanorod with exposed crystal phases has higher activity for CO 2 reduction than non shape-controlled commercial brookite TiO 2 , presumably due to separation of oxidation and reduction sites.Moreover, larger 2 1 0 and smaller 2 1 2 exposed crystal faces may be an ideal surface structure for a multi-electron process for CO 2 reduction. Fig. 5. Amount of CH3OH generated over several kinds of brookite TiO2 (commercial brookite TiO2, the prepared brookite TiO2 with PVA, PVP and without polymer. As described above, the aspect ratio of a brookite nanorod was decreased by addition of PVA or PVP as an aspect control reagent to the reaction solution during hydrothermal treatment.Aspect ratio dependence of the photocatalytic activity of a brookite TiO 2 nanorod with exposed crystal surfaces for CO 2 reduction was observed.The photocatalytic activity of a brookite TiO 2 nanorod for CO 2 reduction was decreased when the aspect ratio of the brookite TiO 2 nanorod became lower by using PVA or PVP as an aspect ratio control reagent.Enlargement of 2 1 0 assigned to reduction sites is an important strategy for improvement of photocatalytic CO 2 reduction over a brookite TiO 2 nanorod under UV light. For further improvement of photocatalytic activity for CO 2 reduction, Au or Ag particles as co-catalysts were loaded on the prepared brookite TiO 2 nanorod by the photodeposition method.It was expected that the co-catalysts would be deposited on 2 1 0 exposed crystal faces of the prepared brookite TiO 2 nanorod because reduction reaction (Au 3 3e - Au 0 , Ag e - Ag 0 ) predominantly proceeds over 2 1 0 faces of a brookite TiO 2 nanorod.Actually, loaded co-catalyst particles were observed mainly on 2 1 0 exposed crystal faces of the samples with larger amounts of Au and Ag loading as shown in Fig. 6. After photodeposition, the color of the samples changed depending on the kind of loading material and loading amount.The colors of Au-loaded and Ag-loaded samples immediately after photodeposition were dark purple and pale henna, respectively.The colors of the samples correspond to localized surface plasmon resonance (LSPR) absorption of Au and Ag 60616263, and this implies that some of the Au and Ag particles were present as a metal state.However, the color of Ag-loaded samples changed after pre-treatment for photocatalytic activity (UV irradiation for removal of organic compounds on the sample), indicating that aggregation of Ag nanoparticles or oxidation of Ag to generate Ag 2 O might have occurred 34.Fig. 7 shows DR spectra of the prepared brookite TiO 2 nanorod with Au or Ag loading just before photocatalytic evaluation.Absorption peaks around 550 nm and 500 nm, which correspond to LSPR of Au and Ag on TiO 2 , were observed in Au-loaded and Ag-loaded TiO 2 samples, respectively 606162.This implies that some of the Au and Ag particles were presumably present as a metal state after the pre-treatment for photocatalytic activity.Actually, XPS measurements were carried out on the Auloaded and Ag-loaded TiO 2 samples (Fig. S2).XPS spectra showed that loaded Ag particles were present as a mixture of Ag and Ag 2 O.In contrast, the XPS spectrum confirmed that loaded Au particles were present as metal without other oxidation states.This coincides with the unchanged color of Au-loaded samples after the pre-treatment for photocatalytic activity. Fig. 8 shows CH 3 OH generation of the prepared brookite TiO 2 nanorod with Au or Ag loading.CH 3 OH generation showed an optimum amount with co-catalyst loading in all cases.In photocatalytic reaction systems, CO 2 reduction usually competes with H 2 evolution as a result of H reduction.For instance, H 2 evolution predominantly occurs over Pt-loaded TiO 2 particles.On the other hand, Ag loading on the surface of a brookite TiO 2 nanorod induces predominant CO 2 reduction.Therefore, loading an optimum amount of a co-catalyst on the surface of brookite TiO 2 improves the selectivity between CO 2 reduction and H 2 evolution as well as the photocatalytic activity for CO 2 reduction.Although the key mechanism for highly selective CO 2 reduction on co-catalyst-loaded brookite TiO 2 is under investigation, preferential CO 2 adsorption on a co-catalyst loaded on the surface of TiO 2 particles might be one of the key steps for improving predominant CO 2 reduction. Increase in CH 3 OH generation on brookite TiO 2 loaded with a co-catalyst was presumably due to prevention of recombination and/or enhancement of selectivity for CH 3 OH generation as a result of multi-electron reduction by electron capturing on metal particles.This effect was probably influenced by properties of co-catalyst particles, e.g., loading site, amount, particle size and dispersibility.Decrease in CH 3 OH generation with an excess amount of the co-catalyst may be due to the filter effect caused by photoabsorption and/or light scattering of co-catalyst particles.Actually, relative reflectance of the samples in the wavelength of more than 400 nm increased with an increase in loading amount (Fig. 8).Moreover, excess amount of co-catalyst loading may result in covering active sites or absorption sites of reactants and loss of appropriate properties as co-catalyst particles, such as dispersibility and particle size. In order to elucidate the influence of particle size on CH 3 OH generation, absorption peaks attributed to LSPR of Au and Ag particles were evaluated in UV-VIS spectra (Fig. 8).Fig. 8 shows absorption wavelength of the peak ( p ) attributed to LSPR of Au and Ag as a function of amount of co-catalyst loading.A red shift of LSPR peak was usually observed by particle size growing and aggregation state of metal particles 636465. The peaks of Au-loaded samples showed dependence on loading amount up to 0.1 wt.This indicates that the decrease in CH 3 OH generation by the 0.1 wt Au-loaded sample was mainly caused by an increase in particle size and decrease in dispersion of Au particles.In contrast, the peaks of Ag-loaded samples were only slightly red-shifted with an increase in loading amount.This indicates that decrease in CH 3 OH generation with a larger amount of Ag loading might be due to the filter effect. Therefore, CH 3 OH generation of the Au-loaded brookite TiO 2 nanorod was influenced by particle size and/or aggregation state in addition to the effect observed in the Ag-loaded sample. We applied 1 H-NMR spectroscopy for analyzing the carbon source of CH 3 OH.Labeling experiment by using 13 CO 2 for CO 2 reduction was taken place over Au loaded brookite TiO 2 nanorod for 24 h under UV light irradiation.Before evaluation of the photocatalytic activity, each sample was irradiated with UV light using black light (UVP, XX-15BLB) for one day in order to remove organic compounds on the sample. 1 O 2 (15 mM) treatment of the photocatalysts was performed for 2 h by using 1 O 2 generator (EKBIO-1100, Ebara Jitsugyo Co. Ltd) just before photocatalytic reduction of CO 2 experiments.Degas and purge 13 CO 2 processes were shown in Fig. 9. Photocatalysts powder 5 mg were ultrasonically dispersed in deionized water (5 mL).After complete degassing the whole system by diaphragm pump (Process 1), 13 CO 2 gas was bubbling for 15 min (Process 2).CO 2 photoreduction is performed for 24 h during UV irradiation (Process 3).After the reaction, the photocatalysts was removed by centrifugal separation.The aqueous samples (4 ml) for 1 H-NMR are dissolved in D 2 O (1 ml).3-(Trimethylsilyl)-1propanesulfonic acid sodium salt (SIGMA-ALDRICH) was used as an internal standard compound.In the 1 H-NMR of the same solution, a doublet (J CH 142 Hz) attributable to the proton coupled to the 13 C of 13 CH 3 O -was observed at 3.34 ppm, but no singlet due to the proton of 12 CH 3 O -was detected (Fig. 10).These results clearly show that the carbon source of CH 3 OH is 13 CO 2 ."}, {"title": "Conclusions", "content": "Brookite TiO 2 particles with specific exposed crystal faces were prepared by hydrothermal treatment.In addition, PVP or PVA was used as an aspect control reagent.The aspect ratio of the prepared brookite TiO 2 nanorod was controlled by addition of PVA or PVP. Photocatalytic CO 2 reduction using brookite TiO 2 nanorods with large 2 1 0 and small 2 1 2 exposed crystal faces were carried out.CH 3 OH was obtained as the main product for CO 2 reduction over a brookite TiO 2 nanorod under UV light.Photocatalytic activity of a brookite TiO 2 nanorod for CO 2 reduction is higher than that of spherical-shaped commercial brookite TiO 2 .In addition, a brookite TiO 2 nanorod with larger aspect ratio showed higher photocatalytic activity than that with a smaller aspect ratio.This indicates that larger 2 1 0 and smaller 2 1 2 exposed crystal faces prevented back reaction and enhanced multi-electron reduction as a result of separation of redox sites.Au or Ag loading on the reduction crystal surface of the prepared brookite TiO 2 nanorod increased CH 3 OH generation.The mechanisms of activity enhancement by the loading of metals might be different.Au loading increased selectivity for CH 3 OH generation to some extent.On the other hand, loading of Ag with appropriate properties resulted in a larger increase in CH 3 OH generation than that in the case of Au, though Ag has no selectivity for CH 3 OH generation.The carbon source of CH 3 OH, which is the main product of CO 2 reduction over a brookite TiO 2 nanorod, was confirmed by a labeling experiment using 13 CO 2 . QE Number of reacted electrons Number of incident photoos Number of generated CH 3 OH molecules 6 Number of incident photons 100 2.7.Reactivity evaluation of exposed crystal faces by photodeposition of Pt and lead(IV) oxide (PbO 2 ) on brookite TiO 2 nanorods Fig. 1.XRD pattern. Fig. 2. TEM images of brookite TiO2 nanorod (a) with PVA (b) with PVP and (c) without polymer. Fig. 3. SEM images of the prepared brookite TiO2 nanorod (a) with PVA (b) with PVP and (c) without polymer. Fig. 4. TEM images and EDX analyses of Pt or PbO2 loaded brookite TiO2 nanorods (a) Pt (b) PbO2. Fig. 6.TEM images of brookite TiO2 nanorods (a) bare sample and (b) Au loaded brookite TiO2 and (c) Ag loaded brookite TiO2. Fig. 7. DR spectra of metal co-catalysts loaded brookite TiO2 nanorods (a) Au and (b) Ag. Fig. 8. Amount of CH3OH generated over the metal co-catalysts loaded brookite TiO2 nanorods as a function of amount of co-catalysts (a) Au (b) Ag. Fig. 9. Process of experiments reduction of CO2 using 13 CO2. Fig. 10. 1 H-NMR spectra of Au-loaded brookite TiO2 nanorod. This work was supported by the JST PRESTO program and the JST ACT-C program. Supplementary data associated with this article can be found, in the online version, at http://dx.doi.org/10.1016/j.apcatb.2014.01.048."}]