[{"title": "Doi", "content": "10.1016/j.renene.2019.07.105"}, {"title": "Article_Title", "content": "Carbonaceous supports decorated with Pt–TiO2 nanoparticles using electrostatic self-assembly method as a highly visible-light active photocatalyst for CO2 photoreduction"}, {"title": "Abstract", "content": "Supported PteTiO2 photocatalysts on carbonaceous supports were synthesized by the electrostatic selfassembly method to study CO2 photoreduction to produce CH4.Catalytic activities of the prepared photocatalysts were correlated with the particle size and dispersion of the active metal, which in turn depended on the type of carbonaceous support used, varying in the order of multi-walled carbon nanotubes (MWCNT) Single-walled carbon nanotubes (SWCNT) reduced graphene oxide activated carbon.Generally, all catalysts were highly photoresistant with less than 5 loss of activity in terms of CH4 yield.PteTiO2/multi-walled carbon nanotubes exhibited better catalytic activity compared with other samples and resulted in the highest yield of CH4 (1.9 mmol g Cat A1 h A1 )."}, {"title": "Experimental", "content": "SWCNT, MWCNT, activated carbon (AC), graphite powder, Poly (allylamine hydrochloride) average MW of 56000, ethylene glycol (EG), Hexachloroplatinic acid (H 2 PtCl 6 6H 2 O) and Anatase TiO 2 were purchased from SigmaeAldrich.Reduced graphene oxide (rGO) were synthesized from graphite powder by a modified Hummers' method 31,32. Carbonaceous supports were first functionalized with Poly (allylamine hydrochloride) (PAH) in NaBH 4 .Afterwards, Pt precursor (H 2 PtCl 6 ) was adsorbed on the surface of the functionalized supports by the electrostatic interactions between the positively charged PAH functional groups and negatively charged PtCl 6 2A ions. Finally, PtCl 6 2A ions were reduced in presence of the ethylene glycol leading to deposition of Pt nanoparticles on the support surface.The details of the synthesis process are explained below. The C-PAH (C14SWCNT, MWCNT, AC and rGO) was prepared by simultaneous sonication and vigorous stirring of mixture of the 300 mg carbonaceous material and 500 ml aqueous solution of 0.5 wt PAH at 70 C. 25 ml of 1M NaBH 4 solution was subsequently added and the solution was stirred for 24 h.Finally, C-PAH was collected using a centrifuge, washed with deionized water to remove excess PAH, and dried at 90 C in vacuum for 3 h.Surface amine functional groups of PAH were generated through this step. Typically, 1980 mg of C-PAH and 79 mg of TiO 2 were added to a solution of 0.1 mmol H 2 PtCl 6 in EG. 1 M NaOH solution in EG was used to keep the solution pH above 12.At high pH conditions, oxidization of EG resulted in glycolate anions release which strongly stabilize Pt nanoparticles 33,34.After 1 h of stirring, solution reflux conditions were established at 130 C for 4 h.Once cooled down, the solution pH was decreased and kept at lower than 3 by adding HNO 3 solution.After 48 h of stirring, the resulting material was washed with deionized water for complete removal of Cl ions and subsequently dried under vacuum at 90 C for 24 h. Typically, 3 g of C-PAH was dispersed in 30 ml of deionized water by sonication.Afterwards, 1 g of TiO 2 was sonicated in 20 ml of 1 M solution of HCL and was slowly added into the C-PAH suspension during 10 min of vigorous stirring.Subsequently, stirring was slowed down and the mixture was stirred for 48 h.Finally, the resulting material was collected by a centrifuge and washed with ethanol and deionized water, and dried under vacuum at 90 C for 24 h. 5 wt Pt/TiO 2 sample was prepared by photodeposition method.Typically, 2.5 ml of 8 wt aqueous solution of H 2 PtCl 6 was added to 100 ml of deionized water followed by N 2 gas bubbling for 15 min.Subsequently, 2 g of TiO 2 and 50 ml of methanol was added under vigorous stirring and irradiation of 300 W Xe lamp for 2 h.After photodeposition of Pt on TiO 2 , the light grayish suspension was centrifuged and Pt/TiO 2 was collected and washed with methanol and deionized water for several times and subsequently dried under vacuum at 90 C for 24 h. A Zeiss EM900 transmission electron microscope (TEM) with accelerating voltage of 80 keV was used to obtain TEM micrographs.TEM images were analyzed by the Digital Micrograph software package (Gatan Inc.) using at least 100 particles imaged for each sample to determine the average diameter.A Zen 3600 Zetasizer (Malvern Instruments) was used to measure the zeta potentials.Xray diffraction (XRD) patterns were obtained by a PW3040/60 X'Pert PRO MPD (PANalytical) diffractometer using a Cu Ka radiation source (l 14 1.5406 A) operating at 40 kV and 40 mA.A continuous mode was used for data collection in 2q range of 20 to 100 at a scanning speed of 10 per minute.Brunauer-Emmett-Teller (BET) surface areas were evaluated by N 2 adsorptiondesorption isotherms at A196 C using a Belsorp mini II apparatus.Prior to analysis, samples were de-gassed at 120 C for 15 h.Ultra violet-visible (UVevis) diffuse reflectance spectra (DRS) spectra were obtained in the wavelength range of 200e800 nm at ambient temperature using an Agilent Cary 100 UVevis spectrophotometer The Kubelka-Munk function F(R) was used to determine the band gap energies of the photocatalysts, i.e. the plot of F(R)hn 0.5 versus hn (Tauc plot) was extrapolated. CO2 photoreduction experiments were performed in a continuous gas-phase fixed-bed photoreactor setup at 1 bar and 25 C. First, 100 mg of catalyst powder was placed in the quartz reactor.Afterwards, high-purity (99.99)CO2 gas was bubbled through a water bubbler to produce a mixture of CO2 and a sacrificial reagent (water vapor).Prior to irradiation, CO2 was purged into the reactor (50 ml min A1 for 1 h) in order to guarantee the complete elimination of air from reactor system while ensuring the complete adsorption of CO2 molecules on the surface of the catalyst.Subsequently, CO2 flow rate was set to 50 ml min A1 .The visible light irradiation source was a 15 W energy-saving daylight lamp (Philips) that was turned on for 12 h.The light intensity was measured by a pyranometer (Kipp and Zonen type CMP 6).The average intensity of the light was measured to be 8.5 mW cm A2 and the distance between light source and photoreactor in all cases was fixed to 5 cm.The product gas was swept by He as a carrier gas for online gas analysis.A Varian CP-3800 gas chromatograph equipped with a Hayesep Q and a Molecular Sieve column was used for product gas analysis using thermal conductivity (TCD) and flame ionization FID detectors. In order to ensure the sole formation of CH4 from CO 2 photocatalytic reduction with water vapor under visible light irradiation, control experiments were carried out under conditions of eliminating (a) visible light irradiation, (b) photocatalyst, (c) CO2 (substituting N2 for CO2) and (d) water vapor.For all control experiments, there was no evidence of CH4 formation.The following definition for CH 4 yield was used to compare the performance of the photocatalysts: CH 4 yield 14 Molar flow rate of CH 4 produced Amount of photocatalyst used A 100 The reported data are mean value of 3 experiments with error bars indicating one standard deviation."}, {"title": "Results_and_discussion", "content": "TEM images and PteTiO 2 particle size distributions are presented in Fig. 1.All nanoparticles on PAH-functionalized carbon supports are in truncated cubic form with highly uniform dispersion as well as narrow particle size distribution due to the electrostatic interaction between PtCl 6 2A and surface of the carbonaceous material.Thus, nanoparticles had smaller particle size compared with those reported for Pt/C catalysts prepared by other methods 35e39.Moreover, the particle size depended on the type of carbonaceous material used as catalyst support. Dependence of the particle size on type of carbonaceous material is correlated with the relative strength of interaction between carbonaceous material and PteTiO 2 particles which in turn is related to the value of the zeta potential of the involved materials.The more positively charged support particles are more likely to interact with the less positively charged PteTiO 2 particles which results in better dispersion and consequent smaller particle size 40.Table 1 shows zeta potential values measured for the solution of PAH-functionalized carbonaceous materials. Particles supported on MWCNT (with the most positive zeta potential of 50 mV) and AC (with the least positive zeta potential of 19 mV) were smallest (1.35 nm) and largest (4.38 nm), respectively.Results are in agreement with those obtained from XRD characterization tests with average particle sizes slightly greater than those calculated from XRD patterns. XRD patterns of catalysts and corresponding pure supports are shown in Fig. 2. Compared with the pure supports, Pt containing samples had four additional peaks.Dashed lines at 2q 14 39, 46, 67, and 81 correspond to planes with (1 1 1), (2 0 0), (2 2 0) and (3 1 1) miller indices, respectively, and are consistent with face-centered cubic phase Pt 0 ICDD card No. 04e0802.The peak observed at the dotted line at 2q 14 26 corresponds to TiO 2 . BET surface area and pore volume of catalysts and pure supports are reported in Table 2.There was only a slight or no decrease observed in the BET surface area of PteTiO2 loaded samples compared with pure supports.No significant decrease was also observed in the pore volume of catalysts compared to the pure supports.PteTiO2/AC had the highest BET surface area and pore volume. N 2 adsorption-desorption isotherms of all samples are presented in Fig. 3.According to the IUPAC classification, all isotherms showed a type IV pattern with a hysteresis loop of type H3 which is the characteristic of mesoporous materials with slit-shaped pores. The pore size distributions of all samples from Barrett-Joyner-Halenda BJH analysis indicated that MWCNT, SWCNT and AC samples exhibited mesopores ranging from 2 to 8 nm, while the rGO sample showed the multi-scale pores located in the range of 2e22 nm. UVevis DRS of samples in the wavelength range of 200e800 nm are shown in Fig. 4(A) in order to determine the optical properties of the prepared samples.TiO2 had no absorption above its sharp absorption edge of 388 nm since it is not photocatalytically active in the visible region (400e800 nm).A slight red shift of this peak towards the visible light region was observed for PteTiO2/rGO and PteTiO2/AC samples while PteTiO2/MWCNT and PteTiO2/SWCNT samples showed significant red shift towards the visible light region as well as visible light absorbance at a great intensity in the visible region.A red shift in absorption edge of PteTiO2/C samples is attributed to narrowing of band gap which in turn is ascribed to the chemical bond formation between carbonaceous material and TiO2 9 and a consequent modification of electronehole formation with visible light irradiation 41.The carbon-based composites are known to be able to promote a rapid photoinduced charge separation as well as a slow charge recombination since they could accept photogenerated electrons from TiO2 42.The stronger absorption in the visible region could also be related to the surface plasmon resonance due to Pt 43,44 or low-energy transitions (at longer wavelengths) between the valence band of TiO2 and localized energy levels introduced to the bandgap of TiO2 (below the conduction band) by Pt 17,45,46.In the case of PteTiO2/AC, absorption decreases with increasing the wavelength.A similar phenomena was observed and reported elsewhere 47,48. In order to evaluate the band gaps, modified Kubelka-Munk function was employed Fig.4(B) and Table 3.All absorption band gaps are smaller than that of TiO2 which confirms a red shift in the absorption edge of composites as compared with anatase TiO2 in Fig. 4. A mixed energy level is formed between the valence band and the conduction band due to chemical bonding formed between materials.This will result in the promotion of the visible light absorption and consequently in the improvement of the photocatalytic performance that would be further confirmed by conducting CO 2 photocatalytic reduction in the presence of the prepared composites. The CO 2 photocatalytic reduction was carried out in a continuous gas phase photoreactor under visible light irradiation.Photocatalytic performances were evaluated based on the yield of CH4, the only product gas that was formed.As reported in Fig. 5(A), CH4 was first detected 0.5 h after the start of the irradiation and progressively reached its maximum value after 2 h of reaction.In comparison with the anatase TiO2, the photocatalytic activity of the composites were significantly higher and varying in the order of PteTiO2/MWCNT PteTiO2/SWCNT PteTiO2/rGO PteTiO2/AC.Higher photocatalytic activity of the composites could be attributed to their lower band gaps with respect to that of anatase TiO2 that would enable them to absorb visible light.Moreover, synergistic effect of addition of Pt and carbonaceous material resulted in extension of the life time of charge carriers that would enhance the photocatalytic activity of the composites.In addition, the composites were photostable since after 12 h of reaction, the yield of CH4 decreased by less than 5 of its value after 2 h of reaction when it had reached its maximum. The total CH4 yield over 12 h of reaction is presented in Fig. 5(B).The highest and the lowest CH4 yields were observed for PteTiO2/ MWCNT and PteTiO2/AC, respectively.There was a strong correlation between the PteTiO2 particle size and the photoactivity of the catalysts with smaller particles having improved photocatalytic performance. For comparison, a summary of investigations published in the open literature that have reported the CO2 photoreduction under similar reaction conditions using composites of carbon, TiO2 and Pt is presented in Table 4. TiO2 employed in this study had a similar CH4 yield as compared with other investigations 17,49.PteTiO2/ MWCNT had the highest yield of 1.9 mmol g Cat A1 h A1 among all reported photocatalysts that was at least 3 times higher than those reported for composites of MWCNT and TiO2 in the absence of Pt 22,50.CH4 yield for PteTiO2/rGO was approximately 2 and 3.5 times higher than those for the same reported composite 17 and rGO/TiO2 composite 9, respectively. Moreover, Pt/TiO 2 and TiO 2 /C samples were investigated for their photocatalytic performance in order to verify the aforementioned conclusions (Table 4).Pt/TiO 2 with apt particle size of 21 nm shows the second least yield of 0.06 mmol g Cat A1 h A1 among all reported photocatalysts in this study.In addition, reported yields for TiO 2 /C samples are 30e90 lower than that of PteTiO 2 /C samples which showed that the enhancement of the photocatalytic activity was not only ascribed to the existence of carbonaceous material.These results are in a good agreement with those reported in literature 9,22,50."}, {"title": "Conclusions", "content": "PteTiO2 photocatalysts supported on different carbonaceous material (MWCNT, SWCNT, rGO and AC) were prepared by the electrostatic self-assembly method and were used in CO2 photoreduction under visible-light irradiation for CH4 production.The activities of the photocatalysts were in the order of MWCNT SWCNT rGO activated carbon with the highest yield of CH4 (1.9 mmol g Cat A1 h A1 ) observed for PteTiO2/MWCNT catalyst. Composites are highly photostable with the loss of less than 5 of their activity in terms of CH4 yield after 12 h of reaction. Fig. 1.TEM images and corresponding particle size distributions. Fig. 2. XRD patterns of catalysts and corresponding pure supports. Fig. 3. N 2 -physisorption isotherms and corresponding pore size distributions. Fig. 4. (A) UVevis DRS spectra of catalysts and (B) corresponding Tauc plot. Fig. 5. (A) CH4 formation rate on different photocatalysts under visible light irradiation and (B) Total CH4 formation on different photocatalysts for 12 h of reaction under visible light irradiation. Zeta potential values of PAH-functionalized carbonaceous materials. Textural properties of catalysts measured by XRD and BET analyses. CatalystBET surface area (m 2 g A1 ) Pore volume (cm 3 g A1 ) Average crystallite sizes (nm) Effects of loading Pt and carbonaceous materials on TiO2 band-gap extension. Summary of CO2 photoreduction employing Carbon/TiO2 photocatalysts."}]