[{"title": "Doi", "content": "10.1016/j.apsusc.2017.01.171"}, {"title": "Article_Title", "content": "Facile synthesis of MoS2/Bi2WO6 nanocomposites for enhanced CO2 photoreduction activity under visible light irradiation"}, {"title": "Abstract", "content": "A novel composite material, MoS 2 /Bi 2 WO 6 , has been fabricated via a facile two-step approach.The few layered MoS 2 as a cocatalyst has intimate interactions with the hierarchical flower-like Bi 2 WO 6 microspheres, which boosts the visible light harvesting and charge transferring, and promotes the separation of electron-hole pairs, thus leading to the superior photocatalytic activity.It was found that the as-synthesized MoS 2 /Bi 2 WO 6 nanocomposites exhibited significantly enhanced performance for the photoreduction of CO 2 into hydrocarbons, i.e. methanol and ethanol, as compared with pure Bi 2 WO 6 .The yields of methanol and ethanol obtained over the composite with optimal content of MoS 2 (0.4 wt) were 36.7 and 36.6 mol gcat -1 after 4 h of visible light irradiation, respectively, which were 1.94 times higher than that over pure Bi 2 WO 6 .Furthermore, the mechanism of CO 2 photoreduction was also investigated.It indicates that the CO 3 2-, HCO 3 -and H 2 CO 3 generated in CO 2 aqueous solution would be the reactive substrates during the photoreduction reaction, proving the thermodynamic feasibility of CO 2 photoreduction.This work demonstrated that MoS 2 is a very promising candidate for development of highly active photocatalysts, and supplied a facile and simple strategy for designing environmentally benign, cheap non-noble metal, and highly efficient semiconductor composites."}, {"title": "Experimental", "content": "All reagents were analytical grade and used as purchased, without further purification.(NH 4 ) 2 MoS 4 was prepared according to the literature 29. Hierarchical flower-like Bi 2 WO 6 microspheres were synthesized by a simple hydrothermal process.In a typical procedure, 2 mmol Bi(NO 3 ) 3 5H 2 O was dissolved in 5 mL glacial acetic acid, and the solution was stirred for 20 min.A white colloidal suspension formed when 30 mL 0.042 mol L -1 Na 2 WO 4 aqueous solution was dropwise added into the above solution.After being stirred for another 2 h, the suspension was transferred into a 50 mL Teflon-lined autoclave, and maintained at 180 Bi 2 WO 6 (1.0 g) was added into 5 mL ethanol solution containing designated amount of (NH 4 ) 2 MoS 4 .The above suspension was stirred at room temperature for several hours to remove the ethanol.The obtained (NH 4 ) 2 MoS 4 /Bi 2 WO 6 precursor was calcined at 673 K for 2 h in an Ar atmosphere to form the MoS 2 /Bi 2 WO 6 nanocomposites.The samples with different theoretical loading amount of MoS 2 , i.e. 0.2, 0.3, 0.4 and 0.5, were denoted as 2MB, 3MB, 4MB and 5MB, respectively.Moreover, pure MoS 2 was prepared through the calcination of pure (NH 4 ) 2 MoS 4 at 673 K for 2 h under the Ar atmosphere. Powder X-ray diffraction (XRD) patterns were obtained on a Bruker AXS-D8 Advance X-ray diffractometer with Cu K radiation in the 2A range of 10-70 .The morphologies and microstructures of the samples were observed by means of the field emission scanning electron microscopy (FESEM, Nova NanoSEM 450) and high-resolution transmission electron microscopy (HRTEM, JEOL JEM-2100).The UV-vis diffuse reflectance spectra (DRS) were recorded at room temperature on a Hitachi U-3900H instrument with an integrating sphere attachment using BaSO 4 as the reference in the wavelength range of 300-800 nm.X-ray photoelectron spectroscopy (XPS) was conducted using a Kratos Axis Ultra DLD (delay line detector) spectrometer with an Al K radiation line source.All the binding energies for the high-resolution spectra were calibrated by setting C 1s to 284.6 eV.The photoluminescence (PL) spectra were measured using a Hitachi F4500 fluorescence spectrophotometer with an excitation wavelength of 300 nm at room temperature. Electrochemical measurements were carried out on a CHI 660D electrochemical workstation (Chenhua Instrument Co., Shanghai) with a standard three-electrode system.Fluorine-doped tin oxide (FTO) deposited with the as-prepared samples served as a working electrode with an active area of catalyst 1.0 cm 2 , while the counter and the reference electrodes were graphite and saturated calomel electrode respectively.The Mott-Schottky measurement was performed at fixed frequency of 1000 Hz with 5 mV amplitude and photocurrents measurements was performed at a 300 W Xe lamp equipped with an ultraviolet cut off filter ( 420 nm) served as the visible light source.A 0.5 M Na 2 SO 4 aqueous solution was used as the electrolyte.The electrochemical impedance spectroscopies (EIS) were recorded in the frequency range of 100 kHz-0.01Hz, and the applied bias voltage and ac amplitude were set at open-circuit voltage. The photocatalytic reduction of CO 2 was operated in a 200 mL quartz glass reactor at 4 C and atmospheric pressure, similar to our previously reported procedures 30,31.Typically, 50 mg catalyst was suspended into 50 mL deionized water under magnetic stirring, and high purity CO 2 gas (99.995) was continuously bubbled through the solution at the rate of 50 mL min -1 .A 300 W Xe arc lamp (PLS-SXE300) equipped with an ultraviolet cutoff filter ( 420 nm) was positioned 5 cm above from the reactor as a light resource.Prior to irradiation, CO 2 gas was bubbled into above solution for 30 min to expel dissolved oxygen in the reaction system.After turning on the lamp, 2 mL of suspension was sampled at certain time intervals and centrifuged to remove the photocatalyst particles.The products were qualitatively analyzed by an Agilent Technologies 7890A gas chromatograph (FID detector, DB-WAX column) through observing and comparing the chromatographic peaks with those for the authentic methanol standard and ethanol standard."}, {"title": "Results_and_discussion", "content": "The crystal structure and phase composition of the as-prepared samples were investigated by XRD as shown in Fig. 1.The XRD pattern of pure Bi 2 WO 6 (Fig. 1a) indicates that all the peaks are readily indexed to the well-crystallized orthorhombic phase of Bi 2 WO 6 according to the JCPDS card no.39-0256 with the cell constants of a 5.457 A, b 16.435A, c 5.438 A.The main diffraction peaks at 2A of 28.3 , 32.8 , 47.0 , 55.9 , 58.5 and 68.7 , correspond to the indices of ( 131), ( 200), ( 260), ( 133), ( 262) and (400) planes, respectively.No impurity peaks are found.As for the pure MoS 2 (Fig. 1a), four weak and broad diffraction peaks at 14.4 , 32.7 , 39.5 and 58.3 can be detected, which are assigned to the (002), ( 100), ( 103) and (110) planes in the hexagonal phase of MoS 2 (JCPDS 37-1492; a 3.161 A, b 3.161 A, c 12.299 A), respectively.While loading MoS 2 on the Bi 2 WO 6 surface, the formed MoS 2 /Bi 2 WO 6 nanocomposites (2MB, 3MB, 4MB and 5MB) show similar diffraction patterns to that of pure Bi 2 WO 6 (Fig. 1b), indicating that the introduction of MoS 2 did not have a notable influence on the crystalline structure of Bi 2 WO 6 .Nevertheless, the diffraction peaks assigned to MoS 2 were not observed, probably due to the low content, relatively weak diffraction intensity, and the high dispersion of MoS 2 nanosheets. The morphology and microstructure of pure Bi 2 WO 6 and MoS 2 /Bi 2 WO 6 nanocomposite (4MB) were observed by SEM and TEM.The SEM images reveal that both pure Bi 2 WO 6 (Fig. 2a and b) and 4MB (Fig. 2c andd) were composed of uniformly dispersed hierarchical flower-like microspheres with dimension in the range of 2-5 m assembled by intercrossed nanosheets.There were no differences in morphology and size can be observed, indicating that the crystal structure of Bi 2 WO 6 was not significantly changed after the incorporation of MoS 2 .The microstructures of the as-prepared nanocomposite (4MB) were further analyzed using TEM.As shown in Fig. 3a, the 4MB shows a microsphere architecture composed of large nanosheets, which agrees well with that revealed by the SEM observation in Fig. 2d.From the HRTEM image (Fig. 3b), two phases of Bi 2 WO 6 and MoS 2 are clearly observed and closely contact to form an intimate interface.Furthermore, it is found that there are two sets of fine lattice fringes with interplanar spacing of 0.62 nm and 0.315 nm, corresponding to the (002) plane of MoS 2 and the (131) plane of Bi 2 WO 6 respectively, which are also in accordance with the XRD results in Fig. 1.EDS mapping images (Fig. 3c-g) indicate that the 4MB sample contains S, Mo, Bi, W, and O.This finding further confirmed the coexistence of MoS 2 and Bi 2 WO 6 .Additionally, it can be seen that S, Mo, Bi, W, and O were well dispersed in the sample, which indicates that MoS 2 is uniformly dispersed on the surface of Bi 2 WO 6 .Since the interfacial contact between the two ingredients in the composites has a significant influence on the transfer process of the photogenerated charge carriers 32, it could be expected that MoS 2 /Bi 2 WO 6 nanocomposites featuring intimate interfacial contact would favor the transfer and separation of the photogenerated electron-hole pairs, thus contributing to the improvement of photocatalytic activity.Moreover, the results also suggest that the MoS 2 /Bi 2 WO 6 nanocomposites in structure are heterogeneous rather than a physical mixture of the separate phases of MoS 2 and Bi 2 WO 6 . The surface chemical composition of Bi 2 WO 6 , MoS 2 and MoS 2 /Bi 2 WO 6 nanocomposite (4MB), as well as the interaction between Bi 2 WO 6 and MoS 2 were analyzed by XPS (Fig. 4).The survey scan XPS spectra of pure Bi in the composite sample.The C element is ascribed to the residual carbon from the precursor solution and the adventitious carbon from the XPS instrument itself.The high-resolution spectra of the Bi 4f, W 4f, O 1s, Mo 3d, S 2 s and S 2p were also recorded, and are shown in Fig. 4b-f.For pure Bi 2 WO 6 , the Bi 4f peaks at 159.3 and 164.6 eV are attributed to Bi 4f 7/2 and Bi 4f 5/2 of Bi 3 , respectively 6,7,17.While introducing MoS 2 on the Bi 2 WO 6 surface, the peaks of Bi 4f 7/2 and Bi 4f 5/2 in the spectrum of 4MB slightly shift to 159.4 and 164.8 eV, respectively, being 0.1 and 0.2 eV higher than that of Bi 2 WO 6 (Fig. 4b).In the W 4f spectrum of Bi 2 WO 6 (Fig. 4c), the peaks at 35.5 and 37.7 eV are ascribed to W 4f 7/2 and W 4f 5/2 of W 6 6,7,17, respectively, which are 0.2 eV lower than the corresponding peaks in the spectrum of 4MB.Furthermore, in the O 1 s spectra of both Bi 2 WO 6 and 4MB (Fig. 3d), the wide asymmetric peaks can be deconvoluted into three peaks at 530.1 and 530.3 eV, 531.1 and 531.4 eV, as well as 532.8 and 532.9 eV, respectively.Those peaks at three different positions are ascribed to the different chemical environmental of oxygen element in Bi-O, W-O, and surface hydroxyl groups 6, respectively.It can also be seen that the binding energies of Bi-O and W-O in 4MB exhibits a shift compared to that in Bi 2 WO 6 .Similar binding energy shift has also been found in the XPS spectra of Mo 3d, S 2s and 2 p.As shown in Fig. 4e, the Mo 3d spectrum of pure MoS 2 reveals that the peaks at 229.7 and 232.9 eV correspond to Mo 3d 5/2 and Mo 3d 3/2 28,33, respectively, suggesting Mo exists in the chemical states of Mo 4 .After coupling with Bi 2 WO 6 , the corresponding Mo 3d peaks of 4MB shift to 229.4 and 232.6 eV, respectively.Furthermore, there is also distinct shift of S 2 s peaks between the MoS 2 (226.9 eV) and 4MB (226.6 eV).In addition, from Fig. 4f, the peaks at 162.5 and 163.7 eV in the S 2p spectrum of pure MoS 2 are assigned to S 2p 3/2 and S 2p 1/2 28,33, respectively, suggesting the existence of S 2-in MoS 2 .While combining with Bi 2 WO 6 , the peaks of S 2p 3/2 and S 2p 1/2 in the spectrum of 4MB slightly shift to 162.3 and 163.4 eV, respectively, being 0.2 and 0.3 eV lower than that of MoS 2 .Moreover, to further confirm the presence of MoS 2 on the surface of 4MB, the atomic concentration of Mo and S in MoS 2 and 4MB are determined by the peaks area of Mo 3d and S 2s.From the results summarized in Table S1 andS2, it can be seen that the S/Mo molar ratio of MoS 2 and 4MB are 1.95 and 1.69, respectively, which indicates the presence of MoS 2 on 4MB surface.From the XPS results, the shifts of Bi 4f, W 4f, O 1s, Mo 3d, S 2s and 2p binding energies in the spectra of 4MB demonstrate that there is a strong interaction between Bi 2 WO 6 and MoS 2 in the composite, which is in good accordance with the results of the HRTEM.This interaction is essential to transfer carriers and enhance photocatalytic activity. To investigate the optical absorption properties of the assynthesized photocatalysts, UV-vis diffuse reflectance spectra of the pure Bi 2 WO 6 , pure MoS 2 , and MoS 2 /Bi 2 WO 6 nanocomposites were recorded.As shown in Fig. 5a, pure Bi 2 WO 6 exhibits photoabsorption from UV light region to visible light at about 470 nm, due to the intrinsic band-gap transition.Compared with Bi 2 WO 6 , the composites show much stronger absorption within the visible light range, and a red shift appears upon the introduction of MoS 2 , which can be attributed to the small band gap and large absorption coefficient of MoS 2 .For crystalline semiconductors, their optical band gap could be calculated from the absorption spectra using the equation h A(h -E g ) n/2 34,35, in which , h, , and E g are the absorption coefficient, light frequency, the proportionality constant, and band gap, respectively.Among them, n depends on the type of optical transition of a semiconductor (n 1 and 4 for direct and indirect transitions, respectively).According to the previously reports, the values of n for Bi 2 WO 6 36,37 and bulk MoS 2 38,39 are 1 and 4. Hence, the E g estimated from the intercept of the tangents to the polts are shown in Fig. 5b.The E g of pure Bi 2 WO 6 , pure MoS 2 , 2MB, 3MB, 4MB and 5MB were estimated to be around 2.75, 1.23, 2.59, 2.62, 2.55 and 2.60 eV, respectively.The above results indicate that the introduction of Photoluminescence (PL) analysis was performed to study the interfacial charge transfer and the separation efficiency of photogenerated electrons and holes in the MoS 2 /Bi 2 WO 6 nanocomposites.The comparision of PL spectra (excited at 300 nm) of pure Bi 2 WO 6 and MoS 2 /Bi 2 WO 6 nanocomposites at room temperature are shown in Fig. 6.It was found that all the PL spectra have two broad emission peaks at ca. 455 and 473 nm, respectively, which originate from the charge-transfer transitions between the hydrid orbital of Bi 6s and O 2p (VB) to the empty W 5d orbital (CB) in the WO 6 2-complex 40,41.As compared with pure Bi 2 WO 6 , the PL emission intensities of the composites dramatically decreased after the introducing of MoS 2 , which clearly indicates that the recombination of photogenerated charge carriers between the hydrid orbital of Bi 6s and O 2p to the W 5d is greatly inhibited by MoS 2 .This is because the MoS 2 layers with a two-dimensional -conjugated structure could serve as an effective electron-accepting material and the formed strong interaction between Bi 2 WO 6 and MoS 2 could improve the separation of electron-hole pairs under visible light irradiation, which make the electrons easily transfer to MoS 2 sheets, thus inhibit a direct recombination of electrons and holes 42.Nevertheless, higher MoS 2 content (0.4) leads to an increase of PL emission intensity (Fig. 6,5MB).This may be attributed to the excess MoS 2 that could act as the recombination sites of the photogenerated electron-hole pairs, which increases the opportunity for the collision of electrons and holes. Furthermore, the excitation and transfer of photogenerated electrons in the as-synthesized samples under visible light irradiation were qualitatively investigated by photoelectron-chemical measurements.Fig. 7a shows the photocurrent response of pure Bi 2 WO 6 and MoS 2 /Bi 2 WO 6 nanocomposites during four on-off cycles.It is clear that the photocurrent intensities of the nanocomposites (2MB, 3MB, 4MB and 5MB) are much higher than that of pure Bi 2 WO 6 .This reflects the higher separation efficiency of photogenerated electrons and holes in the MoS 2 /Bi 2 WO 6 nanocomposites.Among those composites, 4MB exhibits the highest photocurrent (1.2A cm -2 ), which is more than 6 times than that of pure Bi 2 WO 6 (0.2 A cm -2 ).The electrochemical impedance spectra (EIS), a powerful tool in probing the chargetransfer process, were used to further determine the advantage of MoS 2 /Bi 2 WO 6 nanocomposites in improving the separation efficiency of photo-excited electron-hole pairs.The EIS Nyquist plots (Fig. 7b) of the composites show depressed semicircles at high frequencies as compared with pure Bi 2 WO 6 , suggesting a decrease in the solid-state interface layer resistance and the charge-transfer resistance on the surface over the MoS 2 /Bi 2 WO 6 nanocomposites.In addition, the 4MB also shows superior interface charge separation efficiency than other composites (2MB, 3MB and 5MB), which is consistent with the results of photocurrent measurement.Evidently, those results indicate that the introduction of MoS 2 could effectively accelerate the photogenerated electrons migration rate, and improve the separation efficiency of charge carriers. Photocatalytic reduction of CO 2 with H 2 O was used to evaluate the photocatalytic activities of the as-synthesized samples at 4 C and atmospheric pressure under visible light irradiation ( 420 nm).It was found that methanol and ethanol were yielded as the main products, and there were no obvious other products such as HCHO, HCOOH, CH 4 and CO were detected in the liquid and gas phase.Control experiments were conducted without light irradiation or catalyst, and no appreciable amount of reduced C1 or C2 product could be detected, illustrating that both the visible light irradiation and photocatalyst are necessary for the present photocatalytic CO 2 reduction.In addition, neither CH 3 OH or C 2 H 5 OH, nor other carbon compounds was found by introducing N 2 instead of CO 2 into the photocatalyst suspension under visible light irradiation.This indicates that the photocatalysts and their residual intermediates do not contribute the organic products, and CO 2 is the only carbon source in the photoreduction reaction.The yields of methanol and ethanol depended on the irradiation time over the as-synthesized photocatalysts are shown in Fig. 8.It can be seen that pure MoS 2 showed no activity for the CO 2 photoreduction, but the Bi 2 WO 6 showed relatively good photoactivity.After 4 h, the methanol and ethanol yields over Bi 2 WO 6 can be achieved 20.5 and 17.2 mol gcat -1 , respectively.In previous report, Bi 2 WO 6 hollow microspheres prepared by anion exchange approach were also used as photocatalyst for the photoreduction of CO 2 into methanol 14.Herein, we made a direct comparison between the two kinds of Bi 2 WO 6 microspheres under the same reaction conditions adopted in this study.It was found that methanol and ethanol were also the main products over the reported Bi 2 WO 6 hollow microspheres, and the corresponding yields were 17.4 and 10.5 mol gcat -1 , respectively, which were much lower than that obtained over the flower-like Bi 2 WO 6 microspheres in this study.It is appear that the Bi 2 WO 6 prepared by us herein shows a much better photocatalytic performance, and has a promising potential to be further improved.As compared with pure Bi 2 WO 6 , the MoS 2 modified Bi 2 WO 6 nanocomopsites exhibited much better photoactivity.For 4 h of visible light irradiation, the yields of methanol and ethanol by using 2MB, 3MB, 4MB, and 5MB were found to be 34.0 and 25.0, 35.8 and 22.6, 36.7 and 36.6, as well as 33.1 and 23.0 mol gcat -1 , respectively, which were ca.1.57, 1.55, 1.94 and 1.48 folds to that produced over pure Bi 2 WO 6 .This demonstrates that the introduction of MoS 2 onto Bi 2 WO 6 surface can effectively improve the photocatalytic performance, which is attributed to their promoted visible light absorption ability, sep-aration efficiency of photogenerated electron-hole pairs, as well as prolonged lifetime of charge carriers.Overall, the photocatalyst 4MB showed the best activity in photocatalytic CO 2 reduction, which is also consistent with the results of DRS spectra, PL spectra, and electrochemical measurements. From environmental and economical viewpoints, it is good to have a catalyst that is stable and recyclable.To confirm the stability and recyclability of the high photocatalytic performance of 4MB, the circulating runs of CO 2 photoreduction were carried out over 4MB under visible light ( 420 nm).It was found that 4MB exhibits stable activity across four consecutive runs (Fig. 9).After 4 runs, there is only little loss of the yields of methanol and ethanol. To achieve the photocatalytic reduction of CO 2 thermodynamically, the CB bottom of photocatalysts should have a more negative potential than the redox potential of CO 2 /reduced-product couples 43,44.To confirm the electronic potential of Bi 2 WO 6 , Mott-Schottky test was carried out.As shown in Fig. S1, the flat band potential (V fb ) of Bi 2 WO 6 calculated from the x intercepts of the linear region is -0.302V vs. SCE at pH 7 (equivalent to -0.062 V vs. NHE).It is known that the CB of n-type semiconductors is 0-0.1 eV higher than the flat potentials, depending on the electron effective mass and carrier concentration 454647.Here, the voltage difference between the CB and flat potential is set to be 0.05 eV 48, and the bottom of the CB is therefore -0.112 eV.Neverthe- 1) and ( 2)) 43,49, respectively, which lie above the E CB of Bi 2 WO 6 .Apparently, the electrons formed in the CB of Bi 2 WO 6 can not directly reduce CO 2 molecules adsorbed on the catalyst into methanol and ethanol.However, the methanol and ethanol as the products are real generated in the photocatalytic CO 2 reduction process.How to explain this contradiction?It is well known that considerable portion of CO 2 dissolved in water could transform into H 2 CO 3 with little dissociated HCO 3 and CO 3 2-species, which have more reactive bent C O bonds compared with the inert linear CO 2 molecule, thus lowering the corresponding reduction potentials (Eqs.( 3) and ( 4)) 50.Comparing the potentials of the reactions given in Eqs. ( 1), ( 3) and ( 4) with the CB potentials of the catalysts, it can be inferred that the routes of methanol formation in Eqs. ( 3) and ( 4) is more thermodynamically favorable than the route in Eq. (1).In terms of H 2 CO 3 as the main carbonate species in aqueous CO 2 solution, the photoreduction of CO 2 in water is a thermodynamically feasible process.Moreover, ethanol can be formed by the radical polymerization in the methanol formation process 49. In order to validate the above assumption, several comparable experiments using Na 2 CO 3 and NaHCO 3 aqueous solution instead of pure water as reaction medium were conducted under visible light irradiation.From the results listed in Table S3, it was found that methanol and ethanol can be generated in both Na 2 CO 3 and NaHCO 3 aqueous solution under nitrogen atmosphere, and the product yield increased with the rise of Na 2 CO 3 and NaHCO 3 concentration.Due to the hydrolysis of CO 3 2-(Eq.( 5)) and HCO 3 -(Eq.( 6)), CO 3 2-with little formed HCO 3 -and H 2 CO 3 , as well as HCO 3 -with little formed H 2 CO 3 and CO 3 2-are the entire carboncontaining species in the Na 2 CO 3 and NaHCO 3 solution in the absence of CO 2 .The results indicate that methanol and ethanol were formed through the photoreduction of CO 3 2-, HCO 3 -and H 2 CO 3 as the carbon sources in the Na 2 CO 3 and NaHCO 3 solution, which proves that feasibility of CO 2 photoreduction over the photocatalyst with lower CB than the redox potentials of CO 2 /reduced-product couple.Moreover, the photoreduction processes using Na 2 CO 3 and NaHCO 3 solution as reaction medium were also investigated in the presence of CO 2 .The comparison of methanol and ethanol yields produced in the Na 2 CO 3 , NaHCO 3 solution and pure water under N 2 and/or CO 2 atmosphere was conducted, and the results are listed in Table S4.In Na 2 CO 3 solution, the yields of methanol and ethanol generated under CO 2 atmosphere were much higher than that obtained under N 2 atmosphere and in pure water.After 4 h of irradiation, the total hydrocarbons yield obtained with CO 2 (113.3 mol gcat -1 ) were nearly 2.41 times higher than that obtained under N 2 atmosphere (47.0 mol gcat -1 ), and 1.55 times higher than that obtained in pure water (73.3 mol gcat -1 ).This may be attributed to the greatly enhanced HCO 3 -concentration caused by the reaction of CO 2 with CO 3 2-and H 2 O (Eq. ( 7)).In contrast, the enhancement of HCO 3 -concentration was limited under CO 2 atmosphere, because there is almost no reaction occurred between HCO 3 -and CO 2 in NaHCO 3 solution.Hence, although the hydrocarbons yield obtained in NaHCO 3 solution under CO 2 atmosphere (73.5 mol gcat -1 ) was much higher than that obtained under N 2 atmosphere, it almost equalled to that obtained in pure water (73.3 mol gcat -1 ).From the above results, it distinctly indicates that the CO 3 2-, HCO 3 and H 2 CO 3 generated in CO 2 aqueous solution would be the reactive substrates during the photoreduction reaction, proving the thermodynamic feasibility of CO 2 photoreduction over the MoS 2 /Bi 2 WO 6 nanocompostites. The experimental results have exhibited that the photoelectronic properties and photoactivity of Bi 2 WO 6 were greatly promoted by modifying with MoS 2 .It is generally recognized that the photocatalytic performance of semiconductors strongly depend on their photoinduced charge carriers separation and transfer property, which could determine the amounts of photogenerated electrons and holes reaching the photocatalyst surface.In this study, both the good electron accepting and transporting properties of MoS 2 in the MoS 2 /Bi 2 WO 6 nanocomposites would contribute to the effective separation of photogenerated electronhole pairs and a fast interfacial charge transfer, and thereby a higher photocatalytic activity could be achieved.The proposed CO 2 photoreductrion and charge transfer mechanism in the MoS 2 /Bi 2 WO 6 nanocomposites are shown in Scheme 1.Under visible light irradiation, Bi 2 WO 6 absorbed the photons and generated electron-hole pairs.At the same time, the photo-excited electrons are directly transferred from VB to CB of Bi 2 WO 6 , which could take part in redox reactions on the surface.Nevertheless, the photogenerated electrons and holes are inclined to recombine quickly without any cocatalyst loading, causing the low photocatalytic activity of pure Bi 2 WO 6 .Because the CB position of Bi 2 WO 6 is higher than that of MoS 2 , the electrons can transfer from Bi 2 WO 6 to MoS 2 .After intro-Scheme 1. Proposed CO2 photoreductrion and charge transfer mechanism in the MoS2/Bi2WO6 nanocomposite. ducing MoS 2 , hence, the electrons in the CB of Bi 2 WO 6 could be easily transferred to the MoS 2 surface because of the intimate contact between them, which makes the electrons more mobile and provides highly active sites for the photoreduction process.Thus, MoS 2 /Bi 2 WO 6 nanocomposites exhibit high separation efficiency of the photo-generated electron-hole pairs, which effectively suppressing recombination between electrons and holes, lengthening the lifetime of the charge carriers and enhancing their photoreduction activity of CO 2 ."}, {"title": "Conclusions", "content": "The Bi 2 WO 6 -based nanocomposites containing few layered MoS 2 as cocatalyst were successfully synthesized by a facile method, and afforded as effective photocatalysts for the photoreduction of CO 2 into hydrocarbons under visible light irradiation ( 420 nm).The as-prepared MoS 2 /Bi 2 WO 6 nanocomposites showed an excellent CO 2 photoreduction performance, dramatically higher than pure Bi 2 WO 6 .Over the optimal sample consisting of 0.4 wt MoS 2 (4MB), the yields of methanol and ethanol can be achieved 36.7 and 36.6 mol gcat -1 respectively, after 4 h of visible light irradiation.The total hydrocarbons yield over 4MB is about 1.94 folds to that over pure Bi 2 WO 6 .A possible photocatalytic mechanism is also proposed.It is believed that the CO 3 2-, HCO 3 -and H 2 CO 3 formed in CO 2 aqueous solution could act as the reactive carbon sources during the photoreduction reaction, which proves that the photoreduction of CO 2 in water is a thermodynamically feasible process.Furthermore, the remarkable improved photocatalytic activity by introducing MoS 2 could be ascribed to the intimate interactions between MoS 2 and Bi 2 WO 6 , and the superior conductivity of MoS 2 , which efficiently improve the interfacial charge transfer and promote the separation of electron-hole pairs in the composite.This study opens a promising prospect for the development of cost-effective, environmental friendly, and efficient semiconductor-based composite photocatalysts. Fig. 1.XRD patterns of MoS2, Bi2WO6 and MoS2/Bi2WO6 nanocomposites. Fig. 2. SEM images of (a, b) Bi2WO6, and (c, d) 4MB. Fig. 3. (a) TEM image, (b) HRTEM image, and (c-g) the corresponding EDS mapping images of S, Mo, Bi, W and O, respectively, for 4MB. 2 WO 6 and pure MoS 2 in Fig. 4a indicate that Bi, W, O and C elements exist on Bi 2 WO 6 surface, and Mo, S, O and C elements exist on MoS 2 surface, respectively.The spectrum of 4MB sample indicates that it contains Bi, W, O, Mo, S and C elements, confirming the co-existence of Bi 2 WO 6 and MoS 2 Fig. 4. XPS spectra: (a) The survey spectra of Bi2WO6, 4MB and MoS2, and the high resolution XPS spectra of (b) Bi 4f, (c) W 4f, (d) O 1s, (e) Mo 3d, and (f) S 2p. Fig. 5. (a) UV-vis spectra of Bi2WO6, MoS2 and MoS2/Bi2WO6 nanocomposites, and (b) theirs band gaps. Fig. 6.Photoluminescence spectra ( excitation 300 nm) of Bi2WO6 and MoS2/Bi2WO6 nanocomposites. Fig. 7. (a) Transient photocurrent response of Bi2WO6 and MoS2/Bi2WO6 nanocomposites under visible light irradiation; (b) EIS Nyquist plots of Bi2WO6 and MoS2/Bi2WO6 nanocomposites. Fig. 9. Cycling runs of 4MB under visible light irradiation. C for 16 h.Then the autoclave was cool down to room temperature naturally, and the formed faint yellow Bi 2 WO 6 precipitate were filtered, washed with deionized water and ethanol for several times, and dried at 60 C for 12 h.2.1.2.Synthesis of MoS 2 /Bi 2 WO 6 nanocomposites This work was financially supported by the National Natural Science Foundation of China (Grant Nos.51662031, 51572119 and 51238002), Distinguished Young Scientists program of Jiangxi Province (Grant Nos.20162BCB23040), Natural Science Foundation of Jiangxi Province (Grant Nos.20151BAB203012), and Guangdong Provincial Science and Technology Program (Grant Nos.2014A010105051). Supplementary data associated with this article can be found, in the online version, at http://dx.doi.org/10.1016/j.apsusc.2017.01.171."}]