[{"title": "Doi", "content": "10.1016/j.jcou.2021.101773"}, {"title": "Article_Title", "content": "Surface-amino-induced boosting solar conversion of CO2 to CO over natural metal-free catalyst"}, {"title": "Abstract", "content": "Design and construction of visible-light-responsive and low-cost catalyst to improve photocatalytic CO 2 reduction efficiency are highly urgent due to rapid increment of CO 2 emission.Herein, a facile but effective strategy is proposed to synthesize heteroatoms-doped porous treated rape pollen (TRP) and NH 2 -functionalized TRP for CO 2 reduction.Heteroatoms doping can accelerate photoinduced charge transfer between neighboring carbon atom.The introduction of NH 2 -group offers effective sites to boost CO 2 adsorption, which is beneficial to facilitate CO 2to-CO conversion.The experimental results indicate that TRP-NH 2 exhibits visible-light-driven CO formation rate of 1165.3 mol h -1 g -1 in the gas-solid reaction system without co-catalysts or sacrificial agents, which is 2.4 and 70.1 times than those of TRP (488.4 mol h -1 g -1 ) and g-C 3 N 4 (16.6 mol h -1 g -1 ), and exceeds reported state-of-the-art carbon-based photocatalysts.The theoretical investigation shows that the incorporation of NH 2group can improve its charge density and converge more electrons to adsorb CO 2 molecules.In situ Fourier transform infrared (FT-IR) spectroscopy spectra disclose that the COOH radical is the main intermediate.The findings reveal the correlation between surface NH 2 -group and photocatalytic CO 2 reduction performance and can be extended to other sustainable metal-free based catalysts for solar-driven CO 2 reduction."}, {"title": "Experimental", "content": "In a typical synthetic procedure, rape pollen (10 g) was immersed in absolute ethanol (100 mL) under continuous supersonic treatment for 2 h to remove the core and wash the surface impurities.Then, the rape pollen was filtered and washed with deionised (DI) water, followed by fixation using 100 mL mixed solution of ethanol and formaldehyde (V/ V, 1:1).After that, the fixed rape pollen was filtered and washed with DI water.Finally, the fixed rape pollen was treated with H 2 SO 4 solution (12 M), maintained at 80 C for 4 h under continuous magnetic stirring, and then naturally cooled to room temperature.The obtained products were washed with DI water and ethanol for several times to adjust the pH value to 7, and dried overnight for further characterization. In a typical process, 0.1 g of TRP and 20 mL of NH 3 H 2 O (28 ) were mixed under continuous magnetic stirring.After stirring for certain time, the mixed solution was transferred into a Teflon-lined autoclave, maintaining at 80 C for 5 h, and then naturally cooled to room temperature.The final products were washed with DI water and dried at 60 C for one day.The samples with different NH 3 H 2 O treatment time (4, 12 and 24 h) were labeled as TRP-NH 2 (a), TRP-NH 2 (b) and TRP-NH 2 (c) respectively."}, {"title": "Results_and_discussion", "content": "The overall synthetic strategy for the formation of TRP-NH 2 catalyst involves three steps as shown in Scheme 1 and is listed in experimental section and Fig. 1a.Field-emission scanning electron microscopy (FESEM) image (Fig. 1b) indicates that the original solid rape pollen exhibits oval-shaped morphology with an average length and width of ca. 12 and 25 m, respectively.After treatment, hierarchical interconnected 3D macropore architecture (Fig. 1c) is obtained without changing their morphology and structure.Transmission electron microscopy (TEM) image further validates the porous structure of asprepared TRP-NH 2 sample (Fig. 1d), which shall be beneficial to light harvesting and CO 2 adsorption.The high-resolution TEM (HRTEM) image of the outermost TRP-NH 2 particle demonstrates the amorphous property of the sample (inset in Fig. 1d).Powder X-ray diffraction (XRD) pattern (Fig. 1e) of the TRP sample clearly shows a broad diffraction peak at around 24 , also indicating the amorphous nature of the TRP sample.After the modification of NH 2 -group on the surface of the TRP sample, the XRD diffraction peak of the TRP-NH 2 shifts to lower angle from 24 to 19 with increasing the ammonium hydroxide treatment time, possibly because more amino groups are incorporated on the TRP sample.In FT-IR spectra (Fig. 1f), two new peaks of 1640 cm -1 ) and (3200 cm -1 ) appeared in TRP-NH 2 samples compared with TRP.The board peak at 3200 cm -1 corresponds to the stretching modes of -NH 2 group 22.The results demonstrate the successful functionalization of NH 2 -groups on the surface of TRP sample.To further confirm the existence of NH 2 -groups on the TRP of this specimen, high resolution X-ray photoelectron spectroscopy (XPS) analysis of N1 s is also carried out.The N1 s XPS spectra can be divided into two peaks at 399.9, and 401.3 eV, which correspond to N-(C) 3 and N -H, respectively.The integral area ratio between N-H and N-(C) 3 increased from 0.58 (TRP) to 0.75 (TRP-NH2), suggesting the successful modification of -NH 2 on the surface 23.XPS survey spectra and high resolution XPS spectra of C1 s, O1 s and S2p are provided in Figure S1.As optical absorption property and energy band structure of semiconductors will greatly affect the photocatalytic efficiency, we first investigate UV-vis diffuse reflectance spectra (DRS, Figure S2-a) of the TRP and TRP-NH 2 samples before evaluating their visible-light-driven CO 2 reduction properties.Both TRP and TRP-NH 2 samples manifest strong photoabsorption ability ranging from UV to visible light region, and their bandgaps (Figure S2-b) can be calculated to be 1.08 and 1.2 eV, respectively, based on the UV-vis DRS results.Mott-Schottky plots (Figure S2-c) of these two samples are estimated to be -0.54 and -0.63 V (vs Ag/AgCl electrode), respectively.Thus, their derived flat band potentials are around -0.34 and -0.43 V (vs NHE electrode), respectively, as the flat band potential of a n-type semiconductor is close to the Fermi level (E f ) and the conduction band (CB) 24.In addition, valence band (VB) maximum (Figure S2-d) of the TRP and TRP-NH 2 samples are evaluated to be located at 0.55 eV below the E f level, which are about 0.21 and 0.12 V (vs NHE electrode), respectively.Thus, the conduction band (CB) minimum of TRP and TRP-NH 2 can be determined to be -0.87 and -1.08 V, respectively (Figure S3), which means the electrons on the CB position of NH 2 -modified TRP shall have stronger reducing power than that of TRP, suggesting CO 2 (CO 2 /CO, -0.53 V vs NHE) on TRP-NH 2 is easier to be activated than that on TRP. Photocatalytic CO 2 reduction performances of the as-prepared catalysts are then evaluated at room temperature (ca.20 C) under ambient pressure using a 300 W Xenon lamp with a 400 nm cutoff filter without cocatalyst and sacrifice reagent.As shown in Fig. 2a, the predominant reaction product is CO accompanied by a trace amount of methane (not show).The TRP sample exhibits CO 2 -to-CO transformation rate of 488.4 mol h -1 g -1 .Once the TRP sample is functionalized with NH 2group, the CO evolution activity is significantly improved, and the TRP-NH 2 (c) catalyst yields the highest CO evolution rate of 1165.3 mol h -1 g -1 , roughly 2.4 and 70.1 times than those of TRP and g-C 3 N 4 samples.Such a large CO evolution rate outperforms most of previously reported carbon-based photocatalysts (Table S1) and two typical photocatalysts, g-C 3 N 4 (16.3 mol h -1 g -1 ) and P25 (17 mol h -1 g -1 ) under comparable condition.No product can be detected in the absence of catalyst (Fig. 2a), demonstrating that the catalyst is indispensable for solar-driven CO 2 conversion.In addition, no detectable products are observed when the reaction system is manipulated in the dark condition (Fig. 2a), suggesting the photocatalytic nature of CO 2 reduction.No CO is generated when we use helium (He) to replace CO 2 under otherwise identical conditions, indicating the generated CO is derived from visible light photocatalytic CO 2 reduction.To provide direct proof for CO product generated from the CO 2 , 13 C-labeled isotopic experiment was carried out.As shown in Fig. 2b, gas chromatographymass spectrometer (GC-MS) results reveal that 13 CO is detected when using 13 CO 2 as substrate, further suggesting that the carbon source of CO is stemmed from reductive CO 2 deoxygenation 3. Quantum efficiency (QE) is also evaluated by using monochromatic light irradiation.As is shown in Fig. 2c, the trend of QE matches well with the UV-vis DRS of the TRP-NH 2 (c) sample, confirming that CO 2 reduction reaction is indeed driven by incident light.Moreover, the QE value at 450 nm is 4.7 , which stands out among the highest values of the reported carbon-based photocatalysts (Table S1).Furthermore, no substantial loss of CO evolution activity can be observed after four cycles testing (Figure S4-a), accompanied by no obvious change in phase (Figure S4-b) and morphology (Figure S4-c andd) of TRP-NH 2 (c) sample, reaffirming the high stability of the as-prepared photocatalyst for CO 2 reduction.To gain an in-depth understanding of the photocatalytic CO 2 reduction process, in situ FT-IR analysis (Fig. 2d) is carried out.It can be clearly observed that eight marked IR peaks emerged with increasing irradiation time from 0 to 60 min.The two peaks at 1365 and 1520 cm -1 , which can be ascribed to COOH intermediate, appear and their intensity gradually increases with the extended irradiation time, demonstrating that the adsorbed CO 2 is activated and the COOH shall be an important intermediate during the photocatalytic reduction of CO 2 to CO 25.Moreover, the formations of monodentate carbonate (1314 and 1543 cm -1 ), bidentate carbonate (1651 cm -1 ) and bicarbonate (1396 and 1421 cm -1 ) are originated from the co-adsorbed CO 2 and H 2 O on the surface of the catalyst 26272829. To understand why the NH 2 -modification can improve the photocatalytic CO 2 reduction efficiency, some important factors are investigated.One of the critical factors affecting the photocatalytic CO 2 reduction performance is the adsorption of CO 2 on the surfaces.As shown in Fig. 3a, the maximum adsorption capacity of TRP at atmospheric pressure (22 C) is 17.5 cm 3 g -1 .After functionalized with NH 2groups, the CO 2 adsorption capacity of TRP-NH 2 (c) increases and the value reaches at 33.8 cm 3 g -1 because NH 2 -groups exhibit strong Lewis basicity, which benefits the CO 2 adsorption and thus shall promote the CO 2 photoreduction. Another important factor affecting the photoactivity is charge separation efficiency as the separation rate of photoinduced electron-hole pairs shall be fast relative to the recombination rate to enable the electrons to reduce adsorbed CO 2 molecules.The average recombination rate is studied using the decay profile of open circuit potential, and can be calculated via the following equation 30: where V, V dark and V light are the open circuit potential at any time, in the dark and under light irradiation, respectively; k is the pseudo-first-order recombination rate constant.As shown in Fig. 3b, the TRP-NH 2 (c) sample exhibits slower decay kinetic in comparison to that of TRP, demonstrating the lower recombination rate of TRP-NH 2 (c) which is supported by the time-resolved photoluminescence (PL) results (Figure S5).This result is further evaluated by electrochemical impedance spectroscopy (EIS) analysis (Figure S6), in which TRP-NH 2 (c) manifests a reduced semidiameter in the Nyquist plots than that of TRP sample, suggesting a faster electron transfer kinetics of the TRP-NH 2 (c) sample 11. To deeply understand the NH 2 -group modification promoted CO 2 reduction performance, density functional theory (DFT) calculations are carried out.As the structure of TRP catalyst is similar to graphene based on C1 s XPS spectrum (Figure S1-b) and Raman result (Figure S7), we simply use graphene (GP) to simulate TRP.As can be observed from Fig. 3c andd, the modification of NH 2 -can significantly improve charge density around adjacent carbon atom.In addition, the carried charge (q) of NH 2 -(-0.381e) larger than that of H (-0.046 e), suggesting NH 2can converge more electrons to active CO 2 molecules.The electronic location function (ELF) reveals that there exists covalent interaction between N (NH 2 -) and C (Fig. 3c,d), in which N atom may accumulate more electrons around it to promote photocatalytic CO 2 reduction.Overall, the theoretical results match well with our experimental results that the modification NH 2 -groups on the surface of TRP can enhance the CO 2 adsorption and active CO 2 , finally accelerate CO 2 reduction process."}, {"title": "Conclusions", "content": "To conclude, a facile and low-cost strategy is developed to synthesize NH 2 -modified hierarchical 3D porous interconnected TRP.This method is highly efficient and easy to scale up.The as-prepared TRP-NH 2 Scheme 1. Schematic illustration of the synthetic route of a porous hollow TRP-NH 2 particle: (I) core remove and morphology fixation, (II) carbonization process and (III) amino-modification. Fig. 1.(a) Photographs of natural rape pollen (1), rape pollen after ultrasonic treatment with ethanol (2), sulfuric acid treated rape pollen (3, TRP), and TRP-NH 2 (4).Characterizations for TRP and TRP-NH 2 samples.FESEM image of (b) the original rape pollen, FESEM (c), HAADF-STEM (d) and HRTEM (inset in d) images of TRP-NH 2 sample, XRD patterns (e) and FT-IR spectra (f) of TRP and TRP-NH 2 samples, (g) High-resolution N 1s spectra of TRP and TRP-NH 2 (c) samples.(Scale bar: (b).15 m; (c).10 m; (d). 1 m; (inset in d). 5 nm). Fig. 2. CO 2 photocatalytic performance.(a) Generation of CO over different photocatalysts.Light source: 300 W Xenon lamp with a 400 nm cutoff filter; Reaction condition: 350 mL reactor, 15 mg catalyst, 3 h reaction time.(b) GC-MS analysis of the CO generated from the 13 CO 2 isotope experiments.(c) Wavelengthdependent quantum efficiency of as-prepared TRP-NH 2 (c) sample under monochromatic light irradiation.(c) In-situ FT-IR spectra for coadsorption of a mixture of CO 2 and H 2 O vapor on the TRP-NH 2 (c) catalyst in the dark and under visible light (LED lamp, 420 nm) irradiation for 20, 40, 60 min, respectively. Fig. 3. Characterizations for CO 2 adsorption property and charge separation efficiency of TRP based samples.(a) CO 2 adsorption isotherms.(b) Open-circuit potential decay curves (normalized after turning off the visible light).Charge difference distribution of GP between H and surrounding C (c) and GP-NH 2 between NH 2 and surrounding C (d). charge accumulation is in blue and depletion in yellow.The isosurfaces are set to 0.009 eV A -3 .Electronic location function of GP (e) and GP-NH 2 (f). The authors gratefully acknowledged the financial support from the National Natural Science Foundation of China (22178149), Jiangsu Fund for Outstanding Youth Scientists (BK20211599), Jiangsu Distinguished Professor Program and the Funding for Scientific Research Startup of Jiangsu University (No. 2020096).We would like to express our thanks to Ms. Hong Wang and Prof. Fan Dong from University of Electronic Science and Technology of China for their help in DFT calculation. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary material related to this article can be found, in the online version, at doi:https://doi.org/10.1016/j.jcou.2021.101773."}]