[{"title": "Doi", "content": "10.1016/j.jcat.2020.09.029"}, {"title": "Article_Title", "content": "A hydrazone-based covalent organic framework/iridium (III) complex for photochemical CO2 reduction with enhanced efficiency and durability"}, {"title": "Abstract", "content": "Metal complexes have been one of the most promising photocatalysts for highly selective conversion of CO 2 to carbon-based products.However, the aggregation-induced deactivation and narrow absorption range of sunlight impede their catalytic performance.Here, a heterogeneous photocatalytic system with a hydrazone-based covalent organic framework (COF) as photosensitizer and a metal complex Ir-ppy as photocatalyst is designed for efficient and durable photochemical CO 2 reduction.Under visible-light irradiation, this heterogeneous system achieves CO yield of 88.6 lmol in 1 h's reaction with the selectivity of 98.This reactivity is 2.3 times higher than that of bare Ir-ppy.Significantly, comparing with the poor catalytic durability (30 min) of Ir-ppy, the COF/Ir-ppy catalyst still be active after irradiation of 7 h.The extended catalytic reactivity may result from the promoting dispersion of Ir-ppy on NAHN-Tp COF which restrains the aggregation-induced deactivation of Ir-ppy.The enhanced reactivity may originate from the efficient electron transfer from COF to Ir-ppy and facilitated photo-induced charge separation as evidenced by matched band alignment of COF and Ir-ppy, steady-state photoluminescence, time-resolved fluorescence."}, {"title": "Experimental", "content": "Reagents and solvents used in the preparation are purchased from Acros, Aldrich and Azmax used without further purification. The complex Ir-ppy was prepared according to the published method 20.Ir(tpy)Cl 3 (50 mg, 0.094 mmol) and 2-Phenylpyridine (ppy) (17.51 mg, 0.1128 mmol) were mixed in ethylene glycol.The above mixture was refluxed for 15 h under an atmosphere of Ar and then 2 mL saturated solution of NH 4 PF 6 A was added after cooling mixture to room temperature.After stirring for 30 min, the obtained yellow precipitates were filtered and washed with water, and then dried in vacuum.The product was recrystallized with acetone/ ether to achieve purification. 1, 3, 5-Triformylphloroglucinol (Tp) (63 mg, 0.3 mmol), N-Ami no-4-hydrazino-1,8-naphthalimide (NAHN) 28 (82.9 mg, 0.45 mmol) were added to a pyrex tube (o.d.A i.d. 10 A 8 mm 2 and length 18 cm) with 2 mL of mesitylene, 2 mL of dioxane and 0.3 mL of 3 M aqueous acetic acid.This mixture was subjected to ultrasonic treatment for 120 min to obtain uniform dispersion.Then the tube was quickly frozen, pumped charging and degassing at 77 K (liquid N 2 bath) for three times, and finally flame-sealed.The tube was heated at 120 C for 3 days.Deep red COF was obtained, which was then washed with CH 3 CH 2 OH three times.The product was dried at 100 C for 12 h in the vacuum. The photocatalytic reactions were carried out in a 50 mL quartz tube.In the process, Ir-ppy (1.23 mg, 0.002 mmol) and NAHN-Tp COF (10 mg) were added to MeCN/TEOA (6 mL, 5:1, v / v) mixture solution.The mixture was purged with CO 2 for 20 min and then sealed up at 1 atm.The system was irradiated by a 300 W Xe lamp with a cut-off filter (k 420 nm) and stir for an hour.The reaction temperature was controlled at 25 C.The products were detected by GC-FID and GC-TCD apparatus.In the cycle experiment, the COF is reused with acetonitrile washing and fresh Ir-ppy was added every time.Isotopic experiments were carried out under the same conditions except replacing CO 2 with 13 CO 2 .The gasphase products were analyzed by gas chromatography-mass spectrometry (GC-MS). The NAHN-Tp was synthesized by the Schiff-base reactions of Tp and NAHN in the presence of aqueous acetic acid with mesitylene and 1,4-dioxane as solvents (Fig. 1(a)).Powder X-ray diffraction (PXRD) measurements were introduced to investigate the crystalline structure of NAHN-Tp.To elucidate its structure, a structure with the P6/m space group for NAHN-Tp is simulated by Material Studio.The experimental PXRD pattern (Fig. 1 S2).The intense peaks at 3.66, 6.3, 7.28, 9.66 and 28.24 were corresponding to the reflection from the (1 0 0), (1 1 0), (2 0 0), (2 1 0) and (0 0 1) plane.Fig. 1(c) shows the staggered arrays of NAHN-Tp cells with the interlayer spacing of 3.15 A.The maximum pore diameter is determined to be 3.8 nm by measuring the distance between atoms in the simulated structure.The nitrogen adsorption isotherm shows that the pore size is mainly distributed around 4 nm (Fig. S2), which is consistent with the value obtained by theoretical simulation.This further supports the reliability of the theoretically simulated structure. The successful condensation reaction to form hydrazone bond was proved by infrared spectra.In the infrared spectrum of NAHN-Tp (Fig. 2(a), black), the characteristic peaks at 3227 and 3362 cm A1 belonging to the amino NAH in NAHN (blue) 29 and the peak at 2885 cm A1 in Tp (red) ascribing to the aldehydic CAH in Tp disappeared 30,31.the CC bond at 1576 cm A1 and the CAN bond at 1245 cm A1 is displayed in the NAHN-Tp spectrum, suggesting that the successful condensation of NAHN and Tp 32,33.In addition, the OAH bond at 3433 cm A1 and CO bond at 1697 cm A1 are present in the spectrum at the same time, which reveals that the keto-form and enol-form may exist simultaneously in the NAHN-Tp 343536. The chemical composition and elemental states of NAHN-Tp were provided by X-ray photoelectron spectroscopy (XPS).The high-resolution XPS spectrum of C 1s (Fig. 2(b)) can be divided into three individual peaks located at 284.5, 285.5, and 288.4 eV, corresponding to CC, CAH/CAC, and CAN bonds, respectively 37.For O 1s XPS spectrum (Fig. 2(c)), two peaks at binding energies of 531 and 532.6 eV are observed and are ascribed to CO and CAOH, respectively 38. The UV-Vis diffuse reflection spectrum of the synthesized NAHN-Tp sample is shown in Fig. 2(d).NAHN-Tp strongly absorbs the light in the whole visible range with an absorption threshold around 847 nm.The thermal stability of NAHN-Tp was tested by thermal gravimetric analysis (TGA) (Fig. S1).The framework of NAHN-Tp was found to be stable up to 240 C.The permanent porosity of NAHN-Tp was measured by nitrogen gas absorption and desorption experiments at 77 K. Fig. S2 displays adsorption isotherm characteristics of mesoporous solids.The N 2 adsorption amount of NAHN-Tp is 357.5 cm 3 g A1 together with large Brunauer-Emmett-Teller (BET) surface area of 137.9 m 2 g A1 . The photocatalytic performance of Ir-ppy and NAHN-Tp is studied in MeCN solvent with triethanolamine (TEOA) as the sacrificial agent.Fig. 3(a) exhibits the reduction yields of CO 2 to CO outperform that of Ir-ppy and NAHN-Tp.In first five minutes, the yield of CO slightly increases to 3 lmol while in the later 5 min, the evolution rate sharply rises by an order of magnitude.This indicates that the catalytic system may need a photoactivation process.After that, the generation of CO gradually elevates and reaches to 88.6 lmol within 1 h irradiation and the selectivity of CO up to 98.The catalytic activity lasts by 7 h.(Fig. S3) and the TOF of Ir-ppy/NAHN-Tp was 0.166 (support information).Comparing with above heterogeneous system, the yield of pure Irppy is 1 fold higher in the initial stage which may ascribe to the homogeneous system easily to access substrates.In the following stages, the reactivity of pure Ir-ppy is substantial enhanced but it slight lower than that of Ir-ppy/NAHN-Tp.The activity of pure Ir-ppy is maintained by 30 min.After this time, the homogeneous system is inactive.The total yield of pure Ir-ppy within 30 min is 1-fold lower than that of heterogeneous Ir-ppy/NAHN-Tp.The elevated catalytic rate and prolonged reactivity in heterogeneous system may be owing to the efficient electron transfer between Ir-ppy and NAHN-Tp, and supressed aggregation-induced inactivation of Ir-ppy.The channels in COFs may accommodate guest molecules through p-p interaction between Ir-ppy and NAHN-Tp.TEM mapping and IR spectroscopy of NAHN-Tp/Ir-ppy after catalysis are collected to illuminate the accommodation.The elemental maps show that Ir is uniformly distributed in the NAHN-Tp.IR spectroscopy shows characteristic peaks of Ir-ppy at 842 cm A1 in the sample (Figs.S4 andS5).The optimal quality of NAHN-Tp to Ir-ppy was studied subsequently.As shown in Fig. 3(b), with the quantity of NAHN-Tp increased from 5 to 10 mg, the output of CO enhanced.However, further boosting quantity to 15 mg the catalytic reactivity decreased.This proves that the better weight ratio of COF to Ir-ppy is 8.13 (10/1.23 m/m).39 To further verify the carbon source of evolved CO, a 13 C labeled isotope experiment is performed using 13 CO 2 .As exhibited in Fig. 4 (a), two signals at 1.88 and 13.08 min are observed with m/z 29 and 45 which were attributed to 13 CO and 13 CO 2 , respectively.No obvious peak at m/z 28 was found, which clearly demonstrating that the product originates from photoreduction of CO 2 molecules rather than other carbon species in the reaction system.To investigate the durability of NAHN-Tp, five consecutive runs of photoreduction is carried out.The evolution of CO in the fifth round only declines by 5 when comparing with that in the first round.These results confirm its pretty good photocatalytic stability (Fig. 4(b)).A series of controlled experiments are carried out and the data of results are presented in Table S3.Without irradiation (entry 1) or TEOA (entry 2) in the system, no gaseous products are detected, indicating that the irradiation and electron donor species are indispensable for this system towards CO 2 photoreduction.In the absence of NAHN-Tp (entry 3), the output of the CO decreases rapidly, this result implies that the NAHN-Tp might be photosensitizer 40,41 in CO 2 reductive reaction.When the conversion is performed in Ar atmosphere instead of CO 2 (entry 4), no carbon products is detected in the final gas phase, proving that CO originates from the photoreduction of CO 2 rather than decomposition of carbon-based substances in the system.This result is consistent with above 13 C labeling experiment. To demonstrate the electron transfer process between NAHN-Tp COF and Ir-ppy complex, the band structures of the samples are studied firstly.The conduction band (CB) and valence band (VB) energy of NAHN-Tp are obtained from the Tauc plot analysis (Fig. S6(a)) and valence band XPS (VB-XPS) (Fig. S6(b)).From VB to XPS, VB energy of NAHN-Tp COF is determined to be 1.43 V vs reversible hydrogen electrode (RHE), which equals -5.83 V vs vacuum.As calculating from Tauc plot, the optical band gap (Eg) of NAHN-Tp is measured to be 1.63 eV.Thus, the CB energy of NAHN-Tp is obtained from Ev -Eg and the result is A0.2 V vs RHE, which is equals -4.2 V vs vacuum 42.In order to evaluate the optical band gap of Ir-ppy, the absorption onset is extracted (Fig. S7(a)) and the optical band gap of 2.29 eV is estimated according to the equation E g opt hc/k edge .From the cyclic voltammetry (CV) curve, the highest occupied molecular orbital (HOMO) energy level of A5.14 V vs vacuum is estimated from the onset oxidation potential of 0.71 V (Fig. S7(b)).The reference electrode used in CV is corrected with ferrocene.The lowest unoccupied molecular orbital (LUMO) energy level of A2.85 V vs vacuum is obtained from HOMO energy level and optical band gap using the equation of LUMO HOMO E g opt 43,44.Afterward, the energy levels of the CB and VB of NAHN-Tp are respectively higher and lower than the HOMO of Ir-ppy, indicating the electrons excitation paths in the photocatalyst system follows Z-scheme 454647. The separation of photogenerated electrons and holes in this system is investigated through steady-state photoluminescence, time-resolved fluorescence.Fig. 5(a) shows the steady-state emission spectra of Ir-ppy excited at 400 nm, the Ir-ppy show strong emission peaks at 560 nm.In contrast, the emission band gradually quenched with the increased adding amount of NAHN-Tp which is possible due to the effective electron transfer process inhibits the recombination of electrons and holes 48.In time-resolved fluorescence spectra (Fig. 5(b)), the fluorescence lifetime of Ir-ppy decreases from 1031 to 729 ns after adding NAHN-Tp (Table S4).This result also confirms the electron transfer between Ir-ppy and NAHN-Tp COF. The Based on the above results and previous studies, the photocatalytic mechanism of this system is temporarily proposed (Fig. 7). In summary, a hydrazone-based COF (NAHN-Tp) with excellent visible-light absorption is synthesized and combined it with Ir-ppy, enhanced reactivity and durability is achieved toward photochemical CO 2 reduction.Under visible light, a generation amount of CO reaches 88.6 lmol with 98 selectivity within 1 h reaction.This reactivity is 2.3 times higher than that of bare Ir-ppy.As evidenced by Z-scheme band alignment of COF and Ir-ppy, steady and transient-state emission, and transient photocurrent measurements, the efficient electron transfer from COF to Ir-ppy may account for the enhanced reactivity.Moreover, the catalytic durability of Ir-ppy is much improved in the COF/ Ir-ppy system.Comparison with the catalytic durability of 30 min of bare Ir-ppy, the heterogeneous catalyst is still active after irradiation of 7 h.This may result from the promoting dispersion of Ir-ppy on NAHN-Tp COF which restrains the aggregationinduced deactivation of Ir-ppy.This work provides novel insights for developing and design efficient metal complex-based systems for highly durable and selective visible-light-driven CO 2 reduction. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. (b)) of NAHN-Tp was similar to that of simulated staggered (AB) stacking model for a hexagonal structure in P6/m symmetry.Pawley refinement of the experimental NAHN-Tp pattern yielded unit cell parameters of a 27.93A, b 28.05A, c 3.15 A, a c 90, and b 60(Table Fig. 1.(a) Schematic representation of the syntheses of NAHN-Tp.(b) Experimental (black) and simulated PXRD patterns of Staggered (AB) stacking (red) and Eclipsed (AA) stacking (blue) for NAHN-Tp.(c) Staggered AB packing structures of NAHN-Tp. Fig. 2. (a) Fourier transform infrared spectroscopy (FTIR) of NAHN, Tp and NAHN-Tp; X-ray photoelectron spectroscopy (XPS) of NAHN-Tp (b) C 1s (c) O 1s.(d) UV-Vis absorption spectra of NAHN-Tp. Fig. 3. (a) Time course of the CO with the NAHN-Tp; Ir-ppy and NAHN-Tp/Ir-ppy (10 mg NAHN-Tp 1.23 mg Ir-ppy) containing MeCN / TEOA (6 mL, 5:1, v / v) irradiated by a 300 W Xe lamp (k 420 nm).(b) CO evolution with different qualities of NAHN-Tp.Those systems contained 1.23 mg Ir-ppy and 6 mL mixture of MeCN and TEOA (5:1) irradiated by a 300 W Xe lamp (k 420 nm); Fig. 4. (a) The GC-MS spectra showing the carbon source of generated 13 CO in the 13 CO 2 isotopic experiment of NAHN-Tp/Ir-ppy (10 mg NAHN-Tp 1.23 mg Ir-ppy); (b) Recyclability of the NAHN-Tp in five consecutive runs.NAHN-Tp was washed with acetonitrile, dried in vacuum and reused with a new Ir-ppy every cycle. photoelectrochemical properties of the NAHN-Tp, Ir-ppy and NAHN-Tp/Ir-ppy were studied by electrochemical impedance spectroscopy (EIS) and transient photocurrent measurements.It was confirmed that electron transfer occurred between NAHN-Tp and Ir-ppy.As shown in Fig. 6a, the EIS of NAHN-Tp/Ir-ppy, bare NAHN-Tp and Ir-ppy were measured.The radius of the semicircles of NAHN-Tp/Ir-ppy was considerably smaller than those of bare NAHN-Tp and Ir-ppy, indicating significantly improved the charge transfer between NAHN-Tp and Ir-ppy.In addition, Fig. 6b shows the photocurrent responses of the NAHN-Tp (black plot), Ir-ppy (red plot) and NAHN-Tp/Ir-ppy (blue plot).When the electrodes were irradiated (k 420 nm), all three samples show obvious photocurrent response, indicating the generation of photogenerated electrons.For NAHN-Tp/Ir-ppy, the highest current level up to 7.7 lA cm A2 during irradiation, which was 4-fold and 2-fold higher than NAHN-Tp and Ir-ppy, respectively.The outstanding photocurrent of the NAHN-Tp/Ir-ppy indicates that it has the superior charge transfer efficiency, which is consistent with the photoluminescence results 49. Fig. 5. (a) The emission spectra of 1.23 mg Ir-ppy in acetonitrile upon the addition of NAHN-Tp and the final quality of NAHN-Tp is indicated in the mg unit; (b) Timeresolved fluorescence spectra of 1.23 mg Ir-ppy (black); 1.23 mg Ir-ppy with 2 mg NAHN-Tp (green) and corresponding fitting results. Fig. 6.(a) Photocurrent responses (b) electrochemical impedance spectroscopy of NAHN-Tp, Ir-ppy and NAHN-Tp/Ir-ppy. Fig. 7. Z-Scheme electron transfer during CO 2 reduction using an NAHN-Tp and Ir-ppy. This work was financially supported by the NSFC of China (No. 21971032, 21801038, 21771035), Jilin Provincial Department of Science and Technology (No. 20190103018JH); Foundation of Jilin Educational Committee (grant number JJKH20190278KJ). Supplementary data to this article can be found online at https://doi.org/10.1016/j.jcat.2020.09.029."}, {"title": "Results_and_discussion", "content": "The NAHN-Tp was synthesized by the Schiff-base reactions of Tp and NAHN in the presence of aqueous acetic acid with mesitylene and 1,4-dioxane as solvents (Fig. 1(a)).Powder X-ray diffraction (PXRD) measurements were introduced to investigate the crystalline structure of NAHN-Tp.To elucidate its structure, a structure with the P6/m space group for NAHN-Tp is simulated by Material Studio.The experimental PXRD pattern (Fig. 1 S2).The intense peaks at 3.66, 6.3, 7.28, 9.66 and 28.24 were corresponding to the reflection from the (1 0 0), (1 1 0), (2 0 0), (2 1 0) and (0 0 1) plane.Fig. 1(c) shows the staggered arrays of NAHN-Tp cells with the interlayer spacing of 3.15 A.The maximum pore diameter is determined to be 3.8 nm by measuring the distance between atoms in the simulated structure.The nitrogen adsorption isotherm shows that the pore size is mainly distributed around 4 nm (Fig. S2), which is consistent with the value obtained by theoretical simulation.This further supports the reliability of the theoretically simulated structure. The successful condensation reaction to form hydrazone bond was proved by infrared spectra.In the infrared spectrum of NAHN-Tp (Fig. 2(a), black), the characteristic peaks at 3227 and 3362 cm A1 belonging to the amino NAH in NAHN (blue) 29 and the peak at 2885 cm A1 in Tp (red) ascribing to the aldehydic CAH in Tp disappeared 30,31.the CC bond at 1576 cm A1 and the CAN bond at 1245 cm A1 is displayed in the NAHN-Tp spectrum, suggesting that the successful condensation of NAHN and Tp 32,33.In addition, the OAH bond at 3433 cm A1 and CO bond at 1697 cm A1 are present in the spectrum at the same time, which reveals that the keto-form and enol-form may exist simultaneously in the NAHN-Tp 343536. The chemical composition and elemental states of NAHN-Tp were provided by X-ray photoelectron spectroscopy (XPS).The high-resolution XPS spectrum of C 1s (Fig. 2(b)) can be divided into three individual peaks located at 284.5, 285.5, and 288.4 eV, corresponding to CC, CAH/CAC, and CAN bonds, respectively 37.For O 1s XPS spectrum (Fig. 2(c)), two peaks at binding energies of 531 and 532.6 eV are observed and are ascribed to CO and CAOH, respectively 38. The UV-Vis diffuse reflection spectrum of the synthesized NAHN-Tp sample is shown in Fig. 2(d).NAHN-Tp strongly absorbs the light in the whole visible range with an absorption threshold around 847 nm.The thermal stability of NAHN-Tp was tested by thermal gravimetric analysis (TGA) (Fig. S1).The framework of NAHN-Tp was found to be stable up to 240 C.The permanent porosity of NAHN-Tp was measured by nitrogen gas absorption and desorption experiments at 77 K. Fig. S2 displays adsorption isotherm characteristics of mesoporous solids.The N 2 adsorption amount of NAHN-Tp is 357.5 cm 3 g A1 together with large Brunauer-Emmett-Teller (BET) surface area of 137.9 m 2 g A1 . The photocatalytic performance of Ir-ppy and NAHN-Tp is studied in MeCN solvent with triethanolamine (TEOA) as the sacrificial agent.Fig. 3(a) exhibits the reduction yields of CO 2 to CO outperform that of Ir-ppy and NAHN-Tp.In first five minutes, the yield of CO slightly increases to 3 lmol while in the later 5 min, the evolution rate sharply rises by an order of magnitude.This indicates that the catalytic system may need a photoactivation process.After that, the generation of CO gradually elevates and reaches to 88.6 lmol within 1 h irradiation and the selectivity of CO up to 98.The catalytic activity lasts by 7 h.(Fig. S3) and the TOF of Ir-ppy/NAHN-Tp was 0.166 (support information).Comparing with above heterogeneous system, the yield of pure Irppy is 1 fold higher in the initial stage which may ascribe to the homogeneous system easily to access substrates.In the following stages, the reactivity of pure Ir-ppy is substantial enhanced but it slight lower than that of Ir-ppy/NAHN-Tp.The activity of pure Ir-ppy is maintained by 30 min.After this time, the homogeneous system is inactive.The total yield of pure Ir-ppy within 30 min is 1-fold lower than that of heterogeneous Ir-ppy/NAHN-Tp.The elevated catalytic rate and prolonged reactivity in heterogeneous system may be owing to the efficient electron transfer between Ir-ppy and NAHN-Tp, and supressed aggregation-induced inactivation of Ir-ppy.The channels in COFs may accommodate guest molecules through p-p interaction between Ir-ppy and NAHN-Tp.TEM mapping and IR spectroscopy of NAHN-Tp/Ir-ppy after catalysis are collected to illuminate the accommodation.The elemental maps show that Ir is uniformly distributed in the NAHN-Tp.IR spectroscopy shows characteristic peaks of Ir-ppy at 842 cm A1 in the sample (Figs.S4 andS5).The optimal quality of NAHN-Tp to Ir-ppy was studied subsequently.As shown in Fig. 3(b), with the quantity of NAHN-Tp increased from 5 to 10 mg, the output of CO enhanced.However, further boosting quantity to 15 mg the catalytic reactivity decreased.This proves that the better weight ratio of COF to Ir-ppy is 8.13 (10/1.23 m/m).39 To further verify the carbon source of evolved CO, a 13 C labeled isotope experiment is performed using 13 CO 2 .As exhibited in Fig. 4 (a), two signals at 1.88 and 13.08 min are observed with m/z 29 and 45 which were attributed to 13 CO and 13 CO 2 , respectively.No obvious peak at m/z 28 was found, which clearly demonstrating that the product originates from photoreduction of CO 2 molecules rather than other carbon species in the reaction system.To investigate the durability of NAHN-Tp, five consecutive runs of photoreduction is carried out.The evolution of CO in the fifth round only declines by 5 when comparing with that in the first round.These results confirm its pretty good photocatalytic stability (Fig. 4(b)).A series of controlled experiments are carried out and the data of results are presented in Table S3.Without irradiation (entry 1) or TEOA (entry 2) in the system, no gaseous products are detected, indicating that the irradiation and electron donor species are indispensable for this system towards CO 2 photoreduction.In the absence of NAHN-Tp (entry 3), the output of the CO decreases rapidly, this result implies that the NAHN-Tp might be photosensitizer 40,41 in CO 2 reductive reaction.When the conversion is performed in Ar atmosphere instead of CO 2 (entry 4), no carbon products is detected in the final gas phase, proving that CO originates from the photoreduction of CO 2 rather than decomposition of carbon-based substances in the system.This result is consistent with above 13 C labeling experiment. To demonstrate the electron transfer process between NAHN-Tp COF and Ir-ppy complex, the band structures of the samples are studied firstly.The conduction band (CB) and valence band (VB) energy of NAHN-Tp are obtained from the Tauc plot analysis (Fig. S6(a)) and valence band XPS (VB-XPS) (Fig. S6(b)).From VB to XPS, VB energy of NAHN-Tp COF is determined to be 1.43 V vs reversible hydrogen electrode (RHE), which equals -5.83 V vs vacuum.As calculating from Tauc plot, the optical band gap (Eg) of NAHN-Tp is measured to be 1.63 eV.Thus, the CB energy of NAHN-Tp is obtained from Ev -Eg and the result is A0.2 V vs RHE, which is equals -4.2 V vs vacuum 42.In order to evaluate the optical band gap of Ir-ppy, the absorption onset is extracted (Fig. S7(a)) and the optical band gap of 2.29 eV is estimated according to the equation E g opt hc/k edge .From the cyclic voltammetry (CV) curve, the highest occupied molecular orbital (HOMO) energy level of A5.14 V vs vacuum is estimated from the onset oxidation potential of 0.71 V (Fig. S7(b)).The reference electrode used in CV is corrected with ferrocene.The lowest unoccupied molecular orbital (LUMO) energy level of A2.85 V vs vacuum is obtained from HOMO energy level and optical band gap using the equation of LUMO HOMO E g opt 43,44.Afterward, the energy levels of the CB and VB of NAHN-Tp are respectively higher and lower than the HOMO of Ir-ppy, indicating the electrons excitation paths in the photocatalyst system follows Z-scheme 454647. The separation of photogenerated electrons and holes in this system is investigated through steady-state photoluminescence, time-resolved fluorescence.Fig. 5(a) shows the steady-state emission spectra of Ir-ppy excited at 400 nm, the Ir-ppy show strong emission peaks at 560 nm.In contrast, the emission band gradually quenched with the increased adding amount of NAHN-Tp which is possible due to the effective electron transfer process inhibits the recombination of electrons and holes 48.In time-resolved fluorescence spectra (Fig. 5(b)), the fluorescence lifetime of Ir-ppy decreases from 1031 to 729 ns after adding NAHN-Tp (Table S4).This result also confirms the electron transfer between Ir-ppy and NAHN-Tp COF. The Based on the above results and previous studies, the photocatalytic mechanism of this system is temporarily proposed (Fig. 7)."}, {"title": "Conclusions", "content": "In summary, a hydrazone-based COF (NAHN-Tp) with excellent visible-light absorption is synthesized and combined it with Ir-ppy, enhanced reactivity and durability is achieved toward photochemical CO 2 reduction.Under visible light, a generation amount of CO reaches 88.6 lmol with 98 selectivity within 1 h reaction.This reactivity is 2.3 times higher than that of bare Ir-ppy.As evidenced by Z-scheme band alignment of COF and Ir-ppy, steady and transient-state emission, and transient photocurrent measurements, the efficient electron transfer from COF to Ir-ppy may account for the enhanced reactivity.Moreover, the catalytic durability of Ir-ppy is much improved in the COF/ Ir-ppy system.Comparison with the catalytic durability of 30 min of bare Ir-ppy, the heterogeneous catalyst is still active after irradiation of 7 h.This may result from the promoting dispersion of Ir-ppy on NAHN-Tp COF which restrains the aggregationinduced deactivation of Ir-ppy.This work provides novel insights for developing and design efficient metal complex-based systems for highly durable and selective visible-light-driven CO 2 reduction. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. (b)) of NAHN-Tp was similar to that of simulated staggered (AB) stacking model for a hexagonal structure in P6/m symmetry.Pawley refinement of the experimental NAHN-Tp pattern yielded unit cell parameters of a 27.93A, b 28.05A, c 3.15 A, a c 90, and b 60(Table Fig. 1.(a) Schematic representation of the syntheses of NAHN-Tp.(b) Experimental (black) and simulated PXRD patterns of Staggered (AB) stacking (red) and Eclipsed (AA) stacking (blue) for NAHN-Tp.(c) Staggered AB packing structures of NAHN-Tp. Fig. 2. (a) Fourier transform infrared spectroscopy (FTIR) of NAHN, Tp and NAHN-Tp; X-ray photoelectron spectroscopy (XPS) of NAHN-Tp (b) C 1s (c) O 1s.(d) UV-Vis absorption spectra of NAHN-Tp. Fig. 3. (a) Time course of the CO with the NAHN-Tp; Ir-ppy and NAHN-Tp/Ir-ppy (10 mg NAHN-Tp 1.23 mg Ir-ppy) containing MeCN / TEOA (6 mL, 5:1, v / v) irradiated by a 300 W Xe lamp (k 420 nm).(b) CO evolution with different qualities of NAHN-Tp.Those systems contained 1.23 mg Ir-ppy and 6 mL mixture of MeCN and TEOA (5:1) irradiated by a 300 W Xe lamp (k 420 nm); Fig. 4. (a) The GC-MS spectra showing the carbon source of generated 13 CO in the 13 CO 2 isotopic experiment of NAHN-Tp/Ir-ppy (10 mg NAHN-Tp 1.23 mg Ir-ppy); (b) Recyclability of the NAHN-Tp in five consecutive runs.NAHN-Tp was washed with acetonitrile, dried in vacuum and reused with a new Ir-ppy every cycle. photoelectrochemical properties of the NAHN-Tp, Ir-ppy and NAHN-Tp/Ir-ppy were studied by electrochemical impedance spectroscopy (EIS) and transient photocurrent measurements.It was confirmed that electron transfer occurred between NAHN-Tp and Ir-ppy.As shown in Fig. 6a, the EIS of NAHN-Tp/Ir-ppy, bare NAHN-Tp and Ir-ppy were measured.The radius of the semicircles of NAHN-Tp/Ir-ppy was considerably smaller than those of bare NAHN-Tp and Ir-ppy, indicating significantly improved the charge transfer between NAHN-Tp and Ir-ppy.In addition, Fig. 6b shows the photocurrent responses of the NAHN-Tp (black plot), Ir-ppy (red plot) and NAHN-Tp/Ir-ppy (blue plot).When the electrodes were irradiated (k 420 nm), all three samples show obvious photocurrent response, indicating the generation of photogenerated electrons.For NAHN-Tp/Ir-ppy, the highest current level up to 7.7 lA cm A2 during irradiation, which was 4-fold and 2-fold higher than NAHN-Tp and Ir-ppy, respectively.The outstanding photocurrent of the NAHN-Tp/Ir-ppy indicates that it has the superior charge transfer efficiency, which is consistent with the photoluminescence results 49. Fig. 5. (a) The emission spectra of 1.23 mg Ir-ppy in acetonitrile upon the addition of NAHN-Tp and the final quality of NAHN-Tp is indicated in the mg unit; (b) Timeresolved fluorescence spectra of 1.23 mg Ir-ppy (black); 1.23 mg Ir-ppy with 2 mg NAHN-Tp (green) and corresponding fitting results. Fig. 6.(a) Photocurrent responses (b) electrochemical impedance spectroscopy of NAHN-Tp, Ir-ppy and NAHN-Tp/Ir-ppy. Fig. 7. Z-Scheme electron transfer during CO 2 reduction using an NAHN-Tp and Ir-ppy. This work was financially supported by the NSFC of China (No. 21971032, 21801038, 21771035), Jilin Provincial Department of Science and Technology (No. 20190103018JH); Foundation of Jilin Educational Committee (grant number JJKH20190278KJ). Supplementary data to this article can be found online at https://doi.org/10.1016/j.jcat.2020.09.029."}]