[{"title": "Doi", "content": "10.3390/catal8010041"}, {"title": "Article_Title", "content": "Sustainable Carbon Dioxide Photoreduction by a Cooperative Effect of Reactor Design and Titania Metal Promotion"}, {"title": "Abstract", "content": "An effective process based on the photocatalytic reduction of CO 2 to face on the one hand, the crucial problem of environmental pollution, and, on the other hand, to propose an efficient way to product clean and sustainable energy sources has been developed in this work.Particular attention has been paid to the sustainability of the process by using a green reductant (water) and TiO 2 as a photocatalyst under very mild operative conditions (room temperature and atmospheric pressure).It was shown that the efficiency in carbon dioxide photoreduction is strictly related to the process parameters and to the catalyst features.In order to formulate a versatile and high performing catalyst, TiO 2 was modified by oxide or metal species.Copper (in the oxide CuO form) or gold (as nanoparticles) were employed as promoting metal.Both photocatalytic activity and selectivity displayed by CuO-TiO 2 and Au-TiO 2 were compared, and it was found that the nature of the promoter (either Au or CuO) shifts the selectivity of the process towards two strategic products: CH 4 or H 2 .The catalytic results were discussed in depth and correlated with the physicochemical features of the photocatalysts."}, {"title": "Experimental", "content": "The following reagents were used as received: TiOSO 4 xH 2 OyH 2 SO 4 (Ti assay 29 Sigma Aldrich, Milano, Italy), sodium hydroxide (assay 97 Carlo Erba, Milano, Italy) and Cu(NO 3 ) 2 3H 2 O (assay 99, Sigma-Aldrich, Milano, Italy), and 2-propanol (assay 99.8 Sigma-Aldrich, Milano, Italy).A standard TiO 2 reference material (MIRKAT 211) has been purchased by Euro Support s.r.o (Litvinov, Czech Republic).This commercial titania has been chosen as a reference material, since it possesses a large surface area (217 m 2 /g), and it is in the anatase form, i.e., the most suitable titania crystalline phase for photocatalytic applications, and it does not contain any trace of carbonaceous species. The precipitation method has been chosen to synthesise the titania samples.A 1.2 M titanyl sulphate solution and a 9.0 M NaOH solution have been added drop wise and simultaneously to 200 mL of distilled water under vigorous stirring, in order to keep a neutral pH.Then the Ti(OH) 4 suspension has been aged at 60 C for 20 h.Afterwards, the precipitated has been filtered and washed with distilled water to remove the sulphate ions.The absence of sulphates has been verified by means of the barium chloride test 96.The obtained wet Ti(OH) 4 has been dried overnight at 110 C and calcined at 400 C for 4 h in air flow to obtain TiO 2 .This sample has been labelled as TiO 2 . According to a previous work 16, the introduction of copper oxide into titania provides the highest effect on the photoactivity when the Cu amount is 0.2 wt..In particular, incipient wetness impregnation with a copper precursor, namely Cu(NO 3 ) 2 3H 2 O, has been performed on dried Ti(OH) 4 .Then, the copper-impregnated sample has been calcined at 400 C in air flow in order to obtain the CuO-TiO 2 photocatalyst. In this case, the incipient wetness method would not allow us to deposit small gold nanoparticles on the titania surface 97.Therefore, in order to obtain small gold nanoparticles, gold has been added to titania by using the deposition-precipitation (DP) method, thus maintaining the pH equal to 8.6 98.Titanium dioxide has been suspended in an aqueous solution of HAuCl 4 3H 2 O for 3 h, while controlling the pH value by the addition of NaOH (0.5 M).The Au amount was 0.2 wt., the same as in the case of the CuO-TiO 2 photocatalyst, for comparison purposes.After filtration, the samples have been washed with distilled water to remove chlorides.The absence of chlorides was verified by the silver nitrate test.The samples have been dried at 35 C overnight and finally calcined in air for 1 h at 400 C. The final sample has been labelled Au-TiO 2 . The thermal analyses (TG/DTA) have been performed on a NETZSCH STA 409 PC/PG Instrument (Bavaria, Germany) in air flux (20 mL/min) using a 10 C/min temperature rate between 25-800 C. X-ray Diffraction (XRD) patterns have been collected on a Bruker D8 Advance powder diffractometer with a sealed X-ray tube (copper anode; operating conditions, 40 kV and 40 mA) (Billerica, MA, USA) and a Si(Li) solid state detector (Sol-X) set to discriminate the Cu K radiation.Apertures of divergence, receiving, and detector slits were 2.0 mm, 2.0 mm, and 0.2 mm, respectively.Data scans have been performed in the 2 range 5-75 with 0.02 step size and counting times of 3 s/step.Quantitative phase analysis and crystallite size determination have been performed using the Rietveld method as implemented in the TOPAS v.4 program (Bruker AXS, Billerica, MA, USA) using the fundamental parameters approach for line-profile fitting.The determination of the crystallite size was accomplished by the Double-Voigt approach and calculated as volume-weighted mean column heights based on integral breadths of peaks. N 2 adsorption-desorption isotherms at 196 C were performed using a Micromeritics ASAP 2000 analyser (Norcross, GA, USA) to obtain information on the surface properties.All samples were previously outgassed at 200 C for 2 h.The mesopore volume was measured as the adsorbed amount of N 2 after capillary condensation.The surface area was evaluated using the standard BET 99 equation, and the pore size distribution was obtained using the BJH method applied to the isotherm desorption branch 100. The real amount of copper and gold in the promoted catalysts was determined by flame atomic absorption spectroscopy (FAAS) using a PerkinElmer Analyst 100 (Waltham, MA, USA). Temperature programmed reduction (TPR) experiments were carried out in a lab-made equipment; each sample (50 mg) was heated at 10 C/min from 25 C to 800 C in a 5 H 2 /Ar reducing mixture (40 mLmin -1 STP).The effluent gases were analysed by a Gow-Mac TCD detector (Bethlehem, PA, USA) using a magnesium perchlorate trap to stop H 2 O. Diffuse reflectance UV-Vis-NIR spectra were collected at r.t. on a Varian Cary 5000 spectrophotometer (Palo Alto, CA, USA) with an integrating sphere attachment using BaSO 4 powder as an internal reference, working in the 50,000-4000 cm -1 range.UV-Vis-NIR spectra of the as prepared samples are reported in the Kubelka reflectance of an \"infinitely thick\" layer of the sample 101.The layer of powder sample was made sufficiently thick such that all incident light was absorbed or scattered before reaching the back surface of the sample holder.Typically, a thickness of 1-3 mm was required. The samples in the form of powders were placed in a quartz cell, allowing treatments in controlled atmosphere and temperature.The band gap energy (Eg) of the catalysts was determined by the intercept of a linear fit to the absorption edge, and it can be estimated using the standard equation, which is based on the relationship between frequency (c/) and photon energy (Eg 1240/). The FTIR analyses were performed using a Perkin Elmer 2000 spectrometer (equipped with a cryogenic MCT detector) (Waltham, MA, USA).As for the analyses at increasing temperature, each sample, in the form of self-supporting pellet, was placed in an AABSPEC 2000 cell allowing to run the spectra in situ in controlled atmosphere and temperature.The samples were outgassed from room temperature up to 150 C. As for the measurements of CO 2 adsorption at room temperature, the samples were submitted to outgassing at r.t. for 1 h in order to remove water, that is, adsorbed at the surface due to the exposition to air.The spectrum of the sample before the inlet of CO 2 was subtracted from each spectrum, and all spectra were normalised with respect to the density of the pellets. The catalytic apparatus was reported in a previous work 16; however, in this paper two new experimental setups, such as the reactor geometry and the catalyst introduction, were used.In the former case a tubular borate glass fixed bed reactor (length 40 mm, diameter 4 mm) was exploited.The catalyst (400 mg) was introduced as small particles with size 0.2-0.3mm.In the latter case, the CO 2 photoreduction was performed using a borate glass thin film reactor (length 33 mm, height 18 mm, thickness 2 mm).Here, the catalyst (10 mg) was inserted by depositing the catalyst suspended in 2-propanol on the light-exposed side of the reactor.2-propanol can act as a hydrogen donor leading to data misinterpretation.To overcome this problem, drying at 110 C for 1 h was sufficient to eliminate all residues of CO 2 photoreduction. The samples were illuminated using a 125 W mercury UVA lamp (purchased from Helios Italquartz s.r.l (Cambiago, Italy).with emission range 315-400 shielded by a special tubular quartz, to select the 366 nm wavelength), with an average irradiance of 50 Wm -2 .It has been observed that irradiance in front of the reactor is the same as behind it; thus, it is possible to state that the reactor walls do not adsorb the light.In performed tests, neither heating nor cooling is used.UV lamp provides a stable and constant temperature of 40 C on the photocatalytic surface.Afterwards, a gaseous mixture of carbon dioxide and water has flown through the reactor.Compressed CO 2 (99.99) regulated by a mass flow controller was carried through a water bubbler kept at 40 C to generate CO 2 and H 2 O vapour mixture (13.3 CO 2 /H 2 O molar ratio).The reactor was closed when the system reached the equilibrium state, and this point was taken as the beginning of the reaction.Therefore, the reaction was not performed under a continuous gas flow, but it took place in static conditions.A total of 9.2 mol of CO 2 and 0.7 mol of H 2 O were present within the sealed reactor.In all catalytic tests, the reaction time was 6 h. The reaction products were analyzed by a gas chromatograph (HP G1540A) equipped with a Porapak Q column and a TCD detector.Activity results are expressed in turn over numbers (TONs) in molg cat -1 , as commonly used in literature 102,103, with an average error of 10.Quantum yield () was calculated according to IUPAC recommendations 104, as reported in Equations ( 1) and (2). () required e -CH 4 (mol) incident photons (mol) 100 ( 1) where 8 is the number of required electrons for CO 2 reduction to CH 4 , Irr is the irradiance, t is reaction time, A is the illuminated area, radiation wavelength, N A is Avogadro's number, h is Planck's constant, and c is speed of light. The development of an efficient technology for carbon dioxide conversion into solar fuel relies on an integrated and interdisciplinary \"catalysis by design\" approach covering different expertise areas, such as fundamental science and applied engineering.In this paper, two main carbon dioxide photoreduction drawbacks, namely light harvesting and process selectivity, were investigated. Light harvesting was enormously implemented by reactor design; the choice of a thin film reactor enhanced methane enormously, leading to comparable results with those found in literature, despite considerably milder conditions, particularly in terms of irradiance. On the contrary, the material design was fundamental to developing an opportunely designed catalytic system to control the selectivity to the desired product, i.e., methane.Modification of electronic and surface properties allowed us to reach this goal.On one side, the enhanced charge separation observed for Au-TiO 2 seems to negatively affect the activity, resulting in a less negative CB, thus less efficient in CO 2 photoreduction. On the other side, CO 2 adsorption on the catalytic surface represents a critical step that still deserves as much attention as developing greener and highly active catalysts.The CuO-TiO 2 photocatalyst matches all these requirements, proving to be more active and selective than the Au-TiO 2 material.The reasons for the enhanced photoactivity could be related to the presence and the abundance of surface sites able to efficiently adsorb and react with the CO 2 reactant. Figure 1.Benchmark titania photocatalytic activity in fixed bed and thin film reactors. Figure 1.Benchmark titania photocatalytic activity in fixed bed and thin film reactors. Figure 2. Uncalcined titania TG/DTA analysis. Figure 2. Uncalcined titania TG/DTA analysis. Figure 3. Photoactivity tests in the CO2 photoreduction performed on unpromoted TiO2 (red columns) and commercial titania (blue columns). Figure 3. Photoactivity tests in the CO 2 photoreduction performed on unpromoted TiO 2 (red columns) and commercial titania (blue columns). Figure 4. N2 physisorption isotherms of unpromoted TiO2 (red curves) and commercial titania (blue curves). Figure 5. XRD patterns of unpromoted TiO2 (red curve) and commercial sample (blue curve). Figure 4. N 2 physisorption isotherms of unpromoted TiO 2 (red curves) and commercial titania (blue curves). Figure 4. N2 physisorption isotherms of unpromoted TiO2 (red curves) and commercial titania (blue curves). Figure 5. XRD patterns of unpromoted TiO2 (red curve) and commercial sample (blue curve).Figure 5. XRD patterns of unpromoted TiO 2 (red curve) and commercial sample (blue curve). Figure 5. XRD patterns of unpromoted TiO2 (red curve) and commercial sample (blue curve).Figure 5. XRD patterns of unpromoted TiO 2 (red curve) and commercial sample (blue curve). Figure 6.TPR analyses of CuO-TiO2 sample (green curve) and Au-TiO2 sample (violet curve). Figure 7. Diffuse reflectance UV-Vis-NIR spectra of the CuO-TiO2 (green curve) and Au-TiO2 (violet curve) photocatalysts.Inset: zoom of the spectra in the Vis-NIR region. Figure 6.TPR analyses of CuO-TiO 2 sample (green curve) and Au-TiO 2 sample (violet curve). Figure 6.TPR analyses of CuO-TiO2 sample (green curve) and Au-TiO2 sample (violet curve). Figure 7. Diffuse reflectance UV-Vis-NIR spectra of the CuO-TiO2 (green curve) and Au-TiO2 (violet curve) photocatalysts.Inset: zoom of the spectra in the Vis-NIR region. Figure 7. Diffuse reflectance UV-Vis-NIR spectra of the CuO-TiO 2 (green curve) and Au-TiO 2 (violet curve) photocatalysts.Inset: zoom of the spectra in the Vis-NIR region. Figure 8. Photoactivity tests in the CO2 photoreduction performed on unpromoted TiO2 (red columns), CuO-TiO2 (green columns), and Au-TiO2 (violet columns) catalysts. Figure 8. Photoactivity tests in the CO 2 photoreduction performed on unpromoted TiO 2 (red columns), CuO-TiO 2 (green columns), and Au-TiO 2 (violet columns) catalysts. Figure 9. FTIR absorbance spectra of CuO-TiO2 (a) and Au-TiO2 (b) in air (olive/purple curves), under 10 min (fine green/pink curves) and 30 min (bold green/pink curves) outgassing at r.t., at 80 C (cyan/wine curves), at 100 C (dark cyan/wine curves), at 120 C (dark grey curves), and at 150 C (light grey curves). Figure 10.Comparison among the normalised FTIR absorbance spectra of CuO-TiO2 (green curves) and Au-TiO2 (violet curves) reported in Figure 8. Spectra normalised to the pellet density. Figure 10.Comparison among the normalised FTIR absorbance spectra of CuO-TiO 2 (green curves) and Au-TiO 2 (violet curves) reported in Figure 8. Spectra normalised to the pellet density. Interaction with CO 2 at Room Temperature: Surface Reactivity Figure 11.(a) FTIR difference spectra collected on CuO-TiO2 (green curves) and Au-TiO2 (violet curves) after the inlet of 15 mbar CO2 at r.t.(bold curves) and subsequent outgassing at the same temperature for 30 min (fine curves).(b) Zoom on the 2450-2250 cm -1 spectral range in which the spectra collected at decreasing CO2 pressure and under outgassing at r.t.(fine curves).(c) Zoom on the 1800-1000 cm -1 spectral range. Figure 11.(a) FTIR difference spectra collected on CuO-TiO 2 (green curves) and Au-TiO 2 (violet curves) after the inlet of 15 mbar CO 2 at r.t.(bold curves) and subsequent outgassing at the same temperature for 30 min (fine curves).(b) Zoom on the 2450-2250 cm -1 spectral range in which the spectra collected at decreasing CO 2 pressure and under outgassing at r.t.(fine curves).(c) Zoom on the 1800-1000 cm -1 spectral range. Specific Surface Areas of the examined photocatalysts obtained by N 2 physisorption analyses. The authors thank Tania Fantinel (Ca' Foscari University of Venice) for the excellent technical assistance.The financial support of Regione Veneto (project number: 2120/10/2121/2015) is gratefully acknowledged.DRS and FTIR analyses and provided data elaboration.G.C. contributed with XRD characterization.M.S., A.O., E.G., and M.M. wrote the manuscript. Author Contributions: M.S. and A.O. conceived and designed the experiments.E.G. conceived materials synthesis formulation and performed physisorption analyses.P.P. performed the experiments.M.M. performed The authors declare no conflict of interest.The founding sponsors had no role in the design of the study; in the collection, analyses, or interpretation of data; in the writing of the manuscript; or in the decision to publish the results."}, {"title": "Results_and_discussion", "content": "All reaction configurations found in the literature for a gas phase reaction were considered.In particular, in fixed bed reactors 66, which are the simplest systems, only a small fraction of the photocatalyst is activated by light, decreasing the effectiveness of the whole process.The use of honeycomb monolyths 67 and optical fibres could solve the problem, though narrowness of cells would limit the light transfer and the mass transport of reagents/products to/from the active sites.An appealing alternative is the impregnation of the photocatalyst on a moist quartz wool 68, as reported by Bazzo and Urawaka 69.However, in this case, the amount of water in the gas phase is not controlled, leading to differences in the CO 2 /H 2 O ratio calculations. Therefore, to boost the titania effectiveness in the CO 2 conversion, a new thin film reactor was developed.In literature, there are some examples, which are still not optimal for light exploitation.For example, in the work by Fang and co-workers 70, the catalyst is spread as a paste onto reactor's bottom; in this way, reported reactor configuration implies light scattering through reactor and photons loss. In this work, the photocatalyst was coated directly on the reactor surface, which is directly irradiated, thus avoiding light absorption from reaction medium, which usually happens in reported thin film reactors 46,71.This option allowed us to reduce the amount of catalyst from 400 mg to 10 mg and, most importantly, to expose all the employed catalyst to incident light; in this way, the catalyst is more prone to provide the photocatalytic effect.Moreover, diffusion problems detected in previous works were avoided. Before photocatalytic tests, blank tests were performed to avoid traces of organic species that might lead to bias in results collection and interpretation, and thus to misleading results 72.In materials formulation, all metalorganic precursors were avoided and only inorganic salts were used; sulphates and chlorides spare ions were eliminated by washing, whilst nitrates were decomposed during calcination.However, to verify the absence of carbonaceous species possibly deriving from manipulation, several blank tests were performed without light, a catalyst, or reactants.In all of the three cases, no hydrocarbons were detected in reaction mixture.In addition to that, a test with catalyst, light, and water (so without CO 2 only) was performed and no C-based product was detected, confirming the absence of carbonaceous species on the surface.From these evidences, it is established that this is not a photochemical process, but a photocatalytic reaction.Moreover, catalysts are C-free and photostable, proving catalyst results significance. In Figure 1, the comparison between the photoactivity obtained either with the fixed bed reactor or with the thin film reactor is reported.For these tests, a commercial titanium dioxide materials was used as a benchmark catalyst.It is clear that methane formation increases enormously (from 0.03 mol g cat -1 to 14.00 mol g cat -1 ) when using a thin film reactor; this means that there are three orders of magnitude of difference between the photocatalytic performances of the same catalyst in the same experimental conditions, but in the presence of the two different photocatalytic setups.Obtained data are in line with those generally reported in literature, if not higher.However, a quantitative comparison with literature data is very challenging, since it is affected by differences in reaction conditions (such as phase, temperature, pressure, irradiance, reagents ratio, catalysts, etcetera) leading to misinterpretations.For example, Camarillo et al. recently reported a methane formation of 0.172 mol g cat -1 h -1 using a Pt/TiO 2 catalyst 73,74, while Tan and co-workers reported a miximum 3.14 mol g cat -1 after eight hour reactions with graphene oxide-modified TiO 2 75, and Ola and Maroto-Valer reached 4.87 mol g cat -1 by means of a V-TiO 2 photocatalyst 76. Compared to cited works, reaction conditions here are considerably milder, particularly in terms of irradiance; in fact, they are in cited paper irradiance ranges from 500 to 3000 Wm -2 , whilst here irradiance is 50 Wm -2 .Therefore it is possible to obtain similar results minimising the primary energy input. Catalysts 2018, 8, x FOR PEER REVIEW 4 of 22 leading to misinterpretations.For example, Camarillo et al. recently reported a methane formation of 0.172 mol gcat -1 h -1 using a Pt/TiO2 catalyst 73,74, while Tan and co-workers reported a miximum 3.14 mol gcat -1 after eight hour reactions with graphene oxide-modified TiO2 75, and Ola and Maroto-Valer reached 4.87 mol gcat -1 by means of a V-TiO2 photocatalyst 76. Compared to cited works, reaction conditions here are considerably milder, particularly in terms of irradiance; in fact, they are in cited paper irradiance ranges from 500 to 3000 Wm -2 , whilst here irradiance is 50 Wm -2 .Therefore it is possible to obtain similar results minimising the primary energy input.Reported photocatalytic tests were performed in static conditions and for a relatively long time (6 h); therefore, it can be easily supposed that, in this case, thermodynamically favoured products are more likely to be formed than kinetic-favoured ones.As a matter of fact, methane formation, which, on one hand, requires the highest amount of photoexcited electrons, is, on the other hand, the most probable event compared to the conversion to CO, HCHO, and methanol.Oxygen is always observed as a co-product, but its productivity is not reported, since it is affected by retention in oxygen vacancies within titania lattice 77. It is worth noting that this result cannot be ascribed to the different amount of catalyst employed for each test.Indeed, the small amount of catalyst and the use of a thin film promote the adsorption of reagents on the active sites, as well as the product desorption.These steps need to be as fast as possible to make catalytic sites available for new carbon dioxide molecules to adsorb again.This means that within the thin film reactor the mass transport is facilitated compared to the fixed bed reactor, hence making products desorption easier and, as a consequence, their subsequent collection as well.To sustain this statement, light harvesting is more efficient on thin film deposited catalyst; as a matter of fact, in this case quantum yield is 0.11 to 2.31 10 -4 . Finally, the photoactivity was so low when using the fixed bed reactor that no other product was observed.On the contrary, the increased photoefficiency in the case of the thin film reactor would allow to observe any other products, namely hydrogen.Such a molecule comes from the water splitting, that is, a side reaction that might occur under the same experimental conditions.Reported photocatalytic tests were performed in static conditions and for a relatively long time (6 h); therefore, it can be easily supposed that, in this case, thermodynamically favoured products are more likely to be formed than kinetic-favoured ones.As a matter of fact, methane formation, which, on one hand, requires the highest amount of photoexcited electrons, is, on the other hand, the most probable event compared to the conversion to CO, HCHO, and methanol.Oxygen is always observed as a co-product, but its productivity is not reported, since it is affected by retention in oxygen vacancies within titania lattice 77. It is worth noting that this result cannot be ascribed to the different amount of catalyst employed for each test.Indeed, the small amount of catalyst and the use of a thin film promote the adsorption of reagents on the active sites, as well as the product desorption.These steps need to be as fast as possible to make catalytic sites available for new carbon dioxide molecules to adsorb again.This means that within the thin film reactor the mass transport is facilitated compared to the fixed bed reactor, hence making products desorption easier and, as a consequence, their subsequent collection as well.To sustain this statement, light harvesting is more efficient on thin film deposited catalyst; as a matter of fact, in this case quantum yield is 0.11 to 2.31 10 -4 . Finally, the photoactivity was so low when using the fixed bed reactor that no other product was observed.On the contrary, the increased photoefficiency in the case of the thin film reactor would allow to observe any other products, namely hydrogen.Such a molecule comes from the water splitting, that is, a side reaction that might occur under the same experimental conditions. Preliminary to the investigation on the effect of the dopants, the morphological properties and photocatalytic activity of the unpromoted titania sample were studied. In order to obtain efficient photocatalysts, the titania crystalline phase is an important parameter and anatase phase is highly suitable 78.Aimed at finding the optimal calcination temperature to obtain TiO 2 in the anatase form, TG/DTA analysis was performed on the uncalcined sample.The results are reported in Figure 2. Catalysts 2018, 8, x FOR PEER REVIEW 5 of 22 Preliminary to the investigation on the effect of the dopants, the morphological properties and photocatalytic activity of the unpromoted titania sample were studied. In order to obtain efficient photocatalysts, the titania crystalline phase is an important parameter and anatase phase is highly suitable 78.Aimed at finding the optimal calcination temperature to obtain TiO2 in the anatase form, TG/DTA analysis was performed on the uncalcined sample.The results are reported in Figure 2. According to the TG curve, the weight loss takes place in a single stage from 60 C to 400 C.The endothermic peak centred at 120 C can be attributed to the loss of water.Moreover, an exothermic process without any weight loss is observed between 400 C and 600 C.In agreement with literature data 79, this process can be ascribed to the phase transition from amorphous to crystalline titania in the anatase phase.In addition to that, from TG/DTA analysis, no other process exists due to impurities degradation.In fact, only inorganic salts were used in samples preparation, and sulphate spare ions were eliminated completely. Considering the TG/DTA results, it was proposed that the calcination at 400 C could be an optimal compromise to retain relative high surface area of titania and, at the same time, to assure the transition from amorphous titania to crystalline anatase phase. The calcined unpromoted titania sample was then tested in the CO2 photoreduction.The results are reported in Figure 3, in which the comparison with those obtained for the commercial titania reference is shown.According to the TG curve, the weight loss takes place in a single stage from 60 C to 400 C. The endothermic peak centred at 120 C can be attributed to the loss of water.Moreover, an exothermic process without any weight loss is observed between 400 C and 600 C. In agreement with literature data 79, this process can be ascribed to the phase transition from amorphous to crystalline titania in the anatase phase.In addition to that, from TG/DTA analysis, no other process exists due to impurities degradation.In fact, only inorganic salts were used in samples preparation, and sulphate spare ions were eliminated completely. Considering the TG/DTA results, it was proposed that the calcination at 400 C could be an optimal compromise to retain relative high surface area of titania and, at the same time, to assure the transition from amorphous titania to crystalline anatase phase. The calcined unpromoted titania sample was then tested in the CO 2 photoreduction.The results are reported in Figure 3, in which the comparison with those obtained for the commercial titania reference is shown.First of all, it was observed that in the presence of both catalysts the only detected products are methane and hydrogen; the former derives from the CO2 photoreduction and the latter comes from the water splitting.Moreover, the product distribution is definitely shifted towards methane; as a matter of fact, selectivity to methane is 95 for both samples.This can be explained by remembering proposed reaction mechanism in gas phase in similar conditions 80; by combining experimental data with spectroscopic evidences from literature, it was hypothesised that fast deoxygenation drives selectivity towards methane, thus avoiding the production of oxygentated compounds.However, in literature several reaction mechanisms for methane and oxygen formation from carbon dioxide and water are reported, which means that stoichiometry for this process has not been unanimously established yet and non-stoichiometric reaction cannot be excluded. Interestingly, the unpromoted titania sample provides a considerably higher productivity towards methane than the commercial titania (20.00 molCH4gcat -1 by TiO2 sample vs. 14.00 molCH4gcat -1 by reference material), whereas the difference in hydrogen productivity is small (1.05 molH2gcat -1 by TiO2 sample vs. 0.88 molH2gcat -1 by reference material). Both methane and hydrogen yields are comparable to, if not higher than, those found in the literature, though the reaction conditions adopted within this study are considerably milder.In particular, either carbon dioxide pressure or irradiance is considerably lower than those reported in most of literature, in which the photon energetic input was extremely high 9,81,82. Therefore, in order to understand the different behaviours observed in the reactivity tests and to establish structure-activity relationships, a deep physicochemical characterisation was performed. The first investigated parameters were the specific surface area and the pore volume, crucial features for every heterogeneous catalyst 41.The surface properties have been examined by means of nitrogen physisorption, and the obtained absorption/desorption isotherms are reported in Figure 4. First of all, it was observed that in the presence of both catalysts the only detected products are methane and hydrogen; the former derives from the CO 2 photoreduction and the latter comes from the water splitting.Moreover, the product distribution is definitely shifted towards methane; as a matter of fact, selectivity to methane is 95 for both samples.This can be explained by remembering proposed reaction mechanism in gas phase in similar conditions 80; by combining experimental data with spectroscopic evidences from literature, it was hypothesised that fast deoxygenation drives selectivity towards methane, thus avoiding the production of oxygentated compounds.However, in literature several reaction mechanisms for methane and oxygen formation from carbon dioxide and water are reported, which means that stoichiometry for this process has not been unanimously established yet and non-stoichiometric reaction cannot be excluded. Interestingly, the unpromoted titania sample provides a considerably higher productivity towards methane than the commercial titania (20.00 mol CH4 g cat -1 by TiO 2 sample vs. 14.00 mol CH4 g cat -1 by reference material), whereas the difference in hydrogen productivity is small (1.05 mol H2 g cat -1 by TiO 2 sample vs. 0.88 mol H2 g cat -1 by reference material). Both methane and hydrogen yields are comparable to, if not higher than, those found in the literature, though the reaction conditions adopted within this study are considerably milder.In particular, either carbon dioxide pressure or irradiance is considerably lower than those reported in most of literature, in which the photon energetic input was extremely high 9,81,82. Therefore, in order to understand the different behaviours observed in the reactivity tests and to establish structure-activity relationships, a deep physicochemical characterisation was performed. The first investigated parameters were the specific surface area and the pore volume, crucial features for every heterogeneous catalyst 41.The surface properties have been examined by means of nitrogen physisorption, and the obtained absorption/desorption isotherms are reported in Figure 4.The unpromoted TiO2 sample shows a type IV isotherm typical of mesoporous materials.The hysteresis loop is shifted towards high relative pressures (between 0.8 and 1 p/p0), indicating a narrow distribution of pores that is centred on 25 nm.The isotherm curves related to commercial titania are different, since they are characterized by a higher nitrogen adsorption at low relative pressures and a wider hysteresis loop, corresponding to a wider and non-homogeneous pore size distribution if compared to unpromoted TiO2.Moreover, the commercial sample provides a higher surface area (217 m 2 g -1 ) than the synthesised sample (110 m 2 g -1 ).The comparison between the obtained specific surface areas and the photoactivity indicated that the commercial sample, despite possessing the highest surface area, shows the lowest photocatalytic activity.These findings suggested that a high surface area is not a crucial parameter in the adopted reaction conditions. Then, both crystallinity and crystal phase of the examined samples were studied by XRD analysis.The results are shown in Figure 5.The unpromoted TiO 2 sample shows a type IV isotherm typical of mesoporous materials.The hysteresis loop is shifted towards high relative pressures (between 0.8 and 1 p/p 0 ), indicating a narrow distribution of pores that is centred on 25 nm.The isotherm curves related to commercial titania are different, since they are characterized by a higher nitrogen adsorption at low relative pressures and a wider hysteresis loop, corresponding to a wider and non-homogeneous pore size distribution if compared to unpromoted TiO 2 .Moreover, the commercial sample provides a higher surface area (217 m 2 g -1 ) than the synthesised sample (110 m 2 g -1 ).The comparison between the obtained specific surface areas and the photoactivity indicated that the commercial sample, despite possessing the highest surface area, shows the lowest photocatalytic activity.These findings suggested that a high surface area is not a crucial parameter in the adopted reaction conditions. Then, both crystallinity and crystal phase of the examined samples were studied by XRD analysis.The results are shown in Figure 5.The unpromoted TiO2 sample shows a type IV isotherm typical of mesoporous materials.The hysteresis loop is shifted towards high relative pressures (between 0.8 and 1 p/p0), indicating a narrow distribution of pores that is centred on 25 nm.The isotherm curves related to commercial titania are different, since they are characterized by a higher nitrogen adsorption at low relative pressures and a wider hysteresis loop, corresponding to a wider and non-homogeneous pore size distribution if compared to unpromoted TiO2.Moreover, the commercial sample provides a higher surface area (217 m 2 g -1 ) than the synthesised sample (110 m 2 g -1 ).The comparison between the obtained specific surface areas and the photoactivity indicated that the commercial sample, despite possessing the highest surface area, shows the lowest photocatalytic activity.These findings suggested that a high surface area is not a crucial parameter in the adopted reaction conditions. Then, both crystallinity and crystal phase of the examined samples were studied by XRD analysis.The results are shown in Figure 5.In both cases, the observed crystalline phase was anatase, i.e., the most suitable phase for photocatalytic purposes, as previously discussed 38.The diffraction peaks related to the commercial sample are wider and less defined than those of the unpromoted TiO 2 photocatalyst.Such feature is an indication that the commercial sample is made of titania nanoparticles smaller than those present in the TiO 2 sample, in agreement with the N 2 physisorption measurements which provided a surface area (217 m 2 g -1 ) for the commercial sample higher than that of the synthesised TiO 2 sample (110 m 2 g -1 ). In addition, the different width and magnitude of the XRD peaks could also point out that a large fraction of the commercial sample is mainly made up of amorphous titania, and that present anatase crystals are smaller in size compared to lab-made TiO 2 .Indeed, the commercial titania purchaser stated that only 40 wt. of the reference material is crystalline and in the anatase phase, whilst it was found that in the unpromoted TiO 2 the anatase phase is more than 95 wt. of the sample and only a small fraction is amorphous.Therefore, the XRD evidences, along with the catalytic results (showed in Figure 3), suggest that the sample crystallinity affects the CO 2 photoreduction activity, whereas it has no influence on the selectivity. In order to further improve the effectiveness of the titania photocatalyst, two different promoters, i.e., CuO and Au, were introduced into the TiO 2 sample.In particular, the same amount (0.2 wt. on metal base) of promoter was added, as confirmed by the FAAS analysis.Due to such low amount, the promoters were not detected by XRD analysis, and it was found that the addition of the promoter has a negligible effect on the specific surface area, as demonstrated by N 2 physisorption results reported in Table 1.The nature of the promoters was then investigated, and TPR analyses were resorted to in order to have information on the oxidation state of copper and gold after insertion into the TiO 2 sample. TPR measurements revealed that copper is present as Cu(II), due to a single hydrogen consumption at 180 C ascribable to Cu(II) reduction to Cu(0) (Figure 6, green curve), whereas gold is in its ground state, since no hydrogen consumption was observed (violet curve in the same figure). The diffuse reflectance UV-Vis-NIR spectra of the CuO-TiO 2 (green curve) and Au-TiO 2 (violet curve) photocatalysts are shown in Figure 7.The presence of the promoters does not seem to modify the titania electronic properties, since the absorption in the UV region was comparable, and no significant modification in the band gap value was observed; a value corresponding to 3.2 eV (orange point in the inset of Figure 7), which is the typical value for titania in the anatase form, was obtained in both cases.On the contrary, some differences were observed in the Vis-NIR region, as shown in the inset of Figure 7.In particular, a broad absorption centred at 18,250 cm -1 , and due to the plasmonic resonance of gold nanoparticles 83,84, was observed for the Au-TiO2 sample.Differently, a weak absorption centred at 12,000 cm -1 , assigned to d-d transition in Cu(II) species, was detected and ascribed to the presence of copper oxide nanoparticles 85,86 on the CuO-TiO2 photocatalyst.Even if the presence of the promoters did not affect the titania band gap value, the presence of such species is aimed at reducing the electron-hole recombination by modifying the interaction between the titania surface and light.The presence of the promoters does not seem to modify the titania electronic properties, since the absorption in the UV region was comparable, and no significant modification in the band gap value was observed; a value corresponding to 3.2 eV (orange point in the inset of Figure 7), which is the typical value for titania in the anatase form, was obtained in both cases.On the contrary, some differences were observed in the Vis-NIR region, as shown in the inset of Figure 7.In particular, a broad absorption centred at 18,250 cm -1 , and due to the plasmonic resonance of gold nanoparticles 83,84, was observed for the Au-TiO2 sample.Differently, a weak absorption centred at 12,000 cm -1 , assigned to d-d transition in Cu(II) species, was detected and ascribed to the presence of copper oxide nanoparticles 85,86 on the CuO-TiO2 photocatalyst.Even if the presence of the promoters did not affect the titania band gap value, the presence of such species is aimed at reducing the electron-hole recombination by modifying the interaction between the titania surface and light.The presence of the promoters does not seem to modify the titania electronic properties, since the absorption in the UV region was comparable, and no significant modification in the band gap value was observed; a value corresponding to 3.2 eV (orange point in the inset of Figure 7), which is the typical value for titania in the anatase form, was obtained in both cases.On the contrary, some differences were observed in the Vis-NIR region, as shown in the inset of Figure 7.In particular, a broad absorption centred at 18,250 cm -1 , and due to the plasmonic resonance of gold nanoparticles 83,84, was observed for the Au-TiO 2 sample.Differently, a weak absorption centred at 12,000 cm -1 , assigned to d-d transition in Cu(II) species, was detected and ascribed to the presence of copper oxide nanoparticles 85,86 on the CuO-TiO 2 photocatalyst.Even if the presence of the promoters did not affect the titania band gap value, the presence of such species is aimed at reducing the electron-hole recombination by modifying the interaction between the titania surface and light. After having considered the chemical nature of the promoters, the Au-TiO 2 and the CuO-TiO 2 samples were tested in the CO 2 photoreduction.The results are reported in Figure 8 with those already obtained for the unpromoted TiO 2 sample. After having considered the chemical nature of the promoters, the Au-TiO2 and the CuO-TiO2 samples were tested in the CO2 photoreduction.The results are reported in Figure 8 with those already obtained for the unpromoted TiO2 sample.As previously observed for the TiO2 photocatalysts (Figure 3), the selectivity as for the nature of the formed species did not vary upon the promoter insertion, since the detected products were methane and hydrogen also in this case.However, the presence of CuO and Au promoters influenced the activity, as well as the selectivity, in the CO2 photoreduction.In particular, if compared to the undoped sample, the promotion by CuO slightly increased the catalyst photoactivity toward the formation of methane (from 20.00 to 23.00 molCH4gcat -1 ) and, at the same time, it suppressed the hydrogen production by water splitting.Indeed, the selectivity to methane increased from 95 for the undoped TiO2 sample to 98 for the CuO-TiO2 sample.Differently, the sample containing Au nanoparticles gave the lowest methane production (15.00 molCH4gcat -1 ), whereas the production of hydrogen was considerably higher (10.00 molH2gcat -1 ), leading to a 60 selectivity to methane.Considering light harvesting for CO2 photoreduction, copper introduction increases quantum yield from 4.75 10 -4 for the undoped sample to 5.48 10 -4 for CuO-TiO2 sample, whilst it decreases to 3.56 10 -4 for Au-TiO2 sample. The above results demonstrated that the introduction of CuO on the TiO2 catalyst favoured the CO2 photoreduction and, on the contrary, the presence of Au nanoparticles increased the activity in the water splitting reaction.It must be considered that the reaction takes place only if the interaction between carbon dioxide and water occurs at the photoexcited catalytic surface 23.Therefore, if only water is adsorbed at the surface, only water splitting reaction happens, since the CO2 molecule is more difficultly adsorbed than water on the surface of titania 87.To overcome this issue, the reaction has been performed in the presence of large excess of CO2 (CO2/H2O molar ratio was 13.3), even though the water splitting reaction was not completely suppressed.The catalytic data indicate that the introduction of gold nanoparticles on the TiO2 surface seems to increase the hydrophilicity of the photocatalyst and, as a consequence, the capability of Au-TiO2 to adsorb CO2 was diminished.Carneiro et al. reported that gold nanoparticles are able to modify hydroxyl group's population on titania 88.Hence, it can be proposed that the different surface properties of CuO-TiO2 and Au-TiO2 play a key role in the reaction, as revealed by the different photocatalytic behaviour displayed by the two photocatalysts.As previously observed for the TiO 2 photocatalysts (Figure 3), the selectivity as for the nature of the formed species did not vary upon the promoter insertion, since the detected products were methane and hydrogen also in this case.However, the presence of CuO and Au promoters influenced the activity, as well as the selectivity, in the CO 2 photoreduction.In particular, if compared to the undoped sample, the promotion by CuO slightly increased the catalyst photoactivity toward the formation of methane (from 20.00 to 23.00 mol CH4 g cat -1 ) and, at the same time, it suppressed the hydrogen production by water splitting.Indeed, the selectivity to methane increased from 95 for the undoped TiO 2 sample to 98 for the CuO-TiO 2 sample.Differently, the sample containing Au nanoparticles gave the lowest methane production (15.00 mol CH4 g cat -1 ), whereas the production of hydrogen was considerably higher (10.00 mol H2 g cat -1 ), leading to a 60 selectivity to methane.Considering light harvesting for CO 2 photoreduction, copper introduction increases quantum yield from 4.75 10 -4 for the undoped sample to 5.48 10 -4 for CuO-TiO 2 sample, whilst it decreases to 3.56 10 -4 for Au-TiO 2 sample. The above results demonstrated that the introduction of CuO on the TiO 2 catalyst favoured the CO 2 photoreduction and, on the contrary, the presence of Au nanoparticles increased the activity in the water splitting reaction.It must be considered that the reaction takes place only if the interaction between carbon dioxide and water occurs at the photoexcited catalytic surface 23.Therefore, if only water is adsorbed at the surface, only water splitting reaction happens, since the CO 2 molecule is more difficultly adsorbed than water on the surface of titania 87.To overcome this issue, the reaction has been performed in the presence of large excess of CO 2 (CO 2 /H 2 O molar ratio was 13.3), even though the water splitting reaction was not completely suppressed.The catalytic data indicate that the introduction of gold nanoparticles on the TiO 2 surface seems to increase the hydrophilicity of the photocatalyst and, as a consequence, the capability of Au-TiO 2 to adsorb CO 2 was diminished.Carneiro et al. reported that gold nanoparticles are able to modify hydroxyl group's population on titania 88.Hence, it can be proposed that the different surface properties of CuO-TiO 2 and Au-TiO 2 play a key role in the reaction, as revealed by the different photocatalytic behaviour displayed by the two photocatalysts. In order to explain the different behaviour displayed by the two promoted catalysts during the CO 2 photoreduction, FTIR measurement were performed on both CuO-TiO 2 and Au-TiO 2 samples. The FTIR absorbance spectra collected on CuO-TiO 2 and Au-TiO 2 samples upon outgassing from r.t. up to 150 C are reported in Figure 9.As specified in the experimental section, the spectra have been normalised to the density of the pellets.Therefore, the intensity of the absorption bands can be taken as a measure of the amount of adsorbed species and of their stability to the outgassing at increasing temperature on the two photocatalysts.The intense absorption centred at about 3400 cm -1 and the peak at 1632-1629 cm -1 observed on both CuO-TiO 2 and Au-TiO 2 are due to the stretching and bending modes, respectively, of OH groups related to the presence of adsorbed molecular water (navy curves).The largest fraction of such molecules is easily removed upon degassing the samples at r.t. for 30 min (bold blue curves); however, a monolayer of hydroxyl groups and water molecules is still present 89 and gradually decreases upon outgassing at increasing temperature, up to 150 C (red curves), as confirmed by the peak at 3673 (3671) cm -1 with a weak shoulder at 3721 (3718) cm -1 , due to the stretching mode of two types of free hydroxyl groups 90,91 (see the insets in Figure 9).These features give an idea of the behaviour of the catalyst at the surface during the CO 2 photoreduction, which is performed at room temperature in the presence of water.However, if compared with CuO-TiO 2 , the Au-TiO 2 photocatalyst possesses a more hydrophilic surface, since the intensity of the bands due to the presence of adsorbed water molecules is much higher than those related to carbonate species and observed at lower frequencies ( 1600 cm -1 ) that will be discussed in detail afterwards. In addition, a careful comparison among the spectra obtained on the two photocatalysts reveals, interestingly, that at frequencies lower than 2500 cm -1 , the addition of gold produced a modification in the spectra, ascribed to the erosion of an electronic absorption, and occurring at all the temperatures here considered (violet curves vs. green curves in Figure 10).It is worth noting that the appearance of an electronic absorption is related to the presence of free electrons in the titania CB; its erosion is the consequence of the population of new energetic levels created when gold nanoparticles are introduced.In this case, the Schottky barrier between the metal nanoparticles and the oxide hinders electron flow to TiO 2 , effectively behaving as an electron trap.This phenomenon is more pronounced in the case of Au-TiO 2 (violet curves) than in the case of CuO-TiO 2 (green curves), and it is also in agreement with the DRUV-Vis results that point out a small difference in the titania band gap of the two samples (see Figure 7, inset).Therefore, the above findings indicate that in the case of the gold-doped titania photocatalyst, a less negative potential for titania CB can be hypothesised, resulting in a less effective CO 2 reduction 8.Indeed, gold insertion modified the electronic circulation, but it has a detrimental effect on the activity and selectivity displayed by titania in the CO 2 photoreduction if compared to CuO-promoted titania.and Au-TiO2 (violet curves) reported in Figure 8. Spectra normalised to the pellet density. The adsorption of CO2 at r.t. was carried out on both samples with the aim of investigating the interaction between the reactant and the catalytic surfaces; the results are reported in Figure 11a.Before the analyses, the samples were simply outgassed from r.t. up to 150 C for 10 min, and then the temperature was decreased again to r.t.under outgassing.This procedure guaranteed to remove the large fraction of water molecules adsorbed at the surface, leaving only some residual of hydroxyl groups and adsorbed water molecules, as shown in Figure 11a.In addition, a number of bands are produced on the CuO-TiO2 (green curves) and Au-TiO2 (violet curves) photocatalysts in the 2400-2250 cm -1 and 1800-1000 cm -1 ranges (highlighted by dashed frames and enlarged in sections b and c, respectively) upon the inlet of 15 mbar CO2 at room temperature (bold curves). A quite asymmetric absorption with two components at 2345 and 2352 cm -1 , with a broad shoulder at about 2360 cm -1 , due to carbon dioxide molecules linearly adsorbed on Ti 4 sites, is observed (Figure 11b, bold curves), and it is gradually depleted when decreasing the CO2 pressure and after outgassing at r.t.(fine curves).The intensity of the absorption observed in the case of CuO-TiO2 (green curves) is higher than that related to Au-TiO2, pointing out a larger amount of linearly adsorbed CO2 formed on CuO-doped titania.Moreover, the shift of the u band of adsorbed CO2 molecules with respect to the gas phase (2343 cm -1 ) increases with the Lewis acid strength of the cationic sites 92.Therefore, the presence of two defined peaks indicates that the CO2 molecules are adsorbed on surface Ti 4 ions with different Lewis acid strength.At the same time, bands due to carbonate-like species produced by the reaction of linearly adsorbed CO2 with O2 -basic sites are produced (Figure 11c, bold curves) on both samples with different relative intensity.The production of carbonate-like species points out the presence of surface Ti 4 -O 2-couples in which the basic O atom is able to react with the C atom from CO2. Carbon dioxide bent form is more destabilised than the linearly adsorbed CO2 molecule, thus providing higher reactivity in CO2 photoreduction 48Error!Bookmark not defined..More in detail, bands at 1641, 1307, and 1032 cm -1 , and at 1572, 1366, and about 1045 cm -1 , are observed.These absorptions are assigned to two different (chelate and/or bridged) bidentate carbonate species 93.From these findings, it can be inferred that several kind of sites, i.e., those able to coordinate molecular CO2 and those producing bidentate carbonate species are present on the titania surface.All these sites are more abundant on CuO-TiO2 than on Au-TiO2.Moreover, on the CuO-TiO2 catalyst, the produced species are slightly more stable to the outgassing The adsorption of CO 2 at r.t. was carried out on both samples with the aim of investigating the interaction between the reactant and the catalytic surfaces; the results are reported in Figure 11a.Before the analyses, the samples were simply outgassed from r.t. up to 150 C for 10 min, and then the temperature was decreased again to r.t.under outgassing.This procedure guaranteed to remove the large fraction of water molecules adsorbed at the surface, leaving only some residual of hydroxyl groups and adsorbed water molecules, as shown in Figure 11a.In addition, a number of bands are produced on the CuO-TiO 2 (green curves) and Au-TiO 2 (violet curves) photocatalysts in the 2400-2250 cm -1 and 1800-1000 cm -1 ranges (highlighted by dashed frames and enlarged in sections b and c, respectively) upon the inlet of 15 mbar CO 2 at room temperature (bold curves). A quite asymmetric absorption with two components at 2345 and 2352 cm -1 , with a broad shoulder at about 2360 cm -1 , due to carbon dioxide molecules linearly adsorbed on Ti 4 sites, is observed (Figure 11b, bold curves), and it is gradually depleted when decreasing the CO 2 pressure and after outgassing at r.t.(fine curves).The intensity of the absorption observed in the case of CuO-TiO 2 (green curves) is higher than that related to Au-TiO 2 , pointing out a larger amount of linearly adsorbed CO 2 formed on CuO-doped titania.Moreover, the shift of the u band of adsorbed CO 2 molecules with respect to the gas phase (2343 cm -1 ) increases with the Lewis acid strength of the cationic sites 92.Therefore, the presence of two defined peaks indicates that the CO 2 molecules are adsorbed on surface Ti 4 ions with different Lewis acid strength.At the same time, bands due to carbonate-like species produced by the reaction of linearly adsorbed CO 2 with O 2 -basic sites are produced (Figure 11c, bold curves) on both samples with different relative intensity.The production of carbonate-like species points out the presence of surface Ti 4 -O 2-couples in which the basic O atom is able to react with the C atom from CO 2 .Carbon dioxide bent form is more destabilised than the linearly adsorbed CO 2 molecule, thus providing higher reactivity in CO 2 photoreduction 48.More in detail, bands at 1641, 1307, and 1032 cm -1 , and at 1572, 1366, and about 1045 cm -1 , are observed.These absorptions are assigned to two different (chelate and/or bridged) bidentate carbonate species 93.From these findings, it can be inferred that several kind of sites, i.e., those able to coordinate molecular CO 2 and those producing bidentate carbonate species are present on the titania surface.All these sites are more abundant on CuO-TiO 2 than on Au-TiO 2 .Moreover, on the CuO-TiO 2 catalyst, the produced species are slightly more stable to the outgassing at r.t.than on Au-TiO 2 , as revealed by the comparison between the initial intensity (bold curves) and final intensity (fine curves) of the bands related to each sample.Finally, bands at 1689, 1405, and 1202 cm -1 , with almost the same intensity for both samples, due to bicarbonate species produced by reaction of CO2 with some basic -OH groups, are observed 80,94.A component at about 1730 cm -1 , more evident in the case of Au-TiO2 and tentatively assigned to carboxylate species, is also detected 95. FTIR spectra of adsorbed CO2 definitely showed that the surface of the CuO-TiO2 photocatalyst is more efficient at absorbing and reacting to the molecule, resulting in a more valuable interaction between the CO2 molecules and the photocatalytic surface 49Error!Bookmark not defined.,which represents the first step of carbon dioxide photoreduction. From all the experimental findings, it is possible to state that surface properties affect reactants' adsorption (particularly for CO2, the least adsorbable reactant) and, as a consequence, materials' activity and selectivity in CO2 photoreduction.Finally, bands at 1689, 1405, and 1202 cm -1 , with almost the same intensity for both samples, due to bicarbonate species produced by reaction of CO 2 with some basic -OH groups, are observed 80,94.A component at about 1730 cm -1 , more evident in the case of Au-TiO 2 and tentatively assigned to carboxylate species, is also detected 95. FTIR spectra of adsorbed CO 2 definitely showed that the surface of the CuO-TiO 2 photocatalyst is more efficient at absorbing and reacting to the molecule, resulting in a more valuable interaction between the CO 2 molecules and the photocatalytic surface 49, which represents the first step of carbon dioxide photoreduction. From all the experimental findings, it is possible to state that surface properties affect reactants' adsorption (particularly for CO 2 , the least adsorbable reactant) and, as a consequence, materials' activity and selectivity in CO 2 photoreduction. The following reagents were used as received: TiOSO 4 xH 2 OyH 2 SO 4 (Ti assay 29 Sigma Aldrich, Milano, Italy), sodium hydroxide (assay 97 Carlo Erba, Milano, Italy) and Cu(NO 3 ) 2 3H 2 O (assay 99, Sigma-Aldrich, Milano, Italy), and 2-propanol (assay 99.8 Sigma-Aldrich, Milano, Italy).A standard TiO 2 reference material (MIRKAT 211) has been purchased by Euro Support s.r.o (Litvinov, Czech Republic).This commercial titania has been chosen as a reference material, since it possesses a large surface area (217 m 2 /g), and it is in the anatase form, i.e., the most suitable titania crystalline phase for photocatalytic applications, and it does not contain any trace of carbonaceous species. The precipitation method has been chosen to synthesise the titania samples.A 1.2 M titanyl sulphate solution and a 9.0 M NaOH solution have been added drop wise and simultaneously to 200 mL of distilled water under vigorous stirring, in order to keep a neutral pH.Then the Ti(OH) 4 suspension has been aged at 60 C for 20 h.Afterwards, the precipitated has been filtered and washed with distilled water to remove the sulphate ions.The absence of sulphates has been verified by means of the barium chloride test 96.The obtained wet Ti(OH) 4 has been dried overnight at 110 C and calcined at 400 C for 4 h in air flow to obtain TiO 2 .This sample has been labelled as TiO 2 . According to a previous work 16, the introduction of copper oxide into titania provides the highest effect on the photoactivity when the Cu amount is 0.2 wt..In particular, incipient wetness impregnation with a copper precursor, namely Cu(NO 3 ) 2 3H 2 O, has been performed on dried Ti(OH) 4 .Then, the copper-impregnated sample has been calcined at 400 C in air flow in order to obtain the CuO-TiO 2 photocatalyst. In this case, the incipient wetness method would not allow us to deposit small gold nanoparticles on the titania surface 97.Therefore, in order to obtain small gold nanoparticles, gold has been added to titania by using the deposition-precipitation (DP) method, thus maintaining the pH equal to 8.6 98.Titanium dioxide has been suspended in an aqueous solution of HAuCl 4 3H 2 O for 3 h, while controlling the pH value by the addition of NaOH (0.5 M).The Au amount was 0.2 wt., the same as in the case of the CuO-TiO 2 photocatalyst, for comparison purposes.After filtration, the samples have been washed with distilled water to remove chlorides.The absence of chlorides was verified by the silver nitrate test.The samples have been dried at 35 C overnight and finally calcined in air for 1 h at 400 C. The final sample has been labelled Au-TiO 2 . The thermal analyses (TG/DTA) have been performed on a NETZSCH STA 409 PC/PG Instrument (Bavaria, Germany) in air flux (20 mL/min) using a 10 C/min temperature rate between 25-800 C. X-ray Diffraction (XRD) patterns have been collected on a Bruker D8 Advance powder diffractometer with a sealed X-ray tube (copper anode; operating conditions, 40 kV and 40 mA) (Billerica, MA, USA) and a Si(Li) solid state detector (Sol-X) set to discriminate the Cu K radiation.Apertures of divergence, receiving, and detector slits were 2.0 mm, 2.0 mm, and 0.2 mm, respectively.Data scans have been performed in the 2 range 5-75 with 0.02 step size and counting times of 3 s/step.Quantitative phase analysis and crystallite size determination have been performed using the Rietveld method as implemented in the TOPAS v.4 program (Bruker AXS, Billerica, MA, USA) using the fundamental parameters approach for line-profile fitting.The determination of the crystallite size was accomplished by the Double-Voigt approach and calculated as volume-weighted mean column heights based on integral breadths of peaks. N 2 adsorption-desorption isotherms at 196 C were performed using a Micromeritics ASAP 2000 analyser (Norcross, GA, USA) to obtain information on the surface properties.All samples were previously outgassed at 200 C for 2 h.The mesopore volume was measured as the adsorbed amount of N 2 after capillary condensation.The surface area was evaluated using the standard BET 99 equation, and the pore size distribution was obtained using the BJH method applied to the isotherm desorption branch 100. The real amount of copper and gold in the promoted catalysts was determined by flame atomic absorption spectroscopy (FAAS) using a PerkinElmer Analyst 100 (Waltham, MA, USA). Temperature programmed reduction (TPR) experiments were carried out in a lab-made equipment; each sample (50 mg) was heated at 10 C/min from 25 C to 800 C in a 5 H 2 /Ar reducing mixture (40 mLmin -1 STP).The effluent gases were analysed by a Gow-Mac TCD detector (Bethlehem, PA, USA) using a magnesium perchlorate trap to stop H 2 O. Diffuse reflectance UV-Vis-NIR spectra were collected at r.t. on a Varian Cary 5000 spectrophotometer (Palo Alto, CA, USA) with an integrating sphere attachment using BaSO 4 powder as an internal reference, working in the 50,000-4000 cm -1 range.UV-Vis-NIR spectra of the as prepared samples are reported in the Kubelka reflectance of an \"infinitely thick\" layer of the sample 101.The layer of powder sample was made sufficiently thick such that all incident light was absorbed or scattered before reaching the back surface of the sample holder.Typically, a thickness of 1-3 mm was required. The samples in the form of powders were placed in a quartz cell, allowing treatments in controlled atmosphere and temperature.The band gap energy (Eg) of the catalysts was determined by the intercept of a linear fit to the absorption edge, and it can be estimated using the standard equation, which is based on the relationship between frequency (c/) and photon energy (Eg 1240/). The FTIR analyses were performed using a Perkin Elmer 2000 spectrometer (equipped with a cryogenic MCT detector) (Waltham, MA, USA).As for the analyses at increasing temperature, each sample, in the form of self-supporting pellet, was placed in an AABSPEC 2000 cell allowing to run the spectra in situ in controlled atmosphere and temperature.The samples were outgassed from room temperature up to 150 C. As for the measurements of CO 2 adsorption at room temperature, the samples were submitted to outgassing at r.t. for 1 h in order to remove water, that is, adsorbed at the surface due to the exposition to air.The spectrum of the sample before the inlet of CO 2 was subtracted from each spectrum, and all spectra were normalised with respect to the density of the pellets. The catalytic apparatus was reported in a previous work 16; however, in this paper two new experimental setups, such as the reactor geometry and the catalyst introduction, were used.In the former case a tubular borate glass fixed bed reactor (length 40 mm, diameter 4 mm) was exploited.The catalyst (400 mg) was introduced as small particles with size 0.2-0.3mm.In the latter case, the CO 2 photoreduction was performed using a borate glass thin film reactor (length 33 mm, height 18 mm, thickness 2 mm).Here, the catalyst (10 mg) was inserted by depositing the catalyst suspended in 2-propanol on the light-exposed side of the reactor.2-propanol can act as a hydrogen donor leading to data misinterpretation.To overcome this problem, drying at 110 C for 1 h was sufficient to eliminate all residues of CO 2 photoreduction. The samples were illuminated using a 125 W mercury UVA lamp (purchased from Helios Italquartz s.r.l (Cambiago, Italy).with emission range 315-400 shielded by a special tubular quartz, to select the 366 nm wavelength), with an average irradiance of 50 Wm -2 .It has been observed that irradiance in front of the reactor is the same as behind it; thus, it is possible to state that the reactor walls do not adsorb the light.In performed tests, neither heating nor cooling is used.UV lamp provides a stable and constant temperature of 40 C on the photocatalytic surface.Afterwards, a gaseous mixture of carbon dioxide and water has flown through the reactor.Compressed CO 2 (99.99) regulated by a mass flow controller was carried through a water bubbler kept at 40 C to generate CO 2 and H 2 O vapour mixture (13.3 CO 2 /H 2 O molar ratio).The reactor was closed when the system reached the equilibrium state, and this point was taken as the beginning of the reaction.Therefore, the reaction was not performed under a continuous gas flow, but it took place in static conditions.A total of 9.2 mol of CO 2 and 0.7 mol of H 2 O were present within the sealed reactor.In all catalytic tests, the reaction time was 6 h. The reaction products were analyzed by a gas chromatograph (HP G1540A) equipped with a Porapak Q column and a TCD detector.Activity results are expressed in turn over numbers (TONs) in molg cat -1 , as commonly used in literature 102,103, with an average error of 10.Quantum yield () was calculated according to IUPAC recommendations 104, as reported in Equations ( 1) and (2). () required e -CH 4 (mol) incident photons (mol) 100 ( 1) where 8 is the number of required electrons for CO 2 reduction to CH 4 , Irr is the irradiance, t is reaction time, A is the illuminated area, radiation wavelength, N A is Avogadro's number, h is Planck's constant, and c is speed of light."}, {"title": "Conclusions", "content": "The development of an efficient technology for carbon dioxide conversion into solar fuel relies on an integrated and interdisciplinary \"catalysis by design\" approach covering different expertise areas, such as fundamental science and applied engineering.In this paper, two main carbon dioxide photoreduction drawbacks, namely light harvesting and process selectivity, were investigated. Light harvesting was enormously implemented by reactor design; the choice of a thin film reactor enhanced methane enormously, leading to comparable results with those found in literature, despite considerably milder conditions, particularly in terms of irradiance. On the contrary, the material design was fundamental to developing an opportunely designed catalytic system to control the selectivity to the desired product, i.e., methane.Modification of electronic and surface properties allowed us to reach this goal.On one side, the enhanced charge separation observed for Au-TiO 2 seems to negatively affect the activity, resulting in a less negative CB, thus less efficient in CO 2 photoreduction. On the other side, CO 2 adsorption on the catalytic surface represents a critical step that still deserves as much attention as developing greener and highly active catalysts.The CuO-TiO 2 photocatalyst matches all these requirements, proving to be more active and selective than the Au-TiO 2 material.The reasons for the enhanced photoactivity could be related to the presence and the abundance of surface sites able to efficiently adsorb and react with the CO 2 reactant. Figure 1.Benchmark titania photocatalytic activity in fixed bed and thin film reactors. Figure 1.Benchmark titania photocatalytic activity in fixed bed and thin film reactors. Figure 2. Uncalcined titania TG/DTA analysis. Figure 2. Uncalcined titania TG/DTA analysis. Figure 3. Photoactivity tests in the CO2 photoreduction performed on unpromoted TiO2 (red columns) and commercial titania (blue columns). Figure 3. Photoactivity tests in the CO 2 photoreduction performed on unpromoted TiO 2 (red columns) and commercial titania (blue columns). Figure 4. N2 physisorption isotherms of unpromoted TiO2 (red curves) and commercial titania (blue curves). Figure 5. XRD patterns of unpromoted TiO2 (red curve) and commercial sample (blue curve). Figure 4. N 2 physisorption isotherms of unpromoted TiO 2 (red curves) and commercial titania (blue curves). Figure 4. N2 physisorption isotherms of unpromoted TiO2 (red curves) and commercial titania (blue curves). Figure 5. XRD patterns of unpromoted TiO2 (red curve) and commercial sample (blue curve).Figure 5. XRD patterns of unpromoted TiO 2 (red curve) and commercial sample (blue curve). Figure 5. XRD patterns of unpromoted TiO2 (red curve) and commercial sample (blue curve).Figure 5. XRD patterns of unpromoted TiO 2 (red curve) and commercial sample (blue curve). Figure 6.TPR analyses of CuO-TiO2 sample (green curve) and Au-TiO2 sample (violet curve). Figure 7. Diffuse reflectance UV-Vis-NIR spectra of the CuO-TiO2 (green curve) and Au-TiO2 (violet curve) photocatalysts.Inset: zoom of the spectra in the Vis-NIR region. Figure 6.TPR analyses of CuO-TiO 2 sample (green curve) and Au-TiO 2 sample (violet curve). Figure 6.TPR analyses of CuO-TiO2 sample (green curve) and Au-TiO2 sample (violet curve). Figure 7. Diffuse reflectance UV-Vis-NIR spectra of the CuO-TiO2 (green curve) and Au-TiO2 (violet curve) photocatalysts.Inset: zoom of the spectra in the Vis-NIR region. Figure 7. Diffuse reflectance UV-Vis-NIR spectra of the CuO-TiO 2 (green curve) and Au-TiO 2 (violet curve) photocatalysts.Inset: zoom of the spectra in the Vis-NIR region. Figure 8. Photoactivity tests in the CO2 photoreduction performed on unpromoted TiO2 (red columns), CuO-TiO2 (green columns), and Au-TiO2 (violet columns) catalysts. Figure 8. Photoactivity tests in the CO 2 photoreduction performed on unpromoted TiO 2 (red columns), CuO-TiO 2 (green columns), and Au-TiO 2 (violet columns) catalysts. Figure 9. FTIR absorbance spectra of CuO-TiO2 (a) and Au-TiO2 (b) in air (olive/purple curves), under 10 min (fine green/pink curves) and 30 min (bold green/pink curves) outgassing at r.t., at 80 C (cyan/wine curves), at 100 C (dark cyan/wine curves), at 120 C (dark grey curves), and at 150 C (light grey curves). Figure 10.Comparison among the normalised FTIR absorbance spectra of CuO-TiO2 (green curves) and Au-TiO2 (violet curves) reported in Figure 8. Spectra normalised to the pellet density. Figure 10.Comparison among the normalised FTIR absorbance spectra of CuO-TiO 2 (green curves) and Au-TiO 2 (violet curves) reported in Figure 8. Spectra normalised to the pellet density. Interaction with CO 2 at Room Temperature: Surface Reactivity Figure 11.(a) FTIR difference spectra collected on CuO-TiO2 (green curves) and Au-TiO2 (violet curves) after the inlet of 15 mbar CO2 at r.t.(bold curves) and subsequent outgassing at the same temperature for 30 min (fine curves).(b) Zoom on the 2450-2250 cm -1 spectral range in which the spectra collected at decreasing CO2 pressure and under outgassing at r.t.(fine curves).(c) Zoom on the 1800-1000 cm -1 spectral range. Figure 11.(a) FTIR difference spectra collected on CuO-TiO 2 (green curves) and Au-TiO 2 (violet curves) after the inlet of 15 mbar CO 2 at r.t.(bold curves) and subsequent outgassing at the same temperature for 30 min (fine curves).(b) Zoom on the 2450-2250 cm -1 spectral range in which the spectra collected at decreasing CO 2 pressure and under outgassing at r.t.(fine curves).(c) Zoom on the 1800-1000 cm -1 spectral range. Specific Surface Areas of the examined photocatalysts obtained by N 2 physisorption analyses. The authors thank Tania Fantinel (Ca' Foscari University of Venice) for the excellent technical assistance.The financial support of Regione Veneto (project number: 2120/10/2121/2015) is gratefully acknowledged.DRS and FTIR analyses and provided data elaboration.G.C. contributed with XRD characterization.M.S., A.O., E.G., and M.M. wrote the manuscript. Author Contributions: M.S. and A.O. conceived and designed the experiments.E.G. conceived materials synthesis formulation and performed physisorption analyses.P.P. performed the experiments.M.M. performed The authors declare no conflict of interest.The founding sponsors had no role in the design of the study; in the collection, analyses, or interpretation of data; in the writing of the manuscript; or in the decision to publish the results."}]