[{"title": "Doi", "content": "10.1016/j.apcatb.2015.03.045"}, {"title": "Article_Title", "content": "Sulfur-doped g-C3N4 with enhanced photocatalytic CO2-reduction performance"}, {"title": "Abstract", "content": "Graphitic carbon nitride (g-C 3 N 4 ) is the most stable phase of all carbon nitride allotropes under ambient conditions.In this study, sulfur-doped g-C 3 N 4 was fabricated by simply calcinating thiourea at 520 C. Sulfur-doped g-C 3 N 4 (TCN) was found to absorb light up to 475 nm corresponding to a band gap of 2.63 eV, which was narrower than that of un-doped g-C 3 N 4 (MCN) with a band gap of 2.7 eV. Firstprinciple calculations based on spin-polarized density functional theory were utilized to investigate the theoretical partial density of states of the TCN and MCN, indicating that the band gaps of TCN and MCN were the same, but impurities existed in the TCN sample.Consequently, photogenerated electrons could easily jump from the impurity state to the conduction band or from the valence band to the impurity state.Photocatalytic CO 2 reduction was further used to evaluate the photoactivity of samples, and the CH 3 OH yield using TCN and MCN were 1.12 and 0.81 mol g -1 , respectively.PL spectrum analysis and transient photocurrent responses were also carried out to verify the suggested photocatalysis mechanism."}, {"title": "Experimental", "content": "All of the chemical reagents used in this paper were of analytical grade and were used without further purification.The g-C 3 N 4 was synthesized by simply heating thiourea and melamine in the muffle furnace.Afterwards, 10 g of thiourea or melamine powder as precursor was heated to 520 C at a heating rate of 5 C/min in a covered alumina crucible.The temperature was kept at 520 C for 2 h and then cooled to room temperature 12,30.Then, a yellow product of g-C 3 N 4 was obtained and were ground to a fine powder.The as-prepared samples by heating thiourea and melamine were labeled as TCN and MCN, respectively. Powder X-ray diffraction (XRD) patterns were obtained on a D/Max-RB X-ray diffractometer (Rigaku, Japan), utilizing Cu K radiation at a scan rate (2A) of 0.05 s -1 .The accelerating voltage and applied current were 40 kV and 80 mA, respectively.Transmission electron microscopy (TEM) analysis was carried out on a Tecnai G 2 F20 S-TWIN microscope in the condition of an accelerating voltage of 200 kV.X-ray photoelectron spectroscopy (XPS) spectra were conducted by using an ultra-high-vacuum VG ESCALAB 210 electron spectrometer equipped with a multichannel detector.The samples were excited using Mg K radiation of two anodes in the constant analyzer energy mode, and XPS was operating at 200 W.All the binding energies were referenced to the C 1s peak at 284.6 eV which are adventitious carbon signals resulting from instrument or from the surface of the catalyst.The content of C, N, and S was analyzed by the CHNSO elemental analyzer (Vario EL cube, Elementar Analysensysteme GmbH, Germany) equipped with a balance which is accurate up to one over one million.UV-vis diffuse reflection spectra (DRS) were obtained by using a dry-pressed disk sample with a UV-vis spectrophotometer (UV-2550, Shimadzu, Japan), and BaSO 4 is used as reflectance standard.The Fourier transform infrared (FTIR) spectra of the samples were obtained by using an IRAffinity-1 FTIR spectrometer which uses conventional KBr pellets in the frequency range of 4000 cm -1 to 500 cm -1 at room temperature.Micromeritics ASAP 2020 nitrogen adsorption apparatus (USA) was used to record Brunauer-Emmett-Teller (BET) specific surface area (S BET ) of photocatalysts and all of the samples were degassed at 180 C before analysis.The pore size distributions were evaluated using desorption data with Barret-Joyner-Halender (BJH) method.The BET surface area was determined by a multipoint BET method to analyze the adsorption data in the relative pressure (P/P 0 ) range from 0.05 to 0.25.Photoluminescence (PL) spectra were obtained on a Fluorescence Spectrophotometer (F-7000, Hitachi, Japan) at room temperature.The Photo Multiplier Tube (PMT) voltage was 700 V, the scanning speed was 1200 nm/min, and the excitation wavelength was 380 nm.The widths used for the excitation and emission slit were both 1.0 nm. The first-principle calculation based on spin-polarized DFT and the Perdew-Burke-Eznerhof generalized gradient approximation (PBE-GGA) was carried out to investigate the doping effect on the band structure of g-C 3 N 4 31.The projector augmented wave scheme was incorporated into Vienna ab initio simulation package, and such incorporation was used in the study.The Monkhorst and Pack scheme of k-point sampling was used for integration over the first Brillouin zone.A 2 2 3 grid for k-point sampling for geometry optimization and an energy cutoff of 450 eV were consistently used in our calculations.The density of states (DOS) have been obtained with a 4 4 6 mesh.A good convergence was obtained with these parameters, and total energy converged was 2.0 10 -5 eV/atom 32,33.The unit cells of pure g-C 3 N 4 and S-doped C 3 N 4 used in the calculations are shown in Fig. 1. The catalytic activity of g-C 3 N 4 was examined by photocatalytic reduction of CO 2 in a 200-mL home-made Pyrex top-irradiation reactor at ambient temperature and atmospheric pressure.The two openings of the reactor were sealed using silicone rubber septum, forming a closed system, and a 300-W simulated solar Xe arc lamp was positioned 10 cm above from the reactor as a light resource.In a typical photocatalytic experiment, 100 mg powder sample, 10 mL deionized water, and 6 drops of H 2 PtCl 6 aqueous solution (1 g H 2 PtCl 6 6H 2 O/100 mL) corresponding to 1 wt Pt cocatalyst were mixed together in the glass reactor and then dispersed by ultrasound for about 30 min to form a suspension.The suspension was placed under the simulated solar Xe arc lamp for 1 h to form Pt nanoparticle.The reactor with suspension inside was placed in an oven, preheated to 80 C, for 2 h to evaporate water, and the sample was deposited on the bottom of the reactor in the form of thin films.To ensure that the reaction system was under anaerobic conditions, the reactor was purged with nitrogen for 30 min before the light irradiation.Carbon and hydrogen resources were CO 2 and H 2 O vapor, which were produced by the reaction of 0.12 g NaHCO 3 (introduced into the reactor before sealing) and 0.25 mL 4 M HCl solution (introduced into the reactor by a syringe).After 1 h irradiation, 1 mL of mixed gas was obtained from the reactor and examined using a gas chromatograph (GC-2014C, Shimadzu) equipped with a flame ionized detector and methanizer for subsequent gas concentration analysis.High-purity nitrogen was used as carrier gas in the GC-2014C.The products generated in the experiment were calibrated with a standard gas mixture and its retention time was determined.The product was also analyzed by another gas chromatograph (GC-14C, Shimadzu, Japan, thermal conductivity detector (TCD), 5 A molecular sieve column).The control experiment was carried out to ensure that the product was formed by photocatalytic reduction of CO 2 . Photocurrent measurements were performed using an electrochemical analyzer (CHI 660D electrochemical workstation, Chenhua Instrument, Shanghai, China) in a conventional threeelectrode configuration with working electrode, counter electrode, and reference electrode.The working electrodes prepared with samples have an active area of 0.5 cm 2 , and a Pt wire and Ag/AgCl (saturating KCl) were used as the counter electrode and reference electrode, respectively.A low power LED (3 W, 365 nm) (Shenzhen LAMPLIC Science Co., Ltd., China) was utilized as the light source with a focused intensity of 80.0 mWcm -2 .1M Na 2 SO 4 aqueous solution was used as the electrolyte in the photocurrent measurement.For working electrodes, 0.2 g of as-obtained photocatalyst (TCN and MCN) was ground together with 0.08 g of polyethylene glycol (molecular weight 20 000) and 2 mL of water to form a slurry.The slurry was then coated onto a pre-prepared 2 cm 1.2 cm F-doped SnO 2 -coated glass electrode by doctor blade technique.After these electrodes were dried, they were calcined at 450 C for 30 min in an oven with a heating rate of 5 C/min.All working electrodes investigated had a similar film thickness (from 10 nm to 14 nm)."}, {"title": "Results_and_discussion", "content": "To reveal the phase structure of the samples, XRD patterns were recorded.Fig. 2 shows consistent peaks with a well-developed g-C 3 N 4 layer structure 34.Two pronounced peaks were observed in the XRD patterns, and no obvious difference was monitored between TCN and MCN.The high-angle peak at 27.4 was characteristic of an interlayer stacking of conjugated aromatic systems, which was indexed to the (0 0 2) peak corresponding to the average interlayer distance of d 0.326 nm 35,36.The intensity of peak at 27.4 for MCN was stronger than TCN, which indicated that the MCN has better crystallinity.Considering different precursors, this phenomenon might be due to the formation of melamine as an intermediate product during the process of heating thiourea 37,38.A minor diffraction peak was found at 13.1 , which was indexed to the (1 0 0) plane and assigned to the in-plane structural packing of aromatic systems with an average distance of d 0.675 nm 373839.The XRD patterns of two samples showed similar diffraction peaks, suggesting that the two samples produced by different precursors had basically the same crystal structures 39,40.The XRD pattern of TCN showed lower characteristic diffraction peak intensity in comparison with MCN due to doping of sulfur. The TEM images of TCN and MCN in Fig. 3 show the morphology and microstructures of as-prepared g-C 3 N 4 .Thorough observation of Fig. 3 revealed that the samples were grainy in structure, and their layered structures contain many irregular pore sizes with diameters ranging from 10 to 40 nm.Comparing the images in Fig. 3, the g-C 3 N 4 produced by calcining thiourea had more small pores than the g-C 3 N 4 fabricated from melamine 41.All of the samples generated from two precursors had numerous randomly organized nanosheets and formed a layered structure, accompanied by a large number of nanoparticles which were fabricated into a variety of shapes 42.Moreover, compared with TCN, the particles of MCN are thicker, which can be observed in Fig. 3.The image contrast of Fig. 3c andd are darker than Fig. 3a andb because MCN had a higher degree of polymerization, which was consistent to the XRD patterns. In investigating the chemical composition of the as-prepared samples and elucidating the corresponding chemical states of the elements, XPS analysis was performed for TCN and MCN.In Fig. 4a-c, the XPS spectra showed no obvious binding energy shifts of C 1s and N 1s, suggesting that the chemical states of carbon and nitrogen in the two samples were almost the same.Survey spectrum (Fig. 4a) of the two samples revealed three photoelectron peaks at binding energies 288 eV (C 1s), 399 eV (N 1s), and 532 eV (O 1s) 39,43.The peak intensity of N element is stronger than that of C and O elements, which is identical to the theoretical C:N ratio for g-C 3 N 4 based from previous reports 44.In accordance with the XPS spectra, the atomic ratio C:N:O was calculated as 0.83:1:0.03and 0.81:1:0.03for the TCN and MCN, respectively.The C signals were higher than the theoretical value (0.75) because the adventitious carbon coming from instrument was detected by the machine. No another peaks depicted sulfur in the survey spectrum of TCN because the content of sulfur was very low in the sample. The high resolution C 1s XPS spectra of the two samples in Fig. 4b has two obvious peaks at binding energies 284.6 and 288.1 eV.The peak at the binding energy 284.6 eV was assigned to carbon impurities, and the main peak at 288.1 eV was ascribed to sp 2 -bonded carbon of N C N 454647.In Fig. 4c, high resolution N 1s XPS spectra of two samples were separated into four peaks centered at 398.6, 399.9, 401.2, and 404.3 eV.The most intense peak was at 398.6 eV, corresponding to sp 2 hybridized aromatic N bonded to carbon atoms of C N C.The main peaks at 399.9 and 401.2 eV were attributed to the tertiary N bonded to carbon atoms in the form of N C 3 and the amino functional groups with hydrogen (C N H), respectively.The weakest peak was at 404.3 eV, which was assigned to the -excitations 39,42,48.In the high resolution XPS spectra of O 1s represented in Fig. 4d, the peak at 532.3 eV was corresponded to adsorbed CO 2 and H 2 O on the MCN sample; the binding energy of O 1s for TCN was slightly lower than that of MCN, implying that SO 4 2-is possibly present in the sample other than CO 2 and H 2 O 49.In Fig. 4e, the S 2p peak was split into three peaks centered at 164, 165.4,and 169.3 eV.The peak at 164 eV was ascribed to C-S bond which was formed by substituting sulfur with lattice nitrogen.The weakest peak was at 165.4 eV, which was regarded as N S bonds resulting from replacing lattice carbon with sulfur.The strongest peak was centered at 169.3 eV, indicating that SO 4 2was detected for the sample of TCN 27,29. To further determine the presence of sulfur in the TCN and MCN samples, C, N, and S elemental analyses were carried out using CHNOS Elemental Analyzer.Table 1 shows that the atomic composition of C, N, and S of TCN were 39.32, 60.63 and 0.05, respectively; and the atomic composition of C, N, and S for MCN were 39.19, 60.81 and 0, respectively.The C:N ratio for TCN (0.65) was higher than MCN (0.64), which was in discordance with the above XPS results, because the partial residual precursors of melamine (the ratio of C:N is 0.5) also existed in the sample of MCN. UV-vis DRS were carried out to investigate the electronic band structure of the TCN and MCN samples.As seen in Fig. 5, the intensity of light absorbance of TCN was higher than that of MCN in the full spectrum.Compared with the MCN, the absorption edge of TCN was red shift.Therefore, the typical absorption edge of the TCN and MCN samples was at about 455 and 475 nm, respectively, which were corresponding to the band gap of approximately 2.7 and 2.63 eV, respectively 39,50,51.The red shift of the absorption wavelength, as well as its high absorption in the ultraviolet region, indicated that the sample of TCN can absorb more solar energy to produce more photogenerated electrons and holes pairs, which contributed to the improvement of photoactivity of the samples.In Fig. 5, there is a broad absorption peak from 450 nm to 550 nm for the TCN, because sulfur was doped into the crystal lattice of g-C 3 N 4 which introduced more defects into the samples. To investigate the electronic properties of MCN and TCN, the total and partial DOS of pure and S-doped g-C 3 N 4 were obtained, as shown in Fig. 6 and Fig. 7, respectively.For the pure g-C 3 N 4 , the partial DOS displays that both of its conduction band (CB) and valence band (VB) mainly consist of C 2p and N 2p states, and the spin-up and spin-down states were the same, indicating that there was no spin polarization in pure g-C 3 N 4 .The total DOS showed that the value of E g (band gap between the top of VB (TVB) and the bottom of CB (BCB)) was 1.18 eV 52.It was lower than the value obtained from the DRS discussed above (2.7 eV), which was due to the known limitation of DFT.In addition, the Fermi level was just above the TVB.For the S-doped g-C 3 N 4 , its CB and VB also mainly consist of C 2p and N 2p states.However, the spin-up and spin-down states were different, indicating that the introduction of S atom induced extra electrons and led to spin polarization in the sample.Besides, a localized impurity level emerges just under the BCB with empty spin-down state and occupied spin-up state, which is composed by C 2p, N 2p, and S 3p states.The result was reasonable because the doped S atom influenced the distribution of C and N atoms in the lattice, leading to a hybrid of p orbitals among C, N, and S atoms.The total DOS of the S-doped g-C 3 N 4 shows that its E g value was 1.18 eV, the same as that of the pure g-C 3 N 4 .However, owing to the existence of the impurity level, the value of E max (the maximum energy gap in the band gap) decreased to 1.02 eV, and the Fermi level was pushed just under the BCB which is shown in the Fig. 8.In other words, the photogenerated electron can easily jump from the impure state to the CB or from the VB to the impure state 53.Thus, the UV-vis diffuse reflection spectrum of the S-doped g-C 3 N 4 exhibited a red shift of the optical excitation threshold compared with the pure g-C 3 N 4 and a tail peak extending to near IR region.Such a variation of electronic property of g-C 3 N 4 was expected to be beneficial to the enhancement of photocatalytic activity under UV-vis light irradiation. The chemical structure of TCN and MCN was confirmed by the FTIR spectroscopy.The FTIR spectrum of TCN had no distinct difference in comparison with that of MCN, as shown in Fig. 9.For the two samples, the signals at 1250, 1324, 1405, 1454, 1571, and 1636 cm -1 corresponded to the typical stretching vibration modes of heptazine heterocyclic ring (C 6 N 7 ) units 39,54.The representative peak appeared at 804 cm -1 belonged to the characteristic breathing mode of triazine units, which corresponded to condensed CN heterocycles 55.The absorption band at 884 cm -1 was ascribed to deformation of N H 56.A weak band at 2377 cm -1 was attributed to the physically adsorptive CO 2 from the atmosphere.The intense and broad absorption peak at around 2900 cm -1 -3500 cm -1 region was assigned to the adsorbed H 2 O molecules and N H vibration of the uncondensed amine groups 57.No peak was ascribed to the bond of sulfur with other elements because the amount of sulfur was too low. The BET surface areas and pore size distributions of the as-prepared samples of TCN and MCN were obtained by the nitrogen adsorption-desorption.Nitrogen adsorption-desorption isotherms and corresponding pore size distribution curves were, respectively, displayed in Fig. 10 and its inset for TCN and MCN.The two nitrogen adsorption isotherms were highly similar and of type IV (Brunauer-Deming-Deming-Teller classification), demonstrating that the mesopores (2-50 nm) were existent in the samples 48.Furthermore, the shape of the two hysteresis loops was of type H3, which was connected to slit-like pores resulted from the aggregates of plate-like particles, agreeing well with the results of TEM.In the high relative pressure (P/P 0 ) range (from 0.9 to 1.0), the isotherms showed a high absorption, indicating the formation of large mesopores and macropores 55.With more detailed observation of Fig. 10, the pore size distributions (inset in Fig. 10) of TCN and MCN showed a wide pore size distribution from 2 nm to 120 nm, which confirmed the presence of mesopores and macro- pores.Table 2 listed the S BET , pore volume (V pore ), and pore size (d pore ) of the TCN and MCN.From this table, the BET surface area and average pore volume of MCN were almost twice more those of the sample of TCN, and the pore size of MCN was bigger than TCN 58,59. Photocatalytic reduction of CO 2 to methanol (CH 3 OH) was used to evaluate the photocatalytic activities of the as-prepared samples at ambient temperature and atmospheric pressure.Control experiments were conducted without light irradiation or catalyst, and no product was found, thus confirming that both the UV-vis light irradiation and catalyst were two essential conditions for the photocatalytic reduction of CO 2 .The carbon containing products were detected only when the gaseous CO 2 was introduced into the reaction system, suggesting that CO 2 was the only carbon source for the experiment rather than the photodegradation products of catalyst.In this work, gaseous CO 2 as carbon source resulted from the reaction of analytical grade NaHCO 3 and HCl aqueous solution which also offered H 2 O as hydrogen source.The experiment was performed in the anaerobic environment and under UV-vis light irradiation. From Fig. 11a, CH 3 OH was the main product in this experiment, which could be easily collected and directly used as fuel.The rate of CH 3 OH production for two samples was decreasing as the irradiation continued, and the CH 3 OH production of TCN was higher than that of MCN in three hours.Fig. 11b shows the comparison of photocatalytic CH 3 OH yield of TCN and MCN samples at the 3 h.Obviously, the samples of TCN has higher photoactivity than MCN.The CH 3 OH yield with MCN was 0.81 mol g -1 , whereas the CH 3 OH yield with TCN was high, 1.12 mol g -1 .Another way of showing it is that the CH 3 OH yield with TCN was 0.25 mol m -2 , which was about 2.5 fold to the product over MCN with yield of 0.1 mol m -2 .The products were also analyzed by gas chromatograph equipped with TCD, where oxygen could be detected.Under UV-vis light irradiation, the dominating reaction steps for the photocatalytic reduction of CO 2 to CH 3 OH were summarized as follows 606162: (2) As shown from the Eqs.( 1)-( 4), electrons (e -) and holes (h ) were generated with the presence of the catalysts and UV-vis light irradiation.Electrons were excited from the VB to the CB and reacted with CO 2 molecule to form CH 3 OH, while the holes remaining on the VB could oxidize water to form oxygen (O 2 ).Photocatalytic reduction of CO 2 is a process of multi-electron steps, 12 electrons and 2CO 2 molecules are needed to form 2CH 3 OH molecules, and the formation of 3 O 2 molecules requires 12 holes.Thus, not only CH 3 OH was produced in the experiment, but also O 2 molecules were formed.The samples of TCN possess higher activity than MCN because of the products fabricated by thiourea with a little sulfur doped.Comparison of the g-C 3 N 4 generated from the raw materials of melamine, more defects existed in the structure of TCN.Moreover, the defects in the structure of samples served as centers to trap the photogenerated electrons, which can promote the charge transfer and separation, inhibit the electron-hole recombination, and prolong the lifetime of charge carriers.By contrast, the g-C 3 N 4 with a little sulfur doped could narrow the band gap from 2.7 to 2.63 eV, corresponding to broadened light response from 455 nm to 475 nm, and more electrons could be generated upon the UV-vis light irradiation.Therefore, more photogenerated electrons could be used for CO 2 reduction for the TCN. To provide sufficient evidence and to examine the above suggested mechanism of photocatalytic reduction of CO 2 , the PL analysis of TCN and MCN was carried out.The PL emission is derived from the recombination of photogenerated electrons and holes, and thus PL analysis are useful in revealing the efficiency of charge carrier trapping, transfer, and separation, as well as in investigating the lifetime of charge carriers in the samples.Fig. 12 shows the PL emission spectra under an excitation wavelength of 380 nm, and the peaks of two samples were centered at around 430 nm.The peak could be ascribed to recombination of electrons and holes, which was consistent with variation of the band gap energy 63.Clearly, the PL intensity of TCN was much lower than MCN, indicating that the recombination rate of charge carriers in the TCN samples was lower, which was due to the fact that the electrons were generated under the UV-vis light irradiation and trapped in the defects, preventing a direct recombination of electrons and holes.As a result, more charge carriers could be used to photocatalytic reduction of CO 2 for the TCN in comparison with MCN, that is, the activities of g-C 3 N 4 was promoted with a little sulfur doped 34. To better confirm and understand the mechanism of photocatalytic reduction of CO 2 , the transient photocurrent responses of the TCN and MCN electrodes were recorded via several on-off cycles of the periodic UV-vis light irradiation.Photocurrent measurements were carried out to investigate the excitation, separation, transfer, and recombination of photogenerated charge carriers in the samples, and the value of photocurrent depicts the efficiency of charge collection.In other words, high photocurrent value represents more efficient separation of electrons and holes 64.As seen in Fig. 13, the image shows the I-t curve of the two abovementioned samples with several on-off cycles of intermittent irradiation at a bias potential of 0.5 V, and the sample of TCN had higher photocurrent intensity than MCN which illustrated that the sample TCN has higher efficiency of electron-hole separation and lower rate of charge carrier recombination 65.In Fig. 13 turned on, and the value decreased to zero when the light turned off, revealing that photocurrent was reproducible.This also indicated that most of the photogenerated electrons ran across the sample and transferred at the back contact to form photocurrent under UV-vis light irradiation.The photocurrent slowly reached a constant value upon continuous light irradiation, indicating that the traps in the samples were gradually filled with photogenerated electrons and then the trapped electrons further transferred to the deep traps.When the traps were filled, a part of photoelectrons could transfer at the back contact electrode.In contrast, the photocurrent value was gradually decaying to zero upon switching off the irradiation, which was due to the release of the electron from the traps 44.Therefore, the TCN sample exhibited high photocurrent and photoactivity because of more defects that contributed to the promotion of photogenerated charge carrier separation."}, {"title": "Conclusions", "content": "This work focused on un-doped and S-doped g-C 3 N 4 , fabricated by simple thermolysis of melamine and thiourea at 520 C, respectively.The XPS measurement and C, N, and S elemental analysis confirmed the existence of the sulfur element in S-doped g-C 3 N 4 .DRS revealed the variation of light absorption and electronic band structure of two samples, which was further demonstrated by DFT calculation.The first-principle calculation based on spin-polarized DFT was utilized to investigate total and partial DOS of the TCN and MCN in theory.The calculated band gap of TCN and MCN was the same, but impurity level existed in the sample of TCN, so the photogenerated electron could easily jump from the impure state to the CB or from the VB to the impure state for the sample of TCN.The photoactivity of the g-C 3 N 4 was examined by photocatalytic reduction of CO 2 , and the CH 3 OH yield over the unit area of the samples for TCN was nearly 2.5 times than the product with MCN.The suggested photocatalytic mechanism was further confirmed by PL spectra analysis and transient photocurrent responses. Fig. 1.(a) Supercell of pure C3N4.(b) Supercell of S-doped C3N4. Fig. 2. XRD patterns of TCN and MCN. Fig. 3. TEM images of TCN (a and b) and MCN (c and d). Fig. 4. XPS survey spectra (a), high-resolution XPS spectra of C 1s region (b), N 1s region (c) and O 1s (d) region for TCN and MCN, and high-resolution XPS spectra of S 2p (e) for TCN. Fig. 6.Partial DOS (a and b) and total (c) DOS of the simulated pure g-C3N4.The dashed line represents the Fermi level. Fig. 7. Partial DOS (a-c) and total DOS (d) of the simulated S-doped g-C3N4.The dashed line represents the Fermi level. Fig. 5. UV-vis diffuse reflection spectra and corresponding colors (inset) of TCN and MCN. Fig. 8. Schematic of band structure of pure g-C3N4 (left) and S-doped g-C3N4 (right). Fig. 9. FIIR spectra of TCN and MCN. Fig. 11.(a) Time courses of photocatalytic CH3OH production and (b) comparison of photocatalytic CH3OH production over TCN and MCN at 3 h under UV-vis light irradiation. Fig. 12. Photoluminescence (PL) spectra of TCN and MCN. The atomic rate of C, N, and S for TCN and MCN samples. Experimental conditions for preparation of the samples and their physical properties. This work was partially supported by the 973 program (2013CB632402), NSFC (51320105001, 51372190, 21177100, 51272199 and 21433007), Deanship of Scientific Research (DSR) of King Abdulaziz University (90-130-35-HiCi), Fundamental Research Funds for the Central Universities (WUT: 2014-VII-010), and Self-determined and Innovative Research Funds of SKLWUT (2013-ZD-1).This research is financially supported by the research grant of Early Career Scheme (ECS 809813) from the Research Grant Council, Hong Kong SAR Government, Dean's Research Fund-Early Career Researchers (04022), Research Equipment Grant (REG-2)"}]