[{"title": "Doi", "content": "10.1016/j.apcatb.2017.12.071"}, {"title": "Article_Title", "content": "Graphene-wrapped Pt/TiO2 photocatalysts with enhanced photogenerated charges separation and reactant adsorption for high selective photoreduction of CO2 to CH4"}, {"title": "Abstract", "content": "Artificial photosynthesis efficiency for selective CO2 conversion to CH4 as chemical energy-rich molecule is dependent on the photogenerated charges separation and reactant adsorption property of photocatalyst.Here we report a novel fabrication of core-shell-structured photocatalysts of Pt/TiO2-nanocrystals wrapped by reduced graphene oxide (rGO) sheets ((Pt/TiO2)rGO).The ultrafine anatase TiO2 nanocrystals with coexposed 001 and 101 facets acted as the fountain of the photogenerated charges primitively.Pt nanoparticles (NPs) deposited on the TiO2 nanocrystals can gather and transfer the stimulated electrons originated from anatase TiO2 nanocrystals.The all-solid-state electron multiple transmission (EMT) system with TiO2-nanocrystal(core)-Pt(mediator)-rGO(shell) nanojunction is not only favorable to the vectorial electron transfer of TiO2PtrGO and enhance the separation efficiency of photogenerated electrons and holes, but also the surface residual hydroxyl and extended bond of wrapping rGO sheets can improve the adsorption and activation capabilities for CO2 reactant.(Pt/TiO2)rGO ternary photocatalysts exhibit excellent performance for the multi-electron process of selective photocatalytic CO2 conversion to CH4.Among the prepared catalysts, (Pt/TiO2)rGO-2 catalyst shows the highest photocatalytic activity and selectivity for CO2 conversion, i.e., the formation rate of CH4 is 41.3 mol g -1 h -1 and the selectivity of CO2 conversion to CH4 product is 99.1 , and its apparent quantum efficiency for CH4 product is 1.93 .As a heuristic the fabrication of core-shell structured (Pt/TiO2)rGO photocatalysts will stimulate more novel ideas for application to light-chemical energy conversion."}, {"title": "Experimental", "content": "The core-shell-structured (Pt/TiO2)rGO photocatalysts were designed and practical fabricated by a self-assembly method of a simple and pure chemical bonding reactions (detailed in the Supplementary Information of Sample Preparation), and the schematic representation and digital photographs of the preparation processing for (Pt/TiO2)rGO core-shell photocatalysts are shown in Fig. 1.As shown in Fig. 1a, the typical procedures with three steps were described as follows: Firstly, the truncated octahedral bipyramid anatase TiO2 nanocrystal with coexposed 001-51 and 101-49 facets were synthesized by two steps of hydrothermal processes using commercial P25 as Ti source reported by Cao et al 21.As shown in Fig. 1b of digital photographs, anatase TiO2 nanocrystal with white color was obtained after washed, dried and calcined processes.Secondly, Pt NPs supported on anatase TiO2 nanocrystals were prepared by the gas bubbling-assisted membrane reduction-precipitation (GBMR) method using the poly (N-vinyl-2-pyrrolidone) (PVP) as the protecting agent and the NaBH4 solution as the reducing agent (Fig. S1).The GBMR process can control the nucleation and growth processes of Pt nucleus on the surface of anatase TiO2 nanocrystals via highly homogeneous dispersion of reductant using the ceramic membrane tubes.And it is also critical process that PtCl6 2-ions are adsorbed and anchored on surface OH2 groups of anatase TiO2 nanocrystals, because the pH value of mixture solution (3.0) using the adjustment of HCl solution is lower than the isoelectric point (IEP) of TiO2.After supported Pt NPs, the color of samples changed from white to light gray in Fig. 1b.The loading amounts of supported Pt NPs in the photocatalyst is 1.0 wt in theory.Thirdly, the core-shell-structured photocatalysts of Pt/TiO2 nanocrystals wrapped by rGO sheets were synthesized by a self-assembly method of a simple and pure chemical bonding reactions. Graphite oxide (GO) was prepared by the traditional Hummers method from graphite power (Fig. S2), and the exfoliated GO shows super electronic conductivity because of the -system interruption by substitution with a numerous defects (oxygen functional groups) 48, thus, GO dispersed in ethyl alcohol are strongly adsorbed on the surface of Pt/TiO2 nanocrystals due to surface condensation reaction of oxygen-containing functional groups.Then, GO/(Pt/TiO2) samples was reduced to rGO using NaBH4 solutions 49.Finally, the desired core-shell structured (Pt/TiO2)rGO catalysts with dark gray (Fig. 1b) were obtained after centrifugation, wash and dry in a vacuum oven at 60 o C for 12 h.The catalysts are uniformly named as (Pt/TiO2)rGO-n, where n is the nominal weight percent of rGO to Pt/TiO2 (1, 2, 5 and 10 wt of Pt/TiO2). The morphology and microscopic structure information were obtained on a scanning electron microscope (SEM, FEI Quanta 200F) and a transmission electron microscope (TEM, JEOl JEM 2100) equipped with a field emission source at an accelerating voltage of 200 kV. The nitrogen adsorption/desorption isotherm was carried out at -196 o C by using an automated gas sorption analyzer (Quantachrome Autosorb-iQ, USA) after having degassed the sample for 4 h at 300 o C. The specific surface area was calculated by the Brunauer-Emmett-Teller (BET) method.The crystal phase properties of all as-prepared samples were analyzed with a powder X-ray diffractometer (Shi-madzu XRD 6000) and a Renishaw Micro-Raman System 2000 spectrometer.The laser line of Raman microscope was 532 nm.X-ray photoelectron spectra (XPS) were acquired by a Perkin-ElmerPHI-1600 ESCA spectrometer with Mg Ka emission.Photoluminescence (PL) spectra were recorded using the Edinburgh Instruments Xe900 equipped with a Xe lamp and the excitation wavelength was set at 380 nm.Photoelectrochemical (PEC) measurements were performed on an electrochemical workstation (CHI660E) in the saturated solution of Na2SO4, which has a three-electrode configuration and all as-prepared samples, the saturated Ag/AgCl, a platinum foil were employed to as working photoelectrode, reference and counter electrode, respectively.The samples were illuminated under a 300 W Xe lamp.Temperature-programmed desorption of carbon dioxide (CO2-TPD) measurement was performed on a conventional flow apparatus.Prior to measurements, 100 mg of the sample was pretreated in Ar gas (60 cm 3 min -1 ) at 150 o C for 1 h and then cooled down to room temperature.Next, the sample was exposed to CO2 flow of 30 cm 3 min -1 for 0.5 h to ensure the sufficient adsorption of CO2.Before desorption, the sample was flushed in Ar gas for 1 h.Subsequently, CO2 desorption was performed in the range of 30400 o C at a heating spectrometer, which was equipped with a high temperature environmental cell fitted with Zn-Se window and an MCT detector cooled with liquid N2.The catalyst was loaded in the Harrick IR cell and heated to 200 o C under N2 at a flow rate of 50 cm 3 min -1 for 60 min to remove adsorbed impurities.Then the catalyst was cooled down to 30 o C. A background spectrum was collected under a flowing N2 atmosphere and was subtracted from the sample spectra.Next, the sample was exposed to CO2 flow of 50 cm 3 min -1 for 30 min and then under N2 at a flow rate of 50 cm 3 min -1 for 30 min.The in-situ DRIFTS spectra were recorded by accumulating 64 scans with a resolution of 4 cm -1 .Density functional theory (DFT) calculation was carried out by the Vienna ab initio simulation package (VASP) in order to elucidate relationship between the origin of visible absorption and oxygen defects.The calculations involved on-site Coulomb corrections (DFTU, U 4.2 eV for Ti 3d states).50 PAW pseudopotential was used to describe the core-valence electron interaction.Plane-wave basis set with an energy cutoff of 400 eV was used in this work.Anatase TiO2 (001) facet was presented by a five-layer slab model with a vacuum gap of 15 A.For all the surface calculations, the model was a periodic slab with a (22) surface unit cell.A Monkhorst pack 661 k-point mesh was used for the Brillouin zone integration.During structural optimizations, all of the atoms except those in the bottom TiO2 two layers of the slab were allowed to relax until atom forces were smaller than 0.05 eV A -1 . Photocatalytic CO2 reduction test was carried out in a gas-closed circulation system (Perfect Light Company, Beijing, China) irradiated under a 300 W Xe lamp (320-780 nm).The certain amount of catalysts was uniformly dispersed on a watch-glass with 6.5 cm basal diameter.Before the light irradiation, the photo reactor system was thoroughly vacuum-treated, then CO2 gas was introduced into the circulation system.The deionized water (2 mL) was"}, {"title": "Results_and_discussion", "content": "Fig. 1 shows the schematic, digital photographs and SEM images for synthesis procedures of (Pt/TiO2)rGO-n catalysts.With progressing of the preparation process, the color of prepared samples has changed obviously from white to light gray and even dark gray in Fig. 1b.due to the excess wrapped by rGO sheets (Fig. S3). The phase structure of TiO2, Pt/TiO2, TiO2rGO-2 and (Pt/TiO2)rGO-n catalysts was investigated by XRD patterns and the results are show in Fig. 2. The diffraction peaks (2) of TiO2 nanocrystals at 25.3, 37.8, 48.0, 53.9, 55.1, 62.7 and 75.0 o can be indexed to the (101), ( 004), ( 200), ( 105), ( 211), ( 204) and ( 215) crystal facets of anatase-phase TiO2 (PDF 21-1272), respectively.There is not any diffraction peak corresponding to other phase of TiO2, indicating that the phase structure of anatase TiO2 nanocrystal is single and pure.After introduction of supported Pt NPs, the diffraction peaks belonging to TiO2 did not changed, and the characteristic diffraction peaks of Pt NPs were not detected.The above-mentioned results indicate that the sizes or loadings of supported Pt NPs are smaller than the detection limit of XRD spectrafor supported nanoparticles.Meanwhile, no diffraction peaks for carbon species were observed in TiO2RGO and (Pt/TiO2)RGO samples, which might be due to the relatively low diffraction intensity of graphene.No obvious change of its crystalline phase is observed after Pt NPs deposited and RGO sheets coated on TiO2 nanoparticles.In addition, Table S1 shows the structural physical parameters of TiO2, Pt/TiO2, TiO2rGO-2 and (Pt/TiO2)rGO-n catalysts including surface areas, pore volumes, crystal parameters and Pt actual contents.After introduction of supported Pt NPs and wrapping rGO sheets, the surface areas and pore volumes of the catalysts have not changed obviously, and the Pt actual contents in the catalysts determined by ICP-AES are always in the range of 0.80.9wt . phase structure of TiO2 and rGO sheets owing to its strong scattering properties.As shown in Fig. 3, Raman spectra of all the samples show several characterized bands located at 144, 397, 517, and 638 cm -1 , which is assigned to the Eg(1), B1g(1), A1g B1g(2), and Eg(2) modes of anatase phase of TiO2, respectively 51.The single anatase phase structure of TiO2 support is further confirmed.After introduction of wrapping rGO nanolaygers, it is worth noting that two typical bands centered at 1347 and 1590 cm -1 are observed obviously, which is assigned to the D-band and G-band of the graphitized structure of rGO sheets, respectively.With the increasing of wrapping rGO contents, the intensity of the characteristic bands of anatase TiO2 nanocrystals decreases gradually and even disappears for the (Pt/TiO2)rGO-10 catalyst, which is direct evidence of Pt/TiO2 nanocrystals wrapped by rGO sheets and the formation of (Pt/TiO2)rGO core-shell structure.On the other hand, with the increasing of RGO content the thickness of rGO in the core-shell structure grow larger gradually. In order to further investigate the physical structure, TEM and HRTEM images of TiO2, Pt/TiO2 and (Pt/TiO2)rGO-n catalysts are shown in Fig. 4. For TiO2 nanocrystals, the hexagons as projection of truncated octahedral bipyramid are exhibited.The lateral isosceles trapezoid of the truncated octahedral bipyramid nanocrystals corresponds to 101 facet, and the top and bottom facets are the 001 facet 52.The interfacial angle between 101 and 001 facets is 68.3 o .The mean particle size of anatase TiO2 nanocrystal is about 30 nm in accordance with SEM results.As shown in inset of Fig. 4a, the lattice spacings paralleled to the lateral and the top faces are ca.0.35 and 0.24 nm, which are corresponding to the 101 and 004 facets of anatase TiO2, respectively.Anatase TiO2 nanocrystal was estimated to be coexposed 001-51 and 101-49 facets as calculated by a reported method 53.The It indicates that there is a tight contact interface between Pt NPs and TiO2 nanocrystals, which is beneficial to the subsequent efficient electron transfer and rGO shell coating. After introduction of rGO sheets, it is observed clearly that the Pt/TiO2 nanocrystals are wrapped by rGO sheets and the core-shell structure of (Pt/TiO2)rGO catalysts is fabricated. For (Pt/TiO2)rGO-1 catalyst in Fig. 4c, Pt/TiO2 nanocrystals are not wrapped completely owing to insufficient amount of wrapping rGO sheets.With increasing of rGO sheets, the uniform core-shell structure of (Pt/TiO2)rGO catalysts is found.In Fig. 4d, it exhibited clearly the core-shell structure of Pt/TiO2 nanocrystals wrapped by graphitic layers of rGO, and supported Pt NPs as intermedium are sandwiched between rGO shell and TiO2 core.The thickness of rGO shell is in the range of 0.4-1.1 nm, which is equal to the thickness of 1-3 layers of single-layer rGO (0.34 nm) in inset of Fig. 4d.It is in accord with TEM images of TiO2rGO-2 catalyst in Fig. S5.After further increasing of wrapping rGO sheets, the thickness of rGO shell increases gradually, i.e., the average thicknesses of rGO shell over (Pt/TiO2)rGO-5 and (Pt/TiO2)rGO-10 catalysts are 2.5 and 5.0 nm, respectively. The morphology and composition of (Pt/TiO2)rGO-2 catalyst were further characterized by the HAADF-STEM and EDS elemental mapping, and the result is shown in Fig. 4g.The four elements of Pt O, Ti and C in the (Pt/TiO2)rGO-2 catalyst were detected by SEM-EDS spectroscopy (Fig. S6).Supported Pt NPs are homogeneously dispersed on the surface of TiO2 supports, which is in agreement with the result of TEM images.The compositional distributions of each elements in the select local area of (Pt/TiO2)rGO-2 NPs reveal further obviously the tri-component core-shell-structured NPs with the core rich in Pt (sapphirine) and the shell rich wrapped by rGO sheets.In other words, it is realized the formation of the core-shell structured (Pt/TiO2)rGO catalysts.Therefore, a rGO(shell)-Pt(core)-TiO2(core) nanojunction system with a tight electronic contact ensures the efficient photogenerated electron transfer and the subsequent photocatalysis. To examine the effect of core-shell structured (Pt/TiO2)-rGO nanojunction on the electronic properties of the surface elemental (Ti, O, Pt and C), XPS spectroscopy was carried out and the results are shown in Fig. 5.As shown in Fig. 5a, the binding energies of Ti 2p3/2 and Ti 2p1/2 in TiO2 nanocrystals are located at 457.8 and 463.5 eV, which is mainly assigned to Ti 4 species 54.With increasing of rGO shell thickness in (Pt/TiO2)rGO-n catalysts, the intensities of Ti 2p XPS peaks decrease slightly, and the peaks have a positive shift gradually, which is attributed to the strong interactions of TiO2-Pt-rGO ternary system.For O1s XPS spectra in Fig. 5b, the curves exhibit one dominating peak at 528.8 eV and one secondary peak Fig. 5c shows Pt 4f XPS spectra of Pt/TiO2 and (Pt/TiO2)rGO-n catalysts.In order to observe clearly, the peak intensities of (Pt/TiO2)rGO-2 and (Pt/TiO2)rGO-10 catalysts are magnified to 1.5 and 2.0 times, respectively.After introduction of wrapping rGO sheets, the intensities of Pt 4f XPS peaks decrease obviously due to the shielding effect of rGO shell, which is also indirect evidence to the formation of (Pt/TiO2)rGO core-shell structure.The deconvolutions of the spectra were made by the standard procedure, and the binding energies of 70.2 and 73.5 eV, 71.2 and 74.8 eV, 74.1 and 76.9 eV correspond to Pt 0 , Pt 2 and Pt 4 species, respectively.It indicates that the metallic (Pt 0 ) and ionic (Pt ) species coexist in (Pt/TiO2)rGO-n catalysts.The formation of ionic Pt (Pt 2 and Pt 4 ) species are derived from the electron transfer from Pt 0 to O 2-due to the strong interaction between metal (Pt)-support (rGO and TiO2), which is beneficial to the vectorial electron transfer from excitation of TiO2 to rGO driven by the two steps using Pt NPs as conducting medium 57.The relative proportions of Pt 0 , Pt 2 and Pt 4 species on the surface of catalysts were estimated and presented in Table .1. The surface Pt concentration of (Pt/TiO2)rGO-2 (47.1 ) and (Pt/TiO2)rGO-10 (51.5 ) catalysts are significantly higher than that of Pt/TiO2 catalyst (29.9 ), which is attributed to the strong electron transfer of (Pt/TiO2)rGO-n core-shell catalyst from Pt NPs to rGO shell. Corresponding to the C 1s XPS spectra in Fig. 5d, the C 1s peak is dominated by elemental carbon at 283.9 eV, assigned mainly to the C-C, CC and C-H bonds (sp 2 ) of graphene 58. The other two peaks at 285.7 and 287.8 eV are assigned to the C-O and O-CO species, respectively 59.And the C 1s peak at 281 eV corresponding to Ti-C bond is not observed, indicating that carbon atom did not directly enter into bulk TiO2 lattice 60.All of the element peaks are shifted to higher binding energy values than that for the pure TiO2, providing evidence of a strong interaction among rGO-Pt-TiO2 ternary components, which is conducive to propelling the photogeneraed electrons transfer from TiO2 to rGO using Pt NPs as a medium. In order to further observe the functional groups and chemical bonds of Ti-O-Ti vibrations and Ti-O-C vibrations, the Fourier transform infrared (FTIR) spectra of GO, TiO2 and (Pt/TiO2)rGO-n catalysts were investigated and the result is shown in Fig. 6.For comparison, the FTIR spectrum of GO is included.In the case of GO, there are five characteristic absorption carbonyl and O-H stretching, respectively 61.For pure TiO2, the spectrum shows a broad absorption peak around 500 cm -1 , which was attributed to the Ti-O-Ti stretching vibrations.The presence of absorption bands around 3400 and 1627 cm -1 were attributed to the O-H stretching frequency, which came from the surface hydroxyl groups and the adsorbed water molecules. For (Pt/TiO2)rGO-2 and (Pt/TiO2)rGO-10 catalysts, the intensity of absorption band at 1726 cm -1 corresponding to the oxygen functional groups was decreased dramatically and even disappeared.The presence of absorption bands below 1000 cm extend the life of photogenerated electrons, which is beneficial to improve the photocatalytic activity for CO2 reduction.Among the prepared catalysts, (Pt/TiO2)rGO-2 catalyst exhibits the lowest intensity of PL emission spectra, indicating that the thickness of wrapping rGO sheets can optimize the recombination efficiency of photogenerated charges. It is well known that the transient photocurrent response induced by the incident light can reflect the enrichment degree of separated charge carriers on the surface of photocatalysts 66. The higher the photocurrent response is, the larger charge carrier number is 67.In order to further illustrate the capability of supported Pt NPs and rGO shell for promoting separation efficiency of photoinduced electron-hole pairs in (Pt/TiO2)rGO photocatalysts, the transient photocurrent responses under several on/off UV-vis light irradiation cycles were performed, and the results are showed in Fig. 9.The photocurrent increased immediately when the light irradiation turns on, while it rapidly decreased to zero when the light turns off.The photocurrent density of anatase TiO2 nanocrystals is higher than that of commercial P25, indicating the relatively high enrichment degree of photogenerated electrons due to the surface heterojunction effect between 001 and 101 facets.Moreover, the transient photocurrent intensities of bi-component Pt/TiO2 and TiO2rGO-2 catalysts are higher than that of anatase The adsorption capacity for CO2 reactant is also crucial to improve the catalytic activity.The peak at 2350 cm -1 is attributed to the vibration of adsorbed CO2 on the surface of catalysts. Among the catalysts, the peak intensity of (Pt/TiO2)rGO-2 catalyst is highest, and the peak intensity of TiO2 and Pt/TiO2 catalysts without rGO shells weaken distinctly.It indicates that the wrapping rGO shell can enhance the adsorption capacity of CO2 reactant which is benefit for the conversion of CO2 to CH4.Based on the results of characterizations, (Pt/TiO2)rGO-2 catalyst, combined of both optimal photogenerated charges separation effeciency and maximal adsorption capacity for CO2 reactant, is promising to exhibit the high photocatalytic activity for CO2 reduction with H2O to hydrocarbon fuels. The photocatalytic reduction of CO2 with H2O was carried out in a gas-closed circulation system with a continuous-flow mode under simulated light irradiation.Commercial P25 was selected as the reference catalyst in photocatalytic CO2 reduction.The photocatalytic performances of as-prepared catalysts for CO2 reduction with H2O are shown in Fig. 11 and Table .2. As shown in Fig. 11, the product amounts of CH4 and CO over anatase TiO2 nanocrystals are larger than that of commercial P25.It is attributed to the surface heterojunction between coexposed 101 and 001 facets in single anatase TiO2 nanocrystals for improving the separation of photogenerated charges.The single co-catalysts of wrapping rGO sheets or supported Pt NPs can selectively improve the productive rate of CO and H2, respectively.TiO2rGO-2 catalyst shows highest CO formation rate (8.6 mol g -1 h -1 ), which is ascribed to the enhanced adsorption capacity for CO2.Pt/TiO2 catalyst exhibit the highest formation rate of H2 (72.7 mol g -1 h -1 ).It is attributed to the trapping photogenerated electrons of supported Pt NPs with the lower Fermi energy level.The increased electron density is beneficial to the formation of H2 during the reaction process of consumption two electrons. Considering that the reduction of H2O to H2 is a competitive reaction with the reduction of CO2 to CH4 and CO, we have evaluated the selectivity for CO2 reduction on an electron basis.It is noted that the photocatalytic selectivity to CO2 reduction over Pt/TiO2 catalyst is the lowest, and it increases obviously after wrapped rGO sheets.The selectivities of TiO2rGO and (Pt/TiO2)rGO-n catalysts for CO2 reduction to CH4 product are higher than 80 , indicating that wrapping rGO sheets are beneficial to the selective catalytic photoreduction of CO2 with H2O rather than H2O reduction to H2.Although rGO sheet is a more selective cocatalyst for the reduction of CO2, the formation rate of CH4 over TiO2rGO-2 is lower than that over Pt/TiO2 catalyst, which may be attributed to the surface low density of photogenerated electrons without Pt NPs. (Pt/TiO2)rGO-n catalysts exhibited a significantly enhancing photocatalytic activity for CO2 reduction with H2O to CH4.Among the as-prepared catalysts, (Pt/TiO2)rGO-2 catalyst shows the highest formation rate of CH4 (41.3 mol g -1 h -1 ) and the lowest formation rate of CO (0.4 mol g -1 h -1 ), its selectivity of CO2 reduction to CH4 product is 99.1 .The formation rate of CH4 over (Pt/TiO2)rGO-2 catalyst has a 31-fold increase in comparison with commercial P25.It shows the noticeable synergistic effect of rGO-Pt-TiO2 ternary system on enhancing the photocatalytic activity for CO2 reduction.With increasing of wrapping rGO contents (2 wt), the formation rate of CH4 decreases remarkably and the selectivity for CO2 reduction to CO product increases.It is attributed to increased shielding and scattering of photons through excess rGO in the photocatalytic system.Basis on the above results, the role of wrapping rGO shell can be summarized.On the one hand, the advantages of rGO shell are the enhanced adsorption capacity for CO2 and separation efficiency of photogenerated electron-hole pairs.On the other hand, too much rGO shell can shield the light from reaching the surface of TiO2 nanocrystals, which results in significant deterioration of photocatalytic performance for CO2 reduction.Therefore, in order to achieve high efficient photocatalytic CO2 reduction, the thickness of wrapping rGO shell must be optimized.Among the photocatalysts, (Pt/TiO2)rGO-2 catalyst showed the highest formation rate of CH4, indicating that the weight percent (2 wt) of wrapping rGO sheet is the optimum point between maximum positive and minimum negative effects.In addition, the formation rates of O2 over the as-prepared catalysts were also investigated.In all the catalysts, (Pt/TiO2)rGO-2 catalyst shows the highest formation rate of O2 (98.6 mol g -1 h -1 ) in Table 2, which is higher than the stoichiometric rate according to the calculation of CO2 reduction products (85.6 mol g -1 h -1 ).It may be attributed to the formation of other undetected hydrocarbon.Therefore, it is concluded that the moderate thickness of rGO shell on the surface of Pt/TiO2-nanocrystals core is favorable to the photocatalytic CO2 reduction with H2O and can enhance the formation rate of CH4. The apparent quantum efficiency (AQE) is one of the most important parameters to light-chemical energy conversion.In the photocatalytic CO2 reduction with H2O reaction, the AQE values for CH4 product (AQECH4) over all catalysts were calculated by the equation in part 2.3, and the results are listed in Table 2.The AQECH4 value of anatase TiO2 nanocrystals (0.17 ) is higher than that of P25 (0.06 ), indicating that anatase TiO2 nanocrystal with coexposed 001 and 101 facets is a high efficiency photocatalytic system for CO2 reduction to CH4.The AQECH4 value of Pt/TiO2 catalyst (0.65 ) increases obviously compared with P25 and TiO2.Among the (Pt/TiO2)rGO-n catalysts, (Pt/TiO2)rGO-2 catalyst exhibits the largest AQECH4 value (1.93 ).It is further confirmed that the suitable thickness of rGO shells on the surface of Pt/TiO2 nanocrystals is beneficial to improve the utilization efficiency of simulated solar irradiation.Fig. 12 shows the cycle test results of (Pt/TiO2)rGO-2 catalyst for CO2 reduction.It exhibits excellent stability for photocatalytic CO2 conversion, i.e., the formation rates of CH4, CO and H2 products have not changed obviously during the ten cycles. And the core-shell structure of (Pt/TiO2)rGO-n catalysts and the particle sizes of supported Pt NPs have not changed based on the results of SEM (Fig. S9a) and TEM (Fig. S9b) images.It indicates that (Pt/TiO2)rGO-n photocatalysts have a strong application potential for photocatalytic reduction of CO2 with H2O. In addition, a series of background tests were also performed.Under conditions of simulated light irradiation without photocatalysts, any product of CO2 conversion was not observed.Similarly, any hydrocarbon was not found under condition of without light even using (Pt/TiO2)rGO-2 photocatalyst.Using the feed gas of N2 and H2O vapor with (Pt/TiO2)rGO-n catalysts under simulated light irradiation, and again, the carbon-containing products were not detected.In order to verify the sources of carbon and hydrogen in the products of CO and CH4, the analyses of 13 C and 2 H(D) isotopic tracing for the products of photocatalytic 13 C-labeled CO2 reduction with D2O over (Pt/TiO2)rGO-2 catalyst were carried out by means of GC-MS after 8 h irradiation (Fig. S10).The peak with m/z of 21 can be attributed to 13 CD4, and the peak with m/z of 29 can be recognized as 13 CO.It indicates that the carbon (C) element in the product of CO and CH4 comes from CO2 reactant, and the hydrogen (H) element in the product of CH4 comes from H2O reactant.Therefore, it is asserted that the reactants of CO2 and H2O are only source to photocatalytic products (CO and CH4), both photocatalysts and light irradiation must be required for the reaction process of photocatalytic CO2 reduction with H2O. It is well known that the photocatalysts for CO2 reduction must be confirmed to the energy band theory, which is based on the positions of oxidation potentials, conduction band (CB), and valence band (VB).The CB potential (ECB) of TiO2 (-0.56 V vs. NHE at pH 7) is more negative than the reduction potentials of E (CO2/CO) (-0.53 V) and E (CO2/CH4) (-0.24V), so the reduction reaction is theoretically feasible.Although the E (CO2/CH4) is less negative than E (CO2/CO), but eight electrons are required to produce CH4 rather than only two electrons for CO product 68.Thus, the CO product is possible to be priority owing to the paucity of photogenerated electrons.But if the protons and electrons are sufficiently afforded during the photocatalytic process, CH4 should be the major reduction product.Moreover, the basic process of photocatalytic CO2 reduction can be summarized into three steps: 1) formation of photogenerated carriers (electron-hole pairs) by a band-gap excitation, 2) separation and transportation of the charge carriers, 3) reduction of water and carbon dioxide adsorbed on the surface of catalysts by the photogenerated electrons.Thus, the introduction of co-catalyst should be beneficial to improve the charge separation, facilitate the CO2 adsorption and Based on the results of photocatalytic CO2 conversion with H2O in Table 2, (Pt/TiO2)rGO-n catalysts exhibited super catalytic performances.The enhanced photocatalytic activity for CO2 conversion with H2O can be isolated from light-harvesting, CO2 adsorption and activation, and charge-separation functions of the photocatalysts.For improving the light-harvesting efficiency, the co-catalysts of supported Pt NPs and wrapping rGO sheets with the electronic coupling between states of rGO and CB states of TiO2 can effectively extend the spectral response from UV to visible region (Fig. 7).Based on comparison of the UV-Vis DRS results between TiO2 and (Pt/TiO2)RGO-2 catalysts, it is noted that the supported rGO sheets can further improve the absorption for visible light due to the electronic coupling between states of rGO and conduction band states of TiO2.For enhancing CO2 adsorption capacity, wrapping rGO sheets play the main role owing to their identical nonpolar property and abundant electron cloud supported by the results of CO2-TPD and CO2-adsorption DRIFTS spectra (Fig. 10). For effective separation efficiency of photogenerated charges, the rapidly interfacial charge transfers from the surface heterojunction of 101 and 001 facets to Pt NPs and subsequent to rGO shell.Primarily, anatase TiO2 nanocrystals are excited to produce electron-hole pairs by absorbed photons.The coexposed 101 and 001 facets of anatase TiO2 nanocrystals can form a surface heterojunction, which is beneficial to effective separation of photogenerated electrons and holes.And then photogenerated electrons in the CB of TiO2 transfer to supported Pt NPs.Combined the results of XPS (Fig. 5), PL (Fig. 8) and transient photocurrent (Fig. 9), the increasing of surface Pt species has strong capacity to capture the Finally, the photogenerated electrons are enriched on the tiny surface region of wrapping rGO shell, and subsequently react with the adsorbed CO2 to CH4.In order to verify the vectorial electron transfer of TiO2PtrGO, the experiment of Ag photodeposition on the surface of (Pt/TiO2)rGO-2 catalyst was carried out by irradiation with same light source of CO2 reduction test for 30 min, and the results are shown in Fig. S11.The TEM images of Ag photodeposition over (Pt/TiO2)rGO-2 catalyst.Ag NPs with large sizes are almost deposited selectively on the surface of wrapping rGO shell and Ag/(Pt/TiO2)rGO structure is formed.It indicates that the surface electron-rich region of wrapping RGO sheets is the active site of (Pt/TiO2)rGO-2 catalysts, which also proves the vectorial electron transfer of TiO2PtrGO. Based on the discussion above, the mechanism for the photoreduction CO2 with H2O over (Pt/TiO2)rGO catalysts is proposed and vividly shown in and decrease the yield of photogenerated charges.There is a balance between the maximum positive and the minimum negative effects.Thus, the optimized rGO-Pt-TiO2 ternary composites are beneficial to the multi-electron process of photocatalytic CO2 conversion, and the unique electron collecting and transfer capabilities of rGO shell promote the selective production of CH4 in photocatalytic CO2 conversion.In other words, the vectorial electron transfer of TiO2PtrGO over the ternary composites system is beneficial to the separation of photogenerated electrons and holes, which can increase the formation rates and selectivity of CH4 for CO2 reduction.Therefore, (Pt/TiO2)rGO catalysts, which takes all advantages of the high separation efficiency of photogenerated electrons and holes and the enhanced adsorption and activation capacities for CO2 reactant, exhibited super photocatalytic performance for selective CO2 conversion to CH4 under the simulated solar irradiation."}, {"title": "Conclusions", "content": "We demonstrated a strategy to fabricate the novel core-shell-structured photocatalysts of (Pt/TiO2)rGO-2 (d), (Pt/TiO2)rGO-5 (e) and (Pt/TiO2)rGO-10 (f) catalysts. HAADF-STEM and EDS elemental mapping images of (Pt/TiO2)rGO-2 catalyst (g). rate of 10 o C min -1 under an Ar flow of 30 cm 3 min -1 .In-situ diffuse reflectance Fourier transform infrared spectroscopy (DRIFTS) were recorded using a thermo Nicolet IS50 injected into the bottom of the reactor.The intensity of incident light was measured to be 80 mW cm -2 by a spectroradiometer.During the light irradiation in 8h, the amounts of H2, CO, and hydrocarbons in the reactor were analyzed by an online gas chromatograph (GC-9560; HuaAiSePu Corp., Shanghai, China) with a flame ionization detector (FID) and a thermal conductivity detector (TCD) each 60 min intervals.The gas products were analyzed by the external standard method.The apparent quantum efficiency (AQE) was measured under the similar photocatalytic reaction condition, and the irradiation light (wavelength 380 nm) using a band-pass filter (full width at half maximum 15 nm) was used as the light source.The incident flux was determined by Radiometer (FZ-A, Photoelectric Instrument Factory of Beijing Normal University).The AQE values for CH4 evolution of CO2 reduction were calculated according to the following equation: CH 4 () 8 the number of evolved CH 4 moleculars number of incident photons 100 TiO2 nanocrystals with white color are deposited successively by Pt NPs and rGO sheets with black color.As shown in Fig.1cof SEM images, pure anatase TiO2 nanocrystals show the homogeneously truncated octahedral bipyramid structure with bare surface clearly.The average particle size of TiO2 nanocrystals is 30 nm estimated by counting more than 100 nanoparticles.And the truncated octahedral bipyramid nanostructure of TiO2 nanocrystal is not influenced by supported Pt nanoparticles via the synthesis process of GBMR method.After further introduction of rGO sheets, the truncated octahedral bipyramid morphology is obscured, and the Pt/TiO2-wrapped ultrathin rGO nanolayer catalysts present a wrinkle-like morphology uniformly, indicating that the core-shell structure of Pt/TiO2 nanocrystals wrapped by rGO sheets can be obtained by a pure chemical bonding reaction successfully.With increasing of the mass ratios of rGO/TiO2, the surface feature of truncated octahedral bipyramid nanocrystals become indistinct and even disappear coexposed 101 and 001 facets on a single anatase TiO2 nanocrystal can form a surface heterojunction owing to different surface energy and band edge positions, which are favorable for the separation of photogenerated carriers.For Pt/TiO2 catalysts, a mass of bare Pt NPs A C C E P T E D M A N U S C R I P T supported on the surface of TiO2 nanocrystals can be clearly observed in Fig. 4b, and the average diameter of Pt NPs with a narrow distribution is 3.3 nm.As shown in inset of Fig. 4b, the lattice fringes (0.22 nm) of one hemispherical Pt NP exhibit clearly the exposed (111) facet, and the crystal fusion domain at the phase interface of Pt-TiO2 shows a strong lattice distortion. in carbon (dark red), and Ti and O elements in the local area of Pt NPs are rare in comparison with surrounding.It indicates that Pt NP is deposited on the surface of TiO2 and subsequently is at 530.6 eV, which is ascribed to Ti-O bonding and surface O-H bonding of TiO2, respectively 55.The deconvolution of O 1s XPS spectrum of the (Pt/TiO2)rGO-2 catalyst obtained by the standard procedure is shown in Fig. S7.Four peaks of binding energies located at 529.1, 529.7, 530.8, and 531.8 eV have been fitted, which are ascribed to Ti-O-Ti (lattice O), C-O-Ti, Ti-OH, and C-OH (and C-O-C) species, respectively56.Being same as the Ti 2p spectra, the Ti-O-Ti peaks for (Pt/TiO2)rGO catalysts also have a positive shift in comparison with TiO2 nanocrystals, which further proves the strong interactions and the electron transfer in the ternary system. bands in the region of 1000-3500 cm -1 .The absorption bands at 1048, 1392, 1628, 1726, and 3432 cm -1 were attributed to the C-O alkoxy, OC-O carboxyl, CC (skeleton of GO), CO photogenerated electrons and holes.After introduction of supported Pt NPs and wrapping rGO photogenerated electrons.The thickness of rGO shell can further optimize the separation Fig.10shows the characterizations of CO2-TPD and CO2-adsorption DRIFTS spectra.As increase the catalytic active sites for the reduction process.Above all, the formation rate and selectivity of CH4 products are dependent on the enrichment degree of electrons and reactants on the surface of photocatalysts, which is strongly related to the nanostructure and the surface property of photocatalysts. photogenerated electrons can further transfer to rGO rather than stay in supported Pt NPs photogenerated electrons form an enriched region on the wrapping rGO shell, where CO2 CO2 is reduced to CH4 by the photogenerated electrons and H .The holes left on the surface of TiO2 photogenerated electrons for CO2 conversion.The wrapping rGO sheets as an efficient electron Fig. 5. XPS of Ti 2p (a), O 1s (b), Pt 4f (c) and C 1s (d) spectra of GO, TiO2, Pt/TiO2, TiO2rGO-2 and (Pt/TiO2)rGO-n catalysts.For clear comparison, the XPS Pt 4f intensities of (Pt/TiO2)rGO-2 and (Pt/TiO2)rGO-10 in (c) are magnified to 1.5 and 2.0 times, respectively.A C C E P T E D M A N U S C R I P T We acknowledge the financial support from the National Natural Science Foundation of China (21673142 and 21477164) and 863 Program of China (2015AA030903). Electronic Supplementary Information (ESI) associated with this article can be found in the online version at http://dx.doi.org/10.1016/j.apcatb.XXXXXX.with H2O over TiO2, Pt/TiO2, TiO2rGO-2 and (Pt/TiO2)rGO-n catalysts. The formation rates, the selectivity of CO and CH4 productions and the apparent quantum efficiency (AQE) for photocatalytic conversion of CO2 with H2O over TiO2 , Pt/TiO2, TiO2rGO-2 and (Pt/TiO2)rGO-n catalysts."}]