[{"title": "Doi", "content": "10.1016/j.apcatb.2006.09.015"}, {"title": "Article_Title", "content": "Dye sensitized artificial photosynthesis in the gas phase over thin and thick TiO2 films under UV and visible light irradiation"}, {"title": "Abstract", "content": "Perylene diimide based organic sensitizers capable of electron generation under illumination were used to initiate gas phase photo reduction reactions on TiO 2 thin and thick film surfaces.For comparison Ru(Bpy) 3 2 dye sensitizers were also studied.The photo reduction of CO 2 was carried out under static conditions in the gas phase.TiO 2 films were coated on hollow glass beads via a sol-gel procedure.Pt was incorporated on the films either by adding the precursor salt in the sol, Pt(in), or by wet impregnation of calcined film with an aqueous solution of the precursor salt, Pt(on).Organic sensitizers were incorporated on the films by wet impregnation of the film from an aqueous solution.Under UV illumination, the methane yields of platinized TiO 2 thin films decreased in the following order: Pt(on)ATiO 2 Pt(in)ATiO 2 TiO 2 .The presence of organic sensitizers inhibited the catalytic activity of pure and platinized TiO 2 thick films under UV illumination.The relative enhancement of the reaction yields in the presence of the organic sensitizer under visible light illumination depended on the presence of Pt as well as the incorporation method of Pt in the TiO 2 structure.The reaction yields were better when Pt was impregnated on the TiO 2 film than when Pt was incorporated in the Ti sol.On the other hand, pure or platinized TiO 2 under visible light illumination was totally inactive indicating the role of the organic dye in generating catalytically active electrons under visible light."}, {"title": "Experimental", "content": "Thin and thick films of TiO 2 were coated on 5 mm o.d. and 7 mm long hollow glass beads.The coating procedure of thin and thick films slightly varied.Thick film coating procedure was described in detail elsewhere 23.For thin film preparation tetra isopropyl ortho titanate (Merck) was used as Ti source.Isopropanol, acetic acid and water were used as solvent, modifier and hydrolyser, respectively.Water amount is very important for sol-gel synthesis technique since it determines the gellation time.The synthesis procedure requires the sol to be stable, i.e. not to gellate, at least for 6 h.To determine the best recipe, which would be stable during the whole procedure, water to tetra isopropyl ortho titanate ratio was selected after several trials and used throughout the study.The sol for TiO 2 coating was prepared by mixing tetra isopropyl ortho titanate, isopropanol, acetic acid and water with following volumetric ratio (6:120:2.5:1).To obtain a more stable sol, water and acetic acid was firstly mixed with half volume of required isopropanol and added to the tetra isopropyl ortho titanate-isopropanol mixture afterwards.Addition was done slowly and the mixture was stirred continuously to provide a good mixing and to prevent local gellation.The coating was established by dipping the beads into the sol with a dipping rate of 7.5 cm/min, waiting for 10 min and pulling them with the same speed.The beads were then dried at 120 8C in air, and calcined at 400 8C for 30 min.This procedure was repeated for three times for a successful coating.Further details of Pt and dye sensitizer (Table 1) addition and details of the reaction set up and methodology can be found in the previous articles 23,24.The film thicknesses were measured from films coated on flat microscope glasses by a DEKTAK profilometer. The reaction tests were performed under UVand visible light illumination.For UV tests a 150 W UVA lamp was used, for visible light tests a 75 W daylight lamp was used.Measurements were taken at 60th, 120th and 180th min of the test run.The products of reaction tests of thin films were analyzed using a HP-4890/A GC equipped with 6 0 Porapak Q column.For the reaction tests with thick films, Varian 3900 GC equipped with Poraplot Q capillary column was used.The settings applied during the experiments are given in Table 2.The results are reported as micromoles of methane produced per gram catalyst.The average weight of the catalysts was determined from a controlled batch."}, {"title": "Results_and_discussion", "content": "In this study, both thin and thick films were synthesized and tested for their photocatalytic carbon dioxide reduction performances.Thin films synthesized in this project were transparent and the thick films were nearly opaque.Therefore it was expected that the thin films with low bulk TiO 2 content will give higher yields for both UV and visible light experiments when compared to the thick TiO 2 films.Fig. 1 clearly shows that the thin films had a higher photocatalytic activity on a per gram basis under UV light.Similar observations were made for visible light tests on dye-sensitized films which will be presented later.In Fig. 1, comparison between the Pt incorporation methods were also presented.The film thicknesses measured by a DEKTAK profilometer revealed that the film thickness of thin film coats were around 500 nm and the thick films were of the order of a few microns.Although the comparison between the thin films (500 nm) versus thick films (few mm) demonstrate an advantage towards the thin films, when the comparison was based on per bead rather than per gram catalyst, the thick film containing catalysts have methane yields one order of magnitude larger than the thick film containing catalysts, indicating that the thick films have tortuous structures which allow the reactants access to sites that are not necessarily located on the surface.Furthermore, carrier mobility and lifetimes are extended in thick films capable of absorbing more of the incident radiation 2. As can be seen, under UV irradiation Pt containing catalysts performed better than pure TiO 2 films, regardless of the film thickness.In order to measure the accessible metal amounts, a modified volumetric chemisorption technique 25 was used and measurements were performed in the same manifold where the reaction tests were carried out.Chemisorption measurements on pure TiO 2 and Pt(in)ATiO 2 yielded no observable hydrogen chemisorption while on Pt(on)ATiO 2 catalysts, 0.24 mmol H (atom)/g catalyst was strongly bound.Since the interferences from a strongly bound spilled over hydrogen cannot be excluded, this result can only be qualitatively used for the presence and accessibility of surface metal sites.Pt(on) catalysts systematically performed better than Pt(in) catalysts.Pt(on) films have metal clusters on the films assisting charge separation by a Schottky effect, while Pt(in) catalysts have Pt dispersed in the TiO 2 framework, probably in oxide form.In such a dispersed form, Pt(in) TiO 2 may modify the bulk structure and therefore the band gap of TiO 2 , but apparently, it is more advantageous to use the metals on the films.Although charge separation by Schottky barriers formed at the metal semiconductor interfaces are argued here for the improved performance of the Pt(on)ATiO 2 films, one cannot exclude the catalytic activity of Pt itself in the overall mechanism.For example, Pt sites are known to assist generation of spilled over hydrogen.It can be highly probable that photogenerated hydrogen on TiO 2 surfaces can reverse spillover to Pt sites for further chemistry. UV tests on Ru(Bpy) 3 2 containing thin films are presented in Fig. 2. Due to the limited amount of dyes investigated in this work, UV tests on thin films were only performed with Ru(Bpy) 3 2 dye.At the earlier stages of the reaction, hydrogen evolution on Ru(Bpy) 3 2 containing catalysts was also observed but not quantified.It can be seen from Fig. 2 that the addition of Ru(Bpy) 3 2 enhanced methane yields of the reaction both in the presence and in the absence of Pt in the catalyst.Repeated tests on the same films indicated a continuous deactivation, shown in Fig. 3, which we attributed to the degradation of the dye under UV light. On the other hand, the behavior was different when the dye sensitizers were used on thick TiO 2 films.As seen from Fig. 4, sensitizer addition onto TiO 2 thick films resulted in a drastic decrease of methane yields under UV illumination. Ru(Bpy) 3 2 and BrAsp containing catalysts gave similar 3 h yields whereas BrGly containing films had a slightly lower activity.The decrease of the methane yields in the presence of the dye sensitizers can be attributed to several factors.One of these factors is the filtering of UV light in the presence of the dyes coated on thick films.However, the dyes, except RuBpy, are not absorbing UV light as measured on a similar system in a previous work 23.The decrease in methane yields, therefore were attributed to the quenching of the e-h pairs formed in TiO 2 bulk at the sites where dyes were chemisorbed.Photon absorption by the dye and ejection into the conduction band of the semiconductor is expected to take place under visible light irradiation.But during UV irradiation, e-h pairs are generated in the bulk of TiO 2 and transferred to the surface.These e-h pairs can be quenched at the dye-semiconductor interface at the expense of photon emission.At this stage, these arguments are highly speculative, but worthwhile for testing in further studies.The peculiar issue here is the inconsistency in the performance of Ru(Bpy) 3 2 dye under UV irradiation on thin films and thick films.On thin films, Ru(Bpy) 3 2 promoted methane formation both under visible and under UV light, while on thick films, the dye suppressed methane production under UV irradiation.At this point, we have no experimental evidence to describe the discrepancy, than pure speculative argument.UV-Vis characterization of the films with dyes revealed that in addition to characteristics absorption bands of TiO 2 , there is a low wavelength absorption band on Ru(Bpy) 3 2 containing TiO 2 films 23 which indicated that films promoted with Ru(Bpy) 3 2 can also absorb and utilize light in UV wavelengths.On the other hand, the suppression of methane yields on thick films may indicate that e-h pair generation rates in TiO 2 was more facile on thick films than on thin films and annihilation by photon emission process may have suppressed the UV activity of the dye.Because, the incident beam intensity was highly in excess of what was needed to excite the whole lattice in both thin films and thick films.Due to the higher amounts of bulk TiO 2 available in thick films than in thin films it is possible that grater number of charge carriers were generated in thick films -if the film thickness is less than the penetration depth of the UV light -while the amount of the dye on the surface was nearly the same.A dye compound which can eject an electron upon excitation by a photon can also eject a photon in a reverse process.Thus, electrons generated in TiO 2 thick film bulk can travel to the surface and relax by photon ejection by the organic dye. One point to mention at this point is that the films might have been contaminated by Na diffusing from the glass substrate.If such a problem exists, it is obviously going to influence thin films more than thick films. Visible light tests of methane generation were performed on both dye sensitized and pure TiO 2 and Pt containing TiO 2 films.In the absence of dye, the films showed no activity indicating the role of the dye sensitizer in generating the e-h pairs under visible light irradiation.It has to be noted that the methane generation rates were more than one order of magnitude lower under visible light irradiation than under UV irradiation.The ability of e-h pair generation of the dye sensitizers and the possibility of the transfer was demonstrated by these experiments, but it was also shown that the rates or amounts of generation were lower than UV irradiated TiO 2 . The generation and transfer of electrons under visible light irradiation in the dye sensitizers depend on the amount of the dye, the efficiency of the electron transfer at the interface, which is dictated by the relative positions of the HOMO and LUMO of the dye with respect to the valance and conduction bands of the solid 26, and the adsorption site of the dye on the solid 27.Both in thin and thick films, Pt promoted dye sensitized films showed highest activity as can be seen in Figs. 5 and6.In Fig. 6, it can be clearly observed that a suppression of visible light activity was observed on dye.Pt(in)ATiO 2 catalysts (for reference here only the results of BrAsp containing film is presented, the other dyes have exhibited similar trends 23).It must be noted here that only Pt(in)ATiO 2 thin film catalysts were prepared and their superior performance to dye on pure TiO 2 films is attributed to the presence of Pt on the exterior surface of the films.The relatively poor performance of dyeAPt(in)ATiO 2 in comparison to the dyeAPt(on)ATiO 2 or dyeATiO 2 films is attributed to the bulk electronic structure modification of TiO 2 films in the presence of Pt in the bulk TiO 2 framework.A band gap modification in the presence of Pt in the lattice can alter the valance and conduction band levels of TiO 2 such that the efficiency of the electron transfer decreases.On the other hand, dyeAPt(on)ATiO 2 films always had the highest methane production yields, indicating improved capability of the films in the presence of Pt on the surface.Pt on the surface can assist the photocatalysis several ways.First of all, the metal clusters can form Schottky barriers across the metal semiconductor interface and assist the charge separation as in the case of UV irradiation.Second, metal sites act as the binding centers for dye, the dyes can bind the metal more efficiently than they can to TiO 2 .In such a case, one can expect higher coverages of dye compounds.Third, it has been reported that the geometrical arrangement of the organic molecules on the surface depends on the surface electronic structure 28.Thus, one should expect different photon absorption and electron emission characteristics of the dye compounds when they are adsorbed on a metal or on a semiconductor.Finally, the electron transfer processes in dye-on-metal-on-semiconductor are different 29,30.The transfer of the electrons from a dye sensitizer can take place between the HOMO and LUMO levels of the dye and valance and conduction bands of the solid.But in the presence of metal, the electron transfer process goes from the dye, to the metal to the semiconductor.Therefore, in addition to the relative levels of the LUMO and the conduction band of the semiconductor, the Fermi level of the metal also becomes important during the charge transport processes.Higher efficiencies observed on Au/ TiO 2 surfaces in the presence of a dye in dye-sensitized solar cells are consistent with our findings in this work on dye promoted Pt-TiO 2 films 29,30. Finally, in Fig. 7, we compared the performances of the three dyes on thin and thick film catalysts under visible light irradiation.As in the case of UV tests shown in Fig. 1, thin film catalysts performed better under visible light in the presence of dye sensitizers. It is worthwhile to conclude this article by mentioning that methane is not the best and the most desirable product of artificial photosynthesis.In fact, to be able to synthesize a more complex molecule such as methanol is more effective in terms of the storage of the solar energy in chemical bonds as well as the additional advantages of the material storage of methanol, a liquid under ambient conditions, over methane.Yamashita et al. have reported that methanol production is observed on the tetrahedrally coordinated Ti-oxide species, where as bulk titania and octahedrally coordinated Ti-oxide catalysts promoted methane production 5.The ultimate aim in the field is to be able to understand the process in order to tailor the catalysts, the dye compounds and the operating conditions such that one is able to control and stop the reaction at a two electron transfer process step such as CO -a key feedstock in chemical industry, at a six electron process, such as methanol -instead of an eight electron transfer process such as methane."}, {"title": "Conclusions", "content": "Dye sensitized Pt promoted TiO 2 thin and thick films were prepared and their activity for photo reduction of CO 2 under UV and visible light were tested.Dye sensitizers acted as filters under UV irradiation suppressing the methane production ability of TiO 2 thick films.On the other hand, pure and Pt containing TiO 2 films were inactive under visible light irradiation.They were activated in the presence of organic dye sensitizers.The activity of the dyeAPt(on)ATiO 2 catalysts were the highest indicating a multifold mechanism in the electron transfer processes.The experimental results indicated enhanced activity when more carboxylic acid groups were present. AbbreviationChemical formula Molecular structureRu(Bpy) 3 2 Tris(2,2 0 -bipyridyl) ruthenium(II) chloride Fig. 2. Methane yields of TiO 2 , Pt(in)ATiO 2 , Ru(Bpy) 3 2 ATiO 2 and Ru(Bpy) 3 2 APt(in)ATiO 2 thin film catalysts under UV light. Fig. 1.Comparison of methane yields of thick and thin films under UV light. Fig. 5. Methane yields of Ru(Bpy) 3 2 APt(in)ATiO 2 , BrGlyAPt(in)ATiO 2 and BrAspAPt(in)ATiO 2 thin film catalysts under visible light.Fig. 4. UV activity of pure and dye sensitized TiO 2 films. Fig. 3. Deactivation of Ru(Bpy) 3 2 APt(in)ATiO 2 catalyst under UV light during three consecutive test runs. Fig. 7. Comparison of methane yields of thick and thin films of LHMAPt(in)ATiO 2 catalysts under visible light.Thick film data are taken from Ref. 23. Fig. 6.Methane yields of BrAspATiO 2 , BrAspAPt(in)ATiO 2 and BrAspAP-PtoncdotTiO2thickfilmcatalystsundervisiblelight: Financial support from TUBITAK under research grant no MISAG 96 is gratefully acknowledged.Further support was provided by Middle East Technical University BAP-2004-07-02-00-100 and YUUP-BAP 2004-08-11-06 Projects.The authors thank Orcun Ergun and Bilkent University, Physics Department for the film thickness measurements."}]