[
  {
    "title": "Doi",
    "content": "10.1039/x0xx00000x"
  },
  {
    "title": "Article_Title",
    "content": "Metal-free Azo-bridged Porphyrin Porous Organic Polymers for Visible-light-driven CO 2 Reduction to CO with High Selectivity"
  },
  {
    "title": "Abstract",
    "content": "Two nitrogen-rich azo-bridged porphyrin porous organic polymers (Azo-Por-Bpy-POP and Azo-Por-Dadp-POP) with high surface areas were prepared by coupling 5,10,15,20-tetra(p-nitrophenyl)-porphyrin with the aromatic amines of 2,2'bipyridine-5,5'-diamine (Bpy) and diaminodiphenyl (Dadp).Azo-Por-Bpy-POP and Azo-Por-Dadp-POP display high photocatalytic reduction activity for CO 2 to CO under visible-light irradiation without a sacrificial reagent or metal cocatalyst.Azo-Por-Bpy-POP exhibits the highest photoreduction for CO 2 with CO as the only carbonaceous reduction product with a production rate of 38.75 mol g -1 h -1 .Theoretical investigations indicate a stronger electrostatic interaction between CO 2 and Azo-Por-Bpy-POP than Azo-Por-Dadp-POP, which favors CO 2 photoreduction."
  },
  {
    "title": "Experimental",
    "content": "TNPor was prepared according to published method. 30All other reagents were purchased from commercial sources and used without further purification.As shown in Scheme 1, Azo-Por-Bpy-POP was synthesized by coupling TNPor and Bpy.Specifically, metal-free TNPor (0.15 mmol, 119.1 mg), Bpy (0.30 mmol, 56.07 mg), and KOH (7.55 mmol, 423 mg) were dispersed in 8 mL of nitrogen (N 2 )-purged dimethyl formamide (DMF).The mixture was stirred at 150C for 24 h under a N 2 atmosphere.Then the resulting mixture was cooled to room temperature and the dark purple solid was collected by filtration and washed by water.The residue was then immersed in DMF and allowed to stand for 24 h.The solid was then collected by filtration and washed with DMF, H 2 O, and methanol.The dark purple product was dried at 90C in a vacuum drying oven for 12 h, affording 136 mg of Azo-Por-Bpy-POP (yield 83).Following the same procedure, Azo-Por-Dadp-POP was obtained in the yield of 78. In a typical experiment, 4 mg of Azo-Por-X-POP catalyst (where X Bpy or Dadp) was dispersed in 3 mL of ethanol and sonicated for 120 min.The mixture was then deposited dropwisely onto a glass sheet with dimensions of 2.5 cm 2.5 cm.The catalyst-loaded glass sheet was dried at 60C in a vacuum drying oven for 30 min and then cooled to room temperature before being subjected to tests.The average loading of the relevant catalyst was 0.2 mg.The catalyst-loaded glass sheet was then loaded into a 475-mL-volume photoreactor, and 1.63 g of NaHCO 3 was placed uniformly at the bottom of the reactor, followed by thorough pumping vacuum at a section in Fig. S1B.Then, 5 mL of H 2 SO 4 (40) was injected into the vacuum photoreactor from b section in Fig. S1B to react with NaHCO 3 to afford 1 atm CO 2 gas, and the temperature was kept at 25 C using circulating water.After waiting 1 h to achieve the adsorption equilibrium of CO 2 on the surface of the polymer catalyst, the reactor was irradiated for the desired time using a 300 W Xe lamp equipped with a cutoff filter ( 400 nm).This visible-light source was positioned 5 cm above the glass sheet in the reactor.After irradiating for a given time interval, 1.5 mL of the gaseous sample was extracted from c section of the reactor in Fig. S1B and analyzed by gas chromatography equipped with a flame ionization detector and high active Ni convertor (4890II, Beijing China Education Au-Light Co., Ltd., P. R. China) with N 2 as the carrier gas."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The Fourier-transform infrared (FT-IR) spectra of Bpy, TNPor, and Azo-Por-Bpy-POP are shown in Fig. 1A.The peak at 1460 cm -1 in the spectrum of Azo-Por-Bpy-POP was assigned to the characteristic -NN-stretching band, confirming the formation of the azo compound.Peaks at 1344 and 1520 cm -1 attributed to the N-O stretching were attenuated because of the formation of the azo linkage with the amine. 31,32 rmation of the azo compound was further suggested by the signals at around 152.5 ppm in the 13 C CP-MAS NMR spectrum of Azo-Por-Bpy-POP, which was assigned to the carbon directly bound to the azo group, Fig. 1B. 31X-ray photoelectron spectroscopy (XPS) result also suggests the presence of azo bonds in Azo-Por-Bpy-POP and TNPor.As shown in Figs.1C andS2, one new N species was observed in the XPS spectrum of Azo-Por-Bpy-POP at 399.6 eV, which corresponds to the N moiety of the -NN-group.Compared with the starting material of TNPor and Bpy, the XPS peak of Azo-Por-Bpy-POP at 405.9 eV was strongly attenuated because of the condensation of TNPor and Bpy.therefore expected to facilitate the adsorption and activation of CO 2 at the surfaces of the polymers. The optical and electronic properties of Azo-Por-Bpy-POP and Azo-Por-Dadp-POP were then investigated to determine their potential for the photoreduction of CO 2 .Ultraviolet-visible diffuse reflectance (UV-vis DRS) spectra of Azo-Por-Bpy-POP and Azo-Por-Dadp-POP show red-shifted absorption edge compared with that of the monomer TNPor, Fig. 3C, due probably to the formation of large conjugated systems in Azo-Por-Bpy-POP and Azo-Por-Dadp-POP.The charge-transfer abilities of Azo-Por-Bpy-POP and Azo-Por-Dadp-POP were examined by photocurrent spectroscopy, Fig. 3D, which shows fast and repeatable photocurrent responses.In the two materials, Azo-Por-Bpy-POP shows the higher photocurrent of 2.6 A cm -2 . Since Azo-Por-Bpy-POP and Azo-Por-Dadp-POP exhibit good CO 2 adsorption, broad absorption, and excellent photocurrent responses, we therefore applied them in the photoreduction of CO 2 without using the sacrificial reagent.Photoreduction was carried out by irradiating with a visiblelight source ( 400 nm) for 4 h at ambient pressure.The results indicate that Azo-Por-Bpy-POP and Azo-Por-Dadp-POP are effective for the photoreduction of CO 2 with H 2 O, Fig. 4A, producing CO as the only carbonaceous reduction product.In a good contrast to the low CO 2 reduction ability of the monomer TNPor with a CO productive rate of 9 mol g -1 h -1 , the polymers Azo-Por-Bpy-POP and Azo-Por-Dadp-POP afford CO yields of 38.75 and 15 mol g -1 h -1 , respectively.Obviously, Azo-Por-Bpy-POP shows excellent photocatalyst performance, Please do not adjust margins Please do not adjust margins ranking among the best results reported to data for photocatalysts in the absence of sacrificial reagents. 12,13,333435 To eliminate the possibility of any influence by the as-prepared material, N 2 was pumped into the photoreactor in place of CO 2 for the photoreaction, and CO was not detected.Furthermore, no CO was detected during reaction in the dark or in the absence of the photocatalyst.These results further support that Azo-Por-Bpy-POP and Azo-Por-Dadp-POP are efficient photocatalysts for reducing CO 2 .To assess their sustainability and reusability, Azo-Por-Bpy-POP was irradiated for 14 h and also subjected to consecutive photocatalytic reduction cycles. As shown in Fig. 4B, the total amount of CO product was 200.5 mol g -1 after 14 h of irradiation.In addition, Azo-Por-Bpy-POP maintains a high photocatalysis capacity for CO 2 reduction after three consecutive cycles.The FT-IR spectra of Azo-Por-Bpy-POP before and after photocatalysis are compared in Fig. S7.Negligible change before and after the reaction indicates the good stability of Azo-Por-Bpy-POP during the photocatalytic reaction. To investigate the mechanism of the photoreduction of CO 2 , Mott-Schottky curves and Tauc plots were determined for Azo-Por-Bpy-POP.As displayed in Fig. 4C, the positive slopes of the Mott-Schottky plots indicate the typical n-type semiconductor nature of Azo-Por-Bpy-POP. 13The relative conduction band (CB) position of Azo-Por-Bpy-POP could be estimated from the Mott-Schottky curve, amounting to -0.90 V.The optical band gap of Azo-Por-Bpy-POP was estimated from the Tauc plot, ca.position of Azo-Por-Bpy-POP was calculated to be 1.43 V by connecting the band gaps with the relative CB position.Fig. S8 shows the electronic band structure of Azo-Por-Bpy-POP.According to the previous reports, a more negative CB potential than CO 2 reduction potential (CO/CO 2 , theoretically -0.53 V vs NHE, pH 7) together with more positive VB potential than H 2 O oxidation potential (O 2 /H 2 O, theoretically 0.82 V vs NHE, pH 7) for the photocatalyst was necessary to the photoreduction of CO 2 in combination with oxidation of H 2 O. 12 The CB and VB positions of Azo-Por-Bpy-POP straddle the potentials for the reduction of CO 2 to CO and H 2 O oxidation to O 2 suggesting the likely photocatalytic reduction suitability of Azo-Por-Bpy-POP for converting CO 2 to CO. Towards understanding the above experimental observations, theoretical investigations were carried out at the B3LYP-D3/6-31G(d,p) level of theory.We optimized the geometries of the Azo-Por-Bpy-POP and Azo-Por-Dadp-POP model systems, Fig. 5.The absorbing states of the two model systems and CO 2 were also optimized with the same level of theory.Frequency calculations were performed to confirm that they are real local minima and to obtain thermochemical data under standard conditions.The initial absorption of CO 2 on the surface of the catalyst was always the rate-limiting step, on the basis of previous reports. 1,36Fig. 5 displays the electron density surfaces with electrostatic potential regions for Azo-Por-Bpy-POP, Azo-Por-Dadp-POP, and CO 2 .Three regions have negative electrostatic potentials in Azo-Por-Bpy-POP and Azo-Por-Dadp-POP.They are possible sites for the binding of CO 2 at the carbon atom, which have a strong positive electrostatic potential.The larger area of negative charge on Azo-Por-Bpy-POP indicates a higher electrostatic interaction to CO 2 than for Azo-Por-Dadp-POP.We calculated the binding energy (BE) in the Gibbs free energy using the equation, BE(in Gibbs free energy) G Binding state -(G Azo-Por-X-POP G CO2 ), where G Binding state is the binding energy in Gibbs free energy, G Azo-Por-X-POP is the Gibbs free energy of Azo-Por-X-PoP, and G CO2 is the Gibbs free energy of CO 2 .The enthalpies and entropies were calculated with a similar equation.As shown in the bottom of Fig. 5, the binding enthalpies of CO 2 to Azo-Por-Bpy-POP are -5.0,-5.2, and -7.2 kcal mol -1 at the binding sites a, b, and c, respectively.The binding enthalpies of CO 2 to Azo-Por-Dadp-POP are -4.9, -2.1, and -7.2 kcal mol -1 at the binding sites a, b, and c.The binding process occurs with an increase in entropy, resulting in the final binding Gibbs free energies of CO 2 to Azo-Por-Bpy-POP of 3.2, 1.1, and -1.0 kcal mol -1 at the binding sites a, b, and c, respectively.The final binding Gibbs free energies of CO 2 to Azo-Por-Dadp-POP are 3.0, 5.9, and 0.9 kcal mol -1 at the binding sites a, b, and c.These results reveal the endoenergetic nature of the binding process, indicating that an increase in reaction temperature is needed.In addition, the binding Gibbs free energy of CO 2 to Azo-Por-Bpy-POP is 4.8 kcal mol -1 lower than that of CO 2 to Azo-Por-Dadp-POP.These could result in higher efficiency of Azo-Por-Bpy-POP in converting CO 2 to CO than Azo-Por-Dadp-POP."
  },
  {
    "title": "Conclusions",
    "content": "Briefly summarizing above, two azo-bridged porphyrin POPs have been synthesized by coupling reactions.Both POPs show high photocatalytic reduction activity for CO 2 to CO without requiring a sacrificial reagent or metal co-catalyst.In particular, the large electrostatic interaction between CO 2 and the BPY-connected/attached porphyrin POP results in excellent photoreduction for CO 2 with 100 selectivity and good sustainability.The present result provides new insight for designing efficient photocatalytic polymers for solar-energy conversion. Scheme 1.The preparation of Azo-Por-X-POP by coupling reaction. Fig. 1. (A) FT-IR spectra of BPY, TNPP, and Azo-Por-Bpy-POP; (B) 13 C CP-MAS NMR spectrum of Azo-Por-Bpy-POP; XPS spectra of the N 1s region for (C) Azo-Por-Bpy-POP and (D) TNPor. Fig. 3. (A) N 2 adsorption and desorption isotherms of Azo-Por-Bpy-POP with pore size distribution shown inset; (B) CO 2 sorption isotherms of Azo-Por-Bpy-POP and Azo-Por-Dadp-POP collected at 298 K; (C) UV-vis DRS spectra of Azo-Por-Bpy-POP, Azo-Por-Dadp-POP, and TNPor; (D) Transient photocurrent responses of Azo-Por-Bpy-POP and Azo-Por-Dadp-POP. May 2020.Downloaded by Uppsala University on 5/22/2020 9:24:43 AM.J. Name., 2012, 00, 1-3 This journal is The Royal Society of Chemistry 20xx 2.33 eV, Fig. 4D.The valence band (VB) Fig. 4. (A) CO 2 photoreduction performance for photocatalytic systems containing Azo-Por-Bpy-POP, Azo-Por-Dadp-POP and TNPor during a 4 h reaction; (B) Photocatalytic evolution of CO by Azo-Por-Bpy-POP under 1 atm, with stability tests of Azo-Por-Bpy-POP for the selective photoreduction of CO 2 shown inset; (C) Mott-Schottky plots of Azo-Por-Bpy-POP, for electrodes in 0.5 M Na 2 SO 4 at pH 6.8; (D) Tauc plot and extrapolated bandgap of Azo-Por-Bpy-POP. May 2020.Downloaded by Uppsala University on 5/22/2020 9:24:43 AM.View Article Online DOI: 10.1039/D0DT01436B Please do not adjust margins Please do not adjust margins Fig. 5. Electron density surfaces for (A) Azo-Por-Bpy-POP, (B) Azo-Por-Dadp-POP and (C) CO 2 .Red, green, and blue regions indicate negative, neutral, and positive electrostatic potentials, respectively.The binding energies (BE) of CO 2 and Azo-Por-Bpy-POP or Azo-Por-Dadp-POP in the Gibbs free energy and enthalpies (in parentheses) at three possible binding sites are given at the bottom.The electron density surfaces and binding energies were calculated at the B3LYP/6-31G(d,p) level of theory, where the empirical dispersion was also considered. May 2020.Downloaded by Uppsala University on 5/22/2020 9:24:43 AM.View Article Online DOI: 10.1039/D0DT01436B This journal is The Royal Society of Chemistry 20xx J. Name., 2013, 00, 1-3 5 We thank the financial support from the Natural Science Foundation of China (No. 51802082), Key Scientific and Technological Project of Henan Province (No. 192102310231, 202102310595), Key Scientific Research Project of Henan Provincial Education Department (19B150006), Innovative Training Project for College Students of Henan Province (S201910467002), Training Plan for University's Young Backbone Teachers of Henan Province (2019GGJS170).The authors thank the financial support from the Henan Institute of Science and Technology (2017040). There are no conflicts to declare."
  }
]