[
  {
    "title": "Doi",
    "content": "10.1016/j.physe.2015.12.001"
  },
  {
    "title": "Article_Title",
    "content": "Synthesis of Hierarchical (BiO) 2 CO 3 Nanosheets Microspheres toward Efficient Photocatalystic Reduction of CO 2 into CO"
  },
  {
    "title": "Abstract",
    "content": "Hierarchical (BiO) 2 CO 3 nanosheets microspheres were synthesized with dry ice as carbon source, and showed much higher photocatalytic activity for CO 2 reduction than BiOCl and TiO 2 ."
  },
  {
    "title": "Experimental",
    "content": "2 g dry ice was added into the 20 mL Bi(NO 3 ) 3 5H 2 O (0.5 mol/ L) ethanol solution with continuously magnetic stirring about 3 h.After reaction, the precipitate was obtained by centrifugation, then washed successively with ethanol and distilled water three times.Finally, it was dried at 80 C. X-ray diffraction patterns (XRD) spectrum was tested by a Bruker D8 advance X-ray diffractometer at room temperature using Cu K radiation.Scanning electron microscope (SEM) images were recorded by a FEI Emission Scanning Electron Microscope (SU8020, Hitachi).Transmission electron microscopy (TEM) and high-resolution TEM images were analysed by a JEOL JEM-2100F Field Emission Electron Microscope.Perkin-Elmer Lambda 650s spectrophotometer (Thermo Fisher, America) was used to record the UV-vis diffuse reflectance spectra (DRS) with BaSO 4 as a reference.X-Ray photoelectron spectroscopy (XPS) measurements were carried out using a ESCALAB 250XI X spectrometer (Thermo Electron Corporation) with an Ar Ka X-ray source, and the spectra calibrated to the C 1s peak at 284.6 eV. In the photocatalytic reduction of CO 2 , 0.1 g of the catalyst was uniformly dispersed onto the glass reactor with an area of 5.4 cm 2 .The light source in the above photoreactivity experiments was a 300 W Xe lamp (Beijing Trusttech Co. Ltd, PLS-SXE-300UV).Visible light irradiation was obtained by using a 400 nm long pass glass filter to remove UV.The volume of the reaction system was about 270 mL.The reaction setup was vacuum-treated several times, and then the high purity of CO 2 gas was followed into the reaction setup for reaching ambient pressure.A total of 1 mL of deionized water was injected into the reaction system as the reducer.Photocatalysts were allowed to equilibrate in the CO 2 /H 2 O atmosphere for several hours to ensure that the adsorption of gas molecules was complete.During irradiation at room temperature, about 0.5 mL of gas was continually taken from the reaction cell at given time intervals for subsequent CH 4 concentration analysis by using a gas chromatograph (GC-14B and GC8A; Shimadzu Corp., Japan).Control experiments showed no appreciable reduced C1 or C2 products were detected in the absence of H 2 O, CO 2 , photocatalyst or light irradiation, illustrating that H 2 O, CO 2 , photocatalyst and light irradiation were necessary for the photocatalytic CO 2 reduction."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Fig. 1 shows the XRD pattern of (BiO) 2 CO 3 .It can be seen that the XRD pattern is in agreement with is in agreement with previous reported results about (BiO) 2 CO 3 , 15,16 which can be indexed with the standard tetragonal (BiO) 2 CO 3 structure (JCPDS 00-041-1488, unit cell parameters: a14b140.3865nm, and c14 1.3675 nm). In order to analyze the valence state of all atoms of (BiO) 2 CO 3 , the XPS spectrum of are showed in Fig. 2. The survey XPS spectrum (Fig. 2a) showed that (BiO) 2 CO 3 only consist of Bi, O and C elements.The XPS peaks of Bi 4f 7/2 and Bi 4f 5/2 of (BiO) 2 CO 3 was at 159.5 and 164.8 eV, respectively(Fig.2b).15,16 It implies that Bi atoms in(BiO) 2 CO 3 are Bi 3 .Fig. 2c shows the C1s high-resolution XPS peaks.the C element for pure BiOI should be carbon pollution Figs.4a andb are the TEM images of (BiO) 2 CO 3 .It can be seen that the first structure (microspheres) and the second structure (2D ultrathin nanosheets), and the thickness of (BiO) 2 CO 3 nanosheet is about 7 nm, which is in agreement with the SEM result.In order to analyse the crystal structure of (BiO) 2 CO 3 , the highresolution transmission electron microscopy (HRTEM) and fast-Fourier transform (FFT) images are showed in Figs.4c andd.As shown in Fig. 4c, the single (BiO) 2 CO 3 nanosheet with top orientation reveals clear lattice spacing (0.14 nm), which can be indexed to 220 facets of (BiO) 2 CO 3 .The corresponding FFT pattern shows the diffraction spot of 220 facets of (BiO) 2 CO 3 .The single (BiO) 2 CO 3 nanosheet with side orientation reveals clear lattice spacing (0.69 nm), which can be indexed to 002 facets of (BiO) 2 CO 3 .the above data showed that the main exposed facets were 001 for (BiO) 2 CO 3 , which in agreement with previous works 15,16. Fig. 5 shows the UV-vis diffuse absorption spectra of (BiO) 2 CO 3 .It can be seen that (BiO) 2 CO 3 have absorption in the UV light region, and The absorption edge are about 376 nm.The band gap energy (Eg) can be evaluated by Eg141240/.Where and Eg represent the absorption edge and band gap (Eg values), respectively.So, the Eg of (BiO) 2 CO 3 is about 3.30 eV, respectively. We perform CO 2 and gaseous H 2 O photocatalysis in a gas-solid system over TiO 2 , BiOCl and (BiO) 2 CO 3 under sunlight irradiation in the absence of any co-catalysts.Gas chromatographic analysis shows that CO was exclusively obtained as the reduction product without detectable CH 3 OH, H 2 , and CH 4 as secondary products.A control experiment showed no appreciable reduced C1 or C2 products were detected in the absence TiO 2 , BiOCl and (BiO) 2 CO 3 under sunlight irradiation.The gross yield in CO increased with the photolysis time (Fig. 6), and the total yield of CO of (BiO) 2 CO 3 obtained in the experiment after 8 h of continuous irradiation was 3.18 mol.In comparison, the total yield of CO of TiO 2 and BiOCl only was 0.05 mol and 0.42 mol, respectively. The carrier separation efficiency also affects the photocatalytic activity strongly.The higher PL peak intensity reflects the higher recombination efficiency.As shown in Fig. 7, the higher PL peak intensity of (BiO) 2 CO 3 less than TiO 2 and BiOCl.It indicates that the separation efficiency of photo-generated electrons and holes of (BiO) 2 CO 3 should be better than TiO 2 and BiOCl.The reason may be due to the large interlayer spacing (1.3675 nm)."
  },
  {
    "title": "Conclusions",
    "content": "hierarchical (BiO) 2 CO 3 nanosheets microspheres were synthesized, and characterized by XRD, XPS, SEM, HRTEM and DRS detailedly.The photocatalytic results showed that (BiO) 2 CO 3 display much higher photocatalytic activity than TiO 2 and BiOCl under UV-visible light.The photocatalytic mechanism study showed that (BiO) 2 CO 3 have display better carriers separation efficiency and higher photocurrent due to the large interlayer spacing. Fig.1.XRD patterns of (BiO) 2 CO 3 . Fig. 2. Survey XPS spectrums (a) and high-resolution XPS spectras of (BiO) 2 CO 3 : Bi 4f (b) and C 1s (c). Fig. 3. SEM images of (BiO) 2 CO 3 . Fig. 4. TEM images of (BiO) 2 CO 3 (a and b), HRTEM image of (BiO) 2 CO 3 with top view (c), HRTEM image of (BiO) 2 CO 3 with side view (d), distribution diagram of elements (e). Fig. 5. UV A vis DRS spectra of (BiO) 2 CO 3 .Fig. 6.CO generation over TiO 2 , BiOCl and (BiO) 2 CO 3 under sunlight irradiation. This work was supported by the key petrochemical joint fund Program from the National Natural Science Foundation of China (No.U1262209)."
  }
]