[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2017.03.051"
  },
  {
    "title": "Article_Title",
    "content": "CeO 2-x platelet from monometallic cerium layered double hydroxides and its photocatalytic reduction of CO 2"
  },
  {
    "title": "Abstract",
    "content": "Highligts Novel monometallic cerium layered double hydroxides (MCe-LDHs) Mixed Ce 3 and Ce 4 oxidation states in MCe-LDHs Platelet-structured cerium oxide obtained by the heat treatment of MCe-LDHs Enhanced photocatalytic activity of MCe-LDH-800 due to its higher Ce 3 /Ce 4 ratio ABSTRCT: Monometallic cerium layered double hydroxides (MCe-LDHs) were successfully synthesized for the first time through a simple approach.XRD, TEM, SEM, XPS, FT-IR, TG-DSC techniques and UV-vis diffuse reflectance spectroscopy were used to characterize the samples.The obtained MCe-LDHs showed typical layered structure composing of quasi-hexagonal platelets with side length of about 2 m and thickness about tens of nanometers, and preserved its platelet morphology after heat treatment at up to 800 o C. Our study also revealed that the heat-treatments at different temperatures could be employed to tune the concentration ratio of Ce 3 /Ce 4 and the surface area of those cerium oxide platelets, both of which play a key role in the photocatalytic activity towards photoreduction of CO2."
  },
  {
    "title": "Experimental",
    "content": "All the chemicals were analytical grade and used as received without further purification.Monometallic cerium layered double hydroxides (Ce 3 Ce 4 -LDHs) were synthesized by a renewed homogeneous alkalization route.Briefly, Ce(NO3)36H2O (1mmol), NaCl (13mmol), hexamethylenetetramine (HMT) (5mmol) and (NH4)2S2O8 (01.5mmol) were dissolved in 200 mL of water to produce a clear solution.The resulting solution was refluxed under Argon protection for 20 h.The precipitate was then formed, filtered and washed with deionized water and ethanol in turns before being dried in air at room temperature.Moreover, The as-synthesized Ce 3 Ce 4 -LDHs were calcined at 400 o C, 600 o C, 800 o C and 1000 o C for 6 h in air to study the influences of calcination temperature on its photocatalytic activity.The calcined products were denoted as MCe-LDH-x, where x represents the calcination temperature. The content of cerium in the prepared material was determined by inductively coupled plasma (ICP) atomic emission spectroscopy on an Agilent 725 spectrometer. The Ce 4 content was determined with iodometric titrations reported by Pierre Vialat 21, and anions were analyzed by ion chromatography (ICS-2100).For the determination of OH -, synthesized sample (approximately 0.1 g) was dissolved in 17 cm 3 of standard HCl solution (0.11 M) and then back-titrated with standard NaOH solution (0.15 M) under the monitoring by a pH meter.The pH value of the solution was plotted against the volume of NaOH solution added to identify the titration end point 19.Water content was determined by thermogravimetric differential thermal analysis (TG-DTA) using a Netzsch STA449C instrument in air in the temperature range 25800 o C with a linear temperature ramp of 5 o C per min. The X-ray powder diffraction (XRD) was conducted on a Rigaku D/Max 2200PC diffractometer with CuK radiation (0.15405nm) and operated at 40 mA and 40 kV with a scanning rate of 4 o per min.Morphological and compositional analysis of the synthesized samples were made on a HI-TACHI SU8220 SEM under an operating voltage of 1 kV, and a JEOL-2010F transmission electron micro-scope (TEM) spectrometer at 200 kV.The specific surface area of the synthesized samples were determined by an N2 physisorption and desorption method using a Tristar 3000 BET analyzer at 77 K. Fourier transform infrared (FT-IR) spectra were recorded within a range of 400-4000 cm -1 using KBr pellets on a Varian 3100 FT-IR spectrometer.The surface information and cerium valence state (Ce 3 and Ce 4 ) analysis were detected by X-ray photoelectron spectroscopy (XPS ESCALAB 250).Ultraviolet visible (UV-vis) absorption spectra were recorded by UV-3101PC Shimadzu spectroscope from the scale range of 200800 nm. Photocatalytic activity tests for the reduction of CO2 with H2O were performed in a gas-closed photoreactor with the volume of 500 mL as reported previously 22. Typically, 50 mg photocatalyst was uniformly dispersed on a glass plate (2.5 cm2.5 cm) which was fixed in the center of reactor.Prior to irradiation, high purity CO2 (99.99) gas, monitored by a mass flow controller, was bubbled through deionized water for 20 min to generate a mixture of CO2 and water vapor, and then the reactor was tightly closed and kept in the CO2-H2O atmosphere for at least 30 min to ensure the adsorption-desorption balance.After that, a xenon lamp (300 W) was put at the top of quartz window with the distance of 1 cm, which can irradiate the whole catalyst powder.The photocatalytic CO2 reduction with H2O was performed for 8 h in each run and the reaction temperature was maintained at 25 o C by cooling water circulation. During the irradiation, 1 mL gas was sampled from the glass chamber every one hour for analyzing the reaction products.In this work, the carbonous products were analyzed by a gas chromatograph (GC-2060, Fuli Corp., China) with a flame ionization detector (FID) equipped with a 5A molecular column and a TDX-01 packed column and the evolved H2 and O2 gases were analyzed by a gas chromatography (GC7900, Techcomp) with a thermal conductive detector (TCD) equipped with a 5A molecular sieve column. As for the stability test of photocatalytic activity, the photocatalyst was collected after each run and then heat-treated at 150 o C for two hours before reusing for photoreduction of CO2. Blank experiments were also performed to ensure the elimination of surrounding interferences.And these experiments were conducted at the following conditions: (1) dark experiment with the catalyst and CO2, (2) light irradiation with CO2 in the absence of catalyst, and (3) using N2 instead of CO2 under the same experimental conditions.No products were detected in these reactions."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The material synthesis was started by dissolving Ce(NO3)36H2O, NaCl, HMT and (NH4)2S2O8 in water, followed by refluxing the mixture solution under Argon protection for 20 h.A white precipitate was formed after refluxing for about 1 h, which was continued for further promoted crystallization.In this work, we chose the optimal molar ratio of (NH4)2S2O8/Ce(NO3)3 at 0.6 for the follow-up investigations and the detailed optimization of (NH4)2S2O8/Ce(NO3)3 molar ratio was shown in the supporting information (SI-1). On the basis of chemical analysis results (Table 1), the chemical composition of the as-obtained sample could be determined to be Ce0.98 4 Ce0.92 3 (OH -)4.00(NO3 -)0.32(SO4 2-)1.142.08H2O. XRD pattern of the as-obtained sample (Fig. 1a) shows sharp diffraction peaks with d-spacing values of 0.838 and 0.419 nm in a low-angle region, being characteristic of a typical layered structure.SEM observation of the product reveals that the as-obtained sample is composed of quasi-hexagonal platelets with side length of about 2 m and thickness about tens of nanometers (Fig. 1b).TEM image of the product shows an angle of 120 at the platelet edge, which also suggests that the platelets have a pseudo-hexagonal structure and high crystallinity (Fig. 1c). Two factors have been found highly important in the synthesis of monometallic cerium layered double hydroxide compounds.One is the amount of HMT, which was used to provide alkaline environment by slowly releasing OH -ions upon heating.The amount of HMT was 5 times higher in our case than that in conventional route previously reported; While the other is the use of (NH4)2S2O8 as oxidizer whose function is to effectively convert partial Ce 3 into Ce 4 ; Without either of the two factors, the XRD pattern and SEM image of the obtained sample will be very different from those of the sample obtained in this work 17. FT-IR spectrum of the obtained sample is displayed in Fig. 1d.All the fundamental vibration modes (1, 2, 3, and 4) observed in the spectrum can be assigned to sulfate anions in the interlayer.The 3 mode is split into three separate sub-peaks, which suggests that the sulfate ion (SO4 2-) has coordinated to metal ions as a trans-bidentate ligand through oxygen atom in the structure 23.Other bands at around 1675, 812, and 592 cm -1 account for the bending vibrations of water molecules coordinated to the metal ions.While three peaks around at 3500 cm -1 are assigned to the stretching vibrations of O-H bonds, which indicates the presence of hydroxyl ions because of the metal-OH layer in the crystalline structure 19.Two weak absorption peaks at around 1380 and 1415 cm -1 belong to the vibration modes of NO3 -ions and the asymmetric stretching of O-NO2, respectively 15.On the basis of the structural characteristics disclosed, it is clear that the structure of the layered Ce-hydroxide is similar to that of layered Tb-hydroxysulfate compound reported previously 19.Ce cations are bonded by hydroxyl groups, water molecules, and oxygen atoms from the sulfate group and NO3 ions to form a coordination polyhedron.One hydroxyl group is shared by three Ce cations, connecting the polyhedron to construct the host layer parallel with the a and b axes.The sulfate group bonds with two Ce cations in adjacent layers, linking them in a trans-bidentate configuration (Fig. 2). The as-obtained monometallic cerium layered double hydroxides (MCe-LDHs) were calcined at 400 o C, 600 o C, 800 o C and 1000 o C for 6 h in air.Corresponding XRD patterns (Fig. 3A) show that the peak at about 2 10 o has disappeared after the thermal treatment, attributable to the removal of water molecules and the decomposition of nitrate.And they are in good agreement with the Powder Diffraction Standards data (JCPDS Card: 043-1002) being indexed to a cubic fluorite phase of CeO2-x.It also can be found that the sample become better-crystallized with the increase of calcination temperature, accompanied by the dehydroxylation of hydroxide layer.According to FT-IR spectra (Fig. 3B), the triple 3 modes are present in the spectrum even after calcined at 1000 o C for 6 h in spite of the position shifts of peaks to a certain extent, indicating that sulfate ions in the compounds have basically kept its original configuration after the thermal treatment.SEM images show that the products have preserved the platelet morphology after calcinations at from 400 to 800 o C, as compared to the un-calcined sample.Also, some nano-sized pores are generated on the platelets mainly because of the removal of water molecules and the decompositions of nitrate and hydroxyl from the chemical formula.With the increase of calcination temperature, the density of pores on the platelets increases as seen in Fig. 4(a,b,c).However, after the calcination at 1000 o C, both the platelet morphology and nanopore structure are destroyed and the particles grow much larger (Fig. 4d).As mentioned above, the dehydroxylation of the hydroxide layer and the weight loss are completed at around 800 o C, and then destructions of both the platelet morphology and pore structures follow at calcination temperatures above 800 o C. Fig. SI-2 gives the nitrogen sorption isotherms and specific surface areas of the samples after the calcination, and it can be seen that the MCe-LDH-800 has the highest surface area of 20.5 m 2 /g owing to the complete decomposition of hydroxyls and nitrates and the porous structure generated. Calcination at above 800 o C has led to the porous structure collapse and much decreased surface area. The results of XPS analyses of the samples are shown in Fig. 5.The Ce3d spectrum (Fig. 5A) between 877.5 and 920.0 eV could be deconvoluted into ten bands, which can be divided into two multiplets, labeled as v and u, corresponding to the spin-orbit coupling of 3d 5/2and 3d 3/2 24, respectively.The bands denoted as v (u), v (u), and v (u) can be assigned to the photoemissions from the Ce 4 3d core levels respectively.Meanwhile, the signals v0 (u0) and v (u) are ascribed to photoemissions from Ce 3 cations 25,26.Therefore, it can be confirmed that the framework of the layered structure consists of mixed Ce 3 and Ce 4 oxidation states.These mixed valances of Ce 3 and Ce 4 will be responsible for the high photocatalytic activity in the CO2 reduction with H2O vapor under irradiation, as presented in the following section Fig. 5B shows the O1s XPS spectra of all samples.The O1s spectrum can be deconvoluted into four bands at about 529.3, 529.8, 531.4 and 532.7 eV.The two main bands in between 529.0 and 530.0 eV can be assigned to lattice oxygen (O 2-) in the metal oxides 27,28.The one at about 531.4 eV belongs likely to chemisorbed oxygen (O2 2-).And the band of the highest binding energy (532.7 eV) is ascribed to surface oxygen by hydroxyl species (O2 -) on the surface 29.The chemisorbed oxygen indicates the presence of oxygen vacancy (Vo). UV-vis diffuse reflectance spectra of those samples have been recorded and are shown in Fig. 6(A).It is noted that all the samples show two absorption bands at around 280 and 320 nm, which can be attributed to the absorptions of Ce 3 (ACe 3 ) and Ce 4 (ACe 4 ), respectively.30 Meanwhile, the change of absorbance ratio of ACe 3 / ACe 4 is closely related to the calcination temperature, as shown in Fig. 6(B).It can be observed that the absorbance ratio of ACe 3 /ACe 4 is elevated at the increased calcination temperature and reaches the maximum value for the sample calcined at 800 o C, indicating the highest concentration ratio of Ce 3 /Ce 4 in MCe-LDH-800.A slight decrease of ACe 3 /ACe 4 ratio in MCe-LDH-1000 can be observed which may be attributed to the structure destruction by the calcination at higher than 800 o C as mentioned above.The Ce 3 ions on the outermost surface or at the oxide-oxide interface can act as photocatalytic active sites or hole scavengers, efficiently suppressing the surface charge recombination and extending charge carrier lifetime 26.Thus the presence of surface Ce 3 ions will further promote the photocatalytic activity. The photocatalytic reduction of CO2 with H2O vapor was performed in a gas-closed photoreactor.During the irradiation, 1 mL gas was sampled from the glass chamber every one hour for analyzing the reaction products.As a result, CO was found to be the sole product of CO2 reduction and no other carbonaceous signals were detected.Moreover O2 was also detected in large quantities in the products.Control photocatalytic experiments under identical conditions but in the absence of CO2 or light irradiation verified that the CO and O2 were the only products, which were generated totally from the photocatalytic reduction of CO2 with H2O vapor.Fig. 7(A) shows the photocatalytic activities of catalysts calcined at different temperatures.The catalyst MCe-LDH-800 shows the highest activity which is in line with the above results that MCe-LDH-800 displays the highest ACe 3 /ACe 4 absorbance ratio and surface area among the calcined samples.The overall CO yield over catalyst MCe-LDH-800 is 13.4 mol g -1 in eight hours of irradiation, approximately corresponding to 1.68 mol g -1 h -1 on average, which is about 2.5 times that over pure m-CeO2 (0.67 mol g -1 h -1 ).This may be ascribed to the dominant Ce 4 state in pure mesoporous CeO2 as reported in the previous work 31.Fig. 7(B) shows the production rates of CO on photocatalysts as a function of photo-illumination time.As for all catalysts, the production rates of CO firstly increased with the increase of irradiation time and then gradually decreased after reaching the maximum values, indicating a gradual deactivation of the catalytic performance.Similar results have been reported in previous studies 323334.The deterioration of photocatalytic activity may be caused by the diminished reactant adsorption on the catalyst surface 32,33,35 and/or the surface coverage by reaction intermediates and/or products on active sites 36,37.Time courses of accumulative photocatalytic CO and O2 productions over the catalyst MCe-LDH-800 are presented in Fig. 7(C), which shows much more efficient production of O2 than that of CO.Thus it is reasonable to infer that the reaction rate was determined by CO formation and desorption 37.Besides, a similar time course to the production of CO can be found in the production rate of O2 upon irradiation, suggesting the generation of O2 from H2O splitting by photogenerated holes.22 The stability of photocatalytic activity for the formation of CO over the catalyst MCe-LDH-800 was investigated via four test cycles (each for 8 h), and the result is shown in Fig. 7(D).It is clear that the catalyst maintains its high catalytic activities in four test cycles under the same reaction condition.The formation amount of CO is 12.6 mol g -1 in the forth test cycle which is about 94 that of the first run, showing a slight deactivation.In order to investigate its structure stability in the photoredution of CO2 with H2O vapor, we further characterized the structure of the used catalyst after photocatalytic test for 32 h by XRD and XPS analyses (Fig. SI-3) and found that there were no significant structural changes compared with the fresh sample, indicating its high structural stability.The slight deactivation may be attributed to the adsorption/coverage of the active sites by CO product or intermediates 31. As stated above, the catalyst MCe-LDH-800 showed excellent photocatalytic activity towards photoreduction of CO2 with H2O vapor.Two factors are believed to play key roles in obtaining such an excellent photocatalytic activity.One is the Ce 3 /Ce 4 redox couple, especially the presence of Ce 3 on the surface of the catalysts which facilitates electron-hole separation 26.The other is the higher surface area which provides more active sites for CO2 adsorption.Taking these factors into account, the pathway of this redox catalysis for the CO2 reduction with H2O vapor can be outlined as shown in Scheme 1. Firstly, electron-hole pairs are generated upon irradiation with light energy equal to or larger than the band gap energy of CeO2-x (Reaction 1).And the photo-excited electrons (e -) and holes (h ) in the lattice are separated and trapped by active sites of CeO2-x to avoid recombination.Secondly, H2O molecules are oxidized by h to generate O2 and H at the VB of CeO2-x (Reaction 2), and meanwhile CO2 molecules are reduced to CO by e -at the CB of CeO2-x under the assistance of the H . As for CO2 photoreduction, there involves a reversible cycle between Ce 3 and Ce 4 , as demonstrated in XPS, i.e., both Ce 3 and Ce 4 exist on the surface of CeO2-x photocatalysts.Firstly, Ce 4 ions will trap photo-excited electrons to form Ce 3 and oxygen vacancies (Vo) (Reaction 3) 32, meanwhile oxygen vacancies (Vo) serve as the active sites for CO2 adsorption (Reaction 4) as reported in previous study 38. Secondly, Ce 3 ions can then react with the adsorbed CO2 (CO2(s)) (Reaction 5) to regenerate Ce 4 39,40 and metastable superoxide (CO2 -) radicals that can be further reduced to CO by e -under the assistance of the H (Reaction 6) 31,38."
  },
  {
    "title": "Conclusions",
    "content": "In conclusion, we here have successfully synthesized monometallic cerium layered double hydroxides (MCe-LDHs) for the first time through a simple approach.Such LDHs preserves its layered structure and platelet morphology after calcination at 800 o C for 6 h, and this heat-treatment result in enhanced concentration ratio of Ce 3 /Ce 4 and highest surface area, both of which play key roles in the photocatalytic activity towards photoreduction of CO2 with H2O vapor.The catalyst MCe-LDH-800 shows the highest photocatalytic activity and the optimum photocatalytic CO evolution rate reaches 1.68 mol g -1 h -1 , which is about 2.5 times that over pure mesoporous CeO2 (0.67 mol g -1 h -1 ) reported in previous work.And it also maintains its high catalytic activities in repeated test cycles under the same reaction condition.Moreover, the successful synthesis of MCe-LDH provides an opportunity to develop other novel catalysts through loading functional components by intercalation, ion-exchange, or self-assembly of delaminated layer, etc. The TG-DTA curve of the sample (Fig.1e) in the temperature range of 25-800 o C shows that the compound losses its weight in three separate steps upon heating.The first weight loss of 7.5 in the temperature range of 25-340 o C is likely due to the removal of water molecules from the chemical formula.The weight loss of 2.5 in the temperature range of 340-560 o C can be attributed to the decomposition of nitrate.The final step starting from 560 o C is assigned to dehydroxylation of the hydroxide layer.No weight loss is observable at calcination temperatures higher than 800 o C, indicating the complete dehydroxylation at around 800 o C. Figure 1.XRD pattern (a), SEM (b), TEM (c), FT-IR spectrum (d) and TG-DTA profile (e) of MCe-LDH Figure 4. SEM image of (a) MCe-LDH-400; (b) MCe-LDH-600; (c) MCe-LDH-800; (d) MCe-LDH-1000 Elemental Analysis Results on MCe-LDH Chemical Formula Ce0.98 4 Ce0.92 3 (OH -)4.00(NO3 -)0.32(SO4 2-)1.142.08H2O This work was financially supported by National Basic Research Program of China (973 Program, 2013CB933200)."
  }
]