[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2017.05.064"
  },
  {
    "title": "Article_Title",
    "content": "Enhanced CO2 photocatalytic reduction on alkali-decorated graphitic carbon nitride"
  },
  {
    "title": "Abstract",
    "content": "In this work, visible-light photocatalytic reduction performance of carbon dioxide (CO2) on graphitic carbon nitride (g-C3N4) was significantly promoted by the decoration of potassium hydroxide (KOH) on g-C3N4.More importantly, the role of KOH was thoroughly discussed via various characterizations, control experiments and density functional theory (DFT) calculations.It was found that KOH decoration did not result in any significant difference regards to the morphologies, elemental states, BET surface areas and light adsorption of g-C3N4 except a drastically enhanced CO2 adsorption capacity.The promotion effect of KOH on g-C3N4 was mainly contributed by the hydroxide ion (OH -) functioning as both a hole accepter and a driving force to keep a dynamically stable amount of H2CO3 (probably the major form of CO2 to be reduced) on the surface of the catalyst.Moreover, the different extents of influence of NaOH and KOH on g-C3N4 were revealed and further explained using computational results.This study supplements current understanding on alkali-promoted photocatalytic processes and provides new insights into the mechanism of CO2 photocatalytic reduction."
  },
  {
    "title": "Experimental",
    "content": "All chemicals were analytically pure and used without further treatment.Graphitic carbon nitride (g-C3N4) was synthesized by heating 30 g of urea in a 100 ml crucible with a cover in static air at 550 C for 2 h with a ramping rate of 10 C min -1 .We refer to this sample as CN. KOH and NaOH were deposited on g-C3N4 by simply impregnating 0.6 g of g-C3N4 in aqueous solution with various quantities of KOH (0.05, 0.1, 0.25, 0.5, 1.0 wt) or NaOH (0.5, 1.0, 2.0, 3.0 wt).The suspensions were sonicated and stirred to fully disperse the g-C3N4 and then dried in a rotary evaporator.Finally, the dried sample was recollected and ready for use.The samples were denoted as xKOH-CN (x 0.05, 0.1, 0.25, 0.5, 1.0) and yNaOH-CN (y 0.5, 1.0, 2.0, 3.0).KCl, KHCO3 and K2CO3 patched g-C3N4 samples were also prepared in the same way. X-ray powder diffraction (XRD) patterns were recorded on an X-ray diffractometer (Model D/max RA, Japan) with Cu K irradiation.Fourier transform infrared (FTIR) spectra were obtained on an FTIR spectrometer (Bruker Alpha, Germany) equipped with a deuterated triglycine sulfate (DTGS) detector using sample discs prepared with dried KBr.X-ray photoelectron spectroscopy (XPS: Thermo ESCALAB 250Xi, USA) measurements were performed with a monochromatized Al K source (150 W, 500 m, h 1486.6 eV).The carbon 1s line (284.8eV) was used as the reference to calibrate the binding energies.Field emission scanning electron microscope (FE-SEM: Hitacha SU8020, Japan) and transmission electron microscope (TEM, Fei F20, USA, Voltage: 200KV) were used to study the morphology of the samples.The Brunauer-Emmett-Teller (BET) specific surface area was calculated from the multipoint BET method on a physisorption analyzer (JW-BK 132F, Beijing JWGB Sci Tech Co., China).The UV-Vis diffuse reflection spectra (UV-Vis DRS) were obtained on an UV-Vis spectrophotometer (TU-1901, China) equipped with an integrating sphere assembly and BaSO4 was used as the reflectance.The photoluminescence spectra were measured with a fluorescence spectrophotometer (RAMANLOG 6, USA) using 420 nm lasers as excitation source.The photocurrent of the samples at different pH was measured on an electrochemical workstation (CHI 660E, China) with 1.5 M Na2SO4 as the electrolyte. The pH was tuned by addition of KOH or NaOH.CO2 adsorption tests were carried out on a thermo gravimetric analysis instrument (TGA, SDT Q600 V8.2 Build 100).The samples were pretreated with flowing He at 120 C for 2 h and exposed to CO2 at 50 C.The changes in weights during the process were recorded to value their CO2 adsorption capacities. CO2 photocatalytic conversion in the presence of H2O was conducted in a homemade stainless-steel-made reactor with a quartz window on the top.The system was operated in a continuous-flow mode.For each test, 40 mg of catalyst was evenly dispersed at the bottom of the reactor.A 300 W Xeon lamp (PLS-SXE300UV, Beijing Trust-tech Co. Ltd, China) with a light filter was used to obtain visible light with wavelengths larger than 420 nm.(To note, the CO2 photocatalytic reduction experiments to compare the influence of anions in section 3.3 were conducted under irradiation of the full spectrum of the Xeon light.)After the reactor was sealed, CO2 (99.9999) was purged into the reactor through a water bubbler, delivering a gas mixture of CO2 and H2O, at 120 mlmin -1 for 1 h in order to remove any impurity gases.Then the flow was maintained at 3.0 mlmin -1 for another 1 h to stabilize the system before the irradiation source was turned on.During the reaction, gaseous products in the reactor effluent were analyzed at certain time intervals using a calibrated gas chromatography (Agilent 7890A, USA) which was equipped with two flame ionization detectors (FID) and a thermal conductivity detector (TCD).The accumulated yields of the products were obtained by integrating the production rate over time.The samples after reaction were collected to check if there are any products attached on the surface by extraction with water and subsequent detection with GC (for hydrocarbons) and ion chromatograph (for formic acid mainly).Experiments without light irradiation, using N2 instead of CO2 and without addition of a catalyst, were also conducted and little product could be detected, indicating that the products are from the photocatalytic reduction of CO2. In addition, isotope tracing experiments were also conducted using 13 CO2 (99 atom C, SIGMA-ALDRICH Co.) in a batch reactor and confirmed that the products are from CO2 rather than from any carbon-containing contaminants. In situ diffuse reflectance FT-IR spectroscopy (DRIFTS) was carried out on a Nicolet 6700 spectrometer (Thermo Electron) equipped with a liquid nitrogen cooled HgCdTe (MCT) detector, a Praying Mantis DRIFTS accessory and a reaction cell (Harrick Scientific, HVC-DRP). The reaction chamber is equipped with a heater and a temperature controller as well as a sample cup in the center.There are three windows on the dome of the cell: two CaF windows for IR transmission and a quartz window allowing transmission of irradiation light from a 300W Xe lamp (PLS-SXE300UV, Beijing Trust-tech Co. Ltd, China).The spectra recorded were displayed in absorbance units and acquired with a resolution of 4 cm -1 , using 32 scans. After the sample was loaded in the reaction cell, the cell was purged with helium (He) at 30 ml min -1 at 200 C for 1h to eliminate any absorbed gas on the surface of the sample and any impurity gases in the chamber.Then the cell was cooled down to 50 C and the background spectrum was collected.Subsequently, a CO2/H2O mixture, delivered by passing CO2 through a water bubbler at 3 ml min -1 , was introduced to allow absorption saturation.IR spectra were recorded as a function of time (0-60 min).To eliminate any physisorbed species, the system was purged with He again for 30 min.Subsequently, the light was turned on and the system was irradiated for 120 min while the time-resolved IR spectra were collected to investigate chemical changes on the sample surface. All calculations were performed with Vienna Ab Initio Simulation Package (VASP) 44 with periodic boundary conditions and projector-augmented wave (PAW) 44. The generalized gradient approximation (GGA) with the Perdew-Burke-Ernzerhof (PBE) functional 45 and dispersion correction by Grimme (DFT-D2) 46 were used to describe the electronic structure.For the 22 unit cell, the Brillouin zone was sampled by a 331 k-point mesh and a cutoff energy of 500 eV was used.The vacuum slap between two layers was set to 20 A. A positive binding energy (Ebind) indicates stable adsorption at 0 K, and was calculated by the difference between the total energies of the surface with adsorbates (ESFmol) and energies of the two separate systems (the surface ESF and of the molecule Emol): There are number of stoichiometrically equivalent structures of g-C3N4 and here we consider the structure which comprises tri-s-triazine (also referred to as heptazine) units connect through graphitic nitrogen atoms to form a 2D sheet.Details on the preparations of the corrugated sheets, can be found in the supporting information.To model the g-C3N4 surface, we used a 22 supercell of g-C6N8 47, with an optimized lattice constant of 13.59 A for the corrugated sheets.Furthermore, to include the -NH bond, one of the tri-s-triazine units of g-C6N8-units was replaced by three hydrogen atoms, to saturate the three nitrogen dangling bonds.Both of these systems are shown in Fig. 1.The corrugation of the sheet was separately calculated and the optimized lattice constant for the -NH containing system was determined to be 13.83A."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The XRD patterns of CN, 0.1KOH-CN and 1.0KOH-CN are presented in Fig. 2a.All the samples show the characteristic diffraction peaks of g-C3N4 at 2 12.9 and 2 27.5.The strongest peak at 2 27.5 is indexed to the 002 plane with d 0.326 nm, a characteristic interlayer spacing of CN aromatic units.The peak at 2 12.9 is ascribed to the in-plane structural packing motif of tri-s-triazine units.19 No new peaks or peak shifts are observed after KOH decoration.However, interestingly, the peak intensity increases with the amount of KOH.As all the samples were tested under the same conditions, the difference in peak intensity could not be attributed to measurement errors.This suggests that the impregnation of g-C3N4 in KOH solution and the following evaporation process could have helped the g-C3N4 form structures with enhanced ordering.Fig. 2b presents the FTIR spectra of the samples.All the samples show adsorption in the same ranges, i.e. 810 cm -1 for the breathing mode of the tri-s-triazine units, 11001650 cm -1 for typical stretching modes of heterocycles of carbon and nitrogen and broad adsorption at 27003600 cm -1 from stretching vibration modes of -NH 48 without much difference, indicating that the loading of KOH cannot change the main functional groups of g-C3N4.And, due to the low amount of KOH, the FTIR peaks of KOH could be too minor to be recognizable.The morphology and microstructure of the samples were investigated by scanning electron microscope (SEM) and transmission electron microscope (TEM), as shown in Fig. 3. No apparent difference could be observed between CN and KOH-loaded CN.All the samples show morphologies of curved porous sheets stacking together as commonly reported for g-C3N4 synthesized from urea.49505152 In addition, the BET surface areas calculated from N2 adsorption-desorption tests of the unmodified and all the KOH-decorated g-C3N4 are very close to each other, as listed in Table 1.These suggest that the preparation processes have little influence to the macrostructure of g-C3N4 and the limited amount of KOH should just have been deposited on the surface of g-C3N4.The amount of oxygen in CN, 0.1KOH-CN and 1.0KOH-CN are estimated to be 5.6 at, 8.1 at and 12.1 at, respectively based on peak areas in the XPS survey spectra.The oxygen could mainly consist of residual oxygen from the polymerization process of urea 49 and the oxygen from KOH.As the amount of the former form of oxygen should be consistent in all samples, the increased amount of oxygen is expected to be from the increased amount of deposited KOH.Besides, a peak due to K can be observed in the energy dispersive X-ray (EDX) test in SEM of the 1.0KOH-CN sample (Fig. 5) with the content estimated to be around 0.8 wt (1.48 at), suggesting the successful decoration of KOH on the surface of g-C3N4. Fig. 5 SEM-EDX spectra of CN and 1.0KOH-CN.In terms of optical properties, KOH exerted little influence on the light absorption of g-C3N4. As demonstrated in Fig. 7a, all the g-C3N4 samples without or with different amount of KOH show the same light adsorption ranges with the absorption edge at around 450 nm.Fig. 7b gives the photoluminescence (PL) spectra of CN, 0.1KOH-CN and 1.0KOH-CN.The peak locations of the three samples are alike.A small increase in intensity is observed as the KOH loading amount increases.This suggests that the addition of KOH slightly increases the recombination rate of photo-generated electrons and holes.However, this effect is too small for 0.1KOH-CN to cause any possible influence to the photocatalytic activity of g-C3N4.S1 (supporting information).Liquid products such as formaldehyde, methanol and ethanol were not detected in the current reaction system.As shown in Fig. 8, the productions of all the products increase with the addition of 0.05 wt KOH.When 0.1 wt KOH is used, the productions increase greatly and became about 3 times larger than those of CN.However, an excessive amount of KOH (0.25, 0.5, 1.0 wt) does not result in a further increase in the production of CO, CH4 or CH3CHO but lowers the productions as it goes on increasing.To clarify the role of KOH in enhancing the CO2 reduction performance, we considered firstly if the cation K could be responsible for the increase in CO2 reduction and secondly whether the bicarbonates and/or carbonates (i.e.KHCO3 and K2CO3) that formed from reaction between KOH and CO2 would participate in the catalytic process and facilitate the reactions.Therefore, CO2 photocatalytic reduction performance of g-C3N4 decorated with KOH (0.1 wt), KCl (0.13 wt), K2CO3 (0.12 wt) and KHCO3 (0.18 wt), respectively were further compared.The atomic ratio of K in each sample was kept the same.The results are illustrated in Fig. 9 and Fig. S2.Compared to the pristine CN, the samples loaded with KCl, K2CO3 and KHCO3 show no improvement in CO or CH4 production and the yields of CH3CHO over them even decrease obviously.The results indicate that K alone is not able to promote the reactions, and that neither KHCO3 nor K2CO3 would promote the conversion of CO2. When focusing on the first 100-min productions of CO and CH4, as shown in Fig. S3 (d) and (e), it is found that KHCO3-CN shows superior CH4 production to that of CN in the first 100 min.However, the influence does not last, and final productions in 5 h over KHCO3-CN are poor.This suggests that HCO3 -could be an adsorbed species that contributed to CH4 formation, but could not influence the CO2 adsorption or reduction significantly.All of these suggest that the existence of OH -along with its high alkalinity is indispensable for the enhancement in CO2 photocatalytic reduction with KOH-CN.compared to CN as well.However, the optimal loading amount of NaOH is 1.0 wt, which is 10 times larger than that of KOH.In addition, although the optimal CH3CHO yields on 1.0NaOH-CN and 0.1KOH-CN are very close, the production of CO and CH4 over the best 14 KOH-CN is about 1.5 times that of the best NaOH-CN.This implies that the characteristics of the cation are also important to determine the influence of the alkali on the photocatalyst (g-C3N4).Firstly, it is possible that OH -on g-C3N4 functions as a hole scavenger and helps enhance the separation of photo-generated charges and thus the CO2 conversion efficiency.43,53 To verify this point, photocurrents of urea-polymerized g-C3N4 at Na2SO4 solution of different pH values tuned by KOH or NaOH were obtained, as presented in Fig. 11.The photocurrent increases significantly as the pH value rises, suggesting OH -can accept the photo-generated holes and suppress the recombination rate of the photo-excited charges.However, it is also found that the photocurrent of g-C3N4 in Na2SO4 solution with a pH of 13.59 adjusted by KOH is lower than that in Na2SO4 solution with a pH of 13.58 adjusted by NaOH.If the improvement in CO2 photocatalytic reduction is predominantly due to the role of OH -as a hole acceptor, the performance of KOH-CN and NaOH-CN should be close to each other, with NaOH possibly showing a greater promotion.But this is in contradiction with our observation that NaOH-CN has a lower enhancement in CO2 reduction and a 10 times higher optimal loading than that of KOH-CN.Therefore, it can be deduced that there should be other factor(s) influencing the performance of the alkali-decorated g-C3N4. Secondly, studies on the photochemical reduction 2,8,54,55 of CO2 adsorbed in water, suggest that H2CO3 and dissolved CO2 are highly likely to be the reactive species.As KOH and NaOH are deliquescent, a thin layer of alkaline electrolyte is expected to form on the surface of alkali decorated g-C3N4 in the present water vapor and CO2.52 The equilibria of CO2 in water and basic solution are: In deionized water, equation ( 2) is dominant with dissolved CO2 being the main carboncontaining species present.As the pH increases, the deprotonated forms of H2CO3 are more likely to be present.Since the addition of HCO3 -and CO3 2-showed little improvement in the catalytic performance, it is supposed that the main carbon-containing species involved in the alkali-enhanced reduction are H2CO3 and dissolved CO2.Besides, a recent work 55 studied the change of carbon species in various electrolytes after bubbling CO2 and found that after bubbling with CO2, the ratio of H2CO3 (i.e.H2CO3 and CO2) to the total carbon-species (i.e. H2CO3, CO2, HCO3 -and CO3 2-) in a low initial concentration of KOH (0.1M) was higher than that in KHCO3 (0.1 M).But this value would decrease dramatically if the concentration of KOH increased.In light of this, a low amount of OH -, as on our KOH decorated sample, may be able to keep a dynamically stable amount of H2CO3 in the thin layer of solution on the catalyst's surface.Subsequently, the photocatalytic process with OH -as hole scavengers would consume the stabilized H2CO3 before it changes to its HCO3 -or CO3 2-.Thus, a formation-consumption cycle of H2CO3 could be realized.In other words, a cycle of H2CO3 generation, photocatalytic conversion and re-generation can be achieved with the relatively low amount of OH -.However, when the concentration of OH -is too high, it will result in formation of CO3 2-as the major species, leaving little H2CO3.Besides, a larger amount of alkali on the photocatalyst surface would also inhibit the transfer of photo-exited charges from g-C3N4.55 With regard to the initial enhancement of CH4 production with KHCO3-CN observed in Fig. S3, it could be explained by the fact that in the thin layer of electrolyte for the deliquescing of KHCO3, HCO3 -would coexist with H2CO3 through equation (3).And the H2CO3 would participate in the reactions when the samples are irradiated.However, KHCO3 shows far less ability in adsorbing water and would form less amount of electrolyte.More essentially, the system with KHCO3 lacks OH -as both a driving force for enhanced CO2 adsorption and a hole acceptor.As a result, KHCO3-CN does not show apparent enhancement compared to bare g-C3N4 over a long period. In order to understand the difference between K (KOH) and Na (NaOH) in interacting with reducible CO2 species on g-C3N4, density functional theory (DFT) calculations were performed with bare g-C3N4 nanosheet and g-C3N4 sheet with K/Na atom.The plain g-C3N4 nanosheet in calculation is corrugated g-C3N4 sheet, as exhibited in the experimental section (Fig. 1a).The most stable forms of Na/g-C3N4 and K/g-C3N4 are presented in Fig. 12. Na/g-C3N4 is with Na sitting most stably in the middle pore of the melon units, nearly in-plane with the g-C3N4 sheet for its small atomic radius, whereas the most stable site for K atom on g-C3N4 is on top of the whole above the g-C3N4 plane.Meanwhile, both Na and K are cationic on the sheet, i.e. are presenting as Na and K according to the charge density differences results, which will be explain in detail later.According to our calculation results, for CO2 adsorption on plain corrugated g-C3N4 sheet, the binding energy is 0.25 eV.The most stable CO2 adsorption site is on top of the large tri-s-triazine pores and the interaction is considered to be physisorption because there is no change in the bond length of the C-O bond (1.18 A).Neither the addition of K nor Na on g-C3N4 changes the binding energy of CO2 (0.25 eV).Both K and Na share the most stable adsorption site, the pore, with CO2 (see Fig. S4). While substituting CO2 with H2CO3, the situation becomes interestingly different.While the binding energy of H2CO3 on the bare g-C3N4 is 0.75 eV, it is 1.13 eV for K/g-C3N4 and 0.86 eV for Na/g-C3N4.This change of H2CO3 binding energy before and after the presence of K and Na can be regarded as an indirect indication that H2CO3 is the main reduced CO2 species. And that the binding energy of H2CO3 on K/g-C3N4 was 24 larger than that on Na/g-C3N4 could be one of the causes that why NaOH shows lower promotion to the CO2 photocatalytic reduction performance of g-C3N4. Further investigations were carried out to find the reasons to why the binding energy of H2CO3 changes differently on K/g-C3N4 and Na/g-C3N4.One reason could be the different preferred positions of K and Na on the g-C3N4 sheet.As mentioned earlier, Na stays nearly in-plane with the g-C3N4 sheet while K is out of the pore.Therefore, it is easier for the H2CO3 to coordinate with K than Na.In another word, there is more steric hindrance for the interaction of H2CO3 with the Na/g-C3N4.The other reason could be the possibly different electron densities in the sheet with K and Na.Fig. 13 exhibits the charge density difference for Na/g-C3N4 and K/g-C3N4, which is obtained by subtraction the charge density of the separated species (K or Na and g-C3N4) from the charge density of the complex.Both K and Na are cationic with higher electron density on the sheet near the ions.The charge density differences of the sheets with either of the atoms are nearly identical, except in the charge depleted region around the alkali metal atom itself.A larger area is shown around K than around Na.That is, when K is present, there is a larger region where H2CO3 can be stabilized. In addition, little change in adsorption energy of H2CO3 on local minimum energy sites away from the K/Na ion is found, suggesting that the additional electrons in the unit cell of g-C3N4 won't influence the adsorption of H2CO3.It is only K and Na that are responsible for the enhanced stabilization of H2CO3.For g-C3N4 samples synthesized by polymerization of a certain precursor, there are always residual hydrogens connected to the nitrogen due to incomplete condensation.20 Therefore, additionaly, we calculated the adsorption energy of H2CO3 on the g-C3N4 system containing hydrogen (Fig. 1b) and an enhanced adsorption was observed compared to the pure g-C3N4 sheet.The binding energy for H2CO3 on g-C3N4 with -NH is 1.08 eV and the molecule will sit in the pore with -NH groups.The increased binding energy is supposed to be originated from the hydrogen bonding between the adsorbate and the sheet. When K and Na are added to the g-C3N4 sheet with some pores containing-NH groups while some not.It is found that the K and Na greatly prefer to bind to a pore that did not contain -NH.And the binding energies of alkali-metal atoms are larger on the pores of the pure sheet (K: 3.47 eV and Na: 3.64 eV) than on the pores adjacent to -NH bond in the -NH containing sheet (K: 3.20 eV and Na: 3.57 eV).This difference of binding energies at the two sites is higher with K (0.27 eV) than with Na (0.07 eV).Both metals, and especially K, would therefore prefer to sit on sections of the material that are far away from the pores containing -NH.In this light, the reduced promoting effect of KOH when excessive amount of KOH is decorated could also be explained by the fact that K selectively adsorbes on the pores without hydrogen and only as its concentration increases to a certain value would it also adsorbs to pores adjacent to -NH bonds and reduces the adsorption energy of the reaction intermediate, H2CO3, in the pore with the -NH bonds to 0.95 eV.In contrast, the adsorption of Na is less selective between pores adjacent to -NH groups and the pores on clean sheet, but it would also weaken the binding energy of H2CO3 in the hydrogencontaining material (from 1.03 eV to 0.94 eV).Therefore, it could be concluded that both the lower enhancement to the adsorption of H2CO3 on clean g-C3N4 and the poorer selectivity to favorable sitting sites contribute to the inferior promoting effect of NaOH on g-C3N4 for CO2 photocatalytic reduction compared to KOH. Deactivation of the photocatalytic reduction of CO2 in the absence of a sacrificial agent is very common for various materials, including TiO2, 6 Bi2WO6, 13 ZnGeO4, 56 and g-C3N4 52 etc., due to inhibited desorption of some intermediates and enhanced back reaction with the formation of oxygen.6 The deactivation of g-C3N4 was also observed in this work. As presented in Fig. 14, the evolution rate of the products (CO, CH4 and CH3CHO) on pristine g-C3N4 (CN) was found to increase in the first hour and then gradually decrease due to the deactivation.Decorating KOH onto g-C3N4 as a strategy to enhance CO2 reduction might be expected to exacerbate this problem due to possible conversion of KOH to KHCO3 or K2CO3 during the reaction with a fast loss of its promoting effect.However, comparing the activity change of CN and 0.1K-CN as presented in Fig. 14, the drop of photocatalytic efficiency with 0.1KOH-CN is even slower than that with CN, suggesting that the chemical change of KOH on g-C3N4 could not be dramatic.cm -and 1699, 1544, 1352 cm -1 , respectively, 21,40 suggesting KOH has been partially converted to KHCO3 and K2CO3 before the photocatalytic reactions.After 120-min irradiation, the absorbance of HCO3 -shows a certain decrease whereas the peaks due to presence of CO3 2-remains or increases.And new absorptions of formate (-HCOO -) (1518, 1416 cm -1 ) and formaldehyde (-CHO) (1682, 1460, 1397 cm -1 ) from the intermediates in CO2 photocatalytic reduction 21,57,58 appear.Note, the CO3 2-peaks that show increase in intensity are close to these new peaks, so their increase could be at least partially attributed to overlap with the new peaks.Overall, the total amount of HCO3 -and CO3 2-does not show much difference before and after irradiation, validating the robustness of the effect of KOH on g-C3N4. Fig. 15 In-situ DRIFT spectra of 0.1KOH-CN with adsorbed forms of H2O and CO2: before irradiation and after 120-min light irradiation."
  },
  {
    "title": "Conclusions",
    "content": "In this work, we reported the remarkably improved photocatalytic activity of CO2 reduction over KOH-decorated g-C3N4 compared to pristine g-C3N4.With the formation of a thin layer of alkaline electrolyte due to its high deliquescence, OH -functioning as a hole acceptor, a certain amount of KOH kept and facilitated the formation and consumption cycle of H2CO3 which is assumed to be the main species involved in the alkali-promoted photocatalytic reduction process.In addition, it was found that the promotion effect of KOH was much more obvious than NaOH.Though DFT calculation, the reasons turned out to contain that (1) while both K and Na were found to be able to enhance the binding of H2CO3 on clean g-C3N4 pores, the influence of K is much stronger; and (2) for commonly sysnthesize g-C3N4 with -NHx, K /Na located adjacent to the pore with -NH would impair the adsorption of H2CO3 but K showed a higher selectivity to staying at the sites far away from the -NH-containing pores.Furthermore, the robustness of the effect of KOH on g-C3N4 during the photocatalytic process was verified.The findings not only provide insights into the understanding the first step of CO2 photocatalytic reduction (CO2 adsorption) on alkalimodified photocatalysts, but also should inspire the development of efficient photocatalysts for CO2 photocatalytic reduction. Fig. 1 Unit cell for g-C3N4 (a) and -NH containing g-C3N4 (b).(Grey -carbon atoms, bluenitrogen atoms and pink -hydrogen atoms.) Fig. 2 XRD patterns (a) and FTIR spectra (b) of CN, 0.1KOH-CN and 1.0KOH-CN. Fig. 3 SEM (a, b, c) and TEM images (d, e, f) of CN (a, d), 0.1KOH-CN (b, e) and 1.0 KOH-CN (c, f). Fig. 4 C1s (a), N1s (b), O1s (c) and VB (d) XPS spectra of CN, 0.1KOH-CN and 1.0KOH-CN.Subsequently, X-ray photoelectron spectroscopy (XPS) measurements were carried out to analyze the chemical states of the elements in the samples before and after KOH loading.Fig.4 exhibits C 1s, N 1s, O 1s and VB XPS spectra of CN, 0.1KOH-CN and 1.0KOH-CN.The states of carbon, nitrogen and oxygen as well as the VB location changed little before and after KOH loading.The binding energy of K 2p is 292-295 eV but no peaks in this range are visible in the XPS spectra of 0.1KOH-CN and 1.0KOH-CN due to the low content of KOH in these samples. Fig. 6 CO2 absorption curves of CN, 0.1KOH-CN and 1.0KOH-CN at 50 C.CO2 adsorption at 50 C (Fig.6) further verifies the successful loading of KOH on the sample surface.While CN only adsorbs 0.28 wt CO2, 0.65 wt CO2 is adsorbed on 0.1KOH-CN and a further increase (0.9 wt) is observed on 1.0 KOH-CN.As mentioned above, CN, 0.1KOH-CN and 1.0KOH-CN possess similar BET surface areas.The KOH deposited on g-C3N4 is expected to be the only cause for the enhanced CO2 adsorption. Fig. 7 UV-vis diffraction spectra of CN and CN with various KOH loading amount (a) and PL spectra of CN, 0.1KOH-CN and 1.0KOH-CN (b). Fig. 8 5-h production of CO, CH4 and CH3CHO and conversion of CO2 over CN and CN decorated with different amount of KOH (denoted as xKOH, x 0.05, 0.1, 0.25, 0.5 and 1.0) in photocatalytic CO2 reduction under visible light irradiation ( 420 nm) Fig. 9 5-h production of CO, CH4 and CH3CHO and conversion of CO2 over CN and CN loaded with KOH, KCl, K2CO3 and KHCO3 respectively in photocatalytic CO2 reduction under irradiation of Xeon lamp. Fig. 10 5-h production of CO, CH4 and CH3CHO and conversion of CO2 over Cn decorated with different amount of NaOH (denoted as xNaOH-CN, x 0.5, 1.0, 2.0 and 3.0) in photocatalytic CO2 reduction under visible light irradiation ( 420 nm) compared with 0.1KOH-CN (denoted as 0.1KOH) and CN. Fig. 10 and Fig. S3 exhibit the accumulated and time-resolved product yields respectively in CO2 photocatalytic reduction over g-C3N4 loaded with different amounts of NaOH with a comparison with those of CN and 0.1KOH-CN.NaOH-CN presents enhanced activity Fig. 11 Photocurrent of g-C3N4 at different pH values (the pH of a-f are tuned by KOH: a -pH 8.64; b-pH 9.55; c-pH 11.29; d-pH 12.35; e-pH 13.09; f-pH 13.59; the pH of g is tuned by NaOH: g-pH 13.58). Fig. 12 Most stable adsorption sites for H2CO3 on g-C3N4 with K (a) and Na (b).(Grey, blackcarbon atoms, blue -nitrogen atoms, red -oxygen atoms, pink -hydrogen atoms, greenpotassium atoms and yellow -sodium atoms.) Fig. 13 Charge density differences with K (a) and Na (b) on g-C3N4.(Iso-level of 0.0008 e/bohr 3 ; Grey -Carbon atoms, blue -nitrogen atoms, green -potassium atoms and yellowsodium atoms; Charge depletion in aqua and accumulation in yellow; Box shows the size of the super cell.) Fig. 14 Time-course evolutions of CO (a), CH4 (b) and CH3CHO (c) over CN and 0.1KOH-CN.To analyze this further, DRIFTS experiments were carried out on 0.1KOH-CN.Using the clean 0.1KOH-CN surface treated with helium at 200 C as a background, the in-situ DRIFT spectrum of 0.1KOH-CN after 60-min adsorption of CO2 and H2O gas mixture and a further Figr-1 We acknowledge the financial supports of the Natural Science Foundation of Zhejiang Province (No. Z5100116), National Natural Science Foundation of China (No. 51578488), Changjiang Scholar Program of Chinese Ministry of Education (China, 2009).We thank the Australian Research Council for support of this project through the DP and LIEF programs.This research was undertaken with the assistance of resources provided at the NCI National Facility systems at the Australian National University through the National Computational Merit Allocation Scheme supported by the Australian Government with support from the Queensland Cyber Infrastructure Foundation (QCIF) and the University of Queensland Research Computing Centre.J.M.T.A.F.thanks the University of Queensland for the UQI scholarships supporting her Ph.D."
  }
]