[
  {
    "title": "Doi",
    "content": "10.1016/j.cattod.2016.05.040"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic CO 2 reduction vs. H 2 production: The effects of surface carbon-containing impurities on the performance of TiO 2 -based photocatalysts"
  },
  {
    "title": "Abstract",
    "content": "Photocatalytic CO 2 reduction is a useful way to convert solar energy into fuels, mimicking artificial photosynthesis.The gas phase photocatalytic reduction of CO 2 was investigated with a series of TiO 2 -based photocatalysts, either bare or modified by Cu(II) grafting and/or by Pt nanoparticles deposition and the results obtained in this reaction were compared with those obtained in the photocatalytic production of hydrogen by photosteam reforming of methanol-water mixtures employing the same photocatalysts series.The rates of the two reactions largely depend on the type of photocatalyst and exhibit an almost parallel behaviour, both being higher with photocatalysts containing noble metal nanoparticles.However, the yields in CH 4 , CO and other products obtained from photocatalytic CO 2 reduction still remain very low and often decline during the runs.Furthermore, methane was found to be produced under irradiation when the photocatalysts were contacted with a gas phase containing water vapour and no carbon dioxide.This points to a major role of carbon-containing impurities on the photocatalyst surface, which may act both as hole scavengers and as carbon source.Two step photocatalytic tests, i.e. a cleaning step in the presence of water vapour followed by purging of the gas phase and a second step after CO 2 addition, allow one to discern between the carbon-containing gaseous products originated from carbon impurities and those produced in the presence of CO 2 .In this second step, the presence of copper grafted on the photocatalyst surface favours CO evolution with respect to fully reduced CH 4 ."
  },
  {
    "title": "Experimental",
    "content": "The surface-modified photocatalysts were prepared in our laboratory starting from Evonik P25 TiO 2 (84 anatase -16 rutile), directly employed as supplied.They were obtained either by grafting Cu(II) metal ions on the TiO 2 surface or by Pt nanoparticles (NPs) deposition, or by these two steps in sequence.Cu(NO 3 ) 2 3H 2 O was employed as Cu(II) source in the first step.In a typical grafting procedure, 2 g of P25 TiO 2 powder were dispersed in 20 mL of Milli-Q water and sonicated for 10 min in a FALC LBS2 4.5 L bath.Then 76.0 mg of Cu(NO 3 ) 2 3H 2 O were dissolved in 1 mL of water and mixed with the aqueous TiO 2 suspension in a vial reactor.The mixture was heated at 90 C for 1 h under stirring, up to complete solvent removal.The so-obtained material (Cu content 0.1 wt.) was dried at 110 C for 24 h and finely ground in an agate mortar. In the second step, an aliquot of Cu-grafted P25 TiO 2 was further surface modified by deposition of a fixed amount (0.5 wt.) of Pt NPs according to the deposition-precipitation (DP) method, using urea as the precipitating agent 37.The proper amount of Cu-grafted P25 TiO 2 was suspended in water, sonicated and added to an aqueous solution containing H 2 PtCl 6 (0.1 g L -1 of Pt) and urea (0.42 M).The suspension was vigorously stirred for 4 h at 80 C, until pH 7.5 was reached.The slurry was then cooled down to room temperature and the precipitate was collected by centrifugation, using a CL10 Thermo Scientific centrifuge.The solid product was then re-suspended in 20 mL of Milli-Q water and platinum was reduced by addition of an aqueous NaBH 4 solution in slight excess.The colour of the suspension suddenly changed from white to grey.After 20 min stirring, the slurry was centrifuged and the solid recovered and washed at least three times with 20 mL of Milli-Q water, until the residual chloride and nitrate anions content in the surnatant was below 1 ppm, as checked by ion chromatography.The so obtained photocatalyst was named Pt/Cu(0.1)/T. To check the effects induced by the employed metal deposition procedures and by the single metal or by the co-presence of Cu and Pt on the TiO 2 surface, three more samples were prepared, which were labelled T, Cu(0.1)/T and Pt/T.The T sample was prepared by treating P25 TiO 2 according to the two above described steps, although in the absence of metal precursors.Cu(0.1)/T was produced by the Cu(II) grafting procedure followed by the DP treatment in the absence of Pt precursor.Pt/T was prepared by performing the first step without the Cu(II) source, followed by Pt NPs deposition according to the DP method. All chemicals employed were purchased from Aldrich.Water purified by a Milli-Q water system (Millipore) was used throughout. A TiO 2 sample produced by sol-gel synthesis, followed by spraydrying at 150 C, was also tested.This material was labelled as SD and had a very light brown colour. Diffuse reflectance (R) spectra of the photocatalyst powders were recorded on a Jasco V-670 spectrophotometer equipped with a PIN-757 integrating sphere; barium sulphate was used as a reference.The reflectance spectra were then converted into absorption (A) spectra (A 1 -R).Thermogravimetric analysis (TGA) was carried out with a Mettler-Toledo TGA/DSC 2 Star system in flowing air, by heating the sample from 30 up to 800 C with a 10 C min -1 heating rate.X-ray powder diffraction (XRPD) analysis were carried out with a Philips PW3020 powder diffractometer, by using the Cu K radiation ( 1.54056A).The BET specific surface area (SSA) was measured by N 2 adsorption at liquid nitrogen temperature (77 K) on a ASAP 2020 apparatus, after out-gassing in vacuo at 150 C for at least 2 h. The photocatalytic activity of the TiO 2 -based materials in both carbon dioxide photocatalytic reduction and hydrogen production by photo-steam reforming of methanol was tested using the benchscale apparatus 35,36, connected to a gas phase closed system, which is sketched in Fig. 1.The gas phase was recirculated by means of a metal Bellows pump and was saturated with the reactants by bubbling it through either pure water (in CO 2 photoreduction), or a 20 methanol solution in deionized water (in H 2 photoproduction).The recirculating system was connected to a gas phase photocatalytic reactor containing the catalyst powder (16 mg) previously immobilized on quartz grains.The photocatalyst was irradiated through a Pyrex window and continuously fed with the reactant vapour phase mixture.The recirculating phase was automatically sampled at regular time intervals and analyzed by an Agilent 6890 N gas-chromatograph equipped with two columns (a MolSieve 5A and a plot-U column), a methanizer and both a flame ionization and a thermal conductivity detector.The irradiation source was an external 300 W Xenon lamp (LOT Oriel LSH 302).Prior to the beginning of irradiation, the system was thoroughly purged with an inert gas, helium or nitrogen, in order to completely remove oxygen from the gas phase and the liquid phase.During the photocatalytic experiment, the temperature of the gas mixture was maintained at 30 C. In preliminary CO 2 photoreduction tests, the gas phase consisted of 12 CO 2 , 4 H 2 O, 84 He.After the initial purging with water-saturated helium, 6 mL of 99.995 CO 2 (purchased from SAPIO, Italy) were injected into the recirculating system through a six ways valve.After performing a 6 h-long photocatalytic experiment with the Pt/T sample in the presence of sole water vapour (no CO 2 at the beginning of the run), we found that CO 2 was produced under irradiation and accumulated in the gas phase, attaining a constant amount after ca. 2 h. Subsequent photocatalytic CO 2 reduction experiments were thus divided into two steps.In the first step, the so-called cleaning step, after 40 min-long purging with water-saturated He, the photocatalyst was irradiated for 2.25 h in the absence of CO 2 (i.e. in contact with water vapour).Then the system was thoroughly purged again with He for 40 min, to remove all carbon-containing species in the gas phase.The second, so-called photocatalytic step, was started by injecting CO 2 (6 mL) in the recirculating gas phase and irradiation was carried out for 3.75 h in the presence of water vapour and CO 2 .Each photocatalyst was tested three times, to check the reproducibility of the photocatalytic runs, in terms of CO 2 (in the cleaning step), CH 4 and CO production, determined by gaschromatographic analysis, after calibration 35,36. In the photo-steam reforming tests the composition of the recirculating gas phase was 2 CH 3 OH, 4 H 2 O, 94 N 2 .6 h-long photocatalytic experiments were performed with platinum-free P25, T, (Cu0.1)/T and SD.Because of the high H 2 production rate attained with platinum containing Pt/Cu(0.1)/T and Pt/T samples, irradiation was stopped after 2 h, to maintain the overpressure within the recirculating system below 0.5 bar.The 2 h-long runs were repeated three times.Between each irradiation cycle the system was purged with N 2 for 40 min, in order to remove all gaseous products.Each sample was tested twice to check the reproducibility of the photocatalytic experiment. Finally, a 6 h-long water splitting experiment was carried out with Pt/Cu(0.1)/T in contact with N 2 and water vapour only."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The absorption spectra of the investigated materials are shown in Fig. 2. Sample T exhibits an absorption spectrum slightly redshifted compared to that of untreated P25 TiO 2 , as a consequence of the wet modification method and thermal treatment at 110 C 37.Cu(0.1)T (trace c in Fig. 2) shows a broad absorption feature above 500 nm associated to the d-d transition in copper, consistent with its light green colour 38, while the band gap absorption edge around 420 nm coincides with that of sample T. The two Pt NPs containing samples, i.e.Pt/T and Pt/Cu (0.1)/T, exhibit almost identical absorption spectra; thus only the spectrum of Pt/Cu(0.1)/T is shown in Fig. 2.These two grey coloured materials exhibit a constant absorption in the whole visible region (400-800 nm).Compared with the photocatalysts obtained from P25 TiO 2 modification, spray dried SD (trace e in Fig. 2) exhibits a band gap absorption tail up to 500 nm and very low absorption ranging from 500 up to 800 nm, typical of carbon-containing titania 39,40. The results of thermogravimetric analyses are shown in Fig. 3.The photocatalyst powders home-prepared by surface modification of P25 TiO 2 have a weight loss around 1 below 300 In contrast, SD undergoes a 22 weight loss below 300 C. The differential thermogravimetric (DTG) patterns, calculated from TGA measurements by normalizing the first derivative of the mass variation (see inset of Fig. 3), show that in the case of the SD sample the overall weight loss is due to two main contributions.The first one, below 100 C, is due to water removal, the second one, peaking at 200 C, is compatible with the oxidation of organics and the decomposition of carbonaceous species, as already observed in previous studies 16,41.The sharp feature below 100 C in the DTG pattern of the T photocatalyst indicates dehydration as the main contribution to the weight loss, although trace amounts of organic impurities are also present on the surface, as suggested by the poorly defined DTG signal with minimum at 200 C (inset of Fig. 3).Therefore TGA analyses indicate that all photocatalysts obtained by metal deposition on the surface of P25 TiO 2 contain small amounts of carbon-containing impurities, while SD contains 22 wt. of organic impurities and moisture. The crystal structure of the investigated samples was studied by X-ray powder diffraction.All P25-based samples show identical XRPD patterns (see Fig. S1 in the Supporting Material).In fact, Cu(II) grafting and Pt NPs deposition did not affect the original crystalline phase composition of P25, in agreement with previous reports on noble metal modified titania 37,424344.The SD photocatalyst exhibits a broad, not well-defined diffractogram (Fig. S1), consistent with small sized anatase and rutile crystallites, expected to form through the low temperature spray drying synthesis of this material, and to the co-presence of amorphous TiO 2 . Also the surface area of P25-based materials did not significantly vary upon metal deposition, with the specific surface area of all samples being in the 50 2 m 2 g -1 range, i.e. identical to that of unmodified P25, as in previous studies 37,43.This further indicates that the host semiconductor retains its intrinsic characteristics after the here employed mild surface modification procedures.A higher specific surface area (148 2 m 2 g -1 ) was determined through BET analysis for the spray dried SD sample, in line with the results of XRD analysis pointing to the presence of small TiO 2 particles. Hydrogen production by photocatalytic steam reforming of methanol occurred at constant rate, as in previous studies 30,31,39.The photocatalytic activity results obtained in this reaction with the investigated materials are summarized in Table 1. Pt modified systems were more active than the corresponding unmodified materials or the sample containing Cu only, in line with the well-known positive role of noble metals in enhancing photoactivity.In fact, noble metal NPs can act as traps of the electrons photoexcited in the conduction band, with a consequently increased efficiency in the separation of photoproduced electronhole couples 41,45.The co-presence of Cu and Pt on the TiO 2 surface has a synergistic effect on photoactivity in hydrogen production.As clearly outlined in the case of Pt/Cu(0.1)/T(see Table 1), the rate of H 2 production obtained with this photocatalyst over- comes the sum of those obtained with the photocatalysts singly containing Cu or Pt (i.e., Cu(0.1)/T and Pt/T, respectively). The three bare TiO 2 samples showed similar photocatalytic performances (Table 1), with the T sample performing better than unmodified P25, in line with the red-shifted absorption properties arising from surface modification (Fig. 2).The slightly higher hydrogen production rate obtained with SD may be simply related to the larger surface area of this photocatalyst. While H 2 evolution in the photocatalytic steam reforming of methanol occurred at constant rate with all photocatalysts, their photoactivity in CO 2 reduction in the presence of water vapour was found to decline during irradiation, as evidenced by the production of carbon-containing reduced species (CH 4 and CO).Fig. 4 shows a typical CH 4 evolution profile recorded during a 6 h-long photocatalytic run in the presence of CO 2 and water vapour.Clearly, methane was produced at almost constant rate in the first two hours, followed by a sudden drop of the production rate to a lower value in the last 4 h.Similar results were obtained with the other photocatalysts. Aiming at gaining information about the origin of the observed photoactivity decrease and also at ascertaining the origin of the carbon-containing reduced species, a 6 h-long irradiation test was performed under anoxic conditions, i.e. in helium as recirculating gas, in the presence of water vapour only (no initial CO 2 addition).As shown in Fig. 5, we found that a considerable amount of CO 2 evolved under irradiation, with a relatively higher rate at the beginning of the run, followed by an almost constant CO 2 evolution regime.The so produced carbon dioxide can only originate from the decomposition of carbon-containing compounds on the photocatalyst surface.It is well known, in fact, that semiconductors such as metal oxides can easily adsorb a considerable amount of organic compounds and can contain organic impurities originated from the reagents employed in their preparation 141516.A comparison between the CH 4 evolution and CO 2 evolution results obtained with the same photocatalyst in the two experiments (see Figs. 4 and5) suggests that the photoactivity decline in CH 4 photocatalytic production is related to the progressive removal of carbon impurities from the photocatalyst surface. Please cite this article in press as: I. Grigioni, et al., Photocatalytic CO 2 reduction vs. H 2 production: The effects of surface carbon-containing impurities on the performance of TiO 2 -based photocatalysts, Catal.Today (2016), http://dx.doi.org/10.1016/j.cattod.2016.05.040Fig. 6.CH4 evolution obtained with Pt/T during a two-step photocatalytic CO2 reduction experiment.In the cleaning step the photocatalyst was irradiated in the presence of a gas phase containing water vapour and helium.After purging with helium (vertical line), CO2 was introduced in the recirculating gas phase starting the photocatalytic step. Aiming at understanding the contribution of such C-containing impurities on photoactivity, we divided the photocatalytic CO 2 reduction tests in a cleaning step followed by a second photocatalytic step in the presence of carbon dioxide.All carbon containing species accumulated in the gas phase at the end of the cleaning step were removed by a 40 min-long purging of the whole system with helium.An example of the results, in terms of methane production, obtained with the Pt/T sample is shown in Fig. 6.During the cleaning step methane evolved at a much higher rate than in the subsequent photocatalytic step in the presence of CO 2 .Similar results were obtained with the other photocatalysts.In general the rate of both CH 4 and CO evolution in the gas phase during irradiation showed an abrupt drop in the second (photocatalytic) step with respect to the cleaning step for all photocatalytic materials (see for example Figs.S2 andS3). An indirect estimation of the amount of carbon containing species present at the photocatalyst surface can be obtained from the total amount of CO 2 evolved during the cleaning step.Such values are collected in Fig. 7. Similar amounts of CO 2 accumulated in the gas phase during the cleaning step of untreated P25 TiO 2 and of the photocatalysts obtained from its modification.This suggests that the here adopted procedures to deposit Pt NPs and/or to graft Cu(II) on the TiO 2 surface did not introduce extra carbon sources on the photocatalyst surface.By contrast, a ca.four-fold larger CO 2 amount evolved from the SD sample under identical cleaning conditions, as expected from the higher content of carbon containing impurities detected in this latter by TGA analysis (Fig. 3).The rates of photocatalytic production of methane, carbon monoxide and ethane, obtained with the tested catalysts during both steps, are collected in Table 2. Extremely low traces of ethane were detected only during the cleaning step when testing the three metal-containing Cu(0.1)/T,Pt/Cu(0.1)/T and Pt/T samples.P25 and T samples exhibit a similar behaviour, confirming that the intrinsic surface properties of the photocatalysts were substantially unaltered by the here adopted metal deposition strategies.The photocatalysts modified by Pt NPs deposition were the most selective in CH 4 production, with the CO amount produced in parallel close to the detection limit our instrumentation.T and unmodified P25 showed intermediate selectivities toward CO production, while Cu(0.1)/Tshowed the highest selectivity toward CO, in line with the strong CO absorption ability of Cu ions that prevents the successive reduction of this intermediate to CH 4 14,15.On the other hand, a synergistic effect due to the co-presence of the two metals can be envisaged production from water splitting and in carbon dioxide photocatalytic reduction.The fact that evolution of methane and CO takes place under photocatalytic conditions in the absence of CO 2 during the cleaning step demonstrates that such reduced carbon-containing products do not originate exclusively from CO 2 photoreduction, but also from carbonaceous impurities present on the photocatalyst surface.The decrease in CH 4 and CO evolution rates observed after the consumption of such carbon sources indicates that such species act both as carbon sources and as electron donors filling photoproduced valence band holes.The water splitting experiment carried out in the presence of water vapour confirms the electron donor nature of the organic impurities. The results of the present study demonstrate that, because of the low production rates observed in the photocatalytic step of CO 2 photoreduction, the effects of carbon-containing impurities on the photocatalyst surface need to be taken into account, especially when employing photocatalysts prepared through low temperature synthetic procedures starting from organic precursors.In fact, due to the presence of such species, an overestimation of the rate of CO 2 photoreduction or even false positive results may be obtained.If isotopic labelling experiments are precluded, the here adopted two steps reaction test allows one to partially discern if the reduced carbon containing products effectively originate from photocatalytic CO 2 reduction. Fig. 1.Sketch of the experimental setup for photocatalytic reduction tests.A) Plexiglas photoreactor; B) photocatalyst bed, C) Pyrex glass window, D) six ways valve for CO2 injection, E) Bellows pump; F) four ways valve (dotted line: position for pre-flushing with inert gas; solid line: position for gas phase recirculation); G) thermostated bubbler; GC, gas chromatograph; FM, gas flow meter; TI, temperature indicator; PI, pressure indicator. Fig. 2. Absorption spectra of a) P25 TiO2; b) T; c) Cu(0.1)/T; d) Pt/Cu(0.1)/T and e) SD. Fig. 3. Thermogravimetric analysis of a) P25 TiO2; b) T; c) Pt/Cu(0.1)/T and d) SD.Inset: first derivative (DTG) pattern obtained for b) T and d) SD. Fig. 4. CH4 evolution profile obtained on Pt/T in the presence of 4 water vapour, 12 CO2 and 84 helium. Fig. 5. Carbon dioxide evolution profile obtained on Pt/T in the presence of water vapour and helium. Fig. 7. Total amount of CO2 evolved during the cleaning step of the six photocatalysts. H2 evolution rate obtained in the photo-steam reforming of methanol. C, similar to Please cite this article in press as: I. Grigioni, et al., Photocatalytic CO 2 reduction vs. H 2 production: The effects of surface carbon-containing impurities on the performance of TiO 2 -based photocatalysts, Catal.Today (2016), http://dx.doi.org/10.1016/j.cattod.2016.05.040 that of P25 itself; only Pt/Cu(0.1)/T evidences a ca.2 weight loss. CH4, CO and CH3CH3 evolution rates obtained during the cleaning step and the photocatalytic step of photocatalytic carbon dioxide reduction experiments. Please cite this article in press as: I. Grigioni, et al., Photocatalytic CO 2 reduction vs. H 2 production: The effects of surface carbon-containing impurities on the performance of TiO 2 -based photocatalysts, Catal.Today (2016), http://dx.doi.org/10.1016/j.cattod.2016.05.040Please cite this article in press as: I. Grigioni, et al., Photocatalytic CO 2 reduction vs. H 2 production: The effects of surface carbon-containing impurities on the performance of TiO 2 -based photocatalysts, Catal.Today (2016), http://dx.doi.org/10.1016/j.cattod.2016.05.040 The use of instrumentation purchased through the Regione Lombardia -Fondazione Cariplo joint SmartMatLab Project (Fondazione Cariplo grant 2013-1766) is gratefully acknowledged.IG is thankful to Fondazione Fratelli Confalonieri for a supporting grant. in the case of the Pt/Cu(0.1)/Tphotocatalyst, with Pt promoting the further reduction of CO absorbed on Cu sites. High surface area SD sample showed good productivity of both CO and CH 4 .Although no surface modification was performed on this sample, both production rates were quite high compared to those obtained with the P25 and T bare TiO 2 photocatalysts.This is clear evidence that the massive presence of carbon-containing compounds on the surface of the SD photocatalyst, observed by TGA analysis and confirmed by the large amount of CO 2 evolved during the cleaning step of this sample (see Figs. 3 and7), plays an important role in photocatalytic reduction test reactions. The results obtained with the four photocatalysts here prepared from P25 TiO 2 in H 2 production from photo-steam reforming and in CH 4 production are compared in Fig. 8.The rates of CH 4 production during the cleaning step exhibit an excellent correlation with the rates of H 2 production (Fig. 8a).Therefore the reducing properties of the four P25-based materials are perfectly retained in the two test reactions.Such linear correlation suggests that in the case of CH 4 evolution the carbonaceous impurities act not only as carbon source, but also as efficient hole scavengers in a way similar to methanol in H 2 photocatalytic production.Of course such surface impurities on the photocatalyst surface are consumed during the cleaning step, and consequently methane evolution drops in the following photocatalytic step, in which no correlation exists any more between H 2 production from photocatalytic steam reforming of methanol and CH 4 production from CO 2 photocatalytic reduction (see Fig. 8b).This indicates that water is a much less efficient hole scavenger than surface carbonaceous impurities originally present on the photocatalyst surface. Furthermore, while in the presence of electron donor species able to efficiently fill photoproduced holes a synergistic effect between platinum and copper co-catalysts is obtained in both H 2 production from methanol photosteam reforming and methane evolution in the presence of water vapour (Fig. 8a), such synergistic effect disappears when the carbonaceous species are removed from the photocatalyst surface (Fig. 8b and Table 2).In fact, the Cu co-catalyst negatively affects the rate of methane production, either with respect to naked TiO 2 (see the rate of CH 4 production obtained with Cu(0.1)/T vs. that obtained with T, in Table 2) or when platinum is present as co-catalyst on the titania surface (see the rate of CH 4 evolution obtained with Pt/Cu(0.1)/T vs. that obtained with Pt/T).However, the rate of methane evolution becomes much lower after the cleaning step and such a negative effect of grafted Cu is very likely related to a slightly increased selectivity toward CO 14,15. Finally, in order to obtain further insight into the electron donor attitude of surface carbon-containing species, a water splitting reaction test (i.e.H 2 evolution in the presence of N 2 as inert gas and H 2 O vapours as reactant) was made with the best performing Pt/Cu(0.1)/Tphotocatalyst.The H 2 evolution profile obtained during irradiation, reported in Fig. 9, resembles those of CH 4 evolution and CO 2 accumulation shown in Figs. 4 and5, respectively, with a fast initial production, followed by no further increase of the H 2 amount in the gas phase.This proves that the photocatalytic production of H 2 in the absence of methanol as hole scavenger is linked to the presence of the organic impurities on the photocatalyst, taking place only at the beginning of irradiation, when carbon-containing impurities act as electron donors filling photoproduced valence band holes."
  },
  {
    "title": "Conclusions",
    "content": "The important effects of carbon-containing species present on the photocatalyst surface are here demonstrated in both hydrogen"
  }
]