[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2016.04.052"
  },
  {
    "title": "Article_Title",
    "content": "g-C 3 N 4 /Bi 4 O 5 I 2 heterojunction with I 3 − /I − redox mediator for enhanced photocatalytic CO 2 conversion"
  },
  {
    "title": "Abstract",
    "content": "Heterojunction is an effectively construction to improve the photocatalytic activity due to the excellent photo-induced carrier separation efficiency.In this paper, g-C 3 N 4 /Bi 4 O 5 I 2 heterojunction was prepared and characterized by X-ray diffraction patterns (XRD), field emission scanning electron microscope (FESEM), transmission electron microscopy (TEM), UV-vis diffuse reflectance spectra (DRS) and X-ray photoelectron spectroscopy (XPS).The photocatalytic data showed that g-C 3 N 4 /Bi 4 O 5 I 2 heterojunction had higher activity than pure g-C 3 N 4 and Bi 4 O 5 I 2 .At an optimal ratio of 1.0 mol (11.4 wt of Bi 4 O 5 I 2 ), g-C 3 N 4 /Bi 4 O 5 I 2 photocatalyst showed the highest photocatalytic reduction activity for CO 2 conversion with 45.6 mol h -1 g -1 CO generation.Photocurrent and electrochemical impedance (EIS) spectroscopy revealed that higher photo-induced carrier separation efficiency of g-C 3 N 4 /Bi 4 O 5 I 2 .Z-scheme charge transfer mode was proved by I 3 -/I -redox mediator existence and superoxide radical (O 2 -) and hydroxyl radical ( OH) quantification experiments."
  },
  {
    "title": "Experimental",
    "content": "Urea, Bi(NO 3 ) (50 mL) and kept at 160 C for 16 h.After reaction, the complex precursors precipitate was obtained by centrifugation, and then washed with ethanol.Finally, it was dried at 80 C under air atmosphere. Complex precursor (0.3 g) was dispersed in 100 mL deionized water.Then, Bi 4 O 5 I 2 sample was obtained via a simple hydrolytic process, and washed successively with deionized water.Finally, it was dried at 80 C. X-ray diffraction patterns (XRD) of the samples recorded at room temperature, by a Bruker D8 advance X-ray diffractometer using Cu K radiation and 2 scan rate of 6 min -1 .Diffraction patterns were taken over the 2A range 5-70.FESEM images were obtained by a Sigma Zeiss Field Emission Scanning Electron Microscope.Transmission electron microscopy (TEM) and highresolution transmission electron microscopy (HRTEM) images were obtained by a JEOL JEM-2100F (RH) Field Emission Electron Microscope.X-ray photoelectron spectroscopy (XPS) measurements were carried out by Thermo Scientific ESCALAB 250XI X ray Photoelectron Spectrometer (Al Ka, 150 W, C1s 284.8 eV).UV-vis diffuse reflectance spectra (DRS) were obtained using UV-vis spectra (Perkin Elmer, Lambda 650s, BaSO 4 as a reference).The infrared spectra were obtained using a Nicolet 5700 Fourier transform infrared (FT-IR) spectrometer with KBr as the reference. The photocatalytic reduction of CO 2 was carried out in Labsolar-III AG closed gas system (Beijing Perfect light Technology Co., Ltd., China).0.10 g of g-C 3 N 4 , Bi 4 O 5 I 2 and g-C 3 N 4 /Bi 4 O 5 I 2 samples were uniformly dispersed onto a glass sheet with an area of 28.26 cm 2 , and then the glass sheet was put in a reaction cell (Pyrex glass).The volume of the reaction system was 350 mL.Prior to the light irradiation, the above system was thoroughly vacuum-treated to remove the air completely.Subsequently, 5 mL H 2 SO 4 (4 M) was injected into the reactor to react with NaHCO 3 to achieve 1 atm CO 2 gas.After that, the reactor was irradiated from the top by a 300 W high pressure xenon lamp with 400 nm cutoff filter (PLS-SXE300, Beijing Perfect light Technology Co., Ltd China) maintaining the photoreaction temperature at 15 C with DC-0506 low-temperature thermostat bath (Shanghai Sunny Hengping Scientific Instrument Co., Ltd China).At each time interval, about 0.15 mL of gas was taken from the reaction cell with subsequent qualitative analysis by GC9790II gas chromatography (GC, Zhejiang Fuli Analytical Instrument Co., Ltd China) equipped with a flame ionization detector (FID, GDX-502 columns) and a thermal conductivity detector (TCD, TDX-01 columns).The quantification of the production yield was based on a calibration curve.The outlet gases were determined to be O 2 , CO, CH 4 CO 2 , and few H 2 . NBT (2.5 10 -5 mol L -1 , exhibiting an absorption maximum at 259 nm) was used to determine the amount of photocatalytic O 2 generation.The production of O 2 was quantitatively analysed by detecting the concentration of NBT with Lambda 650s spectrophotometer.TA (5 10 -4 mol L -1 , 2 10 -3 mol L -1 NaOH solution), which reacts readily with OH to produce a highly fluorescent product, 2-hydroxyterephthalic acid fluorescence peak at about 425 nm by excitation with the wavelength of 315 nm), was employed as a probe molecule to determine the amount of photocatalytic OH generation.The production of OH was quantitatively analysed by detecting the concentration of 2-hydroxyterephthalic acid with Shimadzu fluorescence spectrophotometer (RF-5301pc) after centrifugation 37,38. The Mott-Schottky plots, transient photocurrent responses and electrochemical impedance spectra (EIS) of the samples were determined using a CHI660D electrochemical working station (CHI Instruments, Shanghai, China) in a three-electrode quartz cell with Na 2 SO 4 (0.1 M) electrolyte solution.Samples was deposited on a fluorinated-tin-oxide (FTO) conducting glass as the working electrode.Ag/AgCl and Pt were used as the reference and the counter electrodes, respectively."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Fig. 1 showed that XRD patterns of Bi 4 O 5 I 2 , g-C 3 N 4 and g-C 3 N 4 /20-Bi 4 O 5 I 2 .For Bi 4 O 5 I 2 , it can be seen that the XRD pattern was in agreement with is in agreement with previous reported results 35.Based on its CIF file, the crystal structure of Bi This data was in agreement with the above XRD result.On the other hand, the high-resolution XPS spectra of C1s (Fig. 2b) and N1s (Fig. 2c) also revealed the same binding energy and same intensity for g-C Photocatalytic CO 2 conversion was a new application for bismuth oxyhalides photocatalysts.In past two years, our group studied the CO 2 conversion into solar fuels over BiOBr, BiOI, Bi 5 O 7 I, and Bi 4 O 5 Br 2 34,42.And we also found that Bi 4 O 5 I 2 displayed outstanding photocatalytic activity for CO 2 conversion under visible light irradiation.Here, after Bi 4 O 5 I 2 loading on the surface of g-C 3 N 4 , we look forward to enhanced activity for Bi 4 O 5 I 2 .Fig. 5a was the photocatalytic rates of products for CO 2 conversion over g-C 3 N 4 /x-Bi 4 O 5 I 2 (x 0, 10, 20, 50, 70, and 100) under visible light irradiation for 5 h.It can be seen that there are CO, CH 4 , O 2 and H 2 were generated in g-C 3 N 4 /x-Bi 4 O 5 I 2 system for CO 2 conversion, and CO was the uppermost product.The best one was g-C 3 N 4 /x-Bi 4 O 5 I 2 photocatalyst with 45.6 mol h -1 g -1 , which was about 7.9 times than that of pure g-C 3 N 4 (5.8 mol h -1 g -1 ) and 2.3 times than that of pure Bi 4 O 5 I 2 (19.8 mol h -1 g -1 ).To the best of our knowledge, as shown in Table S1, this CO generation rate of g-C 3 N 4 /20-Bi 4 O 5 I 2 was the highest on of all reported Bi-O-X photocatalysts.5c) also revealed that the reduction of the photocatalytic activity was about 10 after 5 cycles (5 h per cycle).The fifth photocatalytic rate (40.5 mol h -1 g -1 ) still was about 6.89 times than that of pure g-C 3 N 4 (5.8 mol h -1 g -1 ) and 2.0 times than that of pure Bi 4 O 5 I 2 (19.8 mol h -1 g -1 ). As we know that the photocatalytic activity usually affected by the photon absorption efficiency, photo-induced carrier separation efficiency, adsorption, hydrophilicity, and so on.Based on the above DRS spectra, the photon absorption efficiency of g- samples with light on were smaller than that of light off (in dark).It revealed that g-C 3 N 4 /Bi 4 O 5 I 2 had a lower electron-transfer resistance value (Fig. 6a) than that of g-C 3 N 4 and pure Bi 4 O 5 I 2 , especially when light on.On the other hand, the photocurrent for g-C 3 N 4 /20-Bi 4 O 5 I 2 was much higher than that of pure g-C 3 N 4 and pure Bi 4 O 5 I 2 when light was on (Fig. 6b).Therefore, the mobility and separation efficiency of the photo-induced carriers was efficaciously improved after Bi 4 O 5 I 2 loading on the surface of g-C 3 N 4 . In order to understand the photo-induced carrier separation mechanism, the energy band structure including band gaps, conduction band (CB) and valence band (VB) positions of pure Bi 4 O 5 I 2 and g-C 3 N 4 should be confirmed.The Mott-Schottky plots of pure g-C 3 N 4 (Fig. 7a) and Bi 4 O 5 I 2 (Fig. 7b) film electrodes at frequencies of 1000 and 2000 Hz were showed.The flat potentials of g-C 3 N 4 and Bi 4 O 5 I 2 were calculated to be -0.55 and -0.24 V versus the Ag/AgCl electrode, respectively.And they were equivalent to -0.23 and -0.02 V versus the normal hydrogen electrode (NHE) 43,44.It can be found that the band energies of Bi 4 O 5 I 2 and g-C 3 N 4 (Fig. 7d) were matching for charge transfer mechanism to improve photo-induced carrier separation efficiency.However, we also found that the E vf of g-C 3 N 4 was higher than Bi 4 O 5 I 2 .It implied Z-scheme mechanism also suitable for photo-induced carrier separation efficiency enhancement 45.In order to check which mechanism happened, ROS quantification experiments were showed in Fig.As we known that redox mediator or Z-scheme bridge was very important for photocatalytic Z-scheme mechanism.For examples, noble metal Au and Ag usually acted as Z-scheme bridge in three photocatalytic system 50,51.And Fe 3 /Fe 2 and IO 3 -/I - usually acted as redox mediator for Z-scheme system 52,53.In g-C 3 N 4 /Bi 4 O 5 I 2 system, the I3d XPS spectra (Fig. 9) displayed that the peaks of g-C 3 N 4 /Bi 4 O 5 I 2 were not symmetrical.Except for the I -ions at 618.89 eV and 630.36 eV, I 3 -ions (probably deriving from the photocatalytic oxidation of I -ions) at 620.47 eV and 631.66 eV also appeared, 54,55.It indicated that I 3 -/I -redox mediator may play key role for the Indirect Z-Scheme g-C 3 N 4 /Bi 4 O 5 I 2 photocatalytic system.Based on the above discussion, the photo-induced electron-hole separation processes for CO 2 conversion was showed in Fig. 10.If the charge transfer mechanism happened (Fig. 10a), the CO 2 conversion reaction (CO was the main product) position of g-C 3 N 4 /Bi"
  },
  {
    "title": "Conclusions",
    "content": "In this work, g-C 3 N 4 /Bi 4 O 5 I 2 heterojunction samples were prepared and characterized by XRD, FESEM, TEM, DRS and XPS.The photocatalytic CO 2 conversion data showed that an optimal ratio of 1.0 mol (11.4In conclusion, this research implied that other bismuth oxyiodide based coupled photocatalysts may also work via Z-scheme mechanism with I 3 -/I -or IO 3 -/I -redox mediators assistant. .4. g-C 3 N 4 /Bi 4 O 5 I 2 g-C 3 N 4 (100 mg) was dispersed into 100 mL deionized water, and different percentage (10, 20, 50 and 70) of complex precursor was dispersed into above solution with 300 W high pressure xenon irradiation.And samples with different ratio of g-C 3 N 4 /Bi 4 O 5 I 2 .The (g-C 3 N 4 /10-Bi 4 O 5 I 2 , g-C 3 N 4 /20-Bi 4 O 5 I 2 , g-C 3 N 4 /50-Bi 4 O 5 I 2 , g-C 3 N 4 /70-Bi 4 O 5 I 2 ) were obtained after drying at 80 C. Fig.1showed that XRD patterns of Bi 4 O 5 I 2 , g-C 3 N 4 and g-C 3 N 4 /20-Bi 4 O 5 I 2 .For Bi 4 O 5 I 2 , it can be seen that the XRD pattern was in agreement with is in agreement with previous reported results35.Based on its CIF file, the crystal structure of Bi 4 O 5 I 2 was showed in Fig.S1.And it is monoclinic structure, space group: P21, unit cell parameters: a 1.494 nm, b 0.5698 nm, and c 1.126 nm, 90.0 , 99.8 .The two mainly peaks at 28.8 and 31.5 Fig. 1.XRD patterns of Bi4O5I2, g-C3N4 and g-C3N4/20-Bi4O5I2. 3 N 4 and g-C 3 N 4 /20-Bi 4 O 5 I 2. It also indicated that the content of Bi 4 O 5 I 2 was low in g-C 3 N 4 /20-Bi 4 O 5 I 2 .The first C1s peak at 284.6 eV corresponded to carbon impurities which was usually observed in the XPS analysis and used as the calibration peak.The second (288.1 eV) and weakest C1s (293.4 eV) peaks were identified as sp2-bonded carbon (N C N) and the -excitations of CN heterocycles, respectively 16,17,36.The first (398.57eV), second (400.0 eV), third (401.27eV) and weakest (404.36 eV) N1s peaks were corresponded to the sp2 hybridized aromatic N bonded to carbon atoms (C N C), the tertiary N bonded to carbon atoms in the form of N (C)3 or H N (C)2, the quaternary N bonded to three carbon atoms in the aromatic cycles, and the -excitations of CN heterocycles, respectively 16,17,36.Fig. 2d displayed the highresolution XPS of Bi4f.Firstly, the intensity of g-C 3 N 4 /20-Bi 4 O 5 I 2 was much lower than that of Bi 4 O 5 I 2 , which verified the above conclusion about Bi/N mole ratio.Furthermore, compared to pure Bi 4 O 5 I 2 , the Bi4f XPS peaks of g-C 3 N 4 /20-Bi 4 O 5 I 2 increased 0.46 and 0.36 eV for Bi4f 7/2 and Bi4f 5/2, respectively.And the fullwidth at half-maximum (FWHM) of Bi4f 7/2 increased significantly from 1.11 eV to 1.32 eV.The peak shifts and broadening implied the binding interaction between Bi 4 O 5 I 2 and g-C 3 N 4 that during the hydrolytic process 41.Fig. 3 showed the comparison of the UV-vis DRS spectra of Bi 4 O 5 I 2 , g-C 3 N 4 and g-C 3 N 4 /20-Bi 4 O 5 I 2 .The Bi 4 O 5 I 2 and g-C 3 N 4 had fundamental absorption edges at 570 nm and 450 nm, respectively.After Bi 4 O 5 I 2 loading on the surface of g-C 3 N 4 , the g-C 3 N 4 /20-Bi 4 O 5 I 2 showed the absorption edge at 454 nm.The corresponding band gap values of Bi 4 O 5 I 2 (2.19 eV), g-C 3 N 4 (2.76 eV) and g-C 3 N 4 /20-Bi 4 O 5 I 2 (2.73 eV) were compared as shown in Fig. 3b 36.It indicated that all samples can be excited by visible light.So, in this work, all activity experiments were done under visible light ( 400 nm) irradiation. Fig. 2. XPS spectra of Bi4O5I2, g-C3N4 and g-C3N4/20-Bi4O5I2: (a) survey; (b) C 1s; (c) N 1s; and (d) Bi 4f. Fig. 3. DRS spectra of Bi4O5I2, g-C3N4 and g-C3N4/20-Bi4O5I2. Photocatalytic CO 2 conversion was a new application for bismuth oxyhalides photocatalysts.In past two years, our group studied the CO 2 conversion into solar fuels over BiOBr, BiOI, Bi 5 O 7 I, and Bi 4 O 5 Br 234,42.And we also found that Bi 4 O 5 I 2 displayed outstanding photocatalytic activity for CO 2 conversion under visible light irradiation.Here, after Bi 4 O 5 I 2 loading on the surface of g-C 3 N 4 , we look forward to enhanced activity for Bi 4 O 5 I 2 .Fig.5awas the photocatalytic rates of products for CO 2 conversion over g-C 3 N 4 /x-Bi 4 O 5 I 2 (x 0, 10, 20, 50, 70, and 100) under visible light irradiation for 5 h.It can be seen that there are CO, CH 4 , O 2 and H 2 were generated in g-C 3 N 4 /x-Bi 4 O 5 I 2 system for CO 2 conversion, and CO was the uppermost product.The best one was g-C 3 N 4 /x-Bi 4 O 5 I 2 photocatalyst with 45.6 mol h -1 g -1 , which was about 7.9 times than that of pure g-C 3 N 4 (5.8 mol h -1 g -1 ) and 2.3 times than that of pure Bi 4 O 5 I 2 (19.8 mol h -1 g -1 ).To the best of our knowledge, as shown in TableS1, this CO generation rate of g-C 3 N 4 /20-Bi 4 O 5 I 2 was the highest on of all reported Bi-O-X photocatalysts.Fig.5bdisplayed the photocatalytic yields of g-C 3 N 4 /20-Bi 4 O 5 I 2 under visible light irradiation for different time.As can be seen, the total yields of CO, CH 4 , O 2 and H 2 were enhanced with the irradiation time continuation.It indicated that g-C 3 N 4 /Bi 4 O 5 I 2 samples can used for CO 2 photoreduction for the whole time.And the cyclic experiment (Fig.5c) also revealed that the reduction of the photocatalytic activity was about 10 after 5 cycles (5 h per cycle).The fifth photocatalytic rate (40.5 mol h -1 g -1 ) still was about 6.89 times than that of pure g-C 3 N 4 (5.8 mol h -1 g -1 ) and 2.0 times than that of pure Bi 4 O 5 I 2 (19.8 mol h -1 g -1 ).As we know that the photocatalytic activity usually affected by the photon absorption efficiency, photo-induced carrier separation efficiency, adsorption, hydrophilicity, and so on.Based on the above DRS spectra, the photon absorption efficiency of g-C 3 N 4 /20-Bi 4 O 5 I 2 , Bi 4 O 5 I 2 and g-C 3 N 4 should be at the same level.So, the photocatalytic activity enhancement should come from the improved photo-induced carrier separation efficiency.For proving this pinot, the electrochemical impedance and photocurrent responses spectra of Bi 4 O 5 I 2 , g-C 3 N 4 and g-C 3 N 4 /20-Bi 4 O 5 I 2 were compared as shown in Fig. 6.It was observed that the smaller diameter of semicircle arc of g-C 3 N 4 /20-Bi 4 O 5 I 2 than that of pure g-C 3 N 4 and pure Bi 4 O 5 I 2 .Furthermore, the diameter of semicircle arc of all Photocatalytic CO 2 conversion was a new application for bismuth oxyhalides photocatalysts.In past two years, our group studied the CO 2 conversion into solar fuels over BiOBr, BiOI, Bi 5 O 7 I, and Bi 4 O 5 Br 234,42.And we also found that Bi 4 O 5 I 2 displayed outstanding photocatalytic activity for CO 2 conversion under visible light irradiation.Here, after Bi 4 O 5 I 2 loading on the surface of g-C 3 N 4 , we look forward to enhanced activity for Bi 4 O 5 I 2 .Fig.5awas the photocatalytic rates of products for CO 2 conversion over g-C 3 N 4 /x-Bi 4 O 5 I 2 (x 0, 10, 20, 50, 70, and 100) under visible light irradiation for 5 h.It can be seen that there are CO, CH 4 , O 2 and H 2 were generated in g-C 3 N 4 /x-Bi 4 O 5 I 2 system for CO 2 conversion, and CO was the uppermost product.The best one was g-C 3 N 4 /x-Bi 4 O 5 I 2 photocatalyst with 45.6 mol h -1 g -1 , which was about 7.9 times than that of pure g-C 3 N 4 (5.8 mol h -1 g -1 ) and 2.3 times than that of pure Bi 4 O 5 I 2 (19.8 mol h -1 g -1 ).To the best of our knowledge, as shown in TableS1, this CO generation rate of g-C 3 N 4 /20-Bi 4 O 5 I 2 was the highest on of all reported Bi-O-X photocatalysts.Fig.5bdisplayed the photocatalytic yields of g-C 3 N 4 /20-Bi 4 O 5 I 2 under visible light irradiation for different time.As can be seen, the total yields of CO, CH 4 , O 2 and H 2 were enhanced with the irradiation time continuation.It indicated that g-C 3 N 4 /Bi 4 O 5 I 2 samples can used for CO 2 photoreduction for the whole time.And the cyclic experiment (Fig.5c) also revealed that the reduction of the photocatalytic activity was about 10 after 5 cycles (5 h per cycle).The fifth photocatalytic rate (40.5 mol h -1 g -1 ) still was about 6.89 times than that of pure g-C 3 N 4 (5.8 mol h -1 g -1 ) and 2.0 times than that of pure Bi 4 O 5 I 2 (19.8 mol h -1 g -1 ).As we know that the photocatalytic activity usually affected by the photon absorption efficiency, photo-induced carrier separation efficiency, adsorption, hydrophilicity, and so on.Based on the above DRS spectra, the photon absorption efficiency of g-C 3 N 4 /20-Bi 4 O 5 I 2 , Bi 4 O 5 I 2 and g-C 3 N 4 should be at the same level.So, the photocatalytic activity enhancement should come from the improved photo-induced carrier separation efficiency.For proving this pinot, the electrochemical impedance and photocurrent responses spectra of Bi 4 O 5 I 2 , g-C 3 N 4 and g-C 3 N 4 /20-Bi 4 O 5 I 2 were compared as shown in Fig. 6.It was observed that the smaller diameter of semicircle arc of g-C 3 N 4 /20-Bi 4 O 5 I 2 than that of pure g-C 3 N 4 and pure Bi 4 O 5 I 2 .Furthermore, the diameter of semicircle arc of all Fig. 5. (a) Rates of products for g-C3N4/x-Bi4O5I2 (x 0, 10, 20, 50, 70, and 100) under visible light irradiation for 5 h, (b) yields of the products over g-C3N4/20-Bi4O5I2 under visible light irradiation for different time, and (c) cyclic experiment over g-C3N4/20-Bi4O5I2 under visible light irradiation for 5 h per circulation. Fig. 6.(a) electrochemical impedance and (b) photocurrent responses spectra of Bi4O5I2, g-C3N4 and g-C3N4/20-Bi4O5I2. Fig. 7c was the VB-XPS spectra of g-C 3 N 4 and Bi 4 O 5 I 2 .It showed that the energy gap between the valence band of Fermi level (E vf ) were 2.31 and 1.45 eV for pure g-C 3 N 4 and Bi 4 O 5 I 2 , respectively 45.It is known that the flat potentials of n-type semiconductors was the fermi level 45-47.So, the VB positions of g-C 3 N 4 and Bi 4 O 5 I 2 were 2.08 and 1.45 eV, respectively.Based on the band gaps, the CB positions of g-C 3 N 4 and Bi 4 O 5 I 2 were -0.68 and -0.76 eV, respectively.And the diagram of the band energy of Bi 4 O 5 I 2 and g-C 3 N 4 was showed in Fig. 7d.It can be found that the band energies of Bi 4 O 5 I 2 and g-C 3 N 4 (Fig.7d) were matching for charge transfer mechanism to improve photo-induced carrier separation efficiency.However, we also found that the E vf of g-C 3 N 4 was higher than Bi 4 O 5 I 2 .It implied Z-scheme mechanism also suitable for photo-induced carrier separation efficiency enhancement45.In order to check which mechanism happened, ROS quantification experiments were showed in Fig.8.By comparing the change of ROS concentration, it can confirm the photocatalytic oxidation reaction and reduction reaction happening positions of g-C 3 N 4 /Bi 4 O 5 I 2 .For photocatalytic reduction reaction, NBT was used to test O 2 -.It can be seen that Fig. 7c was the VB-XPS spectra of g-C 3 N 4 and Bi 4 O 5 I 2 .It showed that the energy gap between the valence band of Fermi level (E vf ) were 2.31 and 1.45 eV for pure g-C 3 N 4 and Bi 4 O 5 I 2 , respectively 45.It is known that the flat potentials of n-type semiconductors was the fermi level 45-47.So, the VB positions of g-C 3 N 4 and Bi 4 O 5 I 2 were 2.08 and 1.45 eV, respectively.Based on the band gaps, the CB positions of g-C 3 N 4 and Bi 4 O 5 I 2 were -0.68 and -0.76 eV, respectively.And the diagram of the band energy of Bi 4 O 5 I 2 and g-C 3 N 4 was showed in Fig. 7d.It can be found that the band energies of Bi 4 O 5 I 2 and g-C 3 N 4 (Fig.7d) were matching for charge transfer mechanism to improve photo-induced carrier separation efficiency.However, we also found that the E vf of g-C 3 N 4 was higher than Bi 4 O 5 I 2 .It implied Z-scheme mechanism also suitable for photo-induced carrier separation efficiency enhancement45.In order to check which mechanism happened, ROS quantification experiments were showed in Fig.8.By comparing the change of ROS concentration, it can confirm the photocatalytic oxidation reaction and reduction reaction happening positions of g-C 3 N 4 /Bi 4 O 5 I 2 .For photocatalytic reduction reaction, NBT was used to test O 2 -.It can be seen that g-C 3 N 4 and Bi 4 O 5 I 2 display same reduction activity for O 2 generation due to the equilibration of CB potential and photo-induced carrier separation efficiency (higher CB potential and lower separation efficiency for Bi 4 O 5 I 2 , lower CB potential and higher separation efficiency for g-C 3 N 4 ).After Bi 4 O 5 I 2 loading, g-C 3 N 4 /Bi 4 O 5 I 2 displayed enhanced reduction activity for O 2 generation.Because charge transfer mechanism resulted g-C 3 N 4 -CB reduction position and Z-scheme mechanism resulted Bi 4 O 5 I 2 -CB reduction position all can improve the reduction activity of g-C 3 N 4 /Bi 4 O 5 I 2 , it is difficult to confirm which mechanism happened via photocatalytic reduction reaction.For photocatalytic oxidation reaction, TA was used to test OH.It can be seen that g-C 3 N 4 /Bi 4 O 5 I 2 displayed enhanced oxidation activity than pure g-C 3 N 4 .And Bi 4 O 5 I 2 did not Fig. 7. Mott-Schottky plots of pure g-C3N4 (a) and Bi4O5I2 (b) film electrodes at frequencies of 1000 and 2000 Hz in an aqueous solution of Na2SO4 (0.1 M); (c) valence band XPS spectra of pure g-C3N4 and Bi4O5I2; and (d) Diagram of the band energy of Bi4O5I2 and g-C3N4. Fig. 8. Reactive oxygen species quantification experiments under visible light irradiation: NBT for O2and TA for OH. Fig. 9. I3d XPS spectra of Bi4O5I2 and g-C3N4/20-Bi4O5I2. 4 O 5 I 2 should be g-C 3 N 4 -CB rather than Bi 4 O 5 I 2 CB.And the H 2 O oxidation reaction (O 2 was the main product) position of g-C 3 N 4 /Bi 4 O 5 I 2 should be Bi 4 O 5 I 2 -VB rather than g-C 3 N 4 -VB.However, it was impossible for H 2 O oxidation reaction on Bi 4 O 5 I 2 -VB (Fig. 5a).So, the photocatalytic CO 2 conversion with CO, CH 4 , O 2 and H 2 generation cannot be enhanced via charge transfer mechanism.And the I 3 -/I -redox mediator assisted Z-scheme mechanism was more suitable to explain the enhanced activity for CO 2 conversion (Fig. 10b).Under the visible light irradiation, Bi 4 O 5 I 2 and g-C 3 N 4 were excited.The simultaneous electron transfers pathway (g-C 3 N 4 -CB I 3 -/I - Bi 4 O 5 I 2 -VB) enhanced photo-induced electron-hole separation efficiency.At end, g-C 3 N 4 /Bi 4 O 5 I 2 showed improved photocatalytic activity for CO 2 conversion. Fig. 10.Photocatalytic enhancement schematic diagram for CO2 conversion via photo-induced electron-hole separation processes: (a) charge transfer mechanism, and (b) Z-scheme mechanism. scheme mechanism for enhanced photocatalytic CO 2 conversion.In conclusion, this research implied that other bismuth oxyiodide based coupled photocatalysts may also work via Z-scheme mechanism with I 3 -/I -or IO 3 -/I -redox mediators assistant. 3 5H 2 O, KI, glycerol, ethanol, nitroblue tetrazolium (NBT), terephthalic acid (TA) and NaOH were purchased from Sinopharm Chemical Reagent Co., Ltd.And they were of analytical reagent grade without further purification.NO 3 ) 3 5H 2 O was dissolved into another 20 mL glycerol.Then, KI solution was added into the Bi(NO 3 ) 3 5H 2 O solution drop by drop with continuously stirring.The suspension was transferred into Teflon-lined stainless steel autoclaves 364 was synthesized according to the literature method36.2.2.2.Complex precursorKI (2 mmol) was dissolved into 20 mL glycerol, and 2 mmol Bi( This work was supported by the National Natural Science Foundation of China (No. 51502146, U1404506), Natural Science Foundation of Henan Department of Science Technology (No. 142102210477), Natural Science Foundation of Henan Department of Education (No. 14A150021), Natural Science Foundation of Nanyang Normal University (No. ZX2014039), Scientific Research Starting Project of SWPU (No.2015QHZ001) and Young Scholars Development Fund of SWPU (No.201499010100). Supplementary data associated with this article can be found, in the online version, at http://dx.doi.org/10.1016/j.apcatb.2016.04.052."
  }
]