[
  {
    "title": "Doi",
    "content": "10.1021/ie403742j"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic Reduction of CO<sub>2</sub> Using Ti–MCM-41 Photocatalysts in Monoethanolamine Solution for Methane Production"
  },
  {
    "title": "Abstract",
    "content": "Photocatalytic reduction of carbon dioxide (CO 2 ) to form a valuable energy source of methane (CH 4 ) in monoethanolamine (MEA) solution is first investigated by mesoporous photocatalysts of Ti-MCM-41 in this study.The MEA solution was chosen as the absorbent and reductant because amine absorption is one of the most popular methods for CO 2 capture from flue gas streams.Also, it is intended to integrate the CO 2 capture and utilization into one process.The photocatalytic results of methane yields indicated that MEA served as a better reductant than water and NaOH which have been commonly used for CO 2 reduction.For the best photocatalyst of Ti-MCM-41(50) manufactured at a Si/Ti molar ratio of 50, its methane yield (62.42 mol/g of cat.) was much higher than that of commercial P25 photocatalyst after 8 h of UV illumination.A photoreduction quantum efficiency (PQE) of 9.18 was achieved."
  },
  {
    "title": "Experimental",
    "content": "2.1.Catalyst Preparation.Ti-MCM-41 mesoporous photocatalysts with Si/Ti molar ratios of 200, 100, and 50 were synthesized by a hydrothermal method using sodium metasilicate (Na 2 SiO 3 9H 2 O) and titanium oxysulfate (TiOSO 4 ) as the starting materials.In a typical procedure, 21.2 g of sodium metasilicate was first dissolved in 100 mL of deionized (DI) water. 21,22Titanium oxysulfate was dissolved in 20 mL of 2 M sulfuric acid (H 2 SO 4 ) and then added dropwise into the above solution.The pH value of the solution was then adjusted to 10.5 using 2 M sulfuric acid followed by further stirring to form a gel.Meanwhile, 7.28 g of cetyltrimethylammonium bromide (CTAB) was dissolved in 25 mL of DI water and then it was added dropwise into the above solution.The molar composition of the solution mixture was SiO 2 :XTi:0.2CTAB:0.89H 2 SO 4 :120H 2 O (X was the amount of Ti added to obtain different Si/Ti molar ratios).The resulting solution mixture was put in an autoclave and then placed in an oven at 145 C for 36 h.The resultant solid was then recovered by filtration, washed with DI water, and dried in an oven at 120 C.Finally, the organic template was removed in the oven at 550 C for 6 h.The photocatalyst was denoted as Ti-MCM-41(Z), where Z (1/X) was the molar ratio of Si/Ti. 2.2.Catalyst Characterization.Powder low angle X-ray diffraction patterns of calcined mesoporous adsorbents were recorded by an X-ray (wavelength 1.5405A) diffractometer (Bruker D8 SSS) equipped with a copper target operated at 30 kV and 20 mA.The diffractograms of the mesoporous samples were recorded in the 2 range of 2-50with a scanning speed of 1 deg/min.The morphology of the materials was observed via TEM (JEOL JEM-3000F) images.The photocatalyst samples were mixed and ground with KBr (10:90) and pressed into slices.Then the samples were measured with Fourier transform infrared spectroscopy (FT-IR) (Bruker, Vector 22).The range of the scan was from 400 to 4000 cm -1 .X-ray photoelectron spectroscopy (XPS) was used to identify the surface composition of photocatalysts with an ESCA PHI 1600.The metal contents were determined by inductively coupled plasma atomic emission spectroscopy (ICP-AES) using a Jarrell-Ash ICAP9000 instrument.UV-vis diffuse reflectance spectra of samples were measured by using a UV-vis spectrophotometer (HITACHI U3012) equipped with an integral sphere using aluminum oxide (Al 2 O 3 ) as a reference.The spectra of samples were recorded within the range 200-800 nm.The specific surface area, pore volume, and average pore diameter (BJH method) of the samples were measured by N 2 adsorption-desorption isotherms using a surface area analyzer (Micromeritics, ASAP 2000).All the samples were degassed at 350 C for 6 h under vacuum (10 -6 mbar) prior to the adsorption experiments. 2.3.Photocatalytic Reduction of CO 2 .The experimental setup for the photocatalytic reduction of CO 2 is shown in Figure 1.In the liquid phase reaction, the catalyst loading was 0.1 g in 300 mL of solution of reducing agent.MEA, NaOH, and H 2 O were respectively used as reducing agents, with solution concentration of 0.2 M for MEA and NaOH.Before each reaction test, the solution was aerated with CO 2 (99.999) for 1 h to ensure full dissolution of CO 2 in the reducing agents.The experiments were then carried out in a batch reactor with the temperature controlled at 40 C and Ti-MCM-41 photocatalyst was illuminated in the solution under 9 W and 254 nm of a UVC lamp.The lamp intensity was measured to be 32 W/cm 2 .The products were analyzed by a gas chromatograph (SRI-8610C) equipped with a flame ionization detector (FID) and 5 m long Porapak Q column.The major product of the reaction was analyzed to be methane."
  },
  {
    "title": "Results_and_Discussion",
    "content": "3.1.Catalyst Characterization.Powder X-ray diffraction patterns are shown in Figure 2. It shows that MCM-41 had the regularity of hexagonal columnar structure, which contained four well-defined diffraction peaks of (100), ( 110), (200), and (210) located at 2 of 2-10. 23,24However, for the Ti-MCM-41 photocatalysts, the low angle XRD patterns exhibited diffraction peaks assigned to (100) and (110) crystal faces only; the intensity of the other two characteristic peaks at (200) and (210) was not very clear.This indicates that the regularity of pore structure was decreased.Nevertheless, the catalysts still retained the mesoporous structure of MCM-41. 25,26The two diffraction peaks at (100) and (110) were decreased when the amount of Ti content was increased, which revealed that more Ti content doped into the framework of MCM-41 could cause damage to the pore structure.However, the XRD results did not reveal any evidence of TiO 2 , which should have peaks appearing from 25 to 43.3.Thus, the presence of TiO 2 particles on the surface of the MCM-41 mesoporous materials might only be in a minor amount: most of the Ti atoms should be either incorporated into the MCM-41 framework or well dispersed as tiny TiO 2 particles in a small amount. The pore characteristics and metal contents of mesoporous MCM-41 and Ti-MCM-41 were obtained, and the results are shown in Table 1.The specific surface areas of Ti-MCM-41materials were approximately around 840-850 m 2 g -1 when Si/Ti molar ratios of Ti-MCM-41 were between 200 and 50.It appears that the metal content of Ti in the test range did not significantly affect the specific surface area. The mesostructure was further confirmed by TEM analysis with results shown in Figure 3 for pure MCM-41 and Ti-MCM-41(50).The TEM image of pure MCM-41 (Figure 3A) clearly shows uniform pore structure and the regularity of hexagonal columnar structure, while the photocatalyst which There should also be peaks at 1076 and 1235 cm -1 for the Si-O-Si vibration bands but they are flat lines as observed in Figure 4; this indicates spectra saturation because of the large amounts of Si-O bonds in the materials.On the other hand, the peaks at 968 and 1639 cm -1 represent the groups of Si-OH or H 2 O. 30 The peaks of Ti-MCM-41 were very similar to those of MCM-41 except that slight shifts of peaks from 800, 968, and 1639 cm -1 toward lower energy are observed.There has been no direct evidence for the shifts of 800 and 1639 cm -1 to lower energy as searched from literature data.However, it was observed in the literature 31 that if Si-OH groups were replaced by Ti ligands, the peak at ca. 968 cm -1 would gradually disappear while another peak appeared at a lower band of ca.943 cm -1 due to the formation of Ti-O-Si bridges. To further explore the state of the titanium species, the Ti-MCM-41 samples were subjected to X-ray photoelectron spectroscopic (XPS) analysis and the results are shown in Figure 5.The Ti 2P 3/2 regions show two doublets peaks for the Ti-MCM-41.As seen from the curve-fitted spectra, according to the literature, 323334 these may correspond to titanium in tetrahedral (higher binding energy (BE), square symbols) and octahedral coordinated Ti (lower BE, circle symbols). 35,36The octahedral coordination may be derived from the conversion of tetracoordinated titanium located at the surface of the material to octahedrally coordinated titanium by reaction with H 2 O(g) in the atmosphere as well as to segregation of TiO 2 species at the surface of the materials. 32However, the XPS might still have not provided sufficient evidence on the difference between tetrahedral and octahedral Ti 4 sites; further studies using X-ray absorption near edge structure (XANES) or electron paramagnetic resonance (EPR) may be encouraged to clarify this. Figure 6 shows the UV-vis absorption spectra obtained by diffuse reflection of MCM-41 and Ti-MCM-41.The absorption band spectra were used for the determination of the band gap using the equation of E g 1240/ (where is wavelength edge of absorption band).For pure MCM-41, no significant UV absorption was observed.For Ti-MCM-41 of different Si/Ti molar ratios, it can be observed that, as the Ti content was increased, the absorption edge was shifted appreciably to longer wavelength.The corresponding band gaps were about 4.85 and 4.5 eV, respectively, for Ti-MCM-41(200) and Ti-MCM-41(50).The absorption of light could be used to further reveal the state of Ti.The absorption in the range between 200 and 230 nm was an electron transport phenomenon; 37383940 i.e., the electrons of O atoms transited to adjacent Ti atoms (O 2- Ti 4 ).Thus, the results of FT-IR, UV-vis, and XPS indicated that most of the Ti atoms were tetrahedral Ti 4 existing in all materials of Ti-MCM-41.It was also observed for Ti-MCM-41(50) that it had a slight absorption ability after the wavelength of 300 nm.This might be due to the partial aggregation of Ti 4 as the Ti content was increased in the structure of Ti-MCM-41. 41.2.Photocatalytic Reduction of CO 2 .During the tests, CH 4 and CO are found to be the two detectable reaction products for the CO 2 reduction reaction.Because there might be a carbon source for the reaction other than from CO 2 , for example, the MEA reducing agent itself could be the carbon source which led to CH 4 and CO yields, blank tests were performed to clarify this.The results of CH 4 and CO yields with and without blank tests after 8 h of CO 2 reduction reaction are listed in Table 2. Two blank tests were conducted: one without the presence of CO 2 (but with photocatalysts and 0.2 M MEA) and another without the presence of MEA (but with photocatalysts and CO 2 ).The blank tests without the presence of CO 2 were used to evaluate the contribution of CH 4 and CO yields from MEA, and the results showed that 0.2 M MEA accounted for about 6.2-6.4 of the total CH 4 yield and no CO was formed.On the other hand, the blank tests without the presence of MEA were for understanding the effect of using DI water as the sole solution for the photocatalytic test.When MEA was not present in the solution, CO 2 in the DI water contributed about 7.4-7.7 of the total CH 4 yields and 10.4-15.3 of the CO yields.The effect of direct photoreduction of MEA (without the presence of any photocatalyst and CO 2 , but with MEA and UV light source) was also evaluated, where the CH 4 and CO yields were negligible; hence the data are not listed in Table 2.In the following results, all CH 4 and CO yield data with 0.2 M MEA as the reducing agent were presented by subtracting the blank test results from the original total CH 4 and CO yields.Because CH 4 is the main product, the subsequent discussions will focus on the main product of CH 4 . Because NaOH and water are the most commonly used reagents in the literature for the CO 2 photocatalytic reduction, 8,42434445 they were tested and compared with the result using MEA as the absorbent/reductant.The comparison results are shown in Figure 7.The methane production rate with NaOH solution, 1.96 mol/g of cat., appears to be the lowest among the three solutions.This may be because when NaOH is reacted with high concentration of CO 2 , it might result in the formation of sodium bicarbonate (NaHCO 3 ) particles and be precipitated in the solution.Thus, the CO 2 concentration could be decreased due to the particle formation and precipitation effects.When MEA was used as the CO 2 absorbent and reductant, the methane yield was greatly enhanced.After 8 h of UV illumination, the methane production rate was 62.42 mol/g of cat.using MEA, which was about 10 times higher than that of using DI water only: 5.62 mol/g of cat.This result indicates that CO 2 capture with MEA from flue gas streams and the simultaneous CO 2 utilization to form a CH 4 usable energy source could possibly be integrated into one process. The photocatalytic activity of Ti-MCM-41 materials was also compared to that of commercial TiO 2 (P25), and the results are shown in Figure 8.After an 8 h test, the results showed that all three Ti-MCM-41 samples had much higher activity than that of TiO 2 .This may be because the mesoporous silica materials had higher tendencies for absorbing amines and resulted in more basic surface sites, which was helpful for the reaction with acidic CO 2 molecules. 46It was also observed from Figure 8 that the methane yield followed the order Ti-MCM-41(50) Ti-MCM-41(100) Ti-MCM-41(200).The best methane yield of Ti-MCM-41(50) was because it had the highest Ti metal content of 0.8 wt while still retaining its high specific surface area of 843 m 2 /g as shown in Table 1. The photocatalytic reduction efficiency of photocatalysts was evaluated in terms of the photoreduction quantum efficiency (PQE) defined by the following equation: 8,43 where n e is the number of moles of electrons required to produce 1 mol of product from reactant.The moles of incident UV photons absorbed by photocatalysts was calculated by the following equation. where l int is the incident light intensity (32 W/cm 2 ), A proj is the area of light irradiation projected in the reactor (278 cm 2 ), h is the Planck constant, c is the speed of light, and is the wavelength of light (254 nm).All methane yields of photocatalysts were compared after 8 h of UV illumination, and the total PQEs are summarized in Table 3.The best photoreduction efficiency of photocatalyst was achieved at 9.18 when using the Ti-MCM-41(50) as the photocatalyst and MEA as the absorbent/reductant.This implies that an appropriate amount of Ti content could enhance catalytic activity in the CO 2 reduction reaction."
  },
  {
    "title": "Conclusions",
    "content": "The photocatalytic reduction of CO 2 with MEA to form methane was studied and compared to those using NaOH and H 2 O as the CO 2 reductants.The results indicated that this novel method opens the possibility of integrating the most mature CO 2 capture process of MEA absorption and the CO 2 photocatalytic reduction process into one process.This not only reduces the necessity of storage of CO 2 in the deep sea or underground, but also produces methane as a useful energy source.The experimental results demonstrated that Ti-MCM-41 materials displayed better reaction performance than commercial TiO 2 .The Ti-MCM-41(50) could achieve a methane production rate of 62.42 mol/g of cat. and photoreduction quantum efficiency of 9.18 under UV light.However, the CO 2 reduction tests conducted in this study were at deep UV light (254 nm); this would limit the application of this process.Thus, future studies should be directed toward the development of photocatalysts which are functional under visible light and also toward the further improvement of photoreduction quantum efficiency. Corresponding Author Tel.: 886-3-5731868.Fax: 886-3-5725958.E-mail: hlbai mail.nctu.edu.tw. The authors declare no competing financial interest. Support from the National Science Council, Taiwan, through Grant NSC 99-2221-E-009-037-MY3 is gratefully acknowledged. Figure 1.Schematic of experimental setup for photocatalytic reduction of CO 2 using 9 W, 254 nm UV lamp. Figure 2. Low angle XRD patterns of MCM-41, Ti-MCM-41, and TiO 2 . Figure 3. TEM images of (A) pure MCM-41 and (B) Ti-MCM-41(50). Figure 4. FT-IR spectroscopy result of Ti-MCM-41. Figure 5. XPS spectra of Ti-MCM-41. Figure 6.UV-vis absorption spectra obtained by diffuse reflection of (a) Ti-MCM-41(200), (b) Ti-MCM-41(100), and (c) Ti-MCM-41(50). yield rate ( mol/h) mol incident UV photon abs rate by cat.( mol/h) Figure 7.Comparison of methane yields in solutions of MEA, NaOH, and water, respectively, with Ti-MCM-41(50) for the CO 2 photocatalytic reduction reaction. Figure 8.Effect of Si/Ti molar ratios of Ti-MCM-41photocatalysts on the methane yield of CO 2 photocatalytic reduction reaction in MEA solution. Pore Characteristics and Metal Contents of Mesoporous Photocatalysts a BET surface area.b Pore volume.c Pore diameter calculated by BJH theory. Product Yield with and without Blank Tests after 8 h of CO 2 Reduction Reaction The percentages shown in parentheses are the percentages of the total CH 4 and CO yields.The final data shown in the following figures are the total CH 4 and CO yields subtracted from the blank test data. a b N.D. means the products not detected from GC-FID. Photoreduction Quantum Efficiency (PQE) of Catalysts after 8 h UV Illumination dx.doi.org/10.1021/ie403742j Ind. Eng.Chem.Res.2014, 53, 11221-11227 Downloaded by UNIV AUTONOMA DE MADRID on September 3, 2015 http://pubs.acs.orgPublication Date (Web): July 3, 2014 doi: 10.1021/ie403742j Downloaded by UNIV AUTONOMA DE MADRID on September 3, 2015 http://pubs.acs.orgPublication Date (Web): July 3, 2014 doi: 10.1021/ie403742j"
  }
]