[
  {
    "title": "Doi",
    "content": "10.1016/j.jcou.2019.05.007"
  },
  {
    "title": "Article_Title",
    "content": "Photoconversion of CO2 over Fe-N-Ti@xSBA nanocomposite to produce hydrocarbon fuels"
  },
  {
    "title": "Abstract",
    "content": "In this study, Fe and N co-doped TiO 2 immobilized on the mesoporous SBA-15 was synthesized (denoted as Fe-N-TixSBA) to enhance CO 2 photoreduction performance.The nanocomposites were prepared by an in-situ sol gel method to allow intimate contact between Fe-N-TiO 2 nanoparticles and SBA component.The Fe and N atoms defected into the TiO 2 lattice, leading to the creation of Ti 3 and oxygen vacancies in the TiO 2 structure and subsequently increasing the photocatalytic activity under visible light irradiation.Deposition of Fe-N-TiO 2 nanoparticles on mesoporous SBA further increased fuel production.The maximum methane and methanol production were found to be 38.72 mol g -1 cat.h -1 and 1.73 mol g -1 cat.h -1 , respectively, over Fe-N-Ti60SBA composite with 60 wt. of SBA at optimum partial pressures of P CO2 0.758 bar and P H2O 0.096 bar.Methane production over the best composite (Fe-N-Ti60SBA) was about 1.4 times higher than Fe-N-TiO 2 sample under visible light irradiation.The superior activity of composites could be related to the better dispersion of the Fe-N-TiO 2 particles, the formation of heterojunction and the effective charge transfer, as well as higher CO 2 adsorption capacity.The experimental data was then fitted into the new kinetic model based on Sips theory to predict kinetic parameters.The obtained affinity coefficient of CO 2 for Fe-N-Ti60SBA sample, 142.47 bar -1 , was much more than that of Fe-N-TiO 2 , 22.74 bar -1 , indicating the higher CO 2 adsorption capacity of Fe-N-TiO60SBA composite."
  },
  {
    "title": "Experimental",
    "content": "Titanium tetra iso propoxide (TTIP) ((Ti(i-C3H7O2)4), 97 purity), hydrochloric acid (HCl, 37), acetic acid (CH3COOH, pure), 2-propanol (CH3CH(OH)CH3, 99.7 pure), methanol (CH 3 OH, 99 assay), urea (NH 2 CONH 2 , 99.5 assay), tetraethyl orthosilicate (TEOS, Si (OC 2 H 5 ) 4 , 98) and iron (III) nitrate (Fe(NO 3 ) 3 .9H 2 O, 99 assay) were purchased from Merck company.Pluronic P123 (poly (ethylene oxide)-poly (propylene oxide)-poly (ethylene oxide)) (PEO 20 PPO 70 PEO 20 ) and commercial titanium dioxide (P25) were bought from Sigma-Aldrich company.All materials were used without further purification. Fe-N-codoped TiO 2 sample with loading ratio of 0.12 wt. and 0.5 wt. for Fe and N, respectively, was prepared by sol gel method.60 ml of 2-propanol was added into 20 ml of TTIP and stirred during 30 min.Then, the appropriate amount of iron (III) nitrate (Fe (NO 3 ) 3 .9H 2 O) and urea (NH 2 CONH 2 ) dissolved in 12 ml of acetic acid (CH 3 COOH, 1 M) and 20 ml of 2-propanol were added drop-wise into above solution and stirred for 24 h.The sol was then aged for 16 h at 25 C.After that, the gel was dried at 80 C for 12 h and finally calcined at 500 C during 2 h.The product was named Fe-N-TiO 2 with mass ratio 0.12 of Fe/TiO 2 and 0.5 of N/TiO 2 . Hydrothermal treatment method was used to synthesize the mesoporous SBA-15 sample, according to the procedure reported by Zhao et.al 45.Firstly, 4 g of Pluronic P123 was dissolved in 125 g of 2 M hydrochloric acid (HCl) at 35 C under stirring until homogeneous solution was formed.Then 8.5 g of TEOS was added drop-wise into the solution under vigorous stirring for 30 min.The mixture was then stirred slowly for 20 h at 35 C, after that the mixture was aged at 80 C for 24 h in a 250 ml screw cap bottle.The obtained product was recovered by filtration, washed thoroughly with deionized water and dried at 80 C for 12 h.Finally, the SBA-15 particles calcined at 550 C for 4 h. The 0.12 Fe-0.5N-TiO 2 /SBA-15 nanocomposites were synthesized by an in-situ sol -gel method in the presence of SBA particles in order to allow an intimate contact between mesoporous SBA and TiO 2 nanoparticles.The process of synthesis was based on the Fe-N-TiO 2 synthesis procedure.Firstly, 60 ml of 2-propanol was added into 20 ml of TTIP and stirred during 30 min.Then, the appropriate amount of iron (III) nitrate (Fe(NO 3 ) 3 .9H 2 O) and urea (NH 2 CONH 2 ) dissolved in 12 ml of acetic acid (CH 3 COOH, 1 M) and 20 ml of 2-propanol were added drop-wise into above solution and stirred for 24 h.The synthesized SBA particles was then added to solution and stirred well for another 24 h.Finally, the same aging, drying, and calcination procedure was used.The synthesized sample were labeled as Fe-N-TixSBA, where x specifies the weight percent of mesoporous SBA-15 in composites (from 40 to 70 wt.). X-ray diffraction (XRD) patterns on a X' Pert Pro diffractometer (Panalytical company) using Cu K radiation (k 1.5418A) were acquired to indicate crystal structure and phase composite.The light absorption spectra of the composites over a range of 250-800 nm was measured using a UV-Vis spectrophotometer (Avaspec-2048-TEC) using barium sulfate (BaSO 4 ) used as reflectance standard.Nitrogen adsorption-desorption isotherms of the synthesized composites were conducted at temperature of -196 C on a Nova Station B adsorption apparatus after samples degassed for 2 h at 180 C.Field emission scanning electron microscope (FE-SEM) (model MIRA3 TESCAN) and attached Energy dispersive X-ray spectroscopy (EDS) were used to observe the surface morphology, microstructure and elemental composition of samples.The chemical composition and elemental chemical state of the composites were conducted with an X-ray photoelectron spectroscopy (XPS) (Thermo fisher Scientific K-Alpha XPS spectrometer).Finally, the real weight percentages of Fe, Ti and Si were obtained by inductively coupled plasma atomic emission spectrometry (ICP-AES) using an Optima 4300 DV spectrometer (Perkin-Elmer). The photocatalytic activity of synthesized Fe-N-TixSBA composites were conducted in a CO 2 photoreduction set-up as reported in our previous study 10, (Fig. 1).Highly pure CO 2 (99.999) and N 2 gas adjusted with two mass flow controllers were bubbled through the two water bubblers in series to produce a mixture of CO 2 and water vapor.The mixture of CO 2 and H 2 O was then introduced into a continuous flow reactor which is included two main parts: the Pyrex vessel with diameter and height of 6 cm x 15 cm and second the quartz tube where 70 W high pressure mercury vapor lamp with light intensity of 85 mW/ cm 2 in the range of 300-600 nm is fixed.Circulated cooling water containing sodium nitrite (NaNO 2 , 2 M) was applied to absorb the UV portion of light and heat emitted from light source.The temperature of reactor was also determined with a thermocouple.The CO 2 photoreduction tests were carried out in the photoreactor, which contained 0.3 0.01 g of the Fe-N-TixSBA powders coated on the inner surface of Pyrex vessel. Prior to each test, moist CO 2 gas was passed through the photoreactor at flow rate of 40 ml/min to eliminate any impurities.After 40 min purging, the total flow rate of reactants was decreased to 13 ml/ min and fixed during the entire photoreaction process.The concentration of the effluent gas was analyzed every 10 min intervals using a GC (Young Lin YL-6500, equipped with a capillary column and a flame ionization detector (FID)).To evaluate catalyst stability, the procedure was repeated for four CO 2 reduction runs, after each 60 min test period the sample was heated at 100 C for 4 h. In the current work, the best weight percent of SBA-15 was obtained for different synthesized Fe-N-TixSBA samples at fixed P CO2 and P H2O .After that, the optimum CO 2 and H 2 O partial pressures were found over the best photocatalyst to increase fuel production.The partial pressure of H 2 O (P H2O ) was adjusted by changing the temperature of the bubblers and the partial pressure of CO 2 (P CO2 ) was regulated by changing the flow ratio of CO 2 to carrier gas (N 2 ). Fig. 2a shows low-angle XRD patterns of pure SBA and different Fe-N-TixSBA composites.Obviously, the pattern of pure SBA shows three diffraction peaks that can be indexed as (100), ( 110) and (200) diffractions, which is related to the ordered hexagonal mesoporous structure 46.The peak intensity of Fe-N-TixSBA composites corresponding to the hexagonal symmetry were decreased with the increase of TiO 2 contents, indicating that these composites still preserve the original mesoporous structure.Moreover, (100) diffraction peaks of samples shifted slightly to higher angle with increasing TiO 2 content, revealing the distortion of the mesoporous framework and the deposition of TiO 2 particles in mesopores 37,47. Wide-angle XRD patterns of Fe-N-TixSBA composites and Fe-N-TiO 2 sample were shown in Fig. 2b.Obviously, all composites show similar diffraction patterns to Fe-N-TiO 2 sample.It is observed that higher SBA contents prevents the formation of TiO 2 with higher crystallinity.However, the crystallinity of titania was increased with increasing of TiO 2 loading into SBA.The mean crystallite size of TiO 2 in composites was calculated by Scherrer equation and listed in Table 1.As shown in Table 1, the particle size of TiO 2 in composites (range of 10.4-11.7 nm) was smaller than that of Fe-N-TiO 2 sample, which indicates that SBA mesoporous can prevent the growth of TiO 2 nanoparticles.Moreover, Fe and N peaks were not detected in XRD patterns due to the high dispersion of dopants in TiO 2 or due to the low content of Fe and N atoms 10. Adsorption-desorption isotherms and pore size distributions of different Fe-N-TixSBA composites were investigated and shown in Fig. 3.All of composites revealed typical type IV adsorption-desorption curves, as shown in Fig. 3a, which are representative of mesoporous structures 39.The relative pressure (P/P 0 ) range of the H 2 -type hysteresis loop was from 0.5 to 0.82 for pure SBA, although for Fe-N-Ti xSBA samples has a slight shift to lower relative pressure from 0.45 to 0.70.These results indicate that Fe-N-TixSBA composites have smaller mesopores compared with that of pure SBA, possibly due to the dispersion of some of the Fe-N-TiO 2 nanoparticles inside the SBA channels.As shown in Fig. 3b, the average pore size of composites decreases from 7.99 to 6.30 with the decrease of the SBA content.This is due to the fact that increasing the TiO 2 content may block the pores of SBA, and hence the average pore size of the composites was reduced. As shown in Table 1, the BET surface area of composites was significantly increased compared to the surface area of Fe-N-TiO 2 sample after the incorporation of SBA into Fe-N-TiO 2 .The specific surface area of Fe-N-TiO 2 was 78.5 m 2 g -1 .This value was increased for composite samples from 221.9 m 2 g -1 to 514.3 m 2 g -1 with increasing SBA content from 30 wt to 70 wt.Fe-N-TixSBA composites with high surface areas are useful to the active sites exposure and the interaction between CO 2 and H 2 O components and catalyst surface, therefore favoring the enhancement of CO 2 photoreduction efficiency. Fig. 4 shows the UV/vis spectra of Fe-N-TixSBA composites.As shown in Fig. 4, the combination of TiO 2 with SBA resulted in a blueshift of the absorption band towards UV wavelengths.The absorption spectra for the composite samples showed an increase shift towards UV wavelengths with increasing SBA content.Band gap values of samples were obtained from a plot of F(R).h 1/2 versus photon energy (h) (Fig. 5).The larger band gap of the composites can be ascribed to the quantum mechanics theory 39,48.This is may be due to the smaller particle size of Fe-N-TiO 2 particles which limited by SBA nanometer channels 49.This result suggests that the incorporation of mesoporous SBA can efficiently prevent the growth of TiO 2 nanoparticles (Table 1). In Fig. 6, the morphological structure of the Fe-N-Ti60SBA composite was studied by FESEM and EDX analysis.The SBA particles with micrometer size and approximately spherical shaped were seen in Fig. 6a.The particles of synthesized TiO 2 could be observed on the surface of Fe-N-Ti60SBA sample as shown by the red arrows in Fig. 6b.EDX analysis and elemental mapping of Fe, N, Ti, O and Si atoms of the Fe-N-Ti60SBA composite were shown in Fig. 7. EDX analysis confirmed that there was an almost uniform distribution of Fe-N-TiO 2 sample on the surface of SBA. The existence and actual weight percentages of various composites were determined by ICP-AES analysis and listed in Table 1.The results showed that elemental fractions of the composites are in agreement with the compositions used for synthesis.X-ray photoelectron spectroscopy was conducted to determine the elemental chemical states and structural composition in Fe-N-Ti 60SBA composite and was shown in Fig. 8. Fig. 8a shows the overall scan spectrum of Fe-N-Ti60SBA sample which contains six elemental signals C, Fe, N, Ti, O and Si.As shown in Fig. 8b, in the Fe 2p spectra of Fe-N-Ti60SBA composite, two peaks located at binding energies ca.710.1 and 725.3 (eV) belong to the 2p 3/2 and 2p 1/2 of Fe 3 , respectively.Three signals at binding energies ca.397.0, 398.4 and 400.6 (eV) were observed in the N 1s spectra (Fig. 8c).The peaks at binding energies 400.6 and 398.4 (eV) belong to the nitrogen containing compounds such as NH 3 and NO x which adsorbed on the sample surface.The signal at binding energy 397.0 eV was ascribed to substitutional nitrogen in the TiO 2 lattice.Fig. 8d shows two signals at binding energies ca.458.1 (eV) and 464.3 (eV), which assigned to the Ti 4 2p 3/2 and Ti 4 2p 1/2 of TiO 2 , respectively, while two signals at The CO 2 adsorption capacity is an important factor in the performance of photoreduction process.Hence, the adsorption capacity of CO 2 was evaluated for Fe-N-TixSBA samples.As shown in Fig. 9, CO 2 adsorption capacity of composites was increased compared to Fe-N-TiO 2 .The increase in CO 2 adsorption capacity can be beneficial for improved fuel production.The CO 2 adsorption capacity of composites was obtained from 0.16 mmol g -1 to 0.29 mmol g -1 at 25 C and 1 bar and increased almost linearly with SBA content (Table 2).It is believed that the improvement of CO 2 adsorption ability of the Fe-N-TixSBA composites compared to that of Fe-N-TiO 2 may enhance the performance of process. A series of blank experiments were first carried out under the following conditions to ensure that methane and methanol were produced from CO 2 photoreduction reaction: (1) without light irradiation, catalysts were coated on inner surface of reactor with CO The effect of SBA on photocatalytic performance was investigated over Fe-N-TixSBA samples under 70 W visible light irradiation with a fixed total flow rate of 13 ml/min.The Fe and N concentration were fixed at 0.12 wt. and 0.5 wt., respectively, whereas, the weight percent of SBA varied from 40 to 70 wt..methane and methanol production over synthesized composites were shown in Fig. 10 at constant partial pressure of CO 2 and H 2 O (0.758 and 0.155 bar, respectively).No product was detected for pure SBA.However, combination of Fe-N-TiO 2 with SBA resulted in an enhancement in the production efficiency compared to the Fe-N-TiO 2 sample.Among the Fe-N-TixSBA composite samples, the sample with 60 wt.,Fe-N-Ti 60SBA, showed the highest fuel production with 37.37 mol g -1 cat.h -1 of methane and 1.23 mol g -1 cat.h -1 of methanol.As shown in Fig. 10, a further increase in the SBA weight percent has been led to a decrease in the performance of process, which may be due to a shading effect by the excessive content of SBA. A physical mixture of FeTiO 2 particles and SBA with 60 wt. of SBA was prepared to compare with synthesized Fe-N-Ti60SBA sample.As shown in Fig. 11, the product rate over Fe-N-TixSBA sample was higher than the physically mixed sample.This result can be attributed to a strong interaction which formed between TiO 2 and SBA components in the synthesis of Fe-N-TixSBA composites.The formed interaction makes electrons easily transferred from TiO 2 to SBA and so the recombination of electrons-holes can be suppressed.Hence, photocatalytic activity was improved over Fe-N-Ti60SBA sample compared to physical mixture.Moreover, the rate of methane over the best composite, i.e.Fe-N-Ti60SBA, was 1.33 times higher than Fe-N-TiO 2 under visible light (Fig. 11). The stability tests were conducted over Fe-N-Ti60SBA composite and the results were shown in Fig. 12.After four cycling runs, there was no obvious change of the rate of products over Fe-N-Ti60SBA composite.Furthermore, this is confirmed by comparing the XRD patterns of fresh and used sample after four runs (Fig. 13).The XRD pattern shows that the structure of sample was not changed in the used composite compared to the fresh sample.Therefore, it verifies that the composite is stable and can be reused for several cycles. The results show that production rate of methane and methanol over Fe-N-TiO 2 sample can be increased by coupling with mesoporous SBA.This superior performance over composites is believed to be mainly ascribed to the higher specific surface area and higher CO 2 adsorption capacity, as demonstrated by the BET and CO 2 adsorption analysis.Moreover, doping of Fe and N atoms into the structure of TiO 2 , leading to the creation of Ti 3 and oxygen vacancies in the TiO 2 .The Fe-N-TiO 2 0.06 Fe-N-Ti40SBA 0.20 Fe-N-Ti60SBA 0.26 Fe-N-Ti70SBA 0.29 SBA 0.33 oxygen vacancies created new adsorption sites on the surface of TiO 2 to adsorb CO 2 .The Ti 3 ions created a new level of energy between the valence band (VB) and the conduction band (CB) of photocatalyst, which improved the generated electrons-holes separation performance and improved the visible light absorption.The Fe metal distributed on the photocatalyst surface can also act as an electron sink to reduce the electrons-holes recombination process.Consequently, the synthesized Fe-N-TixSBA composites produced a large number of electron-hole pairs, even under visible irradiation.Furthermore, SBA as the support may inhibit the grain growth of Fe-N-TiO 2 nanoparticles as verified by XRD analysis.Also, the formed heterojunction between TiO 2 and SBA can suppress the electrons-holes recombination and so increase the photocatalytic activity.Although, the blue shift of adsorption spectra for composites, due to the presence of SBA component (DRS analysis, Fig. 4), may have the negative effect on the photocatalytic activity under visible light irradiation. The CO 2 and H 2 O partial pressures are two crucial parameters which can affect the CO 2 photoreduction efficiency.Hence, the effect of these parameters was investigated on the rate of production to obtain the optimum conditions for fuel production. The experiments were conducted over Fe-N-Ti60SBA sample with flow rate of 13 ml/min and the results were shown in Fig. 14.At constant P H2O 0.155 bar, the rate of production increased with increasing P CO2 until it attains an optimum rate at P CO2 0.758 bar (Fig. 14a).However, the rate of methane and methanol was decreased after optimum partial pressure of CO 2 .Similarly, the rate of production increased with increasing P H2O , at fixed P CO2 0.758 bar, until it attains an optimum rate at P H2O 0.096 bar (Fig. 14b).whereas, an excessive amount of H 2 O occupied active sites of catalyst and decreased the efficiency of process. Therefore, the maximum methane and methanol rates of 38.72 mol g -1 cat.h -1 and 1.73 mol g -1 cat.h -1 , respectively, were obtained over Fe-N-Ti60SBA composite at optimum partial pressure of P CO2 0.758 bar and P H2O 0.096 bar. In the case of nonhomogeneous surface with different reactivity sites, the theory of Sips can be used to predict kinetic of adsorption 10,50.In pervious study, we developed a kinetic model based on Sips theory for CO 2 photoreduction process over nonhomogeneous surface, which described as follows in Eq. (1) to Eq. (3) 10: (1) where k CH4 is the methane rate coefficient, I is the intensity of light source fixed at 85 mW/cm 2 , presents the reaction order of light intensity, n is heterogeneity factor and b CO2 and b H2O are affinity coefficient of CO 2 and H 2 O, respectively.The constants of the kinetic model were obtained for Fe-N-Ti 60SBA sample by correlating it with the experimental data of P CO2 , P H2O , I (fixed at 85 mW/cm 2 ) and the rate of methane given from Section 3.3.2.The constants of the model were estimated using MA-TLAB software, version 9.0, and presented in Table 3. In the current work, the affinity coefficient of CO 2 (b CO2 ) over Fe-N-Ti60SBA composite was found to be 142.47 bar -1 , that is higher than b CO2 , 22.74 bar -1 , for Fe-N-TiO 2 sample obtained from previous study 10.This result is consistent with the results of CO 2 adsorption experiments in section 3.2, which showed higher CO 2 adsorption ability over Fe-N-Ti60SBA than the Fe-N-TiO 2 sample. Eq. ( 4) exhibited the predicted methane rate over Fe-N-Ti60SBA sample by incorporating the obtained constants of kinetic model into Eq.(3).(4) Fig. 15 shows the comparison between rates of CH 4 obtained from Eq. ( 4) and experimental data from 3.3.2.The predicted results are consistent with experimental data and fitted well with an R-squared value of 0.9881.Additionally, the proposed kinetic model was validated by testing the kinetic model to another P CO2 and P H2O over Fe-N-Ti60SBA.The result was shown that rate of CH 4 by kinetic model, 30.03 mol g -1 cat.h -1 , well agreed with the experimental rate of CH 4 , 30.84 mol g -1 cat.h -1 , at P CO2 0.4 bar and P H2O 0.21 bar. The constants of kinetic model over Fe-N-Ti60SBA sample at light intensity of 85 mW/cm 2 . Parameter Predicted value k (mol g -1 cat.h -1 ) 7.46 b CO2 (bar) -1 142.47 b H2O (bar) -1 1584.0 0.69 n 1.81 The new Fe-N-TixSBA composites were prepared via an in-situ sol gel method to establish a strong interaction between Fe-N-TiO 2 nanoparticles and mesoporous SBA component.The results showed that CO 2 photoreduction to fuels was enhanced over composites compared to Fe-N-TiO 2 sample.Particularly the methane production over Fe-N-Ti 60SBA was increased by up to 1.4 times compared to Fe-N-TiO 2 samples under visible irradiation.This superior performance can be mainly ascribed to the higher specific surface area and higher CO 2 adsorption capacity, formation of heterojunction and suppressing of electronsholes recombination.Moreover, the maximum methane and methanol rates of 38.72 mol g -1 cat.h -1 and 1.73 mol g -1 cat.h -1 , respectively, were found over best sample (Fe-N-Ti60SBA) at optimum partial pressure of P CO2 0.758 bar and P H2O 0.096 bar.The obtained data was then fitted into the new kinetic model based on Sips theory to predict kinetic parameters.The obtained affinity coefficient of CO 2 for Fe-N-Ti 60SBA sample, 142.47 bar -1 , was much more than that of Fe-N-TiO 2 , 22.74 bar -1 , indicating the more power in CO 2 adsorption over composites than that of Fe-N-TiO 2 sample. Fig. 1.Schematic diagram of CO 2 photoreduction set-up. Fig. 2. (a) Low-angle and (b) wide-angle XRD patterns of different Fe-N-Ti xSBA composites. Fig. 3. N 2 adsorption-desorption isotherms (a) and BJH pore size distribution (b) of different Fe-N-TixSBA composites. Fig. 4. UV-vis adsorption spectra of the synthesized Fe-N-TixSBA samples. Fig. 5. Tauc plot of different Fe-N-TixSBA samples to estimate band gap values. Fig. 6.FESEM images of the Fe-N-Ti60SBA composite at lower (a) and higher (b) magnifications. Fig. 7. EDX analysis of Fe-N-Ti60SBA sample with Fe, N, Ti, O and Si elemental mapping. 2 and H 2 O, (2) under light irradiation, photocatalysts were coated on inner surface of reactor with N 2 and H 2 O (in the absence of CO 2 ), and (3) without Fig. 8. XPS spectra of Fe-N-Ti60SBA sample; (a) full spectra (b) Fe 2p, (c) N 1s, (d) Ti 2p and (e) O 1s. Fig. 9. CO 2 adsorption capacity of different Fe-N-TixSBA synthesized samples measured at 25 C. capacity (at 25 C and 1 bar) of Fe-N-TixSBA composites.Sample CO 2 adsorption capacity (mmol g -1 ) Fig. 10.Product rate over Fe-N-TixSBA composite under 70 W visible light irradiation (flow rate 13 ml/min, P CO2 0.758 bar and P H2O 0.155 bar). Fig. 11.Comparison between Fe-N-TiO 2 , Fe-N-Ti60SBA and mechanical mixture of Fe-N-TiO 2 and SBA. Fig. 12. Stability test over Fe-N-Ti60SBA composite in four cycling runs. Fig. 13.XRD analysis of the fresh and used Fe-N-Ti60SBA sample. Fig. 14.Rate of production over Fe-N-Ti60SBA sample at (a) various partial pressure of CO 2 (total flow rate 13 ml/min, P H2O 0.155 bar) and (b) various partial pressure of H 2 O (total flow rate 13 ml/min, P CO2 0.758 bar). Fig. 15.Comparison between rate of CH 4 obtained from model and experimental data over Fe-N-Ti60SBA. Average TiO 2 crystallite size, surface area and elemental composition of the composites. Journal of CO2Utilization 33 (2019) 21222324252627282930"
  },
  {
    "title": "Results_and_Discussion",
    "content": "Fig. 2a shows low-angle XRD patterns of pure SBA and different Fe-N-TixSBA composites.Obviously, the pattern of pure SBA shows three diffraction peaks that can be indexed as (100), ( 110) and (200) diffractions, which is related to the ordered hexagonal mesoporous structure 46.The peak intensity of Fe-N-TixSBA composites corresponding to the hexagonal symmetry were decreased with the increase of TiO 2 contents, indicating that these composites still preserve the original mesoporous structure.Moreover, (100) diffraction peaks of samples shifted slightly to higher angle with increasing TiO 2 content, revealing the distortion of the mesoporous framework and the deposition of TiO 2 particles in mesopores 37,47. Wide-angle XRD patterns of Fe-N-TixSBA composites and Fe-N-TiO 2 sample were shown in Fig. 2b.Obviously, all composites show similar diffraction patterns to Fe-N-TiO 2 sample.It is observed that higher SBA contents prevents the formation of TiO 2 with higher crystallinity.However, the crystallinity of titania was increased with increasing of TiO 2 loading into SBA.The mean crystallite size of TiO 2 in composites was calculated by Scherrer equation and listed in Table 1.As shown in Table 1, the particle size of TiO 2 in composites (range of 10.4-11.7 nm) was smaller than that of Fe-N-TiO 2 sample, which indicates that SBA mesoporous can prevent the growth of TiO 2 nanoparticles.Moreover, Fe and N peaks were not detected in XRD patterns due to the high dispersion of dopants in TiO 2 or due to the low content of Fe and N atoms 10. Adsorption-desorption isotherms and pore size distributions of different Fe-N-TixSBA composites were investigated and shown in Fig. 3.All of composites revealed typical type IV adsorption-desorption curves, as shown in Fig. 3a, which are representative of mesoporous structures 39.The relative pressure (P/P 0 ) range of the H 2 -type hysteresis loop was from 0.5 to 0.82 for pure SBA, although for Fe-N-Ti xSBA samples has a slight shift to lower relative pressure from 0.45 to 0.70.These results indicate that Fe-N-TixSBA composites have smaller mesopores compared with that of pure SBA, possibly due to the dispersion of some of the Fe-N-TiO 2 nanoparticles inside the SBA channels.As shown in Fig. 3b, the average pore size of composites decreases from 7.99 to 6.30 with the decrease of the SBA content.This is due to the fact that increasing the TiO 2 content may block the pores of SBA, and hence the average pore size of the composites was reduced. As shown in Table 1, the BET surface area of composites was significantly increased compared to the surface area of Fe-N-TiO 2 sample after the incorporation of SBA into Fe-N-TiO 2 .The specific surface area of Fe-N-TiO 2 was 78.5 m 2 g -1 .This value was increased for composite samples from 221.9 m 2 g -1 to 514.3 m 2 g -1 with increasing SBA content from 30 wt to 70 wt.Fe-N-TixSBA composites with high surface areas are useful to the active sites exposure and the interaction between CO 2 and H 2 O components and catalyst surface, therefore favoring the enhancement of CO 2 photoreduction efficiency. Fig. 4 shows the UV/vis spectra of Fe-N-TixSBA composites.As shown in Fig. 4, the combination of TiO 2 with SBA resulted in a blueshift of the absorption band towards UV wavelengths.The absorption spectra for the composite samples showed an increase shift towards UV wavelengths with increasing SBA content.Band gap values of samples were obtained from a plot of F(R).h 1/2 versus photon energy (h) (Fig. 5).The larger band gap of the composites can be ascribed to the quantum mechanics theory 39,48.This is may be due to the smaller particle size of Fe-N-TiO 2 particles which limited by SBA nanometer channels 49.This result suggests that the incorporation of mesoporous SBA can efficiently prevent the growth of TiO 2 nanoparticles (Table 1). In Fig. 6, the morphological structure of the Fe-N-Ti60SBA composite was studied by FESEM and EDX analysis.The SBA particles with micrometer size and approximately spherical shaped were seen in Fig. 6a.The particles of synthesized TiO 2 could be observed on the surface of Fe-N-Ti60SBA sample as shown by the red arrows in Fig. 6b.EDX analysis and elemental mapping of Fe, N, Ti, O and Si atoms of the Fe-N-Ti60SBA composite were shown in Fig. 7. EDX analysis confirmed that there was an almost uniform distribution of Fe-N-TiO 2 sample on the surface of SBA. The existence and actual weight percentages of various composites were determined by ICP-AES analysis and listed in Table 1.The results showed that elemental fractions of the composites are in agreement with the compositions used for synthesis.X-ray photoelectron spectroscopy was conducted to determine the elemental chemical states and structural composition in Fe-N-Ti 60SBA composite and was shown in Fig. 8. Fig. 8a shows the overall scan spectrum of Fe-N-Ti60SBA sample which contains six elemental signals C, Fe, N, Ti, O and Si.As shown in Fig. 8b, in the Fe 2p spectra of Fe-N-Ti60SBA composite, two peaks located at binding energies ca.710.1 and 725.3 (eV) belong to the 2p 3/2 and 2p 1/2 of Fe 3 , respectively.Three signals at binding energies ca.397.0, 398.4 and 400.6 (eV) were observed in the N 1s spectra (Fig. 8c).The peaks at binding energies 400.6 and 398.4 (eV) belong to the nitrogen containing compounds such as NH 3 and NO x which adsorbed on the sample surface.The signal at binding energy 397.0 eV was ascribed to substitutional nitrogen in the TiO 2 lattice.Fig. 8d shows two signals at binding energies ca.458.1 (eV) and 464.3 (eV), which assigned to the Ti 4 2p 3/2 and Ti 4 2p 1/2 of TiO 2 , respectively, while two signals at The CO 2 adsorption capacity is an important factor in the performance of photoreduction process.Hence, the adsorption capacity of CO 2 was evaluated for Fe-N-TixSBA samples.As shown in Fig. 9, CO 2 adsorption capacity of composites was increased compared to Fe-N-TiO 2 .The increase in CO 2 adsorption capacity can be beneficial for improved fuel production.The CO 2 adsorption capacity of composites was obtained from 0.16 mmol g -1 to 0.29 mmol g -1 at 25 C and 1 bar and increased almost linearly with SBA content (Table 2).It is believed that the improvement of CO 2 adsorption ability of the Fe-N-TixSBA composites compared to that of Fe-N-TiO 2 may enhance the performance of process. A series of blank experiments were first carried out under the following conditions to ensure that methane and methanol were produced from CO 2 photoreduction reaction: (1) without light irradiation, catalysts were coated on inner surface of reactor with CO The effect of SBA on photocatalytic performance was investigated over Fe-N-TixSBA samples under 70 W visible light irradiation with a fixed total flow rate of 13 ml/min.The Fe and N concentration were fixed at 0.12 wt. and 0.5 wt., respectively, whereas, the weight percent of SBA varied from 40 to 70 wt..methane and methanol production over synthesized composites were shown in Fig. 10 at constant partial pressure of CO 2 and H 2 O (0.758 and 0.155 bar, respectively).No product was detected for pure SBA.However, combination of Fe-N-TiO 2 with SBA resulted in an enhancement in the production efficiency compared to the Fe-N-TiO 2 sample.Among the Fe-N-TixSBA composite samples, the sample with 60 wt.,Fe-N-Ti 60SBA, showed the highest fuel production with 37.37 mol g -1 cat.h -1 of methane and 1.23 mol g -1 cat.h -1 of methanol.As shown in Fig. 10, a further increase in the SBA weight percent has been led to a decrease in the performance of process, which may be due to a shading effect by the excessive content of SBA. A physical mixture of FeTiO 2 particles and SBA with 60 wt. of SBA was prepared to compare with synthesized Fe-N-Ti60SBA sample.As shown in Fig. 11, the product rate over Fe-N-TixSBA sample was higher than the physically mixed sample.This result can be attributed to a strong interaction which formed between TiO 2 and SBA components in the synthesis of Fe-N-TixSBA composites.The formed interaction makes electrons easily transferred from TiO 2 to SBA and so the recombination of electrons-holes can be suppressed.Hence, photocatalytic activity was improved over Fe-N-Ti60SBA sample compared to physical mixture.Moreover, the rate of methane over the best composite, i.e.Fe-N-Ti60SBA, was 1.33 times higher than Fe-N-TiO 2 under visible light (Fig. 11). The stability tests were conducted over Fe-N-Ti60SBA composite and the results were shown in Fig. 12.After four cycling runs, there was no obvious change of the rate of products over Fe-N-Ti60SBA composite.Furthermore, this is confirmed by comparing the XRD patterns of fresh and used sample after four runs (Fig. 13).The XRD pattern shows that the structure of sample was not changed in the used composite compared to the fresh sample.Therefore, it verifies that the composite is stable and can be reused for several cycles. The results show that production rate of methane and methanol over Fe-N-TiO 2 sample can be increased by coupling with mesoporous SBA.This superior performance over composites is believed to be mainly ascribed to the higher specific surface area and higher CO 2 adsorption capacity, as demonstrated by the BET and CO 2 adsorption analysis.Moreover, doping of Fe and N atoms into the structure of TiO 2 , leading to the creation of Ti 3 and oxygen vacancies in the TiO 2 .The Fe-N-TiO 2 0.06 Fe-N-Ti40SBA 0.20 Fe-N-Ti60SBA 0.26 Fe-N-Ti70SBA 0.29 SBA 0.33 oxygen vacancies created new adsorption sites on the surface of TiO 2 to adsorb CO 2 .The Ti 3 ions created a new level of energy between the valence band (VB) and the conduction band (CB) of photocatalyst, which improved the generated electrons-holes separation performance and improved the visible light absorption.The Fe metal distributed on the photocatalyst surface can also act as an electron sink to reduce the electrons-holes recombination process.Consequently, the synthesized Fe-N-TixSBA composites produced a large number of electron-hole pairs, even under visible irradiation.Furthermore, SBA as the support may inhibit the grain growth of Fe-N-TiO 2 nanoparticles as verified by XRD analysis.Also, the formed heterojunction between TiO 2 and SBA can suppress the electrons-holes recombination and so increase the photocatalytic activity.Although, the blue shift of adsorption spectra for composites, due to the presence of SBA component (DRS analysis, Fig. 4), may have the negative effect on the photocatalytic activity under visible light irradiation. The CO 2 and H 2 O partial pressures are two crucial parameters which can affect the CO 2 photoreduction efficiency.Hence, the effect of these parameters was investigated on the rate of production to obtain the optimum conditions for fuel production. The experiments were conducted over Fe-N-Ti60SBA sample with flow rate of 13 ml/min and the results were shown in Fig. 14.At constant P H2O 0.155 bar, the rate of production increased with increasing P CO2 until it attains an optimum rate at P CO2 0.758 bar (Fig. 14a).However, the rate of methane and methanol was decreased after optimum partial pressure of CO 2 .Similarly, the rate of production increased with increasing P H2O , at fixed P CO2 0.758 bar, until it attains an optimum rate at P H2O 0.096 bar (Fig. 14b).whereas, an excessive amount of H 2 O occupied active sites of catalyst and decreased the efficiency of process. Therefore, the maximum methane and methanol rates of 38.72 mol g -1 cat.h -1 and 1.73 mol g -1 cat.h -1 , respectively, were obtained over Fe-N-Ti60SBA composite at optimum partial pressure of P CO2 0.758 bar and P H2O 0.096 bar. In the case of nonhomogeneous surface with different reactivity sites, the theory of Sips can be used to predict kinetic of adsorption 10,50.In pervious study, we developed a kinetic model based on Sips theory for CO 2 photoreduction process over nonhomogeneous surface, which described as follows in Eq. (1) to Eq. (3) 10: (1) where k CH4 is the methane rate coefficient, I is the intensity of light source fixed at 85 mW/cm 2 , presents the reaction order of light intensity, n is heterogeneity factor and b CO2 and b H2O are affinity coefficient of CO 2 and H 2 O, respectively.The constants of the kinetic model were obtained for Fe-N-Ti 60SBA sample by correlating it with the experimental data of P CO2 , P H2O , I (fixed at 85 mW/cm 2 ) and the rate of methane given from Section 3.3.2.The constants of the model were estimated using MA-TLAB software, version 9.0, and presented in Table 3. In the current work, the affinity coefficient of CO 2 (b CO2 ) over Fe-N-Ti60SBA composite was found to be 142.47 bar -1 , that is higher than b CO2 , 22.74 bar -1 , for Fe-N-TiO 2 sample obtained from previous study 10.This result is consistent with the results of CO 2 adsorption experiments in section 3.2, which showed higher CO 2 adsorption ability over Fe-N-Ti60SBA than the Fe-N-TiO 2 sample. Eq. ( 4) exhibited the predicted methane rate over Fe-N-Ti60SBA sample by incorporating the obtained constants of kinetic model into Eq.(3).(4) Fig. 15 shows the comparison between rates of CH 4 obtained from Eq. ( 4) and experimental data from 3.3.2.The predicted results are consistent with experimental data and fitted well with an R-squared value of 0.9881.Additionally, the proposed kinetic model was validated by testing the kinetic model to another P CO2 and P H2O over Fe-N-Ti60SBA.The result was shown that rate of CH 4 by kinetic model, 30.03 mol g -1 cat.h -1 , well agreed with the experimental rate of CH 4 , 30.84 mol g -1 cat.h -1 , at P CO2 0.4 bar and P H2O 0.21 bar. The constants of kinetic model over Fe-N-Ti60SBA sample at light intensity of 85 mW/cm 2 . Parameter Predicted value k (mol g -1 cat.h -1 ) 7.46 b CO2 (bar) -1 142.47 b H2O (bar) -1 1584.0 0.69 n 1.81"
  },
  {
    "title": "Conclusions",
    "content": "The new Fe-N-TixSBA composites were prepared via an in-situ sol gel method to establish a strong interaction between Fe-N-TiO 2 nanoparticles and mesoporous SBA component.The results showed that CO 2 photoreduction to fuels was enhanced over composites compared to Fe-N-TiO 2 sample.Particularly the methane production over Fe-N-Ti 60SBA was increased by up to 1.4 times compared to Fe-N-TiO 2 samples under visible irradiation.This superior performance can be mainly ascribed to the higher specific surface area and higher CO 2 adsorption capacity, formation of heterojunction and suppressing of electronsholes recombination.Moreover, the maximum methane and methanol rates of 38.72 mol g -1 cat.h -1 and 1.73 mol g -1 cat.h -1 , respectively, were found over best sample (Fe-N-Ti60SBA) at optimum partial pressure of P CO2 0.758 bar and P H2O 0.096 bar.The obtained data was then fitted into the new kinetic model based on Sips theory to predict kinetic parameters.The obtained affinity coefficient of CO 2 for Fe-N-Ti 60SBA sample, 142.47 bar -1 , was much more than that of Fe-N-TiO 2 , 22.74 bar -1 , indicating the more power in CO 2 adsorption over composites than that of Fe-N-TiO 2 sample. Fig. 1.Schematic diagram of CO 2 photoreduction set-up. Fig. 2. (a) Low-angle and (b) wide-angle XRD patterns of different Fe-N-Ti xSBA composites. Fig. 3. N 2 adsorption-desorption isotherms (a) and BJH pore size distribution (b) of different Fe-N-TixSBA composites. Fig. 4. UV-vis adsorption spectra of the synthesized Fe-N-TixSBA samples. Fig. 5. Tauc plot of different Fe-N-TixSBA samples to estimate band gap values. Fig. 6.FESEM images of the Fe-N-Ti60SBA composite at lower (a) and higher (b) magnifications. Fig. 7. EDX analysis of Fe-N-Ti60SBA sample with Fe, N, Ti, O and Si elemental mapping. 2 and H 2 O, (2) under light irradiation, photocatalysts were coated on inner surface of reactor with N 2 and H 2 O (in the absence of CO 2 ), and (3) without Fig. 8. XPS spectra of Fe-N-Ti60SBA sample; (a) full spectra (b) Fe 2p, (c) N 1s, (d) Ti 2p and (e) O 1s. Fig. 9. CO 2 adsorption capacity of different Fe-N-TixSBA synthesized samples measured at 25 C. capacity (at 25 C and 1 bar) of Fe-N-TixSBA composites.Sample CO 2 adsorption capacity (mmol g -1 ) Fig. 10.Product rate over Fe-N-TixSBA composite under 70 W visible light irradiation (flow rate 13 ml/min, P CO2 0.758 bar and P H2O 0.155 bar). Fig. 11.Comparison between Fe-N-TiO 2 , Fe-N-Ti60SBA and mechanical mixture of Fe-N-TiO 2 and SBA. Fig. 12. Stability test over Fe-N-Ti60SBA composite in four cycling runs. Fig. 13.XRD analysis of the fresh and used Fe-N-Ti60SBA sample. Fig. 14.Rate of production over Fe-N-Ti60SBA sample at (a) various partial pressure of CO 2 (total flow rate 13 ml/min, P H2O 0.155 bar) and (b) various partial pressure of H 2 O (total flow rate 13 ml/min, P CO2 0.758 bar). Fig. 15.Comparison between rate of CH 4 obtained from model and experimental data over Fe-N-Ti60SBA. Average TiO 2 crystallite size, surface area and elemental composition of the composites. Journal of CO2Utilization 33 (2019) 21222324252627282930"
  }
]