[
  {
    "title": "Doi",
    "content": "10.1016/j.cej.2020.126654"
  },
  {
    "title": "Article_Title",
    "content": "Substrate-dependent ALD of Cux on TiO2 and its performance in photocatalytic CO2 reduction"
  },
  {
    "title": "Abstract",
    "content": "were fabri- cated via ALD (atomic layer deposition) technique. TiO 2 Cu showed superior photo- catalytic CO 2 reduction performance than H-TiO 2 Cu. XPS results indicate more Cu 0/ exists on TiO 2 Cu than on H-TiO 2 Cu. Reversed catalytic performance is ori- ginated from different ratio of Cu 0/ /Cu 2 deposited during ALD deposition. Valance state of Cu might play more significant role in CO 2 reduction than defect such as Ti 3 or V o in TiO 2 Cu."
  },
  {
    "title": "Experimental",
    "content": "TiO 2 (Anatase, 99.8, 40 nm) and NaBH 4 (98) were purchased from Aladdin.Ethanol was purchased from FuYu Chemical.Cu(hfac) 2 (Copper (II) hexafluoro-acetyl-acetonate) was purchased from Jiaxing Kemin Electronic Equipment Technology Co., Ltd.All Chemicals were used without any purification. The H-TiO 2 was synthesized according to the literature reported by Tan's group 28.In a typical synthesis procedure, 2.0 g TiO 2 (Anatase) was mixed with 0.75 g NaBH 4 followed by 30 mins grind in order to realize thorough mixing.The mixture was then put inside a porcelain boat without any cover, then the boat was placed inside a tubular furnace and being heated from room temperature to 350 C at a heating rate of 5 C min -1 in Ar atmosphere.The sample was maintained at 350 C for 1 h and then got naturally cooled down to room temperature.In order to remove excessive NaBH 4 , deionized water (Milli-Q 18.2 Mcm at 25 C) and ethanol were used to dissolve unreacted NaBH 4 .Final product was collected after drying the sample at 70 C in vacuum for 12 h.As-prepared sample was denoted as H-TiO 2 .Fig. S1 shows the synthetic procedures for H-TiO 2 . 2.3.Synthesis of TiO 2 50 Cu and H-TiO 2 50 Cu ALD (atomic layer deposition) of copper was referred from Claudia's group 26,27.For materials used in deposition, Cu(hfac) 2 and deionized water were used as Cu precursor and reducing agent, respectively.Firstly, 100 mg TiO 2 and H-TiO 2 were spread uniformly in a homemade ALD powder container covered by 400 mesh stainless steel net to prevent the powder from being blowing away during ALD deposition.ALD parameters for Cu deposition were as followed: substrate temperature was set to 280 C, source temperature was set to 150 C, purge flux was maintained at 30 sccm and 10 sccm for Cu source and H 2 O, respectively.In a typical four-step ALD cycle, 5 s Cu pulse and 1 s water pulse were separated by 50 s Ar purge to ensure both enough Cu source exposure and clean-up.50 cycles were employed to deposit Cu on TiO 2 and H-TiO 2 .Samples collected after ALD were denoted as TiO 2 50 Cu and H-TiO 2 50 Cu, respectively.10 cycles and 25 cycles were also employed to synthesize TiO 2 Cu and H-TiO 2 Cu.Fig. S1 shows the synthetic procedures for TiO 2 Cu and H-TiO 2 Cu. X-ray powder diffraction (XRD) was performed by a Bruker AXS D8 with Cu K radiation ( 1.5406A).Element mapping of the samples was analyzed using scanning electron microscope (SEM, Hitachi S-4800).Transmission electron microscope (TEM, JEOL-2100) was used to investigate morphology.X-ray photoelectron spectroscopy (XPS) was performed by a Thermo Fisher Scientific (Esclab 250) spectrometer and the results were corrected by C 1 s peak at 284.8 eV.UV-vis absorption spectra were carried out on a Shimadzu UV 2600 UV spectrophotometer possessing integrating sphere.Inductively coupled plasma mass spectrometer (ICP-MS) was performed by Agilent 7800. The process of photocatalytic CO 2 reduction was as followed: The sample (10 mg) was spread into a round cap with diameter equal to about 3 cm, then transferred the cap into a home-made cylindrical reactor (volume 45 ml) for photocatalytic evaluation, injected 1 ml deionized water outside the perimeter of cap and then perfectly sealed the reactor with a flat quartz glass on the top.High-purity CO 2 with a flow rate of 30 ml min -1 was continuously fed into the reactor for 15 min and kept the reactor sealed in the dark for 30 min before placing the reactor underneath a 300 W Xe arc lamp (CEL-HXF300, Beijing China Education Au-light Co., Ltd) without any filter.The distance between light source and the sample was about 10 cm.The temperature of the entire system was controlled at 20 C by water-cooling system.0.2 ml gas was extracted hourly by a syringe and then analyzed by GC-7920 gas chromatograph (FID detector, YQ1229 column). In our experiments, different reduction products were detected including CO and CH 4 .Even though H 2 reduced from water is regarded as competing reaction product versus CO 2 reduction, negligible amount of H 2 could be detected by chromatograph in comparsion with CO and CH 4 .Thus, the simplfied equation for selectivity calculation only includes two electrons and eight electrons transfer processes in which n is number of moles for CO or CH 4 29. CO Selectivity () 2n(CO)/2n(CO) 8n(CH 4 ) 100 CH 4 Selectivity () 8n(CH 4 )/2n(CO) 8n(CH 4 ) 100 In order to rule out the possibility that the carbon products were originated from extraneous contamination in our catalyst instead of reducing from CO 2 , we performed control experiment in which Ar was used to replace CO 2 .Negligible amount of CO or CH 4 were detected in Ar ambience Control experiments in the dark were also conducted and no products were detected as shown in Fig. 5 and Fig. S4 for TiO 2 Cu and H-TiO 2 Cu. Transient photocurrent was tested in 0.5 M Na 2 SO 4 by three-electrodes system, in which Pt foil was used as counter electrode, Ag/AgCl was used as reference electrode and sample-loaded FTO was used as working electrode.5 mg samples were firstly mixed with 25 l Nafion and then being added into 0.5 ml ethanol, 50 l aforementioned mixtures were then dip-coated onto 2 cm 2 FTO glass.0.4 V vs Ag/AgCl was employed to evaluate photocurrent responses for TiO 2 , H-TiO 2 , TiO 2 50 Cu and H-TiO 2 50 Cu under full spectrum."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The crystal structures of different TiO 2 substrate and the corresponding counterparts after ALD Cu loading were compared by XRD.As shown in Fig. 1(a), both pristine TiO 2 and H-TiO 2 show identical crystal structures, which are in good agreement with JCPDS.NO. 21-1272 profile.Diffraction peaks at 25.3 and 48.04 are designated to two main (1 0 1), (2 0 0) crystallography planes of anatase TiO 2 .There was no distinct alteration in terms of crystal structure for both TiO 2 and H-TiO 2 after ALD loading due to low concentration of Cu as well as the highlydispersed nature of ALD technique 30.The concentration of Cu was measured by ICP-MS as shown in Table S1, the weight ratios of Cu for 10 cycles ALD and 50 cycles ALD deposition are 0.24 and 0.96, respectively.This suggests that the number of ALD cycle is proportional to the weight ratio of Cu loaded on both TiO 2 and H-TiO 2 . The optical property of the sample was examined by UV-vis absorption spectra.As shown in Fig. 1(b), no distinct absorption difference is found for samples before and after ALD deposition.Both pristine TiO 2 and TiO 2 Cu exhibited limited absorption capability of absorbing light only below 380 nm, which corresponded to 3.2 eV band gap of TiO 2 .Whereas for H-TiO 2 and H-TiO 2 Cu, broader absorption range was observed due to the formation of oxygen vacancy 8,28.The nearly black H-TiO 2 was able to absorb light from ultraviolet to nearinfrared region.The extremely small loading of Cu after ALD deposition did not influence the absorption ability of the substrates.The tiny difference above 700 nm between TiO 2 and TiO 2 Cu was resulted from the absorption of Cu d-d band transition.However, the loading amount of Cu was too small and thus the difference in this range was not very obvious. TEM was employed to examine the morphology of catalysts.As revealed in Fig. 2(a) and Fig. 2(c), the morphologies of TiO 2 Cu and H-TiO 2 Cu are identical, the particle size of both samples is about 30 nm.The lattice spacing of 3.5 A in Fig. 2(b) and Fig. 2(d) corresponds to (1 0 1) plane of anatase TiO 2 in TiO 2 Cu and H-TiO 2 Cu.However, it was hardly to distinguish Cu by shape due to the high dispersity nature of ALD technique.SEM element mapping as revealed in Fig. 3(a) and 3(b) further verify the high dispersity of Cu on two different substrates, and other two elements are highly dispersed on the surface as well.The relatively sparser distribution of all three elements in H-TiO 2 is due to the shorter acquiring time during EDS analysis and the atom ratios of Cu are basically the same for two samples.FESEM images of two samples as shown in Fig. S6 (a) and (b) also indicates identical morphologies before and after NaBH 4 reduction as well as ALD deposition. The thermodynamic feasibility of photocatalytic CO 2 reduction for the case of TiO 2 Cu is illustrated in Fig. S3 where conduction band of TiO 2 (-0.5 V) is negative enough to drive reduction reaction for CO (-0.48 V) and CH 4 (-0.24V) 31.Cu is often employed as co-catalyst and accepts electrons excited from TiO 2 32.The photocatalytic CO 2 reduction performance was evaluated by using saturated CO 2 and water vapor as reactants.The performance was quantified by the incremental amount of CO and CH 4 , which were found to be the major products in our experiments.The production rate of either CO or CH 4 was calculated by averaging the products produced after the first hour since the reaction would gradually reach balance and then experience deactivation.This process is quite common for photocatalytic CO 2 reduction.As opposed to the online system which is able to keep the entire the system flow, the relatively closed system can be detrimental to the adsorption-desorption process and the intermediates formed would saturate the reaction sites which will possibly cause consequent deactivation 12,333435. The relatively wide bandgap of pristine TiO 2 significantly limits the range of solar spectrum utilized in catalytic reaction.Thus, great efforts have been made to enhance light absorbing ability, among which synthesizing black TiO 2 is proved to be an effective way for enhancing photocatalytic performance by self-doping Ti 3 and generating oxygen vacancy.In most cases, this type of defective TiO 2 is synthesized via Ar/ H 2 reduction and therefore be named as H-TiO 2 .In our study, black TiO 2 (H-TiO 2 ) was synthesized by NaBH 4 reduction and it showed superior photocatalytic CO 2 reduction performance than pristine TiO 2 .As shown in Fig. 4(a) and 4(b), the CO production rate of H-TiO 2 is about 2.5 times that of pristine TiO 2 and neither of them produce CH 4 over time in our case.This result is in good agreement with previous studies illustrating the superior photocatalytic performance of black TiO 2 36,37. In order to further enhance the CO 2 reduction performance of black TiO 2 , researchers perform a series of surface modification on TiO 2 including doping, metal deposition, constructing heterojunction, etc.Among which, the deposition of Cu has been extensively studied and shown great performance in H 2 production and CO 2 reduction.In our study, Cu was deposited on pristine TiO 2 and H-TiO 2 by taking advantaging of ALD technique.As shown in Fig. 4(a) and (b), the production rates of CO are improved from 2 mol/g/h and 8.08 mol/g/h for pristine TiO 2 and defective H-TiO 2 to 23.25 mol/g/h and 10.58 mol/g/h.CH 4 production rates are enhanced from nearly zero to 4.3 mol/g/h and 0.94 mol/g/h.Nearly 10-fold and 1.2-fold increase of performance in terms of CO production rate were observed for TiO 2 50 Cu and H-TiO 2 50 Cu, respectively.And the CH 4 production rate of TiO 2 Cu was almost five times as much as that for H-TiO 2 50 Cu.The initially superior H-TiO 2 showed inferior performance after ALD Cu deposition in comparison with pristine TiO 2 which outperformed in both CO and CH 4 production with the assistance of Cu loading.Similar results were also found in the samples with different cycles of ALD loading considering varying the ALD cycle would only change the amount of Cu deposited on the substrates, which was proved by ICP-MS results.As shown in Fig. S5, for samples experiencing 10, 25, 50 cycles ALD, the amount of CO increases with the number of ALD cycles.Photostability test is shown in Fig. S8 and samples still show good performance after 9 h of illumination with small degeneration observed probably due to the adsorbed intermediate as well as enlarged Cu particles. Even though H 2 reduced from water is regarded as competing reaction product versus CO 2 reduction, negligible amount of H 2 could be detected by chromatograph in comparsion with CO and CH 4 , which is in accordance with previous study for TiO 2 Cu 32,37.Thus, the products selectivity only includes main products CO and CH 4 .Superior activity of TiO 2 Cu is also reflected in Fig. 4(c-d) in which along with increased number of ALD cycles, CH 4 selectivity for TiO 2 Cu gradually surpasses that of H-TiO 2 Cu.Even though the reduction potential for CH 4 is lower than that of CO, much more effort needed to achieve higher CH 4 selectivity since methane is either directed formed from CO 2 with eight electron transfer process or from multi-step electron transfer process from other reduction product such as CO.Higher CH 4 selectivity with higher co-catalyst loading indicates that TiO 2 50 Cu shows better performance in CO 2 reduction kinetically.Whereas for lower co-catalyst loading with 10 cycles of ALD, even though dramatic enhancement for CO is observed, limited catalytic sites hinder the generation of CH 4 for TiO 2 10 Cu whereas the substrate H-TiO 2 in H-TiO 2 10 Cu still plays dominate role in assisting CO 2 reduction when cocatalyst Cu was loaded.In other words, originally superior H-TiO 2 showed better CH 4 selectivity after small amount of Cu loading as the result of higher CO yield from H-TiO 2 itself as well as timely CH 4 conversion on Cu co-catalyst.CH 4 is found to have higher selectivity for 25 cycles probably because the amount of Cu loaded at this level would favor the CH 4 conversion for both samples and the influence of Cu on TiO 2 Cu has gradually balanced the influence of substrate for H-TiO 2 Cu.Nevertheless, all three experiments exhibited the same tendency as mentioned above.This peculiar phenomenon of TiO 2 outperforming H-TiO 2 after ALD deposition will be discussed and justified next. From the Characterization conducted for samples before and after ALD deposition, we conclude that neither crystal structure nor absorption ability change drastically.And from TEM and SEM element mapping, the existence and dispersion mode of Cu on TiO 2 and H-TiO 2 are further confirmed with no prominent distinction. The variables of synthesis in our study mainly included different substrate and the subsequent ALD deposition process.Previous studies with respect to the influence of ALD substrate have shown that, same substrate after different cycle of ALD deposition have different conductivity which then affect the performance of electronics built on them.In addition, different substrates experiencing the same ALD deposition differ significantly in terms of optical, electrical properties.From the perspective of ALD deposition parameters, not only does the deposition temperature influence the nucleation process of materials, but it also impacts the subsequent photocatalytic property 212223.Given that the deposition parameter employed in our experiments were exactly the same for all our samples with only minor deviation resulting from machine itself and repeated trials had revealed the same results, we rule out the possibility that the deposition parameters gave rise to the results.Thus, the only speculation remained is different substrates used in our experiments.Claudia de melo and his group report that different chemical states of Cu can be obtained when ALD depositing Cu on ZnO or Al-doped ZnO substrates 26,27.Noteworthy, the chemical states of Cu influence the catalytic performance, especially for CO 2 reduction reaction 16,30.Even though it is still controversial as to the roles Cu 0 , Cu , and Cu 2 play in the reaction of CO 2 reduction, and the conversion between them during or after reaction renders more difficulties, many researches have been devoted to unravel the mystery around Cu. In order to examine whether the chemical states of Cu caused the superior performance of TiO 2 , we performed XPS spectra analysis of Ti and Cu as revealed in Fig. 6.XPS survey, C 1s and O 1s are shown in Fig. S2.Firstly, we examined the chemical state of Ti for different substrates.Fig. 6(a) indicates that both Ti 2p 1/2 and Ti 2p 3/2 peaks located at 464.6 eV and 458.7 eV of TiO 2 50 Cu shift to lower binding energy after NaBH 4 reduction.Identical shift tendency for O 1s is shown in Fig. S2.These are signs of generating Ti 3 as well as V o which is repeatedly mentioned in previous reports.The significance of Ti 3 has been proved to be a crucial factor for enhancing photocatalytic performance 8,28,37.Thus, the formation of Ti 3 in combination with the extended light absorption revealed by UV-vis spectrum is capable of explaining the enhanced photocatalytic performance of H-TiO 2 .In addition, the XPS analysis of Ti after photocatalytic CO 2 reduction reaction as shown in Fig. 6(b) indicates Ti 3 still exists in H-TiO 2 , the slightly reduced difference between two samples arises from the oxidation of H-TiO 2 which happened during CO 2 reduction. Secondly, chemical states of Cu for samples before and after reactions were analyzed.As revealed in Fig. 6(c) for samples before reaction, the peaks located at 932.2 eV are ascribed to 2p 3/2 of Cu 0 or Cu since the binding energies of Cu 0 and Cu are too close to be distinguished 30,38.Besides, the peaks at 952.4 eV are ascribed to 2p 1/ 2 of Cu 0/ .Surprisingly, the peaks belonging to Cu 2 at 934.2 eV have conspicuous difference for TiO 2 50 Cu and H-TiO 2 50 Cu.The peaks differentiated at this binding energy for H-TiO 2 50 Cu is much distinct than that in TiO 2 50 Cu, and the atomic ratio of Cu 2 is calculated to be 14.25 for H-TiO 2 50 Cu whereas only 2.38 can be found in TiO 2 50 Cu.The proportion of Cu 2 in H-TiO 2 50 Cu was greater compared with that in TiO 2 50 Cu.In other words, TiO 2 50 possessed more Cu 0/ than H-TiO 2 50 Cu after ALD deposition conducted under the same condition.Similarly, as shown in Fig. 6(d), the XPS analysis after reaction also shows the results of exceeding amount of Cu 2 in H-TiO 2 50 Cu with only negligible increase for both samples, which was probably caused by the oxidation of Cu when exposed to the air.The atomic ratio of Cu 2 for TiO 2 50 Cu and H-TiO 2 50 Cu after reaction are 3.44 and 14.67, respectively.These findings are consistent with previous study in which low valance state of Cu is formed via ALD when Zn 2 is replaced by Al 3 in the ZnO substrates 26,27, in our case, high valance state of Cu was favorably generated when Ti 4 was replaced by Ti 3 in the TiO 2 substrates. As XPS is merely capable of detecting the chemical states of materials located on the nanoscale surface and the states of surface is especially paramount for photocatalytic performance since both adsorption-desorption process and chemical reaction occur on the surface.In addition, ALD technique has shown potential in depositing Cu with different chemical states and the role Cu plays in photocatalytic CO 2 reduction has been proved important.Even though some researches have demonstrated that Cu 0 /Cu is the main active species for performance, other researches show that only Cu is responsible for enhanced photocatalytic performance whereas some researches highlight the significance of Cu 2 or metallic Cu 30,38394041. From the control experiments for 10, 25, 50 cycles of ALD deposition, the selectivity of CH 4 for TiO 2 Cu had lower selectivity than H-TiO 2 Cu for 10 cycles and gradually balanced the selectivity at 50 cycles and then surpassed the selectivity of H-TiO 2 Cu at 50 cycles, indicating that along with increased number of ALD deposition, TiO 2 Cu gradually showed superior performance in CH 4 conversion.This observation in CH 4 selectivity suggests that the photocatalytic CO 2 reduction performance is slowly predominated by different valence state of Cu deposited on the surface of different TiO 2 substrates rather than different substrates themselves, which differs in the ratio of Ti 3 .In the light of our findings in experiments and XPS analysis, we conclude that the existence of more Cu 0/ on pristine TiO 2 Cu might play an important role for achieving superior activity than H-TiO 2 Cu and it overweighs the influence of Ti 3 and V o .Even though H-TiO 2 showed superior performance for photocatalytic CO 2 reduction than TiO 2 , pristine TiO 2 loaded with more Cu 0/ after ALD deposition surpassed the performance of H-TiO 2 Cu which possessed less amount of Cu 0/ .Previous studies have shown that Cu 0/ mixture facilitates charge separation as well as assists electrons and holes trapping 31,32,42.Transient photocurrent response as shown in Fig. S7 indicates that the photocurrent response of TiO 2 Cu is stronger in comparison with H-TiO 2 Cu, indicating more efficient charge separation for TiO 2 Cu.In our study, solid experiment results prove that Cu 0/ is a more crucial factor for CO 2 reduction in compassion with defect in the case of TiO 2 Cu.This substrate-originated photocatalytic activity difference is originated from different ratio of Cu 0/ /Cu 2 deposited during ALD process as shown in Fig. 7."
  },
  {
    "title": "Conclusions",
    "content": "In this work, Cu was deposited on TiO 2 and H-TiO 2 using ALD technique.The resulting composite showed great enhancement in photocatalytic performance for CO 2 reduction.Originally, H-TiO 2 with enhanced light absorption and generated Ti 3 showed superior performance than pristine TiO 2 .However, the performance of TiO 2 Cu exceeded the performance of H-TiO 2 Cu after ALD deposition.XPS results indicate that the existence of more Cu 0/ on pristine TiO 2 might play an important role for achieving superior activity than H-TiO 2 .These results indicate that not only will ALD technique significantly enhance the CO 2 reduction performance after Cu deposition, but the substrate employed for loading and the chemical state of loaded material will also influence the subsequent catalytic performance.In addition, our result provides additional experiment evidence for justifying the significance of Cu 0/ in photocatalytic CO 2 reduction reaction.Furthermore, our findings provide insight to ALD-prepared catalyst and highlight the importance of substrate in the process of deposition.Thus, more researches with respect to different substrate possessing different physical or chemical properties can also be conducted using ALD so as to determine the effect of substrate-dependent ALD deposition on subsequent catalytic performance 43444546. Fig. 1.(a) XRD pattern of TiO 2 , H-TiO 2 , TiO 2 50 Cu and H-TiO 2 50 Cu.(b) UV-vis spectra of TiO 2 , H-TiO 2 , TiO 2 50 Cu and H-TiO 2 50 Cu. Fig. 2. TEM image of (a-b) TiO 2 50 Cu; (c-d) H-TiO 2 50 Cu. Fig. 3. SEM element mapping of (a) TiO 2 50 Cu and (b) H-TiO 2 50 Cu. Fig. 4. Photocatalytic CO 2 reduction reaction with water vapor (a-b) COCH 4 produced for TiO 2 , H-TiO 2 , TiO 2 50 Cu, H-TiO 2 50 Cu. (c-d) Selectivity of CO, CH 4 for TiO 2 Cu and H-TiO 2 Cu with 10, 25, 50 ALD cycles. Fig. 5. Photocatalytic CO 2 reduction in saturated CO 2 , Ar and in dark for TiO 2 and TiO 2 50 Cu. Fig. 7. Mechanism illustration for photocatalytic performance before and after ALD deposition. Acknowledgement This work was financially supported by the National Natural Science Foundation of China (No. 21802087, 21333006, 51602179, and 21573135), Natural Science Foundation of Shandong Province (ZR2019QB005), Recruitment Program for Young Professionals, China, Qilu Young Scholars and Outstanding Young Scholars Projects of Shandong University, Taishan Scholar Foundation of Shandong Province. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https:// doi.org/10.1016/j.cej.2020.126654."
  }
]