[
  {
    "title": "Doi",
    "content": "10.1016/j.apsusc.2015.08.059"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic reduction of CO 2 into methanol and ethanol over conducting polymers modified Bi 2 WO 6 microspheres under visible light"
  },
  {
    "title": "Abstract",
    "content": "Bi 2 WO 6 hierarchical hollow microspheres (HHMS) modified with different conducting polymers (polyaniline, polypyrrole, and polythiophene) were successfully synthesized by 'in situ' deposition oxidative polymerization method, and evaluated as photocatalysts for the photocatalytic reduction of CO 2 with H 2 O to methanol and ethanol.It was found that the introduction of conducting polymers obviously decreased the recombination of photogenerated electron-hole pairs, thus promoting the photocatalytic activity of Bi 2 WO 6 .Among the as-fabricated photocatalysts, polythiophene modified Bi 2 WO 6 (PTh/Bi 2 WO 6 ) exhibited the best photoelectronic and photocatalytic performance, due to the narrow band gap and good charge mobility of polythiophene.The results demonstrate that the methanol and ethanol yield over PTh/Bi 2 WO 6 was 56.5 and 20.5 mol g cat -1 in 4 h, respectively.The total yield of hydrocarbons is 2.8 times higher than that over pure Bi 2 WO 6 .It is noted that the catalyst exhibits good recyclability and stability.After five consecutive runs, the PTh/Bi 2 WO 6 catalyst shows no significant loss of photocatalytic activity.The possible photocatalytic mechanism was proposed which is beneficial for further improving the activity of photocatalysts.The approach described in this study provides a simple and reliable strategy for the rational design of efficient visible light-driven photocatalysts for photoreduction of CO 2 to hydrocarbons."
  },
  {
    "title": "Experimental",
    "content": "All reagents are analytical grade and used as received, without further purification. Bi(NO 3 ) 3 5H 2 O (0.68 g) and polyvinylpyrrolidone (PVP, 0.20 g) were added slowly into an ethylene glycol solution containing stoichiometric amounts of KBr with a Bi/Br molar ratio of 1.0.The mixture was ultrasonically treated and magnetically stirred, then transferred into a 50 mL Teflon-lined stainless steel autoclave.The autoclave was sealed and maintained at 120 C for 12 h.After reaction, the resulting solid product was collected by filtration, and washed with deionized water and ethanol for 3 times respectively.The obtained BiOBr product was then dried at 60 C for 6 h. The Bi 2 WO 6 HHMS was prepared by a sacrificed template method.The as-prepared BiOBr (1.20 g) was suspended in the Na 2 WO 4 solution (16 mmol L -1 , 160 mL) under stirring.Then the mixture was stirred for 30 min and then transferred to Teflon-lined stainless autoclave, which were maintained at 160 C for 36 h.The product was filtered, washed with deionized water and ethanol for 3 times respectively, and dried at 80 C for 6 h to obtain the Bi 2 WO 6 HHMS. The conducting polymers modified Bi 2 WO 6 composites were prepared by an in situ chemically oxidative polymerization method.A typical synthetic procedure is as follows: 1.0 g as-prepared Bi 2 WO 6 HHMS was suspended in 50 mL of ethanol and stirred for 30 min at 0 C in the ice-water bath.Then designated amount of monomer (aniline, pyrrole, or thiophene) was added into the suspension at 0 C under stirring.After continuous stirring for 30 min, HCl aqueous solution (2.0 mL, pH 2) containing 0.135 g ferric chloride was added dropwise into the above mixture.The resulting mixture was stirred at 0 C for 6 h.Afterward, the reaction mixture was filtered, and the precipitate was washed several times with deionized water and ethanol, respectively.Finally, the obtained product (denoted as PPy/Bi 2 WO 6 , PANI/Bi 2 WO 6 , and PTh/Bi 2 WO 6 , respectively) was dried at 80 C for 12 h.The nominal weight ratio of polymer monomer to Bi 2 WO 6 is 1:100. The X-ray powder diffraction (XRD) of the samples was recorded on a Bruker AXS-D8 Advance X-ray diffractometer with Cu K radiation in the 2A range of 10-70 .Scanning electron microscopy (SEM) observations were carried out over a Nova NanoSEM 450 microscope.Energy dispersive X-ray spectroscopy (EDS) was performed using the INCA 250 accessory of Nova NanoSEM 450.Transmission electron microscopy (TEM) observations were performed on a JEOL JEM-2100 TEM.The FT-IR spectra were recorded using a Bruker vertex 70 FT-IR spectrophotometer.The UV-vis diffuse reflectance spectra (DRS) were performed at room temperature on a Hitachi U-3900H instrument with a collection speed of 300 nm min -1 using BaSO 4 as the reference.The photoluminescence (PL) spectra were measured at room temperature using a Hitachi F4500 fluorescence spectrophotometer. Electrochemical measurements were measured using an electrochemical analyzer (CHI 660D Instruments) in a standard three-electrode system with the prepared samples as the working electrodes with an active area of catalyst 1.0 cm 2 , graphite as the counter electrode, and SCE (saturated calomel electrode) as a reference electrode.The Mott-Schottky measurement was performed at fixed frequency of 1000 Hz with 5 mV amplitude.As for photocurrents measurements, a 300 W Xe lamp equipped with an ultraviolet cut off filter to provide visible-light with 420 nm served as the visible light source.A 0.5 M Na 2 SO 4 aqueous solution was used as the electrolyte. In a typical procedure for the photocatalytic conversion of CO 2 , photocatalyst powder (50 mg) was suspended in 50 mL deionized water under magnetic stirring, and high purity CO 2 gas (99.995) was continuously bubbled through the solution at the rate of 50 mL min -1 .A 300 W Xe arc lamp (PLS-SXE300) equipped with an ultraviolet cutoff filter to provide visible light ( 420 nm) was used as the light source.The photocatalytic CO 2 reduction experiments were conducted in a closed vessel at 4 C, and the suspensions were irradiated through a quartz window.Prior to irradiation, CO 2 gas was bubbled to solution for 30 min to eliminate the dissolved oxygen in the reaction system.After turning on the lamp, 2 mL of suspensions were sampled at certain time intervals and centrifuged to remove the photocatalyst particles.The solution products were qualitatively analyzed by Agilent Technologies 7890A gas chromatograph (FID detector, DB-WAX column) through observing and comparing the chromatographic peaks with those for the authentic methanol standard and ethanol standard.The apparent quantum efficiency (AQE) is also measured under the same photocatalytic reaction conditions.The incident light intensity of Xe arc lamp (PLS-SXE300) is measured using a Radiometer (FZ-A, Photoelectric Instrument Factory of Beijing Normal University) and the number of reacted electrons can be calculated as methanol and ethanol molecules multiplied by the corresponding reductive electronic numbers, respectively.The AQE is calculated according to the following equation:"
  },
  {
    "title": "Results_and_Discussion",
    "content": "The phase structures of the pure Bi 2 WO 6 HHMS and conducting polymers modified Bi 2 WO 6 composites (CP/Bi 2 WO 6 ) were recorded by XRD patterns.As shown in Fig. 1a-d, it was observed that the as-prepared photocatalysts were all well crystallized.All the peaks of both pure Bi 2 WO 6 (Fig. 1a) and CP/Bi 2 WO 6 (Fig. 1b-d) can be indexed to the orthorhombic phase of Bi 2 WO 6 (PDF 39-0256) and no other crystalline phase can be detected.Compared with pure Bi 2 WO 6 , CP/Bi 2 WO 6 composites do not show any change in peak positions and shapes, which indicates that the introduction of conducting polymers does not change the crystalline structure of neat Bi 2 WO 6 .In addition, no diffraction peaks assigned to any conducting polymer (PPy, PANI, and PTh) was observed, which may be attributed to the small amount and thin layer of the conducting polymers 36.The average crystallite sizes of Bi 2 WO 6 were calculated by applying the Debye-Scherrer formula: D Scherrer K / cos A, where D Scherrer is the average crystallite size, is the wave-length of X-ray ( 0.154056 nm), K is the Scherrer constant (K 0.89), is the full width at half-maximum, and A is the diffraction angle.From the XRD results, the average crystallite sizes of Bi 2 WO 6 is found to be 47.6 nm, which is consistent with the SEM results mentioned below. The morphology and microstructure of the as-prepared BiOBr, Bi 2 WO 6 , and PTh/Bi 2 WO 6 were revealed by the SEM and TEM images.As presented in SEM images, flower-like BiOBr hierarchical microspheres with sizes of about 2 m are regular and well-dispersed (Fig. 2a).The corresponding high-magnification SEM image (Fig. 2b) indicates that BiOBr are composed of numerous interlaced nanosheets with the thickness about several tens nanometers (Fig. 2b).Bi 2 WO 6 were obtained through a facile anion exchange reaction by using BiOBr as the sacrificial template.From Fig. 2c andd, it can be seen that Bi 2 WO 6 shows hollow microsphere morphology with sizes of about 1-2 m, which are loosely assembled by quadrate nanosheets with size of about 40-50 nm.After modifying with PTh, morphology and mean sizes of the obtained PTh/Bi 2 WO 6 (Fig. 2e,f) are similar to those of neat Bi 2 WO 6 , which indicates that modification of PTh does not obviously affect the morphology and particle size of Bi 2 WO 6 .It is found that the mean grain sizes of Bi 2 WO 6 and PTh/Bi 2 WO 6 are in accord with the results of XRD analysis.Moreover, the EDS spectra of PTh/Bi 2 WO 6 (Fig. 2g) shows the presence of sulfur and carbon elements, suggesting the successful modification of Bi 2 WO 6 with PTh. To further disclose the microstructure, PTh/Bi 2 WO 6 was observed by TEM images.In agreement with the SEM results, TEM images further testify that the PTh/Bi 2 WO 6 are composed of quadrate nanosheets.The TEM image shows that a PTh layer adsorbed evenly and stably on the Bi 2 WO 6 surface, forming the PTh/Bi 2 WO 6 composite (Fig. 3).Furthermore, the crystal lattice line of the plate matrix can be clearly found in the high-magnification TEM image (inset in Fig. 3).The observed lattice fringe spacing of 0.192 and 0.315 nm correspond to the (2 6 0) and (1 3 1) crystallographic plane of Bi 2 WO 6 crystal.The result demonstrates that the PTh modification does not affect the Bi 2 WO 6 crystalline structure, which is consistent with the XRD analysis. In order to further confirm the existence of conducting polymers on the Bi 2 WO 6 surface, pure Bi 2 WO 6 HHMS, and CP/Bi 2 WO 6 composites were characterized by FT-IR analysis (Fig. 4a-d).Compared to Bi 2 WO 6 (Fig. 4a), the as-prepared CP/Bi 2 WO 6 composites exhibit characteristic bands of their corresponding molecular structures (Fig. 4b andc).As shown in Fig. 4b, PPy/Bi 2 WO 6 exhibits the characteristic bands of PPy 36,38: symmetric and asymmetric ring-stretching vibrations at 1551 and 1465 cm -1 , respectively, C H in-plane deformation vibrations at 1310, 1178 and 1047 cm -1 , out-of-plane ring deformation of C H at 920 cm -1 .Fig. 4c depicts the characteristic PANI bands of PANI/Bi 2 WO 6 , including bending vibration for benzenoid (B) rings occur at 1122 and 822 cm -1 , C C and C N stretching vibration for benzenoid unit at 1490 and 1290 cm -1 , respectively 39.With PTh/Bi 2 WO 6 (Fig. 4d), the characteristic PTh bands of C C stretching vibration for thiophene ring at 1633 cm -1 , as well as C H plane bending vibration at 1193, 1109 and 1021 cm -1 can be detected 40,41.The results indicate that there is successful modification of Bi 2 WO 6 by the conducting polymers.Furthermore, the main characteristic peaks of Bi 2 WO 6 (Fig. 4a) are in accordance with the reported results 42. The optical absorption properties of pure Bi 2 WO 6 HHMS, and CP/Bi 2 WO 6 composites were measured by UV-vis diffuse reflectance spectra analysis.As shown in Fig. 5, pure Bi 2 WO 6 presents photoabsorption property from the UV light region to visible light absorption shorter than 450 nm, which is consistent with other reports 43.Compared with pure Bi 2 WO 6 , the obtained CP/Bi 2 WO 6 composites exhibit enhanced photoabsorption in the whole visible light region (400-800 nm).This can be attributed to - (HOMO-LUMO) transition of the polymer backbones 38.Furthermore, it can be seen that the light absorption ability of CP/Bi 2 WO 6 composites is in the order of PPy/Bi 2 WO 6 PANI/Bi 2 WO 6 PTh/Bi 2 WO 6 .The narrow band gap and large absorption coefficient of PTh may be responsible for the strong light absorption ability of PTh/Bi 2 WO 6 composite. According to the equation of h A(h -E g ) 1/2 27,36, where , h, , A, and E g are the absorption coefficient, Planck's constant, the incident light frequency, a constant, and the band gap, respectively, the band gaps of Bi 2 WO 6 and CP/Bi 2 WO 6 composites can be estimated from the intercept of the tangents to the plots shown in Fig. 6.The band gaps of pure Bi 2 WO 6 , PPy/Bi 2 WO 6 , PANI/Bi 2 WO 6 , and PTh/Bi 2 WO 6 composites are estimated to be 2.84 eV and 2.71 eV, 2.60 eV, 2.50 eV, respectively.It can be seen that the estimated band gaps of CP/Bi 2 WO 6 composites are smaller than that of the pure Bi 2 WO 6 , which may be result from the interfacial combination and matched band edges between the two semiconductors of Bi 2 WO 6 and conducting polymers.The decreased band gaps of CP/Bi 2 WO 6 composites mean that more visible light with low energy can stimulate the photocatalysts to generate electron-hole pairs.Therefore, a better photocatalytic performance of the composites can be expected under visible light irradiation. It is well known that a lower electron-hole recombination rate is a main factor for a semiconductor to be an efficient photocatalyst.The PL spectrum, owing to recombination of free carriers, is useful to investigate the efficiency of charge carrier trapping, migration, conversion, and separation of the photogenerated electron-hole pairs in semiconductors 30.PL spectra of pure Bi 2 WO 6 HHMS and as-prepared CP/Bi 2 WO 6 composites were recorded and shown in Fig. 7. Compared to the pure Bi 2 WO 6 , those composites show similar shapes and peaks positions, but weak emission intensity.This change indicates that the modification of Bi 2 WO 6 with conducting polymers could promote the electron transfer and prevent the recombination of photogenerated electrons and holes, thus resulting in the decrease of PL intensity.Furthermore, the PL intensity order of the as-prepared photocatalysts is PTh/Bi 2 WO 6 PANI/Bi 2 WO 6 PPy/Bi 2 WO 6 Bi 2 WO 6 , which is consistent with the UV-vis absorption spectra.The experimental results demonstrate that the separation efficiency of photogenerated electron-hole pairs is quite sensitive to the PTh, which may be attributed to the high electron mobility of its -bonding conjugated system. Photoelectrochemistry test is another available methodology to provide further evidence of electron-hole transfer mechanism.The photocurrent-time profiles of Bi 2 WO 6 HHMS and CP/Bi 2 WO 6 composites under visible light were measured as shown in Fig. 8.The generated photocurrents are reproducible and stable during four intermittent on-off irradiation cycles.The prompt increase in photocurrent response from the light-off to light-on state is mainly ascribed to the quick separation and transportation of photogenerated electrons on the electrode surface.It can be seen that the photocurrent of PTh/Bi 2 WO 6 (4.5 A/cm 2 ), PANI/Bi 2 WO 6 (3.3 A/cm 2 ), and PPy/Bi 2 WO 6 (2.9 A/cm 2 ) electrodes were almost 5.0, 3.6, and 3.2 times higher than that of pure Bi 2 WO 6 HHMS.This enhancement in visible photocurrent generation signifies the introduction of conducting polymers can effectively promote the charge carrier transfer and inhibit the electron-hole recombination, as proven by PL analysis.From the results, it can be deduced that the interaction between Bi 2 WO 6 and conducting polymers, especially PTh, is favorable for enhancing the photocatalytic activity of the as-prepared CP/Bi 2 WO 6 composites. The photocatalytic activity of pure Bi 2 WO 6 HHMS and CP/Bi 2 WO 6 composites were evaluated by photoreduction of CO 2 with water under visible light ( 420 nm) irradiation, and the predominant reaction products were analyzed.It was found that the main products of the photocatalytic CO 2 reduction were a mixture of methanol and ethanol over the as-prepared photocatalysts, and no obvious other products such as HCHO and HCOOH were detectable in the liquid phase.Furthermore, no gas products such as CH 4 and CO were observed because the conduction band (CB) potential of Bi 2 WO 6 is too low for CO 2 photoreduction.In contrast, there was no appreciable amount of organic product could be detected in the absence of either the photocatalysts or visible light irradiation, indicating that the presence of both the photocatalysts and visible light irradiation are indispensable for the photocatalytic reduction of CO 2 with water.In addition, no kinds of products were found by introducing N 2 instead of CO 2 into the photocatalyst suspension under visible light irradiation.This demonstrates that the photocatalysts and their residual intermediates do not contribute the organic products in the photoreduction system without CO 2 . Fig. 9 shows the effect of irradiation time on the yield of methanol and ethanol over as-prepared photocatalysts under visible light irradiation.It can be seen that the methanol and ethanol yields increase gradually with increasing the time of visible light irradiation.Compared to pure Bi 2 WO 6 , the CP/Bi 2 WO 6 composites exhibit higher photocatalytic activity in the reaction duration.After 4 h, the yield of methanol and ethanol over Bi 2 WO 6 , PPy/Bi 2 WO 6 , PANI/Bi 2 WO 6 , and PTh/Bi 2 WO 6 composites were 17.4 and 10.5, 30.4 and 13.7, 44.3 and 15.5, as well as 56.5 and 20.5 mol g cat -1 , respectively.The AQE of pure Bi 2 WO 6 , PPy/Bi 2 WO 6 , PANI/Bi 2 WO 6 , and PTh/Bi 2 WO 6 composites were also measured in the visible region to be approximately 0.0034, 0.0053, 0.0066, and 0.0086 at 475 nm, respectively.As can be seen, the PTh/Bi 2 WO 6 showed the best photocatalytic activity and apparent quantum efficiency.The total products (methanol and ethanol) yield and AQE over PTh/Bi 2 WO 6 is 2.8 and 2.5 times, respectively, higher than that over pure Bi 2 WO 6 .Obviously, the photocatalytic activity of the as-prepared photocatalysts is in the order of PTh/Bi 2 WO 6 PANI/Bi 2 WO 6 PPy/Bi 2 WO 6 Bi 2 WO 6 , which is consistent with the results of photoabsorption performance, and recombination rate of photogenerated electron-hole pairs.This demonstrates that the introduction of conducting polymers onto Bi 2 WO 6 surface can effectively promote the visible light absorption ability, and separation of electrons and holes, as well as prolong the lifetime of charge carriers, thus enhancing the corresponding photocatalytic performance. From environmental and economical viewpoints, it is good to have a catalyst that is stable and recyclable.To confirm the stability and recyclability of the high photocatalytic performance of the CP/Bi 2 WO 6 composites, the circulating runs in the photoreduction of CO 2 over pure Bi 2 WO 6 and PTh/Bi 2 WO 6 under visible light ( 420 nm) were carried out.It was found that both the pure Bi 2 WO 6 and PTh/Bi 2 WO 6 catalysts exhibit stable activity across five consecutive runs (Fig. 10).Furthermore, we characterized the recovered PTh/Bi 2 WO 6 after five runs by XRD (Fig. 1e) and FT-IR (Fig. 4e).In both cases, the recovered PTh/Bi 2 WO 6 showed similar results to those of the fresh one, demonstrating that PTh/Bi 2 WO 6 did not photocorrode during the photoreduction reaction of CO 2 . It is well known that the CB levels of photocatalysts must lie at a negative potential than that of CO 2 /reduced-product redox couples, which makes them promising as photocatalysts for CO 2 reduction to produce solar fuels 44.In order to investigate the driving force for the photocatalytic CO 2 reduction, the electrochemical properties of pure Bi 2 WO 6 HHMS were studied using a standard three-electrode cell.Fig. 11 shows the Mott-Sckottky plot with Bi 2 WO 6 HHMS being working electodes (0.5 M K 2 SO 4 with pH of 7 as electrolyte).The flat band potential (V fb ) of the Bi 2 WO 6 is calculated to be -0.05eV vs. SCE (equivalent to 0.19 eV vs. NHE).Base on the above data, the CB of Bi 2 WO 6 HHMS is calculated to be -0.01 eV vs. NHE.However, the potential of CO 2 changed into CH 3 OH is -0.38 eV (vs.NHE at pH 7.0) and that of CO 2 changed into C 2 H 5 OH is -0.33 eV (vs.NHE at pH 7.0) 44,45.It was impossible for electrons formed in the CB of Bi 2 WO 6 to reduce CO 2 molecule into methanol and ethanol.This contradiction implied that methanol and ethanol were not directly generated from CO 2 molecule physically absorbed on the catalyst.Nevertheless, it was reported that water solvates CO 2 in solution in the form of H 2 CO 3 , HCO 3 -or CO 3 -ions, which would transform the inert linear CO 2 molecules to more reactive bent C O bonds and lower the corresponding reduction potential by 0.42 eV (shown in Eqs. ( 1)-( 3)) 46.Obviously, the CB of Bi 2 WO 6 HHMS has to be more negative than the reduction potential of Eqs. ( 2) and ( 3), which exhibits sufficient driving force to promote the photocatalytic CO 2 reduction.According to the experimental results and literature reports 45,47, it is speculated that those CO 3 -(H 2 CO 3 , or HCO 3 -) can anchor to the photocatalyst surface and adopt the photogenerated electrons to form methanol after protonation.Moreover, ethanol can be formed by the methanol formation process of radical polymerization 45.However, the gas products such as CH 4 and CO can be only generated by photoreduction of CO 2 molecule 2.In addition, the potential of CO 2 changed into CH 4 is -0.24 eV (vs.NHE at pH 7.0, shown in Eq. ( 4)) and that of CO 2 changed into CO is -0.53 eV (vs.NHE at pH 7.0, shown in Eq. ( 5)), which are more negative than the CB of Bi 2 WO 6 2.Hence, there is no CH 4 and CO produced in this photoreduction CO 2 system. The experimental results have exhibited that the photoelectronic and photocatalytic activity of Bi 2 WO 6 have greatly promoted by modifying with conducting polymers.It is well known that the enhancement of photocatalytic activity of composite photocatalyst is attributed mainly to electric-filed-assisted charge transfer at the heterojunction interfaces 33.We know that the lowest unoccupied molecular orbital (LUMO) and the highest occupied molecular orbital (HOMO) of PPy, PANI, and PTh are ca.-0.72 and 1.78 48, -1.3 and 0.8 49, as well as -1.5 and 0.45 eV 50, respectively.The CB and valence band (VB, calculated from the equation E VB E CB E g ) of Bi 2 WO 6 HHMS are calculated to be ca.-0.01 and 2.83 eV, respectively.It can be seen that the conducting polymers (LUMO and HOMO) and Bi 2 WO 6 (CB and VB) match well in relative energy level and have chemical bond interaction, which can cause synergistic effect (Scheme 1).Under visible light irradiation, the conducting polymers can absorb photons to induce - transition, and generate electrons from the ground state (HOMO) into an excited state (LUMO).Meanwhile, electrons can be excited to the CB and leave holes in the VB of Bi 2 WO 6 .Based on the synergistic effect, the excited-state electrons of conducting polymers could easily inject into the CB of Bi 2 WO 6 , and subsequently transfer to the surface to participate in the photoreduction reaction.Simultaneously, the photogenerated holes in VB of Bi 2 WO 6 can directly transfer to the HOMO of conducting polymers.Therefore, a rapid photogenerated charge separation and relative slow charge recombination is achieved, which significantly enhances the photocatalytic activity of the conducting polymers modified Bi 2 WO 6 composites.Nevertheless, the difference of relative energy level (LUMO and HOMO) of the conducting polymers could result in different mobility and separation efficiency of the photogenerated charge carries.The larger difference of corresponding relative energy level between conducting polymer and Bi 2 WO 6 (LUMO vs. CB, HOMO vs. VB) can lead to better charge separation and stabilization, which benefits to the improvement of photocatalytic activity.Furthermore, the HOMO-LUMO gaps of PPy, PANI, and PTh are 2.50, 2.10, and 1.95 eV, respectively 484950.The lower HOMO-LUMO gap means that more photons can be absorbed by CP/Bi 2 WO 6 under visible light irradiation, which favors their visible light photocatalytic activity.Therefore, the photocatalytic activities of CP/Bi 2 WO 6 composites follow the order of PTh/Bi 2 WO 6 PANI/Bi 2 WO 6 PPy/Bi 2 WO 6 ."
  },
  {
    "title": "Conclusions",
    "content": "Conducting polymers (PPy, PANI, and PTh) modified Bi 2 WO 6 HHMS were fabricated and evaluated as photocatalysts for the photoreduction of CO 2 with H 2 O to methanol and ethanol under visible light ( 420 nm) irradiation.Compared to pure Bi 2 WO 6 HHMS, the introduction of conducting polymers enhanced the visible light absorption ability, promoted the charge transfer efficiency, and restrained the recombination of photogenerated electron-hole pairs, thus enhancing the photocatalytic performance.Among those conducting polymers modified Bi 2 WO 6 composites, the PTh/Bi 2 WO 6 shows the best photoelectronic and photocatalytic activities, due to the narrow band gap and good charge mobility.It was found that the total yield of methanol and ethanol over PTh/Bi 2 WO 6 photocatalyst is 2.8 times higher than that over pure Bi 2 WO 6 HHMS under visible light irradiation for 4 h.Furthermore, the PTh/Bi 2 WO 6 catalyst exhibits excellent stability and recyclability.After five consecutive runs, the photocatalytic activity and structure of PTh/Bi 2 WO 6 has almost no change.The mechanism of photocatalytic reduction of CO 2 with H 2 O to methanol and ethanol was also tentatively proposed.This study suggests a promising approach for design of efficient visible light-responsive photocatalysts, and provides important information and an alternative sustainable strategy required for the photocatalytic CO 2 reduction for liquid fuel production. Fig. 1.XRD patterns of pure Bi2WO6 and polymers modified Bi2WO6 samples. Fig. 2. Typical SEM images of the as-prepared (a, b) BiOBr, (c, d) Bi2WO6, (e, f) PTh/Bi2WO6, (g) EDS of PTh/Bi2WO6. Fig. 3. TEM images of PTh/Bi2WO6. Fig. 4. FT-IR spectra of pure Bi2WO6 and polymers modified Bi2WO6 samples. Fig. 5. UV-visible diffuse reflectance spectra of pure Bi2WO6 and polymers modified Bi2WO6 samples. Fig. 6.The band gap of pure Bi2WO6 and polymers modified Bi2WO6 samples. Fig. 7.The room temperature photoluminescence spectrum ( excitation 300 nm) of pure Bi2WO6 and polymers modified Bi2WO6 samples. Fig. 8. Photocurrent of pure Bi2WO6 and polymers modified Bi2WO6 samples under visible light irradiation. Fig. 9. Photocatalytic activity of pure Bi2WO6 and polymers modified Bi2WO6 samples under visible light irradiation. Fig. 10.Cycling run of (a) pure Bi2WO6 and (b) PTh/Bi2WO6 under visible light irradiation. Fig. 11.Mott-Schottky plot of the pure Bi2WO6. Scheme 1. Speculated mechanism for photocatalytic reduction of CO2 with H2O over PTh/Bi2WO6 under visible light irradiation. This work was financially supported by the National Natural Science Foundation of China (Grant Nos.51104089, 51238002, and 51272099).Natural Science Foundation of Jiangxi Province (Grant Nos.20151BAB203012).Natural Science Foundation of Jiangxi Provincial Department of Education (Grant Nos.GJJ14537 and GJJ14516)."
  }
]