[
  {
    "title": "Doi",
    "content": "10.1016/j.jcat.2017.06.006"
  },
  {
    "title": "Article_Title",
    "content": "A direct Z-scheme g-C3N4/SnS2 photocatalyst with superior visible-light CO2 reduction performance"
  },
  {
    "title": "Abstract",
    "content": "Photocatalytic reduction of CO 2 to solar fuels is an ideal approach to simultaneously solve the global warming and energy crisis issues.Constructing a direct Z-scheme heterojunction is an effective way to overcome the drawbacks of single-component or conventional heterogeneous photocatalysts for photocatalytic CO 2 reduction.Here, a novel type of direct Z-scheme g-C 3 N 4 /SnS 2 heterojunction was constructed by depositing SnS 2 quantum dots onto the g-C 3 N 4 surface in situ via a simple one-step hydrothermal method.L-Cysteine not only acted as the sulfur source, but also grafted ammine groups onto g-C 3 N 4 in the hydrothermal process, which greatly enhanced the CO 2 uptake of the composite.XPS analysis and density functional theory (DFT) calculation show that electron transfer occurred from g-C 3 N 4 to SnS 2 , resulting in the formation of interfacial internal electric fields (IEF) between the two semiconductors at equilibrium.As a result, Z-scheme charge transfer took place under photoexcitation, with the electrons in SnS 2 combining with the holes in g-C 3 N 4 , which improved the extraction and utilization of photoinduced electron in g-C 3 N 4 .The g-C 3 N 4 /SnS 2 hybrid shows superior photocatalytic CO 2 reduction as compared with individual g-C 3 N 4 and SnS 2 , which should be attributed to the IEF-induced direct Zscheme as well as improved CO 2 adsorption capacity.In situ FTIR spectra illustrate that HCOOH appeared as an intermediate during the CO 2 conversion, which can only be generated by g-C 3 N 4 according to the energy level of the photoinduced electrons, further confirming the Z-scheme configuration for the g-C 3 N 4 /SnS 2 system."
  },
  {
    "title": "Experimental",
    "content": "Bulk g-C 3 N 4 was synthesized by annealing melamine in a muffle furnace.Specifically, 10 g of melamine powder was placed in an alumina crucible with a cover and then heated to 550 C for 2 h 31.After cooling to ambient temperature, the light yellow solid was ground carefully to a fine powder.The g-C 3 N 4 nanosheet was exfoliated via sonication of bulk g-C 3 N 4 .Briefly, 200 mg of bulk g-C 3 N 4 was put into a 200 mL breaker with 100 mL deionized water, with subsequent ultrasound for 1 h.The surface charge of g-C 3 N 4 was detected by zeta potential; the zeta potential of g-C 3 N 4 at pH 7 is A35.1 mV, meaning that g-C 3 N 4 is very stable and negatively charged. The g-C 3 N 4 /SnS 2 composite was synthesized by an in situ hydrothermal method with g-C 3 N 4 , SnCl 4 A5H 2 O, and L-cysteine as precursors.Briefly, 45 mL of the g-C 3 N 4 nanosheet dispersion was mixed with 15 mL deionized water following another 30 min of ultrasound.Then 35 mg of SnCl 4 A5H 2 O was added into this g-C 3 N 4 solution; due to the negative charge of g-C 3 N 4 , Sn 4 could be adsorbed onto the surfaces of g-C 3 N 4 nanosheets with continuous stirring.After it was stirred for 15 min, 60 mg L-cysteine was added, followed by another 15 min of stirring.The mixed solution was then transferred to a Teflon-lined autoclave and maintained at 140 C for 12 h.The yellow precipitates were collected via centrifugation, washed thoroughly with water, and dried at 80 C.The actual content of SnS 2 in the composite was 3.5 wt, which was measured by inductively coupled plasma atomic emission spectrometry (ICP-AES).For comparison, pure SnS 2 and g-C 3 N 4 were prepared under the same experimental conditions, except for the addition of g-C 3 N 4 for SnS 2 and SnCl 4 A5H 2 O and L-cysteine for g-C 3 N 4 , respectively. A Rigaku X-ray diffractometer (Japan) with Cu Ka radiation was used to test X-ray diffraction (XRD) patterns.Morphological obser-vations were conducted on a JEOL JSM-7500 field emission scanning electron microscope (FESEM, Japan) and a JEOL JEM-2100F transmission electron microscope (TEM, Japan).UV-vis diffuse reflectance spectra were analyzed on a Shimadzu UV-2600 UVvis spectrophotometer (Japan).The Brunauer-Emmett-Teller (BET) specific surface area (S BET ) and the CO 2 adsorption of the powders were measured on a Micromeritics ASAP 3020 with nitrogen and carbon dioxide adsorption apparatus (USA), respectively.X-ray photoelectron spectroscopy (XPS) was performed on a Thermo ESCALA 250 XPS spectrometer system with AlKa (1486.6 eV) radiation.The binding energies were referenced to the C1s peak at 284.8 eV from adventitious carbon.Zeta potential measurement was carried out on an MPT-2 multipurpose titrator equipped with a Zetasizer Nano instrument (Malvern, USA).A Nicolet is50 spectrometer (Thermo fisher, US) was used to record the Fourier transform infrared (FTIR) and in situ FTIR spectra.Electrochemical measurements were implemented on an electrochemical analyzer (CHI660C, China) in a standard three-electrode system with the as-prepared samples as the working electrode, a Pt wire as the counter electrode, and Ag/AgCl (saturated KCl) as a reference electrode.A 420 nm LED light was utilized as the light source.A Na 2 SO 4 (0.5 M) aqueous solution was used as the electrolyte.The working electrodes were prepared as follows: 0.05 g of photocatalyst was ground with 0.5 mL of ethanol to make a slurry.The slurry was then coated onto a 2 A 1.2 cm F-doped SnO 2 -coated glass (FTO glass) electrode by the doctor blade technique.Next, these electrodes were dried in an oven at 80 C for 30 min.All investigated electrodes have a similar film thickness of 10-11 lm. The CO 2 photoreduction on the photocatalysts in the presence of H 2 O was conducted in a photoreactor similar to that reported in our previous study 7.The photocatalytic CO 2 reduction was carried out in a 200 mL homemade Pyrex reactor with two openings at ambient temperature and atmospheric pressure 32.Particularly, 50 mg of sample was uniformly dispersed in 10 mL of deionized water by ultrasonication, preheated to 80 C, and then maintained for 2 h to evaporate water and deposited on the bottom of the reactor, forming a smooth and thin film.The two openings of the reactor are sealed with rubber stoppers, and N 2 was blown through the reactor to ensure anaerobic conditions of the reaction system before light irradiation.CO 2 and H 2 O sources were introduced by reaction of NaHCO 3 (84 mg, added into the reactor before seal) and H 2 SO 4 aqueous solution (0.3 mL, 0.2 M, syringed into the reactor after N 2 blowing).A 300 W Xe light with a cutoff filter (k !420 nm) was positioned 20 cm vertically above the photocatalytic reactor as a visible light source.The gas product (1 mL, taken from the reactor) was analyzed using a gas chromatograph (GC-2014C, Shimadzu) equipped with a flame ionized detector (FID) and a methanizer.The reduced products in this experiment were calibrated with a standard gas mixture and determined from the retention time. Density functional theory (DFT) calculation was carried out using the CASTEP module in the Materials Studio software.The Per dewABurkeAErnzerhof (PBE) exchange-correlation functional was employed within the generalized gradient approximation (GGA).A cutoff energy of 500 eV and a MonkhorstAPack k-mesh of 3 A 3 A 1 were used 33.The convergence tolerance for the geometry optimization were set as 1.0 A 10 A5 eV/atom for energy and 0.03 eV/A for maximum force.The optimized structures of g-C 3 N 4 and SnS 2 are shown in Fig. 1.After geometry optimization, the average potential profile was calculated to obtain the work functions of g-C 3 N 4 and SnS 2 .The work function (U) is defined as U E vac A E F , where E vac and E F are the vacuum energy and Fermi energy, respectively 34."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The XRD patterns of the samples are displayed in Fig. 2a.The pattern of g-C 3 N 4 features two distinct peaks at 13.1and 27.4, coincident with its well-developed layered structure 35.The peak at 13.1can be assigned to the in-plane structural packing motif of tri-s-triazine units, and the one at 27.4reflects the interlayer stacking of conjugated aromatic systems with a distance of 0.326 nm 36,37.For sample SnS 2 , all the peaks can be readily indexed to hexagonal SnS 2 (JCPDS 01-1010).The obtained composite photocatalyst possesses the typical peak of g-C 3 N 4 at 27.4.There is no difference in diffraction peaks of g-C 3 N 4 before and after hydrothermal treatment, indicating that the hydrothermal treatment had no obvious influence on the structure of g-C 3 N 4 (Fig. S1a in the Supporting Information).In addition, due to the small amount of SnS 2 in the composite, the diffraction peaks of SnS 2 were unresolved for the pattern of g-C 3 N 4 /SnS 2 . SEM and TEM images were taken to demonstrate the morphology and microstructure of the products.The SEM picture of g-C 3 N 4 particles with fairly smooth surfaces is shown in Fig. S1b.In comparison with pure g-C 3 N 4 , the g-C 3 N 4 /SnS 2 hybrid shows a rough surface decorated with numerous SnS 2 nanoparticles (Fig. 2b).The TEM image (Fig. 2c) clearly shows that SnS 2 was uniformly loaded on g-C 3 N 4 without obvious aggregation, intimately attached to the g-C 3 N 4 surface.The high-resolution TEM (HRTEM) picture shows that the SnS 2 are present as quantum dots, with size 2-3 nm (Fig. 2d).The size distribution of the SnS 2 dots is shown in Fig. S2.For comparison, the TEM image of pure g-C 3 N 4 is also given (Fig. S1).The lattice fringes show distances of 0.35 and 0.28 nm, corresponding to the (1 0 0) and (1 0 1) planes of crystalline SnS 2 , respectively.In contrast, the g-C 3 N 4 support demonstrates an amorphous nature, as expected.Furthermore, a controlled experiment illustrates that individually synthesized SnS 2 presents a nanosheet-aggregated morphology (Fig. S1c), with lateral sizes of the nanosheets up to a few hundred nanometers.These observations strongly demonstrate the directing effect of the g-C 3 N 4 on the formation of the SnS 2 quantum dots, probably resulting from electrostatic attraction between the negatively charged g-C 3 N 4 and the Sn 4 cations in solution, as well as from the presence of the amino groups of g-C 3 N 4 , which served as anchoring sites to stabilize the Sn 4 precursors, achieving fast heterogeneous crystal nucleation and relatively dispersive nucleation centers and confining the growth of the SnS 2 nanocrystals.Furthermore, the elemen-tal mapping analysis of the sample (see Fig. 2e) indicates that SnS 2 quantum dots uniformly deposit on the surface of g-C 3 N 4 . Fourier transform infrared (FTIR) spectra were obtained to investigate the structure of g-C 3 N 4 /SnS 2 heterojunction.As illustrated in Fig. 3, the FTIR spectrum of g-C 3 N 4 /SnS 2 has no significant difference from that of pure g-C 3 N 4 .The broad band of pure g-C 3 N 4 and g-C 3 N 4 /SnS 2 from 3000 to 3300 cm A1 is attributed to the NAH stretching vibration of the incomplete condensed amine groups and adsorbed H 2 O molecules 38.The absorption peaks in the range from 1200 to 1700 cm A1 are ascribed to the typical stretching modes of CAN heterocycles 32.The absorption peak at 879 cm A1 is ascribed to the deformation mode of NAH bonds.The peak at 806 cm A1 belongs to the typical breathing mode of tri-s-triazine units.For SnS 2 , the adsorption peak at 545 cm A1 originates in the Sn-S vibration 39.The characteristic band of SnS 2 is not obvious in the spectrum of the composite due to the small content of SnS 2 and the strong absorption peak of g-C 3 N 4 . The optical absorption properties were investigated by UV-vis diffuse reflectance measurement as shown in Fig. 4. g-C 3 N 4 exhibits a strong absorption edge at 450 nm.According to the (ahm) 2 against hm curve, the bandgap energy (E g ) of g-C 3 N 4 is 2.8 eV, agreeing well with previous report 40.Pure SnS 2 displays spectrum absorbance across the entire visible range with E g of 2.1 eV, suggesting that SnS 2 is a potential visible-light-responsive sensitizer 23,41.After hybridization of g-C 3 N 4 with SnS 2 , the obtained material shows a combined absorption ability of the two compounds, gaining significantly enhanced long-wavelength absorption as compared to individual g-C 3 N 4 .The corresponding optical pictures of the three samples in Fig. 4 show that the color of g-C 3 N 4 (light yellow) was deepened after the deposition of SnS 2 (which has a brown color), further confirming that SnS 2 was successfully deposited onto the g-C 3 N 4 . N 2 sorption was carried out to determine the specific surface area (S BET ) and corresponding pore structure.As shown in Fig. 5, all samples exhibit type IV isotherms 42.The type H3 hysteresis loop indicates the existence of slitlike mesopores for the three samples due to materials stacking 30,43.The S BET of samples g-C 3 N 4 , g-C 3 N 4 /SnS 2 , and SnS 2 was calculated to be 10, 25, and 31 m 2 g A1 , respectively (Table 1).In comparison with pure g-C 3 N 4 , the S BET of sample g-C 3 N 4 /SnS 2 increases greatly due to the introduction of SnS 2 .There was no obvious change in the pore volume of the composite compared with that of g-C 3 N 4 , but a sharp drop in the average pore size was seen, suggesting that there were many more pores in g-C 3 N 4 /SnS 2 than in g-C 3 N 4 , especially pores with diameter of 2-10 nm (inset of Fig. 5), which is advantageous for the absorption of CO 2 . The adsorption process is recognized to precede the conversion of CO 2 to hydrocarbons 44.Hence, CO 2 adsorption was tested to analyze the CO 2 adsorption capability of the as-synthesized photocatalysts.As illustrated in Fig. 6 and Table 1, the g-C 3 N 4 /SnS 2 com-posite showed much higher CO 2 adsorption capacity than g-C 3 N 4 or SnS 2 .The maximum adsorption values at atmosphere pressure are 0.05, 0.11, and 0.06 mmol g A1 for g-C 3 N 4 , g-C 3 N 4 /SnS 2 , and SnS 2 , respectively.We believe that the much higher CO 2 uptake of the g-C 3 N 4 /SnS 2 hybrid than that of g-C 3 N 4 or SnS 2 results from anchoring of amine groups on the g-C 3 N 4 surface during the hydrothermal reaction, wherein L-cysteine acted as the sulfur source and meanwhile provided the amine groups, which have been widely employed to increase materials' CO 2 adsorption capacity due to their alkalinity 45.Fig. 4. UV-vis diffuse reflectance spectra and the corresponding optical pictures of the prepared samples.The inset is the plots of (ahm) 2 against photon energy (hm) for samples g-C 3 N 4 and SnS 2 . XPS was employed to investigate the surface chemical components and bonding configuration of the photocatalysts.As shown in Fig. 7a, both g-C 3 N 4 and g-C 3 N 4 /SnS 2 samples show the C1s peak at 284.8 eV, which is ascribed to sp 2 CAC bonds of graphitic carbon (carbon impurities) 46.For g-C 3 N 4 , the other peak at 288.3 eV was assigned to sp 2 bonded carbon of NACN and the corresponding peak for g-C 3 N 4 /SnS 2 was slightly shifted to 288.4 eV.The N1s spectrum of sample g-C 3 N 4 (Fig. 6b) reveals three main peaks at binding energies of 398.8, 400.0, and 401.2 eV, corresponding to CNAC, NA(C) 3 , and CANAH, respectively 47.The relevant binding energies for the g-C 3 N 4 /SnS 2 hybrid all showed slight increases to 398.9, 400.4,and 401.6 eV, respectively. The Sn 3d spectrum of sample SnS 2 shown in Fig. 7c displays two main peaks at 487.1 and 495.5 eV, which can be assigned to Sn 3d 5/2 and 3d 3/2 , respectively.The corresponding peak positions of g-C 3 N 4 /SnS 2 show minor decreases to 486.9 and 495.3 eV.The high-resolution spectrum of S 2p (Fig. 7d) for sample SnS 2 was well deconvoluted into two peaks at 161.9 and 163.2 eV, assigned to S 2p 3/2 and 2p 1/2 48.The corresponding peak positions of sample g-C 3 N 4 /SnS 2 shift to 161.5 and 162.5 eV, respectively.There are two other peaks present for the hybrid, located at 168.5 and 169.5 eV, which can be attributed to the existence of SO 4 2-, arising from the easy oxidation of SnS 2 quantum dots in air 49,50. As noted above, the elemental binding energies of g-C 3 N 4 in the composite demonstrated an overall shift to higher values, while the SnS 2 unit showed the opposite trend.In our opinion, the variation of binding energies relates to the change of surface electron density, which results from electron transfer between semiconductors with different E F levels 39,51.During the hybridization of two semiconductors, electrons will transfer from the semiconductor with a higher E F level to the semiconductor with a lower E F level.According to our calculations (Fig. 8), electrons would transfer from g-C 3 N 4 to SnS 2 in the hybridization process, resulting in a decrease of electron concentration in g-C 3 N 4 and an increase in SnS 2 .These results indicated the generation of IEF between g-C 3 N 4 and SnS 2 , with the orientation from g-C 3 N 4 to SnS 2 . The photocatalytic reduction of CO 2 in this experiment was conducted under visible light irradiation (k !420 nm) at atmospheric pressure.Control experiments showed that hydrocarbons were undetected in the absence of photocatalysts or irradiation, indicating that effective photocatalysis and illumination are two essential factors for CO 2 reduction.Further control experiment was conducted without the addition of a carbon source but using N 2 as the carrier gas.No hydrocarbons were yielded after illumination for 1 h, indicating that hydrocarbons in this experiment did not originate from the carbon-containing photocatalysts (g-C 3 N 4 ) or carbon contamination.As displayed in Fig. 9, the main products of photocatalytic CO 2 reduction are CH 4 and CH 3 OH, two important storable fuels.Compared with other products (HCOOH, HCHO, etc.), the conversion of CO 2 to CH 4 or to CH 3 OH occurs at higher potential (lower electron energy) but requires more electrons to be involved.Possible reactions and products related to CO 2 reduction as well as the corresponding standard redox potentials from thermodynamic data in this paper are presented in Table 2 52. Fig. 9a shows a comparison of photocatalytic generation yield of CH 4 and CH 3 OH under visible light illumination for the first hour over different samples.We note that only CH 3 OH was detected as the product for individual g-C 3 N 4 and SnS 2 , with yields of 1.2 and 0.8 lmol g A1 , respectively.It is worth mentioning that although g-C 3 N 4 has smaller specific surface area, lower CO 2 uptake, and weaker light absorption than SnS 2 , it still demonstrates relatively higher photocatalytic activity, suggesting its intrinsic favorable charge separation and charge transfer processes for CO 2 reduction upon photoexcitation.SnS 2 alone shows inferior photocatalytic CO 2 reduction performance, most likely due to fast electron-hole recombination and its low CB position, which endows the photoexcited electrons with low reduction ability.Importantly, the g-C 3 N 4 /SnS 2 composite exhibited the highest CH 3 OH yield (2.3 lmol g A1 ), and concurrently showed a CH 4 production yield of 0.64 lmol g A1 .The obtained hydrocarbon yields are higher than g-C 3 N 4 coupling with noble metal co-catalysts or semiconductors, as reported by others 32,53,54. Fig. 9b-d shows the time courses of photocatalytic CH 4 and CH 3 OH production over the prepared samples under visible light irradiation.For g-C 3 N 4 , continuously increased CH 3 OH production was observed under illumination, and CH 4 started to appear as another product after 3 h irradiation.In contrast, only CH 3 OH was detected over SnS 2 even after 3 h illumination.For g-C 3 N 4 / SnS 2 , both CH 3 OH and CH 4 were detected as the illumination started.In the first hour, CH 3 OH showed a much higher yield than CH 4 .With the prolongation of illumination, the generation rate of CH 3 OH declined and its amount became comparable to that of CH 4 after 3 h reaction.Based on these results, we assume that the photoinduced electrons can transfer to and accumulate on the g-C 3 N 4 surface, thus triggering the formation of CH 4 , which requires more electrons to be involved.In the case of g-C 3 N 4 / SnS 2 hybrids, the photoinduced electrons can be more effectively gathered due to the Z-scheme process (as discussed below), so that Owing to this effect, CH 4 turns to be the preferable reductive product of CO 2 in comparison with CH 3 OH as the illumination continues. To understand the charge transfer processes in the g-C 3 N 4 /SnS 2 binary photocatalytic system, band edge positions of g-C 3 N 4 and SnS 2 are presented in Fig. 10.As described above, the E g of g-C 3 N 4 and SnS 2 is 2.8 and 2.1 eV, respectively.The E CB of g-C 3 N 4 and SnS 2 is A1.52 and A0.56 V vs. NHE (pH 7), respectively, which is more negative than the reduction potentials of CO 2 to CH 4 and CO 2 to CH 3 OH.Thus, from a thermodynamic viewpoint, both semiconductors should be able to be photoexcited and thus reduce CO 2 to CH 3 OH or CH 4 .However, as mentioned above, SnS 2 was incapable of generating CH 4 even after long irradiation, suggesting that effective accumulation and extraction of photoinduced electrons in SnS 2 were not allowed, most likely due to fast charge recombination.For the g-C 3 N 4 /SnS 2 hybrid, if electrons transferred through the conventional heterojunction route, the photoinduced electrons of g-C 3 N 4 would transfer to the CB of SnS 2 .Consequently, CH 4 will not be produced.Therefore, the generation of CH 4 in the composite from the first hour of illumination indicates that the conventional heterojunction mechanism is not suitable for the g-C 3 N 4 /SnS 2 composite. As discussed in the XPS analysis and the calculation, IEF was formed after the deposition of SnS 2 onto g-C 3 N 4 .Therefore, we propose an IEF-induced direct Z-scheme charge transfer mechanism to illustrate the enhanced photocatalytic activity as well as the improved CH 4 generation for the g-C 3 N 4 /SnS 2 hybrid.Under visible light irradiation (k !420 nm), both g-C 3 N 4 and SnS 2 can be excited to generate electron-hole pairs.Afterward, the CB electrons in SnS 2 would transfer to combine with the VB holes in g-C 3 N 4 , following the Z-scheme pathway.As a result, the residual electrons in g-C 3 N 4 can preserve their strong reducibility 53 and reduce CO 2 (in the presence of H 2 O) to CH 3 OH and CH 4 . To further gain insights into the photocatalytic CO 2 reduction process, in situ IR has been conducted to detect the CO 2 conversion intermediates upon the g-C 3 N 4 /SnS 2 .Before the measurement, the photocatalyst was treated at 150 C under vacuum to remove the adsorbed contaminants.The FTIR spectrum of the photocatalyst in the dark was first collected as the background prior to any CO 2 introduction.After CO 2 introduction, the FTIR spectra were obtained by subtracting the background.The in situ FTIR analysis was carried out in two sequential steps.First, CO 2 adsorption on the g-C 3 N 4 /SnS 2 was carried out in the dark after continuous flow of a mixture of CO 2 and H 2 O vapor (CO 2 was continuously passed through a water bubble into the chamber) for 1 h.Second, the reactor was illuminated with a LED lamp (k 420 nm) for 1 h to investigate the conversion of CO 2 over the photocatalyst.As shown in Fig. 11, after the photocatalyst was exposed to CO , 1343 and 1651 cm A1 ), and bicarbonate (HCO 3 A , 1238, 1395, and 1421 cm A1 ) were formed, and the peak at 1640 cm A1 assigned to H 2 O can also be observed 5556575859606162.With the light on, most peaks showed minor enhancement with no obvious position change.We note that two new peaks at 1356 and 1525 cm A1 that can be assigned to COO A stretching appeared after illumination for 1 h 58,63.This result indicates that HCOOH acted as the intermediate during the photocatalytic CO 2 reduction.As shown in Table 2, the generation of HCOOH from CO 2 involves transfer of two electrons, and the reduction potential is A0.61 V vs. NHE (pH 7).Accordingly, it is impossible for SnS 2 to produce HCOOH due to its E CB edge position (A0.56V).The in situ FTIR results further confirm the Z-scheme charge transfer mechanism for the g-C 3 N 4 /SnS 2 hybrid over photocatalytic CO 2 reduction. Transient photocurrent responses for g-C 3 N 4 , g-C 3 N 4 /SnS 2 , and SnS 2 were recorded by switching the irradiation light on and off for several cycles to further study their photocatalytic activity (Fig. 12).The g-C 3 N 4 /SnS 2 composite demonstrated significantly improved photocurrent compared with individual g-C 3 N 4 and SnS 2 .This result agrees well with the above photocatalytic CO 2 reduction performances.Notably, an anodic photocurrent spike emerged in all the photocurrent curves once the light was on, resulting from the vast recombination of photogenerated electron-hole pairs at the initial time of irradiation 32.Then the photocurrent decreased and remained almost constant, due to the equilibration between separation and recombination of electronhole pairs 64."
  },
  {
    "title": "Conclusions",
    "content": "In summary, this work reports the facile synthesis of a novel g-C 3 N 4 /SnS 2 Z-scheme photocatalysis system that demonstrated enhanced activity for photocatalytic CO 2 reduction.The SnS 2 quantum dots had sizes of 2-3 nm and were uniformly anchored on the g-C 3 N 4 surface.XPS analysis indicated electron transfer from g-C 3 N 4 to SnS 2 after deposition, forming an interfacial IEF directed from g-C 3 N 4 to SnS 2 .Driven by this IEF, electrons in SnS 2 CB would combine with holes in g-C 3 N 4 VB under visible light irradiation, resulting in the Z-scheme pathway.The Z-scheme configuration enhanced the electron extraction for g-C 3 N 4 /SnS 2 and thus led to more efficient photocatalytic CO 2 reduction to CH 3 OH and CH 4 .In situ FTIR measurement illustrates that HCOOH was the intermediate in the CO 2 conversion process, which further indicated the Zscheme charge transfer mechanism for g-C 3 N 4 /SnS 2 hybrid.This work provides novel insight into the formation mechanism and the interfacial charge transfer mechanism of the direct Z-scheme photocatalysis system. Fig. 1.Optimized structures of (a) g-C 3 N 4 and (b) SnS 2 .The gray, blue, yellow, and green spheres are C, N, S, and Sn atoms, respectively. Fig. 2. (a) XRD patterns of samples g-C 3 N 4 , g-C 3 N 4 /SnS 2 , and SnS 2 .(b) FESEM image, (c) TEM image, (d) HRTEM image, and (e) elemental mapping images of C, N, Sn, and S of sample g-C 3 N 4 /SnS 2 . Fig. 3. FTIR spectra of samples g-C 3 N 4 , g-C 3 N 4 /SnS 2 , and SnS 2 . Fig. 5. Nitrogen adsorption-desorption isotherms and the corresponding pore size distribution curves (inset) of the samples. 2 and H 2 O (without light), monodentate carbonate (m-CO 3 2A , 1298, 1314, 1461, and Fig. 6.CO 2 adsorption isotherms of g-C 3 N 4 , g-C 3 N 4 /SnS 2 , and SnS 2 samples. Fig. 8. Calculated Fermi levels of (a) g-C 3 N 4 and (b) SnS 2 . Fig. 9. (a) Hydrocarbon generation rate in comparison with samples g-C 3 N 4 , g-C 3 N 4 /SnS 2 , and SnS 2 for 1 h illumination.(b-d) Time courses of photocatalytic CH 4 and CH 3 OH production over the prepared samples under visible light irradiation (k !420 nm). Fig. 10.IEF-induced direct Z-scheme charge transfer mechanism for g-C 3 N 4 /SnS 2 in photocatalytic reduction of CO 2 . Fig. 11.In situ FTIR spectra of g-C 3 N 4 /SnS 2 over CO 2 H 2 O in the dark for 60 min and with light for another 60 min. Fig. 12. Transient photocurrent responses for (a) SnS 2 , (b) g-C 3 N 4 , and (c) g-C 3 N 4 / SnS 2 under LED light irradiation (k 420 nm) in 0.5 M Na 2 SO 4 aqueous solution. Pore volume, pore diameter, S BET , and the corresponding CO 2 uptake ability of pure g-C 3 N 4 , g-C 3 N 4 /SnS 2 , and SnS 2 .4 appears earlier in the products than for the pure g-C 3 N 4 . CH Relevant products of CO 2 reduction and the corresponding reduction potentials with reference to NHE at pH 7. 61 2e A ?HCOOH A0.61 T. Di et al. / Journal of Catalysis 352 (2017) 532-541 Acknowledgments This work was supported by the National Basic Research Program of China (2013CB632402), the NSFC (51320105001, 21433007, 51372190 and 21573170), the Natural Science Foundation of Hubei Province (2015CFA001), the Fundamental Research Funds for the Central Universities (WUT: 2015-III-034), and the Innovative Research Funds of SKLWUT (2017-ZD-4).J.X. thanks the Australian Research Council for financial support (DE160101488). Supplementary data associated with this article can be found, in the online version, at http://dx.doi.org/10.1016/j.jcat.2017.06.006."
  }
]