[
  {
    "title": "Doi",
    "content": "10.1016/j.cej.2019.06.002"
  },
  {
    "title": "Article_Title",
    "content": "Construction of TiO2 nanosheets/tetra (4-carboxyphenyl) porphyrin hybrids for efficient visible-light photoreduction of CO2"
  },
  {
    "title": "Abstract",
    "content": "The design and construction of photocatalysts in converting CO 2 into value-added chemicals is of significant importance for addressing energy shortages and environmental pollution problems.In this work, a TiO 2 nanosheets/tetra (4-carboxyphenyl) porphyrin (TiO 2 NSs/TCPP) hybrid for photoreduction of CO 2 was developed using a simple self-assemble approach.The TCPP works as the light-harvesting unit to generate light-induced electron-hole pairs, with the connection between the TCPP and TiO 2 facilitating the electron injection to the CB of TiO 2 as well as inhibiting the recombination of photo-generated electron-hole pairs, then the highly active (0 0 1) facets of TiO 2 NSs serve as the reaction sites and efficiently convert the CO 2 molecules adsorbed on the surface of the catalysts into CO and CH 4 products.The influence of TCPP content on the photocatalytic activity was investigated.Compared to the pristine TiO 2 NSs material, the TiO 2 NSs/11.5 TCPP composite displayed a much-enhanced photocatalytic CO 2 reduction activity, which is equal to 37-fold enhancements in the CO evolution rate.Furthermore, a possible mechanism for CO 2 photoreduction over TiO 2 NSs/TCPP hybrids is proposed on the basis of the photocatalytic and photo(electro)chemical results."
  },
  {
    "title": "Experimental",
    "content": "Tetrabutyltitanate (TBOT), hydrofluoric acid (HF), hydrochloric acid (HCl), potassium hydroxide (KOH), dimethyl formamide (DMF), methanol (MeOH) and tetrahydrofuran (THF) were purchased from the Beijing Chemical Reagent Company.Propionic acid, methyl p-formylbenzoate, pyrrole was purchased from Sigma-Aldrich.All reagents were used without further purification. The TiO 2 NSs was synthesized by a modified hydrothermal method 30.25 mL TBOT and 5 mL HF were mixed and stirred for 1 h at room temperature.Then the mixed solution was transferred to a 25 mL Teflon-lined stainless steel autoclave and heated at 180 C for 20 h.After the autoclave was cooled down to room temperature, the white products were collected and washed with ethanol and water, then dried at 60 C for 12 h in air. The TCPP was prepared according to a modified Adler-Longo method 31.First, 0.042 mol methyl p-formylbenzoate was put into a 250 mL three-necked, round-bottomed flask, then 100 mL propionic acid was added into the flask.Then 0.043 mol pyrrole was slowly added into the solution, and the mixed solution was refluxed for 12 h.After the above solution was cooled down to room temperature, the flask containing the mixture was transferred to the refrigerator and kept still for 12 h.The mixture was then washed with ethanol (150 mL), ethyl acetate (150 mL) and THF (80 mL) several times until the color of the mixture changed to purple.The TCPP precursor was obtained after being dried at 80 C in vacuum for 12 h.Following that, the 1.95 g TCPP precursor was added into 120 mL mixed solvent of MeOH and THF with volume ratio of 1:1, and 60 mL KOH solution (2 M) was added into the above solution.The mixed solution was refluxed for 12 h.After the solution was cooled down to room temperature, the MeOH and THF were evaporated.Then 50 mL deionized water was added until the solid was completely dissolved.Afterwards, 1 M HCl was slowly added into the above solution until purple crystals appeared.Finally, the TCPP products were obtained by filtration, washed with water times, and dried at 80 C in a vacuum for 12 h. In a typical procedure, 0.2 g TiO 2 NSs was added into the 10 mL DMF of TCPP (1 M).After ultrasonic dispersion for 30 min, the mixtures were stirred for 12 h at room temperature.Afterward, the purple products were recovered by filtration and dried at 60 C for 12 h.Products with different TCPP loading were obtained by repeating the above process several times.Based on the TG results, the loaded amounts of the TCPP were calculated as being 2.6, 8.0, 11.5, 15.2, 22.4, and the corresponding composites were labeled as TiO 2 NSs/2.6TCPP, TiO 2 NSs/8.0TCPP, TiO 2 NSs/11.5 TCPP, TiO 2 NSs/15.2TCPP, TiO 2 NSs/22.4 TCPP, respectively. The morphology and structure of the products were characterized using scanning electron microscopy (SEM, ZEISS SUPRA55) and transmission electron microscopy (TEM, JEOL JEM-100CX II).The phase composition of the products were characterized by X-ray powder diffraction (XRD, M21X, Cu K radiation, 0.1542 nm).UV-vis diffuse reflectance (UV-vis-DRS) spectra were collected on a Shimadzu UV-2550 using KBr Barium sulphate (BaSO 4 ) reflectance standard.Fourier transform infrared spectra (FTIR) was collected on a Nicolet 6700 Fourier spectrometer using the KBr pellets technique.Surface chemical analysis was performed by X-ray photoelectron spectroscopy (XPS, ESCALAB 250Xi).The thermal decomposition behavior of the products was investigated with thermogravimetric experiments (TG, Netzsch STA449F3) from room temperature to 900 C at a rate of 10 C/ min in N 2 atmosphere.Steady-state photoluminescence (PL) spectra and the time-resolved PL spectra were carried out on a spectrofluorometer (FluoroMax-4, Horiba Jobin Yvon) with an excitation wavelength of 300 nm.Electron paramagnetic resonance (EPR) measurements were carried out at room temperature on a Bruker A300-10/12 with the samples adsorbed with TEOA. The photocurrent measurements were conducted on a Chenhua CHI660D electrochemical workstation using a typical three-electrode cell with the samples as the working electrodes, a Pt plate as the counter electrode, and Ag/AgCl (saturated KCl) as the reference electrode, respectively (Fig. S1).Typically, a 10 mg sample (TiO 2 NSs or TiO 2 NSs/ 11.5TCPP) was dispersed in Nafion and ethanol solution under sonication for 10 min.Then the as-prepared slurry was spread onto the Fluorine-doped tin oxide (FTO) conductive glass with an area of ca. 1 cm 2 and then dried at room temperature overnight.A 0.5 M aqueous solution of Na 2 SO 4 served as the supporting electrolyte.The dissolved air was removed from the electrolyte using nitrogen gas bubbling for 1 h.The transient photocurrent response spectra were collected in supporting electrolyte under the 300 W Xenon lamp with optical filter of 420 nm as a light source.The photocurrents with light on and off were measured at a bias voltage of 0.5 V. Electrochemical impedance spectroscopy (EIS) was tested over a frequency range of 0.1 Hz to 1 MHz with an Ac amplitude of 5 mV. First, the as-prepared TiO 2 NSs/TCPP was loaded onto a silica filter membrane.In a typical procedure, 0.1 g TiO 2 NSs/TCPP product was dispersed into the ethanol solution with ultrasound irradiation.Then the suspension was poured onto a silica filter membrane (diameter, 47 mm) under suction filtration conditions.Then the filter membrane loaded with TiO 2 NSs/TCPP catalyst was dried at 80 C for 12 h in air. The photocatalytic reduction of CO 2 was evaluated in gas-closed circulation system (Perfect Light Company, Beijing, China) using a glass reactor.The reactor was made of borosilicate glass with an optical quartz window (diameter, 9 cm; thickness, 8 mm) at the top.The scheme and photo of the glass reactor is shown in Fig. S2.The reactor is equipped with sealing valves and an opening sealed with a silicone rubber stopper.After the filter membrane loaded with catalysts was suspended in the reactor, the reactor was installed in the photocatalytic system.After that, 5 mL mixed solution of acetonitrile (MeCN) and triethanolamine (TEOA) with volume ration of 4:1 were injected into the reactor.Prior to the illumination, the reactor was vacuumed and replenished with CO 2 (99.999) three times, and then was filled with 70 kPa high purity CO 2 , followed by purging for 40 min to establish an adsorption/desorption equilibrium.A 300 W Xe lamp (Microsolar 300) with a UV cut-off filter ( 420 nm) was used as the visible-light source, and the distance between the light source and filter membrane was 4.5 cm.Cooling water was employed to keep the reaction temperature at 30 C.The experiment was started when the light was on.The generated products were collected at the opening of the reactor sealed by a silicone rubber septum using an injection syringe.The gas products were analyzed by gas chromatography (GC, GC 2014C) to determine the catalytic efficiency.A series of control experiments (without catalysts, dark experiment without illumination, using Ar instead of CO 2 ) were also performed.The isotope test using 13 C was carried out on a Hiden HPR20 mass spectrometer (Hiden real-time Gas Analysis, UK) using Faraday MID mode."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The illustration of the synthesis of TiO 2 NSs/TCPP is shown in Scheme 1.The TiO 2 NSs/TCPP products were fabricated using a traditional impregnation method.After TCPP was added into the dispersion of the TiO 2 NSs, the TCPP was anchored on the surface of the TiO 2 NSs due to the interaction of the carbonyl group of TCPP and the Ti atom of TiO 2 NSs.TEM and HRTEM studies were performed to investigate the structure and composition of the TiO 2 NSs, TiO 2 NSs/TCPP and spatial distribution of the TCPP on the TiO 2 NSs matrix.As shown in Fig. 1a, the TiO 2 NSs products are well-defined single sheet-shaped structures with a rectangular outline.The average edge length of the TiO 2 NSs is in the range from 60 to 100 nm and the thickness is about 5 nm.It can be observed that the clear lattice fringes are 0.237nm (Fig. 1b), corresponding to the d spacing between the (0 0 1) planes of anatase TiO 2 .There is no obvious difference in the morphology between the pure TiO 2 NSs and TiO 2 NSs/TCPP (Fig. 1c).The STEM-EDX elemental maps demonstrate that the N atoms are homogeneously distributed on the surface of the TiO 2 NSs, indicating the successful loading of the TCCP on the TiO 2 NSs (Fig. 1d-g). To investigate the combination of the TiO 2 NSs and TCPP, the TiO 2 NSs/TCPP products were first characterized by XRD, UV-vis-DRS and FTIR.According to the XRD patterns of TiO 2 NSs and TiO 2 NSs/TCPP (Fig. 2a), the diffraction peaks of the TiO 2 NSs correspond well with the anatase-phase TiO 2 (JCPDS No. 21-1272).After the TCPP was loaded on the TiO 2 NSs, the characteristic diffraction peaks of TiO 2 NSs/TCPP show no difference compared with those of the TiO 2 NSs.The reason may be due to the low loading amount of the TCPP and the weak crystallinity of TCPP.The XRD results indicate that the modification of TCPP on the surface of TiO 2 NSs has little effect on the crystal structure of anatase TiO 2 .The UV-vis-DRS spectra were measured in the range of 250-800 nm in order to investigate the optical response of TiO 2 NSs and TiO 2 NSs/TCPP.Fig. 2b shows the UV-vis-DRS spectra of the TiO 2 NSs, TCPP and TiO 2 NSs/TCPP.The typical absorption band below 400 nm in the spectra of pristine TiO 2 NSs was observed, which should be ascribed to the electronic interband transition in TiO 2 (optical band gap 3.2 eV).The introduction of TCPP obviously affected the light absorption characteristics of TiO 2 .Compared to the spectra of pristine TiO 2 NSs with a single peak, a strong absorption peak at 430 nm appeared in the spectra of TiO 2 NSs/TCPP.This strong peak corresponds well with the Soret band absorption peak of the TCPP, which results from the transition of a 1u () to e g ().The Soret band absorption intensity of the TiO 2 NSs/TCPP is lower than that of TCPP.In addition, the Soret band of the TiO 2 NSs/TCPP shows slight red shift compared with that of TCPP, indicating well-defined assemblies of the TCPP units and noncovalent bonding or interactions between the TCPP and TiO 2 NSs 32,33.The Q bands of the TiO 2 NSs/TCPP are harder to detect due to their much smaller molar extinction coefficient than that of the Soret band.As such the scanning wavelength range is intensified to 450-750 nm to investigate the Q bands of the products (inset image in Fig. 2b).Peaks with lower intensities at 511 nm, 545 nm, 587 nm and 643 nm are observed in the magnified UV-vis-DRS spectra, which are due to the Q bands corresponding to the a 2u ()-e g () transition 34.These Q-band absorption peaks indicate the absorption region of the TiO 2 NSs has expanded into the visible region 35,36.The UV-vis-DRS spectra results prove that the TCPP was impregnated onto the surface of TiO 2 NSs.As a result, the TiO 2 NSs/TCPP exhibited broad visible-light absorption in comparison with TiO 2 NSs. The FT-IR spectra were also used to investigate the interaction between TiO 2 and TCPP (Fig. 2c andd).The peaks at 3415 cm -1 and 1625 cm -1 can be attributed to the stretching and bending vibrations of TieOH groups on the surface of TiO 2 .The broad peaks ranging from 1000 to 500 cm -1 can be subjected to stretching vibrations from the TieO bond.The peak located at near 3320 cm -1 is due to the stretching vibrations of the NeH bond in the TCPP, and the broad absorption peak around 3420 cm -1 is attributed to the stretching vibrations of OeH.Peaks appeared around 2900 cm -1 are linked with structural vibrations of CeH, and peaks located at near 1725 cm -1 and 1400 cm -1 are attributed to the structural vibrations of CO and CC bonds of the TCPP 36.The corresponding signals of TiO 2 NSs/TCPP are in accordance with most of those of TiO 2 and TCPP, indicating that TCPP has been successfully combined with TiO 2 NSs.Compared to those of the TiO 2 and TCPP, the peak of bending vibrations of Ti-OH around 1625 cm -1 almost vanishes, and the peaks around 1725 cm -1 and 1400 cm -1 are red-shifted.This is attributed to an esterification reaction and the hydrogen bond interaction between the hydroxyl group from the TiO 2 NSs and the carbonyl group from the TCPP 373839.The TCPP was chemisorbed on the surface of TiO 2 NSs via the TieOeCO bond, which is beneficial to the electron transfer between TCPP and Ti (3d) orbital manifold of TiO 2 404142.Also, the polar groups of CO and CeOeTi groups can cause the asymmetric electron structure, which is important for improvement of the photocatalytic activity 43. XPS spectra results of the TiO 2 NSs/TCPP reveal the surface composition changes after loading of the TCPP.Fig. 3a presents the survey spectra of the as-synthesized product.The survey spectrum shows that the product is composed of Ti, O, N and C, which agrees with the results of the STEM-EDX elemental maps.Fig. 3b shows Ti (2p) XPS spectra of the TiO 2 NSs and TiO 2 NSs/TCPP.Two intense peaks at 464.6 eV and 458.8 eV in the Ti (2p3/2) and Ti (2p3/2) binding energy region of TiO 2 NSs/TCPP were observed.Compared with that of the pure TiO 2 NSs, the Ti (2p1/2) and Ti (2p3/2) binding energy value of TiO 2 NSs/ 11.5 TCPP shows slight shifts toward high energy by 0.15 eV and 0.20 eV, respectively.This shift indicated the electronic interaction of TCPP with TiO 2 NSs, which was beneficial to the electron transfer at the heterojunction interface 44.Before the TiO 2 NSs was sensitized by TCPP, the Ti atom as an electron acceptor coordinates the O atom of the hydroxyl group (eOH) in the TiO 2 NSs 454647.When the TCPP is introduced to the surface of the TiO 2 NSs, the Ti atom of TiO 2 NSs begins to accept electrons from the O atom of the carbonyl group (eOeCO) of TCPP.Therefore, the Ti atom of TiO 2 NSs binds to the carbonyl group instead of H atom, and parts of the TieOeH bonds are replaced by the TieOeCO bonds 48,49.Compared with the eOH group, the eOeCO as a stronger electron acceptor tends to withdraw electrons from O atoms and increase the valence of the Ti atom.Then the density of the layer electron cloud of the Ti atom is decreased and the binding energies of the Ti (2p3/2) and Ti (2p3/2) are increased (Fig. 3b) 505152.As shown in high-resolution C1s spectra (Fig. S3), the three peaks of 288.5, 285.7, and 284.5 eV can be attributed to the C O, CeO, and CeC bonds in the TCPP 50.The peaks at 531.5 eV and 529.9 eV in the O1s binding energy region of TiO 2 NSs/TCPP were observed, corresponding to eOH species and lattice oxygen (Fig. 3c).In addition to the main peaks corresponding to Ti and O, there is also a peak attributed to the N of TCPP (Fig. 3d).The XPS results further confirmed the interaction between the TiO 2 NSs and TCPP was due to the weak chemisorptions, as seen in the FTIR spectra. A series of TiO 2 NSs/TCPP products with different loading amounts of TCPP were synthesized to investigate the influence of the combination of TCPP and TiO 2 NSs on the photocatalytic activity of CO 2 reduction.To confirm the precise loading amount of TCPP in TiO 2 NSs/ TCPP, the thermal decomposition behavior of the products was investigated by thermogravimetric experiments (Fig. S4).All of the TiO 2 NSs/TCPP composites exhibited good thermal stability with resistance to degradation up to 400 C.Based on the TG curve, there is only a slight weight change of 6.34 from room temperature to 1000 C in the TGA curve for TiO 2 NSs.For TiO 2 NSs/TCPP, obvious weight losses of the products with different loading amount of TCPP were believed to be attributed to the decomposition of the TCPP.As the loading amount of TCPP increased, the total weight loss of TiO 2 NSs/TCPP also increased.Combined with the weight losses of the TiO 2 NSs and TCPP, the loading amount of TCPP in TiO 2 NSs/TCPP products were calculated to be 2.6, 8.0, 11.5, 15.2 and 22.4, respectively.The XRD, FTIR and UV-vis-DRS characterization of these products demonstrated the successful loading of the TCPP (Figs.S5-S8). The photocatalytic reduction of the CO 2 performance of TiO 2 NSs/ TCPP with varying amounts of loaded TCPP, pure TiO 2 NSs and TCPP were evaluated in our gaseous photocatalytic system (Table 1, entry 1-7).The photocatalytic CO 2 reduction experiments were conducted under visible-light (wavelength 420 nm) irradiation in a MeCN solvent with TEOA as the sacrificial electron donor.The CO 2 photoreduction experiment was initially performed using either pure TiO 2 NSs or TCPP as catalysts.Under these conditions, TCPP shows almost no activity, while the TiO 2 NSs only shows poor activity on the photoreduction of CO 2 to CO (3.72 mol g -1 h -1 ).Compared to pure TiO 2 NSs and TCPP, all the TiO 2 NSs/TCPP with different TCPP loadings show significantly improved performance.After irradiation under visible light for 12 h, two-electron reduction product CO and eightelectron reduction product CH 4 are detected from the CO 2 photoreduction system using TiO 2 NSs/TCPP as catalysts, and the production of the CO is much higher than that of the CH 4 .As shown in Fig. 4a, as the loading amount of the TCPP increases, the yield of the CO gradually increases.When the loading amount of the TCPP in the TiO 2 NSs/TCPP composite reaches 11.5, the evolution yield of CO reaches its maximum.The TiO 2 NSs/11.5 TCPP composite shows the best catalytic performance with a CO evolution rate of 141.74 mol g -1 h -1 , which is more than 37 times higher relative to the pristine TiO 2 NSs material, demonstrating the superiority of this novel hybrid in photocatalytic CO 2 reduction.However, further increasing of the loading amount of TCPP results in reduced catalytic performance.The results indicate that too little or excessive TCPP loading cannot efficiently enhance the photocatalytic reduction CO 2 performance, and the optimal loading amount is 11.5.When a simple mixture of TiO 2 NSs and TCPP was used as the catalyst, the photocatalytic CO 2 reduction performance was much poorer than that of the TiO 2 NSs/11.5 TCPP (Fig. S9).The CO evolution rate was only 6.10 mol g -1 h -1 and no CH 4 was detected, indicating that the combination of the TiO 2 NSs and TCPP contributes significantly to the excellent photocatalytic CO 2 reduction activity.The time courses for the yields of CO and CH 4 are depicted in Fig. 4b.The amounts of CO gradually increase for around 12 h, but the amounts of CH 4 are almost unchanged after 1 h.For the TiO 2 NSs/11.5 TCPP catalyst, the generation of CO shows a limited increasing trend with the increase of the reaction time.Since the reaction is kept in a closed system, the reduction products of the CO 2 would accumulate and the oxidized TCPP cannot be regenerated efficiently, and the TEOA is also gradually consumed as the reaction time increases.As such the generation rate of CO increases sharply for the first two hours, and levels off afterwards.For both the CO and CH 4 that were produced, the total consumed electron number (TCEN) was introduced to evaluate the photocatalytic reduction of CO 2 performance.It can be seen that the TiO 2 NSs/11.5 TCPP shows much higher activity than other TiO 2 NSs/TCPP products, pure TiO 2 NSs and TCPP (Fig. 4c).The TCEN reached 408.8 mol g -1 h -1 , which is higher than that of the reported results (Table 2).The stability of TiO 2 NSs/11.5 TCPP was also tested, and no noticeable change was observed after three cycling tests.The yield of the CO still retained 80 the yield from the first cycle (Fig. S10). In addition, the carbon origin of CH 4 and CO generated from the photocatalytic CO 2 reduction experiments was further confirmed by a 13 C-labeled isotopic experiment using 13 CO 2 as the substrate under the same experimental conditions.The reduction products of CO and CH 4 were identified by gas chromatography-mass spectrometry (GC-MS), as shown in Fig. 4d.The peaks in the GC spectrum with m/z 29 and m/ z 17 were assigned to 13 CO and 13 CH 4 , respectively.The results provide evidence that the carbon source of 13 CO and 13 CH 4 completely stemmed from the reductive 13 CO 2 .To definitively prove the role of the TiO 2 NSs/TCPP catalysts in the photocatalytic system, several contrast experiments were conducted (Table 1, entry 8-10), including (i) blank experiments in the absence of a catalyst; (ii) experiments performed using TiO 2 NSs/11.5TCPPas a catalyst under dark conditions; (iii) irradiation of the TiO 2 NSs/11.5TCPPwith visible light in an argon atmosphere instead of CO 2 .No reaction product of CO and CH 4 were detected in all the contrast experiments.If the TiO 2 NSs/11.5 TCPP was removed from the reaction system, the CO 2 reduction reaction was terminated.No evolution of CO and CH 4 was detected in the dark, indicating this reaction is truly light-driven photocatalytic reaction.These results demonstrate that TiO 2 NSs/TCPP plays a crucial role for harnessing light to drive the reaction.When using high purity Ar to replace CO 2 to perform the reaction under identical conditions, no evolution of CO and CH 4 can be detected, confirming the carbon atoms of CO and CH 4 are not derived from inorganic or organic residues adsorbed on the surface of photocatalyst. To understand the enhanced CO 2 photoreduction performance of TiO 2 NSs/TCPP, the sample was characterized by steady-state and timeresolved transient PL spectra.The steady-state PL spectra was measured to investigate the recombination of the photo-generated electron-hole After the TCPP was loading on the TiO 2 NSs, the intensity of the three broad-band peaks diminished dramatically, indicating that the quenching of the excited electrons was effectively suppressed (Fig. 5a).Meanwhile, the specific charge carrier dynamics of TiO 2 NSs/11.5 TCPP were also investigated by time-resolved PL spectroscopy (Fig. 5b). The average PL lifetime can be considered as an indicator to estimate the separation efficiency of photo-induced electron-hole pairs.PL lifetime analysis demonstrates the average emission lifetime of TiO 2 NSs/ 11.5 TCPP (7.936 ns) is longer than that of the TiO 2 NSs (3.094 ns) (Table S1).The obvious suppression of PL quenching and the extension of average PL lifetime indicates the formation of an electrontransfer pathway from TCPP to TiO 2 NSs in a nonradiative quenching manner.Therefore the loading of the TCPP can effectively enhance the interfacial charge migration and separation as well as inhibit the recombination of photo-generated electron-hole pairs in the photoreduction system, leading to the superior electron transfer ability of TiO 2 NSs/11.5 TCPP and high photocatalytic efficiency.The results correspond to the FTIR and XPS results, which confirm the connection of the carboxyphenyl group in TCPP and TiO 2 NSs.Previous research has reported that the carboxyphenyl group facilitates the electron injection to the CB of the semiconductor 58.In the TiO 2 NSs/11.5 TCPP products, the light-induced electrons (e -) of TCPP is easily transferred to the conduction band of TiO 2 NSs, which is in favor of enhancing the CO 2 photoreduction efficiency.That can be explained by good heterojunction interface electron transfer and the efficient separation of electron-hole pairs that occur among them. To further investigate the influence of TCPP on the charge separation efficiency of TiO 2 NSs, transient photocurrent spectra and electrochemical impedance spectra (EIS) of a pure TiO 2 NSs or TiO 2 NSs/ 11.5 TCPP composite dripped onto the FTO electrodes was measured, as shown in Fig. 5c andd.The current intensity increased rapidly when the light was turned on and remained at a relative constant value, and instantaneously decreased when the light was turned off.Obviously, the transient photocurrent spectra show that TiO 2 NSs/11.5 TCPP exhibits a greatly enhanced photocurrent over TiO 2 NSs (Fig. 5c), indicating that the generation and transfer of photogenerated electronhole pairs of TiO 2 NSs can be effectively promoted.EIS of pure TiO 2 NSs and TiO 2 NSs/TCPP were characterized to investigate transfer properties of photoexcited charge carriers and photoelectrochemical performance (Fig. 5d).The EIS results reveal that the semicircle in Nyquist plots of the TiO 2 NSs/TCPP is much smaller than that of the TiO 2 NSs, suggesting a lower charge-transfer resistance in the hybrids that benefits the transfer and separation of photo-induced carriers.All these results demonstrate that the TiO 2 NSs/TCPP hybrids can enhance the generation, interfacial charge migration and separation of photoinduced charges and inhibit the recombination of photo-generated electron-hole pairs, thus enhancing the efficiency of CO 2 photoreduction. In order to understand the mechanism underlying the photocatalytic activity of this TiO 2 NSs/TCPP hybrid, EPR measurement was also carried out to investigate the trapped electrons and interface states in the hybrid structure.The TiO 2 NSs has no characteristic EPR resonances with or without irradiation.While the paramagnetic absorption signal with the g value of 2.003 is detected for TiO 2 NSs/11.5 TCPP, indicating the existence of Ti 3 in the hybrid product.With visible-light illumination, TiO 2 NSs/11.5 TCPP shows enhanced intensity compared with that in dark, suggesting a greater generation of Ti 3 ions 17.The Ti 4 ions are efficiently reduced to Ti 3 during the photocatalytic process due to the improved visible-light absorption ability and efficient photo-generated charge separation of TiO 2 NSs/11.5 TCPP.All these results clearly show that the TCPP can serve as a photosensitizer for solar-light harvesting and then transfer the photogenerated electrons from the CB of the TCPP to the active sites in TiO 2 NSs 59. Based on the above experiment results, a possible reaction mechanism for photocatalytic CO 2 reduction using TiO 2 NSs/TCPP was proposed (Fig. 6).Under visible light irradiation, the electron-hole pairs were generated on the TCPP, and the light-induced electrons (e -) migrated to the conduction band of TCPP.Since the carboxyphenyl group of TCPP provides an electron transfer channel and the CB of TiO 2 (0.5 V vs. NHE) 60 is higher than the negative LUMO of TCPP, the electrons of the TCPP can easily transfer to the CB of TiO 2 and interact with the CO 2 molecule that was adsorbed on the surface of the TiO 2 .As the CB of TiO 2 possesses higher value than the reduction potentials of CO 2 /CH 4 (0.24 V) and CO 2 /CO (0.48 V), then the photocatalytic CO 2 reduction process occurs.At the same time, the light-induced holes (h ) are quenched by the sacrificial electron donor of TEOA.The processes can be described briefly in the following equations.(2) The combination of TCPP with the TiO 2 NSs plays significant role for enhancing the photocatalytic CO 2 reduction efficiency.The TCPP works as the light-harvesting unit to generate light-induced electronhole pairs, the connection between TCPP and TiO 2 facilitates the electron injection to the CB of TiO 2 as well as inhibits the recombination of photo-generated electron-hole pairs, TiO 2 NSs with the highly active (0 0 1) facets works as the reaction site to efficiently convert the CO 2 molecule adsorbed on the surface into CO and CH 4 products.Normally, the CO 2 molecules are more different converted to CH 4 than CO on the surface of photocatalysts.The adsorbed CO 2 molecules need to accept eight electrons and eight protons to break the CeO bonds and form new CeH bonds.So CO is widely reported as a CO 2 reduction product 20.For TiO 2 NSs/TCPP, good heterojunction interface electron transfer and the efficient separation of electron-hole pairs favors the multi-electron reduction process, which promotes the generation of CO 4 product 44.The TECN shows an obvious increasing trend as the TCPP loading increases from 2.6 to 11.5, and then decreases upon further increase of the loading amount of TCPP.Once 11.5 TCPP is loaded, TiO 2 NSs/ 11.5 TCPP shows the highest TECN of 408.8 mol g -1 h -1 , which is nearly 55 times higher than that of TiO 2 NSs.Further increase of the TCPP loading leads to a significant decrease in the TCEN.The reason can be ascribed to the increasing agglomeration of the TCPP on the surface of the TiO 2 NSs, which promotes back electron transfer within the porphyrin agglomerates and subsequently leads to the inefficient injection of light-induced electrons from TCPP to CB of TiO 2 .The thicker TCPP layer also inhibits the interaction of the CO 2 molecule with the highly active TiO 2 NSs, which leads to a decrease in the activity of the TiO 2 NSs/TCPP.As such, the photocatalytic CO 2 reduction efficiency of the TiO 2 NSs/TCPP does not consistently increase with the increase of the TCPP loading beyond 11.5, which is the optimal TCPP loading level."
  },
  {
    "title": "Conclusions",
    "content": "In conclusion, nanohybrid photocatalysts of TiO 2 NSs/TCPP were prepared using a simple self-assemble approach for photoreduction of CO 2 under visible light irradiation.The loading of the TCPP greatly enhanced the photocatalytic efficiency by helping harvest of the light, injection of light-induced electron from TCPP to CB of TiO 2 NSs, and inhibition of the recombination of electron-hole pairs.The influence of the TCPP loading on the formation rate of the photoreduction products was investigated, and optimal TCPP amount is determined to be 11.5.TiO 2 NSs/11.5 TCPP shows the highest CO evolution rate of 141.74 mol g -1 h -1 , which is much higher than that of most reported catalysts.Although the stability of TiO 2 NSs/TCPP needs further improvement, the present results provide an important indication about the effect of TCPP on the photocatalytic CO 2 conversion, which should inspire more ingenious designs for catalyst with high CO 2 photoreduction efficiency. Scheme1.Illustration of the synthesis of TiO 2 NSs/TCPP. Fig. 1.(a) TEM and (b) HRTEM images of TiO 2 NSs.(c) TEM, (d) STEM and (d-g) corresponding EDS mapping images of Titanium, Oxygen and Nitrogen elements of the TiO 2 NSs/11.5TCPPproducts. Fig. 2. (a) XRD patterns of TiO 2 NSs and TiO 2 NSs/TCPP.(b) UV-vis-DRS and (c) FTIR spectra of TiO 2 NSs, TCPP and TiO 2 NSs/11.5TCPP.(d) Magnified FTIR spectra of TiO 2 NSs, TCPP and TiO 2 NSs/11.5TCPP in wavenumber ranges from 1000 to 1800 cm -1 . Fig. 3. (a) Full XPS spectra of TiO 2 NSs/11.5TCPP.(b) XPS spectra Ti 2p regions of TiO 2 NSs and TiO 2 NSs/11.5TCPP.(c-d) High resolution XPS spectra of the O 1s and N 1s regions for TiO 2 NSs/11.5TCPP.Inset images in Fig. 3c-d show the comparison of O 1s and N 1s regions between TiO 2 NSs and TiO 2 NSs/11.5TCPP. Reaction conditions: Catalysts (20 mg), solvent (4 ml, MeCN), TEOA (1 mL), CO 2 (70 KPa), visible light ( 420 nm), 30 C, 12 h.b TECN (8 C CH 4 2 C CO ) V rea /m cat T, C CH 4 and C CO refer to the concentration of produced CH 4 and CO, V rea refers to the volume of the reactor, m cat refers to the mass of the catalyst, and T refers to the reaction time.c Without catalysts.d In the dark.e Using Ar instead of CO 2 . Fig. 4. (a) Photocatalytic CO 2 reduction performance over different catalysts.(b) Time-yield plots of CO and CH 4 over TiO 2 NSs/11.5 TCPP.(c) TCEN value for the CO 2 photoreduction over different catalysts.(d) Results of GC-MS analysis of the CO and CH 4 generated from the 13 CO 2 isotope experiments. Fig. 5. (a) Steady-state PL spectra of TiO 2 NSs, TCPP and TiO 2 NSs/11.5TCPP at room temperature.(b) Time-resolved PL spectra, (c) transient photocurrent response and (d) EIS Nyquist plots of TiO 2 NSs and TiO 2 NSs/11.5TCPP. Fig. 6.The possible mechanism of CO 2 photoreduction over the TiO 2 NSs/ TCPP. The CO 2 photoreduction performance over different catalysts under visible light irradiation.aCatalyatsFormationrate of CH 4 (mol g -1 h -1 ) Formation rate of CO (mol g -1 h -1 ) TECN b (mol g -1 h -1 ) Comparison of the activity of TiO 2 /11.5TCPP in the photocatalytic CO 2 reduction with the catalysts recently reported. We thank National Key Research Development Program of China (No. 2016 YFB0701100), National Natural Science Foundation of China (51702013, 51572002 and 51872005), \"13th 5-year-plan\" advanced research on equipment of the Equipment Development Department (6140A64020116QT02001) and the Fundamental Research Funds for the Central Universities (FRF-BD-18-013A) for financial support. The manuscript was written through contributions of all authors.All authors have given approval to the final version of the manuscript. Supplementary data to this article can be found online at https:// doi.org/10.1016/j.cej.2019.06.002."
  }
]