[
  {
    "title": "Doi",
    "content": "10.1039/c6fd00215c"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic CO<sub>2</sub> reduction using water as an electron donor by a powdered Z-scheme system consisting of metal sulfide and an RGO–TiO<sub>2</sub> composite"
  },
  {
    "title": "Abstract",
    "content": "CuGaS 2 , (AgInS 2 ) x -(ZnS) 2A2x , Ag 2 ZnGeS 4 , Ni-or Pb-doped ZnS, (ZnS) 0.9 -(CuCl) 0.1 , and ZnGa 0.5 In 1.5 S 4 showed activities for CO 2 reduction to form CO and/or HCOOH in an aqueous solution containing K 2 SO 3 and Na 2 S as electron donors under visible light irradiation.Among them, CuGaS 2 and Ni-doped ZnS photocatalysts showed relatively high activities for CO and HCOOH formation, respectively.CuGaS 2 was applied in a powdered Z-scheme system combining with reduced graphene oxide (RGO)incorporated TiO 2 as an O 2 -evolving photocatalyst.The powdered Z-scheme system produced CO from CO 2 in addition to H 2 and O 2 due to water splitting.Oxygen evolution with an almost stoichiometric amount indicates that water was consumed as an electron donor in the Z-schematic CO 2 reduction.Thus, we successfully demonstrated CO 2 reduction of artificial photosynthesis using a simple Z-scheme system in which two kinds of photocatalyst powders (CuGaS 2 and an RGO-TiO 2 composite) were only dispersed in water under 1 atm of CO 2 ."
  },
  {
    "title": "Experimental",
    "content": "Preparation of metal sulde photocatalysts CuGaS 2 , 35 Cu 2 ZnGeS 4 , 32 CuGa 5 S 8 , 34 CuGa 2 In 3 S 8 , 33 AgGaS 2 , 31,36 (AgInS 2 ) x -(ZnS) 2A2x (x 14 0.1 and 0.22), 30 Ag 2 ZnGeS 4 , 32 Ni-or Pb-doped ZnS, 28,29 Zn 1Ax Cu x Ga 2 S 4Ax/2 , 34 Cu 3 NbS 4 , 37 Cu 3 TaS 4 , 37 (ZnS) 0.9 -(CuCl) 0.1 , 37 BaLaCuS 3 , 37 ZnIn 2 S 4 , 37 ZnGa 0.5 In 1.5 S 4 , 37 and MnGaInS 4 (ref.37) were prepared by solid-state reaction and precipitation methods according to previous reports.Obtained samples were identied by X-ray diffraction (Rigaku; MiniFlex, Cu Ka).Diffuse reectance spectra were obtained by a UV-vis-NIR spectrometer (JASCO, V-570) equipped with an integrating sphere and were converted to absorbance by the Kubelka-Munk method. An RGO-incorporated TiO 2 photocatalyst (denoted as RGO-TiO 2 composite) was prepared by photocatalytic reduction of graphene oxide using TiO 2 according to a previous report. 24The powders of GO prepared by Hummers' method 38 and rutile TiO 2 (Kojundo; 99.99) were dispersed in an aqueous methanol (Kanto; 99.8) solution (50 vol).The suspension was irradiated with UV light from a 300 W Xe-lamp (PerkinElmer; CERMAX PE300BF) under 1 atm of N 2 atmosphere to obtain an RGO-TiO 2 composite.The methanol was carefully removed by washing with water.The RGO-TiO 2 composite was collected by ltration and was dried at room temperature in air. CO 2 reduction using sacricial reagents was conducted using a batch-type topirradiation cell with a Pyrex window under 1 atm of CO 2 gas (99.995).Metal sulde photocatalysts were dispersed in an aqueous solution containing sacricial reagents of 0.05-0.1 mol L A1 Na 2 S (Kanto; 98) and 0.1 mol L A1 K 2 SO 3 (Kanto; 95).A 300 W Xe-lamp was employed as a light source.The wavelength of the irradiation light was controlled to visible light using a cut-off lter (l 420 nm).Products in gas and liquid phases were analyzed using a gas-chromatograph (Shimadzu; GC-8A, MS-5A, TCD, Ar carrier for H 2 and O 2 ; GC-8A, MS-13X, FID with a methanizer, N 2 carrier for CO) and a high performance liquid chromatograph (Shimadzu), respectively. Z-schematic CO 2 reduction was conducted using a gas-ow system with a topirradiation cell with a Pyrex window.CuGaS 2 and an RGO-TiO 2 composite were dispersed in 120 mL of water without any sacricial reagents.CO 2 gas was bubbled into the suspension at about 20 mL min A1 ow rate.The light source was a 300 W Xe-lamp without any cut-off lters (l 330 nm).Products in gas and liquid phases were analyzed using a gas-chromatograph and an ionchromatograph, respectively.An isotope experiment for CO 2 reduction was conducted using 13 CO 2 (99.5 atom).The obtained CO was analyzed using a GC-MS (Shimadzu; GCMS-QP2010 Plus, RESTEK; RT-Msieve 5A)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Sacricial CO 2 reduction over metal sulde photocatalysts under visible light irradiation The CO 2 reduction abilities of metal sulde photocatalysts showing activity for sacricial H 2 production 28293031323334353637 were evaluated under visible light irradiation in an aqueous solution containing Na 2 S and/or K 2 SO 3 as electron donors in the absence of cocatalysts, as shown in Table 1.When CuGaS 2 , (AgInS 2 ) x -(ZnS) 2A2x , Ag 2 ZnGeS 4 , Ni-or Pb-doped ZnS, ZnGa 0.5 In 1.5 S 4 , and (ZnS) 0.9 -(CuCl) 0.1 were used, CO and/or HCOOH were obtained as reduction products of CO 2 in addition to H 2 .Others did not show any activities for CO 2 reduction under the present reaction conditions. CuGaS 2 was the most active photocatalyst for CO formation (Table 1, entry 1).CO and H 2 continuously evolved under visible light irradiation over CuGaS 2 in the presence of K 2 SO 3 , as shown in Fig. 1.The turnover number of reacted electrons used for CO and H 2 formation to S atoms at the surface of CuGaS 2 was calculated to be 32 at 22.5 h.The turnover number larger than unity indicates that this reaction proceeded photocatalytically.HCOOH was also obtained as a reduction product of CO 2 under visible light irradiation in an aqueous solution containing Na 2 S as an electron donor, when an (AgInS 2 ) 0.1 -(ZnS) 1.8 solid solution, Ag 2 ZnGeS 4 , and Ni-or Pb-doped ZnS were used, as shown in Table 1.All photocatalysts that produced HCOOH from CO 2 contained Zn as a component.The Ni-doped ZnS photocatalyst was reported to be active for CO 2 reduction to form HCOOCH 3 in methanol as a nonaqueous solution. 39Additionally, it has also been reported that a non-doped ZnS photocatalyst without loading of a cocatalyst is active for CO 2 reduction to form HCOOH in an aqueous solution containing an electron donor under UV light irradiation.These results suggest that contributions of Zn to the formation of a suitable conduction band and an active site for CO 2 reduction cause the formation of HCOOH.Ni-doped and Pb-doped ZnS, of which the conduction band levels should be similar to that of non-doped ZnS, showed relatively high activities. 41he Ni-doped ZnS was the most active photocatalyst for HCOOH formation (Table 1, entry 16).HCOOH and H 2 continuously evolved under visible light irradiation in the presence of Na 2 S, while CO evolution was negligible, as shown in Fig. 2. The turnover number of reacted electrons used for HCOOH formation of doped Ni atoms in Ni-doped ZnS was calculated to be 71 at 18.5 h.The turnover number larger than unity indicates that the CO 2 reduction to form HCOOH proceeded photocatalytically.Moreover, we have conrmed that non-doped ZnS did not show photocatalytic activity for CO 2 reduction under visible light irradiation (Table 1, entry 15).This indicates that the photocatalytic HCOOH formation from CO 2 proceeded by the photo-excitation of electrons from impurity levels formed with Ni 3d orbitals to a conduction band formed with Zn 4s4p orbitals.None TiO 2 A r 0 0 0 a Catalyst: 0.1 g each, reactant solution: 120 mL of water under 1 atm of CO 2 and Ar, reactor: a gas ow system using a top-irradiation cell made of Pyrex, light source: a 300 W Xe-lamp (l 330 nm).b pH was adjusted to about 4 with H 2 SO 4 . Fig. 3 CO 2 reduction using water as an electron donor over a Z-schematic photocatalyst system consisting of CuGaS 2 and RGO-TiO 2 .Catalyst: 0.1 g each, reactant solution: 120 mL of water under 1 atm of CO 2 , reactor: a gas flow system using a top-irradiation cell with a Pyrex window, light source: a 300 W Xe-lamp (l 330 nm). Thus, band engineering including doping of metal ions, formation of solid solutions, and substitution of metal cations is a useful strategy not only for water reduction to form hydrogen, but also for CO 2 reduction to form CO and HCOOH under visible light irradiation. Various metal sulde photocatalysts for CO 2 reduction under visible light irradiation in the presence of Na 2 S and K 2 SO 3 as electron donors have been developed in the present study as mentioned above.Among them, CuGaS 2 and Nidoped ZnS showed high activities for CO and HCOOH formation, respectively.However, sulde and/or sulte ions were used as electron donors for the CO 2 reduction, because the metal suldes cannot oxidize water to O 2 .We have previously reported a Z-scheme photocatalyst system composed of a metal sulde photocatalyst with a p-type semiconductor character and a reduced graphene oxide (RGO)-TiO 2 and RGO-CoO x /BiVO 4 composites. 24,25In this system, electrons are supplied to the metal sulde photocatalyst from not a sacricial reagent but by the RGO-TiO 2 and RGO-CoO x /BiVO 4 composites on which electrons are extracted from water accompanied by O 2 evolution.TiO 2 is a suitable O 2 -evolving Fig. 4 Reaction scheme of CO 2 reduction on the Z-scheme photocatalyst system consisting of CuGaS 2 and RGO-TiO 2 using water as an electron donor. Fig. 5 Dependence of photocatalytic activity on the ratio of the amount of CuGaS 2 to that of RGO-TiO 2 .Reactant solution: 120 mL of water under 1 atm of CO 2 , reactor: a gas flow system using a top-irradiation cell with a Pyrex window, light source: a 300 W Xe-lamp (l 330 nm). This journal is The Royal Society of Chemistry 2017 Faraday Discuss. photocatalyst for surveying metal sulde-based Z-scheme photocatalyst systems employing an RGO solid-state electron mediator, because TiO 2 possesses higher reduction power than BiVO 4 . 24,25Here, the CuGaS 2 photocatalyst possesses a ptype character and CO 2 reduction activity, as shown in Table 1.Therefore, it is expected that a Z-scheme photocatalyst system composed of CuGaS 2 and RGO-TiO 2 is active for CO 2 reduction using water as an electron donor without any sacricial reagents.Actually, CO 2 reduction to form CO proceeded with water splitting by employing the powdered Z-scheme system composed of CuGaS 2 and RGO-TiO 2 photocatalysts, as shown in Table 2 (entry 1) and Fig. 3.It is noteworthy that O 2 evolution was observed indicating that water was consumed as an electron donor.However, the photocatalytic activity decreased with the reaction time and the ratio of e A /h calculated by the eqn (1) was about 1.3 being beyond unity. e A /h 14 (the numbers of electrons consumed for H 2 and CO formation)/(the numbers of holes consumed for O 2 formation) This is due to partial photocorrosion and hydrolysis of the CuGaS 2 photocatalyst, and detachment of RGO from TiO 2 as have been discussed in previous paper. 24Therefore, the initial activity in the time course should be an intrinsic ability.The combination of CuGaS 2 and TiO 2 without RGO gave small amounts of H 2 and CO formed without O 2 evolution due to photocorrosion (Table 2, entry 2), indicating that RGO was necessary for smooth electron transfer from TiO 2 to CuGaS 2 photocatalysts. 13CO 2 was employed to see the carbon source of produced CO. 12 CO and 13 CO were unexpectedly detected as a reduction product even in an atmosphere of 13 CO 2 (Fig. S1 ).The 12 CO is thought to come from RGO oxidation by the TiO 2 photocatalyst judging from control experiments as shown in Table 2 (entries 3-6).Even under Ar condition, a small amount of CO was detected with water splitting (Table 2, entry 3).The rate of CO evolution under Ar was smaller than that under CO 2 .Small amounts of CO were detected only for RGO-TiO 2 under Ar and CO 2 , but not for TiO 2 under Ar (Table 2, entries 4-6).Although RGO is partially oxidized to form CO by the strong oxidation power of the TiO 2 photocatalyst, CO was also produced from CO 2 molecules over CuGaS 2 as a CO 2 -reducing photocatalyst in the present Z-scheme system.These results derive the scheme as shown in Fig. 4. Zschematic CO 2 reduction proceeds by electron transfer to CuGaS 2 of a CO 2reducing photocatalyst from TiO 2 of an O 2 -evolving photocatalyst through RGO of a solid-state electron mediator using water as an electron donor accompanied by O 2 evolution as a main reaction.However, a part of photogenerated holes in TiO 2 oxidizes RGO to form CO. Here, cocatalysts usually enhance photocatalytic reactions.For instance, an Ag cocatalyst is highly active for CO 2 reduction to CO over metal oxide photocatalysts with wide band gaps. 9-17Therefore, Pt, Ru, Rh, and Ag-cocatalyst materials were loaded on CuGaS 2 (Table S1, entries 2-5).Unfortunately, no effective cocatalysts were found for CO 2 reduction in the present Z-scheme system.The Ag cocatalyst was not effective, probably due to sulfurization of the Ag surface.When Pt and Ru were loaded, water splitting was enhanced 24 even under CO 2 whereas CO 2 reduction was suppressed. In a Z-scheme system, the ratio of reduction-and oxidation-photocatalysts is an important factor that affects the photocatalytic activity.The photocatalytic activity of the present Z-scheme system also depended on the ratio of the amount of CuGaS 2 to that of RGO-TiO 2 , as shown in Fig. 5.The ratio affects the frequency of collision between particles of CuGaS 2 and RGO-TiO 2 , and photon absorption by each particle.CuGaS 2 can absorb a wider spectrum including visible light than RGO-TiO 2 (Fig. S2 ).When the ratio of CuGaS 2 /RGO-TiO 2 is 2, the ratio of e A /h largely deviates from unity.This is probably due to photocorrosion of CuGaS 2 .CuGaS 2 mainly absorbs incident light, and hence shields incident light toward RGO-TiO 2 , resulting in inefficient electron supply from RGO-TiO 2 to CuGaS 2 .When the ratios were 1 and 0.5, the activities of water splitting and CO 2 reduction became higher than those in the case of 2 of the ratio.Thus, sufficient electron supply from an O 2 -evolving photocatalyst is important for the Z-scheme system using a photocorrosive metal sulde photocatalyst."
  },
  {
    "title": "Conclusions",
    "content": "A survey of metal sulde photocatalysts revealed that cocatalyst-unloaded CuGaS 2 , (AgInS 2 ) x -(ZnS) 2A2x , Ag 2 ZnGeS 4 , Ni-or Pb-doped ZnS, (ZnS) 0.9 -(CuCl) 0.1 , and ZnGa 0.5 In 1.5 S 4 have abilities for CO 2 reduction under visible light irradiation in aqueous solutions containing electron donors.Among them, CuGaS 2 was the most active photocatalyst for CO formation.Ni-doped ZnS was the most active photocatalyst for HCOOH production.This is due to the character of Zn contributing to the formation of a suitable conduction band and the active site for CO 2 reduction as seen for a non-doped ZnS photocatalyst.The CO 2 reduction using sacricial reagents is regarded as a half reaction of CO 2 reduction using water as an electron donor.When the half reaction system was combined with an RGO-TiO 2 composite as an O 2 -evolving system, Z-schematic CO 2 reduction proceeded using water as an electron donor accompanied by O 2 evolution in a simple suspension system.A tracer experiment using 13 CO 2 revealed that a part of the CO was formed by oxidation of RGO by a TiO 2 photocatalyst with strong oxidation power.A Z-scheme photocatalyst system is able to employ various kinds of powdered photocatalysts including metal sulde photocatalysts with visible light response.The present work shows the possibility to develop efficient CO 2 reduction systems for articial photosynthesis using powdered photocatalyst materials with water as an electron donor. Fig. 1 CO 2 reduction over CuGaS 2 from an aqueous solution containing K 2 SO 3 as a sacrificial reagent under visible light irradiation.Catalyst: 0.3 g, reactor: a batch-type topirradiation cell with a Pyrex window, light source: a 300 W Xe-lamp with a cut-off filter (l 420 nm), reactant solution: 150 mL of an aqueous solution containing 0.1 mol L A1 K 2 SO 3 under 1 atm of CO 2 atmosphere. Fig. 2 CO 2 reduction over Ni (0.1)-doped ZnS from an aqueous solution containing Na 2 S as a sacrificial reagent under visible light irradiation.Catalyst: 0.2 g, reactor: a batchtype top-irradiation cell with a Pyrex window, light source: a 300 W Xe-lamp with a cut-off filter (l 420 nm), reactant solution: 150 mL of an aqueous solution containing 0.05 mol L A1 Na 2 S under 1 atm of CO 2 atmosphere. CO 2 reduction under visible light irradiation on various metal sulfide photocatalysts in the presence of electron donors a a Catalyst: 0.2-0.3g, reactant solution: 120-150 mL of an aqueous solution containing Na 2 S (0.05-0.1 mol L A1 ) or/and K 2 SO 3 (0.1 mol L A1 ) under 1 atm of CO 2 , reactor: a batch-type topirradiation cell made of Pyrex, light source: a 300 W Xe-lamp with a cut-off lter (l 420 nm).BG: band gap, EG: energy gap. CO 2 reduction using water as an electron donor and the control experiment on CuGaS 2 -(RGO-TiO 2 ) of a Z-scheme photocatalyst system a This journal is The Royal Society of Chemistry 2017 Faraday Discuss.Published on 13 March 2017.Downloaded by Freie Universitaet Berlin on 14/03/2017 16:59:51.View Article Online Published on 13 March 2017.Downloaded by Freie Universitaet Berlin on 14/03/2017 16:59:51.View Article Online This work was supported by JSPS KAKENHI Grant Numbers JP24107001, JP24107004 in Scientic Research on Innovative Areas \"All Nippon Articial Photosynthesis Project for Living Earth (AnApple)\"."
  }
]