[
  {
    "title": "Doi",
    "content": "10.1016/j.jmst.2020.02.062"
  },
  {
    "title": "Article_Title",
    "content": "Step-scheme CdS/TiO2 nanocomposite hollow microsphere with enhanced photocatalytic CO2 reduction activity"
  },
  {
    "title": "Abstract",
    "content": "Converting solar energy into chemical energy by artificial photosynthesis is promising in addressing the issues of the greenhouse effect and fossil fuel crisis.Herein, a novel photocatalyst, i.e.CdS/TiO 2 hollow microspheres (HS), were dedicatedly designed to boost overall photocatalytic efficiency.TiO 2 nanoparticles were in-situ decorated on the inside and outside the shell of CdS HS, ensuring close contact between TiO 2 and CdS.The CdS/TiO 2 HS with abundant mesopores inside of the shell boost the light absorption via multiscattering effect as well as accessible to reactions in all directions.The heterojunction was scrutinized and the charge transfer across it was revealed by in-situ irradiated X-ray photoelectron spectroscopy (ISI-XPS).Ultimately, the charge transfer in this composite was determined to follow stepscheme mechanism, which not only facilitates the separation of charge carriers but also preserves strong redox ability.Benefited from the intimate linkage between CdS and TiO 2 and the favorable step-scheme heterojunction, enhanced photocatalytic CO 2 reduction activity was accomplished.The CH 4 yield rate of CdS/TiO 2 reaches 27.85 mol g -1 h -1 , which is 145.6 and 3.8 times higher than those of pristine CdS and TiO 2 , respectively.This work presents a novel insight into constructing step-scheme photocatalytic system with desirable performance."
  },
  {
    "title": "Experimental",
    "content": "Firstly, monodispersed SiO 2 nanospheres were prepared by Stober method 60.Subsequently, 300 mg of SiO 2 was evenly dispersed into 50 mL of H 2 O by ultrasonication for 30 min.Then, 5 mL of 0.2 M C 4 H 6 CdO 4 2H 2 O and 5 mL of 0.8 M thiourea were dropped consecutively into the above SiO 2 suspension with stirring for 30 min.Then, the mixture was transferred into a 90 mL of sealed Teflon-lined stainless steel autoclave at 140 C for 12 h.After cooling down to room temperature, the sediment was washed by deionized water three times and then added into 50 mL of 0.5 M NaOH solution at 80 C for 4 h.Finally, CdS HS was obtained by washing with deionized water three times and drying at an oven at 80 C for 12 h. Firstly, 72 mg of CdS HS were dispersed into 50 mL of absolute ethyl alcohol by ultrasonication for 10 min.Afterward, a certain amount of tetrabutyl titanate was added drop by drop into CdS HS suspension with stirring for 12 h.The obtained sediments were dispersed into 50 mL of deionized water, and then the mixture was added into 90 mL of sealed Teflon-lined stainless steel autoclave kept at 170 C for 12 h.After cooling down to room temperature, CdS/TiO 2 HS was obtained.The CdS/TiO 2 HS with various molar ratios were obtained by adding 85, 170 and 340 L tetrabutyl titanate, which were marked as CdS/TiO 2 2:1, 1:1 and 1:2, respectively.TiO 2 NPs were obtained under the same experimental condition in the absence of CdS HS."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The preparation processes are sketchily outlined in Fig. 1(a).Firstly, CdS HS were fabricated by a sacrificial template-assisted approach.When monodispersed SiO 2 nanospheres were dispersed into deionized water, the outward SiO 2 molecules will hydrate with water to form H 2 SiO 3 .With the hydrolysis of H 2 SiO 3 , external HSiO 3 -made SiO 2 nanospheres negatively charged (Fig. S1 in the Supplementary Material).When cadmium acetate was added, acetate ions promoted the hydrolysis of H 2 SiO 3 , leading to the increased negative charge of SiO 2 nanospheres.This facilitates the adsorption of Cd 2 ions on the surface of SiO 2 nanospheres.Subsequently, when thiourea is added, the amine groups of thiourea will coordinate with cadmium ions, and further adsorb on the SiO 2 surface.Then, when the temperature increases, the thiourea begins to decompose with the release of S 2-, and the CdS nuclei will insitu form on the SiO 2 surface and eventually grow to be SiO 2 CdS.After the SiO 2 core was removed by NaOH solution, CdS HS were obtained.The CdS HS is negatively charged (Fig. S1 in the Supplementary Material).When the ethanol solution of tetrabutyl titanate (TBOT) is added, the Ti 4 ions of TBOT will permeate into the shell of CdS HS and absorb around the CdS nanocrystals.With the hydrolysis of TBOT, the TiO 2 nuclei will in-situ form around the CdS nanocrystals.The TiO 2 nuclei will further grow to be TiO 2 NPs under hydrothermal conditions.In this way, TiO The shapes of elemental mappings of all elements correspond well with the geometric shape of CdS/TiO 2 HS, illustrating that TiO 2 NPs integrates evenly with CdS nanocrystals.XRD measurements were employed to identify the phases of all the samples.In Fig. S2 in the Supplementary Material, the diffraction peaks of the black curve can be well-indexed into the hexagonal CdS (JCPDS No. 75-1545).Three sharp diffraction peaks of the red curve at 25.16 , 37.92 and 47.92 , can be readily assigned to anatase TiO 2 (JCPDS No. 73-1764).The result is consistent with the previous HRTEM results.As for the CdS/TiO 2 HS, the characteristic peaks of pristine CdS and TiO 2 are distinctive.Further, with the content of TiO 2 increasing in the precursors, the diffraction peaks belonging to TiO 2 gradually intensify, indicating that the amount of TiO 2 NPs increase.Meanwhile, no obvious shift is observed in the diffraction peaks of CdS/TiO 2 composites compared with those of pristine CdS and TiO 2 , implying the crystal structure of each component was well maintained in the preparation process.Besides, no unmatched peaks are observed, suggesting a high purity of the sample.The actual molar ratios of Cd/Ti in CdS/TiO 2 2:1, 1:1 and 1:2 obtained by inductively coupled plasma-optical emission spectrometry (ICP-OES) are 1.55, 0.92 and 0.36, respectively.The result demonstrates that a slight deviation exists between the actual and theoretical molar ratio.For the sake of convenience, the theoretical molar ratio is chosen when referring to the samples. The light absorption of CdS HS, TiO 2 and CdS/TiO 2 HS with various molar ratios was evaluated by UV-vis diffuse reflectance spectroscopy (DRS) in Fig. S3(a) in the Supplementary Material.The DRS spectra of neat CdS HS and TiO 2 show absorption edge at 575 nm and 390 nm, respectively.By contrast, DRS spectra of CdS/TiO 2 composites merge the optical properties of each component together, suggesting the successful integration of TiO 2 NPs and CdS nanocrystals.Besides, the absorption edges of the composites with various molar ratios display no obvious shift, which discloses that the integration of TiO 2 NPs and CdS nanocrystals do not change the original crystal structure or bandgap of each component 62. Meanwhile, with the content of CdS increasing, CdS/TiO 2 HS show improved visible light absorption.This is expected owing to the inherent optical attributes of CdS.The bandgap of CdS and TiO 2 was determined to be 2.27 and 3.04 eV, respectively, calculated from Eq.(1) (Fig. S3(b) in the Supplementary Material) 28. where , h , A, and E g stand for the absorption coefficient, photon energy, constant, and bandgap of semiconductor, respectively.Besides, n 1 for CdS, a direct semiconductor, and n 4 for TiO 2 , an indirect semiconductor.Further, the valence band maximum (VBM) can be estimated from the XPS valence band spectra (Fig. S3(c) in the Supplementary Material).The VBM is 1.67 eV for CdS and 2.66 eV for TiO 2 (V vs. NHE).Conduction band minimum (CBM) can be estimated from Mott-Schottky plots (Fig. S3(d) in the Supplementary Material).The positive slopes in Fig. S3(d) in the Supplementary Material demonstrate that both CdS and TiO 2 are classified to be n-type semiconductors.And for n-type semiconductors, CBM can be represented by flat band potential.The flat band potential is not affected by disturbance frequency because it is the inherent nature of a semiconductor 63.Therefore, a set voltage with various disturbance frequencies (1-3 kHz) was applied to determine the flat band potential 11.Consequently, CBM is determined to be -0.60 eV for CdS and -0.38 eV for TiO 2 (V vs. NHE). The specific surface area and porosity of CdS HS, TiO 2, and CdS/TiO 2 HS were evaluated by the Brunauer-Emmett-Teller (BET) method.Fig. S4(a) in the Supplementary Material shows N 2 adsorption-desorption isotherms with pore-size distribution.The BET surface area for CdS, TiO 2 and CdS/TiO 2 are 65, 98 and 77 m 2 g -1 , respectively.All samples present type IV nitrogen adsorption-desorption isotherms, verifying the presence of massive mesopores.CdS HS exhibit a type H 3 hysteresis loop, implying slit-shaped pores due to aggregation of nanocrystals that construct CdS HS.While TiO 2 NPs and CdS/TiO 2 HS show a type H 2 hysteresis loop, which signifies ink-bottle pores caused by the aggregation of TiO 2 NPs.The average pore width of CdS HS is 16 nm, which is contributed by the interspace between CdS nanocrystals.The average pore width of TiO 2 is 9.0 nm, indicating that TiO 2 is composed of some smaller NPs, in line with the previous report of TiO 2 obtained by hydrolysis of TBOT 64.Compared with pristine CdS HS, the average pore width of the CdS/TiO 2 composite is significantly smaller (12 nm), which signifies that TiO 2 NPs filled the voids between CdS nanocrystals.The amount of physically adsorbed carbon dioxide on different samples was also tested.As shown in Fig. S4(b) the Supplementary Material, 50 increment was achieved by CdS/TiO 2 HS compared to pristine CdS HS, mainly due to plentiful hydroxyl groups of TiO 2 NPs 56.In short, TiO 2 NPs not only increases the specific surface area but also boost the CO 2 adsorption of CdS/TiO 2 HS.Detailed comparisons of pore structures are summarized in Table S1 in the Supplementary Material. Excitation and transfer process of charge carriers were investigated by transient photocurrent response and electrochemical impedance spectroscopy (EIS).The transient photocurrent response (Fig. S5(a) in the Supplementary Material) was assessed by four successive light on-off cycles.All transient photocurrent response curves soar fastly when light is on and drop steeply when light is off.Pristine CdS and TiO 2 show low photocurrent density owing to the severe recombination of charge carriers inside of its body.Obviously, CdS/TiO 2 HS show considerably higher photocurrent than pristine CdS and TiO 2 , revealing that charge carriers are effectively separated by CdS/TiO 2 heterojunction.Encouragingly, a remarkably smaller circle in the low-frequency region in EIS spectra (Fig. S5(b) in the Supplementary Material) for CdS/TiO 2 HS than those for pristine CdS and TiO 2 reflects lower resistance in charge transfer of CdS/TiO 2 heterojunction.Further, the recombination of charge carriers were studied by steady state fluorescence spectroscopy (Fig. S5(c) in the Supplementary Material).The photoluminescence (PL) intensity follows the order of CdS HS CdS/TiO 2 HS TiO 2 , unveiling that serious recombination in CdS is significantly mitigated with the assistance of TiO 2 NPs.Meanwhile, research on the fluorescence lifetime of all the samples is carried out by transient state fluorescence (Fig. S5(d) in the Supplementary Material).Fitting results for the average lifetime were compiled in Table S2 in the Supplementary Material.The average lifetime of electron-hole pairs in the composite CdS/TiO 2 (1.33 ns) is longer than its constituents: CdS (0.93 ns) and TiO 2 (1.06 ns), which signifies that heterojunction extends the fluorescence lifetime by promoting charge separation.The fluorescence lifetime reflects the dwelling time of the photocatalysts in the excited state.Therefore, the prolonged fluorescence lifetime endows photogenerated charge carriers with sufficient time to migrate to the surface of photocatalyst and participate in the photocatalytic CO 2 reduction reaction. Photocatalytic CO 2 reduction activity for CdS HS, TiO 2 , and CdS/TiO 2 HS composite was appraised under full-spectrum irradiation using a 350 W xenon lamp.As shown in Fig. 2(a), three kinds of gaseous products: CO, CH 4 , and CH 3 OH are detected for CdS HS with a production rate of 4.59, 0.19 and 2.22 mol g -1 h -1 .Different from CdS, TiO 2 NPs produce more CH 4 than CO and CH 3 OH, in accordance with a previous report 53,65.Comparatively, the yield rates of CO, CH 4 , and CH 3 OH over TiO 2 are 2.26, 5.80 and 0.24 mol g -1 h -1 , respectively.All of the CdS/TiO 2 composites, regardless of the molar ratio, exhibit enhanced photocatalytic CO 2 reduction activity than their single components, junction-free counterparts, i.e.CdS and TiO 2 .With increasing the content of TiO 2 , the activity increases first and then reverts back.The highest value comes from the composite CdS/TiO 2 1:1.The possible reason is that excessive TiO 2 NPs will wrap around CdS nanocrystals and electrons in CdS fail to transfer outwards to participate in the photocatalytic CO 2 reduction.In particular, the CH 4 yield rate of CdS/TiO 2 1:1 reaches quite high, up to 27.85 mol g -1 h -1 , which is 145.6 and 3.8 times higher than that of pristine CdS and TiO 2 , respectively.The photocatalytic oxidation reaction was also analyzed by detecting oxygen content in the system.The oxygen yield rate for TiO 2 is higher than that for CdS owing to the stronger oxidation capability of the holes on TiO 2 VB.Considering CdS/TiO 2 , the amount of produced oxygen becomes greater than CdS and TiO 2 , indicating enhanced redox ability and effective charge separation in CdS/TiO 2 composite.The result accords with the analysis of photoelectrochemistry and photoluminescence (PL) spectra.To detect the stability of CdS/TiO 2 HS, three successive photocatalytic CO 2 reduction tests for nine hours in total were conducted.In Fig. 2(b), CdS/TiO 2 HS experience a certain loss of products except for CH 3 OH.The CH 3 OH yield rate tends to be saturated after one hour, suggesting that CH 3 OH may be an intermediate product for photocatalytic CO 2 reduction.After 9 h, the photocatalytic activity loss for CH 4 of CdS/TiO 2 HS is 19.As a whole, CdS/TiO 2 HS exhibit satisfied stability in photocatalytic CO 2 tests.Further, the isotopic tracer test was investigated by photocatalytic reduction of 12 C-and 13 C-labeled CO 2 .In Fig. 2(c) and (d), the distinctive signals of m/z 17 and 29 validate that the dominant resultant CH 4 and CO in the photocatalytic CO 2 reduction derive from 13 CO 2 carbon sources.The result clarifies that carbonaceous products originate from photocatalytic CO 2 reduction rather than other impurities. To reveal the intermediate species in the photocatalytic CO 2 reduction process, in-situ DRIFTS spectra were obtained.As shown in Fig. 3(a), no available signal can be detected without CO 2 flow and light irradiation.When the CO 2 gas with water vapor flows through the sample chamber for 10 min, some strong peaks originating from carbonate species adsorbed on the surface of CdS/TiO 2 can be observed.The peaks located at 1535 and 1290 cm -1 can be indexed to CO 3 2-and 1417, 1224, and 1194 cm -1 correspond with HCO 3 -.No significant change in the peak intensity under darkness for 10 min and 60 min.This implies that CO 2 adsorption is fast under darkness for CdS/TiO 2 HS.The adsorbed carbonate species are the vital precursors of photocatalytic CO 2 reduction.When CdS/TiO 2 HS were exposed under light irradiation with continuous CO 2 and water vapor flow (Fig. 3(b)), the peaks of formate (1867, 1843, 1828, and 1794 cm -1 ), formaldehyde (1771 and 1748 cm -1 ) and methoxyl (1736 cm -1 ) begin to emerge and intensify, illustrating that photocatalytic CO 2 reduction is a process of gradual accumulation.The CH 4 and CO signals fail to be directly detected due to the nonpolar characteristic and feeble affinity, respectively 64. The surface chemical states and composition of samples were analyzed by XPS in Fig. 4. The XPS survey spectra in Fig. S6 in the Supplementary Material confirms the existence of Cd, S, Ti, O, C elements in CdS/TiO 2 composite, which corresponds well with the elements in pristine CdS and TiO 2 , where the C elements come from adventitious contamination.In Fig. 4(a), the high-resolution Cd 3d XPS spectra of CdS can be deconvoluted into two spin-split doublets at 404.9 (Cd 3d 5/2 ) and 411.7 eV (Cd 3d 3/2 ) originating from Cd 2 .While the two peaks of high-resolution S 2p (Fig. 4b) XPS spectra of CdS at 161.1 (S 2p 3/2 ) and 162.4 eV (S 2p 1/2 ) derives from S 2-.As for Ti 2p (Fig. 4(c)) of TiO 2 , core level peaks at 458.9 (Ti 2p 3/2 ) and 464.7 eV (Ti 2p 1/2 ) are characteristic of Ti 4 .In Fig. 4(d), the O 2p orbitals of TiO 2 present two peaks centered at 530 and 531.7 eV corresponding to lattice oxygen and surface-adsorbed hydroxyl groups, respectively 28,66 electrons transfer from TiO 2 to CdS across their interface, which is driven by IEF, under UV light irradiation. In order to ascertain the transfer direction of photoexcited charge carriers of CdS/TiO 2 HS, work function ( ) calculation was adopted as a supplement to the ISI-XPS results.The optimized geometric structures of CdS (100) and TiO 2 (101) surface are provided in Fig. S7 in the Supplementary Material.As shown in Fig. 5(a,b), the work function values of CdS (100) and TiO 2 (101) surface are 5.7 and 6.8 eV, respectively.The work function value represents the minimum energy that is required by photoexcited electrons transiting from the Fermi level (E F ) to the vacuum level (E vac ).Therefore, a higher work function value corresponds to a lower E F .Therefore, the E F of CdS is higher than that of TiO 2 .In this way, from thermodynamic points of view, when TiO 2 integrates with CdS, the electrons will transfer from CdS to TiO 2 and a robust IEF poting from CdS to TiO 2 is formed, which supports the analysis of ISI-XPS in Fig. 4 12,22.To visualize the charge distribution of CdS/TiO 2 heterojunction, the electron density difference was presented in Fig. S8 in the Supplementary Material.The charge accumulation region is emphasized in the yellow and depletion area in cyan.As shown in Fig. S8(a) in the Supplementary Material, the charges are mainly distributed around the interface of CdS/TiO 2 heterojunction, which can be ascribed to the weak van der Waals (vdW) interaction between CdS (100) surface and TiO 2 (101) surface 31.It can be seen that CdS (100) surface is mainly in cyan, while TiO 2 (101) surface is filled by yellow.The result illustrates that CdS (100) surface is positively charged and TiO 2 (101) surface negatively charged after the formation of CdS/TiO 2 heterojunction.The planar-averaged electron density difference along the Z direction in Fig. S8(b) in the Supplementary Material also exhibits a negative electron density difference in CdS layer and a positive electron density difference in TiO 2 layer.The result further illustrates that electron transfer from CdS (100) to TiO 2 (101) surface.Meanwhile, the quantity of electron transfer is revealed by Bader charge analysis of the charge densities of the CdS/TiO 2 heterostructure.The result demonstrates that about 0.329 e transfer from CdS (100) to the TiO 2 (101) surface. Based on the aforementioned experimental and theoretical data on charge transfer routes, it can be authenticated that the charge transfer in the CdS/TiO 2 follows the step-scheme mechanism (Fig. 6).As shown in Fig. 6(a), according to previous calculation and experimental data, the overall band diagram of CdS and TiO 2 can be drawn.The work function for TiO 2 and CdS is 6.8 and 5.7 eV, respectively, which means that the E F of CdS is more negative than that of TiO 2 .Therefore, when TiO 2 integrates with CdS, the electrons will thermodynamically migrate to TiO 2 .After they come into contact, E F of them should be equalized (Fig. 6(b)), the band of TiO 2 will bend downward owing to electron accumulation and CdS bend upward due to electron consumption.Therefore, a builtin electric field directing from CdS to TiO 2 is formed.Under light irradiation (Fig. 6(c)), the electrons on the VB will jump to CB for both CdS and TiO 2 owing to the light excitation.Meanwhile, the photoexcited electrons on the TiO 2 CB will migrate to the CdS VB and recombine with the photoexcited holes due to the intensive electrostatic force induced by IEF.In this process, the electrons on TiO 2 CB with weak reduction capability and the holes on CdS VB with weak oxidation ability will be consumed.Hence, the oxidation reaction will occur on the TiO 2 VB and reduction reaction will occur on the CdS CB, achieving spatial separation.As a result, the stepscheme transfer mechanism of charge carriers not only promotes the separation of charge carriers but also sustain strong redox ability, which endows CdS/TiO 2 HS with the robust driving force for involving in the photocatalytic CO 2 reduction reaction."
  },
  {
    "title": "Conclusions",
    "content": "In summary, CdS/TiO 2 HS were successfully prepared by hydrothermal routes, which exhibit enhanced photocatalytic CO 2 reduction activity.The enhanced photocatalytic CO 2 reduction performance can be ascribed to the following factors: (1) Hollow structure promotes the light absorption and provides more active sites for photocatalytic CO 2 reduction; (2) Intimate heterojunction boosts the separation of charge carriers of CdS/TiO 2 HS; (3) Step-scheme photocatalytic mechanism endows CdS/TiO 2 HS with enhanced redox capability, which functions as a dominant factor for high-efficiency photocatalytic CO 2 reduction activity.This work presents new insight into fabricating step-scheme CdS/TiO 2 heterojunction for artificial photosynthesis. NPs will effectively insert into the gap of CdS nanocrystals and coat around the CdS nanocrystals to form compact CdS/TiO 2 heterojunction.As shown in Fig.1(b), CdS HS display sphere-like morphology.The spheres with a diameter of about 500 nm are nearly monodispersed.And the walls of CdS HS are comprised of abundant nanocrystals.As shown in Fig.1(c) and (d), the CdS/TiO 2 composite inherit the original sphere-like morphology of CdS.Besides, broken spheres indicate the hollow nature of the composite.Moreover, judging from the TEM images (Fig.1(e, f)), relative transparency to the electron beam further verifies the hollow structure of CdS/TiO 2 HS.In Fig.1(g), the HRTEM image of CdS/TiO 2 HS exhibits distinct lattice fringes.The lattice spacing of 0.362 and 0.346 nm can be respectively ascribed to the (100) plane of the hexagonal CdS (JCPDS No. 75-1545) and (101) plane of TiO 2 (JCPDS No. 73-1764), which implies the formation of CdS/TiO 2 heterojunction61.Elemental mapping of CdS/TiO 2 HS (Fig.1(h)) verified the existence of S, Cd, O and Ti elements. Fig. 1.(a) The formation procedures of CdS/TiO2 HS.FESEM images of CdS HS (b) and CdS/TiO2 HS (c, d); TEM (e, f), HRTEM image (g) and its corresponding EDS elemental mapping images of CdS/TiO2 HS (h).Note that CdS/TiO2 refers to CdS/TiO2 1:1 in this paper unless otherwise stated. Fig. 2. (a) Photocatalytic CO2 reduction activity tests under full-spectrum irradiation of CdS HS, TiO2 and CdS/TiO2 HS with various molar ratios.(b) Stability tests for CdS/TiO2 HS 1:1.(c, d) Gas chromatography-mass spectrometry (GC-MS) analysis of the resultant CH4 and CO for CdS/TiO2 composite, respectively. Fig. 3. In-situ DRIFTS spectra of (a) the surface adsorbed carbonate species and (b) intermediates in photocatalytic CO2 reduction for CdS/TiO2 HS (0-60 min under dark conditions and 60-120 min under full-spectrum irradiation). Fig. 4. High-resolution XPS for (a) Cd 3d, (b) S 2p, (c) Ti 2p, and (d) O 2p of CdS/TiO2 without or with 365 nm LED irradiation (CdS/TiO2 UV). Fig. 5. Electrostatic potentials of (a) CdS (100) and (b) TiO2 (101) surface. Fig. 6.(a) The work functions of CdS and TiO2 before contact.(b) Thermodynamic electron transfer after contact with the formation of a balanced Fermi level and IEF.(c) The step-scheme electrons transfer diagram between CdS and TiO2 under the full spectrum. This work was financially supported by the National Natural Science Foundation of China (NSFC) (Nos.51872220, 51932007, 51961135303, 21871217, U1905215 and U1705251), the National Key Research and Development Program of China (No. 2018YFB1502001) and the Fundamental Research Funds for the Central Universities (No. WUT: 2019IVB050). Supplementary material related to this article can be found, in the online version, at doi:https://doi.org/10.1016/j.jmst.2020.02.062."
  }
]