[
  {
    "title": "Doi",
    "content": "10.1016/j.cattod.2014.09.005"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic conversion of CO2 in an aqueous solution using various kinds of layered double hydroxides"
  },
  {
    "title": "Abstract",
    "content": "We found that various layered double hydroxides (LDHs) showed good activity for the photocatalytic conversion of CO 2 in an aqueous solution.Isotope experiments using 13 CO 2 as a substrate clearly revealed that CO was generated as a main reduction product of CO 2 .Ni-Al LDH (Ni/Al 4) exhibited the largest amount of CO evolved among the various kinds of LDHs.Especially, Ni-Al LDHs fabricated from chlorides showed the higher conversion of CO 2 to CO than those from nitrates.The amount of CO evolved was increased by the addition of chloride ions into the reaction solution, on the other hand, the addition of carbonate and hydrocarbonate ions did not enhance the conversion of CO 2 but promoted the selectivity to H 2 evolution for water splitting."
  },
  {
    "title": "Experimental",
    "content": "1-x M 3 x (OH) 2 x (A n-) x/n mH 2 O); Mg-Al, Ni-Al, Zn-Al, Mg-In, and Ni-In, were synthesized by the following coprecipitation method; an aqueous solution of nitrates or chlorides of M 2 and M 3 was slowly added to an aqueous solution of Na 2 CO 3 at room temperature.The pH was kept constant at 10 by adding an aqueous solution of NaOH.The resulting suspension was transferred into a stainless steel autoclave with an inner Teflon vessel and aged at 383 K for 20 h under hydrothermal condition.The solid was collected by filtration and washed with ultra-pure water, and dried at 383 K in air atmosphere.M 2 -M 3 LDH(NO 3 -) and M 2 -M 3 LDH(Cl -) mean M 2 -M 3 LDH prepared from nitrates and chlorides as precursors of hydroxide sheets, respectively. The powder XRD patterns of various LDHs were collected on a X-ray diffractometer (Rigaku, Multiflex), using Cu K radiation ( 0.154 nm) at a scan speed of 4.0 min -1 .The thermo gravimetric analysis for LDHs was performed using Rigaku, Thermo Plus 2. The certain amount of sample was set in the furnace, and the temperature was increased by 3 K min -1 under flow condition of dried air.Specific surface areas of various LDHs were evaluated by BET method at 77 K (liquid nitrogen temperature) using a surface area and pore size analyzer (BELSORP-miniII, BEL Japan, Inc.).Before the measurement, LDHs were heated at 383 K under vacuum condition using a pretreatment instrument (BELPREP-vacII, BEL Japan, Inc.).Temperature programmed desorption profiles were recorded using TPD-1-AT (BEL Japan, Inc.) equipped with a quadrupole-type mass spectrometer (M-QA100F, ANELVA) as a detector.50 mg of sample powder was set in a quartz glass tube and the temperature was increased by 5 K min -1 under He flow.Q-Mass profile in m/z 44 and 45 were monitored during increasing temperature to confirm the desorption of 12 CO 2 and 13 CO 2 , respectively. Photocatalytic conversion of CO 2 in H 2 O was carried out in a closed circulating system with 220 mL of total dead space volume.500 mg of photocatalyst (LDH) powder was dispersed in 350 mL of ultra-pure water in the glass reactor, and the suspension was degassed.Gaseous CO 2 purified by vacuum distillation at liquid nitrogen temperature was introduced into the free gas space, and the circulating was performed for 1 h before photoirradiation.Then, the suspension was illuminated from within the reactor with a 400 W high pressure Hg lamp (HL400BH-9, SEN LIGHTS CORPORA-TION, Japan) through the quartz water jacket.The products were analyzed by thermal conductivity detector gas chromatography (TCD-GC) using a GC-8A chromatograph (Shimadzu Corporation, Japan) equipped with a MS-5A packed column.A quadruple-type mass spectrometer (BEL Mass, BEL Japan, Inc.) was used for isotope experiments."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Fig. 1 shows XRD patterns of various kinds of M 2 -M 3 LDHs(Cl -).All of these patterns correspond to a typical structure of LDH-like compounds 19.As for Ni 3 -Al 1 LDH(Cl -) (pattern a), two sharp diffraction peaks at 11.4 and 23.1 are assigned to (0 0 3) and (0 0 6) phase reflections, which are related to interval of each hydroxide sheets and distance from hydroxide sheets to interlayer anions, respectively.The other intense peak at 60.8 is indexed as a (1 1 0) phase reflection with respect to hexagonal axes.The parameter a of layered double hydroxides corresponding to the cation-cation distance within the hydroxide sheet can be calculated as follow: a 2d (110) .The (1 1 0) reflection of Mg-In LDH(Cl -) appeared at lower angle than that of Mg-Al LDH(Cl -), indicating that the cation-cation distance of Mg-In LDH(Cl -) was longer than that of Mg-Al LDH(Cl -).This peak shift is due to the difference of ionic radii of trivalent cation, Al 3 : 53.5 pm and In 3 : 80.0 pm 20, existing in the hydroxide sheet of LDHs.On the other hand, the position of these sharp diffraction peaks were not changed by Ni/Al ratio of Ni-Al LDH(Cl -) (pattern f-i).The value of full width at half maximum (FWHM) of (0 0 3) phase reflection was the smallest at Ni/Al 3, indicating that the stacking of hydroxide sheets along , respectively.Fig. 2 shows the weight loss curve of Ni-Al LDH(Cl -) recorded by thermo gravimetric analysis.It was known that LDHs exhibit the characteristic two steps weight loss with increasing temperature in the TG curve 19.The first step at less than 473 K is due to desorption of water molecules kept on the surface and in the interlayer.The second step between 473 and 673 K is caused by collapse of the layer structure accompanied with the dehydration of hydroxyl groups and the decomposition of charge compensating interlayer anions. Fig. 3 shows the amount of products evolved for the photocatalytic conversion of CO 2 in H 2 O over various M 2 -M 3 LDHs(Cl -) after 8 h of photoirradiation.All kinds of M 2 -M 3 LDHs(Cl -) were active for the photocatalytic conversion of CO 2 and the photocatalytic H 2 evolution from water simultaneously, and CO was evolved as a main reduction product of CO 2 .No product was evolved without the photoirradiation and in the absence of LDHs, respectively.The selectivity to CO obviously depended on the metal components of hydroxide sheets of LDHs.Ni-Al LDH(Cl -) showed the highest selectivity to CO among various LDHs(Cl -).Mg-In LDH(Cl -) and Ni-In LDH(Cl -), which contained indium as trivalent cation in the hydroxide sheet, exhibited the high efficiency for the H 2 production, but the amount of CO evolved was small.In the case of Ni-Al LDH(Cl -), the amount of H 2 evolved was much lower than those of others LDHs.It is important to suppress the formation of H 2 in order to obtain more high selectivity to the conversion of CO 2 because the S1.The color of Ni-Al LDH(Cl -) changed from green to gray after the photocatalytic reaction.On the contrary, the structure, which was identified by the XRD pattern, did not change as compared to that before the reaction (Fig. S2). Table 1 shows the yields of CO, H 2 , and CH 4 for the photocatalytic conversion of CO this isotope experiment is shown in Fig. 4. The peak at 1000 second in GC chromatogram is assigned to CO in this case.There was a clear peak in the profile of m/z 29 at the same retention time with GC chromatogram, and no peak was observed in the profile of m/z 28.Therefore, only 13 CO (m/z 29) was evolved in the photocatalytic conversion of 13 CO 2 over Ni-Al LDH(Cl -).This result clearly indicated that the carbon sources of CO evolved were introduced CO 2 ; therefore, carbon species such as carbonate ions kept in the interlayer of LDH and contaminated organics did not decompose into CO.Fig. 5 shows the temperature programmed desorption profile of Ni-Al LDH(Cl -) which was used for the isotope experiment using 13 CO 2 as substrate. 12CO 2 (m/z 44) and 13 CO 2 (m/z 45) were desorbed from the used photocatalyst at around 573 K, indicating that adsorbed 13 CO 2 species such as carbonate or hydrocarbonate species existed on LDH.This result showed that parts of the introduced CO 2 molecules were adsorbed on Ni-Al LDH(Cl -) during the photocatalytic conversion of CO 2 in an aqueous solution.Accordingly, we concluded that the adsorbed CO 2 species on the surface of LDH, which are derived from the introduced gaseous CO 2 in the gas phase, are reduced into CO under UV light photoirradiation.The elemental analysis revealed that 1.2 wt of chlorine atoms and 0.6 wt of nitrogen atoms derived from precursors of hydroxide sheets existed on Ni-Al LDH(Cl -) and Ni-Al LDH(NO 3 -), 2. Generally, carbonate ions as charge compensating anions are preserved in the interlayer of LDHs.Our fabricating LDHs in this study also keep large amount of carbonate ions with small amount of residual chloride ions derived from the precursor of hydroxide sheets.Fig. 7 shows the effect of anion addition to the reaction solution on the photocatalytic conversion of CO 2 in an aqueous solution over Ni-Al LDH(Cl -) (Ni/Al 4).Amount of H 2 evolved as the reduction product of H derived from H 2 O was increased by the addition of NaHCO 3 and Na 2 CO 3 , although the formation of CO was drastically suppressed.Sayama and Arakawa reported that the addition of carbonate ions or hydrocarbonate ions to an aqueous solution enhance the evolution of H 2 for water splitting 21.In our case, on the other hand, amount of CO evolved was increased in the presence of NaCl and KCl in an aqueous solution as compared to that in a pure water.The formation of O 2 was not observed in all cases.This results indicated that chloride ions in the reaction solution promoted the photocatalytic conversion of CO 2 to CO over Ni-Al LDH(Cl -).We expect that chloride ion in an aqueous solution act as a hole scavenger in the photocatalytic reaction.Chloride ions should be oxidized by holes generated with the photoexicitation of electrons through two processes.One is that chloride ion is oxidized into chlorine (Eq.( 1)), and chlorine (Cl 2 ) is disproportionately decomposed into chloride ion (Cl -) and hypochlorite ion (ClO -) (Eq.( 2)). The other is that chloride ion is oxidized into hypochlorite ion directly (Eq.( 3)). Standard redox potential of (Cl 2 /Cl -) and (ClO -/Cl -) are known as 1.40 V and 0.89 V (vs.NHE at pH 0), respectively 22.In both cases, hypochlorite ion which can act as a strong oxidizing reagent in an aqueous solution would be formed finally.In addition, chlorate ion (ClO 3 -) and perchlrate ion (ClO 4 -) are generated through the disproportionation of hypochlorite ions in an aqueous solution. It is possible that the oxidation products of chloride ions such as ClO -, ClO 3 -, and ClO 4 -are evolved instead of O 2 as an oxidation product of H 2 O.The solution after the reaction was positive for the starch-iodine reaction, while the solution before the reaction (an 0.1 M aqueous solution of NaCl) and pure water were negative (Fig. S3).This result indicated that ClO -, ClO 3 -, and ClO 4 -whose redox potential are positive enough to oxidize iodide ion into iodine were formed in the aqueous solution during the photocataytic conversion of CO 2 .We concluded that chloride ion in an aqueous solution act as a hole scavenger under UV light photoirradiation and it is oxidized into ClO -, ClO 3 -, and ClO 4 -in our system using Ni-Al LDH(Cl -) as a photocatalyst."
  },
  {
    "title": "Conclusions",
    "content": "We found that Ni-Al LDH (Ni/Al 4) prepared from chloride exhibited the highest efficiency for the photocatalytic conversion of CO 2 into CO in an aqueous solution among various kinds of LDHs.CO 2 introduced in the gas phase was adsorbed on the surface of LDHs, and then reduced into CO under photoirradiation because only 13 CO was formed in the isotope experiment using 13 CO 2 as a substrate.The addition of chloride ions to the reaction solution enhanced the selectivity to CO. Chloride ion in an aqueous solution act as a hole scavenger under UV light photoirradiation and it is oxidized into ClO -, ClO 3 -, and ClO 4 -. Fig. 1.XRD patterns of various kinds of M 2 -M 3 LDH(Cl -); (a) Ni3-Al1, (b) Mg3-Al1, (c) Zn3-Al1, (d) Ni3-In1, (e) Mg3-In1, (f) Ni5-Al1, (g) Ni4-Al1, (h) Ni3-Al1, and (i) Ni2-Al1. Fig. 2. The weight loss curve of Ni-Al LDH(Cl -) in thermo gravimetry analysis.Rate of temperature increase: 5 K min -1 , atmosphere: air. Fig. 3.The amount of products evolved in the photocatalytic conversion of CO2 in H2O over various M 2 -M 3 LDH(Cl -) after 8 h of photoirradiation.: CO, : CH4, : H2, M 2 /M 3 3, photocatalyst weight: 500 mg, CO2: 7.7 mmol, H2O: 350 mL, light source: 400 W Hg lamp. photocatalytic reduction of H derived from H 2 O into H 2 competitively takes place in the photocatalytic conversion of CO 2 in H 2 O.We expect that Ni species in Ni-Al LDH(Cl -) which function like a cocatalyst cause the selective formation of CO.The yields of CO, CH 4 , and H 2 were 21.0, 1.2, and 12.3 mol over Ni-Al LDH(Cl -), respectively, and the selectivity to CO (CO/CO CH 4 H 2 100) was 67 after 8 h of photoirradiation.The formation rate of CO in the photocatalytic conversion of CO 2 in an aqueous solution over Ni-Al LDH(Cl -) decreased with the photoirradiation time as shown in Fig.S1.The color of Ni-Al LDH(Cl -) changed from green to gray after the photocatalytic reaction.On the contrary, the structure, which was identified by the XRD pattern, did not change as compared to that before the reaction (Fig.S2).Table1shows the yields of CO, H 2 , and CH 4 for the photocatalytic conversion of CO 2 in H 2 O over a different Ni/Al ratio of Ni-Al LDH(Cl -).The largest amount of CO was evolved at Ni/Al 4 after 10 h of photoirradiation.Photocatalytic H 2 production proceeded well over Ni-Al LDH(Cl -) with smaller Ni/Al ratio (Al rich).It is known that the ratio of metal components affects the surface property of LDHs, for example, Ebitani et al. insisted that the surface basic property of Mg-Al LDH depends on the Mg/Al ratio, and Mg-Al LDH (Mg/Al 3) showed the highest activity for the aldol condensation 17.In our case, the photocatalytic activity was also affected by the Ni/Al ratio of Ni-Al LDH(Cl -), and Ni/Al 4 was the most effective ratio for the evolution of CO as mentioned above.The amounts of CO evolved over Ni(OH) 2 and Al(OH) 3 , which does not have typical structure of LDHs, were less than that over Ni-Al LDH(Cl -) (Ni/Al 2, 3, 4, and 5), indicating that Ni-Al mixed hydroxide gives suitable surface property for the photocatalytic conversion of CO 2 in H 2 O. Table 2 shows the difference of the activity between Ni-Al LDH(Cl -) and Ni-Al LDH(NO 3 -) for the photocatalytic conversion of CO 2 in an aqueous solution.Larger amounts of CO and H 2 were evolved over Ni-Al LDH(Cl -) than those over Ni-Al LDH(NO 3 -).On the other hand, Ni-Al LDH(NO 3 -) showed the high efficiency for the formation of CH 4 and O 2 .To investigate the origin of CO generated during the reaction, the photocatalytic conversion of 13 C-labeled CO 2 was conducted over Ni-Al LDH(Cl -) (Ni/Al 4) in an 0.1 M aqueous solution of NaCl.The GC-MS chromatogram for Fig. 4. The GC-MS chromatogram for the isotopic experiment; photocatalytic conversion of 13 CO2 in an aqueous solution of 0.1 M NaCl over Ni-Al LDH(Cl -) with Ni/Al 4 after 26 h of photoirradiation.Photocatalyst weight: 500 mg, 13 CO2: 7.7 mmol, aqueous solution: 350 mL, light source: 400 W Hg lamp. Fig. 5.The temperature programmed desorption profiles of Ni-Al LDH(Cl -) which was used for the isotopic experiment using 13 CO2 as substrate.Solid line: m/z 44 ( 12 CO2), dot line: m/z 45 ( 13 CO2), rate of temperature increase: 5 K min -1 , atmosphere: He. Fig. 6.The GC-MS chromatogram in the photocatalytic conversion of 13 CO2 in H2O over Mg-In LDH(NO3 -) after 26 h of photoirradiation.(a) TCD-GC chromatogram, (b) m/z 29 profile, (c) m/z 30 profile.Photocatalyst weight: 100 mg, 13 CO2: 500 mol, H2O: 4 mL, light source: 200 W Hg-Xe lamp. Fig. 7.The yield of products in the photocatalytic conversion of CO2 in various aqueous solutions over Ni-Al LDH(Cl -) with Ni/Al 4 after photoirradiation for 10 h.: CO, : CH4, : H2, photocatalyst weight: 500 mg, CO2: 7.7 mmol, aqueous solution: 350 mL, concentration of additive: 0.1 M, light source: 400 W Hg lamp. The yield of products in the photocatalytic conversion of CO2 in an aqueous solution of 0.1 M NaCl over different Ni/Al ratio of Ni-Al LDH(Cl -) after photoirradiation for 10 h.reduction of H derived from H 2 O into H 2 competitively takes place in the photocatalytic conversion of CO 2 in H 2 O.We expect that Ni species in Ni-Al LDH(Cl -) which function like a cocatalyst cause the selective formation of CO.The yields of CO, CH photocatalytic 4 , and H 2 were 21.0, 1.2, and 12.3 mol over Ni-Al LDH(Cl -), respectively, and the selectivity to CO (CO/CO CH 4 H 2 100) was 67 after 8 h of photoirradiation.The formation rate of CO in the photocatalytic conversion of CO 2 in an aqueous solution over Ni-Al LDH(Cl -) decreased with the photoirradiation time as shown in Fig. This study was partially supported by a Grant-in-Aid for Scientific Research on Innovative Areas \"All Nippon Artificial Photosynthesis Project for Living Earth\" (No. 2406) of the Ministry of Education, Culture, Sports, Science, and Technology (MEXT) of Japan, the Precursory Research for Embryonic Science and Technology (PRESTO), supported by the Japan Science and Technology Agency (JST), and the Program for Element Strategy Initiative for Catalysts Batteries (ESICB), commissioned by the MEXT of Japan. Supplementary data associated with this article can be found, in the online version, at http://dx.doi.org/10.1016/j.cattod.2014.09.005."
  }
]