[
  {
    "title": "Doi",
    "content": "10.1088/1361-6528/aabdb1"
  },
  {
    "title": "Article_Title",
    "content": "Photoreduction of carbon dioxide under visible light by ultra-small Ag nanoparticles doped into Co-ZIF-9"
  },
  {
    "title": "Abstract",
    "content": "Metal-organic frameworks (MOFs) as famous porous materials in CO2 adsorption, their performance in CO2 reduction attract researchers' great attention.A classical Co-MOF, Co-ZIF-9, has been proposed as a novel photocatalyst for reducing CO2 into chemical feedstocks.Herein, Co-ZIF-9 with rod-like structure was obtained through reflux.Ultra-small silver nanoparticles (Ag NPs, smaller than 5 nm) were doped into Co-ZIF-9 by photodeposition method.With the assistant of photosensitizer, the resultant composites AgCo-ZIF-9 show catalytic reactivity in converting CO2 into CO under visible-light irradiation.Comparing with bare Co-ZIF-9, the photocatalytic performance of AgCo-ZIF-9 increases more than 2 folds (around 28.4 mol CO) and the selectivity enhances about 20 (22.9 mol H2) for 0.5 h irradiation.These demonstrate that Ag NPs doping may provide a possible way to promote the efficiency and selectivity of MOF materials in CO2 photo-reduction."
  },
  {
    "title": "Experimental",
    "content": "Inductively coupled plasma mass spectrometry (ICP-MS) was measured by Leeman Prodigy.The Fourier transform infrared spectroscopy (FT-IR) spectra were carried on a Mattson Alpha-Centauri spectrometer using KBr lpellets in the range of 4000-400 cm-1.Thermogravimetric analyses (TGA) were recorded using a Perkin-Elmer TG-7 analyzer with the samples heated from 25 C to 800 C under N2 atmosphere at a constant rate of 5 C / min.The UV-Vis absorption spectra were obtained by a Shimadzu UV-2550 spectrophotometer.Powder X-ray diffraction (PXRD) patterns were carried on a Siemens D5005 diffractometer with Cu K ( 1.5418A) radiation.Transmission electron microscopy (TEM) images were measured using a JEM-2010 transmission electron microscope at an accelerating voltage of 200 kV.The elemental mappings of the samples were determined by energy-dispersive X-ray (EDX) equipped on TEM with the type of Genesis 2000.Scanning electron microscopy (SEM) images were carried by XL-30 ESEM-FEG Scanning Electron Microscope.X-ray photoelectron spectroscopy (XPS) was using an Escalab 250 instrument.The N2 adsorption-desorption isotherms and the CO2 adsorption-desorption isotherms were performed on an automatic volumetric adsorption equipment (ASIQM0G002-3). Co-ZIF-9 was synthesized by reflux and the detailed as shown as following: H-PhIM (0.06g) and Co(NO3)26H2O (0.21g) were dissolved in DMF (18ml).Then the solution was heated at 140 C to reflux for 24 h.After cooling to room temperature naturally, the mixture stirred for 2 days under room temperature.Purple Co-ZIF-9 crystals were collected by centrifugation, and then washed three times with A c c e p t e d M a n u s c r i p t DMF.The DMF was exchanged by CH2Cl2 for 3 days.Finally, the Co-ZIF-9 catalysts were dried at 80 C for 10 h under vacuum. A series of Ag doped Co-ZIF-9 composites (AgCo-ZIF-9) with different amount of AgNPs were synthesized following a reported method. 21At room temperature, 50 mg of Co-ZIF-9 was dispersed in 25 mL of deionized water by 30 min ultrasonication.Then 250 l 5 PEG2000 was added and stirred for another 30min.After that, 1.0, 3.0, 5.0, 7.0 or 9.0 ml of AgNO3 solution (2 mg / ml) was added to above suspension and irradiated under a 200 W Xe lamp for 2h.The AgCo-ZIF-9 materials were washed with deionized water and dried at 80 C for 12 h under vacuum.The color of the original purple of Co-ZIF-9 was changed into dark purple or black. The photocatalytic experiments were carried out in a 50 mL test tubes containing 6 mL suspended in a mixture of MeCN/TEOA/H2O 4:1:1 (v/v) solution, Ru(bpy)3Cl26H2O (10 mol), and 1mg Co-ZIF-9 or AgCo-ZIF-9.The solution firstly purged with CO2 for 20 min to create a CO2 atmosphere and keep a pressure of 1 bar.A 200 W Xe lamp was employed as the light source.The system was irradiated under visible light ( 420 nm) at 20C as controlled by circulating water.The gas product was injected into a gas chromatography (GC) with a FID detector and a TCD detector with argon as the carrier gas.The cycling experiment was performed after filtrating the catalyst and put it into a similar fresh catalytic condition. To detect the formation of carbon monoxide from the reaction mixture, 500 L of the middle of the test tube was taken out by a syringe and injected into a GC with FID detector, using argon as carrier gas and reference gas.The volume of the carbon monoxide produced was calculated by comparing the integrated area of the signals of carbon monoxide with a calibration curve.The injector and detector temperatures were set to be 60C.Retention times of hydrogen were 1.9 min.To detect the formation of hydrogen from the reaction mixture, 1000 L of the headspace of the test tube was taken out by a syringe and injected into a GC with TCD detector, using a 5A molecular sieve column and argon as carrier gas and reference gas.The volume of the hydrogen produced was calculated by comparing the integrated area of the signals of hydrogen with a calibration curve.The injector and detector temperatures were set to be 60C.Retention times of hydrogen were 0.7 min. An isotopic experiment was performed under the same photocatalytic reaction conditions changing CO2 into 13 CO2 (99 in purity, 1 bar) as the carbon source.The gas product of CO was injected by gas chromatography-mass spectrometry (GC-MS)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "In this work, the Co-ZIF-9 was synthesized using Co(NO3)26H2O and H-PhIM by reflux.Ag NPs was doped into Co-ZIF-9 by photo-deposition method under a 200 W Xe lamp, according to a reported method.The content of silver in AgCo-ZIF-9 was determined by ICP-MS which was revealed in table 1. PXRD patterns for the AgCo-ZIF-9 and Co-ZIF-9 are shown in Figure 1a.The diffraction peaks of Co-ZIF-9 can be well matched with the previous reported and simulated one 25 .It is indicated that Co-ZIF-9 was synthesized successfully.As for AgCo-ZIF-9, the XRD pattern is similar to the Co-ZIF-9 but with a decreased intensity.Wide angle powder XRD pattern of AgCo-ZIF-9 shows extra SEM image (Figure 1b) and TEM image (Figure S2) exhibit that the micrographs of Co-ZIF-9 and AgCo-ZIF-9 are rod-like structure structures and the length is 200nm.TEM images show that the Ag NPs randomly distribute over Co-ZIF-9.From Figure 1c, we can find that the Ag NPs have a size of 5 nm.High-resolution TEM (HRTEM) images in Figure 1d show there is a interplanar spacing of 0.23 nm belonging to the 111 lattice plane of Ag. 20 TEM-Mapping images (Figure 1e-f) exhibit that cobalt, silver, carbon and nitrogen have uniformly distribution in the AgCo-ZIF-9.Such contact of Ag NPs with Co-ZIF-9 will promote the interaction between the excited state electrons stored in silver NPs and the active sites on the surface of AgCo-ZIF-9. The surface composition and the chemical states of the elements in AgCo-ZIF-9 (Figure 2) and Co-ZIF-9 (Figure S3) were elucidated by XPS. 31The XPS spectrum for AgCo-ZIF-9 indicates that the composite mainly consists of C, N, O, Co, and Ag atoms.These elements are consistent with to the chemical component of AgCo-ZIF-9.In order to obtain more chemical bonding information among these elements, the high resolution XPS spectra of C 1s, N 1s, Co 2p, O 1s and Ag 3d are deconvoluted through Gaussian-Lorenzian analysis method.For C 1s spectrum (Figure 2b), two distinct peaks at 284.5 eV and 285.8 eV are observed.The first peak is ascribed to sp2 carbon in benzoic ring of H-PhIM, the second one is attributed to the C-NC species on the Imidazole of H-PhIM.The XPS spectrum of N 1s in Figure 2c is split into two peaks, located at 398.9 eV and 399.9 eV.The former can be regarded as the sp2 hybridized nitrogen involved in the imidazole of H-PhIM, and the latter can be classified as the Co-N.As shown in Figure 2d, the peak at 532.05 eV for AgCo-ZIF-9 is ascribed to OH group which can be assigned to the absorbed H2O.As shown in Figure .2e, the peaks at 797.14 eV and 781.62 eV for AgCo-ZIF-9 are indexed to the Co 2p 1/2 and Co 2p 3/2, corresponding to Co 2 , and each peak has a broad satellite structure toward higher binding energies.Additionally, the spectrum of Ag (Figure 2f) can be deconvoluted into two peaks of 368.9 eV (Ag3d 5/2) and 374.9 eV (Ag3d 3/2), implying that the Ag is in its 0 valence state. 23Compared to the XPS peak of AgCo-ZIF-9, XPS peaks of N1s and Co2p of bare Co-ZIF-9 (Figure S3) show a little shift.For C 1s spectrum (Figure 2b), two peaks are located at 284.65 and 285.75 eV.The peaks of N 1s are at 399.3 and 400.5 eV which is 0.4-0.5 eV higher than those in AgCo-ZIF-9.The peaks of Co 2p are peaking at 782.1 and 781.6 eV, which is 0.5 and 1.2 eV higher than those in AgCo-ZIF-9.These results reveal that there might form interaction between Ag NPs and In addition, the structure of Co-ZIF-9 was not destroyed by silver nanoparticles, further confirmed by FT-IR (Figure S4).It can be seen clearly that the main characteristic vibration peaks in the Co-ZIF-9 were also observed in the AgCo-ZIF-9 composites.In order to test the thermal stability of the samples, the TGA of AgCo-ZIF-9 were carried.The result in Figure S5 illustrates that composites could be stable before 450 C, and exceeding this temperature the framework begins to decompose. From UV-Vis absorption spectrum (figure 3), we can find that AgCo-ZIF-9 displays two obvious broad absorption bands peaking at 420 and 580 nm.Compared with pure Co-ZIF-9 and Ag nanoparticles (Figure S6), the former adsorption in AgCo-ZIF-9 is ascribed to Ag nanoparticles and the later band belongs to Co-ZIF-9.With the content of Ag increasing (2.07 to 7.13 wt), there is an enhanced absorption intensity increase at around 420 nm, which is in concordance with the color change of the AgCo-ZIF-9 from original purple to dark purple.The absorption edge of the composites is almost unchanged when further enhancing the concentration of Ag NPs to 9.22 wt.The band gap energy for the Co-ZIF-9 and AgCo-ZIF-9 were characterized by UV-vis diffuse reflectance spectroscopy.As shown in figure S7, the band gap energy of Co-ZIF-9 was 1.96 eV.After photodepositing AgNPs, the band gap of AgCo-ZIF-9 was 1.84 eV, which was lower than that of Co-ZIF-9. The photo-reduction activity of AgCo-ZIF-9 materials with different Ag loading were investigated under the assistant of Ru(bpy)3Cl26H2O as photosensitizer.The photocatalytic CO2 reaction was carried out in the mixture of MeCN / TEOA / H2O 4:1:1 (v/v) under visible light irradiation for half an hour.As a control, the photocatalytic activity of pure Co-ZIF-9 investigated, as well.The experimental results are shown in figure 4a.In this photocatalytic system, only H2 and CO were detected as the products in the gas phase.For the pure Co-ZIF-9, the yield of CO and H2 was 13.3 mol and 19.3 mol, respectively, and the selectivity of CO is 40.8.The doping content of Ag NPS in composites showed considerable influence about the photocatalytic activity (Figure 4b): (i) when Ag NPS (2.07 wt ) are loaded, the photocatalytic activity in CO generation is increased A c c e p t e d M a n u s c r i p t from 13.3 mol to 17.2 mol, whereas H2 evolution undergoes an obvious decrease (14.8 mol); (ii) the CO evolution enhanced as the Ag NPS content rose to 5.36 wt , which is around 2 folds higher (28.4 mol) than that of pure Co-ZIF-9 accompanying by a little reductions in the H2 production (22.9 mol); (iii) further enhancing Ag NPS content (7.13 wt ) led to few changes of CO generation but with 10 decrease of H2 evolution, comparing with the product in AgCo-ZIF-9.The quantum efficiency of CO generarion using AgCo-ZIF-9 (7.13 wt ) as catalyst is around 1.1 .These results indicate Ag NPS doping bring out obvious enhancement in not only the production but also the selectivity of CO, reflecting the possible electron pool effect Ag NPS in the photo-catalysis.The optimal doping amount of Ag NPS to the saturated CO generation is approximately 7.13 wt .The activity of AgCo-ZIF-9 is higher than most of reported MOF catalysts for CO generation ( Table S1).To test the stability of AgCo-ZIF-9 in the photocatalytic reaction, the cycling experiment was performed.As shown in Figure 4b, around 10 decrease in the production of CO was observed in the second run, while it reached to 25 in the fourth run.The decreased reactivity of AgCo-ZIF-9 (5.36 wt ) may be resulted from the shedding of Ag NPs from Co-ZIF-9.This is evidenced by the ICP-MS which shows around 0.47 wt loss of Ag NPs during the photo-catalysis.The PXRD pattern of AgCo-ZIF-9 after catalytic reaction is showed in Figure S1, which indicates the structure of AgCo-ZIF-9 is almost the same with the fresh one.CO Selectivity b 1 c 28.4 22.9 51.3 55.4 2 d n.d. ee n.d.n.d.-3 f n.d.n.d.n.d.-4 g n.d.n.d.n.d. -5 h 3.8 10.1 13.9 27.3 6 i 1.7 12.2 26.9 12.2 7 j 8.0 9.5 17.5 45.7 8 k n.d.3.4 3.4 -9 l n.d.Replacing AgCo-ZIF-9 with pure Co-ZIF-9 in Ar atmosphere. To convincingly illuminate the source of the reduction product, the isotopic experiment using 13 CO2 as gas atmosphere was carried out under the same conditions.As presented in Figure S6, the mass spectra peaks at m/z 29 (1.91 min) and 45 (13 min) are assigned to 13 CO and 13 CO2, respectively.No signal at A c c e p t e d M a n u s c r i p t m/z 28 was detected.These results provided valid evidence that CO derived from the reduction of CO2 molecule rather than decomposition of other organic species in the reaction system. A series of control experiments were in progress to illuminate the role of the components in the catalytic system.The results were shown in Table 1.In the Dark (entry 2), no product was detected which indicated that the other components in the catalytic system can't arouse CO2 reduction.In the absent of Ru(bpy)3Cl26H2O (entry 3), no reaction occurred illuminate the active species generation from Ru(bpy)3Cl26H2O.Without TEOA, no gaseous products were detected, which indicated that the electron donor species was requisite to the photoreduction of CO2 (entry 4).When AgCo-ZIF-9 was absent in the reaction system, the production of H2 and CO were reduced sharply (entry 5) clarifying AgCo-ZIF-9 acting as an important co-catalyst in CO2 photo-reduction.Replacing AgCo-ZIF-9 with Ag nanoparticles or physical mixture of Ag nanoparticles and Co-ZIF-9, both of them exhibited lower catalytic activity and selectivity than those of AgCo-ZIF-9 (entry 6 and entry 7).These results were strongly evidences to illustrate that only when silver NPs loading into Co-ZIF-9 can it promote the photoreduction of CO2.In addition, no CO was observed when high purity Ar gas was used to instead CO2 atomosphere."
  },
  {
    "title": "Conclusions",
    "content": "In this work, different amount of Ag NPs was introduced into Co-ZIF-9 through photodeposition method to investigate the effect of Ag NPs to the reactivity of Co-ZIF-9 in CO2 photo-reduction.With the assistant of photosensitizer, Ru(bpy)3Cl26H2O (bpy 4,4'-bipyridine) and electron donor TEOA, photo-induced conversion of CO2 to CO was realized using AgCo-ZIF-9 as photocatalyst.With the increase of loading amount of Ag NPs, the generation of CO enhanced obviously while the evolution of H2 decreased.These results indicated Ag NPs in Co-ZIF-9 may serve as electron trap as well as active site in CO2 reduction.Comparing with pure Co-ZIF-9, the reactivity of AgCo-ZIF-9 increases more than 2 folds and the selectivity enhances about 20 within 0.5 hour's irradiation of visible light ( 420 nm).To our knowledge, this is a rare example which directly illuminates the effect of Ag NPs to the efficiency of MOF materials in CO2 photo-reduction.This work demonstrates a possible way through the use of silver NPs to promote the efficiency of visible-light photocatalytic CO2 reduction under mild reaction conditions. A c c e p t e d M a n u s c r i p t prominent diffraction peaks at 2 37.0, 43.0, 63.2, 76.3, corresponding to 111, 200, 220 and 311 crystal planes of zero valent Ag FCC crystal. Figure 1.a) PXRD patterns of the AgCo-ZIF-9 (5.36 wt ), Co-ZIF-9 and Co-ZIF-9 (simulation); b) SEM, c)TEM and d) HRTEM images of AgCo-ZIF-9 (5.36 wt ); TEM-Mapping images of e) Co, f) Ag, g) N, h) C. A c c e p t e d M a n u s c r i p tCo-ZIF-9 which could largely enhance their charge transfer efficiencies. Figure 2. XPS survey spectrum and the deconvoluted XPS of the AgCo-ZIF-9 (5.36 wt ), Typical wide survey a) and high resolution XPS spectrum of C 1s b); N 1s c); O 1s d); Co 2p e); Ag 3d f). Figure 3. UV-vis spectra of the AgCo-ZIF-9 and AgNPs. Figure 4. a) The yield of CO and H2 in the CO2 photoreduction system based on different catalysts; b) The stability test of AgCo-ZIF-9 in four cycles. Reaction conditions: Ru(bpy)3Cl26H2O (10.0 mmol), :1), TEOA(1 mL), CO2 (1 atm), 420 nm, 20C, 30 min.b CO Selectivity mol(CO)/mol(COH2).c Using AgCo-ZIF-9 (5.36 wt).d In the dark.e Not detectable.f Without Ru(bpy)3Cl26H2O.g Without TEOA.h Without AgCo-ZIF-9.i Replacing AgCo-ZIF-9 with Ag NPs.j The physical mixture of 0.05 mg Ag nanoparticles and 0.95 mg Co-ZIF-9.k Replacing CO2 with Ar. l The reaction conditions of photocatalysisa This work was financially supported by the NSFC of China (No. 21601032, 21471027, 21671034, 21771035), Changbai Mountain Scholars of Jilin Province."
  }
]