[
  {
    "title": "Doi",
    "content": "10.1039/d0nr08314c"
  },
  {
    "title": "Article_Title",
    "content": "The simultaneous adsorption, activation and <i>in situ</i> reduction of carbon dioxide over Au-loading BiOCl with rich oxygen vacancies"
  },
  {
    "title": "Abstract",
    "content": "The main process of carbon dioxide (CO 2 ) photoreduction is that excited electrons are transported to surface active sites to reduce adsorbed CO 2 molecules.Obviously, electron transfer to the active site is one of the key steps in this process.However, current catalysts for CO 2 adsorption, activation, and electron reduction occur in different locations, which greatly reduce the efficiency of photocatalysis.Herein, through a spontaneous chemical redox approach, the plasmonic photocatalysts of Au-BiOCl-OV with enhanced interfacial interaction were fabricated for visible light CO 2 reduction through the simultaneous adsorption, activation and in situ reduction of CO 2 without a sacrificial agent.By loading gold (Au) on the oxygen vacancy (OV), Au and BiOCl-OV formed a direct and tight interface contact, whose fine structure was confirmed by SEM, TEM, EPR and XPS, which not only effectively boosts the light utilization efficiency and the light carrier separation ability, but also can simultaneously adsorb, activate and in situ reduce carbon dioxide for highly efficient visible light photocatalysis.Thanks to the synergistic influence of Au and OV, Au-BiOCl-OV exhibits excellent photocatalytic performance without sacrificial agent and outstanding stability with a high CO and CH 4 production yield, reaching 4.85 mol g -1 h -1 , which were 2.8 times higher than C-Au-BiOCl-OV (obtained by traditional NaBH 4 reduction).This study proposes a new strategy for the production of high-performance collaborative catalysis in photocatalytic CO 2 reduction. Electronic supplementary information (ESI) available: Schematic illustrations of BiOCl, SEM and HRTEM images, XPS spectra, performance comparison, and Lifetime fitted from TRPL spectra.See"
  },
  {
    "title": "Experimental",
    "content": "For synthesizing BiOCl with an oxygen vacancy, 0.0025 mol Bi (NO 3 ) 3 5H 2 O was mixed with 40 ml ethylene glycol (EG) under vigorous stirring for about 30 min.Then, 0.0025 mol potassium chloride (KCl) was added and stirred for 30 min.The solution was poured into a 50 ml autoclave.It was heated at 200 C for 8 hours.The resulting precipitation was collected, rinsed with H 2 O and ethanol, and dried in air at 70 C.The gray sample was marked as BiOCl-OV. To acquire x Au/BiOCl-OV, 0.5 g of BiOCl-OV was put into 200 mL distilled water containing HAuCl 4 4H 2 O.The mixture was then vigorously stirred in the dark for 5 h.The samples were washed and dried at 70 C.The photocatalysts with Au loadings of 0, 0.1, 0.25 and 0.5 wt were denoted as BiOCl-OV, 0.1 Au-BiOCl-OV, 0.25 Au-BiOCl-OV, 0.5 Au-BiOCl-OV, respectively. As a contrast, the sample C-Au/BiOCl-OV was prepared by traditional chemical reduction: 0. The photocatalytic CO 2 reduction was carried out in a closed reaction.The 0.05 g photocatalyst was ultrasonically dispersed, coated on quartz tablets, and 3 ml water was placed in the container.CO 2 gas was passed into the sealed container and washed with CO 2 gas three times.The Xenon lamp was used as a light source with a power of 300 W and a 420 nm filter to filter UV light.The temperature was kept at 20 C by condensing circulating water.After illumination, the resulting products were tested and detected by gas chromatography (CO and CH 4 ).(GC-9560, Shanghai Huaai Chromatographic Analysis Technology Co., ltd). The impedance of the catalyst was measured by CHI660E electrochemical workstation (Shanghai Chenhua).The catalyst as used as the working electrode, Pt as the counter-electrode, and Ag/AgCl as the reference electrode.A solution of sodium sulfate at 0.2 M was used for the electrolyte.The photocatalyst was coated on FTO flakes with a size of 1 1.5 cm."
  },
  {
    "title": "Results_and_Discussion",
    "content": "In this work, under mild conditions, Au was loaded onto BiOCl with oxygen vacancy and onto BiOCl-OV with oxygen vacancy by spontaneous redox reaction.The synthesis process is shown in Scheme 1.In the first step, BiOCl with oxygen vacancies (BiOCl-OV) were synthesized through a simple solvo-thermal method.In order to load the Au nanoparticles on the BiOCl-OV, HAuCl 4 and BiOCl-OV were mixed.When HAuCl 4 was added to the BiOCl-OV suspension, AuCl 4 -was easily adsorbed on the BiOCl-OV defect surface due to electrostatic attraction.After that, at room temperature, the mixed sample was continuously stirred for day and night.Compounds with different gold loads are synthesized by spontaneous chemical redox synthesis: the oxygen vacancies contain lone pairs of electrons with reductive properties, and the metal ion-deficient electrons possess oxidative properties. 39,40In the redox reaction, electrons contained in the oxygen vacancies take part in the reaction, transferring electrons to the adsorbed metal ion and reducing the metal ion.The reduced small Au was placed directly in the oxygen vacancies to facilitate the subsequent reduction of carbon dioxide.First, BiOCl with oxygen vacancies (BiOCl-OV) were synthesized.The scanning electron microscopy (SEM) picture showed that BiOCl-OV was composed of multiple layers of microspheres assembled from nanosheets of about 20 nanometers thick (Fig. S1a ).The high-resolution transmission electron microscope (HRTEM) imaging showed good crystallinity with a lattice fringe width of d 0.342 nm, corresponding to the (101) crystal face of BiOCl (Fig. S1b ).The XRD of BiOCl-OV is demonstrated in Fig. 1.The peaks at 2 values of 12.0, 25.9, 32.6, 33.6, 41.0, 46.8, 49.9, 54.2, 58.8, 68.3, and 77.7can be indexed to the (0 0 1), ( 101), (1 1 0), (0 1 2), (1 1 2), (0 2 0), (1 1 3), (1 2 1), (1 2 2), (2 2 0), and (1 3 0) crystal planes of BiOCl, respectively.Second, HAuCl 4 was added to the solution of BiOCl-OV.Neither the material with 0.1 Au-BiOCl-OV or the material with 0.25 Au-BiOCl-OV had an obvious Au nanometer diffraction peak.This can be attributed to the fact that the Au particles were too small and/ or too low in the Au load to be detected by XRD.With the increase of gold, the Au diffraction peaks can be seen on 0.5 Au-BiOCl-OV.This result indicated that the small size gold nanometer was successfully loaded on BiOCl through the oxygen vacancy.Compared to BiOCl-OV, the scanning electron microscopy (SEM) picture of Au-BiOCl-OV exhibited spherical shape structures with no significant difference (Fig. 2a), but an enlarged SEM can find that many nanoparticles are scattered on the sphere.The high-resolution TEM (HRTEM) images in Fig. 2b clearly show two crystal lattice stripes with widths of 0.342 nm and 0.235 nm, corresponding to the (101) crystal surface of BiOCl and (111) crystal surface of gold, respectively.Moreover, through the EDX element mapping test of Au-BiOCl-OV, the uniform distribution of Bi, O, Cl and Au elements can be seen (Fig. 2c), indicating that the gold nanoparticles were successfully loaded on BiOCl.The above results indicated that Au can be successfully loaded onto BIOCl through the oxygen vacancy without the addition of other reductants.In order to study the distribution state of Au, the HADDF-STEM test was further carried out, and it could be seen that Au was uniformly distributed on the material (Fig. S2 ), which was consistent with SEM results.SEM images of the C-Au-BiOCl-OV nanomaterials prepared by chemical reduction are shown in Fig. S3, where the Au load of the large particles can be seen (20 nm). In order to further study the role of the oxygen vacancy in the redox process of metal ions and analyze the synthesis mechanism of the reaction, detailed electron spin resonance (ESR) is used for illustration.As shown in Fig. 3, by testing the BiOCl-OV sample, it can be seen that a characteristic peak appears at g 1.9996, which indicates the existence of the oxygen vacancy, verifying again that the rich oxygen vacancies exist in the as-prepared BiOCl sample.When HAuCl 4 was added to BiOCl-OV, the characteristic peak strength of the synthesized compound decreased significantly after 24 h reaction.The reduction of the characteristic peak intensity implied the reduction of electrons in the oxygen vacancy.This phenomenon indicated that the electrons in the oxygen vacancies are transferred from the oxygen vacancy state to chloroaurate, and chloroaurate was reduced to the gold nano and loaded around the oxygen vacancies.The lone pair of electrons contained in the oxygen vacancies participate in the reaction, and are consumed by the metal ions. 41The gold nanometer supported at the oxygen vacancy can form a close connection with the oxygen vacancy, and the close combination of the two can facilitate the adsorption, activation, and reduction of carbon dioxide gas in the photocatalytic carbon dioxide process. To further study the information of each element in the BiOCl-OV and Au-BiOCl-OV semiconductor materials, XPS test was carried out.The XPS consequence of the BiOCl-OV and Au-BiOCl-OV were demonstrated in Fig. 4a-c, including Bi 4f, O 1s, and Cl 2p.Compared with pure BiOCl-OV, the characteristic peaks of various elements, including Bi, O and Cl, all clearly move towards high binding energy, indicating that the deposited gold can affect the surface structure of BiOCl-OV.Higher binding energies indicate that the material has lost electrons, indicating that the electron transfer from BiOCl-OV to Au had occurred. 42It should be noted that the oxygen vacancy directly loaded with gold enables the two to form a tight interface and boosts the transfer of electrons from BiOCl-OV to Au.Furthermore, the strong interaction between Au and BiOCl-OV was beneficial to advance the photocatalytic property of the catalyst.The same conclusion can be reached when analyzing the binding energy of Au 4f.As shown in Fig. 4d, Au had two characteristic peaks with binding energies of 83.7 eV and 87.4 eV, corresponding to Au 4f 7/2 and Au 4f 5/2 , respectively.Compared with the two characteristic peaks of gold: 84.0 eV (Au 4f 7/2 ) and 87.7 eV (Au 4f 5/2 ), 43 Au in Au-BiOCl-OV moved about 0.3 eV towards the low binding energy, indicating that gold was more receptive to transferred BiOCl-OV electrons after combination, mainly resulting from the close connection between the Au nanoparticles and BiOCl-OV. 44The tight connection between Au and BiOCl-OV was beneficial to the transfer of electrons, which was very important for the reduction of CO 2 .In contrast, C-Au-BiOCl-OV has been synthesized by reducing HAuCl 4 to gold nanoparticles by NaBH 4 .The XPS test results were shown in Fig. S4. Compared with BiOCl-OV, there was no significant change in the peak position, indicating that the connection between Au and BiOCl-OV was very weak in the material formed by external reductants.The superiority of the oxygen vacancy spontaneous redox method was further highlighted. The adsorption capacity of CO 2 was very important in the photocatalytic CO 2 reduction.In situ infrared spectroscopy was used to study the CO 2 adsorption capacity of the material, as shown in Fig. S5. With the extension of time, the CO 2 adsorption peak was stronger, indicating that Au-BiOCl-OV had a very good CO 2 adsorption capacity.The photocatalytic CO 2 reduction reaction for sample preparation was carried out under visible light, in a closed system filled with carbon dioxide, without the addition of other sacrificial agents except H 2 O.As shown in Fig. 5a andc, the products of CO 2 were CO and CH 4 .The amounts of photocatalytic products obtained by Au-BiOCl-OV were significantly higher than that of BiOCl-OV.All of the Au-BiOCl-OV photocatalysts showed improved activity to CO and CH 4 production compared to the pure BiOCl-OV catalyst.The formation rates of CO and CH 4 on the photocatalyst were calculated based on the production of CO and CH 4 in 10 hours (Fig. 5b andd).The rate of CO production over 0.1 Au-BiOCl-OV, 0.25 Au-BiOCl-OV, 0.5 Au-BiOCl-OV and BiOCl-OV was 1.667, 3.46, 2.34 and 1.31 mol g -1 h -1 .The rate of CH 4 production was 0.63, 1.39, 0.98 and 0.13 mol g -1 h -1 , respectively.The combined yield of CH 4 CO in Au-BiOCl-OV was 3.5 times that of BiOCl-OV, demonstrating the superiority of the gold reduction by oxygen vacancy for boosting the photocatalytic performance, which is comparable or superior to other reported BiOX systems (Table S1 ).In the photocatalytic reduction process, there was a synergistic relationship between the oxygen vacancy and gold nanometer, and too much or too little oxygen vacancies will reduce the catalytic efficiency.For comparison, the photocatalytic performance of C-Au-BiOCl-OV prepared by chemical reduction was lower, as shown in Fig. 5e andf.The rate of CO and CH 4 generation over C-Au-BiOCl-OV only was 1.47 and 0.28 mol g -1 h -1 , respectively.The above results indicate that through a spontaneous chemical redox approach, plasmonic photocatalysts of Au-BiOCl-OV with enhanced interfacial interaction were fabricated as advanced efficient photocatalysts for visible light CO 2 reduction through simultaneous adsorption, activation and in situ reduction of CO 2 without sacrificial agent.Moreover, it can be seen that the CO and CH 4 produced by 0.25 Au-BiOCl-OV were increased relative to BiOCl-OV, and the increase of CH 4 was greater.CH 4 was known to require an 8-electron reaction, which is much more difficult than a 2-electron CO reaction.The continuous photoelectron injection of BiOCl-OV into Au increases the free carrier density of Au, which tended to stabilize the SPR absorption of plasma photocatalysis and the production of hot electrons.A large number of electrons played a leading role in the catalysis, and promoted the reaction of 8-electron methane, which provided a new idea for the high calorific value production of CH 4 .Thanks to the triple role of the oxygen vacancy and the synergistic influence of Au, the performance of photocatalytic carbon dioxide reduction was significantly improved, especially the formation of CH 4 . The detailed information about the stability of the semiconductor materials has an important practical application value, and is of great significance for the future industrial carbon dioxide reduction reaction.Furthermore, to examine the stability, the 0.25 Au-BiOCl-OV photocatalyst was repeatedly used.As shown in Fig. 6, no significant time-dependent inactivation was observed in the 3-cycle (30-hour) trial.The slight decrease may be due to a small amount of oxygen vacancies being occupied during the reaction, and the activity was found to be restored by a simple vacuum drying process, similar to that reported previously. 45In sharp contrast, after the 3-cycle, the activity of the C-Au-BiOCl-OV reduced by chemical reagent was significantly reduced, as shown in Fig. S6. The cyclic experiments further show that the materials prepared by spontaneous redox method are more excellent in photocatalytic CO 2 reduction applications. To investigate the application of self-reducing catalysts in photocatalysis, the optical absorption capacity and band gap width of the material were tested by UV-Vis DRS.Spectra of BiOCl-OV, 0.25 Au-BiOCl-OV and C-Au/BiOCl-OV are shown in Fig. 7a.As can be seen from the figure, the light absorption performance of BiOCl-OV was stronger before 420 nm.In addition, the light absorption of the longer wavelength was weaker than that of 420 nm, and its band gap width can be calculated as 2.95 eV.The Au-BiOCl-OV showed two absorption bands, one of which was below 450 nm with a corresponding band gap of 2.56 eV, while the extensive SPR absorption induced by Au appeared at 470 nm to 750 nm with a center of 580 nm.It was worth noting that the absorption of C-Au-BiOCl-OV in the visible region was also enhanced, but not as much as that of 0.25 Au-BiOCl-OV in the relevant range.This enhanced light absorption capacity should be due to the strong interaction of Au and BiOCl-OV, resulting in the direct reduction of gold through oxygen vacancies, 46 which improved the photocatalytic efficiency of the 0.25 Au-BiOCl-OV photocatalyst. Photoelectric tests were adopted to study the separation efficiency of the photogenerated electron holes in the photocatalytic materials.By photoluminescence (PL), as shown in Fig. 7b, the PL intensity of the BiOCl-OV and C-Au-BiOCl-OV was higher than that of 0.25 Au-BiOCl-OV.The lower photoluminescence intensity usually indicated the lower photocarrier recombination rate, and the higher the photoactivity of the photocatalyst, the higher the charge separation efficiency. 47Moreover, the time-resolved fluorescence emission attenuation spectrum in Fig. 7c shows that compared with C-Au-BiOCl-OV (1.46 ns), 0.25 Au-BiOCl-OV had a longer life (2.43 ns) than BiOCl-OV (1.46 ns) (Table S2 ).On the other hand, as can be seen from the AC impedance, the EIS Nyquist plot in Fig. 7d showed a semicircle representing the charge transfer performance.The resistance of the charge transfer can be seen from the radius of the semicircle.The larger the radius, the greater the resistance to the charge transmission.The smaller the radius, the smaller the resistance to the charge transmission. 48The semi-circular diameter of 0.25 Au-BiOCl-OV was much smaller than those of C-Au-BiOCl-OV and BiOCl-OV, which indicated that the gold samples directly reduced by oxygen space can reduce the electron transport re- sistance through a strong interaction between them, which was conducive to charge transport and separation.These features provided solid evidence for enhanced photo-induced carrier separation and migration of the 0.25 Au-BiOCl-OV material, which was attributed to the strong interaction between Au and BiOCl-OV by spontaneous chemical redox reactions.The efficiency of the charge separation is the main factor affecting the catalytic activity of the photocatalyst. The separation efficiency of the photogenerated charge can also be reflected by the hydroxyl radical ( OH) produced in the photocatalytic process. 49In addition, surface OH generation was detected using 5,5-dimethyl-1-pyrrolidine-N-oxide (DMPO) as the collector. 50,51The peak strength of 0.25 Au-BiOCl-OV was the strongest, as shown in Fig. 8, indicating that the charge separation was significantly improved for the materials obtained from gold nanometers reduced by oxygen vacancy. In this study, the products in the photocatalytic CO 2 process of compound 0.25 Au-BiOCl-OV were CO and CH 4 in the presence of H 2 O.In the reduction process, the reaction steps were explained by the eqn (1)-( 6). eqn (1) and ( 2) explain the creation of the photoexcited electron-hole pairs.The reduction of carbon dioxide reacted in the semiconductor conduction band, while water was oxidized by the holes to form hydroxyl radicals and H , as explained in eqn (3) and ( 4).The process of eqn ( 5) and ( 6) of CO 2 convert to CO and CH 4 are shown. Through the above experimental test analysis, the mechanism of electron transfer and carbon dioxide reduction is shown in Fig. 9. Electrons in the BiOCl-OV valence band (VB) were excited by visible light.In the presence of the oxygen vacancy defects, electrons were transferred to the defect energy level.Since plasma Au nanoparticles were generated in the oxygen vacancies, electrons can be fleetly transferred to Au to participate in CO 2 reduction reactions.What is more, the free electrons of plasma Au were excited into high-energy hot electrons, under visible light irradiation, and the high concentration photogenerated electrons had a stronger ability to react with CO 2 , thus increasing the reaction of 8 electrons and promoting the generation of high calorific value methane."
  },
  {
    "title": "Conclusions",
    "content": "In summary, Au/BiOCl-OV composites were successfully prepared at room temperature by spontaneous chemical redox through oxygen vacancy.By loading gold on the oxygen vacancy, Au and BiOCl-OV formed a direct and tight interface contact, which not only effectively enhances the visible light utilization efficiency and the separation efficiency of the photogenic carriers, but also makes the absorption, activation and reduction of CO 2 occur in the same area during the process of CO 2 reduction.Au/BiOCl-OV exhibited a high CO and CH 4 production yield in the absence of the sacrificial agent, reaching 4.85 mol g -1 h -1 , which were 2.8 times higher than C-Au-BiOCl-OV.This strategy can also be used to fabricate other types of visible light active photocatalysts for high efficiency photocatalytic applications. Notes and references 5 g of BiOCl-OV was put into 200 mL H 2 O containing HAuCl 4 4H 2 O. Polyvinyl alcohol (PVA) was a surfactant, and Au/PVA 2 : 1 mg mg -1 .An aqueous solution of 0.1 M NaBH 4 (NaBH 4 /Au 4 mol mol -1 ) was injected rapidly.Deionized water was used to repeatedly wash and remove all dissolved substances, and the product was dried at 70 C.Characterization X-ray diffraction (XRD) was recorded on a Rigaku D/MAX 2500 X-ray diffractometer running at 200 mA and 50 kV with Cu K radiation.The morphology and composition of the catalysts were observed by scanning electron microscope (SEM) (HITACHI S4800) and transmission electron microscopy (TEM) (FEI Tecnai G2S-Twin) by a field emission at 200 kV.Highangle annular dark-field scanning transmission electron microscopy (HAADF-STEM) images of the samples were performed with a FEI Talos F200S.The optical absorption properties of the photocatalytic materials were tested by UV-Vis diffuse reflectance spectra (DRS) (Thermo 220 spectrophotometer).Transient fluorescence spectra were measured on the FS5 fluorescence spectrometer (Edinburgh Instrument) with an excitation wavelength of 310 nm.The oxygen vacancy of the material was tested by collecting electron spin resonance (ESR) spectra (Bruker EMX-8/2.7 X-band ESR spectrometer).X-ray photoelectron spectroscopy (XPS) spectra (PHI 1600 ESCA XPS system) were used to study the chemical composition.In situ FTIR spectra were obtained by a FTIR spectrometer (Bruker Optics, INVENIO S, Germany). This journal is The Royal Society of Chemistry 2021 Nanoscale, 2021, 13, 2585-2592 2587 Published on 08 January 2021.Downloaded by University of Prince Edward Island on 5/15/2021 12:50:53 PM. Fig. 1 XRD of the x Au-BiOCl-OV and BiOCl-OV sample. Fig. 2 Images of the 0.25 Au-BiOCl-OV sample: (a) SEM, (b) TEM and (c) EDX elemental mapping.Fig. 3 ESR spectra of the x Au-BiOCl-OV sample. Fig. 4 XPS survey spectra of 0.25 Au-BiOCl-OV.(a) Bi 4f, (b) Cl 2p, (c) O1s and (d) Au 4f spectra. Fig. 5 (a and c) The products CO or CH 4 over time.(b and d) CO or CH 4 yield of the as-prepared samples, (e and f ) the comparison of the CO or CH 4 yield of 0.25 Au-BiOCl-OV and C-Au-BiOCl-OV. Fig.6The recyclability test of the 0.25 Au-BiOCl-OV photocatalyst under light irradiation. Fig. 7 (a) UV-vis DRS, (b) PL spectra, (c) Fluorescence emission decay spectra and (d) electrochemical impedance spectra of BiOCl-OV, 0.25 Au-BiOCl-OV and C-Au-BiOCl-OV. Fig. 8 EPR spectra of DMPO- OH adducts over BiOCl-OV, 0.25 Au-BiOCl-OV and C-Au-BiOCl-OV. Fig. 9 Schematic illustration of the mechanisms of CO 2 photoreduction into CO and CH 4 over 0.25 Au-BiOCl-OV. Scheme 1The proposed synthesis process of the Au-BiOCl-OV material. This journal is The Royal Society of Chemistry 2021 This work was supported by the National Natural Science Foundation of China (21776059), and the Natural Science Foundation for Distinguished Young Scholars of Hebei Province (B2015208010). The authors declare no conflict of interest."
  }
]