[
  {
    "title": "Doi",
    "content": "10.1016/j.nanoen.2020.104717"
  },
  {
    "title": "Article_Title",
    "content": "A mechanistic study of molecular CO2 interaction and adsorption on carbon implanted SnS2 thin film for photocatalytic CO2 reduction activity"
  },
  {
    "title": "Abstract",
    "content": "Gas-phase photocatalytic reactions to convert carbon dioxide and water into oxygen and hydrocarbons are the foundation of life on earth.However, the efficiency of photosynthesis is relatively low (1), which leaves much room for artificial photosynthesis to reach the benchmark of the solar cells (15).In this work, carbon implanted SnS 2 thin films (C-SnS 2 ) were prepared to study photocatalytic activity and adsorbate-catalyst surface interactions during CO 2 photoreduction.The electron density distribution in C-SnS 2 and its contribution toward the photogenerated charge transfer process has been analyzed by the angle-dependent X-ray absorption nearedge structure (XANES) study.The C-SnS 2 surface affinity toward the CO 2 molecule was monitored by in-situ dark current and Raman spectroscopy measurements.By optimizing the dose during ion implantation, SnS 2 thin film with 1 wt carbon incorporation shows 108 times enhancement in the CO 2 conversion efficiency and more than 89 product selectivity toward CH 4 formation compared with the as-grown SnS 2 without carbon incorporation.The improved photocatalytic activity can be ascribed to enhanced light harvesting, pronounced chargetransfer between SnS 2 and carbon with improved carrier separation and the availability of highly active carbon sites that serve as favorable CO 2 adsorption sites."
  },
  {
    "title": "Experimental",
    "content": "Sulfur (99.99 Aldrich) and SnO (99.9 Alfa) powders were used as sulfur and tin sources, respectively, for the CVT process.All the chemicals were used as received without any further purification. The SnS 2 snowflakes were grown on a 300 nm thick SiO 2 /Si substrate via CVT method in a single-zone vacuum tube furnace in 1 atm.The SiO substrate was ultrasonically cleaned for 10 min prior to growth using deionized water, acetone, and isopropanol in sequence.In the CVT process, sulfur powder (0.5 g) was loaded into an alumina boat that was placed upstream outside the tube furnace at low temperature region of 160 C while the SnO (0.2 g) powder was kept at a hotter zone of 630 C in the furnace as shown in Supporting Information Fig. S1a.The SiO 2 /Si substrate was placed at the outlet of the tube furnace downstream, away from the center of the furnace.Prior to growth, the furnace was pumped down to 10 A 3 Torr and purged with high-purity Ar gas (99.9999) at a flow rate of 300 sccm for 30 min.In the SnS 2 thin-film growth process, the furnace was heated to 630 C for 15 min and maintained for an additional 10 min under Ar gas atmosphere at 65 sccm.Finally, the furnace was cooled to 350 C at 10 C/min followed by rapid cooling to room temperature to form the SnS 2 thin film on the SiO 2 substrate, hereafter denoted as SnS 2 . The controlled carbon implanted SnS 2 samples were prepared by using a medium current ion-implanter (ULVAC IMX 3500) equipped with multiple ion sources, as shown in Supporting Information Fig. S1b.The implantation depth versus carbon concentration profile was simulated using the SRIM program as mentioned in Fig. S2.A series of C implantations were introduced to the as-grown SnS 2 thin film sample with different ion doses.Through the SRIM program simulation and preliminary tests, the optimized carbon incorporation was performed at 5 keV and with an ion dose of 1x10 13 ions/cm 2 . The gas adsorbate and catalyst surface interactions were systematically studied by using a dark current and photocurrent measurement while the device was exposed to Ar, CO 2 , H 2 O, and CO 2 H 2 O ambient.The SnS 2 -based devices were placed inside a stainless steel chamber with a quartz glass window, and dark current and photocurrent measurements were performed therein.Prior to measurement recording, the device was heated at 350 K for 1 h to degas the surface absorbed species, and the entire device was then evacuated to 1x10 A 3 Torr for 12 h.The dark/photocurrent responses of SnS 2 and C-SnS 2 samples were measured in Ar, CO 2 , H 2 O, and CO 2 H 2 O ambient at an applied bias of 1 V and 1 atm pressure.In-situ Raman spectroscopy study on CO molecule adsorption behavior on the surface of the samples was carried out using a confocal micro-Raman microscope with a 532 nm laser and a 50 objective lens.We used a typical in-house built stainless steel reactor cell to perform in-situ Raman spectroscopy measurements.A control experiment was also conducted on the as-grown C-SnS 2 samples after degassing the sample by heating and pumping down the reactor for 2 h to remove any residual gas or humidity from the sample.Finally, for our sample measurement, we purged CO 2 gas (99.999 purity) and CO 2 H 2 O inside the reactor under 1 atm condition.In the control experiments under dark and light illumination, no distinct Raman bands were observed. The photocatalytic CO 2 reduction experiment was performed using an in-house built 10-ml stainless steel reactor at ambient temperatures (25 3 C).Before starting the photocatalytic experiment, the reactor was degassed at 50 C and then purged with nitrogen (N 2 ) for 1 h in order to remove any residual compounds and other gases and impurities from the reactor.Initially, CO 2 gas was purged into the reactor through the water at 10 sccm flow rate for 2 h to maintain a constant humidity level and equilibrium gas adsorption/desorption inside the reactor.A commercial halogen lamp (150 W) and AM1.5 were used as light sources and placed directly above the catalyst.In the photocatalysis batch reaction, the light was on for 6 h.The products were analyzed using gas chromatography equipped with a flame ionization detector (FID) at 150 C and a glass column (Porapak Q, 80-100 mesh).The injection and oven temperatures of the gas chromatography were set to 50 C and 105 C, respectively.A detailed schematic diagram of the experimental setup is shown in Fig. S1c. The crystal structures of the samples were characterized by X-ray diffraction (XRD) using CuK radiation (PANalytical X'Pert Pro, 14 1.54056 A).The UV-Vis absorption spectra were measured by a Jasco V-670 spectrophotometer using an integrated sphere method.The microstructure, morphology, crystal phase, and elemental compositions of all samples were characterized by HR-TEM (JEOL JEM-2100) and FESEM (JEOL, 6700F) equipped with an EDX detector.The X-ray near-edge spectroscopy (XANES) of the Sn, S and C K-edges measurements were carried out in the corresponding synchrotron radiation light source at the 01C, 16A, and 20A, respectively, beamlines of the National Synchrotron Radiation Research Center (NSRRC) in Taiwan.X-ray photoelectron spectroscopy (XPS) analysis was performed by using a PerkinElmer Physical Electronics PHI 5400 spectrometer with dual anode X-ray source (Mg, Al) and a spherical electron energy analyzer with microscale X-ray focusing range capability.The XPS peak positions were calibrated with respect to the carbon 1s peak at 284.6 eV."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Fig. 1a shows a typical TEM micrograph of the cross-sectional view of the SnS 2 layer, which forms a good contact and interface with the SiO 2 substrate.Fig. 1b,c shows standard HR-TEM images with the corresponding selected area electron diffraction (SAED) patterns along 001 direction in the insets, which clearly reveals the single-crystal quality of the as-synthesized SnS 2 and C-SnS 2 crystals.The interstitial carbon doping in SnS 2 increases the crystal lattice spacing and creates highly strained regions inside the SnS 2 crystal, which are illustrated by lattice fringe distortion as indicated in Fig. 1c. The crystal structure and phase purity of the as-grown SnS 2 and C-SnS 2 are analyzed by XRD (Fig. 1d) indicating high crystal quality and preferred orientation along the (001) plane.The identified diffraction peaks of the thin-film samples are located at 2 of 15.1 , 30.4 , 46.2 , and 63.01 and can be assigned to the (001), ( 002), ( 003) and (004) planes of SnS 2 , respectively.The XRD of the SnS 2 and C-SnS 2 thin-film reveals a highly textured and preferably oriented growth in the (001) plane without additional secondary phases.This result supports the reported commercial 2H phase single-crystal SnS 2 33,34.In addition, the small full-width-half-maximum of the rocking curve of XRD in the (00l) plane, with l 14 1, 2, 3, 4 from left to right as shown in Fig. S4, suggests the SnS 2 thin films are of high quality.The inset of Fig. 1d shows the enlarged view of the 001 peaks of SnS 2 and C-SnS 2 thin-films, and it clearly shows that carbon incorporation has induced a peak shift toward a lower 2 value by 0.13 .Fig. 1e presents the Williamson-Hall plot between cos() vs. 4sin(), which considers the Scherrer's term of crystal size and microstrain contributions for the peak broadening as a function of 2 35,36.The inset of Fig. 1e illustrates the tensile strain obtained from the slope of the linear fit of the data.The C-SnS 2 thin-film shows two times higher microstrain in comparison with the as-grown SnS 2 thin-film.This result is consistent with our HR-TEM analysis, which also reveals the crystal lattice expansion and microstrain formation after carbon is doped into the layers of SnS 2 .This induces tensile strain inside the SnS 2 crystal lattices after carbon implantation, which affects the optoelectronic properties of SnS 2 and the photogenerated charge separation process due to intra-crystal lattice defects.Similarly, recent reports have shown that tensile strain in SnS 2 leads to a change in the electronic band structure 37 and an improvement in catalytic CO 2 reduction by enhancing the charge carrier separation 26.The average crystallite sizes obtained from Scherrer's formula 38 are 55.1 and 51.5 nm in plane-normal direction for the SnS 2 and C-SnS 2 samples, respectively.The table in Fig. 1f represents the elemental composition of the SnS 2 and C-SnS 2 thin-film samples using energy-dispersive X-ray spectroscopy (EDS) obtained from scanning electron microscopy (SEM) elemental analysis.The composition analysis shows the carbon embedded in SnS 2 is around 5 atomic (1 in weight percentage).The corresponding SEM elemental mapping images with highlighted areas on both samples are shown in Fig. S3. The chemical states of the SnS 2 and C-SnS 2 samples are characterized by high-resolution XPS as shown in Fig. 2. Prior to qualitative analysis, the surfaces of the thin-film samples were cleaned by Ar ion etching to remove the contaminated adventitious carbon.Fig. 2a shows the typical XPS survey spectra of SnS 2 and C-SnS 2 samples in which both samples consist of Sn and S, with an additional carbon element observed in the C-SnS 2 sample.Moreover, Si and O peaks are also detected in the aforementioned elements, which are mainly attributed to the SiO 2 substrate.Fig. 2b, c shows the high-resolution XPS spectra of Sn 2d and S 2p for the as-grown SnS 2 film and illustrates typical characteristic binding energies of 495.0, 486.6, 161.7 and 162.9 eV for Sn 3d 3/2 , Sn 3d 5/2 , S 2p 3/2 , S 2p 1/2 chemical states, respectively.The spin-orbit splitting of Sn and S is shown at 8.4 and 1.2 eV, respectively.The observed binding energies of Sn 3d and S 2p spectra confirm the Sn 4 and S 2A chemical states of SnS 2 and are also consistent with other literature reports 394041.Similarly, the C-SnS 2 thin-film sample demonstrated Sn and S peaks at around 494.8, 486.4,161.3, 162.5 eV, which revealed the Sn 3d 3/2 , Sn 3d 5/2 , S 2p 3/2, and S 2p 1/2 chemical states, respectively.Notably, the binding energies of both Sn and S in the C-SnS 2 thin-film sample shifted to lower levels compared with the as-grown SnS 2 thin-film sample.This shift is mainly attributed to the change in the Fermi level position towards the valence band maximum (VBM) due to the dipole formation resulted from specific charge transfer between the implanted carbon and the SnS 2 crystal.A similar observation has been reported for Si intercalated MoS 2 layers 42.Fig. 2d shows the C 1s spectra for the C-SnS 2 sample. More structural analysis of SnS 2 and C-SnS 2 thin-films deposited on SiO 2 /Si substrates was carried out by using Raman spectroscopy as shown in Fig. 3a.Both the SnS 2 and C-SnS 2 thin-films showed strong characteristic peaks of the out-of-plane A 1g and the in-plane E 2g atomic vibration modes of SnS 2 at around 314.2 and 204 cm A 1 , respectively.The atomic vibration modes in the C-SnS 2 thin-film showed a redshift of around 1.2 cm A 1 compared with the as-grown SnS 2 ; this could be attributed to induced tensile strain and lattice expansion, resulting from interstitial carbon implantation in SnS 2 .This result is consistent with the tensile microstrain observed by HR-TEM lattice d-spacing analysis and the XRD spectroscopy as shown in Fig. 1.Similarly, the level of tensile strain as a function of a shift in vibrational frequencies has been reported earlier based on computational Raman spectroscopy 37.The characteristic Raman signature of carbon has been systematically analyzed with respect to the amount of carbon concentration applied during ion implantation process in the C-SnS 2 thin-film.Fig. S5 shows the Raman spectra of carbon in the as-grown SnS 2 and C-SnS 2 thin-films with different carbon ion doses together with the Si/SiO 2 substrate signal.The Raman signature of carbon appears around 1570 cm A 1 , and its intensity shows an increasing trend with the implanted carbon dose. The optical properties of all as-prepared thin films were investigated by a UV-Vis diffuse reflectance spectrometer as shown in Fig. 3b.The absorption edge of C-SnS 2 is shifted to a higher wavelength, revealing 3(c andd).Fig. 3c shows the PL spectra of the SnS 2 and C-SnS 2 thin-film samples: both exhibit PL peak at around 534 nm (2.3 eV), corresponding to radiative recombination of photogenerated charge carriers.The observed PL peak position of the SnS 2 thin-film is consistent with prior reports 39,43,44.The normalized PL spectrum for C-SnS 2 shows almost a two-fold quenching compared with the as-grown SnS 2 thin-film, which indicates the suppression of electron-hole recombination due to the promoted resistance-free pathway for photogenerated carries after carbon implantation.In order to gain insight into the lifetime of the photogenerated electron-hole pairs, TRPL spectra were measured for the SnS 2 and C-SnS 2 samples at 534 nm emission.As shown in Fig. 3d, the data points were fitted by a second-order exponential function, and carrier lifetimes of 0.96 0.07 ns and 0.37 0.02 ns were observed for the SnS 2 and C-SnS 2 thin-films, respectively.The observed three-times shorter lifetime in C-SnS 2 is attributed to the fast electron delocalization to the surface, and hence the effective electron-hole separation.The suppressed electron-hole recombination and shorter lifetime in the carbon implanted SnS 2 may contribute to a significant impact in photogenerated charge separation on C-SnS 2 , thereby favoring the photocatalytic reaction with a facile charge transfer process. To gain insight about the charge transfer behavior and electronic distributions, angle-dependent XANES of the Sn and S K-edge are carried out on SnS 2 and C-SnS 2 samples 45,46.Fig. 4 (a,c) and (b, d) represent the Sn and S K-edge absorption spectra of the samples with a polarized angle at 0 and 70 with respect to the synchrotron beam, which corresponds to the electric field parallel to and nearly perpendicular to the sample surface, respectively.The XANES spectra (Fig. 4a,c) reveal that there is no change in the pre-edge and white line intensities of the Sn and S K-edge of the SnS 2 and C-SnS 2 samples when the electric field is parallel to the sample surface.However, we observed that at a 70 incident angle (the electric field nearly perpendicular to SnS 2 (00l) direction), the white line intensity of the Sn K-edge (Fig. 4b) in the C-SnS 2 sample increased a little while the S K-edge (Fig. 4d) white line intensity slightly decreased.The excitation of 1s core-level electrons of S into unoccupied valence orbitals and their interaction with Sn orbitals is observed in the S K-edge spectra.The two main peaks (2469.5, 2473.4 eV) shown in Fig. 4(c andd) possess the transitions to antibonding states made up of S 3p states mixed with the Sn 5s and Sn 5p states 47.Lefebvre et al. performed a tight-binding calculation of the electronic band structure of SnS 2 and confirmed these attributions 48.Similarly, the insets of Fig. 4(a-d) show the first derivatives of the Sn and S K-edge, which reveal the energy position of the rising edge based on charge transfer behavior 49,50.As shown in the inset, both SnS 2 and C-SnS 2 thin-film samples show no change in the energy position of the rising edge when the electric field of synchrotron radiation is along the in-plane direction.However, the rising edge position of the Sn K-edge in C-SnS 2 shifted to higher energy by 2 eV at 70 incidence x-ray (see inset Fig. 4b).These results show that Sn might lose electrons to the S, resulting in higher binding energy along the SnS 2 (00l) direction.In addition, this study reveals that the carbon interstitial in the SnS 2 layers has altered the electron density and charge transfer behavior on the SnS 2 surface which, in turn, contributes to the CO 2 adsorption and activation on the catalyst surface.From the carbon K-edge spectra (see Supporting Information, Fig. S6), it can be observed that, in the in-plane direction of the electric field, the white line is attenuated due to completely filled valence orbitals, while it increases along plane normal direction due to more unoccupied valence orbitals.This ultimately suggests a density of state change and enhanced charge transfer along plane normal direction after carbon incorporation in the SnS 2 flakes.This type of increased charge density toward the surface could be advantageous for the ease of activating and converting CO 2 molecules at the surfaces of thin-films. The charge transfer behavior and the binding ability of CO 2 molecules on the photocatalyst surface were investigated by using in-situ photocurrent and dark current measurements at a constant applied bias voltage (1 V) and 1 atm pressure.To verify the accuracy and feasibility of the device, the dark current response of the C-SnS 2 thinfilm samples in an inert gas (Ar) were examined and no change in a dark current was observed as shown in Fig. 5a.Interestingly, the SnS and C-SnS 2 samples showed a visible change in the dark current and photocurrent upon exposure of CO 2 and CO 2 H 2 O, respectively.Fig. 5b shows the photocurrent response of the as-grown SnS 2 sample under vacuum and its response in the dark as well as during light illumination under CO 2 and CO 2 H 2 O exposure.The observed photocurrent and dark current responses reveal that the as-grown SnS 2 sample interacted weakly with the CO 2 and CO 2 H 2 O adsorbates, and no significant changes were observed in the dark and light illumination under adsorbate exposure.In contrast, the C-SnS 2 sample demonstrated a high affinity toward CO 2 adsorption, and the interaction was further enhanced by nearly four times when CO 2 was introduced together with H 2 O.The enhancement in adsorbate-surface interaction in the dark was promoted in the presence of H 2 O due to the polar nature of water, which in turn enhanced the CO 2 adsorption on the catalyst surface.In both SnS 2 and C-SnS 2 samples, the dark current response, unlike the photocurrent response under CO 2 H 2 O, slightly decreased compared with CO 2 atmosphere.The decrease in photocurrent could be attributed to the change in resistivity and charge transfer behavior between the adsorbed gas molecules and the catalyst surface.We assume that under light illumination, CO 2 is adsorbed on the surface of photocatalyst and lowers the electron density during the photochemical reaction, which in turn causes the resistive loss. The external quantum efficiencies (EQE) of SnS 2 and C-SnS 2 are calculated based on photocurrent measurements taking into account the number of electrons formed per incident photon 51, as shown in Table 1.The number of detected electrons sequentially decreased when the samples were exposed to vacuum, CO 2 , and CO 2 H 2 O environments.The C-SnS 2 sample shows higher photon-to-electron conversion efficiency and higher electron consumption as compared to those of the as-grown SnS 2 sample.The SnS 2 shows a very small change in EQE when exposed to CO 2 (815.8) and CO 2 H 2 O (809.6); however, the C-SnS shows a significant change in EQE, from 2002 to 1485, at the same conditions.Photodetectors with EQE above 100 have been reported in a number of materials including SnS 2 flakes 51 and VO 2 microwire 52 as well as a few other systems cited therein.While the origins of the high EQE in SnS 2 films are not understood yet, the decrease in the number of electrons during light illumination could be an indication of electron consumption during a chemical reaction while solar fuels are formed. Meanwhile, we used confocal micro-Raman spectroscopy to perform in-situ studies on the interactions of the abovementioned adsorbates on the surface of catalysts.Fig. 5d shows vertical (Z-position) Raman mapping, which clearly reveals that the observed Raman signals are due to the adsorbate-catalyst surface interactions.Fig. 5e, f shows the activated and non-activated adsorption states of CO 2 species under CO 2 and CO 2 /H 2 O co-feed conditions on the as-grown SnS 2 and C-SnS 2 thin-film surfaces 27.The observed Raman signal detected the lower and higher component of Fermi dyad (1/22) modes of the physisorbed CO 2 on the as-grown SnS 2 and C-SnS 2 thin-film surfaces.Recently, Kumari et al. observed similar Raman peaks for physisorbed CO 2 on Ag nanoparticles during photocatalytic CO 2 reduction 32.Furthermore, a slight drop in the peak intensities and lower wavenumber shifts were observed under CO 2 /H 2 O co-feed conditions.This change could be attributed to the depopulated ground state of the CO 2 caused by the interaction with the SnS 2 thin-films.Barrett et al. observed similar phenomena and revealed the Raman peak intensity drop, which might be due to the conversion of CO 2 molecules to CO 2 53.Interestingly, besides the 1/22 modes, the C-SnS 2 thin film revealed an additional peak at around 1409 cm A 1 , which corresponds to transitions from the lowest excited vibrational level of the adsorbed CO 2 29.The detection of this highly excited CO 2 on the C-SnS 2 surface indicates the correlation between carbon incorporation and active sites for the adsorption and activation of CO 2 , which consecutively enhances the photocatalytic CO 2 conversion at SnS 2 surface. The CO 2 conversion and product selectivity of the batch type gasphase photocatalytic reaction have been analyzed under simulated solar light and a gas chromatographer.To understand the effect of carbon on the photocatalytic activity, a series of prepared C-SnS 2 thin-film samples with different doses of carbon ions (1x10 A 12 , 1x10 A 13 , 1x10 A 14 ions/cm 2 ) were tested for photocatalytic CO 2 reduction activity as shown in Fig. S7.Fig. 6 shows the product formation yield upon CO 2 conversion of the as-grown SnS 2 and C-SnS 2 samples.The as-grown SnS 2 sample shows a very small amount of acetaldehyde (CH 3 CHO) formation with a product yield of 0.0086 mol/cm 2 .However, the CH 3 CHO formation by C-SnS is around 10 times higher than that of the as-grown SnS 2 sample.In addition to the CH 3 CHO formation, the C-SnS 2 sample produces 0.75 mol/cm 2 of methane (CH 4 ) with more than 85 selectivity.Additionally, in order to characterize the photocatalytic activity of C-SnS control, catalytic experiments are performed under the dark and visible light illumination in the absence of CO 2 at ambient temperature.The absence of detectable acetaldehyde and methane by GC analysis confirms the photocatalytic conversion of CO 2 under visible light.Additionally, to confirm the source of the photochemical reduction products an isotope tracer analysis was performed by utilizing 13 CO 2 as source material.Fig. S8 shows the gas chromatography-mass spectrometry (GC-MS) of isotope tracer analysis and revealed that the C-SnS 2 thin-film sample produced 13 CH 4 and 13 CH 3 13 CHO from the photocatalytic 13 CO 2 reduction.The recyclability and stability of the C-SnS 2 thin-film sample were also investigated as shown in Fig. S9.The C-SnS 2 thin-film sample demonstrated excellent recyclability with three consecutive 5 h photocatalytic test cycles under a visible-light source (AM 1.5 solar simulator).The recyclability result is shown in Fig. S9a.Similarly, photocurrent stability test under successive on/off illumination cycles was performed at ambient conditions under a bias of 1 V, as shown in Fig. S9b.Additionally, to confirm the photostability of as-prepared C-SnS 2 thin-film, the morphology and composition were analyzed and compared before and after photocatalytic reactions.Fig. S10 shows no obvious change occurs in the morphology and composition of the C-SnS 2 thin-film sample during a 24 h photocatalytic reaction. The photocatalytic conversion efficiency is calculated by considering the ratio of the number of electrons used to convert hydrocarbon fuels to the number of photons absorbed by the catalyst.The calculated conversion efficiency of C-SnS 2 is around 0.103 which is more than times higher than that of the as-grown SnS 2 .The comparison of selected SnS 2 based photocatalyst systems for CO 2 reduction is shown in Table S1. Fig. 6b illustrates the electronic band diagram acquired from the calculated Fermi levels of the SnS 2 and C-SnS 2 samples.A band edge shift in both the conduction band minima (CBM) and valence band maxima (VBM) by 0.24 and 0.13 eV, respectively, has been observed in the C-SnS 2 as compared with the as-grown SnS 2 sample.The C-SnS 2 has demonstrated a better coverage of the redox potentials for multielectron CO 2 reduction and H 2 O oxidation, which emanates from the change in optoelectronic properties due to the carbon incorporation in the SnS system.Based on the in-situ and angle-dependent XANES measurements, the interaction of CO 2 on the C-SnS 2 surface and charge transfer behavior composed with Sn and S orbitals are illustrated in the schematic diagram as shown in Fig. 6c.It has been reported that the VBM in the 2D SnS 2 system is mainly dominated by S-3p states, whereas the CBM predominantly consists of the mixture of S-3p and Sn-5s states 54.As discussed in previous sections, the electron transfer between Sn and S in the plane normal direction has been observed with a consequent improvement in CO 2 conversion due to interstitial carbon incorporation. To understand the insight into the photocatalytic CO 2 conversion to product distribution with a longer time batch reaction, we checked the CO 2 conversion behavior of the as-grown SnS 2 and C-SnS 2 thin-film under 24 h visible light irradiation.The product formation yields of CH 3 CHO and CH 4 on the prepared thin-film are plotted in Fig. S11.In the photocatalytic CO 2 reduction reaction, SnS 2 thin-film reveals the selective formation of CH 3 CHO.It is observed that the CH 4 formation on C-SnS 2 thin-film is more favorable compared to CH 3 CHO formation.Interestingly SnS 2 thin-film shows only CH 3 CHO formation.Although the photocatalytic product formation is increased on the C-SnS 2 thin film, however, the CH 4 formation is around 6 times higher than CH 3 CHO formation.During photocatalytic CO 2 reduction, the increase in CH 4 formation on the C-SnS 2 is presumably due to the photo-oxidation of CH 3 CHO in batch type reaction.In this photocatalytic batch process, the CO 2 reduced to CH 3 CHO with 10 electrons on the CB of C-SnS 2 thin-film (as shown below, equations ( 1)-( 3)), however, the photogenerated holes at VB site might dissociate the CH 3 CHO to CH 3 radical and CO due to photo-oxidation and finally, the CH 3 converted to CH 4 (equations ( 4)-( 6)).Though, the overall multistep CO 2 reduction process is more complex, we believe that the incorporation of carbon improved the charge transfer and provided active sites for favorable adsorption of CO 2 molecule over its SnS 2 counterpart, which leads to the few orders increased photocatalytic activity on C-SnS 2 thin film as compared to pristine SnS 2 .In addition, for pristine SnS 2 , due to its low activity and low production rate of CH 3 CHO, subsequent dissociation of CH 3 CHO and further photo-oxidation to form CH 4 (equations ( 4)-( 6)) might be inactive. Hence, the improved photocatalytic CO 2 conversion activity of the C-SnS 2 sample could be ascribed to the following optoelectronic changes due to the incorporation of carbon in the SnS 2 system: (i) the availability of CO 2 adsorption sites on the C-SnS 2 sample as confirmed by the in-situ Raman and in-situ dark current responses measured under the CO 2 environment; (ii) pronounced charge-transfer taking place between Sn and S together with carbon for C-SnS 2 to the catalyst surface, which is supported by the change in photocurrent response measured under illumination in the presence of the adsorbates; (iii) the availability of electron density, which is the primary force to activate the CO 2 molecule on the catalyst surface, as resolved by using angle-dependent XANES technique; (iv) the reduced electron-hole recombination and improved photogenerated carrier mobility to reach the catalyst surface as confirmed by the PL and TRPL in the C-SnS 2 sample; (v) furthermore, the enhanced light-harvesting ability of the C-SnS 2 as compared with the as-grown sample."
  },
  {
    "title": "Conclusions",
    "content": "In summary, high-quality SnS 2 thin-films were synthesized through a chemical vapor transport process followed by controlled carbon implantation to form C-SnS 2 .Our material design and characterization approaches, which involved in-situ observations, enabled us to correlate the adsorbate-catalyst surface interactions and their implications on photocatalytic CO 2 reduction.Using in-situ dark current and Raman spectroscopy studies, we have demonstrated that the C-SnS 2 surface exhibited a strong affinity toward CO 2 molecule and higher photon to electron conversion efficiency under light illumination.The optimized carbon implanted SnS 2 sample demonstrated more than two orders of magnitude enhancement in the CO 2 conversion efficiency and about 89 product selectivity toward CH 4 formation.Furthermore, we observed that the carbon incorporation altered the optoelectronic properties of the SnS 2 and resulted in enhanced photocatalytic performance.The angle-dependent XANES study indicates the change in the electron density distribution in C-SnS 2 and its contribution toward the photogenerated charge transfer process. We anticipate that the adsorbate-catalyst surface interaction studies applied in this study can be extended to future design and material selection in the gas-phase CO 2 photoreduction applications.The C-SnS 2 with its promising photocatalytic performance and high affinity toward CO 2 adsorption and activation may inspire the development of new semiconductor photocatalysts with metal or non-metal dopants toward viable photocatalysts for CO 2 reduction. Fig. 1.Morphology and structural properties.a) TEM cross-section image of C-SnS 2 .b) and c) HR-TEM image lattice fringes (top right inset: corresponding SAED patterns and bottom right inset: zooming lattice fringes of the rectangular highlighted areas) of SnS 2 and C-SnS 2 thin films, respectively.d) XRD pattern (inset: a zooming portion of (001) plane).e) Williamson-Hall plot.f) Elemental compositions. Fig. 2. The chemical composition analysis by X-ray photoelectron spectra (XPS).a) XPS survey spectra of SnS 2 and C-SnS 2 .b, c) Sn 3d and S 2p core-level spectra of SnS 2 .d-f) C 1s, Sn 3d, and S 2p core-level spectra of C-SnS 2 thin-film. Fig. 3. Optical and structural properties of SnS 2 and C-SnS 2 a) Raman spectra with a reference peak from Si/SiO 2 .b) UV-Vis absorption spectra (inset: Tauc plots for direct fittings).c) Photoluminescence spectra.d) TRPL with the corresponding carrier lifetime at 534 nm emission of SnS 2 and C-SnS 2 . Fig. 5. Adsorbate interaction on the catalyst surface a) Dark current response of C-SnS 2 under Argon exposure.(inset: I vs V ohmic contact response of the device.)b, c) Dark current/photocurrent response of SnS 2 and C-SnS 2 under CO 2 , CO 2 H 2 O and in vacuum environment.d) Raman vertical (Z-position) mapping confirming the Raman signals are from the sample surface.e) and f) Raman signal of CO 2 , on as-grown SnS 2 and C-SnS 2 samples respectively, indicating the extent of CO interaction on the sample surface with and without H 2 O. Fig. 6.Photocatalytic CO 2 reduction activity and the reaction mechanism.a) Cumulative CO 2 conversion of SnS 2 and C-SnS 2 during 6 h reaction time under a visible light source (AM 1.5 solar simulator).b) Comparative band diagram of SnS 2 and C-SnS 2 .c) Schematic diagram of the reaction mechanism and charge transfer behavior composed with Sn and S orbitals. The summary of photo-response characteristics for the SnS 2 and C-SnS 2 devices under different adsorbate molecules. T.Billo et al. This study was financially supported by the Ministry of Science and Technology (MOST) in Taiwan under the Academic Summit Project (106-2745-M-002-002-ASP and 107-2745-M-002-001-ASP), the Science Vanguard Project 108-2119-M-002-030 and MOST 106-2112-M-008-003-MY3.Financial support provided by the Sustainability Science Project of Academia Sinica (AS-SS-106-02-3) and Academia Sinica under Innovative Materials and Analysis Technology Exploration Program (AS-iMATE-108-31), the Center of Atomic Initiative for New Materials (AI-Mat), National Taiwan University (107L9008 and 108L9008), and the Featured Areas Research Center Program within the framework of the Higher Education Sprout Project by the Ministry of Education in Taiwan are also acknowledged.The authors thank the National Synchrotron Radiation Research Center (NSRRC), Taiwan, for X-ray beam time.Technical support from Nano-Core, the Core Facilities for Nanoscience and Nanotechnology at Academia Sinica in Taiwan, is acknowledged.org/10.1016/j.nanoen.2020.104717. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://doi."
  }
]