[
  {
    "title": "Doi",
    "content": "10.1016/j.jechem.2020.01.020"
  },
  {
    "title": "Article_Title",
    "content": "Cryo-induced closely bonded heterostructure for effective CO2 conversion: The case of ultrathin BP nanosheets/g-C3N4"
  },
  {
    "title": "Abstract",
    "content": "This is a PDF file of an article that has undergone enhancements after acceptance, such as the addition of a cover page and metadata, and formatting for readability, but it is not yet the definitive version of record.This version will undergo additional copyediting, typesetting and review before it is published in its final form, but we are providing this version to give early visibility of the article.Please note that, during the production process, errors may be discovered which could affect the content, and all legal disclaimers that apply to the journal pertain."
  },
  {
    "title": "Experimental",
    "content": "The bulk BP and 2D g-C 3 N 4 were prepared according to our previous works 28,29 (the specific operations could be seen in supporting information). 2D BP/2D g-C 3 N 4 was fabricated by freeze-drying treatment, and the typical process was as follows: dividing the prepared 2D BP solution (60 mg BP was dissolved in 100 mL IPA solution) into three for each having the equal weight, then pour 2D g-C 3 N 4 powder (180 mg, 113.33 mg and 80 mg) into solution to prepare 10, 15 and 20 FPCN suspension.Further freeze-drying treatment helped us to obtain the desired product, and then the obtained was placed in a tube furnace and calcined at 200 C for 2 h in nitrogen atmosphere to obtain the final material. All photocatalytic activity tests were carried out in online photoreaction system (Labsolar-6A, Perfectlight, Beijing).10 mg sample was put into 300 mL Pyrex reactor, and 12 mL solvent (4 mL H 2 O, 6 mL acetonitrile and 2 mL TEOA) was added to dissolve the sample.Then, sealed the reactor and evacuate the air, and pumped pure CO 2 into the reactor all the time until the pressure inside of the reactor was 75 kPa.The reaction was underway at low temperature (10C), when with the 300 W xenon lamp (PLS-SXE 300C (BF), Perfectlight) irradiation, then the obtained gas product was analysed by gas chromatograph (GC2002, KeChuang, Shanghai), equipped with a hydrogen flame ionized detector (FID) and a thermal conductivity detector (TCD).The selectivity was calculated by follow equation: selectivity () 2(CO)/2(CO) 8(CH 4 ) 2(H 2 ) 100, where (CO), (CH 4 ) and (H 2 ), represent the yielding rates for CO, CH 4 and H 2 , respectively."
  },
  {
    "title": "Results_and_Discussion",
    "content": "In order to explore the composition and structure of the composite, the material was first detected by X-ray diffraction (XRD) characterization.As what can be seen in Fig. 2(a), BP had been successfully prepared, showing the main peak at 16.8, 34.2 and 52.3 (JCPDS No. 74-1878), corresponding to the (002), (004), and (006) crystal planes, respectively, indicating that BP have a good crystal structure 30.Different from previous research works 22,29, the main diffraction peaks of BP can be clearly detected in the XRD diffraction pattern of the target composites.This could be summarized as the relatively high proportion of 2D BP participated and formed the 2D BP/2D g-C 3 N 4 heterostructure, and also reflected the BP nanosheets existing in the composite from the side, which maintained its original crystal structure.At the same time, the Raman spectrum (Fig. 2b) illustrated three vibration models A g 1 , B 2g and A g 2 of 2D BP with corresponding characteristic peaks at 361.1 cm -1 , 438.1 cm -1 and 465.3 cm -1 , respectively 18,30,31.By comparison, all of the three vibration models of 2D BP were blue-shifted, indicating the well-define thickness dependence of BP, which further elucidated that BP in the composite was 2D BP.This phenomenon of the shift could be assigned to the decrease of the interlayer van der Waals forces, which hindered the oscillation of P atoms of BP nanosheet so that the peak positions shifted to high wavenumber, further implying successful exfoliation from bulk BP into BP nanosheets 18,32.In addition, Fourier-transform infrared (FT-IR) spectroscopy was also performed to studying chemical structure of samples.According to the graph (Fig. 2c), the IR signal peaks of the composites were approximately the same as the pristine carbon nitride.The peak (813 cm -1 ) was characteristic of condensed heptazine heterocyclic ring (C 6 N 7 ) heterocycles.Fingerprint peak region from 1200 to 1700 cm -1 could be ascribed to the characteristic of conjugated heterocycles, exhibiting the structural skeleton of 2D g-C 3 N 4 .It should be noted that the signal region between 3000 and 3500 cm -1 can be attributed to the stretches of functional group (-NH 2 and -NH), indicating that the nitrogen atoms in the framework of g-C 3 N 4 partially suffer from hydrogenation 13,33.Therefore, composites and pure g-C 3 N 4 for comparison, no new signal peak was detected, demonstrating that no new bonds formed.This can also verify that BP nanosheet and g-C 3 N 4 nanosheet combined by Van der Waals force 29. The morphology of the samples bulk BP, 2D BP and composite was revealed by scanning electron microscopy (SEM), transmission electron microscopy (TEM), atomic force microscopy (AFM) and high-resolution transmission electron microscopy (HRTEM).From Fig. S1(a-c), the general morphology of BP (from bulk to 2D) was shown, the 2D free-standing nanosheet possessed horizontal size of approximately several hundred nanometers.Furthermore, in Fig. S1(d-f), the corresponding mapping showed that BP contained a small amount of O element that could be caused by a small amount of adsorbed oxygen and water on the new-born BP, which disappeared with chemical change during the period from sample preparation to testing 20. Moreover, the morphology of composite (15 FPCN) was given in the Fig. 2(d,e), and the thickness of exfoliated BP was investigated (Fig. S2) via AFM measurement, which was about less than 1 nm, implying that BP nanosheets were few-layer thickness.In addition, via HRTEM detection means, the lattice pattern of the 2D BP nanosheet was abnormally clear in the 15 FPCN and the interplanar spacing was 2.63 A, which can be attributed to the 004-crystal plane, further indicating the existence of 2D BP (Fig. 2f).Furthermore, SEM and corresponding mapping of 15 FPCN (Fig. S3a-d) also mainly confirmed the presence of C, N, and P elements, which was highly consistent with the results of TEM and HRTEM.When referred to specific surface area, specific surface area of composite (15 FPCN in Fig. 3a) was up to 170.25 m2/g with corresponding pore size.Theoretically, high porosity would ensure the existence of a large number of active sites and large surface areas 34,35.Compared to pure g-C 3 N 4 and other proportioned composites, the participation of a higher amount of black phosphorus, the specific surface reduced (Figs.S4 and3a), but the activity enhanced.Moreover, two 2D materials were constructed via Van der Waals force.For further explanation, the Zeta potential test was carried out (Fig. 3b).Two monomers surfaces showed the negative charge and all values were between -10 mV and -30 mV, indicating that the corresponding aqueous solution was not very stable.As for the 15 FPCN, interestingly, after loading 2D BP, surface charges of g-C 3 N 4 changes from -18 mV (negative) to 4.5 mV (positive), this could be assigned to tight connection two materials 36,37.And its potential value was under 5 mV, implying that it was in a fast condensing state and the attraction between the surfaces was much greater than the repulsive force, and also showed that the composite was successfully prepared and was relatively stable.Moreover, to explain the interfacial behaviour between the two materials well, XPS spectra of 2D BP and 15 FPCN were measured.In the XPS survey spectrum (Fig. S5), it was obvious that the binding energy about P element in composites becomes lower, this could be ascribed to the increase of the electron density of the BP.Besides, the valence of the corresponding elements was detected.From Fig. 4, many results could be concluded.Firstly, P 2p XPS spectrum of 2D BP had two intense peaks, at 129.9 and 130.8 eV, along with a weak and broad sub-band 134.1 eV, assigned to P 2p 3/2 and P 2p 1/2 of phosphorus-phosphorus bonds, and P 2 O 5 , respectively. Interestingly, the shape P 2p XPS spectrum of 15 FPCN was similar to that of 2D BP nanosheets with 0.4 eV declination between peak and its counterpart, illustrating that the electronic shell of the BP in 15 FPCN had received more electrons, and as a result, the electron density increased and the corresponding binding energy decreased.As for corresponding broad peak region from 131.6 to 136.0 eV, fitting curves demonstrated that it could be deconvoluted two peaks at 133.6 and 134.6 eV, which both can be attributed to existence of oxidized PO x , containing P-O-P (bridging bonding) and O-PO (dangling bonding) environments 38,39.Accordingly, the O 1s signal peaks of 2D BP and 15 FPCN could be owned to P 2 O 5 existence and showed that 2D BP was partially oxidized.Remarkably, N 1s XPS spectrum for 15 FPCN and 2D g-C 3 N 4 , the bonding energy of the former was higher than that of later, which showed the decrease of the electron density of 2D g-C 3 N 4 , the result was consistent with the increase of the electron density of 2D BP.Subsequently, the photocatalytic activity measurement of samples with different proportion of 2D BP for CO 2 reduction was proceeded systematically.We first tested the performance of different catalysts, among all samples in Fig. 5(a), 15 FPCN showed better performance (from CO 2 to CO) of all composites, and the CO generation rate was 187.7 mol g -1 h -1 , the numerical value was nearly twice as much as that of 2D g-C 3 N 4 .At the same time, its selectivity was up to 92.55.It should be also mentioned that changing BP shape from bulk into nanosheet could significantly promote its photocatalytic activity (from 22.1 to 97.1 mol g -1 h -1 ) and the competing reaction generating by-product (H 2 ) was always underway.Next, more attention was paid to 15 FPCN composite, the control experiments were done in the order shown in Fig. 5(b), comparing the column 1 and column 2 could prove that the catalyst does work in photocatalysis process and comparison between column 1 and column 3 indicates that the visible light was essential; when changing the air condition from CO 2 to Ar, only H 2 can be still traced so that the carbon element of CO comes from CO 2 (column 4).To more fully study 15 FPCN more completely, cycle tests were processed and the results showed that the rate of CO 2 reduction had slight decreased, it means the composite had better stability (Fig. 5c).In addition, the XRD characterization of the samples before and after the reaction was carried out.The XRD patterns (Fig. S6) showed that intensity of all peaks of used photocatalyst was lower than that of fresh sample, but all peak locations were corresponded, which indicated stability of the sample.The external quantum efficiency (EQE) at different wavelengths was also calculated, and calculated process and results were shown in Fig. S7 and Table S1.Compared with other CO 2 reduction systems (Table S2), the 15 FPCN showed excellent activity, which could be owing to the tight contact in 2D BP/2D g-C 3 N 4 heterostructure induced by low temperature. After obtaining the activity data, to find the internal and external factors to explain the effective catalysis, a series of measurements had been done.At first, to have a better understanding about how BP's participation could modify the g-C 3 N 4 and enhance to deoxygenate As for light and charge responses, we designed experiments for both the monomer (s) (pure 2D g-C 3 N 4 and/or pure 2D BP) and one of composite (15 FPCN).For time-dependent photocurrent test, the target sample was dissolved in ethylene glycol solvent and painted in ITO glass with xenon lamp interval illumination every other 20 s for 5 cycles.In the Fig. 6(b), the BP monomer showed a lower photosensitivity, conversely, the performance of composite was obviously nicer than those of monomers, and this phenomenon showed that the participation of 2D BP could increase the number of photogenerated e -and h (electron and hole pairs) of 2D g-C 3 N 4 . Furthermore, we could conjecture that the excellent electrical conductivity of BP helped the electron and hole pairs (generated in 2D g-C 3 N 4 ) transfer in interface in quick speed, thereby, the behaviors of the recombination between electrons and holes reduced greatly 40,41.In addition, electrochemical impedance spectroscopy (EIS) measurement was also under study to confirm the migration of photogenerated carriers across the interfaces of target materials.All test species were treated as above-mentioned photocurrent test but without light irradiation part and test its electrochemical properties in impedance fluid.As the results shown in the Fig. S8, the radius of curvature of samples (namely 2D g-C 3 N 4 , 2D BP and 15 FPCN) was smaller one by one, it meant that 15 FPCN allowed a faster transfer of interfacial charges and lower resistance.At the same time, it could also demonstrate that the interfacial interaction between 2D BP and 2D g-C 3 N 4 promoted the photogenerated electrons separation and transmission. In addition, the length of the carrier's lifetime was also an important factor in photocatalytic process, so it was also taken into account and detected the lifetime of the carrier 42,43.In principle, the electron receives energy, from the ground state to the excited state, the excited state was unstable, and the photogenerated carriers could be easily combined to reduce the energy to form a more stable existence 44.The photo-generated carriers were combined and the energy was released to form a PL emission 45.From the test results in Fig 6(c), compared to the pure 2D g-C 3 N 4 , the 15 FPCN presented quenched photoluminescence (PL) emission, which indicated the participation of BP could slow down the recombination rate of photogenerated charges (electron and hole) or even suppress in the whole electrochemical experiment process 17. And fluorescence decay curves (Fig 6d ) were used for further explanation, after the introduction of 2D BP, the lifetime increased from 1.92 0.09 ns (2D g-C 3 N 4 ) to 2.07 0.13 ns (15 FPCN), slight increase implied that the combination of two materials could increase the possibility of recombination, however, appropriate rise in carrier lifetime allowed carriers to smoothly reach the surface of the material from the bulk, then migrated to the active site and reacted with the substrate, and enhanced the yield of target product (CO). To further understand transmission and separation behaviours of photogenerated charge, measurements of conduction band (CB) and valence band (VB) were proceeding.The general CB and VB of the heterostructure were determined via Mott-Schottky plot (M-S plot), the Tauc plots and XPS valence band spectrum.The M-S graphs (Fig. S9a andb) showed that the potential of the flat band of 2D BP was measured at -1.15 V vs. Ag/AgCl, corresponding -0.54 V vs. NHE, pH 0. Similarly, about 2D g-C 3 N 4 , its flat band potential (E FB ) was measured at -1.45 V vs. Ag/AgCl, corresponding -0.84 V vs. NHE, pH 0.And XPS VB value was given in Fig. S9(c) (XPS valence band spectrum) at 0.78 V (2D BP) and 1.84 V (2D g-C 3 N 4 ).Combining the E FB and XPS VB result, the new VB position of 2D BP and 2D g-C 3 N 4 was located at 0.24 and 1 V respectively. According to the Tauc plots, the band gap (E g ) of both 2D BP and 2D g-C 3 N 4 (Fig. 7a), 2D BP's E g was about 1.95 eV, this result could imply that the bulk BP was successfully exfoliated, and mainly existing in 2D BP form; and the other one's was 3.0 eV.Finally, the CB was calculated to be -1.71V and -2.0 V vs. NHE, pH0 46,47.For a proposed reaction mechanism, based on our experimental results and the above theoretical analysis, a brief but complete diagram of the reaction mechanism was shown in Fig. 7(b,c).As shown in Fig. 7(b), 2D BP and 2D g-C 3 N 4 constructed a typical Type I heterostructure. Thus, in the whole photoreduction process, the composite with the abundant and active sites and lager surface could generate the carriers (electrons and holes) under the light irradiation, the electrons transferred across the interface from 2D g-C 3 N 4 to 2D BP, meanwhile the holes moved toward 2D BP surface, so that both became rivals to compete.But we had added the sacrificial agent (TEOA), which can capture the hole with oxidizing ability, this could greatly help to reduce the probability of carrier recombination and be better to make photogenerated electrons reach the surface and active sites to convert CO 2 into CO (Fig. 7c).To further figure out what a crucial role the electrons played in CO 2 photoreduction catalysis, the in situ FT-IR spectroscopy was carried out and the intermediates were detected after 0/10/25 min irradiation (in Fig 8).By comparison, for 2D g-C 3 N 4 (Fig. 8a), the water (H 2 O, 1654 cm -1 ), formate (HCOO -, 1619 cm -1 ), bidentate carbonate (b-CO 3 2-, 1458 cm -1 and 1357 cm -1 ) and monodentate carbonate (m-CO 3 2-, 1298 cm -1 ) could be detected.Similarly, for 15 FPCN (Fig. 8b), the strong peaks located at about 1651 cm -1 (H 2 O), 1615 cm -1 (HCOO -), 1454 cm -1 and 1354 cm -1 (b-CO 3 2-), and 1296 cm -1 (m-CO 3 2-) 48,49.However, after introducing the 2D BP, the peaks of intermediates were stronger, implying that the composite had better activity.Thus, the electrons of 15 FPCN surface would attract CO 2 -derived species and be covered, which contributed to the better CO 2 photoreduction.Throughout the Fig. 8, the reaction pathway could be concluded: the CO 2 obtains the e -and form CO 2 -, then turns into HCOO -or CO 3 2-species to generate the final product CO 50,51."
  },
  {
    "title": "Conclusions",
    "content": "In conclusion, we successfully prepared 2D black phosphorus nanosheets, and then the black phosphorus nanosheets obtained were used to cryo-induce 2D BP/2D g-C 3 N 4 heterostructure.A series of characterizations were carried out to detect its morphology and crystalline structure and verified photochemical and electrochemical properties.The results showed that the separation rate of photogenerated carriers of closely boned 2D BP/2D g-C 3 N 4 heterostructure were boosted to enhance photocatalytic activity.The 15 FPCN heterostructure demonstrated better photocatalytic activity (evolution rate: 187.7 mol g -1 h -1 ) and great selectivity (92.55). Moreover, we provided the explanation and details of effective CO 2 reduction and a rational conversion pathway (CO 2 to CO).The present work not only shows good catalyst for efficient CO 2 conversion but also provides new ideas for designing low-cost and metal-free catalysts. Fig. 1.Schematic illustration of the synthetic process of 2D BP/2D g-C 3 N 4 (FPCN). Fig. 2. (a) XRD patterns of 2D BP, 2D g-C 3 N 4 , 10 FPCN, 15 FPCN, 20 FPCN; (b) Raman spectrum of bulk BP and 2D BP; (c) FT-IR spectra of 2D g-C 3 N 4 , 10 FPCN, 15 FPCN, 20 FPCN; (d) SEM, (e) TEM and (f) HRTEM of 15 FPCN. Fig. 3. (a) Nitrogen adsorption-desorption isotherms and the corresponding pore size distribution curve (inset) of Fig. 4. XPS spectra, O of (a) 2D BP and (d) 15 FPCN; P of (b) 2D BP and (e) 15 FPCN; N of (c) 15 FPCN Fig. 5. Photocatalytic CO 2 reduction performance.(a) photocatalytic CO 2 reduction rate of the samples; (b) control experiments of 15 FPCN under different reaction conditions; (c) photocatalytic stability of 15 FPCN. Fig. 6.(a) UV-vis diffuse reflectance spectroscopy of samples; the investigation of charge kinetics: (b) Fig. 7. (a) Tauc plots of 2D BP and 2D g-C 3 N 4 ; (b, c) illustration of the photocatalytic mechanism of 2D BP/2D g-C 3 N 4 system under visible-light irradiation. Fig. 8.In situ FT-IR spectra of (a) 2D g-C 3 N 4 and (b) 15 FPCN. This study was financially supported by the National Natural Science Foundation of China (21776118, 51902138), High-tech Research Key laboratory of Zhenjiang (SS2018002), Jiangsu Funds for Distinguished Young Scientists (BK20190045), Natural Science Foundation of Jiangsu Province (BK20190835), the Priority Academic Program Development of Jiangsu Higher Education Institutions, Key Laboratory of Electrochemical Energy Storage and Energy Conversion of Hainan Province (KFKT2019002), Construction funding of High-level teachers, Jiangsu University (4111510008) and the High Performance Computing Platform of Jiangsu University. The authors declare no competing financial interest. Cryo-induced closely bonded 2D BP/2D g-C 3 N 4 heterostructure had been prepared.And for the first time, it was used to capture CO 2 , which can effectively and stably convert CO 2 to CO."
  }
]