[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2021.120695"
  },
  {
    "title": "Article_Title",
    "content": "Ultrahigh surface density of Co-N2C single-atom-sites for boosting photocatalytic CO2 reduction to methanol"
  },
  {
    "title": "Abstract",
    "content": "Cobalt species as active sites for photocatalytic reduction of CO 2 to valuable products such as methanol have received increasing attention, however, it remains a huge challenge to achieve the high activity.Herein, a pyrolysis-induced-vaporization strategy was successfully employed to fabricate Co/g-C 3 N 4 single-atom catalysts (Co/g-C 3 N 4 SACs) with surface Co atom loading up to 24.6 wt.Systematic investigation of Co/g-C 3 N 4 SACs formation process disclosed that concentrated-H 2 SO 4 exfoliation of g-C 3 N 4 nanosheets (g-C 3 N 4 NSs) as the substrate followed by a two-step calcination process is essential to achieve ultrahigh metal loading.It was found that the ultrahigh-density of Co single-atom sites were anchored on the g-C 3 N 4 substrate surface and coordinated with two nitrogen and one carbon atoms (Co-N 2 C).These single dispersed Co-N 2 C sites on the g-C 3 N 4 surface were found to act not only as electron gathering centers but also as the sites of CO 2 adsorption and activation, subsequently, boosting the photocatalytic methanol generation during light irradiation.As a result, the methanol formation rate at 4 h (941.9 mol g -1 ) over Co/g-C 3 N 4 -0.2SAC with 24.6 wt surface Co loading was 13.4 and 2.2 times higher than those of g-C 3 N 4 (17.7 mol g -1 ) and aggregated CoO x /g-C 3 N 4 -0.2 (423.9 mol g -1 ), respectively.Simultaneously, H 2 (18.9 mol g -1 h -1 ), CO (2.9 mol g -1 h -1 ), CH 4 (3.4 mol g -1 h -1 ), C 2 H 4 (1.1 mol g -1 h -1 ), C 3 H 6 (1.4 mol g -1 h -1 ), and CH 3 OCH 3 (3.3mol g -1 h -1 ) products were detected over Co/g-C 3 N 4 -0.2SAC.Besides, the photocatalytic activity of the Co/g-C 3 N 4 -0.2SAC for the reduction of CO 2 to methanol was stable within 12-cycle experiments (48 h).This work paves a strategy to boost the photoreduction CO 2 activity via loading ultrahigh surface density single atomically dispersed cobalt active sites."
  },
  {
    "title": "Experimental",
    "content": "All used chemicals were analytical-grade reagents without any further purification before the experiment.Co(NO 3 ) 2 6H 2 O and dicyandiamide were purchased from Aladdin Reagent Corp. Anhydrous H 2 SO 4 (98), absolute ethanol (95), and silica sand (70-150 mesh) were purchased from Chengdu Kelong Chemical Reagent Corp. 99 13 C enriched 13 CO 2 was provided by Chengdu Keyuan Gas Corp. Dialysis bags were purchased from Viskase Corp (MD44, MW:3500). The bulk g-C 3 N 4 was prepared using a thermal polymerization method 24.Briefly, 20 g dicyandiamide was put into a porcelain calcination boat, then heated from 30 C to 550 C within 4 h and maintained at 550 C for 4 h under an air atmosphere.After that, the products were cooled down to 50 C naturally.The g-C 3 N 4 NSs were synthesized via a modified method from the literature 25.Firstly, 9 g bulk g-C 3 N 4 was dispersed in 90 mL anhydrous H 2 SO 4 and stirred for 1 h.Then, 90 mL of deionized water was gradually added to the g-C 3 N 4 /H 2 SO 4 mixture.Next, the clear solution was added to 300 mL absolute ethanol and stirred for 18 h.Finally, the sample was dialyzed to neutral with a dialysis bag (height: 30 cm, width: 6 cm, solution volume: 20 mL; membrane cutoff: 3500 kDa) in deionized water to remove both residual SO 4 2-and ethanol, then collected after drying at 60 C. The Co/g-C 3 N 4 was prepared using Co(NO 3 ) 2 6H 2 O and g-C 3 N 4 NSs as the precursors.Specifically, the required amount of Co(NO 3 ) 2 6H 2 O and 2.0 g of as-synthesized g-C 3 N 4 NSs was mixed with deionized water.After drying on a hot plate, the obtained mixture was put into a semiclosed porcelain boat with a cover.The mixture was heated in a tube furnace to 130 C within 11 min under Ar flow.It was kept at this temperature for 9 h, then heated to 550 C with a heating rate of 8.67 C/min, and maintained at this temperature for 1 h.The sample was washed five times with 30 mL deionized water after cooling down.Cobalt atoms were successfully anchored on the surface of the g-C 3 N NSs during the pyrolysis-induced-vaporization strategy by a two-step calcination process.Fabricated samples were marked as Co/g-C 3 N 4 -x, where x was the desired weight ratio of Co atoms to g-C 3 N 4 NSs.For example, Co/g-C 3 N 4 -0.2 refers to the desired weight ratio of Co atoms (0.4 g, the corresponding weight of Co(NO 3 ) 2 6H 2 O precursor is 0.99 g) to g-C 3 N 4 NSs (2.0 g) of 0.2. For comparison, a sample was prepared using Co(NO 3 ) 2 6H 2 O (0.99 g) and g-C 3 N 4 NSs (2.0 g) at identical conditions but without an intermediate heating step (one-step calcination) at 130 C for 9 h, was designated m-Co/g-C 3 N 4 -0.2.A sample prepared via the one-step pyrolysis of the mixture of Co(NO 3 ) 2 6H 2 O (0.99 g) and bulk g-C 3 N 4 (2.0 g) was named T-Co/g-C 3 N 4 -0.2.Moreover, a sample fabricated using the Co(NO 3 ) 2 6H 2 O (0.99 g) and the bulk g-C 3 N 4 (2.0 g) at identical conditions was named CoO x /g-C 3 N 4 -0.2. X-ray powder diffraction (XRD) patterns were obtained on a PANalytical X pert diffractometer with Cu K radiation (40 kV, 40 mA).The scanning electron microscopy (SEM) was performed on a JEOL JSM-7800F microscope.The transmission electron microscopy (TEM) and high-resolution TEM (HR-TEM) were collected on a Tecnai G2 F30 electron microscope operating at an accelerating voltage of 200 kV.The X-ray photoelectron spectroscopic (XPS) measurements were performed using a Thermo ESCALAB250Xi X-ray photoelectron spectrometer and all of the binding energies were calibrated to the C 1s level of adventitious carbon species (peak at lower binding energy) at 284.8 eV.Aberration-corrected high-angle annular dark-field scanning transmission electron microscopy (AC-HAADF-STEM) images and the related energy-dispersive X-ray spectra (EDX) were recorded on a Themis Z with an FEI Super X-EDX system and a double-corrected FEI Titan Themis TEM at 300 KV.The UV-vis diffuse reflectance spectra were recorded at room temperature on a Shimadzu UV-2600 spectrophotometer with an integrating sphere using Ba 2 SO 4 as the reflectance standard.The photoluminescence (PL) spectra were measured using a fluorescence spectrophotometer (Hitachi F-7000FL).The Fourier-transform infrared (FT-IR) spectra were acquired on a Nicolet 6700 spectrometer with samples pressed into KBr pellets.The CO 2 adsorption isotherms at 25 C and CO temperature-programmed desorption (CO 2 -TPD) profiles of the samples (catalyst: 50 mg; carrier gas: Ar; temperature increasing rate: 10 C min -1 ; CO 2 adsorbed at 25 C) were acquired on ASAP 2020 V4.00 and ASAP 2920, respectively.The samples were pretreated at 200 C for min at Ar atmosphere before CO 2 adsorption isotherms and CO 2 -TPD tests.The products of the isotopic labeling experiment were analyzed by a quadrupole mass spectrometer (MS, Pfeiffer Vacuum OmniStar GSD 320 O1).Inductively coupled plasma optical emission spectroscopy (ICP-OES) measurements were performed on an Agilent 730 ICP-OES spectrometer to determine the concentration of metal species and elemental analysis (EA) was performed on a Vario EL III (Elementar) to determine the concentration of C, N, H, O, and S species.The simultaneous thermogravimetric-differential scanning calorimetry-mass spectrometer analysis (TG-DSC-MS) was used to study the formation process of Co/g-C 3 N 4 SAC, conducted in a flow of Ar with a NETZSCH STA 449F3 thermal analyzer equipped with a QMS 403 D mass spectrometer.In addition, the mixture of Co(NO 3 ) 2 6H 2 O (0.99 g) and g-C 3 N 4 NSs (2.0 g) was kept at 130 C for 1 h during the TG-DSC-MS testing process. X-ray absorption spectra (XAS) in terms of X-ray absorption near edge structure (XANES) and extended X-ray absorption fine structure (EXAFS) were measured at the CAT end station of the CAT-ACT beamline at the Synchrotron Radiation Source at KIT, Karlsruhe 26.The samples were measured ex-situ at the Co K absorption edge in transmission mode in the form of pellets diluted with cellulose.The spectra were normalized and the X-ray absorption fine structure spectra (EXAFS) background was subtracted using the ATHENA program from the IFFEFIT software package 27.The k 3 -weighted (k) data in the k-space ranging from 3 to 13 A -1 (multiplied by a Hanning window function with dk 1.0 A -1 ) were Fourier transformed to obtain radial distribution functions (R space).To obtain the detailed structural parameters around Co atoms in the as-prepared samples, quantitative curve-fittings were carried out for the Fourier transformed k 3 (k) in the R-space between 1.2 and 3 A using the ARTEMIS module of IFEFFIT.Effective backscattering amplitudes F(k) and phase shifts (k) of all fitting paths were calculated by the ab initio code FEFF 6.0.During the fitting of the Co/g-C 3 N 4 -0.2 sample, the amplitude reduction factor S 0 2 was fixed to the best-fit value of 1.00, and the Co-N coordination number (CN) was fixed to 2.0 and the Co-C coordination number (CN) was fixed to 1.0 while the interatomic distance (R), the Debye-Waller factor ( 2 ), energy shift (E 0 ), were allowed to vary.The fit quality was then evaluated using R-factor and reduced Chi-square.The wavelet transformed (WT) of EXAFS spectra were obtained using the WTEXAFS program 28. Photocatalytic activities of the as-prepared samples were evaluated in a closed system with a quartz window under ambient temperature and atmospheric pressure.The detailed information could be found in our previous report 29,30.In detail, 5.0 mg of the photocatalyst was firstly dispersed in 5 mL pure water in a Petri dish with an area of 44.2 cm 2 , then dried at 90 C. Then the sample was placed in the middle of the 276 mL reaction cell with a stirring bar at the bottom.Ar (99.999) gas was flushed through the reaction system to completely exchange the air and then both 4.0 mL of CO 2 (99.999) and 1.0 mL H 2 O were added into the reaction system.After that, the reactor was irradiated from the top using a 300 W Xe lamp (CEAULIGHT Co., Ltd., China) at the light intensity of ca.1.5 W/cm 2 .1.0 mL of gas sample was taken out from the reactor every hour and used for the subsequent analysis by GC7900 gas chromatography (GC, Tian Mei Analytical Instrument Co., Ltd., China) equipped with a TXD-01 column, a nickel conversion furnace (NCF), a thermal conductivity detector (TCD) and a flame ionization detector (FID) to detect H 2 , CO, and CH 4 .C x H y O z products were determined by a 7890B gas chromatograph (GC, Agilent Technologies Inc., United States of America) with an HP/Plot-Q column.The photocatalytic CO 2 reduction activity experiments of each group were repeated at least three times.The isotope labeling experiments of 13 CO 2 reduction with H 2 O were performed under identical conditions with the reaction system described above. In-situ diffuse reflectance infrared Fourier transform spectroscopy (DRIFTS) measurements were performed at room temperature with a mixture of CO 2 (20 CO 2 /Ar) and H 2 O vapor (introduced by bubbling the gas flow through a water saturator at 40 C).This study was carried out using a Bruker Tensor II instrument equipped with a Harrick High-Temperature cell 303132.The photocatalyst (30 mg) was pretreated at 200 C for 15 min under 20 mL min -1 pure Ar gas (99.999) flow.After that, CO 2 with H 2 O vapor was continuously fed into the cell at mL min -1 for 35 min.In the circulation system, the mixture gas was allowed to reach adsorption-desorption equilibrium at the photocatalyst surface, and IR spectra were obtained every 1.5 min.After 35 min, the equilibrium was achieved, then the photocatalyst was illuminated with a PLS-FX300HU cold light lamp (Perfect light Co., Ltd., China; 700 mW cm -2 ) under the moist CO 2 gas flow condition, and the data were collected at regular intervals of 1.5 min. All photoelectrochemical measurements were performed on a CH660E electrochemical workstation (Chenhua Instrument, Shanghai, China) equipped with a one-pot type cell with a three-electrode system.The saturated calomel electrode (SCE) was used as the reference electrode, and Pt wire was used as the counter electrode.The working electrode was prepared by a doctor blade method.The mixture of a photocatalyst and Nafion (5.0 wt) was coated on a Fluorine-doped tin oxide (FTO) with a film thickness of ca.50 m and area of 4 cm 2 , which was further treated at 90 C for 3 h under Ar flow.Photocurrent-time and electrochemical impedance measurements of sample films at open circuit potential (OCP) were performed in 0.5 M Na 2 SO 4 . Density functional theory (DFT) calculations were carried out using the CASTEP module in Materials Studio based on the plane-wavepseudo-potential approach 33,34.The Perdew-Burke-Ernzerhof (PBE) functional of the generalized gradient approximation (GGA) was used as the exchange-correlation function 33,34.The ultrasoft pseudo-potential was employed to describe the interaction between valence electrons and the core.A vacuum spacing of 15 A was employed to eliminate interactions between layers.A kinetic energy cutoff of eV and Monkhorst-Pack special k-point meshes of 3 3 1 were used to carry out geometry optimization and electronic structure calculation.The optimized lattice constant of the bulk g-C 3 N 4 was a b 4.74 A and c 6.72 A and the model structure containing from 1 to 7 cobalt atoms, 24 carbon atoms, and 32 nitrogen atoms.During the geometry optimization, all atoms were allowed to relax without any constraints until the convergence thresholds of maximum displacement (0.001 A), maximum force (0.03 eV/A), and energy (1.0 10 -5 eV/atom) were reached 35.The 2 2 supercell of monolayer g-C 3 N 4 (001) was employed in the calculation."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The as-prepared g-C 3 N 4 without Co loading shows two representative diffraction peaks at around 12.6 and 27.9 corresponding to (100) and (002) planes, respectively (Fig. 1a) 24.Introduction of Co to g-C 3 N 4 caused a decrease in crystallinity, however, no peak shifts were observed in all samples, indicating that Co atoms were not doped into the g-C 3 N 4 matrix (Fig. 1a) 36.All diffraction peaks disappeared when the desired Co to g-C 3 N 4 weight ratio was higher than 0.1, implying that the long-range order in the atomic arrangement of g-C 3 N 4 was broken.The short-range order of g-C 3 N 4 in Co/g-C 3 N 4 -0.2 was confirmed to be maintained via FT-IR and XPS analyses (Fig. 1b-d).The basic units of g-C 3 N 4 such as CN heterocycle (1240-1649 cm -1 ) and triazine units (797 cm -1 ) were observed in Co/g-C 3 N 4 -0.2 (Fig. 1b) 37383940.The local framework composition of g-C 3 N 4 such as the C-NH x bonding structure, sp 2 -bonded carbon in N--C-N, and bridging N atoms in N-(C) 3 , and sp 2 -hybridized nitrogen atoms in C--N-C still existed in Co/g-C 3 N 4 -0.2 (Fig. 1c-d) 41,42.In addition, the atomic ratio of C to N in the Co/g-C 3 N 4 -0.2 sample was detected to be around 0.66, which was close to the C/N ratio (0.62) in the g-C 3 N 4 (Table S1).More importantly, obvious shifts to lower binding energy of C 1s, apart from the adventitious carbon species at 284.8 eV, and N 1s were observed in the Co/g-C 3 N 4 -0.2 sample (Fig. 1c-d) 43, implying that introduction of Co atoms to the g-C 3 N 4 surface increased the electron density of C and N atoms, which is believed to be helpful to capture photogenerated electrons under light irradiation 12.It is concluded that the structural skeleton of g-C 3 N 4 was not destroyed and Co atoms strongly interact with g-C 3 N 4 in the sample of Co/g-C 3 N 4 -0.2. No peaks assigned to cobalt species were observed in XRD patterns of all samples prepared via the pyrolysis-induced-vaporization strategy after two-step calcination (Fig. 1a).However, the one-step calcination of cobalt nitrate with bulk g-C 3 N 4 was easily aggregated to be CoO x (T-Co/ g-C 3 N 4 -0.2) (Fig. 1a), consistent with the previous literature 12.The TEM images of g-C 3 N 4 clearly show a thin-layer structure (Fig. S1a) without crystal lattice fringes (Fig. S1b).Thin layers were maintained in the Co/g-C 3 N 4 -0.2 (Fig. S1c).In addition, an obvious porous structure due to the H 2 SO 4 exfoliation was formed in g-C 3 N 4 and Co/g-C 3 N 4 -0.2.Similarly, the HR-TEM image of Co/g-C 3 N 4 -0.2 shows no crystalline lattices (Fig. S1d and inset of Fig. S1d).AC-HAADF-STEM image of the Co/g-C 3 N 4 -0.2 with bright folds and dark pores (Fig. S2a) confirms the porous structure.The corresponding EDX mapping results demonstrated that carbon, nitrogen, and cobalt elements were homogeneously distributed, giving direct evidence of highly dispersed Co in the Co/g-C 3 N 4 -0.2 (Fig. S2b-d). AC-HAADF-STEM was conducted to investigate the distribution of cobalt atoms in the Co/g-C 3 N 4 -0.2.The single bright dots can be ascribed to isolated metal atoms (Figs.2a andS3).The AC-HAADF-STEM-EDX proved that these dots are Co atoms (Figs.2b-e andS4).XANES and EXAFS spectroscopy at Co K-edge were conducted to further study the local structure of Co atoms on Co/g-C 3 N 4 -0.2 (Fig. 2f-g andi-j).The Co K-edge region of the XANES spectrum of the Co/g-C 3 N 4 -0.2 was markedly different from the cobalt foil and Co 3 O 4 reference spectra (Fig. 2f), however, similar to that of the CoO and Co(NO 3 ) 2 6H 2 O references, suggesting that the chemical state of Co in Co/g-C 3 N 4 -0.2 is 2.The high-resolution Co 2p XPS pattern (Fig. S5) of the Co 2p 3/2 peak at 781.7 eV was ascribed to Co 2 , further proving that the oxidation state of Co on the g-C 3 N 4 NSs surface was 2 444546.Pre-edge XANES of Co peak at 7708-7709 eV in Co/g-C 3 N 4 -0.2 was slightly shifted to lower energy as compared to that of CoO and Co(NO 3 ) 2 6H 2 O references (Fig. 2f).This might stem from the cobalt coordination to N and/or C atoms in Co/g-C 3 N 4 -0.2 other than the O atom because of the lower electronegativity of N and C elements as compared to the O element 13.It is generally believed that O atoms bonded with metal could be gradually substituted by metal-N/C during g-C 3 N 4 pyrolysis in an inert atmosphere 47.Because the metal-O bonds possess less thermodynamically favorable under those conditions as compared to that of metal-N/C bonds 47.Interestingly, Co scattering paths peak at around 2.17, and Co-(O)-Co scattering paths peak at around 2.61 were not observed in the Co/g-C 3 N 4 -0.2.These results strongly implied that cobalt species in the Co/g-C 3 N 4 -0.2 do not exist mainly in the form of Co phase /CoO x clusters or nanoparticles.Eventually, in combination with the AC-HAADF-STEM and related mapping results (Fig. 2a-e), one can infer that the Co species were tentatively assigned to be single atomically dispersed on Co/g-C 3 N 4 -0.2 (Co/g-C 3 N 4 -0.2SAC).This result was further validated by the wavelet transform (WT) analysis.The intensity maximum of Co foil and CoO is at around 6.7 A -1 assigned to Co neighbors, obviously different from Co/g-C 3 N 4 -0.2SAC with only one intensity maximum at around 3.7 A -1 (light element such as C, N) was observed as shown in Fig. 2h.To give further insights into the coordination of Co in the sample of Co/g-C 3 N 4 -0.2SAC, the corresponding FT EXAFS fitting was conducted to extract the structural information (Fig. 2i-j).The Co-N 2 C coordination moiety with 2.07 A of Co-N and 2.21 A of Co-C average bond lengths gives a reasonably good fit of the experimental Co/g-C 3 N 4 -0.2SAC FT EXAFS spectrum (Table S2).This is reasonable since Co-N 2 sites have been reported to be the most stable structure over Co-N-C SACs as found in both theoretical and experimental studies 13.All the above results leading us to conclude that Co-N and Co-C bonds formed in the first coordination shell around Co on the Co/g-C 3 N 4 -0.2SAC.In other words, single atomically dispersed Co sites with Co-N 2 C coordination in the sample of Co/g-C 3 N 4 -0.2SAC were successfully fabricated. The loading amount of Co in the Co/g-C 3 N 4 -x samples was determined by ICP-OES (Table S1).The Co/g-C 3 N 4 -0.2SAC showed an ultrahigh Co loading of 29.3 wt, which was a record value of the Co SACs (Table S3) 50.Simultaneously, the corresponding surface Co loading is calculated by the XPS to be 24.6 wt (6.9 at).The maximum loading of single Co atoms in the heptazine-based 2 2 supercell of monolayer g-C 3 N 4 (001) (32 N atoms and 24 C atoms) is calculated to be 6 atoms, in other words, the theoretical limit of the single Co atoms loading on the g-C 3 N 4 is 32.5 wt.This explains the fact that the second shell (Co-(O)-Co), which is ascribed to CoO x species, was observed by FT EXAFS in the Co/g-C 3 N 4 -0.25 sample with a Co concentration of 36.1 wt (Fig. S7).The surface Co loading of Co/g-C 3 N 4 -0.2SAC fabricated by pyrolysis-induced-vaporization strategy considerably exceeded that of previously reported Co/g-C 3 N 4 SACs 50,51.Previously, it was reported that single atomically dispersed Co atoms on the g-C 3 N 4 were more prone to aggregate to Co clusters during conventional Co SACs fabrication process with cobalt loading higher than 1.7 wt 12.Therefore, our strategy involving stepwise heating and g-C 3 N 4 NSs as the substrate is an efficient method to fabricate Co/g-C 3 N 4 SACs with ultrahigh surface loading of single atomically dispersed Co sites. It is important to figure out the formation mechanism of the single atomically dispersed Co sites with ultrahigh loading on g-C 3 N 4 .Two key points were found for achieving ultrahigh surface single cobalt atom loading of Co/g-C 3 N 4 SACs: (1) porous g-C 3 N 4 NSs as the substrate; (2) a two-step calcination process (Scheme 1).Firstly, the g-C 3 N 4 NSs were prepared using concentrated H 2 SO 4 exfoliation to obtain small porous structures (Fig. S8) 25.The color of g-C 3 N 4 NSs was completely converted from the faint yellow of bulk g-C 3 N 4 to white (Fig. S9).The XRD peaks at around 12.6 and 27.9 corresponding to (100) and (002) planes were significantly decreased, suggesting that the g-C 3 N 4 NSs have has smaller grains (Fig. S10) 52,53.Moreover, compared with bulk g-C 3 N 4 , the g-C 3 N 4 NSs exhibits higher surface area and higher pore volume (Table S1).Simultaneously, CoO x nanoparticles were found in the CoO x /g-C 3 N 4 -0.2 sample fabricated using the bulk g-C 3 N 4 as the substrate (Fig. S11).These results indicated that the g-C 3 N 4 NSs surface could provide much more separated N 2 C coordination sites for anchoring single atomically dispersed cobalt atoms and suppressing the cobalt atoms aggregation as compared to that of bulk g-C 3 N 4 . Secondly, the aggregation of single atomically dispersed cobalt atoms during pyrolysis of the mixture of Co(NO 3 ) 2 6H 2 O and g-C 3 N 4 NSs process can be prevented by two-step calcination.The formation process of Co/g-C 3 N 4 SACs during the two-step calcination procedure was studied using simultaneous TG-DSC-MS (Fig. 3).The g-C 3 N 4 NSs showed only 4.0 wt loss and no obvious endothermic peak in the range from 200 C to 400 C (Fig. 3a).However, the mixture of g-C 3 N 4 NSs and Co (NO 3 ) 2 6H 2 O precursors showed 30.9 wt mass loss.A very broad endothermic peak at 300 C was identified at this temperature range as exhibited in Fig. 3b, however did not appear in the case of g-C 3 N 4 NSs (Fig. 3a).This means that mass loss from 200 C to 400 C may be related to the decompose of Co(NO 3 ) 2 6H 2 O (H 2 O: m/z 17 and 18; N 2 : m/z 28).Simultaneously, the single endothermic peak at 300 C (Fig. 3b) is significantly different from the characteristic endothermic decomposition peak of the pure Co(NO 3 ) 2 6H 2 O and the mixture of Co (NO 3 ) 2 6H 2 O and bulk g-C 3 N 4 (sharp peak at approx.240 C) as reported previously 54,55.Such a phenomenon might be ascribed to the vaporization and decomposition of Co(NO 3 ) x species.On the one hand, Co species with purple color was observed on the walls of the quartz tube after pyrolyzing (Figs.S9d andS12a).In contrast, almost none of the Co species were found in the quartz tube (Fig. S12b) when the sample of m-Co/g-C 3 N 4 -0.2 was fabricated by one-step calcination the mixture of g-C 3 N 4 NSs and Co(NO 3 ) 2 6H 2 O (Fig. S9c).Simultaneously, the CoO and/or Co(OH) 2 were generated on the sample of m-Co/g-C 3 N 4 -0.2 (Fig. S13).On the other hand, the mass percentage content of cobalt in the mixture of Co(NO 3 ) 2 6H 2 O and g-C 3 N 4 NSs precursors after calcination from 30 C to 800 C under Ar atmosphere followed by calcination at 800 C for 1 h under Air atmosphere was found to be significantly decreased from 16.67 wt to 10.34 wt (Fig. S14).This indicates that a part of cobalt is taken away by Ar after vaporization.Moreover, the release of NH 3 (m/z 17) at around 530 C during the calcination (Fig. 3) is potential evidence that the volatile Co species (Co(NH 3 ) x ) were formed by strong Lewis acid-base interaction between the single cobalt atom and NH 3 56,57.Thus, one can infer that the two-step calcination method can efficiently inhibit the aggregation of single atomically dispersed cobalt atoms by inducing the vaporization of cobalt species. At the same time, the Co(NO 3 ) 2 6H 2 O could completely infiltrate into small pores of g-C 3 N 4 NSs (Fig. S8a-d) due to the low melting point of Co(NO 3 ) 2 6H 2 O (55 C) 54,55 during the first calcination step at 130 C (Fig. S9c-d S4).In addition, the surface area and pore volume of the as-fabricated Co/g-C 3 N 4 -0.1 SAC (18.6 m 2 /g, 0.12 cm 3 /g), Co/g-C 3 N 4 -0.25 (29.2 m 2 /g, 0.21 cm 3 /g) and CoO x /g-C 3 N 4 -0.2 (27.7 m 2 /g, 0.13 cm 3 /g) also have some extent increased (Table S4). Based on the above discussion, the formation mechanism of Co/g-C 3 N 4 SACs with ultrahigh single atomically dispersed cobalt atoms was proposed as follows.Firstly, the porous g-C 3 N 4 NSs provided sufficient sites for the adsorption and anchoring of cobalt atoms.Secondly, the pretreatment step at 130 C for 9 h was vital to remove water from the mixture of Co(NO 3 ) 2 .6H 2 O and g-C 3 N 4 NSs precursors, besides, Co atoms in Co(NO 3 ) 2 6H 2 O were coordinatively unsaturated to anchor on the g-C 3 N 4 surface.Thirdly, the extra unanchored cobalt atoms were vaporized from the surface of g-C 3 N 4 during the pyrolysis process.As a result, inhibiting the aggregation of cobalt atoms in the process of higher temperature annealing was achieved.Finally, the high amounts of single atomically dispersed Co atoms were uniformly distributed on the surface of Co/g-C 3 N 4 -0.2SAC (Scheme 1).Therefore, the pyrolysis-inducedvaporization strategy and g-C 3 N 4 NSs as the substrate were of great significance for the fabrication of Co/g-C 3 N 4 SACs with high surface Co loading. It is generally believed that cobalt species supported on g-C 3 N 4 show high photocatalytic activity in CO 2 reduction 16, therefore the as-prepared catalysts were evaluated for the photocatalytic CO 2 reduction with H 2 O in the absence of both sacrificial reagent and photosensitizer.The formation rates of H 2 , CO, CH 4 , C 2 H 4 , C 2 H 6 , C 3 H 6 , CH 3 OCH 3 , and CH 3 OH products were evaluated (Fig. 4).However, it was difficult to quantify the O 2 content due to the high oxygen detection limitation using the TDX-01 column.As shown in Fig. 4a, the Co/g-C 3 N 4 -0.2SAC sample exhibited the highest CH 3 OH (941.9 mol g -1 ) generation rate at 4 h and the CH 3 OH selectivity was as high as 96.2, which is 13.4,2.6, 2.3, and 2.2 times higher than those of g-C 3 N 4 (70.7 mol g -1 ), Co/g-C 3 N 4 -0.1 SAC (356.9 mol g -1 ), Co/g-C 3 N 4 -0.25 (415.4 mol g -1 ), and CoO x /g-C 3 N 4 -0.2 (423.9 mol g -1 ), respectively (Fig. 4).The low Co loading in Co/g-C 3 N 4 -0.1 SAC resulted in lower photocatalytic activity due to the low concentration of single dispersed Co-N 2 C active sites (Figs. 4, S7, S15a, and Table S1).High loading of Co atoms, however, also led to poor activity, this may be due to reduction of active-atom-site numbers, followed by the reduction of the catalytic activity (Figs. 4, S7, and S15b) 16,58.Furthermore, the aggregation Co loaded on the bulk g-C 3 N 4 (CoO x /g-C 3 N 4 -0.2) also resulted in lower photocatalytic activity for photocatalytic CO 2 reduction (Fig. 4, Fig. S7, and Fig. S15c).Previous work demonstrated that CoO x with lower active species showed lower activity for photocatalytic CO 2 reduction as compared with the single atomically dispersed Co sites 16,58.These results indicated that the high-density single dispersed Co-N 2 C active sites are crucial for the photoreduction of CO 2 to methanol with high selectivity and activity.In addition, the ultrahigh density of single dispersed Co-N 2 C active sites showed the stable formation of CH 3 OH and suppress the CH 3 OH peroxidation (Fig. 4b). The high density single dispersed Co-N 2 C active sites also facilitated the generation of H 2 (18.9 mol g -1 h -1 ), CO (2.9 mol , and CH 3 OCH 3 (3.3mol g -1 h -1 ) (Fig. 4c).Furthermore, when 13 CO 2 was used as the feed gas, related 13 C products were formed (Fig. S16). Blank tests exhibit that CO 2 photoreduction products were no detected without either light or photocatalyst or reactant.These results confirmed that methanol was mainly generated from CO 2 reduction rather than an external pollutant carbon source.Impressively, as exhibited in Fig. 4d, our sample showed high stability of photocatalytic reduction of CO 2 to CH 3 OH after 12 cycles (48 h), the activity loss of methanol was almost negligible and there was no significant decrease in by-products except H 2 , CH 4 , and CH 3 OCH 3 (Figs.S17-S18).From the XPS and XRD data, it was observed that the basic structure skeleton of Co/g-C 3 N 4 -0.2SAC was not significantly changed after the 48 h reaction (Fig. S19a-d).As shown in Fig. S19e, the mass loss of Co/g-C 3 N 4 -0.2SAC after reaction from 20 to 230 C was only 0.2 wt, which is mainly caused by desorption of water adsorbed on the surface.More importantly, it is worth noting that the Co/g-C 3 N 4 -0.2SAC showed an obvious mass loss when higher than 450 C, indicating that the Co/g-C 3 N 4 -0.2SAC showed a very high thermal stability in the process of the photocatalytic reaction process.This could be one of the reasons why the Co/ g-C 3 N 4 -0.2SAC maintained stable photocatalytic activity in the process of catalytic reduction of CO 2 to methanol.The specific generation rates of different products for CO 2 reduction under similar reaction conditions over recently reported photocatalysts with single atomically dispersed cobalt sites (Co SACs) were compared (Table S5).For the Co/g-C 3 N 4 -0.2SAC in our work, the CH 3 OH generation rate and CH 3 OH selectivity in the photocatalytic CO 2 reduction was excellent among the reported Co SACs and some other similar photocatalysts 16,59,60.Moreover, it is worth noting that the photocatalytic activity for the reduction of CO 2 to CH 3 OH over Co/g-C 3 N 4 -0.2SAC was close to that of RuSA-MC 3 N 4 (Table S5) because Co/g-C 3 N 4 -0.2SAC can provide the ultrahigh density of single dispersed Co-N 2 C active sites 61.Therefore, the Co/g-C 3 N 4 -0.2SAC with an ultrahigh density of single dispersed Co-N 2 C sites could achieve the high activity, high selectivity, high stability for photoreduction of CO 2 to methanol. To unveil the reason why the ultrahigh density of single dispersed Co-N 2 C active sites on Co/g-C 3 N 4 -0.2SAC can reduce CO 2 to methanol with high activity and high selectivity.One can study the following three aspects: (a) light absorption ability; (b) generation ability and transfer efficiency of photogenerated carriers; (c) surface reaction 23,62,63.The introduction of high loading monodispersed Co-N 2 C sites in the Co/g-C 3 N 4 -0.2SAC increased the light absorption range from 450 nm to 700 nm as compared with the g-C 3 N 4 (Fig. 5a).The color of the Co/g-C 3 N 4 -0.2SAC was light green and very different from the color of the g-C 3 N 4 (Fig. S9e).The intense color resembles molecular systems like metal phthalocyanine or metal(bpy) 3 Cl 2 64,65, further illustrating the strong interaction between single dispersed Co-N 2 C active sites and g-C 3 N 4 via Co-N and Co-C bonds.Although the Co/g-C 3 N 4 -0.1 SAC, Co/g-C 3 N 4 -0.2SAC, Co/g-C 3 N 4 -0.25, and CoO x /g-C 3 N 4 -0.2 have almost the similar light absorption ability (Fig. 5a), the photocatalytic activities were not as high as that of Co/g-C 3 N 4 -0.2SAC (Fig. 4a).This suggested that the Co/g-C 3 N 4 -0.2SAC with high activity and high selectivity for photocatalytic reduction of CO 2 to methanol was not mainly caused by its ultra-high density of single dispersed Co-N 2 C active sites with enhanced light absorption ability. The XPS valence band spectra (VBS) were analyzed to study the change of charge density (Fig. 5b), the VBS of Co/g-C 3 N 4 -0.2SAC showed two significantly different features as compared to that of g-C 3 N 4 .On the one hand, the peak at 6 eV, primarily ascribed to N 2p states was less sharp than that of g-C 3 N 4 .On the other hand, the band tail was prolonged to 0.77 eV, which was 1.53 eV lower than the band tail of g-C 3 N 4 (2.30eV).These features could be ascribed to the ultrahigh density of single dispersed Co-N 2 C active sites and they strongly interact with g-C 3 N 4 on the sample of Co/g-C 3 N 4 -0.2SAC.DFT calculations were conducted to analyze the effect of the ultrahigh density of single dispersed Co-N 2 C sites on the local electronic density of g-C 3 N 4 .The charge transfer from single dispersed Co atoms to g-C 3 N 4 was as high as 0.74 e -based on the population analysis.As a result, there was an increased charge density on C and N atoms around cobalt atoms on Co/ g-C 3 N 4 -0.2SAC, consistent with the XPS analysis (Fig. 1c-d).This result indicated that an electron channel could be formed between cobalt atoms and g-C 3 N 4 by Co-N and Co-C bonds at single dispersed Co-N 2 C active sites, which would be conducive to the transmission of photogenerated carriers. The valence band of g-C 3 N 4 and Co/g-C 3 N 4 -0.2SAC was mainly formed by the N 2p and a small fraction of C 2p, the conduction band was mainly formed by C 2p and Co 2p 66.The valence band maximum (VBM) and conduction band minimum(CBM) of Co/g-C 3 N 4 -0.2SAC (1.49 eV, -0.44 eV) moved up 0.99 eV and 0.78 eV as compared to that of g-C 3 N 4 (2.48 eV, -1.22 eV), respectively(Figs.5b-c and S20), leading to much higher charge density at carbon atoms and nitrogen atoms in Co/g-C 3 N 4 -0.2SAC.Although the band-gap of the Co/g-C 3 N 4 -0.2SAC was significantly narrowed after the introduction of the ultrahigh density of single dispersed Co-N 2 C active sites, it still matched redox potentials of CO 2 /CH 4 (-0.24V vs NHE) and CO 2 /CH 3 OH (-0.38 V vs NHE) 2.Therefore, the ultrahigh density of single dispersed Co-N 2 C active sites changes the band structure of g-C 3 N 4 in the sample of Co/g-C 3 N 4 -0.2SAC (Fig. 5b-c).More importantly, the ultrahigh density of single dispersed Co-N 2 C sites with the half-filled d electrons of Co 2 led to the formation of a mid-gap energy level in the Co/g-C 3 N 4 -0.2SAC as shown in Fig. 5c 12,67.It can serve as an electron gathering center to form a localized electron center 12.Therefore, it is concluded that the ultrahigh density of single dispersed Co-N 2 C sites allowed to tune the electronic structure of g-C 3 N 4 to promote photoreduction CO 2 to CH 3 OH with high selectivity and activity with suppressing methanol over oxidation to CO and CO 2 as presented in Fig. 4b. Another key aspect that influences the photoreduction CO 2 activity is the generation ability and transfer efficiency of photogenerated carriers.Compared to the g-C 3 N 4 , Co/g-C 3 N 4 -0.2SAC revealed the highest timedependent photocurrent and the smallest diameter of semicircle arc at the light on or light off (Fig. 5d-e).In addition, the Co/g-C 3 N 4 -0.1 SAC, Co/g-C 3 N 4 -0.2SAC, Co/g-C 3 N 4 -0.25, and CoO x /g-C 3 N 4 -0.2 showed almost no PL peak as compared with g-C 3 N 4 (Fig. 5f).Thus, these results indicate that the ultrahigh density of single dispersed Co-N 2 C active sites in the Co/g-C 3 N 4 -0.2SAC increase charge separation and transfer efficiency in the interfacial zone compared to g-C 3 N 4 12,48,68. It is generally known that the adsorption of CO 2 on the photocatalyst surface is the first step of photocatalytic reduction of CO 2 .The CO 2 adsorption capacity of Co/g-C 3 N 4 -0.2SAC was 635.4 mol g -1 , which was by a factor of 12, 4.8, 2.4 and 3.0 higher than that of g-C 3 N 4 (51.9 mol g -1 ), Co/g-C 3 N 4 -0.1 SAC (131.8 mol g -1 ), Co/g-C 3 N 4 -0.25 (265.8 mol g -1 ) and CoO x /g-C 3 N 4 -0.2 (208.8 mol g -1 ), respectively (Fig. 6a).The CO 2 -TPD was also investigated to obtain more insights into CO 2 adsorption (Fig. 6b).After the introduction of the ultrahigh density of single dispersed Co-N 2 C sites, the chemisorption (desorption peak at around 320 C) of CO 2 on Co/g-C 3 N 4 -0.1 SAC, Co/g-C 3 N 4 -0.2SAC, Co/g-C 3 N 4 -0.25, and CoO x /g-C 3 N 4 -0.2 was stronger than that on the g-C 3 N 4 .It indicated that Co species can improve the adsorption strength of CO 2 on the material surface.As presented in Fig. 6c-d, the peaks of 1650 cm -1 , 1557 cm -1 , 1539 cm -1 , 1505 cm -1 , and 1700 cm -1 were assigned to bidentate carbonates (b-CO photoreduction CO 2 to methanol."
  },
  {
    "title": "Conclusions",
    "content": "In summary, we have proposed a novel pyrolysis-inducedvaporization strategy for the fabrication of Co/g-C 3 N 4 SACs with ultrahigh surface metal loading of 24.6 wt.Such high surface loading of single Co atoms was achieved using g-C 3 N 4 NSs as the substrate, because it can offer numerous uniform coordination N 2 C sites for Co-anchoring, followed by the two-step calcination to suppress the Co aggregation during the calcination process.The formation of the ultrahigh density of single dispersed Co-N 2 C active sites promoted the migration of photogenerated carriers and helps for the localization of photogenerated electrons under light irradiation.As a result, the as-prepared Co/g-C 3 N 4 SAC was valid to be an effective photocatalyst for CO 2 reduction to CH 3 OH.This work opens a new opportunity for fabricating ultrahigh surface cobalt density SACs, which can be used for diverse applications such as photocatalysis, electrocatalysis, and photoelectrocatalysis. Fig. 1.(a) XRD patterns of as-prepared catalysts; (b) FT-IR spectra of g-C 3 N 4 and Co/g-C 3 N 4 -0.2;high-resolution C 1s (c) and N 1s (d) XPS spectra of g-C 3 N 4 and Co/ g-C 3 N 4 -0.2. Fig. 2. (a) AC-HAADF-STEM image of Co/g-C 3 N 4 -0.2;STEM-EDX mappings of Co/g-C 3 N 4 -0.2 (scale bar: 2 nm) for (b) HAADF image, (c) C, (d) N, and (e) Co elements, respectively; (f) Co K-edge XANES spectra and (g) Fourier-transformed (FT) k 3 -weighted EXAFS spectra (uncorrected for the phase shift) of Co foil, CoO, Co 3 O 4 , Co(NO) 3 6H 2 O, and Co/g-C 3 N 4 -0.2;(h) Wavelet transform (WT) of Co/g-C 3 N 4 -0.2,CoO, and Co foil; (i) Fit of the Co/g-C 3 N 4 -0.2EXAFS spectrum in R-space and q-space (inset) with the contribution of individual shells (j) the same fit in k-space and the corresponding model structure (inset). Scheme 1.The bulk cobalt nitrate vaporization induced by the pyrolysis process for the fabrication of Co/g-C 3 N 4 SACs (blue: N atoms; gray: C atoms; red: Co atoms). . Ma et al. was completely covered by Co(NO 3 ) x yH 2 O crystals, clearly observed by the optical microscope (Fig. S8a-b).These results implied that the pyrolysis of the mixture of Co(NO 3 ) 2 6H 2 O and g-C 3 N 4 NSs precursors at 550 C can further help to improve the single atomically dispersed cobalt atoms loading.This is mainly because the gas generated (such as NH 3 , CO, NO, and Co(NH 3 ) x, etc.) by the vaporization and decomposition of Co(NO 3 ) x yH 2 O crystals process can expose more N 2 C sites on the surface of g-C 3 N 4 .This point can be proved by BET.The surface area and pore volume of the as-prepared Co/g-C 3 N 4 -0.2SAC (70.4 m 2 /g, 0.37 cm 3 /g) compared with the g-C 3 N 4 (5.0 m 2 /g, 0.016 cm 3 /g) are enlarged by 14.1 and 23.1 times, respectively (Table Fig. 3. Simultaneous TG-DSC-MS curves of (a) g-C 3 N 4 NSs, (b) the mixture of g-C 3 N 4 NSs, and Co(NO 3 ) 2 6H 2 O. Fig. 4. Photocatalytic activity measurements from photoreduction of CO 2 with H 2 O. (a) CH 3 OH production and (c) H 2 , CO, CH 4 , C 2 H 4 , C 2 H 6 , C 3 H 6 , CH 3 OCH products at 4 h over g-C 3 N 4 , Co/g-C 3 N 4 -0.1 SAC, Co/g-C 3 N 4 -0.2SAC, Co/g-C 3 N 4 -0.25, and CoO x /g-C 3 N 4 -0.2;Typical time profile of CH 3 OH generation (b) by g-C 3 N 4 , Co/g-C 3 N 4 -0.2SAC, and CoO x /g-C 3 N 4 -0.2;(d) CH 3 OH production corresponding to cycle experiments of Co/g-C 3 N 4 -0.2SAC.Conditions: 5 mg of catalyst; CO 4 mL, Ar as the balance gas; 300 W Xe lamp light source; Reactor volume: ca.270 mL. Fig. 5. (a) UV-vis diffuse reflectance spectra of g-C 3 N 4 , Co/g-C 3 N 4 -0.1 SAC, Co/g-C 3 N 4 -0.2SAC, Co/g-C 3 N 4 -0.25, and CoO x /g-C 3 N 4 -0.2;(b) XPS valence band spectra of the g-C 3 N 4 and the Co/g-C 3 N 4 -0.2SAC; (c) Band structure of g-C 3 N 4 and Co/g-C 3 N 4 -0.2SAC; (d) The electrochemical impedance spectroscopy (EIS) Nyquist plots of g-C 3 N 4 and Co/g-C 3 N 4 -0.2SAC, and (e) corresponding time-dependent photocurrent curves (i-t curve); (f) Photoluminescence spectra of g-C 3 N 4 , Co/ g-C 3 N 4 -0.1 SAC, Co/g-C 3 N 4 -0.2SAC, Co/g-C 3 N 4 -0.25, and CoO x /g-C 3 N 4 -0.2. 6970717273. Interestingly, the normalization intensities of adsorbed b-CO 32-and m-CO 3 2-on the surface of Co/g-C 3 N 4 -0.2SAC increased with the increase of the illumination time.This may be due to the local abundant electrons at the high density single dispersed Co-N 2 C sites during illumination promoted the absorption of CO 2 on the surface of the Co/g-C 3 N 4 -0.2SAC.Because high surface charge density contributes to enhancing CO 2 adsorption and activation74,75.Therefore, the ultrahigh density of single dispersed Co-N 2 C sites on Co/g-C 3 N 4 -0.2SAC contributed to improving CO 2 adsorption and activation ability, thereby promoting the highly selective and activity photocatalytic reduction of CO 2 to methanol.All in all, high density of single dispersed Co-N 2 C active sites on the sample of Co/g-C 3 N 4 -0.2SAC played a critical role in photocatalytic CO reduction to CH 3 OH with high activity and high selectivity due to improving CO 2 adsorption and activation ability during the photoreduction CO 2 process and enhancing the photogenerated electron-hole pair separation efficiency.More importantly, the high density of single dispersed Co-N 2 C sites can serve as the electron gathering centers to localize photogenerated electrons and tune the band structure of g-C 3 N to boost the photoreduction CO 2 to methanol and suppress the methanol overoxidation.In addition, the high thermal stability of the Co/g-C 3 N 4 -0.2SAC structure was a key factor for maintaining the high stability of Fig. 6.(a) CO 2 -TPD and (b) CO 2 adsorption isotherms of g-C 3 N 4 , Co/g-C 3 N 4 -0.1 SAC, Co/g-C 3 N 4 -0.2SAC, Co/g-C 3 N 4 -0.25, and CoO x /g-C 3 N 4 -0.2 samples, respectively; In situ DRIFTS spectra measured during photoreduction of CO 2 with H 2 O after adsorption of saturated CO 2 and H 2 O over (maxima (red) and minima (green)) on (c) Co/g-C 3 N 4 -0.2SAC and (d) g-C 3 N 4 . Ma , Zeai Huang and Ying Zhou designed the study.Zeai Huang, Wenjun Fa, Dmitry E. Doronkin, and Ying Zhou provided the support on experimental feasibility.Minzhi Ma, Zhiqiang Rao, Yanzhao Zou, Rui Wang, Yunqian Zhong, Yuehan Cao, Ruiyang Zhang performed characterization and analysis under the supervision of Zeai Huang and Ying Zhou.Minzhi Ma performed the MS calculation.Minzhi Ma wrote the paper.Zeai Huang, Dmitry E. Doronkin and Ying Zhou revised the paper.All authors contributed to the interpretation of the results and improvement of the paper. This research was financially supported by the Sichuan Provincial International Cooperation Project, China (2019YFH0164; 2021YFH0055).Y. Z. thanks for the Cheung Kong Scholars Program of China, China.We would like to thank the Institute for Beam Physics and Technology (IBPT) for the operation of the storage ring, the Karlsruhe Research Accelerator (KARA).We acknowledge the KIT light source for the provision of instruments at the CAT-ACT beamline of the Institute of Catalysis Research and Technology (IKFT), in particular, Dr. Tim Prumann and Dr. Anna Zimina (IKFT) for their help and technical support during experiments.We appreciate the calculation support from the National Supercomputing Center in Shenzhen. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data associated with this article can be found in the online version at doi:10.1016/j.apcatb.2021.120695."
  }
]