[
  {
    "title": "Doi",
    "content": "10.1021/acs.iecr.0c01034"
  },
  {
    "title": "Article_Title",
    "content": "Silver–Gold Bimetal-Loaded TiO<sub>2</sub> Photocatalysts for CO<sub>2</sub> Reduction"
  },
  {
    "title": "Abstract",
    "content": "Bimetallic Au-Ag/TiO 2 materials have been investigated as promising catalysts for the photocatalytic conversion of CO 2 with water as the reducing agent.The deposition of both metals on the TiO 2 surface was performed using a deposition method in independent steps.Characterization studies reveal a parallel distribution of both metals, with a preferential surface exposure of silver nanoparticles (NPs).The close contact between metal NPs and TiO 2 allows an efficient charge transfer between both phases upon excitation, which results in a distinct reaction mechanism under ultraviolet (UV) and visible illumination.Under UV light, bimetallic catalysts are able to shift the reaction selectivity toward methane, compared to the solely syngas (CO H 2 ) production over bare TiO 2 .This effect is ascribed to the capacity of the metal NPs to extract photoexcited electrons.Under visible light, this selectivity modification is not observed, whereas bimetallic catalysts are active toward syngas production, significantly improving the residual activity of TiO 2 .Under these conditions, an additional strong interfacial interaction between metal NPs and TiO 2 allows the photoexcitation of electrons from surface states in the band gap, leading to the occurrence of near-surface electron-hole pairs."
  },
  {
    "title": "Experimental",
    "content": "2.1.Materials.Anatase-type TiO 2 PC500 was provided by CrystalActiv and calcined in air at 400 C for 4 h to eliminate any remaining organic residue on its surface.Bimetallic catalysts were prepared in two consecutive steps.The deposition of silver was performed via a wet impregnation method using aqueous AgNO 3 (Sigma-Aldrich) solutions.First, appropriate amounts of precursor to obtain 0.5-3 wt of Ag in the final material were dissolved in 25 mL of Milli-Q water (Millipore).Then, the TiO 2 was added under magnetic stirring.Water was then eliminated at 60 C and 200 mbar in a rotatory evaporator, and the resulting powder was subsequently dried overnight in a furnace at 100 C.Finally, the powder was homogenized in a mortar, fired in air at 400 C for 4 h, and pulverized again.The deposition of gold nanoparticles was performed via a deposition-precipitation method using aqueous HAuCl 4 3H 2 O (Strem Chemicals) solutions.The precursor was first dissolved into 300 mL of Milli-Q water, targeting a final 0.5-3 wt Au.The Ag/TiO 2 powder was then added under stirring.Afterward, the suspension was heated at 70 C, and the pH was adjusted to 9 using a 0.1 M NaOH solution and stirred under these conditions overnight.After that, the catalyst was recovered by filtration and rinsed several times with Milli-Q water (Millipore).Then, the powder was dried at 100 C for 12 h, ground in an agate mortar, calcined in air at 200 C for 4 h, and ground again.The prepared samples were named as XAgXAu/TiO 2 , where X refers to the nominal amount (wt ) of silver and gold. 2.2.Characterization of the Prepared Materials.The crystal structure of the prepared samples were characterized by a X-ray diffraction (XRD) using a Panalytical EMPYREAN equipment with Cu K radiation ( 1.54178A) at a scanning rate of 0.2s -1 .Mean crystallite sizes were estimated by applying the Scherrer formula to the most intense reflection of anatase.The deposited amount of gold was determined by means of inductively coupled plasma-optical emission spectroscopy (ICP-OES) analysis on PerkinElmer Optima 3300 DV equipment after acid digestion of the samples.Brunauer-Emmett-Teller (BET) surface areas were determined from nitrogen adsorption isotherms recorded on a Quadrasorb equipment (Quantachrome Instruments) after degassing the samples at 105 C for 20 h.The morphology of particles was studied using a FEG S/TEM system (Model Talos F200X, FEI) equipped with a chemical analysis system via energydispersive X-ray spectroscopy (EDS).Ultraviolet-visible diffuse reflectance spectra (UV-Vis DRS) of powdered samples were recorded on PerkinElmer Lambda 1050 UV/vis/NIR equipment with a Praying Mantis diffuse reflectance accessory.Steady-state fluorescence spectra of the powdered samples were recorded in front-face mode on a PerkinElmer LS55 fluorescence spectrometer, using excitation wavelengths of 300 or 445 nm with cutoff filters at 250 or 515 nm, respectively.Fluorescence lifetimes were measured by time-correlated single photon counting (TCSPC) with Mini- equipment (Edinburgh Instruments).For UV measurements, a laser with a wavelength of 372.2 nm and a pulse width of 61.2 ps was used for excitation, and a band-pass filter at 400 25 nm was placed before the detector.For visible ones, the laser had a wavelength of 445.2nm and a pulse width of 90.7 ps, and emission was filtered at 600 25 nm.Experimental data were fitted to biexponential decay curves and the average fluorescence lifetime was calculated as (A i i 2 )/(A i i ), where A i is the amplitude and i is the lifetime of each contribution. X-ray photoelectron spectroscopy (XPS) spectra were recorded with a laboratory-based spectrometer (SPECS GmbH, Berlin) using monochromated Al K source (h 1486.6eV) operated at 25 W as excitation source.In the spectrometer, the X-ray is focused in a -FOCUS 600 monochromator onto a 300 m spot on the sample, and the data are recorded in PHOIBOS 150 NAP 1D-DLD analyzer in fixed analyzer transmission (FAT) mode.The pass energy was set to 40 eV for survey scans and 20 eV for high-resolution regions.The binding energy scale was calibrated using Au 4f 7/2 (84.01 eV) and Ag 3d 5/2 (368.20 eV).Recorded spectra were additionally calibrated against the C 1s internal reference.Data interpretation was done with CasaXPS.Shirley or two-point linear background were used, depending on the spectrum shape.Surface chemical analysis was done based on the peak area of high-resolution spectra and the CasaXPS sensitivity factors (where the RSF of C 1s is 1.000). Ti and Ag K-edge (4510 and 22162 eV) X-ray absorption (XAS) measurements were collected in fluorescence and transmission mode, respectively, at the CLAESS beamline of the ALBA synchrotron. 32The samples, ca. 10 mg, were loaded in a quartz capillary tube.The flow of reaction gases fed to the reactor was constant at 2 mL min -1 , with a CO 2 :H 2 O molar Industrial Engineering Chemistry Research ratio of 7:1 at room temperature.XANES spectra were collected during alternate exposures to external illumination using a high-power UV LED (365 nm) or a blue laser (445 nm).The gas was analyzed in-line at the exit of the reaction cell by means of a single-quadruple mass spectrometer from Pfeiffer Omnistar.XAS data were collected using a Si(111) crystal monochromator and a single-channel silicon drift detector in fluorescence mode and ionization chambers in transmission mode.The spectra of silver and titanium foils were recorded at the same time to ensure proper energy calibration.Data normalization was performed using the Athena package. 33.3.Photocatalytic Reactions.Photocatalytic CO 2 reduction experiments were performed in continuous mode in a stainless-steel photoreactor with a borosilicate glass top window for irradiation.Approximately 100 mg of photocatalyst powder was deposited on a glass fiber filter from an aqueous suspension, after which the filter was dried at 100 C for 3 h.The coated filter was then introduced in the reactor which, after tight closing and heating up to 50 C, was evacuated by a vacuum pump and flushed for 1 h with Ar gas to remove any substance weakly adsorbed on the surface of the photocatalyst or the support.After that, a CO 2 -H 2 O mixture with 7.25:1 volume ratio was passed for 1 h to ensure an adsorptiondesorption equilibrium, and then the reactor pressure was set to 2 bar and the gas flow to 2 mL min -1 .After 1 h in darkness under these conditions, irradation was started by means of four fluorescent lamps of 6 W, each with a maximum emission at 365 nm, for UV experiments, and of a 30 W white LED source (emission spectrum in Figure S1 in the Supporting Information) for visible ones.The reaction products were analyzed in line every 22 min by means of a gas chromatograph (Agilent 7890) equipped with three columns (MOLESIEVE 5A, CP-SIL 5B, and HP-PLOT Q), one thermal conductivity detector, and two flame ionization detectors.In the absence of UV or visible illumination, no products were detected."
  },
  {
    "title": "Results_and_Discussion",
    "content": "3.1.Structural and Optoelectronic Properties.As shown in Table 1, incorporation of gold of ca.50 or higher, with respect to the nominal values, occur in all cases; the rest of it remains in a colloidal solution in the synthesis medium. 14egarding silver content, total incorporation of the nominal amount with the employed synthetic procedure has been previously reported. 17Figure 1 shows X-ray diffractograms of the different photocatalysts.All of them may be indexed to the anatase phase of titania, without any apparent peak displacement in the metals-loaded samples.Reflections from gold and silver oxides appear in samples with high metal loadings (i.e., 1.5 and 3.0 wt ) (see inset in Figure 1), whereas they are not identified in the rest of the samples, which can be traced back to the low metal loading and/or an exceedingly small crystal size to be detected by XRD.Au and Ag diffractions appear very close to each other, because of their equivalent structures and similar lattice constants (0.407 nm versus 0.409 nm). 34,35amely, reflections appeared at 2 38.1,44.5, 64.6, and 77.6, which can be indexed to the (111), ( 200), (220), and (311) planes, respectively, of the face-centered cubic (fcc) Industrial Engineering Chemistry Research structure of metallic Au or Ag NPs. 34,35Additional diffraction peaks were found at 2 27.7,32.3, and 46.2, corresponding to silver oxides.The average crystal size of TiO 2 (Table 1) was calculated using Scherrer's equation on the most intense diffraction peak.All of the samples have similar crystallite sizes (ca.17-19 nm), which indicates that the metal deposition does not significantly modify the crystal growth behavior of the TiO 2 phase. The nitrogen adsorption isotherms (Figure S2 in the Supporting Information) can all be classified as Type-II isotherms with a H3-type hysteresis at high pressures, indicating a nonuniform pore distribution with mesopores and macropores.The BET surface area of metal-containing samples decreased with respect to TiO 2 (Table 1), which can be traced back to metal nanoparticles partially blocking the pores of TiO 2 . 29,36,37The high surface area obtained in highloaded samples (i.e., 1.5 and 3.0 wt ) is explained by the formation of metal agglomerates that would block a reduced number of pores. TEM and elemental mapping provided further information about the morphology of TiO 2 and the size and dispersion of metal NPs (Figure 2 and Figures S3-S5 in the Supporting Information).Commercial anatase nanoparticles mostly expose (101) surfaces (see the inset in Figure 2A), while gold and silver nanoparticles (Ag and Au NPs) are homogeneously dispersed and exhibit sizes between 5 nm and 12 nm, although with the formation of agglomerates.Specifically, TEM elemental mapping revealed that Ag and Au NPs have a tendency to form aggregates ( 20 nm) to a larger extent in samples with metal loadings of 1 wt (Figures 2C-E).For low metal loadings (i.e., 0.5 wt ), Ag NPs remain unchanged while Au NPs formed smaller agglomerates, in the size range of 5-10 nm (Figure 2B).Indeed, in all samples, gold shows a higher tendency to form agglomerates than silver.Superimposed mapping images (Figures S3-S5) show that Au agglomerates have a tendency to be associated with silver particles. Figure 3 shows the XPS of each sample in the Ag 3d region.Spectra of samples with nominal concentrations of 0.5-1.5 can be fitted with a single pair of components (accounting for Ag 3d 5/2 and Ag 3d 3/2 ), associated with metallic Ag. 38 However, a second pair of components is needed to fit a strong shoulder to low binding energy in the spectrum of the sample with the highest Ag loading.This is possible due to a decrease in the silver reduction under UV light, with respect to the rest of the samples or a surface reoxidation.This behavior is probably due to the higher nanoparticle size of this catalyst.In agreement with XRD results, such a component is well within the BE region of Ag oxides 38 and represents 20 of the total spectral intensity.A surface chemical analysis was done based on the ESCA technique.Table S1 in the Supporting Information shows elemental atomic ratios for each sample, as determined from the spectral areas in the Ti 2p (not shown), Ag 3d (Figure 3) and Au 4f (Figure S6) regions of the emission spectra and respective sensitivity factors.Large deviations from the nominal Ag:Au ratio of 1 is observed, with larger deviation as the metals content increases.Silver surface segregation could be related to the formation of bilayer or core-shell metallic structures on the surface of titania. 39owever, TEM and chemical mapping observations rather suggest that the higher tendency of gold to form agglomerates and/or a darkening of these agglomerates by associated silver particles can be the reason behind the observed deviations. The optical properties of bare TiO 2 and bimetal-loaded samples were investigated by DRS UV/vis spectroscopy (Figure 4).All samples exhibited an sharp absorption edge at ca. 390 nm, corresponding to the band gap transtion of TiO 2 (ca.3.2 eV).The broad absorption band located between 450 and 700 nm is assigned to the surface plasmon resonance (SPR) of both Ag and Au NPs (Figure 4A).A slight red shift of the plasmon band and an increase of its intensity was observed when increasing the metal loading, suggesting a slight particle size enlargement 19,404142 that agrees well with TEM observations.Under UV illumination, all samples exhibited a blue shift in the SPR absorption band ( 112 nm), with respect to dark conditions.This shift is attributed to the accumulation of photogenerated electrons in the metal NPs. 27,38,41,42The 0.5Ag0.5Au/TiO 2 sample shows a significantly lower intensity of this band, ascribed to its lower metal content. 18In addition, all samples showed similar band gap values (around E g 3.2 eV), indicating that the metals were successfully deposited on the TiO 2 surface without altering the electronics and, therefore, the crystal structure of the semiconductor, as previously deduced from XRD analysis. In order to study the recombination of free charge carriers, the photoluminescence (PL) spectra of TiO 2 and metalcontaining samples were acquired.Under UV excitation (Figure S7 in the Supporting Information), the strong emission at ca. 400 nm can be ascribed to the band gap radiative recombination.The excitonic PL bands appearing in the visible region (400-800 nm) are mostly associated with surface oxygen vacancies and defects. 18,43PL spectra of metalcontaining samples showed a quenching of the luminescence, with respect to pure titania, indicating that recombination of electrons and holes in titania is slowed upon decoration with Ag and Au NPs.A stronger photoluminescence quenching was observed for higher metal loadings, in good agreement with the observed higher intensity of the plasmonic absorption band.The time-resolved fluorescence decay measurements of this emission in metal-loaded TiO 2 shown in Figure 5A indicate shorter fluorescence lifetimes and, therefore, lower population of excited electrons in the TiO 2 conduction band, in the Ag-Au samples, with respect to titania.This can be explained as a transfer of this excited electrons from the semiconductor to the metals, given the relative positions of the involved energy levels. 10,44luorescence emission spectra under excitation with visible light (445 nm, Figure S8 in the Supporting Information) show a weak emission with a maximum at ca. 590 nm.Absorption at this wavelength may result from surface defects creating subband gap states that relate to the Urbach tail usually observed in the absorption spectrum of nanosized titania 45 or noblemetal-supported titania. 28As we have previously reported, surface interaction of metal nanoparticles with TiO 2 may render the electron-hole pairs formed by excitation from these states active for photocatalytic reactions, resulting in visiblelight activity in this otherwise visible-light-inactive semiconductor. 28Consistent with this, fluorescence spectra of the bimetal-modified samples show, in all cases, an emission quenching that increases with the metals content, suggesting a reduced recombination of electron-hole pairs also under visible light.The fluorescence lifetimes under visible light excitation deduced from the decay curves shown in Figure 5B, behave in a similar way as those under UV, with lifetimes in the metal-loaded samples that decrease with increasing metal loadings, suggesting that these intermediate states are also participating in the charge transfer processes when lower wavelengths in the visible range are used. 3.2.CO 2 Photoreduction Performance.The photocatalytic activity of the obtained samples was investigated in the photocatalytic reduction of CO 2 using water as a hole scavenger under UV and visible-light irradiation.The results under UV light, in terms of cumulative productions of H 2 , CO, and CH 4 , after 15 h of reaction, are shown in Figure 6.With TiO 2 , the main CO 2 reduction product is CO, with CH 4 in a minor amount, accompanied by hydrogen arising from the reduction of water competing with CO 2 for photoexcited electrons, which is a common outcome of this reaction. 46That is, the overall product of the reaction on titania is essentially syngas.However, the deposition of the metals on the surface of titania dramatically changes the selectivity of the reaction, increasing the production of methane and decreasing that of CO, with a concomitant growth of hydrogen evolution.Thus, methane becomes the main carbon product when 1 wt metals is present, with a selectivity that exceeds 80 against CO production.This effect on selectivity declines with further increased metals content, and is essentially lost in the 3.0Ag3.0Au/TiO 2 sample, which could be related with the possibility that metals exert a shading effect on TiO 2 , decreasing the absorption of photons, and with the loss of the dispersion of the NPs because of the formation of agglomerates, confirmed by TEM analysis. 47,48Therefore, at low loadings, the use of the metals as a co-catalyst appears to be a way of tuning the reaction selectivity, although this occurs at the expense of CO 2 conversion.However, if the number of electrons needed for each product (2 for CO, 8 for CH 4 ) is considered, it appears that the most methane-selective catalyst is also the one leading to the best light utilization.The change in selectivity is ascribed to the larger availability of electrons at metal centers, as inferred from static and time-resolved fluorescence measurements, supported by in situ XANES spectra (vide infra). In contrast to the UV-driven results, under visible light, the main CO 2 reduction product is CO in all cases, together with hydrogen.That is, the overall product of the reaction is essentially syngas in all cases.Compared to TiO 2 , bimetalmodified catalysts generally present improved syngas productions (Figure 7), but do not lead to the production of methane.Particularly, H 2 evolution is increased by a factor of 2.3, to 4.5, with respect to pure titania.CO formation increases to a lower extent in samples with low metal loadings (i.e., 0.5-1.0wt ), while it progressively decreased for higher metal contents.As a result, the optimal Ag and Au loading is again 1.0 wt at which the highest yield of products is obtained. The promotion of visible-light-driven photoactivity in TiO 2 by plasmonic NPs has been previously reported by our group. 18,28Since TiO 2 does not substantially absorb light with a wavelength below 400 nm, this photoactivity has been attributed, based on theoretical calculations and optoelectronic measurements, to a slight absorption of energies below the band gap coming from impurity states, and the interaction of the strong electric field of plasmonic NPs with TiO 2 , which allows the formation of electron/hole pairs in the near-surface region of the semiconductor. 28Here, we show that the deposition of both Au and Ag NPs further improves the production of H 2 and CO, with respect to bare TiO 2 .The results obtained herein are in accordance with previous results of Ag/TiO 2 catalyst, 28 suggesting that the metals are acting as active sites by accepting electrons from the TiO 2 conduction band and fostering the transfer of these electrons to adsorbed reactants. 3.3.Operando XANES Analysis.In order to analyze the charge transfer mechanisms that occurs in the photocatalytic reactions, and with silver, as shown by XPS results, being the metal mainly exposed at the surface, a model Ag/TiO 2 catalyst was studied by XANES under operando conditions employing different activation light sources. The Ti K-edge XANES spectra before and after UV illumination under reaction conditions are shown in Figure 8.The spectra show that titanium exists in the 4 oxidation state in both cases, as deduced from the edge position.The inset in Figure 8 shows in detail the pre-edge region of these spectra mainly corresponding to transitions to the 3d states.The pre-edge features of Ti K-edge spectrum are significantly different from Ti atoms in tetrahedral or octahedral first coordination environments.A comparison with the spectrum of a commercial anatase reference shows analogous surrounding local symmetries, that is, octahedral sites, as expected for the titania source in the catalyst synthesis.The pre-edge structure of Ti cations in octahedral sites presents four peaks: A 1 , A 2 , A 3 , and B. A 1 is mainly attributed to quadrupolar transitions to t 2g states of the TiO 6 octahedron.The second and the third features, A 2 and A 3 , are attributed to 1s-3d dipolar transitions (to t 2g and E g states) and the shoulder B is assigned to the 1s-to-4p transition. 495051 Although there are no significant changes in the main shape of the spectrum after illumination, a clear intensity variation of the pre-edge features is observed, which indicates lower density of unoccupied states ascribed to an increased electron density in the d-states.Therefore, the results prove a charge transfer directly into d (t 2g and E g ) states after illumination of the solid with UV light, which corresponds to the promotion of valence band electrons into the conduction band.In the main continuum resonances above the edge, a concomitant intensity increase is observed.Since these states present a high degree of hybridization with the O 2p states, these results could suggest a rearrangement of the electronic density when higher charge is accommodated in the d orbitals in order to stabilize the system. XANES spectra were also acquired at the Ag K-edge during cycles of light switching under reaction conditions (Figure 9).The silver species are initially in an oxidized state Ag but their direct exposure to the X-ray beam leads to the partial reduction of the silver centers, as inferred from the shift of the edge position to lower energies accompanying a decrease of the white-line intensity, featured at 25525 eV.Once spectra no longer evolved and therefore a steady state had been reached, the operando test was performed with successive on/off cycles of external illumination.The UV light led to a higher red shift of the absorption edge, as well as a greater change in both the intensity of the white-line and the continuum resonances (Figure 9 left panel and inset).These changes are reversible in the absence of light and reproducible when irradiation is started again (Figure S9 in the Supporting Information).Therefore, the results point to photoinduced charge transfer directly into silver states that arrives at a steady state under irradiation and is reverted in darkness. Figure S10 in the Supporting Information shows in-line mass spectrometry pertaining to CO 2 reduction during alternate on-off-on-off illumination.Switching the UV light on triggered the CO 2 conversion as MS signals associated with CO 2 and H 2 O (m/z 44 and 18, respectively) decreased rapidly.Simultaneously, CO and O 2 formation was detected (m/z 28 and 32, respectively).The m/z 16 signal that could be associated with the molecular ion of methane also exists as fragments derived mainly from CO 2 , thus hindering the possible visualization of methane formation.Thus, a decrease in the signal was observed and associated mainly with CO 2 consumption, which is the majority in the gas stream.However, its behavior is not parallel to that of m/z 44 (see inset in Figure S10), showing a slight increase after the initial decrease from which the formation of methane can be inferred in parallel to a decrease in the formation of CO 2 .This analysis confirms a similar activity to that observed in the catalytic tests performed at the laboratory for CO 2 photoreduction, thus reproducing the reaction conditions. The above results indicate, in accordance to the ones discussed above, that UV light promotes electrons from the titania VB to the CB (3d states of Ti) and then they are transferred to the silver centers.The electrons accumulated in the Ag-sites (electronically coupled to the Ti atoms of the titania support) are used for photocatalytic CO 2 reduction in a reversible manner, favoring the formation of highly reduced products such as methane, as described in the previous section. In situ measurements were also made at the Ag K-edge, using blue light as an illumination source.Again, prior to the experiment, the sample was prereduced under the X-ray beam. Figure 10A shows the Ag K-edge XANES spectra during a cycle of successive on/off external blue illumination.The comparison with Ag 2 O and Ag metal references shows that blue light produced a clear reoxidation of silver centers from Ag 0 to Ag species.This process is reversible when external stimulation disappears.Figure 10B displays the intensity contour map of those normalized XANES spectra for a better visualization of the temporal evolution during a cycle of light switching. Previous studies have shown that the strong dielectric coupling at the interface between plasmonic metal nanoparticles and TiO 2 induces the formation of intraband-gap interface states (IFS). 28,52These states are related to the charge donation from Ag 5s orbitals to 2p ones of oxygen neighbor atoms and to 3d of Ti, and are congruent with ultrafast ( 10 fs) photoinduced hot electrons in TiO 2 , rather than with electrons photogenerated in silver and transferred to titania.These studies also point out a substantial decrease in the lifetime of these visible-light-photogenerated electrons, explaining both the lower photoactivity and the change of selectivity toward products of lower electron demand, such as H 2 or CO.A schematic representation of the charge transfer processes occurring under UV and visible light, as inferred from in situ XANES, static photoluminescence, and timeresolved fluorescence measurements, can be found in Figure S11 in the Supporting Information."
  },
  {
    "title": "Conclusions",
    "content": "The present work demonstrates silver and gold co-loaded TiO 2 as a promising catalyst for CO 2 photoreduction using water as an electron donor.Characterization results point at a parallel distribution of both metals with silver mainly exposed to the surface, as well as close contact with the semiconductor, which allows efficient charge transfer between both phases upon excitation.Under UV light, the bimetallic co-catalyst is able to modify the reaction selectivity, moving from the essentially syngas (CO H 2 ) production on bare TiO 2 to the attainment of methane from CO 2 with selectivity of 80 in the best case.Under visible light, the selectivity is essentially maintained; however, in the presence of the metal nanoparticles, the syngas production is optimized at 1 wt loading with a H 2 :CO ratio close to 2. Together with time-resolved fluorescence measurements, an operando XANES study reveals that the mechanisms are operating under UV and visible light.In the first case, the metal is revealed to work as an electron sink that is proposed to favor charge transfer to CO 2 for the attainment of highly reduced products such as methane.This mechanism also operates under visible light, reinforced by the electron transfer from metal to titania, which can be related to a strong interfacial interaction, allowing the photoexcitation of electrons from surface states in the band gap, leading to the occurrence of near-surface electron-hole pairs. ASSOCIATED CONTENT s Supporting Information The Supporting Information is available free of charge at https://pubs.acs.org/doi/10.1021/acs.iecr.0c01034. Additional characterization, lamp information, operando analysis data, and schematic representation of charge transfer processes (PDF) Special Issue Paper Originally intended for the Carbon Capture and Utilization special issue, Ind. Eng.Chem.Res.2020, Volume 59, Issue 15. Figure 1.XRD patterns of TiO 2 and bimetallic samples. Figure 2. TEM images and chemical mapping of bimetallic catalysts: (A, B) 0.5Ag0.5Au/TiO 2 , (C, D) 1.0Ag1.0Au/TiO 2 , and (E, F) 3.0Ag3.0Au/TiO 2 . Figure 3. XPS spectra in the Ag 3d region of the bimetal-loaded samples. Figure 4. Diffuse reflectance UV/vis spectra of bare TiO 2 and bimetallic photocatalysts under (A) darkness and (B) UV illumination conditions. Figure 5. Fluorescence decay curves of bare and metal-modified TiO 2 under (A) UV (372 nm) and (B) visible (445 nm): (1) TiO 2 , (2) 0.5Ag0.5Au/TiO 2 , (3) 1Ag1Au/TiO 2 , (4) 1.5Ag1.5Au/TiO 2 , and (5) 3.0Ag3.0Au/TiO 2 .Green lines represent the biexponential decay curves fitted to each dataset.The black dotted lines correspond to the instrument response function with the different lasers.Inset in panel (A) shows the average fluorescence lifetimes (connected symbols) and their variation with respect to TiO 2 (bars). Figure 6.Cumulative productions attained after 15 h of reaction under UV irradiation with TiO 2 and bimetallic catalysts. Figure 7. Cumulative production with TiO 2 and bimetallic catalysts after 15 h of visible-light irradiation. Figure 8. Ti K-edge XANES spectra of TiO 2 (dashed trace), as well as Ag/TiO 2 before (black trace) and after (red trace) UV illumination under reaction conditions. Figure 9. Ag K-edge XANES spectra and magnification (left and inset) during exposure to the X-ray beam and during UV light switching under reaction conditions. Physicochemical Properties of TiO 2 and Bimetallic Catalysts catalyst nominal Ag a (wt ) nominal Au (wt ) experimental Au (wt ) b d TiO2 c (nm) S BET (m 2 g -1 ) a Nominal corresponds with experimental.b Measured by ICP-OES.c Crystal size determined from XRD. https://dx.doi.org/10.1021/acs.iecr.0c01034Ind. Eng.Chem.Res.XXXX, XXX, XXX-XXX B https://dx.doi.org/10.1021/acs.iecr.0c01034Ind. Eng.Chem.Res.XXXX, XXX, XXX-XXX C https://dx.doi.org/10.1021/acs.iecr.0c01034Ind. Eng.Chem.Res.XXXX, XXX, XXX-XXX D https://dx.doi.org/10.1021/acs.iecr.0c01034Ind. Eng.Chem.Res.XXXX, XXX, XXX-XXX https://dx.doi.org/10.1021/acs.iecr.0c01034Ind. Eng.Chem.Res.XXXX, XXX, XXX-XXX F https://dx.doi.org/10.1021/acs.iecr.0c01034Ind. Eng.Chem.Res.XXXX, XXX, XXX-XXX G Industrial Engineering Chemistry Research https://dx.doi.org/10.1021/acs.iecr.0c01034Ind. Eng.Chem.Res.XXXX, XXX, XXX-XXX H https://dx.doi.org/10.1021/acs.iecr.0c01034Ind. Eng.Chem.Res.XXXX, XXX, XXX-XXX J https://dx.doi.org/10.1021/acs.iecr.0c01034Ind. Eng.Chem.Res.XXXX, XXX, XXX-XXX K https://dx.doi.org/10.1021/acs.iecr.0c01034Ind. Eng.Chem.Res.XXXX, XXX, XXX-XXX I and European Structural Funds for their financial support to FotoArt-CM project (No.S2018/NMT-4367) and Fundacion Ramon Areces for their financial support to Art-Leaf project.Support from REPSOL Technology Lab is gratefully acknowledged.The authors thank ALBA synchrotron (Barcelona, Spain) for funded access to facilities (Experiment No. 2014071049) and Dr. L. Simonelli at CLAESS beamline for her help during the XAS experiments.A.I.-J.thanks CSIC for the PIM-2014-201480I012 project.L.C. acknowledges funding from the European Union's Horizon 2020 Research and Innovation Programme, under the Marie Skodowska-Curie Grant Agreement No 754382, GOT ENERGY TALENT. The manuscript was written through contributions of all authors.All authors have given approval to the final version of the manuscript. The authors declare no competing financial interest. This work has received financial support from the Spanish Ministry of Science, Innovation and Universities, through the projects RaPHUEL (No. ENE2016-79608-C2-1-R) and SOLPAC (No. ENE2017-89170-R, MCIU/AEI/FEDER, EU).Authors also want to thank \"Comunidad de Madrid\" The authors dedicate this Article to the memory of Prof. J. L. G. Fierro."
  }
]