[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2014.12.011"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic reduction of CO 2 with water vapor on surface La-modified TiO 2 nanoparticles with enhanced CH 4 selectivity"
  },
  {
    "title": "Abstract",
    "content": "Surface La-modified TiO 2 nanoparticle samples were prepared by a simple sol-gel method.The structure and properties of the catalysts were characterized and analyzed by means of XRD, TEM, BET, UV-vis DRS, CO 2 -TPD, XPS, Raman and Theoretical Calculation.The most La 3 was found to deposit onto the TiO 2 in the form of La 2 O 3 particles, and a tiny number of La atoms modify TiO 2 by substituting the surface Ti atom in the form of Ti O La, leading to the generation of oxygen vacancies and Ti 3 for balancing the charge.The La-modified TiO 2 photocatalysts were investigated in the photocatalytic reduction of CO 2 with water vapor under the 300 W Xe arc lamp irradiation.The La-modified TiO 2 showed high CH 4 yield of 3.457 mol under 20 h light irradiation, which is 13 times of that over commercial P25.The enhanced photocatalytic performances were attributed to the synergistic effects of basic characteristics of La 2 O 3 for CO 2 adsorption, the oxygen vacancies for water vapor activation and Ti 3 for electron separation."
  },
  {
    "title": "Experimental",
    "content": "All the chemicals were used as purchased without further purification: Tetra-n-butyl titanate (Ti(OBu) 4 , 98.0) and Lanthanum(III) Oxide (La 2 O 3 , 99.99) were purchased from Sinopharm Chemical Reagent Co., Ltd., Nitric acid (HNO 3 , 65.0-68.0wt/) was purchased from Beijing Chemical Works.P25 was purchased from Germany Degussa Co., Ltd.Anhydrous ethanol (C 2 H 5 OH 99.7) was purchased from Beijing Modern Oriental Fine Chemistry Co., Ltd. The La-modified TiO 2 nanoparticles were prepared by a sol-gel method with Ti(OBu) 4 as the titanium source 29.10mL of Ti(OBu) 4 was dissolved in 40 mL of anhydrous ethanol in a dry atmosphere, and then the mixed solution of Ti(OBu) 4 and ethanol was added dropwise into another mixture solution consisting of 10 mL water, 10 mL of anhydrous ethanol, and a certain amount of La 2 O 3 dissolved in 2 mL of 70 HNO 3 under vigorous stirring.0 , 1 , 2 , 3 , 4 and 5 denote the samples in which the molar ratio of La to Ti was 0, 0.01, 0.02, 0.03, 0.04, 0.05, respectively, during catalyst preparation.Subsequently, the mixed solution was stirred in a closed beaker at room temperature for 3 h to carry out further hydrolysis.Then, the yellowish transparent sol was obtained, which was aged for 6 h at room temperature and dried at 343 K for 36 h in air to remove water and alcohol for getting a xerogel.Finally, TiO 2 nanoparticles were obtained by calcination of TiO 2 xerogel at the 873 K in air for 2 h with subsequent grinding. To characterize the crystal structure of the catalysts, powder X-ray diffraction (XRD) patterns were recorded with a diffractometer (Shimadzu XRD 6000) using Cu K ( 0.15406 nm) radiation with a Nickel filter operating at 40 kV and 10 mA.The Brunauer-Emmett-Teller (BET) specific surface area of the samples were analyzed by nitrogen adsorption at 77 K on Micromeritics ASAP 2020 analyzer and calaulated by the Brunauer-Emmett-Teller (BET) method.Images of transmission electron microscopy (TEM) and high resolution transmission electron microscopy (HRTEM) were obtained with a JEOL JEM-2100 electron microscope equipped with a field emission source at an accelerating voltage of 120 kV.Image of aberration-corrected high resolution transmission electron microscopy was got on a FEI Titan 80-300 equipped with a spherical aberration corrector for objective lens.The UV-vis diffused reflectance spectra (DRS) experiments were performed on a UV-vis spectrophotometer (Hitachi U-4100) using BaSO4 as the background.The surface chemical states and atomic concentration were characterized by Xray photoelectron spectroscopy (XPS) and the measurements were performed on PerkinElmer PHI-1600 ESCA spectrometer using MgK (h 1253.6eV, 1 eV 1.603 10 -19 J) X-ray source.The XPS spectrum was calibrated with respect to the binding energy of the C 1s peak at 284.6 eV and was deconvoluted using related software.Electron paramagnetic resonance (EPR) was carried out at room temperature on an instrument JES FA-200 (JEOL) operating at the band frequency about 10.0 GHz with a field modulation frequency of 100 kHz.The modulation width was set at 0.1 mT and used microwave power was 1 mW.Visible Raman spectra were recorded at room temperature on a Renishaw Invia scanning double monochromator with the spectral resolution of 4 cm -1 .The line at 532 nm single-frequency laser was used as the excitation source.The 13 C isotopic tracer experiments were conducted and the obtained photocatalytic products were identified by a Thermo Fisher DSQ system.Such a GC-MS was equipped with a HP-5MS (30 m 0.25 mm 0.25 m) fused silica capillary column.The mass spectrometer was operated with an electron impact (EI) source at 70 eV ionization energy and scanned from 10 to 150 amu. CO 2 temperature-programmed desorption experiments were carried out using a Quantachrome Autosorb-IQ which consists of a flow switching system, a heated reactor, and a mass spectrometer.The samples (200 mg) were loaded in the reactor. Before the TPD analysis, the sample was purged under helium flow (50 mL min -1 ) from room temperature up to 873 K for 60 min at a heating rate of 10 K min -1 .The sample was subsequently cooled to 323 K under He flow, then the He flow was switched to CO 2 maintaining for 60 min.And then, the sample was swept with He for 100 min.The temperature was increased at 10 K min -1 from 323 to 1173 K.The 44, 35, 28, and 18 mass numbers were monitored during the TPD experiments. All the theoretical calculations were performed using the Vienna ab-initio simulation package (VASP) with the employment of a plane wave basis set 30.To analyze electron correlations in transition metal oxides, we conducted spin-polarized DFTU calculations with a value of U 4.0 eV applied to the Ti atom.The projector-augmented wave (PAW) method was used to represent the core-valence interaction 31.The plane wave energy cutoff was set to 400 eV.The generalized gradient approximation (GGA) with the Perdew-Burke-Ernzerhof (PBE) exchange-correlation functional was used in the calculations 32.Gaussian smearing method with the width of 0.05 eV was used.The Brillouin zone was sampled at the -point.The convergence criteria for the energy and force were set to 10 -5 eV and 0.02 eV/A, respectively. A slab model of anatase TiO 2 (1 0 1) surface was used in this study.The optimized lattice parameters of bulk anatase TiO 2 structure are a 3.78, b 3.78, and c 9.49.This TiO 2 model contains 72 atoms, with 48 O atoms and 24 Ti atoms.A vacuum gap of 12 A was employed in this study.During geometry optimization, all the atoms were allowed to relax.The La-modified TiO 2 was modeled by replacing one Ti atom with one La atom in the surface layer of anatase TiO 2 (1 0 1). The photocatalytic CO 2 reduction reactions were carried out in LabSolar-H2 system, and the schematic of experimental system is shown in Fig. S1. 100 mg La-modified TiO 2 catalyst was welldistributed onto a groove of circular glass reactor with an inner basal area of 20 cm 2 .A 300 W Xe arc lamp was used as a light source without use of filter.Light passed through a thickness of 6 cm IR water filter, and then the filtered light was focused onto the reactor.All samples were tested under UV-vis irradiation for 12 h.Degussa P25 and pure anatase were selected as the reference catalysts in photoreduction of CO 2 .The reaction setup was vacuumed and full of high purity CO 2 gas several times, and finally the CO 2 and water vapor mixture was bubbled into the reaction setup until reaching ambient pressure, the mixture gas regulated by CO 2 was passed through the water of constant temperature 303 K bubbler to generate the mixture.During irradiation, the photoreduction of CO 2 was operated at closed gas-circulation system and the sampling of gas products for content analysis in the reactor was taken every 1 h by an on-line gas chromatograph (GC-9560 HuaAiSePu Corp., China).The GC-9560 was equipped with two automated gas sampling valves, a thermal conductivity detector (TCD) and two flame ionization detector (FID).The quantification of the products was based on the external standard with the use of a calibration curve."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The X-ray diffraction (XRD) patterns of pure TiO 2 (0 ) and Lamodified TiO 2 (1 5 ) samples are shown in Fig. 1.The peaks marked 'A' and 'R' for samples can be indexed to the anatase and rutile phase of TiO 2 , respectively.The pure TiO 2 exhibits the peaks at 27.6 , 36.1 , 41.2 , and 54.3 , which corresponds to the indices of (1 1 0), (1 0 1), (1 1 1), and (2 1 1) planes of rutile phase.For the La-modified TiO 2 samples, with increasing the amount of La, the intensities for the peaks of rutile decrease, while the peaks at 25.5 , 37.9 , 48.2 , 53.8 , and 55.0 , which represent the indices of (1 0 1), (0 0 4), (2 0 0), (1 0 5), and (2 1 1) planes of anatase phase 33 appeared.When the amount of La was increased to 4 mol (4 ), the peaks corresponding to rutile phase disappeared and the peaks of anatase phase were broadened, indicating that content of La in TiO 2 not only inhibits the phase transformation from anatase to rutile but also avoids the agglomeration of TiO 2 particles 34. Compared with that of unmodified TiO 2 , the particle size of Lamodified samples decreases slightly with increasing the content of La, and BET measurement results (Table 1) support this suggestion. Compared with unmodified TiO 2 , the specific surface areas of the 5 samples increased from 3.13 m 2 /g to 46.9 m 2 /g.Such effects of La loading on samples are in agreement with the literature 34, which is because that the rutile phase formation may start at the defect sites on surface of anatase, and La 2 O 3 will easily occupy the defect sites of the anatase particles to prevent the anatase transforming into rutile and the increasing of the grains.Moreover, the XRD did not show any lanthanum oxide phase.It may be due to the very small particle size of lanthanum oxide highly dispersed on the surface layer of TiO 2 .Fig. 2 shows the TEM and high resolution TEM (HRTEM) images of pure TiO 2 , and La-modified samples.As can be seen, the sizes of 0 and 1 samples range from 10 to 30 nm (Fig. 2a andb).In comparison, 2 , 3 , 4 , and 5 samples are uniform with the average particle size of about 10-15 nm (Fig. 2c-f), demonstrating that La modification could inhibit the increase of TiO2 particle size, which is consistent with the results of XRD.The HRTEM image shows the lattice fringe of 0 sample (Fig. 2g), and the measured interplanar spacing of 0.324 nm corresponds to the (1 1 0) plane of rutile TiO 2 .The HRTEM images of 1 and 2 samples (Fig. 2h andi) clearly show interplanar spacing of 0.350 nm and 0.249 nm, which confirms the formation of anatase TiO 2 (1 0 1) and rutile TiO 2 (1 0 1), respectively.And 3-5 samples (Fig. 2j-l) show the measured interplanar spacing of 0.355, 0.241 and 0.19 nm, which correspond to the (1 0 1), (1 0 3) and (2 0 0) plane of anatase TiO 2 , respectively.Further characterization from aberration-corrected high resolution transmission electron microscope (Fig. S5) shows that there exists La 2 O 3 nanoparticle (2 0 1) with the size of 2 3 nm on the surface of TiO 2 .Fig. 3 shows the UV-vis DRS spectra of P25, pure TiO 2(0 ) , and La-modified TiO 2 (1-5 ) catalysts.Compared with P25, all Lamodified TiO 2 samples show a red shift of absorption, due to the charge-transfer transition between the f electrons of rare earth ion and the conduction or valence band of TiO 2 26.The maximum red shift corresponds to pure rutile TiO 2 , because of the band gap of TiO 2 is 3.2 eV for anatase and 3.0 eV for rutile.While the absorption of La-modified TiO 2 show obvious blue shift with the increase of La content.This is because that the increase of La content results in the enhanced content of anatase and the decrease of particle size of anatase. To investigate the interaction of CO 2 and La-modified TiO 2 , temperature-programmed desorption of CO 2 was performed.The TPD profiles of CO 2 for 0 sample, La-modified TiO 2 samples (1-5 ) are shown in Fig. 4. The CO 2 traces (m/e 44) of the desorption of CO 2 adsorbed on catalyst show two major peaks, one is located in the region of 350 450 K and the other in the region of 900 1075 K, which correspond to the weak basic sites and strong basic sites of the catalysts 35, respectively.The peaks appear at around 350 450 K might be attributed to the interaction between CO 2 and the weak basic sites 35, and stronger peak appearing at above 900 1075 K may result from the decomposition of the structural carbonate 36,37.As shown in Fig. 4, with increasing the content of La, the peak at 900 1075 K became stronger.While for the CO 2 desorption peak at around 373 423 K, the 2 La-modified TiO 2 sample show the highest intensity among the samples, indicating that appropriate content of La gives an optimized amount of weak basic sites.Such basic sites may enhance the adsorption of CO 2 on the catalyst and further promote the subsequent photoreduction of CO 2 . To investigate the surface chemical states and atomic concentration of La-modified TiO 2 , the XPS spectra of La and Ti elements on the surface of La-modified TiO 2 nanoparticle samples (1-5 ) are shown in Fig. 5.It can be obtained from the XPS survey spectrum that 2 and 5 La-modified TiO 2 contain 4.1 and 8.4 La 3d, respectively (shown in Table 1).Regarding the La 3d core level spectra (Fig. 5a), it was observed that the splitting of the main peaks of La 3d 5/2 and La 3d 3/2 are at around 834.2 and 851.0 eV, respectively, and the shake-up satellite peaks of La 3d 5/2 and La 3d 3/2 are at 838.5 and 855.2 eV.In comparison with the bonding energy of pure La 2 O 3 (834.9eV) 38, the slight shift of La 3d 5/2 (834.2 eV) to lower binding energy indicates the formation of La O Ti in the samples 27.As shown in Fig. 5b, it can be seen that Ti 2p XPS spectra of La-modified TiO 2 is mainly composed of the main peaks of Ti 2p 1/2 at 464.0 eV and Ti 2p 3/2 at 458.2 eV, respectively, which shifts to a lower value in comparison with the reported result 39,40.Therefore, it can be concluded that a tiny number of La atoms substitute the surface Ti atoms in the form of Ti O La. Electron paramagnetic resonance (EPR) measurements were further carried out on the as-prepared catalysts at room temperature.As shown in Fig. 6, all the La-modified TiO 2 samples gave rise to a strong EPR signal, while almost no signal was seen in the unmodified TiO 2 sample.The EPR spectra of La-modified TiO 2 samples show a paramagnetic signal centered around g 1.98 (Fig. 6), it agrees very well with g values reported for Ti 3 ions 41.It can also be seen from the Fig. 6, 2 sample gives the highest intensity of EPR signal of Ti 3 , and further increasing the La loading from 2 to 5 did not lead to the enhancement of Ti 3 , which may because only a certain amount of La can modify the surface of TiO 2 , and excessive La loading induces the accretion of La 2 O 3 on the TiO 2 surface.DFT calculation on the spin density charge and Bader charge analysis of the La-modified TiO 2 further supports the formation of Ti 3 on the surface (Fig. S3).In combination this with the XRD patterns, XPS spectra, it can be concluded that La does not enter the bulk lattice of TiO 2 , but it modifies TiO 2 in the form of Ti O La. Fig. 7 shows the Raman spectra of 0 sample and La-modified TiO 2(1 -5 ) .From Fig. 7, it can be seen that the characteristic bands of rutile phase appear at 144, 235, 445, and 612 cm -1 , and the bands of anatase phase are at 143, 195, 395, 515, and 638 cm -1 .With the increase of La content, the intensities of the bands of rutile phase decrease, while those of anatase phase increase.Meanwhile, the increasing of La content also brings about a blue shift of the anatase peaks (from 143 cm -1 to present values), indicating the formation of oxygen vacancies 42, which could be due to the distortion of anatase crystalline lattice induced by La modification 43.For La-modified TiO 2 , the oxygen vacancies are prone to be formed because the chemical bond strength of La O is stronger than the Ti O 27.However, excess loading of La (4 ) incurs a slight red shift of anatase peaks in comparison with that of 3 mol (146.5 cm -1 ) La-modified TiO 2 , implying the decrease of oxygen vacancies, which could be attributed to excess of La 2 O 3 covering on the surface of anatase TiO 2 . The oxygen vacancies are favorably generated on the Lamodified TiO 2 surface can also be verified by the quantum calculation (Fig. 8 and Fig. S2).The formation energy of an oxygen vacancy on the surface of pure TiO 2 (Fig. 8b) from the (1 0 1) surface of anatase TiO 2 (Fig. 8a), and that of La-modified TiO 2 (Fig. 8d) from La-modified (1 0 1) surface of anatase TiO 2 (Fig. 8c) were calculated.And the oxygen vacancy formation energy was defined as: where E(cell vac ) and E(cell) are the total energies of the optimized supercell with and without an oxygen vacancy, and E(O 2 ) is the energy of free oxygen molecule in gas phase.A positive value of E vac means that energy is needed to create the vacancy.The calculated result is that the formation energy of an oxygen vacancy on the Lamodified TiO 2 surface (-0.72 eV) is lower than that formed on the pure TiO 2 surface (1.74 eV).In other words, the oxygen vacancies formed from the La-modified TiO 2 surface is much easier than that formed from the pure TiO 2 surface. The photoreduction of CO 2 in the presence of water vapor was operated in a closed gas-circulation system, and the photocatalytic activities of all photocatalysts were measured under simulated solar irradiation Fig. 9a shows the yield of CO and CH 4 from CO 2 photoreduction using pure anatase, Degussa P25 and La-modified TiO 2 samples under UV-vis illumination for 20 h.Compared with the P25 and anatase, all the La-modified TiO 2 samples demonstrated enhanced CH 4 selectivity except for 5 La-modified TiO 2 sample.For La-modified TiO 2 samples, the yield of CH 4 first increases and then decreases with the increasing of La content.Among the samples with different La contents, 2 sample shows the highest yield of CH 4 .In comparison with the yield of CH 4 of 0.264 mol on TiO 2 (P25), 3.457 mol of CH 4 was achieved on 2 sample, showing a 13 times enhancement of CH 4 yield. To confirm the present conversion is a photocatalytic reduction process, the reaction was performed in the absence of photocatalyst or light irradiation, and no reduced products were detected.In addition, when the reactor was filled with He (instead of CO 2 ) and H 2 O vapor, no carbon-containing compounds were detected either.To further elucidate the origin of the CO and CH 4 , the 13 C isotopic tracer experiments by GC-MS using 13 CO 2 (Fig. S4) were conducted.The results show that the C in the photocatalytic products of CO and CH 4 is mainly from CO 2 . Based on the characterization and photocatalytic evaluation results, the increased formation of CH 4 on the as-prepared catalysts could be due to the following factors: (1) the introducing of La 2 O 3 to the present catalysts could effectively adsorb CO 2 because of its basic characteristics.Such adsorption is of great importance for photoreduction of CO 2 ; (2) the surface modification of La exists in the form of Ti O La bond at the interface of La 2 O 3 and TiO 2 (Fig. 10), and oxygen vacancies and Ti 3 are favorably generated on the surface of TiO 2 .Consequently, the formed oxygen vacancies help to adsorb and dissociate H 2 O, and the Ti 3 sites could bind CO 2 44, both contributing to the subsequent photoreduction; (3) La 2 O 3 on TiO 2 surfaces might capture the electrons and facilitate the separation of photogenerated electrons and holes, and Ti 3 also could separate electrons and holes, which is more effective than the sole electron trapping effect by TiO 2 alone.Specifically in photoreduction of CO 2 and H 2 O, the formations of CO and CH 4 require two and eight electrons, respectively.For the La-modified TiO 2 , a band gap of 3.0 eV with valence band edge at 2.4 eV and the conduction band edge of -0.6 eV vs. NHE (pH 7) was estimated 45 (Fig. 10).The reduction potential for the formations of CH 4 and CO are -0.24eV and -0.52 eV, respectively 46.So CH 4 will be favorably formed if there exists enough electrons and H .For the present catalysts, the synergistic effect between basic oxide La 2 O 3 , which enhances the adsorption of CO 2 molecules on the catalyst surface, and the formation of oxygen vacancies and Ti 3 , which supply enough H and electron, result in the improvement of photocatalytic reduction of CO 2 to CH 4 . To investigate the photostability of as-prepared catalysts, the 2 sample was selected to perform prolonged photoactivity reaction.As shown in Fig. 9b the yield of CO and CH 4 were increased continually with 36 h irradiation, indicating the good photostability of the photocatalyst."
  },
  {
    "title": "Conclusions",
    "content": "Surface La-modified TiO 2 photocatalysts with different La amounts were prepared and tested for photocatalytic reduction of CO 2 in the presence of water vapor.The results showed that the La 3 was mostly uniformly dispersed onto TiO 2 in the form of La 2 O 3 particles, and a handful of La atoms modify the surface of TiO 2 in the form of Ti O La.The introduction of La to the TiO 2 also promotes the formation of oxygen vacancies and Ti 3 onto the surface of TiO 2 .Consequently, La-modified TiO 2 samples demonstrate the enhanced CH 4 selectivity, with a 13 times of CH 4 yield of that on the P25 reference sample.The significantly enhanced CH 4 selectivity on surface La-modified TiO 2 samples is mainly attributed to the synergistic effects of the highly dispersion of La 2 O 3 and the formations of Ti 3 and oxygen vacancies on the adsorption of the CO 2 and H 2 O as well as the separation of photo-generated electrons and holes.Such a La 2 O 3 -loaded TiO 2 catalyst with La surface modification helps to provide new insights into the design and development of highly efficient photocatalysts for photoreduction of CO 2 with H 2 O vapor. Fig. 1.(a) XRD patterns of 0 , 1 , 2 , 3 , 4 and 5 samples. Fig. 2. TEM and HRTEM image of 0 (a, g), 1 (b, h), 2 (c, i), 3 (d, j), 4 (e, k), and 5 (f, l) samples. Fig. 4. CO2-TPD profiles of 0 , 1 , 2 , 3 , 4 and 5 samples. Fig. 5. XPS spectra for (a) La 3d of 1, 2 , 3, 4, and 5 samples, (b) Ti 2p of 0 , 1, 2 , 3, 4, and 5 samples. Fig. 6.EPR spectra for 0 , 1 , 2 , 3 , 4 and 5 samples. Fig. 7. Visible Raman spectra of 0 , 1 , 2 , 3 , 4 and 5 samples. Fig. 8. Sketch of pure TiO2 with a perfect surface (a) and pure TiO2 with an imperfect surface with oxygen vacancies (b), the La-modified surface of TiO2 (c), and the Lamodified surface with oxygen vacancies (d) on the anatase TiO2(1 0 1) surface.The gray, red, and blue balls denote Ti, O, and La atoms, respectively.(For interpretation of the references to colour in this figure legend, the reader is referred to the web version of this article.) Fig. 10.Mechanism for the photoreduction of CO2 with H2O vapor over the La-modified TiO2 photocatalyst. The BET surface area, pore size, pore volume and surface atomic ratio of 0 , 2 and 5 samples. This work is financially supported by Prospect Oriented Foundation of China University of Petroleum, Beijing (Grant Nos.QZDX-2011-02, QZDX-2014-02), Beijing Nova Program (Grant No. Z11111005450000), Beijing Higher Education Young Elite Teacher Project (YETP0696), and Program for New Century Excellent Talents in University (NCET-11-0732). Supplementary data associated with this article can be found, in the online version, at http://dx.doi.org/10.1016/j.apcatb.2014.12.011."
  }
]