[
  {
    "title": "Doi",
    "content": "10.1080/19443994.2015.1043497"
  },
  {
    "title": "Article_Title",
    "content": "Modeling of photodegradation process to remove the higher concentration of environmental pollution"
  },
  {
    "title": "Abstract",
    "content": "Taylor Francis makes every effort to ensure the accuracy of all the information (the \"Content\") contained in the publications on our platform.However, Taylor Francis, our agents, and our licensors make no representations or warranties whatsoever as to the accuracy, completeness, or suitability for any purpose of the Content.Any opinions and views expressed in this publication are the opinions and views of the authors, and are not the views of or endorsed by Taylor Francis.The accuracy of the Content should not be relied upon and should be independently verified with primary sources of information.Taylor and Francis shall not be liable for any losses, actions, claims, proceedings, demands, costs, expenses, damages, and other liabilities whatsoever or howsoever caused arising directly or indirectly in connection with, in relation to or arising out of the use of the Content."
  },
  {
    "title": "Experimental",
    "content": "The used chemicals were including ZnO (99, Merck).p-Cresol (99.5, Fluka), NaOH (99 Merck), H 2 SO 4 (95-97) and other required materials were obtained from Merck, and were used without further purification.To obtain the actual responses, the design of the experiment (Table 1) was performed in laboratory by using a non-continuous binary photoreactor which identified in our previous work 16.According to the design, known amount of p-Cresol and ZnO were mixed to make a litter suspension that was irradiated by an UV-A lamp (6 W).The intensity of the light source peaked at 365 nm.To maintain suspension throughout the photoreactor, the solutions were magnetically stirred.In order to liberate any CO 2 formed, oxygen availability and fluidization of solution, air was blown into the solution by an air-pomp with flow rate 150 Lh -1 .The temperature of the solution was maintained at 25 C by following cool water into the binary of the photoreactor 25.To evaluate the degradation, the samples were withdrawn from the bulk solution during performance and filtered through a 0.45 m polytetrafluro-ethylene membrane 16.To measure the unreacted p-Cresol, the absorbance of solutions was recorded by Shimadzu, UV-1650PC UV-Visible spectrometer, at 277 nm that is maximum wavelength of the Cresol 25.The observed results in the laboratory were used to calculate the efficiency as actual response that applied for fitting process and modeling.The calculation method was reported by our previous work 25. As Table 1 shows, the experiments were designed by central composite design (CCD) that is default of Design-Expert software version 8.0.7.1, Stat-Ease Inc., USA 33.As initial information, the level of the effective variables were selected in vicinity of the photodegradation efficiency according to previous work 25.In the design, the number of experiments was 30 which consist of the factorial points (16), the axial points (8) and the replications (6).The replications are used to measure experimental error.Table 2 shows the variables and also their used levels in the design.In Table 1, each raw presents an experiment that contains the run number, variable (x i ) and observed output (actual responses). RSM creates a functional relationship between variable-variable and variables-response by using approximated low-degree polynomial models that consist of the variables and their coefficients.Eq. (1) shows the second-order polynomial which RSM commonly uses for optimization process 34, where Y is the interested response, 0 is a constant term, i is the coefficient of the linear terms, ii represents the coefficient of the quadratic terms, ij is the coefficient of the interaction terms while x i are control variables and \"\" is a random experimental error 35. To estimate the 's, RSM fitting process provides the sufficient data by regression technique 36,37.In the process, the actual responses from performance of the experimental design are fitted to the linear, twofactor interaction (2FI), quadratic and cubic models by sequential model sum of squares (SMSS) 36,37.The results of the SMSS are compared to select the provisional model for the system.In this case the system is photodegradation.The SMSS compares the sufficiency of the models using the statistical significance of adding new model terms, step-by-step in increasing order 38.The comparison is presented by statistical evidence such as the F-value, predicted residual sum of squares (PRESS), adjusted R-squared (R Adj ), predicted R-squared (R pred ), and probability value (p-value).The PRESS is the sum of the squares of a model's prediction errors.The minimum value of the p-value and PRESS as well as the maximum value of R Adj , R Pred , and F-value are considered to determine the provisional model of the process 39.The provisional model is usually suggested by the software and is studied in detail by using ANOVA 40.The ANOVA indicates the significance of each term of the model, including the intercept, linear, interaction, and square terms.In fact, the adequacy of the model such as importance of the terms is certified by ANOVA and then the model is used to navigate the process (in this case photodegradation).The model is able to track the optimum amount of the variables in the experimental design points by canonical and 3D plots as points and surface response respectively.Moreover, the model predicts the desirable condition that selected by experimenter to maximize the yield of the process (in this case, the efficiency of the photodegradation)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "In the modeling process, the obtained actual responses of performed experimental design (Table 1) were fitted with linear, 2FI, quadratic and cubic models to calculate residuals.The residual values shows the difference between actual responses and the models predicted responses which were based of SMSS evaluation and model selection 36,37.Table 3 shows the statistical evidences of the models that originated based on the residuals.As observed, standard deviation (std.dev.) of the quadratic model that indicates the outlier of the actual responses was minimum in comparison with other models 41.Moreover, its lack of fit's F-value and p-value were very small and too large respectively which show the actual responses are fit with quadratic model.In addition, the R Adj (1.00) was in reasonable agreement (0.20) with R Pred (0.999) as well as maximum R 2 and minimum PRESS also belong to the model.As a summary of the fitting process, the SMSS comparison for 2FI, linear, quadratic and cubic models is presented by Table 4 that illustrates the merit of the quadratic model.Therefore, the statistical evidence has confirmed the sufficiency of the quadratic model and it was suggested as provisional model to validate in details by using ANOVA. The provisional model presents the relationship between irradiation time, pH, amount of the photocatalyst and concentration of p-Cresol as effective variables and the efficiency as interested response (Eq.( 2)), where x 1 , x 2 , x 3 and x 4 are the input variables that have identified in Table 2 and Y is photodegradation efficiency as interested response and output.The model presents the linear parameters (x 1 , x 2 , x 3 and x 4 ), quadratic factors (x 2 1 ; x 2 2 ; x 2 3 ; x 2 4 ) and interaction of the variables (x 1 x 2 , x 1 x 3 , x 1 x 4 , x 2 x 3 , x 2 x 4 and x 3 x 4 ) 27.Generally, each parameter multiplies to individual coefficient that determined specific weight of the parameter in the model.The multiplied parameters and their multiplied weights were linked by using positive () and negative (-) sign.The signs affect on the slop of the response's curve synergistically or antagonistically while the weights are the importance of the parameters in the model 27.The linear and square parameters had synergic and antagonistic effect on the response respectively while the effect of the interactions parameters was consisted of them.For example, the effect of irradiation time (x 1 ) on the photodegradation was analyzed in Fig. 1.As observed, the linear has presented the synergistic effect while curvature parts consisted of synergistic and antagonistic effect on the efficiency.In the model (Eq.( 2)), the weights of linear and quadratic parameter for x 1 were 1.004 and 1.996E-3, respectively whereas the parameter affected synergistically () and antagonistically (-) on the photodegradation . As shown the slope of linear is sharper than curvature because their weights in the model.The linear effect was demonstrated from 120 to 240 min of irradiation time which improved the photodegradation.However, the quadratic effect cooperated vice versa from 250 to 300 min.The ANOVA indicates the significant of the each term in the model and consequently confirm the final form of the model.As Table 5 shows, the ANOVA evidence of existing terms in the provisional model.Generally, the ANOVA has confirmed great significance of the suggested model due to present high F-value, 845.09, and low p-value 0.0001.The form of the suggested model can be changed according to the ANOVA information about the terms.As shown, only x 1 x 2 and x 1 2 are not-significant which could remove from the original provisional model.Therefore the new form of the final model are presented in Eq. ( 3), where the terms have already been introduced by Eq. ( 2).For more evaluation, the normality of residuals, constant error and residual outlier is checked by diagnostic plots such as the plots in Fig. 2. The remarkable agreement between the actual values and the predicted values of the study was presented in Fig. 2(a) while the distance of each observation from the fitted line was plot (Fig. 2(b)).Therefore, ANOVA and diagnostic plots certified the adequacy of the quadratic model that were used to navigate the design space. The model was able to optimize the variables by using canonical response and graphical plots.The canonical responses are local optimums that determine by differentiating the quadratic model (Eq.( 2)) as presented by Eqs. ( 4)- (7), where the terms were introduced by Table 2.In fact, canonical optimization which is a kind of onevariable-at-a-time, presents the optimum points of the input that could maximize the output.However, the graphical optimization illustrated a surface area of the optimum condition with lower standard error by using 3D plots.The plots simultaneously considered the effect of two effective variables on the output while other two parameters were kept constant that were determined by canonical optimization.As shown in Fig. 3, the quadratic model was able to track the behavior of the input variables during the photodegradation process.Fig. 3(a) shows the amount of photocatalyst was varied while pH and p-Cresol were kept constant at 7.5 and 75 mg L -1 while Fig. 3(b) illustrates the pH was varied while the concentration of p-Cresol and photocatalyst were kept constant at 75 mg L -1 and 1.5 g L -1 , respectively and Fig. 3(c) indicates the concentration of p-Cresol was varied while photocatalyst and pH were kept constant at 1.5 and 7.5 g L -1 .As observed, irradiation time always enhances the photodegradation when it was considered with other three variables 27.Therefore, the variables including pH, photocatalyst and p-Cresol, were studied at the end of 300 min of the irradiation time (Figs.456).Fig. 4 presents the 3D and contour plot of p-Cresol concentration and pH in area of the standard error which simultaneously varied at constant amount of photocatalyst (1.5 g L -1 ).The efficiency was decreasing when the concentration of p-Cresol was increased in the selected pH up to 97.This observation may be due to the fact that p-Cresol molecules competes with OH A to attract generated h 33.On the other hand, the efficiency was slightly enhanced with increasing pH from 6 to 7.5 also up to 97 that could be attributed to an enhancement in the number of adsorbed p-Cresol on the ZnO surface, ZnO and p-Cresol have Fig. 3.The 3D plots of pH, photocatalyst and p-Cresol vs. the irradiation time: (a) the amount of photocatalyst was varied while pH and p-Cresol were kept constant at 7.5 and 75 mg L -1 , (b) the pH was varied while the concentration of p-Cresol and photocatalyst were kept constant at 75 mg L -1 and 1.5 g L -1 and (c) the concentration of p-Cresol was varied while photocatalyst and pH were kept constant at 1.5 g L -1 and 7.5 respectively. different charge in this range of pH 17.However, the efficiency was decreased above this optimum. Fig. 5 depicts the synergy response surface photocatalyst amount (1.0-2.0 g L -1 ) and pH (6-9) with constant p-Cresol concentration (75 mg L -1 ) at the end the irradiation time.As shown, the efficiency was increased by increasing 1.0-1.5 g L -1 photocatalyst amount and pH (6)(7)(8)(9).One of the reasons of the enhancement is improvement of the production of hydroxide radicals due to increase the active site of the photocatalyst.However, when the amount of photocatalyst was increased in excess of the optimum (1.5 g L -1 ) the efficiency decreased (97).The reduction could be attributed to the screen effect phenomena 16. Fig. 6 illustrates the view of the simultaneous behavior of photocatalyst (1.0-2.0 g L -1 ) and p-Cresol (50-100 mg L -1 ) at constant pH (7.5).This point of view also confirmed the optimum condition at 97.As illustrated the photodegradation increased with increasing the photocatalyst for whole range of p-Cresol while it decreased with increasing p-Cresol Fig. 4. The view of the 3D and contour plots of p-Cresol's concentration and pH at 300 min of irradiation time as variables while the amount of the catalyst was kept constant at 1.5 g L -1 , the level of the effective pH was illustrated 7-8.5 and maximum concentration of p-Cresol was 75 mg L -1 .Fig. 5.The view of the 3D and contour plot of the photocatalyst amount and pH at 300 min of irradiation time while the concentration of the p-Cresol was kept constant at 75 mg L -1 , the level of the photocatalyst was determined between 0.9 and 2.3 g L -1 and the level of pH was 6.8-8.8 that is a little bit wider than the level that presented in Fig. 4. for the catalysis range.As a result, the graphical optimization proved these values of input effective variables including irradiation time (240 min), pH (7.5), photocatalyst (1.5 g L -1 ) and p-Cresol (75 mg L -1 ) maximized the efficiency at 97. The model predicted the desirable efficiency at particular value of input variables and standard deviation by using the numerical option of the used software.The selected particular condition included irradiation time (in rang), pH (in rang), photocatalyst (in rang) p-Cresol (maximum), efficiency (maximum) and standard error at minimum value in the numerical software option.The model predicted condition was included the irradiation time (280 min), pH (7.9), photocatalyst amount (1.5 g L -1 ), p-Cresol concentration (95 mg L -1 ) and efficiency 95.The desirability of the prediction was 0.921 which is quite close to 100 (at the goal).Desirability is an objective function that uses mathematical methods to find the optimum condition.The range of the function is from zero (outside of the limit area) to one (at the goal) 33.The condition was validated by further experiments which confirmed the prediction.The practical results of the efficiency (94.7) were very close to the predicted value.As Table 6 shows, p-Cresol concentration (95 mg L -1 ) in the model prediction was higher than the concentration in the designed while the time of the irradiation was decreased and the amount of the photocatalyst was kept constant.At this desirable condition the efficiency was not reduced which it may be due to select the proper pH (7.9) that increases generation of hydroxyl radicals (AOH) 24."
  },
  {
    "title": "Conclusions",
    "content": "The process of p-Cresol photodegradation was carried out in ZnO suspension and under UV irradiation according to an experimental design.The design consisted of four variables such irradiation time, pH, the amount of ZnO and p-Cresol's concentration and the efficiency as response.The design was performed to calculate the efficiencies that were used for modeling process by RSM to suggest a suitable model of the photodegradation.As a result, quadratic model was suggested as provisional model then it was validated by ANOVA.The validated model was a mathematic equation that used to optimize the variables included irradiation time, pH, amount of ZnO and p-Cresol's concentration based on maximized efficiency.In the level of the experimental design, the optimum values of the variables were included irradiation time (300 min), pH (7.5), photocatalyst (1.5 g L -1 ) and p-Cresol (75 mg L -1 ) which created the efficiency 97.Moreover, the model predicted the desirable efficiency by a particular condition which included, irradiation time (in rang), pH (in rang), photocatalyst (in rang) p-Cresol (maximum) and efficiency (maximum) as output while standard error was at minimum value.The predicted condition included irradiation time (280 min), pH (7.9), photocatalyst (1.5 g L -1 ) p-Cresol (95 mg L -1 ), efficiency (95) and standard error was at minimum value (0.2).The prediction was confirmed by further experiments and presented the efficiency (94.7)That was very close to the predicted value (95).As observed, p-Cresol concentration (95 mg L -1 ) in the model prediction was higher than the concentration in the designed experiment while the time of the irradiation was less than the design.The amount of the photocatalyst was kept constant.Therefore, RSM succeeded to model the photodegradation process to enhance the efficiency of the higher concentration of environmental pollutants. Fig. 1.The linear and quadratic effect of irradiation time (x 1 ) as input variable on the photodegradation efficiency as output response with error bar.The figure consists of linear and curvature parts that confirmed the effect of the irradiation time of the efficiency. Fig. 2. The diagnostic plots of model's significance and adequacy: (a) scatter plot of predicted values vs. actual values of the observation and (b) residual of the observation that was illustrated by residuals vs. run number. Fig.6.The 3D and contour plots of the p-Cresol's concentration and photocatalyst amount at 300 min of irradiation time while the pH was kept constant at 7.5.The mentioned levels of p-Cresol and photocatalyst in the previous figures were confirmed. The CCD experimental-design of the photodegradation, x 1 , x 2 , x 3 and x 4 are the input variables, Y a and Y p are actual and model predicted output respectively, the residuals are the difference between Y a and Y p The effective variables in code and actual value and their used level for CCD experimental design of the photodegradation The fit statistics and lack of fit evidence of linear, 2FI, quadratic and cubic models which obtained from fitting process The ANOVA of the existing terms in suggested quadratic model, all the terms are significant except x 1 x 2 and x 1 Y. Abdollahi et al. / Desalination and Water Treatment Downloaded by FU Berlin at 19:31 June 2015 Downloaded by FU Berlin at 19:31 30 June 2015 Y. Abdollahi et al. / Desalination and Water Treatment Downloaded by FU Berlin at 19:31 30 June 2015 The authors wish to acknowledge the University of Malaya-Ministry of Higher Education Grant UM.C/ 625/1/HIR/MOHE/ENG/29, University of Malaya Research Grant (UMRG) RP014C-13AET, Fundamental Research Grant Scheme (FRGS) with project no.: FP011-2014A and Science Fund with project no.: SF020-2013."
  }
]