[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2020.118931"
  },
  {
    "title": "Article_Title",
    "content": "Highly correlation of CO2 reduction selectivity and surface electron Accumulation: A case study of Au-MoS2 and Ag-MoS2 catalyst"
  },
  {
    "title": "Abstract",
    "content": "Artificial photosynthesis from CO 2 reduction to methane is severely hampered by the kinetically challenging eight-electron transfer process.Accumulated electrons has been demonstrated can decrease this kinetic barrier.However, charge accumulation were mainly reported in several homogenous systems because of its difficulties in heterogenous systems.Here we identify that highly accumulated electrons exist in Au loaded ultrathin MoS 2 under light irradiation, resulting in a superior performance of CO 2 reduction to methane.The selectivity for methane is up to 80 with an average production rate of about 19.38 molg -1 h -1 in pure water.Further detailed studies reveal that plasmon-excited hot electrons transfer from Au to charged excitons in ultrathin MoS 2 promotes electron accumulation and multi-electron CO 2 reduction kinetics for methane generation.This is further supported by the CO 2 reduction performance of Ag-MoS 2 .Along with the vanished accumulated electrons, CO is the main product with a selectivity of 98 ."
  },
  {
    "title": "Experimental",
    "content": "All chemicals were analytical grade and used as received from Sigma-Aldrich without further purification.For ultrathin pure MoS 2 sample, 5 mmol sodium molybdate dehydrate (Na 2 MoO 4 2H 2 O) and 30 mmol thiourea were dissolved in 70 mL deionized water under vigorous stirring to form a homogeneous solution.After being stirred for 30 min, the solution was transferred into a 100 mL Teflon-lined stainless steel autoclave, maintained at 220 C for 18 h and allowed to cool down to room temperature naturally.The obtained solid products were collected by centrifugation, washed with absolute ethanol and deionized water more than three times, sonicated in water for 1 h and then freeze-dried for further characterization.For Au-MoS 2 sample, 0.025 g of ultrathin pure MoS 2 nanosheets were ultrasonically dispersed in 100 mL deionized water. 2 mL of 0.5 g/L HAuCl 4 3H 2 O aqueous solution was added in the above MoS 2 suspension by vigorous stirring under 300 W Xenon light irradiation.After 30 min, the suspension centrifuged, washed and then dispersed in deionized water for catalytic use.The preparation of Ag-MoS 2 sample is similar as that for Au-MoS 2 sample, except for changing the 2 mL of 0.5 g/L HAuCl 4 3H 2 O aqueous solution to 2 mL of 0.5 g/L AgNO 3 aqueous solution. The purity and the crystallinity of the as-prepared samples were characterized by powder X-ray diffraction (XRD) on a Japan Rigaku Xray diffractmeter/RINT2500HLR using Cu K radiation while the voltage and electric current were held at 40 kV and 80 mA.The transmission electron microscope (TEM) analyses were performed by a JEOL JEM-2100 F field emission electron microscope.X-ray photoelectron spectroscopy (XPS) was carried out by irradiating the sample with a 320 m diameter spot of monochromated aluminum K X-rays at 1486.6 eV under ultrahigh vacuum conditions (performed on PHI5000VersaProbe). UV-vis-NIR Spectrophotometer diffuse reflectance spectrum (DRS) of the sample was measured using a Shimadzu UV-3600 UV-vis-NIR Spectrophotometer.The in-situ DRIFT measurement was performed on a Nicolet 8700 DRIFT spectrometer using KBr window.Before measurement, the catalyst powder was placed in the cell and evacuated at room temperature for 5 min.Further to identify if the product was formed from CO 2 , labeled experiments were done using 13 CO 2 and the products were analyzed with gas chromatograph mass (GC-MS) by Shimadzu GCMS-QP2010 with thermal conductivity detector (TCD). Photocatalytic CO 2 reduction experiments were performed under a 300 W Xenon light located approximately 10 cm from the sample.The light intensity is controlled at 150 mW/cm 2 .The reaction cell (capacity 600 mL) was made of Pyrex glass with a quartz window on top.Typically, 0.025 g of the as-prepared photocatalyst powder was dispersed in 100 mL deionized water under sonication.Before illumination, pure CO 2 gas was slowly bubbled through the reaction vessel for 10 min.Then the reaction vessel was sealed and irradiated under the Xenon light.During the photocatalytic tests, the temperature of the reaction vessel was maintained at 15 C by providing a flow of cooling water.For 13 CO 2 isotopic labelling experiment, pure Ar gas was slowly bubbled through the reaction vessel for 30 min.Then 200 mL of Ar gas was pumped out from the sealed reaction cell and 200 mL of 13 CO 2 gas was injected.The concentration of CH 4 and CO were determined with online gas chromatography equipped with a flame ionization detector (FID, Ar carrier) and the catalytic conversion furnace.The amount of H 2 evolved was determined with online gas chromatography equipped with a thermal conductivity detector (TCD).The concentration of formic acid products in the reactor solution was measured using Ion Chromatography System (Dionex, ICS-1000) equipped with an ICE-AS6 column. Electrochemical measurements were performed on a CHI 700E electrochemical workstation using a standard three-electrode cell with a working electrode, a platinum mesh as counter electrode, and a standard saturated calomel electrode (SCE) in saturated KCl as reference electrode.The working electrodes were prepared by dipcoating: Briefly, 5 mg of photocatalyst was suspended in 0.1 mL of ethanol in the presence of 1 Nafion to produce slurry, which was then dipcoated onto a 2 cm 1.5 cm FTO glass electrode and drying at 25 C. 2.5 Computational Methods.All the simulations were performed using VASP package.17181920 The Perdew-Burke-Ernzerhof (PBE) functional 21,22 was used to account for electronic exchange-correction interaction and the projector augmented wave method 20 was applied to construct the pseudopotential.The Gaussian smearing method was adopted to determine the partial occupancies for each orbital.We constructed a slab model of monolayer MoS 2 with S-edge.Nine layers were arranged along 11 2 0 direction (z axis).We included 15 A of vacuum in the y and z directions to prevent interactions between surface molecules and the replicated cells.Only x direction is period.We allowed the top six layers of MoS 2 atoms to relax while the lower three layers were fixed to maintain the optimal slab model. Transition states were located using the climbing Nudged Elastic Band (CINEB) method included in VASP-VTST code.23 Firstly, the reactant and product states were optimized before the CINEB calculations.Then the CINEB calculation were performed using eight intermediate images between the optimized reactant and product structures.Finally, based on the CINEB results, the dimer calculation 24 was performed to accuracy locate the transition state structure.A true transition state from dimer calculation was confirmed using phonon calculations to show a single negative frequency in the Hessian.To describe accurately the slab model and the reaction process, we use the energy cutoff of 500 eV, and the force and energy convergence criteria of 1.0 10 -2 eV A -1 and 1.0 10 -6 eV, respectively.We used the Monkhorst-Pack mesh approach for the K-point sampling with a 1 2 1 mesh in which z direction is along the vacuum direction.The Gaussian smearing method was adopted to determine the partial occupancies for each orbital."
  },
  {
    "title": "Results_and_Discussion",
    "content": "XRD was carried out to investigate the structural information of different MoS 2 samples (Fig. S2).All of the diffraction peaks agree very well with the standard pattern of hexagonal MoS 2 (JCPDS card No. 75-1539).No characteristic diffraction peaks from Au or Ag are observed from the XRD patterns because of their low concentrations.The content of Au in Au-MoS 2 sample is 1.97 wt and the content of Ag in Ag-MoS 2 sample is 2.15 wt measured by ICP-AES.The thickness of the ultrathin pure MoS 2 from AFM is around 2.7 nm, which is corresponding to about 4 layers of MoS 2 along 001 direction (Fig. S3).Low magnified TEM image in Fig. 1a indicates that Au nanoparticles are randomly dispersed on the surface of the ultrathin MoS 2 nanosheet with an average size of 36 nm.High resolution TEM (HRTEM) images in Fig. 1b,c around 229 and 232 eV, suggesting the dominant Mo (IV) species in all three MoS 2 samples.26 Fig. 1f indicates S 2p primarily exhibits a single doublet with the 2p 3/2 and 2p 1/2 peaks located at around 162 and 163 eV, respectively, which is consistent with the -2 oxidation state of S. In Au-MoS 2 sample, the Au 4f 7/2 and Au 4f 5/2 peaks are located at 83.9 and 87.6 eV (Fig. 1g), respectively, both of which are the characteristic values of metallic Au.There is no significant shift in S 2p band before and after gold decoration (Fig. 1f).However, the binding energies of Mo 3d in Au -MoS 2 are negatively shifted by ca.0.40 eV as compared to the ones in pure MoS 2 (Fig. 1e), which may be ascribed to the electron transfer from Au to Mo in Au-MoS 2 sample.Different from the Au -MoS 2 sample, the binding energy in XPS for both S 2p and Mo 3d in Ag-MoS 2 sample shifted positive values by ca.0.50 and 0.3 eV (Fig. 1e and1f), respectively, as compared to the ones in pure MoS 2 .In the Ag-MoS 2 sample, some of the Mo 4 ions in the interface are replaced by Ag and form the Ag 2 S interlayer between Ag and MoS 2 .Considering that the valence state of Ag is much lower than that of Mo 4 , S vacancies will form in the interlayer lattice.The positively shift of S 2p bands can be attributed to the increased concentration of S vacancies in Ag-MoS 2 sample.The positively shift of Mo 3d implied electrons transferred from Mo 4 to Ag in the interface between Ag 2 S and MoS 2 .The existence of Ag 2 S interlayer was further confirmed by the Ag XPS spectrum.As shown in Fig. 1h, two main characteristic peaks arising from Ag 3d 5/2 and Ag 3d 3/2 orbitals are observed around 368.5 and 374.5 eV, which is characteristic of metallic silver.27 Besides, another two peaks of Ag 3d 5/2 and Ag 3d 3/2 were found at 368.1 and 374.15 eV, respectively, which is consistent with the previously reported data for Ag 2 S. 28 Raman spectroscopy can assess the crystallinity, effect of lattice strain, layer thickness and the van der Waals interaction at the interface of two-dimensional MoS 2 , in terms of the position and frequency difference of two characteristic vibrational modes, E 2g and A 1g .29 Fig. S7 shows the Raman spectra of the different MoS 2 samples with the inplane vibration mode of Mo-S atoms, E 1 2g , and the out-of-plane vibration mode of S atoms, A 1g , located at around 375 and 403 cm -1 , respectively.All these three spectra recorded from pure MoS 2 , Au-MoS 2 and Ag-MoS 2 show similar spectral features.The UV-vis absorption spectra of the pure MoS 2 , Au-MoS 2 and Ag-MoS 2 samples (Fig. 1i show the wellknown A and B excitonic absorption bands of MoS 2 at 670 nm (1.865 eV) and 612 nm (2.02 eV).30 These two absorption bands have been well characterized to be the direct excitonic transitions at the K point of the Brillouin zone in monolayer and few-layer MoS 2 .Plasmonic absorption from Au and Ag nanoparticles are overlapped by the strong absorption from MoS 2 before 700 nm. CO 2 reduction on the as-prepared MoS 2 samples was proceeded in pure water under 300 W Xenon light irradiation.A control experiment in Argon bubbling reaction vessel indicates that there are no organic substances before and after light irradiation.A blank experiment shows that no hydrogenated product detected in the absence of the catalyst or under dark in CO 2 saturated reaction solution.The main product of CO 2 reduction on the as-prepared pure MoS 2 and Au-MoS 2 samples under light irradiation is CH 4 , while a small amount of HCOOH (Fig. S8) and CO were also detected by Ion Chromatography and Gas Chromatography, respectively.Generally, H 2 evolution is compete with CO 2 reduction because of its more favourable reaction kinetics.31 This phenomenon appears in photocatalytic CO 2 reduction on pure MoS 2 catalyst.As shown in Fig. 2a, the H 2 , CH 4 and CO yields increase almost linearly along with the irradiation time.The total amounts of H 2 , CH 4 and CO obtained on the pure MoS 2 within 6 h were 65.4, 46.3, 16.4 mol/g, respectively.Based on this, the selectivity of the photogenerated electrons for H 2 , CH 4 and CO generation is 24.5, 69.4 and 6.2 , respectively (Fig. 2d).Under the same conditions, Au-MoS 2 catalyst boosts the CH 4 productivity and suppresses the H 2 and CO evolution.As shown in Fig. 2b, H 2 , CH 4 and CO generated from Au-MoS 2 catalyst within 6 h is 92.2, 116.3 and 22.4 mol/g, respectively, corresponding to a selectivity of 15.9, 80.2 and 3.8 .Considering the eight-electron transfer process for CH 4 production, the improved CH 4 productivity and selectivity on Au-MoS 2 catalyst may be ascribed to the increased electron accumulation on Au-MoS 2 surface. Fig. 3a shows the schematic band energy alignment in the interface of Au-MoS 2 catalyst.An upward band bending exists at the Au-MoS 2 interface because of the larger work function of Au ( Au -5.1 eV from the vacuum energy level), preventing the electron transfer from MoS 2 to Au.On the contrary, hot plasmonic electrons in Au nanoparticles could inject into the MoS 2 nanosheet under light irradiation based on their band alignment, which increases the electron accumulation on MoS 2 nanosheets.The performance of CO 2 reduction over Ag-MoS 2 sample provides further evidence on the relationship between electron accumulation and CO 2 reduction selectivity.Upon analysis on the work functions of Ag (-4.26 eV), Ag 2 S (-4.42 eV) and MoS 2 (-4.7 eV), a schematic band structure in the interface of Ag-MoS 2 sample is plotted in Fig. 3b, which illustrates the electron transfer from conduction band of MoS 2 to Ag 2 S and Ag nanoparticles under light irradiation.This electron transfer pathway decreases the electron accumulation on MoS 2 nanosheets, and Ag nanoparticles provide the reactive sites for CO 2 reduction.Under this situation, only H 2 and CO were generated from CO 2 reduction with a productivity of 9.4 and 448 mol/g, respectively (Fig. 2c).The selectivity of the photogenerated electrons for CO production from Ag-MoS 2 catalyst is as high as 98 (Fig. 2d). To confirm that CH 4 and CO products are indeed formed by CO 2 reduction rather than organic contaminants, we performed an isotopic experiment with 13 CO 2 as the initial reactant under the same photocatalytic reaction condition.The resultant photocatalytic products were detected by a gas chromatography-mass (GC-MS) spectrometry.In the mass spectrum extracted from GC-MS analysis (inset of Fig. 2b) by using Au-MoS 2 catalyst, the detected molecular ion peak with an m/z value of 17 is attributed to 13 CH 4 .Correspondingly, a molecular ion peak with an m/z value of 29 is observed in the mass spectrum by using Ag-MoS 2 catalyst (inset of Fig. 2c).These studies clearly indicate a real photocatalytic CO 2 reduction process on these MoS 2 catalysts. Our further photoelectrochemical measurements on the as-prepared MoS 2 samples revealed the origin of the highly selective CO 2 reduction performance over the Au-MoS 2 and Ag-MoS 2 systems.Fig. 4a shows the electrochemical impedance spectrum (EIS) of the ultrathin pure MoS 2 electrode under dark and light irradiation.It can be seen that the conductivity of the MoS 2 electrode is decreased under light irradiation compared with that under dark condition, indicating a negative photoconductivity.The abnormal negative photoconductivity of ultrathin MoS 2 is caused by strong many-body interactions in ultrathin 2D system, where photoexcited electron-hole pairs can capture additional free electrons to form charged excitons (more than two electrons coupled with one hole).32 With the increased effective mass, these charged excitons substantially diminish the conductivity and induce the negative photoconductivity.The negative photoconductivity is increased in the Au-MoS 2 sample (Fig. 4b) due to plasmonic hot electron transfer from Au nanoparticle to MoS 2 under light irradiation.The negative photoconductivity is completely vanished in Ag-MoS 2 sample (Fig. 4c) because of the electron transfer from MoS 2 to Ag nanoparticles (Fig. 3b). Mott -Schottky spectra are usually used for the analysis of the flat band potential (E fb ) or Fermi level of semiconductor electrodes.33 The positive slope of the Mott -Schottky plots of different MoS 2 samples in Fig. 4d indicates that all of these MoS 2 samples are n-type semiconductor.The E fb values calculated from the intercept of the axis with potential value are -0.24V, -0.46 V and -0.05 V vs. NHE for the pure MoS 2 , Ag-MoS 2 and Au-MoS 2 samples, respectively.For many n-type semiconductors, E fb is considered to be about 0.1 V below the conduction band (E cb ).Based on this, the estimated E cb values of the pure MoS 2 , Ag-MoS 2 and Au-MoS 2 samples are -0.34V, -0.56 V and -0.15 V vs. NHE, respectively at pH 7. It is obvious that loading Au nanoparticles lowers down the conduction band edge of MoS 2 nanosheets and loading Ag nanoparticle upper shifts that, which is consistent with the theoretical analysis on energy band alignment (Fig. 3).Mott -Schottky spectra under light irradiation were also conducted to study the electron transfer in the interface of Au-MoS 2 and Ag-MoS 2 samples during photocatalytic process.As shown in Fig. 4e, both of the E fb values of Au-MoS 2 and Ag-MoS 2 samples are shifted around -0.43 V vs. NHE under light irradiation, corresponding to an E cb value of -0.53 V vs. NHE at pH 7. The apparent upper shift of E fb from -0.15 V to -0.53 V in Au-MoS 2 sample is ascribed to the plasmonic hot electron transfer from Au nanoparticle to MoS 2 nanosheet under light irradiation.Vice versa, electron transfer from MoS 2 to Ag nanoparticle leads to the slightly positive shift of E fb from -0.56 V to -0.53 V in Ag-MoS 2 sample under light irradiation.Thermodynamically, CO 2 reduction to CH 4 can be realized on all three MoS 2 samples because their E cb values are much higher than the redox potential of CO 2 /CH 4 (-0.24V vs. NHE at pH 7) under light irradiation.However, only CO product is observed on Ag-MoS 2 catalyst because of the absence of accumulated electrons for multi-electron reduction of CO 2 to CH 4 .Considering that water provides hydrogen atoms for photocatalytic CO 2 hydrogenation, we investigate water reduction kinetics by electrochemical measurements.Fig. 4f shows linear-sweep voltammetric curves (LSVs) which were recorded in dark using 0.1 M aqueous Na 2 SO 4 as electrolyte.The over potentials required to drive cathodic current density of 0.1 mA/cm 2 are 648, 386 and 181 mV for the pure MoS 2 , Ag-MoS 2 and Au-MoS 2 samples, respectively.Additionally, the Au-MoS 2 sample exhibits a Tafel slope value of 130 mV decade -1 , which is much smaller than that of the pure MoS 2 and Ag-MoS 2 sample (Fig. S9), implying the favorable H 2 evolution reaction kinetics in Au-MoS 2 catalyst.With regard to the H 2 evolution reaction, a generally accepted reaction pathway is that a proton first receives an electron to form the reduced proton, and then two such reduced protons meet on the surface to generate hydrogen molecule.34 In a photocatalytic CO 2 reduction process, besides H 2 evolution, these reduced protons react with activated CO 2 intermediates and form hydrocarbon products.Generally, improved H reduction kinetics would preferentially increase the productivity of H 2 .However, this phenomenon is different in the Au-MoS 2 sample in which large amount of charged excitons accelerate multi-electron reduction of CO 2 , which preferentially increases the selectivity for CH 4 production. In order to investigate the reaction pathway of CO 2 reduction on different MoS 2 samples, in-situ diffuse reflectance infrared Fourier transform spectroscopy (DRIFT) measurements were performed.Before introducing CO 2 , we analyze the DRIFT spectrum in vacuum under dark (Fig. 5a).Surfaces of the as-prepared Au-MoS 2 , Ag-MoS 2 and pure MoS 2 samples were dominated by strongly adsorbed H 2 O and CO 2 even in the ) species.35 The distinct absorption bands around 1456 cm -1 and 1658 cm -1 are attributed to the symmetric and asymmetric OCO stretching vibration of chemisorbed carboxylate species ( COO -).36 It has been reported hydrothermally synthesized MoS 2 has negative surface charge above pH 3. 37 The functional group COO -indicates that an electron could be spontaneously transferred to CO 2 from the negative surface even in the dark.Generation of COO -species is generally considered as the critical 38 Besides, C-H stretching vibration from surface S-CH group around 2850 and 2917 cm -1 was also found on the catalyst surface, 39 which may come from surface organic contaminant during the sample preparation. In situ DRIFT spectra of CO 2 with H 2 O during photo-irradiation were further recorded for studying the CO 2 adsorption and activation process.The DRIFT absorption spectra were obtained by subtracting the catalyst background in vacuum.From the in situ DRIFT spectrum, a possible reaction pathway for CH 4 generation on pure MoS 2 and Au-MoS 2 can be proposed as following: CO 2 COO--COOH-HCO-HCOH--CH 2 OH -CH 3 CH 4 via a hydrogenation process.For CO generation on Ag-MoS 2 catalyst, it is probably via CO 2 COO--COOHHCOOHCO.This different reaction pathway is also supported by the higher concentration of HCOOH intermediate in Ag-MoS 2 reaction solution from ion chromatography (Fig. S8). To further illustrate the reaction mechanism of CO 2 reduction on different MoS 2 surface, we performed density functional theory (DFT) simulations on the key reaction step of -COOH formation.First of all, the adsorption configuration of one CO 2 and one H 2 O molecule on Sedge of the pure MoS 2 slab is optimized without any symmetry constraint.The energetically stable configuration is shown in Fig. 6a as the initial state, from which the SeC and SeO bond distances is calculated about 3.234 A and 3.057 A, respectively.Afterwards, the first proton-electron transfer in the CO 2 reduction pathway CO 2 H 2 O COOH OH was simulated on the MoS 2 surface.The reaction barrier was calculated by searching the transition state of this reaction, which is found to be 2.17 eV on pure MoS 2 surface.In the transition state, H-O bond in H 2 O molecule stretched from 0.974 A to 1.428 A (Fig. 6a).For the final state, OH and COOH groups are chemically bonded to the surface S atoms with the SeC and SeO bond distances of 1.828 A and 1.669 A, respectively. To illustrate how the Au and Ag atoms influence the reaction barrier of the -COOH formation step, we loaded two Au and Ag atoms on top of the MoS 2 surface, respectively.For the Au-MoS 2 sample, it was found that the reaction barrier to form COOH intermediate decreases from 2.17 eV to 1.82 eV (Fig. 6b), suggesting a faster CO 2 reduction process on Au-MoS 2 surface, which is consistent with our experimental observation.However, for Ag-MoS 2 sample, this reaction barrier is significantly increased from 2.17 eV to 4.28 eV.As shown in Fig. S10, once the CO 2 molecules adsorbed on the Ag-MoS 2 surface, a strong interaction between Ag atom and CO 2 molecules is formed, making a very high reaction barrier of CO 2 with H 2 O to form the -COOH intermediate.Therefore, CO 2 reduction on Ag-MoS 2 surface mainly proceeded on Ag nanoparticles, which resulted in a different reaction pathway and CO is the main product. To further explain why Au-MoS 2 can decrease the reaction barrier of -COOH formation, we performed the projected crystal orbital Hamilton population (pCOHP) analysis 40 on the SeC bond in the reactant structures for both pure MoS 2 and Au-MoS 2 sample (Fig. S11).The COHP analysis is a technique to analyze chemical bonding in solid state systems in which the band structure energy is partitioned as a sum of orbital-pair contributions.The bonding, nonbonding, and antibonding energy regions are displayed in the COHP diagram within a specific energy range.To apply the COHP in plane wave based quantum mechanics (QM) simulations, the project COHP (pCOHP) technique was used to transfer plane wave to localized functions.Then the pCOHP could be integrated (IpCOHP) up to the highest occupied energy band (Fermi energy) to determine the bond strength.The larger IpCOHP indicates a stronger bond strength. Fig. 11a displays the pCOHP analyses of SeC bond for both Au-MoS 2 and MoS 2 systems.For the bonding state below Fermi level, the Au-MoS 2 system shows larger contribution than the MoS 2 system.Therefore, the IpCOHP of C-S bond in the Au-MoS 2 system is larger than that in MoS2 system at Fermi level, as shown in Fig. 11b.This indicated that the CO 2 molecule is slightly stronger absorbed on the Au-MoS 2 surface than pure MoS 2 , which can decrease the CO 2 reduction reaction barrier and enhance the reaction rate.This calculation result is also consistent with the mode, thus resulting in high catalytic activity and selectivity for CH 4 evolution by multi-electron reduction process."
  },
  {
    "title": "Conclusions",
    "content": "Au nanoparticles decorated ultrathin MoS 2 nanosheet was demonstrated to be an excellent heterogeneous catalyst for photocatalytic CO 2 reduction to methane under simulated solar light irradiation.The productivity of methane is up to 19.38 molg -1 h -1 using pure water as the reducing agent, with a high selectivity of 80.2 over competing CO and H 2 generation.After systemically experimental studies and quantum mechanics simulations, we find that plasmon-excited hot electrons transfer from Au nanoparticles to the charged excitons on ultrathin MoS 2 can efficiently improve electron accumulation on MoS 2 surface, leading to a decreased kinetic barrier for multi-electron reduction of CO 2 .This study accounts for the first discovery of electron accumulation in heterogeneous catalyst for promoting multi-electron reduction kinetics of CO 2 .It not only puts forward a new strategy for developing high-performance and selective CO 2 reduction photocatalyst through surface electron behaviour control, but also gives deep insight into understanding the key factors to improve CO 2 hydrogenation performance including but not limited to other catalytic process such as in thermal or electro-catalysis. revealed the crystallinity of the Au nanoparticles and ultrathin nanostructure of MoS 2 .Ag nanoparticles on MoS 2 nanosheets are indistinct in low magnified TEM image (inset of Fig. 1d), because of the proximate atomic number of Mo and Ag.However, Ag nanoparticles can be distinguished from HRTEM image.As shown in Fig. 1d, crystal lattices of Ag (111), (110) and (200) surfaces are clearly observed, indicating that Ag nanoparticles have a polycrystalline structure.All of the MoS 2 samples exhibit a strongly disordered structure from wider range HRTEM images (Figs.S4-6) in the basal plane, even short-range ordered nano-domains could not be clearly observed.These disordered structures can increase the number of unsaturated S atoms and even S vacancies as active sites for catalytic reaction.25 The Mo/S molar ratios of pure MoS 2 , Au-MoS 2 and Au-MoS 2 samples are 1:1.92,1: 1.86, 1: 1.81 from ICP-AES, indicating the existence of S vacancies.Fig.1eshows the XPS spectrum of Mo. two characteristic peaks arising from Mo 3d 5/2 and Mo 3d 3/2 orbitals are observed Fig. 1.Characterization for different MoS 2 samples.a. High magnified TEM image of the Au-MoS 2 sample.Inset of a: the low-magnification TEM image of the Au-MoS 2 sample.b. the HRTEM image of the Au-MoS 2 sample on the edge.c. the HRTEM image of the Au-MoS 2 on the surface.d. the HRTEM image of Ag-MoS 2 sample.Inset of d: the low-magnification TEM image of Ag-MoS 2 sample.e. Mo 3d XPS spectra of the different MoS 2 samples.f. S 2p XPS spectra of the different MoS 2 samples.g.Au 4f XPS spectra of Au-MoS 2 sample.h.Ag 3d XPS spectra of Ag-MoS 2 sample.i. Ultraviolet-visible-near infrared absorption spectra of the different MoS 2 samples. Fig. 2. The photocatalytic CO 2 reduction performances of different MoS 2 samples.a, b, c.Time course of CH 4 , CO, H 2 evolutions on (a) pure MoS 2 , (b) Au-MoS 2 and (c) Ag-MoS 2 samples.Inset of b: Mass spectra extracted from GC-MS analysis of CH 4 product from 13 CO 2 reduction on Au-MoS 2 sample.Inset of c: Mass spectra extracted from GC-MS analysis of CO product from 13 CO 2 reduction on Ag-MoS 2 sample.d.Comparison of selectivity of photo-generated electrons for CH 4 , CO and H 2 evolution on different MoS 2 samples. Fig. 3. Schematic band energy alignment in the interface of Au-MoS 2 (a) and Ag-MoS 2 (b). Fig. 4. The photo-electrochemical performances of different MoS 2 samples in 0.1 M Na 2 SO 4 .a. Impedance spectroscopy plots of pure MoS 2 under dark and light irradiation.b.Impedance spectroscopy plots of Au-MoS 2 under dark and light irradiation.c.Impedance spectroscopy plots of Ag-MoS 2 under dark and light irradiation.d.Mott-Schottky plots of different MoS 2 samples under dark.e. Mott-Schottky plots of different MoS 2 samples under light.f.Anodic current-potential scans of different MoS 2 under dark. Fig. 5b shows the DRIFT change of pure MoS 2 sample under light irradiation after introducing CO 2 and water gas.In situ light irradiation of the pure MoS 2 sample resulted in the obvious negative absorption of (COO -) (1460 cm -1 , 1650 cm -1 ), (SeH) (2510 cm -1 ), (C-H) in S-CH 3 (2846, 2921 cm -1 ) and (OeH) (3360 cm -1 ), indicating the decreased concentration of these functional groups under light irradiation.Meanwhile, four positive absorption bands around 1173, 1272, 1558 and 1750 cm -1 appear.The absorption bands around 1272 and 1750 cm -1 are most probably assigned to the CeO and CO stretching bands of the new formed -COOH intermediate from surface carboxylate (COO -) hydrogenation.The absorption band around 1173 cm -1 is attributed to the CeO stretching band of new formed -HC-OH from further hydrogenation of -COOH intermediate.The other absorption band around 1558 cm -1 is assigned to the increased b-CO 3 2-or m-CO 3 2-species which are hardly to be further hydrogenated under this condition.From the above analysis, the in situ DRIFT study suggests a reaction between the surface carboxylate species (COO -) and hydroxyl to produce the -COOH intermediates, which are further hydrogenated into HCOH intermediate under light irradiation.Besides the CO 2 hydrogenation reaction, it is worth to note that the vibration bands from surface SeH and S-CH 3 group are gradually vanished under light irradiation, indicating an accompany photocatalytic oxidation reactions.Compared with the pure sample, the Au-MoS 2 sample exhibits a kinetically faster hydrogenation process.As shown in Fig. 5c, the -COOH, -HCOH, -CH 2 OH, -CH 3 intermediate from COO -hydrogenation appear almost at the same time under light irradiation, indicating a faster simultaneous multi-electron reduction process.In addition, the peaks assigned to the stretching vibrations of CO and CeO for -COOH intermediate on Au-MoS 2 sample are shifted to lower wave numbers relative to those on pure MoS 2 sample.The red shift indicates that the adsorption of -COOH on Au-MoS 2 was stronger than that on pure MoS 2 due to the accumulation of negative charges, which facilitates further hydrogenation of this intermediate.Fig. 5d shows in situ DRIFT spectrum of Ag-MoS 2 sample for CO 2 reduction.Without Fig. 5. CO 2 adsorption and activation on different MoS 2 samples revealed by in-situ DRIFT observation.a. DRIFT spectra of different MoS 2 sample under vacuum in the dark.b, c, d. in situ DRIFT spectra recorded after ambient temperature adsorption of CO 2 /H 2 O on pure MoS 2 (b), Au-MoS 2 (c) and Ag-MoS 2 (d) under 300 W Xe arc lamp irradiation. Fig. 6.The reaction energy and path for CO 2 H 2 O COOH OH on MoS 2 surface (a) and Au-doped MoS 2 surface (b).The initial, transition and final states are presented.The Mo, S, Au, C, O, H are represented by blue, yellow, gold, black, red and green balls, respectively.(For interpretation of the references to colour in this figure legend, the reader is referred to the web version of this article). This work received financial support from National Natural Science Foundation of China (No. 21671197), the World Premier International Research Center Initiative (WPI Initiative) on Carbon-Neutral Energy Research (I 2 CNER), MEXT (Japan) and Technology Commission and Grant-in-Aid for Specially Promoted Research (No.16H06293) from MEXT (Japan). The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary material related to this article can be found, in the online version, at doi:https://doi.org/10.1016/j.apcatb.2020.118931."
  }
]