[
  {
    "title": "Doi",
    "content": "10.1007/s10971-020-05260-9"
  },
  {
    "title": "Article_Title",
    "content": "Preparation of Fe3+-doped TiO2 aerogels for photocatalytic reduction of CO2 to methanol"
  },
  {
    "title": "Abstract",
    "content": "Developing an efficient photocatalyst to reduce CO 2 to methanol is still a major challenge.In this paper, the Fe 3 -doped TiO 2 aerogels were prepared by sol-gel process.Implantation of Fe 3 into TiO 2 lattice can not only narrow the band gap of electron transfer, but also suppress the recombination of photogenerated electron-hole pairs.However, when the doping content of Fe 3 was increased to 5 mol , partial Fe 3 ions may enter into the lattice gap and decrease the stability of the excited electrons.The UV-Vis diffuse reflectance spectra, photoluminescence (PL) spectra, and UV-excited photoelectron spectroscopy (UPS) were used to study the effect of the Fe 3 doping amount on the photoelectric properties of the aerogels.The photocatalytic conversion of CO 2 to methanol was used to evaluate their catalytic performances upon illumination by a 300 W Xe lamp."
  },
  {
    "title": "Experimental",
    "content": "The experimental reagents include tetrabutyl titanate (TBOT, AR, Macklin), Fe(NO 3 ) 3 9H 2 O (98.5, GuangZhou Chemical Company), glacial acetic acid (99.5,GuangZhou Chemical Company), formamide (99.5, Sinopharm Chemical Regent Company), tetraethoxysilane (TEOS, 98, Macklin), ethanol (99.7, XiLong Chemical Company), ethylenediamine (EDA) (AR, Macklin), and CO 2 (99.999,JiaTeng Chemical Gases Company).All chemicals were used without any further purification. The Fe 3 -doped TiO 2 aerogels were prepared by sol-gel process 202122.First, 20 g of TBOT, 50 mL of ethanol, and 2 mL of glacial acetic acid were mixed to obtain a homogeneous solution under vigorous stirring.Then, a mixture containing 1 mL of deionized water, 50 mL of ethanol, 2.2 mL of glacial acetic acid, and a calculated amount of ferric nitrate was slowly added and kept stirring at 50 C for 2 h.Subsequently, 1.9 mL of formamide was added to the solution.The resulted gel was aged at 50 C for 48 h to form solid gel.The solid gel was soaked with 80 mL of EtOH/H 2 O solution (V/V 1) for 24 h.Then, the liquid was poured out, and the solid gel was sequentially soaked with 80 mL of TEOS/EtOH (V/V 1) and 80 mL of EtOH in the same way.After that, the solid gel and 70 mL of fresh EtOH was placed in a high-pressure reactor.Temperature programmed to 220 at 3 C/min for 1.5 h, and followed by slow deflation.After cooling down, the sample was taken out and calcined at 450 C in air for 10 h.Four catalysts were prepared with deferent doping amounts of Fe 3 in the aerogels.They are denoted as TiO 2 , 1Fe-TiO 2 , 3Fe-TiO 2 , and 5Fe-TiO 2 , corresponding to 0, 1, 3, and 5 mol of Fe 3 in the aerogels, respectively. N 2 adsorption-desorption analysis was performed on a Beckman Coulter SA-3100 (Beckman Coulter) at 77 K.The samples were degassed at 423 K and 10 -6 Torr.The Brunauer-Emmett-Taller (BET)-specific surface area was calculated using the adsorption branch of the isotherms.The pore size distributions were determined by the Barret-Joyner-Halenda (BJH) method applying the desorption branch.The microporosity was assessed from t-plot construction using the Harkins-Jura correlation.The morphology of all samples was analyzed by scanning electron microscopy (SEM, TESCAN Company, MIRA3LMH/ LMU) equipped with EDS to map the elements.Transmission electron microscopy (TEM) images of the samples were taken by a transmission electron microscope (JEOL, JEM-2100F, 200 kV).Fourier transform infrared spectrophotometer (FTIR, Thermo Fisher, Nicolet 6700) was used to analyze the functional groups in the aerogels.The crystallographic structure of samples were determined by X-ray diffraction (XRD, Rigaku Company, MiniFlex II) with Cu K radiation, and the scanning angle was 2 10 -80.UV-Vis spectra of the samples were recorded in the range of 200-800 nm, using UV-Vis diffuse reflectance (UV-Vis, PE Company, Lambda 65 s).Excitation and emission spectra of the samples were recorded by photoluminescence spectrophotometer (PL, HITACHI, F-4600) using a Xe lamp as excitation source operating at 280 nm.UV-excited photoelectron spectroscopy (UPS) of the aerogels was obtained by a Thermo ESCALAB 250XI (Thermo Fisher).He I (21.2 eV) was used as a monochromatic source with an energy resolution of 100 meV. The photocatalytic conversion of CO 2 to methanol was evaluated over the Fe 3 -doped TiO 2 aerogels using a 300 W power-tunable Xe lamp as light source.The photocatalytic reaction was carried out in a cylindrical quartz glass reactor (300 mL in volume and 55 mm in diameter) equipped with a magnetic stirrer.The out layer of the reactor is a jacket of flowing water to remove the irradiated heat.In all experiments, 0.1 g of catalyst powder was dispersed in 150 mL of 0.2 M EDA aqueous solution.The suspension was purged with CO 2 for 30 min prior to irradiation.Then, CO 2 was continually flowed through the reactor at a rate of 20 mL/ min.In each sampling, 2 mL of liquid sample was collected from the reactor by a syringe with a Teflon filter to remove solid particles.The concentration of methanol was quantitatively analyzed by gas chromatography.The sample was analyzed using PERSEE G5 gas chromatograph equipped with a flame ionization detector and KB-wax capillary column (30 m, 0.53 mm, and 1.00 m).The concentrations of methanol were determined using standard calibration curve of peak area versus concentration (Figs.S1 andS2).Each sample was measured three times, and their mean values were reported as the final data.The methanol yield 23 was calculated based on the below equation: where Y CH 3 OH (mol/g) is the methanol yield, C CH 3 OH (mol/mL) is the concentration of methanol, and V reactant (mL) and M catalyst (g) are the volume of the EDA aqueous solution and the mass of catalysts, respectively."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Textural properties of TiO 2 and Fe-TiO 2 aerogels were determined by N 2 physical adsorption-desorption method. Figure 1 shows the N 2 physisorption isotherms and BJH pore size distributions.The isotherms were of type IV with a hysteresis of type H1, indicating a typical mesoporous structure.Their BET surface area, pore volume, and average pore size are presented in Table 1.The TiO 2 had a pore size of 10 nm.After the doping of iron, it can be seen that the samples had two pore size ranges.In addition to the pore size of 10 nm, a new pore size of 20 nm appeared.The 3Fe-TiO 2 aerogel had the largest pore volume and average pore diameter.For all aerogels, they exhibited disordered mesoporous structure as illustrated by TEM images shown in Fig. 2. The corresponding EDS elemental mapping FT-IR spectra of the aerogels are shown in Fig. 3a.The band at 3383 cm -1 is assigned to the stretching vibration of hydroxyl group, and the band at 1635 cm -1 corresponds to the bending vibration of H-O-H 24.The hydrophylic aerogels could favor the photocatalytic performance 25,26.The bands centered at 457 and 1057 cm -1 are assigned to the stretching vibrations of Ti-O-Ti and Si-O-Si, respectively 27,28.The absorption peak at 945 cm -1 corresponds to the Ti-O-Si stretching vibration 29.In the IR spectra of the Fe-TiO 2 aerogels, the band at 2356 cm -1 is related to the stretching vibration of Fe-O-Ti 30, and the relative intensity of the band increases with the doping amount of Fe in the aerogels.The XRD patterns in Fig. 3b reveals that all aerogels matched the anatase phase with characteristic peaks at 2 25.3,38.1, 48.1, 53.9, 55.1, and 62.8.These peaks can be assigned to (101), (004), ( 200), ( 105), (211), and (204) lattice planes, respectively 31,32. Implantation of Fe 3 into the TiO estimated to be 3.26, 3.04, 2.71, and 2.63 eV for TiO 2 , 1Fe-TiO 2 , 3Fe-TiO 2 , and 5Fe-TiO 2 , respectively (as seen in the inset of Fig. 4a).Although the band gap was narrowed in the visible region with the doping amounts of Fe 3 , the stability of the excited electrons and holes is also crucial for the photocatalytic performance.The PL spectra in Fig. 4b suggest the recombination behavior of the excited electrons.When the doping amount was lower than 3 mol , the PL signal decreased as compared with the TiO 2 aerogels, indicating a slower recombination rate of the excited electrons 18,33.However, the PL intensity increased as the doping amount reached 5 mol .There are two ways for Fe 3 to present into TiO 2 crystal, substitution of Ti in lattice or presence in lattice gap.When Fe 3 locates in the lattice of TiO 2 , Fe 3 behaves as an electron donor to provide one electron for the catalyst. When the doping content of Fe 3 was 5 mol , partial Fe 3 ions entered into the lattice gap and played the role of acceptor impurity, thus leading to a relatively faster recombination rate of the excited electrons. To explore the ability of the Fe-TiO 2 aerogels to photochemically reduce CO 2 , mechanism insights into the photocatalytic reduction was studied on the basis of energetic grounds.Band alignments were derived from the results of their UPS (Fig. 5).The excitation energy of He I UPS is 21.2 eV.E cutoff and E fermi can be obtained from Fig. 5a.Thus, the VB positions (vs.vaccum) may be calculated according to E excitation energy E cutoff -E fermi 34.The VB (vs.vaccum) of 1Fe-TiO 2 , 3Fe-TiO 2 , and 5Fe-TiO 2 are 7.29, 6.96, and 6.5 eV, respectively.The corresponding CB positions (vs.vaccum) may be calculated according to E g E VB -E CB .They are 4.25, 4.25, and 3.87 eV, respectively.The standard hydrogen electrode potential is 0 V.The VB and CB energy levels (vs.RHE) may be calculated according to E (vs.RHE) E (vs.vaccum) 4.44 eV 35,36.Therefore, the E VB (vs.RHE) of 1Fe-TiO 2 , 3Fe-TiO 2 , and 5Fe-TiO 2 are 2.85, 2.52, and 2.06 eV, respectively.Correspondingly, the E CB (vs.RHE) of 1Fe-TiO 2 , 3Fe-TiO 2 , and 5Fe-TiO 2 are -0.19,-0.19, and -0.57eV, respectively. The CB edge positions of all doped aerogels were above the hydrogen reduction potential.Thermodynamically, it allows the excited electrons to combine with H to produce H.It is also found that the doping narrowed the band gap and obviously increased the VB edge, but they are still below the water oxidation potential.Therefore, the Fe-TiO 2 aerogels can photocatalize reduction of CO 2 in water to aerogel exhibited an enhanced catalytic performance, which was contributable to high porosity of the aerogel materials.Furthermore, the methanol yield was greatly enhanced over 1Fe-TiO 2 and 3Fe-TiO 2 aerogels due to the prolonged lifetime of the excited electrons and the enhanced absorption of the visible light under visible light irradiation.Although the 5Fe-TiO 2 aerogel had the narrowest band gap, the corresponding catalytic performance was lower than that for the 3Fe-TiO 2 aerogel.As suggested from PL spectra, it may ascribe to ineffective separation of photo-induced electron-hole pairs."
  },
  {
    "title": "Conclusions",
    "content": "Fe 3 -doped TiO 2 aerogels were successfully prepared.The doped aerogels had a narrowed band gaps in comparison with pure TiO 2 aerogel.The corresponding band alignments indicated that they may photocatalytic reduce CO 2 to methanol.Incorporation of Fe 3 into the TiO 2 can promote the photogenerated electron-hole separation at low doping concentration.However, the stability of photogenerated electrons decreased as the doping amount was over 3 mol .Therefore, the doping amount of Fe 3 has an optimal value between the band gap and stability of the photogenerated electrons. Fig. 1 N 2 adsorption-desorption isotherms of the aerogels.Inset the pore size distribution Fig. 2 TEM, SEM, and elemental mapping images of the Fe 3 -doped TiO 2 aerogels.a 1Fe-TiO 2 .b 3Fe-TiO 2 .c 5Fe-TiO 2 Fig. 3 a FT-IR spectra.b XRD patterns of the aerogels Fig. 5 a UPS of the Fe 3 -doped TiO 2 aerogels.b Band alignments derived from a Textual properties of the aerogels images of the Fe-TiO 2 aerogels show that Fe species uniformly dispersed into TiO 2 . Acknowledgements This work was financially supported by special funds for guiding local scientific and technological development by China government (ZY2019HN0904), Key Scientific Technological Project of Hainan Province (ZDKJ2017011), National Key Research and Development Program of China (2016YFC0700804), and National Natural Science Foundation of China (51562008 and 51761010). Compliance with ethical standards The authors declare that they have no conflict of interest. Publisher's note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations."
  }
]