[
  {
    "title": "Doi",
    "content": "10.1016/j.materresbull.2020.111177"
  },
  {
    "title": "Article_Title",
    "content": "In-situ growth of ultrafine ZnO on g-C3N4 layer for highly active and selective CO2 photoreduction to CH4 under visible light"
  },
  {
    "title": "Abstract",
    "content": "Photocatalytic CO 2 reduction to solar fuels is considered as a promising strategy to address the global warming and energy shortages.Herein, a novel method is proposed to prepare g-C 3 N 4 /ZnO nanocomposites via refluxing zinc salt methanol solution containing pre-formed g-C 3 N 4 with KOH methanol solution as precipitating agent.Some in-situ grown ultrafine ZnO nanoparticles are decorated on ultrathin g-C 3 N 4 layers with well-defined interface, which not only causes efficient charge transfer and separation, but also creates more active sites for CO 2 adsorption and activation.The resultant g-C 3 N 4 /ZnO composites demonstrate significant enhanced CO 2 photoreduction activity and selectivity for CH 4 production under visible light irradiation, and the optimal g-C 3 N 4 /ZnO composite delivers the best overall photoactivity (158.4 mol g -1 h -1 ) with CH 4 /CO production rates of 19.8/0.37 mol g -1 h -1 , which is 9.42 times higher than that of g-C 3 N 4 alone.This work provides an ideal synthetic strategy for g-C 3 N 4 -based hybrid materials with highly efficient CO 2 photoreduction."
  },
  {
    "title": "Experimental",
    "content": "g-C 3 N 4 was prepared via a heat treatment process of urea similar to the previous report 26.Typically, urea (5.0 g) was put into a covered crucible and heated at 550 C for 3 h at a heating rate of 5 C min -1 .After cooling to room temperature, g-C 3 N 4 was attained by washing with HNO 3 solution (1.0 M) and distilled water, and then drying at 70 C overnight. g-C 3 N 4 /ZnO composites were fabricated using a refluxing method.Typically, ZnAc 2 2H 2 O (1.10 g) and an appropriate amount of g-C 3 N 4 were added to methanol (50 mL), then stirred and refluxed in a 65 C water bath.Under refluxing and stirring, KOH methanol solution (0.40 M, 25 mL) was dropwise added through a pressure-equalized addition funnel.After that, the mixture was refluxed and stirred for 2.5 h and then cooled to room temperature.The precipitate was centrifuged, washed with water several times, and then dried at 70 C to obtain the g-C 3 N 4 /ZnO nanocomposites.Through this method, various composites with different addition amounts of g-C 3 N 4 were obtained, and the resultant products are labeled as CZ-x, in which x is the g-C 3 N 4 addition amount.For instance, g-C 3 N 4 addition amount is 40 mg, the corresponding product is labelled as CZ-40.The higher x value, the lower the ZnO content in CZ-x composites. For comparison, the single ZnO nanoparticles were also prepared using the refluxing method without addition of g-C 3 N 4 .Also, g-C 3 N 4 / ZnO composite was prepared via a similar refluxing process of the CZ-40 composite, that is, ZnAc 2 2H 2 O (1.10 g) and g-C 3 N 4 (40 mg) were added to water (50 mL), then stirred and refluxed in a 100 C oil bath.Under refluxing and stirring, KOH aqueous solution (0.40 M, 25 mL) was dropwise added through the pressure-equalized addition funnel.After that, the mixture was refluxed and stirred for 2.5 h and then cooled to room temperature.The precipitate was centrifuged, washed with water several times, and then dried at 70 C to obtain the product that is denoted as CZ-40-aq.Physical mixture (denoted as CZ-40-mix) of ZnO nanoparticles and g-C 3 N 4 with the same theoretical addition amount was prepared by grinding the mixture in an agate mortar for 30 min. The crystal phases of samples were detected using a Miniflex 600 Xray diffractometer (XRD) operating at 40 kV and 15 mA with Cu K radiation ( 0.154 nm) and a scanning rate of 4 min -1 from 10-70 .Sample morphology was observed using a Verios field emission scanning electron microscope (FESEM), and the high-resolution transmission electron microscopic (HRTEM) images were attained on a JEOL LaB JEM-2100 (HR) electron microscope working at 200 kV.UV-vis diffuse reflectance absorption spectra (DRS) were determined using an Agilent Cary 5000 spectrophotometer equipped with an integrating sphere with BaSO 4 as the reference.X-ray photoelectron spectra (XPS) were obtained using a Thermo Fisher ESCALAB 250Xi X-ray photoelectron spectroscope equipped with a standard and monochromatic source (Al K, 1486.6 eV).Photoluminescence (PL) spectra were recorded using a Hitachi F-4600 fluorimeter.Liquid N 2 adsorption-desorption isotherms at 77 K were measured on a Micrometrics ASAP 2460 system after the sample was degassed at 120 C for 3 h. Transient photocurrent curves and electrochemical impedance spectra (EIS) were determined using a CHI Model 618C electrochemical analyzer with a standard three-electrode system, whereby Pt wire, Pt plate and saturated calomel electrode (SCE) are used as the work, counter and reference electrode, respectively.The work electrode was prepared by depositing Nafion suspension (200 L) containing photocatalyst (10 mg) on a fluorine-tin-oxide-coated glass (1.0 cm 2 ), then dried at 70 C for 1 h to volatilize the solvent and steady the film.During the measurement, the three electrodes were immersed into a Na 2 SO solution (0.5 M) containing methyl viologen (3.0 mg) as electron media, which was continuously purged by N 2 flow for 30 min before the illumination. Temperature-programmed desorption-mass spectrometry (TPD-MS) of CO 2 and H 2 O was conducted using a Micromeritics Autochem II-Cirrus 2 Chemisorption Analyzer.The photocatalyst was heated to C at a heating rate of 10 C min -1 in Ar atmosphere and maintained at this temperature for 2 h to remove the adsorbate.After cooling to 80 C, a wet 10 CO 2 /Ar mixed gas replaced the Ar flow for the CO 2 /H 2 O adsorption for 90 min.Excess CO 2 /H 2 O molecules were purged with Ar flow for 1 h.The flow rates of the above steps were set at 30 mL min -1 .After that, TCD detector started to record the signals until the temperature raised to 700 C, and the desorbed gas generated during the CO 2 -TPD process was installed to a quadruple mass spectrometer (MKS Instrument) operating in multiple-ion-monitoring (MIM) mode to record the mass signals of CO 2 (m/z 44) and H 2 O (m/z 18). The photocatalytic experiments were carried out in a closed glass reactor with a volume of 500 mL under the illumination of a 300 W Xelamp equipped with a cutoff filter ( 420 nm).Typically, photocatalyst (60 mg) was evenly dispersed on a watch glass with an area of 28 cm 2 , which was placed on a holder in the reactor, and then NaHCO 3 (1.60 g) was introduced into the bottom of the reactor.After the air was completely removed by vacuum treatment, H 2 SO 4 solution (40 , 5.0 mL) was injected with a syringe to generate CO 2 /H 2 O vapor.During the illumination process, 2.0 mL of gas was taken out periodically (1.0 h) and detected using gas chromatograph (SP-7820, TDX-01 column, Rainbow chemical instrument Co., Ltd) equipped with a flame ionized detector (FID) and methanator, the product contents are calibrated by an external standardization method using commercial standard gas mixture. In the CO 2 photoreduction system, CH 4 and CO are the main reduction products, no other products such as CH 3 OH, C 2 H 4 , C 2 H 6 (using GC-FID detector) and H 2 (using GC-TCD detector) were detected.The results of the control experiments demonstrated that no reduction products were generated in the photoreaction system without photocatalyst, light irradiation or CO 2 gas, indicating that the CH 4 /CO products are produced from the photoreaction on photocatalyst.Because the main reduction products need to consume different number of electrons, total consumed electron number (TCEN) is used to estimate the overall photocatalytic CO 2 reduction activity, and is calculated by formula (1) 8,9: where, V rea. is the reactor volume; m cat. is the photocatalyst amount; t irr. is the illumination time; c CO and c CH4 are the generated concentrations of CO and CH 4 , respectively.103) and (112) planes of hexagonal wurtzite ZnO (JCPDS No. 65-3411) 35,43, respectively.No other impurity peak is detected, implying the ZnO product has high crystal phase purity.The single g-C 3 N 4 displays an XRD peak at 2 27.4 , ascribable to the reflection of (002) plane 35,43.No characteristic peak belonging to g-C 3 N 4 is found in the CZ-x composites with low g-C 3 N 4 addition amount, suggesting that the ZnO nanoparticles might be decorated on the g-C 3 N 4 layers to prevent the long-range ordered stacking 43.Along with the increase of g-C 3 N content, the XRD peaks of wurtzite ZnO decrease gradually.When the g-C 3 N 4 addition amount is 60 mg, the corresponding composite (CZ-60) shows the (002) diffraction peak (at 2 27.4 ) of g-C 3 N 4 ."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The FESEM images indicate that the single g-C 3 N 4 shows a nanosheet-like morphology (Fig. S1a), while the single ZnO exhibits microsphere-like soft aggregation composed of ultrafine nanoparticles with sizes in the range of 5-10 nm (Fig. S1b).When low g-C 3 N 4 content (10 mg) is introduced into the reaction solution, the ZnO in the corresponding composite (CZ-10) turns into dispersed nanoparticles (Fig. S1c).Along with the increase of g-C 3 N 4 addition content, the relative composites (CZ-30 and CZ-40) display a morphology of ultrafine nanoparticles that are attached on the g-C 3 N 4 layers (Fig. S1d ande) with much thinner thickness than the single g-C 3 N 4 .Moreover, more ultrathin layered structures are found in the CZ-60 composite, and some ultrafine ZnO nanoparticles dispersed on the g-C 3 N 4 layers (Fig. S1f).However, the CZ-40-aq composite, derived from a similar refluxing process of the CZ-40 composite but with water and KOH aqueous solution instead of the methanol and KOH methanol solution, is composed of large and irregular hard aggregations of ZnO (Fig. S2).These results demonstrate that the present refluxing process in methanol solution instead of aqueous solution can effectively retard the formation of hard aggregation of ZnO, and higher g-C 3 N 4 content could promote the morphology transformation of ZnO into ultrafine nanoparticles, while the aggregations of the single g-C 3 N 4 can be dispersed into ultrathin layered structures, which will be further discussed below. The morphologies and crystal phases can be further confirmed by the TEM and HRTEM observation shown in Fig. 2. The single g-C 3 N 4 has sheet-like morphology (Fig. 2a andb), and the single ZnO is soft aggregation composed of ultrafine nanoparticles (Fig. 2c).Those nanoparticles show clear lattice fringes with d-spacing of 0.280 nm, well corresponding to the (100) planes of hexagonal ZnO (Fig. 2d), and the fast Fourier transform (FFT) pattern (inset in Fig. 2d) also indicates that those nanoparticles are hexagonal ZnO.TEM image (Fig. 2e) of CZ-40 composite demonstrates that the ZnO ultrafine nanoparticles can maintain their nanoparticle-like morphologies, and some ultrafine ZnO nanoparticles are decorated on the ultrathin g-C 3 N 4 layers with excellent interface contacts.Also, those nanoparticles display clear lattice fringes with d-spacing of 0.280 and 0.248 nm, ascribable to the interplanar spacing of (100) and (101) planes of hexagonal ZnO (Fig. 2f), and the FFT pattern (inset in Fig. 2f) also indicates that those nanoparticles are hexagonal ZnO.These results demonstrate that the added g-C 3 N 4 can be transformed into ultrathin layered structure during the in-situ growth of ZnO ultrafine nanoparticles, and some of them are dispersed on the g-C 3 N 4 ultrathin layers with close interface contact.This will facilitate the charge transfer in the photocatalytic process as discussed below. The close interface contacts among the ultrafine ZnO nanoparticles and ultrathin g-C 3 N 4 layers imply that there is interaction existed between the two components of g-C 3 N 4 /ZnO composite, which can be validated by the FTIR spectra (Fig. S3).As seen, the FTIR peak at 810 cm -1 of the single g-C 3 N 4 is related to the breathing mode of the striazine ring 44, and the peaks at 1200-1700 cm -1 are attributed to the stretching vibrations of C-N and C--N, respectively.Meanwhile, the peak at 3190 cm -1 is assigned to the N -H stretching vibration 1,27,35.As for the single ZnO, the FTIR peak at 3450 cm -1 corresponds to the O -H stretching vibration of the adsorbed H 2 O molecules 35, and the characteristic bending vibration of Zn-O locates at 451 cm -1 .The bending vibration peaks of Zn-O for the CZ-x composites show a slight red-shift (447 cm -1 for CZ-10 and 444 cm -1 for CZ-40), suggesting that there might exist interaction between the ZnO and g-C 3 N 4 components 45. The specific surface areas (S BET ) and Barret-Joyner-Halenda (BJH) pore size distribution of those samples were determined using liquid N adsorption-desorption experiments.Both the single g-C 3 N 4 and ZnO display type IV isotherms with H3 hysteresis loops, while the CZ-10 and CZ-40 composites show the type IV isotherms with H2 ones (Fig. S4a).This difference in the N 2 adsorption-desorption behaviors are attributable to their different microstructures and components.As mentioned above, the single ZnO is microsphere-like soft aggregations composed of ultrafine nanoparticles (Fig. S1b), the accumulated pores deliver the H3 hysteresis loops due to the capillary condensation of N 2 molecules 25.The inflection of N 2 adsorption branch of CZ-10 and CZ-40 composites start at a relatively lower partial pressure than the single ZnO (Fig. S4a), implying that the coexistence of nanosheets and ultrafine nanoparticles causes a different stacked pores and H2-like hysteresis loops, which is different from the single ZnO.The corresponding BJH pore size distribution plots (Fig. S4b) determined from the desorption branches further demonstrate that the single ZnO is microsphere-like aggregations of ultrafine nanoparticles, which lead to a broad and bimodal pore size distribution plot centered at 14.6 and 24.7 nm, while the single g-C 3 N 4 shows very limited porous structures due to its aggregation, which is consistent to its limited N 2 desorption-adsorption as shown in Fig. S4a.However, the CZ-10 and CZ-40 composites display a much narrow and unimodal pore size distribution plots with their peaks centered at 10.2 and 7.6 nm, respectively.These pore sizes are also much smaller than that of the single ZnO (14.6 and 24.7 nm) and g-C 3 N 4 (34.1 nm).This changing trend in the pore size distributions can be ascribable to the following reason: The single g-C 3 N 4 aggregation is transformed into ultrathin layered structure decorated with ultrafine ZnO nanoparticles.As a result, the S BET values of CZ-10 (89.40 m 2 g -1 ) and CZ-40 (78.91 m 2 g -1 ) composites are much larger than that of the single g-C 3 N 4 (50.27m 2 g -1 ), but much smaller than that of the single ZnO (107.03 m 2 g -1 ).Compared with the single g-C 3 N 4 , the g-C 3 N 4 /ZnO composites have much smaller pore sizes and larger surface areas, which may be due to the formation ultrathin g-C 3 N 4 layers by the in-situ growth of ZnO nanoparticles. The survey XPS spectra (Fig. S5) indicate that the single ZnO has apparent binding energy (BE) peaks of Zn, O and C elements, and the single g-C 3 N 4 contains the BE peaks of C and N elements.The CZ-40 composite exhibits distinct BE peaks of Zn, O, C and N elements, indicating that it is composed of ZnO and g-C 3 N 4 .It is also confirmed by the thermogravimetric (TG) curves detected in air.The single ZnO exhibits no obvious weight loss in the range of 150-800 C (Fig. S6a), suggesting its good thermal stability and high purity, while the single g-C 3 N 4 shows almost completely weight loss in the range of 450-650 C, demonstrating its oxidiation decomposition in air.The weight loss rates of the CZ-10, CA-20, CZ-30, CZ-40 and CZ-60 composites are 3.08 , 5.15 , 7.68 , 9.69 and 13.66 (Fig. S6b), respectively.All of them are slightly higher than their respective theoretical values (2.40 for CZ-10, 4.67 for CZ-20, 6.85 for CZ-30, 8.93 for CZ-40 and 12.82 for CZ-60) calculated according to the addition amounts of g-C 3 N 4 .This results suggest that the the added g-C 3 N 4 can be retained in the CZ-x composites, while a small amount of the zinc salt used was lost during the in-situ growth process of ZnO nanoparticles. The high-resolution Zn 2p XPS spectrum (Fig. 3a) of the single ZnO exhibits two BE peaks at 1020.92 and 1043.97 eV, ascribable to the Zn 2p 3/2 and Zn 2p 1/2 of Zn 2 ions in the ZnO lattice 35, respectively.Compared with the single ZnO, those peaks of CZ-40 composite are slightly shifted towards lower BE values at 1020.71 and 1043.76 eV, respectively.The O 1s regional spectrum (Fig. 3b) of the single ZnO can be deconvolved into a major BE peak at 529.73 eV and a weak one at 531.34 eV, which are attributable to the O 2-ions in the ZnO lattice and the surface -OH groups of the ZnO nanoparticles 44, respectively.The O 1s peaks of CZ-40 composite are slightly shifted towards lower BE values at 529.59 and 531.25 eV, respectively.The single g-C 3 N 4 displays N 1s regional spectrum with three BE peaks at 398.20, 399.86 and 404.05 eV (Fig. 3c), which is ascribable to the sp 2 -hybridized N-atoms involved in triazine (C N -C) units, amino groups (C-N-H) and -excitation 35, respectively.Unlike ZnO, the N 1s peaks of CZ-40 composite is slightly shifted towards higher BE values at 398.36, 400.02 and 404.20 eV, respectively.The high-resolution C 1s XPS spectra (Fig. 3d) of the single g-C 3 N 4 and the CZ-40 composite exhibit two BE peaks.For the single g-C 3 N 4 , the two peaks can be attributed to the pure graphitic sites in the amorphous CN matrix (284.28 eV) and sp 2 -hybridized carbon atoms (287.76 eV) 36,45.Similarly, the C 1s peaks of the CZ-40 composite display positive shift compared to the single g-C 3 N 4 .The above results demonstrate that the BE peaks of Zn 2p and O 1s in the CZ-40 composite are slightly shifted towards lower BE direction compared with the single ZnO, while those of N 1s and C 1s display a positive shift compared with the single g-C 3 N 4 .It implies that there is an interaction between the two components in the g-C 3 N 4 /ZnO composite, and the electron density shifts from g-C 3 N 4 phase to ZnO one, which is also confirmed by the above FTIR spectrum analysis.This electron transfer trend in the composite would be a benefit to the photocatalytic process for CO 2 reduction as discussed below. Fig. 4 depicts the photocatalytic CO 2 reduction activities of the obtained g-C 3 N 4 , ZnO and g-C 3 N 4 /ZnO composites (CZ-x) under visible light ( 420 nm) illumination for 1 h.As seen from Fig. 4a, no reduction product of CO 2 is produced from the photoreaction system containing the single ZnO under visible light illumination since ZnO cannot excited by the visible light due to its large bandgap energy 27, while the single g-C 3 N 4 displays low CH 4 /CO generation rates of 0.9/4.8mol g -1 h -1 , which is equal to an overall photocatalytic activity (TCEN) of 16.8 mol g -1 h -1 calculated according to the formula (1).By comparison, all CZ-x composites exhibit much lower CO production rates, but significantly enhanced CH 4 production rates and overall photocatalytic activities.In other words, the g-C 3 N 4 /ZnO composites have much better CO 2 reduction activity and selectivity of CH 4 production compared with the single g-C 3 N 4 . With the increase of g-C 3 N 4 addition amount from 10 mg to 40 mg, the corresponding CZ-x composite delivers a gently increasing trend in the CH 4 production rate.Once the g-C 3 N 4 addition amount is higher than 40 mg (for the CZ-50 and CZ-60 composites), the CH 4 production rate decreases rapidly.Similarly, the TCEN (overall photocatalytic activity) value of the g-C 3 N 4 /ZnO composites also displays a changing tendency similar to that of the CH 4 production rate (Fig. 4a).For instance, the TCEN values rapidly increase from 100.0 (CZ-10) to 158.4 (CZ-40) mol g -1 h -1 , and then decrease to 143.2 (CZ-50) and 114.4 (CZ-60) mol g -1 h -1 , respectively.Among the photocatalysts tested, the CZ-40 composite delivers the highest TCEN value of 158.4 mol g -1 h -1 with CH 4 /CO production rates of 19.8/0.37 mol g -1 h -1 , 9.42 times higher than that (16.8 mol g -1 h -1 ) of the single g-C 3 N 4 with CH 4 /CO production rates of 0.9/4.8mol g -1 h -1 .The recycling stability of CZ-40 composite under visible light irradiation was further investigated by the three consecutive photoreaction runs (each run was conducted for 5 h).As seen from Fig. 4b, the produced CH 4 /CO amounts show continuously increasing trend during each run of 5 h irridiation.By calculation, the average CH 4 production rate is 9.67, 9.18 and 9.01 mol g -1 h -1 at the first, second and third run, respectively.Namely, the average CH 4 production activity in the third run is 93.15 of that in the first run.These results indicate that the g-C 3 N 4 /ZnO composite has relatively good stability for CO 2 photoreduction, and thus would be a potential photocatalyst for CO 2 reduction due to its low cost, facile fabrication and rather high photocatalytic performance. To explore the photocatalytic mechanism of g-C 3 N 4 /ZnO composite, its optical absorption property and energy band structures are investigated initially.As seen from the UV-vis diffuse reflectance absorption spectra (DRS, Fig. 5a), the single ZnO has an absorption edge at 385 nm, and the single g-C 3 N 4 has an intrinsic absorption edge at 448 nm due to the - transition of s-triazine or heptazine structures 26. Compared with ZnO, those g-C 3 N 4 /ZnO composites show redshift in the absorption edge and an elevated background in the range of 460-800 nm, possibly due to the co-existed g-C 3 N 4 . The bandgap energy (E g ) of g-C 3 N 4 and ZnO can be determined to be 2.79 and 3.27 eV by the Tauc plots shown in Fig. 5b, where the Tauc plot of g-C 3 N 4 is derived from (hv) n vs. light energy (hv) (n 1/2 for indirect bandgap), and the plot of ZnO is obtained by (hv) n vs. hv (n 2 for direct bandgap).The valence band (VB) XPS spectra (Fig. 5c) display that the VB top (E VB ) of ZnO and g-C 3 N 4 are 1.77 and 2.32 eV, respectively.Therefore, the conduction band (CB) bottom (E CB ) of ZnO and g-C 3 N 4 can be calculated to be -0.95 and -1.02 eV according to the formula (E CB E VB -E g ), respectively.Although the ZnO phase in the composite cannot be excited by the visible light, the g-C 3 N 4 component can be excited as shown in Fig. 5d.The photogenerated electrons can be transferred from the CB of g-C 3 N 4 to the CB of ZnO with more positive potential, and the holes are preserved in the VB of g-C 3 N 4 for the photooxidation.Since the CB potential (-0.95 eV) of ZnO is more negative than the potential of CO 2 /CH 4 redox couple 8, the accumulated electrons in the CB of ZnO can reduce CO 2 to produce CH 4 /CO. The above results on the photoactivity for CO 2 photoreduction imply that the g-C 3 N 4 /ZnO composite has promoted the photogenerated charge separation compared with the single g-C 3 N 4 , which can be verified by the photoluminescence (PL) spectra (Fig. 6a).As seen, since ZnO cannot be excited by the visible light, and thus the single ZnO has no obvious emission peak, while the single g-C 3 N 4 shows obvious PL signals in the range of 450-700 nm, and the main peak at 485 nm originates from the fast recombination of the photoexcited electrons and holes.Compared with the single g-C 3 N 4 , the g-C 3 N 4 /ZnO composites exhibit weaker PL intensity, which means that it can effectively repress the charge recombination of the g-C 3 N 4 by transferring its photogenerated electrons to the co-existed ZnO nanoparticles due to the matching energy band structures as show in Fig. 5d that the co-existed ZnO nanoparticles can accept the photoexcited electrons of the g-C 3 N 4 phase, which can effectively retard the charge recombination, and then enhance the photoactivity as shown in Fig. 4a.This conjecture can also be supported by the electrochemical impedance spectra (EIS) shown in Fig. S7.The Nyquist plot's semicircle radius of the CZ-40 composite is much smaller than that to the single g-C 3 N 4 and ZnO, which reflects that the CZ-40 composite has lower charge transfer resistance and more effective charge separation than the single g-C 3 N 4 43.The above results demonstrate that the improved photocatalytic performance of the g-C 3 N 4 /ZnO composites can be attributed to the in-situ grown ultrafine ZnO nanoparticles that decorated on the ultrathin g-C 3 N 4 layers with well-defined interface.These microstructure characteristics cause a reduced charge transfer resistance and efficient charge separation, and then the enhanced photocatalytic performance of the g-C 3 N 4 /ZnO composite. The above conclusion can be further validated by the photoactivities of the product derived from the aqueous solution and the physical mixture of ZnO and g-C 3 N 4 .As seen from Fig. S8, the CZ-40-aq, derived from a similar refluxing process of the CZ-40 composite but with water and KOH aqueous solution instead of the methanol and KOH methanol solution, only delivers trace photocatalytic CO 2 reduction activity with CH 4 /CO generation rates of 0.7/1.2mol g -1 h -1 and a TCEN value of 8.0 mol g -1 h -1 , which is much lower than those of the CZ-40 composite.It implies that the hard aggregation (Fig. S2) of ZnO in the CZ-40aq composite would not beneficial for the visible light absorption of the co-existed g-C 3 N 4 , and thus causing the trace activity.On the other hand, those hard aggregations of ZnO in the CZ-40-aq composite is not a benefit for the interfacial contact between the g-C 3 N 4 layers and ZnO nanoparticles, and thus the photoexcited electrons of the g-C 3 N 4 cannot effectively transfer to the ZnO, which will also lead to a decreased activity.For further making this issue clearer, the physical mixture (CZ-40mix) was prepared by grinding the single ZnO and g-C 3 N 4 .It was found that the CZ-40-mix only delivers very low activity with CH 4 /CO generation rates of 1.8/3.6 mol g -1 h -1 and a TCEN value of 21.6 mol g -1 h -1 , which is slightly higher than that of the single g-C 3 N 4 , but still much lower than those of the CZ-40 composite.Based on the above results and discussion, it can be concluded that the present work affords a promising strategy to construct g-C 3 N 4 -based hybrid materials with close interfacial contact and smooth charge transfer for superior photocatalytic CO 2 reduction performance. In the photoreduction process, CO 2 molecules need to accept the electrons of photocatalyst, which is affected by the surface adsorption and activation of CO 2 .Therefore, the effects of surface CO 2 adsorption on the activity was investigated by temperature-programmed desorption-mass spectrometry (TPD-MS).The corresponding results indicate that there are two main signal peaks with mass-to-charge ratio (m/z) of 44 and 18, which correspond the adsorbed CO 2 and H 2 O molecules on the photocatalyst surface, respectively.As shown in Fig. 7a, the single ZnO displays a TPD-MS signal profile of CO 2 (m/z 44) with two major temperature regions due to CO 2 desorption.The relatively strong signal peak centered at 287 C can be attributed to the strong physical adsorption of CO 2 on the ZnO nanoparticles, while the weak and wide one (m/z 44) in the range of 386-500 C indicates that the single ZnO has more complex but weak chemisorption modes for CO 2 10,46.The single g-C 3 N 4 has no obvious signal (for m/z 44) peak in the range of 50500 C, implying that its ability to adsorb CO 2 is very limited.The very strong signal peak centered at 553 C can be ascribed to the CO 2 released from the thermal decomposition of g-C 3 N 4 . Compared with the single ZnO and g-C 3 N 4 , the CZ-40 composite exhibits much stronger physical adsorption peak (at 300 C) and chemisorption peak (at 420 C) of CO 2 as shown in Fig. 7a.This result indicates that the g-C 3 N 4 /ZnO composite adsorbs CO 2 more effectively than the single ZnO and g-C 3 N 4 , which is possibly due to the obvious changes of surface state, component and microstructure of the composite, and the strong interaction between the two components as mentioned above.Also, the CZ-40 composite shows an exceptionally strong signal peak at 538 C, slightly lower than the decomposition temperature of the single g-C 3 N 4 , which means that the combination of ZnO nanoparticles is beneficial to the decomposition of g-C 3 N 4 .These results suggest that the physical and chemistry adsorption ability of g-C 3 N 4 /ZnO composite are better than that of the single g-C 3 N 4 and ZnO. Fig. 7b depicts the TPD-MS signal profiles of H 2 O (m/z 18) that are related to the H 2 O desorption from the photocatalyst surface.As seen, all samples show no obvious adsorption peak below 200 C, suggesting that their physical adsorption ability to H 2 O molecules is very weak.In the temperature range of 200400 C and 400700 C, the single ZnO exhibits two main signal peaks, while the single g-C 3 N 4 displays wider, stronger and more complex TPD-MS signal profile, which imply that the g-C 3 N 4 has stronger chemisorption capacity for H 2 O than the single ZnO.Nevertheless, the CZ-40 composite exhibits very stronger TPD-MS signal peak centered at 490 C with two shoulders near 369 C and 593 C, indicating that the chemisorption ability to H 2 O is higher than that of the single ZnO and g-C 3 N 4 , which is similar to that of the CO 2 desorption mentioned above. The above results suggest that the hybridization between ultrathin g-C 3 N 4 layers and ZnO nanoparticles improves the CO 2 /H 2 O chemisorption capacity, which plays a vital role in the photocatalytic CO 2 reduction process.The more effective H 2 O/CO 2 chemisorption of the CZ-40 composite may be a benefit to the proton-coupled-electron-transfer (PCET) process for CO 2 photoreduction 8910, and thus resulting in the higher selectivity for CH 4 production and the overall photocatalytic activity for CO 2 reduction.On the contrary, the lower H 2 O chemisorption of the single g-C 3 N 4 than the composite shows a relatively higher selectivity for CO production, while the lower CO 2 chemisorption results in the much lower overall photocatalytic activity for CO 2 photoreduction (Fig. 4a).In addition, the ultrathin g-C 3 N 4 layers may also lead to the different H 2 O/CO 2 adsorption behaviors because the H 2 O molecules on solid can promote the mass transfer of CO 2 from gas phase to solid surface, and thus promoting the CO 2 adsorption, which has the advantage of accepting the photogenerated electrons for CO 2 reduction through the PCET process 10,47,48."
  },
  {
    "title": "Conclusions",
    "content": "In summary, a novel method was developed to fabricate g-C 3 N 4 /ZnO composite via refluxing a soluble zinc salt and a pre-formed g-C 3 N 4 in methanol solution.Compared with g-C 3 N 4 , the resultant g-C 3 N 4 /ZnO composites display significantly improved photocatalytic CO 2 reduction activity and selectivity for CH 4 production under visible light irradiation, and the g-C 3 N 4 /ZnO composite with an optimal component ratio delivers the best overall photocatalytic activity, which is 9.42 times higher than that of the single g-C 3 N 4 .Some in-situ grown ultrafine ZnO nanoparticles are decorated on the ultrathin g-C 3 N 4 layers with welldefined interface, which not only causes a reduced charge transfer resistance and efficient charge separation, but also creates more active sites for the CO 2 adsorption and activation of the g-C 3 N 4 /ZnO composite.The present work provides a new synthetic strategy for the fabrication of g-C 3 N 4 -based hybrid materials with effective charge carrier separation, highly active and selective CO 2 photoreduction for CH 4 generation. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Fig. 1 depicts the X-ray diffraction (XRD) patterns of the obtained g-C 3 N 4 , ZnO and g-C 3 N 4 /ZnO composites (CZ-x).The single ZnO exhibits XRD peaks at 2 31.8 , 34.4 , 36.2 , 47.5 , 56.6 , 62.9 and 68.0 , corresponding to the reflections of (100), (002), (101), (102), (110), (103) and (112) planes of hexagonal wurtzite ZnO (JCPDS No. 65-3411)35,43, respectively.No other impurity peak is detected, implying the ZnO product has high crystal phase purity.The single g-C 3 N 4 displays an XRD peak at 2 27.4 , ascribable to the reflection of (002) plane35,43.No characteristic peak belonging to g-C 3 N 4 is found in the CZ-x composites with low g-C 3 N 4 addition amount, suggesting that the ZnO Fig. 1.XRD patterns of the obtained g-C 3 N 4 , ZnO and g-C 3 N 4 /ZnO composites (CZ-x) derived from different addition amounts of g-C 3 N 4 during the refluxing process. Fig. 2. TEM and HRTEM images of the obtained g-C 3 N 4 (a, b), ZnO (c, d) and CZ-40 composite (e, f). Fig. 3. High-resolution XPS spectra of Zn 2p (a), O 1s (b), N 1s (c) and C 1s (d) for the obtained ZnO, g-C 3 N 4 and CZ-40 composite. Fig. 4. (a) Photocatalytic CO/CH 4 production rates and the corresponding overall photocatalytic activities (TCEN) of the obtained g-C 3 N 4 , ZnO and CZ-x composites under visible light ( 420 nm) illumination for 1 h.(b) Photostability for CO 2 reduction of the CZ-40 composite. Fig. 5. (a) DRS spectra of the obtained g-C 3 N 4 , ZnO and CZ-x composites; (b) Tauc plots of the obtained g-C 3 N 4 and ZnO calculated form their respective DRS spectra shown in a. (c) Valence band XPS spectra of the obtained g-C 3 N 4 and ZnO.(d) Schematically illustrating diagram of the energy band structures and photoreaction mechanism of the g-C 3 N 4 /ZnO composite. Fig. 6.(a) Photoluminescence (PL) spectra of the obtained g-C 3 N 4 , ZnO and CZ-x composites.(b) Transient photocurrent curves of the obtained g-C 3 N 4 , ZnO and CZ-40 composite. Conceptualization, Methodology, Investigation, Writingoriginal draft.Jingpeng Jin: Methodology, Investigation, Writingoriginal draft.Shengtao Chen: Data curation, Validation, Investigation.Tingxia Wang: Data curation, Validation.Jiangrong Xiao: Supervision, Data curation, Writing -review editing.Tianyou Peng: Supervision, Writing -review editing, Project administration. Fig. 7. TPD-MS profiles of CO 2 (a) and H 2 O (b) for the obtained ZnO, g-C 3 N 4 and CZ-40 composite. This work was supported by the National Natural Science Foundation of China (21975190, 21573166, 21271146 and 20973128), the Science and Technology Planning Project of Shenzhen Municipality (JCYJ20180302153921190) and the Foundation for Innovative Research Groups of Hubei Province (2014CFA007), China. Supplementary material related to this article can be found, in the online version, at doi:https://doi.org/10.1016/j.materresbull.2020 .111177."
  }
]