[
  {
    "title": "Doi",
    "content": "10.1016/j.jcou.2018.01.024"
  },
  {
    "title": "Article_Title",
    "content": "A ZIF-8 decorated TiO2 grid-like film with high CO2 adsorption for CO2 photoreduction"
  },
  {
    "title": "Abstract",
    "content": "A strategy of coupling a photocatalyst with a high CO 2 adsorption capacity material was proposed in order to integrate CO 2 capture and photoreduction processes into a single system.TiO 2 and ZIF-8 were selected for their high photoactivity and CO 2 adsorption capacity respectively.We employed a facile in-situ growth strategy to inlay ZIF-8 into the TiO 2 film grid.X-ray diffraction and scanning electron microscopy revealed that ZIF-8 was successfully prepared and inlaid into the TiO 2 film.X-ray photoelectron spectroscopy and photoluminescence spectra suggested that the TiO 2 and ZIF-8 were coupled by chemical bonding.The ZIF-8 decorated TiO 2 film exhibited excellent CO 2 capture capacity and showed remarkably enhanced yield for reducing CO 2 to CO and CH 4 when compared with pure TiO 2 film.The probable mechanism of the photoreduction process is also discussed."
  },
  {
    "title": "Experimental",
    "content": "H 2 O 2 solution (30wt), methanol and zinc nitrate hexahydrate were purchased from China Experiment Reagent Co., Ltd.(analytical grade).2-methylimidazole was purchased from Aladdin Reagent (Shanghai) Co., Ltd.(analytical grade).Commercial Ti-foil was purchased from Xinxin Metal Material Company, China.All reagents were used without further purification. The grid-like TiO 2 films were prepared by a facile hydrothermal method 24.Firstly, commercial Ti foils (20 mm 20 mm 0.25 mm) were cleaned with a mixed solution consisting of deionized water, hydrofluoric acid and nitric acid.The cleaned Ti foils were then immersed in hydrogen peroxide solution and treated at 393K in a furnace for 2 h. For the synthesis of the ZIF-8 loaded TiO 2 films, an in situ approach was proposed.The synthesis was based on the pure ZIF-8 synthesis process with amendment 30.The synthesis protocol for TiMOF-1 will be provided as an example.For this process, 0.1833g zinc nitrate hexahydrate was added to 25 mL methanol and stirred to dissolution.Separately, 0.405g 2-methylimidazole was added to 25 mL methanol.The as-prepared TiO 2 film was pretreated by immersing it in zinc nitrate solution for 6 h.2-methylimidazole solution was then added into the zinc nitrate solution with the TiO 2 film standing in the mixed solution.The mixture was stirred at a proper speed for 25 min with the solution turning white.After that, the ZIF-8 decorated TiO 2 film was cleaned with ethanol, thus TiMOF-1 was obtained.The whole experiment proceeded at 273 K.In the same way, TiMOF-2 and TiMOF-3 were prepared by repeating the ZIF-8 growing step two or three times, respectively.In summary, ZIF-8 content increased from TiMOF-1 to TiMOF-3. A scanning electron microscope (SEM, Hitachi S4800) was used to observe the surface morphology of the catalysts.X-ray diffraction analysis was performed using an X'Pert PRO diffractometer equipped with Cu K ( 0.15406 nm) radiation.UV-vis diffuse reflectance spectra were recorded using a Hitachi U-3010 spectrometer equipped with a 60 mm diameter integrating sphere.X-ray photoelectron spectroscopy measurements were conducted on a VG ESCALAB MARK II spectrometer with an Mg K (1253.6 eV) X-ray source.The thermogravimetry (TG) experiments were operated from 25 to 700C with 10C min -1 ramp rate.The CO 2 adsorption experiments were performed using a volumetric gas sorption analyzer (Micrometritics ASAP 2020).Photoluminescence spectra were obtained at room temperature using an FLS920 fluorescence spectrometer (Edinburgh Instruments Ltd.). Measurements of the photoreduction of CO 2 were conducted for 5 h under the illumination of two 8 W ultraviolet lamps (wavelength of 220-380 nm) in a self-made photoreactor.Samples (size of 20 mm 20 mm 0.25 mm) were placed in the reactor, with a mixture of CO 2 and water as reacting gas flowing at a rate of 30 mL/min during the entire process.Water worked as electrons source and no sacrificial agents were applied.To purge residuals from the reactor, the reacting gas was pumped for 30 min prior to commencing the reaction.The light sources were then turned on, and the measurements started and continued for 5 h.Data were collected hourly to record the content of reduced products in the effluent gas using a gas chromatograph (GC/FID, Thermo-Fisher, Trace GC) equipped with an N 2000 dual-channel chromatography data workstation.The whole reaction proceeded at 25C and one atmosphere."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The morphology of the grid-like TiO 2 films is shown in Fig. 2a.The 2b, ZIF-8 preferred to grow on the TiO 2 rod.This is the result of heterogeneous nucleation to lower nucleation energy 31,32.In the heterogeneous nucleation process, ZIF-8 connected with TiO 2 by forming chemical bonds which will be investigated by XPS in the following text.For TiMOF-2, ZIF-8 grew around the TiO 2 rods and filled the grid of the porous structure (Fig. 2c).When repeating the growing step three times, the TiO 2 film was almost completely covered by a large amount of ZIF-8 nanoparticles (TiMOF-3, Fig. 2d).As shown in the SEM image, an increased growing number resulted with higher ZIF-8 content in the samples.3b.We can see from Fig. 3b that TiMOF-1 didn't exhibit any peaks of ZIF-8 for the low content.In the case of TiMOF-2, two weak peaks could be observed at 13 and 18 .TiMOF-3 showed high consistency with the simulated ZIF-8 pattern.Since the loading weight cannot reach the sensitivity limit of XRD, only some weak peaks can be observed in the corresponding XRD pattern.As evidenced by the XRD patterns, the phase composition and crystallinity of TiO 2 were not affected after the synthesis process was applied for the MOF nucleation and growth. The chemical states of the Ti and Zn elements were analyzed using X-ray photoelectron spectroscopy (XPS).The Ti 2p core level spectra of TiO 2 and TiMOF-2 are shown in Fig. 4a.The Ti 2p 3/2 binding energy of the pure TiO 2 film was located at 458.5 eV in accordance with the literature value 33.In the case of TiMOF-2, the Ti 2p binding energy was shifted to lower binding energy and fitted by the spectrometer software into two peaks due to the spin-orbit coupling effect 34.The Zn XPS results showed similar trends.The emergence of the new peaks (Ti-457.9463.6 eV, Zn-1021.21044.2eV) suggests a modification in the surface chemical states of Ti and Zn in the composites and the interaction between TiO 2 and ZIF-8 with the possible formation of an effective path for charge carrier migration 35. The optical absorption properties of the samples are demonstrated in Fig. 5.The main peak at 300 nm is the absorption peak of TiO 2 36.Compared with pure TiO 2 film, a new peak can be observed at 230 nm in TiMOF-1, 2, and 3.The absorption peak at 230 nm is attributed to the absorbance of organic ligand in ZIF-8 37,38.In general, organic linkers in the MOF structures play the role of light absorption; thus, the UV-vis spectra of ZIF-8 is similar to that of 2-methylimidazole (Fig. 6).With ZIF-8 content increasing from TiMOF-1 to TiMOF-3, the peak at 230 nm also showed an increasing trend. Photoluminescence (PL) has been widely applied in the photocatalytic field to characterize the recombination rate of charge carriers 39.In the previous XPS test, it was inferred that a possible path might be established between TiO 2 and ZIF-8 for charge carrier migration, so PL was employed to investigate the behavior of the charge carriers.TiO 2 can be activated by light of around 300 nm in wavelength according to UV-vis spectra 40.To investigate the charge carrier recombination phenomenon, excitation light of 350 nm wavelengths was applied.Fig. 7 reveals the emission peak of TiO 2 when excited by 350 nm wavelength light in which ZIF-8 was not excited.Pure TiO 2 film showed the highest electron-hole recombination rate, and the strong PL was quenched with ZIF-8 loading.It can be inferred that the incorporation of ZIF-8 can separate electron-hole pairs effectively, and suggests the existence of a path for charge carriers between TiO 2 and ZIF-8.The reduced recombination rate of charge carriers leads to more electrons involved in the photoreduction process. CO 2 molecules are stable and chemically inert with a closed-shell electronic configuration and linear geometry such that CO 2 reduction is a daunting challenge.In the photoreduction process, an extremely high reduction potential is required to break the symmetrical electronic structure of CO 2 , and common semiconductors cannot meet this requirement 28.Thus, it is desirable to activate CO 2 by the adsorbing process before the reduction reaction.A strong CO 2 adsorption capacity can greatly accelerate the kinetic process of CO 2 reduction, which means that CO 2 adsorption capacity is a vitally important index for CO 2 photocatalysts.This is also the reason why we incorporate TiO 2 with ZIF-8 which shows excellent CO 2 adsorption capacity.To test CO 2 adsorption capacity, the ZIF-8 decorated TiO 2 film was cut into pieces with which to perform CO 2 adsorption experiments on a volumetric gas sorption analyzer.Since the metal substrate occupies the main weight of the samples, the tested CO 2 adsorption capacity is low when compared with the powder sample.As shown in Fig. 8, TiMOF-3 with highest ZIF-8 content showed the highest CO 2 adsorption capacity which confirmed that ZIF-8 works efficiently in CO 2 adsorption.In the meantime, TiMOF-2 improved CO 2 adsorption capacity by 78.8 when compared with pure TiO 2 film.The enhanced CO 2 adsorption is a benefit to the CO 2 reduction process by increasing CO 2 concentration on the photocatalyst surface.For comparison, powdery pure P25 and ZIF-8 were also tested under the same conditions.The CO 2 adsorption capacity of P25 was determined to be 8.23 cm 3 /g while that of ZIF-8 was 27.02cm 3 /g.Thus, it is evident that ZIF-8 shows a much higher CO 2 adsorption capacity than TiO 2 . CO 2 reduction experiments were performed under ultraviolet light in a self-made reactor.Both CO and CH 4 were detected as products of all samples (Fig. 9).Although TiMOF-3 showed the highest CO 2 adsorption capacity and lowest recombination rate, TiMOF-2 behaved the best in terms of both in CO and CH 4 yields.It is considered that the large amount of ZIF-8 in TiMOF-3 essentially covered the TiO 2 , which can be confirmed in the SEM images, and thus inhibited the photo excitation process of TiO 2 .Compared with pure TiO 2 film, TiMOF-2 improved CO yield by 38 (0.53 mmol g -1 h -1 ) and CH 4 yield by 157 (0.18 mmol g -1 h -1 ).In general, CO yield can be enhanced easily by several strategies, while increasing CH 4 yield is much more difficult.In the photocatalysis process, CO 2 consumes two electrons to transform into CO while eight electrons are needed in CH 4 transformation (Fig. 1).For traditional semiconductor photocatalysts, the majority of CO leaves the photocatalyst surface and only a small amount of CO remains on the surface to continue the subsequent reduction process.With the photocatalysts herein, the framework pores of the MOFs are able to enclose CO 2 and CO within a \"nanoreactor\" environment to finish the lengthy transformation process and improve the overall yield 29.Thus, CH 4 yield can be readily enhanced using the present catalyst. To ensure the stability of our hybrid materials, the cyclic parallel test was carried out.As shown in Fig. 10, the yield of CO and CH 4 almost kept consistent during cyclic parallel test.TiMOF-2 and TiMOF-3 were tested separately by XRD before and after photocatalytic reaction (Fig. 11), and no obvious differences were observed.TG was also carried out to characterize the thermal stability of TiO 2 and ZIF-8 (Fig. 12).The weight loss of TiO 2 was less than 0.5 before 100C, due to the loss of H 2 O molecules on the surface.The weight loss of ZIF-8 before 501C was due to the releasing of methanol.The methanol was trapped in the cavities of ZIF-8 during the preparation process.Though we have activated ZIF-8 at 80C in vacuum for 24 h, there were still some methanol trapped in the cavities due to the complex channels.ZIF-8 started to break down at 530C.Both TiO 2 and ZIF-8 showed excellent thermal stability. The probable mechanism for the composite material in the photoreduction process is proposed as follows (Fig. 13): CO 2 diffuses into the pores of ZIF-8 and is trapped by the framework.A portion of the CO 2 molecules interact with the unsaturated metal ions through one of the oxygen lone pair orbitals with formation of end-on adducts 16.In the coordination process, the carbon dioxide molecule appears to be slightly bent from its usual linear structure and thus CO 2 is activated for the subsequent chemical process.With illumination, both TiO 2 and ZIF-8 can be activated and charge carriers are photoinduced.In the photoexcitation process, TiO 2 plays a leading role due to its high photoactivity and narrow band gap.The conduction band of ZIF-8 has been reported to be -0.45eV 414243, which is more positive than the conduction band level of TiO 2 (-0.5 eV) 28.Thus electrons can migrate from TiO 2 to ZIF-8 to take part in the photoreduction process that occurs in ZIF-8.It is worth mentioning that MOFs tend to transport electrons from organic linkers to the metal site and CO 2 is exactly coordinated to this site.With common photocatalysts, CO 2 and CO can leave the photocatalyst easily and thus the photoreduction process is often interrupted with only formation of mid-product (CO).However, in our hybrid materials, both CO 2 and CO are trapped in the complex channel of ZIF-8 44.Thus, much more end product is obtained."
  },
  {
    "title": "Conclusions",
    "content": "We have demonstrated a facile two-step method for fabricating ZIF-8 decorated TiO 2 films.The incorporation of ZIF-8 greatly enhanced the CO 2 adsorption capacity of the hybrid material.Compared with pure TiO 2 film, the CO 2 adsorption capacity of the hybrid material (TiMOF-2) was increased by 78.8.XPS and PL suggested that ZIF-8 was successfully coupled with TiO 2 via chemical bonding to reduce the charge carriers' recombination rate.With the promoted CO 2 adsorption capacity and coupling effect, CO and CH 4 yields were increased by 38 (0.53 mmol g -1 h -1 ) and 157 (0.18 mmol g -1 h -1 ), respectively.The prepared hybrid material has successfully combined CO 2 capture and reduction into a single system which has important ramifications for future CCU applications. Fig. 1.Multielectron transfer steps of CO 2 reduction process. X-ray diffraction (XRD) patterns of the samples are shown in Fig. 3a.The spectra indicate that the as-prepared TiO 2 film was composed of anatase and rutile phases, and Ti peaks were also detected.The peaks at 37.8 , 53.8 and 70.3 were assigned to the (112), (105) and (220) crystal planes of anatase TiO 2 , respectively (JCPDS No.: 21-1272), whereas the peaks located at 62.7 and 76.5 were assigned to the (002) and (202) crystal planes of rutile TiO 2 , respectively (JCPDS No.:21-1276).Since the peaks of ZIF-8 were located between 5 to 35 , a slower-scan XRD pattern from 5 to 40 was performed as is shown in Fig. Fig. 2. SEM images of TiO 2 film(a), TiMOF-1(b), TiMOF-2(c) and TiMOF-3(d). Fig. 3. XRD patterns of TiO 2 film, and TiMOF-1, TiMOF-2 and TiMOF-3. Fig. 4. XPS spectra of Ti (a) in TiO 2 and Zn (b) in ZIF-8. Fig. 6.UV-vis spectra of Zn II in solution, 2-methylimidazole and ZIF-8. Fig. 7. PL spectra of TiO 2 , TiMOF-1, TiMOF-2 and TiMOF-3 at 350 nm. Fig. 8. CO 2 adsorption isotherms at 0 oC for TiO 2 , TiMOF-1, TiMOF-2 and TiMOF-3. Fig. 9. CO and CH 4 yields with TiO 2 , TiMOF-1, TiMOF-2 and TiMOF-3. Fig. 10.The mean production rate of TiMOF-2 for different recycle times. Fig. 11.XRD patterns of TiMOF-2 and TiMOF-3 before and after photocatalytic reaction. Fig. 12. TG curves of TiO2 and ZIF-8. This work was supported by the National Natural Science Foundation of China No. 50772098."
  }
]