[
  {
    "title": "Doi",
    "content": "10.1016/j.jallcom.2021.163030"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic CO2 reduction with water vapor to CO and CH4 in a recirculation reactor by Ag-Cu2O/TiO2 Z-scheme heterostructures"
  },
  {
    "title": "Abstract",
    "content": "A ternary Z-scheme Ag-Cu 2 O/TiO 2 catalyst was prepared by one-step chemical reduction method which was applied in photocatalytic CO 2 reduction with water vapor under simulated sunlight in a recirculation reactor.The structure, morphology, photo absorption capacity and optoelectronic properties of the obtained samples were characterized by XRD, TEM, XPS, UV-vis DRS and Photoelectrochemical measurements.The photocatalytic activity tests showed that 0.5Ag-0.5Cu 2 O/TiO 2 exhibited the highest production rate of CO (13.19 mol/g/h) and CH 4 (1.74 mol/g/h) under simulated sunlight when compared to P25, 1Cu 2 O/TiO 2 and 1Ag/TiO 2 .Mechanism studies by means of EPR technology testified that the improvement of photocatalytic performance was mainly due to the formation of Z-scheme heterojunctions between P25 and Cu 2 O, which facilitated the separation of photogenerated charges.The incorporation of Ag nanoparticles further enhanced the transfer of photogenerated carriers and the absorption of visible light, thus preventing the selfreduction of Cu 2 O and improving the photocatalytic CO 2 reduction performance."
  },
  {
    "title": "Experimental",
    "content": "Pseudo-boehmite (PB), Silica sol, P25 (Macklin), Copper nitrate trihydrate (Cu(NO 3 ) 2 3H 2 O, Kermel, 99), Silver nitrate (AgNO 3 , Beijing Chemical Works, 99.5), L-ascorbic acid(L-AA,JiaHui, 99.7). During the photocatalytic activity evaluation, the photocatalyst was loaded on a ceramic substrate.The ceramic substrate was prepared by the process detailed below.The silica sol were mixed with PB powder uniformly in a beaker by a mass ratio of 3:1 at room temperature, and then the obtained mixture was poured into a rectangular mold with a length of 5 cm and a width of 2.5 cm, and dried at room temperature and calcined at 700 C for 4 h. Ag-Cu 2 O/TiO 2 was synthesized by a modified one-step chemical reduction method. 55In a typical experiment, 0.8 g of P25 was first dispersed into 100 mL of DI water by sonication for 30 min at room temperature, and then Cu(NO 3 ) 2 3H 2 O (0.5 mL, 0.1 M), NaOH (1 mL, 0.1 M) and AgNO 3 (0.5 mL, 0.1 M) aqueous solutions were dropped successively to the above solution with magnetic stirring.Finally, 0.3 g L-AA was added into the dispersion with vigorous stirring at room temperature for 1 h and the reduced products were collected by centrifugation and washed six times with an ample amount of ethanol and DI water, then dried at 50 C for 12 h.The resultant sample was designated as 0.5Ag-0.5Cu 2 O/TiO 2 . For comparison, Cu 2 O/TiO 2 with 1 Cu (mol) and Ag/TiO 2 with 1 Ag (mol) were also synthesized by the same method as above, which were labeled as 1Cu 2 O/TiO 2 and 1Ag/TiO 2 . The CO 2 photoreduction with H 2 O vapor was carried out in a circulation system with a total volume 300 m.50 mg photocatalyst was coated on the surface of ceramic substrate, and the ceramic substrate was placed vertically in the center of quartz tube reactor.The 300 W xenon lamp (PLS-SXE 300 C xenon lamp) equipped with an AM 1.5 G filter was used as simulated sunlight source.Water was brought into reactor by bubbling with CO 2 gas.Prior to light irradiation, the reactor was rinsed with CO 2 (30 mL/min) for 1 h at 200 C to remove the air in the reactor and the organic substances adsorbed on the catalyst surface.After that, the gas circuit was switched to circulation system, and then peristaltic pump and Xe arc lamp were turned on.After reaction for 2 h, 0.1 mL of gas was extracted with a syringe from the reactor and analyzed by an gas chromatography using a thermal conductivity detector. X-Ray Diffraction (XRD) characterizations were carried out on a Bruker AXS D8 powder X-ray diffractometer with graphite monochromatized Cu-K radiation at 40 kV and 200 mA.Scanning electron microscope (SEM) images were obtained by using regulus8100 at an accelerating voltage of 3 kV.Transmission electron microscope (TEM) images were obtained With a JEOL JEM-2100 F field emission electron microscope at 200 kV.X-ray photoelectron spectroscopy (XPS) measurements were performed on a Thermo SCIENTIFIC ESCALAB 250Xi spectrometer with all binding energies calibrated to the C 1 s peak at 284.8 eV.UV-visible diffuse reflectance spectra (UV-Vis DRS) characterizations were measured on a PerkinElmer Lambda 750 instrument by using BaSO 4 as a reference at wavelengths of 200-800 nm.Photoluminescence (PL) spectra were performed with a Fluorolog 3 photoluminescence spectrometer (excitation 320 nm).Photoelectrochemical measurements were carried out on an electrochemical workstation (CHI 660, CH Instruments, Austin, TX) with using a three-compartment glass cell.A Ag/AgCl electrode and A platinum electrode were used as the reference electrode and the counter electrode, respectively.The experiments were carried out with a Na 2 SO 4 solution (0.1 M) as an electrolyte and a 300 W Xe lamp with an AM 1.5 filter at room temperature.The electron spin resonance (ESR)/5,5-dimethyl-1pyrroline-N-oxide (DMPO) spin-trapping technique was tested by a Bruker EMXnano spectrometer (473 K, 9.63 GHz, water 1 mL, DMPO 40.0 L and catalyst 10 mg)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Fig. 1 showed the XRD patterns of P25, 1Cu 2 O/TiO 2 , 0.5Ag-0.5Cu 2 O/TiO 2 and 1Ag/TiO 2 .For all samples, the diffraction peaks at 25.28, 48.05 and 62.69 ascribed to the (101), ( 200) and (204) crystal planes of anatase TiO 2 (PDF-21-1272) and those at 27.45, 36.09,41.23, 56.64 and 69.01 assigned to the (110), ( 101), ( 111), ( 220) and (301) crystal facets of rutile TiO 2 (PDF-21-1276) were detected, indicating that TiO 2 contained two crystal structures.After the addition of Cu 2 O and Ag, no obvious change in the crystalline phase of P25 was seen, in which showed that the introduction of Cu 2 O and Ag has no effect on the crystalline form of TiO 2 .In addition, the characteristic peaks did not significantly shift, implying that Ag and Cu 2 O were loaded on the surface of P25, but not entered into the lattice of P25.In addition, no characteristic peak of Cu2O or Ag was observed in composites, which may be due to their low contents. The morphology of P25 and 0.5Ag-0.5Cu 2 O/TiO 2 composites were studied by SEM and TEM.As shown in Fig. 2(a), P25 was composed of irregular particles with size of about 30-50 nm.Fig. 2(b,c) showed that the morphology of 0.5Ag-0.5Cu 2 O/TiO 2 almost maintains unchanged when compared to TiO 2 , and Cu 2 O. Ag nanoparticles can not be observed clearly, which was probably due to their small size and low content.HRTEM was used to further investigate the structure of 0.5Ag-0.Ag and the heterostructures can provide an efficient charge transfer pathway to inhibit the recombination of electron-hole pairs 58.With the decoration of both Cu 2 O and Ag, the emission peak was further decreased, which can be attributed to the fact that Ag can act as the \"electron reservoir\" to capture electrons and delay the recombination of photogenerated electron hole pairs.In addition, with the introduction of Cu 2 O and Ag, the emission peak had an obvious red shift, indicating that the band gap of the sample became narrower and the visible light absorption performance was improved.The above results demonstrated that the coexistence of Ag and Cu 2 O onto P25 can improve the charge carrier transfer and separation capability and the utilization of visible light.Consequently, the reaction rate of photocatalytic CO 2 reduction can be increased. The E FB of P25, 1Cu 2 O/TiO 2 , 0.5Ag-0.5Cu 2 O/TiO 2 and 1Ag/TiO 2 were -0.199, -0.173, -0.168, -0.15 and -0.217 V (Vs.NHE), respectively.It's known to all that the conduction potential (E CB ) of n-type semiconductor is more negative 0.1 or 0.2 V than its flat band potential (E FB ).In this paper, -0.2 V was used to calculate the E CB .The valence band potential (E VB ) was estimated by formula (2) using the band gap values calculated in Fig. 5b and summarized in Table 1. T i me ( s ) The electrochemical impedance spectroscopy (EIS) was employed to investigate the interfacial charge transfer resistance and separation efficiency between the working electrode and the electrolyte.The radius of curvature of the curve was positively correlated with the electrochemical impedance of the tested sample, that is, the smaller the radius of curvature, the smaller the electrochemical impedance of the sample, and the higher the transfer efficiency of carriers in the semiconductor.As shown in the Fig. 5(d), the radius of curvature of P25 was the largest.After depositing Ag and Cu 2 O, the radius of curvature became smaller.Among them, the radius of curvature of 0.5Ag-0.5Cu 2 O/TiO 2 was the smallest, indicating that a lowest charge-transfer resistance between 0.5Ag-0.5Cu 2 O/TiO 2 composite and electrolyte was obtained, which implied that the 0.5Ag-0.5Cu 2 O/TiO 2 sample possessed the greatest carriers separation and transportation ability. The photocatalytic activities for CO 2 reduction with water vapor over various photocatalysts were tested at 200 C.In this catalytic reaction system, the reactants are CO 2 and H 2 O, and the reduction products are CO (CO 2 2 H 2e - CO H 2 O) and CH 4 (CO 2 8 H 8e - CH 4 H 2 O).Before photocatalytic activity test, two sets of control experiments were carried out to prove that CO and CH 4 were produced by photocatalytic CO 2 reduction.Firstly, CO 2 gas were replaced by Ar gas (other conditions remain unchanged), and no CO or CH 4 was produced after two hours of reaction, confirming that CO and CH 4 products were derived from CO 2 .Secondly, no CO and CH 4 generated after two hours of reaction in the absence of light or photocatalyst, which proved that the reaction occurs under the coexistence of light irradiation and photocatalyst. Fig. 6 showed the production rate of CO and CH 4 after 2 h of reaction under simulated sunlight irradiation.The pure P25 has the lowest photocatalytic reduction activity of CO 2 , for which the production rate of CO is 0.51 mol/g/h and no methane was produced. After introducing Ag and Cu 2 O, the CO production rates increased by nearly 10 times to 5.21 and 6.26 mol/g/h, respectively.The increase of photocatalytic activity can be attributed to the enhancement of light absorption and the formation of heterojunction between TiO 2 and Cu 2 O or Ag, which improved the separation efficiency of photogenerated electrons and holes.Notably, no CH 4 product was detected for 1Cu 2 O/TiO 2 and 1Ag/TiO 2 samples.For 1Cu 2 O/TiO 2 sample, the self-reduction of Cu 2 O by the photo-excited electrons in the conduction band consumes part of the electrons and made it insufficient for the formation of CH 4 with 8-electron process.As for 1Ag/TiO 2 sample, the reason can be the small amount of photoexcited electrons due to the weak light absorption ability of TiO 2 .After the loading of Ag on 1Cu 2 O/TiO 2 sample, the electrons on Cu 2 O can transfer to Ag spontaneously, which further increased the electron hole separation efficiency and prevents the self-reduction of Cu 2 O, and consequently the photocatalytic activity can be improved greatly.Thus, 0.5Ag-0.5Cu 2 O/TiO 2 had the highest CH 4 production rate (1.74 mol/g/h) and CO production rate(13.19mol/g/h, 25 times that of bare P25). It is well known that the activity of photocatalyst is chiefly determined by the separation and transportation efficiency of photoexcited electron-hole pairs, apart from the influence of light absorption capability.In addition, the electron transfer pathways play an essential role in affecting the separation efficiency.To further explore the transfer direction of electrons between TiO 2 and Cu 2 O, EPR technology was taken to detect the presence of OH in the process of oxidizing H 2 O on 0.5Ag-0.5Cu 2 O/TiO 2 composite material under simulated sunlight.As shown in Fig. 7, the signal (peaks intensity 1:2:2:1) of the DMPO-OH was observed under the simulated sunlight irradiation and with the increasing light time, the signal intensity increased.However, the OH signal cannot be found under darkness.The results indicated that the VB holes of 0.5Ag-0.5Cu 2 O/TiO 2 composite material can oxidize H 2 O to hydroxyl radicals (OH). From the above characterization results, we can know that in this catalytic system, the VB holes oxidize H 2 O to hydroxyl radicals (OH) and H , andOH further reacts with H 2 O to generate O 2 (Eqs.( 3) and ( 4)), while H takes part in CO 2 reduction (Eqs.( 5) and ( 6)).(5) According to these processes, the photocatalytic activity will depend greatly on the amount and redox capacity of electrons and holes.The improvement of CO 2 reduction activity after the deposition of Cu"
  },
  {
    "title": "Conclusions",
    "content": "In summary, Ag-Cu 2 O/TiO 2 with Z-scheme heterojunctions was successfully constructed by one-step reduction method.The characterization of UV-vis DRS, PL and photocurrent response indicate that the absorption performance and photogenerated carrier separation efficiency can be effectively enhanced by incorporation of Ag and Cu 2 O.In the fabricated photocatalysts, only 0.5Ag-0.5Cu 2 O/ TiO 2 catalyst can catalyze the reduction of CO 2 to CH 4 and had much higher activity than pure P25, 1Cu 2 O/TiO 2 and 1Ag/TiO 2 for CO 2 reduction to CO.It has been revealed that the Z-scheme heterojunctions facilitate the charge separation between P25 and Cu 2 O, and Ag as the co-catalyst to trap the electrons of Cu 2 O, which further promoted the transfer of photogenerated carriers and inhibits the selfphotoreduction of Cu 2 O. Furthermore, Ag nanoparticles can also improve the absorption of visible light due to the surface plasmon resonance effect.By this way, the photocatalytic activity of 0.5Ag-0.5Cu 2 O/TiO 2 can be significantly enhanced. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. 5Cu 2 O/TiO 2 sample.It can be seen clearly from Fig. 2(d), the lattice fringes with the lattice spacing about 0.359 nm, 0.211 nm and 0.239 nm were found, which can be ascribed to the (101) plane of rutile TiO 2 , (200) plane of Cu 2 O and (111) plane metal Ag, respectively, confirming that Ag and Cu 2 O were successfully deposited on the surface of TiO 2 .In addition, the intimate lattice contact among TiO 2 , Cu 2 O and Ag can be observed from HRTEM image, where the Cu 2 O was distributed on the surface of TiO 2 and Ag was preferentially anchored on the surface of Cu 2 O.The above results illustrated that Ag-Cu 2 O/TiO 2 composites with heterojunctions have been successfully formed.The XPS was used to probe the surface chemical composition and state of elements in 0.5Ag-0.5Cu 2 O/TiO 2 .The survey spectra in Fig.3(a) confirmed the existence of Ti, Cu, Ag and O. High-resolution XPS spectra shown in Fig. 3(b) displays two XPS peaks at binding energies of 931.7 eV and 951.6 eV, which can be related to Cu 2p 3/2 and Cu 2p 1/2 , respectively, and no Cu 2p satellite peak appears in the region of 940-945 eV, further confirming the formation of Cu 2 O 55.The binding energies of O 1 s at 529.4 eV and 531.1 eV in Fig. 3(c) can be ascribed to the lattice oxygen in the P25 and Cu 2 O and the chemisorbed oxygen, respectively.The peaks located at 367.1 eV and 373.2 eV in Fig. 3(d) were characteristic of Ag 3d in metallic Ag 52,56.These results further indicated that metal Ag and Cu 2 O were deposited successfully on the surface of P25.Fig. 4(a, b) displayed the UV-Vis DRS of P25, 1Cu 2 O/TiO 2 , 0.5Ag-0.5Cu 2 O/TiO 2 and 1Ag/TiO 2 .Obviously, it can be seen from Fig. 4(a) that the absorption edge of P25 was close to 400 nm, which showed that P25 only absorbs light in the UV region.After the loading of Cu 2 O or Ag, the absorption edge of the sample presented a slight red shift, and the light absorption in visible region obviously increased.As shown in Fig. 4(b), when only Cu 2 O was deposited on the surface of P25, a new absorption peak appeared in the range of 400-500 nm, which can be attributed to the interfacial charge transfer (IFCT) 57 and the narrow band gap of Cu 2 O.With the addition of Ag Fig. 1.XRD patterns of P25, 1Cu 2 O/TiO 2 , Ag-Cu 2 O/TiO 2 and 1Ag/TiO 2 . Fig. 3. (a) XPS full spectra of 0.5Ag-0.5Cu 2 O/TiO 2 ; (b) Cu 2p spectra of 0.5Ag-0.5Cu 2 O/TiO 2 ; (c) O 1S spectra of 0.5Ag-0.5Cu 2 O/TiO 2 ; (d) Ag 3d spectra of 0.5Ag-0.5Cu 2 O/TiO 2 . c) showed the Mott-Schottky curves of P25, 1Cu 2 O/TiO 2 , 0.5Ag-0.5Cu 2 O/TiO 2 and 1Ag/TiO 2 .Apparently, after introducing Ag or Cu 2 O, the slopes of the curve were still positive, indicating that the catalysts were still n-type semiconductor and not affected by Cu 2 O as a p-type semiconductor.The electrode potential was converted to the standard hydrogen electrode (NHE) potential by means of formula (1): Fig. 5. (a) Photocurrent response of P25, 1Cu 2 O/TiO 2 , 0.5Ag-0.5Cu 2 O/TiO 2 and 1Ag/TiO 2 ; (b) PL spectra of P25, 1Cu 2 O/TiO 2 , 0.5Ag-0.5Cu 2 O/TiO 2 and 1Ag/TiO 2 ; (c) Mott-Schottky plots of P25, 1Cu 2 O/TiO 2 , 0.5Ag-0.5Cu 2 O/TiO 2 and 1Ag/TiO 2 ; (d) EIS Nyquist plots of P25, 1Cu 2 O/TiO 2 , 0.5Ag-0.5Cu 2 O/TiO 2 and 1Ag/TiO 2 . 2 O and Ag should be related to the increase of the separated electron amount and reduction ability of electrons.A compact composite of Cu 2 O and TiO 2 were shown in the HRTEM image of 0.5Ag-0.5Cu 2 O/TiO 2 , which can be inferred that the heterostructures existed between Cu 2 O and TiO 2 .According to the band edge positions of Cu 2 O and TiO 2 , two possible heterostructures may be formed at the interface considering the band structure of Cu 2 O and P25: II-type heterostructure and Z-scheme heterostructure.For the II-type heterostructures, the photoexcited electrons located at the CB of Cu 2 O would migrate to the CB of P25, while the holes would transfer to the VB of Cu 2 O from P25.As a result, the photoexcited electrons are gathered on the CB of P25 and holes are collected on the VB of Cu 2 O.Because of the more negative VB of Cu 2 O than that of OH/H 2 O (2.3 V vs. NHE), the Cu 2 O is unavailable for producing hydroxyl radicals and water oxidation reaction, which will lead to the inactive of photocatalyst with the II-type heterostructures for photocatalytic CO 2 reduction.Thus, in the present photocatalyst system, Z-scheme heterostructure was successfully formed, as shown in Scheme 1. P25 and Cu 2 O were concurrently photoexcited with the irradiation of simulated sunlight and the photoelectrons can transfer from the CB of P25 to the VB of Cu 2 O to recombine with the holes, which followed the Z-scheme charge transfer pathway.The holes enriched in the VB of P25 were used for the oxidation of H 2 O to generate O 2 and the electrons preserved in the CB of Cu 2 O were used for the reduction of CO 2 to form CO and CH 4 .Subsequently, the deposited Ag can further capture the electrons from the CB of Cu 2 O so that the self-reduction of Cu 2 O can be inhibited 57.In addition, the surface plasmon resonance effect of Ag nanoparticles can also improve the absorption of visible light.The synergistic effects of Cu 2 O and Ag promoted the stability and photoactivity of Ag-Cu 2 O/TiO 2 for CO 2 reduction under simulated sunlight irradiation. Conceptualization, Investigation, Formal analysis, Writing -original draft, Jiang Zhilin: Writing -original draft, Chen Haowen: Writing -review editing, Wang Kang: Supervision, Resources, Wang Xitao: Validation, Writing -review editing. The band gap and the positions of the conduction band and valence band. Fig. 6.Photocatalytic yield of CO and CH 4 .Fig. 7. EPR spectra of ZnTi-LDH. Journal of Alloys and Compounds 896 (2022) 163030 We appreciatively acknowledge the financial support from the National Natural Science Foundation of China (No. 21276190 and 20806059) and the Tianjin Natural Science Foundation (15 JCYBJC20900)."
  }
]