[
  {
    "title": "Doi",
    "content": "10.1088/1361-6528/aaa272"
  },
  {
    "title": "Article_Title",
    "content": "Zn<i><sub>x</sub></i>Cd<sub>1−<i>x</i></sub>S tunable band structure-directing photocatalytic activity and selectivity of visible-light reduction of CO<sub>2</sub>into liquid solar fuels"
  },
  {
    "title": "Abstract",
    "content": "A series of ZnxCd1-xS monodispersed nanospheres were successfully synthesized with tunable band structures.As-prepared ZnxCd1-xS solid solutions show much enhanced photocatalytic efficiency for CO2 photoreduction in aqueous solutions under visible light irradiation, relative to pure CdS analogue.Methanol (CH3OH) and acetaldehyde (CH3CHO) are the major products of CO2 photoreduction for the solid solutions with x 0, 0.2, and 0.5.Interestingly, Zn0.8Cd0.2Sphotocatalyst with a wide band gap can also additionally generate ethanol (CH3CH2OH) besides CH3OH and CH3CHO.The balance between the band structure-directing redox capacity and light absorption should be considered to influence both product yield and selectivity of CO2 photoreduction.The possible photoreduction mechanism was tentatively proposed."
  },
  {
    "title": "Experimental",
    "content": "All chemicals used in present experiment were of analytical reagent grade.Uniform ZnxCd1-xS solid solutions were prepared by a simple co-precipitation method.In a typical synthesis, take Zn0.5Cd0.5Sas example, 0.5 mmol of cadmium acetate Cd(CH3COO)22H2O , 0.5 mmol of znic acetate Zn(CH3COO)2 and 1 mmol of thiourea (NH2CSNH2) were dissolved in 30 ml of glycol containing 0.15 g of polyvinylpyrrolidone (PVP) under constant stirring for 10 min at room temperature.The obtained solution was then transferred into a Teflon-lined stainless steel autoclave with 50 mL capacity and maintained at 150C for 24 h.Finally, the product was separated and collected by centrifugation and washed with acetone and deionized water several times, respectively.The product was obtained after being dried by lyophilization. The morphology of samples was examined by the field emission scanning electron microscopy (FE-SEM) (FEI NOVA NanoSEM230, USA) and transmission electron microscopy (TEM) (JEOL 3010, Japan).Powder X-ray diffraction (XRD) was used to determine the crystallographic phase of these solid solutions with Cu-Ka radiation (RigakuUltima III, Japan).X-ray photoelectron spectroscopy (XPS) (K-Alpha, Thermo Fisher Scientific) measurements were calibrated with respect to the binding energy of the adventitious C1s peak at 284.5 eV.The UV-visible (UV-vis) absorption spectrum was obtained with a UV-vis spectrophotometer (UV-2550, Shimadzu, Japan). The photocatalytic reduction of CO2 was carried out in an airtight quartz glass reactor.A 300 W Xenon arc lamp equipped with an ultraviolet cutoff filter ( 400 nm) was used as the light source.The catalyst powder (0.1 g) was suspended in 200 mL of 1.0 M NaHCO3 solution (pH 8.0) under stirring.Before illumination, high purity of CO2 gas (99.99) was bubbled through the stirred solution at a constant rate for 30 min to eliminate the air and to saturate the solution.Then the reactor was tightly closed and the Xe lamp was switched on.During the reaction, 2 mL of suspensions were sampled and the products were analyzed by a gas chromatograph (FID detector, 7890A, Agilent)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The XRD patterns show that all the diffraction peaks of ZnxCd1-xS solid solutions with different compositions match well to a cubic phase (Figure 1).Three main diffraction peaks can be assigned to (111), (220), and (311) planes.Facile formation of ZnxCd1-xS solid solutions is as the result of easy incorporation of Zn 2 into the CdS lattice due to similar coordination mode between Zn 2 and Cd 2 . 17he diffraction peaks of ZnxCd1-xS exhibit a consecutive shift toward the higher angle with increasing Zn mole fraction, because of the larger radius of Cd 2 ion (0.97 A) than Zn 2 ion (0.74 A).The significant peak shift demonstrates the formation of the ZnxCd1-xS solid solutions, rather than physical mixture or composite of ZnS and CdS.A gradual decrease in the (111) lattice distance of the ZnxCd1-xS solid solution is observed as the Zn mole fraction (x) increases (Figure S2).This trend is consistent with Vegard's law and indicates a homogeneous structure. 18According to Furdyna, Vegard's law was applied to check the compositional homogeneity in both bulk and nanocrystals. 19The XPS of Zn0.5Cd0.5Sshows two typical peaks of Zn 2p located at approximately 1021.1 eV and 1044.5 eV, corresponding to binding energy of Zn 2P 3/2 and Zn 2P 1/2, respectively, which are attributed to the Zn 2 species (Figure S3).The binding energy at 411.0 eV and 402.2 eV can be assigned to Cd 3d.The binding energy for S 2p is located at 160.7 eV and 162.0 eV, indicating the valence states of S 2-.The FE-SEM image shows that the as-synthesized Zn0.5Cd0.5Sdisplays uniform spherical morphology with an average diameter of 50 nm (Figure 2).The magnified image reveals that the nanosphere actually consists of considerable number of aggregating tiny nanoparticles with a size of 3-7 nm (Figure 2b).The TEM image shown in Figure 3 also confirms the spherical architecture.The magnified TEM images further reveal that the nanosphere is indeed built of a well-defined, assembled packing of small-sized blocks (Figure 3a).The measured spacing of lattice fringe is about 0.33 nm, which can be assigned to the (111) lattice plane (Figure 3b).The clear ring of the corresponding selected area electronic diffraction (SAED) pattern proves high nanocrystallinity and small size of the Zn0.5Cd0.5Sbuilding blocks (the inset in Figure 3b).All the other ZnxCd1-xS (x 0, 0.2, 0.8, and 1) displays the above similar spherical morphology and size, indicating that the introduction of Zn 2 shows nearly no effect on the nucleation and growth of CdS.Furthermore, the metal element compositions of obtained solid solutions were very close to their stoichiometric composition according to those reported in the literature.For a semiconductor, the value of the optical band gap can be estimated conveniently from the results of UV-vis absorption measurement.The bandgap energy of the solid solution was estimated by extrapolating the straight portion of the (hv) 2 versus photon energy (hv) curve to 0 according to the Kubelka-Munk function. 21According to the interband absorption theory, the absorption coefficient and the incident photon energy h should meet the following equation: where K is a constant, Eg is the band gap energy of the semiconductor and the exponent n has value 2 for the ZnxCd1-xS solid solutions.Figure 4b In order to further determine the band structure of the ZnxCd1-xS, the positions of conduction band (CB) and valence band (VB) in relation to the normal hydrogen electrode potential (NHE) are calculated using the following equation: 22 where ECB is the CB potential, EVB is the VB potential, is the electronegativity, E e is a constant as 4.5 eV, Eg is the band gap of the semiconductor calculated by the above-mentioned method.The estimated CB and VB band potential of the ZnxCd1-xS were plotted in While UV light with energy accounts for less than 5 in the total solar spectrum, the visible-light ( 400 nm) photocatalytic CO2 reduction of the ZnxCd1-xS was evaluated in the presence of CO2saturated 1.0 M NaHCO3 aqueous solution.The UV-vis transmission spectrum of 400 nm cut-off filter is shown in Figure S4. Figure 6 shows the generation rate of different carbon species over the ZnxCd1-xS with various Zn mole fraction.CH3OH and CH3CHO were detected as the major products of the CO2 photoreduction.The photoreduction of CO2 to CH3CHO involves 10 photogenerated electrons, and the reaction to form CH3OH requires 6 electrons (Eqs.4-8).The pure CdS displays the solar fuel production rate of 3.8 mol g -1 h -1 (CH3OH) and 3.4 mol g -1 h -1 (CH3CHO).The pure ZnS photocatalyst with the wide band gap shows no photocatalytic activity under applied visible light.For ZnxCd1-xS solid solutions, introduction of Zn obviously enhanced CO2 conversion efficiency, relative to pure CdS.Thermodynamically and kinetically, the ZnxCd1-xS possess stronger redox capacity and driving force of charge carriers than CdS in promoting the photoreduction of CO2.Zn0.2Cd0.8Sshows higher photocatalytic yield than Zn0.5Cd0.5S.It is probable that more Zn content in the Zn0.5Cd0.5Ssolid solution results in a larger band gap, which is unfavorable for the light absorption.In contrast, the Zn0.2Cd0.8Scan provide more electrons for the reaction due to the narrow band gap with stronger light absorption.When x increases to 0.8, the conduction band edge increases to -0.66 eV, which means a higher reduction capacity of the obtained Zn0.8Cd0.2S.As shown in Figure 6, the Zn0.8Cd0.2Shas a low CH3OH production rate of 2.5 mol g -1 h -1 , about one-sixth of that of the major product CH3CHO.Besides, a more amount of CH3CH2OH ( 6.0 mol g -1 h -1 ) was also detected.The photocatalytic CO2 reduction mechanism is actually complex.The balance between the reduction capacity and light absorption ability should be comprehensively considered for the high-efficient photoreduction of CO2.Higher overall production rate of Zn0.8Cd0.2Sthan Zn0.5Cd0.5S,possibly originates from that reduction ability dominantly determine the product yield compared to light absorption.The possible photoreduction mechanism of CO2 was proposed in the following way (Eqs.4-8).Illumination of ZnxCd1-xS with visible light yields photon generated electrons (e -) and holes (h ) on the CB and VB of the solid solution, respectively.The excited holes react with adsorbed water molecules on the catalyst surface to produce H and O2 (Eq.4).The electron reduces CO2 to form the formic acid (HCOOH) (Eq.5).The HCOOH was further reduced to formaldehyde (HCHO), CH3OH and CH3CHO (Eqs.6-8).Under the present basic solution (pH 8.0) with H deficient system, possible C1 intermediate species, such as C, CH, and CH3, 23 may prefer to anchor on the surface of the photocatalyst and form C2 compounds i.e.CH3CHO or C2H5OH through dimerization. 24,25For the present Zn0.8Cd0.2S, it is suspected that the high reduction capacity of photogenerated electrons may create a large number of those intermediates, which greatly promotes the dimerization reaction to yield both CH3CHO and C2H5OH. 9,26The photocatalytic CO2 reduction mechanism is actually complex and needs further investigation.A CO2 reduction experiment performed in the dark showed no appearance of solar fuel, proving that the energy stored in the products is converted from the light energy.H2O 2h H O2 (4) CO2 (aq) 2H 2e HCOOH (5) HCOOH 2H 2e HCHO ( 6) CO2 HCOOH 8H 8e CH3CHO 3H2O Considering the different combustion heat of products, the solar energy conversion efficiency of as-prepared ZnxCd1-xS was calculated based on Eq. 9. Conversion efficiency , 0 r i (9) in which H 0 c is the molar heats of combustion and r is the generation velocity of each product.With the increase of the Zn mole fraction, the ZnxCd1-xS solid solutions exhibit obviously enhanced efficiency, relative to pure CdS.The highest efficiency of 0.016 was achieved for Zn0.8Cd0.2S,about 4 times as large as that of pure CdS."
  },
  {
    "title": "Conclusions",
    "content": "A series of ZnxCd1-xS (x0, 0.2, 0.5, 0.8, and 1) solid solutions with the similar spherical morphology was successfully synthesized.All the solid solutions (x0.2, 0.5, 0.8) show enhanced efficiency for CO2 photoreduction into CH3OH and CH3CHO in aqueous solutions.The Zn0.8Cd0.2Scan also promote the formation of C2H5OH.The highest efficiency of 0.016 was achieved for Zn0.8Cd0.2S.The concluded balance between the bandgap structure-directed redox capacity and light absorption may give a useful clue for exploration of efficient photocatalysts with high selectivity for CO2 photoreduction. A c c e p t e d M a n u s c r i p t Figure 1.XRD patterns of ZnxCd1-xS solid solutions with different x values: (a) CdS, (b) Zn0.2Cd0.8S,(c) Zn0.5Cd0.5S,(d) Zn0.8Cd0.2S,(e) ZnS. Figure 2. FE-SEM images of the Zn0.5Cd0.5Snanospheres at different magnifications. Figure 3. (a) TEM, (b) HRTEM images of Zn0.5Cd0.5Snanospheres and the inset of the corresponding SAED patterns.As shown in Figure4a, pure CdS exhibits a sharp absorption edge rising at 520 nm, and the absorption edge of pure ZnS is located at 350 nm.The absorption edges of the ZnxCd1-xS solid solution are distributed between those of CdS and ZnS, and gradually blue shift with the increasing of Zn mole fraction.The blue shift should be attributed to the shift of the band gap.It further proves that the as-prepared Zn-Cd sulfides are solid solutions rather than physical mixture of CdS and ZnS. Figure 4. (a) UV-vis absorption spectra and (b) Tauc plot of ZnxCd1-xS solid solutions with different x values. shows the Tauc plot of the ZnxCd1-xS solid solutions with different x values.The band gap of pure CdS was calculated 2.46 eV, and gradually increases to 2.56 eV (x 0.2), 2.66 eV (x 0.5), and 2.80 eV (x 0.8) with the increasing content of Zn atoms.It demonstrates that the incorporation of Zn atoms in the solid solution enlarges the band gap, and subsequently enhances the redox ability of photogenerated carriers.The band gap of pure ZnS was estimated to be 3.66 eV. Figure 5. Conduction and valence band potential of the ZnxCd1-xS solid solutions with different x values. The CB potentials of all the ZnxCd1-xS lie at a more negative potential than reduction potential of CO2, and VB potentials at more positive potential than oxidation potential of water of H2O 1/2O2 2H 2e (E o redox0.82V vs. NHE).It demonstrates the A c c e p t e d M a n u s c r i p t capability of ZnxCd1-xS to convert CO2 into solar fuels in the presence of water as electron donors. Figure 6.Solar fuel production rates for the ZnxCd1-xS solid solutions with different x values under visible-light ( 400 nm) irradiation. This work was supported by 973 Programs (No. 2014CB239302 and 2013CB632404), NSF of China (No. 21473091, 21603183, and 21673001), NSF of Jiangsu Province A c c e p t e d M a n u s c r i p t"
  }
]