[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2016.01.044"
  },
  {
    "title": "Article_Title",
    "content": "Thickness-ultrathin and bismuth-rich strategies for BiOBr to enhance photoreduction of CO 2 into solar fuels"
  },
  {
    "title": "Abstract",
    "content": "Bi4O5Br2 microsphere assembled by ultrathin nanosheets was firstly synthesized via a glycerol precursor route, and showed excellent photocatalytic reduction activities for CO2 conversion to solar fuels under visible light due to the thickness-ultrathin and bismuth-rich strategies. Highlights Bi4O5Br2 was synthesized via a glycerol precursor route. Bi4O5Br2 showed excellent photocatalytic reduction activities for CO2 conversion. Thickness-ultrathin and bismuth-rich strategies results in enhanced photoactivity."
  },
  {
    "title": "Experimental",
    "content": "Bi(NO3)35H2O, KBr, ethanol, cetyl trimethyl ammonium bromide (CTAB) and glycerol were analytically pure and purchased from Sinopharm Chemical Reagent Co., Ltd (Shanghai, China). Complex precursor: KBr (2 mmol) was dissolved into 20 mL glycerol, and 2 mmol Bi(NO3)35H2O was dissolved into another 20 mL glycerol.Then, KBr solution was added into the Bi(NO3)35H2O solution drop by drop with continuously stirring.The suspension was transferred into Teflon-lined stainless steel autoclaves (50 mL) and kept at 160 C for 16 h.After reaction, the complex precursors precipitate was obtained by centrifugation, and then washed with ethanol.Finally, it was dried at 80 C under air atmosphere. Bi4O5Br2 microspheres: Complex Precursor (0.3 g) was dispersed in 100 mL deionized water.Then, Bi4O5Br2 sample was obtained via a simple hydrolytic process, and washed successively with deionized water.Finally, it was dried at 80 C and thermal treatment at 200 C about 3 h. The synthesis process is the same as that of complex precursors except using ethanol as solvent. Ultrathin BiOBr: The synthesis process is the same as that of complex precursors except using ethanol as solvent and CTAB as bromine source.UV-vis diffuse reflectance spectra (DRS) were obtained using a UV-Vis spectrometer (Perkin Elmer, Lambda 650s, BaSO4 as a reference).Photoluminescence (PL) spectra (360 nm excitation) and time-resolved PL spectra (255 nm excitation) recorded by a FLS920 Multifunction Steady State and Transient State Fluorescence Spectrometer (Edinburgh Instruments room temperature). The Brunauer-Emmett-Teller (BET) surface areas were measured using a quantachrome autosorb-1 automated gas adsorption systems at 77 K. The photocatalytic reduction of CO2 was carried out in Labsolar-IIIAG closed gas system (Beijing Perfect Light Technology Co., Ltd China).1.3 g NaHCO3 was added at the bottom of reaction (350 mL) firstly.Then, 0.15 g of the Bi4O5Br2, ultrathin BiOBr or BiOBr was uniformly dispersed onto a watch-glass with an area of 28.26 cm 2 , and then the watch-glass was put in a reaction cell (Pyrex glass).. Prior to the light irradiation, the above system was thoroughly vacuum-treated to remove the air completely, and then 5 mL 4 M H2SO4 was injected into the reactor to react with NaHCO3 to achieve 1 atm CO2 gas.After that, the reactor was irradiated from the top by a 300 W high pressure xenon lamp (PLS-SXE300C, Beijing Perfect Light Technology Co., Ltd China) with 400 nm filter, and the photoreaction temperature was kept at 20 C by DC-0506 low-temperature thermostat bath (Shanghai Sunny Hengping Scientific Instrument Co., Ltd China).During the irradiation, 1 mL of gas was taken from the reaction cell for subsequent qualitative analysis by GC9790II gas chromatography (GC, Zhejiang Fuli Analytical Instrument Co., Ltd China) equipped with a flame ionization detector (FID, GDX-01 columns).The quantification of the production yield was based on a calibration curve.The outlet gases were determined to be CO, CH4 and CO2. First-principles studies were carried out using plane-wave method as implemented in the Vienna ab initio simulation package (VASP) 34,35.The Perdew-Burke-Ernzerhof (PBE) function with the generalized gradient approximation (GGA) was used to describe the ionelectron interaction and the core electrons were described by the full-potential projector augmented wave (PAW) method with an energy cutoff of 500 eV for the plane-wave expansion 363738.Geometry optimization was performed using the conjugate gradient algorithm until the force on each atom was less than 0.03 eV/A, and the spin polarization was considered. Integrations in the Brillouin zone were performed using k-point grid generated with the Monkhorst-Pack grid."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Figure 2 shows the XRD patterns of BiOBr (BET: 6.2 m 2 g -1 ), complex precursor, Bi4O5Br2 (BET: 11.4 m 2 g -1 ), and the standard XRD pattern of PDF: 00-037-0699.For BiOBr, it was observed that the XRD pattern was in agreement with previously reported results 16, which were indexed with the standard tetragonal BiOBr structure (JCPDS 00-09-0393, space group: P4/nmm, unit cell parameters: a b 0.3926 nm, and c 0.8103 nm).The XRD pattern of ultrathin BiOBr (BET: 13.7 m 2 g -1 ) was showed in Figure S1.All the XRD peaks were indexed with BiOBr structure (JCPDS 00-09-0393).The larger half peak width of (001) peak indicated that the thickness of ultrathin BiOBr was much smaller than that of BiOBr.The XRD pattern of solvothermal product was not indexed in data base.However, Bi4O5Br2 was obtained by hydrolyzing the solvothermal product.Therefore, the solvothermal product was called as complex precursor.For Bi4O5Br2, it was observed that the XRD pattern was in agreement with the standard XRD pattern of PDF: 00-037-0699, with the standard monoclinic structure (space group: P21, unit cell parameters: a 1.452 nm, b 0.5625 nm, and c 1.083 nm, 90.0, 97.6). The morphology and element information of Bi4O5Br2 and BiOBr were shown in Figure 3. It was found that complex precursor was in a structure of microsphere with a diameter of about 1 m.The microspheres were assembled by nanoparticles.After hydrolyzing, complex precursor was transformed into Bi4O5Br2.As shown in Figure 3b, the as-synthesized Bi4O5Br2 were also microspheres with a diameter of about 1 m.However, the Bi4O5Br2 microspheres were assembled by ultrathin nanosheets instead of nanoparticles.For comparison, the FESEM image of BiOBr is shown in Figure 3c.The size of BiOBr nanosheets were about 2.5 m 65 nm.In order to confirm the composition of Bi4O5Br2, the energy dispersive spectrometer (EDS) characterization of Bi4O5Br2 and BiOBr were compared as shown in Figure 3d.It was observed that the Bi/Br atom ratio of Bi4O5Br2 and BiOBr were 2:1 and 1:1, respectively.They were in agreement with their theoretical value, indicating that the XRD analysis was reliable.29,30.Furthermore, the peak areas of Bi 4f of Bi4O5Br2 and BiOBr were equal.However, the Br 3d peak area of BiOBr was two times larger than that of Bi4O5Br2.These results were in agreement with the atomic ratio of Bi/Br (2.1:1.0 for Bi4O5Br2 and 1.0:1.0 for BiOBr), which were tested by X-ray photoelectron spectroscopy.More importantly, it indicated that the as-synthesized Bi4O5Br2 sample was a new bismuth-rich Bi-O-X photocatalyst. The clear microsphere structure of Bi4O5Br2 was displayed by TEM image (Figure 5a).The size (ca. 1 m) and the second structure (ultrathin nanosheets) of Bi4O5Br2 were the same as the SEM picture.The thickness was 3.65 nm, which was much less than that of BiOBr nanosheets (65 nm).It has been reported that BiOX had thickness dependent photocatalytic activity.For example, ultrathin BiOCl nanosheets (ca. 3 nm) showed higher photocatalytic activity than bulk BiOCl (30 nm) for H2 generation.41 Therefore, the ultrathin structure of Bi4O5Br2 probably resulted in excellent photocatalytic reduction activity.Figure 5b shows the high resolution TEM image of the side view of single Bi4O5Br2 nanosheet.The lattice spacing of 0.91 nm was indexed to the 10-1 facets.It indicated that the two square facets (top and bottom facets) of Bi4O5Br2 nanosheets were 10-1 facets, and the exposure percentage was more than 90. Figure S2 shows the TEM images of ultrathin BiOBr sample.It was observed that the thickness was about 3.9 nm and the lattice spacing of 0.81 nm was indexed to the 001 facets of BiOBr.It was observed that Bi4O5Br2 and BiOBr had absorption in the visible light region but different absorption edges.The absorption edge of Bi4O5Br2 was about 510 nm, which was greater than that of BiOBr (425 nm).These results are consistent with the light yellow and yellow colors of BiOBr and Bi4O5Br2, respectively.The band gap energy of BiOBr and Bi4O5Br2 were evaluated by the following equation: 16 hva(hv-Eg) n/2 (1) where , h, v, a, and Eg represent the absorption coefficient, planck constant, light frequency, energy-independent constant, and band gap (Eg values), respectively.For indirect transition of bismuth-based photocatalysts, n is 4 for BiOBr and Bi4O5Br2.As shown in the inset of Figure 6, Eg of Bi4O5Br2 and BiOBr were estimated at about 2.43 and 2.91 eV, respectively. Therefore, Bi4O5Br2 could be excited by visible light effectively.Figure 6 here At present, bismuth-based photocatalysts were rarely reported for photocatalytic reduction of CO2 conversion 42,43.The main reason is the low CBM, especially for BiOX.It was known that photocatalytic reduction activities depend on the CBM position.The lower the CBM resulted in lower the photocatalytic reduction activity.To adjust the CBM position of BiOX, some latest works showed that bismuth-rich strategy could advance the CBM position 2728293031, with many relevant reports supported.Therefore, as a bismuth-rich Bi-O-X photocatalyst, Bi4O5Br2 could be used for photoreduction of CO2 into solar fuels.The control experiments (Figure S3) indicated that CO2 could not be converted into energy gases (such as CH4 or CO) without photocatalysts, light or CO2 gases.And the H2O-control data showed that H2O was very important for CO2 reduction.In the absence of H2O, the CO production was decreased and no CH4 was detected.When Bi4O5Br2, ultrathin BiOBr or BiOBr was added, CO and CH4 can be detected (Figure 7).It was shown that the generation of CO and CH4 by Bi4O5Br2 is about 2.73 and 2.04 mol g -1 h -1 , which were much more than that by ultrathin BiOBr (CO: 2.67 mol g -1 h - 1 ; CH4: 0.16 mol g -1 h -1 ) and BiOBr (CO: 1.68 mol g -1 h -1 ; CH4: 0.17 umol g -1 h -1 ).It indicated that the thickness-ultrathin and bismuth-rich strategies of Bi-O-Br improved the photocatalytic reduction activity intensely.However, thickness-ultrathin and bismuth-rich strategies played different roles.As shown in Figure 7d, it was observed that thickness-ultrathin strategy increased the CO generation while bismuth-rich strategy increased the CH4 generation.Namely, in Bi4O5Br2 system, CO2 was reduced to CO and CH4 simultaneously in the presence of water vapour.After 4 h hibernation, Bi4O5Br2, ultrathin BiOBr and BiOBr showed the same photocatalytic activity for CO2 conversion when light on.Figure S4 showed the effect of light intensity.It can be seen that the photocatalytic activity of Bi4O5Br2 enhanced with the light intensity increasing.Furthermore, after four repeated experiments (Figure S5), the generations of CO (2.46 mol g -1 h -1 ) and CH4 (1.93 mol g -1 h -1 ) by Bi4O5Br2 also were very high.It indicated that Bi-O-Br samples were stable photocatalysts for CO2 photoreduction.axis by polarizing the related orbitals and atoms. In previous works, it has been proved that the interlayer spacing and the thickness of Bi-O-X nanosheets can affect the internal electric field intensity along the layered crystal growth direction, leading to the different separation efficiency of photo-generated electrons and holes. The above TEM and SEM images showed that the thickness of layered Bi4O5Br2 was much less than that of BiOBr.The interlayer spacing of Bi4O5Br2 (namely d10-1, 0.91 nm) was larger than that of BiOBr (namely d001, 0.81 nm).Therefore, Bi4O5Br2 had larger spatial polarization, which resulted in higher separation efficiency of photo-generated carriers than BiOBr.Figure 10 displayed the PL spectra of Bi4O5Br2 and BiOBr, which was used to estimate the separation efficiency of photo-generated carriers.The lower PL intensity of Bi4O5Br2 implied that the separation efficiency of photo-generated carriers should be higher than BiOBr.44 In addition, the lifetime of charge carriers of Bi4O5Br2 (1 0.98 ns; 2 3.64 ns) also higher than that of BiOBr (1 0.69 ns; 2 2.13 ns).This restricted lifetime also means the increased separation efficiency of photoinduced carriers by thickness-ultrathin and bismuth-rich strategies.Therefore, Bi4O5Br2 showed higher photocatalytic activities for CO2 conversion. The above photocatalytic mechanism discussion started from the thickness-ultrathin of Bi4O5Br2 nanosheets, which affected the separation efficiency of photo-generated carriers. Besides, the bismuth-rich strategy affected the CBM potential of Bi-O-Br.As shown in Figure 11, the theoretical calculation showed that the CBM of Bi4O5Br2 was higher than that of BiOBr. This result was consistent with previous studies 41.As a result, Bi4O5Br2 had enhanced photocatalytic reduction activity for photoreduction of CO2 into solar fuels under visible light irradiation. ) of the samples were recorded at room temperature (ca. 25 C) by a Bruker D8 advance X-ray diffractometer using Cu K radiation and 2 scan rate of 6 min -1 .Diffraction patterns were recorded over the 2 range of 5-70.Field emission scanning electron microscopic (FESEM) images were obtained by a Sigma Zeiss field emission scanning electron microscope.Transmission electron microscopic (TEM) and high-resolution transmission electron microscopic (HRTEM) images were obtained by a JEOL JEM-2100 (RH) field emission Electron microscope.X-ray photoelectron spectroscopy (XPS) measurements were carried out by a Thermo ESCALAB 250XI X ray photoelectron spectrometer (Al Ka, 150 W, C1s 284.8 eV). photoreaction under different monochromatic light wavelengths (420, 450, 475, 500, 525 and In order to analyze the valence state of all atoms and to confirm the Bi/Br atom ratio of Bi4O5Br2 and BiOBr, the XPS spectra of Bi4O5Br2 and BiOBr are shown in Figure4.As shown in Figure4a, the XPS peaks of Bi 4f7/2 and Bi 4f5/2 of Bi4O5Br2 and BiOBr were at 159.39 and 164.67 eV, respectively.It implied that Bi atoms in Bi4O5Br2 and BiOBr were Bi 339,40. Figure4bshows the XPS peaks of Br3d of Bi4O5Br2 and BiOBr.Two strong peaks at 69.42 and Figure6shows the UV-Vis diffuse absorption spectra of Bi4O5Br2 and BiOBr nanosheets. Figure 8 showed the DRS spectrum of Bi4O5Br2 along with the AQY of solar fuels (CO"
  },
  {
    "title": "Conclusions",
    "content": "photocatalytic reduction activity for CO2 conversion under visible light irradiation.It indicated Figure 3. FESEM images of complex precursor (a), Bi4O5Br2 (b), BiOBr (c), and EDS spectra of Bi4O5Br2 and BiOBr. Figure 7. Photocatalytic reduction activity for CO2 conversion: (a) BiOBr; (b) ultrathin BiOBr; (c) Bi4O5Br2 and (d) comparison of solar fuels generation. Figure 9.The simulated structure (3 3) and charge density contour plots (100 surface) for Figure 11.Total DOS and partial DOS of Bi4O5Br2 (a) and BiOBr (b). This work was supported by the National Natural Science Foundation of China (No. U1404506, 51502146), Natural Science Foundation of Henan Department of Science Technology (No. 142102210477), Natural Science Foundation of Henan Department of Education (No. 14A150021), Natural Science Foundation of Nanyang Normal University (No. ZX2014039) to L Ye, and General Research Fund (GRF14100115) from Research Grant Council and ITSP Tier 3 Scheme (ITS/216/14) from Innovation Technology Commission of Hong Kong SAR Government.P.K. Wong was also supported by the CAS/SAFEA International Partnership Program for Creative Research Teams of Chinese Academy of Sciences, China."
  }
]