[
  {
    "title": "Doi",
    "content": "10.1016/j.jcis.2020.06.035"
  },
  {
    "title": "Article_Title",
    "content": "Enhanced light utilization efficiency and fast charge transfer for excellent CO2 photoreduction activity by constructing defect structures in carbon nitride"
  },
  {
    "title": "Abstract",
    "content": "The midgap states and amino groups resulted from bulk phase N defects and surface C defects synergistically catalyze the photocatalytic reduction of CO 2 to hydrocarbon fuels."
  },
  {
    "title": "Experimental",
    "content": "Urea (AR), Polyethyleneimine (M.W. 70000, 50 aqueous solution, PEI 70000 ), PEI 10000 (99), PEI 1800 (99), and PEI 600 (99) were purchased from Aladdin Chemistry Co., Ltd.; ethanol (AR) was purchased from Sinopharm Chemical Reagent Co., Ltd.; CO 2 (99.99),CO (99.99), and CH 4 (99.99)were obtained from Nanjing Special Gas Factory Co., Ltd. The g-CN based catalysts were prepared as follows: 20 g urea and a certain amount of PEI 70000 were placed in a crucible, heating the mixture to 150 C under stirring until a clear solution was obtained.After cooling down, the mixture was heated to 550 C with a heating rate of 5 C min A1 and holding for 2 h.After cooling to room temperature, the yellow (brown) solid was ground into fine powder for further use.The obtained solid was denoted as u-xPEI, where x represents the amount of PEI.For instance, u-0.01PEI means that 0.01 g PEI is used in the polymerization of the catalyst.The graphic illustration of u-xPEI preparation procedure is displayed in Scheme 1. PEI with various molecular weight were used to prepare catalysts, and labeled as u-xPEI-1 (PEI 600 ), u-xPEI-2 (PEI 1800 ), u-xPEI-3 (PEI 10000 ), respectively. The g-CN was prepared by direct thermal treatment of urea at 550 C for 2 h with a heating rate of 5 C min A1 without adding PEI. X-ray diffraction (XRD) was recorded from 5 to 60with a scanning rate of 10min A1 , using a Rigaku X-ray diffractometer (Japan) equipped with Cu Ka radiation (40 KV,200 mA).Fourier transform infrared (FT-IR) characterization was performed using a Nicolet Magna-IR 550 spectrometer with KBr as the reference sample in the wavenumber range of 400-4000 cm A1 .N 2 absorption-desorption was carried out on a MicroActive TriStar II Plus 2.02 instrument, and degased for 12 h at 200 C before test.Transmission electron microscopy (TEM) was performed on a Tecnai G2 F30 S-TWIN transmission electron microscopy (America) with an accelerating voltage of 200 kV.Photoluminescence (PL) spectra were obtained on a Hitachi F4500 photoluminescence detector.Transient photocurrent and electrochemical impedance spectroscopy (EIS) tests were performed on a Zahner CHI 852C electrochemical workstation (Germany).UV-vis diffuse reflectance spectra (UVvis DRS) measurements were carried out on a Shimadzu UV-3600 spectrometer.X-ray photoelectron spectroscopy (XPS) characterization was performed on a Thermo Fisher Scientific ESCALAB 250Xi X-ray photoelectron spectrometer, and Mg Ka radiation (1253.6 eV) was used as the X-ray source. The activity of the catalysts was studied by the photocatalytic reduction of CO 2 .The reduction reaction was carried out in a homemade closed quartz reactor (300 mL) using ultraviolet (UV) lamp (254 nm, 40 lW/cm 2 , 4 W) as a light source.Typically, 20 mg of catalyst and 100 mL of deionized water were placed in the reactor, which was thoroughly purged with CO 2 for 15 min to remove air before light irradiation.During the reaction, the gas sample was taken from the reactor using a sampling device every 1 h.The analysis of the gas samples was performed on a gas chromatograph (GC5890, Nanjing kejie instrument) equipped with a flame ionized detector (FID) and methanation equipment."
  },
  {
    "title": "Results_and_Discussion",
    "content": "In view of the crucial roles of the defect and porous structures in the photocatalytic reactions, in this work, we introduced defects and pores simultaneously into the structure of g-CN by copolymerizing of urea with PEI.During the reaction PEI served as both polymerization monomer and pore making agent.The structures and functional groups of the prepared catalysts were investigated in detail and displayed in Fig. 1.The crystal structures of the prepared catalysts were characterized using powder XRD (Fig. 1a).All samples present two peaks at 13.0 and 27.2, corresponding to the inplane repeating unit of tri-s-triazine and the interlayer stacking of conjugated aromatic system of g-CN, respectively 41,42.This result implies that the main structure of g-CN is maintained after the introduction of PEI.However, in comparison with g-CN, the (1 0 0) and (0 0 2) peaks of u-xPEI become smaller and broader with increasing PEI amount, and the (1 0 0) peak of u-0.15PEI is almost disappeared, indicating the out-of-order stacking of tri-striazine motifs 43,44.The high-resolution XRD patterns of the prepared catalysts are displayed in Fig. 1b.Interestingly, it is found that the diffraction angle (2h) of g-CN at 27.2changes with increasing PEI amount, which firstly shifts to higher 2h, and maximizes to 27.5for u-0.05PEI, then it shifts to lower 2h, and minimizes to 27.2for u-0.15PEI.The changes of the 2h of g-CN was also reported by other researchers 45.The above results suggest that the introduction of PEI partially destroies the crystal structure of g-CN.During the synthesis process of u-xPEI, the presence of PEI partially disturbs the polymerization procedure of urea and lead to the formation of defects and special pores in u-xPEI structures, which are well reflected by the changes of XRD. Raman spectra were obtained to further confirm the formation of defect structures in u-0.05PEI, as shown in Fig. 1c.The Raman spectra of g-CN present four peaks at 707, 752, 798, and 1232 cm A1 which are the characteristic peaks of pristine carbon nitride 46,47, indicating the successful preparation of carbon nitride.However, these characteristic peaks are almost undetectable after the incorporation of PEI, accompanying by the presence of some new peaks.The reduced peaks indicate the disordered structure of u-0.05PEI, implying that some crystal structures of g-CN are destroyed due to the incorporation of PEI.The peak at 1150 cm A1 is attributed to CAN bonds 45, suggesting that new CAN bonds are formed during the co-polymerization of urea with PEI.Furthermore, the new peak at 1345 cm A1 is assigned to the D band which is arisen from the surface defect and disorder on the layer plane 13.The results of Raman spectra are in accordance with XRD analysis and verify the formation of defect structures in u-xPEI. The porous structures of the prepared catalysts were examined by TEM and N 2 adsorption-desorption isotherms.The TEM image of u-0.05PEI presents amorphous morphology with ample pores inside its structure (Fig. 1d), indicating the porous feature of the sample.The ample pores in g-CN structure may originate from the decomposition of PEI at elevated polymerization temperature.The N 2 adsorption-desorption isotherms show that g-CN displays a small hysteresis loop between P/P 0 0.85-1.0,implying the poor pore structure of g-CN (Fig. 1e).However, u-0.05PEI presents a large hysteresis loop between P/P 0 0.39-1.0,suggesting that the copolymerization of urea with PEI introduces large amounts of mesopores into the structure of u-0.05PEI.The pore size distribution analysis shows that the pore size of the generated mesopores is about 2.78 nm (inset of Fig. 1e).The massive pores derived from the destruction of u-0.05PEI structure can not only lead to the generation of enormous channels for mass transfer but also result in the formation of numerous defects and amino groups which are beneficial for enhancing the photocatalytic performance of the catalysts 1,5. To figure out the variation of surface functional groups on g-CN due to the introduction of defect structures, FT-IR spectra of g-CN and u-0.05PEI were obtained and displayed in Fig. 1f.Both samples present characteristic peaks at 810, 1201-1636, and 3070-3450 cm A1 , corresponding to the breathing modes of tri-striazine heterocycles 13, stretching modes of g-CN aromatic heterocycles 48, and vibrating modes of amino groups (or adsorbed water) 49, respectively.The similar FT-IR spectra suggest that the functional groups of g-CN are well retained after the introduction of PEI.The small peak located at 2180 cm A1 in both samples is attributed to the cyano groups which are derived from the incompletely condensed g-CN 40.The strong electron-withdrawing ability of cyano groups may change the charge carrier separation and transferability of g-CN 50.Moreover, the vibration bands at 3266 and 3168 cm A1 of u-0.05PEI are more intense compared with that of g-CN, demonstrating that the introduction of defect structures can increase the amino group content of u-0.05PEI which is beneficial for CO 2 adsorption and activation.Considering the rising amino groups content, the defects in u-0.05PEI are speculated to be C defects. To get insight into the type of defects in u-xPEI, XPS information of g-CN and u-0.05PEI was obtained and presented in Fig. 2. The XPS survey spectra of both samples present only C, O, and N three elements, implying that no extra element is introduced (Fig. 2a). The content of various elements on the surface is displayed in Table 1.Clearly, the content of C and O decreases with the introduction of defects, while the N content increases.The C/N molar ratio decreases from 0.78 for g-CN to 0.71 for u-0.05PEI, indicating the successful formation of C defects on the surface of u-0.05PEI.High-resolution N 1s XPS spectra were obtained to investigate the exact form of the N elements, as shown in Fig. 2b.Both g-CN and u-0.05PEI exhibit four peaks at around 398.4, 399.8, 401.0, and 404.3 eV, corresponding to the sp 2 hybridized heptazine N (N1), the N atoms bonded to three carbons (N2), the N atoms in amino groups (N3), and the p-excitations (N4), respectively 515253.In comparison to g-CN, the binding energy (BE) of various N species of u-0.05PEI are almost unchanged except that N2 shifts to lower BE, suggesting the change of chemical environment of N2 or the presence of new N species in u-0.05PEI.The content of various N species shows that the N1 decreases accompanied by the increase of N2 and N3 with the introduction of defects, while N4 remains almost unchanged (Table 2).These results may originate from the partial destruction of tri-s-triazine structure of g-CN, which leads to the formation of C defects and new amino groups (-NH x ) 50.The C 1s spectra of both g-CN and u-0.05PEI can be deconvoluted into three peaks located at 284.6, 286.2, and 287.9 eV (Fig. 2c).Obviously, the peak at 286.2 eV, which is attributed to the C-NH x species of g-CN 545556, increases in u-0.05PEI compared with that of g-CN, suggesting that more -NH x groups are presented on the surface of u-0.05PEI due to the introduction of PEI.The -NH x groups are favorable for CO 2 adsorption and activation, which is beneficial for CO 2 photoreduction.The highresolution O 1s XPS spectra of these two samples are almost the same (Fig. 2d), implying that no other O species are introduced due to the co-polymerization of urea with PEI.Considering the decreased signal intense of O 1s in u-0.05PEI compared with that of g-CN (Table 1), the intense IR absorption within 3070-3450 cm A1 of u-0.05PEI should be derived from the introduced -NH x rather than adsorbed water.The XPS results confirm the for- Elemental analysis was performed to further investigate the bulk phase composition of the catalysts, as shown in Table 3.The C/N molar ratio of the pristine g-CN obtained at hightemperature is often lower than that of perfect g-CN (0.75) due to the incomplete condensation of terminal -NH x groups at the edge of g-CN.Interestingly, it is found that the bulk phase C/N molar ratio of u-0.05PEI increases in comparison to that of g-CN, which is opposite to the variation of its surface elemental composition.The bulk phase elemental composition indicates that N defects rather than C defects are formed inside u-0.05PEI.Thus, we get the conclusion that there are both C and N defects in u-0.05PEI.The C defects mainly distribute on the surface of u-0.05PEI, while the N defects concentrate inside the catalyst. Based on the analysis above, the copolymerization of urea with PEI leads to the formation of C, N defects, amino groups, and ample pore structures.The possible structure of u-xPEI is shown in Scheme 2. A good crystalline structure of g-CN can be obtained when urea itself was utilized as the raw material.However, in u-xPEI the ordered polymerization of urea was disturbed due to the presence of PEI, leading to the formation of some incompletely condensed tri-s-triazine units and thus the presence of C and N defects.It is generally known that the physical and chemical properties of a semiconductor are closely correlated to its structure.The physicochemical properties of u-xPEI can be modulated by controlling the incorporation amount of PEI, which has been evidenced by the characterization presented above.On the surface of u-xPEI, apart from the C defects, the broken tri-s-triazine units also result in the formation of more amino groups, which may serve as the adsorption and reactive center of CO 2 .All the features of u-xPEI mentioned above are beneficial for boosting the photoreduction performance for CO 2 . The optical and electrical properties variation of g-CN due to the introduction of PEI were tested and displayed in Fig. 3.The optical absorption properties of the prepared catalysts were obtained through UV-vis DRS, as displayed in Fig. 3a.The optical absorption ability of u-xPEI increases with enhancing defect amount, as evidenced by the redshift of its intrinsic absorption edge compared with that of g-CN.This phenomenon demonstrates that the introduction of PEI into g-CN could narrow down its bandgap.It was reported that the N defects in g-CN could lead to the formation of midgap states 57, which can significantly enlarge the light absorption ability of g-CN.Thus, the band structure changes of g-CN were attributed to the introduction of bulk phase N defects.The band structure variation of the catalysts were investigated in detail.Clearly, all the u-xPEI samples exhibit a noticeable absorption tail (Urbach tail) which increases with enhancing defect amount, extending the optical absorption of u-xPEI to a broader region.According to previous reports, the Urbach tail corresponds to the electronic states located within the bandgap, which are also known as midgap states 58,59.The intense tail absorption can remarkably facilitate the absorption of photons with energy lower than the intrinsic absorption, which is also referred to as subbandgap absorption 60.The bandgap energy (E g ) of the u-xPEI was obtained by Taus plots using the Kublek-Munk method.As shown in Fig. 3b, the E g of u-xPEI decreases with increasing defects amount from 2.82 eV of g-CN to 2.22 eV of u-0.15PEI, indicating that the E g of u-xPEI can be modulated by altering the amount of defects.As u-0.05PEI presented the best catalytic activity, its subbandgap absorption was investigated in detail and displayed in Fig. 3c.Obviously, the E g of u-0.05PEI is 2.58 eV.Meanwhile, the transition energy (E t ) from the valence band to midgap states of u-0.05PEI is calculated to be 2.05 eV. To reveal the effects of the sub-bandgap absorption on the catalytic activity of u-0.05PEI, the exact position of the midgap states in the bandgap is required.Mott-Schottky plots of g-CN and u-0.05PEI were obtained to calculate the orbital energy levels, as shown in Fig. 3d.Both g-CN and u-0.05PEI present a positive slope, which is the typical characteristic of n-type semiconductor.The flat band (FB) potentials of g-CN and u-0.05PEI are A1.42 and A1.25 eV (vs.Ag/AgCl), which can be converted to A1.22 and A1.05 V (vs.NHE), respectively 61.As reported, the conduction band (CB) of most n-type semiconductors is about 0.1 V lower than the FB potentials 62,63, thus the CB potentials of g-CN and u-0.05PEI are A1.32 and A1.15 V (vs.NHE), respectively.Then the valance band (VB) positions of the catalysts were obtained based on the common equation: where E CB and E VB represent the CB and VB potentials, respectively.According to the E g obtained from Taus plots, the VB of g-CN and u-0.05PEI are calculated to be 1.50 and 1.43 V (vs.NHE), respectively.The E t from VB to midgap states calculated from Taus plots is 2.05 eV.Thus the position of midgap states of u-0.05PEI is A0.62 V (vs.NHE).Based on the above results, the band alignments of g-CN and u-0.05PEI are obtained and presented in Fig. 4, in which the reduction potentials of CO 2 -derived CO and CH 4 are also displayed.Obviously, both the CB and midgap states positions of u-0.05PEI are more negative than the reduction potentials of CO and CH 4 , indicating that the photoinduced electrons on both CB and midgap states of u-0.05PEI are able to reduce CO 2 to CO and CH 4 from the perspective of thermodynamics.This result matches well with the significant improved photoreduction activity of u-0.05PEI compared with that of g-CN. In addition to the optical absorption and band alignments, the photoinduced electron-hole separation efficiency and charge carrier transferability also play critical roles in the photoreduction of CO 2 .The PL spectra of g-CN and 0.05PEI are displayed in Fig. 5a.Clearly, g-CN presents an intense emission peak at around 460 nm, which is attributed to the intrinsic emission from the VB to CB of g-CN 64.However, u-0.05PEI displays significant quenching of PL intensity in comparison with that of g-CN, suggesting that the introduction of defects can remarkably inhibit the recombination of electron-hole in g-CN, rather than serving as recombination center.The EIS pattern is employed to investigate the charge transferability of both samples, as shown in Fig. 5b.Apparently, u-0.05PEI displays a smaller arc radius in comparison with that of g-CN, suggesting its fast charge migration ability.The fast charge transferability is beneficial for reducing the recombination rate of electron-hole and boosting the photocatalytic performance.Moreover, the electron delocalization properties and defects of the samples were investigated by EPR, as shown in Fig. 5c.The small EPR signal at g 2.0056 in g-CN is attributed to the unpaired electron localized at the C atom in the aromatic heterocycles of g-CN 22.The intense EPR signal of u-0.05PEI demonstrates the significantly enhanced unpaired electron amount in u-0.05PEI compared with that of g-CN, indicating that large amounts of N defects are introduced into the structure of u-0.05PEI.Moreover, the intense EPR signal also demonstrates the excellent electron delocalization property of u-0.05PEI 65, which is favorable for enhancing the lifetime of charge carriers.As reported, the photoinduced charge carrier separation rate from semiconductor to electrode and the electron-hole recombination rate at the interface are all responsible for the photocurrent intensity 13,66.The transient photocurrent of u-0.05PEI (12.1 lA cm A2 ) is almost 5.3 times higher than that of g-CN (2.3 lA cm A2 ) under light irradiation (Fig. 5d), matching well with the above analysis results.The enhancing electronhole separation efficiency, reducing charge transfer resistance, increasing charge carrier stability, and intense photocurrent den- sity of u-0.05PEI are all favorable for its outstanding photocatalytic performance for CO 2 reduction. The photocatalytic activity of the prepared catalysts was evaluated by the photoreduction of CO 2 .Generally, a co-catalyst, solvent, or sacrificial agent was needed to aid the photoreduction of CO 2 due to its high stability, which made the reaction less environmentally friendly.In this work, the reduction of CO 2 was carried out in water under ultraviolet irradiation without any co-catalyst or additives.The catalytic activity of various g-CN based catalysts is displayed in Fig. 6a.In the presence of g-CN, the yields of CO and CH 4 in 4 h are 10.28 and 0.67 lmol g A1 , respectively.Both the yields of CO and CH 4 improve with the introduction of defect structures, and increase with the enhancing defects amount.The catalyst u-0.05PEI presents the best catalytic performance with CO and CH 4 yields of 32.86 and 1.68 lmol g A1 in 4 h.The yields of CO and CH 4 for u-0.05PEI are about 3.2 and 2.5 times higher than that of g-CN, respectively.Further increasing defects amount leads to the reduction of the products yields, as evidenced by the decreased products yields of u-0.1PEI and u-0.15PEI.This phenomenon may result from that excess defects act as charge carrier recombination centers, which reduces the utilization efficiency of light.Thereafter, the effects of PEI molecular weight on the catalytic performance of the catalysts were investigated (Fig. 6a).Clearly, the yields of CO and CH 4 increase with increasing PEI molecular weight from 16.09 and 0.89 lmol g A1 (u-0.05PEI-1) to 32.86 and 1.68 lmol g A1 (u-0.05PEI) in 4 h, indicating that higher molecular weight is beneficial for better catalytic performance.Higher molecular weight leads to the formation of larger pores in the catalyst during the pyrolysis process, which is favorable for mass transfer.Thus, the optimum additive amount and molecular weight of PEI are 0.05 g and 70000, respectively. The durability is one of the primary criteria to evaluate the performance of a catalyst.The catalytic stability of u-0.05PEI was eval- uated by four successive runs.After each cycle, the reaction system was purged with N 2 thoroughly to exclude the produced CO and CH 4 .Thereafter, the reactor was purged with CO 2 thoroughly and carried out the next run.It can be seen that after four successive cycles, the yields of CO and CH 4 are almost the same as that of the fresh catalyst (Fig. 6b), indicating the excellent durability of u-0.05PEI in the photoreduction of CO 2 .The good catalytic activity and remarkable durability of the catalyst make it a potential candidate for the photoreduction of CO 2 in practical application. The photoreduction of CO 2 over various catalysts is the research focus of nowadays, up to now some possible mechanisms have been proposed to explain this reaction 67.It is generally accepted that the reduction potentials of photoinduced electrons 23, charge transfer ability 68, reactants et al. play crucial roles in the photocatalytic reactions.According to the characterization and experimental results in this work, a possible reaction mechanism was proposed and displayed in Fig. 7.Under irradiation of light, the electrons on the VB of u-0.05PEI are excited to its midgap states or CB, depending on the energy of the light absorbed by electrons.Then, the separation and recombination of the photoinduced electron-hole compete with each other, and the successfully separated electrons migrate to the active sites through the conjugated big p bonds.This procedure is dominated by the fast charge transfer which has been evidenced by PL, EIS and Transient photocurrent of u-0.05PEI.Meanwhile, the reactant CO 2 and H 2 O diffuse across the porous structures of the catalyst and reach to the active sites.Then the adsorbed CO 2 on the active sites is reduced by the photoinduced electrons with suitable reduction potential in the presence of H to give hydrocarbon fuels (CO and CH 4 ).Finally, the products desorbed from the active sites and diffused outside the catalyst via porous structure.The defect structures, amino groups and the porous structure of the catalyst synergistically facilitated the photocatalytic reduction of CO 2 to proceed with high efficiency."
  },
  {
    "title": "Conclusions",
    "content": "In view of the energy crisis and environmental problems faced by the sustainable development of human society, a series of g-CN based catalysts (u-xPEI) were designed and prepared to catalyze the photoreduction of CO 2 into hydrocarbon fuels.PEI was introduced as a doping and pore-forming agent in the preparation of g-CN based catalysts.The porous structures of u-xPEI offered both abundant channels for mass transfer and tremendous active sites for CO 2 adsorption and activation.In addition, the incorporation of PEI endowed u-xPEI with numerous C and N defects.The N defects lead to the formation of midgap states between the VB and CB of u-xPEI, which significantly enhanced the light energy utilization efficiency.Moreover, the C defects resulted in the formation of more amino groups, which greatly enhanced the CO 2 affinity of u-xPEI.The porous structures, defect structures, and amino groups of u-xPEI synergistically catalyzed the photoreduction of CO 2 with high efficiency in the absence of any additive and organic solvent.The methods used in this work may serve as a reference for other researchers to develop more efficient and environmentally friendly catalysts for photocatalytic reduction of CO 2 . Scheme 1. Graphical illustration of u-xPEI preparation process. Fig. 1.(a) XRD patterns of g-CN and u-xPEI; (b) High-resolution XRD patterns of (0 0 2) peak of the prepared g-CN based catalysts; (c) Raman spectra of g-CN and u-0.05PEI;(d) TEM image of u-0.05PEI;(e) N 2 absorption-desorption isotherms of g-CN and u-0.05PEI;(f) FT-IR spectra of g-CN and u-0.05PEI. Fig. 2. (a) XPS survey spectra; (b) N 1s; (c) C1s; and (d) O 1s spectra of g-CN and u-0.05PEI. Scheme 2. Possible structures of g-CN and u-xPEI. Fig. 3. (a) UV-vis spectra, and (b) Taus plots of the prepared catalysts; (c) E g and E t of u-0.05PEI;(d) Mott-Schottky plots of g-CN and u-0.05PEI. Fig. 4. The band alignments of g-CN and u-0.05PEI, and the reduction potentials of CO 2 -derived products. Fig. 5. (a) PL spectra; (b) EIS Nyquist plots; (c) EPR in the dark; and (d) Transient photocurrent of g-CN and u-0.05PEI. Fig. 6.(a) Catalytic activity of various g-CN based catalysts; (b) Catalytic durability of u-0.05PEI.Reaction conditions: catalyst 20 mg, H 2 O 100 mL, 20 C, 4 h, ultraviolet light. Fig. 7. Possible reaction mechanism for photoreduction of CO 2 to CO and CH 4 . Surface elemental composition of g-CN and u-0.05PEI based on XPS. Content of various N species based on XPS analysis. X. Song et al. / Journal of Colloid and Interface Science 578 (2020) 574-583 This work was supported by the China Postdoctoral Science Foundation (2019M651728), National Natural Science Foundation of China (Grant No. 21776117 and 21908080), Natural Science Foundation of Jiangsu Province (BK20180884). The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper."
  }
]