[
  {
    "title": "Doi",
    "content": "10.1016/j.jmst.2021.10.016"
  },
  {
    "title": "Article_Title",
    "content": "Solar fuel generation over nature-inspired recyclable TiO2/g-C3N4 S-scheme hierarchical thin-film photocatalyst"
  },
  {
    "title": "Abstract",
    "content": "Preparation of efficient photocatalysts with ease of recovery in solar fuel generation is highly desired to achieve carbon neutralization in carbon dioxide (CO 2 ) emissions.Inspired from the forest with superior light penetration and fast gas transport, a TiO 2 /g-C 3 N 4 composite nanowire arrays (NAs) film with maximized light utilization is devised.It is achieved by in-situ coating a thin layer of g-C 3 N 4 (as the leaf) on the vertically-oriented TiO 2 arrays (as tree trunks) on Ti foil (as soil).Benefiting from the effective charge separation by S-scheme charge transfer, intimate contact by the in-situ growth as well as the ingenious structure, the composite, readily recyclable, displays exciting performance in photocatalytic CO 2 reduction.It is beyond doubt that the combination of heterojunction construction and \"nature-inspired biomimetic photocatalyst\" design promises practical applications and industrial use."
  },
  {
    "title": "Experimental",
    "content": "TiO 2 NAs on a titanium foil were prepared using an in-situ chemical oxidation method according to the previous reports 57 , 58 .Firstly, the titanium foil (4 4 cm 2 ) was ultrasonically cleaned successively in ethanol and deionized water for 0.5 h each.Later, the cleaned titanium foil was placed in a beaker, which contains 30 mL of hydrogen peroxide solution (Analytical reagent (AR), 30) and 1 mL of nitric acid (AR, 68).Subsequently, the beaker was placed in an oven at 80 C for 48 h.Upon cooling down the beaker to room temperature, the obtained foil with the precursor of TiO 2 NAs was washed with deionized water and finally annealed in air at 550 C for 4 h to obtain the TiO 2 NAs. In a typical procedure, certain amounts of melamine (C 3 H 6 N 6 ) (e.g., 0.1, 0.25, 0.5, 1 and 2 g) were added in a crucible (25 mL) with a cover, and a piece of titanium foil with the precursor of TiO 2 NAs (2 2 cm 2 ) was placed at the upper position of the crucible.Subsequently, the crucible was heated in a muffle furnace at 550 C for 4 h.After the furnace was naturally cooled, the TiO 2 /g-C 3 N 4 NAs were obtained.The obtained samples were denoted as TiO 2 /g-C 3 N 4 -0.1, TiO 2 /g-C 3 N 4 -0.25,TiO 2 /g-C 3 N 4 -0.5, TiO 2 /g-C 3 N 4 -1 and TiO 2 /g-C 3 N 4 -2, respectively, where the suffixes indicated the amount of melamine.Specifically, the material used for characterizations tests was the TiO 2 /g-C 3 N 4 -0.5 sample (named as TiO 2 /g-C 3 N 4 ) unless otherwise noted. After the TiO 2 /g-C 3 N 4 NAs were prepared by the in-situ VDP method, bulky g-C 3 N 4 powders were collected from the bottom of the crucible.Moreover, these powders (0.4 mg) were evenly dispersed in water (0.5 mL).Afterwards, the g-C 3 N 4 dispersions were evenly deposited onto the fluorine-treated tin oxide (FTO) substrate surface (2 2 cm 2 ) for the preparation of g-C 3 N 4 film.The bulky g-C 3 N 4 powders and g-C 3 N 4 film were used as control samples. The details of characterization techniques were described in the Supplementary Information (SI). Typically, the g-C 3 N 4 film, TiO 2 NAs and TiO 2 /g-C 3 N 4 NAs composites (2 2 cm 2 ) were separately used as photocatalysts.For the PCR reaction measurement details, please refer to SI."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Firstly, the TiO 2 NAs (as tree trunks) were vertically grown on the surface of Ti foil (as soil) substrates through the in-situ oxidizing the titanium foil with the assistance of aqueous hydrogen peroxide and nitric acid at the reaction temperature of 80 C 57 , 58 .Afterwards, the deposition of g-C 3 N 4 (as leaf) was realized via a VDP strategy as shown in Fig. 1 .Different from the liquid or solid-assisted preparation that results in the full coating of the entire substrate surface, during the VDP process, solid melamine (C 3 H 6 N 6 ) can easily evaporate into gas molecules 55 , 56 .Subsequently, with rapid diffusion, melamine can be easily diffused into the interspace of TiO 2 NAs and adsorbed onto the surface of TiO 2 NAs, facilitating the in-situ coating of thin layer g-C 3 N 4 on the surface of TiO 2 NAs with intimate contact. The morphology of samples was examined by field-emission scanning electron microscopy (FESEM) and transmission electron microscope (TEM).As displayed in Fig. 2 (a) and (b), the pristine TiO 2 NAs (as tree trunks) are uniformly grown on the whole substrates (as soil).After the deposition of g-C 3 N 4 (as the leaf), the obtained TiO 2 /g-C 3 N 4 NAs composites possess similar morphology to pristine TiO 2 NAs, indicating that the nanoarrays remain intact after VDP process ( Fig. 2 (c)).Notably, after coating with g-C 3 N 4 , the surface of the nanoarrays was rough ( Fig. 2 (d)), suggesting that the g-C 3 N 4 is successfully grown on the surface of TiO 2 NAs.In addition, the high-resolution TEM image of TiO 2 /g-C 3 N 4 NAs clearly exhibits that the lattice fringes with d-spacing of 0.35 nm are indexed to the (101) crystal plane of anatase TiO 2 ( Fig. 2 (f)).Besides, a thin layer g-C 3 N 4 of about 5 nm with non-lattice fringes is obvious in Fig. 2 (f).Meanwhile, it can be clearly observed that the TiO 2 and g-C 3 N 4 are in intimate contact, thereby forming tight heterojunction interfaces with large areas.This design can establish an efficient transfer path of charge carriers, thus extremely enhancing the efficiency of photogenerated charge separation and transfer. X-ray diffraction (XRD) was carried out to further study the crystal phase structures of samples.As shown in Fig. 3 (a), the diffraction peaks of bulk g-C 3 N 4 at 13.1 and 27.5 can be ascribed to the (100) and (002) crystal plane of g-C 3 N 4 , respectively 59606162 .The peaks at 25.6 , 37.8 , 48.2 , 55.1 and 62.8 can be attributed to the (10 0), (0 04), (20 0), ( 211) and (204) planes of anatase TiO 2 (The joint committee on powder diffraction standards (JCPDS) No. 84-1286), respectively 9 , 57 .Notably, the XRD pattern of TiO 2 /g-C 3 N 4 NAs matches well to both pristine TiO 2 NAs and bulk g-C 3 N 4 , indicating their successful integration. Besides, as displayed in Fig. 3 (b), the Raman peaks of TiO 2 NAs at 399, 517 and 639 cm -1 are attributed to the typical B 1g , A 1g and E g vibrational modes of anatase TiO 2 , respectively 9 , 63 .The two obvious broad peaks at 400 and 1500 cm -1 are assigned to the bulk g-C 3 N 4 peaks, in good agreement with the previous literature 64 , 65 .Obviously, compared with the pristine TiO 2 NAs and bulk g-C 3 N 4 , the peaks of TiO 2 /g-C 3 N 4 NAs exhibit a slight red-shift, which provides evidence for the chemical interaction between TiO 2 and g-C 3 N 4 .In addition, Fig. 3 (c) illustrates the Fourier transform infrared (FT-IR) spectra of samples.The peaks at 800 and 890 cm -1 are ascribed to the out-of-plane bending of tri-s -triazine rings and the deformation mode of the N -H bond of g-C 3 N 4 , respectively 59 , 60 .The broad peak at 3200 cm -1 can be attributed to the stretching vibration mode of the N -H bond 59 , 60 .The absorption peaks between 1200 and 1700 cm -1 are ascribed to the characteristics of skeleton stretching and bending modes of C -N heterocycles 59 , 60 .In detail, the characteristic peaks of g-C 3 N 4 can be clearly detected in the FT-IR spectra of TiO 2 /g-C 3 N 4 NAs, further confirming the successful construction of heterojunction. Furthermore, Fig. 3 (d) presents the UV-visible diffuse reflection spectroscopy (UV-vis DRS) of the as-prepared samples to investigate their optical properties further.The absorption edge of samples is obviously shifted to a longer wavelength with the increasing of g-C 3 N 4 content, which suggests that the TiO 2 /g-C 3 N 4 NAs composites exhibited broadened absorption range.Meanwhile, the band-gap ( E g ) of samples was evaluated according to the Tauc plots.As presented in Fig. 3 (e), the E g of the pristine TiO 2 NAs and bulk g-C 3 N 4 are roughly estimated to be 3.14 and 2.62 eV, respectively.Moreover, the flat-band potentials ( E FB ) of the pristine TiO 2 NAs ( -0.26 V) and bulk g-C 3 N 4 ( -0.66 V) were estimated according to the Mott-Schottky (M-S) curves, respectively ( Fig. 3 (f)).Usually, for the n-type semiconductors, E FB is more positive by about 0.2 V than the conduction band potential ( E CB ) 59 .Therefore, E CB of the pristine TiO 2 NAs and bulk g-C 3 N 4 are -0.46 and -0.86 V (vs.normal hydrogen electrode (NHE), at pH 0. Note: all of the potential values in this work are referenced to the NHE electrode at pH 0), respectively, which are thermodynamically negative enough to reduce CO ( -0.12 V) and CH 4 (0.17 V) 9 , 66 .Furthermore, the valence band potential ( E VB ) of samples is calculated according to the following Eq.( 1) : Thus, E VB of the pristine TiO 2 NAs and bulk g-C 3 N 4 are 2.68 and 1.76 V, respectively.Noticeably, H 2 O molecules are the proton donors in PCR reaction, and the potential of protons generated by the reaction between H 2 O molecules and photogenerated holes is 1.23 V 9 , 66 .Therefore, based on the above analysis, the TiO 2 NAs and g-C 3 N 4 can offer enough redox ability to activate PCR reaction. PCR experiments of as-obtained samples were carried out in the gas (CO 2 /H 2 O vapor)-solid (photocatalyst) phase system without any sacrificial agents or cocatalysts under full-spectrum irradiation.Fig. 4 (a) displays the amount of photoreduced products.Obviously, the TiO 2 /g-C 3 N 4 composites show remarkably higher performance than the pristine g-C 3 N 4 and TiO 2 .Meanwhile, with the increasing g-C 3 N 4 loading amount, the PCR performance of TiO 2 /g-C 3 N 4 composites increases firstly and then decreases owing to the shielding effect of excessive g-C 3 N 4 layers.Furthermore, the optimal sample delivers the highest yields of CO and CH 4 , up to 571.65 and 213.69 mol h -1 m -2 , respectively.And its total yields (the sum of CO and CH 4 yield) (785.34 mol h -1 m -2 ) is about 2.9 and 5.9 times higher than those of the pristine TiO 2 (259.11mol h -1 m -2 ) and g-C 3 N 4 (133.27mol h -1 m -2 ).Meanwhile, the photooxidative product O 2 can be detected (Fig. S1).Moreover, the PCR performance of TiO 2 /g-C 3 N 4 NAs did not decay after consecutive running for four cycles ( Fig. 4 (b)).Furthermore, the XRD patterns of TiO 2 /g-C 3 N 4 NAs before and after the cyclic stability tests do not change obviously (Fig. S2).Notably, the PCR performance of a physical mixture of TiO 2 NAs/g-C 3 N 4 (319.29 mol h -1 m -2 ) and in-situ preparation of TiO 2 film/g-C 3 N 4 non-nanoarray structure composites (162.74 mol h -1 m -2 ) (for preparation details, please refer to the SI) are much lower than that of TiO 2 /g-C 3 N 4 NAs under the same condition (Fig. S3(a)).Therefore, these results suggest that the advantages of forest-like nanoarray structures and intimate contact. What's more, to investigate the carbon origin of photoreduced products, control experiments were carried out in different reaction conditions.As shown in Fig. S3(b), no photoreduction products are observed when the reaction was performed in the absence of light, CO 2 , CO 2 /H 2 O vapor, or photocatalyst, respectively.Meanwhile, 13 CH 4 and 13 CO are generated in the 13 C-labeled CO 2 ; whereas 12 CH 4 and 12 CO are generated in the 12 C-labeled CO 2 under the same measurement conditions (Fig. S4).Therefore, these results imply that the photoreduction products (CO and CH 4 ) stem from CO 2 conversion rather than impurities. To decipher the superiority of the composite over monocomponent photocatalyst, PL characterization and photoelectrochemical measurements were performed at room temperature.As shown in Fig. 5 (a), the steady-state PL intensity of TiO 2 /g-C 3 N 4 NAs is lower than those of pristine TiO 2 NAs and g-C 3 N 4 , indicating that suppressed recombination of photogenerated charge carriers is achieved in the composite 9 , 13 , 37 , 59 .Furthermore, Fig. 5 (b) displays the time-resolved PL spectra of samples when the excitation wavelength is 375 nm.Usually, the shorter the average lifetime ( av ) of time-resolved PL spectra is, the better the photogenerated charge separation behavior is 9 , 13 , 37 , 59 .The av of g-C 3 N 4 and TiO 2 NAs are 12.83 and 8.64 ns, respectively ( Table 1 and Fig. 5 (b)).When the heterojunction with intimate contact interfa- The fitted parameters obtained from time-resolved PL spectra of samples.Sample 1 (ns) cial are formed, the av of TiO 2 /g-C 3 N 4 NAs is shortened to 5.37 ns ( Fig. 5 (b)).Therefore, the results of time-resolved PL spectra denote the rapid separation and migration of photogenerated charges in the heterojunction 9 , 13 , 37 , 59 .Besides, as displayed in Fig. 5 (c), the TiO 2 /g-C 3 N 4 NAs heterojunction photocatalysts exhibit higher photocurrent density (0.073 mA cm -2 ) than g-C 3 N 4 (0.022 mA cm -2 ) and TiO 2 NAs (0.051 mA cm -2 ), suggesting faster photogen-erated charge-transfer processes in the heterojunction 9 , 13 , 37 , 67 .Meanwhile, the EIS of samples are shown in Fig. 5 (d).Generally, a smaller arc radius of EIS spectra reflects higher charge transfer efficiency with lower transfer resistance 9 , 13 , 37 , 67 .From Fig. 5 (d), the arc radius of TiO 2 /g-C 3 N 4 NAs is remarkably smaller than those of g-C 3 N 4 and TiO 2 NAs, indicating that the formation of heterojunction is beneficial to improve the transfer behavior of photo- generated charge carriers 9 , 13 , 37 , 67 .Besides, compared with the physical mixture and non-nanoarray counterparts, the TiO 2 /g-C 3 N 4 NAs possess the highest photocurrent density and the smallest arc radius of EIS spectra (Fig. S5), which is in agreement with the results of PCR performance (Fig. S3(a)).Therefore, taken together, the above results reaffirm that intimate contact is essential in facilitating the transfer and separation of the photogenerated carriers as well as significantly enhance the performance of PCR reaction.Additionally, the adsorption of CO 2 on the surface of the photocatalyst is an important factor affecting the performance of PCR reaction.As displayed in Fig. 6 , the CO 2 adsorption energy ( E ad ) on the (001) facet of g-C 3 N 4 ( -0.43 eV) is more negative than that on the (101) facet of TiO 2 ( -0.02 eV), which implies that the adsorbed CO 2 on the surface of g-C 3 N 4 is more stable than that on the surface of TiO 2 .Therefore, this result further indicates that the outermost thin layer g-C 3 N 4 is beneficial for the adsorption of CO 2 and improves the photoreduction efficiency of CO 2 . To investigate the chemical states of elements and electron migrate behaviors between g-C 3 N 4 and TiO 2 , in-situ irradiated and ex- 59 .Notably, undetected Ti-C and Ti-N peaks are owing to fact that the g-C 3 N 4 is only coated to the surface of TiO 2 NAs and the C and N do not enter into the lattices of TiO 2 .Besides, as for the Ti 2p spectra, the two peaks centered at 458.5 and 464.2 eV can be ascribed to the Ti 2p 3/2 and Ti 2p 1/2 of TiO 2 , respectively ( Fig. 7 (c)) 9 , 59 .As for O 1 s spectra, the peaks at 529.7 and 532 eV are attributed to the Ti-O bond of TiO 2 and -OH group of surface adsorbed H 2 O ( Fig. 7 (d)) 9 , 59 .Furthermore, the binding energy of an element is closely related to its density of outer electrons 42 .Meanwhile, the increase of electron number or density can lead to the negative shift of binding energy; while the decrease of electron density can induce the positive shift of binding energy 42 .This means that the binding energy change can directly reflect the gain and loss of electrons 42 .As presented in Fig. 7 7 (c) and (d)), implying that the migrate direction of photoelectrons is from TiO 2 to g-C 3 N 4 .Therefore, these results directly testify that the photogenerated charge transfer mechanism of TiO 2 /g-C 3 N 4 NAs agrees well with the S-scheme mechanism 37 , 42 , 59 . The difference of work function ( ) or Fermi level ( E f ) of semiconductor photocatalysts dictates the interfacial charge transfer of heterojunction photocatalysts.The of TiO 2 and g-C 3 N 4 were calculated by DFT (for computational details, please check the SI).As displayed in Fig. 8 (a) and (b), the of anatase TiO 2 (101) and g-C 3 N 4 (001) facets are calculated to be 6.71 and 4.68 eV, respectively.Meanwhile, E f of samples is calculated according to the following equation: where V ac is the vacuum level (0 eV).As a result, E f of TiO 2 and g-C 3 N 4 are -6.71 and -4.68 eV, respectively. Subsequently, according to the above results of XPS, and E f , the S-scheme charge transfer mechanism of TiO 2 /g-C 3 N 4 NAs is proposed in Fig. 8 (c)-(e).Obviously, ( E f ) of TiO 2 is larger (lower) than that of g-C 3 N 4 ( Fig. 8 (c)).Afterwards, when TiO 2 and g-C 3 N 4 are hybridized, the electrons automatically migrate from g-C 3 N 4 to TiO 2 , and IEF as well as band bending at their interface are formed ( Fig. 8 (d)) 37 , 42 , 45 , 59 .Upon light irradiation, electrons of TiO 2 and g-C 3 N 4 are excited from their valence band (VB) to conduction band (CB), respectively ( Fig. 8 (e)).Naturally, the photogenerated electrons in TiO 2 CB tend to transfer to g-C 3 N 4 and recombine with the photogenerated holes in g-C 3 N 4 VB under the joint effect of IEF, Coulomb effect and interface band bending ( Fig. 8 (e)) 37 , 42 , 45 , 59 .Eventually, photogenerated electrons with strong reduction ability on the CB of g-C 3 N 4 and photogenerated holes with strong oxidation ability on the VB of TiO 2 are preserved, which participate in the CO 2 reduction (CO 2 2H 2e - CO H 2 O; CO 2 8H 8e - CH 4 2H 2 O) and H 2 O oxidation (2H 2 O 4h O 2 4H ), respectively ( Fig. 8 e).Therefore, the construction of S-scheme heterojunction is in favor of the improvement of photogenerated charge separation behavior and PCR reaction performance. In-situ diffuse reflectance infrared Fourier transform (DRIFT) spectra can be used to detect the intermediate species over the surface of photocatalyst during the CO 2 photoreduction 42 .Therefore, to further understanding the reaction path, intermediate species were monitored by in-situ DRIFT spectra of CO 2 and H 2 O reaction on the surface of TiO 2 /g-C 3 N 4 NAs.As shown Fig 1. Illustration for the preparation processes of forest-inspired recyclable TiO 2 /g-C 3 N 4 hierarchical thin-film photocatalyst. Fig 2. Morphology characterization of samples.FESEM images of (a and b) the pristine TiO 2 NAs and (c and d) the TiO 2 /g-C 3 N 4 NAs.(e) TEM and (f) its corresponding high-resolution TEM image of TiO 2 /g-C 3 N 4 NAs. Fig 3. Structural characterization of samples.(a) XRD patterns, (b) Raman, and (c) FT-IR spectra of TiO 2 NAs, TiO 2 /g-C 3 N 4 NAs and bulk g-C 3 N 4 .(d) UV-vis DRS spectra of the obtained samples.(e) Tauc plots and (f) M-S curves of TiO 2 NAs and bulk g-C 3 N 4 . Fig 4. CO 2 photoreduction performance.(a) Amount of photoreduction products of different samples in PCR reaction.(b) Recycling performance of TiO 2 /g-C 3 N 4 NAs. Fig 5. PL characterization and photoelectrochemical measurements.(a) Steady-state and (b) time-resolved PL spectra, (c) photocurrent density curves and (d) EIS spectra of TiO 2 NAs, g-C 3 N 4 and TiO 2 /g-C 3 N 4 NAs. Fig 6.E ad of CO 2 .Optimized structures of CO 2 molecule adsorbed on (a) anatase TiO 2 (101) and (b) g-C 3 N 4 (001) facet. Fig 7. In-situ irradiated and ex-situ XPS spectra of pristine TiO 2 NAs, bulk g-C 3 N 4 and TiO 2 /g-C 3 N 4 NAs.High resolution XPS spectra of (a) C 1s, (b) N 1s, (c) Ti 2p and (d) O 1s. Fig 8. Work function ( ) and S-scheme charge transfer mechanism.Electrostatic potentials of (a) anatase TiO 2 (101) and (b) g-C 3 N 4 (001) facets, where the insets represent the structural models of TiO 2 and g-C 3 N 4 , respectively.(c-e) Illustration of S-scheme charge transfer mechanism of TiO 2 /g-C 3 N 4 NAs.(c) Before contact.(d) After contact.(e) After contact under light irradiation. (a) and (b), compared with bulk g-C 3 N 4 , the binding energies of N C -N 2 aromatic rings and N 1 s peaks in TiO 2 /g-C 3 N 4 NAs exhibit a positive shift of 0.2 eV in darkness, implying the loss of electrons in g-C 3 N 4 .Conversely, compared with the pristine TiO 2 NAs, the binding energies of Ti 2p and Ti-O peaks in TiO 2 /g-C 3 N 4 NAs shift to lower binding energy in darkness ( Fig. 7 (c) and (d)), suggesting that the electrons transfer from g-C 3 N 4 to TiO 2 .Notably, when applying in-situ irradiated XPS spectra measurement for TiO 2 /g-C 3 N 4 NAs, compared with those in darkness, the binding energies of N C -N 2 aromatic rings and N 1s peaks in TiO 2 /g-C 3 N 4 NAs shift to lower energy levels ( Fig. 7 (a) and (b)); while the Ti 2p and Ti-O peaks in heterojunction display a positive shift ( Fig. This work was supported by the National Natural Science Foundation of China (NSFC) (Nos.51932007 , 51872220 , 51961135303 , 21871217 , 52073223 , 52063028 , U1905215 and U1705251 ). , at 1323 and 1660 cm -1 ) species are detected under dark condition 9 , 13 , 59 , 68 .Under light irradiation, some new peaks of intermediate species including carboxylate (COOH , at 1346 cm -1 ), formaldehyde (CH 2 O , at 1501 and 1785 cm -1 ) and methoxy (CH 3 O , at 1690, 1706, 1755 cm -1 ) species can be detected 9 , 13 , 59 , 68 .Therefore, according to the intermediate species and final products (CO and CH 4 ), possible PCR reaction pathways were proposed in Fig. 9"
  },
  {
    "title": "Conclusions",
    "content": "In summary, the recyclable S-scheme forest-like TiO 2 /g-C 3 N 4 film photocatalyst was successfully constructed by in-situ growing g-C 3 N 4 on the surface of TiO 2 NAs with intimate interfacial contact through a VDP strategy.Meanwhile, the optimized TiO 2 /g-C 3 N 4 NAs exhibit enhanced photoreduction of CO 2 to CO and CH 4 with a total conversion rate of 785.34 mol h -1 m -2 , outperforming pristine TiO 2 NAs and ex-situ construction of TiO 2 NAs/g-C 3 N 4 composites.Based on the in-situ irradiated XPS, PL and photoelectrochemical measurements, the improved PCR performance was attributed to the effective photogenerated charge carriers separation of S-scheme heterojunction.Therefore, this work offers a novel approach for the in-situ construction of highly efficient \"natureinspired biomimetic photocatalysts\" for photoreduction CO 2 con-version into solar fuels without the assistance of any sacrificial agents and cocatalysts in the gas-solid phase reaction system. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary material associated with this article can be found, in the online version, at doi: 10.1016/j.jmst.2021.10.016 ."
  }
]