[
  {
    "title": "Doi",
    "content": "10.1016/j.ijhydene.2017.05.039"
  },
  {
    "title": "Article_Title",
    "content": "Photo-induced CO2 reduction by hydrogen for selective CO evolution in a dynamic monolith photoreactor loaded with Ag-modified TiO2 nanocatalyst"
  },
  {
    "title": "Abstract",
    "content": "Ag-promoted TiO 2 nanoparticles immobilized over the cordierite monolithic support for dynamic and selective photo-reduction of CO 2 to CO by the use of hydrogen has been investigated.Ag-loaded TiO 2 NPs synthesized by a facile solegel method were coated over the monolith channels by dip-coating method.The samples were characterized by XRD, Raman, FTIR, SEM, TEM, XPS, N 2 adsorptionedesorption, UVeVis and PL spectroscopy.The photo-activity test of Ag-modified TiO 2 NPs was conducted for dynamic photocatalytic CO 2 reduction with H 2 as a reductant via a reverse water gas shift (RWGS) reaction in a cell type and monolith photo-reactors.Using 5 wt. Ag/TO 2 NPs, CO 2 was energetically converted to CO with a yield rate 1335 mmole g-catal.A1 h A1 , a 111 fold-higher than the amount of CO produced over the pure TiO 2 catalyst.More importantly, photo-activity of Ag/TiO 2 catalyst for CO evolution can be improved by 209 fold using monolith photo-reactor than the cell type reactor under the same operating conditions.This enactment was evidently due to the efficient light harvesting with larger illuminated surface area inside monolith microchannels and efficient charges separation in the presence of Ag-metal.The reusability of Ag/TiO 2 NPs loaded over the monolithic support showed favorable recycling capability than the catalyst dispersed in a cell reactor.A possible reaction mechanism for this observation has been discussed in detail."
  },
  {
    "title": "Experimental",
    "content": "All reagents were of analytical grade and used without further purification.The silver modified TiO 2 nanoparticles were synthesized by a facile solegel method and were coated over monolithic support reported in our previous work 44.Typically, 10 mL titanium tetra isopropoxide and 7.5 mL 1 M acetic acid solution were added into a 30 mL isopropanol under vigorous stirring.The mixed solution was kept stirring for 24 h at an ambient temperature.Later, calculated amount (wt.) of silver nitrate (AgNO 3 3H 2 O) dissolved in isopropanol was added to titanium suspension and stirred for another 6 h until a thick sol obtained.The sol-obtained was coated over monolith channels using dip-coating method. The cordierite monoliths were supplied by Pingxiang Meitao Chemical Packing Co., Ltd.China.The dimensions of monolith used were diameter 6 cm; length 2 cm and channels per square inch (CPSI) 200.Initially, monoliths were washed with acetone and ethanol to remove any organic materials, then dried at 110 C overnight under airflow.The initial weight of cleaned and dried monoliths were calculated.For every sample, three readings were noted for the bare as well as the coated monoliths and their average values are reported.For catalyst coating, weighed monoliths were dipped in the resulting Ag-loaded TiO 2 sol for 10 s and excessive sol was blown off with hot compressed air.The coating procedure was repeated to the desired catalyst loading over the monolith channels.The catalyst loaded monoliths were dried at 100 C overnight, calcined at a rate of 5 C min A1 up to 500 C, and then held for 5 h.Finally, the actual amount of catalyst loaded was calculated by subtracting the final weight of coated monoliths from the initial weight of un-coated monolith.The obtained samples were denoted as Ag-loaded TiO 2 nanoparticles immobilized over monolithic support.Different levels of Ag loading into TiO 2 e.g., 3, 5 and 7 wt. were obtained by varying the quantity of silver nitrate adding into titanium sol.Besides, pure TiO 2 NPs and powder Ag-loaded TiO 2 NPs were synthesized using the similar procedure as mentioned above. X-ray powder diffraction (XRD) was obtained on Bruker D8 advance diffractometer.CueKa radiation (l 14 0.154 nm) operating at 40 kV and 40 mA.A scan range of 10 2q 80 , a scan speed of 1.2 per min and a step size of 0.02 .Raman measurements of the powder samples were acquired at room temperature using Raman Spectrometer (LabRAM HR Evolution, HORIBA) with a 532 nm emitting laser as an excitation source.The cordierite structure of monolith was investigated with scanning electron microscopy (SEM) carried out with JEOL JSM6390 LV SEM instrument.The morphology of the materials was examined using field emission scanning electron microscopy (FESEM) using Hitachi SU8020 instrument with double condenser optics to ensure full control of probe current from 1 pA to more than 5 nA.Energy-dispersive X-ray spectroscopy (EDX) was conducted for both the fresh and used samples.The BET specific surface area and pore size of the samples were analyzed using N 2 adsorptionedesorption isotherms with Micrometrics ASAP 2020 operated at 77 K.All the samples were degasified at 250 C for 4 h under vacuum.The X-ray photoelectron spectroscopy (XPS) measurements were performed using Omicron DAR 400 analyser.The samples were fixed to the sample holder using carbon tape.The peaks were calibrated at 284.60 eV as an internal carbon standard.UVeVis diffuse reflectance absorbance spectra (DRS) of the samples were determined using Agilent, Cary 100 UVeVis spectrophotometer equipped with an integrated sphere.Initially, blank runs were conducted to correct the base line.The absorbance spectra were analysed at ambient temperature in the wavelength range of 200e800 nm.The photoluminescence (PL) spectra were measured using photoluminescence PerkinElmer LS-55 Luminescence Spectrometer at excitation wavelength 350 nm.Fourier Transformed Infrared (FT-IR) Spectrometer peaks of the fresh and used catalysts were obtained in the range of 400e4000 cm A1 employing Spectrum 2000 Explorer Spectrometer. The activity of photo-induced CO 2 -hydrogen reaction system was tested in a gas phase photo-reactor with H 2 as a reducing agent under UV-light irradiation as depicted in Fig. 1.The reactor consists of cylindrical stainless steel vessel with a total volume of 150 cm 3 , equipped with a quartz window for passing light irradiations from the reflector lamp at the top.The light source used was a 200 W Hg lamp with light intensity 150 mW cm A2 at wavelength 252 nm.The light intensity was measured with an online optical process monitor ILT OPM-1D and a SED008/W sensor.The cooling fans were installed at the top and sides of the lamp for continuous removal of lamp heat.The reactor was covered with aluminum foil to ensure lights for reactions came through the quartz window only.The gasses feed rates were controlled using online mass flow controllers (MFC) with gas flow measurements in the range of 10e500 mL/min.A gas mixture was used to ensure all the gases were uniformly mixed before entering into reactor.The temperature of the reactor was controlled using temperature controller while pressure was measured using pressure gauge. In case of the cell type photo-reactor, 25 mg of catalyst powder was suspended uniformly inside the reactor at the bottom surface to ensure efficient light distribution over the entire catalyst surface as illustrated in Fig. 1 (a).The schematics of monolith photo-reactor for CO 2 -hydrogen reaction system is portrayed in Fig. 1 (b).The monolithic supports have cordierite honeycomb structure and were purchased from Pingxiang Meitao Company, China.All the monoliths were cylindrical in shape, having dimensions of 60 mm in diameter and 20 mm in length.The catalyst coated ceramic monoliths with channel per square inch (CPSI) 200 were inserted inside the stainless steel chamber.After performing a leak test with helium (He) at 2 bars pressure, the reactor was purged using helium (He) flow before gas mixtures (CO 2 and H 2 , purity 14 99.99) was continuously passed through the reactor at a flow rate of 20 mL per minute.All the experiments were carried out in a continuous mode of operation.The CO 2 /H 2 feed ratio 1.0 was fixed and flow rates of 20 mL/min were adjusted with a space velocity of 0.13 s A1 .All the experiments were conducted at 100 C and atmospheric pressure. The gas products were analyzed using an on-line gas chromatograph (GC-Agilent Technologies 6890 N, USA) equipped with thermal conductivity detector (TCD) and a flame ionized detector (FID).Furthermore, FID detector was connected with a HP-PLOT Q capillary column (Agilent, length 30 m. ID 0.53 mm, film 40 mm) for separation of C 1 eC 6 paraffin and olefins hydrocarbons, alcohols and oxygenated compounds.The TCD detector was connected to UCW982, DC-200, Porapak Q and Mol Sieve 13X columns.C 1 eC 2 , C 3 eC 5 compounds and light gasses (H 2 , O 2 , N 2 , CO) were separated using Porapak Q, DC-200 and MS-13X column, respectively."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The XRD spectra of TiO 2 and Ag-loaded TiO 2 samples are presented in Fig. 2 (a).In the bare TiO 2 sample, the characteristic peaks identified were 25 24.The XRD peaks of Ag-loaded TiO 2 also reveal a pure crystalline and anatase phase TiO 2 .The peaks pertaining to rutile phase of TiO 2 were not detected in both the pure TiO 2 and Ag-loaded TiO 2 samples.Similarly, Ag-modified TiO 2 samples show broad and intense signals, yet peaks pertaining to Ag in metal or oxide states were not detected.This was perhaps the amounts of Ag-loaded in the TiO 2 was below the detection limit of the instrument or due to highly dispersed Ag-NPs inside TiO 2 structure 16,45.The crystallite size was calculated using Scherrer equation based on the XRD (101) peak.In the case of Ag-loading, the crystallite size gradually decreased, possibly Ag hindered TiO 2 crystal growth.Agloading gave a gradual reduced crystallite size of the TiO 2 samples as summarized in Table 1.Additional information regarding the phase of the nanomaterials was obtained by Raman spectroscopy. The phase identification of the TiO 2 and Ag-loaded TiO 2 samples was further investigated using Raman spectroscopy performed in the range of 100e1000 cm A1 and the results are shown in Fig. 2 (b).In the pure anatase TiO 2 , the intense Raman signal with E g (1) mode appeared at 142 cm A1 followed by less intense signals with modes E g ( 2) and E g (3) were observed at 197 cm A1 and 634 cm A1 , respectively.Similarly, B 1g peak appeared at 394 cm A1 and mode (A 1g B 1g ) detected as a single merged peak at 513 cm A1 .All these peaks reveal the characteristics of the pure anatase phase of TiO 2 22.The Raman spectra of Ag/TiO 2 samples are identical to that of the pure TiO 2 , which clearly indicated that the TiO 2 retained its structure after Ag loading.No signals relating to Ag in Ag/TiO 2 sample were identified because of the relatively low concentration of Ag loaded into TiO 2 and due to its weak Raman scattering.However, changes were obvious in the position with broadened peaks.With Ag-loading, the Raman band E g (1) was shifted towards higher wavenumber while band B 1g and E g (3) broadened.Similar observation have been reported previously 46.These observations can confirm successful loading of Ag NPs over the TiO 2 surface without any phase change. The morphology of cordierite support and catalyst particles was investigated by SEM as demonstrated in Fig. 3.The bare monolithic channels of cordierite structure is obvious in Fig. 3 (a).Fig. 3 (b) depicts the surface of bare monolith channel, yet nanoparticles were not detected.In Fig. 3 (c), it can be apparently seen that catalyst was deposited evenly over the cordierite surface with no broken layer.The solegel dipcoating method used to support catalyst inside the channels resulted in a good dispersion of catalysts over the cordierite surface.The FESEM image of mesoporous structure of Ag/TiO 2 NPs over the channels surface could be seen in Fig. 3 (d). The transmission electron microscopy (TEM) images of 5 wt. Ag-loaded TiO 2 sample are shown in Fig. 4. The TEM images of low and high magnification in Fig. 4 (a andb) show mesoporous structure of Ag-loaded TiO 2 nanoparticles.It is obvious, TiO 2 NPs were spherical in shape with agglomerates due to hindered crystal growth by the presence of Ag.The dark spots reveal the existence of Ag-NPs on the TiO 2 surface.The HR-TEM image of Ag/TiO 2 NPs in Fig. 4 (c) shows lattice fringe with d-spacing value of 0.35 nm, which corresponds to (101) plane of the anatase phase of TiO 2 .Fig. 4 (d) depicts the selected area electron diffraction (SAED) patterns of Ag/TiO 2 NPs.The pattern clearly reveals bright concentric rings, which were due to the diffractions from the anatase phase TiO 2 . The N 2 adsorptionedesorption isotherms and corresponding pore size distribution curves of TiO 2 and Ag-loaded TiO 2 samples are depicted in Fig. 5.All the isotherms in Fig. 5 (a) show a type IV with high volume of N 2 adsorption in a high relative pressure (P/Po) region.It can also be observed that the size of hysteresis loop between adsorption and desorption branches is larger in high level of Ag-loading TiO 2 samples.The initial part of the isotherms at relatively low pressure (low P/Po) reveals monolayer-multilayer adsorption on the internal surface of the pores.This is also associated with fluid to crystalline phase transition of the adsorbed N 2 .However, capillary condensation could be seen in the upper part of isotherms when moving along the curve toward high relative pressure (high P/Po) part, where the steep increment in the adsorption volume can be observed.This phenomenon of adsorption can only happen when the pores become saturated with the liquid N 2 .The pore size distribution curves of TiO 2 and Ag-loaded TiO 2 nanoparticles in Fig. 5 (b), present two different two pore size distribution from 3 to 14 nm and 2e6 nm for TiO 2 and Ag-loaded TiO 2 samples, respectively. The BET specific surface areas, pore volumes and pore sizes of TiO 2 and Ag-loaded TiO 2 samples are tabulated in Table 1.The measurement shows that BET surface area (S BET ) of pure TiO 2 was 43 m 2 /g, increased to 50 and 63 m 2 /g in 3 and 5 wt. Ag-loaded TiO 2 samples, respectively.The Ag-loaded TiO 2 samples have larger pore volume than the bare TiO 2 , attributed to improve in the meso-porosity of TiO 2 .Similarly, BJH pore diameter was gradually decreased in Ag-loading TiO 2 samples.The increase in BET surface area and pore volume with reduced pore diameter may be resulted from the hindered crustal growth of TiO 2 with improved meso-porosity by Ag-loading. The chemical state of elements in Ag-loaded TiO 2 sample with binding energies was investigated by X-ray photoelectron spectroscopy (XPS) as shown in Fig. 6.The Ti 2p spectrum in Fig. 6 (a) shows the peaks with binding energies (BE) positioned at 458.23 eV (2p 3/2 ) and 463.91 eV (2p 1/2 ), attributed to Ti 4 oxidation state or TiO 2 .In the XPS spectrum of Ag in Fig. 6 (b), showing two individual peaks positioned at 367.57 and 373.60 eV with 6.0 splitting between two peaks corresponds to Ag 3d 5/2 and 3d 3/2 and demonstrated as Ag 0 or metallic silver 47.The spectrum of O 1s in Fig. 6 (c 1.The band gap energy of the pure TiO 2 was 3.11 eV, reduced to 3.01 and 2.97 eV for 3 and 5 wt. Ag-loaded TiO 2 samples, respectively.This reiterates Ag impurity level is beneficial in extending the absorption spectrum wavelength towards the visible region. The hindered, transfer and recombination process of photo-generated charges in the photo-catalyst samples were analysed by PL as displayed in Fig. 8.The emission peaks of all the samples were in the range of 450e550 nm when samples were excited at wavelength of 350 nm.In both the TiO 2 and Ag-modified TiO 2 samples, emitted peaks exhibited strong PL signals in the identified regions.Compare with the TiO 2 , the emission peak intensity of Ag-loaded TiO 2 samples gradually decreased.The existence of PL emission is attributed to the recombination of free charge carries (e A /h ).The weaker intensity of Ag/TiO 2 samples indicates a lower recombination possibilities of electronehole (e A /h ) pairs on the surface of TiO 2 48.Therefore, addition of Ag into TiO 2 catalyst would be more capable to reduce charges recombination rate to enhance TiO 2 photo-activity for CO 2 reduction applications. The TiO 2 and Ag/TiO 2 samples were analysed for the reduction of CO 2 to CO in the presence of H 2 as a reducing agent under UV light irradiation in a continuous flow cell type and monolith photo-reactor.The blank tests were conducted to confirm all the products were originated from CO 2 reduction only. Fig. 9 shows the results of dynamic CO, CH 4 and hydrations production as a function of irradiation time over the pure TiO 2 and Ag-loaded (Ag 14 3, 5 and 7 wt.) TiO 2 samples at feed flow 20 mL/min and CO 2 /H 2 feed ratio 1.0.Fig. 9 (a) relates, for the bare TiO 2 , limited photo-activity registered and giving rise to small amounts of CO evolution, attributed to higher electronehole pair's recombination rate.Photocatalytic CO 2 reduction to CO gradually increased over the irradiation time, and then reached to steady state.When the TiO 2 samples containing Ag were employed, a substantial increase in CO 2 reduction to CO was detected.This considerably improved TiO 2 photo-activity in the presence of Ag was obviously due to the charge separation and transport by Ag 49.In addition, the higher surface area provided by the monolithic support favoured a homogenous distribution of the Ag nanoparticles resulting in more light harvesting.Addition of more amounts of Ag, more CO was produced, whereas, 5 wt. Ag-loading was the optimum, then the yield rate gradually decreased with Ag-loading.At excess amount of Ag-loading, lower CO yield can be attributed to the formation of charge recombination centers over the TiO 2 surface 50. Fig. 9 (b) shows the yield of CH 4 evolution during photoinduced CO 2 reduction with H 2 using monolith photo-reactor and feed flow rate 20 mL/min with CO 2 /H 2 molar feed ratio 1.0 at different irradiations.Noticeably, the CH 4 production trends are entirely different than CO over the irradiation time irrespective the type of photo-catalysts used.Initially, a significant increase in CH 4 production was detected, then decreased rapidly at an elongated reaction time.However, a gradual increase in the production of CH 4 could be seen by loading more Ag-contents into TiO 2 .In this respect, Ag/TiO 2 co-catalyst efficiently contributes to conduct electrons towards CO 2 , thereby converting CO to CH 4 .The declined in CH 4 yield over the irradiation time can be explained based on the oxidation of CH 4 with O 2 to CO 2 , probably due to very efficient photocatalytic reaction in the presence of monolithic catalysts.However, amount of O 2 produced was not detected during CO 2 reduction process due to limitations of GC configuration. The production of hydrocarbons over Ag/TiO 2 catalysts at different Ag-loading levels and irradiation times as shown in Fig. 9 (c).Initially, large amount of hydrocarbons were detected which were declined over the irradiation time and trends were consists in all photo-catalysts.Additionally, it could be seen that hydrocarbons production rate is higher in larger Agloading levels and the results are consistent with the CH 4 production.However, the decrease in yield of hydrocarbons over the irradiation time was possibly due to their oxidation in the presence of O 2 .The hydrocarbons were not observed in the pure TiO 2 catalyst, obviously due to lower its lower photoactivity.Among the hydrocarbons, C 2 H 6 and C 3 H 6 were produced in large amounts in the presence of TiO 2 catalyst loaded with 7 Ag.These results have confirmed Ag as an efficient metal to improve TiO 2 photo-activity for the reduction of CO 2 via RWGS reaction in a monolith photo-reactor.Fig. 10 shows the yield rate and selectivity towards CO formation for the photocatalytic conversion of CO 2 by H 2 over TiO 2 and Ag-modified TiO 2 photo-catalysts with various amounts of Ag-loading.All photo-catalysts tested could reduce CO 2 for dynamic CO evolution as the main product under UV-light irradiation.With the Ag-loading, the selectivity towards CO formation approached to 99.8, implying that RWGS reaction preceded efficiently over Ag-loaded TiO 2 catalysts.Similar observations have been reported during CO 2 reduction to CO over Ag-loaded Ga 2 O 3 catalyst 26.The summary of yield rates and selectivity of CO 2 reduction products over TiO 2 and Ag-loaded TiO 2 photo-catalysts has been presented in Table 2.The maximum amount of CO detected over the optimal 5 wt. Ag-loaded TiO 2 catalyst supported over cordierite monolith was 1335 mmole gcatal.A1 h A1 , a 111 fold more than the amount of CO produced over the pure TiO 2 catalyst.The photo-catalysts activity for CO 2 reduction to CH 4 was in the order of 7 AgeTiO 2 5Ag/ TiO 2 3Ag/TiO 2 TiO 2 .Similarly, the yield of hydrocarbons production was higher in order of 7 i n t e r n a t i o n a l j o u r n a l o f h y d r o g e n e n e r g y x x x ( 2 0 1 7 ) 1 e1 6 TiO 2 3Ag/TiO 2 .The selectivity of CO production was significantly higher in both TiO 2 and Ag-loaded TiO 2 catalysts.The selectivity toward CO production over TiO 2 catalysts was 96.31, increased to 99.92 in 5 wt. Ag-loaded TiO 2 samples.As the selectivity of CO is greater than 99.9, the photocatalytic CO 2 reduction with H 2 through RWGS reaction is preferable in a continuous operation of monolith photoreactor.The significantly enhanced photo-activity of Ag/TiO 2 catalyst for dynamic and selective CO 2 to CO conversion in a monolith photo-reactor was due to efficient adsorptionedesorption processes with more production and separation of electronehole (e A /h) pairs inside monolith microchannels 42. Thermodynamically, photo-excited electrons with in the photo-catalyst could only be consumed effectively if the reduction potential of metal (M n ) is more positive than the conductance band potential of the semiconductor (TiO 2 14 A0.5 V) 51.The redox potential values of Ag and Ag 2 are given in Eqs ( 1) and ( 2).Evidently, silver has much lower redox value (more positive) than the CB of TiO 2 , thus silver could perform as an efficient source of sink to trap electrons.Therefore, significantly enhanced photo-activity of Ag/TiO 2 catalyst was perhaps due to rapid transfer of excited electrons to the Ag-particles which could enhance the photocatalytic activity for CO 2 reduction. The performance of continuous monolith photo-reactor is further evaluated based on quantum efficiency (QE).The QE can be calculated as the ratio of production rate (mole per sec) of products with photonic flux (mole per sec) strikes over the catalyst surface.For the conversion of CO 2 to CO, two electrons would be consumed and if one electronehole pair is to be generated by one photon activation, then the quantum efficiency for CO production can be defined by Eq. (3).QE 14 2 A moles of CO production rate molsec moles of photon fluxmolsec A 100 (3) Using bare TiO 2 , QE of 0.0013 was achieved for CO production which was augmented to 0.143 TiO 2 sample loaded with 5 wt. Ag.It is evident that QE for CO production was much higher in the presence of Ag-metal evidently due to hindered charge recombination rate and more light harvesting efficiency by monolith photo-reactor. The performance of Ag-loaded TiO 2 nano-catalyst was further investigated using cell type and monolith photoreactors operating in a continuous mode of operation at feed flow rate 20 mL min A1 , CO 2 /H 2 feed ratio 1.0 and operating temperature 100 C. The yield of CO production in a cell type and monolith photo-reactor over the irradiation time is presented in Fig. 11 (a).The amounts of CO produced using Ag/ TiO 2 NPs supported over monolith photo-reactor was 1335 mmole g-catal.A1 h A1 , a 209 folds more than the CO produced in a cell type photo-reactor in which catalyst was dispersed over reactor surface.This significantly enhanced photo-activity of Ag/TiO 2 catalyst in a monolith photo-reactor was evidently due to larger illuminated surface area with efficient utilization of light irradiations and more dynamic adsorptionedesorption of species over the catalyst surface.The production of CH 4 in a cell type and monolith photoreactor over Ag/TiO 2 catalyst at different irradiation time is depicted in Fig. 11 (b).Initially, yield rate of CH 4 production in a cell type and monolith photo-reactors were similar.However, over the irradiation time, production of CH 4 in a cell type reactor declined rapidly, yet there was continuous production of CH 4 in a monolith photo-reactor.These observations could be explained based on the adsorptionedesorption process over the catalyst surface and reaction mechanism of CO and CH 4 production as explained in mechanism section.In general, using cell type photo-reactor, desorption of reactants were not very fast, CO adsorbed over the catalyst surface was finally converted to CH 4 .However, in a monolith photoreactor, these processes were very fast, thus only small amount of CH 4 detected over the irradiation time.Similar observations has been reported previously 43. . Fig. 9 e Time dependent CO (a), CH 4 (b) and hydrocarbons (c) amounts generated on TiO 2 and Ag-loaded TiO 2 monolithic nano-catalysts in continuous photo-reactor during CO 2 reduction with hydrogen: Conditions: 60 mg catalyst, reaction temperature 100 C, ambient pressure, space velocity 0.13 s 1 , feed ratio CO 2 /H 2 1.0, and total gas flow rate 20 mL min 1 . Fig. 10 e Yield rate and selectivity towards CO evolution over Ag-loaded TiO 2 catalysts. It is generally accepted that the photo-catalyst efficiency is mainly dependent on the light absorption ability, surface properties (e.g., specific surface area, pore structure, pore volume and adsorption property etc.) and photo-generated electron/hole pairs separation efficiency.It is evidenced that photo-activity for CO evolution rate over the TiO 2 can be improved by 111 fold via 5 wt. Ag-loading.However, as discussed above that the TiO 2 surface area is only slightly different than the Ag/TiO 2 sample, indicating that this factor is not crucial to the photocatalytic activity for Ag/TiO 2 in photo-catalysis application.Similarly, photo-activity for CO evolution rate over the 5 wt.Ag/TiO 2 can be improved by 209 fold more using monolith photo-reactor than the cell type reactor under the same operating conditions.Therefore, the enhanced photocatalytic activity of semiconductor photocatalyst is greatly dependent on the type of photo-reactor used for activity test.The significantly enhanced CO yield inside monolith was evidently due to large illuminated active surface area inside micro-channels with efficient adsorptionedesorption process.Therefore, the role of cordierite honeycomb monolith loaded with Ag is obvious for dynamic CO production in continuous photo-reactor operation. The stability of Ag-loaded TiO 2 catalyst was further investigated to evaluate the life of catalyst in a continuous operation of monolith photo-reactor.In order to investigate the stability of Ag/TiO 2 catalyst, all the experiments were repeated in cyclic runs under the identical operating conditions.After each cyclic run, the reactor was flushed with helium for 2 h before starting the next run.The reused stability analysis for photocatalytic CO 2 reduction with H 2 to CO over 5 wt. Ag-loaded TiO 2 catalyst is illustrated in Fig. 12 (a).It is noticeable to see that CO production rate was higher in the first run which slightly decreased in the second and third experimental runs over the entire irradiation time.Therefore, the Ag-loaded TiO 2 catalyst immobilized onto monolithic support provides prolong stability in cyclic runs.The stability of Ag-loaded TiO 2 catalyst for photocatalytic CO 2 reduction to CH 4 is presented in Fig. 12 (b).Compared to the first cyclic run, in the second cyclic run, the CH 4 production increased significantly at the start of the run and then gradually decreased.This was perhaps due to some of the carbon species adsorbed over catalyst the surface was converted to CH 4 as similarly reported previously 51.However, a decrease in activity observed in the third cyclic runs, possibly because the catalyst lost its partial photo-activity for CH 4 production.The colour of Ag-loaded catalyst during photocatalytic CO 2 reduction was only slightly changed in every cyclic run.These results confirmed higher stability of Ag-loaded TiO 2 catalyst supported over cordierite monoliths. During the cyclic experiments, the color of the catalyst was gradually changed and deactivation was observed.Therefore, characterizations for the fresh and used catalyst was conducted to investigate about the deactivation perspective and change of morphology.The used sample was 5 wt. Ag/ TiO 2 catalyst collected after 32 h reaction time in a third cyclic run.The coke formation on the surface of catalyst was investigated using Energy-dispersive X-ray spectroscopy (EDX) as depicted in Fig. 13.Fig. 13 (a) and (b) depicts the morphology and composition of the fresh 5 wt. Ag/TiO 2 catalyst sample.It is obvious from the EDX analysis that Ag of 4.3 wt. and carbon of 4.1 wt. was present in the sample.The Ag-loading was much closer to the actual loading of 5 wt. Ag, yet carbon was detected possibly due to organic species or due to carbon tape used for the sample analysis.On the other hand, carbon deposited on the surface of TiO 2 was increased to 10.6 wt. for catalyst used for 32 h in a continuous operation of monolith photo-reactor.This increased in the amount of carbon maybe due to adsorption of intermediate carbon species over the TiO 2 surface during photoinduced CO 2 reduction reaction.Therefore, partial loss of photo-activity was due to formation of carbon species over the Ag/TiO 2 catalyst during photo-induced CO 2 reduction with hydrogen in a dynamic monolith photo-reactor. To further evaluate the carbon species deposited over the catalyst surface, FTIR analysis of 5 wt. Ag/TiO 2 catalyst before the reaction and after the third cyclic run was conducted and the results are depicted in Fig. 14.The spectrum reordered for fresh Ag/TiO 2 catalyst reveals absorption peaks at 1623 cm A1 and 3364 cm A1 , and the broad absorption bands at 400-700 cm A1 , which are attributed of the vibration of OH and TieO bonds.On the other hand, FTIR was employed to catalyst used for 32 h in cyclic runs to examine the presence of carbon and other intermediate species deposited over the Ag/ TiO 2 surface.Compared to fresh catalyst, the peak intensity detected at 1623 cm A1 was increased due to water produced during RWGS reaction which was adsorbed over the TiO 2 surface.However, the peaks to classify coke were not identified in the pure and used Ag/TiO 2 samples.Additionally, several peaks observed in the region of 950 cm A1 to 1400 cm A1 attributed to CO and intermediate hydrocarbons species adsorbed over the catalyst surface.The peak detected at 2919 cm A1 can be attributed to stretching vibration of CH group over the TiO 2 surface 52.Therefore, the partial decreased in Ag/TiO 2 photo-activity in cyclic runs was due to adsorption of intermediate carbon species over the catalyst surface which prevented dynamic photo-induced CO 2 reduction to CO in a monolith photoreactor. The reaction mechanism was studied to get insight of CO 2 photo-reduction over Ag/TiO 2 catalysts.In the photocatalytic CO 2 reduction process, the mechanism for CO and hydrocarbon production is complex and begins upon the photoexcitation of semiconductor.The photo-generated electron (e A ) and hole (h ) involves in breaking OeCeO and HeH bonds with the formation of CeO and CeH bonds.The electronehole pairs separation and production of CO and hydrocarbons are illustrated in Eqs.(4e10) As the photocatalytic activity is closely related to the band structure of photo-catalyst, separation and transportation of photo-generated carriers (i.e., electrons and holes) as well as the redox potential, the enhanced photocatalytic mechanism can be explained by the scheme presented in Fig. 15 20,53.These products can be understood by comparing the conduction and valance band bands energies of TiO 2 with the reduction potential of CO 2 for the production of CO, CH 4 and hydrocarbons.Since, the conductance band of TiO 2 (A0.50 eV) lies above the reduction potential of CO 2 /CO (A0.48 eV), CO production as the main product is possible.Under the light irradiations, VB electrons of TiO 2 excited to CB creating holes in VB.Without metal-loading, these charges recombine back and only a fraction of electrons and holes participate in reduction and oxidation process, thus, TiO 2 shows a quite low photocatalytic activity.When Ag was loaded on TiO 2 surface, the CB electron of TiO 2 can transfer to it which causes electronehole pair separation.Furthermore, more electrons could be trapped if the metal reduction potential is more positive than the CB of TiO 2 54.As the redox value of Ag /Ag is lower (0.79)than the CB of TiO 2 (A0.50 V), thus electron can effectively be transferred to silver.This process eventually decreases the rate of recombination of the photo-generated electronehole pairs.The monolithic support is well known in efficient light harvesting with excellent distribution over the catalyst surface.Thus, faster electron production over the Ag/ TiO 2 loaded monolithic surface and transfer to CO 2 is expected to occur.The expressively enhanced in CO yield rate over Ag/ TiO 2 was clearly due to higher trapping and mobility of electrons by Ag for CO 2 reduction inside monolith channels.In general, dynamic and selective CO 2 conversion to CO at a higher yield rate was due to using cordierite honeycomb monolith support loaded with Ag/TiO 2 nanoparticles."
  },
  {
    "title": "Conclusions",
    "content": "Ag-loaded TiO 2 nano-catalysts with different concentration of Ag were prepared via a modified solegel method and were immobilized over the monolithic support.The photo-activity test of Ag/TiO 2 catalyst for dynamic CO 2 reduction to CO with hydrogen via RWGS reaction was tested in a continuous cell type and monolith photo-reactor.CO 2 was efficiently converted to CO as the main product over Ag/TiO 2 in a monolith photo-reactor than using cell type photo-reactor.The maximum yield rate of CO over 5 wt. Ag-loaded TiO 2 was 1335 mmole g-catal.A1 h A1 at selectivity 99.92, 111 times higher than the pure TiO 2 catalyst using monolith photoreactor.The enhancement in the photocatalytic activity of CO production was attributed to hinder charges recombination by Ag.Similarly, photo-activity for CO evolution rate over the 5 wt.Ag/TiO 2 can be improved by 209 fold more using monolith photo-reactor than the cell type reactor under the same operating conditions.The yield of CO was greatly augmented in the continuous monolith photo-reactor due to larger illuminated surface area, higher photon energy consumption and better reactor volume utilization.The stability test revealed the prolonged activity of the Ag-loaded TiO 2 catalyst supported over monolith channels than using cell type photo-reactor.Therefore, cordierite monolithic support could improve photo-activity, selectivity and stability of photo-catalysts and it is appropriate for efficient photocatalytic CO 2 reduction via RWGS reaction for CO production with enhanced yield rate and selectivity. Fig. 1 e Schematic of photocatalytic reactors for reduction of CO 2 to CO with hydrogen as reducing agent; (a) Cell type photoreactor, (b) Monolith photo-reactor. i n t e r n a t i o n a l j o u r n a l o f h y d r o g e n e n e r g y x x x ( 2 0 1 7 ) 1 e1Please cite this article in press as: Tahir M, Amin NAS, Photo-induced CO 2 reduction by hydrogen for selective CO evolution in a dynamic monolith photoreactor loaded with Ag-modified TiO 2 nanocatalyst, International Journal of Hydrogen Energy (2017), http://dx.doi.org/10.1016/j.ijhydene.2017.05.039 Fig. 3 e SEM images of (a) bare cordierite monoliths, (b) bare channel surface, (c) catalyst coated channels, (d) FESEM image of Ag/TiO 2 nanoparticles. Fig. 4 e TEM images (a and b) of 5 Ag/TiO 2 sample, (c) HR-TEM image of 5 Ag/TiO 2 sample with d-spacing analysis, and (d) SAED analysis of corresponding sample. i n t e r n a t i o n a l j o u r n a l o f h y d r o g e n e n e r g y x x x ( 2 0 1 7 ) 1 e1Please cite this article in press as: Tahir M, Amin NAS, Photo-induced CO 2 reduction by hydrogen for selective CO evolution in a dynamic monolith photoreactor loaded with Ag-modified TiO 2 nanocatalyst, International Journal of Hydrogen Energy (2017), http://dx.doi.org/10.1016/j.ijhydene.2017.05.039TiO 2 samples presented the increase in the optical absorbance.An estimate of the optical band gap (Eg) of the Ag/TiO 2 samples has been obtained using the KubelkaeMunk function F(R).The band gap energies were determined from the plot of (FR A hv) 1/2 versus photon energy (hv) by extrapolating the linear region of the plot to the intercept of the photon energy axis as shown in Fig.7 (b).The calculated band energy values of TiO 2 and Ag-loaded TiO 2 catalysts are listed in Table Fig. 5 e (a) N 2 adsorptionedesorption isotherms of TiO 2 and Ag/TiO 2 samples; (b) pore-size distributions of corresponding samples calculated from the desorption branch of isotherms. Fig. 6 e XPS analysis of 5 wt. Ag/TiO 2 sample: Profiles of (a) Ti 2p, (b) Ag 3d, (c) O 1s and (d) C 1s. Photon energy (eV) Fig. 11 e Performance analysis of cell type and monolith photo-reactor; (a) Yield of CO, (b) Yield of CH 4 . Fig. 12 e Stability analysis for CO and CH 4 production during CO 2 reduction with H 2 over 5 wt. Ag-loaded TiO 2 monolithic catalyst in continuous photo-reactor: (a) CO evolution, (b) CH 4 evolution. Fig. 13 e EDX analysis of 5 wt. Ag/TiO 2 catalyst loaded over monolithic support: (aeb) EDX analysis of fresh Ag-loaded TiO 2 catalyst, (ced) EDX analysis of spent Ag-loaded TiO 2 catalyst. Fig. 15 e Schematic illustration of photo-induced charge separation and transfer process in Ag/TiO 2 catalyst under UV-light irradiations in a monolith photo-reactor. ) reveals peaks centered at 529.47, 531.52 and 533.32 eV.The BE value of 529.47 eV is attributed to the lattice oxygen O 2A in TiO 2 , which is in agreement with the reported values.The oxygen peaks at around 531.52 eV and 533.32 eV are due to H 2 O or the free hydroxyl group (OeH) to the surface.Furthermore, Fig.6 (d)shows the presence of two peaks of C1s located at 284.60 eV and 288.37 eV.The high resolution peak at 284.6 eV is ascribed Summary of physiochemical characteristics of TiO 2 and Ag/TiO 2 samples. a Crystal size calculated using Scherrer equation based on 101 peak of TiO 2 b S BET : BET surface area c V meso : mesoporous volume d d BJH : BJH pore diameter e E bg : energy band gap calculated using Tauc equation, from a plot of FR A hv 12 versus photon energy (hv). AgeTiO 2 5Ag/ Summary of yield rates, selectivity and quantum yield over various catalysts. i n t e r n a t i o n a l j o u r n a l o f h y d r o g e n e n e r g y x x x ( 2 0 1 7 ) 1 e1 6 Please cite this article in press as: Tahir M, Amin NAS, Photo-induced CO 2 reduction by hydrogen for selective CO evolution in a dynamic monolith photoreactor loaded with Ag-modified TiO 2 nanocatalyst, International Journal of Hydrogen Energy (2017), http://dx.doi.org/10.1016/j.ijhydene.2017.05.039 The authors would like to extend their deepest appreciation to Ministry of Higher Education (MOHE) Malaysia, for financial support of this research project under FRGS (Fundamental Research Grant Scheme, Vot 4F876)."
  }
]