[
  {
    "title": "Doi",
    "content": "10.1002/admi.202000468"
  },
  {
    "title": "Article_Title",
    "content": "Boosting Visible‐Light Photocatalytic Performance for CO<sub>2</sub> Reduction via Hydroxylated Graphene Quantum Dots Sensitized MIL‐101(Fe)"
  },
  {
    "title": "Abstract",
    "content": "conversion strategy is a prospective solution, which not only efficiently reduces a large amount CO 2 emission into the atmosphere but also brings more valuable energy sources through CO 2 conversion. 3,4Learning the carbon cycle of photosynthesis in nature, many researchers studied the photocatalytic CO 2 reduction under solar irradiation.Indeed, as a renewable and clean energy, solar-energy-driven energy source has been used in CO 2 reduction system through the application of active catalysts to produce precious short-chain hydrocarbon fuels and other value-added chemicals, 5 which is considered to be an ultimate solution to the growing environmental problems on greenhouse gases pollution. 6,7Therefore, it is important and urgent to develop a high-efficient photocatalyst which are capable of photocatalytic reduction of CO 2 under visible light irradiation.Recently, graphene quantum dots (GQDs) are attracting more and more attention due to their numerous attractive physicochemical properties and wide-ranging applications in many fields. 8,9Compared with common semiconductors, GQDs are more environment friendly, low cost and photostability. 101112 High-quality colloidal GQDs with excellent optical properties such as the broad-spectrum response of visible light and various fluorescent are very suitable in diverse applications, such as bioimaging, 13,14 light emitting diodes 151617 and photocatalysis, 181920 especially CO 2 reduction. 212223 Despite these significant advantages, pure GQDs nanoparticles have a poor CO 2 reduction catalytic property owing to their large exciton binding energy, 24 which greatly decreases the capability of separating electron-hole pairs.Combining with suitable substrate is an effective way to change the electronic density of composites and tune their optical, electrical, and transport properties. 25Therefore, in order to obtain better photocatalytic CO 2 reduction performance, it is still important to accurately fabricate the catalyst substrate with another suitable material.Owing to the large specific surface area, high porosity and uniform porous structures, metal organic frameworks (MOFs) offer a variety of outstanding performances and exhibit a great potential in photocatalysis, lithium ion batteries, gas adsorption and separation and so on. 262728 On the one hand, mesoporous"
  },
  {
    "title": "Experimental",
    "content": "All chemicals and solvents in the researches were of commercially available analytical grade and used without any additional treatments.And all chemicals and reagents in this experiment used were supplied by Sinopharm Chemical Reagent Co., Ltd., (China). GQDs was prepared by the method of water-phase molecular fusion with some modifications. 39In a typical procedure for preparing OH-GQDs, pyrene (1 g) was nitrated into trinitropyrene in hot nitric acid (HNO 3 , 80 mL) at 80 C under stirring and refluxing for 12 h.After natural cooling, the mixture was diluted with deionized (DI) water (1 L) and filtered by a 0.22 mm microporous membrane to remove the excess acid.The resultant yellow 1,3,6-trinitropyrene was dispersed in a NaOH solution of DI water (0.2 m) under highintensity ultrasonication for two hours.The reactants were transformed into Teflon-sealed autoclave and heated at 200 C for 10 h.After cooled to room temperature, the watersoluble samples of GQDs were filtered through the way of membrane filtration to remove insoluble carbon products, then further dialyzed in a dialysis bag for 2 days to remove sodium salt and unfused chemical molecules.The GQDs containing Hydroxyl Groups were dried at 80 C for followup experiments. MIL-101(Fe) was synthesized as reported in the previous literature with some modifications. 40In a typical synthesis, Iron(III) chloride hexahydrate (FeCl 3 6H 2 O, 2.45 mmol) and 1,4-benzenedicarboxylic acid (H 2 BDC, 1.24 mmol) were mixed into 15 mL N,N-Dimethylformamide (DMF) and then the suspension was stirred with a magnetic stirrer until absolutely dissolved into homogeneous solution, then it was transferred to Teflon-sealed autoclave and heated at 110 C for 20 h.Upon cooling down the reactants to room temperature, the purified MIL-101(Fe) was obtained through cleaning and centrifugation and dried at 60 C in a Vacuum oven for overnight. A specific schematic diagram was exhibited that the synthetic method of GQD/Fe-based MOFs photocatalysts in Scheme 1.The GQD/MIL-101(Fe) (G/M101) composites were synthesized by a feasible solvothermal reaction by controlling a series of the mass ratios of the GQDs versus original MOFs substances.The preparation procedure of G/M101 composites referred to the above procedure of MIL-101(Fe).The only different point was the addition of GQDs solution to the reactant mixture during the synthesis process.Firstly, the MIL-101(Fe) was prepared by FeCl 3 6H 2 O (2.45 mmol), H 2 BDC (1.24 mmol), and DMF (15 mL) and stirred vigorously until it turned into the yellow-orange mixture.Secondly, gradually dropped a scheduled amount of GQDs into the above homogeneous solution and then stirred continuously till it uniformly dispersed.Then pour the brown solution into a 50 mL autoclave for 20 h at 110 C.After cooling to room temperature, the brown solid was centrifuged from the mixed solution, then purified by DMF and ethanol for three times, finally dry under vacuum by drying in oven at 60 C for 12 h.The final synthetic products were marked as G/M101-3, G/M101-5, G/M101-7, G/M101-9, and G/M101-11 the number of 3, 5, 7 ,9, and 11 was the mass ratio of GQD solutions to MIL-101(Fe), respectively. Transmission electron microscope (TEM) images were obtained from a TF20/2100F transmission electron microscope with accelerating voltage of 200 kV.Scanning electronic microscopy (SEM) observations were performed using a SIGMA HD scanning electronic microscopy.Power X-ray diffraction (XRD) patterns with the crystal structures of samples performed using a Bruker D8 ADVANCE XRD diffractometer with run at 40 kV, 0.15418 nm, 40 kV and 40 mA.And the scan angle was 5-40, the scan rate was 5 min -1 .The N 2 adsorption and desorption isotherms were analyzed by using the Tristar 3000 analyzer at 77.4 K, surface areas were estimated by applying the Brunauer-Emmett-Teller (BET)equation, BJH calculation and DFT calculation further confirms the pore diameters.UV-vis diffuse reflectance spectra (UV-vis DRS) was identified using a UV-2600 UV-vis diffuse reflectance spectrometer within the test range of 200-800 nm to test the light absorption properties, and BaSO 4 was used as a 'reflectance standard in this spectrometer.X-ray photoelectron spectra (XPS) were recorded on a an ESCALAB 250Xi system to characterize the particles' surface with its energy analyzer working in the pass energy mode at 100 eV and spot size of 500 m, the Al K line was applied as the excitation source(hv 1486.6eV), and the spectrometer was calibrated against the C 1s peak at 284.8 eV, and the Shirley-type background spectrum was applied to estimate the background and peaks of X-ray photoelectron spectroscopy (XPS) spectra.Raman spectra were recorded on a Renishaw in plus laser Raman spectrometer was carried out by using Raman Spectrograph at an excitation wavelength of 532 nm (Horiba, LabRAM HR Evolution, France).FT-IR spectroscopies were collected on Thermo scientific IS50 Fourier transform infrared Spectrometric Analyzer in the 3500 -500 cm -1 region to study the composition and structure of the catalyst.The photoluminescence (PL) emission spectra were performed on Hitachi F-7000 photoluminescence with an excitation wavelength of 540 nm to test the lifetime of photogenerated carriers. CO 2 photocatalytic reduction was conducted over G/M101 composites under visible-light irradiation.The CO 2 photocatalytic reduction reaction was carried out in a stirred polytetrafluoroethylene reactor with an internal volume of 150 mL and a wall thickness of 5 mm under a closed system.The solar irradiation was simulated by using a high-pressure Xe lamp (300 W, 500 mW cm -2 ) with a cutoff filter (420 800 nm) in the entry position of the lamp, which ensure that the experiment was conducted in the visible light range.Light source was monitored to ensure consistency across all experiments.20 mg catalyst and 2 mL mixture of acetonitrile (MeCN) and triethanolamine (TEOA) (4:1 v/v) were moved into the photoreactor, MeCN was the solvent to dissolve CO 2 , and TEOA as sacrificial agent, which should be stirred to ensure that the photocatalyst sample was homogeneously dispersed with high purity CO 2 .And CO 2 was continuously blown into the reactor.Then, the irradiation was started above the sealed photoreactor and a magnetic stirrer (340 rpm) was used to agitate the suspension of the catalyst to fully contact the gas.The photocatalytic reaction was carried out for a certain period of time and the gas product was quantitatively analyzed by gas chromatography (GC) equipped with FID detector (with methanizer). The photocurrent measurements, electrochemical impedance spectroscopy (EIS) and Mott-Schottky (MS) analysis were measured collected by using a three-electrode structure on a CHI660C Apparatuses electrochemical workstation.This application of three-electrode system accorded to previously reported literature. 41,42To prepare an electrode of GQD/MOF composites, 20 mg the GQD/MOF composites were added into chitosan solution stirred and ultrasonicated for some time.The dark brown composites were uniformly placed on the indium tin oxide glass (ITO glass), and then dried under vacuum at 60 C for 10 h.The catalyst composite was used as a working electrode, the platinum foil was used as a counter electrode and the normal hydrogen electrode (NHE) was used as a reference electrode in a typical three-electrode system.The amperometric I-t curves were measured at a 0.8 V bias voltage potential (vs NHE) in this analysis.The EIS measurements were collected at open circuit potential under the dark circumstance in the frequency range between 10 5 and 10 -2 Hz.The Mott-Schottky tests were identified to obtain the flat-band potential of the Fe-based MOFs and G/M101 composites via an impedance-potential model.All of the above electrochemical measurements were conducted with 0.2 m Na 2 SO 4 solution."
  },
  {
    "title": "Results_and_Discussion",
    "content": "XRD measurements of all samples were given in Figure 1a,b for comparison.It showed that the diffraction peaks located at 26.2 in the XRD pattern of GQDs with a (002) peak, which interlayer spacing is the same as graphite (3.34 A) (Figure 1a). 39The characteristic peaks of MIL-101(Fe) were confirmed by excellent agreement with the references reported previously. 36,42,43The XRD patterns of the as-synthesized GQD/ MIL-101 samples were shown in Figure 1b.It could be seen that the X-ray diffraction peaks of G/M-3,G/M-5 and G/M-7 match well with the standard MIL-101 (Fe) sample.In addition, when the loading of GQDs is more than 9, some peaks of Fe-base MOFs disappeared and some other peaks shifted maybe attributed to the excessive GQDs added.Because the excessive GQDs may change the balance between organic ligands and metal ions and then effect the formation of MOFs. 29The similar phenomena existed in other studies of graphene-based sensitized MOF composites, such as CoFe 2 O 4 /GQDs 44 and GO/ MIL-100(Fe). 45However, the peak of GQD cannot be observed, which may be due to the low content of GQD in the composite. 46These results of XRD patterns suggested that main typical characteristic peaks of MIL-101(Fe) were preserved in G/ M101-5 composite, revealing this composite was composed of MIL-101(Fe). The N 2 adsorption-desorption isotherms, pore size distributions of BJH and DFT (Figure 2), and other physical structure details (Table S1, Supporting Information) of MIL-101(Fe) and G/M101 composites were also obtained.The N 2 adsorptiondesorption isotherms observed in Figure 1a showed that MIL-101(Fe) was attributed to type I adsorption isotherm, the rapid growth of the low-pressure region (P/P 0 0.01) was related to the existence of micropore structure.The isotherms of GQDs was attributed to IV-type adsorption curve, which sample has been completely dry before BET test, the pore-size distribution of GQDs shows a sharp peak of mesopores around 3.7 nm (in Figure S3, Supporting Information).After loading GQDs on MIL-101(Fe), the G/M101 samples were ascribed to type IV adsorption isotherm, which indicated that the formation of mesoporous structure in the framework.It can be well confirmed by the pore size distribution.Because of the strong dispersive forces of the GQDs could cause distortion in the structure of MIL-101(Fe), the enhanced pore volume in the range of 2.0-8.7 nm could be ascribed to the emergence of new mesoporous created at the interface between the GQD and MIL-101(Fe). 47Due to CO 2 molecules could absorb on the activated surface sites of photocatalysts, the increase of pore volume could make it easier for CO 2 molecules to access the adsorption mesoporous and thus enhanced the reduction efficiency of CO 2 . 484950 The FT-IR of pure MIL-101(Fe) and G/M101 composites were also exhibited in Figure 3a.For pristine MIL-101(Fe), the absorption peaks observed at 1589 and 1388 cm -1 were attributed to asymmetric vs(CO) and the symmetric vs(CO) vibrations of carboxyl groups, respectively, indicating carboxylate existed in the sample, which was consistent with the previous literatures. 51The stretching and bending vibrational bands in the range of 600-1600 cm -1 correspond to benzene ring. 52For the OH-GQDs sample in Figure S4b in the Supporting Information, the sharp peak of COH can be observed at 1270 cm -1 in the IR spectrum. 39Moreover, the main peaks of G/M101 composite were almost the same as pure MIL-101(Fe), compared to MIL-101(Fe), there was another peak of G/ M101-5 sample observed at 1265 cm -1 (see Figure S4a, Supporting Information) could corresponding to the band of C-OH of GQDs, 53,54 illustrating that the GQDs successfully incorporated into MIL-101(Fe).Remarkably, in the case of G/M101(Fe) composites, the characteristic absorption bands of MIL-101(Fe) dominate the spectrum, this result suggested that the loading of GQDs did not inhibit the constitution of the MIL-101(Fe) unit and they only slightly affected the lattice structure of MOF, which was consistent with the XRD patterns.Pure MIL-101(Fe) and G/M101-5 composite was obtained to further study their molecular structures.As displayed in Figure 3b, the Raman spectrum of G/M101-5 composite depicted peaks at 1370 and 1501 cm -1 , which were attributed to the D and G bands of the GQDs, respectively. 55These results in-depth confirmed the formation of composites between MOFs and GQDs.As shown in Figure S5 in the Supporting Information, the thermogravimetric curves of both MIL-101(Fe) and G/M101-5 exhibited a series of weight losses from 100 C to 600 C.The first weight loss was between 100 and 300 C due to evaporating some solvent molecules and water. 56The significant weight losses of MIL-101 and G/M101 were observed at 300 C could be due to the decomposition of ligands.As the temperature exceeded 500 C, the weight of MOFs remained almost unchanged, suggesting that most of the organic matter had been decomposed by 500 C. SEM and TEM were carried out to determine the microstructures and the interfacial structures of MIL-101(Fe) and G/M101-5 composite.The Figure S6 in the Supporting Information displayed SEM images of pure MIL-101(Fe) and G/M-5 to directly demonstrate their structure.The TEM images (Figure 4a,b) further illustrated that the morphologies of MIL-101(Fe) and G/M101-5 were octahedral and needleshaped structure, respectively.It may be caused by solvation that has a great influence on the nucleation rate of MOFs. 57igure 4c,d average lateral size is 3.5 0.7 nm.In addition, the significantly determined GQDs average lateral size was 0.21 nm corresponding to that of graphene (100) planes, the graphite was also observed in the XRD of GQDs (Figure 1a).The structure of G/M101-5 was taken by TEM images (Figure 4e) and HRTEM images (Figure 4f), it was obvious that GQDs nanoparticles were closely deposited on the surface of the MIL-101(Fe) substrate, which provided a path for the conduction of electron transfer. 30The size and morphology of GQDs did not change significantly after loading on MIL-101 (Fe), which can be further observed that the GQDs on the Fe-based MOF maintain photostability due to their sp 2 bonding.These results further proved the water-soluble OH-GQD successfully incorporation with the MIL-101(Fe) to form the binary composite via two-step synthesis. XPS was employed to determine the chemical and electronic states of G/M101-5.The XPS spectra of G/M101-5 composite was shown in Figure 5.The overall XPS survey spectrum (Figure 5a) indicated that G/M101-5 composite contained C, O and Fe elements.In Figure 5b, the peak deconvolution of the C1s signal of G/M101-5 illustrated four peaks at about 284.8, 286.1, and 288.5 and 290.6 eV, corresponding to CC, CO, CO and OCO groups, respectively, 58,59 which were similar to the spectrum of C 1s orbital of MIL-101(Fe).The highresolution XPS spectrum of O1s (Figure 5c) could be deconvoluted into two peaks, corresponding to the Fe-O bonds of G/M101-5 at a binding energy of 529.8 eV and the OH at 531.8 eV. 39,60As shown in Figure 5d, the high-resolution XPS spectra of Fe 2p appeared two peaks, displaying the strong signal peak of Fe 2p 1/2 at 724.8 and Fe 2p 3/2 at 711.2 eV.The two weak peaks at 718.5 eV were a feature of Fe 3 as a satellite signal of MIL-101(Fe) 61 .All of the XPS spectra were similar to the previously reported literature of Fe-based MOFs or GQDs. 39,51he XPS photoelectron spectra of MIL-101(Fe) in Figure S7 in the Supporting Information.Therefore, the XPS analysis was consistent with preceding analysis, GQDs were successfully adhering to MIL-101(Fe) under the solvothermal reaction. The photocatalytic activities of a series of G/M101 samples for the reduction of CO 2 to CO were investigated, and the results are shown in Figure 6.Under the irradiation of Xe lamp, the gas production of CO was detected by GC through intermittently taking gas samples from the photocatalytic reactor.As shown in Figure 6a, MIL-101(Fe) showed a weak visible light photocatalytic activity and a production of CO was only 46.20 mol h -1 g -1 .After the loading of GQDs, the production of CO increased with the increasing content of GQDs from 0 to 5, the maximum production of CO achieved in the present study was 224.71 mol h -1 g -1 under the visible-light photocatalysis over G/M101-5.In addition, the CO production over G/M101-5 was about 5 times higher than MIL-101(Fe) after five hours (in Figure 6b), which demonstrated that G/ M101-5 exhibited the highest visible-light photo-reduction efficiency under the present experimental conditions.Taken together, the G/M101-5 composite was the best catalyst for CO 2 photoreduction.However, continuous increase of the loading content of GQDs on MIL-101 (Fe) caused a decrease in the production rate of CO.The reason for this phenomenon was the shielding effect of the GQDs which may reduce the number of active sites and thus weaken CO 2 reduction ability of MIL-101 (Fe).Moreover, it is demonstrated that they have poor light absorption and photo-generated electron carrier separation, which is further proved by photoelectric properties.To assess the recycling stability of the MIL-101(Fe) and G/ M101-5 catalyst, the cycling of photocatalytic CO 2 reduction under visible light irradiation was tested as shown in Figure 6c, photocatalytic activity of G/M101-5 was not obvious deterioration after continuous 24 h, demonstrating that the G/M101-5 sample possessed high recycling stability.To further investigate the stability of the photocatalyst, the XRD, FT-IR and UV-vis spectra of the used G/M101-5 sample were measured for comparison, which showed no obvious change compared with fresh G/M101-5 composite Figure 6d-f .In summary, the results indicated that G/M101-5 remained excellent structural stability during the photocatalytic process.Besides, the controlled experiments confirmed that no CO was produced in the absence of CO 2 , solvents, or visible light, which further identified significant role of G/M101-5 composite in the photocatalytic system.Therefore, CO was surely generated from the photoreduction of CO 2 by G/M101-5 photocatalysts (Figure S8, Supporting Information).Compared with the previously reported photocatalysts, the as-prepared G/M101-5 also exhibited a relatively better photocatalytic product formation rate of CO, demonstrating the GQDs was loaded on MIL-101(Fe) can influence enhancing energy harvesting under the visible-light region.(Summarized in Table S2 in the Supporting Information). To further study the alterations of photocatalytic performance with inducement of the GQDs, the absorbance properties of the pristine MIL-101(Fe) and a series of G/M101 composites are measured by UV-vis DRS, and the results are displayed in Figure 7a.Apparently, all samples had strong light absorption at 200-700 nm.MIL-101(Fe) exhibited great optical absorption between UV light and visible light region, which could be attributed to Fe 3 O clusters existed in MIL-101(Fe). 54v.Mater.Interfaces 2020, 2000468 The absorption edge of G/M101 samples showed a redshift with the loading GQDs compared with that of pristine MIL-101(Fe).The reason for this phenomenon could be ascribed to the synthesis nanocomposites have an increased visible light response ability, which can improve the photocatalytic activity with the generation of more photoinduced electronhole pairs. 62Moreover, the color variation of a series of G/M101 composites were observed (inset in Figure 5a).It was obvious that bright orange MIL-101(Fe) sample turned to dark brown as the concentration of GQD increased.The spectra were transformed to Kubelka-Munk function versus the light energy, (Ah) 2 f(h) functionality.Extrapolations of liner regions of the plots enabled estimation of energy of direct band-gap transition for samples.As displayed in Figure 7b, which can be seen that the bandgaps of G/M101-5 and MIL-101(Fe) were 1.92 and 2.81 eV from the Tauc plot, respectively, demonstrating that the loading of GQDs narrowed the bandgaps.Furthermore, the bandgap of GQDs was calculated to be 2.77 eV according to analysis of UV-vis (Figure S9, Supporting Information).The results indicated that the total absorption of the photocatalysts had a wide response in the light range of 200-700 nm, and an enhanced visible-light response of G/M101-5 catalyst was achieved, indicating that GQDs plays a key role in composites. It was well known that the prolonged time of photogenerated charge carries played significant roles in the photocatalysis.Thus, PL spectra, Nyquist impedance and transient photocurrent responses of MIL-101(Fe) and G/M101-5 were performed to estimate the migration and recombination processes of the photogenerated charge carriers, and interface charge transfer behavior between GQDs and MOFs. Figure 7c displayed the PL spectra of MIL-101(Fe) and G/M101-5 with an excitation wavelength of 520 nm light irradiation.A strong and bright red emission at 787 nm was observed in the PL spectra.It was obvious that the PL intensity of G/M101-5 weaker than that of pristine MIL-101(Fe), indicating the G/M101-5 had a much longer separation of electrons and holes pairs compared to the bare MIL-101(Fe).Besides, PL spectra of different G/M101 photocatalysts can be showed in Figure S10 in the Supporting Information.Therefore, the loading of GQDs could effectively suppress the recombination of photo-generated electron-hole pairs.As a result, the surface electrons had the longer separation on G/M101-5.The EIS Nyquist impedance plots of MIL-101(Fe) and G/M101-5 composite is shown in Figure 7d.It could be seen that the radius of Nyquist arc of G/M101-5 was smaller than that of original MIL-101(Fe), indicating that the incorporation of GQDs with MOFs accelerated the charge transfer efficiency.This result is consistent with the previous reports. 61The transient photocurrent responses of different catalysts were performed by a couple of on-off cycles of visible-light irradiation.As illustrated in Figure 7e, MIL-101(Fe) showed an apparent photocurrent generated by the electron transfer under the visible-light irradiation.However, the photocurrent of G/M101-5 was significantly improved by the introducing of GQDs.Thus it can be seen that the enhanced visible light absorption and rapid separation efficiency are utmost important for the significant photocatalytic CO 2 reduction of the G/M101-5. To further confirm the existence of an efficient energy-band matching at the interface of G/M101-5, the band structure of G/M101-5 was employed by Mott-Schottky measurement.The analysis tests were conducted at a frequency of 1 kHz in the dark circumstance, based on the experiments by others and the manufacturer's recommendation. 63,64Due to the position slope of the plot was positive (Figure 7f), the G/M101-5 catalyst could be attributed to N-type semiconductor.We have adopted the standard way of making a curve tangent to x-axis, and determine the conduction band according to its intercept.Making the intercept of tangent from the main part of inflection points on the Mott-Schottky plots curve to x-axis, the obtained conduction band potential E CB of G/M101-5 was -0.64 eV versus NHE, respectively, owning to the E CB was generally 0.1 V lower than the flat-band potential for N-type semiconductor. 65As depicted in Figure 8, the E CB of G/M101-5 was lower than the potential CO/CO 2 (-0.48 V vs NHE) which reported in the previous studies. 66,67These results indicated that G/M101-5 had the ability to catalyze CO 2 into CO.According to the bandgap energy (1.92 eV) determined by UV-vis diffuse reflectance spectrometer (Figure 7a), the calculated valence band potential (E VB ) of G/M101-5 composite was 1.28 V versus NHE, which was higher than the redox potential of TEOA/TEOA (0.82 V vs NHE). 5Thus, G/M101-5 was able to generate e -by oxidize TEOA through h . 54ccording to the above results, a reasonable photocatalytic mechanism for CO 2 reduction by G/M101-5 nanocomposite is proposed in Figure 9. CO 2 molecules were adsorbed by the contained special Fe 3 -O clusters on the iron site of the composite to produce CO molecules, which could be directly induced with O 2-to make Fe 3 and then formed Fe 2 through electron transfer under visible-light. 54,68Notably, the dispersed GQDs mainly served as an excellent electron-mobility activation region for rapid and effective effective transfer of photogenerated electrons.When the MIL-101(Fe) and GQDs were irradiated by the visible light, both of them can be excited to produce electron-hole pairs.Owning to the CB and VB of the GQDs (E CB was -0.49 eV and E VB was 2.28 eV) was both lower than that of MIL-101 (Fe) (E CB was -0.2 eV, and E VB was 2.61 eV), the photoexcited electrons transferred from GQDs to MIL-101(Fe), while the photoexcited holes migrated from MIL-101(Fe) to GQDs.The results indicated that the migration of electrons and holes from the two semiconductors obviously reduced the recombination of the photogenerated charge carriers."
  },
  {
    "title": "Conclusions",
    "content": "This study demonstrated that the excellent visible-light photocatalysts based on the GQDs loaded MIL-101(Fe) microrods fabricated for the first time by hydrothermal technique.Fe sites in pristine MIL-101(Fe) could behave as important CO 2 adsorption sites.The participation of OH-GQDs mainly played the role to offer outstanding optical properties within the visible region.In particular, the combination of GQDs and MIL-101(Fe) fabricated G/M101-5, which restricted the recombination of photogenerated electrons and holes to improve their photocatalytic activity.Under visible light irradiation, the G/M101-5 photocatalyst was provided with significantly better photocatalytic activity and recycling stability for reducing CO 2 than that of pristine Fe-based MOFs.This work may present at a new way for preparing high-efficient and environment-friendly G/ M101-5 photocatalyst to reduce CO 2 and obtain more precious fuels. Adv. Mater.Interfaces 2020, 2000468 Figure 1.a) XRD pattern of OH-GQDs and b) the patterns of MIL-101(Fe) and G/M101 nanocomposites. displayed TEM image and HRTEM image of pure GQDs to directly testify the morphologies and the interfacial structures formed.They are uniform and well dispersed, the Adv.Mater.Interfaces 2020, 2000468 Figure 2. a) N 2 sorption isotherms and pore size distribution curves: b) BJH, c) DFT of MIL-101 and the G/M samples. Figure 3. a)FT-IR spectra and b) Raman patterns of MIL-101(Fe) and G/M101-5 nanocomposites. Adv. Mater.Interfaces 2020, 2000468 Figure 4. TEM images of a) MIL-101 (Fe), b) G/M101-5, c,e) GQDs; HRTEM image of d) GQDs and f) G/M101-5. Figure 5. XPS photoelectron spectra of G/M101-5: a) survey, b) C1s, c) O1s, and d) Fe2p (compared with the parent MIL-101 (Fe)). Figure 6.Photocatalytic reduction curves of CO 2 using different photocatalysts after 5 h of visible light irradiation.Experimental conditions: CO 2 , TEOA and MeCN, 2 mL; and photocatalyst, 0.02 g. a) Photocatalytic CO production, b) Change of CO production in the five hours, c) Cycle stability of MIL-101(Fe) and G/M101-5 continuous illumination for 24 h respectively.Cycle stability test on the G/M101-5 before and after the photocatalytic reduction of CO 2 for 5 h.The d) XRD patterns, e) FT-IR, and f) UV-vis DRE spectrum of the fresh G/M101-5 and the used G/M101-5. Figure 7. a) UV-vis DRS spectra of the six samples.b) The bandgaps of MIL-101(Fe) and G/M101 nanocomposites, c) Excitation-dependent PL spectra, d) EIS Nyquist impedance plots, e) transient photocurrent responses, f) Mott-Schottky plots of MIL-101(Fe) and G/M101-5. Adv. Mater.Interfaces 2020, 2000468 Figure 8.Estimated energy level diagram of the G/M101. Adv. Mater.Interfaces 2020, 2000468 2020 WILEY-VCH Verlag GmbH Co. KGaA, Weinheim 2000468 (6 of 11) www.advmatinterfaces.de 2020 WILEY-VCH Verlag GmbH Co. KGaA, Weinheim 2020 WILEY-VCH Verlag GmbH Co. KGaA, Weinheim 2000468 (10 of 11) www.advmatinterfaces.de This work has been supported by the National Natural Science Foundation of China (Nos.41673093, 41773128, 21901154). Supporting Information is available from the Wiley Online Library or from the author. The authors declare no conflict of interest."
  }
]