[
  {
    "title": "Doi",
    "content": "10.1039/d0ra00672f"
  },
  {
    "title": "Article_Title",
    "content": "CO<sub>2</sub> photoreduction to CO/CH<sub>4</sub> over Bi<sub>2</sub>W<sub>0.5</sub>Mo<sub>0.5</sub>O<sub>6</sub> solid solution nanotubes under visible light"
  },
  {
    "title": "Abstract",
    "content": "In this work, Bi 2 W 0.5 Mo 0.5 O 6 solid solution nanotubes have been synthesized through a structure-directing hard template approach, which demonstrated greatly enhanced CO 2 photoreduction to CO/CH 4 .The crystalline phase, components and morphologies of the as-prepared composites were investigated by Xray diffraction (XRD), scanning electron microscopy (SEM) and transmission electron microscopy (TEM).The present design of Bi 2 W 0.5 Mo 0.5 O 6 solid solution nanotubes leads to remarkably enhanced photocatalytic activities with a peak CO/CH 4 production rate of 6.55/3.75mmol g A1 h A1 under visible light irradiation at room temperature, which was about 7 times that on pure Bi 2 WO 6 and Bi 2 MoO 6 nanotubes, respectively.Hollow nanotubular structures and synergistic electronic effects of various elements contribute to the enhanced visible light photocatalytic activity of Bi 2 W 0.5 Mo 0.5 O 6 solid solution nanotubes."
  },
  {
    "title": "Experimental",
    "content": "Electrospun polyacrylonitrile nanobers were fabricated as previously reported. 24In a typical procedure, 3 g of polyacrylonitrile (PAN) (M w ca.60 000) powders were dissolved in 20 mL of N,N-dimethylformamide (DMF) solution.Aer stirring at room temperature for 15 hours to form a uniform solution, the precursor solution was pumped into a hypodermic syringe for electrospinning.A piece of copper pin connected to a high voltage generator was put into the solution.The positive voltage applied to the tip was 10 kV and the distance between the needle tip and the collector was 12 cm.The spinning PAN nanobers are collected on the aluminum foil. In a typical case, 0.125 mmol Na 2 MoO 4 2H 2 O, 0.125 mmol Na 2 -WO 4 2H 2 O and 0.5 mmol Bi(NO 3 ) 3 5H 2 O, were dissolved in 40 mL of ethylene glycol (EG) under magnetic stirring for 10 min.The resulting transparent solution was transferred to a 50 mL teon-lined stainless steel autoclave and PAN nanobers (15 mg) were added.The autoclave is then heated to 160 C and maintained for 24 hours.The obtained polyacrylonitrile/Bi 2 W 0.5 -Mo 0.5 O 6 hybrid nanobers were washed with deionized water and ethanol to remove any ionic residual.And, it was denoted as PAN/BWMO.By heating the obtained PAN/BWMO hybrid nano-bers in oven at 500 C at a ramp rate of 2 C min A1 and maintained for 2 h, the Bi 2 W 0.5 Mo 0.5 O 6 solid solution nanotubes (named as BWMO NTs) were prepared.For comparison, Bi 2 MoO 6 and Bi 2 WO 6 nanotubes were also synthesized through this method (Na 2 WO 4 2H 2 O or Na 2 MoO 4 2H 2 O just choose one) and were denoted as BWO NTs and BMO NTs. The phase purity of the products was characterized by X-ray diffraction (XRD; D/max2600, Rigaku, Japan).Field emission scanning electron microscope (FESEM) images were performed using a SU70 microscope (Hitachi, Japan).Transmission electron microscopy (TEM) images were obtained on a JEOL JEM-2010 instrument.An energy dispersive X-ray (EDX) spectroscope coupled to a TEM was used to analyze the composition of the samples.The UV-Vis diffuse reectance (DR) spectroscopy of the samples was recorded on a Cary 500 UV-Vis-NIR spectrophotometer. The photocatalytic CO 2 reduction experiment was conducted under 300 W xenon lamp.Quartz plates are provided on the top of the airtight reactor and sampling ports are provided on both sides, with a volume of 500 mL.In a typical process, 0.1 g catalyst was uniformly dispersed onto the watch-glass with an area of 20 cm 2 , which then put in the reactor cell.Aer that, the photocatalysts was sealed in the reactor.Before the irradiation, high purity CO 2 was bubbled through deionized water and then owed into the reactor for 30 min to remove the residual air.During irradiation, 2 mL gas was taken from the reactor at regular intervals (1 h) for subsequent gas concentration analysis using a gas chromatograph (Agilent 7890A GC) equipped with a ame ionized detector (FID) and methanizer.The produced gases were calibrated with a standard gas mixture and their identity determined using the retention time."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The SEM images (Fig. 1a) reveal that all the as-electrospun PAN nanobers with diameters of 150-200 nm has a smooth surface without secondary structure.Aer solvothermal treatment, the Bi 2 W 0.5 Mo 0.5 O 6 solid solution with high coverage density is vertically grown on the PAN nanobers surfaces, indicating the formation of polyacrylonitrile/Bi 2 W 0.5 Mo 0.5 O 6 hybrid nano-bers (Fig. 1b).Through heat treatment of the as-prepared PAN/ BWMO hybrid nanobers to remove the PAN core, Bi 2 W 0.5 -Mo 0.5 O 6 solid solution with tubes-structured are obtained.From the Fig. 1c, we can see that the outer diameter of the BWMO NTs channel is estimated at 400 nm, the wall thickness is estimated at around 80 nm, and the average diameter of the BWMO NTs channel is estimated at 240 nm.From the TEM images (Fig. 1d), A clear contrast between the dark edges and the pale center can be observed, this further conrms that the BWMO NTs have a hollow interior. In order to further clarify the composition distribution and structural characteristics of the product, TEM-EDX scanning along the BWMO NTs radial direction (red line in the inset of Fig. 2) was used to obtain the spatial distribution of the components of the nanotube structure.Three signal peaks for Bi, W and Mo is found in the wall region.This is consistent with the BWMO NTs conguration observed in the SEM and TEM image.In addition, EDX analysis indicates that the molar ratio of W and Mo is about 1 : 1.05 for the BWMO NTs. From the XRD patterns (Fig. 3), we can see that the PAN nanobers are poorly crystallized.As aforementioned, Bi 2 MoO 6 and Bi 2 WO 6 are Aurivillius structures so they have same crystal structure in the normal conditions.Therefore, XRD spectra cannot be utilized to distinguish between these two Aurivillius structures since their peaks are obtained at almost the same diffraction angles.As for the pattern of PAN/BWMO hybrid nanobers, some strong diffraction peaks can be perfectly indexed to Bi As observed in Fig. 4 there was no peak of PAN nanobers, while PAN-BWMO and the BWMO-NTs shows a major absorption band between 370 nm and 510 nm.The steep shape of the absorption edge indicates a band-gap transition rather than the transition from the impurity level.For a crystalline semiconductor, the optical absorption near the band edge follows the equation ahv 14 A(hv A E g ) n/2 , where, a, v, E g and A are the absorption coefficient, the light frequency, the band gap and a constant, respectively.Among them, n decides the characteristics of the transition in a semiconductor.In this paper, the band gap of BWMO-NTs is calculated as approximately 2.59 eV starting from the absorption edge (inset of Fig. 4), indicating that BWMO-NTs has a suitable band gap for photocatalytic reactions under visible-light irradiation. As discussed above, the as-prepared BWMO-NTs exhibit one dimensional hollow structure with large surface area, rendering it an excellent candidate for photocatalytic CO 2 reduction.The photocatalytic performance of BWMO-NTs photocatalysts was evaluated and compared to that of pure BWO NTs and pure BMO NTs under visible light irradiation.Control experiments showed no CH 4 or CO production in the absence of either catalyst or irradiation, implying that both catalyst and irradiation are necessary for the present gaseous CO 2 photoreduction system (no show).The primary results showed CO 2 can be reduced to CO and CH 4 in the presence of H 2 O vapor and the BWMO NTs, and no other reduced product such as CH 3 OH, HCHO or HCOOH is detected.In addition, when N 2 is used to replace CO 2 in the photoreaction system, neither CO/CH 4 nor other carbon-based organic compounds can be detected, indicating that the formation of CO/CH 4 is caused by the CO 2 photoreduction process on the catalyst. As shown in Fig. 5a-c mmol g A1 h A1 and 0.13 mmol g A1 h A1 ), meanwhile, the pure BMO NTs also show poor CO and CH 4 production (0.80 mmol g A1 h A1 and 0.12 mmol g A1 h A1 ) aer irradiation for 4 h.In comparison, the BWMO NTs display more than 7 times higher activity for CO production (6.55 mmol g A1 h A1 ) and CH 4 production (3.75 mmol g A1 h A1 ).The highly enhanced visible-light photocatalytic activity of BWMO NTs can be ascribed to tube structure and the modied band structure, which adapt the balance between adequate redox potentials and effective visible light adsorption.Furthermore, we have tested the stability and reusability of BWMO NTs for the photocatalytic CO 2 reduction through a cycling test.As shown in Fig. 5d, the result indicates no obvious decrease of the photocatalytic activity aer the three cycles, demonstrating the good stability of the BWMO NTs."
  },
  {
    "title": "Conclusions",
    "content": "In conclusion, Bi 2 W 0.5 Mo 0.5 O 6 solid solution nanotubes were used as catalyst for the CO 2 photoreduction.The BWMO NTs exhibit remarkably improved photocatalytic activities for CO 2 reduction as compared to the pure BWO NTs and BMO NTs.The photocatalytic stability of the BWMO NTs was not as satisfactory as expected and further studies are under way.This work demonstrates the promise of BWMO NTs as a photocatalyst driven by visible light for CO 2 light conversion without the addition of any noble metal assisted catalysts. MoO 6 or Bi 2 WO 6 (JCPDS 76-2388), indicate the formation of Bi 2 W 0.5 Mo 0.5 O 6 solid solution.The XRD pattern of the BWMO NTs shows higher intensity and narrower diffraction peaks, implying the leading role of calcination in the enhancement of crystallization.Fig. 4 displays the UV-Vis diffuse reectance (DR) spectroscopy of the PAN nanobers, PAN-BWMO and the BWMO-NTs. Fig. 1 (a) SEM image of PAN nanofibers.(b) SEM image of the PAN/ BWMO nanofibers.(c) SEM image of the BWMO NTs.(d) TEM image of the BWMO NTs. Fig.3XRD patterns of the samples. Fig. 4 UV-Vis diffuse reflectance spectra of PAN nanofibers (curve a), PAN-BWMO (curve b) and BWMO-NTs (curve c). Fig. 5 Plots of CO and CH 4 production amounts as a function of visible light irradiation time over different samples: (a) BWO NTs, (b) BMO NTs and (c) BWMO NTs.(d) Stability study of photocatalytic CO and CH 4 evolution over the BWMO NTs under visible light irradiation. Fig. 2 TEM-EDX line scans spectra of BWMO NTs. This journal is The Royal Society of Chemistry 2020 This work was supported by the National Natural Science Foundation of China (51872068), Heilongjiang Natural Science Foundation (E2018051). There are no conicts to declare."
  }
]