[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2017.09.042"
  },
  {
    "title": "Article_Title",
    "content": "Exceptional photocatalytic activities for CO2 conversion on Al O bridged g-C3N4/α-Fe2O3 z-scheme nanocomposites and mechanism insight with isotopesZ"
  },
  {
    "title": "Abstract",
    "content": "Built Al-O bridges could promote charge transfer and separation in fabricated Z-scheme g-C3N4/-Fe2O3 nanocomposite for improved photoactivities.Highlights Photocatalytic activities of -Fe2O3 for CO2 conversion are improved by fabricating nanocomposites with g-C3N4.Photocatalytic activities of g-C3N4/-Fe2O3 nanocomposites could be further improved by building Al-O bridges.Improved photoactivities are attributed to enhanced photogenerated charge transfer and separation.Charge transfer and separation in resulting Al-O bridged nanocomposites obey a Z-scheme mechanism.It is confirmed produced H atoms are feasible to induce conversion of CO2 by means of isotope experiments."
  },
  {
    "title": "Experimental",
    "content": "All the chemicals in this study were of analytical grade and used as-received without further purification.Deionized water was used throughout the experiments. Nanocrystalline -Fe2O3 was synthesized by a phase-separated hydrolysis-solvothermal method.n-Butyl alcohol as the organic solvent and hydrated ferric nitrate Fe(NO3)39H2O as the iron source were used.In a typical procedure, 10 mL of 5 wt. ammonia solution was added into a 50 mL Teflon-lined autoclave and a 10 mL weighing bottle containing a solution of 0.8 g Fe(NO3)39H2O in 8 mL n-butyl alcohol was placed in the autoclave with a support between the autoclave bottom and the weighing bottle.The Teflon-lined autoclave was kept at 140 o C for 6 h. After being cooled to the room temperature, the sample was washed for several times with ethanol and deionized water in turn and then dried in an oven at 80 o C to obtain nanocrystalline -Fe2O3. The bare -Fe2O3 is represented by F. g-C3N4 was synthesized by heating urea in an alumina combustion boat at 550 o C for 4 h with a heating rate of 0.5 o C/min.After that, the furnace was cooled to the room temperature naturally. The obtained light-yellow product was grinded into fine powders for further experimental work. To fabricate g-C3N4/-Fe2O3, different amounts of g-C3N4 were mixed with 1 g -Fe2O3 in a beaker and dispersed in 20 mL of 50 ethanol solution under vigorously stirring for 4 h, followed by ultrasonication for 1h.Subsequently, the reaction mixture was kept on a hot plate and heated at mixture was calcined at 400 C for 1 h in a muffle furnace with a heating rate of 5 o C/min.The obtained nanocomposite was represented by XCN-F, where CN stands for g-C3N4, F means -Fe2O3, and X is the mass percent of g-C3N4 in the composite. The Al-O bridged g-C3N4/-Fe2O3 was prepared by a two-step wet chemical method with AlCl3 aqueous solution as the Al-O source.Firstly, a certain amount of as-prepared -Fe2O3 nanoparticles and 0.11 g AlCl3 were put into an ethanol/water system (50 ethanol solution) to form a mixture.The mixture was kept under stirring at 60 o C until the solvent was evaporated. After being dried in an oven, the mixture was calcined at 400 o C for 1 h.Thus, Al-modified -Fe2O3 was obtained.Furthermore, 0.85 g Al-modified -Fe2O3 was mixed with 0.15 g g-C3N4, and then dispersed in 20 mL of 50 ethanol solution under stirring for 4 h, followed by ultrasonication for 1 h.Subsequently, the mixture was dried at 80 C and then calcined at 400 o C for 1 h.As a result, Al-O-bridged g-C3N4/-Fe2O3 was obtained and denoted by 15CN-YAl-F, in which Al means Al-O bridges, 15 is the mass percent of g-C3N4 in the composite and Y is the mole percent of Al to Fe. The X-ray powder diffraction (XRD) patterns of the samples were measured with a Bruker D8 advance diffractometer, using CuK radiation.The UV-Vis diffuse reflectance spectra (UV-Vis DRS) of the samples were measured with a Model Shimadzu UV2550 spectrophotometer, using BaSO4 as a reference.The compositions and elemental chemical states of the samples were confirmed through X-ray photoelectron spectroscopy (XPS) using a Kratos-Axis Ultra DLD apparatus with an Al (mono) X-ray source.Transmission electron microscopy (TEM) and high resolution TEM (HRTEM) images of the samples were taken by a JEOL JEM-2010 electron microscope with a high acceleration voltage of 200 kV. The steady-state surface photovoltage spectroscopy (SS-SPS) measurements of the samples were carried out with a home-built apparatus, equipped with a lock-in amplifier (SR830) synchronized with a light chopper (SR540) at different atmosphere.The powder sample was sandwiched between two indium-tin-oxide (ITO) glass electrodes kept in an atmosphere-controlled sealed container.A monochromatic light was obtained from 500 W Xenon lamp (CHF XQ500W, Global Xenon lamp power) through a double prism monochromator (SBP300).The transient-state surface photovoltage (TS-SPV) measurements were performed with a self-assembled device in air at room temperature, in which the sample chamber was connected to an ITO glass as the top electrode and a steel substrate as the bottom electrode, and about 10 mm thick mica spacer was placed between the ITO glass and the sample to decrease the space charge region at the interface between ITO and the sample.The samples were excited by a 355 nm laser radiation with 10 ns pulse width from a second harmonic Nd:YAG laser (Lab-130-10H, Newport, Co.).The laser intensity was modulated with an optical neutral filter and measured by a high energy pyroelectric sensor (PE50BF-DIFC, Ophir Photonics Group).The signals were registered by a 1 GHz digital phosphor oscilloscope (DPO 4104B, Tektronix) with an amplifier at the aid of a computer. Photoelectrochemical (PEC) experiments were performed in a glass cell with 1 M NaOH solution as the electrolyte using the as-prepared film as the working electrode, Pt wire (99.9) as the counter electrode, and a saturated KCl Ag/AgCl electrode as the reference electrode.High purity nitrogen gas (99.999) was bubbled through the electrolyte before and during the experiments.Applied potentials were controlled by a commercial computer-controlled potentiostat (AUTOLAB PG STAT 101).The photocurrent densities at different excitation wavelengths were measured, in which monochromatic light was obtained by passing light from a 500 W Xenon lamp through a monochromator (CM110, Spectral Products).Electrochemical impedance spectra (EIS) were performed using a three-electrode configuration with the Princeton Applied Research Versa STAT 3 and carried out over the frequency range from 10 2 to 10 5 Hz with an amplitude of 10 mV (Root Mean Square) at the applied bias of 0.4 V in a 1.0 M NaOH solution, using a 300W Xenon light as the illumination source. To measure the OH amount, 0.02 g powder sample was dispersed in 50 mL of 110 -3 mol/L coumarin aqueous solution in a quartz reactor and kept under dark for 10 min to reach adsorption-desorption equilibrium.Each sample was irradiated for 1 h under 150W Xenon lamp. After centrifugation, a certain amount of the solution was taken in a Pyrex glass cell for fluorescence measurement of 7-hydroxycoumarin at 390 nm excitation wavelength and 460 nm emission wavelength through a spectrofluorometer (Perkin-Elmer LS55). 0.2 g powder sample was dispersed in 5 mL water (pH 7) in a cylindrical steel reactor with 100 mL volume and 3.5 cm 2 area.A 300 W Xenon arc lamp was used as the light source.Highly pure CO2 gas was passed through water and then entered into the reaction setup for reaching ambient pressure.The used photocatalyst was allowed to equilibrate in the CO2/H2O system for 1 hour.During irradiation, about 1 mL of gas produced was taken from the reaction cell at given time intervals for CO and O2 concentration analysis using a gas chromatograph (GC-7920 with Thermal Conductivity Detector (TCD), Au Light, Beijing), and for CH4 concentration analysis using a gas chromatograph (GC-2014 with Flame Ionization Detector (FID), Shimadzu Co., Japan). A 100 W single-wavelength LED lamp was used as the light source to measure the single-wavelength activities for CO2 conversion and the products were analyzed by using a gas chromatograph (GC-7920 with TCD, Au Light, Beijing).The isotopic experiments for CO2 reduction by using D2O and 13 CO2 were performed with a gas chromatograph-mass spectrometer (GC/MASS, GC-7890B/MS5977A, America Aligent). To test hydrogen evolution, the experiments were carried out in an online cylindrical quartz cell (250 mL volume and 7.5 cm 2 area) connected to a closed gas circulation system, and the gases evolved were analyzed with an online TCD gas chromatograph (GC-7900, Techcomp, China).In a typical photocatalytic reaction, 0.1 g powder sample was dispersed in 100 mL H2O.The suspension was thoroughly irradiated by a 300 W Xenon lamp.The gas evolved was measured at 1 h interval under light irradiation. The photocatalytic activities of the samples were further evaluated by the degradation of phenol. For phenol degradation, 0.2 g powdered photocatalyst and 50 mL of 10 mg/L phenol solution were mixed in a photochemical glass reactor under magnetic stirring at room temperature and standard pressure.Prior to irradiation, the mixture was stirred magnetically in dark for 30 min to reach adsorption-desorption equilibrium.After irradiation for 1h, the solution was centrifuged and then its phenol concentration was measured with a Shimadzu UV-2550 spectrophotometer through the 4-aminoantipyrine spectrophotometric method at the characteristic optical absorption. Temperature-programmed desorption (TPD) of CO2 was performed in a conventional apparatus by Chemisorption Analyzer (Tp 5080 Chemisorb) equipped with a TCD.About 50 mg samples were preheated to 300 C for 1 h to remove the moisture, and then cooled down to room temperature under an ultra-high-pure He gas with the flow rate of 30 mL/min.Highly pure CO2 gas was introduced at a constant temperature of 30 C under the flow rate of 30 mL/min for 60 min.The physically adsorbed CO2 was removed by being exposed with ultra-high-pure He at 30 C for 60 min.Then the temperature was increased to 700 C with the heating rate of 10 C /min under ultra-high-pure He.The desorbed CO2 was analyzed by Chemisorption Analyzer (Tp 5080 Chemisorb). Electrochemical reduction experiments were performed in a conventional three-electrode system, using a saturated calomel electrode (SCE) and a Pt plate as the reference electrode and the counter electrode, respectively.A 0.3 cm diameter glassy carbon (GC) electrode was used as the working electrode.5 mg catalyst mixed with 20 L of 5 wt.Nafion ionomers were dispersed in 0.18 mL alcohol solution (50 wt. ethanol solution).After the catalyst ink was sonicated for 0.5 h, an appropriate volume of the ink was evenly dropped onto the well-polished GC electrode surface and dried at ambient temperature.Electrochemical activity and stability of catalysts were tested with a BAS 100B electrochemical workstation.Initially, electrode potentials were cycled between two potentials to keep perfectly overlapping, and then subsequent voltammograms were obtained. The electrolyte for test was 1 M NaOH.All the tests were carried out at the room temperature."
  },
  {
    "title": "Results_and_Discussion",
    "content": "In Fig. S1, the XRD diffraction peaks at around 24.1 o , 33. 024) and (116) crystal planes. 51Pure g-C3N4 shows a characteristic diffraction peak at around 27.3 o , which can be assigned to the interlayer stacking aromatic systems, indexed to (002) facet of graphitic materials. 52As for the fabricated g-C3N4/-Fe2O3 nanocomposites and Al-O bridged ones, there exist only two phases as ascribed to g-C3N4 and -Fe2O3, respectively.Noticeably, the diffraction peaks of -Fe2O3 show no obvious changes, indicating that its crystallinity has been well maintained in the fabricated nanocomposites. The UV-vis DRS spectra (Fig. S2), indicate the optical absorption behavior of -Fe2O3 has not been affected after coupling g-C3N4 or further constructing Al-O bridges.It is evaluated that its optical absorption threshold of -Fe2O3 is about 630 nm, corresponding to 1.97 eV by the widely-accepted energy bandgap equation ( 1240/Eg).Based on the TEM image (Fig. 1A), it is seen that the Al-O bridged g-C3N4/-Fe2O3 nanocomposite has an average diameter of ca.20 nm, and -Fe2O3 nanoparticles are connected with g-C3N4 nanosheets successfully.Additionally, in the area-selected HRTEM image (Fig. 1B) -Fe2O3 and g-C3N4 have shown an intimate contact.The lattice fringes at the inter-planar distance of 0.25 nm are attributed to -Fe2O3.Based on above, the heterojunction between -Fe2O3 and g-C3N4 has been successfully formed.Certainly, the intimate connection is vital for the effective charge transfer in the heterojunctional nanocomposites. In order to confirm the elemental chemical states, XPS spectra were measured, as shown in Fig. S3.As illustrated in Fig. S3A, one can see that the Fe2p spectra of unbridged and Al-O bridged g-C3N4/-Fe2O3 are similar.Two distinct peaks at 710.7 eV with a shake-up satellite at 718.20 eV and 724.1 eV with a shake-up satellite at 732.9 eV are ascribed to Fe2p3/2 and Fe2p1/2, respectively, and it is characteristic of Fe 3 in -Fe2O3.The O1s spectra of both samples are fitted into two contributions according to the Gaussian rule with origin software.These contributions located at 529.5 eV and 531.6 eV (Fig. S3B) are attributed to crystal lattice oxygen and hydroxyl oxygen, respectively. 53The intensity of the hydroxyl oxygen peak at 531.6 eV obviously increases after building the Al-O bridges.A clear peak of N1s on 15CN-F is centered at 399.0 eV, assigned to sp 2 hybridized nitrogen (C-NC).Two peaks of C1s at 284.5 eV and 288.6 eV are ascribed to the sp 2 C atoms (C-N) bonded to N in the aromatic cycle (C-NC) and C atoms from NC, respectively. It is noticed from Fig. S3C andD, that the binding energies of N1s and C1s (CN) are shifted towards the low energy side after creating Al-O bridges, demonstrating the electron delocalization effect of created Al-O bridges.As expected, the XPS spectrum of 15CN-6Al-F shows an obvious Al2p peak at 73.8 eV (Fig. S3E). 54In general, it is acceptable that the -Al-OH groups could connect with g-C3N4 and -Fe2O3 through the surface adsorbed hydroxyls by the dehydration process at the aid of thermal treatment.Thus, it is deduced that the Al-O bridges are successfully incorporated into the g-C3N4/-Fe2O3 nanocomposites, which would act as effective bridges for charge transfer. The photo-induced electron-hole formation and separation of solid semiconductor materials can be analyzed through a highly sensitive SS-SPS technique.For a nanosized semiconductor, its SS-SPS response derives from the photo-induced charge separation via the diffusion process since its built-in electric field is usually neglected.In general, the strong SS-SPS response frequently corresponds to the high photo-induced charge separation.It is clear that -Fe2O3 shows a low SS-SPS response (Fig. 2A and Fig. S4).However, its SS-SPS signal is obviously enhanced after coupling with an appropriate amount of g-C3N4, especially for 15CN-F nanocomposite. Interestingly, it is found that the SS-SPS response of 15CN-F significantly increases by constructing Al-O bridges between -Fe2O3 and g-C3N4.Obviously, the strongest SS-SPS response is observed for the 15CN-6Al-F.Thus, it is confirmed that the photo-induced charge separation of -Fe2O3 could be enhanced by constructing heterojunction with g-C3N4 and further enhanced by creating Al-O bridges.However, if the used amounts of g-C3N4 and Al-O bridges are excessive, the SS-SPS responses would decrease. Meanwhile, the TS-SPV technique was applied to investigate the dynamic processes of photo-induced charge carriers.During the TS-SPV measurements, the samples were excited by a 355 nm-laser radiation with 10 ns pulse.According to the principle of TS-TPV, the charge separation of nanosized semiconductor is mainly influenced by the carrier diffusion process, leading to an obviously slow TS-SPV response (10 -4 s).Since the photo-induced electrons of -Fe2O3 are captured by adsorbed O2, it is understandable that the diffusion of positive holes to the surface is much faster than that of captured negative electrons, leading to a positive TS-SPV response (Fig. 2B).Similarly, the highest TS-SPV response is observed for 15CN-6Al-F, indicating the highest photo-induced charge separation.Noticeably, the carrier lifetime of -Fe2O3 is prolonged by ms after forming heterojunction with g-C3N4, especially for the built Al-O bridged ones.Hence, the long-lived photo-induced charge carriers mean the high photo-induced charge separation.This is in good agreement with the above-mentioned SS-SPS results on the greatly-enhanced charge separation. In order to further confirm the enhanced charge separation, we have also carried out the PEC experiments, as shown in (Fig. 2C) and (Fig. S5).The large photocurrent density usually corresponds to the high photo-induced charge separation.It is noticed that the photocurrent density of -Fe2O3 is greatly enhanced after coupling g-C3N4, and it is clear that the highest photocurrent response is observed for 15CN-F.As expected, the photocurrent density of 15CN-F is further enhanced after creating Al-O bridges.In particular, a significant enhancement is observed for 15CN-6Al-F.This indicates that the resulting 15CN-6Al-F exhibits a high photo-induced charge separation.However, the photocurrent density decreases with over amount of g-C3N4 and Al-O bridges.In addition, the coumarin fluorescent method was employed to detect the amount of formed OH, in which the coumarin easily reacts with OH and then to produce luminescent 7-hydroxycoumarin.In general, the stronger fluorescent signal corresponds to the higher produced OH.As shown in Fig. 2D and Fig. S6, -Fe2O3 shows a small amount of OH. After coupling with a proper amount of g-C3N4, the amount of produced OH obviously increases, especially with 15CN-F.Interestingly, the amount of produced OH for 15CN-F further increases after introducing Al-O bridges to 15CN-F, and it exhibits the largest amount of OH on 15CN-6Al-F.Obviously, this is well consistent with the above SS-SPS, TS-SPV and photocurrent results.Therefore, based on the photophysical and photochemical results, it is clearly demonstrated that the photo-induced charge separation of -Fe2O3 could be enhanced by fabricating nanocomposites with g-C3N4 with proper amounts, especially for the created Al-O bridged ones.Further, it is anticipated that the Al-O bridged g-C3N4/-Fe2O3 nanocomposites would display high photocatalytic activities compared to bare -Fe2O3 and g-C3N4/-Fe2O3 nanocomposites. The photocatalytic activities of as-prepared samples were evaluated for CO2 reduction and phenol degradation, as shown in Fig. 3, and Fig. S7 andS8.It is confirmed that the detected gas products of CO2 reduction contain CO and CH4, especially for CO, simultaneously with a certain amount of O2 produced as a result of H2O oxidation.It is seen from Fig. 3A that -Fe2O3 exhibits a weak photocatalytic activity for the reduction of CO2 to produce CO ( 5.7 molg -1 h -1 ), CH4 ( 0.3 molg -1 h -1 ) and O2 ( 6.2 molg -1 h -1 ) after irradiating for 1 h.Noticeably, its photoactivity is improved after introducing a certain amount of g-C3N4, and it is much obvious for 15CN-F samples to produce CO (15.8 molg -1 h -1 ), CH4 ( 3.1 molg -1 h -1 ) and O2 ( 18.5 molg -1 h -1 ).However, the activity begins to decrease when the amount of used CN is in excess, like 20CN-F.Interestingly, the photocatalytic activity of the resulting 15CN-F nanocomposite could be further improved by constructing Al-O bridges between g-C3N4 and -Fe2O3, and 15CN-6Al-F is the amount-optimized one to produce CO ( 24 molg -1 h -1 ), by 4-time enhancement relative to that of -Fe2O3. The improved photocatalytic activities of fabricated samples were further supported by the degradation of phenol under irritation for 1 h (Fig. 3B).It is clear that the photocatalytic activity of bare -Fe2O3 for phenol degradation is relatively low.However, an obvious enhancement is observed when g-C3N4 is coupled onto -Fe2O3 with a proper amount, and 15CN-F shows the highest photocatalytic activity.As expected, further improvement in the photocatalytic activity is seen for phenol degradation when Al-O bridges are introduced between g-C3N4 and -Fe2O3.In particular, 15CN-6Al-F displays the best photocatalytic degradation performance.Thus, it is clearly demonstrated that the photocatalytic activities of -Fe2O3 for CO2 conversion and phenol degradation could be greatly improved by coupling an Al-O bridged g-C3N4, attributed to markedly enhanced photo-induced charge separation.The stability of 15CN-6Al-F sample was tested by consecutive reactions, as shown in Fig. S9.It is noticed that the photoactivity for producing CO nearly keeps unchanged during 5 cycles, indicating that it is robust during the photocatalytic processes and hence promising for the practical applications. As described above, the photo-induced charge separation of -Fe2O3 could be markedly promoted by constructing g-C3N4/-Fe2O3 nanocomposites.According to the band energy structures of g-C3N4 and -Fe2O3, the charge transfer and separation is commonly considered to obey the Z-scheme mechanism.In order to confirm the Z-scheme mechanism, we have recorded single-wavelength photocurrent action spectra, as shown in Fig. 4A.It is well accepted that the optical absorption thresholds of -Fe2O3 and g-C3N4 are 630 and 460 nm, respectively.One can see that the photocurrent density of -Fe2O3 evenly increases as the excitation wavelength decreases from 600 nm to 400 nm.For 15CN-F nanocomposite, it is similar to -Fe2O3 when the excitation wavelength is not shorter than 500 nm.In this case, g-C3N4 could not be excited.When the used excitation wavelength is 450 nm, the observed photocurrent density of 15CN-F sharply increases.Naturally accepted, -Fe2O3 and g-C3N4 are excited simultaneously to produce electron-hole pairs.Therefore, the sharp increase in the photocurrent density is attributed to the Z-scheme mechanism on the photo-induced charge transfer and separation.Noticeably, its photocurrent density still continues to become large as the excitation wavelength is further decreased.The Al-O bridged 15CN-F (15CN-6Al-F) exhibits a much large photocurrent density compared to the unbridged 15CN-F with the excitation wavelength below 450 nm.This indicates the created Al-O bridges between -Fe2O3 and g-C3N4 facilitate the photo-induced charge transfer and separation.EIS Nyquist plots (Fig. S10) further confirm the promoted charge transfer in the g-C3N4/-Fe2O3 nanocomposites.It is seen that the capacitive arc radius of -Fe2O3 is decreased after integration with g-C3N4, especially for the Al-O bridged one.The decreased capacitive arc radii correspond to the enhanced charge transfer and separation.To further verify the Z-scheme mechanism, we also measured the single-wavelength activities for CO2 conversion on 15CN-6Al-F, as shown in Fig. 4B.It is noticed that the amount of produced CO gradually increases as the excitation wavelength is decreased to 470 nm, while an obviously increased photocurrent is observed at 450 nm.This is in good agreement with the above observed photocurrent densities.In addition, it is confirmed as Fig. S11 that the P-O and Si-O bridges built by similar procedures are also favorable for the photo-induced charge transfer and separation on the fabricated g-C3N4/-Fe2O3 nanocomposites on the conditions of the same amounts used, leading to the improved photoactivities.It is worthy of noting that the created Al-O bridges are the best among the built three ones. To investigate the mechanism of photocatalytic reduction of CO2, the electrochemical reduction curves were carried out in different gas-bubbled systems, as shown in Fig. 5.In the N2-bubbled system, it is noticed that it is much favorable for H2 evolution on the fabricated g-C3N4/-Fe2O3 nanocomposite (15CN-F) based on the onset potential, especially for the Al-O bridged one (15CN-6Al-F).This indicates that it is favored thermodynamically to evolve H2 on 15CN-6Al-F. In addition, it's worthy of noting that the onset potentials of different Fe2O3-based electrodes for H2 evolution are similar to those in the CO2-bubbled system.This clearly indicates that the observed current response mainly results from the H2O reduction, other than from the CO2 reduction.This is because that it's not beneficial to enhance the capacity of -Fe2O3 to adsorb CO2 by integrating with g-C3N4 according to the recorded temperature-programmed desorption curves of CO2 (Fig. S12).Moreover, it is confirmed that a certain amount of H2 could be produced during the photocatalytic process only in water on 15CN-6Al-F (Fig. S13).Thus, it is suggested that the produced H atoms play key roles to initiate the photocatalytic reduction of CO2. In addition, it is confirmed by Fig. S14 that it is also much favorable for O2 reduction on the fabricated g-C3N4/-Fe2O3 nanocomposite (15CN-F), especially for the Al-O bridged one (15CN-6Al-F).This demonstrates that thermodynamically adsorbed O2 is inclined to capture photo-induced electrons, leading to the promoted charge separation and hence to the enhanced photocatalytic activity for degrading phenol.To further verify if the H atoms originate from the photocatalytic reduction of H2O and then anticipate in the conversion of CO2, we have carried out isotopic experiments by using 13 CO2 and D2O under the identical photocatalytic reaction conditions.The resultant photocatalytic products have been identified and quantified with GC-MS. As shown in Fig. S15A, 13 C, 13 CH, 13 CH2, 13 CH3 and 13 CH4 have been detected.This indicates that the produced CH4 indeed derives from the reduction of CO2.When H2O is replaced by D2O, as shown in Fig. S15B C, CD, CD2, CD3, and CD4 have been detected, indicating that the H atoms in produced CH4 originate from H2O.This further supports that the produced H atoms dominantly induce the photocatalytic CO2 conversion. Based on the above results and discussion, a schematic on the transfer and separation of photo-induced charges for the fabricated Al-O bridged g-C3N4/-Fe2O3 nanocomposite (15CN-6Al-F) and the induced photochemical processes have been proposed, as shown in Fig. 6. When both -Fe2O3 and g-C3N4 are excited simultaneously below 460 nm, the photo-induced electrons of -Fe2O3 would combine with the photo-induced holes of g-C3N4 in the fabricated g-C3N4/-Fe2O3 nanocomposites.In this case, the spatially separated holes on -Fe2O3 and electrons on g-C3N4 would possess sufficient energy to thermodynamically induce redox reactions, leading to the promoted charge separation and hence the improved photocatalytic activities. In particular, the introduction of Al-O bridges into the nanocomposites is much favorable for the charge separation by promoting the charge transfer from -Fe2O3 to g-C3N4, consequently further improving the photoactivities for CO2 conversion and phenol degradation.In the degradation of phenol, the photo-induced electrons on g-C3N4 could easily be captured by the adsorbed O2 to produce O2 -, while the photo-induced holes of -Fe2O3 could initiate the oxidation with H2O to produce OH, further attacking phenol.In the conversion of CO2, the photo-induced electrons on g-C3N4 could easily induce the reduction reactions with H2O to produce H atoms that attack CO2 to produce CO and CH4, while the produced OH by the reactions of photo-induced holes of -Fe2O3 with H2O could further evolve O2."
  },
  {
    "title": "Conclusions",
    "content": "In summary, we have successfully improved the photocatalytic activities of -Fe2O3 for CO2 conversion and phenol degradation by fabricating heterojunctional nanocomposites with Al-O bridged g-C3N4.Interestingly, the created Al-O bridges in the fabricated nanocomposites further improve the photocatalytic activities.It is confirmed that the photo-induced charge separation of resulting g-C3N4/-Fe2O3 nanocomposites obeys a Z-scheme mechanism, in which the spatially separated electrons on g-C3N4 and holes on -Fe2O3 would possess enough energy to induce redox reactions, leading to the enhanced charge separation and hence to the improved photocatalytic activities.Moreover, it is much favorable for the charge transfer and separation to create Al-O bridges in the fabricated nanocomposites, responsible for the obviously-improved photocatalytic activities.Furthermore, it is suggested that the produced H atoms play important roles in the photocatalytic conversion of CO2 on the fabricated nanocomposites.This work will help to understand the charge transfer and separation mechanisms in the Z-scheme heterojunctions in detail, and provide us with a much feasible route to synthesize efficient nanosized -Fe2O3-based photocatalysts for efficient solar energy utilization to produce energy and purify environment. 2 o , 35.6 o , 42.1 o , 49.4 o and 54.1 o are attributed to -Fe2O3 according to the standard card JCPDS 33-0664, respectively corresponding to the (012), (104), (110), (113), ( Fig. 1 TEM image of 15CN-6Al-F (A) with an area-selected HRTEM (B).(F, CN and Al mean -Fe2O3, g-C3N4 and Al-O bridges, respectively.X in XCN is the mass percent of g-C3N4 used in the composite, and Y in YAl is the mole percent of Al relative to Fe.It is the same unless stated elsewhere.) Fig. 3 Photocatalytic activities for CO2 conversion (A) and phenol degradation (B) of F, 15CN-F and 15CN-6Al-F. Fig. 4 Single-wavelength photocurrent action spectra of F, 15CN-F and 15CN-6Al-F (A) and single-wavelength photoactivities for CO2 conversion of 15CN-6Al-F (B). Fig. 5 Electrochemical reduction curves in the N2-bubbled (A) and CO2-bubbled (B) systems of CN, F, 15CN-F and 15CN-6Al-F.(PEC measurements were performed with a three-electrode system in 1 M NaOH electrolyte, with the tested film as the working electrode, Ag/AgCl as the reference electrode, and Pt plate as the counter electrode). Fig. 6 Schematic on the transfer and separation of photo-induced charges in the fabricated Al-O bridged g-C3N4/-Fe2O3 nanocomposites and the induced photochemical reactions. We are grateful for financial support from NSFC (U1401245, 21501052, 91622119), the Program for Innovative Research Team in Chinese Universities (IRT1237), the Research Project of Chinese Ministry of Education (213011A), and the Science Foundation for Excellent Youth of Harbin City of China (2014RFYXJ002, 2016RQQXJ099). Supplementary data associated with this article can be found, in the online version, at"
  }
]