[
  {
    "title": "Doi",
    "content": "10.1039/c7nr03238b"
  },
  {
    "title": "Article_Title",
    "content": "Construction of unique two-dimensional MoS<sub>2</sub>–TiO<sub>2</sub> hybrid nanojunctions: MoS<sub>2</sub> as a promising cost-effective cocatalyst toward improved photocatalytic reduction of CO<sub>2</sub> to methanol"
  },
  {
    "title": "Abstract",
    "content": "Two-dimensional MoS 2 nanosheets were in situ grown on TiO 2 nanosheets to form two-dimensional (2D) hybrid nanojunctions, with which MoS 2 nanosheets compactly contact with TiO 2 to increase the interfacial area.MoS 2 was identified as a promising cost-effective substitute for noble metal cocatalysts such as Pt, Au, and Ag, and shows superior activity and selectivity for reducing CO 2 to CH 3 OH in aqueous solution to these metal cocatalysts under UV-vis light irradiation.The photo-luminescence (PL) spectra and transient time-resolved PL decay measurements reveal that the fast electron transfer from TiO 2 to MoS 2 can minimize charge recombination losses to improve the conversion efficiency of photoreduction.It reveals that Mo-terminated edges of MoS 2 nanosheets possess the metallic character and a high d-electron density, and the Mo cation sites may benefit the stabilization of CH x O y intermediates via electrostatic attraction to enhance the CH 3 OH formation from the reduction of CO 2 in aqueous solution."
  },
  {
    "title": "Experimental",
    "content": "Pure ultrathin TiO 2 nanosheets were synthesized using a modification of the previous method. 29In a typical synthesis, 5 ml of TBOT and 0.6 ml of HF were mixed in a stainless Teflonlined autoclave of 25 ml inner volume, which was heated at 180 C for 24 h and then cooled to room temperature naturally.The white precipitates were collected by centrifugation, washed thoroughly with alcohol and water three times, respectively, and then dried at 60 C. The synthesis method of MoS 2 /TiO 2 hybrid nanosheets with 0.5 wt, 1 wt, 2 wt, and 3 wt contents of MoS 2 was as follows.0.2 g of ultrathin TiO 2 nanosheets were dispersed in 20 ml of water containing a varying amount of Na 2 MoO 4 2H 2 O and C 2 H 5 NS (n S/Mo 7.0) and then stirred for 30 min at room temperature.Next, the mixtures were transferred into a stainless Teflon-lined autoclave of 25 ml inner volume, and then heated at 180 C for 24 h, followed by cooling naturally to room temperature.The precipitates were collected by centrifugation, washed thoroughly with alcohol and water three times, respectively, and then dried at 60 C.Pure MoS 2 nanosheets were prepared without the addition of TiO 2 nanosheets in the same method. The morphology of the samples was observed by transmission electron microscopy (TEM) (JEOL 3010, Japan).The crystallographic phase of the as-prepared products was determined by powder X-ray diffraction (XRD) (RigakuUltima III, Japan) using Cu-K radiation ( 0.154178 nm) with a scan rate of 10m in -1 at 40 kV and 40 mA.The crystallite size was calculated using the Scherrer formula (d 0.9/B cos , where d, , B and are the crystallite size, Cu K wavelength, full width at half maximum (FWHM) intensity in radians and Bragg's diffraction angle, respectively).The specific surface area of the samples was measured by nitrogen sorption at 77 K on a surface area and porosity analyzer (Micromeritics TriStar, USA) and calculated by the BET method.The CO 2 absorption on the surface of the samples was evaluated by the above-mentioned adsorption apparatus under ambient pressure and at 0 C.The UVvisible (UV-vis) diffuse reflectance spectra were recorded with a UV-vis spectrophotometer (UV-2550, Shimadzu) at room temperature and transformed to the absorption spectra according to the Kubelka-Munk relationship.The samples were analyzed with X-ray photoelectron spectroscopy (XPS, K-Alpha, Thermo Fisher Scientific).The XPS spectrum was calibrated with respect to the binding energy of the adventitious C 1s peak at 284.8 eV. The 800 nm output of a 76 MHz, picosecond Ti:Sapphire laser was used to obtain the 400 nm wavelength from the second and third harmonic generation processes, respectively.For PL spectral measurements, a 400 nm beam with a power density of 100 W cm -2 was focused onto the sample surface at an incident angle of 45relative to the normal direction.The sample PL was collected vertically from the surface by a microscope objective and sent through a 0.5 m spectrometer to a charge-coupled-device camera.For transient time-resolved PL decay measurements, a 400 nm laser beam was focused on the sample surface by a microscope objective also at a power density of 100 W cm -2 .The sample PL was collected by the same objective and sent to an avalanche photodiode in the time-correlated single-photon counting system with a time resolution of 250 ps.All the measurements were performed at room temperature. The decay behavior of the samples can be well-fitted to a biexponential function in the form of f(t) A 1 exp(-t/ 1 ) A 2 exp(-t/ 2 ). The average lifetime is calculated by the expression in the form of (A 1 1 2 A 2 2 2 )/(A 1 1 A 2 2 ).The apparent electrontransfer rate was able to be calculated using the equation in the form of k et 1/(TiO 2 -MoS 2 ) -1/(TiO 2 ). The photocatalytic reduction of CO 2 was carried out in an airtight quartz glass reactor.The catalyst powder (0.1 g) was suspended in 200 mL of 1 M NaHCO 3 solution ( pH 8) under stirring.Before illumination, pure CO 2 was bubbled through the stirred solution to eliminate the air and to saturate the solution.After stopping the passage of CO 2 , the photoreaction was then carried out with a 300 W xenon arc lamp.Liquid products from the above system were detected on a gas chromatograph (Agilent 7890B GC) connected with a headspace autosampler (Agilent 7697A HS).All samples were treated at 300 C under an Ar atmosphere for 2 h for the removal of organic adsorbates before the photocatalysis reaction. For the preparation of 0.5 wt Pt, Au, and Ag loaded on TiO 2 nanosheets, the loading of Ag, Au, and Pt was performed by a photocatalytic reduction deposition method.H 2 PtCl 6 6H 2 O, HAuCl 4 4H 2 O, and AgNO 3 were used as the source of Pt, Au, and Ag.Typically, 0.2 g photocatalyst, 40 mL distilled water, 15 mL CH 3 OH and a given amount of source were placed in a glass vessel.The reactant solution was irradiated by a 300 W Xe arc lamp for 8 h with stirring.Then, the photocatalyst with co-catalysts was filtered, washed thoroughly with deionized water and alcohol, and dried at 60 C for 12 h.All samples were treated at 300 C under an Ar atmosphere for 2 h."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The color of the MoS 2 /TiO 2 hybrid nanosheets changes from light gray to dark black when increasing the MoS 2 content in the MoS 2 /TiO 2 hybrid nanosheets, compared to the white TiO 2 nanosheets (Fig. 1), due to the addition of black MoS 2 nanosheets.Transmission electron microscopy (TEM) images clearly reveal square contours of TiO 2 nanosheets with a side length in the range of 20-30 nm (Fig. 2a).The thickness was measured to be about 5 nm from the vertically standing TiO 2 nanosheets (Fig. 2b).The well-defined lattice fringes parallel to the top and bottom facets of the TiO 2 nanosheets is 0.235 nm, corresponding to the (001) plane of anatase TiO 2 .The TEM image of the MoS 2 /TiO 2 hybrid nanosheets shows the presence of typical lamellar MoS 2 nanosheets with several layers, as indicated with arrowheads (Fig. 2c).The continuous (200) atomic planes of anatase TiO 2 with a lattice spacing of 0.19 nm and a lattice spacing of 0.62 nm corresponding to the (002) plane of the MoS 2 were also observed (Fig. 2c and the inset of Fig. 2d).A magnified TEM image clearly reveals that a thin layer of MoS 2 surrounds and compactly contacts with the TiO 2 nanosheet (Fig. 2d). Fig. 3a shows the corresponding X-ray diffraction (XRD) patterns of MoS 2 , pure TiO 2 nanosheets, and MoS 2 /TiO 2 hybrid nanosheets with different MoS 2 amounts.The diffraction peaks of pure TiO 2 nanosheets can be perfectly indexed to anatase phase TiO 2 (JCPDS card no.21-1272).Pure MoS 2 shows the characteristic peaks at 14.02, 33.27, and 57.45, which are ascribed to the (002), (100), and (106) lattice plane of hexagonal phase MoS 2 (JCPDS card no.37-1492), respectively. 28The diffraction peak of hexagonal phase MoS 2 is not observed in the XRD patterns of the MoS 2 /TiO 2 hybrid nanosheets, which could be attributed to the low amount of loaded few-layered MoS 2 nanosheets.XPS spectra could confirm the existence of MoS 2 in 0.5 wt MoS 2 /TiO 2 hybrid nanosheets (Fig. S1 ).As shown in Table 1, the crystallite size of TiO 2 shows a little increase with the increasing of MoS 2 content.After hybridizing TiO 2 with MoS 2 , the BET surface area and CO 2 adsorption decrease. The UV-visible (UV-vis) diffuse reflectance spectra of the pure TiO 2 nanosheets and MoS 2 /TiO 2 hybrid nanosheets show that the band gap of the TiO 2 nanosheets is estimated to be 3.2 eV (Fig. 3b).Compared to the pure TiO 2 nanosheets, the absorption spectra of the MoS 2 /TiO 2 hybrid nanosheets show an enhanced absorption in the visible light region ranging from 400 to 800 nm, and increases with the increasing MoS 2 content, which is in accordance with the above color change of the samples from white to black. The pure TiO 2 nanosheets and MoS 2 /TiO 2 hybrid nanosheets were suspended in CO 2 saturated 1 M NaHCO 3 aqueous solution to photoreduce CO 2 under UV-vis light irradiation.Fig. 4 shows that CO 2 can be mainly selectively photoreduced to CH 3 OH without any noble-metal co-catalysts such as Pt and Au and oxides RuO 2 .Negligible small amounts of C 2 H 5 OH and CH 3 CHO were also detected.The CH 3 OH production rate of 0.5 wt MoS 2 /TiO 2 (10.6 mol g -1 h -1 ) is about 2.9 times higher than that of pure TiO 2 (3.7 mol g -1 h -1 ), indicative of MoS 2 serving as an efficient cocatalyst.However, a further increase of the MoS 2 content (from 1 wt to 3 wt) leads to a gradual decrease of the photocatalytic activity. Excess black MoS 2 nanosheets absorb photons in the photocatalytic system, probably decreasing the intensity of light through the deeper reaction solution and shielding the light from reaching the TiO 2 surface, which could be called a \"shielding effect\". 19This shielding effect may become more obvious and then gradually decrease the photocatalytic activity when further increasing the MoS 2 content, which is consistent with the change of the sample color (Fig. 1) and the UV-vis spectra (Fig. 3b).The same CO 2 reduction experiment performed in the dark or in the absence of the photocatalysts shows no appearance of the CH 3 OH, proving that the CO 2 reduction reaction is driven by light with the photocatalysts.Control experiments under UV-visible light irradiation were also performed over samples in pure water solution.Neither CH 3 OH nor other carbon compounds were observed, indicating that there was no residual carbon or other carbon contamination in the system.The charge generation and separation rate is one of the major factors for enhancing the photocatalytic activity. 30To explore the charge transfer between TiO 2 and MoS 2 , the PL emission spectra and transient time-resolved PL decay measurements were carried out on the samples excited at 400 nm.The PL intensity of the TiO 2 nanosheet drastically decreases with loading MoS 2 (Fig. 5a), indicating the reduced recombination of photogenerated charge carriers in the MoS 2 -TiO 2 hybrid nanosheet in comparison to bare TiO 2 .The MoS 2 can accept photogenerated electrons from excited TiO 2 to allow an additional pathway for the transfer of the charge carriers, and subsequently the suppression of electron-hole recombination within TiO 2 and the PL quenching.As shown in Fig. 5b, 0.5 wt MoS 2 /TiO 2 displays a PL decay lifetime of 0.51 ns, much faster than 7.54 ns of the pure TiO 2 , which also implies that an additional nonradiative decay channel through the transfer of electrons from TiO 2 to MoS 2 is opened.The PL decay rate (k r 1/) of MoS 2 /TiO 2 and pure TiO 2 is 1.96 10 -9 s -1 and 0.13 10 -9 s -1 , respectively.The electron-transfer rate from TiO 2 to MoS 2 can be calculated using the equation in the form of k et 1/(TiO 2 -MoS 2 ) -1/(TiO 2 ).The electron-transfer rate of 0.5 wt MoS 2 /TiO 2 is 1.83 10 -9 s -1 , which is much larger than the PL decay rate of pure TiO 2 (0.13 10 -9 s -1 ), showing that the electrons in TiO 2 transfer quickly to MoS 2 . Comparison experiments for CO 2 reductions were carried out on 0.5 wt Pt, Au, and Ag loaded on TiO 2 nanosheets.As"
  },
  {
    "title": "Conclusions",
    "content": "The two-dimensional MoS 2 -TiO 2 hybrid was successfully fabricated and applied as a photocatalyst for CO 2 conversion in aqueous solution, in which the MoS 2 nanosheets prove to be an efficient co-catalyst.The loaded MoS 2 nanosheets promote the electron transfer from TiO 2 to MoS 2 , minimizing charge recombination to improve the conversion efficiency of the photoreduction of CO 2 to CH 3 OH.Our work focuses on the study of electron transfer and its effect on photocatalytic performance.Hopefully, the present results can provide useful information for designing optimal photocatalytic systems for CO 2 photoreduction. Fig. 1 Photographs of pure TiO 2 nanosheets and MoS 2 /TiO 2 hybrid nanosheets with different MoS 2 amounts. Fig. 2 TEM and high-resolution image of (a, b) pure TiO 2 nanosheets and (c, d) 0.5 wt MoS 2 /TiO 2 nanosheets. Fig. 3 (a) XRD patterns of MoS 2 , pure TiO 2 nanosheets and MoS 2 /TiO 2 hybrid nanosheets with different MoS 2 amounts.(b) UV-vis diffuse reflectance spectra of pure TiO 2 nanosheets and MoS 2 /TiO 2 hybrid nanosheets with different MoS 2 amounts. Fig. 5 (a) The PL emission spectra and (b) normalized PL decay traces of pure TiO 2 nanosheets and 0.5 wt MoS 2 /TiO 2 hybrid nanosheets. Fig. 4 Comparison of the photocatalytic activity of pure TiO 2 nanosheets and MoS 2 /TiO 2 hybrid nanosheets with different MoS 2 amounts for CO 2 photoreduction. Fig. 6 Comparison of the photocatalytic activity of TiO 2 nanosheets with 0.5 wt Pt, Au, and Ag for CO 2 photoreduction. Fig. 7 Schematic illustration of the charge separation and transfer in the MoS 2 /TiO 2 system for the photoreduction of CO 2 to CH 3 OH, and Mo sites especially Mo-terminated edges on MoS 2 nanosheets benefit the stabilization of intermediate products (CH x O y ). Physicochemical characterization of pure TiO 2 nanosheets and ultrathin MoS 2 /TiO 2 hybrid nanosheets This journal is The Royal Society of Chemistry 2017 Nanoscale This work was supported by the 973 Programs (No. 2014CB239302, 2011CB933303, and 2013CB632404), the National Natural Science Foundation of China (No. 21473091 and 21673001), and the Anhui Provincial National Science Foundation (No. 1608085ME102)."
  }
]