[
  {
    "title": "Doi",
    "content": "10.1021/acs.jpcc.5b08893"
  },
  {
    "title": "Article_Title",
    "content": "Origin of Enhancing the Photocatalytic Performance of TiO<sub>2</sub> for Artificial Photoreduction of CO<sub>2</sub> through a SiO<sub>2</sub> Coating Strategy"
  },
  {
    "title": "Abstract",
    "content": "Artificial photosynthesis that mimics the natural photosynthetic protocol is now regarded as a promising candidate for chemical conversion of CO 2 to renewable solar fuels.In this work, core-shell structured TiO 2 SiO 2 composites have been synthesized via a simple sol-gel method under ambient temperature and pressure, and applied to photocatalytic reduction of CO 2 with H 2 O in gas-phase under simulated solar light irradiation.The results show that as compared to bare TiO 2 , TiO 2 SiO 2 composites exhibit significantly enhanced adsorption capacity of CO 2 and facilitated photogenerated charge carriers separation, and thereby enhanced photoactivity toward CO 2 reduction.Although the insulating nature of SiO 2 inhibits the charge injection from inner TiO 2 core through the silica layer to the outer surface, the separation efficiency of charge carriers within the inner pore structure of TiO 2 SiO 2 is facilitated due to the as-formed Ti-O-Si bonds.In particular, TiO 2 30SiO 2 , which balances the combined influence of the CO 2 adsorption and charge carriers separation, acquires the best photoactivity and the high selectivity for CO formation.This can be ascribed to the enriched density of adsorbed CO 2 and relatively lower electron density on the reactive sites of the samples.In addition, in contrast to bare TiO 2 , the competitive process of H 2 formation is greatly inhibited over TiO 2 SiO 2 composites.It is hoped that our work could inspire ongoing interest in utilizing the SiO 2 coating method as well as other proper core-shell strategy to tune the activity and selectivity of semiconductor-based materials for artificial photoreduction of CO 2 to value-added solar fuels."
  },
  {
    "title": "Experimental",
    "content": "Materials.Degussa P25 (80 anatase titania and 20 rutile titania), tetraethylorthosilicate (TEOS, Si(OC 2 H 5 ) 4 , 99), ethanol (EtOH), hydrochloric acid (HCl), sodium hydroxide (NaOH).All materials were used as received without further purification.Deionized (DI) water used in the synthesis process was obtained from local sources. Synthesis.The core-shell structured TiO 2 xSiO 2 composites were prepared through the sol-gel method by entrapping certain amounts of TiO 2 within different weight ratio of silica matrices, which is obtained via the hydrolytic polycondensation of TEOS.Typically, a) TEOS was hydrolyzed The Journal of Physical Chemistry in the mixed solution of EtOH and HCl as the volume ratio of V(TEOS) : V(EtOH) : V(1M HCl) 1: 2: 1, stirring for 30 min; b) 0.3 g TiO 2 was ultrasonically treated in 1 mL of water for 30 min to obtain a well-dispersed TiO 2 suspension; c) various amount of TEOS solution obtained in step (a) was dropped into the TiO 2 suspension, stirring for another 30 min; d) an aliquot of NaOH (1 M) aqueous solution was then added dropwise to the suspension to promote the condensation; e) after feeding, the obtained suspension was aged in a closed vessel at room temperature for 24 h, and then dried at 60 C for 3 days.The doped silica monolith thereby obtained was mildly powdered in a mortar and washed with distilled water for several times until the ion concentration of the supernatant was 10 ppm.Ultimately, the precipitate was filtrated and dried at 60 C for further use, denoted as TiO 2 xSiO 2 (x5, 10, 30, 50).Blank SiO 2 was performed without the addition of P25 suspension, keeping other processes the same. Catalyst Characterization.Transmission electron microscopy (TEM) images were obtained using a JEOL model JEM 2010 EX instrument at an accelerating voltage of 200 kV.X-ray photoelectron spectroscopy (XPS) measurements were performed on a Thermo Scientific ESCA Lab 250 spectrometer which consists of monochromatic Al Ka as the X-ray source, a hemispherical analyzer, and a sample stage with multiaxial adjustability to obtain the surface composition of the samples.All of the binding energies were calibrated by the C 1s peak at 284.6 eV.The 29Si NMR spectroscopy was collected on a Bruker MSL 400 NMR spectrometer.The spinning rate was 4 kHz and the number of scans was 512.Fourier transform infrared spectroscopy (FT-IR) was performed on a Nicolet Nexus 670 FT-IR spectrophotometer at a resolution of 4 cm -1 .The X-ray diffraction (XRD) patterns of the samples were collected on a Bruker D8 Advance X-ray diffractometer with Ni-filtered Cu K radiation at 40 kV and 40 mA in the 2 ranging from 5 to 80 with a scan rate of 0.02 per The Journal of Physical Chemistry second.The optical properties of the samples were analyzed by UV-vis diffuse reflectance spectroscopy (DRS) using a UV-vis spectrophotometer (Cary 500, Varian Co.), in which BaSO 4 was employed as the internal reflectance standard.Photoelectrochemical measurements were performed with a homemade three-electrode quartz cell with a PAR VMP3 MultiPotentiostat apparatus.A Pt plate was used as the counter electrode, and an Ag/AgCl electrode was used as the reference electrode.The working electrode was prepared on fluoride tin oxide (FTO) conductor glass. Typically, the sample powder (5 mg) was ultrasonicated in 0.5 mL of DMF to disperse it evenly to obtain slurry.The slurry was spread onto the FTO glass, whose side part had been previously protected using Scotch tape.After air drying, the working electrode was further dried at 60 C for 2 h to improve adhesion.A copper wire was connected to the side of the working electrode using conductive tape.Uncoated parts of the electrode were isolated with epoxy resin.Photocurrent measurements were taken on a BAS Epsilon workstation without bias, and the electrolyte was 0. for solid samples were investigated on an Edinburgh FL/FS920 spectrophotometer with an excitation wavelength of 380 nm.For PL decay measurements, the light-emitting diode lamp was used to get the laser beam with excitation wavelengths of 340 nm.The 340 nm laser beam at an incident angle of 45 relative to the normal direction was focused onto the samples at room temperature.Nitrogen adsorption-desorption isotherms and the Brunauer-Emmett-Teller (BET) surface areas were determined at 77 K using Micromeritics ASAP2010 equipment.The sample was degassed at 393 K for 5 hours and then analyzed at 77 K. CO 2 adsorption isotherms was determined at 273 K using Micromeritics ASAP2010 equipment.The sample was degassed at 393 K for 5 hours and then analyzed at 273 K. Catalyst Activity.The photocatalytic reduction of CO 2 was performed in a gas-solid heterogeneous reaction mode in a quartz reactor (volume, 25 ml) (Figure S1).The loading mass of the photocatalyst sample was 20 mg.This system was evacuated by a mechanical pump and filled with pure CO 2 gas.The evacuation-filling operation was repeated three times.0.5 ml of evacuated liquid water was introduced finally with a syringe via the septum into the sample cell (5 ml) hanging in the quartz reactor and the final pressure of CO 2 was kept as 8 KPa.A 300 W commercial Xe lamp (PLS-SXE 300, Beijing Perfectlight Co., Ltd.) was used as an irradiation resource of simulated solar light.The temperature of the reactor was kept at 298 K with an electronic fan.The photocatalytic reaction was typically performed for 8 h, and 0.3 ml of reactive gas was taken from the reactor with a syringe for analysis.The amounts of the products were analyzed by gas chromatography (GC 2014C) fitted with a high-sensitivity thermal conductivity detector (TCD) detector for quantifying the amounts of H 2 formed from H 2 O photoreduction and a flame ionization detector (FID) detector for quantifying the amounts of CO and CH 4 formed from CO 2 photoreduction.After the effluents containing CO 2 , H 2 , CO and CH 4 were separated by a carbon molecular sieve (TDX-01) column, H 2 was analyzed by the TCD detector.CO was further converted to CH 4 by a methanation reactor and then analyzed by the FID detector.The amount of O 2 formed was quantified by Agilent 7890B equipped with 5A column and a TCD detector.The detection limits of our analytic method for CH 4 and CO were both 0.002 mol.The detection limits for H 2 was 0.004 mol.Argon was used as the carrier gas. The products (O 2 , H 2 , CO and CH 4 ) are measured directly by the evolved rate of the product within a certain time period under light irradiation by per gram of catalyst (Eqn.A), provided that no other products are detected by the analysis of gas chromatography.The unit of R is mol The conversion of CO 2 is calculated by the sum of the evolved rate of CO and CH 4 (Eqn.B).The selectivity for CO is calculated using the Eqn.C."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The transmission electron microscopy (TEM) analysis of the samples has been carried out to get its microscopic structure information, as shown in Figure 1.It can be seen that most of the composite features the core-shell structure with the amorphous SiO 2 shell coating the surface of TiO 2 (P25) nanoparticles.Since the surface of the P25-TiO 2 is hydrophilic and possesses a distribution of OH groups, 40 Si(OH) 4 molecules derived from the hydrolysis of TEOS could be easily adsorbed onto the surface layer of TiO 2 to form a shell. 33Then, in the following processes of polycondensation, two or more molecules of Si(OH) 4 are condensed to form SiO 2 and the core-shell structured TiO 2 SiO 2 composite is formed. 32The dimension distribution of the core and the shell for TiO 2 30SiO 2 composites has been statistically estimated and presented in Figure S2, where the TiO 2 core displays the average diameter of ca.20 nm, corresponding to the previous reported diameters of P25; 38 the thickness of the shell mainly ranges from 1.5 to 3.5nm.The ordered crystal lattice fringes are shown in the HRTEM of Figure 1D, of which the spacing is measured to be equal to 0.352 nm and 0.218 nm, corresponding to the (101) crystal plane of anatase and rutile TiO 2 , respectively. The composition of SiO 2 shell and TiO 2 core in the TiO 2 SiO 2 composite can also be identified by X-ray photoelectron spectroscopy (XPS) measurements, an important method to investigate the chemical compositions and the existence forms of the elements in the samples. 41,42 he binding energies (BE) obtained in the XPS analysis have been calibrated for specimen charging by referencing C 1s to 284.6 eV (Figure 2A).In the region of Si 2p (Figure 2B), the BE of TiO 2 SiO 2 is equal to 103.4 eV, corresponding to the Si-O-Si bond, 39,43 while no such signal is detected in the BE of bare TiO 2 , which suggests the formation of SiO 2 in TiO 2 SiO 2 composites. 44In the region of O 1s (Figure 2C), the peaks appearing at 529.8 eV, 531 eV and 531.8 eV are attributed to crystal lattice oxygen of TiO 2 (Ti-O), physical adsorbed oxygen, and hydroxyl group, respectively. 43,45,46 FTiO 2 SiO 2 , another high peak located at 533.3 eV is also ascribed to the Si-O-Si bond. 43,47 n the region of Ti 2p (Figure 2D), for bare TiO 2 , two peaks located at 458.6 eV and 464.2 eV are corresponding to the BE of Ti 2p 3/2 and Ti 2p 1/2 , respectively, indicating that the Ti element is present as the chemical state of Ti 4 . 45,48,49 A for TiO 2 SiO 2 , the peak locations shift towards higher BE by 0.3 eV, manifesting that Ti-O-Si bond forms by the way of silicon substitution of titanium.The larger electronegativity of Si (1.8) than Ti (1.5) leads to the decrease of the electron density around Ti species and thus the effective positive charge on Ti increases, resulting in the increase of the BE of Ti 2p. 46,48 he combination of TEM and XPS results verifies that core-shell structured TiO 2 SiO 2 has been successfully fabricated by such a simple sol-gel approach. Since the Si chemical shifts are sensitive to the second neighbor environment, 29 Si-NMR has been employed to study the local structure between Si linkages in the TiO 2 SiO 2 composites. 50It is known that SiO 2 exhibits signals corresponding to the resonance of Q n (n 0-4) species, which denotes a 29 Si nucleus with a Si(SiO) n (OX) 4-n local environment, where X represents H or Ti. 51As for the 29 Si-NMR spectrum of TiO 2 30SiO 2 shown in Figure 3, three peaks at chemical shifts of -110.5, -101.1 and -91.8 ppm are mainly observed and assigned to Q 4 , Q 3 , and Q 2 , respectively. 52 Q 4Q 4 sites are Si(SiO) 4 structural units for pure silica, indicating that the silica has a well-developed three-dimensional framework. 50Q 3 sites can be attributed to contributions from both Si(OSi) 3 (OH) and Si(OSi) 3 (OTi), while Q 2 sites from Q 2 Si(SiO) 2 (OH) 2 and Q 2 Si(SiO) 2 (OTi) 2 , as OH and OTi groups have a similar influence on the central 29 Si nucleus. 52e chemical bonding between the TiO 2 core and SiO 2 shell of TiO 2 xSiO 2 composites is further investigated by the Fourier trans-infrared (FT-IR) spectra.As shown in Figure 4, the bands at 650 cm -1 , 1640 and 3480 cm -1 observed in all the samples correspond to Ti-O-Ti stretching vibration of crystalline TiO 2 phase, the bending vibration of hydroxyl groups and water, respectively. 53,54 ther two bands around 930 and 1080 cm -1 are shown in the spectra of all the TiO 2 xSiO 2 composites. The former is commonly accepted as the characteristic stretching vibration of Ti-O-Si bonds in Tiand Si-containing catalysts, implying that the substitution of Si for Ti has occurred to form Ti-O-Si bonds in the composites, 54555657 which is corresponding to the results of the XPS spectra.The latter corresponds to the asymmetric stretching vibration of Si-O-Si bond in the SiO 2 shell. 53,54,57 Te results further confirm the successful coverage of SiO 2 over the TiO 2 particles and verify the formation of Ti-O-Si bond between SiO 2 and TiO 2 particles. The X-ray diffraction (XRD) patterns have been carried out to study the crystal structures of the samples.As shown in Figure 5A, all the samples except bare SiO 2 are the mixture of anatase and rutile phases of TiO 2 particles, which agrees with the phase composition of Degussa P25 (approximately 80 anatase and 20 rutile). 5859960 And the good crystallinity of TiO 2 is well maintained during such a simple sol-gel preparation process at ambient conditions.One broad peak at ca. 23 can be observed for the TiO 2 xSiO 2 composites with high weight ratios of SiO 2 (30, and 50), which corresponds to the bare silica with amorphous structure. 61,62 his broad peak is quite weak and even cannot be detected for TiO 2 xSiO 2 with low SiO 2 weight ratio, which could be due to its relatively weak diffraction intensity. 60Diffuse reflection spectra (DRS) analyses have been implemented to explore the influence of the silica shell on the optical properties of the samples.As shown in Figure 5B, the absorption edges around 410 nm are observed for all the samples.Almost no obvious changes are observed in both UV and visible light region for the optical absorption of the TiO 2 xSiO 2 composites as compared with bare TiO 2 .These suggest that the coating of SiO 2 layer over the TiO 2 surface does not result in significant loss of light absorption of TiO 2 , which is because of the high optical transparency of SiO 2 . After acquiring the successful coverage of SiO 2 layer over TiO 2 , we have examined the photocatalytic performance of TiO 2 and TiO 2 xSiO 2 composites towards the photoreduction of CO 2 with H 2 O under simulated solar light irradiation.Figure 6A shows the product distribution after 8h light irradiation and it is clear to see that in comparison with bare TiO 2 , the photocatalytic reduction of CO 2 into CO is remarkably enhanced and the production of CH 4 is almost completely inhibited over TiO 2 xSiO 2 composites.In addition, the photoreduction of H 2 O to H 2 , the competitive reaction with the reduction of CO 2 , has been efficiently inhibited over TiO 2 SiO 2 composites.Figure 6B clearly demonstrates that TiO 2 30SiO 2 exhibits the highest conversion among all the samples.In particular, the selectivity of CO 2 photoreduction to CO is significantly improved, where TiO 2 30SiO 2 attains the highest selectivity of 72.4, which is nearly three times as that of bare TiO 2 (25.2). To understand how the SiO 2 layers influence the photocatalytic activity and selectivity toward reduction of CO 2 , we have mainly investigated the structure-photocatalytic performance relationship in terms of joint analysis on surface area and the lifetime of photogenerated electron-hole pairs.The structure properties for the series of samples obtained from the N 2 adsorption-desorption and CO 2 adsorption experiments are summarized in Table S1, and it is clear to see that the BET surface areas for TiO 2 xSiO 2 composites are increased with the content of SiO 2 , among which the average surface area of TiO 2 30SiO 2 (92 m 2 /g) and TiO 2 50SiO 2 (95 m 2 /g) nearly attain twice the values of bare TiO 2 (57 m 2 /g). Figure S3 shows the representative N 2 adsorption-desorption isotherms of the samples, all of which exhibit characteristic feature of type IV isotherm with a type H2 hysteresis loop, which is associated with a typical mesoporous structure. 63As compared to bare TiO 2 , the total pore volumes of TiO 2 xSiO 2 composites increase with the content of SiO 2 from 0.23 cm 3 /g (TiO 2 ) to 0.51 cm 3 /g (TiO 2 50SiO 2 ), with the average pore size of the samples enlarges from 15nm (TiO 2 ) to 27 nm (TiO 2 50SiO 2 ).Additionally, Figure 7 displays the CO 2 adsorption isotherms of the TiO 2 and TiO 2 xSiO 2 samples, and it can be seen that the bare TiO 2 only exhibits CO 2 uptakes of 6.91cm 3 /g and the values keep increasing with the SiO 2 content, of which the maximum CO 2 uptake for TiO 2 50SiO 2 reaches 16.89cm 3 /g, nearly three times as that of bare TiO 2 (Table S1).The results suggest that the coverage of SiO 2 over TiO 2 can significantly enhance the surface area and CO 2 adsorption ability of the photocatalysts, which is desirable to be able to facilitate the mass transfer process of CO 2 on the catalyst as well as the activation of CO 2 , thus contributing to enhanced photocatalytic performance for CO 2 reduction. 64e effect of electronic interaction between SiO 2 coating layer and TiO indicate that the coverage of SiO 2 layer over TiO 2 leads to an increase in the charge transfer resistance at the samples/electrolyte interface due to the insulating nature of SiO 2 , which prohibits the charge injection from inner TiO 2 core through the silica layer to the outer surface. 48,65,66 Ohe other hand, the photoluminescence (PL) quenching effect, an useful technique to investigate the charge transfer within a specific semiconductor photocatalyst, 37 is employed to elucidate the charges carriers recombination behavior within the TiO 2 xSiO 2 composites.It is well known that following the electron-hole pairs recombination after a photocatalyst is irradiated, photons are emitted, resulting in PL signal, whose intensity provides a direct, qualitative measurement of the recombination rate of charge carriers.Lower peak intensities imply that a larger amount of photogenerated electrons are trapped and efficiently transferred, while high peak intensities indicate the occurrence of rapid charge recombination.10,37,67,68 Figure 9 shows the PL Page 14 of 34 The Journal of Physical Chemistry spectra of the samples and it is clear to see that the PL intensity of all TiO 2 xSiO 2 composites is lower than that of non-entrapped TiO 2 , among which TiO 2 5SiO 2 exhibits the lowest PL intensity. The results suggest that as compared to bare TiO 2 , the recombination of charge carriers within the TiO 2 xSiO 2 composites is effectively inhibited.In order to figure out the lifetimes of the charge carriers within the photocatalysts, the photoluminescence decays of the samples are further measured. Table S2 displays the PL lifetimes of the samples, which are calculated through the exponential fit to the experimental data.It can be seen that all the TiO 2 xSiO 2 composites exhibit longer PL lifetimes than the bare TiO 2 , among which TiO 2 5SiO 2 presents the longest PL lifetime while further increasing the coating amount of SiO 2 leads to decreased lifetimes.The order of the PL lifetimes of the series of TiO 2 xSiO 2 composites is: TiO 2 5SiO 2 TiO 2 10SiO 2 TiO 2 30SiO 2 TiO 2 50SiO 2 P25, which is in accordance with the result of PL spectra.The above PL and PL lifetime results indicate that the charge carriers separation within the TiO 2 xSiO 2 composites is more efficient than that within bare TiO 2 , which could be due to the formation of Ti-O-Si bridging bonds in the core-shell TiO 2 xSiO 2 composites.Such an effect has been observed over the non-core-shell composite photocatalyst consisted of ruthenium (Ru) doped anatase TiO 2 supported on silica, which are prepared by the solid-state dispersion method.Therein, it has been disclosed that the inhibition of the formation of the Ti-O-Si bonds by doping with Ru is detrimental to the charge carriers separation. 21,54 pecifically, TiO 2 5SiO 2 composite with the smallest coating amount of SiO 2 is the optimal component construction for attaining the best charge carriers separation efficiency. The combination of the photoelectrochemical properties and PL results indicate that although coating SiO 2 layer over TiO 2 is disadvantageous for the separation and transfer of photoinduced electron-hole pairs to the outer surface of the sample, the separation efficiency of the charge carriers within the inner pore structure of core-shell TiO 2 xSiO 2 composites is still facilitated due to the Ti-O-Si bonds formed in the as-prepared TiO 2 xSiO 2 composites. Thus, the above results suggest that the CO 2 adsorption and charge carriers separation should have synergistic effect on the performance of CO 2 photoreduction, which rationalizes the best photoactivity for CO 2 reduction achieved neither over TiO 2 50SiO 2 with the highest CO 2 adsorption capacity nor TiO 2 5SiO 2 with the most efficient charge carriers separation efficiency. It is the TiO 2 30SiO 2 , which could balance the combined influence of the CO 2 adsorption and charge carriers separation, that acquires the best photoactivity performance.Such synergistic effect of increased CO 2 adsorption ability and lengthen lifetimes of the charge carriers over TiO 2 SiO 2 composites may also account for the selectivity tuning in the CO 2 photoreduction as compared to that over bare TiO 2 .As schematically shown in Figure 10, under simulated solar light irradiation, TiO 2 are photoexcited by the UV-part of the light to produce electrons (e -) and holes (h ) (Eqn.1).In the case of core-shell TiO 2 SiO 2 , the electrons can diffuse to inner porosity of the silica cages where they can react with the adsorbed and incoming CO 2 molecules, and the facilitated separation of the charge carriers favors the proceeding of the photocatalytic redox reactions.The H 2 O vapor which acts as a sacrificial electron donor undergoes oxidation to release O 2 (Table S3) and protons (H ) (Eqn.2), with which CO 2 and corresponding number of electrons interact can produce CH 4 (Eqn.3)or CO (Eqn.4).A competing reaction is that the H can react with e -to be reduced to H 2 (Eqn.5).As compared to bare TiO 2 , TiO 2 SiO 2 can adsorb more CO 2 , get more probability to be reduced and thus efficiently suppresses the formation of H 2 .In particular, it is well known that the formations of CO and CH 4 require two and eight electrons, respectively.In the case of TiO 2 SiO 2 , the enriched"
  },
  {
    "title": "Conclusions",
    "content": "Core-shell structured TiO 2 SiO 2 composites have been prepared by entrapping TiO 2 within SiO 2 matrix through a simple sol-gel method under ambient temperature and pressure and firstly applied to photocatalytic CO 2 reduction with H 2 O in gas-phase under simulated solar light irradiation. It has been found that TiO 2 SiO 2 composites exhibit higher photoactivity for CO 2 reduction compared to the non-entrapped TiO 2 , which is attributed to the synergistic effects of the increased adsorption capacity towards CO 2 as well as the lengthened fate of electron-hole pairs in TiO 2 SiO 2 composites.In particular, the coating layer of silica over TiO 2 contributes to achieving high selectivity of CO formation during the photocatalytic reduction of CO 2 , where the enriched density of adsorbed CO 2 on the reactive sites of the samples plays the crucial role.It is anticipated that our work could inspire ongoing interest in utilizing the SiO 2 coating method as well as other proper core-shell strategy to tune the activity and selectivity of semiconductor-based materials for artificial photoreduction of CO 2 to value-added solar fuels. Na 2 SO 4 solution (pH 6.8) without additives.The electrochemical impedance spectroscopy (EIS) measurement was measured via an EIS spectrometer (CHI-660D workstation, CH Instrument) in the three-electrode cell in the presence of 0.5 M KCl solution containing 5.0 mM K 3 Fe(CN) 6 /K 4 Fe(CN) 6 by applying an AC voltage with 5 mV amplitude in a frequency range from 1Hz to 100 kHz under open circuit potential conditions.The photoluminescence (PL) spectra photoelectrochemical properties of the samples has been investigated by electrochemical impedance Figure 1 Typical transmission electron microscopy (TEM) images (A-C) and high resolution TEM Figure 329 Si-NMR spectrum of TiO 2 30SiO 2 composite. Figure 10 Illustration of the possible reaction mechanism for photocatalytic reduction of CO 2 with of adsorbed CO 2 and the thus relative lower electron density favor the formation of CO, leading to higher selectivity of photocatalytic reduction of CO 2 to CO.In brief, the synergistic interaction of TiO 2 with the SiO 2 layer plays a crucial role in affecting the activity and selectivity for the photoreduction of CO 2 over TiO 2 SiO 2 composites. Yuan, L.; Xu, Y.-J.Photocatalytic conversion of CO 2 into value-added and renewable fuels.Appl.Significant enhancement of the activity of Pt-TiO 2 in CH 4 formation by addition of MgO. Chem.Commun.2013, 49, 2451-2453.(15) Liu, L.; Zhao, C.; Zhao, H.; Pitts, D.; Li, Y. Porous microspheres of MgO-patched TiO 2 for CO 2 photoreduction with H 2 O vapor: Temperature-dependent activity and stability.Chem.Commun.2013, (19) Meng, X.; Wang, T.; Liu, L.; Ouyang, S.; Li, P.; Hu, H.; Kako, T.; Iwai, H.; Tanaka, A.; Ye, J. Photothermal conversion of CO 2 into CH 4 with H 2 over Group VIII nanocatalysts: An alternative The support from the Key Project of National Natural Science Foundation of China (U1463204), the National Natural Science Foundation of China (20903023 and 21173045), the Award Program for Minjiang Scholar Professorship, the Natural Science Foundation of Fujian Province for Distinguished Young Investigator Grant (2012J06003), the Independent Research Project of State Key Laboratory of Photocatalysis on Energy and Environment (NO.2014A05), the 1st Program of Fujian Province for Top Creative Young Talents, and the Program for Returned High-Level Overseas Chinese Scholars of Fujian province is gratefully acknowledged. The Journal of Physical Chemistry The Journal of Physical Chemistry"
  }
]