[
  {
    "title": "Doi",
    "content": "10.1016/j.materresbull.2020.111073"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic CO2 reduction over Nb2O5/basic bismuth nitrate nanocomposites"
  },
  {
    "title": "Abstract",
    "content": "In this work, CO 2 was photocatalytic converted to valuable chemicals using photoactive basic bismuth nitrates (Bi 6 O (4x) (OH) (4-x) (NO 3 ) (6-x) ).nH 2 O, x 0-2, n 0-3) and niobium pentoxide nanocomposites (BBN/Nb 2 O 5 ).Milder hydrothermal synthesis (at 120 C) maintained the crystal lattice of the BBN precursor (Bi 6 O 5 (-OH) 3 (NO 3 ) 5 .3H 2 O), while the synthesis carried out at 230 C led to lamellar Bi 2 O 2 (OH)(NO 3 ).Despite of the sample treated at 230 C did not present the required band edge positions to reduce CO 2 , all the other materials were active for CO 2 photoreduction.CO (2.8 mol g -1 h -1 ) was identified as the main product, followed by C 2 H 4 (0.1 mol g -1 h -1 ), with the latter being favored using the nanocomposite produced at 120 C. Scavenger experiments revealed that the photocatalytic mechanism is based on a Z-scheme, where molecules are oxidized in the valence band of Nb 2 O 5 and CO 2 is reduced in the conduction band of BBN."
  },
  {
    "title": "Experimental",
    "content": "obtained from CBMM (Brazil), and bismuth nitrate (Bi(NO 3 ) 3 .5H 2 O), purchased from Vetec (Brazil), were the sources of Nb and Bi, respectively.Hydrogen peroxide (30 , Synth) was used as oxidant.Rhodamine B (RhB, C 28 H 31 ClN 2 O 3 ) was purchased from Contemporary Chemical Dynamics.Deionized water was used to prepare all the solutions. BBN/Nb 2 O 5 nanocomposites were synthesized by the OPM method.The bismuth nitrate was dissolved in 40 mL of distilled water, immediately forming a highly hydrated basic bismuth nitrate precipitate (Bi 6 O 5 (OH) 3 (NO 3 ) 5 .3H 2 O) 22, denoted P-BBN.This precipitate was maintained under vigorous magnetic stirring during 10 min at room temperature, before the addition of hydrogen peroxide (H 2 O 2 :M molar ratio of 10:1; M Bi Nb).Next, ammonium niobium oxalate was added at a molar ratio of 3Bi:1Nb, turning the synthesis medium yellowish, indicating formation of the niobium peroxo complex 33,34. After stirring for 10 min, the suspension was poured into a Teflon-lined hydrothermal reactor, operated under autogenous pressure, in order to promote crystallization using the two different procedures described in Table 1.The as-synthesized samples were denoted Nb-BBN120 and Nb-BBN230.After cooling to room temperature, the materials were centrifuged, washed with distilled water and isopropyl alcohol, and dried overnight at 50 C. To better understand the photoactivity and structure of BBN, two other materials were also synthesized, for comparison: 1) pure Nb 2 O 5 was obtained by heating the reaction medium without BBN, using the same procedure described in Table 1 to synthesize Nb-BBN120; 2) synthesis of BBN230 by heating the reaction medium without Nb ions, according the steps described in Table 1 to obtain Nb-BBN230. The crystalline structures were analyzed by X-ray diffraction (XRD), using a Shimadzu XRD 6000 diffractometer equipped with a Cu K radiation source ( 1.5418 A) and operated in the 2 range 5-70 , with a step size of 0.02 and scanning at 1 min -1 .High resolution transmission electron microscopy (HRTEM) images were obtained using a FEI-TECNAI G2 F20 microscope operated at 200 kV.The samples were prepared for TEM analysis by depositing a drop of the colloidal alcoholic suspension on a carbon-coated copper grid, followed by drying in air.Field emission gun-scanning electron microscopy (FEG-SEM) images were recorded using a Philips XL-30 FEG instrument.Diffuse reflection spectroscopy (DRS) was performed using a Varian Cary 5 G spectrophotometer, at wavelengths between 250 and 600 nm, at room temperature.The band gap values (E gap ), calculated by the Tauc method 35, were determined from the interception of the x axis with the tangent line of the (h) 1/2 against (h) plot, considering the indirect allowed transition 36.The specific surface area (SSA) was measured in a Micromeritics ASAP 2020 using the BET isotherm. The thermal stabilities of the samples were analyzed by thermogravimetry (TGA) and derivative thermogravimetry (DTG), using a TA Instruments TGA Q500 analyzer.The measurements were performed using a platinum pan, a temperature range of 30-700 C, and a heating rate of 10 C min -1 , employing synthetic air and nitrogen at flow rates of 60 and 40 mL min -1 , respectively.A DSC 6300 differential scanning calorimeter equipped with an EXSTAR 6000 communication device was used to determine the thermal events.The DSC measurements were performed using 28 mg of the as-synthesized materials, in a platinum crucible, under a 50 mL min -1 flow of argon, with analytical grade alumina powder as a reference.The temperature was increased from room temperature to 900 C, at a rate of 10 The chemical bonds were identified by Raman spectroscopy, using a Horiba Jobin-Yvon LabRAM Raman micro-spectrometer coupled to an Olympus TM BX41 microscope and a Melles Griot argon-ion laser operating at 633 nm, with 17 mW source excitation power.The equipment was calibrated using a silicon standard, with the main Raman band fixed at 520 cm -1 , in order to set the wavelength scale.The scan was performed between 50 and 2000 cm -1 .Surface contamination was analyzed by Fourier transform infrared spectroscopy (FTIR), performed with KBr pellets, using a Bruker Vertex 70 spectrophotometer.The FTIR spectra were obtained with 64 scans at 2 cm -1 resolution, in the range between 4000 and 400 cm -1 .The chemical states of the as-synthesized samples were investigated by X-ray photoelectron spectroscopy (XPS), using a Scienta Omicron ESCA spectrometer coupled to a high performance EA 125 hemispherical analyzer, with monochromatic Al K (h 1486.6 eV) radiation as the excitation source.The operating pressure in the ultra-high vacuum chamber during the analysis was 2 10 -9 mbar.Energy steps of 0.50 and 0.05 eV were used for the survey and high resolution spectra, respectively.The O 1s, C 1s, Nb 3d, and Bi 4f lines were used for the quantitative analysis.The C-(C, H) component of the C 1s peak of adventitious carbon was fixed at 284.5 eV, in order to Hydrothermal conditions for the synthesis of Nb-BBN120 and Nb-BBN230. Step Heating rate ( set the bond energy scale, and the deconvolutions were performed by Gaussian curve fitting. The atomic concentrations of bismuth and niobium were determined by X-ray fluorescence (XRF) and inductively coupled plasma-optical emission spectrometry (ICP-OES).The XRF analyses were performed using a Thermo Scientific ARL Perform'X instrument.The samples were previously dried at 300 C for 1 h and were then mixed (0.5 g) with cellulose (0.1 g), prior to the formation of pellets by applying a pressure of 60 kN for 2 min.The ICP-OES determinations of Bi and Nb were performed at 223.061 and 313.078 nm, respectively, using a Thermo Scientific iCAP 6000 instrument. CO 2 photoreduction was performed in a batch gas-phase reactor (14 mL) 37 containing 10 mg of powder deposited on a glass substrate (3.24 cm 2 ) by drop-coating.Highly pure CO 2 was passed through a water bubbler to produce a mixture of CO 2 and water vapor, at room temperature.Prior to the experiment, a flow of this mixture was passed through the experimental setup for 20 min.The assays were carried out for 6 h, under UV-C irradiation (TUV Philips 18 W mercury lamp, 254 nm), at 30 C and atmospheric pressure.Gas phase aliquots (200 L) collected at different irradiation times were analyzed by gas In order to understand the role of oxidative species, this reaction was compared to the degradation of a well-known dye, rhodamine B (RhB), which was selected with the purpose to facilitate comparison of the photocatalysts with others reported in the literature.A 10 mL volume of an aqueous solution of RhB (10 mg L -1 ) was used, together with 10 mg of the dispersed photocatalyst.The dispersions were exposed to ultraviolet irradiation, at room temperature, under continuous stirring at 200 rpm.Photooxidation assays were performed using a batch reactor equipped with four TUV Philips 15 W mercury lamps (UV -C, 254 nm).The bleaching of RhB was measured at 554 nm 38, using an Ultrospec 2100 pro spectrophotometer.No direct photolysis or adsorption in the dark was observed.The photocatalytic stability of the as-synthesized samples was evaluated using four consecutive 2-hour RhB decolorization cycles.The reuse data were normalized using the decolorization percentage in the first cycle as a reference.In addition, the RhB photodegradation mechanism was investigated by adding reactive scavengers directly to the solutions containing BBN/Nb 2 O 5 and RhB.In this procedure, 5 mM tert-butanol (TB), 1 mM potassium bromate (KBrO 3 ), or 5 mM sodium oxalate (SO) were added as scavengers for OH, conduction band (CB) electrons, and valence band (VB) holes, respectively 33,39."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The XRD patterns (Fig. 1(a)) revealed that the crystallographic structures of the Nb-BBN120 and Nb-BBN230 samples mostly consisted of monoclinic Bi 6 O 5 (OH) 3 (NO 3 ) 5 .3H 2 O (ICSD 00-2406) and orthorhombic Bi 2 O 2 (OH)(NO 3 ) (ICSD 15-4359) phases, respectively.It is often difficult to identify the pure phases of BBN due to its complex chemistry with many compositions, thus requiring additional characterizations.Indeed, in the case of Nb-BBN230, the main XRD peaks are similar to those found for Bi 2 O 2 (OH)(NO 3 ) (ICSD 15-4359) and Bi 6 O 6 (OH) 3 (NO 3 ) 3 .1.5H 2 O (JCPDS 53-1038) (Fig. 1(b)).According to the literature, the Raman spectrum of Bi 2 O 2 (OH)(NO 3 ) presents an intense Raman mode at 155 cm -1 that is not observed in any other BBN stoichiometry 8,18.Fig. 2 reveals that Nb-BBN230 presents a Raman mode at 160 cm -1 , confirming the Bi 2 O 2 (OH)(NO 3 ) phase for Nb-BBN230.This prominent vibrational mode is related to the presence of (Bi 2 O 2 ) 2 layers (Table S1), providing a further evidence that the as-prepared Nb-BBN230 is a layer-structured Bi 2 O 2 (OH)(NO 3 ).Furthermore, Nb-BBN120 presents more Raman modes associated to nitrate ions than Nb-BBN230, corroborating the information observed by XRD that Nb-BBN120 is composed by a BBN phase containing higher amount of NO 3 -than Nb-BBN230. The pure Nb 2 O 5 (Fig. 1 S1). The data in Fig. 1(a) also shows that the crystalline structures of Nb-BBN120 and Nb-BBN230 were formed before 1 h, since no further changes of the crystalline phases occurred after this time.The three main diffraction peaks of Nb-BBN230 indicates the preferred orientation along the 001 plane, as shown by the strongest peaks at (002), (006), and (008) 8.Interestingly, Nb-BBN120 and P-BBN presented similar XRD patterns, suggesting that the hydrothermal treatment required to synthesize Nb-BBN120 did not change the re-mineralized crystal structure of P-BBN. A new material, denoted BBN230 (Fig. 1(c)), was prepared in order to obtain a better understanding of the role of niobium ions.The sample synthesized in the absence of niobium (BBN230) showed diffraction peaks ascribed to Bi 6 O 6 (OH) 3 (NO 3 ) 3 .1.5H 2 O (JCPDS 53-1038).This finding demonstrated that the presence of niobium ions during the synthesis affected the BBN structure (Nb-BBN230), leading to the layerstructured Bi 2 O 2 (OH)(NO 3 ). The TGA/DTG analyses (Fig. 3(a)) showed that the pristine P-BBN and Nb-BBN120 had similar main mass losses at 300 C, related to the dehydration of Bi 6 O 5 (OH) 3 (NO 3 ) 5 .3H 2 O 41.The sharp transition in the DSC plot for Nb-BBN120 (Fig. 3(b)) reinforced that the mass loss was very specific and was associated with lattice water.On the other hand, for Nb-BBN230, the absence of this event at 300 C suggested the absence of hydration water, in accordance with the proposed stoichiometry (Bi 2 O 2 (OH)(NO 3 )) for this material.In addition, a less pronounced mass loss at 350 C was indicative of the elimination of hydroxyl groups 19,25.Interestingly, only the precursor presented mass loss at higher temperatures, in the 450-500 C range typically reported for the decomposition of BBN to Bi 2 O 3 23,25,42.This evidenced that the addition of Nb 2 O 5 in the BBN system improved the thermal stability of the final composites, since higher temperatures are required to convert BBN into Bi 2 O 3 .It is well known that more thermally stable structures can be obtained with the addition of Nb 2 O 5 434445.Although no XRD peak was observed for Nb 2 O 5 (Fig. 1(a)), its presence in the nanocomposites was confirmed by complementary techniques: XRF and ICP-OES (Table S2), micro-Raman spectroscopy (Fig. 2 and Table S1), FTIR (Fig. 4 and Table S3), and XPS (Fig. 5 and Fig. S1). Table S2 shows the atomic concentrations of bismuth (72 wt.) and niobium (8 wt.), as determined by XRF and ICP-OES.Comparison of the Bi and Nb concentrations obtained by the two techniques, using the paired t-test, revealed no significant differences (at the 95 confidence level).Nb-BBN120 and Nb-BBN230 presented high percentages of niobium atoms, with the contents of Bi and Nb being almost the same for the two BBN/Nb 2 O 5 samples, demonstrating that the structural modification was not due to the metal stoichiometry.The presence of niobium in the BBN samples was also confirmed by micro-Raman spectroscopy (Fig. 2 and Table S1).Niobium-based materials have characteristic Raman phonon modes associated with different types of niobium-oxygen polyhedra, but the predominant form is the NbO 6 octahedron 46.Some weak Raman bands can also be observed, assigned to NbO 4 tetrahedra.Since the Nb 5 ions are too small to form regular NbO octahedra, while the oxygen atoms in this structure do not obey the Pauling electrostatic valence rule, there are distortions in the niobium-based oxides due to corner or edge-shared NbO polyhedrals, which can result in formation of the NbO 4 configuration.The observed C--O stretching is probably associated with synthesis residues (from the ammoniacal niobium oxalate).The FTIR spectra (Fig. 4 and Table S3) showed weak bands at around 929, 716, and 607 cm -1 , assigned to Nb-O stretches.Notably, the bands associated with lattice water (at 3530 and 3500 cm -1 ) and bismuth bonded to hydroxyl (at 1606 cm -1 ) were narrower and less intense for Nb-BBN230, further confirming that this sample had fewer water molecules in the structure, as already demonstrated by the XRD (Fig. 1(a)) and TGA/DSC analyses (Fig. 3(a)). The surface chemical compositions of Nb-BBN230 and Nb-BBN120 were studied by XPS.The survey spectra are shown in Fig. S1.Fig. 5 shows the high resolution XPS spectra in the Bi 4f, Nb 3d, and O 1s regions.The Bi 4f 7/2 and Bi 4f 5/2 peaks (Fig. 5(a-b)) were centered at 159.2 eV and 164.5 eV, respectively, with a peak separation of 5.3 eV, ascribed to Bi 3 , which is consistent with the literature 6,47.The Nb 3d region (Fig. 5(c-d)) presented two peaks with binding energies at 207 eV (Nb 3d 5/2 ) and 210 eV (Nb 3d 3/2 ) which were in good agreement with the binding energies usually reported for Nb 5 bonded to O 2- 48,49.The O 1s high resolution XPS spectra (Fig. 5(e-f)) showed three main peaks located at binding energies of around 529, 531, and 533 eV, assigned to the lattice oxygen ions of Bi-O 50, hydroxyl group, and NO 3 - 13,23, respectively.It also should be noted that the peak at 529 eV for Nb-BBN230 is more intense than the observed for Nb-BBN120, suggesting that Nb-BBN230 presents much more surface bismuth species that would be responsible for its yellowish appearance 51. The SEM images of Nb-BBN120 and Nb-BBN230 (Fig. 6(c-d)) revealed significant differences in their morphologies, with Nb-BBN230 presenting nanoneedles (15 nm width and 130 nm length), while Nb-BBN120 presented 1 m clusters composed of 70 nm particles. The TEM images of the Nb-BBN230 nanoneedles shown in the inset of Fig. 6(d) and Fig. S2(a) confirm the preferential orientation previously verified by XRD (Fig. 1(a)) and allowed to determine the interlamellar distance as 1.29 nm.The EDS mapping of the elements in Nb-BBN120 (Fig. S2(b)) reveals its homogeneous chemical composition, indicating that the hemispheres highlighted in Fig. 6(c) are not related to phase segregation, but only to a combination of different morphologies.On the other hand, P-BBN showed rod-like morphology (Fig. 7(a-b)) at a micrometric scale (1 m width and 3 m length), demonstrating that the hydrothermal treatment altered the BBN morphology and decreased the particle size, because solubilization and re-precipitation occurred simultaneously during the synthesis of BBN/Nb 2 O 5 .Interestingly, the presence of Nb 2 O 5 also affected the BBN morphology, since the absence of niobium ions during the synthesis of BBN230 (Fig. 7(c)) resulted in the formation of nanorods (45 nm width and 183 nm length), instead of nanoneedles.Therefore, BBN230 presented different morphology and particle size, compared to Nb-BBN230.Furthermore, Nb-BBN120 presented well-defined crystal planes with interplanar spacing of 3 A, related to the (312) plane of Bi 6 O 5 (OH) 3 (NO 3 ) 5 .3H 2 O (Fig. 6(a)).Nb-BBN230 showed a d-spacing of 4.5 A, corresponding to the (004) plane of Bi 2 O 2 (OH)(NO 3 ), and dots of 9 A (inset in Fig. 6(b)), suggesting the presence of a zone-axis with small crystal plane surfaces at the atomic scale 52,53.The DRS analyses (Fig. S3) showed that the samples absorbed in the ultraviolet (UV) region.The (h) n vs. h plot (inset of Fig. S3) revealed that the E gap values for Nb-BBN120 and Nb-BBN230 were 3.1 eV, in good agreement with the values reported in the literature for BBN 8,13,25,54.This high E gap value indicated that the photocatalysts could not be activated by visible radiation, but they could be considered promising photocatalysts when irradiated with UV light. The photoreactivity of the nanocomposites was confirmed in the conversion of CO 2 (Fig. 8).As far as we know, this is the first time that the photoreduction properties of BNN have been studied.No photoreduction activity was observed for Nb-BBN230, suggesting that the crystalline phases of BNN play an essential role in determining the photoactivity in redox reactions.This could be explained by the fact that the electrons in the Bi 2 O 2 (OH)(NO 3 ) CB (-0.31 V vs. NHE at pH 7) 13 do not present the required potential for CO 2 reduction, since this reaction occurs at more negative potentials 55.Considering that the Bi 2 O 2 (OH)(NO 3 ) VB has a very positive potential for oxidation (2.83 V vs. NHE at pH 7) 13, the holes are extremely reactive, so Nb-BBN230 consequently presented excellent oxidation properties. On the other hand, the Bi 6 O 5 (OH) 3 (NO 3 ) 5 .3H 2 O CB (-1.64 V vs. NHE at pH 7) 22 has the appropriate band position for conversion of CO 2 into valuable compounds, leading to high photoresponses for P-BBN and Nb-BBN120.As shown in Fig. 8, P-BBN was very selective for carbon monoxide (CO), since this was the only product detected when this material was used.A simple representation of the CO formation is shown in Eq. 1. Ethylene (C 2 H 4 ) was also obtained using Nb 2 O 5 and Nb-BBN120 as photocatalysts, but at low yields because the reaction requires the transfer of 12 electrons (Eq.2).Although similar amounts of CO were obtained using Nb-BBN120, P-BBN, and Nb 2 O 5 , the production rate of C 2 H 4 was higher using Nb-BNN120, indicating that there is a synergistic effect of both components in the reduction process.Although more experimental evidence of this hypothesis is needed, our results indicate that the coupling of two catalysts can lead to different distributions of CO 2 reduction products.The reaction rates obtained for CO and C 2 H 4 using the synthesized photocatalysts (Table S4) were similar to, or even higher than, those obtained elsewhere using TiO 2 , Cu 2 O, or Bi-based semiconductors 56575859606162636465.Remarkably, these comparable results were achieved using a significantly lower irradiation power, compared to the earlier studies, which is a factor that should be taken in account for future applications. It is important to note that the organic residues from synthesis at the samples are not responsible for the CO and C 2 H 4 production, since the blank tests (under N 2 atmosphere) of the photoactive materials showed extremely low production rates of CO and no C 2 H 4 has been detected (Fig. S4).Reuse tests were also performed to evaluate the stability of the samples during four 6-hour CO 2 photocatalysis cycles (Fig. 8(c-d) and Table S4).The reaction rates of CO 2 conversion to CO and C 2 H 4 decreased significantly after the first cycle.In order to understand the possible reasons for this phenomenon, FTIR spectra of the samples were acquired before (Fig. 4) and after (Fig. S5) the photoreduction assays.No band interference of the glass substrate was verified (Fig. S5).The dashed lines refer to the BBN/Nb 2 O 5 wavenumbers shown in Table S3. All the bands assigned to surface groups disappeared after the first cycle, leaving only some weak signals associated with Bi-O, Nb-O, Bi-OH, and NO 3 -(Table S3).Hence, the decrease of the photoactivity after the first cycle could be attributed to the elimination of these surface groups.It should be noted that the loss of photoactivity was not related to crystalline phase transformations, since the XRD analyses performed after the photocatalysis revealed no changes in the diffractograms. Considering that an oxidation reaction occurs simultaneously with the CO 2 reduction, the photooxidation capacities of the samples were indirectly evaluated using a dye as a probe.The photooxidation kinetics (Fig. S6(a)) revealed that the hydrothermal treatment in the presence of Nb 2 O 5 was crucial for enhancing the photoactivity of BBN.It is important to point out that all the samples had similar specific surface areas (45 m 2 g -1 ), so the differences in the degradation kinetics could not be attributed to differences in the illuminated surfaces.Although Nb-BBN120 and P-BBN contained the same BBN phase, the material containing niobia presented higher activity, compared to the pristine material (Fig. S6(a)).The trend for photooxidation was confirmed by comparing the photocatalytic performances of BBN230 and Nb-BBN230.Although BBN230 presented lower photoactivity, the addition of niobium (Nb-BBN230) resulted in a substantial improvement in photoactivity, indicating the important synergic role of Nb 2 O 5 in improving separation of the photogenerated charge carriers 9,12,23.Furthermore, the poor photocatalytic kinetics observed using Nb 2 O 5 also confirmed that the presence of niobia in the BBN/Nb 2 O 5 nanocomposites was essential for improving the photocatalytic activity.Considering that Nb-BBN120 was the most stable photocatalysts (Fig. 8 and S5(b)), three different scavengers were used to elucidate its photocatalytic mechanism.In general, the photocatalytic processes could be described by Eqs. ( 3)- (5). 2 e - CO 2 CO or (4a) The photogenerated e -can be used to reduce CO 2 or to reduce dissolved O 2 , which would lead to other oxidant radicals.These processes can compete, although the ability of a semiconductor to transfer these electrons to O 2 generally provides an indication of its potential to reduce other species.Therefore, KBrO 3 was used as an electron scavenger to suppress any O 2 - formation (Eq. 4b).The remarkable decrease in the RhB decolorization, as seen in Fig. 9(a), indicates that the electron transference is the main mechanism in the production of oxidative radicals.It also indicates that this system is more prone to transfer electrons rather than directly oxidize the compounds.The OH generation was suppressed by TB as direct oxidation by VB holes was suppressed by SO (Eq.5) 33.The smaller reduction of RhB decolorization using TB compared to SO suggests that the system is more efficient to directly oxidize compounds at the surface instead of producing OH.However, the decolorization reduction around 50 indicates that OH radicals are still produced, which was only possible at Nb 2 O 5 VB due to the necessary 2.32 V (vs NHE at pH 7) for its production.Based on these observations and considering the band positions reported in the literature 22,26, the mechanism shown schematically in Fig. 9(b) can be proposed for the Nb-BBN120 nanocomposite as a Z-scheme. Despite of the best photooxidation performance (Fig. S6(a)) provided by Nb-BBN230, after four reuse cycles (Fig. S6(b)) there was a 50 loss of its initial photoactivity.On the other hand, both Nb-BBN120 and pristine P-BBN retained their initial oxidation photoactivities during reuse.As shown in Fig. S7, which depicts the crystallographic pattern after reaction, the crystalline structure of Nb-BBN230 mainly changed to Bi 3 NbO 7 (JCPDS 89-5564), which is a bismuth niobate with the same molar ratio (3Bi:1Nb) used previously to synthesize BBN/Nb 2 O 5 .Peaks related to niobium nitrate (N 0.9 Nb; JCPDS 65-4084) and pristine basic bismuth nitrate (Bi 2 O 2 (OH)(NO 3 )) were also observed.In addition, some peaks related to possible degradation intermediates of RhB adsorbed on the photocatalyst surface were detected.The results showed that the BBN crystalline structure of Nb-BBN230 was not photostable, which affected the photocatalytic activity after a few reuse cycles."
  },
  {
    "title": "Conclusions",
    "content": "We have shown for the first time that BBN/Nb 2 O 5 materials can be used as active catalysts in the preferential photoconversion of CO 2 to CO and C 2 H 4 , with P-BBN being selective for CO production.The Nb-BBN230 material did not present the required band edge position for CO 2 photoreduction, while the use of Nb-BBN120 resulted in a substantial yield for CO and C 2 H 4 production.It was demonstrated that the photoreduction stability was affected by the presence of surface groups.The photooxidation capacities of the samples were also evaluated, since oxidative reactions occurs simultaneously with CO 2 reduction.The results revealed that Nb-BBN120 has a remarkable photoactivity for oxidation, mainly generating superoxide radicals; therefore, Nb-BBN120 acted as an electron donor when photoactivated, which explains its photoreduction capacity.A Z-scheme photocatalytic mechanism is proposed in which molecules are oxidized in the valence band of Nb 2 O 5 and CO 2 is reduced in the conduction band of BBN.In summary, the novel BBN/Nb 2 O 5 nanocomposites obtained in this work provided new insights into the synthesis of promising BBN photocatalysts for use in redox reactions. Fig. 1.(a) XRD of Nb-BBN120 and Nb-BBN230; (b) XRD patterns of Bi 6 O 5 (OH) 3 (NO 3 ) 5 .3H 2 O, Bi 2 O 2 (OH)(NO 3 ), and Bi 6 O 6 (OH) 3 (NO 3 ) 3 .1.5H 2 O, and (c) XRD of BBN230. Fig. 2. Raman spectra of Nb-BBN120 and Nb-BBN230. Fig. 3. (a) TGA/DTG analyses of P-BBN, Nb-BBN120, and Nb-BBN230; (b) DSC analysis of Nb-BBN120. Fig. 4. FTIR spectra of P-BBN, Nb-BBN120, and Nb-BBN230. Fig. 5. XPS Bi 4f high resolution spectra of (a) Nb-BBN120 and (b) Nb-BBN230; XPS Nb 3d high resolution spectra of (c) Nb-BBN120 and (d) Nb-BBN230; XPS O 1s high resolution spectra of (e) Nb-BBN120 and (f) Nb-BBN230. Fig. 6.HRTEM images of (a) Nb-BBN120 and (b) Nb-BBN230; SEM images of (c) Nb-BBN120 and (d) Nb-BBN230 (inset of TEM). Fig. 7. Images of P-BBN obtained using (a) bright field TEM and (b) SEM; (c) SEM images of BBN230. Fig. 8. Formation of (a) CO and (b) C 2 H 4 ; Production rates of (c) CO, and (d) C 2 H 4 in the reuse tests. Fig. 9. (a) Photooxidation performance of Nb-BBN120 nanocomposite, using different scavengers, under UV light for 2 h; (b) Schematic illustration of the Z-scheme in Nb-BBN120. The authors are grateful for the financial support provided by the Ministry of Science, Technology, and Innovation (SisNANO Program, National System of Laboratories in Nanotechnology), FAPESP (grant 2018/01258-5), and Embrapa Rede AgroNano.We thank the Structural Characterization Laboratory (LCE) for technical support.J. A. Oliveira is indebted to the Coordination for Improvement of Higher Education Personnel (CAPES -Finance Code 001) for the provision of a fellowship. The authors report no declarations of interest. Supplementary material related to this article can be found, in the online version, at doi:https://doi.org/10.1016/j.materresbull.2020 .111073."
  }
]