[
  {
    "title": "Doi",
    "content": "10.1016/j.cej.2020.128234"
  },
  {
    "title": "Article_Title",
    "content": "Tuning the turnover frequency and selectivity of photocatalytic CO2 reduction to CO and methane using platinum and palladium nanoparticles on Ti-Beta zeolites"
  },
  {
    "title": "Abstract",
    "content": "Beta zeolite was used in gas phase photocatalytic CO 2 reduction to reduce the charge recombination rate and increase the surface area compared to P25 as commercial benchmark, reaching 607 m 2 g -1 .By adding Pt nanoparticles, the selectivity can be tuned toward CO, reaching a value of 92 and a turnover frequency (TOF) of 96 molg cat -1 h -1 , nearly an order of magnitude higher in comparison with P25.By adding Pd nanoparticles the selectivity can be shifted from CO (70 for a bare Ti-Beta zeolite), toward CH 4 as the prevalent species (60).In this way, the selectivity toward CO or CH 4 can be tuned by either using Pt or Pd.The TOF values obtained in this work outperform reported state-of-the-art values in similar research.The improved activity by adding the nanoparticles was attributed to an improved charge separation efficiency, together with a plasmonic contribution of the metal nanoparticles under the applied experimental conditions."
  },
  {
    "title": "Experimental",
    "content": "The synthesis of the Ti-Beta zeolites with 5 wt Ti and a Si/Al ratio of 25/1 is described in detail in previous work by Hoeven et al. 32 As a reference material, the parent Beta-zeolite, in absence of Ti in the framework, will be subjected to the same measurements.The interested reader is referred to this publication for details about the synthesis procedure and extensive characterization. Pt nanoparticle synthesis: An appropriate amount (depending on the desired loading of Pt on the Ti-Beta zeolite, see Table 1 for the exact amounts) of a 1.28 mM aqueous solution of H 2 PtCl 6 6H 2 O is added to bidistilled water, to make a total volume of 5 mL, under vigorous stirring at room temperature.After a few minutes, 386 L of a 0.075 wt NaBH aqueous solution were added to reduce the Pt-ions to metallic Pt.Stirring is continued for half an hour at room temperature. Pd nanoparticle synthesis: An appropriate amount (depending on the desired loading of Pd on the Ti-Beta zeolite, see Table 1 for the exact amounts) of a 2.35 mM aqueous solution of PdCl 2 is added to 3.85 mL of bi-distilled water under vigorous stirring at room temperature.After a few minutes, 100 L of a 0.0166 wt solution of sodium citrate were added, rapidly followed by the addition of 48 L of a 0.075 wt NaBH aqueous solution.Stirring is continued for half an hour at room temperature. Typically, 250 mg of catalyst was coated on 12 glass support slides (150 mm 10 mm 1 mm) using an adapted dropwise coating technique.First, all 24 sides of the 12 glass slides were cleaned with ethanol, in order to obtain a clean fat-free surface.Simultaneously, 250 mg of photocatalyst was brought into a colloidal suspension in 24 mL water with the required amount of Pt/Pd nanoparticles under vigorous stirring.The suspension was left stirring overnight.Thereafter, 1 mL of the suspension was dripped onto 1 side of each glass slide, until 12 sides were coated.The glass slides were subsequently dried overnight at room temperature.The dripped coating step was repeated for the opposite 12 sides of the glass slides.All coated glass slides were, again, dried overnight to evaporate the water.This way 250 mg of catalyst is coated on both sides of 12 glass slides. A fixed bed photoreactor (total volume of 200 mL) is employed consisting of two parts, namely (i) a tubular reactor (inner part) in which 12 changeable glass slides are mounted in a radial pattern and (ii) a metallic cover (outer part) which contains UVC-lamps (Fig. 1a).The tubular reactor (i) is made of quartz, which is UV-transparent 180 nm.The applied UVC-lamps have a narrow emission spectrum centered at 254 nm, as confirmed by an optical fiber with detector type CC-UV/VIS and a diameter of 3900 m.The inside of the cover contains six Philips TUV 6 W TLmini UVC-lamps with a total power of 36 W. The spectrum of this measurement is shown in supporting info Fig. S1, resulting in an irradiation power of the total light source (36 W) of 9.85 mW/cm 2 . Before each photocatalytic test, the coated glass slides were placed in the quartz tube holder and the whole system, including the GC, were placed under vacuum with an Edwards E2M1.5 pump.Subsequently, the complete system was purged at 200 mL/min with an initial 10 CO 2 , 30 H 2 , 60 He gas mixture for 15 min in order to obtain a homogenous gas mixture in the reactor and the GC.The photocatalysts were irradiated for 100 min, during which the reactor reached a slightly elevated temperature of 348 K, causing a small rise in pressure toward 1.17 atm.Fig. 1b displays the on-line batch system used during the photocatalytic tests.The photoreactor is designed to directly inject gas from the bottom of the quartz tube to the inlet of the GC apparatus, which will sample 100 L of gas every 25 min, otherwise it will bypass the loop.The product yields are expressed as a turnover frequency (TOF) in molh -1 .gcatalyst -1 . To study the stability and reusability of the samples, the best performing samples were subjected to four subsequent cycles in which the TOF was calculated for each cycle. Inductive Coupled Plasma Mass Spectrometry (ICM-MS) was utilized to determine the loading of Pt/Pd nanoparticles of the different samples.The ICP-MS analyses were performed on an ELEMENT2 HR-ICP-MS from Thermo Scientific. Argon sorption at 87 K was used to determine the surface areas and pore volumes of the samples using a Quantachrome AUTOSORB-1-MP automated gas sorption system.The samples were degassed in vacuum at 473 K for 16 h prior to each measurement.The Brunauer-Emmett-Teller (BET) equation was used to obtain the total surface area and the micropore volume was obtained by means of the t-plot method.Detailed information about the porous structure of the Ti-Beta zeolite can be found in our previous publication 32.Furthermore, it is important to note that the porous structure will not be altered by depositing Pt or Pd nanoparticles since they are exclusively located on the outer surface of the zeolite as shown by TEM characterization (vide infra), but some of the pores will be blocked by the nanoparticles. X-ray diffraction (XRD) patterns were recorded to determine possible defects and structural changes due to the post synthesis procedures.A PANalytical X'PERT PRO MPD diffractometer with Cu K radiation was used to perform the measurements in the continuous mode of the theta-2theta-mode with a scanning speed of 0.04 /4s.A graphite monochromator and proportional detector were used.For preparation, a Simonocrystal was used as sample-holder. UV diffuse reflectance spectroscopy (UV-DR) measurements were performed on a UV-VIS Thermo Electron Evolution 500 spectrophotometer, equipped with an integrating sphere (RSA-UC-40 diffuse reflectance cell).The average of three scanning cycles was taken with a scanning speed of 120 nm/min, data interval of 1 nm and a bandwidth of 2 nm.BaSO 4 was used as a reference.The samples were diluted with KBr (2 sample, 98 KBr) and pure KBr was set as the background.All spectra were measured at high ETH-profiles, in order to optimize the signal level of the detector by using the high voltage (ETH) supply to the photomultiplier. Gas analysis during the photocatalytic experiments was performed by a gas chromatograph (Compact GC, Interscience) with pressure-less sampling, equipped with a TCD and FID detector for the detection of CO 2 , CO, H 2 , H 2 O, CH 4 and higher carbonated products. For electron microscopy analysis the samples were crushed and dispersed in ethanol, and then drop-casted onto transmission electron microscopy (TEM) copper grids.A Thermo Fisher Scientific TITAN probe corrected electron microscope in scanning TEM (STEM) mode was employed together with a high-angle annular dark-field (HAADF) detector at 300 kV for obtaining the images of the composites at the nanoscale. XPS measurements were carried out with a Perkin Elmer 5600ci Multi Technique System.The spectrometer was calibrated by assuming the binding energy (BE) of the Au 4f7/2 line to be 84.0 eV with respect to the Fermi level.Both extended spectra (survey -187.85 eV pass energy, 0.5 eVstep -1 , 0.05 sstep -1 ) and detailed spectra (for Ti 2p, Si 2p, Al 2p, Pd 3d, Pt 5f, O 1 s and C 1 s -117.50 eV pass energy, 0.125 eVstep -1 , 0.1 sstep -1 ) were collected with a standard Al K source working at 200 W.The standard deviation in the BE values of the XPS line is 0.10 eV.The atomic percentage, after a Shirley-type background subtraction 55, was evaluated by using the PHI sensitivity factors 56.The peak positions were corrected for the charging effects by considering the O 1 s peak at 532.7 eV and evaluating the BE differences 57,58.The results and discussion of the XPS measurements can be found in supporting info (Fig. S2). Electrochemical impedance spectroscopy (EIS) measurements were carried out as follows: Three-electrode screen printed electrodes (Ital-Sens IS-C) were purchased at PalmSens.The working and counter electrode consist of carbon, the reference electrode consists of silver.The working electrode was first washed with a 7 L drop of an 80 ethanol solution and dried at room temperature.Then, 4.5 mg of the material of interest was mixed with 60 L 5 nafion solution and diluted with 390 L distilled water.5 L of this suspension was drop casted on the working electrode and left for at least 1 h in the dark at room temperature for drying.The measurements were performed in 80 L solution containing 1 mM K 3 Fe(CN) 6 , 1 mM K 4 Fe(CN) 6 and 150 mM NaCl.As a reference, one measurement was done on a bare working electrode and one was done in absence of a sample (only containing nafion). FEM modeling is used to solve the frequency domain form of the Maxwell's equations (Helmholtz wave equations) in three dimensions to solve for the scattered electric field in the presence of a background incident electric field.Therefore, the wave optics module of COMSOL Multiphysics was used.The reader is referred to Asapu et al. 39 and Borah et al. 43 for a detailed description on the underlying equations, employed modeling methodology and mesh quality."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Fig. 2 shows STEM images of two Ti-Beta zeolite samples loaded with 0.1 wt of Pd and Pt respectively.The brightest contrast nanoparticles observed in both cases demonstrate the presence of the noble metal nanoparticles on the composites with average sizes of 4 2 nm in the case of the Pd nanoparticles and 3.9 0.8 nm for the Pt nanoparticles.Histograms of the particle size distributions for both types of particles can be found in the supporting information, Fig. S3.It is important to note that the nanoparticles are larger than the average Ti-Beta pore size (1.2 nm) and are thus exclusively located at the outer surface of the zeolite.Energy dispersive x-ray spectroscopy (EDS) images can be found in Fig. 2e andf. Table 1 shows the results for the ICP-MS and Ar-sorption measurements.As expected, the relative Ti content after addition of the Pt and Pd nanoparticles slightly decreases, but still remains around 5 wt.The Pt and Pd loadings are close to the nominal loadings for all samples.The surface areas and micropore volumes decrease after the addition of Pt and Pd, thus confirming the incorporation of Pt and Pd nanoparticles on the zeolite surface and thus blocking some of the pores.The surface area remains high in the range of 400-600 m 2 g -1 . The diffraction patterns of the pristine and loaded Ti-Beta zeolites show that the original zeolite framework is well preserved upon modification with Pt and/or Pd nanoparticles, as illustrated in Fig. 3 for Pt loaded zeolite Ti-beta.No shift in angles of the diffraction pattern is observed, indicating that the framework of the zeolite is not subjected to contraction or expansion after the nanoparticle modification.Furthermore, a reference peak at 22.5 shows that a minor decrease in crystallinity occurs after the modification step.The loading of the metal nanoparticles is too small to assign any peaks in the diffraction pattern.More information and detailed characterization of these Ti-Beta structures can be found in our previous work by Hoeven et al. 32.XRD patterns for zeolites loaded with Pd and Pt/Pd are provided in Supporting Info Figs S4 andS5. Fig. 4 shows UV-DR measurements for Pt related samples.The UV-DR measurements for the Pt series and the combination of Pt and Pd can be found in supporting info Figs.S6 andS7.The characteristic plasmon absorption bands of Pt and Pd nanoparticles (200-215 nm) are clearly visible in all spectra and slightly increase in intensity as the loading increases.The characteristic absorbance bands of the isolated tetrahedrally coordinated titanium oxide species centered at 224 nm have been retained, which can be assigned to an oxygen -tetrahedral Ti (IV) LMCT.No band centered at 330 nm is present, thus excluding the presence of bulk TiO 2 (anatase, rutile or brookite). Fig. 5 shows the results of the EIS measurements.These data were fitted with a Randles equivalent circuit (with the capacitor being replaced by a constant phase element) and, as can be seen, the R CT varies depending on the modification of the electrode.The deposition of a Nafion thin film leads to only a 5 increase in the R CT and it was used to prevent the material (zeolite or modified zeolite) from desorbing from the electrode surface when exposed to the aqueous solution 59,60.When the Nafion thin film contains zeolite, the R CT decreases from 7228 490 to 4323 282 and the separation between the oxidation and reduction peaks of the couple Fe(CN) 6 3-/4decreases by 40 mV.Such improvement in the electrochemical performance of an electrode surface modified with a zeolite has previously been observed 61 and was correlated with the mobility of electrolyte cations within the zeolite matrix.Upon modifying the zeolite with metals (0.1 wt Pd or 0.1 wt Pt) the R CT decreases and also the voltammetry response is improved (see Fig. S8), as expected given the highly conductive nature of these materials.This shows that an improved charge carrier mobility can be achieved by depositing even a small amount of Pt or Pd.Furthermore, the R CT for samples containing Pt is lower than the one for samples containing Pd. In a first control experiment, the reactor was loaded with 12 blank glass slides, i.e. without any catalyst.A second control experiment was performed with a catalyst-loaded reactor but in the absence of CO 2 in the gas flow.In a third control experiment a zeolite beta catalyst, not containing any Ti, Pd or Pt, was loaded in the reactor in the presence of a CO 2 gas flow.All three control experiments showed no formation of CO, CH 4 or other carbonated products using GC as detection tool, nor any other form of CO 2 conversion.It is important to notice that in all other experiments in this work, only CO and CH 4 could be detected and no other carbonated compounds could be observed in detectable amounts.Prior to each experiment, a dark measurement, with the appropriate photocatalyst loaded in the reactor, was performed as well.The photocatalytic activity of Ti-Beta zeolites with and without Pt is shown in Fig. 6.The Pt Beta sample is a reference sample in which Pt is deposited on a Beta zeolite which contains no Ti in the framework.A first important result is that in the absence of any nanoparticles, a higher TOF h -1 ).The addition of Pt nanoparticles results in higher turnovers toward CO with a decreasing TOF toward CH 4 .Moreover, the higher the Pt loading, the higher the TOF and selectivity toward CO, until the optimum at 0.1 wt Pt loading on Ti-Beta, at which the turnovers toward CO has increased with 223 up to 96 molg cat -1 h -1 as compared to the pristine Ti-Beta zeolite, and exceeding 90 selectivity toward CO (Table 2).At a higher Pt loading of 0.5 wt the TOF toward CO decreases again to 70 molg cat -1 h -1 which can be interpreted by the excessive occupation of active Ti sites and pore blocking by the five-fold higher number of Pt nanoparticles.In the case of CH 4 , the TOF for the 0.5 wt Pt sample is only 45 (8 molg cat -1 h -1 ) of the initial CH 4 TOF of the pristine Ti-Beta zeolite.Fig. 7 shows the results of the Pd modified photocatalysts.In the case of modification with Pd, an initial reduction in TOF is observed.Starting with a TOF for CO of 43 molg cat -1 h -1 in the case of the pristine Ti-Beta zeolite, the addition of a low amount of Pd has a negative effect on the TOF toward CO but a positive effect on the TOF toward CH 4 .By adding 0.01 Pd, the TOF toward CO decreases to only 26 molg cat -1 h -1 , but the TOF toward CH 4 already increased to 20 molg cat -1 h -1 .When the amount of Pd increases, both the TOFs toward CO and CH 4 increase until a turning point is achieved where the TOF toward CH 4 exceeds that toward CO, and thus the overall primary reaction selectivity is reversed.Again, the optimum is reached for a loading of 0.1 wt at which the TOF for CO is 42 molg cat -1 h -1 , and 51 molg cat -1 h -1 for CH 4 .If more Pd nanoparticles are added, the TOFs toward both CO and CH 4 decrease, although the selectivity towards CH 4 still increases.This shows that the addition of Pd has a positive effect on the selectivity toward CH 4 .This can be deduced from Table 2: From 0.1 wt Pd the selectivity toward CH 4 (55) exceeds the selectivity for CO (45) and keeps on increasing by adding more Pd (60 CH 4 vs. 40 CO at a loading of 0.5 wt Pd). The previous experiments illustrate that the selectivity toward either CO or CH 4 can be tuned by going from Pt as co-catalyst toward Pd as cocatalyst.This is validated in a last set of experiments that was performed in this study, in which combinations of Pt and Pd nanoparticles of varying ratios were added to the Ti-Beta zeolite at a total loading of 0.1 wt (Supporting info Figure S9).This experiment clearly confirms the earlier observed trends in selectivity: a high TOF and selectivity toward CO for Pt-rich samples, gradually converging in a high TOF and selectivity toward CH 4 for Pd-rich samples.Unfortunately, the combined Pt/ Pd samples did not result in any synergetic effect to further boost the overall CO 2 turnover. To determine whether the Pt and Pd nanoparticles show an intrinsic photo-activity toward CO 2 reduction, 0.1 wt of Pt or Pd was deposited on an inert Beta zeolite with no Ti incorporated as a control experiment.Studying the results in Figs.7 andS9, the Pt beta and Pd beta samples show much lower yields compared to the photocatalysts containing isolated Ti centers.Furthermore, the sum of the yields of the pristine Ti-Beta zeolite the yields of the Pt beta or Pd beta samples (i.e.Pt or Pd on zeolite without Ti) does not reach the yields of the Pt-or Pd-modified -Ti-Beta zeolites, thus suggesting a synergy between Pt or Pd and the Ti species (taking only into account the CO yield for the Pt species and the CH 4 yields for the Pd species). To compare the photocatalytic CO 2 reduction experiments, a reference experiment with P25 was performed, since P25 is still widely regarded as the reference material of choice in photocatalytic studies.As can be seen in Table 2 (and Fig. S9), P25 has quite a high selectivity toward CO (85 vs. 15 for CH 4 ).However, the selectivity is still significantly higher in the case of the Pt 0.1 wt sample on Ti-Beta zeolite (92 selectivity toward CO).The most prominent difference concerns the TOF.For P25 the TOF toward CO is in the order of molg cat whereas in the case of 0.1 wt Pt on Ti-Beta zeolite the TOF for CO is molg cat h -1 which is an improvement by nearly a factor of compared to P25.This is also an excellent result when compared to existing literature.Zhao et al. 62 investigated the effect of the addition of gold on P25 on the photocatalytic reduction of CO 2 .The highest reported TOF is around 10 molg cat -1 h -1 toward CO which was more or less 8 times higher than for bare P25, under high power Xe illumination (450 W).Zhang et al. 63 used a combination of Au and Pt to enhance the photocatalytic activity under high power 500 W Xe illumination.They achieved a TOF toward CO of 50 molg cat -1 h -1 , which is still two times lower than the highest TOF achieved in this study.A very interesting review is provided by Marszewski et al. 64, in which an overview is provided of multiple studies in photocatalytic CO 2 conversion research.The highest TOF reported herein is taken from the study by Teramura et al. 65 reaching 117 molg cat -1 h -1 (thus close to our highest value) under illumination with a 400 W high-pressure mercury lamp.Even in one of the more recent papers by Zhu et al. 66, our system outperforms their highly efficient Z-scheme heterojunction by a factor of 7 (13 vs. 96 molg cat -1 h -1 ).To conclude the photocatalytic CO 2 reduction experiments, a reusability and stability test was performed in which the best performing samples, i.e. 0.1 wt Pt and 0.1 wt Pd on Ti-Beta zeolite were subjected to four consecutive illumination cycles of 25 min.The results in Fig. 8 show the excellent reusability both for the samples containing Pt and Pd. The addition of metal nanoparticles, like Pt and Pd, to TiO 2 is known to improve the overall photocatalytic activity by lowering the recombination rate of photogenerated charge carriers due to the nanoparticles acting as electron sinks.An important note to be made at this point, is that in said studies the light source is usually limited to UVA in the lower wavelength range.In the present study, however, UVC light is used, which overlaps with a region of strong light extinction by the Pt and Pd nanoparticles themselves.While, generally, Pt and Pd are not known to exhibit a strong plasmonic resonance like Ag or Au, their catalytically active sites present a remarkable advantage in certain reaction systems even when accompanied by a weak plasmonic effect 67.Thus, an actual plasmonic contribution brought about by Pt and Pd nanoparticles could potentially mean a significant efficiency enhancement to the reaction.In plasmon-mediated semiconductor photocatalysis, typically three different mutually non-exclusive major mechanisms are discerned through which energy can be transferred from an excited plasmonic metal to a photocatalyst 68.The first one is the direct injection of hot electrons, generated from non-radiative damping of surface plasmons 69, from the metal nanoparticles to the photocatalyst, the second one is the enhanced electric near-field in the close proximity of the h -1 ).The Ti-Beta sample is the Beta zeolite containing Ti but in the absence of any Pt nanoparticles.Pt Beta is a Beta zeolite in the absence of Ti in the framework but with Pt deposited by the method explained in the experimental section.The other four samples (Pt 0.01, Pt 0.05, Pt 0.1, and Pt 0.5) are Ti-Beta zeolites on which Pt nanoparticles are deposited.nanoparticles that will induce an increased rate of charge carrier formation at the photocatalyst surface, and the last one is the increased optical path length by scattering.The latter can be excluded as a possible contributing mechanism in this work, since this is only important for larger (50 nm) nanoparticles.The near-field enhancement effect requires an overlap of the absorbance of the photocatalyst, the surface plasmon resonance band of the metal nanoparticle, and the emission spectrum of the light source.This criterion is in fact fulfilled for the absorption spectrum of the Ti-Beta zeolite photocatalyst, the UV-DR spectra of both Pt and Pd nanoparticles, and the UVC light emission spectrum (as can be derived from Figs. 4, S6, and S1).The contribution of this near-field enhancement effect, and also the hot carrier generation can be conveniently studied by means of a classical electromagnetic calculation, while keeping in mind that any intrinsic quantum size effect would not alter the qualitative trends required for the analysis 70.The models were built as 3D nanoparticles with a radius of 2 nm both for Pt and Pd.The refractive index data for Pt were taken from Palik 53 and those for Pd from Johnson and Christy 54.The construction of the model was similar to our previous work 39404142.The nanoparticles were meshed with tetrahedral grid elements in COMSOL Multiphysics with a maximum element size of 1 nm.For the rest of the physical domain, a built-in extra fine meshing option was implemented that discretizes the domain with tetrahedral elements with maximum size of 4.5 nm.The adequacy of the mesh resolution and the domain size was ascertained by running simulations after varying these numerical parameters.A plane wave polarized in the Z-direction that propagates in the X-direction was used to solve for the scattered field of Maxwell's wave equations using a wavelength domain (i.e.frequency domain) study.Air was taken as the surrounding medium, although the experiments were performed in a mixture of 60 He, 30 H 2 and 10 CO 2 .This was done because the deviation in refractive index between our mixture and air is only around 0.01.The amplitude of the plane polarized background wave was E 0 1 V/m and the incident wavelength was varied over a range from 200 to 800 nm to calculate the respective cross-sections for scattering (Q sc ), absorbance (Q abs ) and overall extinction (Q ext ). Fig. 9 shows the results of the simulations for a Pt (a) and a Pd (b) particle of 2 nm radius.First of all, it is important to notice that for such a small nanoparticle, scattering is negligible as mentioned above, so Q ext is mainly determined by Q abs .Furthermore, there is a good match between the simulated spectrum and the experimental UV-DR spectra of Pt-Beta and Pd-Beta plotted in Figs. 4 andS6, respectively.The blue curve in Fig. 9 is the irradiance spectrum of the UVC lamps of the photoreactor.It is clear that there is a large overlap between the absorbance wavelength of Pt/Pd with the irradiance spectrum. The FEM modeling was first of all intended to investigate the contribution of the enhanced near-field effect.Therefore, the electric field enhancement was simulated for Pt/Pd particles with a radius of 2 nm at the peak wavelength of the light source, i.e. 254 nm.The results are shown in Fig. 10.A first interesting result is that the near-field enhancement is 26 larger for Pd compared to Pt.The simulations show that a field enhancement by a factor of 10 is obtained in the immediate surroundings of the nanoparticle.Therefore, it is assumed that the near-field enhancement cannot be excluded as contributing mechanism to the overall enhanced photocatalytic activity.Although this effect is significant, it remains multiple orders of magnitude lower when compared to the near-field enhancement brought about by single silver and gold nanoparticles 394041. In the next section, the model is used to elaborate on the contribution of hot carrier generation.Since interband transitions of both Pd and Pt overlap with the wavelength of interest 71, it is expected that the absorption experiences a significant contribution from interband transitions that result in less energetic charge carriers that are unable to cross the metal-semiconductor Schottky barrier.Thus, distinguishing the hot electrons from plasmonic decay from those generated by interband transition is important to determine the real potential plasmonic contribution.Also, in Fig. 9, the characteristic SPR bands are absent due to the fact that the interband transitions overlap over the entire region. As both the SPR position and the intensity are determined by both free electrons and interband transitions, simple separation of these two effects in the dielectric functions and evaluating the optical spectra with respect to each effect is not possible.While the present literature lacks a concrete theoretical formulation, Zheng et al. 72 presents a rather simple formulation to quantify the hot electrons generated by these two pathways, which shows reasonable correspondence with experimental data.The optical absorption is calculated by a total volume integration of the product of the local electric field E 2 , the frequency , and the imaginary part of the dielectric function.It is important to note, however, that carriers generated in the bulk of the nanoparticle have less chance to reach the surface with sufficient energy to overcome the Schottky junction.Therefore, only carriers generated close enough to the surface, i.e. closer than the mean-free path l MFP , can contribute to interfacial electron transfer 73.The total volume integration is shown in Eq. ( 1) and yields the absorption by the nanostructure 72. With V MFP the volume within a distance of l MFP from the active interface. Since this is the integration to cover the total absorption, no distinction is made between the contribution to the absorption by plasmonic hot carrier generation or by interband transitions.For plasmonic enhancement of the photocatalytic activity, only the plasmonic hot carrier generation is useful because these carriers possess sufficient energy to overcome the Schottky barrier between the photocatalyst and the plasmonic metal.It is possible, as shown by Zheng et al. 72, to distinguish between hot carrier generation from plasmonic excitation and interband transitions in the absorption intensity.The imaginary part of the dielectric function describes the inherent material absorption and thus includes the interband transitions as well (Eq.( 1)).Plasmonic hot carrier generation, on the other hand, is directly determined by the local electric field induced by plasmonic excitation.To obtain the contribution solely from hot carrier generation, the electric field intensity should be integrated over the volume V MFP and yields Eq. ( 2) 72. Based on Eqs. ( 1) and (2) using our model, we were able to obtain the relative contribution from hot carrier generation with respect to the total absorption of the plasmonic nanostructure (thus excluding interband transitions).Fig. 11 shows the absorbance spectra for Pt and Pd based on the simulations including Eqs. ( 1) and (2).The solid line represents the total absorption, based on Eq. ( 1), whereas the dotted line represents the absorption excluding the effect of interband transitions based on Eq. ( 2) and thus the only contribution originates from hot carrier generation.It can be deduced from both graphs that at the peak wavelength of the light source, i.e. 254 nm, a contribution of 40 and 45 for Pt and Pd respectively to the total absorption is coming from plasmonic hot carrier generation.So, a significant amount of plasmonic hot carriers are generated that have sufficient energy to overcome the Schottky barrier.Therefore, it should be concluded that this plasmonic effect is also able to contribute to the total enhanced photocatalytic activity. Based on the simulations, both near-field enhancement as well as direct electron injection can have an effect on the plasmon-enhanced photocatalytic efficiency.To accurately determine the relative contribution of both plasmonic effects, more information and advanced highlevel experimentation would be required, that is far beyond the scope of this study.First of all, the HOMO and LUMO energy level positions should be known exactly to be able to determine the Schottky barrier height using the Mott-Schottky rule.In this way, the number of hot carriers with sufficient energy to overcome the Schottky barrier could be calculated more exactly.Furthermore, the direct effect of the near-field enhancement could be studied by selectively repressing other possible mechanisms, as shown in our previous work 39,41. Summarizing, apart from the well-known mechanism of improved charge separation, the modification of the catalyst surface by Pt or Pd nanoparticles under the present experimental conditions also benefits from an additional plasmonic contribution that is brought about by both injection of hot plasmonic charge carriers, as well as an enhanced nearelectric field that boosts electron-hole pair generation."
  },
  {
    "title": "Conclusions",
    "content": "To conclude, we have shown that by adding low amounts of either Pt or Pd (0.1-0.5 wt) to a Ti-Beta zeolite, the selectivity of photocatalytic CO 2 reduction can be tuned toward CO or CH 4 .The addition of Pt leads to a high selectivity toward CO, exceeding 90.By adding Pd nanoparticles, the selectivity can be reversed to over 60 selectivity toward CH 4 .Furthermore, a TOF was obtained that surpasses the performance of the benchmark P25 photocatalyst by nearly an entire order of magnitude.Moreover, the achieved TOFs toward both CO and CH 4 (96 molg cat -1 h -1 and 50 molg cat -1 h -1 , respectively) are significantly higher than values reported in literature.As a last part in this study, FEM modeling was performed to gain more insight in the mechanisms contributing to the enhanced photocatalytic activity upon addition of Pt and Pd nanoparticles.It can be concluded that two plasmonic effects, i.e. the enhanced near-electric field, and hot carrier generation for direct charge injection from an excited plasmonic nanoparticle to the isolated Ti (IV) species, co-exist and may both contribute to the overall enhanced activity.Apart from both plasmonic effects, a reduced recombination rate by enhanced charge separation from the isolated Ti (IV) species to the metal nanoparticle, can also contribute to the overall enhanced photocatalytic efficiency. To the best of our knowledge, this is the first account on (plasmonic) metal-modified Ti-Beta zeolites as photocatalysts for highly active and selective CO 2 conversion.Although our modeling study already provides more insight in the various phenomena at play, more advanced experimental techniques are required to accurately disentangle the different contributing factors in a more quantitative way.We therefore look forward to new contributions from the community to further deepen the understanding of this highly promising class of materials. Fig. 1. a) Pictures of the photocatalytic reactor used in this work.The left picture shows the inside of the reactor without the UV lights on, the middle one shows the inside with UV lights on and the right one shows a closed reactor with UV lights on as it is under operation.b) Scheme of the experimental setup used for the photocatalytic CO 2 reduction experiments. Fig. 2. STEM images of samples with (a, c) 0.1 wt Pd and (b, d) 0.1 wt Pt nanoparticles deposited on the Ti-Beta zeolite.(c, d) Higher magnification images of both samples where the largest size of the metal nanoparticle versus the zeolite pore size can be observed.HAADF image and EDS analysis of Pt (e) and Pd (f) nanoparticles deposited on the Ti-Beta zeolite. Fig. 3. XRD patterns of 5 wt Ti-Beta (n Si /n Al 25) with different weight loadings of Pt.The upper pattern is for a Pt loading of 0.1 wt on a Beta-zeolite without Ti. Fig. 5. a) Representative Nyquist plot with the various modifications of the electrode.The measurements were performed between 100 kHz and 0.1 Hz in a solution containing 1 mM K 3 Fe(CN) 6 , 1 mM K 4 Fe(CN) 6 and 150 mM NaCl.The potential applied was the OCP measured at the bare electrode (0.13 V vs. internal reference).b) R CT and peak separation (E) as a function of the electrode modification. Fig. 6.Effect of the Pt loading of the photocatalysts on the product TOF (molg cat -1 Fig. 7. Effect of the Pd loading of the photocatalysts on the product TOF (molg cat -1 h -1 ).The Ti-Beta sample is the Beta zeolite containing Ti but in the absence of any nanoparticles.Pd Beta is a Beta zeolite in the absence of Ti in the framework but with Pd deposited by the method explained in the experimental section.The other four samples (Pd 0.01, Pd 0.05, Pd 0.1, and Pd 0.5) are Ti-Beta zeolites on which Pd nanoparticles are deposited. Fig. 8. Reusability and stability test of CO 2 reduction on 0.1 wt Pt (left) and 0.1 wt Pd (right) samples.Each cycle involves an illumination time of 25 min. Fig. 10.Electric field maps (E/E 0 ) 2 at 254 nm for a) Pt nanoparticle with a radius of 2 nm, b) Pd nanoparticle with a radius of 2 nm.The electric field enhancement in the direction of polarization (Z-direction) is plotted below the corresponding field map. Fig. 11.Contribution of hot carrier generation, thus excluding interband transitions (dotted line) to the total absorption (solid line) for Pt (left) and Pd (right) nanoparticles based on FEM modeling using Eqs.(1) and (2). Physicochemical properties of the Pd/Pt-Ti-Beta zeolite photocatalysts. Selectivity () toward CH 4 and CO. N.B., S.L., S.W.V. and P.C. wish to thank the Flemish government and Catalisti for financial support and coordination in terms of a sprint SBO in the context of the moonshot project D2M.N.H. thanks the Flanders Innovation and Entrepreneurship (VLAIO) for the financial support.The Systemic Physiological and Ecotoxicological Research (SPHERE) group, R. Blust, University of Antwerp is acknowledged for the ICP-MS measurements. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://doi. org/10.1016/j.cej.2020.128234."
  },
  {
    "title": "Supporting_Information",
    "content": "The addition of metal nanoparticles, like Pt and Pd, to TiO 2 is known to improve the overall photocatalytic activity by lowering the recombination rate of photogenerated charge carriers due to the nanoparticles acting as electron sinks.An important note to be made at this point, is that in said studies the light source is usually limited to UVA in the lower wavelength range.In the present study, however, UVC light is used, which overlaps with a region of strong light extinction by the Pt and Pd nanoparticles themselves.While, generally, Pt and Pd are not known to exhibit a strong plasmonic resonance like Ag or Au, their catalytically active sites present a remarkable advantage in certain reaction systems even when accompanied by a weak plasmonic effect 67.Thus, an actual plasmonic contribution brought about by Pt and Pd nanoparticles could potentially mean a significant efficiency enhancement to the reaction.In plasmon-mediated semiconductor photocatalysis, typically three different mutually non-exclusive major mechanisms are discerned through which energy can be transferred from an excited plasmonic metal to a photocatalyst 68.The first one is the direct injection of hot electrons, generated from non-radiative damping of surface plasmons 69, from the metal nanoparticles to the photocatalyst, the second one is the enhanced electric near-field in the close proximity of the h -1 ).The Ti-Beta sample is the Beta zeolite containing Ti but in the absence of any Pt nanoparticles.Pt Beta is a Beta zeolite in the absence of Ti in the framework but with Pt deposited by the method explained in the experimental section.The other four samples (Pt 0.01, Pt 0.05, Pt 0.1, and Pt 0.5) are Ti-Beta zeolites on which Pt nanoparticles are deposited.nanoparticles that will induce an increased rate of charge carrier formation at the photocatalyst surface, and the last one is the increased optical path length by scattering.The latter can be excluded as a possible contributing mechanism in this work, since this is only important for larger (50 nm) nanoparticles.The near-field enhancement effect requires an overlap of the absorbance of the photocatalyst, the surface plasmon resonance band of the metal nanoparticle, and the emission spectrum of the light source.This criterion is in fact fulfilled for the absorption spectrum of the Ti-Beta zeolite photocatalyst, the UV-DR spectra of both Pt and Pd nanoparticles, and the UVC light emission spectrum (as can be derived from Figs. 4, S6, and S1).The contribution of this near-field enhancement effect, and also the hot carrier generation can be conveniently studied by means of a classical electromagnetic calculation, while keeping in mind that any intrinsic quantum size effect would not alter the qualitative trends required for the analysis 70.The models were built as 3D nanoparticles with a radius of 2 nm both for Pt and Pd.The refractive index data for Pt were taken from Palik 53 and those for Pd from Johnson and Christy 54.The construction of the model was similar to our previous work 39404142.The nanoparticles were meshed with tetrahedral grid elements in COMSOL Multiphysics with a maximum element size of 1 nm.For the rest of the physical domain, a built-in extra fine meshing option was implemented that discretizes the domain with tetrahedral elements with maximum size of 4.5 nm.The adequacy of the mesh resolution and the domain size was ascertained by running simulations after varying these numerical parameters.A plane wave polarized in the Z-direction that propagates in the X-direction was used to solve for the scattered field of Maxwell's wave equations using a wavelength domain (i.e.frequency domain) study.Air was taken as the surrounding medium, although the experiments were performed in a mixture of 60 He, 30 H 2 and 10 CO 2 .This was done because the deviation in refractive index between our mixture and air is only around 0.01.The amplitude of the plane polarized background wave was E 0 1 V/m and the incident wavelength was varied over a range from 200 to 800 nm to calculate the respective cross-sections for scattering (Q sc ), absorbance (Q abs ) and overall extinction (Q ext ). Fig. 9 shows the results of the simulations for a Pt (a) and a Pd (b) particle of 2 nm radius.First of all, it is important to notice that for such a small nanoparticle, scattering is negligible as mentioned above, so Q ext is mainly determined by Q abs .Furthermore, there is a good match between the simulated spectrum and the experimental UV-DR spectra of Pt-Beta and Pd-Beta plotted in Figs. 4 andS6, respectively.The blue curve in Fig. 9 is the irradiance spectrum of the UVC lamps of the photoreactor.It is clear that there is a large overlap between the absorbance wavelength of Pt/Pd with the irradiance spectrum. The FEM modeling was first of all intended to investigate the contribution of the enhanced near-field effect.Therefore, the electric field enhancement was simulated for Pt/Pd particles with a radius of 2 nm at the peak wavelength of the light source, i.e. 254 nm.The results are shown in Fig. 10.A first interesting result is that the near-field enhancement is 26 larger for Pd compared to Pt.The simulations show that a field enhancement by a factor of 10 is obtained in the immediate surroundings of the nanoparticle.Therefore, it is assumed that the near-field enhancement cannot be excluded as contributing mechanism to the overall enhanced photocatalytic activity.Although this effect is significant, it remains multiple orders of magnitude lower when compared to the near-field enhancement brought about by single silver and gold nanoparticles 394041. In the next section, the model is used to elaborate on the contribution of hot carrier generation.Since interband transitions of both Pd and Pt overlap with the wavelength of interest 71, it is expected that the absorption experiences a significant contribution from interband transitions that result in less energetic charge carriers that are unable to cross the metal-semiconductor Schottky barrier.Thus, distinguishing the hot electrons from plasmonic decay from those generated by interband transition is important to determine the real potential plasmonic contribution.Also, in Fig. 9, the characteristic SPR bands are absent due to the fact that the interband transitions overlap over the entire region. As both the SPR position and the intensity are determined by both free electrons and interband transitions, simple separation of these two effects in the dielectric functions and evaluating the optical spectra with respect to each effect is not possible.While the present literature lacks a concrete theoretical formulation, Zheng et al. 72 presents a rather simple formulation to quantify the hot electrons generated by these two pathways, which shows reasonable correspondence with experimental data.The optical absorption is calculated by a total volume integration of the product of the local electric field E 2 , the frequency , and the imaginary part of the dielectric function.It is important to note, however, that carriers generated in the bulk of the nanoparticle have less chance to reach the surface with sufficient energy to overcome the Schottky junction.Therefore, only carriers generated close enough to the surface, i.e. closer than the mean-free path l MFP , can contribute to interfacial electron transfer 73.The total volume integration is shown in Eq. ( 1) and yields the absorption by the nanostructure 72. With V MFP the volume within a distance of l MFP from the active interface. Since this is the integration to cover the total absorption, no distinction is made between the contribution to the absorption by plasmonic hot carrier generation or by interband transitions.For plasmonic enhancement of the photocatalytic activity, only the plasmonic hot carrier generation is useful because these carriers possess sufficient energy to overcome the Schottky barrier between the photocatalyst and the plasmonic metal.It is possible, as shown by Zheng et al. 72, to distinguish between hot carrier generation from plasmonic excitation and interband transitions in the absorption intensity.The imaginary part of the dielectric function describes the inherent material absorption and thus includes the interband transitions as well (Eq.( 1)).Plasmonic hot carrier generation, on the other hand, is directly determined by the local electric field induced by plasmonic excitation.To obtain the contribution solely from hot carrier generation, the electric field intensity should be integrated over the volume V MFP and yields Eq. ( 2) 72. Based on Eqs. ( 1) and (2) using our model, we were able to obtain the relative contribution from hot carrier generation with respect to the total absorption of the plasmonic nanostructure (thus excluding interband transitions).Fig. 11 shows the absorbance spectra for Pt and Pd based on the simulations including Eqs. ( 1) and (2).The solid line represents the total absorption, based on Eq. ( 1), whereas the dotted line represents the absorption excluding the effect of interband transitions based on Eq. ( 2) and thus the only contribution originates from hot carrier generation.It can be deduced from both graphs that at the peak wavelength of the light source, i.e. 254 nm, a contribution of 40 and 45 for Pt and Pd respectively to the total absorption is coming from plasmonic hot carrier generation.So, a significant amount of plasmonic hot carriers are generated that have sufficient energy to overcome the Schottky barrier.Therefore, it should be concluded that this plasmonic effect is also able to contribute to the total enhanced photocatalytic activity. Based on the simulations, both near-field enhancement as well as direct electron injection can have an effect on the plasmon-enhanced photocatalytic efficiency.To accurately determine the relative contribution of both plasmonic effects, more information and advanced highlevel experimentation would be required, that is far beyond the scope of this study.First of all, the HOMO and LUMO energy level positions should be known exactly to be able to determine the Schottky barrier height using the Mott-Schottky rule.In this way, the number of hot carriers with sufficient energy to overcome the Schottky barrier could be calculated more exactly.Furthermore, the direct effect of the near-field enhancement could be studied by selectively repressing other possible mechanisms, as shown in our previous work 39,41. Summarizing, apart from the well-known mechanism of improved charge separation, the modification of the catalyst surface by Pt or Pd nanoparticles under the present experimental conditions also benefits from an additional plasmonic contribution that is brought about by both injection of hot plasmonic charge carriers, as well as an enhanced nearelectric field that boosts electron-hole pair generation."
  }
]