[
  {
    "title": "Doi",
    "content": "10.1016/j.mcat.2017.06.031"
  },
  {
    "title": "Article_Title",
    "content": "Noble metal modified TiO2: selective photoreduction of CO2 to hydrocarbons"
  },
  {
    "title": "Abstract",
    "content": "CO 2 photoreduction is an indispensable tool to generate carbon containing fuel.A series of noble metal modified TiO 2 were prepared using photodeposition method, and their photocatalytic activities were evaluated towards photocatalytic reduction of CO 2 under gas phase conditions using water vapor as electron donor and UV-A light as energy source.TiO 2 solely produce CO.The addition of noble metals to TiO 2 via photodeposition method significantly increased the photocatalytic reduction of CO 2 with change in product selectivity towards methane under identical conditions.Further combinations of two different noble metals were simultaneously deposited to develop bimetal/TiO 2 .The bimetal/TiO 2 further enhances the methane yield with considerable amount of ethane.Ag 1 Pd 1 /TiO 2 has been proven as best catalyst among all catalyst and yields maximum methane."
  },
  {
    "title": "Experimental",
    "content": "Titanium dioxide (commercial anatase phase, Merck, 99), palladium chloride (Sigma, 99.99), dihydrogen platinum chloride or chloroplatinic acid (Alfa Aesar, 99.9), silver nitrate (Merck, 99.5), gold chloride (Alfa Aesar, 99.99), Methanol (Vetec, 99.5),All material were used as purchased without further purification.HPLC grade water was used for all synthesis. Noble metal modified TiO 2 were prepared using photodeposition method.In a typical procedure, required metal precursor was dissolved in 100 mL water having 1 mL methanol as sacrificial hole scavenger with TiO 2 .Obtained noble metal/TiO 2 suspension was irradiated under UV-C lamp (8W, Pen ray, UVP, 254 nm) for 3 h.Then material was collected using centrifuge and washed with water thrice and dried in oven at 80 C for 6 h.The bimetal loaded TiO 2 was prepared by simultaneously photodeposition of noble metals to form the Ag-Pd, Au-Pd and Pt-Pd on TiO 2 (Scheme 1) As prepared noble metal loaded TiO 2 were characterized by using XRD, UV-vis diffuse reflectance, SEM, TEM, XPS.X-ray diffraction (XRD) patterns obtained on Bruker D8 advance X-ray diffractometer using Cu K irradiation (0.154 nm) at a scan rate of 0.2 s -1 were used to analyze the phase structures of the samples studied.The morphology of materials was investigated using FEI Quanta 200F scanning electron microscope (SEM).Energy dispersive Spectroscopic analyzer equipped with SEM was also used for elemental composition.Transmission electron microscopy (TEM) and HRTEM analyses were conducted on a JEOL model JAM-2100 instrument.The accelerating voltage was 200 kV, resolution was 1.4 A.The UV-vis diffuse reflectance spectra (DRS) were obtained on a Shimadzu 2600 UV-vis spectrophotometer over the wavelength range of 200-800 nm using BaSO 4 as an internal standard.X-ray Photoelectron spectroscopy (XPS) analyses were performed on model S/N-10001 (Prevac Poland) with a VG Scienta-R3000 hemispherical energy analyzer. The modified catalysts were subjected to photoreduction of CO 2 in a home-made pyrex reactor.It has cylindrical glass vessel with an effective volume of 270 mL, and provided with a quartz tube at the center of reactor for UV irradiation.The powdered catalyst (250 mg) was dispersed over bottom of glass vessel.CO 2 was bubbled through water bubbler to make it water saturated and passed through gas phase photoreactor.Outline of reactor is directly connected to gas chromatogram.The system was purged with CO 2 for an hour prior to illumination to remove other gases from reactor.After that flow rate was maintained at 8 mL min -1 using mass flow controller.UV illumination was done using Lumen dynamics 200 W Hg lamp with wavelength at 320-390 nm and average intensity of 9.0 W/cm 2 .The reaction was carried out at room temperature and pressure for period of 0-6 h.Continuous gas chromatography was used to analyze the samples.GC was equipped with TCD (Shincarbon Column) and FID (HP Plot Q Column).Three blank experiments in absence of catalyst, CO 2 and light were also carried out to ensure the products were due to synergistic effect of catalyst, CO 2 and illumination. Catalysts were prepared by photodeposition method under UV-C irradiation.Developed materials were well characterized with several techniques as XRD, UV-vis, SEM-EDX, TEM, HR-TEM, and XPS. The phase purity and crystallographic structure of prepared catalysts were identified by XRD patterns, As shown in Fig. 1a and and can be indexed for metallic Au 33.Ag/TiO 2 has a diffused peak around 38 , which can be attributes as metallic Ag (111).While peaks for Pd and Pt are not visible in XRD pattern may be because of the smaller particle size of them.In bimetal (Ag-Pd, Au-Pd and Pt-Pd) loaded TiO 2 the single metal loading amount was reduced by 50 therefore metal specific peak were not observed in XRD. The UV-vis diffuse reflectance spectra of samples were measured to explain the optical properties of material and shown in Fig. 2. Noble metals loaded TiO 2 were of grey colour, therefore they have optical absorption in visible region in spite of the fact that they have lambda-max in UV region because of TiO 2 .In Fig. 2(i) a maxima below 400 nm obtained due to transfer of electrons from valence band to conduction band of TiO 2 with a shoulder band around 410-500 nm for Ag (red line) and 510-570 nm for Au Nps (blue line) while in case of Pt and Pd loaded TiO 2 there was no hump in visible region.Metallic Ag and Au shows surface plasmon resonance (SPR) due to collective oscillation of free electrons present in conduction band, therefore they shows absorption around 400-500 for Ag and 530-570 nm for Au metals 34,35.Pt and Pd metals does not show plasmon bands due to damping effect of d-d transition, which tends to wash out free electronic contribution to dielectric function 36.Loading of bimetals over TiO 2 shows red shift with higher absorption intensity in visible region in comparison to Pd 2 loaded TiO 2 (Fig. 2(ii)). Morphological study of samples was executed by SEM and TEM.Fig. 3 shows SEM images with polygonal crystal ranging from 50 to 100 nm which are assigned to TiO 2 nanoparticles.The metal nanoparticles are not discernible in the SEM images but presence of metals has been confirmed by EDX equipped with SEM and element mapping with homogenous metal dispersion on TiO 2 surface.has 2 nm size (Fig. 4(ii)a), Pt 1 Pd 1 /TiO 2 has around 3 nm size (Fig. 4(ii)c), and Ag 1 Pd 1 /TiO 2 has around 10 nm size (Fig. 4(ii)b).The presence of lattice fringes reveals the material is crystalline in nature which is in well agreement with XRD. XPS analyses were carried out to understand the surface chemical state of Ti, O, and Noble metals in the prepared series of catalysts which is the key factor in the improved photocatalytic activity.Fig. 5 show the XPS spectra of Pt, Pd, Ag, Au, in bimetal/TiO 2 .The presence of Pt and Pd on the surface of TiO 2 can be confirmed by high resolution XPS.The Pt 4f7/2 and Pt 4f5/2 of precursor H 2 PtCl 6 peaks has been reported at 74.8 and 78.5 eV respectively 37 But after photodeposition, the Pt 4f7/2 and Pt 4f5/2 peaks had shifted to 71.6 eV and 74.2 eV respectively, demonstrating the reduction of Pt(IV) to Pt(0) 38.While the binding energy peaks shown at 342 and 336.6 eV for Pt 1 Pd 1 /TiO 2 and Au 1 Pd 1 /TiO 2 has originated from Pd 2 (Pd 3d3/2 3d5/2) and also indicate that the oxide species are formed on the surface of Pd.The Pt 1 Pd 1 /TiO 2 also has one peak at 334 eV, which is originated from Pd 0 (Pd 3d5/2) 39.The catalyst Ag 1 Pd 1 /TiO 2 has binding energy peaks at 341.6, 337.6 (broad peak) and 333.2.The binding energy peak originated at 341.6, and The gas phase CO 2 photoreduction was investigated to test the activity of the prepared series of catalysts in the presence of H 2 O vapor and UV-A irradiation at ambient conditions and the results are shown in Fig. 6.The commercial anatase TiO 2 used in the catalyst synthesis has selectivity towards CO formation.The results clearly indicate that the photocatalytic performance of TiO 2 can be improved by impregnating noble metals and further significant improvement was observed when combination of two metals were loaded simultaneously.The deposition of noble metal nanoparticles onto TiO 2 results in superior hydrocarbon formation is mainly attributed to the improved charge separation and better multi- electron transfer processes.The efficiency of noble metal over TiO 2 with respect to methane follows the order Pd Pt Ag Au.While Pt has highest work function among all metals still Pt provides less photocatalytic activity than Pd 2 /TiO 2 perhaps due to bigger particles or agglomeration as shown in TEM Fig. 4(i)d). The flow rate was varied to get optimum condition for CO 2 photoreduction.As shown in Fig. 6a) when flow rate is increased from 4 mLmin -1 to 8 mLmin -1 then methane production was increased from 356.4 nmoles g -1 h -1 to 801.9 nmoles g -1 h -1 while further increase in flow rate to 15 mL min -1 average methane production yield was decreased up to 772.7 nmoles g -1 h -1 over Pd 2 /TiO 2 .In comparison to Pd 1 /TiO 2 (363.5 nmoles g -1 h -1 of methane) Pd 2 /TiO 2 produces 801.9 nmoles g -1 h -1 of methane with optimum flow 8mLmin -1 (Fig. 6b).It is clear, that the optimum loading amount is required to enhance the photocatalytic reaction via suppressing the recombination by trapping of large number of electrons 43.Therefore, further 2 loading was optimized for other noble metal loading over TiO 2 for CO 2 reduction. Fig. 6c shows comparative study for CO 2 photoreduction with optimum 8mLmin -1 flow rate at different M 2 /TiO 2 where M stands for Ag, Au, Pd and Pt.On changing metal electrodes prod-uct distribution and reduction efficiencies can be altered, it is further confirmed by loading of different noble metals 44.The obtained results clearly demonstrate that Ag and Au helps to produce CO and methane while Pd and Pt selectively produces methane with higher yield.TiO 2 solely produces 67.31 nmoles g -1 h -1 of carbon monoxide, while loading of noble metal improves the catalytic activity and Ag 2 /TiO 2 provides 667.439 nmoles g -1 h -1 of CO and 395.53 nmoles g -1 h -1 of methane.Au 2 /TiO 2 gives 1153.171nmoles g -1 h -1 CO and 131.205 nmoles g -1 h -1 methane.Pt 2 /TiO 2 produces 412.371 nmoles g -1 h -1 methane while Pd 2 /TiO 2 selectively provides maximum amount of methane i.e. 801.90 nmoles g -1 h -1 .Au metal has medium hydrogen evolution overpotential and weak CO adsorption strength, so CO is major product over Au 45. Further the effect of combination of two noble metals loaded simultaneously on TiO 2 was studied while keeping Pd as constant metal as it provides best result with respect to methane.An improvement in terms of product yield and selectivity was also observed.The combination with gold in Au 1 Pd 1 /TiO 2 helped to get 1284 nmoles g -1 h -1 methane while with platinum in Pt 1 Pd 1 /TiO 2 yielded 1436 nmoles g -1 h -1 of methane.The combi- nation with silver Ag 1 Pd 1 /TiO 2 produced maximum 1787 nmoles g -1 h -1 of methane and along with 212 nmoles g -1 h -1 of ethane.Among all catalyst Ag 1 Pd 1 /TiO 2 proven as best catalyst as it provides better photocatalytic activity and produces maximum hydrocarbon.It is also reported that the silver and palladium forms stable alloy and highly active catalysts in terms of electrocatalytic properties with better charge mobility 46.The adsorption of reactants on the surface of photocatalyst is an integrated part of photocatalytic reduction of CO 2 with water and it has always been affected with temperature.The effect of temperature was monitored at three different temperatures i.e. 4 , 25 and 50 C. At 4 C around 611 nmoles g -1 h -1 of methane and 120 nmoles g -1 h -1 of ethane were obtained while at 25 C 1787 nmoles g -1 h -1 of methane and 212 nmoles g -1 h -1 of ethane was obtained in Fig. 7.But on further increase in reaction temperature leads to decrease in methane formation to 1391 nmoles g -1 h -1 and 246 nmoles g -1 h -1 of ethane.Hence 25 C is the necessary temperature for the photocatalytic reduction of CO 2 with our catalytic system. The photocatalytic reduction of CO 2 with water over noble metal/TiO 2 catalysts is outlined in Fig. 8 and Scheme 2 on the basis of above experiments.The noble metal nanoparticles are well dispersed at the surface of TiO 2 (Fig. 4(i) and (ii)) and Pt nanoparticles are found agglomerated as flower shape on TiO 2 nanoparticles in Fig. 4(i)d).Noble metal loading on TiO 2 plays important roles in photocatalytic reduction of CO 2 47.Noble metals are good conductors and participate in phototelectron transfer to the adsorbed CO 2 at the surface of catalyst 48.Therefore their presence at the surface of TiO 2 enhances the charge separation and retards the recombination due to the formation of Schottky barriers, due to lower fermi level of metals than TiO 2 which extends life span of electron hole pair to enhance the photocatalytic activity 49. The noble metal loading onto TiO 2 causes the red shift in UV-vis spectra and responsible for the enhanced activity at low energy irradiation as shown in Fig. 3.Here the photocatalytic reaction follows the carbene mechanism.The formation of methane requires multiple electron proton reaction which is hard to be happed at bare TiO 2 .The bare TiO 2 gives CO formation by following 2electron, 2proton system, the metal impregnation on to photocatalyst shifts the product selectivity and enhances the yield or total amount of photoelectrons available for the reaction on photocatalytic reduc-tion of CO 2 50515253.Single noble metal loading shifts the selectivity towards methane formation with 8electron 8proton system.Here the initially formed CO further undergo photocatalytic reduction to form carbine and followed by methyl radical formation and finally methane formation at the surface of noble metal nanoparticle.While the presence of two noble metals especially with Ag 1 Pd 1 /TiO 2 helps two methyl radicals associates to form ethane. Based on catalyst characterization and photocatalytic evaluation, the increased amount of CO and methane is due to formation of Schottky barriers, as well as due to lower fermi level of metals than TiO 2 which suppress the recombination of electron hole pair to enhance the photocatalytic activity. We have demonstrated a simple, efficient and easily accessible semiconductor i.e. noble metal (Ag, Au, Pd, Pt) loaded TiO 2 photocatalyst for photoreduction of CO 2 using water under UV-A light.Two types of loading was prepared by photodeposition method i.e. monometallic and bimetallic on TiO 2 .Only carbon monoxide was obtained as product over bare TiO 2 .The better photocatalytic activity of single noble metal loaded TiO 2 is ascribed to the effect of easy electron transfer and retardation of electron-hole pair recombination and transfer to CO 2 and helps in methane formation.Furthermore, the loading of two noble metals on TiO 2 significantly improves the methane formation and Ag 1 Pd 1 /TiO 2 shifts the product selectivity towards high calorific value containing fuel i.e. ethane.Ag 1 Pd 1 /TiO 2 gives best results with 1787 nmoles g -1 h -1 of methane and along with 212 nmoles g -1 h -1 of ethane formation on photocatalytic reduction of CO 2 with water. Scheme 1. Strategy to synthesize of MTiO2 by Photodeposition. Fig. 1.XRD Pattern of a) noble metal/TiO2 b) bimetal/TiO2. Fig.2.UV-vis Spectra of (i) noble metal/TiO2 (ii) bimetal/TiO2. Fig. 3. (i) SEM, EDX and Element mapping of a-a\") Pd2/TiO2 b-b\") Pt2/TiO2 c-c\") Ag2/TiO2 d-d\") Au2/TiO2 (ii) SEM, EDX and Element mapping of a-a') Ag1Pd1/TiO2 b-b') Au1Pd 1/ TiO2 c-c') Pt1Pd1/TiO2. Fig. 4. (i) HR-TEM images of a) Pd2/TiO2 b) Au2/TiO2 c) Ag2/TiO2 d) Pt2/TiO2 (ii) HR-TEM images a) Au1Pd1/TiO2 b) Ag1Pd1/TiO2 c) Pt1Pd1/TiO2. has originated from Pd 2 (Pd 3d3/2 3d5/2) while the peak at 333.2 belongs to Pd 0 (Pd 3d5/2).The results indicate that the Pd is present in both metallic and oxide form.The peaks are present at 341.6, 337.6 and 333.2 eV for Pd (Ag 1 Pd 1 /TiO 2 ) and peaks are at 373.4 Ag 0 (3d3/2) 40, 369.5 Ag 0 3d5/2(Ag-Pd alloy)41 367.08 AgO (Ag 3d5/2) 42. Fig. 5. XPS Spectra of a) Pt1Pd1/TiO2 b) Au1Pd1/TiO2 c) Ag1Pd1/TiO2. Fig. 6.CO2 photoreduction under UV-A irradiation in continuous gas reactor a) over Pd2/TiO2 with different flow rate b) at different loading of Pd; Pd1/TiO2 and Pd2/TiO2 c) Comparative study over Ag, Au, Pd, Pt photo-deposited TiO2 d) over bimetal/TiO2 Pd was chosen as constant metal. Fig. 7. Effect of temperature on Ag1Pd1/TiO2 for CO2 reduction under UV-A irradiation. Fig. 8. Schematic diagram of photocatalytic reduction of CO2 with water over Noble metal/TiO2 under UV-A irradiation. Authors are grateful to Director, CSIR-IIP for his kind permission to publish the results.N.S. thanks CSIR for research funding (Grant Serial 1121110360, Ref 18-12/2011(ii)EU-V).Authors are thankful to ASD, CSIR-IIP for their analytical support."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Catalysts were prepared by photodeposition method under UV-C irradiation.Developed materials were well characterized with several techniques as XRD, UV-vis, SEM-EDX, TEM, HR-TEM, and XPS. The phase purity and crystallographic structure of prepared catalysts were identified by XRD patterns, As shown in Fig. 1a and and can be indexed for metallic Au 33.Ag/TiO 2 has a diffused peak around 38 , which can be attributes as metallic Ag (111).While peaks for Pd and Pt are not visible in XRD pattern may be because of the smaller particle size of them.In bimetal (Ag-Pd, Au-Pd and Pt-Pd) loaded TiO 2 the single metal loading amount was reduced by 50 therefore metal specific peak were not observed in XRD. The UV-vis diffuse reflectance spectra of samples were measured to explain the optical properties of material and shown in Fig. 2. Noble metals loaded TiO 2 were of grey colour, therefore they have optical absorption in visible region in spite of the fact that they have lambda-max in UV region because of TiO 2 .In Fig. 2(i) a maxima below 400 nm obtained due to transfer of electrons from valence band to conduction band of TiO 2 with a shoulder band around 410-500 nm for Ag (red line) and 510-570 nm for Au Nps (blue line) while in case of Pt and Pd loaded TiO 2 there was no hump in visible region.Metallic Ag and Au shows surface plasmon resonance (SPR) due to collective oscillation of free electrons present in conduction band, therefore they shows absorption around 400-500 for Ag and 530-570 nm for Au metals 34,35.Pt and Pd metals does not show plasmon bands due to damping effect of d-d transition, which tends to wash out free electronic contribution to dielectric function 36.Loading of bimetals over TiO 2 shows red shift with higher absorption intensity in visible region in comparison to Pd 2 loaded TiO 2 (Fig. 2(ii)). Morphological study of samples was executed by SEM and TEM.Fig. 3 shows SEM images with polygonal crystal ranging from 50 to 100 nm which are assigned to TiO 2 nanoparticles.The metal nanoparticles are not discernible in the SEM images but presence of metals has been confirmed by EDX equipped with SEM and element mapping with homogenous metal dispersion on TiO 2 surface.has 2 nm size (Fig. 4(ii)a), Pt 1 Pd 1 /TiO 2 has around 3 nm size (Fig. 4(ii)c), and Ag 1 Pd 1 /TiO 2 has around 10 nm size (Fig. 4(ii)b).The presence of lattice fringes reveals the material is crystalline in nature which is in well agreement with XRD. XPS analyses were carried out to understand the surface chemical state of Ti, O, and Noble metals in the prepared series of catalysts which is the key factor in the improved photocatalytic activity.Fig. 5 show the XPS spectra of Pt, Pd, Ag, Au, in bimetal/TiO 2 .The presence of Pt and Pd on the surface of TiO 2 can be confirmed by high resolution XPS.The Pt 4f7/2 and Pt 4f5/2 of precursor H 2 PtCl 6 peaks has been reported at 74.8 and 78.5 eV respectively 37 But after photodeposition, the Pt 4f7/2 and Pt 4f5/2 peaks had shifted to 71.6 eV and 74.2 eV respectively, demonstrating the reduction of Pt(IV) to Pt(0) 38.While the binding energy peaks shown at 342 and 336.6 eV for Pt 1 Pd 1 /TiO 2 and Au 1 Pd 1 /TiO 2 has originated from Pd 2 (Pd 3d3/2 3d5/2) and also indicate that the oxide species are formed on the surface of Pd.The Pt 1 Pd 1 /TiO 2 also has one peak at 334 eV, which is originated from Pd 0 (Pd 3d5/2) 39.The catalyst Ag 1 Pd 1 /TiO 2 has binding energy peaks at 341.6, 337.6 (broad peak) and 333.2.The binding energy peak originated at 341.6, and The gas phase CO 2 photoreduction was investigated to test the activity of the prepared series of catalysts in the presence of H 2 O vapor and UV-A irradiation at ambient conditions and the results are shown in Fig. 6.The commercial anatase TiO 2 used in the catalyst synthesis has selectivity towards CO formation.The results clearly indicate that the photocatalytic performance of TiO 2 can be improved by impregnating noble metals and further significant improvement was observed when combination of two metals were loaded simultaneously.The deposition of noble metal nanoparticles onto TiO 2 results in superior hydrocarbon formation is mainly attributed to the improved charge separation and better multi- electron transfer processes.The efficiency of noble metal over TiO 2 with respect to methane follows the order Pd Pt Ag Au.While Pt has highest work function among all metals still Pt provides less photocatalytic activity than Pd 2 /TiO 2 perhaps due to bigger particles or agglomeration as shown in TEM Fig. 4(i)d). The flow rate was varied to get optimum condition for CO 2 photoreduction.As shown in Fig. 6a) when flow rate is increased from 4 mLmin -1 to 8 mLmin -1 then methane production was increased from 356.4 nmoles g -1 h -1 to 801.9 nmoles g -1 h -1 while further increase in flow rate to 15 mL min -1 average methane production yield was decreased up to 772.7 nmoles g -1 h -1 over Pd 2 /TiO 2 .In comparison to Pd 1 /TiO 2 (363.5 nmoles g -1 h -1 of methane) Pd 2 /TiO 2 produces 801.9 nmoles g -1 h -1 of methane with optimum flow 8mLmin -1 (Fig. 6b).It is clear, that the optimum loading amount is required to enhance the photocatalytic reaction via suppressing the recombination by trapping of large number of electrons 43.Therefore, further 2 loading was optimized for other noble metal loading over TiO 2 for CO 2 reduction. Fig. 6c shows comparative study for CO 2 photoreduction with optimum 8mLmin -1 flow rate at different M 2 /TiO 2 where M stands for Ag, Au, Pd and Pt.On changing metal electrodes prod-uct distribution and reduction efficiencies can be altered, it is further confirmed by loading of different noble metals 44.The obtained results clearly demonstrate that Ag and Au helps to produce CO and methane while Pd and Pt selectively produces methane with higher yield.TiO 2 solely produces 67.31 nmoles g -1 h -1 of carbon monoxide, while loading of noble metal improves the catalytic activity and Ag 2 /TiO 2 provides 667.439 nmoles g -1 h -1 of CO and 395.53 nmoles g -1 h -1 of methane.Au 2 /TiO 2 gives 1153.171nmoles g -1 h -1 CO and 131.205 nmoles g -1 h -1 methane.Pt 2 /TiO 2 produces 412.371 nmoles g -1 h -1 methane while Pd 2 /TiO 2 selectively provides maximum amount of methane i.e. 801.90 nmoles g -1 h -1 .Au metal has medium hydrogen evolution overpotential and weak CO adsorption strength, so CO is major product over Au 45. Further the effect of combination of two noble metals loaded simultaneously on TiO 2 was studied while keeping Pd as constant metal as it provides best result with respect to methane.An improvement in terms of product yield and selectivity was also observed.The combination with gold in Au 1 Pd 1 /TiO 2 helped to get 1284 nmoles g -1 h -1 methane while with platinum in Pt 1 Pd 1 /TiO 2 yielded 1436 nmoles g -1 h -1 of methane.The combi- nation with silver Ag 1 Pd 1 /TiO 2 produced maximum 1787 nmoles g -1 h -1 of methane and along with 212 nmoles g -1 h -1 of ethane.Among all catalyst Ag 1 Pd 1 /TiO 2 proven as best catalyst as it provides better photocatalytic activity and produces maximum hydrocarbon.It is also reported that the silver and palladium forms stable alloy and highly active catalysts in terms of electrocatalytic properties with better charge mobility 46.The adsorption of reactants on the surface of photocatalyst is an integrated part of photocatalytic reduction of CO 2 with water and it has always been affected with temperature.The effect of temperature was monitored at three different temperatures i.e. 4 , 25 and 50 C. At 4 C around 611 nmoles g -1 h -1 of methane and 120 nmoles g -1 h -1 of ethane were obtained while at 25 C 1787 nmoles g -1 h -1 of methane and 212 nmoles g -1 h -1 of ethane was obtained in Fig. 7.But on further increase in reaction temperature leads to decrease in methane formation to 1391 nmoles g -1 h -1 and 246 nmoles g -1 h -1 of ethane.Hence 25 C is the necessary temperature for the photocatalytic reduction of CO 2 with our catalytic system. The photocatalytic reduction of CO 2 with water over noble metal/TiO 2 catalysts is outlined in Fig. 8 and Scheme 2 on the basis of above experiments.The noble metal nanoparticles are well dispersed at the surface of TiO 2 (Fig. 4(i) and (ii)) and Pt nanoparticles are found agglomerated as flower shape on TiO 2 nanoparticles in Fig. 4(i)d).Noble metal loading on TiO 2 plays important roles in photocatalytic reduction of CO 2 47.Noble metals are good conductors and participate in phototelectron transfer to the adsorbed CO 2 at the surface of catalyst 48.Therefore their presence at the surface of TiO 2 enhances the charge separation and retards the recombination due to the formation of Schottky barriers, due to lower fermi level of metals than TiO 2 which extends life span of electron hole pair to enhance the photocatalytic activity 49. The noble metal loading onto TiO 2 causes the red shift in UV-vis spectra and responsible for the enhanced activity at low energy irradiation as shown in Fig. 3.Here the photocatalytic reaction follows the carbene mechanism.The formation of methane requires multiple electron proton reaction which is hard to be happed at bare TiO 2 .The bare TiO 2 gives CO formation by following 2electron, 2proton system, the metal impregnation on to photocatalyst shifts the product selectivity and enhances the yield or total amount of photoelectrons available for the reaction on photocatalytic reduc-tion of CO 2 50515253.Single noble metal loading shifts the selectivity towards methane formation with 8electron 8proton system.Here the initially formed CO further undergo photocatalytic reduction to form carbine and followed by methyl radical formation and finally methane formation at the surface of noble metal nanoparticle.While the presence of two noble metals especially with Ag 1 Pd 1 /TiO 2 helps two methyl radicals associates to form ethane. Based on catalyst characterization and photocatalytic evaluation, the increased amount of CO and methane is due to formation of Schottky barriers, as well as due to lower fermi level of metals than TiO 2 which suppress the recombination of electron hole pair to enhance the photocatalytic activity."
  },
  {
    "title": "Conclusions",
    "content": "We have demonstrated a simple, efficient and easily accessible semiconductor i.e. noble metal (Ag, Au, Pd, Pt) loaded TiO 2 photocatalyst for photoreduction of CO 2 using water under UV-A light.Two types of loading was prepared by photodeposition method i.e. monometallic and bimetallic on TiO 2 .Only carbon monoxide was obtained as product over bare TiO 2 .The better photocatalytic activity of single noble metal loaded TiO 2 is ascribed to the effect of easy electron transfer and retardation of electron-hole pair recombination and transfer to CO 2 and helps in methane formation.Furthermore, the loading of two noble metals on TiO 2 significantly improves the methane formation and Ag 1 Pd 1 /TiO 2 shifts the product selectivity towards high calorific value containing fuel i.e. ethane.Ag 1 Pd 1 /TiO 2 gives best results with 1787 nmoles g -1 h -1 of methane and along with 212 nmoles g -1 h -1 of ethane formation on photocatalytic reduction of CO 2 with water. Scheme 1. Strategy to synthesize of MTiO2 by Photodeposition. Fig. 1.XRD Pattern of a) noble metal/TiO2 b) bimetal/TiO2. Fig.2.UV-vis Spectra of (i) noble metal/TiO2 (ii) bimetal/TiO2. Fig. 3. (i) SEM, EDX and Element mapping of a-a\") Pd2/TiO2 b-b\") Pt2/TiO2 c-c\") Ag2/TiO2 d-d\") Au2/TiO2 (ii) SEM, EDX and Element mapping of a-a') Ag1Pd1/TiO2 b-b') Au1Pd 1/ TiO2 c-c') Pt1Pd1/TiO2. Fig. 4. (i) HR-TEM images of a) Pd2/TiO2 b) Au2/TiO2 c) Ag2/TiO2 d) Pt2/TiO2 (ii) HR-TEM images a) Au1Pd1/TiO2 b) Ag1Pd1/TiO2 c) Pt1Pd1/TiO2. has originated from Pd 2 (Pd 3d3/2 3d5/2) while the peak at 333.2 belongs to Pd 0 (Pd 3d5/2).The results indicate that the Pd is present in both metallic and oxide form.The peaks are present at 341.6, 337.6 and 333.2 eV for Pd (Ag 1 Pd 1 /TiO 2 ) and peaks are at 373.4 Ag 0 (3d3/2) 40, 369.5 Ag 0 3d5/2(Ag-Pd alloy)41 367.08 AgO (Ag 3d5/2) 42. Fig. 5. XPS Spectra of a) Pt1Pd1/TiO2 b) Au1Pd1/TiO2 c) Ag1Pd1/TiO2. Fig. 6.CO2 photoreduction under UV-A irradiation in continuous gas reactor a) over Pd2/TiO2 with different flow rate b) at different loading of Pd; Pd1/TiO2 and Pd2/TiO2 c) Comparative study over Ag, Au, Pd, Pt photo-deposited TiO2 d) over bimetal/TiO2 Pd was chosen as constant metal. Fig. 7. Effect of temperature on Ag1Pd1/TiO2 for CO2 reduction under UV-A irradiation. Fig. 8. Schematic diagram of photocatalytic reduction of CO2 with water over Noble metal/TiO2 under UV-A irradiation. Authors are grateful to Director, CSIR-IIP for his kind permission to publish the results.N.S. thanks CSIR for research funding (Grant Serial 1121110360, Ref 18-12/2011(ii)EU-V).Authors are thankful to ASD, CSIR-IIP for their analytical support."
  }
]