[
  {
    "title": "Doi",
    "content": "10.1088/1361-6528/aa6bb5"
  },
  {
    "title": "Article_Title",
    "content": "Construction of an all-solid-state artificial Z-scheme system consisting of Bi<sub>2</sub>WO<sub>6</sub>/Au/CdS nanostructure for photocatalytic CO<sub>2</sub> reduction into renewable hydrocarbon fuel"
  },
  {
    "title": "Abstract",
    "content": "Construction of an all-solid-state artificial Z-scheme system consisting of Bi 2 WO 6 /Au/CdS nanostructure for photocatalytic CO 2 reduction into renewable hydrocarbon fuelView the table of contents for this issue, or go to the journal homepage for more"
  },
  {
    "title": "Experimental",
    "content": "Preparation of the Bi 2 WO 6 /Au/CdS Z-scheme system All chemicals were of analytical grade and were used without further purification.Bi 2 WO 6 nanoplates were synthesized via a facile and rapid microwave-assisted hydrothermal method 40.In a typical process, 1.0 mmol Bi(NO 3 ) 3 5H 2 O and 2.0 mmol Na 2 WO 4 2H 2 O were mixed in 15 ml of deionized water stirring for 30 min.Then 0.5 ml of ethylenediamine (En, 99) was injected.After being stirred for another 30 min, the mixture was transferred into a Teflon-lined autoclave in a microwave system (CEM MARS).After being treated at 180 C for 10 min under microwave radiation, the resulting product was cooled to room temperature quickly.The product was collected, washed with deionized water and absolute ethanol, several times, and dried by lyophilization. Bi 2 WO 6 /Au was obtained via a modifed literature method on preparing Fe 3 O 4 /Au hybrid spheres 41.0.3 g of the as-prepared Bi 2 WO 6 powder was suspended in 100 ml deionized water, followed by the addition of 25 ml of an aqueous solution of 0.01 M L-cysteine.After being treated by sonication for 30 min, 30 ml of 1 mg ml -1 HAuCl 4 4H 2 O aqueous solution was injected.After the solution was stirred vigorously for 30 min, 50 ml of aqueous solution of 0.05 M L-ascorbic acid was quickly added into the solution.The reaction was exposed to rapid stirring for 3 h.The product was collected via centrifugation, washed with deionized water repeatedly, and dried by lyophilization.Subsequently, the product was heated to 400 C in an air atmosphere and kept for 4 h to remove cysteine bound on the product surface. To prepare the Bi 2 WO 6 /Au/CdS Z-scheme system, CdS was deposited on the Bi 2 WO 6 /Au by the bath deposition method 42.10 mmol Cd(NO 3 ) 3 4H 2 O and 10 mmol CH 3 CSNH 2 were dissolved in 80 ml deionized water.0.1 g of the prepared Bi 2 WO 6 /Au was dispersed into the solution, followed by a water bath under stirring at 60 C for 30 min.The product was then centrifuged, washed with deionized water and absolute ethanol several times, and dried by lyophilization. The morphology of the samples was characterized by field emission scanning electron microscopy (FE-SEM) (FEI NOVA NanoSEM230, USA) and transmission electron microscopy (TEM) (JEOL 3010, Japan).The crystallographic phase of these obtained products was determined by powder x-ray diffraction (XRD) with Cu-Ka radiation (0.154178 nm) (Rigaku Ultima III, Japan).XPS spectrum (K-Alpha, THERMO FISHERSCIENTIFIC) was calibrated with respect to the binding energy of the adventitious C 1s peak at 284.8 eV.The UV-visible (UV-vis) diffuse reflectance spectra were measured on a UV-vis spectrophotometer (UV-2550, Shimadzu) at room temperature.The transient time-resolved photoluminescence decay measurements were recorded on a fluorescence spectrometer (FLS920, Edinburgh Instruments). In the photocatalytic reduction of CO 2 in a gas-solid reaction system, 0.1 g of the as-prepared sample was uniformly dispersed on the circular glass reactor with an area of 4.2 cm 2 .A 300 W Xe lamp was used as the light source for the photoreduction.The volume of the reaction system was about 230 ml.The reaction setup was vacuum-treated several times, and then the high purity of CO 2 gas was maintained in the reaction setup for reaching ambient pressure.0.4 ml of deionized water was injected into the reaction system as a reducer.The sample was allowed to equilibrate in the CO 2 -H 2 O atmosphere for several hours to ensure that the adsorption of gas molecules was completed.During the irradiation, 1 ml of gas was continually taken from the reaction cell at given time intervals for subsequent CH 4 concentration analysis by using a gas chromatograph (GC-2014, Shimadzu Corp., Japan)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The assemble step of the Bi 2 WO 6 /Au/CdS Z-scheme system was schematically illustrated in figure 1.Firstly, the Bi 2 WO 6 nanoplate surface was modified with L-cysteine HSCH 2 CH (NH 2 )COOH to create a monolayer 40.AuCl 4 -was then attached to the monolayer through electrostatic interaction, which was subsequently reduced to Au nanoparticles with added L-ascorbic acid as a reduction agent.Calcination allows simultaneous removal of organics and tight fixation of Au nanoparticles onto the Bi 2 WO 6 nanoplate surface.The resulting Bi 2 WO 6 /Au was then dispersed into solution of CdS precursors containing Cd 2 and CH 3 CSNH 2 as S source. Owing to the strong affinity of Au surface atoms to sulphur 43, the growing CdS prefers to coat on the Au surface to form the hemispherical core/shell of Au/CdS on the Bi 2 WO 6 nanoplate. The FE-SEM images show that the product is dominantly (95) ultrathin Bi 2 WO 6 nanoplates with the clear square contours and the side length of 1-3 m (figure 2).No other product morphologies were observed in the SEM images, demonstrating the high-yield growth of the nanoplates.The section analysis on the atomic force microscopy (AFM) image shows that the nanoplate is about 3-4 nm in average thickness (figure 3).It should be noted that the absence of ethylenediamine (En) in the reaction system leads to the formation of irregular Bi X-ray diffraction (XRD) peaks of the Bi 2 WO 6 nanoplate can be indexed to the orthorhombic Bi 2 WO 6 , which match very well with the reported data (JCPDS No. 73-1126, a5.457A, b5.436A, c16.427A) (figure 5).No impurity peaks are detected, indicating that the Bi 2 WO 6 product is a pure phase.The intensity ratio of the (200) or (020) peak to the (113) peak is 0.51, obviously larger than the standard value of 0.27, indicating that the crystal has special anisotropic growth along the (001) plane, in good agreement with the TEM observation.The XPS spectra of the Bi 2 WO 6 / Au/CdS composites confirms the bonding energies of Bi 4f peaks at 158.1 eV and 163.5 eV, W 4f peaks at 34.4 eV and 36.6 eV, Cd 3d peaks at 404.1 eV and 410.9 eV (figure 6).S2p peak was found to coincide with the Bi 4f.The O element exhibits two kinds of chemical states, crystal lattice oxygen at ca 529.4 eV and adsorbed oxygen at ca 532.2 eV 44.The Au 4f peaks at 83.2 eV and 86.8 eV indicate that the Au element remains in metallic format. The UV-visible diffuse reflectance spectroscopy shows that the as-prepared Bi 2 WO 6 nanoplate is of an absorption edge at about 430 nm (figure 7(a)), corresponding to the bandgap of 2.88 eV toward visible-light photocatalytic activity.Mott-Schottky plots of the Bi 2 WO 6 nanoplate demonstrates that the tangent slope of the linear portion is positive (figure 7(b)), which indicates that the sample is an n-type semiconductor.According to the equation E(NHE)E(Ag/AgCl)0.197 45, the edge of the conduction band (E CB ) of Bi 2 WO 6 was calculated to be -0.64 eV (versus NHE), more negative than that of E 0 (CO 2 /CH 4 ) (CO 2 8e -8H CH 4 2H 2 O, E 0 redox -0.24V versus NHE), and the edge of the E VB was 2.24 eV (versus normal hydrogen electrode, NHE), more positive than that of E 0 (H 2 O/H ) (H 2 O1/2O 2 2H 2e -, E 0 redox 0.82V versus NHE).This indicates that the photogenerated electrons and holes on the irradiated Bi 2 WO 6 can react with adsorbed CO 2 and H 2 O to produce CH 4 as described in the equation: CO 2 2H 2 OCH 4 2O 2 . It has been reported that a series of various reduction products (e.g., CO, CH 3 OH, CH 4 , C 2 H 5 OH, and C 2 H 6 ) could be formed over various photocatalysts, which is decided by the number of electrons and protons (e -/H ) involved in multiple reactions.In fact, the different photocatalytic reaction system also has an effect on products.Only CH 4 was detected in our work.We believe that both H 2 and O 2 may be produced.As the main intention of our work focuses on the generation of the hydrocarbon fuel, H 2 and O 2 were not checked.The CO 2 photocatalytic activity of various Bi 2 WO 6based photocatalysts was evaluated with visible light illumination (400 nm) in the presence of water vapor. (figure 8).The CH 4 generation rate of Bi 2 WO 6 was detected at about 0.41 mol g -1 in the first hour.Loading Au nanoparticles on the Bi 2 WO 6 nanoplate to form the Bi 2 WO 6 /Au increased the CH 4 generation rate to 0.57 mol g -1 , indicating that the Au nanoparticles as an electron sinker has an influence on the photocatalytic activity 46.Combination of CdS with Bi 2 WO 6 to form the Bi 2 WO 6 /CdS heterostructure greatly increased the CH 4 generation rate to 1.52 mol g -1 during the first few hours.Nevertheless, the increased tendency of CH 4 yield was gradually subsided with a subsequent photocatalysis process, possibly due to photocorrosion of CdS.Thus, it is deduced that the present Bi 2 WO 6 and CdS may form a typical type-II heterostructure (figure 9(a)), consistent with previous reports of Bi 2 WO 6 -CdS nanocomposites 47.The visible-light generated electron of the CdS transferred from the CB of CdS to the CB of Bi 2 WO 6 , while the photoinduced hole of CdS remained in the VB of CdS for oxidation of water, which simultaneously leads to photocorrosion of CdS.The Bi 2 WO 6 /Au/CdS exhibits a CH 4 generation rate of 2.02 mol g -1 , increasing by four times compared to the bare Bi 2 WO 6 nanoplates.Consistent increased tendency of CH 4 yield indicates that the Bi 2 WO 6 / Au/CdS possesses a different charge transfer process from the Bi 2 WO 6 /CdS heterostructure, which may be attributed to form the Z-scheme system (figure 9(b)).Under light irradiation, the photoexcited electrons in CB of Bi 2 WO 6 transferred to Au and then to the VB of CdS, and subsequently recombined with holes photogenerated in CdS.Simultaneously, the photogenerated electrons in CB of CdS and holes in the VB of Bi 2 WO 6 exhibited strong reduction power and oxidation power, respectively, leading to high photocatalytic reduction of CO 2 .The depressed hole density on CdS may enhance the stability of CdS against photocorrosion 38,39.The quantum yield was calculated according to the equation 48: in which M(CH 4 ) and N(photons) signify the molecular number of generated CH 4 in unit time and the number of incident photons in unit time, respectively.The apparent quantum yield at a wavelength of 43015 nm was measured to be 0.012.This similar CdS-based photocatalytic Z-scheme system has been reported in CdS/Au/ZnO, CdS/Au/TiO 2 24,49,50, CdS/Au/TiO 1.96 C 0.04 51 and CdS/Ag/ Bi 2 MoO 6 52.Although Au nanoparticles can exhibit a surface plasmon resonance (SPR) effect, it is believed that the contribution of the SPR to the photocatalytic efficiency is relative limited, compared to the semiconductor.Photoluminescence decay measurements were carried out to investigate the charge transfers in various photocatalysts (figure 10).The decay time of Bi 2 WO 6 and Bi 2 WO 6 /Au were detected as 0.47 ns and 0.74 ns, respectively.The longer PL decay time of Bi 2 WO 6 /Au than Bi 2 WO 6 suggests that the photoexcited electrons in the CB of Bi 2 WO 6 transferred into the Au nanoparticle as an electron sinker to allow for decrease of recombination of the electron and hole as the CB edges of Bi 2 WO 6 is more negative than the Fermi level of Au.The PL decay time of the Bi 2 WO 6 /CdS increased to 1.38 ns, which is attributed to the formation of Bi 2 WO 6 /CdS heterostructure.Bi 2 WO 6 /Au/CdS shows the longest lifetime of 4.05 ns, which may profit from the mechanism of the Z-scheme system.The photogenerated electron flow of Bi 2 WO 6 consumes the holes of CdS via Au nanoparticles as an electron mediator offering a high speed charge transfer channel, which subsequently suppresses the electron of CdS to transfer to the ground state, thereby prolonging the survival time of the electrons on the CdS.The exponential decay-fitted parameters of PL spectra were summarized in online supplementary table 1 (available online at stacks.iop.org/NANO/28/274002/mmedia)."
  },
  {
    "title": "Conclusions",
    "content": "An all-solid-state Bi 2 WO 6 /Au/CdS Z-scheme system was rationally prepared for the photocatalytic reduction of CO 2 into methane.The introduction of Au as a fast charge channel between Bi 2 WO 6 and CdS leads to more efficient spatial separation of electron-hole pairs.The photoexcited electrons in the CB of Bi 2 WO 6 transferred to Au and then to the VB of CdS, and subsequently recombined with holes photogenerated in CdS.Simultaneously, the photogenerated electrons in the CB of CdS and holes in the VB of Bi 2 WO 6 exhibited strong reduction power and oxidation power, respectively, leading to high photocatalytic reduction of CO 2 . 2 WO 6 nanoparticles (data not shown).It indicates that the introduction of En effectively controlled the shape growth of the Bi 2 WO 6 .The TEM image clearly reveals light contrast of the ultrathin nanostructures of the Bi 2 WO 6 nanoplate.The nanoplate possesses regular edges and the lateral dimensions reach hundreds of nanometers.A high-resolution TEM image shows the clear lattice fringes, perfectly aligning across the entire surface (figure 4(b)), indicating a single-crystalline structure of the Bi 2 WO 6 nanoplate.The distances of the 2D crystal lattices are 2.73 A, respectively, which can be indexed to (200) planes of orthorhombic Bi 2 WO 6 .The corresponding fast Fourier transform (FFT) pattern shows an ordered array of spots (the inset of figure 4(b)), which can confirm the single crystallinity.Reduction of AuCl 4 -allows numerous Au nanoparticles with a size of 5 to 20 nm to intersperse on the surface of the Figure 1.Schematic illustration of the preparation procedure of the Bi 2 WO 6 /Au/CdS Z-scheme system. Figure 2. Low and high magnification SEM images of Bi 2 WO 6 nanoplates SEM images of Bi 2 WO 6 nanoplates. Figure 3. AFM image of Bi 2 WO 6 nanoplates. Figure 4. TEM images of (a) and (b) Bi 2 WO 6 , (c) and (d) Bi 2 WO 6 /Au, (e) and (f) Bi 2 WO 6 /Au/CdS. Figure 5. X-ray diffraction patterns of Bi 2 WO 6 . Figure 6.XPS spectrum of Bi 2 WO 6 /Au/CdS (a) survey spectrum, (b) Bi 4f, peak, (c) W 4f, 5p peak, (d) O 1s peak, (e) Au 4f peak, and (f) Cd 3d peak. Figure 7. (a) UV-visible diffuse reflectance spectroscopy and (b) Mott-Schottky plots of the Bi 2 WO 6 nanoplate. Figure 8.(a) Photocatalytic CH 4 evolution amounts of as-prepared samples under visible irradiation (400 nm).(b) Comparation of the CH 4 yield in the first hour. Figure 9. Schematic illustration of the charge separation and transfer in (a) type II heterostructure of Bi 2 WO 6 /CdS and (b) Z-scheme system of Bi 2 WO 6 /Au/CdS. Figure 10.The PL decay spectra of as-prepared samples. This work was supported by 973 Programs (No. 2014CB239302 and 2013CB632404), NSF of China (No. 21473091, 21473082, 21603183, and 21673001), NSF of Jiangsu Province (No. BK2012015 and BK20130425), and Jiangsu Postdoctoral Science Foundation (1601062B), NSF of Anhui Province (No. 1608085ME102)."
  }
]