[
  {
    "title": "Doi",
    "content": "10.1016/j.cej.2015.01.099"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic reduction of NO2 and CO2 using molybdenum-doped titania nanotubes"
  },
  {
    "title": "Abstract",
    "content": "h i g h l i g h t sMo-doped TNTs was synthesized for photocatalytic NO x removal and CO 2 utilization.Doping of Mo promoted the reduction while inhibited the oxidation activity of TNTs.Mo-TNTs prepared by precipitation method had highest NO 2 and CO 2 reduction ability.Chemical state of Mo 4 and Mo 5 was the key factor controlling the reducibility."
  },
  {
    "title": "Experimental",
    "content": "Pure TNTs (denoted as T-0) were synthesized by the hydrothermal method using TiO 2 (Degussa P25) as a precursor 25,29,30.For a typical preparation process, 6 g of P25 was mixed and sonicated in 180 mL of 10 N NaOH solution for 20 min, followed by hydrothermal treatment in an autoclave at 135 C for 24 h.The obtained product was then filtrated and sonicated in 1 L of HNO 3 solution at pH 1.6 for 30 min.After that, the suspension was repeatedly filtrated and washed with 1 L of DI water several times until the washed pH value reached 6.5-7.0.The material was subsequently dried at 120 C for 12 h (i.e., as-synthesized TNTs), and finally calcined at 500 C for 2 h (i.e., calcined TNTs). The doping of Mo with a theoretical Mo/Ti molar ratio of 1 was performed by adding Mo precursor (ammonium molybdate tetrahydrate, (NH 4 ) 6 Mo 7 O 24 A4H 2 O) at three different process steps: (1) added at the same time as the TiO 2 precursor (i.e.under hydrothermal method, the Mo-doped TNTs sample was denoted as Mo/T-H), (2) added during the acid washing process (i.e. via precipitation method, denoted as Mo/T-P), (3) impregnated to TNTs before calcination (denoted as Mo/T-I).All the materials were then calcined at 500 C. The materials were characterized by SEM, TEM, BET, and XRD analyses.Detailed test conditions for these analyses can be found in Nguyen and Bai 25.Furthermore, the metal contents (Ti and Mo) were analyzed by an inductively coupled plasma atomic emission spectroscopy system (ICP-OES, Agilent 700 Series).Chemical state of the elements in the material was analyzed by an X-ray photoelectron spectroscopy (XPS) system (Perkin-Elmer PHI 1600 ESCA system).The surface acidic and basic properties were investigated by temperature program desorption (TPD) with NH 3 and CO 2 , respectively.These TPD analyses were performed by a chemisorption analyzer (AutoChem II, Micromeritics).In a typical analysis, 0.11 g of material was pretreated with He gas at 400 C for 4 h, followed by cooling down to 50 C, adsorption with CO 2 -He (for CO 2 -TPD) or NH 3 -He (for NH 3 -TPD) for 1 h, purging with He for 1 h, and increasing temperature to 800 C 31.The desorption amount of CO 2 or NH 3 was recorded for calculating the amount of basic or acid sites, respectively. A continuous reactor was employed for NO 2 removal tests under UV-A irradiation (365 nm) at light intensity of 1.25 mW/ cm 2 using 0.11 0.01 g of photocatalyst.Concentrations of NO and NO 2 were analyzed by a chemiluminescence NO x analyzer (SIR, S-5012).The mixed gas flow was controlled at a flow rate of 400 cm 3 /min, relative humidity of 55 5, temperature of 25 2 C, and NO 2 concentration of 9.75 0.25 ppmv. Photocatalytic reduction of CO 2 was conducted under liquid phase reaction in a batch reactor at 40 C.The photocatalyst with an amount of 0.1 g was mixed in 300 ml of 0.2 M MEA solution, followed by aeration with CO 2 gas for 1 hour.It was then irradiated under UV-A (365 nm) with light intensity of 63 lW/cm 2 .The products were analyzed by a gas chromatographer (SRI-8610C) equipped with an FID and 5 m long Porapak Q column."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The TEM images of P25, T-0, and Mo-doped TNTs are shown in Fig. 1 (SEM results can be found in Fig. S2 of Supplementary data).Clearly, the morphology of P25 was particle-like structure (Fig. 1(d)) while the as-synthesized T-0 and Mo-doped TNTs (Fig. 1(a)-(c)) appeared to be tubular structure with open ends.Additionally, a higher percentage of tube shape was observed for Mo/T-H and Mo/T-P compared to T-0.However, tubular structure of all TNTs materials was lost after calcination and became rod-like structure as can be seen in Fig. 1(e)-(g). The pore structure properties of all photocatalysts are summarized in Table 1.All as-synthesized TNTs showed similar values of high surface area (333-403 m 2 /g) and pore volume (ca.1.2-1.3cm 3 /g).Surface areas of as-synthesized Mo-doped TNTs were in the order of Mo/T-H Mo/T-P T-0 Mo/T-I, and these values were 6-8 times higher than that of the TNTs precursor material (P25 TiO 2 ).The higher percentage of tube shape in Mo/T-H and Mo/T-P compared to T-0 could be the possible reason for their higher values of surface area than that of T-0.This also indicated that the doping of Mo during the formation of tubular structure (i.e., hydrothermal and acid washing) might help to form better tubular structure and provide higher surface area.On the other hand, when Mo was doped after the tube was already formed (i.e., in impregnation case of Mo/T-I after drying), the Mo species could only be appeared on the surface of TNTs.The porous structure of TNTs included the inner pores of the tube and the interlayer pores of the tube-wall 22,23,29.Therefore, the Mo-species that accumulated in the TNTs during impregnation process could block these pores and result in the lower surface area of Mo/T-I as compared to pure T-0. Because only calcined TNTs had photocatalytic activity thus studies mainly focused on calcined TNTs.After calcination at 500 C, the surface areas of TNTs drastically decreased to 116-127 m 2 /g.This is because the corruption structure of TNTs at high calcination temperature from tubular (amorphous) to rod-like (anatase) structure (Fig. 1).The loss of inner pores of the tube and inter-layers of the tube wall make the surface areas of rod-like materials significantly lower than tubular TNTs materials 22,23,25,32. The surface areas of calcined TNTs were in the order of Mo/T-H Mo/T-P T-0 Mo/T-I, which were in reverse order as compared to the as-synthesized TNTs.These results indicated that the doping of molybdenum by hydrothermal and precipitation enhanced the surface area of as-synthesized TNTs while lessen the thermal stability of TNTs structure.An opposite trend, however, was found in case of Mo doping by impregnation method.For Mo/T-H and Mo/T-P, the Mo species were doped during the formation of nanotubes and incorporated into the tubular structure of TNTs.This Mo impurity in the framework of TNTs made the Mo/T-H and Mo/T-P less stable than pure TNTs under high temperature treatment.The reconstruction of the tubular to rod-like structure as well as the crystallization of amorphous phase to anatase phase with the impurity of Mo species may cause the relatively higher corruption rate of the TNTs materials.On the contrary, for Mo/T-I which had Mo-species only attached on the surface of the nanotubes, the Mo-species would have almost no effect on the thermal stability of the TNTs tubes.Under calcination, the Mo-species may lead to the formation of MoO x particles on the surface of calcined TNTs.The relatively higher surface area of Mo/T-I as compare to the pure TNTs (T-0) revealed that the MoO x particles should be very small as compared to the size of the TNT itself after calcination.Finally, although calcined TNTs showed a trend in surface area, these values ranged from 116.4 to 127.4 m 2 /g, from which the difference was inconsiderable between the TNTs materials. Based on XRD results (Fig. S3 of Supplementary data), all TNTs were in anatase crystal phase.And molybdenum peak was not found in any material, resulting in similar XRD patterns for T-0 and Mo-doped TNTs.The non-detectable Mo by XRD might be due to several reasons: (i) Mo is incorporated into the frame structure of TNTs, (ii) MoO x content is too low to be detected by the XRD analysis, (iii) MoO x is well dispersed in TNTs, or (iv) Mo is not successfully doped onto TNTs.Likewise, several studies of doping Mo onto TiO 2 materials also reported that MoO 3 was not detected by XRD and the most possible reason is ascribed to the incorporation of Mo 6 ions into TiO 2 lattice 33343536. The surface acidity and basicity of TiO 2 have been proved to have a strong effect on the photocatalytic activity 37.Therefore, amounts of acid and basic sites were calculated and illustrated in Fig. 2. One can observe that the amounts of acid and basic sites of all TNTs materials were similar and they were much higher than 39,40.This represented that the synthesis methods of precipitation and impregnation were both successful for doping Mo into the structure or depositing MoO x on the surface of TNTs.On the other hand, the hydrothermal method seemed not to provide a visible Mo-doping effect as observed from the UV-Vis adsorption spectrum.19,20,41.It is also observed that Mo 5 was the main chemical state of Mo after doping into TNTs materials.Notably, the variation of Mo 4 /Mo 6 and Mo 5 /Mo 6 ratios strongly depended on the method of synthesis.Since Mo/T-I synthesized by impregnation method could contain higher Mo ions density on the surface of TNTs, an easy transformation of Mo 4 to Mo 6 during the calcination step would be expected.Therefore, the Mo 6 content of Mo/T-I was higher than that of Mo/T-P, leading to both Mo 4 /Mo 6 and Mo 5 /Mo 6 ratios of Mo/T-P (1.03 and 4.04, respectively) were considerably higher than those of Mo/T-I (0.11 and 2.21, respectively). Although the amounts of Mo and Ti precursors were calculated before materials preparation in order to obtain a Mo/Ti molar ratio of 1, the actual ratios of prepared materials varied a lot as can be seen in Fig. 5.The Mo/Ti molar ratios were in the order of Mo/T-H ( Mo/T-P Mo/T-I.For Mo/T-P and Mo/T-I, the Mo/Ti ratio was 1.32 and 1.42, respectively, both of which were higher than the calculated ratio (i.e.1).The differences between the actual and calculated ratios could be explained depending on each material.In case of Mo/T-P, it may be due to the loss of TNTs, which was more than that of Mo during preparation process.In Mo/T-I, the abundant amount of hydrate form of TiO 2 existed in TNTs before calcination step would be a possible reason for the actual Mo/Ti ratio of 1.0.This made the actual molecular weight of as-synthesized TNTs higher than pure TiO 2 , while the molecular weight of pure TiO 2 was used for calculation of the theoretical molar ratio of Mo/Ti during the impregnation process.On the other hand, the Mo/Ti ratio in Mo/T-H was very low at 0.04.This may indicate that there was only a minor amount of Mo being doped into TNTs by hydrothermal method. In brief, the results from UV-Vis adsorption, XPS, and ICP consistently confirmed that Mo was successfully doped into TNTs via precipitation (Mo/T-P) and impregnation (Mo/T-I) but not by hydrothermal method (Mo/T-H).Among three methods, the impregnation method should conserve the Mo and TiO 2 contents during the synthesis processes.When (NH 4 ) 6 Mo 7 O 24 A4H 2 O was impregnated with TiO 2 and calcined at 500 C, it is believed that either Ti atoms were substituted by Mo atoms, or molybdenum oxides (MoO x ) were formed and attached on the surface of TiO 2 .On the contrary, in the hydrothermal method, Mo compounds might exist as Na temperature and pressure.All these forms of Mo compounds were soluble in water, and may be easily washed away with excess NaOH solution during the filtration process.However, Mo that was added during acid treatment in the precipitation method may exist as weak acid form of H 6 Mo 7 O 24 .This form of Mo compound, which was insoluble, well-dispersed, and attached on the TNT tubes, would easily decompose after calcination.And similar to impregnation method, Mo could be doped into TNTs by Mo-Ti atomic substitution or MoO x surface attachment in the precipitation method. The total NO x (NO NO 2 ) removal efficiencies by using P25, T-0, and Mo-doped TNTs with NO 2 as the inlet gas are presented in Fig. 6.Photocatalysts of T-0, Mo/T-H, and Mo/T-I showed very high NO x removal efficiencies of around 100 at the beginning, then decreased to 47, 50, and 23, respectively, after 240 min.Similar NO x removal efficiency and decreasing trend can be observed for T-0 and Mo/T-H during the 240 min test period.This implies that the minor doping amount of Mo into TNTs by hydrothermal method has a negligible effect on the photoactivity of TNTs.Although the decline in NO x removal efficiency was found for all materials, the decreasing rate for P25 was the sharpest one, which was from 85 at 20 min to only 10 after 4 hr.As compared to the P25, the NO removal efficiency of Mo/T-P was the lowest at the beginning, but it was relatively stable after 80 min of experiment.This may be because P25 had the lowest surface area among all materials.Therefore, the formation and accumulation of HNO 3 on the surface caused faster surface deactivation in P25 than Mo/T-P and all other TNTs. When the NO x removal efficiencies of Mo/T-P and Mo/T-I were compared with those of T-0 and Mo/T-H, one can observe from Fig. 6 that the doping of Mo into TNTs had a negative effect on the total NO x removal.As demonstrated in the literature 25,424344, the removal of NO 2 using pure TiO 2 material such as P25 and T-0 should undergo the oxidation pathway to form nitric acid, so it would be concluded that the doping of Mo declined the oxidation activity of TNTs photocatalyst. In order to reveal the oxidation and reduction effects of the photocatalysts on NO 2 reaction, NO 2 conversion results were averaged over 240 min and summarized in Fig. 7.One can see that T-0 and Mo/T-H showed similar and the highest NO 2 conversion as well as total NO x removal efficiency.In the literature, it was demonstrated that factors controlling the NO x removal efficiency would include surface area 25,42,45 and crystallinity 25,42 of TiO 2 materials.However, this is likely to be only applied when T-0 or Mo/T-H were compared with P25, and seems not to be the case for Mo/T-I and Mo/T-P, where TNTs were successfully doped with Mo.For example, with the same crystalline structures, Mo/T-I (127.4 m 2 /g) had a higher surface than Mo/T-H (116.4 m 2 /g), but provided a significant lower total NO x removal efficiency (44) than Mo/T-H (77).Besides, according to Kozlov et al. 37, it was expected that the NO x removal efficiency was higher for those materials with a higher amount of acid sites.However, this was also applied only for T-0 and Mo-doped TNTs when they were compared with P25, where they had much more acid sites than P25 had (see Fig. 2).Among the TNTs materials, the acid and basic site amounts of T-0 and Mo-doped TNTs were roughly similar, but the NO x removal efficiencies were quite different.Therefore, the presence of Mo should be a key factor controlling the NO x removal efficiency in this study. As observed in Fig. 7, the selective reduction of NO 2 to NO was only found for Mo/T-P and Mo/T-I, which were successfully doped with Mo as discussed previously.Although the Mo/Ti ratio of Mo/T-I was higher than that of Mo/T-P, the NO 2 reduction effect to form NO was more efficient by Mo/T-P (12) than by Mo/T-I (9) during the 240 min test.This indicated that adding molybdenum precursor during the acid washing process of TNTs synthesis to prepare the Mo/T-P photocatalyst was the most beneficial method for achieving the highest NO x reduction activity. To further confirm the reduction ability of the photocatalysts, the photocatalytic reduction reaction of CO 2 using P25 and TNTs was evaluated and the methane yields are displayed in Fig. Finally, the methane yield of Mo/T-P reached 0.48 lmol/g after 240 min, which was 3 times higher than that of Mo/T-I (0.16 lmol/g).These results confirmed that precipitation was the best method for achieving high reduction ability of Mo-doped TNTs, which was in consistent with the results of NO 2 reduction to form NO. In addition to methane as a desired product of the CO 2 reduction process, carbon monoxide (CO) was also formed and can be used as a valuable energy source.The CO yield was measured at the end of 240 min experiment and presented in Fig. 9, where the methane yield was also added for comparison.The results showed that the yields of CO were much higher than the methane yields for all Mo-doped TNTs The other possible reason for the photocatalytic reduction activity of Mo-doped TNTs might be from the charge separation effect.This effect was resulted from the coupled semiconductors of MoO x and TNTs, similarly as reported with the couplings of MoO x -MoS 2 , MoS 2 -TiO 2 , or MoO x -TiO 2 4647484950.The interstitial band structures of the two photocatalysts could effectively separate charge carriers into the two different materials.In this case, photo-exited holes could accumulated on TNTs, while photo-excited electrons could move to MoO x and perform the reduction reaction.However, this needs to be confirmed by future work."
  },
  {
    "title": "Conclusions",
    "content": "The Mo-doped TNTs were synthesized via different process steps and their photocatalytic abilities for NO 2 removal and CO 2 reduction were evaluated.The doping of Mo was successful by the precipitation and impregnation methods but not by the hydrothermal method.Pure TNTs showed the highest NO 2 conversion as well as total NO x removal, which revealed that pure TNTs had better oxidation abilities.On the other hand, adding molybdenum into TNTs favored the reducibility of the photocatalysts.Among the metal doping steps, adding Mo precursor in the acid washing process of TNTs (i.e. via precipitation method) provided the highest reducibility in the photocatalytic reduction of NO 2 and CO 2 , which may be due to its higher contents of Mo 4 and Mo 5 chemical oxidation states as well as its higher surface basicity.Future work may be directed to the optimization of the conditions for synthesis steps (metal content, hydrothermal temperature, treatment time, sonication, washing acid condition and calcination temperature) and environmental reaction condition to achieve a higher reducing ability for both NO x removal and CO 2 reduction as well as to improve the CH 4 yield. Partial support of this study from the National Science Council Taiwan, through the Grant number of NSC 99-2221-E-009-037-MY3 is gratefully acknowledged. Fig. 1.TEM results for as-synthesized TNTs: (a) T-0, (b) Mo/T-H, (c) Mo/T-P, (d) P25; and calcined TNTs: (e) T-0, (f) Mo/T-H, (g) Mo/T-P, (h) Mo/T-I. Fig. 2. The amounts of acid and basic sites for P25 and calcined TNTs. that of P25.Typically, Mo/T-P had a higher acid and basic sites amounts, i.e., 2.5 and 2.2 times, respectively, than P25.Furthermore, these ratios were close to the surface area ratio of Mo/T-P to P25, i.e. about 2.3.Thus, it indicated that these two materials had similar density of surface acid and basic sites.Although the amounts of basic and acid sites were not varied a lot between TNTs materials, it did show a slight difference on the basic/acid ratio between T-0 (1.10) and Mo/T-I (0.92), which may be due to the increase of acid site by Mo doping15.The UV-Vis adsorption results of P25 and TNTs are displayed in Fig.3.Adsorption band spectra were used for determination of the TNTs band gap using the equation of E g 1240/k (where k is wavelength edge of absorption band).Absorption of visible light could be used to further reveal the state of Mo.Dieterle et al. 38 indicated that the absorption bands from 0.55 to 3.1 eV are interpreted as different states of Mo ligand to metal charge transfer (LMCT), and the interval charge transfer (IVCT) band positions at 2.0 eV can be used to determine the sample oxygen stoichiometries of Mo 5 O 5 and Mo 6 O 6 defect centers.It can be observed from Fig. 3 that Mo/T-P and Mo/T-I had the absorption edge at low band gap energy of 2.6 eV (i.e., long wavelength of 460 nm), which was consistent with the red-shift effect caused by Mo doping reported in the literature presents the XPS results for T-0 and Mo-doped TNTs.The Mo peaks could not be found for T-0 and Mo/T-H, which was in accord with the UV-Vis results.For Mo/T-P and Mo/T-I, their Mo 3d 5/2 regions showed three peaks, which corresponded to molybdenum in Mo 4 (229.7 eV), Mo 5 (231.4 eV), and Mo 6 (232.5 eV) chemical states Fig. 3. UV-Vis results of P25 and calcined TNTs. Fig. 4. XPS results of calcined TNTs: (a) T-0, (b) Mo/T-H, (c) Mo/T-P, (d) Mo/T-I. The methane production yields provided by P25, T-0, and Mo/T-H were similar and almost zero during 240 min test, while high methane yields were observed for Mo/T-P and Mo/T-I, confirming the reducing ability of TNTs doping with Mo.Additionally, the methane yields of Mo/T-P and Mo/T-I started to increase right after the UV-A irradiation, then increased faster for Mo/T-P after 60 min. Fig.6.NO x (NO NO 2 ) removal efficiencies for photocatalytic reduction of NO 2 using P25, T-0, and Mo-doped TNTs. Fig. 7. NO 2 conversion efficiencies (includes total NO x removal and NO 2 reduced to NO) for photocatalytic reduction of NO 2 .Results were averaged over 240 min. . The trend of CO yields for the tested materials was in the order of Mo/T-P Mo/T-I ) Mo/T-H P25 T-0.Although Mo/T-H had negligible CH 4 production, it had some CO yield.This may be due to the small amount of Mo was still present in the Mo/T-H photocatalyst, as observed in the ICP results (Fig.5).Among the Mo-doped TNTs, Mo/T-P again emerged as the best photocatalyst for CO 2 reduction in terms of CO production yield.It appeared that Mo/T-P showed the highest reducibility in both NO 2 and CO 2 reduction reactions.The major factor that made Mo/ T-P perform better than Mo/T-I in the photocatalytic reduction reaction would be due to the chemical states of Mo species.Both Mo/T-P and Mo/T-I possessed Mo 4 and Mo 5 chemical states, which promoted the reduction reaction and resulted in the reducibility of Mo/T-P and Mo/T-I during the photocatalysis.The possible reduction mechanism for the photocatalytic reaction of NO 2 and CO 2 by Mo-doped TNTs is proposed in Fig. 10.There may be two possible roles of Mo 4 and Mo 5 species in the reduction reaction: (1) served as hole scavengers for trapping the photo-excited holes and let the photo-excited electrons perform the reduction reaction, or (2) acted as electron donors by the oxidizing of Mo 4 to Mo 5 and/or Mo 5 to Mo 6 , which resulted in the reduction reaction of NO 2 to NO.The role of Mo 4 and Mo 5 as electron donors should be similar to the interchange of Cu 2 /Cu /Cu in the framework of TiO 2 as reported by Ohko et al. 6.As discussed in the XPS results, the ratios of both Mo 4 /Mo 6 and Mo 5 /Mo 6 in Mo/T-P were markedly higher than those in Mo/T-I, and this resulted in a higher reducibility in Mo/T-P as compared to Mo/T-I. Fig. 8. Methane yields of photocatalytic reduction of CO 2 using P25, T-0, and Modoped TNTs. Fig. 10.Possible mechanism for photocatalytic reduction of NO 2 and CO 2 by Modoped TNTs. BET results for P25, pure TNTs and Mo-doped TNTs. p : surface area (m 2 /g), V p : pore volume (cm 3 /g), d p : pore size (nm). Supplementary data associated with this article can be found, in the online version, at http://dx.doi.org/10.1016/j.cej.2015.01.099."
  }
]