[
  {
    "title": "Doi",
    "content": "10.1016/j.jphotochem.2018.06.024"
  },
  {
    "title": "Article_Title",
    "content": "Novel high performance reduced graphene oxide based nanocatalyst decorated with Rh2O3/Rh-NPs for CO2 photoreduction"
  },
  {
    "title": "Abstract",
    "content": "Highlight The synthesis of the reduced graphene oxide supported Rh2O3 / Rh nanoparticles. rGO-Rh2O3 / Rh enhances photoassisted CO2 methanation at 814.38 mol/gh at 175 o C. The process can be performed under constant flow at rates 307.45 Lh -1 The existence of electron donors increases the rate of the photoassisted methanation. Nitrobenzene quenches methanation, helping charge separation."
  },
  {
    "title": "Experimental",
    "content": "Single layer graphene oxide (GO) was prepared based on Hummers method 80.From Sigma-Aldrich Co. (USA), RhCl3, NaBH4, dimethylaniline, anisole and p-xylene were bought.All other chemicals were analytical grade. With the help of a SPM Nanoscope multimode microscope (Veeco Instruments Inc., USA), atomic force microscopy (AFM) experiments were carried out.FT-IR spectra were obtained using a Nicolet Nexus 670/870 spectrometer (Thermo Fisher Scientific Inc., USA).Transmission electron microscopy (TEM) measurement was done using JEOL JEM-2000 FX microscope and high resolution transmission electron microscopy (HRTEM) measurement was carried out with JEOL JEM-3000F microscope (Jeol Ltd., Japan).Power X-ray diffraction (XRD) was done using an X'Pert MRD diffractometer (PANanalytical B.V., The Netherlands).With the help of a JEOL JSM-6335F microscope (JEOL Ltd., Japan), High resolution field emission scanning electron microscopy (FE-SEM) was obtained. Diffuse reflectance UV-Vis spectra (DRS) were recorded on a spectrophotometer varian cary 5000 in the range of 200-800 nm. The mixture of 750 mg GO in 75 mL double-distilled water was heated to under continuous magnetic stirring during 30 min in presence of 750 mL of 1 (w/v) sodium citrate solution.Then 100 mg NaBH4 in 5 mL water were added to the mixture and stirred under heating for other 30 min, then cooled to room temperature and filtered.The resulting solid (rGO) was repeatedly washed with water and ethanol, dried under vacuum at room temperature and kept dry until use.Then, different quantities of hydrated RhCl3 was added to 500 mg rGO in 50 mL double-distilled water under ultrasound condition during 30 min, and subsequently thermal reduction of Rh (III) by H2 atmosphere at 500 o C for 2 h was performed to provide rGO supported Rh NPs with diverse Rh content.The obtained samples, after chemical reduction, were deposited under ambient condition for at least one day before being used as photocatalyst. As it will be discussed below, more oxidation of the Rh occurs due to this exposure to the ambient.By the help of ICP-OES elemental analysis, the Rh content of each sample has been corroborated.Table 1 presents the different studied samples and their respective Rh contents (wt.) . rGO-Rh2O3/Rh photocatalysts was loaded on a photoreactor with a quartz window and a nickel alloy thermocouple.H2 and CO2 were presented in stoichiometric amounts up to achieve a final pressure of 1.5 bar.Prior to irradiation, through employing a heating mantle equipped with thermocouple and controller, the photoreactor was heated at diverse temperatures to reach coveted temperature and when the coveted temperature was stabilized, the photocatalyst was irradiated with a UV-Vis spectrophotometer.Note that approximately 30 minutes was required before temperature stabilization.The initial part of the experiments was when the lamp was switched on.At initial reaction moment, no change has been observed in the gas phase composition.The direct measurement of the reactor gases before CH4 formation was performed by means of GC with two connected channels both with TC detectors and Ar as carrier gas.The channel with MolSieve 5A column could analyze H2, O2, N2 and CO.The ability of our Micro GC apparatus to spot CO using Ar as carrier gas has been checked using certified Abello Linde N2:CO mixtures at diverse concentrations (15, 10 and 5 vol.) (Fig. S1).The second channel with a Pore Plot Q column could analyze CO2, CH4 and up to C4 hydrocarbons.Quantification of the percentage of each gas was rested on prior calibration of the system injecting compounds with recognized percentage of gases."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The applied strategy for preparing the rGO-RhNP nanocomposite is shown in Scheme 1. Initially, the provision of nanocomposite material was performed through a one-pot procedure by reducing Rh 3 ions with H2.During the process hydroxyl groups were formed from the epoxy and carbonyl residues on the rGO planar sheets.The existing hydroxyl and carboxylate groups could function as joining points for the non-covalent attachment (very likely via donor-acceptor interactions) of the Rh nanoparticles to the rGO nanosheets which resulted in a stable composite nanomaterial.The obtained product was easily dispersed in water because of the existence of carboxylic acid groups at the edge of the rGO sheets 81.Representative HRTEM image of the rGO-Rh2O3/Rh nanocomposite is shown in Fig. 1A andB.It was observed that polydisperse globe-like nanoparticles with the size of 5.661.54mn covered nearly the whole GO surface.TEM analysis showed that the metal nanoparticles were just situated on the rGO nanosheets, therefore it could be concluded that the dominant interaction with the oxygen chemical groups was performed at the surface of this 2D nanomaterial.An extremely crystalline feature of the Rh nanoparticles with a crystalline spacing of 0.337 nm was revealed by HRTEM analysis.This crystalline feature could be ascribed to Rh (111) face 82.Moreover, since the rGO sheets folded or rolled, lattice fringes at the nanocomposite edges became visible.The estimated inter-layer spacing of 0.544 nm between neighboring fringes was larger than the interplanar spacing of 0.409 nm in graphite which was assigned to the bulky metal nanoparticles on the basal plane of the reduced graphene oxide sheets 83.As shown in Fig. 1C, energy-dispersive X-ray spectroscopy (EDS) proved the existence of Rh-NPs. The characterization of the graphene derivatives by FT-IR spectroscopy is exhibited in Fig. 2A. a large peak for Reduced GO is exhibited at 3465 cm -1 relative to the stretching of intermolecular H-bonded O-H groups while peaks at 1378 cm -1 and 1208 cm -1 are relative to the stretching of C-OH and C-O-C groups in not oxidized graphitic domains.The existence of oxygen functional groups in this nanomaterial 84 is confirmed through the peaks at 1710 cm -1 (CO) and 1086 cm -1 (O-H).There exists no confirmation for the decoration of rGO with Rh (x) nanoparticles in FT-IR analysis.However, the evident reduction of the intensity of the peaks at 1710 cm -1 and 1208 cm -1 suggested partial reduction with NaBH4 and presence of small content of carbonyl and epoxy groups in the composite nanomaterial.The characterization of the rGO derivatives by Raman spectroscopy is shown in Fig. 2B.The trait of G and D bands are shown by rGO at 1603 cm -1 which is attributed to the in-phase vibration of the graphite lattice and at 1345 cm -1 attributed to the structural disorders at the graphite edges.The G band after being reduced by NaBH4 and decorated with Rh nanoparticles was somewhat shifted to 1607 cm -1 .However, subsequent to this transformation, the D/G intensity ratio enhancement for rGO raised significantly from 0.96 to 1.05 which could be an indication of the metal nanoparticles and the rGO sheets interaction as formerly described for other nanoparticles-rGO 85. Topological analysis results for the nanocomposite performed by AFM in tapping mode are shown in Fig. 2C.Planar morphology with 1.25 nm thickness has been shown for non decorated rGO sheets which was in consonance with that reported for this 2D nanomaterial 84,86.AFM confirmed the existence of metal nanoparticles by exhibiting colloidal structures with a miscellany of sizes ranging from 4.75 nm to 9.22 nm.Moreover, massive nanocomposite were also observed. TEM analysis of Rh-NPs and rGO-Rh2O3/Rh was presented in Fig. 3 C and D respectively that revealed the nanosized Rh-NPs (5.621.8nm) were loaded on the surface of rGO structure.FE-SEM also revealed similar results (Fig. 3).The flat topology feature of the exfoliated rGO sheets was converted into a more complex nanocomposite material, where colloidal nanocomposite were decorated with the Rh nanoparticles. To validate the assignment of the different components of the samples we carried out energy dependent analysis, shown in Fig. 4. By using the change of the photoelectrons' mean free path, as their kinetic energy is changed, we are able to assign the different components in the spectra as originating from the surface or bulk Starting with the O 1s spectrum (Fig. S2 C) it was found that the high binding energy component denoted Rh2O3 decreases less in intensity with increasing photon energy as compared to the component denoted to the oxide surface.This confirms the assignment that the high binding energy component in the O 1s is due to electrons emitted from the Rh2O3.The presence of high resolution Rh peaks, revealed different Rh oxidation states with two components centered at 307.2 eV and 308.4 eV that can be attributed to Rh 0 and Rh III 2d5/2 peaks respectively (Fig. S2 A andB).These binding energies are shifted to higher values compared to those reported in the literature for Rh 0 and Rh III indicating the occurrence of charge transfer from Rh2O3/Rh NPs as electron donor to rGO.Moreover, in the present case, the Rh III is as a minor component of the experimental XPS Rh 2d5/2 peak.Therefore, XPS shows the presence of Rh2O3 by the prominent satellites observed in the Rh 2d5/2 and Rh 2d3/2 peaks.To reconcile both observations, it is worth reminding that while XRD probes the whole sample, XPS only provides information of the outermost nanometers of the metal NPs that are more prone to undergo spontaneous oxidation by exposure to the atmosphere.The presence of Rh2O3 as amorphous material due to its thin dimensions would be undetectable by XRD, while, XPS is useful approach for characterizing crystalline Rh2O3.Therefore, XPS provides two important pieces of information the presence of Rh2O3 on the rGO and the charge transfer from Rh2O3/Rh NPs to rGO, implying a notable interaction between them.It should be reminded that even though the preparation of the Ni-G samples was made by Rh III -rGO at 500 o C for 2 h, the samples were stored under ambient conditions and this should lead to a fast pass from surface with the formation of some Rh2O3 over layers. In a tubular quartz reactor with electrical heating ribbon equipment which allows to heat the reactor at the desirable temperature, photocatalytic experiments for CO2 reduction by H2 were implemented.The photocatalyst was located as a fine millimetric bed on a porcelain crucible under the illuminated reactor zone which was charged with 4to-1 partial pressures of H2 and CO2 at a total pressure of 1.5 bar.Before irradiation with UV-Vis light from a 300 W Xe lamp, the temperature of the photoreactor was stabilized in the absence of light.Pilot experiments for the gas phase reduction of CO2 at 175 o C and 2541 Wm -2 UV-Vis light illumination for examining the photo activity of rGO demonstrated that no CH4 was formed.Then, under the same conditions, a chain of rGO-Rh2O3/Rh photocatalysts containing diverse Rh content were examined for the gas phase CO2 reduction reaction.Both the conditions and results of the experiments are summarized in Table 1.All the samples containing Rh2O3 / Rh NPs were effectual in enhancing photoassisted CH4 formation.Conjectures about the existence of CO especially in proportions above 1 could be ruled.Therefore, it has been surmised that CH4 owed its formation to the Rh2O3 / Rh NPs component which was in line with literature precedents.Thus for ranking the photo activity of different samples, the specific formation rates of CH4 were calculated through dividing the mols of CH4 formed by the mass of Rh and time (mol CH4gRh -1 h -1 ).The formation rate of CH4 raised when the Rh content raised to 18 wt.,reaching a value of 814.35 molgRh -1 h -1 and with this optimum load, a calculated TON per Rh atom of 4.1 were acquired.Giving consideration to this fact that CH4 formation is an eight electrons reduction process, the TON value exhibits that each Rh atom is averagely involved in 45.2 electron transfer events.More increase in Rh content created a deleterious effect in the specific CH4 formation rate, as demonstrated in Table 1 and Fig. 5 (inset). Fig. 5 An ideal loading of Rh on rGO revealed the existence of at least two opposite factors bearing a part in the photocatalytic activity.On the one hand, a rise in the Rh loading on rGO should lessen the internal filter impact of light due to rGO and help light absorption by growing the activity of the material.Thus, decrease in the percentages of rGO is equal to increase in the photocatalytic activity.On the other hand, at the time of rise in Rh loading on rGO, a rise in the particle size distribution and a fall on the percentage of surface Rh atoms (dispersion) should happen that beyond a certain size plays a negative role on the photocatalytic activity.In this regard, higher rGO percentages should assist photocatalytic activity by maintaining Rh particle size small and helping charge separation.Rh (18) -rGO is considered as a compromise between these two opposite effects of both requiring low and high rGO percentage.In order to corroborate the origin of the C source in the CH4 formation and the formation of H2O based on Equation 1, 13 C 18 O2 was employed as substrate and the acquired products were analyzed after 100 min reaction under optimal conditions by GC-MS spectroscopy (Fig. S3).A mixture of 11 of unlabeled 12 CH4 and 89 of 13 CH4, was shown by the analysis revealing that a minor portion of the formed CH4 wasn't derived from the labeled substrate.It is probable that the unlabeled CH4 originated from the C atoms of rGO.A stability test was implemented in order to prove the hypothesis by presenting Rh (18) -rGO sample at 175 o C and 2541 Wm -2 under Ar atmosphere as reaction conditions and measuring the formation of CO2 (Fig. S4). Under the mentioned conditions, a small amount of CO2 was noted to develop for the first 20 h after which, the CO2 amount remained constant, proving first the existence of small amounts of CO2 derived from rGO and second that at long reaction times, the photocatalyst is photostable.However, it should be kept in mind that the absence of CH4 formation in a blank experiment with rGO revealed that the existence of Rh is necessary even for this contribution of unlabeled CH4.In the same experiment employing 13 C 18 O2, H2 18 O was observed (see Fig. S3), proving the formation of H2O in the methanation.CO2 4 H2 CH4 2 H2O G -115 KJmol -1 (Equation 1) Furthermore, the necessity of heating and light for CH4 formation under the present experimental conditions has been confirmed by control experiments because CO2 did not undergo reduction by Rh(18) -rGO upon irradiation at room temperature or in the absence of light at 175 o C by placing the photoreactor under cover of aluminum foil with the light switched on (see data in Table 1).Another different control experiment in which Rh(18) -rGO sample was presented to H2 atmosphere at 175 o C for 4 prior usage as photocatalysts in methanation reaction under light irradiation at room temperature (Table 1) was performed, however, CH4 formation was not observed, suggesting that temperature is performing a different role to photocatalyst activation as it will be discussed below.The obtained results of the above control experiments were in line with those of previous studies 878889.In Fig. 6 the temporal CH4 formation applying the RhNPs-rGO samples at 2541 Wcm -2 irradiation and 175 o C is exhibited.As it is shown there, the initial CH4 formation was stable only during 4 h and the formation rate decreased after 3 h.Fig. 6 depicted the linear fits of the experimental points both at the onset of the reaction (3 h) and at long reaction times (from 10 to 100 h) as red lines.As it is shown there, two diverse slopes can plainly be identified.A quick CH4 formation could be seen at initial reaction times, while the slope turned into a smaller slope at longer times, still constant for 100 h reaction though.XPS measurements after restoration of the applied rGO-Rh( 18) sample from the photoreactor demonstrated that rGO-Rh(18) spectrum at the end of the reaction was much the same as the XPS presented in Fig. 4. Conversely, an increase in the Rh NP size distribution has been shown by FE-SEM image of the Rh(18)-rGO photocatalyst at the end of the reaction(Fig.S5).At the end of the reaction, the mean particle size of the photocatalysts was estimated as 14.32 1.2 nm which was significantly higher than the measured size of the fresh sample (5.62 1.8 nm).The growth in particle size was a general observation when metal NPs were presented to heating at temperatures about 175 o C for prolonged periods.Just as explained before about the effect of Rh loading on rGO on the photocatalytic activity, it was mentioned that large particle sizes of rGO -Rh(23) (7.32 0.97 nm) were deleterious for the photocatalytic activity, reducing CH4 formation rate approximately to the half, because of the lower proportion of active metals exposure at the surface.Thus, the CH4 formation rate was attributable to the protracted process that the Rh2O3 / Rh NPs experienced under the reaction conditions at the initial reaction stage, even though the rate then became stable at least for 100 h. Despite the fact that no conversion has been observed in the XPS spectrum of Rh( 18) -rGO both before and after the reaction, ascertaining the existence of Rh2O3 under the reaction conditions, specifically regarding the reductive conditions and the temperature of the methanation attracted our attention.Having this in mind, the experimental XPS analysis of Rh( 18) -rGO before the reaction was juxtaposed against that measured in situ under the reaction conditions.Therefore, by presenting a Rh(18) -rGO sample to H2 atmosphere at 175 o C for 3 h, the in situ Rh 3d peak in the XPS spectrum without exposure to the ambient has been measured.As can be seen, the corresponding component to Rh 0 (around 307 eV) becomes higher under the reaction conditions in comparison with the sample prior to the reaction.The XPS component related to Rh2O3, however, was larger than that of the Rh metal.Indeed, the relative percentage of Rh 0 in the sample raised from 6.24 to 12.57, for before and under in situ conditions respectively.These measurements were the confirmation for the presence of a thin layer of Rh2O3 despite the reductive conditions, specifically at initial reaction times when the rGO-Rh2O3/Rh photocatalyst showed the highest photocatalytic activity.Therefore, the assumption was that the outermost part of Rh2O3 was in contact with Rh where the reaction occurred.To attain knowledge on the reaction mechanism and the role of Rh in the process, firstly Rh(18)-rGO was located in a sealed reactor, secondly it was exposed to a H2 atmosphere at 175 o C for 3 h and thirdly the sample was allowed to cool down under Ar flow guaranteeing the out and out removal of H2 gas.Afterwards the reactor was just loaded with CO2 and subjected to the general reaction conditions at 175 o C and 2541 Wm -2 illumination.Later than 18 h reaction, a discernible amount of CH4 was measured, indicating the production of Rh-H varieties in the first step, with no need of photoactivation which later were able to develop photoassisted CO2 reduction as stated before 89.As previously mentioned, the photoassisted CO2 reduction by rGO-Rh2O3/Rh needs the amalgamation of heating and irradiation to happen.Therefore, the impact of light intensity and temperature on the photocatalytic reduction reaction of CO2 utilizing Rh(18)-rGO has been studied to certify this dependency.Fig. 6 presents the results. As it is visible in Fig. 6, the specific initial rate of CH4 formation is obviously contingent on the irradiation power, suggesting that, under the current conditions, the CO2 methanation is a photoassisted process.The estimation of quantum efficiency at 175 o C in the photocatalytic reduction of CO2 utilizing the Rh(18)-rGO photocatalyst was 2.55 .Furthermore, the specific initial rate of CH4 formation at stable illumination altered also as a function of the reaction temperature.As stated before, reactions carried out at room temperature led to insignificant CH4 formation initial rate (see last note in Table 1 and footnote f).The photoreactor temperature of 150 o C ended up in CH4 formation rates below 100 molgRh -1 h -1 while temperature of 250 o C ended up in CH4 formation specific rate of 930 mol gRh -1 h -1 .The reliance of the specific CH4 formation rate with the temperature of the system makes provision for estimating an evident activation energy of 45.21 kJmol -1 for the process.By adding probe molecules, a chain of tests were carried out in order to attain knowledge on the mechanism of the photoassisted CO2 methanation advanced by Rh2O3 / Rh -rGO as photocatalyst and, specifically, the potential role of photogenerated electrons and holes. Particularly, a chain of photocatalytic tests were performed by adding compounds with great potentiality to function as electron donors.The assumption is that if charge separation occurs in the mechanism of the photoassisted reaction, the existance of additives that could function as sacrificial electron donor agents to promote or acceptor agents to halt the photocatalytic activity.Hypothetically the thermal methanation mechanism should not be affected by the existence of these electron donor/acceptor additives, at least, in a large extent.Thus, in the presence of dimethylaniline, anisole and p-xylene as electron donors (oxidation potentials of 1.0, 1.5 and 2.0 V vs. Ag/AgCl, respectively) and 4nitrobenzene as electron acceptor quenchers, the photoassisted CO2 reduction utilizing Rh(18)-rGO as promoter was performed.It is noteworthy that based on their boiling points the sacrificial agents were in all cases in the gas phase at the reaction temperature.Visibly the existence of N,N-dimethylaniline (0.2 mmol) raised the specific CO2 reduction initial rate by a factor over 2.25, reaching a value of 1600 mol Rh2O3 / Rh -rGO.Also in the existence of anisole as electron donor, CH4 was produced but at much slower initial reaction rate than in the case of N,N-dimethylaniline in compliance with its higher oxidation potential.By contrast, the existence of p-xylene (oxidation potential of 2.0 V vs. Ag/AgCl) entirely halted the formation of CH4, because this aromatic molecule due to its great oxidation potential doesn't have the ability to quench the holes on Rh(18)-rGO (Fig. 7). Also, CO2 reduction was quenched when nitrobenzene functioning as electron acceptor quencher was added.This happens because of the partial trapping of electrons by nitrobenzene which has lower reduction ability in comparison with CO2.It is noteworthy that explaining any effect of the existence of electron donor/acceptor quenchers at this small concentration is difficult specifically if a photothermal mechanism were functioning.The photoresponse spectrum and Photogeneration of charges and its role in CO2 reduction by rGO-Rh2O3/Rh were in agreement. Remarkably it was seen that the UV light and that filtering UV region ( 350 nm) were exclusively responsible for the photocatalytic activity of rGO-Rh2O3/Rh and irradiating exclusively with visible light resulted in the out-and-out vanishing of the photocatalytic activity.This behavior has certain conformity with the absorption spectrum of rGO-Rh2O3/Rh that, as earlier on mentioned, demonstrated an electronic absorption band in the UV region with onset about 335 nm (Fig. S6).This absorption on the UV region suggested the presence of Rh2O3 on the rGO-Rh2O3/Rh as a negligible component which with absorption by reduced graphene being not responsible for the photocatalysis. Frequently it was seen that photothermal impacts in which light is transformed into heat by the metal NPs happened upon irradiation in the visible and even in the NIR regions 90.By contrast, the necessity of electronic excitation between two energy levels in photoinduced charge separation leads to the production of electrons and holes which is often observed only with UV light.In order to provide support to the generation of charge separation due to the interaction of Rh2O3 / Rh NPs and rGO , transient absorption measurements were performed.So, an Ar-purged rGO dispersion in acetonitrile (1 mgmL -1 ) was presented to 350nm laser pulse excitation and the transient spectrum was obtained at 21 ns (Fig. 8a). As presented in Fig. 8 the intensity of the transient spectrum of the rGO dispersion is similar to a continuous band decreased towards the red part of the spectrum 90.Earlier on this behavior has been noticed in similar graphenic materials and was assigned to the charge separation state declining in microsecond time scale 91.In a second control, commercial Rh2O3 NPs ( 50 nm) from Aldrich was partially reduced in an aqueous N2H2 solution (50 vol) to Rh2O3 / Rh as distinguished by XRD in order to simulate the Rh2O3 / Rh NPs that are present on the Rh2O3 / Rh -rGO samples.Next, the partially reduced Rh2O3 / Rh NPs were dispersed in acetonitrile (1 mgmL -1 ) and the with sacrificial electron donors and acceptors.So, the role of graphene in Rh-rGO systems will be assisting charge separation with migration of electrons from Rh2O3 / Rh to the graphene sheet.The higher photocatalytic activity of Rh-rGO is due to the successful and ideal charge separation .Additionally, a chain of experiments to comprehend the role of the temperature on the photocatalytic process has been performed by adding to the reaction vessel small aliquots of H2O, in the range of the amounts that should be formed in the methanation (Fig. 9). It was adduced that the value of the activation energy calculated from the Arrhenius plot of the logarithm of the relative initial reaction rates with the inverse of the absolute temperature is relatively low for a transition state with bond cleavage, while this value of activation energy is more common for the heat of H2O desorption from the photocatalyst surface.Note that in the 13 C 18 O2 labeled experiments, H2 18 O formation was observed.Accordingly two H2O molecules should be formed from methanation of CO2 based on the stoichiometry (Equation 1) and also these molecules would be preferentially adsorbed on the surface of the photocatalyst at low temperatures, ending in the hampering of the reaction.As presented in Fig. 9, by adding 10, 20 or 30 L of H2O to the reaction media, a deleterious impact on the specific CH4 formation rate, proportional to the amount of H2O is observed.Therefore, the higher the amount of H2O presents at any of the studied temperatures, the lower the specific CH4 formation rate. Thus, it is suggested that temperature in the system favored H2O desorption from the photocatalysts surface, bringing an opportunity for H2 and CO2 activation.Based on the data exhibited in Fig. 4 and the stoichiometry of the reaction, the produced amount of H2O at final reaction times should be equivalent to the addition of about 890 l and that the amount of H2O tested in Fig. 9 is corresponding to the amount produced at the initial stages of methanation.The negative impact of H2O is plainly observed in Fig. 9, even with these relatively low concentrations.Therefore, the deleterious effect of H2O in photomethanation and the propitious effect of the temperature for desorbing the formed H2O from the catalyst surface became apparent.Ultimately, the evaluation of the photocatalytic activity of the Rh2O3 / rGO-Rh catalyst was carried out under constant flow operation.Constant flow is remarkably suitable to test photocatalyst stability and the impact of the contact time on the conversion.In the current study, a total flow of 19.22 mLmin -1 containing a 71.21 of N2, 22.18 of H2 and 6.61 of CO2 was derived through a tubular quartz reactor containing 33.14 mg of the Rh( 18)-rGO photocatalyst loaded on the top of a fritted glass filter inside the reactor. Bearing in mind the volume of the photocatalyst (0.50 ml) and the gas flow, the contact time of CO2 with the irradiated catalysts was 2.7 s.With the help of an electrical heating ribbon which was controlled with a thermocouple, the tubular photoreactor was heated at 175 o C and the irradiation was done utilizing the same light source employed in the earlier experiments, but the light intensity at the photocatalyst was 720.4 Wm -2 .By following the temporal evolution of the constant flow CH4 formation for 3 h, a maximal specific CH4 formation rate of 6.88 Lmin -1 was obtained.However, the rate gradually start declining up to 6.11 Lmin -1 , revealing the occurrence of a certain deactivation.The specific CH4 formation rate of the constant flow was compared with those of the formation rate under batch conditions (Fig. S8).Apparently the loss in CH4 formation rate in the batch reaction was of 21 during for 3 h.In constant flow, however, this activity decline was of 92 for the same period of time.This suggests that the conditions of the constant flow are more auspicious for the stability of Rh(18)-rGO photocatalyst.It is believed that this higher stability of rGO-Rh(18) photocatalyst under constant flow stems from the better removal of H2O from the photocatalyst by the gas flow as this by-product is being formed in the reaction.Furthermore, the calculated quantum efficiency for the constant flow experiments was 0.92 . A N U S C R I P T"
  },
  {
    "title": "Conclusions",
    "content": "Enhancing the photocatalytic activity of conventional semiconductors has attracted the researchers' attention and it has been stated that graphene as a useful additive can be provided to promote the photocatalytic activity.In this current article, it has been demonstrated that Rh2O3 / Rh NPs supported on rGO is an ideal photocatalyst to do methanation of CO2 at temperatures about 175 o C, achieving specific CH4 formation rates of 814.38 molgRh -1.h -1 which is approximately double than that estimated for Rh NPs supported on high surface area silica-alumina and discernible quantum efficiencies of 2.55 .It seemed that the photoinduced electron transfer from excited Rh2O3 / Rh NPs to the graphene sheet is responsible for the positive impact of graphene.Also experimental evidence revealed that the role of the temperature is to desorb the formed H2O which could apparently deactivate the photocatalyst.Thank to the auspicious removal of H2O, photocatalyst deactivation decreased under optimal conditions and constant flow.Mechanistic data utilizing electron donor and acceptor quenchers and observation of rGO charge separated stated quenching by Rh2O3 / Rh NPs confirm that the reaction mechanism involves photogenerated charge separation stem from photon absorption in the UV region. transient spectrum was also obtained upon 350 nm laser excitation (Fig.8a).A negative signal related to the bleaching of Rh2O3 / Rh ground state absorption was detected.Eventually, by adding a small aliquot of the dispersed Rh2O3 / Rh NPs corresponding to 0.5 mg to the rGO suspension (2 mg) in acetonitrile, the transient spectrum at 21 ns upon 350 nm laser excitation (Fig.8a) was recorded.Remarkably, quenching of the signal was observed for the rGO dispersion upon addition of Rh2O3 / Rh NPs, corroborating the interaction of the charge separation state of rGO flakes and the Rh2O3 / Rh NPs.Additionally, at different wavelengths, the transient signals of the rGO, rGO-Rh2O3/Rh and rGO containing Rh NPs were monitored and similar results were obtained for all the wavelengths.The kinetics of the transient signal decline of the three samples monitored at 440 nm is shown in Fig.8b.Note that the sample containing rGO shows a transient decline that can be matched to a single exponential with a lifetime of 23 ns.Fig.S7exhibits the transient decline of the Rh2O3 / Rh NPs dispersion and bi-exponential kinetics with a fast (178 ns) and a slow (13107 ns) component.Upon addition of Rh2O3 / Rh NPs to the rGO suspension, the transient kinetics became faster, determining a lifetime of 22 ns from the single exponential fitting to the experimental points.Quenching of photoinduced rGO charge separation state by Rh2O3 / Rh could bring on a new transient with electrons and holes situated in the different components.Actually, the growth of a new signal as a result of the quenching is not visible due to a weak absorption of these transients.In general, the interaction of photoinduced charge separation state of rGO and the Rh2O3 / Rh NPs have been proved with transient absorption spectroscopy.This interaction of the charge separate state should equally happen in Rh-rGO samples in good compliance with the earlier experiments Figures and Schemes Fig. 2. FT-IR (A), and Raman spectroscopy (B) analysis of rGO (a) and rGO-Rh2O3/Rh (b).Representative AFM analysis (C) of rGO-Rh2O3/Rh nanocomposite. Fig. 3. FE-SEM images of rGO (A), rGO-Rh2O3/Rh (B), TEM images of Rh-NPs (C), rGO-Rh2O3/Rh (D), Fig. 5. CH4 formation using the Rh (18)-rGO photocatalyst at 175 o C and 2542 Wm -2 illumination.18 mg of Rh (18)-rGO and partial pressures of 1.00 and 0.25 bar for H2 and CO2, respectively, were utilized.The inset displays the CH4 formation of the Rh2O3 / Rh-rGO photocatalysts with diverse Rh loading. Fig. 6. Specific CH4 formation rate of Rh (18)-rGO photocatalyst as a function of the light intensity (a) and temperature (b).The entire catalyst amount utilized in the light intensity experiment was of 25 and temperature experiment was 20 mg.Light intensity tests were carried out at a constant temperature of 175 o C, while the light intensity in the temperature dependency experiments was of 2541 Wm -2 .PH2 1.00 bar, PCO2 0.25 bar in all cases. Fig. 7. CH4 formation as function of the sacrificial agent oxidation potential.The CH4 formation rate was measured at 1 h under stable light intensity of 2541 Wm -2 from a 300 W Xenon lamp at 175 o C. PH2 1.00 bar, PCO2 bar. 25 L of each sacrificial agent was added to the reactor vessel in each experiment. Figure 8. Transient spectra (a) and kinetics (b) of Ar-purged rGO (red), Rh2O3/Rh NPs (green) and rGO with Rh NPs (black) suspensions.Laser excitation 350 nm.Acquisition time for rGO and rGO with Rh NPS was 21 ns, and 420 ns for Rh2O3/Rh NPs sample.Transient kinetics monitored at 440 nm. Figure 9. Specific CH4 formation rate measured at different reaction temperatures without (a) or upon addition of 10 L (b) and 20 L (c) of H2O.Reaction conditions involve 2541 Wm -2 , 25 mg of Rh(18)-rGO catalyst and PH2 1.00 bar, PCO2 bar in all experiments Fig. 2. FT-IR (A), and Raman spectroscopy (B) analysis of rGO (a) and rGO-Rh2O3/Rh (b).Representative AFM analysis (C) of rGO-Rh2O3/Rh nanocomposite. Figure 8. Transient spectra (a) and kinetics (b) of Ar-purged rGO (red), Rh2O3/Rh NPs (green) and rGO with Rh NPs (black) suspensions.Laser excitation 350 nm.Acquisition time for rGO and rGO with Rh NPS was 21 ns, and 420 ns for Rh2O3/Rh NPs sample.Transient kinetics monitored at 440 nm. Fig.9.Specific CH4 formation rate measured at different reaction temperatures without (a) or upon addition of 10 L (b) 20 L (c) 30 L (d) of H2O.Reaction conditions involve 2541 Wm -2 , 25 mg of Rh(18)-rGO catalyst and PH2 1.00 bar, PCO2 bar in all experiments.A C C E P T E D M A N U S C R I P T CH4 production rates obtained at 175 o C upon 2541 Wm -2 irradiation using a 300 W Xe lamp.PCO2 0.25 bar for the synthesized catalysts."
  }
]