[
  {
    "title": "Doi",
    "content": "10.1016/j.cej.2020.128077"
  },
  {
    "title": "Article_Title",
    "content": "CsPbBr3 perovskite nanocrystals anchoring on monolayer MoS2 nanosheets for efficient photocatalytic CO2 reduction"
  },
  {
    "title": "Abstract",
    "content": "Photocatalytic CO 2 conversion to valuable fossil fuels has been demonstrated to be a promising approach to reduce emissions of CO 2 and produce renewable energy, which primarily depends on developing the high efficiency of charge separation photocatalysts.Herein, CsPbBr 3 , one typical kind of all-inorganic perovskite nanocrystal, is immobilized on monolayer MoS 2 nanosheets to construct a new and ideal CsPbBr 3 /MoS 2 photocatalyst in the application of CO 2 photoreduction.In comparison with pure CsPbBr 3 , CsPbBr 3 /MoS 2 heterostructures possessed a specific electric field to more efficiently separate charges and generated more active sites for facilitating CO 2 activation, resulting in 3.0 and 2.4 times yields for CO 2 photoreduction to CH 4 and CO, respectively.Detailed characterization methods such as photoluminescence, surface photovoltage spectroscopy and theory calculations indicate the vivid illustrations of photogenerated carries separation which contributes to improving photocatalytic CO 2 conversion efficiency.The present investigation is anticipated to provide a new way for fabricating highly efficient perovskite-based photocatalyst in solar-energy-driven applications."
  },
  {
    "title": "Experimental",
    "content": "Cesium bromide (Cs 2 CO 3 , 99.99), Lead bromide (PbBr 2 , 99.999), 1-octadecene (ODE, 90), toluene (AR, 99.5), Ethyl acetate (AR, 99.5), and tetrabutylammonium hexafluorophosphate (TBAPF 6 , 98) were purchased from Aladdin.Oleic acid (OA, 90) and oleylamine (OAm, 70) were bought from Sigma Aldrich.Monolayer MoS 2 nanosheets were purchased from Nanjing XFNANO Materials Tech Co., Ltd.(thickness: 1.0 nm).Deionized (DI) water was used in all the experiments. CsPbBr 3 nanocrystals (CPB NCs) were prepared by a facile sonication approach.Briefly, 0.6 mmol PbBr 2 and 0.2 mmol Cs 2 CO 3 powders were put in 20 mL glass bottle.Subsequently, 10 mL of ODE, 1 mL of OA, and 1 mL of OAm were added.Then, the mixture was subjected to a tipsonication (Scientz JY92-IIDN, China) at the power of 180 W for 15 min.After complete reaction, the solution was naturally cooled down to room temperature, the excess ligands and precursors were removed by centrifugation at 9000 rpm for 10 min, the precipitate was redissolved in 10 mL of toluene.Then, the solution was centrifuged at 2000 rpm for 5 min to remove the sediment and retained the upper small CPB NCs. CPB/MS composites were obtained by a facile self-assembly approach.A certain amount of monolayer MoS 2 nanosheets powder were directly added into CPB/toluene solution, treating with the bath sonication for several minutes and stirred for 1 h.Then, the CPB/MS composites were precipitated by centrifugation and dried under vacuum at ambient temperature. The morphology, element mapping and HRTEM were measured by Transmission Electron Microscope (TEM, JEOL 2010F).The crystal structure of product powder was investugated by X-ray diffraction (XRD) (Bruker, D2 PHASER, Germany) using Cu-K radiation with 2theta degree from 13 to 60.The absorption behaviors of powders were recorded on the UV-vis spectrometer (JASCO V-770).Fluorescence spectra were measured by fluorescence spectrometer from 400 to 650 nm with excitation wavelength of 365 nm (RF-6000, Shimadzu).The PL decay time profiles were measured by a fluorescence lifetime spectrometer (Quantaurus-Tau C11367-11, Hamamatsu).Raman spectra were measured by a Renishaw InVia Raman microscope from a range 50 to 600 cm -1 (INVIA, Renishaw plc, UK).X-ray photoelectron spectroscopy (XPS) data were measured by a K-Alpha XPS system (Thermo Fisher Scientific, UK).Surface photovoltage (SPV) spectra were measured by a CEL-SPS 1000 (Beijing China Education Au-light Co., Ltd., China).Transient surface photovoltage (TPV) spectra were performed on a CEL-TPV2000 instrument (Beijing China Education Au-light Co., Ltd., China).The CO 2 temperature-programmed desorption (CO TPD) experiments of photocatalysts were performed on a DAS-7000 multifunction catalyst analysis system (China Hunan Huasi Technology Co., Ltd.). Photoelectrochemical characterizations were measured by a threeelectrode cell (CHI 760E, Shanghai Chenhua) with the assembled photoelectrodes (1 mg mL -1 CsPbBr 3 or CPB/MS composite toluene solution with 10 L Nafion on 1 2 cm glass carbon electrode) as working electrode, Pt mesh as counter electrode and Ag/AgCl electrode as reference electrode.0.1 M tetrabutylammonium hexafluorophosphate (TBAPF 6 )/ethyl acetate solution was used as electrolyte.Photocurrents were tested under irradiation of 300 W Xe lamp (PLS-SXE300D, Beijing Perfectlight Technology Co., Ltd) was used as the light source, and the light density was 200 mW cm -2 .Electrochemical impedance spectra (EIS) were measured in dark and under light illumination at -0.4 V.The frequency region of 0.01-10 5 Hz with AC voltage of 50 mV. Experiments for photocatalytic CO 2 reduction were performed in mL sealed Pyrex bottle.Briefly, 5 mg of photocatalyst, 5 mL of ethyl acetate and 20 L of deionized water were added into the bottle.In this reaction system, ethyl acetate was chosen as reaction solvent owing to its mild polarity for stabilizing CsPbBr 3 and high solubility of CO 2 .Then, the mixture was sealed and degassed O 2 by CO 2 , and the whole reaction system was filled with high pure CO 2 (99.999) and the final pressure of CO 2 was 101 KPa.300 W Xe lamp (PLS-SXE300D, Beijing Perfectlight Technology Co., Ltd) with 420 nm filter was used as the visible light source, and the light intensity was calibrated to 200 mW cm -2 .The gaseous products were analyzed using a gas chromatograph (GC-2014c, SHIMADZU, Japan) with a flame ionization detector (FID) for CH 4 and CO detection and a thermal conductivity detector (TCD) for H 2 and O detection.High purity N 2 (99.999) and H 2 (99.999) were used as carrier gas.The chromatographic column temperature was rised from to 170 C during 17 min for detection.Blank experiments were also carried out in the visible light without photocatalyst."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The monolaryer MoS 2 nanosheets were purchased from commercial supplier (Nanjing XFNANO Materials Tech Co., Ltd.).CsPbBr 3 nanocrystals were synthesized by a facile sonication approach.First of all, the morphologies of CsPbBr 3 , MoS 2 , and CPB/MS were investigated by TEM and EDX elemental mapping.Fig. S1a shows the MoS 2 with dispersive sheet-like structure and the size of 20 500 nm.Simultaneously, the HRTEM images of MoS 2 and CsPbBr 3 (Fig. S1b andc), the lattice fringes of 0.62 and 0.24 nm are observed respectively, which are corresponded to the (0 0 2) and (2 1 1) lattice planes of MoS 2 and CsPbBr 3 , respectively 31,32. The CsPbBr 3 nanocrystals were assembled on monolayer MoS nanosheets through the self-assembly method (Fig. 1), obtaining the heterostructure of CPB/MS.As shown in Fig. 2a, CsPbBr 3 nanocrystals with size about 5 nm were well dispersed on the surface of MoS nanosheets.The HRTEM images further showed that small CsPbBr nanocrystals with 0.24 nm lattice fringes and sheet-like of MoS 2 with 0.62 nm lattice fringes (Fig. 2b).Obviously, the CsPbBr 3 nanocrystals were distributed evenly on MoS 2 from the STEM image in Fig. 2c.To further verify the different components of CPB/MS composites, EDX elemental mappings of Mo, S, Cs, Pb and Br were investigated by STEM. As shown in Fig. 2d-h, the yellow and cyan area are well matched with the shape of MoS 2 , while the red, green and blue color match with the position of CsPbBr 3 .These data clearly indicated that small CsPbBr 3 nanocrystals are well immobilized on MoS 2 nanosheets in CPB/MS hybrids. To acquire more insights of individual CsPbBr 3 , MoS 2 and their heterostructures, Raman and XPS measurements were used to study CsPbBr 3 , MoS 2 , and CPB/MS.Fig. 3A exhibits two peaks for the pristine CsPbBr 3 at 106.9 and 125.4 cm -1 which were severally ascribed to the vibrational mode of PbBr 6 octahedra and relative motion of Cs ions with PbBr 6 octahedra 33,34.For pure MoS 2 , three peaks at 377.7, 405.5, and 451.8 cm -1 that were assigned to the in-plane Mo-S phonon mode (E 2g ), out-of-plane Mo-S phonon mode (A 1g ), and E 1u 30,31.In CPB/MS, the signals of MoS 2 and CsPbBr 3 were both detected.Beside, from the Raman spectra, we can find that the peaks of MoS 2 in CPB/MS exerted a slight shift compared with those of pristine MoS 2 , which demonstrated that CsPbBr 3 nanocrystals are adequately integrated with MoS 2 nanosheets 35,36. The chemical element compositions, valence states and interaction in CsPbBr 3 , MoS 2 , and CPB/MS could be researched via XPS 37.Cs 3d, Br 3d, Pb 4f, Mo 3d and S 2p of high resolution XPS spectra for these samples were obtained.As shown in Fig. 3B-F, the spectra of pristine CsPbBr 3 , the binding energies at 724.1 and 738.1 eV, 67.9 and 68.9 eV, and 138.0 and 142.8 eV were one-to-one corresponding to Cs 3d 5/2 and Cs 3d 3/2 , Br 3d 5/2 and Br 3d 3/2 , and Pb 4f 7/2 and Pb 4f 5/2 , respectively 20.As shown in Fig. 3E, in pure MoS 2 , the spectrum of Mo 3d exhibited four dominant peaks at 226.5 229.3, 232.5 and 235.4 eV which are respectively attributed to Mo 3d 5/2 and Mo 3d 3/2 .The apparent shoulder Mo 6 3d 3/2 at 235.4 eV, which are attributed to mild oxidation of the molybdenum ions (Mo 4 to Mo 6 ) 38.Meanwhile, two peaks detected in S 2p at 162.2 and 163.3 eV should be assigned to S-Mo bonds and S 2p 1/2 28,35.Apparently, all peaks above could be observed in CPB/ MS, while the peaks of CPB/MS manifested positive shifts compared with single component CsPbBr 3 , and slight negative shifts contrasted to pristine MoS 2 .Generally, the shifts of binding energy in the hybrid material are due to their interfacial interactions 39.Hence, these shifts in CPB/MS provided a further evidence that effortless charge transfer between CsPbBr 3 and MoS 2 caused the tight interaction of two components. X-ray diffraction (XRD) partterns further confirm the the crystal structures of samples.As shown in Fig. 4A, the diffraction peaks of CsPbBr 3 well matched with the standard pattern of CsPbBr 3 .For pure MoS 2 , a weak signal at 14.0 was observed, which is attributed to (0 0 2) crystal planes of MoS 2 31.For CPB/MS composite, all detected peaks were consistent with those of pure CsPbBr 3 and MoS 2 , indicating the successfuly conbination of CsPbBr 3 with MoS 2 .Moreover, UV-vis diffuse reflectance spectroscopy (UV-DRS) was used to analyze the optical properties of three samples (Fig. 4B).The pure CsPbBr 3 shows an obvious visible light absorption with the edge at ca. 520 nm 24, whereas single MoS 2 displays broad absorption in whole visible region.For CPB/MS hybrids, both optical properties of CsPbBr 3 and MoS 2 are observed, suggesting that CPB/MS have potentially ability to reduce CO 2 under visible light irradiation. To evaluate the performance of CO 2 photoreduction, pristine CsPbBr 3 and CPB/MS with different load of MoS 2 were applied as photocatalysts into 3 h photoreactions in ethyl acetate with trace water solution using visible light illumination.As shown in Fig. 5a, with the weight raito (wt) of MoS 2 in CPB/MS increasing from 0 to 5.0, the yields of CH 4 and CO were tested.When the introduction of MoS 2 was 1.0 wt, CO achieved the highest yield of 74.9 molg -1 , which was 2.4 times higher than that of pure CsPbBr 3 .The highest yield for CH 4 was 54.7 molg -1 at 1.5 wt.And the yields of CH 4 and CO for pristine MoS 2 were only 3.3 and 4.6 molg -1 , respectively.For comparison, other recent reported works of CO 2 reduction by using metal halide perovskites as photocatalysts were summarized.As shown in Table S1, optimal photocatalyst CPB/MS (1.0 wt) could attain conversion rates of CO and CH 4 to 25.0 and 12.8 molg -1 h -1 in ethyl acetate system, which is superior to the most reported metal halide perovskite.The results indicate that the integration of monolayer MoS 2 nanosheets with CsPbBr 3 nanocrystals is a potential material for photoreaction of CO 2 . It's well-known that instability of all-inorganic perovskite under long-term illumination is one of the critical limitations for the application of photocatalysis 40,41.This work evaluated the photostability of CPB/MS by cyclic experiments of photocatalytic reduction CO 2 reaction.As shown in the Fig. 5b, the stability of CPB/MS was evaluated by cyclic experiments for three runs and each run for 10 h.And the curve shows that CPB/MS could keep remarkable stability in the photoreduction of CO 2 .Compared with the first cycle (348.7 and 124.1 mol g -1 ), the conversion yields for CO 2 to CO and CH 4 slightly decreased ca.3.4 and 9.1 after three cycles (336.8 and 112.8 mol g -1 ).The slight decrease is ascribed to the consumption of photons in the reaction of long-term photoreduction.Additionally, the TEM images and XRD patterns of CsPbBr 3 and CPB/MS exhibit no apparent change before and after 30 h photocatalytic reactions (Fig. S2, S3 and S4), which manifests that there is no obvious destruction of CPB/MS structure after the photocatalysis.In a word, CPB/MS show a high performance in the aspect of stability as photocatalysts.And the summary of recent studies displayed in Table S1 illustrated that optimal CPB/MS possess a remarkable photocatalytic and photostability performance employed in photoreduction CO 2 , outperforming numerous reported studies of perovskite-based materials.Moreover, in order to demonstrate that the products of CO and CH 4 are originated from the photocatalytic CO 2 reduction, the isotope labelling experiments with 12 CO 2 and 13 CO 2 were carried out by gas chromatography/mass spectrometry (GC/MS) analysis (Fig. S5), which indicated that the 12 CO (m/z 28) and 12 CH 4 (m/z 16) were from 12 CO 2 , and the 13 CO (m/z 29) and 13 CH 4 (m/z 17) from 13 CO 2 . In general, high ratio of charges separation is a key issue for photocatalytic CO 2 reduction.Photo-electrochemical experiments of photocurrent responses and electrochemical impedance spectra (EIS) were firstly studied.As shown in Fig. 6a, CsPbBr 3 and CPB/MS modified electrodes manifest a fast and repeatable photocurrent response with cycling visible light-source on/off.In detail, a higher photocurrent response of CPB/MS (0.2 A cm -2 ) was detected than that of pristine CsPbBr 3 (0.05 A cm -2 ), which resulted from a better ability of charges separation and transfer in CPB/MS 42.Moreover, EIS spectra was carried out to evaluate the charge-transport behaviors of CPB/MS.Fig. 6b shows that the diameter of arc of CPB/MS under light irradiation is much smaller than this as-synthesized samples used in dark condition.Meanwhile, both of them were smaller than those of CsPbBr 3 in dark and under light irradiation, respectively.The smaller diameter accounts for the lower charge transfer resistance and the better mobility of electrons, revealing that CPB/MS possessed an outstanding charges transfer efficiency under visible light irradiation 43.Photoluminescence (PL) spectroscopy has been widely applied as a method to directly examine the interfacial charge separation of semiconductor heterostructure 44,45.Consequently, steady-state PL spectra together with time-resolved PL decay of CsPbBr 3 and CPB/MS were investigated.As Fig. 7a showing, pure CsPbBr 3 had the emission peak at 509 nm, while the intensity PL emission peak of CPB/MS was quenched at ca. 82.7 than that of pure CsPbBr 3 .This quenched PL emission intensity represents the lower recombination rate of charges 46, which suggested that the introduced MoS 2 bring an electron transfer channel for the charge separation of CsPbBr 3 29,47. To get the detailed information of charges separation, the photogenerated carriers dynamics of CsPbBr 3 and CPB/MS were further measured.As depicted in Fig. 7b and Table 1, the PL lifetime of pure CsPbBr 3 consists of a shorter lifetime ( 1 : 3.01 ns, 84.4) and a longer one ( 2 : 21.0 ns, 15.6).Meanwhile, based on the PL results, 1 and 2 of CPB/MS decreased to 2.53 ns (84.5) and 15.8 ns (15.5), respectively.Generally, the photogenerated electrons recombine with holes through radiative and non-radiative pathways.A trapped electron recombines non-radiatively with the localized hole, while a delocalized electron recombines radiatively with the localized hole 47.In our case, the long-lifetime and short-lifetime components of CsPbBr 3 and CPB/MS can be assigned to the photogenerated electrons by radiative and nonradiative recombination pathways with localized holes, respectively 47, resulting in the radiative recombination lifetimes of CsPbBr 3 and CPB/MS are 21.0 and 15.8 ns, respectively.In accordance with the calculations, the average lifetimes ( av ) of pristine CsPbBr 3 and CPB/MS were 5.82 and 4.58 ns independently.Such shorter av confirms again the existence of charge transfer channel for the efficient charge separation in CPB/MS heterostructures, where the active carriers are transferred rapidly 23,29. Surface photovoltage (SPV) spectroscopy technology is an another convincing method to reveal the charge separation of semiconductor, in which the signal originates from the change of surface potential barrier before and after light irradiation 48,49.Widely accepted, generated electron-hole pairs are immediately separated by the built-in electric field, leading to a fast SPV response 50.A stronger SPV identifies the higher efficiency of the charge separation 51.Fig. 7c displayed the SPV spectra of pure CsPbBr 3 and CPB/MS samples.In contrast to single CsPbBr 3 , CPB/MS arose as a much higher SPV response in the range of 300-550 nm.Such solid evidences demonstrate that the higher efficiency of visible light-induced charge separation occurred in CPB/MS than that in pristine CsPbBr 3 . Furthermore, transient state photovoltage (TPV) spectrum was shown in Fig. 7d.Both two samples manifested positive TPV response, while CPB/MS owned a higher and longer lifetime of TPV response, which deduced that positive photogenerated holes collected on the surfaces of the testing electrode were produced in the CsPbBr 3 52.The larger TPV response indicated that CPB/MS possessed a wider spacecharge region for charges diffusion process, giving rise to the excellent photocatalysis performance 53. An in-depth analysis was calculated by density functional theory (DFT) theory calculations to study the electrons transfer on the interfacial interaction of CsPbBr 3 with MoS 2 , and the causations of the superior activity of CPB/MS for CO 2 adsorption and reduction.Fig. 8a shows that there is a covalent bond formed between CsPbBr 3 and MoS 2 , indicating a high charge density.Particularly, the covalent bonds generation of Pb-S covalent bonds were observed notably in the interface.Owing to the generation of Pb-S covalent bonds, which will be acted as the channel of direct electrons migration, we further proceeded the charge density difference analysis of CPB/MS.Fig. 8b depicts that electrons migrated from S atoms in MoS 2 were significantly accumulated on the surface of CsPbBr 3 .Owing to the difference of electronegativity between S and Pb elements, it is reasonable to produce a directional The two-exponential decay curves were fitted using a non-linear least-squares method with a two-component decay law.The average lifetime ( av ) was then determined using the equation: channel of electron transfer.These results consisting with the data of XPS, PL and TPV demonstrate the subsistence of effective electrons transfer paths stemmed from the strong interaction in the interface of CsPbBr 3 and MoS 2 .What's more, the photocatalytic reduction of CO 2 pathways with CsPbBr 3 and CPB/MS were investigated as the form of Gibbs free energy (G) in Fig. 8c.Firstly, CO 2 molecules were adsorbed and activated on these catalysts surfaces, the CO 2 adsorption energy of CPB/MS was -0.28 eV, which was more negative than that of CsPbBr 3 (-0.25 eV), indicating that CO 2 adsorbed on CPB/MS is stronger than that of the pristine CsPbBr 3 , following the process of proton-coupled electron transport which formed COOH by photogenerated electrons 54,55.Compared with single CsPbBr 3 , the G barrier of CPB/MS is 0.45 eV lower than that of CsPbBr 3 .The exhibited G demonstrates that the introduction of MoS 2 benefited the breakage of CO bonds in CO 2 , which decreased the reaction energy and conduced to a smooth CO 2 reduction to CO.The produced electrons transfer channel at the CPB/MS interface gave rise to the improved reaction rates via facilitating CO 2 adsorption and activation.To study the CO 2 adsorption abilities of CPB/ MS, the CO 2 -TPD experiments were carried out.As shown in the CO 2 -TPD profiles (Fig. S6), the addition of MoS 2 obviously enhanced the CO 2 adsorption and decreased the desorption temperature from 481.5 C to 455.4 C, comparing with that of pristine CsPbBr 3 56. Accordingly, the possible mechanism of the photocatalytic reduction of CO 2 on CsPbBr 3 /MoS 2 is proposed, which is shown in Fig. 9. Firstly, the band positions of CsPbBr 3 and MoS 2 are illustrated as a diagram shown in Fig. 9a.The diagram reveals that conduction band (CB) and valence band (VB) of CsPbBr 3 are -3.10 and -5.50 eV, and MoS 2 are -4.23 and -6.19 eV versus vacuum level, respectively, which exhibits a type II band alignment 40,57.As shown in Fig. S7, the bandgap of pristine CsPbBr 3 (2.40 eV).Firstly of the whole photocatalysis, when CsPbBr 3 and MoS 2 were excited after illuminated by visible light, photogenerated electrons were produced from VB to their CB.The difference of the Fermi levels between MoS 2 and CsPbBr 3 contributed to separate the photogenerated charges and prompt the electrons transfer from perovskite to monolayer MoS 2 nanosheets 29, which bring about an enhanced photocatalytic performance.The possible mechanism for CPB/MS photocatalytic CO 2 reduction was shown in Fig. 9b. Based on the potential CO 2 /CO and CO 2 /CH 4 pairs versus NHE at pH 0 13 from the following Eqs.( 1) and (2): CO 2 8H 8e -CH 4 H 2 OE 0 redox 0.17 V The valence band (VB) potentials of CsPbBr 3 is -5.50 eV and MoS 2 is The more positive potential from thermodynamics suggests that CO 2 with adsorbed H 2 O can be reduced to CO and CH 4 by electrons from photo-excited CPB/MS (Fig. 9).As the above discussion of DFT calculation, the breaking of C--O bonds in CO 2 and decreasing of reaction energy barrier were facilitated by the decoration of MoS 2 , following that hot electrons from CPB/MS would couple with protons and reduce the adsorbed CO 2 molecules to CH 4 and CO more easily.Accordingly, the effective electron-proton coupling reaction cooperated with rapid charges transfer contributes to the higher efficiency of photocatalytic CO 2 conversion."
  },
  {
    "title": "Conclusions",
    "content": "In summary, it is the first time to assemble CsPbBr 3 nanocrystals on monolayer MoS 2 nanosheets to construct a heterostructure for CO 2 photoreduction, which shows an efficient photocatalysis performance.Compared with pure CsPbBr 3 , 3.0-and 2.4-fold enhancements were achieved by the optimal CsPbBr 3 /MoS 2 (CPB/MS) heterostructure for photoreduction of CO 2 to CH 4 and CO under visible light illumination, respectively.Owing to the strong interaction of Pb-S which worked with the electron transfer channel at the interface of CPB/MS, the photogenerated electrons from excited CsPbBr 3 were rapidly transferred to the nearby MoS 2 .Such effective charge separation contributed to an extraordinary CO 2 photoreduction performance.Furthermore, CPB/MS were found rather stable in ethyl acetate systems, which profited from the recirculation mechanism of hole-electron pairs.These significant features are expected to provide a new way to construct a highperformance perovskite photocatalyst via introducing MoS 2 for the applications in solar energy conversion and artificial photosynthesis. Fig. 1.Schematic illustration of synthestic route of CPB/MS composites. Fig. 2. TEM (a), HRTEM (b), STEM (c) images of CPB/MS composites; EDS elemental mapping of Cs (d), Pb (e), Br (f), Mo (g), and S (h) of CPB/MS composites. Fig. 3. Raman spectra (A) and XPS spectra of Cs 4f (B), Br 3d (C), Pb 4f (D), Mo 3d (E) and S 2p (F) of CsPbBr 3 (a), MoS 2 (b) and CPB/MS (c). Fig. 4. XRD patterns (A) and UV-DRS (B) of CsPbBr 3 (a), MoS 2 (b) and CPB/MS (c). Fig. 5.The effect of different ratio of MoS 2 loads on CsPbBr 3 for photocatalytic activity (a) and the stability test on CPB/MS photocatalytic CO 2 reduction (b). Fig. 6.(a) Photocurrent responses of CsPbBr 3 and CPB/MS modified electrodes with visible light on/off.(b) EIS spectra of CsPbBr 3 and CPB/MS modified electrodes under visible light irradiation and dark conditions. Fig. 7. PL (a) and decay PL (b) spectra of CsPbBr 3 and CPB/MS with the excitation at 365 nm.SPV (c) and TPV (d) spectra of CsPbBr 3 and CPB/MS samples. Fig. 8. Electronic localization function (ELF) (a) and charge density difference (b) at the contacting interface of CPB/MS.(c) Gibbs free energy (G) diagrams of photocatalytic reduction of CO 2 reaction process. 19 eV, indicating the holes could oxidize H 2 O to O 2 and H through the half-reaction:25 -2e -1/2O 2 2H E 0 redox 1.23 V Time-resolved PL decay parameters of CsPbBr 3 and CPB/MS with 365-nm excitation. This work has been supported by the Guangdong Basic and Applied Basic Research Foundation (No. 2020B1515020038 and 2020A1515011424), the Pearl River Talent Recruitment Program of Guangdong Province (2019QN01L148), and the Jiangsu Provincial Nature Fund Youth Fund Project (No. BK20190640).The authors also thank to Beijing China Education Au-light Co., Ltd. for the assistance of SPV and TPV measurements. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://doi. org/10.1016/j.cej.2020.128077."
  }
]