[
  {
    "title": "Doi",
    "content": "10.1016/j.jcou.2018.06.009"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic conversion of gas phase carbon dioxide by graphitic carbon nitride decorated with cuprous oxide with various morphologies"
  },
  {
    "title": "Abstract",
    "content": "Submicron cuprous oxide (Cu 2 O) crystals with various morphologies were successfully fabricated and incorporated with graphitic carbon nitride (gCN) to evaluate their activity for gas phase CO 2 photoreduction under visible-light illumination.Both the morphology of Cu 2 O and the composition of copper species were tunable and were significantly affected by the presence of gCN.The morphology of Cu 2 O influenced the band structure and optical property, as well as the efficiency of photo-induced charge transfer within each sample.The compositions of Cu 2 OgCN before and after illumination were compared to evaluate the photostability of samples.In addition to the majority of Cu 2 O crystals, other copper species, CuO or metallic Cu, were presented and considered as the assistance for CO 2 adsorption or interfacial charge transfer.Improved conversion of CO 2 to CO was achieved by combining n-type gCN and p-type Cu 2 O crystals with an optimum surface composition, and by selecting the Cu 2 O crystals with higher photostability."
  },
  {
    "title": "Experimental",
    "content": "Melamine (99), anhydrous copper(II) chloride (CuCl 2 ; 98) and hydroxylamine hydrochloride (NH 2 OHHCl; 99) were purchased from Alfa Aesar.Sodium hydroxide (NaOH; 97) was acquired from Showa.Sodium dodecyl sulfate (SDS; 99) and 5,5-dimethyl-1-pyrroline Noxide (DMPO, 97) were supplied from Sigma Aldrich.All chemicals were reagent grade without further purification.Distilled water (18.3 M) was used for all aqueous solution preparation. The precursor of melamine (5 g) decanted in a half-covered crucible was directly heated to 550 C for 3 h under static air in a muffle oven.The pale-yellow powder was obtained after grinding the resultant product with an agate mortar.The gCN powder was then obtained after water-washing, centrifugation and vacuum-drying at 100 C. The procedures revealed by Huang et al 41.were applied and modified to synthesize Cu 2 O particles.In a typical batch to synthesize Cu 2 OgCN, CuCl 2 solution (100 mL, 0.1 M) was mixed with 1 g gCNcontained aqueous solution (1600-1800 mL), followed by ultra sonication for 10 min to well disperse gCN and assist the adsorption of Cu 2 ions on gCN.A vigorous stirring was then applied to mix SDS (17.4 g) with the above solution.Next, NaOH (36 mL, 1 M) was introduced into the mixture and continued stirring.Cu(OH) 2 was then obtained while the solution turned light blue.As different shapes of Cu 2 O could be obtained by altering the volumes ratio of H 2 O to NH 2 OH-HCl, various amounts (80-200 mL) of 0.1 M NH 2 OH-HCl solution were stir-mixed with the above mixture at a temperature-controlled water bath (28-30 C) for at least 1 h.While the color of the solution changed from light blue to clay orange, the crystal of Cu 2 O was produced on gCN.The Cu 2 OgCN composites were then obtained after being washed by H 2 O/ ethanol, filtered, and dried in a vacuum oven at 30 C overnight.The sample name was decoded xCu 2 OgCN, where x (c, d, s) indicated the shapes (cube, all-corner-truncated rhombic dodecahedral, or sphere) of Cu 2 O formed on g-CN. The X-ray diffractometer (XRD, Bruker D8 SSS) using Cu K radiation ( 0.154178 nm) at 40 kV and 35 mA was employed to identify the crystallinity of samples.Infrared spectra of samples were recorded by using a Fourier transform infrared (FTIR) spectrophotometer (Nicolet Protege-460).The morphology of composites was observed via a scanning electron microscope (SEM, Jeol JSM-7401 F) operating at an accelerating voltage 3 kV and a transmission electron microscope (TEM, Jeol JEM-1400) operating at an acceleration voltage of 120 kV.The chemical composition of each sample was investigated by an X-ray photoelectron spectroscope (XPS, Ulvac-Phi 5000 VersaProbe) using Al K radiation.XPS valence band spectra obtained at lower binding energy region were applied to estimate the valence band edge of samples.The UV-vis diffuse reflectance spectra of powder samples were acquired on a spectrophotometer (Jasco V-650) equipped with an integrating sphere (ISV-722).The photoluminescence (PL) of samples were probed on a fluorescence spectrophotometer (Hitachi F-7000) using an excitation wavelength of 350 nm.Each sample before PL measurement was vacuum dried overnight to reduce the influence of water adsorption on PL.A high-resolution surface area and porosimetry analyzer (MICROMERITICS, ASAP2020) was utilized to determine the BET surface area of samples.Electron paramagnetic resonance (EPR) spectra of samples were obtain on a spectrometer (Bruker EMX-10/12) equipped with an SHQE cavity.All EPR spectra of samples at ambient condition were recorded at a resonant frequency around 9.8 GHz.In order to identify the radicals generated from illuminated sample, each sample suspension was mixed with the spin trap (DMPO) solution just before EPR measurements.The fresh stock solution contained each sample and the DMPO with a concentration of 40 ppm and 2000 ppm, respectively.For each run, 1 mL of the stock solution was withdrawn into a Suprasil aqueous flat cell (Wilmad, TE-102).The EPR spectra were recorded upon the irradiation of the sample-filled standard cell in the cavity.The in-situ illumination system was a 150-Watt Xenon lamp (Labguide, Xe-150). The photocatalytic reduction of CO 2 was conducted in a batch reactor (300 mL) at ambient temperature.After sprinkling vacuum-dried powder sample (1 g) on the bottom of the glass reactor, the reactor was covered with a double manifold glass lid with an opening outlet and placed in a vacuum oven at 30 C for 1 h to remove gaseous impurity from the reactor.High purity CO 2 (99.999) was then purged through a water bubbler at room temperature into the reactor at a flowrate of 60 mL per min for 30 min.The outlet and inlet of the reactor were then closed and ready for the illumination.Three LED light bulbs (Philips, 14 W) were placed symmetrically outside the reactor to provide the radical illumination.The emission spectrum of this LED light bulb shown in the inset of Fig. 1 indicated visible light-only irradiation.A gas chromatography (YL Instrument, YL6500) equipped with a highly sensitive pulsed-discharge helium ionization detector (PDHID) was employed to analyze the products of photoreduction.The carrier gas was He, and two separation columns from Ohio Valley Specialty, including Porapack N for the detection of H 2 , O 2 , CO and CH 4 , and Molecular Sieve 5 A for CO 2 , H 2 O and other C 1 -C 2 hydrocarbons, were connected in series to simultaneously analyze all possible products from one injection.The volume of each injection was 1 mL of gas product withdrawn from the photoreactor by a gas-tight syringe."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The chemical structure of gCN was examined by FTIR and XPS analysis.The characteristic stretching vibration mode of CN groups at 1643 and 1558 cm -1 and CeN stretching at 1242, 1319 and 1404 cm -1 were observed from the FTIR spectrum of gCN depicted in Fig. 1(a) 17.The appearance of the peak at 810 cm -1 suggested the presence of triazine ring of gCN 5,12.A broad band in the range of 2900 to 3300 cm -1 corresponded to the stretching vibration modes of terminal NH or NH 2 groups 17.The XPS spectra of gCN in C1s region was shown in Fig. 1(b).The characteristic carbon species of gCN, including sp-bonded C in N-containing aromatic rings (NCeN) and sp 2 graphitic carbons C-(N) 3 and CeC, appeared at the binding energy of 288.0 eV, 286.0 eV and 284.7 eV, respectively 17,424344.The weak peak centered at 293.5 eV was originated from the components of NeCeO, indicating partial oxidation of gCN structure with lower polymerization degree 45. Tese components can also be identified from O1s spectrum at the broad peak centered at 529.8 eV as shown in Fig. 1(c).Other two deconvoluted O1s peaks suggested the presence of surface OH groups (531.4 eV) and surface adsorbed H 2 O (533.7 eV) 11,44,45.Based on XPS results, the molar concentration of O on gCN was 4.3 and the composition of those oxygen-contended functional groups from low to high binding energy was 61, 30, and 9, respectively.Rather than the presence of abundant oxygen functional groups on previously synthesized graphene oxide or reduced graphene oxide by our group, the tri-s-triazine units in gCN ensured the majority of nitrogen and carbon components.The deconvoluted XPS spectrum in N 1s region (Fig. 1(d)) revealed the major peak at 398.7 eV, which is corresponding to CeNC in the triazine ring.Other peaks, which were originated from the tertiary nitrogen group (Ne(C) 3 ), amino group (NeH) and - excitation, were also presented at 400.4 eV, 401.6 eV and 404.4 eV, respectively 11,17,42,464748. With the addition of Cu 2 O crystals, the peak position of intrinsic triazine building units (NC-N) at 288.0 eV (or CeNC at 398.7 eV) remained as presented in Fig. 2a andb.However, the relative intensity of trizaine groups on xCu 2 OgCN was decreased comparing to pure gCN as the presence of Cu 2 O on gCN.Based on the deconvoluted C1 s spectra of xCu 2 OgCN, the concentration of N CeN decreased from 70.3 for gCN to 62.4 for dCu 2 OgCN, 52.6 for cCu 2 OgCN, and 52.0 for sCu 2 OgCN, respectively.Notably, the partial oxidized peak (NeCeO) at 293.5 eV was not detectable from each xCu 2 OgCN.The XPS spectra of Cu 2 O crystal in Cu 2p region were plotted in Fig. 2c as well as the deconvoluted peaks of Cu core levels of 2p 1/2 and 2p 3/2 .Cu species were the major components of each sample according to the presence of intense peaks centered at 932.4 eV and 952.3 eV 16,17,49.In addition, the splitting of Cu2p peaks located at 933.9 eV and 953.8 eV as well as the characteristic shake-up satellite, which were originated to the chemical state of Cu 2 , were observed from each sample 14,16,49.The sample cCu 2 OgCN had relative more Cu 2 species than other samples.Other shoulder peaks presented at higher binding energy, which can be attributed to CueOH species, were present from all samples 50,51.On the other hand, only sCu 2 OgCN and cCu 2 OgCN samples contained metallic Cu with the presence of Cu2p 3/2 peak at 931.1 eV 51.The estimated compositions of copper species based on the area of fitted Cu 2p peaks were summarized in Fig. 2e.The sample dCu 2 OgCN contained as high as 70 of Cu 2 O on gCN, while other two Cu 2 OgCN had around 50.A relatively higher CuO content was obtained from cCu 2 OgCNs as stronger satellite peaks of Cu2p peaks were observed from this sample.The fitting results of XPS spectra in O1 s region for xCu 2 OgCN (Fig. 2d) also confirmed the presence of Cu 2 -O and Cu -O species.The surface compositions of Cu 2 O crystals were later confirmed governing the photocatalytic activity of CO 2 . The crystalline structure of gCN was verified by the XRD spectrum shown in Fig. 3.The diffraction peaks appeared at 12.88and 27.58c orresponded to the characteristic packing of tri-s-triazine units and (002) facet of graphitic structure, respectively 1,52.That is, the inplanar distance between two adjacent nitride pore planes was around 0.69 nm and the d spacing between graphitic interlayers was 0.32 nm.Those characteristic peaks of gCN remained in the spectra of Cu 2 OgCN samples.Moreover, the shift in the characteristic graphitic structure of (002) diffraction peak of Cu 2 OgCN composites was negligible indicating the loading of Cu 2 O crystals did not result in the interlayer stacking of aromatic systems.reported that the pronounced facet (111) of Cu 2 O may improve photocatalytic performance 36.Notably, a weak peak (2 38.48)appeared on cCu 2 OgCN pattern indicated the presence of CuO components as indexed by JCPDS 05-0661 53.The result was consistent with its highest surface contents of CuO as depicted from XPS results. The morphologies of xCu 2 O and xCu 2 O/g-CN were displayed in the SEM and TEM images shown in Fig. 4. For cCu 2 O crystals, the cubes with an edge of around 500 nm were presented as well as with the faces mostly covered with hierarchical thorns (Fig. 4a).With the presence of gCN, the dimension of those cubes was slightly reduced and most of the surface-covered thorns disappeared.The average edge length of Cu 2 O cubes observed from cCu 2 O/g-CN was less than 500 nm (Fig. 4a,d). From TEM image (Fig. 4a), nanometer-size Cu 2 O nanoparticles or nanorods were uniformly distributed on silk-like gCN sheets.Notably, those nanoparticles were not observed from other two xCu 2 OgCN samples (Fig. 4b and4c).In addition, as presented in Fig. 36 as smaller crystal size was obtained in this work.With the combination of Cu 2 O crystals with gCN, significant blue shift of the absorption edge was revealed from each sample, implying the interaction between gCN and Cu 2 O 11.The band gap of xCu 2 OgCN was around 2.01 eV according to the absorption edge of 614.9 nm, which was not strongly dependent on the shapes of Cu 2 O 14,36.Notably, the blue-shift of the absorption edge of sCu 2 OgCN was most significant suggested stronger interaction between sCu 2 O and gCN.The absorption tails of cCu 2 OgCN and sCu 2 OgCN raised at the wavelength higher than 650 nm indicated the formation of acceptor levels within bandgap by oxygen or copper defects in those samples 55,57.Accordingly, the defects within dCu 2 OgCN were relatively negligible compared with other two samples.Moreover, another band gap originated from gCN component was distinguishable from UV-VIS spectra of all xCu 2 OgCN with red-shifted absorption edge.Compared with pure components, the dramatic decay in the absorption strength of xCu 2 O/gCN was due to the dilution of two components in each composite 17.However, the presence of two components enhanced more visible-light absorption than single component did as well as may induced more efficient charge transfer through more intimated phases. As photoluminescence (PL) may related to the recombination efficiency of photogenerated electrons and holes on samples 26, the PL spectrum of each sample was compared to evaluate the lifetime of photoinduced charge carriers.Upon photoexcitation at 350 nm, which is the suitable wavelength (Fig. S1), gCN exhibited a broad PL peak covered from 420 nm to 650 nm as illustrated in Fig. 5(b) The PL peak centered around 450 nm was attributed to the direct recombination of charge carriers (from or to n), and the other one centered around 500 nm was referred to the transition from to 26,55,56,58.For xCu 2 O, weak PL can also be detected as depicted in Fig. 5c.The shoulder appeared in the range of 600 to 650 nm was attributed to the recombination of phonon-assisted excitons at lattice defects 59.The PL intensity of cCu 2 O was the weakest, while the PL emitted from dCu 2 O and sCu 2 O presented similar strength and shape.The most intense PL peaks of Cu 2 O from 400 to 500 nm were originated from the inter-band transition or the relaxation of electrons from the sublevels of O 2p band and Cu 3d band 59.For xCu 2 OgCN, most of the characteristic PL bands from Cu 2 O cannot be observed as the PL intensity of gCN was relatively stronger than that of xCu 2 O.In comparison of the PL intensity emitted from xCu 2 OgCN, which contained identical molar ratio of xCu 2 O to gCN, the presence of Cu 2 O significantly reduced the intensity of PL.The shift in the PL emission was not occurred 58 that significant quenching in PL from cCu 2 OgCN may attribute to the stronger binding affinity between Cu species and gCN 60.Notably, the PL intensity from dCu 2 OgCN was significantly lower than that of physical blending gCN with dCu 2 O under identical composition.Therefore, the decrease in the PL intensity of xCu 2 OgCN samples implied longer life of charge carriers or more efficient charge transfer through enhanced interaction between two phases during the synthesis process 11,42,60. The energy of PL emission from samples was associated to their band edge structure as well as the presence of impurities or defects 26,45,55,58,59, while the difference in the shapes of UV-VIS curves from gCN and xCu 2 OgCN suggested the diversity of bandgap structure between each sample.The valence band positions of gCN and xCu 2 O samples were estimated by extrapolating a linear fit to the lower binding energy edge of the valence band photoemission to the baseline of XPS valence band (VB) spectrum (Fig. 5(d)) 16,45,61.As shown in Fig. 5e, the position of VB edge from low to high was 0.37 eV for cCu 2 O, 0.28 eV for dCu 2 O, and 0.13 eV for sCu 2 O.The VB maximum of samples was an indicative of photooxidation ability of holes 16,45.For pure Cu 2 O samples, the photoinduced holes at the VB were unable to produce hydroxyl radicals (OH) as a more positive standard redox potential of H 2 O/OH was required 62.In contrast, the more positive VB edge (around 1.31 eV) of gCN indicated higher capability to produce OH radicals with the presence of water, which was verified by the EPR results.According to the determined bandgap energy from Tauc plot (Fig. S2) based on UV-VIS spectra, the conduction band (CB) position of each Cu 2 O was then estimated 16.In our case, cCu 2 O has a CB edge of -1.63 eV, which is relatively lower than sCu 2 O and dCu 2 O, however, it is still theoretically sufficient to reduce CO 2 into various compounds 14,63.With the combination of p-type Cu 2 O with n-type gCN, the CB edge of Cu 2 O will even be more negative the pure crystals due to the alignment of Fermi level after contact 17,56.Accordingly, the VB edge of gCN will be more positive than Cu 2 O that the photoinduced holes on gCN may spontaneously transferred to Cu 2 O 11,12,17.On the other hand, the photoelectrons on the CB of Cu 2 O may flow into the CB of gCN and consequently improve the separation efficient of charge carriers. EPR spectra combined with spin trap technique was employed to evaluate the photoinduced radicals from each sample.The spin trap, DMPO, is a persistent radical to trap other radicals, such as hydroxyls and superoxides, to form spin adducts with characteristic EPR signals 45,646566.As shown in Fig. 6a, the EPR spectra featuring the characteristic 1:2:2:1 quartet (a N a H 14.9 G) indicated the successful trapping of hydroxyl radicals (OH) by DMPO from illuminated gCN and xCu 2 O-gCN suspensions 45,66.The spin adduct DMPOeOH immediately appeared upon the illumination of visible-light as shown in the time course of the intensity of DMPOeOH, which was estimated by double integration of the second low-field line of the characteristic peaks.The intensity of DMPOeOH increased with irradiation time and levelled off after 15-min illumination.Because the concentration of each catalyst in each EPR measurement was identical, the signal strength of DMPOeOH spin adduct was an indicator of the yield of OH from each sample.As depicted in Fig. 6, the amounts of OH from irradiated gCN higher than xCu 2 OgCN samples due to higher ratio of gCN with higher oxidation capability.In comparison of the intensity of DMPOeOH, sCu 2 OgCN produced more OH radicals than other xCu 2 OgCN samples.This may attribute to the stronger interaction between gCN and sCu 2 O as evidenced by more significant shifting in absorption edge.In addition, no detectable spin-adduct signals from pure Cu 2 O crystals as their location of VB edge was higher than the potential energy of water oxidation or that for hydroxyl formation as illustrated in Fig. 5e.It worthy to note that detectable EPR signal was also observed from almost each sample before irradiation (Fig. S3) and the strength remained during in-situ illumination.Cui et al. observed weak EPR signal from DMPO solution containing gCN in the dark, where they assigned the signal to superoxide radicals 66.In this work, the feature of this signal was similar to the signal of carbonyl-DMPO adducts (a N 15.2G and a H 19.4G) assigned from the solution containing urate and DMPO 65.As demonstrated in the curve-fitting of XPS C1 s spectra, trace amounts of remained carbonyl groups on gCN could related to the formation of stable carbonyl radicals and thus DMPO adducts.However, those adducts were detectable only if the concentration of DMPO in the EPR stock solution was as high as 2000 ppm.Moreover, the intensity of this spin adduct was stronger in pure gCN sample than in xCu 2 OgCN, in which lower contents of gCN.Superoxide radicals were not detected in this work as they may convert into hydroxyl radicals in aqueous solution 64.Those EPR results confirmed the capability of each sample to generate active hydroxyl radicals from aqueous sample suspensions under visible light illumination.However, the ranking in the amounts of hydroxyl radicals from samples did not directly correlated to their photoactivity to convert CO 2 . In this work, the gaseous products yielded from the batch CO 2 photocatalytic reduction system were withdrawn by a gas-tight syringe and analyzed by a PDHID with ppb-level sensitivity.CO was the main gaseous product detected from the photocatalytic reduction of CO 2 by using xCu 2 O or xCu 2 OgCN.An increase in the intensity of O 2 signal in GC chromatogram was observed during photoreduction, indicating the production of O 2 .Notably, the quantity of O 2 cannot be correctly determined with irradiation time due to the limit in the resolution of PDHID, which was set to ppb level.The cut tops of N 2 and O 2 peaks cannot be avoid from the injection volume of 1 mL.On the other hand, the decrease in injection volume to 50 L did avoid cut-tops of O 2 peaks; however, the increased amount cannot be precisely determined from each data point that we only monitored the difference between initial and final concentration of O 2 .Fig. 7 plots the time course of CO yield from each sample under LED-lamp illumination.For pure cCu 2 O crystals, the conversion of CO 2 to CO occurred immediately upon the illumination.However, the production levelled off at 8h-illumination.The photoactivity of pure gCN was also revealed and time course of CO yield was perfectly fitted to BoxLucas1 model.With the coupling of cCu 2 O, the CO production rate was significantly improved.On the other hand, an activation period was required for both dCu 2 OgCN and sCu 2 OgCN that a delayed conversion to CO was observed.After 24-h illumination, the yield of CO via xCu 2 OgCN exceed the value from pure gCN.cCu 2 OgCN exhibited higher activity on CO production than other xCu 2 OgCN or pure cCu 2 O samples.It has been reported that irregular edges from cuboid Cu 2 O or dominant (111) facets exhibited higher photoactivity due to the presence of dangling bonds on (111) surfaces 36 67.Recall XRD results, the intensity ratio of facet (111) to facet (100) in cCu 2 OgCN, around 16, is higher than that in cCu 2 OgCN (11) and dCu 2 OgCN (12).Moreover, the presence of CuO in cCu 2 OgCN as revealed from its XRD and XPS spectra may promote the adsorption of CO 2 68.In addition, cCu 2 OgCN exhibited the largest surface area (44.1 m 2 /g) among other samples (Fig. S4).As shown in SEM images, the formation of tubular gCN structures within the cCu 2 OgCN may contribute to larger surface area.However, the adsorption of CO and H 2 on the (111) facet was found stronger than on (100) and consequently might attribute to the level-off in the yield from cCu 2 OgCN after 20hour illumination 69.A continuous production of CO via dCu 2 OgCN revealed from Fig. 7 after a sufficient activation process was provided.Methanol was not detected in this work as it is commonly the main liquid products from gCN aqueous suspension under irradiation 26,54,70.The products obtained in this work were compared with those in literature and summarized in Table 1.It is worthy to note that, without the addition of scavenger or cocatalyst, gaseous CO 2 was successfully converted to CO with reasonably yields under very weak irradiation of visible lights.Although the yield of CO was not as high as other systems shown in Table 1, the effect of morphology of Cu 2 O on CO 2 photoreduction was comprehensively elucidated in this work. The changes in the chemical state of xCu 2 OgCN before and after irradiation may attribute to the conversion efficiency of CO 2 .The comparison on chemical states on catalysts before and after 24-hour illumination was made and the results were presented in Fig. 8.For dCu 2 O-gCN, the differences in the shapes of XPS C1 s and Cu2p spectra before and after illumination were negligible indicating almost identical composition of C and Cu species presenting in two conditions.Fig. 8d depicted the composition of Cu species on xCu 2 O-gCN after CO 2 photoreduction.Metallic copper species, which would benefit charge transfer, remained on illuminated cCu 2 OgCN but not on sCu 2 OgCN after photoreaction.An enhancement in the intensity of Cu-OH and Cu 2 signals was revealed from cCu 2 OgCN and sCu 2 OgCN samples after 24 h-illumination.The partial oxidation of Cu species on Cu 2 OgCN may suppress the long-term production of CO and lead to the yield trend revealed from Fig. 7. Interestingly, for dCu 2 OgCN, a relatively unstable production of CO was observed at the early stage, and the long-term activity seem superior to others as the Cu species presented on dCu 2 OgCN were more stable than those on other samples.As shown in Fig. 8(b), the characteristic N-C N species (288.0 eV) on each sample after illumination remained.On the other hand, significant increase in the ratio of CeN or CeO to NeCN species was noticed from cCu 2 OgCN after illumination.Moreover, the shift of the binding energy of C-C species from 285.0 eV to 284.5 eV revealed for illuminated cCu 2 OgCN and sCu 2 OgCN.For both fresh and illuminated dCu 2 OgCN, the fitted pure carbon species was located at the same binding energy of 284.5 eV without the changes in intensity.That is, after CO 2 photoreduction, the contents of pure carbon species on cCu 2 OgCN was highest amount other samples.We believed that the adsorption of hydrocarbon products and even CO 2 during photoreduction may attribute to the increased carbon species on samples 80 as those samples were only vacuum-dried at room temperature for 1 h before the XPS analysis.Notably, several control experiments, including the absence of catalyst, light or CO 2 , were conducted to verify the essential factors for photocatalytic reaction and to confirm the carbon source of products.The results shown in Fig. 7 suggested the photodegradation of gCN was negligible, and very trace amounts of CO were detectable from CO 2 cylinder.However, those CO did not direct the reaction path of CO 2 .Instead, the ratio of copper species and the morphology of Cu 2 O crystals dominated the photoactivity of xCu 2 OgCN samples."
  },
  {
    "title": "Conclusions",
    "content": "In summary, the combination of gCN with Cu 2 O crystals improved their visible light-driven photocatalytic conversion of gaseous CO 2 into CO.The structure of Cu 2 O crystals and the composition of Cu species on samples dominated the production rate of CO.Based on the comparison of XPS spectra before and after reaction, the photostability of dCu 2 OgCN was superior that a sustaining growth of the products was obtained although a short activation period was required. Fig. 1.(a) FTIR spectrum of gCN.XPS spectra of gCN in (b) C1 s, (c) O1 s, and (d) N1 s regions. 4(d), a few nanowire-like structures were tangled and dispersed on gCN, rather than on cCu 2 O crystals.It is worth noting that the spherical and allcorner-truncated rhombic dodecahedral Cu 2 O crystals were easily recognized from samples with the presence of gCN, but not for pure Cu 2 O. Therefore, the sample code was designated according to the shapes of Cu 2 O on hybrid samples.Under the same process parameters, except the addition of gCN, similar appearance of Cu 2 O crystals was observed from Fig.4(b) and (c).The pure Cu 2 O crystals shown in Fig.4b and c were both all-corner-truncated rhombic dodecahedrons but more truncated facets were presented in Fig.4cexhibited.With the presence of gCN, the sizes of Cu 2 O crystals were relatively uniform and smaller compared to pure crystals.From Fig.4(b, e), the dodecahedrons exhibited an average dimension of 400 nm, while from Fig.4(c, f), the diameters of spherical crystals were larger than 2 m.The micron-sized Cu 2 O spheres were distributed on gCN or attached with smaller pieces of gCN as shown in Fig.4f.Notably, the sheet-like gCN showed the tendency to form tubes with the presence of cCu 2 O (Fig.4d).Those images suggested the morphology and dimension of Cu 2 O were tunable by adjusting the amounts of NH 2 OHHCl and gCN during synthesis procedures.The UV-vis diffuse reflectance spectra of gCN, xCu 2 O and xCu 2 OgCN catalysts were depicted in Fig.5a.The absorption edge of as-prepared gCN was about 458 nm, which is similar to a typical Fig. 3. XRD patterns of gCN and xCu 2 OgCN. Fig. 5. (a) UV-vis absorption spectra of samples and photoluminescence spectra of (b) gCN and xCu 2 OgCN, and (c) Cu 2 O crystals.(d) XPS valence band spectra of each Cu 2 O crystal.(e) Band structure of xCu 2 O and gCN. Fig. 6.(a) EPR spectra for the DMPO-containing aqueous suspensions of gCN and xCu 2 OgCN after 15-min visible light irradiation.(b) Intensity of spin adduct (DMPOeOH) from sample suspensions as a function of irradiation time. Fig. 7. Time-dependent CO production over powder samples under LED lightillumination and blank tests (without catalyst or under N 2 -purging). Fig. 8.Comparison of XPS spectra in (a) Cu 2p, (b) C1 s, and (c) N1 s regions for xCu 2 OgCN before and after 24 h photoreduction.(d) Relative surface composition of Cu species on xCu 2 OgCN after photoreduction based on XPS fitting results. Comparison of CO 2 photoreduction system and its products from literature.Purified CO 2(g) with moisture CH 3 CHO-8.2mole/gh, CH 4 -19.2 mole/gh, CO 2 with moisture, 100 C CH 4 -109 mole/gh, CH 3 OH-20 mole/gh, C 2 H 4 -1.5 mole/gh, C 2 H 6 -0.65 mole/gh 3 -CdIn 2 S 4 Xe lamp (300 W, 400 nm) 1 atm CO 2 , 30 C, with cocatalyst and electron donor CO-825 mol/gh, H 2 -375 mol/gh 79 c-Cu 2 OgC 3 N 4 LED lamp (8 W) 1 bar CO 2 with moisture CO-0.002 mol/gh This work P.-Y.Chang, I.-H.Tseng Journal of CO2 Utilization 26 (2018) 511-521 The authors would like to acknowledge the financial supports from the Ministry of Science and Technology of Taiwan under the grant number of MOST 104-2221-E-035-074-MY3.The authors also appreciate the Precision Instrument Support Center of Feng Chia University in providing BET and TGA measurement facilities. Supplementary material related to this article can be found, in the online version, at doi:https://doi.org/10.1016/j.jcou.2018.06.009."
  }
]