[
  {
    "title": "Doi",
    "content": "10.1016/j.ceramint.2013.11.019"
  },
  {
    "title": "Article_Title",
    "content": "Preparation and characterization of NaBiO3 nanopowders by different methods for photocatalytic reduction of CO2"
  },
  {
    "title": "Abstract",
    "content": "In this work we prepared NaBiO 3 nanopowders via three synthesis methods (sol-precipitation, dehydration and hydrothermal methods).To evaluate and compare the physical properties of the prepared materials X-ray diffraction analysis, BET measurements, UV-vis spectroscopy and TEM were applied.The results showed changes to the NaBiO 3 crystallinity, the specific surface area and the particle shape and size, depending on the method of synthesis.To determine the photocatalytic efficiency of the prepared materials, we evaluated the photocatalytic reduction of CO 2 ."
  },
  {
    "title": "Experimental",
    "content": "In a typical synthesis, we added 0.3 mol of sodium acetate (99.9,Aldrich) to 16 mol glacial acetic acid (99.9,Aldrich) in a glove box under nitrogen atmosphere, magnetically stirred the solution for 2 h at room temperature.As a second step, we added 5 mol of Bismuth isopropoxide, Alfa Aesar to the mixture, then stirred the resulting solution magnetically 6 h at room temperature.Thereafter, we added 20 mL of acetone (HPLC, Aldrich) to the stirred solution and placed it in a lowfrequency ultrasonic apparatus for 1 h.A cooling-water recirculation system was adapted to the reaction apparatus to control the temperature.We dried the resulting material at 100 1C for 24 h, and calcined it at 550 1C for 5 h in air atmosphere to obtain NaBiO 3 S sample. We obtained the NaBiO 3 samples by heating commercial NaBiO 3 A 2H 2 O (Wako Pure Chemicals Industries Ltd, Japan) in air for 4 h at 250 1C. We evaluated the specific surface area of the prepared samples from the adsorption-desorption isotherms of nitrogen at A 196 1C using a Nova 2000 series apparatus (Chromatech).We calculated the specific surface areas of materials using the Brunauer-Emmett-Teller (BET) method.We degassed all samples under vacuum at 100 1C for 2 h prior to measurements.To determine the particle size, we performed an X-ray diffraction (XRD) analysis carried out at room temperature with a Bruker axis D8 instrument using Cu K radiation (1.540A).We calculated the crystallite sizes of the composite catalysts using the Scherrer equation, where d is the average particle size of the material under investigation, B is the Scherer constant (0.89), is the wavelength of the X-ray beam, 12 is the full width at half maximum of the diffraction peak, and is the diffraction angle.We examined the surface morphology of all prepared catalysts using a transmission electron microscope (TEM) (JEOL-JEM-1230).Prior to loading them into the TEM, we suspended the samples in ethanol, followed by ultra-sonication for 30 min.We determined the band-gap energies of the samples by UV-visible diffuse reflectance spectra (UV-vis-DRS) in air at room temperature in the wavelength range of 200-800 nm using a UV/Vis/NIR spectrophotometer (V-570, JASCO, Japan).We calculated the band gap energies by applying the following equation: where E g is the band gap (eV) and is the wavelength of the absorption edges in the spectrum (nm). We carried out the photocatalytic reduction of CO 2 in an aqueous system.Under visible light irradiation, we dispersed 0.05 g catalyst in 50 ml distilled water containing sodium bicarbonate (NaHCO 3 , 0.08 M).The solution was prepared in a 30 cm A 15 cm A 5 cm reactor.Fixed catalyst concentration was used in all experiments, aiming to eliminate uncertainties associated with light reflection and reactor geometry.We then purged the solution using N 2 to remove oxygen and kept it in the dark at a constant temperature using a water bath for 30 min until it reached adsorption-desorption equilibrium.Visible light irradiation was provided by a 500 W highpressure Xe lamp placed above the reactor.A Pyrex glass was placed on top of the reactor to cut off light with wavelengths o 400 nm.A UV cut-off filter consisting of 2 M NaNO 2 solution was applied to cut off entire UV region ( o 400 nm).The photocatalytic reaction was continued up to 9 h and in every 3 h interval the reactor was allowed to cool down naturally for CH 3 OH desorption from the catalyst.The sample solution was centrifuged and analyzed by GC-FID for CH 3 OH.The rate of CH 3 OH evolution was defined as the total amount of evolved CH 3 OH divided by the reaction time.The following reaction was proposed for the selective production of CH 3 OH We carried out control experiments in the dark first and detected no CH 3 OH for all tested catalysts.Similarly, we detected no CH 3 OH for the control experiments under light irradiation without a catalyst.Preliminarily results from these control experiments indicate that both light irradiation and catalysts are indispensible for CO 2 photoreduction to CH 3 OH. We estimated the reaction quantum yield (QE) using CH 3 OH yield noting that six electrons are required to reduce CO 2 to CH 3 OH.The equation is as follows: where I is light intensity (0.12 mW cm A 2 for visible light); S is the irradiated area of the reactor (30 cm A 15 cm); E is the photon energy, (4.97 A 10 A 19 J at 400 nm); and N A is the Avogadro number (6.022 A 10 23 mol A 1 )."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The physical properties of the NaBiO 3 were analyzed to establish the influence of the synthesis method on the final properties of the NaBiO 3 .The phase identification based on X-ray diffraction analysis revealed that the crystallization of the NaBiO 3 was influenced by the method of synthesis (Fig. 1).The three patterns in Fig. 1 are consistent with the sodium bismuth oxide of NaBiO 3 (JCPDS card no.30-1160).As the preparation method changed from sol-gel to hydrothermal to dehydration, the diffraction peaks of the products gradually became narrow and sharp.This change indicates that the crystallinity of the produced NaBiO 3 increased and that the crystallite size grew as the preparation method changed from sol-gel, hydrothermal to dehydration.The mean crystallite size can be roughly determined from the broadening of the peaks through the Scherrer formula.We found the following mean sizes of the NaBiO 3 samples from different preparation methods: sol-gel14 14 nm; hydrothermal 14 21 nm; and dehydration 14 26 nm. TEM images of the NaBiO 3 samples prepared under different preparation methods are displayed in Fig. 2. NaBiO 3 , prepared by the sol-gel method, consists of nearly homogeneous nanorods (Fig. 2(a).NaBiO 3 , prepared by the hydrothermal method, consists of a mixture of nanorods and nanospheres (Fig. 2(b).NaBiO 3 , prepared by the dehydration method, consists of nanospheres (Fig. 2(c).Therefore, the preparation methods plays an important role in determining the morphology of the NaBiO 3 produced. The N 2 adsorption-desorption measurement at a liquid N 2 temperature of A 196 1C was used to study the mesoporosity and textural properties of the synthesized NaBiO 3 samples.The surface areas of the products are listed in Table 1.The surface area of the NaBiO 3 obtained by the sol-gel, hydrothermal and dehydration methods were 33, 24 and 6 m 2 /g, respectively.Therefore, the preparation method plays an important role in determining the specific surface area of the NaBiO 3 produced. The optical absorption property of a semiconductor, which is relevant to its electronic structure, is recognized as the key factor in determining its photocatalytic activity.Fig. 3 shows the UV-vis spectra of the NaBiO 3 prepared by different preparation methods.The results reveal that the absorbance edges of the NaBiO 3 products regularly varied.As the preparation methods changed from dehydration to hydrothermal to the sol-gel method, the absorbance edges of the products moved gradually to shorter wavelengths.The direct band gap energy for NaBiO 3 prepared by these different preparation methods was calculated from the UV-vis spectra based on a method described by Mohamed et al. 11; and the results are tabulated in Table 1.The results show a gradual narrowing of the band gap of the prepared samples as the preparation methods changed from dehydration to hydrothermal and the sol-gel methods.This narrowing increases the absorbency in the visible light region.Therefore, the preparation methods play an important role in determining the band gap of the produced NaBiO 3 .The surface texture data will be correlated with the catalytic activity as will be mentioned later on. The photocatalytic activity of the synthesized NaBiO 3 catalysts was evaluated in terms of photoreduction of CO 2 to CH 3 OH under visible ( 4400 nm) light irradiation.Generally, CH 3 OH is formed by CO 2 photoreduction on the photocatalyst upon visible light irradiation.Fig. 4. shows the Intensity, a.u.effect of preparation methods on methanol yield.The results show that the methanol yield obtained by the sol-gel method was higher by 16.25 and 1.4 times than those of the dehydration and hydrothermal methods, respectively.This was due to the high surface area, small crystallite size, and small band gap of the NaBiO 3 sample produced by the sol-gel.Our estimates of the quantum yield (QE) of the synthesized NaBiO 3 catalysts are shown in Table 2.In addition, Fig. 5 shows the good correlation between the band gap, surface area and crystallite size with the catalytic activity where the activity is gradually increasing with the decrease of band gap and crystallite size and the increase of the surface area. The amount of the photocatalyst was another important factor in the photocatalytic reduction of CO 2 under visible light irradiation.The amount of NaBiO 3 S ranged from 0.5 to 2.5 g L A 1 in 0.08 M of the employed solutions of NaHCO 3 .As shown in Fig. 6, we observed an increase in the methanol Absorbance, a.u. Sol-Gel method Hydrothermal method Dehydration method Fig. 3. UV-vis spectra of NaBiO 3 prepared by different preparation methods. yield by increasing the amount of catalyst from 0.5 g L A 1 to 1.5 g L A 1 .However, further increases of the photocatalyst amount above 1.5 g L A 1 were less effective in changing the methanol yield.This can be justified by increasing the number of active sites on the photocatalyst by increasing its amount 26, consequently, increasing the number of the absorbed CO 2 molecules and photons.However, at photocatalyst dosages above 1.5 g L A 1 , the methanol yield decreased because the excess photocatalysts blocked the light penetration 26. The recycling of catalysts is one of the key steps in assessing the practical application of photocatalysts and in developing heterogeneous photocatalysis technology for wastewater treatment.An examination of the photocatalytic activity of the recycled NaBiO 3 S catalyst was carried out.The methanol yield was 0.85 mmol g A 1 h A 1 during the first five cycles.The results revealed the separation of the photocatalyst was effective, and thus the photocatalyst is stable and is promising for environmental remediation."
  },
  {
    "title": "Conclusions",
    "content": "Due to the different growths of the NaBiO 3 nano-materials obtained by dehydration, hydrothermal and sol-gel conditions, their physicochemical properties were significantly influenced.The surface properties and the phase composition were very dependent on the growth route of the material and had the most important influence on their photocatalytic activity.NaBiO 3 exists as a nanorod and has a surface area of 33 m 2 /gm and a band gap of 2.3 eV if the preparation method is sol-gel.Therefore, the preparation method plays an important role in determining the shape, surface area and band gap of the produced NaBiO 3 .Measurements of the photocatalytic reduction of CO 2 showed that NaBiO 3 nanorods exhibited highly active and efficient photocatalytic properties for photocatalytic reduction of CO 2 and may find potential applications in related fields.The catalyst could be reused with no loss of activity over the first 5 cycles. Preparation of NaBiO 3 2.1.1.Preparation of NaBiO 3 via hydrothermal route: Fig. 1.XRD patterns of NaBiO 3 prepared by different preparation methods. Fig. 2. TEM images of NaBiO 3 prepared by different preparation methods, (a) sol-gel methods; (b) hydrothermal method and (c) dehydration method. Fig. 4. Effect of preparation methods on methanol yield, where (a) sol-gel methods; (b) hydrothermal method and (c) dehydration method. Fig. 5. Effect of physical parameters of the prepared samples on their photocatalytic activity, where (a) sol-gel methods; (b) hydrothermal method and (c) dehydration method. Crystallite size, BET surface area and band gap energy of NaBiO 3 samples prepared at different preparation methods. Effect of preparation methods on methanol yield and quantum yield. This paper was funded by the Deanship of Scientific Research (DSR), King Abdulaziz University, Jeddah, under Grant no.(130-056-D1434).The authors, therefore, acknowledge with thanks the technical and financial support from the DSR."
  }
]