[
  {
    "title": "Doi",
    "content": "10.1016/j.cej.2020.125868"
  },
  {
    "title": "Article_Title",
    "content": "2D/2D/2D O-C3N4/Bt/Ti3C2Tx heterojunction with novel MXene/clay multi-electron mediator for stimulating photo-induced CO2 reforming to CO and CH4"
  },
  {
    "title": "Abstract",
    "content": "x heterojunction with novel MXene/ clay multi-electron mediator for stimulating photo-induced CO 2 reforming to CO and CH 4 , Chemical"
  },
  {
    "title": "Experimental",
    "content": "Melamine (Merck, 99.99 ) for synthesis of g-C3N4, Bentonite (Sigma Aldrich, 99.99 ), titanium aluminum carbide (Ti3AlC2, 98, 200 mesh, Famouschem China) for the synthesis of Ti3C2, methanol (Merck, 99.99) and hydrofluoric acid (HF, 49 , Emplura) are the materials and chemicals used in this study. The Ti3C2 MXenes nanosheets were synthesized through etching of Ti3AlC2 with HF in a continuous stirred tank reactor.Typically, 1 g of Ti3AlC2 (powder) was dispersed in a 20 mL HF solution (content 49 ) and suspension was transferred into Teflon lined stainless steel reactor and stirred for 24 h to get Ti3C2 MXenes.The suspension obtained was centrifuged and washed with DI water until pH 6.The product obtained was dried at 100 o C for 24 in an oven under airflow and named as Ti3C2 MXenes nanosheets.The Ti3C2 MXenes with in-situ growth of TiO2 NPs was achieved by increasing etching time to 96 h and named as Ti3C2Tx Mxenes nanosheets. The g-C3N4 was prepared using melamine as the precursor through hydrothermal approach according to our previous report 10.First, melamine (10 g) was placed in a ceramic crucible, covered with lid and heated in a furnace at 550 o C for 2 h under air atmosphere.After cooling, yellowish color bulk cake obtained was grinded to fine powder using mortar and pestle.Then, the powder was added into 40 mL (1M) nitric acid solution and stirred for next 24 h.The suspension obtained was centrifuged and washed with water to remove impurities and to get pH 7.Finally, sample obtained was dried at 100 o C overnight and named as graphitic carbon nitride nanosheets (g-C3N4). The g-C3N4/Bt, g-C3N4/Ti3C2 MXene and g-C3N4/Bt/Ti3C2 MXene composite samples were prepared through ultrasonic approach at normal temperature.First, g-C3N4 (1 g) was dispersed into 20 mL methanol and stirred for 6 h to get uniform dispersion of g-C3N4 nanosheets (sample A). Second, specific amount of bentonite (Bt) was added to 20 mL methanol under stirring and ultrasonic for 60 min to get exfoliated Bt nanosheets (sample B).Third, Ti3C2 added in 20 mL methanol was dispersed through ultrasonic to get exfoliated Ti3C2 layers (sample C).In the next stage, Bt suspension (sample B) was added to g-C3N4 suspension (sample A) and stirred for 6 h with ultrasonic for 60 min to get good interface interaction of g-C3N4 with Bt (sample D).The sample obtained was centrifuged and dried at 100 o C for 24 h and named as 2D/2D g-C3N4/Bt composite.Similarly, for the synthesis of g-C3N4/Ti3C2 MXene composite, the Ti3C2 (sample C) suspension was added to g-C3N4 suspension (sample A) under continuous stirring.The product obtained was oven dried at 100 o C under air flow and named as 2D/2D g-C3N4/Ti3C2 MXene composite.Finally, g-C3N4/Bt/Ti3C2 MXene composite was synthesized using the similar method as discussed above.Firstly, g-C3N4 solution (sample A) was mixed with Bt suspension (sample B) to get homogenous dispersion of both the samples (sample D).Afterwards, specific amount of Ti3C2 dispersed in methanol (sample C) was added to mixture of g-C3N4/Bt (sample D) under stirring.The sample was further ultrasonic for 60 min to get good dispersion of nanosheets and finally centrifuged to remove methanol.The sludge obtained was dried for 24 h at 100 o C and named a 2D/2D/2D g-C3N4/Bt/Ti3C2 MXene composite nanosheets.The scheme for the synthesis of 2D/2D/2D g-C3N4/Bt/Ti3C2 MXene composite has been demonstrated in Fig. 1. Schematic illustration for the synthesis process of functionalized g-C3N4, Ti3C2 through HF etching, exfoliated Bt and g-C3N4/Bt/Ti3C2 composite samples. X-ray diffraction (XRD) patterns were obtained through advance spectrometer (Bruker D8) operated at 40 kV and 40 mA.Raman shift peaks were identified using HORIBA Scientific spectrophotometer with laser wavelength 532 nm.Morphology of the samples was evaluated using Field Emission Scanning Electron Microscopy (FESEM, Hitachi SU8020 instrument).EDX (Energy-dispersive X-ray) spectroscopy mapping analysis was conducted to identify elements distribution over the catalyst with their composition.Similarly, High Resolution Transmission Electron Microscopy (HRTEM) images were collected to identify materials structure through HITACHI HT7700 machine.X-ray Photoelectron Spectroscopy (XPS) (Axis Ultra DLD instrument) was employed to determine elemental state of the samples.Ultraviolet visible diffuse reflectance spectra (UV-Vis DRS) were obtained using Cary 100 Agilent spectrophotometer integrated with sphere for powder sample analysis.Photoluminescence (PL) spectra were obtained using HORIBA spectrometer operated at wavelength 325 nm.The thermo gravimetric analysis (TGA) was conducted with air flow rate of 200 mL min -1 and heating rate of 2 C/min and 10-900 C. The performance analysis of photocatalysts was conducted in a fixed bed photoreactor operated under visible light irradiation.The source of light was a 35 W HID lamp with a maximum light intensity 20 mW cm -2 with wavelength 420 nm.The experiments were conducted with and without UV-cut filters located above the glass window and their effects on catalyst performance and products selectivity were evaluated.A solar concentrator was used to simulate light irradiations from the lamp towards the catalyst surface.The reactor was fixed with a glass window of thickness 10 mm and lamp integrated with a concentrator mirror was located 5 cm above the glass window. First, 150 mg powder catalyst was uniformly distributed at the reactor bottom and then nitrogen (N2) gas was passed through the reactor to remove air and other impurities from the reactor. Second, high purity CO2 (99.99), regulated by mass flow controller (MFC), was bubbled through the water saturator to carry moisture and was flowing through the reactor for 30 min to saturate the catalyst and to purge the reactor system.All the experiments were conducted under reactor pressure of 0.20 bars above the atmospheric pressure.The CO2/H2O feed ratio was varied using different temperature of water saturator (e.g., 15, 30 and 45 o C), while kept constant CO2 flow rate (20 mL min -1 ) in all the experiments.Similarly, for the investigation of acetic acid effect on the catalyst performance, acetic acid (10 vol.) was added to water saturator and CO2 gas (20 ml min -1 ) was bubbled through the water-acetic acid aqueous solution.All the experiments were conducted without providing external heat.Online GC-TCD/FID (GC-Agilent Technologies 6890 N, USA) was used for the analysis of reaction products.In addition, CARBOXEN 1010 plot column was connected with TCD and FID detectors for the separation of CO, H2, CO2 and CH4 gases. The apparent quantum yield efficiency (AQY) for CO and CH4 production was tested under visible light irradiations of wavelength 420 nm and light intensity 20 mW cm -2 .The AQY for CO and CH4 production during photocatalytic CO2 reduction with H2O were calculated using Eqs.( 1"
  },
  {
    "title": "Results_and_Discussion",
    "content": "To determine etching of Ti3AlC2 and formation process of Ti3C2 at different times, XRD analysis was conducted and results are demonstrated in Fig. 2 typical layered structure of Bt.When Bt and Ti3C2 were combined with g-C3N4 to construct g-C3N4/Bt and g-C3N4/Bt/Ti3C2, all the original peaks were appeared, indexed to g-C3N4, Bt and Ti3C2, confirming successful formation of composite catalyst. The Raman analysis was further conducted to identify interaction among the elements in the composite sample and the results are demonstrated in Fig. 2 (c).The g-C3N4 peaks appeared at 323, 478, 588, 707, 765, 979, 1116, 1232, 1312, 1481 and 1619 cm -1 confirmed graphitic structure of carbon nitride.The Raman peaks at 478, 707 and 1232 cm 1 can be ascribed to vibration of the tri-s-triazine ring.The obvious peaks appeared at 702 and 979 cm -1 evidenced the presence of heptazine ring structure.For the Raman spectra of pristine Bt strong bands in the range of 200 to 400 cm -1 were observed.The band appeared at 395 cm -1 can be ascribed to v3(a1) internal vibration mode of SiO4 tetrahedron units.Similarly, band appeared at 281 cm -1 was probably due to v1(A1) O-H-O unit.The band at 215 cm -1 was due to v1(A1g) vibrational mode of AlO6 octahedron unit. Similarly, 1, 1, 2, 3 and 4 modes of Ti3AlC2 phase were appeared at 254, 418, 608 and 713 cm -1 , attributed to MAX structure.However, two peaks appeared at 1480, 1621 cm -1 in g-C3N4 and 1367, 1585 cm -1 in Ti3AlC2, ascribed to the presence of D-band and G band of carbon in both the samples, respectively.Furthermore, obvious bands in Ti3C2 at 400 cm -1 and 622 cm -1 could be ascribed to the presence of TiO2 over the nanosheets.However, bands at 1343 and 1570 cm -1 ascribed to D and G bands of carbon in Ti3C2 sample.Furthermore, all the peaks of g-C3N4, Bt and Ti3C2 appeared in the composite of g-C3N4/Bt and g-C3N4/Ti3C2 and g-C3N4/Bt/Ti3C2 composite samples.This confirms successful fabrication of composite catalyst with their good interaction and would be promising to maximize catalytic activity and products selectivity. The morphology of g-C3N4, bentonite (Bt), Ti3AlC2, Ti3C2 and their composites has been demonstrated in Fig. 3. Obviously, g-C3N4 has layered compact sheets as shown in Fig. 3 (a). Similarly, exfoliated 2D sheets of Bt are obvious in Fig. 3 (b).Fig. 3 (c) presents Ti3AlC2 structure with compact sheets.After etching with HF for 24 h, single layer Ti2C2 sheets were obtained as illustrated in Fig. 3 (d-e).Furthermore, when etching process was extended to 96 h, a controlled growth of TiO2 NPs over the Ti3C2 nanosheets was obtained as demonstrated in Fig. 3 (f).Fig. 3 (g) shows g-C3N4/Bt composite morphology, in which, obvious heterojunction between g-C3N4 and Bt could be seen.This confirms successful formation of g-C3N4/Bt composite through ultrasonic approach.The fabrication of g-C3N4/Bt/Ti3C2 composite has been further illustrated in Fig. 3 (h-i).It is obvious that g-C3N4/Bt composite has good interface interaction with Ti3C2 nanosheets, thus developing 2D/2D/2D heterojunction between all the three materials and similarly reported in literature 36.It is predictable that close interaction between Bt, Ti3C2 and g-C3N4 will provide more electron transfer pathways and would be beneficial for electron transfer and separation 37.To further investigate the elements distribution in the composite sample, EDX mapping analysis was conducted as demonstrated in Fig. 3 (j-k).Fig. 3 (j) demonstrates uniform distribution of elements over the composite catalyst.However, EDX plot in Fig. 3 (k) further confirms the present of all the elements in the composite catalyst.Therefore, successful fabrication of g-C3N4/Bt/Ti3C2 composite can be obtained through etching of Ti3AlC2 to get Ti3C2 and ultrasonic exfoliation of materials. TEM analysis was further conducted to identify structure and morphology of g-C3N4, Ti3AlC2, g-C3N4/Bt, and g-C3N4/Bt/Ti3C2 composite samples.As shown in Fig. 4 (a) polymeric structure of g-C3N4 with compact 2D nanosheets are obvious.Similarly, Fig. 4 (b) shows 2D sheets of Ti3AlC2, in which, all the sheets are stacked together to give bulk MAX structure of compact sheets.TEM images in Fig. 4 (c-e) clearly illustrates formation of heterojunction among the g-C3N4, Bt and Ti3C2 samples.It is worth mentioned that Ti3C2 keeps layered structure after ultra-sonication, confirming good stability of exfoliated monolayers.HRTEM images in Fig. 4 (f-h) further confirms good interaction among all the components to construct 2D/2D/2D heterojunction of g-C3N4/Bt/Ti3C2 composite, which is in accordance with the similar work 33,38.More importantly, TiO2 NPs grown over the Ti3C2 sheets could be seen under high magnification.The identification of g-C3N4, TiO2, Bt and Ti3C2 was further conducted through diffraction analysis and similarly reported in the literature 39.As demonstrated in Fig. 4 (i-m), 0.346, 0.33, 0.266 and 0.282 nm d-spacing for TiO2, g-C3N4, Ti3C2 and Bt, respectively, were obtained, confirming successful formation of composite heterojunction with good interaction.All the results of electron microscopy are well consistent with the above XRD and Raman analysis.Therefore, successful fabrication of 2D/2D/2D g-C3N4/Bt/Ti3C2 heterojunction with large interfacial contacts would be beneficial for efficient photocatalytic CO2 reduction. The surface chemical composition was calculated using XPS and the results are presented in Fig. 5.As depicted in Fig. 5 respectively 40.The two peaks at 453.1 and 460.2 eV can be ascribed to Ti-C 2p3/2 and Ti-C 2p1/2, respectively, whereas, other two peaks at 457.5 and 465.1 eV revel the existence of Ti-O 2p3/2 and Ti-O 2p1/2, respectively 37,41.Fig. 5 (c) demonstrates N 1s spectra of g-C3N4 and g-C3N4/Bt/Ti3C2 composite samples.For pristine g-C3N4, peaks located at 398.8 and 400.2 eV are relating to C-NC and N-C3, respectively.However, additional peak positioned at 407.1 eV was due to surface charge modification of g-C3N4 and confirmed the charging effects in g-C3N4 surface.Furthermore, g-C3N4/Bt/Ti3C2 composite demonstrated several peaks with binding energies 298.5, 399.9, 403.7 and 406.5 eV, can be assigned to C-NC, N-C3, C-NH and charging effects due to surface modification, respectively 27.The XPS analysis of g-C3N4 and g-C3N4/Bt/Ti3C2 for O 1s has been demonstrated in Fig. 5 (d).For pristine g-C3N4, peaks appeared at 532.8 eV can be assigned to adsorbed oxygen.However, O 1s spectra of g-C3N4/Bt/Ti3C2 demonstrated several peaks with binding energies 529.8, 531.3, 532.4,533.5 and 534.6 eV, relating to Ti-O, Ti-OH, adsorbed O2 and atomic O2 due to surface oxygen vacancies, respectively.Fig. 5 (e-f The optical absorption properties of g-C3N4, Ti3C2, Bt and their composites were studied using UV-vis diffuse reflectance spectra (DRS) and results are demonstrated in Fig. 6 (a).Pristine Ti3C2 MXene shows an enhanced visible light absorption due to black color nature.Previously, fullspectrum light absorption characteristics in the whole range with displaying no obvious absorption peak by Ti3C2 MXene has been reported by several researchers 37,42.Similarly, Bt has light absorption under visible and UV light irradiation.The g-C3N4 presents visible light absorption with wavelength above 400 nm.When, Bt is combined with g-C3N4, there was no significant effect on the band edge shift and visible light absorption of g-C3N4.Similarly, there was no effect on the band-edge shift of g-C3N4 by coupling with Ti3C2MXene.By constructing 2D/2D/2D heterojunction of g-C3N4/Bt/Ti3C2 composite, similar trends were obtained with no band edge shift of g-C3N4.The Tauc plot was used to calculate band gap energy via the Kubelka-Munk method. The band gap energies calculated were 2.78, 2.82, 2.83 and 2.81 eV for g-C3N4, g-C3N4/Bt, g-C3N4/Ti3C2 and g-C3N4/Bt/Ti3C2, respectively.This reveals that there was no significant effect in the change of band gap energy with Bt and Ti3C2 loading with g-C3N4.Previously, Yang et al 38 reported the synthesis of 2D/2D Ti3C2/g-C3N4 heterojunction with g-C3N4 band gap of 2.80 eV, whereas, loading Ti3C2 into g-C3N4 demonstrates a negligible effect on altering band gap energy of Ti3C2/g-C3N4 compared to pristine g-C3N4.It was illustrated that introducing Ti3C2 does not change bang gap energy of g-C3N4, but light absorption ability of Ti3C2/g-C3N4 in the visible region has been enhanced, due to dark color of Ti3C2.Therefore, higher visible light absorption of g-C3N4/Bt/Ti3C2 composite in the presence of Bt and Ti3C2 would be beneficial for promoting photocatalytic activity. Furthermore, wide spectra of g-C3N4 was used to calculate valance band position as demonstrated in Fig. 6 (b).The VB of 1.48 eV was obtained for the pristine g-C3N4, which is further used to calculate conduction band (CB) position of g-C3N4 using Eq. ( 5). Using band gap energy of 2.78 eV and VB of 1.48, g-C3N4 CB of -1.30 eV is obtained.The results of current study have good agreement to the values reported in the literature.For example, CB positions of -1.35 and -1.26 eV and VB positions of 1.45 and 1.54 eV have been reported for g-C3N4 and Ti3C2/g-C3N4 composite, respectively 38.This shows g-C3N4 has more negative conduction band position and would be beneficial for stimulating photocatalytic CO2 reduction process under visible light irradiation. The photoluminescence (PL) analysis was further conducted to determine the effect of Bt and Ti3C2 on the charges separation of g-C3N4 and the results are demonstrated in Fig. 6 (c).The PL analysis was conducted using 325 nm wavelength and peaks were appeared between 450 to 500 nm for all the samples.Pristine g-C3N4 shows highest PL intensity due to the faster charges recombination rate.The PL intensity of g-C3N4 was obviously decreased with Bt loading, which confirms its function as a mediator and prevents charges recombination in the Bt/g-C3N4 composite.Similarly, addition of Ti3C2 traps electrons and improves separation efficiency, resulting in lowest PL intensity in the g-C3N4/Ti3C2 composite.This decreased in PL intensity was obviously due to good interaction between g-C3N4 and Ti3C2 2D/2D heterojunction, thus, preventing charges recombination rate due to a good conductivity of Ti3C2.Previously, it has been reported that coupling Ti3C2 with g-C3N4 to construct hybrid structure, remarkably drops charges recombination rate.This reveals that Ti3C2 effectively restrained recombination of photo-induced charge carriers and boosts electron separation and transfer due to its metallic characteristics and higher electrical conductivity 33,37.More importantly, much higher charges separation efficiency was achieved in Bt and Ti3C2 loaded g-C3N4 composite sample.This was obviously due to multiple electrons separation channels in the presence of Bt and Ti3C2 because of many intimate interface contacts formation among the three phases.Thus, successful development of 2D/2D/2D g-C3N4/Bt/Ti3C2 composite with faster charges separation was obtained and would be beneficial for stimulating photocatalytic CO2 reduction efficiency. The performance analysis of different materials was estimated by photocatalytic CO2 reduction to solar fuels using H2O as the reducing agent under visible light irradiation.The light source with and without UV-cut filters was further employed to understand the role of grown TiO2 over the monolayers of Ti3C2 nanosheets.Similarly, water with acetic acid as the sacrificial agent to promote methane formation was further explored.Initially, quality tests were conducted under two conditions: first reaction was conducted using pure nitrogen gas in the presence of catalyst and light irradiation; second, feed mixture (CO2, H2O) was used without catalyst under light irradiations.In both the cases, production of CO or CH4 were not identified in the products mixture, which confirms that catalyst is clean and any carbon containing compounds were originated during CO2 reduction in the presence of catalyst and light irradiation. The photocatalytic activity of different catalysts for the production of CO and CH4 during photoreduction of CO2 with water under visible light irradiation is presented in Fig. 7.As depicted in Fig. 7 (a) carbon monoxide (CO) is the main CO2 reduction product accompanied by appreciable amount of methane (CH4) production.Using pristine g-C3N4, a weak photoactivity with CO and CH4 evolution rate of 76 and 33 mole g-cat -1 h -1 , respectively were produced.This was obviously due to faster recombination of photo-generated electrons (e -) and holes (h ) pairs.Increasing photoactivity of g-C3N4 was obtained after coupling with Bt to construct 2D/2D g-C3N4/Bt heterojunction.Using g-C3N4/Bt composite, CO evolution rate of 285 mole g-cat -1 h -1 was observed, a 3.75-fold higher than using pristine g-C3N4 sheets.This obvious enhancement was due to the formation of 2D/2D interaction, enabling superior charges separation and their transportation within the catalyst surface.Previously, we investigated montmorillonite (Mt) clay dispersed TiO2 composites for photocatalytic CO2 reduction and water splitting applications and witnessed similar outcomes 43,44.Therefore, significantly enhanced photoactivity was apparently due to good interaction between g-C3N4 and Bt with superior charge carrier separation due to layered structure of Bt, resulting in efficient photocatalytic CO2 reduction to CO and CH4. In order to understand the influence of 2D Ti3AlC2 MAX and 2D Ti3C2 MXene on the photoactivity of g-C3N4 for photocatalytic CO2 reduction with H2O, different samples such as 2D Ti3AlC2 MAX/g-C3N4 and 2D Ti3C2 MXenes/g-C3N4 composites samples were constructed.As shown in Fig. 7 (a), a 2D MAX supported g-C3N4 showed CO evolution rate of 227 mole g-cat -1 h -1 , which is 2.98 folds higher than using pristine g-C3N4.This substantial improvement in the g-C3N4 activity towards CO evolution rate was obviously due to Ti3AlC2 conductive properties, resulting in boosted charge carrier separation.However, when 2D Ti3C2 MXene exfoliated layers were employed in the composite of g-C3N4, CO evolution rate reached to 313 mole g-cat -1 h -1 , which is 4.12-fold more than using g-C3N4 under the same reaction parameters.Thus, 2D/2D g-C3N4/Ti3C2 MXene found very efficient to promote CO2 reduction efficiency due to Ti3C2 conductive nature, enabling proficient migration and separation of electron and hole pairs for CO2 reduction and water oxidation under light irradiation.Previously, we reported photocatalytic CO2 reduction over Cu-loaded CNTs/g-C3N4 and CO was identified as the main product over the entire irradiation time 45.Similarly, enhanced photocatalytic CO2 reduction to CO and CH4 over 2D/2D Ti3AlC2 dispersed pg-C3N4 has been reported under visible light irradiations 46. In order to investigate the role of Bt and Ti3C2 as cocatalyst on the photocatalytic performance of g-C3N4, photocatalytic CO2 reduction experiments for CO and CH4 production were conducted over 2D/2D/2D g-C3N4/Bt/Ti3C2 MXene composite under visible light irradiation.As shown in Fig. 7 (a), pure g-C3N4 and binary composites of Bt/g-C3N4 and g-C3N4/Ti3C2 found efficient for selective CO2 reduction to CO, however, g-C3N4/Bt/Ti3C2 composite found encouraging to stimulate both CO and CH4 evolution.As expected photocatalytic CO evolution of 326 mole gcat -1 h -1 was achieved over g-C3N4/Bt/Ti3C2 MXene composite, nearly 1.04, 1.43, 1.14 and 4.29 times more than using g-C3N4/Ti3C2, g-C3N4/Ti3AlC2, g-C3N4/Bt and g-C3N4 composite samples, respectively.The Ti3C2 serves as a Schottky junction with g-C3N4 and Bt serves as an electron mediator, resulting in efficient separation of photo-induced electrons, which is crucial in photocatalytic CO2 reduction applications.Notably, CH4 evolution rate of 230 mole g-cat -1 h -1 was obtained over the ternary g-C3N4/Bt/Ti3C2 composite sample, which is nearly 4.18, 4.42, 16.17, 4.18 times more than using g-C3N4/Ti3C2, g-C3N4/Ti3AlC2, g-C3N4/Bt and g-C3N4 samples, respectively.This enhanced photoactivity over g-C3N4/Bt/Ti3C2 composite towards selective methane formation was obviously due to more production of electrons with superior separation and transformation to provide sufficient electrons density within the heterostructure of the composite catalyst for transforming CO2 to CH4.Previously, enhanced photocatalytic CO2 reduction with H2O to CH4 over the carbon implanted SnS2 under visible light has been reported 47.The photoactivity of catalyst for CH4 production was increased due to higher CO2 adsorption over the C-SnS2 active sites, noticeable charge transfer between Sn and S together with C, resulting in availability of electrons density to activate CO2 over the catalyst surface. Relatively, 2D Ti3C2 MXene found more efficient for migration and separation of charge carrier compared with Ti3AlC2 MAX structure.The CO evolved over the 2D/2D g-C3N4/Ti3C2 MXene composite was 1.38-fold higher than using 2D/2D g-C3N4/Ti3AlC2 MAX composite.These findings could be explained based on the conductive properties and their interfacial interaction with g-C3N4 to construct a good heterojunction.First, Ti3AlC2 is less conductive compared to Ti3C2 due to the presence of Al in the MAX structure.Thus, charges separation in Ti3AlC2/g-C3N4 would be less proficient than using g-C3N4/Ti3C2 MXene composite.Second, interaction between Ti3AlC2/g-C3N4 is not good compared to Ti3C2/g-C3N4 composite as demonstrated in Fig. 7 (b c).As demonstrated in Fig. 7 (b), Ti3AlC2 has compact sheets to give bulk structure and g-C3N4 can only be distributed over the bulk surface, resulting in poor interaction between 2D Ti3AlC2 and 2D g-C3N4.Thus, charges produced over the g-C3N4 has more potential to recombine, compared to transfer towards Ti3AlC2, resulting in lower activity during CO2 reduction process. Comparatively, Ti3C2 has exfoliated layers structure and g-C3N4 has been intimate interface interaction over the individual layered structure as demonstrated in Fig. 7 (c).Therefore, 2D Ti3C2 has good interaction with 2D g-C3N4 to construct 2D/2D heterojunction with superior charge carrier separation.Under visible light irradiation, photo-generated electrons over the g-C3N4 surface can proficiently be separated, resulting in enhanced CO2 reduction to methane under visible light irradiation.Previously, photocatalytic CO2 reduction to CO over Z-scheme g-C3N4/Bi2O2 BO2(OH) has been investigated under visible light irradiation 48.It was observed that compared to mechanically-mixed g-C3N4 synthesis approach, ball milling method provides an intimate interface interaction between g-C3N4 and Bi2O2 BO2(OH), thus exhibits more efficient photocatalytic performance.This further confirms that interaction among the materials is very promising to maximize photocatalytic activity towards enhanced CO2 reduction. According to thermodynamics, 2 electrons are required for CO2 reduction to CO, compared to 8 electrons for the methane production.Due to good interaction among Bt, Ti3C2 and g-C3N4, a 2D/2D/2D heterojunction is developed, providing a good interfacial charge transfer potential. Thus, more production of electrons and their transforming for CO2 reduction, enabling more production of CH4.This phenomenon is further illustrated in thermodynamic analysis and reaction mechanism sections.Previously, enhanced CO2 reduction to CO over 2D/2D Ti3C2 MXene/g-C3N4 nanosheets heterojunction for high efficient photocatalytic CO2 reduction has been investigated 38.In another development, 1D CdS nanorods/2D Ti3C2 MXene nanosheets for enhanced photocatalytic hydrogen production was obtained 42.Similarly, g-C3N4/Ti3C2 with enhanced photocatalytic CO2 reduction to CO has been reported due to superior charge carrier separation 49.Enhanced photocatalytic CO2 reduction to CO and CH4 over TiO2 coupled with surfacealkalinized titanium carbide MXene as co-catalyst has been investigated 50.2D/2D heterojunction of MXene/Bi2WO6 with enhanced photocatalytic CO2 reduction to CH4 and CH3OH was obtained 51.Similarly, production of CO with smaller amount of CH4 was obtained over g-C3N4 However, production of CH4 was obviously increased, when C3N4 was coupled with Ti3C2, due to more production of charge carrier and their proficient separation over the conductive Ti3C2 surface.Highest CO and CH4 amounts were obtained when 2D/2D/0D TiO2/C3N4/Ti3C2 composite heterojunction photocatalyst was constructed 52.Thus, constructing 2D heterojunction of g-C3N4 with 2D/2D Ti3C2/Bt is promising to maximize catalytic activity due to proficient migration and transportation of charge carrier because of good interface interaction, more CO2 uptake and high light absorption under visible light irradiation. The light source has a significant contribution to alter the performance of photocatalyst, g-C3N4/Bt/Ti3C2 composite catalyst was further evaluated under different visible light sources and results are demonstrated in Fig. 8 (a).Obviously, productions trends of CO and CH4 are different using visible light irradiations under UV-cut filters (420 nm) and without filters.Using UV-cut filter, lower amount of CH4 was produced, which was significantly increased under visible light irradiation without UV-filters.The CH4 evolution of 101 mol g-cat -1 was obtained under UV-cut filters, which was increased by 4.6 folds higher (460 mol g-cat -1 ) without UV-cut filters. Similarly, production of CO was increased by 1.3 folds higher without UV-cut filters.These findings could be explained based on the availability of total light intensity (UV and visible light) for photocatalytic CO2 reduction reaction.Furthermore, during controlled HF etching of Ti3AlC2, TiO2 NPs were produced, thus, it can be activated by the light irradiations, producing electrons and holes.The photogenerated electrons from CB of TiO2 (-0.52 eV) would be transferred towards VB of g-C3N4, enabling their efficient separation.However, this mechanism would be limited compared to g-C3N4 activation due to the presence of only small portion of TiO2 NPs over the Ti3C2 surface. According to thermodynamics, 8 electrons are required for CO2 reduction to CH4 compared to only 2 electrons involvement for CO production.When UV-cut filters were employed, light intensity was also reduced, whereas, only g-C3N4 was activated for the production of charge carriers.In this case, lower number of electrons would be generated, resulting in production of CO as the major product.Conversely, when visible light without UV-cut flirters was employed, light intensity would be increased, whereas, it has potential to activate g-C3N4 and TiO2 NPs produced over the Ti3C2 layers, resulting in more production of electrons.Due to proficient production of charge carriers, CO2 was effectively converted to CO and CH4 with the involvement of 2 and 8 electrons, respectively.Besides, CO would also be converted to CH4 with the utilization of 6 electrons, resulting in more production of methane.Previously, MoS2 and Ti3C2 MXene as cocatalyst for enhanced photoactivity of TiO2 for photocatalytic hydrogen production has been reported 53.Thus, a mixture of UV and visible light is more promising to maximize CO2 reduction efficiency towards selective methane production due to more production of electrons and holes. The performance of g-C3N4/Bt/Ti3C2 composite catalyst was further investigated by varying CO2/H2O feed ratio under the same operating conditions.It could be noted that CO2 was bubbled through the water saturator and amount of water vapors carry by CO2 were dependent on the vapor pressure of water.Using lower water temperature, CO2 would carry lower water vapors and higher CO2/H2O feed ratio would be obtained.Conversely, using higher water temperature, more vapors would be produced, thus CO2 carry more water vapors at high temperature and lower CO2/H2O feed ratio is achieved.For getting different amounts of water vapors in a CO2 feed stream, the water saturator temperature was varied from 15 to 45 o C under constant CO2 flow rate (20 mL min - 1 ) and catalyst loading (0.15 g).The performance analysis of g-C3N4/Bt/Ti3C2 was calculated based on production of CO and CH4 under different irradiation times. The production of CO and CH4 at different initial water saturator temperature (i.e., different CO2/H2O feed ratios) have been demonstrated in Fig. 9. Production of CO in Fig. 9 (a) revels feed mixture has significant contribution on the production rate.Obviously, CO was continuously produced with time on stream, however, production trends were different using different water saturator temperature.Highest CO production of 619 mole g-cat -1 was obtained using temperature of 30 o C, which is 1.30 and 2.0 times more than employing 45 and 15 o C water saturator temperature, respectively.Fig. 9 (b) demonstrates production of CH4 over the irradiation time at different feed temperatures.The production trends for CH4 were similar to CO production, whereas, highest amount of CH4 was produced at lower CO2/H2O feed ratio.In addition, CH4 evolution rate (460 mole g-cat -1 ) at 30 o C was 3.7 and 1.8 timers more than its production at 45 and 15 o C, respectively.This indicates that addition of more water vapors into reactor not only improve photoactivity, but also significantly enhances methane production due to the more availability of hydrogen. During photocatalysis, uptake of CO2 and water should be attached to catalyst active sites for proficient reduction and oxidation process.With feed temperature of 15 o C, higher CO2/H2O feed ratio in reactor system, resulting in more amount of CO2 attached to catalyst surface compared to water.Under such conditions, majority of the active sites are occupied by the CO2 molecules, whereas water molecules have to compete with CO2 for the adsorption.Thus, amount of water attached to catalyst surface would not be enough to carry proficient oxidation process, resulting in lower production of protons (H ) and more charge carrier recombination.However, when temperature was increased to 45 o C, lower CO2/H2O feed ratio was achieved.This shows, water vapor rich CO2 feed mixture was passed through reactor to saturate the catalyst surface.Under such condition, there would be more attachment of water molecules with catalyst active sites, resulting in lower photo-activity.This was obviously, CO2 has to compete with water molecules for its adsorption, and if lower amount of CO2 is attached with catalyst surface, reduction reaction would be slowed down, resulting in lower efficiency.Highest amount of CO and CH4 were produced at temperature 30 o C, probably both CO2 and H2O would be attached to catalyst surface, resulting in proficient oxidation and reduction reaction with lower charge carrier recombination rate. More importantly, production of CH4 was increased by 3.7 folds higher compared to CO increment of 2.0, when temperature was increased from 15 to 30 o C under the same operating conditions.This further confirms, a greater number of protons (H ) available for CO2 reduction to CH4 as illustrated in reaction mechanism section.In general, 8 protons are required for the conversion of one mole of CO2 to one mole of CH4 with the involvement of 8 electrons.Comparatively, only 2 protons and 2 electrons are involved for the reduction of one mole of CO2 with one mole of CO production. Therefore, highest performance of composite catalyst with selective production of CO and CH4 can be obtained at optimized CO2/H2O feed ratio as demonstrated Fig. 9 (c).Previously, we investigated the performance of Ni-loaded MMT/TiO2 composite for photocatalytic CO2 reduction with CH4 under different molar feed ratios of CH4/CO2.Comparatively, highest CO was attained at lower CH4/CO2 feed ratio, however, H2 evolution rate was increased by increasing the amount of CH4 in the feed mixture due to sorption completion between the feed mixture molecules 44. Similarly, highest performance of Ag-La/g-CNT was achieved, when water was introduced into CO2 and CH4 feed mixture 54.All these findings confirm that performance of catalyst can be maximized under optimized feed ratio of CO2/H2O due to their competitive attachment over the catalyst active sites for proficient reduction and oxidation process. The performance of g-C3N4/Bt/Ti3C2 composite catalyst was further investigated using hydrogen rich atmosphere during photo-induced CO2 reduction by water.For this purpose, acetic acid (10 vol.) aqueous solution was used as a source of vapors, while CO2 with flow rate 20 mL/min was constantly flowing to carry vapors.Using CO2-water system, CO was produced in a significant amount, however, CH4 production was substantial during CO2 reduction with water/acetic acid water mixture.Fig. 10 shows the performance of g-C3N4/Bt/Ti3C2 for the production of CO and CH4 during photocatalytic CO2 reduction with acetic acid aqueous solution.Fig. 10 (a) demonstrates photocatalytic CH4 production during CO2 reduction under different feed mixtures of water and acetic acid over the irradiation time.Using water/acetic acid feed mixture, amount of CH4 yield rate (1909 mole g-cat -1 ) of 4.2 folds higher was obtained compared to its production with CO2-water feed mixture.However, a continuous production of CH4 was obtained in both types of reaction system.Similarly, continuous production of CO was evolved in both the reaction systems e.g., using CO2-water and CO2-water/acetic acid reaction system.As demonstrated in Fig. 10 (b), initially lower CO amount was produced using CO2-water/acid system, but it was obviously increased over prolonged irradiation time.The highest CO evolution of 719 mole g-cat -1 was obtained in the presence of acetic acid in the feed mixture, which is 1.18 folds higher than using CO2-water reaction system.Previously, 2D Ti3C2 MXene/Fe3O4 composite was explored for methylene blue (MB) adsorption and found enhanced efficiency under acidic condition 55. These findings can be discussed based on photocatalytic CO2 reduction and steam reforming of acetic acid under visible light irradiations.With CO2-water system, highest CO production was attained compared to CH4, probably due to CO2 reduction and water splitting competing reactions, whereas amount of hydrogen produced was consumed for CO2 reduction to CO with the involvement of 2 electrons.However, during CO2 reduction to CH4, 8 protons and 8 electrons are required.Due to deficiency in the amount of hydrogen available, during photo-induced CO2 reduction using H2O as reducing agent, CH4 production was not significant.Comparatively, when CO2 reduction was conducted in the presence of water/acid aqueous solution, it was encouraging to generate more hydrogen (protons ions, H ) through photocatalytic steam reforming of acetic acid as demonstrated in Eq. ( 6) and (7).Accordingly, production of hydrogen would be in excess for the production of CH4 in the presence of proton rich reaction system. CH COOH 2CO 2H As discussed previously, using CO2-water system, higher amount of CO was evolved, however, water/acetic acid mixture promoted CH4 production over the entire irradiation time.This was obviously due to more production of CO during the startup of reaction, which was finally converted to CH4 during the involvement of hydrogen.It suggests methane production require excess number of protons during photocatalytic CO2 reduction process.Previously, we investigated photocatalytic CO2 reduction in the presence of methanol as the sacrificial reagents over Ti3AlC2/g-C3N4/TiO2 composite and hydrogen was obtained as the main product over the entire irradiation 56.Thus, photocatalytic CO2 reduction performance can be enhanced by introducing sacrificial reagents The performance of all the catalyst samples were further compared with the yield rates and selectivity of CO and CH4.As demonstrated in Table 1, using pure g-C3N4, CO and CH4 production rate of 76 and 33 mole g-cat -1 h -1 at selectivity 69.72 and 30.28 , respectively, were achieved. This confirms that g-C3N4 favored CO2 reduction to CO, however, production rate is lower due to charges recombination over the catalyst surface.The selectivity for CO production was increased to 84.57(285 mole g-cat -1 h -1 ) and 94.98 (227 mole g-cat -1 h -1 ) over Bt/g-C3N4 and g-C3N4/Ti3AlC2, respectively.This reveals that both Bt and Ti3AlC2 promoted the production rate and selectivity due to superior charges separation rate.When Ti3C2 was coupled with g-C3N4, a selectivity of 85.05 (313 mole g-cat -1 h -1 ) was obtained, which is 4.11 times more than using pure g-C3N4.More interestingly, amount of CO produced was increased over g-C3N4/Bt/Ti3C2 composite, but selectivity was reduced compared to g-C3N4.The CO selectivity over g-C3N4/Bt/Ti3C2 of 58.63 was obtained, which is 1.45 and 1.19 folds lower than it was produced over g-C3N4/Ti3C2 and g-C3N4, respectively.Conversely, production rate of 230 mole g-cat -1 h -1 was obtained for CH4 with selectivity 41.37 , which is 2.76 and 1.37 folds higher than the selectivity obtained over g-C3N4/Ti3C2 and g-C3N4, respectively.This elucidates that g-C3N4/Bt/Ti3C2 composite is promising for selective photocatalytic CO2 methanation under visible light irradiation. More remarkably, CO selectivity of 27.65 (365 mole g-cat -1 h -1 ) was reached when acetic acid was introduced into water (10 acetic acid).This CO production rate is nearly 1.12, 1.16 and 4.80 times more than using g-C3N4/Bt/Ti3C2, g-C3N4/Ti3C2 and pristine g-C3N4 samples, respectively, with CO2-water reaction system.These findings show that acetic acid is not favorable for photocatalytic CO2 reduction to CO. Comparatively, CH4 production rate (955 mole g-cat -1 h -1 ) over g-C3N4/Bt/Ti3C2 of 4.15, 17.36 and 28.93 times more was produced than using g-C3N4/Bt/Ti3C2, g-C3N4/Ti3C2 and g-C3N4, respectively.This amount of CH4 production was 4.15, 17.36 and 28.93 folds higher than it was produced over g-C3N4/Bt/Ti3C2, g-C3N4/Ti3C2 and g-C3N4, respectively, using only water as the reducing agent.Similarly, a selectivity of 72.35 for CH4 was obtained with acetic acid as the sacrificial reagent, compared to CH4 selectivity of 41.37, 14.95 and 30.28 with g-C3N4/Bt/Ti3C2, g-C3N4/Ti3C2 and g-C3N4 samples, respectively, using only CO2-water reaction system.All these findings confirm that CO2 reduction efficiency towards selective methane production can be stimulated using suitable sacrificial reagent.Previously, halide perovskite as a catalyst has been tested for photocatalytic CO2 reduction in the presence of water/methanol and CO was identified as the main product.The enhanced CO production was obtained due to simultaneous CO2 reduction and methanol oxidation process over the catalyst surface 57.In the current work, acetic acid found very promising sacrificial reagent to provide more protons for improving selective CO2 reduction to CH4 over g-C3N4/Bt/Ti3C2 composite catalyst under visible light.Therefore, sacrificial reagent is important to enhance photoactivity due to maximizing oxidation process with production of more protons, enabling efficient CO2 reduction. Although, calculation of yield rate is promising to equate performance of dissimilar photocatalytic systems, nevertheless, it is useful only under the same operating conditions with similar quantity of catalyst.In the recent development of photo-reactors performance analysis, quantum yield (QY) analysis is most promising as it correlates the production rate of a specific product with photon flux utilization.The CO and CH4 QY over different catalysts samples and reducing agents has been summarized in Table 1.Using pristine g-C3N4, a QY of 0.25 was achieved, which was feed mixture to remove the products before starting the next cycle and the results are demonstrated in Fig. 11 (a).Obviously, continuous production of CH4 and CO were obtained after consecutive three cycles under the same reaction conditions and photocatalytic performance retained almost unchanged.Such remarkable performance can be ascribed to intimate and good interface contact of 2D layered structure of g-C3N4 with 2D Bt and 2D Ti3C2 monolayers, thus beneficial for rapid migration and separation of photo-induced charge carrier.Besides, layered structure of clay minerals (Al/Si) and exfoliated MXenes multilayers (Ti, C) provides stability to g-C3N4 due to preventing carbon formation and providing proficient sorption process over the composite catalyst surface.Previously, photocatalytic CO2 reduction with CO and CH4 production over 2D g-C3N4/Ti3C2 was investigated and reported the similar findings 38.Similarly, 2D/2D/0D TiO2/C3N4/Ti3C2 MXene composite catalyst demonstrated continuous production of CO and CH4 during consecutive four cycles under visible light irradiation 52.In order to confirm this perspective, spent catalyst after consecutive three cycles were collected and analyzed through Raman and TGA analysis. The Raman analysis of spent g-C3N4/Bt/Ti3C2 catalyst shows no obvious changes in interaction of elements in the composite catalyst as demonstrated in Fig. 11 (b).The Raman peaks appeared at 204.9, 353.3, 472.4,703.9, 983.7, 1228.4,1305.6 and 1572.6 cm -1 , confirms the existence of Bt, g-C3N4 and Ti3C2 in both the fresh and spent catalyst samples.More importantly, peaks shift was not identified in the composite of g-C3N4/Bt/Ti3C2, which confirms high stability of catalyst for continuous photocatalytic CO2 reduction to CO and CH4 under visible light irradiations. Further investigation on the fresh and spent g-C3N4/Bt/Ti3C2 composite catalyst was conducted using Thermogravimetric analysis (TGA) and the results are demonstrated in Fig. 11 (c-d).The TGA curve of fresh catalyst reveals that composite was non-volatile up to 500 o C, even under air flow.However, a strong endothermic peak appeared at temperature of 698 o C, with a weight loss of 75 wt., indicating strong decomposition of g-C3N4/Bt/Ti3C2 composite due to the presence of carbon in g-C3N4 and Ti3C2 fragments 58.The TGA analysis of spent g-C3N4/Bt/Ti3C2 composite catalyst showed the same patterns of non-volatile and decomposition curves.However, in the spent catalyst, initially there was more weight lost compared to spent sample, obviously due to moisture attached to catalyst surface.Therefore, TGA results directly confirms that the spent composite of g-C3N4/Bt/Ti3C2 has no additional carbon deposited during photocatalytic CO2 (d-i) EDX mapping analysis. According to thermodynamics, water is not a good reducing agent due to its much lower reduction potential compared to CO2 reduction potential for the production of its intermediates.Under such conditions, water splitting reaction has potential to compete with CO2 reduction, resulting in lower efficiency for CO and CH4 production.The Gibbs energy for conversion of CO2 with H2O to CH4 and O2 through thermal process has more positive change ( NHE) due to endothermic nature of this reaction system.However, CO2 activation under solar energy requires minimum energy gap of 818 kJ/mole to overcome barrier between reactants and products at their thermodynamic standard state.More importantly, during CO2 reduction with H2O, water splitting reaction consumed more energy for hydrogen ions production, before being consumed for CO2 reduction to CO.It is also well established that during CO2 reduction, initially, CO is produced, which is finally converted to CH4 and schematic of this system has been demonstrated illustrated in Fig. 13 (a). The endothermic reaction can be initiated by supplying energy as heat, electricity or sunlight.In the first stage water splitting occurs to produce H /e -pairs or equivalent to H and production of methane is completed after utilization of 4 pairs of H /e -for one molecule of methane using solar energy as illustrated in Fig. 13 (b).Furthermore, thermodynamically, molecular H2 is equivalent to 2H /2e -pairs and requires energy gap of ( G kJ mol or 1.23 V vs. NHE).This amount of energy must be overcome to produce either molecular H2 or pair of 2H /2e -, however, intermediates formed are immediately consumed by CO2 reduction for methane formation.More importantly, change in Gibbs energy for CO2 to CH4 formation is negative, thus an exothermic reaction occurs spontaneously under standard conditions.Finally, system energy was released and reducing energy from S2 to S3 at the end of completing this reaction, which lies between S1 and S2 in the activation energy of thermodynamic system.The CO2 and CO methanation are possible chemical reaction for the production of methane according to Eq. ( 8) and (9). Eq. ( 8) involves reversed water gas shift reaction for CO and H2O production during catalytic reduction of CO2 by H2.However, production of CH4 through Eq. ( 9) is one of the important chemical reaction in Fischer-Tropsch synthesis involving the utilization of synthesis gas (CO and H2).Thus, photocatalytic CO2 methanation is the most promising for sunlight energy storage and recycling greenhouse gas.The single step CO2 methanation is conducted using H2 under sunlight according to reaction in Eq. ( 10) 59. During photocatalytic CO2 reduction with H2O over the g-C3N4/Bt/Ti3C2 composite catalyst, CO and CH4 were obtained as the potential products.For better understanding about the activity enhancement of g-C3N4/Bt/Ti3C2 composite catalyst towards photocatalytic CO2 reduction to CO and CH4, a possible photocatalytic mechanism is illustrated in Fig. 14.First, electronic band structure was determined to analyze the possible mechanism for photocatalytic CO2 reduction. Consequently, as displayed in Fig. 6 (b), VB position of 1.48 eV and CB of -1.30 eV was calculated using Eq. ( 5) with the help of bang gap energy 2.78 V for g-C3N4 and similar observations have been reported in the literature 38.The reaction steps for superior charge carrier steps and their consumption for CO2 reduction and water oxidation with the production of CO and CH4 are demonstrated in Eqs. ( 11)- (18). Upon visible light irradiation, electrons were excited from the VB to CB of g-C3N4, leaving the holes in the VB, resulting in production of charges carrier (e -/h ) (Eq. 11).The photo-induced electrons over the g-C3N4 surface would be trapped by Bt due to its electron trapping ability and good interaction with g-C3N4 due to 2D/2D exfoliated heterojunction (Eq.12).Besides, electrons from the CB of g-C3N4 were effectively migrating towards conductive Ti3C2 due to its higher work function as demonstrated in Eq. ( 13).The presence of ultrathin Ti3C2 nanosheets and good interaction with Bt expedited separation and transportation of photoexcited carriers over the g-C3N4 surface, resulting in efficient CO2 reduction and water oxidation.The electrons are consumed for the reduction of CO2 to its radical as illustrated in Eq. ( 14).Similarly, holes are consumed for Fig. 2 (a) XRD patterns of Ti3AlC2 MAX and Ti3C2 MXenes; (b) XRD patterns of Bt, g-C3N4 and their composites; (c) Raman analysis of corresponding samples. Fig. 3 FESEM analysis of g-C3N4, Bt, Ti3AlC2, Ti3C2 and their composites: (a) SEM image of g-C3N4, (b) SEM image of Bt, (c) SEM image of Ti3AlC2,(d-e) SEM images of Ti3C2 (24 h) at different magnification, (f) SEM images of Ti3C2 (24 h) with growth of TiO2, (g) SEM image of g-C3N4/Bt, (h-i) SEM images of g-C3N4/Bt/Ti3C2 composite with different magnification, (j-k) EDX mapping analysis of g-C3N4/Bt/Ti3C2 composite catalyst. Fig. 4 TEM analysis of g-C3N4, Ti3AlC2 and g-C3N4/Bt/Ti3C2 composite samples: (a) TEM image of g-C3N4, (b) TEM image of Ti3AlC2, (c-e) TEM images of g-C3N4/Bt/Ti3C2 composite, (f-h) HRTEM images of g-C3N4/Bt/Ti3C2 composite, (i-m) d-spacing calculation of g-C3N4, TiO2, Bt and Ti3C2 samples. (a), the C 1s spectra of g-C3N4/Bt/Ti3C2 composite with five peaks located at 282.8, 284.6, 286.4,288.1, and 289.5 eV are assigned to Ti-C, C-C, C-O, C-N and C-NC, respectively.The binding energy of 282.8 and 284.6 eV of C 1s ascribed to the presence of carbon due to Ti-C and organic precursor.However, peaks at 286.4, 288.1 and 289.5 eV were due to the existence of O and N in the g-C3N4 as C-O, C-N and C-NC, respectively.Fig. 5 (b) shows high resolution Ti 2p spectra of g-C3N4/Bt/Ti3C2 composite with four peaks located at 453.1, 457.5, 460.2 and 465.1 eV are assigned to Ti (I, II or IV), Ti 2 (I, II or IV) and Ti 3 (I, II or IV), ) illustrates Al 2p and Si 2p peaks of pristine bentonite and g-C3N4/Bt/Ti3C2 composites.Fig. 5 (e) shows binding energy of Al 2p in Bt with peak located at 76.6 eV, presenting to Al of Bt.However, in composite of g-C3N4/Bt/Ti3C2, Al 2p peaks with binding energies 69.8 and 77.7 eV can be assigned to Al in Ti3C2 and presence of Al oxide in the composite sample.Similarly, obvious Si 2p of Bt and g-C3N4/Bt/Ti3C2 composites with binding energies 104.1 and 104.2 eV are relating to Si in the Bt as shown in Fig. 5 (f).All these findings confirm successful development of g-C3N4/Bt/Ti3C2 composites through ultrasonic approach. Fig. 5: XPS spectra of g-C3N4, Bt and g-C3N4/Bt/Ti3C2 composite: (a)C 1s, (b) Ti 2p, (c) N 1s, (d) O 1s (e) Al 2p and Si 2p. Fig.6(a) UV-vis DRS spectra of Ti3C2, Bt, g-C3N4, and Bt/Ti3C2 modified g-C3N4 composite samples, (b) Calculation of valance band (VB) from wide spectra of g-C3N4, (c) Photoluminescence (PL) spectra of g-C3N4, Bt/g-C3N4, g-C3N4/Ti3C2 and g-C3N4/Bt/Ti3C2 composite samples. Photocatalyst Fig.8 Performance analysis of g-C3N4/Bt/Ti3C2 composite for photo-induced CO2 reduction to CO and CH4 under visible light with/without UV-cut filters. Fig. 9 Effect of feed temperature (15, 30 45 o C) on the performance of g-C3N4/Bt/Ti3C2 composite catalyst under visible light irradiation for (a) CO and (b) CH4 evolution, (c) Effect of CO2/H2O feed ratio for CO and CH4 evolution. Fig. 10 Effect of sacrificial reagents (acetic acid, 10) on the performance of g-C3N4/Bt/Ti3C2 composite catalyst under visible light irradiation; (a) CO evolution, (b) CH4 evolution. Fig.11(a) Reusability of g-C3N4/Bt/Ti3C2 composite for CO2 reduction to CO and CH4 using water/acetic acid feed mixture under visible light, (b) Raman analysis of g-C3N4/Bt/Ti3C2 before and after the stability cycles, (c) TGA analysis of g-C3N4/Bt/Ti3C2 composite catalyst. Fig. 12: TEM and EDX mapping analysis of spent g-C3N4/Bt/Ti3C2 composite sample after three cycles: (a-b TEM images of g-C3N4/Bt/Ti3C2 sample, (c) HRTEM image for d-spacing calculation, Fig. 13: Thermodynamic analysis for photocatalytic CO2 methanation under visible light irradiations; (a) Solar methanation scheme, (b) Photoreaction pathways. Fig. 14: Proposed mechanism for photocatalytic CO2 conversion to CO and CH4 over g-C3N4/Bt/Ti3C2 heterojunction system under visible light. of 35.92 o , 41.70 o , 60.56 o , 72.39 o and 76.24 o , can be assigned to Ti3C2 MXene structure.Furthermore, it could be seen that there was no effect of time on the formation of Ti3C2 nanosheets, however, hydrothermal oxidation of Ti3C2 caused the growth of TiO2 NPs across the g-C The authors would like to extend their deepest appreciation to University Technology Malaysia for financial support of this research under Fundamental Research (UTMFR, PY/2019/01654). such as acetic acid, methanol and others.The sacrificial reagents not only encourage more production of protons, but also provides electrons during oxidation process, resulting in more production of methane under the same reaction conditions, as illustrated in reaction mechanism section.In conclusion, the selective production of CH4 during photocatalytic CO2 reduction with water/acetic acid feed mixture would be due to the followings possible pathways; (a) steam reforming of acetic acid for hydrogen production in parallel of CO2 reduction reaction, (b) photocatalytic CO2 methanation in the presence of hydrogen rich reaction system, (c) consumption of holes by scavenger, preventing charge carrier recombination rate, and (d) proficient adsorption of feed mixture in the presence of acid/basic environment of feed mixture and catalyst.(mol/g-cat) increased to 1.031 and 1.074 in the presence of g-C3N4/Ti3C2 and g-C3N4/Bt/Ti3C2 samples, respectively.This reveals that coupling g-C3N4 with Bt and Ti3C2, enables more utilization of photon energy, enabling proficient electrons generation with their superior separation for efficient CO2 reduction to CO and CH4.On the other hand, QY for CH4 of 0.109 was increased to 0.171, 0.181 and 0.758 using Bt/g-C3N4, g-C3N4/Ti3C2 and g-C3N4/Bt/Ti3C2 samples, respectively. More importantly, QY was significantly enhanced when acetic acid was used as the sacrificial reagents under the same reaction conditions.Highest QY of 3.146 for CH4 production over g-C3N4/Bt/Ti3C2 composite with acetic acid as the sacrificial reagents was achieved.This amount of QY for CH4 production with acetic acid as the sacrificial reagent was 4.15 folds higher than using only water as the reducing agent.These findings confirm acetic acid as the promising sacrificial reagent and g-C3N4/Bt/Ti3C2 as the efficient composite catalyst for promoting photocatalytic CO2 reduction to CH4 under visible light irradiations. The reproducibility and stability of g-C3N4/Bt/Ti3C2 composite catalyst in cycles was further tested to determine the life of catalyst for continuous photocatalytic CO2 reduction to CO and CH4 under visible light irradiation.For this purpose, after every cycle, reactor was flushed with nitrogen and reduction process.This further confirms high stability of g-C3N4/Bt/Ti3C2 composite in consecutive three cycles and can be employed in solar energy applications.All these findings confirm that CO2 was effectively converted to CO and CH4 over the g-C3N4/Bt/Ti3C2 composite catalyst under visible light irradiation.Thus, total number of moles of CO and CH4 produced over the catalyst surface would be equal to the number of moles of carbon dioxide converted during photocatalytic CO2 reduction process. The morphology of spent g-C3N4/Bt/Ti3C2 composite was further investigated using HRTEM and EDX mapping analysis.As shown in Fig. 12 (a-b), g-C3N4 and Bt are evenly and uniformly distributed over the Ti3C2 nanosheets to develop 2D/2D/2D/ heterojunction of g-C3N4/Bt/Ti3C2.Furthermore, distortion in structure was not identified after the cyclic runs, which confirms good interaction between the specimens.More importantly, formation of carbons as particles or nanotubes were not identified over the catalyst surface during photocatalytic CO2 reduction process.This further confirms that photocatalysis process provides high stability to catalyst as compared to thermal reforming processes such as CO2 reforming with methane.HRTEM image in Fig. 12 (c) revealed d-spacing of 0.33, 0.29 and 0.27 nm for g-C3N4, Bt and Ti3C2-OH, respectively, which is in good agreement with Raman results.The EDX mapping analysis in Fig. 12 (d-i) confirms uniform the presence of all the elements such as C, N, Al, Si and Ti in the g-C3N4/Bt/Ti3C2 composite sample, confirming high stability of catalyst and elements in the catalyst were not reacted during photocatalysis process.This further confirms that carbon-based products were obtained only during photocatalytic CO2 reduction process under visible light irradiation. According to experimental results, both CO and CH4 were produced during CO2 reduction by H2O under visible light.Importantly, when CO2-H2O atmosphere is replaced with CO2-water/acetic acid solution, high production of CO and CH4 was obtained, which confirms production of CH4 involving reactions in Eqs. ( 8) to (10).These observations confirm that CH4 is produced during consumption of CO and H2 under light irradiation.Recently, enhanced photocatalytic CO2 reduction to CH4 with yield rate 13.6 mole g-cat -1 h -1 and selectivity 88.3 over Pt-decorated SiC nanosheets has been reported 60.It has been observed that produced CO by 2 electrons could be adsorbed over Pt NPs, while, electrons provided by SiC NSs possess strong enough potential to trigger further reduction of CO to CH4.Thus, during photocatalytic CO2 reduction, first CO was produced, which was finally converted to CH4.Besides, this process not only retarded the possibility of catalyst poisoning, but also boosted methane generation rate.Previously, we investigated photocatalytic CO2 reduction with H2O/H2 over Mt/g-C3N4 surface and CO/CH4 were identified as the potential products 15.Thus, it can be estimated that during photocatalytic CO2 reduction over Bt/g-C3N4/Ti3C2, firstly CO is produced, which was finally converted to CH4 due to the presence of high-density electrons over the composite catalyst surface. the production of protons and oxygen as demonstrated in Eq. ( 15).The production of CO and CH4 was obtained through the involvement of 2 and 8 electrons and protons as illustrated in Eqs.(16) to (17).The acetic acid present in the feed mixture also undergoes oxidation with the production of protons and carbon dioxide as demonstrated in Eq. ( 18). Furthermore, Ti3C2 develop Schottky junction with g-C3N4, enabling proficient electrons transfer in the composite for dynamic photocatalytic CO2 reduction to CO and CH4 and similarly reported in the literature 37,52.As the conduction band (CB) position of g-C3N4 (-1.30eV) is more negative than the reduction potential of CO2/CO (-0.48 eV) and CO2/CH4 (-0.24 eV), thus, thermodynamically, production of CO and CH4 would be possible.Besides, g-C3N4 can oxidize H2O into O2 due to more positive VB of g-C3N4 (1.48 V) compared to oxidation potential of H2O/O2 (0.82 eV vs. SHE at pH7) and similarly reported in the literature 38,61.It could be seen that the production of CH4 requires 8 electrons and 8 protons during CO2 reduction process compared to only 2 electrons and 2 protons needed for CO production.Due to fast recombination of photogenerated charges over the pristine g-C3N4, very weak photocatalytic CO2 reduction over g-C3N4 with smaller amounts of methane was obtained.However, highest production of methane was obtained over the g-C3N4/Bt/Ti3C2 composite catalyst due to combined effects of Bt and Ti3C2 for preventing charges recombination and providing multiple electron separation pathways for the conversion of CO2 and CO to CH4.Previously, Ti2C/TiO2/M has been reported with enhanced photocatalytic activity due to superior interfacial charge transfer separation from TiO2 towards Ti2C and M in multiple electron separation channels 62.Besides, in the presence of acetic acid, there would be more production of protons (H ) compared to using only water, thus it would be beneficial for transforming more CO2 into CO and finally to CH4.This confirms proficient production of electrons and protons over the composite catalyst enabling more production of methane under visible light irradiation.Therefore, controlled synthesis of 2D/2D/2D heterojunction of g-C3N4/Bt/Ti3C2 with excellent electron trapping and transporting ability make composite a superior catalyst for photocatalytic methane production under visible light irradiation."
  },
  {
    "title": "Conclusions",
    "content": "A new 2D/2D/2D heterojunction of g-C3N4/Bt/Ti3C2 composite was successfully fabricated using HF etching approach, which shows significantly improved efficiency towards photocatalytic CO2 conversion under visible light.The analysis of g-C3N4/Bt/Ti3C2 composite demonstrates selective CH4 production using CO2-water reaction system, whereas, single Bt and Ti3C2 loaded samples promoted CO evolution rate.When acetic acid as the sacrificial reagent was used, production of CH4 was significantly enhanced under the same reaction conditions.The CH4 production over g-C3N4/Bt/Ti3C2 composited was 4.15, 17.36 and 28.93 folds higher than using g-C3N4/Bt/Ti3C2, g-C3N4/Ti3C2 and g-C3N4 samples, respectively.Similarly, a selectivity of 72.35 was obtained over g-C3N4/Bt/Ti3C2 for CH4 evolution, while it was 41.37, 14.95 and 30.28 over g-C3N4/Bt/Ti3C2, g-C3N4/Ti3C2 and g-C3N4, respectively, using CO2-water reaction system.This selective photocatalytic CO2 conversion to CH4 suggests that g-C3N4/Bt/Ti3C2 is a promising material and can be further explored in solar energy applications.The stability test revealed continuous CO and CH4 evolution in cycles.The thermodynamics analysis elucidates, CO2 was first converted to CO before the production of CH4 and water is oxidized to hydrogen under light irradiation.These encourages results and new findings would be useful for further investigation in this field for wastewater and solar energy applications. I have read and understood the Chemical Engineering Journal policy on declaration of interests and declare the following: The authors declared no potential conflicts of interest with respect to the research, authorship and publication of this article. Best regards, Muhammad Tahir (Ph.D) School of Chemical and Energy Engineering, University Technology Malaysia. New approach for synthesis of exfoliated 2D Ti3C2 MXenes based g-C3N4/Bt composite. Performance of 2D Ti3C2 MXene based g-C3N4/Bt was 7 folds high under visible light. Photo-induced CO2 reduction with acidic solution promoted CH4 formation than only water. CO2/H2O feed-ratio and UV-visible light greatly contributed for CO2 reduction to CH4. High stability and reusability in cycles was attained using 2D Ti3C2/Bt with g-C3N4 catalyst."
  }
]