[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2020.119773"
  },
  {
    "title": "Article_Title",
    "content": "All-organic Z-scheme photoreduction of CO2 with water as the donor of electrons and protons"
  },
  {
    "title": "Abstract",
    "content": "Carbon nitrides and flavins are two classes of easy accessible transition metal-free, photoactive materials.Their photocatalytic efficiency to enable a variety of chemical reactions is well documented.Here, we report on their combination in one photocatalytic system by designing biomimetic non-spherical core-shell architectures comprising micro-sized crystals of flavins decorated by potassium poly(heptazine imide) nanoparticles on the surface.The designed non-spherical core-shell composites are tested in the photocatalytic CO 2 reduction to CH 4 , MeOH, EtOH and CO using water vapor as a donor of electrons and protons at the gas-solid interface.The forged Z-scheme heterojunction between these two materials allows increasing of their photocatalytic performance.Whereby excited states lifetimes are extended by interface charge recombination and photoredox processes are boosted because of an overall wider band gap."
  },
  {
    "title": "Experimental",
    "content": "Synthesis and characterization of K-PHI was conducted according to previous works 33,41,454647484950. In a flask (100 mL), flavin (0.1 mmol, 54.45 mg of F1 for C1, 129.14 mg of F2 for C2, 31.83mg of F3 for C3) and K-PHI (0.2 mmol, 100 mg) were dissolved in methanol (25 mL).Suspension was stirred for 30 min.MeOH was evaporated, the solid was transferred into a mortar, ground and put into a porcelain crucible.Solids were heated at 150 C for 6 h in oven in air. Samples were measured on a Bruker D8 Advance diffractometer equipped with a scintillation counter detector with CuK radiation ( 0.15418 nm) applying 2 step size of 0.05 and counting time of 3 s per step. Sample images were obtained on a Zeiss LEO 1550-Gemini microscope. For high-resolution transmission electron microscopy (HR-TEM) observations, samples were sonicated in ethanol for 10 min; the obtained suspensions were drop-casted to a Cu grid with a lacey carbon support and dried for 15 min.HRTEM studies were performed using a double Cs corrected JEOL JEM-ARM200 F (S)TEM operated at 80 kV, equipped with a cold-field emission gun, and a high-angle silicon drift Energy Dispersive X-ray (EDX) detector (solid angle up to 0.98 steradians with a detection area of 100 mm 2 ). Optical absorbance spectra of powders were measured on a Shimadzu UV 2600 equipped with an integrating sphere. Emission spectra, Internal and External Quantum Efficiency (IQE/ EQE) were recorded on Jasco FP-8300 instrument.The excitation wavelength was set at 360 nm. Analyses were carried out by using an optical calorimeter (InfraSORP Technology by Fraunhofer/Rubotherm)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The composites (C1, C2 and C3) self-assemble by in situ crystallization of the corresponding flavins (F1, F2 and F3, see Figs.S1-S2 for their preparation) from methanol solution upon concentration in vacuum followed by spontaneous deposition of K-PHI nanoparticles as a type of Pickering stabilizer (Fig. 2).The molar ratio between K-PHI and flavins has been chosen to 2:1 (assuming a repetitive molar weight of K-PHI of 500 g mol -1 ) to ensure complete coverage of the flavin microcrystals with K-PHI nanoparticles and to achieve high interface area between the donor and acceptor in solid state. Fig. 3 shows the morphology of flavins and the composites.The morphology of flavin F1 is represented by thin plates (Fig. 3a), flavin F2 by sharp-edged particles of irregular shape and flavin F3 by rectangular bricks.The SEM images of composites C1, C2 and C3 do not show morphological features of the pure flavins, but are rather identical to that of pure K-PHIassembly of nanoparticles with the diameter 100-200 nm (see also Figs.S3-S9 for overview images), which means that flavin crystals are indeed completely covered by the PHI colloidal stabilizer.Thus, SEM provides the first piece of evidence that flavins and K-PHI form core-shell structures, albeit non-spherical, upon selfassemblyflavin crystals in the core, while the shell is constructed from K-PHI particles.To get more insights about the structure of the obtained composites at the nanoscale we used transmission electron microscopy and energydispersive X-ray (EDX) analysis.The later allows clear distinguishing between deferent part of the composite C2, since bromine is present exclusively in flavin F2 and potassiumin K-PHI.Fig. S10 shows a typical amorphous particle of flavin F2 with diameter of about 500 nm. In the corresponding C2 composite large amorphous particles of flavin F2 are decorated with nanocrystalline K-PHI nanoparticles (typically 100 nm in diameter) (Figs.3g,h, S11) 42.Analysis of HRTEM images and corresponding FFT transforms allows to conclude that formed K-PHI particles crystallize in hexagonal structure, with a 12.6 A, c 3.3 A (Fig. 3i-k) 43,44.EDX spectra obtained from different parts of non-spherical core-shell structures have different K:Br ratios; thus crystalline parts exhibit a higher K content (Fig. S12c) while the amorphous part, the flavin-rich region, displays a higher Br signal (Fig. S12f). PXRD analysis of K-PHI nanoparticles reveals a typical pattern for this material with a pronounced peak at 8 , due to the in-plane periodicity, and the peak at 28 due to graphitic packing (Fig. S13a) 47.Flavins F1 and F3 are crystalline powders, while F2 is amorphous (Fig. S13b,d,f).Higher crystallinity of flavins F1 and F3 is explained by a smaller and more regular shape of the molecule, i.e., a lower number of degrees of freedom that facilitates crystallization.Composites C1 and C2 are amorphous with respect to the flavin core, but all composites show pronounced peaks related to the presence of K-PHI nanoparticles (Fig. S13c, e, g), while intensity of the diffraction peaks depends on K-PHI content in the composites (Fig. S14, Table S1). Fourier-transform infrared (FT-IR) spectra of the composites are very similar to that of K-PHI, while vibration peaks related to the flavins are mainly absent (Figs. 4 andS15).FT-IR data provide a second piece of evidence supporting the formation of the core-shell structure.In this architecture the flavin core is covered by the K-PHI shell.As a result, the vibrational peaks of the shell are predominantly seen in the IR spectra. The solid-state emission spectra of the flavins, K-PHI and their composites are shown in Figs.5a andS16.Pure flavins have fluorescence Internal Quantum Efficiency (IQE) 2.0-7.7 , while K-PHI has an IQE of 0.19 (Table S2).Practically complete fluorescence quenching is observed for composites in the solid statecomposites IQEs are only 0.1-0.4 (Table S2).Titration experiments showed that the composite with only 9 K-PHI content already shows complete fluorescence quenching (Fig. 5c).These results give a third piece of evidence supporting formation of an electronically active structure.Taking into account results of the electron microscopy study and FT-IR, electronic interaction between the partners of the composite is obviously the most efficient when they are assembled in core-shell structure.A similar behavior has been reported for flavin-graphene composites 51. However, dispersions of the composites C1 and C3 in DMSO do not exhibit fluorescence quenching (Fig. S17) suggesting that polar solvent disrupts the interaction between the flavins F1 and F3 and K-PHI particles.In addition, dispersion of the composite C1 in DMSO followed by filtration, resulted in yellowish solution, implying dissolution of the flavin F1 in DMSO (Fig. S18).Furthermore, IQE of a series of K-PHI/F1 mixtures in DMSO with different K-PHI content shows an opposite trend compared to the measurements in solid state (Fig. 5c), i.e. higher IQE (8.5 ) for pure K-PHI suspension.On the other hand, flavin F1 showed lower IQE (2.2 ) compared to that in solid state (7.7 ), which is explained by an agglomeration induced emission phenomenon 52.Since in the present work we apply the synthesized composites in the photocatalytic CO 2 reduction in the gas-solid interface, we consider spectroscopic data obtained in the solid state to be more relevant to the study. Thermogravimetric analysis (TGA) of the C2 demonstrates lower mass loss in the composite compared to the calculated value, suggesting that the shell made of thermodynamically stable K-PHI nanoparticles stabilizes flavin core in the composite (Fig. S19).Overall, observation of the composites morphology directly from the electron microscopy images, FT-IR data, strong fluorescence quenching in the composites and TGA data, collectively support formation of non-spherical core-shell structures. In agreement with earlier reports, K-PHI has an onset of absorption at 700 nm that is assigned to n- transitions 53, but the main contribution to light absorption originates from the - transitions observed as a band at 460 nm, i.e., the band gap, as concluded from the diffuse reflectance (DR) UV-vis absorption spectra (Fig. 5d).In the solid state, all flavins have the onset of absorption at 540 nm that corresponds to the optical band gap of ca.2.3 eV (Fig. S20).Similar band gap values of flavins, despite different backbone structure, i.e. protected ribose backbone (in case of F1 and F2) and 4-ethylphenyl substituent (in F3), support the fact that the isoalloxazine core acts as the chromophore. Band gap values derived from the DRUV-vis spectra are close to that obtained from the cyclic voltammetry (CV) measurements of the flavins in MeCN solution, 2.27-2.34eV (Fig. 5e).Considering the relative alignment of the frontier orbitals energy levels in flavins and CB/VB energy levels in K-PHI (Fig. 5f), the designed composites can be regarded as being able to follow a Z-scheme activation, if we make a comparison with all-semiconductor systems 54.The Z-scheme rationalizes the complete fluorescence quenching observed in the composites in the solid state.Indeed, this is due to the selective charge recombination at the interface, while energy transfer is suppressed, as already reported for a flavin-graphene composite 51 and for a carbon nitride-carbon composite 55,56.Direct charge transfer in the composites C1 and C2 is supported by the appearance of the additional absorption band, albeit weak, with the onset at 750-800 nm (Figs.5d, S20b) 57,58.DFT calculations also predicted Bader charge shift between flavin F3 and K-PHI of 0.023 electrons (see ESI for computational details). Transient photocurrent measurements are indispensable to investigate light response properties of semiconductors, such as K-PHI 59,60.Such measurements are typically done by immersing an electrode (typically FTO glass) coated with the analyzed material into the aqueous electrolyte.However, this approach was not suitable for the studied materials.Due to partial solubility of flavins in water, the coated FTO glass is not stable.Binders, such as PVDF, gave stable electrodes, but conductivity was too low to record reliable data. The solution was found employing thin layers of conductive hydrogel between the electrodes that serves as the electrolyte (Figs. 6 and S21-22, see experimental procedure for details of the device fabrication).The developed architecture allows preserving the morphology of the analyzed material for hours due to low diffusion of the flavins into the bulk of the hydrogel.Compact size, thickness of only 10 mm, absence of electrolyte leakage and good light permeability are additional advantages of the fabricated device.The photoelectrodes in such architecture are stable for at least few hours (Fig. S23). With the electrochemical device in hands, we performed different electrochemical tests: illuminated open circuit potential (OCP), linear sweep voltammetry (LSV), chronoamperometry (CA) and chronopotentiometry (CP) (Figs. 6 andS24). Thus, illuminated OCP experiment showed a negative shift suggesting that all tested materials possess n-type conductivity, 61 while in CA experiments a positive photocurrent densities of 2-22 A cm -2 were registered (Fig. S24c).Therefore, once irradiated, materials resistance decreases due to increase of charge carriers concentration.For pure K-PHI and its composites, these findings are in agreement with the reported earlier positive slope in the Mott-Schottky plot 62.However, to the best of our knowledge, there is no data for flavins in solid state.The amplitude of the OCP change increases in the sequence K-PHI flavin composite (Fig. S25) due to the introduction of the additional light absorber, a flavin ( onset 540 nm). Analysis of the CA data (Fig. S26) reveals that pure K-PHI shows higher photocurrent densities compared to pure flavins.At the same time, composite C1 shows twice higher photocurrent compared to pure K-PHI and 14 times higher photocurrent compared to pure flavin F1, supporting existence of charge transfer between the two components of the composite.Composites C2 and C3, however, shows lower photocurrents compared to the individual components.Analysis of absolute current densities (Fig. S27) suggests that surface properties of the photoelectrode have clear impact on the overall conductivity.Thus, K-PHI (hydrophilic), the flavin F1 (partially soluble in water) and their composite C1 show not only the highest photocurrent, but also the highest dark current in the series of studied materials.On the other hand, the flavin F2 (large hydrophobic molecule due to presence of multiple Br atoms) and its composite show the lowest dark current. Since a Z-scheme relies on the excitation of both the composite components (K-PHI and flavin), here with two photons with different wavelength (due to different optical band gaps), we investigated the photocatalytic properties of the prepared composites under white light irradiation in a gas-solid batch photoreactor.We selected the photocatalytic CO 2 reduction reaction using water vapor as the electron and proton donor (see Fig. S28 for the detailed mechanism).We monitored the formation of CO, CH 4 , MeOH and EtOHcommon products of CO 2 reduction.In addition, no H 2 formed due to the fact that the investigated system is free of transition metal co-catalyst, which otherwise would facilitates hydrogen evolution.Fig. 7 shows the yield of the products obtained using pure K-PHI, flavins and their composites.Pure K-PHI and flavins F1 and F2 show selectivity toward alcohols, methanol and ethanol. The same trend is conserved in the composites.Therefore, reduction selectivity of the composite is largely defined by the property of the incorporated flavin.Thus, considering photocatalytic reduction of CO 2 to CH 4 , the productivity of the composite C3 is 15 higher compared to the flavin F3, while composite C2 showed 2.5 times higher activity compared to the flavin F2.On the other hand, the productivity of photocatalytic reduction to CO can be increased by 27 employing composite C2 compared to flavin F2 and 3 times using composite C3 compared to flavin F3. Thermal response measurements recording the temperature of the materials during adsorption were conducted to probe the interaction of CO 2 and H 2 O with the surface of K-PHI, flavin F1 and the composite C1, as an example, (Figs.S29 andS30) 63.Dry CO 2 has very low affinity to these materials (Fig. S31).When CO 2 saturated with water vapor at MeCNas a reference electrode (RE) and Pt wireas a counter electrode (CE).f) CB and VB potentials of K-PHI are taken from the literature.41 For flavins, CB and VB refer to HOMO and LUMO potentials determined from CV curves (Fig. 5e). room temperature, significantly more heat is released due to additional adsorption of water.When helium instead of CO 2 is used as a carrier gas exemplarily for composite C1, the individual contribution of water adsorption can be estimated.The heat released is far less than in the presence of CO 2 and the difference is much larger than the contribution from dry CO 2 adsorption.Therefore, water vapor serves not only as electron and proton donor in the photocatalytic CO 2 reduction, it also enhances adsorption of CO 2 at the photocatalyst surface.Furthermore, adsorption of CO 2 and H 2 O at the composite C1 is defined by the surface properties of K-PHI rather than flavin F1, as the integrated peak area is comparable to that of pure K-PHI, which gives another factor for the activity of the core-shell structure of the composite with K-PHI particles outside.However, the total amount of CO 2 molecules converted by the composite C1 is similar to that of the flavin F1 (Fig. S32), while CO 2 shows relatively weak affinity, implying that the band structure of the flavin determines the rate of the overall photocatalytic activity and selectivity towards a certain product. From the results of photocatalytic tests, we conclude that selectivity of CO 2 photocatalytic reduction can be tuned by using composites of K-PHI and flavins.The forged Z-scheme heterojuntion between K-PHI and flavins provides a material with the reducing properties of pure flavin and oxidative properties of pure K-PHI.This phenomena, combined with longer life-times of excited states due to interface charge recombination, promotes the improvement of photocatalytic activities, compared to pure flavins 64,65."
  },
  {
    "title": "Conclusions",
    "content": "In this work, three structurally different core-shell composites constructed from micro-sized crystals of flavin (the core) and decorated with K-PHI nanoparticles (the shell) have been prepared by a simple and straightforward co-precipitation/stabilization approach.The properties of the composites were investigated by SEM, XRD, TEM, EDX, IR and PL, while the results suggest formation of a spontaneous heterojunction between the core and the shell.The photocatalytic activity of the composites has been evaluated in reduction of CO 2 to CO, CH 4 , MeOH and EtOH.The results suggest that the selectivity of the composites toward specific products is largely defined by flavins, i.e. the flavins constitute the reduction side.The K-PHI shell presumably promotes the liberation of oxygen by its very positive HOMO, accelerates the reaction, and changes the product distribution presumably by kinetic effects.Given the simplicity of flavins and carbon nitride synthesis, the presented approach can lay a foundation for the construction of a library of composites for task-specific applications in serious uphill photocatalysis.Photoelectrochemical performance of flavins powder and their composites have been investigated using a dedicated electrochemical device employing a thin layer of conductive hydrogel as polymer electrolyte.In particular, a riboflavintetracetate-based composite showed a photocurrent two times higher than that of pure K-PHI and 14 times higher than pure riboflavintetracetate, suggesting higher charge mobility. Fig. 1.Chemical structures of K-PHI and flavins employed in this work. Fig. 2. Schematic procedure of non-spherical core-shell composite preparation and schematic representation of the composite morphology.Color staining of the composite illustrates red-shifted onset of light absorption in the heterojunction as evidenced by DRUV-vis spectroscopy (see below).Schematic representation of flavin and the non-spherical core-shell composite morphology as evidenced by the SEM images of flavin F3 and composite C3.Step a) denotes stirring a colloidal solution of K-PHI nanoparticles and flavin in MeOH followed by concentration under reduced pressure and b) denotes grinding in mortar followed by annealing in air oven at 150 C. Fig. 3. Electron microscopy images of the flavins and their composites.SEM images of: a) Flavine F1; b) Flavine F2; c) Flavine F3; d) Composite C1; e) Composite C2; f) Composite C3; g,h) overview TEM images of the composite C2.i,j,k) HR-TEM images of K-PHI nanoparticles in the composite C2 taken along different crystallographic directions. Fig. 4. FT-IR spectra of flavin F1, K-PHI and composite C1 in comparison.Selected vibrational peaks of flavin are labeled. Fig. 5. Optical properties of flavins and composites.a) Solid state PL spectra of F1, K-PHI and the composite C1.Inset shows magnified PL spectra of K-PHI and the composite C1.b) Powder of K-PHI, flavin F1 and the composite C1 under ambient day light and under 365 nm irradiation.c) IQE of composites in solid state and dispersions in DMSO.X-axis represents K-PHI content.d) DRUV-vis absorption spectra of F1, K-PHI and composite C1.e) CV curves recorded using 2 mM solution of flavin in MeCN.Glassy carbon (diameter 3 mm) was used as a working electrode (WE), Ag wire in AgNO 3 (0.01 M) with (nBu) 4 N ClO 4 -(0.1 M) in Fig. 6.Electrochemical measurements.a) Representative scheme of the electrochemical cell employing hydrogel layers as the electrolyte.Schematic representation, side and front views of the ready device; b) Illuminated OCP experiment.The experiment was performed in dark (30 s) followed by irradiation with white LED (10 s, 467 mW cm -2 ).Seven cycles were recorded for each material.The temperature was kept at 25-30 C by using air fan.Geometric area of the working electrode was 3.2 cm 2 . Fig. 7. Photocatalytic CO 2 reduction experiments comparing different catalysts. SM, AS and MA gratefully acknowledge Max Planck Societyfor financial support.JK, IG and BK thank the German Science Foundation (DFG, GN2KO/GN21537/18-1) for financial support. The authors report no declarations of interest. Supplementary material related to this article can be found, in the online version, at doi:https://doi.org/10.1016/j.apcatb.2020.119773."
  }
]