[
  {
    "title": "Doi",
    "content": "10.1039/c3ta12433a"
  },
  {
    "title": "Article_Title",
    "content": "ZIF-8/Zn2GeO4 nanorods with an enhanced CO2 adsorption property in an aqueous medium for photocatalytic synthesis of liquid fuel"
  },
  {
    "title": "Abstract",
    "content": "The photoreduction of CO 2 on inorganic semiconductors has been researched for several decades, but the conversion efficiency is still low due to the recombination of photo-generated electron-hole pairs, low utilization efficiency of solar energy and weak adsorption of CO 2 .Here we for the first time demonstrate that metal-organic frameworks such as ZIF-8 can effectively adsorb CO 2 dissolved in water, and promote photocatalytic activity of a semiconductor catalyst in CO 2 reduction into liquid fuels in an aqueous medium.In particular, Zn 2 GeO 4 /ZIF-8 hybrid nanorods were successfully synthesized by growing ZIF-8 nanoparticles on Zn 2 GeO 4 nanorods.The Zn 2 GeO 4 /ZIF-8 nanocomposite inherits both high CO 2 adsorption capacity of ZIF-8 nanoparticles and high crystallinity of Zn 2 GeO 4 nanorods.The Zn 2 GeO 4 /ZIF-8 hybrid nanorods containing 25 wt ZIF-8 exhibit 3.8 times higher dissolved CO 2 adsorption capacity than the bare Zn 2 GeO 4 nanorods, resulting in a 62 enhancement in photocatalytic conversion of CO 2 into liquid CH 3 OH fuel.The strategy reported here is promising for developing more active photocatalysts for improving CO 2 conversion efficiency by taking advantage of excellent adsorption property of metal-organic frameworks in aqueous media."
  },
  {
    "title": "Experimental",
    "content": "Preparation of the Zn 2 GeO 4 nanorods All the chemicals were of analytical grade (Sigma-Aldrich) and used as received without further purication.In a typical synthesis of Zn 2 GeO 4 nanorods, 0.52 g of GeO 2 (2.5 mmol) and 1.10 g of Zn(CH 3 COO) 2 2H 2 O (5 mmol) were added to a 25 tetramethylammonium hydroxide (TMAOH) aqueous solution (15 mL).The mixture was stirred for 40 min and then transferred to a Teon-lined stainless steel autoclave of 25 mL inner volume.The hydrothermal synthesis was performed under an auto-generated pressure at 180 C for 12 h in a convection oven, followed by cooling naturally to room temperature.The product was collected by centrifugation, washed thoroughly with deionized water and alcohol several times, and then dried at 60 C for 12 h.A white Zn 2 GeO 4 powder was nally obtained. ZIF-8 nanocrystals were prepared following the procedures previously reported. 19Typically, 0.587 g of Zn(NO 3 ) 2 6H 2 O and 1.298 g of 2-methylimidazole (Hmim) were dissolved in 40 mL of methanol (MeOH) separately, and then the Hmim solution was poured into the Zn(NO 3 ) 2 6H 2 O solution under magnetic stirring.The mixture was stirred at room temperature for 2 h.The solid product was separated from the milky colloidal dispersion by centrifugation.Aer being washed with anhydrous ethanol and centrifugation three times, the white ZIF-8 product was dried at 60 C. Preparation of Zn 2 GeO 4 /ZIF-8 0.4 g of as-prepared Zn 2 GeO 4 nanorods and 0.587 g of Zn(NO 3 ) 2 6H 2 O were added to 40 mL of MeOH and stirred for 1 h.A second solution was prepared by dissolving 1.298 g of Hmim in 40 mL of MeOH (theoretical mass ratio 1 : 2 of ZIF-8 to Zn 2 GeO 4 ).The latter clear solution was poured into the former solution under magnetic stirring and stirred for another 1 h.Aer settling for 5 min, the white precipitate was harvested by pouring out the upper suspension layer, followed by washing with water and alcohol several times and then dried at 60 C for 12 h. The crystallographic phase of these as-prepared products was determined by powder X-ray diffraction (XRD) (Rigaku Ultima III, CuKa radiation).The morphology of the samples was observed by scanning electron microscopy (FEI Nova NanoSEM 450 FEG SEM) and transmission electron microscopy (a JEOL 3010 microscope, Japan).The chemical compositions were analyzed with X-ray photoelectron spectroscopy (XPS, K-Alpha, Thermo Fishers Scientic).The specic surface area of the samples and nitrogen adsorption-desorption isotherms were measured by nitrogen sorption at 77 K using a surface area and porosity analyzer (Micromeritics ASAP 2020) and calculated by the BET method.Thermogravimetry (TG) and different thermal analysis (DTA) measurements were performed simultaneously on a Netzsch STA 449 F1 Jupiter thermoanalyzer.For this purpose, ca.6 mg of samples were lled into alumina crucibles and heated in a ow of air with a ramp rate of 5 C min A1 from room temperature up to 700 C. Carbon dioxide adsorptiondesorption isotherms were measured at 273 K on an automatic volumetric adsorption apparatus (Micromertics ASAP 2010). Fourier-transform infrared (FT-IR) spectra were recorded on a BRUKER Tensor 27 spectrometer using the attenuated total reection (ATR) technique.The UV-vis diffuse reectance spectrum was recorded with a UV-vis spectrophotometer (UV-2550, Shimadzu) at room temperature and transformed to the absorption spectrum according to the Kubelka-Munk relationship.The total dissolved carbon concentration in the aqueous solution was measured using a Shimadzu TOC-LCSH/ CSN Auto-sampler ASI-L Total Organic Carbon (TOC) analyzer. The loading of Pt was performed by a photochemical reduction deposition method, similar to the previously reported.8a,20 Before the photocatalytic reaction, the catalysts were degassed at 200 C for 12 h under vacuum to remove the adsorption materials or residual solvents.In the photocatalytic reduction of CO 2 , the 0.20 g of catalyst was dispersed in 100 mL of distilled water containing sodium sulte (Na 2 SO 3 , 0.10 M).The solution was degassed by puried N 2 to remove oxygen and then the high purity of CO 2 gas was bubbled into the reaction setup with stirring and le in the dark for 90 min until the adsorptiondesorption equilibrium was reached.The solution temperature was kept constant by a water bath.A 500 W xenon arc lamp was used as the light source for the photocatalytic reaction.During the irradiation, about 1 mL of solution was taken from the reaction cell at a given time interval and centrifuged for subsequent CH 3 OH concentration analysis by a gas chromatograph (GC) with a FID detector and an Agilent G1888 headspace sampler (Agilent 7890A).The rate of CH 3 OH evolution was dened as the total amount of evolved CH 3 OH divided by the reaction time."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The X-ray diffraction (XRD) patterns of the as-synthesized samples are shown in Fig. 1.In the XRD pattern of the bare Zn 2 GeO 4 nanorods (Fig. 1a), all diffraction peaks can be assigned to the rhombohedral phase of Zn 2 GeO 4 (JCPDS 11-0687) with lattice constants of a 14 b 14 1.423 nm and c 14 0.953 nm, a 14 b 14 90 and g 14 120 .The XRD pattern (Fig. 1b) of the as-synthesized ZIF-8 matches well with the published pattern, 12 which indicates that the product is mainly crystalline ZIF-8.Aer deposition of ZIF-8 particles on Zn 2 GeO 4 , new peaks appear at 2q 14 7.4 , 16.6 , 18.0 and 26.6 which are ascribed to the ZIF-8.No other characteristic peaks are observed, indicating that the sample is composed of Zn 2 GeO 4 and ZIF-8 only. The eld-emission scanning electron microscopy (FE-SEM) images taken at different magnications show that the Zn 2 GeO 4 sample is entirely composed of nanorods with smooth surfaces, and the individual nanorods have lengths of 200-300 nm, and uniform diameters of 20-50 nm (Fig. S1 ).A low-magnication FE-SEM image shows that aer ZIF-8 deposition, the smooth Zn 2 GeO 4 nanorods evolve to chain-like structures with grainy surfaces (Fig. 2a and S2 ).A high-magnication FE-SEM image of the Zn 2 GeO 4 /ZIF-8 sample reveals that there are many regular nanoparticles on the surfaces of Zn 2 GeO 4 nanorods, conrming successful growth of ZIF-8 nanoparticles on the Zn 2 GeO 4 nanorods (Fig. 2b).The ZIF-8 nanoparticles on the nanorods are 10-50 nm in size, which are smaller than those of ZIF-8 crystals synthesized in the absence of Zn 2 GeO 4 nanorods (Fig. S3 ).The synthesis time is an important parameter for controlling the amount of ZIF-8 on the Zn 2 GeO 4 nanorods.At the early stage of synthesis (i.e., 10 min), as shown Fig. S4, there are few nanoparticles grown on the nanorods.With increasing reaction time, more and larger ZIF-8 nanoparticles are formed on the Zn 2 GeO 4 nanorods.TEM images of a single Zn 2 GeO 4 /ZIF-8 nanorod are shown in Fig. 2c andd.Although ZIF-8 is very sensitive to the electron beam, discrete ZIF-8 nanoparticles of approximately 10 nm decorated on the surface of the Zn 2 GeO 4 nanorod are clearly seen (Fig. 2c).The HRTEM image shows that the interplanar d-spacing of ca.0.412 nm corresponds to the (300) lattice plane of an orthorhombic Zn 2 GeO 4 (Fig. 2d).The selected area electron diffraction (SAED) pattern indicates that the nanorod is a uniform single crystal of longitudinal direction along 001 and width direction along 100.X-ray photoelectron spectroscopy (XPS) analysis conrms the presence of Zn, Ge, O and N in the Zn 2 GeO 4 /ZIF-8 hybrid nanorods (Fig. 3).The N 1s peak of Zn 2 GeO 4 nanorods at 402.68 eV is attributed to alkylammonium from TMAOH. 21This conrms that there are TMAOH adsorbed on the surfaces of the prepared Zn 2 GeO 4 nanorods.The locations of N 1s in pure ZIF-8 and Zn 2 GeO 4 /ZIF-8 are 398.58eV and 398.68 eV, which are attributed to the nitrogen in C-N bonds and in 2-methylimidazole, respectively, 22 this further veries the existence of ZIF-8 in Zn 2 GeO 4 /ZIF-8.The signicant difference in the intensities of Zn, Ge, O and N peaks is an indication of different elemental concentrations in the three samples. The FTIR spectra reveal the amine stretching band (peaks between 3300 and 3500 cm A1 ) of the Zn 2 GeO 4 nanorods, which further suggests the existence of amine groups (Fig. 4).Aer in situ deposition of ZIF-8 on Zn 2 GeO 4 nanorods, some new FTIR peaks appear.The absorption bands at 1146 cm A1 and 1308 cm A1 are assigned to C-H vibrations, while the peak at 1384 cm A1 is attributed to C-C stretching.Therefore, FTIR spectra also conrm the structure of ZIF-8/Zn 2 GeO 4 nanorods.It is known that the heterogeneous nucleation of ZIF crystals on inorganic substrates is usually poor. 23Alkylammonium groups adsorbed on Zn 2 GeO 4 nanorods favorably interact with 2-methylimidazole, facilitating the nucleation and growth of ZIF-8.Thus functional alkylammonium groups play a vital role in the growth of ZIF-8 nanoparticles on the Zn 2 GeO 4 nanorods.As shown in Fig. S5, ZIF-8 nanoparticles are not grown on the Zn 2 GeO 4 nanorods in the uoride ion synthesis solution.Such a strategy of organic functionalization is commonly used to grow ZIF membranes on substrates. 23he thermal stability of the prepared samples was evaluated by thermal gravimetric (TG) analysis.For the bare Zn 2 GeO 4 nanorods, TG analysis shows no signicant decomposition, and only 0.5 mass loss is observed up to 700 C (Fig. 5), which can be attributed to the desorption of TMAOH and H 2 O adsorbed on the surfaces of the nanorods.The TG of ZIF-8 exhibits a gradual mass-loss step of 11.8 up to 200 C, corresponding to the This can be explained by the fact that apart from ZIF-8 growth on Zn 2 GeO 4 , ZIF-8 also crystallizes in the solution, consuming some of its precursors.Zn 2 GeO 4 , ZIF-8 and Zn 2 GeO 4 /ZIF-8 samples were analyzed by the nitrogen sorption technique.Their nitrogen adsorptiondesorption isotherms (Fig. 6a) show that there is a signicant amount of N 2 adsorbed by Zn 2 GeO 4 /ZIF-8 at very low relative pressures, due to the presence of ZIF-8 micropores (as also shown in the semi-log plot of the nitrogen adsorption isotherms, Fig. S6 ).Zn 2 GeO 4 , ZIF-8 and Zn 2 GeO 4 /ZIF-8 exhibit a BET surface area of 40.9 m 2 g A1 , 1160.1 m 2 g A1 and 319.5 m 2 g A1 , respectively.The comparison of CO 2 adsorption isotherms of these three samples indicates that Zn 2 GeO 4 /ZIF-8 has a higher adsorption capability of CO 2 than Zn 2 GeO 4 nanorods due to the high adsorption capability of ZIF-8 (Fig. 6b).At 1 atm and 273 K, the maximum CO 2 uptake for ZIF-8, Zn 2 GeO 4 /ZIF-8 and Zn 2 GeO 4 is 34.5 cm 3 g A1 , 15.5 cm 3 g A1 and 4.9 m 2 g A1 , respectively.We have also carried out the experiments to determine the adsorption capacity of the ZIF-8, Zn 2 GeO 4 /ZIF-8 and Zn 2 GeO 4 in CO 2 aqueous solution with a low CO 2 concentration under ambient conditions.A CO 2 aqueous solution with dissolved inorganic carbon concentration of 184.2 mg L A1 was prepared by bubbling high-purity CO 2 gas through doubledeionized water for 1 hour.Then 0.5 g of the sample, ZIF-8, Zn 2 GeO 4 /ZIF-8 or Zn 2 GeO 4 was added to 50 mL of CO 2 aqueous solution and stirred at 500 rpm for 1.5 h, the concentration of CO 2 decreased to 20.2 mg L A1 , 60.3 mg L A1 and 123.4 mg L A1 respectively.In the control experiment, 50 mL of CO 2 solution without any powder was also stirred at 500 rpm for 1.5 h and found the dissolved inorganic carbon concentration decreased to 146.0 mg L A1 .The dissolved CO 2 adsorption capacity is calculated to be 251.6 mg g A1 , 171.4 mg g A1 and 45.2 mg g A1 for ZIF-8, Zn 2 GeO 4 /ZIF-8 and Zn 2 GeO 4 , respectively.Zn 2 GeO 4 /ZIF-8 has 3.8 times higher dissolved CO 2 adsorption capacity than Zn 2 GeO 4 . Generally, the main product of CO 2 photoreduction with water vapor in a complicated gas-solid system using semiconductor photocatalysts is CH 4 . 24We have performed photocatalytic reduction of CO 2 in aqueous solution over the Zn 2 GeO 4 and Zn 2 GeO 4 /ZIF-8 in order to get higher valuable chemicals, e.g.methanol rather than CH 4 .To the best of our knowledge, this is also the rst investigation on the photoreduction performance of CO 2 with Zn 2 GeO 4 in aqueous solution.As expected, the main product is identied as methanol.Methane, ethanol and other hydrocarbons might be formed in small quantities, which are too low to be detected.Fig. 7 shows that the Zn 2 GeO 4 nanorods rendered a CH 3 OH yield of 1.43 mmol g A1 under light illumination for 10 hours (curve a).The yield of CH 3 OH remained almost unchanged under light irradiation from 6 to 10 h, which may be due to strong absorption of the intermediate products on the photocatalyst surface to cover the active sites; the Zn 2 GeO 4 nanorods may be reactivated via thermal treatment under vacuum as reported previously.The control CO 2 reduction experiment performed in the absence of the photocatalyst showed no appearance of methanol, proving that the CO 2 reduction reaction is driven by light with the photocatalyst.Although several MOFs have recently been shown to have photocatalytic activity of CO 2 reduction under light illumination, 14a,15 there was no organic product detected for a long period of CO 2 photoreduction using pure ZIF-8 as the photocatalyst.Aer the Zn 2 GeO 4 nanorods were decorated with ZIF-8 nanoparticles, the CH 3 OH yield was greatly increased as shown in Fig. 7b.The gross yield in CH 3 OH increased with the photolysis time, and the total yield of CH 3 OH obtained in the experiment aer 11 h of continuous irradiation was 2.44 mmol g A1 , corresponding to approximately 0.22 mmol g A1 h A1 of the CH 3 OH formation rate. Compared with the Zn 2 GeO 4 nanorods photocatalyst, the CH 3 OH yield of the Zn 2 GeO 4 /ZIF-8 showed a 62 enhancement under light irradiation for 10 h.The higher photocatalytic activity of the Zn 2 GeO 4 /ZIF-8 toward reduction of CO 2 relative to that of the Zn 2 GeO 4 sample should be attributed to the introduction of ZIF-8.Firstly, ZIF-8 can effectively adsorb the dissolved CO 2 in the water solution; secondly, the light absorption of Zn 2 GeO 4 /ZIF-8 is better than Zn 2 GeO 4 ; as evidenced by their UV-vis spectra (Fig. S7 ), the spectrum absorption edge of Zn 2 GeO 4 /ZIF-8 was slightly red-shied compared to the Zn 2 GeO 4 (i.e., from 302 nm to 326 nm) due to the introduction of ZIF-8 (the absorption edge of pure ZIF-8 is about 340 nm).The rate of CH 3 OH generation over the Zn 2 GeO 4 /ZIF-8 nanorods could be further enhanced by loading Pt (curve c, and its TEM images shown in Fig. S8 ) as a cocatalyst to improve the separation of the photogenerated electron-hole pairs, as demonstrated in photocatalytic reduction of CO 2 and water splitting.8a,17b,25 It should be emphasized that the XRD patterns of the Zn 2 GeO 4 /ZIF-8 nanorods remained unchanged before and aer the photocatalytic reaction (Fig. S9 ), indicating the stability of the hybrid nanorods under light irradiation."
  },
  {
    "title": "Conclusions",
    "content": "In summary, ZIF-8 nanoparticles were successfully grown on the surfaces of Zn 2 GeO 4 nanorods to obtain the Zn 2 GeO 4 /ZIF-8 hybrid nanorods.The amount of ZIF-8 nanoparticles on the hybrid nanorods could be controlled by adjusting the reaction parameters such as the reaction time.The Zn 2 GeO 4 /ZIF-8 nanorods exhibited higher photocatalytic activity of CO 2 than the bare Zn 2 GeO 4 nanorods in the aqueous system, which should be attributed to the strong CO 2 adsorption property of ZIF-8 as well as a better light response compared to the bare Zn 2 GeO 4 nanorods.The strategy for developing more active photocatalysts shown here may be applicable to other catalytic systems for enhanced photocatalytic CO 2 conversion efficiency. Fig. 1 Powder X-ray diffraction patterns of (a) Zn 2 GeO 4 nanorods, (b) pure ZIF-8, and (c) Zn 2 GeO 4 /ZIF-8 hybrid nanorods.The peaks labelled with stars in (c) arise from ZIF-8. Fig. 2 (a and b) FE-SEM images, and (c) TEM and (d) HRTEM images of the Zn 2 GeO 4 /ZIF-8 nanorod.The inset in (d) shows the selected area electron diffraction pattern of the Zn 2 GeO 4 /ZIF-8 nanorod. Fig. 3 High-resolution XPS spectra of the prepared samples: (a) Zn 2p; (b) Ge 3d; (c) O 1s and (d) N 1s. Fig. 4 FT-IR spectra of (a) Zn 2 GeO 4 nanorods, (b) pure ZIF-8, and (c) Zn 2 GeO 4 / ZIF-8 hybrid nanorods. Fig. 5 DTA (blue curve) and TG (black curve) analysis of the samples: (a) Zn 2 GeO 4 nanorods, (b) Zn 2 GeO 4 /ZIF-8 hybrid nanorods, and (c) pure ZIF-8. 8c Fig. 6 (a) N 2 adsorption-desorption isotherms and (b) CO 2 adsorption isotherms (273 K) of the as-prepared samples. Fig. 7 CH 3 OH generation over (a) Zn 2 GeO 4 nanorods, (b) Zn 2 GeO 4 /ZIF-8 nanorods, and (c) 1 wt Pt-loaded Zn 2 GeO 4 /ZIF-8 nanorods as a function of light irradiation time. Scheme 1 Schematic representation of the synthesis of Zn 2 GeO 4 /ZIF-8 hybrid nanorods.11564 J. Mater.Chem.A, 2013, 1, 11563-11569 This journal is a The Royal Society of Chemistry 2013 J. Mater.Chem.A, 2013, 1, 11563-11569 This journal is a The Royal Society of Chemistry 2013 This work was supported by the Australian Research Council.The authors are grateful to the staff at the Monash Center for Electron Microscopy for their technical assistance.H.W. thanks the Australian Research Council for a Future Fellowship (FT100100192)."
  }
]