[
  {
    "title": "Doi",
    "content": "10.1016/j.ijhydene.2021.12.226"
  },
  {
    "title": "Article_Title",
    "content": "Switching charge transfer of g-C3N4/BiVO4 heterojunction from type II to Z-scheme via interfacial vacancy engineering for improved photocatalysis"
  },
  {
    "title": "Abstract",
    "content": "h i g h l i g h t s g r a p h i c a l a b s t r a c t Z-scheme g-C 3 N 4 /BVO heterojunctions are constructed by a sonochemistry method.Z-scheme charge migration pathway can enhance the charge separation efficiency.Charge transfer behavior can be switched by interfacial oxygen vacancies.Z-scheme g-C 3 N 4 /BVO heterojunctions can effectively work in TC degradation and CO 2 reduction."
  },
  {
    "title": "Experimental",
    "content": "Melamine (C 3 N 6 H 6 ), tetracycline (TC), and ammonium vanadate (NH 4 VO 3 ) were analytical grade and obtained from Aladdin Chemistry Co., Ltd, USA.Absolute ethanol, bismuth nitrate pentahydrate (Bi(NO 3 ) 3 5H 2 O), nitric acid (HNO 3 , 65e 68), sodium dodecyl (NaOH), benzene sulfonate (SDBS), N, Ndimethylformamide (DMF), tert-Butanol (TBA), p-benzoquinone (BQ) ethylenediaminetetraacetic acid disodium salt (EDTA-2Na) were analytical grade and purchased from Sinopharm Chemical Reagent Co, Ltd, China.All chemicals were used directly without further purification.MiliQ deionized water (DI-water, 18.25 MU) was used through all experiments. Step 1 Synthesis of g-C 3 N 4 nanosheets: The g-C 3 N 4 nanosheets were prepared by calcinating bulk g-C 3 N 4 in static air.First, 10 g of melamine was placed in an alumina crucible with a lid sequentially calcined at 350 C and 600 C for 2 h with a ramp rate of 2 C/min in a muffle furnace to obtain bulk g-C 3 N 4 .After that, 0.4 g of as-prepared bulk g-C 3 N 4 samples were thoroughly balling milled and put into a small ceramic boat and heated at 550 C for another 6 h with a ramp rate of 5 C/min.The obtained milky white powder (approximately 0.05 g) was collected and labelled as g-C The as-prepared samples were characterized by XRD, FT-IR, EPR, SEM, TEM, N 2 absorption-desorption, XPS, UVeViseNIR absorption, PL, time-resolved PL, EIS, and transient photocurrent.The detailed information about characterization instruments were described in Supporting Information. The electrochemical measurements were carried out in a three-electrode system (Ag/AgCl as the reference electrode, Pt as the counter electrode, and FTO conductive glass containing sample as working electrode) on CHI 760 E electrochemical workstation (Chenhua Instruments Company, China).The preparation method of working electrodes was as follows: 5 mg of photocatalyst was dissolved in 1 mL ethanol containing 5 vol Nafion, and the homogenized slurry was formed by ultrasonic for 15 min.Then, 20 mL of slurry was dropped on the fluoride-tin oxide (FTO) conductive glass and covering approximately 0.2 cm 2 .The electrolyte was 0.1 M Na 2 SO 4 solution. Photocatalytic performance was firstly tested by TC removal under visible light at ambient temperature in the photochemical reactor (XPA-7, Xujiang Instrument, Nanjing).The 500 W Xenon lamp was selected as the light source, and ultraviolet (UV) light was removed with a 400 nm cut-off filter. The circulating cooling water was used to avoid thermal effect in the photocatalytic reaction process.A typical photocatalytic TC removal experiment was prepared as follows: 50 mg of the as-prepared photocatalyst was added to 50 mL of TC solution (10 mg/L) and ultrasonicated for 10 min to form a homogeneous suspension system.Prior to the light irradiation, the suspension system was magnetically stirred for an hour in the dark to establish adsorption equilibrium.Afterward, the Xenon lamp was lighted up for photocatalytic reaction.4 mL TC-containing aliquots was sampled at a specific time interval and filtered with a 0.22 mm organic membrane. The TC concentration was determined by using an UVevisible spectrophotometer (UV-2450, Shimadzu, Japan) at 357 nm. The quenching experiments were performed by adding the tert-Butanol (TBA, 20 mmol/L), p-benzoquinone (BQ, 1 mmol/ L), and Ethylenediaminetetraacetic acid disodium salt (EDTA-2Na, 20 mmol/L) for capture OH, O 2 -, and h , respectively. The stability of the g-C 3 N 4 /BVO-20 composite by performing degradation of TC for four consecutive runs.After each cycle, photocatalysts were collected by centrifugation, washed, and dried thoroughly.Each run of photocatalytic experiments was performed according to the same experimental conditions.The photocatalytic performance of the as-synthesized samples was further evaluated by reducing CO 2 on a photoreaction system (CEL-SPH2N, Beijing China Education Au-light Co., Ltd., China) in a gas-solid system.In brief, 20 mg of the asprepared photocatalysts was evenly spread in a groove with a diameter of 3 cm, and then the groove was placed in the middle of a top-irradiation-type two-necked photoreactor containing 3 mL of deionized water.Before light illumination, the reaction system was evacuated, and then high-purity CO 2 (99.999) was introduced into the system until the pressure reached 40 kPa which was kept for half an hour to obtain an adsorption equilibrium.The temperature of the photocatalytic CO 2 reduction system was set at 20 C by cooling water circulation system, and a 300 W Xe lamp (CEL-NP2000) with an optical filter (l 400 nm) was used as the light source and positioned 15 cm above the photocatalytic reactor.The concentration of the main gas product was determined by a gas chromatograph (GC7920, Ar carrier) equipped with a hydrogen flame ionized detector (FID) with a capillary column."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The synthesis route of g-C 3 N 4 /BVO-20 composite is presented in Fig. 1a.To begin with, the g-C 3 N 4 nanosheets (denoted as g-C 3 N 4 ) with 2D structure are prepared by annealing bulk g-C 3 N 4 .The ultra-thin sheet-like structure and large specific surface area are favorable for decreasing the distance of charge transfer and exposing more active sites 6,22.BVO can be synthesized after hydrothermal reaction.BVO was chosen as the second semiconductor owing to its strong lightresponsive ability and high valence band potential 23.The matched band structure of g-C 3 N 4 and BVO provides the probability to construct heterojunction.Previous literature reported that introducing OVs to the surface of photocatalysts included inert gas reduction, sodium borohydride reduction, and hydrogen treatment, but these methods required hightemperature conditions and hazardous reagents 24.A relatively safe and straightforward low-frequency microwave treatment has recently been proven to introduce OVs into BiOI 25.Inspired by this, the similar method is adopted to introduce OVs to BVO based on the g-C 3 N 4 /BVO heterojunction.When coupling BVO with g-C 3 N 4 , the surface OVs of BVO can be regarded as interfacial OVs whilst act as reactive centers of charge carriers thereby inducing the formation of Z-scheme heterojunction.To verify the function of interfacial OVs in the charge migration, the OVs-deficient g-C 3 N 4 /BVO composite is obtained via refilling the OVs at 300 C in air. X-ray diffraction (XRD) patterns show the characteristic peaks of g-C 3 N 4 and BVO are both observed in the g-C 3 N 4 /BVO composites (Fig. 1b).The strongest peak at 2q 14 29.1 corresponds to the (A121) facets of BVO 26.For g-C 3 N 4 /BVO composites, the peaks positions have little shift compared with the single-component photocatalyst, indicating that g-C 3 N 4 /BVO composites preserve the complete structures of the original photocatalysts.FT-IR spectra (Fig. 1c) exhibits the information of chemical functional groups of the as-prepared samples.Similar to XRD results, the infrared spectra of g-C 3 N 4 /BVO composites possess the common vibration bands of g-C 3 N 4 and BVO, and no new vibration are detected.Subsequently, EPR tests are carried out to detect the oxygen vacancies.As shown in Fig. 1d, the g-C 3 N 4 /BVO composites show a unique resonance peak at g 14 2.004 (center field: 3372.57G) caused by unpaired electrons, which corresponds to the electrons trapped in OVs 27,28.The stronger EPR signals confirm qualitatively the high-concentration OVs.The above results preliminarily demonstrate the successful preparation of g-C 3 N 4 /BVO composites with OVs. The morphology of g-C 3 N 4 , BVO, and g-C 3 N 4 /BVO-20 composite is presented in Fig. S1 and Fig. 2. The SEM images (Fig. S1a) show that the bulk g-C 3 N 4 exhibits the stacked block structure, whereas the annealed g-C 3 N 4 (Fig. S1b) presents a porous sheet-like structure.The rectangular-like or squarelike morphology are observed for BVO (Fig. S1c).For the g-C 3 N 4 /BVO-20 composite (Fig. S1d), BVO particles are bonded with g-C 3 N 4 .Moreover, TEM and HRTEM images of the assynthesized photocatalysts are shown in Fig. 2 g-C 3 N 4 presents two-dimensional thin nanosheets (Fig. 2a), and BVO has an opaque irregular polygonal morphology (Fig. 2b), which is consistent with SEM analyses.Fig. 2cee confirm the successful combination of g-C 3 N 4 and BVO, and the contact interface between g-C 3 N 4 and BVO can be clearly observed.As shown in Fig. 2e, the heterojunction interface is prominent, and the lattice fringes at approximately 0.308 nm corresponded to the (A121) facets of BVO.The g-C 3 N 4 (amorphous structure) and BVO can be distinguished according to the different interfaces of crystalline BVO along with the yellow dotted line, and the formed interface will facilitate electron shuttling 29.Furthermore, the composition of the g-C 3 N 4 / BVO-20 composite is analyzed via EDX (Fig. 2f) and HAADF-STEM (Fig. 2g).The C, N, Bi, V, and O elements are distributed uniformly in the g-C 3 N 4 /BVO-20 composite, implying that g-C 3 N 4 and BVO are tightly bound.Therefore, the above analyses further demonstrate the successful preparation of g-C 3 N 4 /BVO-20 heterojunction with OVs. N 2 adsorption-desorption isotherms are measured to calculate the specific surface area (S BET ).As can be seen in Fig. S2a, the isotherms of all photocatalysts exhibit classical type IV curves with an H3 hysteresis loop, indicating that the as-prepared photocatalysts are rich in mesopores, which is in agreement with the SEM results 8.Benefiting from porous sheet-like structure, S BET of g-C 3 N 4 nanosheets (106.38 m 2 g A1 ) was almost 12 times larger than that of bulk g-C 3 N 4 (8.80 m 2 g A1 Fig.S3).The mesoporous g-C 3 N 4 with large S BET could provide more active sites and supporting sites to immobilize BVO 30.BVO possesses a small specific surface (3.06 m 2 g A1 ), which agrees with previous reports 31.S BET of g-C 3 N 4 /BVO composites slightly decreased compared with the porous g-C 3 N 4 nanosheets, which was probably due to the occupation of pores of g-C 3 N 4 by BVO nanoparticles or the altered pore structure of g-C 3 N 4 .The pore size distribution diagram shows the average pore size of the g-C 3 N 4 /BVO composites (approximately 10 nm), which inherits the mesoporous structures of g-C 3 N 4 nanosheets (Fig. S2b).Although S BET of g-C 3 N 4 /BVO composites is slightly lower than that of two-dimensional g-C 3 N 4 nanosheets, it may not compromise the photocatalytic activity of the composite 32. In clarifying the interface interaction and analyzing the chemical states of surface elements over the as-prepared samples, XPS spectra are presented in Fig. 3. Fig. 3a shows the full survey XPS spectra, demonstrating that the g-C 3 N 4 / BVO-20 composite is composed of C, N, Bi, V, and O elements, which is in accordance with the EDX analysis.C 1s spectra (Fig. 3b) can be deconvoluted into two peaks (284.8 and 288.1 eV for g-C 3 N 4 , 284.6 and 287.9 eV for the g-C 3 N 4 /BVO-20), which are assigned to sp 2 CeC bonded adventitious carbon and sp 2 -bonded carbon in N-containing aromatic rings (NeC N), respectively 5,33.Compared with g-C 3 N 4 , the blue shift in the binding energies of the g-C 3 N 4 /BVO-20 composite demonstrates the strong interactions at the heterojunction interface.As shown in Fig. 3c, the four peaks of the g-C 3 N 4 / BVO-20 composite at 398.3, 399.9, 400.5, and 404.1 eV in N 1s spectra can be observed, which are due to the pyridinic nitrogen (NeCN), graphitic nitrogen (NeC 3 groups), amino groups species and p-excitations (p/p transition), respectively 34,35.Fig. 3d shows two peaks at 158.6 and 163.8 eV of BVO, which are separately correlated with Bi 4f 7/2 and Bi 4f 5/2 electron orbits 36.Similarly, two peaks at 516.3 and 523.8 eV in Fig. 3e corresponding to V 2p 1/2 and V 2p 3/2 electron orbits, respectively, are shifted to a low energy direction 26.As shown in Fig. 3f, the O 1s spectra at 529.1 and 532.6 eV correspond to the lattice oxygen and absorbed CO 2 or H 2 O on the surface.Notably, compared with pure BVO, the peak at 531.2 eV corresponding to OVs in the g-C 3 N 4 /BVO-20 composite is significantly enhanced, revealing the highconcentration OVs, which are consistent with the results of EPR tests 37,38.Compared with bare g-C 3 N 4 and BVO, the peaks of the g-C 3 N 4 /BVO-20 composite showed an approximately 0.1e0.6 eV shift, which can be due to the strong interactions of the two components caused by the change of the chemical environment.To sum up, XPS results demonstrate the formation of heterojunction, the introduction of OVs, and the strong interfacial interaction.To investigate the dynamic behaviors of photoexcited charge carriers of as-prepared photocatalysts, photoelectrochemical tests are performed (Fig. 4).For photocatalytic reaction, the light adsorption and charge separation and migration are two critical parameters.The EIS Nyquist plots show that the g-C 3 N 4 /BVO-20 composite exhibits small arc radius, indicating that the impedance of electron transfer is low, thereby leading to fast electron transfer rate (Fig. 4a) 35.The photocurrent density (Fig. 4b) of the g-C 3 N 4 /BVO-20 composite is larger than those of bare g-C 3 N 4 and BVO under interval illumination, demonstrating efficient electron-hole pairs migration and separation on the g-C 3 N 4 /BVO-20 composite.In Fig. 4c, the g-C 3 N 4 /BVO composite exhibits evidently decreased Photoluminescence (PL) emission intensity with regard to bare g-C 3 N 4 , implying the faster migration rate of the excitons and the low recombination of electron-hole pairs 39.Furthermore, time-resolved PL spectra (Fig. 4d) demonstrate that the g-C 3 N 4 /BVO-20 composite shows a significantly increased fluorescence lifetime.Considering the main content (80 wt) of g-C 3 N 4 in the composites, the PL signals of the g-C 3 N 4 /BVO-20 composite are primarily assigned to excited g-C 3 N 4 .For the g-C 3 N 4 /BVO-20 composite, the average radiative lifetime (A t ) of the g-C 3 N 4 /BVO-20 composite increases to 26.56 ns, which is greatly improved compared with bare g-C 3 N 4 (6.09ns).Longer lifetime indicates enhanced charge dissociation photoactivities of the g-C 3 N 4 /BVO-20 composite 40.The results of photoelectrochemical tests suggest the charge separation efficiency of g-C 3 N 4 /BVO-20 heterojunction enhance significantly compared to single-component photocatalysts, which might be due to the formed Z-scheme heterojunction promoted charge carrier separation and migration. To demonstrate the role of interfacial OVs in the Zscheme system, the photocatalytic activity of as-prepared samples is evaluated by photocatalytic TC degradation and CO 2 reduction.As shown in Fig. 5a, the blank experiment indicates that TC is hardly be degraded without catalysts under illumination.The g-C 3 N 4 and BVO can only separately remove 61 and 65 of TC in 3 h under visible light irradiation, while the g-C 3 N 4 /BVO composites exhibit greatly enhanced photocatalytic TC degradation activities.The optimal loading amount of BVO is determined to be 20 wt.The g-C 3 N 4 /BVO-20 composite exhibits 90 of the highest activity in 3 h, which is approximately 1.48 and 1.38 times higher than g-C 3 N 4 and BVO.The enhanced photocatalytic activity of TC can be attributed to the OVs-rich Z-scheme heterojunction, which accelerates the separation and transfer of photogenerated electron-hole pairs.However, an excessive BVO results in decreased photocatalytic degradation activity, which may be due to excessive BVO could cover the active site on the surface of g-C 3 N 4 .In addition, the mechanically mixed g-C 3 N 4 /BVO-20 composite is synthesized, and the experimental results show that its photocatalytic performance (58 removal rate in 3 h) is inferior to the g-C 3 N 4 /BVO-20 heterojunction photocatalyst, implying that interfacial OVs mediated Z-scheme heterojunction can effectively improve photocatalytic performance.The pseudo-first-order reaction kinetic model is adopted to estimate the apparent rate constants (k) for TC removal (Fig. 5b).The k values of g-C 3 N 4 /BVO composite (0.0094 min A1 ) is 2.04 and 2.29 times higher than that of g-C 3 N 4 (0.0046 min A1 ) and BVO (0.0041 min A1 ), respectively (Fig. S4).This result further indicates that the construction of heterojunction can promote the separation and migration of photogenerated electron-hole pairs.The stability of the g-C 3 N 4 /BVO-20 composite by performing degradation of TC for four consecutive runs (Fig. 5c).After four cycles, the TC degradation activity of g-C 3 N 4 /BVO-20 composite only reduces by 5.4, indicating that the g-C 3 N 4 /BVO-20 composite presented high stability for the degradation of TC.In addition, the XRD patterns (Fig. S5) before and after photocatalytic reaction show that the crystal structure is not changed, suggesting that the g-C 3 N 4 /BVO-20 composite possess good stability.In addition, the quenching experiments (Fig. S6a) demonstrate that the contribution to the photocatalytic TC degradation of reactive oxygen species: O the dominant reactive active specie for TC removal and OH and h have also participated in the degradation of TC.EPR as a powerful tool can precisely identify free radical species.As shown in Fig. S6b, no signals are detected in the dark, implying that light is an essential condition for the production of reactive oxygen species.production of CO and CH 4 for the g-C 3 N 4 /BVO-20 composite is up to 0.14 mmol and 0.08 mmol, respectively, which are separately 2.8 and 4.0 times higher compared with bare g-C 3 N 4 . The enhanced CO 2 conversion efficiency can be attributed to the high-concentration OVs in g-C 3 N 4 /BVO-20 heterojunction, which can not only induce charge migration to the heterojunction interface, but also capture more electrons and absorb CO 2 on the surface of photocatalysts 27.Furthermore, the CO 2 reduction performance of the g-C 3 N 4 /BVO composites in this work was compared with those of other studies (Table S1). The aforementioned results indicate that interfacial OVs mediated Z-scheme g-C 3 N 4 /BVO-20 heterojunction can accelerate charge separation and transfer, thereby enhancing photocatalytic activity. The UVevisible absorption spectra of the as-synthesized samples are recorded in Fig. 6a.The maximum absorption edges of g-C 3 N 4 /BVO composites are between the maximum absorption edge of g-C 3 N 4 (429 nm) and BVO (530 nm).Compared with pure g-C 3 N 4 , the maximum absorption edges of all g-C 3 N 4 /BVO composites have a red shift, demonstrating the enhanced visible-light-responsive abilities.Furthermore, E g of g-C 3 N 4 and BVO is determined to be 2.89 eV and 2.45 eV, respectively (Fig. 6b).Notably the expanded bandgap of g-C 3 N 4 is attributed to the quantum size effect 41.Combining the XPS valence band spectra (XPS VB) (Fig. 6c), the valence band (VB) of g-C 3 N 4 and BVO is 1.68 eV and 2.61 eV, respectively.Furthermore, according to the following formula: E VB 14 E CB- E g , CB of g-C 3 N 4 and BVO is A1.21 and 0.16 V (vs.NHE, pH 14 0), respectively 29. Based on the relative energy band levels of g-C 3 N 4 and BVO, the conventional type-II and direct Z-scheme charge transfer mechanisms were discussed.The EPR test shows that OVsdeficient g-C 3 N 4 /BVO-20 composite exhibits extremely poor OVs signals, confirming the OVs are successfully refilled by oxygen (Fig. 6d).To provide more convincing evidence supporting the Z-scheme charge transfer mechanism, we tested the photocatalytic TC degradation rates (Fig. 6e) and CO 2 reduction efficiency (Fig. 6f) over g-C 3 N 4 /BVO-20 and OVs- deficient g-C 3 N 4 /BVO-20 composite.When light excites g-C 3 N 4 or BVO to generate photogenerated electrons, the photogenerated electrons diffuse from the CB of g-C 3 N 4 to the CB of BVO because the CB value of g-C 3 N 4 (A1.21V vs. NHE) is more negative than that of BVO (0.16 V vs. NHE), whilst the holes migrate from the VB of BVO to the VB of g-C 3 N 4 because the VB value of BVO is more positive than that of g-C 3 N 4 .Thus, the type-II OVs-deficient g-C 3 N 4 /BVO-20 heterojunction is constructed (Fig. 6g, left).As shown in Fig. 6e, the removal rate of TC of OVs-deficient g-C 3 N 4 /BVO-20 composite drops by approximately 7 compared to g-C 3 N 4 /BVO-20 composite.Also, in terms of the CO 2 RR, the OVs-deficient g-C 3 N 4 /BVO-20 composite can only detect a little CO, and no CH 4 is detected, which is due to the generation of CH 4 requires a large amount of CO (Fig. 6f) 42.The obtained CO may be generated on the intrinsic g-C 3 N 4 , which has little association with the heterojunction.The decreased photocatalytic activities are assigned to the poor redox ability of type-II heterojunction due to the high-potential charge carriers diffuse to the low potential of another photocatalyst. To our knowledge, surface OVs and bulk OVs may exist in the BVO crystal structure simultaneously, and show completely different effects on the photocatalytic performance.Surface OVs can decelerate the recombination rate of electron-hole pairs and serving as reactive centers in photocatalysis, while bulk OVs tend to reduce photocatalytic activity 43.According to the photocatalytic activity evaluation, we can roughly speculate that the amount of surface OVs is greater than that of bulk OVs over BVO.When coupling BVO with g-C 3 N 4 , the surface OVs of BVO can be regarded as interfacial OVs whilst act as reactive centers of charge carriers thereby inducing the charge separation and migration via the BVO-OVs-g-C 3 N 4 .Thus, the effective charge separation and migration are achieved and strong oxidation/reduction ability would be preserved.The interfacial OVs mediated g-C 3 N 4 / BVO-20 Z-scheme heterojunction can be constructed (Fig. 6g, right).Considering the oxidation potentials of H 2 O or OH A (OH A to OH 2.38 V vs. NHE; H 2 O to OH 1.99 V vs. NHE), VB of the Z-scheme g-C 3 N 4 /BVO-20 heterojunction is 2.61 V vs. NHE, which is positive enough to generate OH 44,45.Simultaneously, the CB potential of the g-C 46,47. Otherwise, the interfacial OVs can effectively adsorp and active CO 2 45,46.Therefore, compared with singlecomponent photocatalysts and type-II heterojunction system, the Z-scheme g-C 3 N 4 /BVO-20 composite with considerable OVs presents outstanding photocatalytic performance. To sum up, the charge transfer of g-C 3 N 4 /BVO could be switched from type II to Z-scheme via interfacial OVs."
  },
  {
    "title": "Conclusions",
    "content": "The interfacial OVs were introduced via a simple sonochemistry method, which acted as the reactive center of charge carriers to quench the electrons of BVO and holes of g-C 3 N 4 , thereby promoting charge separation and switching the charge transfer pathway from type II to Z-scheme.As a result, the Z-scheme g-C 3 N 4 /BVO heterojunction presented the strong redox capacity and showed brilliant photocatalytic activity.This work provides a feasible method by the interfacial OVs engineering for enhancing photocatalysis, and also, a strategy for switching heterojunction type, not limited from type II to Z-scheme.It should be pointed out that, in this work, HAADF with spherical aberration corrector was not used to visually observe the interfacial OVs, and the concentration of OVs was not quantitatively discussed, both of which are important for further research in the future. e - Fig. 1 e (a) Synthesis of the g-C 3 N 4 , BVO, g-C 3 N 4 /BVO-20, and OV-deficient g-C 3 N 4 /BVO-20 photocatalysts.(b) XRD patterns, (c) FT-IR spectra, and (d) EPR spectra of g-C 3 N 4 , BVO, and g-C 3 N 4 /BVO composites. Fig. 2 e (a, b) TEM images of (a) g-C 3 N 4 , and (b) BVO.(c, d, e) HR-TEM images of g-C 3 N 4 /BVO-20 composite.(f) EDX spectra of g-C 3 N 4 /BVO-20 composite.(g) Elemental mapping images of g-C 3 N 4 /BVO-20 composite with C (red), N (brown), Bi (purple), V (green), O (yellow) and all elements distribution.(For interpretation of the references to color in this figure legend, the reader is referred to the Web version of this article.) Fig. 3 e (a) XPS survey spectrum and high-resolution spectra of (b) C 1s, (c) N 1s, (d) Bi 4f, (e) V 2p, and (f) O 1s over asprepared photocatalysts. Fig. 4 e (a) Electrochemical impedance spectra and (b) photocurrent responses plots of g-C 3 N 4 , BVO, and g-C 3 N 4 /BVO-20 composite.(c) Steady-state PL emission spectra (l ex 14 375 nm) of g-C 3 N 4 and g-C 3 N 4 /BVO-20 composite.(d) Time-resolved transient PL spectra of the g-C 3 N 4 , BVO, and g-C 3 N 4 /BVO-20 composite. Fig. 5 e (a) The degradation rate and (b) the pseudo-first order reaction kinetic model of TC over as-prepared samples.(c) Stability test and (d) CO 2 conversion to chemicals test over g-C 3 N 4 /BVO-20 composite. Fig. 6 e (a) UVevis absorption spectra for g-C 3 N 4 , BVO, and g-C 3 N 4 /BVO composites.(b) Tauc plots and (c) XPS valence band spectra of g-C 3 N 4 and BVO.(d) EPR tests, (e) photocatalytic TC degradation and (f) the yields of photocatalytic CO 2 reduction of g-C 3 N 4 /BVO-20 composite and OVs-deficient g-C 3 N 4 /BVO-20 samples.(g) Proposed photocatalytic mechanism of the type-II heterojunction and Z-scheme heterojunction. The EPR signal of DMPO-O 2 three essential factors for the CO 2 reduction reaction.For pure BVO, no products can be detected because its CB potential is not negative enough to reduce CO 2 .The g-C 3 N 4 exhibits a poor CO 2 conversion ability, and the yield of CO and CH 4 is 0.05 mmol and 0.02 mmol in 4 h under visible-light irradiation.Obviously, under visible light irradiation, the g-C 3 N 4 / BVO composites exhibit giant improved photocatalytic CO and CH 4 evolution performance compared to pure g-C 3 N 4 .The 3 N 4 /BVO-20 composite is negative enough to generate O 2 -for TC degradation and reduce CO 2 to chemicals (O 2 /O 2 -A0.33V vs. NHE; CO 2 to CO A0.53 V vs. NHE; CO 2 to CH 4 A0.24V vs. NHE) i n t e r n a t i o n a l j o u r n a l o f h y d r o g e n e n e r g y 4 7 ( 2 0 2 2 ) 8 7 4 9 e8 7 6 0 This work was financially supported by the Qing Lan Project, the Modern Agriculture Project in Jiangsu Province BE2018328, and the Six Talent Peaks Project in Jiangsu Province 2018-TD-JNHB-012.We would like to thank the Testing Center of Yangzhou University for their help with sample characterization. Ganghua Zhou: Investigation, Data curation, Formal analysis, Writing e origin draft. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://doi.org/10.1016/j.ijhydene.2021.12.226."
  }
]