[
  {
    "title": "Doi",
    "content": "10.1007/s10008-013-2143-y"
  },
  {
    "title": "Article_Title",
    "content": "Fabrication of self-organized TiO2 nanotube arrays for photocatalytic reduction of CO2"
  },
  {
    "title": "Abstract",
    "content": "The photocatalytic conversion of CO 2 and H 2 O to alcohols was achieved using self-organized TiO 2 nanotube arrays (TNAs), which were prepared by electrochemical anodization of Ti foils in 1 M (NH 4 ) 2 SO 4 electrolyte containing 0.5 wt NH 4 F. Experimental results revealed that the morphology and structure of self-organized TNAs could be strongly influenced by the applied voltage and anodization temperature, and the optimized TNAs were prepared by electrochemical anodization of Ti foils under optimal conditions (i.e., at 20 V for 2 h at 30 C).The as-prepared TNAs were amorphous and could be transformed to anatase phase during the thermal treatment at 450 C in air for 3 h.By using the annealed TNAs as a photocatalyst, the photocatalytic reduction of CO 2 to alcohol, predominately methanol and ethanol, was demonstrated under Xenon lamp illumination.Based on the photocatalytic measurements, the production rates of methanol and ethanol were calculated to be 10 and 9 nmol cm -2 h -1 , respectively.In addition, the formation mechanism of methanol and ethanol was also tentatively proposed.Keywords Electrochemical anodization .TiO 2 nanotube arrays (TNAs) .Photocatalytic reduction of CO 2 .Methanol .Ethanol"
  },
  {
    "title": "Experimental",
    "content": "TNAs were fabricated by the electrochemical anodization of Ti foils.Ti foils (0.5 mm thick, 99 purity) were purchased from Beijing General Research Institute for Nonferrous Metal.Prior to anodization, Ti foils were rinsed in the mixed solution (HF/HNO 3 ) for several minutes, followed by ultrasonic cleaning in isopropanol, acetone, methanol, and ethanol.After these treatments, the Ti foils were rinsed with deionized water and dried in a nitrogen stream. The electrochemical anodization process was carried out using a direct current power supply in a two-electrode electrolytic cell with the pretreated Ti foil as the working electrode and Pt wire as the counter electrode at room temperature.The electrolyte was the aqueous solution of (NH 4 ) 2 SO 4 (1 M) containing 0.5 wt NH 4 F. The electrochemical treatment consisted of a potential ramp from the open-circuit potential to a set potential (e.g., 20 V) with a sweep rate (0.1 V/s) followed by holding the applied potential at the set value (e.g., 20 V) for 2 h.After the anodization, the obtained sample was immediately rinsed with deionized water several times and dried with a N 2 stream.Then, the obtained sample was annealed at 450 C in air for 3 h. The morphological features of the samples were examined using a field-emission scanning electron microscope (FESEM, JEOL JSM-6700 F, Japan).The crystal structure was identified by an X-ray diffractometer (XRD, Thermo ARL, X'TRA, Switzerland).The diffuse reflectance spectra (DRS) were determined by a UV-vis spectrometer (Puxi, TU-1901, China) equipped with an integrating sphere accessory.Specific surface areas were measured by Brunauer-Emmett-Teller (BET) nitrogen adsorption-desorption (Shimadzu, Micromeritics ASAP 2010 Instrument). The photocatalytic measurements of TNAs for CO 2 conversion were carried out in a home-made glass reactor with the size of 50 mm in diameter and 100 mm in height (Fig. 1).The reactor was designed with two valves for the inlet/outlet of gas flow and a quartz window at the top for light irradiation.The TNA sample (22 cm) was fixed on the stent in the reactor, and 10 ml of deionized water was subsequently injected to the reactor.The injected water in the reactor was used to keep the reactant gas (CO 2 ) saturated with water vapor during the whole photocatalytic reaction.The reactor was then completely sealed, and purged with argon through the inlet/outlet valves for 30 min.After that, 200 ml of carbon dioxide (99.9 purity), via a mass flow controller (Huibolong, MT50-2J, China), saturated with water vapor by passing through a water container was then fed to the reactor.The sealed reactor was subsequently exposed to UV-vis irradiation for photocatalytic reactions under ambient conditions with an average intensity of 35 mW cm -2 produced by a 100-W Xenon lamp.At given time intervals, the photocatalytic gaseous products in the reactor were extracted using a microsyringe, and then immediately injected into an Agilent (6820) gas chromatograph (GC) equipped with a flame ionization detector for analysis.For comparison, the commercial P25 TiO 2 nanoparticles were also used as a photocatalyst for the photoreduction of CO 2 under the same experimental conditions.The P25 TiO 2 photocatalyst sample was prepared by spreading the paste of P25 TiO 2 nanoparticles on the substrate of Ti foil (22 cm), followed by drying in a vacuum oven at 80 C for 2 h."
  },
  {
    "title": "Results_and_Discussion",
    "content": "TNAs were prepared by electrochemical anodization of Ti foils for 2 h in 1 M (NH 4 ) 2 SO 4 electrolyte containing 0.5 wt NH 4 F. To investigate the influence of anodization voltage and reaction temperature on the morphology of TNAs, a series of experiments were carried out in the SO 4 2 -/F --based aqueous electrolyte.By adjusting the anodization voltage, TNAs with different morphologies could be obtained.With the increase of the voltage, the average tubular diameter of TNAs increased.The optimal voltage for the formation of the optimized TNAs was found to be 20 V (Fig. S1).With respect to the influence of the reaction temperature, two samples of TNAs were prepared by electrochemical anodization at 20 V for 2 h at 15 and 30 C, respectively.It was found that there was no obvious difference between the morphologies of these two samples except for the tube length (Fig. S2).At the higher reaction temperature (30 C), TNAs with longer nanotubes were prepared.According to the above experimental results, self-organized TNAs described below for CO 2 photoreduction were thus prepared by electrochemical anodization under optimal conditions, i.e., at 20 V for 2 h at 30 C. The morphology, structure, and properties of the selforganized TNAs prepared under optimal conditions were characterized by using various techniques including FESEM, XRD, and DRS. Figure 2 shows the FESEM images of the as-prepared TNAs.As shown in Fig. 2a,b, the TNAs possessed a self-organized regular nanotubular structure with a length of 1.7 m, an average pore diameter of 80 nm, and an average wall thickness of 15 nm, and all the nanotubes of TNAs were kept open and well arrayed on the Ti substrate.The composition of TNAs was identified by energy dispersive X-ray (EDX) analysis.From the EDX results (Fig. 2c), it was found that only Ti and O peaks could be observed, and the atomic ratio of Ti and O was approxi- The crystalline phase of the as-prepared TNAs was examined by an X-ray diffractometer.Figure 3 shows the XRD patterns of the pretreated Ti foil curve (a) and the asprepared TNAs before and after being annealed at 450 C in air for 3 h curves (b) and (c).As shown, the diffraction pattern of the as-prepared TNAs sample without the thermal treatment (curve b) was similar to that of Ti foil (curve a), which was ascribed to the phase of Ti substrate.This indicated that the as-prepared TNAs were amorphous.For the annealed TNAs (curve c), however, five characteristic peaks (225.0,37.7, 47.8, 53.9, and 54.9), marked by their Miller indices (101), (004), (200), (105), and (211), could be well indexed as phase-pure anatase TiO 2 , and other peaks could be assigned to the Ti substrate.This result confirmed that the amorphous TNAs could be transformed to crystalline anatase phase during the thermal treatment at 450 C in air for 3 h.Meanwhile, the influence of thermal treatment on the Fig. 1 Schematic diagram of the reactor system for photocatalytic reduction of CO 2 with H 2 O on the photocatalyst of TNAs morphology of TNAs was also investigated.It was found that the morphology of the TNAs kept unchanged during the thermal treatment at 450 C for 3 h (Fig. S3), indicating that the thermal treatment had no influence on the morphology of as-prepared TNAs. In order to examine the electronic properties of the asprepared TNAs, measurements of the UV-vis DRS spectra were performed.Figure 4 shows the DRS spectra expressed in terms of the Kubelka-Munk function F(R) 37.As shown, the band-gap energy of as-prepared TNAs after being annealed at 450 C was calculated to be 3.34 eV (corresponding to the excitation wavelength of 371 nm), which was less than that of commercial TiO 2 nanoparticles (P25, Degussa) (3.54 eV, corresponding to the excitation wavelength of 350 nm).Compared to the commercial P25 TiO 2 nanoparticles, the band gap of the as-prepared TNAs decreased by approximately 0.2 eV, indicating that the absorption edge of the as-prepared TNAs slightly red-shifted.Thus, the as-prepared TNAs were expected to possess high efficient photocatalytic activities as a consequence of the enhanced optical absorption in the UV-vis region. The photocatalytic activities of the as-prepared TNAs after being annealed were evaluated by photocatalytic reduction of CO 2 with water under Xenon lamp illumination, and the photocatalytic reaction products were monitored by GC. Figure 5 shows the GC results of a standard sample of methanol (Fig. 5a), a standard sample of ethanol (Fig. 5b), and a sample of photocatalytic reaction product (Fig. 5c).As shown, the retention time of methanol and ethanol was 3.18 and 3.35 min, respectively.For the sample of photocatalytic product, there were two obvious characteristic peaks at 3.16 and 3.38 min, respectively, indicating that the products predominately contained methanol and ethanol, which was consistent with the previous reports 15,38.Besides these two major peaks, several small peaks were also found in the curve c, indicating that there could be other possible products formed during the photoreduction of CO 2 .Further detailed and systematic characterization has to be performed to identify all possible products.In addition, control experiments showed that no alcohol (neither methanol nor ethanol) was The yield of the photocatalytic products was also investigated.Figure 6a shows the variation of GC peak area of the photocatalytic product with the illumination time.As shown, the peak area increased with the increase of illumination time within the first 3 h and then kept steady.That is to say, the photocatalytic product (including methanol and ethanol) gradually increased with the increase of illumination time within the first 3 h and then leveled off, indicating that the photocatalytic reaction for CO 2 conversion in the reactor was completed within 3 h.Thus, the production rates of methanol and ethanol were calculated to be 10 and 9 nmol cm -2 h -1 , respectively.In addition, it should be noted that the tiny fluctuation of peak area after 3 h illumination was mainly due to the fluctuation of the temperature inside the photoreactor (Fig. 6b).Moreover, for comparison, the commercial P25 TiO 2 nanoparticles were also used as a photocatalyst for photoreduction of CO 2 under the same photocatalytic reaction conditions.The photocatalytic results (Table 1) revealed that the use of commercial P25 TiO 2 nanoparticles resulted in a relatively low amount of CO 2 conversion with the production rates of ca.1.2 (methanol) and 0.95 nmol cm -2 h -1 (ethanol).This demonstrated the superiority of photocatalytic activities of TNAs over the commercial P25 TiO 2 nanoparticles. A significant advantage with the photocatalyst of TNAs was their photostability.The TNAs exhibited no deterioration in photocatalytic activities over an extended photoirradiation time (at least 24 h).They were also reusable multiple times in repeated photoreduction reactions of CO 2 .For example, after the TNA sample was used in a photoreduction experiment, it was washed thoroughly with deionized water followed by thermal treatment at 120 in a vacuum oven for 12 h to degas the surfaces of the catalysts, and then reused in the second photoreduction under the same experimental conditions.The product yields obtained in the two experiments were hardly distinguishable.The reusing of the TNA sample was repeated again, and the photoreduction results remained similar.This was different from that with the use of the commercial P25 TiO 2 nanoparticles (Table 1) or other colloidal photocatalysts 39, for which significant deterioration in their photocatalytic activities was found. During the photoreduction of CO 2 by gaseous water, photocatalysts with larger surface area values usually could provide more reaction active sites.In the present study, the selforganized TNAs sample prepared by the electrochemical anodization possessed a larger surface area value (BET specific surface area, 68 m 2 g -1 ) than the commercial P25 TiO 2 nanoparticles (BET specific surface area, 46 m 2 g -1 ).As can be seen, the surface area value increased by 47.8 , but the photocatalytic activity increased more than eight times (Table 1).It follows that the morphology and the structure of TNAs play important roles in the photocatalytic reduction of CO 2 to alcohol.The separation and transportation of photogenerated carriers (i.e., electrons and holes) is crucial for the photocatalytic activity.As the TNA sample is essentially onedimensional nanotubular structure while the P25 TiO 2 sample is nanoparticles, the photogenerated carriers in TNAs could migrate to the surface more quickly than in P25 TiO 2 nanoparticles.As a consequence, the TNA sample exhibited much higher activities than the P25 TiO 2 nanoparticles.In addition, the adsorption of water should also have significant influence in the present heterogeneous photocatalytic reaction.As illustrated in Fig. 7a, water molecules could be easily intercalated into the tubular space of TNAs through hydrogen bonding 40; this facilitates the trapping of photogenerated holes and the formation of H species, and consequently leads to the higher rates of alcohol formation. It should be noted that there was no O 2 detected in the photocatalytic reduction of CO 2 over the TNAs sample in the current study.We consider that this phenomenon might be attributed to the behavior of holes on the surface of the photocatalysts.A similar observation was also made in some other photocatalytic processes 41.In our case, the physisorbed O 2 molecules were supposed to be produced through the neutralization of chemisorbed O 2-species by photogenerated holes 42, and the produced O 2 could be photoadsorbed on the surface of the photocatalyst under UV irradiation.Moreover, molecular hydrogen was also not detected in the photocatalytic reduction of CO 2 .Because the concentration of CO 2 in the reactor was much higher than that of photogenerated H radicals, it is considered that the probability of H radicals being trapped by CO 2 to form hydrocarbon was larger than the probability of two H radicals react to form H 2 .Although molecular hydrogen was not detected, we could not exclude that water splitting takes place in the present study.Since H 2 could also serve as reductant for CO 2 photoreduction 43, the trace amount of photogenerated H 2 (if there is any) could be quickly consumed by CO 2 and therefore could hardly be detected. From the above discussions and literature reports, the possible reaction mechanism for photocatalytic reduction of CO 2 with H 2 O on the photocatalyst of TNAs could be proposed in the following way Eqs.to the conduction band of TNAs reacted with CO 2 to form CO 2 -Eq.( 4) 18,46.The CO 2 -was metastable, and could be further reduced in the presence of H to chemisorbed CO Eq.( 5) 34,47,48.Then, the new formed CO was reduced to methylene group (CH 2 ) Eq. ( 6), and the CH 2 was further transformed to methanol and ethylidene by reaction with OH and H Eq.( 7) 2, 34,49 or by reaction with another CH 2 Eq.( 8), respectively.Thereafter, ethanol was formed from the reaction of ethylidene, OH and H Eq.( 9) 49,50. Further rigorous studies are required to verify the validity of this hypothesis and understand the photocatalytic process of TNA-based photocatalysts for CO 2 conversion to hydrocarbons."
  },
  {
    "title": "Conclusions",
    "content": "In this work, self-organized TNAs were successfully prepared by electrochemical anodization of Ti foils in 1 M (NH 4 ) 2 SO 4 electrolyte containing 0.5 wt NH 4 F under optimal conditions (i.e., at 20 V for 2 h at 30 C).The asprepared TNAs possessed a self-organized regular nanotubular structure with a length of 1.5 m, an average pore diameter of 80 nm, and an average wall thickness of 15 nm.After the thermal treatment at 450 C in air for 3 h, the as-prepared amorphous TNAs were transformed to crystalline anatase phase.Compared to the commercial TiO 2 nanoparticles (P25, Degussa), the band gap of the annealed TNAs decreased by approximately 0.2 eV, indicating the redshifted absorption edge and the enhanced photocatalytic activities of TNAs. The photocatalytic activities of the annealed TNAs were evaluated by photocatalytic reduction of CO 2 with H 2 O under Xenon lamp illumination.Photocatalytic measurements revealed that CO 2 were photocatalytically reduced to hydrocarbons, predominately methanol and ethanol, and the production rates of methanol and ethanol were calculated to be 10 and 9 nmol cm -2 h -1 , respectively.Moreover, the mechanisms of photocatalytic reduction of CO 2 with H 2 O to methanol and ethanol were also tentatively proposed.Thus, it is expected that this work will enrich the fundamental theory of TNA-based photocatalysts not only for efficient CO 2 conversion and fixation, storage of solar energy but also for solving environmental problems. mately 1:2, indicating the formation of TiO 2 during the electrochemical anodization of Ti foils.The FESEM results directly demonstrated the successful preparation of selforganized TNAs with a length of 1.5 m by electrochemical anodization of Ti foils in the SO 4 2-/F --based aqueous electrolyte under optimal conditions. Fig. 2 FESEM images of the as-prepared TNAs by anodization of Ti foils at 20 V for 2 h in the SO 4 2-/F --based electrolyte at 30 C. a Top-view image, b Cross-sectional image, c EDX results of the as-prepared TNAs Fig. 4 UV-vis diffuse reflection spectra (DRS) plotted as K-M function F(R) for a TiO 2 P25 nanoparticles and b TNAs after being annealed at 450 C (1, 2, 3, 4, 5, 6, 7, 8, and 9), as shown in Fig.7.Upon light irradiation, TNAs generated the pairs of electron and hole Eq.(1).The exited holes reacted with adsorbed water molecules on the catalyst surface to form hydroxyl radicals (OH) and hydrogen ions (H ) Eq. (2)2,44,45.Subsequently, the interaction of H ions with the excited electrons led to hydrogen radicals (H) Eq.(3).Meanwhile, the photoexcited electron transferred Fig.6The variation of a the GC peak area of photocatalytic products and b the reaction temperature versus the illumination time during the process of CO 2 photoreduction Fig. 7 a Schematic illustration of photocatalytic reduction of CO 2 with H 2 O on the photocatalyst of TNAs; b The proposed mechanism of photocatalytic reduction of CO 2 with H 2 O to methanol and ethanol on the surface of TNAs Photocatalytic conversion of CO 2 with different photocatalysts Acknowledgments This work was financially supported by the National Natural Science Foundation of China (nos.51072189, 21003111, and 11075147)."
  }
]