[
  {
    "title": "Doi",
    "content": "10.1016/j.jtice.2021.08.017"
  },
  {
    "title": "Article_Title",
    "content": "Construction of hierarchical ZnS@ZnO secured from metal – organic framework- ZnS@ZIF-8 for enhanced photoreduction of CO2"
  },
  {
    "title": "Abstract",
    "content": "Background:The CO 2 photochemical conversion reaction has received attention under mild conditions.The CO 2 photoreduction to CH 3 OH has become an approach of \"one stone to kill two birds\" since it provides the probability to complete the carbon circle and create invaluable products in a rotational economy.Method: One-pot synthesis of porous ZnSZnO was developed with a large surface area of 1530 m 2 /g by Zn (NO 3 ) 2 , Na 2 S and 2-methylimidazole as precursors.The obtained Pt/ZnSZnO heterostructure was evaluated for photoconversion of CO 2 to CH 3 OH through visible light illumination.Significant findings: The most photoactive 1Pt/ZnSZnO showed a CH 3 OH formation of 1402 mmol g A1 after 9 h, which was enhanced 11.2-and 10.97-times larger than ZnO and ZnSZnO.The CH 3 OH formation rate over 1Pt/ZnSZnO was promoted 12 times greater than ZnO and ZnSZnO heterostructure.The synthesized photocatalyst exhibited high stability and durability after five repeated cycles within 45 h.The superior CO 2 reduction over Pt/ZnSZnO could be imputed to i) the construction of heterojunction between ZnS and ZnO, which enhanced the charge carriers-migration process and promoted the charge carriers lifetime; ii) the different energy levels led the high oxidative ability of the adsorbed OH surface and hence facilitates the catch of photoinduced holes."
  },
  {
    "title": "Experimental",
    "content": "Na 2 S9H 2 O, 2-methylimidazole, Zn(NO 3 ) 3 6H 2 O, anhydrous C 2 H 5 OH, CH 3 OH and Pt(NH 3 ) 4 (NO 3 ) 2 were obtained from Sigma-Aldrich. For the synthesis of ZIF-8, both 1 mmol Zn(NO 3 ) 2 6H 2 O and 6 mmol 2-methylimidazole were put to 30 mL CH 3 OH during magnetic agitating to obtain a homogenous solution.The obtained mixture was maintained for 24 h.The wet powder was separated from the filtrate through centrifugation, followed by washing three times by C 2 H 5 OH and then dried overnight at 60 C to collect ZIF-8.The resulted ZIF-8 was heat-treated at 450 C for 3 h to obtain ZnO NPs.For the preparation of ZnSZnO heterostructure, both 1 mmol Zn (NO 3 ) 2 6H 2 O and 6 mmol 2-methylimidazole were put to 30 mL CH 3 OH during magnetic agitating to obtain homogenous suspension solution, then 0.04 mmol of Na 2 S9H 2 O to get 4 wt.ZnSZnO was put to the mixture with continuous agitating.The obtained solution was maintained for 24 h.The wet powder was separated from the filtrate through centrifugation, followed by washing three times by C 2 H 5 OH and then dried overnight at 60 C to get 4 wt.ZnSZIF-8.The obtained 4 wt.ZnSZIF-8 was heat treated for 3 h at 350 C to obtain porous ZnSZnO heterostructure. Photodepodition of Pt NPs on porous ZnSZnO heterostructure were constructed as follows: In typical, 1 g of porous ZnSZnO was added to C 2 H 5 OH (100 mL) through sonication for 5 min.After that, a required quantity of Pt(NH 3 ) 4 (NO 3 ) 2 was gradually put to the suspension solution through agitation for 24 h with subjecting to illumination by 300 W xenon.Then, the suspension was dried at 110 C overnight.The obtained power was calcinated at 300 C for 3 h to collect porous 0.3, 0.5, 1.0 and 1.2 wt PtZnS-ZnO heterostructures. X-ray diffraction was applied to estimate the crystalline structures of Pt/ZnSZnO heterostructures through Bruker axis D8 with Cu Ka radiation ( 1.540A ). JEOL-JEM-1230 was employed using TEM and HR-TEM to determine the morphologies of synthesized heterostructures.The emission photoluminescence (PL) spectra for all synthesized photocatalysts were explored using excitation source 150 W xenon lamp at 325 nm by RF-5301 fluorescence spectrophotometer applying (RF-5301 PC, Japan, SHIMADZU, 400 W, 50/60 Hz).X-ray photoelectron spectroscopy (XPS) of nanocomposite photocatalyst was carried out by Thermo Scientific K-ALPHA spectrometer.N 2 adsorption/desorption isotherm at 77 K for PtZnS-ZnO heterostructures was determined employing Nova 2000 series Chromatech apparatus.The electron spin resonance (ESR) were conducted employing 5,5-Dimethyl-1-pyrroline N-oxide (DMPO) as the trapping agent to investigate the O 2 A and OH radicals.5 mg photocatalysts were put in 10 mL H 2 O with dispersion by soncation for 5 min.Then 100 mL of the distributed solution were mixed 50 mL of DMPO.The ESR signals were obtained under UVAvis light for 4 min.The photocurrent intensity and electrochemical impedance spectra (EIS) were estimated in a three-electrode system by an electrochemical analyzer (CHI-660B, China).The photocatalyst film as working electrodes coated on ITO glass was utilized.The 500 W Xe was employed as a lamp light source at 420 nm cut off filter, and Na 2 SO 4 0.1 M as electrolyte solution was applied.UVAVis-DRS for PtZnS-ZnO heterostructures conducted at 200A800 nm utilizing V-570 spectrophotometer, Jasco, Japan. The reduction of CO 2 upon illumination through a 300 W Xe lamp employing a cut-off filter at 420 nm was carried out in a photoreactor system (200 mL) including a two-neck.1 g/L of the photocatalyst was distributed in 100 mL of H 2 O during magnetic at 80 C.Thus, 125 mg of Na 2 CO 3 was stepwise put to the suspension to be a CO 2 source.Before illumination, the distribution solution was pumped by N 2 gas for 30 min to remove soluble and adsorbed O 2 .The desired volume of 0.25 mL HCl (4 M) was introduced into the mixture to generate CO 2 .The distribution solution was maintained stirring for 60 min in the dark to obtain adsorption equilibrium.Then, the lamp was switched on during the photocatalysis reaction for 9 h illumination.To analyze the CH 3 OH formation during photoreduction of CO 2 , a Shimadzu gas chromatograph GC-FID with a flame ionization detector was employed.The standard GC spectrum of CH 3 OH 2.5 mM L A1 revealed a single peak at the retention time of 2.46 min.The CH 3 OH yield during photocatalysis reaction was determined within 9 h illumination and compared to the standard single peak of CH 3 OH.The photonic efficiency () was estimated the following equation as the ratio of the CH 3 OH formation rate and the light incident intensity 42. Where I the incident photon flux (1.11 10 A6 Ein L A1 s A1 ) and r the CH 3 OH formation rate (mol L A1 s A1 )."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Porous ZnSZnO nanocomposites were synthesized from Zn (NO 3 ) 2 and Na 2 S as the inorganic precursors and 2-methylimidazole as the zeolitic framework by a simple one-step process.Nanosized ZnO and ZnS NPs grow speedily in this solution.The synthesized porous ZnSZIF-8 nanohybrids were calcinated at 350 C to obtain porous ZnSZnO heterostructures.Pt NPs (0.3A1.2) have been photo-reduced onto porous ZnSZnO to prepare porous 0.3, 0.5, 1.0 and 1.2 PtZnS-ZnO heterostructures.The XRD patterns of ZIF-8, ZnSZIF-8 and Pt/ZnSZIF-8 at variation Pt contents were displayed in Fig. 1a.Fig. 1a exhibited a characteristics peaks at 2 values of 7.17,10.23,12.55, 14.56, 16.28, 17.88and 19.36(JCPDS 00A062A1030), which corresponded to the reflections planes of ZIF-8 (011), (002), ( 112), (022), (013), ( 222) and (123), respectively 43.While, with the introduction of ZnS and Pt/ZnS at variation Pt onto ZIF-8, the diffraction peaks are similar positions, and their intensities of ZIF-8 was slightly reduced with boosting Pt percentages from 0.3 to 1.2 (Fig. 1a).ZIF-8 and ZnSZIF-8 were calcinated at 350 C, the assigned peaks related to ZIF-8 were no longer existing as depicted in Fig. 1b.For pristine ZnO NPs synthesized from ZIF-8 upon calcination, XRD reflections peaks were located at 2 values of 31.76,34.44, 36.25,47.54, 56.58, 62.85, 66.35, 67.93and 69.08(JCPDS files 89A1397), (Fig. 1b), corresponding to the planes of hexagonal ZnO wurtzite structure (100), ( 022), ( 101), ( 102), ( 110), ( 103), ( 200), ( 112) and ( 201), respectively 43,44.It was obviously revealed that the XRD of pristine ZnO was excellent crystallinity and high purity.Fig. 1b of XRD of ZnSZnO and Pt/ZnSZnO at variation Pt contents indicated that the diffraction peaks of ZnO were presented only.With the boost of the Pt NPs percentages, the diffraction peak intensity of ZnO declined.These findings exhibited that ZIF-8 and ZnSZIF-8 were completely converted into pure ZnO NPs and ZnSZnO heterostructure. Fig. 2a revealed the N 2 adsorption-desorption isotherms of ZnO, ZnSZnO and 1 Pt/ZnSZnO heterostructure.The adsorption isotherms for the samples indicated a typical type IV plot distinguishing mesoporous materials 45.The obtained isotherms demonstrated a hysteresis loop of Type H3, which is presented by aggregating spherical-like particles.45,46; the narrow hysteresis loop is produced as a consequence of inter-particle capillary condensation; it is observed that ZnSZnO heterostructure exhibited the increment in the volume of N 2 adsorbed with the increase of P/Po owing to the formation of porous ZnSZnO heterostructure in accordance with ZnO NPs.The surface area and pore volume of the ZnO NPs was 1718 m 2 g A1 and 0.057 cm 3 /g, they slightly reduced to 1698 m 2 g A1 and 0.055 cm 3 /g when the ZnSZnO heterostructure was constructed (Table 1).The surface area and pore volume measurements for the 0.3, 0.5, 1 and 1.2 Pt/ZnSZnO heterostructures were 1637, 1596, 1530 and 1504 m 2 g A1 , and 0.052, 0.049, 0.048 and 0.047 cm 3 /g, respectively.The pore size distributions of the samples were revealed that the pores are estimated at 4.1 0.05 nm for all samples, as clearly observed in Fig. 2b.The elevated surface area promotes the contact through the photocatalyst and the reactants in an aqueous solution, which gives more active sites to generate CH 3 OH.The enhancement of the surface area of Pt/ZnSZnO heterostructures, as clearly seen in the present work, is referred to as the construction of a new porous structure during pyrolysis of ZnSZIF-8. The morphology of ZIF-8 nanocrystals, ZnSZIF-8, and Pt/ ZnSZIF-8 nanohybrids were investigated through FE-SEM, and the findings are demonstrated in Fig. 3a,bc.SEM of ZIF-8 exhibited a dodecahedral structure, as obviously displayed in Fig. 3a 47.Fig. 3bc illustrated the SEM image of ZnSZIF-8 and Pt/ZnSZIF-8 nanohybrids; the dodecahedral morphology was slightly changed after incorporation of ZnS and Pt NPs onto ZIF-8.The morphologies of ZIF-8 and ZnSZnO with and without Pt NPs were examined by TEM and HR-TEM images as displayed in Figs.3d-i.TEM of ZIF-8 evidenced the formation of dodecahedral morphology as observed in Fig. 3d.TEM of Pt/ZnSZIF-8 showed a dodecahedral morphology decorated with Pt NPs as demonstrated in Fig. 3e and Pt NPs are well dispersed in ZnSZIF-8.Fig. 3f of ZnO exhibited spherical-like with the size of about 50A100 nm.TEM image of Pt/ZnSZnO heterostructure showed the constructed particle uniformly disturbuted in shape and size of about 50A100 nm (Fig. 3f).The HR-TEM of Pt/ZnSZnO displayed a typical ZnS and ZnO NPs (Fig. 3h,i), the lattice distances of 0.24 and 0.31 nm can be indexed to the (101) and (111) planes of ZnO and ZnS, in that order (Fig. 3h) 41.In the case of Pt/ZnSZnO sample, HR-TEM displayed the same lattice fringes of ZnSZnO, as well as lattice distance of Pt was determined to about 0.22 nm, matching to the (111) plane.HR-TEM image and the SAED, inset of Fig. 3h,i) exhibited well-resolved lattice planes, which corresponded well with the (101) and (111) planes for ZnO and ZnS crystals and the diffraction cycles are characteristic of a highly crystalline ZnS and ZnO.In addition, HR-TEM indicated that ZnO/ZnS exhibited a heterojunction interface through ZnS and ZnO NPs, indicating the enhancement of electron transfer and promoting photocatalytic performance.The synthesized photocatalyst heterostructure as an effective photocatalyst, a considerable separation of charge-carrier has become significant in photocatalytic reactions for CO 2 reduction. XPS spectra of Zn 2p, O 1 s, S 2p, and Pt 4f of 1 Pt/ZnSZnO heterostructure were detected to obtain its bonding and chemical environments (Fig. 4).Fig. 4a revealed the characteristic peaks were located the BEs at 71.12 and 74.41 eV in the Pt 4f spectrum coinciding to Pt 4f 7/2 and Pt 4f 5/2 of Pt 0 state (Fig. 4a), respectively 48.Fig. 4b showed the binding energy (BE) of Zn 2p core-level, the two peaks determined at 1021.90 and 1044.90 eV were corresponded to Zn 2p 3/ 2 and Zn 2p 1/2 , in that order, with a distinctive splitting of spin-orbit doublet of 23 eV, which is distinguishing of the Zn 2 state.Fig. 4c shows high-resolution spectrum S 2p was observed at 161.84 eV.The S 2p peak was fitted into S 2p 3/2, and S 2p 1/2 appeared at 161.84 and 163.03 eV, in that order.The BE at 161.84 eV is related to S 2A in the construction of the ZnS.While the BE at 163.03 eV might be attributed to S-S species surface defects in the ZnS structure as reported in ZnS nanorods 49.Fig. 4d exhibited the core-level O 1 s spectrum, and the O 1 s peak was deconvoluted into two peaks located at 530.17 eV and 531.59 eV.The peak assigned at 530.17 eV corresponded to the O 2-lattice to Zn 2, indicating the construction of ZnO.In comparison, the second peak that appeared at 531.59 eV was related to OH group form and the oxygen in the adsorbed water onto the ZnSZnO surface 50.The atomic oercentages of Zn, Pt, S and O elements were determined about 78.25, 0.97, 1.3 and 18.88.These compositions are corresponded to the intial precursors to synthesize Pt/ZnSZnO. UVAVis diffuse reflectance spectroscopy of Pt/ZnS-ZnO heterostructures at Pt variations contents samples an accordance with pristine ZnO NPs and ZnSZnO (Fig. 5a) indicated that the absorption band edge for ZnO NPs and ZnSZnO was determined about 378 and 396 nm.It was not found absorption in the visible light for both ZnO NPs and ZnSZnO due to their large bandgap values.And the Pt NPs incorporation creates the absorption boosting at higher at the visible region, as determined from the absorption tangent of 418.9, 500, and 575 nm for 0.3, 0.5, 1 and 1.2 Pt/ZnSZnO heterostructures, respectively.It could be observed that boosts in Pt percentages leading to an improved absorbance in the Pt/ZnSZnO heterostructures.The calculated bandgap values of the synthesized photocatalysts by Kubelka-Munk process photon energy (hv) vs (F(R)hv 2 ) were estimated as depicted in Fig. 5b.The results indicated that the bandgap values could be determined at the range of 2.11A2.89eV for the Pt/ Fig. 2. (a) N 2 adsorption/desorption isotherms of the of ZnO, ZnSZnO and 1Pt/ ZnSZnO heterostructures; (b) Barrett-Joyner-Halenda (BJH) pore-size distribution plots of the ZnO, ZnSZnO and 1Pt/ZnSZnO nanocomposites. Textural properties of pristine ZnO, ZnSZnO heterostructure and Pt/ZnSZnO heterostructures at variation Pt contents and their CH 3 OH formation rate.The column 1 here is correct, however column 1 in the pdf version is not correct.Could you please correct the S BET Surface area, r Methanol formation rate, and Vp pore volume, z the photonic efficiency. ZnSZnO heterostructures at Pt variations contents compared to 3.21 and 3.11 eV for pristine ZnO NPs and ZnSZnO heterostructure (Table 1).It is obviously observed that the narrow bandgap energy of the Pt/ZnSZnO heterostructures can be explained by an enhanced electronic property of the samples as a consequence of the interaction through the Pt NPs and ZnSZnO heterostructure. The present work demonstrated that the Pt/ZnSZnO heterostructures are promising photocatalysts compared to pristine ZnO NPs and ZnSZnO heterostructure for CO 2 conversion through visible-light illumination to produce CH 3 OH in aqueous solution at mild condition.Therefore, the photocatalytic performance of Pt/ZnSZnO heterostructures has been carried out for the CO 2 reduction to form CH 3 OH.The experiment's findings of photocatalytic reduction were depicted in Fig. 6a.The control experiment without photocatalyst and without illumination in the dark was conducted for CO 2 reduction.We observed that no products were detected, such as CH 3 OH through 3 h illumination, evidencing no CO 2 reduction without either illumination or photocatalyst.Upon illumination during photocatalysis reaction for 9 h, it is figured out that CH 3 OH is the main product of CO 2 conversion through visible light.The CH 3 OH yield was fostered linearlt during 9 h illumination, and the photocatalysis reaction was stopped in the dark, elucidating that the CH 3 OH yield was formed through CO 2 photoconversion.HCOOH, H 2 , and CH 4 might be formed partially with a little concentration to be observed.In the present process, the dissolved and adsorbed CO 2 and carbonates species have become much more efficacious to expedite the CH 3 OH formation 51.The CH 3 OH yield can be determined over pristine ZnO and ZnSZnO heterostructure to be 126 and 127.8 mmol g A1 after 9 h illumination.The CH 3 OH yield over ZnSZnO heterostructure was Fig. 3. FE-SEM of pure ZIF-8 nanocrystals (a), ZnSZIF-8 (b), Pt/ZnSZIF-8 (c), TEM images of pure ZIF-8 nanocrystals (d), Pt/ZnSZIF-8(e), pure ZnO NPs (f), Pt/ZnSZnO (g), HR-TEM image of ZnSZnO heterostructure (h) Pt/ZnSZnO heterostructure (i). enhanced to 801, 1202, 1402, and 1421 mmol g A1 over 0.3, 0.5, 1 and 1.2 Pt/ZnSZnO heterostructures, respectively.The trend of photocatalytic CO 2 reduction performance is followed by 1.2Pt/ 1Pt/ 0.5Pt/ 0.3Pt-/ZnSZnO ZnSZnO ZnO.The photonic efficiency () of pristine ZnO and ZnSZnO and Pt/ ZnSZnO heterostructures was calculated as given in Table 1.The obtained findings revealed that the of pristine ZnO and ZnSZnO are calculated about 0.326 and 0.330, which gradually increased with introduction of Pt NPs to obtain the highest value of 3.89 for 1Pt/ ZnSZnO heterostructure.Interestingly, value 1Pt/ ZnSZnO heterostructure was enhanced 11.9 times larger than pristine ZnO NP and ZnSZnO.The highest CH 3 OH yield of 1402 mmol g A1 after 9 h illumination is observed over 1Pt/ZnSZnO heterostructure, which was enhanced 11.2-and 10.97-time larger than pristine ZnO and ZnSZnO.Fig. 6b and Table 1 summarized the CH 3 OH formation rate for all the synthesized photocatalysts.The most photoactive photocatalyst, 1Pt/ ZnSZnO, revealed a CH 3 OH formation rate of 155.64 mmolg A1 h A1 ; while CH 3 OH formation rate of ZnO and ZnSZnO were assessed to be 13.02 and 13.20 mmolg A1 h A1 , respectively (Fig. 6b).The CH 3 OH formation rate over 1Pt/ZnSZnO heterostructure was promoted 12 times greater than pristine ZnO and ZnSZnO.So, the high reduction efficiency of 1Pt/ZnSZnO photocatalyst is ascribed to the heterojunction fabricated between ZnS and ZnO, as displayed by HR-TEM (Fig. 3h,i), which promotes an enhancement in the separation of the photoinduced carriers.This behavior revealed that the 1Pt/ ZnSZnO sample is the optimal photocatalyst to boost the separation of photoinduced carriers and promote an enhancement on the CH 3 OH yield; subsequently, the carrier separation facilitates to prevent the recombination of a hole -electron 52.The photocatalytic performance results indicated that an optimal Pt NPs content at the ZnSZnO heterostructure interfaces is accountable for improving the CH 3 OH formation.Thus, it is supposed that the carriers separation in Pt/ZnSZnO photocatalyst might be attributed to a mean important objective in the enhancement photocatalytic activity.The photocatalytic performance could be promoted greatly once an adequate heterojunction through ZnS and ZnO can be constructed in a photocatalytic system owing to effective charge carriers separation 53,54. To explore the optimum loading amount, the loading photocatalyst of the 1Pt/ZnSZnO was demonstrated.The photocatalytic experiment for CO 2 reduction was performed by aletring the dosing amount from 0.6A3 g/L.The CH 3 OH yield of over the 1Pt/ZnSZnO heterostructure was displayed in Fig. 6c at variations dosing amount from 0.6 to 3 g/L.The findings indicated that the CH 3 OH formation was enhanced from 981.4 to 1823 mmol g A1 with boosting the dosing from 0.6 to 2.4 g/L.These findings were assumedly owing to an increase in the numerous ZnSZnO particles and thus increase the reactive sites for much of photons absorbed and adsorbed CO 2 , which promoted the obtained number of radical species.With the boost of the dosing amount of more than 2.4 g/L, CH 3 OH formation was reduced to reach 1645 mmol g A1 .Therefore, the optimal loading amount to obtain the highest CH 3 OH yield has amounted to 2.4 g/L.This behavior might be referred to as the Pt/ZnSZnO agglomerations, leading to an increment in turbidity and light scattering to decrease the active site number and the illumination passage.Besides, at high content of loading amount, it was sophisticated to keep the homogenous mixture owing to the agglomeration of Pt/ ZnSZnO particles, which minimized the active sites number.Fig. 6d displayed GCAMS spectra for photoconversion of CO 2 to yield CH 3 OH generation over 1Pt/ZnSZnO during illumination by visible-light for 9 h.The results indicated that CH 3 OH formation was recorded however HCOOH, and HCHO might be obtained as a consquence of partially oxidation of CH 3 OH, but in quantities too low to be recorded.Shioya et al. 55 observed a larger selectivity for CH 3 OH production over TiO 2 -containing mesoporous catalysts can be referred to high quantity of OH radical, suggesting an unique selectivity for CH 3 OH production. In addition, the durability and stability of 1Pt/ZnSZnO for the photoconversion of CO 2 are essential parameters for potential applications.The reused of 1Pt/ZnSZnO for five runs within 45 h was performed to carry out CO 2 photoreduction to CH 3 OH yield, as manifested in Fig. 6d.The findings showed that it is found no clear loss within 45 h illumination in the CH 3 OH formation.Many synthesized photocatalysts preserved their photoreduction performance within 30 h during a recycling test, and then the reduction performance is extremely declined 56,57; however, in this work, the experiment of CO 2 photoreduction was conducted for five reuses within 45 h.The CO 2 reduction performance was preserved at about 97.64.The XRD pattern of reused 1Pt/ZnSZnO heterostructure was evaluated (Supporting information Figure S1), which kept the crystallinity of 1Pt/ZnSZnO, implying that Pt/ZnSZnO confirmed good stability without change in crystallinity and reducibility.In general, this finding exhibited that the construction heterojunctions of Pt/ZnSZnO heterostructure conserved ZnO against photocorrosion. To discuss the excellence of charge separation, the photocurrent intensities of pristine ZnO, and Pt/ZnSZnO photocatalysts at Pt variations percentages were measured.When the illumination is switched on, all the photocatalysts revealed a fast photocurrent intensity, suggesting a speedy creation of photoinduced electrons (Fig. 7a) 58,59.It could be figured out that the photocurrent response of pristine ZnO (8 mA/cm 2 ) was low, which might be ascribed to the prompt of a hole -electron recombination.The photocurrent responses of ZnSZnO heterostructure (9.16 mA/cm 2 ) were larger than of pristine ZnO, evidencing that the constructed heterojunction could be suppressed the recombination of carriers.And the Pt NPs incorporation onto ZnSZnO heterostructure revealed the photocurrent responses boosting with the increase of Pt NPs content to reach 13.5, 15.4, 16.8, and 17 mA/cm 2 for 0.3, 0.5, 1 and 1.2 Pt/ ZnSZnO.The 1 Pt/ZnSZnO heterostructure revealed the highest photocurrent intensity of about 16.8 mA/cm 2 , which enhanced 2.1 and 1.85 fold that of pristine ZnO and ZnSZnO.To explain the interfacial charge transformation characteristic, EIS of pristine ZnO, ZnSZnO and Pt/ZnSZnO samples at Pt variations contents samples were conducted.It was reported that the radius of arc for all samples was comparative to the electrode/electrolyte interface resistance 60,61.Fig. 7b revealed that 1 and 1.2Pt/ZnSZnO heterostructures indicated a smaller radius than either pristine ZnO or ZnSZnO heterostructure suggesting its weak resistance of charge-transfer 62,63.Therefore, holes-electrons in the Pt/ZnSZnO heterostructure can be effectively transported to its redox reaction, and a surface existed and confirmed its high efficiency of photoinduced carriers separation 52,64, which is explained by its numerous integrating interface between ZnS and ZnO NPs resulting from the construction of ZnSZnO.The findings indicated that 1Pt/ZnSZnO sample presented the smallest resistance and the maximum photocurrent intensity compared to those of other samples, which was completely compatible with their CO 2 reduction performance ability.Photoluminescence (PL) spectra for all samples were performed during excitation of 325 nm to determine the recombination /separation rates of photoinduced carriers (Fig. 7c).The findings indicated that there is one mean peak assigned at 421 nm for pristine ZnO.In addition, PL intensity of ZnSZnO was decreased moderatly; however, with Pt NPs incorporated ZnSZnO heterostructures, The PL intensity was gradually reduced; suggesting the effective prohibition of the recombination of a hole-electron 65, however, the lowest PL intensity can expedite the heterogeneous photocatalysis as a consequence of low recombination rate.It observed that PL intensity of both 1 and 1.2Pt/ZnSZnO heterostructures exhibited the lowest ones.These results are in agreement with photocatalytic reactions.In general, the superior CO 2 reduction over Pt/ZnSZnO heterostructure could be imputed to i) the construction of heterojunction through ZnS and ZnO, which enhanced the charge carriers-migration process and promoted the charge carriers lifetime 66; ii) the different energy levels through ZnS and ZnO led the high oxidative ability of the adsorbed OH surface and hence facilitates the catch of photoinduced holes 66,67. The investigation of oxygen active species is functional route to explore the amount and species of photoinduced charge carriers.in VB to oxidize OH A /H 2 O to OH.Subsequently, the photoproduced electrons in the CB of ZnO recombined with the holes in the VB of ZnS through S-scheme mechanism 67.The signal intensity is comparative with the magnitude of OH and O 2 A radicals 75, a considerable carriers can be created over ZnSZnO heterstructure.Hence, ZnSZnO heterstructure can create higher quantity of electrons and holes under visible light in the photocatalytic reaction.Clearly, the ZnSZnO heterstructure exhibited the strong ZnO oxidation ability and the intense ZnS reduction potential, where the holes on the VB of ZnO oxidize OH A /H 2 O to OH, and the electrons on the CB of ZnS reduce O 2 to O 2 , suggesting that the S-scheme charge transfer was constructed heterostructure of ZnS and ZnO. According on the above results, and experiments on CO 2 photoconversion to form CH 3 OH during illumination, S-scheme mechanism over Pt/ZnSZnO heterostructure for can be demonstrated in Scheme 1 67,76,77.The Pt/ZnSZnO heterostructure with the constructed heterojunction and the interface contact among Pt, ZnS and ZnO improved the effective separation and transportation of charge carriers, while Pt NPs was utilized as a cocatalyst.The CB level of ZnS is widely negative than the CB of ZnO, while the VB of ZnO level is widely positive than the VB of ZnS 78.Upon the light switched on, the electrons are induced to the CB of ZnO and ZnS, and the holes are quitted in the VB of ZnO and ZnS.The photoinduced electrons in the CB of ZnS migrate to Pt NPs as a sink for participating in the CO 2 Simultaneously, the photoinduced electrons in the CB of ZnO recombine with the holes in the VB of ZnS.The chemical species produced in the redox reactions have the ability to easily interchangeable the porous in nature of ZnSZnO heterostructure.Table 2 summarized the comparison of photoconversion of CO 2 performance over Pt/ ZnSZnO heterostructures with other photocatalysts reported in the literature 79A85."
  },
  {
    "title": "Conclusions",
    "content": "In summary, a novel synthesis of porous ZnSZnO heterostructures was achieved for photoconversion of CO 2 to form CH 3 OH through illumination by visible light.Porous ZnSZnO heterostructures, with improved photocatalytic performance, was constructed from a ZIF-8 precursor through Zn(NO 3 ) 2 and Na 2 S as Zinc and sulfur ions precursors and 2-methylimidazole as the zeolitic framework.Pt NPs (0.3A1.2) have been photo-reduced onto porous ZnSZnO heterostructure.The photocatalytic performance Pt/ZnSZnO heterostructure has been enhanced compared to that ZnO and ZnSZnO heterostructure, as the absorption edges of ZnSZnO heterostructure were extended into the red shifted after incorporating Pt NPs.The trend of CO 2 reduction performance is followed by 1.2Pt/ 1Pt/ 0.5Pt/ 0.3Pt-/ZnSZnO ZnSZnO ZnO.The maximum CH 3 OH formation of 1402 mmol g A1 after 9 h illumination was achieved over 1Pt/ZnSZnO heterostructure, which was enhanced 11.2-and 10.97-time larger than pristine ZnO NPs and ZnSZnO.Furthermore, Pt/ZnSZnO heterostructure indicated significant photocatalytic durability and stability within five cycles and its photocatalytic performance was extremely preserved at 97.64.1 Pt/ZnSZnO heterostructure was the most efficient, and presented a CH 3 OH formation of 1421 mmol g A1 , compared to pristine ZnO and ZnSZnO of 126 and 127.8 mmol g A1 after 9 h illumination, respectively.The superior CO 2 reduction over Pt/ZnSZnO could be imputed to i) the construction of heterojunction between ZnS and ZnO, which enhanced the charge carriers-migration process and promoted the charge carriers lifetime; ii) the different energy levels between ZnS and ZnO led the high oxidative ability of the adsorbed OH surface and hence facilitates the catch of photoinduced holes.The superiority characteristics of Pt/ZnSZnO heterostructure make it plausible to be utilized for potential applications. Fig. 1.(a) XRD patterns of ZIF-8, ZnSZIF-8 and Pt/ZnSZIF-8 heterostructures at variations Pt contents; (b) XRD patterns of porous ZnO NPs, ZnSZnO and Pt/ZnSZnO heterostructures at variations Pt contents. Fig. 4. High resolution of XPS of the mesoporous 1.5 Pt/ZnS-ZnO heterstructure showed the presence of Pt, Zn, S, and O; High-resolution scans of Pt 4f (a), Zn 2p(b), S 2p (c), and O 1 s (d). Fig. 5. (a) Diffuse reflectance spectra of pristine ZnO, and ZnSZnO heterostructure and Pt/ZnS-ZnO heterostructures at Pt variations contents samples; (b) Plot of transferred Kubelka-Munk versus energy of the light absorbed for pristine ZnO NPs, and ZnSZnO and Pt/ZnS-ZnO heterostructures at Pt variations contents samples. Fig. 6.(a) Time courses for CO 2 photoconversion into CH 3 OH over ZnO, and ZnSZnO and Pt/ZnS-ZnO heterostructures at Pt variations contents; (b) Formation rate of CH 3 OH over ZnO, and ZnSZnO and Pt/ZnS-ZnO heterostructures at Pt variations contents; (c) Effect of loading amount of 1Pt/ZnS-ZnO heterostructure on the CO 2 photoconversion; (d) GC spectra for CO 2 photoconversion over 1Pt/ZnSZnO upon visible-light illumination for 9 h; (e) Time courses for recyclability of the CO 2 photoconversion for five times over 1Pt/ ZnS-ZnO heterostructure. Fig. 7. (a) Photoluminescence (PL) spectra of ZnO, and ZnSZnO and Pt/ZnS-ZnO heterostructures at Pt variations contents; (b) transient photocurrent of ZnO, and ZnSZnO and Pt/ZnS-ZnO heterostructures at Pt variations contents; (c) Nyquist plots measured at an applied potential of 0.1 V vs. Ag/AgCl during illumination for ZnO, and ZnSZnO and Pt/ZnS-ZnO heterostructures at Pt variations contents. Fig. 8. ESR signals for DMPO-OH (a) and DMPO-O 2 A (b) over ZnS, ZnO, and ZnSZnO heterostructure under UVAvis light illumination for 4 min. Table 1 in the pdf version to be similar this version. Comparison of photoconversion of CO 2 performance over Pt/ ZnSZnO heterostructures with other photocatalysts reported in the literature.ZnFe 2 O 4 /TiO 2 CeO2-N-G-Cu 2 Cu 2 O-TiO 2 -K 2 Ti 4 O 9 1 NiO-InTaO 4 1 NiO-InVO 4 Na 2 S, Na 2 SO 3 , KOH in H 2 O NaHCO 3 , Na 2 SO 3 in H 2 O Na 2 SO 4 in H 2 O KHCO 3 in H 2 O KHCO 3 in H 2 O NaHCO 3 and H 2 SO 4 in H 2 O KHCO 3 in H 2 O Na 2 CO 3 Scheme 1. Schematic suggested S-scheme mechanism over Pt/ZnSZnO heterostructures for CO 2 conversion to CH 3 OH. R.M. Mohamed et al. / Journal of the Taiwan Institute of Chemical Engineers 127 (2021) 208A219 R.M. Mohamed et al. / Journal of the Taiwan Institute of Chemical Engineers 127 (2021) 208A219 This research was funded by Institutional Fund Projects under grant no.(IFPRC-020A130A2020). Therefore, the authors gratefully acknowledge technical and financial support from the Ministry of Education and King Abdulaziz University, DSR, Jeddah, Saudi Arabia. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary material associated with this article can be found, in the online version, at doi:10.1016/j.jtice.2021.08.017."
  }
]