[
  {
    "title": "Doi",
    "content": "10.1016/j.apcatb.2017.04.028"
  },
  {
    "title": "Article_Title",
    "content": "Effect of core@shell (Au@Ag) nanostructure on surface plasmon-induced photocatalytic activity under visible light irradiation"
  },
  {
    "title": "Abstract",
    "content": "We prepared Au-Ag nanoparticles (NPs) with two different morphologies over SrTiO 3 to investigate the effect of composite nanostructure on surface plasmon-induced photocatalytic activity; coreshell (AuAg) NPs were synthesized by a multi-step citric reduction method, and Au-Ag bimetallic NPs were prepared by a photo-reduction method.(AuAg)/SrTiO 3 and Au-Ag/SrTiO 3 showed strong photoabsorption in the visible light response due to a localized surface plasmon resonance (LSPR) of Ag.Moreover, they could oxidize 2-propanol to acetone and CO 2 under visible light irradiation (440 800 nm).From a comparison of action spectra for acetone evolution and the Kubelka-Munk function, it was confirmed that photocatalytic activities of (AuAg)/SrTiO 3 and Au-Ag/SrTiO 3 were induced by photoabsorption based on LSPR excitation of Ag.Interestingly, the rate of acetone evolution over (AuAg)/SrTiO 3 was 1.5-times higher than that of over Au-Ag/SrTiO 3 , suggesting that the coreshell (AuAg) nanostructure contributes to the efficient surface plasmon-induced photocatalytic activity."
  },
  {
    "title": "Experimental",
    "content": "2.1.Synthesis of coreshell (AuAg) NPs (AuAg) NPs were synthesized by a multistep citrate reduction method as follows 23.Au NPs were prepared for use as seeds for the synthesis of (AuAg) NPs.Hydrogen tetrachloroaurate (III) tetrahydrate (99.0,Wako), trisodium citrate (99.0,Wako) and polyvinylpyrrolidone ((C 6 H 9 NO) n ; n 27 32, Wako) as starting reagents were mixed thoroughly in distilled water at 70 C. The mixed solution was stirred for 1 h and cooled to room temperature.The obtained suspension of Au NPs was a dark reddish color with an LSPR band at 522 nm, and average diameter of the Au NPs was 9 nm.The Ag shell was grown on the Au seeds via seed-mediated growth for (coreshell) AuAg NPs.The obtained suspension of Au NPs was heated to reflux and then silver nitrate (99.5, Wako) and trisodium citrate were simultaneously added.After refluxing for 35 min, (AuAg) NPs were obtained. 2.2.Loading of (AuAg) NPs on SrTiO 3 (AuAg) NPs were supported on SrTiO 3 (purchased from Wako) by an impregnation method.The impregnation supporting was carried out by the following procedures.The SrTiO 3 powder and colloidal (AuAg) NPs were put into an eggplant-shaped flask.The mixed solution was dispersed by sonication for 5 min and then dried by using a rotary evaporator on a water bath.After evaporation, the residue was washed with distilled water several times.The residual water was completely removed by using a vacuum freezedrying method.The amount of (AuAg) NPs was estimated by ICP-AES analysis and it was confirmed that 1.0 wt (AuAg)/SrTiO 3 . Au-Ag bimetallic NPs were loaded on SrTiO 3 by a photoreduction method as described in a previous report 26.First, 0.4 g SrTiO 3 powder was dispersed in distilled water (10 mL) contained methanol (10 mL).Then, 0.03 M hydrogen tetrachloroaurate (III) tetrahydrate added to the mixed solution after Ar bubbling for 30 min, and the mixed solution was irradiated with UV light was irradiated.Then, 0.05 M silver nitrate was added, and the mixed solution was irradiated with UV light was irradiated.After this process had been repeated for a maximum of 4 times, 1.0 wt bimetallic Au-Ag NPs were formed on the SrTiO 3 nanoparticles. The crystalline phase of SrTiO 3 was characterized by using a powder X-ray diffraction (XRD) instrument (MiniFlex II, Rigaku Co.).The structure of (AuAg) NPs was characterized by using a field emission high-resolution transmission electron microscope (HR-TEM; Tecnai G2 F30 S-TWIN, FEI) with a high-angle annular dark-field (STEM-HAADF) detector and by energy-dispersive X-ray spectroscopy (EDS) elemental mapping.The amount of (AuAg) NPs loaded on SrTiO 3 was evaluated by inductively coupled plasma atomic emission spectroscopy (ICP-AES).A diffuse reflectance spectrum was acquired at room temperature with a UV-vis spectrometer (UV-2600, Shimadzu Co.) attached to an integral sphere.X-ray photoelectron spectroscopy (XPS) measurements were performed using a Kratos AXIS Nova spectrometer (Shimazu Co.) with a monochromatic Al K X-ray source.The binding energy was calibrated by taking the carbon (C) 1 s peak of contaminant carbon as a reference at 284.6 eV. Photocatalytic activity of (AuAg)/SrTiO 3 was evaluated by photocatalytic decomposition of 2-propanol.Sample powder (0.22 mg) was spread on a glass dish (4.0 cm 2 ) and placed in a Tedlar bag with a volume of 125 cm 3 .The 500 ppm of gaseous 2-propanol was injected into the Tedlar bag, where gaseous composition was 79 N 2 , 21 O 2 , 0.1 ppm of CO 2 and 500 ppm of 2-propanol.After 2propanol had reached an absorption equilibrium, the sample was irradiated with visible light at room temperature.A xenon lamp was used as a light source, and the irradiation wavelength was controlled by using a Yellow-44 filter and a heat absorbing filter (440 800 nm).The intensity of light was adjusted to 50 mW/cm 2 .The concentrations of 2-propanol, acetone and CO 2 were estimated by gas chromatography (Agilent/Inficon 3000 Micro GC) with a PLOT U column and an OV-1 column.Apparent quantum efficiency (AQE) at each wavelength was calculated from the ratio of the amount of acetone and the amount of incident photons.AQE was measured by using a Xe lamp equipped with a band-pass filter centered at 400 nm, 450 nm, 470 nm, 500 nm, 550 nm and 600 nm, respectively (All band-pass filters were purchased from Asahi Spectra Co., Ltd., and full width at half maximum was 10 nm)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "Fig. 1a andb shows a TEM photograph and distribution of colloidal (AuAg) NPs, revealing that (AuAg) NPs have an average particle size of 15 nm within a relatively sharp distribution.Fig. 1c shows STEM-HAADF images of colloidal (AuAg) NPs.Since the intensity (brightness) is approximately proportional to the square of the atomic number (Z 2 ) in a STEM-HAADF image, heavier Au atoms (atomic number: Z 79) give rise to a brighter image than do lighter Ag atoms (Z 47).As shown in Fig. 1d-f, EDS elemental mapping revealed that the A-u core is uniformly covered by the Ag shell.These results indicated that (AuAg) NPs could be synthesized by a multistep citrate reduction method. Fig. 2a-f shows a STEM-HAADF image of Au-Ag/SrTiO 3 and EDS elemental mapping images.Although data acquisition with high resolution was difficult due to sample drift, STEM-HAADF and EDS images indicated that the Au L edge and Ag L edge were located at same position over the SrTiO 3 particle.These results suggested that Au-Ag bimetallic NPs could be formed on SrTiO 3 particles by the photo-reduction method. Fig. 3 shows TEM photographs of 1.0 wt (AuAg)/SrTiO 3 and 1.0 wt Au-Ag/SrTiO 3 together with that of 0.2 wt Au/SrTiO 3 .As shown in Fig. 3a andb, there was no notable difference in particle size (ca.15 nm) or shape of coreshell (AuAg) NPs and Au-Ag bimetallic NPs.The amount ratio of Au to Ag was estimated by ICP-AES analysis and it was confirmed that 1.0 wt (AuAg)/SrTiO 3 and 1.0 wt Au-Ag/SrTiO 3 consisted of Au: Ag 1: 3.8 4.0 and Au: Ag 1: 4.0, respectively.Fig. 3d shows diffuse reflection spectra of 1.0 wt (AuAg)/SrTiO 3 , 1.0 wt Au-Ag/SrTiO 3 , 0.2 wt Au/SrTiO 3 and bare SrTiO 3 .Bare SrTiO 3 showed only strong photoabsorption at 380 nm, which was ascribed to the band-gap excitation.For the 0.2 wt Au/SrTiO 3 , an additional absorption peak was observed at around 530 nm.The photoabsorption spectrum of Au NPs was generally observed at around 560 nm due to its LSPR excitation 30.Kowalska et al. reported that photoabsorption of Au NPs loaded on rutile TiO 2 was observed at around 550 nm due to their LSPR excitation 19.Therefore, photoabsorption observed in 0.2 wt Au/SrTiO 3 was attributed to LSPR excitation of the loaded Au NPs.On the other hand, the LSPR excitation band of Au NPs could not be detected in the (AuAg)/SrTiO 3 and Au-Ag/SrTiO 3 .The 1.0 wt (AuAg)/SrTiO 3 and 1.0 wt Au-Ag/SrTiO 3 showed similar absorption spectra in the visible light range with peaks located at 463 nm and 465 nm, respectively.These spectra were considered to be due to localized surface plasmon resonance (LSPR) excitation of Ag 23.One of the reasons for the appearance of a monomodal LSPR band corresponding to Ag is that the Au cores are uniformly covered by Ag shells in the (AuAg) NPs and the optical contri-bution from the Au cores is completely screened 31.Another reason is that the amount ratio of Au to Ag is small, thereby the photoabsorption of Au was buried under that of Ag.Indeed, photoabsorption of 0.2 wt Au/SrTiO 3 was weak compared to that of 1.0 wt (AuAg)/SrTiO 3 and 1.0 wt Au-Ag/SrTiO 3 .Therefore, we consider that a relatively strong photoabsorption at longer wavelength observed in the (AuAg)/SrTiO 3 was ascribed to a variation of particle size of the (AuAg) NPs. Photocatalytic activity was evaluated by oxidation of 2-propanol in gas phase.Fig. 4a andb shows time courses of acetone and CO 2 evolution from decomposition of 2-propanol over 1.0 wt (AuAg)/SrTiO 3 , 1.0 wt Au-Ag/SrTiO 3 and SrTiO 3 under visible light irradiation (440 800 nm).Acetone evolution increased The dependence of light intensity on acetone evolution rates over 1.0 wt (AuAg)/SrTiO3.almost linearly with irradiation time up to 6 h, followed by gradual saturation with irradiation time due to accumulation of acetone on the surface of (AuAg)/SrTiO 3 .After prolonged visible light irradiation, the acetone was finally decomposed into CO 2 .This behavior is plausible as it is known that 2-propanol decomposes into CO 2 , which is the final product, via acetone, the intermediary product 323334.It should be noted that acetone and CO 2 were not detected either under dark conditions or under visible light irradiation in the absence of (AuAg)/SrTiO 3 and Au-Ag/SrTiO 3 . In general, surface plasmon-induced photocatalytic reaction can be understood on the basis of the electron injection model: (1) incident photons are absorbed by the metallic NPs through their LSPR excitation, (2) electrons in the metallic NPs are injected into the bulk of the semiconductor photocatalyst, and (3) the resultant electron-deficient metallic NPs can oxidize various organic compounds to be recovered to the original metallic NPs state.Indeed, we have revealed that electron injection occurred from LSPR-excited metallic NPs into the TiO 2 bulk under visible light irradiation 23.Thus, surface plasmon-induced photocatalytic activity is triggered by photoabsorption of metallic NPs, and metallic NPs greatly contribute to the photocatalytic activity.Indeed, the photocatalytic activity of 1.0 wt (AuAg)/SrTiO 3 was strongly depended on the light intensity (see Fig. 5a andb); acetone evolution rate was linearly increased with an increase of intensity of visible light (440 800 nm).These results suggested that photocatalytic activity observed in (AuAg)/SrTiO 3 was triggered by photocatalytic oxidation over (AuAg) NPs, or thermal effect associated with photo-absorption of strong incident light. An action spectrum is a strong tool for determining whether a photocatalytic reaction observed in samples occurs via photoab-Fig.7. Time courses of acetone evolution from 2-propanol decomposition over 1.0 wt (AuAg)/SrTiO3 (solid circle) and 1.0 wt Au-Ag/SrTiO3 (solid square) under visible light irradiation (440 800 nm, intensity 50 mW/cm 2 ) measured up to 3 cycles.After 10 h and 20 h, residual gas was evacuated and additional 2-propanol (500 ppm) was injected and photo-irradiated again.sorption of metallic NPs or a thermocatalytic process.To obtain an action spectrum, acetone evolution from decomposition of 2propanol over 1.0 wt (AuAg)/SrTiO 3 and 1.0 wt Au-Ag/SrTiO 3 was measured at room temperature under visible light irradiation.The AQE at each wavelength was calculated form the ratio of the amount of acetone and the amount of incident photons, using the following equation: AQE amount of acetone molecules amount of incident photons , As shown in Fig. 6a andb, each AQE plot was in agreement with the Kubelka-Munk function, indicating that photocatalytic activity observed in (AuAg)/SrTiO 3 and Au-Ag/SrTiO 3 was induced by photoabsorption based on LSPR excitation of Ag.Thus, Ag in both types of metallic NPs displayed strong photoabsorption in the visible light range due to LSPR excitation and greatly contributed to photocatalytic activity; (AuAg)/SrTiO 3 showed higher photocatalytic activity than that of Au-Ag/SrTiO 3 under visible light irradiation. Incidentally, it is well known that Ag NPs have great susceptibility to oxidation 353637; that is, Ag NPs are oxidized at the interface between Ag and the semiconductor photocatalyst, leading to the formation of silver oxide.The oxidation of Ag gives rise to a decrease in photoabsorption intensity.Fig. 7 shows the results of cycle tests of acetone evolution from decomposition of 2-propanol over 1.0 wt (AuAg)/SrTiO 3 and 1.0 wt Au-Ag/SrTiO 3 under visible light irradiation (440 800 nm).In both samples, acetone evolution increased almost linearly with irradiation time.As in the first cycle, acetone evolution was increased with irradiation time, indicating that (AuAg)/SrTiO 3 continuously decomposed 2-propanol under visible light irradiation without losing their activity.To clarify the valence state of Ag in both types of NPs, XPS measurements were carried out before and after the photocatalytic reaction test.Fig. 8a andb shows Ag 3d XPS spectra of 1.0 wt (AuAg)/SrTiO 3 and 1.0 wt Au-Ag/SrTiO 3 , respectively.Before the photocatalytic reaction test, two peaks located at 368.1 eV and 374.2 eV were observed in (AuAg)/SrTiO 3 , the peaks being attributed to typical values of Ag(0) 3d 5/2 and 3d 3/2 , respectively.These peak profiles were barely changed after the photocatalytic test, indicating that (AuAg)/SrTiO 3 was stable upon photocatalytic reaction or photoirradiation.For Au-Ag/SrTiO 3 , strong peaks located at 367.1 eV and 373.1 eV were observed before the photocatalytic reaction test, in addition to XPS spectra of Ag(0).These strong and broad peaks were identified to be divalent silver ions, suggesting that Au-Ag NPs were partially oxidized to AgO before the photocatalytic reaction test.Sukhishvili et al. reported that surface oxidation of Ag NPs hinders charge transfer between Ag NPs and substances 38.Therefore, we speculated that partial oxidation of Au-Ag bimetallic NPs suppressed photocatalytic oxidation of 2-propanol, resulting in lower activity than that of compared to (AuAg)/SrTiO 3 .On the other hand, in the case of (AuAg)/SrTiO 3 , the chemical stability of the Ag shell can be enhanced by coupling the Ag shell to the Au core due to a charge transfer that increases electron density within the Ag shell, yielding a negative Ag oxidation state 39.Nishimura et al. studied X-ray absorption near-edge structure (XANES) of (AuAg) NPs by using synchrotron radiation, and they revealed that a hole density of the 5d orbital in Au atoms increased in the order of Au foil Au NPs (14.4 nm in diameter) AuAg NPs (16.4 nm in diameter) 40. Moreover, they confirmed a positive shift of Au 4f 7/2 XPS peak energy of (AuAg) NPs when compared to those of bulk Au.Thus, Ag NPs was stabilized by coreshell (AuAg) nanostructure, thereby the photocatalytic activity of (AuAg)/SrTiO 3 was higher than that of Au-Ag/SrTiO 3 ."
  },
  {
    "title": "Conclusions",
    "content": "We prepared coreshell (AuAg)/SrTiO 3 and bimetallic Au-Ag/SrTiO 3 to clarify the effect of composite nanostructure on surface plasmon-induced photocatalytic activity.(AuAg)/SrTiO 3 and bimetallic Au-Ag/SrTiO 3 showed similar photo-absorptions in the visible light range, which were attributed to localized surface plasmon resonance (LSPR) excitation of Ag in both types of metallic NPs.The (AuAg)/SrTiO 3 and bimetallic Au-Ag/SrTiO 3 could oxidize 2-propanol to acetone and CO 2 under visible light irradiation (440 800 nm), and the rate of acetone evolution over (AuAg)/SrTiO 3 was greater than that of Au-Ag/SrTiO 3 .From the action spectra, it was confirmed that photocatalytic activities of (AuAg)/SrTiO 3 and Au-Ag/SrTiO 3 were induced by photoabsorption based on LSPR excitation of Ag in both types of metallic NPs.Based on the results of XPS spectra, it was revealed that a chemical stability of Ag was improved by forming coreshell structure, which leads to efficient surface plasmon-induced photocatalytic activity. Fig. 1.(a) TEM photograph and (b) size distributions of colloidal (AuAg) NPs.(c) STEM-HAADF image and (d-f) EDS elemental mapping images of colloidal (AuAg) NPs. Fig. 2. (a) STEM-HAADF image and (b-f) EDS elemental mapping of 1.0 wt Au-Ag/SrTiO3 prepared by a photo-reduction method. Fig. 3. TEM photographs for (a) SrTiO3 loaded with 1.0 wt (AuAg) NPs, (b) SrTiO3 loaded with 1.0 wt Au-Ag bimetallic NPs and (c) SrTiO3 loaded with 0.2 wt Au NPs.(d) K-M functions of 1.0 wt (AuAg)/SrTiO3 (solid line), 1.0 wt Au-Ag/SrTiO3 (broken line), 0.2 wt Au/SrTiO3 (dotted line) and bare SrTiO3 (chain line). Fig. 4. Time courses of (a) acetone evolution and (b) CO2 evolution from 2-propanol decomposition over 1.0 wt (AuAg)/SrTiO3, Au-Ag/SrTiO3 and SrTiO3 under visible light irradiation (440 800 nm, intensity 50 mW/cm 2 ). Fig. 5. (a) Time courses of acetone evolution from 2-propanol decomposition over 1.0 wt (AuAg)/SrTiO3 under a variety of intensity of visible light (440 800 nm).(b)The dependence of light intensity on acetone evolution rates over 1.0 wt (AuAg)/SrTiO3. Fig. 6.Action spectra of acetone evolution from 2-propanol decomposition over (a) 1.0 wt (AuAg)/SrTiO3 and (b) 1.0 wt Au-Ag/SrTiO3 together with Kubelka-Munk functions. Fig. 8. XPS spectra of Ag 3d of (a) (AuAg)/SrTiO3 and Au-Ag/SrTiO3 before (solid lines) and after (broken lines) photocatalytic reaction tests for decomposition of 2-propanol. This work has been supported by a grant from Advanced Catalytic Transformation program for Carbon utilization (ACT-C, JPMJCR12Y5), and the PRESTO program (JPMJPR16P4) from Japan Science and Technology Agency (JST)."
  }
]