[{"title": "Doi", "content": "10.1016/j.cej.2021.132863"}, {"title": "Article_Title", "content": "Hierarchical V2O5/ZnV2O6 nanosheets photocatalyst for CO2 reduction to solar fuels"}, {"title": "Abstract", "content": "The photocatalytic conversion of CO 2 to chemical fuel is an important part of artificial photosynthesis, and a promising solution to utilize solar energy for sustainable energy generation.In this study, V 2 O 5 /ZnV 2 O 6 nanosheet heterojunctions were in-situ synthesized using a hydrothermal method followed by calcination.The in-situ preparation is expected to generate intimate interfaces between these two materials, which can maximize the charge transfer and separation efficiency.Our results showed that V 2 O 5 /ZnV 2 O 6 nanocomposites prepared at calcination temperature of 400 C exhibits the most enhancement in electrochemical properties (photocurrent, EIS, etc), which results in 2.2 and 1.9 times improvement in the CO production rate from CO 2 photoreduction as compared to V 2 O 5 and ZnV 2 O 6 , respectively.The enhanced photocatalytic property is also supported from the theoretical calculation, showing charge transfer at the interface from ZnV 2 O 6 to V 2 O 5 , enhanced CO 2 adsorption at the V 2 O 5 /ZnV 2 O 6 surface, and preferred CO product selectivity.This work indicated that the Vanadium-based close-contacted heterojunctions can be a promising photocatalysts in the environmental and energy applications."}, {"title": "Experimental", "content": "All chemicals were of analytical grade and used without further purification, including ammonium metavanadate (NH 4 VO 3 , Daejung, 99.0,N, N-dimethyl formamide (Daejung, 99.8), zinc acetate (Zn (O 2 CCH 3 ) 2 ), Junsei, 99.0), and oxalic aciddihydrated (H 2 C 2 O 4 2H 2 O, Daejung, 99.5).Deionized water (DW, 18.25 M. cm) was used for preparing all the experimental solutions. The Zn-V-alkoxide precursor was first prepared using a solvothermal method 28.Typically, 0.24 g of ammonium metavanadate dispersed in 40 mL of N, N-dimethyl formamide (DMF) was mixed with 0.2252 g of zinc acetate and continuously stirred until homogenous solution was obtained.Then oxalic acid dihydrated and ammonium metavanadate were added with a ratio of 1:3.After stirring for 30 min, the solution was transferred into a 50 mL Teflon lined autoclave and was maintained at 200 C for 24 h and then cooled to room temperature to get black colored product.The precipitates were collected and washed for several times with absolute ethanol, then dried in air at 80 C for 12 h.The V 2 O 5 /ZnV 2 O 6 samples were obtained by calcining the Zn-V-alkoxide precursor at 300 C, 350 C, 400 C, 450 C, and 500 C each for 4 h, and the final products were labelled as V 2 O 5 , S350, S400, S450, and ZnV 2 O 6 , respectively.The final products were collected and washed for several times with absolute ethanol, then dried in air at 80 The XRD patterns were obtained by a Bruker D8 Advance X-ray diffraction machine using Cu K ( 0.15418 nm) radiation.Fourier transfer infrared spectroscopy (FT-IR) was recorded using a Nicolet Avatar 370 FT-IR.The X-ray photoelectron spectroscopy (XPS, Thermo Fisher Scientific, USA) data was recorded on a mono-chromated Al K Xray source (hv 14 86.6 eV) at 15 kV/150 W. Morphological observation was performed on a field emission transmission electron microscope (TEM, JEOL, JEM-ARM200F).The UV-vis diffuse reflectance spectra (UV-vis DRS) were acquired by UV-VIS-NIR spectrometer (Cary 5000, Agilent) using 100 BaSO 4 as the background over a range of 200-800 nm.Nitrogen adsorption isotherms and Brunauer-Emmett-Teller (BET) surface area were obtained on a nitrogen adsorption apparatus (Belsorp max).The photoluminescence spectra (PL) were obtained by a Fluoromax-4 spectrophotometer (HORIBA Scientific).The time-resolved PL spectra were performed on a PTI QM-400 luminescence spectrometer with 400 nm as the excitation wavelength, decay curves were fitted using biexponential decay function to obtain deconvolution of the instrument response function.Photo-electrochemical properties of the synthesized samples were evaluated using a three-electrode system potentiostat (IVIUMSTAT, Ivium Technologies) at room temperature.A Pt plate and an Ag/AgCl electrode (in saturated KCl) were used as the counter and the reference electrode, respectively.The photocurrent vs. time curves were measured at 0.5 V versus Ag/AgCl in a 0.5 M Na 2 SO solution at room temperature using a 150 W Xe lamp (Solar simulator, Abet Technologies).A Quantachrome Autosorb-IQ automated gassorption system, operated at 273 K was used to investigate CO adsorption properties.CO 2 was introduced and adsorbed on the samples for 45 min at room temperature.During the desorption process, the cell was heated to 400 C with a ramping rate of 10 C min -1 under the flowing He (50 sccm).The details of the photocatalytic measurement and density functional theory (DFT) calculations are given in Supporting Information."}, {"title": "Results_and_discussion", "content": "Fig. 1a and1b show the typical crystal structure of monoclinic ZnV 2 O 6 and orthorhombic V 2 O 5 , respectively.The Zn 2 ions are octahedrally coordinated and the V 5 ions have an irregular octahedral coordination in the ZnV 2 O 6 structure in which the VO 6 octahedra connected by edges form infinite anionic layers and the ZnO 6 octahedra joined by opposite edges form infinite rows 21,33.The structure of V 2 O 5 can be regarded as a series of layers perpendicular to (0 0 1) direction with weak interaction (mainly Van der Waals) between layers.Each layer consists of a periodic edge-and corner-sharing distorted VO square pyramids, where pyramids sharing an edge have an opposite orientation in the c direction, whereas the corner-sharing pyramids have the same orientation.The electronic properties of the candidate material can directly provide insights about its photocatalytic performances.Electronic band-structure calculations of ZnV 2 O 6 and V 2 O 5 were performed using the planewave based density functional theory (DFT), and their computed band structures along the high symmetry directions of the Brillouin zone are depicted in Fig. 1c and1d.The calculated band gaps are 2.53 and 2.13 eV for ZnV 2 O 6 and V 2 O 5 , respectively, which are within the range of band gap values reported for ZnO (3.3 eV) and V 2 O (2.12 eV) 34,35 and in agreement with several available experimental reports 34,35.The underestimated energy band gap values may be due to limitations in DFT, as this technique does not consider the discontinuity in the exchange-correlation potential 36,37.According to the band structure profiles, ZnV 2 O 6 and V 2 O 5 show quasi-direct and indirect band-gap natures, respectively.The combination of a direct-and an indirect band-gap semiconductors should provide more opportunities in both light absorption and charge separation.Especially considering the closed interface between these two materials, a better photocatalytic performance may be expected.To further study the compositions of VBM and CBM for ZnV In principle, the CO 2 photoreduction capability is strongly dependent on charge separation/transport in the powder photocatalysts 37.The charge transfer between two semiconductors depends on the interfacial band bending, which is further determined by the energy band and the Fermi levels.The work functions of ZnV 2 O 6 and V 2 O 5 were calculated relative to the vacuum energy level.Fig. 3a DFT calculations were also conducted to investigate the CO 2 adsorption behavior over the surface of V 2 O 5 and V 2 O 5 /ZnV 2 O 6 .Fig. 4 indicates that CO 2 adsorbed with the linear mode on both V 2 O 5 and V 2 O 5 /ZnV 2 O 6 was found to be the most favorable configuration as compared with the bent mode 39.In the linear mode, the A broader DFT study was thus performed to further explore the possible CO 2 conversion pathways and intermediate species initiated by these two different CO 2 adsorption configurations (Figs. 5 and6).Specifically, V 2 O 5 -CO 2 and V 2 O 5 /ZnV 2 O 6 -CO 2 were initially hydrogenated to produce COOH, which was subsequently converted to CO and OH.Whereafter, OH transformed into H 2 O, while CO would be desorbed from the surface immediately with the formation of CO (Pathway I) or further hydrogenated to generate CHO (Pathway II), a prerequisite for the subsequent hydrogenation processes to generate CH 4 ultimately 38,414243.For V 2 O 5 /ZnV 2 O 6 , both the hydrogenation and desorption of CO were favorable processes, but the energy release of the former (0.22 eV) was much higher than that of the latter (0.05 eV), thereby implying Pathway I (CO formation) was more thermodynamically accessible than Pathway II (CH 4 formation).As for the V 2 O 5 , the desorption of CO is thermodynamically favorable with 0.08 eV of energy emission while the hydrogenation of CO needs 0.17 eV of energy expenditure, demonstrating CO 2 was more probably reduced to CO going through Pathway I rather than Pathway II. The morphology and crystallinity of the Zn-V-alkoxide precursor prepared with different volume of DMF were characterized using XRD and SEM (Fig. S1a andS2).Although no obvious variation in the morphology was observed, the Zn-V-alkoxide precursor synthesized with 40 mL of DMF showed better crystallinity.The sharp diffraction peak at about 2 10.0 is a characteristic of metal alkoxides, which confirms the formation of the Zn-V-alkoxide precursor 27,28.Fig. 7 shows that after calcination at 300 , which matches well with the (0 1 0), (1 1 0), (1 0 1), (3 1 0), (0 1 1), and (3 0 1) planes of V 2 O 5 , respectively (PDF72-0433) 44.At higher calcination temperatures, additional diffraction peaks appear at 27.32, 28.94, 29.44, and 32.84 with increased intensity.These peaks are found to correspond to the (1 1 0), (2 0 2), (2 0 1), and (1 1 1) planes of ZnV 2 O 6 , respectively (PDF74-1262) 45.The XRD patterns of the V 2 O 5 /ZnV 2 O 6 composite photocatalysts (Fig. S1b) show blending of the two sets of diffraction patterns for V 2 O 5 and ZnV 2 O 6 .The XRD spectra evidenced that the Zn-V-alkoxide precursor were converted to a crystalline V 2 O 5 /ZnV 2 O 6 composite after calcination in air atmosphere. The surface elemental composition and chemical state of the elements are further characterized using X-ray photoelectron spectroscopy (XPS).Fig. 8a shows the XPS survey spectrum where the characteristic peaks of Zn, V, O, and C can be clearly observed without other impurities.Among them, the C element peak is mainly attributed to exogenous carbon as a correction reference 46.High-resolution scans of Zn, V and O are shown in Fig. 8b-d, respectively.The Zn 2p spectrum of 44.The Zn 2p peak observed in V 2 O 5 may come from the Zn-V-alkoxide precursor.The binding energies of V 2p3/2 (V 2p5/2) of V 5 in V 2 O 5 and ZnV 2 O 6 are reported to be 516.7 (524.3) and 517.2 (524.8)eV 18,22, respectively.With the increase of calcination temperature, the binding energy of V 5 in XPS increases (shown in Fig. 8c) and approaches that of ZnV 2 O 6 .This result again indicates that the content of ZnV 2 O 6 in the composite increases with the increase of calcination temperature, which is consistent with the results of XRD 47.The O 1 s peak (shown in Fig. 8d) can be resolved into two peaks at 529.9 and 531.5 eV.The former is ascribed to the lattice-oxygen and the latter to the adsorbed-oxygen 48.Therefore, in combination with XRD and XPS measurements, the results verify the presence of both V 2 O 5 and ZnV 2 O 6 in the composite. The SEM images showing the morphology of each sample are shown in Fig. 9.The Zn-V-alkoxide precursor is composed of many compact nanosheets.These nanosheets seem converged to larger crystallines after calcination, as shown in Fig. 9 (b-f).The atomic percentage of Zn, V and O in each sample was estimated through energy dispersive spectrometer (EDS) and listed in Table S1.When the calcination temperature reached 500 C the atomic percentage of Zn, V and O was close to 1:2:6, which is the same as the atomic ratio of ZnV 2 O 6 .Furthermore, the EDS pattern for the as-synthesized sample assured that only Zn, O and V elements existed, which indicates that there are no other impurity elements (See Fig. S3). The detailed microstructure of V 2 O 5 , ZnV 2 O 6 and S400 photocatalysts was further studied by TEM and HRTEM analysis.The HRTEM image (Fig. 10a) shows that V 2 O 5 crystals consist of a thin nanosheetlike structure.The clear lattice fringe with d-spacing of 0.248 nm can be indexed as the (2 1 1) crystal plane of V 2 O 5 (Fig. 10b).In Fig. 10c, ZnV 2 O 6 nanosheets connecting with each other exhibit 2D layer morphology.The HRTEM image of ZnV 2 O 6 (Fig. 10d) shows that the fringe spacing of 0.273 nm matches well with the interplanar spacing of (1 1 1) planes, indicating that the ultrathin ZnV 2 O 6 nanosheets possess preferentially exposed (1 1 1) facet.Fig. 10e shows that the S400 composites are composed of many compact smaller nanosheets.As shown in Fig. 10f, there are a large number of small-sized ZnV 2 O 6 nanosheets on the surface and edge of V 2 O 5 nanoplates, which can favorite the formation of interface heterojunction.The interplanar distance was found to be 0.273 and 0.248 nm, which corresponds to (1 1 1) and (2 1 1) planes of ZnV 2 O 6 and V 2 O 5 , respectively. The optical properties of Zn-V-based precursor and its different calcined samples were analyzed by UV-vis diffuse reflectance spectra as shown in Fig. 11a.Zn-V-based precursor samples show a strong visible light absorption zone due to the presence of metal alkoxides.The absorption edge of ZnV 2 O 6 has been reported to be 500 nm 27.With the increase of calcination temperature, the absorption spectra of the composite samples gradually blue shifted.This implies that the content of ZnV 2 O 6 in the composite sample gradually increased, which is consistent with the XRD and EDS analysis.The bandgap energies of each samples were calculated using the Tauc equation 49 and are listed in Table S2.The bandgap energies of Zn-V-based precursors and different calcined sample were 2.69, 2.15 2.58, 2.44, and 2.32 eV (Fig. 11b), respectively.These values are within the range reported for V 2 O 5 (2.12 eV) and ZnV 2 O 6 (2.50 eV) 50,51 and are in relative agreement with our first-principles calculations (2.31 eV). Fig. 12a shows the N 2 adsorption-desorption isotherms of the V 2 O 5 , S400 and ZnV 2 O 6 photocatalysts.These isotherms of samples have stronger interaction with N 2 when they are close to the Y-axis at the lower pressure region.Furthermore, hysteresis loops are presented at higher pressure region for all catalysts.So, these isotherms are classified as type IV with H3 hysteresis loops 52.BET specific surface areas (Table S3) of 30.18, 20.21, and 12.04 m 2 g -1 were obtained for V 2 O 5 , S400 and ZnV 2 O 6 photocatalysts, respectively.It is obvious that the BET specific surface area decreases with the increase of calcination temperature, which is due to the formation of a large number of small flakes of ZnV 2 O 6 during the calcination process.The Barrett-Joyner-Halenda pore size distribution curves of the samples show that they mainly consist of micropores around 2 nm (inset of Fig. 12a). The CO 2 and H 2 O adsorption ability of the catalyst plays a crucial role in boosting the photocatalytic reduction of CO 2 and H 2 O oxidation 53.Fig. 12b shows the CO 2 adsorption curves for the V 2 O 5 , S400 and ZnV 2 O 6 samples.It is seen that S400 photocatalysts curve has much better CO 2 adsorption ability than V 2 O 5 and ZnV 2 O 6 .In particular, the curve of S400 photocatalysts rises significantly faster than the other sample in the low-pressure range, which can be attributed to the existence of the micropores.With the increase of relative pressure, the difference between various samples is more obvious due to different specific surface area and pore volume. It is noted that S400 showed much higher CO 2 adsorption than V 2 O 5 despite its smaller surface area.Because of the difference in their morphology, the CO 2 adsorption ability can be more accurately compared by normalizing the CO 2 adsorption to their surface areas 54.The results showed that ZnV 2 O 6 had better CO 2 absorption ability (0.0560 cm 3 cm -2 ) than V 2 O 5 (0.0202 cm 3 cm -2 ).Therefore, it can be understood that with the increase of ZnV 2 O 6 content in the composite, the CO 2 adsorption ability increases.In addition, the much higher CO 2 adsorption exhibited by the V 2 O 5 /ZnV 2 O 6 composite (S400) evidenced that the existence of heterojunction with intimate interface at the photocatalyst surface can significantly promote the CO 2 adsorption.The improved charge transfer and separation can increase the electrondonating ability of the photocatalyst surface, which promotes the transfer of electron from the photocatalyst to CO 2 , resulting in higher CO 2 adsorption ability (0.0970 cm 3 cm -2 ) 55,56.The increased CO 2 adsorption on the V 2 O 5 /ZnV 2 O 6 surface is consistent with the theoretical calculation prediction shown in Fig. 4.These results suggest that the construction of hierarchical heterojunction nanosheet structures can effectively enhance CO 2 adsorption capacity of the composite, which is desirable to facilitate the enrichment and activation of CO 2 molecule, thus contributing to the boosted photocatalytic performance of V 2 O 5 / ZnV 2 O 6 composite for CO 2 reduction. In order to reveal the separation and recombination of photogenerated hole-electron pairs of catalysts, PL spectra excited at a wavelength of 310 nm were measured from the V 2 O 5 , ZnV 2 O 6 and V 2 O 5 / ZnV 2 O 6 composite samples (Fig. S4).The strongest emission peak was centered at about 437 nm for the Zn-V-based precursor, which displayed rapid recombination of electrons and pairs 26.Obviously, the PL intensity decreased quickly with the calcination temperature, but increased again after reaching a minimum in S400 samples.The PL spectra indicate the most efficient separation of photoinduced electron and hole pairs in S400 samples, which can be attributed to the formation of heterojunction between ZnV 2 O 6 and V 2 O 5 . To clarify the photocatalytic mechanism, the photocurrent responses of the prepared photocatalysts under simulated sunlight irradiation were shown in Fig. 13a.It can be observed that the S400 composite exhibited more increased photocurrent density than that of the V 2 O 5 , ZnV 2 O 6 and other temperature of composites, implying that more photogenerated charge carriers are produced and the photoexcited electronhole pairs separation efficiency 57.Therefore, it is consistent with the photocatalytic degradation activity of photocatalysts.The EIS analysis of different samples was carried out to further obtain the electrontransport-recombination properties, as shown in To evaluate the performance of selective CO 2 reduction by V 2 O 5 / ZnV 2 O 6 composite as compared with V 2 O 5 and ZnV 2 O 6 , the yield of CO and CH 4 were measured during the CO 2 reduction process under simulated sunlight irradiation.As shown in Fig. 14a, CO was the major product from the CO 2 conversion reaction.As explained in Fig. 6, CO mol/g/h, which is about 2.2 times and 1.9 times of V 2 O 5 and ZnV 2 O 6 , respectively.It shows that with the increase of the calcination temperature, the conversion of CO 2 increases gradually, but when the calcination temperature exceeds 400 C, the CO 2 conversion gradually decreases.The exceptional photocatalytic CO 2 reduction performances of V 2 O 5 /ZnV 2 O 6 heterojunction in S400 can be attributed to the following factors: (i) attachment of the ZnV 2 O 6 nanoflakes on V 2 O 5 surface can effectively increase the surface area for CO 2 adsorption; (ii) formation of a type II band alignment at the interface inducing charge separation; (iii) existence of high density interfaces in the composite, which effectively enhances the charge transfer and separation efficiency.Meanwhile, a practically viable photocatalyst should be stable enough for repeated/continuous application.Therefore, to test the catalytic stability of the S400 composite sample, the photocatalytic experiment was carried out repeatedly (Fig. 14b).The results show that the photocatalyst was stable under repeated application (three cycles) with nearly a constant conversion to CO. XPS valence band (XPS-VB) spectroscopy was performed to determine the valence band maximum (VBM) positions of the as-prepared ZnV 2 O 6 , showing that the VBM positions of ZnV 2 O 6 and V 2 O 5 were 1.02 and 1.51 eV, respectively (Fig. S5).According to the Fermi levels calculated above, the VBM levels of the ZnV 2 O 6 and V 2 O 5 are -4.99 and -5.26 eV vs. AVS 58, respectively.In addition, the band gap of ZnV 2 O 6 and V 2 O 5 are 2.69 and 2.15 eV, respectively.Therefore, the corresponding conduction band minimum (CBM) positions of as-prepared S4).According to the above conclusion, the possible Type-II schematic diagram of photocatalytic CO 2 reduction on V 2 O 5 /ZnV 2 O 6 photocatalyst under simulated sunlight irradiation is shown in Fig. 15.As the band gap energy of ZnV 2 O 6 is about 2.69 eV, electrons (e -) and holes (h ) will be generated on the surface of the semiconductor when the light irradiates on the photocatalyst.These electrons are trapped by vanadium and exist on the surface of ZnV 2 O 6 in the form of impurities, so that they can be effectively separated.In addition, due to the existence of V 2 O 5 /ZnV 2 O 6 heterojunction, the charge is effectively separated, and V 2 O 5 will further capture electrons, thus significantly enhancing the photoactivity.As discussed previously, V 2 O 5 /ZnV 2 O 6 photocatalyst (S400) gave the highest photo-activity among all samples.This was obviously due to efficient charges separation with appropriate band structure for photocatalytic CO 2 reduction.Therefore, enhanced photo-catalytic activity would be achieved by developing V 2 O 5 /ZnV 2 O 6 heterostructure, enabling efficient separation of charge carrier for selective CO 2 reduction under solar energy."}, {"title": "Conclusions", "content": "In summary, V 2 O 5 /ZnV 2 O 6 hybrid structure in-situ synthesized using a solvothermal method followed by calcination in the temperature range of 300-500 C which established a strong interface system due to the 2D/2D assembly of positively charged V 2 O 5 sheets and negatively charged ZnV 2 O 6 nanosheets.Results demonstrate the CO generation at a rate of 6.15 molg -1 h -1 with an approximate stoichiometric O 2 evolution can be achieved from S400 photocatalysts under simulated solar light irradiation with increased selectivity and stability.The high performance of this new 2D/2D composite material is ascribed mainly to photocatalyst.V and O atoms in V 2 O 5 are connected to Zn and V atoms in ZnV 2 O 6 , respectively.Fig.2cillustrates the calculated interfacial charge density difference for V 2 O 5 /ZnV 2 O 6 .Consistent with the band structure calculation, the lowest electron states and the highest hole states locate in V 2 O 5 and ZnV 2 O 6 , respectively.The results indicate that a type-II band alignment is expected at the V 2 O 5 /ZnV 2 O 6 interface, and efficient spatial separation of holes and electrons could thus be predicted.In principle, the CO 2 photoreduction capability is strongly dependent on charge separation/transport in the powder photocatalysts37.The charge transfer between two semiconductors depends on the interfacial band bending, which is further determined by the energy band and the Fermi levels.The work functions of ZnV 2 O 6 and V 2 O 5 were calculated relative to the vacuum energy level.Fig.3aand 3b show the calculated electrostatic potentials of ZnV 2 O 6 (1 1 1) and V 2 O 5 (2 1 1) planes.The work functions of ZnV 2 O 6 (1 1 1) and V 2 O 5 (2 1 1) were calculated to be photocatalyst.V and O atoms in V 2 O 5 are connected to Zn and V atoms in ZnV 2 O 6 , respectively.Fig.2cillustrates the calculated interfacial charge density difference for V 2 O 5 /ZnV 2 O 6 .Consistent with the band structure calculation, the lowest electron states and the highest hole states locate in V 2 O 5 and ZnV 2 O 6 , respectively.The results indicate that a type-II band alignment is expected at the V 2 O 5 /ZnV 2 O 6 interface, and efficient spatial separation of holes and electrons could thus be predicted.In principle, the CO 2 photoreduction capability is strongly dependent on charge separation/transport in the powder photocatalysts37.The charge transfer between two semiconductors depends on the interfacial band bending, which is further determined by the energy band and the Fermi levels.The work functions of ZnV 2 O 6 and V 2 O 5 were calculated relative to the vacuum energy level.Fig.3aand 3b show the calculated electrostatic potentials of ZnV 2 O 6 (1 1 1) and V 2 O 5 (2 1 1) planes.The work functions of ZnV 2 O 6 (1 1 1) and V 2 O 5 (2 1 1) were calculated to be Fig. 1.Crystal structure of (2x2x2) ZnV 2 O 6 (a), and (2x2x2) V 2 O 5 (b); Band structures and partial and total densities of states (PDOS and TDOS) of ZnV 2 O 6 (c), and V 2 O 5 (d). Fig. 2. Projected band structure of V 2 O 5 (2 1 1)/ZnV 2 O 6 (1 1 1) and the corresponding DOS (a).Here, the black and red lines denote the contribution of ZnV 2 O 6 and V 2 O 5 layers, respectively.schematic representation of V 2 O 5 (2 1 1)/ZnV 2 O 6 (1 1 1) heterojunction photocatalyst interfacial contact (b).Calculated interfacial charge density difference for V 2 O 5 (2 1 1)/ZnV 2 O 6 (1 1 1), yellow and blue represent charge accumulation and depletion, respectively (c).(Isosurface value is 4 10 - 4 eA -3 ; In Fig. 2b and c, the O, Zn, and V atoms are indicated by red, dark grey, and light gray, respectively). 3.83 and 3.50 eV, respectively.Therefore, the positions of the Fermi level of ZnV 2 O 6 and V 2 O 5 are located at -3.97 and -3.75 eV vs. Absolute Vacuum Scale (AVS), respectively.In this case, as shown in Fig.3d, during the establishment of V 2 O 5 /ZnV 2 O 6 interface, the electrons would migrate from V 2 O 5 to ZnV 2 O 6 until their Fermi energies reach the same level, leading the formation of an internal electric field pointing from V 2 O 5 to ZnV 2 O 6 .Therefore, at the interface the electrons are driven to from ZnV 2 O 6 to V 2 O 5 .In addition, the work function of the V 2 O 5 (2 1 1)/ZnV 2 O 6 (1 1 1) was calculated to be 3.71 eV (Fig.3c), confirming the band bending at the interface due to charge migration. CO 2 molecules prefer to bond with the V 2 O 5 /ZnV 2 O 6 surface through the V atom with a surface O site and through the two self-O atoms that were bonded to the two surface V centers (-CO 2 ), which results in V 2 O 5 / ZnV 2 O 6 -CO 2 with E abs -0.56eV.As for V 2 O 5 , the CO 2 molecules tend to bond to its surface adjacent O and single V atom (-CO 2 ), which results in V 2 O 5 -CO2 with E abs -0.27 eV.Additionally, in comparison with that of dissociative CO 2 molecule (1.18 A), the C-O bonds length of the absorbed CO 2 obviously increased to 1.30 A for V 2 O 5 / ZnV 2 O 6 and 1.25 A for V 2 O 5 , respectively 38-40.All these results demonstrated that the V 2 O 5 /ZnV 2 O 6 (1 1 1) surface facilitates more stable absorption of CO 2 and promotes different activation levels, which might alter the CO 2 conversion pathway and realize the high selectivity of CO 2 photoreduction over V 2 O 5 (2 1 1) surface. Fig. 3. Calculated Femi levels of (a) ZnV 2 O 6 , (b) V 2 O 5 and (c) V 2 O 5 (2 1 1)/ZnV 2 O 6 (1 1 1).(d) The interface band-bending diagram and interfacial charge transfer between the V 2 O 5 and ZnV 2 O 6 in the V 2 O 5 /ZnV 2 O 6 composite. Fig. 5. Adsorption of CO 2 (a, f), COOH (b, g), CO OH (c, h), CO H 2 O (d, i) and CHO (e, j) on V 2 O 5 (2 1 1) and V 2 O 5 (2 1 1)/ZnV 2 O 6 (1 1 1). Fig. 6.Reaction pathways for CO 2 reduction on V 2 O 5 (2 1 1) and V 2 O 5 (2 1 1) ZnV 2 O 6 (1 1 1).\"\" represents adsorption on substrate. Fig. 7. XRD patterns of V 2 O 5 , ZnV 2 O 6 and V 2 O 5 /ZnV 2 O 6 composite photocatalysts synthesized at different calcination temperatures. shown in Fig.8b) has two peaks at binding energy of 1021.8 eV and 1044.7 eV.They can be respectively indexed to the characteristic spin-orbit split states of Zn 2p 3/2 and Zn 2p 1/2 , indicating a normal oxidation state of Zn 2 Fig. 8. XPS survey spectra (a) and high-resolution XPS spectra of: Zn 2p (b), V 2p (c) and O1s (d) of V 2 O 5 , ZnV 2 O 6 and V 2 O 5 /ZnV 2 O 6 composite photocatalysts. Fig. 10.TEM and HRTEM of V 2 O 5 (a, b), ZnV 2 O 6 (c, d) and V 2 O 5 /ZnV 2 O 6 photocatalysts (e, f). .Li et al. Fig. 13b.The EIS response demonstrated the S400 composite photocatalysts possessed a smaller impedance radius compared with other composites.The EIS response demonstrated the V 2 O 5 /ZnV 2 O 6 composite photocatalysts display a smaller semicircle in the Nyquist plot than that of pure V 2 O 5 and ZnV 2 O 6 , which further confirms the elevated conductivity of the hybrid and the superiority of hierarchical heterojunction nanosheet structure in promoting a faster charge carriers' migration.This is consistent with the PL result.It is also consistent with the theoretical calculation that the electrons transfer from ZnV 2 O 6 to V 2 O 5 (electrons gather on V 2 O 5 and holes on ZnV 2 O 6 ), which enhances the charge transfer and separation. Fig. 11.(a) UV-vis DRS, (b) plot of transferred Kubelka-Munkvsthe energy of light of the V 2 O 5 , ZnV 2 O 6 and V 2 O 5 /ZnV 2 O 6 composite samples. Fig. 12.(a) N 2 adsorption-desorption isotherm and pore size distributions (inset of (a)) of V 2 O 5 , S400 and ZnV 2 O 6 samples.(b) CO 2 adsorption curves of V 2 O 5 , S400 and ZnV 2 O 6 photocatalysts. 6 and V 2 O 5 samples are -2.30and -3.11 eV vs. AVS based on the VBM positions and optical bandgap (shown in Table Fig. 13.Transient photocurrent responses (a), EIS response (b) of the V 2 O 5 , ZnV 2 O 6 and V 2 O 5 /ZnV 2 O 6 composite samples. Fig. 14.(a) CO and CH 4 yield of different photocatalysts under simulated sunlight irradiation.(b) Repeated photocatalytic CO 2 reduction activity with the S400 sample. Fig. 15.Schematics of photocatalytic reaction processes for the V 2 O 5 /ZnV 2 O 6 composites. C (black curve), main diffraction peaks are observed at 20.31, 21.74, 26.16, 31.00,32.40, and 34.32 This research was supported by the Basic Science Research Program through the National Research Foundation of Korea funded by the Ministry of Science, ICT and Future Planning (2017R1D1A1B03032265 and 2019R1A2C1086881).SEM characterization in this research was supported by Nano-material Technology Development Program through the National Research Foundation of Korea (NRF) funded by the Ministry of Science, ICT and Future Planning (2009-0082580).The XPS measurement was performed in Busan Center of Korea Basic Science Institute (KBSI). The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://doi.org/10.1016/j.cej.2021.132863."}]