[
  {
    "title": "Doi",
    "content": "10.3390/su14010374"
  },
  {
    "title": "Article_Title",
    "content": "Photocatalytic Reduction of CO2 to Methanol by Cu2O/TiO2 Heterojunctions"
  },
  {
    "title": "Abstract",
    "content": "The conversion of CO 2 to low-carbon fuels using solar energy is considered an economically attractive and environmentally friendly route.The development of novel catalysts and the use of solar energy via photocatalysis are key to achieving the goal of chemically reducing CO 2 under mild conditions.TiO 2 is not very effective for the photocatalytic reduction of CO 2 to low-carbon chemicals such as methanol (CH 3 OH).Thus, in this work, novel Cu 2 O/TiO 2 heterojunctions that can effectively separate photogenerated electrons and holes were prepared for photocatalytic CO 2 -to-CH 3 OH.More visible light-active Cu 2 O in the Cu 2 O/TiO 2 heterojunctions favors the formation of methanol under visible light irradiation.On the other hand, under UV-Vis irradiation for 6 h, the CH 3 OH yielded from the photocatalytic CO 2 -to-CH 3 OH by the Cu 2 O/TiO 2 heterojunctions is 21.0-70.6mol/g-catalyst.In contrast, the yield of CH 3 OH decreases with an increase in the Cu 2 O fraction in the Cu 2 O/TiO 2 heterojunctions.It seems that excess Cu 2 O in Cu 2 O/TiO 2 heterojunctions may lead to less UV light exposure for the photocatalysts, and may decrease the conversion efficiency of CO 2 to CH 3 OH."
  },
  {
    "title": "Experimental",
    "content": "Cu 2 O was prepared by the facile soft chemical method (Figure 1).Briefly, CuCl 2 (97, Merck, Kenilworth, NJ, USA) (10.1 mmol) was dispersed in a NaCl solution (5 M) (100 mL) with a dispersant (polyethylene glycol 20,000 (Sigma-Aldrich, Burlington, MA, USA) (0.025 mmol)), which was stirred at 298 K for 1 h.Na 3 PO 4 (96, Sigma-Aldrich, USA) (9.76 mmol) was added to the solution and stirred for 1 h.The Cu 2 O was centrifuged and cleaned with distilled water and ethanol three times.Titanium butoxide (Ti(OBu) 4 ) (97, Sigma-Aldrich, USA) and Cu 2 O at the X Cu2O mole fractions (Cu 2 O/(Cu 2 O TiO 2 )) of 0.1, 0.2 and 0.5 were mixed in deionized water, and were then centrifuged, dried at 378 K for 4 h, and heated at 723 K under N 2 flow (99.99) (20 mL/min) for 2 h to obtain the Cu 2 O/TiO 2 heterojunctions used for photocatalysis experiments.equipped with an energy-dispersive X-ray spectrometer (EDS) (AURIGA) and scanning transmission electron microscopy (JEOL JEM-2100F CS STEM).The room temperature photoluminescence spectra of the photocatalysts were determined on the LabRAM HR (Horiba Jobin Yvon, Palaiseau, France) using the 325 nm excitation wavelength.The diffuse reflection absorption spectra of the photocatalysts at 200-800 nm were studied on a UVvisible spectrophotometer (Varian, Cary 100, Palo Alto, CA, USA).BaSO 4 was used as the standard in the absorption spectroscopic experiments.The bandgap energy was studied via the Kubelka-Munk equation (h A(h-Eg) n ).The specific surface area, pore size and pore volume distribution of the photocatalysts were measured on a nitrogen adsorptiondesorption analyzer (Micromeritics, ASAP 2020) using the Brunauer-Emmett-Teller (BET) and Barret-Joyner-Halenda (BJH) model.The zeta potential data were determined from the specific surface areas and active sites of the photocatalysts. The photocatalytic experiments were carried out in a closed cylindrical quartz reactor to prevent oxygen/air access.The photocatalyst (0.1 g) was dispersed in a sodium hydroxide (0.025 M) aqueous solution (100 mL).Before the photocatalysis experiments, high-purity CO 2 was bubbled through the solution until the pH reached 7.00 at 298 K.A 300 W Xenon arc lamp (Burgeon Instrument Co., Ltd., Taoyuan City, Taiwan) with the light cut off ( 400 nm) by a filter (FSQ-CG400, Newport, Taipei, Taiwan) was used for the experiments on the photocatalytic reduction of CO 2 to methanol.The concentrations of the photocatalytic product methanol were measured by GC-MS (JEOL JMS-700 and Shimadzu, QP2010)."
  },
  {
    "title": "Results_and_Discussion",
    "content": "The XRD patterns of the photocatalysts are shown in Figure 2 3c).The HRTEM image of the sample in Figure 3d shows lattice fringes spacing of 0.212 and 0.237 nm, corresponding to the (200) and (111) planes of Cu 2 O, respectively 28.The TiO 2 with high crystallinity has the d-spacings of 0.352 and 0.246 nm, related to the (100) and (004) planes of anatase TiO 2 28.The nitrogen adsorption-desorption isothermals of the pristine TiO 2 and Cu 2 O/TiO 2 heterojunctions are shown in Figure 4A.The absorption isothermals of the Cu 2 O/TiO 2 heterojunctions can be classified as type IV with H1 hysteresis loops, suggesting that they have a mesoporous structure.In Figure 4B, the Cu 2 O/TiO 2 heterojunctions have greater pore volumes, with pore diameters between 10 and 40 nm, than the pristine TiO 2 , possessing relatively high pore diameters of 30-70 nm.It seems that the smaller Cu 2 O nanoparticles may, to some extent, be incorporated into the pores of the TiO 2 , which creates more internal surfaces in the interfaces of the Cu 2 O and TiO 2 nanoparticles.In Table 1, as expected, the Cu 2 O/TiO 2 heterojunctions have relatively high specific surface areas (94-120 m 2 /g) and small average pore diameters, which may benefit the photocatalytic reduction of CO 2 to CH 3 OH.According to the linear regression analysis, the relationship between the zeta potentials (see in Table 1) and BET surfaces of the Cu 2 O/TiO 2 heterojunctions and TiO 2 nanoparticles was well fitted (R 2 0.9).The zeta potential data were determined by the specific surface areas and active sites of the photocatalysts.The Cu 2 O/TiO 2 heterojunctions with negative potential can provide more active sites for CO 2 reduction, suggesting that the Cu 2 O/TiO 2 heterojunctions are feasible for photocatalytic CO 2 -to-CH 3 OH reactions. The diffuse reflectance ultraviolet-visible spectra of the photocatalysts were also determined.In Figure 5, the absorbance of the Cu 2 O/TiO 2 heterojunctions in the range of 200-800 nm can be observed.Compared with TiO 2 , the fundamental absorbance cuts at 400 nm, and the TiO 2 mixed with Cu 2 O reveals a significantly enhanced absorption in the visible light region.It is clear that TiO 2 with Cu 2 O causes a red-shift to 400-800 nm in the visible light range, possibly due to the forming of the Cu 2 O/TiO 2 heterojunctions 28. In Figure 6, the bandgap energies of the photocatalysts were determined by the Kubelka-Munk transforms 29.The direct bandgaps of the TiO 2 , Cu 2 O and Cu 2 O/TiO 2 heterojunctions with the X Cu2O fractions of 0.1, 0.2 and 0.5 were estimated to be 3.20, 2.09, 3.03, 3.0 and 2.94 eV, respectively.It seems that the coupling of Cu 2 O with TiO 2 can effectively decrease the bandgap energies of both.The Cu 2 O/TiO 2 heterojunctions turn out to be more photoactive than TiO 2 under visible light irradiation.The charge separation efficiency of photoinduced electrons and holes is also one of the important factors in photocatalysis.The photoluminescence spectra can provide information on charge carrier trapping, migration and transfer 30.The photoluminescence spectra of the Cu 2 O/TiO 2 heterojunctions are shown in Figure 7.The photoluminescence intensity of the Cu 2 O/TiO 2 heterojunctions is less than that of TiO 2 .A clear quenching of the photoluminescence emission of the Cu 2 O/TiO 2 heterojunctions is observed, especially for the Cu 2 O/TiO 2 heterojunctions with the X Cu2O fraction of 0.2, which showed maximum quenching.Such quenching of the photoluminescence suggests that the separation of photogenerated electron and hole pairs in the Cu 2 O/TiO 2 heterojunctions has been effectively improved.Cu 2 O can transfer the photogenerated holes from TiO 2 to inhibit the recombination of photogenerated electrons and holes significantly, and this may consequently lead to enhanced photocatalysis.CO 2 can be activated by a one-electron transfer step to formCO 2 -, which may be reduced to yield the hydroxyformyl radical (COOH), which recombines with a hydrogen radical (H ) and an electron (e -) to form formic acid and formaldehyde (which seem to be formed prior to the CH 3 OH generation) 18.Thus, the key points that control the photocatalytic CO 2 -to-CH 3 OH reaction may include reaction conditions, photocatalyst activity, bandgap energy, light source and process parameters, and the comparison between different methods is shown in Table 2 3132333435363738.It is clear that the Cu 2 O/TiO 2 heterojunctions prepared in this work offer much better CH 3 OH yields under visible light irradiation. Figure 1.Preparation procedure for the Cu 2 O/TiO 2 heterojunction photocatalysts.The crystalline structures of the Cu 2 O, TiO 2 and Cu 2 O/TiO 2 heterojunctions were determined by X-ray diffraction (D8, Discover with Gadds, Bruker AXS Gmbh).The crystalline sizes of the Cu 2 O, TiO 2 and Cu 2 O/TiO 2 heterojunction photocatlysts were calculated by the Scherrer equation (t k/Bcos) using the Jade software.The images of the Cu 2 O/TiO 2 heterojunctions were investigated by scanning electron microscopy (SEM) . The diffraction peaks at 29.6 , 36.5 , 42.4 , 61.4 , 73.6 and 77.5 correspond to the (110), (111), (200), (220), (311) and (222) phases of the crystalline Cu 2 O (JCPDS card No. 78-2076), respectively 25.A high-intensity diffraction peak at 36.4 confirms the existence of Cu 2 O in the Cu 2 O/TiO 2 heterojunctions.Other diffraction peaks at 25.3 , 37.8 , 48.0 , 53.9 , 55.0 , 62.7 , 68.8 , 70.3 and 75.0 can be indexed to the (101), (004), (200), (105), (211), (204), (116), (220) and (215) planes of TiO 2 (JCPDS card No. 71-1167), associated with the anatase phase 26,27, indicating that the Cu 2 O/TiO 2 heterojunctions consist of anatase predominantly.Note that a peak at 38.7 related to the CuO(111) plane is also observed, suggesting the existence of a small amount of CuO.The crystalline sizes of the TiO 2 , Cu 2 O, and Cu 2 O/TiO 2 heterojunctions derived by Scherrer's equation are 50-100, 50-70, and 40-100 nm, respectively. Figure 2. X-ray diffraction patterns of the (a) Cu 2 O and Cu 2 O/TiO 2 heterojunctions with the X Cu2O fractions of (b) 0.5, (c) 0.2, (d) 0.1, and (e) TiO 2 nanoparticles. Figure 3.The TEM images of the (a) pristine TiO 2 and (b) Cu 2 O/TiO 2 heterojunctions (X Cu2O 0.5) with (c) EDS mapping, and (d) the HRTEM image. Figure 4. (A) N 2 absorption-desorption isothermals and (B) pore size distributions of the Cu 2 O/TiO 2 heterojunctions with the X Cu2O fractions of 0.1, 0.2, 0.5, and pristine TiO 2 nanoparticles. Figure 5. UV-Vis DR spectra of the Cu 2 O/TiO 2 heterojunctions with the X Cu2O fractions of 0.1-0.5. Figure 6.The Tauc plot of the Cu 2 O/TiO 2 heterojunctions with the X Cu2O fractions of 0.1-0.5. Figure 7.The photoluminescence spectra of the Cu 2 O/TiO 2 heterojunctions with the X Cu2O fractions of (a) 0.1, (b) 0.2 and (c) 0.5, and (d) pristine TiO 2 nanoparticles. Figure 8A shows the yield of CH 3 OH from the photocatalytic reduction of CO 2 by the Cu 2 O/TiO 2 heterojunctions under visible light irradiation.After 6 h of visible light irradiation, the yields of CH 3 OH photocatalyzed by the Cu 2 O/TiO 2 heterojunctions with the X Cu2O fractions of 0.1, 0.2, and 0.5 are 9.29, 11.44, and 13.06 mol/g-catalyst, respectively.Note that, as expected, TiO 2 is not very effective for the photocatalytic CO 2 -to-CH 3 OH reaction.Additionally, more visible light-active Cu 2 O in the Cu 2 O/TiO 2 heterojunctions favors the formation of methanol.On the other hand, under UV-Vis irradiation for 6 h, the CH 3 OH yielded from the photocatalytic CO 2 -to-CH 3 OH reaction by the Cu 2 O/TiO 2 heterojunctions is 21.0-70.6mol/g-catalyst (see Figure 8B).It is clear that the yields of CH 3 OH under UV-Vis irradiation are greater than those under visible irradiation.In contrast, the yield of CH 3 OH decreases with an increase in the Cu 2 O fraction in the Cu 2 O/TiO 2 heterojunctions.It seems that excess Cu 2 O in the Cu 2 O/TiO 2 heterojunctions may lead to less UV light exposure for the photocatalysts, and may reduce the conversion efficiency of CO 2 to CH 3 OH. Figure 8. Photocatalytic reduction of CO 2 to methanol under (A) visible and (B) UV-visible irradiation by the Cu 2 O/TiO 2 heterojunctions with the X Cu2O fractions of (a) 0.1, (b) 0.2, (c) and 0.5, and (d) TiO 2 nanoparticles. Scheme 1.The charge separation with the Cu 2 O/TiO 2 heterojunctions under (a) ultraviolet-visible and (b) visible light irradiation. The BET surface areas, average pore diameters, and zeta potentials of the pristine TiO 2 and Cu 2 O/TiO 2 heterojunctions with the X Cu2O fractions of 0.1-0.5. Acknowledgments: The financial supports of the Taiwan Ministry Science and Technology and EPA for sponsoring this project (MoST 108-2221-E-006-165-MY3, MoST 109-2221-E-006 -042 -MY3, MoST 110-2221-E-006-107-MY2, and EPA 110GA00008001047) are gratefully acknowledged. Funding: This research was funded by the Taiwan Ministry Science and Technology and EPA. Informed Consent Statement: Not applicable. The data presented in this study are available on request from the corresponding author."
  },
  {
    "title": "Conclusions",
    "content": "The novel Cu 2 O/TiO 2 heterojunction photocatalysts prepared by a simple soft chemical method have relatively high specific surface areas and small average pore diameters, which may benefit the photocatalytic reduction of CO 2 to CH 3 OH.The Cu 2 O in conjunction with TiO 2 decreases its bandgap energy, and extends the absorption to the visible light region.The p-n-type heterojunction can effectively suppress charge carrier recombination.After the 6 h photocatalytic reduction, 9-13 and 21-76 mol/g-catalyst of methanol can be yielded under visible and UV-Vis irradiation, respectively.The comparison between different methods suggests that the Cu 2 O/TiO 2 heterojunctions prepared in this work offer much better CH 3 OH yields under visible and UV light irradiation. The authors declare no conflict of interest."
  }
]