[
  {
    "title": "Doi",
    "content": "10.1016/j.jssc.2022.122878"
  },
  {
    "title": "Article_Title",
    "content": "Construction of NiO/g-C3N4 p-n heterojunctions for enhanced photocatalytic CO2 reduction"
  },
  {
    "title": "Abstract",
    "content": "Reducing carbon dioxide (CO 2 ) as fuel by photocatalysis is one of the effective methods in addressing the issues of fossil fuel crisis and greenhouse effect.Here, a novel p-n heterojunction made up of NiO nanosheets and g-C 3 N 4 nanowires has been effectively fabricated on a large scale for the photocatalytic conversion of CO 2 to CO and CH 4 .The morphologies, structures and composition of the NiO/g-C 3 N 4 were characterized, which confirmed the being of the p-n junction between NiO nanosheets and g-C 3 N 4 nanowires.The improved photocatalytic activities of CO 2 reduction over NiO/g-C 3 N 4 can come from the broadened light response range and the formation of the p-n junction that could deter the rapid recombination of electrons and holes.The possible photocatalytic mechanism of CO 2 reduction reaction has been presented.Moreover, a novel NiO/g-C 3 N 4 photocatalyst exhibits considerable stability for CO 2 reduction."
  },
  {
    "title": "Experimental",
    "content": "The analytical reagents used were obtained from Alfa Aesar without advance refinement.Distilled water was utilized all through the experiment. The g-C 3 N 4 nanowires were prepared by the hard template method.The template SiO 2 aerogel (hydrophobicity, 200-2000 m 2 g -1 , Nano Tech Co., Ltd.) was calcined at 550 C for 6 h for further use.Then, 1 g of pretreated SiO 2 aerogel was scattered in 10 mL of cyanamide aqueous solution (50 vol containing 1 formic acid stabilizer) by ultrasound for 2 h and oscillation for 24 h.After centrifugation, the obtained gelatinous product was dried at 80 C for 36 h.The above powder was transferred to a covered alumina crucible and annealed at 550 C at a heating rate of 2.5 Cmin -1 under nitrogen atmosphere.Through heat treatment of 4 h, the yellow powder was etched in hydrofluoric acid (11.5 M) for 24 h to wipe off SiO 2 substance.The obtained product was washed to neutral with distilled water and finally dried at 80 C overnight to acquire g-C 3 N 4 nanowires. Firstly, 15 mmol of oleic acid and 0.6 g of sodium hydroxide were mixed at 110 C for 3 h under continuous mechanical stirring.Then, 10 mL of NiSO 4 solution (1.0 M) was dropped into the above blended solution and stirred for another 2 h.Finally, the green nickel oleate was gotten by washing with hot distilled water and drying overnight at 100 C. Nickel oleate (0.30 g), cetyltrimethylammonium bromide (CTAB, 0.06 g), sodium hydroxide (0.3 g) and sodium hypophosphite (0.3 g) were added to 3 mL of distilled water.After ultrasound for 1 h, the resultant mixture was poured into the autoclave and maintained at 180 C.After 12 h, the centrifuged precursor was washed by distilled water and dried overnight at 80 C. The dried sample was further calcined at a heating-up rate of 2.5 Cmin -1 to 600 C for 2 h to get NiO nanosheets. Typically, an appropriate amount of NiO nanosheets and g-C 3 N 4 nanowires were mixed, grounded and then transferred to a covered alumina crucible.After the reaction was carried out at 300 C for 4 h in nitrogen atmosphere, the resultant sample was the NiO/g-C 3 N 4 composites.When the weight ratios of NiO nanosheets and g-C 3 N 4 nanowires were 1:5, 2:5, 2.5:5, 3:5 and 4:5, the corresponding composites were labeled as NC-1, NC-2, NC-3, NC-4 and NC-5, respectively.Furthermore, the mechanical mixture of NiO nanosheets and g-C 3 N 4 nanowires with weight ratio of 2.5:5 was prepared in the above way, except for the lack of heat treatment, which was named as NC-3-MM. The crystal structure of the catalyst was analyzed by powder X-ray diffraction (XRD) on the Empyrean XRD-6000 with Cu K radiation ( 14 0.154 nm).The thermal performance of the as-synthesized specimens was studied by thermogravimetry (TG, TGS-2).The morphologies of various materials were observed by transmission electron microscopy (TEM, JEM-1011), high-resolution TEM (HRTEM, JEM-2100F) and field emission scanning electron microscopy (FESEM, FEI QUANTA FEG 650).The energy dispersive X-ray spectroscopy (EDS, X-act, OXFORD) was employed to determine the distribution of elements.The functional groups were recorded by using Fourier transform infrared spectroscopy (FT-IR, VERTEX70).N 2 adsorption-desorption isotherms and CO 2 adsorption were measured on a TriStar 3020 equipment to obtain the specific surface area of catalysts from Brunauer-Emmett-Teller (BET) equation and the pore size distribution from Barrett-Joyner-Halenda (BJH) method.The surface chemical compositions and the valence band (VB) spectra were performed on an X-ray photoelectron spectroscopy (XPS, EscaLab 250Xi) with an Al-K radiation source.The UV-vis and photoluminescence (PL) spectra were obtained on UV-2550 and F-7000 at the room temperature, respectively.The electron spin resonance (ESR) signal was checked on a BRUKER A300 spectrometer at 77 K by using 5,5-dimethyl-1-pyrroline N-oxide (DMPO) as a trapping agent under radiation to obtain OH radical.The turnover number (TON) and the CH 4 selectivity were calculated via the following equations, respectively. (2) All electrochemical measurements were performed using an electrochemical workstation (CHI 760E) with a standard three-electrode system in a Na 2 SO 4 solution (0.5 M).The photocatalyst (5 mg) was dispersed in ethanol (1 mL) to obtain slurry.The working electrode with the active area of 0.196 cm 2 was obtained by coating the slurry (0.4 mL) on FTO glass, which was dried at room temperature and then heated at 300 C for 3 h.The photocatalyst-coated FTO glass was used as the working electrode, Ag/AgCl (saturated KCl) as the reference electrode and Pt foil as the counter electrode, respectively.The Mott-Schottky (M A S) curves were investigated at three frequencies of 1 kHz, 2 kHz and 3 kHz, respectively.Electrochemical impedance spectroscopy (EIS) and photocurrent tests were performed with a 300 W xenon arc lamp. Photocatalytic experiments were conducted with 300 W Xe-lamp to simulate sunlight by continuous stirring.Generally, the photocatalyst (20 mg) was spread in deionized water (20 mL) and triethanolamine (TEOA, 10 mL).The reaction solution was purged with high purity CO 2 (99.999) gas for at least 30 min to clear away air and reach the adsorption-desorption equilibrium prior to illumination.The reaction temperature was kept at 25 C through cooling water circulation.During the test, 1 mL of the gaseous product was automatically extracted from the quartz chamber at a certain time interval and analyzed by gas chromatography (GC-6600) with a flame ionization detector (FID) equipped with a 5A molecular column.The reduction products were quantified on the basis of the external standard with a calibration curve.For stability experiments, the used photocatalyst was washed by water and dried to refresh and be re-evaluated by the procedure described above."
  },
  {
    "title": "Results_and_Discussion",
    "content": "XRD patterns were recorded to make clear the crystal structure and component of pure g-C 3 N 4 nanowires, NiO nanosheets, the NiO/g-C 3 N 4 composites and NC-3-MM.As shown in Fig. 1, single g-C 3 N 4 nanowires reveal two feature peaks at 13.1 and 27.6 .The peak at 13.1 is attributed to the (100) crystal plane corresponding to the triazine ring of g-C 3 N 4 (JCPDS No. 87-1256) 32.Besides, the peak at 27.6 is assigned to (002) crystal plane of the interlayer accumulation of aromatic systems in g-C 3 N 4 .For NiO nanosheets the diffraction peaks at 37.2 , 43.4 , 62.9 , 75.5 and 79.5 coincide well with the (111), ( 200), ( 220), ( 311) and (222) crystal lattice planes of cubic NiO phase (JCPDS No. 47-1049) 33,34.The NiO/g-C 3 N 4 complex materials display all the peaks of g-C 3 N 4 and NiO, proving that the composites are made up of NiO and g-C 3 N 4 .It is further observed that with the increasing NiO content in NiO/g-C 3 N 4 , the characteristic peaks belonged to NiO become stronger gradually, while those attributed to g-C 3 N 4 become weaker.Besides, the peak at 27.6 for NiO/g-C 3 N 4 samples slightly move to a higher value of 2 in comparison to g-C 3 N 4 (Fig. 1b), probably owing to the interface interaction between NiO nanosheets and g-C 3 N 4 nanowires 35,36.Moreover on the basis of the XRD curve of NC-3-MM, all diffraction peaks belong to g-C 3 N 4 and NiO, and no shift of diffraction peaks is found compared with pure g-C 3 N 4 and NiO.This further confirms the successful integration of g-C 3 N 4 and NiO in the composite, rather than the formation of a mechanical mixture. The morphology and surface micro-structures of g-C 3 N 4 , NiO and NC-3 were characterized in Fig. 2. It is revealed from the TEM image in Fig. 2a that g-C 3 N 4 consists of a large number of intertwined nanowires, which is further proved by HRTEM (Fig. 2b) and FESEM images (Fig. 2c).In Fig. 2d NiO exhibits the sheet-like nanostructure with a size of about 50 nm, which is easily to agglomerate with each other.For the NC-3 sample (Fig. 2e), the g-C 3 N 4 nanowires are uniformly distributed on lamellar structures of NiO nanosheets, indicating that the interwoven g-C 3 N 4 nanowires can be evenly dispersed over the NiO nanosheets in the composite.So the agglomeration of nanoparticles is effectively inhibited, which improves the dispersion of g-C 3 N 4 nanowires and NiO nanosheets.On the basis of the observation of HRTEM image (Fig. 2f), the lattice spacing of about 0.206 nm and 0.324 nm corresponds to the (200) crystal plane of NiO 37 and the (002) crystal plane of g-C 3 N 4 38, respectively.The interlaced fringes of the NiO/g-C 3 N 4 composites indicate that g-C 3 N 4 nanowires firmly join to NiO nanosheets, which is helpful for the photo-induced charge carriers to transport 39.Moreover, based on the investigation of the surface composition by the element mapping and EDS curve (Fig. S1), it is found that the NC-3 sample is composed of C, N, O and Ni elements, further confirming the XRD and HRTEM results.And the weight ratio of NiO and g-C 3 N 4 is close to 1:2 (inset in Fig. S1f), indicating that the NiO and g-C 3 N 4 aren't lost and are transformed into the composite after the heat treatment. The thermal decomposition performance of the specimens can be analyzed by TG measurement (Fig. 3).When the temperature gradually rises to 800 C, the weight loss of NiO nanosheets is hardly found 40.The g-C 3 N 4 nanowires have a sharp weight loss arising from about 450 C to 710 C, owing to its thermal decomposition 40.For the NiO/g-C 3 N 4 composites, the obvious weight loss in the range of 500-650 C reveals the thermal decomposition of g-C 3 N 4 nanowires.Therefore the contents of g-C 3 N 4 nanowires in the heterojunctions can be easily calculated from the corresponding mass loss over 800 C 41, which is well consistent with the feeding amount of g-C 3 N 4 (Table 1).The above TG results indicate that there is no loss of precursors during the synthesis of the composites. The FT-IR patterns of NiO nanosheets, g-C 3 N 4 nanowires, the NiO/g-C 3 N 4 composites and NC-3-MM were presented in Fig. 4. Single g-C 3 N 4 nanowires show the main feature absorption at 810.4, 1200-1700 and 3000-3400 cm -1 .Among them, the peak at 810.4 cm -1 correlates to the bending vibration of triazine units 42; the broad absorption at 1200-1700 cm -1 is attributed to the stretching vibration of the aromatic C-N heterocyclic ring 43; the absorption band of 3000-3400 cm -1 can be assigned to the stretching vibration of O-H and N-H groups from surface adsorbed water and unpolymerized amino groups 44.For NiO nanosheets, the absorption peak near 424.0 cm -1 is from the stretching vibration of Ni-O bond 45; the wide absorption centered at 3450 cm -1 belongs to the stretching vibration of O-H bond, caused by adsorbed water 46.The NiO/g-C 3 N 4 composites have the FT-IR spectra similar to g-C 3 N 4 nanowires, indicating that the composites still keep the structure integrity of g-C 3 N 4 nanowires after heat treatment.The vibration band at 424.0 cm -1 attributed to NiO nanosheets is gradually found with the increasing NiO content in the composites and shifts to a higher wavenumber.All the absorption bands of g-C 3 N 4 nanowires can be also found in NC-3-MM, and there is no shift of vibration band compared with pure g-C 3 N 4 nanowires.But the vibration band at 424.0 cm -1 isn't observed, which may be due to the fact that more g-C 3 N 4 nanosheets obscure the absorption band of single NiO nanosheets because of the physical mixing of g-C 3 N 4 and NiO.The above result indicates that g-C 3 N 4 nanowires interact with NiO nanosheets through hydrogen bonding or electrostatic interaction 47.Hence the NiO/g-C 3 N 4 heterojunctions have been successfully constructed at their interface, rather than simply stacked together. Generally speaking, the catalyst with the large specific surface area can possess more adsorption and active sites, possibly resulting in high catalytic properties.The N 2 adsorption-desorption isotherm of NC-3 in Fig. 5 is recognized as the type IV one with a H3 hysteresis loop at the relative pressure (P/P 0 ) from 0.40 to 0.95, meaning the existence of mesopores 40,48.The g-C 3 N 4 nanowires and NiO nanosheets display the N 2 adsorption-desorption isotherms similar to that of NC-3 (Fig. S2).According to the BJH approach (inset of Fig. 5), the pore diameters of NC-3 are primarily partitioned into two sorts.One is the mesopore at about 5.0 nm from the surface structure of the sample that may be due to gas escape during heat treatment.The other is the micropore of 30-110 nm, due to the disordered aggregation of nanoparticles.As summarized in Table 2, compared with pure NiO nanosheets (S BET 14 13.94 m 2 g -1 ), the NiO/g-C 3 N 4 photocatalysts display a sharp increase in specific surface area and pore volume, and a significant decrease in pore size, which can be further confirmed by Fig. S1.And it becomes larger with the increasing g-C 3 N 4 content, which leads to more reaction active sites in the samples.At the same time the CO 2 adsorption over various samples (Fig. S3) indicates the potential application of NC-3 in the photocatalytic CO 2 reduction.The results are in line with BET analysis discussed above. For the purpose of further make clear the chemical composition and bonding configuration of the photocatalysts, g-C 3 N 4 nanowires, NiO nanosheets, NC-3 and NC-3-MM were investigated by XPS spectra.The C and N elements exist in g-C 3 N 4 , NC-3 and NC-3-MM, and Ni and O elements are discovered in NiO, NC-3 and NC-3-MM (Fig. 6a and Fig. S4).In C 1s spectrum of g-C 3 N 4 (Fig. 6b), the peaks at 284.9 and 288.2 eV belong to C-C bonds and sp 2 hybridized carbon in the aromatic ring attached to the sp 2 N-C--N bonds, respectively 49,50.For N 1s in g-C 3 N 4 (Fig. 6c), the dominant peak near 398.7 eV is attributed to the sp 2 -hybridized aromatic nitrogen in triazine rings (C-N--C), while the peak at 399.8 eV belongs to the tertiary nitrogen N-(C) 3 groups 49.The weak peak at 401.1 eV assigns to amino functions (C-N-H) from the incomplete condensation of poly(tri-s-triazine) structures 49.For Ni 2p in NiO (Fig. 6d), there are five typical characteristic peaks in the range between 850 eV and 880 eV.The peaks at 853.5 eV and 872.2 eV correspond to Ni 2p 3/2 and Ni 2p 1/2 , respectively, indicating the existence of Ni 2 in NiO and Ni(OH) 2 51.52.The cleavage peak of Ni 2p 3/2 near 855.5 eV is assigned to the coexistence of Ni 2 O 3 52.In addition, the other two satellite peaks at about 860.7 and 878.9 eV are caused by shake-up 52.The characteristic peaks of N 1s, C 1s and Ni 2p in NC-3 have a slight shift compared with those of NiO and g-C 3 N 4 , attributing to the electron concentration difference arising from the electron transfer and interfacial interaction in the p-n heterojunctions 53.Furthermore, all the variation in the binding energies of C 1s, N 1s and Ni 2p can be recorded in NC-3-MM (Fig. S4), and there is almost no shift of binding energy due to the physical mixing of g-C 3 N 4 nanowires and NiO nanosheets.The above result proves that the NiO/g-C 3 N 4 photocatalysts aren't the mechanical mixture of NiO and g-C 3 N 4 , which is in line with HRTEM, XRD and FT-IR analysis discussed above. The BET specific surface area, pore volume, average pore size and band gap energy of g-C 3 N 4 nanowires, NiO nanosheets and the composites. Fig. 7a exhibits the UV-vis spectra of NiO nanosheets, g-C 3 N 4 nanowires and the composites in the range of 250-800 nm.Single NiO nanosheets display its intrinsic band gap absorption of NiO at wavelength of about 305 nm 52.However, single g-C 3 N 4 nanowires show an absorption edge situated at visible light range as presented.Furthermore, compared with NiO nanosheets and g-C 3 N 4 nanowires, the NiO/g-C 3 N 4 photocatalysts exhibit a red shift of the absorption edge, indicating the strong visible light response 54.The band gaps of NiO and g-C 3 N 4 could be reckoned from the formula (hv) 14 A(hv-E g ) n/2 55.Moreover, the n value is dependent on the transition type of the semiconductor.And n 14 1 represents a direct transition, while n 14 4 means an indirect transition 55.The n value for g-C 3 N 4 and NiO is 4 and 1, respectively.According to the above equation, the band gap energies of pure g-C 3 N 4 nanowires and NiO nanosheets are 2.75 eV and 3.46 eV (Fig. 7b) 40,52, respectively.Moreover on basis on the Tauc plots of the NiO/g-C 3 N 4 photocatalysts, the band gap energies of the composites are shifted to a more visible region with the increasing content of g-C 3 N 4 nanowires (Table 2), leading to more efficient use of visible light.For NC-3, the band gap energy is estimated to be 2.98 eV.The low band gap can promote the excitation of more electrons under irradiation, which may be beneficial to enhance the photocatalytic activity. The catalytic activities of CO 2 reduction over various photocatalysts were studied under simulated sunlight irradiation (Fig. 8).The primary products of the reduction reaction detected are CO and CH 4 .Some control experiments were carried out.No product is detected without any catalyst.When the reaction time is 3 h in the absence of light, the yield of CO and CH 4 is very low and about 0.52 and 0.07 mol g -1 (Fig. 8a).When nitrogen is used instead of CO 2 , no reaction products can be detected.Based on the above control experiments, it is proved that both light and catalyst play a significant effect on the photocatalytic reduction of CO 2 , and the products of CO and CH 4 are from the reduction product of CO 2 during the photocatalytic reaction.In Fig. 8a, the yield of CO and CH 4 over NC-3 is 3.0 and 8.8 times of NiO nanosheets, and 2.2 and 3.5 times of g-C 3 N 4 nanowires, respectively.The NiO/g-C 3 N 4 composites exhibit the higher photocatalytic activity of CO 2 reduction than single NiO nanosheets as well as g-C 3 N 4 nanowires.It indicates that the enhanced photocatalytic performance is not only due to the increase of specific surface area.The yields of CO and CH 4 assisted by NC-3 are 1.5 and 2.9 times of NC-3-MM, proving the existence of interaction between NiO nanosheets and g-C 3 N 4 nanowires.The formation of the NiO/g-C 3 N 4 heterojunctions in NC-3 inhibits the recombination of photo-generated charges thus leads to an increasing yield of CO and CH 4 . The component contents in the composites have an important effect on the photocatalytic CO 2 reduction under simulated sunlight (Fig. 8b).In contrast with single NiO nanosheets and g-C 3 N 4 nanowires, the NiO/g-C 3 N 4 materials reveal a higher CO and CH 4 yields as a per unit irradiation time, which may be associated with the inhibited recombination of photo-generated electrons and holes.With the increasing g-C 3 N 4 in the samples the production rates of CO and CH 4 first go up and then down, possibly due to the fact that the excess g-C 3 N 4 nanowires cover the active sites of the reaction or act as the recombination center of the charge carriers.With the increasing illumination, the CO and CH 4 yields become larger (Fig. S5).After the irradiation of 3 h, the NC-3 photocatalyst displays the highest yield rate, that is 2.75 and 1.79 molh -1 g -1 for CO and CH 4 , which is 3.2 and 8.1 times of NiO nanosheets, and 2.6 and 2.9 times of g-C 3 N 4 nanowires, respectively.And TON calculated from the reaction electron number of NC-3 is 19.82, which is much higher than other photocatalysts (Fig. 8c).When the g-C 3 N 4 nanowires are combined with NiO nanosheets, the CH 4 selectivity for the NiO/g-C 3 N 4 heterostructures is more than 60, which is significantly higher than that of single NiO nanosheets (Fig. 8d).Therefore it is clearly found that the NiO/g-C 3 N 4 heterojunctions with suitable content ratio can raise the conversion of CO 2 and selectivity of CH 4 . To prove the photocatalytic performance of the as-synthesized NiO/g-C 3 N 4 heterojunctions, the catalytic reduction properties of CO 2 using similar photocatalysts were compared in Table S1.Various composite photocatalysts can effectively convert CO 2 to corresponding products under their own catalytic conditions.Compared with other composites, the as-prepared NiO/g-C 3 N 4 heterojunctions with the yield rates of 2.75 and 1.79 molh -1 g -1 for CO and CH 4 exhibit satisfactory photocatalytic performance of CO 2 , indicating superior candidate as the sunlight photocatalyst. The photocatalytic stability test of NC-3 was shown in Fig. 9.After five successive experimental runs, about 89 and 96 of CO and CH 4 original activity remained over NC-3.The photocatalytic CH 4 evolution It is proved by XRD that there is no significant change in the crystal structure of the recycled catalyst (Fig. S6). To evaluate the interfacial separation and transfer of photo-generated charges, PL spectra of NiO nanosheets, g-C 3 N 4 nanowires as well as the composites were recorded in Fig. 10.For g-C 3 N 4 nanowires, a strong emission peak at 453 nm is attributed to its characteristic peak 54,56, indicating the rapid recombination of photo-induced charges.The NiO/g-C 3 N 4 photocatalysts show a weaker emission than g-C 3 N 4 nanowires from the p-n junction effect in the composite.It reveals that NiO/g-C 3 N 4 could promote effectively the separation of photo-generated electrons and holes.With the increasing NiO content in the composites, the PL intensity first goes down and then up.So the NC-3 composite exhibits the lowest PL peak intensity.In addition, a faintest emission of NiO is hardly found, possibly from flaws or surface oxygen vacancies of NiO 34.The PL results prove that the existence of p-n heterojunctions in NiO/g-C 3 N 4 could stimulate the separation and transfer of photo-excited charges, helpful to improve the photocatalytic CO 2 reduction. The advanced efficiency in charge separation and transmission was further certified via the transient photocurrent responses for NiO nanosheets, g-C 3 N 4 nanowires and the NiO/g-C 3 N 4 composites.The photocurrent was recorded by turning on and off the light source for several cycles, as described in Fig. 11a.Apparently, the NiO/g-C 3 N 4 composites reveal notably increase of photocurrent response compared to single g-C 3 N 4 nanowires and NiO nanosheets.NC-3 shows the largest photocurrent density and longest life of charge carriers, indicating the highest charge separation efficiency 57.For the Nyquist plots in Fig. 11b, all the samples show the smaller arc radius under illumination, indicating the small charge transfer resistance and fast charge-transfer rate.Compared with g-C 3 N 4 nanowires and NiO nanosheets, the Nyquist plot of NC-3 has the smallest arc radius, meaning the lowest charge transfer resistance 58.The above electrochemical experimental results suggest the more efficient charge transfer and separation over NC-3 under light illumination, helpful to enhance the photocatalytic reduction of CO 2 . According to the M A S plots and VB-XPS curves of pure g-C 3 N 4 nanowires and NiO nanosheets, the exact edge position of the band was further confirmed.Fig. 12a andb presents that the positive slope in the M A S curve of g-C 3 N 4 implies the n-type semiconductor feature 52,59, while the negative slope for NiO means the typical characteristics of p-type semiconductor 52.According to the M A S curve, the flat band potential (E f ) is -0.69 and 0.85 V (vs.Ag/AgCl) for g-C 3 N 4 and NiO, respectively.Using the equation 60,61, where E (Ag/AgCl) is 0.1989 eV and pH value is 7, the flat-band potentials of g-C 3 N 4 and NiO are -0.08 and 1.46 V (vs.NHE), respectively.The energy gap between VB edge level of photocatalyst and Fermi level (E f ) acquired by VB-XPS 62 is 2.24 eV for g-C 3 N 4 and 0.22 eV for NiO (Fig. 12c andd).Thus, it is calculated that the VB potential of g-C 3 N 4 and NiO are 2.16 and 1.68 V (vs.NHE), respectively.Furthermore, based on the equation E g 14 E VB -E CB , the conduction band (CB) of NiO and g-C 3 N 4 is calculated to be -1.78 and -0.59 V (vs.NHE), respectively. Based on the above calculation, the energy band structure for NiO/g-C 3 N 4 was proposed in Fig. 13.The excited electrons could transfer from VB to CB over NiO nanosheets and g-C 3 N 4 nanowires under sunlight.Meantime the photo-induced holes would prefer to remain the VB of NiO and g-C 3 N 4 .Because NiO nanosheets have more negative CB and VB potential than g-C 3 N 4 nanowires, by the internal electric field the photogenerated electrons on CB tent to jump from NiO to g-C 3 N 4 , while the Meanwhile, the ESR trapping technique was employed to further detect the existence of OH radicals in the reaction over NC-3.Fig. 14 shows the obvious signal of OH under illumination in ESR spectrum, indicating the generation of OH active species during the photocatalysis 63,64 Fig. 1.XRD patterns (a) and the dominant (002) peak of g-C 3 N 4 nanowires, NiO nanosheets, the NiO/g-C 3 N 4 composites and NC-3-MM. Fig. 2. TEM (a), HRTEM (b) and FESEM (c) images of g-C 3 N 4 nanowires, TEM images of NiO nanosheets (d) and NC-3 (e), and HRTEM image of NC-3 (f). Fig. 3. TG curves of g-C 3 N 4 nanowires, NiO nanosheets and the composites. Fig. 4. FT-IR spectra of g-C 3 N 4 nanowires, NiO nanosheets, the NiO/g-C 3 N 4 composites and NC-3-MM. Fig. 5. Nitrogen adsorption-desorption isotherm and pore size distribution (inset) of NC-3. Fig. 6.XPS survey spectra (a), C 1s (b), N 1s (c) and Ni 2p (d) XPS spectra of g-C 3 N 4 nanowires, NiO nanosheets and NC-3. Fig. 7. UV-vis spectra (a) and Tauc plots (b) of g-C 3 N 4 nanowires, NiO nanosheets and the composites. Fig. 8. (a) CO and CH 4 yield for various photocatalysts in 3 h; (b) production rate of CO and CH 4 , (c) TON and (d) selectivity for g-C 3 N 4 nanowires, NiO nanosheets and the composites. Fig. 9. Recycling experiments of photocatalytic reduction of CO 2 over NC-3. Fig. 10.PL spectra of g-C 3 N 4 nanowires, NiO nanosheets and the composites. Fig. 11.(a) Transient photocurrent response of g-C 3 N 4 nanowires, NiO nanosheets and the composites and (b) EIS Nyquist plots of g-C 3 N 4 nanowires, NiO nanosheets and NC-3. . As the n-type visible-light responsive semiconductor, g-C 3 N 4 nanowires with the large specific surface area were used to construct p-n heterojunctions with p-type NiO in order to develop the photocatalytic CO 2 reduction.The NiO/g-C 3 N 4 heterojunctions can effectively inhibit the aggregation of single component nanoparticles and produce more adsorption and active sites.Compared with NiO nanosheets and g-C 3 N 4 nanowires, the NiO/g-C 3 N 4 compounds can make CO 2 molecules more efficiently reduced to CO and CH 4 .When the weight ratio of NiO and g- Fig. 12. M A S plots (a, b) and VB-XPS spectra (c, d) of g-C 3 N 4 nanowires (a, c) and NiO nanosheets (b, d). Fig. 13.Photocatalytic reduction mechanism of CO 2 over NC-3. Fig. 14.DMPO spin-trapping ESR spectrum recorded for OH over NC-3. The g-C 3 N 4 content of various samples. This work was supported by National Natural Science Foundation of China (NSFC, grant Nos.51372154 and 20901051) and Natural Science Foundation of Zhejiang Province of China (grant No. LY21B010005). C 3 N 4 is 2.5:5, the NiO/g-C 3 N 4 composite presents the highest yield rates of CO and CH 4 under simulated sunlight, which is 3.2 and 8.1 times of single NiO nanosheets, and 2.6 and 2.9 times of single g-C 3 N 4 nanowires, respectively.The NiO/g-C 3 N 4 p-n junction can promote the separation of photo-generated electron-hole pairs, thus effectively improving the photocatalytic conversion of CO 2 .This work reveals the potential application of NiO/g-C 3 N 4 heterojunctions in photocatalytic CO 2 conversion to fuel, which can provide a possible approach to design the novel photocatalysts. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Supplementary data to this article can be found online at https://do i.org/10.1016/j.jssc.2022.122878."
  },
  {
    "title": "Conclusions",
    "content": ""
  }
]